[{"author": "_J0FF_", "body": "I really want to be able to speak the clear Romanian cause it's a relly nice language, but I just don't need it, so it's really difficult to learn something when you don't know what are you doing this for\n\nRussian is *davvero* a beautiful language, so it's just depressing that the orders to bomb our cities are given on this beautiful language... a controversial issue actually", "created_utc": "1661979153.0", "edited": "False", "id": "imkmdja", "is_submitter": "False", "link_id": "t3_x2f6hx", "parent_id": "t1_imkkrbd", "score": "4", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "_J0FF_", "body": "Kinda because I live in a small town in Ukraine, where Romanian is spoken. So, basically it's the Romanian language, but you can speak with words from the Russian or the Ukrainian language and everyone will understand you, so my grammar is perfect, but the vocabulary is very bad, so I just don't know, I can't name myself a native of Romanian, even though it's my mother tongue\n\nSadly because of the war Russia started. That's really sad to see what people say about you, about your country and understand them, and understand that you was able to watch the English content when you got the internet and not be able to understand them now. I'm really thankful to Russian language because I can read russian classic literature (and the Witcher 3 voice-over is the best). But now I blame myself because I could be a native of English or any other language", "created_utc": "1661977818.0", "edited": "False", "id": "imkiuol", "is_submitter": "False", "link_id": "t3_x2f6hx", "parent_id": "t1_imkdr8r", "score": "7", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "_J0FF_", "body": "Only right answers lol", "created_utc": "1661977032.0", "edited": "False", "id": "imkgqa0", "is_submitter": "False", "link_id": "t3_x2f6hx", "parent_id": "t1_imkejbd", "score": "11", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "_J0FF_", "body": "Oh, didn't know. Thank you", "created_utc": "1661961411.0", "edited": "False", "id": "imjbo45", "is_submitter": "False", "link_id": "t3_x2f6hx", "parent_id": "t1_imjbddd", "score": "5", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "_J0FF_", "body": "What does N4 mean?", "created_utc": "1661961013.0", "edited": "False", "id": "imjamuh", "is_submitter": "False", "link_id": "t3_x2f6hx", "parent_id": "t1_imj0e31", "score": "11", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "_J0FF_", "body": "The Witcher, Assassin's creed, and Morrowind with Oblivion", "created_utc": "1661930728.0", "edited": "False", "id": "imhsn3y", "is_submitter": "False", "link_id": "t3_x1yj80", "parent_id": "t3_x1yj80", "score": "1", "subreddit": "infp", "subreddit_id": "t5_2qn2o"}, {"author": "_J0FF_", "body": "I swear that person doesn't either. Often people say offensive things that relate to themselves to other people", "created_utc": "1661247676.0", "edited": "False", "id": "ilfoqia", "is_submitter": "False", "link_id": "t3_wvic3y", "parent_id": "t1_ilfl3gg", "score": "2", "subreddit": "infp", "subreddit_id": "t5_2qn2o"}, {"author": "_J0FF_", "body": "But they could add some new quests, armors, or smth in the game, it's pretty possible that they will be even on ps4", "created_utc": "1660063642.0", "edited": "False", "id": "ijlmuj0", "is_submitter": "False", "link_id": "t3_wk17j0", "parent_id": "t1_ijlmi83", "score": "1", "subreddit": "witcher", "subreddit_id": "t5_2sebi"}, {"author": "_J0FF_", "body": "Well, it's next gen upgrade, I think this imply that it's an upgrade for the next gen consoles", "created_utc": "1660063513.0", "edited": "False", "id": "ijlmi83", "is_submitter": "False", "link_id": "t3_wk17j0", "parent_id": "t1_ijl5npc", "score": "7", "subreddit": "witcher", "subreddit_id": "t5_2sebi"}, {"author": "_J0FF_", "body": "Don't think so, maybe some of them that change the graphic, but not many of them. At least I hope so", "created_utc": "1660063345.0", "edited": "False", "id": "ijlm1xk", "is_submitter": "False", "link_id": "t3_wk17j0", "parent_id": "t1_ijkmlpn", "score": "2", "subreddit": "witcher", "subreddit_id": "t5_2sebi"}, {"author": "_J0FF_", "body": "Same bro. But TW1 need a remake, not remastered, the game is old not only because of its graphic, but also because of the gameplay, game design and many other things. I don't want CDPR to make a small team that would make the remake, Rockstar showed us it's not the best idea. It's better to wait ant get a nice remake than get it now, but worse. This game really deserve a remake like Mafia or Resident Evil 2", "created_utc": "1660047563.0", "edited": "False", "id": "ijkjwg2", "is_submitter": "False", "link_id": "t3_wk17j0", "parent_id": "t1_ijkitg3", "score": "124", "subreddit": "witcher", "subreddit_id": "t5_2sebi"}, {"author": "_J0FF_", "body": "Thqnks a lot", "created_utc": "1659887347.0", "edited": "False", "id": "ijbn0hl", "is_submitter": "False", "link_id": "t3_wi0nrl", "parent_id": "t1_ijbms5j", "score": "1", "subreddit": "witcher", "subreddit_id": "t5_2sebi"}, {"author": "_J0FF_", "body": "Thank you. Also, could you tell me the mod for the Geralt's hair, it looks marvelous", "created_utc": "1659885469.0", "edited": "False", "id": "ijbikka", "is_submitter": "False", "link_id": "t3_wi0nrl", "parent_id": "t1_ijauql5", "score": "2", "subreddit": "witcher", "subreddit_id": "t5_2sebi"}, {"author": "_J0FF_", "body": "What mods are you using? The game looks like it's remastered", "created_utc": "1659861029.0", "edited": "False", "id": "ijaf470", "is_submitter": "False", "link_id": "t3_wi0nrl", "parent_id": "t3_wi0nrl", "score": "6", "subreddit": "witcher", "subreddit_id": "t5_2sebi"}, {"author": "_J0FF_", "body": "There's also a mod that delete the levels in the game at all. I'd say it's even better despite it's harder to realize. So, instead of hundreds of swords and armory, we'd have less of them, but higher-quality, and more customization for them", "created_utc": "1659456210.0", "edited": "False", "id": "iinpn6v", "is_submitter": "False", "link_id": "t3_we8wh5", "parent_id": "t3_we8wh5", "score": "5", "subreddit": "Witcher4", "subreddit_id": "t5_3d37s"}, {"author": "_J0FF_", "body": "But I think you'll agree that it still looks good, even after almost 4 years", "created_utc": "1658154741.0", "edited": "False", "id": "ignadxm", "is_submitter": "False", "link_id": "t3_w161xf", "parent_id": "t1_igmd8yl", "score": "1", "subreddit": "Witcher4", "subreddit_id": "t5_3d37s"}, {"author": "_J0FF_", "body": "He's already answered why. Check out the comments there", "created_utc": "1657180558.0", "edited": "False", "id": "if6jtl3", "is_submitter": "False", "link_id": "t3_vs5p5q", "parent_id": "t1_if31ta5", "score": "3", "subreddit": "Witcher4", "subreddit_id": "t5_3d37s"}, {"author": "_J0FF_", "body": "I kinda do like this too. But I also write some short stories that include the words I wrote down recently. That's not really a way of learning vocabulary, just a hobby, I think. However, this helps me overcome the fear of making errors, and improve my fluency cuz I actually use the language, and not only listen, or read", "created_utc": "1656719956.0", "edited": "False", "id": "ieinrc7", "is_submitter": "False", "link_id": "t3_vpahaq", "parent_id": "t1_ieiijt5", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "_J0FF_", "body": "I think many mechanics from RDR2 would be great for the new witcher. BUT, RDR2 was made in about 8 years by a team of 2000 - 5000 people. And the next witcher is the first game of CDPR on Unreal Engine, I think they should concentrate on some other things, but not on horse manipulation. I'd say, it's better to keep this to the second game of the saga", "created_utc": "1655508389.0", "edited": "1655551080.0", "id": "icruxvj", "is_submitter": "False", "link_id": "t3_vemq6l", "parent_id": "t3_vemq6l", "score": "1", "subreddit": "Witcher4", "subreddit_id": "t5_3d37s"}, {"author": "_J0FF_", "body": "Well, about creating character I agree, and we're not the only ones who don't want it. Of course, Lynx's school doesn't indicate that this'll be there, so I hope creation of character will not have any place in the next witcher saga.\n\nBut I disagree about the cat school and the young Vesemir. School of Lynx was confirmed, so it's not the cat school, and is one of the reasons why the territory will not, probably, be the Northern realms. We know a lot of witcher schools from TW3, but we didn't hear anything about the school of Lynx. So, or the territory won't be the Northern realms, or the events will be in the future, what's a nonsense because even in books witchers haven't had many contracts, so after the W3 they aren't needed. Young Vesemir  isn't the best idea too, because we'd know abou tltge Lynx school, and it's an already written story (Nightmare of the wolf), so why would they want to repeat?", "created_utc": "1653638471.0", "edited": "False", "id": "ia63w0c", "is_submitter": "False", "link_id": "t3_uyq0yo", "parent_id": "t3_uyq0yo", "score": "7", "subreddit": "Witcher4", "subreddit_id": "t5_3d37s"}, {"author": "_J0FF_", "body": "Btw, why nobody has said about OST? I still listen to soundtracks from the entire trilogy, and I hope the OST in the next game will be at the same level as in the previous games", "created_utc": "1652795964.0", "edited": "False", "id": "i8y3baq", "is_submitter": "False", "link_id": "t3_upngec", "parent_id": "t3_upngec", "score": "1", "subreddit": "Witcher4", "subreddit_id": "t5_3d37s"}, {"author": "_J0FF_", "body": "I don't want prequel, and even sequel. I mean, I would mind if the next game is prequel, or sequel, but I hope the story will be absolutely separated of the story we had in books, and games. Just a wish of mine", "created_utc": "1652646503.0", "edited": "False", "id": "i8qjccx", "is_submitter": "True", "link_id": "t3_upojbv", "parent_id": "t1_i8qi9ln", "score": "1", "subreddit": "Witcher4", "subreddit_id": "t5_3d37s"}, {"author": "_J0FF_", "body": "True about fast travel. The fast travel as in RDR2 would be great, it still is there, but isn't obvious, and even needed", "created_utc": "1652645486.0", "edited": "False", "id": "i8qh1m3", "is_submitter": "False", "link_id": "t3_upngec", "parent_id": "t1_i8o022g", "score": "2", "subreddit": "Witcher4", "subreddit_id": "t5_3d37s"}, {"author": "_J0FF_", "body": "Agreed. In Cyberpunk that wasn't as bad because that's fucking Cyberpunk, and there this looks not as bad as it could in the witcher games", "created_utc": "1652641121.0", "edited": "False", "id": "i8q78k7", "is_submitter": "True", "link_id": "t3_upojbv", "parent_id": "t1_i8q0crc", "score": "1", "subreddit": "Witcher4", "subreddit_id": "t5_3d37s"}, {"author": "_J0FF_", "body": "I thought I'm the only one who don't like it. Cyberpunk experience was cool just because that was the first person game without 3rd person cutscenes, and you kinda feel that you're V, but I don't want to see this in a third person game, like Witcher", "created_utc": "1652640923.0", "edited": "False", "id": "i8q6ska", "is_submitter": "True", "link_id": "t3_upojbv", "parent_id": "t1_i8pd3s9", "score": "3", "subreddit": "Witcher4", "subreddit_id": "t5_3d37s"}, {"author": "_J0FF_", "body": "Fuck yeah. The camera in the whole trilogy was bad af. The most awful thing in camera was in w3 when Geralt and some things disappeared because of camera", "created_utc": "1652640654.0", "edited": "False", "id": "i8q66uw", "is_submitter": "True", "link_id": "t3_upojbv", "parent_id": "t1_i8oxbiq", "score": "1", "subreddit": "Witcher4", "subreddit_id": "t5_3d37s"}, {"author": "_J0FF_", "body": "I've writed about it in my first post recently. Plus a large number of people really don't want to see her there, so I guess it's not likely to happen.", "created_utc": "1652596332.0", "edited": "False", "id": "i8o28a6", "is_submitter": "True", "link_id": "t3_upojbv", "parent_id": "t1_i8nfjuf", "score": "1", "subreddit": "Witcher4", "subreddit_id": "t5_3d37s"}, {"author": "_J0FF_", "body": "Absolutely agreed. First time I've played the Witcher 3, I liked all of that small Ciri's story, but at second, and the next times I've started hating them and just skip all what I was able to skip. So yes, I think Ciri isn't the best main character for the next game", "created_utc": "1652595982.0", "edited": "1652604655.0", "id": "i8o1stl", "is_submitter": "True", "link_id": "t3_upojbv", "parent_id": "t1_i8mh7we", "score": "2", "subreddit": "Witcher4", "subreddit_id": "t5_3d37s"}, {"author": "_J0FF_", "body": "Yeah, transactions suck. But Cyberpunk gives me a shred of hope. If they want to add transactions, they would add them in Cyberpunk 100%. Same thing with their anti-DRM position; I mean, I'll buy the new game anyway, but that'd be unpleasant to change the position that fast", "created_utc": "1652595525.0", "edited": "False", "id": "i8o17ya", "is_submitter": "True", "link_id": "t3_upojbv", "parent_id": "t1_i8nlc9x", "score": "1", "subreddit": "Witcher4", "subreddit_id": "t5_3d37s"}, {"author": "_J0FF_", "body": "As I said, Ciri is too powerful at the end of the 3rd game. I'd not like to see in the next witcher saga battles of half-Gods, I'd better watch an anime to see those. And even if she create a new school of witchers, she'd still not be the best choice of MC, but a witcher of that school. \n\nSo, about her opening of the school, why wouldn't they can? Ciri don't know the secrets of witcher's creation, and I think nobody knows. I've read again my post and yes, I had forgotten to write about this. Why the location can't be Kovir and Poviss (and any of the Northern realms)? Because we would know about that school at least something if it has been existing before the events in games and books, and it's kinda silly to create a new witcher school after witcher 3 because there aren't a lot of work for witchers. Yes, it'd be possible if the world have suffered a global disaster, like a new conjunction of the spheres, but I don't think that's their idea for the new saga. Hope I've answered your question.", "created_utc": "1652348101.0", "edited": "False", "id": "i8aqk2y", "is_submitter": "True", "link_id": "t3_ugsqon", "parent_id": "t1_i85u9kw", "score": "1", "subreddit": "Witcher4", "subreddit_id": "t5_3d37s"}, {"author": "_J0FF_", "body": "I haven't played Skyrim, but what google showed is exactly what I've thought about. As I said in post, in the summer there could be hotter, and if the map is like an ellipse, at east might be something between snow and desert; a perfect place I think. Moreover, it (ellipse-like continent) also gives a possibility for going to Hakland, or Zerrikania in the next games of saga. \n\nBut you're still right, it's risky to make next game in a setting like this.", "created_utc": "1651563565.0", "edited": "False", "id": "i74tni2", "is_submitter": "True", "link_id": "t3_ugsqon", "parent_id": "t1_i74iw16", "score": "1", "subreddit": "Witcher4", "subreddit_id": "t5_3d37s"}, {"author": "_J0FF_", "body": "Yeah, Griffins are cool, but as you said, they might be too perfect for a main character. I'd like to see one of them at least like a friend of main character, like Eskel, or Vesemir.\n\nWinter Queen is a good idea. Tbh, she was the first person who I thought about when I've seen so much snow, but it's too difficult to realize, I think. At the moment of Geralt's \"death\" she's 100% dead, gwent said so. She is too powerful, Witcher isn't about battles between half-Gods, I would not like her as protagonist. But the idea is still good, and I bet cdpr would be able to make something with her.", "created_utc": "1651562149.0", "edited": "False", "id": "i74rzal", "is_submitter": "True", "link_id": "t3_ugsqon", "parent_id": "t1_i74im7f", "score": "1", "subreddit": "Witcher4", "subreddit_id": "t5_3d37s"}, {"author": "_J0FF_", "body": "For me Witcher 3 is something so... private that I don't want someone to ruin an experience like this in new Witcher game. Moreover, it's kinda hard to realize it, and it's just not needed. I'd like to see multiplayer in Witcher games. Playing with other players after the game ending on a big location would be great. Difficult question actually", "created_utc": "1651519007.0", "edited": "False", "id": "i72bv7c", "is_submitter": "False", "link_id": "t3_ugq2t7", "parent_id": "t3_ugq2t7", "score": "1", "subreddit": "Witcher4", "subreddit_id": "t5_3d37s"}]