[{"author": "_Mexican_Soda_", "body": "I honestly wouldn't say that there is linguistic discrimination. Most of the time I've seen people imitate other accents, are in the context of a joke they are telling, or as a way to imitate a friend of theirs, I've never seen someone genuinely make fun of an accent in a demeaning way.\n\nAs for the low prestige thing, I think it is not really due to the accent itself, but for the fact that the accent is an identifier. For example, in Mexico people tend to make fun of indigenous people and imitate their accent (such as the ones from Yucatan), but it is not because they are making fun of the accent itself, but because the accent is an identifier for indigenous people (which have been socially treated as inferior ever since the birth of this country) and that way other people can understand who they are making fun of.\n\nNot to say there is no discrimination in LATAM or other Spanish speaking countries, but I feel it is less because of their variety being perceived as \"inferior\" or \"uneducated\", but instead because LATAM people tend to have a lot of prejudice towards people from other LATAM countries and accents are a good way to identify which country someone is from.", "created_utc": "1666921455.0", "edited": "1666922533.0", "id": "iu2hke0", "is_submitter": "False", "link_id": "t3_yem95s", "parent_id": "t1_itzekbc", "score": "3", "subreddit": "linguistics", "subreddit_id": "t5_2qhos"}, {"author": "_Mexican_Soda_", "body": "I'll take it, pleaseeeeeeeeeeeeeeeeeeeeeeee", "created_utc": "1666466062.0", "edited": "False", "id": "itd74c1", "is_submitter": "False", "link_id": "t3_yarxvk", "parent_id": "t3_yarxvk", "score": "1", "subreddit": "rexorangecounty", "subreddit_id": "t5_3hrl6"}, {"author": "_Mexican_Soda_", "body": "Wait, how do you know what the morse code means? I have always tried looking for what the Morse Code at the end of American Eulogy said, but on most reddit threads they said things like \"I doesn't actually mean anything, it's just random letters\"", "created_utc": "1666324437.0", "edited": "False", "id": "it5vwmi", "is_submitter": "False", "link_id": "t3_y90xro", "parent_id": "t1_it38iio", "score": "0", "subreddit": "greenday", "subreddit_id": "t5_2snhx"}, {"author": "_Mexican_Soda_", "body": "I don't know, I've heard Americans (of all races) point out other's people's races all the time. My american white friends always say things like \"So this asian lady was on the supermarket the other day and...\" and my american black friends say things like \"So I was seating with this white guy on the bus last week and...\". I guess it is a really American thing, mostly cause I've never really seen people in other countries do that. I assume it is because Americans have a strange relationship with race, but who knows?", "created_utc": "1665714551.0", "edited": "False", "id": "is8ndk8", "is_submitter": "False", "link_id": "t3_y33v1n", "parent_id": "t1_is7ne6d", "score": "53", "subreddit": "PhilosophyMemes", "subreddit_id": "t5_2u0y3"}, {"author": "_Mexican_Soda_", "body": "Yeah, I find it particularly horrible for people to do those kinds of things in LATAM. Sometimes Americans underestimate how crucial knowing English is for your work resume, and the amount of doors it can open for you. Learning English in LATAM countries is really important, and a lot of people are desperate to learn it to a high level, but don't really know how. That's why I find it so horrible that people such as them are trying to prey on a really desperate population who is just trying to better their life opportunities, and who more often than not, do not have a lot of money to spend on, meaning spending money on courses like those becomes an investment for them, an investment that is destined to fail.", "created_utc": "1665026430.0", "edited": "False", "id": "ir8kqpj", "is_submitter": "False", "link_id": "t3_xwi0vp", "parent_id": "t1_ir6vb56", "score": "9", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "_Mexican_Soda_", "body": "Wait, why would calling a woman \"señorita\" getting you in trouble?", "created_utc": "1664934907.0", "edited": "False", "id": "ir3kegd", "is_submitter": "False", "link_id": "t3_xvs1ix", "parent_id": "t1_ir2yv6q", "score": "11", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "_Mexican_Soda_", "body": "Wait, sorry to bother you, but could you please explain what is the difference between Classical Nahuatl and Modern day Nahuatl?\n\nI've been interested in learning Nahuatl for quite some time by now, but the information about it is really scarce, and I really struggle to comprehend how Nahuatl works. From what I understand, Nahuatl is not a single language, but instead, an umbrella term for multiple indigenous languages, meaning that Nahuatl from Veracruz and Nahuatl from Puebla are not inteligible. Is this true? If so, that makes it really complicated because now I would have to choose what kind of Nahuatl to learn based on my region, but since I live in Northern Mexico, there really isn't any Nahuatl communities on my region, meaning I don't really have a motive for choosing a specific kind of Nahuatl.\n\nDoes mayan also work this way? From what I understand, Mayan is a bit more uniform, but again, I am completely ignorant about indigenous languages, and with all the misinformation on the internet, I get even more confused. \n\nAnyways, I guess my main question is: If I wanted to learn an indigenous language from Mexico, what would be the best dialect/language? I am judging based on the amount of people that speak the language, how uniform it is (as in, if it is intelligible between most states), and how many resources are there to learn it. Thanks!", "created_utc": "1664928666.0", "edited": "False", "id": "ir36y0q", "is_submitter": "False", "link_id": "t3_xvgnpc", "parent_id": "t1_ir2km01", "score": "5", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "_Mexican_Soda_", "body": "Ayo, send dm teaching how or something. I swear I've been trying to get Pimsleur courses for so long but I don't have the money or the knowledge to know how to sail the high seas", "created_utc": "1664640937.0", "edited": "False", "id": "iqn0t4j", "is_submitter": "False", "link_id": "t3_xsbfno", "parent_id": "t1_iqlohnv", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "_Mexican_Soda_", "body": "Where my Mexican femboys at?", "created_utc": "1664088980.0", "edited": "False", "id": "ipt97de", "is_submitter": "False", "link_id": "t3_xl9bsb", "parent_id": "t3_xl9bsb", "score": "1", "subreddit": "femboymemes", "subreddit_id": "t5_120xk3"}, {"author": "_Mexican_Soda_", "body": "Still a bad analogy haha.\n\nI don't know if this is common or not, but a lot of parents (especially back in the days) just threw their kids in a pond or something, and didn't touch them except if they started to drown. At least this is what my grandparents (from a coastal village in Mexico) and some friends claim to have done in order to learn how to swim.", "created_utc": "1663496429.0", "edited": "False", "id": "iowq1ft", "is_submitter": "False", "link_id": "t3_xgyvih", "parent_id": "t1_iown0sr", "score": "7", "subreddit": "LearnJapanese", "subreddit_id": "t5_2qyls"}, {"author": "_Mexican_Soda_", "body": "Just pick whatever you think is the best. Seriously, you will probably chose a better option for yourself than some random guys on reddit.\n\nAlso Uzbek is good", "created_utc": "1663493876.0", "edited": "False", "id": "iowmrgm", "is_submitter": "False", "link_id": "t3_xhbnsd", "parent_id": "t3_xhbnsd", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "_Mexican_Soda_", "body": "Seriously, I've always asked myself that. From what I understand, there is no one Nahuatl, but instead they are multiple different languages all under the umbrella term \"Nahuatl\". So from what I understand, Nahuatl from Northeast Puebla and Nahuatl from Central Veracruz are like Portuguese and Spanish.\n\nI really don't know why someone would learn Nahuatl, there are almost no resources, it looks like a pretty hard language, there are almost no speakers to practice with, and even if you manage to become fluent in it, you can only use it with people who live in a certain state because people from other states won't understand you. \n\nAnyone who is seriously learning Nahuatl has my automatic respect and admiration, because they go trough all that work just to connect with their roots/speak with family members.", "created_utc": "1663480120.0", "edited": "False", "id": "iow50nh", "is_submitter": "False", "link_id": "t3_xgvc8w", "parent_id": "t1_iow152m", "score": "26", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "_Mexican_Soda_", "body": "From what I've known they call illegal immigrants \"wetbacks\" because a lot of Mexicans cross the border by swimming trough the Rio Grande (el Rio Bravo). This also makes sense when you consider the Spanish version of the same word (\"Mojaditos\", which literally translates to \"Wet people\").", "created_utc": "1663373041.0", "edited": "False", "id": "ioqgos5", "is_submitter": "False", "link_id": "t3_xfwg9y", "parent_id": "t1_ioprdre", "score": "5", "subreddit": "tylerthecreator", "subreddit_id": "t5_2vez1"}, {"author": "_Mexican_Soda_", "body": "I can't speak for other languages, but that is very common at least here in Mexico. For the sake of comedy in a lot of programs you see Mexicans doing a \"Gringo\" accent since we have our fair share of American tourists in Mexico. There are two good examples that come up from the top of my head:\n\n&#x200B;\n\n*  The first one is the character \"Kelly\" from the kids show \"Bely y Beto\", who is supposed to be an American character and [therefore speaks with an American accent](https://www.youtube.com/watch?v=t-0onh0qUDo). I find this \"episode\" to be a pretty good example since not only you can hear \"Kelly\" speaking with an American accent, but you can hear both \"Kelly\" and \"Beto\" (whose actors don't speak English that well as you might have noticed) trying to imitate Americans when they speak English.\n* The second example is Molotov's song \"[Frijolero](https://i.ytimg.com/an_webp/8iJMOBcPQyg/mqdefault_6s.webp?du=3000&sqp=CLDzk5kG&rs=AOn4CLAH5JYyd_GjmaefeDxZNmL-CQ1nOA)\" (warning: for strong language/imagery) which is supposed to be a criticism of American xenophobia towards Mexico, and therefore the song is sung in an American accent.  In this song the accent is not as exaggerated as in the \"Bely y Beto\" episode, but it is still clearly distinguishable. \n\nI can also tell you that due to the large population of Chinese people in Mexico, it is also common for Mexicans imitate the [Chinese accent](https://youtu.be/8HFXmMZ-nmI). As you can notice in the first 15 seconds of the video, the most common trait of this accent is that they don't know how to pronounce the Spanish \"L\", so they instead pronounce it as \"L\". This is Characteristic is not common of Chinese people only however, and it is instead seen as a general \"Asian\" accent. It is commonly played for laughs, the most notable example being [chinguamiga](https://youtube.com/shorts/ik6-T5r-RR4?feature=share) (a really famous Korean influencer who lives in Mexico and makes comedy that accentuates the differences between Mexico and Korea).\n\nIt is also pretty usual to see people who live in Spanish speaking countries that share borders with other countries that speak a different language, imitate that accent for laughs. For example, my friend from Argentina used to imitate a Brazilian accent, my friend from Spain used to imitate a Moroccan accent, and in my hometown were there have recently been an increase in African immigrants, a lot of people imitate an \"African\" accent when speaking Spanish. These accents however, are only common to play for laughs between friends and it varies from region to region depending on the place you live in\n\nHope this helped!\n\nTL;DR: In Spanish it is really common to imitate American and Chinese accents for laughs, but there are also other accents such as Brazilian and Moroccan accents that are used in Spanish countries who share a border with other countries with different languages.", "created_utc": "1663372566.0", "edited": "False", "id": "ioqfpvo", "is_submitter": "False", "link_id": "t3_xfvjh7", "parent_id": "t3_xfvjh7", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "_Mexican_Soda_", "body": "Yeah, but financially it didn't do that well", "created_utc": "1663042936.0", "edited": "False", "id": "io7uft8", "is_submitter": "False", "link_id": "t3_xcvrna", "parent_id": "t1_io7ssip", "score": "3", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "_Mexican_Soda_", "body": "Well the main thing is that they closed the concert with Desert Song, a song many fans like and one that hadn't been played since 2008. Also since it was a special day for them, they played a lot of songs from their first two albums which hardcore fans really liked. It might have been the best set list of the tour.", "created_utc": "1663042461.0", "edited": "False", "id": "io7tlk4", "is_submitter": "False", "link_id": "t3_xcmygg", "parent_id": "t1_io7roqh", "score": "2", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "_Mexican_Soda_", "body": "Mexican food in the US is not really that good. It is pretty overpriced and 90% of the time it is super Americanized. \n\nAs a Mexican, I can tell you most Mexicans make fun of Americans for the way they prepare Mexican food. Hard shell tacos, nacho cheese on tacos, dorito tacos, etc. There's some who even get genuinely mad and are really passionate about their hate for Mexican-American food, but there's not really much to argue since we Mexicans also do stuff like putting jalapeño on our sushi (and the soy sauce) and putting Oaxaca cheese on our pizza (some people even put beans on it).", "created_utc": "1663037631.0", "edited": "False", "id": "io7jvlb", "is_submitter": "False", "link_id": "t3_xcp5ng", "parent_id": "t1_io6oe5x", "score": "0", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "_Mexican_Soda_", "body": "Saw them yesterday, their set list was AMAZING", "created_utc": "1663023100.0", "edited": "False", "id": "io6mur3", "is_submitter": "False", "link_id": "t3_xcmygg", "parent_id": "t1_io6hxfa", "score": "11", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "_Mexican_Soda_", "body": "True. Lowkey all of this doesn't apply at all if you live in a third world country. In these kind of countries, everybody is scared. There's almost equal odds of being victim of a violent crime because muggers and kidnappers won't care about your sex, they will only care about how much money they can steal from you/your family.", "created_utc": "1662869875.0", "edited": "False", "id": "iny43iw", "is_submitter": "False", "link_id": "t3_xam3zr", "parent_id": "t1_inwgzeh", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "_Mexican_Soda_", "body": "Dude I've been considering so hard learning Chinese, don't convince me to switch haha.\n\nFor real though, I feel like Chinese is infinitely more useful, might be easier to learn, Chinese people are nicer to language learners (Japan is somewhat xenophobic), and  I have Chinese ancestry. However, my sunken cost fallacy won't let me switch 😭", "created_utc": "1662864074.0", "edited": "False", "id": "inxswjy", "is_submitter": "False", "link_id": "t3_xaxbxd", "parent_id": "t1_inw9yrz", "score": "10", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "_Mexican_Soda_", "body": "[refold.la](https://refold.la)", "created_utc": "1662821050.0", "edited": "False", "id": "inv02dk", "is_submitter": "False", "link_id": "t3_xaoc1b", "parent_id": "t1_inumqr4", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "_Mexican_Soda_", "body": "Try [refold.la](https://refold.la), their method has been proven to work, has worked for me and my friends, and it's also 100% free!\n\nTry to also checkout r/languagelearning!", "created_utc": "1662820926.0", "edited": "False", "id": "inuzs2s", "is_submitter": "False", "link_id": "t3_xaoc1b", "parent_id": "t1_inul3r6", "score": "2", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "_Mexican_Soda_", "body": "Wait, is egg\\_irl toxic?! Don't tell me that, I've always thought it was super wholesome and I love visiting that sub 😭😭😭", "created_utc": "1662787276.0", "edited": "False", "id": "intm9lc", "is_submitter": "False", "link_id": "t3_xafr5b", "parent_id": "t1_intjxjv", "score": "11", "subreddit": "femboymemes", "subreddit_id": "t5_120xk3"}, {"author": "_Mexican_Soda_", "body": "Ayo, no need to bash men like that :c", "created_utc": "1662614690.0", "edited": "False", "id": "injx5zu", "is_submitter": "False", "link_id": "t3_x8dxw0", "parent_id": "t1_inissqy", "score": "1", "subreddit": "egg_irl", "subreddit_id": "t5_3n3op"}, {"author": "_Mexican_Soda_", "body": "Why is this so wholesome?", "created_utc": "1662532784.0", "edited": "False", "id": "inf49n8", "is_submitter": "False", "link_id": "t3_x61gxi", "parent_id": "t1_in5epcu", "score": "1", "subreddit": "femboymemes", "subreddit_id": "t5_120xk3"}, {"author": "_Mexican_Soda_", "body": "I am seriously thinking about dropping Japanese and switching to learning Portuguese instead. \n\nJapanese is just way too hard. I've been studying Japanese for the past 4 months, but I got to confess that I am not the most consistent person. I just kind of get an urge every other day, and whenever that happens I start learning Japanese, however, this is not an everyday thing and the methods I use vary a lot. I know that in order to learn a language you need consistency and discipline, but I don't have neither, so why am I attempting to learn a level 4 language when I'm not mature enough to have the consistency and discipline it takes? I have been trying to learn Japanese for the past 4 months, and I've learned almost nothing at all. My vocabulary is probably less than 200 words and I have almost zero knowledge of grammar. It's just demotivating seeing how you are not accomplishing anything and it is all because of your fault.\n\nI've been recently thinking though, that maybe I should try to study Portuguese. I am a native Spanish speaker, and when I read Portuguese I can understand almost 65% of it. When it is spoken it is notably harder (I only understand about a 25%), but even then that is a world of difference. It is insane to think that I have a better comprehension in Portuguese than I have in Japanese, without even having studied the language at all unlike Japanese! I feel like maybe if I get serious about Portuguese, immersed every day, studied 25 anki cards a day, and studied a good grammar book, I could get to C1 level in 8-9 months. Compared with Japanese, I would probably take 5 to 6 years to get to a C1 level if I did all of those things. \n\nNow, why do I think I would actually succeed in Portuguese if I can't manage to be consistent with Japanese? Well, I feel it is mostly because immersing in Portuguese would be much easier for me. My main problem with Japanese immersion is that I cannot understand absolutely anything, which gets insanely boring. However with Portuguese, I can at least already get the main gist of it, which is probably going to get my dopamine receptors working, and is it going to keep me more entertained, which in turn is gonna help me focus more. \n\nI don't know what to do, Portuguese is starting to seem so convincing right now, but I don't want to drop Japanese just because \"it is too hard\". I am a highschooler with a lot of free time, so I really have no excuse for it. I'm just lazy. \n\nAnyways, sorry for the overly long comment haha. It's late here and I got carried away.", "created_utc": "1662522910.0", "edited": "False", "id": "ineon1r", "is_submitter": "False", "link_id": "t3_x7srom", "parent_id": "t3_x7srom", "score": "9", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "_Mexican_Soda_", "body": "If you are a native English speaker, in that time you could have theoretically learned Spanish, Portuguese, French, Italian, Japanese, Russian, and Mandarin. \n\nHowever, I think the human brain can only handle 6 languages at most, and you would have to spend more than 120hrs a year trying to maintain them all. I also have like 5000+ hours in Tetris 99, so don't feel bad haha", "created_utc": "1662311832.0", "edited": "False", "id": "in2t4id", "is_submitter": "False", "link_id": "t3_x568o9", "parent_id": "t3_x568o9", "score": "1", "subreddit": "AnimalCrossing", "subreddit_id": "t5_2ro2c"}, {"author": "_Mexican_Soda_", "body": "What about Spanish to Portuguese? Would it still be 3 months?", "created_utc": "1662180562.0", "edited": "False", "id": "imw2tzz", "is_submitter": "False", "link_id": "t3_x4k54z", "parent_id": "t1_imvtv5e", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "_Mexican_Soda_", "body": "Yeah, I've heard about how the environment you record in is important which really worries me since my house has a lot of background noises, as well as my neighborhood. I've heard that some people go into their closet and record their audio there because apparently the more things there are in a room, the more sound is absorbed or something. Do you think just jumping inside of my closet would work? Thanks!", "created_utc": "1662159236.0", "edited": "False", "id": "imux3nl", "is_submitter": "True", "link_id": "t3_x4diix", "parent_id": "t1_imustc3", "score": "1", "subreddit": "NewTubers", "subreddit_id": "t5_2ujnz"}, {"author": "_Mexican_Soda_", "body": "Yeah, Chinese immigration in Mexico is a pretty interesting topic! I've done some research about it and have found a lot of books and essays on the internet about it. You should try searching, who knows what you could find!", "created_utc": "1661811830.0", "edited": "False", "id": "imba78g", "is_submitter": "True", "link_id": "t3_x02f52", "parent_id": "t1_im8847x", "score": "2", "subreddit": "Cantonese", "subreddit_id": "t5_2wxkd"}, {"author": "_Mexican_Soda_", "body": "Yeah, I've heard Pimsleur is a good resource for many languages, but the downside is that as a teenager, it's hard to get the money to buy stuff haha", "created_utc": "1661811706.0", "edited": "False", "id": "imb9x72", "is_submitter": "True", "link_id": "t3_x02f52", "parent_id": "t1_im8psr6", "score": "1", "subreddit": "Cantonese", "subreddit_id": "t5_2wxkd"}, {"author": "_Mexican_Soda_", "body": "Ah mira, que buena onda, gracias bro!\n\nEl tener recursos en español es algo muy util, en especial para los tonos y la pronunciación, ya que algunas veces mi pronunciación en ingles no es 100% exacta, así que sirve mejor como referencia el poder tener alguien que te pueda enseñar ese tipo de cosas en base a tu lengua materna. Es extraño jajaja, casi nunca puedo encontrar recursos en español para aprender idiomas, siempre tengo que buscar recursos en ingles. Pero pues que buena onda que también haya recursos en español. Gracias!", "created_utc": "1661811555.0", "edited": "False", "id": "imb9l3t", "is_submitter": "True", "link_id": "t3_x02f52", "parent_id": "t1_im8g2ms", "score": "1", "subreddit": "Cantonese", "subreddit_id": "t5_2wxkd"}, {"author": "_Mexican_Soda_", "body": "As I highschooler, I got motivated after reading this comment. Then I remembered I don't live in the USA and instead live in a third world country. Fuck.", "created_utc": "1661632292.0", "edited": "False", "id": "im1oa9y", "is_submitter": "False", "link_id": "t3_wz22fi", "parent_id": "t1_im0eq6h", "score": "11", "subreddit": "askphilosophy", "subreddit_id": "t5_2sc5r"}, {"author": "_Mexican_Soda_", "body": "Wait, could you give more insight as to why it isn't useful? I am genuinely curious!", "created_utc": "1661631602.0", "edited": "False", "id": "im1mp79", "is_submitter": "False", "link_id": "t3_wzavm7", "parent_id": "t1_im1dql9", "score": "36", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "_Mexican_Soda_", "body": "The dreaming in your language thing is so true!\n\nI learned English as a second language, and I spend a lot of time in the US (about 8hrs a day; I live in the Mexico-US border). I've never dreamed in English even once. Does that mean I'm not fluent or what?", "created_utc": "1661605246.0", "edited": "False", "id": "ilzx12p", "is_submitter": "False", "link_id": "t3_wc1nl4", "parent_id": "t1_iib22kb", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "_Mexican_Soda_", "body": "Does anybody know when they tickets are actually going on sale?", "created_utc": "1659983669.0", "edited": "False", "id": "ijh3ulk", "is_submitter": "False", "link_id": "t3_wjb1es", "parent_id": "t3_wjb1es", "score": "6", "subreddit": "popheads", "subreddit_id": "t5_39nwj"}, {"author": "_Mexican_Soda_", "body": "Idaten Jump.\n\nIt’s a bicycle anime made to sell toys, and it wasn’t popular anywhere. When I was young though, they passed that show on a Mexican TV channel and I used to watch it every single day, the thing is that I have never met a single person that has also watched the show. It’s kind of sad because it was part of my childhood but nobody seems to remember it. I thinks it’s also almost impossible to watch except for a few select episodes because nobody bothered to save them, so it’s almost like lost media at this point.", "created_utc": "1659283879.0", "edited": "False", "id": "iiea1il", "is_submitter": "False", "link_id": "t3_wc6v7t", "parent_id": "t3_wc6v7t", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "_Mexican_Soda_", "body": "Is this really considered short in America? \n\nIn Mexico being 1.72 would be considered to be somewhat above average, same in a lot of Asian countries. It always surprises me to see that in American standard being 1.75 and under is considered short haha", "created_utc": "1659202345.0", "edited": "False", "id": "iia3muj", "is_submitter": "False", "link_id": "t3_wba8i7", "parent_id": "t1_ii9xf2n", "score": "2", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "_Mexican_Soda_", "body": "Comment genuinely made me laugh, nice!", "created_utc": "1659156035.0", "edited": "False", "id": "ii7zzln", "is_submitter": "False", "link_id": "t3_wbcca4", "parent_id": "t1_ii6vjjr", "score": "5", "subreddit": "martialarts", "subreddit_id": "t5_2qkt4"}, {"author": "_Mexican_Soda_", "body": "Literally the post above you is that one the frick", "created_utc": "1659043417.0", "edited": "False", "id": "ii1lepi", "is_submitter": "False", "link_id": "t3_wafvm2", "parent_id": "t3_wafvm2", "score": "1", "subreddit": "PhilosophyMemes", "subreddit_id": "t5_2u0y3"}, {"author": "_Mexican_Soda_", "body": "We have so many slurs for homosexual men in Spanish for no reason 😭", "created_utc": "1658982767.0", "edited": "False", "id": "ihy8rvw", "is_submitter": "False", "link_id": "t3_w9c9ag", "parent_id": "t1_ihxjm5p", "score": "4", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "_Mexican_Soda_", "body": "Nah, hablar con la gente de Mexico es fácil bro, tenemos el español mas neutro.\n\nAhora, con los Chilenos dejémoslo ahí….", "created_utc": "1658899525.0", "edited": "False", "id": "ihtebwo", "is_submitter": "False", "link_id": "t3_vz5i60", "parent_id": "t1_ig9tz36", "score": "2", "subreddit": "femboymemes", "subreddit_id": "t5_120xk3"}, {"author": "_Mexican_Soda_", "body": "Thats the same question I’ve been asking myself. \n\nI’m not a native English speaker, but since I’ve been going to school in the US for the past 5 years, I’ve gotten pretty good at it. I can read philosophical texts (such as “Discourse on the Method” and “The myth of Sisyphus”) in English and I when we took the PSAT, I got the second highest English score in my class. I’m great at everything English, except for my accent…\n\nMy accent is notably Mexican, and it kind of stresses me. I’m 100% understandable, and people don’t really have to put effort in understanding me; however I’m still notably Mexican. If I were to speak with a random person on a phone, they would immediately know I’m Mexican. \n\nI would like to know if its worth trying to get rid of it, or if it’s even possible of getting rid of it. I mean, I speak and listen to only English 8hrs a day, and most of my entertainment (YouTube, Reddit, TikTok) is all in English (it wasn’t even a voluntary decision, English content is better than Spanish content so I don’t have any reason to watch Spanish content now), but even then I still can’t erase my accent.\n\nAnyways, thanks for coming to my TED talk!", "created_utc": "1658866957.0", "edited": "False", "id": "ihreyp8", "is_submitter": "False", "link_id": "t3_w89b0w", "parent_id": "t3_w89b0w", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "_Mexican_Soda_", "body": "The kid screaming “OH, HIRAGANA!” was so funny to me for no reason", "created_utc": "1658800451.0", "edited": "False", "id": "ihnsndh", "is_submitter": "False", "link_id": "t3_w7xpb3", "parent_id": "t1_ihncdfk", "score": "41", "subreddit": "LearnJapanese", "subreddit_id": "t5_2qyls"}, {"author": "_Mexican_Soda_", "body": "What is the name of this meme format? I’ve seen it a lot of times by now and find it pretty hilarious", "created_utc": "1658780014.0", "edited": "False", "id": "ihmft66", "is_submitter": "False", "link_id": "t3_w7mn7f", "parent_id": "t3_w7mn7f", "score": "7", "subreddit": "cowboybebop", "subreddit_id": "t5_2sn1i"}, {"author": "_Mexican_Soda_", "body": "Hi!\n\nI'm a bilingual (my native language is Spanish) who is also a beginning to learn Japanese, and I would like to share what I have found from my experience and by doing research.\n\nFor hiragana/katakana (also know as \"The kana\") I would recommend watching [this](https://www.youtube.com/watch?v=_wZHqOghvSs) JapanesePod101 video on the kana (Although JapanesePod101 is usually not recommended, this is a great video) and afterwards go to [DJT Kana](https://djtguide.neocities.org/kana/index.html) and just start practicing there until you have zero mistakes. You honestly shouldn't worry a lot about learning the kana, the average person will have a full grasp on them by day 3 and it really isn't that hard to learn.\n\nAfter this it starts getting a little more complicated because there are multiple ways you can go on about learning a language. For starters, I would suggest going to [refold](https://refold.la/) and reading the whole guide. It contains a lot of great information about how learning languages work, and it is overall a great guide.\n\nAfter reading refold you should also read [themoeway](https://learnjapanese.moe/guide/) guide, which is a guide that teaches you how to learn Japanese from scratch. I recommend this because it goes into more Japanese-specific detail than refold, and it is considered to be a good guide in the Japanese language learning community.\n\nAfter reading both of those guides, you're basically all set up on your way to learning Japanese. As an extra, I would also recommend subscribing to r/languagelearning and r/LearnJapanese since the two of them have more information and are also a pretty good places to find resources.\n\nNow, before you start learning Japanese, I would like to say a few things:\n\nFirst of all, remember that learning a language takes a massive amount of time. To learn Japanese, you will take about 2200 hours, so don't get demotivated and have reasonable expectations when it comes to how long your progress is going to take.\n\nI would also like to tell you to question everything you see and to think for yourself (yes, even this comment). There are lots of different methods and people claiming to have the most effective or the best way to learn a language. There are tons and tons of them, and more often than not they contradict each other, so your best option is to try to see what works best for yourself. Everybody works differently, and what might work for someone might not work for someone else, so don't try to waste precious study time by searching for the \"fastest\" or the \"most effective methods\", the most effective method is always going to be the one you actually do.\n\nAnd finally, just have fun man. Language learning can be a really cool and fun process, so try to make it pleasurable for yourself. If you get bored while learning a language, you are going to become more likely to drop it, so try to make it fun for yourself. Immerse in content that you like, watch the things you normally would but in Japanese, and just try to spend as much time as you can with the language. Even if you don't have time, watch five minutes of an anime without English subtitles or something. Remember that 5 minutes spent learning the language are always going to be better than 0 minutes.", "created_utc": "1658562020.0", "edited": "False", "id": "ihapzqy", "is_submitter": "False", "link_id": "t3_w5v5lr", "parent_id": "t3_w5v5lr", "score": "9", "subreddit": "IWantToLearn", "subreddit_id": "t5_2rjo5"}, {"author": "_Mexican_Soda_", "body": "Not OP and three years later, but he is most likely talking about the third generation GBA Pokemon games (Ruby/Sapphire/Emerald) in which there were certain caves with Morse code carved into their walls which gave you clues that lead you to finding special Pokemon (Regirock, Regice, Registeel)", "created_utc": "1658557705.0", "edited": "False", "id": "ihak8wv", "is_submitter": "False", "link_id": "t3_94doi9", "parent_id": "t1_e4cemp9", "score": "1", "subreddit": "1DaySkill", "subreddit_id": "t5_mbvb9"}, {"author": "_Mexican_Soda_", "body": "FOR FREE?!!!!", "created_utc": "1658556122.0", "edited": "False", "id": "ihai0cj", "is_submitter": "False", "link_id": "t3_w5o3yx", "parent_id": "t3_w5o3yx", "score": "15", "subreddit": "Cd_collectors", "subreddit_id": "t5_2uxz7"}, {"author": "_Mexican_Soda_", "body": "Justification and Practice", "created_utc": "1658534389.0", "edited": "False", "id": "ih9ceuf", "is_submitter": "False", "link_id": "t3_w5cd0p", "parent_id": "t3_w5cd0p", "score": "1", "subreddit": "PhilosophyMemes", "subreddit_id": "t5_2u0y3"}, {"author": "_Mexican_Soda_", "body": "In my experience, it depends a lot in the school, but it does males sense to me.\n\nSome schools just have a horrible English program. For example, English in Mexican public schools is laughably bad. You are getting teached by teachers who most of the time don't have a level higher than B1, and probably learned by working at a factory with people who got deported from the US or something similar (as was the case with my English teacher in middle school). They also repeat the same course every year, meaning 6th, 7th, and 8th grade English are all the same course in which they show you how to present yourself, how to ask to go to the restroom, and how to say things like colors, numbers, and animals.\n\nSure, it might lean you into the right direction, but 95% of my classmates got a 100 on those classes and still aren't able to say more than 30 words. Now, this was in a decent public school in an decent neighborhood, now imagine someone in a poor town on some poor public school (schools which more often than not don't even have the most basic of necessities such as running water, electricity, or toilets), do you think they would be able to actually learn English?", "created_utc": "1658158096.0", "edited": "1658158282.0", "id": "ignijih", "is_submitter": "False", "link_id": "t3_w1vluo", "parent_id": "t1_igmo5nl", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "_Mexican_Soda_", "body": "I would guess stuff that hasn’t comed out in the US yet but is fairly popular (Sing “yesterday” for me for example)? Maybe manga that is popular and has a US release but it isn’t THAT popular (like happiness)? I don’t really know either haha", "created_utc": "1658083989.0", "edited": "False", "id": "igjrnhj", "is_submitter": "False", "link_id": "t3_w1bz66", "parent_id": "t1_igjq5kw", "score": "1", "subreddit": "MangaCollectors", "subreddit_id": "t5_3p7rg"}, {"author": "_Mexican_Soda_", "body": "They definitely are. In my experience, I’ve seen too many families be straight up addicted to Coca-cola. Like it is really common for families to buy the 3 Liter bottle every day, and drink that during all their meals (dinner, breakfast, lunch, etc) every single day.\n\nIt’s gotten to a point where I’ve confronted friends and family about this, and they just tell me things like: “It’s cause there’s some foods that just don’t taste well without coke” or “Try eating X dish with water” (Because they cannot fathom the idea of eating food with water instead of coke).\n\nA lot of people really are addicted, but it’s not really an addiction that’s looked down upon by society and it’s a really common, so most people don’t even care. Then everybody is wondering why we are first place in child obesity smh.\n\nEdit: Clarity", "created_utc": "1657994820.0", "edited": "1657995331.0", "id": "igf70fy", "is_submitter": "False", "link_id": "t3_w0h9zs", "parent_id": "t1_igevy53", "score": "2", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "_Mexican_Soda_", "body": "“The best course is the one you actually do”\n\nThat’s such a good quote", "created_utc": "1657863000.0", "edited": "False", "id": "ig891oy", "is_submitter": "False", "link_id": "t3_vz2zc5", "parent_id": "t1_ig8685g", "score": "62", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "_Mexican_Soda_", "body": "Ohhh, I didn’t know that, thanks! Now that’s it’s reduced to two villages it easier, only bad thing is that there’s no street view of them in google maps.", "created_utc": "1657656364.0", "edited": "False", "id": "ifwf4lg", "is_submitter": "True", "link_id": "t3_vxi4g3", "parent_id": "t1_ifwdtvh", "score": "2", "subreddit": "Genealogy", "subreddit_id": "t5_2qmdf"}, {"author": "_Mexican_Soda_", "body": "Spaced-repetition-system airbag?", "created_utc": "1657529956.0", "edited": "False", "id": "ifp935y", "is_submitter": "False", "link_id": "t3_vw6spq", "parent_id": "t3_vw6spq", "score": "2", "subreddit": "egg_irl", "subreddit_id": "t5_3n3op"}, {"author": "_Mexican_Soda_", "body": "Hi everybody! As I said, I'm a highschooler who just recently got interested in knowing more about my family's past since nobody in my family (except for my dad) seems to care about it. Recently with the help of my dad, I was able to get a hold of this picture. This picture is from the grave of my great grandfather, who was from Guangdong but came here to Mexico. \n\nSince I have no knowledge of Chinese, I don't know what it says, but this grave could really give us some information about him (since basically nobody in the family knows about him). If somebody could translate this for me, I would be really grateful. Thanks!", "created_utc": "1657500556.0", "edited": "False", "id": "ifnxige", "is_submitter": "True", "link_id": "t3_vw5m4e", "parent_id": "t3_vw5m4e", "score": "2", "subreddit": "ChineseLanguage", "subreddit_id": "t5_2qyz1"}, {"author": "_Mexican_Soda_", "body": "For some reason I kinda like MattvsJapan. Sure, he is a scammer and what his ego is higher than the empire states, but idk, he was my first introduction to language learning, and to this day his 3hr video still feels like one of the most realistic experience of how language learning is like. \n\nRefold is also pretty great, it’s 100% free and it is also a lot of people’s introduction to language learning, it teaches them a lot of stuff that generally works, and is the guide I would recommend to most people who are learning a language.\n\nWould I buy something from the dude? Nope, it’s all snake oil. Do I think he has done more good the wrong? Sort of.\n\nAnyways, [here’s](https://youtu.be/KM6JWFhrR6E) a great video about him. The audio is kinda bad, but just turn on the captions.", "created_utc": "1657410821.0", "edited": "False", "id": "ifja61e", "is_submitter": "False", "link_id": "t3_vutum8", "parent_id": "t1_ifhes78", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "_Mexican_Soda_", "body": "Legend of Zelda NES, such an awesome game", "created_utc": "1657396732.0", "edited": "False", "id": "ififqzf", "is_submitter": "False", "link_id": "t3_vupwmw", "parent_id": "t3_vupwmw", "score": "1", "subreddit": "NintendoSwitch", "subreddit_id": "t5_3h47q"}, {"author": "_Mexican_Soda_", "body": "How is that horrible grammar my guy? It’s fine", "created_utc": "1657300656.0", "edited": "False", "id": "ifd9ath", "is_submitter": "False", "link_id": "t3_vub7nv", "parent_id": "t1_ifd6wg0", "score": "43", "subreddit": "shitposting", "subreddit_id": "t5_2usxq"}, {"author": "_Mexican_Soda_", "body": "For me, I’ve always found annoying that the word “wrestling” (as in the sport) is untranslatable in my native language (Spanish). \n\nSure, you could say “lucha libre”, but most people always confuse it with the kind of wrestling where you were masks and stuff.\nYou could also say “lucha olímpica” or “lucha grecorromana” but they are only referring to a specific type of wrestling and not the concept as a whole. You could also just say “lucha”, but that is also a synonym for “fight” so it doesn’t work as well either. \nIt’s so annoying, maybe that’s why wrestling isn’t famous in Latin American countries; we don’t even have a word for it.", "created_utc": "1657247903.0", "edited": "False", "id": "ifal1s0", "is_submitter": "False", "link_id": "t3_vtkcrc", "parent_id": "t3_vtkcrc", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "_Mexican_Soda_", "body": "はじめまして！私は1ヶ月日本語勉強します。私はメキシコから来ま。訂正してください。", "created_utc": "1657172423.0", "edited": "False", "id": "if68y03", "is_submitter": "False", "link_id": "t3_vsivkw", "parent_id": "t3_vsivkw", "score": "4", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "_Mexican_Soda_", "body": "Hi, I’m a native Spanish speaker and since you said that you wanted to correct your mistakes, I’m willing to help.\n\n\"En este momento, tengo un nivel en español **entre** B1-B2. Yo **empece** mi ~~este~~ viaje hace 1 año y **medio** **en** Noviembre **del** 2020. En este momento, **estoy** viviendo entre ~~de~~ Gibraltar y España **ya que** mi novia es española. Dia a día yo trabajo en español, pero quiero una persona ~~en una forma monos~~ **que hable de manera menos formal** de nivel B1-C2, o **un** nativo que **quiera** intercambiar idiomas. Yo nunca ***escribo*** así que si hay **errores** **díganme**. **Como prueba** de mi nivel, tome el examen de delele(?) **en** **España** de nivel B2.\"\n\nAlthough I’m a native, I am not really an expert in grammar, so if I missed a “tilde” here and then, I’m sorry. Good luck on your language learning process!", "created_utc": "1657170986.0", "edited": "1657171735.0", "id": "if66r3f", "is_submitter": "False", "link_id": "t3_vn8ijw", "parent_id": "t1_ieu2qao", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "_Mexican_Soda_", "body": "I’m on mobile and this works perfectly, this is so cool the frick", "created_utc": "1657169213.0", "edited": "False", "id": "if63xkj", "is_submitter": "False", "link_id": "t3_vsuk7q", "parent_id": "t1_if5zhpz", "score": "11", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "_Mexican_Soda_", "body": "I’m in this picture and I don’t like it. \n\nNo but seriously, this is my biggest concern. Every single day I question whether or not I’m actually trans or if I’m just faking it in order to spice up my boring life. \n\nSomeone said “If you’re faking it you would know” and I think “Then I am faking it, cause right now I do feel like I’m actually faking it”, but then I proceed to get scared cause then I’m like “If I’m faking it that means I’m not trans, and if I’m not trans, I can’t be a girl”. This is all so complicated, why can’t I just know?! AAAAAAAAAAAAAAAAAAAAAAAAAAAA", "created_utc": "1657091123.0", "edited": "False", "id": "if1oog5", "is_submitter": "False", "link_id": "t3_vs5an9", "parent_id": "t3_vs5an9", "score": "4", "subreddit": "egg_irl", "subreddit_id": "t5_3n3op"}, {"author": "_Mexican_Soda_", "body": "Damn how long did it take you? Un-ironically  good, I respect this", "created_utc": "1657088295.0", "edited": "False", "id": "if1ky5w", "is_submitter": "False", "link_id": "t3_vsfm9h", "parent_id": "t3_vsfm9h", "score": "3", "subreddit": "bjj", "subreddit_id": "t5_2qn02"}, {"author": "_Mexican_Soda_", "body": "Sure man, go ahead!", "created_utc": "1656801214.0", "edited": "False", "id": "iemoxyn", "is_submitter": "True", "link_id": "t3_vpdtj8", "parent_id": "t1_iemluyg", "score": "1", "subreddit": "neography", "subreddit_id": "t5_2rjr2"}, {"author": "_Mexican_Soda_", "body": "Yeah, that’s probably what I need, a simplified version that still maintains the essence of it and the normal version so that when some writes, they can choose wether they want to write fast, or make their writing look pretty. Thanks for the idea!", "created_utc": "1656776564.0", "edited": "False", "id": "iel6n93", "is_submitter": "True", "link_id": "t3_vpdtj8", "parent_id": "t1_iekc8x5", "score": "4", "subreddit": "neography", "subreddit_id": "t5_2rjr2"}, {"author": "_Mexican_Soda_", "body": "I'm a highschooler who just yesterday discovered conlangs and I was really interested, so today I spent a lot of time designing a prototype of a script that I could use to make my own conlang. As you can see, it was inspired by flowers and I tried to make words look as flowery as they can.\n\nSince it is my first time making a conlang, it probably sucks, so that’s why I would like criticism in order to see how I can improve my script. Some things I need to work on from the top of my head is that this script would be that it is pretty hard to write quickly (when taking notes in a class for example), so I need to simplify it more if I would like it to actually be usable. It also might be way too confusing for first time learners, and it looks more like drawings than a script.\n\nIf you guys don’t get my letter, this is what is written on the second page (Some things are changed for the sake of clarity):\n\n*\\[Each flower consists of a bug, one or two leaves, a petal, and a stigma. (None of these are a requirement however, any piece can be skipped if desired).*\n\n*The order of reading is this:*\n\n*Bug* \n\n*Leaf 1* \n\n*Leaf 2* \n\n*Petal* \n\n*Stigma*\n\n***This is always the order, no exceptions.***\n\n***Words are separated by seeds****\\]*   \n\n\nEdit: Format", "created_utc": "1656717896.0", "edited": "1656718238.0", "id": "ieijjxr", "is_submitter": "True", "link_id": "t3_vpdtj8", "parent_id": "t3_vpdtj8", "score": "16", "subreddit": "neography", "subreddit_id": "t5_2rjr2"}, {"author": "_Mexican_Soda_", "body": "English - [https://voca.ro/1l4Tx52sgIWz](https://voca.ro/1l4Tx52sgIWz) Just give your honest opinion, I want to know how strong my Mexican accent is.", "created_utc": "1656577421.0", "edited": "False", "id": "ieam70h", "is_submitter": "False", "link_id": "t3_vn8ijw", "parent_id": "t3_vn8ijw", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "_Mexican_Soda_", "body": "That’s how my friend started learning Korean and he is one year in now. He had a crush on this Korean girl in our school, but apparently she rejected him or something, I don’t know the exact details. Anyways, he was too committed by that point so he continued learning Korean. So yeah, any good motivation is good man, just don’t fetishize them and you’ll be fine.", "created_utc": "1656569748.0", "edited": "False", "id": "ieacki8", "is_submitter": "False", "link_id": "t3_vnwumd", "parent_id": "t3_vnwumd", "score": "4", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "_Mexican_Soda_", "body": "Anki; it’s free (if on computer or android), gives you a lot of customization options, it’s by far the most famous and used one, and it is overall great.", "created_utc": "1656553485.0", "edited": "False", "id": "ie9jw56", "is_submitter": "False", "link_id": "t3_vnil5a", "parent_id": "t3_vnil5a", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "_Mexican_Soda_", "body": "I have a problem, and it’s that for me it has. I’ve barely started learning Japanese like 3 months ago and when I learned the Kama I was super excited and motivated like OP. Then I realize I couldn’t read or understand anything so I started studying. Now I’m honestly feeling like I’m not progressing or learning anything, and that motivation and excitement has gone away. Any tips?", "created_utc": "1656494670.0", "edited": "False", "id": "ie5z03b", "is_submitter": "False", "link_id": "t3_vn6jtl", "parent_id": "t1_ie5vy7l", "score": "2", "subreddit": "LearnJapanese", "subreddit_id": "t5_2qyls"}, {"author": "_Mexican_Soda_", "body": "I have seen so many of these supremacy memes that I don’t even know which one is the original one", "created_utc": "1656386123.0", "edited": "False", "id": "ie0essd", "is_submitter": "False", "link_id": "t3_vm0m9f", "parent_id": "t3_vm0m9f", "score": "1", "subreddit": "3DS", "subreddit_id": "t5_2ruhy"}, {"author": "_Mexican_Soda_", "body": "My native language is Spanish and I learned English when I was like 10 years old, so I also have the same problem as you in the sense that there is WAY MORE resources in English than in Spanish (it feels as if good Japanese learning sources in Spanish are almost inexistent), so I’ve had to learn Japanese in English. \n\nHonestly since my English is pretty good, I haven’t had a problem, but I’ve realized that sometimes although I learn all the meanings of words in English, my brain sometimes just saves them up in Spanish instead. \n\nFor example, on my Anki deck there is this sentence: “傘はありますか” which they translate as “Do you have an umbrella?”. For some reason, the other day I couldn’t remember what it meant in English, but I did remember the phrase “No tendrás una sombrilla por ahí?” in Spanish, which although it isn’t exactly a 1 to 1 translation, I still got the gist of it. So yeah.", "created_utc": "1656384600.0", "edited": "False", "id": "ie0bvid", "is_submitter": "False", "link_id": "t3_vlw3jy", "parent_id": "t1_idympj5", "score": "4", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "_Mexican_Soda_", "body": "Can mine be so that I can switch between both whenever I want? And also Arizona tea plzzzz", "created_utc": "1656319060.0", "edited": "False", "id": "idwosz0", "is_submitter": "False", "link_id": "t3_vllzwv", "parent_id": "t3_vllzwv", "score": "1", "subreddit": "egg_irl", "subreddit_id": "t5_3n3op"}, {"author": "_Mexican_Soda_", "body": "It’s nice to see other people who also do BJJ. For how long have you been doing it?", "created_utc": "1656316433.0", "edited": "False", "id": "idwls7h", "is_submitter": "False", "link_id": "t3_vl8vw0", "parent_id": "t1_idtpk3a", "score": "2", "subreddit": "egg_irl", "subreddit_id": "t5_3n3op"}, {"author": "_Mexican_Soda_", "body": "Of course not, if I wanted to understand the Chinese alphabet I would have to learn Chinese (Which I want to do after I get to a C1 level in Japanese, but that is not gonna happen in like 3 years probably)", "created_utc": "1656312260.0", "edited": "False", "id": "idwgryh", "is_submitter": "True", "link_id": "t3_vknij5", "parent_id": "t1_idw8rub", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "_Mexican_Soda_", "body": "“Discourse On The Method”. It is not that long, explains the famous “cogito ergo sum”, and it shows you the thought process of a renowned philosopher", "created_utc": "1656263562.0", "edited": "False", "id": "idtrn0s", "is_submitter": "False", "link_id": "t3_vl4cww", "parent_id": "t3_vl4cww", "score": "8", "subreddit": "askphilosophy", "subreddit_id": "t5_2sc5r"}, {"author": "_Mexican_Soda_", "body": "Oh damn, that is cool! About Arabic being the most useful since you read in in Wikipedia all the time; what do you mean by that? Does Wikipedia use a lot of Arabic?", "created_utc": "1656212788.0", "edited": "False", "id": "idri5i4", "is_submitter": "True", "link_id": "t3_vknij5", "parent_id": "t1_idrhi2a", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "_Mexican_Soda_", "body": "That is a really interesting path you took in order to learn them! Do you still remember all of them, or have you forgotten some of them over time? And thanks! I might honestly try something similar since it looks fun and I would probably learn some things about different languages by doing that.", "created_utc": "1656212514.0", "edited": "False", "id": "idrhnzy", "is_submitter": "True", "link_id": "t3_vknij5", "parent_id": "t1_idr8amg", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "_Mexican_Soda_", "body": "Yeah, you wouldn’t understand which makes one wonder what is the point. However you can still do cool things like write your name, and if you learn some words from that language, you could write those (like for example I have some Korean friends, so by learning Hangul I could send them text messages in Korean because of the small words and phrases they have taught me). It also helps you learn more about other languages and their peculiarities. \n\nBut yeah, it might be a waste of time you could spend studying your target language, and apart from what I mentioned, it isn’t really that useful since you still can’t understand anything even if you can read it.", "created_utc": "1656202139.0", "edited": "False", "id": "idqy8zn", "is_submitter": "True", "link_id": "t3_vknij5", "parent_id": "t1_idqw6p3", "score": "4", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "_Mexican_Soda_", "body": "Is it okay if I correct you?\n\nThe sentence should be:\n\n\"Yo me siento mal porque las únicas cosas que yo entiendo en esta publicación son las que están en ingles y algunas en español rudimentario. Estoy intentando aprender Indonesio y Latín, pero estoy yendo despacio.\"\n\n(Sorry if I missed any accents btw, even I as a native speaker don't have a complete grasp of how to use them 😭)", "created_utc": "1656187100.0", "edited": "False", "id": "idq31w2", "is_submitter": "False", "link_id": "t3_vhxzlj", "parent_id": "t1_idn1ddv", "score": "8", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "_Mexican_Soda_", "body": "I don’t think that Spanish has less vocabulary. Although Spanish is my Native language and I live in a Spanish speaking country, I find Spanish to be pretty hard. \n\nFor example when reading philosophical essays such as “Discourse on the Method”, I find it easier to read it in English than in Spanish. When reading a hard book in English I’ll mostly find like 1 or 2 new words every 10 pages, but when reading a hard book in Spanish, I’ll usually find around 4 or 5 new words every 10 pages. \n\nIt is also not only the words, but the way they are arranged. I can read most sentences on “Discourse on the method” in Spanish and understand what every word means, but it’s the way they are arranged in that makes it quite hard for me to understand. \n\nI’m also studying Japanese though, and Japanese does seem like a harder language than Spanish just because of the amount of Kanji it has, so it is probably harder, but I don’t think it might be because of vocab.", "created_utc": "1656185344.0", "edited": "False", "id": "idpz9sn", "is_submitter": "False", "link_id": "t3_vkcmx3", "parent_id": "t3_vkcmx3", "score": "7", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "_Mexican_Soda_", "body": "Damn, I’m barely doing a 1000 word beginner deck and I think it’s the hardest thing in the world. Which deck were you using?", "created_utc": "1656184820.0", "edited": "False", "id": "idpy4wf", "is_submitter": "False", "link_id": "t3_vkcmx3", "parent_id": "t1_idoyv0n", "score": "10", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "_Mexican_Soda_", "body": "Pre made Anki decks are 100% free and they help with vocab (which is the same thing Duolingo is supposed to help one). I find them much more effective as well.", "created_utc": "1656176230.0", "edited": "False", "id": "idpfadb", "is_submitter": "False", "link_id": "t3_vjyy3o", "parent_id": "t1_idoci9b", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "_Mexican_Soda_", "body": "Bro, how the hell are going from A0 to B1 in 6 months?! 😭. I’m studying Japanese right now and I’ve stuck in like A1 for at least 3 months right now. Probably not even A1 😭", "created_utc": "1656175420.0", "edited": "False", "id": "idpdg2y", "is_submitter": "False", "link_id": "t3_vjyy3o", "parent_id": "t1_idngfht", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "_Mexican_Soda_", "body": "Wait, where do we go to see it?", "created_utc": "1656175199.0", "edited": "False", "id": "idpcxo6", "is_submitter": "False", "link_id": "t3_vjyy3o", "parent_id": "t1_idnwq9z", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "_Mexican_Soda_", "body": "I think this is a joke image. It is a really popular joke in Mexico that people from Yucatán speak really funny, so I think this might be making a reference to that", "created_utc": "1656137797.0", "edited": "False", "id": "idnqqf0", "is_submitter": "False", "link_id": "t3_law6wm", "parent_id": "t3_law6wm", "score": "1", "subreddit": "nahuatl", "subreddit_id": "t5_2sbaq"}, {"author": "_Mexican_Soda_", "body": "De donde es tu papá?", "created_utc": "1656065612.0", "edited": "False", "id": "idjidjs", "is_submitter": "False", "link_id": "t3_vjc731", "parent_id": "t1_idiixbw", "score": "3", "subreddit": "egg_irl", "subreddit_id": "t5_3n3op"}, {"author": "_Mexican_Soda_", "body": "Ohhh okok, thanks for the information! I appreciate it a lot", "created_utc": "1655892618.0", "edited": "False", "id": "idada26", "is_submitter": "False", "link_id": "t3_vhez3r", "parent_id": "t1_idad58a", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "_Mexican_Soda_", "body": "Where do you even take these tests? I’m fluent in English and use it for everyday life, however, I’ve never formally tested my English level, so when setting up my flair I just had to go with the good ol’ “Yeah, I think I’m probably a C2”", "created_utc": "1655891985.0", "edited": "False", "id": "idaciih", "is_submitter": "False", "link_id": "t3_vhez3r", "parent_id": "t1_idaab9k", "score": "4", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "_Mexican_Soda_", "body": "Yeah, it mostly depends on the region. My dad (From San Luis Potosí) calls them sabalitos, but my mom (From Tamaulipas) calls them bolis. So yeah, regional accents I guess", "created_utc": "1655890898.0", "edited": "False", "id": "idab8xi", "is_submitter": "False", "link_id": "t3_vhtv4v", "parent_id": "t1_id9j0eb", "score": "1", "subreddit": "teenagers", "subreddit_id": "t5_2rjli"}, {"author": "_Mexican_Soda_", "body": "Yeah, sometimes people underestimate how useful it is to learn another language. \n\nIn my case as a native Spanish speaker, learning English has probably been the most useful skill I’ve learned and most of the time I don’t even realize it. Learning English has giving me an access to TONS of content, to the point where 75% of the stuff I watch is in English. It also has a lot of informational content that is simply not available in Spanish, and it is overall an easier language to find resources in which to learn other things by yourself. It has also given me access to communicating with a lot of people I would have other wise never met, and has really changed my life. It might sound exaggerated, but lowkey I would not the person I am now if I had never learned English.\n\nI’m currently learning Japanese now, and although it is a bit difficult because of all the grammar rules and kanji, I hope I can one day reach the same level that I currently have in English.", "created_utc": "1655888760.0", "edited": "False", "id": "ida8s0n", "is_submitter": "False", "link_id": "t3_vhki66", "parent_id": "t1_id8kscb", "score": "26", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "_Mexican_Soda_", "body": "I know I am replying to a two year old comment and I don't even know if you're still learning Japanese but, how do you turn down the pitch on a youtube video? Thanks in advance", "created_utc": "1655877757.0", "edited": "False", "id": "id9vi6l", "is_submitter": "False", "link_id": "t3_jewgmz", "parent_id": "t1_g9nuw7m", "score": "1", "subreddit": "ajatt", "subreddit_id": "t5_dw44m"}, {"author": "_Mexican_Soda_", "body": "Ohh, it’s cause it comes as way *too* respectful in my opinion haha", "created_utc": "1655873384.0", "edited": "False", "id": "id9p9zp", "is_submitter": "False", "link_id": "t3_vhcr1b", "parent_id": "t1_id9p5sq", "score": "2", "subreddit": "linguistics", "subreddit_id": "t5_2qhos"}, {"author": "_Mexican_Soda_", "body": "Weird question, but why do you refer to him as “his majesty”?", "created_utc": "1655871528.0", "edited": "False", "id": "id9mcka", "is_submitter": "False", "link_id": "t3_vhcr1b", "parent_id": "t3_vhcr1b", "score": "3", "subreddit": "linguistics", "subreddit_id": "t5_2qhos"}, {"author": "_Mexican_Soda_", "body": "I mean the original phrase was “Je pensé, donc je suis” and the literal translation is almost exactly the same since “suis” literally means “am”", "created_utc": "1655866434.0", "edited": "False", "id": "id9d9ys", "is_submitter": "False", "link_id": "t3_vh5wnk", "parent_id": "t1_id6vwbq", "score": "1", "subreddit": "PhilosophyMemes", "subreddit_id": "t5_2u0y3"}, {"author": "_Mexican_Soda_", "body": "I’ll get a stand from Jojo’s. I don’t even have to do the fighting, another flying ghost can do it for me!", "created_utc": "1655741741.0", "edited": "False", "id": "id2nzcx", "is_submitter": "False", "link_id": "t3_vgfjv4", "parent_id": "t3_vgfjv4", "score": "2", "subreddit": "martialarts", "subreddit_id": "t5_2qkt4"}, {"author": "_Mexican_Soda_", "body": "I’ve had the idea of BJJ and Wrestling but with punches. No kicks or knees, just punched. I would probably call it “Mexican-Wrestling” just so that Mexico has some kind of Martial Art.", "created_utc": "1655717410.0", "edited": "False", "id": "id1hxvp", "is_submitter": "False", "link_id": "t3_vge772", "parent_id": "t3_vge772", "score": "2", "subreddit": "martialarts", "subreddit_id": "t5_2qkt4"}, {"author": "_Mexican_Soda_", "body": "!attack", "created_utc": "1655630943.0", "edited": "False", "id": "icxehq8", "is_submitter": "False", "link_id": "t3_vfq24c", "parent_id": "t3_vfq24c", "score": "1", "subreddit": "kickopenthedoor", "subreddit_id": "t5_ob170"}, {"author": "_Mexican_Soda_", "body": "For me it’s honestly not that unreal. Maybe in the context of the show it is since they are just a bunch of kids wanting to be gangsters, but in a lot of poorer regions you can see young kids getting into drug gangs already. Here in Mexico recently a bunch of corpses of 14yr old narco soldiers were found, which is pretty sad if you think about it.", "created_utc": "1655584547.0", "edited": "False", "id": "icvcqq5", "is_submitter": "False", "link_id": "t3_vf80iz", "parent_id": "t1_icuo7ap", "score": "5", "subreddit": "anime", "subreddit_id": "t5_2qh22"}, {"author": "_Mexican_Soda_", "body": "🇲🇽🥤", "created_utc": "1655271430.0", "edited": "False", "id": "icf89rz", "is_submitter": "False", "link_id": "t3_vcjgww", "parent_id": "t3_vcjgww", "score": "1", "subreddit": "teenagers", "subreddit_id": "t5_2rjli"}, {"author": "_Mexican_Soda_", "body": "I’ve also been trying to find some video essay channels man, but from what I can see, Japanese YouTube is kinda trashy. It’s like 2015 American YouTube, so that’s the bad thing :(", "created_utc": "1655093158.0", "edited": "False", "id": "ic60nyo", "is_submitter": "False", "link_id": "t3_vauq29", "parent_id": "t3_vauq29", "score": "2", "subreddit": "ajatt", "subreddit_id": "t5_dw44m"}, {"author": "_Mexican_Soda_", "body": "I'm also a beginner in Japanese like you and I am currently using the pre-made Tango N5 deck (because that's what was recommended in [TheMoeWay](https://learnjapanese.moe/guide/) guide, which is the guide I'm using currently).\n\nA lot of people don't recommend using pre-made decks, and instead recommend creating your own deck by immersing in content and from the words you pick up, creating your own cards. Personally though, I opted to use the Tango N5 pre-made deck since I want to have at least a decent vocab before jumping into immersion and starting to make my own deck.\n\nIt is up to you however, so choose whatever method you like the best. Just remember that Anki is just a complement for vocab and you still need a grammar guide of your choice (Cure Dolly or Tae Kim for example) to study, and you need to do immersion as well. Good luck!", "created_utc": "1655020640.0", "edited": "False", "id": "ic2duur", "is_submitter": "False", "link_id": "t3_va5gxr", "parent_id": "t3_va5gxr", "score": "2", "subreddit": "Anki", "subreddit_id": "t5_2s9lm"}, {"author": "_Mexican_Soda_", "body": "How has nobody mentioned Brad Pitt?!!!", "created_utc": "1655017108.0", "edited": "False", "id": "ic29t4w", "is_submitter": "False", "link_id": "t3_vadvza", "parent_id": "t3_vadvza", "score": "6", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "_Mexican_Soda_", "body": "What do you mean with that?", "created_utc": "1655014628.0", "edited": "False", "id": "ic26twc", "is_submitter": "False", "link_id": "t3_vabm66", "parent_id": "t1_ic251t5", "score": "6", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "_Mexican_Soda_", "body": "Damn man feel bad for you. Have you ever tried therapy? It might lowkey help you to overcome that", "created_utc": "1655014530.0", "edited": "False", "id": "ic26pnv", "is_submitter": "False", "link_id": "t3_vabm66", "parent_id": "t1_ic1oq7s", "score": "351", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "_Mexican_Soda_", "body": "Oh, really?! That’s sweet! Thanks for telling me", "created_utc": "1655003038.0", "edited": "False", "id": "ic1p18h", "is_submitter": "False", "link_id": "t3_vabk39", "parent_id": "t1_ic1oyap", "score": "2", "subreddit": "mangaswap", "subreddit_id": "t5_2sird"}, {"author": "_Mexican_Soda_", "body": "Are you willing to split? If so, I’m interested in volume 2", "created_utc": "1655001062.0", "edited": "False", "id": "ic1lf8d", "is_submitter": "False", "link_id": "t3_vabk39", "parent_id": "t3_vabk39", "score": "1", "subreddit": "mangaswap", "subreddit_id": "t5_2sird"}, {"author": "_Mexican_Soda_", "body": "That’s a really good thing, I’m happy for you! I was genuinely worried for you, but now I’m really glad to see this. Congratulations girl!", "created_utc": "1654984342.0", "edited": "False", "id": "ic0q8lk", "is_submitter": "False", "link_id": "t3_v9cjje", "parent_id": "t3_v9cjje", "score": "2", "subreddit": "auralynnnnnnnnn_irl", "subreddit_id": "t5_5rhrac"}, {"author": "_Mexican_Soda_", "body": "Wait, why is the text in kana only? I’m currently studying Japanese and it surprises me that the text is only written in hiragana with no Kanji", "created_utc": "1654895097.0", "edited": "False", "id": "ibwgt26", "is_submitter": "False", "link_id": "t3_v8ru99", "parent_id": "t1_ibt7ck9", "score": "5", "subreddit": "AnimalCrossing", "subreddit_id": "t5_2ro2c"}, {"author": "_Mexican_Soda_", "body": "Yeah, I’ve never heard “Estoy embarazado” but I’ve heard “Me pasó algo muy embarazoso”", "created_utc": "1654836228.0", "edited": "False", "id": "ibtj19g", "is_submitter": "False", "link_id": "t3_v8s7hc", "parent_id": "t1_ibsgqsm", "score": "8", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "_Mexican_Soda_", "body": "I am a la the same thing I have \n\nThe egg hasn’t chosen me 😭", "created_utc": "1654816584.0", "edited": "False", "id": "ibsi253", "is_submitter": "False", "link_id": "t3_v8h4jb", "parent_id": "t3_v8h4jb", "score": "1", "subreddit": "egg_irl", "subreddit_id": "t5_3n3op"}, {"author": "_Mexican_Soda_", "body": "That’s good to know! As a Mexican I would love to learn Nahuatl one day so that the language doesn’t die", "created_utc": "1654758532.0", "edited": "False", "id": "ibpfog8", "is_submitter": "False", "link_id": "t3_v7uh7h", "parent_id": "t1_ibno1tg", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "_Mexican_Soda_", "body": "Well yeah, I was in a Catholic school so maybe that’s why, it might not had been like that in other schools", "created_utc": "1654712001.0", "edited": "False", "id": "ibmxy57", "is_submitter": "False", "link_id": "t3_v7hvfl", "parent_id": "t1_ibm6d3a", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "_Mexican_Soda_", "body": "From what I know it is really common in a lot of countries. \n\nHere in Mexico every single Monday students have a 20-40 minute long ceremony in which all of the students and teachers have to meet in front of the flag, then proceed to pledge allegiance to the flag, sing the national anthem, sing the state anthem, and the kids with the highest grades march while holding the flag.\n\nWhen I was studying in Canada, every morning when school started they would play the national anthem trough the speakers and you were supposed to stay still until it ended.\n\nAlso according to a lot of my Latin-American friends, they have ceremonies similar to those we do in Mexico every Monday. Most of them weren’t as long as the ones we had in Mexico, but they still did something.\n\nSo yeah, honestly it is not that uncommon and honestly I find it kind of endearing. It is something that got all students a little closer together, and it made you and everyone around feel proud of your country for at least 20 minutes (whether or not that’s a good thing is up to judgment). It also made our first period shorter so nobody complained anyways lol.\n\nEdit: formatting", "created_utc": "1654676255.0", "edited": "1654676474.0", "id": "ibl3wbm", "is_submitter": "False", "link_id": "t3_v7hvfl", "parent_id": "t1_ibks33z", "score": "6", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "_Mexican_Soda_", "body": "I have always said it as “Doble u”. It kind of makes sense if you think about it since cursive “w” looks like two cursive “u” and afaik cursive was the predominant font used by everybody in the past.", "created_utc": "1654675559.0", "edited": "False", "id": "ibl352g", "is_submitter": "False", "link_id": "t3_v74144", "parent_id": "t1_ibkeg6x", "score": "1", "subreddit": "ENGLISH", "subreddit_id": "t5_2qjni"}, {"author": "_Mexican_Soda_", "body": "Hitherto", "created_utc": "1654664850.0", "edited": "False", "id": "ibkprr2", "is_submitter": "False", "link_id": "t3_v76g47", "parent_id": "t3_v76g47", "score": "2", "subreddit": "ENGLISH", "subreddit_id": "t5_2qjni"}, {"author": "_Mexican_Soda_", "body": "I’m not the only one?! That’s great! For some reason I always do this in my christian school for no reason at all and my friends always give me the weird looks.", "created_utc": "1654586142.0", "edited": "False", "id": "ibgny77", "is_submitter": "False", "link_id": "t3_v6jimd", "parent_id": "t3_v6jimd", "score": "5", "subreddit": "femboymemes", "subreddit_id": "t5_120xk3"}, {"author": "_Mexican_Soda_", "body": "Creo que estas en el sub incorrecto JAJAJA", "created_utc": "1654489531.0", "edited": "False", "id": "ibbyz8q", "is_submitter": "False", "link_id": "t3_v5to2x", "parent_id": "t3_v5to2x", "score": "3", "subreddit": "mangadeals", "subreddit_id": "t5_aenjc"}, {"author": "_Mexican_Soda_", "body": "I was genuinely asking but yeah, that makes sense. I was thinking more about cheating in high school and such, but cheating in college does seem much more serious", "created_utc": "1654417094.0", "edited": "False", "id": "ib8drzv", "is_submitter": "False", "link_id": "t3_v542kw", "parent_id": "t1_ib8doiv", "score": "22", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "_Mexican_Soda_", "body": "Why is cheating on a test bad?", "created_utc": "1654416873.0", "edited": "False", "id": "ib8dj7r", "is_submitter": "False", "link_id": "t3_v542kw", "parent_id": "t1_ib8bqfw", "score": "14", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "_Mexican_Soda_", "body": "I have never used JapanesePod101 course, but their two videos on Kana are the best ones I’ve seen. They don’t try to sugarcoat the time it takes unlike other videos such as “Learn all hiragana in 5 minutes” and their use of mnemonics to learn them are pretty good.\n\nI know it’s unrelated to the conversation, but I needed to say that lol", "created_utc": "1654070078.0", "edited": "False", "id": "iargmze", "is_submitter": "False", "link_id": "t3_v289kb", "parent_id": "t1_iar64r1", "score": "46", "subreddit": "LearnJapanese", "subreddit_id": "t5_2qyls"}, {"author": "_Mexican_Soda_", "body": "CASIOPEA\n\nI’m not really interested in Jazz, but I still find them to pretty good. I like to listen to them in the mornings, but as passive immersion they aren’t that useful since they have no lyrics.", "created_utc": "1654057833.0", "edited": "False", "id": "iar0lux", "is_submitter": "False", "link_id": "t3_v1z3ri", "parent_id": "t3_v1z3ri", "score": "2", "subreddit": "LearnJapanese", "subreddit_id": "t5_2qyls"}, {"author": "_Mexican_Soda_", "body": "Wait, Citrus+ is not done?! I thought it was a single volume epilogue :0", "created_utc": "1654057696.0", "edited": "False", "id": "iar0e54", "is_submitter": "False", "link_id": "t3_v1skkk", "parent_id": "t1_iapktio", "score": "1", "subreddit": "MangaCollectors", "subreddit_id": "t5_3p7rg"}, {"author": "_Mexican_Soda_", "body": "On the accent thing (assuming you are talking about “tildes”) I feel you. I’m a native Spanish speaker but I have no idea on where to place accents. My dad is always making fun of me for that, but honestly I’ved come to realize they are not that important. Most of the time if Im writing something in Spanish it’s on my phone or computer, so the autocorrect placed them for me. On the rare occasion I am writing something on paper though, 95% of the time from context alone people understand what word I meant. \n\nI still understand that they are an important part of grammar in Spanish, but I wouldn’t worry too much about them until they are a bit more advanced. But yeah, one day I’m going to learn their placement just for the sake of knowledge.", "created_utc": "1654057565.0", "edited": "False", "id": "iar06kc", "is_submitter": "False", "link_id": "t3_v1mc0c", "parent_id": "t1_iande43", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "_Mexican_Soda_", "body": "Although everyone is saying that training martial arts for self defense is a valid motive, I would say that realistically speaking, it is not. However, I would encourage training martial arts.\n\nI feel that most people who train martial arts don’t ever have to use them. Sure, it is a possibility that you might have to physically defend yourself at some point, but the chances are pretty slim, especially if you live in a safe city on a first word country, and aren’t messing around in dangerous places at night. \n\nI would still encourage training martial arts though. Even if the odds are slim, it would still help you somewhat if a dangerous situation ever comes up (a 5% chance is still better than a 0%). The main reason why I would recommend it though, is because it does help psychologically. Martial arts in my experience have helped me with my self esteem, have helped me become humble, and have given me a confidence boost. Granted, martial arts are not therapy, but they have still helped me stop feeling weak.\n\nSo yeah, I would say go for it. Just pick one of the big four (Muay Thai, Kickboxing, Boxing, BJJ, MMA) and see if you like any. (Personally I would say that if you want to go for self defense, boxing would be your best option since it’s the most usable one for most dangerous encounters you could have).\n\nWish you luck!", "created_utc": "1654057102.0", "edited": "False", "id": "iaqzfro", "is_submitter": "False", "link_id": "t3_v1npfx", "parent_id": "t3_v1npfx", "score": "2", "subreddit": "martialarts", "subreddit_id": "t5_2qkt4"}, {"author": "_Mexican_Soda_", "body": "In my experience it’s the opposite, it is insanely hard to get rid of the foreigners accent. \n\nI started learning English when I was 10 years old because I started going to school in the US (I live in the Mexican side of the Mexican-American border, but cross everyday in order to go to school). I consider myself to be completely fluent in English since I find myself in an environment where I speak and hear only English 8 hours a day. Most of the content I watch is in English (mostly because there is more variety) and I have the highest English PSAT score in my class (which is only about 15 people, but still). Even with all of this, I still have a noticeable Mexican accent when speaking English. It is not like it affects me that much since it is pretty light (although still noticeable) and I most people in the border are Latino anyways. Still though, it is quite demoralizing to see my 5yr old cousin born in the US having a perfect American accent while I still have a Mexican accent. \n\nI don’t really worry about it too much like I used to, I just kind of accepted that I am probably always going to have it, and that’s ok. I am currently learning Japanese and I don’t really worry about my accent either since I have found it is probably going to be impossible to remove.\n\n(Sorry for weird formatting, I’m on mobile.)", "created_utc": "1653956059.0", "edited": "False", "id": "ialsv2k", "is_submitter": "False", "link_id": "t3_uiam6y", "parent_id": "t1_i7cuubz", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "_Mexican_Soda_", "body": "Wait, what resources do you use to learn in Spanish? My first language is also Spanish but I am mostly learning in English due to it being easier to find resources", "created_utc": "1653788666.0", "edited": "False", "id": "iadovl9", "is_submitter": "False", "link_id": "t3_uzzlhx", "parent_id": "t1_iadgm9l", "score": "24", "subreddit": "LearnJapanese", "subreddit_id": "t5_2qyls"}, {"author": "_Mexican_Soda_", "body": "Wait, is that a national park? Or where is that? Looks like a national park near me", "created_utc": "1653706186.0", "edited": "False", "id": "ia9rjx2", "is_submitter": "False", "link_id": "t3_uz3n1m", "parent_id": "t3_uz3n1m", "score": "2", "subreddit": "MangaCollectors", "subreddit_id": "t5_3p7rg"}, {"author": "_Mexican_Soda_", "body": "My brother in Christ, even though it has a bunch of reprehensible history behind it, Americans make too much of a deal about it compared to other similar cases. In Mexico for example, the Spanish equivalent for the word “faggot” (puto/maricon) is regularly used between friends to call each other, and it is mostly the same with all other slurs. Instead of making a big deal about it, we just adopt the word into our everyday life and therefore it looses meaning. Although it might not be the best solution (since nobody should be using those words anyways) I feel like that is what Americans should do with all their slur words instead of making a big deal about it.", "created_utc": "1653534795.0", "edited": "False", "id": "ia0t0vg", "is_submitter": "False", "link_id": "t3_ux3nsu", "parent_id": "t1_i9xqtb9", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "_Mexican_Soda_", "body": "Bruh", "created_utc": "1652973654.0", "edited": "False", "id": "i97mpl2", "is_submitter": "False", "link_id": "t3_ut4ww9", "parent_id": "t1_i97l7hv", "score": "2", "subreddit": "greenday", "subreddit_id": "t5_2snhx"}, {"author": "_Mexican_Soda_", "body": "Paradise Kiss, Death Note All-in-One, I Want to Eat Your Pancreas, and Hello World! Are all single volume manga that are quite thick. I would recommend those, altough the quality of the paper might not be the best.", "created_utc": "1652812484.0", "edited": "False", "id": "i8z7ekn", "is_submitter": "False", "link_id": "t3_urpewz", "parent_id": "t3_urpewz", "score": "2", "subreddit": "MangaCollectors", "subreddit_id": "t5_3p7rg"}, {"author": "_Mexican_Soda_", "body": "Ohhh, okok, makes sense", "created_utc": "1652374828.0", "edited": "False", "id": "i8c95g8", "is_submitter": "False", "link_id": "t3_unvq6o", "parent_id": "t1_i8bxhpt", "score": "2", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "_Mexican_Soda_", "body": "No, you are simply getting information of what other great minds have thought of problems in the past, in order to formulate your own opinion on the same topic.", "created_utc": "1652368836.0", "edited": "False", "id": "i8btsmv", "is_submitter": "False", "link_id": "t3_unvq6o", "parent_id": "t1_i8bgn6a", "score": "7", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "_Mexican_Soda_", "body": "Wait, what is the difference between \"Jumping guard\" and \"pulling guard\"?", "created_utc": "1652334779.0", "edited": "False", "id": "i8aagy4", "is_submitter": "False", "link_id": "t3_unkgsr", "parent_id": "t1_i88vszt", "score": "1", "subreddit": "bjj", "subreddit_id": "t5_2qn02"}, {"author": "_Mexican_Soda_", "body": "is BJJ really that expensive in America? Here in Mexico I only pay $750mxn a month (about $38usd) for BJJ, Muay Thai, and MMA. Granted, it's not really a big gym, but still. \n\nI guess those are one of the perks of living in a third world country. Classes for everything (martial arts, academic tutoring, arts, etc) are very cheap compared to the US (heck, I've taken boxing classes for $20 a month), so a big part of the teenage population from middle class families take 1-3 activities every week.", "created_utc": "1652324129.0", "edited": "False", "id": "i89s9dz", "is_submitter": "False", "link_id": "t3_unj4n2", "parent_id": "t1_i88luzd", "score": "1", "subreddit": "bjj", "subreddit_id": "t5_2qn02"}, {"author": "_Mexican_Soda_", "body": "I mean, isn't it beasically a warm coming of age drama centered around classical instrument performance/competition?", "created_utc": "1652277424.0", "edited": "False", "id": "i86nyiw", "is_submitter": "False", "link_id": "t3_umrf01", "parent_id": "t1_i84ehde", "score": "1", "subreddit": "anime", "subreddit_id": "t5_2qh22"}, {"author": "_Mexican_Soda_", "body": "Weird question, but are you Latinamerican or Brazilian?", "created_utc": "1652277025.0", "edited": "False", "id": "i86n0mu", "is_submitter": "False", "link_id": "t3_umrf01", "parent_id": "t1_i83g96d", "score": "1", "subreddit": "anime", "subreddit_id": "t5_2qh22"}, {"author": "_Mexican_Soda_", "body": "I mean, it is kind of unfair to compare a novel to a manga, since a novel is almost alwayst going to be better than a manga just because of the amount of information you can place per page compared to a manga, and because of how it relies a lot on the reader's imagination. I'd say however, that if we just grabbed the plots from most novels and compared them to Berserk's, I'd say Berserk's would be better 85% of the time.\n\nEdit: Grammar", "created_utc": "1652244081.0", "edited": "False", "id": "i859y44", "is_submitter": "False", "link_id": "t3_umxlfg", "parent_id": "t1_i84yd4b", "score": "7", "subreddit": "MangaCollectors", "subreddit_id": "t5_3p7rg"}, {"author": "_Mexican_Soda_", "body": "Nope, you can't re buy, and the amount of chips we start with isn't that big (90 chips in total; four 10s, six 5s, six 2s, and eight 1s), so if you are out, you are out. We also play for about 1-3 hours, so you got to be careful with how you spend your chips if you don't want to get out early.\n\nBy the way, could you explain some of the Poker terminology you used? I'm a beginner, but I want to learn what those terms mean. Thanks in advance!", "created_utc": "1652242314.0", "edited": "False", "id": "i856vg2", "is_submitter": "True", "link_id": "t3_un0dqb", "parent_id": "t1_i8554m4", "score": "1", "subreddit": "poker", "subreddit_id": "t5_2qhix"}, {"author": "_Mexican_Soda_", "body": "Ohhh, makes sense. Thanks!", "created_utc": "1651909930.0", "edited": "False", "id": "i7nkfsr", "is_submitter": "False", "link_id": "t3_uk0n40", "parent_id": "t1_i7ndw6o", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "_Mexican_Soda_", "body": "Ohhh, I guess that makes sense then", "created_utc": "1651904177.0", "edited": "False", "id": "i7ndhyw", "is_submitter": "False", "link_id": "t3_uk0n40", "parent_id": "t1_i7ncp59", "score": "2", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "_Mexican_Soda_", "body": "I wouldn't say that's racist either. My Korean friends always say random phrases in Spanish that they overhear when me and my Mexican friends talk in Spanish, and we always say random phrases in Korean we've overheard from the when they talk in Korean. They'll say things like \"No, no me gusta eso\" and we'll say things like \"Ohhh ne ne, jeodoyo\". Neither of us now the actual languages but we have learned little phrases from each other. I see it more like us implementing some things from other cultures into our everyday speech in a funny way rather than us being racist or anything.", "created_utc": "1651903385.0", "edited": "False", "id": "i7ncgud", "is_submitter": "False", "link_id": "t3_uk0n40", "parent_id": "t1_i7mkfzf", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "_Mexican_Soda_", "body": "Lowkey I don't get why people find that rude. Most waiters will just laugh/smile and talk back in spanish. My Mexican uncles also did that kind of stuff whenever going to Chinese restaurants here in Mexico. I just see it as a way to try and interact with a culture you are not usually in a lot of contact with.", "created_utc": "1651902600.0", "edited": "False", "id": "i7nbf5q", "is_submitter": "False", "link_id": "t3_uk0n40", "parent_id": "t1_i7m8mr7", "score": "4", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "_Mexican_Soda_", "body": "Excuse me, but what national holiday is celebrated on May 4th in México? There is none if I recall. If you had said September 16th (independence day in México and when we have \"el grito\") or November 20 (Mexican revolution) then it would've made more sense.", "created_utc": "1651902339.0", "edited": "False", "id": "i7nb2i0", "is_submitter": "False", "link_id": "t3_uk0n40", "parent_id": "t1_i7msass", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "_Mexican_Soda_", "body": "I mean, we Mexicans do that kind of stuff too. We also imitate Americans a lot. I have an uncle who lived ilegally in Atlanta for some years and it's literally a running joke in our family that he will speak bad english and add \"ation\" to any spanish word he doesn't know in English whenever he is trying to be funny. It goes both ways man, I feel like we should just take them as jokes and as people sharing differences between cultures in a funny manner.", "created_utc": "1651902144.0", "edited": "False", "id": "i7nass2", "is_submitter": "False", "link_id": "t3_uk0n40", "parent_id": "t1_i7ms89s", "score": "8", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "_Mexican_Soda_", "body": "Ohhhh, okok. However, why are those \"intrisic properties\" you mention make it an inherently objectively better movie?", "created_utc": "1651888098.0", "edited": "False", "id": "i7mmmh2", "is_submitter": "False", "link_id": "t3_ujrqaq", "parent_id": "t1_i7mlwmd", "score": "4", "subreddit": "askphilosophy", "subreddit_id": "t5_2sc5r"}, {"author": "_Mexican_Soda_", "body": "Altough I agree with you in that Good Fellas is a better movie than Paul Blart (altough I also like the second one a lot), for the sake of playing devil's advocate I have a question for you.\n\nYou gave me a list of criteria that supposedly are components which make Good Fellas a really good movie, if not one of the best movies ever made. However, why do those criteria make it an objectively better movie? Is it because its what most film critics consider makes a good movie?", "created_utc": "1651887367.0", "edited": "False", "id": "i7ml5le", "is_submitter": "False", "link_id": "t3_ujrqaq", "parent_id": "t1_i7lmrzw", "score": "3", "subreddit": "askphilosophy", "subreddit_id": "t5_2sc5r"}, {"author": "_Mexican_Soda_", "body": "A can of tuna and soy sauce. Never fails me", "created_utc": "1651867837.0", "edited": "False", "id": "i7lgees", "is_submitter": "False", "link_id": "t3_ujtplh", "parent_id": "t3_ujtplh", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "_Mexican_Soda_", "body": "Could you explain what makes Goodfellas objectively better than Paul Blart Mall Cop?", "created_utc": "1651866244.0", "edited": "False", "id": "i7lcza6", "is_submitter": "False", "link_id": "t3_ujrqaq", "parent_id": "t3_ujrqaq", "score": "1", "subreddit": "askphilosophy", "subreddit_id": "t5_2sc5r"}, {"author": "_Mexican_Soda_", "body": "Can you please explain what the repeated line of \"After you Alphonse\" means? I read the story but I still can't understand what that phrase means.", "created_utc": "1651864572.0", "edited": "False", "id": "i7l9c99", "is_submitter": "False", "link_id": "t3_ujkad3", "parent_id": "t1_i7kcffm", "score": "1", "subreddit": "askphilosophy", "subreddit_id": "t5_2sc5r"}, {"author": "_Mexican_Soda_", "body": "As a Mexican who has done a lot of turism inside the country I 100% couldn't agree more. I haven't visited a lot of other countries, but they are always insanely rude when you compare them to people in Mexico. For example, the first time I went to the USA (Las Vegas) I couldn't believe how rude the people were, they were always grumpy, and generally treated me badly. I left with a really bad taste in my mouth. \n\nCompare this to any place in Mexico, and the people are always super nice, you can have conversations with them about everyday life, and I have a lot of good memories of people from here adding to the experience of my trip and genuinely making it better. I don't know why this happens, but I guess it is because people here in Mexico are generally warmer and have the mentality of treating the client well.", "created_utc": "1651685431.0", "edited": "False", "id": "i7bf9jd", "is_submitter": "False", "link_id": "t3_ui5iiv", "parent_id": "t1_i7atfjs", "score": "22", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "_Mexican_Soda_", "body": "Ohhh okok, why is it considered culty though? Is it related to some kind of McDojoish behavior or something?", "created_utc": "1651681413.0", "edited": "False", "id": "i7b4yj6", "is_submitter": "False", "link_id": "t3_uht04b", "parent_id": "t1_i7azr7t", "score": "1", "subreddit": "bjj", "subreddit_id": "t5_2qn02"}, {"author": "_Mexican_Soda_", "body": "Oh no, please no. Out of all the great Latin artists we have, why would we go with Rosalia and those kind of artists? No disrespect to people who like them or anything, but it is really sad to see a lot of great latin music being massively overshadowed by reggaeton/trap artists such as those.", "created_utc": "1651676623.0", "edited": "False", "id": "i7ataf3", "is_submitter": "False", "link_id": "t3_uhxiy8", "parent_id": "t1_i79883g", "score": "3", "subreddit": "BlackPink", "subreddit_id": "t5_3f8po"}, {"author": "_Mexican_Soda_", "body": "Wait, is that actually sign of a cult gym? A lot of the gyms in my city do that and thought that it was a tradition of some sort.", "created_utc": "1651675467.0", "edited": "False", "id": "i7aqdx4", "is_submitter": "False", "link_id": "t3_uht04b", "parent_id": "t1_i78hu7d", "score": "3", "subreddit": "bjj", "subreddit_id": "t5_2qn02"}, {"author": "_Mexican_Soda_", "body": "Yooo, where did you get that signed CD?! So lucky!", "created_utc": "1651626894.0", "edited": "False", "id": "i78h00t", "is_submitter": "False", "link_id": "t3_uhuyvx", "parent_id": "t3_uhuyvx", "score": "3", "subreddit": "BeulPing", "subreddit_id": "t5_zigtm"}, {"author": "_Mexican_Soda_", "body": "I don't know that much about PC gaming, but from what I've heard people don't like them because of the exclusive games. However, consoles do that all the time\n\nEdit: Grammar", "created_utc": "1651605651.0", "edited": "False", "id": "i774a8u", "is_submitter": "False", "link_id": "t3_uhm97q", "parent_id": "t1_i7736ve", "score": "1", "subreddit": "technews", "subreddit_id": "t5_2qi4j"}, {"author": "_Mexican_Soda_", "body": "It's cause anime is what most dads grew up with in Latinamerica. Anime licenses were apparently cheap so a lot of free TV channels had them, meaning it was accesible to everybody. They also most of the time had incredible dubs and little to no censorship. It also helps that there wasn't a lot of good cartoons airing at the time, so it was a breath of fresh air to kids.  \n\n\nEdit: Grammar", "created_utc": "1651592486.0", "edited": "False", "id": "i767jjk", "is_submitter": "False", "link_id": "t3_ugr4hr", "parent_id": "t1_i7334x0", "score": "1", "subreddit": "anime", "subreddit_id": "t5_2qh22"}, {"author": "_Mexican_Soda_", "body": "The longest video I've ever watched on youtube and probably in my top 10 video essays of all time. As a highschooler who was born too late for that 2000s anime era, that kind of anime culture gives me a lot of second hand nostalgia, and that youtube video placed me in the shoes of someone who was a highschooler like me but that was interested in anime during the 2000s. It is a really good video, and her channel is pretty good in general; I would recommend it a lot.", "created_utc": "1651588988.0", "edited": "False", "id": "i75ypev", "is_submitter": "False", "link_id": "t3_ugr4hr", "parent_id": "t1_i74d50e", "score": "1", "subreddit": "anime", "subreddit_id": "t5_2qh22"}, {"author": "_Mexican_Soda_", "body": "I became **obssesed** with that book for like a year back when it was assigned to read in 7th grade, I even dressed up as a greaser for halloween. I remember that book being so entertaining to me that I even read it all in my own time because I couldn't wait to see what happened. I really do not know why I liked it so much, but maybe it was because all the characters were so compelling. After I finished reading the book I had 2 weeks of that sad feeling you get when you finish something you really liked, and it was even more sad to me because there was no one to discuss the book with. Really awesome book.", "created_utc": "1651456262.0", "edited": "False", "id": "i6z8294", "is_submitter": "False", "link_id": "t3_ug8quc", "parent_id": "t1_i6ydzw6", "score": "10", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "_Mexican_Soda_", "body": "Taking pride in taking advantage of something. For example: \"Me and my friends went to a movie teather with infinite refills, and everybody drank out of one cup\" or \"I cutted in front of someone in a 40 minutes line without getting caught\". Things like those are why we can't have good things!", "created_utc": "1651445085.0", "edited": "False", "id": "i6ylkkq", "is_submitter": "False", "link_id": "t3_ug23lj", "parent_id": "t3_ug23lj", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "_Mexican_Soda_", "body": "I mean honestly learning the kana (hiragana and katakana) is a piece of cake, the avarage person takes like a week, and if you put yourself to it, you could even do it in less than 3 days. Kanji however, is where it actually where it gets hard. \n\nEven taking that into consideration, sometimes grammar is what makes a language difficult. So for example altough Korean has the easiest writing system to learn out of all languages, it is still considered a hard one due to [it's grammar](https://pbs.twimg.com/media/FCVlgt2UYAIaQQ3.png) and context based sentences.", "created_utc": "1650898533.0", "edited": "False", "id": "i64y43a", "is_submitter": "False", "link_id": "t3_ubkpki", "parent_id": "t1_i64ukgc", "score": "22", "subreddit": "Konosuba", "subreddit_id": "t5_3c02n"}, {"author": "_Mexican_Soda_", "body": "Breaking Bad. As someone who isn't really used to watching shows and only watches mostly anime, it got super painfully slow after half of season 3. I had to force myself to watch it, and at the moment. I still haven't gotten myself to watching season 5. Honestly I don't get why people think it is the best show of all time, is there something I'm missing maybe? I just saw it as a regular show that started well but eventually took too long for any interesting to happen, and when something interesting actually happened, they take like 3 hours just to explain the aftermath.", "created_utc": "1650724642.0", "edited": "False", "id": "i5vrmdo", "is_submitter": "False", "link_id": "t3_u9w6fn", "parent_id": "t3_u9w6fn", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "_Mexican_Soda_", "body": "Ok, maybe legally I guess, but socially? Hell nah, so many people are straigt up homophobic", "created_utc": "1650668326.0", "edited": "False", "id": "i5t7400", "is_submitter": "False", "link_id": "t3_u9aa2m", "parent_id": "t1_i5scdvn", "score": "24", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "_Mexican_Soda_", "body": "Tyyyy <33 happy easter too!!!\n\nAnd btw, what picrew is that one? It's so cute!", "created_utc": "1650250864.0", "edited": "False", "id": "i55x534", "is_submitter": "False", "link_id": "t3_u5zdlb", "parent_id": "t3_u5zdlb", "score": "3", "subreddit": "egg_irl", "subreddit_id": "t5_3n3op"}, {"author": "_Mexican_Soda_", "body": "No way, literally first thing I thought when I saw this post was \"Juan Perez\" and it's the first comment I see!", "created_utc": "1649830294.0", "edited": "False", "id": "i4j7xsf", "is_submitter": "False", "link_id": "t3_u24xek", "parent_id": "t1_i4gzmyb", "score": "2", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "_Mexican_Soda_", "body": "I've always wondered this as well. I am a teenager and have some fantasies that make me worry about the negative impact they might have on my self-esteem and perception of the world later on my adult life, and I've always wanted to find an answer as to why they develop. Are you born with it? Do they happen because of childhood traumas? Can you get rid of them? So many questions and I can't seem to find any study or article on it.", "created_utc": "1649827126.0", "edited": "False", "id": "i4j3dko", "is_submitter": "False", "link_id": "t3_u2g327", "parent_id": "t3_u2g327", "score": "-1", "subreddit": "psychology", "subreddit_id": "t5_2qhcz"}, {"author": "_Mexican_Soda_", "body": "Don't tell me this 😭. I'm literally typing this at 1:30am and I usually sleep about 4-6 hours a day. I don't want to stunt my growth, but I just can't bring myself to sleep early. Nightime is just so relaxing, and I don't want the next day to arrive because that means going back to school and my responsabilities 😭. FML", "created_utc": "1649744966.0", "edited": "False", "id": "i4ea9zg", "is_submitter": "False", "link_id": "t3_u1ktj8", "parent_id": "t1_i4d9xb2", "score": "3", "subreddit": "egg_irl", "subreddit_id": "t5_3n3op"}, {"author": "_Mexican_Soda_", "body": "I don't know if this is sarcasm or if Im just taking the bait, but that's defenitely cap.\n\nIt's not that older media is better than newer media, it's just that most bad things are forgotten while the good things are remembered. It also doesn't help that most people have nostalgia about old media because that's what they grew up with. With most media it's actually the opposite, newer media is usually constantly improving and refining itself because of how long it's been produced.", "created_utc": "1649738566.0", "edited": "False", "id": "i4e0wka", "is_submitter": "False", "link_id": "t3_u1hxic", "parent_id": "t1_i4dw2qj", "score": "7", "subreddit": "MangaCollectors", "subreddit_id": "t5_3p7rg"}, {"author": "_Mexican_Soda_", "body": "I don't know about that haha. Altough I understand people find those posts annoying, I feel that if you got a damaged manga and you are mad at the moment, the least you can do is vent, even if its with strangers on the internet. It gives the guy who get the damaged manga a sense of relief, and the scrollers loose nothing.", "created_utc": "1649738154.0", "edited": "False", "id": "i4e09ef", "is_submitter": "False", "link_id": "t3_u1hxic", "parent_id": "t1_i4dav6i", "score": "2", "subreddit": "MangaCollectors", "subreddit_id": "t5_3p7rg"}, {"author": "_Mexican_Soda_", "body": "Depends what kind of \"girly\" you mean. If its the traditional feminine girl then I would rather go with the girly girl since she can help me with my fem stuff; if it's the \"mean girls\" kind of feminine though, I'd rather go with the tomboy.\n\nIdk if I explained myself.", "created_utc": "1649736257.0", "edited": "False", "id": "i4dx5og", "is_submitter": "False", "link_id": "t3_u13nq7", "parent_id": "t3_u13nq7", "score": "1", "subreddit": "feminineboys", "subreddit_id": "t5_2vmuo"}, {"author": "_Mexican_Soda_", "body": "Wait, what happened with the My Dress Up Darling manga? I wasn't aware of anything happening", "created_utc": "1649691396.0", "edited": "False", "id": "i4b0luq", "is_submitter": "False", "link_id": "t3_tzuddx", "parent_id": "t1_i41xzhb", "score": "3", "subreddit": "anime", "subreddit_id": "t5_2qh22"}, {"author": "_Mexican_Soda_", "body": "Damn, so it isn't a good thing? I basically do the same thing as him except I write them on a notebook. Should I just stop doing this?", "created_utc": "1649642967.0", "edited": "False", "id": "i48qu7h", "is_submitter": "False", "link_id": "t3_tzwbrz", "parent_id": "t1_i41z7my", "score": "1", "subreddit": "LearnJapanese", "subreddit_id": "t5_2qyls"}, {"author": "_Mexican_Soda_", "body": "Sameeee, idk why but \"princess\" just hits different uwu", "created_utc": "1649485407.0", "edited": "False", "id": "i405tt4", "is_submitter": "False", "link_id": "t3_tz1zcn", "parent_id": "t1_i3x78cz", "score": "2", "subreddit": "egg_irl", "subreddit_id": "t5_3n3op"}, {"author": "_Mexican_Soda_", "body": "I mean, I guess you could say lucha, but it is basically a sinonym of \"fight\" and most people just end up thinking about \"lucha libre\" (the kind that has masks), so it isn't really that easy to explain BJJ to people haha.", "created_utc": "1649484849.0", "edited": "False", "id": "i404z4n", "is_submitter": "False", "link_id": "t3_tzholv", "parent_id": "t1_i3zujq2", "score": "3", "subreddit": "bjj", "subreddit_id": "t5_2qn02"}, {"author": "_Mexican_Soda_", "body": "Same here, in my language we don't even have a word for wrestling", "created_utc": "1649470521.0", "edited": "False", "id": "i3zg3to", "is_submitter": "False", "link_id": "t3_tzholv", "parent_id": "t1_i3zbizw", "score": "5", "subreddit": "bjj", "subreddit_id": "t5_2qn02"}, {"author": "_Mexican_Soda_", "body": "Ok, ok, ok, ok, ok, ok, ok, oh\n\nYou live in my dream state…", "created_utc": "1648959495.0", "edited": "False", "id": "i36p2uo", "is_submitter": "False", "link_id": "t3_tuwi7m", "parent_id": "t3_tuwi7m", "score": "4", "subreddit": "Beyblade", "subreddit_id": "t5_2skjv"}, {"author": "_Mexican_Soda_", "body": "Understandable, have a good day uwu", "created_utc": "1648433754.0", "edited": "False", "id": "i2e0iqd", "is_submitter": "False", "link_id": "t3_tpyt21", "parent_id": "t1_i2e01to", "score": "1", "subreddit": "feminineboys", "subreddit_id": "t5_2vmuo"}, {"author": "_Mexican_Soda_", "body": "This is the kind of advice we need!", "created_utc": "1648245595.0", "edited": "False", "id": "i24d48r", "is_submitter": "False", "link_id": "t3_tnxl54", "parent_id": "t3_tnxl54", "score": "0", "subreddit": "Cd_collectors", "subreddit_id": "t5_2uxz7"}, {"author": "_Mexican_Soda_", "body": "I'm a sophomore in Highshcool and actually started just 3 days ago haha. I mostly started because I have a Junior friend who started learning Korean all by himself by the refold/ajatt method(which I had never heard of before. It look really interesting and I was impressed by his progress (which is not really a good measure since I don't speak even a little bit of Korean) so I got motivated to do the same with Japanese. Altough I'm not usually a really determined/disciplined person, I hope I will manage to learn atleast enough for me to read \"No longer human\" in Japanese.", "created_utc": "1648217249.0", "edited": "False", "id": "i22elyh", "is_submitter": "False", "link_id": "t3_tn6z60", "parent_id": "t3_tn6z60", "score": "2", "subreddit": "LearnJapanese", "subreddit_id": "t5_2qyls"}, {"author": "_Mexican_Soda_", "body": "Ohhh okok, that makes sense, thank you!", "created_utc": "1648087010.0", "edited": "False", "id": "i1vnfpw", "is_submitter": "False", "link_id": "t3_tlmt2n", "parent_id": "t1_i1vhyxr", "score": "2", "subreddit": "LearnJapanese", "subreddit_id": "t5_2qyls"}, {"author": "_Mexican_Soda_", "body": "Why is “Judo” in hiragana written as じゆうどう?\nShouldn’t it be ゆど？", "created_utc": "1648084043.0", "edited": "False", "id": "i1vgu13", "is_submitter": "False", "link_id": "t3_tlmt2n", "parent_id": "t3_tlmt2n", "score": "1", "subreddit": "LearnJapanese", "subreddit_id": "t5_2qyls"}, {"author": "_Mexican_Soda_", "body": "I don't know about that tbh. I would personally consider my english to be quite good by now (Because I've been going to school in the US for about 4 years), and altough I can think in english, I still have never dreamed in english, only in spanish. I'm pretty sure this is because you usually dream in the language in wich the little voice in your head is speaking in most of the time (In my case Spanish 95% of the time).\n\nEdit: Added info", "created_utc": "1647923658.0", "edited": "1647925325.0", "id": "i1mhlww", "is_submitter": "False", "link_id": "t3_tjrv66", "parent_id": "t1_i1m3n34", "score": "15", "subreddit": "LearnJapanese", "subreddit_id": "t5_2qyls"}, {"author": "_Mexican_Soda_", "body": "Don't tell me that man, I don't need that kind of demotivation before even starting :,(", "created_utc": "1647923462.0", "edited": "False", "id": "i1mhajj", "is_submitter": "False", "link_id": "t3_tjrv66", "parent_id": "t1_i1maylp", "score": "-3", "subreddit": "LearnJapanese", "subreddit_id": "t5_2qyls"}, {"author": "_Mexican_Soda_", "body": "Honestly that's an interesting question. My guess would be to consume content in Japanese into your daily life. For example altough english is not my first language, like 50% of the content I watch daily is english without even doing it on purpose, I just watch what i like without even thinking or actively trying to watch content in english. When I learn a decent level of japanese I hope it's the same and that a third of the content I will watch will be in japanese without thinking about it.", "created_utc": "1647878274.0", "edited": "False", "id": "i1jl0p6", "is_submitter": "False", "link_id": "t3_tjcq4m", "parent_id": "t3_tjcq4m", "score": "1", "subreddit": "LearnJapanese", "subreddit_id": "t5_2qyls"}, {"author": "_Mexican_Soda_", "body": "How much would it be for 3, 4, and 5?", "created_utc": "1647847154.0", "edited": "False", "id": "i1i5npp", "is_submitter": "False", "link_id": "t3_tiyipx", "parent_id": "t3_tiyipx", "score": "1", "subreddit": "mangaswap", "subreddit_id": "t5_2sird"}, {"author": "_Mexican_Soda_", "body": "Llegue un poco tarde, así que perdón. Por lo que escuche lo estas haciendo bastante bien, no se cuanto tiempo lleves pero pues si es entendible aunque igual y te falta trabajar un poquito mas en tu pronunciación, pero pues ahí la llevas! Nada mas me quedo una duda: ¿De que parte de México es el acento que quieres practicar? Por lo que escucho al parecer es como un acento norteño o algo por el estilo.", "created_utc": "1647493916.0", "edited": "False", "id": "i0zf695", "is_submitter": "False", "link_id": "t3_sy9q73", "parent_id": "t3_sy9q73", "score": "2", "subreddit": "JudgeMyAccent", "subreddit_id": "t5_2ufiq"}, {"author": "_Mexican_Soda_", "body": "Ayo, thanks!", "created_utc": "1647366408.0", "edited": "False", "id": "i0ryau5", "is_submitter": "False", "link_id": "t3_teh3l1", "parent_id": "t3_teh3l1", "score": "1", "subreddit": "RandomActsOfGaming", "subreddit_id": "t5_2t5mo"}, {"author": "_Mexican_Soda_", "body": "Yeah I agree some releases are striaght up better like the Yuyu Hakusho and Banana Fish releases. However some of their old series (such as Your Lie in April, Naruto, Nisekoi, etc) feel of cheaper quality compared to their US counterparts. As for myself I don't really like dust covers (which is was mostly keeps me away), but I can't deny that Panini has been doing a great job lately. After thinking about it I might start considering getting some of their releases for series that I don't feel like spending a lot of money on but that I still want to collect (such as Kaguya or Chainsawman).", "created_utc": "1647312372.0", "edited": "False", "id": "i0pa8m8", "is_submitter": "False", "link_id": "t3_te32h6", "parent_id": "t1_i0oenix", "score": "1", "subreddit": "MangaCollectors", "subreddit_id": "t5_3p7rg"}, {"author": "_Mexican_Soda_", "body": "Yeah some of panini's releases are better quality and easier to find (Yuyu Hakusho for example is way better quality than in America) however I don't really like those second covers because they get damaged quite easily if you are not careful with them. A solution to this is probably just leaving the manga inside the little plastic bags they come with, but I don't like how they look in the shelf.\n\nBut yeah, I've been considering buying some panini releases for series such as Kaguya or Rent A Girlfriend because it is cheaper that way and those are series that altough I like, I wouldn't like to spend that much money on.", "created_utc": "1647311582.0", "edited": "False", "id": "i0p8iwo", "is_submitter": "False", "link_id": "t3_te32h6", "parent_id": "t1_i0of43v", "score": "1", "subreddit": "MangaCollectors", "subreddit_id": "t5_3p7rg"}, {"author": "_Mexican_Soda_", "body": "Wait what Panini? I'm from Mexico but mostly buy English manga because I feel it is better quality than panini (and slightly bigger as well).", "created_utc": "1647297038.0", "edited": "False", "id": "i0oc5ob", "is_submitter": "False", "link_id": "t3_te32h6", "parent_id": "t1_i0nge7t", "score": "5", "subreddit": "MangaCollectors", "subreddit_id": "t5_3p7rg"}, {"author": "_Mexican_Soda_", "body": "This is basically the option I have. I live in the Mexico-US border, and over in Mexico manga is pretty cheap (About $4 per volume) however they are in JP format and usually lower quality. As of now I’ve mostly been buying American manga for the higher quality but since I’m a teen with not that big of an allowance I sometimes think that maybe I should stop being a crybaby about quality and just buy the Mexican versions of manga in order to save money. After all, all manga will end up yellowing and wearing after a while, so there is really no reason to pay x2.5 more per volume just for quality. I’m still having doubts about this though.", "created_utc": "1647285698.0", "edited": "False", "id": "i0nkntz", "is_submitter": "False", "link_id": "t3_te32h6", "parent_id": "t3_te32h6", "score": "1", "subreddit": "MangaCollectors", "subreddit_id": "t5_3p7rg"}, {"author": "_Mexican_Soda_", "body": "One Piece vol 11, 12, and Omnibus 5, 7, and 8. Haven't seen them on stock in a really looooong time.  \nAct Age vol 1. About 8 months ago I got volume 2 and wanted to get volume 1 (which was available on Barnes and Noble website) but I then saw what the author did and didn't want to buy a new copy in order to not give him any money, so I waited. Now I've seen vol 1 go for $50 and it's way to much for a highschooler like me.\n\nArmados by Saikomic. It's an independent manga by a Chilean author and I've been wanting to get my hands on it, but the publisher only ships in Chile and I haven't been able to get my hands on it for like 6 months by now.", "created_utc": "1647169299.0", "edited": "False", "id": "i0hafwz", "is_submitter": "False", "link_id": "t3_tcxftp", "parent_id": "t3_tcxftp", "score": "1", "subreddit": "MangaCollectors", "subreddit_id": "t5_3p7rg"}, {"author": "_Mexican_Soda_", "body": "Are you waiting till you get all of Berserk in order to read it or what?", "created_utc": "1646899225.0", "edited": "False", "id": "i03041t", "is_submitter": "False", "link_id": "t3_taojki", "parent_id": "t3_taojki", "score": "1", "subreddit": "MangaCollectors", "subreddit_id": "t5_3p7rg"}, {"author": "_Mexican_Soda_", "body": "Yeah, it definetely helps. Thanks for the advice!", "created_utc": "1646891757.0", "edited": "False", "id": "i02pq31", "is_submitter": "False", "link_id": "t3_ta4jad", "parent_id": "t1_i02pbqx", "score": "1", "subreddit": "bjj", "subreddit_id": "t5_2qn02"}, {"author": "_Mexican_Soda_", "body": "How do I get out of a full mount? I'm kinda new and I realized that the reason I never tap anyone on rolls is because they always take me to the ground and then mount me. I can never escape the mounst and therefore end up loosing 90% of the time. It's my biggest obstacle at the moment; can anyone provide advice? Thanks!", "created_utc": "1646890926.0", "edited": "False", "id": "i02of2r", "is_submitter": "False", "link_id": "t3_ta4jad", "parent_id": "t3_ta4jad", "score": "1", "subreddit": "bjj", "subreddit_id": "t5_2qn02"}, {"author": "_Mexican_Soda_", "body": "My first thoughts when reading this were \"Damn, that'd be scary, what would happen if I was actually cis all this time\" and all of you girls here are like \"YESSSSSSSSSSSSSSSS\" so now I'mma start questioning myself for the rest of the night, fuck.", "created_utc": "1646713862.0", "edited": "False", "id": "hzssa2g", "is_submitter": "False", "link_id": "t3_t8wb37", "parent_id": "t3_t8wb37", "score": "2", "subreddit": "egg_irl", "subreddit_id": "t5_3n3op"}, {"author": "_Mexican_Soda_", "body": "Where do you all find your deals😭😭😭?! In the Facebook marketplace of my city there’s no manga at all, and on mangswap I haven’t ever gotten anything because the second a good deal is up, someone already bought it!\n\nEdit: spelling", "created_utc": "1646680377.0", "edited": "False", "id": "hzqmf9o", "is_submitter": "False", "link_id": "t3_t8dkg5", "parent_id": "t3_t8dkg5", "score": "1", "subreddit": "MangaCollectors", "subreddit_id": "t5_3p7rg"}, {"author": "_Mexican_Soda_", "body": "Ayo don't worry about height my guy; like 50% of my guy friends are under 1.65cm and they are chilling, so you'll be fine. Stay up king!", "created_utc": "1646636991.0", "edited": "False", "id": "hzoeaju", "is_submitter": "False", "link_id": "t3_t88n5x", "parent_id": "t3_t88n5x", "score": "1", "subreddit": "egg_irl", "subreddit_id": "t5_3n3op"}, {"author": "_Mexican_Soda_", "body": "I mean Girl on the other side is already getting one isn't it?", "created_utc": "1646545935.0", "edited": "False", "id": "hzjna8a", "is_submitter": "False", "link_id": "t3_t7myzh", "parent_id": "t1_hzj9kcl", "score": "4", "subreddit": "MangaCollectors", "subreddit_id": "t5_3p7rg"}, {"author": "_Mexican_Soda_", "body": "Are you Latinoamerican or Brasileiro?", "created_utc": "1646545803.0", "edited": "False", "id": "hzjn2lp", "is_submitter": "False", "link_id": "t3_t7myzh", "parent_id": "t1_hzj6d4z", "score": "5", "subreddit": "MangaCollectors", "subreddit_id": "t5_3p7rg"}, {"author": "_Mexican_Soda_", "body": "Ohhhh, and what genre is it?", "created_utc": "1646363548.0", "edited": "False", "id": "hz9qpdi", "is_submitter": "False", "link_id": "t3_t62058", "parent_id": "t1_hz9l59r", "score": "1", "subreddit": "Cd_collectors", "subreddit_id": "t5_2uxz7"}, {"author": "_Mexican_Soda_", "body": "Ayo, whats the album on picture number 5?", "created_utc": "1646360500.0", "edited": "False", "id": "hz9kxcv", "is_submitter": "False", "link_id": "t3_t62058", "parent_id": "t3_t62058", "score": "1", "subreddit": "Cd_collectors", "subreddit_id": "t5_2uxz7"}, {"author": "_Mexican_Soda_", "body": "Do you by any chance have Blend S?", "created_utc": "1646358547.0", "edited": "False", "id": "hz9god2", "is_submitter": "False", "link_id": "t3_t620qr", "parent_id": "t3_t620qr", "score": "1", "subreddit": "mangaswap", "subreddit_id": "t5_2sird"}, {"author": "_Mexican_Soda_", "body": "Ahhh yes, AOT, my favorite children's book", "created_utc": "1646026948.0", "edited": "False", "id": "hyqtiqj", "is_submitter": "False", "link_id": "t3_t37es7", "parent_id": "t3_t37es7", "score": "16", "subreddit": "mangadeals", "subreddit_id": "t5_aenjc"}, {"author": "_Mexican_Soda_", "body": "What song or event is this?", "created_utc": "1645994099.0", "edited": "False", "id": "hyotf5o", "is_submitter": "False", "link_id": "t3_t2nm2d", "parent_id": "t3_t2nm2d", "score": "3", "subreddit": "greenday", "subreddit_id": "t5_2snhx"}, {"author": "_Mexican_Soda_", "body": "I don't get why this anime hasn't gotten a Season 2, I remember there were a lot of memes about this anime (Especially about the opening and Hideri) and it looked like it was fairly popular at its time, so to me it only made sense that a season 2 was going to get released", "created_utc": "1645854877.0", "edited": "False", "id": "hyherr0", "is_submitter": "False", "link_id": "t3_swx89x", "parent_id": "t3_swx89x", "score": "4", "subreddit": "BlendS", "subreddit_id": "t5_3jujg"}, {"author": "_Mexican_Soda_", "body": "Isn't this like some backrooms level?", "created_utc": "1645674658.0", "edited": "False", "id": "hy70ddl", "is_submitter": "False", "link_id": "t3_szx3va", "parent_id": "t3_szx3va", "score": "3", "subreddit": "thalassophobia", "subreddit_id": "t5_2xfs1"}, {"author": "_Mexican_Soda_", "body": "Damnnnn, props to you man, you seem like a really big berserk fan haha", "created_utc": "1645581804.0", "edited": "False", "id": "hy1p0f7", "is_submitter": "False", "link_id": "t3_sxirwj", "parent_id": "t1_hy1okx6", "score": "1", "subreddit": "mangadeals", "subreddit_id": "t5_aenjc"}, {"author": "_Mexican_Soda_", "body": "Ohhh okok, that seems fair, altough I personally wouldn't do it since it can get pricey to buy them at full price and even then only a small share of the money ends up going to the people who worked on it/Miura's family. If you really want to support them though, it might be more convenient to buy the japanese versions since I'm pretty sure that way more money will go to the people who worked on it. But well, to each their own.", "created_utc": "1645581550.0", "edited": "False", "id": "hy1oggv", "is_submitter": "False", "link_id": "t3_sxirwj", "parent_id": "t1_hy1l6lz", "score": "0", "subreddit": "mangadeals", "subreddit_id": "t5_aenjc"}, {"author": "_Mexican_Soda_", "body": "The author passed away man, who you trying to support?", "created_utc": "1645579277.0", "edited": "False", "id": "hy1jj32", "is_submitter": "False", "link_id": "t3_sxirwj", "parent_id": "t1_hxsueli", "score": "1", "subreddit": "mangadeals", "subreddit_id": "t5_aenjc"}, {"author": "_Mexican_Soda_", "body": "Because the non-talented man puts more effort into refining and getting better at his craft than the talented person does", "created_utc": "1645548755.0", "edited": "False", "id": "hxzefx4", "is_submitter": "True", "link_id": "t3_syqy0n", "parent_id": "t1_hxzdvb5", "score": "2", "subreddit": "askphilosophy", "subreddit_id": "t5_2sc5r"}, {"author": "_Mexican_Soda_", "body": "My bad, I think I wrote it wrong, what I mean is that isn't it unfair for someone with the innate ability to excel at something get more rewarded than the person who works hard to get good at it?", "created_utc": "1645548431.0", "edited": "False", "id": "hxzdled", "is_submitter": "True", "link_id": "t3_syqy0n", "parent_id": "t1_hxza2dl", "score": "1", "subreddit": "askphilosophy", "subreddit_id": "t5_2sc5r"}, {"author": "_Mexican_Soda_", "body": "That is true, but is it really fair? Like, is it really fair for someone who was just born with an innate ability to do something, rather than someone who actively works to get good at it? And if it is unfair, is there any theoretical possible solution to make it fairer?", "created_utc": "1645546696.0", "edited": "1645548377.0", "id": "hxz943d", "is_submitter": "True", "link_id": "t3_syqy0n", "parent_id": "t1_hxz6qk0", "score": "1", "subreddit": "askphilosophy", "subreddit_id": "t5_2sc5r"}, {"author": "_Mexican_Soda_", "body": "According to the sevens seas website, they are going to be 5.875x8.25in. I don't really understand inches though, so I would need a comparison to another manga edition in order to understand its size haha", "created_utc": "1644822058.0", "edited": "False", "id": "hwvsfh9", "is_submitter": "False", "link_id": "t3_s8y8uh", "parent_id": "t1_htjhz2v", "score": "2", "subreddit": "MangaCollectors", "subreddit_id": "t5_3p7rg"}, {"author": "_Mexican_Soda_", "body": "Ala, de que país es esta versión? Me imagino que de Argentina o de España no?", "created_utc": "1644775114.0", "edited": "False", "id": "hwsxtjm", "is_submitter": "False", "link_id": "t3_srju6b", "parent_id": "t3_srju6b", "score": "3", "subreddit": "MangaCollectors", "subreddit_id": "t5_3p7rg"}, {"author": "_Mexican_Soda_", "body": "I would get it, but I’m a high school sophomore and do not have a lot of money to buy things 😭", "created_utc": "1644688887.0", "edited": "False", "id": "hwo7mhq", "is_submitter": "True", "link_id": "t3_sqwu7v", "parent_id": "t1_hwo7e9v", "score": "1", "subreddit": "Beyblade", "subreddit_id": "t5_2skjv"}, {"author": "_Mexican_Soda_", "body": "Why are people saying there is gonna be a CD revival? Has there been any event recently that contributed to it?", "created_utc": "1644649221.0", "edited": "False", "id": "hwm6dn6", "is_submitter": "False", "link_id": "t3_sq96zh", "parent_id": "t3_sq96zh", "score": "5", "subreddit": "Cd_collectors", "subreddit_id": "t5_2uxz7"}, {"author": "_Mexican_Soda_", "body": "How do you know they are not mistakes and how much did they cost you?", "created_utc": "1644646927.0", "edited": "False", "id": "hwm2sgj", "is_submitter": "False", "link_id": "t3_sqdg62", "parent_id": "t1_hwkzxpd", "score": "3", "subreddit": "Beyblade", "subreddit_id": "t5_2skjv"}, {"author": "_Mexican_Soda_", "body": "Would you be willing to split on Act Age?", "created_utc": "1644555324.0", "edited": "False", "id": "hwgtu72", "is_submitter": "False", "link_id": "t3_spps2b", "parent_id": "t3_spps2b", "score": "2", "subreddit": "mangaswap", "subreddit_id": "t5_2sird"}, {"author": "_Mexican_Soda_", "body": "Damn, that's a really nice shelf your dad made you man! And by the way, how do you feel the One Piece omnibus volumes? I have the first 10 singles but I've been thinking about switching to the omnibuses because they are cheaper in the long run.", "created_utc": "1644470364.0", "edited": "False", "id": "hwbwy5m", "is_submitter": "False", "link_id": "t3_soki90", "parent_id": "t3_soki90", "score": "1", "subreddit": "MangaCollectors", "subreddit_id": "t5_3p7rg"}, {"author": "_Mexican_Soda_", "body": "Act age volume 2, I don’t know how rare, but it’s out of print", "created_utc": "1644434573.0", "edited": "False", "id": "hw9i7y8", "is_submitter": "False", "link_id": "t3_so9awj", "parent_id": "t3_so9awj", "score": "1", "subreddit": "MangaCollectors", "subreddit_id": "t5_3p7rg"}, {"author": "_Mexican_Soda_", "body": "Yeah man, it’s my favorite book of all time, you won’t regret it", "created_utc": "1644419873.0", "edited": "False", "id": "hw8evbi", "is_submitter": "False", "link_id": "t3_soaq5j", "parent_id": "t1_hw8ej4n", "score": "4", "subreddit": "TheOutsiders", "subreddit_id": "t5_2uv0o"}, {"author": "_Mexican_Soda_", "body": "You should really read the book man, it will give you a really good insight into his character!", "created_utc": "1644417613.0", "edited": "False", "id": "hw89dvn", "is_submitter": "False", "link_id": "t3_soaq5j", "parent_id": "t3_soaq5j", "score": "4", "subreddit": "TheOutsiders", "subreddit_id": "t5_2uv0o"}, {"author": "_Mexican_Soda_", "body": "Ohhh okok, makes sense man", "created_utc": "1644415335.0", "edited": "False", "id": "hw845yz", "is_submitter": "False", "link_id": "t3_ozvfe4", "parent_id": "t1_hw7k70b", "score": "2", "subreddit": "karate", "subreddit_id": "t5_2qo6l"}, {"author": "_Mexican_Soda_", "body": "It’s been a long time since I watched the show, why do you say that?", "created_utc": "1644415304.0", "edited": "False", "id": "hw843jv", "is_submitter": "True", "link_id": "t3_sny39o", "parent_id": "t1_hw6qnzu", "score": "1", "subreddit": "Beyblade", "subreddit_id": "t5_2skjv"}, {"author": "_Mexican_Soda_", "body": "Yeah, I’ve also seen a lot of MFB as well. I guess it’s because the kids who grew up in 2009-2011 are now about 20-23 years old which means they now have the money to afford the toys they couldn’t buy when they were younger haha. Interesting fact about Leone btw, I didn’t know that.", "created_utc": "1644364241.0", "edited": "False", "id": "hw5jsn0", "is_submitter": "True", "link_id": "t3_sny39o", "parent_id": "t1_hw5hxvc", "score": "8", "subreddit": "Beyblade", "subreddit_id": "t5_2skjv"}, {"author": "_Mexican_Soda_", "body": "Angelina Ballerina, a show about a mouses that danced ballet. They used to air it in discovery kids", "created_utc": "1644347426.0", "edited": "False", "id": "hw4bgw1", "is_submitter": "False", "link_id": "t3_snkja8", "parent_id": "t3_snkja8", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "_Mexican_Soda_", "body": "Idaten Jump, a kids anime from the 2000s about Bycicles with superpowers. It seems to must have been a fever dream since nobody I know ever watched, but if I search it up on google it does exist, so I don’t know anymore.", "created_utc": "1644347379.0", "edited": "False", "id": "hw4bcdu", "is_submitter": "False", "link_id": "t3_snkja8", "parent_id": "t3_snkja8", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "_Mexican_Soda_", "body": "Monster and Vagabond Omnibus. I started recently to collect and I’ve been wanting these series for sometime and still haven’t seen them in stock :(", "created_utc": "1644342387.0", "edited": "False", "id": "hw3xfk7", "is_submitter": "False", "link_id": "t3_sno9w1", "parent_id": "t3_sno9w1", "score": "33", "subreddit": "MangaCollectors", "subreddit_id": "t5_3p7rg"}, {"author": "_Mexican_Soda_", "body": "On picture no. 4. The fourth one from top to bottom", "created_utc": "1644332549.0", "edited": "False", "id": "hw37bkz", "is_submitter": "False", "link_id": "t3_snk0do", "parent_id": "t1_hw377fx", "score": "1", "subreddit": "MangaCollectors", "subreddit_id": "t5_3p7rg"}, {"author": "_Mexican_Soda_", "body": "Whats the name of the manga with the girl and the colors?", "created_utc": "1644332502.0", "edited": "False", "id": "hw377fx", "is_submitter": "False", "link_id": "t3_snk0do", "parent_id": "t3_snk0do", "score": "1", "subreddit": "MangaCollectors", "subreddit_id": "t5_3p7rg"}, {"author": "_Mexican_Soda_", "body": "My collection is pretty small and mainstream, so I guess the rarest manga I have is act age vol 2", "created_utc": "1644275185.0", "edited": "False", "id": "hw0b4vv", "is_submitter": "False", "link_id": "t3_smdwiq", "parent_id": "t3_smdwiq", "score": "2", "subreddit": "MangaCollectors", "subreddit_id": "t5_3p7rg"}, {"author": "_Mexican_Soda_", "body": "Teppu, a female MMA manga. It is only 8 volumes so it is not that long, and it is pretty cool. Super Eyepatch wolf did a video on it", "created_utc": "1644274278.0", "edited": "False", "id": "hw08y1k", "is_submitter": "False", "link_id": "t3_sn0omx", "parent_id": "t3_sn0omx", "score": "24", "subreddit": "MangaCollectors", "subreddit_id": "t5_3p7rg"}, {"author": "_Mexican_Soda_", "body": "Int in Vagabond, is it still available?", "created_utc": "1644243426.0", "edited": "False", "id": "hvy39ed", "is_submitter": "False", "link_id": "t3_smmldb", "parent_id": "t3_smmldb", "score": "1", "subreddit": "mangaswap", "subreddit_id": "t5_2sird"}, {"author": "_Mexican_Soda_", "body": "BJJ/Wrestling, but with strikes allowed while on the ground, whenever the fighters are standing up no strikes are legal.", "created_utc": "1644211411.0", "edited": "False", "id": "hvwra2k", "is_submitter": "False", "link_id": "t3_siew5o", "parent_id": "t3_siew5o", "score": "2", "subreddit": "martialarts", "subreddit_id": "t5_2qkt4"}, {"author": "_Mexican_Soda_", "body": "Wait, why is Fahrenheit 451 bad? I love that book and we were made to read it at school!", "created_utc": "1644085780.0", "edited": "False", "id": "hvq67nr", "is_submitter": "False", "link_id": "t3_skph5a", "parent_id": "t1_hvntqqz", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "_Mexican_Soda_", "body": "Aaaaaaaaaaand its out of stock again...", "created_utc": "1643948065.0", "edited": "False", "id": "hvip5a8", "is_submitter": "False", "link_id": "t3_sjw7y3", "parent_id": "t3_sjw7y3", "score": "7", "subreddit": "mangadeals", "subreddit_id": "t5_aenjc"}, {"author": "_Mexican_Soda_", "body": "I also did a version of this. One time I was getting driven to school and I thought \"In some time I'm going to be in school, and it will feel as if I skipped trough time\". Sure enough, I ended up going to school, and now 6 years have passed and I feel as if it had all gone really fast.", "created_utc": "1643897621.0", "edited": "False", "id": "hvf6lnf", "is_submitter": "False", "link_id": "t3_sjb9li", "parent_id": "t1_hve3fyt", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "_Mexican_Soda_", "body": "More of a question, but I heard that they recently released some \"The girl from the other side\"  collector's/deluxe editions. Is this true? I have never read the manga, but the artstyle looks cool and I really love anything related to collector's/deluxe editions.", "created_utc": "1643826871.0", "edited": "False", "id": "hvb5etb", "is_submitter": "False", "link_id": "t3_silqu3", "parent_id": "t3_silqu3", "score": "1", "subreddit": "MangaCollectors", "subreddit_id": "t5_3p7rg"}, {"author": "_Mexican_Soda_", "body": "For act age vol 1 It would only be 35?", "created_utc": "1643730174.0", "edited": "False", "id": "hv57gcw", "is_submitter": "False", "link_id": "t3_shmg8q", "parent_id": "t3_shmg8q", "score": "1", "subreddit": "mangaswap", "subreddit_id": "t5_2sird"}, {"author": "_Mexican_Soda_", "body": "Me four, Hikaru Nara got kind of overplayed for me, and since the second part of the anime is the part I liked the most, Nanairo Symphony reminds me of it.", "created_utc": "1643725276.0", "edited": "False", "id": "hv4vewk", "is_submitter": "False", "link_id": "t3_shj4s8", "parent_id": "t1_hv307v5", "score": "2", "subreddit": "YourLieinApril", "subreddit_id": "t5_33jzj"}, {"author": "_Mexican_Soda_", "body": "Same, I also ordered it! Does anyone know if it's legit though?", "created_utc": "1643725093.0", "edited": "False", "id": "hv4uzqi", "is_submitter": "False", "link_id": "t3_shfhgh", "parent_id": "t1_hv33u8r", "score": "1", "subreddit": "Beyblade", "subreddit_id": "t5_2skjv"}, {"author": "_Mexican_Soda_", "body": "Where did you get these? Really good find imo", "created_utc": "1643299439.0", "edited": "False", "id": "hugblpo", "is_submitter": "False", "link_id": "t3_sdkx3c", "parent_id": "t3_sdkx3c", "score": "1", "subreddit": "Beyblade", "subreddit_id": "t5_2skjv"}, {"author": "_Mexican_Soda_", "body": "What is the initial pricing without shipping?", "created_utc": "1643292332.0", "edited": "False", "id": "hufty1g", "is_submitter": "False", "link_id": "t3_sdjtw4", "parent_id": "t1_hueushp", "score": "1", "subreddit": "Beyblade", "subreddit_id": "t5_2skjv"}, {"author": "_Mexican_Soda_", "body": "I'm interested, what are your prices?", "created_utc": "1643255008.0", "edited": "False", "id": "hue68vm", "is_submitter": "False", "link_id": "t3_sdjtw4", "parent_id": "t3_sdjtw4", "score": "1", "subreddit": "Beyblade", "subreddit_id": "t5_2skjv"}, {"author": "_Mexican_Soda_", "body": "If those are original you are so lucky man. They are Beyblades from the metal saga and havent been produced in about 5 or 6 years. I'd kill to have one of those CIB.", "created_utc": "1643216822.0", "edited": "False", "id": "hubeg5j", "is_submitter": "False", "link_id": "t3_sd6zj0", "parent_id": "t3_sd6zj0", "score": "12", "subreddit": "Beyblade", "subreddit_id": "t5_2skjv"}, {"author": "_Mexican_Soda_", "body": "Ohhh okok, but for example, how do I know if the one I linked for example, is a midfake, or a re realease? I checked the pinned thread but there wasnt any info on it. Thanks!", "created_utc": "1643056693.0", "edited": "False", "id": "hu2eefi", "is_submitter": "False", "link_id": "t3_sbubue", "parent_id": "t1_hu2ao0b", "score": "1", "subreddit": "Beyblade", "subreddit_id": "t5_2skjv"}, {"author": "_Mexican_Soda_", "body": "That seems like good advice, and even more since I just wanna mess around with my friend with them, however, could you tell me what is the difference between a midfake and a fake? Thanks!", "created_utc": "1643055365.0", "edited": "False", "id": "hu2axw8", "is_submitter": "False", "link_id": "t3_sbubue", "parent_id": "t1_hu2a0jx", "score": "1", "subreddit": "Beyblade", "subreddit_id": "t5_2skjv"}, {"author": "_Mexican_Soda_", "body": "Wait, why wouldn't there be any chance on licensing? I mean, it's only 8 volumes, maybe they could even release it in 2 in 1s so its only 4", "created_utc": "1643010373.0", "edited": "False", "id": "htzt27c", "is_submitter": "False", "link_id": "t3_s50o4d", "parent_id": "t1_hsvk3pc", "score": "1", "subreddit": "MangaCollectors", "subreddit_id": "t5_3p7rg"}, {"author": "_Mexican_Soda_", "body": "There isn't any type of content that I love more than Video Essays, and this is a great one! You've earned my subscription man, good job!", "created_utc": "1642998880.0", "edited": "False", "id": "htzafwh", "is_submitter": "False", "link_id": "t3_sb79ro", "parent_id": "t3_sb79ro", "score": "6", "subreddit": "cowboybebop", "subreddit_id": "t5_2sn1i"}, {"author": "_Mexican_Soda_", "body": "\"¿Donde están los ladrones?\" is such a good album man!", "created_utc": "1642928421.0", "edited": "False", "id": "htuzh6v", "is_submitter": "False", "link_id": "t3_saf2sk", "parent_id": "t3_saf2sk", "score": "2", "subreddit": "Cd_collectors", "subreddit_id": "t5_2uxz7"}, {"author": "_Mexican_Soda_", "body": "Wait man, how can you say BJJ isn't effective? Haven't you seen the first 4 UFC's? All of them were won by BJJ. You also forgot to mention wrestling, highly effective.", "created_utc": "1642600634.0", "edited": "False", "id": "htbg5no", "is_submitter": "False", "link_id": "t3_ozvfe4", "parent_id": "t1_hq0rlhy", "score": "2", "subreddit": "karate", "subreddit_id": "t5_2qo6l"}, {"author": "_Mexican_Soda_", "body": "THEY CAME BACK?!", "created_utc": "1642514249.0", "edited": "False", "id": "ht6d35a", "is_submitter": "False", "link_id": "t3_s6esec", "parent_id": "t3_s6esec", "score": "1", "subreddit": "Panicland", "subreddit_id": "t5_2e2efw"}, {"author": "_Mexican_Soda_", "body": "No problem man, it surely is an interesting thing!", "created_utc": "1642222520.0", "edited": "False", "id": "hsq7jm7", "is_submitter": "False", "link_id": "t3_s3euyb", "parent_id": "t1_hsq5x1w", "score": "1", "subreddit": "bjj", "subreddit_id": "t5_2qn02"}, {"author": "_Mexican_Soda_", "body": "Well, it's cause lucha basically means \"fight\", so saying you do \"fight\" is not really descriptive, and even if they understood, they would most likely think about professional wrestling cause we also call it \"lucha/lucha libre\".", "created_utc": "1642221265.0", "edited": "False", "id": "hsq587b", "is_submitter": "False", "link_id": "t3_s3euyb", "parent_id": "t1_hsq31j9", "score": "1", "subreddit": "bjj", "subreddit_id": "t5_2qn02"}, {"author": "_Mexican_Soda_", "body": "Spanish, I'm from Mexico haha", "created_utc": "1642202220.0", "edited": "False", "id": "hsp03bj", "is_submitter": "False", "link_id": "t3_s3euyb", "parent_id": "t1_hsm5jry", "score": "1", "subreddit": "bjj", "subreddit_id": "t5_2qn02"}, {"author": "_Mexican_Soda_", "body": "This is specially hard for me beacuse in my language there are no words for grappling or wrestling. If they asked me in english I would just say \"It's basically submission wrestling\", but since I can't, I struggle to explain it to people who ask me.", "created_utc": "1642142861.0", "edited": "False", "id": "hslk907", "is_submitter": "False", "link_id": "t3_s3euyb", "parent_id": "t3_s3euyb", "score": "1", "subreddit": "bjj", "subreddit_id": "t5_2qn02"}, {"author": "_Mexican_Soda_", "body": "I also have the same question, from what I saw it's an essay by Neil Shinhabu but I am a super newbie in philosophy (I barely begun by reading Sophie's World), so can someone summarize it in simple terms? I can't even understand the abstract.", "created_utc": "1642139438.0", "edited": "False", "id": "hsleo9t", "is_submitter": "False", "link_id": "t3_s0te3i", "parent_id": "t1_hs48tkr", "score": "1", "subreddit": "PhilosophyMemes", "subreddit_id": "t5_2u0y3"}, {"author": "_Mexican_Soda_", "body": "I absolutely love that book. \n\nWhen I was in 8th grade I became obssesed with the book. I remember I finished this book on my own before we we're supposed to because I got super invested in it. After I finished it I became obssesed with this book. I watched the movie, dressed as a greaser for halloween, tried to get the haircut of a greaser, and even found and became part of a small fandom on instagram about the outsiders (which is still active to this day). Such a genuinely good book, and the only book I ever liked in all of my school years.", "created_utc": "1639287452.0", "edited": "False", "id": "ho7qubt", "is_submitter": "False", "link_id": "t3_recmmq", "parent_id": "t1_ho6vu24", "score": "6", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "_Mexican_Soda_", "body": "Yeah, now it makes much more sense now. Thanks for helping me out, I really really really appreciate it!", "created_utc": "1639286654.0", "edited": "False", "id": "ho7phx6", "is_submitter": "True", "link_id": "t3_rebwl1", "parent_id": "t1_ho7m7f8", "score": "5", "subreddit": "askphilosophy", "subreddit_id": "t5_2sc5r"}, {"author": "_Mexican_Soda_", "body": "Oof, I'm pretty bad at math, so that is hard to understand for me haha. My bad.\n\nOn the topic of Crash Course Philosophy though, I do have seen people saying it is pretty bad. Is it really as bad as they make it out to be? I'm currently watching it and taking notes from the videos on my free time so that I can learn about the basics of philosophy. While I understand that 10 minute videos are not going to go as in depth as it should should I just stop watching it? Or can I continue taking notes of it but with the intention of getting some of the basics?\n\nI'm currently also planning on reading Sophie's World (I own a copy of it) since they say it is a good introduction to philosophy, but what other material am I supposed to read after finishing it? Thanks in advance!", "created_utc": "1639285509.0", "edited": "False", "id": "ho7nes3", "is_submitter": "True", "link_id": "t3_rebwl1", "parent_id": "t1_ho7l4ip", "score": "2", "subreddit": "askphilosophy", "subreddit_id": "t5_2sc5r"}, {"author": "_Mexican_Soda_", "body": "Ohhh okok, I think I'm understanding now. So in other words the cat argument isn't valid because Premise 1 (All cats are mammals) does not imply that all mammals are cats; therefore P1 does not support the conclusion.\n\nThe Socrates one is valid because if both premises were true, then the conclusion would be true, but since both premises are false, the conclusion is false.", "created_utc": "1639283566.0", "edited": "False", "id": "ho7jsxe", "is_submitter": "True", "link_id": "t3_rebwl1", "parent_id": "t1_ho7iijj", "score": "6", "subreddit": "askphilosophy", "subreddit_id": "t5_2sc5r"}, {"author": "_Mexican_Soda_", "body": "Being completely honest I can't see what is wrong with this argument. Sorry if I'm frustrating ya'll, but I was pretty confused with this whole validity thing. I researched more about validity, and I'm even more confused because according to [this](https://www.differencebetween.com/difference-between-truth-and-validity/) website the following argument is valid: \n\n*All cups are red. – false premise*\r  \n*Socrates is red. – false premise*\r  \n*Therefore, Socrates is red. – false conclusion*\n\nHow come that argument be valid but the cat one isn't? Its super confusing to me. \n\n(I'm kinda worried right now, if I'm confused by this, then how am I going to be able to understand more complex concepts and books in the future? haha)", "created_utc": "1639281607.0", "edited": "False", "id": "ho7g2lt", "is_submitter": "True", "link_id": "t3_rebwl1", "parent_id": "t1_ho7e7cs", "score": "4", "subreddit": "askphilosophy", "subreddit_id": "t5_2sc5r"}, {"author": "_Mexican_Soda_", "body": "Not really. My best guess would be that it's invalid because the premises don't guarantee the truth of the conclusion? Correct me if I'm wrong plz", "created_utc": "1639280216.0", "edited": "False", "id": "ho7dbfg", "is_submitter": "True", "link_id": "t3_rebwl1", "parent_id": "t1_ho6psak", "score": "3", "subreddit": "askphilosophy", "subreddit_id": "t5_2sc5r"}, {"author": "_Mexican_Soda_", "body": "World's Dawn\n\n4003\n\nEnchiladas", "created_utc": "1636934302.0", "edited": "False", "id": "hknm6q0", "is_submitter": "False", "link_id": "t3_qtonhn", "parent_id": "t3_qtonhn", "score": "1", "subreddit": "RandomActsOfGaming", "subreddit_id": "t5_2t5mo"}, {"author": "_Mexican_Soda_", "body": "Where did you get My Beautiful Drak Twisted Fantasy on Jewel Case? I've been trying to find a version with a jewel case but can't seem to find it.", "created_utc": "1636386791.0", "edited": "False", "id": "hjtdfrs", "is_submitter": "False", "link_id": "t3_qpevqd", "parent_id": "t3_qpevqd", "score": "4", "subreddit": "Cd_collectors", "subreddit_id": "t5_2uxz7"}, {"author": "_Mexican_Soda_", "body": "Epitaph- King Crimson", "created_utc": "1636032580.0", "edited": "False", "id": "hja2jg0", "is_submitter": "False", "link_id": "t3_qm82cg", "parent_id": "t3_qm82cg", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "_Mexican_Soda_", "body": "15, never developed studying habits which are making highschool really hard for me, procrastination, having no motivation for school whatsoever, no close friends in which I can trust and talk to them about my feelings and shit, questioning my gender, loneliness, and no direction for my life.\n\nBut well, I'm still 15 and have a lot more to live through, and I'm still in a position in which my problems are not that big in the grand scheme of things, so that gives me hope.", "created_utc": "1635898219.0", "edited": "False", "id": "hj2zhs2", "is_submitter": "False", "link_id": "t3_qlcvr7", "parent_id": "t3_qlcvr7", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "_Mexican_Soda_", "body": "Yeah, the bad thing is the name, you can't change it :(", "created_utc": "1635315005.0", "edited": "False", "id": "hi7st2r", "is_submitter": "False", "link_id": "t3_qg6ga7", "parent_id": "t1_hi6zjje", "score": "2", "subreddit": "egg_irl", "subreddit_id": "t5_3n3op"}, {"author": "_Mexican_Soda_", "body": "Ohhh okok, do you know what version is it? Or could you send me some pictures? I want to see if I can find it on Discogs", "created_utc": "1635253818.0", "edited": "False", "id": "hi3z1ft", "is_submitter": "False", "link_id": "t3_qd4xql", "parent_id": "t1_hi3xmko", "score": "1", "subreddit": "Cd_collectors", "subreddit_id": "t5_2uxz7"}, {"author": "_Mexican_Soda_", "body": "Where did you get The Dark Side Of The Moon on jewel case? I've been trying to find it on jewel case for some time already, but I've only found a version with a cover on which the triangle is a solid grey color.", "created_utc": "1635171645.0", "edited": "False", "id": "hhzkzia", "is_submitter": "False", "link_id": "t3_qd4xql", "parent_id": "t3_qd4xql", "score": "1", "subreddit": "Cd_collectors", "subreddit_id": "t5_2uxz7"}, {"author": "_Mexican_Soda_", "body": "I don't think a show being old is a justification for spoiling someone. People have lives, and a lot of them don't have time to watch everything when it comes out.", "created_utc": "1634910642.0", "edited": "False", "id": "hhmbpcd", "is_submitter": "False", "link_id": "t3_qczr7x", "parent_id": "t1_hhkksix", "score": "0", "subreddit": "cowboybebop", "subreddit_id": "t5_2sn1i"}, {"author": "_Mexican_Soda_", "body": "Yo btw, where did you get the Blurryface Jewel Case CD? I've been trying to get Blurryface but I've only found it in Digipack so far :(", "created_utc": "1634434473.0", "edited": "False", "id": "hgxkc6a", "is_submitter": "False", "link_id": "t3_q5cp2x", "parent_id": "t3_q5cp2x", "score": "1", "subreddit": "Cd_collectors", "subreddit_id": "t5_2uxz7"}, {"author": "_Mexican_Soda_", "body": "Context?", "created_utc": "1634185376.0", "edited": "False", "id": "hgkor51", "is_submitter": "False", "link_id": "t3_q7modl", "parent_id": "t3_q7modl", "score": "5", "subreddit": "egg_irl", "subreddit_id": "t5_3n3op"}, {"author": "_Mexican_Soda_", "body": "Wouldn't it be only just \"No-Binario\" though? Because in spanish we also mostly use male pronouns when referring to something that doesn't have a clear gender.", "created_utc": "1634094954.0", "edited": "False", "id": "hgfuomk", "is_submitter": "False", "link_id": "t3_q6tzol", "parent_id": "t1_hges5ep", "score": "11", "subreddit": "egg_irl", "subreddit_id": "t5_3n3op"}, {"author": "_Mexican_Soda_", "body": "Your collection is super similar to my music tastes, nice!", "created_utc": "1633922990.0", "edited": "False", "id": "hg6rfi3", "is_submitter": "False", "link_id": "t3_q5cp2x", "parent_id": "t3_q5cp2x", "score": "2", "subreddit": "Cd_collectors", "subreddit_id": "t5_2uxz7"}, {"author": "_Mexican_Soda_", "body": "I needed to hear this", "created_utc": "1632979305.0", "edited": "False", "id": "hetfvly", "is_submitter": "False", "link_id": "t3_pxzwqd", "parent_id": "t3_pxzwqd", "score": "3", "subreddit": "egg_irl", "subreddit_id": "t5_3n3op"}, {"author": "_Mexican_Soda_", "body": "Please don't tell me Royce Gracie's family owned the UFC, his victory in UFC 1 was my inspiration to start BJJ about two weeks ago because I was like \"If a small guy like him can beat bigger opponents, then I can do the same\" 😭", "created_utc": "1632548744.0", "edited": "False", "id": "he6svne", "is_submitter": "False", "link_id": "t3_pul6yl", "parent_id": "t1_he5l3g0", "score": "1", "subreddit": "martialarts", "subreddit_id": "t5_2qkt4"}, {"author": "_Mexican_Soda_", "body": "Cigarretes and Valentines anyone?", "created_utc": "1631548482.0", "edited": "False", "id": "hcpcm5k", "is_submitter": "False", "link_id": "t3_pn7wup", "parent_id": "t1_hcnqv83", "score": "12", "subreddit": "greenday", "subreddit_id": "t5_2snhx"}, {"author": "_Mexican_Soda_", "body": "Pretty good musical taste my man, from Pink Floyd, to Green Day, to Olivia Rodrigo. Nice!", "created_utc": "1631490898.0", "edited": "False", "id": "hcmo2ux", "is_submitter": "False", "link_id": "t3_pmmjpx", "parent_id": "t3_pmmjpx", "score": "2", "subreddit": "Cd_collectors", "subreddit_id": "t5_2uxz7"}, {"author": "_Mexican_Soda_", "body": "No fucking way. I love Green Day and this is one of my favorite songs from them, and just now I barely realize what it is about. Now everything makes sense...", "created_utc": "1631161236.0", "edited": "False", "id": "hc59ela", "is_submitter": "False", "link_id": "t3_pkptp5", "parent_id": "t3_pkptp5", "score": "9", "subreddit": "egg_irl", "subreddit_id": "t5_3n3op"}, {"author": "_Mexican_Soda_", "body": "Such a pretty name!", "created_utc": "1631161013.0", "edited": "False", "id": "hc592ld", "is_submitter": "False", "link_id": "t3_pkp8hs", "parent_id": "t3_pkp8hs", "score": "3", "subreddit": "egg_irl", "subreddit_id": "t5_3n3op"}, {"author": "_Mexican_Soda_", "body": "I mean its been a year since they've been last active on any social media, and their online store closed, so yeah... But well, right now I'm trying to do an list/archive on a post here of every single on of the songs they have. It has some old songs of them (like from 2013) and more stuff, so you might want to give it a listen!", "created_utc": "1631107168.0", "edited": "False", "id": "hc207qn", "is_submitter": "False", "link_id": "t3_pjgacc", "parent_id": "t3_pjgacc", "score": "5", "subreddit": "Panicland", "subreddit_id": "t5_2e2efw"}, {"author": "_Mexican_Soda_", "body": "Thank you for commenting this! This is actually a pretty good chunk of content from them, and it's really interesting to see how their early stuff was. It seems that you have been following the band for quite a while, and that is pretty awesome! I'mma give them a listen and I'm going to add it to the post, thanks!", "created_utc": "1631053799.0", "edited": "False", "id": "hbzkusw", "is_submitter": "True", "link_id": "t3_pjbqcm", "parent_id": "t1_hbx172y", "score": "2", "subreddit": "Panicland", "subreddit_id": "t5_2e2efw"}, {"author": "_Mexican_Soda_", "body": "I wanted to buy a cd from them when I noticed that, I got kinf of sad after", "created_utc": "1630970815.0", "edited": "False", "id": "hbv8eqo", "is_submitter": "False", "link_id": "t3_pchi8q", "parent_id": "t3_pchi8q", "score": "1", "subreddit": "Panicland", "subreddit_id": "t5_2e2efw"}, {"author": "_Mexican_Soda_", "body": "Hi everyone! So I have a few questions about the Lalisa album, but I'm not sure if it is worthy of its own post, so I'm going to ask here.\n\nSo, this is the first Kpop album I'm buying and while I am excited because Lisa is my bias wrecker, I'm a bit confused. First of all, what is the difference between the two versions? I saw that there's a black one and a gold one. Is it the same thing but with different covers or do they have actual differences? Secondly, where can I order it from? I'm trying to order it online but I don't really know where to go. Finally, is there any like pre order bonuses of any sort?\n\nThanks in advance!  \n\n\nEdit: Grammar and Spelling", "created_utc": "1630363327.0", "edited": "False", "id": "hazjcd8", "is_submitter": "False", "link_id": "t3_pe4r05", "parent_id": "t3_pe4r05", "score": "8", "subreddit": "BlackPink", "subreddit_id": "t5_3f8po"}, {"author": "_Mexican_Soda_", "body": "Where did you get them at man? I’ve been wanting to buy CD’s but I don’t have a record store near me", "created_utc": "1629936275.0", "edited": "False", "id": "had0584", "is_submitter": "False", "link_id": "t3_pbkd7a", "parent_id": "t3_pbkd7a", "score": "2", "subreddit": "greenday", "subreddit_id": "t5_2snhx"}, {"author": "_Mexican_Soda_", "body": "I have the same questions as you, I also want to get into collecting but I have no idea what portable CD player to get and as you, there's not a lot of thrift stores near me unfortunately. I searched online and found that in best buy's website the first result is a Black Memorex CD Player which is 25$. It has good reviews but I'm still doubting on buying it cause I feel like I could get something better for the same price", "created_utc": "1629087939.0", "edited": "False", "id": "h949yeg", "is_submitter": "False", "link_id": "t3_p4moqz", "parent_id": "t3_p4moqz", "score": "1", "subreddit": "Cd_collectors", "subreddit_id": "t5_2uxz7"}, {"author": "_Mexican_Soda_", "body": "I actually got it, and own it, but sadly I don't own a record player which means I haven't been able to hear the full song either. I hope one day I do get a record player and to be able to listen to it though", "created_utc": "1628799852.0", "edited": "False", "id": "h8p581g", "is_submitter": "False", "link_id": "t3_llje67", "parent_id": "t3_llje67", "score": "1", "subreddit": "Panicland", "subreddit_id": "t5_2e2efw"}, {"author": "_Mexican_Soda_", "body": "I am totally fine being a guy, but recently I started questioning myself and asked a female friend to use female pronouns on me which has made me so damn happy. I still don't know if this is Euphoria or if its something else though", "created_utc": "1628566116.0", "edited": "False", "id": "h8db6xv", "is_submitter": "False", "link_id": "t3_p0xgh0", "parent_id": "t3_p0xgh0", "score": "1", "subreddit": "egg_irl", "subreddit_id": "t5_3n3op"}, {"author": "_Mexican_Soda_", "body": "It does include a Gameboy Adapter, but I don't own any GBA or GBC games so yeah, that isn't really a plus for me hahaha", "created_utc": "1627883534.0", "edited": "False", "id": "h7ee9ed", "is_submitter": "False", "link_id": "t3_ow8bog", "parent_id": "t1_h7edw4e", "score": "1", "subreddit": "nintendo", "subreddit_id": "t5_2qhnk"}, {"author": "_Mexican_Soda_", "body": "I mean it looks pretty good, but I think you could improve on the coloring aspect, try to add shading and make it so that you can't see white lines. Another small detail are the hands, I know its hard to draw hands but just take your time and try to make them look good. Apart from that, its a pretty solid drawing, keep up the good work!", "created_utc": "1627709107.0", "edited": "False", "id": "h7685zk", "is_submitter": "False", "link_id": "t3_ouyv2z", "parent_id": "t3_ouyv2z", "score": "1", "subreddit": "Beyblade", "subreddit_id": "t5_2skjv"}, {"author": "_Mexican_Soda_", "body": "In the Court Of The Crimson King", "created_utc": "1626918215.0", "edited": "False", "id": "h62sf60", "is_submitter": "False", "link_id": "t3_oosxop", "parent_id": "t3_oosxop", "score": "2", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "_Mexican_Soda_", "body": "Thanks for the reply, I was also deciding between the origininal versions or remasters of both Wind Waker and Twilight Princess HD, so thanks for also covering that up! I've decided to play A Link to the Past for now (and continue playing the next games in release order) and so far it is a pretty great game! (Altough the fight against Moldorn is the most frustrating boss battle I've ever played haha). I might give Zelda II a try one day but for now I've decided to stick around with the more classic Zelda titles. Thanks for taking the time to explan all this things to me, it is greatly appreciated!", "created_utc": "1626201132.0", "edited": "False", "id": "h52d763", "is_submitter": "True", "link_id": "t3_oiw04h", "parent_id": "t1_h4zbqe3", "score": "1", "subreddit": "zelda", "subreddit_id": "t5_2r61g"}, {"author": "_Mexican_Soda_", "body": "Ohhh okok, that makes sense, thanks for answering!", "created_utc": "1626130505.0", "edited": "False", "id": "h4z3tut", "is_submitter": "True", "link_id": "t3_oiw04h", "parent_id": "t1_h4ytgtp", "score": "1", "subreddit": "zelda", "subreddit_id": "t5_2r61g"}, {"author": "_Mexican_Soda_", "body": "Thanks for the reply man! I only have a few questions: \n\n1. Do the games have an overarching story line? From what it seems, every game has Link as the protagonist, but it looks like a lot of the games have their own story. Is there a different incarnation of Link on every game or are they all the same Link?\n2. Would it be better to play the Link's Awakening remake, or the original? I own Link's Awakening DX on my nintendo 3DS, but I haven't played it yet, should I get the remake or just play the gameboy color one?\n3. Same question as before but with the Ocarina Of Time and Majora's Mask remasters, should I play the originals or are the remastered version better?\n\nThanks in advance!", "created_utc": "1626122042.0", "edited": "False", "id": "h4ylzqr", "is_submitter": "True", "link_id": "t3_oiw04h", "parent_id": "t1_h4yh0nw", "score": "1", "subreddit": "zelda", "subreddit_id": "t5_2r61g"}, {"author": "_Mexican_Soda_", "body": "I have a Wii U, a 3DS, and a Switch, so I think I can play almost every mainline Zelda game", "created_utc": "1626112486.0", "edited": "False", "id": "h4y1j1d", "is_submitter": "True", "link_id": "t3_oiw04h", "parent_id": "t1_h4xyk4h", "score": "1", "subreddit": "zelda", "subreddit_id": "t5_2r61g"}, {"author": "_Mexican_Soda_", "body": "Diabetes", "created_utc": "1625242950.0", "edited": "False", "id": "h3tkn60", "is_submitter": "False", "link_id": "t3_oc8rea", "parent_id": "t3_oc8rea", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "_Mexican_Soda_", "body": "We all go to hell, momma we all go to hell", "created_utc": "1624732996.0", "edited": "False", "id": "h34rw4m", "is_submitter": "False", "link_id": "t3_o85hhs", "parent_id": "t1_h3359cx", "score": "9", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "_Mexican_Soda_", "body": "I wanna know know know know", "created_utc": "1624732890.0", "edited": "False", "id": "h34ropw", "is_submitter": "False", "link_id": "t3_o85hhs", "parent_id": "t1_h332e3b", "score": "8", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "_Mexican_Soda_", "body": "I don't know if this is a troll or not   \n\n\nIf it's not though, then I would recommend you to start drawing traditionally. From what I see you drew digitally with a mouse or with your fingers on a tablet. It is very hard to draw that way so if you start drawing traditionally it would make learning how to draw easier, then when you get more experience you can start learning how to draw digitally. Drawing is a pretty good and fun hobby and it is really easy to learn the basics so keep going, I know you can do it!", "created_utc": "1624331784.0", "edited": "False", "id": "h2m2ms1", "is_submitter": "False", "link_id": "t3_o50nz5", "parent_id": "t3_o50nz5", "score": "2", "subreddit": "YourLieinApril", "subreddit_id": "t5_33jzj"}, {"author": "_Mexican_Soda_", "body": "Legit the only thing I wanted to see in the direct was some Danganronpa or Persona 4g ports. So damn happy!", "created_utc": "1623783710.0", "edited": "False", "id": "h1vpunz", "is_submitter": "False", "link_id": "t3_o0igdj", "parent_id": "t3_o0igdj", "score": "2", "subreddit": "NintendoSwitch", "subreddit_id": "t5_3h47q"}, {"author": "_Mexican_Soda_", "body": "Ponoboy had it the best, He had two brothers that cared for him, a decent life situation, and a great group of friends", "created_utc": "1621658998.0", "edited": "False", "id": "gz0xmtm", "is_submitter": "False", "link_id": "t3_ni9lbb", "parent_id": "t3_ni9lbb", "score": "7", "subreddit": "TheOutsiders", "subreddit_id": "t5_2uv0o"}, {"author": "_Mexican_Soda_", "body": "Guilty Gear X2 #Reload\n\nThanks!", "created_utc": "1621194999.0", "edited": "False", "id": "gyczkr2", "is_submitter": "False", "link_id": "t3_ndsikw", "parent_id": "t3_ndsikw", "score": "1", "subreddit": "RandomActsOfGaming", "subreddit_id": "t5_2t5mo"}, {"author": "_Mexican_Soda_", "body": "I don't get why this got downvoted. I think its a very valid opinion smh", "created_utc": "1620447257.0", "edited": "False", "id": "gxcs5ai", "is_submitter": "False", "link_id": "t3_n6c0sk", "parent_id": "t1_gx7alct", "score": "22", "subreddit": "feminineboys", "subreddit_id": "t5_2vmuo"}, {"author": "_Mexican_Soda_", "body": "Teacher was in the middle of a lecture when all of a sudden a student starts screaming like every single swear word in existence, apparently he was fighting with someone over the phone. The teacher saw it was by accident though so he didn't even get mad at him and just said \"Guys, remember to take care of the language you use\"", "created_utc": "1613772994.0", "edited": "False", "id": "go1zknh", "is_submitter": "False", "link_id": "t3_lni47f", "parent_id": "t3_lni47f", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "_Mexican_Soda_", "body": "Why though?", "created_utc": "1611349736.0", "edited": "False", "id": "gk8mnc2", "is_submitter": "False", "link_id": "t3_l2gyy9", "parent_id": "t1_gk8k5qh", "score": "0", "subreddit": "TheOutsiders", "subreddit_id": "t5_2uv0o"}, {"author": "_Mexican_Soda_", "body": "Same thing I was thinking!", "created_utc": "1611113036.0", "edited": "False", "id": "gjwnheu", "is_submitter": "False", "link_id": "t3_l0nhgb", "parent_id": "t1_gjwj0om", "score": "1", "subreddit": "drawing", "subreddit_id": "t5_2qvp9"}, {"author": "_Mexican_Soda_", "body": "This is quote material", "created_utc": "1611110020.0", "edited": "False", "id": "gjwi04i", "is_submitter": "False", "link_id": "t3_l0cwjv", "parent_id": "t1_gjw4c2c", "score": "2", "subreddit": "TheOutsiders", "subreddit_id": "t5_2uv0o"}, {"author": "_Mexican_Soda_", "body": "I'm not the OP, but I think most people here use rightstuff", "created_utc": "1610695851.0", "edited": "False", "id": "gjbmwjg", "is_submitter": "False", "link_id": "t3_kxlurj", "parent_id": "t1_gjbmnk2", "score": "5", "subreddit": "MangaCollectors", "subreddit_id": "t5_3p7rg"}, {"author": "_Mexican_Soda_", "body": "I don't really know how much you care about quality, but I would say they are a good option if you know how to read in spanish. At the moment I own about 67 volumes from panini (or about 2/3 of my collection) and I haven't had any problems with them. While I do must admit that the English releases have better paper quality, and are bigger, it isn't that big of a difference (or atleast for me). I have to say that theres even some releases from Panini which I chose over their American counterpart, like for example I chose the Yu Yu Hakusho release from Panini over its VIZ media counterpart because it was bigger, had a lot of colored pages, had a better looking cover, and had a dust jacket. So yeah, you might want to check them out.", "created_utc": "1610692156.0", "edited": "False", "id": "gjbikii", "is_submitter": "False", "link_id": "t3_jo2yh2", "parent_id": "t1_gj76uez", "score": "2", "subreddit": "MangaCollectors", "subreddit_id": "t5_3p7rg"}, {"author": "_Mexican_Soda_", "body": "Where did you get Act Age? I have volume 2 but I haven't found volume 1 anywhere", "created_utc": "1610075713.0", "edited": "False", "id": "gii3154", "is_submitter": "False", "link_id": "t3_ksmmcs", "parent_id": "t3_ksmmcs", "score": "3", "subreddit": "MangaCollectors", "subreddit_id": "t5_3p7rg"}, {"author": "_Mexican_Soda_", "body": "Is that an \"The Outsiders\" Reference?", "created_utc": "1609923261.0", "edited": "False", "id": "giabp6o", "is_submitter": "False", "link_id": "t3_jo4asw", "parent_id": "t1_gb5n6se", "score": "1", "subreddit": "danganronpa", "subreddit_id": "t5_2wcd0"}, {"author": "_Mexican_Soda_", "body": "How do I learn to draw as well as you?!", "created_utc": "1609886651.0", "edited": "False", "id": "gi8hk7f", "is_submitter": "False", "link_id": "t3_kqkhzf", "parent_id": "t3_kqkhzf", "score": "2", "subreddit": "FullmetalAlchemist", "subreddit_id": "t5_2t27s"}, {"author": "_Mexican_Soda_", "body": "So you started that collection in just 4 days?! Damn!", "created_utc": "1609798135.0", "edited": "False", "id": "gi441n4", "is_submitter": "False", "link_id": "t3_kqexe4", "parent_id": "t3_kqexe4", "score": "14", "subreddit": "MangaCollectors", "subreddit_id": "t5_3p7rg"}, {"author": "_Mexican_Soda_", "body": "Lo unico malo es que la mayoria de series viejas estan out of stock en las paginas oficiales de panini la mayoria del tiempo. Tambien vivo cerca del borde Tamaulipeco pero al en mi ciudad no hay tiendas de manga (O al menos que yo sepa) asi que tampoco las puedo conseguir fisicamente. Aun asi, las serie que si estan es stock tienen muy buen precio, y siempre es bueno apoyar a la industria local jajaja", "created_utc": "1607832058.0", "edited": "False", "id": "gfn0ene", "is_submitter": "False", "link_id": "t3_kbvyzg", "parent_id": "t1_gflongs", "score": "1", "subreddit": "MangaCollectors", "subreddit_id": "t5_3p7rg"}, {"author": "_Mexican_Soda_", "body": "I don't know, but you could maybe you could try asking in r/tipofmytongue. Those guys are fucking legends", "created_utc": "1607818442.0", "edited": "False", "id": "gfm3ojg", "is_submitter": "False", "link_id": "t3_kby2gl", "parent_id": "t3_kby2gl", "score": "2", "subreddit": "manga", "subreddit_id": "t5_2ql0i"}, {"author": "_Mexican_Soda_", "body": "Personally, I think it depends on the person. I watched without spoilers and I didn't cry and only felt kinda sad for a couple of hours. If you are gonna watch it just because you want to see something sad, I personally wouldn't recommend it. If you want to see a story about music with some romance involved though, I would 100% recommend it", "created_utc": "1607792962.0", "edited": "False", "id": "gfjvo7z", "is_submitter": "False", "link_id": "t3_kbqm4j", "parent_id": "t3_kbqm4j", "score": "1", "subreddit": "YourLieinApril", "subreddit_id": "t5_33jzj"}, {"author": "_Mexican_Soda_", "body": "I just started playing Danganronpa like three days ago, but I love this man!", "created_utc": "1607621290.0", "edited": "False", "id": "gfavqpf", "is_submitter": "False", "link_id": "t3_kaicf2", "parent_id": "t3_kaicf2", "score": "4", "subreddit": "Beyblade", "subreddit_id": "t5_2skjv"}, {"author": "_Mexican_Soda_", "body": "Disculpa, que editorial es la de Stone Ocean? Aqui en Mexico apenas vamos en Diamond is unbreakable :(", "created_utc": "1607529248.0", "edited": "False", "id": "gf6e3xt", "is_submitter": "False", "link_id": "t3_k8er88", "parent_id": "t3_k8er88", "score": "2", "subreddit": "MangaCollectors", "subreddit_id": "t5_3p7rg"}, {"author": "_Mexican_Soda_", "body": "So, the cowboy bebop opening was made by a band called \"The Seatbelts\". This version is like the live version the band played or something", "created_utc": "1607200568.0", "edited": "False", "id": "geqe8xb", "is_submitter": "False", "link_id": "t3_k6nigm", "parent_id": "t1_gennpok", "score": "1", "subreddit": "TheMandalorianTV", "subreddit_id": "t5_u8wq5"}, {"author": "_Mexican_Soda_", "body": "Where did you find the Kaiji volume? I have wanted to get the manga because it’s an anime I really liked. And also, how is the edition, is it worth it?", "created_utc": "1606722665.0", "edited": "False", "id": "ge4owjw", "is_submitter": "False", "link_id": "t3_k3l6v1", "parent_id": "t3_k3l6v1", "score": "1", "subreddit": "MangaCollectors", "subreddit_id": "t5_3p7rg"}, {"author": "_Mexican_Soda_", "body": "What happens if you live in a humid area? Does it damage the book?", "created_utc": "1606370157.0", "edited": "False", "id": "gdmslyy", "is_submitter": "False", "link_id": "t3_k0jz2n", "parent_id": "t1_gdly8fw", "score": "2", "subreddit": "MangaCollectors", "subreddit_id": "t5_3p7rg"}, {"author": "_Mexican_Soda_", "body": "Another panini collector, nice!", "created_utc": "1606368336.0", "edited": "False", "id": "gdmq6v7", "is_submitter": "False", "link_id": "t3_k16kjz", "parent_id": "t3_k16kjz", "score": "2", "subreddit": "MangaCollectors", "subreddit_id": "t5_3p7rg"}, {"author": "_Mexican_Soda_", "body": "Wait legit?! So if I pay the discount price right now I will receive it when it’s available? That’s a really good advice I didn’t know haha, thanks man!", "created_utc": "1606120096.0", "edited": "False", "id": "gdbc5ab", "is_submitter": "False", "link_id": "t3_jz6pam", "parent_id": "t1_gdbb8yh", "score": "1", "subreddit": "mangadeals", "subreddit_id": "t5_aenjc"}, {"author": "_Mexican_Soda_", "body": "Almost everything is out of stock though :(", "created_utc": "1606097080.0", "edited": "False", "id": "gdafxz4", "is_submitter": "False", "link_id": "t3_jz6pam", "parent_id": "t1_gda979n", "score": "2", "subreddit": "mangadeals", "subreddit_id": "t5_aenjc"}, {"author": "_Mexican_Soda_", "body": "Thanks for actually coming back and giving the answer man. Almost nobody does that and I was actually interested in you finding the name of the comic because the plot sounded good. Really appreciate it man", "created_utc": "1605994236.0", "edited": "False", "id": "gd445vy", "is_submitter": "False", "link_id": "t3_juo0b9", "parent_id": "t1_gcu9sn1", "score": "1", "subreddit": "tipofmytongue", "subreddit_id": "t5_2r4oc"}, {"author": "_Mexican_Soda_", "body": "Dude of course it’s a joke man haha", "created_utc": "1605977605.0", "edited": "False", "id": "gd2rgim", "is_submitter": "False", "link_id": "t3_jydwqd", "parent_id": "t3_jydwqd", "score": "11", "subreddit": "YourLieinApril", "subreddit_id": "t5_33jzj"}, {"author": "_Mexican_Soda_", "body": "Imma just leave this comment here so that when somebody replies with the name of the sub I get reminded", "created_utc": "1605810418.0", "edited": "False", "id": "gcur032", "is_submitter": "False", "link_id": "t3_jx3p03", "parent_id": "t1_gcu9ezo", "score": "3", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "_Mexican_Soda_", "body": "I usually get mine from tiendapanini.com, it is the official publisher website. I’m not really sure if they ship to the US though. Also, take in consideration that manga in Spanish speaking countries isn’t that famous so unfortunately some volumes might be hard to find since they don’t reprint as much :/\n\n(Btw, you are like the best uncle ever haha)\n\nEdit: Spelling", "created_utc": "1605758568.0", "edited": "1605758903.0", "id": "gcsojg4", "is_submitter": "False", "link_id": "t3_jwsss9", "parent_id": "t3_jwsss9", "score": "1", "subreddit": "MangaCollectors", "subreddit_id": "t5_3p7rg"}, {"author": "_Mexican_Soda_", "body": "OG Twilight Zone, imagine all the new stories they could come up with in this new age with technology", "created_utc": "1605751306.0", "edited": "False", "id": "gcsbmp2", "is_submitter": "False", "link_id": "t3_jwl5jy", "parent_id": "t3_jwl5jy", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "_Mexican_Soda_", "body": "Shijima no soko kara...", "created_utc": "1605751152.0", "edited": "False", "id": "gcsbcej", "is_submitter": "False", "link_id": "t3_jwj36r", "parent_id": "t3_jwj36r", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "_Mexican_Soda_", "body": "Best fucking TV show ever", "created_utc": "1605751093.0", "edited": "False", "id": "gcsb8g9", "is_submitter": "False", "link_id": "t3_jwj36r", "parent_id": "t1_gcqhri8", "score": "2", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "_Mexican_Soda_", "body": "I actually remember the second intro more than the first one cause it I think it fitted more in the show \n(Don’t kill me plz)", "created_utc": "1605751012.0", "edited": "False", "id": "gcsb2xp", "is_submitter": "False", "link_id": "t3_jwj36r", "parent_id": "t1_gcqe8c3", "score": "4", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "_Mexican_Soda_", "body": "The Breakfast Club, Life Is Beautiful, The Outsiders", "created_utc": "1605745153.0", "edited": "False", "id": "gcs0eaf", "is_submitter": "False", "link_id": "t3_jwm8ai", "parent_id": "t3_jwm8ai", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "_Mexican_Soda_", "body": "I’m not an expert, but maybe Rightstuff or Crunchyroll? I don’t really think there is s lot of options since YLIA is not that popular of an anime but try searching in those websites", "created_utc": "1605735987.0", "edited": "False", "id": "gcrh1er", "is_submitter": "False", "link_id": "t3_jwnjyq", "parent_id": "t3_jwnjyq", "score": "1", "subreddit": "YourLieinApril", "subreddit_id": "t5_33jzj"}, {"author": "_Mexican_Soda_", "body": "Oh, okok. It’s a famous book and one that I really like. If you like reading novels you should give it a try. It also has a movie but I didn’t like it that much though.", "created_utc": "1605733887.0", "edited": "False", "id": "gcrcmk8", "is_submitter": "False", "link_id": "t3_jv3v4h", "parent_id": "t1_gcrc2vj", "score": "2", "subreddit": "MangaCollectors", "subreddit_id": "t5_3p7rg"}, {"author": "_Mexican_Soda_", "body": "You are so fricking lucky man!\nBtw, is the English edition of Kakegurui good? I’ve been wanting to get it for a long time but I don’t know if it’s worth it.", "created_utc": "1605733285.0", "edited": "False", "id": "gcrbckr", "is_submitter": "False", "link_id": "t3_jwnizj", "parent_id": "t3_jwnizj", "score": "6", "subreddit": "MangaCollectors", "subreddit_id": "t5_3p7rg"}, {"author": "_Mexican_Soda_", "body": "Yeah, boxsets are mostly a good deal, Actually I’m eager to get the Tokyo Ghoul Boxset this Christmas (If it’s on stock). Also the low prices here in Mexico do really help me to complete some long shonen series like Naruto or DBZ. \n\n\n(Btw, is your username a “The Outsiders” reference?, just curious haha)", "created_utc": "1605732766.0", "edited": "False", "id": "gcra8jj", "is_submitter": "False", "link_id": "t3_jv3v4h", "parent_id": "t1_gcr9db3", "score": "1", "subreddit": "MangaCollectors", "subreddit_id": "t5_3p7rg"}, {"author": "_Mexican_Soda_", "body": "The prices are really good. They are about 4 dollars each if you buy the normal tankabons with no hardcover or color pages. If you buy Boxsets you can get even lower prices. For example the Naruto Boxset with the first 27 volumes is at about 80 dollars which would make each volume have a price of 3 dollars which I think it is a really good price. The only bad thing is that manga in Mexico isn’t as big as in the US and sometimes finding them is hard, especially because half of the time the mangas I want to buy are out of stock even on the official publisher’s website. Also another thing to take into consideration is that for example the boxsets have really disposable boxes. It isn’t really a problem for me since I don’t really use the boxes and it helps keep the prices low, but some people do like keeping and displaying the boxes and it is a problem for them.\n\nEdit: Spelling", "created_utc": "1605731349.0", "edited": "1605731959.0", "id": "gcr78i6", "is_submitter": "False", "link_id": "t3_jv3v4h", "parent_id": "t1_gcr2d9c", "score": "2", "subreddit": "MangaCollectors", "subreddit_id": "t5_3p7rg"}, {"author": "_Mexican_Soda_", "body": "A little late, but I’m from Mexico and I also end up always buying the English realeases. While usually our editions here have better translations  and have nice stuff (like the fact that they leave the original onomatopoeias instead of translating it), they are smaller and have a overall worse paper quality. The English editions usually are bigger and have better overall quality. I only really buy my country’s edition when they are better quality than the English ones (Yuyu Hakusho), when I like the spines better (My Hero Academia), or when the translation is better (Kaguya Sama)", "created_utc": "1605716339.0", "edited": "False", "id": "gcqbdpz", "is_submitter": "False", "link_id": "t3_jv3v4h", "parent_id": "t3_jv3v4h", "score": "2", "subreddit": "MangaCollectors", "subreddit_id": "t5_3p7rg"}, {"author": "_Mexican_Soda_", "body": "I’m not the OP but I’m 90% sure that the pun pun volumes are the Panini (Mexico/Argentina) realeases because of the logo", "created_utc": "1605487709.0", "edited": "False", "id": "gcg23ny", "is_submitter": "False", "link_id": "t3_jurdwl", "parent_id": "t1_gcfybkq", "score": "1", "subreddit": "MangaCollectors", "subreddit_id": "t5_3p7rg"}, {"author": "_Mexican_Soda_", "body": "Please Help", "created_utc": "1605462410.0", "edited": "False", "id": "gceozds", "is_submitter": "True", "link_id": "t3_jupwpq", "parent_id": "t3_jupwpq", "score": "1", "subreddit": "tipofmytongue", "subreddit_id": "t5_2r4oc"}, {"author": "_Mexican_Soda_", "body": "Yeah haha, some of their editions are sometimes better like their new Yuyu Hakusho ones", "created_utc": "1605252217.0", "edited": "False", "id": "gc4tibf", "is_submitter": "False", "link_id": "t3_jsgmoi", "parent_id": "t1_gc4gqy1", "score": "1", "subreddit": "MangaCollectors", "subreddit_id": "t5_3p7rg"}, {"author": "_Mexican_Soda_", "body": "Yeah, I think everybody agrees that it was a really dumb idea the rule applying even though he sold the book, but I think they just needed to do that so that the guy would die and there was no more material for the oneshot haha", "created_utc": "1605211712.0", "edited": "False", "id": "gc2x5b7", "is_submitter": "False", "link_id": "t3_jsr5yw", "parent_id": "t3_jsr5yw", "score": "2", "subreddit": "deathnote", "subreddit_id": "t5_2riqp"}, {"author": "_Mexican_Soda_", "body": "Strike hard, Strike first, No mercy", "created_utc": "1605042186.0", "edited": "False", "id": "gbv8vg4", "is_submitter": "False", "link_id": "t3_jropdv", "parent_id": "t3_jropdv", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "_Mexican_Soda_", "body": "What poster is it?", "created_utc": "1605039601.0", "edited": "False", "id": "gbv3ifc", "is_submitter": "False", "link_id": "t3_jrpiv9", "parent_id": "t3_jrpiv9", "score": "5", "subreddit": "TheOutsiders", "subreddit_id": "t5_2uv0o"}, {"author": "_Mexican_Soda_", "body": "Yes, it is the equivalent of the 3 in 1s you guys would be getting", "created_utc": "1604936004.0", "edited": "False", "id": "gbq5h8h", "is_submitter": "True", "link_id": "t3_jqq5st", "parent_id": "t1_gbp92id", "score": "1", "subreddit": "MangaCollectors", "subreddit_id": "t5_3p7rg"}, {"author": "_Mexican_Soda_", "body": "I remember my English teacher used to have those haha, Might add them to my collection one day", "created_utc": "1604906045.0", "edited": "False", "id": "gbp5zz5", "is_submitter": "False", "link_id": "t3_jqrxg2", "parent_id": "t3_jqrxg2", "score": "2", "subreddit": "MangaCollectors", "subreddit_id": "t5_3p7rg"}, {"author": "_Mexican_Soda_", "body": "That’s nice man! A lot of people have been telling me that it’s really good so I hope I enjoy reading it. Btw, do you know how many volumes will the 3 in 1 have? I’m just curious haha", "created_utc": "1604896096.0", "edited": "False", "id": "gbotqvi", "is_submitter": "True", "link_id": "t3_jqq5st", "parent_id": "t1_gbosslo", "score": "1", "subreddit": "MangaCollectors", "subreddit_id": "t5_3p7rg"}, {"author": "_Mexican_Soda_", "body": "No, it is the Mexican/Argentinian realease of Shaman King. It is basically the equivalent of the American 3 in 1 though", "created_utc": "1604895332.0", "edited": "False", "id": "gbosl95", "is_submitter": "True", "link_id": "t3_jqq5st", "parent_id": "t1_gbos3x7", "score": "1", "subreddit": "MangaCollectors", "subreddit_id": "t5_3p7rg"}, {"author": "_Mexican_Soda_", "body": "You should make a tutorial of it haha, there’s a lot of spines that are different to the other ones in the same series and or some that are just plain boring like the Cowboy Bebop manga ones", "created_utc": "1604893619.0", "edited": "False", "id": "gbopw7c", "is_submitter": "False", "link_id": "t3_jqp1a9", "parent_id": "t1_gboo84q", "score": "2", "subreddit": "MangaCollectors", "subreddit_id": "t5_3p7rg"}, {"author": "_Mexican_Soda_", "body": "True haha, maybe I got a little mad", "created_utc": "1604824875.0", "edited": "False", "id": "gbkztzv", "is_submitter": "False", "link_id": "t3_jq4fbh", "parent_id": "t1_gbkj833", "score": "3", "subreddit": "TheOutsiders", "subreddit_id": "t5_2uv0o"}, {"author": "_Mexican_Soda_", "body": "Bro, Ponyboy is like one of the worst protagonists I’ve seen tbh. He caused a bunch of problems and deaths just because Darry slapped him and ran away like a little girl who wants attention", "created_utc": "1604811790.0", "edited": "False", "id": "gbk4rj0", "is_submitter": "False", "link_id": "t3_jq4fbh", "parent_id": "t3_jq4fbh", "score": "1", "subreddit": "TheOutsiders", "subreddit_id": "t5_2uv0o"}, {"author": "_Mexican_Soda_", "body": "This is the most wholesome comment I've seen this month wtf haha", "created_utc": "1604598833.0", "edited": "False", "id": "gb90qco", "is_submitter": "False", "link_id": "t3_jogvop", "parent_id": "t1_gb8bpz5", "score": "7", "subreddit": "cowboybebop", "subreddit_id": "t5_2sn1i"}, {"author": "_Mexican_Soda_", "body": "Finally, someone that collects Panini! Nice to see more people collecting Panini", "created_utc": "1604535410.0", "edited": "False", "id": "gb6b51b", "is_submitter": "False", "link_id": "t3_jo2yh2", "parent_id": "t3_jo2yh2", "score": "3", "subreddit": "MangaCollectors", "subreddit_id": "t5_3p7rg"}, {"author": "_Mexican_Soda_", "body": "Best drawing I've seen this week, 10/10", "created_utc": "1604505990.0", "edited": "False", "id": "gb4lmqp", "is_submitter": "False", "link_id": "t3_jnx981", "parent_id": "t3_jnx981", "score": "6", "subreddit": "Konosuba", "subreddit_id": "t5_3c02n"}, {"author": "_Mexican_Soda_", "body": "Wait, does act age have English releases?!", "created_utc": "1604505706.0", "edited": "False", "id": "gb4l1e9", "is_submitter": "False", "link_id": "t3_jnqdru", "parent_id": "t3_jnqdru", "score": "2", "subreddit": "MangaCollectors", "subreddit_id": "t5_3p7rg"}, {"author": "_Mexican_Soda_", "body": "Depending on how filled your Pokedex was, this is the worst one yet smh", "created_utc": "1604504169.0", "edited": "False", "id": "gb4huib", "is_submitter": "False", "link_id": "t3_jnaf52", "parent_id": "t1_gb0qv9z", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "_Mexican_Soda_", "body": "An idea that was necessary at first but now its only purpose is to create an imaginary war between genders that doesn't exist", "created_utc": "1604444059.0", "edited": "False", "id": "gb1zw75", "is_submitter": "False", "link_id": "t3_jl5q6h", "parent_id": "t3_jl5q6h", "score": "1", "subreddit": "antifeminists", "subreddit_id": "t5_2zaj2"}, {"author": "_Mexican_Soda_", "body": "Don't worry haha. Thanks for answering man!", "created_utc": "1604353241.0", "edited": "False", "id": "gaxu6ke", "is_submitter": "False", "link_id": "t3_jmmud6", "parent_id": "t1_gaxtb3d", "score": "2", "subreddit": "MangaCollectors", "subreddit_id": "t5_3p7rg"}, {"author": "_Mexican_Soda_", "body": "Wait man, where did you buy it? I'm currently also forward to buying this boxset but the lowest price I have seen is 100$ (£75). Was it like a special deal you got?", "created_utc": "1604333591.0", "edited": "False", "id": "gawos13", "is_submitter": "False", "link_id": "t3_jmmud6", "parent_id": "t1_gawbqvk", "score": "1", "subreddit": "MangaCollectors", "subreddit_id": "t5_3p7rg"}, {"author": "_Mexican_Soda_", "body": "The Promised Neverland editions looks different, what edition are they?", "created_utc": "1603616030.0", "edited": "False", "id": "ga15xq5", "is_submitter": "False", "link_id": "t3_jhfbxk", "parent_id": "t3_jhfbxk", "score": "2", "subreddit": "MangaCollectors", "subreddit_id": "t5_3p7rg"}, {"author": "_Mexican_Soda_", "body": "Awesome man! I award you the poor man’s gold: 🏅", "created_utc": "1603611593.0", "edited": "False", "id": "ga0xloj", "is_submitter": "False", "link_id": "t3_jhjbbq", "parent_id": "t3_jhjbbq", "score": "1", "subreddit": "YourLieinApril", "subreddit_id": "t5_33jzj"}, {"author": "_Mexican_Soda_", "body": "Al fin encuentro a alguien que también compra panini :,)", "created_utc": "1603378916.0", "edited": "False", "id": "g9nivdr", "is_submitter": "False", "link_id": "t3_je585u", "parent_id": "t3_je585u", "score": "2", "subreddit": "MangaCollectors", "subreddit_id": "t5_3p7rg"}, {"author": "_Mexican_Soda_", "body": "A wise man once said: “Whenever you meet someone with a stupid conspiracy theory just respond with an even dumber one”\n\n-“Dude, the coronavirus was made by the Democrats to defeat Trump”\n\n+”Wait, do you actually believe the coronavirus is a real thing?!”", "created_utc": "1603264646.0", "edited": "False", "id": "g9iq89x", "is_submitter": "False", "link_id": "t3_jf4ufi", "parent_id": "t1_g9ipadg", "score": "150", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "_Mexican_Soda_", "body": "In my opinion the narrator makes the show like 100 times better! Hahahahaha", "created_utc": "1603260013.0", "edited": "False", "id": "g9ilfil", "is_submitter": "False", "link_id": "t3_jdpul8", "parent_id": "t1_g9aphbr", "score": "3", "subreddit": "MangaCollectors", "subreddit_id": "t5_3p7rg"}, {"author": "_Mexican_Soda_", "body": "FINALLY I FOUND SOMEONE WHO ALSO COLLECTS PANINI MANGA! Dude, this is a nice collection! Where did you buy most of you manga btw? The official website, the official stores, or do you have other sites?", "created_utc": "1603259895.0", "edited": "False", "id": "g9ilat7", "is_submitter": "False", "link_id": "t3_jdkaqi", "parent_id": "t3_jdkaqi", "score": "2", "subreddit": "MangaCollectors", "subreddit_id": "t5_3p7rg"}, {"author": "_Mexican_Soda_", "body": "Could I ask which edition of the Pokespe is that one? I currently have the first three VIZ media volumes but they are about to become 5 years old and those editions you have look nice af", "created_utc": "1603255301.0", "edited": "False", "id": "g9ifter", "is_submitter": "False", "link_id": "t3_je95sy", "parent_id": "t3_je95sy", "score": "1", "subreddit": "MangaCollectors", "subreddit_id": "t5_3p7rg"}, {"author": "_Mexican_Soda_", "body": "Eres latinoamericano verdad?", "created_utc": "1603207619.0", "edited": "False", "id": "g9fvrdb", "is_submitter": "False", "link_id": "t3_jcuz49", "parent_id": "t1_g946t9g", "score": "1", "subreddit": "YourLieinApril", "subreddit_id": "t5_33jzj"}, {"author": "_Mexican_Soda_", "body": "Yo this is awesome af!", "created_utc": "1603139154.0", "edited": "False", "id": "g9d4ifl", "is_submitter": "False", "link_id": "t3_je40bw", "parent_id": "t3_je40bw", "score": "2", "subreddit": "KanojoOkarishimasu", "subreddit_id": "t5_izi65"}, {"author": "_Mexican_Soda_", "body": "I’m anime only watcher but still, I can’t get how is that the truth smh", "created_utc": "1603138878.0", "edited": "False", "id": "g9d3y7x", "is_submitter": "False", "link_id": "t3_je69a5", "parent_id": "t1_g9d2ao9", "score": "3", "subreddit": "KanojoOkarishimasu", "subreddit_id": "t5_izi65"}, {"author": "_Mexican_Soda_", "body": "WDYM?!!!!", "created_utc": "1603138036.0", "edited": "False", "id": "g9d28az", "is_submitter": "False", "link_id": "t3_je69a5", "parent_id": "t1_g9cyled", "score": "2", "subreddit": "KanojoOkarishimasu", "subreddit_id": "t5_izi65"}, {"author": "_Mexican_Soda_", "body": "I take it more like a motivation but whatever haha", "created_utc": "1603137979.0", "edited": "False", "id": "g9d23mt", "is_submitter": "False", "link_id": "t3_je0yt5", "parent_id": "t1_g9c6c9w", "score": "1", "subreddit": "KanojoOkarishimasu", "subreddit_id": "t5_izi65"}, {"author": "_Mexican_Soda_", "body": "It’s a character from the anime “Kanojo Okarashimasu” and she is famous because everybody hates her haha", "created_utc": "1603077432.0", "edited": "False", "id": "g9ag04b", "is_submitter": "False", "link_id": "t3_jaev49", "parent_id": "t1_g9aczcg", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "_Mexican_Soda_", "body": "That exactly happened to me! My friend was like “Oh man, this anime is going to CRUSH and SHATTER your heart, you’ll cry every time you remember the anime”. I didn’t get spoiled but it seemed kind of obvious, and when I watched the ending I didn’t feel anything and actually felt kind of disappointed. I even watched it another time just to feel something but I didn’t. My reasoning for this is that the people make your expectations about it being sad so high that when the moment comes you simply feel kind of disappointed. Maybe if people just told others that’s it’s just a simple music/romance anime it would make them get really blown away by the plot twist. Also I think maybe the anime was a little bit boring for me in some episodes and I didn’t really get too attached to Kaori which also played a role on me not feeling anything. It was still a great anime for me and I ended up appreciating the ending a lot to the point I joined this subreddit.", "created_utc": "1602968680.0", "edited": "False", "id": "g953j9l", "is_submitter": "False", "link_id": "t3_jcuz49", "parent_id": "t3_jcuz49", "score": "3", "subreddit": "YourLieinApril", "subreddit_id": "t5_33jzj"}, {"author": "_Mexican_Soda_", "body": "NO WAY JUAN IS BECOMING FAMOUS! HAHAHAHAHA! NICEEEEE!", "created_utc": "1602781769.0", "edited": "False", "id": "g8wzrn2", "is_submitter": "False", "link_id": "t3_jbn0dn", "parent_id": "t3_jbn0dn", "score": "2", "subreddit": "KanojoOkarishimasu", "subreddit_id": "t5_izi65"}, {"author": "_Mexican_Soda_", "body": "I waterboard him with Mexican Soda? Ok, that’s kind of creepy...", "created_utc": "1602713876.0", "edited": "False", "id": "g8uaqqf", "is_submitter": "False", "link_id": "t3_jb4dsz", "parent_id": "t3_jb4dsz", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "_Mexican_Soda_", "body": "Make a bunch of the machines at Med Bay and make everyone get scanned", "created_utc": "1602702170.0", "edited": "False", "id": "g8to4pj", "is_submitter": "False", "link_id": "t3_jb4ezx", "parent_id": "t3_jb4ezx", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "_Mexican_Soda_", "body": "Anime is Japanese animation (Cowboy Bebop, Evangelion, Naruto, Dragon Ball Z, etc)", "created_utc": "1602701785.0", "edited": "False", "id": "g8tnd31", "is_submitter": "False", "link_id": "t3_jb0u28", "parent_id": "t1_g8t3qlh", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "_Mexican_Soda_", "body": "My Hero Academia, I don’t think I need to explain why...", "created_utc": "1602652628.0", "edited": "False", "id": "g8rqkc6", "is_submitter": "False", "link_id": "t3_jaq1ru", "parent_id": "t3_jaq1ru", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "_Mexican_Soda_", "body": "Probably not, I mean it’s kind of like Jojo openings where if you put too much attention you can maybe get spoiled, but I don’t think so really, you’ll be fine", "created_utc": "1602651933.0", "edited": "False", "id": "g8rpqya", "is_submitter": "False", "link_id": "t3_jasgqi", "parent_id": "t3_jasgqi", "score": "1", "subreddit": "YourLieinApril", "subreddit_id": "t5_33jzj"}, {"author": "_Mexican_Soda_", "body": "RTX 3090. That’s it", "created_utc": "1602637800.0", "edited": "False", "id": "g8r407m", "is_submitter": "False", "link_id": "t3_japnc3", "parent_id": "t3_japnc3", "score": "3", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "_Mexican_Soda_", "body": "I can’t remember but for sure he does mention why", "created_utc": "1602619740.0", "edited": "False", "id": "g8q5gc9", "is_submitter": "False", "link_id": "t3_jajfmj", "parent_id": "t3_jajfmj", "score": "3", "subreddit": "cowboybebop", "subreddit_id": "t5_2sn1i"}, {"author": "_Mexican_Soda_", "body": "Mami Chan, everybody knows why", "created_utc": "1602618016.0", "edited": "False", "id": "g8q20r8", "is_submitter": "False", "link_id": "t3_jaev49", "parent_id": "t3_jaev49", "score": "3", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "_Mexican_Soda_", "body": "OH MY GOD SAME!!! Bad thing is my last name is in Spanish so my kid’s full name wouldn’t sound any good", "created_utc": "1602615735.0", "edited": "False", "id": "g8pxgn1", "is_submitter": "False", "link_id": "t3_jafawf", "parent_id": "t1_g8pbzk5", "score": "8", "subreddit": "TheOutsiders", "subreddit_id": "t5_2uv0o"}, {"author": "_Mexican_Soda_", "body": "Today is the anniversary of the day YLIA first aired?", "created_utc": "1602354767.0", "edited": "False", "id": "g8ckxfk", "is_submitter": "False", "link_id": "t3_j8fwu1", "parent_id": "t3_j8fwu1", "score": "1", "subreddit": "YourLieinApril", "subreddit_id": "t5_33jzj"}, {"author": "_Mexican_Soda_", "body": "I mean yeah, but sometimes the ESRB messes up like so bad and you end up with parents not letting you play Smash Bros at 10 years old because it is rated ESRB +13", "created_utc": "1602264505.0", "edited": "False", "id": "g88hlin", "is_submitter": "False", "link_id": "t3_j7y1k7", "parent_id": "t3_j7y1k7", "score": "1", "subreddit": "pcmasterrace", "subreddit_id": "t5_2sgp1"}, {"author": "_Mexican_Soda_", "body": "Oklahoma boy gets shot by police under street lamp by pointing at them with an unloaded gun", "created_utc": "1601995838.0", "edited": "False", "id": "g7wdwfm", "is_submitter": "False", "link_id": "t3_j653x1", "parent_id": "t3_j653x1", "score": "2", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "_Mexican_Soda_", "body": "Sometimes my mind plays tricks on me", "created_utc": "1601945631.0", "edited": "False", "id": "g7um8w2", "is_submitter": "False", "link_id": "t3_j5qu4r", "parent_id": "t1_g7ufzm3", "score": "10", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "_Mexican_Soda_", "body": "Excuse me, but what exactly is Okland Coffee?", "created_utc": "1601918291.0", "edited": "False", "id": "g7t2wfn", "is_submitter": "False", "link_id": "t3_j5ms6q", "parent_id": "t3_j5ms6q", "score": "6", "subreddit": "greenday", "subreddit_id": "t5_2snhx"}, {"author": "_Mexican_Soda_", "body": "Really nice drawing man!", "created_utc": "1601918184.0", "edited": "False", "id": "g7t2nro", "is_submitter": "False", "link_id": "t3_j5m98d", "parent_id": "t3_j5m98d", "score": "1", "subreddit": "greenday", "subreddit_id": "t5_2snhx"}, {"author": "_Mexican_Soda_", "body": "When we barely finished reading “The Outsiders” at school, I became completely obsessed with it and all the greaser/50s aesthetic type of thing. It was fun not gonna lie", "created_utc": "1601866077.0", "edited": "False", "id": "g7r0wtk", "is_submitter": "False", "link_id": "t3_j53whp", "parent_id": "t3_j53whp", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "_Mexican_Soda_", "body": "O kawaii koto... *shivers* Not sure if I would like that...", "created_utc": "1601668719.0", "edited": "False", "id": "g7frqga", "is_submitter": "False", "link_id": "t3_j3v0p1", "parent_id": "t3_j3v0p1", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "_Mexican_Soda_", "body": "How did you do that man?!", "created_utc": "1601579632.0", "edited": "False", "id": "g7bhg6w", "is_submitter": "False", "link_id": "t3_j3ex36", "parent_id": "t3_j3ex36", "score": "16", "subreddit": "KanojoOkarishimasu", "subreddit_id": "t5_izi65"}, {"author": "_Mexican_Soda_", "body": "WHY DOESNT THIS HAVE MORE UPVOTES?! INCREDIBLE MAN! Take my Poor man’s gold: 🏅", "created_utc": "1601577261.0", "edited": "False", "id": "g7bbu7f", "is_submitter": "False", "link_id": "t3_j39gyu", "parent_id": "t3_j39gyu", "score": "3", "subreddit": "drawing", "subreddit_id": "t5_2qvp9"}, {"author": "_Mexican_Soda_", "body": "Soul knight. It’s one of the best mobile games in my opinion but almost nobody seems to care about it!", "created_utc": "1601573181.0", "edited": "False", "id": "g7b2hur", "is_submitter": "False", "link_id": "t3_j3b62n", "parent_id": "t3_j3b62n", "score": "3", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "_Mexican_Soda_", "body": "Where did you post it? I’m actually kind of interested in reading it haha", "created_utc": "1601513741.0", "edited": "False", "id": "g78luv2", "is_submitter": "False", "link_id": "t3_j2xkys", "parent_id": "t1_g78lqj2", "score": "3", "subreddit": "TheOutsiders", "subreddit_id": "t5_2uv0o"}, {"author": "_Mexican_Soda_", "body": "Ngl that would be cool af", "created_utc": "1601513586.0", "edited": "False", "id": "g78ll0x", "is_submitter": "False", "link_id": "t3_j2xkys", "parent_id": "t1_g78lhf9", "score": "3", "subreddit": "TheOutsiders", "subreddit_id": "t5_2uv0o"}, {"author": "_Mexican_Soda_", "body": "Haha, nice man! I liked it!", "created_utc": "1601513302.0", "edited": "False", "id": "g78l36u", "is_submitter": "False", "link_id": "t3_j2xkys", "parent_id": "t3_j2xkys", "score": "3", "subreddit": "TheOutsiders", "subreddit_id": "t5_2uv0o"}, {"author": "_Mexican_Soda_", "body": "Haha, thanks man! I really haven’t thought about the life lessons/philosophy Cowboy Bebop teaches, but I’m pretty sure it’s gonna be one of those shows you still analyze even if you haven’t watched it in 4 years. Simply amazing. While I would have like the show to be a little bit less episodic, I still it’s a masterpiece of a show", "created_utc": "1601513254.0", "edited": "False", "id": "g78l07r", "is_submitter": "True", "link_id": "t3_j2vzy5", "parent_id": "t1_g78dxe3", "score": "2", "subreddit": "cowboybebop", "subreddit_id": "t5_2sn1i"}, {"author": "_Mexican_Soda_", "body": "The music man! Cowboy bebop has probably the best soundtracks of all time. I really enjoyed it even though I’m not into jazz or anything", "created_utc": "1601513115.0", "edited": "False", "id": "g78krw4", "is_submitter": "True", "link_id": "t3_j2vzy5", "parent_id": "t1_g7898cu", "score": "3", "subreddit": "cowboybebop", "subreddit_id": "t5_2sn1i"}, {"author": "_Mexican_Soda_", "body": "Yeah, that’s what I’m doing next haha", "created_utc": "1601512929.0", "edited": "False", "id": "g78kgly", "is_submitter": "False", "link_id": "t3_isiy1z", "parent_id": "t1_g78dls8", "score": "2", "subreddit": "cowboybebop", "subreddit_id": "t5_2sn1i"}, {"author": "_Mexican_Soda_", "body": "Thanks man! I’ll read them", "created_utc": "1601512886.0", "edited": "False", "id": "g78kdwu", "is_submitter": "False", "link_id": "t3_j0mbhb", "parent_id": "t1_g78iwky", "score": "2", "subreddit": "cowboybebop", "subreddit_id": "t5_2sn1i"}, {"author": "_Mexican_Soda_", "body": "I saw this post like 2 weeks ago, but just looked at it and scrolled down. Today I've finished the series and to fill the void the series left me, I want to read the manga. I've been down scrolling for the past 50 minutes just to ask: Where did you buy those mangas? Thanks!", "created_utc": "1601505781.0", "edited": "False", "id": "g788ibr", "is_submitter": "False", "link_id": "t3_isiy1z", "parent_id": "t3_isiy1z", "score": "2", "subreddit": "cowboybebop", "subreddit_id": "t5_2sn1i"}, {"author": "_Mexican_Soda_", "body": "I have a question, how many volumes does each of the mangas have, and are they translated in English on a physical release? Thanks!", "created_utc": "1601503513.0", "edited": "False", "id": "g784e9t", "is_submitter": "False", "link_id": "t3_j0mbhb", "parent_id": "t1_g6uh26u", "score": "1", "subreddit": "cowboybebop", "subreddit_id": "t5_2sn1i"}, {"author": "_Mexican_Soda_", "body": "Happy... Does that mean I’ll die of laughter? Not that bad I guess...", "created_utc": "1601496875.0", "edited": "False", "id": "g77pa65", "is_submitter": "False", "link_id": "t3_j2n4uf", "parent_id": "t3_j2n4uf", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "_Mexican_Soda_", "body": "Hahaha, I have the hope :,)", "created_utc": "1601425228.0", "edited": "False", "id": "g74f4z3", "is_submitter": "True", "link_id": "t3_j1s5l0", "parent_id": "t1_g73vce6", "score": "1", "subreddit": "battlestations", "subreddit_id": "t5_2rdbn"}, {"author": "_Mexican_Soda_", "body": "Definitely the best drawing I've seen this week. Keep it up, man!", "created_utc": "1601392688.0", "edited": "False", "id": "g72gwuf", "is_submitter": "False", "link_id": "t3_j1zyou", "parent_id": "t3_j1zyou", "score": "4", "subreddit": "drawing", "subreddit_id": "t5_2qvp9"}, {"author": "_Mexican_Soda_", "body": "What mouse is the one you use?", "created_utc": "1601013438.0", "edited": "False", "id": "g6idfe9", "is_submitter": "False", "link_id": "t3_iz0sy5", "parent_id": "t3_iz0sy5", "score": "1", "subreddit": "battlestations", "subreddit_id": "t5_2rdbn"}, {"author": "_Mexican_Soda_", "body": "I have a question man, how big is your monitor and how did you choose it? I have a laptop and also want a monitor for my setup, but I don’t know or if grabbing a 1080p 140hz monitor would be way too much for my laptop that barely runs Minecraft. Do I need to get a low resource monitor or any monitor is fine? Thanks in advance", "created_utc": "1601012489.0", "edited": "False", "id": "g6ic5c3", "is_submitter": "False", "link_id": "t3_izbvkr", "parent_id": "t3_izbvkr", "score": "2", "subreddit": "battlestations", "subreddit_id": "t5_2rdbn"}, {"author": "_Mexican_Soda_", "body": "Can anyone explain me this meme? I have seen that joke a lot and I use chrome for most things, is it bad?", "created_utc": "1600978620.0", "edited": "False", "id": "g6go9zm", "is_submitter": "False", "link_id": "t3_iz1q40", "parent_id": "t3_iz1q40", "score": "3", "subreddit": "pcmasterrace", "subreddit_id": "t5_2sgp1"}, {"author": "_Mexican_Soda_", "body": "When I was a young boy", "created_utc": "1600975507.0", "edited": "False", "id": "g6ggnsv", "is_submitter": "False", "link_id": "t3_iyqyvp", "parent_id": "t3_iyqyvp", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "_Mexican_Soda_", "body": "Eso dijo hace 5 años jajajaja", "created_utc": "1600706361.0", "edited": "False", "id": "g64biiz", "is_submitter": "False", "link_id": "t3_ijp1nv", "parent_id": "t3_ijp1nv", "score": "1", "subreddit": "manga_es", "subreddit_id": "t5_3jwp5"}, {"author": "_Mexican_Soda_", "body": "That exactly happened to me with your lie in April! I barely cry with anything and my friends were like \"IT WILL DESTROY YOUR HEART MAN, IT WILL MAKE YOUR SOUL FULL OF PAIN FOREVER\" and when the end came I literally felt nothing. I felt that they ruined something that could probably had become my favorite anime. I really think that if you want to recommend something you shouldn't really overhype it cause it makes your expectations so high that when you see it, you don't get satisfied with it.", "created_utc": "1600444056.0", "edited": "False", "id": "g5pn6cy", "is_submitter": "False", "link_id": "t3_iv7v9d", "parent_id": "t1_g5pkyy0", "score": "2", "subreddit": "KanojoOkarishimasu", "subreddit_id": "t5_izi65"}, {"author": "_Mexican_Soda_", "body": "Oh, okok. What about Netflix and other stream services, would 60fps be enough?", "created_utc": "1599786381.0", "edited": "False", "id": "g4rzw13", "is_submitter": "False", "link_id": "t3_iqc5cc", "parent_id": "t1_g4rooro", "score": "2", "subreddit": "laptops", "subreddit_id": "t5_2qoip"}, {"author": "_Mexican_Soda_", "body": "Sorry, but could you tell me what is a g-sync? Is it a cable or something?", "created_utc": "1599775392.0", "edited": "False", "id": "g4rdoqi", "is_submitter": "False", "link_id": "t3_iqcg3e", "parent_id": "t1_g4rbcz4", "score": "1", "subreddit": "pcmasterrace", "subreddit_id": "t5_2sgp1"}, {"author": "_Mexican_Soda_", "body": "That makes sense, thanks for the advice!", "created_utc": "1599774277.0", "edited": "False", "id": "g4r9mmq", "is_submitter": "False", "link_id": "t3_iqcg3e", "parent_id": "t1_g4r84dj", "score": "1", "subreddit": "pcmasterrace", "subreddit_id": "t5_2sgp1"}, {"author": "_Mexican_Soda_", "body": "Ohh okok man that was really helpful, thanks!", "created_utc": "1599774244.0", "edited": "False", "id": "g4r9i3q", "is_submitter": "False", "link_id": "t3_iqcg3e", "parent_id": "t1_g4r7xv5", "score": "1", "subreddit": "pcmasterrace", "subreddit_id": "t5_2sgp1"}, {"author": "_Mexican_Soda_", "body": "So I shouldn't really worry about how much is it gonna affect it since all of them affect the performance?", "created_utc": "1599773476.0", "edited": "False", "id": "g4r6mzw", "is_submitter": "False", "link_id": "t3_iqcg3e", "parent_id": "t1_g4r58jw", "score": "2", "subreddit": "pcmasterrace", "subreddit_id": "t5_2sgp1"}, {"author": "_Mexican_Soda_", "body": "So basically buying a 144hz monitor would be a waste of money and performance if I only use it for youtube and school?", "created_utc": "1599773087.0", "edited": "False", "id": "g4r5834", "is_submitter": "False", "link_id": "t3_iqc5cc", "parent_id": "t1_g4r3g1w", "score": "2", "subreddit": "laptops", "subreddit_id": "t5_2qoip"}, {"author": "_Mexican_Soda_", "body": "Oh, okok. And how high can the resolution be before it starts affecting performance?", "created_utc": "1599772992.0", "edited": "False", "id": "g4r4tt1", "is_submitter": "False", "link_id": "t3_iqcg3e", "parent_id": "t1_g4r2r9c", "score": "2", "subreddit": "pcmasterrace", "subreddit_id": "t5_2sgp1"}, {"author": "_Mexican_Soda_", "body": "I needed to show the timelapse to my Mom so he would accept that this wasn't a picture but a drawing, amazing!", "created_utc": "1593111147.0", "edited": "False", "id": "fvzd1t9", "is_submitter": "False", "link_id": "t3_hfq3wk", "parent_id": "t3_hfq3wk", "score": "2", "subreddit": "drawing", "subreddit_id": "t5_2qvp9"}, {"author": "_Mexican_Soda_", "body": "Well, before I discovered Green Day I didn't really listen to music. One day one of my teachers was wearing an American Idiot shirt. On the ride home I decided to google \"American Idiot\". I saw that it was a song, so I decided to listen to it. It was really mind-blowing for me because I had never heard anything like it. I searched then who was the band that had made that song and started listening to Green Day. After some time, I started searching for more bands like Green Day and discovered Pop Punk which, which I started listening to a lot and eventually got me into Punk Rock.", "created_utc": "1590005745.0", "edited": "False", "id": "fr9yjvl", "is_submitter": "False", "link_id": "t3_gni9r1", "parent_id": "t3_gni9r1", "score": "6", "subreddit": "greenday", "subreddit_id": "t5_2snhx"}, {"author": "_Mexican_Soda_", "body": "Well, I might be technically cheating because this song is famous in Spanish speaking countries, but it isn't famous in the rest of the world. The song is [\"Lamento Boliviano\"](https://www.youtube.com/watch?v=oZQhKgvUyYE) and the band who wrote it is an Argentinan band called \"Enanitos Verdes\".\n\nEdit: typo", "created_utc": "1589914178.0", "edited": "1589914750.0", "id": "fr5t1c5", "is_submitter": "False", "link_id": "t3_gmo4kp", "parent_id": "t3_gmo4kp", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "_Mexican_Soda_", "body": "Is to die", "created_utc": "1589393396.0", "edited": "False", "id": "fqiana8", "is_submitter": "False", "link_id": "t3_gixi74", "parent_id": "t1_fqi5g08", "score": "17", "subreddit": "greenday", "subreddit_id": "t5_2snhx"}, {"author": "_Mexican_Soda_", "body": "Did you buy this, or did you make it?\n\nAnd if you bought it, where?", "created_utc": "1588807830.0", "edited": "False", "id": "fpprnpr", "is_submitter": "False", "link_id": "t3_genpa8", "parent_id": "t3_genpa8", "score": "2", "subreddit": "greenday", "subreddit_id": "t5_2snhx"}, {"author": "_Mexican_Soda_", "body": "I guess probably superbowl rings", "created_utc": "1588795167.0", "edited": "False", "id": "fpp37qv", "is_submitter": "False", "link_id": "t3_geif3v", "parent_id": "t1_fpoymzd", "score": "1", "subreddit": "thatHappened", "subreddit_id": "t5_2vmb7"}, {"author": "_Mexican_Soda_", "body": "Happy Birthday man! Hope you had a great time", "created_utc": "1588264351.0", "edited": "False", "id": "fp2mmhu", "is_submitter": "False", "link_id": "t3_gakxuw", "parent_id": "t3_gakxuw", "score": "3", "subreddit": "greenday", "subreddit_id": "t5_2snhx"}]