[{"author": "_TheRedWolf", "body": "I usually do it with my eyes open, but if I want to deeply relax I close them. It can be hard to meditate with the eyes open (at least for me was like that), but after mastering it you literally can meditate anywhere.", "created_utc": "1665923637.0", "edited": "False", "id": "isjad4b", "is_submitter": "True", "link_id": "t3_x0qwwx", "parent_id": "t1_isfpxho", "score": "2", "subreddit": "Meditation", "subreddit_id": "t5_2qnc9"}, {"author": "_TheRedWolf", "body": "Yes, but, at least for me, most of the activities are completely optional. There are activities in which you have to track your negative feelings and values for weeks or even months, but this wasn't necessary for me.", "created_utc": "1662539318.0", "edited": "False", "id": "infce73", "is_submitter": "True", "link_id": "t3_x0qwwx", "parent_id": "t1_ine6ji7", "score": "1", "subreddit": "Meditation", "subreddit_id": "t5_2qnc9"}, {"author": "_TheRedWolf", "body": "Nope. I just feel my stomach full. Sometimes I feel drowsy after a meal and I prefer waiting a few minutes until I'm alert again, but generally I can meditate even in a state of drowsiness and tiredness. It just isn't that hard for me.", "created_utc": "1661936622.0", "edited": "False", "id": "imhzk0k", "is_submitter": "True", "link_id": "t3_x0qwwx", "parent_id": "t1_imf08zr", "score": "1", "subreddit": "Meditation", "subreddit_id": "t5_2qnc9"}, {"author": "_TheRedWolf", "body": "I'd recommend reading Get Out Of Your Mind And Into Your Life, as it's based on Acceptance and Commitment Therapy and it merges mindfulness with commitment, action and values. However, there's a bunch of activities that, if you're not a beginner, they might not be useful. I just did some that I considered helpful, but not every activity.\n\nAtomic Habits can improve your life showing you how to implement good habits and removing bad ones. This book is not about mindfulness. However, the book is amazing, helpful and relatively short. It just helped me how to apply the habit of meditation to my daily life and how to manage my time to have more space for meditation.\n\nYou can find all these books on the Internet, just if you want to take a peek at each one :)", "created_utc": "1661845409.0", "edited": "False", "id": "imczb7j", "is_submitter": "True", "link_id": "t3_x0qwwx", "parent_id": "t1_imc6sue", "score": "1", "subreddit": "Meditation", "subreddit_id": "t5_2qnc9"}, {"author": "_TheRedWolf", "body": "I don't read books about any particular meditation practice. I've read articles and forums to let me understand the differences between Samatha and Vipassana, and how to perform each one.\n\nThis is a post of mine were I had a question about the concentration during meditation:\n\n[Reddit - My Attention Doesn't Stay Still While Meditating](https://www.reddit.com/r/Meditation/comments/wfabf8/my_attention_doesnt_stay_still_while_meditating/)\n\nThese are two posts in which the difference between these two kind of meditations is explained:\n\n[Emdrhealing - Samatha vs Vipassana](https://emdrhealing.com/samatha-vs-vipassana-meditation/)\n\n[Mindowl - Samatha vs Vipassana](https://mindowl.org/vipassana-vs-samatha/)\n\nAnd here's more relevant information:\n\n[Dhammawheel - Samatha and Vipassana at the same time](https://www.dhammawheel.com/viewtopic.php?t=9206s)\n\n[Stackexchange - Samatha before Vipassana?](https://buddhism.stackexchange.com/questions/5969/does-samatha-practice-always-come-before-vipassana-practice)", "created_utc": "1661810338.0", "edited": "False", "id": "imb6wh0", "is_submitter": "True", "link_id": "t3_x0qwwx", "parent_id": "t1_imb2hy0", "score": "5", "subreddit": "Meditation", "subreddit_id": "t5_2qnc9"}, {"author": "_TheRedWolf", "body": "Thank you 😊\n\nThe two books that helped me the most are Man's Search For Meaning and Get Out Of Your Mind And Into Your Life, mainly because they combine mindfulness with living a valued life. Meditation is really useful but (at least for me) it's nothing if it doesn't serve to a purpose in life, a valued path. \n\nI've been trying to meditate unsuccessfully for 4 years. What I've been doing is just trying to focus on my breath and force my attention to be still in there, but it wouldn't work, so I began a new approach to meditation one month ago and it's going very well at the moment. As I'm getting good results, this month is the only time in my life where I don't skip any meditation sessions.\n\nMeditation is attractive for me because I tend to live in my mind a lot and I daydream too much. I want to live in the present moment and enjoy it, so that's why I'm meditating :)", "created_utc": "1661808222.0", "edited": "False", "id": "imb24s0", "is_submitter": "True", "link_id": "t3_x0qwwx", "parent_id": "t1_imazl8s", "score": "3", "subreddit": "Meditation", "subreddit_id": "t5_2qnc9"}, {"author": "_TheRedWolf", "body": "I didn't know about him, but from what you told me it looks really interesting. I'll check his work :)\n\nThank you a lot <3", "created_utc": "1661806346.0", "edited": "False", "id": "imaxv03", "is_submitter": "True", "link_id": "t3_x0qwwx", "parent_id": "t1_imax9a9", "score": "3", "subreddit": "Meditation", "subreddit_id": "t5_2qnc9"}, {"author": "_TheRedWolf", "body": "I also do as you say. For example, if I want to watch any object very strongly, my focus deviates if I try too hard. Instead, I acknowledge any other input and sensations and I let my focus alternate between any other object and my desired object, and I bring most of my attention to the desired object. \n\nIt's weird to explain, it's just how I do meditation. I make room for other sensations and let them in. If my focus wants to shift to another object, so be it. If I force it to be on an object for a long period of time, it just won't work.", "created_utc": "1661805927.0", "edited": "False", "id": "imaww2r", "is_submitter": "True", "link_id": "t3_x0qwwx", "parent_id": "t1_imap10z", "score": "2", "subreddit": "Meditation", "subreddit_id": "t5_2qnc9"}, {"author": "_TheRedWolf", "body": "No, I just do it all by myself. I only read the instructions of this kind of meditation and practice.", "created_utc": "1661805604.0", "edited": "False", "id": "imaw51a", "is_submitter": "True", "link_id": "t3_x0qwwx", "parent_id": "t1_imar26w", "score": "2", "subreddit": "Meditation", "subreddit_id": "t5_2qnc9"}, {"author": "_TheRedWolf", "body": "Meditation helps me have a clear insight, and I consider it not a crutch, but rather a tool. If I believed that meditation was the key to solve all my problems, I'd lose control sooner or later.\n\nRather, I combine mindfulness with action and values. If I've problems, meditation just helps me seeing clearly the paths to take, and that's where values come in.", "created_utc": "1661804015.0", "edited": "False", "id": "imasfdj", "is_submitter": "True", "link_id": "t3_x0qwwx", "parent_id": "t1_imakr5k", "score": "7", "subreddit": "Meditation", "subreddit_id": "t5_2qnc9"}, {"author": "_TheRedWolf", "body": "Thank you a lot <3\n\nThis sure will help your children. Meditation will be a great help for their private and academic life. Wish you the best!", "created_utc": "1661803457.0", "edited": "False", "id": "imar4m0", "is_submitter": "True", "link_id": "t3_x0qwwx", "parent_id": "t1_imagd5l", "score": "3", "subreddit": "Meditation", "subreddit_id": "t5_2qnc9"}, {"author": "_TheRedWolf", "body": "I'm now on vacation. I meditate after breakfast (9 AM) and after lunch (3 PM), twenty minutes each session.\n\nUsually I gain more and I'm more focused during the after lunch session, but I need to do it in the morning as I usually wake up very distracted and unfocused.", "created_utc": "1661803279.0", "edited": "False", "id": "imaqpnp", "is_submitter": "True", "link_id": "t3_x0qwwx", "parent_id": "t1_imant8s", "score": "12", "subreddit": "Meditation", "subreddit_id": "t5_2qnc9"}, {"author": "_TheRedWolf", "body": "I'm not an English native tho. I try my best. \n\nI'm somewhat motivated, but I'm always like that. I love explaining stuff to people in the best way I can.", "created_utc": "1661795270.0", "edited": "False", "id": "ima7a0v", "is_submitter": "True", "link_id": "t3_x0qwwx", "parent_id": "t1_ima0di4", "score": "8", "subreddit": "Meditation", "subreddit_id": "t5_2qnc9"}, {"author": "_TheRedWolf", "body": "Good luck!! :)", "created_utc": "1661795207.0", "edited": "False", "id": "ima74a3", "is_submitter": "True", "link_id": "t3_x0qwwx", "parent_id": "t1_ima42ky", "score": "2", "subreddit": "Meditation", "subreddit_id": "t5_2qnc9"}, {"author": "_TheRedWolf", "body": "No, I just followed the instructions and practiced. I've tried Headspace long ago, and it wasn't that bad, but now I prefer doing it all by myself.\n\nIf I've a question or I'm curious about something, I just google or ask here :)", "created_utc": "1661795175.0", "edited": "1661795561.0", "id": "ima71cy", "is_submitter": "True", "link_id": "t3_x0qwwx", "parent_id": "t1_ima6g1v", "score": "2", "subreddit": "Meditation", "subreddit_id": "t5_2qnc9"}, {"author": "_TheRedWolf", "body": "If you improve your mind, you'll unavoidably be able to improve other areas of your life :)", "created_utc": "1661791445.0", "edited": "False", "id": "im9xh2s", "is_submitter": "True", "link_id": "t3_x0qwwx", "parent_id": "t1_im9vtwy", "score": "11", "subreddit": "Meditation", "subreddit_id": "t5_2qnc9"}, {"author": "_TheRedWolf", "body": "Yes, more or less like that :)\n\nRelaxation is one of the biggest benefits of meditation, but for me the best deal is mind clearance. For me, meditation is like **arranging a bedroom or cleaning a house**, it helps you to think better and to have a clear vision, and like a real bedroom or house, periodic cleanings must be done to keep it neat, so the same with meditation (I think).", "created_utc": "1661791267.0", "edited": "False", "id": "im9x0qx", "is_submitter": "True", "link_id": "t3_x0qwwx", "parent_id": "t1_im9og4m", "score": "34", "subreddit": "Meditation", "subreddit_id": "t5_2qnc9"}, {"author": "_TheRedWolf", "body": "Thank you a lot <3. Sometimes I still struggle to understand some passages from TV shows or films, but generally I can understand about 95% of what it's being said.\n\nNow I'm doing that with French and, depending of the content, I usually understand 50 - 95% of the words. I understand almost everything when I'm listening to intermediate podcasts, but it's really difficult to do this when I'm watching films, as they speak really fast.\n\nAnd your method is also very cool! It may help you recall words and even understand new words or structures that you couldn't understand before. Sometimes I get bored of listening to podcasts, so it might be pleasant to take a break and listen to your favorite show :)\n\nThank you!", "created_utc": "1661759636.0", "edited": "False", "id": "im8bsiz", "is_submitter": "True", "link_id": "t3_ug1k9n", "parent_id": "t1_im5mkp8", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "_TheRedWolf", "body": "Yes, I've already considered that. My problem with speaking alone is that I might not notice subtle grammatical errors, so that's why it's better to record oneself or just have a partner.", "created_utc": "1661371169.0", "edited": "False", "id": "ilmzyjs", "is_submitter": "True", "link_id": "t3_wwgz5x", "parent_id": "t1_ilm9hhz", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "_TheRedWolf", "body": "I'll try both :)", "created_utc": "1661371102.0", "edited": "False", "id": "ilmzs6q", "is_submitter": "True", "link_id": "t3_wwgz5x", "parent_id": "t1_ilm50m7", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "_TheRedWolf", "body": "Yeah, right now that's what I'm doing, and it works well. But sometimes my attention goes extremely jumpy and I end up tired.\n\nMaybe it's just matter of practice and experimentation, or slowing down the shifts that my attention does between every object.", "created_utc": "1659598135.0", "edited": "False", "id": "iivzna6", "is_submitter": "True", "link_id": "t3_wfabf8", "parent_id": "t1_iiuc373", "score": "2", "subreddit": "Meditation", "subreddit_id": "t5_2qnc9"}, {"author": "_TheRedWolf", "body": "That's what I've been doing recently. In the past, my meditations were filled of judgments and well... that wasn't meditation.\n\nBut now, I get frustrated because of meditation and I just acknowledge that frustration with its thoughts and then move on. It's curious.\n\nIt's just maybe that in some sense I still try to control and force things, but with practice maybe these two troublemakers won't interfere in my sessions.\n\nIn any case, thank you for your advice!", "created_utc": "1659564730.0", "edited": "False", "id": "iiu83sl", "is_submitter": "True", "link_id": "t3_wfabf8", "parent_id": "t1_iitqiwh", "score": "1", "subreddit": "Meditation", "subreddit_id": "t5_2qnc9"}, {"author": "_TheRedWolf", "body": "Thank you a lot <3\n\nI'll continue to do meditation as I've been doing recently. However, I'll try to reserve some of my sessions to try to bring my focus to one thing. I'll experiment with it and I'll see if I can get something good from it.", "created_utc": "1659564497.0", "edited": "False", "id": "iiu7ktw", "is_submitter": "True", "link_id": "t3_wfabf8", "parent_id": "t1_iisxaue", "score": "1", "subreddit": "Meditation", "subreddit_id": "t5_2qnc9"}, {"author": "_TheRedWolf", "body": "Thank you for your advice, I really appreciate it.\n\nHowever, what do you mean by \"dismissing\"? For me, it's the same as \"eliminating\". From what I've been taught, if we try to dismiss something during meditation, it will just come again and stronger.\n\nIf I let everything be there, there it is, without needing to suppress anything, and then I turn my attention to the object.\n\nHowever, I'd like you to elaborate more on this. I'm confused about your statement.", "created_utc": "1659564262.0", "edited": "False", "id": "iiu71o6", "is_submitter": "True", "link_id": "t3_wfabf8", "parent_id": "t1_iisyu84", "score": "1", "subreddit": "Meditation", "subreddit_id": "t5_2qnc9"}, {"author": "_TheRedWolf", "body": "I love how you described my thoughts about how my new approach to meditation was going to be.\n\nYour words are truly motivating, I'll keep moving forward and I'll practice and refine my meditation practice.\n\nThank you a lot!", "created_utc": "1659544663.0", "edited": "False", "id": "iisv0oh", "is_submitter": "True", "link_id": "t3_wfabf8", "parent_id": "t1_iisqewo", "score": "2", "subreddit": "Meditation", "subreddit_id": "t5_2qnc9"}, {"author": "_TheRedWolf", "body": "Maybe the approach I made to the meditation practice all this time was wrong. Luckily, now I have a clearer sense of how it should be done.\n\nHowever, my problem has been always the desire of control. People tell me to \"drop it\", and that's what I do, because after all, that desire is just a thought, so I just look it non-judgmentally. This doesn't fix the \"problem\" with my focus, so I'll just keep practicing.\n\nThanks for the advice.", "created_utc": "1659544457.0", "edited": "False", "id": "iisuh3a", "is_submitter": "True", "link_id": "t3_wfabf8", "parent_id": "t1_iisr9zu", "score": "1", "subreddit": "Meditation", "subreddit_id": "t5_2qnc9"}, {"author": "_TheRedWolf", "body": "I only tend to be absent-minded a lot of times. Nevertheless, my attention is pretty good when I've to study or research (except when it's too boring or when I'm too tired, of course).\n\nI hope that meditation will help both us to improve our abilities to stay in the now and have a better focus.\n\nWish you the best! :)", "created_utc": "1659544265.0", "edited": "False", "id": "iistz5g", "is_submitter": "True", "link_id": "t3_wfabf8", "parent_id": "t1_iisrd4u", "score": "1", "subreddit": "Meditation", "subreddit_id": "t5_2qnc9"}, {"author": "_TheRedWolf", "body": "And how long does it take to reset the tolerance?", "created_utc": "1659387494.0", "edited": "False", "id": "iik2qwy", "is_submitter": "True", "link_id": "t3_wdnnpi", "parent_id": "t1_iijwybi", "score": "1", "subreddit": "tea", "subreddit_id": "t5_2qq5e"}, {"author": "_TheRedWolf", "body": "Thanks, dude! All I can tell is that when I try to have a straight neck posture, I feel like something (I think it's a bone, all I know is that it's hard) in my neck pokes it and it all ends in pain. I'll go to my physio to see what we can do.", "created_utc": "1655585696.0", "edited": "False", "id": "icvf6ln", "is_submitter": "True", "link_id": "t3_vdrqov", "parent_id": "t1_icv07c4", "score": "1", "subreddit": "TMJ", "subreddit_id": "t5_2t0ha"}, {"author": "_TheRedWolf", "body": "I don't have that. I believe that I was already born with the tilt, and I never got neck pain or any stuff like that. Nevertheless, I don't know if my condition can be fixed somehow. Maybe I'll have to go to my doctor.\n\nBut anyway, I'm sorry for your condition and I hope that it will get well soon!", "created_utc": "1655453213.0", "edited": "False", "id": "icop65n", "is_submitter": "True", "link_id": "t3_vdrqov", "parent_id": "t1_icn3sbj", "score": "2", "subreddit": "TMJ", "subreddit_id": "t5_2t0ha"}, {"author": "_TheRedWolf", "body": "Yess, mostly because I noticed that my TMJD is worse on the side where my head is tilted. My TMJD of the other side is almost non-existent, it's just a small click that only sounds when chewing in a certain and weird ways, but my TMJD of the left side always clicks a lot no matter how I chew.\n\nIt feels like an... AN IMBALANCE, so I think that the tilt has something important to do with it.", "created_utc": "1655453124.0", "edited": "False", "id": "icop2d1", "is_submitter": "True", "link_id": "t3_vdrqov", "parent_id": "t1_icmmw47", "score": "2", "subreddit": "TMJ", "subreddit_id": "t5_2t0ha"}, {"author": "_TheRedWolf", "body": "Wow, but you're 14, you still have time to quit videogames (I quit them in my late teens, but I'm now into .io games when I'm very tired to study or to read, so I still have work to do).\n\nHowever, I posted this like 1+ year ago and my mind has slightly changed. I'd say that you don't need to quit them if you learn or get a benefit from it. For example, Minecraft has helped me to cultivate a more creative mind, and not only that, but to improve my English by chatting with strangers and making friends.\n\nBut in my case, playing stuff like League of Legends, CS:GO or Osu is completely useless for me, as I cannot get any real learning from it that can be useful for me.\n\nSo, in conclusion, it's gonna depend on the situation of the person and of their personality.\n\nAh, and there's no need to delete your Steam account, just maybe try to uninstall it and, that's all. For me it was a hard step because I had a lot of friends in there, but I had to make a sacrifice.\n\nI'd also recommend quitting gaming gradually as I did, but you know your situation better than me.\n\nWish you the best! :)", "created_utc": "1653844655.0", "edited": "1653844840.0", "id": "iag4kdu", "is_submitter": "True", "link_id": "t3_k8l3an", "parent_id": "t1_iafi6zv", "score": "2", "subreddit": "StopGaming", "subreddit_id": "t5_2tjkc"}, {"author": "_TheRedWolf", "body": "Well, I've been learning French sparingly during 3 years at school. When I retook French during last vacation by my own, I realized that I didn't know anything, at the point that I couldn't write an A1 redaction.\n\nI was too lazy to do various activities to learn French and I just decided to read the first book of Harry Potter in French, and... voilà, my skills in French amazingly rose. Of course, the lessons I have this year had an important role in my learning, but like 30-40% of my skills are thanks to reading that book and the one of My Little Prince.\n\nOf course, I could read French content easier, but the problem was writing, speaking and listening, as all of these abilities (including reading) are intertwined, but at the same time, separated. With practice, I could learn and improve all of these abilities, and now I'm really impressed with what I got.\n\nIt's just matter of practice. Following a method is also important. People like Steve Kaufmann or Olly Richards really helped me to improve my language learning.", "created_utc": "1652969986.0", "edited": "False", "id": "i97e0vi", "is_submitter": "True", "link_id": "t3_ug1k9n", "parent_id": "t1_i8vmn7w", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "_TheRedWolf", "body": "Haha, of course it's possible! I've been learning English passively since I was 8. Of course I still encounter with a lot of words that I don't know, but these are words that even some native speakers would have difficulty understanding.\n\nI don't use Anki or flashcards, I just check the meaning of the word and if it sticks to me, fine, but if it doesn't, it isn't a problem, as sooner or later that word will appear again.", "created_utc": "1652712956.0", "edited": "False", "id": "i8tr6bw", "is_submitter": "True", "link_id": "t3_ug1k9n", "parent_id": "t1_i8revfy", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "_TheRedWolf", "body": "Sorry, I believe my words weren't clear. I meant that right now I'm improving my English listening skills through watching films and shows. I don't mean that this is the only thing that you have to do to learn a language and improve listening skills, of course not!\n\nIt took me years to just watch a show reading subtitles. It's better to do it step by step.", "created_utc": "1651663960.0", "edited": "False", "id": "i7a2o7m", "is_submitter": "True", "link_id": "t3_ug1k9n", "parent_id": "t1_i76svry", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "_TheRedWolf", "body": "Thank you so much! You'll also be able to do so, it's just practice. Have in mind that it took me 8 years to do this. If I practiced everyday, I'd have already achieved this long ago.\n\nIt's just matter of practice and of course, liking the activity of learning languages. Hope you the best!", "created_utc": "1651496914.0", "edited": "False", "id": "i70uzem", "is_submitter": "True", "link_id": "t3_ug1k9n", "parent_id": "t1_i70jpoa", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "_TheRedWolf", "body": "For me it was only because I was too lazy to do it. My English listening was already decent, it was just that I already had the habit of reading the subtitles.", "created_utc": "1651496605.0", "edited": "False", "id": "i70udgq", "is_submitter": "True", "link_id": "t3_ug1k9n", "parent_id": "t1_i70oywn", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "_TheRedWolf", "body": "Maybe it was water, I don't know. I have similar problems when my screen is soaked. My phone just starts to open apps becoming crazy!", "created_utc": "1651478010.0", "edited": "False", "id": "i704w1x", "is_submitter": "True", "link_id": "t3_ug1k9n", "parent_id": "t1_i704ewj", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "_TheRedWolf", "body": "I'll try that! Thank you :)", "created_utc": "1651477244.0", "edited": "False", "id": "i7040h7", "is_submitter": "True", "link_id": "t3_ug1k9n", "parent_id": "t1_i702z2f", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "_TheRedWolf", "body": "Thank you so much 😊\n\nIt's only that for me it has been a long way. I had already \"unlocked\" all the other abilities of English a long time ago, and this one was withstanding my efforts. I think it's because I don't usually watch shows in English 😅. I could already understand most of YouTube videos, but their speech was formal and they usually had simple vocabulary. I know that there are videos that can use complex vocabulary and all that stuff, but I never dared to watch one of those.", "created_utc": "1651477222.0", "edited": "False", "id": "i703zia", "is_submitter": "True", "link_id": "t3_ug1k9n", "parent_id": "t1_i6zals9", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "_TheRedWolf", "body": "Well, sometimes is hard to understand when the volume is too low or when the speech is very fast. I have to pay full attention to what they're saying, because otherwise I'd miss their dialogue.", "created_utc": "1651476718.0", "edited": "False", "id": "i703ea2", "is_submitter": "True", "link_id": "t3_ug1k9n", "parent_id": "t1_i6yhnpf", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "_TheRedWolf", "body": "Yesss, it's something that sometimes occurs without you noticing it. I had a similar experience like yours when I was reading a French YouTube thread without thinking of it, and I noticed that I was reading French like 20 seconds later!", "created_utc": "1651476560.0", "edited": "False", "id": "i7037r5", "is_submitter": "True", "link_id": "t3_ug1k9n", "parent_id": "t1_i6yo4ue", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "_TheRedWolf", "body": "Thanks 😄", "created_utc": "1651476388.0", "edited": "False", "id": "i7030oa", "is_submitter": "True", "link_id": "t3_ug1k9n", "parent_id": "t1_i6ymxlc", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "_TheRedWolf", "body": "It just feels amazing. Thank you! 😁", "created_utc": "1651476371.0", "edited": "False", "id": "i70300f", "is_submitter": "True", "link_id": "t3_ug1k9n", "parent_id": "t1_i6ym3mh", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "_TheRedWolf", "body": "Yess it is! It's just that it has been so many years, and I find it surprising to become capable of listening to English without effort.\n\nThank you 😊", "created_utc": "1651476343.0", "edited": "False", "id": "i702yw2", "is_submitter": "True", "link_id": "t3_ug1k9n", "parent_id": "t1_i6zghwt", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "_TheRedWolf", "body": "I don't know much about that! I mostly watch videos and series all along the web, but I don't know if that function is available on famous streaming platforms such as Netflix or Amazon Prime.\n\nBut anyway, I'll also try to search third party apps that can blur subtitles or modify them on someway as you said.\n\nThank you a lot :)", "created_utc": "1651476240.0", "edited": "False", "id": "i702ur8", "is_submitter": "True", "link_id": "t3_ug1k9n", "parent_id": "t1_i6zkz0m", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "_TheRedWolf", "body": "Yeah. When I wrote the title, in fact, it didn't sound good to me, but at the sime time I thought that it was correc t.", "created_utc": "1651475985.0", "edited": "False", "id": "i702jth", "is_submitter": "True", "link_id": "t3_ug1k9n", "parent_id": "t1_i6zp9zl", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "_TheRedWolf", "body": "I'll have that in mind!", "created_utc": "1651475928.0", "edited": "False", "id": "i702hbh", "is_submitter": "True", "link_id": "t3_ug1k9n", "parent_id": "t1_i6yobwt", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "_TheRedWolf", "body": "Yess, that's it! For me, the problem comes when people mumble, becoming really hard to understand their words.", "created_utc": "1651475881.0", "edited": "False", "id": "i702fag", "is_submitter": "True", "link_id": "t3_ug1k9n", "parent_id": "t1_i6yo8d7", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "_TheRedWolf", "body": "Thank youu! Yess, I meant that kind of English, it's just that sometimes I become goofy and casual when I'm writing.", "created_utc": "1651475671.0", "edited": "False", "id": "i7026fl", "is_submitter": "True", "link_id": "t3_ug1k9n", "parent_id": "t1_i6z36eu", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "_TheRedWolf", "body": "Yesss. In fact, I've always used it, even in my essays, and I've never been notified about it. It's only that it might sound unnatural for native speakers, but you're right, it still works.\n\nThank you very much 😆", "created_utc": "1651443280.0", "edited": "False", "id": "i6yhkxr", "is_submitter": "True", "link_id": "t3_ug1k9n", "parent_id": "t1_i6yg9l7", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "_TheRedWolf", "body": "I had some confusion with that. However, English people say \"can finally\" sounds better, but I've always used both and I feel both pretty familiar.", "created_utc": "1651442830.0", "edited": "False", "id": "i6ygleq", "is_submitter": "True", "link_id": "t3_ug1k9n", "parent_id": "t1_i6yfx26", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "_TheRedWolf", "body": "It's just so exciting, because it's like the first time I do it. There may be polyglots out there who can already listen effortlessly to 4 or more languages, but I believe that I took a giant step disabling the subtitles.\n\nThank you a lot :)", "created_utc": "1651442461.0", "edited": "False", "id": "i6yfry3", "is_submitter": "True", "link_id": "t3_ug1k9n", "parent_id": "t1_i6yevyt", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "_TheRedWolf", "body": "Thanks for your recommendation :) In fact, I'm now mostly watching fantasy shows, but books would be better to learn vocabulary extensively.\n\nThat channel will be handy, as I'm also a French learner. Thank you!", "created_utc": "1651441746.0", "edited": "False", "id": "i6ye7dn", "is_submitter": "True", "link_id": "t3_ug1k9n", "parent_id": "t1_i6yah8i", "score": "7", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "_TheRedWolf", "body": "Mostly through context. When I still don't understand the words, I check them up on an online dictionary.", "created_utc": "1651441596.0", "edited": "False", "id": "i6ydvhx", "is_submitter": "True", "link_id": "t3_ug1k9n", "parent_id": "t1_i6yad9d", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "_TheRedWolf", "body": "Don't really, I mean, it made me better on languages, and also on analytical and verbal stuff. Just on anything that requires language use.\n\nThere's always time to learn languages. It's just about doing what you like and making language learning enjoyable. I can't sit for 40 minutes listening to a podcast. Instead, if you make me watch a show I really like, my attention is all focused on it.", "created_utc": "1651439272.0", "edited": "False", "id": "i6y8o87", "is_submitter": "True", "link_id": "t3_ug1k9n", "parent_id": "t1_i6y7u5p", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "_TheRedWolf", "body": "I think I just invented it LMAO. For me, is the dialect that is found in holy ancient books.", "created_utc": "1651438487.0", "edited": "False", "id": "i6y6u6j", "is_submitter": "True", "link_id": "t3_ug1k9n", "parent_id": "t1_i6y6j9h", "score": "14", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "_TheRedWolf", "body": "Oops. I'll have that in mind for my C1 exam. Thank you!", "created_utc": "1651438029.0", "edited": "False", "id": "i6y5t0u", "is_submitter": "True", "link_id": "t3_ug1k9n", "parent_id": "t1_i6y5hvg", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "_TheRedWolf", "body": "Wowww thank you 🥰 It's amazing!\n\nNevertheless, I see that it doesn't work outside YouTube, Netflix and some other websites. Do you know if I can set it to work in other webpages? Is there another app that can do it?", "created_utc": "1651437494.0", "edited": "False", "id": "i6y4lm6", "is_submitter": "True", "link_id": "t3_ug1k9n", "parent_id": "t1_i6xyhfb", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "_TheRedWolf", "body": "I think that language learning mostly consists on reading and listening to what you like. It's just that a method might be needed to learn effectively. \n\nIt took me 8 years to have a C1 level in English, and if I had had knowledge about how to learn languages, I might have learned it faster.", "created_utc": "1651436893.0", "edited": "False", "id": "i6y37yt", "is_submitter": "True", "link_id": "t3_ug1k9n", "parent_id": "t1_i6xwx1e", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "_TheRedWolf", "body": "I started learning it at school, but 90% of the English I learned was through Internet, mostly from YouTube videos and websites. I started sparingly surfing online on English 8 years ago, but I got more serious about it 4 years ago, and most of the webpages I visited were on English.\n\nIt was a really slow process, but if I did it more often, I could have had a higher level.\n\nThe thing is that when I started to read books in English one year ago it felt like crashing into a wall. My brain still needed train to read large texts with new vocabulary in English.", "created_utc": "1651436721.0", "edited": "False", "id": "i6y2tx6", "is_submitter": "True", "link_id": "t3_ug1k9n", "parent_id": "t1_i6xsbqb", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "_TheRedWolf", "body": "Yesss :D It feels like developing a sixth sense", "created_utc": "1651436364.0", "edited": "False", "id": "i6y20x3", "is_submitter": "True", "link_id": "t3_ug1k9n", "parent_id": "t1_i6xrtfo", "score": "4", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "_TheRedWolf", "body": "I'm glad to know that not using subtitles is possible!\n\nI've been always using them and I noticed that my listening comprehension didn't improve too much, so I think it's time to start leaving them behind.", "created_utc": "1651436209.0", "edited": "False", "id": "i6y1o4o", "is_submitter": "True", "link_id": "t3_ug1k9n", "parent_id": "t1_i6xw1e9", "score": "4", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "_TheRedWolf", "body": "Yessss, that's what I'm always struggling with. It just feels weird because I rarely had that problem in Spanish shows.", "created_utc": "1651429542.0", "edited": "False", "id": "i6xm7f9", "is_submitter": "True", "link_id": "t3_ug1k9n", "parent_id": "t1_i6xlq5f", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "_TheRedWolf", "body": "Thank you! Accents can also be a problem, but I'm now mostly struggling with literary, divine and archaic dialects (and I think that every native also does).\n\nAs a Spaniard, I also tend to struggle listening to accents from certains regions or from Latin American countries.", "created_utc": "1651429411.0", "edited": "False", "id": "i6xlwse", "is_submitter": "True", "link_id": "t3_ug1k9n", "parent_id": "t1_i6xkqkb", "score": "14", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "_TheRedWolf", "body": "Thanks <3", "created_utc": "1651429129.0", "edited": "False", "id": "i6xl93a", "is_submitter": "True", "link_id": "t3_ug1k9n", "parent_id": "t1_i6xjukl", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "_TheRedWolf", "body": "Thank you!", "created_utc": "1651429001.0", "edited": "False", "id": "i6xkyc1", "is_submitter": "True", "link_id": "t3_ug1k9n", "parent_id": "t1_i6xkftl", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "_TheRedWolf", "body": "Thanks a lot! It's very hard for me to understand characters when their voice is distorted or when they're whining. In these cases I always look at the subtitles.", "created_utc": "1651424141.0", "edited": "False", "id": "i6x9mqh", "is_submitter": "True", "link_id": "t3_ug1k9n", "parent_id": "t1_i6x94eb", "score": "35", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "_TheRedWolf", "body": "I mostly watch series translated into American English (sometimes the speech is very fast, but I can reach to understand it). I've heard about The Crown, I don't know how's the speech there, but as far as I know is 100% British.\n\nOne technique I do is that, if I don't understand what is being said, I play that part back with subtitles, or just leave them on and, if I don't understand something, take a glance at them. It can be very tedious, but that's how I do it for now.", "created_utc": "1651424021.0", "edited": "False", "id": "i6x9cz3", "is_submitter": "True", "link_id": "t3_ug1k9n", "parent_id": "t1_i6x7mbr", "score": "9", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "_TheRedWolf", "body": "Oh, thanks for that correction. I think I need to write more in English.  I still have trouble forming that kind of phrases, as I put them in a Spanish order, and yes, it doesn't sound very English haha.\n\nI have to do the C1 exam soon, so I'll be careful!", "created_utc": "1651422129.0", "edited": "1651422419.0", "id": "i6x4x9s", "is_submitter": "True", "link_id": "t3_ug1k9n", "parent_id": "t1_i6x2wca", "score": "17", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "_TheRedWolf", "body": "I believe that context and emotions of the characters have something to do with it. It can also be that you enjoy that activity and your brain works better, as it doesn't bore you. \n\nFor me, podcasts are fine, but only ones that talk about subjects I like (and if they have a script to take a quick look in case, better).", "created_utc": "1651420181.0", "edited": "False", "id": "i6x0f4q", "is_submitter": "True", "link_id": "t3_ug1k9n", "parent_id": "t1_i6wxwif", "score": "5", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "_TheRedWolf", "body": "I just watch videos and series on YouTube or Netflix, or on any other webpage.", "created_utc": "1651417999.0", "edited": "1651422451.0", "id": "i6wvk0e", "is_submitter": "True", "link_id": "t3_ug1k9n", "parent_id": "t1_i6wv30j", "score": "5", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "_TheRedWolf", "body": "Yeah, it's just that sometimes its hard to understand, mostly when people are talking while they're whining or when they have some effect in their voice. It also happens sometimes in Spanish, but I've heard that in English, it is more common.", "created_utc": "1651417925.0", "edited": "1651421933.0", "id": "i6wve6m", "is_submitter": "True", "link_id": "t3_ug1k9n", "parent_id": "t1_i6wuetj", "score": "13", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "_TheRedWolf", "body": "I just don't know how to explain it. It feels like a door to a new world has opened. I feel very excited, thank you!", "created_utc": "1651417447.0", "edited": "False", "id": "i6wubo6", "is_submitter": "True", "link_id": "t3_ug1k9n", "parent_id": "t1_i6wu1h4", "score": "27", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "_TheRedWolf", "body": "I suppose that to expand the maxilla the tonge must be resting on the roof of the mouth, right? I started to do this as soon as I heard that mouth posture can reshape your face over the years. \n\nI'm also doing the mewing technique (applying tonge force on the roof of my mouth for like 20-30 minutes daily), of which I don't know if it can hasten the process. \n\nNevertheless, my TMD was caused by clenching my teeth, not by a maxillary deficency. But anyway, I don't really know if expanding it can help TMD in some way.", "created_utc": "1651070420.0", "edited": "False", "id": "i6emgvv", "is_submitter": "True", "link_id": "t3_uabg0y", "parent_id": "t1_i6bgpdx", "score": "2", "subreddit": "TMJ", "subreddit_id": "t5_2t0ha"}, {"author": "_TheRedWolf", "body": "It was episodic. I used to hear it just for seconds, sometimes for minutes.\n\nThese episodes stopped occurring when my TMJ pain ceased, after stopping clenching my teeth. I still have TMJ issues, but it doesn't affect my hearing anymore.", "created_utc": "1650908912.0", "edited": "False", "id": "i65ozps", "is_submitter": "True", "link_id": "t3_uabg0y", "parent_id": "t1_i657frc", "score": "2", "subreddit": "TMJ", "subreddit_id": "t5_2t0ha"}, {"author": "_TheRedWolf", "body": "You're right. For now, I'll try to do this method for some months, and if there are no results, I may have to go to an specialist and maybe get a splint.", "created_utc": "1650805585.0", "edited": "False", "id": "i5zvfan", "is_submitter": "True", "link_id": "t3_uabg0y", "parent_id": "t1_i5yer0m", "score": "1", "subreddit": "TMJ", "subreddit_id": "t5_2t0ha"}, {"author": "_TheRedWolf", "body": "I'll try to do this method for a month or two, and if everything stills the same, I may have to go to a doctor.", "created_utc": "1650805487.0", "edited": "False", "id": "i5zv8n8", "is_submitter": "True", "link_id": "t3_uabg0y", "parent_id": "t1_i5ypwms", "score": "1", "subreddit": "TMJ", "subreddit_id": "t5_2t0ha"}, {"author": "_TheRedWolf", "body": "Hope it gets better!", "created_utc": "1650805457.0", "edited": "False", "id": "i5zv6ka", "is_submitter": "True", "link_id": "t3_uabg0y", "parent_id": "t1_i5yq6fq", "score": "2", "subreddit": "TMJ", "subreddit_id": "t5_2t0ha"}, {"author": "_TheRedWolf", "body": "In fact, it's the only thing of which I can already feel (temporal) results.\n\nI also doubt why this method isn't very talked. It's somewhat \"underground\", so that's why I'm skeptical about it.\n\nBut anyway, I'll keep trying for some weeks and I'll see what I can take of this :)", "created_utc": "1650743073.0", "edited": "False", "id": "i5wx2nr", "is_submitter": "True", "link_id": "t3_uabg0y", "parent_id": "t1_i5wp0fc", "score": "3", "subreddit": "TMJ", "subreddit_id": "t5_2t0ha"}, {"author": "_TheRedWolf", "body": "No, but they seem really good. I'd have to give them a try! :)", "created_utc": "1650717572.0", "edited": "False", "id": "i5vdn24", "is_submitter": "True", "link_id": "t3_u8tj2a", "parent_id": "t1_i5t6caz", "score": "1", "subreddit": "sleep", "subreddit_id": "t5_2qpyn"}, {"author": "_TheRedWolf", "body": "Okay, thanks very much for the advice! I hope that the pain was just inflammation and nothing is damaged.\n\nI'll use other earplugs that don't cause pressure. I've seen some earplugs which are of silicone but they have a defined shape and they're a lot more reusable! They don't seem to cause any kind of pressure.\n\nThey come in different shapes and forms, such as the ones of eargasm. Anyway, I found some like these: [https://img.joomcdn.net/ac4dda94888e6a89c8f6c7f8364bdeaea66a636b\\_original.jpeg](https://img.joomcdn.net/ac4dda94888e6a89c8f6c7f8364bdeaea66a636b_original.jpeg)", "created_utc": "1650717536.0", "edited": "1650718596.0", "id": "i5vdkz2", "is_submitter": "True", "link_id": "t3_u8tj2a", "parent_id": "t1_i5rux4t", "score": "1", "subreddit": "sleep", "subreddit_id": "t5_2qpyn"}, {"author": "_TheRedWolf", "body": "Can I implement **assault bike HIIT** in conditioning days? I'm doing the 5/3/1 \"Beginner Prep School\" (is somewhat similar to \"5/3/1 for Beginners\" from the Wiki), and I'd like to do intense HIIT. I have months of experience of lifting and HIIT, but I'm going to get more serious and I don't want to overtrain myself.\n\nLet's say that if the lifting days are Monday, Wednesday and Friday. Would it be a good idea to do HIIT with an assault bike on Tuesdays and Thursdays? I used to do 20 seconds going at full speed, and then rest 1:40 - 2 minutes, and I do this for 6 - 8 times. This is brutal for me, and now I'm recovering from an overtrain injury because of it. That's why I came here, because I know that it could be worse when implementing the new program to my life.\n\nShould I lighten the HIIT workout when implementing it into my routine? Is HIIT necessary to be that hard?", "created_utc": "1649801021.0", "edited": "False", "id": "i4hk9go", "is_submitter": "False", "link_id": "t3_u1uk65", "parent_id": "t3_u1uk65", "score": "1", "subreddit": "Fitness", "subreddit_id": "t5_2qhx4"}, {"author": "_TheRedWolf", "body": "Yeah, I do almost the same thing, I mean, I've reached a point where what I don't understand are just unknown words, so it would be meaningless to repeat the audio without script, as I still couldn't understand that word.\n\nBut if the audio is fast paced, I might need to go back without looking at the transcript in order to process that information better.", "created_utc": "1648747924.0", "edited": "False", "id": "i2vg8bw", "is_submitter": "True", "link_id": "t3_tt24rj", "parent_id": "t1_i2vbgx3", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "_TheRedWolf", "body": "You're right. My reading ability in french is pretty good, as I'm reading L'étranger and I don't find it that hard. Maybe I can encounter new grammar structures or words, but it's not a big deal.\n\nI also get bored when playing the same stuff over and over again. If I'm learning a new language which I haven't listened to, there's no other choice but to repeat small fragments and reading the script afterwards. But my listening level in French is just decent, so I think that there's no need to repeat a lot of times. I'd repeat that part I don't understand, and if I still don't understand, I'd look at the transcript, and then I'd repeat that part understanding the words.", "created_utc": "1648747639.0", "edited": "False", "id": "i2vfh7q", "is_submitter": "True", "link_id": "t3_tt24rj", "parent_id": "t1_i2v3rn5", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "_TheRedWolf", "body": "Yeah, it's mainly that. If I listen to a very well recorder audio I don't have any trouble understand it (except when I listen to new words, of course), but I have trouble mostly when the audio is played in a mediocre quality (like in an interview or in a voice chat), or just when it's too fast and colloquial.\n\nIn any case, my listening ability grew up really fast, but my main problem has always been vocabulary, so I'll just try to read more and listen more, in order to adapt my ear to the language and hearing new words :)", "created_utc": "1648747078.0", "edited": "False", "id": "i2ve012", "is_submitter": "True", "link_id": "t3_tt24rj", "parent_id": "t1_i2v3vsy", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "_TheRedWolf", "body": "But do I really prolong the injury if I do exercises that don't use these muscles?\n\nI've thought that I could do shadow boxing as a cardio exercise and some push ups, but I see no reason to don't do them, as they don't use the legs.\n\nIt's just to keep fit in some way.", "created_utc": "1647631451.0", "edited": "False", "id": "i16wgnx", "is_submitter": "False", "link_id": "t3_tgx18v", "parent_id": "t1_i16uk9p", "score": "1", "subreddit": "Fitness", "subreddit_id": "t5_2qhx4"}, {"author": "_TheRedWolf", "body": "I've injuried my quads and I have to stay home.\n\nI need a basic program to train my abs / core and my upper body. I can't jump, and I've even difficulty to walk. I have to avoid using my legs at all costs.\n\nWhat exercises do you recommend to me? I only got a 40kg resistance band and a bank.", "created_utc": "1647626086.0", "edited": "False", "id": "i16j4uj", "is_submitter": "False", "link_id": "t3_tgx18v", "parent_id": "t3_tgx18v", "score": "3", "subreddit": "Fitness", "subreddit_id": "t5_2qhx4"}, {"author": "_TheRedWolf", "body": "I've got my quadriceps in pain since 3 weeks ago. I was doing HIIT with a bike, and my legs were sore and tired from the past days. \n\nWell, after doing 2 sprints, my quads started to pain. I decided to ignore it and keep pushing. Bad decision. I had to do 6 sprints more of 20 seconds each one. My quads hurt more at every sprint. Now I really regret doing this, I won't try this stuff again when I'm sore.\n\nLuckily my left quadriceps is almost healed, but my right is still in pain. I'm thinking about going to walk as I can't do any other exercise related to my legs, but I don't know if this can slow down the healing process. Any advices to speed up the healing?", "created_utc": "1647443282.0", "edited": "False", "id": "i0w5i6w", "is_submitter": "False", "link_id": "t3_tfd8mj", "parent_id": "t3_tfd8mj", "score": "1", "subreddit": "Fitness", "subreddit_id": "t5_2qhx4"}, {"author": "_TheRedWolf", "body": "But I've seen that they're almost the same. Of course, Prep School has more warm up and conditioning stuff, but in terms of strength exercises they're the same, it's only that one is ABAABA and the other is ABABAB.", "created_utc": "1647245835.0", "edited": "False", "id": "i0lei9o", "is_submitter": "False", "link_id": "t3_td2x3w", "parent_id": "t1_i0jf2o1", "score": "1", "subreddit": "Fitness", "subreddit_id": "t5_2qhx4"}, {"author": "_TheRedWolf", "body": "Should I alternate days on 5/3/1 (for beginners) after each week?\n\nFor example, if on Monday an Friday I do Squat and Bench Press, and on Wednesday I do Deadlift and Press, should I alternate the days I do these exercises on the next week? (Monday and Friday = Deadlift and Press, Wednesday = Squat and Bench Press).\n\nIv'e got some confusion about this, as the wiki says nothing about alternating days, but on 5/3/1 Forever, it's indicated that days must be alternated after each week. What should I do?", "created_utc": "1647205483.0", "edited": "False", "id": "i0jcieb", "is_submitter": "False", "link_id": "t3_td2x3w", "parent_id": "t3_td2x3w", "score": "1", "subreddit": "Fitness", "subreddit_id": "t5_2qhx4"}, {"author": "_TheRedWolf", "body": "I'll pick a routine.\n\nI'm still not sure when to do HIIT. For example, if I lift thrice a week (let's say Monday, Wednesday and Friday), can I do HIIT on Tuesday and Thursday, or should I do it in the days that I lift?\n\nThanks for the advice!", "created_utc": "1647116709.0", "edited": "1647117048.0", "id": "i0es8mh", "is_submitter": "False", "link_id": "t3_tcd92w", "parent_id": "t1_i0e5vpw", "score": "1", "subreddit": "Fitness", "subreddit_id": "t5_2qhx4"}, {"author": "_TheRedWolf", "body": "You're right. I'm completely doing it wrong.\n\nI've been sticking to this routine for 5 months and I've seen no advancements.\n\nI'm reading about 5/3/1 and I think I'll give it a try. But anyway, I'll also check other programs.\n\nThank you very much.", "created_utc": "1647116695.0", "edited": "1647116928.0", "id": "i0es7h2", "is_submitter": "False", "link_id": "t3_tcd92w", "parent_id": "t1_i0ei50u", "score": "1", "subreddit": "Fitness", "subreddit_id": "t5_2qhx4"}, {"author": "_TheRedWolf", "body": "Is this routine good for STRENGTH TRAINING?:\n\nMonday: Military Press (3x3), Barbell Row (3x3), Chest Press (3x3) and Pull Up (3x3)\n\nTuesday: Barbell Squat (3x3) and Deadlift (3x3) \\[I'm not sure if I should add another exercise sush as Hip Thrusts or Leg Curls\\]\n\nThursday: (the same as Monday)\n\nFriday: (the same as Tuesday)", "created_utc": "1647106319.0", "edited": "False", "id": "i0e37me", "is_submitter": "False", "link_id": "t3_tcd92w", "parent_id": "t3_tcd92w", "score": "1", "subreddit": "Fitness", "subreddit_id": "t5_2qhx4"}, {"author": "_TheRedWolf", "body": "Are hip thrusts necessary in a strength training program?\n\nI work my lower body twice a week. I do squats and deadlifts, but I'm not sure if I'm working all the muscle groups of my legs.\n\nCan hip thrust help me construct a better strength training program, or are they just optional?", "created_utc": "1647020418.0", "edited": "False", "id": "i09kku4", "is_submitter": "False", "link_id": "t3_tbmur2", "parent_id": "t3_tbmur2", "score": "1", "subreddit": "Fitness", "subreddit_id": "t5_2qhx4"}, {"author": "_TheRedWolf", "body": "Yeah, I feel that, but I mostly drink it when I slept bad the night before.\n\nHowever, sometimes I drink three times a week for necessity (always trying to hold spaced days between cup and cup). On final exams I don't care about tolerance and I drink it three or four days consecutively, and then I do a 2 week tolerance reset, so it's OK.", "created_utc": "1646591213.0", "edited": "False", "id": "hzlriws", "is_submitter": "True", "link_id": "t3_t800qd", "parent_id": "t1_hzlpguo", "score": "1", "subreddit": "caffeine", "subreddit_id": "t5_2r544"}, {"author": "_TheRedWolf", "body": "Fine :)\n\nThank you!", "created_utc": "1646590925.0", "edited": "False", "id": "hzlqsox", "is_submitter": "True", "link_id": "t3_t800qd", "parent_id": "t1_hzlanpd", "score": "1", "subreddit": "caffeine", "subreddit_id": "t5_2r544"}, {"author": "_TheRedWolf", "body": "Thank you for the info! I've been told that tea had L-Theanine, and that's one of my main motivations to take it.\n\nOf course, besides its benefits, one of the best things is to taste it!\n\nI'm going to try it this week. I'm really excited!", "created_utc": "1646587946.0", "edited": "False", "id": "hzljgup", "is_submitter": "True", "link_id": "t3_t7wtvt", "parent_id": "t1_hzl35c1", "score": "1", "subreddit": "tea", "subreddit_id": "t5_2qq5e"}, {"author": "_TheRedWolf", "body": "Hello. I'm just concerned about the fact that I need it to wake me up in order to be productive. \n\nI didn't have any problems with coffee. I used to take it every day, and to loose the tolerance, I abstained for 2 weeks a year ago without coffee. I was just normal, as if I still were taking coffee.\n\nI've been drinking coffee once or twice a week for a year and it stills waking me up. Sometimes I drink it even thrice a week.\n\nI'm just worried about the fact that tea would be a (small) increase in my caffeine intake, and it could somehow cultivate tolerance faster.", "created_utc": "1646575965.0", "edited": "1646576704.0", "id": "hzkscjg", "is_submitter": "True", "link_id": "t3_t7wtvt", "parent_id": "t1_hzknfsd", "score": "1", "subreddit": "tea", "subreddit_id": "t5_2qq5e"}, {"author": "_TheRedWolf", "body": "Thanks for the resource.\n\nIt's true that you cultivate kindness faster with metta than with breathing meditation. I'll give a try!", "created_utc": "1646242604.0", "edited": "False", "id": "hz2oidy", "is_submitter": "True", "link_id": "t3_t51tp1", "parent_id": "t1_hz2lt9x", "score": "1", "subreddit": "Meditation", "subreddit_id": "t5_2qnc9"}, {"author": "_TheRedWolf", "body": "I'll try it just tonight!", "created_utc": "1646241642.0", "edited": "False", "id": "hz2lz9t", "is_submitter": "True", "link_id": "t3_t51tp1", "parent_id": "t1_hz2iyqh", "score": "2", "subreddit": "Meditation", "subreddit_id": "t5_2qnc9"}, {"author": "_TheRedWolf", "body": "You're right.\n\nFor example, here in Spain I've met many psychologysts, which many of them interpreted that there was only one method to meditate, and it was about accepting everything, using the five senses, watching the horizon of thoughts. Because of this, I was very confused for a long time.\n\nI'll follow your counsel and I'll try to practice both. Thank you :)", "created_utc": "1646239895.0", "edited": "1646240109.0", "id": "hz2hexy", "is_submitter": "True", "link_id": "t3_t51tp1", "parent_id": "t1_hz2fsaz", "score": "3", "subreddit": "Meditation", "subreddit_id": "t5_2qnc9"}, {"author": "_TheRedWolf", "body": "My case it's not that serious. I could live all my life with my TMJ issues, now I don't have any pain, and even when suffering stress it usually doesn't hurt, so surgery is not necessarily required.\n\nBut anyway, it's better to just don't have it, so that's why I asked. \n\nI've tried doing TMJ exercises and all that for a month, but nothing worked.\n\nThe key it's just to solve the problem from the root and learn to manage stress (if the TMJD was not made by external injury), but I still don't know if everything can go again to its place with the years...", "created_utc": "1646231031.0", "edited": "False", "id": "hz1vho7", "is_submitter": "True", "link_id": "t3_t4hxmp", "parent_id": "t1_hz1pcqw", "score": "2", "subreddit": "TMJ", "subreddit_id": "t5_2t0ha"}, {"author": "_TheRedWolf", "body": "Reading, just because it takes a loooot of time to get into the language and be able to read. Once you can read big content in that language, the other options will be much easier.\n\nI already knew how to read English, but I couldn't handle speaking and writing. In just 3 months I've mastered both.", "created_utc": "1646230532.0", "edited": "False", "id": "hz1udzm", "is_submitter": "False", "link_id": "t3_t4rdq8", "parent_id": "t3_t4rdq8", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "_TheRedWolf", "body": "No, how is it?", "created_utc": "1646209612.0", "edited": "False", "id": "hz0yvxn", "is_submitter": "True", "link_id": "t3_t4hxmp", "parent_id": "t1_hyzgh9k", "score": "1", "subreddit": "TMJ", "subreddit_id": "t5_2t0ha"}, {"author": "_TheRedWolf", "body": "Okay, thank you.", "created_utc": "1646166193.0", "edited": "False", "id": "hyyfidc", "is_submitter": "False", "link_id": "t3_t46x3u", "parent_id": "t1_hywr1ok", "score": "1", "subreddit": "AskDocs", "subreddit_id": "t5_2xtuc"}, {"author": "_TheRedWolf", "body": "Something similar is happening to me. Lately I've trying to get angry at the gym, but in exchange my motivation drops, as I usually go after studying to chill out.\n\nOf course, wanting to become stronger and to add more weight motivates me, so I do my best.", "created_utc": "1646166140.0", "edited": "False", "id": "hyyfdar", "is_submitter": "False", "link_id": "t3_t44ik1", "parent_id": "t1_hyye7an", "score": "1", "subreddit": "Fitness", "subreddit_id": "t5_2qhx4"}, {"author": "_TheRedWolf", "body": "Nice advice!\n\nI really like to just concentrate and feel the pressure. However, I also think of stuff that motivates me, but it just helps a bit (like 1+ rep).\n\nMy gym manager can add more weight and, after using his anger to lift the bar, his hands started to tremble. How weird!", "created_utc": "1646165844.0", "edited": "False", "id": "hyyelan", "is_submitter": "False", "link_id": "t3_t44ik1", "parent_id": "t1_hyybt33", "score": "3", "subreddit": "Fitness", "subreddit_id": "t5_2qhx4"}, {"author": "_TheRedWolf", "body": "Yeah. I usually go to the gym after studying, and I go to the gym to chill, but of course, doing as much as I can.", "created_utc": "1646165412.0", "edited": "False", "id": "hyydha9", "is_submitter": "False", "link_id": "t3_t44ik1", "parent_id": "t1_hyyb5mp", "score": "1", "subreddit": "Fitness", "subreddit_id": "t5_2qhx4"}, {"author": "_TheRedWolf", "body": "Should I use anger and agressiveness to fuel my lifting?\n\nMy gym manager is one of the strongest mans of my country, and he does this technique. A friend of mine who's the second strongest bro of the gym also does this.\n\nHowever, I've always considered that lifting should be a joyful thing rather than a thing for which I have to get angry.\n\nSo I try to apply this and I see no changes...", "created_utc": "1646164000.0", "edited": "1646164353.0", "id": "hyy9tw7", "is_submitter": "False", "link_id": "t3_t44ik1", "parent_id": "t3_t44ik1", "score": "3", "subreddit": "Fitness", "subreddit_id": "t5_2qhx4"}, {"author": "_TheRedWolf", "body": "Sorry for my naivety, I often get confused with the names.\n\nI'll do as you say, and if it doesn't go, I'll go to my med after a week or so. I hope that everything goes well!\n\nThanks for your help!", "created_utc": "1645787942.0", "edited": "False", "id": "hyd9630", "is_submitter": "False", "link_id": "t3_t119o9", "parent_id": "t1_hyd8ick", "score": "2", "subreddit": "tinnitus", "subreddit_id": "t5_2saf4"}, {"author": "_TheRedWolf", "body": "Gym is only open from Monday to Friday. I exercise my upper body on Monday and Thursday, and my lower body on Tuesday and Friday. On Wednesdays I do HIIT.\n\nHowever, I feel that I should be doing another HIIT session, and I don't have any stationary bikes at home and my achilles tendon is injuried, so I can't jump.\n\nCan I do HIIT after a strength training session? If so, should I do it on an upper body day or on a lower body day?", "created_utc": "1644596489.0", "edited": "False", "id": "hwirflt", "is_submitter": "False", "link_id": "t3_spvvx6", "parent_id": "t3_spvvx6", "score": "2", "subreddit": "Fitness", "subreddit_id": "t5_2qhx4"}, {"author": "_TheRedWolf", "body": "I only do an intense HIIT workout session once a week. I have to give it all in that session, as it's the only day I can do it on a bike (as I do strength training 4 times a week). \n\nGym is closed on Saturday. I would do burpees at my place, but my achilles tendon is fucked.", "created_utc": "1644595880.0", "edited": "False", "id": "hwipste", "is_submitter": "False", "link_id": "t3_spvvx6", "parent_id": "t1_hwioxpq", "score": "1", "subreddit": "Fitness", "subreddit_id": "t5_2qhx4"}, {"author": "_TheRedWolf", "body": "I didn't know about its name (I'm going to fix the comment).\n\nSo, the thing is that I see people doing 20 seconds of maximum intensity and then 40 seconds of rest, and then doing this for about 15 times. This on normal stationary bikes.\n\nHowever, I can only do 7 - 8 times on assault bikes and I feel sick afterwards.", "created_utc": "1644595540.0", "edited": "False", "id": "hwiow49", "is_submitter": "False", "link_id": "t3_spvvx6", "parent_id": "t1_hwio8gw", "score": "1", "subreddit": "Fitness", "subreddit_id": "t5_2qhx4"}, {"author": "_TheRedWolf", "body": "I also have struggle breathing afterwards. After doing HIIT I always go to the bathroom because of urge of vomiting. I just bend down in the toilet and it disappears after 1 or 2 minutes. After that I look in the mirror and I'm all pale.\n\nMy gym friends also started worrying of seeing me like this.", "created_utc": "1644595367.0", "edited": "False", "id": "hwiofg4", "is_submitter": "False", "link_id": "t3_spvvx6", "parent_id": "t1_hwinviu", "score": "1", "subreddit": "Fitness", "subreddit_id": "t5_2qhx4"}, {"author": "_TheRedWolf", "body": "I've been doing HIIT on an assault bike. I usually do 2 minutes of warm-up, 20 seconds of maxium intensity and 40-60 seconds of low intensity.\n\nHowever, I can't last more than 10-12 minutes, as my heart rate is very high (about 200 - 230BPM at maxium intensity and 150 - 170BPM at low intensity / rest) and I get nausea and an uncomfortable feeling in all my body.\n\nI don't have this problem on normal or elliptical stationary bikes (on those where you can adjust the hardness of the pedals). However, I feel that I'm not doing as much as on the assault bike.\n\nI don't have any cardiovascular problem and I'm in shape.\n\nShould I do less, or should I keep pushing?", "created_utc": "1644594926.0", "edited": "1644595586.0", "id": "hwin9h0", "is_submitter": "False", "link_id": "t3_spvvx6", "parent_id": "t3_spvvx6", "score": "1", "subreddit": "Fitness", "subreddit_id": "t5_2qhx4"}, {"author": "_TheRedWolf", "body": "I doubt it's because of the material. I don't get any kind of itching or other problems (which I got with foam earplugs, and that's why I'm using these kind).\n\nI stopped wearing them from 2 days, and the ringing was still there.\n\nIt may be an internal problem, because when ear pressure changes it increases volume. Maybe mucus?\n\nI think I already had this sound long ago when I was very ill, but I'm not sure.\n\nAnyway, in a few weeks I'm going to doctor if it doesn't go. Thanks for you advice!", "created_utc": "1643812986.0", "edited": "False", "id": "hva48gn", "is_submitter": "True", "link_id": "t3_shs3p5", "parent_id": "t1_hv9vd0o", "score": "1", "subreddit": "tinnitus", "subreddit_id": "t5_2saf4"}, {"author": "_TheRedWolf", "body": "I just don't know how it appeared. It coincided after I started to wear these kind of earplugs, but the cause is probably something else.", "created_utc": "1643738954.0", "edited": "False", "id": "hv5vea2", "is_submitter": "True", "link_id": "t3_shs3p5", "parent_id": "t1_hv4a44m", "score": "1", "subreddit": "tinnitus", "subreddit_id": "t5_2saf4"}, {"author": "_TheRedWolf", "body": "Why?", "created_utc": "1643738858.0", "edited": "False", "id": "hv5v4u0", "is_submitter": "True", "link_id": "t3_shs3p5", "parent_id": "t1_hv49k47", "score": "1", "subreddit": "tinnitus", "subreddit_id": "t5_2saf4"}, {"author": "_TheRedWolf", "body": "Thanks for giving me this amazing and detailed list. I am putting in practice CBT and, in any case, I will consult about it with my psych.\n\nI’m blown away by your kindness. I desire the best for you!", "created_utc": "1643738850.0", "edited": "False", "id": "hv5v42o", "is_submitter": "True", "link_id": "t3_shs3p5", "parent_id": "t1_hv57r1n", "score": "1", "subreddit": "tinnitus", "subreddit_id": "t5_2saf4"}, {"author": "_TheRedWolf", "body": "Thanks for the advice!\n\nI think it can be because of allergy, as in the past few days I've been having coughs and sore throat (including full ears). However, I already had tinnitus like 1 week before that. So I'm not sure if it's because allergy.\n\nAnyways, I've been trying to accept it and my feelings towards it. However, I'm still having issues with it, as I'm a student and I always studied in silence. It drives me anxious. \n\nWhat is the fastest way to habituate to it under my circumstances?", "created_utc": "1643726588.0", "edited": "False", "id": "hv4yi7j", "is_submitter": "True", "link_id": "t3_shs3p5", "parent_id": "t1_hv4l87d", "score": "1", "subreddit": "tinnitus", "subreddit_id": "t5_2saf4"}, {"author": "_TheRedWolf", "body": "I love that website! I've already tried that meditation, but the volume of tinnitus increased a lot (and that's when I hadn't any control over my tinnitus and I had a panic attack as a result).\n\nI'm going to try it again and combine it with another breathing meditation session.", "created_utc": "1642533063.0", "edited": "False", "id": "ht7pouu", "is_submitter": "True", "link_id": "t3_s71tz6", "parent_id": "t1_ht7ewky", "score": "2", "subreddit": "Meditation", "subreddit_id": "t5_2qnc9"}, {"author": "_TheRedWolf", "body": "Have you ever felt anxiety related to your tinnitus? (Like the first time you discovered it and you noticed that it wouldn't go away).", "created_utc": "1642528699.0", "edited": "False", "id": "ht7dtzw", "is_submitter": "True", "link_id": "t3_s71tz6", "parent_id": "t1_ht762lc", "score": "1", "subreddit": "Meditation", "subreddit_id": "t5_2qnc9"}, {"author": "_TheRedWolf", "body": "I'm glad your life is going in the right way.\n\nDespite I have a lot of problems and I live in a moment of stress, you really inspired and motivated me to continue and keep going. Not only on meditation, but also on life.\n\nThank you!", "created_utc": "1642528049.0", "edited": "False", "id": "ht7c15q", "is_submitter": "False", "link_id": "t3_s6u1kb", "parent_id": "t3_s6u1kb", "score": "6", "subreddit": "Meditation", "subreddit_id": "t5_2qnc9"}, {"author": "_TheRedWolf", "body": "I started to accept it literally 2 days ago, so I think I've made a lot of progress in so little time. But of course, I don't think it happens in a day.\n\nMy tinnitus is chronic, I only hear it when I wear earplugs, and I need to wear them half of the time to do my stuff. So I can't desire to make it go away, just to let it be with me, but ignoring it and focusing on other stuff. That's what I want.", "created_utc": "1642525647.0", "edited": "False", "id": "ht75hkp", "is_submitter": "True", "link_id": "t3_s71tz6", "parent_id": "t1_ht731em", "score": "1", "subreddit": "Meditation", "subreddit_id": "t5_2qnc9"}, {"author": "_TheRedWolf", "body": "That's a very big problem. If I was you, I'd have my mental health ruined.\n\nHave you tried talking with them about it? Maybe they can just go and do it outside or in other facility (it also depends on where you live and the weather), or just do it in certain hours a day.\n\nDoes it annoys other neighbors? You could take measures to stop it and appeal to your neighbourhood association.", "created_utc": "1642000591.0", "edited": "False", "id": "hscufkr", "is_submitter": "True", "link_id": "t3_rzt1ax", "parent_id": "t1_hry6gfa", "score": "1", "subreddit": "Meditation", "subreddit_id": "t5_2qnc9"}, {"author": "_TheRedWolf", "body": "Since I started not long ago (and due to academic reasons I can only do it for 5 - 10 minutes a day) I noticed a better control on myself, more energy, more happiness, more awareness and more kindness with others and myself.\n\nMeditation is perfect for studying, so I should practice it more!", "created_utc": "1642000136.0", "edited": "False", "id": "hsctbdq", "is_submitter": "True", "link_id": "t3_rzt1ax", "parent_id": "t1_hs9mbia", "score": "1", "subreddit": "Meditation", "subreddit_id": "t5_2qnc9"}, {"author": "_TheRedWolf", "body": "I wear silicone earplugs and construction earmuffs, and it's fine for me. If the noise is too much I can put white noise (however, many people don't like it. I find my self work better in silence).\n\nYou can buy foam earplugs if you don't have issues with it (I had to stop wearing them because they irritated my ear) and strong earmuffs (like 30/33dB NRR).\n\nIt also depends on the noise. If it's voices, earplugs do their work really well. If it's striking against the floor or moving furniture, it's going to be harder to block the noise.", "created_utc": "1641753775.0", "edited": "False", "id": "hry3yam", "is_submitter": "True", "link_id": "t3_rzt1ax", "parent_id": "t1_hry2g8d", "score": "1", "subreddit": "Meditation", "subreddit_id": "t5_2qnc9"}, {"author": "_TheRedWolf", "body": "I'll go to my physician if my problem lingers. Thanks for the advice :)", "created_utc": "1641130425.0", "edited": "False", "id": "hqxkls1", "is_submitter": "True", "link_id": "t3_rsz5em", "parent_id": "t1_hqpv77m", "score": "1", "subreddit": "Posture", "subreddit_id": "t5_2v77d"}, {"author": "_TheRedWolf", "body": "I doubt so. My eyes are getting accustomed to my new posture and I see everything less spinned. However, if my issue persists, I'll go to my physician. Thanks for the advice!", "created_utc": "1641130368.0", "edited": "False", "id": "hqxkie7", "is_submitter": "True", "link_id": "t3_rsz5em", "parent_id": "t1_hqqu24k", "score": "1", "subreddit": "Posture", "subreddit_id": "t5_2v77d"}, {"author": "_TheRedWolf", "body": "I sometimes combine white noise (through headphones) with my new earplugs and it works really well :)\n\nHowever, if my neighbors are making noise when I'm going to sleep, I play some white noise on my speaker. I'm a side sleeper and it would be difficult to sleep with headphones.", "created_utc": "1641130220.0", "edited": "False", "id": "hqxka0t", "is_submitter": "True", "link_id": "t3_rmwmmh", "parent_id": "t1_hps063t", "score": "1", "subreddit": "misophonia", "subreddit_id": "t5_2sd5e"}, {"author": "_TheRedWolf", "body": "Just got these ones :)", "created_utc": "1641129920.0", "edited": "False", "id": "hqxjsug", "is_submitter": "True", "link_id": "t3_rmwmmh", "parent_id": "t1_hpot53z", "score": "2", "subreddit": "misophonia", "subreddit_id": "t5_2sd5e"}, {"author": "_TheRedWolf", "body": "In my case it doesn't hurt at first,  it starts to pain after 10-20 minutes and it just increases and becomes unbearable. I think it's because my skin just doesn't endure the pressure of the earplugs :/", "created_utc": "1641129886.0", "edited": "False", "id": "hqxjqw7", "is_submitter": "True", "link_id": "t3_rmwmmh", "parent_id": "t1_hpopjc0", "score": "1", "subreddit": "misophonia", "subreddit_id": "t5_2sd5e"}, {"author": "_TheRedWolf", "body": "Yeah, I've got mild tinnitus in my right ear and I can hear it somewhat louder. It comes and goes, and when it flares up, I play white noise. Of course, it's not the same for me as I prefer being in silence.", "created_utc": "1641129686.0", "edited": "False", "id": "hqxjfr4", "is_submitter": "True", "link_id": "t3_rmwmmh", "parent_id": "t1_hpp5vcw", "score": "1", "subreddit": "misophonia", "subreddit_id": "t5_2sd5e"}, {"author": "_TheRedWolf", "body": "Sorry for the answer delay. I bought moldable silicone earplugs from a pharmacy. They're just what I needed! However, they still don't isolate as well as the foam ones, so if I still hear the noise, I combine them with Peltor noise reduction earmuffs. It works quite well! :)", "created_utc": "1641129412.0", "edited": "False", "id": "hqxj0fa", "is_submitter": "True", "link_id": "t3_rmwmmh", "parent_id": "t1_hpopdtg", "score": "2", "subreddit": "misophonia", "subreddit_id": "t5_2sd5e"}, {"author": "_TheRedWolf", "body": "My OCD usually gets strong when it's about my personality. I still have to learn to difference some OCD thoughts from non-OCD ones. Thanks for the advice! :)", "created_utc": "1640094058.0", "edited": "False", "id": "hpf8ikj", "is_submitter": "True", "link_id": "t3_rlapc3", "parent_id": "t1_hpf727l", "score": "1", "subreddit": "OCD", "subreddit_id": "t5_2qvqm"}, {"author": "_TheRedWolf", "body": "Remember: **OCD are thoughts**, you can't defeat, eliminate or modify thoughts, and you'll be unwittingly giving protagonism and power to your OCD.\n\nIf you forcibly think to ignore it, you're also handing power to OCD, as well as you're trying intentionally to modify thoughts.\n\nI tried to use logic to prove that my OCD thoughts are fake, but then something new always came, at the point of moving to philosophical stuff and questioning the world's existence (something that is beyond my thinking and consequently, can't prove through logical reasoning).\n\nThe key is to threat them just as they are: thoughts. What helped me is spending time in activities I really like, such as socialising or sport. Find new hobbies and give yourself reasons to do activities you thought you'd never like to do.\n\nRemember, **OCD are thoughts,** and thoughts may stay forever. In some point of your life, due to a trauma or during a bad moment, your old obsessive thoughts can come again. That's why you have to gain control over your thoughts in order to avoid this sort of things.\n\nAlso, what really helped to me are psychological, scientific and philosophical books and articles. They'll give you a better insight of the world and you'll have more ability to understand you and your environment. I always tried to avoid Self-Help Books as they gave me a temporal relief, but weren't useful in long-term.\n\n**But remember, these are just my meditations and conclusions of my OCD.**", "created_utc": "1630942434.0", "edited": "False", "id": "hbth7mk", "is_submitter": "False", "link_id": "t3_pizjjz", "parent_id": "t3_pizjjz", "score": "5", "subreddit": "OCD", "subreddit_id": "t5_2qvqm"}, {"author": "_TheRedWolf", "body": "Thanks for your advice, I'll consider to move on and practice guided meditation, and if it's possible, with an instructor.", "created_utc": "1628347815.0", "edited": "False", "id": "h827e16", "is_submitter": "True", "link_id": "t3_ozu29o", "parent_id": "t1_h82675t", "score": "1", "subreddit": "OCD", "subreddit_id": "t5_2qvqm"}, {"author": "_TheRedWolf", "body": "Wow, thanks for your counsel! I'll give a try :)", "created_utc": "1627807574.0", "edited": "False", "id": "h7am724", "is_submitter": "False", "link_id": "t3_oveqxn", "parent_id": "t1_h79zfxc", "score": "1", "subreddit": "Meditation", "subreddit_id": "t5_2qnc9"}, {"author": "_TheRedWolf", "body": "It's more like the second, as when I try to focus on other part of my body, I still feel those uneasy points. I'll follow your advice and accept the feelings and focus on them.", "created_utc": "1627807468.0", "edited": "False", "id": "h7am2se", "is_submitter": "False", "link_id": "t3_oveqxn", "parent_id": "t1_h796512", "score": "2", "subreddit": "Meditation", "subreddit_id": "t5_2qnc9"}, {"author": "_TheRedWolf", "body": "I do something similar: **Box Breathing.** The default pattern is 4-4-4-4, but you can modify it depending of your needs :)", "created_utc": "1627807146.0", "edited": "False", "id": "h7alpyg", "is_submitter": "False", "link_id": "t3_oveqxn", "parent_id": "t1_h78rcih", "score": "1", "subreddit": "Meditation", "subreddit_id": "t5_2qnc9"}, {"author": "_TheRedWolf", "body": "Not really. I try to generaly focus on my abdomen, but I still feel that \"energy\" stills there. And also, for example, if it's on the right and I want to focus on the left, I do it, but I feel that a much bigger form of energy it's on the right, and I get distracted.", "created_utc": "1617369873.0", "edited": "False", "id": "gt4zvti", "is_submitter": "False", "link_id": "t3_mik3u7", "parent_id": "t1_gt4z896", "score": "1", "subreddit": "Meditation", "subreddit_id": "t5_2qnc9"}, {"author": "_TheRedWolf", "body": "1 - Bloodhail (Have A Nice Life)\n\n14 - To Here Knows When (My Bloody Valentine)\n\n17 - Good Morning, Captain (Slint)", "created_utc": "1614960727.0", "edited": "False", "id": "gpsbbp2", "is_submitter": "False", "link_id": "t3_is7dog", "parent_id": "t3_is7dog", "score": "1", "subreddit": "NameThatSong", "subreddit_id": "t5_2svj1"}, {"author": "_TheRedWolf", "body": "That depends of your social environment and of course, your personality. It's okay to only have two or three friends, but just imagine going out with these friends and listening to Sewerslvt. That would be amazing.\n\nBut anyway, I don't even know anyone who listens to this stuff.", "created_utc": "1614005162.0", "edited": "False", "id": "gocehv7", "is_submitter": "False", "link_id": "t3_lo1ki6", "parent_id": "t1_gobfm34", "score": "1", "subreddit": "Sewerslvt", "subreddit_id": "t5_2c8xry"}, {"author": "_TheRedWolf", "body": "Haha, I just thought the same! It could be my next project :)", "created_utc": "1610221465.0", "edited": "1610221693.0", "id": "gioomz7", "is_submitter": "False", "link_id": "t3_ktugnc", "parent_id": "t1_giohng6", "score": "2", "subreddit": "shoegaze", "subreddit_id": "t5_2qhhx"}, {"author": "_TheRedWolf", "body": "Good idea. I gonna annotate that! ❤️", "created_utc": "1610221422.0", "edited": "False", "id": "gioojve", "is_submitter": "False", "link_id": "t3_ktugnc", "parent_id": "t1_giodgt9", "score": "1", "subreddit": "shoegaze", "subreddit_id": "t5_2qhhx"}, {"author": "_TheRedWolf", "body": "❤️ thx n.n", "created_utc": "1610221382.0", "edited": "False", "id": "gioogue", "is_submitter": "False", "link_id": "t3_ktugnc", "parent_id": "t1_gioc4cz", "score": "1", "subreddit": "shoegaze", "subreddit_id": "t5_2qhhx"}, {"author": "_TheRedWolf", "body": "thaanks :D ❤️", "created_utc": "1610221343.0", "edited": "False", "id": "giooe16", "is_submitter": "False", "link_id": "t3_ktugnc", "parent_id": "t1_gioc3g1", "score": "2", "subreddit": "shoegaze", "subreddit_id": "t5_2qhhx"}, {"author": "_TheRedWolf", "body": "thank u ❤️", "created_utc": "1610221326.0", "edited": "False", "id": "gioocv9", "is_submitter": "False", "link_id": "t3_ktugnc", "parent_id": "t1_giob2p3", "score": "3", "subreddit": "shoegaze", "subreddit_id": "t5_2qhhx"}, {"author": "_TheRedWolf", "body": "Yeah, I think the same as you. Thanks to multiplayer PVP and role games, I've learned so many things about social stuff, now for me it's easier to talk and meet new people in real life. I've even became more confident and decisive.\n\nIt would sound weird, because this is not what happens in almost all of the cases.", "created_utc": "1607414866.0", "edited": "False", "id": "gf1agtl", "is_submitter": "True", "link_id": "t3_k8l3an", "parent_id": "t1_gf0dtgh", "score": "1", "subreddit": "StopGaming", "subreddit_id": "t5_2tjkc"}, {"author": "_TheRedWolf", "body": "Wow, you've got the best idea I've ever seen.\n\nIn my case, I'm studying languages, so I could meet and play with foreign people and mix gaming and learning together. Or also, I could start making buildings with them and I could get creativity into the mix.", "created_utc": "1607414216.0", "edited": "False", "id": "gf19t41", "is_submitter": "True", "link_id": "t3_k8l3an", "parent_id": "t1_gf02nv6", "score": "1", "subreddit": "StopGaming", "subreddit_id": "t5_2tjkc"}, {"author": "_TheRedWolf", "body": "I think that it could have helped me socially (yeah, in most of the cases is the opposite), I've made a lot of new friends and I've lived so many experiences with them. Thanks to this, now it's easier for me to communicate and make new friends in real life.\n\nSo yes, my addiction is more a social thing than a \"just play\" thing.\n\nI don't want to leave them, and that's the problem. The point is that I'd miss them a lot.", "created_utc": "1607413584.0", "edited": "False", "id": "gf195e8", "is_submitter": "True", "link_id": "t3_k8l3an", "parent_id": "t1_gezuzfl", "score": "1", "subreddit": "StopGaming", "subreddit_id": "t5_2tjkc"}, {"author": "_TheRedWolf", "body": "Ajjj gracias por el consejo. Soy ciudadano de España, y según he estudiado creo que aquí no te sancionan ni te ocurre nada. Que vamos, de toda la vida aquí todo el mundo ha descargado cosas y no ha ocurrido absolutamente nada. \n\nEra para despejar las dudas, porque la verdad, no conocía ThePirateBay hasta hace poco, y he visto que puedes conseguir básicamente cualquier cosa ahí. Seguiré tu consejo y entraré en páginas de mejor reputación.", "created_utc": "1590073617.0", "edited": "False", "id": "frck778", "is_submitter": "True", "link_id": "t3_gnth3a", "parent_id": "t1_frc6iti", "score": "2", "subreddit": "preguntaleareddit", "subreddit_id": "t5_344be"}, {"author": "_TheRedWolf", "body": "I think the problem can be related to my lack of relaxation and anxiety. As a fact my fingertips don't hurt when pressing them hard on a surface, so I think it could be more a mental thing. But thanks! I'll follow your advice and try to do some stretching and relaxation exercises.", "created_utc": "1586810229.0", "edited": "False", "id": "fnb6tpe", "is_submitter": "False", "link_id": "t3_g0pd4o", "parent_id": "t1_fnb2e1b", "score": "1", "subreddit": "Handwriting", "subreddit_id": "t5_2swz3"}, {"author": "_TheRedWolf", "body": "I never used a fountain pen, and yes, a lot of people recommend it, so I'll try. But the problem comes when drawing, because I mostly use pencil for my art. I'll go to my medic as soon as possible!", "created_utc": "1586809894.0", "edited": "False", "id": "fnb65k7", "is_submitter": "False", "link_id": "t3_g0pd4o", "parent_id": "t1_fnb0hkh", "score": "1", "subreddit": "Handwriting", "subreddit_id": "t5_2swz3"}, {"author": "_TheRedWolf", "body": "Yeah, I traid, and it can relieve pain a little, but for writing long texts it can be a problem, because my arm gets tired quickly. Anyway, the pain persists for the simple fact of the friction between the pencil and the paper which causes that annoying and irrational pain appear in my fingertips.", "created_utc": "1586807464.0", "edited": "False", "id": "fnb19wt", "is_submitter": "False", "link_id": "t3_g0pd4o", "parent_id": "t1_fnaw8b1", "score": "1", "subreddit": "Handwriting", "subreddit_id": "t5_2swz3"}, {"author": "_TheRedWolf", "body": "Yeah. Your sensation is similar. Basically the same.\n\n I think about my myopia/antigmatism and then I've the compulsion of focus strongly to my surrounding space. We must have in mind that it is just a thought different to the other ones, a thought that not only causes worrying, it causes strain too.", "created_utc": "1577824662.0", "edited": "False", "id": "fco5veh", "is_submitter": "False", "link_id": "t3_ei849d", "parent_id": "t1_fco44ro", "score": "1", "subreddit": "OCD", "subreddit_id": "t5_2qvqm"}, {"author": "_TheRedWolf", "body": "I've almost passed my OCD. I only have intrusive thoughts related with the body (Sensorimotor OCD) and compulsions related with Symmetry and Orderliness. Remember, just ignoring it will not make your thoughts go, do what you like, discover new passions and feel proud of your progress and believe that soon you will overcome OCD :)", "created_utc": "1577634951.0", "edited": "False", "id": "fcfysdp", "is_submitter": "False", "link_id": "t3_eh5ysd", "parent_id": "t1_fcfu480", "score": "2", "subreddit": "OCD", "subreddit_id": "t5_2qvqm"}, {"author": "_TheRedWolf", "body": "Thoughts come and go, and when I 've many intrusve thoughts, I just try to relax and clear my mind by going out for a while. Have in mind that intrusive thoughts don't only appear in people with OCD. Other mental disorders, such as depression or anxiety can contribute to them.", "created_utc": "1577633556.0", "edited": "False", "id": "fcfte1y", "is_submitter": "False", "link_id": "t3_eh58pw", "parent_id": "t3_eh58pw", "score": "3", "subreddit": "OCD", "subreddit_id": "t5_2qvqm"}, {"author": "_TheRedWolf", "body": "Surprisingly it happened to me too. Have in mind that these compulsions are just thoughts, and some thoughts of any kind will be gone, but others will stay. You must learn to live with them, knowing that they're there. You just can pay attention to them or simply ignoring them and don't even realize they're there. Believe me, as time goes by, many of them will be gone, you just have to keep the concept in mind that they're thoughts and they behave as such.", "created_utc": "1577632784.0", "edited": "False", "id": "fcfqo6f", "is_submitter": "False", "link_id": "t3_eh5ysd", "parent_id": "t3_eh5ysd", "score": "2", "subreddit": "OCD", "subreddit_id": "t5_2qvqm"}]