[{"author": "Affectionate-Stay-94", "body": "Oh\n#C O O L", "created_utc": "1666352964.0", "edited": "False", "id": "it6ysr8", "is_submitter": "False", "link_id": "t3_y97f41", "parent_id": "t1_it4fu76", "score": "2", "subreddit": "Kaguya_sama", "subreddit_id": "t5_3ihr1"}, {"author": "Affectionate-Stay-94", "body": "Holy shit Rn got MARRIED to KOU? That oblivious dumbass? I thought she’s the master of dodging flirts and fend ignorance like “What? You loved me? No idea.” Real shock.", "created_utc": "1665124397.0", "edited": "False", "id": "irdm3kd", "is_submitter": "False", "link_id": "t3_xxaedx", "parent_id": "t3_xxaedx", "score": "1", "subreddit": "yurimemes", "subreddit_id": "t5_xxiyb"}, {"author": "Affectionate-Stay-94", "body": "Finnish/Russian, German, French, Spanish: They all sound so badass. \nFor Russian, German and French, many famous books are written in these, and I’d love to enjoy reading books in their native languages. Chinese: For old Chinese literature and philosophy, and for understanding Sino-Vietnamese words. It’s generally useful too. \nThe language I’m willing to study and wouldn’t receive an instant download even if granted is the one I really like, which is Japanese. Mang of my colleagues have started learning Chinese while I’m still fixated on being a weeaboo who can speak Japanese for real.", "created_utc": "1665071031.0", "edited": "1665071721.0", "id": "irakqpz", "is_submitter": "False", "link_id": "t3_xwszc1", "parent_id": "t3_xwszc1", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Affectionate-Stay-94", "body": "Dude this is real smart! With the fantasy aspects if this series, the second scenario is very probable.", "created_utc": "1665069602.0", "edited": "False", "id": "irah3p1", "is_submitter": "False", "link_id": "t3_xwcy4p", "parent_id": "t1_ir8va3h", "score": "7", "subreddit": "OshiNoKo", "subreddit_id": "t5_2jgkd4"}, {"author": "Affectionate-Stay-94", "body": "The fact that the half-brother is like 4 years older is surreal, like that fucking father is ELEVEN or so when in a relationship with a married woman? Whether this plot hole or not, it still makes me sick. This can’t be way real shit, I’m dizzy, man.", "created_utc": "1665069261.0", "edited": "False", "id": "irag998", "is_submitter": "False", "link_id": "t3_xwcy4p", "parent_id": "t3_xwcy4p", "score": "26", "subreddit": "OshiNoKo", "subreddit_id": "t5_2jgkd4"}, {"author": "Affectionate-Stay-94", "body": "I remember watching this show back in the day when I just started out with yuri. Tbh, the only thing I remember about this was the fucking twist about the siblings. I was bamboozled, felt like a fool. For shows like this, I haven’t even added them to mal or anilist yet. Maybe I’ll have a rewatch, haven’t seen anyone mention it for a while.", "created_utc": "1664463085.0", "edited": "False", "id": "iqdgdvt", "is_submitter": "False", "link_id": "t3_xr7ecm", "parent_id": "t3_xr7ecm", "score": "4", "subreddit": "shoujoai", "subreddit_id": "t5_2t5g1"}, {"author": "Affectionate-Stay-94", "body": "Why I want LycoReco to be romance\n\nThis show, to me, would be perfect if it went for full romance route.\nWhy? So, I got this feeling from watching the show is that while I fucking adore the iconic scenes of the first half, I feel like the pace of the plot slowed down in the last half and, with week-long waits, the episodes felt choppy and incoherent. I was worried about the ending when someone said Anzai Chika-san’s favorite ep to voice was ep 9. Why ep 9, not 13? A favorite show for me is a show with a satisfying ending, that’s why it worried me. With that many themes, from arnachy and heroism from Majima, to authority from DA, to missions of life from Alan Institution, to selfishness and selflessness from the main pair, I knew nothing will be dissected in depth. And of course, there was no way the romance would have born fruits by the end of this show, I thought, with Takina being oblivious of same-sex love well into half of the show. While I still love this series, in retrospect, the selling point to me was the characters: they’re so lovable, worthy of a comfy SoL. Actions: it was quite some eye candy tho. When it comes to plot and impact, I don’t think so.\n\nWhat if they went for the romance route? I imagine a love with visible hints of endearing first-perspective thoughts, even darker and more gruesome circumstances, even more danger, more confessions of true feelings, emotional damages flying everywhere. For an action-romance show, this might entails the show being longer, but I wouldn’t mind. That’s the furthest I can imagine, but if it had been like that, whew, what a show it would turned out. Would be cool if someone take the og characters and rewrite the whole thing, waiting for the fanfics after the finale.\n\nEdit: Plus, if they love each other romantically, or if the finale having them lying next to each other and laugh after the fight (or dare I say, even if parting in Death), the ED theme would hit so fucking hard. To fill this hole of this ending, gonna rewatch the whole Revue Starlight series plus Movie twice for musical girlfriends fighting and saving each other. Man, RevStar is just so gei.", "created_utc": "1664039531.0", "edited": "1664072635.0", "id": "ipqk8rn", "is_submitter": "False", "link_id": "t3_xmx1lp", "parent_id": "t3_xmx1lp", "score": "24", "subreddit": "LycorisRecoil", "subreddit_id": "t5_5l9vep"}, {"author": "Affectionate-Stay-94", "body": "\"Excuse me milady, but I need to have your heart arrested.\"", "created_utc": "1661760617.0", "edited": "False", "id": "im8cwdb", "is_submitter": "False", "link_id": "t3_x0gqu8", "parent_id": "t3_x0gqu8", "score": "23", "subreddit": "LycorisRecoil", "subreddit_id": "t5_5l9vep"}, {"author": "Affectionate-Stay-94", "body": "Arioto being animated is like, in my dreams, but if it’s realized it’s gonna be one of the best H-tai with plot ever if invested with good animation and voice acting.", "created_utc": "1661624438.0", "edited": "1662905487.0", "id": "im15t87", "is_submitter": "False", "link_id": "t3_wz2s10", "parent_id": "t3_wz2s10", "score": "2", "subreddit": "yurimemes", "subreddit_id": "t5_xxiyb"}, {"author": "Affectionate-Stay-94", "body": "I can’t imagine Adachi being bot lmao. If she’s bot, she ain’t need all that “preparation” in anime special 3 really. And in general, no, it’s AdaTop.", "created_utc": "1661624113.0", "edited": "False", "id": "im150h3", "is_submitter": "False", "link_id": "t3_wz225m", "parent_id": "t1_im0vjrv", "score": "7", "subreddit": "yurimemes", "subreddit_id": "t5_xxiyb"}, {"author": "Affectionate-Stay-94", "body": "At this point all the theories hurt my head so much I just resign myself to whatever the studio have to throw at me. I hope for a happy ending, but if it’s not, I’ll still be treasuring this show too much to protest. Really, how I like these girls, hope somehow Chisato (and Takina) can make it.", "created_utc": "1661623130.0", "edited": "False", "id": "im12m85", "is_submitter": "False", "link_id": "t3_wz6iij", "parent_id": "t3_wz6iij", "score": "8", "subreddit": "LycorisRecoil", "subreddit_id": "t5_5l9vep"}, {"author": "Affectionate-Stay-94", "body": "The first is about to be animated, so this picture implies the second can be next too.", "created_utc": "1661190268.0", "edited": "False", "id": "ilck8by", "is_submitter": "False", "link_id": "t3_wn1ett", "parent_id": "t1_ik4y549", "score": "1", "subreddit": "yurimemes", "subreddit_id": "t5_xxiyb"}, {"author": "Affectionate-Stay-94", "body": "It’s getting an anime adaptation soon, and I’m so hyped to binge this after LycoReco.", "created_utc": "1661186831.0", "edited": "False", "id": "ilcb80q", "is_submitter": "False", "link_id": "t3_wtpeb7", "parent_id": "t3_wtpeb7", "score": "2", "subreddit": "yurimemes", "subreddit_id": "t5_xxiyb"}, {"author": "Affectionate-Stay-94", "body": "Now I’m so curious lol. Pray for your memories :))", "created_utc": "1661186236.0", "edited": "False", "id": "ilc9nw6", "is_submitter": "False", "link_id": "t3_wtsurf", "parent_id": "t1_il83ij3", "score": "2", "subreddit": "yurimemes", "subreddit_id": "t5_xxiyb"}, {"author": "Affectionate-Stay-94", "body": "People be afraid of Chisato/Majima ship and I’m here worrying about Chisato having a crush on Shinji as her savior. Like, personally I feel that Takina is the one who falls for Chisato first (I like to think a sign is at the last scene of ep 8 where Chisato thanked her for the pug keychain, and she blushed. Fuck off, Owl. And the way Takina looked at Chisato, how endearing and treasuring damnnn) while Chisato until now has only regarded her as a cute kouhai and her mind is still too burdened with the past and her “mission” given by Allan to seriously consider Takina as a romantic interest. Takina was changed by Chisato first while Chisato hasn’t fundamentally changed yet. If the pair is canon, it’ll be when Takina saves Chisato from “Yoshi-san” (urgh, I don’t like it when Chisato talks about him so damn much), marking the start of a mutual love.", "created_utc": "1661184911.0", "edited": "1661227369.0", "id": "ilc6749", "is_submitter": "False", "link_id": "t3_wuq3xm", "parent_id": "t3_wuq3xm", "score": "14", "subreddit": "LycorisRecoil", "subreddit_id": "t5_5l9vep"}, {"author": "Affectionate-Stay-94", "body": "Well, I was a lot like that: satisfying my gut and yell as hard and as cruelly as can be. And this is the thing: do I ever do that to someone not close? Never. It seems like I had a habit of hurting close ones with words, knowing that somehow I’d be forgiven. And sometimes from that actions I saw myself as selfish, heartless, beastlike and cold-blooded, as if I’d lost every piece of humanity inside me, and as quick as I felt guilty, I acted as if nothing happened and just continued with my wrongdoings. That sucked, as if I’d stay like that forever, being a jerk. I blamed it on the genes, the environment, my personality’s “inherent” flaws and such, or just thought that I was shitty unredeemable scum. Like, no matter what one thought, actions were what defined them, right? But the thing is there’s no guarantee that I, in the future, will do exactly what I’ve always done. The hard part is to act on the object to create a momentum, and to maintain that state. Seeking help from personal experts on emotions may work, because they can talk deeply to you and help you with the problems. Yeah, maybe there’s some way like put electricity in your brain areas and make you a calmer person, but for me it’s a bit artificial, unfeasible and temporary. But, in the end, only looking around for advice is not enough, and the results are down to the person to change. People don’t just magically get better, this need goals, small goals and a track of progress like building any other habits. Just remember to not let the past define your entire identity, and what you can do. Knowing the problem is the first step to change, but it’s not enough to take that one step only, do whatever it takes to improve is the way. I hope you can get reliable help and work toward what you want to react in the future. Best of luck.", "created_utc": "1659700487.0", "edited": "1659700805.0", "id": "ij1jjpb", "is_submitter": "False", "link_id": "t3_wgqqn0", "parent_id": "t3_wgqqn0", "score": "3", "subreddit": "EnneagramType4", "subreddit_id": "t5_jtde9"}, {"author": "Affectionate-Stay-94", "body": "No matter what you say, I see this as an absolute win.", "created_utc": "1659698868.0", "edited": "False", "id": "ij1gtag", "is_submitter": "False", "link_id": "t3_wgkjrk", "parent_id": "t3_wgkjrk", "score": "2", "subreddit": "yurimemes", "subreddit_id": "t5_xxiyb"}, {"author": "Affectionate-Stay-94", "body": "Yeah, but it’d be best (my thoughts) for them to have some depth, with some kicks of social reflections. I kinda like them to be not only cute and fluffy but have some kinda messeges or good execution that can be on par with the best of all romance ever; I want that kind of ambition for Yuri.", "created_utc": "1659698673.0", "edited": "False", "id": "ij1ghza", "is_submitter": "False", "link_id": "t3_wgkjrk", "parent_id": "t1_ij0it2t", "score": "4", "subreddit": "yurimemes", "subreddit_id": "t5_xxiyb"}, {"author": "Affectionate-Stay-94", "body": "The surface area is not too huge, so it won’t hurt as much as a broomstick tho.", "created_utc": "1659536415.0", "edited": "False", "id": "iis9pr6", "is_submitter": "False", "link_id": "t3_wf0lke", "parent_id": "t3_wf0lke", "score": "2", "subreddit": "Hololive", "subreddit_id": "t5_29numb"}, {"author": "Affectionate-Stay-94", "body": "Oh damn, so it's Lycoris Radiata. If it's resurrection lily, anyone will be alive again by magic, cool.", "created_utc": "1659517358.0", "edited": "False", "id": "iircxb4", "is_submitter": "False", "link_id": "t3_we9n07", "parent_id": "t1_iiqyy0c", "score": "1", "subreddit": "yurimemes", "subreddit_id": "t5_xxiyb"}, {"author": "Affectionate-Stay-94", "body": "One more omen perhaps everbody noticed (besides Chisato’s seiyuu) is that fucking flower Chisato offers Takina in the iconic poster. Chrysanthemum. The flower of DEATH. Fuxk, A-1 Picture can possibly, legally make a standard big studio move like KyoAni and I can’t even complain. And that man from Alan is so sus I…he’s just dangerous, in every way possible.", "created_utc": "1659458679.0", "edited": "False", "id": "iinweua", "is_submitter": "False", "link_id": "t3_we9n07", "parent_id": "t3_we9n07", "score": "5", "subreddit": "yurimemes", "subreddit_id": "t5_xxiyb"}, {"author": "Affectionate-Stay-94", "body": "Sooo cute! Adorable! Exquisite lovelinest! Her hands are cute!! \n(Sorry for nitpicking but I can’t help lol) Kanade must have a Super-Fucking-Strong grip to hold the noodle that high on the chopstick. And yeah, aesthetics purpose, but that is such a damn long noodle. It must be chewy!", "created_utc": "1659458105.0", "edited": "False", "id": "iinuu6s", "is_submitter": "False", "link_id": "t3_wdvl6y", "parent_id": "t3_wdvl6y", "score": "1", "subreddit": "ProjectSekai", "subreddit_id": "t5_273uao"}, {"author": "Affectionate-Stay-94", "body": "The thing that makes me afraided of as a bad omen is Chisato's VA is the one who voiced that infamous Kousaka Reina (that's funny, because her personality resembles Takina's a lot. Is this intentional, idk). Either A-1 Picture is gonna pull a \"lol the yuri-baiting girl, she reincarnated into another universe and is happily gei now!\" or \"surprise, history repeats itself!\"", "created_utc": "1659411043.0", "edited": "1659458282.0", "id": "iilkh5e", "is_submitter": "False", "link_id": "t3_wd90zr", "parent_id": "t3_wd90zr", "score": "5", "subreddit": "yurimemes", "subreddit_id": "t5_xxiyb"}, {"author": "Affectionate-Stay-94", "body": "\"Tell us you're talking about this one franchise without even mentioning its name.\"\n\nWell shiz, I'm glad I did watch the main series, the plot was good. I jumped in without knowing it was bait tho...", "created_utc": "1659353265.0", "edited": "False", "id": "iihttqr", "is_submitter": "False", "link_id": "t3_wbdufr", "parent_id": "t3_wbdufr", "score": "2", "subreddit": "yurimemes", "subreddit_id": "t5_xxiyb"}, {"author": "Affectionate-Stay-94", "body": "Well, I wanted more, but I’m satisfied really. I’m just dwelling on the one detail Tachihara said earlier in the series that never came true: Ayano and Nagisa as a double pair.", "created_utc": "1659044970.0", "edited": "False", "id": "ii1pacj", "is_submitter": "False", "link_id": "t3_wa7r3c", "parent_id": "t3_wa7r3c", "score": "1", "subreddit": "hanebado", "subreddit_id": "t5_l6i2e"}, {"author": "Affectionate-Stay-94", "body": "No no it’s ok, me too. We as RevStar fans must all make references whenever possible lol.", "created_utc": "1659042467.0", "edited": "False", "id": "ii1j0gw", "is_submitter": "False", "link_id": "t3_w8hgkr", "parent_id": "t1_ihtrftz", "score": "3", "subreddit": "yurimemes", "subreddit_id": "t5_xxiyb"}, {"author": "Affectionate-Stay-94", "body": "This manga is my first Yuri manga; I ritually come back to it now and then. I remember that time I first browsed in the “Shoujo Ai” section after reading “Bookmark of Demise” LNs and this came up. It was quite a proper introduction to the genre tbh: innocent when it comes to romance, hand-holding and kissing are the lewdest things in the whole series.", "created_utc": "1659041942.0", "edited": "1659042151.0", "id": "ii1hoe7", "is_submitter": "False", "link_id": "t3_wa6z4v", "parent_id": "t3_wa6z4v", "score": "4", "subreddit": "yurimemes", "subreddit_id": "t5_xxiyb"}, {"author": "Affectionate-Stay-94", "body": "Well geez wholesome information, thanks bot", "created_utc": "1657518398.0", "edited": "False", "id": "ifouiku", "is_submitter": "False", "link_id": "t3_vw870i", "parent_id": "t1_ifofnwp", "score": "19", "subreddit": "ProjectSekai", "subreddit_id": "t5_273uao"}, {"author": "Affectionate-Stay-94", "body": "A man of culture I see.", "created_utc": "1657390914.0", "edited": "False", "id": "ifi2txk", "is_submitter": "False", "link_id": "t3_vtldmc", "parent_id": "t1_ifagjl0", "score": "1", "subreddit": "yurimemes", "subreddit_id": "t5_xxiyb"}, {"author": "Affectionate-Stay-94", "body": "Shit, this artstyle…triggers my 1x1/2 memories. It sure is recognizable.", "created_utc": "1657389683.0", "edited": "False", "id": "ifi02iu", "is_submitter": "False", "link_id": "t3_vuv2af", "parent_id": "t3_vuv2af", "score": "15", "subreddit": "yurimemes", "subreddit_id": "t5_xxiyb"}, {"author": "Affectionate-Stay-94", "body": "No, it’s not sinful.\nAnd give us fucking Watanare 5 first Teren, a girl there got sandwiched for too long, needs breath.", "created_utc": "1657310935.0", "edited": "False", "id": "ifdz1px", "is_submitter": "False", "link_id": "t3_vu6cqp", "parent_id": "t3_vu6cqp", "score": "4", "subreddit": "wholesomeyuri", "subreddit_id": "t5_3jom8"}, {"author": "Affectionate-Stay-94", "body": "Tru af. It’s to the point that seeing any yuri manga recommendation with “by Murasakino” startles my mind a bit, like “lol, no, not again, but anyway, let’s read and suffer”.", "created_utc": "1657310347.0", "edited": "False", "id": "ifdxlhi", "is_submitter": "False", "link_id": "t3_vtvx6r", "parent_id": "t1_ifdqqhm", "score": "2", "subreddit": "yurimemes", "subreddit_id": "t5_xxiyb"}, {"author": "Affectionate-Stay-94", "body": "Yes, the yandere aspect is well shown on the dark face, perfectly portrayed, approved.", "created_utc": "1657308789.0", "edited": "False", "id": "ifdtqvx", "is_submitter": "False", "link_id": "t3_vpu4kr", "parent_id": "t3_vpu4kr", "score": "1", "subreddit": "yurimemes", "subreddit_id": "t5_xxiyb"}, {"author": "Affectionate-Stay-94", "body": "Seriously, is there anything Murasakino writes that ends on a good note? This is like the kind of bitter tea stuff that keeps me from the overdose of sweetness, but still…Make them happy damn it.", "created_utc": "1657307277.0", "edited": "False", "id": "ifdq18p", "is_submitter": "False", "link_id": "t3_vtvx6r", "parent_id": "t3_vtvx6r", "score": "4", "subreddit": "yurimemes", "subreddit_id": "t5_xxiyb"}, {"author": "Affectionate-Stay-94", "body": "For our yuri researchers, the original one is a Light Novel, written by the leading researcher, author of Watanare-Mikami Teren, and featuring umm, hefty seggsual intarcourts that are not for junior ones. Since our holy website Sci-hub doesn't have it, you can totally read it illicitly on Meatbun Translation and NeoSekai Translation blog pages. If you wanna support the author, you can buy the works, yup. I bid my farewell here, good luck on your search for knowledge.", "created_utc": "1656492945.0", "edited": "False", "id": "ie5wypd", "is_submitter": "False", "link_id": "t3_vkdd44", "parent_id": "t3_vkdd44", "score": "3", "subreddit": "yurimemes", "subreddit_id": "t5_xxiyb"}, {"author": "Affectionate-Stay-94", "body": "Thanks, sounds fun already, gonna dive into it now.", "created_utc": "1656490803.0", "edited": "False", "id": "ie5ugyw", "is_submitter": "False", "link_id": "t3_viwkd7", "parent_id": "t1_idq2hv6", "score": "1", "subreddit": "yurimemes", "subreddit_id": "t5_xxiyb"}, {"author": "Affectionate-Stay-94", "body": "Umm, what is Yurikuma Arashi about? I heard that name couples of time but still hesitate to watch. It tackles depressing stuff or is there Bury the Gay or sth? I need to mentally prepare before jumping into any suspicious shiz, I was lucky I had prepared for Madoka before watching it lol.", "created_utc": "1656150883.0", "edited": "False", "id": "ido68v9", "is_submitter": "False", "link_id": "t3_viwkd7", "parent_id": "t1_idgeg0e", "score": "1", "subreddit": "yurimemes", "subreddit_id": "t5_xxiyb"}, {"author": "Affectionate-Stay-94", "body": "Ah, still remember about the good ol' days with this thing called MangaRock and this one being like one of the top stories or sth. Good memories with my early Yuri stuff.", "created_utc": "1655923201.0", "edited": "False", "id": "idc3jmk", "is_submitter": "False", "link_id": "t3_vfwvku", "parent_id": "t3_vfwvku", "score": "1", "subreddit": "yurimemes", "subreddit_id": "t5_xxiyb"}, {"author": "Affectionate-Stay-94", "body": "I was genuinely looking forward for new chapters back then when there were like, 1 chapters for months or something. But the ending was so rushed I didn't prepare my helmet for the abrupt twist. The way they introduced the goddamn mother IN THE LAST FEW CHAPTERS and the way they connected the details of her killing her father is just so off, man.\n\nBut the, ehehe, stuff in the last chapter, not gonna complain about that tho.", "created_utc": "1655922503.0", "edited": "False", "id": "idc1zoe", "is_submitter": "False", "link_id": "t3_vgf7fz", "parent_id": "t3_vgf7fz", "score": "4", "subreddit": "yurimemes", "subreddit_id": "t5_xxiyb"}, {"author": "Affectionate-Stay-94", "body": "Hmm, I've just thought, like if it'll be a cycle, why did it take so long tho. Or maybe Ichikawa was just taking a nice rest with her PS5.", "created_utc": "1655564893.0", "edited": "False", "id": "icu7t9n", "is_submitter": "False", "link_id": "t3_vewan4", "parent_id": "t3_vewan4", "score": "4", "subreddit": "LandoftheLustrous", "subreddit_id": "t5_3nwpr"}, {"author": "Affectionate-Stay-94", "body": "That song's lyrics and music are so cute. I fuccing like it.", "created_utc": "1655562296.0", "edited": "False", "id": "icu2ma1", "is_submitter": "False", "link_id": "t3_vesm1f", "parent_id": "t1_ics76pu", "score": "5", "subreddit": "ProjectSekai", "subreddit_id": "t5_273uao"}, {"author": "Affectionate-Stay-94", "body": "Lol, the way Sayaka only \"pachi pachi\" with the second one...", "created_utc": "1655003172.0", "edited": "False", "id": "ic1pa2y", "is_submitter": "False", "link_id": "t3_v9bzdv", "parent_id": "t3_v9bzdv", "score": "1", "subreddit": "yurimemes", "subreddit_id": "t5_xxiyb"}, {"author": "Affectionate-Stay-94", "body": "It's fun I can guess the reading based on the meaning only, \"trảm thủ\" and \"tự thú\". Despite having so many things in common, the sounds and looks of CVJK leave us no mutual intelligibility like some European languages. How amazing it would be to know one language and be able to understand others too. It's almost like accents and dialects.", "created_utc": "1655001126.0", "edited": "False", "id": "ic1ljjm", "is_submitter": "False", "link_id": "t3_v1l6e7", "parent_id": "t1_ic029if", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Affectionate-Stay-94", "body": "Three of the same element and two of the same band...Gosh what is with this luck.", "created_utc": "1655000426.0", "edited": "False", "id": "ic1k8sw", "is_submitter": "False", "link_id": "t3_va7o0s", "parent_id": "t1_ic15rgw", "score": "24", "subreddit": "ProjectSekai", "subreddit_id": "t5_273uao"}, {"author": "Affectionate-Stay-94", "body": "I heard \"thủ\" as literal meaning in films quite a bit, like in this word 首級 \"thủ cấp\", enemy's chopped head (ew). And \"đầu\" can be used figuratively too, like 頭腦 (brainpower or headquarter), and 頭先 is \"the first\". Argh, new Chinese characters really hurt  my infant brain, need to learn more.", "created_utc": "1654971192.0", "edited": "False", "id": "ibzza8c", "is_submitter": "False", "link_id": "t3_v1l6e7", "parent_id": "t1_ibzx4wo", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Affectionate-Stay-94", "body": "(Lemme just look it up, I don't know Chinese writing \\*type type\\*). Ok, I was quite surprised as \"lệnh\" usually means \"command\", which is this character 令 . It has the same pronunciation of the character in your comment because of this similar radical. Literally no one says \"lệnh\" as \"cold\", it's \"lạnh\". \"Đầu\" is \"head\" indeed, I'm just not sure how it's different to other \"head\" in Chinese, like 首 \"thủ\" (\"thủ\" is another Chinese-origin element, Coe for short, not used as standalone word). \"Cũ\" is \"old\", used for things, not people, and 古 is \"cổ\" in Coe. \"Grandmother\" is correct. 心 is \"tâm\" as a Coe, \"heart\" is \"tim\".", "created_utc": "1654969974.0", "edited": "False", "id": "ibzwo9b", "is_submitter": "False", "link_id": "t3_v1l6e7", "parent_id": "t1_ibztwm6", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Affectionate-Stay-94", "body": "For this reason, my experience learning Japanese as a beginner is like this: I learn the Kanji, which has a meaning in Chinese, which can be phonetically transcribed into Vietnamese, which can be diciphered as a simple Vietnamese meaning. In the process I recognized loads of Chinese meaning \"aha, I know this meaning\", or I would pick up the meanings that I usually just memorized the pronunciation and writing, like the \"can đảm\" 肝胆 above. I think it's quite a shame that many Vietnamese people don't understand the meaning of individual elements, but this ignorance can make the rediscovering process of one's own language through a foreign language quite interesting.\n\nThe dictionary I used for Chinese elements in general: [https://hvdic.thivien.net/hv](https://hvdic.thivien.net/hv) \n\nThis dictionary is powered by this poem website, if you're interested:\n\n[https://www.thivien.net/](https://www.thivien.net/)", "created_utc": "1654968788.0", "edited": "1654969193.0", "id": "ibzu57k", "is_submitter": "False", "link_id": "t3_v1l6e7", "parent_id": "t1_ibzsagh", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Affectionate-Stay-94", "body": "Well, yes, and no. Ok, take \"cold\" as an example. Normally we say, \"lạnh\", or \"rét\". In Sino-phonetic transcription (Not sure what it's called, but I'll use this), it is \"hàn\", which is 寒 in Chinese. These type of phonetic transcription is used for transcribing old poem into readable stuff, and each of them is analyzed in meaning as individual Chinese character in Literature classes. Chinese elements like \"cold\" or \"red\" or stuff are used more formally and met frequently in in compound words and names only; they never stand alone. If we want to say \"the red color\", we say \"đỏ\", not \"hồng\" 紅, because \"hồng\" normally means \"pink\" lol. A compound word: \"can đảm\" 肝胆 (literally \"liver+gallbladder), meaning \"brave, courageous\". This is the same as how English words can also be traced back to Latin or French roots or primitives. We can say that some of the Sino elements were adopted and \"localized\", like the On'yomi of Japanese. These elements then can be used as standalone words, such as \"flower\" 花: hoa. Besides them, we have other words derived from minor ethic languages such as Muong or Mon-Khmer, called \"Từ thuần Việt\" (Pure Vietnamese Words), which are comparable to Japanese Kun’yomi.\n\n[https://vi.wikipedia.org/wiki/T%E1%BB%AB\\_thu%E1%BA%A7n\\_Vi%E1%BB%87t#:\\~:text=T%C6%B0%C6%A1ng%20%E1%BB%A9ng%20Vi%E1%BB%87t%2DM%C6%B0%E1%BB%9Dng%3A%20v%E1%BB%A3,%2C%20g%C3%A0%2C%20tr%E1%BB%A9ng…](https://vi.wikipedia.org/wiki/T%E1%BB%AB_thu%E1%BA%A7n_Vi%E1%BB%87t#:~:text=T%C6%B0%C6%A1ng%20%E1%BB%A9ng%20Vi%E1%BB%87t%2DM%C6%B0%E1%BB%9Dng%3A%20v%E1%BB%A3,%2C%20g%C3%A0%2C%20tr%E1%BB%A9ng…)\n\nTo translate some words in the link:\n\nCorresponding with Viet-Muong Origin: vợ (wife), chồng (husband), ăn (eat), uống (drink), cười (smile), bơi (swim), nằm (lie down), khát (thirsty), trốn (hide), gáy (crowing of chicken/nape?), mỏ (beak), mâm (round tray), rá (closely-woven basket), chum (big clay pots), nồi (pots), váy (dress), cơm (rice), cây (tree), củ (tuber), rạ (rice’s remaining roots after harvesting), mây (cloud), cau (Areca catechu, a palm tree), gà (chicken), trứng (egg)... (So, a ton of them, at some point I can’t even tell which one has Sino origin and which one has native origin anymore.)\n\nI hope this can help somewhat :D", "created_utc": "1654967944.0", "edited": "1654971531.0", "id": "ibzsagh", "is_submitter": "False", "link_id": "t3_v1l6e7", "parent_id": "t1_ib8hvyc", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Affectionate-Stay-94", "body": "The former is one of the first GLs I read and left quite an impression long after the first read, I like it. And Koshiba Aoi, whose artist is famous for her other works, has a very good artstyle. However, a big however, is the story seems to develop really slow and worse, there has been few update on new chapters, so I dropped it quite some time ago.", "created_utc": "1654956971.0", "edited": "False", "id": "ibz50f2", "is_submitter": "False", "link_id": "t3_v9ewip", "parent_id": "t1_ibwu683", "score": "1", "subreddit": "yuri_manga", "subreddit_id": "t5_2baahr"}, {"author": "Affectionate-Stay-94", "body": "Shoujo Rei, Traffic Jam, Akuma no Odorikata, and every 25ji songs ever are the ones off the top of my head now for darker themes, I guess. Dramaturgy, Hare wo Matsu and Near have some bitter vibes too.", "created_utc": "1654869084.0", "edited": "False", "id": "ibusqzk", "is_submitter": "False", "link_id": "t3_v8drom", "parent_id": "t3_v8drom", "score": "1", "subreddit": "ProjectSekai", "subreddit_id": "t5_273uao"}, {"author": "Affectionate-Stay-94", "body": "Downvoted. Curse you, lucky bastard. >:((", "created_utc": "1654868679.0", "edited": "False", "id": "iburvv8", "is_submitter": "False", "link_id": "t3_v8uu4c", "parent_id": "t3_v8uu4c", "score": "4", "subreddit": "ProjectSekai", "subreddit_id": "t5_273uao"}, {"author": "Affectionate-Stay-94", "body": "I like Mafuyu's trained card. Her eyes and mouth reflect a sense of somberness, grief, and even anger or bitterness. Her tilted head may indicate embarassment, and her twitching limbs show resistance. How...humanlike, how lively she is in this card. This might be nitpicking but the shade of darkness in her eyes seems even lighter than before.\n\nI always wonder if being sad is the first step out of emotionlessness, and is a form of self-reflection, like: Is this what I really want? She doesn't want to be a \"patient\" anymore, forcefully pulling out all the IV tubes injecting into her left wrist risking her status quo. Idk, Mafuyu is good at acting and all, but if what shown in this card is her true self, that's a good sign she's being reborn somehow.\n\nAnd Len. My gosh look at that damn timid cinnamon roll, adorable af. After some events I thought the bois were banned to Nigo or sth and look at THAT.", "created_utc": "1654851496.0", "edited": "1654955629.0", "id": "ibu27f4", "is_submitter": "False", "link_id": "t3_v8xxlc", "parent_id": "t3_v8xxlc", "score": "7", "subreddit": "ProjectSekai", "subreddit_id": "t5_273uao"}, {"author": "Affectionate-Stay-94", "body": "I'm just afraid this is another correct answer...", "created_utc": "1654849837.0", "edited": "False", "id": "ibu0fbn", "is_submitter": "False", "link_id": "t3_v8iaky", "parent_id": "t1_ibr0bq8", "score": "5", "subreddit": "ProjectSekai", "subreddit_id": "t5_273uao"}, {"author": "Affectionate-Stay-94", "body": "What's the sauce?", "created_utc": "1654388105.0", "edited": "False", "id": "ib76z2p", "is_submitter": "False", "link_id": "t3_v4sqbq", "parent_id": "t3_v4sqbq", "score": "1", "subreddit": "yurimemes", "subreddit_id": "t5_xxiyb"}, {"author": "Affectionate-Stay-94", "body": "Ah, the relationships between girls are precious, I appreciate all those. They already have lots of blushing stuff, and even better in fighting shows where they have the legendary \"I'll protect you\". Sometimes I think subtext in other genres is even better than pure romance done badly tbh. We have shipping and doujins for our romantic craving souls already, don't we?", "created_utc": "1653048072.0", "edited": "False", "id": "i9bgtj4", "is_submitter": "False", "link_id": "t3_utr7nb", "parent_id": "t3_utr7nb", "score": "7", "subreddit": "yurimemes", "subreddit_id": "t5_xxiyb"}, {"author": "Affectionate-Stay-94", "body": "Idk, this is my first, but based on that \"suck my dick\" I guess that's ok?", "created_utc": "1653045307.0", "edited": "False", "id": "i9bbybo", "is_submitter": "False", "link_id": "t3_utib7q", "parent_id": "t1_i9bbl2r", "score": "1", "subreddit": "Sat", "subreddit_id": "t5_2qvxv"}, {"author": "Affectionate-Stay-94", "body": "You know, this Phos reminds me of the ragged Griffith in Berserk >! about to become a Godhand!<  so this last chapter just gave me double PTSDs lol.", "created_utc": "1652602662.0", "edited": "1652602848.0", "id": "i8o9ujm", "is_submitter": "False", "link_id": "t3_upop8m", "parent_id": "t3_upop8m", "score": "3", "subreddit": "LandoftheLustrous", "subreddit_id": "t5_3nwpr"}, {"author": "Affectionate-Stay-94", "body": "Me watching this in Chuunibyou: Another Yuri bait you throw huh, even though I ship it I won't be fooled it this time, duh. Anyway, thanks, give me more Nibumori, please.", "created_utc": "1652600117.0", "edited": "1653042698.0", "id": "i8o6vb9", "is_submitter": "False", "link_id": "t3_uq0gy8", "parent_id": "t3_uq0gy8", "score": "19", "subreddit": "yurimemes", "subreddit_id": "t5_xxiyb"}, {"author": "Affectionate-Stay-94", "body": "Every commissioned songs are top tier, and Saisei is the only one I can't come to like as the others. At first I didn't really pay attention to Tricolor, but after some listens and and reading the lyrics it grew on me, maybe it's in top 3 now. Covers songs are very all quality stuff, but I happen to like Cutlery, especially Kanade's solo. Hated by life is one of my favorite among the older songs in the game.", "created_utc": "1652498998.0", "edited": "False", "id": "i8jbztx", "is_submitter": "False", "link_id": "t3_uoy3lg", "parent_id": "t3_uoy3lg", "score": "2", "subreddit": "ProjectSekai", "subreddit_id": "t5_273uao"}, {"author": "Affectionate-Stay-94", "body": "When I read the first few chapters I expected this to be a story of a brat realizing his worth by seeing the joy in a seemingly dull job and at the same time helping a depressed bro find a special job. I like this picture because it reminds me of that little impression. Ah, good ignorant and innocent times before reading further...", "created_utc": "1652493846.0", "edited": "1652602413.0", "id": "i8j272g", "is_submitter": "False", "link_id": "t3_uozwbg", "parent_id": "t3_uozwbg", "score": "10", "subreddit": "LandoftheLustrous", "subreddit_id": "t5_3nwpr"}, {"author": "Affectionate-Stay-94", "body": "Cuz, new movie, so the fandom rises again?", "created_utc": "1648468517.0", "edited": "False", "id": "i2fe7do", "is_submitter": "False", "link_id": "t3_tnq8ic", "parent_id": "t1_i23w6y1", "score": "3", "subreddit": "yurimemes", "subreddit_id": "t5_xxiyb"}, {"author": "Affectionate-Stay-94", "body": "No, actually. The piece of mirror I got there is also from the True Ending.", "created_utc": "1642342439.0", "edited": "False", "id": "hswh010", "is_submitter": "True", "link_id": "t3_s0oi9a", "parent_id": "t1_hsv652f", "score": "1", "subreddit": "TheTempleOfEs", "subreddit_id": "t5_2c0woy"}]