[{"author": "alouette28", "body": "Pražský Nubeerbar 🙂 \n\nNikoho jsem v Praze neznala, bylo to týden po tom jak jsem se přestěhovala.Stáhla jsem appku Meetup a zkusila jsem navštívit nějakou akci. \nMůj chlap byl jedním z prvních co do mě něco řekly. \n\nTeď jsme spolu 4 roky a bydlíme spolu 3. Všechno je super a jsem moc šťastná ❤️\n\nPS. Nejsem Češka, omlouvám se za moji češtinu a případné chyby 😳🫣", "created_utc": "1666764961.0", "edited": "False", "id": "ittpdnb", "is_submitter": "False", "link_id": "t3_ydcz8i", "parent_id": "t3_ydcz8i", "score": "3", "subreddit": "czech", "subreddit_id": "t5_2qiht"}, {"author": "alouette28", "body": "Řřřřřřřřřřřřřřřřř", "created_utc": "1665036373.0", "edited": "False", "id": "ir90by6", "is_submitter": "False", "link_id": "t3_xw8mkl", "parent_id": "t3_xw8mkl", "score": "1", "subreddit": "czech", "subreddit_id": "t5_2qiht"}, {"author": "alouette28", "body": "I’m from Poland. \n\nI started learning English in kindergarten (I was about 5-6 then), I learned German from the age of 10 until 16, then I did 3 years of Italian in high school, and then went back to German at uni for two more years.\n\nEnglish is compulsory for everyone in Poland, and the second language is usually French or German, sometimes Spanish, Italian or Russian.\n\nCurrently I speak English at C2 level, my German got rusty due to lack of use and is about B1-B2, and I can only say really basic things in Italian.", "created_utc": "1664143698.0", "edited": "False", "id": "ipwaou2", "is_submitter": "False", "link_id": "t3_xnty9k", "parent_id": "t3_xnty9k", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "alouette28", "body": "I was introduced to it by my boyfriend during one of lockdowns 😁", "created_utc": "1659626880.0", "edited": "False", "id": "iixdsvf", "is_submitter": "False", "link_id": "t3_wfz1vr", "parent_id": "t3_wfz1vr", "score": "2", "subreddit": "OnlyFoolsAndHorses", "subreddit_id": "t5_33b08"}, {"author": "alouette28", "body": "I wish I could say British, but I guess my accent is more like a mixture of the British RP one, Estuary English (or more generally SE England), general Central European one (I hate being classified as Eastern European), and my native Polish.\n\nI am aiming for something more properly British, but I guess it might take me a while.", "created_utc": "1659373422.0", "edited": "False", "id": "iij24z6", "is_submitter": "False", "link_id": "t3_wcvdk9", "parent_id": "t3_wcvdk9", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "alouette28", "body": "English:\n\nBeatrice and Florence \n\nDaniel and Edward\n\n\nPolish:\n\nDorota and Ewa \n\nTadeusz and Daniel", "created_utc": "1654870740.0", "edited": "False", "id": "ibuwece", "is_submitter": "False", "link_id": "t3_v8wyw5", "parent_id": "t3_v8wyw5", "score": "1", "subreddit": "namenerds", "subreddit_id": "t5_2xmrc"}, {"author": "alouette28", "body": "Florence, Beatrice, Iris, Jane, Grace", "created_utc": "1652874751.0", "edited": "False", "id": "i929raz", "is_submitter": "False", "link_id": "t3_us7trf", "parent_id": "t3_us7trf", "score": "10", "subreddit": "namenerds", "subreddit_id": "t5_2xmrc"}, {"author": "alouette28", "body": "Nicole? No. \n\nI get Natalie and its all possible variations: Natalie, Nathalia, Nathalie, Nataliya etc. etc. My actual name is the version they use the least xD", "created_utc": "1652024924.0", "edited": "False", "id": "i7t4f6m", "is_submitter": "False", "link_id": "t3_ukconm", "parent_id": "t1_i7sy318", "score": "1", "subreddit": "namenerds", "subreddit_id": "t5_2xmrc"}, {"author": "alouette28", "body": "I know your pain. I’m Natalia and apart from my family, my bf and my closest friends everyone calls me Natalie 🙄 That’s not my name, why can’t people just learn?", "created_utc": "1652002944.0", "edited": "False", "id": "i7s3inu", "is_submitter": "False", "link_id": "t3_ukconm", "parent_id": "t1_i7ppo5l", "score": "1", "subreddit": "namenerds", "subreddit_id": "t5_2xmrc"}, {"author": "alouette28", "body": "No. It’s lazy. And at some point it usually becomes very inconvenient.\n\nI have a friend like this. He’s been in the country of my residence (the Czech Republic) for almost 5 years, he intends to get a permanent residence if not a citizenship (to get rid of any complications related to Brexit, and his age exempts him from the language requirement), and he makes almost a point to let everyone know that he only knows five words of Czech. And it’s not an exaggeration - he knows literally five words.\n\nWe told him enough times that he should at least try to learn Czech but he uses his standard excuse that he is no good at languages so why bother. This is probably true, tbh, before moving to CZ he lived in quite a few different countries and he never learned any of their languages \n\nAnd the fact that he’s a native English speaker doesn’t help - most people speak at least some English so why even try. Everyone can see that it’s really inconveniencing him - he can’t even read a simple menu in a cafe so whenever he has to do anything remotely official, e.g. going to a doctor, post office, govt office etc, he has to rely on someone else speaking Czech for him or he needs an English speaker.", "created_utc": "1651556442.0", "edited": "False", "id": "i74kluu", "is_submitter": "False", "link_id": "t3_ugoo8k", "parent_id": "t3_ugoo8k", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "alouette28", "body": "Yes. I don’t mind speaking Polish natively, it’s a good language (and definitely a difficult one for foreigners, if I wasn’t native, I’m not sure I would want to learn it) but I wish I was a native speaker of English.", "created_utc": "1649695485.0", "edited": "False", "id": "i4bavj6", "is_submitter": "False", "link_id": "t3_u11c2f", "parent_id": "t3_u11c2f", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "alouette28", "body": "My native language is Polish and I also speak English at C2, German at B1 and Czech at B1-B2. I recently started Ukrainian on Duolingo.\n\nI would say that it depends on the language and even the language I translate INTO differs depending on the language. \n\nI never translate anything in English. I just understand things as they are written/said and if I have any issues with understanding I look for an explanation in English.\n\nI translate German into English as they are from the same language family and some words are similar so it helps me understand, even though I learned it at school in Poland.\n\nWhen it comes to Czech and Ukrainian, I translate Czech mostly into Polish (but not necessarily all the time, as most of my learning materials are actually in Czech or in English) and Ukrainian into Polish. \n\nOther than that, if I see a phrase/word in any other language (that I am not learning) I translate it to English.", "created_utc": "1649694930.0", "edited": "False", "id": "i4b9f9q", "is_submitter": "False", "link_id": "t3_u0yo6o", "parent_id": "t3_u0yo6o", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "alouette28", "body": "Velká Británie, Rakousko, Nizozemsko, Kanada", "created_utc": "1649578263.0", "edited": "False", "id": "i452s8d", "is_submitter": "False", "link_id": "t3_u0aqzx", "parent_id": "t3_u0aqzx", "score": "3", "subreddit": "czech", "subreddit_id": "t5_2qiht"}, {"author": "alouette28", "body": "I’m from Poland. My family is not really involved in football - my mum doesn’t watch it at all and my dad only watches the national team and the big games like CL finals.\n\nOne of the finals I saw was the lost CL final in 2008. I started supporting Chelsea then. And I chose them also because my brother was (briefly) a Man Utd fan. \n\nThen I got involved a little bit more with the Polish league, but I still had a soft spot for Chelsea and followed what was going on. A couple of years ago I returned to Stamford Bridge properly, so to speak, and haven’t looked back. \n\nAnd having a boyfriend who’s a lifelong Chelsea supporter also helps ;) Just to clarify: I met him almost five years ago so my support for the club has nothing to do with him, I didn’t start following football because of him 🙄", "created_utc": "1647518687.0", "edited": "1647518888.0", "id": "i10betj", "is_submitter": "False", "link_id": "t3_tfss4z", "parent_id": "t3_tfss4z", "score": "1", "subreddit": "PremierLeague", "subreddit_id": "t5_2scup"}, {"author": "alouette28", "body": "Movie 43. \nAlmost made me vomit. I went to the cinema to see it and it is probably the only film I almost walked out of before the end. I barely sat through it, no idea who thought of that crap and who thought it was funny.", "created_utc": "1647295905.0", "edited": "False", "id": "i0o9htc", "is_submitter": "False", "link_id": "t3_tdw35d", "parent_id": "t3_tdw35d", "score": "0", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "alouette28", "body": "I have no intention to sue. From the labour law perspective, everything is and has always been Ok. It’s just my personal feeling. And I’m afraid there is no way for me not to do the exit interview.", "created_utc": "1647278530.0", "edited": "False", "id": "i0n22w3", "is_submitter": "True", "link_id": "t3_t9kr1v", "parent_id": "t1_hzvdwuc", "score": "2", "subreddit": "hatemyjob", "subreddit_id": "t5_2t80c"}, {"author": "alouette28", "body": "Lol, not a bad option", "created_utc": "1647278453.0", "edited": "False", "id": "i0n1vtr", "is_submitter": "True", "link_id": "t3_t9kr1v", "parent_id": "t1_i0n0ng3", "score": "1", "subreddit": "hatemyjob", "subreddit_id": "t5_2t80c"}, {"author": "alouette28", "body": "Poland (I don’t have accurate data, so it is my guess):\n\n1. Polish\n\n2. Russian\n\n3. English\n\n4. German \n\n5. French", "created_utc": "1646652403.0", "edited": "False", "id": "hzox62g", "is_submitter": "False", "link_id": "t3_t8h15w", "parent_id": "t3_t8h15w", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "alouette28", "body": "Ukrainian, Hebrew, Russian, German, Czech, and Italian.\n\nOut of these, I spend the most time on Ukrainian, sometimes I do a bit of Hebrew and a lesson or two in Czech every now and then. I haven’t done Russian, German or Italian for ages.", "created_utc": "1646604894.0", "edited": "False", "id": "hzmnxku", "is_submitter": "False", "link_id": "t3_t65t1k", "parent_id": "t3_t65t1k", "score": "1", "subreddit": "duolingo", "subreddit_id": "t5_2t6ze"}, {"author": "alouette28", "body": "My native language is Polish.\n\nI’m fluent in English, my Czech is decent (I understand pretty much everything but I sometimes lack words when I speak and I hardly ever write in Czech) and I have some understanding of German, but I haven’t used it for ages.\n\nI started Ukrainian on Duolingo a few days ago (so far so good, if I stick with it I might use other resources and study it more in depth) and I’m also planning to learn Hebrew.", "created_utc": "1646493531.0", "edited": "False", "id": "hzgjjoq", "is_submitter": "False", "link_id": "t3_t5x07t", "parent_id": "t3_t5x07t", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "alouette28", "body": "Hello, a Pole here 🙂\n\nI can’t think of any specific words, but names that could work are Róża (rose), Jagoda (blueberry), Malina mentioned earlier (raspberry).. When it comes to boys’ names, no idea.\n\nThe words you suggested, like Dolina or Preria, would not work as names - in Poland we have fairly strict rules and one of them is that you are not allowed to use common nouns as names. \nThere were a few parents who tried giving their kids names like Poziomka (wild strawberry) or Truskawka (strawberry) but they were not allowed on the grounds that the name would be ridiculed by others and would be embarrassing.\n\nAs you are into your Polish ancestry, maybe you could look into your family tree to see if there any nice-sounding names?\n\nIf you need any advice on Polish names, I’ll be happy to help! 🙂", "created_utc": "1646055669.0", "edited": "False", "id": "hyrym8o", "is_submitter": "False", "link_id": "t3_t3el2z", "parent_id": "t3_t3el2z", "score": "19", "subreddit": "namenerds", "subreddit_id": "t5_2xmrc"}, {"author": "alouette28", "body": "I prefer the classics so here is my top 5: \n\n- James\n\n- David\n\n- Daniel\n\n- Henry\n\n- Edward\n\nIt was a bit tricky though as it is much easier for me to find girls’ names I like.", "created_utc": "1645776383.0", "edited": "False", "id": "hycul6p", "is_submitter": "False", "link_id": "t3_t0f0fu", "parent_id": "t3_t0f0fu", "score": "1", "subreddit": "namenerds", "subreddit_id": "t5_2xmrc"}, {"author": "alouette28", "body": "Daniel and Beatrice\n\nDaniel and Florence\n\nEdward and Jane\n\nEdward and Margaret\n\nNicholas and Frances\n\nNicholas and Eunice", "created_utc": "1645036502.0", "edited": "False", "id": "hx7dl4a", "is_submitter": "False", "link_id": "t3_st71q5", "parent_id": "t3_st71q5", "score": "1", "subreddit": "namenerds", "subreddit_id": "t5_2xmrc"}, {"author": "alouette28", "body": "Anything by U2 (apart from Sunday Bloody Sunday). I can’t stand them. \n\nAnything by The Doors.\n\nHello by Lionel Richie - the song itself is not bad, but I have some bad memories so listening to it is painful.", "created_utc": "1644877116.0", "edited": "False", "id": "hwyp4ed", "is_submitter": "False", "link_id": "t3_ssb3yv", "parent_id": "t3_ssb3yv", "score": "1", "subreddit": "AskUK", "subreddit_id": "t5_2t4s3"}, {"author": "alouette28", "body": "I started supporting Chelsea after the lost CL final in 2008. And because my brother was (briefly) a Man U fan.\n\nThen I got involved a little bit more with the Polish league, but I still had a soft spot for Chelsea and followed what was going on. A couple of years ago I returned to Stamford Bridge properly, so to speak, and haven’t looked back 🙂\n\nAnd having a boyfriend who’s a lifelong Chelsea supporter also helps 😁", "created_utc": "1643278563.0", "edited": "False", "id": "huf7a3z", "is_submitter": "False", "link_id": "t3_sdlj97", "parent_id": "t3_sdlj97", "score": "1", "subreddit": "PremierLeague", "subreddit_id": "t5_2scup"}, {"author": "alouette28", "body": "- Sidewalk. It’s pavement.\n\n- Movie. What’s wrong with good old film? Does everything have to be a movie now?\n\n- Actor used to mean an actress. Actress is a perfectly good word, what’s wrong with it now?\n\n- Soccer. Yes, I am aware of the history of the word but it is football! Soccer is an awful Americanism.\n\n- Please advise. I’m always tempted to reply “Please fuck off” or something similar. I hate this phrase.\n\n- Inspiring/inspire etc. - why does everything have to be inspiring/inspire nowadays? WTF does it even mean? In my opinion it is overused. \n\n- Irregardless - This. Is. Not. A. Word. End of. \n\n- starting work emails with “Hi Team” or “Hi [Team Name]” \n\nLet’s put it in context: at work, I am the only person managing my two shared mailboxes: Refunds and Fees (the only other person who uses them is my manager and he does it only when I am away, so 99% of the time I am the only one replying to emails) and I am the only person working on Refunds and Fees. So there is no team, nobody else does it. \n\nTherefore, I’m pretty much the only person using the mailboxes. So if I see “Hi Refunds” I’m always tempted to reply “My name is not Refunds.” \n\nIt’s even worse if I reply from one of the shared mailboxes, but with my name and surname in the signature and I get a reply “Thank you Team”.. I’m close to murdering someone in such cases, my name is not Team, you Yank cunts! \nSometimes we have presentations about each department at work, “Meet the X team” so they are perfectly aware how many people handle what I do.. \n\n- “Please let me know once complete” / “Please send notification once complete”, especially the latter - I am not Facebook to send you notifications, you twat. And it’s annoying as it assumes that I need to be watched and the person giving me the job doesn’t trust me that I’ll do it.", "created_utc": "1642506846.0", "edited": "False", "id": "ht607sx", "is_submitter": "False", "link_id": "t3_s68m8y", "parent_id": "t3_s68m8y", "score": "2", "subreddit": "AskUK", "subreddit_id": "t5_2t4s3"}, {"author": "alouette28", "body": "He broke up with me (29F) after 5 years, pretty much out of the blue.\n\nIt all happened when I left our country for 6 months for an Erasmus exchange. When I was away, the day after I left he met a female friend, but he was honest with me and he told me about it.\n\nAfter I got back I could immediately tell that something wasn’t right - he kept mentioning his new friend all the time, she said this, she did that etc., to the point when I really got suspicious, but of course he always said that there was nothing between them and she was only his good friend. Yet at the same time he had her photo as his phone wallpaper and when I confronted him about it he lied and turned his head away from me. \n\nThe things got gradually worse anyway, the relationship became kinda mechanical and empty but being still young (we were 20 and 21 when we broke up) we didn’t know and didn’t want to address the issues and pretended they weren’t there.\n\nThen, in summer, I went on holiday and he told me that we need to talk after my return. I thought it would be a general conversation and maybe we would think about a solution but instead he just broke up with me - he gave me no warning he wanted to do it or any hints that it even crossed his mind, just all of a sudden. It was the first and so far the last time I just burst out crying on the spot, without a warning.\n\nIt was my first serious relationship so I really suffered afterwards and I didn’t date anyone for four years.\n\nI’m still in touch with my ex though, we are still really good friends - we even agreed that we were probably better friends than partners. He knows about my current boyfriend, I am aware that he as a girlfriend and all is well now :)", "created_utc": "1641226496.0", "edited": "False", "id": "hr353rn", "is_submitter": "False", "link_id": "t3_rumaax", "parent_id": "t3_rumaax", "score": "2", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "alouette28", "body": "Quick question - I’m an EU citizen with temp residency in CZ. I have been double vaccinated (I am not eligible for a booster yet). \n\nI understand that I only need an antigen test (I have booked it for tomorrow before the flight) + vax certificate to enter the country, am I correct? I’m flying tomorrow with Ryanair so if anyone has Ryanair-specific advice, I’ll be grateful.", "created_utc": "1640787656.0", "edited": "False", "id": "hqeu896", "is_submitter": "False", "link_id": "t3_rpq6z9", "parent_id": "t3_rpq6z9", "score": "1", "subreddit": "Prague", "subreddit_id": "t5_2qiss"}, {"author": "alouette28", "body": "I’m a Skankel.. Um, ok?", "created_utc": "1640290486.0", "edited": "False", "id": "hpq1g22", "is_submitter": "False", "link_id": "t3_rn1l83", "parent_id": "t3_rn1l83", "score": "1", "subreddit": "tumblr", "subreddit_id": "t5_2r7hk"}, {"author": "alouette28", "body": "My vote goes to Natalia. My name is Natalia though,  so I might be a bit biased 😁 It’s a good name - international, many nicknames, easy to spell and pronounce.", "created_utc": "1640289835.0", "edited": "False", "id": "hppzy7i", "is_submitter": "False", "link_id": "t3_rmyfdr", "parent_id": "t3_rmyfdr", "score": "1", "subreddit": "namenerds", "subreddit_id": "t5_2xmrc"}, {"author": "alouette28", "body": "1. Daniel\n\n2. James\n\n3. Florence\n\n4. Iris\n\n5. Nicholas\n\n6. Michael\n\n7. Frances\n\n8. William\n\n9. David\n\n10. Beatrice\n\n11. Alice\n\n12. Henry\n\n13. Grace\n\n14. George\n\n15. Louise\n\n16. Edward\n\n17. Margaret\n\n18. Benjamin\n\n19. Hannah", "created_utc": "1639742763.0", "edited": "False", "id": "howpexv", "is_submitter": "False", "link_id": "t3_rhygp7", "parent_id": "t3_rhygp7", "score": "1", "subreddit": "namenerds", "subreddit_id": "t5_2xmrc"}, {"author": "alouette28", "body": "- Uniforms and tools of police in the UK\n\n- Basketball positions\n\n- NBA Summer League\n\n- Distance from Las Vegas to the Grand Canyon by car\n\n- How to become an architect in the UK\n\n- A day in worklife of an architect\n\n- Timeline of lockdowns and re-openings in the UK last year (I’m not British, so I don’t remember)\n\n- Ante- and postnatal depression\n\n- Mental health in pregnancy\n\n- Can you be forced to go to a psychiatric hospital\n\n- UK drug possession laws\n\n- What is it like to be high on heroin", "created_utc": "1638784818.0", "edited": "False", "id": "hnfy0re", "is_submitter": "False", "link_id": "t3_r9frvj", "parent_id": "t3_r9frvj", "score": "1", "subreddit": "writing", "subreddit_id": "t5_2qh2n"}, {"author": "alouette28", "body": "I know, it sucks.\nIn my case most people I hang out with know that I can’t eat dairy but I still have to check what they put in the food because more often than not I tried something, felt crap afterwards (very often it was a literal crap lol) and then I heard “Oh sorry, I forgot you can’t eat it!”\n\nOr each time there is cake at work, or when it’s someone’s birthday, I have to refuse and answer many questions why I’m not having cake. And sometimes the cake is really nice so it’s a shame I miss it.\n\nAnd the restaurants or bars are the worst.. In the Czech Republic where I am, they are legally obliged to mention allergens in food - they have numbers from 1 to 12 or 13 and milk and dairy is a 7. So a trip to a restaurant can be really difficult if I go through the entire menu and there is a seven after a seven after a seven. Sometimes I literally have two or three things I can eat safely (there is always something that can be dodgy - sauce, cream, too much butter, actual milk, anything..) and it’s really annoying when I’m starving and have almost no choice.", "created_utc": "1637744317.0", "edited": "False", "id": "hlvpyl9", "is_submitter": "False", "link_id": "t3_r0yi81", "parent_id": "t3_r0yi81", "score": "5", "subreddit": "lactoseintolerant", "subreddit_id": "t5_2semk"}, {"author": "alouette28", "body": "If they could, they would ban the phrase everywhere, Poland included. I think it might have actually happened in Poland itself once or twice, if I’m not mistaken. But yes, usually the phrase is used in one context or other by the media abroad. \n\nAnd my government is not known for being particularly tactful so if there is a different way of clearing it all up, they haven’t thought about it yet. \n\nI am sad to agree with you regarding the authoritarian tendencies in Poland - it very much is going in this direction, with them destroying pretty much everything they can: media, the courts, education, foreign relations.. you name it. Now we’re pretty much on a road to becoming Belarus lite, the only hope for us is the change of government after an election which may not happen for a while. I don’t expect anything else than election though (we don’t have the best track record with uprisings or strikes so better not to risk another one), lots of Poles are too blind/scared/bought by various social aid schemes to actually notice that something is wrong. Not to say that social aid and social services are bad, but they use various allowances as a means to tie the people to them - the government gives us money every month, they surely can’t be bad? /s\n\nI know I have probably painted us as a borderline dictatorship but well, I don’t want to hide the fact or pretend that everything is OK and lovely. And I actually currently live outside Poland so it’s even more visible when I look at my country from a distance. \nAnd on a lighter note, if we managed Hitler, Stalin and 40 years of Communism, we’ll manage a bunch of insecure nationalists, we’ll be fine ;)", "created_utc": "1630061584.0", "edited": "1630062176.0", "id": "hajhk78", "is_submitter": "False", "link_id": "t3_pc99fd", "parent_id": "t1_hajga02", "score": "1", "subreddit": "Judaism", "subreddit_id": "t5_2qi67"}, {"author": "alouette28", "body": "As a reluctantly Catholic Pole, I’d like to add a few words (and I’m really embarrassed I have to explain myself on behalf of my country yet again..): \n\nThe government banned (or at least limited, I’m not sure about it being banned) the phrase “Polish death camps” because they believe that it implies that the camps were established and run by Poles, which is factually incorrect. They were obviously German Nazi camps, which happened to be located on the pre-war and current Polish territory.\n\nWhen it comes to being afraid of being vilified, as you suggest, sadly I have to agree here. They are scared to death of it because they cannot accept the fact that we are not the heroic Christ of Nations they like to portray us as. We are as flawed as any other nation and sometimes we were and are a bunch of right pieces of crap. They can’t deal with the fact that there were and are antisemites around us because it would expose their own hidden antisemitism and their nationalism and insecurity. To them it would mean losing face (if Poland even still has one, we are probably hated by every country around Europe) and admitting that we are not a nation of saints. And they can’t imagine it. So they resort to calling all people who try to uncover the truth anti-Polish as this is the only rhetoric they know - you’re either with us or against us. You’re either a good Catholic Pole or a Jew-loving traitor (sorry, I don’t think that, just used it to show their way of thinking). So there is nothing to rectify according to them.\n\nSorry you think that Poland is the bad guy. We are really not as bad as you think :) I have nothing but respect for you and your culture and religion (I’m interested in it myself and I’m in the process of learning as much as I can on my own, but that’s a topic for another post) so if you think I said something awkward above, let me know.  Peace!", "created_utc": "1630058037.0", "edited": "False", "id": "hajcxaf", "is_submitter": "False", "link_id": "t3_pc99fd", "parent_id": "t1_haixcc2", "score": "4", "subreddit": "Judaism", "subreddit_id": "t5_2qi67"}, {"author": "alouette28", "body": "I’m Polish. People tend to think I’m Russian, Ukrainian or Czech. As far as I know I have no ancestors in Russia, Ukraine or in the Czech Republic. No idea what makes them think so.\n\nAnd somehow, when I speak English, some people (always non-natives) ask if I’m from the UK or compliment my British accent!\n\nMy accent is probably not the typical Polish one, more a general Slavic one, but I do not sound British at all (even though wouldn’t mind having a more British-sounding accent, to be honest).", "created_utc": "1629922843.0", "edited": "False", "id": "hac50fv", "is_submitter": "False", "link_id": "t3_pb6upg", "parent_id": "t3_pb6upg", "score": "1", "subreddit": "AskEurope", "subreddit_id": "t5_2uayg"}, {"author": "alouette28", "body": "No, but I might look into it, it also seems fun 🙂", "created_utc": "1606942391.0", "edited": "False", "id": "geewmnc", "is_submitter": "True", "link_id": "t3_k5bbrk", "parent_id": "t1_geet4he", "score": "1", "subreddit": "Coloringbookspastime", "subreddit_id": "t5_38poi"}, {"author": "alouette28", "body": "Yeah, it was! Colouring is fun, and it's more relaxing than I thought! And it was almost addicting, when I finished one picture, I almost immediately wanted to start the following one. I'm definitely going to get a next book when I can", "created_utc": "1606940692.0", "edited": "False", "id": "geesvul", "is_submitter": "True", "link_id": "t3_k5bbrk", "parent_id": "t1_gees5ej", "score": "2", "subreddit": "Coloringbookspastime", "subreddit_id": "t5_38poi"}, {"author": "alouette28", "body": "Geographically, we are in the centre of the continent. We are most definitely in Central Europe.\nWe also belong to the Western Christianity as we are Catholics and not Orthodox like Russians or Ukrainians. And we are generally more \"western\" (or \"central\" if you prefer) in terms of culture, I would say.\n\nFor us in Poland Eastern Europe is Ukraine, Russia and Belarus. Not Poland, not Slovakia, and not the Czech Republic.", "created_utc": "1606833361.0", "edited": "False", "id": "ge9f77e", "is_submitter": "False", "link_id": "t3_k4hpce", "parent_id": "t1_ge9dhhi", "score": "1", "subreddit": "AskEurope", "subreddit_id": "t5_2uayg"}, {"author": "alouette28", "body": "Being friends with benefits.\n\nI tried it once and I made a crucial and most basic mistake of such arrangement: I fell in love with the guy. He did not reciprocate - I'm not even sure he realised that I had feelings for him and if he did he never said or did anything to let me know. \n\nI was naive and madly in love (especially the \"mad\" part was true, now I can see I was almost addicted to him and my mood during a given day depended on whether he texted me or not and if anything was planned with him) so I thought by being a good and obedient \"friend\" I would be able to make him notice my love and realise that I want to be with him as his girlfriend, not just a toy he could text any time he wanted some fun. \n\nIt didn't work, of course, he got bored with me pretty quickly, he found a girlfriend and I suffered like hell... I kind of expected the whole thing to end with him finding someone else but it was still bad, the night after I found out was and still is the only one when I literally cried myself to sleep and it took me about three or so months to get over him. \n\nLuckily it's much better now, I'm in a happy and stable relationship with someone else but the whole thing was definitely the thing I regret the most in my life and I will definitely not try it again.", "created_utc": "1603198604.0", "edited": "False", "id": "g9ffhcn", "is_submitter": "False", "link_id": "t3_jegwjt", "parent_id": "t3_jegwjt", "score": "3", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "alouette28", "body": "I think I can understand all of them, but if I had to choose one I understand the best, it would be the British one - quite a few of my friends and my bf are from the UK (different parts of it) so I guess I'm used to its different varieties.\nThe only exception is the Glaswegian accent - I went on a hop on-hop off bus tour around Glasgow once and for the first five or so minutes I was trying to figure out what language the guide was talking in, it sounded nothing like English - he had a really thick accent and I could hardly understand him.\nWhen it comes to the US, I understand everything. I haven't yet met an American with an accent I wouldn't be able to understand.\nI haven't met too many Australians so I can't comment but I have a Kiwi friend so it's pretty close, I think? I could understand him without problems and I must say that the NZ accent sounds nice :)\nAnd one of my friends also has a nice Irish accent, I must say I generally prefer the non-rhotic accents but in her case it sounds cool :)", "created_utc": "1602967092.0", "edited": "False", "id": "g9500kp", "is_submitter": "False", "link_id": "t3_jcmurx", "parent_id": "t3_jcmurx", "score": "1", "subreddit": "AskEurope", "subreddit_id": "t5_2uayg"}, {"author": "alouette28", "body": "I moved to the Czech Republic almost 3 years ago and I have no plans to go back to Poland. Visiting my family once in a while is enough.", "created_utc": "1599648915.0", "edited": "False", "id": "g4j9u9t", "is_submitter": "False", "link_id": "t3_ipbl3t", "parent_id": "t3_ipbl3t", "score": "8", "subreddit": "AskEurope", "subreddit_id": "t5_2uayg"}, {"author": "alouette28", "body": "Not bad, thanks. Better than it used to be, I guess I'm making progress but there is a long road ahead and I have a feeling that I'm getting worse.\n\nThere are still issues I'm not able to deal with, no matter how hard I try.\n\nI very often feel like my emotions and thoughts control me instead of me controlling them, and I often have a feeling that my anxiety about everything is getting out of hand - I can stress about almost anything, invent all kinds of doomsday scenarios which have 0% chance of happening and forget about what's actually going on.. I just don't know how to turn my head off and stop thinking about the same thing over and over again. \n\nAnother thing is (and I'm afraid will always be) my self-esteem, self-worth and other self-... things. I just can't trust myself 100%. I keep second guessing myself and whatever I do I keep thinking \"what if what I'm doing it wrong?\", \"what if they will notice?\" etc. etc., depending on circumstances. I just don't believe that I'm good enough in anything, really, even at work, I'm quite good at my job and I like it but I always feel that I'm not good enough and that they will notice it soon so every mistake I make feels like a confirmation of it and I wait for (in my mistaken opinion) the inevitable \"sorry we'll have to let you go\" talk. \n\nIt's not just about work, obviously. For example, I'm in a very happy relationship but I still feel like I'm not good enough and that my boyfriend will get fed up with my constant anxiety and problems and will leave me for someone more sane - he has never said it and has never made any gesture suggesting he was about to leave me for any reason. He is more than willing to talk to me and help me (and I must say he has already helped me a great deal) but I sometimes feel awkward when I'm upset and I want to talk to him because I just don't want to bother him with another silly problem I blew out of proportion. \n\nI must say I generally don't trust my own feelings, I have been upset about so many insignificant things that now whenever I feel bad I just think that I'm just being unreasonable again.\n\nAnd I just don't see anything special about myself, I don't see myself as unique in any way. If someone asked me if I like myself, I wouldn't know what to say. I tolerate myself, yes, and I know I'm not a horrible person, but I can't say I like myself. I've never done, to be honest. I have always seen myself as average at best, and even though I have tried many times, I have no idea how to change it.  \n\nSo I just try to draw as little attention to myself as possible, I prefer to be in the background and being the centre of attention (for any reason, I don't like it very much even if it's positive) is a nightmare. And I prefer to give than to receive. Which combined with my fear of being rejected (thanks, school years, I'm still terrified of being labelled as the odd one out) is probably a recipe for a disaster and a pushover. And a reason why I still struggle with all kinds of banter or jokes directed at me, I tend to read them literally, even though rationally I know that they are only jokes.\n\nSo to sum up, the mess in my head is getting worse and worse. And I'm considering talking to a psychologist if not a psychotherapist. Whoever it will be, they will have a source of income for the rest of their life, I assume.\n\nTL; DR - Not horrible, but I feel that it's getting worse and I'm considering talking to a psychotherapist. \n\n*As all non-natives say, English is not my first language so sorry for any mistakes.", "created_utc": "1597924786.0", "edited": "False", "id": "g27di67", "is_submitter": "False", "link_id": "t3_id0iv2", "parent_id": "t3_id0iv2", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "alouette28", "body": "Bröther may I have some drügs", "created_utc": "1597480684.0", "edited": "False", "id": "g1jwjd8", "is_submitter": "False", "link_id": "t3_ia1ev6", "parent_id": "t1_g1jqckm", "score": "4", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "alouette28", "body": "I'm in relocation industry. I process expense claims and invoices for people who are transferred to another location (mostly within the USA) by their company - I check if we can reimburse them for what they spent on their move.\n\nIt probably sounds incredibly boring but I like my job. Sometimes it can get stressful but usually it's all right and quite easy. I spend my workdays calculating, checking relocation policies of companies, and paying people :) I like it when I know that someone will get their money back thanks to my work. Also, each case is different so there is always a bit of investigation, and comparing involved :) \n\nI don't really like working with people and in my job I only work with data and tables (I contact my colleagues mostly via email) so I'm satisfied. Obviously, there are targets, audits and everything else you would associate with a typical corporation but I've learned to live with them.\n\nAlso, I like my job because it gives me a chance to learn about other countries, especially the USA - how they approach their moves, what's important to them, etc. etc.", "created_utc": "1596095981.0", "edited": "False", "id": "fzpjl39", "is_submitter": "False", "link_id": "t3_i08h7l", "parent_id": "t3_i08h7l", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "alouette28", "body": "100% agree. It happened to me three times and each time it was creepy..\n\nFirst time was when I was doing laundry and I said out loud that I needed laundry capsules - I said it TO MYSELF, nobody else was in the bathroom and I had never searched for capsules and the following day I started getting ads for them.\n\nQuite recently I went for a walk with my boyfriend and we walked past a car that you can rent for a short time, like an hour or less. We started talking about it, wondering if the fuel is included in the rental price. We did not google it or did not talk about it later - the whole conversation about cars lasted a couple of minutes and my phone was in my pocket. Neither of us has a driving licence so renting a car was not an option. \nGuess what - a day later I saw a Facebook ad for the car sharing company whose car we walked past the previous day!\n\nAnd the most recent thing: my boyfriend has a small electronic piano and he's been searching for sheet music to broaden his repertoire, so to speak. \nWe decided to visit a store (a physical one, not online) with sheet music. He was looking for his stuff and I got interested in Music Theory exam practice booklets (just out of interest - I've never wanted to study music, become a musician or anything like that). \nAs expected, the following day I got an ad on Facebook for sheet music and Music Theory courses! Even though my phone was in my bag, I did not look for anything related to music later or before. And somehow it was only me who got the ad and not him, even though he was more interested in music and actually googled the stuff he wanted to buy.\n\nI'm not a conspiracy theorist or anything but I refuse to believe that it's merely a coincidence or that there is any other explanation, especially that in all of those situations my phone was in my bag or pocket and I didn't use it in any way.\nSo how did I get the ads then if there was no searching or real interest on my side?", "created_utc": "1595956682.0", "edited": "False", "id": "fzj4r0l", "is_submitter": "False", "link_id": "t3_hzdh0g", "parent_id": "t1_fzik9px", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "alouette28", "body": "By the power of greydong!", "created_utc": "1591622142.0", "edited": "False", "id": "ftd77bv", "is_submitter": "False", "link_id": "t3_gyvj24", "parent_id": "t1_ftd37q0", "score": "5", "subreddit": "engrish", "subreddit_id": "t5_2qmxz"}, {"author": "alouette28", "body": "It happens to me too. \n\nMy native language is Polish, but I left Poland over two years ago and my only source of Polish is my family or Poles I meet abroad (e.g. my managers, in 2 out of 3 jobs I've had where I live now I had a Polish manager).\n\nEven though I am still exposed to Polish in some form, e.g. when I talk to my family or managers or when I read articles or comments in Polish, I definitely don't speak it as well as I used to do. I understand written and spoken Polish, of course, but I often hesitate when I have to write something or when I speak, I often have \"what do you call it in Polish?\" moments. \n\nI can even switch from one language to another without realising, I recently wanted to ask my mum if she also could hear a noise that sounded like someone was printing something and I said the first part of the sentence in Polish and the other one in English, with no intention to code switch.\n\nI can also see that I'm already making spelling mistakes I wouldn't have done a couple of years ago, like spelling \"niebieski\" (\"blue\") as \"nie bieski\", or \"niemiecki\" (\"German\") as \"nie miecki\". There are no words as \"bieski\" or \"miecki\" in Polish so such spelling would be impossible.\n\nAt the same time, my living abroad is not the only reason, I guess. I also was in an immersion class in high school (I had Maths, Geography and Biology in English), I studied English at university (and now I have an MA in Translation) and I generally interact with the world in English: I set the language of all electronic devices to English, I google stuff in English, I read in English (I don't remember the last time I read a text in Polish which would be longer than a magazine or an Internet article) most of my friends are native English speakers, and my boyfriend is an Englishman. So if we had to show it all as a pie chart or something, I would say that 90 or so percent of my day-to-day life is in English.\n\nEdit: the only thing I still do exclusively in Polish is counting. No matter where I am in the world, I always count in Polish. \n\nEven swearing is in both languages, and I noticed that tend to swear in English a bit more (even though nothing will replace a good, loud \"KURWA!\" :D). I also tend to talk to myself and think in both languages, sometimes I switch from one to another mid-sentence. I still tend to dream in Polish but I also have dreams in English, it depends who is in my dream.", "created_utc": "1591336946.0", "edited": "1591337873.0", "id": "fsy1wwc", "is_submitter": "False", "link_id": "t3_gwf3q6", "parent_id": "t3_gwf3q6", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "alouette28", "body": "Ha, I was just looking around and I stumbled upon your post. I know it's 3 months old but it's not that long, I guess :D\n\nGdańsk is nice, I liked its Old Town and the beaches, but to be honest, my favourite city in Poland after Kraków is Wroclaw. I like it because it was German before the war so it is a bit different than the rest of cities in Poland.", "created_utc": "1590688849.0", "edited": "False", "id": "fs42e3l", "is_submitter": "False", "link_id": "t3_f7zyiq", "parent_id": "t1_fs41269", "score": "1", "subreddit": "travel", "subreddit_id": "t5_2qh41"}, {"author": "alouette28", "body": "I have a degree in English, ticked Finance and work in the relocation industry - I process expense claims and invoices for an American relocation company.", "created_utc": "1590668462.0", "edited": "False", "id": "fs2yglq", "is_submitter": "False", "link_id": "t3_gs16v0", "parent_id": "t3_gs16v0", "score": "1", "subreddit": "isfj", "subreddit_id": "t5_2r39e"}, {"author": "alouette28", "body": "1. Prague (where I currently live so I might be a bit biased :D) - cheap, great location (2h to Dresden, 4h to Vienna, Bratislava & Berlin), wonderful beer, architecture - not just in the Old Town! Just walk around Vinohrady or Bubenec/Dejvice (the embassy district), some buildings are really beautiful.\n\n2 (but should be ex aequo with Prague). London - capital of my favourite country in Europe, and apart from Prague, my favourite city. I love its atmosphere, vibrancy, museums, architecture, food, parks.. I could go on and on :D\n\n3. Edinburgh - it is the capital of Scotland so why not? I found it prettier and more interesting than Glasgow, for example. But I might not be fair, I spent a week in Ed and just a couple of hours in Glasgow. Still, I preferred Edinburgh - nicer architecture, feel, closeness of the sea.\n\n4. Vienna - all has been said before, I think. But I do like its green areas and that it seems so calm and elegant.\n\n5. Berlin - a bit grey but still nice. Very hipster and trendy. \n\n6. Rome and Vatican - I really like Rome and everything, it's a lovely city with beautiful weather and architecture, but the noise... Jesus, it's horribly noisy and crowded, I definitely couldn't live in Rome. I put Vatican with it because of the location and I quite like it,  but I can't say anything specific.\n\n7. Lisbon - It was nice, that's the most I can say. The views were nice and the architecture is lovely but I think I preferred Porto. Still better than Madrid, definitely.\n\n8.Budapest - it's similar to Prague or Vienna in terms of architecture and the general character but it seems so..uh.. dirty. It's the first adjective I can think of, sorry. \n\n9. Bratislava - its Old Town was nice and small, but I didn't like the Castle very much. It didn't seem castle-like to me, more like a small palace or something, I expected something bigger than that, so it was a bit disappointing. I liked the Danube and the UFO bridge though.\n\n10. Madrid - disappointing. I couldn't see anything special there. Not my thing, nothing interesting about it. I'm not sure why so many people like it so much, but I've seen worse, too.\n\n11. Warsaw - even though it's the capital of my country I still don't like it very much (maybe because I'm from Kraków :D). Grey, sprawling, ugly, lots of concrete, glass and steel. And the Old Town is nothing special. I know what its history is and I appreciate the national effort to rebuild it but I can't make myself see anything pretty in it.\n\n12. Paris - contrary to the reputation, I didn't like it. Ok, I know, it's the City of Love and whatnot, but I've been to many more romantic cities than Paris. I only remember people trying to sell you everything possible, crowds everywhere and the sense of disappointment, I expected something better.\n\n13. Sofia - God..  Bulgarians of Reddit, I'm sorry, but this is the most horrible, the ugliest capital and city I have ever been to. Eyesore on eyesore. No redeeming qualities for me. Sorry. Never again.\n\n— Stockholm - not ranked because I don't remember much, only the cold March water and a museum with a shipwreck. So I don't want to rank it unfairly.\n\nSorry for a long post and my English (there still may be some mistakes). And it's my first Reddit post, yay!", "created_utc": "1590667847.0", "edited": "False", "id": "fs2xljp", "is_submitter": "False", "link_id": "t3_f7zyiq", "parent_id": "t3_f7zyiq", "score": "2", "subreddit": "travel", "subreddit_id": "t5_2qh41"}]