[{"author": "american_in_norway", "body": "There are at least 2 native speakers of Toki Pona, but that isn’t their only language, so not sure how much that applies to what you’re interested in\n\nHere’s an interview about it:  [here](https://m.youtube.com/watch?v=iZ2zBQbqKB8)", "created_utc": "1666976805.0", "edited": "False", "id": "iu56x8r", "is_submitter": "False", "link_id": "t3_yflxrw", "parent_id": "t3_yflxrw", "score": "28", "subreddit": "linguistics", "subreddit_id": "t5_2qhos"}, {"author": "american_in_norway", "body": "There is a difference in meaning, though. Resume means to continue after you previously stopped. So, let’s say you’re in the car giving someone directions, and they need to keep going straight down the road they’re currently on. You could say, “Continue going down this road,” but you couldn’t say, “Resume going down this road.” If they pulled over or stopped somewhere, then you could say, “Resume going down this road.” (Of course, there are more natural ways to express those things in both situations, but you get the point.)", "created_utc": "1666459967.0", "edited": "False", "id": "itcscte", "is_submitter": "False", "link_id": "t3_yast6a", "parent_id": "t1_itcoioz", "score": "4", "subreddit": "EnglishLearning", "subreddit_id": "t5_2u8ap"}, {"author": "american_in_norway", "body": "I bet you do and just don’t notice it.  I’m a native American English speaker, and off the top of my head, there are a few sentences it would be very unnatural for me to not drop the h with.\n\nFor example, I pronounce, “Go get him!” as “Go get ‘im!” unless I’m speaking very, very slowly. To not drop the h, I have to consciously stop myself very unnaturally between get and him.\n\nI’m curious, how would you pronounce this?", "created_utc": "1666459091.0", "edited": "False", "id": "itcq79k", "is_submitter": "False", "link_id": "t3_yac5if", "parent_id": "t1_itb4nci", "score": "3", "subreddit": "EnglishLearning", "subreddit_id": "t5_2u8ap"}, {"author": "american_in_norway", "body": "It seems like you may have understood the difference in your last comment, but let me try to lay it out as clearly as I can just in case.\n\nEngland is a country.  Scotland is a country.  The United States of America is also a country.\n\nIn England, the people *speak English*.  They are *English-speakers.*  English is their *language*.  In England, the people also *are English.*  English is their *nationality.*\n\nIn Scotland, the people *speak English.*  They are *English-speakers.*  English is their *language*.   However, in Scotland, the people *are Scottish*. Scottish is their *nationality.*\n\nIn the United States of America, the people *speak English*.  They are *English-speakers.*  English is their *language.*  However, in the United States of America, the people *are American.*  American is their *nationality.*\n\nThis is the same for other countries too.  In Jamaica, the people *speak English*.  (In Jamaica, 97% of the people *speak English*.)  They are *English-speakers.*  However, in Jamaica, the people *are Jamaican*.  Jamaican is their *nationality.*\n\n(Of course, this oversimplifies things a little bit, because there are other languages in all of these countries, and England and Scotland are both part of the United Kingdom.)\n\nSometimes, different cultures refer to things in different ways.  If your culture refers these things in different ways, that's cool!  But this is how these are referred to in English.", "created_utc": "1666291389.0", "edited": "False", "id": "it3rbgw", "is_submitter": "False", "link_id": "t3_y8x20h", "parent_id": "t3_y8x20h", "score": "7", "subreddit": "EnglishLearning", "subreddit_id": "t5_2u8ap"}, {"author": "american_in_norway", "body": "I’m white, from a middle class background. Family goes back at least several generations in southern Illinois from genealogy we’ve done.\n\nFor what it’s worth, my guess is re-analyzation, but could see it being something else too!", "created_utc": "1666025796.0", "edited": "False", "id": "isoz4dm", "is_submitter": "False", "link_id": "t3_y5yq7e", "parent_id": "t1_isn5g90", "score": "4", "subreddit": "linguistics", "subreddit_id": "t5_2qhos"}, {"author": "american_in_norway", "body": "I’m also from southern Illinois, but I don’t pronounce the L in any of the words you do. I don’t really know anyone who does either. That would sound a little odd to me. It’s interesting that you guys do though!", "created_utc": "1665983424.0", "edited": "False", "id": "isn1vpg", "is_submitter": "False", "link_id": "t3_y5yq7e", "parent_id": "t1_isms1hz", "score": "23", "subreddit": "linguistics", "subreddit_id": "t5_2qhos"}, {"author": "american_in_norway", "body": "I agree with u/ThirteenOnline. I just want to add that, in most contexts, saying, “I don’t mean to insist, but…” would be taken as at least a little pushy. It’s kind of like saying, “I really am insisting you do it, but I’m trying to be polite.” \n\nI think the most natural place to see that phrase would be in an email between coworkers who aren’t very close. For me, at least, I would feel like I was being a little too pushy or demanding if I said that to a coworker I was friendly with. You might also see it when someone is talking to someone from a government office or trying to get customer service from a business. Like you said, it is pretty formal. And I think you would mostly see it in writing like an email, rather than spoken.\n\nIf you’re not in a formal situation or you’re talking to someone you’re friendly with, I would recommend: “I don’t want to rush you” like you mentioned, or, “I just wanted to follow up on…”  This is like a gentle reminder that you’re waiting for a response or some information.\n\nHope that’s helpful!", "created_utc": "1665943746.0", "edited": "False", "id": "iskle4a", "is_submitter": "False", "link_id": "t3_y5hidh", "parent_id": "t3_y5hidh", "score": "1", "subreddit": "EnglishLearning", "subreddit_id": "t5_2u8ap"}, {"author": "american_in_norway", "body": "If you consume comprehensible input in the language, where you can pick up on the gist of what’s being said from context, you’ll probably acquire the basics of the language. But I think it’ll really depend on (1) how much you consume—one hour a day vs. four hours a day would be a big difference over 2 months—and (2) how much of it you’re understanding from context.  For example, a few hours a day of truly comprehensible input like Dreaming Spanish or Le Français par la Méthode Nature, and you’d probably acquire a good foundation. An hour a day of trying to read a novel (i.e, no pictures or real context), and I’d guess you’d probably know what the common words in the language were but might not even know what most of them mean.\n\nThis is all based on SLA theory and research though, who knows what would happen in practice! I hope you keep us updated!", "created_utc": "1665896766.0", "edited": "False", "id": "isib977", "is_submitter": "False", "link_id": "t3_y56h3a", "parent_id": "t3_y56h3a", "score": "6", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "american_in_norway", "body": "It’s hard to know 100%, but it sounds to me like there might be a little bit of a gap between what you’ve learned and what you’ve acquired, to use the Krashen/CI terms. This is normal by the way! When you learn something, you consciously know it and can figure out how to say it correctly if you have enough time (which could be why it’s taking 10-15 seconds). When you acquire something, you can say it just as naturally as you could in your native language. In other words, it just flows out easily. Acquiring comes with time and getting lots of input, and there’s no way to shortcut it, so just keep going!", "created_utc": "1665812639.0", "edited": "False", "id": "isdw57e", "is_submitter": "False", "link_id": "t3_y4eeoq", "parent_id": "t3_y4eeoq", "score": "7", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "american_in_norway", "body": "I agree with the advice to teach English about her daily routines. I would recommend looking into comprehensible input (if you’re not already familiar with it) and try to speak to her a lot in simple, easy to understand English using gestures, pointing to things, etc. to make it clear what you mean. This is how our brains naturally acquire languages. Good luck to you both!", "created_utc": "1665811659.0", "edited": "False", "id": "isdutb0", "is_submitter": "False", "link_id": "t3_y49nor", "parent_id": "t3_y49nor", "score": "5", "subreddit": "EnglishLearning", "subreddit_id": "t5_2u8ap"}, {"author": "american_in_norway", "body": "That’s great! Thanks!", "created_utc": "1662051519.0", "edited": "False", "id": "imojyt3", "is_submitter": "True", "link_id": "t3_x30dw2", "parent_id": "t1_imnly9b", "score": "1", "subreddit": "duolingo", "subreddit_id": "t5_2t6ze"}, {"author": "american_in_norway", "body": "Hey, OP.  I'm a grad student in health psychology studying weight-neutral approaches to health promotion, so I think I can give some scientific background on this.  I haven't read through *all* of the comments, but from what I've seen, they are mostly focusing on the equality/justice/ethics side of the body positivity movement and/or the lived experiences of people labeled overweight or obese.  I think that both of these are very, very important perspectives on this.  I'll try to tackle OP's question from the scientific, scholarly perspective.  I recently did a scholarly review of the literature in this area.\n\n&#x200B;\n\n**TL;DR:  Health behaviors, like eating nutritiously and exercising regularly, have a much larger effect on health than what someone weighs.  Obese people who do these things generally have better health outcomes than lean people who do not.  Improving health behaviors improves health, even without weight loss, and is more sustainable than trying to lose weight.  DIETS DO NOT WORK (for more than about 6 months, anyway), and long-term weight loss is very difficult because of our physiology.**\n\n&#x200B;\n\n**The key takeaways:**\n\n**1.**  **It is not true that excess body fat has** ***no*** **effect on health; however, health behaviors (like eating nutritiously, physical activity) have a** ***much larger*** **effect on health than excess body fat.**  In other words, the role of weight is greatly overshadowed by the role of health behaviors.  \n\nSources:  see below.\n\n&#x200B;\n\n**2. People labeled obese who regularly engage in health behaviors often have health outcomes that are** **the same as or better than** **people labeled \"normal\" weight or \"healthy\" weight.**  In other words, an obese person who exercises regularly and eats nutritiously can have the same health outcomes as a lean person in the \"healthy\" weight range.  \n\nSources:  [Matheson, King, and Everett (2012)](https://doi.org/10.3122/jabfm.2012.01.110164), table 3 has the best breakdown.  [The Fat vs. Fit Study, Barry et al. (2014)](https://doi.org/10.1016/j.pcad.2013.09.002)  Notice how the hazard ratios for obese people in the higher health behavior groups and fit groups are nearly the same or lower than for \"healthy\" weight people, especially in the lower HB and unfit groups.\n\n*(I put both normal and healthy in quotes, by the way, because neither are truly accurate descriptors of this weight range.  Being in this weight range is no longer statistically normal/normative, and being in this weight range does not guarantee good health or necessarily indicate bad health.)*\n\n&#x200B;\n\n**3. People labeled \"normal\" weight or \"healthy\" weight who do not regularly engage in health behaviors often have health outcomes that are worse than obese people who do.**  The flip side of the above point.  Being in the \"healthy\" weight range does not mean you are necessarily healthy or that it is less important for you to live a healthy lifestyle.  Obese people who exercise regularly and eat nutritiously generally have better health outcomes than \"healthy\" weight people who do not.  \n\nSources:  In the Matheson and Barry studies above, notice how the hazard ratios for \"healthy\" weight people in the lower HB and unfit groups are higher than for obese people in the higher HB and fit groups.\n\n&#x200B;\n\n**4. Health can be improved without weight loss by improving health behaviors.  This weight-neutral approach has been shown in randomized trials to be as effective at health improvement** ***and possibly more sustainable*** **than weight-loss approaches.**  In other words, weight loss is not necessary to improve health; exercising and eating nutritiously alone improve health sustainably.  This has been shown in several studies that randomize half of the participants to a weight-loss program and half of the participants to a weight-neutral health behavior program.  Those in the weight-neutral program generally improve their health to the same extent as the weight-loss group.  In one trial, these improvements were sustained better as well.\n\nSources:  [Mensinger et al. (2016)](https://doi.org/10.1016/j.appet.2016.06.006).  [Bacon et al. (2005)](https://doi.org/10.1016/j.jada.2005.03.011)\n\n&#x200B;\n\n**5. Weight loss is much, much more difficult than most people think.  In fact, there is not good scientific evidence that weight loss of more than about 10% in the long-term is realistic for most people.  This is due to several physiological processes in the body that oppose weight loss.**  In other words, while it is important (in terms of health) for obese people to live a healthy lifestyle, eat nutritiously, and exercise regularly—just like it is for lean people—it is not realistic for most obese people to lose enough weight to be in the \"healthy\" weight range and maintain this in the long-term.  Most weight-loss programs work for about 6 months, but by 1 year, most improvements in weight loss and health are gone.\n\nSources:  [Ge et al. (2020)](https://doi.org/10.1136/bmj.m696), see the conclusions in the abstract for a very quick summary.  [Greenway (2015)](https://doi.org/10.1038/ijo.2015.59) for the physiology\n\n&#x200B;\n\n**6. Dieting is not an effective way to lose weight and poses some health risks.  NEVER ENCOURAGE A CHILD OR ADOLESCENT TO DIET.**   \"Going on a diet,\" using a fad diet, etc. is not a good way to try to lose weight.  It is not effective for more than about 6 months, is more likely to lead to weight gain in the long term, and is a predictor for developing an eating disorder.  It is much better to focus on slowly and sustainably changing exercise and eating patterns.  This is especially true for children and adolescents, who are more likely to develop an eating disorder after dieting.  Dieting, for any age group, generally leads to weight cycling (losing and regaining weight), which poses risks to your health.\n\nSources:  Ge et al. above.  [Golden et al. (2016)](https://publications.aap.org/pediatrics/article/138/3/e20161649/52684/Preventing-Obesity-and-Eating-Disorders-in).  [Rzehak et al. (2007)](https://link.springer.com/article/10.1007/s10654-007-9167-5)\n\n&#x200B;\n\nI'm really passionate about this topic and have done a lot of research into it.  I'm happy to answer any questions or discuss this with anyone!", "created_utc": "1661105580.0", "edited": "False", "id": "il7ysnp", "is_submitter": "False", "link_id": "t3_wtqdag", "parent_id": "t3_wtqdag", "score": "1", "subreddit": "changemyview", "subreddit_id": "t5_2w2s8"}, {"author": "american_in_norway", "body": "Halò a charaid!", "created_utc": "1659890668.0", "edited": "False", "id": "ijbv3gk", "is_submitter": "False", "link_id": "t3_wi2fqo", "parent_id": "t1_ijaocvc", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "american_in_norway", "body": "I was doing the same thing! It definitely took some repetition to get that first syllable always into my head 😂", "created_utc": "1653339523.0", "edited": "False", "id": "i9q9dz5", "is_submitter": "False", "link_id": "t3_uvjwgm", "parent_id": "t1_i9pdicv", "score": "3", "subreddit": "tokipona", "subreddit_id": "t5_2s5z5"}, {"author": "american_in_norway", "body": "tenpo suno pi mama meli la, mi pana e kasi pi weka e pipi tawa mama mi.  toki Inli la, kasi ni li jo e nimi MosquitAway.  ona li kepeken ni lon poka telo.  ken la, kasi ni anu kasi sama li pona tawa sina.  mi wile e ni: sina ken kama jo e nasin pi weka e pipi.  ona li ike a!  pona tawa sina!\n\n>!On Mother's Day, I gave my mom plants that keep bugs away.  In English, these plants are called \"MosquitAway.\"  She uses these by the pool.  Maybe, these plants or similar ones will be helpful for you.  I hope you can find a way to keep the bugs away.  They are terrible!!<\n\n>!(Corrections welcome!)!<", "created_utc": "1653266534.0", "edited": "False", "id": "i9mmdst", "is_submitter": "False", "link_id": "t3_uvmjrp", "parent_id": "t3_uvmjrp", "score": "2", "subreddit": "tokipona", "subreddit_id": "t5_2s5z5"}, {"author": "american_in_norway", "body": "ni li pona a!", "created_utc": "1653263632.0", "edited": "False", "id": "i9mgwed", "is_submitter": "False", "link_id": "t3_uvjwgm", "parent_id": "t1_i9luzee", "score": "1", "subreddit": "tokipona", "subreddit_id": "t5_2s5z5"}, {"author": "american_in_norway", "body": "toki! Others might know about more specific resources, but I can point you a few directions. \n\njan Misali’s course on YouTube: https://youtube.com/playlist?list=PLuYLhuXt4HrQIv3xnDxZqRaLfmxB2U5rJ  The first episode goes over basic pronunciation, and you can hear words pronounced in each episode as they’re introduced.\n\nThis Memrise course: http://www.memrise.com/course/352694/  It has audio as well, so you can hear the words as you learn them.  This helped me catch a few words I was mispronouncing slightly.\n\nAlso, each letter in Toki Pona always makes the same sound, so once you learn the sounds, you can basically pronounce every word!  Consonants are like English, except for j, which makes the sound y makes in English.  Vowels are like Spanish.  (I believe all of the letters make their IPA sounds, if that’s helpful, but double check me on that.)\n\nStress always goes on the first syllable. Personally, this is what I found myself messing up on more than sounds!  \n\nOther than that, I wouldn’t worry too much! Toki Pona pronunciation is very, very simple once you get the basics down.\n\npona tawa sina!", "created_utc": "1653253580.0", "edited": "False", "id": "i9lwnto", "is_submitter": "False", "link_id": "t3_uvjwgm", "parent_id": "t3_uvjwgm", "score": "7", "subreddit": "tokipona", "subreddit_id": "t5_2s5z5"}, {"author": "american_in_norway", "body": "I’ve been thinking about doing this (not sure what language yet, I like to hop around). I was thinking Swadesh lists might be a good starting point for finding the rough equivalents of many words in the TL? I haven’t really thought it through completely, but like you said, I think it might be an interesting way to build a foundation in the TL.", "created_utc": "1653199623.0", "edited": "False", "id": "i9ja6gq", "is_submitter": "False", "link_id": "t3_uubaro", "parent_id": "t3_uubaro", "score": "2", "subreddit": "tokipona", "subreddit_id": "t5_2s5z5"}]