[{"author": "analog_boy_", "body": "yes absolutely! I study a very similar thing!", "created_utc": "1663454349.0", "edited": "False", "id": "iouqyjz", "is_submitter": "False", "link_id": "t3_xgvgoq", "parent_id": "t3_xgvgoq", "score": "1", "subreddit": "linguistics", "subreddit_id": "t5_2qhos"}, {"author": "analog_boy_", "body": "Try looking up vocab flashcards for the SAT or GRE. That's how a lot of people in the US learn harder words. I'm sure they have decks premade on Anki", "created_utc": "1660449754.0", "edited": "False", "id": "ik7q12a", "is_submitter": "False", "link_id": "t3_wnwfwf", "parent_id": "t3_wnwfwf", "score": "2", "subreddit": "EnglishLearning", "subreddit_id": "t5_2u8ap"}, {"author": "analog_boy_", "body": "I had to take a reading comprehension exam for my PhD program. I chose Spanish and spent a year (Jan-Jan) on my own (pretty intensive over the summer but still self-taught) going from basically no knowledge of Spanish to passing the test at a mid-advanced level. Granted, this is a comprehension multiple-choice exam, so it was really testing my ability to take the test more than my actual Spanish skills, but the whole thing was in Spanish and I didn't have access to any kind of dictionary.\n\nThe biggest advice I have is that you have really work on grammar, since you can easily look up single words, especially nouns, but a complicated grammatical structure won't be solvable with just a dictionary. Grammar workbooks are great for this, especially the Routledge series. As far as what level you actually have to get to, honestly not very high (probably B1-B2 range) if you get to read and translate with a dictionary. \n\nI probably have more advice if you have more specific questions just shoot me a dm", "created_utc": "1660362473.0", "edited": "False", "id": "ik35mkm", "is_submitter": "False", "link_id": "t3_wmy8i8", "parent_id": "t3_wmy8i8", "score": "6", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "analog_boy_", "body": "Åh okej! det är Miss Li. Hennes album \"Underbart i all misär\" är på svenska och några av låtarna har versioner på engelska. Och \"X\" är också på svenska.", "created_utc": "1654445332.0", "edited": "False", "id": "ib9jqsm", "is_submitter": "False", "link_id": "t3_v4xxlv", "parent_id": "t1_ib8n1a7", "score": "1", "subreddit": "Svenska", "subreddit_id": "t5_2scor"}, {"author": "analog_boy_", "body": "&#x200B;\n\nMin favorit :)\n\nhttps://open.spotify.com/album/51Pbz9gnabh4ouprPLUx29?si=x3vqYTzHS1Ov9eD1RDWMHw", "created_utc": "1654411114.0", "edited": "False", "id": "ib8754f", "is_submitter": "False", "link_id": "t3_v4xxlv", "parent_id": "t3_v4xxlv", "score": "2", "subreddit": "Svenska", "subreddit_id": "t5_2scor"}, {"author": "analog_boy_", "body": "If you haven't reached out the tenants union yet you definitely should. They will have better advice for you, but right now don't pay them anything until you talk to the union and tell them that you have to speak with your lawyer", "created_utc": "1627387890.0", "edited": "False", "id": "h6p5jdy", "is_submitter": "False", "link_id": "t3_osftvt", "parent_id": "t3_osftvt", "score": "10", "subreddit": "IowaCity", "subreddit_id": "t5_2r945"}, {"author": "analog_boy_", "body": "Recognizing that they're more likely to be hurt by someone they know/an intimate partner than any stranger in a dark alley. Learning how to recognize abusive relationships and defend against common forms of domestic violence will help way more women than any technique.", "created_utc": "1622701876.0", "edited": "False", "id": "h0eshv7", "is_submitter": "False", "link_id": "t3_nqw0kh", "parent_id": "t3_nqw0kh", "score": "18", "subreddit": "martialarts", "subreddit_id": "t5_2qkt4"}, {"author": "analog_boy_", "body": "Hello I am also a trans guy and always looking for someone to go on walks with! I would also be down for gym workouts I just don't really have any experience in those spaces", "created_utc": "1620590805.0", "edited": "False", "id": "gxj5v6z", "is_submitter": "False", "link_id": "t3_n8i7l6", "parent_id": "t3_n8i7l6", "score": "6", "subreddit": "IowaCity", "subreddit_id": "t5_2r945"}, {"author": "analog_boy_", "body": "For me a big thing is not feeling like it has to look good in any way. It's okay to use bad handwriting or cross stuff out because no one is going to look at it but you. You could even try just scribbling on some of the pages just so you mark it up somehow bc those new journals are always intimidating", "created_utc": "1615873335.0", "edited": "False", "id": "gr3fjj3", "is_submitter": "False", "link_id": "t3_m61hxp", "parent_id": "t3_m61hxp", "score": "3", "subreddit": "Journaling", "subreddit_id": "t5_2s9nn"}, {"author": "analog_boy_", "body": "Exactly it's the same as teaching cover positions in blocks and long low stances. Kumite is different", "created_utc": "1609474981.0", "edited": "False", "id": "ghobhja", "is_submitter": "False", "link_id": "t3_knvf4o", "parent_id": "t1_ghmxxpv", "score": "2", "subreddit": "karate", "subreddit_id": "t5_2qo6l"}, {"author": "analog_boy_", "body": "This is important honestly i didn't have a choice of anything other than DI bc my chest was so big so it's always been kinda saddening to see guys on here be like \"i want the smaller nicer surgery bc why would I want big ugly scars and gross nipples\" when that's not a very accurate perspective of any option", "created_utc": "1609474027.0", "edited": "False", "id": "ghoa667", "is_submitter": "False", "link_id": "t3_knvleo", "parent_id": "t3_knvleo", "score": "3", "subreddit": "ftm", "subreddit_id": "t5_2t9mw"}, {"author": "analog_boy_", "body": "The kick looks really good but your posture is off. Straighten your back, bring your head up, and lean into the kick.", "created_utc": "1609384615.0", "edited": "False", "id": "ghkj8n7", "is_submitter": "False", "link_id": "t3_kngrdx", "parent_id": "t3_kngrdx", "score": "9", "subreddit": "karate", "subreddit_id": "t5_2qo6l"}, {"author": "analog_boy_", "body": "yes  you definitely can. I was a gifted student all through k-12, went to college on full scholarship, and managed to coast by being undiagnosed until literally my first semester of a phd program. My therapist and psychiatrist have both told me that it's incredibly common for people with high intelligence to be dismissed since they can overcompensate on natural ability. Pro tip: If you were lazy you would know bc u can't be lazy by accident when you feel like ur trying ur best.", "created_utc": "1608489867.0", "edited": "False", "id": "ggi66av", "is_submitter": "False", "link_id": "t3_kgw7iv", "parent_id": "t3_kgw7iv", "score": "2", "subreddit": "ADHD", "subreddit_id": "t5_2qnwb"}, {"author": "analog_boy_", "body": "I feel you on testim being sticky as hell. I put mine on in the morning and usually wait like 10 minutes before it's dry enough for me to get on with my day.", "created_utc": "1608448526.0", "edited": "False", "id": "gggae6z", "is_submitter": "False", "link_id": "t3_kgmfis", "parent_id": "t1_ggfuw02", "score": "1", "subreddit": "ftm", "subreddit_id": "t5_2t9mw"}, {"author": "analog_boy_", "body": "Honestly I have come to feel the same kind of ambivalence from the name I chose as the name I had before. It doesn't feel special or like perfectly me or anything but at least it doesn't give me dysphoria. I definitely like it though, it's mostly just memes about transmasc people that have made me come to not be as excited about it even though I picked it before I knew anything about transmasc culture.\n\nI think basically my point is that it's okay if a name doesn't feel magical or perfect for you as long as it's something you like. After all, lots of cis people don't like their names it's just that that's their name.", "created_utc": "1608356046.0", "edited": "False", "id": "ggc1wck", "is_submitter": "False", "link_id": "t3_kg03nj", "parent_id": "t3_kg03nj", "score": "2", "subreddit": "NonBinary", "subreddit_id": "t5_2vcez"}, {"author": "analog_boy_", "body": "Just wash it cold and if your washer has the option do like a delicate or hand wash setting. Obviously don't ever put it in the dryer. You can also just hand wash it yourself if you're really worried about putting it in a machine. Honestly I wouldn't be too concerned about the color fading that much, but if it ends up doing it others' suggestions for redyeing are also an option.", "created_utc": "1608319790.0", "edited": "False", "id": "gga8hxr", "is_submitter": "False", "link_id": "t3_kfha8r", "parent_id": "t3_kfha8r", "score": "2", "subreddit": "karate", "subreddit_id": "t5_2qo6l"}, {"author": "analog_boy_", "body": "when I worked at a call center we weren't allowed to get a supervisor unless the customer asked. But fun fact: asking nicely for the supervisor did the exact same thing as screaming at me and then we both had a better day.\n\nAlso 90% of the time when u call customer support you're calling a call center and talking to someone who doesn't even work for the company you're complaining about, so there really isn't that much they can do to help. It's really frustrating from both sides", "created_utc": "1608062632.0", "edited": "False", "id": "gfyf9x6", "is_submitter": "False", "link_id": "t3_kd7mdo", "parent_id": "t1_gfx1378", "score": "1", "subreddit": "PS4", "subreddit_id": "t5_2rrlp"}, {"author": "analog_boy_", "body": "That's absolutely awful. I'm sorry you had to deal with that", "created_utc": "1608062465.0", "edited": "False", "id": "gfyewe8", "is_submitter": "False", "link_id": "t3_kd7mdo", "parent_id": "t1_gfxdxov", "score": "1", "subreddit": "PS4", "subreddit_id": "t5_2rrlp"}, {"author": "analog_boy_", "body": "You're the best kind of person", "created_utc": "1607999522.0", "edited": "False", "id": "gfvp778", "is_submitter": "False", "link_id": "t3_kd7mdo", "parent_id": "t1_gfvki1w", "score": "3", "subreddit": "PS4", "subreddit_id": "t5_2rrlp"}, {"author": "analog_boy_", "body": "This whole situation sucks but i want to thank u for being polite to the customer service rep. I've worked in places like that for a long time and most people are not as kind as you.", "created_utc": "1607986258.0", "edited": "False", "id": "gfv0ip4", "is_submitter": "False", "link_id": "t3_kd7mdo", "parent_id": "t3_kd7mdo", "score": "5841", "subreddit": "PS4", "subreddit_id": "t5_2rrlp"}, {"author": "analog_boy_", "body": "Heian Nidan has always been my favorite, but Sandan and Yondan are probably tied for 2nd.", "created_utc": "1607488812.0", "edited": "False", "id": "gf4y1v6", "is_submitter": "False", "link_id": "t3_k9gx40", "parent_id": "t3_k9gx40", "score": "1", "subreddit": "karate", "subreddit_id": "t5_2qo6l"}, {"author": "analog_boy_", "body": "Karate Science is one of my favorite books as it goes into the physics and dynamics of movement. This is a link to it: [https://www.amazon.com/Karate-Science-Dynamic-Movement-Martial/dp/1594394598](https://www.amazon.com/Karate-Science-Dynamic-Movement-Martial/dp/1594394598)", "created_utc": "1606775968.0", "edited": "False", "id": "ge73kbk", "is_submitter": "False", "link_id": "t3_k42lso", "parent_id": "t3_k42lso", "score": "2", "subreddit": "karate", "subreddit_id": "t5_2qo6l"}, {"author": "analog_boy_", "body": "I would also recommend reaching out to the Union. They will know what your options are and also be able to help you organize better", "created_utc": "1606172546.0", "edited": "False", "id": "gddq2e3", "is_submitter": "False", "link_id": "t3_jzq2p2", "parent_id": "t1_gddnvoq", "score": "9", "subreddit": "IowaCity", "subreddit_id": "t5_2r945"}, {"author": "analog_boy_", "body": "This is a great video. Really wish there was more representation for trans people in karate honestly. I haven't even tried to compete since I came out just because I don't want to deal with it all", "created_utc": "1598897625.0", "edited": "False", "id": "g3hw8jq", "is_submitter": "False", "link_id": "t3_iivxkj", "parent_id": "t3_iivxkj", "score": "3", "subreddit": "karate", "subreddit_id": "t5_2qo6l"}, {"author": "analog_boy_", "body": "Honestly I'm in a very similar position as you. I'm really short and kinda heavy with really wide hips, and I always feel like I'll be such an ugly man and women won't be interested in me. I've worked a lot in therapy on my self-esteem and also just looking at cis men and men online who are in relationships even if they're not conventionally attractive. Honestly just that little bit has helped so much and there are days where I actually think of myself as attractive now which never would have happened for the first 21 years of my life ever.", "created_utc": "1597301705.0", "edited": "False", "id": "g1ayd1o", "is_submitter": "False", "link_id": "t3_i8gjl2", "parent_id": "t3_i8gjl2", "score": "2", "subreddit": "ftm", "subreddit_id": "t5_2t9mw"}, {"author": "analog_boy_", "body": "Yeah that's a horrible idea. I'm on \"low dose\" T and the very first things that happened (like within a month) was hair growth (everywhere), bottom growth (significant), and my voice dropped enough that I pass as male more often than I don't. It took 4 months for my period to stop and if I were to stop T it would come back right away but everything else is permanent. I understand birth control being dysphoric but saying it's a \"woman thing\" is transphobic as hell bc so many men have to use it. This person doesn't understand how hrt works and it only sounds like it would make whatever dysphoria they have worse", "created_utc": "1597019214.0", "edited": "False", "id": "g0y1w45", "is_submitter": "False", "link_id": "t3_i6ovks", "parent_id": "t3_i6ovks", "score": "3", "subreddit": "ftm", "subreddit_id": "t5_2t9mw"}, {"author": "analog_boy_", "body": "I would be interested! This is great that you're doing this :)", "created_utc": "1596781659.0", "edited": "False", "id": "g0neqy1", "is_submitter": "False", "link_id": "t3_i5511b", "parent_id": "t3_i5511b", "score": "2", "subreddit": "ftm", "subreddit_id": "t5_2t9mw"}, {"author": "analog_boy_", "body": "I'll keep an eye out for him hope he gets found!", "created_utc": "1596385606.0", "edited": "False", "id": "g046cqj", "is_submitter": "False", "link_id": "t3_i27oto", "parent_id": "t3_i27oto", "score": "1", "subreddit": "IowaCity", "subreddit_id": "t5_2r945"}, {"author": "analog_boy_", "body": "I'm not super good at keeping up with mine (bc u know ADHD..) but I've found that it works for me to do a monthly spread to go over big deadlines and my work schedule and regular monthly things like bills, and then set up weekly spreads that I can fill out a week or so in advance of assignments and readings. I also have a box for notes on each week that I can use for like phonecalls or other stuff that comes up that I have to remember. I tried doing different habit trackers and stuff but I just couldn't keep up with doing it every day.", "created_utc": "1595213539.0", "edited": "False", "id": "fymemhq", "is_submitter": "False", "link_id": "t3_hucwnx", "parent_id": "t3_hucwnx", "score": "2", "subreddit": "ADHD", "subreddit_id": "t5_2qnwb"}, {"author": "analog_boy_", "body": "I don't think it's selfish but I also understand her side of things and if discussing reproductive health is difficult/triggering for her because of her trauma then it would be best to just not talk to her about it.", "created_utc": "1595046906.0", "edited": "False", "id": "fyfnf2x", "is_submitter": "False", "link_id": "t3_ht9whr", "parent_id": "t3_ht9whr", "score": "4", "subreddit": "ftm", "subreddit_id": "t5_2t9mw"}, {"author": "analog_boy_", "body": "You will certainly get better faster if you train more. The way our rules work (and I agree with them) is that you have to have each kyu rank for at least 3 months before you can test again. This forces you to spend time with your new basics and kata and not rush through ranks. However, that being said, when you start reaching advanced ranks (purple-brown) and often even before that, you will start seeing the people who practice less taking 6+ months in between ranks vs \\~3. So basically, beginner ranks are a pretty set pace (unless you are someone who needs more time at a rank which is common for kids/other people who are maybe not super coordinated or athletic), but you will see practice pay off in faster advancement only once you start getting into higher ranks (although there is still a maximum pace that you can't exceed). That being said, practice will never hurt! In fact, it will be infinitely better for you to fix things at lower ranks and take your time. Maybe no matter how much you practice you'll still be a blue belt after a year, but instead of thinking \"I should be a higher rank than this,\" think \"I'm going to be the best blue belt they've ever seen.\"", "created_utc": "1594929523.0", "edited": "False", "id": "fyac44b", "is_submitter": "False", "link_id": "t3_hsemgq", "parent_id": "t3_hsemgq", "score": "4", "subreddit": "karate", "subreddit_id": "t5_2qo6l"}, {"author": "analog_boy_", "body": "I've literally never heard of this fact before and my ring finger is longer so it's clearly at least somewhat BS science anyway :/", "created_utc": "1594877119.0", "edited": "False", "id": "fy8477l", "is_submitter": "False", "link_id": "t3_hs2tzt", "parent_id": "t3_hs2tzt", "score": "4", "subreddit": "ftm", "subreddit_id": "t5_2t9mw"}, {"author": "analog_boy_", "body": "Yeah I mean I've been putting up with it for 12+ years now and I was running a club at my old college. I'm just asking on the super off chance there's something out there people have heard good things about. I honestly don't think it's too much to ask to not get constantly microaggressed and possibly assaulted when bigots have all the mat space they could ever ask for.", "created_utc": "1594853663.0", "edited": "False", "id": "fy71hpx", "is_submitter": "True", "link_id": "t3_hrx78t", "parent_id": "t1_fy6y4r6", "score": "1", "subreddit": "martialarts", "subreddit_id": "t5_2qkt4"}, {"author": "analog_boy_", "body": "Why can't you go back to the same dojo? I had a similar path to you (black belt in four years, got it at 14 after recovering from a knee injury), and I definitely get a Lot of imposter syndrome whenever I get the chance to train now (I had knee surgery in high school and then moved for college so I haven't trained as hard as I would like in about 6 years now). \nHonestly the way I see it is that of you're discrediting your own skill you're also discrediting your sensei's judgement. I know my Sensei would never have promoted me if I didn't deserve it and have I fallen off a little? Yes. But everyone understands life gets in the way and sometimes you can't always train. Especially since you're so young, you shouldn't get shit for being gone. People are only going to care that you're back.", "created_utc": "1594706453.0", "edited": "False", "id": "fy0enje", "is_submitter": "False", "link_id": "t3_hqpm31", "parent_id": "t3_hqpm31", "score": "3", "subreddit": "karate", "subreddit_id": "t5_2qo6l"}, {"author": "analog_boy_", "body": "I mean I'm both (nonbinary + transmasc) so it's okay to feel like you fluctuate or aren't sure. Labels are supposed to be descriptors that help you, not boxes you have to define yourself by!", "created_utc": "1594704650.0", "edited": "False", "id": "fy0ci4a", "is_submitter": "False", "link_id": "t3_hqr4l8", "parent_id": "t3_hqr4l8", "score": "1", "subreddit": "ftm", "subreddit_id": "t5_2t9mw"}, {"author": "analog_boy_", "body": "Karate helped me soooo much with my anxiety and social problems!! It definitely can't hurt to try!", "created_utc": "1594704000.0", "edited": "False", "id": "fy0bpdb", "is_submitter": "False", "link_id": "t3_hqpadn", "parent_id": "t3_hqpadn", "score": "2", "subreddit": "martialarts", "subreddit_id": "t5_2qkt4"}, {"author": "analog_boy_", "body": "My initial thought is that TMAs have a lot more to them than just \"how do I fight good in the shortest amount of time\" compared to something like boxing or MMA. Like if you want to be able to fight in the ring after a couple weeks than those are better options for you than a TMA, but if you want to study something like kata for example, then karate is a better option.\n\nI've trained karate for over a decade now and I did BJJ for a couple months before I had chest surgery and then the pandemic hit. I definitely felt like I was learning BJJ \"faster\" since everything I learned was immediately applicable to rolling. However, to be really good at it would still take me years, just like it took years to get good at the body intricacies that you need for just 1 Shotokan kata.  I've also taught people karate who were really good at boxing or wrestling for example, but they didn't have the same muscle finesse as someone who was good at karate, even if maybe the boxer would have been \"better\" in a fight. This is purely based on my own experiences so I'm sure others have given more thorough perspectives, but I think it's important to recognize that everything takes a \"long time\" to get good at, it's just are you trying to get good at about 6 punches or a few takedowns that you use in a fight (boxing or wrestling for example) or are you trying to learn your kihon and 25 katas to apply those concepts to self-defense/kumite?", "created_utc": "1594678324.0", "edited": "False", "id": "fxz52gj", "is_submitter": "False", "link_id": "t3_hqizaa", "parent_id": "t3_hqizaa", "score": "1", "subreddit": "martialarts", "subreddit_id": "t5_2qkt4"}, {"author": "analog_boy_", "body": "The biggest thing my parents didn't do and still have not done for me is doing their own research and actually taking initiative in learning about the community without me having to do all the work for them. I had to come out at 17, 19, and again at 21 just because they keep ignoring it (I'm 22 now). The fact that you're on here and asking this question is already a huge positive!", "created_utc": "1594677436.0", "edited": "False", "id": "fxz3bj2", "is_submitter": "False", "link_id": "t3_hqkbag", "parent_id": "t3_hqkbag", "score": "1", "subreddit": "ftm", "subreddit_id": "t5_2t9mw"}, {"author": "analog_boy_", "body": "I've gotten quite a lot of stuff there and I've never had a problem. I almost exclusively used them when I ordered everything for my college club and never once had anything go wrong with an order", "created_utc": "1594538926.0", "edited": "False", "id": "fxt5a1k", "is_submitter": "False", "link_id": "t3_hpp5mj", "parent_id": "t3_hpp5mj", "score": "1", "subreddit": "martialarts", "subreddit_id": "t5_2qkt4"}, {"author": "analog_boy_", "body": "I am not from there but I did take a class on this while I was abroad there. I will say that access takes a while since they only really have a couple clinics (which you have to go through if you want to use the national healthcare) like there's only one in Stockholm. The services as far as I know are pretty good, but again it's not like you can set up one appointment and walk out with everything you need the next day (but it will all be free if you qualify for national healthcare, and i don't know how that works for immigrants). If transitioning in your home is not difficult, I would say that is a better choice. Immigration to Sweden is not easy and for trans immigrants it's going to be harder and a lot more paperwork (idk if you are an EU citizen bc then this is probably easier).\n\nOne thing that comes to mind right away is the Personnummer that every one has to have and every service (not just government stuff) uses is gendered (the last number is either odd or even) and getting a new one is a hurdle for Swedish trans people. If you could move already with a legal male gender that would at least make that step easier. \n\nIdk what other advice I actually have but lmk if you think I can help!", "created_utc": "1594485284.0", "edited": "False", "id": "fxp6bcj", "is_submitter": "False", "link_id": "t3_hp87ua", "parent_id": "t3_hp87ua", "score": "2", "subreddit": "ftm", "subreddit_id": "t5_2t9mw"}, {"author": "analog_boy_", "body": "Yeah I've been on T for a few months, and my goals were mostly what you have also mentioned in terms of muscle/fat redistribution. I haven't really had much of that though, and I have had a lot of body hair growth which started almost right away. I didn't really want that either (I was already really hairy, might have had PCOS but never got tested) but it was something I had to come to terms with accepting in order to feel okay about hrt. T is not a miracle gender-dysphoria solution; it's a hormone that's going to make you look more like a man. Which for me made all the possible negatives worth it, but it might not for you.\n\nMuscle growth is something that can be achieved without hormones, even though T does help a little (I personally haven't noticed that much muscle growth although with quarantine I also haven't really been working out). Honestly I would look at your dad/brothers/other male relatives and realize that's what you will look like (obviously not right away, but eventually). If that is appealing (or at least the positives outweigh the negatives) then T would help. If not, then it won't. Realistic transition goals are difficult to have especially bc it involves separating dysphoria from general dysmorphia (like T will definitely make my voice deeper, but it's not going to make me taller or give me a 6-pack), and I think it would be a really good idea to talk to a therapist about that and see if you can get a better picture of what is possible for you.\n\nHowever, going off T doesn't really have any serious health concerns that aren't dysphoria-related, so if you start it and something starts happening that you don't like, you can always stop. Just remember that if you get body/facial hair for example and you don't like it, it's not reversible, stopping will just prevent it from growing more.\n\nOverall it sounds like you have generally the same concerns I did/still do, and ultimately it's up to you if you think it will help. (also I hear you on the endocrinologist, a lot of doctors, even ones who prescribe hormones, still don't really understand a lot of trans stuff unless it's just \"I want to be a binary man please give me all the T you have\" which is valid just not for everyone)", "created_utc": "1594073718.0", "edited": "False", "id": "fx58b2s", "is_submitter": "False", "link_id": "t3_hlx5dn", "parent_id": "t1_fx54dsb", "score": "1", "subreddit": "NonBinary", "subreddit_id": "t5_2vcez"}, {"author": "analog_boy_", "body": "That's sounds like a good plan for what you want! I would only caution one more thing that I'm sure you already know, and that's that most of the \"masculinization\" effects that aren't body hair/voice/bottom growth, so basically the muscle/fat redistribution, would revert once you stop taking T. One solution for that (and one that I will likely try at some point in my life) is taking it for a while, stopping and then resuming, but then again you're running into the same thing I mentioned earlier, just at a much slower pace. (I'm also not an endocrinologist so I can't say for certain, but that was something that my doctor mentioned to me for a future possibility. I'm also nonbinary, but I'm definitely much more Masc/Agender leaning and have no desire to ever be read as female so it sounds like I have slightly different goals than you for T.\n\nIt sounds like you've done your research though and I think this is definitely something worth pursuing if you want, as long as you're okay with a lot of body hair showing up overnight lol", "created_utc": "1594046372.0", "edited": "False", "id": "fx3pfd1", "is_submitter": "False", "link_id": "t3_hlx5dn", "parent_id": "t1_fx1vkir", "score": "4", "subreddit": "NonBinary", "subreddit_id": "t5_2vcez"}, {"author": "analog_boy_", "body": "Exactly yes to all of this and I will also add that if you don't know what you want/like then that's okay too! Tell her that you're not sure what is going to be good for you and what will make you dysphoric! You should be checking in with each other before/during/after and it's always okay to try stuff and end up not liking it, or also to avoid things you aren't sure of. I had this problem with my first relationship and being able to change my mind and also just to learn about myself with her was really important.", "created_utc": "1594012280.0", "edited": "False", "id": "fx2kuks", "is_submitter": "False", "link_id": "t3_hlwofx", "parent_id": "t1_fx1rro9", "score": "2", "subreddit": "ftm", "subreddit_id": "t5_2t9mw"}, {"author": "analog_boy_", "body": "The important thing I learned from my doctor is that lower doses of T don't actually change the Effects of T, they just make them happen slower. The analogy he gave was basically \"the five year picture will look the same regardless, it's just the 1 year and 3 year that will look different.\" Basically, low dose T is exactly that, a masculinizing hormone on a lower dose, not an androgynizing hormone.\n\nThat being said, I've been on a regular dose gel for several months now (I don't do it every day), and I've experienced very few changes besides a slight voice drop and a lot of body hair. It really depends on your genetics what happens first and how much. The other thing is that it is very difficult to stop your period if you're on a lower dose. \n\nI might be able to answer more questions if u have them but this is just what I thought was most important for you to know based off my personal experience.", "created_utc": "1593994696.0", "edited": "False", "id": "fx1tydu", "is_submitter": "False", "link_id": "t3_hlx5dn", "parent_id": "t3_hlx5dn", "score": "11", "subreddit": "NonBinary", "subreddit_id": "t5_2vcez"}, {"author": "analog_boy_", "body": "It's quite a drive for you but I had mine done with Dr Kayan in Minneapolis and she is absolutely incredible (she went way out of her way to help me with insurance and everything) I would recommend her to anyone", "created_utc": "1593717904.0", "edited": "False", "id": "fwq9rzf", "is_submitter": "False", "link_id": "t3_hk02an", "parent_id": "t3_hk02an", "score": "1", "subreddit": "ftm", "subreddit_id": "t5_2t9mw"}, {"author": "analog_boy_", "body": "Honestly, there's always a point in training especially for teens where it gets boring. Sometimes taking a break for a few months is exactly what you need to get your head right. I started karate when I was 10 and I took a break when I was 13 (granted this was mostly involuntary since I had an injury that prevented me from training). When I came back, I was more motivated than ever to work hard and I tested for my black belt about 1.5 years after that. (I'm 22 now for context)\n\nTaking a break is not bad, and it might actually make your training better when you do choose to come back. Don't be afraid to talk to your Sensei，and if you need more advice you can always ask!", "created_utc": "1593633581.0", "edited": "False", "id": "fwmaebz", "is_submitter": "False", "link_id": "t3_hj3v9g", "parent_id": "t3_hj3v9g", "score": "1", "subreddit": "karate", "subreddit_id": "t5_2qo6l"}, {"author": "analog_boy_", "body": "Hi! I'm from Minnesota and I've trained with some clubs in the cities area. Kitsune karate is traditional shotokan in Minneapolis and they will work u hard. One of my senseis of 10+ years works with them now, but I think she mostly teaches the kids class. I'm not sure how much \"contact\" sparring they do (definitely not what you would have in kyokushin), but based on how I trained it's not no-contact point sparring either except for beginners for safety reasons. Otherwise idk how far you can travel but Shotokan Karate of Lakeville is another club I've trained with a lot and the senseis will definitely push you and it's also very strict/traditional. Their curriculum also has more self-defense than other clubs.", "created_utc": "1592973024.0", "edited": "False", "id": "fvtjd5z", "is_submitter": "False", "link_id": "t3_hesd5k", "parent_id": "t3_hesd5k", "score": "1", "subreddit": "karate", "subreddit_id": "t5_2qo6l"}, {"author": "analog_boy_", "body": "I would love to have her!", "created_utc": "1592323661.0", "edited": "False", "id": "fv0venr", "is_submitter": "False", "link_id": "t3_ha62o1", "parent_id": "t3_ha62o1", "score": "1", "subreddit": "NoFeeAC", "subreddit_id": "t5_2leptk"}, {"author": "analog_boy_", "body": "She's all yours! I just DMed you!", "created_utc": "1592241986.0", "edited": "False", "id": "fux6646", "is_submitter": "True", "link_id": "t3_h9jfxd", "parent_id": "t1_fuwzgp9", "score": "1", "subreddit": "NoFeeAC", "subreddit_id": "t5_2leptk"}, {"author": "analog_boy_", "body": "This definitely happened to me too. The drains were incredibly painful and I had them in for 2 weeks. As soon as you get them out you'll feel so much better, but right now the best thing to do is keep taking your pain medication and try not to move too much. If you can move up your appointment that's probably a good idea, but I do think it's pretty normal for the drains to hurt.", "created_utc": "1590989959.0", "edited": "False", "id": "fshzv2o", "is_submitter": "False", "link_id": "t3_gubbj7", "parent_id": "t3_gubbj7", "score": "4", "subreddit": "ftm", "subreddit_id": "t5_2t9mw"}, {"author": "analog_boy_", "body": "I feel u on this. I picked Kaden because it sounded pretty similar to my birth name and I couldn't really find any other names I liked that started with a K (keeping my initials was very important to me). Of course I did this when I was like \\~17 and didn't know any other trans people or anything about transmasc stereotypes and now here I am!", "created_utc": "1586031363.0", "edited": "False", "id": "fmfo61g", "is_submitter": "False", "link_id": "t3_fuqe0r", "parent_id": "t3_fuqe0r", "score": "3", "subreddit": "ftm", "subreddit_id": "t5_2t9mw"}, {"author": "analog_boy_", "body": "I just started T but I have pics from ~ 6months post op pre-T if you don't find any with the other suggestions", "created_utc": "1580246451.0", "edited": "False", "id": "ffuouhi", "is_submitter": "False", "link_id": "t3_ev9x7t", "parent_id": "t3_ev9x7t", "score": "2", "subreddit": "NonBinary", "subreddit_id": "t5_2vcez"}, {"author": "analog_boy_", "body": "Yes definitely. I'm nonbinary so it's probably a little different but like I am definitely not straight in the way I'm attracted to girls. It's actually one of the things I've been most hesitant about in terms of transitioning/starting hrt because I know it's going to make queer women less attracted to me. \n\nBasically the way I view my sexuality is that I'm a lesbian except I'm not a woman nor am I exclusively attracted to women (I'm bi but prefer girls romantically) which is confusing because neither of those things is very lesbian of me.", "created_utc": "1578883692.0", "edited": "False", "id": "fe67sw9", "is_submitter": "False", "link_id": "t3_enwepz", "parent_id": "t3_enwepz", "score": "5", "subreddit": "ftm", "subreddit_id": "t5_2t9mw"}, {"author": "analog_boy_", "body": "It honestly sounds like you are doing a lot of really good work! Do you do any sports or other athletics? I think that also helps me with the dysphoria is like \"I want to be better at karate\" instead of 'I want to be thinner/have a certain kind of body I'll probably never have\"\n\nBut it seems like you are actually doing a lot of stuff well considering I know a lot of people start dieting and they just starve themselves. And I also get quitting nutrition apps too bc it does start to be more intuitive", "created_utc": "1578347807.0", "edited": "False", "id": "fdew35v", "is_submitter": "False", "link_id": "t3_ekvb2c", "parent_id": "t1_fdegcr2", "score": "3", "subreddit": "ftm", "subreddit_id": "t5_2t9mw"}, {"author": "analog_boy_", "body": "Yeah I agree that it's not really \"girly\" in my opinion to watch what you eat. I went through this process of losing weight (like 30lbs now) and what helped me a lot was focusing as much on macros as I did on calories in terms of like \"gotta get that protein\" and that actually made it a much more gender affirming process.\n\nBut I highkey relate that apps and stuff are really dysphoric when they gender you so much. What are you using? Bc I've noticed that some make it much more obvious than others.", "created_utc": "1578335894.0", "edited": "False", "id": "fdecaj2", "is_submitter": "False", "link_id": "t3_ekvb2c", "parent_id": "t1_fde8h8e", "score": "3", "subreddit": "ftm", "subreddit_id": "t5_2t9mw"}, {"author": "analog_boy_", "body": "I applied for everything with my preferred name last time I was job hunting and then after I got hired I talked to HR about it so my tax docs wouldn't get messed up. But saying \"actually my legal name is different\" was much much easier than being like \"actually I don't go by my legal name that you currently have on all your forms because I am Trans\"", "created_utc": "1578189269.0", "edited": "False", "id": "fd6dev8", "is_submitter": "False", "link_id": "t3_ek4wg6", "parent_id": "t3_ek4wg6", "score": "1", "subreddit": "ftm", "subreddit_id": "t5_2t9mw"}, {"author": "analog_boy_", "body": "It's not a choice to be nonbinary. That's just who you are/ how you feel. Whether or not you explore it or change anything about how you live your life is entirely up to you and not shitty gatekeepers", "created_utc": "1578188809.0", "edited": "False", "id": "fd6ccug", "is_submitter": "False", "link_id": "t3_ek1i0h", "parent_id": "t3_ek1i0h", "score": "2", "subreddit": "NonBinary", "subreddit_id": "t5_2vcez"}, {"author": "analog_boy_", "body": "I've been on gel for about 2.5 weeks and my throat has been so sore. Idk if it's related at all but I've just felt like I've had a very bad cold this whole time with chills and aches and idk if that's normal at all or if I'm having a bad reaction. It might also just be a cold, but it seems to be lasting a very long time. Has anyone else had this happen?", "created_utc": "1578001614.0", "edited": "False", "id": "fcvgioe", "is_submitter": "False", "link_id": "t3_ej2ulj", "parent_id": "t3_ej2ulj", "score": "1", "subreddit": "ftm", "subreddit_id": "t5_2t9mw"}, {"author": "analog_boy_", "body": "Not sure how helpful this is, but I'm nonbinary and transmasc. I present as masc 99% of the time, have had top surgery and am starting hrt. I also still identify with a lesbian label bc I experience my attraction to women in a very queer way, but also have been reflecting a lot on sexuality labels and their relationship to my gender if u wanted to talk about it more", "created_utc": "1576548429.0", "edited": "False", "id": "fb6ep5c", "is_submitter": "False", "link_id": "t3_ebhqsk", "parent_id": "t3_ebhqsk", "score": "1", "subreddit": "ftm", "subreddit_id": "t5_2t9mw"}, {"author": "analog_boy_", "body": "I hate hate hate being called an enby and I especially hate how this discourse has decided that acronyms can't stand for more than one thing and enby has become an umbrella term applied to my identity. I think with context people are capable of sorting out what an acronym stands for and they can be multiple things (mlm as a huge example). I respect Black people's right to have words that belong to just them, and would never for example capitalize nb for nonbinary, but also acronyms are not words and can mean more than one thing\n\nI would just rather everyone take the extra two seconds to just type out nonbinary if they're worried about it instead of just assuming everyone is okay being called an enby", "created_utc": "1576191817.0", "edited": "False", "id": "falwswi", "is_submitter": "False", "link_id": "t3_e9uabh", "parent_id": "t3_e9uabh", "score": "11", "subreddit": "NonBinary", "subreddit_id": "t5_2vcez"}, {"author": "analog_boy_", "body": "I can relate to this. My mom went from \"I wish you would shop in the women's section\" and buying me femme sweaters for Christmas that matched my sister when I was 17 to last year she bought me jeans and jacket before I went abroad from the men's section. She's still not that great at it considering it's been like 4 years since I came out, but she is improving slowly. I think your mom will come around too but it will also probably take a lot of time", "created_utc": "1575751920.0", "edited": "False", "id": "fa0b0nm", "is_submitter": "False", "link_id": "t3_e7eor0", "parent_id": "t3_e7eor0", "score": "4", "subreddit": "ftm", "subreddit_id": "t5_2t9mw"}, {"author": "analog_boy_", "body": "Right. I had that problem when I had a bigger packer. Now I've got a 3\" that fits so much better. The one nice thing about jock straps as opposed to harnesses though is that they're designed for cis men doing athletic things so they keep stuff together better than a harness designed for packing/playing. The other thing I also thought of is that your dick always looks bigger to yourself when you're not used to it, and it will probably not be nearly as noticable to other people esp if they read u as male at least in my experience", "created_utc": "1575729508.0", "edited": "False", "id": "f9yjhnr", "is_submitter": "False", "link_id": "t3_e76ls1", "parent_id": "t1_f9w81t9", "score": "1", "subreddit": "ftm", "subreddit_id": "t5_2t9mw"}, {"author": "analog_boy_", "body": "Idk how well this will work for you bc I always wear boxer briefs, but I use jock straps for packing. They're way cheaper than harnesses and it def keeps everything together and v secure. I sewed some backs onto mine (pretty easy to do w very little skill) so the silicone wouldn't touch my skin and get gross/smell bad. The only thing is there's no hole, although I suppose it would be pretty easy to make one, and my packer is not designed for penetration so idk if that would also make a difference.", "created_utc": "1575682212.0", "edited": "False", "id": "f9vx8fw", "is_submitter": "False", "link_id": "t3_e76ls1", "parent_id": "t3_e76ls1", "score": "1", "subreddit": "ftm", "subreddit_id": "t5_2t9mw"}]