[{"author": "Antaine1916", "body": "Not exactly the thing you want as a basis for your campaign, but you should definitely read Expedition to the Barrier Peaks, a TSR adventure module from 1981. It has a ***lot*** of the elements you mentioned.\n\n&#x200B;\n\nYou can also find a conversion document to put it in 5e.", "created_utc": "1667207302.0", "edited": "False", "id": "iuh7b9q", "is_submitter": "False", "link_id": "t3_yi56ni", "parent_id": "t3_yi56ni", "score": "4", "subreddit": "DnD", "subreddit_id": "t5_2r9ei"}, {"author": "Antaine1916", "body": "Thanks!", "created_utc": "1667206985.0", "edited": "False", "id": "iuh6z0h", "is_submitter": "True", "link_id": "t3_yhz5el", "parent_id": "t1_iughe31", "score": "2", "subreddit": "Watches", "subreddit_id": "t5_2qls5"}, {"author": "Antaine1916", "body": "While people fight over North Jersey/South Jersey and whether or not Central Jersey exists (it does, and it's the ***best*** Jersey...bounded by the Raritan River in the north and Toms River in the south), the traditional division was actually between East Jersey and West Jersey (originally a diagonal line from Little Egg Harbor up to West Point, although the northern terminus of the line was moved southward in at least three iterations). \n\n&#x200B;\n\nGoing back to the 1600s, two royal corporations were given charters to own all the unowned land and to sell it off to settlers. These commissions didn't go away after the US gained its independence. At least one of the two ***still*** controls land that has not yet been sold/auctioned off in the entire history of the state (predating the United States by a very long time).", "created_utc": "1667186389.0", "edited": "False", "id": "iuggyez", "is_submitter": "False", "link_id": "t3_yhxkeo", "parent_id": "t3_yhxkeo", "score": "6", "subreddit": "newjersey", "subreddit_id": "t5_2qhsu"}, {"author": "Antaine1916", "body": "1/3 of NJ is below the Mason-Dixon line, making it both a Northern and a Southern state.", "created_utc": "1667186113.0", "edited": "False", "id": "iuggfis", "is_submitter": "False", "link_id": "t3_yhxkeo", "parent_id": "t3_yhxkeo", "score": "2", "subreddit": "newjersey", "subreddit_id": "t5_2qhsu"}, {"author": "Antaine1916", "body": "I’ve always had a fascination with Dick Tracy (ever since the Warren Beatty movie came out when I was in 6th grade).  Tomorrow, we have permission to wear costumes to work. I’ll be going as Dick Tracy, but how could I be Dick Tracy without his trusty two-way wrist radio!?  I decided to make one out of a cheap quartz watch with two faces (for dual time zones). I used copper metal tape, aluminum metal tape, and a vibro-pen/engraver to make the texture for the speaker grille.  It’s a mostly cosmetic alteration to the case, but the watch itself functions to tell the time, and (IMHO), it’s a nicer rendition than any of the commercially available ones I’ve seen.", "created_utc": "1667185870.0", "edited": "False", "id": "iugfzaw", "is_submitter": "True", "link_id": "t3_yhz5el", "parent_id": "t3_yhz5el", "score": "2", "subreddit": "Watches", "subreddit_id": "t5_2qls5"}, {"author": "Antaine1916", "body": "I'm not sure what you mean by \"anonymous christianity.\"\n\nAll salvation comes from Christ (through his Church -- *extra ecclesiam, nulla salus*).\n\nBut a person, who through no fault of their own (or through *insufficient* fault of their own) who does not embrace Christ and become Christian, may yet be saved by the mercy of God applying that grace from Christ's crucifixion (and channeled into the world through his Church). Only God knows the heart, and so only God judges.\n\n​ Note *Catechism of the Catholic Church* 1260\n\n>Every man who is ignorant of the Gospel of Christ and of his Church, but seeks the truth and does the will of God in accordance with his understanding of it, can be saved. It may be supposed that such persons would have desired Baptism explicitly if they had known its necessity.\n\nIn correcting Fr. Leonard Feeney in 1949, the Holy Office wrote:\n\n>Therefore, that one may obtain eternal salvation, it is not always required that he be incorporated into the Church actually as a member, but it is necessary that at least he be united to her by desire and longing. However, this desire need not always be explicit, as it is in catechumens; but when a person is involved in invincible ignorance God accepts also an implicit desire, so called because it is included in that good disposition of soul whereby a person wishes his will to be conformed to the will of God.\n\n...which echoes Pope Pius IX, writing in 1854, in *Singulari Quadam:*\n\n>It must, of course, be held as a matter of faith that outside the apostolic Roman Church no one can be saved, that the Church is the only ark of salvation, and that whoever does not enter it will perish in the flood. On the other hand, it must likewise be held as certain that those who live in ignorance of the true religion, if such ignorance be invincible, are not subject to any guilt in this matter before the eyes of the Lord. But then, who would dare to set limits to this ignorance, taking into consideration the natural differences of people, lands, native talents, and so many other factors?\n\n&#x200B;\n\nThis concept is no novel idea, for even Thomas Aquinas noted that\n\n>If some were saved without receiving any revelation, they were not saved without faith in a Mediator, for, though they did not believe in Him explicitly, they did nevertheless have implicit faith through believing in Divine providence, since they believed that God would deliver humankind in whatever way was pleasing to Him.\n\nOf course, there have been much commentary on this question over the last two millennia, and many more sources could be provided, but it is late, and I think this is sufficient to explain the position I took in my comment.", "created_utc": "1667185623.0", "edited": "False", "id": "iugfig0", "is_submitter": "False", "link_id": "t3_yhwfbe", "parent_id": "t1_iugcwwy", "score": "8", "subreddit": "Catholicism", "subreddit_id": "t5_2qi4f"}, {"author": "Antaine1916", "body": "No. It's not a fetish object.\n\nSometimes I play a Rosary podcast if I'm going to say a Rosary while driving. The person reciting it on the podcast helps me count the \"beads\" when my hands are otherwise busy.\n\nPlus, I always have a mental intention of uniting my prayers to the prayers of the person saying the Rosary on the podcast and all the other people who prayed the Rosary while listening to the same recording.", "created_utc": "1667183861.0", "edited": "False", "id": "iugbxuu", "is_submitter": "False", "link_id": "t3_yhfzgi", "parent_id": "t3_yhfzgi", "score": "2", "subreddit": "Catholicism", "subreddit_id": "t5_2qi4f"}, {"author": "Antaine1916", "body": ">That doesn't mean you're a member, just a vistor\n\n...and, as long as you're respectful of the people in the parish (which it sounds like you intend to be), a *welcome* visitor.\n\nWe believe that God made and loves everybody, after all (yes, even lucifarian *you*).\n\nWho knows, maybe the community will rub off on you and/or the truth will sneak up on you.  ;-)\n\nRegardless, there's no better place for you to be than at Mass and involved with a Catholic community.", "created_utc": "1667183756.0", "edited": "False", "id": "iugbq0o", "is_submitter": "False", "link_id": "t3_yhy4xx", "parent_id": "t1_iugb31u", "score": "7", "subreddit": "Catholicism", "subreddit_id": "t5_2qi4f"}, {"author": "Antaine1916", "body": ">Washing your hands to show innocence was a well-known custom of the time.  \n\nWas it? I've never heard or read this before.\n\nSources?", "created_utc": "1667183008.0", "edited": "False", "id": "iuga4wc", "is_submitter": "False", "link_id": "t3_yh29ds", "parent_id": "t1_iudhrpn", "score": "1", "subreddit": "Catholicism", "subreddit_id": "t5_2qi4f"}, {"author": "Antaine1916", "body": "Yes, but it's also true that the Holy Spirit used his hard heart and sarcastic gesture to further cement the Crucifixion as the perfect sacrifice.  Since Pilate ordered it, he was basically like the high priest -- and the priest was required to ritually wash his hands before a valid sacrifice (this is why the Catholic priest still ritually washes his hands before the consecration).", "created_utc": "1667182932.0", "edited": "False", "id": "iug9z7h", "is_submitter": "False", "link_id": "t3_yh29ds", "parent_id": "t3_yh29ds", "score": "2", "subreddit": "Catholicism", "subreddit_id": "t5_2qi4f"}, {"author": "Antaine1916", "body": "God hears your prayers.\n\nGod is not obligated to say \"yes\" to your requests.\n\nIt's best to think of it this way: you're a two-year-old, and God is the parent.  God loves you and wants what's best for you (and he knows what's best for you better than you know it yourself). He may grant your requests sometimes, but other times, he has to say \"No\" for your own good (and even if you strongly disagree, you're wrong because there's stuff you don't know about the situation, the future, and your eternal soul).", "created_utc": "1667182786.0", "edited": "False", "id": "iug9ny2", "is_submitter": "False", "link_id": "t3_yhv3u4", "parent_id": "t3_yhv3u4", "score": "4", "subreddit": "Catholicism", "subreddit_id": "t5_2qi4f"}, {"author": "Antaine1916", "body": "Dear Europe,\n\n&#x200B;\n\nSuck it.\n\nSuck it hard.\n\n&#x200B;\n\nSincerely,\n\nElon Musk", "created_utc": "1667182516.0", "edited": "False", "id": "iug9436", "is_submitter": "False", "link_id": "t3_yhn6bq", "parent_id": "t3_yhn6bq", "score": "1", "subreddit": "Conservative", "subreddit_id": "t5_2qh6p"}, {"author": "Antaine1916", "body": ">if one can be saved without Christ then Christ has died in vain and you are preaching a false gospel… full stop.\n\nYes, everyone who is saved is saved by and through Christ, but it's possible for someone to be saved by and through Christ despite their ignorance / other mitigating factors like being born in a non-Christian or anti-Christian part of the world because of the mercy of God, who is not bound by anything.", "created_utc": "1667181200.0", "edited": "False", "id": "iug6c58", "is_submitter": "False", "link_id": "t3_yhwfbe", "parent_id": "t1_iug3w8e", "score": "19", "subreddit": "Catholicism", "subreddit_id": "t5_2qi4f"}, {"author": "Antaine1916", "body": "Pray for them every day. God determines who goes to heaven and who doesn't, and we cannot gainsay his decisions. We trust our loved ones to his immeasurable mercy, and implore him to collect them to himself in mercy and compassion (he made everyone, after all, and loves every one of his creations).", "created_utc": "1667180968.0", "edited": "False", "id": "iug5ulh", "is_submitter": "False", "link_id": "t3_yhwfbe", "parent_id": "t3_yhwfbe", "score": "12", "subreddit": "Catholicism", "subreddit_id": "t5_2qi4f"}, {"author": "Antaine1916", "body": "The answer is literally Marshall's book, *Infiltration*. \n\n&#x200B;\n\nI'm not saying I agree with every word of it, but it's well-sourced, and pretty much beyond dispute where it covers the post-WWII to present period (which answers your question in detail). \n\nIn short form: Aided by the communists, there was a large-scale infiltration of rebels and bad actors into the seminaries starting in the 1930s. By the early 1950s, those rebels and bad actors had become priests. By the 1960s, some of those priests had become bishops and gotten previously-suppressed heretics removed from the Index Librorum Prohibitiorum and actually started to be taught in seminaries (where some of them were, by then, teachers and administrators). By the late 60s and 1970s, a good number of those rebels had worked their way through the episcopate into the College of Cardinals. \n\nAll along the way, they were recruiting men to the seminaries, guiding the curriculum of the seminaries, ensuring that traditional-minded men were driven out of the seminaries, promoting those of like philosophical mind to themselves, and helping grease the wheels for their ideological progeny to become bishops and cardinals as they themselves retired or died.", "created_utc": "1667180003.0", "edited": "False", "id": "iug3t9y", "is_submitter": "False", "link_id": "t3_yhqx94", "parent_id": "t3_yhqx94", "score": "-2", "subreddit": "Catholicism", "subreddit_id": "t5_2qi4f"}, {"author": "Antaine1916", "body": "Get a lawyer and have a letter sent. Indicate you intend to press charges against the ASPCA for theft (given that they knew the cat was already owned and were surreptitiously trying to change the chip. Indicate that you also intend to go after the new family for receiving stolen property.\n\n&#x200B;\n\nI don't know if you can actually do any of that, but receiving the letter on lawyer's letterhead may scare them enough into moving heaven and earth to avoid having to find out.", "created_utc": "1667178816.0", "edited": "False", "id": "iug197v", "is_submitter": "False", "link_id": "t3_yho9h9", "parent_id": "t3_yho9h9", "score": "2", "subreddit": "newjersey", "subreddit_id": "t5_2qhsu"}, {"author": "Antaine1916", "body": "My family background is 1/2 Sicilian (Catholic), 1/4 Irish (Catholic), and 1/4 Carpatho-Rusyn (I *think* they were originally Orthodox, but they might have just been Eastern Rite Catholic at a time when the Western Rite Catholics in the US still treated them like Orthodox and made them feel like outsiders...but the Carpatho-Rusyn children all married Catholics and converted/joined the Latin Rite in the 40s and 50s, so that branch was effectively Catholic after that, even if they had originally been Orthodox). \n\n&#x200B;\n\nAll my great-grandparents arrived to the US from their respective home countries between 1910 and 1920.\n\nI grew up, and still live, in the Catholic-heavy Northeast (NY metro area). \n\nWe always practiced in my family. My mom's side (the Irish/Slavic side) never gave it up. My dad's side quit going to Mass when he was a boy, but he came back after he started to date my mom. My Italian grandparents eventually returned, and one of my dad's siblings (or at least her children) started going to Catholic church again, while his brother married a Lutheran, and his family went that way.", "created_utc": "1667164860.0", "edited": "False", "id": "iuf5hqo", "is_submitter": "False", "link_id": "t3_yh59be", "parent_id": "t3_yh59be", "score": "2", "subreddit": "Catholicism", "subreddit_id": "t5_2qi4f"}, {"author": "Antaine1916", "body": "NJ made such insurance illegal. They want you to have the maximum liability exposure.\n\nThe best you're going to do is something like US Lawshield, which basically puts a pool of 2A lawyers on retainer for you. You can get questions answered anytime you like, and you have an emergency number to reach one fast if you are involved in an incident.", "created_utc": "1667164472.0", "edited": "False", "id": "iuf4it4", "is_submitter": "False", "link_id": "t3_yhpc8y", "parent_id": "t3_yhpc8y", "score": "8", "subreddit": "NJGuns", "subreddit_id": "t5_2w5dz"}, {"author": "Antaine1916", "body": "Short answer: The protestants deleted those books because they contradicted their erroneous teachings. Luther tried to get rid of James, too, for that reason, but received too much pushback on eliminating a book of the New Testament. That didn't stop him from just straight-up altering Romans 3:28 to say what he wanted it to say.\n\nLonger answer: (all of the above, plus this) After the destruction of the Temple and the explosion of popularity the Jesus movement was getting within Judaism, the remaining Jewish authorities panicked and tried to figure out how to limit the reach of the Christian message. They settled on the standard of \"A book had to have been written in Hebrew first in order to be inspired.\" That eliminated all the New Testament (which had been written originally in Greek and Aramaic -- Hebrew had long before died out as a community language). It also meant eliminating seven books of the Old Testament (and portions of others). In Jesus's time, the Septuagint was the most popular and accepted version/canon of the Jewish scriptures, and this new standard altered that (giving us what is today called the Masoretic text). How do we know they had another standard? Apart from Jesus either directly quoting or making obvious references from the whole of the Septuagint canon, it is in one of the eliminated books that the entire basis of Hanukkah is found and in one of the other eliminated portions that the entire basis of the festival of Purim is found.   All of the best and most complete manuscripts (necessary for bible translations) were in the possession of the Church, so if they new protestants hoped to have any authority at all for their new, vernacular translations, they either needed access to the manuscripts (which they weren't going to get) or they needed to adopt a new standard that said such access wasn't necessary. Ironically, the new standard they adopted (basically taking the novel Jewish standard for what qualified as \"inspired\" text) was just participating in anti-Christian propaganda and politicking.", "created_utc": "1667159951.0", "edited": "False", "id": "iuet9vz", "is_submitter": "False", "link_id": "t3_yhek1j", "parent_id": "t3_yhek1j", "score": "6", "subreddit": "Catholicism", "subreddit_id": "t5_2qi4f"}, {"author": "Antaine1916", "body": ">Let him know that the TLM will eventually go the way of the dinosaurs and he’ll have no other choice but to get used to the NO Mass.\n\nOr maybe he sees that it's the other way around. NO attendance is falling off in droves, and, eventually, the only families producing priests (and from that pool, bishops, cardinals, and popes) will be those who tough it out while they TLM is being quasi-suppressed, so that by the time his children are adults, the NO-insisting crowd will have completed their apostasy from the Church and the TLM will be the ordinary Mass again.\n\nYeah, I don't think that'll happen, either, but it's far more likely than the scenario you paint, lol.", "created_utc": "1667159378.0", "edited": "False", "id": "iuersie", "is_submitter": "False", "link_id": "t3_yhfeuy", "parent_id": "t1_iuegpzp", "score": "-4", "subreddit": "Catholicism", "subreddit_id": "t5_2qi4f"}, {"author": "Antaine1916", "body": ">You can't keep doing a sin you've confessed. \n\nTrue, but what is at question here is precisely what part is sin and what part isn't. \n\n&#x200B;\n\n> If the person is still living as the opposite gender, they are still in a state of mortal sin.  \n\nNo, not necessarily. See my answer to you in the other thread.  Whether or not it's a sin depends on *what* they are doing and their *intent* in doing it.\n\n&#x200B;\n\n>You have to stop doing it to receive absolution.  \n\nAlso not true. We all struggle with relapsing into sins we've confessed. Besides, simply donning the clothes of another person and changing your name is not in and of itself sinful.\n\n&#x200B;\n\n>And it is our business because it's a public sin which causes public scandal.\n\nWhile this is true, it's also true that we have the barest of information about the situation. Who knows what the priest is working on with the person in terms of spiritual direction and whatnot?  Not you! Not me!  Just that person and the priest and God.  \n\nIf any of the story is true, and the priest is admitting the person to Communion (while supposedly knowing the whole story, so there's obviously some kind of ongoing relationship/counseling going on with that priest), it's obvious that the priest knows things about the person and the situation that you, me, and the OP don't know. This is precisely the sort of situation Jesus had in mind in Matthew 7:1-5.", "created_utc": "1667158957.0", "edited": "False", "id": "iueqp7g", "is_submitter": "False", "link_id": "t3_yhl2o3", "parent_id": "t1_iuei8ki", "score": "1", "subreddit": "Catholicism", "subreddit_id": "t5_2qi4f"}, {"author": "Antaine1916", "body": ">The person would still have to stop presenting as the opposite gender.\n\nNot necessarily. It would depend on *how* and *why* they were presenting that way. \n\nThey would need to lead a celibate life with a vocation as a faithful single person. They'd need to do no activism in favor of the trans/alphabet agenda.\n\nI remember seeing an interview with a man who had \"transitioned\" into a female identity in the 80s. Had all the surgeries, took all the drugs, etc. Everyone who knew this guy for 40 years (basically, everyone currently in his life) knew him by his female identity.  He regretted his transitioning and wished he had never done it. He said it failed to make him happy in the way he had been led to believe. But, at age 60-something, he said it didn't make sense for him to buy a new wardrobe, tell his workmates and friends to address him as a man, change all his legal documents, etc. He never \"married,\" didn't have any children, and had so butchered his body, it was just easier to finish out his life in the identity he had made for himself four decades earlier.   His only advocacy/activism related to alphabet things is to give the occasional interview where he talks about how transitioning isn't the answer. \n\nHonestly, there's nothing sinful about his way of life right now. He's just a guy with a lot of regrets and a mutilated body who walks around in women's clothes and a quasi-compelling reason for doing it.", "created_utc": "1667158465.0", "edited": "False", "id": "iuepg9g", "is_submitter": "False", "link_id": "t3_yhl2o3", "parent_id": "t1_iuemchl", "score": "3", "subreddit": "Catholicism", "subreddit_id": "t5_2qi4f"}, {"author": "Antaine1916", "body": "Unlikely, but it depends on the circumstances.\n\nIs the person engaging in sexual relations outside of marriage? Are they pursuing or playing at marriage under the guise of a pretended sex? Is the person someone who \"transitioned\" before having an awakening of faith but now has so mutilated their body and entrenched their new identity in their network of social and work related relationships that it just makes the most sense to continue on in a celibate, single vocation with the new name and dress?\n\nChanging your name and appearance isn't a sin.  Engaging in homosexual sexual relations ***is***. Committing fraud whereby a person might pretend to marriage with an impersonated gender ***is***.  Political activism that spreads and protects an ideology that causes confusion and facilitates anti-Catholic teachings and the mutilation of children ***is***.  Having done all the aforementioned things that *are* sins but having repented of them while remaining reluctant to reinvent one's identity a second time also does not constitute a state of mortal sin.\n\nI can hypothesize half a dozen scenarios wherein a person might have at one point \"transitioned\" and yet can still be sincerely embraced at the Communion rail not in a state of mortal sin without necessarily having to go back to their old legal name and style of dress.", "created_utc": "1667157965.0", "edited": "False", "id": "iueo6df", "is_submitter": "False", "link_id": "t3_yhl2o3", "parent_id": "t3_yhl2o3", "score": "2", "subreddit": "Catholicism", "subreddit_id": "t5_2qi4f"}, {"author": "Antaine1916", "body": "Meh. Unlike Col. Jessup, the Cardinals are right. It's the oomph behind the text/speech, not the whole rest of the movie that isn't in the meme.", "created_utc": "1667128337.0", "edited": "False", "id": "iucvoiq", "is_submitter": "True", "link_id": "t3_yh11va", "parent_id": "t1_iuc6u4p", "score": "13", "subreddit": "CatholicMemes", "subreddit_id": "t5_2wfd9"}, {"author": "Antaine1916", "body": "Unlike Col. Jessup, the Cardinals are *right*. It's more the oomph behind the text/speech and not the whole rest of the movie that isn't in the meme.", "created_utc": "1667128302.0", "edited": "False", "id": "iucvmxl", "is_submitter": "True", "link_id": "t3_yh11va", "parent_id": "t1_iubyhyw", "score": "10", "subreddit": "CatholicMemes", "subreddit_id": "t5_2wfd9"}, {"author": "Antaine1916", "body": "Yeah, but, unlike Col. Jessup, the Cardinals are *right*.  It's the oomph behind the text/speech, not the whole rest of the movie that isn't in the meme.", "created_utc": "1667128228.0", "edited": "False", "id": "iucvjln", "is_submitter": "True", "link_id": "t3_yh11va", "parent_id": "t1_iubsvtk", "score": "7", "subreddit": "CatholicMemes", "subreddit_id": "t5_2wfd9"}, {"author": "Antaine1916", "body": "\\[ostrich meme\\]\n\n\"Whatcha got there?\"\n\n\\[arm around cockroach\\] \"...an oven...\"", "created_utc": "1667093483.0", "edited": "False", "id": "iubi14s", "is_submitter": "False", "link_id": "t3_ygyako", "parent_id": "t3_ygyako", "score": "1", "subreddit": "whatsthisbug", "subreddit_id": "t5_2s3bw"}, {"author": "Antaine1916", "body": "Go to Walmart and get [pink Duct Tape](https://www.walmart.com/ip/Colored-Duct-Tape-hot-pink-1-88-in-x-20-yd-roll-pack-of-6/857912812?wmlspartner=wlpa&selectedSellerId=101097288&adid=22222222222258383473&wmlspartner=wmtlabs&wl0=e&wl1=s&wl2=c&wl3=74904315688334&wl4=pla-4578503928788579&wl5&wl6&wl7&wl10=Walmart&wl11=Online&wl12=857912812_10001116650&wl14=pink+duct+tape&veh=sem&msclkid=81bbf79ebbcd1aed2f9594c30a90c30e) (they make it in all colors). Put overlapping layers on the inside and then on the outside, too, instead of zipping it (i.e. run them longways up and down, along the opening for the zipper, overlapping like vinyl siding).  Should be \"good enough\" for an evening's party.", "created_utc": "1667084609.0", "edited": "False", "id": "iuazoxr", "is_submitter": "False", "link_id": "t3_yg96ye", "parent_id": "t3_yg96ye", "score": "2", "subreddit": "sewhelp", "subreddit_id": "t5_2srbo"}, {"author": "Antaine1916", "body": "The best argument against it is that it's impractical, causes rationing, and results in an enforced system of lower care for patients (which is degrading to the patient and an attack on their human dignity of both the most vulnerable patients like the elderly, as well as the taxpayer, who has the fruits of their labor sucked away and dumped into a system that is necessarily inefficient \\[as all government enterprises where a third party is inserted between the payer and the provider are\\] and sub-optimal \\[as all monopolies are\\]).\n\nThere's nothing about it *per se* that is against Catholic teaching, and the ostensible goal is laudable. The practical end, however, makes its promises *impossible* to deliver on and results in an *overall* situation that is worse than the *overall* situation in other alternatives.\n\nOf course, people will argue the criticisms or cherry-pick extreme and exceptional stories from other systems, but, *on the whole*, the one-size-fits-all, no-competition situation produces (and can be logically *expected* to produce) *worse* outcomes *on the whole.*", "created_utc": "1667084143.0", "edited": "1667084401.0", "id": "iuayoqc", "is_submitter": "False", "link_id": "t3_ygq4ay", "parent_id": "t3_ygq4ay", "score": "0", "subreddit": "Catholicism", "subreddit_id": "t5_2qi4f"}, {"author": "Antaine1916", "body": "The Molly Pitcher Inn in Red Bank is a nice choice.", "created_utc": "1667083226.0", "edited": "False", "id": "iuawqyt", "is_submitter": "False", "link_id": "t3_ygtist", "parent_id": "t3_ygtist", "score": "5", "subreddit": "newjersey", "subreddit_id": "t5_2qhsu"}, {"author": "Antaine1916", "body": "The best choice I know of would be Jack's Music in Red Bank.", "created_utc": "1667082000.0", "edited": "False", "id": "iuau5mq", "is_submitter": "False", "link_id": "t3_ygotvf", "parent_id": "t3_ygotvf", "score": "3", "subreddit": "newjersey", "subreddit_id": "t5_2qhsu"}, {"author": "Antaine1916", "body": ">In fact, for a long time, laity were discouraged from receiving from the chalice to combat a common false belief that you had to receive both.\n\nThis is not why the laity didn't receive the chalice for 1500+ years.\n\nIt's because only the priest's consecrated hands were allowed to touch the Eucharist *or even* the sacred vessels that themselves touch the Eucharist.\n\nThere's no way to have someone drink from a chalice without handing it to them to touch unless the priest would be trying to tip the chalice *for* them which is super awkward and makes the possibility of spillage of the Precious Blood so much more likely.\n\nThe same general rule applied to the Eastern Divine Liturgies. There, the people did receive the wine, but they didn't drink it. The bread is soaked in it and a wine-soaked bread morsel is fed to them by dropping it onto their tongue with a golden spoon (also only the priest to be touching any of that).", "created_utc": "1667009615.0", "edited": "False", "id": "iu78sol", "is_submitter": "False", "link_id": "t3_yfpv09", "parent_id": "t1_iu4mclo", "score": "1", "subreddit": "Catholicism", "subreddit_id": "t5_2qi4f"}, {"author": "Antaine1916", "body": "The woolmark was introduced in 1964. My guess is sometime between the mid-60s and the mid-70s. \n\nThat fits with my general guess about the style of the tags and the overall pattern.", "created_utc": "1667008631.0", "edited": "False", "id": "iu76tfg", "is_submitter": "False", "link_id": "t3_yg1v0q", "parent_id": "t3_yg1v0q", "score": "24", "subreddit": "VintageFashion", "subreddit_id": "t5_2t30a"}, {"author": "Antaine1916", "body": "Not the future, but actually almost 20 years old: they didn't make the spiders bigger, but they put the spider gene into goats who now produce the silk protein in their milk. They milk the goats and separate the protein and run it through a machine like the Play-Doh spaghetti maker. \n\nSo, yeah, not giant spiders but [spider goats](https://phys.org/news/2010-05-scientists-goats-spider-silk.html)!", "created_utc": "1667008066.0", "edited": "False", "id": "iu75ood", "is_submitter": "False", "link_id": "t3_yg3z6r", "parent_id": "t1_iu746po", "score": "1", "subreddit": "Damnthatsinteresting", "subreddit_id": "t5_2xxyj"}, {"author": "Antaine1916", "body": "> Personally I'm willing to lose access to guns as long as the potential attacker also doesn't have guns\n\nOkay, but that's the part that will never happen.\n\nIn the US, there are 330,000,000 people but 400,000,000 guns.\n\nThat means that there are more guns than people (and there always were, going all the way back to the 18th century).\n\nonly 300,000,000 of those 400,000,000 guns are legally possessed.\n\nThat means that even if you could wave a magic wand and demand that all guns be turned in for destruction, ***and*** that all the legal gun owners would actually do it (they wouldn't), there would still be more guns in the hands of the already-criminal than there are to supply all of the militaries of all the countries of the whole world many times over. (even in a fantasy hypothetical situation, the criminals will never turn in theirs)\n\nAlso, we have a practically open border to our south. They will still make guns and ammunition in other places in the world. We can't keep out illegal drugs and illegal human crossings now, so it's silly to think that the government would be able to keep out more illegal guns from being smuggled back into the country.\n\nSo the ***only*** thing you could possibly do with a ban and confiscation is to ensure that all of the people are disarmed, while all of the criminals have more weapons than all the armies of the world combined.\n\nGood job!", "created_utc": "1666948405.0", "edited": "False", "id": "iu3mwtj", "is_submitter": "False", "link_id": "t3_yez7xi", "parent_id": "t1_iu38w1y", "score": "2", "subreddit": "Firearms", "subreddit_id": "t5_2ryez"}, {"author": "Antaine1916", "body": "Thanks for the reply, but that's no really the question. I was wondering why they used so much more wood than was \"necessary\" (judging by how much wood people remove when they \"sporterize\" the same arms).", "created_utc": "1666743008.0", "edited": "False", "id": "itskzec", "is_submitter": "False", "link_id": "t3_ydizts", "parent_id": "t1_itsjqlo", "score": "-1", "subreddit": "Firearms", "subreddit_id": "t5_2ryez"}, {"author": "Antaine1916", "body": "the sks is ugly", "created_utc": "1666740781.0", "edited": "False", "id": "itsg39j", "is_submitter": "False", "link_id": "t3_yd9x9s", "parent_id": "t3_yd9x9s", "score": "0", "subreddit": "Firearms", "subreddit_id": "t5_2ryez"}, {"author": "Antaine1916", "body": "Yes, always.\n\nBest thing? Say a Divine Mercy Chaplet for him. It'll take 5 minutes, and you can count on your fingers or keep the Rosary in your pocket.", "created_utc": "1666738639.0", "edited": "False", "id": "itsbbpa", "is_submitter": "False", "link_id": "t3_yd5hm1", "parent_id": "t3_yd5hm1", "score": "3", "subreddit": "Catholicism", "subreddit_id": "t5_2qi4f"}, {"author": "Antaine1916", "body": ">How is it fair that an 8-year-old boy can mortally sin one time (possibly out of ignorance) and if he happens to die that moment, he is forever damned\n\nEasy answer: he can't.\n\nTo be a mortal sin, three characteristics must be satisfied:\n\n1 - it is a grave (serious) matter\n\n2 - the person doing it must be fully aware of the seriousness\n\n3 - the person must freely choose to do it anyway\n\n&#x200B;\n\nRemove any one of those three, and you're not dealing with a mortal sin anymore.  If the 8-year-old is ignorant about the outcome of the action or the seriousness of the act (I'm not sure which you're implying he's \"ignorant\" about), it's not a mortal sin.", "created_utc": "1666736246.0", "edited": "False", "id": "its5zxm", "is_submitter": "False", "link_id": "t3_yd8gfc", "parent_id": "t3_yd8gfc", "score": "3", "subreddit": "Catholicism", "subreddit_id": "t5_2qi4f"}, {"author": "Antaine1916", "body": "I use a bit of Gorilla Glue two stage epoxy. Mix up a bit, put a thin coat between the layers, clamp (gently) until the epoxy sets (I usually let it be overnight to be sure).", "created_utc": "1666736101.0", "edited": "False", "id": "its5o1b", "is_submitter": "False", "link_id": "t3_ycr6kc", "parent_id": "t3_ycr6kc", "score": "1", "subreddit": "watchrepair", "subreddit_id": "t5_2tqfw"}, {"author": "Antaine1916", "body": ">Why do the cops always show up looking and acting like thugs themselves?\n\nStudies have shown that by starting with maximum intimidation/aggression, the majority of are prevented from escalating to deadly force. You may have the opposite impression, since only the ones that do become videos that end up on the internet, but the idea is to so intimidate/frighten the suspect that they hesitate to even try anything funny, thus preventing the incidents from becoming physical/deadly.\n\nIt works far more often than it doesn't (and, again, on the internet, you only see the times it didn't work, and most of those suspects were probably going to try to fight/flee/shoot, even if the cops didn't try to appear intimidating).", "created_utc": "1666732474.0", "edited": "False", "id": "itrwz0g", "is_submitter": "False", "link_id": "t3_yd0d3p", "parent_id": "t1_itrq2kj", "score": "3", "subreddit": "TerrifyingAsFuck", "subreddit_id": "t5_31d92"}, {"author": "Antaine1916", "body": "Sunburn.\n\nSame thing happens to you if you stand out in the sun.", "created_utc": "1666648711.0", "edited": "False", "id": "itn923j", "is_submitter": "False", "link_id": "t3_ycb0gk", "parent_id": "t3_ycb0gk", "score": "1", "subreddit": "castiron", "subreddit_id": "t5_2s8x6"}, {"author": "Antaine1916", "body": "I would probably remain right-leaning.\n\nEven without abortion, the Left still endorses gender ideology, transing kids, tribalism/identity politics, and has generally ill-conceived/unworkable policies for foreign policy, economics, free speech, right to defense, border policy, anti-federalist policies, and environmental policy.", "created_utc": "1666648383.0", "edited": "False", "id": "itn8a4h", "is_submitter": "False", "link_id": "t3_ycls3i", "parent_id": "t3_ycls3i", "score": "8", "subreddit": "Catholicism", "subreddit_id": "t5_2qi4f"}, {"author": "Antaine1916", "body": "You can try giving him my stock explanation (below). I find it sometimes resonates with protestants.\n\nHowever, he seems to have deeply bought into anti-Catholic propaganda, and the best answer (if he persists) is that you'll need to drop the relationship.\n\n## --------------------------​\n\n​ Several things will be relevant here, and I'll only be able to scratch the surface in this format. \n\nFor starters, there's the difference between Latria (adoration/true worship) and Dulia (honor/veneration). That Protestants think the hyper-dulia we give to Mary is somehow a form of latria (or that dulia can become latria if you just have a ton of it) speaks more to the very watered-down concept of \"worship\" endemic to Protestantism.\n\nBecause Protestants have eschewed true worship (e.g. the Eucharist, the sacrifice of the altar, etc), what they think amounts to \"worship\" (i.e. latria) is really just dulia. They see similarities to their dulia in what the Catholics do with Mary and the saints, and so they accuse us of misplaced adoration, when really it's just that they have an impoverished sense of what true worship is. Latria and dulia are different in kind, and are not merely different degrees of the same thing, so no amount of dulia can ever add up to latria (just as God is different in kind from all created things; he's not just the biggest, most powerful thing in the universe). So what we give to Mary is dulia, never latria, as latria is given only to God. That situation is entirely right and proper.\n\nNow, the question is, why is Mary deserving of the dulia we give her. For starters, she is the new ark of the new covenant. Not only is she a role model for us all (\"behold, I am the handmaid of the Lord\"), but she carried the Living Word within her just as the ark carried the Word written on stone (and that was also given dulia -- the new covenant is not lesser than the old, so the new ark should be given as much and more). Part of Jesus's human nature was gotten from her, and all was permitted to proceed after her \"fiat\" opened the gate.\n\nYes, she deserves it.\n\nWhat about her intercessory role? Well, it's biblical.\n\nIn the ancient Jewish Davidic monarchy, the queen mother (with the title \"Gebira\") had a special place in the court. It was not the wife of the king who was special, but his mother. The queen mother sat at the right hand of the king, and she was an avenue for the commoners to petition the king through her intercession. The queen mother is mentioned in the Old Testament books of Kings when new kings' reigns are introduced. You can see one example of the scriptural basis for people using the queen mother's intercession to petition the king in 1 Kings 2:16-20:\n\n\"Now therefore I ask one petition of thee: turn not away my face. And she said to him: Say on. And he said: I pray thee speak to king Solomon (for he cannot deny thee any thing) to give me Abisag the Sunamitess to wife. And Bethsabee said: Well, I will speak for thee to the king. Then Bethsabee came to king Solomon, to speak to him for Adonias: and the king arose to meet her, and bowed to her, and sat down upon his throne: and a throne was set for the king's mother, and she sat on his right hand. And she said to him: I desire one small petition of thee, do not put me to confusion. And the king said to her: My mother, ask: for I must not turn away thy face.\"\n\nWe see Mary play precisely this kind of role in the wedding feast at Cana, where people have a problem and they go to Mary, who requests that Jesus do something about it. He fulfills her request (and at time when it seems he would not have done so had she, personally, not asked -- \"My hour is not yet come\").\n\nAs Jesus takes over the Davidic kingship, he takes over his court, and that earthly type (the court) has its counterpart in heaven (not that heaven is copying earth, but the earthly court and kingship of David was designed to be a reflection of the divine intention for the court of heaven, Gebira and all, for the old court and Gebira are not greater than the new).", "created_utc": "1666647644.0", "edited": "False", "id": "itn6iff", "is_submitter": "False", "link_id": "t3_ycennr", "parent_id": "t3_ycennr", "score": "1", "subreddit": "Catholicism", "subreddit_id": "t5_2qi4f"}, {"author": "Antaine1916", "body": "Not much. I think most people who would accept anti-gun opinions from Reddit already hold anti-gun opinions from other locations.", "created_utc": "1666647447.0", "edited": "False", "id": "itn618m", "is_submitter": "False", "link_id": "t3_ycaoww", "parent_id": "t3_ycaoww", "score": "2", "subreddit": "gunpolitics", "subreddit_id": "t5_2sumr"}, {"author": "Antaine1916", "body": "Not only is it irresponsible, but in my state, it's also a felony (I suppose unless the car is in the garage). We can only leave the house with it if we're going to a very limited number of places (like the range, gunsmith, or between properties we own or control) and provided it's unloaded, separate from ammunition, and locked inaccessible from the passenger compartment (glove box and console don't count and are specifically excluded as legal options).\n\nWe just now have a concealed carry option, but there are so many restrictions, there's basically nowhere to bring it, and leaving it in your car isn't \"concealed carrying\" so is probably a violation even if you have a CC permit.", "created_utc": "1666646616.0", "edited": "False", "id": "itn3zeo", "is_submitter": "False", "link_id": "t3_ycd2k5", "parent_id": "t3_ycd2k5", "score": "2", "subreddit": "Firearms", "subreddit_id": "t5_2ryez"}, {"author": "Antaine1916", "body": "This is also taking it a bit far.  We do not have non-ensouled people now, so that's not even a category we think about, but in ancient times, that may well have been the case, and they would not necessarily have been \"beasts.\" \n\nYou seem to be making the assumption that all creatures without a rational soul *necessarily* are \"beasts,\" and this is not *necessarily* the case at all. \n\nYes, *today*,  all creatures without rational souls certainly fall into the category of \"beasts,\" but that is because hominids without rational souls are extinct. There was a time when they weren't, though. It is not at all unreasonable to posit that they represented a *third* category between \"men\" and \"beasts\" and were still \"people,\" and from them came the wives of Seth and Cain and perhaps Abel.", "created_utc": "1666523413.0", "edited": "False", "id": "itg08ei", "is_submitter": "False", "link_id": "t3_yb4joy", "parent_id": "t1_iteo92b", "score": "2", "subreddit": "Catholicism", "subreddit_id": "t5_2qi4f"}, {"author": "Antaine1916", "body": ">Why could God not have created others after Adam and Eve? \n\nEasy answer: because he then would have been creating humans who had nothing to do with Adam and Eve *in a fallen state*. That would be a supreme injustice, and a statement that God created things that were not \"good\" (i.e. already-fallen beings) where Genesis is so careful to show us that everything God created was \"good.\"", "created_utc": "1666523108.0", "edited": "False", "id": "itfztvi", "is_submitter": "False", "link_id": "t3_yb4joy", "parent_id": "t1_itent7o", "score": "4", "subreddit": "Catholicism", "subreddit_id": "t5_2qi4f"}, {"author": "Antaine1916", "body": ">All the other humans, except for Noah’s family descended from Adam and Eve, were later wiped out.\n\nBut then that would mean that before Noah there were fallen humans who were not descended from Adam and Eve but somehow inherited their original sin?  Doesn't hold up.", "created_utc": "1666522978.0", "edited": "False", "id": "itfznch", "is_submitter": "False", "link_id": "t3_yb4joy", "parent_id": "t1_iteq3bz", "score": "1", "subreddit": "Catholicism", "subreddit_id": "t5_2qi4f"}, {"author": "Antaine1916", "body": "Is that a Scold-i-locks action figure?", "created_utc": "1666489991.0", "edited": "False", "id": "iteo904", "is_submitter": "False", "link_id": "t3_yb2zvs", "parent_id": "t3_yb2zvs", "score": "25", "subreddit": "ConservativeMemes", "subreddit_id": "t5_2uc6m"}, {"author": "Antaine1916", "body": "Taking it as a thought experiment, it would have been very possible that Adam and Eve's genes would have been sufficiently structured to have kept off the worst effects of incest for the longest time. God also influences which sperm succeeds in fertilizing an egg, so God could also have deliberately intervened to maximize genetic diversity among their offspring and their offsprings offspring.", "created_utc": "1666489730.0", "edited": "False", "id": "itenq0t", "is_submitter": "False", "link_id": "t3_yb4joy", "parent_id": "t1_itemgiu", "score": "6", "subreddit": "Catholicism", "subreddit_id": "t5_2qi4f"}, {"author": "Antaine1916", "body": "...but either the sons of Adam and Eve had children with Adam and Eve's daughters (incest) or God made other humans later, in which case Adam and Eve are not the First Parents of us all (and what, then, are the implications for the Fall?  God would have had to have created other humans in an unfallen state who *also* fell or he created more humans in a fallen state -- i.e. not \"good\" as was all the rest of his original creation).\n\nWhile positing that we are all descended from incest opens a can of worms, arguing that we *didn't* opens multiple cans of more theologically problematic worms.\n\n&#x200B;\n\n\\*Of course, with the exception of there being \"people\" who weren't \"men\" (i.e. humanoids who weren't ensouled...that God produced homo sapiens through gradual evolution and then bestowed souls upon one couple when he breathed his spirit into them).", "created_utc": "1666489583.0", "edited": "1666489850.0", "id": "itenf77", "is_submitter": "False", "link_id": "t3_yb4joy", "parent_id": "t1_itemk63", "score": "2", "subreddit": "Catholicism", "subreddit_id": "t5_2qi4f"}, {"author": "Antaine1916", "body": "They are slightly less egregious heresies than the other ones?\n\n&#x200B;\n\nSeriously. If you put a drop of wine in a gallon of sewage, you have a gallon of sewage. If you put a drop of sewage in a gallon of wine, you have a gallon of sewage.", "created_utc": "1666478190.0", "edited": "False", "id": "itdzco7", "is_submitter": "False", "link_id": "t3_yb0aqf", "parent_id": "t3_yb0aqf", "score": "13", "subreddit": "Catholicism", "subreddit_id": "t5_2qi4f"}, {"author": "Antaine1916", "body": "\"One of those malfunctions where my hand went in front of the barrel.\"\n\nI think I.T. guys call that a PEBKAC error (\"Problem Exists Between Keyboard And Chair\").", "created_utc": "1666478046.0", "edited": "False", "id": "itdz12q", "is_submitter": "False", "link_id": "t3_yasy4y", "parent_id": "t3_yasy4y", "score": "12", "subreddit": "Firearms", "subreddit_id": "t5_2ryez"}, {"author": "Antaine1916", "body": "You know you can just move that little lever to turn them off, right?", "created_utc": "1666477798.0", "edited": "False", "id": "itdyhqk", "is_submitter": "False", "link_id": "t3_yaytgr", "parent_id": "t3_yaytgr", "score": "8", "subreddit": "Firearms", "subreddit_id": "t5_2ryez"}, {"author": "Antaine1916", "body": ">If we had kids could they be consider jewish by birth but Christian by faith if that makes sense.\n\nI mean, yes, because Jewishness is a cultural thing as well as a religious thing. That said, it will be hard to do justice to both while giving a coherent foundation to your children.\n\nChristianity teaches that Jesus was the messiah, the incarnate God. Judaism denies that wholesale.\n\nThe best way, as far as I know, is to take Roy Schumann's approach (listen to his lectures and episodes online) that states that Catholicism is \"completed Judaism.\"  Essentially, he holds that the Catholic Mass is the extension/completion/perfection of the Temple sacrifices and that Catholicism is the extension/completion/perfection of first century Judaism -- not that Catholicism *replaced* Judaism after the first century, but that Catholicism *is* the most authentic and continuous expression of Judaism, flowing directly from first century Judaism unbroken.  After the dual events of Jesus's incarnation and the destruction of the Temple within a single generation, Judaism \"forked.\" Half of Judaism shifted to a protestant-style focus on Bible study and kept the label \"Judaism,\" and the other half continued the Temple sacrifice system under an expanded covenant with a perfect victim and became known as the Catholic Church.", "created_utc": "1666474765.0", "edited": "False", "id": "itdrsad", "is_submitter": "False", "link_id": "t3_yafcqq", "parent_id": "t3_yafcqq", "score": "1", "subreddit": "Catholicism", "subreddit_id": "t5_2qi4f"}, {"author": "Antaine1916", "body": "the ones they make over at [Dolce Vita](http://www.dolcevitaspizzanj.com/) on Hwy 34 in Old Bridge are great.", "created_utc": "1666474052.0", "edited": "False", "id": "itdq5at", "is_submitter": "False", "link_id": "t3_yavakg", "parent_id": "t3_yavakg", "score": "1", "subreddit": "newjersey", "subreddit_id": "t5_2qhsu"}, {"author": "Antaine1916", "body": "He's the goodest good boy!", "created_utc": "1666473801.0", "edited": "False", "id": "itdpkr0", "is_submitter": "False", "link_id": "t3_yaraqr", "parent_id": "t3_yaraqr", "score": "1", "subreddit": "Damnthatsinteresting", "subreddit_id": "t5_2xxyj"}, {"author": "Antaine1916", "body": "My grandfather's neighbor had them. They infested the tree in the front yard. Pest control said the tree had to go.  The neighbor wouldn't take the tree down, but the infestation kept growing and growing.  The boxelders found their way into the house the car, etc. \n\nMy grandfather would go out with a propane torch when the neighbor wasn't around and as fast as he burned them, they just came pouring out of the tree.\n\nThe only way it got solved was when my grandfather brought a sledgehammer and large copper bolt with him taking out the garbage one night and drove it into the base of the tree. Once the copper killed half the tree, it ***had*** to come down, and thus ended the Great Boxelder Saga of 1986.\n\nI joke about the name, but that's how it went down, and they were such a nuisance that year.\n\nThey're pests. Don't let them get a foothold.", "created_utc": "1666471192.0", "edited": "False", "id": "itdji0h", "is_submitter": "False", "link_id": "t3_yapzwd", "parent_id": "t1_itctsmb", "score": "0", "subreddit": "newjersey", "subreddit_id": "t5_2qhsu"}, {"author": "Antaine1916", "body": "replaced by the Javits Center?", "created_utc": "1666469314.0", "edited": "False", "id": "itdezwq", "is_submitter": "False", "link_id": "t3_yawbyz", "parent_id": "t3_yawbyz", "score": "17", "subreddit": "TheWayWeWere", "subreddit_id": "t5_2tp0t"}, {"author": "Antaine1916", "body": "1 Peter 3:21 + Matthew 28:19 + John 3:5", "created_utc": "1666463146.0", "edited": "False", "id": "itd06k5", "is_submitter": "False", "link_id": "t3_yarowb", "parent_id": "t3_yarowb", "score": "2", "subreddit": "Catholicism", "subreddit_id": "t5_2qi4f"}, {"author": "Antaine1916", "body": "No.", "created_utc": "1666458235.0", "edited": "False", "id": "itco3ww", "is_submitter": "False", "link_id": "t3_yaoidy", "parent_id": "t3_yaoidy", "score": "2", "subreddit": "Catholicism", "subreddit_id": "t5_2qi4f"}, {"author": "Antaine1916", "body": "It's a wheat-flour mixture that is baked. Thus, it is \"bread\" by its most basic definition. That's all it needs to be.\n\nIn fact, by making the recipe as simple as possible, it is easiest to make it perfect matter and keep out contaminants and imperfections. It is the matter for the sacrifice, after all, so the simpler the better.\n\nAdd to that that it stays fresher longer than regular bread, doesn't crumble, etc, and the benefits become even more clear.", "created_utc": "1666457933.0", "edited": "False", "id": "itcnd6w", "is_submitter": "False", "link_id": "t3_yap5v8", "parent_id": "t3_yap5v8", "score": "2", "subreddit": "Catholicism", "subreddit_id": "t5_2qi4f"}, {"author": "Antaine1916", "body": "Not that it teaches you everything you'll ever need to know, but I highly recommend starting with Bishop Barron's *Catholicism* series from a few years ago. I think it has 10 episodes, and it's a really great beginner's explanation of the faith.", "created_utc": "1666457113.0", "edited": "False", "id": "itcldox", "is_submitter": "False", "link_id": "t3_yanygi", "parent_id": "t3_yanygi", "score": "1", "subreddit": "Catholicism", "subreddit_id": "t5_2qi4f"}, {"author": "Antaine1916", "body": "Get a hold of Bishop Barrons old *Catholicism* series (10 episodes) and watch them with him over time. He does a great job of explaining the faith, from soup to nuts, designed to reach outsiders with little to no previous knowledge.", "created_utc": "1666455014.0", "edited": "False", "id": "itcgdpn", "is_submitter": "False", "link_id": "t3_ya456c", "parent_id": "t3_ya456c", "score": "1", "subreddit": "Catholicism", "subreddit_id": "t5_2qi4f"}, {"author": "Antaine1916", "body": "I figured it was probably a pin, since you knew to look or a button. I think Westclox is one of those brands that were considered \"disposable\" and not designed to be serviced. My attitude is that anything that was put together the first time is capable of being taken apart and put back together a second time, but it may not be easy to do. Good luck!", "created_utc": "1666454549.0", "edited": "False", "id": "itcfamw", "is_submitter": "False", "link_id": "t3_yaorqa", "parent_id": "t1_itc3vrs", "score": "1", "subreddit": "watchrepair", "subreddit_id": "t5_2tqfw"}, {"author": "Antaine1916", "body": "Boxelder.\n\nDestroy on sight.", "created_utc": "1666451998.0", "edited": "False", "id": "itc9b67", "is_submitter": "False", "link_id": "t3_yapzwd", "parent_id": "t3_yapzwd", "score": "-12", "subreddit": "newjersey", "subreddit_id": "t5_2qhsu"}, {"author": "Antaine1916", "body": ">That's exactly the problem. She watches the worst of the trad YouTubers. Doom and gloom guys, Pope Francis in an apostate, Vatican II evil type stuff.\n\nNice self-righteous, un-Christian calumny you've go there. OP said nothing about *what* she watches, and yet you immediately jump to these assumptions and libel.  Way to be!", "created_utc": "1666451968.0", "edited": "False", "id": "itc98q3", "is_submitter": "False", "link_id": "t3_yaa1ek", "parent_id": "t1_itbzq88", "score": "0", "subreddit": "Catholicism", "subreddit_id": "t5_2qi4f"}, {"author": "Antaine1916", "body": ">We have to peel off a lot of Ds.\n\nNot necessarily. Remember that not every registered D is going to bother voting, especially with the current state of things and reputation of the party.\n\nMany are likely to just sit home and not bother.", "created_utc": "1666451284.0", "edited": "False", "id": "itc7ott", "is_submitter": "False", "link_id": "t3_yan32i", "parent_id": "t1_itbzntg", "score": "3", "subreddit": "NJGuns", "subreddit_id": "t5_2w5dz"}, {"author": "Antaine1916", "body": ">Atleast the repubs support our right to carry\n\nThey do one more thing, too: every republican in office is warming a seat that would otherwise be occupied by a 2A-hostile, gun-grabbing, lunatic dem.", "created_utc": "1666451210.0", "edited": "False", "id": "itc7ivn", "is_submitter": "False", "link_id": "t3_yan32i", "parent_id": "t1_itc1qo6", "score": "8", "subreddit": "NJGuns", "subreddit_id": "t5_2w5dz"}, {"author": "Antaine1916", "body": ">Agree to disagree.\n\nYeah, that works as long as there's no evidence or a half century of actual results with which to judge the claim.\n\nThere's no serious question, at this point, that what I wrote is factually accurate.", "created_utc": "1666451093.0", "edited": "False", "id": "itc79po", "is_submitter": "False", "link_id": "t3_y7qazs", "parent_id": "t1_it38lby", "score": "1", "subreddit": "TraditionalCatholics", "subreddit_id": "t5_35wly"}, {"author": "Antaine1916", "body": "My grandmother got hit from behind like that. The next day, she decided to call the insurance, even though she wasn't filing a claim (she had basically no damage). The operator told her it was good that she called to officially give them her story, because after 24 hours, they would have to have automatically accepted the other guy's story as true. It turned out that he *did* call and claimed it was all her fault, so she was hours away from getting dinged with the blame and expense of his damage.\n\nThe difference in her case is that they hadn't gotten the police involved, so there was no police report.\n\nI'm pretty sure that the cops had to get the information from both of you, and that it's part of the official record now. The company will most likely go with whatever the cops' report says.", "created_utc": "1666450959.0", "edited": "False", "id": "itc6yr4", "is_submitter": "False", "link_id": "t3_yal7k4", "parent_id": "t3_yal7k4", "score": "1", "subreddit": "newjersey", "subreddit_id": "t5_2qhsu"}, {"author": "Antaine1916", "body": "If you're more attached to your damned relatives than to God, then you probably deserve to join them.", "created_utc": "1666450541.0", "edited": "False", "id": "itc610h", "is_submitter": "False", "link_id": "t3_yaf2j4", "parent_id": "t3_yaf2j4", "score": "1", "subreddit": "Catholicism", "subreddit_id": "t5_2qi4f"}, {"author": "Antaine1916", "body": ">Can't believe these jerks just keep complying with the law.\n\n&#x200B;\n\nBelieve it, and know that it will continue.\n\nThe vast, vast majority of people (gun makers and gun owners) will comply, all the way.\n\nThose of you waiting for a \"mass noncompliance\" movement, well, it's never going to happen.  We *will* end up disarmed as a population if that's the plan.\n\nEvery person faced with making a noncompliance decision makes the calculation (rightly) as if they stand alone. Is keeping a 10+ mag worth the destruction of your entire life? Most people will say \"no,\" and they will grumble, but comply.   If they get busted for something stupid, there will be not one of the \"iTz cALLed 'cOnSeaLed' cArRy fOr a rEeZoN\" or \"sHaLL nOt B iFrEeNjD\" redditors standing beside them in prison or emptying their bank accounts to take on the state that's about to permanently wreck their lives, livelihood, and families. I doubt if even the organizations like the GOA would take such a clear-cut case.\n\nIt strikes me that most of the \"free men don't ask permission,\" and \"mass noncompliance\" advocates are people who live in states that are already pretty much firearms friendly and/or rural enough that they can easily get away with it.  In the really stupid states (like mine), try \"noncompliance\" on concealed carry and you stand an excellent chance of being caught within an hour (if not minutes) of leaving your house. Try \"noncompliance\" with stuff like magazine sizes or banned firearms, and you will have successfully retained a device you can't take anywhere or do anything with -- maybe all those 10+ mags in your closet or the Steyr AUG will come in handy if SHTF happens, but probably not as much as you think they will, and all it takes is a kitchen fire or break-in to end up bringing your possession of them to the attention of the cops, and now your life is over.\n\nThe vast majority of people will make a good faith attempt to comply with the law, no matter how onerous, unjust, or unconstitutional. Thus, our only practical path forward is to work on striking down/changing the laws, not waiting for massive quantities of law-abiding gun owners to willingly start dangling felony charges over their heads.", "created_utc": "1666450333.0", "edited": "False", "id": "itc5k5w", "is_submitter": "False", "link_id": "t3_y9wwin", "parent_id": "t3_y9wwin", "score": "1", "subreddit": "gunpolitics", "subreddit_id": "t5_2sumr"}, {"author": "Antaine1916", "body": "Is [this](https://imgur.com/F3yobLk) not the button? If it's just a pin, it appears to be held in place by the screw just to the south of it and the little metal piece between the two, so maybe by removing that, you can remove the pin?\n\nIt's hard to see for sure from the photo you have.", "created_utc": "1666449196.0", "edited": "False", "id": "itc31vb", "is_submitter": "False", "link_id": "t3_yaorqa", "parent_id": "t3_yaorqa", "score": "3", "subreddit": "watchrepair", "subreddit_id": "t5_2tqfw"}, {"author": "Antaine1916", "body": "Loss or reason isn't necessarily getting blotto and having a *complete* loss of your mind.\n\nA better question is: at what point is the impairment making it more likely that you will make bad decisions in the moral realm?\n\nThe latter can be significantly short of the former. Willfully putting yourself in that state is itself a sin, despite (or maybe because of) the fact that it may mitigate your culpability in the sins you end up committing in your drunken state that you wouldn't have otherwise willfully done.", "created_utc": "1666448948.0", "edited": "False", "id": "itc2hu0", "is_submitter": "False", "link_id": "t3_yaoutk", "parent_id": "t3_yaoutk", "score": "5", "subreddit": "Catholicism", "subreddit_id": "t5_2qi4f"}]