[{"author": "antoine_vicheff", "body": "Ironic, when I asked on discord almost everyone said Kurdish", "created_utc": "1666717284.0", "edited": "False", "id": "itqt82v", "is_submitter": "True", "link_id": "t3_yd8ovi", "parent_id": "t1_itqn8xz", "score": "1", "subreddit": "AskMiddleEast", "subreddit_id": "t5_vkfjx"}, {"author": "antoine_vicheff", "body": "He can try Busuu, it’s not (at least on ios) allowing you to do each lesson by watching a 15 second ad", "created_utc": "1666607024.0", "edited": "False", "id": "itklvcg", "is_submitter": "False", "link_id": "t3_yblxgw", "parent_id": "t1_ith24aj", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "antoine_vicheff", "body": "I’m answering this question for the last time…so, every country has its own nationalists, patriots and chauvinist people. It’s normal. Several times Macedonia brought up lies about historical facts such as creation of Cyrillic, Alexander Makedonski etc etc. more sensitive people got triggered and ever since, started meaningless debates that led to nothing. Desdly honest Bulgarian here, I do not CARE about this republic, it’s none of my concern. I don’t want any association with them either. They are they, we are we. I often get questions like “as a Bulgarian what do you think about Macedonia” answer is:\nNOTHING, NADA, ZERO, NULLA. Not even a little bit. This ridiculous stereotype that all Bulgarians care about that republic needs to end once and for all :)", "created_utc": "1660569514.0", "edited": "False", "id": "ikdnt3b", "is_submitter": "False", "link_id": "t3_ux15v9", "parent_id": "t3_ux15v9", "score": "1", "subreddit": "bulgaria", "subreddit_id": "t5_2qhx7"}, {"author": "antoine_vicheff", "body": "Hey! Sorry to bother you. Can you suggest me a place where I would find native speakers of Tajiki? Like Telegram, Discord sort of environment?", "created_utc": "1658278049.0", "edited": "False", "id": "igusv0g", "is_submitter": "False", "link_id": "t3_w1i58v", "parent_id": "t1_igmfyqf", "score": "2", "subreddit": "Tajikistan", "subreddit_id": "t5_2sayl"}, {"author": "antoine_vicheff", "body": "I don’t understand all people defending Duolingo tbh. It’s such an useless app that helps you learn the basics and nothing else. I use a combination of anki and a pdf textbook, it works flawlessly every time and best of all I don’t pay any money", "created_utc": "1657880597.0", "edited": "False", "id": "ig8vvlu", "is_submitter": "False", "link_id": "t3_vz2zc5", "parent_id": "t1_ig78nm0", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "antoine_vicheff", "body": "Благодаря много, бро!", "created_utc": "1656867939.0", "edited": "False", "id": "ieptxvc", "is_submitter": "True", "link_id": "t3_vq5ztm", "parent_id": "t1_ieohfjk", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "antoine_vicheff", "body": "I actually use my Discord only for the purpose of learning/practicing languages. So, no, I haven’t looked anywhere else yet.\nIt honestly came up as a big surprise to not find a dedicated server for a language with nearly 30m speakers. I’m not exactly sure why that happens but I do have my suspicions.\nAnyway, finding a tutor isn’t my goal, I usually befriend a nice person I chat with in the language servers I’m part of, ask him/her several introductory questions, then we start exchanging opinions on various topics and by the end of the first hour we are buddies if nothing goes wrong ofc. \nThe language isn’t difficult for me but it seems like natives do not “inhabit” Discord. \nI need a companion that is willing to correct my mistakes, to chat with me. \nHow do you think I mastered English? By reading Harry Potter and Sherlock Holmes? Nope. I had tons of interaction with natives, I gradually adapted to their ways of expression. I watched all sorts of media without subtitles just to train my ears into comprehending speech in a foreign language. \nI have already given up on finding what I need on Discord. It’s completely pointless. Reddit is my last resort. At this point, I’m just hoping for a miracle to happen or I may shut down the learning process cuz man… it’s a torture", "created_utc": "1656812947.0", "edited": "1656813547.0", "id": "ienccqj", "is_submitter": "True", "link_id": "t3_vq5ztm", "parent_id": "t1_ienabue", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "antoine_vicheff", "body": "Допустим что люди не понравились мой ответ хД", "created_utc": "1656809898.0", "edited": "False", "id": "ien6lvh", "is_submitter": "False", "link_id": "t3_vovm4w", "parent_id": "t1_ieg9hlj", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "antoine_vicheff", "body": "Listen my man, my point wasn’t to offend you nor to show off as some sort of pro-Russian type of person (I’m not). Based on my numerous conversations with native Ukrainians I came to the conclusion that the term Ukrainian was more or less coined considerably when you think about Kievan RUS. Not Kievan Ukrayina, but Kievan RUS. If you claim that state was yours you automatically count yourself as RUS people hence “people that used to be Russians or related to Russians” \nPutting nationalism and trouble history aside you guys are extremely similar and your language would have been 95% the same if it wasn’t for the Poles ruling over the “as some call it” TRUE Ukraine (Galitsiya). Anything besides the common history of both languages and post Russian imperialism is biased, double sided and people will be always entitled to their opinion. I have no intention of making enemies with Ukrainians simply becuz I adore your language but I can’t help but experience disappointment everytime I chat with some eastern or central Ukrainian dude on Discord and he starts either mixing up Russian with Ukrainian or just speak Russian REGARDLESS IF I TYPE IN UKRAINIAN. And this is when I ask those people “okay, you are Ukrainian, why do you not speak Ukrainian”\nShortest response possible:\n“**What makes you think I am obligated to speak Taras’ mova? Who told you Ukrainians associated with that language? We have other ways of telling ourselves apart from Russians and fyi language is NOT a primal difference**\nHe was so angry at me, it was unreal. I literally offended him for saying that Ukrainians should speak Ukrainian. Basically it’s the same language as Russian but due to different history diverged significantly from Russian and due to political and historical events the two languages are divided. \nHE SAID IT NOT ME. \n\nI wish one day you аll finally adapt to the chudova Ukrayinska mova\n\n**Захищайте і понад усе розмовляйте своєю мовою! Щасти!!** \n\nВітання зі Слов'янської Болгарії! 🇧🇬💙🇺🇦", "created_utc": "1656677829.0", "edited": "False", "id": "iefykmd", "is_submitter": "False", "link_id": "t3_vovm4w", "parent_id": "t1_iefrzri", "score": "-5", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "antoine_vicheff", "body": "FLUENT??? No, he isn’t. He’s certainly not fluent in Ukrainian. If he was, he wouldn’t respond to Ukrainian interviews in *Russian*….  You have to understand that for Ukrainians it’s not mandatory to speak Ukrainian and the majority of population is Russian speaking for centuries. Everyone knows Russian, not everyone knows Ukrainian. In fact, only the parts western of Kyiv are Ukrainophone.  I really believe we should avoid this topic\nJust a heads up, do not believe wikipedia or what the anti-Russian government claims, Russian is the dominant and more prestigious language", "created_utc": "1656668268.0", "edited": "False", "id": "iefksgd", "is_submitter": "False", "link_id": "t3_vovm4w", "parent_id": "t1_iefhnnn", "score": "-5", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "antoine_vicheff", "body": "It’s not just one! Depending on the lang it’s learning the correct pronunciation, more specifically - “imitating the accent like natives”. \n\nAnother issue - actually understanding natives when they talk. That’s fine though, it seems like our ears need a long time to adapt. FOR ME IT’S WAY TOO LONG. \n\nLast but not least - creating sentences that make sense. See, just becuz you can say something like “Oh, how SWEET (that’s flavor)! He came in CRASHING the party”\n“This game is FIRE” in English doesn’t mean if you say it in (for example) Turkish people will get it….\nIn my native we would say “I put in/insert/implement EMOTION” when you try to explain you did something passionately BUT it makes… no sense in other langs!  \nIt’s basically the “assumption that your lang has those ways of expression then the TL also has them” (nope)\nDirect/literal translations are killing me (also something you can’t say in other langs becuz its sounds too literal)", "created_utc": "1656498019.0", "edited": "False", "id": "ie62zmt", "is_submitter": "False", "link_id": "t3_vn9vsb", "parent_id": "t3_vn9vsb", "score": "16", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "antoine_vicheff", "body": "Uzbek, Albanian and Azeri. I’m fascinated by all 3, I love how they sound etc", "created_utc": "1656130669.0", "edited": "False", "id": "idnfz9t", "is_submitter": "False", "link_id": "t3_vgexiv", "parent_id": "t3_vgexiv", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "antoine_vicheff", "body": "Do I feel despair? Often, yes :) \nUnlike “polyglot speaking 40 languages” or “anime girl speaking fluent Korean, Japanese and Mandarin” I actually want to learn around 25 langs (not all to a C1 level though) becuz I enjoy the process, I meet new people and I find me some cool music + visiting the country where the language is spoken at becomes MUCH easier. Being a polyglot can hardly be called easy/affordable. It takes A LOT of time, dedication AND determination. It’s almost like a sport (For me it’s a passion and a hobby) \nLangs don’t refuse to be mastered , they just sometimes require a specific approach :)", "created_utc": "1655592100.0", "edited": "False", "id": "icvs5pi", "is_submitter": "False", "link_id": "t3_vfb6b4", "parent_id": "t3_vfb6b4", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "antoine_vicheff", "body": "Does that mean I shouldn’t expect any discounts in the following 2-3 months?", "created_utc": "1654779678.0", "edited": "False", "id": "ibq6jzp", "is_submitter": "False", "link_id": "t3_u6y0vv", "parent_id": "t1_i5bcqe6", "score": "1", "subreddit": "granturismo", "subreddit_id": "t5_2s4f7"}, {"author": "antoine_vicheff", "body": "Mandarin. I’m not into tonal languages since I already have speech issues and I would struggle to keep the tones right all the time. Besides I don’t like the way it sounds, the Kanji is WAY too difficult and I’d rather stay away from a language that can’t impress me in any category whatsoever.", "created_utc": "1653101269.0", "edited": "False", "id": "i9eols6", "is_submitter": "False", "link_id": "t3_uuctrp", "parent_id": "t3_uuctrp", "score": "5", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "antoine_vicheff", "body": "Mate, please keep in mind that Russian was *imposed* on Central Asians during the Soviet Union. It was really considered as the superior language while everything else was more or less called rural or just not appropriate (for example if you were looking for a job)…speaking Russian since your teenage years, exposure to Russian culture etc can turn you into.. Russian! That was the entire purpose of the Soviet Union “nationalism” policy. To turn the peasant nations into Russians by eradicating their language, culture.. “Russian - you are an expat, Central Asian - you are a villager”. I have Russians friends I know their mindset. Don’t quote me on any of this.", "created_utc": "1648828043.0", "edited": "False", "id": "i2zvhjb", "is_submitter": "False", "link_id": "t3_hw2biz", "parent_id": "t1_fz1uim7", "score": "2", "subreddit": "AskCentralAsia", "subreddit_id": "t5_ujz7x"}, {"author": "antoine_vicheff", "body": "Hello! If my UK account has Bulgarian payment method would it work?", "created_utc": "1648415274.0", "edited": "False", "id": "i2cyezb", "is_submitter": "False", "link_id": "t3_kvxxq9", "parent_id": "t1_gj32711", "score": "1", "subreddit": "bulgaria", "subreddit_id": "t5_2qhx7"}, {"author": "antoine_vicheff", "body": "Does my payment method needs to be British too? Or can I use my Bulgarian one?", "created_utc": "1648415021.0", "edited": "False", "id": "i2cxvez", "is_submitter": "False", "link_id": "t3_kvxxq9", "parent_id": "t1_hsn2e2n", "score": "1", "subreddit": "bulgaria", "subreddit_id": "t5_2qhx7"}, {"author": "antoine_vicheff", "body": "https://youtube.com/channel/UCFT3cZaMARJzELPMSyVfcNw\n\nYes, you can check my other videos covering OG Bakugan. My specialty is the ability cards showcase", "created_utc": "1648390773.0", "edited": "False", "id": "i2bdmz9", "is_submitter": "True", "link_id": "t3_tnwgm8", "parent_id": "t1_i2akulx", "score": "5", "subreddit": "Bakugan", "subreddit_id": "t5_2qphg"}, {"author": "antoine_vicheff", "body": "Because the video is an ability card showcase (for my Youtube channel). The BiliBili quality is extremely crisp and I just removed the original sound and replaced it with the English one)", "created_utc": "1648303626.0", "edited": "False", "id": "i26z53y", "is_submitter": "True", "link_id": "t3_tnwgm8", "parent_id": "t1_i263bdo", "score": "3", "subreddit": "Bakugan", "subreddit_id": "t5_2qphg"}, {"author": "antoine_vicheff", "body": "Thanks! I know his original comment wasn’t directed towards me but he literally called polyglots *dream chasers*…. Like *oh, they just pretend to know all these languages*.. aha, yeah, I totally buy that (nope). Such attitude is completely irrelevant and shows some sort of ignorance/character issues. “Lemme just discredit a bunch of hardworking people that have spent years struggling (cuz language learning can indeed be frustrating sometimes) to obtain a sizable knowledge in their beloved languages”… like, come on, why would you do that? Anyway, I’m glad more people agree with me, it’s really nice to be speaking the truth❤️", "created_utc": "1647885033.0", "edited": "False", "id": "i1k2e38", "is_submitter": "False", "link_id": "t3_tj7ef8", "parent_id": "t1_i1jvh9t", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "antoine_vicheff", "body": "Thanks for sharing your opinion. I don’t justify my excessive usage of English words but in my defense (during the Pandemic I use exclusively English online and Bulgarian is left for communication with my parents only” Also Bulgarian seems to borrow a lot of words directly like “Shopping, Trendy, Outfit”, we don’t coin any terms. My brain assumes it’s possible to borrow even more words….. And of course I have been dealing with English for a long time, so some Bulgarian words are completely unknown, some I never knew in the first place. So I’m definitely not offended for calling me somewhat lazy, I just explain what’s the issue for me. I believe my love for English is also a big problem. I simply consider it a superior language. What can I say - It’s really complicated. And I met other people just like me that gradually forget their native languages in favor of English. The original Anglo-Saxons will be proud of all this, I’m sure!\n\nMore borrowings (Rezon from Reason, Market from Market, Relevanten from Relevant) \n(Likevam from Like), (Invitevam from Invite). \nWe even say Sorry instead of our native term. Trening from Training. I can give you 1000 examples.", "created_utc": "1647873928.0", "edited": "1647874230.0", "id": "i1jag9a", "is_submitter": "False", "link_id": "t3_tj7ef8", "parent_id": "t1_i1j4gzl", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "antoine_vicheff", "body": "How much I understand about the subject isn’t really your business I’m afraid and you can’t determine that without knowing my techniques to learn a specific language. *Please keep your assumptions to yourself* \nI’m glad how people are impressed by the fact I speak 7 languages nearly fluently but nobody has the right to claim that “knowing many languages is just a dream”. In such way you seriously discredit the hardworking people. I’m aware of my knowledge. I know what I’m capable of. I just like people to be a little more openminded. \nThanks for the useless conversation anyway. Have a nice day! :)", "created_utc": "1647866345.0", "edited": "False", "id": "i1iull0", "is_submitter": "False", "link_id": "t3_tj7ef8", "parent_id": "t1_i1iqod2", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "antoine_vicheff", "body": "Long story short. Polyglots exist but not in YouTube. They learn languages for various reasons, definitely not to show off/brag though. I disagreed with your statement that *all those polyglots are fake*. How did you determine that? Maybe you tried to learn more than 2 languages and you couldn’t succeed? I felt like you discredit people like me that spend countless hours studying their favorite languageS. Instead of hanging out with friends, instead of going to parties and night clubs I was sitting at home learning this grammar rule, that word, those exceptions etc. Sorry. No offense. I have criticized other people as well and it turned out they would call me fake cuz they are simply unable to handle more than 2 languages simultaneously. That’s not my problem though. Everything is possible. That’s why I said you are not openminded. Cuz you assume something without even analyzing it", "created_utc": "1647863193.0", "edited": "False", "id": "i1ipc6y", "is_submitter": "False", "link_id": "t3_tj7ef8", "parent_id": "t1_i1infr2", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "antoine_vicheff", "body": "I agree with everything except the *polyglots being fake* statement. I’m sorry but I have no intention of learning Mandarin, Japanese, Korean. A lot of the YouTube polyglots that love that trio do lie - yes. But you can’t claim that every single person that speaks 3-4-5-6 languages is making it up to, I guess show off or earn money off of it. What kind of bs is that?? I learn a lot of languages becuz it’s my hobby, becuz I really enjoy it. I like meeting new people, I like traveling to foreign countries and speaking these languages and pleasantly surprise the native people. Please, do not underestimate the standard polyglots, those having no interest in bragging. Try to be a little more openminded :)", "created_utc": "1647861102.0", "edited": "False", "id": "i1im9h3", "is_submitter": "False", "link_id": "t3_tj7ef8", "parent_id": "t1_i1iidqe", "score": "5", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "antoine_vicheff", "body": "It’s definitely the case for me. I’m gradually losing fluency in my native Bulgarian while my English proficiency keeps flourishing to the point of being pretty much C1/C2. My English journey started back in 2010 (at the time 2nd grade) however it wasn’t until 8th grade (late 2016) when I began achieving significant portion of words and grammar through YouTube, movies, social media and so on. To wrap things up it seems like deeply immersing myself into the language and EXCLUDING my native one helped me master English but keeps ruining my knowledge in Bulgarian to the point of being unable to hold a proper conversation without inserting 3-4 Anglicisms *almost every time*. Often I can’t remember the word in Bulgarian but I do know it in English. It’s really unfortunate however I doubt I can fix it somehow. The damage appears to be permanent. Unless of course you forcefully take my iPhone away from me.", "created_utc": "1647860180.0", "edited": "False", "id": "i1ikzwz", "is_submitter": "False", "link_id": "t3_tj7ef8", "parent_id": "t3_tj7ef8", "score": "8", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "antoine_vicheff", "body": "Is he a main evil bakugan/villain/antagonist?…. No", "created_utc": "1647012413.0", "edited": "False", "id": "i0903ta", "is_submitter": "True", "link_id": "t3_tbecuk", "parent_id": "t1_i08wzfl", "score": "1", "subreddit": "Bakugan", "subreddit_id": "t5_2qphg"}, {"author": "antoine_vicheff", "body": "I wanted a Bakugan from each season, she was introduced a villain so she deserved a spot", "created_utc": "1647007625.0", "edited": "False", "id": "i08p2kv", "is_submitter": "True", "link_id": "t3_tbecuk", "parent_id": "t1_i087p0t", "score": "3", "subreddit": "Bakugan", "subreddit_id": "t5_2qphg"}, {"author": "antoine_vicheff", "body": "Yep. She’s a girl btw and she was introduced as a villain and I wanted to add a Bakugan from each season.", "created_utc": "1647007574.0", "edited": "False", "id": "i08oyo8", "is_submitter": "True", "link_id": "t3_tbecuk", "parent_id": "t1_i085st4", "score": "2", "subreddit": "Bakugan", "subreddit_id": "t5_2qphg"}, {"author": "antoine_vicheff", "body": "I added her cuz I wanted a villain from each season so the video would feel more complete. She was introduced as a villain anyway.", "created_utc": "1647007451.0", "edited": "False", "id": "i08op67", "is_submitter": "True", "link_id": "t3_tbecuk", "parent_id": "t1_i089qdk", "score": "1", "subreddit": "Bakugan", "subreddit_id": "t5_2qphg"}, {"author": "antoine_vicheff", "body": "French, Arabic, Dutch. Pronunciation sucks on all 3 and the Arabic grammar is…. Ugh… just no comment", "created_utc": "1646938027.0", "edited": "False", "id": "i051ohl", "is_submitter": "False", "link_id": "t3_tb1nfr", "parent_id": "t3_tb1nfr", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "antoine_vicheff", "body": "As a Bulgarian the language sounds incredible. Soft, melodic, just the mükemmel❤️", "created_utc": "1646490313.0", "edited": "False", "id": "hzgcxwl", "is_submitter": "False", "link_id": "t3_t6p1db", "parent_id": "t3_t6p1db", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "antoine_vicheff", "body": "I’m B2 in Spanish (not thanks to high school tho) without using Duolingo and pre-made Anki. Both just don’t work for me. Especially Duolingo. I use a combination of subtitle generating app, watching everything in my target language and writing down words in my DIY dictionary on my phone. For grammar I download text/course book from Scribd.com 🥰", "created_utc": "1646487848.0", "edited": "False", "id": "hzg8c3j", "is_submitter": "False", "link_id": "t3_t6jrti", "parent_id": "t1_hzct5vl", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "antoine_vicheff", "body": "Yes, I couldn’t agree more. Personally I enjoy 2-4 languages at the same time cuz I get to compare their word order and play around with it", "created_utc": "1646487558.0", "edited": "False", "id": "hzg7tv0", "is_submitter": "False", "link_id": "t3_t6jrti", "parent_id": "t1_hzbletl", "score": "0", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "antoine_vicheff", "body": "Ooo que bien! Bilingual since birth! I have been learning various languages starting with English in 2nd grade (2010), Spanish in 8th grade (2016) and then pretty much whichever I want. If I like a language, I’ll most definitely learn it😅.", "created_utc": "1646172440.0", "edited": "False", "id": "hyyvudf", "is_submitter": "False", "link_id": "t3_t3jjnr", "parent_id": "t1_hyyuuqv", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "antoine_vicheff", "body": "Yep and I should update my language levels cuz well, they are no longer that low. My native tongue is Bulgarian🇧🇬", "created_utc": "1646171850.0", "edited": "False", "id": "hyyuc5z", "is_submitter": "False", "link_id": "t3_t3jjnr", "parent_id": "t1_hyxy5g2", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "antoine_vicheff", "body": "I use an app called Liro to obtain subtitles/captions for any video I want. Basically any words/phrases/expressions that I’m not acquainted with I just write down in my DYI dictionary (with my pronunciation!) called “SimpleAnki” and I learn them! I prefer to organize every single detail of studying a language myself", "created_utc": "1646144000.0", "edited": "False", "id": "hywvu0o", "is_submitter": "False", "link_id": "t3_t3jjnr", "parent_id": "t3_t3jjnr", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "antoine_vicheff", "body": "Interesting, I have also studied German, comparing it to English I rarely come across loanwords. While English has french “colour” German has “Farbe”. Flower - Blume. Question - Frage. Car - Wagen. Apparently less than 7% of German’s wordstock comes from borrowed terms due to the compounding new words phenomenon. Compare Dutch with 20% and English with 60%.", "created_utc": "1645616347.0", "edited": "False", "id": "hy37k4t", "is_submitter": "False", "link_id": "t3_syzzc4", "parent_id": "t1_hy2f9du", "score": "0", "subreddit": "linguistics", "subreddit_id": "t5_2qhos"}, {"author": "antoine_vicheff", "body": "Thanks for the explanation! Turkic languages in general are my favorite (Turkish number 1 ofc) and I want to learn the other main 5-6. I noticed that Türkmen reminds me of Turkish but it sounds very rough while Azeri… oh my God, it’s full of Persian and Arabic words. If I ignore them it does also remind me of Turkish but more Æ, guturall G and Kh sounds", "created_utc": "1645030348.0", "edited": "False", "id": "hx6yd5v", "is_submitter": "False", "link_id": "t3_st9x2o", "parent_id": "t1_hx6svud", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "antoine_vicheff", "body": "As a Turk how much Azeri and Türkmen do you understand?", "created_utc": "1645023809.0", "edited": "False", "id": "hx6hepj", "is_submitter": "False", "link_id": "t3_st9x2o", "parent_id": "t1_hx5twd2", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "antoine_vicheff", "body": "Benim için türkçe dünyanın en güzel dilidir… \n\nDeutsch ist die Sprache meiner Lieblingsmarke Mercedes-Benz\n\nYa estaba aprendiendo Español en mi escuela secundaria como mi primer lenguaje \n\nRussian can be very useful to me as there are many materials/resources on various topics\n\nAnd Ukrainian/Serbian.. well just because I like them and they are close enough to my native language (Bulgarian) \n\nI love learning languages xD. What can I say, it’s my favorite hobby ❤️❤️❤️\n\nAma.. türkçe mükemmel, gerçekten aşığım. Sevdiğim şarkılarda söylenenleri anladığım için mutluyum", "created_utc": "1644874264.0", "edited": "False", "id": "hwyil1z", "is_submitter": "False", "link_id": "t3_ss846r", "parent_id": "t1_hwxw302", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "antoine_vicheff", "body": "Evet evet herkes şaşırır 😃! Telefonumda bir uygulama kullanıyorum. Adı \"Liro\". Seçtiğiniz videoya otomatik olarak altyazı ekler. Dann schreibe ich jedes unbekannte Wort, Phrase oder Ausdruck in der App „Simple Anki”. \n\nIncluso puedo recordar mi pronunciación para que me sea más fácil. And.. If I study more than 2 languages simultaneously what I do is I write (for example) the same sentence in (let’s say) German, Spanish and Turkish. That way I can practice all three languages at once while learning something new and I can also play around with the word order and use synonyms! \n\nBtw, German for me was the most difficult out of all the ones I’ve studied. Just because of the word order in longer sentences. I always have this weird feeling that I misplaced the adjective/adverb or something else 😂", "created_utc": "1644854391.0", "edited": "False", "id": "hwx5pzp", "is_submitter": "False", "link_id": "t3_ss846r", "parent_id": "t1_hwwokkk", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "antoine_vicheff", "body": "I speak 8 languages, (7 foreign + my native) and I would like to learn even more in the future not because of any benefits but only due to my personal interest and curiosity in them. I love meeting new people from different countries and speaking to them in their native tongues is what I’m always aiming it. Usually people are impressed by the number (7) but here is the thing, I’m just not content yet! 14-15 is my current goal. I need constant practice though otherwise I may lose significant amount of proficiency and of course I don’t want that to happen at all.", "created_utc": "1644840119.0", "edited": "False", "id": "hwweel2", "is_submitter": "False", "link_id": "t3_ss846r", "parent_id": "t3_ss846r", "score": "7", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "antoine_vicheff", "body": "I also love the Nonets’ design but their skills… Spaterix and Stronk suck. I hate how confident they are too. We all saw how they lost to Dan and Shun. For extremely old Bakugan I really expected to see a better performance, just saying… Tremblar and the Darkus trio are the best imo.", "created_utc": "1644593279.0", "edited": "False", "id": "hwij0ir", "is_submitter": "True", "link_id": "t3_sq0fmx", "parent_id": "t1_hwic95x", "score": "4", "subreddit": "Bakugan", "subreddit_id": "t5_2qphg"}, {"author": "antoine_vicheff", "body": "Sorry, man. Just fixed it. I’m triggered and I didn’t respond properly🥺", "created_utc": "1644579030.0", "edited": "False", "id": "hwhqmw8", "is_submitter": "False", "link_id": "t3_spa6wv", "parent_id": "t1_hwhqdfy", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "antoine_vicheff", "body": "So yeah, basically they do it for attention/views/show off. Learning a couple of words and fixed phrases doesn’t mean you speak the language. For me, it’s kinda funny but also a little unrealistic cuz I’m here struggling to get used to German’s word order while I’ve seen Youtubers claim “I speak Vietnamese, Chinese AND Korean”… wtf? No, no, you don’t speak them, you are bluffing and it’s quite obvious. Pathetic……", "created_utc": "1644578557.0", "edited": "1644578992.0", "id": "hwhq040", "is_submitter": "False", "link_id": "t3_spa6wv", "parent_id": "t1_hwgy6ir", "score": "6", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "antoine_vicheff", "body": "Oh my God, yes! For some reason they just want to show off. That’s not the point. You’re supposed to love the language you study.", "created_utc": "1644578147.0", "edited": "False", "id": "hwhpg8d", "is_submitter": "False", "link_id": "t3_spa6wv", "parent_id": "t1_hweomuu", "score": "7", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "antoine_vicheff", "body": "I’m just showing off the ability cards and stands! Sorry! I’m sure people like them", "created_utc": "1644513394.0", "edited": "False", "id": "hwe2eyg", "is_submitter": "True", "link_id": "t3_spa0jh", "parent_id": "t1_hwe1cv1", "score": "2", "subreddit": "Bakugan", "subreddit_id": "t5_2qphg"}, {"author": "antoine_vicheff", "body": "Basically that means that almost all words sound the same to me, and the tones are annoying as well. Chong Qwa, Shi Shao, this type of thing, I hate it. I assume people learn Mandarin cuz of the challenging characters? I don’t see how can anyone say it’s a beautiful sounding language!", "created_utc": "1644509470.0", "edited": "False", "id": "hwdrrar", "is_submitter": "False", "link_id": "t3_sowpu5", "parent_id": "t1_hwdprzk", "score": "0", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "antoine_vicheff", "body": "Your teacher was right, you need to learn both the articles and the cases (in the beginning) and then move onto another grammar.  \n\nTurkish for me wasn’t very difficult tbh, it’s just adding adding adding suffixes, you learn them, you’re good to go, I did however have issues with Spanish due to the tenses usage and the subjunctive mood and I still make mistakes. Honestly Spanish is stereotyped for being very easy to learn but when you spend 5 years learning it in depth in high school, just then you realize it’s a lie and you lose interest in it. Of course, for me that wasn’t really the case cuz I did come back just recently and… lemme be clear, it has some convoluted rarely used grammar that is situational and I swear I WONT waste my time on it", "created_utc": "1644499379.0", "edited": "1644499721.0", "id": "hwd387t", "is_submitter": "False", "link_id": "t3_sowpu5", "parent_id": "t1_hwcu5so", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "antoine_vicheff", "body": "For the most part I disliked it, it felt incomplete and it focused on something I’m not interested it. My favorite is still GT5, modded, but still, it’s the best imo. I play even today and I’m not tired of it. GT7 looks promising, but I’ll wait for a discount and then I’ll get it", "created_utc": "1644498943.0", "edited": "False", "id": "hwd2die", "is_submitter": "False", "link_id": "t3_sosjq4", "parent_id": "t3_sosjq4", "score": "1", "subreddit": "granturismo", "subreddit_id": "t5_2s4f7"}, {"author": "antoine_vicheff", "body": "I agree about Mandarin but I have to disagree about German. If you think it’s hard then what about me learning Russian, Serbian and Turkish, ALL having much more complexed case systems than German? I eventually mastered them (well, most anyway) so.. cases for me, I mean, if you can’t learn them, it means you’re lacking the skill to study a foreign language from the very beginning. No offense. Tons of cases? In German? 4 vs Serbian 7??? That’s a lot? ??? Wut", "created_utc": "1644492612.0", "edited": "False", "id": "hwcs0dp", "is_submitter": "False", "link_id": "t3_sowpu5", "parent_id": "t1_hwcr4af", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "antoine_vicheff", "body": "The infamous trio Japanese, Mandarin, Korean PLUS Vietnamese and pretty much all other South Asian languages similar to them. I find their chin,  chan, chon thing to be underwhelming, too difficult to get a grasp on, quite useless outside of their designated countries and frankly I’d rather learn Catalan than any of them!! No offense. If I want to learn a specific language I would have to like the way it sounds and in the case of JMKV… I… almost hate their phonologies.", "created_utc": "1644492085.0", "edited": "1644492288.0", "id": "hwcrani", "is_submitter": "False", "link_id": "t3_sowpu5", "parent_id": "t3_sowpu5", "score": "-3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "antoine_vicheff", "body": "I would remove at least 25% of the loanwords and replace them with German based words (since German is West Germanic as well). I can’t stand speaking a Germanic language through Latin and French words.", "created_utc": "1644491491.0", "edited": "False", "id": "hwcqics", "is_submitter": "False", "link_id": "t3_sof5d6", "parent_id": "t3_sof5d6", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "antoine_vicheff", "body": "As a native Bulgarian speaker I am able to understand a lot of more basic/colloquial Serbian and more literary/advanced Russian. Of course the grammar is quite different but if I read a text I’ll be able to pick up many many words (50-90%, depending on the topic). Often Bulgarian is thought to sound similar to Ukrainian, but the truth is that you can rarely find words in common between the two. So it doesn’t count.", "created_utc": "1644491174.0", "edited": "False", "id": "hwcq3gh", "is_submitter": "False", "link_id": "t3_sp30dp", "parent_id": "t3_sp30dp", "score": "8", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "antoine_vicheff", "body": "Well, I’m definitely satisfied with my progress so far, it seems like it’s the most efficient method for me anyway. It took me around 3 weeks to remember everything that I had already written down. Stacking words up doesn’t appear to be an issue. I do focus more on fixed phrases (such as the Spanish “en vez de” which isn’t translated literally and it means “instead of”) than anything else just because they are my weak point.", "created_utc": "1644242287.0", "edited": "1644242482.0", "id": "hvy0uv4", "is_submitter": "False", "link_id": "t3_smpg25", "parent_id": "t1_hvxzd18", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "antoine_vicheff", "body": "I personally use an alternative version of Anki called simple Anki which is basically a “do it yourself dictionary” on my phone that even let’s me record my own pronunciation of words/phrases/expressions. My practice usually consists of writing down 20 to 30 words every day which I just repeat out loud and I create short sentences with.", "created_utc": "1644241501.0", "edited": "False", "id": "hvxz96l", "is_submitter": "False", "link_id": "t3_smpg25", "parent_id": "t3_smpg25", "score": "4", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "antoine_vicheff", "body": "Spanish and French are much closely related to English than Russian and Chinese. The sentence order is similar, same goes for the pronunciation of many words. Most people usually study languages that would take less time to master. And besides, Russian less popular than both French and Spanish", "created_utc": "1644161472.0", "edited": "1644161691.0", "id": "hvtjsx8", "is_submitter": "False", "link_id": "t3_slm4fw", "parent_id": "t3_slm4fw", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "antoine_vicheff", "body": "Update! Grid 2019 is actually pretty damn good, I’ve been playing it for the last 4-5 months and it’s really decent. I wish it had road cars but that’s the only flaw so far. Nevertheless, I’m shifting towards PC gameplay so Forza will probably become my number 1 racer while the rest I’ll play occasionally. I am really excited for the new NFS, new Grid and a new The Crew 3 (still in pre-alpha state)", "created_utc": "1638272678.0", "edited": "False", "id": "hmnhjbu", "is_submitter": "False", "link_id": "t3_pst2g6", "parent_id": "t1_hmnb7lk", "score": "1", "subreddit": "pcars", "subreddit_id": "t5_2tpc2"}, {"author": "antoine_vicheff", "body": "That’s exactly what I mean. You have to use main resources AND supplements all at once. Language apps are a gimmick, imo. \nThe main focus should be on word order, adding vocabulary (gradually), then learning simple grammar rules and finally speaking with a native speaker. No app contains all of that.\nCombine everything and in a couple of months you’ll see how you’re able to have basic conversations in the desired language :)", "created_utc": "1637529842.0", "edited": "False", "id": "hlk5040", "is_submitter": "False", "link_id": "t3_qysfn7", "parent_id": "t1_hlk3dcp", "score": "2", "subreddit": "russian", "subreddit_id": "t5_2qlc6"}, {"author": "antoine_vicheff", "body": "You can’t learn a language by using just one single resource! Duolingo can’t replace a course nor a textbook. It’s quite repetitive, it doesn’t focus at all on grammar rules. There’s no interaction with native speakers. It is a good supplement to your main study but there’s no way you could learn an entire language only relying on its help. What I recommend is to start off with some textbooks that teach basic grammar rules, then any dictionary that adds vocabulary (other than Google Translate which is so damn bookish and formal), then gradually move to harder textbooks which correspond to your current level. Besides the aforementioned, find a native speaker with whom you can practise speaking and listening comprehension. \nIn my struggles with Kurdish, Persian and Turkish my friends in Discord helped me out tremendously. \nWatch TV Shows, movies, advertisements in the specific language and write down any new word or phrase you think is necessary. I hope now my response is much more meaningful :)", "created_utc": "1637528963.0", "edited": "False", "id": "hlk2vit", "is_submitter": "False", "link_id": "t3_qysfn7", "parent_id": "t1_hljnh5e", "score": "1", "subreddit": "russian", "subreddit_id": "t5_2qlc6"}, {"author": "antoine_vicheff", "body": "I can’t recommend any app for sufficient language learning except Busuu and Falou (which are paid) :) \nDuolingo just isn’t enough", "created_utc": "1637509305.0", "edited": "False", "id": "hlipwh2", "is_submitter": "False", "link_id": "t3_qysfn7", "parent_id": "t3_qysfn7", "score": "-7", "subreddit": "russian", "subreddit_id": "t5_2qlc6"}, {"author": "antoine_vicheff", "body": "No, man, it’s totally fine! A lot of people would say how easy the Romance languages are but they don’t realize what the truth is… Spanish for example may have the simplest pronunciation but oh god what horrible grammar it has… subjunctive and tenses + conditionals can be pain in the ass, and some verbs go along with specific prepositions, the worst part is that if you replace it with another preposition the meaning changes….", "created_utc": "1637491337.0", "edited": "False", "id": "hlhvb10", "is_submitter": "True", "link_id": "t3_qyd5uc", "parent_id": "t1_hlhucvp", "score": "2", "subreddit": "granturismo", "subreddit_id": "t5_2s4f7"}, {"author": "antoine_vicheff", "body": "I have studied Spanish for almost 5 years and despite Italian being close with it, the only words I understand are Benzina “Gasoline” and Velocita “Speed”. \n\nIt could be wrong due to “direct translation”….", "created_utc": "1637489020.0", "edited": "False", "id": "hlhscs1", "is_submitter": "True", "link_id": "t3_qyd5uc", "parent_id": "t1_hlgg614", "score": "3", "subreddit": "granturismo", "subreddit_id": "t5_2s4f7"}, {"author": "antoine_vicheff", "body": "GT5 Master Mod", "created_utc": "1637453218.0", "edited": "False", "id": "hlg57ub", "is_submitter": "True", "link_id": "t3_qyd5uc", "parent_id": "t1_hlfbrrg", "score": "14", "subreddit": "granturismo", "subreddit_id": "t5_2s4f7"}, {"author": "antoine_vicheff", "body": "GT5 Master Mod :)", "created_utc": "1637453201.0", "edited": "False", "id": "hlg56ia", "is_submitter": "True", "link_id": "t3_qyd5uc", "parent_id": "t1_hlfq2bl", "score": "7", "subreddit": "granturismo", "subreddit_id": "t5_2s4f7"}, {"author": "antoine_vicheff", "body": "Costa di Amalfi is a fictional track based on roads in real life. If you have a look on Google Maps you can see that it’s too narrow for cars to pass through the streets but that particular area does exist except it’s full of cafes and restaurants and tourists wandering around.", "created_utc": "1636976236.0", "edited": "False", "id": "hkpj6h2", "is_submitter": "True", "link_id": "t3_qtp9di", "parent_id": "t1_hkpg1lb", "score": "2", "subreddit": "granturismo", "subreddit_id": "t5_2s4f7"}, {"author": "antoine_vicheff", "body": "Well not all old tracks, George Paris V and Cathedral Rocks don’t work", "created_utc": "1636935765.0", "edited": "False", "id": "hknpgwm", "is_submitter": "True", "link_id": "t3_qtp9di", "parent_id": "t1_hkna1hd", "score": "1", "subreddit": "granturismo", "subreddit_id": "t5_2s4f7"}, {"author": "antoine_vicheff", "body": "https://youtu.be/jsriZ6btISM In case you don’t believe me 😁", "created_utc": "1636912561.0", "edited": "False", "id": "hkm2toh", "is_submitter": "True", "link_id": "t3_qtp9di", "parent_id": "t1_hkly7tc", "score": "3", "subreddit": "granturismo", "subreddit_id": "t5_2s4f7"}, {"author": "antoine_vicheff", "body": "Yes, there is a master mod for GT6 as well. To your 2nd question, in GT5 you can change the AI pace if you select Professional difficulty in Arcade Mode which will increase the skill of the AI cars and they can put up a fight big time but they will also tend to make more mistakes. Also, you can create fully customisable grids in GT mode using the Favorite Opponents option.", "created_utc": "1636907895.0", "edited": "False", "id": "hklrg3t", "is_submitter": "True", "link_id": "t3_qtp9di", "parent_id": "t1_hklp21s", "score": "6", "subreddit": "granturismo", "subreddit_id": "t5_2s4f7"}, {"author": "antoine_vicheff", "body": "I already published the link :) the Mod makes GT5 the best game in the series by FAR. You can even choose any standard and premium car as your opponent. Over 1050 cars to choose from. Imagine all possible grids. 16 cars at Costa di Amalfi. So damn good! Except no pits but for me it’s fine.", "created_utc": "1636903310.0", "edited": "False", "id": "hklgwr4", "is_submitter": "True", "link_id": "t3_qtp9di", "parent_id": "t1_hklgcut", "score": "13", "subreddit": "granturismo", "subreddit_id": "t5_2s4f7"}, {"author": "antoine_vicheff", "body": "The tracks are leftovers however they are slightly upscaled and totally working (with the exception of the pits). My point is, it’s normal to have some minor issues", "created_utc": "1636902484.0", "edited": "False", "id": "hklf3hw", "is_submitter": "True", "link_id": "t3_qtp9di", "parent_id": "t1_hklc5i3", "score": "3", "subreddit": "granturismo", "subreddit_id": "t5_2s4f7"}, {"author": "antoine_vicheff", "body": "Of course. What you see here is the GT5 Master Mod. It features the majority of old tracks from GT4 and even some from GT3 (Complex String and Smokey Mountains which are a little unfinished but that’s expected). \nHere are some of the included (fully working tracks):\n- Costa Di Amalfi\n- Citta Di Aria\n- Hong Kong\n- Opera Paris\n- New York\n- Seoul Central\n- Midfield Raceway\n- Apricot Hill\n- El Capitan \n- Infineon Raceway\n- Test and Beginner course from GT4 \nas well as these rally tracks:\n- Seattle\n- Tahiti Maze\n- Chamonix\n- Ice Arena\n- Grand Canyon\n- Swiss Alps\n- Valencia (from Tourist Trophy)\n- The Circle from GT3\n\nHere is the link :) https://www.mediafire.com/folder/6ye4yod7voapb/", "created_utc": "1636901731.0", "edited": "False", "id": "hkldh8x", "is_submitter": "True", "link_id": "t3_qtp9di", "parent_id": "t1_hklbyaf", "score": "13", "subreddit": "granturismo", "subreddit_id": "t5_2s4f7"}, {"author": "antoine_vicheff", "body": "[Here is an example, hope you like it 😁❤️](https://youtu.be/Z_yL8mWB5fc)", "created_utc": "1636900876.0", "edited": "False", "id": "hklbnh9", "is_submitter": "True", "link_id": "t3_qtp9di", "parent_id": "t1_hkla5ci", "score": "13", "subreddit": "granturismo", "subreddit_id": "t5_2s4f7"}, {"author": "antoine_vicheff", "body": "[Here you go 😁](https://streamable.com/4pawaq)", "created_utc": "1636900201.0", "edited": "False", "id": "hkla8kw", "is_submitter": "True", "link_id": "t3_qtp9di", "parent_id": "t1_hkl7hq5", "score": "9", "subreddit": "granturismo", "subreddit_id": "t5_2s4f7"}, {"author": "antoine_vicheff", "body": "And now that it has 90% of the old tracks it really is the best ❤️", "created_utc": "1636898315.0", "edited": "False", "id": "hkl6ixj", "is_submitter": "True", "link_id": "t3_qtp9di", "parent_id": "t1_hkl4khu", "score": "25", "subreddit": "granturismo", "subreddit_id": "t5_2s4f7"}, {"author": "antoine_vicheff", "body": "In Bulgarian we have a sound that represents the i in Girl… it’s the Ъ", "created_utc": "1636894718.0", "edited": "False", "id": "hkkzwag", "is_submitter": "False", "link_id": "t3_qt92te", "parent_id": "t1_hkhvvwv", "score": "2", "subreddit": "russian", "subreddit_id": "t5_2qlc6"}, {"author": "antoine_vicheff", "body": "Exactly! I’m a Merc fan but BMW sedans would also be appreciated by me. I feel like they just add more and more unknown Japanese cars that Europeans don’t wanna drive cuz we are used to luxury sedans.. it’s a Shame, really.", "created_utc": "1636332466.0", "edited": "False", "id": "hjqw0pa", "is_submitter": "False", "link_id": "t3_qo0eqn", "parent_id": "t1_hjquw7u", "score": "2", "subreddit": "granturismo", "subreddit_id": "t5_2s4f7"}, {"author": "antoine_vicheff", "body": "You are not alone!! I am also disappointed in the car list so far. Where are the German and French new road cars that exist in most other games? C Class, E Class, S5, S6, hell even the S8, M5, M8 Competition… GT5 and GT6 had some incredible sedans and coupes that were removed in GT Sport and if I don’t see any even slight representation of them in GT7 I will be very disappointed and I will most certainly postpone my purchase :)", "created_utc": "1636286321.0", "edited": "False", "id": "hjnwqs1", "is_submitter": "False", "link_id": "t3_qo0eqn", "parent_id": "t3_qo0eqn", "score": "6", "subreddit": "granturismo", "subreddit_id": "t5_2s4f7"}, {"author": "antoine_vicheff", "body": "I never understood the useless rant about cases in German. I started studying it a couple of months ago and I will be deadly honest, they are one of the easiest things to remember as long as you have time to practice. It is very stereotypical and kind of annoying to assume it could be complicated to memorise a couple of different endings for 3-letter words :)\nFor me the biggest challenge is to master the intonation, articulation and pronunciation of a German sentence. It’s kind of impossible unless you are really just that good :)", "created_utc": "1636155074.0", "edited": "False", "id": "hjhf5uo", "is_submitter": "False", "link_id": "t3_qnaiwj", "parent_id": "t1_hjgq7qr", "score": "1", "subreddit": "russian", "subreddit_id": "t5_2qlc6"}, {"author": "antoine_vicheff", "body": "Hello! No, I am not aware of that person nor I would write something like that without any research. I am a big fan of linguistics, I love comparing two or more languages at once however my biggest hobby is to learn a new language if I have enough free time or I’m bored and have nothing else to do. :)", "created_utc": "1636154201.0", "edited": "False", "id": "hjhd35q", "is_submitter": "False", "link_id": "t3_qnaa50", "parent_id": "t1_hjhcjiu", "score": "2", "subreddit": "linguistics", "subreddit_id": "t5_2qhos"}, {"author": "antoine_vicheff", "body": "Thanks for the detailed explanation!", "created_utc": "1636151096.0", "edited": "False", "id": "hjh5g49", "is_submitter": "False", "link_id": "t3_qnaa50", "parent_id": "t1_hjh385k", "score": "3", "subreddit": "linguistics", "subreddit_id": "t5_2qhos"}, {"author": "antoine_vicheff", "body": "I think the biggest issue is the miscommunication between Bulgarian and Russian politicians. I’m not air quoting anyone, it was a totalitarian regime, thus you won’t find any official documentation because it was simply hidden but it’s safe to say the whole point of Communism in Bulgaria was to make sure it says under Russian influence. Unfortunately (for Russia) it didn’t work out. I blame the politicians for that. I watched thousands of communist documentaries and every single one is filled with endless propaganda. Russia the best ally and Turkey - the worst enemy. That’s pretty much it. I don’t wanna go off topic. The discussion was about Russians speaking Russian to Bulgarians. Like I already mentioned, instead of trying to mix in with the local population or at least show some enthusiasm and learn basic vocabulary, they do nothing but stay arrogant and with high self-esteem. I still don’t understand why they came to Bulgaria in the first place but if they continue with their unbearable behaviour we have to take serious actions. Like you know, deny approval of ID and Passports.. :)) so they can’t buy any more housings on the Black Sea :))))\n\n** The Russians who I personally met with were from Saints Petersburg.", "created_utc": "1634305869.0", "edited": "False", "id": "hgqlirz", "is_submitter": "False", "link_id": "t3_55lczf", "parent_id": "t1_hgqhsq2", "score": "1", "subreddit": "russian", "subreddit_id": "t5_2qlc6"}, {"author": "antoine_vicheff", "body": "No problem :)", "created_utc": "1634304181.0", "edited": "False", "id": "hgqhxdr", "is_submitter": "False", "link_id": "t3_55lczf", "parent_id": "t1_hgqgaxo", "score": "2", "subreddit": "russian", "subreddit_id": "t5_2qlc6"}, {"author": "antoine_vicheff", "body": "I didn’t know such topic even existed until I found it earlier today so I thought I’d just share my personal opinion and experience. \n\nI have met quite many Russians in my city and despite making friends with most of them I still can’t fully trust them. Especially those who asked me “Why you let Turks live in Bulgaria, they are just Arabs”……….. I guess for Russians any Muslim is an Arab and/or has a backwards mindset….. \n\nHere’s the thing, a lot of them like Bulgaria as a resort place, like the beaches are wonderful, it’s cheap and the weather’s nice as well. But then they started explaining that everybody knew how Bulgaria was supposed to be the last republic to join the Soviet Union and so plans were made to Russify as many people as possible. That included mandatory Russian in school, Russian TV as in like movies, celebrating \n“S dnem Pobedy” and just pretty much telling people to love and respect Russians. Although… it didn’t quite work out. \nAs soon as Communism fell apart, the situation changed, a lot of people left the country, others seized the power and grabbed everything they could…. \n\nIn Soviet countries however Russians were seen as the best ever. Central Asians still love Stalin and Lenin, they miss the Soviet Union. They want it to come back.. in their countries Russian is very important, everyone speaks it, even better than their own language (Tajik, Uzbek etc.). This is absolutely outrageous and proves the point that Russia was and probably still is the biggest assimilator ever. We had something called “Revival Process” during the Communist regime where authorities forcefully tried to change the identity of Muslims in Bulgaria. That included altering the religion and names of all who weren’t Christian. When I heard what happened with those who refused, I cried… it was tragic and I’m really ashamed of those who initiated it. It kinda reminds of the Tatars who fought to save Tatar language in schools in Russia. :) The video is up on YouTube. \n\nI am sorry if you are Russian and you feel offended, I don’t mean it. All I’m trying to say is that many Bulgarians will not like Russians ordering them what to do and if they speak Russian but then they live in Bulgaria you can expect some horrendous consequences. I can’t agree with the excuse “you were an ally of Russia and Russian was spoken for more than 40 years so you have to speak Russian.”.. SCREW THOSE", "created_utc": "1634300214.0", "edited": "False", "id": "hgqaepe", "is_submitter": "False", "link_id": "t3_55lczf", "parent_id": "t1_hgq51s8", "score": "2", "subreddit": "russian", "subreddit_id": "t5_2qlc6"}, {"author": "antoine_vicheff", "body": "Bulgaria was never part of the Soviet Union, instead, after another loss in WW2 it was forced to “live peacefully” after the Red Army broke in and got rid of the Germans. The issue with Bulgarians and Russians is complicated, Russian settlers here show no interest in adapting to the life and culture specifics, instead they insist on having conversations solely in Russian (that is what I call imperialism) and often they criticise some Balkan things in Bulgarians which are unrepairable. Such as the turbo folk music (chalga), women wearing provocative clothes etc. Russians are very disappointed they couldn’t enforce Russian as the main language in Bulgaria like they did in the post Soviet republics :)", "created_utc": "1634287207.0", "edited": "False", "id": "hgptjo2", "is_submitter": "False", "link_id": "t3_55lczf", "parent_id": "t1_d8bslrg", "score": "2", "subreddit": "russian", "subreddit_id": "t5_2qlc6"}, {"author": "antoine_vicheff", "body": "I will be honest with you. We do not like each other much, it seems.. As a Bulgarian myself I just can’t appreciate the imperialistic mindset that Russians always try to demonstrate in my home country. They would find 1000 excuses not to learn Bulgarian and would insist on speaking Russian instead. That is NOT right as we no longer study Russian at schools and those who used to, forgot how to speak. I know Russia is very popular and interesting for foreigners like the British, the French, Americans etc. but as a person whose region is flooded with Russians that show no interest in adapting to the native population I must say I don’t want to have anything in common with these people. We are different. That’s all", "created_utc": "1634286718.0", "edited": "False", "id": "hgpt0c0", "is_submitter": "False", "link_id": "t3_55lczf", "parent_id": "t3_55lczf", "score": "3", "subreddit": "russian", "subreddit_id": "t5_2qlc6"}, {"author": "antoine_vicheff", "body": "I have to partially disagree with you. Newest GRID game is absolute trash, the previous release were nice but content wise were too limited. Forza Motorsport really doesn’t stand a chance anymore, not only it lacks the highend content but also Horizon gets all the main updates. Gran Turismo is more sim oriented but Sport lacks variety in tracks and free mode is horrendous. The Crew case is probably the weirdest as the first game was a Need For Speed wannabe but failed to deliver excitement, second game is super fun but it’s not a simulator and has too much paid content and the lootboxes force you to spend a lot of time doing repetitve events so you get the necessary parts to upgrade the cars. \nPCars 3 fits as a NFS Shift 2 successor, it offers around 120 layouts, more than any other game, I wish it had a little more car variety but I guess it’s okay with the DLC. Physics are nice, as in cars allow you to make mistakes and fix them right after. :)", "created_utc": "1632316566.0", "edited": "False", "id": "hdu9t0a", "is_submitter": "False", "link_id": "t3_pst2g6", "parent_id": "t1_hds3djb", "score": "1", "subreddit": "pcars", "subreddit_id": "t5_2tpc2"}, {"author": "antoine_vicheff", "body": "Horridian will win, of course 😜", "created_utc": "1630428105.0", "edited": "False", "id": "hb2r8f9", "is_submitter": "True", "link_id": "t3_peshh5", "parent_id": "t1_hb20bmz", "score": "2", "subreddit": "Bakugan", "subreddit_id": "t5_2qphg"}, {"author": "antoine_vicheff", "body": "The console is new, I got it yesterday! SCART quality looks like a 1980’s news live report. When I tried with green, blue and red, even though the colors were messed up and the sound was missing, the resolution was incredible, everything was super sharp, like on those PC emulators.", "created_utc": "1596828190.0", "edited": "False", "id": "g0pnzi1", "is_submitter": "False", "link_id": "t3_i50kuu", "parent_id": "t1_g0nq5fk", "score": "1", "subreddit": "ps2", "subreddit_id": "t5_2r8uk"}, {"author": "antoine_vicheff", "body": "So much for that Light Green YPbPr port... it’s useless isn’t it?", "created_utc": "1596755841.0", "edited": "False", "id": "g0m9u6p", "is_submitter": "False", "link_id": "t3_i50kuu", "parent_id": "t1_g0m9e6f", "score": "1", "subreddit": "ps2", "subreddit_id": "t5_2r8uk"}, {"author": "antoine_vicheff", "body": "What exactly do you mean? Everything I got was brand new, the SCART as well. Can’t I just adjust it somehow? I can’t spend 40 bucks, the console itself was that much!...", "created_utc": "1596755143.0", "edited": "False", "id": "g0m8m9x", "is_submitter": "False", "link_id": "t3_i50kuu", "parent_id": "t1_g0m8bq9", "score": "0", "subreddit": "ps2", "subreddit_id": "t5_2r8uk"}, {"author": "antoine_vicheff", "body": "https://ibb.co/0q5XS5m looks exactly like that one. Does it have to be manually adjusted?", "created_utc": "1596753946.0", "edited": "False", "id": "g0m6b8b", "is_submitter": "False", "link_id": "t3_i50kuu", "parent_id": "t1_g0m50tv", "score": "1", "subreddit": "ps2", "subreddit_id": "t5_2r8uk"}, {"author": "antoine_vicheff", "body": "My SCART is ruining the quality, it looks terrible", "created_utc": "1596753601.0", "edited": "False", "id": "g0m5mbu", "is_submitter": "False", "link_id": "t3_i50kuu", "parent_id": "t1_g0m4w7f", "score": "-1", "subreddit": "ps2", "subreddit_id": "t5_2r8uk"}, {"author": "antoine_vicheff", "body": "Man, I’m so lost. I have no idea what to do. Like I mentioned, the only colored ports on my TV are the yellow Side AV and the light green YPbPr. There’s nothing else. And I still don’t understand why Scart has such a bad quality output, looks like 240p...", "created_utc": "1596752176.0", "edited": "False", "id": "g0m2wno", "is_submitter": "False", "link_id": "t3_i50kuu", "parent_id": "t1_g0m27ym", "score": "1", "subreddit": "ps2", "subreddit_id": "t5_2r8uk"}, {"author": "antoine_vicheff", "body": "Yeah, also has some kind of pinkish flickering", "created_utc": "1596751330.0", "edited": "False", "id": "g0m1b29", "is_submitter": "False", "link_id": "t3_i50kuu", "parent_id": "t1_g0m0ipa", "score": "1", "subreddit": "ps2", "subreddit_id": "t5_2r8uk"}, {"author": "antoine_vicheff", "body": "Where do I put those? The light green YPbPr port is all I have, the yellow is Side AV. SCART is terrible, even though the console has Free McBoot", "created_utc": "1596751280.0", "edited": "False", "id": "g0m17mf", "is_submitter": "False", "link_id": "t3_i50kuu", "parent_id": "t1_g0m0gp2", "score": "1", "subreddit": "ps2", "subreddit_id": "t5_2r8uk"}, {"author": "antoine_vicheff", "body": "https://ibb.co/HD5v74T", "created_utc": "1596750058.0", "edited": "False", "id": "g0lyszj", "is_submitter": "False", "link_id": "t3_i50kuu", "parent_id": "t1_g0lxtg5", "score": "2", "subreddit": "ps2", "subreddit_id": "t5_2r8uk"}, {"author": "antoine_vicheff", "body": "No way, my cables are brand new. The light green port is YPbPr...", "created_utc": "1596749340.0", "edited": "False", "id": "g0lxd5e", "is_submitter": "False", "link_id": "t3_i50kuu", "parent_id": "t1_g0lx2sr", "score": "1", "subreddit": "ps2", "subreddit_id": "t5_2r8uk"}, {"author": "antoine_vicheff", "body": "I’m really sorry, I can never take a joke😂\nThank you for the response, I asked because I wasn’t sure and of course I never actually had a PS2 myself", "created_utc": "1596459729.0", "edited": "False", "id": "g07blrn", "is_submitter": "False", "link_id": "t3_i2nidr", "parent_id": "t1_g07b0kc", "score": "2", "subreddit": "ps2", "subreddit_id": "t5_2r8uk"}, {"author": "antoine_vicheff", "body": "Because of people on different forums... one says “yes it’s working”, the other - not working (crashes, can’t run, has PS1 processor, etc.. I don’t know what to do!", "created_utc": "1596447279.0", "edited": "False", "id": "g06xigx", "is_submitter": "False", "link_id": "t3_i2nidr", "parent_id": "t1_g060w6f", "score": "2", "subreddit": "ps2", "subreddit_id": "t5_2r8uk"}, {"author": "antoine_vicheff", "body": "Thanks a whole lot! My game is finally working properly. I can run it. Unfortunately there is just one little issue left, everything is super shaky there is no sharpness at all. Is there any way in which that could be fixed?", "created_utc": "1595106062.0", "edited": "False", "id": "fyhwq2t", "is_submitter": "False", "link_id": "t3_hac8m3", "parent_id": "t1_fy3gszi", "score": "1", "subreddit": "ps3homebrew", "subreddit_id": "t5_2s9jx"}, {"author": "antoine_vicheff", "body": "It crashes every single time. I installed the ISO via USB, although there was some kind of a storage error during the transferring from the PC to the USB. That’s my first concern. The other two issues might be the ones you just said. Corrupt ISO or wrongly installed. The console temperature is below 80 degrees, yes. I’m really frustrated, it’s the only Gran Turismo I’ve never actually played :(", "created_utc": "1594773670.0", "edited": "False", "id": "fy3ghgj", "is_submitter": "False", "link_id": "t3_hac8m3", "parent_id": "t1_fy3e3p6", "score": "1", "subreddit": "ps3homebrew", "subreddit_id": "t5_2s9jx"}, {"author": "antoine_vicheff", "body": "I’m using the ntsc", "created_utc": "1594773115.0", "edited": "False", "id": "fy3fil1", "is_submitter": "False", "link_id": "t3_hrc5e2", "parent_id": "t1_fy3e1fe", "score": "1", "subreddit": "ps3homebrew", "subreddit_id": "t5_2s9jx"}, {"author": "antoine_vicheff", "body": "Hey! How did you install the game exactly? I am having trouble getting past the intro, it keeps freezing. I’m using the Rebug Lite version", "created_utc": "1594772129.0", "edited": "False", "id": "fy3dt0e", "is_submitter": "False", "link_id": "t3_hac8m3", "parent_id": "t3_hac8m3", "score": "1", "subreddit": "ps3homebrew", "subreddit_id": "t5_2s9jx"}, {"author": "antoine_vicheff", "body": "Could there be any missing files that I need to install? Or maybe the ISO is defective? I don’t have a PS2, I’ve played every other Gran Turismo, this is the only one I hadn’t conquered yet and I won’t be able to conquer it if I can’t even get past the intro.", "created_utc": "1594770515.0", "edited": "False", "id": "fy3b01c", "is_submitter": "False", "link_id": "t3_hrc5e2", "parent_id": "t1_fy38ywx", "score": "1", "subreddit": "ps3homebrew", "subreddit_id": "t5_2s9jx"}, {"author": "antoine_vicheff", "body": "I tried that, didn’t work...", "created_utc": "1594769646.0", "edited": "False", "id": "fy39lkb", "is_submitter": "False", "link_id": "t3_hrc5e2", "parent_id": "t1_fy38ywx", "score": "1", "subreddit": "ps3homebrew", "subreddit_id": "t5_2s9jx"}]