[{"author": "archaicCinnamon011", "body": "I’m a big Tamil fan, it has such rich history, a beautiful script, and it really sounds beautiful. I also like languages with SOV order so that helps. It’s harder to find resources and it’s more of my side project than a main target language, but certainly an underrated and beautiful language with a lot of speakers", "created_utc": "1659739417.0", "edited": "False", "id": "ij46omg", "is_submitter": "False", "link_id": "t3_wh44xu", "parent_id": "t3_wh44xu", "score": "9", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "archaicCinnamon011", "body": "I’m from a Chicago suburb and Indian languages are probably the most useful here (besides Spanish). You hear a lot of people speaking Hindi but also Gujarati and Tamil and a variety of others. Having said that, most people do speak some degree of English and have their kids translate what they don’t get, so it might not be as useful as it would seem (though I’m sure you could meet more people and communicate with different communities depending on the language). Polish is also a more useful language than you’d think due to the Polish immigrant population in Chicago, but it becomes more useful the closer to the actual city you get.", "created_utc": "1657573971.0", "edited": "False", "id": "ifrupx3", "is_submitter": "False", "link_id": "t3_vwlm4k", "parent_id": "t3_vwlm4k", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "archaicCinnamon011", "body": "Hey dude, I love your site and have been using it for a bit now. Hope you see this even though it’s on an old post, but I just wanted to let you know that it’s been having issues the last couple of days. Doesn’t matter the media or the device, when I click on the play button it shows up as 0:00. Nothing’s been playable, so I was just wondering if you were gonna fix that soon. Thanks for your work!", "created_utc": "1651893485.0", "edited": "False", "id": "i7mwxl0", "is_submitter": "False", "link_id": "t3_thnamz", "parent_id": "t3_thnamz", "score": "2", "subreddit": "IllegalLifeProTips", "subreddit_id": "t5_3l99h"}, {"author": "archaicCinnamon011", "body": "The US education system just doesn’t fit with language learning. Studying from textbooks isn’t going to get the majority of people far in a language, as people have different ways of learning. Also, classes only go as fast as their slowest student.", "created_utc": "1555872192.0", "edited": "False", "id": "elfwfmn", "is_submitter": "False", "link_id": "t3_bfe1hb", "parent_id": "t3_bfe1hb", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "archaicCinnamon011", "body": "Oops sorry this is late, I keep forgetting to turn on notifications for Reddit! In terms of a podcast between innerFrench and native podcasts, I don’t really know of anything. Personally, I just started with native content after innerFrench (and native youtube with only French subtitles, which I highly suggest you do). I just recommend listening to native content now, and listening to a singular episode (or part of an episode, if that’s too much) multiple times. Sure, it’s tedious, but it really does help in the long term. Also, some podcast apps let you adjust the speed for the episode, so you could try slowing down difficult parts of native podcasts if listening multiple times doesn’t work. Good luck!", "created_utc": "1547593914.0", "edited": "False", "id": "ee5mfp9", "is_submitter": "False", "link_id": "t3_afa1nt", "parent_id": "t1_edydasz", "score": "3", "subreddit": "French", "subreddit_id": "t5_2rd5t"}, {"author": "archaicCinnamon011", "body": "The new update is working great!! Thanks for adding the filter feature!", "created_utc": "1547347241.0", "edited": "False", "id": "edy1wue", "is_submitter": "False", "link_id": "t3_aeermd", "parent_id": "t1_edvlhll", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "archaicCinnamon011", "body": "Yep that’s exactly it! Once I got to a certain point, I just wasn’t learning anything new anymore. I still listen from time to time, but I learn more new things by listening to native content. I still totally recommend innerFrench though, because without having used it to learn the sounds of the French language at a reasonable pace, I probably wouldn’t be able to listen to native content like I do now", "created_utc": "1547346846.0", "edited": "False", "id": "edy1e40", "is_submitter": "False", "link_id": "t3_afa1nt", "parent_id": "t1_edy0pzk", "score": "5", "subreddit": "French", "subreddit_id": "t5_2rd5t"}, {"author": "archaicCinnamon011", "body": "It’s not that I don’t enjoy it, it’s just fairly easy to understand now. I don’t need it as much as I used to, as I can now understand a lot of native podcasts", "created_utc": "1547346261.0", "edited": "False", "id": "edy0n6c", "is_submitter": "False", "link_id": "t3_afa1nt", "parent_id": "t1_edxrv5n", "score": "3", "subreddit": "French", "subreddit_id": "t5_2rd5t"}, {"author": "archaicCinnamon011", "body": "One podcast that I used to enjoy was innerFrench, which is a podcast aimed at French learners entirely in French. I don’t know how much it would be useful to you as it’s targeted towards an intermediate level more than an advanced level, but I decided to comment it just in case it benefits anyone", "created_utc": "1547326200.0", "edited": "False", "id": "edx5axg", "is_submitter": "False", "link_id": "t3_afa1nt", "parent_id": "t3_afa1nt", "score": "42", "subreddit": "French", "subreddit_id": "t5_2rd5t"}, {"author": "archaicCinnamon011", "body": "That sounds like a wonderful idea to me! I know that I personally would benefit from that, and I’m sure many others would as well", "created_utc": "1547267712.0", "edited": "False", "id": "edv9bs1", "is_submitter": "False", "link_id": "t3_aeermd", "parent_id": "t1_eduixj7", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "archaicCinnamon011", "body": "Wow I really like your app! It’s exactly what I’ve been looking for, as I can now read the news without having to pause to look up new words. It’s also pretty simple to use, which is nice. The only thing I think you should add (and correct me if I’m wrong, I only downloaded your app like ten minutes ago so maybe there is a way to do this) is a way to separate the vocabulary by language. In the vocabulary list, it all shows up in one area, which can be a little confusing when languages look similar. Other than that though, this app seems wonderful. Thanks!", "created_utc": "1547167948.0", "edited": "False", "id": "edrgisc", "is_submitter": "False", "link_id": "t3_aeermd", "parent_id": "t3_aeermd", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "archaicCinnamon011", "body": "I’m from the Chicagoland area, and I occasionally do all of these except for the omission of the t in mental. That one just sounds odd to me, but idk if that’s just something I’m not used to. Also, it’s not as though you have to pronounce these words in this fashion, there are a lot of people who don’t pronounce them like that and it sounds perfectly normal", "created_utc": "1544130908.0", "edited": "False", "id": "eb8phbv", "is_submitter": "False", "link_id": "t3_a3mer6", "parent_id": "t3_a3mer6", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "archaicCinnamon011", "body": "I'm in the Chicagoland area, and there are a lot of Polish speakers around here. There's also many Indian immigrants, many of who speak Hindi or Gujarati. I'm Polish myself, but I don't speak the language. And some friends have tried to teach me Hindi, but I've never gotten far.", "created_utc": "1524334489.0", "edited": "False", "id": "dxqpljp", "is_submitter": "False", "link_id": "t3_8dtojc", "parent_id": "t3_8dtojc", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}]