[{"author": "ArkhanLahyet", "body": "French, because it has a good amount of shared vocabulary with those two, and the grammar will also be relatively familiar.\n\nBut of course, what matters the most is what *you* want to learn.", "created_utc": "1666889897.0", "edited": "False", "id": "iu0dzd1", "is_submitter": "False", "link_id": "t3_yex27p", "parent_id": "t3_yex27p", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "ArkhanLahyet", "body": "The wrm maglev is the same as the regular weilong wrm, except that it has opposing magnets instead of springs, and has purple internals.\n\nThat makes the cube faster, a bit looser, but there are more similarities than differences. The maglev version becomes very stiff with tight tensions.\n\nA while ago I wrote [an article about the difference between springs and maglev here](https://www.reddit.com/r/Cubers/comments/rmklzx/maglev_and_other_falsehoods/); it's a bit long, but do read if you want details.", "created_utc": "1666889282.0", "edited": "False", "id": "iu0cd3k", "is_submitter": "False", "link_id": "t3_yej0te", "parent_id": "t1_itzrgji", "score": "2", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "ArkhanLahyet", "body": "If you're getting an H-perm it means the orientation is wrong.\n\nYou only need to look at two sides. Look for the outer corner with a color that only appears once, and that side goes in front.\n\nAlternatively, look at the corner in the middle; the side with a color that only appears once goes on the side.", "created_utc": "1666888759.0", "edited": "False", "id": "iu0azsr", "is_submitter": "False", "link_id": "t3_yej0te", "parent_id": "t1_iu07v5y", "score": "3", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "ArkhanLahyet", "body": "That's interesting, we do that sometimes over at r/brasil (like cimavoto = upvote)", "created_utc": "1666720435.0", "edited": "False", "id": "itr1fv9", "is_submitter": "False", "link_id": "t3_yd8m0l", "parent_id": "t1_itqx38l", "score": "40", "subreddit": "French", "subreddit_id": "t5_2rd5t"}, {"author": "ArkhanLahyet", "body": "Any kind of media you like! TV shows, videogames, novels, internet articles, cooking channels, as long as you make English part of your routine. Usually, media related to topics you're interested in will be easier to follow along and understand.\n\nTo me, language learning isn't something you do in order to reach the goal of fluency, it's something you do as you use the language in your everyday life. That is to say, rather than always looking for the *path to fluency*, it's worth your while to sit down and enjoy the view. Your English is already very good and you can do a lot of things with it :)", "created_utc": "1666700742.0", "edited": "False", "id": "itppysv", "is_submitter": "False", "link_id": "t3_ycmokp", "parent_id": "t1_itn949p", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "ArkhanLahyet", "body": "Doesn't everyone think their own language is very hard? For example, there's that English poem \"The Chaos\" that's about English spelling being very irregular.\n\nIt's only natural, because your native language is the one you know best, so people are unfamiliar with the troubles of learning other languages. Multiple times I've heard people say that English is easier than Spanish because the grammar is easier, but they wouldn't be saying that if they tried to compare reading the Lord of the Rings to Don Quixote.\n\nTo me, a big part of it is that Brazilians look at languages like English and see that it lacks grammatical features that make Portuguese difficult, so they (incorrectly) assume that other languages are easier. It's part of the reason why people think that Latin is super difficult to learn, since everything conjugates more. But it's important to remember that different languages are \"complicated\" in different ways; I think it comes down to lack of familiarity with other languages, and that makes you miss the other ways in which language can be complicated. For example, some English words change stress when they're a verb vs. when they're a noun (ex.: **per**mit / per**mit**, **pre**sent / pre**sent**).\n\nFurthermore, the distance between the formal and casual forms of the language varies a lot, but that's not really an indication of which languages are difficult. It may be noticeable in Portuguese, but it's probably much, much larger in Arabic and Japanese and plenty others.\n\nIt might have a bit to do with people in Brazil wanting to think they're unfortunate to have to learn the language. But again, that's nothing special to Portuguese. It's got a similar feeling as to when people share bad statistics of their own country as a way to point out that things need to change.\n\nIn short, I don't think people would be using these points as reasons why Portuguese is hard if they were more familiar themselves with other languages. After a while you come to understand that all languages have about the same level of complexity and are all equally expressive.", "created_utc": "1666649390.0", "edited": "False", "id": "itnaml6", "is_submitter": "False", "link_id": "t3_yckhgn", "parent_id": "t3_yckhgn", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "ArkhanLahyet", "body": "My suggestion is to stress less about reaching \"fluency\" and shift your focus to using what you already know of the language.\n\nSitting down to study starts to make less of a difference at C1 and C2 in my opinion, because these later levels cover *everything*. Right now you should use the language to do the things you like, and you'll naturally become more comfortable with the language by being in contact with it. How do you know what to say in each situation, and which words to use? It's because you remember what other people normally say in that situation.\n\nFurthermore, if you're not making progress in your studies, that's a sign that you need more exposure; studying will continue to be useful for remembering and understanding all the things you see and hear in your target language, but first you need exposure to be able to make those connections.", "created_utc": "1666647089.0", "edited": "False", "id": "itn55od", "is_submitter": "False", "link_id": "t3_ycmokp", "parent_id": "t3_ycmokp", "score": "9", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "ArkhanLahyet", "body": "Putting the world border right in front of the beach would be just mean. I hope we get to go there eventually.", "created_utc": "1666645811.0", "edited": "False", "id": "itn1y6e", "is_submitter": "False", "link_id": "t3_ycmgw1", "parent_id": "t3_ycmgw1", "score": "32", "subreddit": "Genshin_Impact_Leaks", "subreddit_id": "t5_3l2acu"}, {"author": "ArkhanLahyet", "body": "dá uma visitada lá no r/Cubers. É um hobby comparativamente barato.", "created_utc": "1665591736.0", "edited": "False", "id": "is1dgh2", "is_submitter": "False", "link_id": "t3_y1raf9", "parent_id": "t3_y1raf9", "score": "1", "subreddit": "conversas", "subreddit_id": "t5_hwfuo"}, {"author": "ArkhanLahyet", "body": "I commented this elsewhere, but yeah, it's problematic to say that Latin is the most influential language in the modern world because that's kind of the same as saying that a certain period of European history is the most important in the world.\n\nIt's the same kind of thinking that makes Classical Music (or \"the harmonic style of 18th century European musicians\" as Adam Neely puts it) be a requirement for people who want a degree in music, even if they're only interested in jazz or heavy metal.", "created_utc": "1665421973.0", "edited": "False", "id": "irs7g5x", "is_submitter": "False", "link_id": "t3_y0i94n", "parent_id": "t1_irs4bc0", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "ArkhanLahyet", "body": "I take issue with OP's assertion that Latin is the most important language in history. You could just as well want to study Classical Arabic for reading the Quran, or Koine Greek for the New Testament. Maybe I want to learn Sanskrit or Pali to read ancient Buddhist texts that are important to me. Can you say that these endeavors would be worth less than studying Latin?\n\nWhat I mean is, claiming that Latin is more important than other languages is similar to claiming that a certain period of European history is more relevant than other periods of other regions of the world, and that's not a given.\n\nWhile I agree that it's unfair to say that \"learning Latin is a waste of time\", it also doesn't look that good with opportunity cost in mind. It's hard to make the argument that learning Latin is *more* useful and productive than learning a modern language, and people only have so much time and effort to spend. If it's worth it to *you*, then of course you should learn it, but that doesn't extend to other people who may want to study something else instead, like some other language for doing something else.", "created_utc": "1665421450.0", "edited": "False", "id": "irs65j5", "is_submitter": "False", "link_id": "t3_y0i94n", "parent_id": "t3_y0i94n", "score": "25", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "ArkhanLahyet", "body": "Right? Upvotes and other social-media-imaginary-points aren't so reliable like everyone wishes they were. It depends a lot on how many people get hooked on the post and click on it. Pictures tend to do better just because it's easier to look at.", "created_utc": "1665316673.0", "edited": "False", "id": "irmhsto", "is_submitter": "False", "link_id": "t3_xzd0ca", "parent_id": "t1_irlz2ru", "score": "3", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "ArkhanLahyet", "body": "I remember Jadzia making such a remark at the start of the series; I looked it up and it happens in \"A Man Alone\", at around 13 minutes in:\n\n>BASHIR: I guess I know the competition now. (snarky)  \n>  \n>DAX: What are you talking about, Julian?  \n>  \n>BASHIR: Well, did you have a nice dinner with Commander Sisko? (being sarcastic)  \n>  \n>DAX: Julian, Trills do not look for romance the same way humans do. In fact, we find it quite a nuisance.  \n>  \n>BASHIR: Wha– a *nuisance*? (moves in front of Dax)  \n>  \n>DAX: It's a weakness of the young, and although a Trill host may have these... *feelings* occasionally, it is our wish to live in a higher plane, to try to rise above these kinds of temptations.  \n>  \n>BASHIR: Ah– You said, *try* to rise above, which suggests you don't always succeed. (smiles)  \n>  \n>DAX: Julian... (annoyed)\n\nAdmittedly, in retrospect that was probably Jadzia trying to avoid Bashir, and the rest of the series does not go that way.", "created_utc": "1665315245.0", "edited": "False", "id": "irmfqre", "is_submitter": "False", "link_id": "t3_xz8l6k", "parent_id": "t1_irmcpwi", "score": "6", "subreddit": "DaystromInstitute", "subreddit_id": "t5_2whek"}, {"author": "ArkhanLahyet", "body": "Acontece comigo, acho que a falta de contato com material escrito é parte da causa. Quando eu estava no ensino médio e lia e escrevia o tempo todo eu não tinha problemas para lembrar da grafia das palavras ou da gramática. Foi piorando ao longo da faculdade e agora eu dependo do autocorretor para escrever palavras como \"estender\". Sem contar que a grafia das palavras em inglês contribui em misturar as coisas.", "created_utc": "1665282160.0", "edited": "False", "id": "irl4t6t", "is_submitter": "False", "link_id": "t3_xz8s23", "parent_id": "t3_xz8s23", "score": "2", "subreddit": "conversas", "subreddit_id": "t5_hwfuo"}, {"author": "ArkhanLahyet", "body": "The term \"symbiont\" and the extent of the link suggest to me that the two species must have coexisted for a long time rather than having become interdependent during their modern history. My take on this is that a natural process must exist for their joining, but which is avoided by the Trill.\n\nThis avoidance may be because the original process involved some risk of death or permanent damage for those involved; Or maybe it was simply painful, time-consuming or otherwise inconvenient.\n\nCompare human childbirth, which is a painful process that nonetheless remained present even during a time when the technology to make it more convenient surely must have existed. I think it's reasonable to assume that humans chose to keep the pain of childbirth out of tradition, because they still think it's meaningful.\n\nGiven that Trill culture at the time of DS9 doesn't encourage romance, it makes sense to me that they wouldn't attach \"meaning\" to their natural processes, and thus be more willing to replace the natural joining with a safer and more convenient surgical procedure.\n\nThis is somewhat of an extrapolation, though. Who knows what happened in the millenia of Trill history that we don't get to see.", "created_utc": "1665280920.0", "edited": "False", "id": "irl2c0s", "is_submitter": "False", "link_id": "t3_xz8l6k", "parent_id": "t3_xz8l6k", "score": "9", "subreddit": "DaystromInstitute", "subreddit_id": "t5_2whek"}, {"author": "ArkhanLahyet", "body": "That happens in many languages, when people borrow technical, poetic or \"more refined\" terms from another language.\n\nIn Japanese, about half of the words you find in a dictionary are of Chinese origin (they're called _kango_), but in everyday conversations the proportion of kango is much smaller. That's similar to how a huge proportion of English vocabulary is of Latin origin, but you find few of them among the most commonly used English words. In both cases, the foreign words were introduced to the formal register of each language because more educated people were more likely to be in contact with the common language of the time, in which more \"refined\" literature and research was written.\n\nHowever, borrowing (loanwords) isn't restricted just to the formal register, but depends on historical context; like how a lot of vocabulary we use in classical music is of Italian origin and our names for cooked meats are from French while a lot of more scientific terms are of Latin origin because Latin was used for scientific publications for a long time. On the other hand, other languages around the world use English vocabulary more colloquially in the informal register due to a perception that English vocabulary sounds more \"modern\".\n\nThe circumstances of how different languages interact and influence one another leaves different marks on them, so you'll find many unique ways in which vocabulary was borrowed in different languages. The indigenous loanwords in Portuguese tell a story, the Arabic vocabulary in Turkish tells a story, the Slavic words in Romanian tell a story, and so on.", "created_utc": "1665163983.0", "edited": "False", "id": "irfdl7m", "is_submitter": "False", "link_id": "t3_xy2lzu", "parent_id": "t3_xy2lzu", "score": "27", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "ArkhanLahyet", "body": "Sim, com uma perninha dobrada no 深 (diferente da sua imagem, por isso eu comentei)", "created_utc": "1665065734.0", "edited": "False", "id": "ira7mo5", "is_submitter": "False", "link_id": "t3_xvv5s2", "parent_id": "t1_ira6qt7", "score": "1", "subreddit": "Idiomas", "subreddit_id": "t5_u3gok"}, {"author": "ArkhanLahyet", "body": "Isso depende da língua que vc quer escrever.\n\n[https://i.imgur.com/D1rN6kU.png](https://i.imgur.com/D1rN6kU.png)\n\nE os outros comentários estão certos, a letra 深 vai em cima ao escrever na vertical.", "created_utc": "1665065249.0", "edited": "False", "id": "ira6htw", "is_submitter": "False", "link_id": "t3_xvv5s2", "parent_id": "t1_ira5286", "score": "1", "subreddit": "Idiomas", "subreddit_id": "t5_u3gok"}, {"author": "ArkhanLahyet", "body": "Só um aviso, o jeito que se escreve a letra 深 depende da língua. Em japonês o amigashira (㓁) tem uma perninha dobrada; eu acho (não tenho certeza) que em chinês ele só se escreve com as perninhas retas em hanzi simplificado, mas aí a segunda letra devia ser 渊.\n\nSe vc colocar no [Google Fonts](https://fonts.google.com/?subset=chinese-simplified&preview.text=%E6%B7%B1%E6%B7%B1%E6%B7%B1&preview.text_type=custom), a aparência da letra 深 depende se a fonte é para chinês simplificado.", "created_utc": "1665064437.0", "edited": "False", "id": "ira4nma", "is_submitter": "False", "link_id": "t3_xvv5s2", "parent_id": "t3_xvv5s2", "score": "1", "subreddit": "Idiomas", "subreddit_id": "t5_u3gok"}, {"author": "ArkhanLahyet", "body": "Specifically for looking up Japanese words in a dictionary, I recommend using an app like Takoboto or Yomiwa where you can show the definitions in multiple languages.\n\nWhen you get more advanced, I suggest relying more on Kotobank and other monolingual ditionaries, because bilingual dictionaries tend to miss the nuances of words.\n\nIn terms of content for language learning, English has more resources for Japanese in general, but I don't see a reason to limit yourself to just English. It's not like learning French from English materials as a Spanish speaker, where people explain things like the subjuntive mode that are already natural to you.", "created_utc": "1665061879.0", "edited": "False", "id": "ir9z3b7", "is_submitter": "False", "link_id": "t3_xw2avu", "parent_id": "t1_ir89cqz", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "ArkhanLahyet", "body": "In Portuguese it means \"bad luck\".", "created_utc": "1665058520.0", "edited": "False", "id": "ir9sk6u", "is_submitter": "False", "link_id": "t3_xx262c", "parent_id": "t1_ir9qj7o", "score": "8", "subreddit": "Genshin_Impact_Leaks", "subreddit_id": "t5_3l2acu"}, {"author": "ArkhanLahyet", "body": "Recently I spring-swapped my MGC 6x6 for the weak ones.\n\nEver since I got the cube, I was never quite satified with it; it felt noticeably slower, heavier to turn and less stable in comparison to other MGC cubes. Maybe it was my own fault for overlubing it, but taking it apart to clean didn't make much of a difference.\n\nSwapping the springs with the weaker ones made it a lot better and allowed me to tighten it more without losing speed, and now it feels much more in line with the MGC 5 and the MGC 7 in terms of speed.", "created_utc": "1664905884.0", "edited": "False", "id": "ir1ltmn", "is_submitter": "False", "link_id": "t3_xv5xrk", "parent_id": "t3_xv5xrk", "score": "4", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "ArkhanLahyet", "body": "To be fair, the MGC lineup remains top tier and it'll be a while until they become obsolete.", "created_utc": "1664902621.0", "edited": "False", "id": "ir1d74y", "is_submitter": "False", "link_id": "t3_xv5xrk", "parent_id": "t1_ir0wp52", "score": "1", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "ArkhanLahyet", "body": "Both the RS3M 2020 and the Meilong 3M have stickerless and black plastic versions. Personally, I'd go with the RS3M.", "created_utc": "1664901412.0", "edited": "False", "id": "ir19zsf", "is_submitter": "False", "link_id": "t3_xv5xrk", "parent_id": "t1_ir16l88", "score": "5", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "ArkhanLahyet", "body": "Unfortunately that's just the way it is; as you step up, big cubes get heavier to hold and to turn, and corner cut less, especially in comparison to super light 3x3s like the Gan flagships.\n\nGenerally speaking, you'll notice the most jarring differences when stepping up to 4x4 and 6x6 because that's when the mechanism gets more complex and requires you to turn more accurately.\n\nLike, 3x3 is amazing to turn and the mechanisms can be incredibly flexible, and 2x2 is just as good because it uses the same mechanism with only the corners exposed. But 4x4 and 5x5 (which have similar inner mechanisms) can never be as flexible as a 3x3 since they need so many more pieces in order to work. 6x6 and 7x7 are another big step, where the cube is noticeably easier to pop.\n\nPart of it is adapting to a different turning style, as fewer and fewer 3x3 fingertricks will work as you move up through the big cubes. To me, 4x4 is kind of an awkward middle step where a lot of 3x3 movement works but doesn't feel as good.\n\nAlso, if you like fast and snappy turns, both the MGC and the Zhilong mini have stronger magnets than the Aosu WR M, you just shouldn't expect the same kind of fluid movement that you can get on 3x3.", "created_utc": "1664805963.0", "edited": "False", "id": "iqvutvm", "is_submitter": "False", "link_id": "t3_xua26a", "parent_id": "t1_iqux69k", "score": "3", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "ArkhanLahyet", "body": "Just in case anybody wants to know, the \"chan\" in \"Gan 12 Chan\" means cicada (蝉). Which is why the box and artwork have cicadas everywhere.", "created_utc": "1663771672.0", "edited": "False", "id": "ipc5j12", "is_submitter": "False", "link_id": "t3_xjvehn", "parent_id": "t3_xjvehn", "score": "10", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "ArkhanLahyet", "body": "I don't mean to sound rude, but:\n\nDF describes system**s** of inputs and responses, and it changed **the** way **I** see things.\n\nIs that from a book?", "created_utc": "1663690889.0", "edited": "False", "id": "ip7mlwv", "is_submitter": "False", "link_id": "t3_xiyoei", "parent_id": "t3_xiyoei", "score": "3", "subreddit": "lowlevelaware", "subreddit_id": "t5_3754r"}, {"author": "ArkhanLahyet", "body": "私が知っている限り、分母に出る単位をそれぞれ \"per unit\" と読むこともあれば、全部 \"per\" の後で読むこともある。例えば \"Kilogram per meter per second squared\" もしくは \"kilogram per meter second squared\" どっちでも kg/(m⋅s²) になります。", "created_utc": "1661449056.0", "edited": "False", "id": "ilre7fq", "is_submitter": "False", "link_id": "t3_wxaq3i", "parent_id": "t3_wxaq3i", "score": "3", "subreddit": "lowlevelaware", "subreddit_id": "t5_3754r"}, {"author": "ArkhanLahyet", "body": "Indeed, the corner-edge magnets don't align correctly when the corners are popped out.\n\nHowever, I've kept mine like that deliberately because I like it better with weak magnets :)", "created_utc": "1659231000.0", "edited": "False", "id": "iibubdf", "is_submitter": "False", "link_id": "t3_wbpa6w", "parent_id": "t1_iibqdad", "score": "1", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "ArkhanLahyet", "body": "It's a bit of work, but what I did was stick pieces of transparent tape over the cube and write on the tape with a permanent marker (tip: write the letters on the tape beforehand, just to be safe). It may leave some residual glue on the cube, but you can clean that off with rubbing alcohol.", "created_utc": "1659224173.0", "edited": "False", "id": "iibgcbn", "is_submitter": "False", "link_id": "t3_wbpa6w", "parent_id": "t1_iib1noa", "score": "1", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "ArkhanLahyet", "body": "It's okay. I've made a post before [here](https://www.reddit.com/r/Cubers/comments/t78wc9/mail_day_heres_some_cubes_that_werent_good_out_of/?utm_source=share&utm_medium=web2x&context=3) detailing my thoughts on it. I'm currently using mine with green springs on 0.6, lubed with mystic.\n\nOne thing that's curious about it is that, just like the v1, its corners can be pushed in and that makes the magnets feel much stronger. It's not a setting or anything, just seems like a problem in its design. So if you'd like the cube to be more stable, you can push the corners in until they click in place.", "created_utc": "1659223716.0", "edited": "False", "id": "iibfek6", "is_submitter": "False", "link_id": "t3_wbpa6w", "parent_id": "t1_iibb0rf", "score": "1", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "ArkhanLahyet", "body": "To summarize:\n\n* v1 has the older nuts that you screw into a threaded core; it's less convenient to change springs because to have to unscrew it completely, but it's better for fine-tuning the axis distance since you only get 0.6 and 0.8 on the v2 (I think even 0.6 is too loose, especially for the default purple strings).\n* Both of them have a problem where the corners seem a bit larger than the other pieces so the cube looks uneven, but actually you can pop them in if you push them. Then the corners make a \"pop\" and the cube becomes stiffer, with much stronger magnets. The problem is that this happens more easily on the v2, even during solves. I fixed mine by [by putting bits of paper inside the corners](https://www.reddit.com/r/Cubers/comments/uulrn9/comment/i9fwdxh/?utm_source=share&utm_medium=web2x&context=3).\n* The v2 has a frosted surface. It gets smoother over time, but at least mine never became as grippy as my v1.\n\nThere are more similarities than differences; they feel very similar, with the same piece design and same center caps, exact same size including the uneven corners, and they weight almost the same.", "created_utc": "1655744618.0", "edited": "False", "id": "id2urf2", "is_submitter": "False", "link_id": "t3_vgdfni", "parent_id": "t1_id2olu1", "score": "2", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "ArkhanLahyet", "body": "Some stores sell the 354 v2 with GES nuts, they call it the \"explorer\" edition. I got mine with GES nuts and I agree that the purple springs are too weak. Overall I like the v1 better.", "created_utc": "1655728892.0", "edited": "False", "id": "id1x7t0", "is_submitter": "False", "link_id": "t3_vgdfni", "parent_id": "t1_id1ibpk", "score": "5", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "ArkhanLahyet", "body": "Ah, eles nem tocam música ruim, é música popular mesmo, eu só queria dormir rs\n\nÁs vezes eles fazem festa de aniversário e cantam parabéns umas seis vezes ao longo da madrugada, vai saber por quê.\n\nPor aqui (pelo menos na região onde eu moro) não é tão comum ter ar condicionado nas casas, muito menos algum sistema de aquecimento já que raramente faz tanto frio. Quando faz muito calor no verão, eu só deixo as janelas fechadas que a casa continua fresca por dentro, e abro quando começa a esfriar do lado de fora.", "created_utc": "1655316082.0", "edited": "False", "id": "iche13x", "is_submitter": "False", "link_id": "t3_v7ict4", "parent_id": "t1_icfbbkp", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "ArkhanLahyet", "body": "I don't use tools very often, but I like the one at [mattsploration](https://mattsploration.com/cubing/2-sided-pll-recognition-trainer/) for the sheer simplicity of it.\n\nThe trainer at [speedcubedb](https://speedcubedb.com/t/pllrecog) is nicer and you can choose which cases you get, but I don't like that it requires you to interact by clicking buttons.\n\nNormally I just rely on just my untimed solves to practice recognition.", "created_utc": "1654885379.0", "edited": "False", "id": "ibvuzq8", "is_submitter": "False", "link_id": "t3_v8zyc7", "parent_id": "t1_ibvopml", "score": "1", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "ArkhanLahyet", "body": "Alguém a fim de uma conversa bilíngue? Sintam-se livres pra responder em qualquer língua na minha flair.\n\nEu preciso trocar a minha janela por uma antirruído. Meus vizinhos ficam fazendo festa de magrugada e não dá pra dormir kk\n\nSem contar que a minha janela tá meio torta e deixa passar vento, e olha que nem faz tanto frio onde eu moro. Não teria como sobreviver um inverno europeu com a infraestrutura que tem por aqui 🥶", "created_utc": "1654883336.0", "edited": "False", "id": "ibvqapd", "is_submitter": "False", "link_id": "t3_v7ict4", "parent_id": "t3_v7ict4", "score": "5", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "ArkhanLahyet", "body": "ikr  \nAfter the cases with blocks, the remaining cases don't look like they're logically connected to what the algorithm does. At that point it's just rote memorization to learn each case from each angle.", "created_utc": "1654880223.0", "edited": "False", "id": "ibviwum", "is_submitter": "False", "link_id": "t3_v8zyc7", "parent_id": "t1_ibv8r9o", "score": "1", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "ArkhanLahyet", "body": "I feel you. If it helps you in any way, one of the corners will have a color that only appears once, and that goes in front. But yeah, in actual solves it takes a while for that thought to happen.", "created_utc": "1654879719.0", "edited": "False", "id": "ibvhpq1", "is_submitter": "False", "link_id": "t3_v8zyc7", "parent_id": "t1_ibv8mic", "score": "3", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "ArkhanLahyet", "body": "2-sided recognition for A, R and G perms is taking me forever to get good at. I study them everyday but they still take me longer than anything else to recognize.\n\nWhat PLLs do you guys struggle to recognize?", "created_utc": "1654871169.0", "edited": "False", "id": "ibuxe06", "is_submitter": "False", "link_id": "t3_v8zyc7", "parent_id": "t3_v8zyc7", "score": "2", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "ArkhanLahyet", "body": "Normalmente quem cai nesses golpes é gente que chegou na internet faz pouco tempo. Quem teve o privilégio de crescer na internet e ser enganado enquanto não tinha dinheiro pra perder, aprendeu. Não é muito diferente de turista sendo enganado quando chega num país por não saber do que desconfiar.\n\nE fora o fato de que a televisão está interessada em desmerecer a internet, obviamente. A tv vai te dizer que as pessoas ainda confiam mais nela do que na internet. Mas o que não falta na tv é canais cheios de horóscopo, homeopatia, propaganda de óleo que cura câncer. Não acho que a internet seja tão diferente assim, só é maior e mais acessível.", "created_utc": "1654788087.0", "edited": "False", "id": "ibqokyw", "is_submitter": "False", "link_id": "t3_v8g86d", "parent_id": "t3_v8g86d", "score": "2", "subreddit": "conversas", "subreddit_id": "t5_hwfuo"}, {"author": "ArkhanLahyet", "body": "Aprendi faz vários anos já; uma coisa que surpreendentemente me ajudou muito foi fazer aulas de teclado (de piano), pois lá que eu obtive a disciplina de usar todos os dedos. Depois disso, usar todos os dedos para digitar foi praticamente natural.\n\nHoje eu não toco mais piano (deixei esse hobby de lado com o tempo), mas saber digitar sem olhar para o teclado é uma habilidade que valeu a pena obter, pois faz vários anos que trabalho digitando o dia todo. Não consigo imaginar fazer o meu trabalho tendo que olhar para o teclado.\n\nAcabei de fazer um teste online qualquer e deu 76wpm com 99% de acurácia. Mas na minha opinião a maior vantagem não é a velocidade, mas sim poder olhar para o texto conforme você escreve para corrigir os erros imediatamente e pensar nas palavras, não nas teclas. Assim a tarefa de digitar se torna mais natural e bem menos cansativa.", "created_utc": "1654787163.0", "edited": "False", "id": "ibqmfrl", "is_submitter": "False", "link_id": "t3_v8h9ep", "parent_id": "t3_v8h9ep", "score": "2", "subreddit": "conversas", "subreddit_id": "t5_hwfuo"}, {"author": "ArkhanLahyet", "body": "Sadly, [it does not fit.](https://i.imgur.com/lPHn0hM.jpg)\n\nThe edges are shaped differently, [here's a comparison.](https://i.imgur.com/0Bda2bK.jpg)", "created_utc": "1654724660.0", "edited": "False", "id": "ibnr177", "is_submitter": "False", "link_id": "t3_v7hd6b", "parent_id": "t1_ibnj9d9", "score": "1", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "ArkhanLahyet", "body": "Isso depende, geralmente quando eu não consigo escolher um filme pra assistir é pq eu nem tô a fim de assistir nada. Mesma coisa com livro, série, etc. Aí eu deixo tudo de lado e vou relaxar sem fazer nada mesmo, ou vou estudar que logo dá vontade de fazer outra coisa rs\n\nMas às vezes vc tem aquela sensação de querer assistir um filme sem saber qual é a melhor escolha, e isso é diferente. A gente costuma ficar pensando em \"o que vai valer mais o meu tempo livre\", lembro que alguém postou algo parecido sobre a [produtividade do lazer](https://www.reddit.com/r/brasil/comments/ic23z0/produtividade_do_lazer_arte_de_linhadotrem/). Nesses casos acho melhor escolher com o objetivo de experienciar algo e formar uma opinião, tipo \"não gostei do livro X por esses motivos\", ao invés de \"me arrependo de ter lido X porque meu tempo teria sido melhor gasto lendo Y\".", "created_utc": "1654718103.0", "edited": "False", "id": "ibnc73t", "is_submitter": "False", "link_id": "t3_v7vqsk", "parent_id": "t3_v7vqsk", "score": "1", "subreddit": "conversas", "subreddit_id": "t5_hwfuo"}, {"author": "ArkhanLahyet", "body": "Eu recuso, que é menos desagradável que cancelar.", "created_utc": "1654709364.0", "edited": "False", "id": "ibmrndi", "is_submitter": "False", "link_id": "t3_v7ua0i", "parent_id": "t3_v7ua0i", "score": "7", "subreddit": "conversas", "subreddit_id": "t5_hwfuo"}, {"author": "ArkhanLahyet", "body": "I got my Gan XS on the mail!\n\nIt's really similar to the other Gan cubes I have (who would've thought), with a smooth and tactile turn. It still has that scratchy \"new cube\" feel that's not necessarily better, but since it goes away with break-in, I always make sure to enjoy it while it's like that. Feels noticeably less stable after having used the 11 M Pro for some time; I get more lockups but fewer catches with the XS.\n\nStill using the factory lube - I feel like Mystic would be really nice, but I'm kinda worried that it's going to get into the magnet holes and oxidize and then it'll be a pain to clean. ^(I'm probably worrying too much.)\n\nApparently I got a \"lite\" edition, which came with a frosted, hinged box instead of the one that comes apart, and the outer packaging is softer, not hard cardboard. Aside from that there doesn't seem to be anything different.\n\nCuriously, this is the first time I get scratches out of the box on a Gan cube, and only on the center caps. [Picture](https://i.imgur.com/IsRQXmV.jpeg). The centers are also fully matte while the other pieces shine a little. Anyone get a similar experience?\n\nAnyway, if anyone wants to know the default settings, it's light blue nuts on 1, clear setting 2 steps from the top (= 2 clicks after the snap), and medium magnets.", "created_utc": "1654697501.0", "edited": "False", "id": "iblzwpl", "is_submitter": "False", "link_id": "t3_v7hd6b", "parent_id": "t3_v7hd6b", "score": "1", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "ArkhanLahyet", "body": "In my opinion, yes. A lot of 3x3 fingertricks work on it because it's the same size (56mm). For reference, my hands are 17cm in length and I find the Zhisu to be quite comfortable.", "created_utc": "1654521652.0", "edited": "False", "id": "ibd3pp4", "is_submitter": "False", "link_id": "t3_v5694q", "parent_id": "t1_ibd0s0x", "score": "1", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "ArkhanLahyet", "body": "MGC is the safe choice. The Zhisu mini is cheaper while being just as good, just might be too small depending on your hand size. I like the WRM a lot and it has the best colors, but not worth the price difference imo because the Zhisu is just as good.\n\nThey renamed the Zhisu mini to Zhilong at some point, so if you find a Zhilong mini 4x4, it's the same cube.", "created_utc": "1654464746.0", "edited": "False", "id": "ibaohyz", "is_submitter": "False", "link_id": "t3_v5694q", "parent_id": "t1_ibabudw", "score": "1", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "ArkhanLahyet", "body": "I haven't seen complaints about the gan 12 specifically, but you should know that neodymium magnets in general are more fragile than they look. I don't think it should break, just avoid removing the magnets and you should be fine.", "created_utc": "1654291899.0", "edited": "False", "id": "ib30ghd", "is_submitter": "False", "link_id": "t3_v3rtco", "parent_id": "t1_ib2qkg6", "score": "2", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "ArkhanLahyet", "body": "Unfortunately there isn't much you can do with a Rubik's brand... Adapting to a bad cube can actually lead to some bad practices that will work against you when you get a speed cube, like excessive regrips and wrist turns. Do consider getting a budget speedcube soon, as even a 4$ Meilong is better and will let you actually speedcube comfortably.\n\nWhether you can even tension your Rubik's brand depends on the specific Rubik's brand cube you've got, so you'll probably have to experiment. They've made several ranging from trash to kinda good.", "created_utc": "1654279031.0", "edited": "False", "id": "ib29r9v", "is_submitter": "False", "link_id": "t3_v3rtco", "parent_id": "t1_ib26aac", "score": "2", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "ArkhanLahyet", "body": "No, at least not for the reasons you would lube a spring core.\n\nMoyu's maglev cubes sometimes makes a squeaking sound that's caused by the magnet rubbing against the center piece, so putting some lube on the sides of the magnets solves the noise (mine never had this issue).\n\nOthewise, you don't need lube in the core because it doesn't have the typical friction from springs.", "created_utc": "1654278686.0", "edited": "False", "id": "ib2904a", "is_submitter": "False", "link_id": "t3_v3rtco", "parent_id": "t1_ib277m6", "score": "1", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "ArkhanLahyet", "body": "It's like asking why you would want more chocolate.\n\nIdk, I just want more cubes. I tell myself I'm a collector, but that's just an excuse to buy new stuff.\n\nI guess that's what a hobby is.", "created_utc": "1654179791.0", "edited": "False", "id": "iawydup", "is_submitter": "False", "link_id": "t3_v316tz", "parent_id": "t1_iawgwss", "score": "4", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "ArkhanLahyet", "body": "My two cents is that the RS only really works with strong magnets.\n\nIn my case, I magnetized mine with N42 2x4mm magnets and found them way too weak. [I posted my thoughts here in the past.](https://www.reddit.com/r/Cubers/comments/t78wc9/mail_day_heres_some_cubes_that_werent_good_out_of/) Long story short, use strong magnets unless you have spare springs.\n\nI find it hard to recommend self-magnetized cubes these days since so many good budget cubes are already magnetic. An option you have is adding extra magnets to an already magnetic cube, a lot of people do that with the RS3M 2020.", "created_utc": "1654179606.0", "edited": "False", "id": "iawxz0t", "is_submitter": "False", "link_id": "t3_v316tz", "parent_id": "t1_iawjt03", "score": "1", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "ArkhanLahyet", "body": "The MGC series is the safe choice for both.\n\nThe YJ Mini series is cheaper but just as good, it's just that the size might be too small, especially for the 5x5.", "created_utc": "1654177453.0", "edited": "False", "id": "iawte0r", "is_submitter": "False", "link_id": "t3_v316tz", "parent_id": "t1_iawrlmf", "score": "3", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "ArkhanLahyet", "body": "Cool, she'll be my vice-Xingqiu for abyss runs.", "created_utc": "1653918210.0", "edited": "False", "id": "iajl0rx", "is_submitter": "False", "link_id": "t3_v101k1", "parent_id": "t1_iajkgus", "score": "11", "subreddit": "Genshin_Impact_Leaks", "subreddit_id": "t5_3l2acu"}, {"author": "ArkhanLahyet", "body": "To be fair, if the product claims to be safe for use with plastics, it probably is. From the product page:\n\n>Lubricant with diverse application areas at all temperatures. With outstanding separation and lubrication properties, e.g. for metal/plastic pairings, high resistance to oxidation and low tendency to evaporate.\n\nJudging from the safety data sheet, it doesn't seem to contain hydrocarbons. Honestly I wish cubing lube included all that information too.\n\nBut I agree that you should buy lubes made specifically for cubes if possible; otherwise, Traxxas is known to be good for cubes.", "created_utc": "1653845261.0", "edited": "False", "id": "iag5wi3", "is_submitter": "False", "link_id": "t3_v042c7", "parent_id": "t1_iafwcbl", "score": "1", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "ArkhanLahyet", "body": "Was it difficult to open the edges?", "created_utc": "1653844435.0", "edited": "False", "id": "iag4324", "is_submitter": "False", "link_id": "t3_v02plh", "parent_id": "t3_v02plh", "score": "1", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "ArkhanLahyet", "body": "x, y and z move the entire cube in the same orientation as R, U and F respectively.", "created_utc": "1653609589.0", "edited": "False", "id": "ia4r4f4", "is_submitter": "False", "link_id": "t3_uxzzbe", "parent_id": "t1_ia4o845", "score": "4", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "ArkhanLahyet", "body": "I used to frequent a local Kumon a long time ago when I spoke 0 Japanese. It's good for starting out (especially for writing a lot) but gets repetitive pretty quickly. I told my parents I wanted to quit halfway, and continued studying with textbooks at home which I think was the right choice.\n\nI think the repetition-based approach is better suited for the mathematics course. But for languages I bet it heavily depends on who the instructors are. The local Kumon I used to frequent was run by native Japanese speakers, so they gave me constant feedback on my Japanese and talked to me in Japanese all the time, but the English students had to bear with their super thick accent. The printed material by itself doesn't teach that much.", "created_utc": "1653594375.0", "edited": "False", "id": "ia3t61e", "is_submitter": "False", "link_id": "t3_uyd8r8", "parent_id": "t3_uyd8r8", "score": "8", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "ArkhanLahyet", "body": "So, the Gan 354 V2 has [corners that stick out a bit more than the edges](https://i.imgur.com/keIZylA.jpeg). Pushing them in makes them pop and become flush with the edges, and that also makes the cube much stiffer and the magnets stronger.\n\nThat would be nice as a hidden setting, but the corners tend to pop in and out during solves, and that made me not want to use this cube as much. So I decided to open the corners to see how they're built and see if I could fix them.\n\nYou can open the corners by pushing on its little tabs with a flathead screwdriver, but I recommend using a plastic tool to avoid damaging the pieces. The little plastic sword-thingies that come with the Weilong wrm are great for this, and [they fit into a standard screwdriver handle](https://i.imgur.com/9tlUGmq.jpeg) which makes it easier to use.\n\nLocking the pieces in the popped out state was just a matter of putting some paper at the tip of the shaft to occupy some space. Don't use too much, because that'll make the corner caps split open when you close the corner piece. About five layers of paper did it for me.\n\nI didn't try to lock the pieces in the popped in state, but it should be possible by inserting something right where the white piece hooks into the black piece, as there's a space there that allows for some movement. I decided to use the popped out state because I prefer the cube that way.\n\nThe 354 V1 also has this issue, but it doesn't change as much as the V2 and its corners don't easily pop when solving.\n\n\nMy initial opinion on the Gan 354 V2 hasn't really changed, where I think it's not as good as the discontinued V1 due to the tensioning system being more restrictive and everything else being more or less the same. For anyone looking specifically for a 54mm cube, I recommend considering 55mm instead, because there are more better options at that size. That said, I can feel more confident using my 354 V2 now that the corners are fixed, and I'll be solving on it more from now on.", "created_utc": "1653134872.0", "edited": "False", "id": "i9fwdxh", "is_submitter": "True", "link_id": "t3_uulrn9", "parent_id": "t3_uulrn9", "score": "1", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "ArkhanLahyet", "body": "Lots of foreigners get recommended this sub because it's one of the few places in Reddit where people can practice their Japanese.\n\n^sorry", "created_utc": "1652197483.0", "edited": "False", "id": "i82an2b", "is_submitter": "False", "link_id": "t3_umh3j7", "parent_id": "t3_umh3j7", "score": "10", "subreddit": "lowlevelaware", "subreddit_id": "t5_3754r"}, {"author": "ArkhanLahyet", "body": "[I made a reference sheet with Jperm's algs](https://www.reddit.com/r/Cubers/comments/osqdry/most_of_my_algs_are_from_j_perm_so_i_made_a/) that I shared here a while ago, there's a link in the comments where you can download the Word document to use it as a place to start. It's not a shining example of neat formatting or anything, but it should give you some ideas.", "created_utc": "1651580106.0", "edited": "False", "id": "i75fagz", "is_submitter": "False", "link_id": "t3_uh8naq", "parent_id": "t1_i74sv7x", "score": "2", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "ArkhanLahyet", "body": "The way I do it: Put your fingernails under three corners of the cap piece (thumb, index and middle finger), and push *inwards* with your fingernails.", "created_utc": "1651236058.0", "edited": "False", "id": "i6nqjop", "is_submitter": "False", "link_id": "t3_ueee5b", "parent_id": "t1_i6n2gby", "score": "1", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "ArkhanLahyet", "body": "The Japanese title is interesting, because 夢魘 (muen) isn't really \"dream\", it's more like \"being afflicted with a nightmare.", "created_utc": "1651161074.0", "edited": "False", "id": "i6jp1ck", "is_submitter": "False", "link_id": "t3_udxdu0", "parent_id": "t3_udxdu0", "score": "8", "subreddit": "Genshin_Impact_Leaks", "subreddit_id": "t5_3l2acu"}, {"author": "ArkhanLahyet", "body": "The MGC 5 is really good, not budget at all, and it's around that price. The YJ Zhilong mini is a bit cheaper but still good, just may be too small. imo cheaper 5x5s aren't worth it because these two exist.", "created_utc": "1651094283.0", "edited": "False", "id": "i6gb5vh", "is_submitter": "False", "link_id": "t3_ucvql5", "parent_id": "t1_i6g9bes", "score": "5", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "ArkhanLahyet", "body": "Right? the corner-cutting is pretty much the only limitation of the Tornado. I like everything else, the colors, the tensioning system, the magnet adjustment, the size, etc.\n\nI actually don't think the corner-cutting is that bad, especially when the axis distance is loose enough. But the cube is too fast out of the box for how inflexible it is, and that makes lockups frequent. For that reason I like it best when slow, to maximize control.\n\nI'd say the best way to slow it down is by tightening the screw tensions (I have mine on the tightest setting) and then increasing magnet strength a bit if you need more stability; it doesn't respond very well to lube because it doesn't have much contact area near the outside of the pieces. The Tengyun is that way too, that's probably why these two cubes are so quiet as opposed to the RS3M or the Gan 11 where the pieces are flat and have more contact area to clack loudly.", "created_utc": "1651072676.0", "edited": "False", "id": "i6es3uf", "is_submitter": "False", "link_id": "t3_ucvql5", "parent_id": "t1_i6dz5hn", "score": "3", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "ArkhanLahyet", "body": "If you do any diagonal corner swap on E, you get corners solved. Therefore, E is a diagonal corner swap.", "created_utc": "1651012497.0", "edited": "False", "id": "i6brtho", "is_submitter": "False", "link_id": "t3_uc4upb", "parent_id": "t1_i6bkt5e", "score": "2", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "ArkhanLahyet", "body": "What channels do you guys like for 3x3 example solves?", "created_utc": "1650661331.0", "edited": "False", "id": "i5sre0w", "is_submitter": "False", "link_id": "t3_u96nxg", "parent_id": "t3_u96nxg", "score": "4", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "ArkhanLahyet", "body": "Not sure if this is helpful to anyone, but I found that the tool bits that come with the Tornado V2 fit into a regular screwdriver handle. The Weilong WRM's mini-sword-thingy fits too, but not very firmly because it's not magnetic.\n\n[Like this.](https://imgur.com/a/lraFBNG)\n\nI guess it's nice to know that it's standardized.", "created_utc": "1650655848.0", "edited": "False", "id": "i5se6jm", "is_submitter": "False", "link_id": "t3_u96nxg", "parent_id": "t3_u96nxg", "score": "4", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "ArkhanLahyet", "body": "My wrm is slower than my yj mini, especially the inner slice. But it's not that different, and otherwise they feel pretty similar. Judging from what you're looking for in a 4x4, I'd skip the wrm; it's a nice puzzle but it's not faster than the yj mini.", "created_utc": "1650472026.0", "edited": "False", "id": "i5hz6vy", "is_submitter": "False", "link_id": "t3_u7orih", "parent_id": "t1_i5hcdg0", "score": "2", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "ArkhanLahyet", "body": "Honestly, I don't feel that much difference between the wrm and the yj mini, imo most of the difference is just the size. But I don't have the mgc 4 to compare.", "created_utc": "1650458054.0", "edited": "False", "id": "i5h1scs", "is_submitter": "False", "link_id": "t3_u7orih", "parent_id": "t1_i5gaka7", "score": "1", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "ArkhanLahyet", "body": "Today I've been blessed with an Ayaka at the 17th pull and a Sayu at the 23rd pull, made my day :D\n\nAlso got Razor to C1, a Favonius Sword and a Rainslasher which I didn't even know existed.\n\nGood luck to everyone still pulling!", "created_utc": "1650457804.0", "edited": "False", "id": "i5h1b3t", "is_submitter": "False", "link_id": "t3_u5j6gi", "parent_id": "t3_u5j6gi", "score": "1", "subreddit": "Genshin_Impact", "subreddit_id": "t5_12p4l2"}, {"author": "ArkhanLahyet", "body": "It literally just dawned on me that the Gan 11 is called that because it came after the X and the XS. They really did go full Apple naming scheme. I'm kinda surprised the Gan R wasn't named the Gan Xʀ too.", "created_utc": "1650377809.0", "edited": "False", "id": "i5cg0km", "is_submitter": "False", "link_id": "t3_u6x404", "parent_id": "t3_u6x404", "score": "6", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "ArkhanLahyet", "body": "I'd say Maglev because it's the more unique of the two.", "created_utc": "1650377530.0", "edited": "False", "id": "i5cfc6x", "is_submitter": "False", "link_id": "t3_u6x404", "parent_id": "t1_i5bga35", "score": "2", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "ArkhanLahyet", "body": "I can't say if it comes the same way on every cube, but from what I've seen in unboxings, it's triangle magnets on medium, light blue piece on 1 and clear piece at the highest. But really, there's nothing special about the default settings and you should just use what's best for you.", "created_utc": "1649770700.0", "edited": "False", "id": "i4fd5od", "is_submitter": "False", "link_id": "t3_u1qv5z", "parent_id": "t1_i4f3333", "score": "1", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "ArkhanLahyet", "body": "It really is Kociemba's algorithm under the hood; for example, if you look at [TwistyTimer's Github page](https://github.com/aricneto/TwistyTimer) you'll see that they use TNoddle to generate scrambles.\n\nIt does mean that every \"proper\" scrambler is a solver, plus random state generation with parity checks. Making scramblers is harder than people usually assume at first, but good luck with your project!", "created_utc": "1649374302.0", "edited": "False", "id": "i3tvjxi", "is_submitter": "False", "link_id": "t3_ty5fx0", "parent_id": "t1_i3tu2m2", "score": "3", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "ArkhanLahyet", "body": "It's normal that every once in a while you'll get an easy scramble.\n\nWCA regulations state that an official scramble must produce \"[a random state from all states that require at least 2 moves to solve (equal probability for each state)](https://www.worldcubeassociation.org/regulations/#4b3)\". This means that a random move scramble, for example, is not valid, because it does not produce all possible states with equal probability.\n\nInstead, a \"valid scramble\" is generated by picking a random state and solving it, and the reversed solution is the scramble. That's the principle behind the official WCA scrambler, [TNoodle](https://www.worldcubeassociation.org/regulations/scrambles/). One of the developer, Lucas Garron, [has a talk](https://youtu.be/fMDxNgXzLwM) on scramblers that I recommend if you're building your own.", "created_utc": "1649373140.0", "edited": "False", "id": "i3tst5j", "is_submitter": "False", "link_id": "t3_ty5fx0", "parent_id": "t1_i3tpkkj", "score": "2", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "ArkhanLahyet", "body": "Ah dang, we're back to dailies? Just when I thought we were getting faster!", "created_utc": "1648908558.0", "edited": "False", "id": "i33y8yu", "is_submitter": "False", "link_id": "t3_tuay9c", "parent_id": "t3_tuay9c", "score": "12", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "ArkhanLahyet", "body": "I'm glad our discussion is hourly now. It means we're getting faster!", "created_utc": "1648834026.0", "edited": "False", "id": "i30at5j", "is_submitter": "False", "link_id": "t3_ttvydo", "parent_id": "t3_ttvydo", "score": "5", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "ArkhanLahyet", "body": "Well... it's true that names ending in 葉 (ha = leaf) are typically feminine, like Konoha, Yukiha, Ayaha, Futaba (yes), but there are males names too, like Aoba, Shinba and our 万葉 (Kazuha = ten thousand leaves).", "created_utc": "1648739782.0", "edited": "False", "id": "i2uuw35", "is_submitter": "False", "link_id": "t3_tt06v2", "parent_id": "t1_i2ujn8u", "score": "139", "subreddit": "Genshin_Impact_Leaks", "subreddit_id": "t5_3l2acu"}, {"author": "ArkhanLahyet", "body": "Yes. If you want black plastic your only option is getting the stickered version, at least for now.", "created_utc": "1648672805.0", "edited": "False", "id": "i2rg7ud", "is_submitter": "False", "link_id": "t3_trys1n", "parent_id": "t1_i2ra0tu", "score": "1", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "ArkhanLahyet", "body": "Ah yes, like Final Fantasy's gil toss. Deals damage proportional to how much money you throw.", "created_utc": "1648582091.0", "edited": "False", "id": "i2lrggk", "is_submitter": "False", "link_id": "t3_tra5zl", "parent_id": "t1_i2lm737", "score": "8", "subreddit": "Genshin_Impact_Leaks", "subreddit_id": "t5_3l2acu"}, {"author": "ArkhanLahyet", "body": "That's interesting, thanks for sharing!", "created_utc": "1648498050.0", "edited": "False", "id": "i2h9ndk", "is_submitter": "False", "link_id": "t3_tq1pgc", "parent_id": "t1_i2h8deb", "score": "1", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "ArkhanLahyet", "body": "That's curious, do you think the rs3m's scratches are actually deeper or they're simply easier to see because of the surface's material?", "created_utc": "1648497231.0", "edited": "False", "id": "i2h7nah", "is_submitter": "False", "link_id": "t3_tq1pgc", "parent_id": "t1_i2h0j97", "score": "1", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "ArkhanLahyet", "body": "Oh, I see. Thanks.", "created_utc": "1648484986.0", "edited": "False", "id": "i2gdsk3", "is_submitter": "False", "link_id": "t3_tq1pgc", "parent_id": "t1_i2gat28", "score": "1", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "ArkhanLahyet", "body": "Does anyone know if the UV coating of Gan cubes is any more scratch resistant than regular glossy platic? I don't necessarily mean big scratches, but also those micro-scratches that accumulate on the surface of the cube over time.", "created_utc": "1648476807.0", "edited": "False", "id": "i2fu11o", "is_submitter": "False", "link_id": "t3_tq1pgc", "parent_id": "t3_tq1pgc", "score": "1", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "ArkhanLahyet", "body": "The Tornado is amazing, but it's difficult to set up well. I think the cube is better if it's slow and controllable, because it comes too fast out of the box for how inflexible it is. For example, the Weilong wrm 2021 is very fast, and it has effortless corner cutting that complements its speed well, but the Tornado locks up a lot because its corner cutting isn't good enough for how fast it is.\n\nI have my Tornado on the loosest travel distance in order to maximize corner-cutting, on the second tightest spring setting to slow it down, and on the second strongest magnet setting for stability. I also use quite a lot of slow lube, and I actually think it doesn't matter that much which lube you use, as long as you choose something controllable.\n\nThe Tornado is perfect aside from the subpar corner cutting, which means you can't set it up to be too fast, but being a super stable cube makes up for it.", "created_utc": "1648385668.0", "edited": "False", "id": "i2b3tnb", "is_submitter": "False", "link_id": "t3_tpcx64", "parent_id": "t1_i2atg0e", "score": "1", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "ArkhanLahyet", "body": "You simply have to find a screwdriver that's small enough to fit. The one that comes with the Tornado V2 fits, for example. It's unfortunate that the provided tool breaks so easily.", "created_utc": "1647895479.0", "edited": "False", "id": "i1ksqy9", "is_submitter": "False", "link_id": "t3_tj3ykf", "parent_id": "t1_i1knz01", "score": "2", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "ArkhanLahyet", "body": "They're safe, yes.\n\nFor 4x4, you can also consider the YJ Zhilong mini 4x4, which is cheap and performs really well, on par with the Aosu WR M. But it's the same size as a regular 3x3, so you may find it too small if you have large hands.\n\nFor 6x6 it's pretty much just the mgc.", "created_utc": "1647727118.0", "edited": "False", "id": "i1bypu3", "is_submitter": "False", "link_id": "t3_tho124", "parent_id": "t1_i1bxcat", "score": "1", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "ArkhanLahyet", "body": "Huh, I just tried it again on the V1 and it clicked. It just takes more force than on the V2, and I think the effect isn't as pronounced. I've had this cube for so many years and only noticed it now.", "created_utc": "1647620525.0", "edited": "False", "id": "i164tr7", "is_submitter": "False", "link_id": "t3_tgtoj9", "parent_id": "t1_i161u8s", "score": "3", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "ArkhanLahyet", "body": "This is very true. I was pleasantly surprised to see that the Zhilong mini performs just as well as the Aosu wrm. It's my main currently, because the size makes it more comfortable to do 3x3 fingertricks.", "created_utc": "1647620201.0", "edited": "False", "id": "i163ze8", "is_submitter": "False", "link_id": "t3_tgtoj9", "parent_id": "t1_i15n8xp", "score": "2", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "ArkhanLahyet", "body": "I noticed something weird about the Gan 354 V2: The corners, which normally stick out a little more than the edges, can be pushed in. It makes a \"pop\" and becomes flush with the edges.\n\nWhen the corners are pushed in, the cube is much more stable, with more friction and a more pronounced magnet bump. Really feels like this is how the cube was supposed to be like, especially considering that it comes with purple (weak) springs by default. I didn't notice that before because the 354 V1 also had those uneven corners but they can't be pushed in.\n\nPushing the corners inward almost seems like a hidden setting, but unfortunately they pop out again during solves. I'm tempted to open the corner pieces and permanently glue them in the \"popped in\" state.\n\nFor you people who have the Gan 354 V2, does this also happen in yours?", "created_utc": "1647606965.0", "edited": "False", "id": "i158zcj", "is_submitter": "False", "link_id": "t3_tgtoj9", "parent_id": "t3_tgtoj9", "score": "5", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "ArkhanLahyet", "body": "For all my stickerless cubes (which is all of them in the past few years) I always take off the stickered logo because I want the surface to wear out evenly.", "created_utc": "1647103915.0", "edited": "False", "id": "i0dwp1p", "is_submitter": "False", "link_id": "t3_tc8wde", "parent_id": "t1_i0durwt", "score": "1", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "ArkhanLahyet", "body": "Good luck trying to get good advice on the internet.", "created_utc": "1647102970.0", "edited": "False", "id": "i0dufy0", "is_submitter": "False", "link_id": "t3_tc6nzp", "parent_id": "t3_tc6nzp", "score": "4", "subreddit": "lowlevelaware", "subreddit_id": "t5_3754r"}, {"author": "ArkhanLahyet", "body": "Generally it should be safe (if you can use it on plastics, then it's fine), but I can't tell you if it's going to be good. Lubricant used on switches are typically of a higher viscosity, right? It might make the cube slow.", "created_utc": "1646935840.0", "edited": "False", "id": "i04vzod", "is_submitter": "False", "link_id": "t3_tar02e", "parent_id": "t1_i04u7oy", "score": "2", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "ArkhanLahyet", "body": "I'm disappointed with myself. I have a magnetized Gan RS where I've always felt the magnets were weak and kinda inconsistent. Turns out these things I attributed to the magnets were caused by me, because I fucked up the polarities.\n\nWhen I opened the cube I found some magnets had fallen out of place, and three of them had the wrong polarity (so I got at least that many wrong). I have no clue how this happened, because I could swear I glued them one by one, and none without a reference, but evidently I got something wrong along the way.\n\nFortunately, I managed to carve out the wrong magnets and glue them back together. But it still feels bad to have gotten it wrong in the first place.", "created_utc": "1646931864.0", "edited": "False", "id": "i04lnf6", "is_submitter": "False", "link_id": "t3_tar02e", "parent_id": "t3_tar02e", "score": "5", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "ArkhanLahyet", "body": "I've used my Tornado V2 for about a week now, and I like it more than I expected. I think the cube \\_has\\_ to be slowed down to work, because out of the box it's too fast for its own good, being a relatively inflexible cube.\n\nI have mine on the loosest screw depth and the tightest spring setting, with medium magnets and a lot of thick lube. It's pretty good. Now that the cube is more controllable I practically don't get lockups anymore.\n\nIt's a shame that I can't get this cube to be as fast as I like, but being super stable makes up for it, and I like everything else about it.\n\nI'm at the point where I have so many cubes I like, that I don't even have a main anymore. I just pick up whichever cube I feel like using, and the Tornado is my stable cube now.", "created_utc": "1646750358.0", "edited": "False", "id": "hzuaro0", "is_submitter": "False", "link_id": "t3_t992uw", "parent_id": "t3_t992uw", "score": "6", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "ArkhanLahyet", "body": "I know, right? [Down to the sides of the box](https://i.imgur.com/ezb70jl.jpg).", "created_utc": "1646569114.0", "edited": "False", "id": "hzkhe7b", "is_submitter": "True", "link_id": "t3_t78wc9", "parent_id": "t1_hzkd97s", "score": "1", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "ArkhanLahyet", "body": "Screw depth is the maximum amount that the pieces can be pulled apart, and the spring tension is how much force you need to pull the pieces apart.\n\nThe differences are best explained visually, so [I recommend this guide](https://youtu.be/WLczkv7VpwQ).", "created_utc": "1646568792.0", "edited": "False", "id": "hzkgyko", "is_submitter": "False", "link_id": "t3_t7rhbc", "parent_id": "t1_hzkg2at", "score": "5", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "ArkhanLahyet", "body": "I just counted and I have 8 moyu screwdrivers and 5 yj ones. I guess I hadn't considered the possibility of needing *more* screwdrivers 🤷", "created_utc": "1646506681.0", "edited": "False", "id": "hzhe6xa", "is_submitter": "True", "link_id": "t3_t78wc9", "parent_id": "t1_hzh91uu", "score": "1", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "ArkhanLahyet", "body": "Yeah, when I say \"problems of design\" I mean that the limitations in Gan cubes exist because the cube was designed to be that way, rather than poor implementation like the adjustable magnets of the Weilong 2021 with the fragile tool. The options of 0.6 and 0.8 travel distance work well enough, but I think a tighter setting would have been useful for the weaker springs, especially because the lite edition only comes with the weakest springs.\n\nThe ticking magnets don't bother me that much but it would be nice to actually enjoy the sound 😅", "created_utc": "1646506558.0", "edited": "False", "id": "hzhdwrx", "is_submitter": "True", "link_id": "t3_t78wc9", "parent_id": "t1_hzgg1do", "score": "2", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "ArkhanLahyet", "body": "That's a good point.", "created_utc": "1646489875.0", "edited": "False", "id": "hzgc38w", "is_submitter": "True", "link_id": "t3_t78wc9", "parent_id": "t1_hzg70pd", "score": "2", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "ArkhanLahyet", "body": "Mail day!\nWell, actually mail day was a few days ago, I needed some time to try out the cubes and gather my thoughts. Wall of text warning.\n\n## Tornado V2 M\n\nThe good:\n- Feels nice to turn, very smooth and very fast out of the box. It actually feels reasonably close to a gan cube, but not as flexible and much quieter.\n- Really good colors, they’re deep yet vibrant. This cube has my favorite color scheme so far, tied with the Aosu WR M.\n- The adjustable magnets are implemented much better than on the Weilong wrm 2021 (you know, the one with the tiny tool that breaks). Here, you can turn in either direction, the capsules are easier to turn and there’s a wider range of magnet strengths.\n- I’ve seen some people say that the caps come off easily, but they must’ve changed something because I can’t open mine with my fingers for the life of me. They’re not coming off on their own.\n- I like that both settings of the dual adjustment system are changed with the same tool. Would be nicer if it was adjustable by hand or with a standard tool like a screwdriver, but the included tool is of a good quality (i.e. not just a piece of plastic) so I have no problems with that.\n\nThe bad:\n- The reverse corner cutting is, in fact, bad, even on the loosest settings. Actually, it’s not *that* bad, but it’s worse than the other cubes of today, and that to me makes it harder to recommend since it’s going to catch more than other cubes no matter what.\n- This isn’t really a “bad” point per se but I think the Tengyun V1 is just better as a quiet cube. They make more or less the same amount of noise, but the Tengyun makes a softer, lower-pitched noise that’s easier on the ears.\n- The included bag comes folded twice and has a crease in the middle :(\n\nThe weird:\n- The adjustment tool includes two philips tips, even though they’re not used anywhere for setting up the cube. Would’ve made more sense to have the flat bit on one end and the 2-pronged fork on the other to avoid switching tips.\n- It takes a lot of lube to make this cube more controllable, it just refuses to be slow. I think it has to do with most of the pressure between pieces being near the core, so it’s similar to the Tengyun in that regard. That’s probably why this cube is quiet, too.\n- The cursive Chinese printed on the box says 風二代 (second generation wind ...?)\n\n\nI got this cube on a sale, not really expecting to like it much because of the poor corner cutting, since I know I like flexible cubes like the Weilongs. The cube felt very blocky even at the loosest settings. But actually, I think a part of the problem is that the cube is too fast out of the box for how inflexible it is, so I increased the spring tension all the way to 5 and added some slow lube and it’s not that bad now that it’s more controllable. I think the cube is best when slow to minimize overturns.\n\nOverall, the corner cutting is the only fault in this cube. I like the colors, the feel, the surface finish, the size, the adjustment system, even the logo is nice. It’s just that in terms of performance, it’s hard to recommend it over other cubes since finding a setup that works well is like trying to work around the corner cutting issue, making it a cube that *can* be fast but it’s hard to use. I still lock up in some places where other cubes wouldn’t, but I can see some people maining the Tornado precisely because it’s so stable.\n\n## Gan 354 V2 M\n\nThe good:\n- As always, this Gan cube came out of the box without a single scratch. Thumbs up.\n- The cube turns as well as expected. It’s got the characteristic crunchy yet smooth feel of Gan cubes.\n- It’s got an all plastic core, so no worries about using water-based lube.\n\nThe bad:\n- There’s a ticking magnet. I didn’t think that happened on Gan cubes, but apparently it does. Fortunately, the ticking sound is barely audible when solving, it’s not nearly as loud as the ticking magnet I got with my RS3M, but probably harder to fix.\n- Man, the matte finish feels so slippery out of the box, every time.\n- I think the problems with Gan cubes mainly stem from bad design rather than construction, and it’s no different here with the springs only allowing 0.6 and 0.8 travel distance. That feels like a step back from the V1’s threaded nuts, as both options are too loose for the pre-installed purple springs. I could understand it if different springs had different options (e.g. 0.3 and 0.5 for purple, 0.4 and 0.6 for blue and so on), but no. I’m glad the current flagships use something better. This system just appears to be intentionally restrictive, and I think there’s a good chance that it actually is on purpose.\n\nThe weird:\n- Comparing with my Gan RS that I magnetized, the cap design on the 354 V2 is older, the same as the V1. Which is fine, but doesn’t click in place as firmly.\n- The logo looks like a painted layer over the surface that doesn’t shine with the background, which is different from the RS where the logo looks like part of the plastic. I would’ve expected the cheaper RS to use a cheaper logo instead, but it’s probably just using a more recent manufacturing process than the 354.\n- The edge magnets are inlaid deeper than the V1. But they still look nice.\n\n\nThe cube itself is very good, really looks and feels like a successor to the V1, including the uneven edges and corners and its “pointier shape” (the cube’s edges are sharper than most cubes).\nHowever, the purple springs are way too loose and flimsy out of the box. They didn’t have to be bad, but because 0.6 and 0.8 are the only options for every spring, it’s very much necessary to get the version of this cube that comes with extra springs.\n\nI tried out each set of springs and settled for green, though I think yellow is a good pick too because of the strong-ish magnets. I get the impression that the cube is less stable than my 56mm RS, maybe because it’s smaller while the springs are the same size. I think it’s more likely to be just a difference with lubes and it not being broken in yet.\n\nThe cube is still a bit scratchy because it’s new, but aside from that it feels like a perfectly standard Gan cube. It’s a worthy successor to the Gan 354 V1, I only don’t consider it a strict upgrade because the adjustment system is more restrictive.\n\n## Bonus: Gan RS\n\nI have a Gan RS that I magnetized with 4x2mm N42 magnets, and I never liked it much. I think the pre-installed yellow springs matched the cube well originally, but after the magnetization it became slow and catchy. Half of the reason why I got the 354V2 was to get extra springs for it too, and now that I replaced its springs with blue ones, I understand that the magnets I used were way too weak for the spring strength; now the catches are gone and this may be one of my favorite cubes.\n\nThe stock Gan RS is not a cube I recommend overall, but it’s actually pretty good if you get magnets and extra springs, but then if you’re going to go that far it’s better to just get a 356M to begin with. Well, actually, one advantage of magnetizing a cube yourself is that you won’t get ticking magnets like in my 354V2, so there’s that. Just remember to pick strong magnets.\n\n## Conclusion\n\nSo, there’s three cubes that weren’t good out of the box for different reasons, and for different reasons they got better. I currently main the purple Weilong and I think that won’t change, but I like these cubes a lot and I’ll be using them regularly.", "created_utc": "1646485006.0", "edited": "False", "id": "hzg3lyp", "is_submitter": "True", "link_id": "t3_t78wc9", "parent_id": "t3_t78wc9", "score": "10", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "ArkhanLahyet", "body": "What about [M' U M U' M' U2 M](https://ruwix.com/widget/3d/?alg=M%27%20U%20M%20U%27%20M%27%20U2%20M&flags=showalg)?", "created_utc": "1646405795.0", "edited": "False", "id": "hzbml0d", "is_submitter": "False", "link_id": "t3_t6b3l4", "parent_id": "t1_hzbjx0c", "score": "4", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "ArkhanLahyet", "body": "Áudio + legenda tudo em inglês é o melhor pra aprender, pq senão é fácil demais só ler a legenda sem aprender nada... mas é claro, depende do seu nível, também não adianta não entender nada.\n\nSó toma cuidado que o povo do skyrim fala um inglês arcaico que ninguém usa na vida real. *You have committed crimes against Skyrim and her people. What say you in your defense?*", "created_utc": "1646335263.0", "edited": "False", "id": "hz7y3re", "is_submitter": "False", "link_id": "t3_t5taf2", "parent_id": "t3_t5taf2", "score": "3", "subreddit": "conversas", "subreddit_id": "t5_hwfuo"}, {"author": "ArkhanLahyet", "body": "SCS and Cubicle are good options for people who live near the US but for other places there are other shops too, for example you can buy cubes from chinese stores and that's often cheaper, you just have to wait longer. Check out the link on the sidebar \"[where to buy cubes](https://www.reddit.com/r/Cubers/wiki/where_to_buy_cubes)\".", "created_utc": "1646325265.0", "edited": "False", "id": "hz77wgp", "is_submitter": "False", "link_id": "t3_t5jou4", "parent_id": "t1_hz76k43", "score": "2", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "ArkhanLahyet", "body": "I'm hoping it has core magnets. I can't see where to place the magnets otherwise, since the shallow faces limit where they can be inside the pieces.", "created_utc": "1646152419.0", "edited": "False", "id": "hyxfqpy", "is_submitter": "False", "link_id": "t3_t45h1v", "parent_id": "t3_t45h1v", "score": "3", "subreddit": "GANCUBE_Official", "subreddit_id": "t5_56k2dh"}, {"author": "ArkhanLahyet", "body": "Either they're using magnets that are all close to the center (because the smallest piece limits where the magnets can be), or core magnets. I hope it's core magnets.", "created_utc": "1646152280.0", "edited": "False", "id": "hyxfdzl", "is_submitter": "False", "link_id": "t3_t46lvj", "parent_id": "t1_hyxdmid", "score": "19", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "ArkhanLahyet", "body": "I wonder where the magnets are. If they're regular magnets they'd have to be pretty close to the core and very close together because of the smaller pieces, so maybe core magnets?", "created_utc": "1646140554.0", "edited": "False", "id": "hywoz0n", "is_submitter": "False", "link_id": "t3_t46mc7", "parent_id": "t3_t46mc7", "score": "12", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "ArkhanLahyet", "body": "The two kinds of reaction in this thread:\n\n* Why would they do such a thing?\n* This is the best thing ever!", "created_utc": "1646139974.0", "edited": "False", "id": "hywnx6p", "is_submitter": "False", "link_id": "t3_t46lvj", "parent_id": "t3_t46lvj", "score": "167", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "ArkhanLahyet", "body": "You should try both and see which you prefer. I personally like Yau on 5x5 mainly because lookahead is easier. Ciarán Beahan, who is currently 4th in the world at 5x5 single and average, [recommends Yau and explains why here](https://youtu.be/1yNTZ56D61Q).", "created_utc": "1645920540.0", "edited": "False", "id": "hykwivp", "is_submitter": "False", "link_id": "t3_t1olz3", "parent_id": "t1_hyksffy", "score": "2", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "ArkhanLahyet", "body": "They're child-proof caps. I've never seen just the caps being sold, it's probably easier to buy bottles to transfer the content.", "created_utc": "1645796368.0", "edited": "False", "id": "hydn6eh", "is_submitter": "False", "link_id": "t3_t0vg6g", "parent_id": "t1_hydlpov", "score": "2", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "ArkhanLahyet", "body": ">there is a pully sandstorm  \n>  \n>like the ground pulls you\n\nIt bet it pulls you into the purple goo. Now we just need a character who's immune to succ", "created_utc": "1645577667.0", "edited": "False", "id": "hy1g0lm", "is_submitter": "False", "link_id": "t3_sz35ur", "parent_id": "t3_sz35ur", "score": "16", "subreddit": "Genshin_Impact_Leaks", "subreddit_id": "t5_3l2acu"}, {"author": "ArkhanLahyet", "body": "丹砂 (dān​shā) is mercuric sulfide, also known as [Cinnabar](https://en.wikipedia.org/wiki/Cinnabar), a mineral that was historically used for making red pigment.", "created_utc": "1645552634.0", "edited": "False", "id": "hxzokrt", "is_submitter": "False", "link_id": "t3_sytcfg", "parent_id": "t1_hxzn57w", "score": "12", "subreddit": "Genshin_Impact_Leaks", "subreddit_id": "t5_3l2acu"}, {"author": "ArkhanLahyet", "body": "Pessoal já comentou aqui mas eu também iria com a primeira; sei que desenvolvimento de jogos parece uma carreira mais interessante, mas dependendo da empresa vc pode se encontrar afogado de trabalho de uma natureza que vc não esperava, que nem resolver bugs em código bagunçado com prazo curto (claro que não conheço as empresas então também não posso dizer nada com certeza, só digo que trabalhar com jogos não é uma opção tão seguramente \"mais divertida\" sabe?). Teria que ser uma opção muito segura pra compensar todo esse risco.", "created_utc": "1645543394.0", "edited": "False", "id": "hxz0xyv", "is_submitter": "False", "link_id": "t3_syouma", "parent_id": "t3_syouma", "score": "1", "subreddit": "conversas", "subreddit_id": "t5_hwfuo"}, {"author": "ArkhanLahyet", "body": "Acho que dá pra notar um sotaque sim, mesmo nas pessoas que não falam o japonês muito bem. Tem mais a ver com a intonação e o ritmo das frases, e um pouco com a qualidade exata das consoantes e vogais que usamos. É difícil descrever exatamente, porque é uma combinação de vários fatores pequenos.", "created_utc": "1645542559.0", "edited": "False", "id": "hxyyxpa", "is_submitter": "False", "link_id": "t3_sy14ty", "parent_id": "t3_sy14ty", "score": "5", "subreddit": "Portuguese", "subreddit_id": "t5_2sqn7"}, {"author": "ArkhanLahyet", "body": "I like to alternate sometimes. For example, there's a lot of material in English for learning French, but it's kinda pointless to listen to explanations about the subjunctive in English when it all sounds somewhat obvious from another Romance language. But I still use a lot of material in English because why wouldn't I.\n\nI don't really like the idea of restricting which languages you can use to learn others, because being able to use any of your languages is exactly the reason to learn them ;)", "created_utc": "1645541945.0", "edited": "False", "id": "hxyxiek", "is_submitter": "False", "link_id": "t3_syltlh", "parent_id": "t3_syltlh", "score": "8", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "ArkhanLahyet", "body": "Passive input can help with reinforcing the vocabulary and grammar that you know, and if you're at N3\\~N2 I think that's a level where you can benefit a lot from it. It doesn't replace active study, though.", "created_utc": "1645541496.0", "edited": "False", "id": "hxywher", "is_submitter": "False", "link_id": "t3_syohrw", "parent_id": "t3_syohrw", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "ArkhanLahyet", "body": "Sorry, I didn't realize that counted.", "created_utc": "1645541100.0", "edited": "False", "id": "hxyvkz0", "is_submitter": "False", "link_id": "t3_syexew", "parent_id": "t1_hxyuxts", "score": "3", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "ArkhanLahyet", "body": "Picube's store on Aliexpress has the [Gan 11 M Pro for 35 USD](https://www.aliexpress.com/item/1005002581239669.html) and I can't help but feel suspicious. Resisting the urge to buy more cubes that I don't need.", "created_utc": "1645533428.0", "edited": "False", "id": "hxygq0n", "is_submitter": "False", "link_id": "t3_syexew", "parent_id": "t3_syexew", "score": "1", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "ArkhanLahyet", "body": "Essa moda de minimalismo é uma coisa triste. O propósito era remover ruído e deixar mais único e reconhecível, mas na prática faz exatamente o contrário e todos os logos ficam muito parecidos e sem características marcantes. O pior é que em muitos casos o logo original já era bem simples e reconhecível e não precisava de simplificação, como é o caso do SFV.", "created_utc": "1645456184.0", "edited": "False", "id": "hxu7gse", "is_submitter": "False", "link_id": "t3_sxuokm", "parent_id": "t3_sxuokm", "score": "77", "subreddit": "brasil", "subreddit_id": "t5_2qh9i"}, {"author": "ArkhanLahyet", "body": "pfv, \"primum tempus\" parece que alguém traduziu \"first time\" no google translate.\n\nAlguém que sabe latin pode confirmar a melhor tradução? O melhor que eu achei foi [prima vice](https://latin.stackexchange.com/a/4876).", "created_utc": "1645445724.0", "edited": "False", "id": "hxto8yc", "is_submitter": "False", "link_id": "t3_sxfv1v", "parent_id": "t3_sxfv1v", "score": "11", "subreddit": "brasil", "subreddit_id": "t5_2qh9i"}, {"author": "ArkhanLahyet", "body": "Moyu v2 is water-based.\n\nWater-based lubricants dry very fast, normally you use them together with a silicon-based lubricant. I suggest looking for a silicon lube: Lubest xmt, Traxxas, Qiyi M-lube, or lube from the Cubicle or Speedcubeshop, whichever is easiest for you to find.", "created_utc": "1645284140.0", "edited": "False", "id": "hxl33rs", "is_submitter": "False", "link_id": "t3_sw9dcu", "parent_id": "t3_sw9dcu", "score": "5", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "ArkhanLahyet", "body": "I just got my Zhilong mini 4x4 and 5x5 in the mail.\n\nFirst impressions:\n\n* The 4x4 is amazing. Very fast and flexible. Just as good as the Aosu WR M. The inner layers are the best I've ever seen.\n* There's a lot of 3x3 fingertricks that I could already do with the Aosu, but they're just a bit easier on the Zhilong. Mostly, I really like how 56mm feels, it just fits.\n* Magnets are definitely stronger but it doesn't actually make that much of a difference in my opinion.\n* I've seen people say that the 5x5 is too small, and I can see why. Somehow the outer layers feel tiny, even though they're just 1mm smaller than the MGC (about 12.5mm compared to about 13.5mm on the MGC5, \\~9% smaller). Might be because I'm used to the Meilong 5, which is smaller but its outer layers are the same size as the MGC.\n* Despite not being as comfortable on the 5x5 as on the 4x4, I quite like it and I hope I can get used to the cube. However, it doesn't really enable 3x3 fingertricks like the Zhilong 4x4 does, so in a way it feels less necessary for a mini 5x5 to exist.\n* I'm catching more on the Zhisu 5x5 than on the MGC, but I don't know if it just needs breaking in. I think it got less frequent already, so it might be just me not being used to the cube.\n* The shades are great, similar to the Aosu WR M with a slightly lighter green and a slightly darker orange. I definitely prefer it over the MGC color scheme.\n* Both came too lose out of the box. No big deal, tightening them didn't lose speed.\n* And a less important thing, but I'd have preferred if they had kept the original names (Zhisu and Zhichuang), renaming all of them to Zhilong kinda breaks the pattern they have going on with other cubes.\n\nOverall, the 4x4 is easier to recommend, as I think the 5x5 is indeed too small for most people while not providing as much advantage over a regular sized 5x5. But as for me, I like both a lot and I'll be using them often.", "created_utc": "1645216047.0", "edited": "False", "id": "hxhpclq", "is_submitter": "False", "link_id": "t3_sv9gwt", "parent_id": "t3_sv9gwt", "score": "5", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "ArkhanLahyet", "body": "Ah, the classic \"Rubik's cube being used as a demonstration of intelligence\" trope. If only that were true.", "created_utc": "1645213987.0", "edited": "False", "id": "hxhk78n", "is_submitter": "False", "link_id": "t3_svpm8m", "parent_id": "t3_svpm8m", "score": "85", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "ArkhanLahyet", "body": "*Alice*: \"I see nothing.\"\n\n*Cheshire Cat*: \"My. You have good eyes.\"", "created_utc": "1645210870.0", "edited": "False", "id": "hxhccbn", "is_submitter": "False", "link_id": "t3_svilj8", "parent_id": "t3_svilj8", "score": "3", "subreddit": "lowlevelaware", "subreddit_id": "t5_3754r"}, {"author": "ArkhanLahyet", "body": "Man\n\nCode outlives the coder.", "created_utc": "1645203108.0", "edited": "False", "id": "hxgryxr", "is_submitter": "False", "link_id": "t3_suzec5", "parent_id": "t1_hxfdqzy", "score": "6", "subreddit": "programming", "subreddit_id": "t5_2fwo"}, {"author": "ArkhanLahyet", "body": "The Greatest Show on Earth do Nightwish me faz sentir assim.\n\nIsso me faz acreditar que o propósito da humanidade não é o avanço da tecnologia, ou a busca por verdades e nem a colonização do universo, mas sim a arte, pois o que os primeiros humanos sentiram através da arte é o que nós sentimos e buscamos ainda.\n\nDei uma viajada. Mas é que eu estou ouvindo música também...", "created_utc": "1645111048.0", "edited": "False", "id": "hxbek8k", "is_submitter": "False", "link_id": "t3_supckt", "parent_id": "t3_supckt", "score": "3", "subreddit": "conversas", "subreddit_id": "t5_hwfuo"}, {"author": "ArkhanLahyet", "body": "He's totally gonna be an Itto-type character who everyone thinks is tough and mysterious but secretly he just likes having fun, isn't he?", "created_utc": "1645060756.0", "edited": "False", "id": "hx91dp9", "is_submitter": "False", "link_id": "t3_su9v6u", "parent_id": "t1_hx8r5ja", "score": "299", "subreddit": "Genshin_Impact_Leaks", "subreddit_id": "t5_3l2acu"}, {"author": "ArkhanLahyet", "body": "I mean, you could also convince yourself that the sexy move is called that for the same reason as the [sexy primes](https://en.wikipedia.org/wiki/Sexy_prime), which is the relation to the number six. But really, we all know it's called that because it's fun to do.", "created_utc": "1645047115.0", "edited": "False", "id": "hx8550v", "is_submitter": "False", "link_id": "t3_stnh4r", "parent_id": "t1_hx7hysd", "score": "2", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "ArkhanLahyet", "body": "I mean, she *is* named after King Paimon from the Lesser Key of Solomon.", "created_utc": "1645046815.0", "edited": "False", "id": "hx84dhb", "is_submitter": "False", "link_id": "t3_su5cx2", "parent_id": "t1_hx803d0", "score": "97", "subreddit": "Genshin_Impact_Leaks", "subreddit_id": "t5_3l2acu"}, {"author": "ArkhanLahyet", "body": "そうだね、多くの人は「これはこのサブレにふさわしいコンテントだ」ではなく「私もそう思う」を元にしてupvoteしがちだと思う。どのサブレでも、大きくなりすぎるとそんな人に群がって、困ったことにそういう状態になっちゃうね", "created_utc": "1645043723.0", "edited": "False", "id": "hx7wey1", "is_submitter": "False", "link_id": "t3_stv0x9", "parent_id": "t1_hx7irhr", "score": "3", "subreddit": "lowlevelaware", "subreddit_id": "t5_3754r"}, {"author": "ArkhanLahyet", "body": "I don't even think the corner cutting of the Meilong M is bad, but other cubes like the RS3M or the Weilong are so effortless and forgiving that I probably got too used to that.\n\nIt's not that I perform slowly with it, it's more like it catches more when I turn too fast, and that makes me lose a second or two every few solves. When I think about it carefully I can't really pinpoint *why* I don't perform as well with the Meilong, I think that objectively there's nothing wrong with it at all, it just *feels square* to me if that makes sense. But then again, I have the same kind of experience with the Gan RS locking more than other cubes.", "created_utc": "1645042643.0", "edited": "False", "id": "hx7tmq0", "is_submitter": "False", "link_id": "t3_stnh4r", "parent_id": "t1_hx7i4qo", "score": "1", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "ArkhanLahyet", "body": "I'm the same. The Meilong M lacks the effortless corner cutting of better cubes, so I need to put in just a bit more force between turns, and that makes the cube feel less stable and its motion less fluid.\n\nBut that may be just me since I like flexible cubes. I get about the same times on my magnetized Gan RS.", "created_utc": "1645036545.0", "edited": "False", "id": "hx7dp3z", "is_submitter": "False", "link_id": "t3_stnh4r", "parent_id": "t1_hx7501x", "score": "2", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "ArkhanLahyet", "body": "unpopularopinion is one of those subreddits that have grown so much that they're basically mainstream now. Practically every post is a perfectly normal opinion that no one would consider \"unpopular\". It's sad, but the main distinguishing features of those communities disappear as more people join in.\n\nLLLはそういう状態にならないように", "created_utc": "1645027860.0", "edited": "False", "id": "hx6rqhl", "is_submitter": "False", "link_id": "t3_stv0x9", "parent_id": "t3_stv0x9", "score": "6", "subreddit": "lowlevelaware", "subreddit_id": "t5_3754r"}, {"author": "ArkhanLahyet", "body": "Encontre o kanji diferente\n\n徴徴徴徴徴徴微徴徴徴徴徴徴徴徴徴徴徴徴徴徴徴徴徴徴徴徴徴徴徴徴徴徴徴徴徴徴徴徴徴徴徴徴徴徴徴徴徴徴徴徴徴徴徴徴徴徴徴徴徴徴徴徴徴徴徴徴徴徴徴徴徴徴徴徴徴徴徴徴徴徴徴徴徴徴徴徴徴徴徴徴徴徴徴徴徴徴徴徴徴徴徴徴徴徴徴徴徴徴徴徴徴徴徴徴徴徴徴", "created_utc": "1645026865.0", "edited": "False", "id": "hx6p5e8", "is_submitter": "False", "link_id": "t3_stwcod", "parent_id": "t1_hx6ifkf", "score": "4", "subreddit": "conversas", "subreddit_id": "t5_hwfuo"}, {"author": "ArkhanLahyet", "body": "I think I like him more than his sister.", "created_utc": "1645019707.0", "edited": "False", "id": "hx67yvk", "is_submitter": "False", "link_id": "t3_stwb2p", "parent_id": "t3_stwb2p", "score": "5", "subreddit": "Genshin_Impact_Leaks", "subreddit_id": "t5_3l2acu"}, {"author": "ArkhanLahyet", "body": "I don't know what happened. It's fixed now.", "created_utc": "1644875019.0", "edited": "False", "id": "hwykftg", "is_submitter": "True", "link_id": "t3_osqdry", "parent_id": "t1_hww3vmb", "score": "1", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "ArkhanLahyet", "body": "I know of one case where a three-quarters turn makes sense, which is a Ub perm from the back that goes like R' U R' U' R3 U' R' U R U R2, starting in home grip.\n\nU3 is definitely not optimal anywhere.", "created_utc": "1644861655.0", "edited": "False", "id": "hwxni9r", "is_submitter": "False", "link_id": "t3_ssbji1", "parent_id": "t3_ssbji1", "score": "13", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "ArkhanLahyet", "body": "I wrote an article-like post [here a while ago on this topic](https://www.reddit.com/r/Cubers/comments/rmklzx/maglev_and_other_falsehoods/), going into detail on how springs work and how maglev is different. It hope it helps you.", "created_utc": "1644783738.0", "edited": "False", "id": "hwtjo5u", "is_submitter": "False", "link_id": "t3_sralsb", "parent_id": "t1_hwth0cd", "score": "4", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "ArkhanLahyet", "body": "facing red: extract the pair with U' L U L' and insert with L' U' L. The L' L' in the middle becomes an L2.\n\nfacing orange: extract with U' R U' R', insert with R' U' R. The R' R' in the middle becomes an R2.\n\nFacing blue or green I think it's worth it to rotate.", "created_utc": "1644781756.0", "edited": "False", "id": "hwteovi", "is_submitter": "False", "link_id": "t3_sralsb", "parent_id": "t1_hwtbrs8", "score": "2", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "ArkhanLahyet", "body": "If you're just looking for good V-perms, there are plenty of modern ones to choose from.\n\nJperm has a [list of V perms](https://youtu.be/1wUqCM94UlA), where I especially like numbers 6 and 9, (though I haven't practiced enough that I can do them faster than the old vperm with a rotation).", "created_utc": "1644780826.0", "edited": "False", "id": "hwtcbzw", "is_submitter": "False", "link_id": "t3_srofjo", "parent_id": "t3_srofjo", "score": "5", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "ArkhanLahyet", "body": "That looks like an upside-down beginners method, but I think that no matter how you look at it, the regular beginners method that builds the bottom layer first is simply a better idea, because you want to put the solved pieces at the bottom/back and keep the unsolved ones where you can see them.", "created_utc": "1644761747.0", "edited": "False", "id": "hws23be", "is_submitter": "False", "link_id": "t3_sralsb", "parent_id": "t1_hwrxeed", "score": "2", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "ArkhanLahyet", "body": "My thoughts on it: It's incredible value. It's very flexible, which is typical of Moyu cubes, and has reasonably fast turning. It just lacks a bit of effortless corner-cutting that you find in the current top cubes, so the turns don't blend into each other as fluidly. I think that's more noticeable in corner-cutty algs like G-perms where it feels like I need to put in a little bit more force in between the turns and that makes the cube harder to control. That said, that's not a big flaw, and it's an excellent first speedcube. It lacks the customization options of other cubes but that shouldn't be much of a problem if you still don't know exactly what kind of cuber you are.\n\nThe Meilong 3M isn't my main, but I can get close to my normal times and I actually perform just as well with it as with my magnetized Gan RS.", "created_utc": "1644758017.0", "edited": "False", "id": "hwrvbfd", "is_submitter": "False", "link_id": "t3_sralsb", "parent_id": "t1_hwrp8mb", "score": "2", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "ArkhanLahyet", "body": "Does it scratch easily?", "created_utc": "1644687532.0", "edited": "False", "id": "hwo4a12", "is_submitter": "False", "link_id": "t3_sqjf4w", "parent_id": "t1_hwnvj4x", "score": "2", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "ArkhanLahyet", "body": "which one did you want? their store on aliexpress [still has three colors](https://pt.aliexpress.com/item/1005003476573019.html), unless their page there is outdated", "created_utc": "1644610444.0", "edited": "False", "id": "hwjticq", "is_submitter": "False", "link_id": "t3_spqxth", "parent_id": "t1_hwjlyt5", "score": "1", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "ArkhanLahyet", "body": "Man, I just impulse bought a Tornado V2 that I probably won't like. I might not even want it anymore by the time it arrives. Oh well, that's a gift for my future self, he better appreciate it.\n\nI've seen that a lot of people like this cube and a lot of people dislike it for having bad corner cutting. For the people that like it, is it because the corner cutting doesn't affect your turning style, or because it does but you like the cube anyway due to other things?", "created_utc": "1644501727.0", "edited": "False", "id": "hwd87iq", "is_submitter": "False", "link_id": "t3_soy53e", "parent_id": "t3_soy53e", "score": "5", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "ArkhanLahyet", "body": "I have a magnetized RS that I think it's a perfectly normal cube, but it's nothing exceptional and has the limitation that it only comes with yellow springs, which are the strongest springs of the set.\n\nI think yellow springs are perfect for a non-magnetic cube, but magnetizing it will add control and take away a bit of speed, and unless you know you like controllable cubes, you might be wishing you could use green or blue springs instead, which are weaker. Again, yellow springs might suit you just fine, but I think the blues that come with the 356M lite are a better fit for most people, so if you want a Gan cube I'd go for that one instead.\n\nMagnetizing an RS you already have gets you a perfectly fine cube, but the only customization it has is literally changing the travel distance between 0.6 and 0.8. If you want a budget cube, the RS3M 2020 is super easy to recommend: in my opinion it catches less, is faster and more flexible, and also cheaper. If you really want a Gan cube, I'd go for the 356M lite, and if you think it's too loose you can put the RS's yellow springs in it.", "created_utc": "1644501077.0", "edited": "False", "id": "hwd6rkw", "is_submitter": "False", "link_id": "t3_sp42xi", "parent_id": "t3_sp42xi", "score": "2", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "ArkhanLahyet", "body": "unaware\n\n意味: 僕たち", "created_utc": "1644423078.0", "edited": "False", "id": "hw8n3fz", "is_submitter": "False", "link_id": "t3_sob89j", "parent_id": "t3_sob89j", "score": "5", "subreddit": "lowlevelaware", "subreddit_id": "t5_3754r"}, {"author": "ArkhanLahyet", "body": "I took pictures of my WRM for you, should be an okay reference. There's three magnets in each wing and each corner.\n\n[https://imgur.com/a/jRNwUv0](https://imgur.com/a/jRNwUv0)\n\nBut I don't recommend magnetizing the WR, I don't even know if it has those slots like the factory-magnetized version.", "created_utc": "1644421535.0", "edited": "False", "id": "hw8j2rt", "is_submitter": "False", "link_id": "t3_so552a", "parent_id": "t1_hw84ber", "score": "2", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "ArkhanLahyet", "body": "I think some people lube big cubes without taking pieces out, but I find it more effective to remove some wings of different layers and lube the base of each, because otherwise the lube doesn't always spread well inside the cube.\n\nThat said, I almost never lube my big cubes, I find it way too easy to overlube them, and if that happens, it's a pain to clean.", "created_utc": "1644353010.0", "edited": "False", "id": "hw4qm8f", "is_submitter": "False", "link_id": "t3_snbn5c", "parent_id": "t1_hw4lcms", "score": "2", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "ArkhanLahyet", "body": "5x5 BLD isn't based on reduction, if that counts. Apart from that, [speedsolving.com has a list of 5x5 methods](https://www.speedsolving.com/wiki/index.php/Category:5x5x5_methods), some of which aren't based on reduction, like the [Cage method](https://www.speedsolving.com/wiki/index.php/Cage_Method). But I don't think any of those are seriously used by anyone for speedsolving.", "created_utc": "1644110217.0", "edited": "False", "id": "hvrkwid", "is_submitter": "False", "link_id": "t3_skynm8", "parent_id": "t1_hvqy9kf", "score": "5", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "ArkhanLahyet", "body": "Wanting to own multiple of everything is a feeling that many here can relate to. I'm sure that if I had 10000 times more money I'd be collecting yachts.", "created_utc": "1644090286.0", "edited": "False", "id": "hvqfgan", "is_submitter": "False", "link_id": "t3_skynm8", "parent_id": "t1_hvpxund", "score": "2", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "ArkhanLahyet", "body": "I skipped those because they're one-off names that weren't part of a series, but here you go:\n\nThe su in Sulong is 速 (sù = speed). I couldn't find a Chiling anywhere, I think you meant the Chilong? Its chi is 赤 (chì = red).\n\nThe Liying is spelled with 丽 (lì = beautiful) and 影 (yǐng = shadow, image). Dianma is 颠 (diān = jolt, topple?) and 马 (mǎ = horse), but I'm actually not sure what 颠 means.\n\nThe tang in Tanglong is 唐 (táng = Tang dynasty), again, I don't know if 唐 is supposed to mean something else. And the hua in Hualong is 华 (huá = magnificent).", "created_utc": "1644011226.0", "edited": "False", "id": "hvm9gp3", "is_submitter": "True", "link_id": "t3_skctlk", "parent_id": "t1_hvlzscy", "score": "3", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "ArkhanLahyet", "body": "I think you're right. I've edited the post.", "created_utc": "1644000998.0", "edited": "False", "id": "hvlifjv", "is_submitter": "True", "link_id": "t3_skctlk", "parent_id": "t1_hvl3njq", "score": "2", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "ArkhanLahyet", "body": "If the lube isn't specifically made for adding control to a cube, you may have to use too much of it to get the effect of slowing it down. Overlubing a cube can certainly make it slower, but also tends to give it a very different feel (maybe sticky, maybe gummy), which you may not want. Instead, you can turn the blue piece around the screw to slow down the cube, but that will also make it less flexible.\n\nI don't recommend tightening the blue piece too much because it makes the cube too rigid in the case of maglev. [I wrote a post here](https://www.reddit.com/r/Cubers/comments/rmklzx/maglev_and_other_falsehoods/) a while ago about maglev tensioning systems, please do take a look!", "created_utc": "1643910266.0", "edited": "False", "id": "hvg3qxp", "is_submitter": "False", "link_id": "t3_sjagay", "parent_id": "t1_hvg1rrg", "score": "3", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "ArkhanLahyet", "body": "That's right!  \nただ、「カタカニゼーション」は \"katakanization\"　です。\n\nI don't know if this word really exists, but I formed it the same way as \"optimal -> optimize -> optimization\", \"stigma -> stigmatize -> stigmatization\", \"synchronous -> synchronize -> synchronization\", etc.", "created_utc": "1643909812.0", "edited": "False", "id": "hvg2h7j", "is_submitter": "False", "link_id": "t3_sjl4m9", "parent_id": "t1_hvflmyn", "score": "2", "subreddit": "lowlevelaware", "subreddit_id": "t5_3754r"}, {"author": "ArkhanLahyet", "body": "ギブン・ザ・カタカニゼーション・オブ・ザ・ジャパニーズ・ランゲージ・アンド・ザ・インフルエンス・オブ・エングリッシュ・イン・エブリデー・ライフ、エブリシング・ウィル・ビー・リッタン・ライク ・ジス・イン・ザ・フューチャ。 ザト・イズ・アン・インネビタブル・フォ一ム・オブ・プログレス。プリーズ、ドゥ・ノット・レジスト。", "created_utc": "1643903424.0", "edited": "False", "id": "hvfkzsy", "is_submitter": "False", "link_id": "t3_sjl4m9", "parent_id": "t3_sjl4m9", "score": "12", "subreddit": "lowlevelaware", "subreddit_id": "t5_3754r"}, {"author": "ArkhanLahyet", "body": "[From KewbsUK](https://www.kewbz.com/pages/gan-251-m-comparison-guide?shpxid=8a3a09a7-4e28-4a97-8e36-ced6a991e68c):\n\n- Purple = 1.2N (weakest)\n- Blue = 1.7N\n- Green = 2.1N\n- Clear = 2.5N (strongest)", "created_utc": "1643578568.0", "edited": "False", "id": "huwmpzo", "is_submitter": "False", "link_id": "t3_sg1bmi", "parent_id": "t1_huvqje3", "score": "2", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "ArkhanLahyet", "body": "boku no baai wa nihongo wakaranai kara docchi de mo yominikui. toiuka, rōmaji no hou wa kībōdo de nyuuryoku shiyasui.", "created_utc": "1643410553.0", "edited": "False", "id": "hunb39l", "is_submitter": "False", "link_id": "t3_sesp87", "parent_id": "t1_hul9z9c", "score": "1", "subreddit": "lowlevelaware", "subreddit_id": "t5_3754r"}, {"author": "ArkhanLahyet", "body": "Maybe that's because of the weak magnets, but I don't think it's unstable at all. It's very smooth, feels kinda springy, very soft, and slice turns are especially effortless.", "created_utc": "1643400894.0", "edited": "False", "id": "hummgzn", "is_submitter": "False", "link_id": "t3_seio9j", "parent_id": "t1_humjlpq", "score": "3", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "ArkhanLahyet", "body": "\\- RS3M 2020 is on top of the list for sure.\n\n\\- Tengyun v1 because of how quiet it is, and it has a pretty unique feel.\n\n\\- The weilong wr m 2021, maglev and non-maglev, are among my favorites.", "created_utc": "1643399067.0", "edited": "False", "id": "humho0y", "is_submitter": "False", "link_id": "t3_seio9j", "parent_id": "t1_humcofy", "score": "4", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "ArkhanLahyet", "body": "Qiyi M-lube is good, it's a typical silicon lube that speeds up your cube a bit, kinda runny, pretty neutral and doesn't change the cube's feel very much. You should know that it's likely to leak during shipping, like mine did:\n\n[https://imgur.com/a/V5pSp11](https://imgur.com/a/V5pSp11)\n\nThe little plastic boxes they come in don't help, and the bottles leak and break easily too, so I recommend buying new bottles to transfer the lube if you can, [which is what I did.](https://i.imgur.com/PRJFIVm.jpg)\n\nI don't have gan lube, but reviews don't look good.\n\nAlternatively, you could try Picube lube from their store in Aliexpress, I don't have them but from what I've heard it's pretty typical silicon lube. [They also sell cubicle lube](https://pt.aliexpress.com/item/1005002581283327.html?spm=a2g0o.productlist.0.0.422e35a6V3gGb8&algo_pvid=6a9a7785-1cfd-4a17-9c71-e320cb75a1ed&algo_exp_id=6a9a7785-1cfd-4a17-9c71-e320cb75a1ed-0&pdp_ext_f=%7B%22sku_id%22%3A%2212000021254096655%22%7D&pdp_pi=-1%3B85.79%3B-1%3B2715%40salePrice%3BBRL%3Bsearch-mainSearch), but honestly the prices aren't good.", "created_utc": "1643316703.0", "edited": "False", "id": "huhnck7", "is_submitter": "False", "link_id": "t3_sdqcis", "parent_id": "t1_hugokuz", "score": "2", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "ArkhanLahyet", "body": "what manner of being is this", "created_utc": "1643304358.0", "edited": "False", "id": "hugp79z", "is_submitter": "False", "link_id": "t3_se350x", "parent_id": "t3_se350x", "score": "1", "subreddit": "magicTCG", "subreddit_id": "t5_2qn5f"}, {"author": "ArkhanLahyet", "body": "thx", "created_utc": "1643218497.0", "edited": "False", "id": "hubj7jw", "is_submitter": "False", "link_id": "t3_sd2hno", "parent_id": "t1_hubcfjd", "score": "2", "subreddit": "Genshin_Impact", "subreddit_id": "t5_12p4l2"}, {"author": "ArkhanLahyet", "body": "Just asking as a sanity check, I can get Yanfei to C4 this event if I want, but that's completely unnecessary if I put her in a team with Zhongli, right?", "created_utc": "1643216002.0", "edited": "False", "id": "hubc4v6", "is_submitter": "False", "link_id": "t3_sd2hno", "parent_id": "t3_sd2hno", "score": "0", "subreddit": "Genshin_Impact", "subreddit_id": "t5_12p4l2"}, {"author": "ArkhanLahyet", "body": "It was okay. I pulled for Zhongli (guaranteed) and Ganyu, got no early pulls and also lost Ganyu's 50/50  :(  \nI'm bummed because I lost it to a repeat Mona, when she and Jean are the only permanent 5-stars I have. I'm afraid I'll never look at her the same...\n\nBut I also got my C0 Yanfei to C3, got a new Beidou, Sara, and somehow got my C0 Xingqiu all the way to C6 plus a brand new Sacrificial Sword for him. This was 100% his banner.\n\nI'm tempted to use the last of my primogems on this banner if I don't want the 4-stars of the next one, but I have time to think. As of now Zhongli is making my life easier, omg his shield lasts like ten forevers.", "created_utc": "1643197639.0", "edited": "False", "id": "hua6z22", "is_submitter": "False", "link_id": "t3_saqd28", "parent_id": "t3_saqd28", "score": "2", "subreddit": "Genshin_Impact", "subreddit_id": "t5_12p4l2"}, {"author": "ArkhanLahyet", "body": "Even-layered cubes are typically more difficult to tension, I find my MGC 6x6 simply isn't as good as the 5 or the 7. And I share your pain of mislubing big cubes, it takes forever to take apart to clean them", "created_utc": "1642692930.0", "edited": "False", "id": "htgw75k", "is_submitter": "False", "link_id": "t3_s8apcn", "parent_id": "t1_htgsrl1", "score": "2", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "ArkhanLahyet", "body": "It better be something to do with the corner-edge magnets (the inner ones), like repelling the corner magnets in the middle of turns.\n\nBecause otherwise I cannot imagine the whole design team being so stupid as to think a \"one-magnet-maglev\" is an idea worthy of existing. Do they use one-pinced tweezers too? One-bladed scissors? Who are these people, one-person twins?", "created_utc": "1642613436.0", "edited": "False", "id": "htcc68c", "is_submitter": "False", "link_id": "t3_s7i2la", "parent_id": "t1_htbxn85", "score": "3", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "ArkhanLahyet", "body": "Acho q depende bastante do seu nível; se seu inglês for bem básico, conteúdo feito pra ensinar gramática, pronúncia e tal ajuda bastante. Se vc já entende razoavelmente o melhor é encontrar um hobby pra se expor a conteúdo em inglês, tipo livros se vc gosta de livros, jogos se vc gosta de jogos, ou qualquer outro tópico. Recomendo deixar filmes pra depois, pq comparativamente é bem difícil entender.", "created_utc": "1642537732.0", "edited": "False", "id": "ht82c0p", "is_submitter": "False", "link_id": "t3_s76rze", "parent_id": "t3_s76rze", "score": "2", "subreddit": "conversas", "subreddit_id": "t5_hwfuo"}, {"author": "ArkhanLahyet", "body": "afaik you'll only need to be ar 28 and have completed the archon interlude chapter (the new one with the jade chamber)", "created_utc": "1642536505.0", "edited": "False", "id": "ht7z133", "is_submitter": "False", "link_id": "t3_s6u1ck", "parent_id": "t1_ht7y451", "score": "1", "subreddit": "Genshin_Impact", "subreddit_id": "t5_12p4l2"}, {"author": "ArkhanLahyet", "body": "意味がなくてもいいんダ, 俺達人間もそうなんだかラ.", "created_utc": "1642536149.0", "edited": "False", "id": "ht7y247", "is_submitter": "False", "link_id": "t3_s725mm", "parent_id": "t3_s725mm", "score": "4", "subreddit": "lowlevelaware", "subreddit_id": "t5_3754r"}, {"author": "ArkhanLahyet", "body": "I believe it's the English words \"young zone\". No idea what it means, but nonsense English is pretty common in Japanese clothing.", "created_utc": "1642261408.0", "edited": "False", "id": "hsry6ot", "is_submitter": "False", "link_id": "t3_s4mefv", "parent_id": "t3_s4mefv", "score": "7", "subreddit": "DoesNotTranslate", "subreddit_id": "t5_2wrum"}, {"author": "ArkhanLahyet", "body": "Sim, é a melhor coisa q tem", "created_utc": "1642163864.0", "edited": "False", "id": "hsmdfs1", "is_submitter": "False", "link_id": "t3_s3jr4f", "parent_id": "t3_s3jr4f", "score": "1", "subreddit": "conversas", "subreddit_id": "t5_hwfuo"}, {"author": "ArkhanLahyet", "body": "Not at all. imo the trials are super disconnected from the quest.", "created_utc": "1641837304.0", "edited": "False", "id": "hs3ag71", "is_submitter": "False", "link_id": "t3_rw5n6w", "parent_id": "t1_hs21ipo", "score": "6", "subreddit": "Genshin_Impact", "subreddit_id": "t5_12p4l2"}, {"author": "ArkhanLahyet", "body": "Anemo slime lube causes side effects.", "created_utc": "1641819204.0", "edited": "False", "id": "hs21xx8", "is_submitter": "False", "link_id": "t3_s0cch7", "parent_id": "t1_hs1f29u", "score": "11", "subreddit": "Genshin_Impact", "subreddit_id": "t5_12p4l2"}, {"author": "ArkhanLahyet", "body": "I believe the pack that comes in one box is non-magnetic only.", "created_utc": "1641519915.0", "edited": "False", "id": "hrks760", "is_submitter": "False", "link_id": "t3_rx64ht", "parent_id": "t1_hrkqsmh", "score": "2", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "ArkhanLahyet", "body": "The game usually gets really laggy after a new banner comes out because everyone's wishing.", "created_utc": "1641387837.0", "edited": "False", "id": "hrckipt", "is_submitter": "False", "link_id": "t3_rw5n6w", "parent_id": "t1_hrcj3ph", "score": "9", "subreddit": "Genshin_Impact", "subreddit_id": "t5_12p4l2"}, {"author": "ArkhanLahyet", "body": "On desktop, it's on [the sidebar.](https://i.imgur.com/3rFnO1z.png)\n\nIf you're on mobile, it depends on the app. You'll have to look for the subreddit options somewhere.", "created_utc": "1640634593.0", "edited": "False", "id": "hq6n8ty", "is_submitter": "False", "link_id": "t3_rpf967", "parent_id": "t1_hq69ytq", "score": "1", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "ArkhanLahyet", "body": "The curve resembles maglev, where a large part of it is straight and then it curves up; but the difference is that springs are easier to change to produce the curve you want (e.g. pointier cone, rounder cone). But then again, I don't think that the non-linearity is noticeable in maglev, so it probably isn't with conical springs either.", "created_utc": "1640439430.0", "edited": "False", "id": "hpwyhya", "is_submitter": "True", "link_id": "t3_rmklzx", "parent_id": "t1_hpv192h", "score": "1", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "ArkhanLahyet", "body": "É a minha voz, só que melhor.", "created_utc": "1640403018.0", "edited": "False", "id": "hpvpwi3", "is_submitter": "False", "link_id": "t3_rnybi0", "parent_id": "t3_rnybi0", "score": "7", "subreddit": "conversas", "subreddit_id": "t5_hwfuo"}, {"author": "ArkhanLahyet", "body": "Ah, the thing that makes conical springs non-linear is that it doesn't compress evenly; the weak side compresses first and gets \"spent\" before the stiff side, so that the overall stiffness effectively increases. At the start, it behaves like a weak linear spring because a large proportion of the force goes to compress the weak side, and at the end, it behaves like a stiff linear spring because a large proportion of the force goes to compress the stiff side, resulting in a compression curve with variable slope.", "created_utc": "1640348320.0", "edited": "False", "id": "hpsuotn", "is_submitter": "True", "link_id": "t3_rmklzx", "parent_id": "t1_hprdq90", "score": "2", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "ArkhanLahyet", "body": "I'm glad that you could learn something new!\n\nAs for the effect of corner/edge magnets, if I understand you correctly, it's true that there's another curve to be considered, but it's a separate curve from the spring. While the spring curve describes the inward force in function of how much the center piece is being pushed away from the core, the curve for the corner/edge magnets would describe the magnetic force pressing layers together in function of the angle of a turn (it doesn't have a window in it, and it's periodic, repeating as you turn the cube repeatedly).\n\nIf you graph magnetic attraction in function of the angle (from 0˚ to 90˚ as a quarter-turn move completes), you get a U-shaped curve, but I think it's more interesting to model the force required for each additional angle of the turn. That curve starts high as you begin a turn because you need to overcome the magnetic attraction, then it lowers and may even become negative as the magnets get close together and finish the turn for you. You overshoot when there's enough inertia in the turn to go past the high part of the next turn (i.e. overcoming the magnetic attraction again as the magnets move past each other).\n\nNow, it's true that corner/edge magnets also affect the force (and thus friction) between the layers, but that's a different source of force, separate from the force applied by the springs. You can think of them as two separate sources of friction, that both affect how much force you're having to apply at any given moment.", "created_utc": "1640273243.0", "edited": "False", "id": "hpowonu", "is_submitter": "True", "link_id": "t3_rmklzx", "parent_id": "t1_hporhho", "score": "1", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "ArkhanLahyet", "body": "I pretty much just use the basics, and also the hints panel that shows x-cross solutions for you (the little lamp icon under the scramble opens a window with cross solutions. You have to enable extended cross hints in settings -> timer behavior -> scramble).\n\nIt also has an algorithm trainer, where the scrambles put you in OLL/PLL stage, and you can choose the possible cases for the scrambles. I personally don't use it but it's pretty cool to practice algs.", "created_utc": "1640268213.0", "edited": "False", "id": "hpolzhq", "is_submitter": "False", "link_id": "t3_rmvqrs", "parent_id": "t1_hpol2zc", "score": "2", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "ArkhanLahyet", "body": "If you've never manually moved your solves to history, then you've stayed in the same session, TwistyTimer doesn't do that automatically. Personally, that's a feature I don't use.", "created_utc": "1640267604.0", "edited": "False", "id": "hpoktq3", "is_submitter": "False", "link_id": "t3_rmvqrs", "parent_id": "t1_hpok82b", "score": "5", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "ArkhanLahyet", "body": "The way it works as far as I know is:\n\n* Global is your best averages that you've ever achieved. It means that somewhere in your history, you've achieved a sub-5 ao5, but it doesn't tell you which sequence of five solves that was, you only know that it happened at some point.\n* Session is like global, but only considers the current session. You can move your solves to history, thus starting a new session. It seems you only have one session since the beginning, so those are giving you the same numbers as global.\n* Current uses the latest values, so current ao5 will consider your five latest solves.\n\nI might be wrong about sessions, though.", "created_utc": "1640267117.0", "edited": "False", "id": "hpojwhf", "is_submitter": "False", "link_id": "t3_rmvqrs", "parent_id": "t3_rmvqrs", "score": "9", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "ArkhanLahyet", "body": "This has got to be the ultimate example of a product that's actually completely unrelated to what's printed on the box.", "created_utc": "1640266647.0", "edited": "False", "id": "hpoj1g2", "is_submitter": "False", "link_id": "t3_rmtc8o", "parent_id": "t3_rmtc8o", "score": "40", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "ArkhanLahyet", "body": "For best results, use only non-toxic silicon oils to lubricate living beings.", "created_utc": "1640266485.0", "edited": "False", "id": "hpoiqmp", "is_submitter": "False", "link_id": "t3_rmtc8o", "parent_id": "t1_hpogptz", "score": "33", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "ArkhanLahyet", "body": "Springs are more versatile with what you can achieve with them, but at least one idea that you'd need magnets to implement, would be adding magnetic tracks on the pieces to achieve 🧲𝕋ℝ𝕌𝔼 𝕄𝔸𝔾𝕃𝔼𝕍🧲. Somebody should get started on that.", "created_utc": "1640265272.0", "edited": "False", "id": "hpogm25", "is_submitter": "True", "link_id": "t3_rmklzx", "parent_id": "t1_hpnt00u", "score": "1", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "ArkhanLahyet", "body": "One of the things I believe is that the feel of a maglev cube can be replicated by choosing a spring of the right size and stiffness, so that you get the properties of maglev cubes without the added weight and cost of the magnets. Perhaps a triple spring tensioning system that could allow you to wind the spring tighter ( and narrower) or looser (and wider) to change its stiffness would finally let us achieve every possible feel. I don't think that would be even possible with magnets.", "created_utc": "1640264886.0", "edited": "False", "id": "hpofygb", "is_submitter": "True", "link_id": "t3_rmklzx", "parent_id": "t1_hpmxvbv", "score": "2", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "ArkhanLahyet", "body": "There's the additional factor of the lack of spring friction that most certainly contributes to making turns lighter, but I don't know how much of the overall effect comes from that, and how much comes from the magnets simply not exerting as much repelling force as a spring, when tensions are looser. I believe the shape of the curve is doing most of the work, but of course it may turn out to be that spring friction is more important than what I think. If that's the case, I guess the endgame would be managing to fit a bearing in the core to make it spin like a pc fan 💨\n\nI don't think the weight of the magnets affects the speed of turns directly, since it sits so close to the axis of rotation (the screw), and if it were to have an effect, it would be added inertia, increasing both the force required to start and to end a turn. Perhaps there's an effect where the added weight of the cube makes you hold it with ever so slightly more strength, making the turns seem lighter. But that's no more than a hypothesis.", "created_utc": "1640263759.0", "edited": "False", "id": "hpoe3c5", "is_submitter": "True", "link_id": "t3_rmklzx", "parent_id": "t1_hpnyalp", "score": "2", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "ArkhanLahyet", "body": "Thank you! It's a pleasure to know I've been of help.", "created_utc": "1640262424.0", "edited": "False", "id": "hpoc0wd", "is_submitter": "True", "link_id": "t3_rmklzx", "parent_id": "t1_hpnr1bz", "score": "3", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "ArkhanLahyet", "body": "Howdy! Not long ago I got my first maglev cubes and spent some time experimenting and thinking about the magnets and how they behave in a cube compared to springs. I put this write-up together mostly to dispel some misconceptions about maglev (and magnets and springs in general), but it turned out more like a lengthy analysis on tensioning in cubes. I hope I didn't overextend too much, but most of all I hope y'all could learn something new about your cubes!", "created_utc": "1640224696.0", "edited": "False", "id": "hpmu1wu", "is_submitter": "True", "link_id": "t3_rmklzx", "parent_id": "t3_rmklzx", "score": "22", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "ArkhanLahyet", "body": "I finally got around to solving my face-turning octahedron, but it locked up, popped and I just didn't want to put it together anymore, it's just not an enjoyable puzzle to turn. It's such a shame, because octahedra look so cool...", "created_utc": "1640002979.0", "edited": "False", "id": "hpacx36", "is_submitter": "False", "link_id": "t3_rkf5bz", "parent_id": "t3_rkf5bz", "score": "3", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "ArkhanLahyet", "body": "Those plastic mini-sword-thingies that come with the WR M 2021 are super useful! Not for their intended purpose, of course, I use them as tiny levers to remove center caps because they don't scratch the cube like metal flathead screwdrivers do.", "created_utc": "1639911216.0", "edited": "False", "id": "hp5mryr", "is_submitter": "False", "link_id": "t3_rjpcca", "parent_id": "t3_rjpcca", "score": "3", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "ArkhanLahyet", "body": "Ooh, that's lube from cuberbrasil, right? What do you think of them?", "created_utc": "1639753983.0", "edited": "False", "id": "hoxck9p", "is_submitter": "False", "link_id": "t3_rhrpe8", "parent_id": "t3_rhrpe8", "score": "1", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "ArkhanLahyet", "body": "I recently got a Tengyun V1 and it came soaked with lube. It's nice to see that after all this time Dayan is still Dayan. Apart from that, I'm loving the cube. It's so quiet and it has a really soft feel, and for some reason the M slices are amazing. I can't quite get *how* this cube is so soft and quiet; it's probably in no small part thanks to the plastic, but my hypothesis is that the pieces go relatively deeper into the cube, and they're held in place by the base more than in other cubes, so that shape helps dampen the collision between pieces and reduces friction near the outside.\n\nEither way, I'll be using this cube a lot late at night.", "created_utc": "1639678970.0", "edited": "False", "id": "hot6zlq", "is_submitter": "False", "link_id": "t3_rhj207", "parent_id": "t3_rhj207", "score": "3", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "ArkhanLahyet", "body": "There are charts comparing lube by [the cubicle](https://cdn.shopify.com/s/files/1/0035/5205/1273/files/full_lube_pamphlet.jpg?v=1593706590) and [speedcubeshop (scroll down)](https://speedcubeshop.com/a/blog/what-is-speed-cube-lube) (I don't know if other stores have that too). I don't have a collection of lubes from those stores, so I can't help much with what they actually feel like, but the charts are a good place to start. It shows, for example, that galaxy is meant to be a little bit faster and less gummy than nebula.", "created_utc": "1639656602.0", "edited": "False", "id": "horrygn", "is_submitter": "False", "link_id": "t3_rgqzw7", "parent_id": "t1_hor583y", "score": "1", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "ArkhanLahyet", "body": "The wr m maglev doesn't really benefit from fast lubes, because it's very fast on loose tensions, and not very good at all on tight tensions. \n\nIf you still want fast lubes, celeritas is gliding fast. But I don't know if it could speed up a wr m maglev because it's already so fast.", "created_utc": "1639607857.0", "edited": "False", "id": "hopdt8m", "is_submitter": "False", "link_id": "t3_rgqzw7", "parent_id": "t1_hop2fzx", "score": "2", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "ArkhanLahyet", "body": "It's perfectly acceptable to have more than one main. In fact, most people have *deux mains*!\n\n\\*Cue laugh track\\*", "created_utc": "1639585284.0", "edited": "False", "id": "honrqx0", "is_submitter": "False", "link_id": "t3_rgqzw7", "parent_id": "t1_honjg9n", "score": "8", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "ArkhanLahyet", "body": "The magnet kit is so cheap and easy to install/remove that you may as well get it. Personally, I tried it and decided I prefer the cube without them, but that's going to vary by person. It gives the cube a bumpier feel.\n\nAs for stickered/stickerless, pretty much everyone is getting stickerless cubes these days. I'd say the only reasons to get stickered cubes are aesthetic, or custom shades for the colorblind, or if you really dislike the frosted plastic of modern cubes.\n\n(I can't help much with lube because I don't have any scs lube, but Lunar is a popular option.)", "created_utc": "1639344193.0", "edited": "False", "id": "hoapi54", "is_submitter": "False", "link_id": "t3_rehj3h", "parent_id": "t1_hoamed6", "score": "2", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "ArkhanLahyet", "body": "When it comes to 6x6, they're just less stable puzzles than 5x5 or 7x7 and require a more accurate turning style. My mgc 6x6 is looser and slower than my mgc 7, and misaligns occasionaly. Fast lube helps, just be careful not to overlube it because cleaning big cubes is painful.", "created_utc": "1639167362.0", "edited": "False", "id": "ho12thk", "is_submitter": "False", "link_id": "t3_rd0rxf", "parent_id": "t1_ho0xvdi", "score": "1", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "ArkhanLahyet", "body": "In my experience, using your cube without lube doesn't ruin it or anything, just seems to ever so slightly accelerate wear on the plastic. You should try using a small amount of some fast or neutral silicon lube. Qiyi m-lube, for example, doesn't change the feel of the cube very much.\n\nAnd it's known that some water-based lubes leave residue, but I haven't experienced that with DNM. Probably because I always pair it with other lube.", "created_utc": "1639166840.0", "edited": "False", "id": "ho11ihv", "is_submitter": "False", "link_id": "t3_rd0rxf", "parent_id": "t1_ho0waxm", "score": "5", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "ArkhanLahyet", "body": "Just imagine if aliens come to Earth and give us new technology, but it's all cubes. I'd be happy and disappointed.", "created_utc": "1639067681.0", "edited": "False", "id": "hnvae4j", "is_submitter": "False", "link_id": "t3_rca6mm", "parent_id": "t1_hnut9no", "score": "2", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "ArkhanLahyet", "body": "É bom. É o tipo de história que não explica nada, vc vai aprendendo sobre o mundo aos poucos. Acho q ñ é pra todo mundo, mas tem uma estética bem legal.", "created_utc": "1639061407.0", "edited": "False", "id": "hnuv1xq", "is_submitter": "False", "link_id": "t3_rcg0s8", "parent_id": "t1_hnutmae", "score": "2", "subreddit": "conversas", "subreddit_id": "t5_hwfuo"}, {"author": "ArkhanLahyet", "body": "Sabe oq isso me lembra? No mangá BLAME! tem uma parte que os protagonistas vão num lugar onde eles são bem mais altos que todo mundo.\n\nhttps://i.imgur.com/npUfJFT.jpg\n\nSó tô dizendo q eu ñ ligaria", "created_utc": "1639058246.0", "edited": "False", "id": "hnuobl0", "is_submitter": "False", "link_id": "t3_rcg0s8", "parent_id": "t1_hnucnvj", "score": "2", "subreddit": "conversas", "subreddit_id": "t5_hwfuo"}, {"author": "ArkhanLahyet", "body": "Qiyi M-lube is pretty good, but man, are the bottles bad. If you close the bottle too strongly the dropper tip breaks, and if you close it too loose the bottle leaks. So I decided to buy some new 10ml dropper bottles, transferred the lube (and the labels), and now it's exactly the way it should be: [https://i.imgur.com/PRJFIVm.jpg](https://i.imgur.com/PRJFIVm.jpg)\n\nAlso PSA, if you buy M-lube from China some of the lube comes outside the bottle. [It's that bad.](https://imgur.com/a/X9yndja) This is a rare occasion where I'd pay more for better packaging.", "created_utc": "1639055554.0", "edited": "False", "id": "hnuj7al", "is_submitter": "False", "link_id": "t3_rca6mm", "parent_id": "t3_rca6mm", "score": "3", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "ArkhanLahyet", "body": "Whenever I'm not doing great at 3x3, I try to improve on big cubes for a while. Sometimes I stop cubing for a few days and go do something else. It's fine to take a break if you're not enjoying things.", "created_utc": "1639054388.0", "edited": "False", "id": "hnuh61z", "is_submitter": "False", "link_id": "t3_rca6mm", "parent_id": "t1_hnue8kl", "score": "5", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "ArkhanLahyet", "body": "Algorithmic f2l exists, and I reckon it has existed for a very long time; while most of the simple cases can be done without memorizing algs, once you get to a certain level, optimal f2l solutions can be very nonintuitive. Not to mention winter variation and other alg sets.\n\nBut I'm opposed to the idea of grinding f2l algs like with OLL/PLL. I think a more effective way to learn advanced f2l is seeing it less like algs to be memorized and more like clever tricks that you pick up with time, like watching example solves and going \"ohh.. that's a nice way to solve that case!\". There are also many techniques that can be applied to handle a multitude of scenarios. Overall f2l still feels like a different step than last layer, in the fringe of the intuitiveness of the first two layers.", "created_utc": "1638999046.0", "edited": "False", "id": "hnrqomh", "is_submitter": "False", "link_id": "t3_rbj88v", "parent_id": "t1_hnrgy5y", "score": "3", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "ArkhanLahyet", "body": "I'd say that's more like a rough guideline;  it warns that you shouldn't move on to more advanced stuff before you properly master the basics, because advanced techniques kinda require you to be comfortable with the more basic ways to do stuff (and that continues to be true as you learn new f2l techniques, fancier OLL/PLL prediction and the such). So it's not purely a matter of time, but familiarity with what you know, and ultimately you're the one who knows best if you're ready to advance.\n\nBesides, there are many things other than method that influence your times. Tps, fingertricks, lookahead, properly planning your cross. Different people are good at different things, and will advance in different aspects of cubing at different speeds.\n\nAnd also, my view of it is that you don't necessarily have to track your progress in your cubing journey in terms of your times. It's perfectly fine to focus on what you enjoy more.", "created_utc": "1638998315.0", "edited": "False", "id": "hnror6m", "is_submitter": "False", "link_id": "t3_rbj88v", "parent_id": "t1_hnrjoj3", "score": "2", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "ArkhanLahyet", "body": "I mean... I'm kinda fine with it? As long as Samsung spends their bag of cash on development I'm fine with finding a random FB on my phone that I can just uninstall.", "created_utc": "1638971250.0", "edited": "False", "id": "hnpsy2n", "is_submitter": "False", "link_id": "t3_rbev1g", "parent_id": "t1_hnozpfr", "score": "2", "subreddit": "samsung", "subreddit_id": "t5_2rkar"}, {"author": "ArkhanLahyet", "body": "My favorite feeling cube right now is the rs3m with mystic and dnm. Mystic feels... slimy. It's exactly what you'd expect aloe lube to feel like. And the cube is naturally crispy. The result sounds and feels so refreshing, it's like a marble machine that you turn with your hands.", "created_utc": "1638741781.0", "edited": "False", "id": "hndoo07", "is_submitter": "False", "link_id": "t3_r981m7", "parent_id": "t1_hncz9qn", "score": "1", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "ArkhanLahyet", "body": "For anyone who wants to write a 3x3 scrambler, here are just some obstacles in the way of writing a scrambler:\n\n* Some sequences of moves are redudant. For example, R L R' is just L. Less obviously, R' L' F2 B2 R L D R' L' F2 B2 R L is the same as U. How is your program going to avoid sequences that are equivalent to something shorter?\n* More generally, you'd like all possible scrambles to be generated with equal probability (that's an [actual wca rule](https://www.worldcubeassociation.org/regulations/#4b3)), but evidently some scrambles are \"easier to reach\" than others. If you want a homogeneous distribution of scrambles, you pretty much have to start with a scrambled cube and generate a solve, and then use that sequence as your scramble. This is called a random state scramble.\n* [TNoodle](https://www.worldcubeassociation.org/regulations/scrambles/) is the current official scrambler that wca uses, and it's a random state scrambler based on [Kociemba's Algorithm](https://en.wikipedia.org/wiki/Optimal_solutions_for_Rubik%27s_Cube#Kociemba's_algorithm). More about the algorithm and how it was used to prove that any cube can be solved in 20 moves: [https://youtu.be/YsWKrxAbopk](https://youtu.be/YsWKrxAbopk)", "created_utc": "1638455036.0", "edited": "False", "id": "hmxmz92", "is_submitter": "False", "link_id": "t3_r6wclj", "parent_id": "t1_hmwu50w", "score": "14", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "ArkhanLahyet", "body": "Ciarán Beahan, current world #4 at single and average 5x5, thinks that Yau is better than Redux. He has a [video where he goes over the details](https://youtu.be/1yNTZ56D61Q), definitely watch to help you decide. He also has some videos with Yau advice for 5x5, which I also recommend.\n\nDisclaimer: I prefer Yau over reduction, but I recommend learning both and using whichever you like best. And also, note that yau5 is a separate thing, it's a variation on yau for 5x5 where you solve two f2l edges first during edge pairing.", "created_utc": "1638360211.0", "edited": "False", "id": "hmsc1d7", "is_submitter": "False", "link_id": "t3_r66vru", "parent_id": "t1_hmsalm5", "score": "7", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "ArkhanLahyet", "body": "You don't really need soap to clean a cube, using paper towels ought to be enough. You can use a thin plastic object like a pen cap to help wipe the hard to reach parts of the pieces. (Don't use metal objects like screwdrivers because that can scratch the plastic.)", "created_utc": "1638312625.0", "edited": "False", "id": "hmq14bz", "is_submitter": "False", "link_id": "t3_r5fb0t", "parent_id": "t1_hmpzkvt", "score": "4", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "ArkhanLahyet", "body": "Agreed, I wish there was a 0.4 setting.", "created_utc": "1638293891.0", "edited": "False", "id": "hmoqgks", "is_submitter": "False", "link_id": "t3_r5fb0t", "parent_id": "t1_hmoperc", "score": "3", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "ArkhanLahyet", "body": "I love the 354M and it's still my main, so opinions may vary ;)\n\nBut the 354 V2 should be easier to work with, with the numerical ipg nuts. I don't know how they compare to each other.", "created_utc": "1638292716.0", "edited": "False", "id": "hmonfs1", "is_submitter": "False", "link_id": "t3_r5fb0t", "parent_id": "t1_hmoibj4", "score": "2", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "ArkhanLahyet", "body": "Yeah, overload is another tricky one. The overload reminder text in Japanese [[Winds of Abandon]] (can scryfallbot find specific languages?) is basically the whole text all over again explaining what the overloaded effect does. Which works, I guess, but makes the card seem super complicated and a lot less interesting imo. Many of these \"clever\" cleaver wordings could probably be translated one way or another, but it may be difficult to keep the text clear and nice to read.", "created_utc": "1638287557.0", "edited": "False", "id": "hmoacbi", "is_submitter": "False", "link_id": "t3_r5lrg6", "parent_id": "t1_hmo5l8a", "score": "9", "subreddit": "magicTCG", "subreddit_id": "t5_2qn5f"}, {"author": "ArkhanLahyet", "body": "There's a lot of cool ideas that work in English, but when the cleaved text needs to be a subset of the non-cleaved text in 11 languages, that actually puts quite a limitation on what you can come up with. For example, the \"artifact [or] creature\" idea doesn't work in French, because \"créature-artefact\" has a hyphen.\n\nI mean, I like that cleave is a thing, but it's weird that it depends on the grammar of the language that the text is printed in.", "created_utc": "1638284145.0", "edited": "False", "id": "hmo2agk", "is_submitter": "False", "link_id": "t3_r5lrg6", "parent_id": "t1_hmnlvcm", "score": "117", "subreddit": "magicTCG", "subreddit_id": "t5_2qn5f"}, {"author": "ArkhanLahyet", "body": "Time Fracture doesn't work in Japanese, to begin with, because the cleaved text \"コントロールするパーマネント\" isn't contained in the non-cleaved \"コントロールしていないパーマネント\". Battle for the Furnace doesn't work either, because \"artifact creature\" would be spelled with an interpunct, like \"アーティファクト・クリーチャー\", same for French which uses \"créature-artefact\" with a hyphen. Idk about other languages but yeah, it's weird to have rules that depend on a specific language's grammar.", "created_utc": "1638283346.0", "edited": "False", "id": "hmo0irn", "is_submitter": "False", "link_id": "t3_r5lrg6", "parent_id": "t1_hmns7by", "score": "25", "subreddit": "magicTCG", "subreddit_id": "t5_2qn5f"}, {"author": "ArkhanLahyet", "body": "The set that contains 0 is definitely different from the empty set. In fact, there are [ways to define the natural numbers in terms of sets](https://en.wikipedia.org/wiki/Set-theoretic_definition_of_natural_numbers). For example, in Zermelo-Fraenkel set theory, 0 is the name of the empty set and 1 is the name of the set that contains the empty set.", "created_utc": "1638282130.0", "edited": "False", "id": "hmnxy0q", "is_submitter": "False", "link_id": "t3_r5dhxx", "parent_id": "t1_hmnihrj", "score": "5", "subreddit": "magicTCG", "subreddit_id": "t5_2qn5f"}, {"author": "ArkhanLahyet", "body": "Huh, jinzita (pyramid) is literally gold-letter-tower. TIL. Apparently it's a \"building shaped like the letter 金\".", "created_utc": "1638275681.0", "edited": "False", "id": "hmnlyxs", "is_submitter": "False", "link_id": "t3_r5fk11", "parent_id": "t3_r5fk11", "score": "1", "subreddit": "NewCubes", "subreddit_id": "t5_2zngwa"}, {"author": "ArkhanLahyet", "body": "Clicking sound is probably loose magnets. You can disassemble it (I know, it's a pain) or remove the edges one by one to try and locate which one(s) have loose magnets. Then it's just a matter of opening the pieces to glue the magnets, just be sure to get the polarity right.\n\nAlso, that green side looks darker than I've seen elsewhere, does it look like that in real life?", "created_utc": "1638210208.0", "edited": "False", "id": "hmk5oym", "is_submitter": "False", "link_id": "t3_r51eym", "parent_id": "t3_r51eym", "score": "3", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "ArkhanLahyet", "body": "I finally got around to reassembling my mgc6 after putting it off for a while.\n\n[Progress pics](https://imgur.com/a/29Vfoft). Tape saved the day.\n\nMy mgc6 had been slow and sluggish latety, I'm pretty sure it was overlubed (my fault). Cleaning it helped a bit, but it's still slower than both the mgc5 and the mgc7, does anyone else feel that way? My 7x7 is tensioned significantly tighter than the 6x6 but it's still faster. They're both lubed with a small amount of Qiyi M-lube.", "created_utc": "1638113891.0", "edited": "False", "id": "hmerfxr", "is_submitter": "False", "link_id": "t3_r3wbne", "parent_id": "t3_r3wbne", "score": "2", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "ArkhanLahyet", "body": "My face-turning octahedron is literally the only unsolved puzzle in my collection. I need to re-figure out how to solve it but it's just not enjoyable to turn...", "created_utc": "1638051258.0", "edited": "False", "id": "hmbqzgi", "is_submitter": "False", "link_id": "t3_r35u6o", "parent_id": "t1_hmba7fc", "score": "6", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "ArkhanLahyet", "body": "0.8 is looser than 0.6.", "created_utc": "1638038866.0", "edited": "False", "id": "hmaxotn", "is_submitter": "False", "link_id": "t3_r35u6o", "parent_id": "t1_hmavz3k", "score": "6", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "ArkhanLahyet", "body": "Feliks Zemdegs commented recently in Tingman's charity livestream that he has been using the Leap.\n\n[https://youtu.be/a-nOoYwFqPM?t=27294](https://youtu.be/a-nOoYwFqPM?t=27294)", "created_utc": "1637979298.0", "edited": "False", "id": "hm85p5s", "is_submitter": "False", "link_id": "t3_r2favm", "parent_id": "t1_hm7zfod", "score": "5", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "ArkhanLahyet", "body": "Wow your comment was 1 sentence lol\n\nBut seriously though, that's amazing 👏", "created_utc": "1637934524.0", "edited": "False", "id": "hm5jtyg", "is_submitter": "False", "link_id": "t3_r2fkud", "parent_id": "t1_hm5j6f6", "score": "6", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "ArkhanLahyet", "body": "I feel like a beginner all over again for having trouble assembling a 6x6 😮\n\nWhat part of the assembly did you find hardest?", "created_utc": "1637933834.0", "edited": "False", "id": "hm5ints", "is_submitter": "False", "link_id": "t3_r2fkud", "parent_id": "t1_hm4f0xd", "score": "6", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "ArkhanLahyet", "body": "whoooa  \nSee, I don't buy from those stores abroad mostly because shipping, duty and taxes pretty much double the price of anything I want to buy. Like, the Gan Duo on sale + some lube would be [$35 + $22 shipping + $55 taxes](https://i.imgur.com/QmkX0kX.png). If that wasn't a problem I think I'd do stuff like that too lol\n\nBut really, I also think you should get the mgc sq-1 instead of the volt. But I don't have either, so who am I to say.", "created_utc": "1637932940.0", "edited": "False", "id": "hm5h70p", "is_submitter": "False", "link_id": "t3_r2favm", "parent_id": "t1_hm59t5l", "score": "3", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "ArkhanLahyet", "body": "They're Aa and Ab from two different angles. You don't have to learn multiple algs for each case, especially not if you're still learning full PLL, just pick the one you like best for each.", "created_utc": "1637931731.0", "edited": "False", "id": "hm5fbt6", "is_submitter": "False", "link_id": "t3_r2favm", "parent_id": "t1_hm5dwm7", "score": "3", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "ArkhanLahyet", "body": "Well, you could always mirror it yourself too see if you get a viable alg. And if you look at algdb it has this one:\n\nr2 D' r U r' D r2 U' r' U' r\n\n(at http://algdb.net/puzzle/333/oll/oll29)\n\nI personally didn't know this one, so I don't know the optimal fingertricks.", "created_utc": "1637891373.0", "edited": "False", "id": "hm3sf0s", "is_submitter": "False", "link_id": "t3_r1ohj3", "parent_id": "t1_hm3rrbl", "score": "2", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "ArkhanLahyet", "body": "Do you mean OLL 29 and 30 with l, r and D? If it's those, Jperm uses them: https://youtu.be/vU6HsK3hvQs?t=588", "created_utc": "1637890670.0", "edited": "False", "id": "hm3r3jg", "is_submitter": "False", "link_id": "t3_r1ohj3", "parent_id": "t1_hm3otng", "score": "1", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "ArkhanLahyet", "body": "* Moyu RS3M 2020: Very good value, priced like a budget cube but performs closer to a flagship. A downside is that it almost always comes with spring noise, which can be fixed with lube, or a premium setup, or you could get the 2021 maglev version.\n* Moyu Weilong WR M 2021: Very fast and has adjustable magnets. Also has a maglev version with purple internals that's even faster. However, some people complain about loose magnets, so QC is probably not the best.\n* Qiyi X-Man Tornado V2: Also has adjustable magnets. Some people don't like it because its corner cutting is comparatively not that great, others don't mind. It's also very quiet and it's said that it feels like a gan cube.\n* Special mention to the Tengyun M, kinda older and doesn't have a dual adjustment system or adjustable magnets, but is the quietest cube and performs well.\n\nThere are others, but these are basically the best sellers right now. The Gan 11 M Pro is also popular but it's $65.\n\nI think the Gan 356M isn't a bad choice, but right now, if you're looking at speedcubeshop, I highly recommend going for the Gan 11 M Duo instead, which normally costs over $40 but it's on sale there. It's almost identical to the Gan 11 M Pro, just with fixed corner-core magnets instead of adjustable (which isn't a big deal). I don't have one myself, but I have no doubt that it's great.", "created_utc": "1637890398.0", "edited": "False", "id": "hm3qkie", "is_submitter": "False", "link_id": "t3_r1ohj3", "parent_id": "t1_hm3o6ve", "score": "2", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "ArkhanLahyet", "body": "This minimalist logo trend is so sad. The worst part is that MGC's logo was already pretty simple, now it looks like a cheap knockoff.\n\nLike, modern redesigns tend to remove too much of what made the original logo identifiable to begin with, and then we're left with a plain non-descriptive low-effort logo, like anyone could've come up with it regardless of skill, and that makes it come off as less authentic. That's totally what happened to the new MGC logo, it didn't need any \"improvement\" and now it looks like a rushed job.", "created_utc": "1637756019.0", "edited": "False", "id": "hlw4qwe", "is_submitter": "False", "link_id": "t3_r0nlok", "parent_id": "t3_r0nlok", "score": "9", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "ArkhanLahyet", "body": "The year is 20XX. Everyone plays geo teams at TAS levels of perfection. Because of this, the winner of a match depends solely on crit rng. The Rock Paper Scissors metagame has evolved to ridiculous levels due to it being the only remaining factor to decide battles. Humanity has reached its pinnacle. The low tier peasants are living in poverty. It seems nothing can stop the unceasing release of new geo characters, and their players, the geo monks who live in great monasteries where they sit on geo constructs while crystallizing with one hand, and clearing the spiral abyss with the other. The abyss metagame has gotten to this point where everything is played out to theoretical perfection, so speedrunners repeatedly clear the abyss until every hit is a crit, and that's the game.", "created_utc": "1637707074.0", "edited": "False", "id": "hltsjx8", "is_submitter": "False", "link_id": "t3_r0p0nz", "parent_id": "t1_hltr4gs", "score": "10", "subreddit": "Genshin_Impact", "subreddit_id": "t5_12p4l2"}, {"author": "ArkhanLahyet", "body": "And I should add, I heard that from Speedcubeshop's [review of the maglev version](https://youtu.be/DjeeBsmmroY?t=25) where Cameron mentions that \"Moyu discontinued the fancy packaging\", but looking back at it I'm not sure if he was referring to the maglev version only. Either way I think the \"lite\" packaging was a good decision, I don't think anyone liked the clumsy box of spare pieces so it's good that we don't have to pay for it", "created_utc": "1637703391.0", "edited": "False", "id": "hltjil3", "is_submitter": "False", "link_id": "t3_r05ejm", "parent_id": "t1_hltaca2", "score": "2", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "ArkhanLahyet", "body": "It's literally the same cube, but with less packaging, and without a replacement core (which honestly, you're not going to need anyway). It's a win-win, because it's cheaper as well.", "created_utc": "1637702047.0", "edited": "False", "id": "hltg4ak", "is_submitter": "False", "link_id": "t3_r05ejm", "parent_id": "t1_hltaca2", "score": "2", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "ArkhanLahyet", "body": "If you're not sure, the RS3M 2020 is incredibly good value and you can't go wrong with it, but it's pretty much certain to come with spring noise; you can buy lube (recommended anyway) to lube the springs, or get the 2021 maglev version.\n\nThe weilong wr m 2021 is also good, and the lite version is the same cube as the regular version, which afaik was discontinued.", "created_utc": "1637699343.0", "edited": "False", "id": "hlt975g", "is_submitter": "False", "link_id": "t3_r05ejm", "parent_id": "t1_hlt05hf", "score": "3", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "ArkhanLahyet", "body": "In no particular order:\n\n* Moyu Weilong WR M 2021 (also has a maglev version with purple internals)\n* Moyu RS3M 2020 (amazing value, also has a 2021 version that's maglev)\n* Qiyi X-Man Tornado V2\n* Gan's latest flagships: Gan 11 M Duo, Gan 11 M Pro, Gan 12 Leap, Gan 12 Maglev.\n\nTengyun is still many people's favorite, and continues to be the quietest cube.", "created_utc": "1637629342.0", "edited": "False", "id": "hlplwun", "is_submitter": "False", "link_id": "t3_qzdise", "parent_id": "t1_hlpcj87", "score": "4", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "ArkhanLahyet", "body": "Both the cubicle and speedcubeshop have infographics comparing their lube: [Cubicle lube](https://cdn.shopify.com/s/files/1/0035/5205/1273/files/full_lube_pamphlet.jpg?v=1593706590), [Speedcubeshop cosmic lube (scroll down)](https://speedcubeshop.com/a/blog/what-is-speed-cube-lube). Idk about other shops.\n\n* Water-based lubes (like Stardust and DNM-37) are the fastest you can get, but they don't last very long.\n* I haven't tried cosmic lube, but I think people like them. Lunar is said to be fast. Speedcubeshop claims that Lunar + Stardust is fast and lasts long, but I can't personally confirm that.\n* My personal favorite is combining Mystic + DNM-37.", "created_utc": "1637587147.0", "edited": "False", "id": "hlmvk63", "is_submitter": "False", "link_id": "t3_qzdise", "parent_id": "t1_hlmnp30", "score": "6", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "ArkhanLahyet", "body": "It's good, just make sure to use the correct fingertricks. Doing the first two U' moves with your left index lets you regrip your right hand during the second U', so that you can execute the next two R moves in one rising motion.", "created_utc": "1637428549.0", "edited": "False", "id": "hlelh9n", "is_submitter": "False", "link_id": "t3_qxy9hq", "parent_id": "t1_hlek1qw", "score": "3", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "ArkhanLahyet", "body": "I know right? I'll complain as much as the next guy about Gan cubes being overpriced, but we have to admit that their quality control is great, my Gan RS came pristine out of the box, not a single scratch.", "created_utc": "1637427703.0", "edited": "False", "id": "hlejha8", "is_submitter": "False", "link_id": "t3_qxy9hq", "parent_id": "t1_hle7uu6", "score": "3", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "ArkhanLahyet", "body": "This kind of intuition comes with time and practice, I suppose. Feliks can glance at a cross and tell if it's good because he's a super skilled cuber. But personally, I can't plan the first pair within the time it takes to decide if a cross is good. I'm at the level where I can kind of plan a first pair, but only sometimes; I think it's better to not take too long deciding the cross color, just pick an okay cross because you should use your inspection time for more important things like thinking of the fingertricks for the cross, and of course, the first pair.", "created_utc": "1637427552.0", "edited": "False", "id": "hlej47z", "is_submitter": "False", "link_id": "t3_qxy9hq", "parent_id": "t1_hleankv", "score": "3", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "ArkhanLahyet", "body": "Me too, and on top of that frosted plastic was supposed to help hide scratches but my Moyu cubes always come scratched out of the box anyway 😒", "created_utc": "1637421258.0", "edited": "False", "id": "hle4or9", "is_submitter": "False", "link_id": "t3_qxy9hq", "parent_id": "t1_hldx4qv", "score": "2", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "ArkhanLahyet", "body": "The Gan 354 M was my first magnetic cube too (and first stickerless). I guess it's a combination of the glossy plastic, the size and having found the perfect settings for it. Been thinking about getting a Tengyun, but I don't think I'm ready to step into the gan flagships yet lol", "created_utc": "1637417217.0", "edited": "False", "id": "hldwm9b", "is_submitter": "False", "link_id": "t3_qxy9hq", "parent_id": "t1_hldpexg", "score": "2", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "ArkhanLahyet", "body": "So, the only remaining 4-star characters I needed were Bennett and Fischl. Yesterday I got enough starglitter and bought a Bennett from the store, and then somehow sniped a Fischl from the standard banner using the wishes from Bennett's ascension. So, it turns out *my* Bennett is the luckiest guy alive lol", "created_utc": "1637413308.0", "edited": "False", "id": "hldq0b4", "is_submitter": "False", "link_id": "t3_qtmqsj", "parent_id": "t3_qtmqsj", "score": "16", "subreddit": "Genshin_Impact", "subreddit_id": "t5_12p4l2"}, {"author": "ArkhanLahyet", "body": "I have an RS3M 2020, a WR M 2021 and a Gan RS that I magnetized, and I still perform best on my old-ish Gan 354 M. Anyone else in a similar situation? I love the texture and feel of my newer cubes, but I can just turn faster on the 354 without locking up.", "created_utc": "1637412569.0", "edited": "False", "id": "hldovwb", "is_submitter": "False", "link_id": "t3_qxy9hq", "parent_id": "t3_qxy9hq", "score": "2", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "ArkhanLahyet", "body": "This color scheme with white opposite to blue was the original one used in the earliest cubes. It's just that Rubik's switched blue and yellow pretty early on but kept them the same in Japan for some reason, so today we call it the Japanese color scheme.", "created_utc": "1636893293.0", "edited": "False", "id": "hkkxhmq", "is_submitter": "False", "link_id": "t3_qtbr06", "parent_id": "t1_hkk7g7d", "score": "5", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "ArkhanLahyet", "body": "Nice! I remember I knew someone who had a black Zhanchi with blue torpedoes and I thought it looked really unique. I miss the times when you could buy a cube as a DIY kit and all the pieces came disassembled in a bag.", "created_utc": "1636596239.0", "edited": "False", "id": "hk5f4r8", "is_submitter": "False", "link_id": "t3_qr7r2u", "parent_id": "t3_qr7r2u", "score": "8", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "ArkhanLahyet", "body": "Do you mean the original versions from ten years ago? I took pictures for you.\n\n[https://imgur.com/a/tWxsp1A](https://imgur.com/a/tWxsp1A)\n\n(ruler is in centimeters)", "created_utc": "1636567561.0", "edited": "False", "id": "hk3h9yz", "is_submitter": "False", "link_id": "t3_qqmmoe", "parent_id": "t1_hk3c0xa", "score": "3", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "ArkhanLahyet", "body": "There's also [Ixion](https://www.britannica.com/topic/Ixion-Greek-mythology), the dude from Greek mythology who tried to seduce Zeus's wife, and then Zeus put him on a wheel of fire that spins in the sky forever. Makes for quite an image.", "created_utc": "1635946536.0", "edited": "False", "id": "hj59n1d", "is_submitter": "False", "link_id": "t3_qln7l3", "parent_id": "t1_hj4ublc", "score": "3", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "ArkhanLahyet", "body": "Thanks! I did it in Inkscape, and the font is called [xkcd-font](https://github.com/ipython/xkcd-font), it's derived from Randall Munroe's handwriting.", "created_utc": "1635780601.0", "edited": "False", "id": "hiw6egb", "is_submitter": "True", "link_id": "t3_qkbn16", "parent_id": "t1_hiw3b6s", "score": "8", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "ArkhanLahyet", "body": "Sério, toda vez que alguém mostra um chuveiro elétrico no reddit só vem gringo comentar de como aquilo vai te eletrocutar, como nunca chegaria perto, etc\n\nE tbm encontra um brasileiro ou outro falando q é normal\n\nTipo aqui: https://www.reddit.com/r/OSHA/comments/b1v207/2nd\\_leading\\_cause\\_of\\_death\\_in\\_costa\\_rica/", "created_utc": "1635775038.0", "edited": "False", "id": "hivu9e9", "is_submitter": "False", "link_id": "t3_qkco0q", "parent_id": "t1_hivt84z", "score": "24", "subreddit": "conversas", "subreddit_id": "t5_hwfuo"}, {"author": "ArkhanLahyet", "body": "Mano, o que não é vantagem é aceitar trabalho excessivo desse jeito, vc tá vendendo seu esforço por pouco. Inteligência cognitiva é um mero componente de várias capacidades q vc pode ter, também precisa ter boa estratégia pra lidar com pessoas e situações.\n\nClaro q o melhor é ir pra algum lugar onde seu trabalho seja bem reconhecido, mas tais lugares são lenda kk", "created_utc": "1635773855.0", "edited": "False", "id": "hivrw2e", "is_submitter": "False", "link_id": "t3_qk5fem", "parent_id": "t3_qk5fem", "score": "2", "subreddit": "conversas", "subreddit_id": "t5_hwfuo"}, {"author": "ArkhanLahyet", "body": "gringo tem medo dos nossos chuveiros kk", "created_utc": "1635773145.0", "edited": "False", "id": "hivqirm", "is_submitter": "False", "link_id": "t3_qkco0q", "parent_id": "t1_hivjs4z", "score": "27", "subreddit": "conversas", "subreddit_id": "t5_hwfuo"}, {"author": "ArkhanLahyet", "body": "ih olha lá um bot quebrado", "created_utc": "1635773037.0", "edited": "False", "id": "hivqbau", "is_submitter": "False", "link_id": "t3_qkcxux", "parent_id": "t1_hivl8vb", "score": "2", "subreddit": "conversas", "subreddit_id": "t5_hwfuo"}, {"author": "ArkhanLahyet", "body": "True, I certainly hope for more competitively priced options from Gan in the future. I just think it's likely that they'll keep doing what they're doing and slowly decrease in relevance.", "created_utc": "1635770967.0", "edited": "False", "id": "hivmklr", "is_submitter": "True", "link_id": "t3_qkbn16", "parent_id": "t1_hivivol", "score": "3", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "ArkhanLahyet", "body": "And most importantly, her boobs jiggle during her skill.", "created_utc": "1635768901.0", "edited": "False", "id": "hivj6c9", "is_submitter": "False", "link_id": "t3_qjlol4", "parent_id": "t1_hivirgw", "score": "-3", "subreddit": "Genshin_Impact", "subreddit_id": "t5_12p4l2"}, {"author": "ArkhanLahyet", "body": "Honestly, I won't be surprised if they never stop raising the prices and instead rely on other products like the monster go cubes to profit off of the main brand's \"fame\". At a certain point a product is there more to attract attention and give an image of luxury/quality rather than to actually sell, like Apple's $700 set of wheels for their mac pro that no sane person would buy but made the news. Gan is perfectly capable of pricing their cubes more competitively, but that's just not part of their strategy.", "created_utc": "1635767667.0", "edited": "False", "id": "hivhbzq", "is_submitter": "True", "link_id": "t3_qkbn16", "parent_id": "t1_hivfgg5", "score": "32", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "ArkhanLahyet", "body": "Jb and T, they just flow so well.  \nWe should make a community PLL tier list someday.", "created_utc": "1635766433.0", "edited": "False", "id": "hivfjuj", "is_submitter": "False", "link_id": "t3_qk6uoq", "parent_id": "t1_hivegae", "score": "2", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "ArkhanLahyet", "body": "It's so frustrating, I'm sure they could've used a shade closer to gold, but no, it had to be this monstruosity", "created_utc": "1635766194.0", "edited": "False", "id": "hivf7yo", "is_submitter": "False", "link_id": "t3_qjiwe7", "parent_id": "t1_hiqi9w5", "score": "2", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "ArkhanLahyet", "body": "Sorry for reposting, my previous post got removed last Friday because I didn't see the rule about Meme Mondays.\n\nAnyway, this was inspired by some charts by xkcd. Here are some real xkcd comics with the same format:\n\n* [\\#1242 Scary Names](https://xkcd.com/1242)\n* [\\#1468 Worrying](https://xkcd.com/1468)\n* [\\#1501 Mysteries](https://xkcd.com/1501)\n* [\\#1904 Research Risks](https://xkcd.com/1904)\n* [\\#1991 Research Areas by Size and Countedness](https://xkcd.com/1991)\n\n\"Retractable corner magnets\" sounds like something that should be on the chart, but the current flagships already have that.\n\nEdit: typo", "created_utc": "1635765390.0", "edited": "1635775164.0", "id": "hive4gu", "is_submitter": "True", "link_id": "t3_qkbn16", "parent_id": "t3_qkbn16", "score": "21", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "ArkhanLahyet", "body": "\"Retractable corner magnets\" sounds like something that should be on the chart, but the current Gan flagships already have that.\n\nAlso, here are some real xkcd comics with the same format:\n\n* [\\#1242 Scary Names](https://xkcd.com/1242/)\n* [\\#1468 Worrying](https://xkcd.com/1468/)\n* [\\#1501 Mysteries](https://xkcd.com/1501/)\n* [\\#1904 Research Risks](https://xkcd.com/1904/)\n* [\\#1991 Research Areas by Size and Countedness](https://xkcd.com/1991/)", "created_utc": "1635508543.0", "edited": "False", "id": "hii2j7g", "is_submitter": "True", "link_id": "t3_qib2gv", "parent_id": "t3_qib2gv", "score": "2", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "ArkhanLahyet", "body": "Cubos mágicos são um hobby relativamente barato, passa lá no /r/Cubers qualquer hora.", "created_utc": "1635160206.0", "edited": "False", "id": "hhz0m5j", "is_submitter": "False", "link_id": "t3_qf6q53", "parent_id": "t3_qf6q53", "score": "3", "subreddit": "conversas", "subreddit_id": "t5_hwfuo"}, {"author": "ArkhanLahyet", "body": "This may sound silly, but I polished mine with paper, like Michał Halczuk shows [in this video](https://youtu.be/N8A_WZMMEMk). I used much less force but many more sheets of paper (I happened to have plenty of paper with a blank reverse side, so might as well use it).\n\nThe surface still retains some scratches and isn't super shiny, but it became much grippier. You should alternate between solving and rubbing the cube on paper, because I'm pretty sure the paper leaves some material on the cube.\n\nIf you have something for polishing plastic you should probably use that instead, like aluminum polish. And the surface of matte cubes becomes glossy over time anyway through solving normally.", "created_utc": "1635085283.0", "edited": "False", "id": "hhv45ox", "is_submitter": "False", "link_id": "t3_qelch1", "parent_id": "t1_hhue3kr", "score": "3", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "ArkhanLahyet", "body": "A Nazi wrote it. Seriously, it's from The Concept of the Political by Carl Schmitt. Seriously terrifying stuff.\n\nIf you have an hour or two here's [his entry on the Stanford Encyclopedia of Philosophy](https://plato.stanford.edu/entries/schmitt). It gives you context and some counterarguments to keep your sanity in check.", "created_utc": "1635084362.0", "edited": "False", "id": "hhv29qy", "is_submitter": "False", "link_id": "t3_qelch1", "parent_id": "t1_hhukonv", "score": "5", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "ArkhanLahyet", "body": "It means that everything political ultimately comes from conflicts between groups. This conflict is inevitable: so long as it's possible for humans to group together against one another, they will, and it doesn't even matter who's right: The distinction isn't one between good and bad, the distiction that really matters is that you fight for who you identify with. Thus, conflict itself between friend enemy is the foundation of politics.\n\nPlease note that this argument was produced as a justification of another argument, that it's possible for a legitimate constitutional order to come into existence while representing the will of the people. You see, if a constitutional order falls, and another one takes its place, how can the new order claim to represent the will of the people if there is no way for the people to make any decisions during this void?\n\nThe answer is that a political community fundamentally arises from a group in conflict with another, and there is no need of any existing political framework to establish a new constitutional order, you only need a people who strongly identifies as a group. Since conflict is the ultimate source of the political, it is legitimate for a political group to identify itself in opposition to an enemy. In a way, this is a collective form of self-defense; a third party can't judge if you feel that your identity is threatened by someone, only you know that because it's your identity. Similarly, a political group is justified in taking action aganst another, because only they know what constitutes a threat, what makes the \"other\" an enemy. The argument is that this enmity is the core of the political, and that's why it is sufficient for forming the basis of a new government.\n\n&#x200B;\n\nThat said, this argument is ultimately used to define the state in opposition to the \"enemy\". Read it, study it, but don't believe any of it.", "created_utc": "1635084019.0", "edited": "False", "id": "hhv1keg", "is_submitter": "False", "link_id": "t3_qelch1", "parent_id": "t1_hhuj3pd", "score": "2", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "ArkhanLahyet", "body": "That's interesting, I've heard some people had that issue; are you able to tell why the cube is slow? Like, if it's friction because of the material, or the center pieces sticking to the screws, etc?", "created_utc": "1634927079.0", "edited": "False", "id": "hhng6s9", "is_submitter": "False", "link_id": "t3_qd9pnz", "parent_id": "t1_hhn8cce", "score": "2", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "ArkhanLahyet", "body": "The Weilong wr m 2021 is very fast, and everyone says its maglev version, the one that's purple inside, is even faster (I don't have one). Apparently maglev cubes are slow on tigher tensions, but if you want a fast cube you can just leave it on looser tensions.", "created_utc": "1634912356.0", "edited": "False", "id": "hhmfsm1", "is_submitter": "False", "link_id": "t3_qd9pnz", "parent_id": "t1_hhlym61", "score": "2", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "ArkhanLahyet", "body": "You see, if you get into mechanical keyboards, fountain pens, photography, vinyl, collecting old coins and all that stuff, there won't be any money left for cubes. Now, if you want to stop spending money, I'm afraid that's a whole another story...", "created_utc": "1634751526.0", "edited": "False", "id": "hhdxyhx", "is_submitter": "False", "link_id": "t3_qbtchg", "parent_id": "t1_hhdtu2b", "score": "4", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "ArkhanLahyet", "body": "Find a more expensive hobby. There are plenty.", "created_utc": "1634744646.0", "edited": "False", "id": "hhdgjkn", "is_submitter": "False", "link_id": "t3_qbtchg", "parent_id": "t1_hhdayfn", "score": "6", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "ArkhanLahyet", "body": "You can often use wide F moves when you need to insert into the back. Jperm has a guide on this technique: [https://youtu.be/qr7g4i4PgqQ](https://youtu.be/qr7g4i4PgqQ)", "created_utc": "1634732564.0", "edited": "False", "id": "hhcq2ch", "is_submitter": "False", "link_id": "t3_qbtchg", "parent_id": "t1_hhcj7ey", "score": "3", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "ArkhanLahyet", "body": "If you mean like the F' at the end of Y perm, I do that with my left pinky finger under the bottom center piece.", "created_utc": "1634731931.0", "edited": "False", "id": "hhcozqp", "is_submitter": "False", "link_id": "t3_qbtchg", "parent_id": "t1_hhclakz", "score": "1", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "ArkhanLahyet", "body": "Jean is great! her boobs jiggle during her skill", "created_utc": "1634401776.0", "edited": "False", "id": "hgvj5ta", "is_submitter": "False", "link_id": "t3_q54gde", "parent_id": "t1_hgvb7yq", "score": "2", "subreddit": "Genshin_Impact", "subreddit_id": "t5_12p4l2"}, {"author": "ArkhanLahyet", "body": "You made a good choice, people praise the rs3m for good reason", "created_utc": "1634392680.0", "edited": "False", "id": "hguzua8", "is_submitter": "False", "link_id": "t3_q93qdz", "parent_id": "t1_hgtouvc", "score": "2", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "ArkhanLahyet", "body": ">Equipped with many black technologies, Tornado V2 is one of the most successful new products of 2021, and it is popular with many Cubers.\n\n\"many black technologies\" lol wut?\n\n>In order to give back to everyone, we decided to make a limited edition of Tornado V2: Infinity Stones Series.\n\nHonestly doesn't sound that crazy coming from a company that decided to call their cube the *X-Man Tornado*\n\n> The cube will be sold in a blind box, so that every unboxing will be full of expectations and surprises.\n\nOne expectation and one surprise, to be exact.\nI already imagine people buying lots of them to resell.", "created_utc": "1634312922.0", "edited": "False", "id": "hgr20lm", "is_submitter": "False", "link_id": "t3_q8jk27", "parent_id": "t1_hgqu827", "score": "2", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "ArkhanLahyet", "body": "I'm probably in the minority, but the rs3m continues to be my main after getting a wr m 2021. But I like both, and I agree that the wr m is worth getting, it's just that I like the rs3m's crunchy texture.", "created_utc": "1634312084.0", "edited": "False", "id": "hgqzxrp", "is_submitter": "False", "link_id": "t3_q8h5hb", "parent_id": "t1_hgpta83", "score": "1", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "ArkhanLahyet", "body": "[https://i.imgur.com/tN3JuBH.png](https://i.imgur.com/tN3JuBH.png) I was pulling for Yanfei and got her twice in 20 rolls, and got to save pity for a future banner (Chide would be nice to get, but you know, he's not Yanfei). I'm afraid my luck will never be the same again.\n\nI had some materials saved up for her and Aloy, but I awakened my inner Zhongli and completely forgot about the mora, now it'll be a while before I can raise them 🥲\n\nI also pulled a Jean from the standard banner the same day (hurray!), but due to the mora problem she's level 20 lol", "created_utc": "1634214247.0", "edited": "False", "id": "hglpw7f", "is_submitter": "False", "link_id": "t3_q54gde", "parent_id": "t3_q54gde", "score": "3", "subreddit": "Genshin_Impact", "subreddit_id": "t5_12p4l2"}, {"author": "ArkhanLahyet", "body": "Yeah, the only difference in those cubes is the maglev (and the purple internals in the case of the weilong).\n\nBut I think the maglev system still has potential for improvement. The biggest difference is that the attraction/repulsion force of magnets increases much faster as they get closer, like in this [chart](https://www.kjmagnetics.com/largergraph.asp?CI=4&D=0.272809366407938&T=0.118110236220472&L=&W=&OD=0.315&ID=0.15748031496063&PF=0.27&PFMAX=2.6771615397496&C=8.5287&XSCALE=0.15748031496063&YSCALE=3&X=0.15748031496063&calcType=ring&GRADE=50). I ballparked the measurements but the important thing is that the curve get steeper as the magnets get closer, while springs are generally linear. You can play around with a magnet calculator like [the K&J Magnetics one](https://www.kjmagnetics.com/calculator.asp) that I used to make that chart.\n\nI don't have a maglev cube myself, so I can't say for sure how it affects feel, but some reviewers commented on maglev cubes having worse corner cutting and being bad on tigher settings. That would make sense, because they're using the same tensioniong mechanism as springs, but the repulsion force of magnets doesn't scale with distance the same way that springs do. What's curious to me is that if you look at the Gan 12 maglev's page, they show a chart that demonstrates this, but they call it \"exponential decompression\" and present it like it's a good thing.\n\nI expect maglev to improve a bit, but I don't know if it's even possible to get around the corner cutting problem. Either that or it disappears, but personally I'll wait to get maglev stuff.", "created_utc": "1633534681.0", "edited": "False", "id": "hfm5kep", "is_submitter": "False", "link_id": "t3_q2di7o", "parent_id": "t1_hflvv22", "score": "6", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "ArkhanLahyet", "body": "I looked at their website and it doesn't seem like they have international shipping, unfortunately; while signing up you're required to inform a CEP number (a brazilian postal code). You could ask their support just to be sure.", "created_utc": "1633532819.0", "edited": "False", "id": "hfm164i", "is_submitter": "False", "link_id": "t3_q2lmry", "parent_id": "t3_q2lmry", "score": "2", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "ArkhanLahyet", "body": "I think improving your non-dominant hand is something that requires a lot of active practice over time and won't come to you automatically, as muscle memory takes time.\n\nFor example, my left-handed U2 got better after I started using it in the 4x4 parity alg, and I don't think it would've improved as fast otherwise. Recently I've been switching to left-handed PLLs too (Ra as left-handed Rb and Ja as left-handed Jb), and I think it just takes practice, just like you were learning fingertricks for the first time.\n\nAs for tips for improving that, I'd say the first step is making sure you can use your dominant hand as the *gripping hand* as well. It's kinda hard to break the habit of which hand does the gripping and which hand flutters around doing the turns, but being able to freely switch your gripping hand is essential not only for algs but mostly so that you can solve f2l cases and the cross from either side.", "created_utc": "1633531361.0", "edited": "False", "id": "hflxpax", "is_submitter": "False", "link_id": "t3_q2di7o", "parent_id": "t1_hflocc4", "score": "2", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "ArkhanLahyet", "body": "Personally I'd go with factory MGC 6. I've never felt a difference in performance due to lubed springs, beyond reducing spring noise which isn't a big problem in the mgc. And the PVC coating won't do much since mgc cubes use shiny plastic already.\n\nBesides, tensioning is as simple as turning a screw if you think you need to.\n\nFrom what I've heard their premium service is good, but if you aren't super serious about cubing, it's not going to change your life.", "created_utc": "1632358966.0", "edited": "False", "id": "hdwqtua", "is_submitter": "False", "link_id": "t3_ptcozi", "parent_id": "t3_ptcozi", "score": "1", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "ArkhanLahyet", "body": "Update: Many thanks, it worked :D  \nI used a thin blade to gently push open the green slot, and after a while it widened enough to insert the red flap into it. After that the red piece easily bent back into shape.  \n\n\n(I would've written this earlier but Reddit was down)", "created_utc": "1632356378.0", "edited": "False", "id": "hdwle4j", "is_submitter": "True", "link_id": "t3_ptbnzg", "parent_id": "t1_hdvehft", "score": "2", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "ArkhanLahyet", "body": "The other commenter said it as well, but I think a hairdryer is likely to cause the whole piece to deform; but thanks for your suggestion. I might try it if I have a way of heating up just the part I want to move, but I'll try other things first.", "created_utc": "1632336857.0", "edited": "False", "id": "hdvmer0", "is_submitter": "True", "link_id": "t3_ptbnzg", "parent_id": "t1_hdv9sir", "score": "1", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "ArkhanLahyet", "body": "Thank you, I'll try your suggestion. I think in the worst case I could just remove the red flap altogether and it would likely stay in place.  \nI bought it from Picube shop on Aliexpress; I might try asking for a replacement but since that would take weeks to arrive anyway I wanted to see what I could do to repair the piece first.", "created_utc": "1632336557.0", "edited": "False", "id": "hdvlntt", "is_submitter": "True", "link_id": "t3_ptbnzg", "parent_id": "t1_hdvehft", "score": "3", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "ArkhanLahyet", "body": "I like that one equally as much. I might practice both to use depending on orientation.", "created_utc": "1627583606.0", "edited": "False", "id": "h6zjggu", "is_submitter": "True", "link_id": "t3_osqdry", "parent_id": "t1_h6yw26l", "score": "1", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "ArkhanLahyet", "body": "It's because the F versions begin and end closer to home grip if you do the Fs with your thumb; I personally still use the wide f version for those cases depending on which orientation I get, but generally it's better to avoid regrips.", "created_utc": "1627567218.0", "edited": "1627568428.0", "id": "h6ygfez", "is_submitter": "True", "link_id": "t3_osqdry", "parent_id": "t1_h6ya7ah", "score": "1", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "ArkhanLahyet", "body": "I think it's definitely a good idea to try out a variety of different algs to see which is best for you, but also it's super helpful to look at people executing the algs, because plenty depend on specific fingertricks in order to be good. Like that Ga that goes R2 u R' U R' U' R u' R2 F' U F, which is what I use and can be very fast, but uses some quite unconventional movement. J Perm shows [his execution here](https://youtu.be/kSYP033e12Q?t=429), but I do the start as R2' like I learned from [Feliks' tutorial](https://youtu.be/kossdjLYqsc?t=220) a literal decade ago, and it goes to show how you could miss good algs by not quite getting how to fingertrick it.", "created_utc": "1627432878.0", "edited": "1627433174.0", "id": "h6rv9dk", "is_submitter": "True", "link_id": "t3_osqdry", "parent_id": "t1_h6q70dz", "score": "2", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "ArkhanLahyet", "body": "You know what, I totally forgot to look at what the site looks like without an adblocker, thanks for reminding me. I'll put it on google drive instead and update the link.", "created_utc": "1627420100.0", "edited": "False", "id": "h6r3xj5", "is_submitter": "True", "link_id": "t3_osqdry", "parent_id": "t1_h6r10kq", "score": "5", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "ArkhanLahyet", "body": "Here's the link to the pdf:\n\n[https://drive.google.com/drive/folders/1geM8TMhXMgnjesu\\_uUy5zb0Q0T9f3Qs6?usp=sharing](https://drive.google.com/drive/folders/1geM8TMhXMgnjesu_uUy5zb0Q0T9f3Qs6?usp=sharing)\n\nEach file has both OLL and PLL in it. There are two versions, one ordered by categories and another by numerical and alphabetical order. I've also included the Word documents if you want to make changes, but please keep the source attribution.\n\nThe PLL sheet has J Perm's main algs bolded, but that doesn't mean it's the best one for you. Also check the videos themselves for the fingertricks.\n\nPage size for the documents is Letter (8.5 by 11 inches), configure paper size accordingly when printing.\n\n&#x200B;\n\nSome thoughts:\n\n* I think the L version of A perm and E perm definitely have the potential to be faster, since you regrip with your right hand which is less likely to be your gripping hand at that point (if most of your OLLs are right handed, that is), but my L moves aren't fast enough to benefit from that.\n* That Na perm is *long*. It's also the one I use.\n* You gotta be so fast to get actual benefit from those alternate H and F perms with AUF. I feel like I'd lose time to extra recognition.\n* It frustrates me how the a/b nomenclature for PLL is inconsistent. Aa and Ab are clockwise and counterclockwise, but then Ua and Ub go the other way around. Doing a J perm twice gives an N perm, but it's reversed in that Ja U2 Ja gives Nb and Jb U2 Jb gives Na.\n* OLL 55 is my least favorite right now. It's rarer than the others and I've recently switched to a new alg so I'm slow every time.\n* I usually prefer to mirror OLL algs front to back, like with 36. Maybe the L versions would be faster if my left fingers were faster. Similarly, Ja can be so fast but I'm bad at the good algs so I do a janky Jb mirrored front to back. Don't judge me.\n* I can't believe those U and H perms with S slices are actually fast. Not that *I* can do them fast, of course.\n\n(EDIT: New link using Google Drive)", "created_utc": "1627404111.0", "edited": "1627420651.0", "id": "h6q3cpl", "is_submitter": "True", "link_id": "t3_osqdry", "parent_id": "t3_osqdry", "score": "10", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "ArkhanLahyet", "body": "In modern databases, sequential ids aren't necessarily bad, but they come with the disadvantage that the database needs to be centralized to a certain extent, otherwise you could have two cubes on opposite sides of the galaxy discover different species and assign the same number to them.\n\n(There are other problems as well, like third parties being able to guess information because of the sequential nature of the ids like we do all the time here, but I wouldn't think the Borg are worried about that.)\n\nAn alternative (that we use here on 21st century Earth) is a universally unique identifier (uuid). It's a 128-bit string that's large enough that randomly generating two uuids has a negligible chance of collision (where you generate an id that already existed). Now you can write different records in different places and merge databases without worrying about collisions.\n\nIf Borg keep their records anything like in our modern decentralized databases, I'd expect their ids to be more like \"Species 848b9fdd-3a57-4c10-bd64-b1dc5b04837d\". In fact, what if they are? The borg could very well use these decentralized ids in borg language, and then \"translate\" to numbers based on encounter date when talking to non-Borg.", "created_utc": "1621776015.0", "edited": "False", "id": "gz5phac", "is_submitter": "False", "link_id": "t3_nj0xup", "parent_id": "t1_gz562xs", "score": "104", "subreddit": "DaystromInstitute", "subreddit_id": "t5_2whek"}, {"author": "ArkhanLahyet", "body": "Fullmetal alchemist brotherhood é excelente, mas recomendo assistir pelo menos o começo do Fullmetal alchemist (a primeira adaptação) pq ele introduz melhor os personagens.", "created_utc": "1619557934.0", "edited": "False", "id": "gw3jbc4", "is_submitter": "False", "link_id": "t3_mz9pzj", "parent_id": "t1_gw07h37", "score": "2", "subreddit": "gamesEcultura", "subreddit_id": "t5_3l4jr"}, {"author": "ArkhanLahyet", "body": "É o que dizem, mas na verdade ele voltou pra casa com 2 caixas de leite e o número 6.", "created_utc": "1616851034.0", "edited": "False", "id": "gsfzm8h", "is_submitter": "False", "link_id": "t3_mdwfei", "parent_id": "t1_gsbsuha", "score": "1", "subreddit": "brasil", "subreddit_id": "t5_2qh9i"}, {"author": "ArkhanLahyet", "body": "I'm reminded of Sisko's \"it's easy to be a saint in paradise\" speech.", "created_utc": "1609535004.0", "edited": "False", "id": "ghrcxff", "is_submitter": "False", "link_id": "t3_kodq7r", "parent_id": "t1_ghr38a9", "score": "4", "subreddit": "startrek", "subreddit_id": "t5_2qixm"}, {"author": "ArkhanLahyet", "body": "If I'm not mistaken he comments once that he wouldn't be able to fool another bird, which is a half joke perhaps but it's good enough for me.", "created_utc": "1609534764.0", "edited": "False", "id": "ghrchdy", "is_submitter": "False", "link_id": "t3_kob9xv", "parent_id": "t1_ghr4eo5", "score": "11", "subreddit": "startrek", "subreddit_id": "t5_2qixm"}, {"author": "ArkhanLahyet", "body": "The episode kind of makes the point that power corrupts, that there's *something* fundamentally wrong about having things one didn't earn. And besides, we know the Q have their own internal wars, so they may be extremely powerful compared to the federation but they're far from enlightened beings. It's unlikely that Riker could use Q's powers to become a being wiser than Q.", "created_utc": "1608865999.0", "edited": "False", "id": "ggyho32", "is_submitter": "False", "link_id": "t3_kjr37e", "parent_id": "t3_kjr37e", "score": "17", "subreddit": "DaystromInstitute", "subreddit_id": "t5_2whek"}, {"author": "ArkhanLahyet", "body": "Considering that such a thing as a universal translator exists in Trek, I wonder if some variation of this tech exists at the computer level. That is, some kind of universal translator for machines that's able to figure out how to integrate between completely different communication protocols and convert on the spot, much like a universal translator quickly learns to translate spoken words, removing the necessity for universally adopted standards.", "created_utc": "1608864474.0", "edited": "False", "id": "ggyfj0h", "is_submitter": "False", "link_id": "t3_kjq3he", "parent_id": "t3_kjq3he", "score": "18", "subreddit": "DaystromInstitute", "subreddit_id": "t5_2whek"}, {"author": "ArkhanLahyet", "body": "It's just numbers; they're [hanzi used to write number in legal documents](https://en.wikipedia.org/wiki/Chinese_numerals#Characters_used%20to_represent_numbers), and they're stylized as [seal script](https://en.wikipedia.org/wiki/Seal_script).\n\nIn order:\n\n 壹 (1), 貳 (2), 叁 (3), 肆 (4), 伍 (5), 陸 (6), 柒 (7), 捌 (8), 玖 (9), 拾 (10), 拾壹 (11), 拾貳 (12).", "created_utc": "1607908964.0", "edited": "False", "id": "gfrka6l", "is_submitter": "False", "link_id": "t3_kcn0ve", "parent_id": "t3_kcn0ve", "score": "5", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "ArkhanLahyet", "body": "I think you haven't fully placed it yet.", "created_utc": "1607568508.0", "edited": "False", "id": "gf8lo2c", "is_submitter": "False", "link_id": "t3_ka0e35", "parent_id": "t3_ka0e35", "score": "6", "subreddit": "mildlyinteresting", "subreddit_id": "t5_2ti4h"}, {"author": "ArkhanLahyet", "body": "So odd; the portuguese name translates to \"careless automaton\", no?", "created_utc": "1603731322.0", "edited": "False", "id": "ga6l87d", "is_submitter": "False", "link_id": "t3_jigvwr", "parent_id": "t3_jigvwr", "score": "3", "subreddit": "magicTCG", "subreddit_id": "t5_2qn5f"}, {"author": "ArkhanLahyet", "body": "opa, disponha", "created_utc": "1601768499.0", "edited": "False", "id": "g7ktc5y", "is_submitter": "False", "link_id": "t3_j4kam3", "parent_id": "t1_g7kspxa", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "ArkhanLahyet", "body": "It's a user flair, and you can edit yours under \"community options\" in the subreddit's sidebar. [https://imgur.com/a/ObOCU2l](https://imgur.com/a/ObOCU2l)\n\nIf you're in an app, you can probably find the option to edit flair inside a drawer in the subreddit's page. Then you can insert emoji in there.", "created_utc": "1601767904.0", "edited": "False", "id": "g7krrwe", "is_submitter": "False", "link_id": "t3_j4kam3", "parent_id": "t1_g7knaz8", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "ArkhanLahyet", "body": "I guess it depends on where you are, but on the website, for example, you go to the sidebar under \"community options\".\n\n[https://imgur.com/a/ObOCU2l](https://imgur.com/a/ObOCU2l)\n\nIf you're on an app you can probably open a drawer in the subreddit's page.", "created_utc": "1601767695.0", "edited": "False", "id": "g7kr6g8", "is_submitter": "False", "link_id": "t3_j4kam3", "parent_id": "t1_g7kf1i8", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "ArkhanLahyet", "body": "Glad to help :)", "created_utc": "1596457808.0", "edited": "False", "id": "g078veh", "is_submitter": "False", "link_id": "t3_i2cqqz", "parent_id": "t1_g06kd2t", "score": "1", "subreddit": "LearnJapanese", "subreddit_id": "t5_2qyls"}, {"author": "ArkhanLahyet", "body": "The booklet is indeed the last portion of the book (別冊), containing answers and explanations. I think you can detach it, but I kept mine where it is.", "created_utc": "1596381019.0", "edited": "False", "id": "g03v3xw", "is_submitter": "False", "link_id": "t3_i2cqqz", "parent_id": "t3_i2cqqz", "score": "2", "subreddit": "LearnJapanese", "subreddit_id": "t5_2qyls"}, {"author": "ArkhanLahyet", "body": "Well, the infographic does cite Google Translate as one of its sources 🤷‍♂️", "created_utc": "1595858922.0", "edited": "False", "id": "fzelbty", "is_submitter": "False", "link_id": "t3_hyshz9", "parent_id": "t1_fzejslo", "score": "81", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "ArkhanLahyet", "body": "There is something really, really odd about something called \"implied consent\". Can you elaborate?", "created_utc": "1585244574.0", "edited": "False", "id": "flko74d", "is_submitter": "False", "link_id": "t3_fp9pgr", "parent_id": "t1_flkehxl", "score": "1", "subreddit": "funny", "subreddit_id": "t5_2qh33"}, {"author": "ArkhanLahyet", "body": "Glad to help :D", "created_utc": "1577326384.0", "edited": "False", "id": "fc1qcyr", "is_submitter": "False", "link_id": "t3_eem17u", "parent_id": "t1_fc1op15", "score": "1", "subreddit": "cemu", "subreddit_id": "t5_3abej"}, {"author": "ArkhanLahyet", "body": "Hi, updating graphics drivers solved the problem for me. I'm running a 2400G + RX580.  \nJust to confirm, does your Radeon settings window look like this?  \n[https://imgur.com/a/BjaqMj3](https://imgur.com/a/BjaqMj3)  \nIf not, you should grab the \"Adrenalin 2020 Edition\" software from AMD's website (which is what solved it for me).", "created_utc": "1577312830.0", "edited": "False", "id": "fc1acgm", "is_submitter": "False", "link_id": "t3_eem17u", "parent_id": "t3_eem17u", "score": "1", "subreddit": "cemu", "subreddit_id": "t5_3abej"}, {"author": "ArkhanLahyet", "body": "To me it's weird because food spoils, which is not something I imagine artifacts should do.", "created_utc": "1567631841.0", "edited": "False", "id": "ez06hma", "is_submitter": "False", "link_id": "t3_cznva3", "parent_id": "t1_eyzk47e", "score": "4", "subreddit": "magicTCG", "subreddit_id": "t5_2qn5f"}, {"author": "ArkhanLahyet", "body": "It's terrifying to think that SQL is still around in the 23rd century.", "created_utc": "1552090308.0", "edited": "False", "id": "ei3vzz9", "is_submitter": "False", "link_id": "t3_ayx44m", "parent_id": "t3_ayx44m", "score": "117", "subreddit": "itsaunixsystem", "subreddit_id": "t5_2xxaq"}, {"author": "ArkhanLahyet", "body": "É, mas o norte está embaixo e Brasil continua no lado direito. O mapa não funciona.", "created_utc": "1514227867.0", "edited": "False", "id": "drqwxje", "is_submitter": "False", "link_id": "t3_7m26kl", "parent_id": "t1_drqwc1m", "score": "5", "subreddit": "brasil", "subreddit_id": "t5_2qh9i"}, {"author": "ArkhanLahyet", "body": "checkerboard pattern please?", "created_utc": "1501850869.0", "edited": "False", "id": "dl5lgb1", "is_submitter": "False", "link_id": "t3_6rjrh6", "parent_id": "t3_6rjrh6", "score": "10", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "ArkhanLahyet", "body": "don't sweat it, that was a lot of help. Cheers!", "created_utc": "1480330203.0", "edited": "False", "id": "daiuorz", "is_submitter": "True", "link_id": "t3_5ch6jh", "parent_id": "t1_daiiec9", "score": "2", "subreddit": "transcribe", "subreddit_id": "t5_2ti61"}, {"author": "ArkhanLahyet", "body": "Awesome, thanks!  \nBased on that, is [this](http://imgur.com/a/N30Rq) more or less what the melody should look like? That sixth note sounds more like an A to me.  \nAgain thanks for your help.", "created_utc": "1480302416.0", "edited": "False", "id": "daihfqv", "is_submitter": "True", "link_id": "t3_5ch6jh", "parent_id": "t1_daibara", "score": "2", "subreddit": "transcribe", "subreddit_id": "t5_2ti61"}, {"author": "ArkhanLahyet", "body": "Well, it's not urgent, but there's notes that I can't quite make out, like the left hand notes at 0:57.", "created_utc": "1480244494.0", "edited": "False", "id": "dahgrxn", "is_submitter": "True", "link_id": "t3_5ch6jh", "parent_id": "t1_dagvoso", "score": "1", "subreddit": "transcribe", "subreddit_id": "t5_2ti61"}, {"author": "ArkhanLahyet", "body": "I appreciate it. Thanks.", "created_utc": "1479229101.0", "edited": "False", "id": "da1g8iz", "is_submitter": "True", "link_id": "t3_5ch6jh", "parent_id": "t1_da1do62", "score": "2", "subreddit": "transcribe", "subreddit_id": "t5_2ti61"}, {"author": "ArkhanLahyet", "body": "I'm pretty sure it begins with Dm, Em, F, G.  \nThe notes specifically:  \nD - A - F / E - B - G / (F, A) - G - F / (G, E) - D - E  \nD - A - F / (E, E) - F - G / (F, A) - B - C / G - D - B  \nI'm not sure how to write notes in plain text, I hope this is fine.", "created_utc": "1479214570.0", "edited": "False", "id": "da16jnq", "is_submitter": "True", "link_id": "t3_5ch6jh", "parent_id": "t1_da0fd3w", "score": "2", "subreddit": "transcribe", "subreddit_id": "t5_2ti61"}, {"author": "ArkhanLahyet", "body": "There are plenty of exceptions; planeta, dia, curinga and prisma are all masculine words that end in -a. Additionally, words ending in -ma are often masculine, like fantasma, sistema, problema and emblema.", "created_utc": "1466823511.0", "edited": "False", "id": "d4n43sp", "is_submitter": "False", "link_id": "t3_4popt1", "parent_id": "t3_4popt1", "score": "5", "subreddit": "Portuguese", "subreddit_id": "t5_2sqn7"}, {"author": "ArkhanLahyet", "body": "That's nice, I didn't even notice the fourth hand.  \nIsn't it a bit confusing having noon be down?", "created_utc": "1466389150.0", "edited": "False", "id": "d4g3v6e", "is_submitter": "False", "link_id": "t3_4ovcp8", "parent_id": "t1_d4g3n19", "score": "1", "subreddit": "MechanicalKeyboards", "subreddit_id": "t5_2ugo7"}, {"author": "ArkhanLahyet", "body": "Wait a moment, is it one of those watches that spin once a day?", "created_utc": "1466388573.0", "edited": "False", "id": "d4g3ep5", "is_submitter": "False", "link_id": "t3_4ovcp8", "parent_id": "t3_4ovcp8", "score": "1", "subreddit": "MechanicalKeyboards", "subreddit_id": "t5_2ugo7"}, {"author": "ArkhanLahyet", "body": "He has an [uncomfortable glass](http://66.media.tumblr.com/f6396c21b6b9d25435404c85c6862847/tumblr_mwfdzzJR6V1qad4foo1_1280.jpg), by the way.", "created_utc": "1465184681.0", "edited": "False", "id": "d3xnp6y", "is_submitter": "False", "link_id": "t3_4mr0ks", "parent_id": "t3_4mr0ks", "score": "1", "subreddit": "funny", "subreddit_id": "t5_2qh33"}, {"author": "ArkhanLahyet", "body": "My guess is that when it happens to be a round number, they unround it so it doesn't look like they're estimating.", "created_utc": "1456274901.0", "edited": "False", "id": "d0bbx93", "is_submitter": "False", "link_id": "t3_478874", "parent_id": "t3_478874", "score": "2", "subreddit": "Showerthoughts", "subreddit_id": "t5_2szyo"}, {"author": "ArkhanLahyet", "body": "But that would be 11/16, no?", "created_utc": "1455196106.0", "edited": "False", "id": "czvy7d7", "is_submitter": "False", "link_id": "t3_458j0z", "parent_id": "t1_czvxnqb", "score": "30", "subreddit": "piano", "subreddit_id": "t5_2qnw8"}, {"author": "ArkhanLahyet", "body": "Não me parece muito seguro, mas eu não entendo tanto de botijões para reclamar.", "created_utc": "1454883109.0", "edited": "False", "id": "czrh71d", "is_submitter": "False", "link_id": "t3_44nnr1", "parent_id": "t3_44nnr1", "score": "30", "subreddit": "brasil", "subreddit_id": "t5_2qh9i"}, {"author": "ArkhanLahyet", "body": "Here's a resource for you. Sometimes it's tricky because of the context, but it really helps, and the site has other resources as well.  \nhttp://www.scales-chords.com/chord-namer/", "created_utc": "1454619370.0", "edited": "False", "id": "cznzvwj", "is_submitter": "False", "link_id": "t3_4479ft", "parent_id": "t3_4479ft", "score": "4", "subreddit": "piano", "subreddit_id": "t5_2qnw8"}, {"author": "ArkhanLahyet", "body": "Man, they look awesome.", "created_utc": "1454435745.0", "edited": "False", "id": "czl7jad", "is_submitter": "False", "link_id": "t3_43sj0d", "parent_id": "t3_43sj0d", "score": "3", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "ArkhanLahyet", "body": "Man, you're good.", "created_utc": "1454379400.0", "edited": "False", "id": "czkhnbl", "is_submitter": "False", "link_id": "t3_43rys9", "parent_id": "t1_czkgr3q", "score": "2", "subreddit": "Rainmeter", "subreddit_id": "t5_2s0bb"}, {"author": "ArkhanLahyet", "body": "Wow, it looks seamless.", "created_utc": "1454376974.0", "edited": "False", "id": "czkg0jw", "is_submitter": "True", "link_id": "t3_43mh05", "parent_id": "t1_czke6bn", "score": "2", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "ArkhanLahyet", "body": "Here's the picture in 4K. I put the letters because there's a tear on the paper there, and it's just blank anyway.  \nhttp://i.imgur.com/NcjSPVa.jpg  \nI saturated the other image slightly, so you might have to change the hue if you don't linke the pinkish red.  \n(The font is RedRocket3D, btw)", "created_utc": "1454370696.0", "edited": "False", "id": "czkc2mx", "is_submitter": "True", "link_id": "t3_43mh05", "parent_id": "t1_czk704i", "score": "2", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "ArkhanLahyet", "body": "I drew, in order, the circle -> hexagon (hint: in a hexagon the sides have the same length as the radius) -> \"cut\" the hexagon into a 3x3x3 cube (with corners larger than edges and centers) to get a sort of grid to work with. You draw the actual mirror blocks inside each part of the grid (which is the hardest part, because you have to visualize a 3D cube). Also, because it's a superflip the corners and centers all line up. Hope it helps!", "created_utc": "1454363752.0", "edited": "False", "id": "czk7hsy", "is_submitter": "True", "link_id": "t3_43mh05", "parent_id": "t1_czk2uzp", "score": "1", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "ArkhanLahyet", "body": "Hey, thanks a bunch. Not engineer, though.", "created_utc": "1454327221.0", "edited": "False", "id": "czjlnah", "is_submitter": "True", "link_id": "t3_43mh05", "parent_id": "t1_czjg61j", "score": "3", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "ArkhanLahyet", "body": "Thanks!", "created_utc": "1454298300.0", "edited": "False", "id": "czjc0hd", "is_submitter": "True", "link_id": "t3_43mh05", "parent_id": "t1_czjbv5j", "score": "1", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "ArkhanLahyet", "body": "Thank you!", "created_utc": "1454298280.0", "edited": "False", "id": "czjc047", "is_submitter": "True", "link_id": "t3_43miop", "parent_id": "t1_czjbauj", "score": "2", "subreddit": "drawing", "subreddit_id": "t5_2qvp9"}, {"author": "ArkhanLahyet", "body": "It's interesting that a mouse is optional.", "created_utc": "1454104761.0", "edited": "False", "id": "czgwrda", "is_submitter": "False", "link_id": "t3_4392qi", "parent_id": "t3_4392qi", "score": "1", "subreddit": "MechanicalKeyboards", "subreddit_id": "t5_2ugo7"}, {"author": "ArkhanLahyet", "body": "The FFX Scenario Ultimania states (FF Wiki link [here](http://finalfantasy.wikia.com/wiki/Blitzball)) that blitzers can stay underwater because of the pyreflies in it.  \nWhile not really canon, I think it makes sense, seeing that the entire body of water is a sphere.", "created_utc": "1454021518.0", "edited": "False", "id": "czfper2", "is_submitter": "False", "link_id": "t3_434a06", "parent_id": "t1_czffbpy", "score": "3", "subreddit": "FinalFantasy", "subreddit_id": "t5_2qhdi"}, {"author": "ArkhanLahyet", "body": "I have the trackball and the moving on its own thing doesn't happen to me. Maybe there's dust inside? Curiously, I have no trouble switching between the \"normal\" mouse and the trackball (which I use on my desktop). Small thing, though, the button 1 is by far the most clicked and now it shines more than the others. Well.", "created_utc": "1453934036.0", "edited": "False", "id": "czef1iz", "is_submitter": "False", "link_id": "t3_42xbmt", "parent_id": "t1_cze4f08", "score": "2", "subreddit": "MechanicalKeyboards", "subreddit_id": "t5_2ugo7"}, {"author": "ArkhanLahyet", "body": "Processed 259MB of a 256MB file to compress into 260MB with 100% compress ratio.  \nNo wonder you got 1 error.", "created_utc": "1452901481.0", "edited": "False", "id": "cyztxuj", "is_submitter": "False", "link_id": "t3_4139uh", "parent_id": "t3_4139uh", "score": "2", "subreddit": "softwaregore", "subreddit_id": "t5_2w2ea"}, {"author": "ArkhanLahyet", "body": "It's [Magic Actions](http://www.chromeactions.com/), for things like previewing likes/dislikes and stopping autoplay.", "created_utc": "1452550502.0", "edited": "False", "id": "cyuk25t", "is_submitter": "True", "link_id": "t3_40er23", "parent_id": "t1_cyuj9ia", "score": "1", "subreddit": "softwaregore", "subreddit_id": "t5_2w2ea"}, {"author": "ArkhanLahyet", "body": ">Sian Blake, 43, and her two young sons, aged four and eight, have not been seen since 13 December.  \n>The Met Police said the bodies were found in the garden and a murder investigation was under way.  \n>Ms Blake’s partner Arthur Simpson-Kent, 48, had alerted police but went missing himself three days later.  \n\n\nThat quickly became a lot worse than I expected.", "created_utc": "1452049869.0", "edited": "False", "id": "cynm7kx", "is_submitter": "False", "link_id": "t3_3zns25", "parent_id": "t3_3zns25", "score": "33", "subreddit": "FinalFantasy", "subreddit_id": "t5_2qhdi"}, {"author": "ArkhanLahyet", "body": "Try not to time yourself yet. Well, that's what worked for me; you really need to get used to the color patterns before you can get decent times, eh?  \nAlso, starting with yellow might be easier. Overall, I'd say go for it unless it frustrates you too much. You'll find that choosing the color based on the scramble will make difficult crosses rarer.", "created_utc": "1451597597.0", "edited": "False", "id": "cyhoyih", "is_submitter": "False", "link_id": "t3_3yy3uh", "parent_id": "t1_cyhnxqp", "score": "1", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "ArkhanLahyet", "body": "This is glorious.", "created_utc": "1451595984.0", "edited": "False", "id": "cyho231", "is_submitter": "False", "link_id": "t3_3yy414", "parent_id": "t3_3yy414", "score": "2", "subreddit": "FinalFantasy", "subreddit_id": "t5_2qhdi"}, {"author": "ArkhanLahyet", "body": "I mostly like how everything fits neatly so that it's the same size as a full keyboard with every key still in it; Plus, I've never liked much the big + sign. As far as I know, the brazilian ABNT-2 is the only layout that includes a small +.", "created_utc": "1451510529.0", "edited": "False", "id": "cygkfgl", "is_submitter": "False", "link_id": "t3_3ytqzg", "parent_id": "t1_cygjzmy", "score": "1", "subreddit": "MechanicalKeyboards", "subreddit_id": "t5_2ugo7"}, {"author": "ArkhanLahyet", "body": "That's a beautiful layout.", "created_utc": "1451509657.0", "edited": "False", "id": "cygjv4u", "is_submitter": "False", "link_id": "t3_3ytqzg", "parent_id": "t3_3ytqzg", "score": "1", "subreddit": "MechanicalKeyboards", "subreddit_id": "t5_2ugo7"}, {"author": "ArkhanLahyet", "body": "Well, Yosenju have the excuse that they wouldn't work as spirits.\nSpirits can't be special summoned, that is.", "created_utc": "1449585459.0", "edited": "False", "id": "cxrj1z5", "is_submitter": "False", "link_id": "t3_3vw82v", "parent_id": "t1_cxriipe", "score": "5", "subreddit": "yugioh", "subreddit_id": "t5_2rpe6"}, {"author": "ArkhanLahyet", "body": "Maybe try checking your antivirus' exclusions?", "created_utc": "1449580695.0", "edited": "False", "id": "cxrgwu6", "is_submitter": "False", "link_id": "t3_3t5tbo", "parent_id": "t3_3t5tbo", "score": "1", "subreddit": "VisualStudio2015", "subreddit_id": "t5_38wae"}, {"author": "ArkhanLahyet", "body": "You can Rank-up a Revolution Falcon with Doom Double Force, which is at least easier. Goes well with the \"special summon hate\" theme for the raidraptors, I suppose.\nThe wikia also suggests DNA transplant in trains. Don't know how useful that would be.\nAdditionally, you can use cards that manipulate levels. BIG Win!? gives you a 1/4 chance of turning everything into L12 (also 1/4 chance of taking 6k damage).\n", "created_utc": "1448834989.0", "edited": "False", "id": "cxh6s32", "is_submitter": "False", "link_id": "t3_3uqu8o", "parent_id": "t1_cxh5qci", "score": "3", "subreddit": "yugioh", "subreddit_id": "t5_2rpe6"}, {"author": "ArkhanLahyet", "body": "Related to \"Cayenne\", the japanese version of FFVI spells Kefka's name as [Cefca](http://finalfantasy.wikia.com/wiki/Kefka_Palazzo) but the phonetic is still \"Kefuka\". Maybe it's an instance of the celtic C?", "created_utc": "1444396743.0", "edited": "1444397403.0", "id": "cvtn8fu", "is_submitter": "False", "link_id": "t3_3o2ehd", "parent_id": "t3_3o2ehd", "score": "1", "subreddit": "FinalFantasy", "subreddit_id": "t5_2qhdi"}, {"author": "ArkhanLahyet", "body": "Are you sure you can't play it on a PSP? Or a gameboy? The Android version doesn't include the bonus dungeons (although I think the ios does), so you may miss out on quite a lot of the fun.", "created_utc": "1440640127.0", "edited": "False", "id": "cugzu8c", "is_submitter": "False", "link_id": "t3_3ihkry", "parent_id": "t3_3ihkry", "score": "1", "subreddit": "FinalFantasy", "subreddit_id": "t5_2qhdi"}, {"author": "ArkhanLahyet", "body": "The dub did a lot of those nonsense card replacements.  \nIn fact, there's a list of them [here](http://yugioh.wikia.com/wiki/Card_replacements_in_the_dub).", "created_utc": "1438347675.0", "edited": "False", "id": "ctmq00c", "is_submitter": "False", "link_id": "t3_3f8wro", "parent_id": "t1_ctmeq1w", "score": "3", "subreddit": "yugioh", "subreddit_id": "t5_2rpe6"}, {"author": "ArkhanLahyet", "body": "I've cut pieces of (transparent) tape to put over them. It doesn't look as good anymore, but it's not permanent so that I can replace them later.", "created_utc": "1438090096.0", "edited": "False", "id": "ctixtp4", "is_submitter": "False", "link_id": "t3_3ev1fs", "parent_id": "t3_3ev1fs", "score": "1", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "ArkhanLahyet", "body": "I'm glad for the Infernoids name update, especially because they still have their OCG names in the card art. I kinda wish this was a thing.", "created_utc": "1437858168.0", "edited": "False", "id": "ctg0ucq", "is_submitter": "False", "link_id": "t3_3ejnzz", "parent_id": "t3_3ejnzz", "score": "1", "subreddit": "yugioh", "subreddit_id": "t5_2rpe6"}, {"author": "ArkhanLahyet", "body": "I've never seen one of these. I'm curious.", "created_utc": "1437447100.0", "edited": "False", "id": "ctah344", "is_submitter": "False", "link_id": "t3_3e06fp", "parent_id": "t3_3e06fp", "score": "1", "subreddit": "mildlyinteresting", "subreddit_id": "t5_2ti4h"}, {"author": "ArkhanLahyet", "body": "All of this looks like more staples and less actual deck. I'd rather not.", "created_utc": "1437445001.0", "edited": "False", "id": "ctafx46", "is_submitter": "False", "link_id": "t3_3e03bm", "parent_id": "t3_3e03bm", "score": "0", "subreddit": "yugioh", "subreddit_id": "t5_2rpe6"}, {"author": "ArkhanLahyet", "body": "People are attracted by things that are normally unpleasant. Sometimes we respond to those situations more or less the same way as we would respond to actual treats. Well, movies and other types of entertainment are supposed to stimulate emotions.  \nImmersive movies are so good because it makes you feel like you're in that situation.  \nThis doesn't mean that people actively seek out negative emotions for the sake of feeling bad; rather, some people like the feeling of anxiety and expectation. It does make sense that it's natural to strive for survival, after all.  \nNot exactly related, but Vsauce talks about [Morbid Curiosity](https://youtu.be/ZbdMMI6ty0o) and it's worth checking out.", "created_utc": "1437188050.0", "edited": "False", "id": "ct7blqp", "is_submitter": "False", "link_id": "t3_3dp2hi", "parent_id": "t3_3dp2hi", "score": "2", "subreddit": "explainlikeimfive", "subreddit_id": "t5_2sokd"}, {"author": "ArkhanLahyet", "body": "Interestingly, many conlangs such as Klingon use a base-10 system, and they're supposed to be alien. Meanwhile, some actual languages on Earth use base-6, base-15 and others.\n[There's a neat video about linguistics and numbers if you haven't seen it.](https://youtu.be/l4bmZ1gRqCc)", "created_utc": "1436928017.0", "edited": "False", "id": "ct3q59h", "is_submitter": "False", "link_id": "t3_3d9idq", "parent_id": "t1_ct3az3x", "score": "6", "subreddit": "worldbuilding", "subreddit_id": "t5_2rd6n"}, {"author": "ArkhanLahyet", "body": "Also, Ge'ez and Sinhala are syllabic alphabets.  \nI think the article misses the point that characters tend to be as simple as possible. You better have a good reason to make a character that takes 6 strokes to write and represents /ɛ/.", "created_utc": "1436927303.0", "edited": "False", "id": "ct3pqoc", "is_submitter": "False", "link_id": "t3_3d9idq", "parent_id": "t1_ct3imm5", "score": "3", "subreddit": "worldbuilding", "subreddit_id": "t5_2rd6n"}, {"author": "ArkhanLahyet", "body": "{{Moisture Creature}}. There are three things in the artwork, none of which are normal.  \nAlso, {{Servant of Catabolism}}.", "created_utc": "1436447894.0", "edited": "False", "id": "csxcwoh", "is_submitter": "False", "link_id": "t3_3cn20a", "parent_id": "t3_3cn20a", "score": "6", "subreddit": "yugioh", "subreddit_id": "t5_2rpe6"}, {"author": "ArkhanLahyet", "body": "I hope you won't miss your ªs and ºs.", "created_utc": "1435367644.0", "edited": "False", "id": "csk2kwj", "is_submitter": "False", "link_id": "t3_3b8jfw", "parent_id": "t1_csjwjw9", "score": "1", "subreddit": "MechanicalKeyboards", "subreddit_id": "t5_2ugo7"}, {"author": "ArkhanLahyet", "body": "The backslash being bigger in the ANSI layout doesn't bother me as much as it being the only alphanumerical key that gets a different color in a plurality of keysets.  \nAs much as I like the ANSI layout, I think the backslash key is more special than it should be.", "created_utc": "1435367466.0", "edited": "False", "id": "csk2hqf", "is_submitter": "False", "link_id": "t3_3b8jfw", "parent_id": "t1_csjvsyj", "score": "1", "subreddit": "MechanicalKeyboards", "subreddit_id": "t5_2ugo7"}, {"author": "ArkhanLahyet", "body": "It would be interesting how the game would have developed if such a thing existed from the very beginning. I'm guessing we'd have cards with effects like \"can only be activated during the 6th turn of later\" so that the players can't just do everything in the first turn.\nBut then it wouldn't be Yu-Gi-Oh as we know it, right?", "created_utc": "1435078052.0", "edited": "False", "id": "csg1xg7", "is_submitter": "False", "link_id": "t3_3at8hi", "parent_id": "t3_3at8hi", "score": "1", "subreddit": "yugioh", "subreddit_id": "t5_2rpe6"}, {"author": "ArkhanLahyet", "body": "Yes, there's a loop. If you equip it to Gearfried the Iron Knight, Elma will be destroyed and ready to be equipped again, which means you can activate it infinitely many times. You can combine it with Royal Magical Library to get instant Exodia.", "created_utc": "1434851146.0", "edited": "False", "id": "csdf768", "is_submitter": "False", "link_id": "t3_3ake8a", "parent_id": "t3_3ake8a", "score": "15", "subreddit": "yugioh", "subreddit_id": "t5_2rpe6"}, {"author": "ArkhanLahyet", "body": "Just a heads-up, the tilde represents a nasal vowel (yohn-gurt), which threw me off for a moment. You might want to use breve (ŏ) for short and macron (ō) for long instead.", "created_utc": "1434156656.0", "edited": "False", "id": "cs4u4al", "is_submitter": "False", "link_id": "t3_39naxm", "parent_id": "t3_39naxm", "score": "1", "subreddit": "SampleSize", "subreddit_id": "t5_2tlqg"}, {"author": "ArkhanLahyet", "body": "[Whistled languages](http://en.wikipedia.org/wiki/Whistled_language) may interest you, as they don't use sounds from the vocal chord. I'll mention in particular the whistled language of [Silbo Gomero](http://en.wikipedia.org/wiki/Silbo_Gomero), which is a 'dialect' of Spanish. [Here's a little about it.](https://www.youtube.com/watch?v=PgEmSb0cKBg)", "created_utc": "1431898605.0", "edited": "False", "id": "crcas67", "is_submitter": "False", "link_id": "t3_36aoqv", "parent_id": "t3_36aoqv", "score": "4", "subreddit": "conlangs", "subreddit_id": "t5_2red7"}, {"author": "ArkhanLahyet", "body": "I think I'm missing something. Isn't the condition \"when a monster you control is targeted for an attack, or an opponent's card effect\"? How can you chain it to itself?\n\nEdit: I get it. Thanks guys.", "created_utc": "1431524375.0", "edited": "1431525264.0", "id": "cr7pnan", "is_submitter": "False", "link_id": "t3_35tqrx", "parent_id": "t3_35tqrx", "score": "8", "subreddit": "yugioh", "subreddit_id": "t5_2rpe6"}, {"author": "ArkhanLahyet", "body": "[They do it again backwards](https://youtu.be/t0sMDyoYCn4?t=28s)  \nThat has to be some of the most impressive shit I've seen people do.", "created_utc": "1430012140.0", "edited": "False", "id": "cqorziv", "is_submitter": "False", "link_id": "t3_33umjp", "parent_id": "t3_33umjp", "score": "72", "subreddit": "oddlysatisfying", "subreddit_id": "t5_2x93b"}, {"author": "ArkhanLahyet", "body": "How do you symmetry like that? o.O", "created_utc": "1426643579.0", "edited": "False", "id": "cpicmyn", "is_submitter": "False", "link_id": "t3_2zdcd4", "parent_id": "t3_2zdcd4", "score": "1", "subreddit": "drawing", "subreddit_id": "t5_2qvp9"}, {"author": "ArkhanLahyet", "body": "One other reason might be that Dark Tuners and Dark Synchos were only used by Dark Signers and their servants, and the summoning itself was supposed to look all evil and stuff. I'm guessing it wouldn't be that easy to implement a \"villain-exclusive\" mechanic in the game.", "created_utc": "1426340860.0", "edited": "False", "id": "cpemvz9", "is_submitter": "False", "link_id": "t3_2yzv5k", "parent_id": "t3_2yzv5k", "score": "5", "subreddit": "yugioh", "subreddit_id": "t5_2rpe6"}, {"author": "ArkhanLahyet", "body": "it's kinda hard, I can't just scratch it off, but I think I could sand it.  \nI just don't know if it's gonna scratch the other pieces if I leave it.", "created_utc": "1425600485.0", "edited": "False", "id": "cp5qb47", "is_submitter": "True", "link_id": "t3_2y2uq4", "parent_id": "t1_cp5pjq1", "score": "1", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "ArkhanLahyet", "body": "You can nuke the field more than once per turn, too. Very easily gets over the 'detach instead of destroying' Xyzs out there, as long as you can pay LP for it.", "created_utc": "1425430528.0", "edited": "False", "id": "cp3jtyg", "is_submitter": "False", "link_id": "t3_2xuoe6", "parent_id": "t1_cp3jm0t", "score": "8", "subreddit": "yugioh", "subreddit_id": "t5_2rpe6"}, {"author": "ArkhanLahyet", "body": "Yes. [You can see on the wikia site on card backings ](http://yugioh.wikia.com/wiki/Card_backing)that Obelisk, Ra and Slifer got special tinted backings without the logo(I guess it makes the card even more illegal?).", "created_utc": "1424996482.0", "edited": "False", "id": "coyeonr", "is_submitter": "False", "link_id": "t3_2x9885", "parent_id": "t1_coya59x", "score": "2", "subreddit": "yugioh", "subreddit_id": "t5_2rpe6"}, {"author": "ArkhanLahyet", "body": "**erad** [æ.'ɹad]  \n*interrogative pronoun*: what; where.  \n  \n**imistance** [ɪ.mɪs.'tɑns]  \n*verb*, indicative, present continuous, abstract person, with 1st person direct object pronoun of *imistari* [ɪ.mɪs.'tæɹɪ]: to appeal.  \n  \n**stae** [stɑɪ]  \nadverb: greatly, especially, particularly.  \n  \n**torad** [tə.'ɹɑð]  \n*noun*, default case, singular: animal.  \n  \n**toce** ['tou.se]  \n*verb*, optative, present continuous, 1st person singular of *geriri* [dʒə.'ɹɪ.ɹɪ]: to think, to consider, to extress an opinion.  \n  \n**toranice** [tɔ.'ɹɑ.nɪ.se]  \n*verb*, indicative, present continuous, 1st person singular of *toranari* [tɔ.ɹɑ.'nɑ.ɹɪ]: to like, to enjoy, to derive pleasure from.  \n  \n**imital** [ɪ.mɪ.'tɑl]  \n*noun*, accusative generic of *imites* [ɪ.'mɪ.tɪs]: a small herbivorous quadrupedal animal native to the mid-west of Otorenas.  \n  \n**toccata** [tɔ.'kɑ.rə]  \n*adj*, generic form of *toccava* [tɔ.kɑ.və]: southern.  \n  \n**loritata** [lɔ.ɹɪ.'tɑ.rə]  \n*adj*, generic form of *loritava* [lɔ.ɹɪ.'tɑ.və]: pink.  \n  \nLiterally: What appeals me especially animal? I think I like imites southern pink!  \nTranslation: What is my favourite animal? I think it's the southern pink *imites*!  \n  \nThe phrase is in Andonean, a language previously spoken in what is nowadays part of Patado and Marelo. Today, Andonean is a mostly dead language used only in Dalusiana, capital of Marelo and former capital of the Andonis Empire. Most of the young in Dalusiana still learn Andonean as a secondary language, mostly because of historical reasons, but also because many words in modern languages are derived from Andonean. Many historical buildings in Dalusiana and in the rest of Marelo have inscriptions in Andonean.  \nThe language makes extensive use of inflections, particularly of verbs (they even include an abstract person, like the gender-neutral 3rd person \"one\"). Notably, nouns can be singular, plural or generic (for which no number is assigned).  \nAn interesting thing to note in the phrase is that *toce* is in the optative instead of indicative. This kind of irregularity is still present in a few verbs that indicate opinion.  \nAlso, *imistance*, meaning \"to appeal\" contains a direct object pronoun; in that sense, it works in a very similar manner to the spanish verb \"gustar\"; the idea of \"favourite\" is formed by this verb + *stae* (especially or greatly).  \nA note on the *imites*: They are a small furry animal resembling hares; a southern imites is a different species from the eastern imites, and therefore they're distinguished. A popular domestic breed of southern imites is the southern pink imites (yeah, not \"pink southern imites\"), so called for no reason that I know of (their fur is either brown, white or grey).  \n  \n(And an out of character note: The phonology was mostly based on the English pronounciation of Latin and its love for schwas (ə). I thought it went well with the story)", "created_utc": "1424739573.0", "edited": "False", "id": "cov1ypl", "is_submitter": "False", "link_id": "t3_2wvhvr", "parent_id": "t3_2wvhvr", "score": "3", "subreddit": "conlangs", "subreddit_id": "t5_2red7"}, {"author": "ArkhanLahyet", "body": "omg I had no idea it existed :o", "created_utc": "1424651147.0", "edited": "False", "id": "cotx8c4", "is_submitter": "True", "link_id": "t3_2wt0il", "parent_id": "t1_cotvakr", "score": "3", "subreddit": "yugioh", "subreddit_id": "t5_2rpe6"}, {"author": "ArkhanLahyet", "body": "thanks :)", "created_utc": "1424643151.0", "edited": "False", "id": "cotsw9a", "is_submitter": "False", "link_id": "t3_2ws06q", "parent_id": "t1_cots8h8", "score": "2", "subreddit": "conlangs", "subreddit_id": "t5_2red7"}, {"author": "ArkhanLahyet", "body": "**ege ug** ['ɛ.ge uk]  \n*pronoun*: our (always inclusive).  \n  \n**tept** ['tɛ.pət]  \n*noun*, definite form of **tep** [tɛp]: the people (used predominantly as a politic term).  \n  \n**dai sceba** [daɪ sə.'kɛ.ba]  \n*verb*, affirmative emphatic of **sceber** [sə.'kɛ.be.rə]: to deserve, to be entitled to, to earn, to win.  \n  \n**tellenegetru** [tɛ.lɛ.nɛ.'gɛ.tə.ru]  \n*noun*: democracy; from **telleno** [tɛ.'lɛ.no]: \"equality, uniformity\" + **egetru** [ɛ.'gɛ.tə.ru]: \"choice, decision\".  \n  \n**dais** [daɪs]  \n*noun*: election.  \n  \n**ekipog** [ɛ.'ki.pok]  \n*adj.*: straight, smooth, without obstacles; direct, immediate, straightforward.  \n  \n**piotept** [pi.o.'tɛpət]  \n*noun* definite form, from **pio-** ['pi.o]: \"to, towards, for\" + **tep** ['tɛp]: \"people\".  \n  \n**kau** [kau]  \n*verb*, infinitive: expresses wish or order.  \n  \nLiterally: Our the people do deserve democracy. Election direct to people [order].  \nTranslation: Our people deserve democracy. May the people vote by direct elections!  \n  \nThe phrase is in Duradouan, spoken in the small nation of Duradoua. It's part of a famous speech by politician Koronis (full name Koronis Neketrig Katba, 3110-3172) during the Smarot uprising, which happened in 3141 as a rebellion against the Duradouan government.  \nThe government at the time was effectively a non-hereditary monarchy that promoted itself as a democracy, despite having indirect elections in which only the richest could vote.  \nKoronis Neketrig became the first president of Duradoua in 3142, and his speech is well-known in the modern world.", "created_utc": "1424641681.0", "edited": "False", "id": "cots35b", "is_submitter": "False", "link_id": "t3_2ws06q", "parent_id": "t3_2ws06q", "score": "2", "subreddit": "conlangs", "subreddit_id": "t5_2red7"}, {"author": "ArkhanLahyet", "body": "**çaux** [sɔ]  \nplural form of **çau** [sɔ]:  \n*particle*: not; negates the meaning of the verb in the phrase.\n  \n**sùnau** ['sy.no]  \n*verb*, infinitive: to accomplish, to finish successfully, to gain/obtain.  \n  \n**le** [le]  \n*particle*: indicates past tense.  \n  \n**perrien** [pɚ.'χjɑ̃]  \n*noun*, from **perriau** [pɚ.'χjo]:  \n*verb*: to escape, to free oneself, to avoid [capture], to elude.  \n  \n**pra** [pɚ]  \n*adverb*: in time, sufficiently early.  \n  \n**la** [la]  \n*preposition*: to, in order to, towards.  \n  \n**rousaux** [χu.'so]  \nplural form of **rousau** [χu.'so]:  \n*noun*: freedom, openness, liberty.  \n  \n**tau** [to]  \n*particle*: Modifies the verb to the subjunctive mode (both singular and plural).  \n  \n**paúren** ['po˞.en]  \n*noun*, from **paúriau** ['po˞.jo]:  \n*verb*: to succeed, to obtain, to prosper.  \n  \n**a** [a]  \n*particle*: subjunctive of **le**; indicates past tense.  \n  \n**ìlleni** ['eɪ.le.ni]  \n*noun* from **ìllon** ['eɪ.lõ]:  \n*verb*: to hold on to, to not lose.  \n  \n**le** [le]  \n*particle*: indicates past tense.  \n  \n**perde** [pɚ.de]  \n*adverb*: maybe, perhaps, possibly.  \n  \nLiterally: [negative, plural] accomplished escaping in time to freedom. [subjunctive] succeded not having lost maybe.  \nTranslation: [They] didn't manage to escape in time to be free. If they had managed not to lose, then maybe.  \n  \nThis phrase was taken a little out of context; it refers to a fragment of someone explaining the plot of a movie. \"Not having lost\" refers to a previous fight. The language is notable for the use of particles in the beginning of sentences that 'set' the grammatical mood. It relies on particles to inflect verbs.  \nNow a litte backstory; The Garronian people live in an underground nation at an unknown location under Europe; almost nothing is known about them in the overworld, as people rarely find entrances to the land of Garron, and even more rarely they decide to come back (it's not like anyone's going to believe in the stories they tell). Also, the entrances hidden across the countries seem to change over time. The people exist since ancient times, and they are far from technologically advanced; they don't seem to offer more than cultural explanations for their origins, which remains a big mystery until this day.  \nTheir language existed much before a script was assigned to it. As a result, different regions have adoped different scripts from different people who have entered Garron; the phrase presented is in the french variant of Garronian, which adopted the french way of writing sounds (for example, writing /o/ commonly as \"au\" and marking plurals, even when they're homophones with their singulars). An interesting feature is that verb infections are written as separated words. here is the same phrase rendered in another 'writing style' from a spanish traveller:  \n**So sínole parjián par la rusó. To pórena élenile perde**  \nTo this day, their existence is an enigma. They've been amazingly successful at eluding the searches of archaeologists looking for this underground marvel, but many believe it's merely a legend.\n\n", "created_utc": "1424559766.0", "edited": "1424560115.0", "id": "cosw236", "is_submitter": "False", "link_id": "t3_2wo2ly", "parent_id": "t3_2wo2ly", "score": "3", "subreddit": "conlangs", "subreddit_id": "t5_2red7"}, {"author": "ArkhanLahyet", "body": "You could try derivating the words for hour and minute (possibly seconds?) from other unrelated concepts. Our word for minute ultimately comes from the Latin minutus (diminished); there were minuta prima (our minutes) and minuta secunda, which is where the word for second comes from.  \nI think this kind of thing makes your language more varied and less logical (and more \"human\" as well), and it also gives some backstory to your words.", "created_utc": "1424533235.0", "edited": "False", "id": "cosiqeq", "is_submitter": "False", "link_id": "t3_2wmc19", "parent_id": "t3_2wmc19", "score": "1", "subreddit": "conlangs", "subreddit_id": "t5_2red7"}, {"author": "ArkhanLahyet", "body": "oh, thanks", "created_utc": "1424309222.0", "edited": "False", "id": "copvfo4", "is_submitter": "False", "link_id": "t3_2w6oes", "parent_id": "t1_copt4in", "score": "1", "subreddit": "yugioh", "subreddit_id": "t5_2rpe6"}, {"author": "ArkhanLahyet", "body": "Say my Artifact Aegis, Artifact Moralltach and Artifact Caduceus are simultaneously destroyed and sent to the graveyard. As far as I know, they activate in a chain, but the problem is, it's better for me if Artifact Caduceus activates last, so that it gets to the field first to be there when Aegis and Moralltach are Special Summoned. That way, I can use Caduceus' effect twice and draw two cards.  \nBut what determines the order in which the three Artifacts will activate in the chain if they were destroyed simultaneously?", "created_utc": "1424287747.0", "edited": "False", "id": "copic8k", "is_submitter": "False", "link_id": "t3_2w6oes", "parent_id": "t3_2w6oes", "score": "2", "subreddit": "yugioh", "subreddit_id": "t5_2rpe6"}, {"author": "ArkhanLahyet", "body": "Sometimes people do things so well you don't even bother to think why they did it.", "created_utc": "1424274796.0", "edited": "False", "id": "copa8cb", "is_submitter": "False", "link_id": "t3_2wb58t", "parent_id": "t3_2wb58t", "score": "75", "subreddit": "mildlyinteresting", "subreddit_id": "t5_2ti4h"}, {"author": "ArkhanLahyet", "body": "I've had a ridged megaminx for a while now, and I friend of mine got one without the ridges that I got to try out.  \nPersonally, I prefer the one with ridges,though I could be biased because I own it. I find it easier to turn, and also the stickers remain in good conditions easier, just because they don't touch the table or wherever you keep it.", "created_utc": "1424189871.0", "edited": "False", "id": "coo7h79", "is_submitter": "False", "link_id": "t3_2w74ij", "parent_id": "t3_2w74ij", "score": "1", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "ArkhanLahyet", "body": "I'm surprised that \"I do not masturbate\" is an option.", "created_utc": "1424021245.0", "edited": "False", "id": "com8du0", "is_submitter": "False", "link_id": "t3_2vxnw3", "parent_id": "t3_2vxnw3", "score": "1", "subreddit": "SampleSize", "subreddit_id": "t5_2tlqg"}, {"author": "ArkhanLahyet", "body": "thanks :D", "created_utc": "1424001070.0", "edited": "False", "id": "com21aa", "is_submitter": "False", "link_id": "t3_2vvvgs", "parent_id": "t1_colrrpy", "score": "3", "subreddit": "conlangs", "subreddit_id": "t5_2red7"}, {"author": "ArkhanLahyet", "body": "**augenstine** [u.gen.'sti.nə]  \nadj.: \"bad,unfavorable, especially pertaining to weather.\"; from the participle of *augensat* [u.gen.'saɪ]: \"to influence negatively.\", from *augena* and *esag*.  \n  \n**aren** [a.'ren]  \nadverb: \"today\".  \n  \n**dog** [dʌ]  \nverb; 2nd person present of *dot* [dɔi]: \"to agree, to comply.\"  \n  \n**Eiyn** [ʌn]  \nfemale given name.\n  \n**sceineg** [ʃa.'ne]  \nverb; 3nd person present of *sceinet* [ʃa.'neɪ]: \"to present, to look.\"  \n  \n**creagen** [kren]  \nadj.: \"unharmed.\"  \n  \n**et** [eɪ]  \nadverb: \"maybe, perhaps.\"  \n  \n**prymren** [primə.'ren]  \nnoun: \"a traditional day for celebrating love and romace, similar to Valentine's Day.\"  \n  \n**aren** [a.'ren]  \nadverb: \"today\".  \n  \n**ta** [ta]  \nadverb: \"likely, probably.\"  \n  \n**aerlentine** [ɛ.len.'ti.nə]  \nadj.: \"justified.\"; from *aerlenat* [ɛ.le.'naɪ].  \n  \nLiterally: Bad [day] today, you agree? Eiyn looks unharmed. Maybe prymren today likely justified.  \nTranslation: Bad day today, don't you think? Eiyn looks so good. Maybe it's because it's Prymren today.  \n  \nThis phrase is in Eastern Daharian, and illustrates a simple colloquial conversation, which can be deduced from the lack of elements in the phrase, such as pronouns. The language has a relatively confusing phonology, as long combinations of letters may turn out to correspond to a single sound (an extreme example would be *sceageiyel* [ʃeɪ], \"chimney\"). It personally reminds me of Irish.\nHere, someone called Eiyn is said to be \"unharmed\", a common slang for a very attractive person (male or female), and the Prymren is mentioned as a possible cause (the construction *ta aerlentine* is informally used as an equivalent to *eafad*, \"because\", which would require a different grammatical construction).  \nThe day of Prymren is widely celebrated in all Northern and Eastern Dahar, and in parts of Southern Dahar close to the winter solstice; it's a holiday that has existed for over half a millenium, and interestingly, the colour pink is associated with this day but red isn't.", "created_utc": "1423963541.0", "edited": "False", "id": "colq9jk", "is_submitter": "False", "link_id": "t3_2vvvgs", "parent_id": "t3_2vvvgs", "score": "6", "subreddit": "conlangs", "subreddit_id": "t5_2red7"}, {"author": "ArkhanLahyet", "body": "[The airplane guys](http://yugioh.wikia.com/wiki/Itsu). Never works, but it's fun to summon them.", "created_utc": "1423488563.0", "edited": "False", "id": "cofxoqu", "is_submitter": "False", "link_id": "t3_2v9w9g", "parent_id": "t3_2v9w9g", "score": "3", "subreddit": "yugioh", "subreddit_id": "t5_2rpe6"}, {"author": "ArkhanLahyet", "body": "**The Six Samurai - Irou**  \nClass: Six Samurai;  \nRace: Warrior;  \nActive Skill: Can redirect damage to another Six Samurai;  \nPassive Skill: Only when another Six Samurai is present: Sees hidden enemies.", "created_utc": "1423485986.0", "edited": "False", "id": "cofwyww", "is_submitter": "False", "link_id": "t3_2v9z6x", "parent_id": "t3_2v9z6x", "score": "1", "subreddit": "yugioh", "subreddit_id": "t5_2rpe6"}, {"author": "ArkhanLahyet", "body": "The card specifically states *\"you can Tribute 1 monster your opponent controls as if you controlled it\"*. I don't think there's any room for ambiguity.", "created_utc": "1423401347.0", "edited": "False", "id": "coextq1", "is_submitter": "False", "link_id": "t3_2v6rri", "parent_id": "t3_2v6rri", "score": "10", "subreddit": "yugioh", "subreddit_id": "t5_2rpe6"}, {"author": "ArkhanLahyet", "body": "**Superluminal Archer**  LIGHT  \nRank 6  \n[Warrior/Xyz/Effect]  \n2000 ATK/1000 DEF  \n  \n2 Level 6 monsters  \nIf your Life Points are higher than or equal to your opponent's Life Points, this card cannot attack. If this card's ATK is 2500 or more, destroy it. Once per turn: You can detach 2 Xyz Material from this card; This card can attack during the first turn of the Duel.", "created_utc": "1423335232.0", "edited": "False", "id": "coe9ir2", "is_submitter": "False", "link_id": "t3_2v3u3e", "parent_id": "t3_2v3u3e", "score": "2", "subreddit": "yugioh", "subreddit_id": "t5_2rpe6"}, {"author": "ArkhanLahyet", "body": "You can try, sure. However, once your compulse resolves, the monster is off the field, so solemn warning no longer applies. As a result, you opponent gets his LP back.", "created_utc": "1423096687.0", "edited": "False", "id": "cobi0wg", "is_submitter": "False", "link_id": "t3_2usg1e", "parent_id": "t1_cobefa1", "score": "1", "subreddit": "yugioh", "subreddit_id": "t5_2rpe6"}, {"author": "ArkhanLahyet", "body": "If you go back a turn, you're back at a point in the game when the coin wansn't tossed yet (and is therefore undetermined), so the effect can't be applied, negating the go-back-a-turn thing. All of this cause a paradox, which is why Time Wizard can only time travel forwards, explaining why the [altered version of Dark Magician](http://yugioh.wikia.com/wiki/Dark_Sage) is his older, not younger self.  \nEDIT: Formatting", "created_utc": "1423087198.0", "edited": "1423096339.0", "id": "cobcgan", "is_submitter": "False", "link_id": "t3_2usg1e", "parent_id": "t1_cobbaqt", "score": "6", "subreddit": "yugioh", "subreddit_id": "t5_2rpe6"}, {"author": "ArkhanLahyet", "body": "In order to fuse your monsters to your opponent's, you need [Super Polymerization](http://yugioh.wikia.com/wiki/Super_Polymerization), which is unfortunately forbidden as of now.  \nRegarding Ra, your opponent likely summoned the [legal version of the card](http://yugioh.wikia.com/wiki/The_Winged_Dragon_of_Ra), a weakened Ra which sadly does not require the scriptures, as Konami apparently assumed the average duelist can't speak fluent Egyptian. Go figure.", "created_utc": "1423085240.0", "edited": "False", "id": "cobb64r", "is_submitter": "False", "link_id": "t3_2usg1e", "parent_id": "t1_cobap9u", "score": "9", "subreddit": "yugioh", "subreddit_id": "t5_2rpe6"}, {"author": "ArkhanLahyet", "body": "I'm sorry, but there is a reason why Exodia is described as \"* beast of such incalculable and intimidating might*\". You can consider it a spell speed 4 effect, so it can only be countered by another Exodia.", "created_utc": "1423084609.0", "edited": "False", "id": "cobarbq", "is_submitter": "False", "link_id": "t3_2usg1e", "parent_id": "t1_coba7yt", "score": "5", "subreddit": "yugioh", "subreddit_id": "t5_2rpe6"}, {"author": "ArkhanLahyet", "body": "I want to know why I can't bounce back a Raigeki with my Mirror Force.", "created_utc": "1423082461.0", "edited": "False", "id": "cob9cpw", "is_submitter": "False", "link_id": "t3_2usg1e", "parent_id": "t3_2usg1e", "score": "20", "subreddit": "yugioh", "subreddit_id": "t5_2rpe6"}, {"author": "ArkhanLahyet", "body": "Look closer. Cards have a set number, which is used to tell which set it comes from. Technically, that makes every card a \"number\" card.  \nIn the other hand, cards in the anime don't have this set number, so only \"number\" Xyz monsters can destroy other \"number\" Xyz monsters.  \nEDIT: spelling.", "created_utc": "1423082185.0", "edited": "1423096239.0", "id": "cob967v", "is_submitter": "False", "link_id": "t3_2usg1e", "parent_id": "t1_cob8iq3", "score": "91", "subreddit": "yugioh", "subreddit_id": "t5_2rpe6"}, {"author": "ArkhanLahyet", "body": "[Look here.](http://www.twistypuzzles.com/cgi-bin/puzzle.cgi?pkey=71)  \nIt's a cube made by Matchbox. I believe it's supposed to be some sort of supercube.", "created_utc": "1422992685.0", "edited": "False", "id": "coa3ptc", "is_submitter": "False", "link_id": "t3_2unwgx", "parent_id": "t3_2unwgx", "score": "3", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "ArkhanLahyet", "body": "You're looking at Z- and H-perms.  \nLook for algs [here.](http://algdb.net/)", "created_utc": "1422988207.0", "edited": "False", "id": "coa0xtl", "is_submitter": "False", "link_id": "t3_2untot", "parent_id": "t3_2untot", "score": "6", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "ArkhanLahyet", "body": "Looks good. Now I'm intrigued by the mechanism.", "created_utc": "1422842054.0", "edited": "False", "id": "co8ac0p", "is_submitter": "False", "link_id": "t3_2ugrfz", "parent_id": "t3_2ugrfz", "score": "20", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "ArkhanLahyet", "body": "There's a little explanation right at the end of the guide you showed.  \nIt's useful for all the corner cases without algorithms.", "created_utc": "1422840184.0", "edited": "False", "id": "co89b24", "is_submitter": "False", "link_id": "t3_2ugmzf", "parent_id": "t1_co88qtv", "score": "1", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "ArkhanLahyet", "body": "Might be good to know what deck you're using. Many spells work better with particular decks (Dark Hole in Yang Zing, for example, doesn't disrupt your field and fills your grave for Yang Zing Path).", "created_utc": "1422839153.0", "edited": "False", "id": "co88r2t", "is_submitter": "False", "link_id": "t3_2ugl4b", "parent_id": "t3_2ugl4b", "score": "2", "subreddit": "yugioh", "subreddit_id": "t5_2rpe6"}, {"author": "ArkhanLahyet", "body": "I'd personally prefer using a commutator.  \nWouldn't that be faster than using multiple edge permutations?", "created_utc": "1422838860.0", "edited": "False", "id": "co88llo", "is_submitter": "False", "link_id": "t3_2ugmzf", "parent_id": "t1_co87x1h", "score": "1", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "ArkhanLahyet", "body": "Not everything wrong that happens has a culprit, but it usually does have someone responsible for it. Not rarely you will see people trying to blame each other for something as it there was a movie villain involved.  \nAnd I wish there was an easy way or place to learn it.", "created_utc": "1422668238.0", "edited": "False", "id": "co6cwo8", "is_submitter": "False", "link_id": "t3_2u9flx", "parent_id": "t3_2u9flx", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "ArkhanLahyet", "body": "\"Hello, how're you doing?\"", "created_utc": "1422667892.0", "edited": "False", "id": "co6cqkj", "is_submitter": "False", "link_id": "t3_2u9esd", "parent_id": "t3_2u9esd", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "ArkhanLahyet", "body": "O, that's no good. I can't have the peace I want if I suddenly have a million dollars.", "created_utc": "1422667632.0", "edited": "False", "id": "co6clz9", "is_submitter": "False", "link_id": "t3_2u9epl", "parent_id": "t3_2u9epl", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "ArkhanLahyet", "body": "\"On the way back they sang a number of tuneful and reflective songs on the subjects of peace, justice, morality, culture, sport, family life and the obliteration of all other life forms.\"  \nFrom Life, the Universe and Everything (Douglas Adams).", "created_utc": "1422667407.0", "edited": "False", "id": "co6ci1j", "is_submitter": "False", "link_id": "t3_2u9db6", "parent_id": "t3_2u9db6", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "ArkhanLahyet", "body": "Yes; That action alone is enough harming. Humans are social beings, and lack of interaction has more negative impact than it may seem.", "created_utc": "1422666927.0", "edited": "False", "id": "co6c9m6", "is_submitter": "False", "link_id": "t3_2u9dfd", "parent_id": "t3_2u9dfd", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "ArkhanLahyet", "body": "Only if the elevator starts going up while you're in mid-air.\nBasically, you're measuring things relative to the elevator. Given that the elevator is moving in a constant speed (i.e. not accelerating), jumping inside will have the same effect as if it was stopped. It would only affect the behaviour of your jumps if it was accelerating somehow. Likewise, a car doesn't push you backwards all the time, it only pushes you when you accelerate/break/curve.", "created_utc": "1422665342.0", "edited": "False", "id": "co6bhv6", "is_submitter": "False", "link_id": "t3_2u99zx", "parent_id": "t3_2u99zx", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "ArkhanLahyet", "body": "Very probably. I don't think reddit is as troll-friendly as other sites like YouTube.  \nBut who knows, the Internet is a mind-bogglingly huge. You just won't believe how vastly hugely mindbogglingly big it is", "created_utc": "1422664351.0", "edited": "False", "id": "co6b05r", "is_submitter": "False", "link_id": "t3_2u98aw", "parent_id": "t3_2u98aw", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "ArkhanLahyet", "body": "You can make [ternary computers](http://en.wikipedia.org/wiki/Ternary_computer) with that; you may use 0, 1 and 2; or -1, 0 and 1. They're not very present nowadays, though, and were only presented as a viable option many years ago.   \nA logic system in which there are three possible states (true, false and something else, usually undetermined) is called [ternary logic](http://en.wikipedia.org/wiki/Three-valued_logic); some people argue that having a third option is more elegant and better represents a world in which not everything is \"true\" or \"false\". Plenty of authors, especially in the early days of computers, made use of that concept in works of fiction.  \nYou can add more numbers and make logic with even more values (see the [IEEE 1164, a nine-valued logic standard](http://en.wikipedia.org/wiki/IEEE_1164). There's little to be known about it, though), but systems that use more than two-valued logic have limited applications.  \nNowadays, nobody really talks about ternary computers as a viable option. I'm not sure as to why, but they've been completely replaced with binary computers.", "created_utc": "1422663924.0", "edited": "False", "id": "co6asht", "is_submitter": "False", "link_id": "t3_2u96a7", "parent_id": "t3_2u96a7", "score": "3", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "ArkhanLahyet", "body": "I'd recommend a lot of stuff by Ludovico Einaudi; most of his songs are minimalist soundtrack-ish pieces (plenty are actually soundtracks). The ones I find the easiest to learn are Primavera, Nefeli, Monday, and Fly.", "created_utc": "1422577966.0", "edited": "False", "id": "co57c5j", "is_submitter": "False", "link_id": "t3_2u3xmm", "parent_id": "t3_2u3xmm", "score": "3", "subreddit": "piano", "subreddit_id": "t5_2qnw8"}, {"author": "ArkhanLahyet", "body": "It's kinda difficult to know exactly what it is, but I'd guess a [Casio Privia PX-130](http://www.amazon.com/Casio-Privia-PX-130-88-Key-Digital/dp/B002IVK0FE)", "created_utc": "1422480444.0", "edited": "False", "id": "co3xf8z", "is_submitter": "False", "link_id": "t3_2tzge8", "parent_id": "t3_2tzge8", "score": "1", "subreddit": "piano", "subreddit_id": "t5_2qnw8"}, {"author": "ArkhanLahyet", "body": "[There can only be one Number 16!](http://yugioh.wikia.com/wiki/Number_16)  \n^Anyone ^get ^it?  \n^^no?  \n^^^fine", "created_utc": "1422408876.0", "edited": "False", "id": "co311uy", "is_submitter": "False", "link_id": "t3_2tu409", "parent_id": "t3_2tu409", "score": "1", "subreddit": "todayilearned", "subreddit_id": "t5_2qqjc"}, {"author": "ArkhanLahyet", "body": "Another way of putting it is that quantum entanglement cannot be used to send any information from one particle ot the other.\n[Veritasium has a Youtube video on it.](https://www.youtube.com/watch?v=ZuvK-od647c), I really recommend it.", "created_utc": "1422392612.0", "edited": "False", "id": "co2r6kt", "is_submitter": "False", "link_id": "t3_2tubay", "parent_id": "t1_co2qy9u", "score": "21", "subreddit": "Futurology", "subreddit_id": "t5_2t7no"}, {"author": "ArkhanLahyet", "body": "It looks... worrying ._.", "created_utc": "1422225409.0", "edited": "False", "id": "co0mywh", "is_submitter": "False", "link_id": "t3_2tnhzw", "parent_id": "t3_2tnhzw", "score": "6", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "ArkhanLahyet", "body": "I really like the idea of playing against bosses.\nI especially want this because currently YGOPro doesnt do a good job as an AI.", "created_utc": "1422190203.0", "edited": "False", "id": "co075uv", "is_submitter": "False", "link_id": "t3_2tkbi0", "parent_id": "t1_cnzrx54", "score": "1", "subreddit": "yugioh", "subreddit_id": "t5_2rpe6"}, {"author": "ArkhanLahyet", "body": "That would be [Raidraptor - Blaze Falcon](http://yugioh.wikia.com/wiki/Raidraptor_-_Blaze_Falcon).", "created_utc": "1422189265.0", "edited": "False", "id": "co06z2h", "is_submitter": "False", "link_id": "t3_2tl33c", "parent_id": "t1_co041ab", "score": "1", "subreddit": "yugioh", "subreddit_id": "t5_2rpe6"}, {"author": "ArkhanLahyet", "body": "Almost none as far as I can tell. I prefer to use the torpedoes and loosen the cube a bit.", "created_utc": "1422142288.0", "edited": "False", "id": "cnzr023", "is_submitter": "False", "link_id": "t3_2thrxe", "parent_id": "t3_2thrxe", "score": "1", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "ArkhanLahyet", "body": "I like your mat.", "created_utc": "1421975020.0", "edited": "False", "id": "cnxtb09", "is_submitter": "False", "link_id": "t3_2tcmf3", "parent_id": "t3_2tcmf3", "score": "4", "subreddit": "yugioh", "subreddit_id": "t5_2rpe6"}, {"author": "ArkhanLahyet", "body": "I wish the [Airplane Guys](http://yugioh.wikia.com/wiki/Itsu) had some real support, strategy and boss monster, like the [Mokey Mokey](http://yugioh.wikia.com/wiki/Mokey_Mokey_%28series%29).", "created_utc": "1421539020.0", "edited": "False", "id": "cnscaqc", "is_submitter": "False", "link_id": "t3_2srcva", "parent_id": "t3_2srcva", "score": "7", "subreddit": "yugioh", "subreddit_id": "t5_2rpe6"}, {"author": "ArkhanLahyet", "body": "I've never found a good use for [Alien Infiltrator](http://yugioh.wikia.com/wiki/Alien_Infiltrator). Attacks directly with 800ATK and only when his column is empty.  \n  \n[Arcana Force VI - The Lovers](http://yugioh.wikia.com/wiki/Arcana_Force_VI_-_THE_LOVERS) can be replaced by [Kaiser Sea Horse](http://yugioh.wikia.com/wiki/Kaiser_Sea_Horse) without any drawbacks.  \n  \n[Harpie Girl](http://yugioh.wikia.com/wiki/Harpie_Girl) does little more than look good. Same with [Cyber Shield](http://yugioh.wikia.com/wiki/Cyber_Shield).  \n  \nBut for me, [Chronomaly Mayan Machine](http://yugioh.wikia.com/wiki/Chronomaly_Mayan_Machine) takes the prize. It *can be treated as 2 Tributes for the Tribute Summon of a Machine-Type monster*, which renders it absolutely useless in a Chronomaly deck.", "created_utc": "1421538566.0", "edited": "False", "id": "cnsc35p", "is_submitter": "False", "link_id": "t3_2srtwz", "parent_id": "t3_2srtwz", "score": "7", "subreddit": "yugioh", "subreddit_id": "t5_2rpe6"}, {"author": "ArkhanLahyet", "body": "1. **meag** [mɛg]  \n2. **meagat** [mɛ.gaɪ];  \n(Particularly heavy rain = **táláslaulot** [ta.laʃ.lau.lot], \"flood on land\")  \n3. **mete** [me.te]  \n4. **sjyper** [ʃeɪ.per]  \n5. **eanaz** [ɛ.nas]; raincloud = **meagenaz** [mɛ.gɛ.nas]  \n6. **tsamat** [t͡sa.maɪ]  \n7. **keleti** [ke.le.ti]; **faosw** [fa.o.sou]  \n8. **yáhkana** [eɪ.'ax.ka.na]  \n9. **eanazem** [ɛ.na.zem]  \n10. **taltot [a soala]** [tal.toɪ a sɔ.la]  ", "created_utc": "1421455175.0", "edited": "False", "id": "cnrhdzu", "is_submitter": "False", "link_id": "t3_2smubu", "parent_id": "t3_2smubu", "score": "1", "subreddit": "conlangs", "subreddit_id": "t5_2red7"}, {"author": "ArkhanLahyet", "body": "I deal with it using particles.  \n**hörzi** [hør.zɪ] = beginning;  \n**akhna** [ax.na] = point;  \n**hörziem akhma** = starting point.  \n  \n**tálás** [ta.las] = land;  \n**elkédzet** [el.'ke.d͡ʒeɪ] = life form;  \n**tálásem elkédzet** = land creature.\n\n", "created_utc": "1421414098.0", "edited": "False", "id": "cnqucvj", "is_submitter": "False", "link_id": "t3_2sl8kr", "parent_id": "t3_2sl8kr", "score": "1", "subreddit": "conlangs", "subreddit_id": "t5_2red7"}, {"author": "ArkhanLahyet", "body": "**garákhy** [ga.he.'ra.xeɪ] *noun* 1 evil, corruption. 2 oblivion.  \n**garákhyt** [ga.he.'ra.xej] *verb*  to corrupt.  \n**garákhyem** [ga.he.'ra.xeɪ.em] *adj* evil, corrupted, malevolent, ill.", "created_utc": "1421246041.0", "edited": "1421246367.0", "id": "cnoochs", "is_submitter": "False", "link_id": "t3_2sd5ws", "parent_id": "t1_cnolzc4", "score": "1", "subreddit": "conlangs", "subreddit_id": "t5_2red7"}, {"author": "ArkhanLahyet", "body": "**göjoasjÿnat** [gø.'jɔ.ʃʊ̈.nəɪ]: *verb* 1 to listen. 2 to pay attention.", "created_utc": "1421245500.0", "edited": "False", "id": "cnoo42l", "is_submitter": "False", "link_id": "t3_2sd5ws", "parent_id": "t1_cnomzd8", "score": "1", "subreddit": "conlangs", "subreddit_id": "t5_2red7"}, {"author": "ArkhanLahyet", "body": "**matikhama** [ma.tɪ.'xa.ma] *noun*  stare.  \n**matikhamat** [ma.tɪ.'xa.maɪ] *verb* 1 stare. 2 ponder, consider.", "created_utc": "1421244875.0", "edited": "False", "id": "cnonunc", "is_submitter": "False", "link_id": "t3_2s8whb", "parent_id": "t1_cnoky1g", "score": "1", "subreddit": "conlangs", "subreddit_id": "t5_2red7"}, {"author": "ArkhanLahyet", "body": "**Akÿn** ['a.kʊ̈n]: 1 ghost, vulture. 2 apparition.", "created_utc": "1421244264.0", "edited": "False", "id": "cnonlyp", "is_submitter": "False", "link_id": "t3_2s8whb", "parent_id": "t1_cnniro2", "score": "1", "subreddit": "conlangs", "subreddit_id": "t5_2red7"}, {"author": "ArkhanLahyet", "body": "dat flair tho", "created_utc": "1421095812.0", "edited": "False", "id": "cnmtn9l", "is_submitter": "False", "link_id": "t3_2s59ao", "parent_id": "t1_cnmbhlq", "score": "3", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "ArkhanLahyet", "body": "Most of the time I find myself doing D2s with the ring and middle fingers(hold firmly with thumb and index only)", "created_utc": "1421095528.0", "edited": "False", "id": "cnmth21", "is_submitter": "False", "link_id": "t3_2s74xy", "parent_id": "t3_2s74xy", "score": "1", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "ArkhanLahyet", "body": "> *\"the small machines that make large hurricanes\"*  \n\nThat's funny, does that part actually have a backstory?", "created_utc": "1421093179.0", "edited": "False", "id": "cnms1hx", "is_submitter": "False", "link_id": "t3_2s53gr", "parent_id": "t1_cnmbsdf", "score": "1", "subreddit": "conlangs", "subreddit_id": "t5_2red7"}, {"author": "ArkhanLahyet", "body": "**gis** [gɪs]  \nNot much to see here.", "created_utc": "1421093002.0", "edited": "False", "id": "cnmrxn2", "is_submitter": "False", "link_id": "t3_2s6wum", "parent_id": "t3_2s6wum", "score": "1", "subreddit": "conlangs", "subreddit_id": "t5_2red7"}, {"author": "ArkhanLahyet", "body": "**hallazenam, kapsajeashÿl esűn sterÿmindenarýf**  \n[ha.'la.ze.nam kap.sa.jɛs.hʊ̈l e.'syn ʃterʊ̈mɪndenareɪf]\n  \nhallaze=to be [somewhere], 2nd p. sing. past perfect  \n-nam=expresses an if clause with past perfect  \nkapsajeashÿl=to see, 1st person subjunctive present  \nesűn=dead (takes the verb *to see*)  \nsterÿ=large, sterÿminden=a long time  \n-rýf=at, in.  \n\n*\"Were you not [there]. I'd see dead at a long time.", "created_utc": "1421092816.0", "edited": "False", "id": "cnmrtqh", "is_submitter": "False", "link_id": "t3_2s6hto", "parent_id": "t3_2s6hto", "score": "1", "subreddit": "conlangs", "subreddit_id": "t5_2red7"}, {"author": "ArkhanLahyet", "body": "It would be enough reason if they murdered me.", "created_utc": "1421088345.0", "edited": "False", "id": "cnmp3qu", "is_submitter": "False", "link_id": "t3_2s6n0z", "parent_id": "t3_2s6n0z", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "ArkhanLahyet", "body": "I'll give away a PS4 to have my own Dyson sphere. Thank you.", "created_utc": "1421087974.0", "edited": "False", "id": "cnmovle", "is_submitter": "False", "link_id": "t3_2s6odc", "parent_id": "t3_2s6odc", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "ArkhanLahyet", "body": "They never did. I guess they assumed I'd learnt enough during sex ed classes in school.\nHeck, no. I've learnt how to put condoms in bananas.", "created_utc": "1421087220.0", "edited": "False", "id": "cnmof9l", "is_submitter": "False", "link_id": "t3_2s6qaw", "parent_id": "t3_2s6qaw", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "ArkhanLahyet", "body": "Dyson Sphere.  \n^^I'm ^^sorry", "created_utc": "1421072951.0", "edited": "False", "id": "cnmh3p7", "is_submitter": "False", "link_id": "t3_2rxn3g", "parent_id": "t3_2rxn3g", "score": "1", "subreddit": "yugioh", "subreddit_id": "t5_2rpe6"}, {"author": "ArkhanLahyet", "body": "Here, have a [link](http://www.gogoanime.com/category/yu-gi-oh-5ds).  \nYou might have to get used to the original names and stuff.", "created_utc": "1421072468.0", "edited": "False", "id": "cnmgx26", "is_submitter": "False", "link_id": "t3_2s0i0i", "parent_id": "t1_cnlvw4v", "score": "1", "subreddit": "yugioh", "subreddit_id": "t5_2rpe6"}, {"author": "ArkhanLahyet", "body": "\"Mitlare, keletkasivéni majkarýf, a dúneenam earim siti\".", "created_utc": "1421063619.0", "edited": "False", "id": "cnmeed0", "is_submitter": "False", "link_id": "t3_2s5hcw", "parent_id": "t3_2s5hcw", "score": "1", "subreddit": "conlangs", "subreddit_id": "t5_2red7"}, {"author": "ArkhanLahyet", "body": "In old Sefir:  \n**letat** ['lɛ.taj] *verb*, 1 to be alive. 2 to survive.    \n**arkiem** ['ar.kjem] *adjective*, derived from **arki**, life of a person, soul.", "created_utc": "1421027276.0", "edited": "1421027530.0", "id": "cnm256j", "is_submitter": "False", "link_id": "t3_2rydu5", "parent_id": "t3_2rydu5", "score": "1", "subreddit": "conlangs", "subreddit_id": "t5_2red7"}, {"author": "ArkhanLahyet", "body": "In Old Sefir:\n**ujna** ['uj.na] 1 number, quantity, digits. 2 soldier (used in the plural *ujnan*).", "created_utc": "1421025554.0", "edited": "False", "id": "cnm19ts", "is_submitter": "False", "link_id": "t3_2s2l2t", "parent_id": "t3_2s2l2t", "score": "1", "subreddit": "conlangs", "subreddit_id": "t5_2red7"}, {"author": "ArkhanLahyet", "body": "[Rosenfelder's word generator](http://www.zompist.com/gen.html) is my favorite and I'd rather use it; click on \"help me\" to see how to use it.\nBefore you start to use word generators, you need to know exactly how your words are created: The structure of your syllables, which sounds are allowed in certain places such as syllable-final, the number and complexity of syllables in the words, how often each sound should appear, et cetera.\nIf you struggle getting the words you want, I highly suggest practicing with natural languages of the world, which I've done myself. Try to figure out how to generate words that resemble Spanish, for example.\nTo summarize the very basic, you first separate your sounds in categories (V=vowels, C=consonants, F=word-final consonants, L=liquids, as many as you need). Then you write the possible syllables (CVC, CLVC, CVCC, CVCF...). If you need digraphs/double letters, use another character like ç instead, and at the end substitute it with rewrite rules such as ç|th.\nYou also calibrate the letter frequency. From your list, I assume you don't want nearly as many *æ* than *a*. But that requires some time.\nAnyway, you'll inevitably stumble upon words you don't want, such as \"Qoqy\", maybe? It's interesting to not randomly generate enerything in your conlang (be mindful of affixes, inflection, derivations, you'll want to generate the root instead).", "created_utc": "1421024726.0", "edited": "False", "id": "cnm0umv", "is_submitter": "False", "link_id": "t3_2s3w9a", "parent_id": "t3_2s3w9a", "score": "4", "subreddit": "conlangs", "subreddit_id": "t5_2red7"}, {"author": "ArkhanLahyet", "body": "It really varies from language to language depending on its nature. In English, some affixes rearrange the stress (engine, engineer) and some don't (utter, utterance). You could say that some affixes \"carry\" the stress with them, and some are naturally weak.\nSome languages like Spanish tend to mostly reapply the stress rules whenever an affix is used (cru**el**, cruel**dad**); stress in those languages are much more regular and predictable than in English.\nSo I don't think there's a definite rule, but I do suggest you to create your stress rules depending on the nature of your language (that is, if the pronunciation of the words are more influenced by their roots or by grammar rules).", "created_utc": "1421022451.0", "edited": "False", "id": "cnlzlgh", "is_submitter": "False", "link_id": "t3_2s3can", "parent_id": "t3_2s3can", "score": "2", "subreddit": "conlangs", "subreddit_id": "t5_2red7"}, {"author": "ArkhanLahyet", "body": "It's a deck that focuses on drawing Exodia and putting it into your opponent's hand in order to deliberately lose.\nBasically, it's a way of telling your opponent: \"Only one of us is going to defeat me, and it's not gonna be you!\"", "created_utc": "1420671155.0", "edited": "False", "id": "cnhrbsu", "is_submitter": "False", "link_id": "t3_2rdof6", "parent_id": "t1_cnfi4bf", "score": "2", "subreddit": "yugioh", "subreddit_id": "t5_2rpe6"}, {"author": "ArkhanLahyet", "body": "Antichamber is definitely one of my favourites.", "created_utc": "1420468943.0", "edited": "False", "id": "cnf3sr7", "is_submitter": "False", "link_id": "t3_2rajhz", "parent_id": "t3_2rajhz", "score": "2", "subreddit": "gaming", "subreddit_id": "t5_2qh03"}, {"author": "ArkhanLahyet", "body": "In 2008 they did decide it would be the Year of the Potato, though.", "created_utc": "1420164213.0", "edited": "False", "id": "cnbpy4x", "is_submitter": "False", "link_id": "t3_2r1ghp", "parent_id": "t1_cnbobmv", "score": "4", "subreddit": "todayilearned", "subreddit_id": "t5_2qqjc"}, {"author": "ArkhanLahyet", "body": "Probably because they were washing dishes.", "created_utc": "1410458424.0", "edited": "False", "id": "ckfills", "is_submitter": "False", "link_id": "t3_2fw130", "parent_id": "t1_ckdu65a", "score": "2", "subreddit": "BradyHaran", "subreddit_id": "t5_2y59h"}, {"author": "ArkhanLahyet", "body": "The matter is more complicated than that. You have to take into account all the stuff that falls into the Earth (comets, asteroids, etc.) as well as all the atmosphere that is lost all the time. As a result, the Earth does get lighter but not really because of satellites and the sort, their contribution is pretty much negligible.\nIf you're interested, read more about it: http://www.bbc.co.uk/news/magazine-16787636", "created_utc": "1408917298.0", "edited": "False", "id": "cjzfgw1", "is_submitter": "False", "link_id": "t3_2eh4lp", "parent_id": "t3_2eh4lp", "score": "4", "subreddit": "Showerthoughts", "subreddit_id": "t5_2szyo"}, {"author": "ArkhanLahyet", "body": "If you want, you can say there's an infinite number of words between a and b, in alphabetical order: Aa, Ab, Ac, Ad, etc. Not all of them necessarily mean anything.", "created_utc": "1408903486.0", "edited": "False", "id": "cjz9cbz", "is_submitter": "False", "link_id": "t3_2efipg", "parent_id": "t3_2efipg", "score": "1", "subreddit": "Showerthoughts", "subreddit_id": "t5_2szyo"}, {"author": "ArkhanLahyet", "body": "I don't think so... there are measuring systems that use different bases, like feet and the speed of light. So not every ruler needs to be based on another ruler.", "created_utc": "1408903211.0", "edited": "False", "id": "cjz982u", "is_submitter": "False", "link_id": "t3_2efp50", "parent_id": "t3_2efp50", "score": "0", "subreddit": "Showerthoughts", "subreddit_id": "t5_2szyo"}, {"author": "ArkhanLahyet", "body": "\"twelfth\", or \"twelfths\", it's really difficult to pronounce that in one syllable.", "created_utc": "1389649313.0", "edited": "False", "id": "ceoqs6o", "is_submitter": "False", "link_id": "t3_1v4opk", "parent_id": "t3_1v4opk", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "ArkhanLahyet", "body": "I like to conlang. Google it.\nMade me learn a lot about grammar, but I never actually succeeded in creating a language.", "created_utc": "1389620413.0", "edited": "False", "id": "ceofbbk", "is_submitter": "False", "link_id": "t3_1v3qqs", "parent_id": "t3_1v3qqs", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "ArkhanLahyet", "body": "Astrologist. They even think it's a serious job.", "created_utc": "1389619717.0", "edited": "False", "id": "ceof5tq", "is_submitter": "False", "link_id": "t3_1v3gxl", "parent_id": "t3_1v3gxl", "score": "13", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "ArkhanLahyet", "body": "Any time I study (with textbooks, files in pdf or others), I like to read it as if i were explaining it to someone else. Especially when doing it in an enthusiastic way, like the Green brothers from [Crash Course](https://www.youtube.com/user/crashcourse)\nI don't know if that works for everyone; that seems to keep me more entertained on the subject.", "created_utc": "1389577908.0", "edited": "False", "id": "ceo4atd", "is_submitter": "False", "link_id": "t3_1v1ynj", "parent_id": "t3_1v1ynj", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "ArkhanLahyet", "body": "Mushrooms. I don't like chewing them.", "created_utc": "1389577307.0", "edited": "False", "id": "ceo41z2", "is_submitter": "False", "link_id": "t3_1v29bg", "parent_id": "t3_1v29bg", "score": "0", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}]