[{"author": "arrozcongandul", "body": "Italian and Portuguese definitely feel like low hanging fruit after knowing Spanish. Once I learned the phonology of Portuguese I was like, wow, this is like a meme, just knowing Spanish and the way Portuguese words are formed, I can take a shot in the dark while speaking and hit the nail on the head a majority of the time. Then I wonder how I didn't understand before, haha", "created_utc": "1662228673.0", "edited": "False", "id": "imye59v", "is_submitter": "False", "link_id": "t3_x4fgqr", "parent_id": "t1_imxagpi", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "arrozcongandul", "body": "Funny how I read your reply to the original comment with an equal level of incredulity, isn't it? To answer the question you posed: I grew up in an inner city surrounded by other black and brown kids. It was the norm to have at least one parent completely missing, if not both. Many of us were raised by a single grandmother because half the men in our families were caught by drug addiction or an extremely predatory prison cycle (think years in prison for selling marijuana as a black or brown man in the 90s compared to the legality of it in several states now).  You seem to be personalizing this person's comment. Before you do so, I'd like to ask you to reflect on whether perhaps your experience could very well be just as unfathomable to some of us as our experiences are to you. Fatherless people and/or people with fathers who made more mistakes than can be counted exist, and we appreciate the visibility the original poster gave. As with most issues, this is not a black or white situation, and very much depends on circumstance and demographic. Erasing the declaration that men who happen to father children are also imperfectly human does not do much good for those of us who found ourselves under their care or in their absence.", "created_utc": "1662149800.0", "edited": "False", "id": "imub3zt", "is_submitter": "False", "link_id": "t3_x3w068", "parent_id": "t1_imtlro1", "score": "17", "subreddit": "therapists", "subreddit_id": "t5_2wlgc"}, {"author": "arrozcongandul", "body": "no hay de que", "created_utc": "1661872725.0", "edited": "False", "id": "ime9x04", "is_submitter": "False", "link_id": "t3_x1lcci", "parent_id": "t3_x1lcci", "score": "4", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "arrozcongandul", "body": "2.5 years to reach b2 is by no stretch of the imagination “way too long.” that’s fantastic progress if you’re learning a language from scratch and it isn’t your full time job / you aren’t living in an immersive environment.", "created_utc": "1661544892.0", "edited": "False", "id": "ilwxxfr", "is_submitter": "False", "link_id": "t3_wyduwr", "parent_id": "t1_ilwmc4a", "score": "8", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "arrozcongandul", "body": "“coño” is a catch-all phrase in Puerto Rico. it’s like “shit, fuck, dammit” hit a pot hole? “coño mano no puedo con los boquetes!!!!” failed a test? “coño me colgué!!” lost your keys for the third time this week? “coño se me perdieron las llaves de nuevo!”", "created_utc": "1661482880.0", "edited": "False", "id": "iltml5h", "is_submitter": "False", "link_id": "t3_wxx5br", "parent_id": "t3_wxx5br", "score": "143", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "arrozcongandul", "body": "wordreference states “propiciador” as the translation of enabler which would make me believe “propiciar” would be used to describe the action of enabling. but someone else can chime in.", "created_utc": "1661467506.0", "edited": "False", "id": "ilsownb", "is_submitter": "False", "link_id": "t3_wxr2c1", "parent_id": "t3_wxr2c1", "score": "13", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "arrozcongandul", "body": "speaking to native speakers for days straight without use of my native language and having very, very, very little issue understanding (like 1% if that) day to day speech & getting my message across.", "created_utc": "1660963026.0", "edited": "False", "id": "il0puxl", "is_submitter": "False", "link_id": "t3_wso8sz", "parent_id": "t3_wso8sz", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "arrozcongandul", "body": "i’m not even a law student but this thread title + your comment + your username holy shit 😭😂 had to add my 2c", "created_utc": "1660959828.0", "edited": "False", "id": "il0j9tp", "is_submitter": "False", "link_id": "t3_wstah4", "parent_id": "t1_il0ehzh", "score": "16", "subreddit": "LawSchool", "subreddit_id": "t5_2rb9g"}, {"author": "arrozcongandul", "body": "Check out Anking on Youtube, he’s got a great video re: anki settings. Lots of medical students swear by him (he’s a med student himself — or was)", "created_utc": "1660959606.0", "edited": "False", "id": "il0isvw", "is_submitter": "False", "link_id": "t3_wstzj7", "parent_id": "t1_il0in4p", "score": "3", "subreddit": "GetStudying", "subreddit_id": "t5_2tl44"}, {"author": "arrozcongandul", "body": "I’m no neuroscientist but I did just complete a biopsych course and read about basic memory consolidation. Basically your brain is extremely efficient in this regard. The neural pathways that get used get strengthened during REM sleep, and the ones that do not, get pruned / weakened. A little bit of forgetting is actually great because this provides further strengthening of those neural pathways once you do practice active retrieval and pull that information back into view. To answer your question, I don’t know if there’s ever a point when learned information just becomes “permanently available upon request.” I think the window just widens. So, it goes from needing to access it the very next day, to 4 days, to 14 days, to 32 days so on and so forth. If you use Anki you’ll see this for yourself. I’ve used it for over a year now and cards pop up from a year ago that I can still recall despite never thinking about them or using that information. Ask me to do the same about info I haven’t regularly reviewed at intervals from that same time and I absolutely am certain I would not be able to do the same. So, yeah, I think just continuing with spaced repetition at least for a few years will really embed that information a lot deeper. Plus learning more related to said information. The more you can interweave new material with past, the stronger those neural pathways will grow.", "created_utc": "1660957734.0", "edited": "False", "id": "il0etox", "is_submitter": "False", "link_id": "t3_wstzj7", "parent_id": "t3_wstzj7", "score": "8", "subreddit": "GetStudying", "subreddit_id": "t5_2tl44"}, {"author": "arrozcongandul", "body": "Definitely turn your phone off and put it in another room. There goes half the distraction right there. Full screen your Zoom lecture or the window from which you’re viewing the lecture and close all other tabs/windows/apps. Make sure to exit from iMessage if it’s enabled on your computer and any other messaging apps like whatsapp, telegram etc. Basically exit every thing and clear away all distractions. Experiment with some very light background noise and see if it helps (light rain sounds, white noise, a fan/AC going). If this proves to be distracting you can do the opposite and get some noise cancelling headphones — these are especially great if you have a shared living situation (noisy roommates or relatives). If closing the apps doesn’t work, try some web blockers. I’ve never used them but maybe something exists that can block access to all other apps / websites for the duration of your class. Best of luck. Remember to take advantage of lecture breaks to get up, drink a glass of water, stretch your legs, and clear your mind so you can get back focused to your work.", "created_utc": "1660955685.0", "edited": "False", "id": "il0ah98", "is_submitter": "False", "link_id": "t3_wstasv", "parent_id": "t3_wstasv", "score": "4", "subreddit": "GetStudying", "subreddit_id": "t5_2tl44"}, {"author": "arrozcongandul", "body": "Use Anki + 5,000 most frequently used words premade deck and you’ll be golden. Active recall / retrieval testing will do you well.", "created_utc": "1660923907.0", "edited": "False", "id": "iky48kp", "is_submitter": "False", "link_id": "t3_wsa2pi", "parent_id": "t3_wsa2pi", "score": "4", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "arrozcongandul", "body": "Literally that. Or, God forbid they took a few years of Spanish in high school. Had a severely awkward moment when I literally said one sentence to someone and they understood 0%.  That’s after they told me they studied Spanish for years. Never did that again and now just go in to every situation assuming peoples’ capabilities are way below what they perceive them to be.", "created_utc": "1660880217.0", "edited": "False", "id": "ikw0h0l", "is_submitter": "False", "link_id": "t3_ws1ocp", "parent_id": "t1_ikvz18j", "score": "34", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "arrozcongandul", "body": "Nobody cares. Literally it’s a point of conversation for 1 minute tops followed by them telling me they speak X language that they clearly don’t actually have proficiency in and I just let it slide.", "created_utc": "1660877199.0", "edited": "False", "id": "ikvueha", "is_submitter": "False", "link_id": "t3_ws1ocp", "parent_id": "t3_ws1ocp", "score": "127", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "arrozcongandul", "body": "just accept now you will never get the nasal sounds 100% down and you’re good to go 🥴😂", "created_utc": "1660859641.0", "edited": "False", "id": "ikuq0pm", "is_submitter": "False", "link_id": "t3_wro0g3", "parent_id": "t3_wro0g3", "score": "5", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "arrozcongandul", "body": "anki /thread", "created_utc": "1660853471.0", "edited": "False", "id": "iku9mcm", "is_submitter": "False", "link_id": "t3_wrqy3g", "parent_id": "t3_wrqy3g", "score": "12", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "arrozcongandul", "body": "are you referring to a fresa accent?", "created_utc": "1660783789.0", "edited": "False", "id": "ikqfzis", "is_submitter": "False", "link_id": "t3_wqnb8x", "parent_id": "t1_iko4ikh", "score": "5", "subreddit": "linguistics", "subreddit_id": "t5_2qhos"}, {"author": "arrozcongandul", "body": "So you’ve been learning English since middle school. Okay. Very different situation. OP’s gonna get downvoted to oblivion because there’s an obvious Stephen Krashen fan base here. Output — or live, active recall during speech — is without a doubt the most difficult of the four skills to master. Retrieval practice is in fact key in honing this. OP’s post has a ton of truth whether people want to accept it or not. Reading, even writing, is fine and dandy because you have all the time in the world to think about & craft your message. Real time speech is exponentially more difficult because you are not afforded this gap. In order for communication to flow smoothly and effortlessly, you need to be able to almost instantaneously recall a specific word and use it appropriately while simultaneously understanding and processing the message being relayed by your partner. I say this as someone who quite literally was texting paragraphs on day 3 of portuguese after learning Spanish but not nearly able to do the same in spoken dialogue until much later with lots of practice speaking.", "created_utc": "1660778160.0", "edited": "False", "id": "ikq34qc", "is_submitter": "False", "link_id": "t3_wr082k", "parent_id": "t1_ikq1whf", "score": "8", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "arrozcongandul", "body": "Thank you!! Yes, of course! [This](https://www.reddit.com/r/GetMotivated/comments/5950tm/text_i_just_finished_the_online_coursera_course/) post is a summary of the Coursera course of the same name. Here's my own gist:\n\n1. Deep focus is key. I use an app called Forest combined with the Pomodoro technique. I do 25 minutes of study, 5 minute break, then repeat. I do this 4 times before taking a longer 15-60 minute break, then repeat another 4 Pomodoros. Make sure your study area is distraction free. No checking phone / apps etc.\n2. Active recall / retrieval practice is king. Read something and then test yourself on it: ask yourself: what did I just read? If you can't recall, reread it then re-test yourself. If you're doing math, try to work the problem sets out yourself, only looking at the solution once you're finished with your attempt. \n3. [Spacing your study.](https://www.kpu.ca/sites/default/files/Learning%20Centres/Think_SpacedRepetition_LA.pdf)Don't cram every thing at once. Do a little bit each day. Better to study 1 hour each day for 3 days than 3 hours in 1 day. This results in a significant increase in long term retention of material. Use a program like Anki which utilizes spaced repetition system, or simply look up popular SRS timeframes and review your notes accordingly.\n4. Interleaving techniques (doing mixed problem sets instead of just chunks of the same kinds of problems, for example). This helps a lot in quickly intuiting / identifying what sort of problem you are dealing with / what it is asking you.\n5. Use memory tricks like acronyms, vivid imagery, and mnemonics to help rote memorization of facts (anatomy, new language vocab, etc).\n6. SLEEP! And EXERCISE! This should actually be #1. Your brain strengthens new neural connections during REM sleep (which is correlated with overall length of sleep ie longer duration of sleep = more REM). It also PRUNES / weakens unused neurons during this time. The same synapses that activate in the brain while learning something new during the day activate while you are asleep, suggesting the brain is consolidating these new skills during sleep. Exercise assists in nerve cell's dendritic growth -- this makes it easier for neurons to connect and strengthen one another. Basically makes it easier for you to learn new things. So, long term learning quite literally occurs while you are sleeping, not just when you are studying.j", "created_utc": "1660770445.0", "edited": "1660783574.0", "id": "ikpjx8k", "is_submitter": "True", "link_id": "t3_wqwu2f", "parent_id": "t1_ikp2t4d", "score": "7", "subreddit": "GetStudying", "subreddit_id": "t5_2tl44"}, {"author": "arrozcongandul", "body": "thanks so much, I really appreciate your comment!! Good luck on your next semester as well 😊", "created_utc": "1660769542.0", "edited": "False", "id": "ikphil7", "is_submitter": "True", "link_id": "t3_wqwu2f", "parent_id": "t1_ikp0usi", "score": "5", "subreddit": "GetStudying", "subreddit_id": "t5_2tl44"}, {"author": "arrozcongandul", "body": "Great write up!!! Always interested to hear what goes on at FSI, so nice to finally see. Re: Anki, you said you studied 40 new words a day for 24 weeks straight. Was this a premade deck, or did you create this from scratch? If so, how did you incorporate building the deck? IE did you just go along each day adding new words through the day, or did you sit down and designate making 40 new cards a day, or did you sit down and make say, 1,000 in one day? How much time did this card creation take? I'm a firm proponent of Anki and SRS but the time it's taking up with card creation is killing me right now. Congrats on the completion of your course!! That sounds really, really exciting and a great way to start a language", "created_utc": "1660762686.0", "edited": "False", "id": "ikoz53s", "is_submitter": "False", "link_id": "t3_wqusu3", "parent_id": "t3_wqusu3", "score": "16", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "arrozcongandul", "body": "Hey!! I was in a similar position you — I’m American but I have family from latin america, so Spanish was always around growing up but I never took it upon myself to learn it well enough to speak. I’ve been studying now for about a year and a half and have made extremely good progress (I’m conversationally fluent, journal in spanish, text / call my friends and family in spanish, read very long novels written for adults, etc). I personally didn’t use duolingo. I did however download an app called WordReference which has an english to spanish & spanish to english dictionary. I used that any time I wasn’t sure how to say something or whenever I encountered an unfamiliar word. There’s even audio files of how to pronounce words in a general Spaniard accent, Mexican accent, and Argentinian accent. It also has conjugation tables for verbs — extremely useful!!\n\nI also use a spaced repetition system (SRS) program called Anki to learn vocabulary. SRS essentially takes care of spacing out your reviews so you see words you struggle to remember more often, and words that are easy, less often. That way you aren’t reviewing a million words every day wasting time. I started with a premade deck of the 5,000 more frequent words, [here](https://ankiweb.net/shared/info/1350487717)\n\nI would say study 10-20 new words a day (+ reviews) depending on how much time you have to study. The reviews add up pretty quickly, so start slow. I use [these settings](https://youtu.be/Eo1HbXEiJxo) to optimize Anki’s algorithm for language learning. \n\nApart from Anki and WordReference, I also prefer to use Deepl over google translate. Deepl gives a variety of possible translations, and usually is better with colloquialisms / sayings. On top of all of this, reading, listening to podcasts whenever doing busy work around the house / driving, and watching shows in Spanish have all been super helpful. But probably the most helpful has been talking with native speakers using language exchange apps like Tandem & Hellotalk. You help them with English and they help you with Spanish. This is great because you get to see how the language is actually used in real life. If you have any more questions, just send me a message. Good luck & enjoy improving your Spanish :)\n\ncliffs:\nwordreference: dictionary / verb conjugation / audio file resource (forvo is also great for audio files)\nanki: vocab study \nreading/podcasts/shows/youtube: input \ntandem / hellotalk: language exchange with native speakers", "created_utc": "1660748462.0", "edited": "1660748647.0", "id": "iknxhh7", "is_submitter": "False", "link_id": "t3_wqg4gx", "parent_id": "t3_wqg4gx", "score": "1", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "arrozcongandul", "body": "Just RJ, but I will definitely be returning in the near future to visit more. Would love to see SP & Bahía in particular", "created_utc": "1660703921.0", "edited": "False", "id": "iklv0uq", "is_submitter": "False", "link_id": "t3_wpyu6x", "parent_id": "t1_iklny0s", "score": "5", "subreddit": "Portuguese", "subreddit_id": "t5_2sqn7"}, {"author": "arrozcongandul", "body": "I practice brazilian jiu jitsu & there’s a lot of brazilians at my gym. Thought the language sounded super cool so I just started listening to music without understanding. Visited Brasil before the pandemic and absolutely loved it & the people I met. Now a few weeks into finally properly learning and really enjoying it", "created_utc": "1660670880.0", "edited": "False", "id": "ikjn7h2", "is_submitter": "False", "link_id": "t3_wpyu6x", "parent_id": "t3_wpyu6x", "score": "26", "subreddit": "Portuguese", "subreddit_id": "t5_2sqn7"}, {"author": "arrozcongandul", "body": "2,000 most frequently used word families gets you something like 85% comprehension in most daily conversations. 4,000 for 90%. 9,000 for 98% comprehension. note that this is word families, not words. (ie to go, went, going, etc = 1 word family).", "created_utc": "1660662085.0", "edited": "1660663215.0", "id": "ikizawt", "is_submitter": "False", "link_id": "t3_wppaxe", "parent_id": "t1_ikirc3s", "score": "7", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "arrozcongandul", "body": "you can pronounce them like some puerto ricans  as more of a voiceless uvular fricative [χ] - I’m perfectly able to troll my R but still opt to occasionally say them as my grandparents in the way I described. It’s a more guttural R sound. afaik no other spanish speakers outside of PR do this but I’m always able to get my message across without any problems.", "created_utc": "1660614321.0", "edited": "False", "id": "ikgq0mk", "is_submitter": "False", "link_id": "t3_wph198", "parent_id": "t3_wph198", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "arrozcongandul", "body": "if you’re using anki check out AnKing on youtube. he’s a med student who released a video this year about the settings he uses. He suggests lowering the interval modifier between .9 and 1.1 for language learning. I’m playing with it now after using refold’s settings for a long while (which were way higher, if I remember closer to 2). The refold settings resulted in me having close to 80-85% retention rate. I think ideally 90-95% would be better, so seeing cards more frequently by increasing the interval modifier may help w that.", "created_utc": "1660594567.0", "edited": "False", "id": "ikfesqd", "is_submitter": "False", "link_id": "t3_wp8h7f", "parent_id": "t3_wp8h7f", "score": "4", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "arrozcongandul", "body": "correct me if i’m wrong, but my carioca friends seem to go with the reduced o quite a bit, né?", "created_utc": "1660280653.0", "edited": "False", "id": "ijyhbo2", "is_submitter": "False", "link_id": "t3_wmavm4", "parent_id": "t1_ijy99ie", "score": "2", "subreddit": "Portuguese", "subreddit_id": "t5_2sqn7"}, {"author": "arrozcongandul", "body": "just want to congratulate you for being of hispanic heritage and taking up the language on your own after not learning it from parents. it’s literally the absolute best feeling in the world being able to communicate with spanish-only speakers in your family after studying a while. hope you get to have the same opportunity. keep going", "created_utc": "1660253314.0", "edited": "False", "id": "ijwub1t", "is_submitter": "False", "link_id": "t3_wlt221", "parent_id": "t3_wlt221", "score": "6", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "arrozcongandul", "body": "anki + pomodoro technique \n\nanki is a spaced repetition program. pomodoro technique is just 25 mins of study, 5 min break rinse and repeat. after 4 pomodoros, take a 15-60 minute break and repeat the cycle as long as you’d like.", "created_utc": "1660248732.0", "edited": "False", "id": "ijwigy9", "is_submitter": "False", "link_id": "t3_wlz73l", "parent_id": "t3_wlz73l", "score": "2", "subreddit": "GetStudying", "subreddit_id": "t5_2tl44"}, {"author": "arrozcongandul", "body": "concienzudamente ;)", "created_utc": "1660247650.0", "edited": "False", "id": "ijwfn1d", "is_submitter": "False", "link_id": "t3_wlz4wg", "parent_id": "t3_wlz4wg", "score": "4", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "arrozcongandul", "body": "yes, i do all my decks in one sitting. and i don’t have set days for set languages. every day i do various things back and forth between them. i consider it interleaved practice. although it might be confusing going from spanish to portuguese to french, over the long term\nthis will help strengthen recall and eventually separate the languages. it’s good to struggle while learning. active recall is fantastic for this reason but mix it with interleaved practice and it’s even better.", "created_utc": "1660239225.0", "edited": "False", "id": "ijvtbux", "is_submitter": "False", "link_id": "t3_wlu6mf", "parent_id": "t3_wlu6mf", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "arrozcongandul", "body": "20’s a great age to pick up a third language. 80’s great, too, but 20 especially so, because you’ve got a lifetime of practice and possibilities of interaction with the language ahead of you. English is the dominant language, yeah, but not every language learned has to be one with the intention of functionality / intention of production. You are correct in saying learning a new language is a massive undertaking. If the desire to learn Italian is not that strong, or you simply want to listen to media and read in the language, you can also do just that. Simply work on your comprehension skills without going through the hassle of trying to produce your own output. That will relieve you of a huge burden of the language learning process.", "created_utc": "1660231348.0", "edited": "False", "id": "ijv8ft0", "is_submitter": "False", "link_id": "t3_wltgyx", "parent_id": "t3_wltgyx", "score": "16", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "arrozcongandul", "body": "if you’re losing concentration, try shorter sessions. i like the pomodoro method. 25 minutes of focus, then 5-10 minute break, rinse and repeat. after 4 pomodoros take a longer 15-60 minute break (however you want to do it). get up and move around, maybe even get a workout in before resuming studying. i really find it tough sloughing through more than 50 minutes of studying at a time without a break.", "created_utc": "1660230456.0", "edited": "False", "id": "ijv6633", "is_submitter": "False", "link_id": "t3_wlkktz", "parent_id": "t3_wlkktz", "score": "3", "subreddit": "GetStudying", "subreddit_id": "t5_2tl44"}, {"author": "arrozcongandul", "body": "u clearly have not tried learning spanish as a native portuguese speaker. 6 months and you’ll be having 2 hour conversations with your argentinian brothers", "created_utc": "1660195817.0", "edited": "False", "id": "ijtm21t", "is_submitter": "False", "link_id": "t3_wlhw1v", "parent_id": "t3_wlhw1v", "score": "24", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "arrozcongandul", "body": "random mas vc de onde é? qual parte do brasil?", "created_utc": "1660194894.0", "edited": "False", "id": "ijtkn7u", "is_submitter": "False", "link_id": "t3_wlfe5e", "parent_id": "t1_ijt0nce", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "arrozcongandul", "body": "you’re exactly right. her parents had limited english but spoke to each other primarily in that language. she told me her dad spoke to her occasionally in mandarin but she always responded in english, too, so the little she does know is more “receptive” in nature. very interesting.", "created_utc": "1660191323.0", "edited": "False", "id": "ijteqr0", "is_submitter": "False", "link_id": "t3_wkwvwo", "parent_id": "t1_ijte30f", "score": "2", "subreddit": "linguistics", "subreddit_id": "t5_2qhos"}, {"author": "arrozcongandul", "body": "anecdotally i know a woman in her thirties born and raised in singapore to a malay mother and chinese father who only speaks english. she’s first generation. that almost never happens in the US — usually it’s not til the grandchildren of immigrants that the language starts being phased out or forgotten. at least within latin families from what i’ve observed.", "created_utc": "1660182739.0", "edited": "False", "id": "ijsx727", "is_submitter": "False", "link_id": "t3_wkwvwo", "parent_id": "t1_ijpvygc", "score": "2", "subreddit": "linguistics", "subreddit_id": "t5_2qhos"}, {"author": "arrozcongandul", "body": "use anki, spaced repetition system (srs) that takes care of the spacing of reviews for you. that should theoretically make it so you aren’t just arbitrarily studying every thing every study session. seriously my lifeline for the summer biopsych course i’m in right now. you can download premade decks + add to them, or create your own from scratch. active recall is top tier studying, i wouldn’t ditch flash cards, at least not entirely.", "created_utc": "1660182319.0", "edited": "False", "id": "ijsw8nt", "is_submitter": "False", "link_id": "t3_wldzbu", "parent_id": "t3_wldzbu", "score": "2", "subreddit": "GetStudying", "subreddit_id": "t5_2tl44"}, {"author": "arrozcongandul", "body": "Growing up in Chicago every thing was english / spanish / polish, especially when you got to the southwest suburbs. I remember being embarrassed because I would go into delis with full Polish speaking staff not knowing any Polish and just pointing at what I wanted. The ladies and their daughters would smile and laugh. I really enjoyed hearing the language spoken even though I never learned more than a few basic words.\n\nedit \nfor those who aren’t aware, chicago apparently has / had the largest polish population outside of poland. did not know that when i was a kid but makes 100% sense looking back lol", "created_utc": "1660151649.0", "edited": "False", "id": "ijqqwz8", "is_submitter": "False", "link_id": "t3_wkxslx", "parent_id": "t1_ijq8wd5", "score": "17", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "arrozcongandul", "body": "thank you x100, appreciate it a ton. that sounds like a fantastic idea. thank you for the roadmap i resource!!!", "created_utc": "1660147511.0", "edited": "False", "id": "ijqfr0b", "is_submitter": "False", "link_id": "t3_wkvk0j", "parent_id": "t1_ijqc8na", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "arrozcongandul", "body": "you guys are literally amazing. thank you so much. just purchased that french phonetics book, and gonna look into the FF deck. appreciate you both immensely! :)", "created_utc": "1660147464.0", "edited": "False", "id": "ijqfmlj", "is_submitter": "False", "link_id": "t3_wkvk0j", "parent_id": "t1_ijqby6t", "score": "4", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "arrozcongandul", "body": "in terms of easier than I previously thought: Portuguese for Spanish speakers, and the inverse has to be even easier considering the few amount of vowel sounds Spanish has compared with Portuguese. After studying Spanish for a few years and beginning with portuguese, the most difficult part initially was getting used to the pronunciation while speaking. Also some conjugation differences. apart from these things, it’s startlingly similar — to the point where I almost can’t believe I didn’t understand spoken Portuguese before formally studying it", "created_utc": "1660144879.0", "edited": "False", "id": "ijq8t9j", "is_submitter": "False", "link_id": "t3_wkvk0j", "parent_id": "t3_wkvk0j", "score": "12", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "arrozcongandul", "body": "do you all have any recommended tools for learning french pronunciation? i want to start w the language but tbh the phonology seems a bit intimidating.", "created_utc": "1660144479.0", "edited": "False", "id": "ijq7rq6", "is_submitter": "False", "link_id": "t3_wkvk0j", "parent_id": "t1_ijpzf5u", "score": "6", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "arrozcongandul", "body": "my phone and it’s not even close. i set a focus timer and throw it in my desk drawer so its out of sight and pomodoro in chunks of 25 minutes, not looking at texts / reddit etc until i’ve completed 4 pomodoros. works well.", "created_utc": "1660140427.0", "edited": "False", "id": "ijpxnj7", "is_submitter": "False", "link_id": "t3_wkxi70", "parent_id": "t3_wkxi70", "score": "48", "subreddit": "GetStudying", "subreddit_id": "t5_2tl44"}, {"author": "arrozcongandul", "body": "whatever your morning routine, make sure you get direct exposure to sunlight for 5-30 minutes as soon as you can. the photons help immensely in setting your circadian rhythm. cold shower of 1-3 minutes after releases adrenaline hormones and helps to activate your autonomic nervous system raising internal body temperature, both increasing wakefulness.", "created_utc": "1660116186.0", "edited": "False", "id": "ijov0ri", "is_submitter": "False", "link_id": "t3_wklqxe", "parent_id": "t3_wklqxe", "score": "1", "subreddit": "simpleliving", "subreddit_id": "t5_2r0za"}, {"author": "arrozcongandul", "body": "allí = there (away from you, but closer distance than allá)\nallá = over there (further distance away)\n\nto here would be aquí / acá\n“vente aquí” = come here\n“me podría dar la comida para acá, señor?”\ncould you give me (could i have) the food for here (to eat here), sir?", "created_utc": "1660083145.0", "edited": "False", "id": "ijn211d", "is_submitter": "False", "link_id": "t3_wkbbx5", "parent_id": "t1_ijn0ssj", "score": "2", "subreddit": "italianlearning", "subreddit_id": "t5_2tuxf"}, {"author": "arrozcongandul", "body": "que gramática vc tá usando? uso Modern Portuguese Grammar por John Whitlam e tá ótimo, bem legal. altamente recomendado na verdade mas tenho curiosidade sobre o que vc usa", "created_utc": "1660082946.0", "edited": "False", "id": "ijn1jie", "is_submitter": "False", "link_id": "t3_wk1yv2", "parent_id": "t1_ijkrxly", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "arrozcongandul", "body": "I anki up to 2 hours a day between 3 languages. I only do native language front side, target language on reverse side. If I want to recognize a word I can do that reading or listening to podcasts (much more language dense than movies btw). Idk why people think only doing comprehensible input will get them producing words they recognize. The ability to produce language and the ability to comprehend language are literally controlled by two different parts of the brain (Broca’s Area in the frontal lobe & Wernicke’s Area in the temporal lobe respectively). While strengthening the neurons related to comprehending a word are obviously fundamental, that alone does not = strengthening of neurons related to actively recalling + producing that word. You need to consistently test your brain to get those neurons firing, strengthening, and growing, and SRS is the single most effective way to do that. The interleaving practice offered by speaking with a fluent speaker is also fantastic because you can’t predict the course of a spontaneous, unplanned, extended conversation. This forces you to recall and quickly switch through various words, tenses, conjugations etc live time, further strengthening these connections.\n\nWhile it’s obviously important to have a balanced language learning program, I would heavily favor anki in the early stages, especially up to learning 2-3,000 most frequently used words. from there, grammar study of construction of tenses/conjugations etc with input will show you how to construct your own sentences; writing and output will be made possible.", "created_utc": "1660079558.0", "edited": "1660079767.0", "id": "ijmt36e", "is_submitter": "False", "link_id": "t3_wkb6jl", "parent_id": "t3_wkb6jl", "score": "12", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "arrozcongandul", "body": "A true B2 is very solid. That’s a great spot to be to pick up a new language. And to be quite honest, I’d love to see the research on interference in language learning. I’m willing to bet that while yes, you may occasionally mix up an “agora” for an “ahora” while speaking here and there, or want to say “fazendo” instead of “haciendo,” in the long term the languages reinforce each other. I don’t do separate days for separate languages. I live my life in all three. I’ll work all day in English, call my relatives in spanish, then speak to my brazilian friends in Portuguese while texting in all 3 all through the day. And I do my anki decks for spanish / portuguese / italian back to back every day. I honestly think it’s better that way. Of course you’re going to go through ebbs and flows and prioritize one over the other(s) at certain points, but that’s fine, too. Life is like that. Language learning is counted in years, not months or weeks. Have at it and enjoy learning a new language while mastering Spanish.", "created_utc": "1660030854.0", "edited": "False", "id": "ijjwoxe", "is_submitter": "False", "link_id": "t3_wjmgms", "parent_id": "t3_wjmgms", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "arrozcongandul", "body": "hit me up if u need some mnemonics for the brain anatomy in your bio psych, forebrain / cerebral cortex gets to be a doozy but optf occipital parietal temporal frontal lobe it up and ur g2g gg no re professor", "created_utc": "1659947753.0", "edited": "False", "id": "ijf24pi", "is_submitter": "False", "link_id": "t3_wisivq", "parent_id": "t1_ijdu7tz", "score": "2", "subreddit": "college", "subreddit_id": "t5_2qh3z"}, {"author": "arrozcongandul", "body": "boa sorte irmão vamos pra cima", "created_utc": "1659947561.0", "edited": "False", "id": "ijf1whm", "is_submitter": "False", "link_id": "t3_wisivq", "parent_id": "t1_ijdw0jk", "score": "1", "subreddit": "college", "subreddit_id": "t5_2qh3z"}, {"author": "arrozcongandul", "body": "ask yourself those questions. it’s necessary not just in language learning but any skill you want to improve. you’ve got to pinpoint your weaknesses with laser like accuracy. the stuff you don’t want to do, the stuff you constantly forget how to do during conversations, the stuff you always talk around by using a different conjugation, a different way of saying it: that’s exactly what you should be practicing and doing 100x more than any thing else. i could tell you the 10,000 more frequent word families in english but if you work in a hospital and don’t know the first thing about medical english, it’s clear what you specifically need to focus on. do some introspection and i’m sure the answer will come to you.\n\nedit\nresearch erik anderson and the concept of deliberate practice. it’s basically what i’m taking about. identify a weakness, spend significant time on task specifically improving that weakness, pause to reflect/collect feedback, make any adjustments as needed, then repeat the process.", "created_utc": "1659939303.0", "edited": "False", "id": "ijergfl", "is_submitter": "False", "link_id": "t3_wj0u4s", "parent_id": "t3_wj0u4s", "score": "9", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "arrozcongandul", "body": "I personally think sometimes yes. It’s not a surprise there are medical students who skip classes and take their studying in their own hands. Sometimes I get professors with 2+ hour lectures who could’ve distilled the actual content to half of that. I’m in a summer session right now and literally haven’t gone to class since the first week and have As in both courses because I study 5 hours a day on my own instead of spending 3 in lecture and 2 outside with 1.5 of the lecture time being a professor answering questions from other students who haven’t done readings or aren’t caught up on material. I think self-directed study and review should be the primary focus, with meetings with professors etc supplementary. But that takes a very responsible individual who will actually do the work.", "created_utc": "1659916486.0", "edited": "False", "id": "ijdkyto", "is_submitter": "False", "link_id": "t3_witnp8", "parent_id": "t3_witnp8", "score": "2", "subreddit": "GetStudying", "subreddit_id": "t5_2tl44"}, {"author": "arrozcongandul", "body": "??? caliente se refiere a estar prendido sexualmente, no es lo mismo", "created_utc": "1659903198.0", "edited": "False", "id": "ijcprl8", "is_submitter": "False", "link_id": "t3_wi79x0", "parent_id": "t1_ijcgh2z", "score": "2", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "arrozcongandul", "body": "tell me you’re being hit on by your puerto rican / dominican language exchange partner without telling me you’re being hit on by your puerto rican / dominican language exchange partner", "created_utc": "1659864328.0", "edited": "False", "id": "ijaj1fs", "is_submitter": "False", "link_id": "t3_wi79x0", "parent_id": "t3_wi79x0", "score": "60", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "arrozcongandul", "body": "hmm que curioso!! me crié con mis abuelos maternos, los dos del campo. mi abuela sigue viva y sí hace eso de arrastrar la R pero no creo que nunca ha dicho ji/jei. me pregunto si es algo de otra generación, que ella vivió allá en los 50s, no sé cuantos años tiene tu pai", "created_utc": "1659828009.0", "edited": "False", "id": "ij8ub4l", "is_submitter": "False", "link_id": "t3_whtcht", "parent_id": "t1_ij8scy9", "score": "3", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "arrozcongandul", "body": "soy estadounidense con raíces boris, se me hace que eso de decir “se” se escucha bastante con chamacos en el género urbano 😂 como “seeeee, meraaaaa” nunca he escuchado eso de. “jí” ni “jéi” pero como he dicho yo no vivo en las islas — se hace en una zona en particular o en toda la isla?", "created_utc": "1659826857.0", "edited": "False", "id": "ij8rw24", "is_submitter": "False", "link_id": "t3_whtcht", "parent_id": "t1_ij8cmij", "score": "7", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "arrozcongandul", "body": "literally never fails. every time i’m in NY i can see a group of argentinians looking at google maps on their phone scanning the platform for someone who looks like they might speak spanish. the look of both relief that i speak spanish followed by severe pain on their face when i respond and tell them they are in fact headed to buschwick and not midtown is priceless 😂", "created_utc": "1659817495.0", "edited": "False", "id": "ij87d9b", "is_submitter": "False", "link_id": "t3_whslgg", "parent_id": "t1_ij7xpv8", "score": "6", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "arrozcongandul", "body": "i’m born & raised in the states but mi abuela siempre arrastra la R, casi todo el tiempo. más a menudo que no. when i was a kid i was pretty self conscious about the way I said words like arroz, carro, perro, etc. but now i’m proud because it’s a quick indicator of my heritage. i’ve literally never met any one where i live who does it (vaaaaast majority of latinos here are mexican) pero sigo haciéndolo, que se joda. yo hablo como me da la gana", "created_utc": "1659783991.0", "edited": "False", "id": "ij67srs", "is_submitter": "False", "link_id": "t3_wg3kuu", "parent_id": "t3_wg3kuu", "score": "1", "subreddit": "PuertoRico", "subreddit_id": "t5_2qjyb"}, {"author": "arrozcongandul", "body": "That’s awesome, congrats. 40 minutes in your TL is not too shabby at all. Keep chipping away at it. Sounds like you’re making fabulous progress.", "created_utc": "1659778394.0", "edited": "False", "id": "ij60zpr", "is_submitter": "False", "link_id": "t3_whjkea", "parent_id": "t3_whjkea", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "arrozcongandul", "body": "I need to check out my local library. Wonder if they have any thing in portuguese. Thanks for the inspo", "created_utc": "1659778260.0", "edited": "False", "id": "ij60u9i", "is_submitter": "False", "link_id": "t3_wh9ki1", "parent_id": "t1_ij5r770", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "arrozcongandul", "body": "I actively use tandem on a daily basis. I downloaded hellotalk but don’t like the interface nearly as much so I never use it, but that’s personal preference & I know plenty of other people like it. I think tandem has been the single most important factor in helping my output / spontaneous speech. You can send voice notes while building up your ability and once ready you can make phone or even video calls with partners via the app. You absolutely will be able to find tons of French people on either app.", "created_utc": "1659768192.0", "edited": "False", "id": "ij5onjx", "is_submitter": "False", "link_id": "t3_wgp4uz", "parent_id": "t1_ij4zh4p", "score": "4", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "arrozcongandul", "body": "you have received not very good advice in this thread. i’m a full time student with freelance part time work studying two languages (spanish and portuguese). I’ve reached fluency in spanish.\n\ndownload anki (spaced repetition system app — incredible for any thing you want to study, not just languages) and download a premade deck of the 5000 most frequently used words in the language. after learning about 600 of those words, start reading graded readers or very simple writing. comics, blogs, etc. knowing the 2,000 most frequently most used words gets you something like 90% comprehension in day to day conversation. so do daily vocab study (aim for 10-15 new words a day, don’t go too much higher than this bc the reviews add up quick and you don’t want to be taking more than an hour a day to do them while having a full course load in school) paired with leisurely reading of material you can understand at least 90% of, preferably more. you can also download apps like tandem or hellotalk to practice conversing with native speakers, but that’s after you’ve got some vocab down. buy a small grammar workbook or look up the grammar foundations via online resources, too. very helpful to get an idea of how things work. also use apps on your phone like wordreference for definitions of new words, and deepl for translation (better than google translate). each language has its own resources, so find the subreddit for the specific language you want to learn and poke around their faq to find what people have used with success.\n\ntldr / cliffs: anki 10-15 new words a day. read graded readers / material you understand at least 90% of. buy a grammar workbook and check that out as necessary. download tandem or hellotalk and talk with native speakers. listening to music alone won’t cut it, and duolingo definitely will not. people on the language learning subreddit talk about how they have 1,000 day long streaks and can’t form a single sentence. don’t be that guy", "created_utc": "1659743679.0", "edited": "1659743886.0", "id": "ij4fyzb", "is_submitter": "False", "link_id": "t3_wh8gnk", "parent_id": "t3_wh8gnk", "score": "102", "subreddit": "GetStudying", "subreddit_id": "t5_2tl44"}, {"author": "arrozcongandul", "body": "Phenomenal response, genuinely making me curious. I don’t personally know any one hard of hearing or deaf but just the other day was thinking of how ridiculous it is that I can’t speak sign if I were to. Your post has only fueled my interest in learning, thank you.", "created_utc": "1659735440.0", "edited": "False", "id": "ij3xcj2", "is_submitter": "False", "link_id": "t3_wh44xu", "parent_id": "t1_ij3v9wd", "score": "15", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "arrozcongandul", "body": "But doesn’t looking up definitions to understand words that you’ll likely encounter hundreds / thousands of times make it easier? In the long run. Also, while I agree the key factor is sustained effort / persistence, you can significantly reduce the amount of time spent on task needed if you simply work more effectively. The two are not mutually exclusive.", "created_utc": "1659735075.0", "edited": "False", "id": "ij3wgrh", "is_submitter": "False", "link_id": "t3_wdzc4b", "parent_id": "t1_ij3s0y0", "score": "1", "subreddit": "linguistics", "subreddit_id": "t5_2qhos"}, {"author": "arrozcongandul", "body": "100% it has to be the “easiest” language to tackle after spanish, more so even than italian IMO (which I studied long ago). once you get the phonology down, you really already know so much through cognates. And Brazilians are so happy to meet someone learning the language. I get so much feedback and help from them that I have 0 fear conversing. It’s really great.", "created_utc": "1659721174.0", "edited": "False", "id": "ij2wukq", "is_submitter": "False", "link_id": "t3_wgp4uz", "parent_id": "t1_ij2a59i", "score": "5", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "arrozcongandul", "body": "I’m sorry - and I beg your pardon for not contributing to the question at hand — but why would you want to spend almost 1,000 hours intentionally trying to learn a language without all of the tools at your disposal? Obviously the person referenced was doing a sort of self experiment. But I just can’t see how that is a productive way to spend your language learning time otherwise.", "created_utc": "1659691110.0", "edited": "False", "id": "ij165w4", "is_submitter": "False", "link_id": "t3_wdzc4b", "parent_id": "t1_iirygaw", "score": "2", "subreddit": "linguistics", "subreddit_id": "t5_2qhos"}, {"author": "arrozcongandul", "body": "I absolutely actively studied. Daily, religious anki for 30-60 minutes with new word counts ranging from 10-25 a day depending on the rest of what’s going on in my life. Currently have it set to 15/day for Spanish and 15/day for Portuguese, which is a little over 5,000 new words per year for both. In addition, I bought a simple workbook + a much more in depth, large grammar reference textbook. I worked through the workbook over a few months and now just glance at my reference whenever I want a refresh or need to specify something. All the while, I switched my life to Spanish. All shows, podcasts, music & other media was Spanish. I got on language exchange apps to constantly text and call people in Spanish. It was basically a combination of active recall + input. I’ll always lean heaviest on active recall (anki) + interactions with native speakers, though. You learn so many real usages of the language that you just cannot get otherwise. Textbooks are great starting points, though.\n\nedit*\nThis post is what I did to reach fluency in Spanish. I’m still working on my portuguese, but following the same path with extremely strong results. Obviously the Spanish foundation helps, but I’m holding extended conversations with Brazilians & generally able to understand every day media, music etc after something like 6 weeks of intense study. Intense meaning 2~ hours of active daily study and another 3~ of input + interaction.", "created_utc": "1659690192.0", "edited": "False", "id": "ij151dq", "is_submitter": "False", "link_id": "t3_wgp4uz", "parent_id": "t3_wgp4uz", "score": "22", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "arrozcongandul", "body": "you touched upon it with your post: the grind. after getting through one language and started with another, you know what it takes. and for as much as you want to firehose blast your brain with the language, there’s just literally so much you can do. Portuguese feels so similar to spanish to me that it’s almost frustrating not just being fluent with the snap of my fingers. I’m piling on the Anki study and spending hours talking with Brazilians and watching content but I feel like mentally I’m ahead of where my brain actually is. A lot of times I can intuit my way through things thanks to Spanish. And a lot of times I can comprehend a lot of the native material I’m watching. Reading has been the easiest by far since day one. But occasionally I’ll run into someone with an unfamiliar accent, or I just can’t catch what they’re saying, and it’s like I’m brought back to the reality of just being a learner. I know in a year it’ll be smoothed out, but it’s frustrating for now.", "created_utc": "1659689769.0", "edited": "False", "id": "ij14irb", "is_submitter": "False", "link_id": "t3_wgnowj", "parent_id": "t3_wgnowj", "score": "9", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "arrozcongandul", "body": "are you saying you study 18 hours a day five days a week, or 18 hours dispersed over a five day week? signficant difference there and if it's the former, what the fuck?", "created_utc": "1659681193.0", "edited": "False", "id": "ij0tmeu", "is_submitter": "False", "link_id": "t3_wfvy4e", "parent_id": "t1_iiw736n", "score": "1", "subreddit": "GetStudying", "subreddit_id": "t5_2tl44"}, {"author": "arrozcongandul", "body": "There's definitely neurological truth to this. Every time you recall something, you're strengthening the specific neural pathways related to it, and when you learn new related information, that's expanding the dendritic system which is like a web of chains. IE you learn an infinitive form of a verb, then you see it conjugated in a future tense, then you see it used as an adjective, etc. The more this additional information is compounded, the stronger the web gets. That's why it's so crucial to use active recall and interleaving within language learning. Anki and spontaneous conversations with natives over a wide range of topics can do wonders for forcing your memory to work to strengthen those neural connections. \n\nI find this very applicable to learning portuguese. So much looked so familiar that once past the phonological differences, it simply felt like tacking on to my Spanish. Almost reinforcing the portuguese that much faster because I had direct connections to make with another language I already speak fluently.", "created_utc": "1659664057.0", "edited": "False", "id": "iizyr5o", "is_submitter": "False", "link_id": "t3_wg9y2w", "parent_id": "t1_iizj7b7", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "arrozcongandul", "body": "\"And english everywhere else\" isn't entirely true. The norm is to speak Spanish in Spanish speaking environments, and a lot of people growing up in major metropolitan areas in the US have plenty of those. Grocery stores, restaurants, bodegas, cultural centers, block parties, etc. There's a lot of socialization going on within the latin community apart from speaking with parents at home. I grew up with the feeling that it's impolite to speak (especially to older) spanish-as-first-language speakers in English, even if they were by all accounts fluent in English. It was just a sort of unspoken formality.", "created_utc": "1659663435.0", "edited": "False", "id": "iizxc15", "is_submitter": "False", "link_id": "t3_wfzwxt", "parent_id": "t1_iizfa9n", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}]