[{"author": "ArtLangues", "body": "I say this with love, not out of annoyance - please continue working on yourself and try bettering yourself in therapy if you haven't yet. I went to your post history, and you really need to get off of social media because this looks *extremely* unhealthy. You are obsessively posting about the same small things that do not matter, spamming things and breaking sub rules in multiple places, and overall let people live in your head rent-free. You are self-conscious about your race as well, it seems, and push very generalized racial views in a place where that is obviously not acceptable.\n\nDue to your obsession, I don't think you are a troll. I think you're a very lost and misguided person who needs to take a break off of social media and get real mental help.", "created_utc": "1666775302.0", "edited": "False", "id": "itu1b7l", "is_submitter": "False", "link_id": "t3_ydlwuz", "parent_id": "t3_ydlwuz", "score": "1", "subreddit": "hapas", "subreddit_id": "t5_33rcf"}, {"author": "ArtLangues", "body": "As long as you have a high school diploma with its accompanying transcripts, there's no problem. Colleges don't really care about anything before high school, and your transcript may sometimes include standardized test scores from middle school (which was the case for me). Many people even skip whole grades in high school with no problems.\n\nEdit: Also, I don't think there's any way they'd know that hahah", "created_utc": "1666585680.0", "edited": "False", "id": "itjvgaz", "is_submitter": "False", "link_id": "t3_yc1vqo", "parent_id": "t3_yc1vqo", "score": "5", "subreddit": "college", "subreddit_id": "t5_2qh3z"}, {"author": "ArtLangues", "body": "Yes, \"We are never racist, we don't even know what race is, that's just an American thing\" is a tall statement from the continent that gave us the Nazis...\n\nFor my race specifically, I felt the safest in Portugal, Spain, Italy, Greece, Switzerland, and Germany. My theory for the first four is that I blend in with the locals (I can sometimes pass for a white person with tan skin). Either that or they just happened to be nicer in general, as Southern European hospitality is a thing. As for Germany and Switzerland, there were a *lot* of Asians there, so I didn't feel that I stuck out in any way, and the locals were probably more used to us.", "created_utc": "1666538677.0", "edited": "False", "id": "itgt0q8", "is_submitter": "False", "link_id": "t3_y8nds3", "parent_id": "t1_itfxfw0", "score": "3", "subreddit": "hapas", "subreddit_id": "t5_33rcf"}, {"author": "ArtLangues", "body": "Lived in the US and France. The average French person is so much more racist than the average American, it's extremely concerning. At best, they don't know that mixed-race Asians exist (because they think all mixed-race people are half-black, half-white) and at worst they will call you horrid things to your face. I never understood the whole \"racism is an American thing\" because I have lived in one of the reddest states and somehow still was treated better than in France.\n\nThe rest of Europe has been alright. (been to nearly 15 countries here) I only got one racist incident in Czechia.", "created_utc": "1666507165.0", "edited": "False", "id": "itfg8h7", "is_submitter": "False", "link_id": "t3_y8nds3", "parent_id": "t3_y8nds3", "score": "5", "subreddit": "hapas", "subreddit_id": "t5_33rcf"}, {"author": "ArtLangues", "body": "Might be going against the grain here, but not really. Mixed race people, especially hapa women, were seen as among the most attractive in my circles.", "created_utc": "1666506791.0", "edited": "False", "id": "itffrnx", "is_submitter": "False", "link_id": "t3_y9lz4j", "parent_id": "t3_y9lz4j", "score": "1", "subreddit": "hapas", "subreddit_id": "t5_33rcf"}, {"author": "ArtLangues", "body": "I go to university in France, which requires a solid C1 (supposedly, according to the program). That being said, there are \"off\" days where I don't understand absolute jack from certain groups, either people with thick Alsatian accents (or other regional ones), young people speaking quickly with a lot of slang, or people speaking too quietly. Then sometimes they get mad or upset when I don't immediately understand, which makes my brain turn off even more out of stress.", "created_utc": "1666502466.0", "edited": "False", "id": "itfa31q", "is_submitter": "False", "link_id": "t3_yazrtm", "parent_id": "t3_yazrtm", "score": "4", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "ArtLangues", "body": ">I’m 5’7 and dating a girl who is 5’2. She likes being really submissive and loves feeling small. She seems pretty satisfied since I’m pretty muscular, but obviously my height isn’t the greatest. She said she doesn’t really care.\n\nYou're telling me this isn't you? Come on man 🤣 It uses the exact same \"small and submissive\" language, and it's a 5'7 guy who describes himself as muscular. There is time to save this.", "created_utc": "1665626792.0", "edited": "False", "id": "is3rco2", "is_submitter": "False", "link_id": "t3_y2jimc", "parent_id": "t1_is3qq10", "score": "0", "subreddit": "relationships", "subreddit_id": "t5_2qjvn"}, {"author": "ArtLangues", "body": "I'm confused. [This is you, right?](https://www.reddit.com/r/relationships/comments/wcrlpy/insecure_about_my_hand_size_in_relationship_m22/) She already said she doesn't really care. This is not a roast but an honest opinion, I really think you need to go get therapy to manage your major insecurities if you feel so emasculated all the time that even your hand size makes you feel bad.\n\nAlso, why did you change your ages?", "created_utc": "1665626457.0", "edited": "False", "id": "is3qlg3", "is_submitter": "False", "link_id": "t3_y2jimc", "parent_id": "t3_y2jimc", "score": "0", "subreddit": "relationships", "subreddit_id": "t5_2qjvn"}, {"author": "ArtLangues", "body": "[They are blatantly anti-miscegenation.](https://www.reddit.com/r/aznidentity/comments/v6ni6j/am_i_the_only_asian_guy_who_doesnt_support_amwf/) I saw that anti-race mixing thread when it was posted and was shocked at how the sub hasn't been banned for hate yet.", "created_utc": "1665268843.0", "edited": "False", "id": "irkdmxc", "is_submitter": "False", "link_id": "t3_xypw9y", "parent_id": "t3_xypw9y", "score": "6", "subreddit": "mixedrace", "subreddit_id": "t5_2qnue"}, {"author": "ArtLangues", "body": "You're disgusting. Go to therapy.", "created_utc": "1665134819.0", "edited": "False", "id": "irdwwwv", "is_submitter": "False", "link_id": "t3_xxpkms", "parent_id": "t1_irddvw0", "score": "2", "subreddit": "relationships", "subreddit_id": "t5_2qjvn"}, {"author": "ArtLangues", "body": "I'm confused, are we talking about kink or general relationship behavior? Because if it's the latter, the 1920s called, they want their dynamic back.", "created_utc": "1664735377.0", "edited": "False", "id": "iqs66qn", "is_submitter": "False", "link_id": "t3_xtlffh", "parent_id": "t3_xtlffh", "score": "2", "subreddit": "relationships", "subreddit_id": "t5_2qjvn"}, {"author": "ArtLangues", "body": "In your post, you're concerned over Auckland crime, but casually overlooking the potential threat of being murdered in cold blood just for going to school, the mall, or the grocery store in the US for... what reason again? Sorry?\n\nYou also complain about cost of living but you want to move to LA, NYC and Chicago. I actually laughed at this part. Hope you like paying elevated rent for gentrification while simultaneously paying out the ass for healthcare and insurance because we don't have NZ's social system.\n\nNot even going to touch the part about how the US is supposedly more accepting of atheists and women. No clue where you got that info.\n\nAlso, if you're afraid of Russians meddling in your politics, I have some very bad news for you about the US.\n\nThis is harsh, but you've been watching too much TV. Listen to the commenters.", "created_utc": "1664636544.0", "edited": "False", "id": "iqmqoap", "is_submitter": "False", "link_id": "t3_xsbph5", "parent_id": "t3_xsbph5", "score": "18", "subreddit": "IWantOut", "subreddit_id": "t5_2r5hw"}, {"author": "ArtLangues", "body": "Why is it that many \"Disney Adults\" seem to be like this? Out of many similar cases in my circle, I know of one who spent easily 2/3rds of her income on Disneyland trips and buying Disney shit and never managed to move out of her parents' house because of it. \n\nOf course quitting your job for Disney is a stupid idea. Sorry you married a 5 y/o child.", "created_utc": "1664628461.0", "edited": "False", "id": "iqm9vd2", "is_submitter": "False", "link_id": "t3_xstfjx", "parent_id": "t3_xstfjx", "score": "5", "subreddit": "relationship_advice", "subreddit_id": "t5_2r0cn"}, {"author": "ArtLangues", "body": "The question you posted is a total non-issue and I'm a bit confused on why that's the part we're focusing on. It costs nothing to say he's just a friend of yours and I'm sure you figured that out already. Nobody is dying to know the intimate details of what you do in bed with him like you seem to think they do. I traveled with a male friend at 18 and nobody questioned it because it's the 2020s and men and women can be friends.\n\nAlso, why is your self-esteem so low that you would stay with a guy who, in your own words, \"downgraded\" you? He wants relationship benefits without actually caring about the person he gets them from. There are several issues here that are more important than what you're focusing on...\n\nNow for the important part - do you actually know this new guy? You said he's some guy who responded to your post online, so I assume not. Don't end up on Dateline. Seriously.", "created_utc": "1664600358.0", "edited": "False", "id": "iqla9n8", "is_submitter": "False", "link_id": "t3_xsj8xu", "parent_id": "t3_xsj8xu", "score": "77", "subreddit": "relationships", "subreddit_id": "t5_2qjvn"}, {"author": "ArtLangues", "body": "This subreddit makes me want to stay single for life. Take the trash out to the dumpster, OP.", "created_utc": "1664535289.0", "edited": "False", "id": "iqhfii8", "is_submitter": "False", "link_id": "t3_xrspqf", "parent_id": "t3_xrspqf", "score": "1", "subreddit": "relationships", "subreddit_id": "t5_2qjvn"}, {"author": "ArtLangues", "body": "I got a 2.5/100 on an exam because the professor was a power-tripping POS and the answers were *correct* but \"not how he would've worded them\" in his own words. It was a humanities exam where you had to write the answers to different historical/cultural/demographic questions.", "created_utc": "1664365810.0", "edited": "False", "id": "iq82yur", "is_submitter": "False", "link_id": "t3_xpmfjb", "parent_id": "t3_xpmfjb", "score": "1", "subreddit": "college", "subreddit_id": "t5_2qh3z"}, {"author": "ArtLangues", "body": "Don't listen to them, I've been stalking this subreddit for more than half a decade and one trend that's never changed over the years is that many (obligatory not all) \"polys\" on here tend to get really defensive over very small things lol", "created_utc": "1664292070.0", "edited": "False", "id": "iq43na6", "is_submitter": "False", "link_id": "t3_xpeh7r", "parent_id": "t1_iq3pipp", "score": "0", "subreddit": "relationships", "subreddit_id": "t5_2qjvn"}, {"author": "ArtLangues", "body": "Where are you in Europe? I'm an American enrolled at uni in France full-time, and France actually has a year *less* of high school than us, but still only a 3-year bachelor's...?", "created_utc": "1664052140.0", "edited": "False", "id": "iprdm0h", "is_submitter": "False", "link_id": "t3_xmyqaz", "parent_id": "t1_ipqnzdc", "score": "2", "subreddit": "college", "subreddit_id": "t5_2qh3z"}, {"author": "ArtLangues", "body": "Thank you so much for bringing up the working holiday program, I found 2 of the very few options that look financially feasible for me after some research (New Zealand and South Korea). I might do a separate thread to try to decide between those two countries.", "created_utc": "1663897512.0", "edited": "False", "id": "ipjqr7j", "is_submitter": "True", "link_id": "t3_xkmgxy", "parent_id": "t1_ipjb5xw", "score": "1", "subreddit": "IWantOut", "subreddit_id": "t5_2r5hw"}, {"author": "ArtLangues", "body": "Thank you so much, it's great to have someone who can personally attest to the country's situation. I was planning on going to Chile when I was 14 years old for uni as I found the country to be quite interesting and very developed for South America (contrary to what the media in the US shows) in terms of numbers, but found it easier to get to France logistically.\n\nSince I love traveling and do so many times a year, I can see why it would be isolating to be in Uruguay.\n\nWhat do you think about the protests in Chile? I've been hearing about that on and off for some years and I can't quite tell if it is an actual danger to anyone or if it's just like what we have in France (people protesting on the street pretty much every week, except for random miscellaneous reasons unlike in Chile)", "created_utc": "1663842687.0", "edited": "False", "id": "ipg8tl1", "is_submitter": "True", "link_id": "t3_xkmgxy", "parent_id": "t1_ipfpiwb", "score": "3", "subreddit": "IWantOut", "subreddit_id": "t5_2r5hw"}, {"author": "ArtLangues", "body": "Had the books and the movie. (had them at age 8, currently age 19) It was definitely not bummer for me", "created_utc": "1663364750.0", "edited": "False", "id": "iopym4d", "is_submitter": "False", "link_id": "t3_xfacss", "parent_id": "t3_xfacss", "score": "2", "subreddit": "MandelaEffect", "subreddit_id": "t5_2zejk"}, {"author": "ArtLangues", "body": "I was pissed off just by reading your post, can't imagine how insufferable you are in person.", "created_utc": "1663187161.0", "edited": "False", "id": "iofyea1", "is_submitter": "False", "link_id": "t3_xe95w5", "parent_id": "t3_xe95w5", "score": "1", "subreddit": "relationships", "subreddit_id": "t5_2qjvn"}, {"author": "ArtLangues", "body": "I live in France and have a similar issue. A lot of people here don't seem to... get the existence of non-black mixed-race people? Like, they're used to people being half-black and half-white here, but not any other combination, in my case half-Euro and half SEA. They also seem to work on a one-drop concept where if you are part non-Euro, it \"destroys\" all the Euro genes so you no longer have them and are 100% your other race.\n\nFurthermore, they seem to think all Americans are blond with blue eyes, and it throws their entire world upside down when they meet one that's not...? I once lived in a US state that is well-known for its racism (rightfully so), but I think people's behavior here is far more bizarre.", "created_utc": "1663120700.0", "edited": "False", "id": "ioc9vvl", "is_submitter": "False", "link_id": "t3_xb3n2q", "parent_id": "t3_xb3n2q", "score": "1", "subreddit": "mixedrace", "subreddit_id": "t5_2qnue"}, {"author": "ArtLangues", "body": "I get what you're saying here and don't think you're fully wrong but the same logic could be applied to every single post on this sub, even to the subreddit's whole existence. Maybe keep on browsing elsewhere?", "created_utc": "1662420721.0", "edited": "False", "id": "in8whn8", "is_submitter": "False", "link_id": "t3_x6tyuk", "parent_id": "t1_in8tav3", "score": "6", "subreddit": "relationships", "subreddit_id": "t5_2qjvn"}, {"author": "ArtLangues", "body": "Not sure why this is being downvoted. My mother (Pinay) was born and raised in California and is as local as any American-born patriot. I wouldn't consider her marrying a white guy to be the same as being a mail bride. I don't post here often but this sub is kind of depressing sometimes.", "created_utc": "1662117519.0", "edited": "False", "id": "ims6gp7", "is_submitter": "False", "link_id": "t3_x3pi11", "parent_id": "t1_imrj3ux", "score": "14", "subreddit": "hapas", "subreddit_id": "t5_33rcf"}, {"author": "ArtLangues", "body": "Um... so... what do you see in this guy exactly? Like, what could possibly be so redeeming about him...? Genuine question? Is the sex *that* good?", "created_utc": "1662036468.0", "edited": "False", "id": "imnivdt", "is_submitter": "False", "link_id": "t3_x2wuit", "parent_id": "t3_x2wuit", "score": "2", "subreddit": "relationships", "subreddit_id": "t5_2qjvn"}, {"author": "ArtLangues", "body": "NTA. American living in France here, this behavior is somewhat typical among lots of Europeans of different nationalities I've met while traveling and unfortunately there is no way to put a stop to it other than telling them they're being dicks. I escaped the US because of a massive incompatibility between myself and its politics, so I understand the need to criticize it fully, but trying to jerk yourself off in front of an American to feel better about yourself just isn't the proper way to go about it.\n\nAlso, side note - I've been to 13 European countries, and the \"portion size\" thing is something I have never understood in my life. Half the countries I've been to have served me easily bigger portions than the average place I've been to in the States. I genuinely don't know if the people who say this aren't very well-traveled or if they're specifically not paying attention to portion sizes until they visit the US, leading to a self-fulfilling theory. I even waited until my trip back to the US to see if they were right and they were not...?", "created_utc": "1660969933.0", "edited": "False", "id": "il12k4v", "is_submitter": "False", "link_id": "t3_wsjbku", "parent_id": "t3_wsjbku", "score": "8", "subreddit": "AmItheAsshole", "subreddit_id": "t5_2xhvq"}, {"author": "ArtLangues", "body": "Ehh... I mean, I could read full books before I started grade school, and I don't think that's a particularly unique experience either. On the other hand, whoever said structured learning is inefficient is partially wrong, as it varies depending on the person. As some other commenters pointed out, home is where it starts. You can become literate by going to school sure, but the actual language learning happens at home years beforehand.", "created_utc": "1660330679.0", "edited": "False", "id": "ik15eqd", "is_submitter": "False", "link_id": "t3_wm045t", "parent_id": "t3_wm045t", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "ArtLangues", "body": "Right?? I gagged when I read that and then went right to the comments.", "created_utc": "1656628131.0", "edited": "False", "id": "iedmup6", "is_submitter": "False", "link_id": "t3_vohstf", "parent_id": "t1_ied3h1p", "score": "36", "subreddit": "relationships", "subreddit_id": "t5_2qjvn"}, {"author": "ArtLangues", "body": "Best reactions: Italians, they absolutely adore it. All age groups from young to old have had overwhelmingly positive reactions. I was once at a restaurant in Milan, super nervous while ordering, and the owner came up to me while I was eating, put her hand on my shoulder, and told me not to be so nervous.\n\nWorst reactions: The French. God, the French. I live in France, they act like you're wasting their time if you have C2-level vocabulary but a foreign accent. They deserve every stereotype made about them.\n\nLatinos get the runners-up award for \"worst reaction\" with Spanish because while many of them are alright, others think if you're American you shouldn't be allowed to speak their language.", "created_utc": "1655512343.0", "edited": "False", "id": "ics2lv0", "is_submitter": "False", "link_id": "t3_ve2lv1", "parent_id": "t3_ve2lv1", "score": "4", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "ArtLangues", "body": "This exact thing happens to me too, but it's because I've run out of \"battery\" (introvert) and my brain no longer has the capacity to continue holding my face muscles in place physically after laughing/smiling a lot, so my face goes blank. It also reflects in my conversation skills because I can no longer muster up anything to say other than (usually short) responses. This can happen in the middle of a hangout if I've already talked to too many people during the day or if I've been unusually hyper, or if something has been done in a group setting that takes more energy than usual.\n\nI don't know your friend, but they might just be like me and have a certain limit as to how much they can interact sometimes and their brain will shut them down.", "created_utc": "1655024413.0", "edited": "False", "id": "ic2hymv", "is_submitter": "False", "link_id": "t3_vadxs0", "parent_id": "t3_vadxs0", "score": "1", "subreddit": "relationships", "subreddit_id": "t5_2qjvn"}, {"author": "ArtLangues", "body": "I investigated someone's answer and it is Chuukese, a Micronesian language. Thanks anyway!", "created_utc": "1654778229.0", "edited": "False", "id": "ibq3y7f", "is_submitter": "True", "link_id": "t3_v8aa4u", "parent_id": "t1_ibq3hpx", "score": "4", "subreddit": "language", "subreddit_id": "t5_2qlfj"}, {"author": "ArtLangues", "body": "That's interesting. Thanks!", "created_utc": "1654759949.0", "edited": "False", "id": "ibph9ke", "is_submitter": "True", "link_id": "t3_v8aa4u", "parent_id": "t1_ibpgqgs", "score": "3", "subreddit": "language", "subreddit_id": "t5_2qlfj"}, {"author": "ArtLangues", "body": "Nope, I learned Hawaiian in school and most of these letters/words don't feature in the language. Anyone else?", "created_utc": "1654758500.0", "edited": "False", "id": "ibpfn5v", "is_submitter": "True", "link_id": "t3_v8aa4u", "parent_id": "t1_ibpdij0", "score": "8", "subreddit": "language", "subreddit_id": "t5_2qlfj"}, {"author": "ArtLangues", "body": "Normally I would agree for the rest of HI, but I have one exception: Puna. Especially the haole kids. Very few natural-colored teens in my class growing up, those with natural hair were usually natives. They often dyed it either red/pink/blond, while those with naturally lighter hair went with blue/green, which totally shocked me once I traveled and saw that having strange colors for hair isn't the norm for all teens.", "created_utc": "1654517160.0", "edited": "False", "id": "ibcw4fa", "is_submitter": "False", "link_id": "t3_v5t9tt", "parent_id": "t1_ibc1d5l", "score": "5", "subreddit": "Hawaii", "subreddit_id": "t5_2qi3u"}, {"author": "ArtLangues", "body": "Rural Big Islander here. Since we didn't have the sheer abundance of stuff to do like people in Honolulu, we usually loitered at Target, Walmart, or the local 7-11 parking lot.", "created_utc": "1654516654.0", "edited": "False", "id": "ibcvcn3", "is_submitter": "False", "link_id": "t3_v5t9tt", "parent_id": "t3_v5t9tt", "score": "5", "subreddit": "Hawaii", "subreddit_id": "t5_2qi3u"}, {"author": "ArtLangues", "body": "Right? The comments on these posts are horrifying. \"This has always happened, it's just getting reported on more\" Oh yeah, that makes it a lot better, doesn't it? 🙄🙄 \"It's just gang violence, only difference is they have guns, no big deal\" Funny because no other developed nation with similar crime levels in urban areas has this same problem.\n\nPost news that happens to involve guns in r/news and you'll get a hoard of people accusing you of pushing the Democrat agenda.", "created_utc": "1654496406.0", "edited": "False", "id": "ibc7wsq", "is_submitter": "False", "link_id": "t3_v57wvd", "parent_id": "t1_ibb0rcq", "score": "1", "subreddit": "news", "subreddit_id": "t5_2qh3l"}, {"author": "ArtLangues", "body": "Exactly! Some of the whataboutism in these comments is shocking. \"Doyyyy what about the gangs\" like we can only pick one thing to fix and nothing else, we have to choose...", "created_utc": "1654495384.0", "edited": "False", "id": "ibc6ph6", "is_submitter": "False", "link_id": "t3_v5klxk", "parent_id": "t1_ibbshtv", "score": "17", "subreddit": "news", "subreddit_id": "t5_2qh3l"}, {"author": "ArtLangues", "body": "Imagine posting news on r/news. Obviously a hidden Democrat agenda /s", "created_utc": "1654495068.0", "edited": "False", "id": "ibc6bhz", "is_submitter": "False", "link_id": "t3_v5klxk", "parent_id": "t1_ibaq0i0", "score": "1", "subreddit": "news", "subreddit_id": "t5_2qh3l"}, {"author": "ArtLangues", "body": "I was raised in Hawaii up until age 18 (live in France now) and I have a question - how on Earth do you speak Hawaiian fluently? I remember they tried teaching it to us throughout elementary school and nobody I knew retained anything...", "created_utc": "1654391763.0", "edited": "False", "id": "ib7dkhw", "is_submitter": "False", "link_id": "t3_uppzjs", "parent_id": "t3_uppzjs", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "ArtLangues", "body": "Anyone else think this was really patronizing or just me?\n\nGuess since it's on LLJ, probably not.", "created_utc": "1654382262.0", "edited": "False", "id": "ib6wbyc", "is_submitter": "False", "link_id": "t3_v3wyso", "parent_id": "t3_v3wyso", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "ArtLangues", "body": "Ah merde j'aurais dû savoir que t'étais de l'Alsace vu tes opinions bizarres ptdr", "created_utc": "1654022226.0", "edited": "False", "id": "iaoyxzi", "is_submitter": "False", "link_id": "t3_v1cuat", "parent_id": "t1_ian6juj", "score": "1", "subreddit": "relationships", "subreddit_id": "t5_2qjvn"}, {"author": "ArtLangues", "body": "Wow, your post history is a ride my dude", "created_utc": "1653963631.0", "edited": "False", "id": "iam7naq", "is_submitter": "False", "link_id": "t3_v1cuat", "parent_id": "t1_ialwhv8", "score": "6", "subreddit": "relationships", "subreddit_id": "t5_2qjvn"}, {"author": "ArtLangues", "body": "Android here, also getting the old posts bug. Everything on my \"new posts\" feed is from 2-3 weeks ago", "created_utc": "1653586168.0", "edited": "False", "id": "ia393dq", "is_submitter": "False", "link_id": "t3_uybbu3", "parent_id": "t3_uybbu3", "score": "1", "subreddit": "Instagram", "subreddit_id": "t5_2seh9"}, {"author": "ArtLangues", "body": ">Also, wander too far off the beaten path in Hawaii and you start to feel pretty unwelcome.\n\nJust curious, which island? I can think of a million places on the Big Island where you would run into trouble by being outside of the tourist zones.", "created_utc": "1653092637.0", "edited": "False", "id": "i9e8d6l", "is_submitter": "False", "link_id": "t3_uqmwkz", "parent_id": "t1_i8u781q", "score": "5", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "ArtLangues", "body": "Sorry, I'm not entirely sure how those feelings came about considering I said \"Not saying it's incorrect or you're lying\" to make sure my message wasn't perceived as interrogating. :/ Having grown in the very cultural environment you're talking about (Hawaii) with 2 decades of experience of being called \"hapa\" by hundreds of native Hawaiians themselves which could potentially throw a dent in the initial sentiment, you can surely understand why I was confused by what you said, but no malice was intended. Unfortunately, I can't really take responsibility for my (honestly) straightforward comment being misread, but I apologize if you felt that way.\n\nNow, on to the actual content- thank you for providing sources. Again, this is a first, as I was constantly called \"hapa\" or \"hapa-haole\" by native Hawaiians growing up who were fully aware of my ethnic background; but I will also say that being politically correct was not popular where I'm from, especially not among the native kanaka maoli crowd who generally had a laidback, very no-prisoners-taken islander sense of humor, so that may be a cause of this issue flying under the radar. \n\nUltimately, I will refrain from speaking on the natives' behalf on whether or not this issue is correct or legitimate, because for those 3 kanaka who have a problem with it, I know hundreds more who don't and spread this usage around. At this point it's not up to us to say, but rather, the native community.", "created_utc": "1653008754.0", "edited": "False", "id": "i99tcsu", "is_submitter": "False", "link_id": "t3_uqw71q", "parent_id": "t1_i99qkkd", "score": "0", "subreddit": "mixedrace", "subreddit_id": "t5_2qnue"}, {"author": "ArtLangues", "body": "Do you know if these people were actually Hawaiian, or white keyboard saviors? Because this does not match the opinions of thousands of actual Native Hawaiian people I grew up with. Not saying it's incorrect or that you're lying, but it seems very fishy to me and I have seen similar comments from white people attempting to define what is and isn't offensive on behalf of minorities who do not share their opinion.", "created_utc": "1653006833.0", "edited": "False", "id": "i99piex", "is_submitter": "False", "link_id": "t3_uqw71q", "parent_id": "t1_i99le6o", "score": "1", "subreddit": "mixedrace", "subreddit_id": "t5_2qnue"}, {"author": "ArtLangues", "body": "I'm from Hawaii (Filipino/Italian mix, same as you!) and I've never heard of this. Where did you hear that? In my circles growing up it was always the kanaka themselves using the word \"hapa\" or \"hapa-haole\" for us half-Asians.", "created_utc": "1653000108.0", "edited": "False", "id": "i99c7ad", "is_submitter": "False", "link_id": "t3_uqw71q", "parent_id": "t1_i8wog4a", "score": "2", "subreddit": "mixedrace", "subreddit_id": "t5_2qnue"}, {"author": "ArtLangues", "body": "Just curious, what sub is this? He tends to hang out in my small town and I don't want to run into him when I visit soon.", "created_utc": "1651500677.0", "edited": "False", "id": "i712w5q", "is_submitter": "False", "link_id": "t3_u7g6gi", "parent_id": "t1_i5gulwo", "score": "3", "subreddit": "Deuxmoi", "subreddit_id": "t5_2rqcm8"}, {"author": "ArtLangues", "body": "Jenna Maroney? Is that you?", "created_utc": "1651011373.0", "edited": "False", "id": "i6bpc7s", "is_submitter": "False", "link_id": "t3_ubzulz", "parent_id": "t1_i69mqut", "score": "4", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "ArtLangues", "body": "It's not all or even most of \"the people\", it's the ones you find online. I have very bad experiences with South Americans online (I speak Spanish) but I don't think it's an inherent problem with its people or the countries. Sounds like something personal that you need to work on before taking it out on other commenters.", "created_utc": "1650086419.0", "edited": "False", "id": "i4xba2k", "is_submitter": "False", "link_id": "t3_u4p8jv", "parent_id": "t1_i4xatks", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "ArtLangues", "body": "Glad you deleted your thread because it seems you may hold some bias towards comments from people from a certain country, which is odd considering you made a whole thread *about* them, like that wasn't going to attract people from that specific demographic.", "created_utc": "1650086177.0", "edited": "False", "id": "i4xawv6", "is_submitter": "False", "link_id": "t3_u4p8jv", "parent_id": "t1_i4xald4", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "ArtLangues", "body": "I got either 2 meanings from that:\n\n1. It's funny because Brazilian PT also has a lot of variety, as it's a large country like the US.\n2. He might prefer the EU-PT dialect, which essentially makes his opinion similar to yours (that he doesn't like certain accents) and therefore you would be *incredibly hypocritical* to get mad at him for that.", "created_utc": "1650085851.0", "edited": "False", "id": "i4xaf19", "is_submitter": "False", "link_id": "t3_u4p8jv", "parent_id": "t1_i4x9pil", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "ArtLangues", "body": "I'm not the one you're responding to, but I found your original thread quite harmless *until I saw your comments*. u/xanthic_strath is a very active user on this sub, I see his comments often, and he is far from an \"ignorant American\". Not sure why you felt attacked by what he said.", "created_utc": "1650085219.0", "edited": "False", "id": "i4x9eny", "is_submitter": "False", "link_id": "t3_u4p8jv", "parent_id": "t1_i4x8fzc", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "ArtLangues", "body": "I know you posted this 13 hours ago but your comment smells like updog.", "created_utc": "1649609359.0", "edited": "False", "id": "i46lbwz", "is_submitter": "False", "link_id": "t3_66p4bb", "parent_id": "t1_i44azot", "score": "1", "subreddit": "DIY_eJuice", "subreddit_id": "t5_2u91l"}, {"author": "ArtLangues", "body": "I know this is from 5 years ago but you just saved my skunk, place smells like unwashed buffalo coochie but it worked", "created_utc": "1649374660.0", "edited": "False", "id": "i3twe5g", "is_submitter": "False", "link_id": "t3_66p4bb", "parent_id": "t1_dgke98v", "score": "1", "subreddit": "DIY_eJuice", "subreddit_id": "t5_2u91l"}, {"author": "ArtLangues", "body": "As a solo female studying abroad in France, thanks for this nightmare fuel. 😂\n\nI think I would default to \"vous\" since it might make certain phrases sound less aggressive. Not sure how else to explain it, but yeah...", "created_utc": "1649098291.0", "edited": "False", "id": "i3dy2jb", "is_submitter": "False", "link_id": "t3_tw6ej3", "parent_id": "t3_tw6ej3", "score": "8", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "ArtLangues", "body": "Girl my jaw literally dropped IRL when I saw that age gap, huh??? RUN.", "created_utc": "1649031976.0", "edited": "False", "id": "i3ahlgu", "is_submitter": "False", "link_id": "t3_tvms1k", "parent_id": "t3_tvms1k", "score": "11", "subreddit": "relationships", "subreddit_id": "t5_2qjvn"}, {"author": "ArtLangues", "body": "Yes, they're indeed correct haha. I'm studying in Strasbourg, and I'm in L1 Langues étrangères appliquées :)", "created_utc": "1648079219.0", "edited": "False", "id": "i1v5xbl", "is_submitter": "False", "link_id": "t3_tjxub0", "parent_id": "t1_i1v46x4", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "ArtLangues", "body": "That's great, I'm assuming you were in Honolulu as you said it was for work purposes? I'm from the Big Island and while it has its upsides, it's far too limiting and damaging for young people, so I moved to France and am having the time of my life. Hope you make it back to the islands soon brah", "created_utc": "1648078011.0", "edited": "False", "id": "i1v35jz", "is_submitter": "False", "link_id": "t3_tjxub0", "parent_id": "t1_i1uz96k", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "ArtLangues", "body": "Technically yes, but since the trip was going to be costly (having to fly to North America anyway) no matter where it was, and there was a region where French is the main language, I figured it would be best to go there and get some last-minute immersion.", "created_utc": "1648058665.0", "edited": "False", "id": "i1tptan", "is_submitter": "False", "link_id": "t3_tjxub0", "parent_id": "t1_i1tdvga", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "ArtLangues", "body": "I've done it twice.\n\nHawaii -> Montreal for DELF B2 (22 hours of flying total)\n\nHawaii -> Los Angeles for CILS B1 (11 hours of flying total)\n\nI'm not exactly sure what kind of info you're asking for here, but I would say the overall experience was basically \"shitting myself in case I didn't pass\" because that would be an expensive mistake.", "created_utc": "1648032528.0", "edited": "False", "id": "i1s239c", "is_submitter": "False", "link_id": "t3_tjxub0", "parent_id": "t3_tjxub0", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "ArtLangues", "body": "Glad it worked out!", "created_utc": "1647880368.0", "edited": "False", "id": "i1jqeth", "is_submitter": "False", "link_id": "t3_tgxxag", "parent_id": "t1_i1jcyfo", "score": "2", "subreddit": "duolingo", "subreddit_id": "t5_2t6ze"}, {"author": "ArtLangues", "body": "I don't know if you ever got this fixed but try tweeting at them. Google Play denied my request and I tweeted at Duolingo publicly and managed to get a refund after explaining the situation.", "created_utc": "1647822588.0", "edited": "False", "id": "i1gzw5p", "is_submitter": "False", "link_id": "t3_tgxxag", "parent_id": "t3_tgxxag", "score": "1", "subreddit": "duolingo", "subreddit_id": "t5_2t6ze"}, {"author": "ArtLangues", "body": "Back in 2016 or so we used to have profile walls where we'd talk with users on our own profile page. I don't remember why it was removed but it was quite nice.", "created_utc": "1647821802.0", "edited": "False", "id": "i1gy83y", "is_submitter": "False", "link_id": "t3_tiyhtc", "parent_id": "t3_tiyhtc", "score": "16", "subreddit": "duolingo", "subreddit_id": "t5_2t6ze"}, {"author": "ArtLangues", "body": "Du coup t'as fait LEA ou LLCER ? Moi perso j'suis en LEA et j'ai dû apprendre l'IPA pour mon cours d'italien, ce qui a jamais été le cas pour l'anglais, l'espagnol ou le français aux USA. Je me demande si c'est un truc des facs des langues en France ou si ça dépend aussi de la licence concernée.", "created_utc": "1647474431.0", "edited": "False", "id": "i0yb32d", "is_submitter": "False", "link_id": "t3_te70q0", "parent_id": "t1_i0ohf2x", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "ArtLangues", "body": "Absolutely. I took one for French when I was 16 and Italian when I was 17. The exams I took were \"officially\" for adults but they allowed minors to take them anyway because otherwise they'd be missing out on paying candidates.", "created_utc": "1647473785.0", "edited": "False", "id": "i0y9m4z", "is_submitter": "False", "link_id": "t3_tfao0e", "parent_id": "t3_tfao0e", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "ArtLangues", "body": "Some of the language being used by multiple commenters (\"know your worth\" for literal emojis??) reeks of children watching too many male dating strategy videos.", "created_utc": "1647132303.0", "edited": "False", "id": "i0fpp2y", "is_submitter": "False", "link_id": "t3_tcjkge", "parent_id": "t1_i0fam6h", "score": "5", "subreddit": "Crushes", "subreddit_id": "t5_2udig"}, {"author": "ArtLangues", "body": "I would also distance myself from you with that short temper. Go touch grass, kid", "created_utc": "1647132113.0", "edited": "False", "id": "i0fpbcf", "is_submitter": "False", "link_id": "t3_tcjkge", "parent_id": "t3_tcjkge", "score": "4", "subreddit": "Crushes", "subreddit_id": "t5_2udig"}, {"author": "ArtLangues", "body": "As someone who knows French, I'm laughing so hard at this. They started off sorta sounding official and then got increasingly more aggressive near the end, threatening to distribute your info to the media so your family and friends get to see what you did.", "created_utc": "1646690118.0", "edited": "False", "id": "hzrbsao", "is_submitter": "False", "link_id": "t3_t8onns", "parent_id": "t3_t8onns", "score": "1", "subreddit": "Scams", "subreddit_id": "t5_2qrt0"}, {"author": "ArtLangues", "body": "Technically all of them are \"useless\" for the *average* (not every) American in the sense that you can be employed without ever needing them and your contact with foreigners who don't already speak English is very limited, hence the acquisition of a foreign language isn't stressed a lot. \n\nSo that being said, there's no reason you shouldn't be able to learn German over whatever other language with that metric, if that's what you want.\n\nOn a more global scale, German is more useful than most languages I would say, particularly with employment opportunities. It's not a must, but a plus.", "created_utc": "1646144397.0", "edited": "False", "id": "hywwom6", "is_submitter": "False", "link_id": "t3_t48ess", "parent_id": "t3_t48ess", "score": "19", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "ArtLangues", "body": "So, about that...", "created_utc": "1645749171.0", "edited": "False", "id": "hybf1ki", "is_submitter": "False", "link_id": "t3_sqilk4", "parent_id": "t1_hwoqp12", "score": "3", "subreddit": "TravelNoPics", "subreddit_id": "t5_jktgr"}, {"author": "ArtLangues", "body": "Context: advertisement for a course for the TOEIC exam, a well-known English language level assessment.\n\nIt gets worse the more you look at it. One part of it is in French and the \"University Director\" works for a high school 😭", "created_utc": "1644676462.0", "edited": "False", "id": "hwndlq1", "is_submitter": "True", "link_id": "t3_sqsstg", "parent_id": "t3_sqsstg", "score": "6", "subreddit": "crappyoffbrands", "subreddit_id": "t5_38oju"}, {"author": "ArtLangues", "body": ">I hope your in-laws’ behavior isn’t typical of Americans\n\nExpecting to be downvoted because Reddit, but it's not, don't worry. I learned 3 fluent foreign languages and all my expat friends did the same (with 1-2) in order to fit in with the locals. Some who still live in the US are even learning their partner's native language in order to better communicate with their family. Unfortunately you never hear about us, it's just the idiotic ones that get their fame online.\n\nThat being said, the in-laws in this case are absolutely terrible and most of us would condemn their behavior as seen from this thread. Absolutely inappropriate and I would advise the OP to never give in to the bullying.", "created_utc": "1644664841.0", "edited": "False", "id": "hwmsx3w", "is_submitter": "False", "link_id": "t3_sqilxl", "parent_id": "t1_hwm2yii", "score": "5", "subreddit": "relationships", "subreddit_id": "t5_2qjvn"}, {"author": "ArtLangues", "body": "She doesn't appear to take health seriously and has a problem with doing extremely basic and harmless tasks (*not necessarily* referring to the vax here but just putting a piece of cloth on your face). Ignoring 6 million deaths in the name of being anti-corona makes her the bearer of not-so-ideal traits in a partner. \n\nThere is also the possibility, which I'm not saying is the case but is worth watching out for, that she holds some resentment towards you for proving her incorrect on her corona-hoax stance by actually getting it and didn't feel like getting in a conflict or accusing you of malice.", "created_utc": "1644509393.0", "edited": "False", "id": "hwdrjs8", "is_submitter": "False", "link_id": "t3_sp50os", "parent_id": "t1_hwdqbqp", "score": "12", "subreddit": "Crushes", "subreddit_id": "t5_2udig"}, {"author": "ArtLangues", "body": "I understand you can't control who you crush on but I would run and never look back, this chick is draped in red flags", "created_utc": "1644508590.0", "edited": "False", "id": "hwdpfx6", "is_submitter": "False", "link_id": "t3_sp50os", "parent_id": "t3_sp50os", "score": "12", "subreddit": "Crushes", "subreddit_id": "t5_2udig"}, {"author": "ArtLangues", "body": "I also came here to suggest Caso Cerrado, hilarious show", "created_utc": "1644454368.0", "edited": "False", "id": "hwaxcol", "is_submitter": "False", "link_id": "t3_sojkca", "parent_id": "t1_hw9bmse", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "ArtLangues", "body": "Gracias por la información. El acta de nacimiento es un poco más difícil de recibir, tanto por lo molesto que es el proceso en los EE.UU. como por el hecho de que vivo en el extranjero, así que espero que acepten mi certificado de 2 años en su lugar... lo de la CURP parece un poco complicado, pero la parte de la seguridad social es una buena idea. Gracias.", "created_utc": "1643742252.0", "edited": "False", "id": "hv64e6c", "is_submitter": "True", "link_id": "t3_si1dor", "parent_id": "t1_hv5ydso", "score": "1", "subreddit": "mexico", "subreddit_id": "t5_2qhv7"}, {"author": "ArtLangues", "body": "> Si los necesitas para alguna otra cosa, puedes pedirlos y te los prestan\n\nUyy, estaba preocupada porque los certificados de nacimiento son caros donde nací 😅 y gracias por la información!", "created_utc": "1643741586.0", "edited": "False", "id": "hv62lnx", "is_submitter": "True", "link_id": "t3_si1dor", "parent_id": "t1_hv5yx2f", "score": "2", "subreddit": "mexico", "subreddit_id": "t5_2qhv7"}, {"author": "ArtLangues", "body": "Esta es una respuesta tranquilizadora. Gracias!", "created_utc": "1643741397.0", "edited": "False", "id": "hv6239k", "is_submitter": "True", "link_id": "t3_si1dor", "parent_id": "t1_hv5yghq", "score": "1", "subreddit": "mexico", "subreddit_id": "t5_2qhv7"}, {"author": "ArtLangues", "body": "Ya veo, y es una mala señal que se nieguen a devolverme el original hasta que termine mis estudios? Existe riesgo de fraude de identidad si lo hacen, o es algo raro en México? Gracias", "created_utc": "1643740695.0", "edited": "False", "id": "hv606n6", "is_submitter": "True", "link_id": "t3_si1dor", "parent_id": "t1_hv5wuvj", "score": "-3", "subreddit": "mexico", "subreddit_id": "t5_2qhv7"}, {"author": "ArtLangues", "body": "Nunca me han pedido acta en Francia (donde está mi universidad) y en EEUU sólo la miran y la devuelven inmediatamente después (en lugar de guardarlo durante años) así que sí, esto me resulta extraño y no estaba segura de si era una mala señal.\n\nMi pregunta se refería principalmente a si existe o no un riesgo de fraude de identidad si se guardan mis documentos. Además, sólo tengo una copia de mi acta de nacimiento y si compro otra (Condado de Los Ángeles) tendré que pagar $41 USD ($845.00 pesos), así que esperaba que la devolvieran. 😢", "created_utc": "1643740531.0", "edited": "False", "id": "hv5zqjj", "is_submitter": "True", "link_id": "t3_si1dor", "parent_id": "t1_hv5wkf1", "score": "-1", "subreddit": "mexico", "subreddit_id": "t5_2qhv7"}, {"author": "ArtLangues", "body": "As someone who's lived in Fr\\*nce for 6 months I have no idea either? These people are weird", "created_utc": "1643731594.0", "edited": "False", "id": "hv5b8l9", "is_submitter": "False", "link_id": "t3_sgw9qi", "parent_id": "t3_sgw9qi", "score": "2", "subreddit": "languagelearningjerk", "subreddit_id": "t5_37rt5"}, {"author": "ArtLangues", "body": "As someone who did the opposite of you (moved from Hawaii to Western Europe for university due to quality of life issues) it sounds like you're working based off of a lot of stereotypes and movie ideas, about Hawaii, US college life/culture, etc. I had a long response for you because I'm very well familiar with Italy and was listing several paragraphs (essentially a full essay) on why you should not go to Hawaii and why I made the choice that I did, but I accidentally backspaced.\n\nI invite you to privately message me and we can have a chat.", "created_utc": "1643648240.0", "edited": "False", "id": "hv0i3nd", "is_submitter": "False", "link_id": "t3_sgn0wn", "parent_id": "t3_sgn0wn", "score": "5", "subreddit": "Hawaii", "subreddit_id": "t5_2qi3u"}, {"author": "ArtLangues", "body": ">What do iTalki lessons look like at a high level?\n\nThey're like normal conversations between two friends, but sometimes they will throw more advanced subjects like politics in the mix to see if they can get more out of your dormant vocabulary. They don't often tend to correct pronunciation, but they have told me that it's because I make very few small pronunciation mistakes in the first place, so it would be too nitpicky.\n\n>How do you work on your pronounciation at a high level?\n\nAt a high level, I only really need to do that with French (too complicated compared to ES/IT) and I do it by reading long C1-level texts out loud, sometimes with tutors and sometimes on my own.\n\n>What do you do before, during and after the lesson to maximise the learning effect? Do you take notes and/or record the lessons?\n\nBefore the lesson, I try to warm up by reading a text out loud or watching some videos in the target language to get my mind in the right \"language headspace\". During the lesson, I don't take notes myself, but the teacher writes them in a little box so I can refer to them later, and I don't tend to record the lessons. After the lesson, I read and review the notes, and see how I can incorporate it into a future lesson.\n\n>\\-How long are you counting on taking lessons in French (your strongest language according to other comments)?  \n Are you planing on phasing it out in the near future? Why or why not?\n\nI certainly feel like I will phase it out in the future, as long as I'm living in France, seeing as I have opportunities for immersion everywhere. Once I leave France for my year abroad, however, I will probably go back to doing them so I don't get too rusty in the language until I come back.", "created_utc": "1643550315.0", "edited": "False", "id": "huunfz6", "is_submitter": "True", "link_id": "t3_se9kt5", "parent_id": "t1_huuj2f3", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "ArtLangues", "body": "I hope for a C2 in French and Italian as I have my higher education classes taught entirely in both of these languages, and at least a C1 certificate in Spanish, though I just applied for an online degree taught in Spanish so maybe C2 for that as well!", "created_utc": "1643430541.0", "edited": "False", "id": "huoj23f", "is_submitter": "True", "link_id": "t3_se9kt5", "parent_id": "t1_huog5gb", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "ArtLangues", "body": "No prob! I started iTalki at about a B1 level, so I could have full conversations.", "created_utc": "1643412014.0", "edited": "False", "id": "hunel40", "is_submitter": "True", "link_id": "t3_se9kt5", "parent_id": "t1_hun4y6x", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "ArtLangues", "body": "It's hard for me to remember exactly what I did at the beginning, but when I started learning French and Italian, I did their courses on Duolingo and Memrise, but specifically the ones for Spanish speakers. (so, Spanish -> French, etc) This allowed me to solidify my Spanish without losing proficiency or wasting time that could be used for the other languages. I also use VPN services to access Netflix in any target country. This has been the quickest way for me to learn languages, to the point where I just naturally pick up words as long as I have at least an A1-A2 level. (won't work for everyone)\n\nFor French, I would suggest that you read a *lot*, way more than you would for Spanish or Italian. The words are far more complicated to spell and it's essentially its own skill, while that's not so much the case with Spanish/Italian. Start reading from A0 upwards, preferably with audio going at the same time so you can read along, and please stay away from bridges or otherwise high altitudes when you come across one of the words with 5+ silent letters... (*cough* damn you, voyageaient *cough*)", "created_utc": "1643406317.0", "edited": "False", "id": "hun0jei", "is_submitter": "True", "link_id": "t3_se9kt5", "parent_id": "t1_humjhsm", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "ArtLangues", "body": "If you're from a country where $7-$14 is a lot of money, then I would say conversation practice on iTalki is not worth it. I would recommend finding a language exchange partner who's willing to audio call or video call you, so you still get essentially the same practice, with the small price of doing the same thing back for them. I only buy the lessons because I've had a lot of bad and unreciprocated experiences with language exchange as a native English speaker.", "created_utc": "1643405956.0", "edited": "False", "id": "humzm9c", "is_submitter": "True", "link_id": "t3_se9kt5", "parent_id": "t1_hump359", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "ArtLangues", "body": "As someone coming from the US? The quality of life is way higher, not only are my necessities cheaper but I went to the emergency room for example and, not having insurance or social security, only needed to pay 30 euros ($33). The same visit would've been at least $1000 in my home state. I also appreciate the ability to go everywhere I need to go to within walking distance and have no need for a car.", "created_utc": "1643371519.0", "edited": "False", "id": "hukmfql", "is_submitter": "True", "link_id": "t3_se9kt5", "parent_id": "t1_huj5kao", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "ArtLangues", "body": "For purely progression and brain capacity reasons, I would recommend a B1 minimum if that's where you're at, and *preferably* a B2 in Italian before learning French if you're looking for fast progression. If you're doing it for fun and don't have any specific timeframes in which you want to become adequate in both, then you can technically do whatever you wish, just don't be alarmed if you feel your progression in both languages is slow.", "created_utc": "1643337044.0", "edited": "False", "id": "huj1us1", "is_submitter": "True", "link_id": "t3_se9kt5", "parent_id": "t1_huj15tm", "score": "7", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "ArtLangues", "body": "I go to college in France and it's the same here. You are absolutely not allowed in any of the intro language courses if you know anything above an A1 level max, and the professors are supposed to kick you out if this is the case. Not sure if it's actually enforced, but...", "created_utc": "1643336452.0", "edited": "False", "id": "huj0hmc", "is_submitter": "False", "link_id": "t3_se7fsx", "parent_id": "t1_hui3c3l", "score": "1", "subreddit": "college", "subreddit_id": "t5_2qh3z"}, {"author": "ArtLangues", "body": "Since I mainly do conversational lessons and not so much grammar ones, my considerations are: patience, willingness to point out any errors, general \"click\" (it gets dry sometimes...), and this could be mildly superficial, but accent/dialect, as I tend to mimic that of whoever I talk to and don't want to mix my accent too much.\n\nI've switched quite a lot. I prefer to do every teacher once a week, so if I have, say, 6 lessons a week, I'll have 6 teachers. Sometimes I've dumped them because I didn't feel a lot of enthusiasm on their part (some even checked their phones quite a few times) and one time it was because she was straight-up racist (had some... colorful comments on black people) :')", "created_utc": "1643334623.0", "edited": "False", "id": "huiw924", "is_submitter": "True", "link_id": "t3_se9kt5", "parent_id": "t1_huiiitt", "score": "15", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "ArtLangues", "body": "Since I'm only doing conversational lessons and not full-on tutoring, each 60 minute lesson varies between $7 and $14.", "created_utc": "1643328991.0", "edited": "False", "id": "huiiuwc", "is_submitter": "True", "link_id": "t3_se9kt5", "parent_id": "t1_huifscl", "score": "16", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "ArtLangues", "body": "Thanks for the comment! Seems like an impossible task, but luckily I already knew one of them (Spanish) at a high level (\\~C1) before learning the other 2, and French and Italian are different enough in my brain to be simultaneously distinguishable, so no problems on that front. Only issue, as I said in a comment above, is that at first, I threw some random Spanish words into my Italian conversations on accident because the former was the more dominant language.\n\nI plan on learning German on Italki in the future, but I don't think my level is high enough yet. I prefer to use Italki for conversation practice rather than full-on tutoring due to budget, so it was easy to use for the three languages I already knew quite well, but not so much for one I'm only A1 in.", "created_utc": "1643325444.0", "edited": "False", "id": "huiab93", "is_submitter": "True", "link_id": "t3_se9kt5", "parent_id": "t1_hui8y2z", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "ArtLangues", "body": "Honestly, it hasn't been too horrible. I started with Spanish and didn't start French or Italian until years later, so by that point I already knew it at a C1 level. Unfortunately, my use of Spanish dropped to nearly nothing and has gotten very rusty, so I would consider myself as more of a B2 than C1 now but am rapidly improving since the vocabulary is dormant but still in there.\n\nFrench and Italian were easy to do simultaneously because French is the odd one out of the three. The problems mainly surfaced from Spanish and Italian, because I found myself replacing some Italian words with their closely related Spanish equivalent vocabulary, seeing as Spanish was the stronger language at the time. This problem went away with time once I started using Italian more often, and eventually, my brain had no problems with it.\n\nThe way I've been practicing the three is also different because I live in France and am studying Italian as my major at university. I learn French in an environmental setting, Italian in an educational setting, and Spanish in a home setting, so that's really helped to distinguish between them as well.\n\nFinally, I found that I progressed in French and Italian quickly, both in comprehension and production, due to the fact that they share similar vocabulary, of course. This has not so much been the case with German, which I find to be more difficult post-A1 as the vocabulary is just too different from not only the romance languages but also English.", "created_utc": "1643325152.0", "edited": "False", "id": "hui9lbc", "is_submitter": "True", "link_id": "t3_se9kt5", "parent_id": "t1_huhyk5p", "score": "25", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "ArtLangues", "body": "Learning!", "created_utc": "1643324750.0", "edited": "False", "id": "hui8lgs", "is_submitter": "True", "link_id": "t3_se9kt5", "parent_id": "t1_hui54p8", "score": "7", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "ArtLangues", "body": "Yes, the major caveat to me was the 4 hour train ride between Prague and Vienna... after thinking it through a bit more, I'm thinking of leaving it until the summer when I'll have more days to add. Even if I have 2 other trips going on, I still have a solid 3.5 months of break so I could fit it in if I really still had the energy to. If not, I could break it apart.\n\nThanks!", "created_utc": "1642205829.0", "edited": "False", "id": "hsp8gsx", "is_submitter": "False", "link_id": "t3_s43ht8", "parent_id": "t1_hsp3698", "score": "2", "subreddit": "TravelNoPics", "subreddit_id": "t5_jktgr"}, {"author": "ArtLangues", "body": "Awesome, that's a relief. Plus, if I really like a place, I could always go back. My biggest regret from traveling has been spending too much time in one place. Thanks!", "created_utc": "1642203025.0", "edited": "False", "id": "hsp207t", "is_submitter": "False", "link_id": "t3_s43ht8", "parent_id": "t1_hsoyk5k", "score": "0", "subreddit": "TravelNoPics", "subreddit_id": "t5_jktgr"}, {"author": "ArtLangues", "body": "Ooh alright! I'm American so I assume your Canadian passport might be similar, but it should work the same with both passports as long as you have the EU long-stay visa. The border is fine as long as you're genuinely not doing anything wrong. I've gone through a few checks myself from areas with a lot of illegal immigration, even while traveling solely within the Schengen area, but usually they just confirm that you live in France and look at your visa, and you're fine.", "created_utc": "1642202864.0", "edited": "False", "id": "hsp1mq5", "is_submitter": "False", "link_id": "t3_s195pe", "parent_id": "t1_hsorddd", "score": "1", "subreddit": "solotravel", "subreddit_id": "t5_2rxxm"}, {"author": "ArtLangues", "body": "Hey, just out of curiosity, where are you from? I'm also an 18 year old girl living in France and I'm not an EU citizen either. I've been traveling around Europe during uni breaks since I moved to France and might be able to help with something.", "created_utc": "1642195266.0", "edited": "False", "id": "hsoiu8g", "is_submitter": "False", "link_id": "t3_s195pe", "parent_id": "t1_hs6yggl", "score": "2", "subreddit": "solotravel", "subreddit_id": "t5_2rxxm"}, {"author": "ArtLangues", "body": "I said that despite being fairly certain I canceled my subscription, I was still charged for the year. I did it on Twitter and they responded almost instantly and refunded me the full amount, even after Google themselves refused to do it.", "created_utc": "1641492656.0", "edited": "False", "id": "hrisa6b", "is_submitter": "True", "link_id": "t3_rqkclk", "parent_id": "t1_hrhcoc3", "score": "1", "subreddit": "duolingo", "subreddit_id": "t5_2t6ze"}, {"author": "ArtLangues", "body": "I did just a bit before your comment, and it worked. Definitely recommended to anyone with this issue. Thanks!", "created_utc": "1640712265.0", "edited": "False", "id": "hqasgml", "is_submitter": "True", "link_id": "t3_rqkclk", "parent_id": "t1_hqari5h", "score": "3", "subreddit": "duolingo", "subreddit_id": "t5_2t6ze"}, {"author": "ArtLangues", "body": "I managed to get a refund immediately by tagging Duolingo on Twitter directly with @ duolingo and explaining the situation! How long ago was this charge and, if recent, is it possible you can still try this option?", "created_utc": "1640712220.0", "edited": "False", "id": "hqasck2", "is_submitter": "True", "link_id": "t3_rqkclk", "parent_id": "t1_hqapf86", "score": "6", "subreddit": "duolingo", "subreddit_id": "t5_2t6ze"}, {"author": "ArtLangues", "body": "Demography for med students. I'm a languages major (so not apt for med school stuff) so that was an elective for us humanities students, while at the same time it was an actual common core course for med school students. \n\nGot the final today (worth 100% of our grade) and didn't know if I wanted to laugh or cry when I realized I couldn't answer a single question and, since our exams aren't multiple-choice, I was going to get a 0. Welp.", "created_utc": "1639690968.0", "edited": "False", "id": "hou1m3e", "is_submitter": "False", "link_id": "t3_rhvt6r", "parent_id": "t3_rhvt6r", "score": "1", "subreddit": "college", "subreddit_id": "t5_2qh3z"}, {"author": "ArtLangues", "body": "I started learning it when I was around 15, so I could go to university for free in France rather than go into debt in the US. It all worked out. I learned online, starting with some apps and later transitioned into reading/watching Netflix. Didn't really do anything with Anki or other spacial repetition apps, just kinda picked it up naturally.", "created_utc": "1639646776.0", "edited": "False", "id": "horf863", "is_submitter": "False", "link_id": "t3_rgvcm0", "parent_id": "t1_hor4jx6", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "ArtLangues", "body": "Four. It makes sense when you consider my demographic: American living in France, majoring in Italian at university. Spanish because of a previous relationship. I want to get to at least B2 in German as well. I'm 18 as well, my goal is to achieve this by 21", "created_utc": "1639579768.0", "edited": "False", "id": "hone58s", "is_submitter": "False", "link_id": "t3_rgvcm0", "parent_id": "t3_rgvcm0", "score": "48", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "ArtLangues", "body": "I left Hawaii to move to Europe (France) because the financial quality of life there is absolutely horrid, and don't regret it. Hawaii is the most expensive US state so that should already be enough to eliminate it from your list. You're far away from everything and most people who move there don't have a support system when they inevitably crash and burn after buying into the Hollywood \"dream\" of Hawaii.\n\nThe medical system will run you right out of cash if, God forbid, anything bad happens to you, regardless of the fact that they supposedly have the best healthcare in the US. A friend of mine went to the emergency room and the final cost was somewhere around $2000+, while I only paid $35 for my emergency room visit in Europe, without insurance.\n\nI also left because my European university tuition is $205 a year as opposed to Hawaii, which is known for having overall \"meh\" education for *dozens of thousands* of dollars. Absolute crap deal overall if you're solely looking into medical and financial aspects.", "created_utc": "1638367348.0", "edited": "False", "id": "hmsogxt", "is_submitter": "False", "link_id": "t3_r6d5cs", "parent_id": "t3_r6d5cs", "score": "2", "subreddit": "Hawaii", "subreddit_id": "t5_2qi3u"}, {"author": "ArtLangues", "body": "3 because I live there. Vive l'Alsace", "created_utc": "1638193690.0", "edited": "False", "id": "hmj3px1", "is_submitter": "False", "link_id": "t3_r4rba4", "parent_id": "t3_r4rba4", "score": "1", "subreddit": "ich_iel", "subreddit_id": "t5_37k29"}, {"author": "ArtLangues", "body": "My native language is English, so absolutely not. Imagine...", "created_utc": "1638193213.0", "edited": "False", "id": "hmj2ucp", "is_submitter": "False", "link_id": "t3_r4pdz7", "parent_id": "t3_r4pdz7", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "ArtLangues", "body": "POV: You're trying to find the Y T A comments (aka the absolute undeniable proof of Reddit hating men according to every comment) in the sea of hundreds of NTA votes", "created_utc": "1637856293.0", "edited": "False", "id": "hm1olj0", "is_submitter": "False", "link_id": "t3_r1wj2u", "parent_id": "t3_r1wj2u", "score": "15", "subreddit": "AmItheAsshole", "subreddit_id": "t5_2xhvq"}, {"author": "ArtLangues", "body": "Ex-Hawaiian here. OP, please come to Europe instead, especially with that budget. Knowing the rent and food prices in HI, even in more rural areas, you'll barely scrape by with $1500 USD. Plus, there's so much more to do in the EU and more places to go without getting island fever. Hawaii's okay but I'm so grateful I made it out of there.\n\nMy main suggestion is Portugal but I hear good things about the Netherlands and Germany as well from other expats. I haven't felt unsafe at all as an Asian girl (I live in France, but have traveled to quite a few EU countries)", "created_utc": "1637792724.0", "edited": "False", "id": "hlyj3t2", "is_submitter": "False", "link_id": "t3_r1atvo", "parent_id": "t1_hlyd1pw", "score": "5", "subreddit": "solotravel", "subreddit_id": "t5_2rxxm"}, {"author": "ArtLangues", "body": ">because I'm half filipina and half white, I look very hispanic \n\nSorry for the deviation from the topic, but is this a universal experience or something? I'm half-Pinay and half-white, and been confused for Hispanic (or in more specific cases, Mexican) in multiple countries, including by Mexicans themselves...", "created_utc": "1636975437.0", "edited": "False", "id": "hkpi5al", "is_submitter": "False", "link_id": "t3_qu2o3w", "parent_id": "t3_qu2o3w", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "ArtLangues", "body": "why can tit", "created_utc": "1633422710.0", "edited": "False", "id": "hfghdxl", "is_submitter": "False", "link_id": "t3_q1act3", "parent_id": "t1_hfe0dto", "score": "2", "subreddit": "languagelearningjerk", "subreddit_id": "t5_37rt5"}, {"author": "ArtLangues", "body": "Can confirm as an Am\\*rican I have forgotten every word of Fr\\*nch despite living in Fr\\*nce (but Im ok with it)", "created_utc": "1632903192.0", "edited": "False", "id": "hep6woo", "is_submitter": "False", "link_id": "t3_pxqtkn", "parent_id": "t3_pxqtkn", "score": "1", "subreddit": "languagelearningjerk", "subreddit_id": "t5_37rt5"}, {"author": "ArtLangues", "body": "I'm in the same boat as OP at a French uni. Everyone else in my Advanced Italian class is either Italian or studied there for years while I'm a native English speaker... it's allowed in some places for sure :')", "created_utc": "1632591741.0", "edited": "False", "id": "he8u3r3", "is_submitter": "False", "link_id": "t3_pucozk", "parent_id": "t1_he250lm", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "ArtLangues", "body": "Thanks for the clarification. I took that to mean he wanted it *because* he already was one.", "created_utc": "1632058727.0", "edited": "False", "id": "hdgmdp3", "is_submitter": "False", "link_id": "t3_pql3fa", "parent_id": "t1_hdghpp3", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "ArtLangues", "body": "In your post history you mentioned having American citizenship. How is this possible then?", "created_utc": "1632055563.0", "edited": "False", "id": "hdgghoi", "is_submitter": "False", "link_id": "t3_pql3fa", "parent_id": "t1_hddp0tb", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "ArtLangues", "body": "Might be controversial, but NAH.\n\nObviously you are allowed to do what you want as it's your money and your life, and your daughter is not entitled to anything from you, but I can also see why she'd feel envious and that this is an unfair situation considering her siblings were handed an opportunity from you that she isn't able to have.\n\nGive her time. If this is really her dream, then she'll find a way to make it work. It seems like she had a whole plan in her head based on the opportunities you gave her siblings and she's crushed that it won't work out the same way, but it's temporary.", "created_utc": "1631996338.0", "edited": "False", "id": "hddgmfi", "is_submitter": "False", "link_id": "t3_pqt7wv", "parent_id": "t3_pqt7wv", "score": "3927", "subreddit": "AmItheAsshole", "subreddit_id": "t5_2xhvq"}, {"author": "ArtLangues", "body": "\\>I thought it was a bit of a dumbass question if I’m being honest \n\nLOL, fair enough. It was indeed some r/languagelearningjerk material but I post there too much so I refrained.", "created_utc": "1628424215.0", "edited": "False", "id": "h85t79e", "is_submitter": "False", "link_id": "t3_p07hec", "parent_id": "t1_h85nrdm", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "ArtLangues", "body": "Just curious, why is the Philippines an example of where you can speak Spanish? Only 0.5% of the population speaks it, and despite the large amount of Spanish loanwords in Tagalog, it's sort of like saying English speakers know French by default.\n\nCompared to the PH's 0.5%, a whopping 13.5% of Americans speak Spanish at home, 15% in Montreal (couldn't find full Canada data) 10% of Portugal, 9% of France, 6% of Germany, 4% of Brazil, and the list goes on and on. \n\nIf you're talking about Chavacano, the \"Spanish\" creole in the PH, it shares 60% of its modern day vocabulary with Spanish (source: La Prensa Latina) as opposed to 85% between Spanish and Italian and 89% Spanish and Portuguese (source: LrnGo). I wouldn't recommend learning Spanish to communicate in Italy, Brazil or Portugal.", "created_utc": "1628402833.0", "edited": "False", "id": "h8548mq", "is_submitter": "False", "link_id": "t3_p07hec", "parent_id": "t1_h84skz0", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "ArtLangues", "body": "American here. Learned fluent French to go to uni entirely in France because uni in the US is unsustainable financially. Saved myself from going into crushing debt.\n\nOh, and to clown on the OP a bit, I'm going into marketing and management. ;)", "created_utc": "1628385904.0", "edited": "False", "id": "h84cmzi", "is_submitter": "False", "link_id": "t3_oyhx2m", "parent_id": "t1_h829maz", "score": "1", "subreddit": "unpopularopinion", "subreddit_id": "t5_2tk0s"}, {"author": "ArtLangues", "body": "\"If you think learning languages is useful you must be a monolingual\" this man dealt the logic cards and went with none", "created_utc": "1628331960.0", "edited": "False", "id": "h81ieb4", "is_submitter": "True", "link_id": "t3_ozq1dz", "parent_id": "t1_h81gufq", "score": "59", "subreddit": "languagelearningjerk", "subreddit_id": "t5_37rt5"}, {"author": "ArtLangues", "body": "Also the proud author of [OMG WHAT MY POST BLEW UP TY GUYS FOR YOUR ANSWERS HUHHHHUHU I FEEL LIKE A CELEBRITY](https://www.reddit.com/r/languagelearning/comments/oyms04/how_many_languages_did_you_fluently_speak_before/?sort=new) and [How many times do you jerk off a day?](https://www.reddit.com/r/AskReddit/comments/ozbg3d/how_many_times_do_you_jerk_off_a_day/)", "created_utc": "1628327646.0", "edited": "False", "id": "h81dloi", "is_submitter": "True", "link_id": "t3_ozq1dz", "parent_id": "t3_ozq1dz", "score": "75", "subreddit": "languagelearningjerk", "subreddit_id": "t5_37rt5"}, {"author": "ArtLangues", "body": "/uj embarrassed to be asking this, but that sub is totally satire right?", "created_utc": "1628228349.0", "edited": "False", "id": "h7wj2qc", "is_submitter": "False", "link_id": "t3_oys81u", "parent_id": "t3_oys81u", "score": "2", "subreddit": "languagelearningjerk", "subreddit_id": "t5_37rt5"}, {"author": "ArtLangues", "body": "I didn't pay for French or Spanish resources or lessons until after B2 level at least, granted I was younger when I first learned them and my brain learned differently than it does now. But I did buy some resources for Italian, German and Hawaiian.", "created_utc": "1628131923.0", "edited": "False", "id": "h7rcsgu", "is_submitter": "False", "link_id": "t3_oxu4ki", "parent_id": "t3_oxu4ki", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "ArtLangues", "body": "Almost every time I say this, some European comes in with \"just get insurance\", thanks Captain Obvious try having some of the best insurance around and still losing your life savings and then some in a short time for life-saving treatment", "created_utc": "1628082677.0", "edited": "False", "id": "h7o996f", "is_submitter": "False", "link_id": "t3_oxpgj1", "parent_id": "t1_h7nx5wo", "score": "6", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "ArtLangues", "body": "We hate people who have kids and punish them in many ways for it", "created_utc": "1628082208.0", "edited": "False", "id": "h7o8c90", "is_submitter": "False", "link_id": "t3_oxpgj1", "parent_id": "t3_oxpgj1", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "ArtLangues", "body": "I watch TL dubs of shows I'm already well familiar with, since I can make vocab association. Works for me, might not work for everyone.", "created_utc": "1628038353.0", "edited": "False", "id": "h7menx9", "is_submitter": "False", "link_id": "t3_ox36o6", "parent_id": "t3_ox36o6", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "ArtLangues", "body": "Her latest IG posts are a naked ass and a selfie that says \"cum on me\". But let's put other women down for trying to garner attention for their looks", "created_utc": "1628030778.0", "edited": "False", "id": "h7lyzs5", "is_submitter": "True", "link_id": "t3_oxevzr", "parent_id": "t3_oxevzr", "score": "29", "subreddit": "notliketheothergirls", "subreddit_id": "t5_3opft"}, {"author": "ArtLangues", "body": "Native English speaker? In California? If you know Spanish already, I don't think it'll really make much of a difference. Just learn what you'd like since you're in a position where you can freely dabble in all. If you feel that you're missing out on other hobbies then try those too, but in this case we can pretty safely say you're fine doing whatever you please.", "created_utc": "1627990928.0", "edited": "False", "id": "h7jiqds", "is_submitter": "False", "link_id": "t3_owumn3", "parent_id": "t3_owumn3", "score": "9", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "ArtLangues", "body": "Patrick, I even voted for you, but you're making it hard to justify my vote.", "created_utc": "1627986080.0", "edited": "False", "id": "h7jc8yg", "is_submitter": "False", "link_id": "t3_ordbdj", "parent_id": "t1_h6hq640", "score": "1", "subreddit": "Portuguese", "subreddit_id": "t5_2sqn7"}, {"author": "ArtLangues", "body": "Which is exactly why your kids should learn it as children almost effortlessly, rather than deal with learning it after the critical period where they'll want to rip their hair out.", "created_utc": "1627971163.0", "edited": "False", "id": "h7iuqrb", "is_submitter": "False", "link_id": "t3_owol6k", "parent_id": "t1_h7hd6ly", "score": "3", "subreddit": "AmItheAsshole", "subreddit_id": "t5_2xhvq"}, {"author": "ArtLangues", "body": "(Obligatory not a native speaker) I got the gist of all of them except for #3, only got \"in the river\". There were just some random words thrown in that I didn't know and the sentence structure was really strange.", "created_utc": "1627896792.0", "edited": "False", "id": "h7eti4d", "is_submitter": "False", "link_id": "t3_ovrho9", "parent_id": "t3_ovrho9", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "ArtLangues", "body": "Pretty much the same most of the time - guys using language exchange as a way to pick up chicks. Fortunately I've had a handful who're totally fine but we drift away eventually.", "created_utc": "1627627192.0", "edited": "False", "id": "h71zs9s", "is_submitter": "False", "link_id": "t3_ouakty", "parent_id": "t3_ouakty", "score": "22", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "ArtLangues", "body": "It's not at all too late. I'm 18 and still find that language learning comes very easy to me, and plenty of adults far older than us still manage to become fluent in languages with the right mindset and work ethic. Just don't be discouraged if you don't make progress as quick as you'd like since it's more difficult without total immersion (nothing to do with age).", "created_utc": "1627452458.0", "edited": "False", "id": "h6su284", "is_submitter": "False", "link_id": "t3_ot3pyc", "parent_id": "t3_ot3pyc", "score": "12", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "ArtLangues", "body": "I'd recommend a B2 in Spanish before learning another language, especially if you're going with French first (same language family) instead of Norwegian.", "created_utc": "1627442324.0", "edited": "False", "id": "h6sdwjg", "is_submitter": "False", "link_id": "t3_ot0u5u", "parent_id": "t3_ot0u5u", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "ArtLangues", "body": "Since you know some Italian, Spanish should be the easiest, closely followed by French. I wouldn't recommend German based on the languages you already know.", "created_utc": "1627434784.0", "edited": "False", "id": "h6rz3ov", "is_submitter": "False", "link_id": "t3_oskybt", "parent_id": "t3_oskybt", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "ArtLangues", "body": "Great job! How did you make the final push from C1 to C2? I'm about to start uni in France in about a month from now (non-exchange, so I'll be there for years) and I'm hoping this will help, but I was wondering if there was anything you did in your free time. The gap between those last 2 levels seems to be the biggest for me.", "created_utc": "1627434417.0", "edited": "False", "id": "h6rycey", "is_submitter": "False", "link_id": "t3_oskro7", "parent_id": "t3_oskro7", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "ArtLangues", "body": "I already know French, so Norwegian for sure. It's just a beautiful sounding language and I listen to a lot of music from Norway.", "created_utc": "1627434004.0", "edited": "False", "id": "h6rxi5z", "is_submitter": "False", "link_id": "t3_osrdxz", "parent_id": "t3_osrdxz", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "ArtLangues", "body": "Seconding that you should check with your university to make sure you c*an* take alternatives before you waste your money on an alternative. As for affordable alternatives, I know some universities allow the Duolingo English test, which is only $49.", "created_utc": "1627322437.0", "edited": "False", "id": "h6m1rh3", "is_submitter": "False", "link_id": "t3_os344l", "parent_id": "t3_os344l", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "ArtLangues", "body": "Thought I was the only one! Learning German but listen to Norwegian music *all* the time. Hasn't affected my learning except for making me want to learn Norwegian.", "created_utc": "1627267606.0", "edited": "False", "id": "h6jliz6", "is_submitter": "False", "link_id": "t3_o06bqk", "parent_id": "t1_h1tieua", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "ArtLangues", "body": "M", "created_utc": "1626821448.0", "edited": "False", "id": "h5xld7m", "is_submitter": "False", "link_id": "t3_oo4n6s", "parent_id": "t1_h5wdwje", "score": "1", "subreddit": "AskOuija", "subreddit_id": "t5_3eg3f"}, {"author": "ArtLangues", "body": "Sounds very plausible. I've also had other instances where family told me I walked into their room to talk about how I can't sleep (with me having no recollection of this) or that I'm having a conversation with myself while sleeping in the same room as them.\n\nIs there treatment for this?", "created_utc": "1626700677.0", "edited": "False", "id": "h5qzcmh", "is_submitter": "False", "link_id": "t3_oncgt2", "parent_id": "t1_h5qtvlu", "score": "2", "subreddit": "sleep", "subreddit_id": "t5_2qpyn"}, {"author": "ArtLangues", "body": "ESH. I plan on remaining childless myself despite familial pressure and don't like kids (also agree babies are ugly) but I don't think stooping to someone else's level is the answer. She shouldn't have kept persisting, very annoying when people do that. However, most other tit-for-tat posts on this subreddit get an ESH rating but for some reason it's different for the r/childfree people of Reddit when there's a baby involved. Best thing to do would've been to kick her out without the unnecessary insult.", "created_utc": "1626696572.0", "edited": "False", "id": "h5qsclj", "is_submitter": "False", "link_id": "t3_on7sg9", "parent_id": "t3_on7sg9", "score": "4", "subreddit": "AmItheAsshole", "subreddit_id": "t5_2xhvq"}, {"author": "ArtLangues", "body": "/uj This but unironically. When I speak someone's native language at a \\~C1 level and they speak mine (English) at an A2 at most, I prefer to speak theirs to streamline the process, but they often *really* insist. Some going so far as to assume they speak fluent English when they can't be higher than an A level so I shouldn't have any problems understanding them. Being a native English speaker is good for professional and practical reasons but damn I'd be lying if I didn't say it's annoying as a language learner.", "created_utc": "1626651362.0", "edited": "False", "id": "h5owjp2", "is_submitter": "False", "link_id": "t3_okjt7o", "parent_id": "t3_okjt7o", "score": "1", "subreddit": "languagelearningjerk", "subreddit_id": "t5_37rt5"}, {"author": "ArtLangues", "body": "This is a never ending problem coming from native Spanish speakers, even in English. Apart from the many other incidents of being called a \"racist\" for using the word \"American\" in English in casual conversation, I had one person literally tell me that using the word \"American\" (in *English,* not Spanish) was \"the same as colonization\" in those exact words, as if we actually have an alternative that we can get a wide adoption of. It is a subject dear to them.\n\nComing from someone who *always* uses \"estadounidense\" in Spanish to be respectful of them and their language's rules, a lot of them won't return the favor.", "created_utc": "1626150634.0", "edited": "1626150943.0", "id": "h504e1u", "is_submitter": "False", "link_id": "t3_oik3x3", "parent_id": "t1_h4vz9sz", "score": "1", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "ArtLangues", "body": "Yep, those are normal words for native anglophones (especially from the US) to know even if they don't speak Spanish. IDK what they were thinking", "created_utc": "1626076486.0", "edited": "False", "id": "h4wcgh1", "is_submitter": "False", "link_id": "t3_oifrid", "parent_id": "t1_h4vso72", "score": "2", "subreddit": "AmItheAsshole", "subreddit_id": "t5_2xhvq"}, {"author": "ArtLangues", "body": "You're right. Which makes this even funnier.", "created_utc": "1626076370.0", "edited": "False", "id": "h4wcc77", "is_submitter": "False", "link_id": "t3_oifrid", "parent_id": "t1_h4w583q", "score": "3", "subreddit": "AmItheAsshole", "subreddit_id": "t5_2xhvq"}, {"author": "ArtLangues", "body": "Disclaimer: I don't know any Polish so I stumbled around Google with a translator.\n\nIt might be: *the distinctive* ***Podhale dialect (Góralski)*** *used by the Gorals (Highlanders) in the mountainous area bordering the Czech Republic and Slovakia.* (from the Wikipedia article on Polish dialects)\n\nZbigniew Wodecki was born on 6 May 1950 in Godów, Poland, which happens to be around the area where this dialect comes from.\n\nIf you're wondering why I think this is a dialect: [On an article about this same song, a commenter seems to express anger at the \"annoying dialect\" in the song, making me think this is a Polish dialect.](https://imgur.com/a/xwtv1lX) (the [article](https://gazetawroclawska.pl/piosenka-chwytaj-dzien-zbigniewa-wodeckiego-w-1-rocznice-smierci-artysty-to-niepublikowany-utwor-z-jego-ostatniej/ar/13196263))", "created_utc": "1626013188.0", "edited": "False", "id": "h4t6lyu", "is_submitter": "False", "link_id": "t3_oi2z5y", "parent_id": "t3_oi2z5y", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "ArtLangues", "body": "Try [https://oleloonline.com/](https://oleloonline.com/), lots of materials and video lessons. I took classes with the teacher IRL right when covid hit and he knows what he's talking about.", "created_utc": "1626011450.0", "edited": "False", "id": "h4t3k7u", "is_submitter": "False", "link_id": "t3_oi4pzq", "parent_id": "t3_oi4pzq", "score": "7", "subreddit": "Hawaii", "subreddit_id": "t5_2qi3u"}, {"author": "ArtLangues", "body": "Ahh okay, I assumed you meant a university in France. If they've written B2 on their website then you're probably good to go but I would really email them to confirm since the same thing happened when I considered a school for a \"licence\" (bachelor's) and they wrote B2 on their website but actually required a C1. French institution sites are weird like that.", "created_utc": "1625978615.0", "edited": "False", "id": "h4s0bq7", "is_submitter": "False", "link_id": "t3_ohvmqa", "parent_id": "t1_h4rtcg4", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "ArtLangues", "body": "As a non-European going to uni in France and did the whole application process myself, I need to warn you that you're typically gonna need a level higher than B2 if you're applying directly to master's degrees, because the B2 requirement is for the licence (bachelor's). The master's requirement is usually C1.\n\nDo you have a specific university in mind that allows only the B2?", "created_utc": "1625973286.0", "edited": "False", "id": "h4rrv4f", "is_submitter": "False", "link_id": "t3_ohvmqa", "parent_id": "t3_ohvmqa", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "ArtLangues", "body": "Thanks! Strasbourg for a year and then transferring to Aix-en-Provence for the remaining 2 years of the bachelor's. After that, hoping for another degree elsewhere in France.\n\nI'm from the Big Island of Hawaii BTW, so I'd also take my opinion with a grain of salt regarding that, as I have no experience with Kauai specifically. My opinion is going solely based off of family members and friends who have visited there. It is for sure beautiful so if you chose to go there instead of France I think you'd have a good time either way.", "created_utc": "1625833965.0", "edited": "False", "id": "h4l1pwo", "is_submitter": "False", "link_id": "t3_of873u", "parent_id": "t1_h4krtlz", "score": "1", "subreddit": "solotravel", "subreddit_id": "t5_2rxxm"}, {"author": "ArtLangues", "body": "As a lifetime Hawaiian resident about to start a full-time degree in France, I'm very obviously biased - but France. More cultural activities, older architecture and more to do IMO, good for French learners, and less expensive on all counts (other than potentially airplane tickets depending, but I think it's worth it). Hawaii is good for outdoorsy/yoga people but so is France if you search out those opportunities.\n\nBut take my opinion with a grain of salt though. Nobody permanently leaves Hawaii to go to France without a reason, and I have mine. ;)", "created_utc": "1625814364.0", "edited": "False", "id": "h4kemnl", "is_submitter": "False", "link_id": "t3_of873u", "parent_id": "t3_of873u", "score": "2", "subreddit": "solotravel", "subreddit_id": "t5_2rxxm"}, {"author": "ArtLangues", "body": "My school required around 300 volunteer hours to graduate. It's basically expected of you.", "created_utc": "1625747735.0", "edited": "False", "id": "h4gtb8w", "is_submitter": "False", "link_id": "t3_ofiwut", "parent_id": "t3_ofiwut", "score": "1", "subreddit": "AskAnAmerican", "subreddit_id": "t5_2uah7"}, {"author": "ArtLangues", "body": "I went to his profile and saw porn instead. FFS\n\nEdit: looks like his native lang is PT(?) and he was posting English practice", "created_utc": "1625741650.0", "edited": "False", "id": "h4gknti", "is_submitter": "True", "link_id": "t3_ofxari", "parent_id": "t1_h4gg966", "score": "9", "subreddit": "languagelearningjerk", "subreddit_id": "t5_37rt5"}, {"author": "ArtLangues", "body": "What do you mean, your brain has space for more than one language and it's impossible to forget your native language that easily? What???", "created_utc": "1625709120.0", "edited": "False", "id": "h4fczda", "is_submitter": "True", "link_id": "t3_ofxari", "parent_id": "t3_ofxari", "score": "35", "subreddit": "languagelearningjerk", "subreddit_id": "t5_37rt5"}, {"author": "ArtLangues", "body": "I know [Lengalia gives certificates](https://support.lengalia.com/hc/en-gb/articles/360001434358-How-do-I-get-a-course-certificate-) at the end of an online course completion. Worth looking into, I've used it for C1 level and it's quite good. Depends on how many hours a day you're willing to work though since 3 weeks isn't a lot.", "created_utc": "1625194939.0", "edited": "False", "id": "h3reycs", "is_submitter": "False", "link_id": "t3_obzk8c", "parent_id": "t3_obzk8c", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "ArtLangues", "body": "Yep. As someone who lives very close to the town where this was filmed, I can confirm most people here do not have money", "created_utc": "1625066339.0", "edited": "False", "id": "h3ki1zn", "is_submitter": "False", "link_id": "t3_oa1js8", "parent_id": "t1_h3gy45t", "score": "1", "subreddit": "InsaneVideo", "subreddit_id": "t5_4l5k3b"}, {"author": "ArtLangues", "body": "Are you maybe thinking of Omnia?", "created_utc": "1624940982.0", "edited": "False", "id": "h3em1kc", "is_submitter": "False", "link_id": "t3_o9rscd", "parent_id": "t1_h3dpvm3", "score": "5", "subreddit": "creepshowart", "subreddit_id": "t5_2b6em0"}, {"author": "ArtLangues", "body": "Applied Foreign Languages, though nationally all public universities are given the same price tag. Note: my program is in French so that likely cut down the cost greatly, but the ones in English are usually around $9k-10k, still nowhere near the aforementioned 30k-50k.", "created_utc": "1624848290.0", "edited": "False", "id": "h3a36jp", "is_submitter": "False", "link_id": "t3_o8el82", "parent_id": "t1_h39ncjg", "score": "2", "subreddit": "ApplyingToCollege", "subreddit_id": "t5_2y2r8"}, {"author": "ArtLangues", "body": "Of course, I'll be sleeping soon but feel free to PM or DM with your questions and I'll get back to you.", "created_utc": "1624797403.0", "edited": "False", "id": "h37fj3z", "is_submitter": "False", "link_id": "t3_o8el82", "parent_id": "t1_h37ckti", "score": "3", "subreddit": "ApplyingToCollege", "subreddit_id": "t5_2y2r8"}, {"author": "ArtLangues", "body": "No scholarships, that's just how much it costs. I'm not quite sure where the other person got their 30k-50k number from but in France that's for sure not the case.\n\nEdit: Also, some people are saying it doesn't matter that the cost is so low because European universities are \"worse\" than American ones. Mine is in the top 1% (+ under top 200) in the world meaning it ranks higher than most American universities, so I'm also not quite sure where that one came from.", "created_utc": "1624794344.0", "edited": "False", "id": "h37blvm", "is_submitter": "False", "link_id": "t3_o8el82", "parent_id": "t1_h379rt3", "score": "4", "subreddit": "ApplyingToCollege", "subreddit_id": "t5_2y2r8"}, {"author": "ArtLangues", "body": "Some ice cream, a chocolate lava cake maybe. Just in the mood for some sweets, you know? What are you craving?", "created_utc": "1624776003.0", "edited": "False", "id": "h36s1qq", "is_submitter": "False", "link_id": "t3_o8el82", "parent_id": "t1_h36r7kl", "score": "5", "subreddit": "ApplyingToCollege", "subreddit_id": "t5_2y2r8"}, {"author": "ArtLangues", "body": "Not always, if you bother learning the local language at least. I'm American and I'm paying just a bit over $200 a year for tuition in France, but the caveat was that I had to learn French (and it only took me 2-3 months of studying to pass the test). \n\nSince so many Americans hate doing that for some weird reason, they have to deal with higher prices, which I think is pretty fair.", "created_utc": "1624773966.0", "edited": "False", "id": "h36pmwd", "is_submitter": "False", "link_id": "t3_o8el82", "parent_id": "t1_h366ogq", "score": "1", "subreddit": "ApplyingToCollege", "subreddit_id": "t5_2y2r8"}, {"author": "ArtLangues", "body": "I'm American and am about to start university in France. My tuition is $205", "created_utc": "1624773449.0", "edited": "False", "id": "h36ozwt", "is_submitter": "False", "link_id": "t3_o8el82", "parent_id": "t1_h35ylhv", "score": "4", "subreddit": "ApplyingToCollege", "subreddit_id": "t5_2y2r8"}, {"author": "ArtLangues", "body": "Indeed they do. Which is why as an American, I applied to only unis in France instead and now my tuition+housing cost combined is far less than in-state tuition living in my parents' house.", "created_utc": "1624773395.0", "edited": "False", "id": "h36oxka", "is_submitter": "False", "link_id": "t3_o8el82", "parent_id": "t3_o8el82", "score": "3", "subreddit": "ApplyingToCollege", "subreddit_id": "t5_2y2r8"}, {"author": "ArtLangues", "body": "Yikes. The question she asked in the post was \"How do I take my mind off this?\", not \"How do I make my BF stop?\" meaning she's recognizing it's her problem and not her BF's.", "created_utc": "1624693865.0", "edited": "False", "id": "h334dx6", "is_submitter": "False", "link_id": "t3_o84mjx", "parent_id": "t1_h32xres", "score": "6", "subreddit": "relationships", "subreddit_id": "t5_2qjvn"}, {"author": "ArtLangues", "body": "I saved myself by applying to unis in France only (I'm American) and my yearly tuition is $205.\n\nI don't even know why people even bother in the 40k-80k range. Prestige? Is that it?", "created_utc": "1624338233.0", "edited": "False", "id": "h2mcfd5", "is_submitter": "False", "link_id": "t3_o4y0pq", "parent_id": "t1_h2ldm4b", "score": "2", "subreddit": "ApplyingToCollege", "subreddit_id": "t5_2y2r8"}, {"author": "ArtLangues", "body": "Where's that? I scrolled through every comment on this thread down to the bottom and didn't see anyone telling OP they should pay the 13 y/o.", "created_utc": "1624312957.0", "edited": "False", "id": "h2l3z7h", "is_submitter": "False", "link_id": "t3_o4z5v0", "parent_id": "t1_h2kw0ev", "score": "1", "subreddit": "AmItheAsshole", "subreddit_id": "t5_2xhvq"}, {"author": "ArtLangues", "body": "Cool! Sorry for the late response, didn't have my laptop. I'm from the Big Island and moving to France for university in August.", "created_utc": "1623874945.0", "edited": "False", "id": "h20d2we", "is_submitter": "False", "link_id": "t3_nnzt4x", "parent_id": "t1_h1d9m05", "score": "1", "subreddit": "ApplyingToCollege", "subreddit_id": "t5_2y2r8"}, {"author": "ArtLangues", "body": "He is for sure a lost redditor, but in all fairness, that's the first thing I assumed from the subreddit name too.", "created_utc": "1622802900.0", "edited": "False", "id": "h0jv4u1", "is_submitter": "False", "link_id": "t3_nrqaay", "parent_id": "t3_nrqaay", "score": "1", "subreddit": "lostredditors", "subreddit_id": "t5_3ns7i"}, {"author": "ArtLangues", "body": "What a gut buster! Squeezed out my kidney stone for me", "created_utc": "1622802766.0", "edited": "False", "id": "h0juyuy", "is_submitter": "False", "link_id": "t3_ns1cjr", "parent_id": "t3_ns1cjr", "score": "72", "subreddit": "lostredditors", "subreddit_id": "t5_3ns7i"}, {"author": "ArtLangues", "body": "Yes, you can. Will get to them in a bit. :)", "created_utc": "1622677670.0", "edited": "False", "id": "h0dlfc8", "is_submitter": "False", "link_id": "t3_nizn9i", "parent_id": "t1_h0dgfv5", "score": "1", "subreddit": "ApplyingToCollege", "subreddit_id": "t5_2y2r8"}, {"author": "ArtLangues", "body": "Look for fee waivers, many schools will basically hand them to you since you have a high GPA.\n\nDon't make the same mistake many internationals make by *just* applying to T50's or even T100's, you may have a very rough time getting accepted if you can't pay, despite how impressive your file is. Try also looking for smaller and less competitive schools that offer full rides to internationals, even if they are not as prestigious. If your goal is just to get to the US then this is the less painful way and improves your chances.", "created_utc": "1622636857.0", "edited": "False", "id": "h0b0yec", "is_submitter": "False", "link_id": "t3_nqgkjb", "parent_id": "t3_nqgkjb", "score": "3", "subreddit": "ApplyingToCollege", "subreddit_id": "t5_2y2r8"}, {"author": "ArtLangues", "body": "As an anecdote, my yearly tuition in France is $200 as opposed to my fee of between $30,000 and $60,000 if I chose to study my domain of interest in the US, hence why it's super hard for me to understand why anyone would want to even come here to study, let alone if they don't want to establish a life here.\n\nThough my caveat with getting that cheap tuition was learning French, which only took 2 months of studying for the test as a false beginner. If you learn/speak the language of the country in question you will likely get a discount as English programs tend to be private and non-funded by the government.\n\nAFAIK, Germany is free and has programs in English, but I'm not sure if they're at the bachelor's level, you'll have to look. Hope I helped in some way.", "created_utc": "1622540105.0", "edited": "False", "id": "h06c186", "is_submitter": "False", "link_id": "t3_npliwh", "parent_id": "t1_h067ekr", "score": "2", "subreddit": "ApplyingToCollege", "subreddit_id": "t5_2y2r8"}, {"author": "ArtLangues", "body": "My best story: My teacher is a native speaker of 2 of my TLs and we share the same humor and interests. He helped me pass my interview to get into French unis. Yay!\n\nMy worst story: I once had a Spanish teacher who told me she's afraid of black people and they are \"just on average more aggressive as a race\". Erm... didn't go back to her after that one.", "created_utc": "1622534360.0", "edited": "False", "id": "h0660yj", "is_submitter": "False", "link_id": "t3_noayvc", "parent_id": "t3_noayvc", "score": "7", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "ArtLangues", "body": "For the US, only if you get a full ride or a massive scholarship that will bring your tuition/housing costs down to match what you pay in the PH. Otherwise, no. I'm American myself and I'm going to university abroad in a couple of months specifically to avoid my country throwing me into inevitable debt and financial hardship, especially seeing as my state schools are very bad for my domain and would have to go OOS for $45k+ a year. If you have no interest working in the US then I can't see any upsides to it.\n\nHave you considered going literally anywhere else? There are other developed countries that teach in English, look into European countries for example.", "created_utc": "1622533640.0", "edited": "False", "id": "h06592i", "is_submitter": "False", "link_id": "t3_npliwh", "parent_id": "t3_npliwh", "score": "3", "subreddit": "ApplyingToCollege", "subreddit_id": "t5_2y2r8"}, {"author": "ArtLangues", "body": "Am I missing something here? Regardless of the breasts =/= sexual debate, if this were a dude going completely butt-naked from the waist down with his cock flopping out and about, people's attitudes would change significantly.", "created_utc": "1622440532.0", "edited": "False", "id": "h01znma", "is_submitter": "False", "link_id": "t3_noghns", "parent_id": "t3_noghns", "score": "27", "subreddit": "SubredditDrama", "subreddit_id": "t5_2ss5b"}, {"author": "ArtLangues", "body": "Ayy, fellow kama'aina! Island? And where you going?", "created_utc": "1622357102.0", "edited": "False", "id": "gzya6gm", "is_submitter": "False", "link_id": "t3_nnzt4x", "parent_id": "t1_gzxewzr", "score": "1", "subreddit": "ApplyingToCollege", "subreddit_id": "t5_2y2r8"}, {"author": "ArtLangues", "body": ">For how wealthy most people are\n\n*\\*laughs in Puna\\**", "created_utc": "1622243669.0", "edited": "False", "id": "gztd0ir", "is_submitter": "False", "link_id": "t3_nn655c", "parent_id": "t3_nn655c", "score": "8", "subreddit": "Hawaii", "subreddit_id": "t5_2qi3u"}, {"author": "ArtLangues", "body": "Could you private message me the link to/name of their service please? Some of the ones I've been seeing don't seem to offer that service.", "created_utc": "1622142587.0", "edited": "False", "id": "gzo5u4u", "is_submitter": "False", "link_id": "t3_nm0jgo", "parent_id": "t1_gznzyvp", "score": "1", "subreddit": "AskLosAngeles", "subreddit_id": "t5_2zay0"}, {"author": "ArtLangues", "body": "NTA at all, and why did you apologize to him? It'll only reinforce his horrid ways of thinking by insinuating he was in the right.", "created_utc": "1622069890.0", "edited": "False", "id": "gzkmrhl", "is_submitter": "False", "link_id": "t3_nlhe30", "parent_id": "t3_nlhe30", "score": "1", "subreddit": "AmItheAsshole", "subreddit_id": "t5_2xhvq"}, {"author": "ArtLangues", "body": "Exactly what I was looking for! Thank you!!", "created_utc": "1621846717.0", "edited": "False", "id": "gz95qcz", "is_submitter": "True", "link_id": "t3_njr0m8", "parent_id": "t1_gz93nbl", "score": "6", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "ArtLangues", "body": "Going from Hawaii to France (exactly 7610 miles, or 12,248 km, from my house in HI)", "created_utc": "1621758032.0", "edited": "False", "id": "gz54fdm", "is_submitter": "False", "link_id": "t3_nizn9i", "parent_id": "t3_nizn9i", "score": "5", "subreddit": "ApplyingToCollege", "subreddit_id": "t5_2y2r8"}, {"author": "ArtLangues", "body": "YTA. Stop being a toxic friend. Don't be surprised if she cuts you off (and for good reason)", "created_utc": "1621465272.0", "edited": "False", "id": "gyr92ez", "is_submitter": "False", "link_id": "t3_ngfkwu", "parent_id": "t3_ngfkwu", "score": "2", "subreddit": "AmItheAsshole", "subreddit_id": "t5_2xhvq"}, {"author": "ArtLangues", "body": "I haven't started it yet, so I can't tell you my experience, but I can tell you the info I do know - I'm going to University of Strasbourg (but this program is available at pretty much every uni in France) and the program is not in English except for English classes. You need a B2 in French.\n\nAs for expenses, since I'm American, the cost of tuition (170€) and housing combined is half the price of going to my state college.", "created_utc": "1621450930.0", "edited": "False", "id": "gyqbvqz", "is_submitter": "False", "link_id": "t3_ng1cod", "parent_id": "t1_gypkw40", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "ArtLangues", "body": "Regarding this point, I could suggest my own path to OP or anyone reading:\n\nI'm starting a degree in Applied Foreign Languages in France, which solves specifically that problem. It's a hybrid between language/culture/art and business sectors. After you're done with the AFL bachelor's, you can specialize in a Master's degree for sectors such as International Business, Marketing, economic things, etc. or if that's not really your style, translation, interpretation, diplomacy, tourism, etc.", "created_utc": "1621419541.0", "edited": "False", "id": "gyogpfw", "is_submitter": "False", "link_id": "t3_ng1cod", "parent_id": "t1_gyoftnw", "score": "6", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "ArtLangues", "body": "You'd have a point if it weren't for the fact that the last ceremonies happened ***years*** ago.", "created_utc": "1621404262.0", "edited": "False", "id": "gynz5sd", "is_submitter": "False", "link_id": "t3_nfvty5", "parent_id": "t1_gynuny5", "score": "1", "subreddit": "relationships", "subreddit_id": "t5_2qjvn"}, {"author": "ArtLangues", "body": "I'm confused... what are you implying here? Why shouldn't she have done so?", "created_utc": "1621400685.0", "edited": "False", "id": "gynu3ej", "is_submitter": "False", "link_id": "t3_nfvty5", "parent_id": "t1_gynsmff", "score": "4", "subreddit": "relationships", "subreddit_id": "t5_2qjvn"}, {"author": "ArtLangues", "body": "Sorry, my comment isn't helpful, I'm just really curious - why a dorm if you have a car and your house is 20 minutes away?", "created_utc": "1621377294.0", "edited": "False", "id": "gymks9z", "is_submitter": "False", "link_id": "t3_nfkqyc", "parent_id": "t3_nfkqyc", "score": "4", "subreddit": "ApplyingToCollege", "subreddit_id": "t5_2y2r8"}, {"author": "ArtLangues", "body": "Who else is here after they deleted their damage control apology post?", "created_utc": "1621234230.0", "edited": "False", "id": "gyf1wln", "is_submitter": "False", "link_id": "t3_ndofcn", "parent_id": "t3_ndofcn", "score": "7", "subreddit": "ApplyingToCollege", "subreddit_id": "t5_2y2r8"}, {"author": "ArtLangues", "body": "\\*chonky sigh\\*\n\nThis is the toughest video I've ever had to make.", "created_utc": "1621227243.0", "edited": "False", "id": "gyesde0", "is_submitter": "False", "link_id": "t3_ne6k6i", "parent_id": "t3_ne6k6i", "score": "11", "subreddit": "ApplyingToCollege", "subreddit_id": "t5_2y2r8"}, {"author": "ArtLangues", "body": "As a progressive, this is a phat yikes from me dawg", "created_utc": "1621121408.0", "edited": "False", "id": "gy9nekt", "is_submitter": "False", "link_id": "t3_ndahy8", "parent_id": "t3_ndahy8", "score": "24", "subreddit": "ApplyingToCollege", "subreddit_id": "t5_2y2r8"}, {"author": "ArtLangues", "body": "This man's IQ cannot be quantified. It's too high for humankind to comprehend.", "created_utc": "1621121090.0", "edited": "False", "id": "gy9mtxz", "is_submitter": "False", "link_id": "t3_nd7nvp", "parent_id": "t1_gy93zd1", "score": "122", "subreddit": "ApplyingToCollege", "subreddit_id": "t5_2y2r8"}, {"author": "ArtLangues", "body": "Hey, no worries. You took the criticism (even if it was rough) like a champ so I have to applaud you for it.", "created_utc": "1621120093.0", "edited": "False", "id": "gy9l0dw", "is_submitter": "False", "link_id": "t3_ncigto", "parent_id": "t1_gy9hq79", "score": "94", "subreddit": "asklatinamerica", "subreddit_id": "t5_fda8k"}, {"author": "ArtLangues", "body": "Sorry y'all, we'll be taking our drunk gringo friend back, I 100% thought this was a troll account until I saw their page 😂 OP you're not a real liberal, you're just xenophobic, and especially seeing as you're a privileged white person, don't tell other ethnicities (especially ones that have a hard time in our own country) how to speak their language. This is really problematic, I actually have second hand embarrassment\n\nEdit: After your update, you are forgiven but please don't go down the woke hole like this. As a liberal myself, this type of extremist far-left thinking is just problematic and damaging to marginalized groups, period.", "created_utc": "1621117724.0", "edited": "1621118687.0", "id": "gy9gl98", "is_submitter": "False", "link_id": "t3_ncigto", "parent_id": "t3_ncigto", "score": "199", "subreddit": "asklatinamerica", "subreddit_id": "t5_fda8k"}, {"author": "ArtLangues", "body": "Us 4 langs people don't exist, we are but a figment of the imagination", "created_utc": "1620893460.0", "edited": "1621022947.0", "id": "gxyep6i", "is_submitter": "False", "link_id": "t3_nb4gcy", "parent_id": "t3_nb4gcy", "score": "10", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "ArtLangues", "body": "Would have stayed away from snake \"friends\". Which was most of them.", "created_utc": "1620768094.0", "edited": "False", "id": "gxs1o72", "is_submitter": "False", "link_id": "t3_na6qy8", "parent_id": "t3_na6qy8", "score": "8", "subreddit": "ApplyingToCollege", "subreddit_id": "t5_2y2r8"}, {"author": "ArtLangues", "body": "As an accepted foreign student to University of Strasbourg, watch out.\n\nMy friend is from the Philippines and they rejected him because the \"level of mathematics is too weak in the Philippines\" (he applied for Math-CS and is a top student) and referenced the fact that the Phils. are at the bottom of the PISA exam rankings.", "created_utc": "1620694738.0", "edited": "False", "id": "gxodjon", "is_submitter": "False", "link_id": "t3_lnwg3u", "parent_id": "t3_lnwg3u", "score": "1", "subreddit": "Strasbourg", "subreddit_id": "t5_2t6fw"}, {"author": "ArtLangues", "body": ">Why not just go to Europe and spend a fraction to get the same piece of paper in less time? \n\nAmerican here, starting a full 3-year bachelor's degree in France this year. My tuition is only $200 a year. Reading this subreddit makes me depressed sometimes, there are few places where going into debt for education is normalized.", "created_utc": "1620603875.0", "edited": "False", "id": "gxjvclp", "is_submitter": "False", "link_id": "t3_n7vwk0", "parent_id": "t1_gxgaugc", "score": "2", "subreddit": "ApplyingToCollege", "subreddit_id": "t5_2y2r8"}, {"author": "ArtLangues", "body": "I graduated a year ago. I don't miss it one bit and I don't talk to anyone from HS anymore, not even to the people I sat with at the table everyday. There are better things to come.", "created_utc": "1620601659.0", "edited": "False", "id": "gxjrdj7", "is_submitter": "False", "link_id": "t3_n8l0pm", "parent_id": "t3_n8l0pm", "score": "16", "subreddit": "ApplyingToCollege", "subreddit_id": "t5_2y2r8"}, {"author": "ArtLangues", "body": "And even then, I see some kids here in the US take Spanish when it's spoken in their household for an easy A and they get credit for it.😂\n\nT'inquiète, OP", "created_utc": "1620538226.0", "edited": "False", "id": "gxgwkbr", "is_submitter": "False", "link_id": "t3_n7qfnr", "parent_id": "t1_gxe62ls", "score": "2", "subreddit": "ApplyingToCollege", "subreddit_id": "t5_2y2r8"}, {"author": "ArtLangues", "body": "Well, they answered your question then it seems. It sucks, I know; I've had to travel a total of 24,000 km just to take 2 language exams for uni admissions purposes but it had to be done.\n\nWhat do you need the certificate for? Any way you can take a different test that might be available in your country?", "created_utc": "1620516013.0", "edited": "False", "id": "gxftpjj", "is_submitter": "False", "link_id": "t3_n807yk", "parent_id": "t1_gxfrazz", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "ArtLangues", "body": "NTA at all. Nothing more hypocritical than sending unsolicited nudes and then saying YOU'RE  the one who \"almost rap\\*d\" HIM.", "created_utc": "1620470091.0", "edited": "False", "id": "gxdhx9z", "is_submitter": "False", "link_id": "t3_n7krns", "parent_id": "t3_n7krns", "score": "3", "subreddit": "AmItheAsshole", "subreddit_id": "t5_2xhvq"}, {"author": "ArtLangues", "body": "I think it means \"Soon-to-be-ex\" judging by the context", "created_utc": "1620351201.0", "edited": "False", "id": "gx829ne", "is_submitter": "False", "link_id": "t3_n67i84", "parent_id": "t1_gx71vvg", "score": "1", "subreddit": "AmItheAsshole", "subreddit_id": "t5_2xhvq"}, {"author": "ArtLangues", "body": "Yes, I had similar results. I also noticed the grammar/vocab section changes vastly depending on the language, the French one was far less difficult than the Spanish one and I'd venture to say it was lower in level.", "created_utc": "1620342136.0", "edited": "False", "id": "gx7kfwx", "is_submitter": "False", "link_id": "t3_llfg84", "parent_id": "t1_gx6vrjj", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "ArtLangues", "body": "I agree that if someone is only doing one or a couple of things on that list, they should take a look at their learning methods and see if they're really doing the best they could for their goals; however, the issue I had with the original comment was that they said, solidly cut-and-dry, \"you probably aren't learning too well\" which is not a thing that can be assumed based on someone's preferences for which type of media they consume the most. This can vary depending on the goal of the person and what level they are aiming for, and for some, they are only able to retain information with certain types of media. \n\nTL;DR: if they had put it the way you put it, which is \"reconsider how you are learning and make sure you're doing the best you can for your goals\", then that would make total sense. However, they instead went with an assumption rather than a suggestion, which I did not feel was fair.", "created_utc": "1620175777.0", "edited": "False", "id": "gwyywii", "is_submitter": "False", "link_id": "t3_n4b8ua", "parent_id": "t1_gwyvkeg", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "ArtLangues", "body": "I didn't see it (the poll) as that much of a deep question IMO. For example, in my case, I use all of these methods, and a few of them more often than others. However, there is a certain answer in the poll which I know for a fact I use more often than others because it is also connected to a hobby of mine.\n\nThe word \"mainly\" can be taken to mean \"to the greatest extent\" or \"more than anything else\", and that's what I picked. I don't think the OP of the comment chain can say people aren't learning well if they have one method they use more than others, because that varies from person to person, of course.", "created_utc": "1620173533.0", "edited": "False", "id": "gwyu6pq", "is_submitter": "False", "link_id": "t3_n4b8ua", "parent_id": "t1_gwytgtj", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "ArtLangues", "body": "Right? This subreddit shocks me sometimes.\n\nYeah, everyone who learns languages must use all resources at exactly an equal amount! ^(/s)", "created_utc": "1620170374.0", "edited": "False", "id": "gwynkws", "is_submitter": "False", "link_id": "t3_n4b8ua", "parent_id": "t1_gwv65j0", "score": "4", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "ArtLangues", "body": "They were $30 each for me. The speaking section is graded by a robot and you also have to repeat longish sentences after they're played back to you (which is something I struggle with even in English). The grammar/reading section is alright but nothing special that you can't get in an online placement test for free.\n\nMy overall scores in both languages were C1 but I feel I could have gotten the same results from any random online placement test; no certificate was even included or anything", "created_utc": "1619743546.0", "edited": "False", "id": "gwd9617", "is_submitter": "False", "link_id": "t3_mz3na6", "parent_id": "t1_gwd8qkf", "score": "2", "subreddit": "iTalki", "subreddit_id": "t5_3cnxj"}, {"author": "ArtLangues", "body": "I bought it twice (one for 2 languages) and I wouldn't recommend it", "created_utc": "1619743281.0", "edited": "False", "id": "gwd8ksu", "is_submitter": "False", "link_id": "t3_mz3na6", "parent_id": "t3_mz3na6", "score": "1", "subreddit": "iTalki", "subreddit_id": "t5_3cnxj"}, {"author": "ArtLangues", "body": "I committed to a school there because tuition is $200 a year for public unis (even as an American), so at least they did *something* right that the US couldn't", "created_utc": "1619722674.0", "edited": "False", "id": "gwbxffz", "is_submitter": "True", "link_id": "t3_n0z5rq", "parent_id": "t1_gwalz4r", "score": "2", "subreddit": "ApplyingToCollege", "subreddit_id": "t5_2y2r8"}, {"author": "ArtLangues", "body": "On espérait qu'il y aurait des étudiants extra-européens qui ont étudié en France ici, mais à en juger par les downvotes, je suppose que non.", "created_utc": "1619593599.0", "edited": "False", "id": "gw5amrb", "is_submitter": "True", "link_id": "t3_n02wie", "parent_id": "t1_gw4bitl", "score": "2", "subreddit": "france", "subreddit_id": "t5_2qhjz"}, {"author": "ArtLangues", "body": "If it's strongly recommended, I will try but I need to know if the following lines are also mandatory:\n\n\\-\"The US is a disgrace after Biden became president, I'm moving to Alaska\"\n\n\\-\"Europeans need to stop obsessing with us and focus on those damn illegal Arabs\"\n\n\\-\"I have a .50 caliber so don't whoa with me there pardner\"", "created_utc": "1619425675.0", "edited": "False", "id": "gvwqiag", "is_submitter": "False", "link_id": "t3_my9l6n", "parent_id": "t1_gvwoqjm", "score": "0", "subreddit": "AmItheAsshole", "subreddit_id": "t5_2xhvq"}, {"author": "ArtLangues", "body": "Is it mandatory based on citizenship or is it skippable?", "created_utc": "1619416284.0", "edited": "False", "id": "gvwfwmb", "is_submitter": "False", "link_id": "t3_my9l6n", "parent_id": "t1_gvwf7b6", "score": "1", "subreddit": "AmItheAsshole", "subreddit_id": "t5_2xhvq"}, {"author": "ArtLangues", "body": "Yes, all 328,000,000+ Americans absolutely behave exactly the same way at all times. ^(/s reddit moment)", "created_utc": "1619396370.0", "edited": "False", "id": "gvvjtc6", "is_submitter": "False", "link_id": "t3_my9l6n", "parent_id": "t1_gvum7c0", "score": "7", "subreddit": "AmItheAsshole", "subreddit_id": "t5_2xhvq"}, {"author": "ArtLangues", "body": "Oh don't worry, it's totally fine that you feel that way! We're just bringing awareness to positive mental health habits as it's often (unfortunately) not portrayed on this sub as much as it should be. Glad to know you're working on it!", "created_utc": "1619329506.0", "edited": "False", "id": "gvsi1jz", "is_submitter": "False", "link_id": "t3_mxxwqz", "parent_id": "t1_gvshnzg", "score": "14", "subreddit": "ApplyingToCollege", "subreddit_id": "t5_2y2r8"}, {"author": "ArtLangues", "body": "Agreed... this kind of thing is basically normalized on this sub and while they're valid for feeling that way, it's just not healthy to compare yourself to everyone constantly and have your feelings hurt when someone goes to a more prestigious school than you, and we don't need to pretend it is. \n\nOP please know your accomplishments on your own are great and don't listen to anyone who tells you they aren't!", "created_utc": "1619327922.0", "edited": "False", "id": "gvsg25d", "is_submitter": "False", "link_id": "t3_mxxwqz", "parent_id": "t1_gvsbdu0", "score": "45", "subreddit": "ApplyingToCollege", "subreddit_id": "t5_2y2r8"}, {"author": "ArtLangues", "body": "In a similar vein, I only applied to schools outside of the US as an American citizen (and committed to one) and I wasn't allowed to take this survey despite being a community member here:(", "created_utc": "1619327592.0", "edited": "False", "id": "gvsfmxy", "is_submitter": "False", "link_id": "t3_mxnel8", "parent_id": "t1_gvsdbtm", "score": "4", "subreddit": "ApplyingToCollege", "subreddit_id": "t5_2y2r8"}, {"author": "ArtLangues", "body": "LOL, fair enough. I applied for housing on Aug. 15th. Seems from the comments here that they won't care since it's that close to the start date anyway. Thanks", "created_utc": "1619004994.0", "edited": "False", "id": "gvb9fsp", "is_submitter": "False", "link_id": "t3_mv21df", "parent_id": "t1_gvb8rml", "score": "1", "subreddit": "IWantOut", "subreddit_id": "t5_2r5hw"}, {"author": "ArtLangues", "body": "Every time I try to email them they give me a vague \"We can't answer your question\"... I sent them one regarding this subject though, so I'll either have to wait for it or take the Internet people's word for it (that this date is supposedly okay as long as it doesn't exceed 3 months before start date of classes)\n\nAll in all, though, I think I will ultimately end up choosing the August 15th date if that is confirmed safe by you guys on the thread here. It also seems to be the only date I can book housing before crossing over with class orientation, so I'm sure the visa agent will understand.", "created_utc": "1618990554.0", "edited": "False", "id": "gvathu9", "is_submitter": "False", "link_id": "t3_mv21df", "parent_id": "t1_gvak0bj", "score": "1", "subreddit": "IWantOut", "subreddit_id": "t5_2r5hw"}, {"author": "ArtLangues", "body": "Hi, thanks for sharing your experience. With my apartment I need to book it for either the 1st or the 15th of a given month. Would August 1st be alright too if I decided on that? Or would that be too early (classes starting 2nd week of September) and get my visa rejected? Glad to know Mid-August is fine as well, just making sure all the options are open.\n\nI'm staying in a private residence, already have it picked out but waiting for a document from my guarantor. I am familiar with APL/CAF but had forgotten to look into it, thanks for the reminder.", "created_utc": "1618982226.0", "edited": "False", "id": "gvajm4p", "is_submitter": "False", "link_id": "t3_mv21df", "parent_id": "t1_gva8q23", "score": "1", "subreddit": "IWantOut", "subreddit_id": "t5_2r5hw"}, {"author": "ArtLangues", "body": "Thanks, would early August be acceptable as well? If only the plane ticket date matters?", "created_utc": "1618963773.0", "edited": "False", "id": "gv9nes2", "is_submitter": "False", "link_id": "t3_mv21df", "parent_id": "t1_gv9mldt", "score": "1", "subreddit": "IWantOut", "subreddit_id": "t5_2r5hw"}, {"author": "ArtLangues", "body": "Ok", "created_utc": "1618803071.0", "edited": "False", "id": "gv1jq7t", "is_submitter": "False", "link_id": "t3_mtnwtj", "parent_id": "t1_gv1hvw6", "score": "2", "subreddit": "Scams", "subreddit_id": "t5_2qrt0"}, {"author": "ArtLangues", "body": "Especially when the \"girl\" you're talking to later admits to being a minor and despite the age of consent in different states, sexting is still illegal... like, at this point I don't feel bad for them for being scammed if they take it further after that piece of knowledge.", "created_utc": "1618796426.0", "edited": "False", "id": "gv18ilp", "is_submitter": "False", "link_id": "t3_mtnwtj", "parent_id": "t1_gv0yh8c", "score": "0", "subreddit": "Scams", "subreddit_id": "t5_2qrt0"}, {"author": "ArtLangues", "body": "I read it like this, someone correct me if I'm wrong:\n\n>How do I eat? I eat like I eat!", "created_utc": "1618701506.0", "edited": "False", "id": "guwvkjs", "is_submitter": "False", "link_id": "t3_mt0ozz", "parent_id": "t3_mt0ozz", "score": "4", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "ArtLangues", "body": "The man. The myth. The legend", "created_utc": "1618283792.0", "edited": "False", "id": "gubyujz", "is_submitter": "True", "link_id": "t3_lc6oxw", "parent_id": "t1_gubozl5", "score": "1", "subreddit": "languagelearningjerk", "subreddit_id": "t5_37rt5"}, {"author": "ArtLangues", "body": "Hmm... why does it seem like we're \"username cousins\" somehow? 😂", "created_utc": "1618086243.0", "edited": "False", "id": "gu2tmt3", "is_submitter": "True", "link_id": "t3_mnpa43", "parent_id": "t1_gu1a1oh", "score": "3", "subreddit": "languagelearningjerk", "subreddit_id": "t5_37rt5"}, {"author": "ArtLangues", "body": "You da man YaleSimp!", "created_utc": "1617835141.0", "edited": "False", "id": "gtqrm64", "is_submitter": "False", "link_id": "t3_mm1k5l", "parent_id": "t1_gtqoaao", "score": "5", "subreddit": "ApplyingToCollege", "subreddit_id": "t5_2y2r8"}, {"author": "ArtLangues", "body": "I didn't even apply to any Ivies I'm just here for Dartmouth Simp", "created_utc": "1617750449.0", "edited": "False", "id": "gtmkfjy", "is_submitter": "False", "link_id": "t3_mloelg", "parent_id": "t3_mloelg", "score": "450", "subreddit": "ApplyingToCollege", "subreddit_id": "t5_2y2r8"}, {"author": "ArtLangues", "body": "The man, the myth, the legend", "created_utc": "1617748319.0", "edited": "False", "id": "gtmg89v", "is_submitter": "False", "link_id": "t3_klcoev", "parent_id": "t1_gtmda6l", "score": "44", "subreddit": "ApplyingToCollege", "subreddit_id": "t5_2y2r8"}, {"author": "ArtLangues", "body": "[According to Campus France, India is one of their served countries,](https://www.campusfrance.org/fr/faq/quels-sont-les-pays-relevant-de-la-procedure-etudes-en-france) so you will need to send your application through the 'Etudes en France' platform. You are allowed to submit your application starting in the November of the year before, though if you haven't taken your B2 French test yet I wouldn't recommend it, as the deadline is usually in the January of the year of starting classes (but you can still modify your application and add test results *after* January with the help of a CF agent)\n\nAs for the Alliance Française part, you would need to take an official France-government approved proficiency exam for French regardless of which classes you take. There are 2 options, the DELF/DALF and the TCF. The TCF is usually in February (which is why people prefer it for their applications), and the DELF/DALF is offered a few times throughout the year depending on where you are. You also need to check the specific level required for your universities because *some* of them require a C1, though most of them (all of the ones I applied to) only require a B2 to enter the first year.\n\nIf you need any more info, feel free to message me!", "created_utc": "1617681788.0", "edited": "False", "id": "gtj8vjf", "is_submitter": "False", "link_id": "t3_mkmwu8", "parent_id": "t1_gtj82a7", "score": "1", "subreddit": "ApplyingToCollege", "subreddit_id": "t5_2y2r8"}, {"author": "ArtLangues", "body": "Depending on your country of origin/your type of diploma, you would apply with either Campus France, Parcoursup, or the blank application (DAP). With CF (my case) and DAP, assuming you're applying for the 22-23 school year, you have until the end of February 2022 or something to get the B2 done. With Parcoursup (for Europeans and those with French bacs) you have longer I believe. Just something to consider for anyone who wants to apply to more schools, an almost free tuition fee depending on which uni, or is interested in an easy way into Europe/France ;) And thanks, you too!", "created_utc": "1617681003.0", "edited": "False", "id": "gtj7lsq", "is_submitter": "False", "link_id": "t3_mkmwu8", "parent_id": "t1_gtj2teq", "score": "1", "subreddit": "ApplyingToCollege", "subreddit_id": "t5_2y2r8"}, {"author": "ArtLangues", "body": "Вы пробовали Anki?", "created_utc": "1617667409.0", "edited": "False", "id": "gtihxw0", "is_submitter": "False", "link_id": "t3_mkyjhk", "parent_id": "t3_mkyjhk", "score": "17", "subreddit": "languagelearningjerk", "subreddit_id": "t5_37rt5"}, {"author": "ArtLangues", "body": "I would prefer Strasbourg due to LEA + European studies + Itl. commerce being more well reputed there as well as being able to easily work in European itl. commerce (a thing Strasbourg is known for of course). Also, despite being Hawaiian, I have been in cold snowy weather before and find it quite lovely (and in my area, we don't get a lot of sun anyway so I'm used to it 🤣) However, if I'm not accepted there, definitely Grenoble as it's also quite nice for language studies. \n\nLyon was my top choice but they did not open for foreign applicants this year unfortunately... I chose not to apply to Paris for now because it's too expensive for me as an American who specifically applied out of country to avoid financial debt 🤣\n\nThank you for the wishes, wishing you success this year during application season!", "created_utc": "1617661117.0", "edited": "False", "id": "gti5mtu", "is_submitter": "False", "link_id": "t3_mkmwu8", "parent_id": "t1_gti4spp", "score": "3", "subreddit": "ApplyingToCollege", "subreddit_id": "t5_2y2r8"}, {"author": "ArtLangues", "body": "I applied to Langues étrangères appliquées at:\n\n\\-Université de Strasbourg\n\n\\-Université de Grenoble Alpes\n\n\\-Université d'Angers\n\nI've been accepted to Angers, but still waiting on Grenoble and Strasbourg.", "created_utc": "1617660510.0", "edited": "False", "id": "gti4epv", "is_submitter": "False", "link_id": "t3_mkmwu8", "parent_id": "t1_gti469m", "score": "2", "subreddit": "ApplyingToCollege", "subreddit_id": "t5_2y2r8"}, {"author": "ArtLangues", "body": "Ahh okay, not sure about Parcoursup as I used Campus France to apply. Our motivation letters have a 1500 character limit (and are in French) and I had to cut like 75% of it out. 😂\n\nI think the ideal length would be somewhere around \\~2500-3000 characters? Personally speaking, that is.", "created_utc": "1617660267.0", "edited": "False", "id": "gti3wzz", "is_submitter": "False", "link_id": "t3_mkmwu8", "parent_id": "t1_gti2w8t", "score": "2", "subreddit": "ApplyingToCollege", "subreddit_id": "t5_2y2r8"}, {"author": "ArtLangues", "body": "Unironically, you and anyone reading should consider it, if you're okay with learning a language. I got accepted to one so far as an American (though the classes are in French and you need to be able to prove you speak it at a B2 level) with a $200 yearly tuition fee. Far better than the $35k-40k per year I would have had to pay just to go out of state", "created_utc": "1617659846.0", "edited": "False", "id": "gti31zg", "is_submitter": "False", "link_id": "t3_mkmwu8", "parent_id": "t1_gtgm7uw", "score": "4", "subreddit": "ApplyingToCollege", "subreddit_id": "t5_2y2r8"}, {"author": "ArtLangues", "body": "Every uni I applied to is in France, but public ones. We got a 1500 *character* limit </3\n\nCan't they find some place in between?", "created_utc": "1617659640.0", "edited": "False", "id": "gti2mvi", "is_submitter": "False", "link_id": "t3_mkmwu8", "parent_id": "t3_mkmwu8", "score": "4", "subreddit": "ApplyingToCollege", "subreddit_id": "t5_2y2r8"}, {"author": "ArtLangues", "body": "I hope this is fake because I really want someone to call CPS on you. This incident is definitely not isolated.", "created_utc": "1617492592.0", "edited": "False", "id": "gtamrsm", "is_submitter": "False", "link_id": "t3_mjbd97", "parent_id": "t1_gta2cgr", "score": "1", "subreddit": "AmItheAsshole", "subreddit_id": "t5_2xhvq"}, {"author": "ArtLangues", "body": "Nice", "created_utc": "1617311021.0", "edited": "False", "id": "gt2onmp", "is_submitter": "False", "link_id": "t3_mhvloo", "parent_id": "t1_gt1yj8g", "score": "2", "subreddit": "ApplyingToCollege", "subreddit_id": "t5_2y2r8"}, {"author": "ArtLangues", "body": "Native Anglophone and speaker of 3 romance languages here. I'm curious on if you'll think the same way when you actually start speaking it and then facepalm yourself into space for accidentally mixing random vocabulary. It seems easy as a very beginner because you can understand things easily, and then it's... not.", "created_utc": "1616920558.0", "edited": "False", "id": "gskbsqu", "is_submitter": "False", "link_id": "t3_mekhxn", "parent_id": "t3_mekhxn", "score": "5", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "ArtLangues", "body": "While it's impressive that you were able to do that, it's definitely not the norm. No 10 year old should be looking after their parents, arranging funerals or sorting their apartments out.", "created_utc": "1616398880.0", "edited": "False", "id": "grsexrh", "is_submitter": "False", "link_id": "t3_mabbgm", "parent_id": "t1_grsejxc", "score": "135", "subreddit": "AmItheAsshole", "subreddit_id": "t5_2xhvq"}, {"author": "ArtLangues", "body": "There is an Italian course for French speakers on Duolingo. I've done it myself, it doesn't have as much vocabulary as the English one though but if you're looking for a supplement it's a good start.", "created_utc": "1616381828.0", "edited": "False", "id": "grrtfya", "is_submitter": "False", "link_id": "t3_ma5mkg", "parent_id": "t3_ma5mkg", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "ArtLangues", "body": "I'm not the person you were replying to but this whole exchange is fuckin hilarious", "created_utc": "1616330623.0", "edited": "False", "id": "grp21ic", "is_submitter": "False", "link_id": "t3_m9l4q4", "parent_id": "t1_grp1pkl", "score": "11", "subreddit": "creepyPMs", "subreddit_id": "t5_2ug83"}, {"author": "ArtLangues", "body": "I'm not voting because no matter what happens, I can tell you right now - do *not* go out with this guy no matter what happens. Trust me, you do not need to know the answer to your question, you just need to stay away from him. I understand you like him, but people who start off their flirting (even if it's not flirting) with the misogynistic number ratings, particularly right in front of your face, and call you *below average* (I'm actually mad reading this) are not worth your time.\n\nIf he does happen to like you, he's negging you to lower your self esteem and therefore standards. Please stay away from him and trust your instinct. \"...a weird way, a way that made me think he'd be controlling if we did date\" says it all.\n\nSincerely, someone who has been here before.", "created_utc": "1616243118.0", "edited": "False", "id": "grl04b2", "is_submitter": "False", "link_id": "t3_m91udk", "parent_id": "t3_m91udk", "score": "7", "subreddit": "Crushes", "subreddit_id": "t5_2udig"}, {"author": "ArtLangues", "body": "Community tutors because I have lessons every day and they're cheaper as a whole. I'm also at a higher level (B2+) in the languages so the most I need is conversation practice, which is what they're there for.", "created_utc": "1616241036.0", "edited": "False", "id": "grkxmnn", "is_submitter": "False", "link_id": "t3_m9259m", "parent_id": "t3_m9259m", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "ArtLangues", "body": "In Hawaii, we call foreigners (almost entirely white people) \"haoles\", which in origin means \"no breath\"", "created_utc": "1616225787.0", "edited": "False", "id": "grkj6uy", "is_submitter": "False", "link_id": "t3_m8y3zd", "parent_id": "t3_m8y3zd", "score": "1", "subreddit": "BlackPeopleTwitter", "subreddit_id": "t5_33x33"}, {"author": "ArtLangues", "body": "LOL NTA. I'm half white, half Filipina and always got \"Mexican/Latina\" in school too. You're not racist for correcting them and not wanting to be seen as a different ethnicity than you are, you'd probably be labeled TA and \"appropriating\" by them if you went along with it and it came out you weren't", "created_utc": "1616110266.0", "edited": "False", "id": "grf7mpe", "is_submitter": "False", "link_id": "t3_m7u408", "parent_id": "t3_m7u408", "score": "1", "subreddit": "AmItheAsshole", "subreddit_id": "t5_2xhvq"}, {"author": "ArtLangues", "body": "The OP responded to other comments but is mysteriously skipping over this one... something's not right here.", "created_utc": "1615869821.0", "edited": "False", "id": "gr3b2zr", "is_submitter": "False", "link_id": "t3_m5s0rl", "parent_id": "t1_gr2vfbt", "score": "54", "subreddit": "ApplyingToCollege", "subreddit_id": "t5_2y2r8"}, {"author": "ArtLangues", "body": "I'm not saying you're lying, but is there something missing in the story here? It feels like some dialogue happened in between when you said you got into UChicago and them calling you toxic, what else took place in the conversation?", "created_utc": "1615855115.0", "edited": "False", "id": "gr2lacm", "is_submitter": "False", "link_id": "t3_m5s0rl", "parent_id": "t3_m5s0rl", "score": "175", "subreddit": "ApplyingToCollege", "subreddit_id": "t5_2y2r8"}, {"author": "ArtLangues", "body": "Learned both. Highly recommend focusing on one first until you get to a B level (B1-B2) and then starting the other one through laddering, learning one through the other. I personally would start with Italian because it's phonetically easy and you're more interested in it.", "created_utc": "1615764995.0", "edited": "False", "id": "gqyj12s", "is_submitter": "False", "link_id": "t3_m508l8", "parent_id": "t3_m508l8", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "ArtLangues", "body": "The age here isn't the issue, it's the fact that he hates reading/has reading difficulties that makes me think P.J. is too advanced for him. I and many of my classmates read Percy Jackson (and DOAWK but that's mostly pictures) in 2nd-3rd grade, it's totally fine for kids at that age who have experience reading.", "created_utc": "1614993145.0", "edited": "False", "id": "gpualpf", "is_submitter": "False", "link_id": "t3_lycv71", "parent_id": "t1_gpsmm7c", "score": "1", "subreddit": "AmItheAsshole", "subreddit_id": "t5_2xhvq"}, {"author": "ArtLangues", "body": "Ti ringrazio per le tue cortesi parole :)\n\nSì, capisco a quali persone ti riferisci e sono d'accordo con te. Quegli italoamericani di cui parli sono fastidiosi, anche se capisco il motivo della loro esistenza. Molte persone non sono consapevoli della mentalità che c'è dietro, quindi spero che quello che ho detto chiarisca il motivo per cui esistono.\n\nCi sono anche molti italo-americani che possono ottenere la cittadinanza italiana con la legge *jus sanguinis*. Sono in procinto di ottenerla io stessa, ma vedere le persone che ottengono un passaporto italiano che non ne parlano nemmeno una parola è molto strano...", "created_utc": "1614915221.0", "edited": "False", "id": "gpqgczr", "is_submitter": "False", "link_id": "t3_lxiapb", "parent_id": "t1_gpq5daw", "score": "2", "subreddit": "languagelearningjerk", "subreddit_id": "t5_37rt5"}, {"author": "ArtLangues", "body": "uj/ Sono una italo-americana di razza mista che parla la lingua (mentre i miei genitori no). Sì, è vero, ma spesso è perché qui negli Stati Uniti, molte persone si vergognano di \"non avere della cultura\", quindi sentono il bisogno di assumere un'altra cultura. Nel mio caso, è solo perché mi piace la lingua e ho intenzione di studiarla all'università (ho fatto l'esame B1 e la prova orale B2), ma ci sono molti americani a cui viene detto dagli europei o da altri americani che non hanno cultura a causa della loro nazionalità e vogliono sentirsi unici. Ironia della sorte, questo li rende meno unici.", "created_utc": "1614908860.0", "edited": "False", "id": "gpq4f8p", "is_submitter": "False", "link_id": "t3_lxiapb", "parent_id": "t1_gpoj5n4", "score": "4", "subreddit": "languagelearningjerk", "subreddit_id": "t5_37rt5"}, {"author": "ArtLangues", "body": "I'm doing Campus France too! (L1) Submitted my app Jan. 8th and still waiting for responses from the unis... :')", "created_utc": "1614758715.0", "edited": "False", "id": "gpihtja", "is_submitter": "False", "link_id": "t3_lvhc4r", "parent_id": "t1_gpc6yny", "score": "1", "subreddit": "French", "subreddit_id": "t5_2rd5t"}, {"author": "ArtLangues", "body": "Salut ! Je suis hawaïenne et je parle couramment français, je t'ai envoyé un message !", "created_utc": "1614737617.0", "edited": "False", "id": "gphl7fp", "is_submitter": "False", "link_id": "t3_lw3oeu", "parent_id": "t3_lw3oeu", "score": "2", "subreddit": "Hawaii", "subreddit_id": "t5_2qi3u"}, {"author": "ArtLangues", "body": "Every uni I applied to is in France. I live in Hawaii. You can probably guess my answer to that :')", "created_utc": "1614667707.0", "edited": "False", "id": "gpe2zht", "is_submitter": "False", "link_id": "t3_lvrzwc", "parent_id": "t3_lvrzwc", "score": "8", "subreddit": "ApplyingToCollege", "subreddit_id": "t5_2y2r8"}, {"author": "ArtLangues", "body": "Glad I'm not the only one who thought this *could* be autism. This guy seems to have trouble with social cues in general... especially after looking at his post history where he told his gf her photo was \"8/10\" and she \"could do better\".", "created_utc": "1614307392.0", "edited": "False", "id": "gosb7py", "is_submitter": "False", "link_id": "t3_lsclsi", "parent_id": "t1_gorheqa", "score": "10", "subreddit": "AmItheAsshole", "subreddit_id": "t5_2xhvq"}, {"author": "ArtLangues", "body": "Korean, they say the N word all the time", "created_utc": "1614222768.0", "edited": "False", "id": "gonwoj8", "is_submitter": "False", "link_id": "t3_lrttjk", "parent_id": "t3_lrttjk", "score": "47", "subreddit": "languagelearningjerk", "subreddit_id": "t5_37rt5"}, {"author": "ArtLangues", "body": "> So yeah, I’d just like to see if you think taking a gap year is positive thing.\n\nWhile I had no choice but to take a gap year, I still don't think it was wasted time by any means, even if it was during a pandemic. It gives you an extra year to strengthen your extracurriculars/experiences for college applications which gives you a head start over other candidates and also allows for more personal maturity to happen before the college experience (which is something many incoming freshmen lack). And you are right that I did have far more time to pursue the things I was interested in. :)\n\nIf you take a gap year, I would also really suggest getting a full time job and making a college fund for yourself, loans are no fun. Also potentially look into travel (*only* if you have the financial means to do so and it's safe, after covid), not only do colleges absolutely love that experience, it's also really good for you and your open-mindedness as well as culturally.", "created_utc": "1614130480.0", "edited": "False", "id": "goj7lqb", "is_submitter": "False", "link_id": "t3_lqu9mb", "parent_id": "t1_goixf77", "score": "3", "subreddit": "ApplyingToCollege", "subreddit_id": "t5_2y2r8"}, {"author": "ArtLangues", "body": "17 y/o taking a gap year as a C/O 2020 in one of the worst hit countries in the world during the pandemic, so can't work or do anything. Had no choice as I graduated at 16 (almost 17) and am planning on going to uni in France (I'm American), so needed to wait the extra year to be 18 to move internationally.\n\nSince my application deadlines were in January for France, I did a *lot* of (online, covid) extracurriculars that were related to my program of choice and ultimately made my application very strong because of it. I also take 5+ hours a week of advanced level French classes since the universities in France obviously teach their classes in French.\n\nI took all of this extra time to also write my uni resume and essays over and over again over the course of months. I also had to travel to take an Italian proficiency test as my program includes both classes in French and Italian and I only had a certificate certifying my French, yet both certificates are a requirement.\n\nI also got my TEFL teaching certificate via an online program as well as 20+ other certificates in various subjects such as management, business, marketing etc. \n\nI live in a very rural place so there were no opportunities for me to work or volunteer during the pandemic. Online extracurriculars were where it's at. Post-application, I'm now spending most of my time learning French, because you can never over-prepare for your future program.", "created_utc": "1614120485.0", "edited": "False", "id": "goinkww", "is_submitter": "False", "link_id": "t3_lqu9mb", "parent_id": "t3_lqu9mb", "score": "6", "subreddit": "ApplyingToCollege", "subreddit_id": "t5_2y2r8"}, {"author": "ArtLangues", "body": "This looks like the person made a bunch of typos in English when putting it into GT and the translation reflected it.\n\nJ'ai couru dans cette adolescence = I ran into this teenage (instead of teenager)\n\nje demande juste vous êtes à New York = I'm just asking you're in New York (they left out the \"if\")", "created_utc": "1613963149.0", "edited": "False", "id": "goat0fu", "is_submitter": "True", "link_id": "t3_lop3zz", "parent_id": "t1_goa6my9", "score": "4", "subreddit": "languagelearningjerk", "subreddit_id": "t5_37rt5"}, {"author": "ArtLangues", "body": "Was going to say N A H, now going with YTA because those edits make you look like a seriously obnoxious, highly-strung dude. Don't post on this subreddit if you don't want honest opinions sweetie :)", "created_utc": "1613946057.0", "edited": "False", "id": "go9w0ka", "is_submitter": "False", "link_id": "t3_lowe8u", "parent_id": "t3_lowe8u", "score": "1", "subreddit": "AmItheAsshole", "subreddit_id": "t5_2xhvq"}, {"author": "ArtLangues", "body": "/uj this is possibly the worst French I've ever seen", "created_utc": "1613882311.0", "edited": "False", "id": "go71mv8", "is_submitter": "True", "link_id": "t3_lop3zz", "parent_id": "t3_lop3zz", "score": "148", "subreddit": "languagelearningjerk", "subreddit_id": "t5_37rt5"}, {"author": "ArtLangues", "body": "\"They don't even know I went to a T20... 😏😢\"", "created_utc": "1613862158.0", "edited": "False", "id": "go61qcp", "is_submitter": "False", "link_id": "t3_logto6", "parent_id": "t1_go60xlh", "score": "88", "subreddit": "ApplyingToCollege", "subreddit_id": "t5_2y2r8"}, {"author": "ArtLangues", "body": "Whoa whoa, don't even insinuate that non-STEM people can dedicate their life to something, earn scholarships and succeed in college admissions, this ain't the sub for this\n\n/s because there are plenty of people here who would probably upvote this unironically", "created_utc": "1613861919.0", "edited": "False", "id": "go61a0w", "is_submitter": "False", "link_id": "t3_lofjq0", "parent_id": "t3_lofjq0", "score": "50", "subreddit": "ApplyingToCollege", "subreddit_id": "t5_2y2r8"}, {"author": "ArtLangues", "body": "Absolutely, and I am immature as well ;) Aren't we all at this age?", "created_utc": "1613861346.0", "edited": "False", "id": "go606w0", "is_submitter": "False", "link_id": "t3_logto6", "parent_id": "t1_go5wvur", "score": "40", "subreddit": "ApplyingToCollege", "subreddit_id": "t5_2y2r8"}, {"author": "ArtLangues", "body": "Yep. This is how you can tell this sub is composed of immature teens (unsurprisingly, we're talking college admissions). There is a certain degree of maturity that you should have to be admitted into/succeed in such schools and on this sub it really seems like most people aren't ready for that.\n\nWhy be successful and lonely when you can be successful and not so full of yourself that you push everyone in your life away?", "created_utc": "1613858933.0", "edited": "False", "id": "go5vn4v", "is_submitter": "False", "link_id": "t3_logto6", "parent_id": "t1_go5rij5", "score": "50", "subreddit": "ApplyingToCollege", "subreddit_id": "t5_2y2r8"}, {"author": "ArtLangues", "body": "One of these:\n\n>A **cabinet** can be defined as a storage unit that is either separate or built into a wall. A **cupboard**, on the other hand, refers to an enclosed storage space fitted with a door and is usually fitted with shelves. The cupboard is usually used to store food, cookery, and other unsightly things the owner does not want to expose.  \n>  \n>A cabinet is usually used to refer to a storage unit while a cupboard is used to specifically display plates, cups, and other flatware using doors with glass panes.Also, a cabinet can be multipurpose and can be used to store other things like pots and pans in lower shelves beneath a countertop.  \n>  \n>Cabinets are made with shelves while cupboards do not need removable shelves. They are made with glass pane doors.\n\n[Source](http://www.differencebetween.net/miscellaneous/difference-between-a-cabinet-and-cupboard/)", "created_utc": "1613718789.0", "edited": "False", "id": "gnzeokn", "is_submitter": "False", "link_id": "t3_lmyzdc", "parent_id": "t3_lmyzdc", "score": "4", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "ArtLangues", "body": "99.5% (3.98) UW here, was *not* in the top 10%. The US is fucked", "created_utc": "1613696625.0", "edited": "False", "id": "gnydm17", "is_submitter": "False", "link_id": "t3_lmqd5c", "parent_id": "t1_gnwkfgm", "score": "5", "subreddit": "ApplyingToCollege", "subreddit_id": "t5_2y2r8"}, {"author": "ArtLangues", "body": "Yo I applied to directly to colleges in France too! You doing Campus France?", "created_utc": "1613688279.0", "edited": "False", "id": "gnxwstt", "is_submitter": "False", "link_id": "t3_lmsgf8", "parent_id": "t3_lmsgf8", "score": "1", "subreddit": "ApplyingToCollege", "subreddit_id": "t5_2y2r8"}, {"author": "ArtLangues", "body": "Hehe I definitely don't know who you are, nope ;);)\n\nAlright, looks like I'll wait until Friday for a response; if not, I'll go right to the director and politely ask for a confirmation on what's going on.", "created_utc": "1613614753.0", "edited": "False", "id": "gnu8l0s", "is_submitter": "True", "link_id": "t3_lma0bq", "parent_id": "t1_gnu4cdn", "score": "3", "subreddit": "ApplyingToCollege", "subreddit_id": "t5_2y2r8"}, {"author": "ArtLangues", "body": "I remember this girl. She was the one who said she speaks Hawaiian and to my Hawaiian ears, it was something like \"hello to oh-ey Hawaiian student\" Notice they left it out of this one...", "created_utc": "1613593980.0", "edited": "False", "id": "gnszs3r", "is_submitter": "False", "link_id": "t3_lloks8", "parent_id": "t3_lloks8", "score": "4", "subreddit": "languagelearningjerk", "subreddit_id": "t5_37rt5"}, {"author": "ArtLangues", "body": "Yes, for a simple placement test, $30 is not all bad as opposed to a $300 test; however, depends on what skills you need to know your level for. I have also taken the Evalang, which evaluates oral comprehension, reading comprehension, and grammar/vocab, which is available via the Alliance Française de Seattle for $20. You could also take online placement tests for free, though beware that they may not be all that accurate.", "created_utc": "1613590506.0", "edited": "False", "id": "gnsryk1", "is_submitter": "False", "link_id": "t3_llfg84", "parent_id": "t1_gnsg153", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "ArtLangues", "body": "Seconding this \\^ deodorant also seems far more effective with shaven pits", "created_utc": "1613551446.0", "edited": "False", "id": "gnqwjhp", "is_submitter": "False", "link_id": "t3_lln62k", "parent_id": "t1_gnqwd2u", "score": "3", "subreddit": "relationships", "subreddit_id": "t5_2qjvn"}, {"author": "ArtLangues", "body": "I see. Thanks for the recommendations :)", "created_utc": "1613543742.0", "edited": "False", "id": "gnqn6g2", "is_submitter": "False", "link_id": "t3_llm769", "parent_id": "t1_gnqm68d", "score": "1", "subreddit": "Pescetarian", "subreddit_id": "t5_2s6sd"}, {"author": "ArtLangues", "body": "Ah, I hadn't heard about that! Is opah the same as moonfish? Do you have experience with cooking opah?\n\nI'm checking the video out right now, looks very interesting, might have to give it a try. I will also have to make sure I'll have these ingredients in Europe. Thank you :)", "created_utc": "1613542457.0", "edited": "False", "id": "gnqlbw2", "is_submitter": "False", "link_id": "t3_llm769", "parent_id": "t1_gnqg91s", "score": "1", "subreddit": "Pescetarian", "subreddit_id": "t5_2s6sd"}, {"author": "ArtLangues", "body": "As an American planning on moving to France this year, I thought I should say to the French people that I do not want them thinking condescending Trump supporters like this guy make up all of us, thank you :)", "created_utc": "1613533864.0", "edited": "False", "id": "gnq6vfm", "is_submitter": "False", "link_id": "t3_lljjj7", "parent_id": "t3_lljjj7", "score": "2", "subreddit": "French", "subreddit_id": "t5_2rd5t"}, {"author": "ArtLangues", "body": "I took it. Got a C1 overall in French but a \"B1-B2\" in speaking, reason being that there's a section where you have to repeat what was just said and I have a hard time remembering *exactly* what was said word-for-word after a sentence is longer than 4 seconds or so. As the other commenter said, I'm skeptical because there's a robot grading it as well, and this could be affected by a lot of factors such as mic quality etc.", "created_utc": "1613529907.0", "edited": "False", "id": "gnpzkmv", "is_submitter": "False", "link_id": "t3_llfg84", "parent_id": "t3_llfg84", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "ArtLangues", "body": "NTA I loathe the overall DSMP standom myself, but your bf is being ridiculous and overexaggerating. We all have our things that send us into rants but it's a matter of doing it to/in front of the right audience. He can hate DSMP if he wants, but he should know it's not going to get a great reception from a fan of it.", "created_utc": "1613509696.0", "edited": "False", "id": "gnoujpy", "is_submitter": "False", "link_id": "t3_ll25k5", "parent_id": "t3_ll25k5", "score": "2", "subreddit": "AmItheAsshole", "subreddit_id": "t5_2xhvq"}, {"author": "ArtLangues", "body": "This is probably the 5th language subreddit I follow that I've seen you post in, how does it feel to be famous?", "created_utc": "1613368588.0", "edited": "False", "id": "gnibayb", "is_submitter": "False", "link_id": "t3_lk1fd4", "parent_id": "t1_gnhgnfj", "score": "5", "subreddit": "languagelearningjerk", "subreddit_id": "t5_37rt5"}, {"author": "ArtLangues", "body": "Avid Italki user here (TBF for classes, not so much the forums) it really seems like most users on there are American, especially after looking at every teacher's reviews. I was surprised to see so many of them in the \"language challenge\" ranks. Could it be the fact that it's so affordable in our currency? Hmm...", "created_utc": "1613338662.0", "edited": "False", "id": "gngvt8v", "is_submitter": "False", "link_id": "t3_ljq0bu", "parent_id": "t3_ljq0bu", "score": "8", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "ArtLangues", "body": " /uj Hawaiian here, \"studied\" it for 7 years in school and am probably not even A1, can confirm you cannot learn it in one day", "created_utc": "1613198403.0", "edited": "False", "id": "gn5d1eu", "is_submitter": "False", "link_id": "t3_liqyd5", "parent_id": "t1_gn4zqnb", "score": "19", "subreddit": "languagelearningjerk", "subreddit_id": "t5_37rt5"}, {"author": "ArtLangues", "body": "This question has come up a lot over the years in the forums I follow; I speak Spanish at a pretty okay C1 level on a good day, and from my experience, many (not all) Spanish speakers have the tendency to think, and specifically say, their native language is the most difficult in the world for anyone to learn... like they could possibly know. However, ironically being only my second language, knowing 4 total, Spanish was by *far* the easiest.\n\nWhich is why at first glance, I thought OP was a native trying to get confirmation on his opinion (especially after the weird grammar in the title), but turns out he's English... he could have seen Spanish speakers say something like that and then wonder.", "created_utc": "1613184540.0", "edited": "False", "id": "gn4ro1p", "is_submitter": "False", "link_id": "t3_liozk2", "parent_id": "t1_gn4ecly", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "ArtLangues", "body": "I see. Thank you for taking the time to give this info, I will keep this in mind!", "created_utc": "1613075895.0", "edited": "False", "id": "gmzblt4", "is_submitter": "False", "link_id": "t3_lhgpbo", "parent_id": "t1_gmx8v1a", "score": "1", "subreddit": "IWantOut", "subreddit_id": "t5_2r5hw"}, {"author": "ArtLangues", "body": "I'm understanding it now, thank you for the easily readable post since I get kinda lost on legal stuff!", "created_utc": "1613037642.0", "edited": "False", "id": "gmx8o0p", "is_submitter": "False", "link_id": "t3_lhgpbo", "parent_id": "t1_gmx71vr", "score": "1", "subreddit": "IWantOut", "subreddit_id": "t5_2r5hw"}, {"author": "ArtLangues", "body": "I see, so you need to get a job after the 1 year job seeker visa (+ master's degree) in order for the reduced time to count? And be there for at least a year after the job seeker visa is done?", "created_utc": "1613037518.0", "edited": "False", "id": "gmx8jax", "is_submitter": "False", "link_id": "t3_lhgpbo", "parent_id": "t1_gmx75bx", "score": "1", "subreddit": "IWantOut", "subreddit_id": "t5_2r5hw"}, {"author": "ArtLangues", "body": "Hey, thanks for your detailed answer, would you happen to have a source where I can look at these laws that state this information so I can use it as a reference and read it over? The information in the article said people who obtain a licence can naturalize, so I want to see what the French law says about it, so I'm wondering where their information got conflicted somewhere...", "created_utc": "1613035834.0", "edited": "False", "id": "gmx6qrt", "is_submitter": "False", "link_id": "t3_lhgpbo", "parent_id": "t1_gmx5hm2", "score": "1", "subreddit": "IWantOut", "subreddit_id": "t5_2r5hw"}, {"author": "ArtLangues", "body": "[https://naturalisation-francaise.fr/2018/09/11/comprendre-la-regle-sur-la-duree/](https://naturalisation-francaise.fr/2018/09/11/comprendre-la-regle-sur-la-duree/)\n\n>Nul ne peut être naturalisé par décret s’il n’a pas établit sans  résidence légale en France depuis 5 ans, cela s’appelle la durée de  stage.  \n>  \n>**La durée de stage peut être réduite à 2 ans si :**  \n>  \n>Vous avez suivi 2 ans d’études  accomplies avec succès pour obtenir un diplôme d’un établissement  d’enseignement supérieur français. La loi est claire : “2 années  d’études supérieures menant à un diplôme”. C’est par exemple faire un L2  et L3, un BTS, un M1 et M2, etc … Ils ont le droit de vous refuser la  réduction de durée de stage si vous avez fait 2 M2, ou L3 et M1, ou  Master Spé, etc … (Cf. Les étudiants et la naturalisation)", "created_utc": "1613031160.0", "edited": "False", "id": "gmx1qa5", "is_submitter": "False", "link_id": "t3_lh9hon", "parent_id": "t1_gmx1cxl", "score": "2", "subreddit": "IWantOut", "subreddit_id": "t5_2r5hw"}, {"author": "ArtLangues", "body": "Zero, the YT polyglots warned me that studying a language is ineffective, I ain't no sucker", "created_utc": "1612896200.0", "edited": "False", "id": "gmq60mm", "is_submitter": "False", "link_id": "t3_lg7hg5", "parent_id": "t3_lg7hg5", "score": "20", "subreddit": "languagelearningjerk", "subreddit_id": "t5_37rt5"}, {"author": "ArtLangues", "body": "Y i k e s. I thought you were an adult woman, that's even worse", "created_utc": "1612847693.0", "edited": "False", "id": "gmo1lrq", "is_submitter": "False", "link_id": "t3_lfnxga", "parent_id": "t1_gmnve3a", "score": "124", "subreddit": "creepyPMs", "subreddit_id": "t5_2ug83"}, {"author": "ArtLangues", "body": "I specifically came here to see if someone posted it, was not disappointed", "created_utc": "1612759593.0", "edited": "False", "id": "gmjtps5", "is_submitter": "False", "link_id": "t3_lf289u", "parent_id": "t1_gmjq005", "score": "11", "subreddit": "languagelearningjerk", "subreddit_id": "t5_37rt5"}, {"author": "ArtLangues", "body": "Moving to France :) I got my DELF B2 at age 16 in late 2019, which was excellent timing due to the pandemic, because that was the requirement to be able to study in university in France in a program that's only taught in French. I plan to get my bachelor's in Langues étrangères appliquées Anglais-Italien.\n\nI definitely feel what you're saying here, because when I was a little kid, my parents taught me some basic Italian, but we started learning Spanish at school and I completely confused both of them.\n\nWhat country are you from?", "created_utc": "1612740198.0", "edited": "False", "id": "gmitdid", "is_submitter": "False", "link_id": "t3_led0ai", "parent_id": "t1_gmij4wk", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "ArtLangues", "body": "This is kind of contradictory because you said:\n\n> he continues because he has to. He loves you so he wants to do what makes you feel good \n\nAnd then you said:\n\n> didn't mean to imply anything about him \n\nIf you want to talk about yourself as an example, then you should speak for yourself, rather speaking for someone else using \"*he* does this because *he* needs that\" language. That's likely why you're getting so many downvotes.", "created_utc": "1612732359.0", "edited": "False", "id": "gmiajrw", "is_submitter": "False", "link_id": "t3_lemcia", "parent_id": "t1_gmget7q", "score": "54", "subreddit": "relationship_advice", "subreddit_id": "t5_2r0cn"}, {"author": "ArtLangues", "body": "Thank you, really appreciate it :) it has been quite the ride, haha! I am moving to Europe this year for first-year university so none of the effort will go to waste!", "created_utc": "1612729550.0", "edited": "False", "id": "gmi1fiq", "is_submitter": "False", "link_id": "t3_led0ai", "parent_id": "t1_gmgjl8f", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "ArtLangues", "body": "From my experience, this is quite common in Spanish-speaking circles, I haven't experienced the same thing with French or Italian. They are a lot harder on us, particularly if we're native English speakers. I'm at a \\~C1 level in Spanish (haven't spoken in a while, though) and when I was learning, it was hard to actually find *supportive* natives because I kept being told stuff like \"Americans can't learn Spanish\" or \"You can try but people from your country are bad at everything related to languages, soooo...\"\n\nI understand that it is due to bitterness for receiving similar treatment from the opposite end, and I really feel for them, but it does not make the action better IMO.  In my experience, many (not all) native Spanish speakers also believe that their own language is the most difficult one in the world, and have said it to my face as a reason why I and nobody else will ever learn their language.\n\nThere is a certain irony to talking down to people for trying to speak your language and then later complaining that they're filthy monolinguals, and this goes for both sides.", "created_utc": "1612683884.0", "edited": "False", "id": "gmd3tva", "is_submitter": "False", "link_id": "t3_led0ai", "parent_id": "t3_led0ai", "score": "14", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "ArtLangues", "body": "I saw both the French and Italian ones; when he threw \"estoy\" into Italian multiple times... ~~I felt that~~", "created_utc": "1612675615.0", "edited": "False", "id": "gmcil7r", "is_submitter": "False", "link_id": "t3_le4uym", "parent_id": "t1_gm9qsfw", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "ArtLangues", "body": ">That said, I don't want to hire a tutor for $35-50 an hour right now.\n\nIf you're still looking for 1-on-1 tutoring, Italki. Community tutors can be anywhere between $8-$15 an hour, and professional teachers can be around $18+ an hour.\n\n>I'd like a more conventional class if possible.\n\nTry looking into Alliance Française or Coucou, both of which have taken their courses online during the pandemic. They are through Zoom and you will have classmates. A little more expensive than Italki tutoring, though.", "created_utc": "1612666771.0", "edited": "False", "id": "gmbthay", "is_submitter": "False", "link_id": "t3_ldjutb", "parent_id": "t3_ldjutb", "score": "1", "subreddit": "French", "subreddit_id": "t5_2rd5t"}, {"author": "ArtLangues", "body": "I followed it up with \"there should be children's level books there ***as well****,*\" meaning I recognized that it wasn't a kindergarten level book but the website should have smaller kid's books as well as higher level books.", "created_utc": "1612643930.0", "edited": "False", "id": "gm9qltt", "is_submitter": "False", "link_id": "t3_ldemh0", "parent_id": "t1_gm8vzdp", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "ArtLangues", "body": ">kindergarten level books \n\nI assumed by this that he meant books children at that age use to learn Hawaiian. As a Hawaiian, the ones on that list were the ones I've seen children use to learn, you're not going to typically find any normal children's text books in Hawaiian at least", "created_utc": "1612561507.0", "edited": "False", "id": "gm5xuzo", "is_submitter": "False", "link_id": "t3_ldemh0", "parent_id": "t1_gm5vejj", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "ArtLangues", "body": "I have *Harry Potter a me ka Pōhaku Akeakamai* and *Ke Keiki Ali'i Li'ili'i* from Amazon, there should be some children's level books there as well, but usually they're bilingual (English/Hawaiian). [Here's a local business which has children's books in Hawaiian.](https://www.talkstorybookstore.com/books-in-hawaiian-language)", "created_utc": "1612556350.0", "edited": "False", "id": "gm5mig6", "is_submitter": "False", "link_id": "t3_ldemh0", "parent_id": "t3_ldemh0", "score": "12", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "ArtLangues", "body": "I'm this kid's age, I rebuffed my parents' attempts to teach me a language as a kid and I have now self-learned it to early B2 and plan to study it at university this year. His whole post is just so insufferable I hope it's a troll", "created_utc": "1612414913.0", "edited": "False", "id": "glydelm", "is_submitter": "True", "link_id": "t3_lc6oxw", "parent_id": "t1_gly5qkp", "score": "33", "subreddit": "languagelearningjerk", "subreddit_id": "t5_37rt5"}, {"author": "ArtLangues", "body": ">tabloid headline about how her generation would be the first to outlive their kids \n\nI remember I had a middle school substitute boomer teacher who used this exact same article to scare us into being healthier (nobody in my class was obese or even looked overweight). The school got a lot of complaints about him.\n\nSorry about your situation BTW.", "created_utc": "1612386480.0", "edited": "False", "id": "glwqp7g", "is_submitter": "False", "link_id": "t3_lbjvei", "parent_id": "t1_gluqksr", "score": "9", "subreddit": "AmItheAsshole", "subreddit_id": "t5_2xhvq"}, {"author": "ArtLangues", "body": "Je t'ai envoyé un message privé ! \\^\\^", "created_utc": "1612342184.0", "edited": "False", "id": "glubtmx", "is_submitter": "False", "link_id": "t3_lb8o33", "parent_id": "t3_lb8o33", "score": "1", "subreddit": "language_exchange", "subreddit_id": "t5_2tdbm"}, {"author": "ArtLangues", "body": "As someone who's lived in HI, CA, and Phoenix AZ, Phoenix is the absolute worst with walkability, like you said, and you will need a car to get *anywhere,* even to the grocery store. If not having a car is important to you I would highly reconsider Phoenix.\n\nCA (and HI, not that you were considering it) are completely out of the question due to cost, you'd be lucky to get anything at $1200 without a couple of roommates and that's not including how expensive everything else is.\n\nI agree with the other commenter that you should look into Colorado (especially Denver), unfortunately in the US good cost of living and walkability tend not to be in the same ballpark so be prepared to make some sacrifices on your list, but you seem to have that down already :)", "created_utc": "1612215897.0", "edited": "False", "id": "glnk1za", "is_submitter": "False", "link_id": "t3_l9wmao", "parent_id": "t3_l9wmao", "score": "3", "subreddit": "IWantOut", "subreddit_id": "t5_2r5hw"}, {"author": "ArtLangues", "body": "I just bought a 4 colored pen after reading your comment, will give it a try :)", "created_utc": "1611808161.0", "edited": "False", "id": "gl1rpvw", "is_submitter": "False", "link_id": "t3_l6cww9", "parent_id": "t1_gl140t5", "score": "2", "subreddit": "AmItheAsshole", "subreddit_id": "t5_2xhvq"}, {"author": "ArtLangues", "body": "YTA, those edits are *awful*", "created_utc": "1611710594.0", "edited": "False", "id": "gkw8t96", "is_submitter": "False", "link_id": "t3_l55s9u", "parent_id": "t3_l55s9u", "score": "3", "subreddit": "AmItheAsshole", "subreddit_id": "t5_2xhvq"}, {"author": "ArtLangues", "body": "I'm starting to think r/languagelearning is conspiring to outjerk us and we're in a silent, unspoken battle with them.\n\nThe best part was this gem:\n\n>I don't know anything about German. I learned English this way too. I just translate every word I see and try to make sense of it.", "created_utc": "1611697625.0", "edited": "False", "id": "gkvgxkb", "is_submitter": "False", "link_id": "t3_l4z6de", "parent_id": "t3_l4z6de", "score": "3", "subreddit": "languagelearningjerk", "subreddit_id": "t5_37rt5"}, {"author": "ArtLangues", "body": "Make a video called \"I learned to speak French in 12 hours\", do it in every other language when you're done with that one, and show us your Italki lessons or it never happened. Remember to accidentally mix Spanish in with every other language when you're done", "created_utc": "1611697272.0", "edited": "False", "id": "gkvg1tu", "is_submitter": "False", "link_id": "t3_l5ncso", "parent_id": "t3_l5ncso", "score": "19", "subreddit": "languagelearningjerk", "subreddit_id": "t5_37rt5"}, {"author": "ArtLangues", "body": "Pero ¿has probado Anki?", "created_utc": "1611650684.0", "edited": "False", "id": "gkt0rkj", "is_submitter": "False", "link_id": "t3_l505hi", "parent_id": "t3_l505hi", "score": "8", "subreddit": "languagelearningjerk", "subreddit_id": "t5_37rt5"}, {"author": "ArtLangues", "body": "\"If women don't want creepy messages they shouldn't be on these types of social media. They're just asking for it at that point.\"\n\nThe sites:", "created_utc": "1611622028.0", "edited": "False", "id": "gkrspqw", "is_submitter": "False", "link_id": "t3_l4r35e", "parent_id": "t3_l4r35e", "score": "22", "subreddit": "creepyPMs", "subreddit_id": "t5_2ug83"}, {"author": "ArtLangues", "body": "There's an obvious form of elitism in this sub that's not exactly being concealed. What's funny is that many people here who brag about their stats and applying to a certain T20 will *completely* disappear after admissions day comes. There was the post about how admissions rates aren't lotteries, and I thought it was genius because a lot of people here think that by paying the app fee they're entering a lottery to get in.\n\nRandom note, I wish this sub weren't so American centric; I can't find any international A2C counterparts for those of us who aren't applying to US colleges.", "created_utc": "1611359772.0", "edited": "False", "id": "gk9ewem", "is_submitter": "False", "link_id": "t3_l2eyl1", "parent_id": "t3_l2eyl1", "score": "6", "subreddit": "ApplyingToCollege", "subreddit_id": "t5_2y2r8"}, {"author": "ArtLangues", "body": "Damn, first the \"ugly languages\" thread and now this. Even the Xiaoma thread was on par with r/LLJ", "created_utc": "1611344951.0", "edited": "False", "id": "gk89okw", "is_submitter": "False", "link_id": "t3_l2uje1", "parent_id": "t1_gk83dze", "score": "7", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "ArtLangues", "body": "Piggybacking on what the other person replied with, my school required nearly *300* hours and while it looked *really* good on college apps I felt horrible for those who actually had jobs and had to do an extra 300 hours of work for free. But under our system, fake work was easily disprovable because the organization had to be a confirmed non-profit with no familial ties and easily reachable by phone, not sure why most places won't implement something similar.", "created_utc": "1611266116.0", "edited": "False", "id": "gk3x7dm", "is_submitter": "False", "link_id": "t3_l1ydsw", "parent_id": "t1_gk2iluk", "score": "8", "subreddit": "ApplyingToCollege", "subreddit_id": "t5_2y2r8"}, {"author": "ArtLangues", "body": "I don't seem to have any side effects other than wacky nightmares (just last night I had one where I was avoiding hitmen in Iraq, wtf?) but I've read that melatonin might be bad for the long term and has been used for up to 2 years safely by people, in which case I would have to wean off of it eventually which seems impossible for me. \n\nI think my major problem is that I can't stop obsessively thinking at night and should probably get diagnosed with something, but for now I'm sticking with my melatonin :')", "created_utc": "1611222524.0", "edited": "False", "id": "gk1ov7x", "is_submitter": "True", "link_id": "t3_l1utx5", "parent_id": "t1_gk1mx3z", "score": "3", "subreddit": "BedBros", "subreddit_id": "t5_1b376p"}, {"author": "ArtLangues", "body": "Don't know what level your course needs to be, but [Greenways Academy is accredited by the WASC for high school level languages.](https://www.greenwaysacademy.com/product-page/hindi-levels-1-3?page=3) Independent adults can also be enrolled. However, all of the language coursework is through Rosetta Stone. I used them for a language that wasn't offered by my high school but was needed to get into a university program, worth checking out.\n\nEdit: sorry, wrong link", "created_utc": "1611180822.0", "edited": "False", "id": "gjztgs9", "is_submitter": "False", "link_id": "t3_l1hbnc", "parent_id": "t3_l1hbnc", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "ArtLangues", "body": "[MO distribution centers seem to be having a problem, anyone know what's going on?](https://imgur.com/a/xMDqMUV)", "created_utc": "1611125210.0", "edited": "False", "id": "gjx5uds", "is_submitter": "False", "link_id": "t3_l0o005", "parent_id": "t3_l0o005", "score": "1", "subreddit": "usps_complaints", "subreddit_id": "t5_3clrz"}, {"author": "ArtLangues", "body": "American applying internationally here, have to wait til April. Think I might just freeze myself like Cartman when he wanted the Nintendo Wii", "created_utc": "1611087758.0", "edited": "False", "id": "gjv9050", "is_submitter": "False", "link_id": "t3_l0leyo", "parent_id": "t3_l0leyo", "score": "5", "subreddit": "ApplyingToCollege", "subreddit_id": "t5_2y2r8"}, {"author": "ArtLangues", "body": "[Removeddit link](https://www.removeddit.com/r/languagelearning/comments/l062u3/what_is_the_ugliest_sounding_language_to_you/)", "created_utc": "1611083999.0", "edited": "False", "id": "gjv0pu6", "is_submitter": "True", "link_id": "t3_l07c2y", "parent_id": "t1_gjtpjfp", "score": "8", "subreddit": "languagelearningjerk", "subreddit_id": "t5_37rt5"}, {"author": "ArtLangues", "body": "Same, but 2 oceans! 8000km", "created_utc": "1611037448.0", "edited": "False", "id": "gjszuva", "is_submitter": "False", "link_id": "t3_kzytsz", "parent_id": "t1_gjrzesg", "score": "2", "subreddit": "ApplyingToCollege", "subreddit_id": "t5_2y2r8"}, {"author": "ArtLangues", "body": "NTA, this is seriously *so* irritating as someone who's been accused of wearing makeup for men... by men\n\nThank you for standing up for your wife", "created_utc": "1611029178.0", "edited": "False", "id": "gjsncq0", "is_submitter": "False", "link_id": "t3_l05log", "parent_id": "t3_l05log", "score": "3", "subreddit": "AmItheAsshole", "subreddit_id": "t5_2xhvq"}, {"author": "ArtLangues", "body": "Wait I thought this was r/languagelearningjerk and was about to upvote it lmao\n\nEdit: I did the honors", "created_utc": "1611014499.0", "edited": "False", "id": "gjrvxuz", "is_submitter": "False", "link_id": "t3_l062u3", "parent_id": "t3_l062u3", "score": "28", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "ArtLangues", "body": "\"You are such a fucking person\"\n\nOh shit he did not just go there. Oh fuck what did you do to deserve that one", "created_utc": "1610925616.0", "edited": "False", "id": "gjnul01", "is_submitter": "False", "link_id": "t3_kz58xe", "parent_id": "t1_gjkmthv", "score": "37", "subreddit": "creepyPMs", "subreddit_id": "t5_2ug83"}, {"author": "ArtLangues", "body": "I thought u were glod girl :'(", "created_utc": "1610925579.0", "edited": "False", "id": "gjnuiei", "is_submitter": "False", "link_id": "t3_kz58xe", "parent_id": "t3_kz58xe", "score": "15", "subreddit": "creepyPMs", "subreddit_id": "t5_2ug83"}, {"author": "ArtLangues", "body": "Wtf? Are there actually guys who think we like these kinds of messages? Is it because guys want to receive these kinds of messages from women so they think it works the same the other way around? I am genuinely curious", "created_utc": "1610876821.0", "edited": "False", "id": "gjk90dq", "is_submitter": "False", "link_id": "t3_ky8m6b", "parent_id": "t3_ky8m6b", "score": "5", "subreddit": "creepyPMs", "subreddit_id": "t5_2ug83"}, {"author": "ArtLangues", "body": "NTA, sounds like the type of guy who also thinks women are out to steal his money", "created_utc": "1610770238.0", "edited": "False", "id": "gjf62y7", "is_submitter": "False", "link_id": "t3_kxryaq", "parent_id": "t3_kxryaq", "score": "1", "subreddit": "AmItheAsshole", "subreddit_id": "t5_2xhvq"}, {"author": "ArtLangues", "body": "I guess this is an agree to disagree conversation, because I know what I have experienced with those who have had little to no formal education, and am aware of what conversational difficulties they have had at the oral level. You would be surprised at how some people can't even understand words like \"deforestation\", a word that was used by the test takers in the video you sent. \n\nIn fact, as an anecdote, my area had difficulties in finding police officers because the applicants couldn't comprehend some advanced English vocabulary or argue their case, which was a prerequisite, and this is part of the rural US. Comprehension is also key; your ability to understand should understandably be higher than your speaking ability, but a lot of people here who missed school will not understand quite a bit of C2 vocabulary, which would knock off quite a few points on the test if they keep having to ask the interviewers to explain themselves.\n\nOf course, the difficulty of the exam also depends on the language and which exam is being taken; my French exam required some very eloquent vocabulary but my Italian one was more lenient on the oral part.\n\nAnyway, seeing as this is a case of having experienced different things and taken different types of exams, I think we're not going to get anywhere, but I appreciate that you took the time to explain your side as I see where you're coming from.", "created_utc": "1610684273.0", "edited": "False", "id": "gjb6tak", "is_submitter": "False", "link_id": "t3_kxa0ps", "parent_id": "t1_gjaz9x6", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "ArtLangues", "body": "Right, I'm not talking about the \"average person\", as you can see in my original comment I am referring to someone who has no education and no experience speaking about certain subjects. As someone who grew up in an extremely poverty-stricken area, there are lots of fully grown adults I've known who are obviously fluent in English but dropped out of school at an early age and have absolutely no experience in subjects related to economy, society etc. They also had absolutely abysmal vocabulary related to the topic, which is where their fluency dwindled.\n\nMy original comment relates to a very rare case where a native speaker might still struggle with a part of the test; it's not a situation where one needs to be pedantic, it's from my own personal experience.", "created_utc": "1610679414.0", "edited": "False", "id": "gjay2ch", "is_submitter": "False", "link_id": "t3_kxa0ps", "parent_id": "t1_gjaojdf", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "ArtLangues", "body": "There were some quite advanced topics for the *adolescent* DELF B2 oral section that I can't imagine someone without any experience in problem solving and debate vocab acing, and B2 is supposed to be somewhat easy. The subject I had in particular was on the economic benefits of large corporations vs. small businesses, the ethical implications of each and which one would benefit the local economy more. The oral section not only implies that you can speak the language, but also that you have the skills to support your arguments using real world evidence, and proper appropriate language for the subject - and a topic like that is not something I would imagine any 10 year old being able to do.", "created_utc": "1610673042.0", "edited": "False", "id": "gjam28l", "is_submitter": "False", "link_id": "t3_kxa0ps", "parent_id": "t1_gjagf37", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "ArtLangues", "body": "Or poorly educated; many proficiency tests require a lot of problem solving/debate abilities as well. If someone got a poor education or none at all and never gained any communication skills in those domains, they would have problems with that come the oral examination part (at least for high intermediate or advanced level) and especially the writing an essay part.", "created_utc": "1610653206.0", "edited": "False", "id": "gj9fa8w", "is_submitter": "False", "link_id": "t3_kxa0ps", "parent_id": "t1_gj97wq8", "score": "6", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "ArtLangues", "body": "Not many people outside of the US know of the ACTFL/OPI. I took it as a supplement to a CEFR level exam for admissions in a European uni, but it was only to make my application stronger, not as a proper evaluation since it wouldn't be accepted.\n\nAccording to Wikipedia, you have these options for Vietnamese:\n\n* VINATEST - Kỳ thi đánh giá năng lực Tiếng Việt (Hanoi University)\n* NLTV - Kỳ thi năng lực Tiếng Việt (VNS)\n* IVPT - Kỳ Thi Năng Lực Tiếng Việt Quốc Tế (International Vietnamese  Proficiency Test)", "created_utc": "1610607022.0", "edited": "False", "id": "gj7e6dc", "is_submitter": "False", "link_id": "t3_kvgx54", "parent_id": "t3_kvgx54", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "ArtLangues", "body": "I saw him on his server in 2013 and 10 y/o me cried of joy I thought I was meeting God", "created_utc": "1610506260.0", "edited": "False", "id": "gj2mpar", "is_submitter": "False", "link_id": "t3_kvr6nn", "parent_id": "t3_kvr6nn", "score": "1", "subreddit": "teenagers", "subreddit_id": "t5_2rjli"}, {"author": "ArtLangues", "body": "Just an anecdote: personally, I found the CILS B1 to be harder than the DELF B2. Particularly the *analisi delle strutture di comunicazione* part which felt more like a guessing game at times than an actual test section...", "created_utc": "1610492715.0", "edited": "False", "id": "gj1x4ms", "is_submitter": "False", "link_id": "t3_kvsc4u", "parent_id": "t3_kvsc4u", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "ArtLangues", "body": "Very impressive that you achieved this, you clearly have some natural talent for language learning and are very fond of the language :) It takes a lot of self-discipline and resourcefulness to get to this point.\n\nHowever, I have a comment on this one part here:\n\n> If you want to reach C2 in a couple of years, I say alls you need is an  internet connection, a good supply of free time, and a bit of money for  Italki lessons.\n\nI see this advice on Reddit and I have to comment that it's not always true that that's *all* that's needed, and this would be the case for most people, for several factors:\n\nAs with all skills, a bit of natural talent and interest is needed to really succeed. One common theme on Reddit is that people read posts saying \"I got to X level in X time!\" and think that if they put in the exact same amount of hours, they'll get the exact same results. However, the amount of time needed to get to a level will always vary depending on how the person learns, and some will retain information faster than others. The type of resource and input also matters, and copying other people's study plan rather than your own can lead to little progress because it's not tailored to you, it's tailored to someone else.\n\nThis is a trend you'll see on every similar thread in, say, places like r/languagelearning \\- people attempting to follow exactly in another user's footsteps and failing. Reddit in general can also be very boasty and over-exaggerating their level (not that that's what you're doing of course since you have your proof, the exam) and lead people to think they'll make progress in a short amount of time.\n\nSo for anyone who's reading this, absolutely take inspiration from this guy (gal?), but make sure to individualize your study plans rather than simply taking them from Reddit because there's nearly a 100% chance that it won't be as effective for you.", "created_utc": "1610420516.0", "edited": "False", "id": "giykkn5", "is_submitter": "False", "link_id": "t3_kvd2cl", "parent_id": "t3_kvd2cl", "score": "92", "subreddit": "German", "subreddit_id": "t5_2qq51"}, {"author": "ArtLangues", "body": "Can we also post there for bachelor's degree programs in Europe that aren't in English? Asking because I'm an American who just applied for a first-year bachelor's in France in a program that's only in French.", "created_utc": "1610399743.0", "edited": "False", "id": "gixeou7", "is_submitter": "False", "link_id": "t3_kv0ms1", "parent_id": "t3_kv0ms1", "score": "1", "subreddit": "ApplyingToCollege", "subreddit_id": "t5_2y2r8"}, {"author": "ArtLangues", "body": "Yep, I did this on italki because I understood Italian at about a 98% and couldn't speak above an A2. Got an AL (B2.1) on my oral proficiency interview after only a month of tutoring.", "created_utc": "1610342346.0", "edited": "False", "id": "giuf876", "is_submitter": "False", "link_id": "t3_kuh6l6", "parent_id": "t1_gis0up9", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "ArtLangues", "body": "Learned Spanish first, then French and Italian. It's far easier to pick up comprehension skills but when it comes to actually speaking, especially with phonetically similar-sounding languages like Spanish-Italian, you will have some mix ups. One example from me preparing for a B1-B2 exam in Italian after already knowing Spanish to C1 was mixing up \"sedersi\" and \"sentarse\"", "created_utc": "1610317414.0", "edited": "False", "id": "git24po", "is_submitter": "False", "link_id": "t3_kunua6", "parent_id": "t3_kunua6", "score": "5", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "ArtLangues", "body": "Sorry broh I don't speak Ireland 🔫🤠🐎🇺🇸🎆", "created_utc": "1610313589.0", "edited": "False", "id": "gisu4li", "is_submitter": "False", "link_id": "t3_kqt1nb", "parent_id": "t1_gislbhs", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "ArtLangues", "body": "I remember a conversation I had in Italian (for practice) with a tour guide while walking through Florence.\n\n\"Hai detto che ogni tanto ascolti musica italiana. Qual è il tuo artista preferito in questo momento?\"\n\n\"Fedez\"\n\n\"😐😑\"", "created_utc": "1610178167.0", "edited": "False", "id": "gimxnj8", "is_submitter": "False", "link_id": "t3_ktdkmd", "parent_id": "t1_gim4zhw", "score": "8", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "ArtLangues", "body": "Started learning Italian at 3 because my parents wanted me to (then took an 11 year break). Did like 5-6 mandatory languages throughout all of school (American public school btw) Started *actually* learning a second language on my own at 13, which was Spanish, and self-teaching made me learn a lot faster than in school.", "created_utc": "1610158760.0", "edited": "False", "id": "gim2x5t", "is_submitter": "False", "link_id": "t3_kt82ld", "parent_id": "t3_kt82ld", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "ArtLangues", "body": "Omg, I was like this at 13 with my Spanish! I literally did not stop talking about it and my friends were definitely sick of it. If any of you are reading this I'm sorry :')", "created_utc": "1610158398.0", "edited": "False", "id": "gim27z8", "is_submitter": "False", "link_id": "t3_ktdkmd", "parent_id": "t1_giltdk9", "score": "15", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "ArtLangues", "body": "LMAO is this real cha cha cha YWBTA \n\ncha", "created_utc": "1610057716.0", "edited": "False", "id": "gih3htp", "is_submitter": "False", "link_id": "t3_ksh3h8", "parent_id": "t3_ksh3h8", "score": "1", "subreddit": "AmItheAsshole", "subreddit_id": "t5_2xhvq"}, {"author": "ArtLangues", "body": "We can't pick out your language for you unfortunately, but as someone who speaks Spanish, French and Italian - Italian would be easier, *but* you'd have a higher chance of mixing vocab up (with Spanish)", "created_utc": "1610006545.0", "edited": "False", "id": "giem0ly", "is_submitter": "False", "link_id": "t3_ks50sc", "parent_id": "t3_ks50sc", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "ArtLangues", "body": "Honestly, I stopped the spaced repetition vocab learning stuff after A2-early B1 and stuck with speaking/reading/media. I only put them in when I realize they're somewhat common words, and only if they've popped up quite a few times, which makes for a very small deck. Otherwise, I just let them enter my head naturally", "created_utc": "1609995275.0", "edited": "False", "id": "gie5opp", "is_submitter": "False", "link_id": "t3_krtlpb", "parent_id": "t3_krtlpb", "score": "6", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "ArtLangues", "body": "This reminds me of when I took a bunch of online level tests a few years back.\n\nC2 in Portuguese. I have *NEVER* studied Portuguese in my life\n\nC2 in Spanish, my L2 that I had only been studying for 1 year at the time and had never visited a Hispanophone country\n\nC1 in British English. I'm American...", "created_utc": "1609839573.0", "edited": "False", "id": "gi5yyhk", "is_submitter": "False", "link_id": "t3_kqt1nb", "parent_id": "t3_kqt1nb", "score": "18", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "ArtLangues", "body": "Because I plan to do a 5-year program at university in France starting summer of this year. This involves getting Italian to C1 and French to \\~C2 by the end of the program duration", "created_utc": "1609726225.0", "edited": "False", "id": "gi0v4fj", "is_submitter": "False", "link_id": "t3_kpt96x", "parent_id": "t3_kpt96x", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "ArtLangues", "body": "Use a black pen. People who write their vocab in less than 12 colors are heathens and will never get past A1", "created_utc": "1609711560.0", "edited": "False", "id": "gi00xnk", "is_submitter": "False", "link_id": "t3_kptwbn", "parent_id": "t3_kptwbn", "score": "35", "subreddit": "languagelearningjerk", "subreddit_id": "t5_37rt5"}, {"author": "ArtLangues", "body": "I agree that it's weird and breaks every other convention, but IMO the reason I didn't feel like it was a real discussion was that there's not much we can do about it, because trying to make some other term (rather than \"American\") a widespread term adoptable by anyone would take away from how we could actually use that energy for real civil rights movements and other things that we as a society *need* to change, you feel me? We still have racial inequality in the world among other problems, so much so that we simply don't need to focus our energy on a linguistic quirk. English is a strange language but calling a non-problematic word \"racist\" takes away from people who deal with real racism, because it makes people take it less seriously.", "created_utc": "1609628635.0", "edited": "False", "id": "ghvg84o", "is_submitter": "False", "link_id": "t3_kodjbl", "parent_id": "t1_ghtil94", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "ArtLangues", "body": "Wow, that girl! When people have a different accent/non-native grammar I just assume they're not from here and that's why they sound like that, regardless of how they look.\n\nAnother possibility is that you have a really good native-sounding accent and if you even have a little bit of \"off\" grammar it confuses people, which I understand (although that response from her was unwarranted)", "created_utc": "1609573464.0", "edited": "False", "id": "ght596l", "is_submitter": "False", "link_id": "t3_kodjbl", "parent_id": "t1_ghszyfv", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "ArtLangues", "body": "Not the person you responded to, I definitely don't agree with what she said there at all but I mean... no need to Reddit stalk someone. Try to adopt a passive process of \"Wow, this comment is so stupid... next.\" rather than spend your time watching someone's profile, because time has value.", "created_utc": "1609565816.0", "edited": "False", "id": "ghsvvm9", "is_submitter": "False", "link_id": "t3_ko7q6c", "parent_id": "t1_ghs2gpr", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "ArtLangues", "body": "No joke, this exact same thing has happened to me in Spanish, not only in real life but in online groups. I got called racist because I was helping someone practice English and the term \"American\" came up, and I said that they tend to have different meanings in English and Spanish, so while American in English refers to someone from the USA, American in Spanish often refers to someone from the Americas. I had a ton of people tell me we need to change it to \"Unitedstatesian\" or something similar because it's racist and offensive to everyone else who lives in the Americas, and I got harassed right off the group for saying it's just a linguistic difference with no racial meaning, at least to us. This was preceded by other things such as citing my nationality as the reason why I will never be good at the language and should just quit.\n\nEnded up quitting the language at a solid C1 and quitting the Spanish language internet entirely.", "created_utc": "1609565325.0", "edited": "False", "id": "ghsv63v", "is_submitter": "False", "link_id": "t3_kodjbl", "parent_id": "t1_ghslmfz", "score": "6", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "ArtLangues", "body": "> with language learners who are ethnically from that area \n\nOr, in my experience, if they *think* you're one of them. I'm mixed Filipino/white and I've met some Mexicans who thought I was an idiot that kept stuttering in Spanish, what's supposed to be my \"native language\", at least to them.\n\nOn the other hand, I've had some people judge me harshly for trying to speak their language while *not* being ethnically from there, which was another problem in itself...", "created_utc": "1609564707.0", "edited": "False", "id": "ghsu90u", "is_submitter": "False", "link_id": "t3_kodjbl", "parent_id": "t1_ghrje3u", "score": "9", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "ArtLangues", "body": "Like the other commenters said, it depends.\n\nI've found the French (ironically) and Italians to be much more supportive of my language learning and less harsh on slip-ups than native Spanish speakers (dominantly from Latin America). Any time I made a slip-up in Spanish, someone would say something like \"Americans just can't learn languages, so it's not your fault\" or \"I mean, you got that wrong, but you shouldn't be speaking our language anyway, it's *our* language, so...\" To be fair, I was told by a very understanding person that it is likely due to my race, not entirely nationality (I'm not Caucasian) and to just ignore them, but it was rough as I was very young when I started.\n\nI have never had a bad experience with the French or Italians though, if not indifferent, they're impressed.", "created_utc": "1609564158.0", "edited": "False", "id": "ghstfbk", "is_submitter": "False", "link_id": "t3_kodjbl", "parent_id": "t3_kodjbl", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "ArtLangues", "body": "Most of the internet \"polyglots\" you'll find aren't even B1 in most of their languages, IMO. Same with the Youtuber ones; they'll say a bunch of A1-A2 sentences strung together, but I bet if you asked them a more advanced or even immediate question they'll flail.", "created_utc": "1609539497.0", "edited": "False", "id": "ghrleyl", "is_submitter": "False", "link_id": "t3_kofwac", "parent_id": "t3_kofwac", "score": "10", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "ArtLangues", "body": "I'm whichever one won't cause me to get weird DMs ;)", "created_utc": "1609292326.0", "edited": "False", "id": "ghgd63k", "is_submitter": "False", "link_id": "t3_kmnjwg", "parent_id": "t1_ghg8wcq", "score": "1", "subreddit": "relationships", "subreddit_id": "t5_2qjvn"}, {"author": "ArtLangues", "body": "Everything you asked other than the last part (which I'm also confused about) is in the post. OP said that:\n\n* he is male,\n* 3 years older than her,\n* her boyfriend has nothing to say about them (insinuating he does) though this could be up for debate depending on how truthful the girl is being\n* again, I'm pretty sure the girl is lying about him knowing\n* I'd also like to know what a \"nickname\" means in this context", "created_utc": "1609287711.0", "edited": "False", "id": "ghg4f6q", "is_submitter": "False", "link_id": "t3_kmnjwg", "parent_id": "t1_ghfmc7q", "score": "1", "subreddit": "relationships", "subreddit_id": "t5_2qjvn"}, {"author": "ArtLangues", "body": "Interesting how it differs, I flew into LAX a few weeks ago from out-of-state (don't live in LA) after filling out the form and nobody ever mentioned it or asked for it in the airport or on the flight.", "created_utc": "1609228381.0", "edited": "False", "id": "ghdhwxi", "is_submitter": "False", "link_id": "t3_kl9wui", "parent_id": "t1_gh8g6jt", "score": "1", "subreddit": "LosAngeles", "subreddit_id": "t5_2qht0"}, {"author": "ArtLangues", "body": "The other commenter had a good CEFR self-assessment grid, though you can also get an official examination to prove your chosen level if needed. Depending on your country, you can find exam centers for most major languages, though you may have to travel a bit depending on which one and where you are.\n\nSome examples that use the CEFR level system are: DELE or SIELE (Spanish) DELF (French)  Goethe-Zertifikat (German) etc\n\nI'm not sure what country you're from, but there's also the ACTFL (for Americans I think) which can be done online during the pandemic with remote proctoring, and it gives you the level they believe you're at. [They do use a different level system, though](https://www.actfl.org/resources/actfl-proficiency-guidelines-2012)", "created_utc": "1609139403.0", "edited": "False", "id": "gh9p5kp", "is_submitter": "False", "link_id": "t3_kljna4", "parent_id": "t3_kljna4", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "ArtLangues", "body": "American here who speaks Spanish (C1) French (B2) and Italian (B1-B2, haven't gotten the results yet). I got \"Hello\", \"I hope\" and \"Well/fine\" before reading the translation...", "created_utc": "1609138937.0", "edited": "False", "id": "gh9one9", "is_submitter": "False", "link_id": "t3_kl3uv9", "parent_id": "t3_kl3uv9", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "ArtLangues", "body": "Unlike everyone else who responded, I took one very short look at this guy's (\"IronicallyWhite\") page and it's very obviously a troll. Particularly the part where he says it's okay to be racist to Asians. Good bait though, ngl", "created_utc": "1608767797.0", "edited": "False", "id": "ggujavb", "is_submitter": "False", "link_id": "t3_kiw2re", "parent_id": "t1_ggu9756", "score": "15", "subreddit": "LosAngeles", "subreddit_id": "t5_2qht0"}, {"author": "ArtLangues", "body": "Ahh I see, I stand corrected - native anglophones in general\\*", "created_utc": "1608631271.0", "edited": "False", "id": "ggogujb", "is_submitter": "False", "link_id": "t3_khyhwe", "parent_id": "t1_ggofmgb", "score": "21", "subreddit": "languagelearningjerk", "subreddit_id": "t5_37rt5"}, {"author": "ArtLangues", "body": ">Who needs 3 genders anyway! \n\nJokes aside, this guy is why us Americans who actually try to learn languages have a bad rap with everyone else god damn :'(", "created_utc": "1608614065.0", "edited": "False", "id": "ggny0x0", "is_submitter": "False", "link_id": "t3_khyhwe", "parent_id": "t3_khyhwe", "score": "46", "subreddit": "languagelearningjerk", "subreddit_id": "t5_37rt5"}, {"author": "ArtLangues", "body": "NTA, how much work does he think goes into box mix brownies when a literal 12 y/o can do it? I can already tell OP is female... please find a way out of there", "created_utc": "1608613106.0", "edited": "False", "id": "ggnwmg0", "is_submitter": "False", "link_id": "t3_khmocx", "parent_id": "t3_khmocx", "score": "1", "subreddit": "AmItheAsshole", "subreddit_id": "t5_2xhvq"}, {"author": "ArtLangues", "body": "In the 8 hours since your comment was posted, I managed to get to C2 in Russian.  тнаиж уоц! шилл леарн есперанто нехт!", "created_utc": "1608455743.0", "edited": "False", "id": "ggghfmb", "is_submitter": "True", "link_id": "t3_kgj9hy", "parent_id": "t1_ggfcahm", "score": "9", "subreddit": "languagelearningjerk", "subreddit_id": "t5_37rt5"}, {"author": "ArtLangues", "body": "thanks I'm drowning in it now you're a real wingman 👍", "created_utc": "1608422206.0", "edited": "False", "id": "ggf4ain", "is_submitter": "True", "link_id": "t3_kgj9hy", "parent_id": "t1_ggf44zn", "score": "8", "subreddit": "languagelearningjerk", "subreddit_id": "t5_37rt5"}, {"author": "ArtLangues", "body": "LMAO. I shit you not, I'm the same mix (half Filipina) and I get this *all* the time. On my 15th birthday, a sweet Mexican lady at the store asked me if I was having a quince. Doesn't help that I also speak Spanish.", "created_utc": "1608263720.0", "edited": "False", "id": "gg7sxnh", "is_submitter": "False", "link_id": "t3_kcl3mk", "parent_id": "t3_kcl3mk", "score": "1", "subreddit": "hapas", "subreddit_id": "t5_33rcf"}, {"author": "ArtLangues", "body": "If this is Sykkuno or Corpse I absolutely understand both sides here lmfao", "created_utc": "1608183236.0", "edited": "False", "id": "gg44lpz", "is_submitter": "False", "link_id": "t3_keplzh", "parent_id": "t1_gg42vlk", "score": "236", "subreddit": "relationship_advice", "subreddit_id": "t5_2r0cn"}, {"author": "ArtLangues", "body": "That wasn't rude, that was a fact. Your GF is barely fit to be a medical professional if she doesn't understand how virus transmission works. Even as a non-doctor who's not among immunocompromised people, I'm quarantining after just having traveled and waiting for my test.", "created_utc": "1607374859.0", "edited": "False", "id": "gezftll", "is_submitter": "False", "link_id": "t3_k8k60z", "parent_id": "t1_geygizf", "score": "9", "subreddit": "relationships", "subreddit_id": "t5_2qjvn"}, {"author": "ArtLangues", "body": "Your sister and her \"buddy\" are nasty AF, but I feel like I need to point out the massive covid risk you're all running here, WTF? You guys didn't quarantine *after* being around hundreds of travelers, your sister's man who I'm assuming is from another household is there, your mom's coming, and your sister's kids are coming back. People like you and your family are why the US is doing so bad right now, good job", "created_utc": "1606277524.0", "edited": "False", "id": "gdirhzz", "is_submitter": "False", "link_id": "t3_k01ns4", "parent_id": "t3_k01ns4", "score": "4", "subreddit": "relationship_advice", "subreddit_id": "t5_2r0cn"}, {"author": "ArtLangues", "body": "I read that for a long-term student visa, you can only apply anywhere between 3 months and 2 weeks beforehand. So, given this hypothetical situation, what would happen?\n\nI only turn 18 at the end of May, and seeing as the closest VFS center to me is a 6 hour flight away (therefore don't want to drag my parents with me) I would need to do it after that date. Uni would start on September 1st. However, I still have my plan to arrive in France at the beginning of July for the program; am I out of options if I'd have only 1 month to receive my visa, after which I won't be at my permanent address in the US?", "created_utc": "1606211646.0", "edited": "False", "id": "gdfdj08", "is_submitter": "False", "link_id": "t3_k00q6o", "parent_id": "t1_gdfac9u", "score": "1", "subreddit": "IWantOut", "subreddit_id": "t5_2r5hw"}, {"author": "ArtLangues", "body": "Visiting the UK for a few days is definitely feasible, I'll keep that in mind. How long would I have to be in the UK for my \"Schengen time\" to reset? Is there a minimum?", "created_utc": "1606211393.0", "edited": "False", "id": "gdfdag2", "is_submitter": "False", "link_id": "t3_k00q6o", "parent_id": "t1_gdf77s9", "score": "1", "subreddit": "IWantOut", "subreddit_id": "t5_2r5hw"}, {"author": "ArtLangues", "body": "> she got angry with me and told me I was just bitter he broke up with me \n\nSounds like you need to dump the \"friend\"", "created_utc": "1605931882.0", "edited": "False", "id": "gd0k4nl", "is_submitter": "False", "link_id": "t3_jy0f5s", "parent_id": "t3_jy0f5s", "score": "12", "subreddit": "relationships", "subreddit_id": "t5_2qjvn"}, {"author": "ArtLangues", "body": "Half Asian/half white girl here. It's all a product of her environment, as you said she's from a rural white area of the US. Many POC (not just Asians) who grow up in the same environment end up feeling the same way. For a while, and even now on occasion, I've struggled with my eye shape, color of skin/eyes, nose, etc. because certain white people I knew would talk about them in a negative way.\n\nBeing supportive, like you appear to be doing, should help the situation plenty. Be positive about her features when she brings them up. Make sure not to give her any answers that could potentially feed her narrative (such as the white features = superior thing) and as another comment said, also make sure you're not dictating how she's allowed to feel by using \"internalized racism\" as the term.\n\nAlso, just gonna throw this in there, seeing as she has self-esteem issues, she should consider therapy. Good luck", "created_utc": "1605659841.0", "edited": "False", "id": "gco4mrm", "is_submitter": "False", "link_id": "t3_jw37sp", "parent_id": "t3_jw37sp", "score": "4", "subreddit": "relationships", "subreddit_id": "t5_2qjvn"}, {"author": "ArtLangues", "body": "Didn't he \"gift\" the shitty hoodie to her? Not that I'm condoning the petty part or anything but it is her property now, not his, right?", "created_utc": "1605053023.0", "edited": "False", "id": "gbvtyb3", "is_submitter": "False", "link_id": "t3_jrilgq", "parent_id": "t1_gbvrhoo", "score": "2", "subreddit": "relationships", "subreddit_id": "t5_2qjvn"}, {"author": "ArtLangues", "body": "Damn those 22 tabs, haven't seen that many since my HS thesis final", "created_utc": "1604810957.0", "edited": "False", "id": "gbk2i4c", "is_submitter": "False", "link_id": "t3_jpzr2l", "parent_id": "t3_jpzr2l", "score": "70", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "ArtLangues", "body": "This happened in a French class I audited at school before I graduated (already had enough French credits but was killing free time there), I pronounced a word correctly (think it was \"bleu\") and the class snickered and started mocking the way I pronounced it. The teacher, thankfully, said \"That *is* how you pronounce it.\" and I think the ringleader got sent to the principal's office.", "created_utc": "1604694532.0", "edited": "False", "id": "gbdsv7l", "is_submitter": "False", "link_id": "t3_jp4cd8", "parent_id": "t3_jp4cd8", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "ArtLangues", "body": "NO, no, no, no, this is a really young relationship (2 months) leave while you can right now. She'll keep doing this kind of thing, it takes a lot of effort to send private screenshots out, so it wasn't by any means an \"accident\".\n\nI also suspect she has feelings for the guy in question, but that's just me.", "created_utc": "1604104974.0", "edited": "False", "id": "ganndo8", "is_submitter": "False", "link_id": "t3_jl8hgx", "parent_id": "t3_jl8hgx", "score": "1", "subreddit": "relationships", "subreddit_id": "t5_2qjvn"}, {"author": "ArtLangues", "body": "I agree, but the average therapist you'll find in your area is likely more qualified than armchair psychologists on Reddit, or people that mean well but don't know the the person involved or the finer details of the situation. I would say the majority of the posts I see here and on r/relationships are relationships where one person is clearly mentally ill or simply a situation where couples therapy would help better than comments.", "created_utc": "1603943555.0", "edited": "False", "id": "gagi2ao", "is_submitter": "False", "link_id": "t3_jjn7u7", "parent_id": "t1_gaga1dr", "score": "7", "subreddit": "relationship_advice", "subreddit_id": "t5_2r0cn"}, {"author": "ArtLangues", "body": "Can we copy and paste this on literally every single r/relationship_advice post", "created_utc": "1603916804.0", "edited": "False", "id": "gaf2rl6", "is_submitter": "False", "link_id": "t3_jjn7u7", "parent_id": "t1_gadjsv1", "score": "78", "subreddit": "relationship_advice", "subreddit_id": "t5_2r0cn"}, {"author": "ArtLangues", "body": "It actually is. My friends in middle/early high school, and myself, learned how to say \"I am an apple\" in at least 5 languages and repeated it constantly for the laughs. Not for any particular reason, we were just stupid kids and trying to be memey and original.", "created_utc": "1603854116.0", "edited": "False", "id": "gacexzy", "is_submitter": "False", "link_id": "t3_jj6nt7", "parent_id": "t1_gab65vt", "score": "9", "subreddit": "languagelearningjerk", "subreddit_id": "t5_37rt5"}, {"author": "ArtLangues", "body": "True, I can say from experience I look up old Reddit posts for advice or answers. Hope someone real does take away some good advice here. :)", "created_utc": "1603669972.0", "edited": "False", "id": "ga47w3a", "is_submitter": "False", "link_id": "t3_ji2z1p", "parent_id": "t1_ga47h1v", "score": "1", "subreddit": "relationships", "subreddit_id": "t5_2qjvn"}, {"author": "ArtLangues", "body": "I'm 99% certain this post and the post you mentioned are fake, we get these fake \"different POV\" fantasy posts all the time as if there's a possibility of a couple who supposedly don't use Reddit who both happened to post in the same subreddit on the same day about a several month old problem.", "created_utc": "1603669686.0", "edited": "False", "id": "ga47dox", "is_submitter": "False", "link_id": "t3_ji2z1p", "parent_id": "t1_ga41s9v", "score": "3", "subreddit": "relationships", "subreddit_id": "t5_2qjvn"}, {"author": "ArtLangues", "body": "[So uh, anyone else get the feeling this is fake?](https://www.removeddit.com/r/relationships/comments/jhx9o1/my_29m_husband_doesnt_think_hes_the_father_of_his/)", "created_utc": "1603669226.0", "edited": "False", "id": "ga46jn7", "is_submitter": "False", "link_id": "t3_ji2z1p", "parent_id": "t3_ji2z1p", "score": "1", "subreddit": "relationships", "subreddit_id": "t5_2qjvn"}, {"author": "ArtLangues", "body": "I stalked your profile after reading your r/relationships post to see if you two were still together and was not disappointed by any means. Late, but congrats!", "created_utc": "1603606511.0", "edited": "False", "id": "ga0n61f", "is_submitter": "False", "link_id": "t3_ixfcvu", "parent_id": "t3_ixfcvu", "score": "1", "subreddit": "LongDistance", "subreddit_id": "t5_2s6ky"}, {"author": "ArtLangues", "body": "Personally, I have a VPN and always set it to France and use Netflix with it. There's also a French streaming application called [Molotov.tv](https://Molotov.tv) with lots of options, but make sure you have your French VPN on.", "created_utc": "1603160497.0", "edited": "False", "id": "g9e7sfo", "is_submitter": "False", "link_id": "t3_jcsr0v", "parent_id": "t3_jcsr0v", "score": "1", "subreddit": "French", "subreddit_id": "t5_2rd5t"}, {"author": "ArtLangues", "body": "I just checked Netflix with PrivateVPN (Italy - Milan settings) and Friends is on there with a full Italian dub. I'd recommend getting a VPN that works with Netflix (not NordVPN), it's been a lifesaver for lang learning.", "created_utc": "1603088439.0", "edited": "False", "id": "g9atvbk", "is_submitter": "False", "link_id": "t3_j5oxzm", "parent_id": "t1_g7u5c9k", "score": "2", "subreddit": "italianlearning", "subreddit_id": "t5_2tuxf"}, {"author": "ArtLangues", "body": "[Boyfriend \\[31M\\] thinks he's a good photographer but he's not really](https://www.reddit.com/r/relationships/comments/j307yo/boyfriend_31m_thinks_hes_a_good_photographer_but/)", "created_utc": "1603061666.0", "edited": "False", "id": "g99pgel", "is_submitter": "False", "link_id": "t3_jdk6rt", "parent_id": "t1_g99oc87", "score": "29", "subreddit": "relationships", "subreddit_id": "t5_2qjvn"}, {"author": "ArtLangues", "body": "i didn't even notice til i read the title", "created_utc": "1602644192.0", "edited": "False", "id": "g8rezyl", "is_submitter": "False", "link_id": "t3_jarkem", "parent_id": "t3_jarkem", "score": "1", "subreddit": "HazbinHotel", "subreddit_id": "t5_igfxt"}, {"author": "ArtLangues", "body": "Sorry for the late response, but I ordered from the second link (ACS Traduction) and got my translated documents in a little over a week. I looked the finished products over and they appear to be accurate. Thank you for the suggestion, will definitely be using that service again :)", "created_utc": "1602571852.0", "edited": "False", "id": "g8o6q54", "is_submitter": "True", "link_id": "t3_j1rb8z", "parent_id": "t1_g711y2w", "score": "2", "subreddit": "translator", "subreddit_id": "t5_2ss9z"}, {"author": "ArtLangues", "body": "> Have you contacted schools yourself?\n\nYes I have for over a year now, ever since I figured out what I wanted to study in France. I always look at the \"contacts\" page of the course, and email them accordingly, though give yourself a lot of time in advance because I swear some of them still haven't gotten back to me 6-8 months later... :/ But usually they're pretty helpful, I just email another person in the contacts list if I'm not responded to, and they forward me to the right person.\n\nThe length of the LOR probably doesn't matter, as long as it's well written and is overall the best representation of you and your skills/merit. Do pay attention to the length of your CV though, there are tips on that online, but I managed to get mine down to one page which is the average of a student CV.\n\nBest of luck ;)", "created_utc": "1602114849.0", "edited": "False", "id": "g822r3p", "is_submitter": "False", "link_id": "t3_j69700", "parent_id": "t1_g80nway", "score": "1", "subreddit": "IWantOut", "subreddit_id": "t5_2r5hw"}, {"author": "ArtLangues", "body": "Hi, I'm also a just-graduated American, taking a gap year, applying directly to a uni in France for the 21-22 school year. (what are the odds?!) I can answer your second question to the best of my ability since I've already finished everything that can be done at this time period, though we're both in the same boat.\n\nWhether or not you need a test really depends on what you're planning on studying exactly, but most of the time, the subject matter can be proven with your high school transcript (or are sometimes available for \"tout débutants\"). For example, I'm entering LEA English-Italian, and seeing as we do not have Italian as a subject in most high schools in the US, I have to take a CILS B1 exam first (while the average French person applying to the same licence will likely have taken Italian in school and doesn't need it). You'll want to contact the university that has your degree and ask what high school prerequisites are required to enter that specific formation, but for most things, our high schools are similar enough to those of France that our basic common core (or equivalent) courses are fine.\n\nAs for the DELF B2, most (if not all) common French unis only require a B2 level for licence (3 years). You will only be asked to present a DALF C1 (or equivalent) in your studies after the licence. An \\*alternative\\* to the DELF for the first year is taking a TCF-DAP, but since you already have the DELF B2, you don't need that at all. No more language tests are necessary unless your uni explicitly states you need a higher level, which is usually not the case.\n\nYou do need a CV on your Etudes on France if you haven't already done so, though you seem aware of that. Also seems like you have the translated documents thing under control, I ordered from ACS Traduction\n\nOne thing that really helps is having a letter of recommendation. They strongly recommend American students applying to have at least one LOR. I would recommend that you get one from the non-profit you work for.\n\nAll of the absolute essential documents are on the Etudes en France application, because that's its purpose, to be simpler for the EEF country applicants. Follow the rules on the EEF and you're golden. Just don't forget to get a passport soon if you don't already have one, they are being a little delayed by the pandemic.\n\nOh, and here's an extra tidbit - if you're planning on getting money from family/others in the US for your studies in France, you'll open a French bank account under the university you're accepted to, but they will likely have to send money to you with something like Western Union because the French banks take a large chunk of money from foreign transfers based on what I've heard from other foreign students studying in France", "created_utc": "1602035479.0", "edited": "False", "id": "g7ymdo8", "is_submitter": "False", "link_id": "t3_j69700", "parent_id": "t3_j69700", "score": "2", "subreddit": "IWantOut", "subreddit_id": "t5_2r5hw"}, {"author": "ArtLangues", "body": "I got PrivateVPN and it immediately worked with no issues, thank you!", "created_utc": "1601249430.0", "edited": "False", "id": "g6wfmb4", "is_submitter": "True", "link_id": "t3_j0kcn5", "parent_id": "t1_g6v2s7r", "score": "2", "subreddit": "NetflixViaVPN", "subreddit_id": "t5_3fzk2"}, {"author": "ArtLangues", "body": "1. Parents want him to at least try to learn a foreign language as was suggested, to improve task-switching capabilities among other benefits for autistic children (if you Google it, there are some interesting articles that discuss this)\n2. He seems to have an interest for French based on past TV viewing habits, and parents are trying to get Italian citizenship\n3. ASD can, and usually does, drastically affect one's way of learning - in his case, which I went into a little bit of detail on in my post, he has difficulty paying attention, memorizing things via traditional classroom methods, cannot independently do things like note take, and also tends to take things very literally and has little creativity in forming things by himself such as fictional stories. (he also does not have Asperger's if anyone was curious) He's a special needs student in school as well, therefore learning a language in a traditional classroom setting is totally off the table for him.\n4. He's very passive about the idea and does not really have an opinion. That's why we're looking to find something fun for him to try out and see if it sticks - if he hates it, then we'll move on to the next thing, but we would really appreciate it if we found something appropriate for him that would stick.", "created_utc": "1600485736.0", "edited": "1600486341.0", "id": "g5s0w7f", "is_submitter": "False", "link_id": "t3_ivh6v8", "parent_id": "t1_g5rm6f0", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "ArtLangues", "body": "Thanks for the suggestion (though our mom already gave him a hard no about playing GTA, haha!). I was hoping maybe there would be something to learn vocab/essential phrases with, like Duolingo but in more of a game form rather than a gamified app. He's a total beginner with no experience, maybe something from the ground up. I'll edit my post for clarity", "created_utc": "1600473251.0", "edited": "False", "id": "g5rbqzd", "is_submitter": "False", "link_id": "t3_ivh6v8", "parent_id": "t1_g5ra11p", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "ArtLangues", "body": "Why would you post here just to ignore and/or ridicule everyone's responses?\n\nI'm around the same age you were when you got into this relationship and I, honest to God, balls to the wall would never go after a 30 year old man despite it being legal because yes, they are in a totally different life stage than us and are capable of taking advantage of us in ways we wouldn't be experienced enough to notice. Just because something's legal doesn't make it morally right. This guy likely has a \"kink\" for young girls because he really is attracted to young girls, as seen with the graduation horniness, and you're likely already getting older than the age group he is attracted to.\n\nIf this isn't a troll post, please take into consideration what the others are saying, because this guy's not only handing you red flags, he's decorated the whole house in red.", "created_utc": "1599784626.0", "edited": "False", "id": "g4rwk6g", "is_submitter": "False", "link_id": "t3_iqcevf", "parent_id": "t3_iqcevf", "score": "1", "subreddit": "relationships", "subreddit_id": "t5_2qjvn"}, {"author": "ArtLangues", "body": "Traditionally learning how to speak (via classroom/tutor lessons) only hampers my motivation and interest in the language. I'm looking for other ways that have worked for people (places to practice, etc.) that might work for me, since I learn a little differently. Also, these would be useful to know considering I will be taking Italian in uni, and will have a hard time learning in the classroom without other methods on the side.", "created_utc": "1599487318.0", "edited": "False", "id": "g4by264", "is_submitter": "True", "link_id": "t3_io6e3l", "parent_id": "t1_g4burls", "score": "0", "subreddit": "italianlearning", "subreddit_id": "t5_2tuxf"}, {"author": "ArtLangues", "body": "Thank you! I guess I'll just have to amp up the amount of time I do those things (I admit I do slack on consuming French media on the daily). Any ideas for reaching out to native speakers? I used to go on (non-lang learning) FR Discord servers, but it got a little intimidating because obviously that's a place where people use a lot of slang.\n\nI live in Hawaii which is possibly the least French immersion-friendly place ever, but I'll try.", "created_utc": "1599483987.0", "edited": "False", "id": "g4brpn9", "is_submitter": "True", "link_id": "t3_io6lcp", "parent_id": "t1_g4brc4j", "score": "6", "subreddit": "French", "subreddit_id": "t5_2rd5t"}, {"author": "ArtLangues", "body": "I do occasionally read the news in French, but my main issue is that for some reason I cannot retain any new vocabulary I find in them, and I'm not quite sure what the problem is. Perhaps it's from those words being rarer and therefore my brain feels no need to retain them? If you have any tips on being able to remember less common words, please let me know. Merci bcp", "created_utc": "1599483589.0", "edited": "False", "id": "g4br714", "is_submitter": "True", "link_id": "t3_io6lcp", "parent_id": "t1_g4bqrdj", "score": "20", "subreddit": "French", "subreddit_id": "t5_2rd5t"}]