[{"author": "askyddys19", "body": "Hardest language: Russian. I'm still learning it, and it's taken me 3 years of intensive study to get to B2-C1. \n\nEasiest language: Serbo-Croatian. Particularly having studied a variety of Slavic languages, this is dead easy for me. I studied it intensively for a month this past summer and got to B1 by the end.\n\nedit- Weirdly easy language: Mandarin. Everybody says that Mandarin is an incredibly tough language, but really it's the *sound* of the language that's difficult; the grammar is childishly simple compared to any Slavic language.", "created_utc": "1666051872.0", "edited": "1666135942.0", "id": "isqplo7", "is_submitter": "False", "link_id": "t3_y63pu2", "parent_id": "t3_y63pu2", "score": "5", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "askyddys19", "body": "The response you will come across 75% of the time is \"Not much, you?\" The other 25% depends on the situation—sometimes it doesn't need to be replied to at all depending on context. For example, a conversation I had yesterday in a chance meeting with an old friend:\n\n1: \"Yo [name], what's up?\"\n\n2: \"Haw, man, I haven't seen you in forever! How're you doing?\"\n\nSometimes there's no need of a direct response, but rather just an acknowledgement of the person speaking. As has been stated by previous commentators, there is no contextually relevant response to the phrase (they're not literally asking \"what's going on\" most of the time unless they appear concerned for you, in which case it's not even a greeting at that point anyway)", "created_utc": "1664862501.0", "edited": "False", "id": "iqzfd8o", "is_submitter": "False", "link_id": "t3_xur17d", "parent_id": "t3_xur17d", "score": "1", "subreddit": "ENGLISH", "subreddit_id": "t5_2qjni"}, {"author": "askyddys19", "body": "As pointed out by others, those are all archaic forms of modern phrases. None are used in every-day speech, except occasionally to indicate a[n often humorous] reference to the past (and by this I mean the fairly distant past—they stopped being used regularly toward the end of the 17th century). They are forms of \"come,\" \"begin,\" \"conjure\" and \"you are\", respectively, in an antiquated form of the second-person singular.", "created_utc": "1663982848.0", "edited": "False", "id": "ipo0cgp", "is_submitter": "False", "link_id": "t3_xm5ava", "parent_id": "t3_xm5ava", "score": "1", "subreddit": "ENGLISH", "subreddit_id": "t5_2qjni"}, {"author": "askyddys19", "body": "'\"Choices\" are just reactions to an event or chain of events.' That's about as formal, clinical, and concise as you can make it, though \"just\" can be substituted for a number of synonyms (\"merely\" immediately comes to mind, but may seem somewhat patronizing).\n\nEdit: info & length", "created_utc": "1663982269.0", "edited": "False", "id": "ipnz8nr", "is_submitter": "False", "link_id": "t3_xlvjr7", "parent_id": "t3_xlvjr7", "score": "1", "subreddit": "ENGLISH", "subreddit_id": "t5_2qjni"}, {"author": "askyddys19", "body": "...which is not the point at all? I really don't know what you're getting at by this point, it seems like you're just trying to shoot out teensy responses to get a rise out of me. In which case, please touch grass.", "created_utc": "1663938483.0", "edited": "False", "id": "iplci3i", "is_submitter": "False", "link_id": "t3_xkxz4k", "parent_id": "t1_iplbyqv", "score": "0", "subreddit": "ENGLISH", "subreddit_id": "t5_2qjni"}, {"author": "askyddys19", "body": "You're putting words in my mouth. I'm simply pointing out that dialectical variation exists in English, and as there is no standardized form of the English grammar or pronunciation things that sound \"wrong\" to other speakers may be completely within the rules of a different dialect. You, on the other hand, seem hell-bent on tearing into me based on a false understanding of what I said.", "created_utc": "1663938076.0", "edited": "False", "id": "iplbqj2", "is_submitter": "False", "link_id": "t3_xkxz4k", "parent_id": "t1_iplaxfa", "score": "0", "subreddit": "ENGLISH", "subreddit_id": "t5_2qjni"}, {"author": "askyddys19", "body": "...and everyone in my community back in the US says them like that?", "created_utc": "1663937501.0", "edited": "False", "id": "iplao01", "is_submitter": "False", "link_id": "t3_xkxz4k", "parent_id": "t1_ipl9yfs", "score": "0", "subreddit": "ENGLISH", "subreddit_id": "t5_2qjni"}, {"author": "askyddys19", "body": "I'm a native speaker of English and I've differentiated the vowel lengths in \"beach\" and \"beech\" as far back as I can remember. There's no part of that where I'm \"pretending\" there's a difference, it's literally the way I speak. \"Beach\" is /bitʃ/ and \"beech\" is /biːtʃ/ for me.", "created_utc": "1663936827.0", "edited": "False", "id": "ipl9g6a", "is_submitter": "False", "link_id": "t3_xkxz4k", "parent_id": "t1_ipkslaq", "score": "0", "subreddit": "ENGLISH", "subreddit_id": "t5_2qjni"}, {"author": "askyddys19", "body": "That's not \"doing it wrong,\" that's dialectical variation.", "created_utc": "1663921804.0", "edited": "False", "id": "ipkq2ap", "is_submitter": "False", "link_id": "t3_xkxz4k", "parent_id": "t1_ipkmn02", "score": "0", "subreddit": "ENGLISH", "subreddit_id": "t5_2qjni"}, {"author": "askyddys19", "body": "I'm from a fairly rural community in the US, so my choice of languages to study thus far has earned me a lot of strange comments. My favorite, during the course of my learning Russian, is the classic \"you're going to turn into a communist,\" even coming from my parents. Firstly, I'm [fairly well known in my community as] a leftist, so \"you're gonna go commie\" is already a hilariously moot point, and secondly—what about the language would \"make me communist\" to begin with??\n\nI tend to just laugh it off at this point. Sometimes I enjoy confusing them by switching into Russian (which I presume is a terrifying experience given that I usually recieve a deer-in-the-headlights response) and have a laugh to myself afterward.\n\nSimilar things tend not to happen with the other Slavic languages I'm learning, probably because they're just complete unknowns to most of my fellow countrymen.", "created_utc": "1663632358.0", "edited": "False", "id": "ip4s44r", "is_submitter": "False", "link_id": "t3_xi0rzj", "parent_id": "t3_xi0rzj", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "askyddys19", "body": "These are \"Belomorkanal\" (White Sea Canal) brand *papirosy*, which are a special type of unfiltered cigarette still produced in Russia--they were once much more common, but not so anymore. I've actually tried these before when I was in Saint Petersburg, they weren't too bad. The inscription below the brand name reads \"smoking kills.\"", "created_utc": "1663603465.0", "edited": "False", "id": "ip2uwz7", "is_submitter": "False", "link_id": "t3_xhpzte", "parent_id": "t3_xhpzte", "score": "1", "subreddit": "russian", "subreddit_id": "t5_2qlc6"}, {"author": "askyddys19", "body": "I'm American (native English speaker) learning a variety of Slavic languages, primarily Russian, but prior to that I was learning Mandarin Chinese in middle and high school.\n\nThe main hurdle to overcome was the writing system, which I had to memorize more as individual images instead of breaking them down into component parts (Mandarin grammar, especially compared to Russian, is an absolute breeze, so that aspect wasn't too bad). I struggled a little bit with pronunciation, but mainly with tones because in English tonality isn't as important for conveying literal meaning as it is for implied meaning (e.g. sarcasm, irony, question phrases, as opposed to differentiating 草 and 肏).\n\nI was pretty good at it in a strictly academic setting, but I was never able to properly practice with native speakers outside of the classroom, so while I did end up passing the AP test for the language (the college-level exam in the US for it, ranked from 0-5; I got a 3) my Mandarin is incredibly rusty now to the point where I can barely form a full sentence anymore except in writing. In contrast, my Russian is particularly good now because I spent time in Russia and was surrounded by the language daily. \n\nOverall, as others have said, exposure is key. Once you have a certain grasp of the language, immersion - or something like immersion - is key to upping your fluency.", "created_utc": "1663327099.0", "edited": "False", "id": "iongc9o", "is_submitter": "False", "link_id": "t3_xfcp2i", "parent_id": "t3_xfcp2i", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "askyddys19", "body": "I want to say that it looks like medieval Cyrillic...those could be the initials Ꙉ. Б., which would indicate that it was once owned by someone in southeastern Europe (in and around Serbia), but that would explain absolutely nothing else about the book, so I'm not sure that's correct at all.", "created_utc": "1663185886.0", "edited": "False", "id": "iofvacb", "is_submitter": "False", "link_id": "t3_xe47q3", "parent_id": "t3_xe47q3", "score": "8", "subreddit": "literature", "subreddit_id": "t5_2qhps"}, {"author": "askyddys19", "body": "In West Slavic languages \"pan\" is equivalent to \"Mister\" or \"Sir\" in English. In the era of the old Polish-Lithuanian Commonwealth, \"pan\" was a term of address for a nobleman, and was semi-loaned as пан with this meaning into Russian (specifically as a term of address for Central European nobles, or as a noun describing the type of noble).\n\nFrom 1919-1921, the burgeoning Russian Soviet Federative Socialist Republic (RSFSR) went to war with the new Polish Republic, fully independent for the first time since the Third Partition of Poland in 1795. Пан became associated in Soviet literature and culture with the bourgeoisie of Poland that they fought against in that war; for example, in the song Конармейская Песня (presumably from the Interwar period):\n\n*На Дону и в Замостье тлеют белые кости,\nнад костями шумят ветерки;\nпомнят псы-атаманы, помнят польские паны\nконармейские наши клинки!*\n\n\"Along the Don and in Zamość the white bones smoulder,\nand over those bones whirl little breezes;\nthe dog-Atamans and Polish *pany* remember\nour horse-army blades!\"", "created_utc": "1662763470.0", "edited": "False", "id": "insc700", "is_submitter": "False", "link_id": "t3_x9rix0", "parent_id": "t1_inrpr4m", "score": "3", "subreddit": "russian", "subreddit_id": "t5_2qlc6"}, {"author": "askyddys19", "body": "As a kid, we had a pond in the back of our house, and each spring and summer we’d have a ton of American toads singing mating calls at the pond. My sister and I learned to make their call, which is a high-pitched trill that sounds like an old telephone ringing, and 16 years later when I started university, the sound we’d been making turned out to be the “r” sound in Russian. Not sure how it worked out that way, but it did.", "created_utc": "1662656271.0", "edited": "False", "id": "inm015r", "is_submitter": "False", "link_id": "t3_x8vwks", "parent_id": "t3_x8vwks", "score": "1", "subreddit": "russian", "subreddit_id": "t5_2qlc6"}, {"author": "askyddys19", "body": "It’s not nearly the most taboo swear word, but it is quite taboo…if mainly in American English. British and Antipodean English are much less strict about the use of the word—it can be used very informally in reference to a friend, similarly to “mate,” whereas in American English (as has been said previously) “cunt” is a gendered insult, usually directed negatively towards women. I have noticed, however, that among my contemporaries in the U.S. there’s less of a reluctance to use the word in a more general setting, perhaps due to a global influence on their lexicon.", "created_utc": "1661917650.0", "edited": "False", "id": "imh9r78", "is_submitter": "False", "link_id": "t3_x1hxrd", "parent_id": "t3_x1hxrd", "score": "3", "subreddit": "ENGLISH", "subreddit_id": "t5_2qjni"}, {"author": "askyddys19", "body": "I’ve never heard Америка used to refer to anything other than the US, although sparingly; the preferred form is США (Соединённые Штаты Америки). Американец is the demonym for people from the US. Interestingly, during the Tsarist era (and apparently well into Soviet times) the US was formally referred to as Северо-Американские Соединённые Штаты, literally “the Northern American United States.” This is the form of the name used in the Alaska Purchase of 1867.", "created_utc": "1661792153.0", "edited": "False", "id": "im9za5u", "is_submitter": "False", "link_id": "t3_x0owqy", "parent_id": "t3_x0owqy", "score": "8", "subreddit": "russian", "subreddit_id": "t5_2qlc6"}, {"author": "askyddys19", "body": "I was lucky enough to take a class on it two years ago at my university, which while mainly dealing with comparative linguistics gave me a solid foundation for it; I’ve been working off of the resources from that class ever since. OCS spelling can be highly variable, but there are usually paradigms that you can recognize. For instance, the modern Russian *ы* was often written *ꙑ*, *ъі* or *ъи*, all of which are technically different but still recognizable.", "created_utc": "1661791568.0", "edited": "False", "id": "im9xsg2", "is_submitter": "False", "link_id": "t3_x05jin", "parent_id": "t1_im9wb8m", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "askyddys19", "body": "Yes—I am slowly learning Old Church Slavonic, which is the oldest form of any Slavic language attested in writing from c. 900 CE, so there are simply no extant speakers of the language anymore (unless you count Church Slavonic and its many recensions, but even then it’s only used in specific religious contexts).", "created_utc": "1661757327.0", "edited": "False", "id": "im893x5", "is_submitter": "False", "link_id": "t3_x05jin", "parent_id": "t3_x05jin", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "askyddys19", "body": "Being American, I tend to use a more American English dialect, but it fluctuates a great deal. In my own idiolect, I draw a fair amount from British English, which I find to be more concise (particularly in writing).\n\nMy accent also changes depending on who I interact with and what setting I’m in: when completely informal and surrounded by Americans, I revert to [what I think is] a soft Baltimore accent (given that I grew up around Baltimore); when informal and surrounded by Brits, which is quite often as I study in London, my natural accent is augmented by some particularly British phrases or slang that I often find myself saying with unintentional mimicry of its original accent; if in a formal setting, I adopt some crazed trans-Atlantic accent, because I tend to mumble or slur words when speaking informally, and speaking in an artificially formal register preserves the clarity of my speech (while making me sound like I’ve been dropped out of a movie from the 1930s, which I find amusing).\n\nEdit: formatting", "created_utc": "1661666803.0", "edited": "False", "id": "im3j4ee", "is_submitter": "False", "link_id": "t3_wzgs23", "parent_id": "t3_wzgs23", "score": "2", "subreddit": "ENGLISH", "subreddit_id": "t5_2qjni"}, {"author": "askyddys19", "body": "Mandarin. I started learning it in middle school, passed the AP exam in high school (with a 3), then…got obsessed with Slavic languages in university and most of my Mandarin promptly left my head after my first year of Russian. Weirdly enough, I can still write a fair amount, but it’s only the *characters* that I remember—God forbid I attempt to speak it.", "created_utc": "1661665877.0", "edited": "False", "id": "im3hujv", "is_submitter": "False", "link_id": "t3_wzeewj", "parent_id": "t3_wzeewj", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "askyddys19", "body": "For me [Maryland, around Baltimore] “am” (and “fan”) are pronounced differently to “at” and “sad.” The first two have the vowel diphthongized and raised from */æ/ to /eə/ (so /eəm/, /feən/) while the last two retain /æ/ (/sæd/, /æt/). This is known as /æ/ raising, and is a common feature across Canadian and US English (where it is more specifically /æ/ tensing).", "created_utc": "1661567053.0", "edited": "False", "id": "ilybfln", "is_submitter": "False", "link_id": "t3_wylyvi", "parent_id": "t3_wylyvi", "score": "1", "subreddit": "linguistics", "subreddit_id": "t5_2qhos"}, {"author": "askyddys19", "body": "“A couple of bucks” is grammatically correct, but that construction seems odd to me in writing (where “a couple of” is more formal, but “bucks” is extremely informal). I’d rather use “A couple of dollars” or “a few dollars.” In speech, however, I’d say “a couple bucks” interchangeably with “a few dollars” and “a few bucks.”", "created_utc": "1661439024.0", "edited": "False", "id": "ilqnmxx", "is_submitter": "False", "link_id": "t3_wx9xgd", "parent_id": "t3_wx9xgd", "score": "3", "subreddit": "ENGLISH", "subreddit_id": "t5_2qjni"}, {"author": "askyddys19", "body": "Ну, отлично! Вы говорите по-английски хорошо, и я думаю, что поговорите лучше на английском очень быстро.", "created_utc": "1661432011.0", "edited": "False", "id": "ilq6z5u", "is_submitter": "False", "link_id": "t3_wx6trd", "parent_id": "t3_wx6trd", "score": "1", "subreddit": "russian", "subreddit_id": "t5_2qlc6"}, {"author": "askyddys19", "body": "Идеи is the nom/accusative plural form (or the genitive singular) of идея, which is just “idea.” So it literally translates to “ideas,” which are, by extension, brainchildren (this may be more common in my dialect of English, but a brainchild is just somebody’s original thought or invention, e.g. “the light bulb was Edison’s brainchild” or something along those lines)", "created_utc": "1661393836.0", "edited": "False", "id": "ilojclq", "is_submitter": "False", "link_id": "t3_wx1i87", "parent_id": "t3_wx1i87", "score": "2", "subreddit": "russian", "subreddit_id": "t5_2qlc6"}, {"author": "askyddys19", "body": "This…this is just absurdly phallic…", "created_utc": "1661372714.0", "edited": "False", "id": "iln424q", "is_submitter": "False", "link_id": "t3_wwqvki", "parent_id": "t3_wwqvki", "score": "7", "subreddit": "vexillology", "subreddit_id": "t5_2rygj"}, {"author": "askyddys19", "body": "“Cruiser Aurora; Monument to the Great October [Socialist Revolution].”\n\nThe Aurora was the ship that fired a signal shot that commenced the storming of the Winter Palace on 25 October (7 November in the Gregorian Calendar), 1917. It has been preserved as a museum ship in Saint Petersburg.", "created_utc": "1661365723.0", "edited": "False", "id": "ilmliy8", "is_submitter": "False", "link_id": "t3_wwpmkk", "parent_id": "t3_wwpmkk", "score": "12", "subreddit": "russian", "subreddit_id": "t5_2qlc6"}, {"author": "askyddys19", "body": "The Baltic states (particularly Latvia and Estonia), as well as virtually every Central Asian and Caucasian nation has substantial Russian-speaking populations (particularly now, as they have received an influx of Russians leaving Russia because of the war).", "created_utc": "1661305018.0", "edited": "False", "id": "iljdbej", "is_submitter": "False", "link_id": "t3_ww57an", "parent_id": "t3_ww57an", "score": "5", "subreddit": "russian", "subreddit_id": "t5_2qlc6"}, {"author": "askyddys19", "body": "Do you have any lengthier (if untranslated) examples of this script?", "created_utc": "1661226843.0", "edited": "False", "id": "ilewi1w", "is_submitter": "False", "link_id": "t3_wv01mm", "parent_id": "t3_wv01mm", "score": "3", "subreddit": "conlangs", "subreddit_id": "t5_2red7"}, {"author": "askyddys19", "body": "A dot as in a period/full stop? No, unless it’s at the end of a sentence.", "created_utc": "1661220624.0", "edited": "False", "id": "ilejxu2", "is_submitter": "False", "link_id": "t3_wvbn23", "parent_id": "t3_wvbn23", "score": "10", "subreddit": "ENGLISH", "subreddit_id": "t5_2qjni"}, {"author": "askyddys19", "body": "It opens just fine for me on the standard app…", "created_utc": "1661198463.0", "edited": "False", "id": "ild56ww", "is_submitter": "False", "link_id": "t3_wute7i", "parent_id": "t1_ild0nea", "score": "1", "subreddit": "WhitePeopleTwitter", "subreddit_id": "t5_35n7t"}, {"author": "askyddys19", "body": "What do you mean, “the rush”? That’s just how the classes progress at my university; it’s intentionally constructed so that when I graduate and if I’ve kept up with the classes, I’ll be fluent.", "created_utc": "1661189450.0", "edited": "False", "id": "ilci2l1", "is_submitter": "False", "link_id": "t3_wu96uj", "parent_id": "t1_ilbah6p", "score": "2", "subreddit": "russian", "subreddit_id": "t5_2qlc6"}, {"author": "askyddys19", "body": "Funnily enough, no - they call it Βυζαντινή Αυτοκρατορία ⟨Vizantinē Autokratoria⟩ (per the LoC’s transliteration of Modern Greek), with Beta starting the word but obviously nowadays being pronounced as a /v/.", "created_utc": "1661189235.0", "edited": "False", "id": "ilchihz", "is_submitter": "False", "link_id": "t3_wuafes", "parent_id": "t1_ilb9ag1", "score": "4", "subreddit": "russian", "subreddit_id": "t5_2qlc6"}, {"author": "askyddys19", "body": "According to Wikipedia, the use of г in transliteration is a separate phenomenon, originating from the pronunciation of the letter in Ukrainian, Belarusian, some old Russian dialects and in elements of modern Russian (the pronunciation of мягкий и лёгкий, Бог и.т.д.), plus apparently the idea that х sounds “too harsh” for transliteration[?]", "created_utc": "1661158871.0", "edited": "False", "id": "ilas8qs", "is_submitter": "False", "link_id": "t3_wuafes", "parent_id": "t1_ilapa63", "score": "10", "subreddit": "russian", "subreddit_id": "t5_2qlc6"}, {"author": "askyddys19", "body": "You do not need a full stop at the end of a string of emojis unless you are using them in a formal setting (which you would never do). You also do not need to capitalize the first letter of every word that you write, it looks odd to a native speaker.", "created_utc": "1661151237.0", "edited": "False", "id": "ilaj5p0", "is_submitter": "False", "link_id": "t3_wujdes", "parent_id": "t3_wujdes", "score": "5", "subreddit": "ENGLISH", "subreddit_id": "t5_2qjni"}, {"author": "askyddys19", "body": "I am currently sitting at around B2-C1 level Russian, and have been taking it as a university course for three years. All in all I now have ~1000 hours put into the language in formal learning time, and I’m still not at a native level.\n\nEdit: for reference, the Foreign Service Institute estimates that 1100 hours is the study time needed for fluency. Just 100 more hours to go………..", "created_utc": "1661142261.0", "edited": "False", "id": "ila6gf3", "is_submitter": "False", "link_id": "t3_wu96uj", "parent_id": "t3_wu96uj", "score": "3", "subreddit": "russian", "subreddit_id": "t5_2qlc6"}, {"author": "askyddys19", "body": "There is no such thing as “bad English”; there are only different dialects of English, each of which work in their own way. To refer to another dialect as “bad” simply because it has rules slightly different to your own is extremely subjective and demeans the legitimate linguistic processes that led to the existence of the dialect in question.\n\nWhile there is no such thing as bad English, there is such a thing as bad linguistics, and comments like yours are a perfect example of that phenomenon.", "created_utc": "1661128136.0", "edited": "1661128361.0", "id": "il9eyew", "is_submitter": "False", "link_id": "t3_wu6gl5", "parent_id": "t1_il8m9em", "score": "3", "subreddit": "ENGLISH", "subreddit_id": "t5_2qjni"}, {"author": "askyddys19", "body": "The Latin letter B/b comes from the Greek Β/β. In Ancient Greek, Beta was pronounced /b/, and this phonetic value continued when it was loaned into Latin. By the time the Cyrillic alphabet was created based on Greek, however, the Greek beta was undergoing a sound change from /b/ to /v/. Both the Cyrillic Б and В are direct derivatives of the Greek B, and represent the two distinct sounds that the Beta could be interpreted as in Byzantine Greek at the time. Beta later completed the sound change, and is now pronounced consistently as /v/ in Modern Greek, with the original sound /b/ now represented as the digraph μπ ⟨mp⟩. Greek loans in English largely passed originally *through Latin* or at least in Latin-language texts, which means that beta kept its original Ancient Greek value of /b/, whereas Greek loans in Russian and other Slavic languages came later in the development of spoken Greek and directly from the language itself, therefore loaning the more modern pronunciation /v/.", "created_utc": "1661127529.0", "edited": "False", "id": "il9dnxg", "is_submitter": "False", "link_id": "t3_wuafes", "parent_id": "t3_wuafes", "score": "25", "subreddit": "russian", "subreddit_id": "t5_2qlc6"}, {"author": "askyddys19", "body": "Слобода/Sloboda is the standard word for “freedom” in several Slavic languages (Serbo-Croatian, Macedonian, and Slovak), though only in Serbia and Macedonia would you encounter it written in the Cyrillic script. It’s an doublet of svoboda/свобода in most other Slavic languages, which often has taken on different meanings; in Russian, Ukrainian, and Belarusian (the only other languages that have the svoboda/sloboda couplet and are written in Cyrillic) “sloboda” now refers to a type of medieval settlement which was free from taxation (and as such the word on the boat is unlikely to be written in these latter three languages).", "created_utc": "1661098195.0", "edited": "False", "id": "il7goqt", "is_submitter": "False", "link_id": "t3_wtpjpo", "parent_id": "t3_wtpjpo", "score": "41", "subreddit": "translator", "subreddit_id": "t5_2ss9z"}, {"author": "askyddys19", "body": "It also appears to be incorrectly written, it should read Խտացրած ևաթ “Condensed Milk” but the word for “milk” is written backwards.", "created_utc": "1661056546.0", "edited": "False", "id": "il5mky6", "is_submitter": "False", "link_id": "t3_wtn6az", "parent_id": "t1_il5ll3s", "score": "1", "subreddit": "WhatLanguageIsThis", "subreddit_id": "t5_2ame30"}, {"author": "askyddys19", "body": "That is Armenian.", "created_utc": "1661055952.0", "edited": "False", "id": "il5ll3s", "is_submitter": "False", "link_id": "t3_wtn6az", "parent_id": "t3_wtn6az", "score": "1", "subreddit": "WhatLanguageIsThis", "subreddit_id": "t5_2ame30"}, {"author": "askyddys19", "body": "Probably a Native American language (of any sort, really) or Mongolian.", "created_utc": "1661055486.0", "edited": "False", "id": "il5krq6", "is_submitter": "False", "link_id": "t3_wthcby", "parent_id": "t3_wthcby", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "askyddys19", "body": "“Was” & “were”, “am” and “is” are (in English and most other Indo-European languages) just conjugations of the single verb “to be”; it just happens that English the relationship between them has been obscured over time, so really there’s no need to have completely different verb forms for them. In Polish, for instance, “I am” can be just a single verb, “jestem” (“to be”+1st person singular), “you are” is “jesteś” (“to be”+2nd person singular), “he/she/it is” = “jest”, “we are” = “jesteśmy”, “you all are” = “jesteście” and “they (plural) are” = “są”. The past tense is the same, if with an irregular base (by-): byłem, byłeś, był, byliśmy, byliście, byli.", "created_utc": "1661054829.0", "edited": "False", "id": "il5jlmw", "is_submitter": "False", "link_id": "t3_wtn250", "parent_id": "t1_il56v6g", "score": "30", "subreddit": "conlangs", "subreddit_id": "t5_2red7"}, {"author": "askyddys19", "body": "There’s no punctuation and it’s missing the subject in its middle section.\n\n“I feel as though if he tried to run again, the Republican candidate (no matter who) would really make Biden look bad in the debates, and this would be really bad for the Democratic Party.”", "created_utc": "1661053607.0", "edited": "False", "id": "il5hb4x", "is_submitter": "False", "link_id": "t3_wtpjhx", "parent_id": "t3_wtpjhx", "score": "2", "subreddit": "ENGLISH", "subreddit_id": "t5_2qjni"}, {"author": "askyddys19", "body": "This is a subreddit for the Russian language, not for geopolitics.", "created_utc": "1661053212.0", "edited": "False", "id": "il5gko2", "is_submitter": "False", "link_id": "t3_wtouhb", "parent_id": "t3_wtouhb", "score": "6", "subreddit": "russian", "subreddit_id": "t5_2qlc6"}, {"author": "askyddys19", "body": "о! извините)", "created_utc": "1661020448.0", "edited": "False", "id": "il3i74z", "is_submitter": "False", "link_id": "t3_wt840i", "parent_id": "t1_il3hdpw", "score": "2", "subreddit": "russian", "subreddit_id": "t5_2qlc6"}, {"author": "askyddys19", "body": "но это не элемент…вы подумали о «делирий»?\n\nEdit: …и я просто был в делирии, «делирий» не элемент…", "created_utc": "1661020049.0", "edited": "1661059233.0", "id": "il3h9ns", "is_submitter": "False", "link_id": "t3_wt840i", "parent_id": "t1_il371qw", "score": "5", "subreddit": "russian", "subreddit_id": "t5_2qlc6"}, {"author": "askyddys19", "body": "Whoop, thanks for the correction! I haven’t used the word in writing for so long that I guess I completely forgot how to spell it.", "created_utc": "1660993993.0", "edited": "False", "id": "il1y0l9", "is_submitter": "False", "link_id": "t3_wsx9vm", "parent_id": "t1_il1j4vh", "score": "3", "subreddit": "ENGLISH", "subreddit_id": "t5_2qjni"}, {"author": "askyddys19", "body": "They are not proper nouns. Proper nouns are generally very specific names; for instance (in long form) *the* Colosseum refers to the specific structure in Rome, but *a* colosseum/coliseum refers to any similar structure. Oregano is a species of plant; if there was one particularly famous plant, or it was the only one of its kind in existence, then it might be Oregano instead of oregano, but otherwise there’s no such distinguishing aspect.\n\nedit: spelling & reference (apparently “coliseum” as a generic spelling is used but mainly in North America[??])", "created_utc": "1660971872.0", "edited": "1660994310.0", "id": "il15mup", "is_submitter": "False", "link_id": "t3_wsx9vm", "parent_id": "t3_wsx9vm", "score": "32", "subreddit": "ENGLISH", "subreddit_id": "t5_2qjni"}, {"author": "askyddys19", "body": "Honestly, Polish orthography is fascinating to me, because it preserves a lot of older components that may have phonetically merged or diverged but provide a clue into the past of the language. For instance: ś, ć, ź, rz and ń were all originally palatalised consonants, not fricatives as most of them are today. Sj->ś, tj/cj->ć, zj->ź, rj->rz. The difference between Ł and L was originally also a palatalization thing iirc, in which L turned up where one would expect *lj and Ł where *l would be expected (Compare Russian любить [ljubitj] to lubić and сказал [skazal] to skazał).", "created_utc": "1660971557.0", "edited": "False", "id": "il155g6", "is_submitter": "False", "link_id": "t3_wsi9jd", "parent_id": "t1_ikzsdc5", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "askyddys19", "body": "You're going to need to first memorize what each case does. In brief (not counting specific exceptions):\n\n1. Nominative: the generic form of a noun or adjective.\n2. Accusative: used to mark the direct object of a sentence (I read *books*) or 'motion towards' (I am going *to my room*).\n3. Genitive: used to mark possession and origin. (*Dad's* book, the Main Street *of the city*.)\n4. Dative: used to mark the recipient of an action. (I gave *her* the book.)\n5. Instrumental: used to mark the instrument an action is done by (I wrote the book *with a pen*, I was *with him* at the time).\n6. Locative/Prepositional: used to mark location (I am *in my room*) and sometimes relational phrases (I was talking *about him*).\n\nYou may encounter talk of a seventh case, the Vocative, which is used when directly invoking the name of a living being, but it is essentially moribund in all but very set phrases and religious lexicon ('My God!' for instance, is not 'moj Bog' \\[1st-person-possessive-pronoun + 'God'-nominative) but 'Bože moj!/Боже мој!' \\['God'-vocative+1st-person-possessive-pronoun).\n\nYou'll then have to go through and memorize the changes to nouns and adjectives per case (which I'll never be able to explain fully here, but there a few sites [like this one](http://www.studyserbian.com/proba/grammar/Nouns_Declens.asp) that show you). This is most easily done through practicing the language itself, starting with easy phrases and working your way up. I'd highly recommend getting a workbook for this, I found cases incredibly difficult to memorize without exercises for them.  \n\n\nedit: missed a word", "created_utc": "1660945095.0", "edited": "False", "id": "ikzmexm", "is_submitter": "False", "link_id": "t3_ws1ocp", "parent_id": "t1_ikzhswb", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "askyddys19", "body": "If we’re talking in terms of “official” Balkan language politics, no, I speak “Croatian” (at like level A2). But in terms of linguistics, of course, albeit not the dialect that is standard in Serbia", "created_utc": "1660939551.0", "edited": "False", "id": "ikz8mf4", "is_submitter": "False", "link_id": "t3_ws1ocp", "parent_id": "t1_ikz7b3f", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "askyddys19", "body": "That’s not quite the same construction—it’s an elision of the article (which is largely restricted to certain set phrases in American English, but not so in the rest of the English-speaking world). “Put the cows out to [the] pasture” is a common example, but also British English has “going on [a] holiday,” “I was in [the] hospital,” among other examples. The same formula doesn’t really apply to “put the clothes to wash.”", "created_utc": "1660925115.0", "edited": "False", "id": "iky7dxs", "is_submitter": "False", "link_id": "t3_ws1gju", "parent_id": "t1_iky6ay4", "score": "1", "subreddit": "ENGLISH", "subreddit_id": "t5_2qjni"}, {"author": "askyddys19", "body": "It’s completely normal not to be able to notice vowel length, as it is normal to overlook or confuse lots of linguistic phenomena that one is unaccustomed to.", "created_utc": "1660915699.0", "edited": "False", "id": "ikxjnlo", "is_submitter": "False", "link_id": "t3_wscurs", "parent_id": "t3_wscurs", "score": "13", "subreddit": "linguistics", "subreddit_id": "t5_2qhos"}, {"author": "askyddys19", "body": "Really? The extra space still appears on my phone…maybe it bugs it on other people’s screens tho, I’ve no idea\n\nReturning to the discussion at hand, I’ll do that too sometimes, or I’ll try to steer clear of any situation where I’d need to use the abbreviation, but sometimes I end up having to use it anyway", "created_utc": "1660914526.0", "edited": "False", "id": "ikxgzid", "is_submitter": "False", "link_id": "t3_ws64ek", "parent_id": "t1_ikxgcg5", "score": "1", "subreddit": "ENGLISH", "subreddit_id": "t5_2qjni"}, {"author": "askyddys19", "body": "Oh! I didn’t know that, but that makes a lot of sense. My Belarusian friends (despite not speaking Ukrainian) reported around 90% of Ukrainian was intelligible to them, especially because of the fact that they speak Belarusian alongside Russian.", "created_utc": "1660910875.0", "edited": "False", "id": "ikx9hit", "is_submitter": "False", "link_id": "t3_wrvukw", "parent_id": "t1_ikx7yag", "score": "3", "subreddit": "russian", "subreddit_id": "t5_2qlc6"}, {"author": "askyddys19", "body": "As an American, divulging the fact that I know multiple Slavic languages [at varying levels] to other people produces an expression as if an alien had just landed in front of them. This is not helped when I mention that I studied standard Mandarin in middle and high school (which I’ve sadly forgotten most of).", "created_utc": "1660892433.0", "edited": "False", "id": "ikwjpe1", "is_submitter": "False", "link_id": "t3_ws1ocp", "parent_id": "t3_ws1ocp", "score": "4", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "askyddys19", "body": "The period directly after “etc.” counts as a full stop. I personally dislike this, but my solution tends to be a double space after the period instead of a single one, just to give it that teeny bit of extra room to indicate that the sentence has been finished (though I don’t do this in formal writing). So\n\n“I need lemons, limes, etc.  I also have to get gas.”\n\ninstead of\n\n“I need lemons, limes, etc. I also have to get gas.”\n\nNOTE: This is completely a thing I made up for this situation in my own time when I was around 12, it’s not at all a standard convention in any form of written English.\n\nedit: spacing", "created_utc": "1660891452.0", "edited": "False", "id": "ikwieif", "is_submitter": "False", "link_id": "t3_ws64ek", "parent_id": "t3_ws64ek", "score": "1", "subreddit": "ENGLISH", "subreddit_id": "t5_2qjni"}, {"author": "askyddys19", "body": "While not a native speaker of Russian, I have encountered and spoken Russian with Bulgarian speakers and Belarusian speakers. Bulgarian is largely incomprehensible to me and Russian to them; I have difficulty establishing word boundaries in Bulgarian speech, and this compounded with many false friends and different loans from other languages makes it confusing to follow (unless I am spoken to painfully slowly). One of my Bulgarian friends had a laughing fit when I used курить offhandedly, because in Bulgarian кур means “dick” and he thought I’d ad-libbed a verb form of it.\n\nBelarusian, on the other hand, is largely intelligible to me, albeit the phonetic inventory takes a while to get accustomed to and I had to draw on my very limited Polish at times. For instance, Belarusian uses кахаць [я кахаю, ты кахаеш и.т.д.] where Russian uses любить, which is similar to Polish kochać with the same meaning. The Belarusians, of course, could understand me perfectly fine in Russian (you’d be hard pressed to find a Belarusian speaker who doesn’t also know Russian, let alone a *monolingual* Belarusian speaker).", "created_utc": "1660890811.0", "edited": "False", "id": "ikwhje4", "is_submitter": "False", "link_id": "t3_wrvukw", "parent_id": "t3_wrvukw", "score": "5", "subreddit": "russian", "subreddit_id": "t5_2qlc6"}, {"author": "askyddys19", "body": "The speaker describes their interest not in the banal semantics of spirituality, but rather how you place yourself within the world of the spiritual during the course of your life.", "created_utc": "1660888221.0", "edited": "False", "id": "ikwdvt5", "is_submitter": "False", "link_id": "t3_ws02sl", "parent_id": "t3_ws02sl", "score": "1", "subreddit": "ENGLISH", "subreddit_id": "t5_2qjni"}, {"author": "askyddys19", "body": "It’s not at all archaic, I hear it on virtually a daily basis both in the US and in the UK (at the very least; I can’t speak for other countries outside of those two).", "created_utc": "1660887571.0", "edited": "False", "id": "ikwcx16", "is_submitter": "False", "link_id": "t3_wrixyt", "parent_id": "t1_ikt53ad", "score": "1", "subreddit": "ENGLISH", "subreddit_id": "t5_2qjni"}, {"author": "askyddys19", "body": "I would parse it as grammatically incorrect—“put” begs the question “where?” in my mind, which “to wash” does not satisfy. “Put the clothes in the laundry machine” would make sense, or “put the clothes in the wash,” but “putting them to wash” sounds wrong.", "created_utc": "1660887008.0", "edited": "False", "id": "ikwc2l9", "is_submitter": "False", "link_id": "t3_ws1gju", "parent_id": "t3_ws1gju", "score": "7", "subreddit": "ENGLISH", "subreddit_id": "t5_2qjni"}, {"author": "askyddys19", "body": "This is correct; a roughly equivalent English expression would be an invocation to “call a spade a spade.”", "created_utc": "1660886418.0", "edited": "False", "id": "ikwb62m", "is_submitter": "False", "link_id": "t3_ws3d6n", "parent_id": "t1_ikw0t4k", "score": "8", "subreddit": "russian", "subreddit_id": "t5_2qlc6"}, {"author": "askyddys19", "body": "Командир 132 отдельной зенитной артиллерийской бригады ПВО - Полковник [подпись]/Сварник", "created_utc": "1660834045.0", "edited": "False", "id": "iksvrxu", "is_submitter": "False", "link_id": "t3_wqw9al", "parent_id": "t1_iksoaeg", "score": "2", "subreddit": "russian", "subreddit_id": "t5_2qlc6"}, {"author": "askyddys19", "body": "Просто потому что много людей говорят по-русски (а тоже потому что я изучаю исследование восточной Европы), но мне очень нравится лингвистики и славянские языки. Уже знаю мало по-Польски, выучил староцеркославянский язык на втором курсе, i isto govorim malo hrvatski jezik, zato što bio sam u Zagrebu u ljetnoj školi hrvatskog jezika [и тоже говорю на хорватском чуть-чуть, потому что я был в Загребе в летней школе хорватского языка].", "created_utc": "1660796403.0", "edited": "False", "id": "ikr6l8s", "is_submitter": "False", "link_id": "t3_wqh3nz", "parent_id": "t1_ikq7xkn", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "askyddys19", "body": "Sounds like Hungarian to me", "created_utc": "1660757791.0", "edited": "False", "id": "ikom18f", "is_submitter": "False", "link_id": "t3_tpfkur", "parent_id": "t3_tpfkur", "score": "1", "subreddit": "WhatLanguageIsThis", "subreddit_id": "t5_2ame30"}, {"author": "askyddys19", "body": "Can’t tell you exactly, but I’d hazard a guess at a Native American language; the script looks suspiciously like Canadian syllabics.", "created_utc": "1660756821.0", "edited": "False", "id": "ikojfre", "is_submitter": "False", "link_id": "t3_w42i3x", "parent_id": "t3_w42i3x", "score": "1", "subreddit": "WhatLanguageIsThis", "subreddit_id": "t5_2ame30"}, {"author": "askyddys19", "body": "Всем привет! Изучаю русский язык в универе, а не могу практиковаться когда я дома (в США; учусь в Лондоне а щас у меня летние каникулы) потому что здесь никто не говорит по-русски. Был в Европе (на континенте, не в Великобритании) 6 месяцев, и там выучил немного сербскохорватский язык, но там не практиковал русский язык. Теперь думаю, что мне нужно практика, и поэтому я сейчас на этом sub", "created_utc": "1660753538.0", "edited": "False", "id": "ikoapmq", "is_submitter": "False", "link_id": "t3_wqh3nz", "parent_id": "t3_wqh3nz", "score": "7", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "askyddys19", "body": "Interesting—maybe it’s a general Slavic thing in vernacular registers, I’ve heard my Russian teacher say летим дальше (used as “let’s move on,” but literally “we’re flying further”) more times than I can count", "created_utc": "1660752238.0", "edited": "False", "id": "iko7a8p", "is_submitter": "False", "link_id": "t3_wo1edu", "parent_id": "t1_ik8k22n", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "askyddys19", "body": "[Northern MD] I do differentiate them, “Vile” I would transcribe as /vɑɪəɫ/, parsed as a single syllable, whereas “Vial” is /ˈvɑɪ.ʊɫ/ in two separate syllables. To complicate things, though, I catch myself using them interchangeably sometimes", "created_utc": "1660751914.0", "edited": "False", "id": "iko6fyw", "is_submitter": "False", "link_id": "t3_wopav5", "parent_id": "t3_wopav5", "score": "3", "subreddit": "linguistics", "subreddit_id": "t5_2qhos"}, {"author": "askyddys19", "body": "Generally no, it just gets tacked on to the following word (and is sometimes devoiced). В банке is pronounced “vBANkye” in only two syllables, and even when there are multiple words affected by the “v” preposition it still tacks on: в нашей стране “fNASHey straNYE”", "created_utc": "1660741172.0", "edited": "False", "id": "iknfzyu", "is_submitter": "False", "link_id": "t3_wppw86", "parent_id": "t1_ikl8ydt", "score": "2", "subreddit": "linguistics", "subreddit_id": "t5_2qhos"}, {"author": "askyddys19", "body": "Language mapping is tricky in the Americas. We may have a recorded language and call it an isolate, but only because we have no recorded history whatsoever of the 20 other languages it was related to that died out before it. You’re also talking about a vast expanse of land, in which *many* different languages have sprung up, and a massive linguistic gap (20,000 years). For reference, the most widely accepted timeframe for PIE (put forward in the Kurgan hypothesis) is around 3000 BCE, roughly 5000 years ago. If PIE was around as the language of a small tribe of people in the Alps, for example, and every other Indo-European language except English had been wiped out, anybody else coming in contact with it would probably think it was an isolate, too.", "created_utc": "1660740510.0", "edited": "False", "id": "iknem16", "is_submitter": "False", "link_id": "t3_wpywa0", "parent_id": "t3_wpywa0", "score": "5", "subreddit": "linguistics", "subreddit_id": "t5_2qhos"}, {"author": "askyddys19", "body": "Weirdly enough, I’ve heard “not my bailiwick” (though largely seen it written, I think it’s primarily British?) but never “not in my wheelhouse”", "created_utc": "1660739083.0", "edited": "False", "id": "iknbqnh", "is_submitter": "False", "link_id": "t3_wq3dc0", "parent_id": "t1_ikn4ee0", "score": "2", "subreddit": "ENGLISH", "subreddit_id": "t5_2qjni"}, {"author": "askyddys19", "body": "I might use the phrase “purposefully/intentionally nonchalant,” but that’s a bit of a mouthful & it sounds formal.\n\nEdit: it also is more about demeanor than it is about an action in general, so maybe this really just doesn’t work", "created_utc": "1660713187.0", "edited": "False", "id": "ikmbxoe", "is_submitter": "False", "link_id": "t3_wqam1j", "parent_id": "t3_wqam1j", "score": "1", "subreddit": "ENGLISH", "subreddit_id": "t5_2qjni"}, {"author": "askyddys19", "body": "“Supercool”/“supercooling” is a specific physics term, referring to “[cooling] a material below its transition temperature without that transition occurring.” Strictly speaking, “supercold” is the highest comparative form you can get from “cool”/“cold” (I think “freezing” would be the superlative in this context)", "created_utc": "1660712958.0", "edited": "False", "id": "ikmbl8c", "is_submitter": "False", "link_id": "t3_wqfggo", "parent_id": "t3_wqfggo", "score": "2", "subreddit": "ENGLISH", "subreddit_id": "t5_2qjni"}, {"author": "askyddys19", "body": "For virtually any natlang, definitely Cyrillic. To me, it’s essentially a more aesthetically pleasing Latin alphabet with better character variation.\n(I also have a pet peeve against non-phonemic scripts, sorry OP)", "created_utc": "1660712127.0", "edited": "False", "id": "ikmab6t", "is_submitter": "False", "link_id": "t3_wq71ss", "parent_id": "t3_wq71ss", "score": "2", "subreddit": "conlangs", "subreddit_id": "t5_2red7"}, {"author": "askyddys19", "body": "“Mightn’t” has slowly crept into my vocabulary over time, although at one point I had no idea it was even a word. I don’t use it very often, though, and I think if I said that around anyone from my high school (US, Maryland) I’d get some really funny looks. “Mayn’t” I can imagine being a construction but up until now I’d never seen or heard it attested to.", "created_utc": "1660680169.0", "edited": "False", "id": "ikkbmy6", "is_submitter": "False", "link_id": "t3_wpuths", "parent_id": "t3_wpuths", "score": "2", "subreddit": "EnglishLearning", "subreddit_id": "t5_2u8ap"}, {"author": "askyddys19", "body": "It’s definitely not Amharic, diacritics like we see here don’t exist in the Ge’ez script", "created_utc": "1660256774.0", "edited": "False", "id": "ijx2vuh", "is_submitter": "False", "link_id": "t3_wm28y5", "parent_id": "t1_ijx1w1d", "score": "1", "subreddit": "translator", "subreddit_id": "t5_2ss9z"}, {"author": "askyddys19", "body": "Translation into modern, non-poetic English: “you may as well be mute; you have no time for vanity, for all the riches you own must be passed on to someone else eventually.”", "created_utc": "1660235435.0", "edited": "False", "id": "ijvj9mt", "is_submitter": "False", "link_id": "t3_wlm8dj", "parent_id": "t3_wlm8dj", "score": "1", "subreddit": "ENGLISH", "subreddit_id": "t5_2qjni"}, {"author": "askyddys19", "body": "I tend to read works of such complexity out loud, and repeat sentences vocally (toying with stress and trying to piece it all together in my head) until I’ve grasped the whole meaning of them—I have no idea if this works for anyone else, though, but it’s worth a shot", "created_utc": "1660194418.0", "edited": "False", "id": "ijtjwwd", "is_submitter": "False", "link_id": "t3_wkw5j0", "parent_id": "t3_wkw5j0", "score": "1", "subreddit": "ENGLISH", "subreddit_id": "t5_2qjni"}, {"author": "askyddys19", "body": "In my free time, I never watch a movie with subtitles unless it’s in a language I can’t understand. When I’m with my family though, we sometimes put subtitles on English-language movies just so my father doesn’t keep asking us “wait, what was that line?” and making us try to rewind by five seconds. He will complain to us that he didn’t hear the line—this is BS, his hearing’s fine, he just spaces out/falls asleep during movies a lot (even the ones he professes to love) and likes to pretend that he doesn’t. We turn on the subtitles to head off this complaint, because he can’t pull the hearing excuse when the words were writ large on the screen.", "created_utc": "1660193977.0", "edited": "False", "id": "ijtj7g5", "is_submitter": "False", "link_id": "t3_wlhgu7", "parent_id": "t3_wlhgu7", "score": "2", "subreddit": "ENGLISH", "subreddit_id": "t5_2qjni"}, {"author": "askyddys19", "body": "Both antihero and superhero are singular words", "created_utc": "1660184326.0", "edited": "False", "id": "ijt0q6j", "is_submitter": "False", "link_id": "t3_wlbfve", "parent_id": "t3_wlbfve", "score": "4", "subreddit": "ENGLISH", "subreddit_id": "t5_2qjni"}, {"author": "askyddys19", "body": "If it’s literally monetary gain being discussed, you could say “blood money” (as in a politician has gained funds at the expense of others; this is a more serious expression, but still colorful).\nTo my knowledge there’s no specific set phrase for corruption in general or specifically for political corruption outside of a few U.S.-centric terms (the -gate suffix, denoting any plotting or general scandal and coming originally from “Watergate”, has recently become more common in British political vocabulary, for instance)", "created_utc": "1660152215.0", "edited": "False", "id": "ijqsgfj", "is_submitter": "False", "link_id": "t3_wimwti", "parent_id": "t3_wimwti", "score": "2", "subreddit": "ENGLISH", "subreddit_id": "t5_2qjni"}, {"author": "askyddys19", "body": "I believe it’s a mispronunciation, but one that I’ve definitely heard in my area (MD). If I’m speaking more formally, “es-PESH-uh-lee” is the pronunciation I’d use; if informal, then I contract it to something like “SPESH-lee.” “Grocery” I say with an “s,” but “species” I say with an “sh” sound in the medial position (so “SPEE-sheez”); “species” with a medial “s” would sound either overly formal (in an American context) or stereotypically British to me.", "created_utc": "1660127940.0", "edited": "False", "id": "ijp9rsp", "is_submitter": "False", "link_id": "t3_wkpn26", "parent_id": "t3_wkpn26", "score": "6", "subreddit": "ENGLISH", "subreddit_id": "t5_2qjni"}, {"author": "askyddys19", "body": "I might argue that the family name is Лидельманъ? Granted, there’s not much to compare those initial two letters to, but the other lowercase “я” letters shown are much more precise, whereas whatever that first letter is in the name seems less loopy (for lack of a better phrase)", "created_utc": "1660117326.0", "edited": "False", "id": "ijowgdm", "is_submitter": "False", "link_id": "t3_wko6on", "parent_id": "t1_ijopb1g", "score": "4", "subreddit": "russian", "subreddit_id": "t5_2qlc6"}, {"author": "askyddys19", "body": "Referring to the US Civil War, I've always heard \"twentieth Maine\" for 20[th] Maine Infantry Regiment. For your example, I'd say in a casual setting \"the hundred-twenty-third [light keyboard warrior] battalion\".", "created_utc": "1659839740.0", "edited": "False", "id": "ij9i9bj", "is_submitter": "False", "link_id": "t3_whsqic", "parent_id": "t3_whsqic", "score": "1", "subreddit": "ENGLISH", "subreddit_id": "t5_2qjni"}, {"author": "askyddys19", "body": "US East Coast--I'd say \"it finishes on May third\" generally. Sometimes I might flip that construction slightly and say \"it finishes on [the] third [of] May\", mostly dropping the words in brackets (rendering it just as \"third May\") but that may be an idiosyncracy of mine.", "created_utc": "1659838979.0", "edited": "False", "id": "ij9grrj", "is_submitter": "False", "link_id": "t3_whonwp", "parent_id": "t3_whonwp", "score": "1", "subreddit": "ENGLISH", "subreddit_id": "t5_2qjni"}, {"author": "askyddys19", "body": "That's ソマリア\"Somalia\" written in katakana (one of the scripts used in Japan, often to transliterate foreign words).", "created_utc": "1656946844.0", "edited": "False", "id": "ietpj7t", "is_submitter": "False", "link_id": "t3_vnnkpf", "parent_id": "t3_vnnkpf", "score": "3", "subreddit": "WhatLanguageIsThis", "subreddit_id": "t5_2ame30"}, {"author": "askyddys19", "body": "In many varieties of American English (including my own) a /t/— or /d/—unstressed /ə/, /ɪ/ or /ɛ/—/n/ sequence is realised as a nasal relase of the /t/ or /d/ directly into syllabic /n/ (so \"curtain\" as /ˈkɚtⁿn̩/ and \"button\" as /ˈbətⁿn̩/). I'd consider the use of the glottal stop in the positions mentioned to be a progression of this linguistic phenomenon, though I've not heard it in my area of the US yet", "created_utc": "1656888413.0", "edited": "False", "id": "ier3wnn", "is_submitter": "False", "link_id": "t3_vl76nx", "parent_id": "t1_idvc96x", "score": "2", "subreddit": "linguistics", "subreddit_id": "t5_2qhos"}, {"author": "askyddys19", "body": "Nope, I can definitely hear Polish spoken by one side of the border and Russian on the other (Belarusians mostly speak Russian). You can see two border posts in the video, which are definitely Belarusian and Polish. https://www.lrt.lt/img/2020/10/08/736712-933756-756x425.jpg and https://i0.wp.com/www.eurasiareview.com/wp-content/uploads/2021/11/a-75.png?resize=800%2C445&ssl=1", "created_utc": "1653697344.0", "edited": "1653697791.0", "id": "ia9attx", "is_submitter": "False", "link_id": "t3_uyfsjq", "parent_id": "t1_ia7ypax", "score": "1", "subreddit": "ThatsInsane", "subreddit_id": "t5_swxxz"}]