[{"author": "Aurazai", "body": "Oh I feel you, I'm 24 and I resisted for as long as I could! I couldn't shake the childish dance/lip-syncing reputation that it inherited from Musical.ly, but I ended up seeing so much genuinely cool, educational and funny tiktok content second hand and weeks late via reddit and instagram reels, that I too caved in and drank the kool-aid straight from the source. I justify it now by saying I use it to learn languages and to consume the latest news lol", "created_utc": "1666464089.0", "edited": "False", "id": "itd2h3m", "is_submitter": "True", "link_id": "t3_yaozi5", "parent_id": "t1_itcsm6f", "score": "42", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Aurazai", "body": "Awesome to see someone else who does this as well. I would love to watch your video if you do upload one (do you have language learning based channel?), so please keep me in the loop!", "created_utc": "1666463488.0", "edited": "False", "id": "itd10ka", "is_submitter": "True", "link_id": "t3_yaozi5", "parent_id": "t1_itckn5p", "score": "0", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Aurazai", "body": "Good to know! It is a bit of a shame that you can’t specifically choose which language you want to see content from, I’ve got a 50/50 split with French and English jumbled together. \n\nI forgot to mention that you can also quite easily just search up who the top creators are in your language and follow them. I followed some news and media outlets like konbini, le monde and Le Parisien and that’s definitely helped the algorithm catch on to showing more target language stuff.", "created_utc": "1666451078.0", "edited": "False", "id": "itc78ip", "is_submitter": "True", "link_id": "t3_yaozi5", "parent_id": "t1_itc426f", "score": "23", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Aurazai", "body": "I think it also helps to contrast this with the perspective of a native english speaker for better understanding.\n\nWhen I worked in customer service, I actually did feel obliged to struggle through a conversation and help someone with poor English because, well, it’s not like I or anyone here could switch into Chinese or Arabic or whatever the customer felt most comfortable with. It’s either English or charades, so I always had the patience to listen to them give their best effort. \n\nThe point here is that because the default is English already, the whole idea of switching languages for easier communication isn’t even a thing in my country (Australia). I’m pretty sure it’s the same in most Anglophone countries apart from hotspots where English and another language like Spanish blend, such as in Miami or El Paso. \n\nAnd I think because of that it naturally feels rude and hurtful for someone to instantly judge you as unworthy of speaking even a little bit of their language, even though logically their reasoning is as you said, simply just to choose the path of least resistance for communication.\n\nAnd even though I now speak French and Spanish, if a native speaker of those languages approached me in a shop using poorer English than my own abilities with their languages, I still don’t think I would switch. It would feel rude. I don’t think people from countries with high L2 English proficiency intuitively understand this cultural difference, which is why this complaint about switching languages is so common.", "created_utc": "1663353249.0", "edited": "1663353921.0", "id": "iop67zs", "is_submitter": "False", "link_id": "t3_xfuajm", "parent_id": "t1_ioonh2i", "score": "61", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Aurazai", "body": "I don’t doubt that he is an impressive intellectual and through a number of his lectures I’ve definitely appreciated his interesting insights on language learning.\n\nStill, for the life of me I cannot find a single instance on youtube of him having an unscripted, off the cuff conversation in any of the languages he’s studied apart from maybe Korean. \n\nI just find it ridiculous how much credit this sub gives him as a polyglot when there’s no evidence to suggest he is anything other than solely an expert in the subject matter of linguistics and language acquisition itself. \n\nWe tend to give a lot of shit to the claims of YouTube polyglots on this sub, but at least their skills are openly demonstrated in their videos for us to critique. I’d be interested to hear about the Professor’s actual, tangible language skills from those who have spoken to him at places like the polyglot conference.", "created_utc": "1663312764.0", "edited": "False", "id": "iomy4l7", "is_submitter": "False", "link_id": "t3_xf8k6e", "parent_id": "t1_iolshnx", "score": "51", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Aurazai", "body": "Great to see a former manager still loving and supporting the club they worked so hard to build, reminds me of Sir Alex.", "created_utc": "1661016287.0", "edited": "False", "id": "il38e87", "is_submitter": "False", "link_id": "t3_wtcdu9", "parent_id": "t3_wtcdu9", "score": "514", "subreddit": "coys", "subreddit_id": "t5_2ryq7"}, {"author": "Aurazai", "body": "I mean… in all honesty never heard of him or seen him play, but a long term investment from Conte/Paratici can only be a good thing. Exciting times ahead.", "created_utc": "1659993574.0", "edited": "False", "id": "ijht53e", "is_submitter": "False", "link_id": "t3_wjkgku", "parent_id": "t3_wjkgku", "score": "246", "subreddit": "coys", "subreddit_id": "t5_2ryq7"}, {"author": "Aurazai", "body": "Absolutely mad that our 6th or 7th choice centreback is getting interest from the fuckin serie A champions yet our actual record signing can’t even get a look in from a single decent club", "created_utc": "1658161575.0", "edited": "False", "id": "ignra1b", "is_submitter": "False", "link_id": "t3_w22jgc", "parent_id": "t3_w22jgc", "score": "134", "subreddit": "coys", "subreddit_id": "t5_2ryq7"}, {"author": "Aurazai", "body": "4D chess from Bale to get a full preseason playing against the yanks before the Wales vs. USA match. Dude wants round of 16 minimum.", "created_utc": "1656203440.0", "edited": "False", "id": "idr0qwb", "is_submitter": "False", "link_id": "t3_vkpykx", "parent_id": "t3_vkpykx", "score": "42", "subreddit": "coys", "subreddit_id": "t5_2ryq7"}, {"author": "Aurazai", "body": "It’s a completely personal choice what language you choose to learn. Entirely up to what you like and would enjoy most. It sounds like Spanish makes more sense for you, but honestly there’s no point dedicating the time and effort to a language you aren’t passionate about. Do whatever makes you happy.\n\nThe good news is that French and Spanish are both as easy as each other for a native English speaker, and I can speak from experience when I say this, that learning one will make learning the other significantly easier/quicker.\n\nCheck out languagetransfer.org for a free and extremely useful resource to get you started.", "created_utc": "1652737510.0", "edited": "False", "id": "i8vfk8f", "is_submitter": "False", "link_id": "t3_uqxcn1", "parent_id": "t1_i8v0quw", "score": "2", "subreddit": "coys", "subreddit_id": "t5_2ryq7"}, {"author": "Aurazai", "body": "I love that Ben chats shit to Joe Rodon for not speaking Welsh lmao", "created_utc": "1652713049.0", "edited": "False", "id": "i8tre4q", "is_submitter": "False", "link_id": "t3_uqxcn1", "parent_id": "t1_i8tr5sa", "score": "134", "subreddit": "coys", "subreddit_id": "t5_2ryq7"}, {"author": "Aurazai", "body": "A very cool thing about this article is that Romero confirms that Lloris and Dier do indeed speak fluent Spanish. As a hobby language learner myself I'm always curious about the language dynamics of football club's dressing rooms, it's often the first thing I think about when a new player signs - as in, which players will welcome them and who will they gravitate to if they don't speak English. Kinda makes me a bit nervous for Pape Matar Sarr when he comes in now that the core French gang is gone.", "created_utc": "1652712803.0", "edited": "False", "id": "i8tqt4z", "is_submitter": "False", "link_id": "t3_uqxcn1", "parent_id": "t3_uqxcn1", "score": "153", "subreddit": "coys", "subreddit_id": "t5_2ryq7"}, {"author": "Aurazai", "body": "He was, at the time, the only manager in history to ever beat Pep in a cup final.\n\nComplete suicide by Levy. A tiny chance of winning a trophy for this club is better than having none at all.", "created_utc": "1650392199.0", "edited": "False", "id": "i5dhph8", "is_submitter": "False", "link_id": "t3_u78k4t", "parent_id": "t1_i5d26iw", "score": "21", "subreddit": "coys", "subreddit_id": "t5_2ryq7"}, {"author": "Aurazai", "body": "I mean he'd double his wages at the very least and gets to play with Ronaldo for a season. Levy would never match what United can offer. Plus the unmatchable fame/prestige that comes with playing for United (even now still, they're the biggest most famous prem club).\n\nIf he's not gonna win the league or the UCL at either club I can see why he'd go there, even if I'd hate the idea.", "created_utc": "1650381535.0", "edited": "False", "id": "i5cphoh", "is_submitter": "False", "link_id": "t3_u76l70", "parent_id": "t1_i5co9wd", "score": "7", "subreddit": "coys", "subreddit_id": "t5_2ryq7"}, {"author": "Aurazai", "body": "Never gonna happen but I’d love to see if Bergwijn could do the job the way Perisic did for Conte. A 3-atb with Davies there I reckon is good enough cover to give it a go.", "created_utc": "1648886052.0", "edited": "False", "id": "i3334m3", "is_submitter": "False", "link_id": "t3_tuch4y", "parent_id": "t3_tuch4y", "score": "90", "subreddit": "coys", "subreddit_id": "t5_2ryq7"}, {"author": "Aurazai", "body": "Gollini the official Spurs welcoming ambassador strikes again", "created_utc": "1643821935.0", "edited": "1643824906.0", "id": "hvary8a", "is_submitter": "False", "link_id": "t3_sitvmi", "parent_id": "t3_sitvmi", "score": "80", "subreddit": "coys", "subreddit_id": "t5_2ryq7"}, {"author": "Aurazai", "body": "THEN THE FUCKIN LEAGUE", "created_utc": "1643537228.0", "edited": "False", "id": "huu460x", "is_submitter": "False", "link_id": "t3_sg616w", "parent_id": "t1_huu45jb", "score": "60", "subreddit": "coys", "subreddit_id": "t5_2ryq7"}, {"author": "Aurazai", "body": "THEN BALE", "created_utc": "1643537218.0", "edited": "False", "id": "huu45jb", "is_submitter": "False", "link_id": "t3_sg616w", "parent_id": "t1_huu44wx", "score": "45", "subreddit": "coys", "subreddit_id": "t5_2ryq7"}, {"author": "Aurazai", "body": "BENTANCUR NEXT BABY", "created_utc": "1643537204.0", "edited": "False", "id": "huu44wx", "is_submitter": "False", "link_id": "t3_sg616w", "parent_id": "t1_huu3vwg", "score": "40", "subreddit": "coys", "subreddit_id": "t5_2ryq7"}, {"author": "Aurazai", "body": "Am I the only one who thinks he does an unusual amount of reporting on Tottenham compared to other clubs? I know he’s got a direct link to Paratici but I swear he must be half a spurs fan by now with how much he talks about us compared to everyone else.\n\nLike outside of the Sancho and Ronaldo deal he barely mentions the other top clubs unless the deals are near abouts completed (for whom he gets called a tap in merchant). Meanwhile we get wall to wall coverage of potential interests and he makes personalised videos on his yt channel just for our club. \n\nHe even does interviews with super small time spurs fan channels like Matt Hayes (12k subs), when most of the other interviews he does are for channels with millions of subs like the United Stand and AFTV. Surely he’s got a soft spot by now.", "created_utc": "1643360194.0", "edited": "1643360569.0", "id": "huk7az0", "is_submitter": "False", "link_id": "t3_sem34c", "parent_id": "t1_huk6bic", "score": "40", "subreddit": "coys", "subreddit_id": "t5_2ryq7"}, {"author": "Aurazai", "body": "Oh snap that's exactly it thank you so much! I'm new to photography and this is my first 'proper' camera, so I've been spending the last couple days figuring things out and learning as much as I can. Thanks again for your help!", "created_utc": "1641901743.0", "edited": "False", "id": "hs729q7", "is_submitter": "True", "link_id": "t3_s1asq4", "parent_id": "t1_hs71doj", "score": "2", "subreddit": "fujifilm", "subreddit_id": "t5_2yahd"}, {"author": "Aurazai", "body": "To piggy back off the stats comment, he's a lot more than just what the goals/assists show:\n\nAs of the present moment in the PL:\n\n* Currently **ranked 1st for number of dribbles leading to shots**, in front of Saint-Maximin, Jota and Salah.\n* **ranked 8th for shot-creating actions per 90 -**  all apart from 1 (Klich at Leeds) ahead of him are big names playing for top 6 clubs like KDB, TAA, Grealish and Bruno.\n* Also for **shot-creating actions per 90, he's ranked** ***ahead*** of the likes of Pogba, Sancho, Smith-Rowe, Conor Gallagher, Mason Mount, Saka, Bernardo Silva, Odegaard and Salah. No one doubts the playmaking ability of those players.\n\nFinally, let's compare the **# of completed passes that have lead to a shot attempt**:\n\n* Lucas Moura: 33\n* Reguilon: 32\n* Son Heung Min: 31\n* ***Adama Traore: 30***\n* Harry Kane: 28\n* Emerson: 21\n\nAll these stats while playing for literally one of the worst attacking teams in the league. It's not completely his fault his team can't finish (the only team with less goals this season is literally relegation bound Norwich). \n\nYes his own finishing is poor and his crossing needs work, but the stats show that what he doesn't bring to the table there he offers alternatively as a creative dribbler. In a better team with superior finishers and with Conte in for wingback development, 20 million for a creative outlet like him is a no brainer. Who else can you buy with equal premier league proven creative stats, for the same price or cheaper?\n\nEdit: [Source for all the stats](https://fbref.com/en/comps/9/gca/Premier-League-Stats#all_stats_gca)", "created_utc": "1641213602.0", "edited": "1641214315.0", "id": "hr2edt9", "is_submitter": "False", "link_id": "t3_ruztox", "parent_id": "t1_hr29uuv", "score": "126", "subreddit": "coys", "subreddit_id": "t5_2ryq7"}, {"author": "Aurazai", "body": "Poor Joe Rodon, can't get into the team at all even with 3 at the back, Romero out and Davies benched. Will he be moving on in the summer?", "created_utc": "1640528470.0", "edited": "False", "id": "hq0z8ob", "is_submitter": "False", "link_id": "t3_roxhk0", "parent_id": "t1_hq0xdco", "score": "20", "subreddit": "coys", "subreddit_id": "t5_2ryq7"}, {"author": "Aurazai", "body": "God I just remembered that. Actually so pumped to see round 2 of Japh vs. Zaha. Anything less than a yellow for the both of them will be a disappointment!", "created_utc": "1640527824.0", "edited": "False", "id": "hq0y58t", "is_submitter": "False", "link_id": "t3_roxhk0", "parent_id": "t1_hq0xia6", "score": "32", "subreddit": "coys", "subreddit_id": "t5_2ryq7"}, {"author": "Aurazai", "body": "Don't worry, he'll be available for the Argies next international break.", "created_utc": "1640527740.0", "edited": "False", "id": "hq0y09l", "is_submitter": "False", "link_id": "t3_roxhk0", "parent_id": "t1_hq0xb3e", "score": "20", "subreddit": "coys", "subreddit_id": "t5_2ryq7"}, {"author": "Aurazai", "body": "I'm sure he's not gonna get a chance today, but I'd love to see Gil go for a run out. \n\nAll the talk of the Dele/Winks/Davies/Bergwijn renaissance lately but my boy Bryan the 5th Beatle hasn't had a real look in from Conte at all it seems. Any clues as to why? It's getting the point where tier 99 news outlets are saying he's frustrated enough to be interested in a loan away for some game time.", "created_utc": "1640527630.0", "edited": "False", "id": "hq0xtpq", "is_submitter": "False", "link_id": "t3_roxhk0", "parent_id": "t3_roxhk0", "score": "18", "subreddit": "coys", "subreddit_id": "t5_2ryq7"}, {"author": "Aurazai", "body": "Pogba speaks Spanish and is actually married to a Bolivian, so that's definitely the language he speaks to Cavani in. Being a professional footballer must be such a fun way to immerse yourself in a language, you've got the language of the league you're in plus constantly being surrounded by native speakers from everywhere across the globe!", "created_utc": "1640468107.0", "edited": "False", "id": "hpyf440", "is_submitter": "False", "link_id": "t3_robopv", "parent_id": "t1_hpxun78", "score": "11", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Aurazai", "body": "This is why I subscribe to this sub", "created_utc": "1635767317.0", "edited": "False", "id": "hivgtcl", "is_submitter": "False", "link_id": "t3_qkc1r6", "parent_id": "t3_qkc1r6", "score": "118", "subreddit": "coys", "subreddit_id": "t5_2ryq7"}, {"author": "Aurazai", "body": "Holy fuck. United can have their 3 points, we're the real winners if he signs da ting today.", "created_utc": "1635763194.0", "edited": "False", "id": "hivbaqh", "is_submitter": "False", "link_id": "t3_qkb3se", "parent_id": "t3_qkb3se", "score": "127", "subreddit": "coys", "subreddit_id": "t5_2ryq7"}, {"author": "Aurazai", "body": "JB is LIVE\n\nhttps://www.youtube.com/watch?v=E8XC948X2hY", "created_utc": "1633104526.0", "edited": "False", "id": "hezmt5a", "is_submitter": "False", "link_id": "t3_pz5ml9", "parent_id": "t3_pz5ml9", "score": "17", "subreddit": "GabbyPetito", "subreddit_id": "t5_51bf5n"}, {"author": "Aurazai", "body": "Try https://www.languagetransfer.org/complete-spanish\n\nIt’s a highly recommended free audio course focused on giving you speaking skills in a very easy to learn way.", "created_utc": "1632983206.0", "edited": "False", "id": "hetlc7b", "is_submitter": "False", "link_id": "t3_py1kuk", "parent_id": "t1_hespft6", "score": "2", "subreddit": "preppers", "subreddit_id": "t5_2riow"}, {"author": "Aurazai", "body": "ARE YOU WATCHING, HARRY KANE!!", "created_utc": "1629048496.0", "edited": "False", "id": "h91xvsv", "is_submitter": "False", "link_id": "t3_p4xny1", "parent_id": "t1_h91x0de", "score": "74", "subreddit": "coys", "subreddit_id": "t5_2ryq7"}, {"author": "Aurazai", "body": "HE'S ONE OF OUR OWN", "created_utc": "1629048321.0", "edited": "False", "id": "h91xg18", "is_submitter": "False", "link_id": "t3_p4xny1", "parent_id": "t1_h91wztr", "score": "93", "subreddit": "coys", "subreddit_id": "t5_2ryq7"}, {"author": "Aurazai", "body": "Tanganga absolutely rinsed Sterling AND kept Grealish quiet. \n\nJaphet Tanganga, HE'S ONE OF OUR OWN.", "created_utc": "1629048228.0", "edited": "False", "id": "h91x7gy", "is_submitter": "False", "link_id": "t3_p4xnq1", "parent_id": "t3_p4xnq1", "score": "1", "subreddit": "coys", "subreddit_id": "t5_2ryq7"}, {"author": "Aurazai", "body": "Gollini’s been here two minutes on loan and he’s already the club’s welcoming ambassador. Proper yid that fella!", "created_utc": "1628273205.0", "edited": "False", "id": "h7yo3w9", "is_submitter": "False", "link_id": "t3_ozbvfi", "parent_id": "t1_h7ymyi4", "score": "198", "subreddit": "coys", "subreddit_id": "t5_2ryq7"}, {"author": "Aurazai", "body": "Thank you this is all so interesting to learn!\n\nBased on what you said I spent some time watching a Brazilian journalist interview Jorge Jesus in Portuguese and funnily enough, they gave *him* Portuguese subtitles but not the journalist. It honestly didn't seem too hard to understand what Jesus was saying when I could follow along with the subs (using my Spanish to understand maybe 80% of written Portuguese), but I could definitely hear how a Brazilian might have trouble with the accent if they're not use to it. Those Portuguese folks just love to mumble and drop letters at the end of words! Fascinating stuff from a cultural perspective.\n\nAnd even if it is only a small amount of people, it is still very cool to see there are more Brazilian fans than just that one kid who loved Lucas in the Amazon doc!", "created_utc": "1628186472.0", "edited": "False", "id": "h7u31r1", "is_submitter": "False", "link_id": "t3_oydt41", "parent_id": "t1_h7tqpx1", "score": "3", "subreddit": "coys", "subreddit_id": "t5_2ryq7"}, {"author": "Aurazai", "body": "Thanks for your insight! I'm very curious, of all the teams to follow in Europe what made a Brazilian like yourself follow Spurs? All the Brazilians I know only follow their local team plus maybe Real Madrid, Barca or PSG as their European team and I thought that was the norm. \n\nAlso, does the Portuguese league get any attention in Brazil at all?", "created_utc": "1628177836.0", "edited": "False", "id": "h7ti1dg", "is_submitter": "False", "link_id": "t3_oydt41", "parent_id": "t1_h7svupw", "score": "3", "subreddit": "coys", "subreddit_id": "t5_2ryq7"}, {"author": "Aurazai", "body": ">why do you care about the source of the money?\n\nI'd expect about as much from a Chelsea fan.\n\n>might as well sell to a club willing to pay the sum.\n\nThat's the thing. Kane's trying to force a move because City won't pay the 150mm+ sum. They only bid 100 million for him which is a piss take if that's what Grealish is worth to Villa. We'll let him go if they pay the fee.", "created_utc": "1627905937.0", "edited": "False", "id": "h7f50qp", "is_submitter": "False", "link_id": "t3_owbehq", "parent_id": "t1_h7f3omj", "score": "18", "subreddit": "coys", "subreddit_id": "t5_2ryq7"}, {"author": "Aurazai", "body": "Here comes the Son do do do do", "created_utc": "1626783268.0", "edited": "False", "id": "h5v7c9q", "is_submitter": "False", "link_id": "t3_oo0jg7", "parent_id": "t1_h5v5oa2", "score": "32", "subreddit": "coys", "subreddit_id": "t5_2ryq7"}, {"author": "Aurazai", "body": "I don't blame Ryan Mason for losing the cup final but I'll always harbour some feelings of resentment for not starting or even subbing in Ndombele. Man played Winks and Sissoko over our record signing who was fit.\n\nThat match ended up being far more winnable than it looked from the outset yet our inability to progress the ball during it without Tanguy I'm sure was a significant reason why we only managed to have two shots on goal over 90 minutes. Just ludicrous.", "created_utc": "1625910305.0", "edited": "False", "id": "h4oq5gd", "is_submitter": "False", "link_id": "t3_ohcd5k", "parent_id": "t1_h4omf9r", "score": "9", "subreddit": "coys", "subreddit_id": "t5_2ryq7"}, {"author": "Aurazai", "body": "Not being American I had to google Emmett Till, and I have to wonder if in general most Americans would really still have bad connotations over an occurrence in the 1950s. For me my first thought upon hearing the name is Emmett Brown from Back to the Future, which makes me like it even more!", "created_utc": "1625764515.0", "edited": "False", "id": "h4ht196", "is_submitter": "False", "link_id": "t3_og7om4", "parent_id": "t1_h4hitwe", "score": "19", "subreddit": "namenerds", "subreddit_id": "t5_2xmrc"}, {"author": "Aurazai", "body": "Probably Sanchez because he'd be worth a lot more than Dier, although huge doubt we'd get close to what we paid for him.\n\nDier can also play as a makeshift CDM which would be nice to have as a backup 3rd choice to Hojbjerg and Skipp should those two make the injury list. For the same reason it'd also make sense to keep him if we offloaded Winks and Sissoko, which I hope to god we do.", "created_utc": "1620995683.0", "edited": "False", "id": "gy3caol", "is_submitter": "False", "link_id": "t3_nc6w24", "parent_id": "t1_gy3ae66", "score": "20", "subreddit": "coys", "subreddit_id": "t5_2ryq7"}, {"author": "Aurazai", "body": "less of dat fam", "created_utc": "1614469938.0", "edited": "False", "id": "gp3ku8s", "is_submitter": "False", "link_id": "t3_ltytdx", "parent_id": "t1_gp3drd4", "score": "24", "subreddit": "coys", "subreddit_id": "t5_2ryq7"}, {"author": "Aurazai", "body": "That bit about Japhet in the All or Nothing doc made me love him so much. I just want a shy guy like him succeed and make his family proud. Ugh my heart.", "created_utc": "1613235287.0", "edited": "False", "id": "gn8rgkt", "is_submitter": "False", "link_id": "t3_lj3q7o", "parent_id": "t1_gn8m0dy", "score": "26", "subreddit": "coys", "subreddit_id": "t5_2ryq7"}, {"author": "Aurazai", "body": "He's wasted on the wing because he's straight up not a goalscorer, but in terms of creativity and seeking out opportunities he's not far behind being one of the best in the squad. Always hungry for the ball and up to making challenges. It's just unfortunate he's made of glass.", "created_utc": "1612706775.0", "edited": "False", "id": "gmfp8jh", "is_submitter": "False", "link_id": "t3_lemtl0", "parent_id": "t1_gmfobk7", "score": "27", "subreddit": "coys", "subreddit_id": "t5_2ryq7"}, {"author": "Aurazai", "body": "Love it. It's not as easy but it's significantly more rewarding. Best of luck amigo!!", "created_utc": "1609173102.0", "edited": "False", "id": "ghastsf", "is_submitter": "False", "link_id": "t3_kle363", "parent_id": "t1_ghapd37", "score": "1", "subreddit": "French", "subreddit_id": "t5_2rd5t"}, {"author": "Aurazai", "body": "Sure! Sorry in advance for this huge and repetitive write up, this is such a minor thing yet I'm still pretty irrationally pedantic about it for some reason. But ask and you shall receive! \n\n\\_\\_\\_\\_\\_\\_\\_\\_\n\nSo when you practice translating from the target language into English, you are only learning to ***recognise*** the meaning of words or phrases. Think about people (heritage speakers) who say they can 'understand their parent's language but can't speak it.' They only have this ability of recognition.\n\nNow when you translate from English into your target language, you are effectively learning to ***produce*** your target language from the top of your head. You are recalling vocabulary and with phrases you are practicing how to use them with the correct grammar. This is that crucial speaking component that many heritage speakers lack. \n\nBeing able to recognise what a french word means does not guarantee that you can produce it when you need it. I frustratingly learned this myself a thousand times over through trial and error. However, being able to produce a word (via translating from English -> French) *always* means you understand it, because you just translated from an English word you already understand! You are getting a 2-in-1 combo just doing English to French translation!\n\nDoes this mean that translating from the target language back into English is not useful? Of course not. But it is significantly less efficient than Native > Target. \n\nNow think of the time investment you have to put in to language learning. Don't you want to learn as quickly as possible in a way that is still completely effective? I know I do. I don't have that much free time to dedicate to language learning per day, and what I do have I split up between multiple different languages. With this in mind I want all my learning to be as efficient and effective as possible. \n\nSo here's my options:\n\n1) Choose  option A, with no guarantee of also getting 100% of option B\n\n2) Choose option B that gives you 100% of option A as a byproduct anyway\n\n3) Choose both A & B, which is double the time double the effort double the work!\n\nMy choice is pretty obviously B. If you have the time and commitment to do both then go wild. But as a busy person I'm happy just to get the most bang for my buck and I already know through experience that I'm really not losing out on anything by doing so. Hope my rambling helped!", "created_utc": "1609163856.0", "edited": "False", "id": "ghads86", "is_submitter": "False", "link_id": "t3_kle363", "parent_id": "t1_ghaa10v", "score": "7", "subreddit": "French", "subreddit_id": "t5_2rd5t"}, {"author": "Aurazai", "body": "Everyone has offered general advice but nobody yet has offered an actual book or course to start with. So here's my recommendation.\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n1. Do Michel Thomas (2-3 weeks depending on daily pace) - mp3s easily found online. Do Foundation > Advanced > Language Builder > Vocabulary. This course is a grammar book in audio format. Super easy learning. You'll be A1 by the end of it.\n2. Assimil. Do 'New French with Ease' (100 days) then the Advanced book (70 days). Use anki flashcards and log every word and phrase you learn with its english translation. Revise your flashcards everyday (Translate English into French, don't bother the other way if you value your time). You will be A2 by this point, possibly bordering on B1. That's pretty much the level you're asking for.\n3. Practice practice practice. Find a native speaker (not your SO) like a teacher on italki to converse with. Watch the Easy French series on YT and use it the same way you would Assimil. Find some french shows on netflix and use a chrome extension that gives you subtitles in two languages. As a recommendation, Les Beaux Malaises is a fantastic quebecois sitcom with tonnes of modern Quebec-isms. Just increase exposure.\n\n**This is the** ***exact*** **method I used to become conversational in French, and the same approach I am using for Spanish and Portuguese.** There are other courses and some people don't like Michel Thomas and Assimil, but there's no doubting they're actually very efficient learning tools (so long as you continue to revise them using your anki flashcards that you made along the way, revision of what you've learnt so it sticks is like 75% of language learning).\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\nNow that you are here you only need to increase your vocabulary, usage and actual exposure to the language in order to improve, so do that along with your consistent practice. That is all anyone has to do to go from conversational to B2+ fluent.\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\nWord of advice.\n\nYes you have your partner there to help, but from experience I can say it will begin to annoy them constantly asking for help. My SO from Le Mans (who originally loved my efforts to learn) even asked me after a while if I was only dating her because she was french considering the amount of language and culture questions I was asking. They want to be your SO not your teacher. Start talking to them more in French once you're at least A2 when you've mastered the basics, so the level of annoying is more 'what does that uncommon word you said mean?' and not 'what's the difference between le, y, and en?' like they're a grammar teacher.\n\nP.S. the difference between French from France and from Quebec is not so different that you need to learn using different resources. 99% of courses are French from France, so just use them. By the time you are A2 you will be able to distinguish the differences fairly intuitively and you can use Quebec TV shows/youtube/any media to learn le joual (slang).", "created_utc": "1609126981.0", "edited": "False", "id": "gh97m6g", "is_submitter": "False", "link_id": "t3_kle363", "parent_id": "t3_kle363", "score": "27", "subreddit": "French", "subreddit_id": "t5_2rd5t"}, {"author": "Aurazai", "body": "For some strange reason I just thought commentators knew these things off the top of their head as if they were all trivia geniuses, like The Beast on a football version of the Chase. Most of them are pretty studious and intelligent after all, I know Derek Rae always researches how to pronounce every footballers name correctly in their native language (Bruno Fernange anyone?) and uses his fluent German for added knowledge/effect to his English commentary of the Bundesliga. So cool to see that they really do their homework!", "created_utc": "1608897684.0", "edited": "False", "id": "ggze79f", "is_submitter": "False", "link_id": "t3_kjxjqe", "parent_id": "t3_kjxjqe", "score": "120", "subreddit": "coys", "subreddit_id": "t5_2ryq7"}, {"author": "Aurazai", "body": "Many months. I'm sorry I can't quite give you a true A-B timeline as my results would be skewed because I was also lifting and I lost about 12kg between the time I began and the time I ended (the lighter you are the easier push-ups become). I also don't quite remember lol.\n\n I did it 3-4x per week as a finisher after my gym workouts. I wouldn't look too much into the timeline to be honest, the program is solid but everyone progresses differently particularly with nutrition/recovery and other training factored in.\n\nI got the idea from [this video](https://www.youtube.com/watch?v=Bp548QfrlnE) of a guy in the Australian Army who gives a more thorough breakdown if you're interested.", "created_utc": "1608283969.0", "edited": "1608284431.0", "id": "gg8j5u4", "is_submitter": "False", "link_id": "t3_kfh1qd", "parent_id": "t1_gg8hz6s", "score": "3", "subreddit": "Fitness", "subreddit_id": "t5_2qhx4"}, {"author": "Aurazai", "body": "I like this advice. To add to that I’d say a solid protocol for daily pushups is find your max number (until absolute failure), then each day do 3 sets of max/2. At the end of each week do a retest of your max, and adjust from there. Got my push-ups from 15 into the 100’s with this method.", "created_utc": "1608281070.0", "edited": "False", "id": "gg8g49g", "is_submitter": "False", "link_id": "t3_kfh1qd", "parent_id": "t1_gg8ftna", "score": "15", "subreddit": "Fitness", "subreddit_id": "t5_2qhx4"}, {"author": "Aurazai", "body": "Dier to concede a handball in the box at the 87th minute?", "created_utc": "1604833693.0", "edited": "False", "id": "gblia23", "is_submitter": "False", "link_id": "t3_jq9z47", "parent_id": "t1_gblhqiv", "score": "61", "subreddit": "coys", "subreddit_id": "t5_2ryq7"}, {"author": "Aurazai", "body": "Super adorable! Can't help but feel there was a missed opportunity not to get a personalised kit with \"Father 7\" for yourself and \"Son 7\" for the little one. Maybe your next purchase when he outgrows this one?", "created_utc": "1604267501.0", "edited": "False", "id": "gau1tuc", "is_submitter": "False", "link_id": "t3_jmaed9", "parent_id": "t3_jmaed9", "score": "18", "subreddit": "coys", "subreddit_id": "t5_2ryq7"}, {"author": "Aurazai", "body": "And he fucking delivered. COYS", "created_utc": "1604265488.0", "edited": "False", "id": "gatxubt", "is_submitter": "False", "link_id": "t3_jma6sz", "parent_id": "t1_gatxb1n", "score": "95", "subreddit": "coys", "subreddit_id": "t5_2ryq7"}, {"author": "Aurazai", "body": "Yeah a heads up you probably don’t want to upload these kinds of photos to reddit  using an account with your real name. Try Lee, there’s a million Lees.", "created_utc": "1601542579.0", "edited": "False", "id": "g79oyba", "is_submitter": "False", "link_id": "t3_j341rr", "parent_id": "t3_j341rr", "score": "64", "subreddit": "GettingShredded", "subreddit_id": "t5_372io"}, {"author": "Aurazai", "body": "I can only really speculate so please don't take what I say as 100% fact, but I'll give it a shot.\n\nThat said, I won't name any names but I will say I have a small bit of insider knowledge into the world of PEDs and Crossfit.\n\nOne of my buddies from my box that I know for a fact is on gear actually qualified for the Games this year, but FWIW he didn't end of going due to covid, travel restrictions, and the change in format for games qualification after the fact. I'm on gear also but for vanity reasons, not to compete.\n\nSo the thing with steroids is that strength really doesn't go away off cycle the way many people think. Unless you've got unreal strength numbers beyond what is capable naturally (which basically no one in crossfit does) or you drastically cut weight after, you'll maintain most of what you gain. In my experience coming off of a basic test cycle, my squat PR of 200kg/440lb for 5 reps dropped to 2 reps after about 3-4 weeks. So you can see from that, it's really not a massive drop.\n\nNow with Kara, she has always been one of the strongest female athletes at the games long before her pregnancy, so the primary reason for Kara to use steroids or SARMs (strength and muscle mass) isn't really there. She already has adequate strength for all her competitive needs and so she really only has to focus on maintaining that whilst building her aerobic engine.\n\nSo really for her, she could do that with minimal to no PED use. But of course keep in mind that doesn't discount any previous use to get her strength to that level in the first place. There are also compounds for cardiovascular performance (e.g. Lance Armstrong's favourite drug of choice Erythropoietin (EPO), or a very popular drug in crossfit used by the likes of Ricky Garard GW-501516) but they are both extremely dangerous and I imagine a pregnant/breastfeeding athlete wouldn't take that risk.\n\nThere's a lot of broscience and bullshit in the PED world but if you want to learn more I think the r/steroids wiki is the highest rated source of information out there. r/steroidsxx is also there for the women side of things. Again I'm really just speculating, for all I know Kara Saunders could easily be natural and personally I still believe there are many games athletes who are also. I hope this was informative for you!", "created_utc": "1600517445.0", "edited": "False", "id": "g5t18y6", "is_submitter": "False", "link_id": "t3_iupm0a", "parent_id": "t1_g5syjli", "score": "3", "subreddit": "crossfit", "subreddit_id": "t5_2qqfd"}, {"author": "Aurazai", "body": "I research a lot about doping in sports and my theory is that both Tia and Mat have transcended the need to even test clean ever.\n\nCrossfit hires a private company (not USADA) to do its testing a reserves the right to who they bust publicly. They're not going to destroy the male and female faces of their own brand and destroy their integrity as a sport for the sake of morality. Ricky Garard was used as the sacrificial lamb so they could say that they do bust top athletes, but in reality he was a rookie and had no skin in the game. At the end of the day it's a business with a pro sport marketing hustle. They have to protect the business.\n\nOnce you have the guarantee that you'll never be busted by the top brass, you basically have free reign to dope year round on any dosage. Meanwhile many of their competitors have to carefully schedule their protocols around testing during competitions as well as random testing (games athletes are informed by email which months they are subject to random testing). They also have free reign compared to the other athletes as to what types of compounds they can use, as certain drugs are detectable in the body for months whilst others can be completely cleared within 48 hours.\n\nSo essentially, even though we can be assured that many of the athletes are not natural, Mat and Tia (and maybe a handful of others like Katrin for example) have a lot more freedom than others when it comes to PED usage and that is what helps give them the edge in an already dirty playing field. Again this is just my theory and this isn't to take away from what they've accomplished, they're still super athletes with immense levels of dedication coupled with top tier training and the necessary diet for their lifestyle and recovery. Just my 2c.", "created_utc": "1600474963.0", "edited": "False", "id": "g5rey4q", "is_submitter": "False", "link_id": "t3_iupm0a", "parent_id": "t1_g5qhffh", "score": "7", "subreddit": "crossfit", "subreddit_id": "t5_2qqfd"}, {"author": "Aurazai", "body": "There were obviously tonnes of edits to make the team, Levy and Mourinho look good, but there was very little if any in the way of ‘acting’ for the cameras. At least according to José Mourinho himself.\n\n“It’s real. Nothing is fake. I think we all forgot very very fast that the cameras were everywhere. The majority of the cameras are hidden. Everything in the training grounds, offices, medical rooms, meeting rooms. The only moments where we can see the cameras is when we travel, when we go to away matches, in the away dressing rooms. But even then, we have no time during competition to be thinking about it.” \n\nhttps://www.twitter.com/FootballJOE/status/1303656762814455814?s=19", "created_utc": "1599835831.0", "edited": "False", "id": "g4tu655", "is_submitter": "False", "link_id": "t3_iqpat6", "parent_id": "t1_g4tpjz3", "score": "21", "subreddit": "soccer", "subreddit_id": "t5_2qi58"}, {"author": "Aurazai", "body": "Does being a really great driver make you a mechanic?", "created_utc": "1598413489.0", "edited": "False", "id": "g2vkhin", "is_submitter": "False", "link_id": "t3_ignq7t", "parent_id": "t1_g2v5nok", "score": "11", "subreddit": "Fitness", "subreddit_id": "t5_2qhx4"}, {"author": "Aurazai", "body": "Normally yes but I'm not from the United Arab Emirates", "created_utc": "1597526387.0", "edited": "False", "id": "g1nn101", "is_submitter": "False", "link_id": "t3_iaf2w8", "parent_id": "t1_g1nhroq", "score": "9", "subreddit": "soccer", "subreddit_id": "t5_2qi58"}, {"author": "Aurazai", "body": "Tyrannical, not fascist specifically. Tyranny doesn't conform to a specific ideology, it can happen in any form.", "created_utc": "1590918412.0", "edited": "False", "id": "fseqgpe", "is_submitter": "False", "link_id": "t3_gtsaam", "parent_id": "t1_fseo225", "score": "456", "subreddit": "PublicFreakout", "subreddit_id": "t5_2yrq6"}, {"author": "Aurazai", "body": "The breaststroke is the closest thing competitive swimmers do that mimics the combat side stroke. Here are some of the top Olympic athletes using the absolute most optimal form for maximum speed. So if you want a better swim time in the pool using CSS, try your best to copy how these guys make their turns.\n\nThe main lessons here are:\n\n1. Push more downwards off the wall, you want to get deep so you can maintain your underwater glide for a greater distance.\n2. Use one big dolphin kick with the double arm pull.\n3. Keep your head facing downwards. This will keep your body streamline. A good cue is to squeeze your biceps into your ears with your arms perfectly straight above you. If your ears don't touch your biceps, either your arms are too low, your head is too high or low, or your elbows aren't locked into a perfectly straight position.\n\nThe only difference you might want to have from the above example is that as you are about to breach the surface to breathe and start your stroke, your second kick should be a scissor kick instead of the breaststroke kick like shown in the gif. Otherwise the turn, glide, and double arm pull are the exact same.", "created_utc": "1587458128.0", "edited": "1587458474.0", "id": "fo2ddr4", "is_submitter": "False", "link_id": "t3_g5b8v4", "parent_id": "t3_g5b8v4", "score": "23", "subreddit": "navyseals", "subreddit_id": "t5_2vp9k"}, {"author": "Aurazai", "body": "I had a proper laugh reading OP's comment. Just a guy who can't face facts.\n\nEven if there's some merit in saying that the premier league may be of a lower competitive standard than years previous, how do you explain Liverpool making back to back appearances in the Champions League final? Is this lad trying to say that not only is the premier league getting shitter, the rest of European football is taking a nose dive as well?", "created_utc": "1581426419.0", "edited": "False", "id": "fhaterk", "is_submitter": "False", "link_id": "t3_f252k5", "parent_id": "t1_fhajbq8", "score": "4", "subreddit": "reddevils", "subreddit_id": "t5_2rxse"}, {"author": "Aurazai", "body": "Wow wonderful, you answered my question in every way. Thank you!", "created_utc": "1570702524.0", "edited": "False", "id": "f361d45", "is_submitter": "False", "link_id": "t3_dfufs0", "parent_id": "t1_f35vqy0", "score": "3", "subreddit": "French", "subreddit_id": "t5_2rd5t"}, {"author": "Aurazai", "body": "To add to that, the escorts would normally be over the horizon from the carrier thanks to the long range power of radar. As a general rule, if you ever see pictures of tight formations where all escort ships are visible - it's probably for a photo op.", "created_utc": "1564050119.0", "edited": "False", "id": "euusvwe", "is_submitter": "False", "link_id": "t3_chj2bd", "parent_id": "t1_euuprwq", "score": "36", "subreddit": "WarshipPorn", "subreddit_id": "t5_2tg3p"}, {"author": "Aurazai", "body": "Great idea, you'll be thrilled to finally understand all the shit talking they do behind your back. Pinche gringo! (means 'Good luck!' in Spanish)", "created_utc": "1546025709.0", "edited": "False", "id": "ecr12q4", "is_submitter": "False", "link_id": "t3_aach6w", "parent_id": "t3_aach6w", "score": "205", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Aurazai", "body": "When you put it like that, it's easy sympathize with and understand why Casillas was broken in tears when Real parted with him.", "created_utc": "1545917273.0", "edited": "False", "id": "ecnlfcz", "is_submitter": "False", "link_id": "t3_a9y99i", "parent_id": "t1_ecne73q", "score": "150", "subreddit": "soccer", "subreddit_id": "t5_2qi58"}, {"author": "Aurazai", "body": "It's a terrible tagline and completely false, but having done the Michel Thomas courses for French and Spanish I can tell you it's a pretty fantastic course.\n\nDoing the Foundation to the Advanced (about 15 hours of audio) gets you all the way up to the subjunctive in grammar. I also took French at University, and the absolute beginner track didn't get to this level until the end of two semesters (104 class room hours - 4x a week, 13 weeks per sem, 2 semesters).\n\nYou learn more vocabulary at university (kitchen utensils, clothing items, fairly arbitrary stuff) than with MT, but the grammar level is the same and Michel Thomas teaches languages with in my personal opinion, a phenomenally better method. Plus the cost (if you pay for it, arrr) is much cheaper than university classes for the same level of instruction, in a faster time.\n\nTake that value (time + money + content learned) for what you will.\n\nConsider my experience for what you will as well, but I think it's a bit rich to say that the course in your words, is a \"fucking scam\" if you've never used it and can't measure its value. Particularly as your only criticism is its marketing tagline, when practically every language course embellishes the level attainable with it. Build a bridge and get over it, marketing is and has always been marketing. My favourite course for example is Assimil, and these guys push hard with \"get to B2\" when their courses at best leave a learner who has memorised every line at B1, and the rest at A2.\n\nObviously there exists no program that will get you to 'fluency'.\n\nThat being said, MT is the perfect A1 beginner course in my opinion. You learn what you would at university in 1/4 of the time commitment, no textbooks, no homework, just audio. I pretty much recommend it to all new learners as *the* course to use if you want to dip your toe in a language and have no idea where to start.\n\nI had a terrible experience failing to learn a language in my teens so I stayed clear from ever trying again until years later. When I came back I started with Michel Thomas, and it gave me the structure and hand-holding I needed and what's more, it provided that break through moment where monolingual me learned that \"holy shit, learning another language is actually possible and not as impossibly difficult as I thought\". Don't get me wrong, other courses do that too, but Michel Thomas is one of the big names in language learning material for this reason specifically.\n\nMy only caveats are that:\n\n(1) apparently, the program works best with French, Spanish, German, and Italian because these are the languages they offer with a lot of English cognates (MT method relies heavily on them). I can vouch for French and Spanish, they're great. However, programs for the other languages have more mixed to negative reviews.\n\n(2) Michel Thomas doesn't have a native accent in any of the courses he teaches (the one's I listed above). Good pronunciation, but a heavy accent. Don't copy it and you'll be fine.\n\n(3) For Spanish beginners, use Language Transfer (free) instead. It's a superior course that uses almost the exact same method. For French, German, Italian - Michel Thomas still holds up well.\n\n&#x200B;\n\nOne last thing is that most of the courses are available *elsewhere* for you (us) cheap bastards. You need not pay such a hefty price if you know where to look.", "created_utc": "1542628753.0", "edited": "1542646443.0", "id": "ea11iex", "is_submitter": "False", "link_id": "t3_9yextm", "parent_id": "t1_ea0vxj2", "score": "17", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Aurazai", "body": "THE CAMEOS IN THIS EPISODE, no mames, güey! I was happy seeing Chepe and Pacho, but then...", "created_utc": "1542381728.0", "edited": "False", "id": "e9thhxa", "is_submitter": "False", "link_id": "t3_9xk602", "parent_id": "t3_9xk602", "score": "480", "subreddit": "narcos", "subreddit_id": "t5_2xopf"}, {"author": "Aurazai", "body": "Certainly is! UK's MoD sold us RFA Largs Bay back in 2011, right around the time they were making budget cuts and retiring the harriers. Pretty nifty ship she is, HMAS Choules fits right in with the Amphibious-oriented navy the RAN turned itself into at the beginning of this decade.", "created_utc": "1540639974.0", "edited": "False", "id": "e8jjwqg", "is_submitter": "False", "link_id": "t3_9rr7jj", "parent_id": "t1_e8ji863", "score": "3", "subreddit": "WarshipPorn", "subreddit_id": "t5_2tg3p"}, {"author": "Aurazai", "body": "I remember hearing him say on the French course something along the lines of \"I will build the foundation of the house for you, but you must furnish it yourself\" meaning that he'd give you all the basic grammatical tools necessary to build any sentence you want to say, but after than you've got to seek out new vocabulary and build the other skills like listening yourself. I think that's a great way to put it.\n\nIn my opinion MT is the best absolute beginner course for those who want to start learning but really have no idea *how or where* to start (because it gives you a real and usable speaking ability the quickest), and especially those who aren't keen on slugging through a physical grammar book or going to language classes.", "created_utc": "1534990306.0", "edited": "False", "id": "e4o5ghw", "is_submitter": "False", "link_id": "t3_99gcy2", "parent_id": "t1_e4o1fdi", "score": "26", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Aurazai", "body": "That kid has some serious striking power. Agreed 100&#37;, he should've started. ", "created_utc": "1530116380.0", "edited": "False", "id": "e1dwpv2", "is_submitter": "False", "link_id": "t3_8uaq4q", "parent_id": "t1_e1dvf90", "score": "21", "subreddit": "soccer", "subreddit_id": "t5_2qi58"}, {"author": "Aurazai", "body": "This is why VAR is so important, and so game changing.", "created_utc": "1530116305.0", "edited": "False", "id": "e1dwm71", "is_submitter": "False", "link_id": "t3_8uaq4q", "parent_id": "t1_e1dw4ig", "score": "57", "subreddit": "soccer", "subreddit_id": "t5_2qi58"}, {"author": "Aurazai", "body": "Get out the sandpaper lads we need a fuckin miracle", "created_utc": "1530025658.0", "edited": "1530025737.0", "id": "e1bmbzv", "is_submitter": "False", "link_id": "t3_8u00jl", "parent_id": "t3_8u00jl", "score": "5", "subreddit": "soccer", "subreddit_id": "t5_2qi58"}, {"author": "Aurazai", "body": "Are [these](https://media.defense.gov/2014/Oct/04/2001104166/-1/-1/0/588242-T-PQG77-322.jpg) the same thing on the V-22 Osprey? They look particularly bad ass in my opinion.\n", "created_utc": "1525085469.0", "edited": "False", "id": "dy7fb4k", "is_submitter": "False", "link_id": "t3_8fxto5", "parent_id": "t1_dy7ce5p", "score": "152", "subreddit": "Military", "subreddit_id": "t5_2qh8y"}, {"author": "Aurazai", "body": "As the old saying goes, \"The Army sleeps under the stars, the Navy navigates by the stars, and the Air Force chooses their hotels by the stars.\"\n", "created_utc": "1509416832.0", "edited": "False", "id": "dp4irgf", "is_submitter": "False", "link_id": "t3_79opxb", "parent_id": "t1_dp4bwsf", "score": "936", "subreddit": "Jokes", "subreddit_id": "t5_2qh72"}, {"author": "Aurazai", "body": "**French:** https://www.youtube.com/playlist?list=PLA5UIoabheFMYWWnGFFxl8_nvVZWZSykc\n\nEasy languages has 60+ interview-style videos on youtube where a native French speaker travels around French-speaking areas and chats with the locals on the street about a range of common topics. You get to hear real french being spoken casually (i.e. lots of slang and sayings!) with a range of different accents. Definitely not beginner material, although it does start out quite simple in the first few videos. \n\nEach video is about 5 minutes in length with both English and French subtitles on screen, so easy to follow along. Given the length, you can generally go through them quite quickly but I tend to be pausing a lot and replaying, as well as scribbling down new vocabulary to add to anki. I don't think there's been a single video where I haven't encountered a new word or phrase.\n\nIt's an awesome free resource. They also have 180+ videos of the same style for German and 50+ for Spanish if anyone else is learning those languages.\n\n**German:** https://www.youtube.com/playlist?list=PL3936178A38BB5F87\n\n**Spanish:** https://www.youtube.com/playlist?list=PLA5UIoabheFMo9oB_AF7JftV34ecOalvM", "created_utc": "1487438544.0", "edited": "False", "id": "ddwp2ii", "is_submitter": "False", "link_id": "t3_5urqz3", "parent_id": "t3_5urqz3", "score": "5", "subreddit": "French", "subreddit_id": "t5_2rd5t"}, {"author": "Aurazai", "body": "He's blond, he's pissed, he'll see you in the lists, LICHTENSTEIN! ", "created_utc": "1463500211.0", "edited": "False", "id": "d38wsg5", "is_submitter": "False", "link_id": "t3_4jpy57", "parent_id": "t1_d38rsjy", "score": "261", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}]