[{"author": "Azazyel616", "body": "A really nice picture. I recognized it instantly, because it was also used as Cover Art for the \"The Dark Eye\"-Anthology \"Questadores\" . I have had the book for several years, but only learned today that the art was by Howe. Amazed.", "created_utc": "1665912679.0", "edited": "False", "id": "isivt58", "is_submitter": "False", "link_id": "t3_y4qwmk", "parent_id": "t3_y4qwmk", "score": "2", "subreddit": "ImaginaryStatues", "subreddit_id": "t5_39182"}, {"author": "Azazyel616", "body": "That sounds awesome! I have never seen them play, but oh well, you can't have it all. Have been to a lot of awesome concerts by other bands that some people might have missed", "created_utc": "1665184920.0", "edited": "False", "id": "irgl8rg", "is_submitter": "False", "link_id": "t3_xxx89z", "parent_id": "t1_irgjve5", "score": "2", "subreddit": "tattoo", "subreddit_id": "t5_2qiud"}, {"author": "Azazyel616", "body": "Yeah, same! Really fitting, bc of the similarity of LeChucks name to Chuck Schuldiner... Remember the shirt LeChuck is wearing at the end of MI2?", "created_utc": "1665168149.0", "edited": "False", "id": "irfmqwy", "is_submitter": "False", "link_id": "t3_xxx89z", "parent_id": "t1_ired2ij", "score": "3", "subreddit": "tattoo", "subreddit_id": "t5_2qiud"}, {"author": "Azazyel616", "body": "Jepp! Je nach Interesse wären da z.B. zu empfehlen:\n\nHexenreigen - man hilft einem Hexenzirkel\n\nEin Fest für die Augen - Kriminalfall auf einer Feier in Aranien\n\nAngbarer Bock - man hilft ein paar Hobbi... äh Hügelzwergen, einen ungebetenen Gast loszuwerden, indem man ein Fass Bier braut und dafür ein altes Rezept sucht\n\nGrimme Herzen - Witcher-mäßige Story in Tobrien\n\nDer Dunkle Mhanadi - führt in eine Tempelruine im Flussdelta. Da kommt ein fordernder Dungeon umd ein fieser Bossgegner \n\nEs gibt auch noch weitere gute Heldenwerke und natürlich auch noch andere Kurzabenteuer. Von den älteren Sachen wäre vielleicht \"Die Stadt des toten Herrschers\" was? Oder \"Der Wolf von Winhall\"?  Allerdings, die alten Sachen sind zwar nicht lang, aber schon oft schwierig an einem einzelnen Termin zu schaffen.", "created_utc": "1663430313.0", "edited": "False", "id": "iot69bb", "is_submitter": "False", "link_id": "t3_xgkg9o", "parent_id": "t1_iosdgig", "score": "10", "subreddit": "DSA_RPG", "subreddit_id": "t5_2vjcr"}, {"author": "Azazyel616", "body": "Sorry, ich für meinen Teil bin da nicht dabei, ich hab grad schon sehr viele aktive Runden 😅 Aber wenn jemand hier mitliest und sucht, meldet euch!", "created_utc": "1662710780.0", "edited": "False", "id": "inp967r", "is_submitter": "False", "link_id": "t3_x8epgu", "parent_id": "t1_inp8ymx", "score": "1", "subreddit": "PenandPaperGermany", "subreddit_id": "t5_j2h4y"}, {"author": "Azazyel616", "body": "Habe den Namen schon mal gehört, was genau macht das Modul denn so gut?", "created_utc": "1662585373.0", "edited": "False", "id": "ini6d4b", "is_submitter": "False", "link_id": "t3_x8epgu", "parent_id": "t1_inhz2kz", "score": "1", "subreddit": "PenandPaperGermany", "subreddit_id": "t5_j2h4y"}, {"author": "Azazyel616", "body": "Am besten scheint es zu laufen, wenn ich als Meister den goldenen Mittelweg finde zwischen offener Sandbox und vorbereitetem Plot. Die Sandbox kann dazu führen, dass Spieler überfordert sind und nicht wissen, was sie tun sollen, Railroading derweil nimmt den Spielern ihre Handlungsfreiheit. \n\nIch meistere vor allem DSA. Da habe ich aus Spielleitersicht denke ich offene Stadtsettings am besten geschafft. Einmal haben wir in Grangor gespielt, das Abenteuer \"Fest der Schatten\". Es ist ursprünglich sehr railroadig geschrieben, aber ich hab versucht es aufzubrechen, die SC konnten innerhalb der Stadt rumrennen und an sich alles machen was sie wollten. Dazu gab es auch einige Anlaufstellen mit Ansprechpartnern und Sachen zu tun z.B. Feste besuchen, shoppen, flirten, sie haben eine Stadtvilla gekauft, da hat es später einen Einbruch gegeben, den sie verhindert haben, und der Dieb der Gruppe hat selbst anderswo einen begangen. \nSowas halt. Und ich hab dazwischen beschrieben, wie die Problemspirale der Stadt sich immer weiter drehte, während die Helden der Lösung auf der Spur waren. Ein Kult hatte die Beschwörung eines Dämons verhauen, nicht nur kam etwas Mächtigeres, es lief nun auch noch frei herum, konnte nicht gesehen werden, wiegelte Leute auf und konnte nur mit einer MacGuffin-Waffe besiegt werden... \n\nAuch DSA, auch eine kleinere Stadt: \"Der Streuner soll sterben\" funktioniert mit der gleichen Prämisse sehr gut. Die Helden kriegen den Auftrag, in Thalusa einen Unschuldigen aus dem Gefängnis zu holen und vor dem Scharfrichter zu retten. Man sollte als Spielleiter einfach eine spannende Anreise gestalten und dann die Stadt möglichst als Sandbox verstehen und inszenieren. Wie genau sie die Zielperson rausboxen, müssen sich die SC selbst überlegen. \n\nAls Spieler fand ich \"Schloss Strobanoff\" und \"Über den Greifenpass\" sehr cool. Im ersteren hat ein früherer Abenteurer sich ein Schloss gekauft, aber nun ist er verschwunden und mehrere Gruppen interessieren sich für die Hinterlassenschaften. Es gibt einige Indiana Jones-Anspielungen, etwa bei Fallen. \nIn \"Über den Greifenpass\" erlebt man Aventurien sehr bodenständig und einsteigerfreundlich, aber ohne dass es langweilig wäre. Jemand wird entführt und man nimmt die Verfolgung auf ins Gebirge, doch kommt bald der Winter, und wie lange ist der Pass noch offen? An dem Abenteuer gefällt mir, dass es sehr abwechslungsreich ist. Der Autor nimmt von allem das DSA gut macht etwas und mischt es gekonnt zusammen. \nAußerdem streut es geschickt Informationen an die Spieler, die vielleicht (viel) später in anderen Abenteuern nochmal dran kommen könnten, und dann fällt es einem wie Schuppen von den Augen, dass das ja schon damals im Greifenpass vorkam :)\nEs sollen auch einige Tipps für Meister drin sein, aber ich kenn es nur aus Spielersicht.", "created_utc": "1662584965.0", "edited": "False", "id": "ini5aqc", "is_submitter": "False", "link_id": "t3_x8epgu", "parent_id": "t3_x8epgu", "score": "0", "subreddit": "PenandPaperGermany", "subreddit_id": "t5_j2h4y"}, {"author": "Azazyel616", "body": "I've got three or four people close to me that kept recommending these, including my own dad. Everybody seemed to like these books - except me. I've read 'em both and tried really hard to see their appeal. Didn't care much for the 1st, maybe liked the 2nd a little better (yet that's the one that gets bashed on the internet*) - mainly for the descriptions of Kvothes gigs in the tavern. \n\n* for everyone complaining about the Felurian scenes: I get it, I didn't think much of those either, but please consider all the books are told by Kvothe himself, and he's a bard (u/independentchickpea pointed that out already). \n\n1. He tells us he met some girl in a tavern that laughed at him because he was still a virgin. \n\n2. Then he stumbles into some fairy realm where he meets the goddess-like fairy entity of making snu snu. \n\n3. Then he comes back to the tavern and makes love to the tavern wench from before. \n\nHe's a bard telling us of his first night(s) with women. So which of these events really happened and which are made up by Kvothe? Poetic retelling is a thing, and so is sheer boasting. To me, it's head canon that he simply met a girl in a tavern and followed her around, making puppy eyes until she gave in and they spent the night, which was, in his experience, like meeting a fairy - or at least he tells it that way.\n\nBut with both books I didn't really get what all the fuss was about. Most of the stuff was okay, I guess, but there never seems to be much plot to follow. Kvothe is just there doing stuff. \n\nI also never got into The Dark Tower. Read the 1st and it was alright, hated the 4th and could never finish it, so I've been stuck ever since.", "created_utc": "1662022987.0", "edited": "1662023424.0", "id": "immxkk9", "is_submitter": "False", "link_id": "t3_x2tt72", "parent_id": "t1_imlrldw", "score": "1", "subreddit": "Fantasy", "subreddit_id": "t5_2qknd"}, {"author": "Azazyel616", "body": "Yeah, really. Someone dear to me got hospitalized over that issue and now she's not allowed to take the birth control pill anymore. But all in all the situation got handled fast and she's safe. So thankful for the work of doctors and staff! Don't want to imagine how it could have gone.\n\nOP, I'm sorry for your loss.", "created_utc": "1661503914.0", "edited": "False", "id": "iluhmvf", "is_submitter": "False", "link_id": "t3_wxx42w", "parent_id": "t1_iltwmoc", "score": "110", "subreddit": "DnD", "subreddit_id": "t5_2r9ei"}, {"author": "Azazyel616", "body": "Me when I came looking for copper\n\n\n\nAnd found gold.", "created_utc": "1661503401.0", "edited": "False", "id": "iluh0ld", "is_submitter": "False", "link_id": "t3_wxhliz", "parent_id": "t1_ilto9fp", "score": "1", "subreddit": "DnD", "subreddit_id": "t5_2r9ei"}, {"author": "Azazyel616", "body": "This might be the question that's the hardest-to-answer for me. It's literally as if you had seen my Top 10 list and asked \"If I could play only ONE of these...\" \n\nThat being said, here's two answers: \n\n1. You can't make a wrong decision here. All of them are awesome. \n\n2. For your situation, I'd recommend BioShock, as it gives you 3 games at once, but the single entries can be played in relatively short time. So if you manage to get through one or two of them you still have something to look forward to afterwards.", "created_utc": "1661502739.0", "edited": "False", "id": "ilug8fe", "is_submitter": "False", "link_id": "t3_wxv962", "parent_id": "t3_wxv962", "score": "1", "subreddit": "ShouldIbuythisgame", "subreddit_id": "t5_2ud8h"}, {"author": "Azazyel616", "body": "If time is an issue: The shortest on my list was Gris. None of the other could be played in less than 10 hours. \n\nOuter Wilds and Hellblade are both managable, though. Both might be at 30 hours or so, maybe a bit more. \n\nBut I read your comment about having started Hades, so enjoy that one 😉 It will keep you entertained for quite a while, I guess.\n\nGames I forgot to mention: Darkest Dungeon, Vampire Survivors, Wildermyth. All awesome. Also don't know if The Banner Saga would count, each part of the trilogy can be played within 10-15 hours.", "created_utc": "1661419436.0", "edited": "1661425271.0", "id": "ilpmmh1", "is_submitter": "False", "link_id": "t3_wx6quk", "parent_id": "t1_ilpl44p", "score": "2", "subreddit": "gamingsuggestions", "subreddit_id": "t5_2sxyv"}, {"author": "Azazyel616", "body": "Outer Wilds (not to be confused with The Outer Worlds) is one of the best gaming experiences I've had. No combat, a lot of space exploration, sometimes funny, sometimes sad, featuring existential questions especially towards the end. \n\nAlso played about 200 hours of Hades, that was great fun. You can use different weapons for each run, and they actually change the feeling of it quite much. Also, awesome characters and soundtrack. \n\nAnd if you like such stuff, Hollow Knight was awesome. Small price, but giant world to explore. It's style is unlike any other game I know of. But you really have to like platformers, because this one is hard. \n\nIf you like it, you might also enjoy Celeste. It's about a girl trying to climb a mountain, but really it's a lot about mental health and trying to go on without quitting. Also hard. \n\nComparable topic, but much easier gameplay: Gris. A woman struggling with past trauma. Only takes about 4-5 hours to play.\n\nAaaand the same mental health topic again: Hellblade: Senua's Sacrifice. The home village of a pictish woman is razed by vikings and she has to cope. Some fighting but also a lot of environmental puzzles. \n\nStardew Valley. Plain awesome. But bring enough time, it might not let you go. \n\nHonorable mentions: \nSpiritfarer, \nSable, \nHeaven's Vault. \nHaven't played them yet so can't say much.", "created_utc": "1661417592.0", "edited": "False", "id": "ilpkdii", "is_submitter": "False", "link_id": "t3_wx6quk", "parent_id": "t3_wx6quk", "score": "11", "subreddit": "gamingsuggestions", "subreddit_id": "t5_2sxyv"}, {"author": "Azazyel616", "body": "Hab vor ein paar Tagen Wildermyth für mich entdeckt. Taktisches RPG auf Schachbrettfeldern, Kämpfe erinnern an DnD, mit mehreren Kampagnen (jede ca. 5-8 h). Dank Zufallselementen sowie kleinen Entscheidungsmöglichkeiten fühlt sich jede Kampagne auch persönlich an. Can recommend.", "created_utc": "1661200821.0", "edited": "False", "id": "ildb1p3", "is_submitter": "False", "link_id": "t3_wv3dj5", "parent_id": "t3_wv3dj5", "score": "1", "subreddit": "zocken", "subreddit_id": "t5_2vz1s"}, {"author": "Azazyel616", "body": "It's all a matter of taste and expectations, really. I watched all the stuff chronologically starting with C1. From my view, C2 took the longest to click, and the best episodes only came around 90-ish. Certainly not \"the best thing ever\" but quite entertaining. \n\nC1 will always hold a special place in my heart, but I can see that campaign took its time to boost as well. \n\nI like the characters from C3, and kinda got into it faster. Then again, some had been established in EXU already. We always have to give the players some time to find their groove together as a group!", "created_utc": "1660821523.0", "edited": "False", "id": "iks4y79", "is_submitter": "False", "link_id": "t3_wrc9k4", "parent_id": "t1_ikrjw4z", "score": "6", "subreddit": "criticalrole", "subreddit_id": "t5_385bw"}, {"author": "Azazyel616", "body": "JdG kam in 2 Heften raus, erst die Neuauflage fasste alles in einem Buch zusammen. Ansonsten kann es wegen mir aber auch als Abenteuer statt als Kampagne gezählt werden. Das trägt allerdings nicht wirklich zur Diskussion bei, oder?", "created_utc": "1660594128.0", "edited": "False", "id": "ikfdnx9", "is_submitter": "False", "link_id": "t3_wozkim", "parent_id": "t1_ikf6gso", "score": "3", "subreddit": "DSA_RPG", "subreddit_id": "t5_2vjcr"}, {"author": "Azazyel616", "body": "Es hatte vorher schon ein paar Kampagnen gegeben, die meisten waren aber kürzer. Orkland-Trilogie, Südmeer-Tetralogie, Löwe und Rabe, Jahr des Greifen... das waren alles Sachen, die in 2 bis maximal 4 Heftchen gepasst haben. Phileasson kam Anfang der 90er und war erst mal die größte Kampagne. Und dann, Mitte bis Ende 90er, halt die 7-bändige G7, deren Größe dadurch noch erweitert wird, das währenddessen alle anderen Abenteuer, die erschienen, vor ihrem Hintergrund spielten. Die Kampagne nahm auf alles Einfluss. Die Überarbeitung hatte dann mehr als 1.000 Seiten, das ist bis heute das Umfangreichste, was DSA hat (die Drachenchronik dürfte das zweitdickste Werk sein).", "created_utc": "1660587450.0", "edited": "False", "id": "ikew770", "is_submitter": "False", "link_id": "t3_wozkim", "parent_id": "t1_ikeuvja", "score": "4", "subreddit": "DSA_RPG", "subreddit_id": "t5_2vjcr"}, {"author": "Azazyel616", "body": "Als Spieler erlebt und nach dem 1. Abenteuer abgebrochen, weil der Meister weggezogen ist und auch etwas Knatsch zwischen bestimmten Spielern war. \n\nJahre später als Meister für ne andere Gruppe begonnen. Da haben wir deutlich mehr Vorabenteuer gespielt, mittlerweile das 1. der Kampagne absolviert, aber da wieder etwas an Fahrt verloren. Lange Pause gehabt, mittlerweile spielen wir wieder. Hatten ein paar Recherchen und Zwischenerlebnisse, sind dann hoffentlich bald im 2. Abenteuer, auf das freue ich mich nämlich besonders.", "created_utc": "1660580761.0", "edited": "False", "id": "ikeewh8", "is_submitter": "False", "link_id": "t3_wozkim", "parent_id": "t3_wozkim", "score": "4", "subreddit": "DSA_RPG", "subreddit_id": "t5_2vjcr"}, {"author": "Azazyel616", "body": "Schwere Frage, da die Antworten komplex und auch stark subjektiv sind.  \n\nIch denke nicht, dass sie die beste DSA-Kampagne ist. Sie hat ihre Stärken und Schwächen und muss wie jedes andere Werk auch alle paar Jahre nochmal neu eingeschätzt werden. \n\nNach heutigen Maßstäben ist sie definitiv etwas flawed. Zu railroadig, zu stark eingreifend in die Rechte der Charaktere. Man würde heute vieles anders machen.\n\nWas für sie spricht war eher, wie stark sie alles verknüpft hat, was bis dahin an Lore da war. Keine andere Kampagne war so einschneidend für das Worldbuilding von Aventurien. Das bedeutet, dass die Leute, die sie gespielt haben, seitdem sagen können, bei diesen ganz großen Sachen dabei gewesen zu sein. Darauf folgend haben eben diese Spieler bis in die 2000er die Kampagne in den Himmel gelobt. \nWas sie tatsächlich gut macht ist Bösewicht-Motivation. Borbarad ist viel mehr als ein Muhahar-Bad Guy, der eigentlich gar nicht weiß, warum er all das tut. Er hat Pläne und Ziele und manche davon werden erst nach mehreren Jahren Spielzeit offenbar. Man kann auch tiefgreifende philosophische Diskussionen mit ihm führen.\n\nAußerdem haben mit dieser Kampagne Dämonenpaktierer die Hauptrolle für Bad guys übernommen. Die in der Frühphase von DSA häufig auftretenden Namenlos-Kultisten waren mEn zu oft zu gleich und hatten sich abgenutzt. Paktierer bieten eine größere Bandbreite, weil z.B. Agrimoth für ganz andere Dinge steht als Nagrach oder Thargunitoth. Das hat DSA ab da jahrelang nutzen können. \n\nZu Beginn von DSA 5 hatte man dann aber offenbar das Gefühl, dass jetzt mal genug sei mit Paktierern, seitdem machen der Namenlose und seine Diener wieder mehr. Ich gehe davon aus, dass sich das wieder sehr schnell totläuft, denn NL-Kultisten fühlen sich oft gleich an. Zudem kann man sie kaum ihrem Potential entsprechend einsetzen: Entweder spielt man sie zu lasch, oder sie löschen problemlos ganze Gruppen aus ohne dass die Spieler eine Chance haben.", "created_utc": "1660580522.0", "edited": "1660580907.0", "id": "ikeeade", "is_submitter": "False", "link_id": "t3_wozkim", "parent_id": "t1_ikea1uv", "score": "14", "subreddit": "DSA_RPG", "subreddit_id": "t5_2vjcr"}, {"author": "Azazyel616", "body": "At University we discussed the topic of werewolves and vampires in different countries' folklores. The course was on Danish folk ballads, some of which feature werewolf topics. \nDuring the discussion, it was brought up that folk tales mostly stem from the 'common people', what today might be something like the middle class (not saying that's the same). \nBeing a commoner means having rulers above you, but still doing better than the outsiders, criminals and 'fallen' people that are consodered below you. This middle group often has the biggest part of the overall population and thereby the most part in telling tales, but less means and chances to publish them with their name on it than the ruling class has. \n\nIn discussion we had worked out that werewolves in Danish ballads regularly were symbolic for criminals from the lower classes, outcast bandits that lived in the woods. Often the songs would warn young girls to wander alone lest they meet 'the wolf', and in quite a few cases that involved getting pregnant. \n\nSo the suggestion here is that from the viewpoint of the 'middle-class', those beast tales were retelling the very real dangers they faced: \nThe werewolf symbolizes outsiders and lower classes being desperate and having nothing to lose. If they chose a life of crime, they had only blunt violence to support that. \nThe vampire, on the other hand, is often depicted as more of an aristocrat, but one that abuses the power he has for self-centric reasons. He is not a benevolent ruler assuring a good life for most every citizen, but a powerful and yet insatiable person that is never content with what they have. No wonder the commoner would be afraid of them.", "created_utc": "1660571440.0", "edited": "False", "id": "ikds16f", "is_submitter": "False", "link_id": "t3_wouq88", "parent_id": "t1_ikd74gx", "score": "130", "subreddit": "DMAcademy", "subreddit_id": "t5_3f611"}, {"author": "Azazyel616", "body": "ADnD is short for \"All of Dis 'n' Dat\", which was an area belonging to Whitestone in Critical Role that Grog got the ruling title for", "created_utc": "1660569008.0", "edited": "False", "id": "ikdmrrh", "is_submitter": "False", "link_id": "t3_wovv6h", "parent_id": "t3_wovv6h", "score": "1", "subreddit": "DnD", "subreddit_id": "t5_2r9ei"}, {"author": "Azazyel616", "body": "I'm also unable to generate a user flair. But for me, the textbox does appear and I can fill my text in. My problem is that it doesn't save the changes I made 🤷‍♂️", "created_utc": "1660477709.0", "edited": "False", "id": "ik8reeq", "is_submitter": "False", "link_id": "t3_wo2gxd", "parent_id": "t3_wo2gxd", "score": "9", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Azazyel616", "body": "OT Darth Vader is the best villain there is. Plus you have Palpatine and Jabba. There's no beating that.", "created_utc": "1660425949.0", "edited": "False", "id": "ik6dj4q", "is_submitter": "False", "link_id": "t3_wnmcqy", "parent_id": "t3_wnmcqy", "score": "21", "subreddit": "StarWars", "subreddit_id": "t5_2qi4s"}, {"author": "Azazyel616", "body": "Hab Spätsommer 2017 beschlossen, loszulegen und da schon Leute zusammengetrommelt, aber Sitzung 1 der Gruppe war dann erst Februar 2018. Die Gruppe gibt's noch und die meisten Spieler sind immer noch dabei.", "created_utc": "1660132906.0", "edited": "False", "id": "ijphog1", "is_submitter": "False", "link_id": "t3_wkft1v", "parent_id": "t3_wkft1v", "score": "2", "subreddit": "PenandPaperGermany", "subreddit_id": "t5_j2h4y"}, {"author": "Azazyel616", "body": "Ich will gern das erste meistern, \"Die Gärten der Xantere\". Gerade das letzte, \"Schwanengesang\", ist aber doch im Schnitt extrem gut bewertet? Platz 1 auf rollenspiel-bewertungen.de, vielleicht sind es zu wenig Stimmen bisher, um repräsentativ zu sein. 🤔", "created_utc": "1660129151.0", "edited": "False", "id": "ijpbieu", "is_submitter": "False", "link_id": "t3_wkrf36", "parent_id": "t1_ijpawsa", "score": "1", "subreddit": "DSA_RPG", "subreddit_id": "t5_2vjcr"}, {"author": "Azazyel616", "body": "Wie neu ist denn \"neu\" für dich? Die Abenteuer aus Dryadenhain und Dschinnenzauber lesen sich gut und ich werd eins davon demnächst mal leiten, aber diese Anthologie ist ja schon von 2019.", "created_utc": "1660123763.0", "edited": "False", "id": "ijp4bpf", "is_submitter": "False", "link_id": "t3_wkrf36", "parent_id": "t3_wkrf36", "score": "4", "subreddit": "DSA_RPG", "subreddit_id": "t5_2vjcr"}, {"author": "Azazyel616", "body": "Bring snacks.", "created_utc": "1660121886.0", "edited": "False", "id": "ijp21a2", "is_submitter": "False", "link_id": "t3_wkh0ie", "parent_id": "t3_wkh0ie", "score": "1", "subreddit": "DnD", "subreddit_id": "t5_2r9ei"}, {"author": "Azazyel616", "body": "I have tried to get into W2. Twice. It just didn't work for me. I see a lot of things I like, like the characters, story and choices, and the graphics are fine for me, really. I still play some 90s games, so I'm not that picky, I think. \n \n\nBut the combat system is just so godawful in its clunkyness. The furthest I've come was on my first try. It went okayish (though I remember a certain repetitiveness fighting drowners times and again) until the fight against the Kayran, and I swear to god if I ever have to hear SdT say \"Yrden! Catch it with the Yrden!\" again when already I've pressed that button 3 minutes ago and Geralt still didn't react to it... \nThat just looks bad compared to a fighting system like in Kingdoms of Amalur, which I played at roughly the same time and where I enjoyed gameplay much more. \n\nOn my 2nd try of W2 I didn't even get that far. Played part of the siege but the excitement wasn't there, so I quit it.", "created_utc": "1660120510.0", "edited": "False", "id": "ijp0ct5", "is_submitter": "False", "link_id": "t3_wkaikg", "parent_id": "t3_wkaikg", "score": "1", "subreddit": "witcher", "subreddit_id": "t5_2sebi"}, {"author": "Azazyel616", "body": "Ich bin mit meinen ca. 5 Jahren SL-Erfahrung (hauptsächlich DSA 4.1, mittlerweile aber auch weitere Systeme) leider schon 2x in der Situation gewesen, dass solche Überlegungen konkret wurden. Ich leite allerdings mittlerweile 4 Gruppen parallel, also kommen da schon einige Leute zusammen, mit denen man klar kommen muss, und mit den meisten klappt das auch. Nur zwei Mal halt nicht. \n\nDer Erste war bis dahin mit mir befreundet, hat sich beim Spiel und ab dann leider auch in anderen Situationen leider mehr und mehr als Kontrollfreak und Egoist herausgestellt. Da ließ sich auch in mehreren Gesprächen nix machen, er war unsozial und unzuverlässig, null absprachefähig, er fing an, schlecht über die anderen Spieler zu reden und wurde richtig manipulativ. Nach wenigen Wochen flog er aus der Gruppe. Da hats auch anderweitig noch geknallt und ich hab ihn komplett aus meinem Leben entfernt. Das ist mehr als 4 Jahre her und ich bereue nix. \n\nBeim zweiten war's viel schwieriger zu entscheiden, weil uneindeutiger. Letztlich drohte ich ihm nur mit Rauswurf, hab ihn aber auf seinen Wunsch in der Gruppe bleiben lassen. Er hat noch ne Weile mitgespielt und ist dann von selbst ausgetreten. \nWas war los? Er hatte 2020 während Corona nen ziemlichen Koller. Konnte sich über Monate am virtuellen Spieltisch nicht mehr benehmen, war nur noch am Schimpfen und Ranten, auf das Regelsystem und das Abenteuer, aber an sich auf alles, ganz egal weswegen. Wir als Gruppe haben verbal einiges abgekriegt. Im Nachhinein stellte sich heraus, er war im falschen Job. Hat gekündigt, macht jetzt ganz was anderes und jetzt geht's ihm besser und er ist wieder deutlich umgänglicher. Auf DSA 4.1 hat er allerdings auch keine Lust mehr, was man ihm halt auch deutlich angemerkt hatte. Ich würde auch nicht nochmal für ihn spielleiten, aber 'normale' Unternehmungen gehen wieder. \n\nSo kann's laufen, aber im Normalfall ist alles so viel besser. Mit den allermeisten Spielern kann man reden und sie bringen positive Dinge an den Spieltisch. Das sind dann die Situationen für die man  das Ganze überhaupt macht und wo jeder mit einem guten Gefühl nach Hause geht.", "created_utc": "1659980624.0", "edited": "False", "id": "ijgvrmu", "is_submitter": "False", "link_id": "t3_wj8zfv", "parent_id": "t3_wj8zfv", "score": "5", "subreddit": "DSA_RPG", "subreddit_id": "t5_2vjcr"}, {"author": "Azazyel616", "body": "Aaaaand the little known vol. 3 of \"Lusty Argonian Maid\" can be found there as well, iirc. 😉", "created_utc": "1659971268.0", "edited": "False", "id": "ijg7amt", "is_submitter": "False", "link_id": "t3_wixk1p", "parent_id": "t1_ijf5f0j", "score": "28", "subreddit": "skyrim", "subreddit_id": "t5_2s837"}, {"author": "Azazyel616", "body": "Same here, we also married after 8 years. It had already been kinda clear for a long time that we would eventually marry, but we took our time and it was alright.", "created_utc": "1659953336.0", "edited": "False", "id": "ijf8xsl", "is_submitter": "False", "link_id": "t3_wj0uxm", "parent_id": "t1_ijewydz", "score": "3", "subreddit": "MadeMeSmile", "subreddit_id": "t5_2uqcm"}, {"author": "Azazyel616", "body": "That's a really good list, totally agree. Especially Serana and Vex in my case. But even if you could marry them, would the game respect their personality, leaving it intact? \nI'm usually fine with marrying Lydia or Aela, but once being married, the characters kinda change into 'generic spouse'. Wish they would have more individual lines after you married them, and more options for interaction. \n\nAlso am still searching for a mod that lets me choose their outfit. There's that one specific tavern dress I'd live to see them in. You know, the one Hroki in Markarth or Karita in Dawnstar are wearing. ☺\nIf you hand it over to a spouse, they just won't use it.", "created_utc": "1659952600.0", "edited": "False", "id": "ijf80k4", "is_submitter": "False", "link_id": "t3_wilcfi", "parent_id": "t1_ijd2urf", "score": "3", "subreddit": "skyrim", "subreddit_id": "t5_2s837"}, {"author": "Azazyel616", "body": "I wanna second that. The Situation and the verdict feel far too political to be earned by stupidity alone. \n\nAlso, quick correction, by definition Russia is not a 3rd world country.", "created_utc": "1659707072.0", "edited": "False", "id": "ij1wwz6", "is_submitter": "False", "link_id": "t3_wgs30p", "parent_id": "t1_ij1w4n8", "score": "1", "subreddit": "AdviceAnimals", "subreddit_id": "t5_2s7tt"}, {"author": "Azazyel616", "body": "Ich stimme zu, was den Greifenpass angeht. Ansonsten fiele mir noch Staub und Sterne ein oder die Jahr des Greifen-Kampagne. \n\nAber ich denke, eigentlich muss man kein bestimmtes Abenteuer kennen, dafür gibt es viel zu viele. Sicherlich ist es bei so Klassikern wie \"Der Wolf von Winhall\", \"Hexennacht\", \"Stromaufwärts\", \"Der schwarze Bär\", \"Die Seelen der Magier\" oder \"Das Turnier von Gareth\" cool, sie zu kennen, aber nicht zwingend nötig. \nUnd manche Plots haben einige Spieler zwar geflasht, sind aber nicht gut gealtert; etwa \"Die Attentäter\", \"Mehr als 1000 Oger\" oder \"Die Kanäle von Grangor\".", "created_utc": "1659706414.0", "edited": "False", "id": "ij1vfj0", "is_submitter": "False", "link_id": "t3_wgunfq", "parent_id": "t3_wgunfq", "score": "4", "subreddit": "DSA_RPG", "subreddit_id": "t5_2vjcr"}, {"author": "Azazyel616", "body": "The entire \"Wall in the north to shield from barbarians\" things happens times and again in Fantasy Literature, because its based on real-world history. See Tad Williams' Shadowmarch, which is even named after that northern border in his work. \nSince classic fantasy often depicts some kind of altered British Island, the wall relates directly to Hadrian's wall, built to keep the Picts out of Roman Britain.", "created_utc": "1659353533.0", "edited": "False", "id": "iihu8bx", "is_submitter": "False", "link_id": "t3_wd7fy3", "parent_id": "t1_iihpyxm", "score": "28", "subreddit": "DnD", "subreddit_id": "t5_2r9ei"}, {"author": "Azazyel616", "body": "Oh, my bad. Good reason to rewatch the entire series, I guess 😁", "created_utc": "1659352687.0", "edited": "False", "id": "iihsz48", "is_submitter": "False", "link_id": "t3_wdbzrd", "parent_id": "t1_iihskkk", "score": "33", "subreddit": "HIMYM", "subreddit_id": "t5_2rcqy"}, {"author": "Azazyel616", "body": "The show itself even denounces the sentence, with Ted stating that he first met the mother after 2 am. \nAnd I kinda have the same story. Once I got to know this woman. When I first kissed her it was after 2 am, and now she's like, the best wife ever", "created_utc": "1659347277.0", "edited": "False", "id": "iihm0ig", "is_submitter": "False", "link_id": "t3_wdbzrd", "parent_id": "t3_wdbzrd", "score": "115", "subreddit": "HIMYM", "subreddit_id": "t5_2rcqy"}, {"author": "Azazyel616", "body": "Anything by Astrid Lindgren. Her writing just encompasses this general human-ness that you can enjoy at any age, and also she's really funny. And the way she tackles hard topics like poverty or even death is so unique for an author in that field. Bröderna Lejonhjärta is heartbreaking and still has this warmth shining through even the darkest passages. \n\nPettson & Findus. Its sheer creativity is just plain awesome. \n\nAs kid I read the Caius novels by Henry Winterfeld several times, and as an adult decided to reread. I found they were still holding up, amazing.\n\nEDIT: \nSome more came to mind. \n\nMichael Ende for Neverending Story, Momo and Jim Knopf. All just so, so good. \n\nAnd I had the laugh of my lifetime rereading Erich Kästner. He made a poem on a guy boasting too much, until the other boys decide to have him act accordingly and he has to eat up like 20 dumplings or so till they have to call the doctor. It's probably hard to translate though. \nI also recall really liking a novel by him called \"May 35th\" for its utter bizarreness. Now it's probably not fitting for today anymore, its depictions of native POC on carribean-ish islands would not be written like that today. But his classics like \"Emil\" and \"Lottchen\" should still hold up today, I guess.", "created_utc": "1659255588.0", "edited": "1659257118.0", "id": "iicyf0m", "is_submitter": "False", "link_id": "t3_wch1nu", "parent_id": "t3_wch1nu", "score": "2", "subreddit": "suggestmeabook", "subreddit_id": "t5_31t41"}, {"author": "Azazyel616", "body": "It doesn't have to be. I think the thing that we as customers have to remember is just that enterprises are not people (and people do change as well). Like, they're gonna change their big business plan every few years, months even, and you can't really stop them from doing that. \n\nSo don't rely on who the big names have been, instead look around for who it will be next. Have your opinions remain flexible. \n\nIn the 2000s, Blizzard and Bioware were awesome. In the 2010s, it was already changing, and names like CDPR took over. Is CD Projekt still the 'good guy' now? Doesn't feel like it anymore since the CP77 debacle, and a lot of good developers already left them for greener pastures. Let's see who steps up next. \n\nDo not throw money at the old names expecting them to change back to times of former glory; they won't. Spend your money on a work of love made by a small name Indie developer and enjoy.", "created_utc": "1659253803.0", "edited": "False", "id": "iicw7ek", "is_submitter": "False", "link_id": "t3_wc8nnh", "parent_id": "t1_iicaoxl", "score": "1", "subreddit": "gaming", "subreddit_id": "t5_2qh03"}, {"author": "Azazyel616", "body": "Does everyone agree on the \"progressively worse\"-part, I wonder? Don't wanna step on anyones toes here, but in my view part 2 was the most disappointing movie of the entire Pirates-franchise, while 3 and 5 were quite alright and 4 was ok.", "created_utc": "1659246774.0", "edited": "False", "id": "iicn0ud", "is_submitter": "False", "link_id": "t3_wc3nrn", "parent_id": "t1_iiavnx8", "score": "2", "subreddit": "indianajones", "subreddit_id": "t5_2s903"}, {"author": "Azazyel616", "body": "Inigo's fur is as blue as his name suggests, so no ;-) Left one is named Kharjo", "created_utc": "1659171591.0", "edited": "False", "id": "ii8kqrl", "is_submitter": "False", "link_id": "t3_wbgfxj", "parent_id": "t1_ii7hlo2", "score": "2", "subreddit": "skyrim", "subreddit_id": "t5_2s837"}, {"author": "Azazyel616", "body": "Hooray for Binabik!", "created_utc": "1659101283.0", "edited": "False", "id": "ii4i9vm", "is_submitter": "False", "link_id": "t3_wakz7p", "parent_id": "t1_ii29p7h", "score": "2", "subreddit": "Fantasy", "subreddit_id": "t5_2qknd"}, {"author": "Azazyel616", "body": "Doesn't sound fun to me, plus it's unlikely to solve the problem. Rather, it allows that person to directly influence the game, which is bad since she's overstepping borders there. Giving her that probably won't even make her accept the game, it just limits everyone else.", "created_utc": "1658998839.0", "edited": "1659008183.0", "id": "ihyv6ho", "is_submitter": "False", "link_id": "t3_w9xk96", "parent_id": "t1_ihxzcf5", "score": "3", "subreddit": "DungeonsAndDragons", "subreddit_id": "t5_2qwdo"}, {"author": "Azazyel616", "body": "Dunmer. He was supposed to be a mage, and I finished the Winterhold guild quest line first, but then I must've slipped or something. Next thing I know, my mage is already a stealth archer.", "created_utc": "1658996262.0", "edited": "False", "id": "ihyryw8", "is_submitter": "False", "link_id": "t3_w9wez6", "parent_id": "t3_w9wez6", "score": "1", "subreddit": "skyrim", "subreddit_id": "t5_2s837"}, {"author": "Azazyel616", "body": "Jedes einzelne deiner Beispiele gab es so schon in offiziellen DSA-Abenteuern ;-) \n\n\nVorsichtig Spoiler:\n\nFliegende Stadt:\nIn der Jahr des Feuers-Kampagne war es ein wichtiger Bestandteil, dass die Schwarzen Lande eine Fliegende Festung ausgesandt haben. \n\nWasser, das aufwärts fließt: \nAn sich einfach zu bewerkstelligen. Jede Globule oder Feenwelt könnte das, aber in Aventurien wäre es mithilfe von Magie oder göttlichem Wirken auch möglich. Bin nicht sicher, meine aber, dass in der Simyala-Kampagne sowas mal kam. \n\nAuf Ameisengröße schrumpfen: \nDa fallen mir gleich mehrere Abenteuer ein. Eins davon ist uralt, \"Die sieben magischen Kelche\", darin war das mit dem Schrumpfen war so ziemlich nebenher bzw. optional möglich in einem Raum mit einer merkwürdigen Apparatur. \nUnd dann kam nochmal sowas, diesmal wichtiger für den Plot des Abenteuers, wo man in einem Ameisenbau, auf deren Größe geschrumpft, gegen einen Dämon kämpfen musste. War das Finale von \"Die Überlegenen\" von Michael Masberg. Es ging glaub ich um die Geschichte der Maraskaner, aber auf dem Festland in den Tulamidenlanden. \n\n\nMan sieht denke ich an den Beispielen, dass eben doch so ziemlich alles möglich ist in Aventurien. Es soll halt nicht inflationär gebraucht werden, damit es sich nicht abnutzt, sondern man noch drüber staunen kann. In der Hinsicht ist DSA halt eher wie Herr der Ringe, Game of Thrones oder The Witcher, und weniger wie WarCraft oder Harry Potter.", "created_utc": "1658912679.0", "edited": "False", "id": "ihtvpa4", "is_submitter": "False", "link_id": "t3_w992rn", "parent_id": "t3_w992rn", "score": "6", "subreddit": "DSA_RPG", "subreddit_id": "t5_2vjcr"}, {"author": "Azazyel616", "body": "I started reading WoT, haven't gotten very far yet because of little freetime atm. But am enjoying it so far. Thanks for the suggestion!", "created_utc": "1658835329.0", "edited": "False", "id": "ihpamqw", "is_submitter": "False", "link_id": "t3_w7zo89", "parent_id": "t1_ihp19js", "score": "1", "subreddit": "suggestmeabook", "subreddit_id": "t5_31t41"}, {"author": "Azazyel616", "body": "1. The Lord of the Rings \n2. The Chronicles of Thomas Covenant \n3. Walter Moers - The City of Dreaming Books \n4. Carlos Ruiz Zafón - The Angel's Game\n\nOh, and I already know The Witcher, George RR Martin, Rothfuss and Brandon Sanderson ;-)", "created_utc": "1658825283.0", "edited": "1658826154.0", "id": "ihox4gb", "is_submitter": "False", "link_id": "t3_w7zo89", "parent_id": "t3_w7zo89", "score": "1", "subreddit": "suggestmeabook", "subreddit_id": "t5_31t41"}, {"author": "Azazyel616", "body": "Gleich vorneweg: Nein, ich habe die Kampagne noch nicht fertig gemeistert und mich auch größtenteils gegen Engors Vorschlag entschieden. \nTeil 3, \"Der Schwarze Forst\", haben wir schon gespielt. Die eigentliche Kampagne wird später noch kommen. Ich habe aber alle Bände schon gelesen und mir einige Gedanken gemacht. \n\nIch schätze Engors Rezensionen sehr und bin immer wieder beeindruckt über die Geschwindigkeit und Zuverlässigkeit, mit der er seine Texte raushaut und alles abdeckt, was an DSA-Produkten so auftaucht. \nEs soll insofern keine Kritik an seinem Blog sein, wenn ich daran erinnere, dass er die Dinge nach reinem Lesen rezensiert, also meist ohne sie gespielt zu haben. Ich selbst schreibe hier auch diesen Beitrag über die Kampagne und habe nur ein einziges Abenteuer daraus gemeistert. \n\nAber für eine so deutlich veränderte Kampagnenstruktur ist das ein Faktor, den man nicht vergessen sollte. Er kann ja mit all diesen Vorschlägen Recht haben, aber er hat es halt (noch) nicht getestet. \n\nMal ein konkreterer Blick darauf: \n\nEr ändert die Reihenfolge um zu 1 - 3 - 2 - 6 - 5 - 4. Um das verständlicher zu halten, könnte man sozusagen die Gesamtkampagne in zwei Hälften geteilt sehen: \nIn der ersten Hälfte zieht er Teil 3 etwas vor. \nIn der zweiten Hälfte kehrt er die Reihenfolge um. \n\nDas bedeutet, dass er die erste Hälfte der Kampagne gar nicht so sehr verändert. Teil 3 war ohnehin ein etwas schräger Einschub, der wenig zur Gesamtstory beitrug, er kann recht problemlos verschoben werden. Das hab ich mit meiner Gruppe auch schon gemacht, ich kann hier also sagen: Jo, klappt. \n\nDass Teil 6 ebenfalls schräg rüberkommt mit seiner Position in der Kampagne, da stimme ich Engor zu. Dieses Abenteuer macht mir ganz generell Bauchweh und ich überlege sogar, es ganz wegzulassen oder die Hälfte zu streichen. Engor gibt ihm auch keine gute Note. Ob man die Probleme des Moduls nun durch nach-vorn-Verschieben lösen kann, möchte ich bezweifeln. Aber Engors Begründung ist gut: Wenn man es spielen will, ergibt es durchaus Sinn, die Marschalls-Wahl früher abzuhalten. Das sorgt dem SL für Arbeit, aber wer sich die Mühe machen will, kann davon also auch profitieren. \n\nDie letzte Änderung, die er vornimmt, ist, Teil 4 mit 5 zu tauschen, weil, wie er schreibt, der spirituelle Sieg/Abschluss in Teil 5 VOR dem kämpferischen Sieg/Abschluss stehen sollte. \nAlso an sich eine reine Geschmackssache. Ich stimme ihm nicht zu bzw. halte die Umkehrung für unnötig. Für mich darf gern erst 4 und dann 5 kommen.\n\nTl;dr: \nTeil 3 früher zu spielen geht gut, hab's selbst so gemacht. \n\nTeil 6 früher geht, macht aber besonders viel Arbeit. \n\nTeile 4 und 5 zu tauschen ist Geschmackssache und mMn unnötig.", "created_utc": "1658781323.0", "edited": "1658781592.0", "id": "ihmjasl", "is_submitter": "False", "link_id": "t3_w7xvbr", "parent_id": "t3_w7xvbr", "score": "6", "subreddit": "DSA_RPG", "subreddit_id": "t5_2vjcr"}, {"author": "Azazyel616", "body": "Gris is about beating depression. Heard similar things about Celeste and Hellblade: Senua's Sacrifice, but haven't played them yet. \n\nAlso, the Banner saga trilogy is awesome and has some heavy themes about loss and endings and goodbyes.", "created_utc": "1658753424.0", "edited": "False", "id": "ihkl966", "is_submitter": "False", "link_id": "t3_w7m2yw", "parent_id": "t3_w7m2yw", "score": "12", "subreddit": "gamingsuggestions", "subreddit_id": "t5_2sxyv"}, {"author": "Azazyel616", "body": "From best to worst: \n\n-> Thieves' Guild (replayed the fight against Mercer Frey today, how cool was that!) \n\n-> Dawnguard  \n\n-> Dark Brotherhood (Astrid's grand plan was illogic, but a lot of the missions were really stylish) \n\n-> Companions (mostly okay. Being a werewolf was cool I guess) \n\n-> The Greybeards\n\n-> Bard College (severely lacks content, but I liked the stuff we got) \n\n-> Clan Volkihar (playing a vampire didnt feel that good even with the DLC. Also Haakon doesn't give you many reasons to side with him) \n\n-> The College of Winterhold (I liked the old Archmage, but the Staff of Magnus mechanic really sucked. Also you can master the quest line without even bothering to use magic which entirely destroys the feeling) \n\n-> Empire (not perfect, but better than the alternative. Most of the civil war questline feels rather bland anyway, except for that crown thing) \n\n-> Stormcloaks (fantasy racists) \n\n-> The Blades (Delphine... also I never killed Paarthurnax) \n\n-> ...The Thalmor", "created_utc": "1658609677.0", "edited": "1658609875.0", "id": "ihd83lx", "is_submitter": "False", "link_id": "t3_w67w3u", "parent_id": "t3_w67w3u", "score": "1", "subreddit": "skyrim", "subreddit_id": "t5_2s837"}, {"author": "Azazyel616", "body": "JC - Hurt; \n\nPortishead - Roads; \n\nAnnie Lennox - Into the West; \n\nPink Floyd - High Hopes", "created_utc": "1658422985.0", "edited": "False", "id": "ih2nmeh", "is_submitter": "False", "link_id": "t3_w4h959", "parent_id": "t3_w4h959", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "Azazyel616", "body": "Came to suggest Carmilla by SLF", "created_utc": "1658336072.0", "edited": "False", "id": "igxsja7", "is_submitter": "False", "link_id": "t3_w3gt84", "parent_id": "t1_igxnd5e", "score": "2", "subreddit": "suggestmeabook", "subreddit_id": "t5_31t41"}, {"author": "Azazyel616", "body": "Same. The first 2 episodes weren't great, but the third just sucked so hard 😑", "created_utc": "1656408361.0", "edited": "False", "id": "ie19rx3", "is_submitter": "False", "link_id": "t3_vm05fn", "parent_id": "t1_idyfqs1", "score": "2", "subreddit": "DragonsDogma", "subreddit_id": "t5_2smmb"}, {"author": "Azazyel616", "body": "Es gibt auch noch das tanelorn, da lese ich allerdings nur den Kampagnenbericht von Hotzenplot mit. Der ist empfehlenswert, aber zum Forum selbst kann ich nix sagen", "created_utc": "1656268640.0", "edited": "False", "id": "idu38p7", "is_submitter": "False", "link_id": "t3_vl8apo", "parent_id": "t3_vl8apo", "score": "4", "subreddit": "DSA_RPG", "subreddit_id": "t5_2vjcr"}, {"author": "Azazyel616", "body": "1. LotR trilogy \n2. Blade Runner\n3. Watchmen\n\nDamn it hurts to only list 3. There's so many good movies", "created_utc": "1655984161.0", "edited": "False", "id": "idf39pg", "is_submitter": "False", "link_id": "t3_vif5uh", "parent_id": "t3_vif5uh", "score": "1", "subreddit": "ChristopherNolan", "subreddit_id": "t5_2u30p"}, {"author": "Azazyel616", "body": "Qui Gon: \"There's always a bigger Coffee.\"", "created_utc": "1655844356.0", "edited": "False", "id": "id83fz7", "is_submitter": "False", "link_id": "t3_vhfdwl", "parent_id": "t3_vhfdwl", "score": "72", "subreddit": "starwarsmemes", "subreddit_id": "t5_2wzm6"}, {"author": "Azazyel616", "body": "I felt it was quite rewarding to stick with the game. After a while you really get the knack of the controls and then it feels really awesome. \nWhen you have levelled up a little and are starting to feel more comfortable, I can recommend to try and complete the combat related achievements, that might boost your combat skills even more. It did for me. But don't do that to soon, try to master the basics first.", "created_utc": "1655794003.0", "edited": "False", "id": "id5kres", "is_submitter": "False", "link_id": "t3_vh1h0i", "parent_id": "t3_vh1h0i", "score": "2", "subreddit": "FallenOrder", "subreddit_id": "t5_k8d8d"}, {"author": "Azazyel616", "body": "To shreds, you say?", "created_utc": "1655791268.0", "edited": "False", "id": "id5h80u", "is_submitter": "False", "link_id": "t3_vgu8jr", "parent_id": "t1_id4pry7", "score": "2", "subreddit": "writing", "subreddit_id": "t5_2qh2n"}, {"author": "Azazyel616", "body": "The BioShock games and the Banner Saga games. Both are awesome, story-heavy trilogies that I'd recommend to most every gamer out there.", "created_utc": "1655367827.0", "edited": "False", "id": "ick5lfl", "is_submitter": "False", "link_id": "t3_vd3lqa", "parent_id": "t3_vd3lqa", "score": "1", "subreddit": "gamingsuggestions", "subreddit_id": "t5_2sxyv"}, {"author": "Azazyel616", "body": "I also wanted to recommend Fahrenheit 451, not only bc of Bradbury's excellent style of writing. I also thought it just seems so fitting for a book club.", "created_utc": "1655362973.0", "edited": "False", "id": "ick01lt", "is_submitter": "False", "link_id": "t3_vczljf", "parent_id": "t1_ichfn84", "score": "2", "subreddit": "suggestmeabook", "subreddit_id": "t5_31t41"}, {"author": "Azazyel616", "body": "Yes, that's what I wanted to write. Donaldson is a master of exploring the psychology of his main character. Delving into Covenant's mind feels like witnessing depression first hand.\nTrigger warning for a rape scene early in book 1 though. But the books go the extra mile to explore the heavy guilt the character feels afterwards, the scene goes not without consequence.", "created_utc": "1639516267.0", "edited": "False", "id": "hok6tdu", "is_submitter": "False", "link_id": "t3_rg8hiz", "parent_id": "t1_hojl9be", "score": "2", "subreddit": "Fantasy", "subreddit_id": "t5_2qknd"}, {"author": "Azazyel616", "body": "Thanks, I will!", "created_utc": "1639494807.0", "edited": "False", "id": "hoiofno", "is_submitter": "False", "link_id": "t3_rg3u7x", "parent_id": "t1_hoij5i8", "score": "8", "subreddit": "StardewValley", "subreddit_id": "t5_2wb7y"}, {"author": "Azazyel616", "body": "I'm currently in year 2, last week of winter, and haven't seen it yet 🤔", "created_utc": "1639487120.0", "edited": "False", "id": "hoi8o54", "is_submitter": "False", "link_id": "t3_rg3u7x", "parent_id": "t1_hoi2m5w", "score": "39", "subreddit": "StardewValley", "subreddit_id": "t5_2wb7y"}, {"author": "Azazyel616", "body": "I would really recommend getting the AddOns, as the game plays much better with them. \n\nWhen I played the base game without DLC, I fell in love with the game, but I also got frustrated on some of the decisions the AI made. Mostly, that was about pointless warfare. An AI civ would declare war on me  even though they didn't have the military for it, and we both would grind down our troops, leaving both of us behind on other stuff. \n\nNow with the DLC, I feel like the decisions the AI makes are less random. The AI is one of the things that the Civ games get criticised about the most, but with the AddOns, it's far better imo, and therefore playing is more fun. \n\n(It might also be that I learned the game and therefore get less frustrated about them, or a mixture of both)", "created_utc": "1639307967.0", "edited": "False", "id": "ho8hdvi", "is_submitter": "False", "link_id": "t3_remel2", "parent_id": "t3_remel2", "score": "3", "subreddit": "civ5", "subreddit_id": "t5_2s48d"}, {"author": "Azazyel616", "body": "Maybe the clerics had conflicts with former worldly rulers in the past, so they decreed to never resurrect a ruler. \nIt could be seen as heavily interfering with politics anyway. Imagine a situation where the designated heir to the throne, upon hearing the news, travelled across the country in order to claim his right to the throne, and in every town and village he passes through, the people treat him like he was already king... only to then learn upon arrival that the former king is still alive. Conflict might have arisen more than once in such times. Maybe there has been a civil war that made the clerics consider to not mingle in such affairs.", "created_utc": "1638948557.0", "edited": "False", "id": "hnoytpu", "is_submitter": "False", "link_id": "t3_rbk4xj", "parent_id": "t1_hnos3ep", "score": "18", "subreddit": "mattcolville", "subreddit_id": "t5_3f0mp"}, {"author": "Azazyel616", "body": "What's especially awesome about this very title is, from that single sentence came not only the title for the first book and the entire TV series, but also they named the particular Episode \"You win or you die\". That's 2 titles from one single sentence.", "created_utc": "1638703726.0", "edited": "False", "id": "hnbaqvx", "is_submitter": "False", "link_id": "t3_r8zmxv", "parent_id": "t1_hn9c4wk", "score": "3", "subreddit": "Fantasy", "subreddit_id": "t5_2qknd"}, {"author": "Azazyel616", "body": "Yes, undead serve that purpose well. So do demons.", "created_utc": "1638694279.0", "edited": "False", "id": "hnazbpy", "is_submitter": "False", "link_id": "t3_r8rad2", "parent_id": "t1_hn7eg7l", "score": "1", "subreddit": "DMAcademy", "subreddit_id": "t5_3f611"}, {"author": "Azazyel616", "body": "I think, judging both at the moment they were released, Morrowind was the stronger game. It's environment was otherworldly and just so creatively done. Masterful worldbuilding. \n\nBut if you want to buy them today, you're probably gonna have more fun playing Oblivion. There's just no going back to how it felt when Morrowind came out.", "created_utc": "1638368305.0", "edited": "False", "id": "hmsqfh9", "is_submitter": "False", "link_id": "t3_r6f58b", "parent_id": "t3_r6f58b", "score": "3", "subreddit": "ShouldIbuythisgame", "subreddit_id": "t5_2ud8h"}, {"author": "Azazyel616", "body": "Well, you own more than one shelf.", "created_utc": "1637691295.0", "edited": "False", "id": "hlson9d", "is_submitter": "False", "link_id": "t3_r0bhzo", "parent_id": "t3_r0bhzo", "score": "1", "subreddit": "teenagers", "subreddit_id": "t5_2rjli"}, {"author": "Azazyel616", "body": "Age of Empires II\n\nBioShock-Trilogy \n\nCiv V \n\nDragonAge Origins \n\nMonkey Island 3 \n\nSkyrim \nStardew Valley \nStar Wars Jedi: Fallen Order \n\nTitanfall 2 \n\nWitcher III", "created_utc": "1637586149.0", "edited": "False", "id": "hlmtv6g", "is_submitter": "False", "link_id": "t3_qz6dg4", "parent_id": "t3_qz6dg4", "score": "1", "subreddit": "ShouldIbuythisgame", "subreddit_id": "t5_2ud8h"}, {"author": "Azazyel616", "body": "1. Blade Runner\n2. 2001\n3. Star Trek VIII: First Contact \n\nHonorable Mentions: \n5th Element, Dark City, The Matrix, Equilibrium, Dune, Interstellar, Star Wars V, Rogue One, Star Trek II and VI, Cloud Atlas, Inception, Paprika, 12 Monkeys, Ghost in the Shell, Butterfly Effect, Prometheus, District 9, Treasure Planet", "created_utc": "1637395979.0", "edited": "False", "id": "hld4uk9", "is_submitter": "False", "link_id": "t3_qxmjia", "parent_id": "t3_qxmjia", "score": "3", "subreddit": "scifi", "subreddit_id": "t5_2qh2z"}, {"author": "Azazyel616", "body": "Ein Freund meiner Eltern lag letztes Jahr Weihnachten im Koma, multiples Organversagen, wurde künstlich beatmet. Dann haben die Ärzte seiner Frau gesagt, er werde die nächste Nacht nicht überstehen. Und dann hab ich mehrere Tage gar nichts mehr in Erfahrung bringen können, das war stressig. \n\nAber er hat's gepackt. War der erste Corona-Patient auf seiner Station, der aus dem Koma wieder aufgewacht ist. Konnte nach Ostern sogar wieder auf die Arbeit gehen, aber je nur 3 Stunden pro Tag. Trotzdem war's ein kleines Wunder.\n\nMeine Kollegin hat sich ständig nach ihm erkundigt, obwohl sie ihn gar nicht kennt. Sie hatte direkt am Anfang der Pandemie nen Bekannten verloren, der sich bei Ischgl-Rückkehrern infiziert hatte. Ein paar Kunden haben auch von kranken Bekannten und Familienmitgliedern erzählt, da gab es auch den ein oder anderen Toten.", "created_utc": "1637276344.0", "edited": "False", "id": "hl6ktyh", "is_submitter": "False", "link_id": "t3_qvnkas", "parent_id": "t3_qvnkas", "score": "2", "subreddit": "FragReddit", "subreddit_id": "t5_2r6ca"}, {"author": "Azazyel616", "body": "Oh, zu Metal hätte ich ein paar. Aus Fansicht fand ich bisher fast alle Metal-Musiker, mit denen ich gesprochen habe, topp. Ich persönlich fände es sehr anstrengend, Fans zu haben, hab also großen Respekt davor, überhaupt Kontakt zu den Fans zu suchen.  \n\nHab den Mitgliedern sowohl von Sepultura als auch von Mastodon mal die Hände geschüttelt, als sowas noch ging. Beide Bands machten einen sehr freundlichen Eindruck auf mich, aber der Kontakt war da beweils nur kurz, kann es also nicht so genau einschätzen. \n\nTotal distanziert waren Powerwolf, und da waren sie noch gar nicht so groß. Haben auf einem kleinen Festival in meiner Region gespielt, wo ich die Veranstalter kannte, und selbst mit denen hat die Band kaum gesprochen, sondern hat für alles so nen superstressigen Tourmanager geschickt. Alles Sonderwünsche und Beschwerden. Da war dann auch das Fazit, dass die nicht noch mal zu kommen brauchen. \n\nOkay, aber sehr weird, war Paasi, Ex-Sänger von Amorphis. Saß morgens plötzlich auf nem Campingstuhl bei uns und war mglw. auf Drogen. Erzählt mir, er könne in seiner Unterkunft nicht schlafen, weils da spukt, und war dann böse, als ich gelacht hab. Da hab ich erst gemerkt, dass er das wohl ernst meinte. \n\nNull Berührungsängste hatten immer Knorkator, wen wundert's^^ Die spielten häufig hier. \nAnsonsten waren die positivsten Beispiele: \nMit denen von Cynic hab ich mich gut und auch länger unterhalten können und mit Torsten von Nocte Obducta/Agrypnie auch. Die Leute von Cripper aus Hannover haben auf den Festivals, auf denen sie gespielt haben, auch konsequent mit Party gemacht. Sodom waren super entspannt, und Mr. Fanfreundlich persönlich ist wohl Barney von Napalm Death. Das waren denk ich bisher die Sympatischsten von allen.", "created_utc": "1637274359.0", "edited": "False", "id": "hl6g4gt", "is_submitter": "False", "link_id": "t3_qwkadp", "parent_id": "t1_hl3n5q2", "score": "2", "subreddit": "FragReddit", "subreddit_id": "t5_2r6ca"}, {"author": "Azazyel616", "body": "I didn't buy Anniversary Edt. yet, but I've been playing Skyrim again these last days. A few of the Mods, such as fishing, are free after all, and so far I am enjoying them. \n\nI haven't decided whether I'm gonna buy AE. I'm afraid to run into the bugs some other people had that seem to break the game completely.", "created_utc": "1637223016.0", "edited": "False", "id": "hl3ixwt", "is_submitter": "False", "link_id": "t3_qweukf", "parent_id": "t3_qweukf", "score": "1", "subreddit": "skyrim", "subreddit_id": "t5_2s837"}, {"author": "Azazyel616", "body": "Wanted to comment exactly this, but I had a feeling it would have been mentioned already. Was not wrong.", "created_utc": "1637057288.0", "edited": "False", "id": "hku538c", "is_submitter": "False", "link_id": "t3_qudiep", "parent_id": "t1_hkry2zk", "score": "2", "subreddit": "suggestmeabook", "subreddit_id": "t5_31t41"}, {"author": "Azazyel616", "body": "A good one! 👍\nTo be fair, half of the band's discography consists of drinking songs. \"Beer beer\", \"Vodka\", \"Tequila\", the list goes on...", "created_utc": "1636985076.0", "edited": "False", "id": "hkpxyjl", "is_submitter": "False", "link_id": "t3_qtt603", "parent_id": "t1_hko5tsi", "score": "2", "subreddit": "d100", "subreddit_id": "t5_3ofgq"}, {"author": "Azazyel616", "body": "Meine Frau und ich essen morgens auch unser eigenes Müsli. Haferflocken, frisches Obst, Nüsse und etwas Schokoflocken, kann man ja variieren wie man möchte", "created_utc": "1636623043.0", "edited": "False", "id": "hk6n468", "is_submitter": "False", "link_id": "t3_qqrlse", "parent_id": "t1_hk22lhe", "score": "1", "subreddit": "FragReddit", "subreddit_id": "t5_2r6ca"}, {"author": "Azazyel616", "body": "Es ist ja offiziell nach der Borbaradkampagne angesiedelt, sollte also problemlos gehen. Je später du es spielen willst, desto schwerer ist es halt zu erklären... auf der anderen Seite wird dann die Sturheit der Zwerge, so lange durchzuhalten, beeindruckender", "created_utc": "1636454330.0", "edited": "False", "id": "hjx67wn", "is_submitter": "False", "link_id": "t3_qpncwc", "parent_id": "t3_qpncwc", "score": "1", "subreddit": "DSA_RPG", "subreddit_id": "t5_2vjcr"}, {"author": "Azazyel616", "body": "Kommt etwas drauf an, wie viel Zeit und Energie du investieren willst: \nWenn's ne neue Sprache sein soll, aber nicht zu kompliziert, wären Niederländisch oder die festlandskandinavischen Sprachen (Dänisch, Schwedisch, Norwegisch) super. Gerade wenn du schon Englisch kannst, lässt sich davon und vom Deutschen viel Vokabular herleiten. \nWenn's etwas herausfordernder sein darf, wäre Isländisch zu nennen, mit den selben Vorteilen, aber einer komplizierteren Grammatik. Oder du machst ne romanische Sprache. \nNoch eine Stufe härter sind die slawischen Sprachen, etwa Polnisch oder Russisch.", "created_utc": "1635412552.0", "edited": "False", "id": "hicz6it", "is_submitter": "False", "link_id": "t3_qhhcyd", "parent_id": "t3_qhhcyd", "score": "1", "subreddit": "FragReddit", "subreddit_id": "t5_2r6ca"}, {"author": "Azazyel616", "body": "That was my first one as well. Not a surprise, given its long-running dominance on the german market.", "created_utc": "1634128955.0", "edited": "False", "id": "hgh5rxw", "is_submitter": "False", "link_id": "t3_q71v9n", "parent_id": "t1_hggr6w6", "score": "6", "subreddit": "rpg", "subreddit_id": "t5_2qh2s"}, {"author": "Azazyel616", "body": "The Room appears to be empty. As soon as the party enters, a liquid drips from the ceiling, and it seems to be too viscous for being just simple water. Is it spit, is it ooze? A shadow begins moving across the ceiling...", "created_utc": "1632209201.0", "edited": "False", "id": "hdoyiod", "is_submitter": "False", "link_id": "t3_prsdu3", "parent_id": "t3_prsdu3", "score": "2", "subreddit": "d100", "subreddit_id": "t5_3ofgq"}, {"author": "Azazyel616", "body": "This.\n\nSomeone once stated \"The problem about TDE 4e is,  I've played it for ten years now, and I'm still a beginner.\" \n\nThat's exactly where I am now. Started playing in 2011, so it's been 10 years now. Can confirm.\n\nI love it, though, despite it's flaws.", "created_utc": "1631186623.0", "edited": "False", "id": "hc63i1b", "is_submitter": "False", "link_id": "t3_pkf093", "parent_id": "t1_hc32pwt", "score": "3", "subreddit": "rpg", "subreddit_id": "t5_2qh2s"}, {"author": "Azazyel616", "body": "I second Sheridan Le Fanu's \"Carmilla\" (a quick ~100-page-story that's even older than Dracula) and Stephen King's \"Salem's Lot\" (a vampire novel that's actually scary), both of which have been recommended already.\n\nBut I also really wanna bring attention to \"Thousand Year Old Vampire\", should you be willing to read a book where you have to actively participate in.", "created_utc": "1630692303.0", "edited": "False", "id": "hbh3ifa", "is_submitter": "False", "link_id": "t3_ph8qgc", "parent_id": "t3_ph8qgc", "score": "5", "subreddit": "suggestmeabook", "subreddit_id": "t5_31t41"}, {"author": "Azazyel616", "body": "Couples counseling can work quite well, the trick is to take it early enough so there still is something to save. Each site still needs to be commited to the common cause. I don't know whether that can be said about OP's group.", "created_utc": "1628846984.0", "edited": "False", "id": "h8rjjb5", "is_submitter": "False", "link_id": "t3_p3fhqp", "parent_id": "t1_h8qyqj9", "score": "2", "subreddit": "DMAcademy", "subreddit_id": "t5_3f611"}, {"author": "Azazyel616", "body": "Matt Colville made a video for YouTube where he explains exactly how a West Marches game works, I recommend watching that", "created_utc": "1628846876.0", "edited": "False", "id": "h8rjes7", "is_submitter": "False", "link_id": "t3_p3fhqp", "parent_id": "t1_h8r2jqz", "score": "2", "subreddit": "DMAcademy", "subreddit_id": "t5_3f611"}, {"author": "Azazyel616", "body": "Ich finde, Mhaire von Orkenspalter TV schafft es hervorragend, Rakorium darzustellen. Er kommt in der Borbaradkampagne vor, z.B. im Maraskan-Abenteuer \"Pforte des Grauens\". Wenn man die Zeit hat, sich die Folgen anzusehen, lohnt es sich echt.", "created_utc": "1628765348.0", "edited": "False", "id": "h8n1i56", "is_submitter": "False", "link_id": "t3_p2vn86", "parent_id": "t3_p2vn86", "score": "8", "subreddit": "DSA_RPG", "subreddit_id": "t5_2vjcr"}, {"author": "Azazyel616", "body": "I would like some examples as well. \nBut I can give some on the \"Sins of the Father\"-trope, as that was a much used one in the times of Ibsen. His work \"Gengangere\" makes for a nice example. There's much to learn from him anyway, as he was a busy writer and learned a lot over the years", "created_utc": "1628090893.0", "edited": "False", "id": "h7ori4p", "is_submitter": "False", "link_id": "t3_oxrm5q", "parent_id": "t1_h7ohyw6", "score": "6", "subreddit": "fantasywriters", "subreddit_id": "t5_2t4ad"}, {"author": "Azazyel616", "body": "Ich hab bisher die Finger davon gelassen, da ich den Eindruck habe, dass das Projekt mittlerweile ruht. Kenne aber die Macher nicht, kann das also nicht mit Gewissheit sagen.", "created_utc": "1626021579.0", "edited": "False", "id": "h4tmutl", "is_submitter": "False", "link_id": "t3_oi31z2", "parent_id": "t1_h4t34m9", "score": "2", "subreddit": "DSA_RPG", "subreddit_id": "t5_2vjcr"}, {"author": "Azazyel616", "body": "Jeder hat denke ich so \"sein\" Aventurien, für die einen sollte es sehr bodenständig bleiben, für andere sind High-Fantasy-Elemente in Ordnung. Muss man einfach nach eigenem Geschmack beurteilen. Durch die Globulen gibt es ja eine logische Erklärung für einige Inhalte des Abenteuers.", "created_utc": "1626021395.0", "edited": "False", "id": "h4tmho8", "is_submitter": "False", "link_id": "t3_oi31z2", "parent_id": "t1_h4t18wi", "score": "2", "subreddit": "DSA_RPG", "subreddit_id": "t5_2vjcr"}, {"author": "Azazyel616", "body": "Der DSA-Comic \"Der Andergaster\" war ursprünglich mal ein unveröffentlichte Abenteuer, welches der Autor genau für den Zweck geschrieben hatte, seiner Gruppe vor \"Phileasson\" ein kürzeres Abenteuer vorsetzen zu können. Mittlerweile steht es im Scriptorium drin, für Pay what you want. Ich habe es mal als Spieler erlebt und es war sehr atmosphärisch und stimmungsvoll.\n\nWill man vor Phileasson was längeres spielen, gäbe es noch zwei kleinere Kampagnen im Raum Thorwal/Orkland/Gjalskerland: einmal die \"Orkland-Trilogie\", die aber vermutlich viel Arbeit machen würde für Umarbeitungen, und dann noch die \"Jandra-Saga\", die ich selbst geleitet habe und sehr cool fand. Etwas railroadig, aber dabei recht einsteigerfreundlich.", "created_utc": "1626021073.0", "edited": "False", "id": "h4tlutf", "is_submitter": "False", "link_id": "t3_oi31z2", "parent_id": "t1_h4t12jn", "score": "5", "subreddit": "DSA_RPG", "subreddit_id": "t5_2vjcr"}, {"author": "Azazyel616", "body": "Ein Vorteil an \"Über den Greifenpass\" ist, dass bereits einige innerweltliche Geheimnisse angedeutet werden. Man kann danach, so man sich das zutraut, auch ein paar kleinere Abenteuer zusammenstellen, die das weiter vertiefen. Naheliegend wären Sachen rund um Selem, die Echsensümpfe und Maraskan, etwa \"Gefängnis der Jahre\" oder \"Die Wandelbare\", zweiteres erfordert allerdings etwas mehr Meistererfahrung", "created_utc": "1626007566.0", "edited": "False", "id": "h4sxf0w", "is_submitter": "False", "link_id": "t3_oi31z2", "parent_id": "t3_oi31z2", "score": "2", "subreddit": "DSA_RPG", "subreddit_id": "t5_2vjcr"}, {"author": "Azazyel616", "body": "Freddie Mercury.", "created_utc": "1625129197.0", "edited": "False", "id": "h3nupvo", "is_submitter": "False", "link_id": "t3_ob3vqy", "parent_id": "t1_h3m6c25", "score": "14", "subreddit": "dndmemes", "subreddit_id": "t5_35g8o"}, {"author": "Azazyel616", "body": "Wie hier schon erläutert wurde, stehen diese Abenteuer nur in den entsprechenden Kampagnenbänden und wurden nicht einzeln gedruckt", "created_utc": "1620739721.0", "edited": "False", "id": "gxq62oj", "is_submitter": "False", "link_id": "t3_n9qjn0", "parent_id": "t3_n9qjn0", "score": "1", "subreddit": "DSA_RPG", "subreddit_id": "t5_2vjcr"}, {"author": "Azazyel616", "body": "Passt auf jeden Fall gut, es wird aber einen deutlichen Unterschied geben: der Geweihte ist sozial anerkannt, nicht so ein Außenseiter wie die Hexer bei Sapkowski.", "created_utc": "1617379237.0", "edited": "False", "id": "gt5hidc", "is_submitter": "False", "link_id": "t3_mi27r2", "parent_id": "t1_gt2sgu7", "score": "2", "subreddit": "DSA_RPG", "subreddit_id": "t5_2vjcr"}, {"author": "Azazyel616", "body": "Und als Autor eines Heldenwerks, in dem ein Monsterjäger namens Gerbald von Riva kurz vorkommt  😁", "created_utc": "1617378397.0", "edited": "False", "id": "gt5fts7", "is_submitter": "False", "link_id": "t3_mi27r2", "parent_id": "t1_gt2bctc", "score": "3", "subreddit": "DSA_RPG", "subreddit_id": "t5_2vjcr"}, {"author": "Azazyel616", "body": "\"Don't play in that puddle, kids.\" \n\nGo tell that to the kids that already tried to. \n\nThey're still here. \n\nThey're listening.", "created_utc": "1611913987.0", "edited": "False", "id": "gl7uoxj", "is_submitter": "False", "link_id": "t3_l7gvcj", "parent_id": "t3_l7gvcj", "score": "1", "subreddit": "interestingasfuck", "subreddit_id": "t5_2qhsa"}, {"author": "Azazyel616", "body": "And thus, they were both turned to stone...", "created_utc": "1611690877.0", "edited": "False", "id": "gkv05hr", "is_submitter": "False", "link_id": "t3_l5daga", "parent_id": "t3_l5daga", "score": "1", "subreddit": "interestingasfuck", "subreddit_id": "t5_2qhsa"}, {"author": "Azazyel616", "body": "That's entirely possible! The experts considered this, but at this point in time, the interpretation is that it's a mixture and not a man wearing skin. I guess that stems from the form of the head, where there's almost no forehead, which points more towards a lion than a human", "created_utc": "1611655161.0", "edited": "False", "id": "gkt58zq", "is_submitter": "True", "link_id": "t3_l50tks", "parent_id": "t1_gkt06cg", "score": "5", "subreddit": "ArtefactPorn", "subreddit_id": "t5_313fb"}, {"author": "Azazyel616", "body": "Found next to the german town of Ulm, Baden-Württemberg, this statuette poses the oldest example of a piece of art depicting a mixture of man and animal that we know of.\n\nhttps://en.wikipedia.org/wiki/Lion-man?wprov=sfla1\n\nhttps://blog.britishmuseum.org/the-lion-man-an-ice-age-masterpiece/", "created_utc": "1611618875.0", "edited": "1611623864.0", "id": "gkrmro5", "is_submitter": "True", "link_id": "t3_l50tks", "parent_id": "t3_l50tks", "score": "18", "subreddit": "ArtefactPorn", "subreddit_id": "t5_313fb"}, {"author": "Azazyel616", "body": "That's very likely. Compare it with the situation after the advent of metal tools and weapons: people didn't stop producing stone tools from one moment to the other, however practical the metal ones might have been. Instead, it seems, some cratftsmen took pride in the fact that they could produce the same forms that bronze short swords or daggers were shaped in, but in flint. Those weren't operational, they were mere demonstrations, or 'show-offs', if you will, of their craftsmanship.", "created_utc": "1611618659.0", "edited": "False", "id": "gkrmcrs", "is_submitter": "False", "link_id": "t3_l4rnn3", "parent_id": "t1_gkrk0nt", "score": "2", "subreddit": "ArtefactPorn", "subreddit_id": "t5_313fb"}, {"author": "Azazyel616", "body": "The rule of thumb for flint knapping is this: To make a useful tool, you need a certain amount of time. But to make the polished versions of flint tools that went en vogue in neolithic times, you needed twice the time, and it didn't improve it's practical usefulness.\n\nSo all that extra time you spent to make it look better and in which you could've just made a second tool? Was spent for aesthetics only. \n\nThe cool thing about this is that archaeologists ask questions like 'when did humans stop worrying only about food and reproduction and start producing art?' and stuff like this is a puzzle piece of the answer. \n\nOf course, we know of much older examples of art. I recommend everyone who's interested to check out the finds they present in Ulm, Germany. The oldest flute in the world, made from vulture bone. And one of my personal favourites, the sculpture titled 'lion man', made from mammoth ivory. Est. 35 000 - 41 000 years old.", "created_utc": "1611617161.0", "edited": "False", "id": "gkrjg0v", "is_submitter": "False", "link_id": "t3_l4rnn3", "parent_id": "t1_gkrc84p", "score": "20", "subreddit": "ArtefactPorn", "subreddit_id": "t5_313fb"}, {"author": "Azazyel616", "body": "This dagger might not be made from it, but Helgoland has red flint. It's the only place in the world that does: (link in german) https://de.wikipedia.org/wiki/Helgol%C3%A4nder_Feuerstein?wprov=sfla1", "created_utc": "1611613200.0", "edited": "False", "id": "gkrbd6g", "is_submitter": "False", "link_id": "t3_l4rnn3", "parent_id": "t1_gkqdsn7", "score": "16", "subreddit": "ArtefactPorn", "subreddit_id": "t5_313fb"}, {"author": "Azazyel616", "body": "Die Betreiber hatten vor ein paar Monaten eigentlich mal gesagt, dass sie die Seite weiter online lassen wollen. Glaube also erstmal nicht, dass sie sie jetzt einfach abschalten", "created_utc": "1610962239.0", "edited": "False", "id": "gjpfguj", "is_submitter": "False", "link_id": "t3_kzrciz", "parent_id": "t3_kzrciz", "score": "5", "subreddit": "DSA_RPG", "subreddit_id": "t5_2vjcr"}, {"author": "Azazyel616", "body": "When we were younger, in our early twens we often played 8 hours, sometimes even 10, but I don't know how we did that. It's usually around 3-4 now, sometimes 5 or 6. It got exhausting to do more. Then again, I was only a player, but now I'm the GM, so that of course changed the amount of energy I have to put in", "created_utc": "1610580615.0", "edited": "False", "id": "gj64ap7", "is_submitter": "False", "link_id": "t3_kwqs34", "parent_id": "t3_kwqs34", "score": "2", "subreddit": "rpg", "subreddit_id": "t5_2qh2s"}, {"author": "Azazyel616", "body": "Yes.", "created_utc": "1610477594.0", "edited": "False", "id": "gj10dkw", "is_submitter": "False", "link_id": "t3_kvpzxy", "parent_id": "t3_kvpzxy", "score": "2", "subreddit": "ShouldIbuythisgame", "subreddit_id": "t5_2ud8h"}, {"author": "Azazyel616", "body": "Oh yeah, Schloss Bürresheim, nice!", "created_utc": "1610447012.0", "edited": "False", "id": "gizk1c1", "is_submitter": "False", "link_id": "t3_kv9uw9", "parent_id": "t3_kv9uw9", "score": "3", "subreddit": "ArchitecturalRevival", "subreddit_id": "t5_22pet1"}, {"author": "Azazyel616", "body": "Kick Ark off the list, please. Then, you can't make a wrong choice, those other 3 really shine. I voted for Subnautica btw.", "created_utc": "1609864237.0", "edited": "False", "id": "gi6yob8", "is_submitter": "False", "link_id": "t3_kqtlqa", "parent_id": "t3_kqtlqa", "score": "1", "subreddit": "ShouldIbuythisgame", "subreddit_id": "t5_2ud8h"}, {"author": "Azazyel616", "body": "Stephen Donaldson: The Chronicles of Thomas Covenant, was big in the 80s but nowadays, less people know about it. It's the definition of Dark Fantasy, with a heavy lean into being a psychological study. \nHard to read at times and every now and then you'll need to take a break an just think. \n\nThomas Covenant, the main character, is thrown into a fantasy world, but really doesn't believe anything of that to be real, so he acts without any responsibility, even rapes a woman. That scene of course turned some readers away. \nBut the author deeply explores the concepts of guilt and responsibility, often far beyond what's pleasant for the reader. So Covenant has to deal with his past relentlessly, and with everything he tries to achieve,  he often fails. Over the course of the books, he learns to trust himself more, but still struggles. He's the typical \"wants to but can't save everyone\" guy. \n\nThe series came to an end only a few years ago. I especially recommend the first two trilogies, they've been one of the best reads of my life.", "created_utc": "1609844365.0", "edited": "False", "id": "gi63ml1", "is_submitter": "False", "link_id": "t3_kqrsaf", "parent_id": "t3_kqrsaf", "score": "-3", "subreddit": "Fantasy", "subreddit_id": "t5_2qknd"}, {"author": "Azazyel616", "body": "The best AC games might be AC II, Black Flag and Origins, though that depends on taste of course.", "created_utc": "1609712666.0", "edited": "False", "id": "gi03btd", "is_submitter": "False", "link_id": "t3_kprubj", "parent_id": "t3_kprubj", "score": "2", "subreddit": "ShouldIbuythisgame", "subreddit_id": "t5_2ud8h"}, {"author": "Azazyel616", "body": "Cool Post OP,  I enjoyed the read. But nothing beats the comment section. I hit gold 😍 Best comments ever 👍", "created_utc": "1609670780.0", "edited": "False", "id": "ghxnr2t", "is_submitter": "False", "link_id": "t3_kpcz7h", "parent_id": "t3_kpcz7h", "score": "1", "subreddit": "tifu", "subreddit_id": "t5_2to41"}, {"author": "Azazyel616", "body": "There's been so many great games in the last years! God of War (2018), Horizon: Zero Dawn, Hades, Sekiro, Divinity: OS2. \n\nI'd also suggest you try playing some shorter Indie games. If you know a game is shorter, maybe you can approach them with a different mind set to enjoy the experience better. Outer Wilds, Darkest Dungeon, Ori, Hollow Knight are all great and some of them can be enjoyed for longer than just a few hours. I also really like the Banner Saga trilogy.", "created_utc": "1609586054.0", "edited": "False", "id": "ghth6ao", "is_submitter": "False", "link_id": "t3_koj5gt", "parent_id": "t3_koj5gt", "score": "1", "subreddit": "witcher", "subreddit_id": "t5_2sebi"}, {"author": "Azazyel616", "body": "Oh sorry, I didn't get the question on the free rules. No, the Basic Rules are not free, they charge you even for the PDF. But it's cheaper than the physical copy and sometimes it goes on sale. I bought it for 5€, even though I currently have no plans on using it, I considered it nice to have...", "created_utc": "1609540625.0", "edited": "False", "id": "ghrnjdf", "is_submitter": "False", "link_id": "t3_kobs0q", "parent_id": "t1_ghrhidz", "score": "2", "subreddit": "dndmemes", "subreddit_id": "t5_35g8o"}, {"author": "Azazyel616", "body": "For the current 5e, they have a rules light starter's set which I heard good things about. Some books of that edition have been translated into english. My own groups are all playing 4e, which was a real rules heavy edition, but I like most of it. Wouldn't recommend it to everyone,  though. \n\nGermany has an active player scene, so it's not hard to find groups atleast for the bigger systems.", "created_utc": "1609526159.0", "edited": "False", "id": "ghqrwku", "is_submitter": "False", "link_id": "t3_kobs0q", "parent_id": "t1_ghqoq8h", "score": "2", "subreddit": "dndmemes", "subreddit_id": "t5_35g8o"}, {"author": "Azazyel616", "body": "I live in Germany and it's the biggest TTRPG system here, beating DnD in player numbers. I play it since 2011.", "created_utc": "1609523915.0", "edited": "False", "id": "ghqlu3u", "is_submitter": "False", "link_id": "t3_kobs0q", "parent_id": "t1_ghqdo46", "score": "2", "subreddit": "dndmemes", "subreddit_id": "t5_35g8o"}, {"author": "Azazyel616", "body": "Tell me about it. I started a Two-Shot in December 2019, since I was visiting my hometown then. \n\nWe played an official Module for The Dark Eye. The plot was about a sickness that came from spores, sent by the fungus villain living under the City. After a building had collapsed and revealed a cave underneath, many inhabitants got infected by the spores that now whirled through the air freely. The PCs had to do something about it while fearing they themselves might already have been infected. \n\nWe wanted to play the 2nd session in March of 2020, but cancelled the trip due to Covid. Afterwards, one of the players got his degree and started working so he doesn't have much free time anymore. \n\nSo we can't finish our infection-themed Two-Shot because the RL epidemic got in the way.", "created_utc": "1609517825.0", "edited": "False", "id": "ghq660t", "is_submitter": "False", "link_id": "t3_kobs0q", "parent_id": "t3_kobs0q", "score": "10", "subreddit": "dndmemes", "subreddit_id": "t5_35g8o"}, {"author": "Azazyel616", "body": "Oh, good for you! I thought of an other adventure, but that explains it. \n\nI'm DMing that very same campaign. But we're only at the beginning, having played only the first adventure yet.", "created_utc": "1609269894.0", "edited": "False", "id": "ghf5ffq", "is_submitter": "False", "link_id": "t3_kmbham", "parent_id": "t1_ghentwm", "score": "4", "subreddit": "rpg", "subreddit_id": "t5_2qh2s"}, {"author": "Azazyel616", "body": "You're playing The Dark Eye, I assume?", "created_utc": "1609242185.0", "edited": "False", "id": "ghdv3bo", "is_submitter": "False", "link_id": "t3_kmbham", "parent_id": "t1_ghdslnx", "score": "35", "subreddit": "rpg", "subreddit_id": "t5_2qh2s"}, {"author": "Azazyel616", "body": "The Gothic game series did it first 😆", "created_utc": "1609241933.0", "edited": "False", "id": "ghduuoo", "is_submitter": "False", "link_id": "t3_km1d0z", "parent_id": "t3_km1d0z", "score": "1", "subreddit": "witcher", "subreddit_id": "t5_2sebi"}, {"author": "Azazyel616", "body": "Legacy of Kain", "created_utc": "1605281916.0", "edited": "False", "id": "gc5rhhg", "is_submitter": "False", "link_id": "t3_jtg9bf", "parent_id": "t3_jtg9bf", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "Azazyel616", "body": "Oh, I see. No, I'm not british, that might explain it", "created_utc": "1601381099.0", "edited": "False", "id": "g71ulm8", "is_submitter": "False", "link_id": "t3_j1v2gv", "parent_id": "t1_g71t2cz", "score": "5", "subreddit": "discworld", "subreddit_id": "t5_2rh3j"}, {"author": "Azazyel616", "body": "I think Wee Free Men makes for the best start. It's just so awesome and hilarious!", "created_utc": "1601375737.0", "edited": "False", "id": "g71oza9", "is_submitter": "False", "link_id": "t3_j1v2gv", "parent_id": "t1_g71nhf8", "score": "8", "subreddit": "discworld", "subreddit_id": "t5_2rh3j"}, {"author": "Azazyel616", "body": "Good stuff, all in all. \n\nBut I really don't think anyone should start with Pyramids. I did, and it didn't make me wanna read more. I really couldn't understand what all the fuzz was about with that Terry Pratchett guy. \n\nYears later I gave him another chance, and to my surprise, his books were really funny.", "created_utc": "1601374018.0", "edited": "False", "id": "g71nhf8", "is_submitter": "False", "link_id": "t3_j1v2gv", "parent_id": "t3_j1v2gv", "score": "26", "subreddit": "discworld", "subreddit_id": "t5_2rh3j"}, {"author": "Azazyel616", "body": "Solitude, but in earlier times", "created_utc": "1601143718.0", "edited": "False", "id": "g6pduzl", "is_submitter": "False", "link_id": "t3_j08imy", "parent_id": "t3_j08imy", "score": "67", "subreddit": "worldbuilding", "subreddit_id": "t5_2rd6n"}, {"author": "Azazyel616", "body": "That usually doesn't help them escape, but it helps you levelling up those healing skills...", "created_utc": "1599468697.0", "edited": "False", "id": "g4bcm1r", "is_submitter": "False", "link_id": "t3_inze80", "parent_id": "t3_inze80", "score": "7", "subreddit": "skyrim", "subreddit_id": "t5_2s837"}, {"author": "Azazyel616", "body": "Same here, it really is big in Germany", "created_utc": "1599056033.0", "edited": "False", "id": "g3pydv9", "is_submitter": "False", "link_id": "t3_il5p3v", "parent_id": "t1_g3pm7c4", "score": "8", "subreddit": "rpg", "subreddit_id": "t5_2qh2s"}, {"author": "Azazyel616", "body": "Mannimarco King of Worms, Beggar - Thief - Warrior - King, The Mystery of Princess Talara. Palla has been mentioned before, it's a good read. Feyfolken is the best I think.", "created_utc": "1598982926.0", "edited": "False", "id": "g3m9lom", "is_submitter": "False", "link_id": "t3_ikkpw0", "parent_id": "t3_ikkpw0", "score": "16", "subreddit": "teslore", "subreddit_id": "t5_2t5ay"}, {"author": "Azazyel616", "body": "Oh crab.", "created_utc": "1597412661.0", "edited": "False", "id": "g1fveic", "is_submitter": "False", "link_id": "t3_i94680", "parent_id": "t3_i94680", "score": "1", "subreddit": "dndmemes", "subreddit_id": "t5_35g8o"}, {"author": "Azazyel616", "body": "Catan, since it got me into playing boardgames back in the 90s. Still love it.\n\nBattleStar Galactica, the best game I know, especially because of the social aspects of it. Making up tactics, reading the other players, trying to lie while keeping a straight face... it's just SO good. It also perfectly captures the essence of what made the TV series so good while adding to it. \n\nCitadels, a bit lighter than the others but still challenging. Also shorter, so it's far easier to have a game or two without having to spend all night playing.", "created_utc": "1596744343.0", "edited": "False", "id": "g0lms8x", "is_submitter": "False", "link_id": "t3_i4vpor", "parent_id": "t3_i4vpor", "score": "3", "subreddit": "boardgames", "subreddit_id": "t5_2qmjp"}, {"author": "Azazyel616", "body": "One of the best games I ever played, maybe THE best, even. The campaign was awesome, but make shure to play TFT as well. \nSo yeah. Go get it.", "created_utc": "1594890580.0", "edited": "False", "id": "fy8iht3", "is_submitter": "False", "link_id": "t3_hs4f5k", "parent_id": "t3_hs4f5k", "score": "1", "subreddit": "ShouldIbuythisgame", "subreddit_id": "t5_2ud8h"}, {"author": "Azazyel616", "body": "Get Outer Wilds and Disco Elysium. Maybe Deus Ex as well, since it's so cheap", "created_utc": "1594286285.0", "edited": "False", "id": "fxems5s", "is_submitter": "False", "link_id": "t3_hnzuip", "parent_id": "t3_hnzuip", "score": "1", "subreddit": "ShouldIbuythisgame", "subreddit_id": "t5_2ud8h"}]