[{"author": "batbrainbat", "body": "I love this idea!! I'm both an avid RPer *and* penpaller, so this could be so much fun! Did you have any particular genres in mind?", "created_utc": "1666396942.0", "edited": "False", "id": "it9syg3", "is_submitter": "False", "link_id": "t3_y9tp4q", "parent_id": "t3_y9tp4q", "score": "1", "subreddit": "Roleplay", "subreddit_id": "t5_2qrxs"}, {"author": "batbrainbat", "body": "Partially toasted marshmallow", "created_utc": "1666396515.0", "edited": "False", "id": "it9s2k0", "is_submitter": "False", "link_id": "t3_y9vbo6", "parent_id": "t3_y9vbo6", "score": "4", "subreddit": "Rabbits", "subreddit_id": "t5_2riv8"}, {"author": "batbrainbat", "body": "I finally went to the doctor to get help with my mental health!! <3", "created_utc": "1666319896.0", "edited": "False", "id": "it5mrgx", "is_submitter": "False", "link_id": "t3_y92n28", "parent_id": "t3_y92n28", "score": "6", "subreddit": "littlespace", "subreddit_id": "t5_2voav"}, {"author": "batbrainbat", "body": "Ooh this is also a really handy tip. Thank you for sharing!", "created_utc": "1665779421.0", "edited": "False", "id": "isc1xu8", "is_submitter": "False", "link_id": "t3_y386kh", "parent_id": "t1_isb4l0n", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "batbrainbat", "body": "I was unsure of this too when I first learned the method, but I don't think it really matters. I think it actually means 'phrase' as in a set phrase, like \"Good morning\", \"Nice to meet you\", and so on, and otherwise you just do single words. But, there's no reason why a whole sentence wouldn't work either, except that it might take up too much space depending on your setup. In its functioning, the Goldlist method is pretty much just a regular SRS system in a different format.\n\nI personally just do single words and as simple of a translation as I can get, to get me familiar with the word. If it has other, more specific meanings, then I'd just discover them naturally later on anyway.", "created_utc": "1665779371.0", "edited": "False", "id": "isc1tah", "is_submitter": "False", "link_id": "t3_y386kh", "parent_id": "t1_is94tt6", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "batbrainbat", "body": "Well, firstly, I'm slow to code switch after I've been using one language for a while, either speaking it with others or just studying, so for a while after, I'll still be stuck thinking in that language in bits and pieces.\n\nI've also noticed that I think out loud with ASL a lot more now. Even when browsing the internet, instead of just thinking, \"Ah yeah, cool content.\" I'll sign \"THAT\" or \"TRU-BIZ\" and so on. In the shower, I'll even sign big chunks of imagined conversations. I don't even do this for practice anymore, it's just become habit.\n\nNot answering your question so much anymore, but Just along the same vein as this, I use manual interjections in spoken conversations a lot more now (again, stuff like \"THAT\", \"SAME\", \"YES\"). My friends all know I'm learning ASL, most of whom even know a teeny bit themselves, so they're used to it. Though, it's become second nature now, so I've accidentally done it with strangers before and gotten some brow raises xD", "created_utc": "1665697753.0", "edited": "False", "id": "is7lwbr", "is_submitter": "False", "link_id": "t3_y31zhh", "parent_id": "t3_y31zhh", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "batbrainbat", "body": "Huh... This is interesting. It depends. With Japanese, I can understand them okay, but I'm at a point where I can tell when something sounds clunky (including with my own writing). I actually have a slightly harder time with ASL beginners. Before they've really grasped the sort of 'essence' of a manual language, and are trying to structure things too rigidly, I sometimes struggle to understand what they're trying to express.", "created_utc": "1665697285.0", "edited": "False", "id": "is7kqm7", "is_submitter": "False", "link_id": "t3_y2y46y", "parent_id": "t3_y2y46y", "score": "9", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "batbrainbat", "body": "THIS. I used to hate learning vocabulary, and I realized that a big part of it was that I couldn't like... survey my collection in Anki or other flashcard methods. It didn't feel like an accomplishment because I had no nice-looking visual reference. Now I use the Goldlist method, and I can flip through pages upon pages of pretty words in pretty colours while still having an effective way to memorize it all and *nnnh* it's so much less tedious now.", "created_utc": "1665696974.0", "edited": "False", "id": "is7jwe9", "is_submitter": "False", "link_id": "t3_y386kh", "parent_id": "t3_y386kh", "score": "30", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "batbrainbat", "body": "I love her. Hug her for me.", "created_utc": "1665446058.0", "edited": "False", "id": "irts2ib", "is_submitter": "False", "link_id": "t3_y0jwia", "parent_id": "t3_y0jwia", "score": "2", "subreddit": "crochet", "subreddit_id": "t5_2qm6c"}, {"author": "batbrainbat", "body": "Thank you for responding!\n\n>Would u say u  try to snap out of it but get pulled back in, like its hard to resist your mind going there.\n\nAbsolutely, especially when I dissociate with it. It's like mentally trying to pull yourself out of really deep mud. It's hard to begin with, and just gets harder the more you try because of how tiring it can be.\n\n>...do u feel like in a sense u created or crafted it, like testing it out   \nredesigning redoing scenes trying to make it as real and authentic as   \npossible...\n\nHm... Not quite. It's hard to explain... The scenes more follow the pattern of \\[person does something horrible, I react to it\\], just like that, back and forth. It's not like I'm trying to write and perfect a theatrical scene, not at all, but I suppose there is some level of \"I created this\"? The line is fuzzy, honestly, and it might depend on the specific scenario I'm stressing over. It's hard to tell...\n\nAlso, I have no idea when it started anymore. Years now. I didn't realize how bad it was getting until it was already bad.\n\n>why ask here and not in mdd subreddit\n\nI was planning to repost this there as well. To be honest, I just know this sub a little bit better and felt safer coming here first. I've only visited the MD sub a couple times because for a long time I didn't think this could be it at all. Only now I'm starting to really wonder about it", "created_utc": "1665206337.0", "edited": "False", "id": "irhk7ea", "is_submitter": "True", "link_id": "t3_xydv4w", "parent_id": "t1_irh3k7z", "score": "1", "subreddit": "BPD", "subreddit_id": "t5_2qqdp"}, {"author": "batbrainbat", "body": "Thank you for understanding! I think they're still valid things, especially if they're what helped you. I think I would just rephrase a little it to specify that, mention that they're the things you've learned to utilize in your healing. It's nice to hear you've gotten better btw \\^\\^", "created_utc": "1665180801.0", "edited": "False", "id": "irgdh36", "is_submitter": "False", "link_id": "t3_xy5l10", "parent_id": "t1_irgclho", "score": "1", "subreddit": "BPD", "subreddit_id": "t5_2qqdp"}, {"author": "batbrainbat", "body": "I understand what you're saying, but this feels a bit toxic. If it were that easy, none of us would be here to begin with. Especially those of us that regularly experience dissociative symptoms, logic isn't exactly a *possibility* at times.\n\nPoints 1-4 are good things to work towards, overtime, but it's not something one can just... choose to do all of a sudden. And just telling someone that they need to work towards those things without giving tips on how doesn't really make sense. Point 5 just feels insensitive, in my opinion. No person experiencing depression thinks laying in bed for three days is practical. But that doesn't mean they can just magically will themselves to stand before they're ready.\n\nI get what you're trying to say, I think, but I don't think this is worded very kindly or helpfully for others... If this is what helped you, though, then huge congrats on your progress!", "created_utc": "1665179987.0", "edited": "False", "id": "irgbwfr", "is_submitter": "False", "link_id": "t3_xy5l10", "parent_id": "t3_xy5l10", "score": "22", "subreddit": "BPD", "subreddit_id": "t5_2qqdp"}, {"author": "batbrainbat", "body": "Omg your aesthetics are so amazing quq\n\nOnce again, is it okay if I use this in my journal? I've been consistently using your moon dates in my mental health journal and it just brightens up the page 👉👈", "created_utc": "1665155668.0", "edited": "False", "id": "irev20t", "is_submitter": "False", "link_id": "t3_xxnb32", "parent_id": "t3_xxnb32", "score": "2", "subreddit": "neography", "subreddit_id": "t5_2rjr2"}, {"author": "batbrainbat", "body": "Oh gods, it's me with my Pokemon cards at 4am :')\n\nI hope wherever Autism Baby is now, I hope they're having a good life", "created_utc": "1665155213.0", "edited": "False", "id": "ireu20z", "is_submitter": "False", "link_id": "t3_xxw0zh", "parent_id": "t3_xxw0zh", "score": "5", "subreddit": "autism", "subreddit_id": "t5_2qhs6"}, {"author": "batbrainbat", "body": "Not an animal, a plushy. Common mistake", "created_utc": "1664909212.0", "edited": "False", "id": "ir1umuq", "is_submitter": "False", "link_id": "t3_xuyepr", "parent_id": "t3_xuyepr", "score": "2", "subreddit": "Rabbits", "subreddit_id": "t5_2riv8"}, {"author": "batbrainbat", "body": "This is one of the things that encouraged me to ask my doctor about assessment, but the opposite xD\n\nEveryone always said my mom seemed autistic, and she thought it sounded fitting, but never had an opportunity to go get tested.\n\n...Only in my 20s now did I talk to her about it more in depth, then went, \"Hey, wait a minute-\"", "created_utc": "1664378077.0", "edited": "False", "id": "iq8t7uz", "is_submitter": "False", "link_id": "t3_xqahzq", "parent_id": "t3_xqahzq", "score": "1", "subreddit": "autism", "subreddit_id": "t5_2qhs6"}, {"author": "batbrainbat", "body": "I wish I were that comfy right now, dang", "created_utc": "1664226832.0", "edited": "False", "id": "iq0tqar", "is_submitter": "False", "link_id": "t3_xonirn", "parent_id": "t3_xonirn", "score": "1", "subreddit": "Rabbits", "subreddit_id": "t5_2riv8"}, {"author": "batbrainbat", "body": "Your heart's in the right place, friend, but I wouldn't let a PETA representative within 10km of any of my pets...", "created_utc": "1664226369.0", "edited": "False", "id": "iq0skhq", "is_submitter": "False", "link_id": "t3_xoqwpr", "parent_id": "t3_xoqwpr", "score": "8", "subreddit": "Rabbits", "subreddit_id": "t5_2riv8"}, {"author": "batbrainbat", "body": "I saw a PETA ad suggesting that dairy is linked to autism and I wheezed outloud for a full three minutes", "created_utc": "1664163787.0", "edited": "False", "id": "ipxhgop", "is_submitter": "False", "link_id": "t3_xo1zce", "parent_id": "t3_xo1zce", "score": "28", "subreddit": "autism", "subreddit_id": "t5_2qhs6"}, {"author": "batbrainbat", "body": "As an artist and to-be fashion designer, your new palette is extremely pleasing to me uwu", "created_utc": "1664128590.0", "edited": "False", "id": "ipv7iiu", "is_submitter": "False", "link_id": "t3_xn1qsz", "parent_id": "t3_xn1qsz", "score": "1", "subreddit": "autism", "subreddit_id": "t5_2qhs6"}, {"author": "batbrainbat", "body": "Cousin <3", "created_utc": "1664124369.0", "edited": "False", "id": "ipuwgr9", "is_submitter": "False", "link_id": "t3_xn0i1p", "parent_id": "t3_xn0i1p", "score": "1", "subreddit": "Rabbits", "subreddit_id": "t5_2riv8"}, {"author": "batbrainbat", "body": "That kid's got the coolest parents, dang. And will now have the coolest blankey to grow up with too", "created_utc": "1664120425.0", "edited": "False", "id": "ipumz5d", "is_submitter": "False", "link_id": "t3_xnejnf", "parent_id": "t3_xnejnf", "score": "3", "subreddit": "crochet", "subreddit_id": "t5_2qm6c"}, {"author": "batbrainbat", "body": "I'm not... Doesn't mean I don't do it anyway, hehe", "created_utc": "1664120000.0", "edited": "False", "id": "ipulzgi", "is_submitter": "False", "link_id": "t3_xnhcp6", "parent_id": "t3_xnhcp6", "score": "1", "subreddit": "littlespace", "subreddit_id": "t5_2voav"}, {"author": "batbrainbat", "body": "My favourite piece of sex furniture I've ever had was this floral chaise lounge chair. It was basically an arm chair with a really long seat. The shape of that thing allowed for so many different positions, and doubled as the best nap chair ever. I'm still heartbroken we weren't able to bring it with us when we moved.\n\nI don't know how easy to acquire something like that would be where you live, but especially if you got one with tall-ish, wooden legs for rope play potential, that would be my recommendation. Versatile, comfy, and they just look cool.", "created_utc": "1664119827.0", "edited": "False", "id": "ipulkxz", "is_submitter": "False", "link_id": "t3_xnm4vg", "parent_id": "t3_xnm4vg", "score": "8", "subreddit": "BDSMcommunity", "subreddit_id": "t5_2r9tk"}, {"author": "batbrainbat", "body": "Gods, I feel that. xD  \nThe crab stitch will look super cute too. I love the colours you picked btw <3", "created_utc": "1663805490.0", "edited": "False", "id": "ipejwqs", "is_submitter": "False", "link_id": "t3_xjvkih", "parent_id": "t1_ipe1ehl", "score": "2", "subreddit": "crochet", "subreddit_id": "t5_2qm6c"}, {"author": "batbrainbat", "body": "Everyone's saying no to lace, but I think a lace boarder would be super cute x'D", "created_utc": "1663796064.0", "edited": "False", "id": "ipdy3be", "is_submitter": "False", "link_id": "t3_xjvkih", "parent_id": "t3_xjvkih", "score": "3", "subreddit": "crochet", "subreddit_id": "t5_2qm6c"}, {"author": "batbrainbat", "body": "For me personally, it'd be super distracting. Even when people mouth words silently as they're signing, it makes it hard for me to focus on just one thing. My brain tries to understand the signing, and lip read at the same time, so I end up processing nothing at all :')", "created_utc": "1663200303.0", "edited": "False", "id": "iogs3ow", "is_submitter": "False", "link_id": "t3_xe81rm", "parent_id": "t3_xe81rm", "score": "2", "subreddit": "asl", "subreddit_id": "t5_2qu95"}, {"author": "batbrainbat", "body": "Ow, my bony butt.", "created_utc": "1663014036.0", "edited": "False", "id": "io60wjn", "is_submitter": "False", "link_id": "t3_xca3e6", "parent_id": "t3_xca3e6", "score": "2", "subreddit": "autism", "subreddit_id": "t5_2qhs6"}, {"author": "batbrainbat", "body": "Thank you for the extra instruction, I'll give that a try! I agree, I thought they were too pretty in the image, I didn't want to just skip over them. I'm excited to see how they come out!", "created_utc": "1662740083.0", "edited": "False", "id": "inqr56s", "is_submitter": "True", "link_id": "t3_x9k37e", "parent_id": "t1_inonvfy", "score": "1", "subreddit": "crochet", "subreddit_id": "t5_2qm6c"}, {"author": "batbrainbat", "body": "Agh, I even saw the picot in my chart, but it was written differently. I've never done picots before, so I didn't recognize them in the image. Thank you for pointing it out, I'll put a sticky note next to the chart! <3", "created_utc": "1662739973.0", "edited": "False", "id": "inqqvbh", "is_submitter": "True", "link_id": "t3_x9k37e", "parent_id": "t1_inokdhu", "score": "2", "subreddit": "crochet", "subreddit_id": "t5_2qm6c"}, {"author": "batbrainbat", "body": "2 is a good age for a rat to live to. You gave her a long life, and I can tell you loved her hard. Sending warmth and well wishes to you and to her sisters. ❤🫂", "created_utc": "1662739779.0", "edited": "False", "id": "inqqdvg", "is_submitter": "False", "link_id": "t3_x9kp5v", "parent_id": "t3_x9kp5v", "score": "3", "subreddit": "RATS", "subreddit_id": "t5_2qnh3"}, {"author": "batbrainbat", "body": "Ekmek. I'm sobbing, that's such a cute name <3 :'D", "created_utc": "1662739498.0", "edited": "False", "id": "inqpoay", "is_submitter": "False", "link_id": "t3_x9ran8", "parent_id": "t1_inpiz0d", "score": "15", "subreddit": "Rabbits", "subreddit_id": "t5_2riv8"}, {"author": "batbrainbat", "body": "There's a difference between listening to what neat stuff my husband learned in college that day, versus awkwardly dancing around questions like, \"What do you do for work?\", \"What are you studying?\", asked by someone I barely know. I either have to lie, which makes my stomach hurt, or answer honestly that I'm struggling too much with mental health for work or school right now, to which they'll respond something like, \"But you don't *sound* depressed! You don't *look* like someone with ptsd! I don't think you need to get tested, because *I* don't think you're autistic!\" Mind yer business, Brenda. Small talk is just unnecessarily invasive.  (/lh)", "created_utc": "1662582901.0", "edited": "False", "id": "inhzpef", "is_submitter": "False", "link_id": "t3_x879w4", "parent_id": "t3_x879w4", "score": "2", "subreddit": "autism", "subreddit_id": "t5_2qhs6"}, {"author": "batbrainbat", "body": "This is so friggin cute though??\n\nWould it be okay if I used this in my journal? Not to post anywhere, just for me", "created_utc": "1662509953.0", "edited": "False", "id": "indwlko", "is_submitter": "False", "link_id": "t3_x7ftuy", "parent_id": "t3_x7ftuy", "score": "4", "subreddit": "neography", "subreddit_id": "t5_2rjr2"}, {"author": "batbrainbat", "body": "'Iconic' was the first word that came to mind. Hope you had fun! <3", "created_utc": "1662499415.0", "edited": "False", "id": "ind8ar6", "is_submitter": "False", "link_id": "t3_x7i7op", "parent_id": "t3_x7i7op", "score": "3", "subreddit": "autism", "subreddit_id": "t5_2qhs6"}, {"author": "batbrainbat", "body": "Phrasal verbs are something I would occasionally joke about with friends. Like, we'd always say, \"Haha, what a weird expression. Why on earth do we say that?\" But I never realized how weird they really are until I started learning other languages and saw that a lot of languages just... use normal, single-word verbs for stuff like that. English is bizarre. I'd be curious to know if there are other languages that use a ton of phrasal verbs like English does.", "created_utc": "1662335646.0", "edited": "False", "id": "in4c9pr", "is_submitter": "False", "link_id": "t3_x5tisp", "parent_id": "t1_in32c0k", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "batbrainbat", "body": "I think it just takes time, and it's important to be patient with yourself. When I'm feeling nervous about being vulnerable, I start by sitting down with my daddy and just telling him. Talk about how I feel, about why it's scary. That helps a lot, especially if your cg is kind and encouraging. Then, I take it in baby steps. Instead of going full little mode, I'll start with, say, a cutesy comment in passing. Then maybe showing off a drawing I did while I was feeling little, or an outfit I wore... Just small moments, to build up confidence, until you can eventually go into little space without fear. That's what I do when I'm struggling with vulnerability.", "created_utc": "1662330912.0", "edited": "False", "id": "in42axl", "is_submitter": "False", "link_id": "t3_x5yzvo", "parent_id": "t3_x5yzvo", "score": "3", "subreddit": "littlespace", "subreddit_id": "t5_2voav"}, {"author": "batbrainbat", "body": "Lots of good advice in this thread!\n\nFor me personally, it also involves a lot of specific dirty talk. The sex itself is also a lot slower and more gentle. There's often a lot of foreplay until I'm so needy I can't think straight, then daddy will say something like, \"You're being so dirty. Such a naughty girl, so eager to please. You really want daddy so badly?\" Like light, playful degradation. Sex is also treated like a reward for good behaviour, or punishment, depending.\n\nBut I can't always mix sex and little space. I depends on my mood, and why I'm in little space to begin with. Sometimes daddy misunderstands, and I safe-word right away and explain I just want lovings. Sometimes I also get overwhelmed by too much head-space-ness and have to be grounded with the right aftercare. It's just a lot of practice and experimentation!\n\nAs for your questions about props, we'll often use dildos in foreplay, and all of ours just happen to be really colourful anyway, so it fits nicely. Bondage is very fun, too. You could use things like ribbons to fit with the theme. Maybe a cg can say something like, \"You're being much too grabby. I'm going to have to put your hands away.\" I also go into pet headspace, sometimes combined with little space or just on its own, and for that I have a couple really pretty collars. You can find good quality, gorgeous, handmade ones specifically for that on Etsy.\n\nI'd just start with one thing you want to try, with an aesthetic that sits right with you! There aren't any hard rules aside from your own boundaries, and things you need to do to keep Safe, Sane, and Consensual. Get creative! Buy some rope and dye it pretty colours! Have your cg buy a wooden paddle for spanking, and give it to you to decorate with markers and stickers! The sky's the limit!", "created_utc": "1662310883.0", "edited": "False", "id": "in2qnzk", "is_submitter": "False", "link_id": "t3_x55hxv", "parent_id": "t3_x55hxv", "score": "3", "subreddit": "littlespace", "subreddit_id": "t5_2voav"}, {"author": "batbrainbat", "body": "Give us the bits, OP. Give to us the bits /j", "created_utc": "1662309830.0", "edited": "False", "id": "in2nzbk", "is_submitter": "False", "link_id": "t3_x5qt5t", "parent_id": "t3_x5qt5t", "score": "6", "subreddit": "autism", "subreddit_id": "t5_2qhs6"}, {"author": "batbrainbat", "body": "Pansexual enby little/middle here! <3", "created_utc": "1662166212.0", "edited": "False", "id": "imvbtgx", "is_submitter": "False", "link_id": "t3_x3szy1", "parent_id": "t3_x3szy1", "score": "1", "subreddit": "littlespace", "subreddit_id": "t5_2voav"}, {"author": "batbrainbat", "body": "Aw, but these are so neat :c  \nI don't think they're against the rules or anything. The sub descriptions does say, \"Post creative uses of existing constructed scripts or showcase your own.\" An intro to the language would be awesome, yeah, but I don't think you should stop posting these neat edits.", "created_utc": "1661312119.0", "edited": "False", "id": "iljspx9", "is_submitter": "False", "link_id": "t3_ww0ywp", "parent_id": "t1_ilinsh0", "score": "1", "subreddit": "neography", "subreddit_id": "t5_2rjr2"}, {"author": "batbrainbat", "body": "\"My favourite phonemes.\" Mostly plosives.", "created_utc": "1661292708.0", "edited": "False", "id": "ilikrkl", "is_submitter": "False", "link_id": "t3_wvfpq6", "parent_id": "t3_wvfpq6", "score": "1", "subreddit": "autism", "subreddit_id": "t5_2qhs6"}, {"author": "batbrainbat", "body": "I ask my cheeky fiancé, \"Are you serious, or are you screwing with me?\" at least three times a week", "created_utc": "1661182725.0", "edited": "False", "id": "ilc0kwm", "is_submitter": "False", "link_id": "t3_wutj9l", "parent_id": "t3_wutj9l", "score": "4", "subreddit": "autism", "subreddit_id": "t5_2qhs6"}, {"author": "batbrainbat", "body": "Fair enough. I used to be that way as a kid, but now I put mayo on whatever I can get away with :')  \nI'm a dirty mayo sinner /j", "created_utc": "1661182500.0", "edited": "False", "id": "ilbzzy1", "is_submitter": "False", "link_id": "t3_wq61wp", "parent_id": "t1_ilaczot", "score": "1", "subreddit": "autism", "subreddit_id": "t5_2qhs6"}, {"author": "batbrainbat", "body": "Oh, I also like those POV/roleplay ASMR videos, but for no other reason than that the really specific scenarios are amusing to me xD", "created_utc": "1661125426.0", "edited": "1661125677.0", "id": "il999fb", "is_submitter": "False", "link_id": "t3_wtys67", "parent_id": "t1_il994k5", "score": "1", "subreddit": "autism", "subreddit_id": "t5_2qhs6"}, {"author": "batbrainbat", "body": "I only like very, very specific ASMR. I couldn't even describe the qualities I like in it, though it usually tends to be cooking or baking ones. If it's the right kind, it makes me sleepy and comfy. Otherwise, most of the time, it either sounds annoying to varying degrees, or the sounds kinda make me gag-", "created_utc": "1661125361.0", "edited": "1661125607.0", "id": "il994k5", "is_submitter": "False", "link_id": "t3_wtys67", "parent_id": "t3_wtys67", "score": "1", "subreddit": "autism", "subreddit_id": "t5_2qhs6"}, {"author": "batbrainbat", "body": "This outfit is goals aaa...!! So pretty!!", "created_utc": "1660777727.0", "edited": "False", "id": "ikq24kc", "is_submitter": "False", "link_id": "t3_wqpbza", "parent_id": "t3_wqpbza", "score": "1", "subreddit": "littlespace", "subreddit_id": "t5_2voav"}, {"author": "batbrainbat", "body": "Oh is that what it's called?! I knew there had to be a name for it, but wasn't sure what it was, thank you!", "created_utc": "1660775735.0", "edited": "False", "id": "ikpxef1", "is_submitter": "False", "link_id": "t3_wq8gn4", "parent_id": "t1_ikptm61", "score": "1", "subreddit": "autism", "subreddit_id": "t5_2qhs6"}, {"author": "batbrainbat", "body": "To add to this, I *still* have trouble recognizing when I'm overstimulated, and I'm 22 already. I can go for hours being on edge, finding my stims aren't helping, or even making it worse, and wondering what the heck I'm so upset over. I have to stop myself for a long moment and just quietly observe my environment before realizing something like, \"Oh, the dehumidifier is really loud. The sound is upsetting me.\"", "created_utc": "1660753894.0", "edited": "False", "id": "ikobnju", "is_submitter": "False", "link_id": "t3_wq8gn4", "parent_id": "t1_iklmk6j", "score": "1", "subreddit": "autism", "subreddit_id": "t5_2qhs6"}, {"author": "batbrainbat", "body": "I agree with a lot of the other suggestions in this thread, but your question reminded me of two things, so I'll mention them real quick:\n\nAside from how his individual brain works, I also read an article once that explained that kids at this age just don't have great memory for general events. It's just not fully developed yet. It could also be that he doesn't have the language to describe it properly yet. Autistic or not, kids take time to develop mentally. (I don't know how accurate this article was, it was just something I found interesting. Now that I'm looking for it, I can't find the darn thing :c )\n\nOr, he really is just forgetful! Now that I think about it... I'm actually kind of the same way as you describe. I remember all the exhibits I saw at the museum earlier this month, but I don't remember when we went, or what happened after for the entire rest of the day. I just find specific events stick in my head better, and everything else kinda blends together in my mind. It's a big annoyance sometimes, but I have little tricks that I've worked out overtime for jotting down important information as it comes up.\n\nEither way, from what I've skimmed through in this thread, it sounds like you're doing a perfectly fine job raising him. I wouldn't worry about it too much :)", "created_utc": "1660753653.0", "edited": "False", "id": "ikob0jh", "is_submitter": "False", "link_id": "t3_wq8gn4", "parent_id": "t3_wq8gn4", "score": "1", "subreddit": "autism", "subreddit_id": "t5_2qhs6"}, {"author": "batbrainbat", "body": "The subtitles are hard to follow, but other than that, I love this. I never understood why people weren't just honest. I still don't really get it- xD", "created_utc": "1660751960.0", "edited": "False", "id": "iko6keb", "is_submitter": "False", "link_id": "t3_wqoa5r", "parent_id": "t3_wqoa5r", "score": "58", "subreddit": "autism", "subreddit_id": "t5_2qhs6"}, {"author": "batbrainbat", "body": "Your hair colour is magical 🥺✨", "created_utc": "1660748767.0", "edited": "False", "id": "ikny9f4", "is_submitter": "False", "link_id": "t3_wqpb49", "parent_id": "t3_wqpb49", "score": "4", "subreddit": "littlespace", "subreddit_id": "t5_2voav"}, {"author": "batbrainbat", "body": "Oh, oop, I just meant queso for myself. Personally I hate Takis, but I can definitely see the appeal in that combination. I just eat queso with plain tortilla chips, but I have to be careful not to eat the entire jar in one sitting xD", "created_utc": "1660748412.0", "edited": "False", "id": "iknxcu7", "is_submitter": "False", "link_id": "t3_wq61wp", "parent_id": "t1_iknq8pe", "score": "1", "subreddit": "autism", "subreddit_id": "t5_2qhs6"}, {"author": "batbrainbat", "body": "If it's bad enough to disrupt your sleep like that, it might be good to ask a doctor about it, if you can. I haven't asked mine about it, because it eased up, but if it comes back, I'm planning to see her right away just because of how annoying it is", "created_utc": "1660748276.0", "edited": "False", "id": "iknx07l", "is_submitter": "False", "link_id": "t3_wq1f5b", "parent_id": "t1_ikmk9hd", "score": "1", "subreddit": "autism", "subreddit_id": "t5_2qhs6"}, {"author": "batbrainbat", "body": "This is always what helps me hone my pronunciation. You can hear how the same words are pronounced over and over in your favourite songs, and harmonize. Mimicry is how one learns pronunciation anyway!\n\nOf course, I'd definitely also use Forvo and reading out loud to practice as well, since speaking has its own rhythm and intonation. But yeah, definitely don't shrug off singing either!", "created_utc": "1660711838.0", "edited": "False", "id": "ikm9usq", "is_submitter": "False", "link_id": "t3_wqb54l", "parent_id": "t3_wqb54l", "score": "7", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "batbrainbat", "body": "Yyyep, that's restless leg syndrome. It runs in my family. Sometimes it's so bad, it actually keeps me from sleeping. Luckily it hasn't been too terrible lately (knock on wood). Weighted blankets I've found can help sometimes, but it's 50/50, so I'm still looking for a better remedy :')", "created_utc": "1660711201.0", "edited": "False", "id": "ikm8tjq", "is_submitter": "False", "link_id": "t3_wq1f5b", "parent_id": "t3_wq1f5b", "score": "1", "subreddit": "autism", "subreddit_id": "t5_2qhs6"}, {"author": "batbrainbat", "body": "Honestly, most of those combinations sound bomb. Parmesan in mac is freaking delicious. And I'm the one person in the family that will clean out the queso jar so thoroughly it looks like I washed it xD", "created_utc": "1660711019.0", "edited": "False", "id": "ikm8is7", "is_submitter": "False", "link_id": "t3_wq61wp", "parent_id": "t1_iklzys7", "score": "1", "subreddit": "autism", "subreddit_id": "t5_2qhs6"}, {"author": "batbrainbat", "body": "That is very interesting and amusing, thank you for sharing that! xD\n\nWell now I have to ask. What do you think of mayonnaise?", "created_utc": "1660710280.0", "edited": "False", "id": "ikm79qf", "is_submitter": "False", "link_id": "t3_wq61wp", "parent_id": "t1_iklbmpe", "score": "3", "subreddit": "autism", "subreddit_id": "t5_2qhs6"}, {"author": "batbrainbat", "body": "**I freaking love bees.**", "created_utc": "1660710096.0", "edited": "False", "id": "ikm6yg3", "is_submitter": "False", "link_id": "t3_wq8zrz", "parent_id": "t3_wq8zrz", "score": "3", "subreddit": "autism", "subreddit_id": "t5_2qhs6"}, {"author": "batbrainbat", "body": "Holy crap, I thought this was just a bizarre little quirk I had. The only thing is that for me, it feels like the opposite - using a person's name feels *too* personal to me. I have no idea why. Like, if I call you by name and sound confident when I say it, you can be sure I like you a lot as a person.", "created_utc": "1660694247.0", "edited": "False", "id": "ikl9eki", "is_submitter": "False", "link_id": "t3_wq7hts", "parent_id": "t3_wq7hts", "score": "19", "subreddit": "autism", "subreddit_id": "t5_2qhs6"}, {"author": "batbrainbat", "body": "Different autistic folks can have a massive variety of differing traits! I hate the texture of lettuce on a burger, but my other autistic friend is perfectly fine with it. He hates hot soups, while they're my go-to. There are lots of autistics that are picky about their food, but just as many who would probably eat just about anything. This is one of those common secondary traits that a lot of us can relate with, but everyone is still unique. c:", "created_utc": "1660694050.0", "edited": "False", "id": "ikl8ymf", "is_submitter": "False", "link_id": "t3_wq61wp", "parent_id": "t1_ikl2l9s", "score": "25", "subreddit": "autism", "subreddit_id": "t5_2qhs6"}, {"author": "batbrainbat", "body": "So pretty...!! That colour looks so lovely on you. And congrats on your big journey!! You look gorgeous, and I bet you'll kill it out there <3", "created_utc": "1660497803.0", "edited": "False", "id": "ik9xzlr", "is_submitter": "False", "link_id": "t3_wnv1gk", "parent_id": "t3_wnv1gk", "score": "2", "subreddit": "poledancing", "subreddit_id": "t5_2s7x0"}, {"author": "batbrainbat", "body": "I feel like that's half of Japanese, honestly, but I've found this happens with other languages too. At this point, I always take textbooks with a grain of salt. I read and listen to media natives put out, and Google any conflicting words that pop up throughout my studies", "created_utc": "1660408279.0", "edited": "False", "id": "ik588vq", "is_submitter": "False", "link_id": "t3_wmwu20", "parent_id": "t3_wmwu20", "score": "1", "subreddit": "LearnJapanese", "subreddit_id": "t5_2qyls"}, {"author": "batbrainbat", "body": "It's been a long while since I've gotten to read these books, but my favourites were always always Spottedleaf and Yellowfang. They're very near and dear to my heart. <3\n\nI'm really glad I saw your post honestly. It instantly ignited an urge to reread the series. I remember when I first read it, I did a deep dive into the lore and tried really hard to get some freeform and/or tabletop RPs going, but couldn't find anyone who was interested at the time. I'm wondering if I ought to try again now...!", "created_utc": "1660407667.0", "edited": "False", "id": "ik56sor", "is_submitter": "False", "link_id": "t3_wn5ap6", "parent_id": "t1_ik54pbp", "score": "2", "subreddit": "autism", "subreddit_id": "t5_2qhs6"}, {"author": "batbrainbat", "body": "They've got tons of comorbidities, but can definitely conflict with each other as well. Another one of those for me is that I love spontaneous adventure (ADHD), but it also gets me real upset to not have my space and my routine once my brain's suddenly decided it's had enough (ASD), often to the point of tears.\n\nEven ASD can vary a ton from person to person. I heard someone make a play on the classic saying, \"When you've met one, you've met them all,\" changing it to, \"When you've met one autistic, well, you've met one autistic.\" One of my best friends also has both ASD and ADHD, and how it displays in him is almost the opposite of how it displays in me, yet we can still relate on a ton of other symptoms at the same time. It's pretty fascinating, honestly!\n\n(Sorry for the slight (ironic) ramble xD)", "created_utc": "1660407202.0", "edited": "False", "id": "ik55p3f", "is_submitter": "False", "link_id": "t3_wn2c5i", "parent_id": "t1_ik54iii", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "batbrainbat", "body": "I'm on a waiting list to get assessed for ASD! Language learning is definitely a special interest of mine. I'm 90% certain I also have ADHD, so some days I can fixate on studying, and other days, the executive dysfunction is inteeense.", "created_utc": "1660405123.0", "edited": "False", "id": "ik50s99", "is_submitter": "False", "link_id": "t3_wn2c5i", "parent_id": "t3_wn2c5i", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "batbrainbat", "body": "This is why I suck with vocabulary... :')", "created_utc": "1660405014.0", "edited": "False", "id": "ik50j5y", "is_submitter": "False", "link_id": "t3_wn2c5i", "parent_id": "t1_ik2xymv", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "batbrainbat", "body": "Superb special interest, my friend >:3  \nEasily one of my favourite series.", "created_utc": "1660403764.0", "edited": "False", "id": "ik4xlab", "is_submitter": "False", "link_id": "t3_wn5ap6", "parent_id": "t3_wn5ap6", "score": "2", "subreddit": "autism", "subreddit_id": "t5_2qhs6"}, {"author": "batbrainbat", "body": "For the sake of the dumb meme, I think I'd pick both anyway. Then I get a third bingo out of it :3", "created_utc": "1660403443.0", "edited": "False", "id": "ik4wtuu", "is_submitter": "False", "link_id": "t3_wmp7xw", "parent_id": "t1_ik33yff", "score": "1", "subreddit": "autism", "subreddit_id": "t5_2qhs6"}, {"author": "batbrainbat", "body": "I was just thinking that about myself when writing my comment! I noticed I even do that when learning new languages. I'm trying to push myself to speak more, sooner, but I really do tend to just listen and listen and wait until it feels like the right time xD", "created_utc": "1660403083.0", "edited": "False", "id": "ik4vzgu", "is_submitter": "False", "link_id": "t3_wmp7xw", "parent_id": "t1_ik3qfin", "score": "3", "subreddit": "autism", "subreddit_id": "t5_2qhs6"}, {"author": "batbrainbat", "body": "For me, it's a weird mix. I feel good when I wear cute things, but when I go out in public wearing cute things, it really does act like another layer to my masking, I think. It's cool because I feel like I don't have to work as hard to mask, but it also means unmasking when I get back into my pajamas is a bit harder and makes me feel just as wonky as usual, if not more so. It's a bit of a win-lose, and how much effort I put into my outfit and how it makes me feel really just depends on the day...", "created_utc": "1660402890.0", "edited": "False", "id": "ik4vj1o", "is_submitter": "False", "link_id": "t3_wn2blb", "parent_id": "t3_wn2blb", "score": "2", "subreddit": "autism", "subreddit_id": "t5_2qhs6"}, {"author": "batbrainbat", "body": "That feels kind of awkward in my mouth, personally, and sounds kind of confusing. I didn't know what the title was talking about until I read the text :'D", "created_utc": "1660360561.0", "edited": "False", "id": "ik321t2", "is_submitter": "False", "link_id": "t3_wmz8wo", "parent_id": "t3_wmz8wo", "score": "2", "subreddit": "autism", "subreddit_id": "t5_2qhs6"}, {"author": "batbrainbat", "body": "Oh don't worry, I know, I was using a semi-rhetorical question to agree with you. Sorry for the confusion!", "created_utc": "1660360358.0", "edited": "False", "id": "ik31nwl", "is_submitter": "False", "link_id": "t3_wmp7xw", "parent_id": "t1_ik0xh48", "score": "2", "subreddit": "autism", "subreddit_id": "t5_2qhs6"}, {"author": "batbrainbat", "body": "I don't know when exactly, my mom just retells my first-speaking story by prefacing that she had started to worry with how long I was taking. Then I just popped out with a full sentence out of the blue one day, confusing the heck out of her xD", "created_utc": "1660360296.0", "edited": "False", "id": "ik31jo4", "is_submitter": "False", "link_id": "t3_wmp7xw", "parent_id": "t1_ik2jo46", "score": "7", "subreddit": "autism", "subreddit_id": "t5_2qhs6"}, {"author": "batbrainbat", "body": "I didn't know which one to pick because... I spoke late, but when I finally started speaking, I spoke with an advanced vocabulary and in full sentences?? Which one do I do then...? T T", "created_utc": "1660325723.0", "edited": "False", "id": "ik0sf6w", "is_submitter": "False", "link_id": "t3_wmp7xw", "parent_id": "t3_wmp7xw", "score": "60", "subreddit": "autism", "subreddit_id": "t5_2qhs6"}, {"author": "batbrainbat", "body": "Oh boy, okay, so. Infodump it is! >:D\n\nHonestly, the hardest part is starting. And like, I don't mean that in a motivational kind of way. I mean *figuring out how you personally learn languages* is usually the thing that seems to defeat people right from the get-go. So my first bit of advice is this:\n\n*Do not let any website, Youtuber, app, or whatever, tell you that you have to learn something a specific way.* If a method doesn't work or is excruciatingly boring, *change it up!* No two people learn the same language the same way anyway!\n\nAnd that leads me to my second bit of advice:\n\nIt doesn't have to be boring. If anything, it *shouldn't* be boring! If it's boring, it won't stick as well. Do things you already enjoy, just in a new language! Or, if there's something specific about your language that you end up hyperfocusing on, great! Lean into it! Think of your language as colourful toy blocks. You can build so much more than you realize with just two or three blocks, and each time you play with them, you'll end up finding more and more blocks, to make better and cooler structures with!\n\nBesides that, your resources and methods may change wildly from language to language, depending on what resources are available, and even just because different languages feel different to play with. Go for a deep dive, find every decent grammar guide, lessons page, and dictionary you can get your hands on. Even if you end up sticking with just one resource, at least you have others for backup (or if you get bored).\n\nAfter all that, stuff gets easier. You'll find your niche, your routine, and you'll figure out what works for you. I have other general resources that aren't specific to any particular language, too. I can also share the ridiculous amount of study methods I've found for every individual, like, \"piece\" of a language. DM me if you'd like to discuss all of that, if you'd like! I just don't want to spam a bunch of links and how-to's in this one comment xD\n\nThen, as for linguistics, well, learning any language is a good way to get your foot in the door, I think. I'm definitely not an expert, but I've found that I just stumble onto concepts naturally while learning (along with some Wikipedia deep dives, hehe). In the beginning, you'll learn what parts of speech are — nouns, verbs, adjectives, adverbs, prepositions, etc. — and then if you look up \"\\[language\\] grammar\", you can find the big Wikipedia page on it that goes into more detail. And you can kinda just... tumble in from there, I guess. That's what I did anyway. I'm definitely not a linguistics expert, I just inhale whatever I happen to stumble upon on the topic, especially if it's related to phonetics xD\n\nI hope this helps!! > <", "created_utc": "1660325288.0", "edited": "False", "id": "ik0r9xf", "is_submitter": "False", "link_id": "t3_wc1o1r", "parent_id": "t1_iie9bb5", "score": "1", "subreddit": "autism", "subreddit_id": "t5_2qhs6"}, {"author": "batbrainbat", "body": "It's never too late! If you want to learn it, even if you don't live in an area that uses the language, it's still worth it for your own enrichment, I'd say. It's a very fun language, I'd say go for it if it's something you'd genuinely enjoy c:", "created_utc": "1660323831.0", "edited": "False", "id": "ik0ndhg", "is_submitter": "False", "link_id": "t3_wc1o1r", "parent_id": "t1_iieb99f", "score": "2", "subreddit": "autism", "subreddit_id": "t5_2qhs6"}, {"author": "batbrainbat", "body": "To be honest, I absolutely hate learning through apps. The closest thing I use is the web version of Duolingo, but I only use it for warm-ups really.\n\nI have a specific way I go about stuff. What I usually do is find a grammar guide online — not just any written lessons, I personally need something that explains *why* things are said the way they are, or it doesn't click for me. Then, I practice the new grammar by writing a small paragraph, then post that on iTalki and LangCorrect, so native speakers and community tutors can correct it, so I know if I'm using things right. Then, rinse and repeat, with various other activities sprinkled in so I don't get bored, or for picking up specific things.\n\nTo avoid info dumping with a huge wall of text, that's the basic rundown of what I do. If you want more specific resources and methods for things (I have so many heckin' methods), feel free to message me and I can explain things more clearly, if you'd like c:", "created_utc": "1660323677.0", "edited": "False", "id": "ik0myb0", "is_submitter": "False", "link_id": "t3_wc1o1r", "parent_id": "t1_iidy2zz", "score": "1", "subreddit": "autism", "subreddit_id": "t5_2qhs6"}, {"author": "batbrainbat", "body": "やった！すごい～！いつか一緒にチャットで練習したらどうですか？:3", "created_utc": "1660323184.0", "edited": "False", "id": "ik0lkwo", "is_submitter": "False", "link_id": "t3_wc1o1r", "parent_id": "t1_iida2ui", "score": "1", "subreddit": "autism", "subreddit_id": "t5_2qhs6"}, {"author": "batbrainbat", "body": "Aaa I've been wanting to create my own script for a while, but I'm not sure what direction I want to take it in. Conlangs are so fun and interesting as well.", "created_utc": "1660322620.0", "edited": "False", "id": "ik0k03w", "is_submitter": "False", "link_id": "t3_wc1o1r", "parent_id": "t1_iidxtb5", "score": "2", "subreddit": "autism", "subreddit_id": "t5_2qhs6"}, {"author": "batbrainbat", "body": "Eyyy! It's such a fun language, I can't wait to be more proficient in it! > <", "created_utc": "1660322464.0", "edited": "False", "id": "ik0jkwh", "is_submitter": "False", "link_id": "t3_wc1o1r", "parent_id": "t1_iics79t", "score": "2", "subreddit": "autism", "subreddit_id": "t5_2qhs6"}, {"author": "batbrainbat", "body": "やった～ ^^", "created_utc": "1659718011.0", "edited": "False", "id": "ij2ojtx", "is_submitter": "False", "link_id": "t3_w8qg6g", "parent_id": "t1_ij19oro", "score": "1", "subreddit": "language_exchange", "subreddit_id": "t5_2tdbm"}, {"author": "batbrainbat", "body": "Nice to meet you too!! Nerds unite! xD", "created_utc": "1659495727.0", "edited": "False", "id": "iiqg24t", "is_submitter": "False", "link_id": "t3_wc1o1r", "parent_id": "t1_iid67pt", "score": "4", "subreddit": "autism", "subreddit_id": "t5_2qhs6"}, {"author": "batbrainbat", "body": "I'm taking online classes from a tiny organization teaching ASL. It's definitely something you want at least one other person to practice with. It's really tricky to learn purely on your own", "created_utc": "1659495649.0", "edited": "False", "id": "iiqfw6g", "is_submitter": "False", "link_id": "t3_wc1o1r", "parent_id": "t1_iicx4v3", "score": "2", "subreddit": "autism", "subreddit_id": "t5_2qhs6"}, {"author": "batbrainbat", "body": "すげー！You are living the dream...!! ✨️", "created_utc": "1659242753.0", "edited": "False", "id": "iicgtm0", "is_submitter": "False", "link_id": "t3_wc1o1r", "parent_id": "t1_iicgcrs", "score": "2", "subreddit": "autism", "subreddit_id": "t5_2qhs6"}, {"author": "batbrainbat", "body": "大丈夫ですよ！僕はあなたにすぐにメッセージするつもりです！", "created_utc": "1659242635.0", "edited": "False", "id": "iicgm73", "is_submitter": "False", "link_id": "t3_wc1o1r", "parent_id": "t1_iicg1wk", "score": "2", "subreddit": "autism", "subreddit_id": "t5_2qhs6"}, {"author": "batbrainbat", "body": "I have an anxiety disorder and am seeking diagnosis for ASD, so I struggle a lot socially. This is a huuuge worry I have about travelling and trying to immerse myself. Your metaphor is agreeable in every way.", "created_utc": "1659241988.0", "edited": "False", "id": "iicfj7s", "is_submitter": "False", "link_id": "t3_wcbp3y", "parent_id": "t1_iic1xgu", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "batbrainbat", "body": "Выучу. ;3\n\nI studied Russian for a little while, but fell out of it as I prioritized other languages. I might still return to it one day. Now I'm just proud I can read Cyrillic, hehe.\n\nI can also read Hangul for the same reason, but didn't make nearly as much progress with Korean as I did with Russian xD", "created_utc": "1659241310.0", "edited": "False", "id": "iicedvp", "is_submitter": "False", "link_id": "t3_wc1o1r", "parent_id": "t1_iicdctg", "score": "1", "subreddit": "autism", "subreddit_id": "t5_2qhs6"}, {"author": "batbrainbat", "body": "Yaay I hope you enjoy it! It's such a fun and useful language to explore. ♡", "created_utc": "1659240629.0", "edited": "False", "id": "iicd7q1", "is_submitter": "False", "link_id": "t3_wc1o1r", "parent_id": "t1_iiccol8", "score": "2", "subreddit": "autism", "subreddit_id": "t5_2qhs6"}, {"author": "batbrainbat", "body": "Wooah that's impressive! I wish I could pick it up so quick!", "created_utc": "1659239841.0", "edited": "False", "id": "iicbsc0", "is_submitter": "False", "link_id": "t3_wc1o1r", "parent_id": "t1_iib5rpm", "score": "3", "subreddit": "autism", "subreddit_id": "t5_2qhs6"}, {"author": "batbrainbat", "body": "やった～！僕たち頑張りましょう～！\n\nもしよかったら、チャットで一緒に練習したらどうですか？| ω・｀)", "created_utc": "1659239774.0", "edited": "False", "id": "iicbntt", "is_submitter": "False", "link_id": "t3_wc1o1r", "parent_id": "t1_iica9s3", "score": "2", "subreddit": "autism", "subreddit_id": "t5_2qhs6"}, {"author": "batbrainbat", "body": "Just the ones I listed here. ASL is the language I'm most comfortable using other than English, especially because I use it when I'm anxious or nonverbal, but I don't think I can call myself fluent yet (B1-ish level). With Japanese, I can semi-comfortably hold a text conversation with a dictionary for help (I'm only like an A2-ish, aaalmost B1 :') ). And Indonesian, I literally just started a week or two ago, so I can only talk very basically about things I like (A1). xD", "created_utc": "1659239138.0", "edited": "False", "id": "iicahr0", "is_submitter": "False", "link_id": "t3_wc1o1r", "parent_id": "t1_iic5z0v", "score": "3", "subreddit": "autism", "subreddit_id": "t5_2qhs6"}, {"author": "batbrainbat", "body": "That's actually what pushed me to start taking classes! It's super handy as a support tool, and you get to connect to a new culture as a bonus! And it's also really heckin' fun >:3\n\nI'd learn whatever sign language is most common in your country. Don't do International Sign, it's not a full language unto itself, and SEE isn't really recommended for various cultural reasons (some actually see it as a sort of \"f\\*\\*\\* you\" to Deaf culture).", "created_utc": "1659223579.0", "edited": "False", "id": "iibf4qv", "is_submitter": "False", "link_id": "t3_wc1o1r", "parent_id": "t1_iibcjvg", "score": "3", "subreddit": "autism", "subreddit_id": "t5_2qhs6"}, {"author": "batbrainbat", "body": "Language learning and linguistics! I'm currently learning ASL, Japanese, and Indonesian!", "created_utc": "1659209861.0", "edited": "False", "id": "iiakyzb", "is_submitter": "False", "link_id": "t3_wc1o1r", "parent_id": "t3_wc1o1r", "score": "147", "subreddit": "autism", "subreddit_id": "t5_2qhs6"}, {"author": "batbrainbat", "body": "What's your favourite reptile, and what do you find interesting about it? :D", "created_utc": "1659137523.0", "edited": "False", "id": "ii6zbvx", "is_submitter": "False", "link_id": "t3_wbivwo", "parent_id": "t3_wbivwo", "score": "2", "subreddit": "autism", "subreddit_id": "t5_2qhs6"}, {"author": "batbrainbat", "body": "I diagnose him with Big and Handsome. Two very serious conditions.", "created_utc": "1659123374.0", "edited": "False", "id": "ii622vr", "is_submitter": "False", "link_id": "t3_wavd0m", "parent_id": "t3_wavd0m", "score": "4", "subreddit": "insects", "subreddit_id": "t5_2r87c"}, {"author": "batbrainbat", "body": "こんにちは！僕も日本語を勉強しています（A2思います…？B1かもしれません？）。インドネシア語も最近勉強を始めました！\n\n僕は22歳で、カナダ人です。趣味はジャーナルをしたり手紙を書いたり描いたり編み物をします。今通話ができないけど、チャットとボイスメッセージがいいです。\n\nもしよかったら、雑談しったらどうですか？\n\nよろしくお願いします ♡", "created_utc": "1659121489.0", "edited": "False", "id": "ii5xcz9", "is_submitter": "False", "link_id": "t3_w8qg6g", "parent_id": "t3_w8qg6g", "score": "1", "subreddit": "language_exchange", "subreddit_id": "t5_2tdbm"}, {"author": "batbrainbat", "body": "If you're transitioning for other people, you shouldn't be transitioning. If you're detransitioning for other people, you shouldn't be detransitioning. Unless it's a matter of actual safety, you should do what makes *you* happy, what makes *you* feel good in *your own* skin. It's a tough thing to internalize, but your literal *self* is nobody's business but your own.\n\nYour parents might never come around. Or, someday, they might. Either way, they haven't lost anything. You're their child, not their property to shape just how they like. That's their shit to figure out, not yours.", "created_utc": "1659052024.0", "edited": "False", "id": "ii25o04", "is_submitter": "False", "link_id": "t3_wacbsy", "parent_id": "t3_wacbsy", "score": "1", "subreddit": "lgbt", "subreddit_id": "t5_2qhh7"}, {"author": "batbrainbat", "body": "I hope whoever invented corduroy sits on a cactus", "created_utc": "1658786302.0", "edited": "False", "id": "ihmw4yr", "is_submitter": "False", "link_id": "t3_w7re0e", "parent_id": "t3_w7re0e", "score": "1", "subreddit": "autism", "subreddit_id": "t5_2qhs6"}, {"author": "batbrainbat", "body": "I'd absolutely wear those if they had a nice pattern on the fabric. I don't really like black or plain colours for garments like that at all. A lot of the comments are saying they look like hakama, so now all I can picture is those pants but with the patterns you see on yukata, like flowers or koi fish or whatnot. If that were a thing, I'd get like, ten", "created_utc": "1657666818.0", "edited": "False", "id": "ifx4u20", "is_submitter": "False", "link_id": "t3_vx94g3", "parent_id": "t3_vx94g3", "score": "3", "subreddit": "NonBinary", "subreddit_id": "t5_2vcez"}, {"author": "batbrainbat", "body": "Cuddle slut--", "created_utc": "1657510755.0", "edited": "False", "id": "ifoi11x", "is_submitter": "False", "link_id": "t3_vw45cn", "parent_id": "t3_vw45cn", "score": "1", "subreddit": "lgbt", "subreddit_id": "t5_2qhh7"}, {"author": "batbrainbat", "body": "I am the Clown King", "created_utc": "1656705779.0", "edited": "False", "id": "iehs688", "is_submitter": "False", "link_id": "t3_vp5rcq", "parent_id": "t3_vp5rcq", "score": "3", "subreddit": "egg_irl", "subreddit_id": "t5_3n3op"}, {"author": "batbrainbat", "body": "I have plastic dinosaurs that I play with in the bath. They're all different colours, too. Everybody's jealous of my fantastic dinosaurs. /hj", "created_utc": "1648489099.0", "edited": "False", "id": "i2go1sn", "is_submitter": "False", "link_id": "t3_tq9nt5", "parent_id": "t3_tq9nt5", "score": "1", "subreddit": "autism", "subreddit_id": "t5_2qhs6"}, {"author": "batbrainbat", "body": "I think this is very common when you first start trying to gain weight. For me, it went away after my body started to get used to having more food. I just took tums and would try to stretch out on my back, just let my body do its thing.", "created_utc": "1648488654.0", "edited": "False", "id": "i2gmypl", "is_submitter": "False", "link_id": "t3_tqbsb9", "parent_id": "t3_tqbsb9", "score": "1", "subreddit": "weightgain", "subreddit_id": "t5_2z0nf"}, {"author": "batbrainbat", "body": "This probably depends on the person, but I was actually super surprised about how similar it felt. Very similar, while simultaneously very different.\n\nFunny enough, I have a bit of prostate envy. SparklyMop, we could trade for a day 😆", "created_utc": "1648178244.0", "edited": "False", "id": "i20r5s3", "is_submitter": "False", "link_id": "t3_tmospu", "parent_id": "t1_i1zwu9d", "score": "8", "subreddit": "BDSMcommunity", "subreddit_id": "t5_2r9tk"}, {"author": "batbrainbat", "body": "I'm not sure what my favourite Japanese word would be, but for Malay, \"air buah\" makes me snicker now. I was clicking around Malaysia on Google Maps' street view and saw a tiny little restaurant that had pictures of their menu items to entice passersby. I saw a picture of colourful drinks next to pieces of fruit and got excited because I love smoothies and boba and other tasty drinks. So I googled what air buah is and... it's just juice. I got all hyped about juice. I don't even really like juice. Then later, I learned that \"air\" is water and \"buah\" is fruit. It's fruit water. I'm livid-\n\nEdit: Forgot to mention that my favourite ASL sign is \"[ANNOYED](https://www.handspeak.com/word/search/index.php?id=86)\" (the first version specifically).", "created_utc": "1648085288.0", "edited": "False", "id": "i1vjlv9", "is_submitter": "False", "link_id": "t3_tldp9o", "parent_id": "t3_tldp9o", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "batbrainbat", "body": "I'm sure much of the other advice on this thread is good, but I don't think you're really doing anything wrong. For you to gain any weight in only a week would be shocking, and probably not very healthy. One pound a week is more of a reasonable goal, and even that's pretty dang fast. Like with losing, gaining weight quickly is hard on your body and not healthy. I'm sure what you're doing now is fine, you just have to be patient", "created_utc": "1647895339.0", "edited": "False", "id": "i1kseew", "is_submitter": "False", "link_id": "t3_tj89ik", "parent_id": "t3_tj89ik", "score": "5", "subreddit": "weightgain", "subreddit_id": "t5_2z0nf"}, {"author": "batbrainbat", "body": "Idk if any of these will fit your particular taste, but here's my mini collection so far (I tend to find a few new things I like and just cycle through those for a month or two xD)...\n\nMy new favourite comfort song ever is Pada Angin by Monita Tahalea and Ananda Badudu,\n\nThen I've got Bunga Kayu from Iwan Fals (not my favourite, but I've liked a fair bit of his stuff so far),\n\nThen I also found some retro Malaysian songs I like, namely Aku Cinta Padamu by Siti Nurhaliza, Isabella by Search, Kekasih Awal Dan Akhir by Jamal Abdillah, Belaian Jiwa by Innuendo, and Untukmu by KRU.\n\nThat's my collection thus far, but I'm still digging little by little.", "created_utc": "1647888121.0", "edited": "False", "id": "i1kadnz", "is_submitter": "False", "link_id": "t3_ti6no0", "parent_id": "t1_i1dywpa", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "batbrainbat", "body": "I just started learning Malay! Through that, I've found a wealth of lovely Indonesian music, and there's almost no info about it or lyric translations in English, at least not for the stuff I found. People are seriously missing out.", "created_utc": "1647756017.0", "edited": "False", "id": "i1dh767", "is_submitter": "False", "link_id": "t3_ti6no0", "parent_id": "t1_i1ckbxj", "score": "9", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "batbrainbat", "body": "Gods, I feel that. It's especially hard to notice yourself, since you see yourself every day, and scales aren't super accurate. It took my fiancé pointing it out to actually realize the progress I'd made.", "created_utc": "1647364400.0", "edited": "False", "id": "i0rt401", "is_submitter": "False", "link_id": "t3_te5pk5", "parent_id": "t1_i0rccy8", "score": "1", "subreddit": "weightgain", "subreddit_id": "t5_2z0nf"}, {"author": "batbrainbat", "body": "I saw a big discussion about this [here](https://www.reddit.com/r/gainit/comments/t5vgee/oh_my_god_you_arent_getting_fat_a_discussion/?utm_source=share&utm_medium=web2x&context=3) (the biggest and most important point being that your body is just adjusting), on the other weight gain subreddit. And like the other commenter in this thread said, there's no way it's just fat and not muscle if you're working out that frequently. I'm sure you're doing just fine. Slow progress is natural, and healthier than progress that happens too fast. Best of luck ♡", "created_utc": "1647303120.0", "edited": "False", "id": "i0optsg", "is_submitter": "False", "link_id": "t3_te5pk5", "parent_id": "t3_te5pk5", "score": "2", "subreddit": "weightgain", "subreddit_id": "t5_2z0nf"}, {"author": "batbrainbat", "body": "Gobblefizz", "created_utc": "1647143922.0", "edited": "False", "id": "i0gbsn0", "is_submitter": "False", "link_id": "t3_tcwxoa", "parent_id": "t3_tcwxoa", "score": "1", "subreddit": "Rabbits", "subreddit_id": "t5_2riv8"}, {"author": "batbrainbat", "body": "Honestly, I just used the calorie calculator on [Calculator.net](https://Calculator.net) to find the bare minimum amount of calories I need per day to gain weight. Then I learned how many grams of protein I should be eating per day (though I don't really bother counting anymore because I naturally get enough protein with the foods I like anyway). I'm only aiming to get used to 1600 calories each day at the moment.\n\nI don't try to eat anything specific, and I don't really exercise yet, I'm just working on getting used to eating healthy amounts of food each day. It really sucked for a week or two. I felt bloated every evening, until my body started to go, \"Oh, huh, this food thing is kinda cool,\" and my appetite actually started to increase naturally. That's it x'D\n\nI have a lot of anxiety and stress that makes it difficult to eat, so that's all I've been working on really. I try to aim for higher calorie snacks to fit in between meals, even if it's just one cookie or a cup of whole milk, but a lot of the foods people talk about here like oats and peanut butter, I genuinely dislike, so I've just been experimenting this whole time :'D\n\nI guess the only thing I can suggest is to try to make it fun and get yourself hyped up about it? Like, I use a Notion calendar for my tracking, and when I reach my daily goal, I give the entry a lil' gold star and it looks cute and makes me happy, so I get hyped to get more cute stars... x'D\n\nAnd I hate lifting weights, it bores the heck out of me, so instead I'm going to learn how to pole dance and do aerial silks after I've gotten used to eating consistently. More fun that way!\n\nI hope that's kinda sorta helpful? That's all I'm doing right now, just gentle conditioning. I only just started a couple weeks ago. Good luck!\n\nTLDR: Absolute bare minimum daily calories to gain weight. Just get used to eating. Not even gunna worry about exercise yet. Make it fun and not boring and lame.", "created_utc": "1647051417.0", "edited": "False", "id": "i0bknrm", "is_submitter": "True", "link_id": "t3_tbxp8f", "parent_id": "t1_i0ayjpg", "score": "3", "subreddit": "weightgain", "subreddit_id": "t5_2z0nf"}, {"author": "batbrainbat", "body": "To add onto this, communication is not only important for just being on the same page for what each person wants and is into, but it's important for safety. I don't know what kind of stuff you're into, OP, but there are a number of kinks that aren't inherently safe that need to be talked about in detail, and aftercare needs have to be discussed as well. Like the person above me said, getting used to those new patterns of communication are imperative for both of you.\n\nBest of luck, and don't forget to have fun with it too! ♡", "created_utc": "1647025305.0", "edited": "False", "id": "i09xcug", "is_submitter": "False", "link_id": "t3_tbq6rr", "parent_id": "t1_i08m8j8", "score": "9", "subreddit": "BDSMcommunity", "subreddit_id": "t5_2r9tk"}, {"author": "batbrainbat", "body": "Yeah, like others have said, this is definitely not okay. Consent and communication is important, and Wattpad isn't exactly a reliable source of knowledge by any means.\n\nIt also strikes me as very odd that they do it around your friends, too. This is usually a very private thing, that is only shown around partners or very, very close people. What do your friends think about it? Are any of them uncomfortable as well? Especially if this came out of nowhere, nobody can just force others to take care of them, regardless of the circumstance. That's not right.", "created_utc": "1646790272.0", "edited": "False", "id": "hzx1lrk", "is_submitter": "False", "link_id": "t3_t9twzt", "parent_id": "t1_hzwus1y", "score": "27", "subreddit": "littlespace", "subreddit_id": "t5_2voav"}, {"author": "batbrainbat", "body": "Holy crap someone gets it. I'm not alone", "created_utc": "1646631770.0", "edited": "False", "id": "hzo6tna", "is_submitter": "False", "link_id": "t3_t83yti", "parent_id": "t1_hzlqqng", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "batbrainbat", "body": "Hearing people who \"don't need to\" learn Sign make the world more accessible for those who do need it every day.\n\nThere are also a lot of hearing people that rely on Sign for other reasons, like auditory processing disorder, or those with mental health struggles (heyo ✌️).\n\nPlus, Sign is just really heckin' cool and sometimes super convenient. Eating and don't want to talk with your mouth full? Just sign! My ASL teacher pointed that out in one of our first classes when a student was finishing breakfast before the lesson 😆  \nAnother example: I have a friend whos brother is deaf, and the whole family signs. When my friend had to have surgery, he was way too groggy to speak when he woke up, so he just signed that he needed water. I could go on and on.\n\nThere is no bad or socially unacceptable reason to learn Sign. ❤️", "created_utc": "1646062005.0", "edited": "False", "id": "hyscfql", "is_submitter": "False", "link_id": "t3_t36fie", "parent_id": "t3_t36fie", "score": "5", "subreddit": "asl", "subreddit_id": "t5_2qu95"}, {"author": "batbrainbat", "body": "I keep monthly habit trackers in my pretty journal. It doesn't get me to do stuff because \"my journal says I have to\", it gets me to do stuff because \"if I do the thing, I get to colour the boxes pretty colours\". 👉👈\n\nIf I start to struggle to stay on top of things again, that means I'm bored of the current design I'm using, so I'll change it up the next month so I get excited about making it look pretty again.", "created_utc": "1646017958.0", "edited": "False", "id": "hyqc7yv", "is_submitter": "False", "link_id": "t3_t300oy", "parent_id": "t3_t300oy", "score": "30", "subreddit": "ADHD", "subreddit_id": "t5_2qnwb"}, {"author": "batbrainbat", "body": "\"Pathetic\"?? I'd genuinely buy this and hang it in my bedroom. It's gorgeous 💖", "created_utc": "1645129773.0", "edited": "False", "id": "hxcsar7", "is_submitter": "False", "link_id": "t3_suqilv", "parent_id": "t3_suqilv", "score": "2", "subreddit": "autism", "subreddit_id": "t5_2qhs6"}, {"author": "batbrainbat", "body": "Big time this. I've been gesturing more deliberately, some signs sometimes sneak in, and I've also found myself leaning side to side more when listing or contrasting things. I also pay more attention to other people's gesturing.\n\nSlightly different, but still related, I also find myself signing chunks of random thoughts when I zone out. Must look real strange to onlookers 😆", "created_utc": "1645129356.0", "edited": "False", "id": "hxcr7zd", "is_submitter": "False", "link_id": "t3_suoaoo", "parent_id": "t3_suoaoo", "score": "3", "subreddit": "asl", "subreddit_id": "t5_2qu95"}, {"author": "batbrainbat", "body": "This this this! Difficulty speaking is one of the big reasons I'm learning ASL, and a large number of my fellow students in my ASL classes are learning it for this reason too. The immense relief I felt during and after my first class, just because I didn't have to say anything or hear any noise, was incredible.\n\nASL is intrinsically tied to the Deaf community, but there are all kinds of other people who need it too. Autistic folks, people with auditory processing disorder, people who are mute... Hell, sometimes it's just super convenient!\n\nAlso, the more people that know ASL regardless of their hearing status, the more accessible the world becomes for people who rely on it :)", "created_utc": "1644720003.0", "edited": "False", "id": "hwq8ko3", "is_submitter": "False", "link_id": "t3_sqwxec", "parent_id": "t1_hwofzro", "score": "5", "subreddit": "asl", "subreddit_id": "t5_2qu95"}, {"author": "batbrainbat", "body": "I'm taking a virtual ASL class! ✨\n\nI use simple signs or I type on my phone to my daddy when I'm nonverbal", "created_utc": "1644605180.0", "edited": "False", "id": "hwjf5hm", "is_submitter": "False", "link_id": "t3_sq22cp", "parent_id": "t3_sq22cp", "score": "2", "subreddit": "littlespace", "subreddit_id": "t5_2voav"}, {"author": "batbrainbat", "body": "You look so magical 💖🥺", "created_utc": "1644280481.0", "edited": "False", "id": "hw0ngt2", "is_submitter": "False", "link_id": "t3_smrvge", "parent_id": "t3_smrvge", "score": "2", "subreddit": "lgbt", "subreddit_id": "t5_2qhh7"}, {"author": "batbrainbat", "body": "Big congrats, epic progress!! I hope I can get there soon too!\n\n(Also I didn't see the decimal on the scale for a good second and was extremely confused- xD )", "created_utc": "1644279430.0", "edited": "False", "id": "hw0l1av", "is_submitter": "False", "link_id": "t3_sn3efy", "parent_id": "t3_sn3efy", "score": "7", "subreddit": "weightgain", "subreddit_id": "t5_2z0nf"}, {"author": "batbrainbat", "body": "Just to throw another option onto the pile of great resources in this thread: you could try checking [Meetup.com](https://Meetup.com) for virtual Sign meets. I don't know about DGS, but I know there are a wack ton of ASL sessions. I haven't attended any myself yet, but I've heard some decent things about them.\n\nAlso, if you use Discord, you could try finding a DGS, general sign language, general language learning, or deaf-centred server to seek out other people to practice with as well.\n\nBest of luck!", "created_utc": "1644251389.0", "edited": "False", "id": "hvyme1g", "is_submitter": "False", "link_id": "t3_sme6xk", "parent_id": "t3_sme6xk", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "batbrainbat", "body": "I'm in a suitcase, but someone's picked it up. I don't know where we're going. Send help.", "created_utc": "1644199945.0", "edited": "False", "id": "hvw410n", "is_submitter": "False", "link_id": "t3_sm1gcg", "parent_id": "t1_hvumtki", "score": "7", "subreddit": "lgbt", "subreddit_id": "t5_2qhh7"}, {"author": "batbrainbat", "body": "Names? 💖🥺", "created_utc": "1644033432.0", "edited": "False", "id": "hvnnqfs", "is_submitter": "False", "link_id": "t3_sktz64", "parent_id": "t3_sktz64", "score": "2", "subreddit": "littlespace", "subreddit_id": "t5_2voav"}, {"author": "batbrainbat", "body": "On [Meetup.com](https://Meetup.com) there are a huge number of virtual ASL meets! I haven't attended any myself yet, but I haven't heard any bad things about any of them.", "created_utc": "1644009595.0", "edited": "False", "id": "hvm56p5", "is_submitter": "False", "link_id": "t3_sirowf", "parent_id": "t3_sirowf", "score": "2", "subreddit": "asl", "subreddit_id": "t5_2qu95"}, {"author": "batbrainbat", "body": "This is a tricky subject. First of all, I would absolutely not ask them for their preferred pronouns (at least, not to use in report cards). Not all the students necessarily have safe homes, and if they innocently gave different pronouns than their families expect of them, both you and the child could get in a lot of trouble.\n\nTo avoid the dilemma, do you think you could avoid pronouns altogether? Instead, you could just use their names or simply say \"the student\". That way you'd be respecting the kids without putting them at risk.\n\nIf you really wanted to use they/them, however, you could always justify it (if anyone even notices to begin with) by saying you mass print the report card outline and that it saves you time going through each one. They/them pronouns have grammatically been used to refer to a person of an unknown gender for hundreds of years.", "created_utc": "1643769652.0", "edited": "False", "id": "hv824mk", "is_submitter": "False", "link_id": "t3_si74i5", "parent_id": "t3_si74i5", "score": "2", "subreddit": "Pronounsdressingroom", "subreddit_id": "t5_28jtuh"}, {"author": "batbrainbat", "body": "*Purrs softly.* Hmph... I don't like it, but... I don't hate it...", "created_utc": "1643768985.0", "edited": "False", "id": "hv80ifv", "is_submitter": "False", "link_id": "t3_si44i3", "parent_id": "t3_si44i3", "score": "3", "subreddit": "feminineboys", "subreddit_id": "t5_2vmuo"}, {"author": "batbrainbat", "body": "My daddy always knows when I'm about to have a meltdown and knows exactly how to help. He strokes the bridge of my nose, and makes me special scrambled eggs or steamed milk with honey. And, when I climb into his lap when he's in the middle of something, he only *sometimes* tickles me to get me off 🤭💗", "created_utc": "1642220404.0", "edited": "False", "id": "hsq3l9o", "is_submitter": "False", "link_id": "t3_s464cs", "parent_id": "t3_s464cs", "score": "2", "subreddit": "littlespace", "subreddit_id": "t5_2voav"}, {"author": "batbrainbat", "body": "Yes!! Love for our winged friends! 🤎💚", "created_utc": "1642046944.0", "edited": "False", "id": "hsg17l4", "is_submitter": "False", "link_id": "t3_s2h8sd", "parent_id": "t1_hsfun3m", "score": "2", "subreddit": "littlespace", "subreddit_id": "t5_2voav"}, {"author": "batbrainbat", "body": "My favourite dinosaur is Deinocheirus, and my favourite pterosaur is Quetzalcoatlus!! <3", "created_utc": "1642043565.0", "edited": "False", "id": "hsftzt4", "is_submitter": "False", "link_id": "t3_s2h8sd", "parent_id": "t3_s2h8sd", "score": "2", "subreddit": "littlespace", "subreddit_id": "t5_2voav"}, {"author": "batbrainbat", "body": "Sofiaaaa I love that name 🥺💖", "created_utc": "1641961780.0", "edited": "False", "id": "hsb466f", "is_submitter": "False", "link_id": "t3_s1rwbw", "parent_id": "t3_s1rwbw", "score": "3", "subreddit": "egg_irl", "subreddit_id": "t5_3n3op"}, {"author": "batbrainbat", "body": ">The AQ isn't a fantastic test IMO, mainly because of how vague and circular the questions are...\n\nYeah, it was kind of frustrating to answer. I did like the RAADS-R much better. I took the Aspie one after that, and my only complaint was the intense blue text on the white background xD\n\n&#x200B;\n\n>Before you talk to your doctor, it's recommended that you keep track of your scores on self-assessments, keep track of autistic behaviors and traits in yourself\n\nYeah, I've been meaning to start a list of things I've noticed... I have no idea how my doctor will react honestly. At least I don't think I'd be at all considered 'high functioning'. I'm not stable enough to go to college yet, or get a job, and a lot of different situations are crazy taxing for me. I just don't know how much of which condition contributes to which specific things, which is why I want to get tested so bad. I don't think I even just want to look more into autism, I want, like... the whole shabang, full psych evaluation, if I can get it. Fingers crossed!\n\nThank you so much for the resource, I'll give it a good watch when I've got a chance. If I think of any more questions, I'll shoot you a message right away <3", "created_utc": "1641864651.0", "edited": "False", "id": "hs59jnn", "is_submitter": "False", "link_id": "t3_rzuqei", "parent_id": "t1_hs0wl5y", "score": "2", "subreddit": "ADHD", "subreddit_id": "t5_2qnwb"}, {"author": "batbrainbat", "body": "Oh yeah, I already heavily suspect I'm on the spectrum. I'm waiting for some life things to settle down before I talk to my doctor about getting a psych referral. If I get diagnosed, it would explain a heck of a lot of my childhood. I'm super nervous, but I'm dying to know the truth.\n\nJust took the self assessments. On the AQ test, I got a 30. On the RAADS-R, I got above the threshold scores for all five categories, though lower than average. Sounds about right with my guess.", "created_utc": "1641784734.0", "edited": "False", "id": "hs0f21f", "is_submitter": "False", "link_id": "t3_rzuqei", "parent_id": "t1_hs066n8", "score": "1", "subreddit": "ADHD", "subreddit_id": "t5_2qnwb"}, {"author": "batbrainbat", "body": "Okay, you've gotten me super curious. xD  \nCould you DM me an example image?", "created_utc": "1641770369.0", "edited": "False", "id": "hrzejhg", "is_submitter": "False", "link_id": "t3_rzuqei", "parent_id": "t1_hrz6jd6", "score": "1", "subreddit": "ADHD", "subreddit_id": "t5_2qnwb"}, {"author": "batbrainbat", "body": "I feel this a lot, and with different mental conditions, too. It boils my blood when people say things like, \"Oh, I forgot my wallet. Haha, I'm so ADHD!\", or \"I clean the kitchen twice a day, haha, I'm so OCD!\", or \"Well, everyone's a little autistic.\"\n\n\\[tw: rant, self harm\\] >!Oh yeah? Does the concept of making a cup of coffee feel like it involves so many minute, complicated steps that it's easier to just stay in bed? Do you have to scratch your forehead raw in order to prevent your loved ones from dying? Does background noise grate on your consciousness until you completely shut down, becoming unresponsive and completely nonverbal at the most embarrassing times?!<\n\nI honestly still don't even fully know how to deal with people like that. I just kinda laugh awkwardly and move on. It's not my responsibility to educate people; I can't handle that, and I have to put my mental health first. At least things are slowly changing. At least from what I've observed, that fad is going away as society learns more and more overtime.", "created_utc": "1641765495.0", "edited": "False", "id": "hrz161i", "is_submitter": "False", "link_id": "t3_rzwr5s", "parent_id": "t3_rzwr5s", "score": "0", "subreddit": "ADHD", "subreddit_id": "t5_2qnwb"}, {"author": "batbrainbat", "body": "Right?? Aside from executive dysfunction, this is actually one of the major traits that finally convinced me to seek a proper diagnosis.", "created_utc": "1641764494.0", "edited": "False", "id": "hryycd0", "is_submitter": "False", "link_id": "t3_rzuqei", "parent_id": "t1_hryww92", "score": "5", "subreddit": "ADHD", "subreddit_id": "t5_2qnwb"}, {"author": "batbrainbat", "body": "Oh don't worry, I can definitely work with how my brain does things now. I'm actually super good at learning languages because of it. Grammar explanations bring me such joy. Thank you for the offer though!\n\nFlow charts actually kind of... displease me, I have to admit. I can't really put into words why. I just hate how they present information most of the time. It shows visually that things are connected, but still missing that 'how' between the bubbles.", "created_utc": "1641763926.0", "edited": "False", "id": "hrywpft", "is_submitter": "False", "link_id": "t3_rzuqei", "parent_id": "t1_hry03wm", "score": "2", "subreddit": "ADHD", "subreddit_id": "t5_2qnwb"}, {"author": "batbrainbat", "body": "THIS. It was exactly math where I got the most frustrated. I actually love math. It's so fun to me, like little puzzle games. But there were certain topics that I STILL don't have any grasp of whatsoever because my teacher straight up *refused* to explain. I could learn about them now, but I resent them too much to be bothered xD", "created_utc": "1641763629.0", "edited": "False", "id": "hryvvrt", "is_submitter": "False", "link_id": "t3_rzuqei", "parent_id": "t1_hryt5bf", "score": "50", "subreddit": "ADHD", "subreddit_id": "t5_2qnwb"}, {"author": "batbrainbat", "body": "Oh geez, I'm so sorry you had to deal with that. For me, I just had teachers refuse to explain certain things further because \"that comes next year\".", "created_utc": "1641763182.0", "edited": "False", "id": "hryuoao", "is_submitter": "False", "link_id": "t3_rzuqei", "parent_id": "t1_hry43ub", "score": "7", "subreddit": "ADHD", "subreddit_id": "t5_2qnwb"}, {"author": "batbrainbat", "body": "That I won't be able to learn something if the 'why' and the 'how' aren't explained to me. It just won't click. I feel like this is a perfectly logical way of brain-ing, but if I had a quarter for every time I've had to explain and re-explain this, I'd be effing rich. If I hear someone say, \"You just have to get the feel of it,\" or, \"You just have to memorize it,\" again, I'm going to barf on their shoes out of spite. /hj\n\n(...Okay, just to confirm because I'm paranoid, this *is* an ADHD trait, right? Or is this ASD? Or both? Ah, the endless struggle of trying to pick apart my own brain /lh)\n\nEdit: Holy heck this comment blew up. It's such a relief to see so many other people who think in similar ways. Y'all're awesome.", "created_utc": "1641751893.0", "edited": "1641764302.0", "id": "hrxylcc", "is_submitter": "False", "link_id": "t3_rzuqei", "parent_id": "t3_rzuqei", "score": "2429", "subreddit": "ADHD", "subreddit_id": "t5_2qnwb"}, {"author": "batbrainbat", "body": "Eee cuuute!! Could you do some Galactian Alignment flags? <3", "created_utc": "1641751284.0", "edited": "False", "id": "hrxwxa4", "is_submitter": "False", "link_id": "t3_rzucee", "parent_id": "t3_rzucee", "score": "2", "subreddit": "lgbt", "subreddit_id": "t5_2qhh7"}, {"author": "batbrainbat", "body": "For me personally, I never liked the colour system. I feel that colour words are too mundane. They don't stand out enough. My partner and I use silly safe words, so not only is it a slap out of the headspace, but it also makes us giggle a bit, immediately diffusing any possible upset-ness. Instead of \"yellow\", we use \"Bill Nye\", and instead of \"red\" we use \"Science Guy\". Several times, during aftercare cuddles, we've chanted \"*Bill! Bill! Bill! Bill!*\" in unison. There's no chance for words like this to get lost in any sexy talk, and I feel a lot less guilty about safewording this way.\n\nAlso, like another comment said, check-ins are super important. We use those a lot, even if the other person appears to be fine. It's always best to double check.\n\nSomeone else also mentioned nonverbal signals. My partner and I use a quick triple tap, or triple snap of the fingers. No matter what, this means, \"Get everything off me right now, this is serious\".", "created_utc": "1641749087.0", "edited": "False", "id": "hrxqz8v", "is_submitter": "False", "link_id": "t3_rzel0f", "parent_id": "t3_rzel0f", "score": "2", "subreddit": "BDSMcommunity", "subreddit_id": "t5_2r9tk"}, {"author": "batbrainbat", "body": "Thanks, now I'm going to be painfully aware of my eyes for the rest of the day. /lh", "created_utc": "1641748180.0", "edited": "False", "id": "hrxojpo", "is_submitter": "False", "link_id": "t3_rzbk4k", "parent_id": "t3_rzbk4k", "score": "1", "subreddit": "ADHD", "subreddit_id": "t5_2qnwb"}, {"author": "batbrainbat", "body": "Ooh yes, that feels real neat. Thank you thank you <3", "created_utc": "1640199161.0", "edited": "False", "id": "hpl79rj", "is_submitter": "True", "link_id": "t3_rjmkye", "parent_id": "t1_hpjx531", "score": "3", "subreddit": "Pronounsdressingroom", "subreddit_id": "t5_28jtuh"}, {"author": "batbrainbat", "body": "I don't like clubs either, too much noise makes me want to pluck my head off my shoulders. I would 100% go to this coffee shop every single weekend!\n\n(I'm so sorry to be that guy, but your diacritics are backwards :'D   \\*\"Gaé Café\")", "created_utc": "1640050300.0", "edited": "False", "id": "hpdawj3", "is_submitter": "False", "link_id": "t3_rkva2z", "parent_id": "t3_rkva2z", "score": "15", "subreddit": "lgbt", "subreddit_id": "t5_2qhh7"}, {"author": "batbrainbat", "body": "\"Ah, Moss! Hey, this is Moss, the friend I was telling you about, the awesome singer. It's also really good at guitar. Oh, have you written any more poems lately, Moss? Oh yeah, they're so artistic, it blows my mind.\" <3", "created_utc": "1639880314.0", "edited": "False", "id": "hp4ca8m", "is_submitter": "False", "link_id": "t3_rh59lw", "parent_id": "t3_rh59lw", "score": "1", "subreddit": "Pronounsdressingroom", "subreddit_id": "t5_28jtuh"}, {"author": "batbrainbat", "body": "\"I really liked Lucca's most recent drawing. He's been trying out this new technique, and it looks amazing. I should introduce you sometime, Lucca's real chill.\" <3", "created_utc": "1639880112.0", "edited": "False", "id": "hp4bvtc", "is_submitter": "False", "link_id": "t3_rhf6nv", "parent_id": "t3_rhf6nv", "score": "2", "subreddit": "Pronounsdressingroom", "subreddit_id": "t5_28jtuh"}, {"author": "batbrainbat", "body": "\"Holy crap, you should see Theo's new carving. He just finished it yesterday, and it freaking blew me away. I hope he posts a pic of it, his art is incredible.\" c:", "created_utc": "1639879978.0", "edited": "False", "id": "hp4bm10", "is_submitter": "False", "link_id": "t3_rij6u8", "parent_id": "t3_rij6u8", "score": "2", "subreddit": "Pronounsdressingroom", "subreddit_id": "t5_28jtuh"}, {"author": "batbrainbat", "body": "I use \"Yo... 🥺🥺🥺\" in this scenario", "created_utc": "1639611170.0", "edited": "False", "id": "hopllz4", "is_submitter": "False", "link_id": "t3_rh43dl", "parent_id": "t3_rh43dl", "score": "1", "subreddit": "NonBinary", "subreddit_id": "t5_2vcez"}, {"author": "batbrainbat", "body": "I primarily use he/they. I *very rarely* use she/her, and only with my fiance. I also want to try experimenting with fae/faer, because (to me) it feels feminine without having any connection to womanhood.", "created_utc": "1639528875.0", "edited": "False", "id": "hol017t", "is_submitter": "False", "link_id": "t3_rg2619", "parent_id": "t3_rg2619", "score": "1", "subreddit": "NonBinary", "subreddit_id": "t5_2vcez"}, {"author": "batbrainbat", "body": "\\*Gasp\\*! The cutest butt in the world! 💙", "created_utc": "1639506142.0", "edited": "False", "id": "hojh666", "is_submitter": "False", "link_id": "t3_rgahhs", "parent_id": "t3_rgahhs", "score": "1", "subreddit": "littlespace", "subreddit_id": "t5_2voav"}, {"author": "batbrainbat", "body": "Jillian is the first one that came to mind. To me that name sound both feminine and tough", "created_utc": "1639505696.0", "edited": "False", "id": "hojg1iy", "is_submitter": "False", "link_id": "t3_rgafth", "parent_id": "t3_rgafth", "score": "3", "subreddit": "NonBinary", "subreddit_id": "t5_2vcez"}, {"author": "batbrainbat", "body": "I'm stealing these too, these are lovely ♡", "created_utc": "1639442956.0", "edited": "False", "id": "hog80mc", "is_submitter": "False", "link_id": "t3_rftkhp", "parent_id": "t1_hog16hq", "score": "6", "subreddit": "BDSMcommunity", "subreddit_id": "t5_2r9tk"}, {"author": "batbrainbat", "body": "Check bigender, like the other comments say, and also check androgyne. Hope you find something you vibe with! ♡", "created_utc": "1639442118.0", "edited": "False", "id": "hog67rx", "is_submitter": "False", "link_id": "t3_rfti9u", "parent_id": "t3_rfti9u", "score": "1", "subreddit": "NonBinary", "subreddit_id": "t5_2vcez"}, {"author": "batbrainbat", "body": "Well, big love from me, and the rest of the femboy community. Hope you're taking care of yourself and that you feel a bit better soon, hun!", "created_utc": "1639441871.0", "edited": "False", "id": "hog5osq", "is_submitter": "False", "link_id": "t3_rfgm5c", "parent_id": "t1_hog2dl6", "score": "2", "subreddit": "feminineboys", "subreddit_id": "t5_2vmuo"}, {"author": "batbrainbat", "body": "This \\^   And there are also specific bras for bust reduction for people who just aren't comfortable with the size of their chest. I feel like the sports bra option would be more comfortable, but I just wanted to throw out another option, just in case", "created_utc": "1639437051.0", "edited": "False", "id": "hofvrzw", "is_submitter": "False", "link_id": "t3_rflipv", "parent_id": "t1_hoep8rf", "score": "2", "subreddit": "NonBinary", "subreddit_id": "t5_2vcez"}, {"author": "batbrainbat", "body": "I'm doing good! I managed to go out and be social on my own for the first time, well, ever! And for three days in a row, too! Big social hangover now, but I'm taking time to slowly get my spoons back ♡  \n\n\nHope you're doing well too! ♡", "created_utc": "1639436336.0", "edited": "False", "id": "hofu3az", "is_submitter": "False", "link_id": "t3_rfgm5c", "parent_id": "t3_rfgm5c", "score": "2", "subreddit": "feminineboys", "subreddit_id": "t5_2vmuo"}, {"author": "batbrainbat", "body": "It should, or it should be on the website. If it isn't, that'd be a potential fire hazard, and the company would get in big trouble. I'm not sure if they're all the same, but I think the general rule is to heat for 1 minute on 1000 watts, and to only surface-clean with a damp sponge. If the toy is ever ripped, I don't think you're supposed to microwave anymore, but I \\*think\\* it'd be fine if it were properly repaired...", "created_utc": "1639435570.0", "edited": "False", "id": "hofs9t9", "is_submitter": "False", "link_id": "t3_rfpi81", "parent_id": "t1_hofl4x7", "score": "4", "subreddit": "littlespace", "subreddit_id": "t5_2voav"}, {"author": "batbrainbat", "body": "I haven't heard any horror stories, so I'm sure if you follow the directions on the tag, it'll be okay <3", "created_utc": "1639432536.0", "edited": "False", "id": "hofl121", "is_submitter": "False", "link_id": "t3_rfpi81", "parent_id": "t1_hofejaa", "score": "2", "subreddit": "littlespace", "subreddit_id": "t5_2voav"}, {"author": "batbrainbat", "body": "I tend more towards bears. My fiancé is the total lumberjack type. I'm attracted to femboys, too, but it feels different. Less romantic attraction, more just physical.", "created_utc": "1639430617.0", "edited": "False", "id": "hofgd8y", "is_submitter": "False", "link_id": "t3_rfjxg5", "parent_id": "t3_rfjxg5", "score": "1", "subreddit": "feminineboys", "subreddit_id": "t5_2vmuo"}, {"author": "batbrainbat", "body": "I looove microwaveable stuffies! I have a penguin I just call Son. Son says hello to Skog and welcomes her to her new home <3", "created_utc": "1639429806.0", "edited": "False", "id": "hofedxk", "is_submitter": "False", "link_id": "t3_rfpi81", "parent_id": "t3_rfpi81", "score": "7", "subreddit": "littlespace", "subreddit_id": "t5_2voav"}, {"author": "batbrainbat", "body": "I never knew this was an ADHD trait. It's been so incredibly frustrating for me to explain to people, \"No, I won't remember or understand this at all unless you explain *why* it's like that.\" And they just... don't get that for some reason, even though that's extremely logical?? Especially in high school math class, this was infuriating, because teachers refused to explain *why* this particular formula makes this wiggly line on the graph. They said, \"Oh, you learn that next year. You're not there yet.\" Needless to say, I failed that unit...\n\nThis is super good to know, something to bring up with my therapist when I go to get tested.", "created_utc": "1639262163.0", "edited": "False", "id": "ho6bhso", "is_submitter": "False", "link_id": "t3_re40ka", "parent_id": "t1_ho52gfb", "score": "19", "subreddit": "ADHD", "subreddit_id": "t5_2qnwb"}, {"author": "batbrainbat", "body": "G̷̳͗ă̷͓ý̵̱͆̀", "created_utc": "1639260846.0", "edited": "False", "id": "ho68kxc", "is_submitter": "False", "link_id": "t3_rdu2ce", "parent_id": "t3_rdu2ce", "score": "1", "subreddit": "lgbt", "subreddit_id": "t5_2qhh7"}, {"author": "batbrainbat", "body": "Hell yeah this sounds fun. Whatever name I get, I'm going to use it as an online alias somewhere. Here we go...  \n\n\nI'm a language-learning nut, a femboy, and a hopeless romantic despite being a recluse. Go. OwO", "created_utc": "1638653689.0", "edited": "False", "id": "hn8rkyf", "is_submitter": "False", "link_id": "t3_r8pixe", "parent_id": "t3_r8pixe", "score": "1", "subreddit": "NonBinary", "subreddit_id": "t5_2vcez"}, {"author": "batbrainbat", "body": "The first song that comes to mind for my little space is UWU by Chevy <3\n\nAlso any cute and/or music box instrumental songs.", "created_utc": "1638577048.0", "edited": "False", "id": "hn4uxdm", "is_submitter": "False", "link_id": "t3_r8bin5", "parent_id": "t3_r8bin5", "score": "1", "subreddit": "littlespace", "subreddit_id": "t5_2voav"}, {"author": "batbrainbat", "body": "I found an online store called Homme Mystere that specializes in lingerie of all kinds specifically for people with flat chests and packages. The prices seem a little on the low side for underwear, but I've seen some good reviews, so I'd give 'em a shot. A lot of their stuff looks pretty cute in my opinion.\n\nIf that doesn't work, I might try AAA cup bras, rather than AA. There are a number of online stores that specialize in petite sizes, so it shouldn't be too tricky to find something affordable to try out.\n\nGood luck!", "created_utc": "1638576436.0", "edited": "False", "id": "hn4tn1o", "is_submitter": "False", "link_id": "t3_r89yvx", "parent_id": "t3_r89yvx", "score": "2", "subreddit": "NonBinary", "subreddit_id": "t5_2vcez"}, {"author": "batbrainbat", "body": "100%. I don't have anybody to play with ;w;  \nCould I bring my Calico Critters too? 👉👈", "created_utc": "1638574780.0", "edited": "False", "id": "hn4q3ry", "is_submitter": "False", "link_id": "t3_r7qseh", "parent_id": "t3_r7qseh", "score": "2", "subreddit": "littlespace", "subreddit_id": "t5_2voav"}, {"author": "batbrainbat", "body": "1000% cute. Hell yes.", "created_utc": "1638315701.0", "edited": "False", "id": "hmq8830", "is_submitter": "False", "link_id": "t3_r5yyvt", "parent_id": "t3_r5yyvt", "score": "1", "subreddit": "NonBinary", "subreddit_id": "t5_2vcez"}, {"author": "batbrainbat", "body": "Holy hell, that's a brilliant way to put it. I hope you don't mind if I save this comment to look back on.", "created_utc": "1638315546.0", "edited": "False", "id": "hmq7vft", "is_submitter": "False", "link_id": "t3_r5qimp", "parent_id": "t1_hmpmhii", "score": "4", "subreddit": "ADHD", "subreddit_id": "t5_2qnwb"}, {"author": "batbrainbat", "body": "I don't think it was intentional for them to seem lumped together. I honestly think that's just a poor coincidence, or something people are just reading a little too deeply into. I'm pretty sure the point is to just highlight these two groups of people as important and valued members of the community.\n\nAnd yeah, like you said, I think getting rid of the flag altogether is a little extreme, especially over a misunderstanding.", "created_utc": "1638315316.0", "edited": "False", "id": "hmq7cvm", "is_submitter": "False", "link_id": "t3_r5m5lf", "parent_id": "t1_hmpsvji", "score": "3", "subreddit": "lgbt", "subreddit_id": "t5_2qhh7"}, {"author": "batbrainbat", "body": "THIS. THIS THIS THIS.\n\nAND ALSO!! Gender nonconformity is okay!! No, it's *wonderful*!! Let cishet men wear dresses! Let women be spunky and masculine! Let people exist and express themselves and be happy!!", "created_utc": "1638298854.0", "edited": "False", "id": "hmp31xm", "is_submitter": "False", "link_id": "t3_r5n4ph", "parent_id": "t3_r5n4ph", "score": "9", "subreddit": "lgbt", "subreddit_id": "t5_2qhh7"}, {"author": "batbrainbat", "body": "Along with all the other great advice in this thread, I say just don't fret too much. If you're unsure of something, ask. Set boundaries, learn their preferences, just communicate. You're already taking an amazing step just by posting this question, so I really don't think you need to worry. Seriously, dude, you're an awesome human being for doing this research and wanting to learn. We love ya. Best of luck <3", "created_utc": "1638298338.0", "edited": "False", "id": "hmp1qip", "is_submitter": "False", "link_id": "t3_r5ezo5", "parent_id": "t3_r5ezo5", "score": "2", "subreddit": "NonBinary", "subreddit_id": "t5_2vcez"}, {"author": "batbrainbat", "body": "!!   I want pretty lights, too...!! So mystical! <3", "created_utc": "1638298012.0", "edited": "False", "id": "hmp0x7x", "is_submitter": "False", "link_id": "t3_r5s70c", "parent_id": "t3_r5s70c", "score": "3", "subreddit": "littlespace", "subreddit_id": "t5_2voav"}, {"author": "batbrainbat", "body": "Stunning. \\*Clap\\* Beautiful. \\*Clap\\* Handsome. \\*Clap\\* Perfect. \\*Clap\\*\n\n(Emoji glitched the heck out of Reddit :\\[ )", "created_utc": "1638296492.0", "edited": "False", "id": "hmox35h", "is_submitter": "False", "link_id": "t3_r5bbyj", "parent_id": "t3_r5bbyj", "score": "2", "subreddit": "NonBinary", "subreddit_id": "t5_2vcez"}, {"author": "batbrainbat", "body": "I don't have any particular advice, since this is something I'm still figuring out myself, but I feel so relieved to see someone else experiences this. That \"forced shutdown\" is the freaking worst. The only thing that kind of helps me when it happens is stimming.", "created_utc": "1638293647.0", "edited": "False", "id": "hmopu06", "is_submitter": "False", "link_id": "t3_r5c4lw", "parent_id": "t3_r5c4lw", "score": "2", "subreddit": "ADHD", "subreddit_id": "t5_2qnwb"}, {"author": "batbrainbat", "body": "Me neither, that's another thing. I didn't get the correlation there. \"There is a stripe on here to represent and honour folks with HIV, and this specific community has high HIV statistics, so obviously this is offensive\"??", "created_utc": "1638292613.0", "edited": "False", "id": "hmon6e0", "is_submitter": "False", "link_id": "t3_r5m5lf", "parent_id": "t1_hmod294", "score": "41", "subreddit": "lgbt", "subreddit_id": "t5_2qhh7"}, {"author": "batbrainbat", "body": "Like some other people are saying, I think a lot of it is on him. It's not so much \"unwillingness to change\", but sounds like \"unwillingness to make effort or come up with coping strategies\". In my relationship with my fiance, I'm the one with the heavy baggage and mental illness, and when it starts to make things difficult, we sit down and talk about new strategies for communication, make a plan going forward.\n\nSadly, we had some friends in a similar situation to you. One of them was feeling very neglected, while the one who happened to have ADHD was very stubborn and refused to put in any work. Needless to say, it didn't end well.\n\nThe cheating thing, by the way, has nothing to do with ADHD, like some other people have said. That's called \"being a douchebag\". With some of these, it almost sounds like he was using his condition as an excuse for things, which is being a shitty partner, and making the rest of the ADHD community look bad.", "created_utc": "1638292268.0", "edited": "False", "id": "hmomarf", "is_submitter": "False", "link_id": "t3_r5qimp", "parent_id": "t3_r5qimp", "score": "34", "subreddit": "ADHD", "subreddit_id": "t5_2qnwb"}, {"author": "batbrainbat", "body": "I actually feel the opposite. I swear like a sailor in my native English. I'm almost completely desensitized to it. However, swearing in Japanese feels really aggressive. Although, that's probably also because I've internalized their politeness culture at this point.", "created_utc": "1638291433.0", "edited": "False", "id": "hmok60b", "is_submitter": "False", "link_id": "t3_r57py2", "parent_id": "t3_r57py2", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "batbrainbat", "body": "**Frowns. Thrusts a pink teacup and a stuffie in your direction.**\n\nBig littles are still little. Being little is what you feel in your heart, not what you wear on the outside.", "created_utc": "1638288695.0", "edited": "False", "id": "hmod5ox", "is_submitter": "False", "link_id": "t3_r5cy5s", "parent_id": "t3_r5cy5s", "score": "3", "subreddit": "littlespace", "subreddit_id": "t5_2voav"}, {"author": "batbrainbat", "body": "Firstly, I'll believe it when I hear more than one POC make this exact complaint, from their own mouth or fingers, as this does not seem to be written from the perspective of one.\n\nSecond, I feel like with how this is written, it's stigmatizing people with HIV, which is... needless to say, the reason why that freaking stripe exists in the first place.", "created_utc": "1638288470.0", "edited": "False", "id": "hmoclqp", "is_submitter": "False", "link_id": "t3_r5m5lf", "parent_id": "t3_r5m5lf", "score": "115", "subreddit": "lgbt", "subreddit_id": "t5_2qhh7"}, {"author": "batbrainbat", "body": "Precisely arranged, mounted insects in simple, yet elegant frames.", "created_utc": "1638288038.0", "edited": "False", "id": "hmobj52", "is_submitter": "False", "link_id": "t3_r55y3r", "parent_id": "t3_r55y3r", "score": "1", "subreddit": "NonBinary", "subreddit_id": "t5_2vcez"}, {"author": "batbrainbat", "body": "I--  *Huhh?????*\n\nIf I were in your shoes, I'd buy a super long wig out of spite.", "created_utc": "1638287872.0", "edited": "False", "id": "hmob48i", "is_submitter": "False", "link_id": "t3_r5b80n", "parent_id": "t3_r5b80n", "score": "3", "subreddit": "NonBinary", "subreddit_id": "t5_2vcez"}, {"author": "batbrainbat", "body": "Holy shit I had this, but the opposite.\n\nMe, writing BL roleplay at 14: Haha rp fun  \nMe now, packing, binding, and engaged to a man: Haha rp fun", "created_utc": "1638227484.0", "edited": "False", "id": "hmlc952", "is_submitter": "False", "link_id": "t3_r4xywa", "parent_id": "t3_r4xywa", "score": "11", "subreddit": "egg_irl", "subreddit_id": "t5_3n3op"}, {"author": "batbrainbat", "body": "The very first name that came to mind was Tristan.", "created_utc": "1638227024.0", "edited": "False", "id": "hmlb6za", "is_submitter": "False", "link_id": "t3_r52ola", "parent_id": "t3_r52ola", "score": "1", "subreddit": "NonBinary", "subreddit_id": "t5_2vcez"}, {"author": "batbrainbat", "body": "**I** win.", "created_utc": "1638157849.0", "edited": "False", "id": "hmhncbx", "is_submitter": "False", "link_id": "t3_r4cz0k", "parent_id": "t3_r4cz0k", "score": "1", "subreddit": "egg_irl", "subreddit_id": "t5_3n3op"}, {"author": "batbrainbat", "body": "**\\[Dial-up internet noises\\]**", "created_utc": "1638157080.0", "edited": "False", "id": "hmhlpgm", "is_submitter": "False", "link_id": "t3_r3whwz", "parent_id": "t3_r3whwz", "score": "1", "subreddit": "NonBinary", "subreddit_id": "t5_2vcez"}]