[{"author": "bawab33", "body": "In addition to this, people often forget that a lot of people...like genre fiction. I prefer sci-fi and fantasy to any other genre of media, and I'm learning my target language purely to watch TV in the language.  That type of vocab is exactly what I need.", "created_utc": "1666481854.0", "edited": "False", "id": "ite791b", "is_submitter": "False", "link_id": "t3_yanlj6", "parent_id": "t1_ite5p7l", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "bawab33", "body": "The auto generated subtitles are in the language spoken. Sometimes the creator may separately subtitle English if their target audience speaks English. For that, you could look on English tik tok for bilingual people, as they'll subtitle in English when they speak another language.  \n\nBut you would want to count on seeing target language subtitles if you're looking at something made for native speakers.", "created_utc": "1666473444.0", "edited": "False", "id": "itdor51", "is_submitter": "False", "link_id": "t3_yaozi5", "parent_id": "t1_itcltw0", "score": "7", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "bawab33", "body": "For Korean, anything with the 를 particle attached. My brain just won't send the right signals to my tongue at first.", "created_utc": "1664376352.0", "edited": "False", "id": "iq8oz5d", "is_submitter": "False", "link_id": "t3_xpz7kz", "parent_id": "t3_xpz7kz", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "bawab33", "body": "감사합니다! I'll be adding 간헐적이다 to my vocab list :)", "created_utc": "1661140637.0", "edited": "False", "id": "ila3ppi", "is_submitter": "True", "link_id": "t3_wtnhgs", "parent_id": "t1_il9tqci", "score": "2", "subreddit": "WriteStreakKorean", "subreddit_id": "t5_3ij1p6"}, {"author": "bawab33", "body": "감사합니다! 그리고 파티는 재미있었어요!", "created_utc": "1661122908.0", "edited": "False", "id": "il93rxw", "is_submitter": "True", "link_id": "t3_wsshz3", "parent_id": "t1_il5wa16", "score": "2", "subreddit": "WriteStreakKorean", "subreddit_id": "t5_3ij1p6"}, {"author": "bawab33", "body": "감사합니다!!", "created_utc": "1660911072.0", "edited": "False", "id": "ikx9uuh", "is_submitter": "True", "link_id": "t3_wrypb2", "parent_id": "t1_ikx7zcm", "score": "1", "subreddit": "WriteStreakKorean", "subreddit_id": "t5_3ij1p6"}, {"author": "bawab33", "body": "감사합니다! I really appreciate you reviewing this.", "created_utc": "1660865222.0", "edited": "False", "id": "ikv3qp3", "is_submitter": "True", "link_id": "t3_wqu122", "parent_id": "t1_ikr6fl2", "score": "2", "subreddit": "WriteStreakKorean", "subreddit_id": "t5_3ij1p6"}, {"author": "bawab33", "body": "그렇군요. 감사합니다!", "created_utc": "1660736971.0", "edited": "False", "id": "ikn7ujj", "is_submitter": "True", "link_id": "t3_wq94b8", "parent_id": "t1_ikm3psz", "score": "2", "subreddit": "WriteStreakKorean", "subreddit_id": "t5_3ij1p6"}, {"author": "bawab33", "body": "감사합니다!!", "created_utc": "1660736664.0", "edited": "False", "id": "ikn7b86", "is_submitter": "True", "link_id": "t3_wpe1vi", "parent_id": "t1_ikn1mko", "score": "2", "subreddit": "WriteStreakKorean", "subreddit_id": "t5_3ij1p6"}, {"author": "bawab33", "body": "Hi! I was trying to say \"Today I interviewed two people with my coworkers. But I like the person we interviewed last week.\"\n\nIt sounds like I should switch 인터뷰 for 면접.", "created_utc": "1660652478.0", "edited": "False", "id": "ikido69", "is_submitter": "True", "link_id": "t3_wpe1vi", "parent_id": "t1_ikhhga9", "score": "1", "subreddit": "WriteStreakKorean", "subreddit_id": "t5_3ij1p6"}, {"author": "bawab33", "body": "It's a typo, which you knew. 4 is worse than 3. Or mabey you didnt and jumped on it because you're floundering here. You're still refusing to grab those concrete numbers hmm. Don't want those concrete numbers in there. Go ahead, do the math, put in the numbers in your next comment, and we will go over them together. You won't, and we both know why.", "created_utc": "1658763147.0", "edited": "False", "id": "ihl7kck", "is_submitter": "False", "link_id": "t3_w5k13g", "parent_id": "t1_ihl582k", "score": "1", "subreddit": "AmItheAsshole", "subreddit_id": "t5_2xhvq"}, {"author": "bawab33", "body": "Oh I get it. Your goal is to say why is 2 better than 3, and then 3 better than 4 and then 5 better than 6, until you think you've made an argument that 7 is fine. But once you pull out the calculator and do the math, you will have a very concrete number for why 3 is worse than 4. That number is the concrete answer.", "created_utc": "1658761823.0", "edited": "False", "id": "ihl48um", "is_submitter": "False", "link_id": "t3_w5k13g", "parent_id": "t1_ihl1ebc", "score": "1", "subreddit": "AmItheAsshole", "subreddit_id": "t5_2xhvq"}, {"author": "bawab33", "body": "You have the same calculator app on your phone as I do. If you can't do the math to figure out why 3 cans a day is way different than 2 (edit: in a year) I can't help you. And let's be real here. You lost the argument when you folded like a lawn chair on arguing 7 cans a day is reasonable and had to start arguing about the difference between 2 or 3. The way more reasonable amount. \n\nWhy is an 1.5 hour shower different than a  20 minute one? According to you the obvious difference of the amount isn't a difference at all.", "created_utc": "1658756201.0", "edited": "1658756776.0", "id": "ihkr080", "is_submitter": "False", "link_id": "t3_w5k13g", "parent_id": "t1_ihkhtje", "score": "0", "subreddit": "AmItheAsshole", "subreddit_id": "t5_2xhvq"}, {"author": "bawab33", "body": "Because I'm the arbitor and I say so.", "created_utc": "1658714819.0", "edited": "False", "id": "ihiy8c3", "is_submitter": "False", "link_id": "t3_w5k13g", "parent_id": "t1_ihirjly", "score": "0", "subreddit": "AmItheAsshole", "subreddit_id": "t5_2xhvq"}, {"author": "bawab33", "body": "I don't know if you know, but 3 is bigger than 2. Just saying.", "created_utc": "1658708360.0", "edited": "False", "id": "ihikl9j", "is_submitter": "False", "link_id": "t3_w5k13g", "parent_id": "t1_ihgx9oi", "score": "0", "subreddit": "AmItheAsshole", "subreddit_id": "t5_2xhvq"}, {"author": "bawab33", "body": "Thank you for asking. It's two. As the grand arbitor of common sense, let me know if I can help with anything else you can't figure out on your own.", "created_utc": "1658679678.0", "edited": "False", "id": "ihgprm5", "is_submitter": "False", "link_id": "t3_w5k13g", "parent_id": "t1_ihdwjwr", "score": "1", "subreddit": "AmItheAsshole", "subreddit_id": "t5_2xhvq"}, {"author": "bawab33", "body": "I do drink tapwater. This is a stupid argument. Any amount is wastful so limitless wast is ok! It's illogical", "created_utc": "1658612074.0", "edited": "False", "id": "ihddlen", "is_submitter": "False", "link_id": "t3_w5k13g", "parent_id": "t1_ihd98ck", "score": "1", "subreddit": "AmItheAsshole", "subreddit_id": "t5_2xhvq"}, {"author": "bawab33", "body": "So imagine her 7. Thanks for doing the math to prove how ridiculously excessive she's being.", "created_utc": "1658603790.0", "edited": "False", "id": "ihcuqi6", "is_submitter": "False", "link_id": "t3_w5k13g", "parent_id": "t1_ihc17hr", "score": "1", "subreddit": "AmItheAsshole", "subreddit_id": "t5_2xhvq"}, {"author": "bawab33", "body": "I got Irish. I'm definitely taking the money.", "created_utc": "1658416582.0", "edited": "False", "id": "ih26dnd", "is_submitter": "False", "link_id": "t3_w4fzz4", "parent_id": "t3_w4fzz4", "score": "0", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "bawab33", "body": "Those are great grades. Good luck with your other languages.", "created_utc": "1658234546.0", "edited": "False", "id": "igrrh7i", "is_submitter": "False", "link_id": "t3_w1vluo", "parent_id": "t1_igqad5m", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "bawab33", "body": "Stay pressed.", "created_utc": "1658193515.0", "edited": "False", "id": "igpx1jw", "is_submitter": "False", "link_id": "t3_w1vluo", "parent_id": "t1_igpwwv3", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "bawab33", "body": "Whatever helps you cope.", "created_utc": "1658193028.0", "edited": "False", "id": "igpvzc5", "is_submitter": "False", "link_id": "t3_w1vluo", "parent_id": "t1_igpveip", "score": "0", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "bawab33", "body": "OK. Cry about it. I'd also be sad if I talked a bunch of smack about learning on my own only to find out it looks like it.", "created_utc": "1658192725.0", "edited": "False", "id": "igpvb64", "is_submitter": "False", "link_id": "t3_w1vluo", "parent_id": "t1_igpu9gc", "score": "0", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "bawab33", "body": "'At least' is two words. I've made my point. English classes help people that pay attention.", "created_utc": "1658192115.0", "edited": "False", "id": "igpty7y", "is_submitter": "False", "link_id": "t3_w1vluo", "parent_id": "t1_igpt5xf", "score": "0", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "bawab33", "body": "And please stop with all the weird commas. Can you? Do you even know what you're doing wrong. I'll let you have that grammar book first. My goodness.", "created_utc": "1658191994.0", "edited": "False", "id": "igptoj9", "is_submitter": "False", "link_id": "t3_w1vluo", "parent_id": "t1_igps2b5", "score": "0", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "bawab33", "body": "A typo leaving off the 'r' isn't a severe mistake. At all. Do you think it is because English isn't your first language? Did your immersion fail to help you understand what's normal? Maybe you need more of it. \n\nPointing put your own comma mistakes doesn't lessen their impact. \n\nEdit for hitting send to soon.\n\nThis isn't 8 Mile, you don't win by pointing out your mistakes first. Do better instead. Putting a bunch of smiley faces doesn't make it less obvious I've hurt your feelings by pointing out your bad English when you can only point out a typo. I can learn Korean because my English is obviously great. Do you think you're going to convince me it's not? Or even convince me you don't think it is? Besides, your English is so bad there's nothing you could ever say to make me feel any sort of way about mine. You're not a good enough judge. You're struggling to type coherent replies.", "created_utc": "1658191578.0", "edited": "1658191893.0", "id": "igpsr1z", "is_submitter": "False", "link_id": "t3_w1vluo", "parent_id": "t1_igps2b5", "score": "0", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "bawab33", "body": "It's cracking me up how you're pretending they don't count. That's very convenient for you. And frankly, I'd have to re-write every comment of yours to fix the mess that is your punctuation usage. It's really bad. But I'm sure that doesn't count either.\n\nPlease, post the report cards. At this point, with your grammar and punctuation,  they're proof you're right. You weren't paying attention, but you should have been. You'd be better at English. You might want to go back to being an active learner. All that immersion learning didn't quite get you where you need to be.", "created_utc": "1658190494.0", "edited": "False", "id": "igpqae8", "is_submitter": "False", "link_id": "t3_w1vluo", "parent_id": "t1_igpofpr", "score": "0", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "bawab33", "body": "Go back and fix how your post wasn't giving of* a certain type of energy. No apostrophe is needed for A's* as there is no possessive. It's simply plural. And I don't know what \"I could understand hear speakers\" means at all in your first comment. Being an English learner doesn't only mean active learning. It also applies to people who have learned in the past. And your comma usage is a mess. \n\nI take it back. I now fully believe you weren't paying attention.", "created_utc": "1658189186.0", "edited": "False", "id": "igpncue", "is_submitter": "False", "link_id": "t3_w1vluo", "parent_id": "t1_igplttb", "score": "0", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "bawab33", "body": "I have not misused \"your\". There is no typo. You can copy-paste if you've find one. But then I'll have to post all of your mistakes. And I can't fathom a world where I care if you take me seriously. \n\nAnd I'm going to believe people learned literally nothing in class when I believe pigs fly. I don't know why English learners are so deparate with this myth. You're truly the only ones and it's weird.", "created_utc": "1658187801.0", "edited": "False", "id": "igpkae2", "is_submitter": "False", "link_id": "t3_w1vluo", "parent_id": "t1_igphu6k", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "bawab33", "body": "My writing skills are fantastic. Certainly better than produced in you comment. And don't try to hit and hide your hands. You got the same energy back you gave with your comment.\n\nAnd my whole point is that English is learned easily because the grammar is easy, hence crappy classes being helpful if all they teach is a few vocab words.", "created_utc": "1658186628.0", "edited": "False", "id": "igphnma", "is_submitter": "False", "link_id": "t3_w1vluo", "parent_id": "t1_igpflo1", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "bawab33", "body": "You say you know English, but your reading comprehension is poor. The point is that the classes had some effect. You're straight up lying that you just didn't pay attention. Otherwise, post those F grades for everyone to see. You did not sit for years in class staring out of the window getting Fs.", "created_utc": "1658185582.0", "edited": "False", "id": "igpfajp", "is_submitter": "False", "link_id": "t3_w1vluo", "parent_id": "t1_igoy1u8", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "bawab33", "body": "I dont know what's made you think I think infinitive forms need to be conjugated when my whole point is the lack of real conjugation in English. I absolutely know you don't need conjugation for the infinitive obviously. My point, is that no conjugation is needed from the infinitive to the present tense. Nothing happens to the actual verb itself. If you learn the word look, you have the present tense, future, and imperative tense. We put words around the verb, but basic English relies on a barely there \"infinitive\". You can harp on the word 'to' being there, but it's as much nothing as adding 'will' to get the future tense. It exists but so what? Learning the vocab word still gave you so much. There's nothing else to memorize. Unlike say Spanish or German. \n\nAnd you're making my point for me, that there are valuable things to learn in class, and that people probably didn't learn from just immersion. Thanks for agreeing??  But even if someone had terrible English schooling, the low bar to grammar helps a ton even if a large part of their learning came from immersion. \n\nAnd for the purpose of listening to a TV show, the different written versions of two and your don't matter. Hence the low bar of entry vocab has.\n\nEdit: a word", "created_utc": "1658167600.0", "edited": "1658174847.0", "id": "igo6kll", "is_submitter": "False", "link_id": "t3_w1vluo", "parent_id": "t1_ignwujb", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "bawab33", "body": "I have a whole other idea about that, but I'm not going to argue here. At 11 you were more than capable of being introspective about your true English level. But a lot of people started much formal learning younger.  And as a person currently watching a cartoon meant for younger (5,6) children to learn Korean, I could watch on mute and understand everything in every episode.  It was designed (music cues, body language, non-verbal sounds like wordless yelling or sobbing) to be understood with fewer words.\n\nThere are a lot of people who think they were fluent younger because they learned a handful of words,  and the cartoon made it easy to understand regardless of language ability.", "created_utc": "1658159623.0", "edited": "False", "id": "ignmcsy", "is_submitter": "False", "link_id": "t3_w1vluo", "parent_id": "t1_igncqf2", "score": "6", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "bawab33", "body": "I agree completely with this comment actually, because I do think the English immersion a lot of people get is really helpful. But learning all the vocab and basic grammar so, so young helps people stick with it/get more out of it if English content interests them.", "created_utc": "1658159299.0", "edited": "False", "id": "ignljf4", "is_submitter": "False", "link_id": "t3_w1vluo", "parent_id": "t1_igmtuqi", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "bawab33", "body": "There is no conjugation required. It's as much of a infinitive form as we have a future tense. Technically it exists, but for my argument, it doesn't matter. We don't generally teach any sort of infinitive form when we teach vocabulary. I didn't learn about an infinitive for English until I started taking Spanish in middle school. If I learned it before, it was brief enough to be easily forgotten.", "created_utc": "1658155840.0", "edited": "False", "id": "ignd0qe", "is_submitter": "False", "link_id": "t3_w1vluo", "parent_id": "t1_ign20i2", "score": "-1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "bawab33", "body": "I'm a native English speaker so obviously I can't know what it's Iike to learn it.\n\nNo one is arguing a ton of immersion didn't help you learn the language. We're arguing that saying schooling didn't also help a lot is nonsense. I would argue that English is a language that can benefit the most from how schools teach languages with all of the flaws. Why? Introductory grammar doesn't have much going on, and colloquial English found in media breaks all the harder rules anyway, so being bad at them doesn't matter.\n\nPeople point out a lot that English has no real future tense (just add 'will' in front of a word). But the bigger boost never mentioned is we also have no infinitive form. So that class that just taught a bunch of vocab to memorize? It gave you present tense, future tense, and the imperative forms of every single verb just by giving you a word to memorize. -ing will make every verb present progressive, or change it into a noun. Even with irregular past tense verbs, -ed does the trick most of the time. And you got spoon fed the most common irregular conjugations in class.\n\nEnglish as a 2nd language benefits greatly from being so highly analytical. It's tougher to learn to read and write due to spelling (not grammar), but vocab goes a long way to watch and listen. There is no grammatical gender to memorize, and you don't conjugate nouns or adjectives.\n\nIf class also taught that it's SVO and how to use articles, then you got a massive boost every year to your immersion just be being able to recognize more and more common words.", "created_utc": "1658146197.0", "edited": "False", "id": "igmstzt", "is_submitter": "False", "link_id": "t3_w1vluo", "parent_id": "t3_w1vluo", "score": "23", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "bawab33", "body": "A TikTok pop up recently asked me all the languages I speak \"to bring me more relevant content\", so maybe that can change.", "created_utc": "1657412214.0", "edited": "False", "id": "ifjczrw", "is_submitter": "False", "link_id": "t3_vuzid6", "parent_id": "t1_ifhihya", "score": "5", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "bawab33", "body": "Closer to an English scone", "created_utc": "1655425367.0", "edited": "False", "id": "icnd91s", "is_submitter": "False", "link_id": "t3_vdphma", "parent_id": "t1_icncl6m", "score": "5", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "bawab33", "body": "What on Earth would your royals visiting have to do with how the populace feels? Just ask the British royals how that worked out in the Caribbean recently.", "created_utc": "1655145846.0", "edited": "False", "id": "ic8gegj", "is_submitter": "False", "link_id": "t3_vb2335", "parent_id": "t1_ic73nhw", "score": "0", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "bawab33", "body": "I think so too. There were a few where it was basically process of elimination or a prefix/suffix that made the most sense.\n\nedit: spelling", "created_utc": "1651974196.0", "edited": "1651989197.0", "id": "i7qx0vd", "is_submitter": "False", "link_id": "t3_ukhlni", "parent_id": "t1_i7qsi4q", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "bawab33", "body": "[I think I got a good score.](https://imgur.com/a/4VXYrj7)", "created_utc": "1651953241.0", "edited": "False", "id": "i7pq37r", "is_submitter": "False", "link_id": "t3_ukhlni", "parent_id": "t3_ukhlni", "score": "4", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "bawab33", "body": "I have no idea why you were down voted. This comment is completely reasonable.", "created_utc": "1650379820.0", "edited": "False", "id": "i5cl3wn", "is_submitter": "False", "link_id": "t3_u6t4qx", "parent_id": "t1_i5bdki7", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "bawab33", "body": "So it's more standard to put the \"superior\" object first. Thank you!", "created_utc": "1650222982.0", "edited": "False", "id": "i547hgm", "is_submitter": "True", "link_id": "t3_u5d227", "parent_id": "t1_i53eobm", "score": "1", "subreddit": "Korean", "subreddit_id": "t5_2rd8q"}, {"author": "bawab33", "body": "Also, realized I forgot to say thank you!", "created_utc": "1650203299.0", "edited": "False", "id": "i52xjxo", "is_submitter": "True", "link_id": "t3_u5d227", "parent_id": "t1_i519bv9", "score": "1", "subreddit": "Korean", "subreddit_id": "t5_2rd8q"}, {"author": "bawab33", "body": "So it's more of a best practice kind of thing, but neither is wrong? That's kind of what I was getting form the lesson.", "created_utc": "1650164219.0", "edited": "1650203344.0", "id": "i51cvez", "is_submitter": "True", "link_id": "t3_u5d227", "parent_id": "t1_i519bv9", "score": "1", "subreddit": "Korean", "subreddit_id": "t5_2rd8q"}, {"author": "bawab33", "body": "We're not talking about the legal system. We're talking about an incident at Disney. The burden doesn't need to be on victim's so people don't have to be uncomfy.", "created_utc": "1650061356.0", "edited": "False", "id": "i4vyhpz", "is_submitter": "False", "link_id": "t3_u4cmxc", "parent_id": "t1_i4vnllv", "score": "8", "subreddit": "pettyrevenge", "subreddit_id": "t5_2vg7t"}, {"author": "bawab33", "body": "I like that they are about different topics. I don't think I could do two hours of grammar a day.", "created_utc": "1649873849.0", "edited": "False", "id": "i4lhwfr", "is_submitter": "False", "link_id": "t3_u2qqvp", "parent_id": "t1_i4lh8wc", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "bawab33", "body": "No, but I thought that too when I first heard of it. It basically teaches Spanish in Spanish using comprehensible input. It starts off from superbeginner through advanced and has hundreds of videos. The videos aren't grammar lessons specifically. They are about everyday topics at different levels of Spanish. \n\nI'm not currently learning Spanish, but if I ever tried that language again, I'm going to use it just for a change in methods.", "created_utc": "1649871469.0", "edited": "False", "id": "i4lbmoq", "is_submitter": "False", "link_id": "t3_u2qqvp", "parent_id": "t1_i4kqk7h", "score": "13", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "bawab33", "body": "This was beautiful and very accurate. I truly don't get the obsession with learning as fast as possible.", "created_utc": "1649084710.0", "edited": "False", "id": "i3cz6aw", "is_submitter": "False", "link_id": "t3_tw0scm", "parent_id": "t3_tw0scm", "score": "25", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "bawab33", "body": "It says survival English so I feel like it would be A1", "created_utc": "1647729714.0", "edited": "False", "id": "i1c4jtx", "is_submitter": "False", "link_id": "t3_ti147i", "parent_id": "t1_i1bpiu3", "score": "20", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "bawab33", "body": "I've seen this opinion quite a bit, and I often wonder if people are remembering that they spent almost two decades in school in their native language learning it. You didn't likely just \"do\" your native language.\n\nedit: a word", "created_utc": "1647625880.0", "edited": "False", "id": "i16ilue", "is_submitter": "False", "link_id": "t3_tgpmkk", "parent_id": "t3_tgpmkk", "score": "6", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "bawab33", "body": "My dad was a pill popping alcoholic with metal health issues who died when I was 14 due to an addition to cigarettes. And I can still understand that there is more than one dictionary definition of a word. Being in a language learning community I'd expect you to know the same. Cleave can mean split apart and cling together. Fanatic can mean strong interest or obsessive zeal. And addition can mean a substance abuse issue or obsession. It just how words work very often.", "created_utc": "1647572343.0", "edited": "False", "id": "i13vbyd", "is_submitter": "False", "link_id": "t3_tfchky", "parent_id": "t1_i13tolc", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "bawab33", "body": "You life experiences aren't the center of the world. Using the word addiction in this manner is nothing at all like using a slur and it's offensive for you to say it is. Get over yourself before commenting again.", "created_utc": "1647553118.0", "edited": "False", "id": "i12ny9c", "is_submitter": "False", "link_id": "t3_tfchky", "parent_id": "t1_i10kcrz", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "bawab33", "body": "I'm not the OP. The point of my reply was people have different goals...", "created_utc": "1647107255.0", "edited": "False", "id": "i0e5wbk", "is_submitter": "False", "link_id": "t3_tc5qua", "parent_id": "t1_i0dxdxj", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "bawab33", "body": "That may be your goal, but plenty of people just want to understand input. I have no output goals whatsoever.", "created_utc": "1647095082.0", "edited": "False", "id": "i0dd72s", "is_submitter": "False", "link_id": "t3_tc5qua", "parent_id": "t1_i0cg538", "score": "5", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "bawab33", "body": "Tore my meniscus at 31 and it hurts to jog across the street. I feel cheated out of the last dregs of my youth.", "created_utc": "1643676013.0", "edited": "False", "id": "hv2hnr4", "is_submitter": "False", "link_id": "t3_sh32t0", "parent_id": "t1_hv03j8x", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "bawab33", "body": "I can't figure out the plan. Are they thinking people are going to remain pliant to this stuff, or is the plan to ride the new Jim crow til the wheels fall off?", "created_utc": "1643399637.0", "edited": "False", "id": "humj6do", "is_submitter": "False", "link_id": "t3_sexv07", "parent_id": "t3_sexv07", "score": "15", "subreddit": "politics", "subreddit_id": "t5_2cneq"}, {"author": "bawab33", "body": "But that's my point. That's what the class is there for.. I guess I don't see how that's any different than taking a few one hour italki lessons a week which are also going to do none of those things during the lesson. No one thinks those italki sessions are useless/inadequate to be a part of learning a language.They just expect to do all of their immersion separately. \n\nA college classroom is like those italki sessions. They're there for instruction, correction and feedback, and some structured lessons, and starter vocabulary. You were always supposed to walk away and do more to get fluent and never think of them as the place for immersion.", "created_utc": "1642622352.0", "edited": "False", "id": "htd0b0h", "is_submitter": "False", "link_id": "t3_s6tqky", "parent_id": "t1_htcxzhi", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "bawab33", "body": "The don't use the wrong format, there is no format that going to work without more effort for the student. Having taken a language in college, the only thing missing was time, and that was on me. I got grammar, vocabulary, listening, speaking, and writing practice. But o was busy with other things, so I out in the minimal time. That's not the fault of their format.", "created_utc": "1642620638.0", "edited": "False", "id": "htcvocm", "is_submitter": "False", "link_id": "t3_s6tqky", "parent_id": "t1_htcqgqr", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "bawab33", "body": "A college class has a limit of the amount of time they can require you to be there. Those hours correspond to the number of credits the course is worth. And that corresponds to the price of the class. The fact that a person can learn a language in 4 months studying 5 hours a day and or moving to the country doesn't prove at all that a college class is doing anything wrong. \n\nIt doesn't work because people aren't doing anything outside of class beyond the homework they were specifically assigned. Not because enough information isn't covered.", "created_utc": "1642611451.0", "edited": "False", "id": "htc6t0t", "is_submitter": "False", "link_id": "t3_s6tqky", "parent_id": "t1_htbbrj5", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "bawab33", "body": "That doesn't mean students know how or which resources are best for that language.", "created_utc": "1642559257.0", "edited": "False", "id": "ht9ju3p", "is_submitter": "False", "link_id": "t3_s6tqky", "parent_id": "t1_ht9fu68", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "bawab33", "body": "True, maybe they can just put some resources in the syllabus.", "created_utc": "1642551491.0", "edited": "False", "id": "ht91yy3", "is_submitter": "False", "link_id": "t3_s6tqky", "parent_id": "t1_ht7ncmm", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "bawab33", "body": "And a semester is only 4 months. I think this is a fine amount. It's really that people don't put in time outside of class. I would only lay that on schools in that some professors don't teach/cover what it will take outside class hours to be fluent.", "created_utc": "1642530357.0", "edited": "False", "id": "ht7idiy", "is_submitter": "False", "link_id": "t3_s6tqky", "parent_id": "t1_ht7e3bh", "score": "44", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "bawab33", "body": "Hmm. I suppose that's mostly true. But then there are mute people, neurodivergent people, and others who can understand just fine but don't output for whatever reason. Would we really say they aren't fluent in the language they understand? And if we say they are an exception. Why? Either output is necessary to be fluent or it isn't.", "created_utc": "1642022866.0", "edited": "False", "id": "hsehnqp", "is_submitter": "False", "link_id": "t3_s1smh2", "parent_id": "t1_hscncs9", "score": "4", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "bawab33", "body": "It sounds like you didn't understand as you couldn't hear, so I'm not sure the suggestions that you take a lower class would be helpful at all as the same issue will arise. \n\nI recommend talking to the instructor about captions in zoom if that's a thing. That way you can double check what you heard wne anyone has a low microphone. Alerting the professor may also make it so they are sure to speak up at least when they speak so you can at least hear the lesson.", "created_utc": "1641919465.0", "edited": "False", "id": "hs85atq", "is_submitter": "False", "link_id": "t3_s12cah", "parent_id": "t3_s12cah", "score": "3", "subreddit": "Korean", "subreddit_id": "t5_2rd8q"}, {"author": "bawab33", "body": "English, Korean, Japanese, Spanish", "created_utc": "1641318176.0", "edited": "False", "id": "hr8lex0", "is_submitter": "False", "link_id": "t3_rv5dlm", "parent_id": "t3_rv5dlm", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "bawab33", "body": "I'm from the southeast as well, and I've only ever heard glovebox. It's always interesting how Language can be so different even in the same region.\n\nEdit: spelling", "created_utc": "1640322713.0", "edited": "1640323754.0", "id": "hprx8fb", "is_submitter": "False", "link_id": "t3_rmz8tt", "parent_id": "t1_hpr32qu", "score": "5", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "bawab33", "body": "None of those things are my problem. It's their house, they can park as many broken cars in the driveway as that want. nmp", "created_utc": "1629462770.0", "edited": "False", "id": "h9nkdc7", "is_submitter": "False", "link_id": "t3_p7vud9", "parent_id": "t1_h9ngo15", "score": "7", "subreddit": "MaliciousCompliance", "subreddit_id": "t5_3boqz"}, {"author": "bawab33", "body": "While we're focused on being accurate, muscle does not weigh more than fat. A pound is a pound.", "created_utc": "1627080274.0", "edited": "False", "id": "h6axy0f", "is_submitter": "False", "link_id": "t3_oq13qt", "parent_id": "t3_oq13qt", "score": "1", "subreddit": "loseit", "subreddit_id": "t5_2rz8w"}, {"author": "bawab33", "body": "Are you seriously trying to argue you can't see the progress in those two pictures. There's a 200 pound difference. You can tell.", "created_utc": "1624133331.0", "edited": "False", "id": "h2cv043", "is_submitter": "False", "link_id": "t3_o375wz", "parent_id": "t1_h2cr8bk", "score": "12", "subreddit": "progresspics", "subreddit_id": "t5_2sl0y"}, {"author": "bawab33", "body": "I don't want you to argue ice is cold. I don't care if you argue anything.  You shared and opinion and I shared mine. If you want a debate you have to start it.\n\nFat acceptance doesn't fly in the face of a damn thing. It doesn't argue at all that fat can come with health issues.\n\n1. It argues that most people citing health issues like you don't give a single shit about anyone's health. But it's become societally unacceptable to say eww fat at fat bodies, and pretending to care at all about some strangers health is now the only way to go eww you're fat and get away with it. And fat acceptance isn't interested in giving that loophole to minding one's business and not commenting on bodies not yours.\n\n2.  Fat acceptance argues that people's health is between them in their doctor. You can't look at someone and tell the exact level of their health. Even if a person is unhealthy because of their size, it doesn't mean there so unhealthy they're about to drop dead any single second. The same way no two people with asthma are in the same place health wise. Unless you've been to medical school, nothing about a person's size tells you anything specific.\n\n3.  Fat acceptance says people have a right to feel perfectly fine in their bodies right now they don't have to be sitting around feeling miserable all the time or constantly on a diet. They don't at every moment need to be working to get down to a size that we can pretend means they're healthy even if we have no idea if it makes them healthy or if they got down to that size in a healthy way. \n\n4.  Fat acceptance says whatever you feel about your own health there are definite societal issues about how people treat fat bodies.  There are people who are not diagnosed with disease because bias in medicine means doctors won't even run tests, and will just declare them fat. It's people being discriminated against for jobs where fitness and weight don't matter. \n\n5.  Notice how none of the above things have anything to do with people not working with their medical professional on their overall health. Or arguing in any way against people doing what they feel they need to to get into a more healthy body. It's mostly concerned with people minding their business.\n\nAs I said, weight loss and fat acceptance are not mutually exclusive. And saying they are is an entire logical fallacy. So yes we are done here.", "created_utc": "1619978131.0", "edited": "False", "id": "gwouvsw", "is_submitter": "False", "link_id": "t3_n271b3", "parent_id": "t1_gwonlyz", "score": "1", "subreddit": "loseit", "subreddit_id": "t5_2rz8w"}, {"author": "bawab33", "body": "I will never understand people rewriting history when you can literally scroll up and see the truth. Tell me exactly how calling people obnoxiously stupid is just a statement. I didn't make any more rude of a statement you did. You just can't take what you dish out. I also can't make a rebuttal to something not there. You made no arguments with no points to rebut. You called people stupid and I disagreed.\n\nAnd you are asking me to make an argument to support my point when you haven't. You simply made an affirmative statement and I kept the same energy. If you think a debate, begin by supporting your point.", "created_utc": "1619971510.0", "edited": "False", "id": "gwocuvr", "is_submitter": "False", "link_id": "t3_n271b3", "parent_id": "t1_gwnx8bm", "score": "1", "subreddit": "loseit", "subreddit_id": "t5_2rz8w"}, {"author": "bawab33", "body": "You've literally said nothing yourself. Point to one substantive comment you've made on this thread I'll wait. I've given exactly as much exposition on my point as you have on yours. You made a declarative statement on your Point of view and so have I. Deal.", "created_utc": "1619963219.0", "edited": "False", "id": "gwntjwz", "is_submitter": "False", "link_id": "t3_n271b3", "parent_id": "t1_gwmdvm0", "score": "1", "subreddit": "loseit", "subreddit_id": "t5_2rz8w"}, {"author": "bawab33", "body": "The two aren't mutually exclusive. That may be too complicated a thought for you to process. Don't hurt yourself.", "created_utc": "1619919854.0", "edited": "False", "id": "gwm1obm", "is_submitter": "False", "link_id": "t3_n271b3", "parent_id": "t1_gwlzolo", "score": "1", "subreddit": "loseit", "subreddit_id": "t5_2rz8w"}, {"author": "bawab33", "body": "Found the community idiot lol", "created_utc": "1619916434.0", "edited": "False", "id": "gwlvkya", "is_submitter": "False", "link_id": "t3_n271b3", "parent_id": "t1_gwlq6h3", "score": "-1", "subreddit": "loseit", "subreddit_id": "t5_2rz8w"}, {"author": "bawab33", "body": "Of course not.", "created_utc": "1619915964.0", "edited": "False", "id": "gwluqsd", "is_submitter": "False", "link_id": "t3_n271b3", "parent_id": "t1_gwlqg2i", "score": "0", "subreddit": "loseit", "subreddit_id": "t5_2rz8w"}, {"author": "bawab33", "body": "What a dumb take", "created_utc": "1619912957.0", "edited": "False", "id": "gwlp9ki", "is_submitter": "False", "link_id": "t3_n271b3", "parent_id": "t1_gwhsd71", "score": "-2", "subreddit": "loseit", "subreddit_id": "t5_2rz8w"}, {"author": "bawab33", "body": "But that weight has no calories. If you drank water for a month but ate no food, you would die because  humans need calories to live and water has none. The noodles will weigh more but that will not effect the amount of calories in the dish. Have you ever seen calories listed on the back of a water bottle? No. At this point I'm absolutely sure you're just messing with people. Good troll I guess.", "created_utc": "1619660801.0", "edited": "False", "id": "gw8we4b", "is_submitter": "False", "link_id": "t3_n0b99w", "parent_id": "t1_gw82gjk", "score": "0", "subreddit": "CICO", "subreddit_id": "t5_3c3pm"}, {"author": "bawab33", "body": "The calories dry are the same as calories cooked. The only potential difference is in any seasoning packet it comes with.", "created_utc": "1619645558.0", "edited": "False", "id": "gw80e8q", "is_submitter": "False", "link_id": "t3_n0b99w", "parent_id": "t1_gw5mifs", "score": "0", "subreddit": "CICO", "subreddit_id": "t5_3c3pm"}, {"author": "bawab33", "body": "Letting the chicken marinate in nonfat plain yogurt will tenderize it as well.", "created_utc": "1619561907.0", "edited": "False", "id": "gw3s1aw", "is_submitter": "False", "link_id": "t3_mzo5g1", "parent_id": "t1_gw2fnhv", "score": "2", "subreddit": "loseit", "subreddit_id": "t5_2rz8w"}, {"author": "bawab33", "body": "Someone else may have said it, but is also because a lot of people will consider belts, switches ,and paddles to be spankings and they don't consider spankings abuse. To a lot of people he had a violent response to normal parent discipline. Yes I see the irony in calling his behavior violent and not theirs.", "created_utc": "1619182315.0", "edited": "False", "id": "gvk76ow", "is_submitter": "False", "link_id": "t3_mwjaxq", "parent_id": "t1_gviwveg", "score": "1", "subreddit": "politics", "subreddit_id": "t5_2cneq"}, {"author": "bawab33", "body": "That may be true but the 'at is user's. 'Where are my clothes' is a complete sentence", "created_utc": "1617402703.0", "edited": "False", "id": "gt6rw1d", "is_submitter": "False", "link_id": "t3_miksv5", "parent_id": "t1_gt5q5x1", "score": "6", "subreddit": "pettyrevenge", "subreddit_id": "t5_2vg7t"}, {"author": "bawab33", "body": "You look fantastic!", "created_utc": "1616278740.0", "edited": "False", "id": "grmyxdn", "is_submitter": "False", "link_id": "t3_m8z9of", "parent_id": "t3_m8z9of", "score": "1", "subreddit": "progresspics", "subreddit_id": "t5_2sl0y"}, {"author": "bawab33", "body": "How many of the cars you tinkered with ran off computers like today? How much did the tools cost? Did you ever fix anything that needed you to out the car on a lift? How much did the parts you tinkered with cost? Where was your space to work on it? Did you live in an apartment or HOA that had rules against working on the cars or having non-working cars around? What was your transportation like when the car was  roken down and you hadn't had tome to fix it yet?", "created_utc": "1615683489.0", "edited": "False", "id": "gqur67n", "is_submitter": "False", "link_id": "t3_m4a6yk", "parent_id": "t1_gqumq1z", "score": "7", "subreddit": "politics", "subreddit_id": "t5_2cneq"}, {"author": "bawab33", "body": "I had no idea whether you were dead serious or not. Guess that's why language matters.", "created_utc": "1615041142.0", "edited": "False", "id": "gpygv2w", "is_submitter": "False", "link_id": "t3_lyl4jc", "parent_id": "t1_gpvkvpd", "score": "3", "subreddit": "CICO", "subreddit_id": "t5_3c3pm"}, {"author": "bawab33", "body": "Muscle doesn't weigh more than fat. A pound is a pound. It's just more densely packed and takes up less space.", "created_utc": "1614985223.0", "edited": "False", "id": "gptt0d3", "is_submitter": "False", "link_id": "t3_lyl4jc", "parent_id": "t1_gptdti8", "score": "3", "subreddit": "CICO", "subreddit_id": "t5_3c3pm"}, {"author": "bawab33", "body": "I think they might mean work from home would allow them to apply for jobs out of state.", "created_utc": "1614829893.0", "edited": "False", "id": "gpm6qww", "is_submitter": "False", "link_id": "t3_lwuwj9", "parent_id": "t1_gpl8e1j", "score": "1", "subreddit": "politics", "subreddit_id": "t5_2cneq"}, {"author": "bawab33", "body": "But OP has a job.", "created_utc": "1614021540.0", "edited": "False", "id": "godffdo", "is_submitter": "False", "link_id": "t3_lp5zpb", "parent_id": "t1_gobkjq7", "score": "6", "subreddit": "AmItheAsshole", "subreddit_id": "t5_2xhvq"}, {"author": "bawab33", "body": "You can hire part time as long as you're paying a living wage at part time. Two 20 hour a week jobs at $15 works out to the same as on 40 hour a week. The issue then would be healthcare.", "created_utc": "1613420716.0", "edited": "False", "id": "gnkj37n", "is_submitter": "False", "link_id": "t3_lkfs4o", "parent_id": "t1_gnkd09o", "score": "10", "subreddit": "politics", "subreddit_id": "t5_2cneq"}, {"author": "bawab33", "body": "Excuse you but St. Petersburg is totally normal. Or at least more normal than north Florida.", "created_utc": "1611366323.0", "edited": "False", "id": "gk9xdr7", "is_submitter": "False", "link_id": "t3_l2obb2", "parent_id": "t1_gk6ydet", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "bawab33", "body": "The strawman is the all or nothing. She can move on men with kids or who like weed brownies just like her,  but stick to not wanting to date an alcoholic or someone who can't even pay his own bills.\n\n&#x200B;\n\nedited for typos", "created_utc": "1611257158.0", "edited": "False", "id": "gk3d8v4", "is_submitter": "False", "link_id": "t3_l1flpj", "parent_id": "t1_gk39pka", "score": "3", "subreddit": "AmItheAsshole", "subreddit_id": "t5_2xhvq"}, {"author": "bawab33", "body": "I listened to the entire hour long call and whew! Trump is crazy, desperate, and completely lacking morals. He repeatedly just straight up asked for enough votes to won. Literally asked to win by one vote. And nothing will come of this. He gets away with everything. We better not ever go into another country and criticize how they run elections. Ever.\n\nEdited a typo", "created_utc": "1609733825.0", "edited": "1609813731.0", "id": "gi19ooc", "is_submitter": "False", "link_id": "t3_kptxmn", "parent_id": "t3_kptxmn", "score": "1", "subreddit": "politics", "subreddit_id": "t5_2cneq"}, {"author": "bawab33", "body": "Personal computers weren't most places until about 1996 so that's not really relevant. In the year 2020, a person should be able to understand such a basic tool of the white collar working world to be in a position like president. Even if he isn't personally stopping a cyber attack. Not understanding them at even a basic level would be why someone wouldn't find it important to have the right cyber security staffing in place.", "created_utc": "1608308731.0", "edited": "False", "id": "gg9iaax", "is_submitter": "False", "link_id": "t3_kfkcpc", "parent_id": "t1_gg97soj", "score": "5", "subreddit": "politics", "subreddit_id": "t5_2cneq"}, {"author": "bawab33", "body": "Stop shamelessly moving the goal posts. No one said anything about accomplishments not counting. The question was whether you are self-made. The definition of which is did it yourself. If you had substantial help, you didn't do it yourself. A person who got handed $1 mil, got a giant head start. A hell of a bigger start that someone who started with nothing. Pretending that a person who started with $0 and a person $1 mil have accomplished the same thing is nonsense.", "created_utc": "1607722064.0", "edited": "False", "id": "gfg29i0", "is_submitter": "False", "link_id": "t3_kashae", "parent_id": "t1_gffzmwn", "score": "3", "subreddit": "financialindependence", "subreddit_id": "t5_2t34z"}, {"author": "bawab33", "body": "His college didn't cost 1mil. And that education is what let him make a million dollars. It's more like getting handed 1mil to start a business and later saying you're a self-made billionaire.", "created_utc": "1607720280.0", "edited": "False", "id": "gffxsco", "is_submitter": "False", "link_id": "t3_kashae", "parent_id": "t1_gffuhi5", "score": "4", "subreddit": "financialindependence", "subreddit_id": "t5_2t34z"}, {"author": "bawab33", "body": "You literally just said you got handed 10k. People have really loose definitions of self made.", "created_utc": "1607704525.0", "edited": "False", "id": "gfelmc5", "is_submitter": "False", "link_id": "t3_kashae", "parent_id": "t1_gfdoy1b", "score": "12", "subreddit": "financialindependence", "subreddit_id": "t5_2t34z"}, {"author": "bawab33", "body": "This got long. Sorry.\n\nA lot of people think this about sport teams and in some cases it's true, but it's pretty exaggerated. At any college where sports are big enough to draw students, they operate largely by a separate budget. They aren't using booster money for academics (because they can't), the reverse is true as well for a large portion of the athletics budget. When you see a large budget expenditure for a facility, no one's mentioning how much donated from outside specifically for sports. Also, the reason championships (not having any old team) increases rankings is because it increases applications to the school. Schools don't care about a sports related bump in rank, they already got the applicants. \n\nFor administrators, there's a lot of reasons for the increase beyond bloat. One, some have salaries (and sometime entire department budgets) paid by grants like Title V.  Two, a lot are due to staff taking over duties that faculty (often) didn't do well. Either because they didn't have time, had too large a population, or just had no interest. Three, many are due to newly instituted rules to meet state mandate for funding.\n\nAnd honestly...everyone needs to acknowledge that students aren't just attracted by amenities, but that they actively demand them, and they have to be paid for. And many articles mention amenities instead of services for sensationalism. The student angry about health fees because they don't use the gym would be ticked to lose the free student health center doctor's appointments; not realizing that it's all the same fee. And I bet the physicians cost more than the replacement schedule for the tread mills.", "created_utc": "1607636219.0", "edited": "False", "id": "gfbqopk", "is_submitter": "False", "link_id": "t3_k96kun", "parent_id": "t1_gf4uuha", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "bawab33", "body": "Like Stev\\_k says below. The best source is looking at the public records of massive cuts. But [this article](https://www.insidehighered.com/news/2017/07/24/new-study-attempts-show-how-much-state-funding-cuts-push-tuition#:~:text=State%20Funding%20Cuts%20Matter,and%20the%20rate%20is%20rising) from Inside Higher Ed that presents some arguments from both sides while presenting a research study connecting budget cuts to student tuition raises dollar for dollar.\n\nI think government should stay so students have access to lower interests rates, but they need to invest in higher education. They also need to tie minimum wages to inflation so students can work to pay as they go like in the past.", "created_utc": "1607472897.0", "edited": "False", "id": "gf4317w", "is_submitter": "False", "link_id": "t3_k96kun", "parent_id": "t1_gf3ux3v", "score": "2", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "bawab33", "body": "It's not this simple. First, governments stopped subsidzing college and offered loans instead.  It was to be more \"fiscally responsible\". But the loans didn't equal what colleges had been getting.Without the money from the government, colleges raised tuition to meet costs. And everytime governments cut education budgets more, colleges raise tuition higher.", "created_utc": "1607467269.0", "edited": "False", "id": "gf3qab8", "is_submitter": "False", "link_id": "t3_k96kun", "parent_id": "t1_gf376az", "score": "29", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "bawab33", "body": "I would say her options were whatever she resorted to when her oldest cut contact. The truth of the matter is she figured it out when forced. She just wasn't willing to figure it out to give an actual child a break.\n\nedited a word", "created_utc": "1605554746.0", "edited": "False", "id": "gcixeu2", "is_submitter": "False", "link_id": "t3_jundye", "parent_id": "t1_gch93k8", "score": "-4", "subreddit": "AmItheAsshole", "subreddit_id": "t5_2xhvq"}, {"author": "bawab33", "body": "Oh they aren't blind. They want to shift as much blame as possible to the left to help with 2022 midterms and the 2024 presidential race. The GOP does not care at all about people's lives.", "created_utc": "1605470353.0", "edited": "False", "id": "gcf48lx", "is_submitter": "False", "link_id": "t3_jurzbm", "parent_id": "t1_gcf2rdy", "score": "4", "subreddit": "politics", "subreddit_id": "t5_2cneq"}, {"author": "bawab33", "body": "So Trump plans to privatize the vaccine distribution? I honestly don't know why I expected anything else. He's been pretty open about wanting poor and POC people to die.", "created_utc": "1605470195.0", "edited": "False", "id": "gcf3x8z", "is_submitter": "False", "link_id": "t3_jus31d", "parent_id": "t3_jus31d", "score": "9", "subreddit": "politics", "subreddit_id": "t5_2cneq"}, {"author": "bawab33", "body": "Maybe it's the placebo. Drinking coffee in the morning makes me feel energized, but it's never stopped me from sleeping. Human bodies make no sense.", "created_utc": "1605244419.0", "edited": "False", "id": "gc4k6cq", "is_submitter": "False", "link_id": "t3_jt9y0t", "parent_id": "t1_gc4dlku", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "bawab33", "body": "Coffee before bed. I sleep just fine.", "created_utc": "1605239570.0", "edited": "False", "id": "gc4cr81", "is_submitter": "False", "link_id": "t3_jt9y0t", "parent_id": "t3_jt9y0t", "score": "3", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "bawab33", "body": "I kind of love that Biden's reaction to Trump's attempts at a coup is to just ignore it.", "created_utc": "1605013782.0", "edited": "False", "id": "gbtnxne", "is_submitter": "False", "link_id": "t3_jrkj7u", "parent_id": "t3_jrkj7u", "score": "105", "subreddit": "politics", "subreddit_id": "t5_2cneq"}, {"author": "bawab33", "body": "If Florida had open primaries there would be two republicans to choose from. It sounds good in theory, but the reality is we go overwhelmingly red on a state level (not necessarily local in every place, but state) even when we go blue in the presidential race. You would never see a democrat governor again. I don't know what about this state makes people think this would be helpful. We are not sane enough to have nice things.", "created_utc": "1604522323.0", "edited": "False", "id": "gb5kkyx", "is_submitter": "False", "link_id": "t3_jnzdjt", "parent_id": "t1_gb4px9m", "score": "1", "subreddit": "politics", "subreddit_id": "t5_2cneq"}, {"author": "bawab33", "body": "That's completely true. But counterpoint, isn't that why you do things when you can instead of waiting.  If wife is sick enough that she's dying (like it sounds) I bet she's super grateful to have those memories and to not have missed out on visiting those places.", "created_utc": "1600345776.0", "edited": "False", "id": "g5ktqqy", "is_submitter": "False", "link_id": "t3_itvzti", "parent_id": "t1_g5ibvs3", "score": "4", "subreddit": "AmItheAsshole", "subreddit_id": "t5_2xhvq"}, {"author": "bawab33", "body": "Except you never heard anyone say black trash. Ever. I bet you really thought you were making a point too.", "created_utc": "1598497858.0", "edited": "False", "id": "g2zghur", "is_submitter": "False", "link_id": "t3_ifbruw", "parent_id": "t1_g2oe9i4", "score": "1", "subreddit": "politics", "subreddit_id": "t5_2cneq"}, {"author": "bawab33", "body": "It's actually not. It's classist toward white people but not racist. The use of the signifier white means that when you just say trash you're talking about POC. You have to specify \"white\" trash to clarify they are acting like \"those people\" even though they are white. It's based on the racist stereotypes that POC are inherently trash, but white people should be/act better than that.", "created_utc": "1598240212.0", "edited": "False", "id": "g2nnuic", "is_submitter": "False", "link_id": "t3_ifbruw", "parent_id": "t1_g2nhzgu", "score": "-2", "subreddit": "politics", "subreddit_id": "t5_2cneq"}, {"author": "bawab33", "body": "The worst one are the comments saying you were already fired so why do you care? Like really? Because black lives matter whether she's on tv or not.", "created_utc": "1596555654.0", "edited": "False", "id": "g0c4x9b", "is_submitter": "False", "link_id": "t3_i39prl", "parent_id": "t3_i39prl", "score": "36", "subreddit": "vanderpumprules", "subreddit_id": "t5_302zw"}, {"author": "bawab33", "body": "Why you gotta respond all reasonably and make me feel like an asshole (for being an asshole). I apologize. If OP was asking because he wasn't sure where he was checking, he would have needed clarification.", "created_utc": "1595457673.0", "edited": "False", "id": "fyx75v4", "is_submitter": "False", "link_id": "t3_hvko0d", "parent_id": "t1_fyx5fu5", "score": "-2", "subreddit": "AmItheAsshole", "subreddit_id": "t5_2xhvq"}, {"author": "bawab33", "body": "You're right. He didn't say point. I was just able to use the context clues of her asking his if he could see it when he sure as hell isn't going to be able to see inside the actual vagina. But I'm not going play stupid with you that she could have possible meant her vagina which neither of them can eyeball.", "created_utc": "1595456341.0", "edited": "False", "id": "fyx4tzb", "is_submitter": "False", "link_id": "t3_hvko0d", "parent_id": "t1_fyx3cum", "score": "-4", "subreddit": "AmItheAsshole", "subreddit_id": "t5_2xhvq"}, {"author": "bawab33", "body": "He wasn't making sure. She's laying there spread legs pointing to it. He could have made sure by...looking at where she was pointing. He just wanted to correct her terminology. He wasn't confused or he would have said in the OP he was seeking clarification.", "created_utc": "1595455385.0", "edited": "False", "id": "fyx364t", "is_submitter": "False", "link_id": "t3_hvko0d", "parent_id": "t1_fyva924", "score": "-1", "subreddit": "AmItheAsshole", "subreddit_id": "t5_2xhvq"}, {"author": "bawab33", "body": "But it is irrelevant to the conversation. Whatever she called it, her question was about the bump she was pointing to. Knowing the name of it solved nothing. Most women know the difference between vagina and vulva and still refer to it collectively as their vagina in basic conversation. As far is he knew, he was making a stupid semantics argument when she was asking about a health concern. The only reason he found out she was uninformed is because he decided to be an asshole in the first place.", "created_utc": "1595455212.0", "edited": "False", "id": "fyx2uwd", "is_submitter": "False", "link_id": "t3_hvko0d", "parent_id": "t1_fyvmbes", "score": "-3", "subreddit": "AmItheAsshole", "subreddit_id": "t5_2xhvq"}, {"author": "bawab33", "body": "Faith has said that Kristen has apologized, but she feels it's after pressure. She didn't say Stassi has apologized. I feel like both of them should have sent a personal apology first. Apologizing publicly first is about stopping consequences and not really being sorry.", "created_utc": "1591920935.0", "edited": "False", "id": "ftr5762", "is_submitter": "False", "link_id": "t3_h11d4x", "parent_id": "t1_ftqyqq0", "score": "1", "subreddit": "vanderpumprules", "subreddit_id": "t5_302zw"}, {"author": "bawab33", "body": "Wow I didn't think they'd do it. Glad they had the balls.", "created_utc": "1591745693.0", "edited": "False", "id": "ftj3zw4", "is_submitter": "False", "link_id": "t3_gzryau", "parent_id": "t3_gzryau", "score": "5", "subreddit": "vanderpumprules", "subreddit_id": "t5_302zw"}, {"author": "bawab33", "body": "You have a hard time with liner thought. And you're dense, let me break it down for you.\n\nYou: Kristen is lying about abuse because she's done bad things. People who've done bad things aren't victims so don't believe her. She should be off the show.\n\nMe: She can still be a victim even though she's racist and should suffer consequences for that racism. And proof that James is capable of abusing her is the actual abuse we saw from him on the show. What we saw of his behavior on the show is why I believe her. They should both be fired. They are awful.\n\nYou: I can't defend his behavior, so I want you to stop talking about it. Stay on the topic of why you believe Kristen without pointing this out so I don't have to argue it. Stassi the Nazi see his growth, that's how you know he's redeemed.\n\nYou're a mess. And you should be ashamed.", "created_utc": "1591405268.0", "edited": "False", "id": "ft1cnqf", "is_submitter": "False", "link_id": "t3_gwl4xt", "parent_id": "t1_ft1bfz9", "score": "0", "subreddit": "vanderpumprules", "subreddit_id": "t5_302zw"}, {"author": "bawab33", "body": "You want me to have emotions about you so bad. Is this projection maybe? You're all up in your feeling I won't cave to your nonsense? Be mad and be emotional but projection isn't a good look.\n\nJokes are to make people laugh. I wish you no mirth. So no, not a joke. Just a sincere desire to help you understand how unimportant you are in the scheme of things. You're something to do on a boring Friday in quarantine. I appreciate you for that the world's smallest amount.\n\nI know you responded. I know because then I responded. I don't agree. You're not that bright huh?\n\nI'm talking about two things. Kristen's abuse claims and James' abuse on the show. If you can only talk about one at a time, you have the issue keeping up. I'm still going to talk about both. Seethe about it. \n\nI know what you're saying. I disagree. You really think just because you say something I'm required to agree or I didn't see it. You're wrong. Deal. Stay pressed.", "created_utc": "1591403674.0", "edited": "False", "id": "ft18yoy", "is_submitter": "False", "link_id": "t3_gwl4xt", "parent_id": "t1_ft17z57", "score": "1", "subreddit": "vanderpumprules", "subreddit_id": "t5_302zw"}, {"author": "bawab33", "body": "I respond because expecting perfect victims should be called out always. Just trying to introduce you to common sense princess.\n\nWhy would it be a joke. Just my honest thoughts. Yikes\n\nI'm talking about James when I say abuse isn't just physical. Maybe some of your issue is you don't read well. His actions toward Raquel this season and to Kristen in past seasons were abuse. \n\nAre you really trying a popularity contest of how many group members forgive him. The same people defending racist Max? Jax the Homophobe? Stassi the racist Nazzi queen? Girl bye.\n\nLol no. I'm not going to bother with your post history. Why would you even ask me that. I have no plans this weekend. Let's go sweetheart.", "created_utc": "1591402860.0", "edited": "False", "id": "ft173sv", "is_submitter": "False", "link_id": "t3_gwl4xt", "parent_id": "t1_ft160kf", "score": "0", "subreddit": "vanderpumprules", "subreddit_id": "t5_302zw"}, {"author": "bawab33", "body": "The last thing I will ever care about as long as I live and breathe on planet Earth is convincing you of anything. We'll experience the heat death of the planet first. I wanted to say my piece so I did.\n\nDomestic abuse isn't just physical. He's a domestic abuser for the emotional and mental abuse he put Kristen and Raquel through even if it's he's not the one who abused her physically. Calling him a bright spot after everything he's done because he mustered up some crocodile tears is sickening. But people love to stan men no matter what vile shit they do. They both need to go and take half the cast with them.", "created_utc": "1591401794.0", "edited": "False", "id": "ft14l1r", "is_submitter": "False", "link_id": "t3_gwl4xt", "parent_id": "t1_ft12un2", "score": "0", "subreddit": "vanderpumprules", "subreddit_id": "t5_302zw"}, {"author": "bawab33", "body": "Imma @ you. Kristen can be a piece of shit racist and be abused. She wouldn't be the first reality show member who got fired for calling the police on a cast member. And it's not her job to react \"correctly\" to abuse to be believed. She doesn't have to be the perfect victim. She is racist and should be fired. We've seen James be a piece of shit. I can't imagine what he does off camera if that's how he behaves on camera. He should be fired too.", "created_utc": "1591400125.0", "edited": "False", "id": "ft10xf7", "is_submitter": "False", "link_id": "t3_gwl4xt", "parent_id": "t1_fsvzb44", "score": "-1", "subreddit": "vanderpumprules", "subreddit_id": "t5_302zw"}, {"author": "bawab33", "body": "This. The fact that she's posting a bunch of black lives matter shit but not bringing this up and at least apologizing pisses me off. And I hate that I wan't allowed to cancel my pre-order of her book.\n\nHowever, it doesn't make physical abuse of her ok.", "created_utc": "1591307216.0", "edited": "False", "id": "fswn3po", "is_submitter": "False", "link_id": "t3_gw69r4", "parent_id": "t1_fstusir", "score": "2", "subreddit": "vanderpumprules", "subreddit_id": "t5_302zw"}, {"author": "bawab33", "body": "She's mentioned in an interview before that she took the opportunity to smack him them because \"people we're around so I knew he wouldn't do anything\". With he abuse chapter in the book, it makes me think she took the opportunity for revenge.", "created_utc": "1591307119.0", "edited": "False", "id": "fswmwi4", "is_submitter": "False", "link_id": "t3_gw69r4", "parent_id": "t1_fst9jcm", "score": "-2", "subreddit": "vanderpumprules", "subreddit_id": "t5_302zw"}, {"author": "bawab33", "body": "They say that, but she did talk about it on camera with them. Most of the issue came with the started yelling at Carter in their own home. They should have just cut her off in the beginning, told her why and left it alone.", "created_utc": "1591305686.0", "edited": "False", "id": "fswjzcy", "is_submitter": "False", "link_id": "t3_gw5523", "parent_id": "t1_fssyqyj", "score": "0", "subreddit": "vanderpumprules", "subreddit_id": "t5_302zw"}, {"author": "bawab33", "body": "Based on her book I think he's the chapter of the guy that was physically violent.", "created_utc": "1591147584.0", "edited": "False", "id": "fsp6z48", "is_submitter": "False", "link_id": "t3_gvhn7y", "parent_id": "t1_fsp66ka", "score": "4", "subreddit": "vanderpumprules", "subreddit_id": "t5_302zw"}, {"author": "bawab33", "body": "Right? Like girl what. And wasn't her whole argument that she was single?", "created_utc": "1591147532.0", "edited": "False", "id": "fsp6vr7", "is_submitter": "False", "link_id": "t3_gvhn7y", "parent_id": "t1_fsp689g", "score": "3", "subreddit": "vanderpumprules", "subreddit_id": "t5_302zw"}, {"author": "bawab33", "body": "I see where you're coming from. It could have been squashed it if she just admitted, you made me mad so I was petty instead of getting defensive.", "created_utc": "1591119924.0", "edited": "False", "id": "fsnnq8y", "is_submitter": "False", "link_id": "t3_gunc0n", "parent_id": "t1_fskt20a", "score": "1", "subreddit": "vanderpumprules", "subreddit_id": "t5_302zw"}, {"author": "bawab33", "body": "The thing that makes me think it's not Scheana is that Kristen and Scheana are on goof terms.", "created_utc": "1591052077.0", "edited": "False", "id": "fskqnq8", "is_submitter": "False", "link_id": "t3_guopo0", "parent_id": "t1_fsjushn", "score": "1", "subreddit": "vanderpumprules", "subreddit_id": "t5_302zw"}, {"author": "bawab33", "body": "Billie got into a tiff with Katie right before the event. It was the previous episode of the staff meeting about James. She didn't get invited because Katie didn't like her on top of not knowing her. \n\nA lot of people comment on the way James or Billie get treated differently that other cast members who've done similar things...and they should. You let friends you've known a decade get away with things you don't let casual acquaintances get away with. If I get into a fight with my bff, she's still going to be invited to something I plan. Random lady I work with and only hang out with in big groups because someone else invited her gets cut out if we fight. That's normal . Stop arguing with people if you want to be invited to their stuff.", "created_utc": "1591050865.0", "edited": "False", "id": "fskodlh", "is_submitter": "False", "link_id": "t3_gunc0n", "parent_id": "t3_gunc0n", "score": "5", "subreddit": "vanderpumprules", "subreddit_id": "t5_302zw"}, {"author": "bawab33", "body": "Why didn't this post get locked like the one about schwartz 🤔?", "created_utc": "1590848991.0", "edited": "False", "id": "fsb4wjg", "is_submitter": "False", "link_id": "t3_gsw8ot", "parent_id": "t3_gsw8ot", "score": "0", "subreddit": "vanderpumprules", "subreddit_id": "t5_302zw"}, {"author": "bawab33", "body": "The past is the past and the future is unknown. No matter what you point to, Lisa can end a contract  that is set up with an end date, but ownership is permanent. I'm just giving hypotheticals, and I'll stop because you're getting really tied up in them and those specifics aren't my point. It's stupid to take a licensing deal that could end over ownership; especially when you're being allowed to buy in for a lot less than most people would be. And for what it's worth, you just named as many people she's fired as you named that she kept around. Seems like licensing would be a 50/50 bet.", "created_utc": "1590000197.0", "edited": "False", "id": "fr9mqas", "is_submitter": "False", "link_id": "t3_gmny4a", "parent_id": "t1_fr78bvn", "score": "1", "subreddit": "vanderpumprules", "subreddit_id": "t5_302zw"}, {"author": "bawab33", "body": "The TomTom Club was a famous band comprised of members of another famous band (Talking Heads). Lisa Vanderpump would have been so very well aware of them from the 80s. It would be like naming your club the Jonas Bros because you employ two people named Jonas and they're bros and having no interest in it being a play on the Jonas Brothers. Truly, there's no way it wasn't a factor for Lisa.\n\nI truly believe they have a contract. But if she tries to screw them they can sue and would likely come out fine.\n\nThe bar is doing well partially (mostly) because of fans of the show attending. If that stops being a draw and sales are down, she'll rebrand. Im not saying that's somewhat will definitely happen so it's \nbesides my point. Owning is more security than licensing. They could say something offensive and she would cut ties to save herself. Look at Kathryn from Southern Charm and her endorsement deals. I bet she wishes she owned a part of those businesses instead of getting a salary.", "created_utc": "1589938698.0", "edited": "False", "id": "fr73bmr", "is_submitter": "False", "link_id": "t3_gmny4a", "parent_id": "t1_fr6ajsg", "score": "2", "subreddit": "vanderpumprules", "subreddit_id": "t5_302zw"}, {"author": "bawab33", "body": "The bar is definitely named after Tom Sandoval and Tom Schwartz, and it is also definitely a play on the TomTom Club.\n\nI think the whole business deal is made murky by the show. Yes, their small amount of fame is why she wants them. But it also gives them a story line and a reason to keep them on the successful show. That editor already admitted to trying out episodes this season where main cast members don't show up at all. And did she really not sign anything or was that a story line for tv show drama? If it's real, a handshake deal that is caught on camera would hold up in court. Handshake deals are actually legally binding. The problem is usually proving them. If Lisa's goal was screwing them by not signing anything, she messed up when she let it get filmed so jokes on her. Hell, for all we know, there is a licensing deal in place and the whole \"owning a bar\" thing is bs.\n\nAnd I would rather own part of the bar. If Vanderpump Rules is cancelled, say, two seasons from now, all cast members are going to have their fame take a nose dive. Once that licensing deal runs out in a few years, she just changes the name of the bar to Pinky's and keeps it moving. Now the Toms don't make tv show money or licensing money. But instead they're owners. When the show is over, they still own a part of a bar whatever she names it.\n\nedited for grammar", "created_utc": "1589918811.0", "edited": "False", "id": "fr62l1q", "is_submitter": "False", "link_id": "t3_gmny4a", "parent_id": "t1_fr5ske7", "score": "3", "subreddit": "vanderpumprules", "subreddit_id": "t5_302zw"}, {"author": "bawab33", "body": "Yeah bullet doged by her. She'll just get another date. Hopefully with someone who doesn't think every ten seconds of free time you can muster belongs to them.", "created_utc": "1589734439.0", "edited": "False", "id": "fqxm5tk", "is_submitter": "False", "link_id": "t3_gkvv71", "parent_id": "t1_fqxl181", "score": "2", "subreddit": "AmItheAsshole", "subreddit_id": "t5_2xhvq"}, {"author": "bawab33", "body": "Being with friends is busy. It doesn't need to be work to be considered busy. If I am actively doing anything g at all, I'm busy.", "created_utc": "1589733495.0", "edited": "False", "id": "fqxk1f1", "is_submitter": "False", "link_id": "t3_gkvv71", "parent_id": "t1_fqvxofk", "score": "2", "subreddit": "AmItheAsshole", "subreddit_id": "t5_2xhvq"}, {"author": "bawab33", "body": "I'm pretty sure several of the girls including Ariana went out of the country together recently.  And it doesn't matter. They're sharing their perception. They weren't at all being mean spirited. They basically said Jax is being a whiny baby because the attention isn't on him, but Tom and Ariana are more kissy kissy on camera than they normally are.", "created_utc": "1588888194.0", "edited": "False", "id": "fptbf7m", "is_submitter": "False", "link_id": "t3_gf9kfh", "parent_id": "t1_fpt4s33", "score": "1", "subreddit": "vanderpumprules", "subreddit_id": "t5_302zw"}, {"author": "bawab33", "body": "Right. We see an edited version of 4 months of their lives. They see each other more often. But however accurate their statements, they weren't being nasty at all. They were lightly bemused. I didn't hear any of the snark they use when being mean.", "created_utc": "1588887026.0", "edited": "False", "id": "fpt9408", "is_submitter": "False", "link_id": "t3_gf9kfh", "parent_id": "t1_fpt0sai", "score": "5", "subreddit": "vanderpumprules", "subreddit_id": "t5_302zw"}, {"author": "bawab33", "body": "I don't think their relationship is weird. And neither is their love language. What would be weird to me is if a couple had a love language that did not include public displays of affection, but suddenly changed that when cameras were rolling. That would be weird to me, and that seems to be all the girls were saying.", "created_utc": "1588879585.0", "edited": "False", "id": "fpstzel", "is_submitter": "False", "link_id": "t3_gf9kfh", "parent_id": "t1_fpsq823", "score": "1", "subreddit": "vanderpumprules", "subreddit_id": "t5_302zw"}, {"author": "bawab33", "body": "That may honestly be the case. The one big thing they put out there has everyone constantly questioning their relationship. People declare their relationship doomed on the marriage and kids issue. Maybe decided to put less of the arguments out there and show more of the sweet moments. \n\nI don't think it's helped though. They seem to me like they've resolved the issue in a way they are both happy, but that's my interpretation. They could have swept it under the rug, which is what Jax and a lot of viewers are suggesting.", "created_utc": "1588877555.0", "edited": "False", "id": "fpspsvi", "is_submitter": "False", "link_id": "t3_gf9kfh", "parent_id": "t1_fpso33f", "score": "2", "subreddit": "vanderpumprules", "subreddit_id": "t5_302zw"}, {"author": "bawab33", "body": "I'm going to go against the grain and say I honestly saw no malice in what they were saying or how they said it. They seemed mildly amused by it. All they said is that the relationship Tom and Ariana portray on the show is different to how they seem them interact without cameras. And they specifically mentioned interactions in public/with friends. Not when the camera is shooting them alone at home, which would be different from what the ladies normally see. If that's true it's true, and it's ok to say so. \n\nI don't see any reason for them to make it up. And with as much shit as Tom and Ariana take from Jax and rabid fans about their relationship (and how they differ on marriage/kids), I can see them being a little *extra* on camera to \"prove\" their love. It doesn't mean their relationship is fake. It just means they play to the camera's a little so people back off. Their friends notice that and are bemused by it.\n\nIf I had friends who never showed affection in public and then suddenly do in front of cameras, I'm going to be like \"lol this is weird\".", "created_utc": "1588875190.0", "edited": "False", "id": "fpskvwx", "is_submitter": "False", "link_id": "t3_gf9kfh", "parent_id": "t3_gf9kfh", "score": "3", "subreddit": "vanderpumprules", "subreddit_id": "t5_302zw"}, {"author": "bawab33", "body": "I don't know if she meant there is a literal dragon riding Khaleesi in our shared human past (she might), but G.R.R. Martin did base the books on a real event. The War of the Roses:  [https://en.wikipedia.org/wiki/Wars\\_of\\_the\\_Roses](https://en.wikipedia.org/wiki/Wars_of_the_Roses)", "created_utc": "1588082351.0", "edited": "False", "id": "foue717", "is_submitter": "False", "link_id": "t3_g99niy", "parent_id": "t1_fotr2v5", "score": "1", "subreddit": "vanderpumprules", "subreddit_id": "t5_302zw"}, {"author": "bawab33", "body": "She didn't force him to propose. He's a grown man. He could have broken up with her. There's nothing wrong with saying you're not willing to continue a stagnant relationship and saying what you need to stay.", "created_utc": "1587131715.0", "edited": "False", "id": "fnoqs77", "is_submitter": "False", "link_id": "t3_g2t3zx", "parent_id": "t1_fnoly6i", "score": "21", "subreddit": "vanderpumprules", "subreddit_id": "t5_302zw"}, {"author": "bawab33", "body": "I wish I could upvote this a thousand times", "created_utc": "1584994740.0", "edited": "False", "id": "flb0am0", "is_submitter": "False", "link_id": "t3_fnfh5v", "parent_id": "t1_flaedu2", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "bawab33", "body": "Why is it fuck her? They're his brothers. He could have handled it. Fuck him for not taking care of business. Whew we love to blame women for the failings of men.", "created_utc": "1584473280.0", "edited": "False", "id": "fkrp7pk", "is_submitter": "False", "link_id": "t3_fjpofo", "parent_id": "t1_fkp9lkv", "score": "14", "subreddit": "vanderpumprules", "subreddit_id": "t5_302zw"}, {"author": "bawab33", "body": "This. Is. Not. Legal. Advice. You are in the wrong sub. Again I ask. So?", "created_utc": "1582083106.0", "edited": "False", "id": "fi2ma73", "is_submitter": "False", "link_id": "t3_f4gpuu", "parent_id": "t1_fhwdqeb", "score": "1", "subreddit": "AmItheAsshole", "subreddit_id": "t5_2xhvq"}, {"author": "bawab33", "body": "So?", "created_utc": "1581912606.0", "edited": "False", "id": "fhwd69q", "is_submitter": "False", "link_id": "t3_f4gpuu", "parent_id": "t1_fhttdh4", "score": "2", "subreddit": "AmItheAsshole", "subreddit_id": "t5_2xhvq"}, {"author": "bawab33", "body": "She included that detail in her comment replies.", "created_utc": "1579041579.0", "edited": "False", "id": "feeun7a", "is_submitter": "False", "link_id": "t3_enwz9w", "parent_id": "t1_fedb8se", "score": "1", "subreddit": "AmItheAsshole", "subreddit_id": "t5_2xhvq"}, {"author": "bawab33", "body": "But he didn't tell her that. He told her he was ok with her getting more until she was in a marriage she probably wouldn't be in if he were honest. If only one person knows about the compromise, it's a lie.", "created_utc": "1579006167.0", "edited": "False", "id": "fedaziy", "is_submitter": "False", "link_id": "t3_enwz9w", "parent_id": "t1_fecv9e0", "score": "2", "subreddit": "AmItheAsshole", "subreddit_id": "t5_2xhvq"}, {"author": "bawab33", "body": "It's not really a compromise at all though. It's a bait and switch. The wife likes body mods and made it clear before their relationship and during their marriage she would get more and he said ok. Now he's causing marital strife by changing his mind and throwing a fit. \n\nThere's a difference between compromise and tricking. Both people have to be in on a compromise. It requires agreement. You can't spring upon the person that you were internally, secretly compromising and have that count.", "created_utc": "1578970955.0", "edited": "False", "id": "feccvj5", "is_submitter": "False", "link_id": "t3_enwz9w", "parent_id": "t1_fecbxon", "score": "3", "subreddit": "AmItheAsshole", "subreddit_id": "t5_2xhvq"}, {"author": "bawab33", "body": "Isn't that what he's doing?", "created_utc": "1578969478.0", "edited": "False", "id": "fecaa3f", "is_submitter": "False", "link_id": "t3_enwz9w", "parent_id": "t1_febh5fn", "score": "2", "subreddit": "AmItheAsshole", "subreddit_id": "t5_2xhvq"}, {"author": "bawab33", "body": "\"Why should you expect that the person you hurt's family or friends will still want to support you after you hurt them?\"\n\nYou shouldn't, I don't, she doesn't, and it's weird you keep fixating on this. It's really weird. She's close to her in-laws. She considers them really close friends. She said so in the post. She's not fixated on them leaving her. And she has let them in.  Day to day she thinks his family is great and she has a good life.  Most people I know only consider their in-laws family in the technical (legal) sense even if they love them very much. But they do make a distinction between the in-law family and *their* family for the reasons OP listed. And if pressed would probably say they love them like they love their really close long-term friends, but not like their actual family. It's not about genetics, but who raised you (adoptions, foster family you were close to, etc). OP emphasized being raised by/with people; not genetics if your re-read the post. This feeling is actually pretty normal. It only came up here because of OPs family situation. OP may have felt them same way about in-laws even if she had her own family. \n\nThere is a deeper feeling of security in the back of everyone's mind they have in knowing there are people who are their \"ride of die\". Right or wrong I'm going over the cliff with you like Thelma and Louise. She was having a moment when she was sad about not having that like most people have. It's clear you have that in your life and are sadly incapable of empathizing with someone who doesn't. It's a completely valid way to feel and nothing at all in her post says it's something she is fixated on, and that it's just a reality that occasionally makes her sad.", "created_utc": "1578680635.0", "edited": "False", "id": "fdr7mpy", "is_submitter": "False", "link_id": "t3_eliacz", "parent_id": "t1_fdpezyo", "score": "0", "subreddit": "AmItheAsshole", "subreddit_id": "t5_2xhvq"}, {"author": "bawab33", "body": "I see your point. It's a naive, dismissive point. Why wouldn't she worry about that? Your whole point is \"as long as she doesn't make any bad decisions or he doesn't just fall out of love with her everything will be fine. But if she messes up she loses any semblance of family in the world but hey as long as she doesn't *plan* on it she should just never consider that or be sad.\" \n\na) just because you don't plan on something happening doesn't mean it won't,  b) her whole issue is she wish she had support no matter what, and she doesn't feel comforted by the support that only exists \"as long as she doesn't plan\" on doing anything, c) cheating is just one example she was giving which you're choosing to hyper focus on instead of her whole point, just like her husband.\n\nMuch like her husband, it seems like you're simply unable to imagine or empathize with being in her situation.", "created_utc": "1578626420.0", "edited": "False", "id": "fdpeaje", "is_submitter": "False", "link_id": "t3_eliacz", "parent_id": "t1_fdp54e9", "score": "0", "subreddit": "AmItheAsshole", "subreddit_id": "t5_2xhvq"}, {"author": "bawab33", "body": "Im starting to feel like you're being purposely obtuse. There are very few people  that are cutting off their own family when that family member breaks up with a partner whether they are right or wrong. And OPs conversation with her husband was lamenting that she didn't have that security because of her bio family situation. That's all. And she's right as you just admitted. It always applies. It doesn't matter what you plan on doing, it's the lack of that security even if it's not likely. That's always in the back of her mind and she just wanted a little commiseration on that reality.", "created_utc": "1578616633.0", "edited": "False", "id": "fdozsx0", "is_submitter": "False", "link_id": "t3_eliacz", "parent_id": "t1_fdlsgix", "score": "0", "subreddit": "AmItheAsshole", "subreddit_id": "t5_2xhvq"}, {"author": "bawab33", "body": "But if your partner was the o e who cheated would they keep ties? If the answer is no, that's OP's problem.", "created_utc": "1578531270.0", "edited": "False", "id": "fdls8vl", "is_submitter": "False", "link_id": "t3_eliacz", "parent_id": "t1_fdlrjiz", "score": "2", "subreddit": "AmItheAsshole", "subreddit_id": "t5_2xhvq"}, {"author": "bawab33", "body": "But you're making OP's point. OP's entire point is family you grew up with will pick you even if you screw up. \n\nIf I cheated on an amazing partner and he dumped me, my family would still love me and welcome me even as they were disappointed. My partner's family would cut me out. The two family's are not equal no matter how much they love OP right now. OP is lamenting having a family that would pick her even if she were wrong because they're *her* family and not her husband's.", "created_utc": "1578530338.0", "edited": "False", "id": "fdlqvm4", "is_submitter": "False", "link_id": "t3_eliacz", "parent_id": "t1_fdl4d1g", "score": "5", "subreddit": "AmItheAsshole", "subreddit_id": "t5_2xhvq"}, {"author": "bawab33", "body": "So I only made it through one episode. I may need to try again.", "created_utc": "1578447435.0", "edited": "False", "id": "fdiof5z", "is_submitter": "False", "link_id": "t3_ekvj2i", "parent_id": "t1_fdfnrzm", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "bawab33", "body": "Excessive female nudity but no male nudity at all. If half the female cast has their vulva on display, show some peen. Nudity doesn't bother me unless it's lopsided.", "created_utc": "1578362361.0", "edited": "False", "id": "fdfib9a", "is_submitter": "False", "link_id": "t3_ekvj2i", "parent_id": "t3_ekvj2i", "score": "51", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "bawab33", "body": "I was born and raised in St. Pete which is basically paradise. I live in Tampa for work because I-275 is so awful. Otherwise I'd consider living in St. Pete and commuting to work. I hate Tampa traffic, because it's a nonsensical mess. But I could never live in a place that snows. Humidity doesn't bother me that much.\n\nOne thing that can't be overstated is how convenient the Tampa Bay area is. Yes, traffic sucks during rush hours, but you are conveniently located near everything. There's so much to do in the tri-county area. Orlando isn't that far away with Disney and Universal Studios. Miami is a 5 hour drive. You get the convenience/things to do of a major metropolitan area while feeling like you live in the suburbs.", "created_utc": "1578237559.0", "edited": "False", "id": "fd9sk1x", "is_submitter": "False", "link_id": "t3_ejubhh", "parent_id": "t1_fd2il0p", "score": "2", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "bawab33", "body": "This isn't true at all, and I don't know why you would think this. People met strangers at bars, clubs, coffee shops, I could go on. They also had one night stands with these people occasionally. \n\nAnd it might shock you to know there was internet before social media. People met someone online and planned a date even when there was no such thing as a profile or profile picture. Your idea of dating before social media is disturbingly inaccurate.", "created_utc": "1577849327.0", "edited": "False", "id": "fcp3hne", "is_submitter": "False", "link_id": "t3_ei40zr", "parent_id": "t1_fcnoxvl", "score": "4", "subreddit": "AmItheAsshole", "subreddit_id": "t5_2xhvq"}, {"author": "bawab33", "body": "No, I wouldn't always. But that's just me. But in a case where I really miss them and I've already spent the big holiday (many people consider Christmas to be the biggest family holiday) elsewhere, I would insist on being with my family.\n\nThere is a reason many couples rotate the holidays. He's trying to usurp all of them. He could have planned this trip for some other weekend.", "created_utc": "1577824980.0", "edited": "False", "id": "fco6g7n", "is_submitter": "False", "link_id": "t3_ehs2lx", "parent_id": "t1_fcnhqez", "score": "1", "subreddit": "AmItheAsshole", "subreddit_id": "t5_2xhvq"}, {"author": "bawab33", "body": "OP didn't mention a diagnosis. The commenter is saying you never know. Missing out on spending time with someone you really want to because you can do it later is a bad idea. Later isn't guaranteed.", "created_utc": "1577811149.0", "edited": "False", "id": "fcngd9l", "is_submitter": "False", "link_id": "t3_ehs2lx", "parent_id": "t1_fcmu6h2", "score": "1", "subreddit": "AmItheAsshole", "subreddit_id": "t5_2xhvq"}, {"author": "bawab33", "body": "Paradigm\n\nCompletely uncalled for and rude.", "created_utc": "1577239316.0", "edited": "False", "id": "fbz9htf", "is_submitter": "False", "link_id": "t3_ef33x7", "parent_id": "t3_ef33x7", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "bawab33", "body": "And don't touch the manatees", "created_utc": "1577238986.0", "edited": "False", "id": "fbz94w3", "is_submitter": "False", "link_id": "t3_ef19xm", "parent_id": "t1_fbyi24w", "score": "15", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "bawab33", "body": "Trick is to season the flour (or batter if that's what you use)", "created_utc": "1576772410.0", "edited": "False", "id": "fbdvq4h", "is_submitter": "False", "link_id": "t3_ecotpw", "parent_id": "t1_fbcvcyl", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "bawab33", "body": "Right? Like the divorce likely didn't happen because his mom was afraid dad would take the kids.", "created_utc": "1576427275.0", "edited": "False", "id": "fb0m73c", "is_submitter": "False", "link_id": "t3_eaf9lv", "parent_id": "t1_fatl0q0", "score": "1", "subreddit": "AmItheAsshole", "subreddit_id": "t5_2xhvq"}, {"author": "bawab33", "body": "How is that fucked. Everyone is reaching so hard to make this woman a villain. Most people who divorce over cheating have to share custody with the ex. A cheating ex raising their child and being a great parent is a completely normal, everyday, ordinary, non-remarkable thing and you know it. What on Earth is making you pretend she left her kid with some evil ogre. He's a cheater in romantic relationships. It has nothing to do with him as a parent. Stop being ridiculous.", "created_utc": "1575563579.0", "edited": "False", "id": "f9qmfx0", "is_submitter": "False", "link_id": "t3_e6avb1", "parent_id": "t1_f9pvn7v", "score": "15", "subreddit": "AmItheAsshole", "subreddit_id": "t5_2xhvq"}, {"author": "bawab33", "body": "Republicans", "created_utc": "1575177169.0", "edited": "False", "id": "f98e195", "is_submitter": "False", "link_id": "t3_e45b4f", "parent_id": "t3_e45b4f", "score": "-6", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "bawab33", "body": "I'm getting random Dutch subtitles on The Mandalorian  for Roku tv. Super annoying and I can't find where to turn them off.", "created_utc": "1573609390.0", "edited": "False", "id": "f7d77ym", "is_submitter": "False", "link_id": "t3_dv3f6y", "parent_id": "t1_f7d3vbj", "score": "1", "subreddit": "DisneyPlus", "subreddit_id": "t5_r0hux"}, {"author": "bawab33", "body": "The discussion was already had, but from her point of view he could be blowing smoke. He's basically saying, let's wait for an undetermined amount of time in the future where I *feel* secure enough to propose. I can't put a dollar amount on it or give you a time table. I'm just going to let you know when I get there. Someday. Swear.\n\nAfter a few years you may just flat out not believe them. They could just be telling you what you want to hear so you won't leave. Plenty of women (and men) have been eventually dumped by someone who promised \"soon\".", "created_utc": "1568770613.0", "edited": "False", "id": "f0ni0f4", "is_submitter": "False", "link_id": "t3_d5jqqf", "parent_id": "t1_f0nfdtq", "score": "10", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "bawab33", "body": "I guess people in the US don't have the same problem doing the very simple math as people in other countries making it a non-issue.", "created_utc": "1566928410.0", "edited": "False", "id": "ey8u7aq", "is_submitter": "False", "link_id": "t3_cw2vmy", "parent_id": "t1_ey8kp33", "score": "-1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "bawab33", "body": "The studies that say people who breastfeed are more likely to be college educated, make more money, therefore have better jobs and schedules that allow it. It means they're more likely to do things like read to their children, live in areas with better schools, be able to spend more time with their children as they aren't working two jobs to make ends meet. So many of those supposed health and mental benefits can't be tracked to just breastdfeeding but instead to the characteristics that let them breastfeed. It turns out that being able to afford taking your child to the doctor counts a little more than the breastdfeeding.\n\nIf you don't know this you're not well enough versed on this topic to say anything about it under any context. So I ask you, what on Earth studies were you reading or did you just get all of your facts from the internet?", "created_utc": "1566653454.0", "edited": "False", "id": "exykyxz", "is_submitter": "False", "link_id": "t3_cuiwjh", "parent_id": "t1_exyhev9", "score": "3", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "bawab33", "body": "They didn't just say it's lesser. They said the people are shameful and should have to answer for their shameful choices.", "created_utc": "1566610222.0", "edited": "False", "id": "exw0of2", "is_submitter": "False", "link_id": "t3_cuiwjh", "parent_id": "t1_exw0bti", "score": "5", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "bawab33", "body": "It's not shameful. People are always typing these nasty, judgmental messages and never once pointing out the legions of kids who've dies from formula, because they don't exist. And many a study has pointed out that have of the supposed benefits come from the fact that people who can/choose to breastfeed do/have access to other things that contribute greatly to positive results. So you're not just being nasty but disingenuous too.", "created_utc": "1566609265.0", "edited": "False", "id": "exvysyh", "is_submitter": "False", "link_id": "t3_cuiwjh", "parent_id": "t1_exvxdrq", "score": "6", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "bawab33", "body": "More than 2 house a day is nowhere near any kind of casual play.", "created_utc": "1564094851.0", "edited": "False", "id": "euy2tov", "is_submitter": "False", "link_id": "t3_chl2l3", "parent_id": "t1_euxrz0i", "score": "2", "subreddit": "harrypotterwu", "subreddit_id": "t5_3psru"}, {"author": "bawab33", "body": "There have been plenty of studies at this point that show homework may not be that helpful. And I may have signed up for that college class, but the professor signed up to teach it and grade the work for all of those students. \n\nBut that's not my point. I didn't mind doing the homework, and generally had no trouble turning it in on time. But I don't know if I'm studying/learning if I can't get homework graded in enough time. I may need to get tutoring before a test for example. I don't know because I don't know how well or poorly I've done. I minded when a teacher has these hard and fast rules about due dates, but takes their sweet time to grade, or are mad students are demanding grades.", "created_utc": "1546620385.0", "edited": "False", "id": "ed8gubl", "is_submitter": "False", "link_id": "t3_acagn8", "parent_id": "t1_ed8eaim", "score": "2", "subreddit": "pettyrevenge", "subreddit_id": "t5_2vg7t"}, {"author": "bawab33", "body": "Are you assigning homework, projects and papers that students have to do during their personal time? \n\nI would have professors and teachers that would give their first day speech about due dates and deadlines and how it was up to you to manage your time. No late work. You better be on death's door to get an extension. But then they want to whine about grading during their personal time. Well I don't have sympathy either. I get all my work for all my classes done on time, so grade it on time.", "created_utc": "1546617183.0", "edited": "False", "id": "ed8c6pq", "is_submitter": "False", "link_id": "t3_acagn8", "parent_id": "t1_ed6z6eu", "score": "1", "subreddit": "pettyrevenge", "subreddit_id": "t5_2vg7t"}, {"author": "bawab33", "body": "You're from the Middle East, with the family dynamics there calling American families abhorrent? You have got to be kidding me. ", "created_utc": "1540619658.0", "edited": "False", "id": "e8j9msb", "is_submitter": "False", "link_id": "t3_9rmv88", "parent_id": "t1_e8iehw6", "score": "1", "subreddit": "MaliciousCompliance", "subreddit_id": "t5_3boqz"}, {"author": "bawab33", "body": "I first read this as that's why unicorns are so important, and now I'm disappointed in unions and their lack of majesty and wonder.", "created_utc": "1534652309.0", "edited": "False", "id": "e4g3wmq", "is_submitter": "False", "link_id": "t3_98fz23", "parent_id": "t1_e4fsep1", "score": "1", "subreddit": "MaliciousCompliance", "subreddit_id": "t5_3boqz"}, {"author": "bawab33", "body": "It's always crazy when weird shit on the internet gets noticed by celebs.", "created_utc": "1531082313.0", "edited": "False", "id": "e20qvjj", "is_submitter": "False", "link_id": "t3_8x2pyo", "parent_id": "t3_8x2pyo", "score": "1", "subreddit": "thanosdidnothingwrong", "subreddit_id": "t5_gxikd"}, {"author": "bawab33", "body": "He didn't game it overly much if at all. The GI Bill won't pay to cover courses not required for your degree. They flat out won't pay for a course that's not absolutely required. That means his degree requires a foreign language. He just wasn't supposed to take one he's fluent in. Even then there are exceptions I'd you're fluent speaking but never learned to read or write the language.", "created_utc": "1531066384.0", "edited": "False", "id": "e20am8u", "is_submitter": "False", "link_id": "t3_8wvwqg", "parent_id": "t1_e1zk2su", "score": "1", "subreddit": "MaliciousCompliance", "subreddit_id": "t5_3boqz"}, {"author": "bawab33", "body": "Cunt, it's not other people's problem she didn't have the balls to be assetive to the right people. ", "created_utc": "1530736905.0", "edited": "False", "id": "e1soq96", "is_submitter": "False", "link_id": "t3_8w1bmv", "parent_id": "t1_e1shzvw", "score": "1", "subreddit": "MaliciousCompliance", "subreddit_id": "t5_3boqz"}, {"author": "bawab33", "body": "Isn't the best path to FIRE the shortest. You just made the argument that the MD will make more over a long period of time. Isn't the long period of time the exact thing people are trying to avoid? It seems like you're just really impressed by the prestige of being an MD and straying from the point of it all. ", "created_utc": "1527040873.0", "edited": "False", "id": "dzf707x", "is_submitter": "False", "link_id": "t3_8l5grc", "parent_id": "t1_dzd8x98", "score": "2", "subreddit": "financialindependence", "subreddit_id": "t5_2t34z"}, {"author": "bawab33", "body": "Why are you insisting on jumping to foster care? Did OP dm you that his parents died and didn't tell the rest of us. As of now, the kids would be with their Grandparents. What's so damn evil aboy that?", "created_utc": "1523215569.0", "edited": "False", "id": "dx13hn4", "is_submitter": "False", "link_id": "t3_8ancog", "parent_id": "t1_dx0henc", "score": "2", "subreddit": "relationships", "subreddit_id": "t5_2qjvn"}, {"author": "bawab33", "body": "Let's all agree to keep this a secret. Traffic is getting bad enough as it is.", "created_utc": "1523108104.0", "edited": "False", "id": "dwyrohk", "is_submitter": "False", "link_id": "t3_8a7rgt", "parent_id": "t1_dwx5plm", "score": "2", "subreddit": "financialindependence", "subreddit_id": "t5_2t34z"}]