[{"author": "ben121frank", "body": "The free welcome cocktail I had at Selina hostel when I was in Tel Aviv. Not exactly sure what was in it, I watched them make it for other people and didn’t look like anything particularly out of the ordinary. But the drink legitimately tasted like they’d dumped an ashtray into it, one of the most unpleasant things I’ve ever tasted.", "created_utc": "1666550754.0", "edited": "False", "id": "ithne74", "is_submitter": "False", "link_id": "t3_ybjmkt", "parent_id": "t3_ybjmkt", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "ben121frank", "body": "Was just about to comment this. So annoying, I used to really like those sandwiches", "created_utc": "1666185956.0", "edited": "False", "id": "isxmdl0", "is_submitter": "False", "link_id": "t3_y7c7mr", "parent_id": "t1_isue26r", "score": "1", "subreddit": "glutenfree", "subreddit_id": "t5_2qx1l"}, {"author": "ben121frank", "body": "Her delivery on her \"ain't that a bitch\" comment was hilarious and I appreciated it because it's one of the only times we saw her break out of her \"love and light\" routine. I actually think she could be a pretty good motivational speaker if she was just more genuine, ie \"Yes life is a bitch sometimes but we get through and it makes us stronger...\" To me her positivity always seemed very forced/performative which made it annoying to me", "created_utc": "1665870945.0", "edited": "False", "id": "isgumec", "is_submitter": "False", "link_id": "t3_y3f5r2", "parent_id": "t3_y3f5r2", "score": "3", "subreddit": "TheAmazingRace", "subreddit_id": "t5_2stq9"}, {"author": "ben121frank", "body": "NTA\n\nIf they didn’t want to be uncomfortable with a child crammed on their lap, they should’ve bought the child a seat", "created_utc": "1665251153.0", "edited": "False", "id": "irjcfs6", "is_submitter": "False", "link_id": "t3_xyqqzg", "parent_id": "t3_xyqqzg", "score": "1", "subreddit": "AmItheAsshole", "subreddit_id": "t5_2xhvq"}, {"author": "ben121frank", "body": "Really good with a layer of caramel and chocolate on top", "created_utc": "1665197410.0", "edited": "False", "id": "irh7coc", "is_submitter": "False", "link_id": "t3_xybz8f", "parent_id": "t3_xybz8f", "score": "3", "subreddit": "glutenfree", "subreddit_id": "t5_2qx1l"}, {"author": "ben121frank", "body": "“AITA for stealing $20 from the house I lit on fire?” is what your post reads like. I don’t think you’re technically in the wrong for cancelling dinner since you want that answered but absolutely YTA for putting your child into this situation. Clearly caring for your child is not a priority for this woman and it seems pretty clear that she’s just using you and your child as an excuse to basically do nothing and be a freeloader. You’re lucky she just “forgot” to feed your daughter lunch, it could’ve been something much more dangerous or possibly even malicious. You need to get you and your daughter out of this mess now", "created_utc": "1665067518.0", "edited": "False", "id": "irabxlv", "is_submitter": "False", "link_id": "t3_xwcqwd", "parent_id": "t3_xwcqwd", "score": "1", "subreddit": "AmItheAsshole", "subreddit_id": "t5_2xhvq"}, {"author": "ben121frank", "body": "I’m gonna go with NAH, lots of commenters have made lots of great points so I won’t repeat them all. But something I haven’t seen anyone else say:\n\nIf household chores/cleanliness is the issue, have you looked into a maid service? Where I’m from you can have a maid come clean your entire house top to bottom for $20-$30/hour. This may well be a more cost effective option than having your wife take off 2 days of work each week", "created_utc": "1665066924.0", "edited": "False", "id": "iraahap", "is_submitter": "False", "link_id": "t3_xwlic4", "parent_id": "t3_xwlic4", "score": "1", "subreddit": "AmItheAsshole", "subreddit_id": "t5_2xhvq"}, {"author": "ben121frank", "body": "Right now I would say Derek & Claire, they seem to be best at navigation and least likely to make stupid mistakes imo", "created_utc": "1664585340.0", "edited": "False", "id": "iqkjkji", "is_submitter": "False", "link_id": "t3_xsbs12", "parent_id": "t3_xsbs12", "score": "32", "subreddit": "TheAmazingRace", "subreddit_id": "t5_2stq9"}, {"author": "ben121frank", "body": "This is my philosophy as well. You’re either gonna be sitting at home waiting to go to the airport or sitting waiting at the airport, might as well minimize the risk and stress of it", "created_utc": "1664513046.0", "edited": "False", "id": "iqgnflj", "is_submitter": "False", "link_id": "t3_xrpgfv", "parent_id": "t1_iqgh58s", "score": "52", "subreddit": "onebag", "subreddit_id": "t5_301sk"}, {"author": "ben121frank", "body": "Overall I enjoyed this episode, just 2 tasks over 90 minutes did feel a bit dragging but I understand TAR doesn’t know which episodes CBS will make 90 minutes so I don’t really fault them for it. Anyway I’m gonna do my team rankings in order of how much I like them through the first 2 episodes\n\n10: Rich & Dom. I hate being a hater especially on someone trying to be so positive but I just find Dom really really annoying and every time they’re on screen I find myself rooting for them to get booted. I think they will soon, just don’t seem like they have the potential to be a very strong team\n\nTied for 8: Luis & Michelle and Aubrey & David. Honestly I still have trouble telling these 2 teams apart. They’re both pretty uninteresting and not adding much to the season imo. I don’t see either team going that far\n\n7: Emily & Molly. I love their story and I like them a lot, but they have been somewhat overshadowed thus far I think. I see them as a mid boot\n\n6: Marcus & Michael. I like these guys a lot, absolutely nothing against them and in other seasons they would be a lot higher, but I just like other teams more at this point. They seem like a very strong team and I definitely see them going far tho.\n\n5: Abby & Will. I always love when TAR superfans get the chance to race, and it seems like they’re making the most of it. They bring joy to the screen every time they’re on it, and I think their relationship is really sweet. I see them as a mid-boot tho.\n\n4: Glenda & Lumumba. The top 4 were hard for me because I really love each of the teams. For Glenda & Lumumba I love their energy and love for each other, but just like the other teams a little more I think. I see them going far\n\n3: Quinton & Mattie: I really love MF friend teams which are way too rare, and these two are no exception. I love their friendship and how they maintain positivity and don’t get angry at each other even through setbacks. Their comeback this episode was truly impressive. They’re kinda a wild card for me, because they can clearly beast through challenges but also seem pretty susceptible to stupid mistakes. Right now I see them as a mid boot but they could easily move up\n\n2: Derek & Claire. I really love the sense of humor they have towards each other and the race. They also seems to have a very healthy and supportive relationship and they’re just tons of fun to watch. I see them going very far, at this point they would be my winner prediction if I had to make one. They remind me a lot of Henry & Evan from S30 (maybe just bc they look so similar but dynamic wise too I think) but a more fun to watch version\n\n1: Linton & Sharik: They are just adorable. It seems like they have such a great relationship and every time they’re on screen it just makes me happy. Easily one of my favorite parent/child teams ever. Right now I see them as a mid-late boot, but could also be a sleeper for final 3.Right now my final 3 prediction is Derek & Claire, Glenda & Lumumba, and Marcus & Michale, with Linton & Sharik placing 4th, we’ll see how that holds up. Overall tho its a great season team-wise I think", "created_utc": "1664489651.0", "edited": "False", "id": "iqfalye", "is_submitter": "False", "link_id": "t3_xqwmed", "parent_id": "t3_xqwmed", "score": "34", "subreddit": "TheAmazingRace", "subreddit_id": "t5_2stq9"}, {"author": "ben121frank", "body": "Great write up! I mostly agree with your thoughts. I do think Quinton & Mattie’s navigational error was pretty stupid since the clue clearly said drive to Austria and the directions they got were to another location in Germany, but I also applaud them for handling it how they did. Agree about Luis & Michelle and David & Aubrey, I’m still getting those two teams confused tbh bc they look somewhat physically similar and neither is very interesting. I do like Abby and Will tho I think they’re cute. Also disagree about Dom, I’m very much into tree-hugging mental tranquility natural spiritualism all that stuff so we prob actually share a lot of the same mindsets but she just gets on my nerves lol.", "created_utc": "1664487699.0", "edited": "False", "id": "iqf63wj", "is_submitter": "False", "link_id": "t3_xqwmed", "parent_id": "t1_iqbr8ux", "score": "7", "subreddit": "TheAmazingRace", "subreddit_id": "t5_2stq9"}, {"author": "ben121frank", "body": "Random but one small thing I really miss is Phil would always consistently say “you are team number X” and if he said something like “you’re the x team to arrive” you knew there was a caveat coming. Now it seems like he varies his announcements and that takes some of the fun out of it to me", "created_utc": "1664420126.0", "edited": "False", "id": "iqble81", "is_submitter": "False", "link_id": "t3_xque4f", "parent_id": "t3_xque4f", "score": "13", "subreddit": "TheAmazingRace", "subreddit_id": "t5_2stq9"}, {"author": "ben121frank", "body": "Tbh it may well take them longer to find the hat and get back to the mat than a 30 minute penalty would last", "created_utc": "1664419853.0", "edited": "False", "id": "iqbkv3m", "is_submitter": "False", "link_id": "t3_xque4f", "parent_id": "t1_iqbkq2e", "score": "6", "subreddit": "TheAmazingRace", "subreddit_id": "t5_2stq9"}, {"author": "ben121frank", "body": "I don’t usually pray on peoples downfall but I’m not sure how much more of the motivational speakers I can handle 😭", "created_utc": "1664419394.0", "edited": "False", "id": "iqbjxpa", "is_submitter": "False", "link_id": "t3_xque4f", "parent_id": "t3_xque4f", "score": "17", "subreddit": "TheAmazingRace", "subreddit_id": "t5_2stq9"}, {"author": "ben121frank", "body": "I love Lindon and Sharik so much so far they may be my favorite team right now", "created_utc": "1664418430.0", "edited": "False", "id": "iqbhy6o", "is_submitter": "False", "link_id": "t3_xque4f", "parent_id": "t3_xque4f", "score": "3", "subreddit": "TheAmazingRace", "subreddit_id": "t5_2stq9"}, {"author": "ben121frank", "body": "Am I missing something or does the bells challenge look extremely easy? Prob way easier than the dancing I would think", "created_utc": "1664417868.0", "edited": "False", "id": "iqbgrmt", "is_submitter": "False", "link_id": "t3_xque4f", "parent_id": "t3_xque4f", "score": "16", "subreddit": "TheAmazingRace", "subreddit_id": "t5_2stq9"}, {"author": "ben121frank", "body": "They don’t have their own phones (except on I think S26). But they have always been allowed to ask random people for help including using their phones, and that has evolved as phone technology has evolved", "created_utc": "1664415952.0", "edited": "False", "id": "iqbcolw", "is_submitter": "False", "link_id": "t3_xque4f", "parent_id": "t1_iqbcag4", "score": "4", "subreddit": "TheAmazingRace", "subreddit_id": "t5_2stq9"}, {"author": "ben121frank", "body": "I tried to bring in an empty refillable plastic bottle (it was translucent so you could see that it was empty) and was stopped, I thought that was ok according to the policy but ig not", "created_utc": "1664115940.0", "edited": "False", "id": "ipucqf8", "is_submitter": "False", "link_id": "t3_xn5lz1", "parent_id": "t3_xn5lz1", "score": "2", "subreddit": "TexasRangers", "subreddit_id": "t5_2rrdy"}, {"author": "ben121frank", "body": "Totally agree with you", "created_utc": "1663902863.0", "edited": "False", "id": "ipk17nx", "is_submitter": "False", "link_id": "t3_xjr84s", "parent_id": "t1_iphr9z3", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "ben121frank", "body": "Hebrew is honestly not bad once you get over the hurdle of learning the new alphabet and writing right to left. The fact that the letters don’t connect (in handwriting or print) makes it a lot easier to read and write than Arabic imo. Vocab is also pretty limited compared to some languages and grammar is not too bad (only 3 tenses and everything follows patterns with not too many exceptions)", "created_utc": "1663767592.0", "edited": "False", "id": "ipbvgw4", "is_submitter": "False", "link_id": "t3_xjr84s", "parent_id": "t3_xjr84s", "score": "5", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "ben121frank", "body": "For years before this came out I would buy regular kraft just for the cheese packets and mix them into gf pasta, it should taste exactly the same but something about the kraft noodles (even the gf ones) just makes it so much better", "created_utc": "1663511514.0", "edited": "False", "id": "ioxj0cv", "is_submitter": "False", "link_id": "t3_xgzpow", "parent_id": "t3_xgzpow", "score": "1", "subreddit": "glutenfree", "subreddit_id": "t5_2qx1l"}, {"author": "ben121frank", "body": "As a character I didn't appreciate Stuckey, but he did give me one of my favorite scenes in the whole series (the interaction between Olivia and Elliott in Zebras)", "created_utc": "1662165761.0", "edited": "False", "id": "imvaw0z", "is_submitter": "False", "link_id": "t3_x3oz0c", "parent_id": "t3_x3oz0c", "score": "1", "subreddit": "SVU", "subreddit_id": "t5_2t476"}, {"author": "ben121frank", "body": "Only 2 that seem like stunt casting and 9 teams of normal people? Never thought I’d see the day again, wow", "created_utc": "1661433561.0", "edited": "False", "id": "ilqaczm", "is_submitter": "False", "link_id": "t3_wworm7", "parent_id": "t3_wworm7", "score": "8", "subreddit": "TheAmazingRace", "subreddit_id": "t5_2stq9"}, {"author": "ben121frank", "body": "The girl who expected her boyfriend not to listen to music and silently mouth lyrics while working bc she could somehow sense it and it was creating a “party atmosphere.” And also didn’t want the bf to have clients over to his studio even tho he was a sculptor and that was their only source of income. Happy ending tho bc he ended up realizing how fucked his situation was and leaving if I recall correctly", "created_utc": "1660934002.0", "edited": "False", "id": "ikyuf3d", "is_submitter": "False", "link_id": "t3_wsag05", "parent_id": "t3_wsag05", "score": "8", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "ben121frank", "body": "Don’t know for sure but it sounds a lot like a vocal warmup exercise \n\nLike the better batter butter one in English", "created_utc": "1660062315.0", "edited": "False", "id": "ijlj9kz", "is_submitter": "False", "link_id": "t3_wjyog1", "parent_id": "t3_wjyog1", "score": "20", "subreddit": "translator", "subreddit_id": "t5_2ss9z"}, {"author": "ben121frank", "body": "Your local library is probably a good place to try, most are free and easy to join and have a large supply of audiobooks that you can check out online and read in your web browser or on an E reader if you have one", "created_utc": "1659881812.0", "edited": "False", "id": "ijba79z", "is_submitter": "False", "link_id": "t3_wi37qg", "parent_id": "t3_wi37qg", "score": "2", "subreddit": "ask", "subreddit_id": "t5_2qhlj"}, {"author": "ben121frank", "body": "Maybe try a grain free cookbook? That shouldn’t have gluten or gluten substitutes", "created_utc": "1659800606.0", "edited": "False", "id": "ij73pox", "is_submitter": "False", "link_id": "t3_whgu03", "parent_id": "t3_whgu03", "score": "1", "subreddit": "glutenfree", "subreddit_id": "t5_2qx1l"}, {"author": "ben121frank", "body": "NTA and she does in fact sound crazy\n\nIt’s not racist at all to try to get the pronunciation correct as you’re doing, I would say it’s much more culturally disrespectful to not try as she is doing", "created_utc": "1659790209.0", "edited": "False", "id": "ij6hh1m", "is_submitter": "False", "link_id": "t3_wh1mvq", "parent_id": "t3_wh1mvq", "score": "1", "subreddit": "AmItheAsshole", "subreddit_id": "t5_2xhvq"}, {"author": "ben121frank", "body": "You think she’d want engagement from non followers since she’s trying to draw in new “students” for her “course”", "created_utc": "1659790045.0", "edited": "False", "id": "ij6h6dm", "is_submitter": "False", "link_id": "t3_wh6mvv", "parent_id": "t3_wh6mvv", "score": "3", "subreddit": "FundieSnarkUncensored", "subreddit_id": "t5_2z8fuj"}, {"author": "ben121frank", "body": "I have no idea sorry, that is one of the more incomprehensible transcription requests I’ve seen posted on here", "created_utc": "1659789864.0", "edited": "False", "id": "ij6guvd", "is_submitter": "False", "link_id": "t3_whdk7l", "parent_id": "t3_whdk7l", "score": "5", "subreddit": "Handwriting", "subreddit_id": "t5_2swz3"}, {"author": "ben121frank", "body": "I would say O’Halloran, not bc he’s the character I miss the most but they just really did not have to do him like that", "created_utc": "1659789707.0", "edited": "False", "id": "ij6gl8n", "is_submitter": "False", "link_id": "t3_whdl7y", "parent_id": "t3_whdl7y", "score": "3", "subreddit": "SVU", "subreddit_id": "t5_2t476"}, {"author": "ben121frank", "body": "As others have said, pretty much every language to some extent. \n\nThe most extreme example I can think of is Arabic, with a lot of vocabulary and uses of grammar being completely different between the formal/written form (FusHa) and the colloquial/spoken form (Ammiya)", "created_utc": "1659754831.0", "edited": "False", "id": "ij52yg0", "is_submitter": "False", "link_id": "t3_wgrs4z", "parent_id": "t3_wgrs4z", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "ben121frank", "body": "Hebrew. Only 9 million speakers so definitely a smaller language but I think it is fun, not too difficult to learn, and also a really musical language. I’ve certainly enjoys learning it", "created_utc": "1659754637.0", "edited": "False", "id": "ij52khk", "is_submitter": "False", "link_id": "t3_wh44xu", "parent_id": "t3_wh44xu", "score": "0", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "ben121frank", "body": "I have two pairs of Keens in different styles and love them both. I’ve done two trips now with a pair of keens as my only shoes. I can’t imagine doing that with any other shoes but they are quick drying enough that I can wear them to the beach in the day then out that night, and it almost feels like two completely different pairs of shoes wearing without vs with socks. They’re also extremely comfortable and more protective than most sandals. Only downside is they can be kinda heavy depending on the style (my Newports are but my evofits are pretty light)\n\nETA I’m not sure how they are on width sorry, but they have a ton of different styles so some may work better for you", "created_utc": "1659754224.0", "edited": "1659754434.0", "id": "ij51r4d", "is_submitter": "False", "link_id": "t3_wh8mxm", "parent_id": "t3_wh8mxm", "score": "5", "subreddit": "HerOneBag", "subreddit_id": "t5_3jnwe"}, {"author": "ben121frank", "body": "I would support trading Lowe if the trade is good but I think that's unlikely, at least to me he seems like the kind of player who is currently providing us more value than trade returns for him would. But idk", "created_utc": "1659735101.0", "edited": "False", "id": "ij3wj0j", "is_submitter": "False", "link_id": "t3_wh2cox", "parent_id": "t3_wh2cox", "score": "1", "subreddit": "TexasRangers", "subreddit_id": "t5_2rrdy"}, {"author": "ben121frank", "body": "At her ridiculous price point 5-10k/month is only 3-5 sales a month lol", "created_utc": "1659734520.0", "edited": "False", "id": "ij3v4ce", "is_submitter": "False", "link_id": "t3_wh0ri6", "parent_id": "t3_wh0ri6", "score": "5", "subreddit": "FundieSnarkUncensored", "subreddit_id": "t5_2z8fuj"}, {"author": "ben121frank", "body": "Personally I support her release not because of her money/status but because I believe her punishment doesn’t fit the crime. I would support the release of any American in a similar situation including the example you mentioned of Mark Fogel. \n\nAlso for what it’s worth OP- WNBA players don’t have very much money or status in the US (more than the average person yes but compared to other celebrities no.) She was literally in Russia to play off season basketball to make more money because WNBA salaries are so low.", "created_utc": "1659709412.0", "edited": "False", "id": "ij22ir2", "is_submitter": "False", "link_id": "t3_wg6eck", "parent_id": "t3_wg6eck", "score": "1", "subreddit": "changemyview", "subreddit_id": "t5_2w2s8"}, {"author": "ben121frank", "body": "You’re literally on a sub for people whose hobby is the Amazing Race you ass clown 🤡", "created_utc": "1659582646.0", "edited": "False", "id": "iivayfz", "is_submitter": "False", "link_id": "t3_wfkkyy", "parent_id": "t1_iiuim55", "score": "2", "subreddit": "TheAmazingRace", "subreddit_id": "t5_2stq9"}, {"author": "ben121frank", "body": "Well it depends, someone who’s between the two you might call a moderate, someone further left than liberal could be a leftist, independent could apply to pretty much anyone", "created_utc": "1659539241.0", "edited": "False", "id": "iisgudp", "is_submitter": "False", "link_id": "t3_wf5723", "parent_id": "t3_wf5723", "score": "1", "subreddit": "NoStupidQuestions", "subreddit_id": "t5_2w844"}, {"author": "ben121frank", "body": "Eclectic or compendium", "created_utc": "1659539112.0", "edited": "False", "id": "iisgil4", "is_submitter": "False", "link_id": "t3_wezpyn", "parent_id": "t3_wezpyn", "score": "2", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "ben121frank", "body": "Nice! I thought it was a Lamy, I have one that looks similar but only the clip is red and the pen body is white", "created_utc": "1659539001.0", "edited": "False", "id": "iisg8c4", "is_submitter": "False", "link_id": "t3_wf80s5", "parent_id": "t1_iiscauj", "score": "2", "subreddit": "Handwriting", "subreddit_id": "t5_2swz3"}, {"author": "ben121frank", "body": "It’s readable for me but I think it’s being influenced by the fact that I know what you wrote, for better feedback I would recommend writing something random/less well known\n\nAlso love your fountain pens, I’m a big pen nerd myself! What is the bottom one, I love red pens so I might wanna look into it for myself", "created_utc": "1659537252.0", "edited": "False", "id": "iisbs5e", "is_submitter": "False", "link_id": "t3_wf80s5", "parent_id": "t3_wf80s5", "score": "2", "subreddit": "Handwriting", "subreddit_id": "t5_2swz3"}, {"author": "ben121frank", "body": "NTA. Cosleeping at 3 is not a huge problem but their plan is apparently cosleeping until she grows up and moves out?? Huge problem and you’re not wrong to point it out, those parents need to sort their shit out", "created_utc": "1659535819.0", "edited": "False", "id": "iis89sz", "is_submitter": "False", "link_id": "t3_wf2jrj", "parent_id": "t3_wf2jrj", "score": "2", "subreddit": "AmItheAsshole", "subreddit_id": "t5_2xhvq"}, {"author": "ben121frank", "body": "Ya I agree, either Elliott and Finn or Detectives Stabler and Tutuola would be fine but it seems disrespectful and just odd not to refer to them the same way", "created_utc": "1659535558.0", "edited": "False", "id": "iis7nby", "is_submitter": "False", "link_id": "t3_wepil5", "parent_id": "t3_wepil5", "score": "3", "subreddit": "SVU", "subreddit_id": "t5_2t476"}, {"author": "ben121frank", "body": "Ohhhh, that (original lol) meaning of groomer went completely over my head for some reason, thanks for the explanation", "created_utc": "1659535234.0", "edited": "False", "id": "iis6vcm", "is_submitter": "False", "link_id": "t3_wemwgr", "parent_id": "t1_iirrj0v", "score": "2", "subreddit": "FundieSnarkUncensored", "subreddit_id": "t5_2z8fuj"}, {"author": "ben121frank", "body": "INFO: Are there any other coworkers present on the work trip that your husband could’ve gone weekend sightseeing with? If they’re the only 2 in Europe I can kinda understand it just being a convenience thing/not wanting to explore alone and wouldn’t necessarily be suspicious personally. But if there’s other coworkers that he specifically chose her over then ya I would be suspicious", "created_utc": "1659527805.0", "edited": "False", "id": "iirrkly", "is_submitter": "False", "link_id": "t3_wex7jl", "parent_id": "t3_wex7jl", "score": "-1", "subreddit": "AmItheAsshole", "subreddit_id": "t5_2xhvq"}, {"author": "ben121frank", "body": "“Joe Biden is a pedophile” is a special one", "created_utc": "1659526957.0", "edited": "False", "id": "iirq3qs", "is_submitter": "False", "link_id": "t3_wekqrf", "parent_id": "t3_wekqrf", "score": "-1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "ben121frank", "body": "Am I the only one who can’t figure out what number 4 means at all?", "created_utc": "1659526563.0", "edited": "False", "id": "iirpfz2", "is_submitter": "False", "link_id": "t3_wemwgr", "parent_id": "t3_wemwgr", "score": "2", "subreddit": "FundieSnarkUncensored", "subreddit_id": "t5_2z8fuj"}, {"author": "ben121frank", "body": "Interesting that it started as “you think the church is obsessed with relationships and marriage??” and ended as “I know who’s obsessed with sex and hookups” completely shifting it away from what it started as", "created_utc": "1659490337.0", "edited": "False", "id": "iiq49h7", "is_submitter": "False", "link_id": "t3_wel27x", "parent_id": "t3_wel27x", "score": "6", "subreddit": "FundieSnarkUncensored", "subreddit_id": "t5_2z8fuj"}, {"author": "ben121frank", "body": "Wasn’t 100% convinced before but now I am. Bring Joey home", "created_utc": "1659459347.0", "edited": "False", "id": "iiny9ik", "is_submitter": "False", "link_id": "t3_wegcwd", "parent_id": "t3_wegcwd", "score": "18", "subreddit": "TexasRangers", "subreddit_id": "t5_2rrdy"}, {"author": "ben121frank", "body": "https://www.columbia.com/p/mens-pfg-tamiami-ii-long-sleeve-shirt-FM7253.html?dwvar_FM7253_color=363\n\nLook into this OP. I love my Columbia fishing shirts and think they meet all your criteria and the style I linked doesn’t have flaps or buttons on the pockets", "created_utc": "1659451978.0", "edited": "False", "id": "iinei93", "is_submitter": "False", "link_id": "t3_we1wqn", "parent_id": "t3_we1wqn", "score": "1", "subreddit": "onebag", "subreddit_id": "t5_301sk"}, {"author": "ben121frank", "body": "Came here to suggest this same thing, I have a couple and love mine. Mine do have snaps on the pockets but they make a lot of different styles so I would look around on the website and see if you can find a style that suits your needs OP", "created_utc": "1659451846.0", "edited": "False", "id": "iine66k", "is_submitter": "False", "link_id": "t3_we1wqn", "parent_id": "t1_iimwhnm", "score": "1", "subreddit": "onebag", "subreddit_id": "t5_301sk"}, {"author": "ben121frank", "body": "On a 5 hour domestic (especially red eye) I wouldn’t necessarily expect there to be a meal service at all so that may be why you’re not getting options  \n\n(And definitely wouldn’t expect it on a 2.5 hour)", "created_utc": "1659402558.0", "edited": "False", "id": "iil27we", "is_submitter": "False", "link_id": "t3_wdifdg", "parent_id": "t3_wdifdg", "score": "1", "subreddit": "americanairlines", "subreddit_id": "t5_2zcaf"}, {"author": "ben121frank", "body": "Our performance is about what I would’ve expected or even slightly better, massive improvement from last year obviously. Our record does not accurately reflect how good our performance has been imo, largely bc of the one run game thing", "created_utc": "1659401334.0", "edited": "False", "id": "iikzgxy", "is_submitter": "False", "link_id": "t3_wdvdmp", "parent_id": "t3_wdvdmp", "score": "2", "subreddit": "TexasRangers", "subreddit_id": "t5_2rrdy"}, {"author": "ben121frank", "body": "I think Kelly for Zavala would be an AWESOME trade, but I’d be surprised if the Dbacks go for it. I know the trade simulator rates them comparably but idk it just seems lopsided to me. I would be ok throwing in someone like Solak to that too. I would hesitate to give up Huff bc he can play a good 1st base which is a position we lack depth at (especially with all the talks of trading Lowe now or soon)", "created_utc": "1659381084.0", "edited": "False", "id": "iijm1hc", "is_submitter": "False", "link_id": "t3_wdn4oh", "parent_id": "t3_wdn4oh", "score": "2", "subreddit": "TexasRangers", "subreddit_id": "t5_2rrdy"}, {"author": "ben121frank", "body": "That was my thought too when I read first read OPs post, but the trade simulator values Huff at 8.2, Kelly at 7.9, and Zavala at 7.6. Idk how much I believe that tho", "created_utc": "1659380930.0", "edited": "False", "id": "iijlnfi", "is_submitter": "False", "link_id": "t3_wdn4oh", "parent_id": "t1_iijjmkn", "score": "1", "subreddit": "TexasRangers", "subreddit_id": "t5_2rrdy"}, {"author": "ben121frank", "body": ">ofc, we could decline a name if the other really didn't like it at all\n\nYTA. Your bf doesn't like the name you chose and you're not following through on the agreement you made", "created_utc": "1659370854.0", "edited": "False", "id": "iiivefw", "is_submitter": "False", "link_id": "t3_wdgwrc", "parent_id": "t3_wdgwrc", "score": "1", "subreddit": "AmItheAsshole", "subreddit_id": "t5_2xhvq"}, {"author": "ben121frank", "body": "I can read this easily. Not necessarily every single letter but enough that my brain fills in the rest and I don't have any trouble. I can't say how you did on speed ofc but I would say you're good on legibility", "created_utc": "1659370255.0", "edited": "False", "id": "iiituv9", "is_submitter": "False", "link_id": "t3_wd9ntk", "parent_id": "t3_wd9ntk", "score": "3", "subreddit": "Handwriting", "subreddit_id": "t5_2swz3"}, {"author": "ben121frank", "body": "Seems like an unpopular answer maybe but I'm going NTA\n\nYes, it's money and he can do with it as he pleases. But in my opinion, consistently lying to OP about something as large as 3 million dollars for 5 years is a perfectly valid reason not to trust him. Makes you wonder what else he might be lying about", "created_utc": "1659369900.0", "edited": "False", "id": "iiisy7t", "is_submitter": "False", "link_id": "t3_wdcn9k", "parent_id": "t3_wdcn9k", "score": "1", "subreddit": "AmItheAsshole", "subreddit_id": "t5_2xhvq"}, {"author": "ben121frank", "body": "Technically no bc they have malt, anecdotally I eat Rice Krispies cereal and treats all the time and never have symptoms. Also look into off brands, I think some of the off/store brands don’t \nhave malt", "created_utc": "1659360861.0", "edited": "False", "id": "iii7in5", "is_submitter": "False", "link_id": "t3_wde23t", "parent_id": "t3_wde23t", "score": "4", "subreddit": "glutenfree", "subreddit_id": "t5_2qx1l"}, {"author": "ben121frank", "body": "I agree he’s not really anything special, I’m just not sure we have a good enough replacement for him rn. But maybe I’m forgetting someone, who would you propose becoming our regular 1st baseman if we trade Lowe?", "created_utc": "1659360544.0", "edited": "False", "id": "iii6uph", "is_submitter": "False", "link_id": "t3_wdbqlb", "parent_id": "t1_iii33j9", "score": "1", "subreddit": "TexasRangers", "subreddit_id": "t5_2rrdy"}, {"author": "ben121frank", "body": "I don’t think Lowe is a good piece to trade rn, looking at our depth at 1B it’s 2 guys who are currently on the IL and Elier Hernandez who is a promising prospect but not ready to be an everyday starter imo. Lowe is also better offensively than he gets credit for a lot of the time imo", "created_utc": "1659353938.0", "edited": "False", "id": "iihuur5", "is_submitter": "False", "link_id": "t3_wdbqlb", "parent_id": "t3_wdbqlb", "score": "2", "subreddit": "TexasRangers", "subreddit_id": "t5_2rrdy"}, {"author": "ben121frank", "body": "Anyone else feel bad for Dunning? I always thought he seemed like a better pitcher than his stats suggest but I didn’t realize until hearing the commentators talk today just how unlucky he is. Yet another quality start without a win for him today", "created_utc": "1659309653.0", "edited": "False", "id": "iifxpcn", "is_submitter": "False", "link_id": "t3_wd1mqy", "parent_id": "t3_wd1mqy", "score": "11", "subreddit": "TexasRangers", "subreddit_id": "t5_2rrdy"}, {"author": "ben121frank", "body": "They better not, I just bought a Seager jersey!", "created_utc": "1659305012.0", "edited": "False", "id": "iifnp2r", "is_submitter": "False", "link_id": "t3_wczfzd", "parent_id": "t3_wczfzd", "score": "7", "subreddit": "TexasRangers", "subreddit_id": "t5_2rrdy"}, {"author": "ben121frank", "body": "Yes, and 3 out of only 4 total across the league", "created_utc": "1659302544.0", "edited": "False", "id": "iifi21s", "is_submitter": "False", "link_id": "t3_wcy8qs", "parent_id": "t1_iifgdfe", "score": "8", "subreddit": "baseball", "subreddit_id": "t5_2qm7u"}, {"author": "ben121frank", "body": "There have been 4 total immaculate innings in baseball this year, and 3 of them have been against the Rangers. Go team!", "created_utc": "1659302280.0", "edited": "False", "id": "iifhfgc", "is_submitter": "False", "link_id": "t3_wcy8qs", "parent_id": "t3_wcy8qs", "score": "8", "subreddit": "baseball", "subreddit_id": "t5_2qm7u"}, {"author": "ben121frank", "body": "Classic rangers bullpen", "created_utc": "1659292801.0", "edited": "False", "id": "iievapy", "is_submitter": "False", "link_id": "t3_wcdg6p", "parent_id": "t3_wcdg6p", "score": "1", "subreddit": "baseball", "subreddit_id": "t5_2qm7u"}, {"author": "ben121frank", "body": "TV/movies certainly make jump scares easier to achieve but to some extent this phenomenon and debate about it has existed long before TV. Look up the difference between horror and terror in gothic literature, you might find it interesting \n\n(To clarify I don’t disagree with your opinion, I prefer terror over horror and jump scares def fit in the second category)", "created_utc": "1659292046.0", "edited": "False", "id": "iieth0k", "is_submitter": "False", "link_id": "t3_wcn4f6", "parent_id": "t3_wcn4f6", "score": "2", "subreddit": "unpopularopinion", "subreddit_id": "t5_2tk0s"}, {"author": "ben121frank", "body": "In my opinion “fuck with” implies intentional, in which case I would agree. But this was an honest (if careless) mistake, and to me going out to eat as a person with celiac means you are accepting the risk of a mistake like this", "created_utc": "1659278738.0", "edited": "False", "id": "iidy2xc", "is_submitter": "False", "link_id": "t3_wcl6eu", "parent_id": "t1_iid87ut", "score": "13", "subreddit": "glutenfree", "subreddit_id": "t5_2qx1l"}, {"author": "ben121frank", "body": "Glad to hear it worked out ok. \n\nPlease do implement changes to reduce the likelihood of this happening again, white and brown liners that you can barely tell the difference between after baking is not really a good solution at all", "created_utc": "1659278592.0", "edited": "False", "id": "iidxqji", "is_submitter": "False", "link_id": "t3_wcl6eu", "parent_id": "t3_wcl6eu", "score": "6", "subreddit": "glutenfree", "subreddit_id": "t5_2qx1l"}, {"author": "ben121frank", "body": "NTA and that is seriously deranged behavior from your wife (way beyond just being an AH). Not sure about the life jacket but the car seat thing could definitely be considered (illegal) child neglect in a lot of places, which is something I would honestly look into bc her disregard for your child’s safety is dangerous", "created_utc": "1659278360.0", "edited": "False", "id": "iidx7th", "is_submitter": "False", "link_id": "t3_wc4t5x", "parent_id": "t3_wc4t5x", "score": "1", "subreddit": "AmItheAsshole", "subreddit_id": "t5_2xhvq"}, {"author": "ben121frank", "body": "Almost posted this here last night bc it really underscores one of the stupidest parts of all this BS. The fact is, she did found a somewhat successful ministry for a very specific target audience. Why isn’t she focusing on teaching other people how to found their own personal ministries, or teaching other skills targeted to her established audience. Not that I want to see her succeed in business lmao but I think she actually might’ve if she had stuck to what she knows. But instead for some reason she thought founding a (nonprofit) ministry made her qualified to teach other people to make online courses(random) as presumably for profit businesses. And look where it’s getting her lol", "created_utc": "1659277550.0", "edited": "False", "id": "iidvery", "is_submitter": "False", "link_id": "t3_wce6uj", "parent_id": "t3_wce6uj", "score": "6", "subreddit": "FundieSnarkUncensored", "subreddit_id": "t5_2z8fuj"}, {"author": "ben121frank", "body": "How sensitive to cross contamination are you? In my experience (southwest US) the majority of restaurants have some gluten free options (gf buns, pasta, corn tortillas etc) but few have dedicated kitchen designs that prevent cross contamination. And sometimes you will see that reflected on menus it’ll say something like “this dish has no gluten containing ingredients but may not be suitable for celiac”", "created_utc": "1659270377.0", "edited": "False", "id": "iidhjow", "is_submitter": "False", "link_id": "t3_wc6mkp", "parent_id": "t3_wc6mkp", "score": "1", "subreddit": "glutenfree", "subreddit_id": "t5_2qx1l"}, {"author": "ben121frank", "body": "Thanks for this comment, I really appreciate it. I do a lot of traveling but most recently where I was experiencing this was in Israel and I do speak Hebrew but I’m not sure how much it helped me just bc I still looked like a foreigner as you said. Oddly tho a lot of Israelis I talked to guessed I was German not American (maybe bc I’m not quite as aggressively tourist as many Americans they see)", "created_utc": "1659213082.0", "edited": "False", "id": "iiasa6x", "is_submitter": "False", "link_id": "t3_wc0pxy", "parent_id": "t1_iiaraor", "score": "2", "subreddit": "malefashionadvice", "subreddit_id": "t5_2r65t"}, {"author": "ben121frank", "body": "Not sure what country you’re in or what their regulations are but I would do your research and be very careful before you start pursuing any of these options, there’s a something like selling on Etsy for example would still constitute work in some countries and they could revoke your visa if they found out/wanted to", "created_utc": "1659212688.0", "edited": "False", "id": "iiardrl", "is_submitter": "False", "link_id": "t3_wbobx1", "parent_id": "t3_wbobx1", "score": "1", "subreddit": "ask", "subreddit_id": "t5_2qhlj"}, {"author": "ben121frank", "body": "On my recent trip yes, at home it’s about 50/50 probably", "created_utc": "1659212059.0", "edited": "False", "id": "iiapxum", "is_submitter": "False", "link_id": "t3_wc0pxy", "parent_id": "t1_iiaopxz", "score": "1", "subreddit": "malefashionadvice", "subreddit_id": "t5_2r65t"}, {"author": "ben121frank", "body": "YTA. Wayyyy better places to save $5 than by making your gf feel like she isn’t worth it to you. Although I will say you’re less of an AH than I expected when I read the title, where I live chips and salsa are pretty much free with unlimited free refills at Mexican restaurants so I thought this was gonna be you trying to control how much food she eats", "created_utc": "1659211373.0", "edited": "False", "id": "iiaodpo", "is_submitter": "False", "link_id": "t3_wbtxk9", "parent_id": "t3_wbtxk9", "score": "1", "subreddit": "AmItheAsshole", "subreddit_id": "t5_2xhvq"}, {"author": "ben121frank", "body": "This actually makes sense and is kinda funny to me. Reminds me of a joke I’ve heard among leftists: \n\n“What’s the difference between republicans and democrats? Both commit war crimes but democrats have pronouns on their name tags while they do it”", "created_utc": "1659211153.0", "edited": "False", "id": "iianw3u", "is_submitter": "False", "link_id": "t3_wc0tvo", "parent_id": "t3_wc0tvo", "score": "3", "subreddit": "terriblefacebookmemes", "subreddit_id": "t5_2tja6"}, {"author": "ben121frank", "body": "Maghibri, Talia, Ruqa yes without too much difficulty, kinda the equivalent of a really weird font but still legible in English. Most of the others I can pick out some but not all of the letters. Square Kufic lol no. \n\n(I am also a relatively new student of Arabic and not a native speaker so someone better than me or a native speaker might be able to read them easier)", "created_utc": "1659210988.0", "edited": "False", "id": "iianj2m", "is_submitter": "False", "link_id": "t3_wc0n0j", "parent_id": "t1_ii9ulyu", "score": "7", "subreddit": "coolguides", "subreddit_id": "t5_310rm"}, {"author": "ben121frank", "body": "Celiac here, and I don’t think $500 as compensation is reasonable, I think replacing the cupcakes and then a giftcard for maybe $50-$100 would be. The reality is that eating food from a restaurant/bakery is always a risk for us, she took that risk and it doesn’t sound like she really took any other precautions either. If it was me going to a place I knew served both GF and gluten cupcakes I would be extremely scrupulous, carefully examine my cupcakes, look for any differences, would notice the 2 different colored wrappers and ask about it as that get commonly indicates allergy vs non allergy. \n\nThat being said, in the future I think you should be more careful and make you’re giving each customer what they ordered, you said you were busy/rushed which I get but this is something worth slowing down for", "created_utc": "1659210304.0", "edited": "False", "id": "iiam00e", "is_submitter": "False", "link_id": "t3_wc3k1w", "parent_id": "t3_wc3k1w", "score": "4", "subreddit": "glutenfree", "subreddit_id": "t5_2qx1l"}, {"author": "ben121frank", "body": "Not trying/wanting to appear richer than I am, just don’t wanna appear broke when I’m not (bc I think it’s leading to subpar service, otherwise I wouldn’t really care how others perceive me)", "created_utc": "1659209655.0", "edited": "False", "id": "iiakiaz", "is_submitter": "False", "link_id": "t3_wc0pxy", "parent_id": "t1_iiae52t", "score": "1", "subreddit": "malefashionadvice", "subreddit_id": "t5_2r65t"}, {"author": "ben121frank", "body": "Israel", "created_utc": "1659209592.0", "edited": "False", "id": "iiakd80", "is_submitter": "False", "link_id": "t3_wc0pxy", "parent_id": "t1_iia84eq", "score": "1", "subreddit": "malefashionadvice", "subreddit_id": "t5_2r65t"}, {"author": "ben121frank", "body": "Came here to say this. Lululemon specific resale groups are pretty popular, and if she’s in a sorority or group like that they may also have their own resale group where people sell Lulu. So quite possible she didn’t pay retail for all of this. But still ridiculously excessive", "created_utc": "1659203291.0", "edited": "False", "id": "iia5tgd", "is_submitter": "False", "link_id": "t3_wbmfny", "parent_id": "t1_ii7nogv", "score": "7", "subreddit": "lululemon", "subreddit_id": "t5_2tma3"}, {"author": "ben121frank", "body": "Not wanting to flaunt my wealth at all, I prefer to dress and live pretty practically, I just want to be taken seriously and not ignored at nice places", "created_utc": "1659203146.0", "edited": "False", "id": "iia5he9", "is_submitter": "False", "link_id": "t3_wc0pxy", "parent_id": "t1_iia4yiv", "score": "1", "subreddit": "malefashionadvice", "subreddit_id": "t5_2r65t"}, {"author": "ben121frank", "body": "How do I make myself look like I have the money that I do? (reposted to Daily Questions, didn’t realize I should post it here oops)\n\nLove browsing this community, have never posted before but hoping y’all can help me with this \n\nFor context, I look very young (college student but look even younger than I am I think) and also am not generally into designer or expensive clothes. My go to daily outfit is a Polo Ralph Lauren button up (I have a large collection in both SS and LS) with tech pants and athletic shoes or hiking sandals or boots depending on weather. But I also have plenty of nicer clothes and can dress this up as the occasion calls, I have RL chinos and slacks, blazers, on up to full suits with J&M loafers. I don’t think being underdressed for occasions is my problem. \n\nI am not generally a big spender in other areas of my life either, I enjoy a relatively simple and nature-based lifestyle. I also prefer to save and donate most of my money. But I do have rather sizable person savings and investment portfolio, and occasionally I enjoy spending some of it, most commonly at nice restaurants. \n\nI was recently aboard for 6 weeks and developed an appreciation for nice wine and views and sought out restaurants for this, but often felt overlooked by waiters and bartenders who would give a lot of attention to more “wealthy looking” (I guess) customers while barely acknowledging me. This was upsetting to me bc I did have money and was intending to spend it. I also tip well (25% usually in the US, varies abroad but always above the expectation) and think I generally carry myself with confidence and kindness. So how do I present myself as someone worth attention to waiters? (Not needing to look like a millionaire, just that I’m not a totally broke college kid) \n\nI like my current wardrobe and don’t really want to significantly adjust it. But I would be very open to buying some kind of nice accessory or a few new items if that would help? Or is it my manner that I need to adjust? Or do I just need to get older lol\n\nAny help/suggestions is appreciated!", "created_utc": "1659202750.0", "edited": "False", "id": "iia4kdp", "is_submitter": "False", "link_id": "t3_wc0pxy", "parent_id": "t3_wc0pxy", "score": "-5", "subreddit": "malefashionadvice", "subreddit_id": "t5_2r65t"}, {"author": "ben121frank", "body": "Even tho it goes against everything in my diehard Rangers fan being, I lowkey am too just bc their turnaround is so wild and their current performance is so statistically improbable, also I don’t think we have much WC chance this year (which I’m fine with bc next year 😈) and I would like to see someone from our division make the postseason besides the Astros", "created_utc": "1659199573.0", "edited": "False", "id": "ii9xdsf", "is_submitter": "False", "link_id": "t3_wbz1vj", "parent_id": "t1_ii9v55z", "score": "48", "subreddit": "baseball", "subreddit_id": "t5_2qm7u"}, {"author": "ben121frank", "body": "Ezekiel “ice in his veins” Duran 😎", "created_utc": "1659155220.0", "edited": "False", "id": "ii7ynbk", "is_submitter": "False", "link_id": "t3_wb54bn", "parent_id": "t3_wb54bn", "score": "11", "subreddit": "TexasRangers", "subreddit_id": "t5_2rrdy"}, {"author": "ben121frank", "body": "As stupid as her and this video are, this weird fake archery motion was a trend on tiktok (a while ago, she is behind as usual) and she is more or less doing it correctly", "created_utc": "1659153498.0", "edited": "False", "id": "ii7vpk7", "is_submitter": "False", "link_id": "t3_wbnrjh", "parent_id": "t3_wbnrjh", "score": "135", "subreddit": "FundieSnarkUncensored", "subreddit_id": "t5_2z8fuj"}, {"author": "ben121frank", "body": "Josh I love you buddy but why did you run there 🤨", "created_utc": "1659152540.0", "edited": "False", "id": "ii7tzum", "is_submitter": "False", "link_id": "t3_wb54bn", "parent_id": "t3_wb54bn", "score": "1", "subreddit": "TexasRangers", "subreddit_id": "t5_2rrdy"}, {"author": "ben121frank", "body": "YTA (or maybe YWBTA bc unless I’m misreading, school hasn’t started yet and you still have the opportunity to reverse course and follow the list) \n\nA lot of commenters have mentioned the extra stress this could cause for your sons teacher and they are absolutely correct, but I also wanna mention there’s really no way this ends well for your son either. Take crayons for example. If your son has 96 colors while the other students all have 24, his classmates will inevitably ask to borrow some of his. If he refuses, his classmates may get upset at him which could make him sad; if he accepts, some would inevitably get lost or broken which could also make him sad. It’s just not a situation you should put the teacher or your son in. \n\nThat being said, tho I think YTA in this particular instance, you don’t sound like an asshole in general; you sound like a great dad and your back to school shopping tradition is really cute. I think you can keep that alive and still give your kids autonomy by allowing them to pick out backpacks, lunchboxes, back to school clothes, snacks for lunches, etc, whatever applies to you. While still following the list for school supply items", "created_utc": "1659151694.0", "edited": "False", "id": "ii7sfrf", "is_submitter": "False", "link_id": "t3_wbf250", "parent_id": "t3_wbf250", "score": "1", "subreddit": "AmItheAsshole", "subreddit_id": "t5_2xhvq"}, {"author": "ben121frank", "body": "Terrible scenario full of terrible people\n\nThe one slight bright spot is that OP is getting their ass absolutely handed to them, the verdicts are primarily ESH with some YTA, I didn’t see a single NTA. Which is as it should be ofc but AITA sometimes has such a weird fixation on “not your responsibility technically therefore you can do wrong” that I was worried people might go NTA saying “not your kid not your problem”", "created_utc": "1659144350.0", "edited": "False", "id": "ii7dpoq", "is_submitter": "False", "link_id": "t3_wb8xww", "parent_id": "t3_wb8xww", "score": "2", "subreddit": "TwoHotTakes", "subreddit_id": "t5_4hlyni"}, {"author": "ben121frank", "body": "They rarely purchase their own tickets anymore so I’m not 100% sure but I would guess they still need tickets for their sound and video person. \n\nIn the olden days of airport scramble it was well known that teams actually had to purchase 4 tickets and the scenes of them asking for 2 were just filmed for the show optics (which I never really understood why they did that, it wasn’t like the race really tried to hide teams having camera crews anywhere else)", "created_utc": "1659141451.0", "edited": "False", "id": "ii77m28", "is_submitter": "False", "link_id": "t3_wb0ql3", "parent_id": "t1_ii6wvj7", "score": "6", "subreddit": "TheAmazingRace", "subreddit_id": "t5_2stq9"}, {"author": "ben121frank", "body": "Mine never has the chance lol, I throw it up before it makes it that far", "created_utc": "1659126669.0", "edited": "False", "id": "ii6a6zg", "is_submitter": "False", "link_id": "t3_wb4j4n", "parent_id": "t3_wb4j4n", "score": "2", "subreddit": "glutenfree", "subreddit_id": "t5_2qx1l"}, {"author": "ben121frank", "body": "NTA, Jenna is a major AH and also sounds not very bright, she lost out on a down payment for her own house bc she wanted to keep a room in her parents house that was doing her no good lmao", "created_utc": "1659001906.0", "edited": "False", "id": "ihyyz4s", "is_submitter": "False", "link_id": "t3_w9fxuq", "parent_id": "t3_w9fxuq", "score": "1", "subreddit": "AmItheAsshole", "subreddit_id": "t5_2xhvq"}, {"author": "ben121frank", "body": "NTA. Even if she wasn’t fat to where it’s damaging your clothes, her taking your clothes out of your closet and wearing them without permission is a serious boundary issue", "created_utc": "1659000985.0", "edited": "False", "id": "ihyxtkm", "is_submitter": "False", "link_id": "t3_w9cjr2", "parent_id": "t3_w9cjr2", "score": "1", "subreddit": "AmItheAsshole", "subreddit_id": "t5_2xhvq"}, {"author": "ben121frank", "body": "The Apothecary series by Maile Meloy?\n\nYour description is very broad, any more details you can remember would be helpful, but hopefully one of the random suggestions in the comments is correct", "created_utc": "1659000798.0", "edited": "False", "id": "ihyxl6l", "is_submitter": "False", "link_id": "t3_w9qexs", "parent_id": "t3_w9qexs", "score": "1", "subreddit": "whatsthatbook", "subreddit_id": "t5_2w9c6"}, {"author": "ben121frank", "body": "NTA. Your ex is not really even a factor here to me, you could’ve just as easily received a security camera notification from your own house or something that Bean had gotten out and you presumably would’ve responded in the same way", "created_utc": "1658974639.0", "edited": "False", "id": "ihxsuyy", "is_submitter": "False", "link_id": "t3_w9f5m9", "parent_id": "t3_w9f5m9", "score": "1", "subreddit": "AmItheAsshole", "subreddit_id": "t5_2xhvq"}, {"author": "ben121frank", "body": "Look into the REI Tarn, REI stuff is generally very good and I know the Tarn is a kids specific bag that I think they make in several sizes", "created_utc": "1658907686.0", "edited": "False", "id": "ihtpjem", "is_submitter": "False", "link_id": "t3_w94v52", "parent_id": "t3_w94v52", "score": "5", "subreddit": "onebag", "subreddit_id": "t5_301sk"}, {"author": "ben121frank", "body": "Hulu has some seasons, it’s a kinda random assortment though, I think it’s the like the early seasons and the most recent seasons and maybe a few in the middle", "created_utc": "1658907188.0", "edited": "False", "id": "ihtowzp", "is_submitter": "False", "link_id": "t3_w989dx", "parent_id": "t3_w989dx", "score": "3", "subreddit": "TheAmazingRace", "subreddit_id": "t5_2stq9"}, {"author": "ben121frank", "body": "As others have said what you are describing is basically an entire genre so it’s unlikely you’ll be able to find it without more details unfortunately \n\nHowever off the top of my head one series I know that specifically involves siblings as opposed to friends is called The Sherlock Files and involves Sherlock Holmes’ great(?) grandchildren solving his unsolved cases. Long shot but does that ring a bell?", "created_utc": "1658906075.0", "edited": "False", "id": "ihtnhy8", "is_submitter": "False", "link_id": "t3_w8pp8w", "parent_id": "t3_w8pp8w", "score": "2", "subreddit": "whatsthatbook", "subreddit_id": "t5_2w9c6"}, {"author": "ben121frank", "body": "I’ve never tried the key lime but this is THE best brand of GF cookie imo. The chocolate chip and snickerdoodle are both incredible", "created_utc": "1658905437.0", "edited": "False", "id": "ihtmoh6", "is_submitter": "False", "link_id": "t3_w8zr30", "parent_id": "t3_w8zr30", "score": "4", "subreddit": "glutenfree", "subreddit_id": "t5_2qx1l"}, {"author": "ben121frank", "body": "The quality is so good it makes me wanna spend $1900 to see more of this for sure 😍\n\n/sarcasm ofc", "created_utc": "1658905066.0", "edited": "False", "id": "ihtm6qc", "is_submitter": "False", "link_id": "t3_w8q7j0", "parent_id": "t3_w8q7j0", "score": "1", "subreddit": "FundieSnarkUncensored", "subreddit_id": "t5_2z8fuj"}, {"author": "ben121frank", "body": "Probably the boomstick, to my knowledge no other stadium is brave/dumb enough for something like it", "created_utc": "1658904945.0", "edited": "False", "id": "ihtm10k", "is_submitter": "False", "link_id": "t3_w8wqgk", "parent_id": "t3_w8wqgk", "score": "2", "subreddit": "baseball", "subreddit_id": "t5_2qm7u"}, {"author": "ben121frank", "body": "This is my favorite stretch of seasons, there’s none in there I don’t enjoy except possibly 20 is pretty bad\n\nMy faves tho are prob 17,18, 14 in that order", "created_utc": "1658904774.0", "edited": "False", "id": "ihtlt2w", "is_submitter": "False", "link_id": "t3_w8z5wv", "parent_id": "t3_w8z5wv", "score": "2", "subreddit": "TheAmazingRace", "subreddit_id": "t5_2stq9"}, {"author": "ben121frank", "body": "Assuming we didn’t spend very much on him this seems like no downside, either he randomly gets good again or he eats innings and takes some of the grunt work off our prospects", "created_utc": "1658862111.0", "edited": "False", "id": "ihr286n", "is_submitter": "False", "link_id": "t3_w87fkd", "parent_id": "t3_w87fkd", "score": "1", "subreddit": "TexasRangers", "subreddit_id": "t5_2rrdy"}, {"author": "ben121frank", "body": "I think Bo Jackson’s is more difficult, just bc there’s more overlap between Shohei’s skills. Like being a pitcher presumably also helps him with knowledge of how to hit pitchers. Whereas there’s not as much for Jackson beyond just general athletic ability", "created_utc": "1658827822.0", "edited": "False", "id": "ihp087d", "is_submitter": "False", "link_id": "t3_w7zmzr", "parent_id": "t3_w7zmzr", "score": "1", "subreddit": "baseball", "subreddit_id": "t5_2qm7u"}, {"author": "ben121frank", "body": "Shitting your pants in the 8th, you’d fit right in in our bullpen as of late", "created_utc": "1658827322.0", "edited": "False", "id": "ihozlth", "is_submitter": "False", "link_id": "t3_w83ur7", "parent_id": "t1_ihnceuo", "score": "3", "subreddit": "baseball", "subreddit_id": "t5_2qm7u"}, {"author": "ben121frank", "body": "I’m surprised Bethany even has the time to be transphobic with how “tirelessly” she claims to be working on her “business”\n\n/sarcasm ofc", "created_utc": "1658820367.0", "edited": "False", "id": "ihor15y", "is_submitter": "False", "link_id": "t3_w7vz2e", "parent_id": "t1_ihlx89r", "score": "14", "subreddit": "FundieSnarkUncensored", "subreddit_id": "t5_2z8fuj"}, {"author": "ben121frank", "body": "I don’t necessarily disagree with your sentiment, but both “suffering” and “of sound mind” are EXTREMELY subjective terms which I think is the primary issue, not the sentiment itself", "created_utc": "1658820256.0", "edited": "False", "id": "ihoqw62", "is_submitter": "False", "link_id": "t3_w7q281", "parent_id": "t3_w7q281", "score": "2", "subreddit": "changemyview", "subreddit_id": "t5_2w2s8"}, {"author": "ben121frank", "body": "My favorite ASL joke is “Where is Beto O’Rourke from?” (or any question that introduces the punch line El Paso that’s just the one I use)\n\nAnd then signing an L on one hand and O on the other and moving the L hand across the O (L pass O)", "created_utc": "1658820033.0", "edited": "False", "id": "ihoqm5i", "is_submitter": "False", "link_id": "t3_w7wufr", "parent_id": "t1_ihn83b2", "score": "15", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "ben121frank", "body": "No wonder you can’t see read it since it’s not a word lol. It was supposed to be עכשיו, I have no idea why I spelled it so terribly wrong, usually my spelling is pretty good \n\nIt was supposed to be עכשיו", "created_utc": "1658779777.0", "edited": "False", "id": "ihmf6ns", "is_submitter": "True", "link_id": "t3_w74a6l", "parent_id": "t1_ihmadcp", "score": "2", "subreddit": "Handwriting", "subreddit_id": "t5_2swz3"}, {"author": "ben121frank", "body": "This sounds similar to a movie called The Village, which may be based on a book I’m not sure", "created_utc": "1658769222.0", "edited": "False", "id": "ihlngzd", "is_submitter": "False", "link_id": "t3_w7pz9k", "parent_id": "t3_w7pz9k", "score": "11", "subreddit": "whatsthatbook", "subreddit_id": "t5_2w9c6"}, {"author": "ben121frank", "body": "Posted!", "created_utc": "1658692511.0", "edited": "False", "id": "ihhkax2", "is_submitter": "False", "link_id": "t3_w6uq9j", "parent_id": "t1_ihhiqb8", "score": "5", "subreddit": "Handwriting", "subreddit_id": "t5_2swz3"}, {"author": "ben121frank", "body": "Love it! I think this has inspired me to post my own Arabic writing, very different style than yours", "created_utc": "1658691140.0", "edited": "False", "id": "ihhh1sh", "is_submitter": "False", "link_id": "t3_w6uq9j", "parent_id": "t3_w6uq9j", "score": "30", "subreddit": "Handwriting", "subreddit_id": "t5_2swz3"}, {"author": "ben121frank", "body": "I think there’s a real chance she sells 0, which will be absolutely hilarious. As far as I can tell and as I understand your post, she has totally failed at establishing herself as a legitimate business or attracting new customers interested in said business. So I think her audience is likely just overlap from her other ventures like GD, and I wouldn’t be surprised if none of those (primarily young women) have $1900 to shell out even if they wanted to", "created_utc": "1658690861.0", "edited": "False", "id": "ihhge50", "is_submitter": "False", "link_id": "t3_w6oeqa", "parent_id": "t3_w6oeqa", "score": "8", "subreddit": "FundieSnarkUncensored", "subreddit_id": "t5_2z8fuj"}, {"author": "ben121frank", "body": "25: Kym & Alli, Adam & Bethany, maybe Tim & TeJay\n\n26: Probably no one, I would like to see Mike & Rochelle\n\n27: Justin & Diana, Denise and James Earl, Tanner & Josh\n\n28: Probably no one, I would say Tyler & Korey if they hadn’t already been brought back, maybe Brodie & Kurt\n\n29: Honestly I think almost anyone in this season except Kevin & Jenn and Shamir & Sara could have a chance \n\n30: Kristi & Jen, maybe Eric & Daniel\n\n31: Nicole & Victor, Becca & Floyd if allowing 3peats\n\n32: Kaylynn & Haley, Hung & Chee \n\n33: Ryan & Dusty, possible Anthony & Spencer or Connie & Sam if they wanted/were able to return at that point", "created_utc": "1658687959.0", "edited": "False", "id": "ihh9klz", "is_submitter": "False", "link_id": "t3_w6vn5n", "parent_id": "t3_w6vn5n", "score": "5", "subreddit": "TheAmazingRace", "subreddit_id": "t5_2stq9"}, {"author": "ben121frank", "body": "Ya I really wish Misti & Jim could’ve had another chance and I’m sure they would’ve loved to too, may he Rest In Peace", "created_utc": "1658686794.0", "edited": "False", "id": "ihh6s0d", "is_submitter": "False", "link_id": "t3_w6vn5n", "parent_id": "t1_ihg52l6", "score": "12", "subreddit": "TheAmazingRace", "subreddit_id": "t5_2stq9"}, {"author": "ben121frank", "body": "It’s an entertaining season for fans of TAR but if it was my introduction it might scare me off lol. Lots of reality TV style drama in that season that isn’t super typical of TAT", "created_utc": "1658686553.0", "edited": "False", "id": "ihh67d6", "is_submitter": "False", "link_id": "t3_w6r6us", "parent_id": "t1_ihfxt1x", "score": "2", "subreddit": "TheAmazingRace", "subreddit_id": "t5_2stq9"}, {"author": "ben121frank", "body": "I would recommend 17. Generally a fan favorite, with an especially likable cast and winners, solid challenges, definitely one of my faves \n\nFor a newer season, 25 is really solid also with a likable cast and mostly good tasks\n\nFor a really early season, many TAR fans regard season 5 as the best ever, for me personally it was good but not super great but your SO might be in the majority and love it", "created_utc": "1658663147.0", "edited": "False", "id": "ihfrmzh", "is_submitter": "False", "link_id": "t3_w6r6us", "parent_id": "t3_w6r6us", "score": "23", "subreddit": "TheAmazingRace", "subreddit_id": "t5_2stq9"}, {"author": "ben121frank", "body": "Ah, in that case I’m really sorry you’re having that experience", "created_utc": "1658589460.0", "edited": "False", "id": "ihbxgfk", "is_submitter": "False", "link_id": "t3_w5zd1c", "parent_id": "t1_ihbvs3z", "score": "4", "subreddit": "unpopularopinion", "subreddit_id": "t5_2tk0s"}, {"author": "ben121frank", "body": "As someone who also has food sensory issues and sometimes also prefers kids menu options, I get where you’re coming from. But I don’t think this is really a problem bc in my experience restaurants are always happy to give me what I want, whether that is a true kids meal or an adult sized (and upcharged) portion of a kids meal or an adult meal modified to my liking. Have you tried asking about these options? Your post kinda makes it seem like you immediately abide by the age limit and don’t even try to get what you want, which is on you not the restaurants", "created_utc": "1658588489.0", "edited": "False", "id": "ihbv8p0", "is_submitter": "False", "link_id": "t3_w5zd1c", "parent_id": "t3_w5zd1c", "score": "8", "subreddit": "unpopularopinion", "subreddit_id": "t5_2tk0s"}, {"author": "ben121frank", "body": "YTA for expecting something your guests to spend so much on something they will probably never use again. And also this is just…really strange. Not hating as puppetry as a hobby (or career?) but your random hobby should not completely dominate every aspect of your wedding including guest behavior as you are describing. If you really go through with this requirement I think you’re gonna end up with no/very few guests at your wedding and I think you would deserve that. Also you say you want people to buy puppets in lieu of wedding gifts…have you really thought that through?? Usually wedding gifts are cash and practical items for your new life together, would you really rather have to buy all of that yourself? \n\nThe good news here is it seems you still have a chance to let up on this ridiculous demand and have a wedding that still incorporates your hobby (I think your puppets and your puppeteer friends’ being involved is totally fine and kinda cute) while also being enjoyable for you guests. Please do that", "created_utc": "1658524529.0", "edited": "False", "id": "ih8pjeh", "is_submitter": "False", "link_id": "t3_w4z647", "parent_id": "t3_w4z647", "score": "1", "subreddit": "AmItheAsshole", "subreddit_id": "t5_2xhvq"}, {"author": "ben121frank", "body": "I just googled Martin Perez jersey and it's the second result on google weirdly. Which is why I thought there might be some chance it wasn't a scam but ¯\\\\\\_(ツ)\\_/¯", "created_utc": "1658329601.0", "edited": "False", "id": "igxbhuu", "is_submitter": "True", "link_id": "t3_w3g5d0", "parent_id": "t1_igwa6ay", "score": "2", "subreddit": "TexasRangers", "subreddit_id": "t5_2rrdy"}, {"author": "ben121frank", "body": "Probably biased but I think globe life would be an actual good candidate, if not 2024 then soon after while it’s still shiny and new. And the always 72 thing would make it an enjoyable experience for fans", "created_utc": "1658310006.0", "edited": "False", "id": "igwad0h", "is_submitter": "False", "link_id": "t3_w39p1u", "parent_id": "t3_w39p1u", "score": "1", "subreddit": "baseball", "subreddit_id": "t5_2qm7u"}, {"author": "ben121frank", "body": "Not trying to defend them at all but among all the stupid outlandish shit they say this one is pretty plausible, kids P’s often do form a strong attachment to babies", "created_utc": "1658309507.0", "edited": "False", "id": "igw9qrz", "is_submitter": "False", "link_id": "t3_w393to", "parent_id": "t3_w393to", "score": "13", "subreddit": "LaBrantFamSnark", "subreddit_id": "t5_2bjprt"}, {"author": "ben121frank", "body": "Ya lol that was among the things that made me suspect it’s probably not legit 😂", "created_utc": "1658308666.0", "edited": "False", "id": "igw8q2a", "is_submitter": "True", "link_id": "t3_w3g5d0", "parent_id": "t1_igw7hjd", "score": "2", "subreddit": "TexasRangers", "subreddit_id": "t5_2rrdy"}, {"author": "ben121frank", "body": "Ya I can’t be mad at him at all, more mad at rangers fans for not voting and MLB for continuing to keep it entirely fan-vote based (I think All stars should be determined by a combination of fan vote and performance metrics)", "created_utc": "1658293815.0", "edited": "False", "id": "igvow0n", "is_submitter": "False", "link_id": "t3_w3aoru", "parent_id": "t3_w3aoru", "score": "2", "subreddit": "TexasRangers", "subreddit_id": "t5_2rrdy"}, {"author": "ben121frank", "body": "My parents are both well educated and generally smart people and the gist of their beliefs are that it is happening but it’s not that bad/the Earth can adapt to handle it/it’s not worth the economic damage/disruption to try to fight it", "created_utc": "1658293550.0", "edited": "False", "id": "igvogvq", "is_submitter": "False", "link_id": "t3_w32gad", "parent_id": "t3_w32gad", "score": "1", "subreddit": "ask", "subreddit_id": "t5_2qhlj"}, {"author": "ben121frank", "body": "I don’t think it’s like morally wrong I just think it’s a dumb business decision. At least with everyone I know the majority of 4 screen plans are not 4 consistent active users who would each buy their own subscription, it’s more one owner/primary user and the other users just pop in varying degrees every now and then. Most likely if sharing gets banned the primary user will pay for a single screen account and the others won’t bother bc it’s not worth that much to them\n\nAlso I think Netflix is using the screen sharing thing as a scapegoat, the real reason they can’t get new subscribers is bc streaming is an over saturated market and their title collection is not the best in the market", "created_utc": "1658293355.0", "edited": "False", "id": "igvo5kd", "is_submitter": "False", "link_id": "t3_w2ugom", "parent_id": "t3_w2ugom", "score": "3", "subreddit": "unpopularopinion", "subreddit_id": "t5_2tk0s"}, {"author": "ben121frank", "body": "YTA. Your son is absolutely right that you prioritized Emma, and also your own convenience it seems, over him. Even after staying at Emma's party til 6, you still could've driven an hour and been there for 30 minutes of Sam's party, but you chose not to. That pretty clearly sends the message that he's not important to you, and he's absolutely justified in having his feelings hurt and not talking to you", "created_utc": "1658233080.0", "edited": "False", "id": "igrop7d", "is_submitter": "False", "link_id": "t3_w2aish", "parent_id": "t3_w2aish", "score": "1", "subreddit": "AmItheAsshole", "subreddit_id": "t5_2xhvq"}, {"author": "ben121frank", "body": "Personally I think celiac varies too much from person to person for this question to have a definitive answer, for myself I have zero reaction from the restaurants of the third type but others might need the first type to be safe", "created_utc": "1657990622.0", "edited": "False", "id": "igex20d", "is_submitter": "False", "link_id": "t3_w0gmdw", "parent_id": "t3_w0gmdw", "score": "2", "subreddit": "glutenfree", "subreddit_id": "t5_2qx1l"}, {"author": "ben121frank", "body": "On a computer maybe YouTube could be comparable bc you could just minimize/hide the YouTube window but on a phone it’s definitely not bc you can’t watch a YouTube video while doing other things on your phone (or having your phone down).\n\nAlso, Spotify is fantastic and unparalleled imo in its ability to make you playlists you’ll like. It makes you 6 each of genre mixes, artist mixes, mood mixes, decade mixes, and daily mixes for a total of 30 new playlists EVERY DAY and also a few more updated weekly. And yes there’s def some overlap between them but for the most people I enjoy listening to almost all of them depending on my mood. YouTube can’t do that at all", "created_utc": "1657971468.0", "edited": "False", "id": "igdtht6", "is_submitter": "False", "link_id": "t3_w078k6", "parent_id": "t3_w078k6", "score": "1", "subreddit": "unpopularopinion", "subreddit_id": "t5_2tk0s"}, {"author": "ben121frank", "body": "Title is making me laugh so much, her fit really does look like something Disney employees working in the frontier themed areas would wear lol", "created_utc": "1657897193.0", "edited": "False", "id": "ig9s5th", "is_submitter": "False", "link_id": "t3_vz7fcv", "parent_id": "t3_vz7fcv", "score": "1", "subreddit": "DuggarsSnark", "subreddit_id": "t5_fl4tn"}, {"author": "ben121frank", "body": "Slight YTA\n\nI respect you for having a vegan food option, but this was not a good solution bc it “punished” all the vegans (by separating them from their families) over the request of just one. If I was one of the other vegans in this situation I would be upset ngl. Obviously that particular cousin is also ridiculous for expecting that accommodation at a wedding, but you should’ve handled it by simply saying “I’m sorry but that won’t be possible, you’re welcome to step out during the food service and return for the reception if you’d like”", "created_utc": "1657896747.0", "edited": "False", "id": "ig9r22b", "is_submitter": "False", "link_id": "t3_vz79pb", "parent_id": "t3_vz79pb", "score": "2", "subreddit": "AmItheAsshole", "subreddit_id": "t5_2xhvq"}, {"author": "ben121frank", "body": "They’re really good! Been 7 years since I’ve had normal pretzels lol so I might be wrong but if my memory serves, they’re a lot close to normal pretzels than the Glutino (and others like it) brand that are more yellow inside", "created_utc": "1657894213.0", "edited": "False", "id": "ig9kytn", "is_submitter": "False", "link_id": "t3_vzjx9p", "parent_id": "t3_vzjx9p", "score": "1", "subreddit": "glutenfree", "subreddit_id": "t5_2qx1l"}, {"author": "ben121frank", "body": "This is a terrible situation you’ve been put in and I’m very sorry for your loss, but YTA. Other commenters have made many great points but one I haven’t seen someone yet: you and Sofia lost your mother which is terrible, but presumably Adi also lost his grandmother? Are you there for him and helping him through his grief like you’ve mentioned doing for Sofia?", "created_utc": "1657822997.0", "edited": "False", "id": "ig5rnuq", "is_submitter": "False", "link_id": "t3_vz0rj2", "parent_id": "t3_vz0rj2", "score": "1", "subreddit": "AmItheAsshole", "subreddit_id": "t5_2xhvq"}, {"author": "ben121frank", "body": "King gizzard and the lizard wizard maybe? They have albums/songs that would qualify as just about every genre", "created_utc": "1657804882.0", "edited": "False", "id": "ig4hjct", "is_submitter": "False", "link_id": "t3_vyaqjc", "parent_id": "t3_vyaqjc", "score": "1", "subreddit": "ifyoulikeblank", "subreddit_id": "t5_2sekf"}, {"author": "ben121frank", "body": "I think Allard should be optioned to the Wood Ducks personally but maybe that’s just me", "created_utc": "1657804585.0", "edited": "False", "id": "ig4gvys", "is_submitter": "False", "link_id": "t3_vydl49", "parent_id": "t3_vydl49", "score": "2", "subreddit": "TexasRangers", "subreddit_id": "t5_2rrdy"}, {"author": "ben121frank", "body": "He looks like a Who from Whoville in this \n\n(From the grinch movie)", "created_utc": "1657780984.0", "edited": "False", "id": "ig3il7y", "is_submitter": "False", "link_id": "t3_vygx2g", "parent_id": "t3_vygx2g", "score": "8", "subreddit": "LaBrantFamSnark", "subreddit_id": "t5_2bjprt"}, {"author": "ben121frank", "body": "I’ve actually heard of a lot of people with dwarfism who don’t like the term “little person” and I can see why, seems strange to me that out of all the possible choices that’s what was picked to be “respectful”", "created_utc": "1657776996.0", "edited": "False", "id": "ig3czgr", "is_submitter": "False", "link_id": "t3_vymk83", "parent_id": "t1_ig395as", "score": "1", "subreddit": "unpopularopinion", "subreddit_id": "t5_2tk0s"}, {"author": "ben121frank", "body": "She’s queer and a loud supporter of queer rights so definitely not a fundie herself lol\n\nPerhaps the video will be about fundies reaction/outrage to her coming out? But I’m not sure fundies would’ve considered her a good role model even before coming out bc her brand is/was very worldly, bright, drawing lots of attention to herself. Also encouraging young girls to embrace childhood/being “childish” whereas fundies seem to love parentifying their young daughters", "created_utc": "1657703171.0", "edited": "False", "id": "ifywze3", "is_submitter": "False", "link_id": "t3_vxmsuv", "parent_id": "t3_vxmsuv", "score": "1", "subreddit": "FundieSnarkUncensored", "subreddit_id": "t5_2z8fuj"}, {"author": "ben121frank", "body": "Usually no, on this trip somewhat bc each beds only had one USB port instead of an outlet. But Apple Watch charges really fast (way faster than a phone) I would just plug it in during my evening downtime then turn it off and wear it while I slept", "created_utc": "1657636710.0", "edited": "False", "id": "ifv1bbt", "is_submitter": "True", "link_id": "t3_vukzqa", "parent_id": "t1_ifulwem", "score": "1", "subreddit": "onebag", "subreddit_id": "t5_301sk"}, {"author": "ben121frank", "body": "Absolutely! My favorite kind of cookie is actually a chocolate chip cookie base with no chocolate chips (basically a sugar cookie but with brown sugar as well as white)", "created_utc": "1657633647.0", "edited": "False", "id": "ifuu3hg", "is_submitter": "False", "link_id": "t3_vwzavd", "parent_id": "t3_vwzavd", "score": "1", "subreddit": "unpopularopinion", "subreddit_id": "t5_2tk0s"}, {"author": "ben121frank", "body": "Not saying this looks authentic Mexican by any stretch but I feel like this is pretty close to standard “white people taco night” food (I know it’s enchiladas in this case) as opposed to the especially heinous cream of crap based variety that is common in fundie recipes", "created_utc": "1657622838.0", "edited": "False", "id": "ifualls", "is_submitter": "False", "link_id": "t3_vwxdxa", "parent_id": "t3_vwxdxa", "score": "3", "subreddit": "FundieSnarkUncensored", "subreddit_id": "t5_2z8fuj"}, {"author": "ben121frank", "body": "I thought about this too although I would go with ESH not NAH bc I think OP is an AH for assuming her boyfriend could come and mom is an AH for putting OP in the situation you described. I totally understand mom not wanting a bf of 6 months coming that no one knows well and potentially causing problems. But I think the most fair solution would be for OP to get to bring a friend like Mom is, otherwise everyone has a buddy to hang out with and OP is all alone. Assuming there’s no issues we don’t know about with the best friend I think vetoing that is an AH move by the mom. Also though OP is an AH and an idiot for trying to resolve a week before the vacation as opposed to a reasonable time to plan it", "created_utc": "1657621617.0", "edited": "False", "id": "ifu8ymm", "is_submitter": "False", "link_id": "t3_vwiyns", "parent_id": "t1_ifqbsiu", "score": "3", "subreddit": "AmItheAsshole", "subreddit_id": "t5_2xhvq"}, {"author": "ben121frank", "body": "I know, my point was not at all to say she was being an activist, sorry if I worded it badly, but only that she might think she is and that she would benefit from an explanation of how her behavior is not helpful and how can she actually be helpful", "created_utc": "1657432660.0", "edited": "False", "id": "ifkdp0r", "is_submitter": "False", "link_id": "t3_vv61qm", "parent_id": "t1_ifj3bzu", "score": "-2", "subreddit": "AmItheAsshole", "subreddit_id": "t5_2xhvq"}, {"author": "ben121frank", "body": "NTA \n\nHowever I almost want to lean NAH, bc while your sisters behavior is definitely unacceptable and needs to be corrected, I also think the internet culture her age group lives in encourages performative activism (and makes young people see it as true activism) and she may genuinely think “calling out” your grandma is the right/helpful thing to do. You seem knowledgeable about the difference and once emotions have settled I think she would benefit from a discussion with you and grandma about how she best be a true activist and make positive change in the world", "created_utc": "1657398062.0", "edited": "False", "id": "ifiioyt", "is_submitter": "False", "link_id": "t3_vv61qm", "parent_id": "t3_vv61qm", "score": "-16", "subreddit": "AmItheAsshole", "subreddit_id": "t5_2xhvq"}, {"author": "ben121frank", "body": "https://canyonglutenfree.com/product/mountain-white/\n\nTarget and Sprouts carry this brand, not sure about the stores you mentioned. The brand makes many products and varieties and all I’ve tried have been good, this variety is my favorite tho bc it’s close to normal size bread", "created_utc": "1657397419.0", "edited": "False", "id": "ifih94l", "is_submitter": "False", "link_id": "t3_vv9vw7", "parent_id": "t3_vv9vw7", "score": "7", "subreddit": "glutenfree", "subreddit_id": "t5_2qx1l"}, {"author": "ben121frank", "body": "I did, it was awesome!", "created_utc": "1657385913.0", "edited": "False", "id": "ifhrgzv", "is_submitter": "True", "link_id": "t3_vukzqa", "parent_id": "t1_iferzg2", "score": "1", "subreddit": "onebag", "subreddit_id": "t5_301sk"}, {"author": "ben121frank", "body": "These are pretty good but don’t taste much like cheezits imo", "created_utc": "1657293206.0", "edited": "False", "id": "ifcpt9k", "is_submitter": "False", "link_id": "t3_vu3m0b", "parent_id": "t1_ifbsl23", "score": "2", "subreddit": "glutenfree", "subreddit_id": "t5_2qx1l"}, {"author": "ben121frank", "body": "Just looked it up… 24 teams, 24 legs, random “stowaway” teams being added midway through, what a mess", "created_utc": "1657173597.0", "edited": "False", "id": "if6ano7", "is_submitter": "False", "link_id": "t3_vs4x4x", "parent_id": "t1_if0g635", "score": "3", "subreddit": "TheAmazingRace", "subreddit_id": "t5_2stq9"}, {"author": "ben121frank", "body": "I’m gonna go with ESH. The friend who brought coke was definitely in the wrong for not asking if anyone was comfortable with that in advance, and I can see how you were blindsided since you said in a comment that no drugs including weed has ever been part of the trip. But you should’ve expected the environment of a beach trip of childless young adults would be at least loud, chaotic, and alcohol fueled. Imo you’re an AH for bringing your baby into that in the first place, even before the coke. Being the first parents in the group puts you at a different stage of life than the others, and you probably shouldn’t be going on these trips until/if more people have kids and they become more family oriented", "created_utc": "1657093677.0", "edited": "False", "id": "if1rt63", "is_submitter": "False", "link_id": "t3_vs8lvw", "parent_id": "t3_vs8lvw", "score": "1", "subreddit": "AmItheAsshole", "subreddit_id": "t5_2xhvq"}, {"author": "ben121frank", "body": "YTA no question \n\nYou chose to take and in the process damage something that was incredibly sentimental and special to your dad for a COSPLAY? Really?? Regarding your updates, if I was the rest of your family I wouldn’t trust you with any of your moms possessions anymore bc you clearly have no respect for them\n\n(Nothing against cosplay btw, just that this was a very inappropriate choice to use for it)", "created_utc": "1657092516.0", "edited": "False", "id": "if1qes5", "is_submitter": "False", "link_id": "t3_vsg4py", "parent_id": "t3_vsg4py", "score": "3", "subreddit": "AmItheAsshole", "subreddit_id": "t5_2xhvq"}, {"author": "ben121frank", "body": "I know there’s a last chance night towards the end of the season where you can choose whatever they have leftover from the different promotions. You might try that, probably some people who bought tickets for the strangers thing game won’t make it and such", "created_utc": "1657050960.0", "edited": "False", "id": "iezfkqp", "is_submitter": "False", "link_id": "t3_vrzsld", "parent_id": "t3_vrzsld", "score": "2", "subreddit": "TexasRangers", "subreddit_id": "t5_2rrdy"}, {"author": "ben121frank", "body": "Adrian Beltre stands out above anyone else to me", "created_utc": "1657049187.0", "edited": "False", "id": "iezb5d6", "is_submitter": "False", "link_id": "t3_vs4jqd", "parent_id": "t3_vs4jqd", "score": "1", "subreddit": "baseball", "subreddit_id": "t5_2qm7u"}, {"author": "ben121frank", "body": "Really dark but also fascinating episode, honestly one of my favorites because the questions it raises are so interesting. Your question \"how was that not enough to throw him in jail?\" is pretty much at the heart of the episode, but ultimately conspiracy charges hinge on intent and planning to commit a specific criminal act, whereas this guy was all vague enough that it could be reasonably interpreted as fantasy. In my perspective the defense's argument was much better than Barba's and the jury did make the right call legally even tho it meant letting a sick freak walk in that particular case", "created_utc": "1657036569.0", "edited": "False", "id": "ieyf95p", "is_submitter": "False", "link_id": "t3_vruozd", "parent_id": "t3_vruozd", "score": "2", "subreddit": "SVU", "subreddit_id": "t5_2t476"}, {"author": "ben121frank", "body": "They’ve since changed it to 6 but it was originally 24 and still was during season 15 I’m pretty sure", "created_utc": "1656946564.0", "edited": "False", "id": "ietowb0", "is_submitter": "False", "link_id": "t3_vqmsz3", "parent_id": "t1_ietdr7m", "score": "3", "subreddit": "TheAmazingRace", "subreddit_id": "t5_2stq9"}, {"author": "ben121frank", "body": "My ideal candidates are people who understand what an amazing opportunity they have and are accordingly excited to be there. I don’t expect perfect knowledge in every situation but I do appreciate when they know reasonable skills(reading a map, driving stick, etc) and are familiar with at least some race history bc it shows they care. As long as they fit that description it doesn’t really make a difference to me if they’re famous, some famous people have fit in that category imo like Tyler & Korey and Kim & Penn", "created_utc": "1656936923.0", "edited": "False", "id": "iet5z71", "is_submitter": "False", "link_id": "t3_vqllqo", "parent_id": "t3_vqllqo", "score": "5", "subreddit": "TheAmazingRace", "subreddit_id": "t5_2stq9"}, {"author": "ben121frank", "body": "Keens would be my recommendation, I have two pairs and love them, great shoe that dries quickly as you said and can handle the beach or hikes. Chacos are not good for the beach bc sand can get stuck in the strap openings and cause them to stop adjusting properly. There are several varieties of Keens. I have newports which is the classic style hiking sandals, a bit bulkier and sturdier, and the evofits which a lot lighter and “sock like fit”, intended specifically as water shoes. But the newports also dry quickly and the evofits would be fine on most hikes, I pretty much wear my two interchangeably", "created_utc": "1656936484.0", "edited": "False", "id": "iet5aa8", "is_submitter": "False", "link_id": "t3_vqlthf", "parent_id": "t3_vqlthf", "score": "1", "subreddit": "onebag", "subreddit_id": "t5_301sk"}, {"author": "ben121frank", "body": "Maria and Tiffany on season 15 couldn’t complete either detour and would have had to take a 24 hour penalty but they were already in last so Phil just eliminated them on the spot. I actually felt really bad for them in that instance bc they made a valiant effort at both but wind and course conditions had made the golf one virtually impossible by the time they arrived and the dancing one started with a random unrelated strength test game that they weren’t strong enough for", "created_utc": "1656927746.0", "edited": "False", "id": "iestrrf", "is_submitter": "False", "link_id": "t3_vqmsz3", "parent_id": "t3_vqmsz3", "score": "3", "subreddit": "TheAmazingRace", "subreddit_id": "t5_2stq9"}, {"author": "ben121frank", "body": "Especially bc he had already gotten all the letters which was the hard part. Dude really just needed to step away for a few minutes, breath, collect his thoughts, then start testing the (not really that many) possible combinations", "created_utc": "1656927464.0", "edited": "False", "id": "iestg3h", "is_submitter": "False", "link_id": "t3_vqmsz3", "parent_id": "t1_iercai4", "score": "3", "subreddit": "TheAmazingRace", "subreddit_id": "t5_2stq9"}, {"author": "ben121frank", "body": "One of the hostels I stayed in last summer for 2 nights in a 4 person room but they still had all the rooms at half capacity for Covid. First night it was just me. Second night an older woman (like at least 60) I’m guessing comes in fairly late and after settling in immediately starts watching what I hope was anime on her phone at loud volume. I’m not very familiar with anime so idk but some of the noises seemed pretty suspicious to where I think it may have more like hentai type lol. I handled it by ignoring it lol", "created_utc": "1656927271.0", "edited": "False", "id": "iest878", "is_submitter": "False", "link_id": "t3_vr1ax4", "parent_id": "t3_vr1ax4", "score": "19", "subreddit": "HerOneBag", "subreddit_id": "t5_3jnwe"}, {"author": "ben121frank", "body": "iPhone XR, iOS is updated to the latest 15.5. I have been getting this message on and off for many months now, but it seems to have recently gotten increasingly more frequent. If I click Details, it takes me to a page showing the certificate is expired but with no option to do anything about it besides exit the page. If I click Cancel the message just goes away. Anyone know what this is or how to fix it? At present it doesn’t appear to be having any negative effect besides just annoying me with the error message randomly popping up but I also don’t understand it and don’t know if it could be potentially harmful, want to resolve it either way", "created_utc": "1656779150.0", "edited": "False", "id": "ielcich", "is_submitter": "True", "link_id": "t3_vpvbvl", "parent_id": "t3_vpvbvl", "score": "1", "subreddit": "applehelp", "subreddit_id": "t5_2rfbh"}, {"author": "ben121frank", "body": "Torso length is the more important measurement for bags than overall height so start by measuring yours and comparing it to size charts for many bags you can find online. I would also recommend looking into (older) kids bags from the popular manufacturers bc they’re generally the same features and quality just smaller and might work for you depending on the measurements", "created_utc": "1656745174.0", "edited": "False", "id": "iejua4k", "is_submitter": "False", "link_id": "t3_vpdhtf", "parent_id": "t3_vpdhtf", "score": "3", "subreddit": "HerOneBag", "subreddit_id": "t5_3jnwe"}, {"author": "ben121frank", "body": "Possibly? It's definitely not the standard race flag marker but it could possibly be part of the red and yellow arrows that they sometimes use", "created_utc": "1656693216.0", "edited": "False", "id": "iegxlbo", "is_submitter": "False", "link_id": "t3_voyhx1", "parent_id": "t3_voyhx1", "score": "5", "subreddit": "TheAmazingRace", "subreddit_id": "t5_2stq9"}, {"author": "ben121frank", "body": "Not sure if anyone else here also loves r/DuggarsSnark but this reminds me of Josh Duggar who said “what’s this about? Has someone here been downloading child p***?” when the feds came to raid him😂", "created_utc": "1656573873.0", "edited": "False", "id": "ieahy2u", "is_submitter": "False", "link_id": "t3_vnvavr", "parent_id": "t3_vnvavr", "score": "6", "subreddit": "SVU", "subreddit_id": "t5_2t476"}, {"author": "ben121frank", "body": "Some queer people don’t support marriage equality because they think it helps to assimilate gay people into straight society and not actually achieve liberation from the restrictive conditions of said society. \n\nAlthough I’m not sure how likely that is to be Michelle’s sisters reasoning", "created_utc": "1656573296.0", "edited": "False", "id": "ieah7xx", "is_submitter": "False", "link_id": "t3_vndo35", "parent_id": "t3_vndo35", "score": "6", "subreddit": "DuggarsSnark", "subreddit_id": "t5_fl4tn"}, {"author": "ben121frank", "body": "Great setup! One potential issue I notice: is there gonna be enough space for the 2 jackets in your worn outfit when you’re not wearing them? Presumably you would want to be wearing 1 or none sometimes on your trip", "created_utc": "1656496459.0", "edited": "False", "id": "ie612uw", "is_submitter": "False", "link_id": "t3_vn43xv", "parent_id": "t3_vn43xv", "score": "4", "subreddit": "onebag", "subreddit_id": "t5_301sk"}, {"author": "ben121frank", "body": "Oh good to know! I was definitely confused when I saw that bc their behavior on the show seemed like just friends, I guess someone should edit the wiki lol", "created_utc": "1656447437.0", "edited": "False", "id": "ie3kyzb", "is_submitter": "False", "link_id": "t3_vmlf5m", "parent_id": "t1_ie1ujtn", "score": "2", "subreddit": "TheAmazingRace", "subreddit_id": "t5_2stq9"}, {"author": "ben121frank", "body": "I got that impression too from watching but on the wiki they’re listed as “dating violinists” so I’m actually not sure about them", "created_utc": "1656420989.0", "edited": "False", "id": "ie1sg0u", "is_submitter": "False", "link_id": "t3_vmlf5m", "parent_id": "t1_ie1naab", "score": "8", "subreddit": "TheAmazingRace", "subreddit_id": "t5_2stq9"}, {"author": "ben121frank", "body": "Hard question, to me he’s in the gray area of being a good but not fantastic player where his trade value is probably lower than the value he currently gives us. But at the same time we should have his spot covered easily and it might be better to pick up a slightly worse player in a different position like SP or OF", "created_utc": "1655824273.0", "edited": "False", "id": "id6uqqy", "is_submitter": "False", "link_id": "t3_vh00dv", "parent_id": "t3_vh00dv", "score": "2", "subreddit": "TexasRangers", "subreddit_id": "t5_2rrdy"}, {"author": "ben121frank", "body": "Lol ok", "created_utc": "1655808771.0", "edited": "False", "id": "id61yao", "is_submitter": "False", "link_id": "t3_vgw569", "parent_id": "t1_id61hqu", "score": "3", "subreddit": "TheAmazingRace", "subreddit_id": "t5_2stq9"}, {"author": "ben121frank", "body": "Appropriately rated imo as an average early-mid boot. I do think they had some racing ability and maybe would’ve gone farther if they had focused on the race objectives rather than their stupid constructed “twin hunt” lol", "created_utc": "1655808277.0", "edited": "False", "id": "id61bfe", "is_submitter": "False", "link_id": "t3_vgw569", "parent_id": "t3_vgw569", "score": "5", "subreddit": "TheAmazingRace", "subreddit_id": "t5_2stq9"}, {"author": "ben121frank", "body": "Ordering on the app and doing curbside delivery is the way to go. You can look at the menu as long as you want, still don’t have to get out of your car, and usually way faster than drive through in my experience", "created_utc": "1655572837.0", "edited": "False", "id": "icuofzu", "is_submitter": "False", "link_id": "t3_vf8luk", "parent_id": "t3_vf8luk", "score": "1", "subreddit": "unpopularopinion", "subreddit_id": "t5_2tk0s"}, {"author": "ben121frank", "body": "If you don’t like him now you probably never will bc he doesn’t really develop/grow as a character at all. \n\nFor me I always just found him “there”, too boring to have any strong emotions about", "created_utc": "1655542947.0", "edited": "False", "id": "ictbgvs", "is_submitter": "False", "link_id": "t3_veutsq", "parent_id": "t3_veutsq", "score": "4", "subreddit": "SVU", "subreddit_id": "t5_2t476"}, {"author": "ben121frank", "body": "I might get excommunicated from the sub for this lol, but I enjoyed season 24. \n\nWas it the best season ever? No, far from it, but that doesn’t automatically make it terrible. \n\nShould they have picked more deserving returnees and less 3 timers? Yes, but the casting in my opinion still put entertaining teams that I enjoyed watching. \n\nWe’re the winners annoying? Ya kinda, but their whining did not ruin the season to me and I think people overlook how objectively good of a team they were and how great their redemption arc is. \n\nOverall I think people get way too caught up in hating it for what it could’ve been, which yes it could’ve been way way better, instead of fairly judging the actual product on the screen. At the end of the day to me I still got to watch people run around the world on a giant adventure which is why I love TAR so I still enjoyed it", "created_utc": "1655470136.0", "edited": "False", "id": "icpc2kw", "is_submitter": "False", "link_id": "t3_ve3fo5", "parent_id": "t3_ve3fo5", "score": "8", "subreddit": "TheAmazingRace", "subreddit_id": "t5_2stq9"}, {"author": "ben121frank", "body": "This season honestly I would say trying to steal 3rd for no discernible reason and then looking surprised pikachu when the runner gets thrown out and puts us in a much worse situation than before", "created_utc": "1655041010.0", "edited": "False", "id": "ic346mf", "is_submitter": "False", "link_id": "t3_va9q74", "parent_id": "t3_va9q74", "score": "1", "subreddit": "baseball", "subreddit_id": "t5_2qm7u"}, {"author": "ben121frank", "body": "I would say Season 8. The route was not world travel like other seasons and many people hate that, but I think an “American road-trip” season could’ve been cool if done right. The main issue for me was that they seemingly defined a family as an any 4 people who were related, which made for some ridiculously uneven team matchups that effectively took all the suspense and real competition out of it. Most predictable winner of any season imo, and also trying to create tasks that an 8 year and an adult can be equally good at leads to really lame tasks like climbing a big chair lol", "created_utc": "1655040376.0", "edited": "False", "id": "ic332he", "is_submitter": "False", "link_id": "t3_vaa5pd", "parent_id": "t3_vaa5pd", "score": "5", "subreddit": "TheAmazingRace", "subreddit_id": "t5_2stq9"}, {"author": "ben121frank", "body": "I’ve had those, they are a good snack but don’t replicate the cheezit flavor in my opinion", "created_utc": "1655005559.0", "edited": "False", "id": "ic1td0m", "is_submitter": "False", "link_id": "t3_v9ro81", "parent_id": "t1_ic1qb9m", "score": "2", "subreddit": "glutenfree", "subreddit_id": "t5_2qx1l"}, {"author": "ben121frank", "body": "I know we lead the league in steals but I assume most or all of that is coming from stealing 2nd? Not saying it hasn’t happened but every single time I’ve seen us to try steal 3rd specifically it hasn’t worked", "created_utc": "1655005512.0", "edited": "False", "id": "ic1tac4", "is_submitter": "False", "link_id": "t3_v9r9gt", "parent_id": "t1_ic0fytt", "score": "1", "subreddit": "TexasRangers", "subreddit_id": "t5_2rrdy"}, {"author": "ben121frank", "body": "Why tf do we keep trying to steal 3rd?? Have we succeeded even once?", "created_utc": "1654979030.0", "edited": "False", "id": "ic0fp45", "is_submitter": "False", "link_id": "t3_v9r9gt", "parent_id": "t3_v9r9gt", "score": "2", "subreddit": "TexasRangers", "subreddit_id": "t5_2rrdy"}, {"author": "ben121frank", "body": "I think the impact of social media (and even the internet more broadly) is huge in this phenomenon. Whether or not more bad things are happening everyday now than 50 years ago is hard to say, but the difference is now we can instantaneously know about every bad thing that happens anywhere in the world. And that is such a heavy thing on the mind", "created_utc": "1654960253.0", "edited": "False", "id": "ibzbpkp", "is_submitter": "False", "link_id": "t3_v9l0j6", "parent_id": "t3_v9l0j6", "score": "1", "subreddit": "NoStupidQuestions", "subreddit_id": "t5_2w844"}, {"author": "ben121frank", "body": "Golf fish and cheezits, but I still miss them. Plenty of awesome gluten free snacks but no good substitute for these specific products", "created_utc": "1654958904.0", "edited": "False", "id": "ibz8wfj", "is_submitter": "False", "link_id": "t3_v9ro81", "parent_id": "t3_v9ro81", "score": "15", "subreddit": "glutenfree", "subreddit_id": "t5_2qx1l"}, {"author": "ben121frank", "body": "“Jenna is not my responsibility” I actually agree with you on that OP, but the thing is, they are not asking you to incur any additional responsibility bc of her. You would already be driving to the camp and back home to Madison and Jenna’s house, so picking up Jenna too adds literally nothing but an extra person in the car. Idk what your issues with your ex are but regardless, the primary victim of your vindictiveness would be a 14 year old who has done nothing wrong. \n\nYTA. Big time. I feel sorry for Madison, she deserves a better parent", "created_utc": "1654919149.0", "edited": "False", "id": "ibxrfse", "is_submitter": "False", "link_id": "t3_v9myy9", "parent_id": "t3_v9myy9", "score": "2", "subreddit": "AmItheAsshole", "subreddit_id": "t5_2xhvq"}, {"author": "ben121frank", "body": "THE ANGELS DID LITERALLY EVERYTHING IN THEIR POWER TO GIVE US SECOND IN THE AL WEST AND YET WE STILL COULDNT CAPITALIZE ON IT. CLASSIC RANGERS MOVE", "created_utc": "1654878854.0", "edited": "False", "id": "ibvfm1z", "is_submitter": "False", "link_id": "t3_v9az24", "parent_id": "t3_v9az24", "score": "30", "subreddit": "baseball", "subreddit_id": "t5_2qm7u"}, {"author": "ben121frank", "body": "Classic Rangers, we were literally handed the opportunity for 2nd place on a silver platter and yet somehow still squandered it", "created_utc": "1654871102.0", "edited": "False", "id": "ibux8ot", "is_submitter": "False", "link_id": "t3_v8sgnz", "parent_id": "t3_v8sgnz", "score": "0", "subreddit": "baseball", "subreddit_id": "t5_2qm7u"}, {"author": "ben121frank", "body": "Lmao what is the context for this line/what episode", "created_utc": "1654751754.0", "edited": "False", "id": "ibp6zct", "is_submitter": "False", "link_id": "t3_v86nbu", "parent_id": "t1_ibp44q1", "score": "3", "subreddit": "SVU", "subreddit_id": "t5_2t476"}, {"author": "ben121frank", "body": "“So I’m arrested for…thinking?” \n\nFrom thought criminal, otherwise a very dark and creepy episode but the beginning part with the low level perp is comedy gold", "created_utc": "1654751607.0", "edited": "False", "id": "ibp6rwq", "is_submitter": "False", "link_id": "t3_v86nbu", "parent_id": "t3_v86nbu", "score": "11", "subreddit": "SVU", "subreddit_id": "t5_2t476"}, {"author": "ben121frank", "body": "I keep them frozen then I microwave them first on defrost for 1:30 then on regular for 0:30 ish (sometimes more if it’s not warm enough). Times might vary depending on your microwave but doing defrost first really helps", "created_utc": "1654746971.0", "edited": "False", "id": "ibozmkk", "is_submitter": "False", "link_id": "t3_v86bo1", "parent_id": "t1_iboqxzs", "score": "1", "subreddit": "glutenfree", "subreddit_id": "t5_2qx1l"}, {"author": "ben121frank", "body": "Elvis Andrus. He was my favorite Ranger for 10 seasons from when I first became a fan to when we traded him. So even tho he’s our divisional rival now I still like to see him play well", "created_utc": "1654705301.0", "edited": "False", "id": "ibmhx8k", "is_submitter": "False", "link_id": "t3_v7rpqa", "parent_id": "t3_v7rpqa", "score": "1", "subreddit": "baseball", "subreddit_id": "t5_2qm7u"}, {"author": "ben121frank", "body": "SUSTO, Rayland Baxter, Johnny Flynn, Wilderado, Blitzen Trapper, John Prine, The Avett Brothers, Andrew Montana, Dawes, Houndmouth, Bronze Radio Return, Birdtalker, Langhorne Slim, Watchhouse (formerly Mandolin Orange)", "created_utc": "1654703988.0", "edited": "False", "id": "ibmesyg", "is_submitter": "False", "link_id": "t3_v7cpof", "parent_id": "t3_v7cpof", "score": "1", "subreddit": "ifyoulikeblank", "subreddit_id": "t5_2sekf"}, {"author": "ben121frank", "body": "ESH. Your first reason is totally valid in my opinion, she would be endangering you and your parents (in addition to herself ofc) and she sucks for that. But your second reason makes you suck, she is an adult and your opinions about hookup culture don’t get to control her life.", "created_utc": "1654558506.0", "edited": "False", "id": "ibfdg2j", "is_submitter": "False", "link_id": "t3_v6fqjr", "parent_id": "t3_v6fqjr", "score": "1", "subreddit": "AmItheAsshole", "subreddit_id": "t5_2xhvq"}, {"author": "ben121frank", "body": "There’s quite a few, sometimes if all teams choose one side of a detour then they will just air it as a route info and not waste time showing the unused side. \n\nOne example I can think off the top of my head is season 3 leg 10 teams had to run into a fountain to grab a clue and it was presented as route info but they clearly had red roadblock clues", "created_utc": "1654557192.0", "edited": "False", "id": "ibfaudj", "is_submitter": "True", "link_id": "t3_v2uxyj", "parent_id": "t1_iauzbf9", "score": "2", "subreddit": "TheAmazingRace", "subreddit_id": "t5_2stq9"}, {"author": "ben121frank", "body": "Question: “Who looked like they were gonna cry?”\n\nMy thought process: hmm I don’t actually know but probably Olivia bc when does she not look like she could cry\n\nAnd I was right😌", "created_utc": "1654556412.0", "edited": "False", "id": "ibf9936", "is_submitter": "False", "link_id": "t3_v6ea0d", "parent_id": "t3_v6ea0d", "score": "10", "subreddit": "SVU", "subreddit_id": "t5_2t476"}, {"author": "ben121frank", "body": "I had it last summer. I think it was chicken and lentils for dinner and yogurt and fruit for breakfast, they had GF rolls and I think pudding for dessert. Even had a GF sandwich when they brought out the afternoon tea course. Honestly I was pretty impressed, I mean it was airline food but it didn’t seem any worse than the non GF meals around me", "created_utc": "1654534579.0", "edited": "False", "id": "ibdvxwr", "is_submitter": "False", "link_id": "t3_v66dr6", "parent_id": "t3_v66dr6", "score": "14", "subreddit": "glutenfree", "subreddit_id": "t5_2qx1l"}, {"author": "ben121frank", "body": "Yes. At some point not all that long ago commentators said he was yet to throw out a runner this season. Not sure if that’s still true but I don’t think I’ve seen it yet and I watch most games", "created_utc": "1654461838.0", "edited": "False", "id": "ibaigz9", "is_submitter": "False", "link_id": "t3_v57lmg", "parent_id": "t1_ibafvfo", "score": "1", "subreddit": "TexasRangers", "subreddit_id": "t5_2rrdy"}, {"author": "ben121frank", "body": "The old El Paso ones are really good but googling might only be available in UK? I got them off Amazon fresh UK. Not sure where you’re located", "created_utc": "1654456604.0", "edited": "False", "id": "iba7ls5", "is_submitter": "False", "link_id": "t3_v5jtvk", "parent_id": "t3_v5jtvk", "score": "1", "subreddit": "glutenfree", "subreddit_id": "t5_2qx1l"}, {"author": "ben121frank", "body": "Next roster move: option Martín to the Down East Wood Ducks. \n\n(Obviously) joking, excited about these moves and that we are not afraid to get rid of guys who aren’t performing", "created_utc": "1654455960.0", "edited": "False", "id": "iba69an", "is_submitter": "False", "link_id": "t3_v5gb3k", "parent_id": "t3_v5gb3k", "score": "1", "subreddit": "TexasRangers", "subreddit_id": "t5_2rrdy"}, {"author": "ben121frank", "body": "Seeing this and another in the sub today I believe this is the second suspected team that’s from >!Big Brother.!< That is interesting; I don’t necessarily mind it but I really hope they chose teams that are actually excited to race and will give it the appreciation it deserves", "created_utc": "1654230076.0", "edited": "False", "id": "ib00t6p", "is_submitter": "False", "link_id": "t3_v3q98m", "parent_id": "t3_v3q98m", "score": "7", "subreddit": "TheAmazingRace", "subreddit_id": "t5_2stq9"}, {"author": "ben121frank", "body": "Marshall and Lance are probably the most unpleasant team I’ve ever watched, I hated them so much. Although granted I haven’t season S6 which I know has many unpleasant characters", "created_utc": "1654209816.0", "edited": "False", "id": "iayvkdq", "is_submitter": "False", "link_id": "t3_v3iz86", "parent_id": "t1_iayj294", "score": "21", "subreddit": "TheAmazingRace", "subreddit_id": "t5_2stq9"}, {"author": "ben121frank", "body": "Lots of threads on here recently about adults with allergies and/or dietary preferences who think their food needs are everyone else’s problem but their own. Lol. If she needs a restaurant with vegetarian options it’s up to her to research that and communicate it with others. From someone who is 100% GF not by choice. NTA", "created_utc": "1654207449.0", "edited": "False", "id": "iayqaq6", "is_submitter": "False", "link_id": "t3_v2uvh7", "parent_id": "t3_v2uvh7", "score": "1", "subreddit": "AmItheAsshole", "subreddit_id": "t5_2xhvq"}, {"author": "ben121frank", "body": "NTA at all. Great on you for remembering her allergy and stopping her from eating the possibly contaminated jam, but honestly even if you hadn’t stopped her you wouldn’t be in the wrong. Speaking as a person with an allergy it is her responsibility to know what she can’t eat including considering cross contamination, that responsibility shouldn’t fall on you at all", "created_utc": "1654202808.0", "edited": "False", "id": "iayfzts", "is_submitter": "False", "link_id": "t3_v340jk", "parent_id": "t3_v340jk", "score": "1", "subreddit": "AmItheAsshole", "subreddit_id": "t5_2xhvq"}, {"author": "ben121frank", "body": "I’m confused why everyone is pissed at him, did he do something egregiously bad/stupid besides failing to get on base or are we just mad he couldn’t get on?", "created_utc": "1654144902.0", "edited": "False", "id": "iavkkfj", "is_submitter": "False", "link_id": "t3_v30eot", "parent_id": "t1_iavhpfg", "score": "6", "subreddit": "TexasRangers", "subreddit_id": "t5_2rrdy"}, {"author": "ben121frank", "body": "Choi was definitely due for one after we robbed him twice on Monday lol. Honestly surprised he went for 2 after getting thrown out trying on a similar hit Monday", "created_utc": "1654142354.0", "edited": "False", "id": "iavggkn", "is_submitter": "False", "link_id": "t3_v2ffb9", "parent_id": "t3_v2ffb9", "score": "6", "subreddit": "TexasRangers", "subreddit_id": "t5_2rrdy"}, {"author": "ben121frank", "body": "I respect aggressive base running but I think we’re getting a bit too aggressive to where it’s just dumb recently. I love Kole but he’s not fast though to have much of a chance. Also multiple smooth brained attempts to steal 3rd recently", "created_utc": "1654132240.0", "edited": "False", "id": "iauwus8", "is_submitter": "False", "link_id": "t3_v2ffb9", "parent_id": "t3_v2ffb9", "score": "3", "subreddit": "TexasRangers", "subreddit_id": "t5_2rrdy"}, {"author": "ben121frank", "body": "I have celiac and personally drink any/all light beers  without pain or worries, but can’t necessarily recommend it to others bc I think it’s all about personal sensitivity. For me I am very low sensitivity celiac, I eat strictly GF but don’t worry about cross contamination. \n\nAlso FWIW some research suggests that it’s still damaging in the long run even if it’s not giving you any immediate reaction", "created_utc": "1654103177.0", "edited": "False", "id": "iat2g2z", "is_submitter": "False", "link_id": "t3_v2idey", "parent_id": "t3_v2idey", "score": "0", "subreddit": "glutenfree", "subreddit_id": "t5_2qx1l"}, {"author": "ben121frank", "body": "Glad to see Kole getting the recognition he deserves for his May performance. As someone else said I’m not sure if it’s sustainable but the turnaround is crazy, from how he’s gonna get out this time? in April to where’s he gonna hit it this time? in May", "created_utc": "1653936302.0", "edited": "False", "id": "iakomfh", "is_submitter": "False", "link_id": "t3_v11o78", "parent_id": "t3_v11o78", "score": "3", "subreddit": "baseball", "subreddit_id": "t5_2qm7u"}, {"author": "ben121frank", "body": "The whole Noah storyline in that episode was a mess, way too much going on and not enough screen time/attention to cover any of it. It seemed like the dog cage was just setting up for him coming out as bi but there would be so many easier and less concerning ways to set that up. And the dialogue in his coming out scene also made no sense", "created_utc": "1653916228.0", "edited": "False", "id": "iajhd53", "is_submitter": "False", "link_id": "t3_v0v5my", "parent_id": "t3_v0v5my", "score": "10", "subreddit": "SVU", "subreddit_id": "t5_2t476"}, {"author": "ben121frank", "body": "Not sure if I fully agree but it is certainly fun that this is a plausible post and not definite satire like it would’ve been 2 years ago lol. \n\nOur play in the month of May has been fantastic and in isolation definitely playoff worthy. The question is whether this play is indicative of where we are as a team or if it’s just a hot streak that we will fall off of. And I’m honestly not sure. If we continue to play at this level (15-9 in May thus far) through maybe the all star break then I would be inclined to agree with you.", "created_utc": "1653787426.0", "edited": "False", "id": "iadmnr2", "is_submitter": "False", "link_id": "t3_uztatw", "parent_id": "t3_uztatw", "score": "1", "subreddit": "TexasRangers", "subreddit_id": "t5_2rrdy"}, {"author": "ben121frank", "body": "I keep noticing how extremely empty the stadium looks, are the As just not a big deal in Oakland or what?", "created_utc": "1653622381.0", "edited": "False", "id": "ia5h09y", "is_submitter": "False", "link_id": "t3_uy7vj6", "parent_id": "t3_uy7vj6", "score": "2", "subreddit": "TexasRangers", "subreddit_id": "t5_2rrdy"}, {"author": "ben121frank", "body": "The Austrian boys choir roadblock(or a similarly harshly judging singing challenge) would get me. I have zero singing ability", "created_utc": "1653579874.0", "edited": "False", "id": "ia2t3jl", "is_submitter": "False", "link_id": "t3_ux7vfq", "parent_id": "t3_ux7vfq", "score": "3", "subreddit": "TheAmazingRace", "subreddit_id": "t5_2stq9"}, {"author": "ben121frank", "body": "I think I have done enough refreshing for a bit so I am off to watch an episode of SVU, watching Liv and Elliot take down creeps like Pest always makes me feel better lol. Catch you guys later, hopefully a sentence by the time I return 🤞🏻", "created_utc": "1653507159.0", "edited": "False", "id": "i9z3iql", "is_submitter": "False", "link_id": "t3_uxoz1b", "parent_id": "t3_uxoz1b", "score": "13", "subreddit": "DuggarsSnark", "subreddit_id": "t5_fl4tn"}, {"author": "ben121frank", "body": "Lol that’s how my phone autocorrected it at first too", "created_utc": "1653506321.0", "edited": "False", "id": "i9z1gdr", "is_submitter": "False", "link_id": "t3_uxogfz", "parent_id": "t1_i9z0yv5", "score": "2", "subreddit": "DuggarsSnark", "subreddit_id": "t5_fl4tn"}, {"author": "ben121frank", "body": "Do any of the lawyer snarkers or anyone have an idea what’s happening in court right now? My understanding was they already settled all the objections pre-recess and now they’ve been for back in court for over an hour now right? So what else do they still have to do?", "created_utc": "1653506107.0", "edited": "False", "id": "i9z0x9d", "is_submitter": "False", "link_id": "t3_uxogfz", "parent_id": "t3_uxogfz", "score": "23", "subreddit": "DuggarsSnark", "subreddit_id": "t5_fl4tn"}, {"author": "ben121frank", "body": "2(or 1 somewhere outside USA)-5-3-4\nI know South and Central America legs aren’t popular but I have actually enjoyed most of them and think it makes a lot of sense for early legs. I like having Europe at the end so that racers will have to have experienced a lot of different cultures before they get back to relative familiarity. 5 and 3 could be in either order honestly but I feel like Africa usually gives more WOW! experiences that its fun to see more racers experience", "created_utc": "1653325273.0", "edited": "1653325504.0", "id": "i9pc2cr", "is_submitter": "False", "link_id": "t3_uw16ei", "parent_id": "t3_uw16ei", "score": "6", "subreddit": "TheAmazingRace", "subreddit_id": "t5_2stq9"}, {"author": "ben121frank", "body": "Oh also Kurt (I think it’s Kurt but it might possibly be Bergen). It’s been a while since I’ve watched that season but whichever one basically quit on the other. I guess I hate when racers give up. Although Flo trying to quit didn’t annoy me really bc she ended up not quitting and it also seemed like she was having serious mental health issues", "created_utc": "1653324386.0", "edited": "False", "id": "i9p9xp6", "is_submitter": "False", "link_id": "t3_uuqcr8", "parent_id": "t3_uuqcr8", "score": "3", "subreddit": "TheAmazingRace", "subreddit_id": "t5_2stq9"}, {"author": "ben121frank", "body": "Nick of Nick and Vicki. He was fine for most of the race but totally gave up on her (and was an asshole about it) at the end", "created_utc": "1653323562.0", "edited": "False", "id": "i9p7y2p", "is_submitter": "False", "link_id": "t3_uuqcr8", "parent_id": "t3_uuqcr8", "score": "4", "subreddit": "TheAmazingRace", "subreddit_id": "t5_2stq9"}, {"author": "ben121frank", "body": "Wonder if that was ad libbed by Adolis or if Beasley called it. Terrible decision either way", "created_utc": "1653184102.0", "edited": "False", "id": "i9ilv2c", "is_submitter": "False", "link_id": "t3_uukx4f", "parent_id": "t3_uukx4f", "score": "6", "subreddit": "TexasRangers", "subreddit_id": "t5_2rrdy"}, {"author": "ben121frank", "body": "I generally don’t enjoy India legs Bc they all feel the exact same to me, almost all of them feature a challenge that’s pushing a cart or animal or something through the “congested streets.” I enjoyed S32 (I think) visit Bc they showcased different aspects with the technology and aristocracy", "created_utc": "1652747938.0", "edited": "False", "id": "i8w1jn2", "is_submitter": "False", "link_id": "t3_ur8t3p", "parent_id": "t3_ur8t3p", "score": "20", "subreddit": "TheAmazingRace", "subreddit_id": "t5_2stq9"}, {"author": "ben121frank", "body": "The Spins-Mac Miller\nSomething about the vibe of this song is just unmatched for me", "created_utc": "1649828952.0", "edited": "False", "id": "i4j625n", "is_submitter": "False", "link_id": "t3_u1zv0n", "parent_id": "t3_u1zv0n", "score": "1", "subreddit": "Music", "subreddit_id": "t5_2qh1u"}, {"author": "ben121frank", "body": "Same", "created_utc": "1646158382.0", "edited": "False", "id": "hyxv6x5", "is_submitter": "False", "link_id": "t3_t4171o", "parent_id": "t1_hyx0ij2", "score": "6", "subreddit": "TheAmazingRace", "subreddit_id": "t5_2stq9"}, {"author": "ben121frank", "body": "Cigarette in the mouth too, what a lad", "created_utc": "1645977308.0", "edited": "False", "id": "hynmho4", "is_submitter": "False", "link_id": "t3_t2oro1", "parent_id": "t3_t2oro1", "score": "1", "subreddit": "interestingasfuck", "subreddit_id": "t5_2qhsa"}, {"author": "ben121frank", "body": "I would really like to see Arun and Natalia in a regular season (especially one of the modern ones that have very little self navigation) because they are actually pretty darn good at the challenges and are only struggling so much bc there is much more than normal of their weakness (self navigation.) I think they would actually have the potential to be a dominant team on a normal season", "created_utc": "1645671862.0", "edited": "False", "id": "hy6ubyr", "is_submitter": "False", "link_id": "t3_szzxy6", "parent_id": "t3_szzxy6", "score": "12", "subreddit": "TheAmazingRace", "subreddit_id": "t5_2stq9"}, {"author": "ben121frank", "body": "Oh ya you’re prob right", "created_utc": "1645670712.0", "edited": "False", "id": "hy6rscy", "is_submitter": "False", "link_id": "t3_szycwa", "parent_id": "t1_hy6rjyy", "score": "1", "subreddit": "TheAmazingRace", "subreddit_id": "t5_2stq9"}, {"author": "ben121frank", "body": "Ya, as Penn likes to say “time is like an accordion on the amazing race”", "created_utc": "1645670636.0", "edited": "False", "id": "hy6rmct", "is_submitter": "False", "link_id": "t3_szycwa", "parent_id": "t1_hy6r72t", "score": "7", "subreddit": "TheAmazingRace", "subreddit_id": "t5_2stq9"}, {"author": "ben121frank", "body": "Phil just said 3 departure times for the next leg. Could suggest this is an elimination leg…or 3rd and 4th could leave together who knows", "created_utc": "1645670496.0", "edited": "False", "id": "hy6rb0n", "is_submitter": "False", "link_id": "t3_szycwa", "parent_id": "t3_szycwa", "score": "17", "subreddit": "TheAmazingRace", "subreddit_id": "t5_2stq9"}, {"author": "ben121frank", "body": "Very cool Select-Donut5681, thanks for sharing!", "created_utc": "1645670271.0", "edited": "False", "id": "hy6qt0k", "is_submitter": "False", "link_id": "t3_szycwa", "parent_id": "t1_hy6qktd", "score": "2", "subreddit": "TheAmazingRace", "subreddit_id": "t5_2stq9"}, {"author": "ben121frank", "body": "This is an awesome leg I am so enjoying this", "created_utc": "1645670177.0", "edited": "False", "id": "hy6qll6", "is_submitter": "False", "link_id": "t3_szycwa", "parent_id": "t3_szycwa", "score": "3", "subreddit": "TheAmazingRace", "subreddit_id": "t5_2stq9"}, {"author": "ben121frank", "body": "Also is it just me or did the Socrates character creep anyone else out", "created_utc": "1645669999.0", "edited": "False", "id": "hy6q78s", "is_submitter": "False", "link_id": "t3_szycwa", "parent_id": "t3_szycwa", "score": "10", "subreddit": "TheAmazingRace", "subreddit_id": "t5_2stq9"}, {"author": "ben121frank", "body": "Very considerate of producers to give them a rage smashing task after the rage inducing roadblock", "created_utc": "1645669945.0", "edited": "False", "id": "hy6q2w7", "is_submitter": "False", "link_id": "t3_szycwa", "parent_id": "t3_szycwa", "score": "80", "subreddit": "TheAmazingRace", "subreddit_id": "t5_2stq9"}, {"author": "ben121frank", "body": "I feel like meditation is one of the first personality traits we’ve learned about Raquel/Cayla. Good for them tho that’s sick!", "created_utc": "1645669298.0", "edited": "False", "id": "hy6on2l", "is_submitter": "False", "link_id": "t3_szycwa", "parent_id": "t3_szycwa", "score": "9", "subreddit": "TheAmazingRace", "subreddit_id": "t5_2stq9"}, {"author": "ben121frank", "body": "The “amazing race is sponsored by Expedia” ad coming on directly after they’ve just promoed Travelocity was choice", "created_utc": "1645668377.0", "edited": "False", "id": "hy6mksy", "is_submitter": "False", "link_id": "t3_szycwa", "parent_id": "t3_szycwa", "score": "29", "subreddit": "TheAmazingRace", "subreddit_id": "t5_2stq9"}, {"author": "ben121frank", "body": "6 wordplay categories on one board (“Too” Letter Words and ones like that)", "created_utc": "1644179309.0", "edited": "False", "id": "hvus9zr", "is_submitter": "False", "link_id": "t3_sm0tdi", "parent_id": "t3_sm0tdi", "score": "1", "subreddit": "Jeopardy", "subreddit_id": "t5_2s45l"}, {"author": "ben121frank", "body": "I agree kinda a dumb task but this one did trip a few people up if I remember correctly bc they had to do it within a pretty short amount of time and so they had to move fast and couldn’t be as careful", "created_utc": "1644157634.0", "edited": "False", "id": "hvtbfll", "is_submitter": "False", "link_id": "t3_sl3edf", "parent_id": "t1_hvoxijg", "score": "3", "subreddit": "TheAmazingRace", "subreddit_id": "t5_2stq9"}, {"author": "ben121frank", "body": "The 3 post pandemic legs have made me realize I think Lulu and Lala have always been more competent than most of us thought initially, I think they just had some bad luck in the beginning and they were heavily edited as the “hot dumb team” of the season but that edit appears mostly/entirely dropped after the return and now they seem pretty smart actually", "created_utc": "1643858754.0", "edited": "False", "id": "hvdeiwy", "is_submitter": "False", "link_id": "t3_sj81z3", "parent_id": "t3_sj81z3", "score": "71", "subreddit": "TheAmazingRace", "subreddit_id": "t5_2stq9"}, {"author": "ben121frank", "body": "I wouldn’t say full on lost but they did appear to be navigationally confused at one point while kayaking", "created_utc": "1643858534.0", "edited": "False", "id": "hvde0vu", "is_submitter": "False", "link_id": "t3_sj81z3", "parent_id": "t1_hvdb7pb", "score": "5", "subreddit": "TheAmazingRace", "subreddit_id": "t5_2stq9"}, {"author": "ben121frank", "body": "“I got us in this predicament” is the most humility we’ve seen from Akbar all race wow", "created_utc": "1643856771.0", "edited": "False", "id": "hvd9ywa", "is_submitter": "False", "link_id": "t3_sj6gn7", "parent_id": "t3_sj6gn7", "score": "24", "subreddit": "TheAmazingRace", "subreddit_id": "t5_2stq9"}, {"author": "ben121frank", "body": "When Arun said “I am having a good time” was so adorable 🥰", "created_utc": "1643856155.0", "edited": "False", "id": "hvd8hlx", "is_submitter": "False", "link_id": "t3_sj6gn7", "parent_id": "t3_sj6gn7", "score": "82", "subreddit": "TheAmazingRace", "subreddit_id": "t5_2stq9"}, {"author": "ben121frank", "body": "I seriously don’t understand what is filling the time in these modern episodes bc it’s over halfway done and it feels like so little has happened compared to an old episode when they would’ve probably had 4 or 5 clues by now but at the same time it’s also not boring still so I’m confused", "created_utc": "1643855759.0", "edited": "False", "id": "hvd7jgo", "is_submitter": "False", "link_id": "t3_sj6gn7", "parent_id": "t3_sj6gn7", "score": "9", "subreddit": "TheAmazingRace", "subreddit_id": "t5_2stq9"}, {"author": "ben121frank", "body": "They freaked out that their cheese was “way too hot” and decided to quit when it was 0.8 degrees above the temperature it was supposed to be, is that actually that big of a deal in cooking or were they just being dramatic?", "created_utc": "1643855444.0", "edited": "1643855540.0", "id": "hvd6s11", "is_submitter": "False", "link_id": "t3_sj6gn7", "parent_id": "t3_sj6gn7", "score": "11", "subreddit": "TheAmazingRace", "subreddit_id": "t5_2stq9"}, {"author": "ben121frank", "body": "Everyone is calling Raquel and Cayla gamebots so I have to ask, what exactly is a gamebot?", "created_utc": "1643854827.0", "edited": "False", "id": "hvd5aaw", "is_submitter": "False", "link_id": "t3_sj6gn7", "parent_id": "t3_sj6gn7", "score": "7", "subreddit": "TheAmazingRace", "subreddit_id": "t5_2stq9"}, {"author": "ben121frank", "body": "Mix Master/Master Mix from Season (I think) 24", "created_utc": "1643784279.0", "edited": "False", "id": "hv8v9dv", "is_submitter": "False", "link_id": "t3_sicnlx", "parent_id": "t3_sicnlx", "score": "9", "subreddit": "TheAmazingRace", "subreddit_id": "t5_2stq9"}, {"author": "ben121frank", "body": "Yep. This episode in particular I felt like cut back to Sherri at the roadblock SO many times and I was just sitting there like, we get it she’s struggling, we get it she’s far behind the other times, we get it she’s gonna persevere and finish, please show me something else now lol", "created_utc": "1642691505.0", "edited": "False", "id": "htgskmr", "is_submitter": "False", "link_id": "t3_s88ga1", "parent_id": "t1_htex5w2", "score": "22", "subreddit": "TheAmazingRace", "subreddit_id": "t5_2stq9"}, {"author": "ben121frank", "body": "🟨⬛️⬛️⬛️⬛️\n\n🟩🟨🟨🟨⬛️\n\n🟩🟩🟩🟩🟩", "created_utc": "1642618338.0", "edited": "False", "id": "htcpgsx", "is_submitter": "False", "link_id": "t3_s6yjj5", "parent_id": "t3_s6yjj5", "score": "1", "subreddit": "wordle", "subreddit_id": "t5_2zbdz"}, {"author": "ben121frank", "body": "Definitely plays a role but I would say probably not as much of one as it seems on TV. For example the season 26 finale was portrayed on TV as a cab race but the 2nd place team has said in interviews they were actually way behind the winning team and never had a chance. So I suspect that has been the case in other scenarios too", "created_utc": "1642515401.0", "edited": "False", "id": "ht6fl3b", "is_submitter": "False", "link_id": "t3_s6nk5p", "parent_id": "t3_s6nk5p", "score": "2", "subreddit": "TheAmazingRace", "subreddit_id": "t5_2stq9"}, {"author": "ben121frank", "body": "I don’t know about careless because they appeared to think it through before doing it but one of the dumber mistakes imo was in season 25 when the cyclists Kym and Alli got eliminated bc they chose to try a surfing fast forward when one of the other teams in the race were both professional surfers. Predictably the surfers finished the fast forward first so Kym and Alli had to go back and do everything and were by that point too far behind and got eliminated", "created_utc": "1642372763.0", "edited": "False", "id": "hsylf5b", "is_submitter": "False", "link_id": "t3_s5iin5", "parent_id": "t3_s5iin5", "score": "13", "subreddit": "TheAmazingRace", "subreddit_id": "t5_2stq9"}, {"author": "ben121frank", "body": "I thought Leg 3 was great, Leg 1 was solid, Leg 2 was just ok", "created_utc": "1642132037.0", "edited": "False", "id": "hsl092x", "is_submitter": "False", "link_id": "t3_s3g7oo", "parent_id": "t3_s3g7oo", "score": "7", "subreddit": "TheAmazingRace", "subreddit_id": "t5_2stq9"}, {"author": "ben121frank", "body": "Well I guess my worry that Amy is running out of steam was unfounded. She looked strong as ever today", "created_utc": "1642126347.0", "edited": "False", "id": "hskni69", "is_submitter": "False", "link_id": "t3_s3655c", "parent_id": "t3_s3655c", "score": "4", "subreddit": "Jeopardy", "subreddit_id": "t5_2s45l"}, {"author": "ben121frank", "body": "Ya it’s definitely not a true NEL and I wasn’t trying to say it was, I was just saying I hope production considered that when they were patterning out the rest of the legs and that I hope for more KORs vs just more NELs", "created_utc": "1642102442.0", "edited": "False", "id": "hsiz4wr", "is_submitter": "True", "link_id": "t3_s3582s", "parent_id": "t1_hsivi9r", "score": "3", "subreddit": "TheAmazingRace", "subreddit_id": "t5_2stq9"}, {"author": "ben121frank", "body": "Agree she is the most enjoyable superchamp to watch imo (except maybe Ken, I was a small child during his run lol so I didn’t watch his in real time). I think maybe bc she doesn’t mine for daily doubles like James and Matt did? (Not knocking them for doing that, it is an effective strategy, just not as fun to watch)", "created_utc": "1642101087.0", "edited": "False", "id": "hsivjjk", "is_submitter": "False", "link_id": "t3_s2virk", "parent_id": "t1_hsib9fr", "score": "6", "subreddit": "Jeopardy", "subreddit_id": "t5_2s45l"}, {"author": "ben121frank", "body": "Ya you’re right, it honestly seemed like a thing of having the right technique as much as having strength", "created_utc": "1642097113.0", "edited": "False", "id": "hsikttv", "is_submitter": "False", "link_id": "t3_s2oo87", "parent_id": "t1_hsij4b2", "score": "7", "subreddit": "TheAmazingRace", "subreddit_id": "t5_2stq9"}, {"author": "ben121frank", "body": "Depending on the circumstances I think switching can be the right choice sometimes. But in their case was an awful decision. Not only did they switch to what they explicitly said was their weakest area, but it also looked like they barely even gave the barrels a try before giving up. Raquel and Cayla completed it without a ton of struggle it seemed so I think Arun and Natalia could’ve (and should’ve) too", "created_utc": "1642094196.0", "edited": "False", "id": "hsict92", "is_submitter": "False", "link_id": "t3_s2oo87", "parent_id": "t1_hsfwz76", "score": "22", "subreddit": "TheAmazingRace", "subreddit_id": "t5_2stq9"}, {"author": "ben121frank", "body": "I have mixed emotions about Anthony and Spencer. On the one hand I liked them a lot as an individual team and will miss that. On the other tho their alliance with Ryan and Dusty was starting to look a lot the alliances in 32 that we pretty much all agreed decreased our enjoyment of the season. So from that standpoint it may be good to have their alliance broken up", "created_utc": "1642093854.0", "edited": "False", "id": "hsibvuu", "is_submitter": "False", "link_id": "t3_s2p02w", "parent_id": "t3_s2p02w", "score": "4", "subreddit": "TheAmazingRace", "subreddit_id": "t5_2stq9"}, {"author": "ben121frank", "body": "Same that was my first thought when watching was that the Boris Johnson impersonator looked a little too much like him. Especially bc the queen one only looked marginally like her", "created_utc": "1641923700.0", "edited": "False", "id": "hs8h08a", "is_submitter": "False", "link_id": "t3_rzrw3o", "parent_id": "t1_hrxas7x", "score": "7", "subreddit": "TheAmazingRace", "subreddit_id": "t5_2stq9"}, {"author": "ben121frank", "body": "If you look closely there is 5 bowls so I think maybe they just stacked them to make it easier for waiter to pick up? Which is strange bc it’s hard to imagine them doing anything to help anyone else lol", "created_utc": "1641693311.0", "edited": "False", "id": "hruvp47", "is_submitter": "False", "link_id": "t3_rzefp3", "parent_id": "t1_hrupwaj", "score": "29", "subreddit": "DuggarsSnark", "subreddit_id": "t5_fl4tn"}, {"author": "ben121frank", "body": "Thank you for this. I was distraught because I forgot to record today’s episode (first of hers I’ve missed😔) and wasn’t have any success at finding results online or social media. Then I was like wait I bet there is a Jeopardy sub and I bet they know and now here I am 👍🏻", "created_utc": "1640662012.0", "edited": "False", "id": "hq8egl6", "is_submitter": "False", "link_id": "t3_rpu492", "parent_id": "t3_rpu492", "score": "14", "subreddit": "Jeopardy", "subreddit_id": "t5_2s45l"}, {"author": "ben121frank", "body": "Totally agree. Also the phrase “Google is free”. Yes, Google is free, but the chances are excellent that the information a clueless person finds on Google is inaccurate or at the very least not what the “Google is free” dolt wanted them to learn", "created_utc": "1627962220.0", "edited": "False", "id": "h7ih0my", "is_submitter": "False", "link_id": "t3_owns9h", "parent_id": "t3_owns9h", "score": "1", "subreddit": "unpopularopinion", "subreddit_id": "t5_2tk0s"}, {"author": "ben121frank", "body": "Just finished watching this one. I see your point about Lewis, but to be fair I also think rope and fire were natural escalations of Henry’s original behavior in Born Psychopath, which was before the Lewis plot started", "created_utc": "1621901326.0", "edited": "False", "id": "gzc1yvu", "is_submitter": "False", "link_id": "t3_nka3ac", "parent_id": "t1_gzc140s", "score": "13", "subreddit": "SVU", "subreddit_id": "t5_2t476"}, {"author": "ben121frank", "body": "I’ve been an observer on this sub for a long time but haven’t ever posted bc I don’t usually have anything to contribute. But when this came on my fyp I immediately thought of you all", "created_utc": "1621871170.0", "edited": "False", "id": "gza84mj", "is_submitter": "True", "link_id": "t3_nk0xze", "parent_id": "t3_nk0xze", "score": "29", "subreddit": "DuggarsSnark", "subreddit_id": "t5_fl4tn"}, {"author": "ben121frank", "body": "Law and order SVU. Wouldn’t quite say the new seasons are unwatchable but it’s a shadow of what it used to be. Exciting races to find suspects have been almost entirely replaced by boring courtroom drama and every episode feels the same", "created_utc": "1616878764.0", "edited": "False", "id": "gsiaado", "is_submitter": "False", "link_id": "t3_mecx3b", "parent_id": "t3_mecx3b", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "ben121frank", "body": "I’m a bit late to the thread so this might not get seen but an awesome analogy by teamtripi on Tiktok that has helped me explain it better than anything else:\n\nThe human body is like a power plant that needs 100 W to function properly. Autistic peoples body’s are always producing 110 W. So we tend to always have extra energy(mentally and physically, although it might not always present in classically “energetic” ways.)\n\nBc autistic respond to sensory input differently, certain things can drastically affect our production both positively or negatively depending. Loud noises and other unpleasant ones are like huge powerful jolts that’s too much to process and shut down our factory temporarily. \n\nOn the flip side things that can comfort us can put our factory on a kind of hyper efficient autopilot and we can do things more efficiently than neurotypical people. \n\nThis analogy has helped a lot of people understand what I experience, and especially why I can be “high functioning” one day and “low functioning” the next(these are bad terms but that is a rant for a different autism thread)", "created_utc": "1613279772.0", "edited": "False", "id": "gncuure", "is_submitter": "False", "link_id": "t3_lj7uwk", "parent_id": "t3_lj7uwk", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "ben121frank", "body": "This sounds so fun I would be interested!", "created_utc": "1612835822.0", "edited": "False", "id": "gmngbei", "is_submitter": "False", "link_id": "t3_lfopvv", "parent_id": "t3_lfopvv", "score": "3", "subreddit": "TheAmazingRace", "subreddit_id": "t5_2stq9"}, {"author": "ben121frank", "body": "“American girl lesbian aunts”\n\nI admit I totally should’ve seen this coming but I did not. There was a rumor leaked that the new American Girl Doll of the Year would have lesbian aunts and I was trying to see if it was true. Needless to say none of the results were about the dolls", "created_utc": "1612211830.0", "edited": "False", "id": "gln9i5j", "is_submitter": "False", "link_id": "t3_l9yno0", "parent_id": "t3_l9yno0", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "ben121frank", "body": "Others in the comments have already pointed out the differences in what the alleged cheating is better than I could articulate so I won’t try. \n\nBut I would like to add something else for you to consider. Action is always more consequential than words. People who believe Bernie was cheated for the most part responded by accepted Biden’s nomination anyway. Those that didn’t accept it protested by writing in Bernie or not voting. \n\nPeople who believe Trump was cheated staged a violent insurrection at the US capitol, amongst other things. That’s the part that people view as cult like, that they were willing to go to such a great length and quite possibly destroy their own life for the cause. \n\nEven if the core belief of the two beliefs is similar, I believe the situations are not comparable bc of the difference in reaction to the belief, which ultimately matters more.", "created_utc": "1611350908.0", "edited": "False", "id": "gk8qshg", "is_submitter": "False", "link_id": "t3_l2m2o7", "parent_id": "t3_l2m2o7", "score": "2", "subreddit": "changemyview", "subreddit_id": "t5_2w2s8"}, {"author": "ben121frank", "body": "In 27 Tanner and Josh’s speed bump was that they both had to do the roadblock. That seems similar to the “extreme roadblock” and maybe where they got the idea from?", "created_utc": "1611253412.0", "edited": "False", "id": "gk34uz6", "is_submitter": "False", "link_id": "t3_l21qkf", "parent_id": "t3_l21qkf", "score": "12", "subreddit": "TheAmazingRace", "subreddit_id": "t5_2stq9"}, {"author": "ben121frank", "body": "We have something called “guarantees” that we’ll use as part of trades. Basically it just means you guarantee the other person that you won’t buy a certain property. We only ever play 2 player, I assume it wouldn’t work with more", "created_utc": "1611067832.0", "edited": "False", "id": "gju1tvr", "is_submitter": "False", "link_id": "t3_l0f4k2", "parent_id": "t1_gjto7am", "score": "4", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "ben121frank", "body": "In Ticket to Ride we have something called “Petition to Clear.” There are 5 face up train cards. If you don’t like what’s up there you can say “Petition to Clear” and if all players agree we’ll clear them all and turn up 5 new ones. We have many different versions(it’s our favorite game) and do this in all of them. \n\nAlso according to the rules of the game if 3 locomotives(wild cards) come up among the 5 you are supposed to clear it but we usually give a locomotive to each person as we do. \n\nWe also allow both sides of double routes to be used in our 3 player games. As you can probably tell for those familiar we are a very amiable group who focuses more on building our routes than blocking each other.", "created_utc": "1611067417.0", "edited": "False", "id": "gju10n1", "is_submitter": "False", "link_id": "t3_l0f4k2", "parent_id": "t3_l0f4k2", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "ben121frank", "body": "I’m glad you enjoyed it! I am in the minority but I don’t consider it one of the best seasons, only average. A lot of my reasons for this are things you mentioned, such as I also hated Marshall and lance(normally one team won’t affect my enjoyment of a whole season but they were seriously awful) and I got really tired of watching the final 5 for like 6 episodes. It seemed that the tasks were almost entirely physical which I wasn’t a fan of as I prefer the more mental/puzzling ones. \n\nBut there are also lots of good things about the season, mainly all the airport drama and awesome locations, so I can also see why people like it so much. \n\nFor chaotic casts I would recommend:\n\nSeason 20, it is arguably the most chaotic but I will warn you I find it chaotic in a bad way. Think LOTS of arguing and general mean spirits. \n\nSeason 23 has a couple really chaotic teams, but somewhat balanced out by the rest who are not really.", "created_utc": "1611031513.0", "edited": "False", "id": "gjsra33", "is_submitter": "False", "link_id": "t3_l09nx1", "parent_id": "t3_l09nx1", "score": "1", "subreddit": "TheAmazingRace", "subreddit_id": "t5_2stq9"}, {"author": "ben121frank", "body": "No I don’t think they did. If I was them I would’ve left as soon as Adam and Bethany got there, but who knows if that would’ve worked out any better for them ¯\\_(ツ)_/¯ \n\nI’ve not seen TARCAN so I didn’t know that but that is very cool woah", "created_utc": "1610339392.0", "edited": "False", "id": "giuac96", "is_submitter": "False", "link_id": "t3_kuo5tb", "parent_id": "t1_gitwfw5", "score": "5", "subreddit": "TheAmazingRace", "subreddit_id": "t5_2stq9"}, {"author": "ben121frank", "body": "Great review thanks for writing it! I really enjoyed this season it’s one of the greats imo. As a big Kym and Alli fan I will never for the life of me understand why they chose to try to beat a team of professional surfers at a surfing challenge. Definitely one of the worse decisions in TAR history. Sad to see them go from it but also made for a great suspenseful episode", "created_utc": "1610327945.0", "edited": "False", "id": "gitnlpp", "is_submitter": "False", "link_id": "t3_kuo5tb", "parent_id": "t3_kuo5tb", "score": "9", "subreddit": "TheAmazingRace", "subreddit_id": "t5_2stq9"}, {"author": "ben121frank", "body": "Gluten. Assuming you don’t have celiac or another intolerance to it, there’s really no health benefit to eating gluten free. \n\n(Obviously if you cut all traditionally gluten containing foods out of your diet that will be a lot of carbs and sweets so yes probably healthier, but if you are just replacing them with the gf alternative it is not)", "created_utc": "1609729745.0", "edited": "False", "id": "gi11wvi", "is_submitter": "False", "link_id": "t3_kpodbn", "parent_id": "t3_kpodbn", "score": "3", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "ben121frank", "body": "Florida player bragged in interview prior to the game about how much better they were and how OU couldn’t possibly measure up to their SEC standards. OU then won 55-20", "created_utc": "1609393790.0", "edited": "False", "id": "ghky5l7", "is_submitter": "True", "link_id": "t3_knk35f", "parent_id": "t1_ghkxwwt", "score": "2", "subreddit": "agedlikemilk", "subreddit_id": "t5_o7cng"}, {"author": "ben121frank", "body": "Don’t keep driving if you don’t know where you’re going. Stop and ask for directions, and make sure you actually understand the directions before setting off again", "created_utc": "1609355252.0", "edited": "False", "id": "ghixusu", "is_submitter": "False", "link_id": "t3_kn4sm3", "parent_id": "t3_kn4sm3", "score": "4", "subreddit": "TheAmazingRace", "subreddit_id": "t5_2stq9"}, {"author": "ben121frank", "body": "Forgot to add, this is Diamine Wild Strawberry ink", "created_utc": "1609186426.0", "edited": "False", "id": "ghbj7n7", "is_submitter": "True", "link_id": "t3_klxzal", "parent_id": "t3_klxzal", "score": "1", "subreddit": "fountainpens", "subreddit_id": "t5_2s0ew"}, {"author": "ben121frank", "body": "Hmm good question I didn’t think of that. I guess you would just do the second detour that you got to", "created_utc": "1608509179.0", "edited": "False", "id": "ggj8p8n", "is_submitter": "True", "link_id": "t3_kfeled", "parent_id": "t1_ggglz9e", "score": "1", "subreddit": "TheAmazingRace", "subreddit_id": "t5_2stq9"}, {"author": "ben121frank", "body": "There are logistic and budget related things that others have explained better than I could. I also have a personal theory that it at least partially has to do with Margie and Luke in 24. Opinions on this sub are kinda mixed but they are an extremely popular team among casual viewers and a lot of people were really upset to see what happened to them. So I I think TAR has been trying to move away from airport drama being majorly consequential since then.", "created_utc": "1608356967.0", "edited": "False", "id": "ggc34mv", "is_submitter": "False", "link_id": "t3_kfx1pa", "parent_id": "t3_kfx1pa", "score": "5", "subreddit": "TheAmazingRace", "subreddit_id": "t5_2stq9"}, {"author": "ben121frank", "body": "I think the Mine Five alliance pretty much sealed Kaylynn and Haley’s fate and the Core 3 later did the same thing for Gary and DeAngelo. \n\nBut it’s entirely possible and maybe even likely both of those teams would’ve gotten eliminated in those same legs regardless-Kaylynn got into last place of their own accord, and I can see Gary and DeAngelo being the slowest to figure out the music challenge if every team did it on their own. \n\nObviously it’s impossible to know for sure what would’ve happened but I don’t see the alliance making that much of a difference in boot order", "created_utc": "1608322963.0", "edited": "False", "id": "ggafszy", "is_submitter": "False", "link_id": "t3_kfm0f1", "parent_id": "t3_kfm0f1", "score": "3", "subreddit": "TheAmazingRace", "subreddit_id": "t5_2stq9"}, {"author": "ben121frank", "body": "Yes! There wasn’t a single team I disliked. My least favorite was Eswar and Asparna, and only bc I thought they were boring", "created_utc": "1608310072.0", "edited": "False", "id": "gg9lh2m", "is_submitter": "True", "link_id": "t3_kf4k88", "parent_id": "t1_gg93mu4", "score": "1", "subreddit": "TheAmazingRace", "subreddit_id": "t5_2stq9"}, {"author": "ben121frank", "body": "According to Jordan from their original season Jet called him a homophobic slur(one that rhymes with “bag it”) and they also made homophobic comments about Carol and Brandy", "created_utc": "1608299069.0", "edited": "False", "id": "gg9023f", "is_submitter": "False", "link_id": "t3_kev13a", "parent_id": "t1_gg8j3gw", "score": "1", "subreddit": "TheAmazingRace", "subreddit_id": "t5_2stq9"}, {"author": "ben121frank", "body": "Yes! They’re the team I referred to as getting locals to help them(which is completely valid imo) but I forgot she also tried very hard on her own before asking", "created_utc": "1608298753.0", "edited": "False", "id": "gg8zkv8", "is_submitter": "False", "link_id": "t3_kfamhf", "parent_id": "t1_gg8em0t", "score": "6", "subreddit": "TheAmazingRace", "subreddit_id": "t5_2stq9"}, {"author": "ben121frank", "body": "This is a sub for amazing race fans, to spend time talking and sharing about a show we love. I and I’m sure others on here enjoyed reading it. Don’t be a jerk dude", "created_utc": "1608268783.0", "edited": "False", "id": "gg81dvg", "is_submitter": "False", "link_id": "t3_kf3hwp", "parent_id": "t1_gg7elto", "score": "9", "subreddit": "TheAmazingRace", "subreddit_id": "t5_2stq9"}, {"author": "ben121frank", "body": "It’s really hard to say, because it all depends how they’re edited. Season 26 which is one you mentioned looked really close and exciting on TV, but the teams have said in interviews that it actually wasn’t. The winners had a much easier and quicker time with the final task than the other teams bc they had taken their selfies at distinctive locations that were easy to match to the legs, whereas the losing two teams had more generic ones in airports and places like that.", "created_utc": "1608268467.0", "edited": "False", "id": "gg80x15", "is_submitter": "False", "link_id": "t3_kfbvcv", "parent_id": "t3_kfbvcv", "score": "2", "subreddit": "TheAmazingRace", "subreddit_id": "t5_2stq9"}, {"author": "ben121frank", "body": "I’m not sure what you mean by this. If you’re suggesting the edit was too focused on them I disagree, I think the final 4 all got about even screen time, and if you were asking me to predict the winner based off editing alone I would have guessed CheeHu", "created_utc": "1608268132.0", "edited": "False", "id": "gg80eyd", "is_submitter": "True", "link_id": "t3_kf4k88", "parent_id": "t1_gg7yjy8", "score": "3", "subreddit": "TheAmazingRace", "subreddit_id": "t5_2stq9"}, {"author": "ben121frank", "body": "I would like to see LoLo back for this bc they are certainly a strong enough to meet the criteria I think and I would really like to see them more of them since we saw so little in 29(but what we did see was great)", "created_utc": "1608267937.0", "edited": "False", "id": "gg804eu", "is_submitter": "False", "link_id": "t3_kfcg35", "parent_id": "t3_kfcg35", "score": "1", "subreddit": "TheAmazingRace", "subreddit_id": "t5_2stq9"}, {"author": "ben121frank", "body": "Margie and Luke are for sure the feel good team with how they’re edited so it’s easy to root for them. If you’ve seen their previous seasons they get some new depth this season too. I personally really like the cowboys but they’re a bit controversial, the globetrotters are generally well liked, and the Afghanimals are up there in a lot of peoples all time favorite teams", "created_utc": "1608261962.0", "edited": "False", "id": "gg7ptof", "is_submitter": "False", "link_id": "t3_kepooo", "parent_id": "t1_gg7mmyx", "score": "1", "subreddit": "TheAmazingRace", "subreddit_id": "t5_2stq9"}, {"author": "ben121frank", "body": "Wow! Mad respect for the amount of work I’m sure this took. I thoroughly enjoyed reading it and would love to see teams race it", "created_utc": "1608261528.0", "edited": "False", "id": "gg7p20b", "is_submitter": "False", "link_id": "t3_keisuw", "parent_id": "t3_keisuw", "score": "1", "subreddit": "TheAmazingRace", "subreddit_id": "t5_2stq9"}, {"author": "ben121frank", "body": "It’s not bad at all in my opinion. Dare I say I enjoyed it. I’m not sure why people on this sub hate it so much. To me, the challenge/location quality doesn’t seem noticably worse than other seasons. Actually this season has one of my all time favorite challenges(it’s in the penultimate leg, if you decide to watch it that far.) \n\nSome of the other common complaints on here(one annoying team, one team always riding coattails) are accurate but don’t ruin the season imo. However I am admittedly easy to please, people running around the world doing challenges of any sort I would prob enjoy, so take my words with a grain of salt lol", "created_utc": "1608259071.0", "edited": "False", "id": "gg7knau", "is_submitter": "False", "link_id": "t3_kepooo", "parent_id": "t3_kepooo", "score": "2", "subreddit": "TheAmazingRace", "subreddit_id": "t5_2stq9"}, {"author": "ben121frank", "body": "25 is the best of the modern era imo. 29 is a close second. \n\n17 is the best season in the middle era and the middle era is the best era imo. 18 is also really great but it has returning teams so I would watch at least some of the original seasons first(I believe all the returners in 18 are from seasons 12-17)", "created_utc": "1608257549.0", "edited": "False", "id": "gg7hxmu", "is_submitter": "False", "link_id": "t3_ker2gd", "parent_id": "t3_ker2gd", "score": "1", "subreddit": "TheAmazingRace", "subreddit_id": "t5_2stq9"}, {"author": "ben121frank", "body": "I agree about DeAngelo. Making those comments while (justifiably imo, they really got shafted at the music challenge) upset at the mat in the heat of the moment is one thing, continuing to hate on the race literal years later is another", "created_utc": "1608256997.0", "edited": "False", "id": "gg7gxvh", "is_submitter": "False", "link_id": "t3_kesfao", "parent_id": "t1_gg57mqa", "score": "4", "subreddit": "TheAmazingRace", "subreddit_id": "t5_2stq9"}, {"author": "ben121frank", "body": "As someone who didn’t like it but didn’t hate it either, my main complaint is it ruined some of the challenges in the sense that it made what would’ve otherwise been a cool and potentially difficult challenge easy and lame. For example one they had to face first repel down a building while looking for letters then unscramble the letters to spell a word. One team figured it out on their own, one team got locals to help them, and I believe all the others had the answer just shared with them. \n\nSo that is frustrating. But to me it’s not on the racers. It’s on the producers for designing challenges where you can do that, and generally designing a race where it pays to be in a 5 team alliance(and it certainly did this season, the Mine 5 was the final 5 and within that the Core 3 was the final 3)", "created_utc": "1608254440.0", "edited": "False", "id": "gg7celf", "is_submitter": "False", "link_id": "t3_kfamhf", "parent_id": "t3_kfamhf", "score": "8", "subreddit": "TheAmazingRace", "subreddit_id": "t5_2stq9"}, {"author": "ben121frank", "body": "The cowboys(as racers only, do not like their homophobia.) \n\nNot sure if they qualify as unpopular bc they have a lot of fans but I also know they have a lot of haters. Definitely one of the more polarizing teams but I personally loved their “running our own race” thing", "created_utc": "1608253898.0", "edited": "False", "id": "gg7bfww", "is_submitter": "False", "link_id": "t3_kev13a", "parent_id": "t3_kev13a", "score": "2", "subreddit": "TheAmazingRace", "subreddit_id": "t5_2stq9"}, {"author": "ben121frank", "body": "For older kids I think a “dirty Santa” format works better so no one even necessarily has to know who brought what gift but I’m not sure if little kids would understand the concept and why the gift they chose is being stolen from them lol", "created_utc": "1608250182.0", "edited": "False", "id": "gg74jiu", "is_submitter": "False", "link_id": "t3_kf0mcs", "parent_id": "t3_kf0mcs", "score": "1", "subreddit": "unpopularopinion", "subreddit_id": "t5_2tk0s"}, {"author": "ben121frank", "body": "Ok ya now that I’m reading your breakdown I agree the challenges were lame. I used the word “enjoyable” bc I really did enjoy watching it, but looking back now I think that’s as much bc I liked all 3 teams so I wasn’t stressed about the outcome like I sometimes am in finale legs, as much as it the leg itself. And at the time I thought the little Mardi Gras touches especially the part where they were playing washboards with the band were just fun and well, enjoyable, but someone else commented that they were filming in December and basically faked Mardi Gras for it so that makes the whole thing a lot less cool", "created_utc": "1608249649.0", "edited": "False", "id": "gg73fo0", "is_submitter": "True", "link_id": "t3_kf4k88", "parent_id": "t1_gg6wkh8", "score": "3", "subreddit": "TheAmazingRace", "subreddit_id": "t5_2stq9"}, {"author": "ben121frank", "body": "I had no idea they faked Mardi Gras in December for it. That is very lame and makes me like it less", "created_utc": "1608249352.0", "edited": "False", "id": "gg72sxm", "is_submitter": "True", "link_id": "t3_kf4k88", "parent_id": "t1_gg6nkix", "score": "2", "subreddit": "TheAmazingRace", "subreddit_id": "t5_2stq9"}, {"author": "ben121frank", "body": "Yes and building off this it really annoyed me when he was like “I could pay for this myself” sure he could pay to travel to the countries but all the really unique cool race experiences I think you’d be hard pressed to arrange on your own", "created_utc": "1608249200.0", "edited": "False", "id": "gg72hof", "is_submitter": "True", "link_id": "t3_kf4k88", "parent_id": "t1_gg71pi0", "score": "5", "subreddit": "TheAmazingRace", "subreddit_id": "t5_2stq9"}, {"author": "ben121frank", "body": "Oh good to know about New Orleans. I’m not from there and have only ever been once so in my uninformed opinion I thought Mardi Gras was about as New Orleans as it gets. None of them were extremely challenging I’ll give you but I thought they a good level for the final bc the baby cake one was if not hard enough time consuming enough to put Will and James ahead but it still felt like the others might be able to come back so it was exciting to watch. I don’t like when the finals are either so linear that there’s no opportunity for placements to change(like the one that involved ice trekking, I can’t remember the season) OR the final task is so difficult that it negates everything before it.", "created_utc": "1608238679.0", "edited": "False", "id": "gg6hkql", "is_submitter": "True", "link_id": "t3_kf4k88", "parent_id": "t1_gg6gbc1", "score": "1", "subreddit": "TheAmazingRace", "subreddit_id": "t5_2stq9"}, {"author": "ben121frank", "body": "Apparently him and Gary had a secret side alliance with Riley and Maddison which R+M betrayed at the instrument case challenge in favor of the Core 3 alliance. \n\nAlso he apparently was disappointed/angry that he wasn’t able to explore the locations during pit stops. \n\nI think him being very upset as they got eliminated is justified especially if the secret alliance things is true, but I’m not sure I personally can excuse what he said bc it just seemed in such poor taste and ignorant to what a privilege it is to be on the race", "created_utc": "1608238056.0", "edited": "False", "id": "gg6gafa", "is_submitter": "True", "link_id": "t3_kf4k88", "parent_id": "t1_gg6eszd", "score": "16", "subreddit": "TheAmazingRace", "subreddit_id": "t5_2stq9"}, {"author": "ben121frank", "body": "I agree. People forgot that in their original season(22?) they literally won multiple legs with Dave on crutches", "created_utc": "1608237585.0", "edited": "False", "id": "gg6fc8x", "is_submitter": "False", "link_id": "t3_kev13a", "parent_id": "t1_gg5ttqs", "score": "2", "subreddit": "TheAmazingRace", "subreddit_id": "t5_2stq9"}, {"author": "ben121frank", "body": "I’m not even sure if they would be disliked if they hasn’t been on Allstars, 21 is one of my favorite seasons and I don’t remember ever hating them, it’s just their one singular awful episode on 24 that sticks out in my mind", "created_utc": "1608237469.0", "edited": "False", "id": "gg6f3rq", "is_submitter": "False", "link_id": "t3_kev13a", "parent_id": "t1_gg5f42n", "score": "4", "subreddit": "TheAmazingRace", "subreddit_id": "t5_2stq9"}, {"author": "ben121frank", "body": "They’re very intent on reminding us about covid every 5 minutes(lots of one-off comments like “you can’t ride along in the ambulance-sorry, Covid”) as if anyone is unaware", "created_utc": "1608235775.0", "edited": "False", "id": "gg6bkqi", "is_submitter": "False", "link_id": "t3_kf44aa", "parent_id": "t3_kf44aa", "score": "16", "subreddit": "SVU", "subreddit_id": "t5_2t476"}, {"author": "ben121frank", "body": "This is PERFECTLY written thank you!! I’d also like to add that collaboration on challenges, whether as part of an alliance or not, has always been an element of the race. I think the reason it feels so frustrating to watch this season is that many of the tasks are poorly designed to where it’s pretty much impossible help another team without just giving them the answer. I think redesigning tasks away from the “passcode” structure they’ve tended to take this season will help prevent this frustration from happening again", "created_utc": "1607837623.0", "edited": "False", "id": "gfndxw0", "is_submitter": "False", "link_id": "t3_kc2m0p", "parent_id": "t3_kc2m0p", "score": "22", "subreddit": "TheAmazingRace", "subreddit_id": "t5_2stq9"}, {"author": "ben121frank", "body": "For me personally my favorite part is the tasks not the travel so I think I could’ve liked family edition if they had executed it better. There was a one season show called Treasure Hunters that was all in the US and much more puzzle based that I thought was very cool. But as others in the thread have said the teams were very unbalanced. It’s hard to create a task that an 8 year and an adult have an equal chance at unless it’s either very lame or total needle in haystack/luck. This season was a lot of both. So in short they took away the defining aspect of amazing race(travel) and didn’t make up for it elsewhere", "created_utc": "1607476170.0", "edited": "False", "id": "gf4aila", "is_submitter": "False", "link_id": "t3_k9cpo3", "parent_id": "t3_k9cpo3", "score": "1", "subreddit": "TheAmazingRace", "subreddit_id": "t5_2stq9"}, {"author": "ben121frank", "body": "I’m too lazy but someone should check the math and see if there’s even a possible combination of states that could result in this number", "created_utc": "1607446340.0", "edited": "False", "id": "gf2ha51", "is_submitter": "False", "link_id": "t3_k93vuz", "parent_id": "t3_k93vuz", "score": "1", "subreddit": "insanepeoplefacebook", "subreddit_id": "t5_3acf2"}, {"author": "ben121frank", "body": "Please put Kym and Alli on part 3 if you make one 🥺", "created_utc": "1607309227.0", "edited": "False", "id": "gewk0dc", "is_submitter": "False", "link_id": "t3_k8298n", "parent_id": "t3_k8298n", "score": "1", "subreddit": "TheAmazingRace", "subreddit_id": "t5_2stq9"}, {"author": "ben121frank", "body": "Kym and Alli are one of the best imo", "created_utc": "1607309096.0", "edited": "False", "id": "gewjrzn", "is_submitter": "False", "link_id": "t3_k8254x", "parent_id": "t3_k8254x", "score": "2", "subreddit": "TheAmazingRace", "subreddit_id": "t5_2stq9"}, {"author": "ben121frank", "body": "“Squirt” Was looking for the little turtle from finding Nemo, the results were decidedly...not that", "created_utc": "1606893276.0", "edited": "False", "id": "gecihn2", "is_submitter": "False", "link_id": "t3_k4q51w", "parent_id": "t3_k4q51w", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "ben121frank", "body": "Trump also got almost 14 million more votes than Romney did in that election. Amazingly, when ~30 million more people vote, those votes have to go somewhere 🤯", "created_utc": "1606666627.0", "edited": "False", "id": "ge1spp4", "is_submitter": "False", "link_id": "t3_k36swt", "parent_id": "t3_k36swt", "score": "7", "subreddit": "insanepeoplefacebook", "subreddit_id": "t5_3acf2"}, {"author": "ben121frank", "body": "Well I am of course sad about Kaylynn and Haley and annoyed about the alliance but aren’t we are all. I’d rather focus on what I did like which is the locations and challenges. Overall really solid on both. I’ve been saying forever that all India legs feel the same and I wish they’d give us something different, well they finally did and I’m very happy with it. \n\nThe first detour was probably the weakest point for me but it was still a pretty good detour. I really loved the first roadblock. Such a cool blend of modern and historic with a decently difficult mental component and a gorgeous setting what more can I ask for. \n\nI also really enjoyed the second detour. It felt like a classic TAR choice between something that was undesirable to do but hard to mess up(even the team that did the worst at it, Eswar and Asparna, only took a couple attempts) and something that was nonthreatening but potentially time consuming. \n\nThe second roadblock was pretty good, although it seemed that despite every racers set up being “different” it was pretty much just a different napkin design and differently patterned plates arranged the same way. I wish there was more actual variation in the setup which would’ve made it harder to help each other. \n\nThe Route Info task with the costume was a very cool and fun touch that I’m sure the racers appreciated as well. However I will say I was surprised to see that everyone had the same costume, as from my limited knowledge of Indian culture I thought that was traditionally male attire and I expected there to be something different for the female racers. But ¯\\_(ツ)_/¯ \n\nAll in all two great episodes even if they didn’t end the way I would’ve liked", "created_utc": "1606361544.0", "edited": "False", "id": "gdmg83s", "is_submitter": "False", "link_id": "t3_k170re", "parent_id": "t3_k170re", "score": "7", "subreddit": "TheAmazingRace", "subreddit_id": "t5_2stq9"}, {"author": "ben121frank", "body": "I guess you’re right, they could’ve done E+A or G+D but they probably weren’t far enough behind that it would’ve made a difference", "created_utc": "1606359698.0", "edited": "False", "id": "gdmdb4t", "is_submitter": "False", "link_id": "t3_k14xnm", "parent_id": "t1_gdmc3g5", "score": "1", "subreddit": "TheAmazingRace", "subreddit_id": "t5_2stq9"}, {"author": "ben121frank", "body": "According to the blondes it was karma being returned on them for yielding Leo and Alana in Kazakstan", "created_utc": "1606359528.0", "edited": "False", "id": "gdmd184", "is_submitter": "False", "link_id": "t3_k14xnm", "parent_id": "t1_gdmcq87", "score": "3", "subreddit": "TheAmazingRace", "subreddit_id": "t5_2stq9"}, {"author": "ben121frank", "body": "We all knew it was coming but damn does it hurt😔", "created_utc": "1606359448.0", "edited": "False", "id": "gdmcwg7", "is_submitter": "False", "link_id": "t3_k14xnm", "parent_id": "t3_k14xnm", "score": "9", "subreddit": "TheAmazingRace", "subreddit_id": "t5_2stq9"}, {"author": "ben121frank", "body": "I’m sure I’m biased by how much I love the blondes but yielding them again was such a stupid game move especially when you’re literally gonna say shortly after that the Mine 5 is meaningless now", "created_utc": "1606358376.0", "edited": "False", "id": "gdmb6ne", "is_submitter": "False", "link_id": "t3_k14xnm", "parent_id": "t3_k14xnm", "score": "7", "subreddit": "TheAmazingRace", "subreddit_id": "t5_2stq9"}, {"author": "ben121frank", "body": "The three teams who’ve reached the second roadblock so far, it’s the same person doing it that did the first right? Interesting\n\nETA I could be wrong about Riley and Maddison bc I can’t really tell them apart lol", "created_utc": "1606358039.0", "edited": "1606358074.0", "id": "gdmamrr", "is_submitter": "False", "link_id": "t3_k14xnm", "parent_id": "t3_k14xnm", "score": "15", "subreddit": "TheAmazingRace", "subreddit_id": "t5_2stq9"}, {"author": "ben121frank", "body": "Kaylynn figured out the strategy for that roadblock faster than anyone I am impressed", "created_utc": "1606356535.0", "edited": "False", "id": "gdm851v", "is_submitter": "False", "link_id": "t3_k14xnm", "parent_id": "t3_k14xnm", "score": "12", "subreddit": "TheAmazingRace", "subreddit_id": "t5_2stq9"}, {"author": "ben121frank", "body": "“I’m just kind of ready for the mine five to go away” us too buddy us too", "created_utc": "1606356263.0", "edited": "False", "id": "gdm7obi", "is_submitter": "False", "link_id": "t3_k14xnm", "parent_id": "t3_k14xnm", "score": "16", "subreddit": "TheAmazingRace", "subreddit_id": "t5_2stq9"}, {"author": "ben121frank", "body": "I believed they referred to themselves as that during the pit stop rest in Germany", "created_utc": "1606354628.0", "edited": "False", "id": "gdm50g8", "is_submitter": "False", "link_id": "t3_k14xnm", "parent_id": "t1_gdm4uu5", "score": "1", "subreddit": "TheAmazingRace", "subreddit_id": "t5_2stq9"}, {"author": "ben121frank", "body": "Interesting challenges so far not sure how I feel about them. But I’ve been saying forever that every India leg feels the same and I wish they would do something different, this is definitely different so props to them there", "created_utc": "1606354388.0", "edited": "False", "id": "gdm4m97", "is_submitter": "False", "link_id": "t3_k14xnm", "parent_id": "t3_k14xnm", "score": "25", "subreddit": "TheAmazingRace", "subreddit_id": "t5_2stq9"}, {"author": "ben121frank", "body": "Seems like the alliance is already breaking down at least from hung and Chee’s side!", "created_utc": "1606352624.0", "edited": "False", "id": "gdm1oxt", "is_submitter": "False", "link_id": "t3_k14xnm", "parent_id": "t3_k14xnm", "score": "4", "subreddit": "TheAmazingRace", "subreddit_id": "t5_2stq9"}, {"author": "ben121frank", "body": "Scavenger is prob my all time favorite, I think bc I love puzzles and escape rooms and this felt like one\n\nZebras is also really good twofold bc of the awesome fake fighting between Elliot and Olivia and bc it killed off the most annoying character in the show(and by this I mean stuckey, big rip to O’Halloran)\n\nBorn Psychopath is not my favorite by any means(I may never watch it again) but it gets a special mention for being the only episode to actually seriously scare/disturb me", "created_utc": "1606200667.0", "edited": "False", "id": "gdf1y6e", "is_submitter": "False", "link_id": "t3_jzrp7i", "parent_id": "t3_jzrp7i", "score": "5", "subreddit": "SVU", "subreddit_id": "t5_2t476"}, {"author": "ben121frank", "body": "I really enjoyed 29! I definitely would encourage you to continue. Episode 1 is probably the most boring bc it spends so much of the time just establishing and introducing all the teams. But by just a few episodes in the dynamic both within and between teams feels no different than any other season. Also fair warning, there’s a certain bit of episode 2 that’s pretty insufferable to watch(I think you’ll know what I mean as soon as you watch it) but this is the most annoying thing all season so it’s only up from there", "created_utc": "1606162622.0", "edited": "False", "id": "gdd5sm1", "is_submitter": "False", "link_id": "t3_jzjsqa", "parent_id": "t3_jzjsqa", "score": "1", "subreddit": "TheAmazingRace", "subreddit_id": "t5_2stq9"}, {"author": "ben121frank", "body": "Haha this proves my point excellently bc I had forgotten they existed until this comment and even then had to look up to remember what they looked like", "created_utc": "1606104354.0", "edited": "False", "id": "gdaslwu", "is_submitter": "True", "link_id": "t3_jz6e0b", "parent_id": "t1_gda5xj4", "score": "4", "subreddit": "TheAmazingRace", "subreddit_id": "t5_2stq9"}, {"author": "ben121frank", "body": "Hi sorry for the very late reply I pretty much only get on Reddit when I want to share TAR thoughts. To answer about Will and James, interestingly enough I have started to like them a lot more through episodes 5-7. But after episode 4 when I said they were my least favorite it honestly wasn’t hard criticism bc this is such an overall awesome cast. I think I generally don’t like teams that fight with each other and in some seasons Will and James would be on the low side of that but this is a pretty docile cast so theirs stands out. And you are right about the play fighting, I took Gary and Deangelos fights to be all joking and Doug don’t it funny whereas Will and James was real bickering even if inconsequential. I am starting to like them more now, of the 6 remaining they are neck and neck with Riley and Maddison for 3rd place in my ranking. I really respect how dedicated they are to the race. Hopefully this explains it better!", "created_utc": "1606089456.0", "edited": "False", "id": "gda0wbl", "is_submitter": "True", "link_id": "t3_jptpx5", "parent_id": "t1_gbjexl8", "score": "2", "subreddit": "TheAmazingRace", "subreddit_id": "t5_2stq9"}, {"author": "ben121frank", "body": "My personal ranking is prob \n\n1 Kaylynn and Haley\n\n2 Hung and Chee\n\n3 Riley and Maddison\n\n4 Will and James\n\n5 Gary and Deangelo\n\n6 Eswar and Asparna\n\nI don’t dislike any of them really I just find Eswar and Asparna to be boring and not really adding anything", "created_utc": "1606065677.0", "edited": "False", "id": "gd8iwri", "is_submitter": "False", "link_id": "t3_jyyd0h", "parent_id": "t3_jyyd0h", "score": "11", "subreddit": "TheAmazingRace", "subreddit_id": "t5_2stq9"}, {"author": "ben121frank", "body": "There are advantages and disadvantages of both. The things you mentioned are true. However, I find it extremely nice to not have to untangle a chord, to be able to have my phone away from if I’m doing something like gardening, and that I don’t have a chord to get caught on things. Also this one doesn’t make sense since it’s the same shape on both but for some reason I find AirPods more comfortable than the corded apple ones.", "created_utc": "1604953726.0", "edited": "False", "id": "gbr5vsg", "is_submitter": "False", "link_id": "t3_jqxsro", "parent_id": "t3_jqxsro", "score": "1", "subreddit": "unpopularopinion", "subreddit_id": "t5_2tk0s"}, {"author": "ben121frank", "body": "I have autism and I agree, hearing about all the things “normal” people think about honestly sounds exhausting", "created_utc": "1601066634.0", "edited": "False", "id": "g6kkzbz", "is_submitter": "False", "link_id": "t3_izlj6l", "parent_id": "t3_izlj6l", "score": "1", "subreddit": "unpopularopinion", "subreddit_id": "t5_2tk0s"}, {"author": "ben121frank", "body": "There’s a lot of red flags here and you’re totally right to be suspicious. However I would like to add one thing: “privileged upbringing” and abusive upbringing are not mutually exclusive. Plenty of rich people abuse their kids and it’s actually quite common for them to use money/expensive gifts to pacify the kids into staying quiet and/or try to buy back their love.", "created_utc": "1598706005.0", "edited": "False", "id": "g38jcqh", "is_submitter": "False", "link_id": "t3_iinhzs", "parent_id": "t3_iinhzs", "score": "1", "subreddit": "relationship_advice", "subreddit_id": "t5_2r0cn"}, {"author": "ben121frank", "body": "Is he trying to force veganism or vegetarianism on you? That’s the only way I could justify OP being in the right here, and I don’t see any indication of that in the post. Otherwise, I see it as you not being supportive of something that’s important to him. And if that’s where you’re at I would honestly break up with him because there doesn’t seem to be a very deep connection. \n\nAlso want to add, others in the comments have likened it to food allergies. As someone with celiac I have a great deal of respect for vegans/vegetarians/other “by choice” diets bc I have a very tangible(ie painful) reason not to eat gluten and they do it sheerly by the strength of their willpower. And I think their preferences are equally important as allergies", "created_utc": "1598107954.0", "edited": "False", "id": "g2h5hri", "is_submitter": "False", "link_id": "t3_iegz4b", "parent_id": "t3_iegz4b", "score": "5", "subreddit": "relationship_advice", "subreddit_id": "t5_2r0cn"}, {"author": "ben121frank", "body": "I personally don’t automatically associate an actual (arch shaped) rainbow as LGBTQ. Horizontal rainbow stripes more so bc that looks like a pride flag, but even then you can often differentiate what’s meant to look like pride vs what’s not", "created_utc": "1597717292.0", "edited": "False", "id": "g1xuv9t", "is_submitter": "False", "link_id": "t3_iboj5s", "parent_id": "t3_iboj5s", "score": "0", "subreddit": "unpopularopinion", "subreddit_id": "t5_2tk0s"}, {"author": "ben121frank", "body": "https://www.enneagraminstitute.com/type-descriptions", "created_utc": "1597707706.0", "edited": "False", "id": "g1xdf3s", "is_submitter": "False", "link_id": "t3_iblqkb", "parent_id": "t1_g1xbi4v", "score": "10", "subreddit": "ifyoulikeblank", "subreddit_id": "t5_2sekf"}, {"author": "ben121frank", "body": "I second this! The kid does an incredible job at being deeply creepy and unsettling", "created_utc": "1597457077.0", "edited": "False", "id": "g1if4bl", "is_submitter": "False", "link_id": "t3_i9xc4f", "parent_id": "t1_g1i4f22", "score": "4", "subreddit": "SVU", "subreddit_id": "t5_2t476"}, {"author": "ben121frank", "body": "I was under the impression that people pushing schools to open understood a lot of students and teachers were gonna get covid and some were gonna die and had just decided that was acceptable. But now this makes me think, they really thought they could operate and not get any cases?? I’m truly in shock at the level of disillusion and removal from reality. What is going on in their brains, are they ok? I’m concerned for them", "created_utc": "1596655026.0", "edited": "False", "id": "g0h6lmy", "is_submitter": "False", "link_id": "t3_i43p7u", "parent_id": "t3_i43p7u", "score": "0", "subreddit": "Coronavirus", "subreddit_id": "t5_2x4yx"}, {"author": "ben121frank", "body": "Haven’t watched much YouTube lately but back in like 2015 my fave was Rhett and Link and the only reason I got into their stuff is bc they were the only YouTubers who could actually do the things they claim they’re gonna without dissolving into a fit of giggles every 5 seconds. So ya giggling incessantly and barely actually doing anything bc of it is my answer", "created_utc": "1596160002.0", "edited": "False", "id": "fztfvu8", "is_submitter": "False", "link_id": "t3_i0orws", "parent_id": "t3_i0orws", "score": "3", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "ben121frank", "body": "Agree about undercover, at the end when she handcuffs the guard and says “who’s the bitch now?” is probably my singular favorite svu moment. Also the fake fighting scene with Elliot in zebras, and (don’t know the episode title) when she is undercover filling out the unemployment application and writes special victims unit and the creepy guy realizes he’s nailed", "created_utc": "1596085188.0", "edited": "False", "id": "fzp7ane", "is_submitter": "False", "link_id": "t3_i08oo8", "parent_id": "t3_i08oo8", "score": "1", "subreddit": "SVU", "subreddit_id": "t5_2t476"}, {"author": "ben121frank", "body": "The bridge of All too well I think? I’ve seen people make mashups of that and it flows really well", "created_utc": "1596034354.0", "edited": "False", "id": "fzmjs72", "is_submitter": "False", "link_id": "t3_hwuj29", "parent_id": "t1_fzkxnzy", "score": "3", "subreddit": "TaylorSwift", "subreddit_id": "t5_2rlwe"}, {"author": "ben121frank", "body": "Donna in Mamma Mia 2. There was 0 reason for that movie to be as sad as it was. Like who asked for the sequel to Mamma Mia to make them cry??", "created_utc": "1595423181.0", "edited": "False", "id": "fyv9vyj", "is_submitter": "False", "link_id": "t3_hvmyua", "parent_id": "t3_hvmyua", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "ben121frank", "body": "Might I submit for consideration: [this ](https://ih1.redbubble.net/image.889884509.5927/bg,f8f8f8-flat,750x,075,f-pad,750x1000,f8f8f8.jpg)", "created_utc": "1595001483.0", "edited": "False", "id": "fydcp25", "is_submitter": "False", "link_id": "t3_hsmmm8", "parent_id": "t3_hsmmm8", "score": "2", "subreddit": "starterpacks", "subreddit_id": "t5_34o9s"}, {"author": "ben121frank", "body": "I think the key is to acknowledge and condemn their wrong actions, such as owning slaves, while also understanding this doesn’t negate their (in my opinion) positive actions, such as leading the American Revolution. The way I look at it, I am not sure what the next major cultural shift will be, but I suspect it might be humanity moving away from eating meat and into an all vegan lifestyle. In this case, I hope that the things I am doing now, my genuine efforts to advance justice and equality as best I know how, are not later slandered bc I eat meat. If we decide meat is wrong then I can be slandered for my meat eating but I hope my positive actions can be removed from that slander and viewed for what they are/were", "created_utc": "1594265260.0", "edited": "False", "id": "fxdxdpw", "is_submitter": "False", "link_id": "t3_hn9e0s", "parent_id": "t3_hn9e0s", "score": "2", "subreddit": "changemyview", "subreddit_id": "t5_2w2s8"}, {"author": "ben121frank", "body": "I don’t necessarily disagree but I think you are creating a false equivalence between gender and being a furry. To me they are not the same level of importance bc your gender is something that everyone either knows or assumes, and will impact in one way or another(maybe just which pronouns people use or maybe bigger) pretty much every interaction that you have. Being a furry would not come up in most situations unless you were specifically talking about your sexual( or non sexual? idrk much about furries) proclivities, which you would not be in most situations. So therefore these 2 issues don’t deserve the same amount of attention. And to make this statement is somewhat harmful to me bc I think it trivializes gender, pitting it into a category with “hobby” level things. Yes such as being a furry, but also more mundane such as being say into paleontology. Neither is likely to come up in an interaction with the grocery store cashier, whereas the cashier likely will refer to you in a gendered way bc this is the nature of our language(in English at least)", "created_utc": "1594264703.0", "edited": "False", "id": "fxdwhma", "is_submitter": "False", "link_id": "t3_hnb18w", "parent_id": "t3_hnb18w", "score": "1", "subreddit": "changemyview", "subreddit_id": "t5_2w2s8"}, {"author": "ben121frank", "body": "Interesting. My immediate thought reading this I see it as akin to a very similar debate about “person first” vs “identity first” language in the autistic community. I.e. “person with autism” vs “autistic person”. And this is a frequent debate, traditionally with the Autism Speaks camp preferring the first and autism self advocates preferring the second. And that leads to my point, which is, as an autistic person I do not care. I use both interchangeably, either randomly or whatever makes the most sense grammatically in the context. And I’ve never understand why it’s such a big deal. In my mind they’re the same thing; that’s how language works. So I see this post as a very similar situation-2 ways to say the same thing. And perhaps my view needs to be changed too but I do not see any difference(except syntactically) between the two or any benefit of one over the other", "created_utc": "1594263011.0", "edited": "False", "id": "fxdtpvq", "is_submitter": "False", "link_id": "t3_hnta1v", "parent_id": "t3_hnta1v", "score": "3", "subreddit": "changemyview", "subreddit_id": "t5_2w2s8"}, {"author": "ben121frank", "body": "I love this and I’d love to see the full rule book if you have it!", "created_utc": "1592859375.0", "edited": "False", "id": "fvobvyv", "is_submitter": "False", "link_id": "t3_hdtyyc", "parent_id": "t1_fvnnwmp", "score": "3", "subreddit": "TheAmazingRace", "subreddit_id": "t5_2stq9"}, {"author": "ben121frank", "body": "My mistake I don’t know much about it sorry", "created_utc": "1591796131.0", "edited": "False", "id": "ftl19q2", "is_submitter": "True", "link_id": "t3_h042ne", "parent_id": "t1_ftkdscp", "score": "4", "subreddit": "nextfuckinglevel", "subreddit_id": "t5_m0bnr"}, {"author": "ben121frank", "body": "I didn’t mean to clickbait anybody so sorry if I did but I don’t understand how it is, it is the coolest skateboarding I’ve ever seen and there is a city burning in the background?", "created_utc": "1591795990.0", "edited": "False", "id": "ftl10ze", "is_submitter": "True", "link_id": "t3_h042ne", "parent_id": "t1_ftkzd06", "score": "1", "subreddit": "nextfuckinglevel", "subreddit_id": "t5_m0bnr"}, {"author": "ben121frank", "body": "No direct spoilers of who wins prior seasons, but you will be able to extrapolate from the results of 17/info given during it who *doesn’t* win prior seasons", "created_utc": "1591634647.0", "edited": "False", "id": "ftducwk", "is_submitter": "False", "link_id": "t3_gxvkcb", "parent_id": "t3_gxvkcb", "score": "1", "subreddit": "TheAmazingRace", "subreddit_id": "t5_2stq9"}, {"author": "ben121frank", "body": "Love this idea! Was also think you could have an “all star challenges” season where it featured all the best/coolest/most unique challenges of all time", "created_utc": "1591634479.0", "edited": "False", "id": "ftdu0pn", "is_submitter": "False", "link_id": "t3_gyw5oc", "parent_id": "t1_ftdacsr", "score": "5", "subreddit": "TheAmazingRace", "subreddit_id": "t5_2stq9"}, {"author": "ben121frank", "body": "Would I watch it? Yes\n\nWould I enjoy it? Probably \n\nBut would I prefer this over a normal new season? Absolutely not", "created_utc": "1591634369.0", "edited": "False", "id": "ftdtsoo", "is_submitter": "False", "link_id": "t3_gyw5oc", "parent_id": "t3_gyw5oc", "score": "11", "subreddit": "TheAmazingRace", "subreddit_id": "t5_2stq9"}, {"author": "ben121frank", "body": "And who writes the message on the outside of the envelope anyway??", "created_utc": "1591546586.0", "edited": "False", "id": "fta2fgr", "is_submitter": "False", "link_id": "t3_gy9pep", "parent_id": "t3_gy9pep", "score": "1", "subreddit": "sadcringe", "subreddit_id": "t5_2wsc9"}, {"author": "ben121frank", "body": "Check out Nahko and Medicine for the People. They are considered as “world music” but there is a lot of Native American influence specifically. My favorite album by them is On the Verge", "created_utc": "1591404528.0", "edited": "False", "id": "ft1axh5", "is_submitter": "False", "link_id": "t3_gx8snz", "parent_id": "t3_gx8snz", "score": "1", "subreddit": "ifyoulikeblank", "subreddit_id": "t5_2sekf"}, {"author": "ben121frank", "body": "I’m just confused how people wearing gas masks automatically prevents the protest from being peaceful. Gas masks are not...a weapon?", "created_utc": "1591315567.0", "edited": "False", "id": "fsx395v", "is_submitter": "False", "link_id": "t3_gwktpy", "parent_id": "t3_gwktpy", "score": "2", "subreddit": "MurderedByWords", "subreddit_id": "t5_3hx3r"}, {"author": "ben121frank", "body": "On my personal social media I’ve seen a lot of people accusing other people of being “performative allies.” This may be true but I consider that many of these people have never been any kind of activist before. This very well may be the first time they’ve ever spoke out in any way about a cause that doesn’t directly affect them. So sure we all need to be doing more than just posting, but I appreciate the start, especially for those new to activism", "created_utc": "1591195778.0", "edited": "False", "id": "fsr2u31", "is_submitter": "False", "link_id": "t3_gvkqe8", "parent_id": "t3_gvkqe8", "score": "1", "subreddit": "TooAfraidToAsk", "subreddit_id": "t5_2ssp7"}, {"author": "ben121frank", "body": "Watching 23 rn(no spoilers rn please I’m not done) and I would say Tim of Tim and Marie. He seems like a pretty competent guy, a little dumb maybe but good at the challenges and poor dude has Marie constantly yelling at him. One scene maybe around Leg 8 they’re in a taxi going to the airport and she’s going off on him about some random thing and he just looks so done I felt sorry for him", "created_utc": "1591149800.0", "edited": "False", "id": "fspav6r", "is_submitter": "False", "link_id": "t3_gvisy9", "parent_id": "t3_gvisy9", "score": "10", "subreddit": "TheAmazingRace", "subreddit_id": "t5_2stq9"}, {"author": "ben121frank", "body": "Dressing as pocohantas is totally fine to me. Dressing as “native American” in general is something I wouldn’t let my child do, bc I feel like that perpetuates the idea that other people’s cultures are dress up fodder and thus minimizes them", "created_utc": "1590627085.0", "edited": "False", "id": "fs1f9ms", "is_submitter": "False", "link_id": "t3_grtwnf", "parent_id": "t3_grtwnf", "score": "2", "subreddit": "unpopularopinion", "subreddit_id": "t5_2tk0s"}, {"author": "ben121frank", "body": "17’s great pretty universally loved, I also love 14 but I think that one is less popular", "created_utc": "1590249688.0", "edited": "False", "id": "frk52vr", "is_submitter": "False", "link_id": "t3_goyvph", "parent_id": "t3_goyvph", "score": "3", "subreddit": "TheAmazingRace", "subreddit_id": "t5_2stq9"}, {"author": "ben121frank", "body": "Agree. I made a post a few days ago complaining about America and though I didn’t say it in that post I there recognize there’s still a lot to be grateful for in America. The reason I(and I think many other Americans) are upset is bc while America is highly developed it feels like it does the absolute minimum by developed country standards for its citizens and we just know it could be so much better", "created_utc": "1590243983.0", "edited": "False", "id": "frjvh7o", "is_submitter": "False", "link_id": "t3_gp29yy", "parent_id": "t3_gp29yy", "score": "1", "subreddit": "unpopularopinion", "subreddit_id": "t5_2tk0s"}, {"author": "ben121frank", "body": "Stuckey was annoying didn’t mind seeing him fall out of grace like that. But O’Halloran didn’t need to die still sad about that one. But on the plus side I really did enjoy seeing Olivia and Elliott “fight”, it really showcased how strong their relationship is", "created_utc": "1590026829.0", "edited": "False", "id": "frav0y8", "is_submitter": "False", "link_id": "t3_gnnlnc", "parent_id": "t3_gnnlnc", "score": "31", "subreddit": "SVU", "subreddit_id": "t5_2t476"}, {"author": "ben121frank", "body": "True there are idiots everywhere. Maybe I should have made the title more specific bc I am referring in the post to the weird American “freedom” boner which in my experience is uniquely American", "created_utc": "1589986612.0", "edited": "False", "id": "fr8ung2", "is_submitter": "False", "link_id": "t3_gncnow", "parent_id": "t1_fr8tzwf", "score": "-11", "subreddit": "unpopularopinion", "subreddit_id": "t5_2tk0s"}, {"author": "ben121frank", "body": "Myflixer is the least shady seeming illegal streaming site I’ve ever come across and it has all the seasons", "created_utc": "1589984727.0", "edited": "False", "id": "fr8r3tx", "is_submitter": "False", "link_id": "t3_gn8iu0", "parent_id": "t3_gn8iu0", "score": "1", "subreddit": "SVU", "subreddit_id": "t5_2t476"}, {"author": "ben121frank", "body": "Ya well she was basically making the statement that “doing his job” was kidnapping", "created_utc": "1589942542.0", "edited": "False", "id": "fr79sx2", "is_submitter": "False", "link_id": "t3_gn2zes", "parent_id": "t3_gn2zes", "score": "5", "subreddit": "SVU", "subreddit_id": "t5_2t476"}, {"author": "ben121frank", "body": "This is one of the answers I was thinking about. I personally have no moral problem eating meat but the ways we currently produce it, beef mostly, are incredibly (negatively) impactful to the environment so I sincerely hope that changes. Although I do like meat so I hope we can create more sustainable methods and continue eating it", "created_utc": "1589767369.0", "edited": "False", "id": "fqzhb24", "is_submitter": "True", "link_id": "t3_glrb2o", "parent_id": "t1_fqzb71a", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "ben121frank", "body": "One of my favorite seasons! Glad you’re enjoying. I made a post about them actually a while ago, Misti and Jim I agree are overly cocky but I really like their equal dynamic and how Jim lets Misti contribute bc that’s rare in the “M/F power couple” archetype teams\nEDIT for OP: probably don’t read the aforementioned post before you finish the season bc I think it will spoil it for you", "created_utc": "1589746496.0", "edited": "1589746681.0", "id": "fqycsac", "is_submitter": "False", "link_id": "t3_glkv3s", "parent_id": "t3_glkv3s", "score": "7", "subreddit": "TheAmazingRace", "subreddit_id": "t5_2stq9"}, {"author": "ben121frank", "body": "I read this title as “burglars” and I was really confused if biting was a new robbery defense mechanism and what the robbers height would have to do with it", "created_utc": "1588802027.0", "edited": "False", "id": "fppgupu", "is_submitter": "False", "link_id": "t3_gektdv", "parent_id": "t3_gektdv", "score": "2", "subreddit": "unpopularopinion", "subreddit_id": "t5_2tk0s"}, {"author": "ben121frank", "body": "I didn’t really like them but after they got eliminated my enjoyment of watching went down significantly. They were great entertainment if nothing else", "created_utc": "1588529654.0", "edited": "False", "id": "fpdm1lh", "is_submitter": "False", "link_id": "t3_gcqsho", "parent_id": "t3_gcqsho", "score": "3", "subreddit": "TheAmazingRace", "subreddit_id": "t5_2stq9"}, {"author": "ben121frank", "body": "Thanks for this correction. When I read the initial title I thought China wasn’t or at least doesn’t feel overused bc they have showcased many different aspects of it, from big cities to rural and modern to traditional. The one that feels the most overused to me is India bc it always feel the exact same every time they go there", "created_utc": "1588179623.0", "edited": "False", "id": "foyuwq2", "is_submitter": "False", "link_id": "t3_gac1v0", "parent_id": "t1_foynqu6", "score": "2", "subreddit": "TheAmazingRace", "subreddit_id": "t5_2stq9"}, {"author": "ben121frank", "body": "I really like this idea; I know I’d play it! I do have a question tho, how structured are you thinking? Like true sandbox, traditional quest/objective based with the quests being sequential cases, or a combination where come across the cases sandbox style but once you find them play through each case in a set structure? Or something else entirely?", "created_utc": "1588179493.0", "edited": "False", "id": "foyunvl", "is_submitter": "False", "link_id": "t3_gaaye0", "parent_id": "t3_gaaye0", "score": "3", "subreddit": "SVU", "subreddit_id": "t5_2t476"}, {"author": "ben121frank", "body": "I agree, and I’ve been called transphobic for it. I will say however a lot of the language you used in your post is kinda disrespectful towards trans people; I do think it’s possible to have this opinion while still respecting them and I think that would make it go farther. But my thinking is, the only inherent point of sports is the integrity of the athletic competition. If you ruin that then the whole thing has no point at all. To me it’s akin to letting, for example, a 12 year old compete in the 10 year old division. That 12 year old has inherent advantage, as do trans people in some(not all I don’t think) circumstances. It doesn’t reflect on the person at all, bc again the only point of the sport is the athletic competition. But if we don’t keep that fair and genuine why even have sports at all?", "created_utc": "1588179140.0", "edited": "False", "id": "foytzwv", "is_submitter": "False", "link_id": "t3_ga96t0", "parent_id": "t3_ga96t0", "score": "1", "subreddit": "unpopularopinion", "subreddit_id": "t5_2tk0s"}, {"author": "ben121frank", "body": "Oh wow that is wild. I wasn’t old enough to really have an email before the gmail age so when I saw that episode I kinda thought it was another(earlier version lol) of SVU’s dramatic misrepresentations of social media", "created_utc": "1588101094.0", "edited": "False", "id": "fovgv1d", "is_submitter": "False", "link_id": "t3_g9ecpf", "parent_id": "t3_g9ecpf", "score": "3", "subreddit": "SVU", "subreddit_id": "t5_2t476"}, {"author": "ben121frank", "body": "I don’t remember what episode it was but I think it was a child porn one in season one and there was a whole subplot about people getting randomly emailed porn in their emails. Was that ever a real concern at one point?", "created_utc": "1588086743.0", "edited": "False", "id": "foumhnr", "is_submitter": "False", "link_id": "t3_g9ecpf", "parent_id": "t3_g9ecpf", "score": "3", "subreddit": "SVU", "subreddit_id": "t5_2t476"}, {"author": "ben121frank", "body": "You’re over generalizing but I get the complaint. As a (not that good but pretty consistent and serious) cyclist my idea of share the road is that everyone follows the rules of it and thus everyone gets equal access to it. Breaking cadence is annoying so I’ll roll through stops if there’s absolutely no one around but if there’s anyone anywhere close-car, bike, even pedestrian, I’m stopping, setting my feet, and looking both ways before I cross. I also take up my whole lane bc that’s safest, but I stay predictable in it. Cyclists who roll through stops past cars, weave in and out of traffic, etc terrify me. At that point you’re not sharing the road you’re being a nuisance to everyone else on it", "created_utc": "1587940164.0", "edited": "False", "id": "foojfxn", "is_submitter": "False", "link_id": "t3_g8hx29", "parent_id": "t3_g8hx29", "score": "24", "subreddit": "unpopularopinion", "subreddit_id": "t5_2tk0s"}, {"author": "ben121frank", "body": "I agree, this isn’t a top tier season necessarily but it’s a solid one and I enjoyed it. It also really got stronger towards the end, super enjoyable final 5", "created_utc": "1587910441.0", "edited": "False", "id": "fon24jm", "is_submitter": "False", "link_id": "t3_g7b74o", "parent_id": "t1_fog2gqx", "score": "2", "subreddit": "TheAmazingRace", "subreddit_id": "t5_2stq9"}, {"author": "ben121frank", "body": "https://m.youtube.com/watch?v=ycrhIpd4ZWU\n\nFlorence and the Machine’s cover of Addicted to Love. It’s how I think the song really should sound, bc if you listen to the lyrics they’re quite creepy but the original upbeat poppy song kinda makes you forget that", "created_utc": "1587765108.0", "edited": "False", "id": "fohfl5t", "is_submitter": "False", "link_id": "t3_g7db8q", "parent_id": "t3_g7db8q", "score": "5", "subreddit": "ifyoulikeblank", "subreddit_id": "t5_2sekf"}, {"author": "ben121frank", "body": "I haven’t seen 30 and just started 28 but 27,29, and 31 are all really solid seasons in my opinion", "created_utc": "1587580135.0", "edited": "False", "id": "fo7l0u6", "is_submitter": "False", "link_id": "t3_g65yli", "parent_id": "t3_g65yli", "score": "5", "subreddit": "TheAmazingRace", "subreddit_id": "t5_2stq9"}, {"author": "ben121frank", "body": "Yep and I’m assuming the reason they have yet to/probably never will get a 4th detective is so they can continue to justify it", "created_utc": "1587576377.0", "edited": "False", "id": "fo7dam1", "is_submitter": "False", "link_id": "t3_g64vrf", "parent_id": "t1_fo7cjju", "score": "33", "subreddit": "SVU", "subreddit_id": "t5_2t476"}, {"author": "ben121frank", "body": "I agree. I used to say I liked all genres except rap and talk pretty bad about rap and even say rap wasn’t really music. Now I realize that even if I don’t personally like rap too, I can see what it means to others and how it makes them feel and that is very real. And since I have tried to open my mind about it I have even come to enjoy some of it in certain circumstances", "created_utc": "1587564208.0", "edited": "False", "id": "fo6pjzn", "is_submitter": "False", "link_id": "t3_g5vh10", "parent_id": "t3_g5vh10", "score": "1", "subreddit": "unpopularopinion", "subreddit_id": "t5_2tk0s"}, {"author": "ben121frank", "body": "Yep. Blind obedience to your government without a healthy amount of distrust or lease critical thinking is not patriotism, it’s nationalism", "created_utc": "1587479284.0", "edited": "False", "id": "fo32h3v", "is_submitter": "False", "link_id": "t3_g4yd5f", "parent_id": "t3_g4yd5f", "score": "1", "subreddit": "unpopularopinion", "subreddit_id": "t5_2tk0s"}, {"author": "ben121frank", "body": "She’s certainly not oppressed with her hundreds of millions of dollars and ya she has it better than almost everyone else regardless of gender, but from the standpoint of being a celebrity there’s still some gross shit she has to deal with that she *probably* wouldn’t if she was a man. For example Kid Rock was under fire a while ago for a gross tweet where he insinuated she had only gotten famous by sucking dicks. Also I don’t think she’s overrated as an artist bc I really enjoy all her music and you have to be talented to make good music across such a broad genre range. With the exception of reputation that one was not a good experiment lol", "created_utc": "1587478982.0", "edited": "False", "id": "fo31xkz", "is_submitter": "False", "link_id": "t3_g5861h", "parent_id": "t3_g5861h", "score": "4", "subreddit": "unpopularopinion", "subreddit_id": "t5_2tk0s"}, {"author": "ben121frank", "body": "You might check out the Amoeba People. Their songs are all about nature, very literally", "created_utc": "1587432894.0", "edited": "False", "id": "fo1gojh", "is_submitter": "False", "link_id": "t3_g51h39", "parent_id": "t3_g51h39", "score": "2", "subreddit": "ifyoulikeblank", "subreddit_id": "t5_2sekf"}, {"author": "ben121frank", "body": "Well Forensic Files if I’m not mistaken is actually examining the forensic details of real life cases. And we all know how bs \"The following story is fictional and does not depict any actual person or event” is. So if I’m anything I’m guessing they just were based from the same real life case", "created_utc": "1587432752.0", "edited": "False", "id": "fo1gg55", "is_submitter": "False", "link_id": "t3_g55pvj", "parent_id": "t3_g55pvj", "score": "8", "subreddit": "SVU", "subreddit_id": "t5_2t476"}, {"author": "ben121frank", "body": "I’ll wear pants several times before washing, but usually a shirt only once. Anyone else like that?", "created_utc": "1587349780.0", "edited": "False", "id": "fnxzgfn", "is_submitter": "False", "link_id": "t3_g4fbi1", "parent_id": "t3_g4fbi1", "score": "2", "subreddit": "unpopularopinion", "subreddit_id": "t5_2tk0s"}, {"author": "ben121frank", "body": "Congratulations my friend! Excelsior!", "created_utc": "1587327387.0", "edited": "False", "id": "fnwxhzh", "is_submitter": "False", "link_id": "t3_g4eemp", "parent_id": "t3_g4eemp", "score": "2", "subreddit": "CongratsLikeImFive", "subreddit_id": "t5_3i2mz"}, {"author": "ben121frank", "body": "I’m not sure about their own personal convictions but I’m pretty they would all fight for victims right to an abortion since New York law is pretty liberal on that and it’s their job to uphold it", "created_utc": "1587320324.0", "edited": "False", "id": "fnwkvaz", "is_submitter": "False", "link_id": "t3_g3yuhk", "parent_id": "t3_g3yuhk", "score": "2", "subreddit": "SVU", "subreddit_id": "t5_2t476"}, {"author": "ben121frank", "body": "I agree FotB is a different sound than their earlier stuff but I still really like it! Thanks for the rec tho I’ll check out Rostam!", "created_utc": "1587319659.0", "edited": "False", "id": "fnwjo54", "is_submitter": "False", "link_id": "t3_g49tmf", "parent_id": "t3_g49tmf", "score": "23", "subreddit": "ifyoulikeblank", "subreddit_id": "t5_2sekf"}, {"author": "ben121frank", "body": "Ya I agree, that would be cool to see! The show has always been on the progressive edge so I don’t think it’s particularly unlikely that we will sometime in 22-24. Also the squad has always been really accepting and accommodating so I personally believe they all would use they/them pronouns(I think that is what you are referring to) if their Vic did", "created_utc": "1587243506.0", "edited": "False", "id": "fntkjkn", "is_submitter": "False", "link_id": "t3_g3hnbs", "parent_id": "t1_fntiy6v", "score": "2", "subreddit": "SVU", "subreddit_id": "t5_2t476"}, {"author": "ben121frank", "body": "Ok well sorry if I offended but take comfort in the fact that at least as I use it, “boomer” is ageless. It’s more just in the disposition and getting angry at others happiness when it looks different than your own. If that’s not you then maybe I misinterpreted your original comment and if I did apologies. \n\nI tend to agree with you that the personal relationships are never the best part and I think they show them too much. Especially now, it’s great that Benson and Rollins are moms but I really don’t need to see their children every episode; I didn’t forget they had them lol. But accepting that they’re gonna show of personal lives like it or not, how is Kat being bi shoehorned in? \n\nPeople are gay/bi/trans in real life. A significant proportion are(10% is likely a low estimate). And the show has had ~20 major recurring characters, of which Kat is the 2nd to be (possibly, we don’t even technically know yet) portrayed as gay. Shoehorning would be if they randomly decided Olivia was a lesbian after showing her attracted to men for 20 years. And ya, that would be terrible writing and piss me off greatly. But Kat is a brand new character, they’re creating her whole character from scratch, there’s no reason other than homophobia she shouldn’t be gay.", "created_utc": "1587242991.0", "edited": "False", "id": "fntjngi", "is_submitter": "True", "link_id": "t3_g3pg7x", "parent_id": "t1_fntff17", "score": "5", "subreddit": "SVU", "subreddit_id": "t5_2t476"}, {"author": "ben121frank", "body": "I agree for the reasons you said and also bc a lot of the cakes and such are based on really gross gender stereotypes. Like I’m ok with “bow ties or bows” cus objectively most people who wear bow ties are male and most people who wear bows are female. Ofc everyone can wear what they want you do you boo like this is pretty true and inoffensive. But I’ve literally seen one that said “Doctor or nurse? What’s it’s gonna be? Cut to see” that shit is disgusting", "created_utc": "1587240849.0", "edited": "False", "id": "fntfxbb", "is_submitter": "False", "link_id": "t3_g3ljpz", "parent_id": "t3_g3ljpz", "score": "1", "subreddit": "unpopularopinion", "subreddit_id": "t5_2tk0s"}, {"author": "ben121frank", "body": "Ok boomer\n\nThis is a very dumb comment bc it seems to imply that Benson and Stabler’s love life’s aren’t major plot points when Olivia’s various boyfriends and hookups have been frequently featured over the whole series and Elliott’s wife wasn’t mentioned in nearly every episode. Which they both very much were. Munch also talked sometimes about his exes, not sure about Fin. And it’s also strange bc you seem like to act like Kat’s love life is a major plot point when it’s literally been mentioned once, in this three word comment that I think a lot of people didn’t even notice. Stay pressed I guessed and I will continue to enjoy one of my favorite shows", "created_utc": "1587238137.0", "edited": "False", "id": "fntb4kb", "is_submitter": "True", "link_id": "t3_g3pg7x", "parent_id": "t1_fnt70j7", "score": "13", "subreddit": "SVU", "subreddit_id": "t5_2t476"}, {"author": "ben121frank", "body": "This was one of my faves this season, reminded me of older SVU with a good twist and some real investigation. Maybe I’m just dumb(very distinct possibility) but I did not see it coming at all that the bartender was gonna be involved", "created_utc": "1587226865.0", "edited": "False", "id": "fnsqi3d", "is_submitter": "False", "link_id": "t3_g3h7cv", "parent_id": "t3_g3h7cv", "score": "9", "subreddit": "SVU", "subreddit_id": "t5_2t476"}, {"author": "ben121frank", "body": "Winnie ille Pu! Quoque habēo librum!", "created_utc": "1587225204.0", "edited": "False", "id": "fnsnile", "is_submitter": "False", "link_id": "t3_g3iija", "parent_id": "t1_fnrka8b", "score": "2", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "ben121frank", "body": "Considering they’ve had several trans vics and the whole squad always uses the correct pronouns for them I kind of doubt this", "created_utc": "1587223812.0", "edited": "False", "id": "fnsl24c", "is_submitter": "False", "link_id": "t3_g3hnbs", "parent_id": "t3_g3hnbs", "score": "9", "subreddit": "SVU", "subreddit_id": "t5_2t476"}, {"author": "ben121frank", "body": "They seem longer and shorter to me at the same time lol. Longer because so much happens but shorter bc it’s so exciting and moves at a fast pace. The new one feels short bc basically nothing happens but long bc they drag it out forever and ever", "created_utc": "1587220070.0", "edited": "False", "id": "fnsesx9", "is_submitter": "False", "link_id": "t3_g3frk1", "parent_id": "t3_g3frk1", "score": "5", "subreddit": "SVU", "subreddit_id": "t5_2t476"}, {"author": "ben121frank", "body": "They’re Coming to Take Me Away by Napoleon XIV. Normal version is kinda creepy but also annoying. But there’s a backwards version on YouTube that when accompanied by the trippy video is nightmare fuel to me", "created_utc": "1587137699.0", "edited": "False", "id": "fnp1q4o", "is_submitter": "False", "link_id": "t3_g2vhha", "parent_id": "t3_g2vhha", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "ben121frank", "body": "Idk about the recipes but most of the crafts look like they would “work” in the sense you could make them it’s just, why the hell would you want to?", "created_utc": "1587134302.0", "edited": "False", "id": "fnovcf6", "is_submitter": "False", "link_id": "t3_g2rdgh", "parent_id": "t1_fnnuswe", "score": "2", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "ben121frank", "body": "cred to @casslynnmark_ on tiktok", "created_utc": "1587070552.0", "edited": "False", "id": "fnmfm2l", "is_submitter": "True", "link_id": "t3_g2nck9", "parent_id": "t3_g2nck9", "score": "13", "subreddit": "SVU", "subreddit_id": "t5_2t476"}, {"author": "ben121frank", "body": "I agree! Where I’m from it was a fairly popular birthday party idea for a kid to have it at a hotel, parents would get a room or two depending how many kids there were, we would swim in the pool, ride the elevator up and down, eat room service etc. Good times", "created_utc": "1587069195.0", "edited": "False", "id": "fnmcyz7", "is_submitter": "False", "link_id": "t3_g2k2t8", "parent_id": "t3_g2k2t8", "score": "1", "subreddit": "unpopularopinion", "subreddit_id": "t5_2tk0s"}, {"author": "ben121frank", "body": "Fair but I didn’t even mean just on Reddit it’s like everywhere online and also in real life people get heated about it", "created_utc": "1587055301.0", "edited": "False", "id": "fnlkxa2", "is_submitter": "True", "link_id": "t3_g2ict3", "parent_id": "t1_fnlkpm6", "score": "4", "subreddit": "unpopularopinion", "subreddit_id": "t5_2tk0s"}, {"author": "ben121frank", "body": "Yep. They’re so hyper specific that I’m convinced most people who have a record is because they’re the only person who’s bothered to try(or get it recorded at least). \n\nBut ya bro congrats on having the world record for farthest throw of a toilet paper tube from your knees using only your left pinky starting at the free throw line of a regulation basketball court that’s also on the deck of an aircraft carrier!", "created_utc": "1587051113.0", "edited": "False", "id": "fnlci75", "is_submitter": "False", "link_id": "t3_g20ka0", "parent_id": "t1_fniuazd", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "ben121frank", "body": "It’s been a long time since I’ve watched it but I remember really enjoying it. I may go back and rewatch soon. I remember thinking after the fact though that I didn’t think the Beekmans were as weak as everyone else seemed to. Like they overcame I think 2 speed bumps, and throughout the whole season especially at the end they were very smart and strategic. They weren’t traditional power players but I think they were still a strong team just in a way the race hadn’t really seen before. And also I’m of the opinion you can’t survive the entire race and win without being pretty darn good(even if you also have a lot of luck on your side.)", "created_utc": "1587044546.0", "edited": "False", "id": "fnl0o4d", "is_submitter": "False", "link_id": "t3_g22acl", "parent_id": "t3_g22acl", "score": "3", "subreddit": "TheAmazingRace", "subreddit_id": "t5_2stq9"}, {"author": "ben121frank", "body": "So I am a Christian but a very “hippy” far out one from one of the most liberal Christian denominations and my own personal understanding that I have come to peace with is this: God is love. God created humanity with free will. This is the most loving aspect of our design, because the opposite of love is control. Because of this, some humans have strayed very far from God’s vision of love and have done horrible things that then lead to more horrible things. I love to talk to atheists too because I enjoy hearing their perspectives(no interest in evangelism, that is not spiritual freedom to me and I cannot support) and a common question: if God is so loving, why are there starving children in Africa? Well, I see it as a cycle, the direct and indirect results of human iniquity, in this case European colonialism. And truly in my eyes, it is not fair, that one continent is suffering for the evils of another. But it is the natural order, what has happened within the freewill  we’ve been given. If God was you suddenly end all hunger/poverty in Africa, it would be a temporary relief but that type of direct control is incongruous with love and ultimately the great gift of our creation would be no longer and in the cycle of the universe it would be bad. That is my understanding anyway, but best  wishes to all in their own", "created_utc": "1587043558.0", "edited": "False", "id": "fnkz5az", "is_submitter": "False", "link_id": "t3_g2axoj", "parent_id": "t3_g2axoj", "score": "1", "subreddit": "coolguides", "subreddit_id": "t5_310rm"}, {"author": "ben121frank", "body": "Same thing happened to me, I loved reading when I was little but then the whole “gifted” thing made it extremely competitive and always who could be reading the “hardest” books and just kinda sucked the fun out of reading so I grew to really not like it. What made me love it again is just throwing out all that expectation and reading whatever I want, bc I want to and for fun. And for me that had turned into most of my faves as an adult being (well written, clever) children’s books. I have some great recs in that department if you’re interested.", "created_utc": "1587004479.0", "edited": "False", "id": "fnjq8ds", "is_submitter": "False", "link_id": "t3_g24avx", "parent_id": "t3_g24avx", "score": "1", "subreddit": "suggestmeabook", "subreddit_id": "t5_31t41"}, {"author": "ben121frank", "body": "Try the Mysterious Benedict Society books. I’m an adult and it’s my favorite series; they are children’s books but very well written. There are certainly some sci-fi elements in there, and it’s only a little bit fantasy. I would describe it as realistic fiction in a very unlikely(but possible) reality. It’s very exciting and fun, although I don’t think it’s really ever scary enough to be  considered a thriller. It’s also the book that made me love reading again so I really can’t recommend it highly enough", "created_utc": "1587003870.0", "edited": "False", "id": "fnjpad4", "is_submitter": "False", "link_id": "t3_g1y1aa", "parent_id": "t3_g1y1aa", "score": "2", "subreddit": "suggestmeabook", "subreddit_id": "t5_31t41"}, {"author": "ben121frank", "body": "I actually talked about the India thing in one of my season reviews a bit ago. I don’t necessarily mind them going to India except they do the same thing every time-have to push/navigate unruly through the “congested” streets. I have to believe there’s more to India than that so I really wish they showcase some more/different aspects if they keep returning", "created_utc": "1586989217.0", "edited": "False", "id": "fnizmbf", "is_submitter": "False", "link_id": "t3_g1e0eh", "parent_id": "t1_fnft329", "score": "4", "subreddit": "TheAmazingRace", "subreddit_id": "t5_2stq9"}, {"author": "ben121frank", "body": "No, bc “white power” is not a white version of the concept of black excellence. From what I know about black excellence, it’s about celebrating culture and heritage and success in their endeavors. White power is not the same. It is all about the power white people have/try to have OVER other people. “White power” is the sentiment associated with the KKK. I sincerely hope and bc I see the best in people will choose to believe you are not equating the KKK to black people being proud of their own achievements. And if you aren’t “white power” is not the term you’re looking for.", "created_utc": "1586981995.0", "edited": "False", "id": "fnilcgz", "is_submitter": "False", "link_id": "t3_g1wun7", "parent_id": "t3_g1wun7", "score": "10", "subreddit": "unpopularopinion", "subreddit_id": "t5_2tk0s"}, {"author": "ben121frank", "body": "Try SUSTO. Not sure how well known they are but they are probably my favorite band and I have yet to find another that sounds really close to them but RKS is similar", "created_utc": "1586971066.0", "edited": "False", "id": "fnhypbv", "is_submitter": "False", "link_id": "t3_g1rxst", "parent_id": "t3_g1rxst", "score": "1", "subreddit": "ifyoulikeblank", "subreddit_id": "t5_2sekf"}, {"author": "ben121frank", "body": "What was the gimmick in 30? I haven’t watched it yet and don’t want to google for fear of being spoiled", "created_utc": "1586875198.0", "edited": "False", "id": "fndpuom", "is_submitter": "False", "link_id": "t3_g0q1z5", "parent_id": "t3_g0q1z5", "score": "1", "subreddit": "TheAmazingRace", "subreddit_id": "t5_2stq9"}, {"author": "ben121frank", "body": "I haven’t tried this combination but I like Coke floats(coke and vanilla ice cream) so it doesn’t seem like much of a stretch", "created_utc": "1586872212.0", "edited": "False", "id": "fndkr3a", "is_submitter": "False", "link_id": "t3_g0vli5", "parent_id": "t3_g0vli5", "score": "1", "subreddit": "unpopularopinion", "subreddit_id": "t5_2tk0s"}, {"author": "ben121frank", "body": "Good post, I second the notion. Currently off my bike for at least another (agonizing) 4 days recovering from a pretty serious concussion I got while wearing a helmet. Hard to imagine how bad it could have been if I wasn’t", "created_utc": "1586795365.0", "edited": "False", "id": "fnad254", "is_submitter": "False", "link_id": "t3_g04l69", "parent_id": "t3_g04l69", "score": "3", "subreddit": "cycling", "subreddit_id": "t5_2qhyi"}, {"author": "ben121frank", "body": "What she’s doing is raising awareness and I think she’s doing it well. You’re correct she hasn’t proposed concrete solutions but at this point we(in the US anyway) aren’t really ready for that. Before we actually start breaking down the problem and trying to improve aspects of it, a majority of the people and politicians have to realize it’s a problem and care. She and her followers and others like her are showing that there’s a large sector of the population that does care", "created_utc": "1586784070.0", "edited": "False", "id": "fn9td57", "is_submitter": "False", "link_id": "t3_g0cjig", "parent_id": "t3_g0cjig", "score": "1", "subreddit": "unpopularopinion", "subreddit_id": "t5_2tk0s"}, {"author": "ben121frank", "body": "Hey there! Fellow mythical beast here, big fan. These are some of my other favorites, I’m not sure if they’re directly similar to R&L but they have somewhat of the same vibe and I enjoy them.\n\nMatthew Santoro-Haven’t watched him in a while so not sure if he still makes new videos but a lot of facts/list videos, often about mysterious or really interesting stuff. \n\nMentalfloss List Show w/ John Green-Similar as above, a lot of facts about really obscure information. But John Green is such a fun host. Don’t think they still make new videos\n\nThe Carpetbagger-Guy who goes around exploring a lot of road type attractions and other curiosity type stuff. Really the same yeehaw gothic vibe as Rhett and link. \n\nDefunctland-and also some other channels that are similar but I don’t know the specific names. A lot of info and history on theme parks and other amusements. Some of it might be construed as “ruining the magic” but I’m a big Disney fan and it doesn’t for me I find them pretty fascinating. \n\nHope you enjoy some of these!", "created_utc": "1586749839.0", "edited": "False", "id": "fn8tic3", "is_submitter": "False", "link_id": "t3_g058vj", "parent_id": "t3_g058vj", "score": "1", "subreddit": "ifyoulikeblank", "subreddit_id": "t5_2sekf"}, {"author": "ben121frank", "body": "Yep. All the ones with pedophiles/child porn/children in bad situations usually end up being my faves and I was like huh that’s kinda weird but then I realized it’s just bc I don’t like to see the squad fighting/not all on the same side/being skeptical about victims so I like it when there’s a very clear cut villain and the whole squad is working together in harmony to stop them", "created_utc": "1586742769.0", "edited": "False", "id": "fn8j1bw", "is_submitter": "False", "link_id": "t3_g06edh", "parent_id": "t3_g06edh", "score": "19", "subreddit": "SVU", "subreddit_id": "t5_2t476"}, {"author": "ben121frank", "body": "Ursula from little mermaid. Imo she’s not even evil, just a bit of an unconventional dealer, but all her deals were completely fair. She helped Ariel achieve her dream while all Triton is hold her back from it bc he can’t properly process his own trauma. In my opinion Triton is a worse guy in that movie than Ursula", "created_utc": "1586360301.0", "edited": "False", "id": "fmsqcye", "is_submitter": "False", "link_id": "t3_fwx9pc", "parent_id": "t3_fwx9pc", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "ben121frank", "body": "Oh same buddy(I’m the op I know but that’s such a mood)", "created_utc": "1586282064.0", "edited": "False", "id": "fmpjpzg", "is_submitter": "False", "link_id": "t3_fw12u4", "parent_id": "t1_fmpcr07", "score": "2", "subreddit": "unpopularopinion", "subreddit_id": "t5_2tk0s"}, {"author": "ben121frank", "body": "Agree. Sexuality is by definition what gender(s) you are attracted to. “Smart”(in the case of sapiosexual unless I’ve got that confused with another equally stupid one) is not a gender and therefore can’t be a component of your sexuality", "created_utc": "1586209236.0", "edited": "False", "id": "fmmotgz", "is_submitter": "False", "link_id": "t3_fw12u4", "parent_id": "t3_fw12u4", "score": "18", "subreddit": "unpopularopinion", "subreddit_id": "t5_2tk0s"}, {"author": "ben121frank", "body": "Stuckey annoyed me so I was fine to see him go like that but they did NOT need to kill off O’Halloran as part of that", "created_utc": "1586201040.0", "edited": "False", "id": "fmm91vb", "is_submitter": "False", "link_id": "t3_fw1oq4", "parent_id": "t3_fw1oq4", "score": "62", "subreddit": "SVU", "subreddit_id": "t5_2t476"}, {"author": "ben121frank", "body": "Season 3 episode 4 “Rooftop”. Just watched this one recently!", "created_utc": "1586184795.0", "edited": "False", "id": "fmlei79", "is_submitter": "False", "link_id": "t3_fvtqm4", "parent_id": "t3_fvtqm4", "score": "2", "subreddit": "SVU", "subreddit_id": "t5_2t476"}, {"author": "ben121frank", "body": "I see. To me almost I have the opposite disposition, I am prone to be overly idealistic and struggle to separate my idealism from reality. Because in my mind I believe reality is changeable and improbable and that’s what I try towards. But I don’t know if that’s true or not it is hard to know.", "created_utc": "1586108879.0", "edited": "False", "id": "fmig3rc", "is_submitter": "False", "link_id": "t3_fv2ftn", "parent_id": "t1_fmgq1bt", "score": "1", "subreddit": "AutisticAdults", "subreddit_id": "t5_2zf7w"}, {"author": "ben121frank", "body": "Ya I don’t get it either. I’m definitely in the minority but I didn’t think them or season 5 as a whole was that exceptional. The ox thing was whatever to me and not that funny but the way he treated that taxi driver was unacceptable. However that being said I’m watching 31 rn(no spoilers please I’m only about halfway through) and he has grown so much it’s insane and I love the season 31 version", "created_utc": "1586100791.0", "edited": "False", "id": "fmi24z6", "is_submitter": "False", "link_id": "t3_fvfdav", "parent_id": "t3_fvfdav", "score": "9", "subreddit": "TheAmazingRace", "subreddit_id": "t5_2stq9"}, {"author": "ben121frank", "body": "This is an interesting point to me. Of course there is not a cure so in my own thoughts I interpreted the question would I choose to not be autistic if I could. And that is of course also hypothetical because I am autistic and that not changeable, but the exercise of the thinking is valuable to me because it helps me realize that autism makes me who I am and thus be content and happy in my existence. This is my own thinking, but I acknowledge very much it can be different for others", "created_utc": "1586049989.0", "edited": "False", "id": "fmgirf9", "is_submitter": "False", "link_id": "t3_fv2ftn", "parent_id": "t1_fmg8vjs", "score": "3", "subreddit": "AutisticAdults", "subreddit_id": "t5_2zf7w"}, {"author": "ben121frank", "body": "Fantastic making of the survey, very much I enjoyed! However a point of sadness bc I see others in the comments saying we can see all the responses, however I missed this part and I cannot. Unless I fill the survey out again which I do not want to artificially affect the results. Is there any other way to see the responses? Many thanks!", "created_utc": "1586049435.0", "edited": "False", "id": "fmghwhq", "is_submitter": "False", "link_id": "t3_fv2ftn", "parent_id": "t3_fv2ftn", "score": "2", "subreddit": "AutisticAdults", "subreddit_id": "t5_2zf7w"}, {"author": "ben121frank", "body": "Yes! And when they occasionally try one now they just seem weak. I’m sure they thought the “twist” that in the recent ballet episode that the sexual assault went all to the top was so unexpected and riveting, meanwhile that is not at all uncommon or surprising and going upwards from the known perp would be their line of investigation anyway. So boring I thought", "created_utc": "1586048873.0", "edited": "False", "id": "fmgh16k", "is_submitter": "False", "link_id": "t3_fuzqhy", "parent_id": "t3_fuzqhy", "score": "6", "subreddit": "SVU", "subreddit_id": "t5_2t476"}, {"author": "ben121frank", "body": "I enjoyed it. It gets way way better as the season goes on so if you start definitely stick with it. To me the lovey theme crap doesn’t overshadow a great course and likable teams. I posted a full review of it on here not long ago if you wanna read that but it contains spoilers obviously", "created_utc": "1585876221.0", "edited": "False", "id": "fm9ti5g", "is_submitter": "False", "link_id": "t3_fssfc5", "parent_id": "t3_fssfc5", "score": "1", "subreddit": "TheAmazingRace", "subreddit_id": "t5_2stq9"}, {"author": "ben121frank", "body": "I never thought we would see new stabler content again! What a pleasant surprise!", "created_utc": "1585696027.0", "edited": "False", "id": "fm2ered", "is_submitter": "False", "link_id": "t3_fsji5z", "parent_id": "t3_fsji5z", "score": "3", "subreddit": "SVU", "subreddit_id": "t5_2t476"}, {"author": "ben121frank", "body": "Thank you! I don’t think I’ve seen this one I need to watch it", "created_utc": "1585680074.0", "edited": "False", "id": "fm1khsr", "is_submitter": "False", "link_id": "t3_frddyk", "parent_id": "t1_fm1g0ll", "score": "1", "subreddit": "SVU", "subreddit_id": "t5_2t476"}, {"author": "ben121frank", "body": "What episode is this?", "created_utc": "1585618983.0", "edited": "False", "id": "flza8ex", "is_submitter": "False", "link_id": "t3_frddyk", "parent_id": "t1_flvlp3i", "score": "1", "subreddit": "SVU", "subreddit_id": "t5_2t476"}, {"author": "ben121frank", "body": "I’m surprised this is considered the “worst” episode ever. I thought it was a great one", "created_utc": "1585444648.0", "edited": "False", "id": "flsl5k6", "is_submitter": "False", "link_id": "t3_fqwnb2", "parent_id": "t3_fqwnb2", "score": "14", "subreddit": "SVU", "subreddit_id": "t5_2t476"}, {"author": "ben121frank", "body": "Stonks", "created_utc": "1585159005.0", "edited": "False", "id": "flhaczg", "is_submitter": "False", "link_id": "t3_foqtw1", "parent_id": "t3_foqtw1", "score": "1", "subreddit": "todayilearned", "subreddit_id": "t5_2qqjc"}, {"author": "ben121frank", "body": "I can handle people complaining about being U-turned, I get it they feel betrayed by their allies or didn’t think they deserve it or whatever and it can be devastating to their race. But it drives me insane when they say it’s “unfair” or “dirty” or sometimes even accuse the U-turning team of “cheating.” Like no it is the opposite, they are following the rules of the game to a T. U-turns are a legal part of the game and the teams who can’t accept that really annoy me", "created_utc": "1585143606.0", "edited": "False", "id": "flgis2i", "is_submitter": "False", "link_id": "t3_fol8su", "parent_id": "t3_fol8su", "score": "16", "subreddit": "TheAmazingRace", "subreddit_id": "t5_2stq9"}, {"author": "ben121frank", "body": "I haven’t been to the Disney parks in ~15 years, don’t really have any desire to, seems too crowded and hectic for my enjoyment. But my family of all adults love Disney cruises-we enjoy meeting the characters and shows and other Disney aspects, but it’s also in our opinion just the best cruise line. As in best run, best dining model, best staff etc. And it’s a little bit magical no matter how old you are.\n\nAlso gotta point out something from your post- “animated movies for children.” This is actually incorrect, a key emphasis in the development of Disney was creating entertainment that was enjoyable for all ages, ie a step above the fodder that populated children’s markets in Walt’s time. So I don’t think it’s weird for adults to like the movies bc they’re still complex and engaging stories, the only difference is no sex violence drugs etc. \n\nNow I do think it would be weird for adults to be obsessed with dreamworks or other similar, bc those really are written exclusively for children and rely on fart-intensive humor that really shouldn’t be funny to anyone over about the age of 12", "created_utc": "1584988513.0", "edited": "False", "id": "flaphj1", "is_submitter": "False", "link_id": "t3_fnoo3a", "parent_id": "t3_fnoo3a", "score": "2", "subreddit": "unpopularopinion", "subreddit_id": "t5_2tk0s"}, {"author": "ben121frank", "body": "Haha this made me laugh. Ya no one on that show is normal. I guess a better phrasing would be people to whom the normal rules of society apply, instead of every damn case being how can I use my money/influence to weasel out of this", "created_utc": "1584982993.0", "edited": "False", "id": "flafs1e", "is_submitter": "True", "link_id": "t3_fnkgit", "parent_id": "t1_flaa97q", "score": "5", "subreddit": "SVU", "subreddit_id": "t5_2t476"}, {"author": "ben121frank", "body": "I understand what you’re saying. What I was trying to say is there are a lot of people who have everything they possibly could right now such as celebrities and are still bored and lonely. Check my edit I tried to explain better.", "created_utc": "1584982750.0", "edited": "False", "id": "flafctr", "is_submitter": "True", "link_id": "t3_fnlqvc", "parent_id": "t1_fla8quc", "score": "1", "subreddit": "unpopularopinion", "subreddit_id": "t5_2tk0s"}, {"author": "ben121frank", "body": "Fair point. Check my edit I tried to explain my thoughts better", "created_utc": "1584982569.0", "edited": "False", "id": "flaf10n", "is_submitter": "True", "link_id": "t3_fnlqvc", "parent_id": "t1_fla5rpe", "score": "2", "subreddit": "unpopularopinion", "subreddit_id": "t5_2tk0s"}, {"author": "ben121frank", "body": "Read the novella a short stay in hell. Supposed to be somewhat of a thriller but more just terribly sad and what I imagine immortality on earth would be like", "created_utc": "1584974483.0", "edited": "False", "id": "fla1eug", "is_submitter": "False", "link_id": "t3_fnkco1", "parent_id": "t3_fnkco1", "score": "1", "subreddit": "unpopularopinion", "subreddit_id": "t5_2tk0s"}, {"author": "ben121frank", "body": "Agree 100%. There is a real issue with people who are struggling to afford the things they need to survive rn, and ya celebrities situation is not at all comparable. But for all the people who are living comfortably bashing on celebrities doing the same, it’s just mean. Loneliness and boredom are the biggest stressors in this time and those can affect you regardless of how much money you have. I don’t really see their situation as any different than mine, just more rooms to wander longingly through", "created_utc": "1584974354.0", "edited": "False", "id": "fla17o2", "is_submitter": "False", "link_id": "t3_fnk0su", "parent_id": "t3_fnk0su", "score": "1", "subreddit": "unpopularopinion", "subreddit_id": "t5_2tk0s"}, {"author": "ben121frank", "body": "I used to think this-then I got AirPods. I think about how much I appreciate them every time I pull them out of my pocket and don’t have to untangle the cord. \n\nNote: they were a gift from a family member and I don’t know if I would have bought them on my own. Also I don’t know that they’re any better than other (cheaper) Bluetooth buds. But that no cord factor is so nice", "created_utc": "1584970381.0", "edited": "False", "id": "fl9vhra", "is_submitter": "False", "link_id": "t3_fnh0st", "parent_id": "t3_fnh0st", "score": "46", "subreddit": "unpopularopinion", "subreddit_id": "t5_2tk0s"}, {"author": "ben121frank", "body": "Gotta vehemently disagree here. But always great to see another appreciator of the Disney outtakes! I’m a big big fan of the Frozen 2 outtakes, I think most of them are better than what made the movie, and the frozen 1 outtakes are pretty good too. I just listened to the Moana outtakes and they did nothing for me-honestly I thought they were pretty terrible actually", "created_utc": "1584745330.0", "edited": "False", "id": "fl28jgx", "is_submitter": "False", "link_id": "t3_flvkl0", "parent_id": "t1_fl1dwty", "score": "1", "subreddit": "unpopularopinion", "subreddit_id": "t5_2tk0s"}, {"author": "ben121frank", "body": "I agree, interesting is a great way to describe them if not always enjoyable. If you don’t mind me asking, what is your criteria for “best”? And what are some of your other top teams, bc I’ve never heard Blair and Hayley before and it intrigues me.", "created_utc": "1584676392.0", "edited": "False", "id": "fkzp1qz", "is_submitter": "True", "link_id": "t3_fldyyk", "parent_id": "t1_fkzfhcm", "score": "1", "subreddit": "TheAmazingRace", "subreddit_id": "t5_2stq9"}, {"author": "ben121frank", "body": "Stupid question I’m sure but why can’t they just hold it vertically for all the types and then only insert it however deep is necessary? Is having the angle helpful for some reason?", "created_utc": "1584668572.0", "edited": "False", "id": "fkzdo1r", "is_submitter": "False", "link_id": "t3_flbgwi", "parent_id": "t3_flbgwi", "score": "1", "subreddit": "coolguides", "subreddit_id": "t5_310rm"}, {"author": "ben121frank", "body": "Oh ok good to know! That’s one aspect of the shows editing for TV episodes that I do not enjoy, how hard it is to actually judge times", "created_utc": "1584650103.0", "edited": "False", "id": "fkyjqfg", "is_submitter": "True", "link_id": "t3_fldyyk", "parent_id": "t1_fkycgmz", "score": "1", "subreddit": "TheAmazingRace", "subreddit_id": "t5_2stq9"}, {"author": "ben121frank", "body": "I think this has less to do with an actual quality decline and more the rapid expansion of the internet. I agree the keywords that lead to barely even related(to your actual search but related to the identified key word) results are annoying, but at this point I think that’s the only way for a search engine to even get in the right ballpark. It was a lot easier in ye old old days when there was an easily quantified number of pages on the internet. Estimates now are 5 billion", "created_utc": "1584132522.0", "edited": "False", "id": "fkfebfe", "is_submitter": "False", "link_id": "t3_fhyhos", "parent_id": "t1_fke5ozl", "score": "1", "subreddit": "AskMen", "subreddit_id": "t5_2s30g"}, {"author": "ben121frank", "body": "It was ok objectively, I just thought it was something that could’ve been done anywhere and those I always prefer less than unique culture things. And the combination of Connor and Dave +Brenchel at bar tending was just annoying that’s all. And don’t understand why they hand picked a sound challenge for the season with the deaf guy, I thought it was really unfair essentially only giving Margie and Luke 1 choice", "created_utc": "1584068594.0", "edited": "False", "id": "fkd53ix", "is_submitter": "False", "link_id": "t3_fh9hq3", "parent_id": "t1_fkcv3y5", "score": "3", "subreddit": "TheAmazingRace", "subreddit_id": "t5_2stq9"}, {"author": "ben121frank", "body": "I say go for it. With one exception(a detour in Malaysia that I thought was totally culturally irrelevant, annoying, and super unfair to one team) I don’t agree with some on here that the challenges were especially weak. It’s not the strongest seasons but I overall had fun watching it", "created_utc": "1584057284.0", "edited": "False", "id": "fkco3pp", "is_submitter": "False", "link_id": "t3_fh9hq3", "parent_id": "t3_fh9hq3", "score": "5", "subreddit": "TheAmazingRace", "subreddit_id": "t5_2stq9"}, {"author": "ben121frank", "body": "I think the key is always context. A team that is the Trojans is implied to be the Trojans warriors, fierce fighters as opposed to just random Greek people going about their lives. The same argument could be made about a team called the Indians, as in meaning Native American warriors. Or the Vikings, or a team called the Warriors or Generals or similar. The difference I see: none of these except Native Americans have ever been the subject of mass cultural genocide in the US. The very spirit that teams now want to convey was once cause for all manners of atrocity-“kill the Indian, save the man” and similar rhetoric. I don’t think it’s ethical for white Americans to hate Native American identity and then turn around and want to capitalize on it.", "created_utc": "1583610385.0", "edited": "False", "id": "fjtrkw9", "is_submitter": "False", "link_id": "t3_fezp3c", "parent_id": "t1_fjtkqlw", "score": "4", "subreddit": "changemyview", "subreddit_id": "t5_2w2s8"}, {"author": "ben121frank", "body": "I agree that his mental faculties have definitely slowed down, dementia or not. I think it’s ridiculous in general that the 3 probable candidates are now all above 70. Again, as long as he’s supported by a strong cabinet I think that’s ok. Now to address your other point, we can denounce centrism and viva la revolución all we want but the fact is the majority of Americans are centrist. For a personal example, my mom would seriously deliberate between Biden and Trump and probably ultimately vote Biden because she likes his decorum if nothing else. She wouldn’t even look Bernies direction bc he’s a scary commie(eye roll). But I think a lot of voters especially older ones are like that.", "created_utc": "1583601084.0", "edited": "False", "id": "fjswidr", "is_submitter": "True", "link_id": "t3_fewstz", "parent_id": "t1_fjsqyvw", "score": "3", "subreddit": "changemyview", "subreddit_id": "t5_2w2s8"}, {"author": "ben121frank", "body": "I don’t think polls are all that meaningful, especially this early. (Recall in 2016 that Hilary led trump in all the polls). But in the interest of trying to broaden my mindset I did look up the results of some polls, you are correct Bernie beats trump in all the polls but Biden also had trump beat by a similar margin in all but one.", "created_utc": "1583600668.0", "edited": "False", "id": "fjsuvbm", "is_submitter": "True", "link_id": "t3_fewstz", "parent_id": "t1_fjso825", "score": "1", "subreddit": "changemyview", "subreddit_id": "t5_2w2s8"}, {"author": "ben121frank", "body": "This is a fair point. I agree with you I think the DNC is corrupt. Really I think everything we’ve done after ignoring George Washington’s no political parties advice has been a mistake. But again, I think it’s about trying to exist realistically in the current system, so that you can reach a point of changing it, and in this scenario(reality) I still see Biden as better. I think two things he’s got up on Hilary are\n1 He’s not a woman. Sexism sucks but is a real concern especially if you’re trying to get moderate votes from older people. \n2 The brain void of the right doesn’t have anything as stupid as “emails wahhhh” to latch onto for him\nAnd yes, both of these are stupid but I believe they’re genuine and important considerations", "created_utc": "1583598673.0", "edited": "False", "id": "fjsmrn8", "is_submitter": "True", "link_id": "t3_fewstz", "parent_id": "t1_fjsgf2t", "score": "1", "subreddit": "changemyview", "subreddit_id": "t5_2w2s8"}, {"author": "ben121frank", "body": "Your comment brings up a fair point, but I feel like I did a good job of addressing that point in my original post. To answer your last question, what Biden is selling me is being convinced that practical ideas will be acted upon under him. Again, even if it’s from his cabinet and not him. Bernie has great ideals that I think are possible to achieve(see Elizabeth warrens much more we’ll defined plan) but Bernie hasn’t convinced me he knows how. All that being said, your username is appalling if it’s not a joke. That kind of mindset gets queer people, poc, Muslim people, immigrants, etc endangered or killed. Biden, as I have said several times, is not perfect or even that good but he is infinitely better than trump.", "created_utc": "1583598245.0", "edited": "False", "id": "fjslf5d", "is_submitter": "True", "link_id": "t3_fewstz", "parent_id": "t1_fjsfbwz", "score": "0", "subreddit": "changemyview", "subreddit_id": "t5_2w2s8"}, {"author": "ben121frank", "body": "What was he going to arrest her for, the very first time he says step out after she won’t sigh?", "created_utc": "1581892672.0", "edited": "False", "id": "fhv2jfe", "is_submitter": "False", "link_id": "t3_f4q4cg", "parent_id": "t3_f4q4cg", "score": "1", "subreddit": "Whatcouldgowrong", "subreddit_id": "t5_2x2oy"}, {"author": "ben121frank", "body": "I didn’t mind them on 21, but they got exponentially more annoying when they were back on 24. Their first leg of 24 was maybe the singular most dysfunctional leg ever for a team and I found it hilarious to watch considering they were a pretty objectively strong team on 21", "created_utc": "1581795200.0", "edited": "False", "id": "fhpu5xu", "is_submitter": "False", "link_id": "t3_f44wna", "parent_id": "t3_f44wna", "score": "10", "subreddit": "TheAmazingRace", "subreddit_id": "t5_2stq9"}, {"author": "ben121frank", "body": "Haha I agree, I noticed that and I hated it, I typed this out in notes with logical formatting which Reddit did away with when I copied it and I didn’t realize til after I posted.", "created_utc": "1581119664.0", "edited": "False", "id": "fgufp8m", "is_submitter": "True", "link_id": "t3_f0etk0", "parent_id": "t1_fgudpgk", "score": "5", "subreddit": "TheAmazingRace", "subreddit_id": "t5_2stq9"}, {"author": "ben121frank", "body": "I didn’t mind the NELs but wish they would’ve divided them more evenly. Got kinda tired of seeing the final 5 race for what 6 episodes?", "created_utc": "1581109493.0", "edited": "False", "id": "fgtucbw", "is_submitter": "True", "link_id": "t3_f0etk0", "parent_id": "t1_fgtrh2g", "score": "7", "subreddit": "TheAmazingRace", "subreddit_id": "t5_2stq9"}, {"author": "ben121frank", "body": "Genuine question for the OP: a lot of trans people are pretty well transitioned, to where they would be outwardly identified as a gender other than the one they were born with. Are you aware of this? What are your thoughts?", "created_utc": "1581046536.0", "edited": "False", "id": "fgrgx7j", "is_submitter": "False", "link_id": "t3_ezv5q2", "parent_id": "t3_ezv5q2", "score": "3", "subreddit": "unpopularopinion", "subreddit_id": "t5_2tk0s"}, {"author": "ben121frank", "body": "I don’t think anyone thinks every new idea is on “the right side of history.” The issue is everyone thinks their own ideas/beliefs are the ones on the right side. So with the full spectrum of human belief that equals every single belief, include abjectly contradictory ones, to be touted by somebody as on the “right side”.", "created_utc": "1581044052.0", "edited": "False", "id": "fgrdcx2", "is_submitter": "False", "link_id": "t3_f02nh2", "parent_id": "t3_f02nh2", "score": "2", "subreddit": "unpopularopinion", "subreddit_id": "t5_2tk0s"}, {"author": "ben121frank", "body": "It’s maybe not as big of a concern as it’s made out to be yes but this is a rather willfully ignorant perspective. It can be a vicious cycle, kids may be bullied(in part) for not having an “adequate” social media/online presence, leading them to want one which if they make one also gives the bullies a new outlet. Also I think the idea of random bullies picking on people they don’t know is somewhat outdated, to me now the most cruel will come from former friends or acquaintances, people who may actually have enough “dirt” to really hurt you. And social media just makes all that easier", "created_utc": "1581043052.0", "edited": "False", "id": "fgrbwrr", "is_submitter": "False", "link_id": "t3_ezwcic", "parent_id": "t1_fgpvwtk", "score": "2", "subreddit": "unpopularopinion", "subreddit_id": "t5_2tk0s"}, {"author": "ben121frank", "body": "Children should be far, far removed from anything sexual and this thread seems to be collectively defining drag as inherently sexual. So fine, I’ll go along with that. But I think there should be an alternative art form for children and teenagers(boys specifically but anyone who wants to participate) that highlights the creativity and community of drag without the sexuality. So obviously many of the costumes and choreography would need to be redesigned but things like the makeup are really cool and should be available to everyone", "created_utc": "1581028885.0", "edited": "False", "id": "fgqppj6", "is_submitter": "False", "link_id": "t3_ezur3y", "parent_id": "t3_ezur3y", "score": "5", "subreddit": "unpopularopinion", "subreddit_id": "t5_2tk0s"}, {"author": "ben121frank", "body": "Ya it does, but it might take years for someone with long hair. That was my point", "created_utc": "1581022861.0", "edited": "False", "id": "fgqex3v", "is_submitter": "True", "link_id": "t3_ezyxp1", "parent_id": "t1_fgqenvn", "score": "10", "subreddit": "TheAmazingRace", "subreddit_id": "t5_2stq9"}, {"author": "ben121frank", "body": "It’s probably my very favorite season, so I would definitely recommend finishing it. Also interesting that you mention Michael and a Kevin being your favorite, to me they are just another rather unremarkable and sweet “hindered by an old person” team but I have seen some people on here really hating them(for reasons I totally don’t get)", "created_utc": "1581022782.0", "edited": "False", "id": "fgqerx2", "is_submitter": "False", "link_id": "t3_ezlifb", "parent_id": "t3_ezlifb", "score": "5", "subreddit": "TheAmazingRace", "subreddit_id": "t5_2stq9"}, {"author": "ben121frank", "body": "I seem to remember Lake and Michelle being very big talkers in early episodes and then ending up with only a middling finish. I never did like them much, my viewing order is very non chron so they struck me as a knockoff Misti and Jim even though they were well before lol", "created_utc": "1579494770.0", "edited": "False", "id": "ff25zwt", "is_submitter": "False", "link_id": "t3_er303g", "parent_id": "t3_er303g", "score": "13", "subreddit": "TheAmazingRace", "subreddit_id": "t5_2stq9"}, {"author": "ben121frank", "body": "BJ and Tyler came in last on two NELs. Unlike a team like josh and Brent who were always at the back they had 5 leg wins and mostly other high finishes so I found it interesting how they seemed to “time” their bad legs really well", "created_utc": "1579228790.0", "edited": "False", "id": "felqyny", "is_submitter": "False", "link_id": "t3_eps5cp", "parent_id": "t3_eps5cp", "score": "12", "subreddit": "TheAmazingRace", "subreddit_id": "t5_2stq9"}, {"author": "ben121frank", "body": "NTA. It would be entirely different if you told her she shouldn’t order the sandwich bc you didn’t want to go through the trouble of making it. But you didn’t, not at all, your concern is entirely for her and her apparent rush. So all you were doing is being considerate to her", "created_utc": "1578326186.0", "edited": "False", "id": "fddx866", "is_submitter": "False", "link_id": "t3_ekphzu", "parent_id": "t3_ekphzu", "score": "0", "subreddit": "AmItheAsshole", "subreddit_id": "t5_2xhvq"}, {"author": "ben121frank", "body": "I am a very naturally friendly person who loves people, my best advice is: don’t have small talk. People will generally be impressed and enjoy if you engage them with meaningful conversations. Understand boundaries(don’t try to dredge up randos childhood drama or anything) but almost everyone loves to talk about what matters to them if you’re willing to listen", "created_utc": "1577765213.0", "edited": "False", "id": "fcm64kg", "is_submitter": "False", "link_id": "t3_ehuvky", "parent_id": "t3_ehuvky", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "ben121frank", "body": "So many good ones. Off the top of my head “dink it and sink it” “boiled for safety” “Tokyo woahhhhhhh”", "created_utc": "1577763852.0", "edited": "False", "id": "fcm49pn", "is_submitter": "False", "link_id": "t3_ehpel1", "parent_id": "t3_ehpel1", "score": "3", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}]