[{"author": "boryeogo", "body": "Totally agree. The soft cheeses are just about palatable but the hard cheeses? Abysmal. That said, I tried some German vegan sliced cheeses (Simply V brand) when I was in Germany and they were PERFECT. Literally tasted exactly like a smooth gouda or mild cheddar. Since I learnt good vegan cheese existed, I’m just waiting for the rest of the world to catch up.", "created_utc": "1665932053.0", "edited": "False", "id": "isjrj0m", "is_submitter": "False", "link_id": "t3_y5eytz", "parent_id": "t3_y5eytz", "score": "0", "subreddit": "vegan", "subreddit_id": "t5_2qhpm"}, {"author": "boryeogo", "body": "Yeah, I’ve got some books and tv shows in Italian lined up just to keep it up. Thankfully I still understand almost everything but my speaking skills have definitely gone downhill. I’ve got a couple of Italian work colleagues that I can speak to as well. It’s more the fact that I’m just not as passionate about Italian as I was when I started learning it.\n\nWith every additional language I learn I’m finding it gets harder and harder to have time to maintain the older ones unfortunately", "created_utc": "1665931883.0", "edited": "False", "id": "isjr47l", "is_submitter": "False", "link_id": "t3_y4vybr", "parent_id": "t1_isj8083", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "boryeogo", "body": "Italian. I even have a degree in it, was pretty fluent until a few years ago because I just never need it. I don’t feel that passionately about the language anymore so I barely consume any media. It’s just a bit useless for me now tbh. Also French, it’s only useful when I stumble across a book I need for research that happens to be in French", "created_utc": "1665873342.0", "edited": "False", "id": "ish02s5", "is_submitter": "False", "link_id": "t3_y4vybr", "parent_id": "t3_y4vybr", "score": "8", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "boryeogo", "body": "Personally this toner hasn’t done much for me (it is nice though, nothing bad about it but also nothing amazing) but the dear klairs rich moist soothing cream was lovely for my dry skin and rosacea. i’d recommend getting anything with cica/centella asiatica in it for rosacea", "created_utc": "1665772603.0", "edited": "False", "id": "isbkuwo", "is_submitter": "False", "link_id": "t3_y3wudv", "parent_id": "t3_y3wudv", "score": "1", "subreddit": "Rosacea", "subreddit_id": "t5_2qwbh"}, {"author": "boryeogo", "body": "I actually never thought this was even possible. I’m willing to take on this challenge once again", "created_utc": "1665772186.0", "edited": "False", "id": "isbjtvf", "is_submitter": "False", "link_id": "t3_y36ms9", "parent_id": "t3_y36ms9", "score": "1", "subreddit": "veganuk", "subreddit_id": "t5_33xgk"}, {"author": "boryeogo", "body": "That’s the worst 😭😭", "created_utc": "1664108935.0", "edited": "False", "id": "iptyyb1", "is_submitter": "False", "link_id": "t3_xn13do", "parent_id": "t1_ipte2b0", "score": "1", "subreddit": "AskWomen", "subreddit_id": "t5_2rxrw"}, {"author": "boryeogo", "body": "Seconding the pain! I do yoga and pilates fairly regularly and every time I have to lie on my stomach it is so uncomfortable and I even get bruises on my hipbones because there’s not enough padding", "created_utc": "1664055395.0", "edited": "False", "id": "iprkup6", "is_submitter": "False", "link_id": "t3_xn13do", "parent_id": "t1_iprafnm", "score": "39", "subreddit": "AskWomen", "subreddit_id": "t5_2rxrw"}, {"author": "boryeogo", "body": "I recently bought a big box of cereal to have in the bedroom. I live with my boyfriend and his mum and they have people over last minute a lot so that often triggers my anxiety and I get hungry, hence cereal.\n\nJust now my boyfriend and I were chilling, doing our own thing in our room, and I pulled out the cereal. We both just mindlessly snacked on it while the aunties and uncles chatted downstairs. It was really nice and a little bonding time for us, so I'd consider that a good side lol\n\nBut more seriously, I think being extra aware of other people's body language and understanding when others may be anxious and having the ability to respond well to that is also a good skill to have, even if it comes from something as difficult as social anxiety.", "created_utc": "1664049230.0", "edited": "False", "id": "ipr6ztd", "is_submitter": "False", "link_id": "t3_xmus98", "parent_id": "t3_xmus98", "score": "1", "subreddit": "socialanxiety", "subreddit_id": "t5_2r22n"}, {"author": "boryeogo", "body": "I think everyone now knows the toaster is the way to go but… my family used to toast them on my grandmother’s fireplace and then put butter on them and I just have to say the toaster doesn’t even come close", "created_utc": "1663185811.0", "edited": "False", "id": "iofv3pp", "is_submitter": "False", "link_id": "t3_xe0pc7", "parent_id": "t3_xe0pc7", "score": "1", "subreddit": "CasualUK", "subreddit_id": "t5_3j2jr"}, {"author": "boryeogo", "body": "Naturally it depends on what your goals and situation are. If you’ll be working mainly in Europe, then stick with European languages - I’d suggest German since any romance languages will be easier for you to learn independently outside of a classroom setting.\n\nPersonally I’d make the most of having a teacher you can ask a million questions, so Mandarin or Arabic would be a good choice since they’re harder to learn by yourself.", "created_utc": "1659622246.0", "edited": "False", "id": "iix25ti", "is_submitter": "False", "link_id": "t3_wg0k2j", "parent_id": "t3_wg0k2j", "score": "4", "subreddit": "polyglot", "subreddit_id": "t5_2reiv"}, {"author": "boryeogo", "body": "I really like the first style actually but the fourth photo with the pin curls is absolute heaven!!\n\nThat said, go for the shorter hair if you want. Hair always grows back so you may as well experiment", "created_utc": "1658407786.0", "edited": "False", "id": "ih1le6c", "is_submitter": "False", "link_id": "t3_w3o8yc", "parent_id": "t3_w3o8yc", "score": "1", "subreddit": "femalehairadvice", "subreddit_id": "t5_2sgxv"}, {"author": "boryeogo", "body": "I think the demographic is shifting too, and I’d like to clarify that Oxbridge isn’t necessarily all like this. I had a friend go to Cambridge and she loved it. I’ve just heard from others that it can be an uncomfortable situation for non-wealthy and/or white students", "created_utc": "1654848761.0", "edited": "False", "id": "ibtz8wg", "is_submitter": "False", "link_id": "t3_v5rv61", "parent_id": "t1_ibdrvuj", "score": "1", "subreddit": "DarkAcademia", "subreddit_id": "t5_th6q5"}, {"author": "boryeogo", "body": "Well, because it’s 95% the richest poshest most conservative people that go there, it’s not really the most pleasant place for anyone from a different socioeconomic background or POCs. Also the workload is insane (more than other Russell Group unis), so the parties go pretty hard", "created_utc": "1654529555.0", "edited": "False", "id": "ibdk81o", "is_submitter": "False", "link_id": "t3_v5rv61", "parent_id": "t1_ibdd8kw", "score": "1", "subreddit": "DarkAcademia", "subreddit_id": "t5_th6q5"}, {"author": "boryeogo", "body": "Definitely Durham for UK, UCL main building is very DA too. If you can get the grades and don’t mind the social environment, Oxford and Cambridge are also options.", "created_utc": "1654517268.0", "edited": "False", "id": "ibcwah2", "is_submitter": "False", "link_id": "t3_v5rv61", "parent_id": "t3_v5rv61", "score": "6", "subreddit": "DarkAcademia", "subreddit_id": "t5_th6q5"}, {"author": "boryeogo", "body": "I love this. Do you happen to know the collection or if it's referenced in any books/articles? I'm doing my PhD on animals in the Joseon dynasty so this would be perfect (purr-fect?)", "created_utc": "1654356062.0", "edited": "False", "id": "ib5j6vu", "is_submitter": "False", "link_id": "t3_v25z44", "parent_id": "t3_v25z44", "score": "1", "subreddit": "ArtefactPorn", "subreddit_id": "t5_313fb"}, {"author": "boryeogo", "body": "My sister has been diagnosed with bpd. I’m not gonna lie, it’s really really tough for me and my mum to be around her some days. The littlest thing can set her off and then there’s just no way we can have a normal conversation with her. It’s really painful for us because she wasn’t always like this and we don’t know how to navigate the person she’s become. She refuses to go to therapy or take any medication and instead just tells everyone to deal with it or never see her if we can’t.\n\nI’m at a complete loss at how to interact with her now. I feel a lot of frustration, hurt, and grief for the nice person she used to be. I don’t hate her though, I’m just sad and wish I could help in some way. Nothing we seem to do works", "created_utc": "1645477372.0", "edited": "False", "id": "hxvo8eu", "is_submitter": "False", "link_id": "t3_sxzles", "parent_id": "t3_sxzles", "score": "4", "subreddit": "BorderlinePDisorder", "subreddit_id": "t5_2xugh"}, {"author": "boryeogo", "body": "Horses nowadays are domesticated and they need a lot of exercise, which riding gives them. They’re not going to do all the exercises that work their muscles properly by running around a field - just like how humans don’t naturally do bench presses or squats. Even wild horses don’t run that much, and different breeds need different exercise. Thoroughbreds for instance need an awful lot, whereas Clydesdales can live well being a bit more inactive. Admittedly, some tack such as bits and ill-fitting saddles are not good for horses and too much bad riding can damage the horse.\n\nOn the whole the people that own horses take immensely good care of them since they’re so expensive. Whilst for some people it comes under exploitation, I think the most important thing is that the animal is well cared for which they usually are.\n\nEdit: to answer the concrete question, most horse owners rarely expose the horse to harsh surfaces like concrete and many now go without putting shoes on the horse to allow their hooves to grow and develop properly. Soft fields, rubber mats in stables, and sand arenas are most common where I’m from", "created_utc": "1645206598.0", "edited": "False", "id": "hxh17p4", "is_submitter": "False", "link_id": "t3_svl8dt", "parent_id": "t3_svl8dt", "score": "1", "subreddit": "DebateAVegan", "subreddit_id": "t5_2sa7z"}, {"author": "boryeogo", "body": "This morning because a cupboard was too messy to put away the clean stuff from the dishwasher.\n\nI’ve been really stressed lately and living with someone who just is not as organised as I am pushes me over the edge on a regular basis.", "created_utc": "1642704882.0", "edited": "False", "id": "hthst50", "is_submitter": "False", "link_id": "t3_s8ck71", "parent_id": "t3_s8ck71", "score": "1", "subreddit": "AskWomen", "subreddit_id": "t5_2rxrw"}, {"author": "boryeogo", "body": "Personally as a fellow pale person (with warm undertones) I just own it and I think you could too. Fake tanning is such a hassle and on principle I disagree with it. I know this sub is all about algerians enhancing looks to match a universal standard of beauty but honestly, not enough love is given to pale skin. If we as a society can celebrate darker skin tones, why not the ultra light too? They’re equally as beautiful", "created_utc": "1642246228.0", "edited": "False", "id": "hsr5xkg", "is_submitter": "False", "link_id": "t3_s40oj3", "parent_id": "t3_s40oj3", "score": "1", "subreddit": "Vindicta", "subreddit_id": "t5_22fx18"}, {"author": "boryeogo", "body": "Seconding this. My periods were very irregular and heavy a few years after starting and when I went off the pill after a couple more years - turns out PCOS was to blame.\n\nAlso to OP, if you do decide to see your GP to get referred to a gynaecologist (assuming you’re in the UK and can’t go straight to a specialist), make sure you specify you need to see the gynaecologist for an ultrasound scan. Annoyingly it took me several visits to my GP and countless blood tests only for them to finally refer me and a quick scan later, a diagnosis.\n\nFor comfort, everyone else has given fantastic advice. I also find red tiger balm, ginger tea, and a hot water bottle absolutely perfect for bad period pains.", "created_utc": "1641762203.0", "edited": "False", "id": "hryry7f", "is_submitter": "False", "link_id": "t3_rzoygk", "parent_id": "t1_hrwwasg", "score": "4", "subreddit": "TheGirlSurvivalGuide", "subreddit_id": "t5_2vfzu"}, {"author": "boryeogo", "body": "My mum accidentally got me honey roasted cashews because she mixed it up with the bbq flavoured peanuts I love. It’s not too bad though since my boyfriend isn’t vegan so he’ll enjoy them. It’s an honest mistake, she knows very well that I’m vegan\n\nI also got some shower gels but I’ll need to look up if they’re cruelty free", "created_utc": "1640515631.0", "edited": "False", "id": "hq0if6w", "is_submitter": "False", "link_id": "t3_roikjw", "parent_id": "t3_roikjw", "score": "1", "subreddit": "vegan", "subreddit_id": "t5_2qhpm"}, {"author": "boryeogo", "body": "Were you in a polluted city/town or cooking a lot on the day your mum smelled your hair? Because hair can hold onto smell really easily, like, if you’re around someone smoking a cigarette your hair will smell of smoke.\n\nIf the “funky”ness isn’t just a one-off though, then usually nice smelling shampoo & conditioner will work. Unless your scalp is really dirty or you have a dry scalp I don’t think using scalp scrubs or exfoliating tools will help (I find they’re good to use once a week or so to really clean the roots from product though). Oils are also a good way to go, I have one from pureology that smells lovely and I can smell it on my hair a few hours after using it", "created_utc": "1636231030.0", "edited": "False", "id": "hjldk9j", "is_submitter": "False", "link_id": "t3_qo8eg6", "parent_id": "t3_qo8eg6", "score": "3", "subreddit": "TheGirlSurvivalGuide", "subreddit_id": "t5_2vfzu"}, {"author": "boryeogo", "body": "I had a T safe copper IUD for a couple of years. I don’t recall it having an effect on my depression/anxiety since it’s non hormonal so it kinda just lets your body do whatever it wants to do naturally. My periods did get heavier though (on the pill they’re always light, so by comparison it was like a proper period with cramps and everything) so I started using a menstrual cup but it kept pulling on the strings so had to get it removed and another one put in (annoyingly the same thing happened with the second even though the strings were super short, and I kept getting a weird pain in the left side which sort of disappeared when the iud got taken out. thanks to the skill of the uk’s doctors i still have no idea what the pain is but that’s another story)\n\nInsertion/removal wise, it’s not pleasant. Taking them out hurts more than getting it put in but it’s only for a couple of seconds", "created_utc": "1636137878.0", "edited": "False", "id": "hjg6r3b", "is_submitter": "False", "link_id": "t3_qnf57g", "parent_id": "t3_qnf57g", "score": "8", "subreddit": "Healthyhooha", "subreddit_id": "t5_ilpqk"}, {"author": "boryeogo", "body": "Definitely a real thing in Germany. Cold brew coffee with vanilla ice cream.. and it’s delicious", "created_utc": "1633538954.0", "edited": "False", "id": "hfmg161", "is_submitter": "False", "link_id": "t3_q2glla", "parent_id": "t3_q2glla", "score": "2", "subreddit": "duolingo", "subreddit_id": "t5_2t6ze"}, {"author": "boryeogo", "body": "I’d say it’s pretty damn realistic already! If I were to really nitpick, having a stronger contrast between the darkest shadows and brightest highlights really helps just drive the realism home.\n\nUse a sharp 2B pencil for the shadows rather than a 6-9B - you can get more definition. I’ve got one of those tombow erasers which I cut into a sharp point and that’s perfect for getting tiny highlights", "created_utc": "1632555265.0", "edited": "False", "id": "he71vjm", "is_submitter": "False", "link_id": "t3_pv0n3r", "parent_id": "t3_pv0n3r", "score": "23", "subreddit": "learnart", "subreddit_id": "t5_2s6fc"}, {"author": "boryeogo", "body": "I continued learning Korean after my relationship with him ended and it was so hard to continue learning it. Everything reminded me of him, so like many other people here I took a break. I found something else to motivate me though, like wanting to watch kdramas without subtitles, and I gained an interest in the history and culture too so I needed a deeper understanding of the language beyond everyday conservations and that’s never reminded me of my ex.\n\nI do suggest finding another reason to learn the language if you want to keep learning it. You don’t have to always connect it to an ex partner", "created_utc": "1632167502.0", "edited": "False", "id": "hdmpupr", "is_submitter": "False", "link_id": "t3_prygwb", "parent_id": "t3_prygwb", "score": "7", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "boryeogo", "body": "Kinder buenos (and kinder pingui but I don’t know if you can get them outside of Germany). I just realised after about 4 years of being vegan how much I miss them. They were my favourite growing up :(", "created_utc": "1629405964.0", "edited": "False", "id": "h9kuybh", "is_submitter": "False", "link_id": "t3_p76j3p", "parent_id": "t3_p76j3p", "score": "1", "subreddit": "VeganBaking", "subreddit_id": "t5_2ttgx"}, {"author": "boryeogo", "body": "0x1=lovesong - txt was played during the women’s volleyball, south korea vs japan", "created_utc": "1628788871.0", "edited": "False", "id": "h8oevc3", "is_submitter": "False", "link_id": "t3_p2xpho", "parent_id": "t3_p2xpho", "score": "4", "subreddit": "kpophelp", "subreddit_id": "t5_2vyk1"}, {"author": "boryeogo", "body": "I used to use a jade roller and do gua sha a couple of times a week and I do think it helped my skin. It was less red and blotchy most of the time.", "created_utc": "1628616411.0", "edited": "False", "id": "h8flt59", "is_submitter": "False", "link_id": "t3_p1m674", "parent_id": "t3_p1m674", "score": "4", "subreddit": "Rosacea", "subreddit_id": "t5_2qwbh"}, {"author": "boryeogo", "body": "I wholeheartedly second that", "created_utc": "1628411801.0", "edited": "False", "id": "h85ex1r", "is_submitter": "False", "link_id": "t3_ozs3rt", "parent_id": "t1_h84pqgd", "score": "2", "subreddit": "LanguageMemes", "subreddit_id": "t5_2ybgy"}, {"author": "boryeogo", "body": "The weird thing is English used to have the word “overmorrow” but for whatever reason it’s become obsolete", "created_utc": "1628377283.0", "edited": "False", "id": "h83wlla", "is_submitter": "False", "link_id": "t3_ozs3rt", "parent_id": "t3_ozs3rt", "score": "15", "subreddit": "LanguageMemes", "subreddit_id": "t5_2ybgy"}, {"author": "boryeogo", "body": "I do something like this too! I’ve been meditating a lot to help with my anxiety and numerous thoughts. I don’t force myself to think of anything new though, I just try to acknowledge and accept the thought and then let it go as I refocus on the moment.\n\nFunnily enough I’ve found that when I realise the thought is there, it often kind of goes away on its own.", "created_utc": "1627501956.0", "edited": "False", "id": "h6vboie", "is_submitter": "False", "link_id": "t3_ospjgd", "parent_id": "t1_h6qcsyk", "score": "1", "subreddit": "socialanxiety", "subreddit_id": "t5_2r22n"}, {"author": "boryeogo", "body": "I lived there during the autumn/winter months one year for uni. It’s such a special place, so full of charm and history. Believe it or not after a short while you get used to all the tiny alleys and winding streets and memorise them. I could get around fairly easily like a local after a month or so. You see a different side to the city when all the tourists are gone and there’s a chill in the air", "created_utc": "1626429213.0", "edited": "False", "id": "h5dovoh", "is_submitter": "False", "link_id": "t3_ol6skp", "parent_id": "t3_ol6skp", "score": "1", "subreddit": "interestingasfuck", "subreddit_id": "t5_2qhsa"}, {"author": "boryeogo", "body": "No problem! Juggling more than one language can be hard, but with some organisation it’s possible. You could also want to look at Robin MacPherson’s youtube stuff [here](https://www.youtube.com/user/TheLifeOfRob). He has a dedicated series for learning Mandarin while busy and also a ton of helpful tips and motivation to keep learning when things get a bit overwhelming", "created_utc": "1624475955.0", "edited": "False", "id": "h2suy00", "is_submitter": "False", "link_id": "t3_o6e0zf", "parent_id": "t1_h2st3xp", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "boryeogo", "body": "Depending on your level of Mandarin you might be able to keep it up just by reading a book or watching some tv on a regular basis. You could also schedule small periods of time to study Mandarin - 30 minutes a week for example if you’re super busy.\n\nKorean shares a lot of words with Mandarin and these words have hanja equivalents (Chinese characters) so this would actually provide an opportunity to improve both Korean and Mandarin", "created_utc": "1624462831.0", "edited": "False", "id": "h2s19wz", "is_submitter": "False", "link_id": "t3_o6e0zf", "parent_id": "t3_o6e0zf", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "boryeogo", "body": "I’m still learning Korean so this may not be accurate but my understanding is:\n\n1. 만난 here acts like an adjective or a kind of clause so 만난 사람들 = the people that I met\n\n2. I think it’s common to use 과 함께 together, but 과/와 is always attached to the noun, so it should be 사람들과 \n\n3. technically 하고 있다 is the gerund, but in Korean this kind of sentence usually uses the noun form of a verb, which is 하는 것 (literally, “the doing thing”). i think you can also say 하기(를) 좋아한다", "created_utc": "1623788022.0", "edited": "False", "id": "h1vzne7", "is_submitter": "False", "link_id": "t3_o0n5gi", "parent_id": "t3_o0n5gi", "score": "7", "subreddit": "Korean", "subreddit_id": "t5_2rd8q"}, {"author": "boryeogo", "body": "It seems like a lot of people have answered your questions but I thought I’d offer my experience as well. I live in the UK so my experience is probably a bit different to what you’ll go through. I was 13 weeks when I had my abortion so I had a surgical procedure as well. \n\n1. it doesn’t hurt straight away. I remember it being like a heavy period for a couple of weeks afterwards and I had bad period pain type pain. I had my boyfriend with me whilst I recovered which was indispensable- it really helps to have someone get you food or help you up when it’s tough to move.\n\n2. I was really nervous for the anaesthesia too but it’s just like going to sleep and then waking up from a really deep sleep. I woke up in this kind of lounge chair thing, with my clothes and bag underneath the chair and the nurses gave me tea and biscuits and said I could get up to go change and go home after I’d eaten. \n\n3. I can’t say I remember when I felt “normal” (this was a good 5 years ago now) but after a while I got used to the fact that I had the abortion and now I barely think about it. I knew this was absolutely the right decision for me so it was fairly easy for me to get on with my life, so to speak. \n\nI wish you the best of luck, and hope you recover well and quickly.", "created_utc": "1622836169.0", "edited": "False", "id": "h0ltezx", "is_submitter": "False", "link_id": "t3_ns30xr", "parent_id": "t3_ns30xr", "score": "3", "subreddit": "askwomenadvice", "subreddit_id": "t5_30m5u"}, {"author": "boryeogo", "body": "I'd suggest starting with the one that's most important - whichever you'll be needing the most. If they're equally as important as each other, then I think French might be easier from a native English point of view since the grammar and sentence structure is almost identical. Once things get technical in German, language-wise it gets a bit complicated in my opinion!\n\nSo if you want to start with the \"easiest\", I'd say go with French first but since German is a bit trickier, it'll take longer to learn therefore you could also start with that and catch up with French a bit later - if that makes sense", "created_utc": "1622626337.0", "edited": "False", "id": "h0an51j", "is_submitter": "False", "link_id": "t3_nqh87i", "parent_id": "t3_nqh87i", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}]