[{"author": "Breloom4554", "body": "Soy de los EEUU. Mi lengua materna es el inglés", "created_utc": "1666789681.0", "edited": "False", "id": "itumx5i", "is_submitter": "False", "link_id": "t3_ydk7jq", "parent_id": "t1_itueu6d", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Breloom4554", "body": "If you read Devanagari, is his name ज़ेहन/ज़हन or ज़ैन? \n\nIf not can you write it out in Urdu? (I can't read Urdu but from googling it seems the first is ذہن, second is زین)\n\nI speak Hindi - so trying to figure out how to pronounce it myself", "created_utc": "1666753102.0", "edited": "False", "id": "itt6h47", "is_submitter": "False", "link_id": "t3_yd5nzd", "parent_id": "t1_itr6dod", "score": "2", "subreddit": "SSBM", "subreddit_id": "t5_2so9j"}, {"author": "Breloom4554", "body": "Not B2, but I reached ~B1 in French in 6 months, and only studied ~1 hour a day. (on avg - some I studied for 3 hours and other not at all). If I didn’t have a full time job and studied more hours a day I’m sure theoretically it’s possible to reach B2. I also have no personal interest in French - which is often a powerful motivator.\n\nA few caveats:\n\n1. I speak English natively and Spanish (C1). I barely needed to study grammar at the beginning because I could often translate literally from Spanish. My passive vocabulary is also huge (especially written) just by knowing English.\n\n2. Your first language is often the hardest. I had already taught myself 2-4 languages (depending on how you count it), so I knew how I learned a language \n\n3. I lived in a Francophone area. Surprisingly, I don’t think this was really helpful. Once you’re B1+ immersion helps a lot, but as a total beginner it was pretty useless. I also had a fulltime job in English. \n\n4. I took a few linguistics classes in college - so I already knew about stuff like allophones, phonemes, register, TAM etc.\n\n\nWhat did I do? I spent a week learning the sounds of French (I already knew IPA). I then memorized the 700ish most common words and 50 most common verbs (across the basic tenses - present, imperfect, passé composé, etc). Then I met 2-3 times a week with a tutor for conversation practice, and listened to French podcasts/watched Netflix or Youtube.\n\n\nNot saying you’re slow. It also took me *years* to reach C1 in Spanish (my first foreign language). \n\nI think “6 months to B2 / 12 months to C1” is possible given *a very particular set of circumstances*. I think if you’ve learned a related language (NOT “speak” but “learned” - imo there’s a big difference) and you put in tons of time, you can probably do it. \n\n\nBut like “monolingual English speaker learns Japanese in 6 months” seems quite suspect.", "created_utc": "1666746855.0", "edited": "1666752507.0", "id": "itstgz8", "is_submitter": "False", "link_id": "t3_ydk7jq", "parent_id": "t3_ydk7jq", "score": "67", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Breloom4554", "body": "> I found a couple decent ones through UrbanPro but it's not useful for the level I'm at anymore.\n\nWhat level do you speak at? A challenge I'm facing is I'm fluent (so too advanced for the ABCs) but I still need practice and corrections. A lot of community tutors don't really know what to do with me.\n\nOh that's rough - I'm a bit worried that, when I finally get the chance to visit Gujarat, I'll just end up speaking Hindi (or worse - English) the whole time.", "created_utc": "1666732689.0", "edited": "False", "id": "itrxie9", "is_submitter": "False", "link_id": "t3_yclmz7", "parent_id": "t1_itrm3ow", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Breloom4554", "body": "I've seen this usually in 2 cases:\n\n1. 2nd generation immigrants who are mocked for not fully acquiring their heritage language. Super common (in my experience) and often results in kids refusing to speak the heritage language and forgetting it as they grow older. \n\n2. Learners who had traumatic experiences while learning. I know a French speaker, for example, that refuses to speak French now because she learned in a very stressful environment (e.g. teachers that screamed at her for minor mistakes, etc.), despite being at least C1", "created_utc": "1666729941.0", "edited": "False", "id": "itrqe4d", "is_submitter": "False", "link_id": "t3_yd56or", "parent_id": "t3_yd56or", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Breloom4554", "body": "I agree - it's a really bizarre dynamic.\n\nEven with my tutors, I had to push them to speak in Hindi/Gujarati to me *during lessons I was paying for*. Like I'd speak to them in Hindi/Gujarati and they'd respond in English.\n\nI've had tutors for various different languages (including ones I suck at) and I'd never seen anything like this before. It's like Indian people subconsciously won't speak the language to \"outsiders\" (including people of Indian-origin brought up outside of India).", "created_utc": "1666727928.0", "edited": "False", "id": "itrl1vw", "is_submitter": "False", "link_id": "t3_yclmz7", "parent_id": "t1_itnhs5x", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Breloom4554", "body": "The mental load strikes again.", "created_utc": "1666725891.0", "edited": "False", "id": "itrfo0a", "is_submitter": "False", "link_id": "t3_ybgk2i", "parent_id": "t1_itlq9hm", "score": "2", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "Breloom4554", "body": "Hmm that's fair. Perhaps lower the LGL to like 40 then? \n\nOr we go with the PM solution of modding out ledge refresh invincibility after 5 regrabs T.T lol", "created_utc": "1666720936.0", "edited": "False", "id": "itr2qr6", "is_submitter": "False", "link_id": "t3_yck0pq", "parent_id": "t1_itqwmy8", "score": "3", "subreddit": "SSBM", "subreddit_id": "t5_2so9j"}, {"author": "Breloom4554", "body": "Is there a good solution to preventing circle camping?\n\nThe LGL imo solves the ledge camping issue, people just need to take it seriously. (Also maybe if there was some real-time way to know ledge-grabs that could help - like a number next to each player's stock count). \n\nThe Hbox-ibdw set where they played game 1 AND THEN asked TOs what the LGL was (and got 2 different answers) is a good example of a good idea that no one took seriously until it mattered.", "created_utc": "1666708598.0", "edited": "False", "id": "itq76s1", "is_submitter": "False", "link_id": "t3_yck0pq", "parent_id": "t1_itor33s", "score": "3", "subreddit": "SSBM", "subreddit_id": "t5_2so9j"}, {"author": "Breloom4554", "body": "I have an epipen and have told this to my gf/brother/etc. \n\nAn epipen DOES NOT fix the issue. It keeps you alive long enough for 911 to find you.\n\nIf you see me using an epipen, immediately call 911 for me.", "created_utc": "1666639554.0", "edited": "False", "id": "itmlpsm", "is_submitter": "False", "link_id": "t3_ychrqa", "parent_id": "t1_itm8leb", "score": "1993", "subreddit": "BestofRedditorUpdates", "subreddit_id": "t5_2ea6kj"}, {"author": "Breloom4554", "body": "Slug ;_;", "created_utc": "1666578811.0", "edited": "False", "id": "itjie9a", "is_submitter": "False", "link_id": "t3_yb7kwp", "parent_id": "t3_yb7kwp", "score": "5", "subreddit": "SSBM", "subreddit_id": "t5_2so9j"}, {"author": "Breloom4554", "body": "Why tf would you switch the set midgame", "created_utc": "1666551176.0", "edited": "1666551248.0", "id": "ithoicy", "is_submitter": "False", "link_id": "t3_yb7kwp", "parent_id": "t3_yb7kwp", "score": "-1", "subreddit": "SSBM", "subreddit_id": "t5_2so9j"}, {"author": "Breloom4554", "body": "Vish and Toph on COD were also hillarious.\n\n\"FBI losing again.\"  \n\"Yeah well, you can't really expect them to play well; they're more of an intelligence org\"  \n\"No intelligence here, Toph, I can tell you that\"", "created_utc": "1666296041.0", "edited": "False", "id": "it43dbl", "is_submitter": "False", "link_id": "t3_y84tzx", "parent_id": "t1_isyoq0a", "score": "3", "subreddit": "SSBM", "subreddit_id": "t5_2so9j"}, {"author": "Breloom4554", "body": "I'm reminded of Bidou in Smash 4. \n\nPeople theorycrafted about it and the possibilities were astounding. Until people realized it required you to completely re-learn your entire muscle memory.\n\nIn the end the pros largely just ignored it and kept doing what they were used to - even if it was theoretically \"suboptimal\".", "created_utc": "1666273302.0", "edited": "False", "id": "it2he32", "is_submitter": "False", "link_id": "t3_y8hrmn", "parent_id": "t1_it1a33i", "score": "5", "subreddit": "SSBM", "subreddit_id": "t5_2so9j"}, {"author": "Breloom4554", "body": "The mention of Slug makes me imagine how surreal it'd be - the first ICs to win a (modern) major and it's without wobbling", "created_utc": "1666056262.0", "edited": "False", "id": "isqyvbd", "is_submitter": "False", "link_id": "t3_y6enpg", "parent_id": "t3_y6enpg", "score": "10", "subreddit": "SSBM", "subreddit_id": "t5_2so9j"}]