[{"author": "Caithfidh_me_a_ra", "body": "Fluent just means being able to speak fluidly, without lots of pauses or obvious grammar mistakes.\n\nThe language that I am learning has a second way to describe mastery of a language. You can say that a language is 'at your will'. I am currently preparing for the B2 exam in my target language, and when I speak people tell me that I am 'fluent', but the truth is that the language is not completely 'at my will' because I can't say all of the things that I want to say in order to express myself fully. They don't know that, they just hear what I am saying and think that it sounds 'fluent'.", "created_utc": "1664486762.0", "edited": "False", "id": "iqf3w3e", "is_submitter": "False", "link_id": "t3_xqzxx3", "parent_id": "t3_xqzxx3", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Caithfidh_me_a_ra", "body": "I'm an INFJ, 37F. I Have a great connection with my husband, we have been happily married for 14 years. \n\nI have lots of aquaintances but it's hard to make real friends. I think it's something that is hard for everyone as you get older, but it's harder for N types. Most people seem to be S types and I find it very hard to make a connection with them because they never share any of my interests and they don't understand the topics that I spend most of my free time reading and thinking about.", "created_utc": "1664446892.0", "edited": "False", "id": "iqclnmc", "is_submitter": "False", "link_id": "t3_xqd2h0", "parent_id": "t3_xqd2h0", "score": "3", "subreddit": "infj", "subreddit_id": "t5_2r39a"}, {"author": "Caithfidh_me_a_ra", "body": "Improve the standards in primary schools. There is nothing wrong with the way the language is taught in secondary schools. The problem is that there is an assumption that kids are starting secondary school with a certain level of Irish, but in reality many of them are finishing primary school with barely a word.\n\nSchools are expected to get every pupil up to a minimum standard in English and maths. Kids are tested every year using standardised tests such as the drumcondra tests, micra-t and sigma-t. They are given a score from 1-10, any child scoring 3 or under qualifies for learning support to bring them up to standard. \n\nIn this way it is ensured that schools are all teaching to a similar standard and that no children are slipping through cracks.\n\nIrish needs to be standardised like this. My childrens school offers zero help or learning support for children struggling with Irish. In fact, many of the learning support teachers have qualified abroad and are not qualified to teach Irish at all. My eldest son is in second year in the local secondary school where they have just streamed the Irish class. Two thirds of the students were put in ordinary level Irish. That is due to the poor standard of Irish they arrived with.", "created_utc": "1664360473.0", "edited": "False", "id": "iq7v8n1", "is_submitter": "False", "link_id": "t3_xpqhbf", "parent_id": "t3_xpqhbf", "score": "1", "subreddit": "ireland", "subreddit_id": "t5_2qhb9"}, {"author": "Caithfidh_me_a_ra", "body": "We probably didn't use the myomunchee properly, they didn't tolerate it very well so I would say we got about max 5 min a day out of it. We used them until they wore out, I can't remember how long that was, a good few months anyway.\n\nYeah my middle boy had sleep issues, night terrors, frequent waking, snoring and occasional sleep apnea. He's much improved now. He still sleeps with his mouth open most of the time but he doesn't snore any more. He wore the ALF for about 2 years and it massively increased the size of his jaw and his face really changed.\n\nIt's so difficult to get them to breathe through their nose. My eldest and youngest reliably do now but my middle boy just won't.\n\nYeah the younger they are the quicker it works. When my youngest got hers in at age 6 she had a gap open up between her front teeth by the following day.", "created_utc": "1635507536.0", "edited": "False", "id": "hii0vso", "is_submitter": "False", "link_id": "t3_qhlafa", "parent_id": "t1_hifkc3e", "score": "2", "subreddit": "orthotropics", "subreddit_id": "t5_32xps"}, {"author": "Caithfidh_me_a_ra", "body": "I used a myomunchee with my kids when they were that age. I didn't find that it helped mine much, but it would be worth a try. Keep going with the myofunctional exercises. \n\nMy three got ALF's at ages 11, 8 and 6. It made a huge difference in the 8 year old, he had the smallest jaw and the difference in him after a year was amazing. He was very similar to your son with the gagging and choking, he had feeding therapy to address it. He has a lot of sensory issues and he found it quite distressing every time he needed to get the appliance adjusted. He wouldn't have been able for it any earlier than age 8.\n\nMy 6 year old didn't need as much expansion but she had an underbite so she had to get a reverse-pull face mask, which attached to the alf. I felt like she was very young to be getting an appliance in her mouth and I felt bad for her, but the reverse pull mask works best before 8.\n\nHave you tried buteyko breathing? My dentist keeps telling me to bring the kids to a course but I keep missing the dates.", "created_utc": "1635451112.0", "edited": "False", "id": "hif8w12", "is_submitter": "False", "link_id": "t3_qhlafa", "parent_id": "t3_qhlafa", "score": "1", "subreddit": "orthotropics", "subreddit_id": "t5_32xps"}]