[{"author": "CamStudentofLife", "body": "Yeah!! Just go in with confidence, and I’m sure you’ll come out with that seal :) Good Luck!", "created_utc": "1666051413.0", "edited": "False", "id": "isqonr5", "is_submitter": "False", "link_id": "t3_y6h2gs", "parent_id": "t1_isqohmr", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "CamStudentofLife", "body": "Lol idk, google it?  I can only speak to STAMPS because thats the one my high school administered.  That being said, if you miss the score on whatever test you’re taking, you can register for the AP test and the state of michigan accepts a 4 or 5 for the seal of biliteracy to be retroactively applied to your diploma (if you graduate before the AP scores come out)", "created_utc": "1666051305.0", "edited": "False", "id": "isqofsj", "is_submitter": "False", "link_id": "t3_y6h2gs", "parent_id": "t1_isqo6ya", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "CamStudentofLife", "body": "It corresponds pretty directly to the typical themed vocab lists that most high school classes run (furniture, activities, food, locations, etc.) I’d say if you can describe most of the things around you on a daily basis and know the top 2k-ish words on the frequency tests you’ll be set", "created_utc": "1666051198.0", "edited": "False", "id": "isqo82c", "is_submitter": "False", "link_id": "t3_y6h2gs", "parent_id": "t1_isqnz3w", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "CamStudentofLife", "body": "I can’t speak to the other test you mentioned, but at least with STAMPS you can re-record the speaking section of the test as many times as you need.  I’d imagine you have Portuguese seal locked down unless you fumble the bag HARD 😂, thats really a level much higher than they expect for biliteracy if you’re truly near C1.  With Spanish, I’d just recommend you learn a few filler words to plug in when you take longer to think and then you wont really get penalized for hesitating.", "created_utc": "1666051079.0", "edited": "False", "id": "isqnzl5", "is_submitter": "False", "link_id": "t3_y6h2gs", "parent_id": "t1_isqnlbp", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "CamStudentofLife", "body": "When I took the test I was probably low B2 and I scored straight 9s (STAMPS) without putting in too much effort.  It doesn’t really test language ability to a high level, but you definitely need to have concrete understanding of the grammar and most importantly a pretty broad vocabulary. With a lot of my friends who had just taken 5 years of spanish but not really studied it hard outside of class, it was about a 50/50 for those that got the seal and those that didnt and they were probably a mid to high A2 level", "created_utc": "1666050849.0", "edited": "False", "id": "isqniv8", "is_submitter": "False", "link_id": "t3_y6h2gs", "parent_id": "t1_isqlhls", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "CamStudentofLife", "body": "So in Michigan you need a 6 in all the categories on STAMPS to get the seal and I’d say you can probably earn that even with a high A2 level.  If you want a good bar for understanding, the hardest reading is about the level of your average newspaper article, the hardest listening is about the speed of a typical NPR story (bigger vocab but slow talking), and the writing and speaking prompts are basically the common prompts from low level spanish (what are you buying at the grocery store, describe a fun day in the past), you just need to think of ways to incorporate advanced grammatical concepts and fluid speaking in order to show that you’re proficient beyond the level that a Spanish 1 student would respond to those prompts", "created_utc": "1666050688.0", "edited": "False", "id": "isqn72i", "is_submitter": "False", "link_id": "t3_y6h2gs", "parent_id": "t1_isqlhls", "score": "5", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "CamStudentofLife", "body": "Got my seal in spanish 2 years ago, I found that the test was probably hard for what tested but it didnt test much.  If you’re talking about the STAMPS language test at least (the one my High School offered).  It was pretty hard to earn the highest scores on the test (9 in each category being the highest) but a 9 probably corresponded to a high B1 level or low B2 compared to CEFR levels, so if you’re at a high level in the languages it should be no trouble.  With most of the standardized tests for the Seal of Biliteracy the reading and listening sections are pretty easy, and the input sections (speaking and writing) are graded pretty heavily on how much you have.  Since you technically have unlimited time for the writing they really expect you to write a lot to earn the highest scores, and having high quality writing in a short quantity will still result in a low score even if the writing itself is advanced.", "created_utc": "1666049376.0", "edited": "False", "id": "isqki1l", "is_submitter": "False", "link_id": "t3_y6h2gs", "parent_id": "t3_y6h2gs", "score": "6", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "CamStudentofLife", "body": "Tiquismiquis will always be a favorite for Spanish", "created_utc": "1657017011.0", "edited": "False", "id": "iexd325", "is_submitter": "False", "link_id": "t3_vrlh4c", "parent_id": "t3_vrlh4c", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "CamStudentofLife", "body": "[R/LanguageLearningJerk](https://www.reddit.com/r/languagelearningjerk/)", "created_utc": "1656921745.0", "edited": "False", "id": "iesmqvh", "is_submitter": "False", "link_id": "t3_vqnrcm", "parent_id": "t3_vqnrcm", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "CamStudentofLife", "body": "19M college student here and native English speaker, pásame un mensaje si quieres charlar :)", "created_utc": "1656281429.0", "edited": "False", "id": "iduvza2", "is_submitter": "False", "link_id": "t3_vl79i0", "parent_id": "t3_vl79i0", "score": "1", "subreddit": "language_exchange", "subreddit_id": "t5_2tdbm"}]