[{"author": "ChillingTea", "body": "I was so pregnant looking day 4 and 5. I feel like we should collectively warn anyone about to have the surgery to take stool softeners a week before because damn I was uncomfortable 🥲", "created_utc": "1666668502.0", "edited": "False", "id": "itoh5mh", "is_submitter": "False", "link_id": "t3_ycj4k0", "parent_id": "t3_ycj4k0", "score": "2", "subreddit": "Reduction", "subreddit_id": "t5_2y2hj"}, {"author": "ChillingTea", "body": "Thank you for explaining, I feel like I understand a bit more!", "created_utc": "1666618423.0", "edited": "False", "id": "itl50wm", "is_submitter": "False", "link_id": "t3_yc5eat", "parent_id": "t1_itl4ton", "score": "37", "subreddit": "actuallesbians", "subreddit_id": "t5_2rch0"}, {"author": "ChillingTea", "body": "Hey there, I hope you don’t mind me asking, but how is it that you would prefer masculine pronouns despite identifying and presenting femininely? Like, wouldn’t feminine pronouns be another extension of your preference to be feminine and be seen and read as feminine?\n\nHope this doesn’t sound invalidating or mean, just trying to understand more.", "created_utc": "1666618219.0", "edited": "False", "id": "itl4lc8", "is_submitter": "False", "link_id": "t3_yc5eat", "parent_id": "t1_itl03du", "score": "75", "subreddit": "actuallesbians", "subreddit_id": "t5_2rch0"}, {"author": "ChillingTea", "body": "I think a lot of lesbians experience trauma around men, maleness, and masculinity, but that is something to work through and heal. NB people of all presentations of course belong in lesbian spaces, and I hope all the people hesitant or hostile about NBs can work through their baggage and become better allies. We are stronger together than apart, and we share many struggles. To unity and empathy ❤️", "created_utc": "1666296657.0", "edited": "False", "id": "it44yon", "is_submitter": "False", "link_id": "t3_y8wz5p", "parent_id": "t3_y8wz5p", "score": "4", "subreddit": "actuallesbians", "subreddit_id": "t5_2rch0"}, {"author": "ChillingTea", "body": "Hey there! How long has it been since the initial surgery, and have you brought your concerns to your surgeon? I agree your left breast looks lovely, but maybe your doc can advise you further on a possible revision for the right to address your concerns about the nipple placement and position.", "created_utc": "1666054853.0", "edited": "False", "id": "isqvwre", "is_submitter": "False", "link_id": "t3_y6s6v0", "parent_id": "t3_y6s6v0", "score": "10", "subreddit": "Reduction", "subreddit_id": "t5_2y2hj"}, {"author": "ChillingTea", "body": "Gorgeous!!! I find it so hard to capture light hair and white tones with colored pencils, great job. He looks so pretty ❤️", "created_utc": "1666054479.0", "edited": "False", "id": "isqv4t0", "is_submitter": "False", "link_id": "t3_y6akah", "parent_id": "t3_y6akah", "score": "2", "subreddit": "straykids", "subreddit_id": "t5_3ozlw"}, {"author": "ChillingTea", "body": "Nasim Aghdam was a prolific environmentalist and vegan YouTuber before she became the YouTube shooter. After many of her videos became demonetized, she grew angry and paranoid that the company was conspiring against her. She has a large catalogue of videos online, some of which have been reposted and are available on YouTube. Most of them are in various languages such as Persian, Turkish, and Azerbaijani, but there are a few in English as well.", "created_utc": "1666001660.0", "edited": "False", "id": "isnnulk", "is_submitter": "False", "link_id": "t3_y63xv8", "parent_id": "t3_y63xv8", "score": "98", "subreddit": "UnresolvedMysteries", "subreddit_id": "t5_2wvvc"}, {"author": "ChillingTea", "body": "I think from the look of this list, you know your answer. It is completely okay to be stressed when people ask about something so personal. I hope there will come a day where you’re able to respond with confidence and pride as to who you are, and whoever you love.\n\nBy the way, your handwriting is so pretty.", "created_utc": "1665944311.0", "edited": "False", "id": "iskmw8e", "is_submitter": "False", "link_id": "t3_y5fckp", "parent_id": "t3_y5fckp", "score": "3", "subreddit": "actuallesbians", "subreddit_id": "t5_2rch0"}, {"author": "ChillingTea", "body": "Khmer, the language of Cambodia. I can understand more than I speak, but it’s so rare I don’t encounter it besides a bit from my family. Also I can’t read it at all, because the writing system is insane!", "created_utc": "1665867803.0", "edited": "False", "id": "isgnga6", "is_submitter": "False", "link_id": "t3_y4vybr", "parent_id": "t3_y4vybr", "score": "11", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "ChillingTea", "body": "You sound young, so I’m gonna say it like this: cringe is a state of mind. Everyone has nerdy or unique interests. Your mom just enjoys some music, and there’s no harm in that. \n\nAnd that said, you shouldn’t base your opinions on what is cringe by what your friends say. Think for yourself, live with honesty, let others have fun without shame. One day you’ll pick up a weirdo interest and have to deal with younger people judging you, and that’s life.", "created_utc": "1665863946.0", "edited": "False", "id": "isgeepi", "is_submitter": "False", "link_id": "t3_y4w8il", "parent_id": "t3_y4w8il", "score": "15", "subreddit": "kpophelp", "subreddit_id": "t5_2vyk1"}, {"author": "ChillingTea", "body": "Definitely enter the shower backwards, with your back to the stream. Sit if you can, or maybe have a loved one help wash your hair since you want to limit lifting your arms. Use a medium warmth water and don’t push yourself if you start to feel weak or faint. Don’t feel nervous, you got this and it’ll be a relief to feel more fresh!", "created_utc": "1665762063.0", "edited": "False", "id": "isaup0s", "is_submitter": "False", "link_id": "t3_y3vm5t", "parent_id": "t3_y3vm5t", "score": "8", "subreddit": "Reduction", "subreddit_id": "t5_2y2hj"}, {"author": "ChillingTea", "body": "Yes. He can have done all of these positive things, and still have messed up in his rhetoric here. I’m happy he’s helped you and done all that, but his statements here have missed the mark and hurt his credibility.", "created_utc": "1665726966.0", "edited": "False", "id": "is98t30", "is_submitter": "False", "link_id": "t3_y3be3h", "parent_id": "t1_is9536l", "score": "19", "subreddit": "UCSC", "subreddit_id": "t5_2r3oq"}, {"author": "ChillingTea", "body": "This man has made disparaging and damaging remarks about other indigenous and mixed people (why the quotations, dude?) and seems to be having a public meltdown. As if “white passing” folks are the enemy, and not white hegemony. Get this man out of his public-facing role that he is clearly not equipped to be mature about and into some help", "created_utc": "1665702756.0", "edited": "False", "id": "is7xi21", "is_submitter": "False", "link_id": "t3_y3be3h", "parent_id": "t3_y3be3h", "score": "92", "subreddit": "UCSC", "subreddit_id": "t5_2r3oq"}, {"author": "ChillingTea", "body": "Looks natural to me, I would write it that way too. Read aloud I would want to pause there :)", "created_utc": "1665672137.0", "edited": "False", "id": "is5sa8w", "is_submitter": "False", "link_id": "t3_y2nhvp", "parent_id": "t3_y2nhvp", "score": "3", "subreddit": "grammar", "subreddit_id": "t5_2qhwy"}, {"author": "ChillingTea", "body": "Idk where a good cry spot is but honestly if i see you crying girl dont worry about it, no judgement. Everyone is going through it sometimes", "created_utc": "1665558092.0", "edited": "False", "id": "irzrqj6", "is_submitter": "False", "link_id": "t3_y1qib7", "parent_id": "t3_y1qib7", "score": "7", "subreddit": "UCSC", "subreddit_id": "t5_2r3oq"}, {"author": "ChillingTea", "body": "Hey! Thank you for sharing your progression pics, your healing looks amazing! At 12 dpo myself, it also helped me put into perspective the kind of healing one might see on others and to worry a little less.\n\nMay I ask, around what size did you discuss with your surgeon that you wanted to end up at? And I know it is still hard to say with healing ahead, but if you feel comfortable saying, around what size are you now?", "created_utc": "1665530620.0", "edited": "False", "id": "irye2hm", "is_submitter": "False", "link_id": "t3_y1m5wb", "parent_id": "t3_y1m5wb", "score": "3", "subreddit": "Reduction", "subreddit_id": "t5_2y2hj"}, {"author": "ChillingTea", "body": "There is a common occurrence where the bottom half of the breasts get red due to the blood vessels reconnecting and getting blocked up? Something like that, but this happens! Unfortunately it can also be a sign of infection. If the breasts are warm to the touch and the redness has snaky tendrils, then it is more likely an infection. However I had this redness and it wasn’t infected, just the reconnecting thing.\n\nI recommend keeping an eye on this, take pics, and let your doctor know your concerns and they can help determine the cause", "created_utc": "1665405291.0", "edited": "False", "id": "irr5dlg", "is_submitter": "False", "link_id": "t3_y0ct56", "parent_id": "t3_y0ct56", "score": "7", "subreddit": "Reduction", "subreddit_id": "t5_2y2hj"}, {"author": "ChillingTea", "body": "Recovery was a bit rough on days 1-5, as I was in a lot of pain, super bloated and constipated from the opioid painkillers. However after about a week I was significantly better and able to help myself more. What I learned was definitely lean on a friend or family member through those first tough days, drink tons of water, and take a lot of little naps. Also, fiber vitamins and yogurt saved my life in the bathroom lol", "created_utc": "1665336760.0", "edited": "False", "id": "irnpehs", "is_submitter": "False", "link_id": "t3_xz2oey", "parent_id": "t1_irllwpy", "score": "1", "subreddit": "Reduction", "subreddit_id": "t5_2y2hj"}, {"author": "ChillingTea", "body": "Hi there. I was of a similar size range (36D according to Victorias Secret, but I wager larger than that). I had about an inch of skin overlap and huge insecurities about being disproportionate and too big for a smaller frame. \n\nI just got my reduction 8 days ago. Right now it is too soon to tell what size I will be because of swelling and stiffness, but my guess is a small B cup. And honestly? I have no regrets. Even with the pain and uncertainty, I feel such liberation from my anxiety and relief about fitting into clothes I like, working out more, and generally feeling way better about myself. Already my back hurts less and my posture is improved. \n\nEveryone is different, but these are my thoughts:   I didn’t want to live the rest of my life feeling the way I did preop, so I had to make a change. I was privileged enough to have my insurance cover everything and I was lucky that there were no complications or disfigurement (crossing my fingers, anyway). \n\nI hope you can find your own answer and your happiness ! Ask me anything, too, and I could offer my opinion/experience after just doing this", "created_utc": "1665266787.0", "edited": "False", "id": "irk9bzn", "is_submitter": "False", "link_id": "t3_xz2oey", "parent_id": "t3_xz2oey", "score": "8", "subreddit": "Reduction", "subreddit_id": "t5_2y2hj"}, {"author": "ChillingTea", "body": "I would say maybe “audacious” or “glib”! These come to mind, and seem like stronger ways to describe someone whose cheekiness turns into disrespect.", "created_utc": "1665183096.0", "edited": "False", "id": "irghv8y", "is_submitter": "False", "link_id": "t3_xyb7bv", "parent_id": "t3_xyb7bv", "score": "3", "subreddit": "EnglishLearning", "subreddit_id": "t5_2u8ap"}, {"author": "ChillingTea", "body": "I just love him so much. Too cute 💕", "created_utc": "1665115055.0", "edited": "False", "id": "ird98g4", "is_submitter": "False", "link_id": "t3_xx8o3r", "parent_id": "t3_xx8o3r", "score": "2", "subreddit": "straykids", "subreddit_id": "t5_3ozlw"}, {"author": "ChillingTea", "body": "Both kind of sound off and aren’t specific. To completely clarify the meaning, you’d have to use the more specific noun, window sill, which refers to the structure you put stuff on.\n\nEx: “There is a flower pot on the window sill.”", "created_utc": "1665029386.0", "edited": "False", "id": "ir8pyr9", "is_submitter": "False", "link_id": "t3_xwsn6l", "parent_id": "t3_xwsn6l", "score": "2", "subreddit": "grammar", "subreddit_id": "t5_2qhwy"}, {"author": "ChillingTea", "body": "Hey there!\n\nI want to just say great job so far on your learning journey. In only 3mths, you have improved so much now that you are starting to find out exactly how much you don’t know! It is a huge step, going from the confidence of memorizing greetings and short phrases easily but then starting to feel overwhelmed by the huge, rising monster of “everything else!” \n\nMy recommendation to you is to firstly pat yourself on the back, remember to take breaks, and focus on the satisfaction of picking up those bits you are learning right now, and don’t linger on the cumulative mass of what you don’t.\n\nI recommend Anki or Memrise, where you can custom make cards tailored to what you already know and are trying to recall daily. However, my tried and true method has never failed me: paper flash cards. Writing the words itself is great exercise, and you can bring it with you everywhere. It sounds silly, but the results have been awesome for me.\n\nAlso try “shadowing” Armenian language phrases from media. Turn on a video with Armenian language, listen to one phrase they say, and repeat it until you can comfortably say it with the speaker at the same time, in the same cadence, rhythm, and accent, to make it sound seemless.\n\nGood luck, keep going strong!", "created_utc": "1665010954.0", "edited": "False", "id": "ir7pu8a", "is_submitter": "False", "link_id": "t3_xw6j6i", "parent_id": "t3_xw6j6i", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "ChillingTea", "body": "I hate to come off suspicious and unempathetic but this either sounds incredibly unlikely or a manifestation of paranoid social anxiety. I have often struggled with thinking I was being stared at or mocked in public but the reality is is that it is most likely 99.9999% untrue. Everyone is going about their business and they don’t know you or would even remember you. They pick up thousands of students each day and you are just one of them. \n\nThe traffic is super bad right now, and they cut funding for the busses. We should expect to have these full bus experiences for a bit until conditions improve or less students are attending class.\n\nMy recommendation is to talk to a therapist or counselor about these feelings; definitely try our on-campus CAPS program that comes with UCSHIP. They can refer you to a path of treatment and adjustment.\n\nStay strong, and I’m sorry this is going on.", "created_utc": "1665010182.0", "edited": "False", "id": "ir7o5n0", "is_submitter": "False", "link_id": "t3_xwhiip", "parent_id": "t3_xwhiip", "score": "30", "subreddit": "UCSC", "subreddit_id": "t5_2r3oq"}, {"author": "ChillingTea", "body": "There can be complications and elevated risk in regards to putting patients with higher BMI under anesthesia, which doctors try to reduce by urging safe weight loss before the surgery. However, this totally sucks, because exercising with overly large breasts can be incredibly difficult and cause things like rashes from sweat under the breasts. \n\nI would definitely follow up and ask why he recommended weight loss, and also ask for resources on losing it heathily prior to your procedure.", "created_utc": "1664856926.0", "edited": "False", "id": "iqz6xs6", "is_submitter": "False", "link_id": "t3_xv4ezd", "parent_id": "t3_xv4ezd", "score": "5", "subreddit": "Reduction", "subreddit_id": "t5_2y2hj"}, {"author": "ChillingTea", "body": "Hey there! Here are some issues I brought up to my GP that she thought reasonable to make a referral for:\n\n- back, chest, and neck pain that interferes with daily life and isn’t well treated by tylenol/ibuprofen \n- bra strap grooving on the shoulders from where they dig in with heavy weight\n- under breast rashes from sweat and chafing\n- insecurity and psychological pain\n- difficulty exercising, running, dancing, etc. due to breast size and weight\n- a continued expression of these symptoms over a long period of time into adulthood\n\nMy advice is to just be as honest as possible and don’t sugarcoat how it feels — talk about the physical and mental and how long it has been going on and causing you pain and insecurity.\n\nWish you luck!! Xoxo", "created_utc": "1664825359.0", "edited": "False", "id": "iqx8bas", "is_submitter": "False", "link_id": "t3_xupfuj", "parent_id": "t3_xupfuj", "score": "7", "subreddit": "Reduction", "subreddit_id": "t5_2y2hj"}, {"author": "ChillingTea", "body": "The other comments are correct, and I just want to add that it has a slightly patronizing or hostile tone, as if you are questioning someone’s statement or asking them to consider if they are truly correct. Ex: “I would know, I’m a lawyer.” “Are you now? You don’t sound like one.”", "created_utc": "1664250877.0", "edited": "False", "id": "iq2au6f", "is_submitter": "False", "link_id": "t3_xovvzg", "parent_id": "t3_xovvzg", "score": "2", "subreddit": "grammar", "subreddit_id": "t5_2qhwy"}, {"author": "ChillingTea", "body": "It is an idiom meaning, “when things get tough/competitive.” An example would be: “She’s a very sensitive person. When push comes to shove, I don’t think she could win the competition.” It is a relatively common phrase. Hope this helps!", "created_utc": "1664250710.0", "edited": "False", "id": "iq2ajhi", "is_submitter": "False", "link_id": "t3_xp539q", "parent_id": "t3_xp539q", "score": "3", "subreddit": "grammar", "subreddit_id": "t5_2qhwy"}, {"author": "ChillingTea", "body": "The first phrase, “some freak of the higher intelligence,” doesn’t make much sense to me as a native English speaker. I showed it to some of my friends and they also had no clue! This writing is difficult.\n\nHowever, I can help with a “days’ work.” It refers to the concept of the necessary things that a worker does to make money, and it implies a satisfaction or good feeling about it. A common phrase is, “all in a days’ work!” which means, “that’s a part of my job, and I’m pleased about it!”", "created_utc": "1664250009.0", "edited": "False", "id": "iq2998n", "is_submitter": "False", "link_id": "t3_xp3ny1", "parent_id": "t3_xp3ny1", "score": "4", "subreddit": "EnglishLearning", "subreddit_id": "t5_2u8ap"}, {"author": "ChillingTea", "body": "Thank you for sharing your experience. Finding comfort in our bodies is a journey and I wish you the best. That being said, I think you look beautiful and proportionate, and it wouldn’t occur to me that your nipple placement was too high at all. \n\nSurgery is a physical ordeal that heals visibly, but there’s also a mental ordeal from so much change and intervention that needs mental healing, too. Take some time to adjust to the changes of your body and remember be kind to yourself too; I find it helps with dysmorphia and other negative self image talk to imagine my criticisms are at another woman or a younger sister/relative. Like, would I say this was a flaw or  looked disproportionate to someone else? Am I being particularly critical because it’s me?\n\nStuff to think about. Hope this helps xo", "created_utc": "1662772839.0", "edited": "False", "id": "insvwmb", "is_submitter": "False", "link_id": "t3_x5zos9", "parent_id": "t3_x5zos9", "score": "1", "subreddit": "Reduction", "subreddit_id": "t5_2y2hj"}, {"author": "ChillingTea", "body": "Coconuts by Kim Petras!! A bop about boobies", "created_utc": "1661372874.0", "edited": "False", "id": "iln4hhv", "is_submitter": "False", "link_id": "t3_ww20jz", "parent_id": "t3_ww20jz", "score": "2", "subreddit": "Reduction", "subreddit_id": "t5_2y2hj"}, {"author": "ChillingTea", "body": "Hey there! I have an appointment scheduled with Dr. Menard, but haven’t seen any info/B&A’s online. However his credentials and experience seem really good; what were your thoughts on him?", "created_utc": "1659481577.0", "edited": "False", "id": "iipk7pt", "is_submitter": "False", "link_id": "t3_vy9lcy", "parent_id": "t3_vy9lcy", "score": "1", "subreddit": "Reduction", "subreddit_id": "t5_2y2hj"}, {"author": "ChillingTea", "body": "Yess I love Stray Kids, Twice, itzy, Dreamcatcher, StayC, aespa, Purple Kiss, and I’m getting into enha and txt !", "created_utc": "1643869452.0", "edited": "False", "id": "hvdzf5u", "is_submitter": "False", "link_id": "t3_sjak62", "parent_id": "t3_sjak62", "score": "2", "subreddit": "UCSC", "subreddit_id": "t5_2r3oq"}, {"author": "ChillingTea", "body": "I love how everyone is so wholesome and then Hyunjin seems to have gotten a different assignment lolol they're all amazing\n\nLee know cute (and he knows it)!", "created_utc": "1637612734.0", "edited": "False", "id": "hlojs4d", "is_submitter": "False", "link_id": "t3_qzndie", "parent_id": "t3_qzndie", "score": "10", "subreddit": "straykids", "subreddit_id": "t5_3ozlw"}, {"author": "ChillingTea", "body": "Han with blond hair is so surprising and refreshing!", "created_utc": "1637612498.0", "edited": "False", "id": "hloj71n", "is_submitter": "False", "link_id": "t3_qzj3s8", "parent_id": "t3_qzj3s8", "score": "5", "subreddit": "straykids", "subreddit_id": "t5_3ozlw"}, {"author": "ChillingTea", "body": "Soo cute 💕", "created_utc": "1636331832.0", "edited": "False", "id": "hjqun5h", "is_submitter": "False", "link_id": "t3_qp1w3t", "parent_id": "t3_qp1w3t", "score": "5", "subreddit": "straykids", "subreddit_id": "t5_3ozlw"}, {"author": "ChillingTea", "body": "You captured his likeness so well! Why does he suit an edgy concept with blood so much?? Idk but this looks great <3", "created_utc": "1635379041.0", "edited": "False", "id": "hibe52b", "is_submitter": "False", "link_id": "t3_qgv191", "parent_id": "t3_qgv191", "score": "2", "subreddit": "straykids", "subreddit_id": "t5_3ozlw"}, {"author": "ChillingTea", "body": "Hey, I feel you. Moving is hard emotionally and sometimes we need more time to adjust to a new environment and feel less unstable. I'm so sorry you're having a rough time, but I promise you'll be alright. If you need a friend or someone to talk to, there are resources here on campus like CAPS (counseling and psychological services) that offers both in person and distance stuff to help.\n\nStay strong, we'll all be okay", "created_utc": "1632435332.0", "edited": "False", "id": "he0oirk", "is_submitter": "False", "link_id": "t3_pu5dub", "parent_id": "t3_pu5dub", "score": "19", "subreddit": "UCSC", "subreddit_id": "t5_2r3oq"}]