[{"author": "colutea", "body": "About the university classes: at which time did they take place? I am interested but I have a full time job now and taking any that are not in the evening is hard. And also, could you also just join the class without enrolling there as a student who is pursuing a degree?", "created_utc": "1664186401.0", "edited": "False", "id": "ipyas9y", "is_submitter": "False", "link_id": "t3_xnupx1", "parent_id": "t3_xnupx1", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "colutea", "body": "As a UX designer, I feel like Anki could definitely be improved. I know, it has much functionality, and you can customize it endlessly, BUT only if you spend the time. For many things, you also need a PC additionally that could also not be taken for granted. 92% of the Internet users use a smartphone ([source](https://www.statista.com/statistics/1289755/internet-access-by-device-worldwide/)). Having a desktop (66.8%) cannot be expected as a standard anymore. I know Anki has a mobile app (I refer hereby to the iOS one)—but most of the setup and customization needs to be done on a PC. And then, you also face many options, which is overwhelming for the majority (Hick's law).\n\nSo, if you are all new to this - Anki isn't exactly easy to use (at least the setup part—the review part is fine). Then, another factor is the experience. UX is not only about usability, but also about making you feel good and also enjoyment—basically your feelings. And Anki feels technical. If you start new, it might even feel boring. \n\nSo, then on the other side we have apps like Duolingo or LingoDeer or Memrise that are easy to use and also make you feel good. There is no cumbersome setup stage. They motivate you to continue. But: they are not suited for the learner who likes to follow their own path and material. Then, there are apps like Quizlet. Easy to set up, easy to use. It can be customized and will serve most languages, besides ones that need more information. For example, Japanese. The way Quizlet works is that you set a definition and an answer, and maybe an additional picture / audio (if you pay). But for Japanese, you may want more fields like the sentence, the reading, and the meaning (plus maybe pitch, stroke order etc.). So, people may feel like solutions like Quizlet are too simple.\nAnd the other thing that exists that allows this type of customization is the overwhelming Anki. \n\nI think there is a gap for a good UX, customizable flashcard app that is usable on a phone only. I feel like if Anki released a mobile client for both platforms that mirrors about most of the functionality of the desktop app (especially the setup part) and also improved the UX by a better onboarding, more joyful wording/UI, the gap would be filled. \nUX is not about prettiness, it is about how you feel as a user and how well you can do your task. I can also imagine a default mode for several use cases (e.g., 1 for language learners, 1 for mathematicians, etc.) with less functionality and an expert mode for a lot of customization to also reduce the feeling of being overwhelmed.\n\nLikewise, I know, that there are people saying like “yeah, Anki is not that hard, there are tons of YouTube tutorials\". Yes, there are, but expecting users to watch videos/researching lengthy tutorials until they can get going, is not exactly user-friendly. Many companies spend tons of money on improving their first time experience, as the first impression determines whether you continue using the app or you just uninstall and go further. How often did you read the manual that comes along with the devices you purchase? We also have to assume a beginner mindset here. Imagine that there is a user without any background knowledge or much technical experience—how do they experience the app? \nI feel like Anki is a good application for tech-savvy people, but for many people, it might just feel like it is too complex.", "created_utc": "1664014881.0", "edited": "False", "id": "ipp9wj6", "is_submitter": "False", "link_id": "t3_xm8qf6", "parent_id": "t3_xm8qf6", "score": "34", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "colutea", "body": "No, as this will feel less human. Imagine talking to another person: While they talk, you hear some computer voice but not THEIR voice, their intonation, etc. Even if the tech at some point in a few years will be able to mimic their voice, it will still feel weird.\nAnother issue are delays. E.g. in Japanese, you need to wait until the very end of the sentence to get the context, hence, the translation will be also delayed by at least one sentence. When talking, you speak in a flow, you are not interrupted. You use gestures and mimics. Hence, you have to memorize the gestures, etc. and map them to the translation. That will take some brainpower and might make it exhausting. Plus, the other person has to wait until you listened to the translation.\nI think this will result in some interruptions but won't make it feel as natural as a regular conversation. \nI think this helps tourists or people going to doctors/institutions/... in a foreign country but I doubt it will replace language learning since communication is more than just \"understanding what the other person says\".", "created_utc": "1662933460.0", "edited": "False", "id": "io1ovgr", "is_submitter": "False", "link_id": "t3_xb2li9", "parent_id": "t3_xb2li9", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "colutea", "body": "Ich hätte auch Lust :) aktuell bin ich noch mit dem Umzug beschäftigt, das sollte aber bald besser werden. Bin neu in Hamburg und wohne in Wandsbek", "created_utc": "1662893473.0", "edited": "False", "id": "inyzttx", "is_submitter": "False", "link_id": "t3_x8xl7w", "parent_id": "t3_x8xl7w", "score": "1", "subreddit": "hamburg", "subreddit_id": "t5_2r4mj"}, {"author": "colutea", "body": "I would continue to use those - maybe switch the physical cards to a digital SRS like Anki/Memrise/...\nBesides active studying make sure to get also some input like TV shows, YouTube, ... and read books or magazines", "created_utc": "1662719708.0", "edited": "False", "id": "inpk2gr", "is_submitter": "False", "link_id": "t3_x9cqn2", "parent_id": "t1_inodal5", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "colutea", "body": "I won't focus on the noun genders as you won't fail if you get them wrong. I'd rather get an exam practice book and focus on the output skills like speaking and writing with a tutor/German speaker to correct you since they probably vanished first.\nFor listening and reading, I'd suggest to watch some German Youtube/movies/... and read a German book at your level. With the help of the corrections and input, you'll develop a feeling for the genders without actively studying it.", "created_utc": "1662708143.0", "edited": "False", "id": "inp5zp1", "is_submitter": "False", "link_id": "t3_x9ajpy", "parent_id": "t3_x9ajpy", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "colutea", "body": "I grew up as a child of immigrants and I don't have an accent and so does neither of my friends or acquaintances who have immigrant parents.\n\nInterestingly, I even picked up the regional dialect (Bavarian) which my parents cannot pronounce. Like I roll my Rs like southern Germans and when I moved more to the North, all people immediately recognize my Bavarian pronunciation.", "created_utc": "1662531121.0", "edited": "False", "id": "inf1z6b", "is_submitter": "False", "link_id": "t3_x7l8dg", "parent_id": "t1_ind7rar", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "colutea", "body": "Same for me with Hungarian, I used it fluently (technically as my first language) until the age of 6/7 and then stopped.", "created_utc": "1662488505.0", "edited": "1662489264.0", "id": "incflu0", "is_submitter": "False", "link_id": "t3_x6iy9i", "parent_id": "t1_in8azo4", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "colutea", "body": "Well, you could search for the digital edition online. Other than that, check out your library if they have one or those [fancy, fast scanners](https://www.imageaccess.de/_Scanners/Photos/BE5-V3A_RENDER_DIAGONAL_BOOK_UP.png) that let you scan two pages simultaneously and assimilate them into a PDF", "created_utc": "1662409683.0", "edited": "1662409869.0", "id": "in87yv3", "is_submitter": "False", "link_id": "t3_x6g086", "parent_id": "t3_x6g086", "score": "3", "subreddit": "Ebook", "subreddit_id": "t5_2qjy7"}, {"author": "colutea", "body": "I second this. It took 4 months for me and my boyfriend despite a good income. We wrote to many, many apartments on all sites and got only 3 viewings in total. Fortunately we got lucky for the third one.", "created_utc": "1662061082.0", "edited": "False", "id": "imp8su1", "is_submitter": "False", "link_id": "t3_x3cz0b", "parent_id": "t1_imom1v3", "score": "3", "subreddit": "hamburg", "subreddit_id": "t5_2r4mj"}, {"author": "colutea", "body": "I agree. I found the classes boring after 10 or so.", "created_utc": "1661870622.0", "edited": "False", "id": "ime4nc4", "is_submitter": "False", "link_id": "t3_x17i5x", "parent_id": "t1_imd7t93", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "colutea", "body": "Parler l'anglais si tu voulais practiquer le français. Qu'est-ce tu voulais savoir? Les règles de la société ou...?", "created_utc": "1661552426.0", "edited": "False", "id": "ilxg5z8", "is_submitter": "False", "link_id": "t3_wykiji", "parent_id": "t3_wykiji", "score": "1", "subreddit": "French", "subreddit_id": "t5_2rd5t"}, {"author": "colutea", "body": "Check out the Google UX certificate on Coursera. This should teach you the essentials. \n\nhttps://abookapart.com also has some nice UX books, e.g. Just Enough Research by Erika Hall.\n\nMost of the books look good - however, I would skip the HTML, CSS, Javascript part, also I saw some Arduino books. You certainly won't need Arduino to get a UX job. While programming is a good skill to have, it is not essential and more of a bonus than a requirement. I would focus on gettingla solid understanding of UX and UI and then looking into dev before doing all at once.", "created_utc": "1661337933.0", "edited": "1661338210.0", "id": "ilkss5l", "is_submitter": "False", "link_id": "t3_wwftvx", "parent_id": "t3_wwftvx", "score": "1", "subreddit": "userexperience", "subreddit_id": "t5_2qj2z"}, {"author": "colutea", "body": "In Germany, we have a law where the prices of books are fixed. The same book in the same edition costs the same whether you shop at Amazon or the small bookshop around the corner. For imported books it's different.\nStill, some small bookshops are closing because ordering at Amazon is still more convenient for many people.", "created_utc": "1661284166.0", "edited": "False", "id": "ilhyrpn", "is_submitter": "False", "link_id": "t3_wvmysu", "parent_id": "t3_wvmysu", "score": "1", "subreddit": "books", "subreddit_id": "t5_2qh4i"}, {"author": "colutea", "body": "People don't care - I live in Europe. Nearly everybody speaks English plus their Native language(s).", "created_utc": "1660924799.0", "edited": "False", "id": "iky6kmg", "is_submitter": "False", "link_id": "t3_ws1ocp", "parent_id": "t3_ws1ocp", "score": "4", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "colutea", "body": "If you continue to use it for your job, you'll naturally reach C1. Try to find more challenging material as well, for example academic articles on various topics, documentaries on more complicated topics, etc.\nAnd also think about writing, try writing some in-depth essays on society, etc. You can use sites like journaly to get corrections", "created_utc": "1660644905.0", "edited": "False", "id": "iki1pug", "is_submitter": "False", "link_id": "t3_wp4dyk", "parent_id": "t1_ikerzmr", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "colutea", "body": "In German it's \"Mein Beileid\" so very similar", "created_utc": "1660302577.0", "edited": "False", "id": "ijzapzt", "is_submitter": "False", "link_id": "t3_wmfxf5", "parent_id": "t1_ijyz2j4", "score": "10", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "colutea", "body": "I was born in Germany and grew up here but my parents are both immigrants from Romania (Transylvania). My mom spoke her native language (Hungarian) with me and my father his (German). As my mom was home all the time and my dad not, my Hungarian exposure was pretty high. \nIn my first kindergarten I had both, German and Hungarian speaking friends as the first city I lived in was quite diverse. When my parents moved to the countryside, the people there were quite opposed to foreigners. \nIn school, I had a classmate whose parents were Russian and he faced the same thing.\n\nI am now in my mid twenties - when I grew up, these were common cases in the countryside (the area I grew up with consisted mainly of people who lived there for many generations). I don't know about it now, I heard that now it is encouraged to raise the kids bilingual. However, it is no secret that there are some Germans that are opposed to foreigners, especially if they \"look different\" from what my colleagues who moved here told me. So I would assume the same issue still exists - but maybe it got better.", "created_utc": "1660203482.0", "edited": "False", "id": "ijtweaj", "is_submitter": "False", "link_id": "t3_wkvpya", "parent_id": "t1_ijr25mc", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "colutea", "body": "I used Hungarian the first 6-7 years of my life and lost it. My mom stopped talking to me in Hungarian as the teachers said it might screw up the country language. I only remember random songs and greetings now.\nI know I was fluent as my parents have video tapes of me speaking it fluently. I could even read and write in this language (at least at a child level).\n\nIf you don't use it, you'll lose it. I can still pronounce the words well and I can tell if someone is not a native speaker but that's it. I might have an advantage though when relearning it - at least for the pronunciation.", "created_utc": "1660153917.0", "edited": "False", "id": "ijqx3s4", "is_submitter": "False", "link_id": "t3_wkvpya", "parent_id": "t1_ijpxpye", "score": "14", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "colutea", "body": "Listening is a passive skills whereas writing is an active one.\nPassive skills are easier to develop since you need to have \"only\" an understanding.\nFor active skills, you need to first understand and then also use that understanding to do it actively on your own.\nFor example, only because you can read and understand master pieces in literature, there is a long way to be able to write them on your own.\nWriting well takes a lot of time to master, which is not only grammar and vocabulary and their correct usage but also obeying rules, following a consistent and appropriate style and building a good structure. For example, writing a novel is much different from writing a scientific paper or a business letter. It ultimately depends on what you need or want to write.", "created_utc": "1660040846.0", "edited": "False", "id": "ijk939x", "is_submitter": "False", "link_id": "t3_wjw21z", "parent_id": "t3_wjw21z", "score": "4", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "colutea", "body": "I did not study English actively from B2 onwards. However, I started university where I had many English lectures and I got a job at an English speaking company. So I used English everyday, sometimes even more often than my Native language.\nGetting to C1/C2 happened naturally due to the massive amount of exposure and active usage.", "created_utc": "1659737398.0", "edited": "False", "id": "ij4208i", "is_submitter": "False", "link_id": "t3_wgp4uz", "parent_id": "t3_wgp4uz", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "colutea", "body": "A Japanese friend of mine got to B2 in less than a year in German. However, she could not speak any language besides Japanese and moved to a German host family. Here, she went to the local language school each day for 6 hours. The host family were Germans without any knowledge in Japanese. \nSo she basically had no chance but to use German A LOT to get around", "created_utc": "1659547887.0", "edited": "False", "id": "iit3dqf", "is_submitter": "False", "link_id": "t3_wf9isb", "parent_id": "t3_wf9isb", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "colutea", "body": "I have my Poke 3 for more than two years and no issues at all. I charge it only once a week though, so maybe I am not the heaviest user", "created_utc": "1659284646.0", "edited": "False", "id": "iiebuea", "is_submitter": "False", "link_id": "t3_w60b66", "parent_id": "t1_ihb2e0x", "score": "2", "subreddit": "ereader", "subreddit_id": "t5_2qwmn"}, {"author": "colutea", "body": "We just use tragen.\nIch trage einen Hut.\nIch trage eine Brille.\nIch trage eine Bluse.\nIch trage eine Hose.\nIch trage Schuhe.\nIch trage eine Tasche.\nIch trage einen Sack (this can mean that you wear a sack or that you are carrying one - depending on the context 💀).\n\nCarry and wear are the same word, so... have fun", "created_utc": "1658703475.0", "edited": "False", "id": "ihia2a4", "is_submitter": "False", "link_id": "t3_w74156", "parent_id": "t1_ihhxt4k", "score": "7", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "colutea", "body": "I have it with Hungarian. I can read anything and pronounce it properly as it used to be my native language, but I forgot the meaning of the words throughout the decades", "created_utc": "1658485111.0", "edited": "False", "id": "ih66911", "is_submitter": "False", "link_id": "t3_w4wetc", "parent_id": "t3_w4wetc", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "colutea", "body": "BGB. Hat mir privat viel geholfen.", "created_utc": "1658249226.0", "edited": "False", "id": "igsre2l", "is_submitter": "False", "link_id": "t3_w2p1cf", "parent_id": "t3_w2p1cf", "score": "1", "subreddit": "Finanzen", "subreddit_id": "t5_35m5e"}, {"author": "colutea", "body": "I use \"Entschulding\"/\"Tschuldigung\".\nI moved to eastern germany, here I hear \"Tut mir leid\" more often. I personally don't use it though", "created_utc": "1658248567.0", "edited": "False", "id": "igsplnx", "is_submitter": "False", "link_id": "t3_w2qfjk", "parent_id": "t1_igsfohg", "score": "11", "subreddit": "German", "subreddit_id": "t5_2qq51"}, {"author": "colutea", "body": "Use Klo when you talk with friends, use WC when you are in a more formal situation", "created_utc": "1658248323.0", "edited": "False", "id": "igsoyck", "is_submitter": "False", "link_id": "t3_w2qfjk", "parent_id": "t1_igsatlc", "score": "26", "subreddit": "German", "subreddit_id": "t5_2qq51"}, {"author": "colutea", "body": "There is \"Les 7 vies de Léa\" for example", "created_utc": "1658128092.0", "edited": "False", "id": "igm5dou", "is_submitter": "False", "link_id": "t3_w1h5ys", "parent_id": "t3_w1h5ys", "score": "1", "subreddit": "learnfrench", "subreddit_id": "t5_2sucz"}, {"author": "colutea", "body": "You can play around with the app optimization settings on Boox and then it'll look just as crisp", "created_utc": "1658047929.0", "edited": "False", "id": "ighxw1q", "is_submitter": "False", "link_id": "t3_w0q21o", "parent_id": "t1_igfycd9", "score": "1", "subreddit": "ereader", "subreddit_id": "t5_2qwmn"}, {"author": "colutea", "body": "Try this site: https://www.francaisfacile.com\nCompleteiy free, has lessons and exercises. Yes, it is old but the content is excellent", "created_utc": "1658013168.0", "edited": "False", "id": "iggc8to", "is_submitter": "False", "link_id": "t3_w0hidp", "parent_id": "t3_w0hidp", "score": "5", "subreddit": "learnfrench", "subreddit_id": "t5_2sucz"}, {"author": "colutea", "body": "I also got lucky ih Wandsbek - after 4 months. I was repeatedly declined in other areas near the center even though I earn well - but for the reason that my contract has a probation period of 6 months and there were other applicants without that.\n\nAfter some months, you'll all your \"ideal area\" thoughts and just take what you get. The good thing is, the rent is cheaper", "created_utc": "1657998822.0", "edited": "False", "id": "igfg9zf", "is_submitter": "False", "link_id": "t3_vypsec", "parent_id": "t1_ig45dwa", "score": "1", "subreddit": "hamburg", "subreddit_id": "t5_2r4mj"}, {"author": "colutea", "body": "My university made a reference document for us they created themselves. So no textbook.", "created_utc": "1657972200.0", "edited": "False", "id": "igdunc6", "is_submitter": "False", "link_id": "t3_w09cv7", "parent_id": "t1_igdq2q8", "score": "1", "subreddit": "LaTeX", "subreddit_id": "t5_2qhbn"}, {"author": "colutea", "body": "In the beginning of my studies, I had a mandatory scientific writing class where they taught us Latex.", "created_utc": "1657966371.0", "edited": "False", "id": "igdmhec", "is_submitter": "False", "link_id": "t3_w09cv7", "parent_id": "t3_w09cv7", "score": "3", "subreddit": "LaTeX", "subreddit_id": "t5_2qhbn"}, {"author": "colutea", "body": "Because \"almost exlusively\" suggests that Schmerz in singular form is rarely used which is not the case. The singular form is a frequent use case", "created_utc": "1657740071.0", "edited": "1657740466.0", "id": "ig13pzm", "is_submitter": "False", "link_id": "t3_vxilna", "parent_id": "t1_ifzl5t5", "score": "3", "subreddit": "German", "subreddit_id": "t5_2qq51"}, {"author": "colutea", "body": "Same. I also use Zahnweh a lot. Or generally everything with ~weh :D", "created_utc": "1657708016.0", "edited": "False", "id": "ifz2zif", "is_submitter": "False", "link_id": "t3_vxilna", "parent_id": "t1_ify93id", "score": "3", "subreddit": "German", "subreddit_id": "t5_2qq51"}, {"author": "colutea", "body": "Almost exclusively (plural) is not really correct.\n\"Schmerztherapie\"/\"Schmerz wird über Reize von Nozizeptoren des peripheren Nervensystems ausgelöst und im zentralen Nervensystem verarbeitet, ausgewertet und interpretiert.\"/....\n\nFor example: Check out this medicine article: https://www.gelbe-liste.de/schmerztherapie/schmerzen", "created_utc": "1657707895.0", "edited": "False", "id": "ifz2trq", "is_submitter": "False", "link_id": "t3_vxilna", "parent_id": "t1_ifw4e5c", "score": "-2", "subreddit": "German", "subreddit_id": "t5_2qq51"}, {"author": "colutea", "body": "In German, when using plural forms, the gender does not matter in these cases.\n\nIch mag keine Männer -> I don't like men\n\nIch mag keinen Mann -> I don't like a man\n\nIch mag keine Frauen -> I don't like women\n\nIch mag keine Frau -> I don't like a woman\n\nAs you can see, for keinen/keine is only relevant for singular.\n\nGreetings, a native speaker", "created_utc": "1657707471.0", "edited": "False", "id": "ifz2995", "is_submitter": "False", "link_id": "t3_vxilna", "parent_id": "t3_vxilna", "score": "1", "subreddit": "German", "subreddit_id": "t5_2qq51"}, {"author": "colutea", "body": "Yeah literally the first question I get from anyone who is not learning languages as a hobby: So... what do you with Japanese? Will you work and live in Japan?\n\nShortly after: Why not Chinese? Or Spanish?", "created_utc": "1657555393.0", "edited": "False", "id": "ifqj7xp", "is_submitter": "False", "link_id": "t3_vw1j93", "parent_id": "t1_ifnih36", "score": "2", "subreddit": "LearnJapanese", "subreddit_id": "t5_2qyls"}, {"author": "colutea", "body": "Do you read manga in Japanese or a translation? \nIf you read in Japanese, go with an Android eReader as you can access different book stores and Japanese book seller's DRM (except Rakuten) are hard to crack so you are stuck with their apps.\nIf you read translations, you can use any non-Android eReader as they usually all support sideloading.\n\nNevertheless, get a big screen, at least 8\"", "created_utc": "1657475239.0", "edited": "False", "id": "ifmcqm1", "is_submitter": "False", "link_id": "t3_vvpxrd", "parent_id": "t3_vvpxrd", "score": "2", "subreddit": "ereader", "subreddit_id": "t5_2qwmn"}, {"author": "colutea", "body": "Sideloading is not something manufacturers want to prevent - it's a feature not a backdoor. So it's very unlikely manufacturers will stop it.\nDo you only read ePub or do you also read any other format? Do you have any other needs that only Android can provide?\nI've been using ereaders for almost a decade and there weren't any issues with sideloading.", "created_utc": "1657407190.0", "edited": "False", "id": "ifj2mnb", "is_submitter": "False", "link_id": "t3_vv99gk", "parent_id": "t3_vv99gk", "score": "2", "subreddit": "ereader", "subreddit_id": "t5_2qwmn"}, {"author": "colutea", "body": "I would recommend Overleaf to everybody that does not need Git. For complex projects, I prefer a local setup with Git to be able to restore any particular point in the version history. Plus, I can use it without the Internet which is important when being on longer train rides", "created_utc": "1657383107.0", "edited": "False", "id": "ifhky1q", "is_submitter": "False", "link_id": "t3_vuqad3", "parent_id": "t1_ifhhdgo", "score": "1", "subreddit": "LaTeX", "subreddit_id": "t5_2qhbn"}, {"author": "colutea", "body": "I used IntelliJ IDE for Latex some years ago, it worked well. However, I prefer VSCode now together with LatexWorkshop. \nI also tried Texpad for Mac but the compilation was quite slow", "created_utc": "1657369615.0", "edited": "False", "id": "ifgt3cy", "is_submitter": "False", "link_id": "t3_vuqad3", "parent_id": "t1_ifgeldv", "score": "1", "subreddit": "LaTeX", "subreddit_id": "t5_2qhbn"}, {"author": "colutea", "body": "The Poke 3 is slightly over your price limit ($189) but I can only recommend it as it is very flexible due to Android and crosses all your boxes. Let me know if you have any questions, I have it for already almost 2 years.\nThe battery for weeks is not a problem for me as I only read 2-3 times a week so I charge it every 3-4 weeks or so but idk about power users.", "created_utc": "1657275659.0", "edited": "False", "id": "ifbrm44", "is_submitter": "False", "link_id": "t3_vu250x", "parent_id": "t3_vu250x", "score": "3", "subreddit": "ereader", "subreddit_id": "t5_2qwmn"}, {"author": "colutea", "body": "Yes, just create the file, save and recompile", "created_utc": "1656925619.0", "edited": "False", "id": "iesrbee", "is_submitter": "True", "link_id": "t3_vhf1gm", "parent_id": "t1_iesmdbn", "score": "1", "subreddit": "LaTeX", "subreddit_id": "t5_2qhbn"}, {"author": "colutea", "body": "Aber muss man nicht den Kredit in Raten zurückzahlen? Oder muss man das nicht, weil die Bank quasi dein Depot hat", "created_utc": "1656767915.0", "edited": "False", "id": "iekoize", "is_submitter": "False", "link_id": "t3_vpl5pm", "parent_id": "t1_iek6y8r", "score": "1", "subreddit": "Aktien", "subreddit_id": "t5_313tk"}, {"author": "colutea", "body": "I suggest using Miro or Figjam for that. I always present designs in virtual whiteboards and divide the designs into scenarios.\nPeople can easily comment and you can use sticky notes, shapes, scribbles, etc. to highlight certain parts.\nIt got way more interactive that way and it became easier to understand for everyone", "created_utc": "1656610682.0", "edited": "False", "id": "iecenm9", "is_submitter": "False", "link_id": "t3_vnzhpr", "parent_id": "t3_vnzhpr", "score": "2", "subreddit": "userexperience", "subreddit_id": "t5_2qj2z"}, {"author": "colutea", "body": "University got me into the IT industry - from working class to upper middle class. I have no student loans since I live in Germany and working on the side was enough to cover my costs as the fees are very low.\n\nMy parents are migrants and didn't go to uni themselves, have simple jobs but even they supported me by taking me to the library regularly as a child even though they never read anything. They always said, no one can take away your knowledge  and I should learn for myself, not for school.", "created_utc": "1656233980.0", "edited": "False", "id": "idsc7hr", "is_submitter": "False", "link_id": "t3_vkqbhf", "parent_id": "t3_vkqbhf", "score": "1", "subreddit": "stocks", "subreddit_id": "t5_2qjfk"}, {"author": "colutea", "body": "Learning is not about the speed. If you continue like this, you will get better.\nLearning Kanji and bunch of vocab might help you to fast forward the process a bit but still, besides just spending more time each day, there is no secret formula that will make you fluent overnight", "created_utc": "1656196422.0", "edited": "False", "id": "idqmqam", "is_submitter": "False", "link_id": "t3_vknnuy", "parent_id": "t3_vknnuy", "score": "4", "subreddit": "Refold", "subreddit_id": "t5_3azein"}, {"author": "colutea", "body": "Jup, haben das seit 4 Monaten abonniert, weder großartige extra Besichtigungen bekommen oder sonst irgendwelchen Vorteile gehabt. Wir hatten exakt keine Besichtigung und kein Glück bei der Wohnung trotz hohem Budget und gutem Einkommen. Läuft in Hamburg.\nDas einzige was man sieht ist, dass noch 100 weitere Leute die Wohnung wollen.", "created_utc": "1656097998.0", "edited": "False", "id": "idlhdns", "is_submitter": "False", "link_id": "t3_v5y03s", "parent_id": "t1_ibcmncf", "score": "2", "subreddit": "hamburg", "subreddit_id": "t5_2r4mj"}, {"author": "colutea", "body": "I have the iPhone 11 and I still have many apps going into endless loops due to Face ID not recognizing me with a mask", "created_utc": "1656021085.0", "edited": "False", "id": "idhg2h0", "is_submitter": "False", "link_id": "t3_vj21ql", "parent_id": "t1_idgjrmw", "score": "37", "subreddit": "iphone", "subreddit_id": "t5_2qh2b"}, {"author": "colutea", "body": "I use the LTex plugin for VSCode https://marketplace.visualstudio.com/items?itemName=valentjn.vscode-ltex\nFor overleaf, you can use language tool. It supports Latex as well", "created_utc": "1656019098.0", "edited": "False", "id": "idhbhoq", "is_submitter": "False", "link_id": "t3_vj6h0z", "parent_id": "t3_vj6h0z", "score": "6", "subreddit": "LaTeX", "subreddit_id": "t5_2qhbn"}, {"author": "colutea", "body": "All of the models have an equal build quality - so which you choose depends on your preferred screen size and whether you want color, etc", "created_utc": "1655930388.0", "edited": "1655968656.0", "id": "idcjzqu", "is_submitter": "False", "link_id": "t3_vial9l", "parent_id": "t1_idbxvy9", "score": "3", "subreddit": "ereader", "subreddit_id": "t5_2qwmn"}, {"author": "colutea", "body": "I would get a large eReader for manga, at least 8\".\nE.g. Onyx Boox has a few, Kobo also. Which one you choose depends on the budget.\nI would recommend the Boox more as it runs Android so it is more flexible with sources and you can use apps like Tachiyomi", "created_utc": "1655919602.0", "edited": "False", "id": "idbvete", "is_submitter": "False", "link_id": "t3_vial9l", "parent_id": "t3_vial9l", "score": "9", "subreddit": "ereader", "subreddit_id": "t5_2qwmn"}, {"author": "colutea", "body": "Or you can get an iPad. A bit more expensive but you get software updates for at least half a decade", "created_utc": "1655912965.0", "edited": "False", "id": "idbfffr", "is_submitter": "False", "link_id": "t3_vi2o3r", "parent_id": "t1_idav9cp", "score": "3", "subreddit": "ereader", "subreddit_id": "t5_2qwmn"}, {"author": "colutea", "body": "I set my fonts to 32 pt sometimes, no problem with a 6\" screen", "created_utc": "1655912847.0", "edited": "False", "id": "idbf5bs", "is_submitter": "False", "link_id": "t3_vhw6h4", "parent_id": "t1_id9xjgo", "score": "1", "subreddit": "ereader", "subreddit_id": "t5_2qwmn"}, {"author": "colutea", "body": "I fixed it myself. Here is the fix:\n\nDon't touch the settings file, it is not needed.\n\nCreate a new file called .latexmkrc\n\nAdd the following content: [https://pastebin.com/3FTA1V5L](https://pastebin.com/3FTA1V5L)\n\nI found the solution here:\n\n[https://tex.stackexchange.com/questions/1226/how-to-make-latexmk-use-makeglossaries/541990#541990](https://tex.stackexchange.com/questions/1226/how-to-make-latexmk-use-makeglossaries/541990#541990)", "created_utc": "1655839808.0", "edited": "1655839994.0", "id": "id7tnd7", "is_submitter": "True", "link_id": "t3_vhf1gm", "parent_id": "t3_vhf1gm", "score": "1", "subreddit": "LaTeX", "subreddit_id": "t5_2qhbn"}, {"author": "colutea", "body": "You can try memrise besides Anki. However, you can only create your own flashcards on the website. But studying works on the phone as well.\nFor Japanese, Renshuu is also nice but the UX is worse than memrise", "created_utc": "1655810644.0", "edited": "False", "id": "id64han", "is_submitter": "False", "link_id": "t3_vh0i1q", "parent_id": "t3_vh0i1q", "score": "2", "subreddit": "LearnJapanese", "subreddit_id": "t5_2qyls"}, {"author": "colutea", "body": "You can use the tabularX package", "created_utc": "1655665363.0", "edited": "False", "id": "icz33av", "is_submitter": "False", "link_id": "t3_vfw67q", "parent_id": "t3_vfw67q", "score": "1", "subreddit": "LaTeX", "subreddit_id": "t5_2qhbn"}, {"author": "colutea", "body": "Step 1: Get an overview of your income and spendings. Use an app or an excel sheet\n\nStep 2: Cut costs whereever possible (less restaurants, buy used stuff, don't take the car that often, compare prices,...)\n\nStep 3: Pay off the debt as fast as possible without getting more debt. Don't start with loans for loans.\n\nStep 4: Build liquidity (2-3x your monthly income should be available to you without needing to sell stocks, etc.)\n\nStep 5: Start to invest. Don't buy and sell, buy and sell (trade) but rather buy regularly and hold (time in the market > timing the market). Don't try to get rich fast and just invest regularly. Time is your best friend here.", "created_utc": "1655665252.0", "edited": "False", "id": "icz2uhb", "is_submitter": "False", "link_id": "t3_vfkr1b", "parent_id": "t3_vfkr1b", "score": "1", "subreddit": "personalfinance", "subreddit_id": "t5_2qstm"}, {"author": "colutea", "body": "But that only works for people who are privileged enough to get into positions that can be done remotely. There are still many, many people relying on manual work without computers or anything fancy.\n\nIf you are in your 20s/30s, sure, but when you are in your late 50s, you didn't get a degree or even finished school, job hopping is very hard if not impossible.\nFor that you would need to do all education, qualify yourself and for some people, they don't have the capacity. If you work hard all day, then at the end of the day, you just cannot do anything after but sleep.\nAnd after a certain age, without the experience, there is barely anyone who would employ you.\n\nIn that case, the only advice is to cut costs so that your income is lower than what you spend. That is easier said than done, though.\nThere is always sth that can get lower – save electricity, don't go by car, use the bike / get a smaller car, use less water, think twice about subscriptions, etc.", "created_utc": "1655664575.0", "edited": "1655664763.0", "id": "icz1cup", "is_submitter": "False", "link_id": "t3_vfkr1b", "parent_id": "t1_icxwx0s", "score": "5", "subreddit": "personalfinance", "subreddit_id": "t5_2qstm"}, {"author": "colutea", "body": "A dictionary of Japanese grammar. There is no better resource. https://www.tofugu.com/reviews/dictionary-of-basic-japanese-grammar/", "created_utc": "1655569455.0", "edited": "False", "id": "icuhant", "is_submitter": "False", "link_id": "t3_vf3lhd", "parent_id": "t3_vf3lhd", "score": "5", "subreddit": "Refold", "subreddit_id": "t5_3azein"}, {"author": "colutea", "body": "Was noch wichtig ist, mit der Uni hält man sich die Möglichkeit einer Promotion offen. Das geht an der FH idR nicht. \nPromotion muss man auch nicht sofort machen, gibr auch Industriepromotionen usw. Aber wenn man sich das im entferntesten vorstellen kann, das irgendwann machen zu wollen, sollte man an die Uni gehen. (Und dann am besten beim Master an ner guten gewesen sein)", "created_utc": "1655569143.0", "edited": "False", "id": "icugmyj", "is_submitter": "False", "link_id": "t3_vf3e4c", "parent_id": "t1_ictut9g", "score": "1", "subreddit": "informatik", "subreddit_id": "t5_38yld"}, {"author": "colutea", "body": "Wenn du promovieren willst, auf jeden Fall. Da ist die Wahrscheinlichkeit ne 100%-Stelle zu bekommen deutlich höher, wenn du an ner Uni mit Exzellenz-Cluster in deinem Fachbereich studierst, einfach weil das Geld da ist.\nIch kenn jetzt nur Leute, die an \"exzellenten\" Unis in Info promovieren, die hatten alle ne 100%-Stelle.\nNe Freundin promoviert in nem anderen Fachbereich an ner Uni, die kein Exzellenz-Cluster hat und ihr wurde ne Promotion mit 20% angeboten, weil der Lehrstuhl kein Geld hat.\n\nSolche Unis sind meistens bei den besseren Fachkonferenzen präsent, die Forschung ist dementsprechend besser.\nBessere Forschung heißt aber nicht zwingend bessere Lehre, weil ob sich ein Dozent Mühe gibt, das gut aufzubereiten, hängt an ihm selbst. Und da gibts Leute, die machen 1a Forschung, fokussieren sich da sehr drauf und bei der Lehre lesen die nur alles runter, weils sein muss. \n\nAlso an ner exzellenten Uni kanns gut sein, dass dein Prof gute Kontakte hat und die nutzt, sodass du auch Gatsvorträge hörst, zu Themen, die du sonst nur schwer mitbekommst. Bei uns hatte einer zB Forscher aus USA und Südkorea eingeladen im Master, das war sehr spannend. \n\nTendenziell merkt man die Unterschiede eher im Master, wenn es forschungsnah wird.\n\nIm Bachelor gibts da nicht großartige Unterschiede, zumindest hab ich keine festgestellt, als ich mich mit Leuten aus anderen Unis unterhalten hab.\n\n----\nWenn du nicht in die Forschung willst, ist das ziemlich egal. Man kommt selbst ohne Uni-Abschluss in sehr gute Positionen, wenn man kompetent ist und das durch lange Erfahrung nachweisen kann (ist schwieriger, aber es gibt so Kandidaten, die seitdem sie 16 sind selbstständig sind, an vielen Projekten mitgewirkt haben, programmieren im Kindesalter angefangen haben, usw). \n\nMich haben Recruiter (und in Bewerbungsgesprächen) auch bislang immer auf die Erfahrung, die ich als Werkstudent gemacht hab angesprochen, anstatt auf meinen Uni-Abschluss. Der ist zwar sehr gut, das Forschungsthema vom Master ist superrelevant, aber gefühlt hat das trotzdem keinen in der Praxis großartig interessiert.", "created_utc": "1655568954.0", "edited": "1655569526.0", "id": "icug8t2", "is_submitter": "False", "link_id": "t3_vf3e4c", "parent_id": "t3_vf3e4c", "score": "3", "subreddit": "informatik", "subreddit_id": "t5_38yld"}, {"author": "colutea", "body": "Actually both.", "created_utc": "1655450404.0", "edited": "False", "id": "icoluov", "is_submitter": "False", "link_id": "t3_v9g6u9", "parent_id": "t1_icnt191", "score": "3", "subreddit": "lingodeer", "subreddit_id": "t5_3ou01"}, {"author": "colutea", "body": "You can use \\caption*{your comment here}", "created_utc": "1655286099.0", "edited": "False", "id": "icfptm5", "is_submitter": "False", "link_id": "t3_vcqn2d", "parent_id": "t3_vcqn2d", "score": "1", "subreddit": "LaTeX", "subreddit_id": "t5_2qhbn"}, {"author": "colutea", "body": "perfect, this works now. Thanks a lot - all captions look as expected now. Then it seems like that was the issue previously that both things somehow conflicted.", "created_utc": "1655232951.0", "edited": "False", "id": "icd2e82", "is_submitter": "True", "link_id": "t3_vc4mbn", "parent_id": "t1_icd1sai", "score": "1", "subreddit": "LaTeX", "subreddit_id": "t5_2qhbn"}, {"author": "colutea", "body": "The issue is the following .These commands above format the captions to this (expected behavior):[https://ibb.co/Sr4RRBn](https://ibb.co/Sr4RRBn)Once I enable the caption package though, the formatting changes to this as the caption package somehow overwrites these commands: [https://ibb.co/kKycR2r](https://ibb.co/kKycR2r)It doesn't matter if it's a figure or table, the only reason why I need the caption package is for long tables so that I can use \\\\ContinuedFloat.\n\nHere is the [paper template](https://www.overleaf.com/latex/templates/hawaii-international-conference-on-system-sciences-hicss-final-formatting-specifications/zbrwyxgpvxyk) as a minimum example just with the sample figure where the issue occurs.  I cannot paste it here as it has some custom .sty file where some stuff is done and it would be way too long.\n\nIf I remove `\\usepackage{caption}`  before \\\\begin{document }it looks as expected, but if I want to use it, the formatting is broken. I basically want to find a way to keep the formatting by the template and still use the functionality provided by the caption package.", "created_utc": "1655232021.0", "edited": "1655233100.0", "id": "icd050t", "is_submitter": "True", "link_id": "t3_vc4mbn", "parent_id": "t1_icce4sl", "score": "1", "subreddit": "LaTeX", "subreddit_id": "t5_2qhbn"}, {"author": "colutea", "body": "LingoDeer even has a fluency track up to N3 content with short stories and dialogs", "created_utc": "1655116725.0", "edited": "False", "id": "ic6t7a4", "is_submitter": "False", "link_id": "t3_vb2how", "parent_id": "t1_ic62qnp", "score": "3", "subreddit": "LearnJapanese", "subreddit_id": "t5_2qyls"}, {"author": "colutea", "body": "There are applications like readlang and LingQ that make looking up words very easy. \nI had a hard time with Japanese books too but I imported them into those applications and just read and look up. With time, the lookups become less and less.\nBy that method, I was able to read and understand a book that discusses differences in the north and south korean culture in comparison to the Japanese culture on the example of a K drama.\n\nTo become better in reading, you have to read.\nI was tired of finding something at my level, as they were either too boring or too easy, so I just thought, whatever and just bought the books I was interested in anyways.\nThat was after 4 years of learning Japanese. After that time span, I couldn't see any more graded readers 😅", "created_utc": "1655042556.0", "edited": "1655042934.0", "id": "ic370ei", "is_submitter": "False", "link_id": "t3_vak95o", "parent_id": "t3_vak95o", "score": "12", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "colutea", "body": "Noch einen Tipp den ich geben kann.\nBei edX gibts kostenlose Kurse zu allen o.g. Themen: https://www.edx.org/search \nZ.B. Data Science, Machine Learning, UX, etc.\n\nDa würd ich mal jeweils nen Entry Kurs machen und gucken, was am meisten Spaß macht.\nBei einigen Kursen, z.B. hier\n\nhttps://www.edx.org/course/data-analytics-for-everyone?index=product&queryID=207e239bde99276155dbaa764025275a&position=4\n\nhttps://www.edx.org/course/introduction-to-user-experience-3?index=product&queryID=49d02f5ac4f816d18bf44b55f7face3e&position=1\n\nwird entweder auf mögliche Berufe oder auf konkrete Berufe und Leuten mit denen man zusammenarbeitet eingegangen.\n\nBei Coursera gibts das auch, inkl Rollenbilder:\n https://www.coursera.org/learn/foundations-data?specialization=google-data-analytics\n\nhttps://www.coursera.org/learn/foundations-user-experience-design?specialization=google-ux-design\n\nDas sind zum Teil Studieninhalte, aber mit deutlich stärkeren Fokus auf Praxis. was vllt ganz gut ist, um sich nen Beruf vorzustellen", "created_utc": "1655026819.0", "edited": "1655027107.0", "id": "ic2kjy2", "is_submitter": "False", "link_id": "t3_v9wgb6", "parent_id": "t3_v9wgb6", "score": "2", "subreddit": "informatik", "subreddit_id": "t5_38yld"}, {"author": "colutea", "body": "Same, I use my Boox for Japanese and French.\nBut regarding the complicated part, if you can use a smartphone, you can use a Boox", "created_utc": "1654977971.0", "edited": "False", "id": "ic0dizn", "is_submitter": "False", "link_id": "t3_v9fdzp", "parent_id": "t1_ibxqdhb", "score": "3", "subreddit": "ereader", "subreddit_id": "t5_2qwmn"}, {"author": "colutea", "body": "Seminare? Hausarbeiten? Vorbereitung auf die Prüfungen?\nBei uns hatte fast jede Vorlesung so ca. 5-10 Paper und die wurden auch in der Prüfung thematisiert.\n\nich hatte auch Professoren, die wollten, dass man eine Hausarbeit abgibt, bevor man die Prüfung machen konnte.", "created_utc": "1654975777.0", "edited": "1654976250.0", "id": "ic08xx3", "is_submitter": "False", "link_id": "t3_v9wgb6", "parent_id": "t1_ic07bzf", "score": "1", "subreddit": "informatik", "subreddit_id": "t5_38yld"}, {"author": "colutea", "body": "JLPT N3 and up content, like short articles", "created_utc": "1654971564.0", "edited": "False", "id": "ic002dc", "is_submitter": "False", "link_id": "t3_v9g6u9", "parent_id": "t3_v9g6u9", "score": "5", "subreddit": "lingodeer", "subreddit_id": "t5_3ou01"}, {"author": "colutea", "body": "I can second this. The app is a bit annoying too as it is slow but the headphones are good. I bought a dongle, now it's good", "created_utc": "1654971525.0", "edited": "False", "id": "ibzzzbp", "is_submitter": "False", "link_id": "t3_v9ljaq", "parent_id": "t1_ibz21py", "score": "1", "subreddit": "sony", "subreddit_id": "t5_2qr0o"}, {"author": "colutea", "body": "Je nach Uni sind die Module, die du nicht magst, wie Rechnernetze und Datenbanken trotzdem Pflicht. An einigen Unis sind die Bindestrich-Studiengänge nast gleich zu den reinen Info-Studiengängen, außer dass da nur noch 1-2 Module mehr oder weniger sind.\nDie größte Spezialisierungsphase findet meistens im Master statt.\nMit reiner Informatik als Bachelor und spezialisierter Studiengang im Master hälst du dir die meisten Möglichkeiten offen.\n\nSowohl HCI als auch Machine Learning (KI) wird auch in reinen Info-Studiengängen thematisiert. So stark in die Tiefe gehts im Bachelor eh nicht. Dann kannst du auch gut rausfinden, was dir Spaß macht und das dann im Master vertiefen", "created_utc": "1654968923.0", "edited": "1654969137.0", "id": "ibzufp3", "is_submitter": "False", "link_id": "t3_v9wgb6", "parent_id": "t3_v9wgb6", "score": "3", "subreddit": "informatik", "subreddit_id": "t5_38yld"}, {"author": "colutea", "body": "HCI kann auch komplett ohne stark visuelles gehen und stark UX lastig sein, d.h. Unternehmensstrategie/Logik, User Flows, etc. (Grafikdesign sollte trotzdem verstehen).\nWenn man sich auf UX fokussiert gibts gute Jobs, ist gut bezahlt. Und das kann man überall machen, wo Menschen mit Systemen interagieren. \n\nAlso du kannst zu ner Auto-Firma gehen und da das Auto-Interface entwerfen, Packstationen oder zu ner App-Entwicklungs-Firma oder Beratungen. Von FAANG bis Startups.\n\nIst halt cool, weil du selbst die Software und das Unternehmen sehr stark beeinflussen kannst.\nDas Problem ist, viel zu viele Unternehmen wissen nicht was das ist und denken, du machst einfach nur alles hübsch. In solche kann man hingehen, wenn man Berufserfahrung hat bzw. Consulting macht und da Change Management betreiben kann, aber als Berufseinsteiger sollte man da aufpassen.\n\nAber das Feld bietet viel mehr als \"nur Designer, der den visuellen Ablauf designed\". Da es nicht nur visuell ist, sondern auch Business Logic betrifft und das Geschäftsmodell. Um darin weit zu kommen, ist wirtschaftliches Interesse essentiell. \n\nSpezialisieren kann man sich in X Richtungen, entweder Software oder auch Maschinen (Roboter, etc.). Genauso wie ich meinte visuell oder eher strategisch. Und da drunter gibts auch nochmal Nischen (User Research, Design Systeme, Service design, ...)\nDa muss man schauen, was die Uni anbietet. Manchmal gibts HCI auch unter dem Deckmantel Medieninformatik. Und gerne schreiben die Unternehmen als Studiumvoraussetzung auch einfach nur \"Informatik\".\n\nMögliche Job-Titel:\n- UX Designer\n- UI Designer\n- UX/UI Desisgner\n- UX Architect\n- Product Designer\n- Service Designer\n- Interaction Designer\n- UX Researcher\n- UX Engineer\n- Information Architect\n- UX Copywriter\n- Content Strategist\n...\n\nBeim Beispiel SAP find ich unter ner schneller Suche alleine 3396 Stellen unter der Kennzeichnung UX bzw. Product Design.\n\nEine Spezialisierung in dem Bereich, die ich anraten würde ist Barrierefreiheit. Das fehlt vielen Unternehmen, da viele nicht wissen, wie das geht. In paar Jahren ist es für die ersten Dienstleistungen (Bankautomaten, E commerce, Banken, ...) gesetzlich verpflichtet und es ist davon auszugehen, dass noch mehr Dienstleistungen nachziehen werden müssen.\nhttps://ec.europa.eu/social/main.jsp?catId=1202", "created_utc": "1654968055.0", "edited": "1654969650.0", "id": "ibzsk3w", "is_submitter": "False", "link_id": "t3_v9wgb6", "parent_id": "t1_ibz4wj0", "score": "4", "subreddit": "informatik", "subreddit_id": "t5_38yld"}, {"author": "colutea", "body": "Du musst halt nur richtig viel schreiben und Lesen auf wissenschaftlichem Niveau, das ist was ganz anderes als Abi.\nSuch mal nach paar Papern auf Google Scholar und dann lies davon paar. Sowas darfst du ganz viel lesen.\n\n---\nMeinem Bruder lag das Schreiben auch nicht, deswegen hat er ne Ausbildung gemacht als Fachinformatiker für Systemintegration. Wird auch gut bezahlt und ist praktischer. Da muss man weder viel lesen noch schreiben. Ne Bekannte hat auch ne Ausbildung gemacht, aber IT Security und hatte auch null Probleme mit Jobs. Sie kam auch an Jobs, die für Studierte ausgeschrieben waren.\n\nAlternativ geht auch ne Fachhochschule, da ist der Schreib-Teil auch eher limitiert und man bekommt mehr vorgefertigt.\n\nStudium an ner Uni sollte man machen, wenn man an der Theorie interessiert ist und gerne liest und schreibt. Ansonsten sollte man sich nach ner Alternative umsehen", "created_utc": "1654966765.0", "edited": "1655049138.0", "id": "ibzprtj", "is_submitter": "False", "link_id": "t3_v9wgb6", "parent_id": "t1_ibz7hof", "score": "0", "subreddit": "informatik", "subreddit_id": "t5_38yld"}, {"author": "colutea", "body": "Non-Native English speaker goes to his house in the US and SHOCKS him by speaking fluent English.", "created_utc": "1654874024.0", "edited": "False", "id": "ibv41x6", "is_submitter": "False", "link_id": "t3_v8uyud", "parent_id": "t3_v8uyud", "score": "13", "subreddit": "languagelearningjerk", "subreddit_id": "t5_37rt5"}, {"author": "colutea", "body": "You can either find the book on scribd digitally or buy it online. It's not an app.\nI got mine used from eBay for like € 20, both textbook and workbook.", "created_utc": "1654873859.0", "edited": "False", "id": "ibv3o3u", "is_submitter": "False", "link_id": "t3_v8ff9f", "parent_id": "t1_ibrdxk9", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "colutea", "body": "Also mit 22 bist du keineswegs alt. Ich hatte Kommilitonen, die haben zum Teil erst mit 30 angefangen.\n\nDie mathelastigen Fächer sind m.E. die mit den hohen Durchfallquoten. Das liegt auch bisschen dran, dass deutschlandweit das Abi nicht einheitlich ist.\nIch hab zB in Bayern Abi gemacht und hatte alles nötige in Mathe gelernt, Leute aus Berlin hatten da mehr Schwierigkeiten. Aber die (guten) Unis bieten aus dem Grund i.d.R. Vorkurse an.\nDie sollte man auch besuchen, dann hat mans leichter. Wenn du in der Schule keine Schwierigkeiten mit Mathe hattest und ein gutes Grundverständnis da ist, dann sollte das machbar sein, solang du den Uni-Stoff gut lernst und alle Übungen machst. Ich hab mir zB mehrere Bücher mit extra Übungen auch aus der Bibliothek ausgeliehen. Wenn du Lücken im Abi-Mathe hast oder in einem Bundesland mit \"leichtem\" Mathe-Abi Abi gemacht hast oder nur nen Grundkurs hattest, solltest du das nachholen.\n\nOb das an ner Nicht-Elite-Uni wirklich leichter ist/weniger Stoff oder nur von Leuten so erzählt wird, um andere Unis niederzumachen, kann ich nicht sagen. Es ist anzunehmen, dass wenn du mit Mathe Probleme hast, hast du die überall. \nMeistens hat man ja sowieso drei Versuche, wenn man sich wirklich ins Zeug hängt, dann schafft man das auch, damit auszukommen.\n\nDas Problem ist so bisschen, wenn dir für den Master die Grundlagen fehlen, dann hast dus schwieriger. \nOb es besser ist, zu wechseln kann ich nicht sagen, da hat jeder ne andere Meinung.\nIch war ganz froh durchgehend an der gleichen Uni gewesen zu sein, weil ich kannte im Master einige Profs vom Studienbeginn schon, wusste was so deren Lieblingsthemen sind und kannte die Forschungsbereiche auch ziemlich gut. Probleme mit fehlenden Grundlagen hatte ich so auch nicht. \n\nEin Wechsel ist dann gut, wenn man sich in nem Forschungsbereich spezialisieren will, den die Uni entweder nicht anbietet oder nicht so viel Kompetenz darin hat oder sich ein Lehrstuhl auflöst, etc.\n\nIch hab mir damals auch gedacht, oh nein, über Dreiviertel sind durch Mathe gefallen, oh nein, oh nein. Am besten nicht verrückt machen, fleißig lernen. \nUnd Fragen stellen, es gibt meist Tutoren, Sprechstunden, etc. Was auch hilft, ist sich Studenten paar Semester über dir zu schnappen und Tipps geben lassen. Was wurde damals abgefragt, wie ist der Dozent drauf, etc. Am besten auch Kommilitonen suchen, die auch motiviert sind und zusammen lernen.\n\nIch würd sagen, probiers an deiner Wunsch-Uni und vorbereite dich gut, lerne mit und dann klappt das. Das Leben versaut man sich nur, wenn man sich selbst im Weg steht und nicht an sich glaubt.\n\nNoch ein kleiner Tipp, wenn du noch nicht programmieren kannst, solltest du das jetzt nachholen. Die Leute, die zum ersten Mal ne Zeile Code im Studium gesehen hatten, hatten auch massive Probleme, wenn die Uni plötzlich mit C und Pointern usw ums Eck kommt, die aber nicht mal wissen, was eine Variable ist.", "created_utc": "1654864491.0", "edited": "False", "id": "ibujpe7", "is_submitter": "False", "link_id": "t3_v7pvuz", "parent_id": "t1_ibrsdl5", "score": "1", "subreddit": "informatik", "subreddit_id": "t5_38yld"}, {"author": "colutea", "body": "Racism, misogyny, LGBTQ+-hate or any other form of discrimination.", "created_utc": "1654799414.0", "edited": "False", "id": "ibrfiib", "is_submitter": "False", "link_id": "t3_v7yc1y", "parent_id": "t3_v7yc1y", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "colutea", "body": "Genki is a great textbook for beginner level Japanese", "created_utc": "1654798694.0", "edited": "False", "id": "ibrdtoi", "is_submitter": "False", "link_id": "t3_v8ff9f", "parent_id": "t1_ibq1kt5", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "colutea", "body": "Was noch interessant ist, an ner \"Elite\"-Uni gibts öfter mal sehr interessante Gast-Vorlesungen.\nIm Master hatte einer meiner Profs alle paar Wochen ne für den Kurs exklusive Gast-Vorlesung mit anderen Profs und Fachleuten aus USA und Süd-Korea organisiert, die entweder zusammen mit oder für FAANG gearbeitet haben. So konnten wir paar Sachen lernen und Einblicke bekommem, die wir sonst wohl nicht hätten.\n\nAber da kommts auch sehr drauf an, wie die einzelnen Profs motiviert sind, sodass sich ne pauschale Garantie drauf nicht geben lässt. Manche haben die Kontakte, nutzen die aber nicht. Oder die machen das nur in einem Jahr und sonst nie wieder, usw.", "created_utc": "1654798536.0", "edited": "False", "id": "ibrdgmt", "is_submitter": "False", "link_id": "t3_v7pvuz", "parent_id": "t1_ibnut3y", "score": "2", "subreddit": "informatik", "subreddit_id": "t5_38yld"}, {"author": "colutea", "body": "Ob die Prüfungen schwerer sind, kann man nicht so pauschal sagen. Ich hab selbst auch an ner technischen Elite-Uni studiert, also in den ersten paar Semestern wurde stark gefiltert. Aber teilweise lags an den Prüfungen, warum die Leute irgendwann weg waren, aber auch teilweise weil die Leute einfach faul waren (= 1 Tag vorher angefangen das Skript zu lesen). Die Leute gibts überall.\n\nWie einer meiner Dozenten mal meinte, es gibt Leute, die will man auch später nicht betreuen, weil die sich keine Mühe geben und dann die Forschungsergebnisse (im Master) dann unbrauchbar sind. Und das ist für die nur Aufwand. Die von sehr guten Studenten kannst du weiter nutzen für deine Forschung. Wenn du folglich ne hohe Reputation als Uni hast, willst du auch die Nachwuchs-Wissenschaftler nachhaltig exzellent ausbilden, sonst bleibt die Qualität nicht. Folglich muss irgendwie gefiltert werden.\n\nAber ganz ehrlich, wenn man konsistent lernt und sich Mühe gibt, dann kommt man durch alles auch mit sehr guten Noten durch. Also Vorlesungen und Seminare vor- und nachbereiten, das Semester über lernen und auch mal über den Tellerrand hinaus Publikationen lesen.\n\nWenn du dir folglich Mühe gibst und bei den Profs nen guten Ruf hast, betreuen die dich auch besser in der Abschlussarbeit und dein Abschluss wird folglich super. Zu mir meinten Dozenten auch mal, bei einigen merken sie, dass die sich null für deren Forschung interessieren und am besten mit wenig Aufwand ne gute Note wollen. Bei den Leuten, die ernsthaft interessiert sind, da geben sie mehr Feedback, weil sich die Ergebnisse verwerten lassen und wenns gut läuft, hat man am Ende vom Studium so nicht nur nen Master, sondern ist auch Co-Autor (was definitiv auch gut in der Praxis ankommt).\n\nEs muss einem klar sein, dass ein Studium, insb. der Master forschungsorientiert ist. Und wenn man an ner Uni ist, wo einen die Forschungsthemen nicht interessieren, dann kommt man nicht weit (da Dozenten sehr gerne eigene Forschung stärker gewichten). Wenn man sich für die Themen interessiert und bereit ist, da tief einzutauchen, dann spiegeln das die Noten wieder.\n\n------\n\nUnd wenn man sich nicht für die Wissenschaft  interessiert, dann sollte man erwägen ne Ausbildung zu machen oder mit ausreichender Erfahrung es auch zu lassen, weil sonst hat man keine Freude am Studium.\nDie meisten, die abgebrochen haben, waren verwundert, dass es in der Uni so \"theoretisch\" ist und dass es da viel um Wissenschaft geht.\n\nFür mich waren die Master-Module die spannensten im gesamten Studium und mir fielen die leichter, als die im Bachelor, weil es mich so sehr interessiert hat. Andere fanden das total öde und schwer und haben nur gejammert (\"an Uni X wärs viel leichter\"), das sind aber auch die Leute, die nur ein Blatt Papier wollen und am besten haufenweise Geld, ohne aber irgendwas dafür zu machen.\n\nDeswegen, wenn du tief eintauchen willst und wissenschaftlich interessiert bist und nicht Party über alles stellst, dann schaffst du auch ne super Note an ner \"schweren\" Uni. \n\n----\n\nThat said, in meinem Fall haben sich die Unternehmen vor allem für meine Erfahrung als Werkstudent interessiert (in meinem Fall 5 Jahre, hab durchgehend gearbeitet) und nach den Uni-Noten wurd ich nur gefragt, nachdem der Prozess fertig war, 1 Tag bevor ich den Vertrag bekommen hab. Der ganze Prozess ging nur ums fachliche. Vielleicht ist das bei Leuten ohne Erfahrung anders.\nIrgendwelche Head-Hunter haben auch immer primär die Erfahrung erwähnt.\nIch bin aber dementsprechend nicht auf Entry-Level eingestiegen und habe die Junior-Stufe so übersprungen.\nDa ich aber am Ende auch in Regelstudienzeit studiert habe und sehr gute Noten hatte, weiß ich nicht, ob diese Studium-Faktoren ausschlaggebend waren, dass ich die Stelle bekommen hab, oder nicht. \n\nKommilitonen, die nicht so gute Noten hatten, aber auch paar Jahre Berufserfahrung, die hatten auch keine Probleme mit dem Einstieg und kamen überall hin, wohin sie wollten. Die, die quasi null Berufserfahrung hatten, hatten es schwieriger, weil ein Unternehmen einfach keine Uni ist und Prozesse weniger theoretisch ablaufen.", "created_utc": "1654796523.0", "edited": "1654797045.0", "id": "ibr8pow", "is_submitter": "False", "link_id": "t3_v7pvuz", "parent_id": "t1_ibnut3y", "score": "2", "subreddit": "informatik", "subreddit_id": "t5_38yld"}, {"author": "colutea", "body": "Wie gesagt, wenn du Kontakte hast und fachlich reputiert gut bist, wirst du trotzdem genommen. Nur weil in den SE Bachelor steht, heißt das nicht, dass das wirklich nötig ist. \nWenn du aber grad mal ein Jahr programmierst und dann keinen Abschluss hast, dann ja, wird nix.\n\nAber die Leute, die ich referenzier, haben im Teenager-Alter angefangen ihre Kontakte aufzubauen und haben dementsprechend lange Erfahrung. Und ab ner gewissen Reputation hat die Leute keiner mehr nach nem Abschluss gefragt.\n\nIch würd ein Studium trotzdem empfehlen, aber den Wert der Erfahrung sollte man nicht unterschätzen.\nAber für manche ist da der Kosten-Nutzen nicht gegeben, sich 3-5 Jahre in die Uni zu setzen, nur um auf Papier den Abschluss zu haben, wenn sie die guten Jobs auch so dank ihrem Netzwerk bekommen.\n\nWenn jemand intern deine Bewerbung einreichen kann, ist das einfach nochmal was anderes, als wenn wer \"fremdes\" von außen kommt.", "created_utc": "1654793110.0", "edited": "1654793670.0", "id": "ibr0jux", "is_submitter": "False", "link_id": "t3_v7pvuz", "parent_id": "t1_ibnpkpv", "score": "2", "subreddit": "informatik", "subreddit_id": "t5_38yld"}, {"author": "colutea", "body": "Well, my experience is coming from friends who watched many, many hours of Anime for more than a decade with English subs and still know almost no Japanese. Like maybe ありがとう or はい or ええ. Yes, that's more than nothing but it's definitely not effective to learn the language.", "created_utc": "1654792566.0", "edited": "False", "id": "ibqz8oy", "is_submitter": "False", "link_id": "t3_v7ob0x", "parent_id": "t1_ibmjyw0", "score": "5", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "colutea", "body": "If the input is done with subtitles in their NL, it is pretty much ineffective.", "created_utc": "1654703463.0", "edited": "False", "id": "ibmdk4p", "is_submitter": "False", "link_id": "t3_v7ob0x", "parent_id": "t1_ibm6y3b", "score": "10", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "colutea", "body": "Die meisten meiner Bekannten haben ihre Kontakte auf Fachkonferenzen aufgebaut und die haben entweder selbst bei FAANG angefangen oder kannten jemanden. Also keine Uni-Konferenzen, sondern Entwickler-Konferenzen weltweit. Das ist aber leider teuer, aber es gibt auch Scholarships, wodurch der Preis etwas reduziert wird", "created_utc": "1654702757.0", "edited": "False", "id": "ibmbvg8", "is_submitter": "False", "link_id": "t3_v7pvuz", "parent_id": "t1_ibm31at", "score": "5", "subreddit": "informatik", "subreddit_id": "t5_38yld"}, {"author": "colutea", "body": "Jup, kenn Leute, die bei FAANG arbeiten in ner guten Position und noch nie ne Uni von innen gesehen haben. In der Informatik gilt: Skills > Uniabschluss\n\nWenn du dort hin willst, dann such dir parallel den Werkstudenten-Job wo du a) viel lernst und b) viel Verantwortung bekommst. Am besten auch nebenbei an Open-Source Projekten mitarbeiten. Nur mit Uni-Abschluss, selbst wenn ne 1,0 drauf steht, kommst du nicht weit.", "created_utc": "1654702196.0", "edited": "1654702400.0", "id": "ibmak9a", "is_submitter": "False", "link_id": "t3_v7pvuz", "parent_id": "t1_ibly2u0", "score": "8", "subreddit": "informatik", "subreddit_id": "t5_38yld"}, {"author": "colutea", "body": "thanks a lot", "created_utc": "1654700387.0", "edited": "False", "id": "ibm6dvp", "is_submitter": "True", "link_id": "t3_v7pm9f", "parent_id": "t1_iblzfdw", "score": "1", "subreddit": "LaTeX", "subreddit_id": "t5_2qhbn"}, {"author": "colutea", "body": "You can set the eReader (in this case the poke) to warm light so it doesn't emit blue light. Also eReaders use indirect lightening, so it's different from your phone. In your phone, each individual pixel emits light but in an eReader, the lightening comes from under the frame and is indirect. So overall, it's better.", "created_utc": "1654695106.0", "edited": "False", "id": "iblusp8", "is_submitter": "False", "link_id": "t3_v5bqav", "parent_id": "t1_ibahii0", "score": "1", "subreddit": "ereader", "subreddit_id": "t5_2qwmn"}, {"author": "colutea", "body": "any other eReader from Boox, Xiaomi Ink Palm, Boyue Likebook, etc.", "created_utc": "1654694930.0", "edited": "False", "id": "iblug3u", "is_submitter": "False", "link_id": "t3_v5bqav", "parent_id": "t1_ibahn61", "score": "1", "subreddit": "ereader", "subreddit_id": "t5_2qwmn"}, {"author": "colutea", "body": "Lindie Botes", "created_utc": "1654640512.0", "edited": "False", "id": "ibjgrt2", "is_submitter": "False", "link_id": "t3_v75q58", "parent_id": "t1_ibj4ovi", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "colutea", "body": "I looked at Goodreads, the point I reached C1 officially in English, my English book count was around 200 as well. So I think this number is pretty accurate.", "created_utc": "1654547050.0", "edited": "False", "id": "ibeou9b", "is_submitter": "False", "link_id": "t3_v5z4tf", "parent_id": "t1_ibcoi0n", "score": "10", "subreddit": "LearnJapanese", "subreddit_id": "t5_2qyls"}, {"author": "colutea", "body": "No. You cannot use the Kindle for Anki, it's a closed ecosystem", "created_utc": "1654460870.0", "edited": "False", "id": "ibaggu6", "is_submitter": "False", "link_id": "t3_v5bqav", "parent_id": "t1_ib9sdm5", "score": "2", "subreddit": "ereader", "subreddit_id": "t5_2qwmn"}, {"author": "colutea", "body": "It's a little bit smaller but still a good size. I have the Poke 3, my bf the kindle\nI use the Poke for language learning myself. I have Anki and LingQ installed and it works perfectly.\nIf it's too small for you, Boox has more devices, e.g. the Leaf", "created_utc": "1654460859.0", "edited": "False", "id": "ibagg0b", "is_submitter": "False", "link_id": "t3_v5bqav", "parent_id": "t1_ibadquj", "score": "1", "subreddit": "ereader", "subreddit_id": "t5_2qwmn"}, {"author": "colutea", "body": "My brother says any language other than English and German (Native language) is useless.\nEven though my mom and dad are immigrants and speak other languages than these two at home. So... he had enough proof that it isn't :D\nI don't care what others think.", "created_utc": "1654430063.0", "edited": "False", "id": "ib8sdmg", "is_submitter": "False", "link_id": "t3_v50btz", "parent_id": "t3_v50btz", "score": "5", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "colutea", "body": "Overleaf doesn't have a word import function but is great for writing, especially in a team when the team members don't know how to use git.\nMy university offers a version that is hosted on university servers though. If your university offers that it is a good option.\nAnd I would recommend Overleaf to anyone who has never used Latex since getting everything to set up on your PC takes a while. In Overleaf, you can just start writing.", "created_utc": "1654382449.0", "edited": "False", "id": "ib6woc4", "is_submitter": "False", "link_id": "t3_v4u66w", "parent_id": "t1_ib6aik5", "score": "4", "subreddit": "LaTeX", "subreddit_id": "t5_2qhbn"}, {"author": "colutea", "body": "I can confirm that, mine is now also 2 years old", "created_utc": "1654358460.0", "edited": "False", "id": "ib5nnbj", "is_submitter": "False", "link_id": "t3_v4lo8q", "parent_id": "t1_ib4scn1", "score": "3", "subreddit": "Onyx_Boox", "subreddit_id": "t5_11rfaa"}, {"author": "colutea", "body": "Est-ce que tu aimes lire le manga avec couleurs ? Par exemple, je préfère utiliser mon iPad car il y a des mangas avec plusieurs pages en couleur...\nAussi, avec une liseuse, tu as le problème de «ghosting» (voir la page avant). Ce n'est pas grave, mais quelques personnes trouvent que c'est agaçant.\n\nSi tu aimes une liseuse, qc entre 8 ou 9\" est optimal. La possibilité est d'utiliser un Boox (avec Android, donc tu peux utiliser toutes les applications pour lire - Amazon, Kobo, Google Books, ...), p.ex. Boox Nova. \nCette liseuse est traduite en français, mais je trouve que la traduction dans autres langues (qui ne sont pas anglais ou chinois) est mal... C'est la raison pour laquelle j'utilise la traduction anglais.\nAussi, le site de Boox est disponible seulement en anglais ou chinois, ainsi, si tu as un problème, tu dois communiquer en anglais.\n\nUne autre possibilité est une liseuse Kobo, la traduction est très  bien. Par exemple, Kobo Sage.\nIl est possible d'acheter les livres sur le site Kobo, mais aussi de télécharger les livres d'un autre site (sauf Amazon) avec utiliser Calibre ou qc comme ça.", "created_utc": "1654341452.0", "edited": "False", "id": "ib4x79l", "is_submitter": "False", "link_id": "t3_v4lbof", "parent_id": "t3_v4lbof", "score": "4", "subreddit": "ereader", "subreddit_id": "t5_2qwmn"}, {"author": "colutea", "body": "Nihongo no Mori is also fantastic. They do all the grammar explanations entirely in Japanese. They mostly focus on N3 and upwards though", "created_utc": "1654104701.0", "edited": "False", "id": "iat63rm", "is_submitter": "False", "link_id": "t3_v289kb", "parent_id": "t1_iargcyz", "score": "8", "subreddit": "LearnJapanese", "subreddit_id": "t5_2qyls"}, {"author": "colutea", "body": "I wanted to vomit after seeing this section. This is so disrespectful and sexist... I can't believe he dared to write sth like that.", "created_utc": "1654092952.0", "edited": "False", "id": "iaselmd", "is_submitter": "False", "link_id": "t3_v289kb", "parent_id": "t1_iar3zvk", "score": "39", "subreddit": "LearnJapanese", "subreddit_id": "t5_2qyls"}, {"author": "colutea", "body": "Luca Lampariello tried learning Japanese with Assimil but failed. Here is his story: https://youtu.be/0LN5PM7nOS8\nMaybe this video helps to gauge if Assimil is a good fit", "created_utc": "1653589549.0", "edited": "False", "id": "ia3hgh3", "is_submitter": "False", "link_id": "t3_uy7zkw", "parent_id": "t1_ia2yjuw", "score": "2", "subreddit": "LearnJapanese", "subreddit_id": "t5_2qyls"}, {"author": "colutea", "body": "Same for me, but with Japanese and French. I am only learning them, because I am interested in the languages and cultures but not for the sake of needing it.", "created_utc": "1653588434.0", "edited": "False", "id": "ia3epug", "is_submitter": "False", "link_id": "t3_uybg36", "parent_id": "t1_ia3837m", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "colutea", "body": "Katakana and Hiragana are the minimum you should know to learn conversational japanese. You'll have access to way more resources once you got this.\nYou won't get to a high level with omitting the Kanji (but you can get conversational to at least somehow get around) but without Kana, I doubt you'll get anywhere which goes beyond \"Konnichiwa. Ogenki desu ka? Hai, Genki desu.\"\n\nAfter a week, you should be able to read Kana. That's not much time. Get an app, e.g. Dr. Moku, and just do it. There are people who even need less than that.", "created_utc": "1653577873.0", "edited": "1653589347.0", "id": "ia2o4n5", "is_submitter": "False", "link_id": "t3_uy7zkw", "parent_id": "t3_uy7zkw", "score": "14", "subreddit": "LearnJapanese", "subreddit_id": "t5_2qyls"}, {"author": "colutea", "body": "My second language is English, at the beginning of my studies I also had difficulties with academic level texts and writing. However, I watched tons of Ted talks, online uni lectures and started to just read these academic articles. With time, it got better and now, at the end of my Master's, I can read and write effortlessly on an academic level in English.\nTo be honest, I struggle a little bit when writing scientific texts in my native language now, since my brain always suggests the perfect English expression. This is probably due to that I barely read academic articles in German as all German scholars also publish in English.\nMaybe it also helped that I have started re-learning French about 3 years ago and through French, I also expanded my active English vocabulary. This may sound odd, but academia is also a little bit showing off your vocab size 😅\nThat said, while I can discuss scientific topics on a deep level as I also read a lot of studies outside my field out of pure curiosity, last week, I went to a restaurant with a friend who couldn't speak German and I failed translating \"Schimmelkäse\".", "created_utc": "1653518502.0", "edited": "1653569029.0", "id": "i9zudvi", "is_submitter": "False", "link_id": "t3_uxkrx8", "parent_id": "t3_uxkrx8", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "colutea", "body": "I had the same issue until I changed the compiler to pdflatex.\nI could type ẞ directly then without needing to use {\\ss} or anything like that.\n\nThese are the only German specific settings I use:\n\n```\n% Deutsch\n\\usepackage[utf8]{inputenc}\n\\usepackage[ngerman]{babel}\n\\usepackage[T1]{fontenc}\n\\usepackage[autostyle=true,german=quotes]{csquotes}\n```\n\nMaybe try those settings first", "created_utc": "1653241177.0", "edited": "1653241792.0", "id": "i9l594t", "is_submitter": "False", "link_id": "t3_uvbt55", "parent_id": "t3_uvbt55", "score": "1", "subreddit": "LaTeX", "subreddit_id": "t5_2qhbn"}, {"author": "colutea", "body": "Just as a question, if you have been learning both for a few months, how do you get to the conclusion that you are at A2 in both (I am referring to your flair)?\nSorry for this upfront question, but I feel like many people underestimate A2 abilities. \n\nMarugoto has a list of A2 abilities for Japanese clustered by topics: https://a2.marugotoweb.jp/en/topic_and_cando_list/\n\nE.g. you should be able to read and understand this at A2: https://a2.marugotoweb.jp/ja/life_and_culture/topic/4/post1/3.html\n\nThis is an A1 exercise for comparison: https://a1.marugotoweb.jp/ja/can-do44.php\n\nIf you really are A2, you should have a solid basis to continue learning both if you can put in the time. Plus, you should be able already to travel using the languages.\nThat said, if your level is lower, I wouldn't learn both at the same time as the risk to confuse them is too high and the process takes longer.\nSo my recommendation is, pick one and get it to a high level and then start the other. It'll be easier and you'll confuse them less", "created_utc": "1653222099.0", "edited": "1653223148.0", "id": "i9k0nrw", "is_submitter": "False", "link_id": "t3_uuzh9e", "parent_id": "t3_uuzh9e", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "colutea", "body": "I find Quizlet great for cramming a lot of information within a short period of time. The cards with needing to type in the information and automatically reading it out, helped to manifest the information and recall it quickly and precisely. Their method is good for short term, e.g. if you have an exam coming up in 2-3 weeks, but Ankis algorithm is better for long-term retention in my experience.", "created_utc": "1653164070.0", "edited": "False", "id": "i9hjtl5", "is_submitter": "False", "link_id": "t3_uurjfg", "parent_id": "t3_uurjfg", "score": "1", "subreddit": "LearnJapanese", "subreddit_id": "t5_2qyls"}, {"author": "colutea", "body": "論文を書きなければなりません。そして、忙しくなります", "created_utc": "1653044007.0", "edited": "False", "id": "i9b9u6z", "is_submitter": "False", "link_id": "t3_utiwur", "parent_id": "t3_utiwur", "score": "1", "subreddit": "LearnJapanese", "subreddit_id": "t5_2qyls"}, {"author": "colutea", "body": "I have a Mac and could convert it for you", "created_utc": "1652975911.0", "edited": "False", "id": "i97s9ub", "is_submitter": "False", "link_id": "t3_ut265k", "parent_id": "t3_ut265k", "score": "2", "subreddit": "Ebook", "subreddit_id": "t5_2qjy7"}, {"author": "colutea", "body": "You can use the Kindle app but tbh, the experience of the Kindle app is not the same as on on the actual Kindle. If you are curious how well it works, download the Kindle app on your phone and compare it to your Kindle.\nThe benefit of Android eReaders is that you can use a variety of applications and you are not locked into one ecosystem but that flexibility has downsides as well (less optimized software).", "created_utc": "1652857902.0", "edited": "False", "id": "i91piue", "is_submitter": "False", "link_id": "t3_uryvsy", "parent_id": "t1_i91bb6n", "score": "4", "subreddit": "LearnJapanese", "subreddit_id": "t5_2qyls"}, {"author": "colutea", "body": "The model you got is apparently from the Russian distributor as Onyx (the manufacturer) directly sells their readers [here](https://shop.boox.com/collections/all)  and they don't offer an Edison model. I think what you got is either an old model or a rebranding of another one. Maybe you can check the official website to find out if you bought a recent model that was just rebranded.\n\nStill, I second Boox for their eReaders for learning Japanese - I have a Poke 3 for example and love it. I ordered via https://shop.boox.com and chose the European warehouse", "created_utc": "1652830052.0", "edited": "1652857623.0", "id": "i90c85v", "is_submitter": "False", "link_id": "t3_uryvsy", "parent_id": "t3_uryvsy", "score": "2", "subreddit": "LearnJapanese", "subreddit_id": "t5_2qyls"}, {"author": "colutea", "body": "I use goodnotes with the Apple pencil on iPad. It doesn't matter what language I type or write in. I never thought about it as it just worked", "created_utc": "1652829641.0", "edited": "False", "id": "i90bdas", "is_submitter": "False", "link_id": "t3_ursibc", "parent_id": "t3_ursibc", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "colutea", "body": "I like the Japanese culture a lot due to the blend of history and modernity as it's very different from what I know and it broadens my horizon. Learning the language, talking to Japanese friends is very enriching as it brings me to continuously question myself and my cultural values. \nI am not into Anime though :D By learning the language I got access to also learning more deeply about the issues like work culture, etc. I don't know if I would like to live there though. Maybe for a limited amount of time as a sabbatical or sth to improve the language skills, explore the country and understand the culture better. \n\nI know some western males though who fetishize the country. Like they think there is a Pokémon and a hot Japanese women around the corner lingering for their Western appearance and serving them. Many of them don't have success with women here and they built up a very skewed understanding based on Anime and maid café vlogs. Like, it's disgusting how they view them and I understand why they don't have any success here. They think if they go to Japan, they will immediately get married and being treated like a king. \n\nBut I can also see the same with men here fetishizing \"Asian\" looking women in general. On a local platform similar to Reddit, I also see a lot of posts of young males (20-35) asking for an \"Asian\" girlfriend. Some just care for the looks and the image in their head. When you ask them what \"Asian\" means, they are like, \"yeah people looking Thai/Japanese/Korean/Chinese. Don't care they all look the same\" 😫\nSo one part of some males might be pure ignorance coupled with racism and fetishism.\n\nI still wouldn't generalize all Western males though as there still are many who appreciate the culture and people in a respectful way.", "created_utc": "1652814257.0", "edited": "1652814496.0", "id": "i8zbqjw", "is_submitter": "False", "link_id": "t3_uromoi", "parent_id": "t3_uromoi", "score": "3", "subreddit": "TwoXChromosomes", "subreddit_id": "t5_2r2jt"}, {"author": "colutea", "body": "Happened with Hungarian. I spoke it until the age of 6/7. I was raised bilingual though - so the parent who spoke Hungarian stopped one day because school teachers recommended them to as they believed bilingualism will hurt fluency in the national language.\nI lived in a rural area with few immigrants so people were skeptical about anyone who was different and wanted them to fully assimilate.", "created_utc": "1652731758.0", "edited": "1652802858.0", "id": "i8v1psf", "is_submitter": "False", "link_id": "t3_ur2sc7", "parent_id": "t3_ur2sc7", "score": "8", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "colutea", "body": "Linking latex files to git is the entire same process as for other code: https://docs.github.com/en/get-started/importing-your-projects-to-github/importing-source-code-to-github/adding-locally-hosted-code-to-github\n\nThat guide is for local files though. If you want to continue to use overleaf, it's not possible to use Git and Overleaf without a subscription. To use the benefits of Git for free, you need to switch to a local Latex setup. You can use Git for the syncing between multiple devices", "created_utc": "1652426714.0", "edited": "False", "id": "i8fat8e", "is_submitter": "False", "link_id": "t3_um0r2x", "parent_id": "t1_i88gd0r", "score": "1", "subreddit": "LaTeX", "subreddit_id": "t5_2qhbn"}, {"author": "colutea", "body": "I can also recommend Git but Overleaf wants money for the Git integration. If OP wants to use Git, I'd recommend using some local setup rather than getting the sub", "created_utc": "1652192587.0", "edited": "False", "id": "i81yene", "is_submitter": "False", "link_id": "t3_um0r2x", "parent_id": "t1_i7zem3m", "score": "2", "subreddit": "LaTeX", "subreddit_id": "t5_2qhbn"}, {"author": "colutea", "body": "Did you try to use it like one person suggested here: https://tex.stackexchange.com/questions/454863/how-to-label-and-refer-subfigures-under-tabular-environment", "created_utc": "1652191763.0", "edited": "False", "id": "i81wh8q", "is_submitter": "False", "link_id": "t3_um0r2x", "parent_id": "t1_i80yxar", "score": "3", "subreddit": "LaTeX", "subreddit_id": "t5_2qhbn"}, {"author": "colutea", "body": "Most eReaders don't have speakers or a headphone jack which is also important to mention. E.g. Boox can handle TTS if you connect Bluetooth headphones", "created_utc": "1652135901.0", "edited": "False", "id": "i7z8c16", "is_submitter": "False", "link_id": "t3_um0dvq", "parent_id": "t1_i7yzhob", "score": "2", "subreddit": "ereader", "subreddit_id": "t5_2qwmn"}, {"author": "colutea", "body": "Did you add a ` \\label{} ` within each figure?\nE.g.\n\n```\n\\begin{figure}\n    \\includegraphics[width=0.25\\textwidth]{mesh}\n    \\caption{a nice plot}\n    \\label{fig:3b}\n\\end{figure}\n\n```\n\nThe warnings seems like you only used e.g. `  \\ref{fig:3b} ` without actually providing a label within the figure environment.\n\nThe legacy warnings regarding the montg fied disappear if you replace the month fields with numbers. E.g. jan becomes 1, jul 7 and so on.\n\n---\n\nOtherwise, try using PDF in the figures instead of e.g. PNG or JPG. I recently wrote a paper with 60 high-res JPGs and overleaf collapsed unless I replaced each with PDF", "created_utc": "1652135449.0", "edited": "1652135792.0", "id": "i7z7bz3", "is_submitter": "False", "link_id": "t3_um0r2x", "parent_id": "t3_um0r2x", "score": "2", "subreddit": "LaTeX", "subreddit_id": "t5_2qhbn"}, {"author": "colutea", "body": "In German are even different Rs. I am from the south and I roll the R but friends a bit more from the north don't. They can't pronounce my R and I can't pronounce theirs. The R is the first thing people in the north ask me about as they immediately know I am from the south", "created_utc": "1652130899.0", "edited": "False", "id": "i7ywval", "is_submitter": "False", "link_id": "t3_ulg5uf", "parent_id": "t3_ulg5uf", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "colutea", "body": "Diary of a Wimpy kid. I used it to learn English and bought it in Japanese more than 10 years later to practice Japanese. I dislike it now", "created_utc": "1651416076.0", "edited": "False", "id": "i6wrbe4", "is_submitter": "False", "link_id": "t3_ufrtcq", "parent_id": "t3_ufrtcq", "score": "6", "subreddit": "books", "subreddit_id": "t5_2qh4i"}, {"author": "colutea", "body": "Mit deinem Master solltest du recht einfach nen Job finden, ich hab was ähnliches studiert und kenn keinen meiner Kommilitonen, die großartige Probleme hatten irgendwas zu finden.\nDie 10k Schulden solltest du damit einfach abbezahlen können - ggf kannst du ausrechnen, ob sich das lohnt, Geld zu leihen, um das Bafög auf einmal zurückzuzahlen. Teilweise werden dann 21% erlassen. Würde mal beim Bafög-Amt fragen.\n\nMeine Eltern haben auch nix zum Erben und Auto hab ich auch nicht. In der Großstadt ist das eh Geldverschwendung, wenn man mit den Öffis überall hinkommt. Nur weil andere eins haben, ist kein Argument. Für die paar Mal, wo es praktisch ist, kann man was mieten. Wenn du bisher ohne klarkamst, glaub ich nicht, dass du eins brauchst.\nDas so gesparte Geld kannst du investieren. Einnahmen - Ausgaben (+ Puffer für Freizeit o.ä.) und dann Sparplan aufsetzen mit automatischer Abbuchung jeden Monat und laufen lassen. Selbst wenns nur 50€ im Monat sind ist das besser als nix. \n\nAlso so schlecht stehst du gar nicht da, dass du lange fürs Studium gebraucht hast, kannst du ja gut begründen. Und selbst wenn sicg das mit dem Bafög auf einmal zurückzuzahlen nicht lohnt, Bafög ist ja sowieso zinslos und wenn du aus irgendeinem Grund ewig keinen Job findest oder nur einen schlecht bezahlten (sehr unwahrscheinlich) kannst du niedrige Raten wählen und nach 20 Jahren wird der Rest erlassen. \n\nNext steps:\n- Bewerben\n- Bafög-Amt anrufen wegen Rückzahlung\n- Rechnen, ob sich Geld leihen lohnt (wegen Reduzierung der 10k bei Bafög) und dann ggf Geld leihen\n- nachdem du nen Job hast: Sparplan aufsetzen und laufen lassen", "created_utc": "1651333164.0", "edited": "False", "id": "i6stfm1", "is_submitter": "False", "link_id": "t3_uf73g8", "parent_id": "t3_uf73g8", "score": "1", "subreddit": "Finanzen", "subreddit_id": "t5_35m5e"}, {"author": "colutea", "body": "Yeah Waifu is trained with Anime and Manga so it is optimized for the artwork", "created_utc": "1651062448.0", "edited": "False", "id": "i6e4sat", "is_submitter": "True", "link_id": "t3_swi63d", "parent_id": "t1_i6dij3p", "score": "1", "subreddit": "Calibre", "subreddit_id": "t5_2tb43"}, {"author": "colutea", "body": "If you have the individual images, you can run them through waifu2x to upscale them.\nI afterwards put the upscaled images together as a PDF.\nHere is a comparison image of the upscaled vs the original: https://ibb.co/KVFdH0M\nThe characters get blurred a bit but it's still better readable than the original. I bought the same manga on many different sites and each and every Japanese site offers the same low-res quality", "created_utc": "1651044203.0", "edited": "False", "id": "i6dgox7", "is_submitter": "True", "link_id": "t3_swi63d", "parent_id": "t1_i6df3i3", "score": "1", "subreddit": "Calibre", "subreddit_id": "t5_2tb43"}, {"author": "colutea", "body": "Here are the LingQ videos:\n\n\nhttps://streamable.com/vq9nke\n\n\nhttps://streamable.com/mpf54q", "created_utc": "1650713798.0", "edited": "False", "id": "i5v7lhe", "is_submitter": "False", "link_id": "t3_u87zxm", "parent_id": "t1_i5t5sv2", "score": "2", "subreddit": "Onyx_Boox", "subreddit_id": "t5_11rfaa"}, {"author": "colutea", "body": "I'll take a video later. However, LingQs light blue and yellow look almost the same due to B/W.\nUnfortunately you cannot change LingQs color scheme", "created_utc": "1650646974.0", "edited": "False", "id": "i5rruhy", "is_submitter": "False", "link_id": "t3_u87zxm", "parent_id": "t1_i5o8y8j", "score": "1", "subreddit": "Onyx_Boox", "subreddit_id": "t5_11rfaa"}, {"author": "colutea", "body": "B2 is the minimum requirement set by most companies. I would say a high B1 is also possible if you don't have contact to customers and don't need to communicate much.", "created_utc": "1650615820.0", "edited": "False", "id": "i5q4awe", "is_submitter": "False", "link_id": "t3_u96spz", "parent_id": "t3_u96spz", "score": "68", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "colutea", "body": "Also gesetzlich sind die Eltern dazu verpflichtet, die Erstausbildung zu finanzieren:\nhttps://www.allrecht.de/alles-was-recht-ist/studiumsfinanzierung/\nDu musst aber das Studium ernsthaft durchziehen und darfst die Regelstudienzeit nicht signifikant überschreiten. \nFalls man nicht mehr bei den Eltern wohnt, ist die Höhe abhängig vom Einkommen der Eltern. Falls die Eltern das nicht leisten können, kann man Bafög beantragen.\n\"Verweigern Eltern die Unterhaltszahlung, können Studierende ihren Unterhaltsanspruch mithilfe eines Rechtsbeistandes geltend machen.\" \n\n\"Für volljährige Kinder, die Anspruch auf Barunterhalt haben und einen eigenen Hausstand führen (auch in Wohngemeinschaften) beträgt der Unterhaltsbetrag seit dem 01.01.2020 abweichend von den Tabellenwerten 860 Euro (735 Euro bis 31.12.2019) monatlich.\"  \nhttps://www.unterhalt.net/duesseldorfer-tabelle/\n\n\n\n--\n\nMeine Eltern hätten eigentlich auch den o.g. Betrag zahlen müssen, da mein Bafög-Anspruch bei 0€ lag. Ich fands aber sinnlos, Eltern zu verklagen (insbesondere weil ich bisschen was bekam und mehr nicht ging) und hab mir vom 1. Semester an nen Werkstudenten-Job mit 20h/Woche gesucht. Am Anfang waren meine Noten dementsprechend nur durchschnittlich, aber mit der Zeit gewöhnt man sich, lernt besseres Zeit-Management und dann schafft man trotzdem nen super Schnitt in Regelstudienzeit, wenn man sich reinhängt. Durch die resultierende Berufserfahrung von 5 Jahren hatte ichs auch ziemlich leicht nen Job nach dem Studium zu finden. Aber hart wars dennoch, aber das ist auch ok, wenn man weiß, warum man es macht und sich regelmäßig daran erinnert. Als Resümee, Nebenjob ist nicht so schlimm, wie man erst denkt. Aber schau, dass du was nahes am Fach findest. Vielleicht hilft dir diese persönliche Erfahrung weiter.", "created_utc": "1650226979.0", "edited": "1650228104.0", "id": "i54gqgx", "is_submitter": "False", "link_id": "t3_u5t21p", "parent_id": "t3_u5t21p", "score": "1", "subreddit": "Finanzen", "subreddit_id": "t5_35m5e"}, {"author": "colutea", "body": "Needing to delete the lessons isn't even wise from a UX standpoint. People cancel for a variety of reasons (financial issues, no time to use the service, ...) and as a product, you want them to come back. If all what you added is gone and your experience is bad, the likelihood of coming back is very low. Also you won't recommend them, and more likely, warn others about it like writing posts like this or bad reviews.\nThis strategy works in the short term but is bad for the company in the long term. \nBetter: Make the cancellation process simple, let them keep all the data so it can be restored and occasionally (not every day!!) remind the users about your offerings. \n\nA tip from the consumer standpoint : if there is a mobile service, try to always subscribe via Google Play or Apple. You can cancel ALL subscriptions easily on your linked account.", "created_utc": "1650017841.0", "edited": "1650018083.0", "id": "i4tcsmg", "is_submitter": "False", "link_id": "t3_u42rna", "parent_id": "t1_i4t5u7m", "score": "138", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "colutea", "body": "Nicht die kompletten 5000€, rechne das Worst-Case-Szenario aus, wofür du dringend Geld brauchst (Arbeitslosigkeit, hohe plötzliche Ausgabe wie kaputtes Auto, etc.), leg den Betrag zur Seite und investier den Rest. Und wenn du was verdienst, investier davon auch X% regelmäßig. Wie groß X ist hängt von deinen Ausgaben ab\n\nWegen Steuern, weniger als 801€ Gewinn sind steuerfrei. Diese Berechnung fällt an, wenn du verkaufst oder Dividende bekommst. Musst du aber beim Broker hinterlegen. Das was drüber geht, sollte automatisch abgeführt werden. Wenn du andere Investments machst, wo das nicht berücksichtigt wird, musst du die Gewinne in der Steuererklärung angeben, selbst wenn du unter 801€ bleibst. Ab 2023 sinds 1000€", "created_utc": "1649781613.0", "edited": "1649782046.0", "id": "i4g503i", "is_submitter": "False", "link_id": "t3_u1wljq", "parent_id": "t1_i4f1grz", "score": "2", "subreddit": "Aktien", "subreddit_id": "t5_313tk"}, {"author": "colutea", "body": "Anzahl der Monatsgehälter kommt drauf an, wo man arbeitet. Wenn du in der IT bist, ne gefragte Spezialisierung hast und blitzschnell nen neuen Job findest, keine Kinder und sonstige Ausgaben hast, da reichen auch 2. Wenn dein Job nicht so gefragt ist, du ggf länger arbeitslos wärst (so >3 Monate), dann ggf mehr. Dann kommts natürlich auch wieder drauf an, was du verdienst, etc.\nJemand der nen 400€-Job hat und Bafög bezieht, sollte sich mehr zurücklegen als jemand mit 5000€ netto (sofern die Person keine Schulden/Kinder/ ... hat)", "created_utc": "1649781293.0", "edited": "False", "id": "i4g44zt", "is_submitter": "False", "link_id": "t3_u1wljq", "parent_id": "t1_i4g2j8h", "score": "1", "subreddit": "Aktien", "subreddit_id": "t5_313tk"}, {"author": "colutea", "body": "Spend less than you earn. Invest and earn more. When investing, don't put all your money in one stock or one type of investment. Only invest what you can afford to lose and play long-term. Do it regularly, start small", "created_utc": "1649590545.0", "edited": "False", "id": "i45i12v", "is_submitter": "False", "link_id": "t3_u083bc", "parent_id": "t3_u083bc", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "colutea", "body": "Abi musst du trotzdem bestehen, sonst ist dein Job weg. Je nachdem was kommt, ists nicht garantiert, dass du das ohne Lernen schaffst\n\nUnd sonst: mach dir nen Lernplan. Sollte realistisch sein, Tag 1 Aufgabe A-C, 2 D-E, etc. Und das ziehst du knallhart durch. Plan Wiederholungen mit ein und Puffer, falls was dazwischen kommt. Somit kommst du durchs Abi and auch Studium. Und je nachdem was du studierst, siehst du den Abi-Stoff vllt wieder und du hast es dann leichter", "created_utc": "1649531936.0", "edited": "1649532419.0", "id": "i42k7qi", "is_submitter": "False", "link_id": "t3_tzyluu", "parent_id": "t3_tzyluu", "score": "3", "subreddit": "FragReddit", "subreddit_id": "t5_2r6ca"}, {"author": "colutea", "body": "The lord of the rings. Game of Thrones. Harry Potter", "created_utc": "1649529568.0", "edited": "False", "id": "i42elew", "is_submitter": "False", "link_id": "t3_tzvk6q", "parent_id": "t3_tzvk6q", "score": "1", "subreddit": "books", "subreddit_id": "t5_2qh4i"}, {"author": "colutea", "body": "Bundeskanzler mit 5\n\nSänger mit 7\n\nPhysiker mit 9\n\nChemiker mit 11\n\nKünstler mit 14\n\nProgrammierer mit 16\n\nUnternehmer mit 17\n\n\nBin jetzt in der IT gelandet.", "created_utc": "1649528384.0", "edited": "1649528585.0", "id": "i42bpoq", "is_submitter": "False", "link_id": "t3_tzs93y", "parent_id": "t3_tzs93y", "score": "6", "subreddit": "FragReddit", "subreddit_id": "t5_2r6ca"}, {"author": "colutea", "body": "Many people were surprised when I was a kid that my father's side is German but they didn't grow up in Germany.\nThey lived in Transylvania when all the German things were covered/destroyed. My great-grandfather was also deported but he survived. I also remember that my dad told that they renamed people and gave them Romanian names. I also remember that my grandma told once that she needed to flee her village as the government told that it's going to get destroyed.\nMy dad's family came to Germany in the 90s cause they were scared of that happening again.\n\nWe never learnt that in school, the only things I know are from my parents explaining it.\nSome parts of it are here: https://www.bpb.de/shop/zeitschriften/izpb/298587/spaet-aussiedler-aus-rumaenien/", "created_utc": "1649431776.0", "edited": "False", "id": "i3wuciu", "is_submitter": "False", "link_id": "t3_tyw5g6", "parent_id": "t1_i3v6k8b", "score": "5", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "colutea", "body": "As a fellow German, when I went to school, they only taught it in grade 8, 10 & 11. Bavaria (Gymnasium, G8). I finished school in 2017.", "created_utc": "1649430011.0", "edited": "False", "id": "i3wpqxx", "is_submitter": "False", "link_id": "t3_tyw5g6", "parent_id": "t1_i3wfbvw", "score": "13", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "colutea", "body": "Mine does but they don't have a subscription for all journals", "created_utc": "1649351985.0", "edited": "False", "id": "i3sb3sh", "is_submitter": "False", "link_id": "t3_txzu59", "parent_id": "t1_i3qel6e", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "colutea", "body": "Some universities require page numbers for the thesis to be able to check for plagiarism fast. I'd use the chapter number", "created_utc": "1649349989.0", "edited": "False", "id": "i3s6296", "is_submitter": "False", "link_id": "t3_tyb51n", "parent_id": "t1_i3r7u1i", "score": "2", "subreddit": "Onyx_Boox", "subreddit_id": "t5_11rfaa"}, {"author": "colutea", "body": "Transylvania in Romania. My parents are from there - my dad spoke German with his family and German sub-society and my mom Hungarian. But as a lingua franca everyone uses Romanian.\nYou also often see street signs in two languages. Either Hungarian & Romanian or German & Romanian", "created_utc": "1649057292.0", "edited": "1649071843.0", "id": "i3bqjpv", "is_submitter": "False", "link_id": "t3_tvp726", "parent_id": "t3_tvp726", "score": "10", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "colutea", "body": "Well, the chances that you as an unexperienced investor with probably little time will outperform the market in the long-term are pretty low. The investment firms are using their entire staff end resources to adjust - so you are playing against them. You can look up economic theories and long term effects and you'll see that in the long term, the market goes up and makes you wealthier. You can research concepts like compound interest, etc. from which you can benefit.\nThe thing about outperforming isn't to outperform it in 1 year or 2 years or 5 years, but in the long term. You are in your 20s now and will live at least another 50 years. So the odds are high, you won't outperform the market during the time span (unless you can put in a lot of time).\n\nDo it consistently and steadily - you'll get rewarded.", "created_utc": "1649022712.0", "edited": "1649023029.0", "id": "i39x8hv", "is_submitter": "False", "link_id": "t3_tvfbln", "parent_id": "t3_tvfbln", "score": "1", "subreddit": "stocks", "subreddit_id": "t5_2qjfk"}, {"author": "colutea", "body": "Same, auch Paar mit Mitte 20.", "created_utc": "1648050947.0", "edited": "False", "id": "i1t51fr", "is_submitter": "False", "link_id": "t3_tkpm7a", "parent_id": "t1_i1s2eg4", "score": "2", "subreddit": "FragReddit", "subreddit_id": "t5_2r6ca"}, {"author": "colutea", "body": "English: my job (without it would be impossible to work in tech)\n\nFrench: talk to my French friends, read and consume interesting content (politics, job-related things), (work for some time for a French company)...\n\nJapanese: talk to Japanese friends, read and consume interesting content (politics, job-related things), work some time in Japan (maybe), ...\n\nTbh, every new language increases what I learn from other people. Of course, there are Japanese people or French people who speak one of the other languages, but there is little chance, I would actually met them. Languages enable me to get out of my comfort zone. It enabled me to become more outgoing and confident.", "created_utc": "1647704246.0", "edited": "1647729911.0", "id": "i1ah85y", "is_submitter": "False", "link_id": "t3_thgkky", "parent_id": "t3_thgkky", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "colutea", "body": "Wanikani is a Kanji SRS", "created_utc": "1647469983.0", "edited": "False", "id": "i0y0ldn", "is_submitter": "False", "link_id": "t3_td8tw9", "parent_id": "t1_i0qwsxl", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "colutea", "body": "Kanji in Japanese. It takes a loot of time. I use Wanikani though but still, it's definitely a challenge", "created_utc": "1647192313.0", "edited": "False", "id": "i0ihihk", "is_submitter": "False", "link_id": "t3_td8tw9", "parent_id": "t3_td8tw9", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "colutea", "body": "I get it if you live in the country and either the other person doesn't speak English or you don't. It will be critical to communicate even if you only know a few words but sometimes these few words are already helping you to \n- visit a doctor\n- purchase something in a store\n- get sympathy from locals so they see you are trying\n\nA colleague who moved to Germany told me that her neighbor is a 75 year old man who cannot speak English. She was on vacation and he had accepted a package for her while she was gone. Once she came back, she needed to get the package and she said it was crucial for her to say sorry, explain the situation shortly and get her package. Also greeting people, asking how they are, etc. If you live alone and have no one you help you, just speaking a little will help.\nSo I get to pay a tutor to learn and practice these day to day situations - also to get less nervous about it.", "created_utc": "1647101297.0", "edited": "1647101483.0", "id": "i0dqjm1", "is_submitter": "False", "link_id": "t3_tc5qua", "parent_id": "t3_tc5qua", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "colutea", "body": "Idk if it is encouraging or not but my mom is an immigrant who came to Germany without knowing any German or English. She only spoke Hungarian and Romanian, two very unrelated languages.\nShe told me she went to a course for a few months or so but the key was to talk to a lot of people every day. She didn't use flashcards or did other dedicated study after class, but since my dad was working all day, she needed to get around. So she tried talking and communicating and well, she is completely fluent now. I mean, she still sometimes messes up der/die/das and  sometimes the written grammar is a little off, but in most of the cases, you cannot notice it.\nSo, immersion is key and the second thing is, don't be afraid to make mistakes. You'll make many of them, but they get less and less", "created_utc": "1646866624.0", "edited": "False", "id": "i019jlt", "is_submitter": "False", "link_id": "t3_taebsf", "parent_id": "t3_taebsf", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "colutea", "body": "Same, also a lot of üs", "created_utc": "1646435404.0", "edited": "False", "id": "hzdpyz8", "is_submitter": "False", "link_id": "t3_t6p1db", "parent_id": "t1_hzcl65w", "score": "8", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "colutea", "body": "Try to start with easier books then: https://tadoku.org/japanese/en/free-books-en/\nStart with level 0 here and work your way upwards. After level 2 you should be comfortable enough to read Yotsubato.\nThe linked books are not manga but they get you into reading", "created_utc": "1645884220.0", "edited": "False", "id": "hyijmtd", "is_submitter": "False", "link_id": "t3_ssgxwc", "parent_id": "t1_hycsw9v", "score": "1", "subreddit": "LearnJapanese", "subreddit_id": "t5_2qyls"}, {"author": "colutea", "body": "https://video.twimg.com/ext_tw_video/1367173824194760708/pu/vid/720x1280/UcBL9TjciAWF_2hu.mp4?tag=10\n\nOn my Boox Poke 3 :)", "created_utc": "1645652001.0", "edited": "False", "id": "hy5jp9g", "is_submitter": "False", "link_id": "t3_szlemx", "parent_id": "t1_hy486xp", "score": "2", "subreddit": "ereader", "subreddit_id": "t5_2qwmn"}, {"author": "colutea", "body": "There is a new maintainer now. I actually opened a bug there and after (s)he looked at the logs, they found out that the plugin is not the issue but the Calibre viewer...  \nSo for me, I can't open the book in Calibre and got the error produced above. Apple Books showed the book as empty pages.  \nHowever, unzipping the decrypted file with the command \"unzip book.epub\" I got all the contents and each individual image of the manga.  \nSo in the end it's a Calibre bug, not a DeDRM bug.  \n\n\n\\--------------------------\n\nIdk if the story there about the original maintainer is true; in the end, I find it unfair. I mean, if the shop closes where I buy the book (e.g. let's say in 10 years from now Kobo is closed and they take all the books down), I can't use the content anymore which I purchased.   \nBut: The author got paid, the seller got their share, so there is no harm if the buyer removes the DRM for personal use only.   \nI mean, I get it for library content. I also would never use the plugin for that. But for purchased content, this is just a way of vendors of locking buyers into their ecosystem with the excuse of saying that people are gonna re-upload it somewhere else if the book would be \"free\". \n\nI really like the solution some book sellers in my country started to use for purchased content - digital watermarks: [https://goodereader.com/blog/e-book-news/everything-you-need-to-know-about-social-drm-for-ebooks](https://goodereader.com/blog/e-book-news/everything-you-need-to-know-about-social-drm-for-ebooks)  \nIf the content is shared, they see who initially uploaded it but as a user, you can still use your book as any other digital file and read it in every reader you want, forever, without being locked to a certain reader app and vendor.", "created_utc": "1645394084.0", "edited": "False", "id": "hxr758o", "is_submitter": "True", "link_id": "t3_swi63d", "parent_id": "t1_hxqvry6", "score": "1", "subreddit": "Calibre", "subreddit_id": "t5_2tb43"}, {"author": "colutea", "body": "I tried to contact the current maintainer of the DeDRM tools and let's see if they're gonna fix it. If I don't get a response within some time, I am gonna try Epubor. I'll update the start post if it gets fixed.\n\nOff-topic: I wish, all publishers would just stop using DRM, it'll make everyone's life easier. Like, I don't want to share the book with anyone else, I just like to use my favorite reader software, that's it. People who want to pirate it do it anyway - so why blame the users who just want to enjoy their content. That is another discussion though", "created_utc": "1645375430.0", "edited": "False", "id": "hxpy5oc", "is_submitter": "True", "link_id": "t3_swi63d", "parent_id": "t1_hxn7wea", "score": "1", "subreddit": "Calibre", "subreddit_id": "t5_2tb43"}, {"author": "colutea", "body": "Yes, also the new immersion stories they added are very useful as well", "created_utc": "1645362499.0", "edited": "False", "id": "hxp6pv0", "is_submitter": "False", "link_id": "t3_swyg8k", "parent_id": "t1_hxp314g", "score": "3", "subreddit": "LearnJapanese", "subreddit_id": "t5_2qyls"}, {"author": "colutea", "body": "I tried the trial of epubor but it only gave me one page with: \"this is a trial\" even though they said it should be 25% of the book.\nSo I am afraid that it won't work either 😐", "created_utc": "1645315710.0", "edited": "False", "id": "hxn4xww", "is_submitter": "True", "link_id": "t3_swi63d", "parent_id": "t1_hxn2s5x", "score": "1", "subreddit": "Calibre", "subreddit_id": "t5_2tb43"}, {"author": "colutea", "body": "It is Death Note (first volume) in Japanese. I already tried re-downloading it. I even tried to make it work in a Windows virtual machine and the Windows Calibre version. I got the same error.", "created_utc": "1645303903.0", "edited": "False", "id": "hxmer7r", "is_submitter": "True", "link_id": "t3_swi63d", "parent_id": "t1_hxmc6q2", "score": "1", "subreddit": "Calibre", "subreddit_id": "t5_2tb43"}, {"author": "colutea", "body": "For converting, you can try Calibre", "created_utc": "1645296266.0", "edited": "False", "id": "hxlwhdy", "is_submitter": "False", "link_id": "t3_swe3hk", "parent_id": "t1_hxlkaxf", "score": "3", "subreddit": "LearnJapanese", "subreddit_id": "t5_2qyls"}, {"author": "colutea", "body": "Jodel is basically a German anonymous Twitter", "created_utc": "1645219740.0", "edited": "False", "id": "hxhymyg", "is_submitter": "False", "link_id": "t3_svh08m", "parent_id": "t3_svh08m", "score": "8", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "colutea", "body": "I second this, I have a very similar story with Hungarian. Also until the age of 6 or 7 or sth and then lost it. At the age of 24 now, I can't understand anything anymore. If you don't use it, you'll lose it. I also feel like \"if you know it once, relearning is easier\" is not necessarily true. As a child, the means of expression are very limited so there is not much that can come back.", "created_utc": "1645218035.0", "edited": "False", "id": "hxhubv5", "is_submitter": "False", "link_id": "t3_svlxkg", "parent_id": "t1_hxgxxc8", "score": "5", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "colutea", "body": "I can recommend to get digital books from Kobo also. Especially if you plan reading them on an ereader and need an ePub as unfortunately, neither Bookwalker or Honto provides that. From Kobo you can download the files easily", "created_utc": "1645108211.0", "edited": "False", "id": "hxb7rdy", "is_submitter": "False", "link_id": "t3_sui4ep", "parent_id": "t1_hxa6h0j", "score": "2", "subreddit": "LearnJapanese", "subreddit_id": "t5_2qyls"}, {"author": "colutea", "body": "I second Yotsubato. And Shirokuma Cafe", "created_utc": "1644867885.0", "edited": "False", "id": "hwy2v49", "is_submitter": "False", "link_id": "t3_ssgxwc", "parent_id": "t1_hwxwaa0", "score": "6", "subreddit": "LearnJapanese", "subreddit_id": "t5_2qyls"}, {"author": "colutea", "body": "I am learning Japanese and French. I doubt I'll work or live there anytime soon, so it's fun. That's why I also don't get stressed about getting certified or sth, as the only language I need for my job is English (I work in the tech sector).", "created_utc": "1644867819.0", "edited": "False", "id": "hwy2p50", "is_submitter": "False", "link_id": "t3_ss846r", "parent_id": "t3_ss846r", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "colutea", "body": "Here you go: https://help.boox.com/hc/en-us/articles/360045388371-How-to-activate-the-Google-Play-", "created_utc": "1644781649.0", "edited": "False", "id": "hwtef8c", "is_submitter": "False", "link_id": "t3_srpt36", "parent_id": "t3_srpt36", "score": "2", "subreddit": "Onyx_Boox", "subreddit_id": "t5_11rfaa"}, {"author": "colutea", "body": "In my school in Germany: English, French, Latin, ancient Greek, Spanish", "created_utc": "1644694498.0", "edited": "False", "id": "hwolb1j", "is_submitter": "False", "link_id": "t3_sqtos7", "parent_id": "t3_sqtos7", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "colutea", "body": "No, it's for informal situations. In an interview you need to use Keigo :)", "created_utc": "1644667852.0", "edited": "False", "id": "hwmxhhc", "is_submitter": "False", "link_id": "t3_sqpm7e", "parent_id": "t3_sqpm7e", "score": "0", "subreddit": "LearnJapanese", "subreddit_id": "t5_2qyls"}, {"author": "colutea", "body": "You may try to install Koreader on your phone and eReader: https://github.com/koreader/koreader/wiki/Progress-sync\nOr try sth like this: https://github.com/fsantini/KoboCloud\nSorry, was wrong, the uploading books feature apparently does not exist on Kobo. I confused Kobo with sth else. But maybe the solutions from the links above work", "created_utc": "1644662609.0", "edited": "1644662989.0", "id": "hwmpp2m", "is_submitter": "False", "link_id": "t3_sqaxg7", "parent_id": "t1_hwkj6nu", "score": "1", "subreddit": "ereader", "subreddit_id": "t5_2qwmn"}, {"author": "colutea", "body": "What do you mean by emulating the Amazon ecosystem? Do you like to just have one app where your books are in sync?\nYou could e.g. upload the books to Kobo and use the Kobo app to read on your phone and Kobo eReader.\nIf you dislike Kobo, Pocketbook allows also uploading, then you can use a Pocketbook eReader alongside your phone which has the Pocketbook app installed.\nKobo and Pocketbook aren't android based but the device  are solely for reading which might give you the distraction-free experience you may like on Kindle.\nYou have to create an account there to start the syncing, though\n\nIf you dislike both, you can get a Boox eReader (e.g. the Poke 3, it's android-based), upload the books to Google Play books and install the app on the eReader and your phone.\n\nThat said, why don't you buy a Kindle if you like the ecosystem? On Project Gutenberg you can also download the books in the MOBI format which works on Kindle as well.", "created_utc": "1644618441.0", "edited": "False", "id": "hwkeozm", "is_submitter": "False", "link_id": "t3_sqaxg7", "parent_id": "t3_sqaxg7", "score": "3", "subreddit": "ereader", "subreddit_id": "t5_2qwmn"}, {"author": "colutea", "body": "Does he read colorful manga or only B/w ones?", "created_utc": "1644617879.0", "edited": "False", "id": "hwkd85j", "is_submitter": "False", "link_id": "t3_sqazbg", "parent_id": "t3_sqazbg", "score": "1", "subreddit": "ereader", "subreddit_id": "t5_2qwmn"}, {"author": "colutea", "body": "As a woman, my experience with this kind of apps has been pretty bad... every second request is from a man who wants to find love. On Tandem, etc. I can at least write with people beforehand but I don't like that people can just call me.\nOn the other hand, if there is a chat option beforehand, only 5% want to have calls and out of those, only 1/3 actually continue over a longer period of time...", "created_utc": "1644515025.0", "edited": "False", "id": "hwe6w6k", "is_submitter": "False", "link_id": "t3_sp8ehd", "parent_id": "t3_sp8ehd", "score": "92", "subreddit": "LearnJapanese", "subreddit_id": "t5_2qyls"}, {"author": "colutea", "body": "I reached this level by working in said language (English) and reading/writing lots and lots of academic articles. I'd say academic language might be another league, though 🙈", "created_utc": "1644251980.0", "edited": "False", "id": "hvynupr", "is_submitter": "False", "link_id": "t3_smblnh", "parent_id": "t3_smblnh", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "colutea", "body": "iPhone 11, iOS 15.3\nOccured after the update. Hard-reset and restart of the phone didn't help. Enabling and disabling memojis also had no effect.\nAs you can see in the screenshots, only half of the unicorns are affected.\nThese are very creepy but I have no idea what else to try to make them go away.", "created_utc": "1644165649.0", "edited": "False", "id": "hvttybd", "is_submitter": "True", "link_id": "t3_slt8iw", "parent_id": "t3_slt8iw", "score": "1", "subreddit": "applehelp", "subreddit_id": "t5_2rfbh"}, {"author": "colutea", "body": "I have the same problem and I started paying iTalki tutors for that. It helps a lot, they don't make fun of you and they are available when you need to. Plus, you get a lot of tips on how to start a conversation. It helped me also in my native language since some of the techniques work universally", "created_utc": "1644151134.0", "edited": "False", "id": "hvszpst", "is_submitter": "False", "link_id": "t3_sluynh", "parent_id": "t3_sluynh", "score": "21", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "colutea", "body": "Maybe you might want to try this: A Japanese Reader: Graded Lessons for Mastering the Written Language: Graded Lessons in the Modern Language (Tuttle Language Library)\nIt goes from extremely easy to very difficult", "created_utc": "1644087997.0", "edited": "False", "id": "hvqapal", "is_submitter": "False", "link_id": "t3_sl83f1", "parent_id": "t3_sl83f1", "score": "1", "subreddit": "LearnJapanese", "subreddit_id": "t5_2qyls"}, {"author": "colutea", "body": "My company uses eInk displays for showing the meeting room and I didn't notice any weird issues. I mean when you buy an eReader, the lockscreen also shows sth for hours when it's shutdown.\nMaybe you might wanna use a cheap eInk display if it's mainly just for showing some info? \nE.g. this one is programmable and costs only € 42.\n\nhttps://www.berrybase.de/sensoren-module/displays/epaper-displays/4-2-zoll-gro-223-es-passiv-nfc-gespeistes-e-paper", "created_utc": "1643887586.0", "edited": "False", "id": "hveo8x6", "is_submitter": "False", "link_id": "t3_sjdk3w", "parent_id": "t3_sjdk3w", "score": "1", "subreddit": "ereader", "subreddit_id": "t5_2qwmn"}, {"author": "colutea", "body": "I probably would due to the Page Turn buttons. They look convenient to just turn the page with one hand as well...\nRegarding the software experience, I guess, it'll be the same on all boox devices", "created_utc": "1643823561.0", "edited": "False", "id": "hvawf2p", "is_submitter": "False", "link_id": "t3_simi8h", "parent_id": "t1_hvauwtq", "score": "1", "subreddit": "ereader", "subreddit_id": "t5_2qwmn"}, {"author": "colutea", "body": "Can confirm. Forgot my first \"native\" language Hungarian as a kid as I stopped using it after I started school. I know that I was able to speak it due to video recordings talking with my mother in it.\nI don't understand anything people are talking to me in it. I hear though if someone who speaks it has a foreign accent in it or pronounces anything wrong 😅 it's like my brain knows how it is supposed to sound but I can't tell what it means.\nThe only things I know are some random words, lyrics of children songs and that's it. I can also read and pronounce properly the words but I don't understand their meaning. Reading I learnt at the age of 4 as taught by my mom mainly in Hungarian. \n\n I will probably have a hard time learning grammar as everyone else. The only thing where I might have an advantage is pronunciation but that's it.\n\nIt probably also depends on at which age you stopped. The younger you were when you stopped, the harder it will be to re-learn.\nE.g. a 6 year old doesn't use the kind of grammar a 10 year old does", "created_utc": "1643822927.0", "edited": "False", "id": "hvauoo0", "is_submitter": "False", "link_id": "t3_si3ffu", "parent_id": "t1_hv6fgc2", "score": "1", "subreddit": "LearnJapanese", "subreddit_id": "t5_2qyls"}, {"author": "colutea", "body": "You can upload screenshots to the Google Translate app.", "created_utc": "1643822323.0", "edited": "False", "id": "hvat07a", "is_submitter": "False", "link_id": "t3_sipbp4", "parent_id": "t1_hv9ybhr", "score": "1", "subreddit": "LearnJapanese", "subreddit_id": "t5_2qyls"}, {"author": "colutea", "body": "I have the Poke since I didn't need the note taking function since I have an iPad for that. Back then, the leaf wasn't on the market.\nI thought that a simpler device is better as I assumed that the extra Wacom layer might make the text less sharp but I don't have a Nova for comparison.\nI love how small it is as I read in bed and I can hold it with one hand.\nI read novels or non-fiction books on it. For scientific papers and manga I choose my iPad.", "created_utc": "1643821322.0", "edited": "False", "id": "hvaq9sv", "is_submitter": "False", "link_id": "t3_simi8h", "parent_id": "t3_simi8h", "score": "1", "subreddit": "ereader", "subreddit_id": "t5_2qwmn"}, {"author": "colutea", "body": "Maybe an eInk monitor might be the solution? You can connect it with your computer and use any application you want. I feel like the Poke 3 is too small for productivity apps", "created_utc": "1643628299.0", "edited": "False", "id": "huzbz4o", "is_submitter": "False", "link_id": "t3_sgjjh4", "parent_id": "t3_sgjjh4", "score": "1", "subreddit": "Onyx_Boox", "subreddit_id": "t5_11rfaa"}, {"author": "colutea", "body": "For academic reading, I recommend an iPad or any other non-eInk device with at least 10\".\nIf a book has colors, black and white will annoy you. Most academic literature doesn't have color, but if one has it, there's a reason for it (e.g. graphs, etc.).\nPlus, with a tablet and stylus you can annotate in different colors. Also, as some conferences also do 2-column layouts with small text, you might need to zoom a lot and such interactions aren't fun on eInk due to the lag.\nI also studied CS for 5 years and I loved my iPad. Laptop was for programming, etc. and iPad for lectures, reading, etc.", "created_utc": "1643566166.0", "edited": "False", "id": "huvpn5f", "is_submitter": "False", "link_id": "t3_sg92km", "parent_id": "t3_sg92km", "score": "1", "subreddit": "ereader", "subreddit_id": "t5_2qwmn"}, {"author": "colutea", "body": "For scientific journals, you need a big screen. I use my 11\" iPad (with Paperpile) for that as I can annotate in color and it is very snappy. \n\nHowever, for purely reading books that aren't PDF I have a Boox Poke 3 which is very comfortable since I can read from anywhere (Amazon, Rakuten, Libby, ...)", "created_utc": "1643451614.0", "edited": "False", "id": "hupdsoo", "is_submitter": "False", "link_id": "t3_sfbla4", "parent_id": "t3_sfbla4", "score": "2", "subreddit": "ereader", "subreddit_id": "t5_2qwmn"}, {"author": "colutea", "body": "My vision essentially. My eyesight gets worse by each year and looking at tiny letters in a physical book is tiring. Plus, at night, I find it better if the light is dimmed and I can just use the eReader light.\nAnother plus for me is that I can look words up easily. I read often in foreign languages and if I don't know a word, I see the definition just by tapping on it and I don't need to type it into my phone.\nLastly, when travelling, I only have to carry one device and I got all my books with me so I don't run out of sth to read.\n(and my bookshelf is completely full. I already started putting 2 rows of books in front of each other)", "created_utc": "1643405129.0", "edited": "False", "id": "humxhp5", "is_submitter": "False", "link_id": "t3_seeleu", "parent_id": "t3_seeleu", "score": "1", "subreddit": "ereader", "subreddit_id": "t5_2qwmn"}, {"author": "colutea", "body": "For me, Furigana overlaps with the text though using the V2 engine", "created_utc": "1642972253.0", "edited": "False", "id": "htxgy6s", "is_submitter": "False", "link_id": "t3_r7orwy", "parent_id": "t1_htw01uk", "score": "1", "subreddit": "Onyx_Boox", "subreddit_id": "t5_11rfaa"}, {"author": "colutea", "body": "Well, with astigmatism the focal point of the light is not on the retina but before or behind, there are also several forms of it. Long story short, this \"defect\" may have an effect on how you perceive light, you might see it scattered. There are people who say they have more difficulties in the night as they might see glare and the halo effect. \nWhen the lightning is low, the pupil dilates so more light comes in so your blur might get worse.\n\nCorrection for sure improves the condition, but as for me, there are days when wearing glasses helps a bit and other days it does not. However, I always see some type of blur in dark mode. But also, my condition is one of the more severe. I also see it slightly in light mode but not as much. On paper or eInk I don't have any issues.\n\nAs people are different, you need to try what works and not. I just wanted to highlight that darkmode isn't the answer for everyone.", "created_utc": "1642376961.0", "edited": "False", "id": "hsyvueu", "is_submitter": "False", "link_id": "t3_s4uyuu", "parent_id": "t1_hsx5ht9", "score": "1", "subreddit": "ereader", "subreddit_id": "t5_2qwmn"}, {"author": "colutea", "body": "If you have astigmatism (1/3 of the population does), darkmode might be very hard to read.\nHere is a link that also have some example pictures. https://medium.com/@h_locke/why-dark-mode-causes-more-accessibility-issues-than-it-solves-d2f8359bb46a\n\nFor example, I have it and even though with glasses, white text on a dark background has a halo effect and is blurred. I don't have the issue with dark text on a white background.", "created_utc": "1642328438.0", "edited": "False", "id": "hsvwhf8", "is_submitter": "False", "link_id": "t3_s4uyuu", "parent_id": "t1_hsujgge", "score": "1", "subreddit": "ereader", "subreddit_id": "t5_2qwmn"}, {"author": "colutea", "body": "I bought my Poke 3 a year ago and I didn't have the screen issue", "created_utc": "1641929418.0", "edited": "False", "id": "hs8wnww", "is_submitter": "False", "link_id": "t3_rqcst6", "parent_id": "t1_hqaadxq", "score": "2", "subreddit": "Onyx_Boox", "subreddit_id": "t5_11rfaa"}, {"author": "colutea", "body": "I got to Business and academic level English just by immersion. But also a looot of talking. I started at an English speaking company and got my English up from a solid B2 to a certified C1/C2 without Anki, etc.\nIf you want to improve and get to advanced but you cannot find a company/are too young/... I'd suggest to look for advanced material like Ted talks, Nonfiction, Science (e.g. nature.com)... on various topics. \nProgress might feel slow, but that doesn't mean, it's not there. \n\nFor expression: Speaking and Writing are separate skills. While you can get a good grasp of what \"sounds correct\" by immersion, you'll need to talk to talk better and write to write better. There are various sites to find language partners to practice speaking as well as sites like journaly.com to get corrections on written texts. Do that regularly and you'll get better.\n\nIf you worry about \"that your English should be perfect\" before applying anywhere: that's not true. While you should be able to communicate spontaneously and in a clear manner (your text seems mostly alright), most companies won't care if you make some mistakes or have an accent as long you can understand it without any effort. Find a language partner to practice and you'll see whether they have issues to understand you or not.\n\nRegarding the \"when to start Japanese\" part. Do it whenever you have the time. If you only have 30 min a day fot practicing, I wouldn't start but if you have 2 hours, go for it. 1 h English,1 h Japanese,... both languages are very distinct from another, so probably, you won't mess them up. I wouldn't start another language if you aren't at least intermediate in the one you started first. If you have a good foundation (which you apparently have), I don't see any issues. \n\nP.S. Don't apologize for your English and say it's bad. If you make mistakes, it's not a problem, you'll get better.", "created_utc": "1641403869.0", "edited": "1641404086.0", "id": "hrdnbzj", "is_submitter": "False", "link_id": "t3_rv3ffy", "parent_id": "t3_rv3ffy", "score": "1", "subreddit": "Refold", "subreddit_id": "t5_3azein"}, {"author": "colutea", "body": "I had around 4 teachers in French untio I found one to make a curriculum and raise the level. With Japanese, the third teacher I tried made one. When using iTalki, you need to be spend some time to find a suitable person. But once you did, it pays off.", "created_utc": "1640631837.0", "edited": "False", "id": "hq6gkhr", "is_submitter": "False", "link_id": "t3_rpd7th", "parent_id": "t1_hq45cdh", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "colutea", "body": "You can use the shadowing technique to get rid of your accent. By that, you'll get some French audio and hear a sentence. Stop and repeat it. Do that over some period of time. You can also record yourself and compare the recording with the audio to catch all the unnatural sounds.", "created_utc": "1640630153.0", "edited": "False", "id": "hq6cel0", "is_submitter": "False", "link_id": "t3_rpq1oe", "parent_id": "t3_rpq1oe", "score": "5", "subreddit": "French", "subreddit_id": "t5_2rd5t"}, {"author": "colutea", "body": "Danke dir. Dann mach ich das genauso wie du und leg einfach den Kontoauszug bei und schau mal, was die sagen.", "created_utc": "1640186577.0", "edited": "False", "id": "hpkcfet", "is_submitter": "False", "link_id": "t3_rm6s4i", "parent_id": "t1_hpkadua", "score": "1", "subreddit": "Finanzen", "subreddit_id": "t5_35m5e"}, {"author": "colutea", "body": "Bei mir steht da auch 0 bei Net Income, aber beim Account Value kann man ja die Zinsen auslesen. Da sieht man dann dass da ein Differenz-Betrag zustande kam", "created_utc": "1640185337.0", "edited": "False", "id": "hpk9lqy", "is_submitter": "False", "link_id": "t3_rm6s4i", "parent_id": "t1_hpk9bzh", "score": "1", "subreddit": "Finanzen", "subreddit_id": "t5_35m5e"}, {"author": "colutea", "body": "Hast du dann die Anlage KAP gar nicht beigelegt?", "created_utc": "1640185152.0", "edited": "False", "id": "hpk972a", "is_submitter": "False", "link_id": "t3_rm6s4i", "parent_id": "t1_hpk8mru", "score": "1", "subreddit": "Finanzen", "subreddit_id": "t5_35m5e"}, {"author": "colutea", "body": "I also have a Poke 3. It works like a charm", "created_utc": "1638892313.0", "edited": "False", "id": "hnlsnei", "is_submitter": "False", "link_id": "t3_rawqb6", "parent_id": "t1_hnlk643", "score": "4", "subreddit": "ereader", "subreddit_id": "t5_2qwmn"}, {"author": "colutea", "body": "I cannot talk about Japanese as I am only studying towards N3 rn but I got to an advanced professional English level (C1/C2) without using Anki at all but I learnt with other vocab memorization techniques  before. The key is massive exposure. I stopped learning vocab actively after B2 and I bridged the B-C gap just by immersion and active use of the language in my daily life and at work. I also read a lot of books. That shouldn't be taken for granted, I have a lot of friends who lost their English skills as they stopped at all and only used it occasionally. If you manage to integrate Japanese in your daily life and constantly aiming for more difficult material, I think you won't need to rely on Anki at some point after around B2 from my experience.\nI use CEFR and not JLPT here intentionally as JLPT does barely measure active production. \nHere is a self-assessment grid to gauge one's level in the CEFR framework https://rm.coe.int/CoERMPublicCommonSearchServices/DisplayDCTMContent?documentId=090000168045bb52\n\nHowever, if for any reason you can't integrate it well, Anki might be helpful in later stages as well probably. With integration I mean everything - active as well as passive usage.", "created_utc": "1637622913.0", "edited": "1637623514.0", "id": "hlp84kn", "is_submitter": "False", "link_id": "t3_qzna9q", "parent_id": "t1_hlndfbt", "score": "2", "subreddit": "LearnJapanese", "subreddit_id": "t5_2qyls"}, {"author": "colutea", "body": "Japanese is my fourth language and I did not see any negative impact at all on the other three. I was still able to improve them even but I use each of them every day. Don't worry, you'll be fine as long as you don't stop using English at all", "created_utc": "1637501615.0", "edited": "False", "id": "hlia2fy", "is_submitter": "False", "link_id": "t3_qxdm8v", "parent_id": "t3_qxdm8v", "score": "1", "subreddit": "LearnJapanese", "subreddit_id": "t5_2qyls"}, {"author": "colutea", "body": "Why not on a resume? E.g. if you worked for an English-speaking company for 20 years but never taken any exam, you can write for sure that your level is advanced. I mean, if one would write A2 only because they have never tried an official exam does not make them less competent in a language.\nHowever, rather than writing C2 people could think about using other terms like “fluent“/“professional“ related also to the levels one can select on LinkedIn or similar job platforms.\n\nI mean if one lies for a job and the job requires the skill, they will switch the language accordingly and if the person has gaps or problems, they‘ll be exposed. Or if they already make many mistakes in their resume.", "created_utc": "1636120649.0", "edited": "1636120904.0", "id": "hjeyp9n", "is_submitter": "False", "link_id": "t3_qmqsaw", "parent_id": "t1_hjcousd", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "colutea", "body": "Zählen die das schon als Defekt? Weil sonst funktioniert alles - keine toten Pixel, etc.", "created_utc": "1632600221.0", "edited": "False", "id": "he9d7w0", "is_submitter": "True", "link_id": "t3_pve8xz", "parent_id": "t1_he9cfo1", "score": "-2", "subreddit": "de", "subreddit_id": "t5_22i0"}, {"author": "colutea", "body": "Idk if I am C2 or not since I only have a certificate of C1/C2 and never tried a C2 Test but I use English daily for work as well as in university (writing & reading papers) and I’d say my comprehension is the same as it is with my Native language.\nI don’t know all of the words but neither do I understand 100% of my Native language either. \nThere are some words which I only know in my Native language and some I only know in English but I have no idea how to translate them well so I use the English one all the time. \n\nFor me, the biggest gap is not the language itself but the culture and experience. For example, children songs, etc. I grew up with different movies, different songs, etc. than a person whose Native language English is would.\n\nC2 doesn’t mean you will become a Native nor do Natives fit into the assessment grid. For example, let’s say there is someone in the US who didn’t do well in school and makes a lot of mistakes - this person might have less skills than a C2 learner has - but they are still a Native. \nA 5-year-old is also still a Native. That's why I also think that comparing language learners to Natives doesn’t make much sense as \"Native speaker\" alone does not determine your language ability.", "created_utc": "1631466951.0", "edited": "False", "id": "hcl1d8z", "is_submitter": "False", "link_id": "t3_pmdmq0", "parent_id": "t3_pmdmq0", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "colutea", "body": "I have an Android ebook reader (Boox Poke 3) where I can use all the apps I want. \nFor example, I can buy my Japanese books either via the Kindle app or via Rakuten or BookWalker, etc.\nSince it’s Android you can use any dictionary you want. \n\nAbout the ability to save sentences and Furigana - I know that there is the Android app Satori reader. I didn’t use it but it has many good reviews. However, I am not sure if it is only limited to the articles available there or if you can upload your own as well. But I guess about the finding an Android app which can do that-part is more of a question for /r/LearnJapanese \n\nI had a Kindle before but you have to decide between Amazon JP and Amazon US/FR/DE/…\nand you can’t use both simultaneously and not all Japanese books I was looking for were available for Kindle but in other shops - which was one of the main reasons why I chose an eReader with a flexible OS.", "created_utc": "1631465195.0", "edited": "1631465625.0", "id": "hckx2gm", "is_submitter": "False", "link_id": "t3_pmmxpw", "parent_id": "t3_pmmxpw", "score": "1", "subreddit": "ereader", "subreddit_id": "t5_2qwmn"}, {"author": "colutea", "body": "It’s not available on Amazon but via their shop https://shop.boox.com/products/poke2-poke3", "created_utc": "1631396381.0", "edited": "False", "id": "hchgizm", "is_submitter": "False", "link_id": "t3_pi85n0", "parent_id": "t1_hbr36j8", "score": "1", "subreddit": "ereader", "subreddit_id": "t5_2qwmn"}, {"author": "colutea", "body": "You can do that on Boox E-Readers. I have one - when you set it to Speed Mode, the refresh rate adjusts. You get more ghosting but for video it’s ideal.\n\nhttps://streamable.com/hkwn2b\nHere is a video from YouTube playing on my Poke 3 (sorry for the video resolution, it’s compressed)", "created_utc": "1630885582.0", "edited": "False", "id": "hbqwa0y", "is_submitter": "False", "link_id": "t3_pi85n0", "parent_id": "t3_pi85n0", "score": "1", "subreddit": "ereader", "subreddit_id": "t5_2qwmn"}, {"author": "colutea", "body": "I dont know Nakama but Wanikani is great. But read the guides on the website to not get too stressed from it.\nFor example: https://community.wanikani.com/t/how-to-build-an-efficient-wanikani-schedule-level-up-as-comfortable-as-possible-the-guide/43935", "created_utc": "1625765591.0", "edited": "False", "id": "h4hvj3p", "is_submitter": "False", "link_id": "t3_ogay1d", "parent_id": "t3_ogay1d", "score": "3", "subreddit": "LearnJapanese", "subreddit_id": "t5_2qyls"}, {"author": "colutea", "body": "I don't do it unless I am in the country where the language is spoken or I know the person and I am 100% sure she/he likes to speak the language and is able to (like hearing them speaking it in public, etc.)\n\nI have a Hungarian name and when I started at my company years ago, people started talking to me in Hungarian based on my name. The problem is, while my mother is from there I don’t know the language and hence did not understand anything. This led to awkward silence and well, it’s not the first time it happened and when I was younger and I had less self-confidence it actually put me in some identity crisis 😅 as you have to explain the whole story always and I get it’s curiosity but if you hear this curiosity too often, for me, I got the feeling I somehow don’t belong here. \nIdk, I don’t want to put other people in a position like this, so I don’t talk to them in that language unless \na) I am 100% they know the language \nb) I know said language well enough as well (so it is clear that I am just happy to talk but don’t want them as teachers)\nc) i know the person, so then I would go to mention I learn it as well when we talk about language learning and then only eventually switch.\n\nMy parents are different, my mom when she hears someone talking Hungarian she directly talks to them but idk, she is a native speaker and not someone with beginner/intermediate skills so it’s kind of another situation.\n\nIt’s nice to hear that many people made good experience with talking to others in their area in their target language but I am more hesitant (from a personality view as well, I usually don’t talk to strangers much).", "created_utc": "1624893606.0", "edited": "False", "id": "h3bulk3", "is_submitter": "False", "link_id": "t3_o949x1", "parent_id": "t3_o949x1", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "colutea", "body": "I would buy Genki as well. The dictionary is only a dictionary and therefore for reference if you need a more detailed explanation. Genki has also exercises to practice grammar (and vocabulary, Kanji & reading)", "created_utc": "1624706898.0", "edited": "False", "id": "h33hsd5", "is_submitter": "False", "link_id": "t3_o867a0", "parent_id": "t1_h33ho8b", "score": "1", "subreddit": "LearnJapanese", "subreddit_id": "t5_2qyls"}, {"author": "colutea", "body": "I think one or two of those might already be enough. Each book will take you a while to get through. \nOut of those, I would probably only buy Genki 2 and the dictionary of basic Japanese grammar as it explains points more in detail. And you can use Genki to practice them.\nIf you buy too many books at once, you get overwhelmed and won’t finish either of them.\n\nThe dictionary of Japanese grammar has all the content which is in Tae Kim and also explains the particles as well. Tae Kim is btw also available for free online (http://www.guidetojapanese.org/learn/)", "created_utc": "1624706673.0", "edited": "False", "id": "h33hj8r", "is_submitter": "False", "link_id": "t3_o867a0", "parent_id": "t3_o867a0", "score": "3", "subreddit": "LearnJapanese", "subreddit_id": "t5_2qyls"}, {"author": "colutea", "body": "The first sentence means that you are coming from France whereas the second means origin, like you were born there. The first one could be used for the same purpose as well but does not mean necessarily birthplace.\n\nLike the others said, for Japanese, Duolingo is not the best resource.", "created_utc": "1624347453.0", "edited": "False", "id": "h2mng04", "is_submitter": "False", "link_id": "t3_o5apdn", "parent_id": "t3_o5apdn", "score": "2", "subreddit": "LearnJapanese", "subreddit_id": "t5_2qyls"}, {"author": "colutea", "body": "I am doing it as a hobby, too, nevertheless I would like to get to a high level and become proficient in it, even though I will probably never use it for a job, etc.\nAnd to achieve that, I don’t neglect Kanji.\nBut it’s fine since everyone has different goals", "created_utc": "1624270920.0", "edited": "False", "id": "h2itqvd", "is_submitter": "False", "link_id": "t3_o43ysv", "parent_id": "t3_o43ysv", "score": "1", "subreddit": "LearnJapanese", "subreddit_id": "t5_2qyls"}, {"author": "colutea", "body": "I would not recommend it. I used it for French and as the teachers vary for practically every class, the quality does also.\nThe cancellation policy is strict as well, you have to cancel 7 days in advance. If you get sick, well, you have an issue.\nAlso the material is quite repetitive. I got bored of it after 20 classes. \nI moved then to private classes on italki, they cost the same but I have a teacher who knows me and can tailor the class to my needs.", "created_utc": "1624095680.0", "edited": "False", "id": "h2b4eoh", "is_submitter": "False", "link_id": "t3_o3aycr", "parent_id": "t3_o3aycr", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "colutea", "body": "Similar story with me and Hungarian. However, I forgot also the passive skills. \nI spoke without any issues when I was 4,5 or 6. My dad loved filming everything so I have a proof of it 😅\n\nWhen I started school, people said that it is harmful to grow up bilingual and my parents should only focus on one (the language of the country = German). They told this every kid whose parents aren’t from Germany, I had a Russian classmate, he had the same issue. (I was top in class, did not have any issues with German but it was a policy back then)\nLong story short, my mother who was worried about my future stopped talking Hungarian with me, since at that time she also got in a fight with her family and in that area weren’t many Hungarians, so I basically stopped Hungarian entirely. I also did not say sth against at that time, since it didn’t feel normal to have parents who aren’t from here.\n\n20 years later, if someone now speaks Hungarian with me, I only pick up a few phrases but don’t understand 95% of it. \nI also rewatched a video of 4-year-old me talking for 10 minutes with a chicken in Hungarian and I have no clue what I am saying. \nI needed my mom to translate MY OWN WORDS 😅\n\n*However, I am able to pronounce things perfectly if I learn a new phrase and I can also read texts (my mom taught me how to read in Hungarian first) but I have no clue what the text says. I guess my muscle memory remembers how to do the sounds but my brain can’t remember the meanings anymore.", "created_utc": "1624095296.0", "edited": "False", "id": "h2b40uk", "is_submitter": "False", "link_id": "t3_o2xi65", "parent_id": "t1_h298e0e", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "colutea", "body": "That was the reason why I chose to learn Japanese over Chinese first. \nJapanese has the pitch accent obviously also but at that time, I thought it is easier to learn the pitch than tones. Also relying on Kana if I forget how to write a kanji is a plus, too.\n(I will also learn Chinese one day but probably through Japanese, hoping that kanji knowledge helps a bit)", "created_utc": "1623971665.0", "edited": "False", "id": "h25d1nz", "is_submitter": "False", "link_id": "t3_o1xox2", "parent_id": "t1_h25b7sn", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "colutea", "body": "Same with me and Hungarian. I only know the very basics and how to read but don’t understand anything else anymore.\nI can read a sentence and pronounce it perfectly but I have no idea what it means.\nMy mother taught me how to read in Hungarian before school advised my parents to stop that and exclusively speak German", "created_utc": "1623432019.0", "edited": "False", "id": "h1fav07", "is_submitter": "False", "link_id": "t3_nxdzma", "parent_id": "t1_h1e6v7k", "score": "7", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "colutea", "body": "J'utilise memrise pour apprendre le vocabulaire. Maintenant, je suis en train d'étudier les \"500 most common French words\" (https://app.memrise.com/course/131111/5000-most-common-french-words/)", "created_utc": "1621967841.0", "edited": "False", "id": "gzf6wzh", "is_submitter": "False", "link_id": "t3_njlly1", "parent_id": "t3_njlly1", "score": "1", "subreddit": "French", "subreddit_id": "t5_2rd5t"}, {"author": "colutea", "body": "At my school, English was mandatory and afterwards in grade 6, picking between French and Latin was mandatory as well. In grade 8 you could choose Spanish if you wanted additionally or choose Chemistry instead. But you learnt at least two foreign languages after completing school", "created_utc": "1621699182.0", "edited": "False", "id": "gz2ee72", "is_submitter": "False", "link_id": "t3_ni1ung", "parent_id": "t1_gz1esn2", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "colutea", "body": "Usually at 8/9 years (English), seriously 2 years later. It's English. I live in Germany", "created_utc": "1621630208.0", "edited": "False", "id": "gyzhmwi", "is_submitter": "False", "link_id": "t3_ni1ung", "parent_id": "t3_ni1ung", "score": "23", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "colutea", "body": "I mean, you can take it as a worst-case scenario :D", "created_utc": "1621627824.0", "edited": "False", "id": "gyzcq77", "is_submitter": "False", "link_id": "t3_nhy4cv", "parent_id": "t1_gyz154w", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "colutea", "body": "Well, it depends on what activities you do. Czech is referred to as a level 3 language for an English speaker which takes 1,100 hours.\nSee more: https://www.state.gov/foreign-language-training/\nIt means, within 10 hours a week, you will get to that level within a little more than 2 years.", "created_utc": "1621621958.0", "edited": "False", "id": "gyz06xd", "is_submitter": "False", "link_id": "t3_nhy4cv", "parent_id": "t3_nhy4cv", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "colutea", "body": "I had exactly the same issue when I went to the US the first time. I switched to the American pronunciation from then on (also because I made many US friends)", "created_utc": "1621545088.0", "edited": "False", "id": "gyvcc71", "is_submitter": "False", "link_id": "t3_nguowy", "parent_id": "t1_gysx08m", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "colutea", "body": "A friend who is Japanese almost passed C1 after 10 months of learning (but at least got solid B2). She didn’t know any English or other language beside Japanese. She moved here and lived with a German family who only know German and spoke it to her, she also went to a language school each day for some hours. So basically her entire life in Germany was dedicated to learn German in order to survive here. \nSo yes, it’s doable even if the language distance is high but it depends on how much time you are willing to commit daily.", "created_utc": "1619910514.0", "edited": "False", "id": "gwlkre9", "is_submitter": "False", "link_id": "t3_n2qit9", "parent_id": "t3_n2qit9", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "colutea", "body": "For something smaller which is similar to the Nova 3, is the Poke 3. It has 6 Inches and is smaller than a Kindle as it has thinner bezels", "created_utc": "1619357293.0", "edited": "False", "id": "gvtdv5a", "is_submitter": "False", "link_id": "t3_mxz9t8", "parent_id": "t1_gvsjgqd", "score": "2", "subreddit": "ereader", "subreddit_id": "t5_2qwmn"}, {"author": "colutea", "body": "This and also restart the device afterwards. I also kinda was worried it didn’t work but then I restarted and it was all there :)", "created_utc": "1618750068.0", "edited": "False", "id": "guyp5ku", "is_submitter": "False", "link_id": "t3_mt18fz", "parent_id": "t1_guxso66", "score": "1", "subreddit": "ereader", "subreddit_id": "t5_2qwmn"}, {"author": "colutea", "body": "An Android-based E-Reader like Onyx. I would go with a larger one for comics. You can use all the apps you want that support the features you want like the vocabulary builder, etc. \nHowever, if you like reading colored comics a lot, you might also be better of with a tablet.", "created_utc": "1618613232.0", "edited": "False", "id": "gus259b", "is_submitter": "False", "link_id": "t3_msa1v5", "parent_id": "t3_msa1v5", "score": "1", "subreddit": "ereader", "subreddit_id": "t5_2qwmn"}, {"author": "colutea", "body": "Onyx uses Android so you can use all the apps you want and you aren’t locked into Amazon’s ecosystem. Audio books are also possible if you connect headphones (e.g. via Bluetooth).\nIf you want to use Amazon, you can just download the Kindle app. If you want sth from Rakuten? Just download the Kobo app, etc", "created_utc": "1618222359.0", "edited": "False", "id": "gu8m9md", "is_submitter": "False", "link_id": "t3_mpa7s9", "parent_id": "t1_gu8lbq1", "score": "1", "subreddit": "ereader", "subreddit_id": "t5_2qwmn"}, {"author": "colutea", "body": "I second this. The Boox Nova 3 supports also warm light and I read that the colored layer is the reason for blurred texts. \nI have a Poke 3 and it is extremely sharp and bright. I have a 4-year-old Kindle as a comparison. Sharpness is identical but the Poke is brighter.", "created_utc": "1618055319.0", "edited": "False", "id": "gu18syi", "is_submitter": "False", "link_id": "t3_mnsamg", "parent_id": "t1_gtzu92a", "score": "4", "subreddit": "ereader", "subreddit_id": "t5_2qwmn"}, {"author": "colutea", "body": "I am from Bavaria and I can understand them very well since they share many expressions with us (though none of the sides likes to admit it). My bf is from Hessia and he has a hard time to understand some of them (those who have a stronger dialect). \n\nBut to sum it up, all dialects are hard to understand unless you are from a region which shares expressions, etc. or the person doesn’t have a strong one. People from the city are usually way easier than people from villages since bigger cities tend to be more mixed and people adjust their communication. In villages, people live there for generations and speak like they want. \n\nE.g. the grammar in Bavaria is very odd compared to the standard German one:\n\"I hob des nia und nimma ned glaubt.\"\n= Ich konnte das nicht glauben (literally: Ich habe das nie und nie nicht geglaubt; I didn’t believe it never and never)\n= I didn’t believe it \n\nOr: \"I dat des nia ned doa.\"\nIch würde das nie tun (lit.: Ich täte das nie nicht; I wouldn’t do that never)\n= I wouldn’t do it. \n\nIt’s common in the south to use expressions like that but someone from the north probably has issues to understand. If you use two times no is it now yes or no?^^\n\n(It was also sometimes hard for me when I moved to Saxony to understand people here and people immediately realized that I am from Bavaria)", "created_utc": "1617903044.0", "edited": "False", "id": "gtu0p6a", "is_submitter": "False", "link_id": "t3_mm4aoy", "parent_id": "t1_gtpnx4h", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "colutea", "body": "When I first saw the picture on the right I thought that Kaleido became damn good until I realized it’s a tablet 🥲", "created_utc": "1617732219.0", "edited": "False", "id": "gtlgfdm", "is_submitter": "False", "link_id": "t3_mldkam", "parent_id": "t3_mldkam", "score": "6", "subreddit": "Onyx_Boox", "subreddit_id": "t5_11rfaa"}, {"author": "colutea", "body": "I bought a Boox Poke 3 recently and it is great. You can customize the refresh rate up until the point that you can even watch YouTube. \nAs it is based on Android, you can use whatever ebook store you want. And it is certainly extremely fast. I had a Kindle before and I never look back.", "created_utc": "1617397174.0", "edited": "False", "id": "gt6hgbx", "is_submitter": "False", "link_id": "t3_migim2", "parent_id": "t3_migim2", "score": "3", "subreddit": "ereader", "subreddit_id": "t5_2qwmn"}, {"author": "colutea", "body": "I have the Poke 3 and it is flawless with the Scribd app as well as other apps, e.g. Libby", "created_utc": "1616768165.0", "edited": "False", "id": "gsakzlh", "is_submitter": "False", "link_id": "t3_mciclh", "parent_id": "t1_gs42nxi", "score": "3", "subreddit": "Onyx_Boox", "subreddit_id": "t5_11rfaa"}, {"author": "colutea", "body": "Exactly. I also work at a software company and we release every two weeks but the users get it slowly. First 10% on the first day, the others slowly in the upcoming days to make sure that if the first users have critical bugs like crashes, etc. we can limit the severe issues and make a hotfix that is distributed again to all", "created_utc": "1616237290.0", "edited": "False", "id": "grktqqc", "is_submitter": "False", "link_id": "t3_m7y751", "parent_id": "t1_grgteq5", "score": "3", "subreddit": "Onyx_Boox", "subreddit_id": "t5_11rfaa"}, {"author": "colutea", "body": "+1 for Boox. I also have one and I am a student as well. My university has a subscription to O’Reilly books (former: Safari Books online) and you can read them only in a dedicated app. There is no way to download a PDF or anything else.\nWith Android you are the most flexible.", "created_utc": "1616141492.0", "edited": "False", "id": "grgk2yr", "is_submitter": "False", "link_id": "t3_m7ppv2", "parent_id": "t1_grdmebd", "score": "2", "subreddit": "ereader", "subreddit_id": "t5_2qwmn"}, {"author": "colutea", "body": "I wanted to have the same screen size as my kindle since it is more comfortable to hold when lying in bed or only with one hand. Another point was cost. I don’t need annotation or PDF reading of scientific papers since I have an iPad Pro for that.", "created_utc": "1615502650.0", "edited": "False", "id": "gqml1e6", "is_submitter": "False", "link_id": "t3_m1k6wq", "parent_id": "t1_gqld6tg", "score": "1", "subreddit": "ereader", "subreddit_id": "t5_2qwmn"}, {"author": "colutea", "body": "I did the same as you want to about a week ago. I love my Poke 3. You can just continue using the Kindle App on it so your Books aren’t lost, you can use different stores and download other apps like RSS readers to read your news, etc. \nIt’s an amazing device and the frontlight is brighter as well and you can adjust the temperature (in comparison: https://reddit.com/r/ereader/comments/lz29zu/direct_comparison_of_screen_brightness_of_the/)\nThe only downside is the battery life. The Kindle lasted for a few weeks while the Poke only a few days. You can extend that of course if you don’t use WiFi, etc. I didn’t bother much though cause I am used to charge my devices regularly. \n\nThe third-party apps I  use regularly:\n\n-\tKindle App for reading\n-\tRakuten app for reading\n-\tMoon+ Reader\n-\tLibby for library books \n-\tFeedly for my news\n\nReading Reddit, surfing, etc. is comfortable - however I don’t use it for chatting or writing texts. Thanks to the X mode you can even watch YouTube: https://streamable.com/k7maux :D", "created_utc": "1615396630.0", "edited": "False", "id": "gqgtg29", "is_submitter": "False", "link_id": "t3_m1k6wq", "parent_id": "t3_m1k6wq", "score": "1", "subreddit": "ereader", "subreddit_id": "t5_2qwmn"}, {"author": "colutea", "body": "It’s not either or - I'd recommend using both at the same time. When I learnt Japanese, I used different books. On my own Genki, at uni some book the teacher wrote, excerpts from Minna no Nihongo, Marugoto. From those all, Genki is what I liked most for self-study. The others are better for classes. However, I don’t like how Genki teaches Kanji, so Wanikani is better for that part. But for everything else (grammar, vocab,...), Genki is great.\nI'd also recommend to use the audio as well.", "created_utc": "1615149393.0", "edited": "False", "id": "gq4vxpi", "is_submitter": "False", "link_id": "t3_lzsmmq", "parent_id": "t1_gq4879o", "score": "2", "subreddit": "LearnJapanese", "subreddit_id": "t5_2qyls"}, {"author": "colutea", "body": "I started Wanikani after I finished Genki 1 & 2. A little too late, I'd do it after Genki 1 but certainly not earlier than that. If you don’t know any Japanese I guess it’s too much struggle since you can’t use it at all, don’t understand the structure of the example sentences, etc.", "created_utc": "1615138659.0", "edited": "False", "id": "gq45zlo", "is_submitter": "False", "link_id": "t3_lzsmmq", "parent_id": "t1_gq431nq", "score": "2", "subreddit": "LearnJapanese", "subreddit_id": "t5_2qyls"}, {"author": "colutea", "body": "Same", "created_utc": "1615119315.0", "edited": "False", "id": "gq3a87z", "is_submitter": "False", "link_id": "t3_jx3vtw", "parent_id": "t1_gcvrr8t", "score": "2", "subreddit": "bose", "subreddit_id": "t5_2ykqh"}, {"author": "colutea", "body": "I got the same issue and received my third pair from the last week. It’s very likely a software issue. I wrote them again - I hope they finally start reacting", "created_utc": "1615119200.0", "edited": "False", "id": "gq3a3ku", "is_submitter": "False", "link_id": "t3_lsjug9", "parent_id": "t3_lsjug9", "score": "1", "subreddit": "bose", "subreddit_id": "t5_2ykqh"}, {"author": "colutea", "body": "Same in Germany. I was miserable at French and gave it up as soon as I could and then concluded I am bad at language learning because my grades were bad. Well, my grades weren’t good in English either in 6th grade until I stopped caring about the grades because I discovered English books and movies. And, well, my English became great whereas my French suffered (of course, I didn’t use it besides school). I concluded back then, it was the teacher. Yep, of course 😅\n\nEveryone can speak English out of school. Not necessarily well, because many don’t care enough since not all jobs require it - but at least at B1. But that’s really it though we learn French/Latin for 4 years at least and some people also Spanish or Italian (depending on the school)", "created_utc": "1615067592.0", "edited": "1615067854.0", "id": "gq0vs28", "is_submitter": "False", "link_id": "t3_lyam8h", "parent_id": "t1_gpt8g3a", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "colutea", "body": "Yes, both should be 300 ppi.", "created_utc": "1615059791.0", "edited": "False", "id": "gq05fke", "is_submitter": "True", "link_id": "t3_lz29zu", "parent_id": "t1_gpzyqji", "score": "1", "subreddit": "ereader", "subreddit_id": "t5_2qwmn"}, {"author": "colutea", "body": "I got a Poke 3 two days ago and I buy manga through Amazon JP and Rakuten Kobo to read them via their apps (I read in Japanese). I enabled Speed mode and with that it works well for me on this size cause I can comfortably hold it with one hand while sitting on the couch. Scrolling and zooming all the time works fine with speed mode. \nThe quality of the images depends also on the publisher. I would before purchasing a book try to view a sample of it to judge if the resolution is good enough. \n\nSize is personal preference. I also have a 10.5 inch iPad which I don’t use for reading manga (unless they are colored) since it is too big for me to hold for a few hours. I use it on my desk only.", "created_utc": "1614949251.0", "edited": "False", "id": "gpro60g", "is_submitter": "False", "link_id": "t3_ly3rgl", "parent_id": "t3_ly3rgl", "score": "2", "subreddit": "ereader", "subreddit_id": "t5_2qwmn"}, {"author": "colutea", "body": "I learned before in classes and entirely on my own. On my own, it was hard to actually keep studying regularly since I didn’t have any way to interact with someone so I used to keep pushing it back and only study a little. \nWhen I did classes, I learnt a lot but I was very bad at conversations. If you have 10-15 people in a class, you maybe talk 5 min (in a 1,5 hour lesson) so I struggled. And I copied mistakes from others since most practices were to talk with your neighbor who sucks also at Japanese 😅\nWith italki, I started to feel way more confident in speaking. I have two teachers, with one I go through Tobira (see next comment) - with the other we talk on various topics (pure conversation classes) - it helps me to learn expressions on themes I am interested in. I didn’t do a test since I started iTalki but I feel that I understand the language better. I am able to talk to Tandem partners (somewhat broken but hey) - and also read books. Before, I was overwhelmed by books cause I didn’t understand anything. It was like I know every single word in that sentence but somehow I don’t get the meaning. \nThat got way better.", "created_utc": "1614933936.0", "edited": "False", "id": "gpr61ih", "is_submitter": "False", "link_id": "t3_lx2rvh", "parent_id": "t1_gpqls3w", "score": "2", "subreddit": "LearnJapanese", "subreddit_id": "t5_2qyls"}, {"author": "colutea", "body": "We start each lesson with the introductory exercises and I respond to the questions orally in the book. If I don’t know a word, she helps me out. Often, this results in a short conversation on that topic where she asks some further questions (reasoning why I think so, etc.).\nAfter that, we continue with the text. I read it aloud and after each paragraph she corrects my mistakes, asks if I have questions (words, grammar) and then she explains them. Then, she points out words or grammar that she thinks is important (it’s often the new grammar) and then asks me to explain or what I think it means. If I don’t know, she explains it. \nAfter the whole text, she asks me some questions on the content before we proceed to the official questions on the text which I answer orally.\n\nNext, we do the conversation parts. First, we read the first conversation dialog together (she reads the Japanese person), I the foreign one. Afterwards same game with the questions and grammar. Here, we also talk more about the speech style, what makes it formal, what it would be in informal speech, etc.  Once we did the first text, we do all related conversation exercises (e.g. if it was Keigo, we do all the Keigo exercises) together where she also helps with expressions. Often the book gives only one expression, she often comes up with alternative ones I could use. We practice them several times until I feel confident using them. \n\nWe don’t do any grammar exercises though - I use BunPro to drill them later on my own - if I have questions I could still ask her. I also bought the grammar exercise books (which has an answer key) but I am not the biggest fan of its' structure. I go through it on my own though.\n\nMy Japanese improved quite a lot since then - I understand texts way better than before as this book is text heavy. Also, I understand Keigo better. Tobira isn’t laid out like Genki with a focus on grammar but rather it’s application- I like it that way since I can see it directly in context and could remember it better", "created_utc": "1614933352.0", "edited": "False", "id": "gpr5e9y", "is_submitter": "False", "link_id": "t3_lx2rvh", "parent_id": "t1_gpqnqz7", "score": "2", "subreddit": "LearnJapanese", "subreddit_id": "t5_2qyls"}, {"author": "colutea", "body": "I second this. I also go through Tobira with an italki teacher", "created_utc": "1614900388.0", "edited": "False", "id": "gppnwm2", "is_submitter": "False", "link_id": "t3_lx2rvh", "parent_id": "t1_gpmityh", "score": "2", "subreddit": "LearnJapanese", "subreddit_id": "t5_2qyls"}, {"author": "colutea", "body": "I had a similar experience with French at university. I got almost a perfect score at reading, writing and listening but failed speaking. I then started looking for Tandem partners with which I practice each week. I didn’t do a test since then but I believe it would go much smoother.\nNo need to give up or worry too much :) just keep going - maybe find someone to talk to in Japanese and it will get better", "created_utc": "1614870453.0", "edited": "False", "id": "gpnqw5h", "is_submitter": "False", "link_id": "t3_lx7abe", "parent_id": "t3_lx7abe", "score": "1", "subreddit": "LearnJapanese", "subreddit_id": "t5_2qyls"}, {"author": "colutea", "body": "I do a little - I see that they definitely have the signature and also often the location. However, there are also parts where I have no clue since it is calligraphy.", "created_utc": "1614759266.0", "edited": "False", "id": "gpiieu8", "is_submitter": "False", "link_id": "t3_lw8pv6", "parent_id": "t1_gpg1pvu", "score": "1", "subreddit": "Onyx_Boox", "subreddit_id": "t5_11rfaa"}, {"author": "colutea", "body": "I am also a designer - I use my iPad for these kind of books due to how accurate it shows the colors  (it also has a pencil, so I can even sketch my ideas). I use an eReader for novels, etc. without any pictures or where colors aren’t important", "created_utc": "1614724574.0", "edited": "False", "id": "gpgvkl5", "is_submitter": "False", "link_id": "t3_lv8ft9", "parent_id": "t1_gpb8kzv", "score": "1", "subreddit": "ereader", "subreddit_id": "t5_2qwmn"}, {"author": "colutea", "body": "Thanks for the tip^^", "created_utc": "1614719056.0", "edited": "False", "id": "gpgj752", "is_submitter": "False", "link_id": "t3_lvyzay", "parent_id": "t1_gpf77v1", "score": "1", "subreddit": "ereader", "subreddit_id": "t5_2qwmn"}, {"author": "colutea", "body": "I didn’t know that and ordered on the weekend from them. Let’s see.\nHowever, I took a screenshot the policies & fees and sent it directly to the consumer protection authority (\"Verbraucherschutzzentrale\") of my country (Germany). Afaik, they take requests like this seriously, so I hope they act soon and force them to let go of the policy.\n\nIf some of you also have an authority like that in your country (or are Germans as well), also do the same. If we all report the same company, they have to act. I am pretty sure BOOX doesn’t like to lose all their EU customers. \nI needed to only use an online form. It’s quick but helps hopefully others", "created_utc": "1614694388.0", "edited": "False", "id": "gpezdg9", "is_submitter": "False", "link_id": "t3_lvyzay", "parent_id": "t3_lvyzay", "score": "2", "subreddit": "ereader", "subreddit_id": "t5_2qwmn"}, {"author": "colutea", "body": "I don't know anyone with a C2 certificate in English so that isn’t a good measure. \nMy uni doesn’t even offer C2 f  for English, only C1/C2 because the market doesn’t demand it. \nMany jobs put often B2 as a requirement, sometimes C1, but I have never seen C2 so far. \n\nThough, e.g. at the uni Hamburg in Germany, you can get a C1 or C2 certificate in Japanese (people who do it also study japanology though).\n\nAs I said, still, even you can’t find some institution in your area which assesses your level officially, that doesn’t mean, you can’t reach that level. I know many people of my native language who are C2 in it for sure but never got certified or didn’t want it because they have a job here, go to uni here and write their thesis in that language, etc. \n\nHence, reaching the level is independent of actually having a proof for it.\nI guess if someone e.g. works in Japan for years and also writes a lot in the job in Japanese, it is very likely that person also reached at least C1.", "created_utc": "1614633850.0", "edited": "1614634377.0", "id": "gpce9od", "is_submitter": "False", "link_id": "t3_lumr3p", "parent_id": "t1_gpa0dc0", "score": "3", "subreddit": "LearnJapanese", "subreddit_id": "t5_2qyls"}, {"author": "colutea", "body": "That is not true. CEFR levels are general enough to be applied for every single language: https://rm.coe.int/CoERMPublicCommonSearchServices/DisplayDCTMContent?documentId=090000168045bb52\nThe abilities are described there for every level. So, you can be C2 in Japanese - judging by the abilities. However, it might hard to get C2-certified. Universities do offer some CEFR-tests for Japanese though. \nIt isn’t probably practicable to get CEFR-certified if you want to look for work in Japan, but in case you want one by an European company that requires language abilities, it is probably a good idea since JLPT isn’t known much by European companies.\n(Also it is probably a good idea if you get the chance since CEFR tests also active abilities)", "created_utc": "1614551526.0", "edited": "False", "id": "gp8j71z", "is_submitter": "False", "link_id": "t3_lumr3p", "parent_id": "t1_gp7oek4", "score": "12", "subreddit": "LearnJapanese", "subreddit_id": "t5_2qyls"}, {"author": "colutea", "body": "Could you show an image of the non-micro-tape case? I also ordered a Poke 3 yesterday and I am curious what the case looks like 😅", "created_utc": "1614528468.0", "edited": "False", "id": "gp6p0ns", "is_submitter": "False", "link_id": "t3_lgdfkw", "parent_id": "t3_lgdfkw", "score": "1", "subreddit": "Onyx_Boox", "subreddit_id": "t5_11rfaa"}, {"author": "colutea", "body": "For me, it started since I got the second pair which was almost a year ago. I didn’t contact them immediately as I didn’t want to wait another month for new ones.\n\nI also don’t have any other BT app like this UE one", "created_utc": "1613813389.0", "edited": "False", "id": "go3szfz", "is_submitter": "False", "link_id": "t3_lnftl1", "parent_id": "t1_go3pi6l", "score": "1", "subreddit": "bose", "subreddit_id": "t5_2ykqh"}, {"author": "colutea", "body": "I use Mac and iOS only and I have the same issues. Bose said it’s hardware, hence, I get my third pair soon.", "created_utc": "1613779369.0", "edited": "False", "id": "go2c7bg", "is_submitter": "False", "link_id": "t3_k42t55", "parent_id": "t1_ge8bo5n", "score": "1", "subreddit": "bose", "subreddit_id": "t5_2ykqh"}, {"author": "colutea", "body": "Seems like an hardware issue. I get my third pair soon from them. It’s ridiculous, nearly everyone has these issues and they didn’t address it properly 😒\nContact Bose, they are very quick with helping", "created_utc": "1613779161.0", "edited": "False", "id": "go2bsn8", "is_submitter": "False", "link_id": "t3_lnftl1", "parent_id": "t3_lnftl1", "score": "1", "subreddit": "bose", "subreddit_id": "t5_2ykqh"}, {"author": "colutea", "body": "Well, it could help to delay symptoms of dementia if you continue to do it. \nI would say that’s already worth it ^^", "created_utc": "1613723071.0", "edited": "False", "id": "gnzjr22", "is_submitter": "False", "link_id": "t3_ln8vnq", "parent_id": "t3_ln8vnq", "score": "6", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "colutea", "body": "In 942 Hungarians invaded Spain:\n\"A Hungarian raid in Spain took place in July 942. This was the furthest west the Hungarians raided during the period of their migration into central Europe; although, in a great raid of 924–25, the Hungarians sacked Nîmes and may have got as far as the Pyrenees.\"\n\nhttps://en.wikipedia.org/wiki/Hungarian_raid_in_Spain_(942)?wprov=sfti1 https://maps.apple.com/?ll=41.401900,2.171400&q=Hungarian%20raid%20in%20Spain%20(942)&_ext=EiQpcLODdXGzREAxAF9x+wZfAUA5cLODdXGzREBBAF9x+wZfAUA%3D\n\nMaybe it’s something related to that.\n\n\nAlternatively, there is a study which might explain it as well:\n\"Based on the high frequency of Hg G, the **Hungarian**, the Middle-Neolithic European, the Neolithic German and **Spanish**, the Maltese, and the Sardinian groups are also close to each other.\"\n\nhttps://link.springer.com/article/10.1007/s12520-019-00996-0", "created_utc": "1613686536.0", "edited": "1613686895.0", "id": "gnxt0e3", "is_submitter": "False", "link_id": "t3_lljv9w", "parent_id": "t1_gnq3inv", "score": "2", "subreddit": "23andme", "subreddit_id": "t5_2scn9"}, {"author": "colutea", "body": "My name is Hungarian as my mother is Hungarian. She calls me the Hungarian way, though we speak German. My German friends say it the German way, Japanese the Japanese and French the French way. \nHowever, Japanese is like the German pronunciation, funnily. \nI do that too. So if I talk to other Germans, I use the German pronunciation. In English, its also different. Also, with certain people I pronounce it differently though they also speak German. I am fine with all unless it is a pronunciation that doesn’t exist at all.", "created_utc": "1613587253.0", "edited": "False", "id": "gnskngk", "is_submitter": "False", "link_id": "t3_llqomj", "parent_id": "t3_llqomj", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "colutea", "body": "I have 52% F&G but no regions. My mom is Hungarian and my dad is a Transylvanian Saxon. According to history, my dad's ancestors left Germany 800 years ago so probably that makes it very hard to trace the region where they originally came from. \n\nAnd it is likely they just mixed with other German groups (they say they never mixed with non-Germans though as it was forbidden).", "created_utc": "1613428010.0", "edited": "False", "id": "gnky70g", "is_submitter": "False", "link_id": "t3_ljl67d", "parent_id": "t3_ljl67d", "score": "2", "subreddit": "23andme", "subreddit_id": "t5_2scn9"}, {"author": "colutea", "body": "Yes, same for German. Even if a non-native has no accent, I mostly detect it by weird article usage. :D", "created_utc": "1613391767.0", "edited": "False", "id": "gnj170u", "is_submitter": "False", "link_id": "t3_lk0ua9", "parent_id": "t3_lk0ua9", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "colutea", "body": "Same boat as you! :) also 3.5 years and studying for N3 this year (if it takes place due to COVID).\nI didn’t study for hours every day since I work and go to university. But I tried to study every day.\n\nIt’s a marathon not a sprint.", "created_utc": "1613377734.0", "edited": "1613378045.0", "id": "gnimadw", "is_submitter": "False", "link_id": "t3_ljwgfn", "parent_id": "t1_gngnkab", "score": "2", "subreddit": "LearnJapanese", "subreddit_id": "t5_2qyls"}, {"author": "colutea", "body": "It depends on your goals. If you want to get fluent in all, I would go for one at a time.", "created_utc": "1613332418.0", "edited": "False", "id": "gngjmbz", "is_submitter": "False", "link_id": "t3_lji095", "parent_id": "t3_lji095", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "colutea", "body": "I use italki and I am satisfied. But it depends on the person not the platform", "created_utc": "1613306430.0", "edited": "False", "id": "gne6zz1", "is_submitter": "False", "link_id": "t3_ljkob4", "parent_id": "t3_ljkob4", "score": "7", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "colutea", "body": "I am German and I don’t understand all songs completely. Sometimes I have to listen to them multiple times until I get it and then I understand/or I read the lyrics. And I am native. \nWhen people sing, words flow into one another.\nI would look at some YouTube videos who speak the standard language (for German, e.g. https://www.funk.net/)\n\nRegard the other languages. Idk if it is wise to drop Japanese or German or any of the others. Learning a language is not easy - some are easier than the others but if you already nailed the basics, I would at least try to maintain them when you add a new one. \nWhich language to learn is highly subjective and I would favor one that makes you the most excited and stick to it.", "created_utc": "1613306274.0", "edited": "False", "id": "gne6l8t", "is_submitter": "False", "link_id": "t3_ljlatl", "parent_id": "t3_ljlatl", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "colutea", "body": "Depends on the native language. For Chinese or Japanese speakers it certainly isn’t", "created_utc": "1613251199.0", "edited": "False", "id": "gnakkzn", "is_submitter": "False", "link_id": "t3_lj7mzn", "parent_id": "t1_gnajozc", "score": "11", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "colutea", "body": "V is not necessarily pronounced like f in German. E.g. \"Vase\" != \"Vater\" \n\nI could imagine that the v/w and s sounds are difficult for some.\nBut there is also more - wrong pronunciation of certain letter combinations.\nE.g. \"weird\" vs. \"weight\"\n\nIn German \"ei\" is more like \"weight\" so many would say it that way if they don’t know. \nIdk, if you could understand someone who makes this mistake continuously.\n\nOr also classic grammar/vocab mistakes due to \"similar\" words:\n-\t\"The tea becomes him good“ (Der Tee bekommt ihm gut)\n-\t\"I become a present\" (Ich bekomme ein Geschenk)\n-\t\"We were friends\" (Wir wurden Freunde; correct is \"We became friends\")\n-\t\"He was red\" (Er wurde rot; correct: He turned red)\n\nIdk, if you understand someone who talks like this all the time :)", "created_utc": "1613250204.0", "edited": "1613251057.0", "id": "gnagbha", "is_submitter": "False", "link_id": "t3_lglklg", "parent_id": "t1_gn7ec1u", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "colutea", "body": "TH is extremely difficult for Germans. Many struggled with it in school (myself included).\n\nThe sounds you mentioned didn’t take as long to learn for many of my classmates (e.g. German also has V and W). TH on the other hand took years and many still didn’t learnt it. \nSo if you say that V/W, S, J sounds are the most difficult, it’s fine - everyone perceives it differently. \n\nIt is highly individual - so I wouldn’t make bold statements that sound XYZ is not difficult at all but XYZ is the most difficult ;)", "created_utc": "1613175851.0", "edited": "False", "id": "gn4bz7w", "is_submitter": "False", "link_id": "t3_lglklg", "parent_id": "t1_gmzvbzc", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "colutea", "body": "I also got Anatolian and my mom's Szekely. I wouldn’t be surprised if this is related. Also, there were this Ottoman wars in Europe - from that time churches in Transylvania still keep rugs(https://en.wikipedia.org/wiki/Transylvanian_rugs?wprov=sfti1).\nSo that part is I guess probably common for people with that kind of ancestry.", "created_utc": "1613170859.0", "edited": "1613171077.0", "id": "gn42jf3", "is_submitter": "False", "link_id": "t3_lih2gw", "parent_id": "t1_gn3eyk8", "score": "3", "subreddit": "23andme", "subreddit_id": "t5_2scn9"}, {"author": "colutea", "body": "Ah true, Tirol might explain the Italian. \n\nBut tbh, I was also surprised to see the Romanian only with 8% XD but with the rest of Eastern European it makes up 45 %. So if this is all the Székely it would make sense. \n\nBut then, it would also mean that my father is 90/100% French & German. Which is also hard to imagine since his family also lived there for centuries but my father says (and also his relatives) that it wasn’t allowed for Saxons to mix with Székely and they all swore that they didn’t and don’t know about any mixes with Hungarians.  \n\nOr it could also be that my mom has a Saxon mixed somewhere in there and my dad a Hungarian. \nVery curious for the results of my parents.\nTbh, I kinda expected 80% of that Romanian area since both lived there a very long time but well, seems like the French & German is very distinct from Eastern European DNA and Hungarian is very hard to detect.", "created_utc": "1613165307.0", "edited": "False", "id": "gn3r1h5", "is_submitter": "False", "link_id": "t3_lidxma", "parent_id": "t1_gn3fj2v", "score": "1", "subreddit": "23andme", "subreddit_id": "t5_2scn9"}, {"author": "colutea", "body": "Maybe the rest of Székely is also just included within the Eastern European part which isn’t splittet intro countries. \nWe don’t know about other Eastern European ancestors which are not either Hungarian or German (or some sort of Italian) so that is highly likely that this part is related to the Székely ancestry. \nSince my family lived in that area for centuries. \nMy mom and dad also will take the test as they got interested, maybe it then changes for me as well 🙈\n\nSo for Italian, I also called my parents and my mom said that my great-grandpa has some Italian roots. That would also explain it. But I heard that this is quite common that Hungarian have a small percentage of Italian in them.", "created_utc": "1613152428.0", "edited": "1613153553.0", "id": "gn2yfw5", "is_submitter": "False", "link_id": "t3_lidxma", "parent_id": "t1_gn2p79j", "score": "1", "subreddit": "23andme", "subreddit_id": "t5_2scn9"}, {"author": "colutea", "body": "Nope, also computing for 2 days", "created_utc": "1613084628.0", "edited": "False", "id": "gmzv5ig", "is_submitter": "False", "link_id": "t3_ko14ze", "parent_id": "t1_gmz1lji", "score": "1", "subreddit": "23andme", "subreddit_id": "t5_2scn9"}, {"author": "colutea", "body": "The company didn’t start this sub... I doubt that they see this. I would advise to contact their support instead...", "created_utc": "1613066643.0", "edited": "False", "id": "gmypm6g", "is_submitter": "False", "link_id": "t3_ko14ze", "parent_id": "t1_gmx88ha", "score": "6", "subreddit": "23andme", "subreddit_id": "t5_2scn9"}, {"author": "colutea", "body": "I got fluent through reading and watching TV shows and TED talks. I read a lot of non-fiction as well as fiction meant for adults.\nAt some point, my brain stopped to translate everything. \nThat’s how I reached B2+ in school. To the C-levels, I got by doing the same but also by finding a job which uses English as it’s Business language (it’s an IT company). I never moved abroad. \n\nBut you could still start learning another language, maybe even through English - then you are in a win-win-situation :)\n\nThe only thing you can do is to become good in English is by using it as often as you can. It’s such a popular language, I guess it shouldn’t be hard to find some meetups in this language on a topic you like where you could practice speaking. During COVID, everything is online", "created_utc": "1613064999.0", "edited": "False", "id": "gmyllbr", "is_submitter": "False", "link_id": "t3_lgchvw", "parent_id": "t3_lgchvw", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "colutea", "body": "I think it is helpful - I am probably not your target group since I am already proficient in English (well, good enough to work in it and use it for academia). But I guess, there are others who would benefit a lot... maybe you could ask here: /r/LearningEnglish", "created_utc": "1613064664.0", "edited": "False", "id": "gmyks1v", "is_submitter": "False", "link_id": "t3_lgdxny", "parent_id": "t3_lgdxny", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "colutea", "body": "In German, past and future forms as well as wars over \"der, due, das\" for some words.\nAnd the conjunction word: dass or das. Many struggle with when to use which. \nAnother one is \"wie\" und \"als\". \nOr \"seit” (since) vs “seid\" (are).", "created_utc": "1613064370.0", "edited": "False", "id": "gmyk259", "is_submitter": "False", "link_id": "t3_lg0bj8", "parent_id": "t3_lg0bj8", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "colutea", "body": "I got to C1/C2 in English and I never lived abroad. However, I work in English. So yeah, it’s possible. And I know plenty of people who had a similar journey", "created_utc": "1613041700.0", "edited": "False", "id": "gmxd086", "is_submitter": "False", "link_id": "t3_lgw4dm", "parent_id": "t3_lgw4dm", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "colutea", "body": "Anything besides English is useless.\n-My brother, only learnt English in school. \n\nA classic probably. \"Anime are translated\" \nAnd for any reason, there are a lot of Germans who dislike people learning French because they still see France as an enemy 🤦🏼‍♀️", "created_utc": "1613041472.0", "edited": "False", "id": "gmxcr1i", "is_submitter": "False", "link_id": "t3_lglklg", "parent_id": "t3_lglklg", "score": "5", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "colutea", "body": "Super easy. Tell that my German colleagues who still struggle with th. \n\"I sink\"", "created_utc": "1613041245.0", "edited": "False", "id": "gmxci3m", "is_submitter": "False", "link_id": "t3_lglklg", "parent_id": "t1_gmsz0db", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "colutea", "body": "American friends told me that German sounds like a machine gun. Probably because we make more breaks in between words whereas English is quite fluid and French is even more fluid.\nOn the other hand, it probably is easier to distinguish words when one speaks very fast.", "created_utc": "1613041093.0", "edited": "False", "id": "gmxcc81", "is_submitter": "False", "link_id": "t3_lglklg", "parent_id": "t1_gmsgs83", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "colutea", "body": "Mine is in computing since yesterday", "created_utc": "1612991270.0", "edited": "False", "id": "gmv1muu", "is_submitter": "False", "link_id": "t3_ko14ze", "parent_id": "t1_gmlkvyp", "score": "3", "subreddit": "23andme", "subreddit_id": "t5_2scn9"}, {"author": "colutea", "body": "Thanks. I know Journaly - it’s similar but has no prompts and not really what I had in mind... as it does not have the mindfulness aspect\n\nI am trying to find out atm how important that aspect actually is as it will determine if I will do the project or not", "created_utc": "1612975777.0", "edited": "1612990479.0", "id": "gmu0tnq", "is_submitter": "False", "link_id": "t3_lfpqig", "parent_id": "t1_gmre2nv", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "colutea", "body": "Clinical tests are more accurate but more expensive. \nA normal parental test is 100€ though - but you only get the info of your father is your father and not a detailed description of your ancestry.\nFor that, clinics simply don’t have enough data of all the populations to compare it with", "created_utc": "1612911723.0", "edited": "False", "id": "gmr5l1s", "is_submitter": "False", "link_id": "t3_ldell4", "parent_id": "t1_gm619g8", "score": "1", "subreddit": "23andme", "subreddit_id": "t5_2scn9"}, {"author": "colutea", "body": "Now it moved to Computing", "created_utc": "1612890900.0", "edited": "1612898801.0", "id": "gmptj49", "is_submitter": "False", "link_id": "t3_ko14ze", "parent_id": "t1_gme42w1", "score": "1", "subreddit": "23andme", "subreddit_id": "t5_2scn9"}, {"author": "colutea", "body": "Yes, similar to langcorrect but simpler. On langcorrect, you need to come up with the structure yourself and you could also fill in some user-generated topics but also only one and you also have a huge list where you have to decide on something.  \nI know that there are many ways to get your entries or texts corrected, but I imagine it differently.   \nA little bit like a digital diary with prompts, e.g. this 6 minute diary but digitally and with support of many languages [https://urbestself.de/products/the-6-minute-diary-pure-die-englische-fortsetzung-des-6-minuten-tagebuchs](https://urbestself.de/products/the-6-minute-diary-pure-die-englische-fortsetzung-des-6-minuten-tagebuchs)   \n\n\nI thought that the correct option would be nice since you want to know what you write is correct or not. But it shouldn't be about that aspect only, it should be also to think about your day. Many people do this in diary apps or classic diaries but there you don't have any user interaction at all. Because of the sensitivity, I thought about the privacy options since not all users probably want to share how they have been feeling about themselves or what bothers them publicly (but I also might be wrong - I have to find out how important anonymity is).", "created_utc": "1612889339.0", "edited": "False", "id": "gmppvlt", "is_submitter": "False", "link_id": "t3_lfpqig", "parent_id": "t1_gmoridu", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "colutea", "body": "That’s interesting. Yeah that is probably the biggest challenge nowadays to actually sit down and write something...", "created_utc": "1612885605.0", "edited": "False", "id": "gmph92z", "is_submitter": "False", "link_id": "t3_lfpqig", "parent_id": "t1_gmp71pt", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "colutea", "body": "Yes :)", "created_utc": "1612860518.0", "edited": "False", "id": "gmohc51", "is_submitter": "False", "link_id": "t3_lfpqig", "parent_id": "t1_gmne7p0", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "colutea", "body": "Yeah, I totally forgot. Duo would have helped me to achieve that 10 x as fast", "created_utc": "1612789664.0", "edited": "False", "id": "gmksr5a", "is_submitter": "False", "link_id": "t3_lexp3i", "parent_id": "t1_gmjxkha", "score": "4", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "colutea", "body": "Speaking a lot... Listening a lot... Writing a lot... A lot of everything 😂 Every day for years", "created_utc": "1612740845.0", "edited": "False", "id": "gmiunr7", "is_submitter": "False", "link_id": "t3_lexp3i", "parent_id": "t3_lexp3i", "score": "14", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "colutea", "body": "I am a German university student and if you like to study here, you have to learn German unless you are in your Master's and only staying here for one semester as universities also offer some English courses. But not enough to be able to do a complete degree with no German knowledge.", "created_utc": "1612732385.0", "edited": "False", "id": "gmiamx1", "is_submitter": "False", "link_id": "t3_lerc2q", "parent_id": "t3_lerc2q", "score": "6", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "colutea", "body": "Nope, still genotyping", "created_utc": "1612692051.0", "edited": "False", "id": "gme42w1", "is_submitter": "False", "link_id": "t3_ko14ze", "parent_id": "t1_gm99286", "score": "2", "subreddit": "23andme", "subreddit_id": "t5_2scn9"}, {"author": "colutea", "body": "First: wanted to annoy my parents better and asking them to give my toys back.\n2-3: Mandatory language classes. \n4th: Fun", "created_utc": "1612656012.0", "edited": "False", "id": "gmatdua", "is_submitter": "False", "link_id": "t3_lcosxz", "parent_id": "t3_lcosxz", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "colutea", "body": "Nope. My mother learnt German at 26 and became fluent so it is certainly possible. She didn’t know any German and her native language is Hungarian which is entirely different.\nNow, with 50, she starts to learn French and English. It’s never too late ;)\n\nI started learning Japanese when I was 18 - I also make good progress. I don’t know when I will be fluent, but let’s see. I started English when I was 11, and I guess I reached B2 at 16 and C1/C2 at 18/19. \n\nTLDR; you don’t need to be a toddler to learn languages", "created_utc": "1612654377.0", "edited": "1612654708.0", "id": "gmaoxbx", "is_submitter": "False", "link_id": "t3_ldn4e8", "parent_id": "t3_ldn4e8", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "colutea", "body": "Du könntest italienisch nutzen, um die anderen Sprachen zu lernen. Für Spanisch und Schwedisch gibt es sicherlich viele Ressourcen auf italienisch. B2 ist schon ziemlich gut, das verlierst du nicht so leicht und wenn du die Sprache weiter maintainst, dann hältst du das Level auch. \nJapanisch würd ich aber über Englisch lernen, da gibts am meisten Material. \nMit was du anfängst, ist egal. Ich würd nicht alle drei sofort anfangen, das wird wahrscheinlich sonst zu viel auf einmal.", "created_utc": "1612630633.0", "edited": "False", "id": "gm8v0qb", "is_submitter": "False", "link_id": "t3_ldx5e7", "parent_id": "t3_ldx5e7", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "colutea", "body": "I think it might also be dangerous. The people in this sub seem to be very open but there is a good amount of people on the Internet who isn’t and who thinks that only people from [insert country here] are the greatest and it would be easier for them to discriminate others or worse, find potential victims they can \"hunt“ :/ \n\nFor that reason, I also wouldn’t like that everyone who looks me up views my ancestry since this private detail I would not like to share with everybody.", "created_utc": "1612611347.0", "edited": "False", "id": "gm819af", "is_submitter": "False", "link_id": "t3_ldrtm2", "parent_id": "t3_ldrtm2", "score": "6", "subreddit": "23andme", "subreddit_id": "t5_2scn9"}, {"author": "colutea", "body": "Potato is ジャガイモ (jagaimo) - I didn’t hear ta-dou 😅 Maybe it is a special kind of potato? I am not a potato expert\n\nBut maybe, they really just used the English word and for any reason left out the po.", "created_utc": "1612602427.0", "edited": "1612602726.0", "id": "gm7sn84", "is_submitter": "False", "link_id": "t3_ldmgs6", "parent_id": "t3_ldmgs6", "score": "5", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "colutea", "body": "Same batch as well! Excited for my results.", "created_utc": "1612387223.0", "edited": "False", "id": "glwshr4", "is_submitter": "False", "link_id": "t3_ko14ze", "parent_id": "t1_glrp4ro", "score": "3", "subreddit": "23andme", "subreddit_id": "t5_2scn9"}, {"author": "colutea", "body": "We seem to be in the same batch^^", "created_utc": "1612196674.0", "edited": "False", "id": "glm67kd", "is_submitter": "False", "link_id": "t3_ko14ze", "parent_id": "t1_gkvvudt", "score": "2", "subreddit": "23andme", "subreddit_id": "t5_2scn9"}, {"author": "colutea", "body": "Well, you could try at least. I think if you ask precise questions you won't annoy them. On Wanikani Forum Is a Tobira study group, maybe you could also ask there what answers the others have", "created_utc": "1612196142.0", "edited": "False", "id": "glm4tpx", "is_submitter": "False", "link_id": "t3_l86wwg", "parent_id": "t1_gll4rtt", "score": "2", "subreddit": "LearnJapanese", "subreddit_id": "t5_2qyls"}, {"author": "colutea", "body": "Well, you could write your answers down and post it on apps like HiNative/iTalki so someone could at least re-check if you made grammatical mistakes and to some degree content, if the question is like what does Y mean in sentence Z (and you can post the whole sentence). I think the makers of the book didn’t think about that some people don’t have access to teachers who could help them with the content. \n\nMaybe, you could try to reach out to them via mail and they have some inofficial answer keys somewhere.", "created_utc": "1612176369.0", "edited": "False", "id": "gll31v3", "is_submitter": "False", "link_id": "t3_l86wwg", "parent_id": "t1_glf53pb", "score": "2", "subreddit": "LearnJapanese", "subreddit_id": "t5_2qyls"}, {"author": "colutea", "body": "There is no answer key. The teacher's manual only contains translations and how to teach that book. If you need some practice, you can buy the grammar book which has an answer key with it. For the main book, I'd recommend using it with a teacher. Many of them are kind of open questions anyway so you might need someone who could check your grammar there as well.", "created_utc": "1612048561.0", "edited": "False", "id": "glf4rsg", "is_submitter": "False", "link_id": "t3_l86wwg", "parent_id": "t3_l86wwg", "score": "5", "subreddit": "LearnJapanese", "subreddit_id": "t5_2qyls"}, {"author": "colutea", "body": "He also teaches other languages like Farsi, maybe he is better at them and that’s why the reviews are good.", "created_utc": "1612043348.0", "edited": "False", "id": "gleu7di", "is_submitter": "False", "link_id": "t3_l8pssr", "parent_id": "t1_glekejh", "score": "18", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "colutea", "body": "22. Started dabbling at 16, started serious studying at 19.", "created_utc": "1611847842.0", "edited": "False", "id": "gl3pcj9", "is_submitter": "False", "link_id": "t3_l6mvqy", "parent_id": "t3_l6mvqy", "score": "1", "subreddit": "LearnJapanese", "subreddit_id": "t5_2qyls"}, {"author": "colutea", "body": "To translate language from apps - well, there are a few. And the most reliable and best working is Google Translate :D\nIt saved me abroad and also while learning Japanese. Just hold the camera at the Kanji and I get the reading, meaning and pronunciation ^^", "created_utc": "1611784884.0", "edited": "False", "id": "gl08twr", "is_submitter": "False", "link_id": "t3_l6a8ri", "parent_id": "t3_l6a8ri", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "colutea", "body": "What worked for me:\n-\tDr Moku for Hiragana and Katakana/alternative: Kana book by Tuttle publishing\n-\tGenki 1&2 \n-\tafter Genki 1: starting Wanikani for Kanji (some start it at the beginning but it is easier if you know a little bit of Japanese before Wanikani. I learned some Kanji before as well in Genki)\nAfter that, the route for everyone is different and I won’t elaborate what I do now in intermediate level as you still need to first start :D", "created_utc": "1611441260.0", "edited": "False", "id": "gkghsed", "is_submitter": "False", "link_id": "t3_l3hlaj", "parent_id": "t3_l3hlaj", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "colutea", "body": " • Registered: Jan 5\n • Sent: Jan 5 (from Germany to the Netherlands)\n-\tIn Transit: Jan 21\n • Arrived at lab: Jan 26 (NC)\n • Prepped: Jan 26\n • Extracted: Jan 31\n • Genotyped:  Feb 9\n • Reviewed: Feb 9\n • Computing Your Results: started Feb 9\n • Results Ready: Feb 12 (expected Mar 9)", "created_utc": "1611241344.0", "edited": "1613169819.0", "id": "gk2e85y", "is_submitter": "False", "link_id": "t3_ko14ze", "parent_id": "t3_ko14ze", "score": "2", "subreddit": "23andme", "subreddit_id": "t5_2scn9"}, {"author": "colutea", "body": "When I learned English many years ago and was at around B2, I didn’t look up anything and tried to get it from the context. Only, if I didn’t understand the whole sentence because of this word, I looked it up. (I also don’t understand 100% of my native language and I do the same approach). \nI saw that for me, once I see the same word over and over again, I grasp the meaning anyway. First, I won’t use it consciously but if I encountered it often, I get that sure that I could use it myself.\nI also used to read many sequels or books within the same domain before reading ones from another one, so it was very likely that I come across this word again in a different sentence and get this repetition.\n\nReading a lot is the key. That is how the jump from B2 to C1 was possible (along with lots of talking). Later, I don’t know if you are at college or university, you might also add on more difficult topics over time (like papers from academia).", "created_utc": "1611087053.0", "edited": "1611087368.0", "id": "gjv7foj", "is_submitter": "False", "link_id": "t3_kzpw5f", "parent_id": "t3_kzpw5f", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "colutea", "body": "They made me curious for my results. My mom is Székely Hungarian and my father Transylvanian German (Saxon). For people with Székely background, I saw many different results - I guess it’s not surprising as there are many different people with different backgrounds living in this area.", "created_utc": "1610567809.0", "edited": "False", "id": "gj5bw81", "is_submitter": "False", "link_id": "t3_kwe2wl", "parent_id": "t1_gj3nef4", "score": "4", "subreddit": "23andme", "subreddit_id": "t5_2scn9"}, {"author": "colutea", "body": "Yep, my mother also spoke Hungarian to me until age 5 or 6 I think but I lost my speaking ability entirely and also my listening ability. So never ever stop - even if teachers tell you differently (like my teachers did to my parents)", "created_utc": "1610138125.0", "edited": "False", "id": "gikwmlt", "is_submitter": "False", "link_id": "t3_kqfoek", "parent_id": "t1_gi4w3f1", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "colutea", "body": "From Amazon. At least in Germany", "created_utc": "1610136533.0", "edited": "False", "id": "gikt0a3", "is_submitter": "False", "link_id": "t3_kt74s0", "parent_id": "t3_kt74s0", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "colutea", "body": "I updated the link", "created_utc": "1610124816.0", "edited": "False", "id": "gik29gk", "is_submitter": "True", "link_id": "t3_j0uupn", "parent_id": "t1_gijmwwu", "score": "2", "subreddit": "LearnJapanese", "subreddit_id": "t5_2qyls"}, {"author": "colutea", "body": "Same issue with songs and YouTube etc. I resented everything and also got mine replaced by Bose but this is a recurring issue and very annoying.", "created_utc": "1609715563.0", "edited": "False", "id": "gi09g5e", "is_submitter": "False", "link_id": "t3_kp6xu8", "parent_id": "t3_kp6xu8", "score": "1", "subreddit": "bose", "subreddit_id": "t5_2ykqh"}, {"author": "colutea", "body": "Manabi Reader for Japanese on iOS", "created_utc": "1609703761.0", "edited": "False", "id": "ghzjqeq", "is_submitter": "False", "link_id": "t3_kpgdfq", "parent_id": "t3_kpgdfq", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "colutea", "body": "I have a Japanese friend who did. She didn’t know any German or English when she moved to Germany. She went to a language school 5 days a week for several hours a day and lived with a German host family who don’t know any Japanese.\nHence, she was forced to function fast.\nShe reached C1 within 11 months and also did the exam. \n\nBut realistically, you can’t get to that kind of result if you don’t get into this \"forced\" situation.", "created_utc": "1609419394.0", "edited": "False", "id": "ghlomou", "is_submitter": "False", "link_id": "t3_knaxva", "parent_id": "t1_ghjgii1", "score": "7", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "colutea", "body": "I got friends who made a successful career out of art. And they have now clients which are coming back though everyone said that art isn’t a sustainable career.\nWell, today, we have online shops where you can sell prints, platforms where you can make livestreams of drawing, etc. Today, there are way more possibilities than 20 years ago. \nI mean, if you love it, give it a shot :)", "created_utc": "1609412338.0", "edited": "False", "id": "ghlhiqd", "is_submitter": "False", "link_id": "t3_kn9bn6", "parent_id": "t1_ghjtqnm", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "colutea", "body": "I tried this app also but it has too many bugs (iOS). It was last updated a year ago and also the website doesn't work very well.I didn't talk to someone as my trial expired before I found someone available during day-times in my time zone (CET). I looked into it a few weeks ago and the next available person during the time which isn't midnight was sometime in January - so unless you live near Japan, you probably will be better off with iTalki as there are more teachers available.  \nYour free trial expires even though you didn't have one conversation...Also, per day there were only 1-3 time slots (regardless of the time zone), so as soon more people start signing up, I believe, they will run into scaling issues...\n\nIt is a pity as I like the idea a lot but the execution of it could be improved.", "created_utc": "1608758890.0", "edited": "False", "id": "ggu2tug", "is_submitter": "False", "link_id": "t3_kbveej", "parent_id": "t3_kbveej", "score": "2", "subreddit": "LearnJapanese", "subreddit_id": "t5_2qyls"}, {"author": "colutea", "body": "I think there are several theories on this; Stephen Krashen has this theory which says where you don’t have to talk early on but rather immerse yourself a lot...\n(His paper are published for free, so you can read through them)\nBut with everything in science, it is a hypothesis, however, it shows some evidence so far. I think everyone could try a few things; the worst thing is that one method might be less efficient than another one but in the end, you are progressing with every method out there. How well it works depends individually, I believe.", "created_utc": "1608163878.0", "edited": "False", "id": "gg366op", "is_submitter": "False", "link_id": "t3_keid4m", "parent_id": "t1_gg2wpic", "score": "2", "subreddit": "LearnJapanese", "subreddit_id": "t5_2qyls"}, {"author": "colutea", "body": "I would like to talk ^^ \nI am not fluent at all but I would describe myself as B1. I don’t know my JLPT level but I guess I am somewhere on the way to N3.\nI am learning Japanese for 3 years now, had classes at university for 2,5 years and classes at italki for 6 months twice a week where I work on my speaking abilities.\nI like talking to people as I find it so interesting^^", "created_utc": "1608163321.0", "edited": "False", "id": "gg356w6", "is_submitter": "False", "link_id": "t3_kejdiw", "parent_id": "t3_kejdiw", "score": "1", "subreddit": "LearnJapanese", "subreddit_id": "t5_2qyls"}, {"author": "colutea", "body": "For any reason, I met many creepy man writing to me when I was looking for French language exchange. Then, I disabled French and only looked for Japanese language partners and it stopped.\nBut with Japanese, I had the issue that most of them also just wanted to practice English or stopped writing once I started with Japanese so I instead hired two tutors cause I was desperate and I am glad I did, because I didn’t find a language exchange partner. But it is expensive though and I'd wish that there is another way as well.", "created_utc": "1607024868.0", "edited": "False", "id": "geiowqd", "is_submitter": "False", "link_id": "t3_k5wdhm", "parent_id": "t1_geichz6", "score": "16", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "colutea", "body": "Yep, I started consuming English media early which got me fluent in it, so I don’t have to use German anymore^^ I also love Japanese much more.\nI don’t read books or listen to music in German except that if I need to (scientific papers, etc.).\nThe reason is that I find that German sounds very aggressive while the others sound way more friendly.", "created_utc": "1606860516.0", "edited": "False", "id": "geazsuu", "is_submitter": "False", "link_id": "t3_k42803", "parent_id": "t3_k42803", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "colutea", "body": "Here you go: https://www.coe.int/en/web/portfolio/self-assessment-grid", "created_utc": "1606860196.0", "edited": "False", "id": "geaz57o", "is_submitter": "False", "link_id": "t3_k4r2jt", "parent_id": "t3_k4r2jt", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "colutea", "body": "Well, you should approach your heritage language as any other language. I would start using the same methods as for non-heritage languages. If you know a few sentences, you might be faster in the beginning, but it will still be long.\nThere is no magic that will free you from studying entirely", "created_utc": "1606860127.0", "edited": "False", "id": "geaz012", "is_submitter": "False", "link_id": "t3_k4usae", "parent_id": "t3_k4usae", "score": "6", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "colutea", "body": "I use BunPro for reinforcing grammar. It’s not that expensive, I think $30 a year and there you can search for the grammar points and do the drills. It also has a free trial for one month. Maybe you want to give it a try.\n\nMy issue with workbooks was that once I completed the exercises, I forget the grammar a few weeks later or I forget to keep track of what I need to revise.\nI only have sth like this for Japanese - for the same reason you mentioned, entirely different language than the others I know", "created_utc": "1606691535.0", "edited": "False", "id": "ge3c8m5", "is_submitter": "False", "link_id": "t3_k3d0gq", "parent_id": "t3_k3d0gq", "score": "1", "subreddit": "LearnJapanese", "subreddit_id": "t5_2qyls"}, {"author": "colutea", "body": "I used English to learn Japanese (my Native language is German). It improved my English since I encountered a lot of topics and words I usually wouldn’t talk about. I can recommend it - at that point my English was at a strong B2 :)", "created_utc": "1606499804.0", "edited": "False", "id": "gdsa93o", "is_submitter": "False", "link_id": "t3_k0xuv3", "parent_id": "t3_k0xuv3", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "colutea", "body": "Are you sure you are finishing Genki 1 in a week without any prior Japanese studies? How do you learn?\nRemembering takes time, learning is also a lot of repetition. It’s not about reading Genki 1, it’s about retaining what you learnt. \nJust a quick reminder that learning a language is a marathon not a sprint. Please also take your time - if you are serious - to actually go back to earlier chapters and see if you still remember.\n\nOther than that, I would also go for Genki 2.", "created_utc": "1606343534.0", "edited": "False", "id": "gdllv4u", "is_submitter": "False", "link_id": "t3_k0zzk6", "parent_id": "t3_k0zzk6", "score": "2", "subreddit": "LearnJapanese", "subreddit_id": "t5_2qyls"}, {"author": "colutea", "body": "The books cover both, vocabulary and grammar. Once you completed them, you have a solid base :) Also it teaches you the vocabulary in context which is better than blindly just learning lists of words.", "created_utc": "1606319849.0", "edited": "False", "id": "gdkaioz", "is_submitter": "False", "link_id": "t3_k0uca2", "parent_id": "t1_gdka8ow", "score": "3", "subreddit": "LearnJapanese", "subreddit_id": "t5_2qyls"}, {"author": "colutea", "body": "Start with Genki 1 and Genki 2 and then start with easy manga (Yotsubato, etc.) and Graded Readers. Starting with manga directly without any prior knowledge is too hard in the beginning. \nIf you don’t like Genki, you can also use Minna no Nihongo, Japanese from Zero, etc. However, without a solid base, you won’t come far. Even if you use a dictionary as your brain needs to understand how Japanese works. It is entirely different from any western grammar.\n\nThe books guide you through everything - vocabulary and grammar.", "created_utc": "1606319641.0", "edited": "False", "id": "gdka3rl", "is_submitter": "False", "link_id": "t3_k0uca2", "parent_id": "t3_k0uca2", "score": "3", "subreddit": "LearnJapanese", "subreddit_id": "t5_2qyls"}, {"author": "colutea", "body": "I am studying full time and working 20 hours per week and still learning languages, my studies are not related at all. So, I totally feel you. \nI try to prioritize my languages, for instance, I need to focus more on Japanese than on French. So I try to devote some time for it daily. I try to review vocab and Kanji daily and have regular classes on italki two times per week. The good thing about this vocab and grammar review is, that I can do them in between (e.g. between 2 lectures) and that I don’t have any disadvantage because I only need to focus on one word at a time and not on the whole stack. Thus, I can interrupt whenever needed.\nI also have 1-2 fixed days per week where I do more focused studies (using a textbook , etc.). For French, I incorporate more passive studying and try to read books regularly and watch videos but I don’t do it every day as the priority of this language is lower. \n\nIt is way slower this way, but I rather be slow than exhausted. I don’t slow down university, so I take the normal amount of classes and so far it works out well. Languages are a hobby for me, I like having fun with them and not getting stress. The teachers also help to sometimes get this extra extrinsic motivation to continue and not give up, even though there are times, where it is difficult (e.g. examination phases).\n\nSome also recommend listening to music or podcasts for some passive learning during activities, but I am not the person for that as I need total silence for concentration. Even for household activities as I feel overwhelmed otherwise. But every person is different, so it might work for you.", "created_utc": "1605829921.0", "edited": "False", "id": "gcvzbhp", "is_submitter": "False", "link_id": "t3_jx7n8b", "parent_id": "t3_jx7n8b", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "colutea", "body": "Totally agree. I started learning English at school at the age of 11 as well and I also reached C1/C2. \nThe examples are countless. Also she should look at people like Luca Lampariello, who reached C levels for languages he started at adulthood.\nI hate it when people tell that something is impossible because you are too old.", "created_utc": "1602923593.0", "edited": "False", "id": "g934bzv", "is_submitter": "False", "link_id": "t3_jc30f2", "parent_id": "t1_g8zrso7", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "colutea", "body": "I am at a certified C1/C2 level and I understand everything what I understand in my native language. So I can watch movies without subtitles, read academic papers in English, etc. \nThat said, I don’t know all of the words I come across. Nor do I in my native language. And I don’t understand some songs neither in English nor in my first language. That’s pretty normal. \nAlso, don’t be too harsh, if you don’t understand movies all the time. Some people don’t speak clearly - try with clearer resources like TED talks. I don’t understand some people in my first language neither.\n\nStraight after school, I was at an upper B2. I started working at a company (part-time) which uses English as their primary communication language so I was forced to use the language nearly daily. That helped a lot with listening as well as speaking (and also reading + writing). Also, I read books mostly in English. About one year later, I was fluent. \n\nI know that that kind of exposure is not always possible but I think there are some alternatives:\n-\tfind language partners or English-speaking friends and talk on Skype, etc.\n-\tcontinue consuming as much native media as you can (books & movies)\n-\ttry to move on to more advanced topics (scientific articles, etc.), TED talks help a lot", "created_utc": "1602446147.0", "edited": "False", "id": "g8ipw73", "is_submitter": "False", "link_id": "t3_j86ol3", "parent_id": "t3_j86ol3", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "colutea", "body": "If you are not interested, don't. If you want to meet their expectations, you’ll need a high level and without any motivation this will be impossible, leaving you frustrated. Learn whatever you want and don’t live upon other's expectations.\n\nMy mother is Hungarian and my name also, so everyone expects me to speak it fluently. I don’t at all and at this point, I don’t bother to learn it. My parents live in Germany, my other relatives in Hungary - but they never talk to me (besides Facebook Happy Birthday posts).\nI don’t have any connection to the culture for now besides my mother. I pressured myself a lot for years but the day I stopped caring, I felt free and started Japanese. \n\nOf course, there are some people who are like - why do you learn XY instead of your heritage language?\nBut what is the point of learning a language only because you have roots in it? It’s your own business what you do. We can’t decide where we are born and who our parents are. Learn something you like to learn and have fun.", "created_utc": "1602235707.0", "edited": "1602235960.0", "id": "g878mzb", "is_submitter": "False", "link_id": "t3_j7o65i", "parent_id": "t3_j7o65i", "score": "6", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "colutea", "body": "Derzeit bin ich 100% im Home Office.\nIch arbeite in einem Softwareunternehmen als UX-Designer. Ich arbeite hier seit einigen Jahren, deswegen kann ich mich an die Stellenbeschreibung nicht mehr erinnern. Vor Covid-Zeiten hab ich 100% im Büro gearbeitet, aber theoretisch wäre es möglich 1-2 Tage pro Woche Home Office zu machen.\nEnde März sind alle Kollegen ins Home Office gegangen und weil es gut funktioniert hat, ist es nun jedem freigestellt, von daheim oder im Büro zu arbeiten. \nIch habe in einen guten Stuhl investiert, um mir die Arbeit zu erleichtern. Sonst war es wichtig, sich sehr regelmäßig mit Kollegen auszutauschen. Also entweder über Chat oder Videochat. Wenn alle Meetings generell über Video stattfinden, dann klappt das sehr gut. \nVieles meiner Arbeit besteht darin, anderen meine Arbeit zu zeigen, das geht im Video-Chat viel besser als in einem Raum voller Leute, da jeder die Arbeit vor sich sieht und es dementsprechend leichter ist, darüber zu sprechen. \n\nMeine Erfahrung ist sehr gut, ich möchte in Zukunft nicht mehr drauf verzichten und auch soweit es geht, weiter von zuhause arbeiten. Ich kann mich besser konzentrieren, weil es weniger Ablenkung gibt und auch bleibt mir mehr von meiner Freizeit, da die Stunde Arbeitsweg wegfällt. Ein reger Austausch mit Kollegen ist jedoch für die Teambindung wichtig.\n\nIch habe mir selbst feste Zeiten gesetzt, zu denen ich arbeite. Anschließend schalte ich alle Benachrichtigungen ab, um auch mal entspannen zu können. Es ist theoretisch einfach, mal \"schnell” was fertig zu machen, aber wenn man regelmäßig versucht, den gleichen Rhythmus einzuhalten, dann klappt das ganz gut, die Arbeit doch ruhen zu lassen.", "created_utc": "1602022421.0", "edited": "1602022635.0", "id": "g7xzckk", "is_submitter": "False", "link_id": "t3_j6af4z", "parent_id": "t3_j6af4z", "score": "1", "subreddit": "de_IAmA", "subreddit_id": "t5_30305"}, {"author": "colutea", "body": "I learn the same language combination and I don’t confuse them. In school I tended to confuse French and English all the time but with French and Japanese, there is no issue at all. \nHowever, getting a good level in Japanese takes way longer than learning French as the logic behind the sentences is way different. So don’t be discouraged. It’s a fun journey", "created_utc": "1601838234.0", "edited": "False", "id": "g7pktw3", "is_submitter": "False", "link_id": "t3_j4qqxb", "parent_id": "t1_g7lm27j", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "colutea", "body": "I started using Assimil and it’s been great so far. \nEdit: Sorry, Assimil is not an app, it’s a book.\n\nFor apps I can recommend Busuu for French.", "created_utc": "1601569158.0", "edited": "False", "id": "g7atg6y", "is_submitter": "False", "link_id": "t3_j3a2hc", "parent_id": "t3_j3a2hc", "score": "8", "subreddit": "learnfrench", "subreddit_id": "t5_2sucz"}, {"author": "colutea", "body": "I open it with Safari and I can see it quite big. The resolution is not the best though - that’s true.", "created_utc": "1601331407.0", "edited": "False", "id": "g701tye", "is_submitter": "True", "link_id": "t3_j0uupn", "parent_id": "t1_g6yy2r2", "score": "1", "subreddit": "LearnJapanese", "subreddit_id": "t5_2qyls"}, {"author": "colutea", "body": "iTalki is basically a platform where you can search for teachers. You can filter them by - of course- your target language but also by which other languages they speak and also by price range. \n\nThere are two types of tutors - community and professional. Many say that community tutors only do conversation classes and professional ones have more structured classes but I met community tutors as well who structure their classes more and professionals who don’t. Professional tutors need to complete a certification to get that status. \n\nEach tutor has an introduction video where they present themselves and their methods as well as a description of which experience they had, which other languages they speak and how they teach (conversation classes, homework, which books, etc.). And of course you can see how much they charge for a class. \nYou can book 30 minute trial lessons with them which cost often less than 50% their usual rate. This is valuable when you want to get to know the teacher first. \nThere is also no contract like subscription as on Lingoda. You can book classes one by one or buy them in packages (like 5 classes which is cheaper than buying them individually) but you don’t commit to buying more. \n\nThe prices vary but I think you can find a tutor that is within the price range that Lingoda has. \nI pay for instance for my Japanese community tutor  9 € for 45 minutes and for my French professional tutor 12€ for 60 minutes. This is very cheap considering I have 1:1 classes with no other students I have to listen too. \n\nHow the classes are structured depends on you and your tutor. \nYou can ask the tutor about a curriculum and they can come up with one or you have already a textbook and go through it with the teacher or you only ask the teacher about one structure beforehand and the teacher will search for exercises for you which you do in the class. Or you only talk the whole class or read a book together or correct an essay you wrote. The classes are very flexible. If you want to have structured classes - ask them. If you want to focus on conversation- you can do that as well. \n\nI lately focus on conversation with my tutors because that is the area I lack the most - they provide me instant feedback and if they see that I struggle with one structure, they will prepare some exercises to revise them together. I progressed a lot and feel more confident using the language.", "created_utc": "1601226475.0", "edited": "False", "id": "g6v542p", "is_submitter": "False", "link_id": "t3_izywuw", "parent_id": "t1_g6ub0rd", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "colutea", "body": "I took the classes for 6 months once a week. I didn’t have time for the sprints or marathon as I am also a university student. \nThe language was French. Well, Iiked it a lot in the beginning but I cancelled months later.\nI liked the structure of their classes - there is a curriculum which you can follow but you can also skip classes. Basically, you see the topics and you can book what you find most relevant. \n\nThey use PDFs which the teacher uses during the class. Basically, there is some vocab with example sentences and then grammar with some exercises. However, I found that the structure was very repetitive and it felt boring after a while. Also, the exercises were not very challenging and while there are some homework exercises, they don’t really help to enforce the knowledge. There are 1-2 grammar exercises and the 3rd and 4th task are the same every class (Which words did you find hard? Make sample sentences./Write a letter using the words we learnt today) - in the end I did not find it very engaging. Some teachers recommended additional exercise sheets or grammar books, etc. but most of them just went through the PDF.\n\nPlus, if you only take classes once per week it is very slow but to get this level certificates you need to complete 90% of the classes of that level. \n\nThe classes are small - most of the time there are 4-5 people per class but for me that were already too many people. We were supposed to read aloud the sentences in the PDF - everyone read one sentence and also for the grammar exercises we either typed them in the chat or everyone did 1 sentence in the exercises. There is no much time to go to deep into it and by the end of the class, you don’t speak that much but rather listen to others. The students level also varies so it might be that the teachers don’t complete the whole PDF because of too many people or one person taking too much attention. \nI once had a class where the others didn’t attend but there we finished the PDF 20 minutes earlier and the teacher didn’t know what else to do with me in the remaining time and finished the class 10 minutes earlier. \n\nThat being said, I think if you have time, the marathon might be a good idea where you get your money back but if you already know (like me) that you don’t have the time for it, rather search for an italki tutor. They cost the same but the classes are way more efficient as you talk all the time (and not only about 10 minutes in total) and the teacher can target the class for your needs. If you have difficulties in one area, the teacher can repeat it as often as you need. Also, the speaking practice is more efficient as you can have fluid conversations instead of just reading sentences or talking 1-2 minutes on a topic. \nI find it way more motivating than Lingoda as you have one person you see regularly instead of having a different tutor each time.", "created_utc": "1601198737.0", "edited": "False", "id": "g6tjkw8", "is_submitter": "False", "link_id": "t3_izywuw", "parent_id": "t3_izywuw", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "colutea", "body": "1) German\n\n2) Academic & Business usage level: English (C1-C2); Reading novels & talking about events/life: French, Japanese (A2-B1)\n\n\n3.a. \tEnglish: to read novels and understand TV shows: 2 years, to use it for work and for writing and discussing academic content: 8 years (Also consider, I started learning it with 11 - it also took some time until I was able to use my native language in business and university. If I knew that content already in my native language, it would have been faster but I developed the skills simultaneously in my native language and in English\n3.b. Japanese: 3 years and I am still a lower intermediate learner. Japanese is hard due to Kanji and a different grammar logic than the languages I already know.\n3.c. French: Classical false beginner situation, had classes in school for 4 years, didnt use the language for 4 years, started again. Currently learning it again for 6 months - progressing very fast as I already knew it some years ago to some extend.\n\n\n4a. For English I had classes in school, business & academic knowledge I got through usage; in university I had again a few classes but didn’t learn anything new there - I took them only for the C1 certificate (they don’t offer C2 unfortunately)\n4b. For French I had classes in school. Now I have a private language tutor on italki.\n4c. Japanese: studied for 1 year on my own, then took 2 years of classes at university - now back at self study with an italki teacher for conversation. We don’t do grammar exercises - I do them on my own and just practice talking with her.\n\n5) When I first learnt a new language? 0 😅 I was initially raised bilingual but my parents dropped the second language (Hungarian) for any reason. I was fluent (children level) but they didn’t talk to me in Hungarian anymore so I forgot 99% except pronunciation and how to read words. \nIn school, we started to learn English at the age of 9 but it was not serious learning. \n\n6) School 😅 But knowing English at a very good level is a big plus for the career and most of the content is in English so my motivation increased rapidely. I started French again because I like how it sounds. I started Japanese because of the beauty of the characters. This are aesthetical reasons but the reasons increased when I started learning as I also got to know the culture better, etc. Now I have a dozen of reasons why I learn both French and Japanese.\n\n7a. English: no real extra motivation needed, I used the language for everything (reading books, writing with friends, videos, TV shows, ...) \n7b. French: Reading books and having a rewarding experience when I understand a lot \n7c. Reminding myself of how great it would be when I walk through Japan and just understand everything that were just some random drawings. Reading books and watching easy content helps. Dry studying is boring - constant exposure is fun and effective.\n\n8.) Try to get down the basics with the help of a resource that is fun to you. If it is an app, use it. If it is a textbook, use it. There is no best method or worst method - there are so many ways today to learn the basics. Once you learnt them, move quickly to native content. You might bridge the gap with billingual content and once you feel confident with that, move to target language exclusive content. The type of content you can choose yourself. If you love TV shows, watch them. If you love reading, read. In the beginning, content aimed for children might be easier. \nAlso try to find a language partner (or tutor if you can afford it) for talking. That will help you to active the knowledge you acquired so you can actually speak.", "created_utc": "1601163608.0", "edited": "1601163870.0", "id": "g6qved0", "is_submitter": "False", "link_id": "t3_j0ag2m", "parent_id": "t3_j0ag2m", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "colutea", "body": "Or use various people :) But that you adapt their accent is true. \nI went on a two week student exchange in the US and I was at a family in Illinois. At night, when I heard them still speaking and I was in bed, I copied their talking by whispering. \n\nAfter these two weeks I had a pretty strong American accent that is remarkable of that area. I didn’t loose it so people ask me now if I used to live in the US. \nSo yeah, this is very effective. Before, in school they thought us a kinda British pronunciation but it is funny that mine turned American within a span of two weeks. During that time, I was at a solid B2 and I didn’t have contact to other Germans. I only called my family twice during that time. So these two weeks were enough to turn my pronunciations from bad British with heavy German accent into an American one with a slight foreign accent. \n\nIf you have the chance, you can try as well to live there for a short time span. Try to find a family, etc. where your usage of the language exceeds ordering food at a restaurant.\n\nIf you can’t do that, MP3s and language partners might help as well but it will take more time (week wise) as you are not exposed 24/7 to native speakers and have your native language coming in between all the time.", "created_utc": "1601161961.0", "edited": "False", "id": "g6qr9sm", "is_submitter": "False", "link_id": "t3_j07up3", "parent_id": "t1_g6p4tma", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "colutea", "body": "Yes - at the company I work I have many people who don’t speak German at all. It is an IT company. We communicate with each other in English and the colleagues learn German during courses at work. Their rent, etc is managed by the German HR department.\nI know many IT companies which are multi cultural. So if you want to work in this area you are fine.", "created_utc": "1601075316.0", "edited": "False", "id": "g6l13p6", "is_submitter": "False", "link_id": "t3_izcta6", "parent_id": "t3_izcta6", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "colutea", "body": "I study Japanese and French at the same time while I spend 80% on Japanese and 20% on French. Still, my French is progressing faster because it is more similar to the languages I already speak (French and English). \nHence, I need way less effort to pick up basic concepts like in Japanese where I also have to spend a lot of time on Kanji. \nIt is an advantage however that French and Japanese are not similar at all as I don’t confuse the grammar and vocabulary. \n\nHowever, it might be difficult with French and Italian as both are very similar so you might get confused. If you are stable on one language, the next Roman language should be quicker to pick up.", "created_utc": "1601073459.0", "edited": "False", "id": "g6kwy1c", "is_submitter": "False", "link_id": "t3_iziqml", "parent_id": "t3_iziqml", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "colutea", "body": "It takes time to get fluent :)", "created_utc": "1600986523.0", "edited": "False", "id": "g6h5u0w", "is_submitter": "False", "link_id": "t3_iz4c5m", "parent_id": "t1_g6gykz1", "score": "6", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "colutea", "body": "Italian for music. \nChinese is pretty helpful for all the industries as well.\nJapanese and Korean for robotics. \nSpanish for online community management.", "created_utc": "1600986461.0", "edited": "False", "id": "g6h5pzi", "is_submitter": "False", "link_id": "t3_iz4c5m", "parent_id": "t3_iz4c5m", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "colutea", "body": "By writing. You can use apps like HelloTalk or italki. The latter is very nice as it has prompts which you can take as a starting point. \nNative speakers will correct you and you can correct others as well in your native language. \n\nPracticing a lot helps. There is no other way than doing it all the time. It's like driving - at the beginning you have issues to just get it rolling and later, while driving you can eat a sandwich while talking to your friend. Anything takes time :)", "created_utc": "1600986178.0", "edited": "False", "id": "g6h57n5", "is_submitter": "False", "link_id": "t3_iz5nra", "parent_id": "t3_iz5nra", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "colutea", "body": "I don’t have any suggestions on verbs as it depends on the language. I rather learn sentences and if there were only 5, I would choose these:\n\n-\tI don’t understand\n-\tDo you speak English?\n-\tHello \n-\tThank you\n-\tBye", "created_utc": "1600985904.0", "edited": "False", "id": "g6h4pxw", "is_submitter": "False", "link_id": "t3_iyy7no", "parent_id": "t3_iyy7no", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "colutea", "body": "Please raise your child bilingual. \nMy father is bilingual (German -Native , Romanian - fluent ) and my mother tri-lingual (German - fluent, Hungarian - Native , Romanian - fluent) and when I was young my mother used to speak only Hungarian to me, taught me reading, etc. while my father spoke German. At home, I used most of the time Hungarian as my father was working all day but with the other kids and in kindergarten, I used German. \n\nI was completely fine. At one point, in school they told my parents that kids \"might get irritated\" if they are raised bilingual so the Hungarian stopped and my abilities are gone (I cannot understand myself anymore on recorded tapes where I sing Hungarian songs or read a book aloud, etc.).\nThat were different times but today, we know better. Kids won’t have issues later when they are raised bilingual. (See here for instance: https://www.sciencedaily.com/releases/2019/12/191219132915.htm)\nI got also mocked in school because of my Hungarian name and they kinda tried to integrate me by pretending I am fully German which I am not.  And the bullying did not stop only because they stopped teaching me a second language. Now, I am half-Hungarian with a Hungarian name who cannot speak Hungarian and that’s a shame. \n\nI also have a real-life example that it works fine - my cousins had the same situation with their parents and they were raised bilingual and today they have two native languages and also did not have any issues in school. \n\nWhen one of you speaks Russian and the other Hungarian with the kid, the kid will be able to distinguish them. For me, back then, I remember I called one language the \"mom-language\" and the other the \"dad-language\" and I believe your child will adapt the same way. \nChildren are smarter than we think. If you can change the language depending on with which person you speak, the child will also. \nI think it will be very happy in the future to know two languages. Also when your relatives also speak the languages - so that the kid can communicate with its grandparents. \n\nI don’t know anyone who regretted that their parents taught them two or three languages. I only know people (including myself) who are sad that they did not.", "created_utc": "1600985453.0", "edited": "False", "id": "g6h3wqv", "is_submitter": "False", "link_id": "t3_iyq2u0", "parent_id": "t3_iyq2u0", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "colutea", "body": "I can only read Postkarte and 17.August in the background and my native language is German haha 😅", "created_utc": "1600812684.0", "edited": "False", "id": "g69cqus", "is_submitter": "False", "link_id": "t3_ixt7fw", "parent_id": "t3_ixt7fw", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "colutea", "body": "Depends on the language. LingoDeer does it for the languages it teaches", "created_utc": "1600463177.0", "edited": "False", "id": "g5qrpgy", "is_submitter": "False", "link_id": "t3_ivefqr", "parent_id": "t3_ivefqr", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "colutea", "body": "I started learning Japanese in high school through English when my English was only around lower B2. I learnt a ton of new words and it helped me a lot. I understood enough however to not be blocked as I was comfortable reading the same books which I would read in my native language also in English.", "created_utc": "1600463003.0", "edited": "False", "id": "g5qrbl0", "is_submitter": "False", "link_id": "t3_iv3mce", "parent_id": "t3_iv3mce", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "colutea", "body": "I know many people who put languages on their résumé which they learnt in school but never practiced afterwards. Maybe they think learn once, know forever.\n\nWell, it does not work like that. I was bilingual as a kid (now I am also but with different language) and I forgot one of the languages entirely (Hungarian). I also don’t claim anywhere I know this language but I still know many people who would. And there is this other bunch of people who is like, I heard your parents are Hungarian and then talk Hungarian to me and I am like \"... I told you I forgot everything\" but they still don’t believe me and think I can’t just forget everything", "created_utc": "1600462782.0", "edited": "False", "id": "g5qqu95", "is_submitter": "False", "link_id": "t3_iv5wen", "parent_id": "t3_iv5wen", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "colutea", "body": "I started by myself, then took classes at university for four semesters and now have an italki teacher.\n\nThe classes at university were worth it as it was free and I understood some of the concepts better. My teacher was a native speaker so she also explained usage of phrases which are taught by a textbook but only used in certain situations. Downside is that you are exposed to many other people speaking bad Japanese (normal in the beginning) and you need to be aware of that to not pick up their pronunciation. When self-studying with Genki 1 before, I did everything with the CD so I was quite confident in my pronunciation and I was also happy to find that my teacher found it good as well. Basically I repeated everything on the CD. \n\nThey don’t offer intermediate classes anymore so I was back at self studying. However, I noticed in class that I had some difficulties with speaking and grammar, so I signed up for an italki teacher. I take weekly 45 min 1:1 classes with a community tutor and we talk about general topics like what I did in the week, hobbies, culture, etc. \nI am learning a lot. My active usage capabilities are far beyond my passive ones and this really helps. Getting more confident in speaking Japanese and also learning phrases which are relevant to what I love talking about. Phrases which I would not find in a textbook. \n\nHowever, to also train the other skills, I use textbooks on the side. I don’t go through them with my teacher, only if I find one grammar point hard. I think the value for me is bigger if I practice speaking instead of doing grammar exercises together which I can also do on my own (and being faster because I don’t have to wait for my class). If I don’t understand something, I have someone who I can ask. For the writing exercises, I use platforms like the italki community, HelloTalk or HiNative so I can get corrected. \n\nI really enjoy this approach with the combined approach - 1:1 classes and self study the most. I feel my progress is better and I am also more confident. In group classes you easily feel left behind or you feel like you are more far ahead and then miss the point where you don’t. Also in university there was way more pressure and I felt bad if I did not know what some others did. Here, I can fully concentrate on myself without feeling embarrassed as there is no peer pressure. I sometimes wanted to give up due to that (though I still learnt a lot) but my 1:1 classes make me motivated week after week.", "created_utc": "1600380238.0", "edited": "False", "id": "g5n1p7h", "is_submitter": "False", "link_id": "t3_iur2qd", "parent_id": "t3_iur2qd", "score": "4", "subreddit": "LearnJapanese", "subreddit_id": "t5_2qyls"}, {"author": "colutea", "body": "I am a German native speaker and a French learner. The R sound is entirely different. I struggle with the French r a lot as it seems to come from the throat while I produce the German R with my tongue entirely.\n\nI grew up in Bavaria (south Germany) where the R is even more extreme - it rolls a little and comes from the front. For the other German accents I think it comes somewhere from the back of the tongue but not from the throat like in French. \n\nThe American R was way easier for me to learn (I can’t produce the French one properly up to today).", "created_utc": "1600112274.0", "edited": "False", "id": "g59uetg", "is_submitter": "False", "link_id": "t3_is5mtt", "parent_id": "t3_is5mtt", "score": "0", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "colutea", "body": "Pick one resource and stick to it (as long it’s fun). You may try out some books and apps - but once you find one - don’t bother with the others too much.\n\nOnce you learnt the basics, search for a tandem partner or hire a tutor for conversation practice :)\nTry to immerse yourself a lot with the language. We have many series for children - KiKa is a public broadcaster. I think the series are online available too. Once you are more advanced - search for Funk - these are YouTubers also publicly funded with a variety of topics spoken naturally.\nFor books, children here use the Duden Leseprofi series.\n\nFor music, some people that come to my mind who use clear German are Rammstein, Nena and Bosse.", "created_utc": "1600099981.0", "edited": "False", "id": "g58uwvv", "is_submitter": "False", "link_id": "t3_isiktg", "parent_id": "t3_isiktg", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "colutea", "body": "10 years in English - but includes academic and business fluency. \nTook long as I learnt it from 5th grade on.\nFrom B2+ to C1-C2 took the longest - and most practice. I never lived in an English speaking country but I use it daily with colleagues and also at university.\n\nEnglish fluency did not help with Japanese yet. But I learnt that for becoming fluent I need to focus on speaking (writing follows naturally, also by reading a lot)🙈\nSo I hired tutors once I made it past the basic grammar points to push forward.\nI am learning it for almost 3 years now and I am lower intermediate atm. Kanji and different grammar logic than my native language (German) makes it take longer.", "created_utc": "1600099407.0", "edited": "1600099660.0", "id": "g58terw", "is_submitter": "False", "link_id": "t3_isekzv", "parent_id": "t3_isekzv", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "colutea", "body": "Its not a computer game :) So there is no download required;)", "created_utc": "1600093626.0", "edited": "False", "id": "g58eae2", "is_submitter": "False", "link_id": "t3_isi3b4", "parent_id": "t1_g58cq7m", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "colutea", "body": "Na Programmierung I usw. hatten wir auch. Es geht um \"speziellere\" Basismodule, die nicht so allgemein gehalten sind. Irgendwo wird bei jeder Uni gestrichen, wenn man kein Bindestrich-Fach studiert, hält man sich in dem entsprechenden Fachbereich mehr Optionen frei.   \nIch zB habe trotzdem einen Schwerpunkt in der Softwareentwicklung bekommen und war innerhalb dieses Schwerpunkts nicht eingeschränkt. Es gibt aber paar Schwerpunkte, die sich u.U. schwierig gestalten, und bei denen man als reiner Informatiker mehr Freiraum hat.   \nFür Leute die sich von vornherein unsicher sind, welchen Schwerpunkt sie haben wollen und welche Module sie genau belegen (was auch vom Studienverlauf abhängt), hält man sich jedenfalls mehr Türen offen. Die Anzahl der CP sind im Bachelor nunmal begrenzt - da kann man nicht 100% von Wirtschaft und 100 % Informatik-Grundlagen machen.\n\n  \nWenn man nur \"bisschen\" Wirtschaft haben will, kann man je nach Uni auch einfach so 2-3 Module in die Richtung belegen und das reicht u.U. schon. Außer man interessiert sich tatsächlich für betriebliche Anwendungssysteme aka SAP usw. Im letzteren Fall ist man mit Winf gut bedient.", "created_utc": "1599689106.0", "edited": "False", "id": "g4laqxz", "is_submitter": "False", "link_id": "t3_io32n2", "parent_id": "t1_g4beals", "score": "2", "subreddit": "de_IAmA", "subreddit_id": "t5_30305"}, {"author": "colutea", "body": "Ich würd lieber Informatik mit Nebenfach BWL empfehlen. Hab bzw studiere selbst Wirtschaftsinformatik und ich kann’s nicht empfehlen, weil die Uni einen bei der Wahl von Schwerpunkten, gerade wenn man ne Gewichtung im Informatik-Bereich haben will, einschränkt. \nEinige Module durfte ich nicht belegen, weil angeblich Basismodul XY Voraussetzung ist, aber Basismodul XY dürfen wir nicht belegen. \nZumindest ist’s so an der TU Dresden, weiß nicht wie das bei anderen Unis ist.", "created_utc": "1599470401.0", "edited": "False", "id": "g4be4p6", "is_submitter": "False", "link_id": "t3_io32n2", "parent_id": "t1_g4ba6df", "score": "1", "subreddit": "de_IAmA", "subreddit_id": "t5_30305"}, {"author": "colutea", "body": "Maybe it might help to start from the beginning by asking people about how they use flashcard apps, if they struggle and how. And for the notification idea to get some research how they currently deal with app notifications in general.\n\nMe personally, I don’t realize they are there, I see the icons but I don’t read them in detail and most of them I just ignore and dismiss. And that is every type of notification. \nWhat I appreciate on the other hand, about what one team does at work. They are in the analytics team and build a slack bot that posts some random analytics facts every day in the main channel. I like reading them during work but that channel is muted so I don’t get disturbed by them. I just read them when I have short breaks between meetings or generally just need some pause from the other stuff. They are short - 3 facts and only appear once per day so they don’t disturb anyone.\n\nPlus, this slackbot allows reading them whenever you want within the app you use all day.  With notifications , I would have the issue that I see it but I dismiss them for now as I considered them too disturbing in time.\n\nAbout the underlying issue of yours - that you struggle to actually output those words - I think everyone has them but I found to overcome it not by seeing the word in flashcard style all over again but to see it a couple of times in books, during speech, in videos,... so I think just general more exposure in your target language might help. I feel that passive vocabulary becomes active once I heard it in context used in various ways so my brain subconsciously got the usage context. Just reviewing flashcards all the time did not help because I don’t translate in my brain anymore nor do I think consciously about the meaning.  Once I practiced speaking a lot the way of thinking in my native language and then translating before saying disappeared. I mean, my passive vocab still lags behind my active vocab but I felt that I can only overcome it with more practice", "created_utc": "1599428621.0", "edited": "False", "id": "g49snll", "is_submitter": "False", "link_id": "t3_he3gg3", "parent_id": "t3_he3gg3", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "colutea", "body": "Apple Music has this new feature where they show the lyrics while the song plays. It even highlights the line the singer is currently at. Their collection of Japanese songs is quite large.", "created_utc": "1599424430.0", "edited": "False", "id": "g49l8fm", "is_submitter": "False", "link_id": "t3_ilvg4r", "parent_id": "t3_ilvg4r", "score": "1", "subreddit": "LearnJapanese", "subreddit_id": "t5_2qyls"}, {"author": "colutea", "body": "For Japanese, I would recommend to first learn the Kana (Hiragana and Katakana) and then start going through a beginner textbook. \nMeanwhile you can start learning Kanji - but not knowing them or only knowing a couple won’t stop you from reading - at least in the beginning. Many books for children use Furigana (so basically the reading written in Kana above the Kanji). I personally can recommend Wanikani for Kanji - some recommend also Remembering the Kanji by Heisig but actually use one of these two (or other method) besides your grammar studies. \n\nI would not recommend going through the book that does not have any Kana - you can learn them in less than a month if you are dedicated (there are many good apps and books out there, but good old paper and a table with them will do it as well).\nSome beginner books use Romaji (the writing without Kana/Kanji) for the first 2-3 chapters but then drop it. That is alright but don’t use a book that only uses Romaji (throughout the whole book).\nIt only slows you down on the long run - e.g. if you don’t understand a concept explained in the book, it might be hard to find it in Romaji only in other resources. Also for me it was a very rewarding feeling to just be able to read simple things (even if they are only basic greetings) written natively.\n\nI did like Genki as a textbook for the beginner level. I also worked with other books in Japanese class at university (Minna no Nihongo, Marugoto + another one that is written exclusively for that uni) but I liked it the best. After the first volume (there are 2), you are still in the beginner stage but you can start reading books aimed for foreigners (like the Graded Reader series). \nThere are many reviews for textbooks at the beginner level - pick the one that sounds promising to you and stick with it.", "created_utc": "1599417205.0", "edited": "False", "id": "g4986hx", "is_submitter": "False", "link_id": "t3_in5ze3", "parent_id": "t1_g485nqk", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "colutea", "body": "I think it depends on the TL as well. If you are Italian and then you want to learn Spanish, a lot of exposure through reading might be enough for a good understanding of the grammar. \nIf you are any European language speaker and don’t have any prior knowledge but you want to learn Japanese this approach will leave you frustrated. (I cannot speak for other Asian languages as I don’t speak them)\nJapanese depends a lot on the context, the word order (+ grammar) is completely different. Working with a dictionary for help might also not be helpful if you didn’t study grammar prior. \n\nJapanese does not have empty spaces between words so you might not know where a word starts and when it ends.\nWhen it’s written in Kanji it might be ok:\n日本に行きたいです。(日本🇯🇵に🇯🇵行きたい🇯🇵です)\nBut what if you see it in Kana only? How do you know when one starts and the other ends without having knowledge of grammar (and slightly some vocab as well):\nにほんにいきたいです。\n\nBut where I agree, that reading is necessary to understand the grammar in use. I think at one stage you need some studying of grammar but at the same time reading. A lot of reading. \nReading without grammar I think works once you are at an intermediate level where you understand the general grammar rules. I think there is no clear border but the weight on grammar studies decreases once you are at an intermediate stage and you continuously read material aimed for average people's language abilities of your TL. At one point, you will find yourself not studying grammar anymore at all. I think a lot of exposure through native material as well as a lot of output and interaction with others in your TL makes the difference between Intermediate and Advanced and advanced and fluent. \nI got fluent in English (includes academic usage abilities) by talking a lot to my colleagues in English as well as by consuming all the media in English. Past the intermediate stage, I did not study grammar at all but only used exposure. And that’s by living in Germany the entire time without living in an English-speaking country.", "created_utc": "1599381779.0", "edited": "False", "id": "g47rj71", "is_submitter": "False", "link_id": "t3_in5ze3", "parent_id": "t3_in5ze3", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "colutea", "body": "How much time of these two weeks could you actually spend on the language? What is your native language?\nThere is no set answer whether this is achievable or not as it matters whether you can spend 8 hours every day or just 30 min.", "created_utc": "1598915013.0", "edited": "False", "id": "g3izwx2", "is_submitter": "False", "link_id": "t3_ik46kk", "parent_id": "t3_ik46kk", "score": "0", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "colutea", "body": "German here too. I think so as well. I understand quite a lot with only studying their pronounciation and writing but no real studying. That said, English is also quite easy for a German. Except some sounds like th, but the grammar is pretty straightforward and there are no real polite forms or articles", "created_utc": "1598914769.0", "edited": "False", "id": "g3ize12", "is_submitter": "False", "link_id": "t3_ijxv5j", "parent_id": "t1_g3gym57", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "colutea", "body": "I just did the test for German (I am a native speaker) and I scored 150/150. However, I realized that the test was full of errors. \n\nFor example:\n3) Michael hat **sich** beklagt, **daß** Frank **ihn** keinen Brief **geschrieben** hat. \nThere, you should select which one (!) underlined (here bold) word is wrong. I selected *ihn* (which they also marked as correct (correct = ihm) but there is also a second error. “Daß\" is wrong as well. Since 1996, \"daß\" is written as \"dass\" with \"daß\" not being used anywhere anymore except old texts. So for a fluency test, I would certainly not use that writing.\n\n13) Sven **kommt** erst später, da er **hat ein** Referat.\nThere, also you could not select a wrong word, as the words themselves are not wrong but the order is. Correct would be: \"..., da er ein Referat hat\"\nSo for this sentence, a question where you should bring the words into order would make more sense instead of letting students select one wrong word. Cause that might imply that you can exchange it with a correct word but there is no better word unless you change the order. \n\nText comprehension:\n9) \"Sich einen namen machen“ bedeutet...\n\nSpelling error again. It’s \"Namen“ with *n* in uppercase and not lowercase. \nIt was written incorrectly in almost all of the answer possibilities (\"seinen namen ändern\", \"etwas einen neuen namen geben\", \"seinen namen behalten\"). Namen is always uppercase in that cases as it is a noun.\n\nI didn’t find the test difficult, I think a 10-11 year old German would be able to solve it but I think even they would realize the errors this test has. I would at least expect from a site that could assess your fluency that the creators themselves are fluent and don’t make this basic errors which could be basically pointed out by spelling correction software. That said, I would also not trust them that they are able to teach you the language effectively.", "created_utc": "1598794082.0", "edited": "False", "id": "g3cnx0j", "is_submitter": "False", "link_id": "t3_ijb05y", "parent_id": "t3_ijb05y", "score": "8", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "colutea", "body": "About if you are intermediate or not, here is a definition of the CEFR levels:\n\nhttps://www.examenglish.com/CEFR/cefr.php\n\nExample for B1 (lower intermediate): CAN ask to open an account at a bank, provided that the procedure is straightforward\n\nIf you say that you can hold a conversation, than you are more in A2 (CAN take part in a routine conversation on simple predictable topics). But I don’t know you or your abilities in detail so I cannot assess them. \nBut it might help.\n\nI think a lot of learning also happens without formal study. So if you say you understand most conversations, you might want to start looking into native material. Watching movies, reading books in your target language as well as searching for a language partner and practicing.\nYou can still use a textbook that is around A2-B1 and/or use a teacher on italki to furtherly improve your knowledge. \nBesides, writing diary entries in Spanish on italki or HelloTalk or... might help as well as natives could correct them for you. There is no clear path what to do next - try different approaches and see what works best.\n\nAbout many years ago when I was an intermediate English speaker, I started watching a lot of YouTube in English and also reading all of my books in English. A few years later (together with some regular conversations with foreign friends), I got fluent. The jump from intermediate to advanced is quite high and its a process over a good mix of regular input and output which cannot be controlled that much by a particular resource anymore.", "created_utc": "1598391637.0", "edited": "False", "id": "g2ugskk", "is_submitter": "False", "link_id": "t3_igl8rs", "parent_id": "t3_igl8rs", "score": "7", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "colutea", "body": "Well, I don’t have this issue when I delete all the devices in the app except one (which is the iPhone). Then, it works perfectly fine. But once I try to connect a second device, this starts happening.", "created_utc": "1598090088.0", "edited": "False", "id": "g2fzo5w", "is_submitter": "False", "link_id": "t3_gcwkav", "parent_id": "t1_g1dbx94", "score": "1", "subreddit": "bose", "subreddit_id": "t5_2ykqh"}, {"author": "colutea", "body": "No 😅 if you write with someone online, you can just copy & paste the kanji into a dictionary and then you'll have the reading. Theoretically you can neglect Kanji but you lose a lot. And also as Japanese doesn’t use spaces, a text with Kanji is more convenient to read. It takes years to master but if you ever want to get to a decent level, you will have to learn them. \n\nI don’t think that writing kanji by hand is necessary but I would try at least learn recognizing. \n\nHowever, if your goal with Japanese is only just going there once for a trip, I wouldn’t learn it as spoken language is more important then.", "created_utc": "1593039847.0", "edited": "False", "id": "fvwi98w", "is_submitter": "False", "link_id": "t3_hfb9vs", "parent_id": "t3_hfb9vs", "score": "1", "subreddit": "LearnJapanese", "subreddit_id": "t5_2qyls"}, {"author": "colutea", "body": "It really depends on yourself and on the language on how long it takes. E.g. if your native language has the sounds or if not. You just have to try it out :)", "created_utc": "1591827818.0", "edited": "False", "id": "ftmsxvo", "is_submitter": "False", "link_id": "t3_gz0htv", "parent_id": "t1_ftkj60g", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "colutea", "body": "I do about 10 minutes a day. Longer sessions are hard to concentrate on. \nI basically do it like this: \nPhase 1: Listen to it very slowly and repeat word after word\nPhase 2: Listen to it very slowly and repeat each phrase. \nPhase 3: Increase the speed and repeat 2. Usually in phase 1 & 2 I listen to it in 0.5x speed but sometimes I need 0.25x speed because the natural speed is too fast for me. If I do 0.25x speed, in phase 3 I do 0.5 x speed and then also repeating phase 3 with 1x speed.\nPhase 4: Try to speak on top of the speaker as simultaneously as possible.\n\nOnce I feel comfortable in phase 4, I move on and I am done with that lesson.\nThe amount of sentences I do depends on how much I progress in the 10 min I set.\nYou can progress to the next phase once you will comfortable with the former. So you don’t have any difficulties in repeating.\nYou don’t need to slow down the speech if you don’t need it. I slow down usually when I realize that I have difficulties in recognizing individual words.\n\nYes, shadowing is also effective if you don’t read alongside.", "created_utc": "1591740827.0", "edited": "False", "id": "ftiutyr", "is_submitter": "False", "link_id": "t3_gz0htv", "parent_id": "t1_ftgiwdp", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "colutea", "body": "I learn Japanese on Wanikani and they teach two words at the same time: 金玉 (testicles) and 玉ねぎ(onions). I described once a recipe to my Japanese teacher and confused them because they have the same kanji (玉=ball) in them 😂 and I also knew that there are yellow onions so gold (金) ball made sense for it. Well, she was... surprised.", "created_utc": "1591654445.0", "edited": "False", "id": "fteyfia", "is_submitter": "False", "link_id": "t3_gz8x5u", "parent_id": "t3_gz8x5u", "score": "24", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "colutea", "body": "I used (and still using) it from the beginning on for every language. It helps you with pronouncing words and also grammar (unconsciously). It helps you to also distinguish sounds your main language doesn’t have.\nEspecially for German, you need to watch out for different ch sounds (ach & ich), h (we have sth called \"stummes h\"), sch, different st sounds(1 is pronounced as st, other like sth/scht), double consonants, double vowels, ß etc. \nThese are things I noticed many non-native-German-speakers get wrong.\ni think it might be a good idea to have the book open with the text, listen along and then repeat phrase for phrase so you see both the written language as well as the spoken one. Our language does not really reflect the written one in some cases. So you need to see both at the same time.\n\nThese efforts helped me a lot to get fluent in English and also are helping me now to work on my French and Japanese. Tbh I still do shadowing for English each day as I want to get rid of my accent almost entirely. In English my focus is of course different than in languages I don’t study as long because I don’t need to concentrate anymore to understand it and I focus more on details while shadowing. \nYou can also record yourself when shadowing when you look at it after a few months you will see that you improved cause you were not able to distinguish those sounds in the beginning on that level you are at that time.", "created_utc": "1591639205.0", "edited": "False", "id": "fte3lwe", "is_submitter": "False", "link_id": "t3_gz0htv", "parent_id": "t3_gz0htv", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "colutea", "body": "Documenting it and collecting songs, videos,... sounds like a good idea and maybe basic vocab and grammar. It might be that it will be useful for historians. In regards of learning it, I don’t know you have to feel guilty to not learn it. There are people who still learn Ancient Greek or Latin. I think while your area is not as known worldwide it won’t get as much attention as the former but I think to some degree it will (for understanding e.g. language & folks). So maybe you could start a blog and collect everything related to it. I think if the language is dead people won’t focus on speaking themselves but understanding it. Collecting as much resources as possible is important. Maybe ask your family to record themselves speaking. \n\nMy fathers family has a rare German dialect that also has only around 200.000 speakers. I don’t speak it and didn’t bothered but my cousins use it to communicate together with each other. The whole family didn’t live in Germany for hundreds of years but the language was preserved so the dialect tells a lot of how the folks went there and where they came from originally and also how German looked like 100s years ago. However, there is a group which collects documents and also makes videos, etc with speakers to preserve at least these hints. \nI didn’t see any point in learning it myself as \n1) it is quite easy to understand (if you know also a little English, Dutch, German)\n2) It is only a dialect\n3) it has only a few speakers (so no real use for it. All speakers also know standard German)\n4) Languages change and develop over time (if you talk to your grandparents - granted your NL = their NL - you will see they use grammar, writing and words differently. That’s just how it is. However, we should always strive our best to help preserving history so we can learn from it in the future.", "created_utc": "1591638251.0", "edited": "False", "id": "fte1o9a", "is_submitter": "False", "link_id": "t3_gz3998", "parent_id": "t3_gz3998", "score": "21", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "colutea", "body": "That happened to me. My parents are both from Romania - my father has German ancestors, my mother Hungarian. That area where they are from basically consists of three different folks: People with Hungarian ancestors, German ones and entirely Romanian. The area belonged before WW1 to Austria-Hungaria and then became part of Romania. Basically, the people use their mother tongue (German, Hungarian) within their family and among friends and in school (schools were divided among languages) and used Romanian as a lingua franca (since childhood). So basically, every person there knows at least 2 languages at a native level.\nMy mother even knows all three of them at the fluent level with Hungarian the best (mother tongue) and German the least (but still C2).\nWell, they moved to Germany and I was born here. Until I was about 4 years old, I was able to communicate fluently (kid speech of course) in Hungarian and German (they didn’t taught me Romanian because they didn’t like that language for any reason). But then they moved to a conservative village where people told my parents that if they continue speaking two languages with me, I could never be fluent at both (the area was also kinda racist). So they stopped Hungarian and didn’t talk to me in that language at all. What happened? I forgot 99% of it and until today, I can only say hello and happy birthday to my relatives.\nI could have gotten three languages for free - but I got only one in the end (which is German). They always tell me that I can learn Hungarian anytime by myself if I want to and I have an advantage cause I was fluent once. That is a mystery. While for me, I don’t have difficulties to make the sounds Hungarian uses, I still lack grammar and vocabulary cause I never learnt them properly. If I wanted to learn it, I still need to undergo the same processes as someone who have never spoken this language before. The only difference is, I could have had it as my second mother tongue and it annoys me. In particular because my name is even Hungarian.\n\nI don’t blame my parents because they didn’t know it better that time. Even my teachers in elementary school tried to explain my introvert behavior with my foreign background. I was fluent in German and I loved writing stories and was among the top of the class. So my German skills were good. But still somehow I always had the feeling and was given the feeling by society that I don’t belong there but I didn’t know where I belong to. I was a kid. I didn’t get why I am German but somehow Hungarian and I knew Hungarian but suddenly I shouldn’t speak it anymore, etc etc. People in small, homogeneous contexts get anxious when people are different. I heard that in the last years, more and more immigrants moved to that area so the teachers and people are not like that anymore. Still in some degree but it got better. Still I can imagine that society has not overcome this yet entirely.\n\nI know, I could have starting to learn it now myself - but somehow I still felt hurt - so I didn’t. I am also afraid to talk to my relatives in broken Hungarian - I feel ashamed. This is completely not rational and being able to talk a little is better than nothing - but overcoming this childhood issues is not easy unfortunately. I am interested if other people also struggle with just starting their \"could've been native\" language because of similar feelings.\nStarting entirely new languages (like Japanese or French) was easy because they feel neutral to me.", "created_utc": "1591571384.0", "edited": "1591573055.0", "id": "ftbc32z", "is_submitter": "False", "link_id": "t3_gy8kw6", "parent_id": "t1_ft9bhk3", "score": "4", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "colutea", "body": "I chose via availability of resources. My first language is German (native), my second English, my third French and my fourth Japanese.\nI started Japanese in high school and I learnt it via English. The reason was that most textbooks and grammar resources were and are in English and in German were only few.\nMy French was not good enough to learn any other language with it (beginner level).\nI found also a positive effect. In high school when I started my level of English was around B1/B2 (now it is C1/C2). After a short amount of time I  noticed that my English also improved because I got more exposed to the language. Sure, I watched TV shows and such in English but I found that learning another language through it adds another level. \nThe reason is that in the new language some new words may occur in the vocabulary that you simply didn’t know yet. For me it was words like yurt, toil,... \n\nThat being said, it is needed that the language you choose for learning another language is at a sufficient level (at least intermediate). Otherwise you struggle to much with understanding the language you are using for studying instead of focusing on the new language.", "created_utc": "1591305281.0", "edited": "False", "id": "fswj4vn", "is_submitter": "False", "link_id": "t3_gwf71h", "parent_id": "t3_gwf71h", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "colutea", "body": "The Bose support replaced my first pair but the second one has the same issue. So this is 100% a Software issue", "created_utc": "1590614559.0", "edited": "False", "id": "fs0rk4a", "is_submitter": "False", "link_id": "t3_gcwkav", "parent_id": "t3_gcwkav", "score": "1", "subreddit": "bose", "subreddit_id": "t5_2ykqh"}, {"author": "colutea", "body": "I found out that Robomaker is under the AWS educate program: https://aws.amazon.com/blogs/publicsector/introducing-a-virtual-robotics-classroom-on-aws-educate/\n\nI have applied there and I am waiting now for their response. I will update this post once I got access", "created_utc": "1589558469.0", "edited": "False", "id": "fqq2vzf", "is_submitter": "True", "link_id": "t3_gif9bt", "parent_id": "t3_gif9bt", "score": "1", "subreddit": "robotics", "subreddit_id": "t5_2qh0p"}, {"author": "colutea", "body": "I found out that the issue is my MacBook. It seems like Gazebo 7 needs a graphics card which is powerful enough. I managed to get it to work on my old PC but it still very slow there though.", "created_utc": "1589303058.0", "edited": "False", "id": "fqe7lk9", "is_submitter": "True", "link_id": "t3_ge578f", "parent_id": "t3_ge578f", "score": "1", "subreddit": "robotics", "subreddit_id": "t5_2qh0p"}, {"author": "colutea", "body": "During the whole week I tried popping balloons and so far I only got two recipes - the window wall and the one from Isabelle :(\nToday’s evening I also spent hours to get more but I failed :(", "created_utc": "1586551666.0", "edited": "False", "id": "fn0za2o", "is_submitter": "False", "link_id": "t3_fw0q83", "parent_id": "t3_fw0q83", "score": "1", "subreddit": "AnimalCrossing", "subreddit_id": "t5_2ro2c"}, {"author": "colutea", "body": "I was in a similar situation a couple weeks ago - I needed to get home from Japan via Finland while borders in Finland were closed. I needed to stay in the transit area until my flight departs. In that case, it was 16 hours and I needed to sleep there (which meant sleeping on seats in front of the terminal while it was cold, lights turned on all night and only expensive beverages). But at least, I got home. \n\nI think for you it would be the same that you need to stay at the transit area. I would check that you get a flight where the transit is not too long and that there are enough connecting flights just in case your initial flight gets cancelled (given that the others depart).", "created_utc": "1586295110.0", "edited": "False", "id": "fmq8yj0", "is_submitter": "False", "link_id": "t3_fwoxoo", "parent_id": "t3_fwoxoo", "score": "3", "subreddit": "JapanTravel", "subreddit_id": "t5_2uylr"}, {"author": "colutea", "body": "Thanks for the guide^^", "created_utc": "1584640866.0", "edited": "False", "id": "fky3trk", "is_submitter": "True", "link_id": "t3_fj0nqf", "parent_id": "t1_fkx8izx", "score": "1", "subreddit": "JapanTravel", "subreddit_id": "t5_2uylr"}, {"author": "colutea", "body": "That worked out pretty well :) I collected meanwhile 5 more and none of them flipped through my book. And in the shrine at the Ueno park they gave me a lose one that I glued on top of the wrong stamp^^ \nI put a piece of paper underneath so that the wrong stamp can’t be seen anymore. Now I feel less embarrassed when asking for more Goshuin:D", "created_utc": "1584621464.0", "edited": "False", "id": "fkx7u12", "is_submitter": "True", "link_id": "t3_fj0nqf", "parent_id": "t1_fkktw6e", "score": "4", "subreddit": "JapanTravel", "subreddit_id": "t5_2uylr"}, {"author": "colutea", "body": "Ich glaube, die OTH Regensburg ist eine gute Wahl. Ich komme urspr. aus der Gegend und habe noch Kontakt mit Leuten, die dort studieren und denen hat’s gefallen bzw gefällts und sind zufrieden. \nAlso Praxis ist in der Branche sehr sehr wichtig und würde ich jetzt nicht nebenbei als Werkstudent arbeiten, würd ich ganz ehrlich nach dem Studium nicht wissen, wohin mit der ganzen Theorie. \nSchau wie gesagt auf jeden Fall nach der Gewichtung - da hilfst, den Studienablaufplan von nem WiWi und von einem Informatiker neben den Winf-Plan zu halten und zu vergleichen. \nDer Informatikteil sollte bestenfalls nicht nur Einführung in Java oder so sein.", "created_utc": "1578515642.0", "edited": "False", "id": "fdl1xms", "is_submitter": "False", "link_id": "t3_elh84w", "parent_id": "t1_fdi7h4g", "score": "1", "subreddit": "de_IAmA", "subreddit_id": "t5_30305"}, {"author": "colutea", "body": "Ich studiere Wirtschaftsinformatik. Ich muss sagen, ich würds nicht machen, zumindest nicht an der TU Dresden.\nInformatik kommt viel zu kurz - zumindest im Grundstudium. Man hat Programmieren I und II und das ist sehr einfach. Hab alles mit 1,x bestanden ohne je ein einziges Mal in der Vorlesung gewesen zu sein. Es ist im Prinzip das gleiche wie in der Schule (war auch in Bayern am Gymnasium) und nix neues. Sonst gibts noch theoretische Informatik, Datenbanken (hat man mit den Informatikern zusammen) und Softwaretechnologie wo man nochmal programmiert. Da reicht das Schulwissen nicht mehr, aber es ist gut machbar.\nBei Wirtschaft muss man zum Einen gut im auswendig lernen sein und zum anderen gut in Mathe. Es ist jetzt keine Raketenwissenschaft gefragt, aber sicher mit Funktionen (ableiten usw) und Gleichungen umgehen können solltest du schon. \nMathe hast du 4 Module. Mathe I und II und Statistik I und II. Das war zusammen mit Kosten-Leistungsrechnung bei uns so die Filterfächer. Aber es ist gut machbar, wenn du die Übungen daheim machst.\nDu wirst aber auch sehr viele uninteressante Fächer haben. Vieles wiederholt sich und vieles ist einfach nur langweilig. Wirtschaftsinformatik-Einführung ist eines solcher Fächer. Jahresabschluss auch. Da darfst du dann anhand vom Gesetz begründen, wie was warum im Jahresabschluss abgerechnet wird und darfst dir nichtmal was markieren.\nIm Hauptstudium ist’s gut, da darfst du relativ frei wählen - auch Informatik-Module, allerdings kann’s passieren dass du sehr viel nacharbeiten musst, weil du die Grundlagen-Veranstaltungen nicht gehabt hast. Projektmanagement-Module gibts auch einige, die sind auch recht interessant, weil auch vieles über Seminare geht. \n\nWenn du eher ein technischeres Studium haben willst, würd ich Informatik studieren ohne Wirtschaft-. Allerdings ist das auch zeitlich aufwendiger, weil die mehr Projekte haben und Aufgaben wo man was abgeben muss. Wir mussten zB in Mathe nie Übungen abgeben, die Informatiker schon. Zudem haben die Informatiker solche Projekte wie Softwaretechnologie 2. die mussten dann ein Semester lang ein Projekt bauen und einige haben gesagt die sind da 20 h/Woche allein an dem Projekt gesessen, ich kenn sogar welche, die noch mehr Zeit reingesteckt haben. Außer in den Projekten programmierst du aber auch in Informatik nicht sonderlich viel (und wenn mal auf Papier) und die haben auch sehr viel Mathe. Einige, die ich kenne haben genau deswegen abgebrochen - die wollten programmieren, aber haben es kaum gemacht.\nEinige sind dann an die FH gewechselt und waren da glücklicher, andere haben sich das selbst daheim beigebracht und ohne Ausbildung trotzdem nen Job gefunden.\n\nNichtsdestotrotz gibts auch Unis, wo Informatik stärker im Fokus bei den Winfs ist. Wichtig ist, dass du dir die Studienablaufpläne und Modulbeschreibungen ganz genau anguckst. Ich wurde böse überrascht damals, dass Wirtschaft so nen großen Anteil hatte.", "created_utc": "1578433480.0", "edited": "False", "id": "fdi0dlb", "is_submitter": "False", "link_id": "t3_elh84w", "parent_id": "t3_elh84w", "score": "2", "subreddit": "de_IAmA", "subreddit_id": "t5_30305"}, {"author": "colutea", "body": "I am learning Japanese in university right now after having it studied for some time on my own during school. It is very helpful, especially when the teacher is Japanese as they exactly know what is more common and not. That said, the downside is that you have to listen to bar Japanese as well from your fellow students and you really have to take care to not adapt is which could happen fast in a classroom setting. Doing shadowing, etc at home helps to not copying the mispronounciation.\nCareerwise I don’t think that Japanese is a language you will use much but I would still include it in the resume as it shows that you are willing to learn a lot and are dedicated enough to not give up when things get hard. I think it is commonly known that Japanese is not as easy to learn as Spanish, French or any other language that is somehow related to English.", "created_utc": "1578090586.0", "edited": "False", "id": "fcyzkrs", "is_submitter": "False", "link_id": "t3_ejhwkc", "parent_id": "t3_ejhwkc", "score": "4", "subreddit": "LearnJapanese", "subreddit_id": "t5_2qyls"}, {"author": "colutea", "body": "Hey there :) Thank you very much.\n\nEdit: I just sent you a DM :)", "created_utc": "1577784019.0", "edited": "1577800125.0", "id": "fcmo98j", "is_submitter": "False", "link_id": "t3_ehdxef", "parent_id": "t1_fcm314l", "score": "1", "subreddit": "LearnJapanese", "subreddit_id": "t5_2qyls"}, {"author": "colutea", "body": "Thank you 😊\n\nEdit: I just sent you a DM :)", "created_utc": "1577699612.0", "edited": "1577800139.0", "id": "fcjqk71", "is_submitter": "False", "link_id": "t3_ehdxef", "parent_id": "t1_fciu1oi", "score": "2", "subreddit": "LearnJapanese", "subreddit_id": "t5_2qyls"}, {"author": "colutea", "body": "Or even if the writing is different if it is a foreign name. Please just ask just ask how to pronounce instead of making jokes about it. No, it is not a spelling mistake. The same name might exist in different cultures only written differently.", "created_utc": "1577055330.0", "edited": "False", "id": "fbshlvx", "is_submitter": "False", "link_id": "t3_ee5yqm", "parent_id": "t3_ee5yqm", "score": "1", "subreddit": "LifeProTips", "subreddit_id": "t5_2s5oq"}, {"author": "colutea", "body": "Do you also write them down? I also do what you described - that really helps with recognizing reading but the moment I try to write it down I really need to think a lot about how it looks like", "created_utc": "1575574030.0", "edited": "False", "id": "f9rblmb", "is_submitter": "True", "link_id": "t3_e6jp91", "parent_id": "t1_f9rapzn", "score": "1", "subreddit": "LearnJapanese", "subreddit_id": "t5_2qyls"}, {"author": "colutea", "body": "Thank you^^ I find the idea with the paper very creative.", "created_utc": "1575573894.0", "edited": "False", "id": "f9rb9no", "is_submitter": "True", "link_id": "t3_e6jp91", "parent_id": "t1_f9rak6z", "score": "1", "subreddit": "LearnJapanese", "subreddit_id": "t5_2qyls"}, {"author": "colutea", "body": "This is how I do it actually:D With the readings (Kun & Onyumi) I failed to memorize even a few of them so I moved to vocab quickly", "created_utc": "1575573712.0", "edited": "False", "id": "f9rat7z", "is_submitter": "True", "link_id": "t3_e6jp91", "parent_id": "t1_f9r9s5f", "score": "2", "subreddit": "LearnJapanese", "subreddit_id": "t5_2qyls"}, {"author": "colutea", "body": "That sounds like a very polished plan ^^\nThanks for your reply :)\nThe idea with the worksheets sounds great - also I didn’t think about looking into the workbooks after actually „knowing“ the kanji.\nI also have the cards though I didn’t know of how to study them as there is so much information on it. But I think I‘ll give them another shot.\n\nIt is so interesting to read how each person learns ^^", "created_utc": "1575573673.0", "edited": "False", "id": "f9rapy3", "is_submitter": "True", "link_id": "t3_e6jp91", "parent_id": "t1_f9qyahh", "score": "2", "subreddit": "LearnJapanese", "subreddit_id": "t5_2qyls"}, {"author": "colutea", "body": "Wow, that sounds great.\nWhere do you research the nuance? Do you have a particular recommendation? \nI realized that it is really hard to find the right usage for the word - like for example the word 心 means heart - I used it in a presentation for the sign heart and my Japanese teacher (who is Japanese) told me that it is used only for the heart in the body and not drawings :D", "created_utc": "1575573279.0", "edited": "False", "id": "f9r9r5p", "is_submitter": "True", "link_id": "t3_e6jp91", "parent_id": "t1_f9qpd9f", "score": "3", "subreddit": "LearnJapanese", "subreddit_id": "t5_2qyls"}, {"author": "colutea", "body": "See my reply :)\nWhat are you using currently? Are you satisfied? \nI am very interested here in experiences of others -not only to get inspiration but also motivation to know that I am not the only one :D", "created_utc": "1575572938.0", "edited": "False", "id": "f9r8wvm", "is_submitter": "True", "link_id": "t3_e6jp91", "parent_id": "t1_f9qxlz0", "score": "1", "subreddit": "LearnJapanese", "subreddit_id": "t5_2qyls"}, {"author": "colutea", "body": "What I really don’t like about Anki is that how the cards are presented is really not my way of learning.\nLike there is stuff missing like type in the word yourself, here is a quiz, order cards, etc.\n\nI really tend to say I knew it though I don’t. Even if it’s a small mistake like a forgotten っ.\nBy time, stuff like this adds up. \n\nAre you guys also struggling with these issues? I cannot imagine I am really the only one^^", "created_utc": "1575572867.0", "edited": "False", "id": "f9r8qgm", "is_submitter": "True", "link_id": "t3_e6jp91", "parent_id": "t1_f9qpq5w", "score": "2", "subreddit": "LearnJapanese", "subreddit_id": "t5_2qyls"}, {"author": "colutea", "body": "Found a pretty good answer key here: https://sites.google.com/site/piercenihongo/workbook\nIf sb is also looking for it.", "created_utc": "1462134300.0", "edited": "False", "id": "d2osduw", "is_submitter": "True", "link_id": "t3_4gdqi9", "parent_id": "t1_d2os2a8", "score": "2", "subreddit": "LearnJapanese", "subreddit_id": "t5_2qyls"}, {"author": "colutea", "body": "Thanks so much.", "created_utc": "1462133388.0", "edited": "False", "id": "d2orstp", "is_submitter": "True", "link_id": "t3_4gdqi9", "parent_id": "t1_d2hiy4b", "score": "1", "subreddit": "LearnJapanese", "subreddit_id": "t5_2qyls"}, {"author": "colutea", "body": "Yeah, but I only get a preview on scribd.", "created_utc": "1462133364.0", "edited": "False", "id": "d2ors8w", "is_submitter": "True", "link_id": "t3_4gdqi9", "parent_id": "t1_d2gsfho", "score": "1", "subreddit": "LearnJapanese", "subreddit_id": "t5_2qyls"}, {"author": "colutea", "body": "Thanks!", "created_utc": "1462133346.0", "edited": "False", "id": "d2orruc", "is_submitter": "True", "link_id": "t3_4gdqi9", "parent_id": "t1_d2h0cdp", "score": "1", "subreddit": "LearnJapanese", "subreddit_id": "t5_2qyls"}, {"author": "colutea", "body": "Okay, I found a resource for the workbook listening: https://www.youtube.com/watch?v=7WLW6D6r_ng\n\nIf anybody knows where to find the answer keys for the work- and textbook, tell me:) Also, if you have any experiences with the Kanji look and learn.", "created_utc": "1461605842.0", "edited": "False", "id": "d2gsd98", "is_submitter": "True", "link_id": "t3_4gdqi9", "parent_id": "t3_4gdqi9", "score": "1", "subreddit": "LearnJapanese", "subreddit_id": "t5_2qyls"}, {"author": "colutea", "body": "This really helped, thanks.", "created_utc": "1461605145.0", "edited": "False", "id": "d2grtyo", "is_submitter": "True", "link_id": "t3_4gdqi9", "parent_id": "t1_d2gmg6x", "score": "2", "subreddit": "LearnJapanese", "subreddit_id": "t5_2qyls"}, {"author": "colutea", "body": "It was the first edition and it was only 30 $ with textbook and workbook together. So I saved a lot of money, as the Genki textbook costs about 80 $ here and the workbook about 30, so that's the reason. ", "created_utc": "1461605069.0", "edited": "False", "id": "d2grrv2", "is_submitter": "True", "link_id": "t3_4gdqi9", "parent_id": "t1_d2go3aj", "score": "1", "subreddit": "LearnJapanese", "subreddit_id": "t5_2qyls"}]