[{"author": "Cooliceage", "body": "This was amazing to watch in person! They are both great great people as well so very nice to have such a supportive community and great game to boot!", "created_utc": "1666822804.0", "edited": "False", "id": "itwycs8", "is_submitter": "False", "link_id": "t3_yduq9s", "parent_id": "t3_yduq9s", "score": "3", "subreddit": "toptalent", "subreddit_id": "t5_3ptyd"}, {"author": "Cooliceage", "body": "I think there are kinda 3 reasons, in order, for why most (not including heritage speakers) learn a language in the US.\n\n1. It is incredibly common to hear/another community speaks it very close nearby/can be used very easily. This is why Spanish is so popular in the US. Most Americans won't spend a ton of time learning a language they can't easily access, even if it's spoken widely far away.\n2. The language is used in a rich place. A lot of times this means financially, but also (according to whatever stereotypes present in someone's head) culture richness. This is why French/German are also studied often.\n3. There is some political/cultural trend. This is Mandarin and Korean nowadays. It was Arabic from some time during some wars in the middle east. Before that it was Russian.\n\nHindi doesn't really have any of this going for it. It is a very commonly spoken language, but not even all Indian immigrants to the U.S speak Hindi and not some other Indian language. India is not yet a very rich country and bollywood is not as powerful as k-pop in its trendsetting abilities (currently). Trends might change though. Just look at China or Japan.\n\nHonestly you can switch the language in most of your sentences and you'll realize it pretty well. Why don't people learn Arabic, or Turkish, or Polish, or Creole? I think the best comparison is \"why don't people learn Bengali?\" It just isn't viewed as usable, or applicable, or  cool. That's just how it is right now. Doesn't take away from the language.", "created_utc": "1666654399.0", "edited": "False", "id": "itnlp0n", "is_submitter": "False", "link_id": "t3_yclmz7", "parent_id": "t3_yclmz7", "score": "22", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Cooliceage", "body": "Still pretty impressive overall. It’s tough to get pbs when it really depend on tps spam and not pausing at all that point.\n\nAlso that 3rd scramble is soooo annoying. Cmll skips are great, but I always pause way too long thinking it could be adjacent swap.", "created_utc": "1666289235.0", "edited": "False", "id": "it3lt1o", "is_submitter": "False", "link_id": "t3_y89khp", "parent_id": "t3_y89khp", "score": "3", "subreddit": "rouxcubing", "subreddit_id": "t5_yb0ad"}, {"author": "Cooliceage", "body": "Another thing that agglutinative languages tend to have is more possible endings that can be added to the end that tend to be separated words than romance languages, and all of which are stacked on each other rather than having a unique ending for a specific case.\n\n\nHere’s an example from Turkish, which I know:\n\nYemiyebilirdim - I could have not eaten \n\nYe - eat (verb stem)\n\nMi - negation\n\nEbilir - conditional/can\n\nD - past\n\nIm - first person singular\n\n\nHope this helps!", "created_utc": "1665364326.0", "edited": "1665382337.0", "id": "irphks4", "is_submitter": "False", "link_id": "t3_xzpkwi", "parent_id": "t1_irp8vkp", "score": "16", "subreddit": "linguisticshumor", "subreddit_id": "t5_2vwiq"}, {"author": "Cooliceage", "body": "So are ao5s in wca averaged and not truncated like singles are?\n\nAlso very very nice infographic Stewy!", "created_utc": "1664080956.0", "edited": "False", "id": "ipsy9da", "is_submitter": "False", "link_id": "t3_xna5uj", "parent_id": "t1_ipsjgd6", "score": "2", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "Cooliceage", "body": "Congrats on the pb! Very fast turning honestly\n\nInteresting how you use your ring finger for R moves. It’s very rare to see non pinky use, since generally it’s harder to stably hold the cube like that, and you can’t do U2 double flicks, though eidos still work. Where did you learn that from?", "created_utc": "1663526102.0", "edited": "False", "id": "ioykofk", "is_submitter": "False", "link_id": "t3_xgjb30", "parent_id": "t3_xgjb30", "score": "1", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "Cooliceage", "body": "Tbh for your speed it’s really hard to give any advice with the way this was recorded. It’s hard to give the very specific advice needed (beyond get better lookahead) with it being hard to see anything. \n\nI dunno how good your AUF prediction is after pll, but you did get quite a few +2s so maybe something to work on.\n\nOnly thing I possibly noticed is maybe you could start recognizing CP during Oll (particularly cross solved cases solved) to help pll prediction. If you know coll recognition this it’s just that. For example on your first solve you know that since there’s a bar on top left and not one on the top tight it will be a diag corner swap pll. Dunno if you even might need it though based on your 2 sided recognition looking good.", "created_utc": "1663525610.0", "edited": "False", "id": "ioyjcbf", "is_submitter": "False", "link_id": "t3_xhdadb", "parent_id": "t3_xhdadb", "score": "8", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "Cooliceage", "body": "This is the most popular tutorial for learning roux, and I think it is very good - https://youtube.com/playlist?list=PLBHocHmPzgIjnAbNLHDycgaCP5IqiwnU9\n\nThis was the first series I found and what I first used to learn roux. It has some more algorithms which are slightly old, but I like how he uses the cube with only certain pieces attached - https://youtube.com/playlist?list=PL754ADDA2E38A21AA\n\nEither one works as long as you making sure you’re doing the method right (you shouldn’t rotate ever, and u perms basically never happen in LSE so don’t make those mistakes)\n\nAlso if it’s complicated don’t worry. I used it to get my first sub 1 minute solve so it’s beginner friendly. Good luck!", "created_utc": "1663137705.0", "edited": "False", "id": "iod4pdd", "is_submitter": "False", "link_id": "t3_xd06w7", "parent_id": "t1_iod45jy", "score": "1", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "Cooliceage", "body": "No you don’t need to wait 9 years, but you basically do need to learn full cfop (or some other method like roux). After that it’s lots of good practice", "created_utc": "1663117826.0", "edited": "False", "id": "ioc3eb7", "is_submitter": "False", "link_id": "t3_xd06w7", "parent_id": "t1_io8v2tw", "score": "3", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "Cooliceage", "body": "When you say corporation do you mean mega companies or just any group of people working together?\n\nI just don’t understand how you can love corporations. Chevron on the ethyl group killed millions with their use of lead gasoline, knowing the side effects. Banana corporations pushed for coups in Central American countries. Heck even the first modern corporation, the Dutch East India Company’s entire purpose was colonization and slavery. I can maybe understand thinking corporations are some necessary evil, or these foul actions aren’t a systemic thing, but I think it’s bizarre how you can “love” a non-democratic institution with lots of power and profits as the main or only motive.\n\nAlso just for a fact companies don’t have to be efficient to be profitable. Hell even nowadays companies like Uber aren’t profitable.", "created_utc": "1663113004.0", "edited": "False", "id": "iobsiyl", "is_submitter": "False", "link_id": "t3_xdhx4f", "parent_id": "t3_xdhx4f", "score": "2", "subreddit": "The10thDentist", "subreddit_id": "t5_233710"}, {"author": "Cooliceage", "body": "Nah man it isn’t the actual wr so it’s bad /s.\n\nWhat does good even mean here. It’s a single player game. You set your own goals.", "created_utc": "1663039167.0", "edited": "False", "id": "io7nad9", "is_submitter": "False", "link_id": "t3_xckzh9", "parent_id": "t3_xckzh9", "score": "15", "subreddit": "Tetris", "subreddit_id": "t5_2r133"}, {"author": "Cooliceage", "body": "For classic the optimal move is probably to just put it in the well and adjust based on next piece lol", "created_utc": "1662869991.0", "edited": "False", "id": "iny4am5", "is_submitter": "False", "link_id": "t3_xagepg", "parent_id": "t3_xagepg", "score": "1", "subreddit": "Tetris", "subreddit_id": "t5_2r133"}, {"author": "Cooliceage", "body": "Ahh sorry on a rewatch you’re right. That’s all good then no worries", "created_utc": "1662754680.0", "edited": "False", "id": "inrrktm", "is_submitter": "False", "link_id": "t3_x01daj", "parent_id": "t1_inq3i5d", "score": "1", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "Cooliceage", "body": "Isn’t that just solving pieces you purposely break later with cmll? If you are only using algs that affect top layer and not the bottom then that’s CFCE. If you’re doing roux first 2 blocks then insert the cross edges that’s super inefficient", "created_utc": "1662725008.0", "edited": "False", "id": "inpspe6", "is_submitter": "False", "link_id": "t3_x5t0gs", "parent_id": "t1_inkr08j", "score": "1", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "Cooliceage", "body": "Late reply but just a couple things I noticed throughout.\n\nFirst is you do M with your right pointer finger? Usually it’s done with your left middle finger pushing down on the bottom of the cube. This will definitely help LSE if you switch.\n\nYour transition from FB to SB is pretty long so I can tell you aren’t planning all of FB m. Try to do, especially with those easy blocks.\n\nI think you aren’t super confident while solving and panic which causes you take quite a bit of time looking for pieces in front of you. Calm down and scan thoroughly but quickly.\n\nA small thing but at the end of second block make sure the top center is white/yellow by changing your last move from an R to r and vice versa. Will help LSE.\n\nAnd lastly you can start learning one look cmll. Around your time is when I learned it and it definitely helped to get me in the sun 20 range.\n\nGood luck!", "created_utc": "1662724567.0", "edited": "False", "id": "inprws2", "is_submitter": "False", "link_id": "t3_x01daj", "parent_id": "t3_x01daj", "score": "1", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "Cooliceage", "body": "There’s a reason people used to believe in Altaic. The grammar is bizarrely similar", "created_utc": "1662227297.0", "edited": "False", "id": "imyatpn", "is_submitter": "False", "link_id": "t3_x4fgqr", "parent_id": "t1_imwubzd", "score": "5", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Cooliceage", "body": "For a native Turkish speaker.\n\nLevel 0.5 - Azeri. Most Turks argue they’re the same language\n\nLevel 1 - Uzbek and other Turkic languages\n\nLevel 2 - nothing really. English by exposure probably\n\nLevel 3 - basically everything else. Hot take but maybe things like Korean/Japanese also. I don’t believe in Altaic but the grammars are just surprisingly similar.\n\nLevel 4 - Chinese\n\nMost other languages are probably equally hard, but I think Arabic for a Turk is probably slightly easier than an anglophone due to lots of loan words. Definitely also helps for French and probably somewhat for Farsi.", "created_utc": "1662227140.0", "edited": "False", "id": "imyag42", "is_submitter": "False", "link_id": "t3_x4fgqr", "parent_id": "t3_x4fgqr", "score": "0", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Cooliceage", "body": "In my heritage language I didn’t know all the months of the year or seasons until high school. Any scheduling conversation I always had in English, and since I was only in Turkey during the summer I never described anything outside that time period. Kinda insane how beginner that vocabulary is but I just never used it.", "created_utc": "1661801538.0", "edited": "False", "id": "imamkj0", "is_submitter": "False", "link_id": "t3_x0n1wk", "parent_id": "t3_x0n1wk", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Cooliceage", "body": "Dylan Miller averages low 6 and mains the rs3m 2020. Fahmi is sub-8 OH and also often uses the rs3m. The cube is $9. Once you get a decent cube and use lubricant the cube isn’t really doing anything, it just becomes personal preference about the “feel”", "created_utc": "1661713637.0", "edited": "False", "id": "im5v6p3", "is_submitter": "False", "link_id": "t3_wzy5tp", "parent_id": "t3_wzy5tp", "score": "3", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "Cooliceage", "body": "/uj I’ve always been curious about the answer to this one question - how much Turkish do you understand? I speak Turkish and from the YouTube videos I’ve seen Uzbek sounds familiar and then I understand nothing lol", "created_utc": "1661273440.0", "edited": "False", "id": "ilh6nj5", "is_submitter": "False", "link_id": "t3_wvoolg", "parent_id": "t3_wvoolg", "score": "7", "subreddit": "languagelearningjerk", "subreddit_id": "t5_37rt5"}, {"author": "Cooliceage", "body": "The first Assimil book is good for beginners (like A1 level) the advanced probably better for a B1 level. I’ve finished both and liked them a lot (though you really need the audio).\n\nThere are example lessons you can look at on the Assimil website. See which book appears for fit for your level", "created_utc": "1661083850.0", "edited": "False", "id": "il6mi6r", "is_submitter": "False", "link_id": "t3_wtvme0", "parent_id": "t3_wtvme0", "score": "5", "subreddit": "French", "subreddit_id": "t5_2rd5t"}, {"author": "Cooliceage", "body": "Yeah they have a very obvious accent, an American accent. If you went to Ireland do you think no one would be able to identify your speech as different?", "created_utc": "1660645460.0", "edited": "False", "id": "iki2ghb", "is_submitter": "False", "link_id": "t3_wov9td", "parent_id": "t1_ike5t4a", "score": "1", "subreddit": "greentext", "subreddit_id": "t5_2srr9"}, {"author": "Cooliceage", "body": "This basically completely forgets people who are learning family languages. In that case having a foreign accent basically marks you as “other” every single time you open your mouth. Even with accepting and kind family it makes sense that you wouldn’t want to be viewed differently than other people in your own family", "created_utc": "1660642841.0", "edited": "False", "id": "ikhz507", "is_submitter": "False", "link_id": "t3_wpfow6", "parent_id": "t3_wpfow6", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Cooliceage", "body": "Honestly you could probably become better than basically every AP French student if you study well and have decent pronunciation lol (speaking as someone who took AP French)\n\nIf you want to improve quickly and your specific goal is to converse then focus a lot more on vocabulary and listening practice. If you learn 10 words per day you will have 2100 words in 7 months, which is enough to have simple conversations. This sounds harder than it is.\n\nProbably get some sort of textbook. I recommend Assimil’s 2 books for French with audio, and make sure to learn basically everything fluently from all the beginner stages.\n\nr/French has a faq and resources so go to there and you can also nearly always google a French grammar question.\n\nFinally you have a French teacher at school, so you can ask them for help for especially pronunciation (if they’re a native speaker)\n\nGood luck!", "created_utc": "1660549583.0", "edited": "False", "id": "ikcuigm", "is_submitter": "False", "link_id": "t3_wordx7", "parent_id": "t3_wordx7", "score": "12", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Cooliceage", "body": "Don’t learn it if you don’t want to, as Esperanto should basically only be learned if you want to.\n\nI think Esperanto, like all languages and most skills, can be made useful if you try. I have actually met an Esperanto speaker online in a non Esperanto context, so it does happen, but it’s obviously not likely.", "created_utc": "1660488505.0", "edited": "False", "id": "ik9bpv0", "is_submitter": "False", "link_id": "t3_wo6tex", "parent_id": "t3_wo6tex", "score": "183", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Cooliceage", "body": "Turkish is different from a language like French with pronunciation since people don’t tend to slur together words or purposely leave out syllables from words to talk faster. What this means is that if you missed a syllable and don’t understand, it’s probably just because you fundamentally didn’t hear it (which can be solved by listening more carefully/asking the other person to speak louder) rather than something like French where learning all the general rules for how people combine words and change sounds in contractions is it’s own challenge. \n\nI do agree that since the endings are information dense missing anything can make it hard to understand, but I don’t think this poses a huge problem compared to trying to learn all the grammar.", "created_utc": "1660151626.0", "edited": "False", "id": "ijqquqr", "is_submitter": "False", "link_id": "t3_wkvk0j", "parent_id": "t1_ijpoz8s", "score": "8", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Cooliceage", "body": "Turkish is incredibly incredibly consistent for a natural language. Though I will say that that grammar is quite complicated. Rather than having lots of small words you add lots of endings, which imo is kinda not logical but it can be kinda complicated just because you have to learn a lot of endings, and then how they interact with each other. Turkish has vowel harmony, which can be interpreted as either beautiful, difficult, or an example of how lazy humans can be lol. \n\nThe phonetics aren’t that bad also (2-3 vowels not in English and that’s basically it) \n\nIt’s actually pretty approachable honestly, and the hardest part is probably just practicing enough for it to become natural and vocabulary (though there is quite a lot of French loan words so it isn’t as bad as Arabic)", "created_utc": "1659872217.0", "edited": "False", "id": "ijastwg", "is_submitter": "False", "link_id": "t3_wi6us0", "parent_id": "t1_ija758i", "score": "4", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Cooliceage", "body": "I’m biased but I think I agree, but probably option select between roux and perfect Petrus/APB is probably slightly better, and is probably more realistic as I think most common method for 2x2x3 nowadays is first block. If there’s a really easy extension it’s probably better.", "created_utc": "1659813071.0", "edited": "False", "id": "ij7xdeo", "is_submitter": "False", "link_id": "t3_whhmr6", "parent_id": "t1_ij7aa6y", "score": "1", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "Cooliceage", "body": "UWR is with roux. Fahmi (best roux solver) has the most sub 3s out of anyone iirc. Roux can insanely good times simply because the odds of you getting a sub-30 stm solution is so much higher on roux than cfop", "created_utc": "1659812786.0", "edited": "False", "id": "ij7wq79", "is_submitter": "False", "link_id": "t3_whhmr6", "parent_id": "t1_ij6usbw", "score": "3", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "Cooliceage", "body": "3 years to learn a proper hard language is definitely realistic, if you actually want to learn a proper language. $1000 seems like good motivation to learn a proper skill that can help you your entire life (this is what I think your father wants you to do, so I doubt loopholes would work)\n\nIf you only care about winning the bet, Esperanto (a constructed language designed to be easy) is probably your best option. Grammar is super easy, and there are available resources. Lernu is a popular site for starting out, and for all languages making flashcards with anki is recommended.\n\nMore important though is to ask your dad if this bet is actually legit and his terms. Would he accept Esperanto? My parents called it a fake language when I first started. What level do you need to be to \"speak\" the language, and who is going to judge you? Are you going to have to be able to read and write as well?\n\nI would say take this as an opportunity to actually try to learn a language and broaden your horizons. If you're in highschool you can probably take classes for a number of languages in school, and you probably have enough free time to study on your own. Good luck!", "created_utc": "1659602952.0", "edited": "False", "id": "iiw5k7i", "is_submitter": "False", "link_id": "t3_wfvdej", "parent_id": "t3_wfvdej", "score": "26", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Cooliceage", "body": "I’ve seen some of your videos for a couple years now and it’s a huge motivation so thank you for sharing these! It’s super impressive! Just 3 questions, since I plan on doing something similar in the near future.\n\n1. How do you make sure your pronunciation is actually good in these situations? Especially with a very different language (my plan is Korean) do you rely entirely on your tutor correcting you, and if it is not realistically possible to have that much tutoring how would you focus on pronunciation?\n\n2. If you were to a similar challenge for Esperanto, how would you spread the time and what resources would you use? I’m guessing a textbook is largely unnecessary since the grammar is significantly simpler.\n\n3. Thoughts on Assimil, or other language specific books, or is Teach yourself your go to for all of your languages?\n\nThanks so much and good luck learning Russian in the future!", "created_utc": "1659560809.0", "edited": "False", "id": "iitz1by", "is_submitter": "False", "link_id": "t3_wfdqai", "parent_id": "t3_wfdqai", "score": "8", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Cooliceage", "body": "I just do one-for-one translations with gender. I also put in idioms or phrases but never really full sentences that can be broken into smaller parts. If there’s some ambiguity or some or special fact about the word I’ll add an example sentence, and write some notes if needed. \n\nI think most people start making complicated decks so I might be in the minority, but I don’t find it difficult to memorize lots of words with simple decks, and they are much easier to make.  I am still doing this with my semi native language Turkish, just with lots of notes because direct translations don’t work as well usually.", "created_utc": "1659450786.0", "edited": "False", "id": "iinbhj8", "is_submitter": "False", "link_id": "t3_we1p07", "parent_id": "t3_we1p07", "score": "6", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Cooliceage", "body": "Assimil for grammar + listening + pronunciation and then anki for vocab is a really good combo that can take you really far without spending too much. I think both Assimil books with audio is less than a $100 and anki is free, and after finishing both books I think if you truly learned and ingrained the knowledge you could realistically be at a B2 level. \n\nAlso if you are only thinking about affordable and complete  and nothing else then the FSI courses are available online for free and they're definitely complete enough to a super high level.\n\nI don't know what extra work you're referring to (studying?) but just doing one Assimil lesson per day + reviewing words in anki is super solid for a long while. Then you simply google grammar points you don't understood completely (for example memorizing verb tables) and consume some content suitable for your level (for vocab). I don't see how Duolingo is superior to these, except maybe the regime setting aspect with the gamification.", "created_utc": "1659187258.0", "edited": "False", "id": "ii96zcw", "is_submitter": "False", "link_id": "t3_wblo4q", "parent_id": "t1_ii93ryf", "score": "5", "subreddit": "French", "subreddit_id": "t5_2rd5t"}, {"author": "Cooliceage", "body": "Any pieces of advice on improving French accent? I'm around a B2 level and I can hold solid conversations with people without the need to repeat anything, but still it's obvious I have an accent. I also know I can pronounce each of the sounds individually correctly (the vowels, the semi raspy r in words like très, liason) but in sentences it's always kinda off when it comes together.", "created_utc": "1658839190.0", "edited": "False", "id": "ihphjqj", "is_submitter": "False", "link_id": "t3_w89b0w", "parent_id": "t1_ihowrb7", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Cooliceage", "body": "This is coming from someone with a lot of experience cubing and with some world-class cubing friends in different events, so I'm going to be a little precise.\n\nThe 3x3 is significantly better for alternative events than any other cube. 3x3 one handed is probably the 3rd or 4th most popular event and it has its own quirks that I think are valuable (roux method better than cfop for example, and it's turning focus). There is also 3x3 blindfolded which is the perfect size for it to be challenging but also super fast at a high level. Also I would argue multi-blind (many cubes blindfolded) is the most impressive event in competitions. I can't do 4 or 5 blind but my friends say they are extremely challenging, while not for much benefit and are just incredibly difficult. Finally there is FMC (Fewest moves challenge) which is pointless on 2x2 as it's just 1,000s of algs and pointless on 4x4+ as the solve is way too long. 3x3 again balances it out while keeping a ton of super fascinating quirks that allow for top level people to spend hours studying the same scramble and all get close to computer optimal and still get different solutions. \n\nFinally 4x4 and up all reduce the cube to a 3x3 state in the end, so you literally have to do 3x3 on all big cubes anyway. There aren't any real alternative methods for big cubes, as they are pretty linear and do not get harder the bigger they are.\n\nStill you don't have to think 3x3 is your favorite puzzle, but it definitely has a lot of interesting aspects and explains why it's still a super super popular puzzle, even among people who go to competitions.", "created_utc": "1658483739.0", "edited": "False", "id": "ih64ft3", "is_submitter": "False", "link_id": "t3_w4wbis", "parent_id": "t3_w4wbis", "score": "2", "subreddit": "The10thDentist", "subreddit_id": "t5_233710"}, {"author": "Cooliceage", "body": "2 look cmll document: [https://docs.google.com/spreadsheets/u/1/d/1EdCeGlotJ76MyVw02\\_N1El\\_SXXSIMJRhYvZn4gZkQk8/edit?usp=drivesdk](https://docs.google.com/spreadsheets/u/1/d/1EdCeGlotJ76MyVw02_N1El_SXXSIMJRhYvZn4gZkQk8/edit?usp=drivesdk)\n\n&#x200B;\n\nFull cmll document from Anto (significantly better than Kian's that is so commonly recommended) - [https://docs.google.com/spreadsheets/u/1/d/1uc5V3G-kRH3qV5b6Lq1yzTjnqSMS3D3dZcsCIOiJqcI/edit?usp=sharing](https://docs.google.com/spreadsheets/u/1/d/1uc5V3G-kRH3qV5b6Lq1yzTjnqSMS3D3dZcsCIOiJqcI/edit?usp=sharing)\n\n&#x200B;\n\nHope this helps", "created_utc": "1658394010.0", "edited": "False", "id": "ih105sv", "is_submitter": "False", "link_id": "t3_w3ppyn", "parent_id": "t3_w3ppyn", "score": "1", "subreddit": "rouxcubing", "subreddit_id": "t5_yb0ad"}, {"author": "Cooliceage", "body": "Congrats on the NR! Stole it from Nicholas lol", "created_utc": "1658312784.0", "edited": "False", "id": "igwdx0l", "is_submitter": "False", "link_id": "t3_w36yxe", "parent_id": "t3_w36yxe", "score": "2", "subreddit": "rouxcubing", "subreddit_id": "t5_yb0ad"}, {"author": "Cooliceage", "body": "Midori is fluffy", "created_utc": "1657746917.0", "edited": "False", "id": "ig1l91x", "is_submitter": "False", "link_id": "t3_vy0z3g", "parent_id": "t1_ig0ffh8", "score": "0", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "Cooliceage", "body": "I mean realistically is was always more of a game than a language learning method (though it’s never been harmful just not the best method necessarily) Recently they went public so they are definitely trying to monetize a lot more and have been changing their business so there is that.", "created_utc": "1657216553.0", "edited": "False", "id": "if8hdwt", "is_submitter": "False", "link_id": "t3_vt56lj", "parent_id": "t1_if6xcm9", "score": "12", "subreddit": "DeepIntoYouTube", "subreddit_id": "t5_2wq8b"}, {"author": "Cooliceage", "body": "Max park was known for doing super simple (relatively speaking) solves and being sub-7 so yeah definitely. Most CFOP solvers don’t really do super complicated stuff in general. It’s a pretty straightforward method", "created_utc": "1657035845.0", "edited": "False", "id": "ieydf33", "is_submitter": "False", "link_id": "t3_vs03bl", "parent_id": "t3_vs03bl", "score": "29", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "Cooliceage", "body": "Ha I agree that it will not get changed, which is why I said that at the end of my first comment ;)\n\nBut you do actually bring up some interesting points I hadn’t considered before! I never do big cubes so I had not thought of the situation there, and agree it would definitely be a big mess no matter what.\n\nI’m guessing the only way this entire discussion could ever matter is if you were not counting +2s at home, in which case I feel like counting solves off by an M is probably fair, but still none of that is comp legal so not really relevant lol.\n\nJust out of curiosity how often are you off by one slice move with 3-style? Since corner exec is later than edge exec does that change anything? I have a couple of friends who are super good blinders and I tend to notice their dnfs tend to be off by more then one move but I don’t know myself!", "created_utc": "1656681759.0", "edited": "False", "id": "ieg67v2", "is_submitter": "False", "link_id": "t3_votq7y", "parent_id": "t1_ieg4bpz", "score": "3", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "Cooliceage", "body": "It could just stay the same for fmc and change for regular solving and/or blind. In regular solving there isn’t anything meaningfully different between being wrong by a U or a M for things like H perms, though I doubt the rules will ever change so roux solvers and MU epll users just have to live with it realistically.", "created_utc": "1656676971.0", "edited": "False", "id": "iefx364", "is_submitter": "False", "link_id": "t3_votq7y", "parent_id": "t1_iefnzv3", "score": "4", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "Cooliceage", "body": "Fahmi, the current fastest roux user, averages high 15 for second block in speedsolves. This is also true for Zhouheng and Kavin (who are all sub-7) I’m sub-12 and I think I’m around 17-18 in solves, mostly because I suck at lookeahead and I have maybe 3-4 cases for which my muscle memory is wrong.\n\nIf you are talking slow solves then maybe sub-15 movecount is a realistic goal for someone who’s sub-20? I’m not exactly sure, though I know I can do it and my block building sucks. (Fahmi has a slow solving session with high 13 average for sb). I’m not doubting you, but I’m just saying that this type of efficiency is hard and requires quite a bit of practice that even really good people don’t necessarily have. Any tips for your second block?\n\nAlso for a pseudo beginner it is good to give reasonable goals. My biggest advice for people starting out is to just solve. Without really much help and just some focus on not being too inefficient you can get sub-30. \n\nFahmi’s movecount - https://app.cubeast.com/public/share/uvbYM9h8xn79c5rjRSfsZr\n\nZhouheng semi-lucky ao12 -https://app.cubeast.com/public/share/pCKQ41HneDiKmuKrNphHkn\n\nKavin on bad turning cube - https://app.cubeast.com/public/share/", "created_utc": "1656434430.0", "edited": "False", "id": "ie2o2za", "is_submitter": "False", "link_id": "t3_vmdi0k", "parent_id": "t1_ie2i5iq", "score": "2", "subreddit": "rouxcubing", "subreddit_id": "t5_yb0ad"}, {"author": "Cooliceage", "body": "Second block in 11 moves or less is incredibly not realistic. Literally world class solvers are not that efficient by a good margin (closer to 15-16 moves). I’m sub-30 stm with roux in fmc and that’s my goal there.\n\nBeginner splits with 2 look cmll\n\n9 moves or less FB (x2y color neutral recommended or more)\n\n~17 moves SB\n\nI think 2 look cmll is around 18 moves? I would recommend learning full when you’re around sub-30/25\n\nLSE around 15-16 is realistic with no mistakes\n\n\nOf course if you don’t know what to do, do things wrong, or are wasting moves that don’t achieve anything then it will be longer.", "created_utc": "1656430999.0", "edited": "False", "id": "ie2fa93", "is_submitter": "False", "link_id": "t3_vmdi0k", "parent_id": "t1_ie0t6vo", "score": "1", "subreddit": "rouxcubing", "subreddit_id": "t5_yb0ad"}, {"author": "Cooliceage", "body": "I use left, but it isn’t a must. It’s probably ever so slightly better, mostly because regripping from cmll to lse is easier if you don’t use the same hand for both", "created_utc": "1656064585.0", "edited": "False", "id": "idjh6ku", "is_submitter": "False", "link_id": "t3_vjgene", "parent_id": "t1_idj0k43", "score": "1", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "Cooliceage", "body": "One handed and my Tengyun V1", "created_utc": "1656064268.0", "edited": "False", "id": "idjgts1", "is_submitter": "False", "link_id": "t3_vjgene", "parent_id": "t1_idjb09v", "score": "3", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "Cooliceage", "body": "What’s funny is that Gilles Roux actually came up with roux due to messing around with U-Perms and seeing how they don’t affect corners, so in a way messing up a u perm connects you to the method more than you’d think!", "created_utc": "1656014067.0", "edited": "False", "id": "idgzamq", "is_submitter": "False", "link_id": "t3_vj3v0r", "parent_id": "t3_vj3v0r", "score": "68", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "Cooliceage", "body": "With 2 look cmll and reasonable efficiency your solves should be around 65 moves. If you are solving at 2 minutes that means you are averaging one turn every 2 seconds, and since you should be executing cmll relatively fast it’s probably slower than that for most of the solve. I don’t say this to criticize but just for information. Try doing a couple solves and counting how many moves your solves are to see if this is a major problem or not (don’t worry if it’s like 75 but if it’s much more you probably don’t know how to do one of steps correctly and should rewatch a guide)\n\nThis means either you are wasting a lot of moves  that don’t do anything/being really inefficient or you are pausing a lot. \n\nWhen I started out with roux pausing was my huge issue. You have to learn how to look around the cube and simply find the pieces you want. Around your speed you probably can literally look at every piece you haven’t solved yet (so especially during second block or the end of first block) and think “is this piece useful. If yes solve it/find the other piece that goes with it and pair, if no move on and don’t look at it again” I think finding edges in general are easier than corners also to help your searching problem. Also for color neutral solving you do not need to memorize which colors go in the front and back of your blocks. Look at the centers during inspection. Even world class people like Feliks do this.\n\nSpecific steps tips:\nWatch this video for understand how first block is fundamentally built and understand the 2/3 general approaches (Square + Pair, Dl edge + 2 pairs, Line block)\nhttps://youtu.be/0Cq3YDud1dA\n\nSecond block make sure you understand how to pair pieces using the m slice, and all the pair insertions without rotations. Never rotate.\n\nCmll is just 2 look. Try to learn proper finger tricks here\n\nLSE: learn how it works intuitively. How things like M’ U2 M flip the front 2 pieces, how you can set up to arrow cases, doing M’ E2 M E2 for dots and M2 U2 M2 U2 for bars in 4c, recognition of good and bad edges (make sure you have the right center up every time!) You don’t really need a complex recognition method for 4c like dfdb. That allows you to know the optimal way to solve every time but as long as your are trying to match pieces (the right solutions tend to make bars and lines that you don’t break) you will probably be close to the optimal solution anyway.\n\n\nHope this helps!!!", "created_utc": "1655923616.0", "edited": "False", "id": "idc4gxg", "is_submitter": "False", "link_id": "t3_vhwzx1", "parent_id": "t1_ida0d3g", "score": "1", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "Cooliceage", "body": "Metronome practice isn’t that useful, but general consensus is to turn more smoothly rather than spamming. You can get very far with just calm consistent turning. Definitely sub-15 and probably sub-10, though the lookahead aspect of that only starts to matter around sub-20. For someone who’s sub-40 it’s probably better to just focus on making sure your solutions are reasonably efficient and to learn to look around the cube efficiently to find pieces.", "created_utc": "1655922186.0", "edited": "False", "id": "idc1a7m", "is_submitter": "False", "link_id": "t3_vhwzx1", "parent_id": "t1_ida82q3", "score": "1", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "Cooliceage", "body": "ZZ is basically however many algs you want to learn with ~500 being max and 28 being min", "created_utc": "1655755949.0", "edited": "False", "id": "id3ksh0", "is_submitter": "False", "link_id": "t3_vgtdh6", "parent_id": "t1_id3ebsg", "score": "7", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "Cooliceage", "body": "I mean he just recently got a sub-6 ao5 ONE HANDED so I hope he doesn't get too many nerves. Will definitely be exciting no matter what.", "created_utc": "1655501913.0", "edited": "False", "id": "icrhjos", "is_submitter": "False", "link_id": "t3_vec2uj", "parent_id": "t3_vec2uj", "score": "7", "subreddit": "rouxcubing", "subreddit_id": "t5_yb0ad"}, {"author": "Cooliceage", "body": "Fastest non-trigger alg is r U' r2' D' r U' r' D r2 U r' which is a cmll case that I spam when I'm bored and fidget. In practice I have it sub-0.6 (18 tps), and in a solve I've done it sub-0.7 (15 tps).\n\nFor a full solve probably like low 5 lol. All my 8s are like 40 stm or less. I'm barely sub-12 and that only needs like 4 tps global with roux lol.", "created_utc": "1655340156.0", "edited": "False", "id": "icix0jp", "is_submitter": "False", "link_id": "t3_vd1dji", "parent_id": "t3_vd1dji", "score": "2", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "Cooliceage", "body": "Wait which v perm alg I thought most people just used y perm. Is there also some weird alg that doesn’t preserve eo that is better for diag O?", "created_utc": "1655292919.0", "edited": "False", "id": "icfyqw7", "is_submitter": "False", "link_id": "t3_vbevi6", "parent_id": "t1_ic9i7gf", "score": "1", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "Cooliceage", "body": "Tornado v3 should be coming out soon and is probably better, and most people prefer the tengyun v1 over v2 so idk.", "created_utc": "1655292750.0", "edited": "False", "id": "icfyhkk", "is_submitter": "False", "link_id": "t3_vcqt6u", "parent_id": "t3_vcqt6u", "score": "1", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "Cooliceage", "body": "Don’t try to solve roux blocks in a super cfop like manner. Especially first block, so highly recommend this video for understanding the general principles of building a FB\n\nhttps://youtu.be/0Cq3YDud1dA\n\nBeyond that, learn how to LSE properly (doing 4a 4b 4c and not u perms) and you should be fine", "created_utc": "1654601198.0", "edited": "False", "id": "ibh4v7i", "is_submitter": "False", "link_id": "t3_v6rqvj", "parent_id": "t3_v6rqvj", "score": "7", "subreddit": "rouxcubing", "subreddit_id": "t5_yb0ad"}, {"author": "Cooliceage", "body": "Can’t help much since I’m a roux user but I just noticed your Oll algorithm for L case is really weird? Never seen one with B moves before.\n\nI think most common alg for that case is wide inverse sexy sledge. \n\nF R' F' r U R U' r'", "created_utc": "1654513983.0", "edited": "False", "id": "ibcrlqi", "is_submitter": "False", "link_id": "t3_v5sz6i", "parent_id": "t3_v5sz6i", "score": "1", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "Cooliceage", "body": "Algs with D in them generally are bad for OH. RUF is preferred though I don’t the optimal alg for this case.", "created_utc": "1654270385.0", "edited": "False", "id": "ib1pnrl", "is_submitter": "False", "link_id": "t3_v3vdh1", "parent_id": "t1_ib0uwey", "score": "1", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "Cooliceage", "body": "Yeah I completely agree as another roux user around your speed. When I’m genuinely tired my FB to SB transition is so awful and I just can’t seem to look ahead at all. \n\nMy solution has been to just do one handed whenever I’m tired lol. Since it’s mostly about turning ability my look ahead being trash and bad inspection become less of an obstacle. So far it’s taken me to low 20 global OH so I recommend it if you’re interested in the event!", "created_utc": "1652841163.0", "edited": "False", "id": "i90zlmz", "is_submitter": "False", "link_id": "t3_urewek", "parent_id": "t1_i8wwot0", "score": "2", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "Cooliceage", "body": "Congrats on finding it, though you’re not alone. It’s a widely discovered algorithm which is also widely considered bad, so don’t rely on it, but it’s still cool to discover!", "created_utc": "1652840955.0", "edited": "False", "id": "i90z670", "is_submitter": "False", "link_id": "t3_urewek", "parent_id": "t1_i8zmtoi", "score": "1", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "Cooliceage", "body": "Niklas is the name of the algorithm and there’s a couple differences between it and sune, though those differences aren’t really extremely obvious.\n\n1. Sune is faster to execute with good finger tricks, which is why it’s used more often.\n2. Sune moves edges around, but keeps them the same color up (oriented) while niklas is a commutator. A commutator will move 3 corners and effect nothing else, so the edges stay in place.\n3. While they both orient the same corner case (they orient 1 out of the 7 possible), they solve different corner cases (Each solve a different 1 out of 42 corner cases). This matters for 2x2, or for the corners step in the roux method, but in cfop it is significantly less important.\n\nHope this clarifies things!", "created_utc": "1651958478.0", "edited": "False", "id": "i7q1p2h", "is_submitter": "False", "link_id": "t3_ukknb1", "parent_id": "t3_ukknb1", "score": "4", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "Cooliceage", "body": "Sounds like the tips you gave in your 1 year of zz-ct video, which was excellent btw.\n\nDefinitely been trying to do the “turn fluidly and actually do just a little bit of lookahead” and it’s making 12s feel easy and sub-10s feel doable (when I actually am able to plan FB lol. Otherwise I get 17s and feel dumb) So satisfying when you get a truly fluid solve and it’s just faster than your global.\n\nWas just wondering how are you so consistent 10.5 global lol. Seeing your 1k updates in zms and I’m just wondering if you’re trying something new to maybe make that push down? Last slot neutrality perhaps? Are you still noticing yourself improving recently?", "created_utc": "1650651341.0", "edited": "False", "id": "i5s30ys", "is_submitter": "False", "link_id": "t3_u8pluo", "parent_id": "t1_i5p0k80", "score": "2", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "Cooliceage", "body": "Honestly if you want something that’s kinda like what you’re talking about here look at the pinkie pie varient of roux. Only 300 algs so more reasonable. [Video from Kian explaining it](https://youtu.be/TPpZ-wzsZe4)\n\nBasically you orient and place the UL and UR edges at the bottom intuitively, then do an OLLCP algorithm. Now you’re only left with step 4c in roux with I guess you could solve with algs if you felt like it, but the intuitive way and the alg way are the same 95% of the time and intuitive is already super optimized and easy. \n\nAlso I’ll say this, pinkie pie is generally considered extremely situational by top roux solvers and is definitely not optimal for every solve since the algs just aren’t that good all the time.", "created_utc": "1650525287.0", "edited": "False", "id": "i5l7qf3", "is_submitter": "False", "link_id": "t3_u838zs", "parent_id": "t1_i5k6y2i", "score": "2", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "Cooliceage", "body": "Doing the math 180 turns / 45 seconds is 4 tps.\nMy old pb of 9.3 seconds had 3.9 tps.\nI mean I use roux and know all the algs do not the best comparison, but still that’s way too many moves.", "created_utc": "1650311616.0", "edited": "False", "id": "i58zr0q", "is_submitter": "False", "link_id": "t3_u64ouq", "parent_id": "t3_u64ouq", "score": "1", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "Cooliceage", "body": "Started like 10 months ago and I average like 13.5 with roux. I cube way way too much though haha", "created_utc": "1650309994.0", "edited": "False", "id": "i58voki", "is_submitter": "False", "link_id": "t3_u67l57", "parent_id": "t3_u67l57", "score": "2", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "Cooliceage", "body": "The M and U moves can be changed to M’ and U’ btw. M’ is much better so everyone does use that, and depending on which hand you do M moves with you can change from U to U’. Only different is angle you have to told the cube. It’s not that bad after some practice don’t worry", "created_utc": "1650208588.0", "edited": "False", "id": "i5396pl", "is_submitter": "False", "link_id": "t3_u5k0y2", "parent_id": "t3_u5k0y2", "score": "1", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "Cooliceage", "body": "General consensus is Tengyun V1 and the WRM. RS3M can also be good but the quality isn’t guaranteed since it’s a relatively cheap cube. I personally love the Tengyun but it’s basically the only cube I’ve ever had so can’t say much else.", "created_utc": "1649437931.0", "edited": "False", "id": "i3xaltt", "is_submitter": "False", "link_id": "t3_tz1jhn", "parent_id": "t3_tz1jhn", "score": "1", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "Cooliceage", "body": "Alright", "created_utc": "1649368461.0", "edited": "False", "id": "i3thlr7", "is_submitter": "False", "link_id": "t3_tyhkzo", "parent_id": "t3_tyhkzo", "score": "1", "subreddit": "place", "subreddit_id": "t5_2sxhs"}, {"author": "Cooliceage", "body": "I switched to Roux (Another equally viable speedsolving method) when My pb was 1:01. I got my first sub 1 with it, and now average ~15. I think most people switch to a speedsolving method around the 1 minute mark, though that’s only really if you want to practice a lot and improve more. If you are happy around your current speed or slightly faster you don’t need to ever switch.", "created_utc": "1648650067.0", "edited": "False", "id": "i2puue7", "is_submitter": "False", "link_id": "t3_ts3lpj", "parent_id": "t3_ts3lpj", "score": "1", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "Cooliceage", "body": "You use ZZ and have emotes in ZMS so opinion is irrelevant /s\n\nNo but actually I agree. If you don't try to do anything and just repeat over and over then you will only only reach the potential of what you have already learned. I think my idea of \"mindless\" is kinda different I guess. Like I've recently been trying to do a ton of mindless solves where I just always plan my First Block fully. Or doing a ton of solves where you just force yourself to look away from the pieces you're currently solving or always do 1 look or whatever. It helps me improve a lot, but to me it does kinda feel mindless, because it's just forcing yourself to do something you know you should, and then repeating 100s of times until it is easy enough for you to add a new thing to just get good at by repeating properly over and over.\n\nThoughts? Like you said you've been cubing a lot longer than me (10 months) and I'm only in the 14-15 second range so I obviously don't know everything.", "created_utc": "1648584402.0", "edited": "False", "id": "i2lxien", "is_submitter": "False", "link_id": "t3_tqs70w", "parent_id": "t1_i2lqbl6", "score": "3", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "Cooliceage", "body": "Lol “mindless” solving definitely helps. A lot of the time you know something but just haven’t practiced enough. One handed is imo the easiest example, since you just have to do tons of solves until your fingers are just good enough.\n\nAlso how can you perfect something without first practicing it. People don’t just learn everything theoretical and only then pick up the cube and do a solve. There’s a reason lots of fast people don’t know full alg sets. People improve over time and can improve lots just through practice.", "created_utc": "1648564699.0", "edited": "False", "id": "i2ki0p7", "is_submitter": "False", "link_id": "t3_tqs70w", "parent_id": "t1_i2kb6u2", "score": "2", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "Cooliceage", "body": "Even for CFOP solves it’s good to understand EO once you get somewhat advanced. It’s the easiest way to know if you need to rotate for a case (if the edge is a “good” edge you never need to rotate) and also on last layer having edges oriented is having the cross made already.", "created_utc": "1648525776.0", "edited": "False", "id": "i2iv2xo", "is_submitter": "False", "link_id": "t3_tqna44", "parent_id": "t3_tqna44", "score": "1", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "Cooliceage", "body": "I believe it is more common outside the anglosphere. It’s not super mainstream but saying “nobody uses it” is a bit harsh. \n\n[An example](https://youtu.be/Uzto-AbSfnw)", "created_utc": "1648525611.0", "edited": "False", "id": "i2ius9y", "is_submitter": "False", "link_id": "t3_tqnloi", "parent_id": "t1_i2iu09u", "score": "5", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "Cooliceage", "body": "L perm is an alternative name for Ja perm.", "created_utc": "1648525023.0", "edited": "False", "id": "i2itqxl", "is_submitter": "False", "link_id": "t3_tqnloi", "parent_id": "t1_i2iq6in", "score": "8", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "Cooliceage", "body": "It can’t have been more than a couple days where you are stuck, right? You don’t even know if there is a problem yet because it has been so little time. Maybe your times will continue to decrease, maybe you’ll get stuck and then need to focus on specific things to improve. A plateau generally is longer. I plateaued at ~22 for around 2 months while still solving, and then got better and continued to improve.\n\nAlso I’ll say this, that is still good pace of improvement. Let’s say your global speed (or a100) drops 0.1 seconds every 2 days, like you said. With how little time you’ve been at your current speed it can’t be worse pace. That means you drop 1 second in 20 days. If you were able to maintain that you would be sub-10 in 7 months, and only 10 months of cubing total. That is ludicrous improvement. There are very very few people who get sub-10 in less than a year. If you were able to keep improving at that rate I would think that isn’t “normal.”\n\nI don’t mean to say any of these in an insulting way. If you would like advice record some solves and post them, or look to YouTube videos, or analyze your own weaknesses. You didn’t even state which method you use so there isn’t much advice you can get from your post. Just don’t focus too much on improving ridiculously quickly.", "created_utc": "1648350440.0", "edited": "False", "id": "i29sfo3", "is_submitter": "False", "link_id": "t3_tp8hew", "parent_id": "t1_i29qjk9", "score": "2", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "Cooliceage", "body": "Mr. Swagrid how does it feel to use the swaggiest ZZ varient and get a sub-10 ao12 with it?", "created_utc": "1648348943.0", "edited": "False", "id": "i29png1", "is_submitter": "False", "link_id": "t3_tp8hew", "parent_id": "t1_i29pcv5", "score": "3", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "Cooliceage", "body": "Maybe your improvement is going at the same rate. Each second decrease is harder than the previous one. Going from 25 to 20 is easier than 20 to 15. If you were able to maintain your pace of dropping 2 seconds every 3 weeks it would make you sub 8 in just over half a year, which isn’t realistic. \n\nAlso how long have you even been at your “plateau”? You say you hit 23 early March and now you’re sub 20? That’s 3 weeks. Also you say your a100 is still decreasing, so I don’t see how you are stuck?", "created_utc": "1648348813.0", "edited": "False", "id": "i29pelr", "is_submitter": "False", "link_id": "t3_tp8hew", "parent_id": "t3_tp8hew", "score": "5", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "Cooliceage", "body": "TLDR; probably would gain like a second after a lot of grinding, and that grinding can literally just be normal solves where you use 1L\n\nYour cmll is pretty fast 2-look, and you won’t get a big gain out of 1-look to be frank, but you should learn it anyway. It’s a very direct and concrete way to improve, and it just helps with the flow of your solve in general. Also if you plan on ever learning it you should do it sooner rather than later, just because recognition and alg speed comes largely from huge amounts of practice, and it’s good to get as much practice as you can.\n\nAlso I’ve collected splits over times at different speeds so you can see roughly how much CMLL differences can help.\n\n~32 second global - 5.56 seconds for 2L CMLL\n\n~25 second global - 4.64 seconds for 2L CMLL except H and Pi was 1L\n\n~18 second global - 3.22 second 1L CMLL, can only recognize from one angle and sune and anti-sune had trash recognition\n\n~15 second global - 2.89 second CMLL, can only recognize from one angle\n\nSo for you I think you’ll drop about a second from learning 1L and properly implementing it in solves, the thing is that the improvement will come over time from improving recognition and practice. Also this is only really for averages, since singles often times will have the lucky 2L algs as the CMLLs. I tried to do some solves using 2L to try and got an 11s single, and was averaging like 16-17s. So it’s not a game changer, but it will help.\n\nAlso improve your SB. My f2b in total is around 8s and that’s slow for my speed. Your f2b and l10p should be around the same time.\n\nHope this giant text helped! Good luck!", "created_utc": "1648242179.0", "edited": "False", "id": "i2455qd", "is_submitter": "False", "link_id": "t3_tneih9", "parent_id": "t1_i238vdz", "score": "3", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "Cooliceage", "body": "Thanks a lot for the advice! Working on my inspection was kinda my hunch but thank you for confirming it! And I didn't realize that EOLR was that low on the list. I knew it only saved 1-2 moves but I feel like it's all roux users talk about lol. \n\nAlso good luck in Stevenage! Hope the nerves don't get to you so you can get OH NR!", "created_utc": "1648171067.0", "edited": "False", "id": "i20bmaj", "is_submitter": "False", "link_id": "t3_tly5cd", "parent_id": "t1_i1yuq94", "score": "1", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "Cooliceage", "body": "I’ve been averaging just under 15 seconds recently with roux and I was wondering is there some recommendations for the order to learn the following?\n\n1. EOLR - I only know the arrow cases, and don’t always see them\n2. Multi-angle CMLL recognition - Can kinda do H and Pi, and definitely nothing else\n3. Planning FB + DR in 15s inspection - I can only do FB fully planned in like 70% of my solves and occasionally I can do DR, but I always do at least a square\n4. Work on FB efficiency - I think I’m at around 8-10 moves average in real solves\n5. Memorize + implement all SB Last Slot cases - I do last slot fully intuitive with some influencing, but beyond one or two bad cases I haven’t implemented all the wacky solutions.\n6. Practice look ahead - I barely look ahead at all, occasionally I’ll see some corner in SB while solving DR\n7. Become full CN - Currently x2y\n\nAlso here are some step splits I took 2 weeks ago, if that could help\n\nFB - 3.36 - 22.1%\nSB - 4.9 - 32.3%\nCMLL - 2.89 - 19%\nLSE - 4.04 - 26.6%\n\nSorry for the long wall of text, and thank you a lot!", "created_utc": "1648132942.0", "edited": "1648135359.0", "id": "i1xpenm", "is_submitter": "False", "link_id": "t3_tly5cd", "parent_id": "t3_tly5cd", "score": "5", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "Cooliceage", "body": "I’m not discounting things like discord, but it’s not the same as meeting people irl. I mean if you’re not going to an comp you aren’t really going to be meeting many cubers. If you are meeting people (school or clubs I guess) then you probably can go to a comp so why not? \n\nAlso sub 10 takes like at least a year. I’m not saying you have to devote your life to it and have no time to make friends, just that for a long while you will have a serious hobby and not be going to any events. I don’t think that’s unreasonable?", "created_utc": "1647871183.0", "edited": "False", "id": "i1j46wn", "is_submitter": "False", "link_id": "t3_tiywyg", "parent_id": "t1_i1j2m3z", "score": "2", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "Cooliceage", "body": "Yeah that’s fair. I feel most of these records are because of Covid. Did you have the chance to go to other comps though without 5x5?", "created_utc": "1647870837.0", "edited": "False", "id": "i1j3g1c", "is_submitter": "False", "link_id": "t3_tiywyg", "parent_id": "t1_i1ishnx", "score": "1", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "Cooliceage", "body": "The answer has been linked for you already but one thing I’ll say is dont try and go for these records, especially for 3x3. You need to be sub 10/9 by your first comp, which is like 1-2 years of serious cubing without ever being social or trying to make friends through the hobby. It’s not really worth it, except maybe side events, but that’s if you’re already good ad want to learn something new.", "created_utc": "1647837493.0", "edited": "False", "id": "i1hsuih", "is_submitter": "False", "link_id": "t3_tiywyg", "parent_id": "t3_tiywyg", "score": "7", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "Cooliceage", "body": "Bought mine from eBay for $50. Easiest solution honestly.", "created_utc": "1647635160.0", "edited": "False", "id": "i175n9e", "is_submitter": "False", "link_id": "t3_tgpom9", "parent_id": "t3_tgpom9", "score": "1", "subreddit": "Tetris", "subreddit_id": "t5_2r133"}, {"author": "Cooliceage", "body": "He has 8.68 a1000 also, so it’s ridiculous how good he is. No comps in Indonesia though because the delegate is very COVID wary", "created_utc": "1647457382.0", "edited": "False", "id": "i0x4mo5", "is_submitter": "False", "link_id": "t3_tfm46j", "parent_id": "t3_tfm46j", "score": "92", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "Cooliceage", "body": "Yeah I’m in the classic Tetris community and it’s kinda insane the proportion of high level Tetris players who cube (and vice versa). I can just say a couple of the top of my head, though I’ll leave out names for some anonymity.\n\nLazer0Monkey played in the Tetris world championships. Very nice guy to talk to.\nFastest ZZ solver in the world is a great Tetris player\nSingaporean NR holder\n\nThere’s also mountains of people who are “only” sub 20 or stuff like that. I got 11th in the world championship this year, and I played a game against the current score record holder where he beat me both in a Tetris match and cubing match (I average like 16 and him like 13). That was very fun lol", "created_utc": "1647387541.0", "edited": "False", "id": "i0tfzed", "is_submitter": "False", "link_id": "t3_teklqz", "parent_id": "t1_i0qk840", "score": "2", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "Cooliceage", "body": "Yeah I think a majority are, which is kinda different than a lot of CFOP users only being only white. Also the centers aren’t fixed because of M slice freedom so I don’t even understand what the fixed orientation means", "created_utc": "1647007811.0", "edited": "False", "id": "i08pgma", "is_submitter": "False", "link_id": "t3_tbidvw", "parent_id": "t1_i08mdjr", "score": "3", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "Cooliceage", "body": "If you want to do some human-based analysis that isn’t 100% pure math you could do something like [kian’s roux vs cfop seminar](https://youtu.be/81XdAt5m1uc). It goes into optical computer optimized movecount for different steps, compares limits of methods and you could maybe find something interesting there using computer solving programs like HARCS. \n\nThere’s also some really interesting cube theory in things like FMC or blind comms.\n\n\nDon’t know if these are helpful because I don’t know your exact requirements, and these aren’t as completely objective, but it might spark your interest! Good luck!", "created_utc": "1647006839.0", "edited": "False", "id": "i08nezu", "is_submitter": "False", "link_id": "t3_tbjufh", "parent_id": "t3_tbjufh", "score": "1", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "Cooliceage", "body": "I think it’s good to put some numbers that might help you put the goal into perspective. \n\nFundamentally a solve time is determined by a simple formula. Time = Moves/TPS \n\nEither increase the TPS (pauses are included here) or decrease the movecount.\n\nA full CFOP solve, for someone around the 20 sec mark with full pll and 2 look oll is around 60-70 moves (assuming some inefficiency). That means to get a 20 second solve time on average you would need something like 3 tps for the whole solve. Physically that isn’t too fast, and it’s actually even better because you can easily make your last layer faster than that.\n\nCross - 8 moves - If you plan this fully you can definitely make it more than 3 tps\n\nF2L - 8 moves per pair = 24 moves - I’ll be honest and say I don’t know the exact move counts, but really focus here on making your solutions efficient and focus on doing them with good finger tricks. You don’t need to turn fast or do lookahead, just after finishing your current pair make sure to check all the possible spots for the next one and not panic. You could average like 2 tps on this step and be fine, and you should just try to turn at 2 tps to see how that is not the limiting factor.\n\nLast layer - 13 + 14 - You can actually grind these pretty easily so that the rest of the solve does not need to be as fast. Algorithm improvement is incredibly direct, and there aren’t many nuances to it.\n\nGood luck!", "created_utc": "1646975005.0", "edited": "False", "id": "i07dt9m", "is_submitter": "False", "link_id": "t3_tb39o6", "parent_id": "t3_tb39o6", "score": "3", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "Cooliceage", "body": "I’m curious what you think of games like Tetris or minesweeper? They are very simple, and the priority is not in the graphics but in the improvement of a specific skill. There are also studies showing that playing Tetris after traumatic events can help deal with the trauma. \n\nIf you just genuinely don’t appreciate any activity that is done purely for enjoyment and not for some greater cause I guess video games (besides those that are teaching tools I guess) are widely useless, alongside nearly the entirety of entertainment. I do want to ask though, isn’t the point of confronting reality ultimately to allow you to do these simple activities that are enjoyable? I would think that since life requires a lot of struggle - according to what you said - that the goal should be to reduce that struggle but doing fun activities? Or do you just think we should be in pain for the sake of it, since it’s natural?", "created_utc": "1645634262.0", "edited": "False", "id": "hy48rxm", "is_submitter": "False", "link_id": "t3_szjk0j", "parent_id": "t3_szjk0j", "score": "2", "subreddit": "The10thDentist", "subreddit_id": "t5_233710"}, {"author": "Cooliceage", "body": "I’ll be honest and say I’m not an incredible solver (only have a couple sub 10s) so I’m not a perfect source, but it’s something I’m interested in.\n\nYeah full CN roux would be helpful, it’s just the gains are extremely hard to know for sure beyond some math (Full CN vs x2y is like 0.8 moves saved). There already aren’t too many super good roux solvers in general, and really only Fahmi has seen both sides, and his efficiency is ridiculous already (his fb is sub 8 moves on average already). There are some arguments for ergonomics also.\n\n\nI think it’s more difficult to be full CN with roux than CFOP, though how much more difficult is subjective. There’s fundamentally a lot more blocks to consider than cross options, and over x2y you don’t actually get any more free pairs, just ways to use them. Harder to use all that in 15 seconds, though the best in the world can handle it. \n\nAlso yeah corners recognition is just hard, especially for multi angle. I still can’t do it, and I average 16. If you have any tips I’d love to hear.", "created_utc": "1645323562.0", "edited": "False", "id": "hxnl1vb", "is_submitter": "False", "link_id": "t3_sw6g3u", "parent_id": "t1_hxncwvd", "score": "1", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "Cooliceage", "body": "He isn’t full color neutral. Full CN for roux is being able to 24 blocks and Fahmi can do 16. There are a couple of roux solvers trying to become full CN (A couple people who primarily use CFOP are full CN in roux) Roux solvers in general are nearly always x2y color neutral (8/24) at least already. Normalizing full CN probably won’t change much about roux’s ability compared to CFOP, though would obviously help. Currently CMLL recognition and prediction is probably the biggest thing holding back the method at the highest level for 2 handed solving. Still it is an interesting discussion it be had, and there’s some hype about becoming CN within roux community.", "created_utc": "1645316538.0", "edited": "False", "id": "hxn6ox7", "is_submitter": "False", "link_id": "t3_sw6g3u", "parent_id": "t1_hxmounv", "score": "3", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "Cooliceage", "body": "Alright well here’s some other stuff you can try and see if you understand better. All from the discord so highly recommend joining there, since I don’t really understand the stuff myself.\n\nThere’s [this](https://docs.google.com/spreadsheets/d/1z3GGqY9_J4124mWYgYjH_QuwaqMiGVB1WHxL8IemVeU/htmlview#) or there’s [this](https://docs.google.com/spreadsheets/d/1CcoWho6uoI8ggv3nnozsmLINynVYtMeqVtjg2q-Z7T4/htmlview#gid=1544117673).", "created_utc": "1645232682.0", "edited": "False", "id": "hxispma", "is_submitter": "False", "link_id": "t3_svp20h", "parent_id": "t1_hxiriny", "score": "3", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "Cooliceage", "body": "It’s linked in the speedsolving wiki page you linked, but [there’s this.](https://docs.google.com/spreadsheets/d/1BUt299RvoSDdtUEEMnGALo7jVqHnuhZS64-KZZ6TEKI/edit?usp=sharing). I don’t know if you’re in the roux method speedsolvers discord, but you could probably ask some questions or, just backroad some of of the discussion there. Just search for the link in Reddit and you’ll find it.\n\nBasically no one uses it in actually speedsolves right now as far as I know, but you’ll see it in some roux fewest moves attempts in the weekly comp. For recognition, I think the only current thing I’ve seen is the development of the Hyper Orientation recognition method for cmll, which has a doc which also in that discord, which I can’t find really quick. A couple people are trying to switch to it because it’s supposed to be better for cmll prediction and also allows you to use nmcll.\n\nHope this helps!", "created_utc": "1645231983.0", "edited": "1645232175.0", "id": "hxir8yn", "is_submitter": "False", "link_id": "t3_svp20h", "parent_id": "t3_svp20h", "score": "2", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "Cooliceage", "body": "If you want to start practicing OH just in your free time spam R U R’ U’ for a couple days when you feel like it. Remember that most people use their left hand to do OH, since R moves are easier, but you could technically mirror everything.\n\nBlind is a really different. If you really want to try no one is stopped you. There isn’t really a “too early” but understanding how the method works might be difficult for a beginner, but with practice you can get it!", "created_utc": "1644932190.0", "edited": "False", "id": "hx17hpq", "is_submitter": "False", "link_id": "t3_ssux6e", "parent_id": "t1_hx0wb83", "score": "6", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "Cooliceage", "body": "This is just upside down CFCE, though with beginners method f2l. You can use some cll subset for the corners, and then ell for edges, though idk if a lot of the algs can be executed upside down.\n\nAlso are you sure that your brother solved it this way? There are lots of examples of how people solved the cube back in the 80s and they don’t involve making the cube simply harder to solve. How did he do D moves with wrist turns? He learned all of these algs without being able to properly see the pieces? It would be very bizarre if he did all that, but never thought to turn the cube upside down.\n\nAlso if your goal is simply to revive it you’ve already done it. Just record a solve and post it on YouTube. I was able to do a solve like after a ton of effort trying to do algs like y perm upside down. Good luck!", "created_utc": "1644768174.0", "edited": "False", "id": "hwsghjg", "is_submitter": "False", "link_id": "t3_sralsb", "parent_id": "t1_hwrxeed", "score": "3", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "Cooliceage", "body": "Sub 30 ao5 was like a couple weeks after learning a proper method and solving a to. Global average was like 1.5-2 months or so.", "created_utc": "1644633607.0", "edited": "False", "id": "hwldlvj", "is_submitter": "False", "link_id": "t3_sqexm2", "parent_id": "t3_sqexm2", "score": "1", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "Cooliceage", "body": "ZZ, especially with ZBLL, is probably equally good as CFOP, but imo it’s just harder to get good at. More algs at the highest level, and inspection is super hard. If you enjoy it more go for it, but I feel like it’s super hard to get good at ZZ, though the method is fine", "created_utc": "1644467419.0", "edited": "False", "id": "hwbr4ix", "is_submitter": "False", "link_id": "t3_so552a", "parent_id": "t1_hw9r8c1", "score": "1", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "Cooliceage", "body": "Literally just practicing a ton of solves and being 2% mindful of what you’re doing will significantly decrease your times", "created_utc": "1644382709.0", "edited": "False", "id": "hw6q0ge", "is_submitter": "False", "link_id": "t3_snzxux", "parent_id": "t3_snzxux", "score": "2", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "Cooliceage", "body": "Pull PLL is only really worth the time investment when you average around 30 seconds. Just practice your f2l and really that’s where improvement will come from. Record a couple of your average solves and see where you can improve and then focus on that. I know it can be tempting to just focus on the super defined improvement paths (learning algs) but really improvement comes from the more intuitive steps. Good luck!", "created_utc": "1644107353.0", "edited": "False", "id": "hvrerlo", "is_submitter": "False", "link_id": "t3_slknob", "parent_id": "t1_hvrcmp5", "score": "2", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "Cooliceage", "body": "Learn whenever you’d like! Either try out learning beginner cfop now (I recommend starting by learning the fundamentals of f2l, then learning last layer algs) or try to mess around with roux and see if you like it! Good luck!", "created_utc": "1643853628.0", "edited": "False", "id": "hvd2enm", "is_submitter": "False", "link_id": "t3_sj3zgz", "parent_id": "t3_sj3zgz", "score": "1", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "Cooliceage", "body": "I don’t know of any video that compiles all of them together. Kian has a video with all of his cmll executions and there is some overlap there.  I think the only other caveat is that for the two worst cmll cases (Sune and AntiSune columns) the document is actually outdated. You can find the better version of those two algs on Sevilz’s YouTube channel with execution[here](https://youtu.be/Ry1sQdzB1Hw). For me I just kinda messed around with every alg and tried to find the best finger tricks for me, though I only average like 16 so I’m not the best source of info.", "created_utc": "1643384641.0", "edited": "False", "id": "hulersf", "is_submitter": "False", "link_id": "t3_seb7ju", "parent_id": "t1_hukhprs", "score": "1", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "Cooliceage", "body": "Yeah don't learn from Roux's site. Even though he was amazing those algs are very old and extremely hard to understand.\n\nA lot of people are sending you links to Kian's document. That is still really good, but the roux community has made another document that has some improvements [here](https://docs.google.com/spreadsheets/d/1uc5V3G-kRH3qV5b6Lq1yzTjnqSMS3D3dZcsCIOiJqcI/edit#gid=1409661599).  You can compare the algs you like and learn those.", "created_utc": "1643341631.0", "edited": "False", "id": "hujc7o1", "is_submitter": "False", "link_id": "t3_seb7ju", "parent_id": "t3_seb7ju", "score": "3", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "Cooliceage", "body": "Algs are rarely used to solve final layer in FMC in general, unless there’s a huge cancellation or a skip. Also domino reduction is the big meta these days and knowing tons of algs don’t really help there.", "created_utc": "1642027866.0", "edited": "False", "id": "hseuq2k", "is_submitter": "False", "link_id": "t3_s23ke7", "parent_id": "t1_hseip9y", "score": "2", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "Cooliceage", "body": "Get your algs from multiple sources. Kian has a good but somewhat outdated sheet. Anto’s is good, but there are a few more esoteric algs not on there, but I would generally recommend not simply finding the top result and learning it just because. \n\nLearn H and Pi first, since those are extremely easy to recognize. All of the recognition comes from bars/lines that are easy to see. There are only 4 H cases also.\n\nLearn Sune and Antisune last, as the 2 look alga are super fast, and cmll recognition is harder. Also the columns case for both suck on 99% of sheets, so go to YouTube and find sevilz’s video on those two cases.\n\nEverything else is up to you. Cmll is a really good alg set in general so pretty much everything else should be fine. \nAlso remember to memorize with triggers like sledgehammer rather than just the moves. Makes everything a lot easier. \n\nI’ll say that 1 look isn’t going to help a ton. Maybe a second or two decrease, but still it’s useful so good luck!", "created_utc": "1642027583.0", "edited": "False", "id": "hseu04k", "is_submitter": "False", "link_id": "t3_s23ke7", "parent_id": "t1_hsc6yg5", "score": "2", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "Cooliceage", "body": "I mean around now is when I would recommend switching to a proper speedsolving method. I would recommend trying out both roux and cfop for a couple of days just to see what you would prefer in the long term, but after that just commit and have fun!", "created_utc": "1641971245.0", "edited": "False", "id": "hsbk44z", "is_submitter": "False", "link_id": "t3_s1vaay", "parent_id": "t3_s1vaay", "score": "1", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "Cooliceage", "body": "It’s going to depend entirely on how lucky can you get. I mean with an infinite number of comps you could get a 5 move scramble but that’s not realistic.  Sub 2 f2l has happened a couple times, so with last layer skip it’s technically possible. That’s probably a 1/100,000 chance though, so if we are talking of forever maybe a low 2 with CFOP.\n\nCurrently the fastest solve ever is 2.62 by fahmi with roux. It was 26 stm but there wasn’t actually a last layer skip level of luck in it. The luckiest you can get with roux is a L10P skip which is like 1/30,000 or something ridiculous. Fahmi’s f2b were 9 moves so I guess a 1/1,000,000 solve could have both and get a 1.5 or something ridiculous. Low 2 is possible though, just skips are rarer in roux and tend to be less impactful. Most of the best solves are just really good cases for every step.\nFinal guess maybe 2.1 \n\nAverage can definitely go sub 4, given enough time. Kyle santucci has a 4.31 ao5 with CFOP, and there are a couple people with sub 5 ao5s. Kian has a video of roux vs cfop comparison and he believes human limit for average for both methods is low 4. Get 5 solves with a movecount in the 30s, then turn at 10 tps and that’s that. There have been roux a50s with 43 stm in slow efficiency sessions so that’s doable just requires ridiculous brainpower, and with tons of zbll and luck and slightly faster turning cfop could do the same times.\n\n3.75 probably? I think average will take longer to reach the limit.", "created_utc": "1641749860.0", "edited": "False", "id": "hrxt221", "is_submitter": "False", "link_id": "t3_rzuvut", "parent_id": "t3_rzuvut", "score": "15", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "Cooliceage", "body": "ZZ is similar to CFOP in general structure. You solve the first 2 layers then do the last layer with algorithms. There are really 2 differences\n\n1. ZZ’s first step is edge orientation, which is this advanced concept which is hard to explain. It doesn’t solve any pieces by itself. Basically you take all the edges on the cube and make them into “good” edges using F and B moves. After this you never have to rotate, all of your f2l cases in general are better and your last layer will have a premade cross on top. \n\n2. There are a ton of variants of ZZ. The first is whether after doing the edge orientation you make a cross on the bottom or a line. Cross is considered better nowadays, but it’s really hard to plan. Then there are tons of ways to do the last layer depending on how many algorithms you want to learn (ZZ-a probably the best version which has 450 algorithms for the last layer and solves it entirely in one step) you can also just do Oll and pll.\n\nA lot of people say ZZ is worse than CFOP by a small margin. I don’t necessarily agree, there are very fast solvers with ZZ, it’s just that ZZ is very hard to get good at. Inspection is quite difficult and if you really have to learn a lot of algorithms to actually reap a lot of the benefits of the method. I would just practice CFOP and then maybe experiment with the method and see if you want to switch, since a lot of the skills transfer over. J perm has a good guide to the method for an introduction.", "created_utc": "1641748210.0", "edited": "False", "id": "hrxomnf", "is_submitter": "False", "link_id": "t3_rza1bl", "parent_id": "t1_hrxdf0z", "score": "1", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "Cooliceage", "body": "There are two main speedsolving methods, CFOP and Roux. They are practically equal in terms of speed, even though CFOP is more popular, so it’s all personal preference so I recommend trying out both just for a day or two and seeing which you like more. I’ve put beginner tutorials for both below and am overall description of both.\n\nCFOP is quite linear. You solve a cross on the bottom, the insert corner edge pairs into the 4 slots on the cube. Then you solve the final layer using algorithms (for beginner there’s 4, intermediate there’s 13, advanced around 70, world class hundreds). It’s pretty straightforward overall. It’s also used primarily R, U, F moves and rotations as well as having a move count around 55-62 if done efficiently.\n\nhttps://youtu.be/Ar_Zit1VLG0 - f2l guide\n\nhttps://youtu.be/jKS9otGuu50 - another f2l guide if you would like more.\n\nhttps://youtu.be/wf5pXw6wpDI - Oll algorithms (this one has better algorithms than the j perm video)\n\nhttps://youtu.be/f_Yor-ydZjs - pll algorithms (for the U cases there are also middle move variants which are as popular so if you would like those you can Google them.\n\n\nRoux is very free in general. You solve a 3x2x1 block on the left side however you’d like, then repeat on the right side, which is very efficient but also requires quite some creativity. Then there’s there are algorithms to solve the corners (2 for beginners, 9 for intermediate, 42 for advanced) Finally you solve the rest of the cube using only M and U moves. Roux has tons of creativity, so it can be difficult to master (though I don’t think it’s harder to improve at) movecount is around 48-52 if done well, uses mostly R, U and M moves except for first block which uses everything. There are also no rotations.\nKian Mansour has likely the best guide for a beginner here. It’s split into 4 videos and goes over everything very slowly-\nhttps://youtube.com/playlist?list=PLBHocHmPzgIjnAbNLHDycgaCP5IqiwnU9 \n\nWhen I very first started cubing I chose roux just because I thought the M moves looked really cool and I’m happy with my decision but it’s about fun in the end so find what’s fun for you! Hope this was helpful!", "created_utc": "1641702336.0", "edited": "False", "id": "hrvfvqd", "is_submitter": "False", "link_id": "t3_rza1bl", "parent_id": "t3_rza1bl", "score": "1", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "Cooliceage", "body": "Aren’t a lot of these materials from countries like  Australia? I know Chile is known for lithium mining which is in batteries.", "created_utc": "1641407312.0", "edited": "False", "id": "hrdx0lv", "is_submitter": "False", "link_id": "t3_rwpqjk", "parent_id": "t1_hrdo0kr", "score": "3", "subreddit": "worldnews", "subreddit_id": "t5_2qh13"}, {"author": "Cooliceage", "body": "I've taught a couple of friends. Most forgot, which is fine, but one of them got really into it! I taught him roux as a beginner method (I genuinely don't remember why since I taught beginner method to everyone else) so it's really cool having a friend who also uses the same method. During free classes we'll race two handed versus one handed, but he's been averaging mid 30s and now I need to actually get good to beat him lol.", "created_utc": "1641328756.0", "edited": "False", "id": "hr9cz8o", "is_submitter": "False", "link_id": "t3_rv31wm", "parent_id": "t3_rv31wm", "score": "3", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "Cooliceage", "body": "I’ll say you can probably get a long way for your goal simply by doing a lot of solves (assuming you don’t have any terrible habits). You don’t really need full I’ll for that, but for sub 30 full ppl would help. Good luck!", "created_utc": "1641173433.0", "edited": "False", "id": "hr0if2o", "is_submitter": "False", "link_id": "t3_ru22yk", "parent_id": "t1_hr0fn3l", "score": "1", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "Cooliceage", "body": "Crazy how close some of those time are between OH and 2H. I’m not even that slow at 2H and my OH times are so much slower. How do you possibly close that difference?", "created_utc": "1641164320.0", "edited": "False", "id": "hqzvzoa", "is_submitter": "False", "link_id": "t3_ruhcmq", "parent_id": "t3_ruhcmq", "score": "1", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "Cooliceage", "body": "A lot of people have been giving good advice here on how to start improving with cfop, but I’ll just give you two pieces of general advice.\n\n1. You have to get worse to get better. When learning a new algorithm, or anything it will take some time to become habit, and usually that will result in solves being harder/slower for a little bit. Don’t worry! Gains aren’t instant, but I’m sure you’ll improve.\n\n2. Don’t be afraid to try new methods. I’m not telling you to switch, but it’s good to try out all the options and see what is best for you. Just try out roux (kian mansour has a good guide on YouTube) to see if you like and want to switch. At least you’ll get a better understanding of the cube, at most you’ll find something you like more!\n\n3. Try being color neutral! When starting out it isn’t too hard, so I would recommend to develop good habits. It isn’t game changing really, but it’s nice.\n\nThese pieces of advice might be a little biased (I’m a color neutral roux solver) but I think it will still help. Good luck and have fun!", "created_utc": "1641163740.0", "edited": "False", "id": "hqzuipy", "is_submitter": "False", "link_id": "t3_rui1xs", "parent_id": "t3_rui1xs", "score": "1", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "Cooliceage", "body": "Learn the old pochmann method for corners, but just learn M2 for edges and don’t do old pochmann for edges. M2 has only a couple special cases which are really easy and it is much faster to execute. Jperm has guides, but you can find it all through YouTube searches and sources like the r/cubers wiki. The M2 survival guide doc from the wiki is super helpful.", "created_utc": "1638399349.0", "edited": "False", "id": "hmuwx7l", "is_submitter": "False", "link_id": "t3_r6r5bd", "parent_id": "t3_r6r5bd", "score": "2", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "Cooliceage", "body": "Thank you so much! I’m sure it’s hard to translate idioms and that type of subtext so I’m really appreciative of everything you did. Have a wonderful day!", "created_utc": "1637726644.0", "edited": "False", "id": "hluyjnz", "is_submitter": "True", "link_id": "t3_r084ep", "parent_id": "t1_hlufwyk", "score": "1", "subreddit": "translator", "subreddit_id": "t5_2ss9z"}, {"author": "Cooliceage", "body": "I’ve been trying to get decent at 2x2 recently and was wondering about cll algs.\n\nI already solve 3x3 using roux and nearly know full cmll (kian’s algs). I was wondering how inefficient would it be if I solved 2x2 using the cll method but with cmll algs? I feel like some cases (especially the ones with r) kinda suck for 2x2, but is there still a lot of overlap or would I have to relearn a lot of algs (or do Ortega if I’m lazy)?", "created_utc": "1637512606.0", "edited": "False", "id": "hlixx4h", "is_submitter": "False", "link_id": "t3_qynjxj", "parent_id": "t3_qynjxj", "score": "1", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "Cooliceage", "body": "4 look last layer. So 2 look oll and 2 look pll", "created_utc": "1635821277.0", "edited": "False", "id": "hiytboz", "is_submitter": "False", "link_id": "t3_qk6uoq", "parent_id": "t1_hiyos05", "score": "1", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "Cooliceage", "body": "Classic Tetris community has a ton of really accomplished people it’s crazy. There’s some insane cubers, quite a few speed runners in other games, some insanely smart jobs (engineers, programmers etc), and quite a few a people going to ivies for college. Getting into the community basically has given me an alumni network lol", "created_utc": "1634615883.0", "edited": "False", "id": "hh70jwf", "is_submitter": "False", "link_id": "t3_qannlv", "parent_id": "t1_hh4oyqq", "score": "8", "subreddit": "Tetris", "subreddit_id": "t5_2r133"}, {"author": "Cooliceage", "body": "I’ll say this, as someone who’s actually on of the top seeds for the classic championship, the games are so different it’s hard to compare. I am good at classic, but I’m not great with the controls in modern. I know modern players who can’t get 500k on classic. Really different stacking as well, and classic is a lot more punishing, so while it might look slower it’s actually very very difficult", "created_utc": "1634070139.0", "edited": "False", "id": "hgebpa9", "is_submitter": "False", "link_id": "t3_q60in3", "parent_id": "t1_hg9u7kk", "score": "2", "subreddit": "LivestreamFail", "subreddit_id": "t5_38jf0"}, {"author": "Cooliceage", "body": "There was an interview after and he was very happy with how he did. Top 16 is insanely good, and he got wr so nothing to be sad about.", "created_utc": "1634069976.0", "edited": "False", "id": "hgebba3", "is_submitter": "False", "link_id": "t3_q60in3", "parent_id": "t1_hgbbszh", "score": "1", "subreddit": "LivestreamFail", "subreddit_id": "t5_38jf0"}, {"author": "Cooliceage", "body": "He’s tapping. He’s already very fast as and since he hasn’t played much over the last couple months he hasn’t practiced enough to switch over.", "created_utc": "1634069798.0", "edited": "False", "id": "hgeavh7", "is_submitter": "False", "link_id": "t3_q60in3", "parent_id": "t1_hge3wct", "score": "1", "subreddit": "LivestreamFail", "subreddit_id": "t5_38jf0"}, {"author": "Cooliceage", "body": "It’s definitely an amazing experience. A couple months ago I got the losing score record that pokenerd beat (also against dog, he’s a monster) and it’s one of the most surreal and enjoyable feelings I’ve experienced. When you have pushed the game to an insanely high level and you still lose you can’t help but laugh. It’s lots of fun", "created_utc": "1634069733.0", "edited": "False", "id": "hgeapqc", "is_submitter": "False", "link_id": "t3_q60in3", "parent_id": "t1_hg9zimk", "score": "3", "subreddit": "LivestreamFail", "subreddit_id": "t5_38jf0"}, {"author": "Cooliceage", "body": "Sorry for that! I read the FAQ and the daily discussion thread and I thought this was a little more complicated than those questions so I thought it needed it’s own thread. Sorry for the mistake.", "created_utc": "1632664534.0", "edited": "False", "id": "hechnyz", "is_submitter": "True", "link_id": "t3_pva9w8", "parent_id": "t1_heb86xo", "score": "1", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "Cooliceage", "body": "Alright thanks I’ll definitely keep that in mind!", "created_utc": "1632599882.0", "edited": "False", "id": "he9cgm0", "is_submitter": "True", "link_id": "t3_pva9w8", "parent_id": "t1_he8vskn", "score": "3", "subreddit": "Cubers", "subreddit_id": "t5_2r6a3"}, {"author": "Cooliceage", "body": "Well Alexander Alekhine was the world champion when ww2 happened and he was actually the only WC to die while holding the title, in 46. So this would actually be really interesting to find out. \n\n\nHe did collaborate with the Nazis irl, mostly to protect his family and because he couldn’t leave to the Americas, so he was actually backed by Germany in events and represented them, even though he was Russian. He died in Portugal, but no one is 100% confident how he died. It could have been a heart attack or choking on meat, but there are theories he was assassinated by the Soviets for being a collaborator as well so there’s actually a couple of options I think.\n\nIf you think he was actually assassinated then in TNO he would probably live and continue to play. He was already declining in strength at that point, so likely he would have been challenged by some of the strong German players and Soviet players in Nazi occupied zones (they were allowed to play actually) and lost the championship. There were a lot of famous players affected by ww2 in weird ways (google najdorf for an interesting one) so I dunno who.\n\nIf you think he died naturally then there would probably be a tournament organized to decide the WC like otl, and a European player would likely win, but there would probably be a ton of politics since a lot of high level players tried to flee Germany or were russian.\n\nI’m not confident that chess wouldn’t be Russian anymore. Most famous Russian chess players were from the West of Russia or one of the SSRs (Tal was Latvian, Petrosian Armenian). The one largest difference is that Botvinnik would not have the influence he did. He founded the Russian chess school and coached the team that helped make Russia the greatest in the world, and without him I’m not sure. He also was a big computer scientist so it would be unfortunate if he wasn’t alive.\n\nAlso Japan has a different variant of chess called Shogi. There aren’t that many high level players from Japan for that reason, so I don’t think they would influence much.", "created_utc": "1631208183.0", "edited": "False", "id": "hc7cz35", "is_submitter": "False", "link_id": "t3_pko65e", "parent_id": "t3_pko65e", "score": "13", "subreddit": "TNOmod", "subreddit_id": "t5_3psuk"}, {"author": "Cooliceage", "body": "Congratulations! You should post this in the ctm discord server! There's a full list of all known maxouters and you can be added to the list! You could also play in the tournament if you would like.  \n[ctm.gg/discord](https://ctm.gg/discord) is the invite link! Hope to see you there!", "created_utc": "1620161491.0", "edited": "False", "id": "gwy3lci", "is_submitter": "False", "link_id": "t3_n3wpmx", "parent_id": "t3_n3wpmx", "score": "2", "subreddit": "Tetris", "subreddit_id": "t5_2r133"}, {"author": "Cooliceage", "body": "Very good for just starting! Hope you're enjoying the game. If you want to improve I recommend focusing on your stacking and keeping the build nice and flat. Good luck!", "created_utc": "1619806207.0", "edited": "False", "id": "gwgbfnr", "is_submitter": "False", "link_id": "t3_n1up2q", "parent_id": "t3_n1up2q", "score": "2", "subreddit": "Tetris", "subreddit_id": "t5_2r133"}, {"author": "Cooliceage", "body": "Voice call with friends, who are also really good tetris players, during the game.", "created_utc": "1619669637.0", "edited": "False", "id": "gw9cul3", "is_submitter": "False", "link_id": "t3_n0jins", "parent_id": "t1_gw8x871", "score": "1", "subreddit": "Tetris", "subreddit_id": "t5_2r133"}, {"author": "Cooliceage", "body": "Because there's a killscreen in nes tetris you are trying to be as efficient as possible before reaching that killscreen. Burning lines means clearing lines that are not tetrises, because you are \"burning away\" scoring potential. Because they score fewer points than tetrises they are inefficient. Often you have to \"burn\" anyway, either because of survival or stack health.", "created_utc": "1616859846.0", "edited": "False", "id": "gsglog9", "is_submitter": "False", "link_id": "t3_md5rhc", "parent_id": "t3_md5rhc", "score": "5", "subreddit": "Tetris", "subreddit_id": "t5_2r133"}, {"author": "Cooliceage", "body": "gg klezh, quality naming also lol", "created_utc": "1616859671.0", "edited": "False", "id": "gsgkwqb", "is_submitter": "False", "link_id": "t3_mdxuy0", "parent_id": "t3_mdxuy0", "score": "3", "subreddit": "Tetris", "subreddit_id": "t5_2r133"}, {"author": "Cooliceage", "body": "Incredibly awesome article to read, they really found a ton of details about the community. They even knew about the minecraft after party and all the small details, Very cool", "created_utc": "1616859646.0", "edited": "False", "id": "gsgksrm", "is_submitter": "False", "link_id": "t3_me95sc", "parent_id": "t3_me95sc", "score": "6", "subreddit": "Tetris", "subreddit_id": "t5_2r133"}, {"author": "Cooliceage", "body": "Yes that’s true. He pretty much said that anything properly recorded is real and his competitive play is real.", "created_utc": "1615325179.0", "edited": "False", "id": "gqdj1mp", "is_submitter": "False", "link_id": "t3_m18uwt", "parent_id": "t1_gqdema6", "score": "4", "subreddit": "Tetris", "subreddit_id": "t5_2r133"}, {"author": "Cooliceage", "body": "It's just that getting a million points is very difficult. Speaking from experience, it takes a huge amount of practice and it's a crazy achievement that only [200 confirmed people](https://docs.google.com/spreadsheets/d/1uzb-kYd3XRHWxrB31EvnQZWhXn70rjhQVWf3gml63-Y/edit#gid=906058999) have out of 8 million cartridges sold. It would be super cool to know that more people from back in the 80s and 90s got this so that's just the curiosity. Nes tetris is a small community so every new maxout player is celebrated a lot and it's very cool to see. I hope that wasn't confrontational, and cheers to you as well!", "created_utc": "1614779874.0", "edited": "False", "id": "gpj7vas", "is_submitter": "False", "link_id": "t3_lw9nag", "parent_id": "t1_gph4uzg", "score": "1", "subreddit": "nextfuckinglevel", "subreddit_id": "t5_m0bnr"}, {"author": "Cooliceage", "body": "It's really cool! There are so many great matches on the classic tetris youtube channel or you can watch live on twitch(monthlytetris) if you would like more. \nhttps://youtube.com/c/ClassicTetris", "created_utc": "1614751666.0", "edited": "False", "id": "gpi9cj6", "is_submitter": "False", "link_id": "t3_lw9nag", "parent_id": "t1_gph9dow", "score": "2", "subreddit": "nextfuckinglevel", "subreddit_id": "t5_m0bnr"}, {"author": "Cooliceage", "body": "Yeah tetris can be amazingly tense, especially when the scores are this close!\nIf you would like you can watch more matches online. I've linked one of my favorite matches here, and if you want more you can go to the youtube channel or watch the matches live on the monthlytetris twitch! Hope you enjoy!\nhttps://youtu.be/YNZsCJkrt8U", "created_utc": "1614751520.0", "edited": "False", "id": "gpi959w", "is_submitter": "False", "link_id": "t3_lw9nag", "parent_id": "t1_gph5k59", "score": "1", "subreddit": "nextfuckinglevel", "subreddit_id": "t5_m0bnr"}, {"author": "Cooliceage", "body": "You can always still try, though it looks deceptively easy. The scene has exploded since this match, and I would say for most people it takes over a year to get to this skill level.", "created_utc": "1614751311.0", "edited": "False", "id": "gpi8v53", "is_submitter": "False", "link_id": "t3_lw9nag", "parent_id": "t1_gph76no", "score": "2", "subreddit": "nextfuckinglevel", "subreddit_id": "t5_m0bnr"}, {"author": "Cooliceage", "body": "What's funny is that Joseph actually kinda sucks at 99 lol. He's played it once and doesn't have a switch. Different controls and mechanics take time to learn even if the games are similar.", "created_utc": "1614751171.0", "edited": "False", "id": "gpi8o86", "is_submitter": "False", "link_id": "t3_lw9nag", "parent_id": "t1_gph4teo", "score": "1", "subreddit": "nextfuckinglevel", "subreddit_id": "t5_m0bnr"}, {"author": "Cooliceage", "body": "It's the nes version which is deceptively difficult but very fun. If you don't have an original console you can find online emulators pretty easily by just googling it.", "created_utc": "1614751077.0", "edited": "False", "id": "gpi8jm7", "is_submitter": "False", "link_id": "t3_lw9nag", "parent_id": "t1_gph30f0", "score": "1", "subreddit": "nextfuckinglevel", "subreddit_id": "t5_m0bnr"}, {"author": "Cooliceage", "body": "Yup! The world championship happens every year (this year it was online) and is live streamed on twitch. There are other tournaments as well year around that are livestreamed.\n\nIf you want to watch more (this was just a snippet of a full match) you can go on the ctwc youtube channel. There are many excellent matches available, so I'll link one of my favorites here. Hope you enjoy! If you have any questions I would love to help, as I played in the world championships this year.\nhttps://youtu.be/YNZsCJkrt8U", "created_utc": "1614750990.0", "edited": "False", "id": "gpi8ff2", "is_submitter": "False", "link_id": "t3_lw9nag", "parent_id": "t1_gpgwkkv", "score": "1", "subreddit": "nextfuckinglevel", "subreddit_id": "t5_m0bnr"}, {"author": "Cooliceage", "body": "You might be thinking of a different version of the game. That would be nearly 100 levels past the current world record.", "created_utc": "1614750682.0", "edited": "False", "id": "gpi80a4", "is_submitter": "False", "link_id": "t3_lw9nag", "parent_id": "t1_gpgwhod", "score": "2", "subreddit": "nextfuckinglevel", "subreddit_id": "t5_m0bnr"}, {"author": "Cooliceage", "body": "If you want to watch more (this was just a snippet of a full match) you can go on the ctwc youtube channel and find matches from 2014 to now!\nhttps://youtube.com/c/ClassicTetris\n\n\nThere are so many excellent matches to watch, but I think a very exciting one that's a great introduction is this one with Jonas versus Greentea. Hope you enjoy! \nhttps://youtu.be/YNZsCJkrt8U", "created_utc": "1614750593.0", "edited": "False", "id": "gpi7vta", "is_submitter": "False", "link_id": "t3_lw9nag", "parent_id": "t1_gpgusrc", "score": "1", "subreddit": "nextfuckinglevel", "subreddit_id": "t5_m0bnr"}, {"author": "Cooliceage", "body": "The higher the level the more points you get per line clear. The game naturally progresses in speed over time, so they're trying to get all the points they can before it gets too fast.", "created_utc": "1614749834.0", "edited": "False", "id": "gpi6srg", "is_submitter": "False", "link_id": "t3_lw9nag", "parent_id": "t1_gpgoi5r", "score": "1", "subreddit": "nextfuckinglevel", "subreddit_id": "t5_m0bnr"}, {"author": "Cooliceage", "body": "It's a really fun game to watch! The commentators are excellent, the game is really viewer friendly, and I just think it's so mesmerizing. If you want to watch more you can on the [youtube channel.](https://www.youtube.com/channel/UC-8BAEcWSEs4-KQp1ULVnaQ) If you prefer to watch the tournaments live there's a monthly tournament the first and second Saturday of every month on [twitch](https://www.twitch.tv/monthlytetris) at 2 pm cst. Hope you enjoy!", "created_utc": "1614729046.0", "edited": "False", "id": "gph4khp", "is_submitter": "False", "link_id": "t3_lw9nag", "parent_id": "t1_gpgn99k", "score": "4", "subreddit": "nextfuckinglevel", "subreddit_id": "t5_m0bnr"}, {"author": "Cooliceage", "body": "He lost once in 2014 to Harry Hong, another top level player.", "created_utc": "1614728825.0", "edited": "False", "id": "gph44z9", "is_submitter": "False", "link_id": "t3_lw9nag", "parent_id": "t1_gpgw8gr", "score": "3", "subreddit": "nextfuckinglevel", "subreddit_id": "t5_m0bnr"}, {"author": "Cooliceage", "body": "He's been doing it for multiple years now. I think since 2016. He really likes tetris and is an excellent commentator why not do both?", "created_utc": "1614728791.0", "edited": "False", "id": "gph42kg", "is_submitter": "False", "link_id": "t3_lw9nag", "parent_id": "t1_gpgm5gq", "score": "2", "subreddit": "nextfuckinglevel", "subreddit_id": "t5_m0bnr"}, {"author": "Cooliceage", "body": "Well gameboy tetris has its own scene, though the top level players of gameboy are players of the NES version already. Usually the nes version is preferred because the rng is more even, and that the speed is more well tuned, but gameboy still has many very cool accomplishments to get! \n\nIf you want to see a gameboy tournament here you go!  \n[https://youtu.be/OCBVTLwFA9k](https://youtu.be/OCBVTLwFA9k)", "created_utc": "1614728697.0", "edited": "False", "id": "gph3vz0", "is_submitter": "False", "link_id": "t3_lw9nag", "parent_id": "t1_gpgczr8", "score": "3", "subreddit": "nextfuckinglevel", "subreddit_id": "t5_m0bnr"}, {"author": "Cooliceage", "body": "Thanks, I'll try them out!", "created_utc": "1612799243.0", "edited": "False", "id": "gmlacv2", "is_submitter": "False", "link_id": "t3_le0s1m", "parent_id": "t1_gmiatrk", "score": "2", "subreddit": "Tetris", "subreddit_id": "t5_2r133"}, {"author": "Cooliceage", "body": "This is a minor thing I noticed, but why does your crt say \"A-Type\" at the the top when you're on the B type menu? You also have the names for A type so I'm a little confused. Are you using an everdrive or something?", "created_utc": "1612732114.0", "edited": "False", "id": "gmi9q1j", "is_submitter": "False", "link_id": "t3_le0s1m", "parent_id": "t3_le0s1m", "score": "1", "subreddit": "Tetris", "subreddit_id": "t5_2r133"}, {"author": "Cooliceage", "body": "How did you get the square all the way to the left? That’s insane tapping", "created_utc": "1610498445.0", "edited": "False", "id": "gj2853s", "is_submitter": "False", "link_id": "t3_kvyn9g", "parent_id": "t3_kvyn9g", "score": "2", "subreddit": "Tetris", "subreddit_id": "t5_2r133"}, {"author": "Cooliceage", "body": "Don’t be disappointed about missing those to the left. There is not a single person in the entire world who can hit them consistently. Level 30 is an amazing accomplishment! If you haven’t already you can be added to the leaderboards on the ctm discord.", "created_utc": "1610138958.0", "edited": "False", "id": "gikyhgs", "is_submitter": "False", "link_id": "t3_kt4h2v", "parent_id": "t1_gikuh8f", "score": "2", "subreddit": "Tetris", "subreddit_id": "t5_2r133"}, {"author": "Cooliceage", "body": "Yup it’s a shame honestly how this has gone, but hopefully things will be alright. Good luck in the future!", "created_utc": "1609987182.0", "edited": "False", "id": "gidpics", "is_submitter": "False", "link_id": "t3_kb8pim", "parent_id": "t1_gidowd4", "score": "2", "subreddit": "WojakCompass", "subreddit_id": "t5_2q5rdn"}, {"author": "Cooliceage", "body": "So whatcha think of Hawlay now?", "created_utc": "1609986374.0", "edited": "False", "id": "gidnqq3", "is_submitter": "False", "link_id": "t3_kb8pim", "parent_id": "t1_gfg7c4f", "score": "5", "subreddit": "WojakCompass", "subreddit_id": "t5_2q5rdn"}, {"author": "Cooliceage", "body": "Ok pokenerd", "created_utc": "1609819840.0", "edited": "False", "id": "gi5a8yk", "is_submitter": "False", "link_id": "t3_kph1in", "parent_id": "t1_gi1gln4", "score": "1", "subreddit": "Tetris", "subreddit_id": "t5_2r133"}, {"author": "Cooliceage", "body": "In order to get into the top 64 you needed to get a 920k. A safe spot was one million points which is also known as a maxout. These are extremely difficult scores to achieve. Consistency is a lot harder on the nes version of tetris compared to the version you linked, because one misdrop one faster speeds is super fatal, and moving pieces around is much more difficult. Therefore there is a huge amount of variability in competitors consistent scores. I qualified and on a good day I can be consistent 800ks, with some 700ks and maybe a 1,000,000. I think of the top 64 I'm probably middle of the pack, maybe a little below that in terms of skill. The best players are getting 900ks nearly every game with many 1,000,000 point games and sometimes even 1.1s. Just to put into context how difficult these scores are, out of the millions of people who have played this game over the years, just over 200 people have ever gotten a maxout.\n\nOf you have any other questions just ask!\n\nIf you want a better explanation of the game and its difficulty here's a video. Just as a note the video is two years old and in that time frame players have improved a ton and also most high level players are now hypertappers.\n\nhttps://youtu.be/9RaqVGzhQTM", "created_utc": "1609819791.0", "edited": "False", "id": "gi5a5qs", "is_submitter": "False", "link_id": "t3_kphec7", "parent_id": "t3_kphec7", "score": "1", "subreddit": "Tetris", "subreddit_id": "t5_2r133"}, {"author": "Cooliceage", "body": "Hi trapzone", "created_utc": "1609819160.0", "edited": "False", "id": "gi590mv", "is_submitter": "False", "link_id": "t3_kpn2rw", "parent_id": "t1_gi0j4uf", "score": "2", "subreddit": "Tetris", "subreddit_id": "t5_2r133"}, {"author": "Cooliceage", "body": "There's a bigger and more popular competitive scene. While I would say that competitive modern tetris is easier to play, the nes scene has a couple big tournaments that are high profile. There's also the fact that it's much older and more established meaning there are a lot of personalities that have come out of the tournaments, leading to inspiration for other players. Also, from personal opinion, high level nes tetris looks humanly possible to pretty much anyone and nes tetris is a pretty big example of a game where you can look at others and just pick it up.", "created_utc": "1609617117.0", "edited": "False", "id": "ghuu0ks", "is_submitter": "False", "link_id": "t3_koo4n3", "parent_id": "t3_koo4n3", "score": "2", "subreddit": "Tetris", "subreddit_id": "t5_2r133"}, {"author": "Cooliceage", "body": "Wow that's definitely a big achievement for someone playing for such little time! I'm sure you'll get 500k soon! Good luck!", "created_utc": "1608695091.0", "edited": "False", "id": "ggrid4v", "is_submitter": "False", "link_id": "t3_kibo85", "parent_id": "t3_kibo85", "score": "1", "subreddit": "Tetris", "subreddit_id": "t5_2r133"}, {"author": "Cooliceage", "body": "https://docs.google.com/spreadsheets/d/1ZBxkZEsfwDsUpyire4Xb16er36Covk7nhR8BN_LPodI\n\nHere you go. Harry Homg holds das world record. There are other rankings listed as well, like highest level achieved.", "created_utc": "1608439746.0", "edited": "False", "id": "ggfzb4q", "is_submitter": "False", "link_id": "t3_keyds5", "parent_id": "t1_ggfvyyv", "score": "1", "subreddit": "Tetris", "subreddit_id": "t5_2r133"}, {"author": "Cooliceage", "body": "From below is a little different than nes Tetris so comparing the two isn’t possible. If you got the above with das I think it is probably das world record for from below.\n\nThe nes world record is Harry Hong with a 1.27\n\nhttps://youtu.be/Cg5SanIPCPw", "created_utc": "1608232156.0", "edited": "False", "id": "gg644at", "is_submitter": "False", "link_id": "t3_keyds5", "parent_id": "t3_keyds5", "score": "2", "subreddit": "Tetris", "subreddit_id": "t5_2r133"}, {"author": "Cooliceage", "body": "So I think you have some interesting ideas  so I'll try to respond to them, as a player who played in this years ctwc.\n\n\n1. To be honest i kinda disagree with your first point. This game is definitely still very easy to just pick up and play.  After  watching ctwc for around a year or so I decided to just pick it up during quarantine. A couple months later I'm in the main event. The main reason for this is hypertapping, because learning to play das on 19 takes a long time while tapping gives nearly everyone an easy ability to just improve very quickly. There's a reason nearly everyone in the event were newcomers, it's because tapping allows anyone an ability to get really good at this game pretty fast.\n\n2. We'll see how the new champion takes up the mantel tbh. I think Joseph was honestly an amazing head of the community and dog could be as well. It will definitely be different, because of age as well as other factors, but I'm sure it will be alright.\n\n3. Don't be worried about this type of stuff happening in the tetris community. A huge amount of the players are extremely close friends and, from talking to them, the fame hasn't gone to their heads. The community is usually extremely wholesome, with very little toxicity and only the occasional cheating issue, but besides that I don't expect the tetris community to become like the smash community.", "created_utc": "1608180342.0", "edited": "False", "id": "gg40ags", "is_submitter": "False", "link_id": "t3_keiqe5", "parent_id": "t3_keiqe5", "score": "3", "subreddit": "Tetris", "subreddit_id": "t5_2r133"}, {"author": "Cooliceage", "body": "Yup, both original nes.", "created_utc": "1607556453.0", "edited": "False", "id": "gf7zpcf", "is_submitter": "False", "link_id": "t3_k8y3ab", "parent_id": "t1_gf70ba0", "score": "2", "subreddit": "Tetris", "subreddit_id": "t5_2r133"}, {"author": "Cooliceage", "body": "Great video! This is amazing for so many reasons honestly. The Jeff meme is top notch of course. Also your gameplay is good. I'm a maxout player and there were quite a few times your move was better than my first idea, just gotta not make line bar dependencies. Also the music is completely awesome as well. I gave no jdea where you found 8 bit versions of those songs but they are great!", "created_utc": "1607489978.0", "edited": "False", "id": "gf4zv9q", "is_submitter": "False", "link_id": "t3_k8uvwg", "parent_id": "t3_k8uvwg", "score": "1", "subreddit": "Tetris", "subreddit_id": "t5_2r133"}, {"author": "Cooliceage", "body": "Wow you got this glitch! I think you’re the third person to ever get it. I got it before and the only other person in the discord that got it was tristop so that’s pretty cool! It’s funny how it’s always the same score as well. Tristop got it recorded so I’ve linked it below for you.\n\nhttps://www.twitch.tv/tristop/clip/DependableClumsyWrenFloof", "created_utc": "1607450263.0", "edited": "False", "id": "gf2prmq", "is_submitter": "False", "link_id": "t3_k8y3ab", "parent_id": "t3_k8y3ab", "score": "5", "subreddit": "Tetris", "subreddit_id": "t5_2r133"}, {"author": "Cooliceage", "body": "Pressing down to get a few extra points. It’s 1 point for every row pushed down. It’s basically nothing because even if you do push down points over the course of an entire game you might get 5k points. That’s why it’s exciting when push down points matter.", "created_utc": "1607446282.0", "edited": "False", "id": "gf2h5mv", "is_submitter": "False", "link_id": "t3_k94d2p", "parent_id": "t1_gf2fhe6", "score": "4", "subreddit": "Tetris", "subreddit_id": "t5_2r133"}, {"author": "Cooliceage", "body": "So Sharky gave some good advice for gameplay. I'll just give a list of links and resources here to learn das that you can look over if you need any help.\n\n[https://docs.google.com/document/d/1fGU9EaBz31NVh23BDxGi-9jNOTg8OEI7Vwg6Cy8Hjvg/edit](https://docs.google.com/document/d/1fGU9EaBz31NVh23BDxGi-9jNOTg8OEI7Vwg6Cy8Hjvg/edit) \\- FridayWitch's das guide. \n\n[https://youtu.be/9RaqVGzhQTM](https://youtu.be/9RaqVGzhQTM) \\- In Scout's description of the tournament there is a good visual description of das around 12 minutes in.\n\n[https://www.youtube.com/watch?v=W39VmyLLRuk](https://www.youtube.com/watch?v=W39VmyLLRuk) \\- 5 part series on how exactly das works and techniques for das.\n\n[https://youtu.be/JeccfAI\\_ujo](https://youtu.be/JeccfAI_ujo) \\- A really good das guide.\n\nWhen playing just keep this information in mind, and try to get it into muscle memory. The shift from emulator to console can be kinda difficult, but it just takes some time to get used to. Most people I've asked said around a week or two to get adjusted. After that point I'm sure you'll get the timing down and improve a ton. Good luck!", "created_utc": "1607184036.0", "edited": "False", "id": "gephfnf", "is_submitter": "False", "link_id": "t3_k71zkr", "parent_id": "t3_k71zkr", "score": "1", "subreddit": "Tetris", "subreddit_id": "t5_2r133"}, {"author": "Cooliceage", "body": "Well I'll try to answer these questions as well, though I'll be honest in saying this is a little bit deeper knowledge. Mountain of text incoming, because this is pretty specific knowledge.\n\nFirst controllers. If when you say \"original Nintendo hardware\" then you mean everything is from 1985 then I can't exactly say yes. A lot of players replace certain parts of their controllers when they break, such as the dpads. It's functionally the exact same, but not everything is super old. I don't think supply issues are going to be a concern since most things are very cheap, and assembling a nes controller is very easy. I can't tell you the exact difficulty in getting this stuff since my controller came with the nes I bought on ebay, and I haven't needed to replace anything. People also do mod their controllers and that is allowed, as long as you don't change the functionality. I've linked examples at the bottom.\n\n&#x200B;\n\nThe goofy foot controller has a unique story. If you don't want the story just skip the next paragraph. In sum the goofyfoot is the mega super exception only because it has been tested and is nearly identical to the original, and is made by a guy who is one of the organizers.\n\n&#x200B;\n\nSo the goofy foot is, as you said, not original in the sense that it was not released back in the 80s. It was made I believe in the early 2010s? I can't tell you that for sure. So here's the story. So there's Steve, who's amazing btw, and he is super smart. He has been going to the tournaments forever, and he wants to improve the experience. He decides to make a nes controller that switches the sides of the dpad and the buttons, but he tries to make it as faithful as the original. It is nearly identical to the original, except for the sides being switched. Now Steve is also one of the judges for ctwc, and is well known also for being the guy that Quaid plays with when he streams or plays online. If you watched the ctwc videos with Quaid this year the guy that Quaid is high-fiving is Steve. So Steve is a guy with credit in the community, he makes a controller that is tested by tons of players and after that much work they decide collectively it's such a good clone that you are allowed to use it for ctwc tournaments. The major reason they decide that is because it uses the same parts as an original, except for the circuit board. Same shape, same buttons, same pads, same case. You can actually just buy the board off him and you can solder your original controller into a goofyfoot. \n\n&#x200B;\n\nOther clone controllers are not allowed because they often are not close enough to the original. I don't mean in parts, I mean in design. If the shape is different, or the buttons are in different spots, or anything else it is too different then it isn't allowed. In sum the organizers care about functionality, and not age or other stuff like that. Visual mods, and part switching is allowed, because the game is still the same.\n\n&#x200B;\n\nOk clone consoles. First the organizers originally did not allow any clone consoles. They tested a ton of them a couple of months ago, and only allowed the Retron, so there must be a reason. I've linked an interview with the organizers at the bottom for more info on the topic. From what I have heard the Retron is the most faithful to the nes, and might be the only clone with absolutely no input delay, because I have heard the retro bit might have some lag. I can't tell you the exact reasons for which was allowed or not. It might have to do with the few top players that use clone consoles, like dog, using retron. From personal experience in terms of gameplay the nes and retron is the same, except for the slight decrease in audio quality and some color palette changes. I played in ctwc this year in the gold bracket with a retron and it worked well, so I can assure you it was all good. I know this isn't the most satisfactory answer, but I hope that I answered your question\n\n&#x200B;\n\nHope this was helpful, even if it was super long. Good luck with everything!\n\n&#x200B;\n\n[https://www.instagram.com/arbitriumcontrollers/?hl=en](https://www.instagram.com/arbitriumcontrollers/?hl=en) \\- visual mods for nes controllers that are allowed. Joseph and Nerdzz both play with these, and you can see them in ctwc.\n\n[https://www.kickstarter.com/projects/totalradnes/goofy-foot-nes-controller-mod-kit](https://www.kickstarter.com/projects/totalradnes/goofy-foot-nes-controller-mod-kit) \\- Original kickstarter for the goofyfoot.\n\n[https://www.youtube.com/watch?v=uQInAmaO7no](https://www.youtube.com/watch?v=uQInAmaO7no) \\- Here's an interview with the organizers from a couple of months ago, before they even allowed any clone consoles. They discuss clones 19 minutes in.\n\n[https://thectwc.com/rules-2020/](https://thectwc.com/rules-2020/) \\- Controller rules are at the very bottom of the page if you want to look.", "created_utc": "1607182994.0", "edited": "False", "id": "gepfll3", "is_submitter": "False", "link_id": "t3_k6wk8u", "parent_id": "t1_geobv3w", "score": "1", "subreddit": "Tetris", "subreddit_id": "t5_2r133"}, {"author": "Cooliceage", "body": "1. First person to get it was Thor Aucerland, the nintendo world champion, in the 90s. No vid from then but he got it again in 2010 so no reason to doubt him.\n2. Current level record is EricICX with a level 38. It's on youtube so you can find it there,\n3. On the classic tetris monthly discord server they compile this data into a spreadsheet. I've linked it below. The list goes by highest level achieved and then lines achieved on that level. There might be some people missing as they have been trying to compile it over the course of the last month and a half or so.\n\nhttps://docs.google.com/spreadsheets/d/1ZBxkZEsfwDsUpyire4Xb16er36Covk7nhR8BN_LPodI\n\nIf there is any other way I can help feel free to ask. I am tied for number 34 on that spreadsheet so I can give you answers from the perspective of someone who has achieved a level 30. Good luck!", "created_utc": "1607145258.0", "edited": "False", "id": "geo9b5p", "is_submitter": "False", "link_id": "t3_k6h0hw", "parent_id": "t3_k6h0hw", "score": "1", "subreddit": "Tetris", "subreddit_id": "t5_2r133"}, {"author": "Cooliceage", "body": "I mean you don't have to, to be honest. If you just want to be a fan, which is reasonable imo this game can get you addicted quick, then just asking questions on reddit and watching on youtube/twitch is fine. If you want a lot of detailed information or if you want to ask the players themselves then discord is probably needed. Also if you want to play in any of the tournaments they are organized on discord. If you don't plan on doing that kind of stiff then discord isn't necessary.", "created_utc": "1607144621.0", "edited": "False", "id": "geo8fid", "is_submitter": "False", "link_id": "t3_k6wk8u", "parent_id": "t1_geo7nuk", "score": "1", "subreddit": "Tetris", "subreddit_id": "t5_2r133"}, {"author": "Cooliceage", "body": "I mean dog played this game and absolute ton to get this good. Something like 3 hours per day for months of dedicated practice and analysis to get to his skill.", "created_utc": "1607144144.0", "edited": "False", "id": "geo7ra8", "is_submitter": "False", "link_id": "t3_k672fg", "parent_id": "t1_gelub3h", "score": "1", "subreddit": "Tetris", "subreddit_id": "t5_2r133"}, {"author": "Cooliceage", "body": "Alright I played in ctwc this year so i'll try to help. If you have any other questions just ask.\n\n1. No ctwc subreddit sorry, everything is really on the discord, which is also the reason you often don't see much posted on reddit about ctwc, it's all on discord.\n\n2. There isn't really a dedicated subreddit for nes tetris. Sorry.\n\n3. Yeah this subreddit is for all tetris games, so there is a wide variety of content. I would say sometimes this subreddit is mostly nes tetris and other days it has none. Not really a consistent amount.\n\nPretty much everything is on discord, which I can understand is hard to get used to. Before I got into nes tetris I actually never used discord and now I use it often just for this game. If you have amy other questions feel free to ask and I.ll try to help to the best of my ability! Good luck, and I hope to see you for the top 8 broadcast this sunday!", "created_utc": "1607143890.0", "edited": "False", "id": "geo7dw5", "is_submitter": "False", "link_id": "t3_k6wk8u", "parent_id": "t3_k6wk8u", "score": "1", "subreddit": "Tetris", "subreddit_id": "t5_2r133"}, {"author": "Cooliceage", "body": "The organizers of the event wanted to give a chance for as many people to play as possible. Thus they made a separate tournament for lower skilled players called the silver bracket, one level below the gold bracket. The gold bracket were the top 64 seeds in qualifying while seeds 65-96 played in the silver bracket.\n\nRetron 1 and 1HD were allowed because they use nes chipsets and are practically identical to the original nes. Other clone consoles tend to have different components the organizers thought were too different from the original and didn't allow it. As someome who has gotten high scores on both nes and Retron 1 HD I can tell you they are exactly the same, except some colors and audio.\n\nThere are a couple nes controller variants that are approved for the competition. There's the original nes controller. Then there's the goofyfoot controller, which is a modified nes controller that flips the buttons and dpad, so the left and right buttons are on the right side of the controller rather than the left. There's also the dogbone controller which was another variant from back in the day which is allowed but no one uses. Keyboards, xbox controllers, mice and other stuff are nit approved controllers.\n\nInformation is hard to find because a lot of the information doesn't come from any one place, and a lot of the work comes from the community in the ctm discord, For example the document they used for qualifying livestreams, which showed cutoffs and all the scores, was actually made my a couple people in the discord for fun and then the organizers decided to use it for the stream, info is just hard to find in general, but if you have any questions you can message me or go to the ctm discord and ask there. Good luck and enjoy watching! Hope this was helpful!", "created_utc": "1607143446.0", "edited": "False", "id": "geo6qnb", "is_submitter": "False", "link_id": "t3_k6wk8u", "parent_id": "t1_genqvl8", "score": "2", "subreddit": "Tetris", "subreddit_id": "t5_2r133"}, {"author": "Cooliceage", "body": "I know this might be a controversial opinion, but the UN seems pretty good to me. If you only look at the human rights council and Israel then I guess sure you can dislike them, but the UN is a huge organization. The WHO is part of the UN and that's the reason for the eradication of smallpox. A lot of the rules that govern international trade were established at the union, and many standards that make cooperation between countries easier come from the UN, for example maritime law. I wouldn't say the UN is perfect, but they a ton of stuff and I think most of what they do is good.", "created_utc": "1606931186.0", "edited": "False", "id": "gee5oko", "is_submitter": "False", "link_id": "t3_k523je", "parent_id": "t3_k523je", "score": "0", "subreddit": "PoliticalCompassMemes", "subreddit_id": "t5_3ipa1"}, {"author": "Cooliceage", "body": "Yup, its pretty much identical in terms of mechanics. The only difference would be some input delay and a different controller and monitor. I don't know if it's equally easy to learn, since competitive matches are different than playing by yourself, and starting levels might be different, but you can definitely do it. Good luck and have fun!", "created_utc": "1606707789.0", "edited": "False", "id": "ge45c8d", "is_submitter": "False", "link_id": "t3_k3gt1t", "parent_id": "t3_k3gt1t", "score": "3", "subreddit": "Tetris", "subreddit_id": "t5_2r133"}, {"author": "Cooliceage", "body": "Wait what. 1.3 videos are not useful for anyone, as they all rely on a ton of super high level moves and amazing rng. Honestly they should just watch the ctwc matches this year and try to understand the placements of the people on 18.", "created_utc": "1606140466.0", "edited": "False", "id": "gdbxudk", "is_submitter": "False", "link_id": "t3_jz6l0m", "parent_id": "t1_gdasszk", "score": "4", "subreddit": "Tetris", "subreddit_id": "t5_2r133"}, {"author": "Cooliceage", "body": "You really don't need to exercise in order to hypertap. Tapping isn't really a strength thing, as can be seen with some of the best tappers being skinny,  Even if you really wanted to, I don't think think there are any exercises for tapping and the only stretch I recommend is just stretching your wrists between games and after playing. No one knows how tapping works exactly, so really the only way to improve is to practice and to ask other good players for technique. If you have any questions I would be willing to answer or you can go to the classic tetris monthly discord server and ask there. Good luck!", "created_utc": "1605934639.0", "edited": "False", "id": "gd0o6wa", "is_submitter": "False", "link_id": "t3_jxywev", "parent_id": "t3_jxywev", "score": "5", "subreddit": "Tetris", "subreddit_id": "t5_2r133"}, {"author": "Cooliceage", "body": "Both tgm grandmaster and level 37 in one day. Incredible.", "created_utc": "1605618356.0", "edited": "False", "id": "gcltw2o", "is_submitter": "False", "link_id": "t3_jvmy8q", "parent_id": "t3_jvmy8q", "score": "4", "subreddit": "Tetris", "subreddit_id": "t5_2r133"}, {"author": "Cooliceage", "body": "I mean in the end it is the same as all hypertapping where you just have to vibrate your fingers fast on the dpad. I think most people switch from thumb to index and middle finger, and if you can't tap with your left hand you can try to do a sort of crossover grip where your right hands taps and your left hand rotates. \n\nHere's a video demonstrating a guy tapping, which might be helpful just to see.\n\n[https://www.youtube.com/watch?v=FYY4T3DQExY](https://www.youtube.com/watch?v=FYY4T3DQExY)\n\n&#x200B;\n\nGood luck!", "created_utc": "1605222613.0", "edited": "False", "id": "gc3j3ph", "is_submitter": "False", "link_id": "t3_jt3u1z", "parent_id": "t3_jt3u1z", "score": "3", "subreddit": "Tetris", "subreddit_id": "t5_2r133"}, {"author": "Cooliceage", "body": "Good luck with your lesson. Greg is a great guy so I’m sure he will help a lot.\n\nIf you want to make a video on hypertapping I wish you the best of luck! It’s definitely not as simple as people think it is and it would be great to have a beginners guide to the technique out there. What I recommend is that you run the script and ideas by expert hypertappers in discord in in case you miss anything and just for help in general. Also I’m sure that a lot of people would also be willing to help with footage, as you might want videos from people that use different grips to demonstrate those differences.  Good luck again on your journey!", "created_utc": "1605032513.0", "edited": "False", "id": "gbuodp2", "is_submitter": "False", "link_id": "t3_jqujlz", "parent_id": "t3_jqujlz", "score": "2", "subreddit": "Tetris", "subreddit_id": "t5_2r133"}, {"author": "Cooliceage", "body": "I don't know exactly what you mean by the new contenders lacking in cool factor, diversity or character. The entire tournament this year had a lot more contenders from around the world, even if they didn't make it to top 8. In 2018 there was something like 5 players from around the world, and the only people from outside the U.S that made it far were Greentea, Koryan and Svavar. I also think these guys have a ton of character. Just watching them play is super exhilarating and they aren't statues while they play. I'm just kinda curious what you meant by the new guys being kinda boring?", "created_utc": "1604961588.0", "edited": "False", "id": "gbrlnb1", "is_submitter": "False", "link_id": "t3_jr4myr", "parent_id": "t1_gbrg35j", "score": "16", "subreddit": "Tetris", "subreddit_id": "t5_2r133"}, {"author": "Cooliceage", "body": "Really well done! It was cool to see the clip on discord and I can’t wait to watch more of the stream!", "created_utc": "1604676552.0", "edited": "False", "id": "gbcqeym", "is_submitter": "False", "link_id": "t3_jovt2a", "parent_id": "t3_jovt2a", "score": "3", "subreddit": "Tetris", "subreddit_id": "t5_2r133"}, {"author": "Cooliceage", "body": "Yup hyper tapping will work, and it might be faster because certain controllers, like Xbox, could allow you to butterfly click which is usually faster than jitterclicking on a nes controller. We will see if it will be allowed in competitions in the future.", "created_utc": "1604619106.0", "edited": "False", "id": "gba8j7k", "is_submitter": "False", "link_id": "t3_jonmee", "parent_id": "t3_jonmee", "score": "3", "subreddit": "Tetris", "subreddit_id": "t5_2r133"}, {"author": "Cooliceage", "body": "Ok I’ll try to give a bit of a more thorough answer that isn’t a meme.\n\nThor Auckerland is the first person who is known to hypertap in Tetris. I’m pretty sure people have been jitterclicking and stuff like that for longer than that, especially for shooters, but he is really the inventor of the technique.\n\nFor a very long time he was the only hypertapper, except for a guy called DanZ who doesn’t really matter and you can find on YouTube.\n\nThe thing is both DanZ and Thor had very generic grips for holding the controller. Thor was left handed and held the controller normally so no one could really copy his technique. No innovation happened with hypertapping until Koryan.\n\nKoryan had a very different grip than every other hypertapper and he was the guy that popularized the method. Joseph was directly inspired by Koryan, and uses a variant of his grip. Joseph of course inspired a ton of other people so I would say Koryan was the original popularizer of hypertapping. Pretty much every modern day hypertapper saw Koryan/Joseph play and then decided they could. Nowadays there a ton of other grips so there has been innovation but I would say it’s really Koryan who popularized it and Thor who invented it.", "created_utc": "1604527602.0", "edited": "False", "id": "gb5vsvu", "is_submitter": "False", "link_id": "t3_jnlj26", "parent_id": "t3_jnlj26", "score": "3", "subreddit": "Tetris", "subreddit_id": "t5_2r133"}, {"author": "Cooliceage", "body": "Wait you can consistently tap 10 high left on 19? Wow that is fast, not many people can do that.\n\nAlso have fun recording. I know it can be useful for stacking and stuff, but I think it’s just cool to record your games to see how you improve over times and to have videos of accomplishments. I have recordings ever since I started on console and it’s really fun looking back at how I’ve grown so have fun and good luck!", "created_utc": "1604526895.0", "edited": "False", "id": "gb5ubfq", "is_submitter": "False", "link_id": "t3_jntjr3", "parent_id": "t3_jntjr3", "score": "2", "subreddit": "Tetris", "subreddit_id": "t5_2r133"}, {"author": "Cooliceage", "body": "I think the other commenters numbers are a little off\n\n\n8 left: ~11.5hz\n\n9 left: ~12.5 hz\n\n10 left: ~13.5 hz\n\n11 left: ~15 hz\n\nHere’s the thing to remember about these numbers, they aren’t 100% useful because they make two assumptions\n\n1. They assume your first tap is on the first frame that the piece entires the screen. This is a difficult skill that takes a ton of practice, and is what the really good players do. Most beginner tappers don’t actually time their first tap, but they just tap late as fast as possible and then hope. Tapping on the first frame is why you sometimes see a tapper early shift, because they are trying to time their first tap for the next piece. This skill is good to practice. When hypertapping something try to tap it the moment it entires the screen, not  after its already fallen a block or two.\n\n2. These are all minimum values. Yes you only technically need 12.5 hz to tap 9 left, but pretty much every tapper that does that consistently is closer to 13 and for 10 high most have 14hz. The current fastest tapper is EricICX and he can go do consistent 11 left, but he needs to tap 17-20hz to do that consistently, not 15. So when looking at these values, if you can do a certain height consistently your hertz is probably a little higher, and if want to aim for a certain height (8 is recommended) then you need to be faster than the value listed.\n\n\nI write this super long post so that you don’t get discouraged about missing some of the harder taps and if you are inconsistent with them. There is a huge margin to improve and it isn’t only tapping speed, which can feel very fixed, stopping you. I went from getting 7 high pretty consistently when I started to 9-10 high now, and my tapping is only something like ~0.5-1 hz faster. So in sum you can get much better at hypertapping without having to practice tapping faster, you just gotta tap smarter.", "created_utc": "1603298772.0", "edited": "False", "id": "g9k1jm0", "is_submitter": "False", "link_id": "t3_jf7y62", "parent_id": "t3_jf7y62", "score": "1", "subreddit": "Tetris", "subreddit_id": "t5_2r133"}, {"author": "Cooliceage", "body": "Moodeuce is a bit of a meme player in the community, for some reason. He is the butt of a lot of jokes and most people didn’t expect him to get into the event. He got a really good qualifying score for himself and now is going to face the world champion, so there have been a lot of jokes about the match.", "created_utc": "1603132563.0", "edited": "False", "id": "g9cq0bx", "is_submitter": "False", "link_id": "t3_jdwuep", "parent_id": "t1_g9ciwp7", "score": "2", "subreddit": "Tetris", "subreddit_id": "t5_2r133"}, {"author": "Cooliceage", "body": "I think the posts are a good length. They are fun to read!\n\nFor tapping, speed is important, but I feel like for a beginner the more important thing is precision, consistency and stamina. When I first started learning to tap I was kinda like you - I would be able to tap relatively fast left or right but I could never get anything to the middle and after half an hour my wrist would hurt and I would start tapping really slowly. Here’s some advice I would give\n\nPrecision - this is your ability to move pieces to exactly where you want. So the ability to hyper tap a piece only 3 places is really good precision. You mentioned how often times you are only able to move pieces all the way to wall, and you don’t have the precision. I recommend practicing moving pieces a specific distance, which is why b type is good hyper tapping practice. Also remember you don’t have to always be hyper tapping. If you only have to move somethings once or twice or the board is low you can just tap the pieces kinda slowly to their position.\n\nConsistency - this is the infamous 2hz moments where one just messes up their taps and is way too slow. This just comes from getting used to the grip and lots of practice, but just try to be consistent with your taps\n\nStamina - I am sure after something like 30 minutes your wrist/arm/everywhere starts to ache. This gets better with time and a lot of tappers take around a month to get super used to tapping for long periods of time. Some advice. Try to make sure your grip is very comfortable in your hands. Don’t move your body too much. If you are constantly vibrating a ton you will tire yourself out. Also you are allowing to tap lightly or use das occasionally in order to stop yourself from tiring out. I know a ton of really good tappers use das on level 19 so they don’t tire themselves. Also make sure to stretch your arms and wrists occasionally.\n\nAlso, in case you didn’t know, the world championships’ qualifications were this week, so you can watch those games if you want to see how different skill levels stack differently. Try to notice mistakes and really good moves and incorporate them into your game. The main event will also happen in two weeks so you can watch that for stacking advice or just for fun. \n\nIf you continue practicing this much in such a concentrated way then I can see you improving very quickly! I practiced at around the same pace as you did and after 6 months I am participating in the ctwc main event (I’m eren) so if you continue at this pace you can definitely get some very good scores this year! Good luck on your journey!", "created_utc": "1603132061.0", "edited": "False", "id": "g9coz8d", "is_submitter": "False", "link_id": "t3_jdvvhd", "parent_id": "t3_jdvvhd", "score": "1", "subreddit": "Tetris", "subreddit_id": "t5_2r133"}, {"author": "Cooliceage", "body": "It’s top seed in each bracket vs bottom seed. So Joseph will face Moodeuce in the ultimate meme match of the century. Then Richard will face Alex_H.", "created_utc": "1603109466.0", "edited": "False", "id": "g9bdxyb", "is_submitter": "False", "link_id": "t3_jdwuep", "parent_id": "t1_g9bcafw", "score": "5", "subreddit": "Tetris", "subreddit_id": "t5_2r133"}, {"author": "Cooliceage", "body": "He submitted, it just was late at night so when this screenshot was taking it showed red.", "created_utc": "1603107668.0", "edited": "False", "id": "g9bbn3e", "is_submitter": "False", "link_id": "t3_jdwuep", "parent_id": "t1_g9bae0t", "score": "5", "subreddit": "Tetris", "subreddit_id": "t5_2r133"}, {"author": "Cooliceage", "body": "Yeah but the difference is that the top 40 this year got maxouts. To get into main event they want consistent 800k+ and then your fluke score is 900k+. Consistently 700k with a 800k best during qualification or something would get you into a the silver bracket, and you could probably dominate that bracket.", "created_utc": "1603107601.0", "edited": "False", "id": "g9bbk4a", "is_submitter": "False", "link_id": "t3_jdv6rq", "parent_id": "t1_g9azyph", "score": "0", "subreddit": "Tetris", "subreddit_id": "t5_2r133"}, {"author": "Cooliceage", "body": "To get 500k I highly recommend playing on a lower level and focusing on not making any mistakes and trying to stack well. When choosing a level try to play on a level where you don’t make too many mistakes due to speed and are able to keep the board flat. I reckon starting on either level 9, or 12 would be best, but if you are confident you can try 15 or 19.\n\nFor scoring higher remember the goal is to score tetrises with the long bar, not clear as many lines as possible. Try to open up a “well” on the right side more than four blocks high and slide long bars there. You get a lot more points and that is how you go from 100k to 500k.  Get consistent at this and you will be scoring high. I recommend googling some games and watching what people are trying to do to score well. \n\nIf you want instructional videos then I can think of two sources. The first is “Jonas’ Tetris lessons” on YouTube. Watch the Tetris 101 video and you will understand how to play and score well. The second is agamescout’s video that gives an overview of the game and the tournament. This will help explain the mechanics  of the game, and explain the tournaments if you are interested.", "created_utc": "1602873460.0", "edited": "False", "id": "g910h5y", "is_submitter": "False", "link_id": "t3_jbv0sf", "parent_id": "t3_jbv0sf", "score": "1", "subreddit": "Tetris", "subreddit_id": "t5_2r133"}, {"author": "Cooliceage", "body": "I don’t think 19-4 has even been done on pal! I don’t actually think 19-5 is possible even with a computer.\n\nI think 19-5 on ntsc is at 8 or 9? Agamescout on YouTube has a video about the topic and lists a couple people that have done it. From memory the current list is\n\nMarq\nJake\nPoet\nJoseph\nSodiumOverdose\nEricICX\nBreandon/Bv09\nDogPlayingTetris \n\nI am 100% sure about everyone above. I might have missed some people. I feel like Cheez_Fish has done it, but I’m not sure. Hope this is helpful!", "created_utc": "1602870867.0", "edited": "False", "id": "g90vbe4", "is_submitter": "False", "link_id": "t3_jcakhq", "parent_id": "t3_jcakhq", "score": "3", "subreddit": "Tetris", "subreddit_id": "t5_2r133"}, {"author": "Cooliceage", "body": "It was such a wholesome stream. I remember watching Anna qualify and I was so shocked the entire time. The fact that they even added her to the interesting player list was also cool", "created_utc": "1602870343.0", "edited": "False", "id": "g90u9kl", "is_submitter": "False", "link_id": "t3_jc8cvo", "parent_id": "t3_jc8cvo", "score": "4", "subreddit": "Tetris", "subreddit_id": "t5_2r133"}, {"author": "Cooliceage", "body": "I mean it applies to elections for us house and senate, as well as for the state house. I think it also applies for governor and other executive branch positions. Most importantly though is the fact that it applies in primaries. Most democratic primaries in mass have the votes split between 2-4 candidates with the winner getting like 20%. A ranked choice vote would change that and also stop splitting the progressive vote.", "created_utc": "1600888488.0", "edited": "False", "id": "g6ciijd", "is_submitter": "False", "link_id": "t3_ixz8mn", "parent_id": "t1_g6b8zst", "score": "1", "subreddit": "PoliticalCompassMemes", "subreddit_id": "t5_3ipa1"}, {"author": "Cooliceage", "body": "I'm really glad that I could help out. I don't think awards do anything, but I don't really know. I don't really recommend wasting your money on reddit though. You could always use it for yourself.\n\nI'm sure you could one day go to the tournament. Even if you don't get in, you can always watch the matches which is a wonderful time! Lots of luck playing tetris! \n\nThor's video is completely real, and the reason that it is confirmed legit is because it actually comes from the documentary!\n\nIf you want a good place for improving your game I recommend [Jonas' tetris lessons](https://www.youtube.com/playlist?list=PLjvvUIYe8rKW3HDvoRiBohQdfBW6J3BXj) for a good baseline guide for stacking. [AGameScout's](https://www.youtube.com/watch?v=9RaqVGzhQTM) video on the tournament also explains the mechanics of the game and the difficulty of getting tetrises better than I could. The biggest thing that will help you improve is by looking at other good players and trying to predict where they put the pieces before they land. Usually people go watch the ctwc matches on youtube and  at 0.25x speed and try to predict the moves. Since both players get the same piece sets you can see who is playing better and try to emulate them. If you prefer someone teaching someone else on good stacking [TheMisterValor](https://www.twitch.tv/collections/C_1qwNEzIRZG4Q?filter=collections) does coaching sessions and explains why some moves are better than others else. He also uses the in game shift rather than hypertapping so it might be better for you. His vods are somewhat long though so that might not be for you. In the end the best way to improve is just playing and enjoying yourself.\n\nI hope all this information is helpful, and not excessive! Good luck and enjoy tetris!", "created_utc": "1598971075.0", "edited": "False", "id": "g3ld3oq", "is_submitter": "False", "link_id": "t3_ijrdec", "parent_id": "t1_g3k0als", "score": "1", "subreddit": "Tetris", "subreddit_id": "t5_2r133"}, {"author": "Cooliceage", "body": "Sorry for this being super long. I got kinda carried away. Hope it’s helpful!\n\nIf you want to see what were considered good scores around that time then I recommend watching “the ecstasy of order.” It’s the 2009 documentary that started the yearly tournaments and it mentions line records and what was considered good scores at the time. I think most of the people in the film had personal best scores of 850k+. Every player in the film had been playing since the game came out (except Alex) so their stories might be similar to yours also.\n\n\nYou could also watch the old Nintendo world championships and see if the contestants told their best scores. It might also be a nostalgia trip for you, but they don’t hold up super well now. I think that if you could get a 600k back then you would have been really good and I think most of the contestants had 700k personal bests.\n\nFrom another comment you said you would only line out. While getting to killscreen consistently this way is still super impressive, it is easier than building up for tetrises. Usually the difficulty of scoring high comes from risk management while trying to keeping the Tetris well open, and if you just line out that difficult element of the game isn’t there. If you want to come back to the game and try to get high scores you gotta learn how to build for tetrises.\n\nAlso it might be mechanical issue, but it’s more likely latency from the tv and not the controller. If you use the button to move the pieces then the input latency from the tv can really mess you up and make play on 19 speed nearly impossible. If you still have a crt tv I recommend playing on it. \n\nAlso I know you saw the line record at 297 but remember that that is only the highest recorded line count at the time. Unless you were recording your games on vhs it wouldn’t have really meant much. Thor Auckerland claimed to have gotten to 310 lines during that time but no one believed him because he had no video. Turns out he was probably right. So don’t be too dismayed that you weren’t in the record books, because at the time it was mostly just a few people who had the chance to record their games.\n\nAlso if you want to get back into the game I am 100% sure you can do it! There actually is another person, DLo, who played the game when he was young, was similar to you in skill, and only came back to the game recently and has gotten a max out. He is in his 40s and some other super good players (Koryan is 45~, Jonas is 40) are still amazing at the game and not teenagers. Good luck!", "created_utc": "1598885862.0", "edited": "False", "id": "g3h1wxt", "is_submitter": "False", "link_id": "t3_ijrdec", "parent_id": "t3_ijrdec", "score": "2", "subreddit": "Tetris", "subreddit_id": "t5_2r133"}, {"author": "Cooliceage", "body": "Vibrating faster is kinda just a matter of practice. Making less movement with your body usually helps your consistency. You don’t want to be jerky but just tense up your arm and vibrate your fingers. Try to make the distance between each tap as little as possible. \n\nStill on pal I don’t recommend tapping at all. Like another comment said you need something like 14-15hz consistently, which is really difficult. A huge chunk of tappers that have maxouts on ntsc don’t tap that fast. Just practice das and you can play on 19 speed. If you really feel like you can’t play high enough then you can practice quick taps also. Good luck!", "created_utc": "1597500661.0", "edited": "False", "id": "g1lc6dc", "is_submitter": "False", "link_id": "t3_i9uzx3", "parent_id": "t3_i9uzx3", "score": "2", "subreddit": "Tetris", "subreddit_id": "t5_2r133"}, {"author": "Cooliceage", "body": "Here you go\n\n&#x200B;\n\n [https://docs.google.com/spreadsheets/d/1uzb-kYd3XRHWxrB31EvnQZWhXn70rjhQVWf3gml63-Y/edit#gid=906058999](https://docs.google.com/spreadsheets/d/1uzb-kYd3XRHWxrB31EvnQZWhXn70rjhQVWf3gml63-Y/edit#gid=906058999)", "created_utc": "1597111664.0", "edited": "False", "id": "g12688l", "is_submitter": "False", "link_id": "t3_i6nupm", "parent_id": "t1_g0yxk3f", "score": "2", "subreddit": "Tetris", "subreddit_id": "t5_2r133"}, {"author": "Cooliceage", "body": "Bravo!", "created_utc": "1597010027.0", "edited": "False", "id": "g0xlkgl", "is_submitter": "False", "link_id": "t3_i6ettx", "parent_id": "t3_i6ettx", "score": "1", "subreddit": "Tetris", "subreddit_id": "t5_2r133"}, {"author": "Cooliceage", "body": "After watching this I think that a max out is now more unobtainable and more obtainable than before.", "created_utc": "1597010001.0", "edited": "False", "id": "g0xlipw", "is_submitter": "False", "link_id": "t3_i6nupm", "parent_id": "t3_i6nupm", "score": "1", "subreddit": "Tetris", "subreddit_id": "t5_2r133"}, {"author": "Cooliceage", "body": "Congrats! I’m sure 800 will come soon!", "created_utc": "1596642186.0", "edited": "False", "id": "g0gezos", "is_submitter": "False", "link_id": "t3_i3mb6b", "parent_id": "t3_i3mb6b", "score": "2", "subreddit": "Tetris", "subreddit_id": "t5_2r133"}, {"author": "Cooliceage", "body": "Congrats! Good luck with all your future Tetris games! How long did it take you to get this?", "created_utc": "1596124658.0", "edited": "False", "id": "fzqnvle", "is_submitter": "False", "link_id": "t3_i09k2x", "parent_id": "t3_i09k2x", "score": "1", "subreddit": "Tetris", "subreddit_id": "t5_2r133"}, {"author": "Cooliceage", "body": "Console doesn't really matter for latency. It's really the tv that makes or breaks the latency amount.  So an original console and an imitation console are both equally good with the right tv.\n\nIf you want more information on general setups then I recommend this video by gamescout.\n\n[https://youtu.be/kH5C7UDI8TI](https://youtu.be/kH5C7UDI8TI)", "created_utc": "1596063679.0", "edited": "False", "id": "fzo6nua", "is_submitter": "False", "link_id": "t3_hzcxsl", "parent_id": "t3_hzcxsl", "score": "1", "subreddit": "Tetris", "subreddit_id": "t5_2r133"}, {"author": "Cooliceage", "body": "Here’s\n[an 81 piece drought](https://youtu.be/1hIlqkwUcy0) on 19 by Buco. He couldn’t survive it so this wasn’t even the end of the drought!", "created_utc": "1595088303.0", "edited": "False", "id": "fyh0fid", "is_submitter": "False", "link_id": "t3_htd3ic", "parent_id": "t1_fyganx1", "score": "2", "subreddit": "Tetris", "subreddit_id": "t5_2r133"}, {"author": "Cooliceage", "body": "https://youtu.be/9WLoLhOdkjI\n\nHere’s a video.", "created_utc": "1595010233.0", "edited": "False", "id": "fyduw6q", "is_submitter": "False", "link_id": "t3_hsolc6", "parent_id": "t3_hsolc6", "score": "1", "subreddit": "Tetris", "subreddit_id": "t5_2r133"}, {"author": "Cooliceage", "body": "Maybe remove \"the one.\" I feel like writing \"I wouldn't have guessed I'd be holding the knife.\"", "created_utc": "1595002795.0", "edited": "False", "id": "fydfddf", "is_submitter": "False", "link_id": "t3_hspefi", "parent_id": "t1_fycrf63", "score": "10", "subreddit": "TwoSentenceSadness", "subreddit_id": "t5_i6r2v"}, {"author": "Cooliceage", "body": "It is going to be an interesting tournament to be sure. I’m a little surprised that only 8 people will make it into the main event. I would have expected it to be 16 players, with the winners of the losers brackets also getting to play, but I’m sure they know better.\n\nI wonder how the requirement for webcams and microphones will change the people participating. There are some really good players who don’t show their face. Will people like dog, or poet participate with the rules? I am not sure.\n\nI am also really curious what the cutoff will be in order to participate in the tournament. Last years cutoff was something like 800k and with the number of good players increasing you might have to get a max out just to play! That will be interesting to see, to say the least. It also sounds like scores past a max out will be considered for qualifying so get ready for the crazy scores.\n\nWhatever happens I’m excited to watch the matches this year!", "created_utc": "1594829598.0", "edited": "False", "id": "fy5ng2x", "is_submitter": "False", "link_id": "t3_hrc05w", "parent_id": "t1_fy35m48", "score": "2", "subreddit": "Tetris", "subreddit_id": "t5_2r133"}, {"author": "Cooliceage", "body": "You can start from any level from 0 to 19 in nes Tetris. In order to start at levels 10-19 you hold the A button and press start. This adds 10 levels to the number you selected. This is how competitions start at level 18.", "created_utc": "1594754384.0", "edited": "False", "id": "fy2f2mk", "is_submitter": "False", "link_id": "t3_hr72y2", "parent_id": "t3_hr72y2", "score": "3", "subreddit": "Tetris", "subreddit_id": "t5_2r133"}, {"author": "Cooliceage", "body": "Thanks for the response. I’m actually surprised it’s that low. I always thought you had to have a much higher rate but it’s good for me that it’s lower. Good luck on improving your Pb!", "created_utc": "1594594018.0", "edited": "False", "id": "fxvh38z", "is_submitter": "False", "link_id": "t3_hploin", "parent_id": "t1_fxv4kgt", "score": "3", "subreddit": "Tetris", "subreddit_id": "t5_2r133"}, {"author": "Cooliceage", "body": "How fast does your tapping have to be on average do be able to play on kill screen like this, because it is completely insane what you can do.", "created_utc": "1594566161.0", "edited": "False", "id": "fxu15wx", "is_submitter": "False", "link_id": "t3_hploin", "parent_id": "t3_hploin", "score": "2", "subreddit": "Tetris", "subreddit_id": "t5_2r133"}, {"author": "Cooliceage", "body": "It’s 100% tap.", "created_utc": "1594509643.0", "edited": "False", "id": "fxrs0nr", "is_submitter": "False", "link_id": "t3_hphoss", "parent_id": "t1_fxrr8ik", "score": "9", "subreddit": "Tetris", "subreddit_id": "t5_2r133"}, {"author": "Cooliceage", "body": "Thanks for the recommendation. I cleaned it out and it seems much better now! Thanks again!", "created_utc": "1594427307.0", "edited": "False", "id": "fxl62e6", "is_submitter": "True", "link_id": "t3_hotvt6", "parent_id": "t1_fxk1813", "score": "1", "subreddit": "nes", "subreddit_id": "t5_2r529"}, {"author": "Cooliceage", "body": "No need to make a video but it’s cool that you found a loophole. \n\nGood luck in the future. I’m sure a max is in your future if you want it!", "created_utc": "1594309060.0", "edited": "False", "id": "fxfjppf", "is_submitter": "False", "link_id": "t3_hnod5k", "parent_id": "t1_fxfgg73", "score": "2", "subreddit": "Tetris", "subreddit_id": "t5_2r133"}, {"author": "Cooliceage", "body": "Congrats man! That’s super impressive! It looks like you are playing on a lcd tv. How can you play with that delay at all? I tried 19 on my lcd and it was pretty much unplayable. On my crt it is much easier. I’m sure it took you forever to learn how to play like that.", "created_utc": "1594303917.0", "edited": "False", "id": "fxf9mqw", "is_submitter": "False", "link_id": "t3_hnod5k", "parent_id": "t3_hnod5k", "score": "2", "subreddit": "Tetris", "subreddit_id": "t5_2r133"}, {"author": "Cooliceage", "body": "I love every one of this monthly highlights. The interviews are especially interesting since hearing the perspective of the players isn’t something that you get during the online tournament.\n\n\nThis month’s tourney was kinda weird though. The seeding made so many of the insanely good players face each other and a lot of the relatively unknown players face one another. The difference between the brackets was pretty evident.\n\nAlso jake’s electricity cutting out was such a plot twist.", "created_utc": "1594235241.0", "edited": "False", "id": "fxccrx2", "is_submitter": "False", "link_id": "t3_hng35e", "parent_id": "t3_hng35e", "score": "2", "subreddit": "Tetris", "subreddit_id": "t5_2r133"}, {"author": "Cooliceage", "body": "Do you have any tips or recommendations for improving at level 19 speed especially at this height? Being able to play this high is a big skill.", "created_utc": "1594137286.0", "edited": "False", "id": "fx7rox9", "is_submitter": "False", "link_id": "t3_hmkxji", "parent_id": "t1_fx7lvnh", "score": "2", "subreddit": "Tetris", "subreddit_id": "t5_2r133"}, {"author": "Cooliceage", "body": "Wow that’s still really impressive! How long did it take you to beat 19-4?", "created_utc": "1594134239.0", "edited": "False", "id": "fx7lo7m", "is_submitter": "False", "link_id": "t3_hmkxji", "parent_id": "t3_hmkxji", "score": "3", "subreddit": "Tetris", "subreddit_id": "t5_2r133"}, {"author": "Cooliceage", "body": "Make sure to record your games so that if you get a max out you can be confirmed!\n\nGood luck!", "created_utc": "1594052765.0", "edited": "False", "id": "fx41svj", "is_submitter": "False", "link_id": "t3_hm1yxa", "parent_id": "t3_hm1yxa", "score": "2", "subreddit": "Tetris", "subreddit_id": "t5_2r133"}, {"author": "Cooliceage", "body": "Bravo man! With that great play and some good rng you deserve that Pb!", "created_utc": "1593879450.0", "edited": "False", "id": "fwwxl1s", "is_submitter": "False", "link_id": "t3_hl5msa", "parent_id": "t3_hl5msa", "score": "2", "subreddit": "Tetris", "subreddit_id": "t5_2r133"}, {"author": "Cooliceage", "body": "Tetris is just Tetris. There’s no objective good or bad scores. If you are happy with the score then it is good. If you do want a higher score I would recommend starting at a lower level for practice, but the goal in the end is to have fun. If you are having fun then start at any level an get any score!\n\nGood luck with the game and have fun!", "created_utc": "1593359605.0", "edited": "False", "id": "fw9wmrc", "is_submitter": "False", "link_id": "t3_hheboj", "parent_id": "t3_hheboj", "score": "3", "subreddit": "Tetris", "subreddit_id": "t5_2r133"}, {"author": "Cooliceage", "body": "Dude your progress is insane.  How did you get good at 19 so fast? That is honestly so impressive", "created_utc": "1593305487.0", "edited": "False", "id": "fw7z5xi", "is_submitter": "False", "link_id": "t3_hgxl2h", "parent_id": "t3_hgxl2h", "score": "1", "subreddit": "Tetris", "subreddit_id": "t5_2r133"}, {"author": "Cooliceage", "body": "Tetris is a battle against yourself, not others. If you are happy with the scores then they are good! \nGood luck on your Tetris journey!", "created_utc": "1592951525.0", "edited": "False", "id": "fvsifkp", "is_submitter": "False", "link_id": "t3_hemv6g", "parent_id": "t3_hemv6g", "score": "7", "subreddit": "Tetris", "subreddit_id": "t5_2r133"}, {"author": "Cooliceage", "body": "Very impressive score!\n\nI love your family telling others to be quiet at the end.", "created_utc": "1592951438.0", "edited": "False", "id": "fvsi9lb", "is_submitter": "False", "link_id": "t3_hek545", "parent_id": "t3_hek545", "score": "2", "subreddit": "Tetris", "subreddit_id": "t5_2r133"}, {"author": "Cooliceage", "body": "NTSC nes and Tetris cartridge are the ctwc versions of the game.\nYou can buy them on eBay if you want lower prices, but if you want guaranteed quality then other retro websites are best.", "created_utc": "1592868057.0", "edited": "False", "id": "fvosb40", "is_submitter": "False", "link_id": "t3_he0pzf", "parent_id": "t3_he0pzf", "score": "1", "subreddit": "Tetris", "subreddit_id": "t5_2r133"}, {"author": "Cooliceage", "body": "What I recommend is at first trying to consistently survive on 18 speed and over time progress to trying to score tetrises. At first you won’t get that many points, but an extra 20~k for 30 lines still increases your score in general. Once you can get used to the speed aiming for Tetris will really increase your max score. I believe in you!", "created_utc": "1592498156.0", "edited": "False", "id": "fv8wbey", "is_submitter": "False", "link_id": "t3_hb2s2p", "parent_id": "t1_fv8v35t", "score": "1", "subreddit": "Tetris", "subreddit_id": "t5_2r133"}, {"author": "Cooliceage", "body": "Very well done! 400k is in reach! How long have you been playing to reach such a good score?", "created_utc": "1592496801.0", "edited": "False", "id": "fv8tjxu", "is_submitter": "False", "link_id": "t3_hb6rv9", "parent_id": "t3_hb6rv9", "score": "2", "subreddit": "Tetris", "subreddit_id": "t5_2r133"}, {"author": "Cooliceage", "body": "Bravo! Keep on going and I’m sure you’ll get to 400k real soon! How’s your level 18 speed game at right now?", "created_utc": "1592496669.0", "edited": "False", "id": "fv8ta6r", "is_submitter": "False", "link_id": "t3_hb2s2p", "parent_id": "t3_hb2s2p", "score": "2", "subreddit": "Tetris", "subreddit_id": "t5_2r133"}, {"author": "Cooliceage", "body": "Thank you very much!", "created_utc": "1565248199.0", "edited": "False", "id": "ewaoiwr", "is_submitter": "True", "link_id": "t3_cnb0q7", "parent_id": "t1_ew8z4zx", "score": "1", "subreddit": "AskHistorians", "subreddit_id": "t5_2ssp3"}, {"author": "Cooliceage", "body": "Thank you very much!", "created_utc": "1565248172.0", "edited": "False", "id": "ewaoha6", "is_submitter": "True", "link_id": "t3_cnb0q7", "parent_id": "t1_ew8z4zx", "score": "1", "subreddit": "AskHistorians", "subreddit_id": "t5_2ssp3"}, {"author": "Cooliceage", "body": "Not asking has a 100% failure rate. Asking has more of a chance. Also confirmation is better than false hope, and confirmation is definitely good if they like you back.", "created_utc": "1561127709.0", "edited": "False", "id": "erptmbn", "is_submitter": "False", "link_id": "t3_c37djl", "parent_id": "t1_erpnaqy", "score": "5", "subreddit": "teenagers", "subreddit_id": "t5_2rjli"}, {"author": "Cooliceage", "body": "Just an interesting fact is that the French word for fatherland(patrie) is feminine. Language is complicated and a lot of the time arbitrary.", "created_utc": "1561040576.0", "edited": "False", "id": "ermyrr7", "is_submitter": "False", "link_id": "t3_c2tr34", "parent_id": "t1_ermyk58", "score": "11", "subreddit": "AskHistorians", "subreddit_id": "t5_2ssp3"}, {"author": "Cooliceage", "body": "Btw what I reccomend is getting a specific book. So Assimil recently released new books for some of their languages, so make sure to get the newer ones. https://www.assimil.com/recherche?original_lang=38&lesson_lang=44&level_lang=&controller=search&orderby=price&orderway=desc\nHere is a link to their website that has all the up to date ones. I recommend making sure that the one you buy looks like the newer edition. Also make sure to buy the cds, or the mp3, whichever one is more convenient. I bought this book for French and it was very very good.", "created_utc": "1559666905.0", "edited": "False", "id": "epzjirh", "is_submitter": "False", "link_id": "t3_bwe2aa", "parent_id": "t1_epyhy0l", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Cooliceage", "body": "I used Assimil's \"With Ease\" book. It is really good if you are trying to focus on speaking and listening, but I wouldn't recommend it if you had to explain grammar rules on a test or anything. Its principle idea is that through lots of input, with gradually increasing difficulty one can learn the grammar intuitively.", "created_utc": "1559582021.0", "edited": "False", "id": "epwq57m", "is_submitter": "False", "link_id": "t3_bw8o9r", "parent_id": "t3_bw8o9r", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Cooliceage", "body": "Imagine that you want to say that you will do something in the future.  You decide to learn how to just say something. How do you learn that. By learning how the rules of the future tense. Then you will be able to say stuff.", "created_utc": "1559306666.0", "edited": "False", "id": "epm1242", "is_submitter": "False", "link_id": "t3_butf1g", "parent_id": "t1_epj0jyp", "score": "6", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Cooliceage", "body": "I may be wrong, but how is it irregular? It think that the endings are the same but oilman is used differently then other verbs.", "created_utc": "1559258273.0", "edited": "False", "id": "epjr07a", "is_submitter": "False", "link_id": "t3_butf1g", "parent_id": "t1_epjq4q4", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Cooliceage", "body": "I am a Turkish native speaker, but I want to know why you think everything \"Makes sense.\" Do you mean it is consistent, or that it is logical?", "created_utc": "1559239075.0", "edited": "False", "id": "epigy8d", "is_submitter": "False", "link_id": "t3_butf1g", "parent_id": "t1_ephp8tg", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Cooliceage", "body": "Btw that irregular verb is not that common. It is to get thirsty, and the reason it is irregular is because the base word is water. So \"su\" is the word for water, and \"susumak\" is the word for to be thirsty. The conjugation is still pretty regular.", "created_utc": "1559238976.0", "edited": "False", "id": "epigppa", "is_submitter": "False", "link_id": "t3_butf1g", "parent_id": "t1_ephczph", "score": "12", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Cooliceage", "body": "Didn’t the Fine Bros have that happen to them a few years ago?", "created_utc": "1557593007.0", "edited": "False", "id": "en4q1yr", "is_submitter": "False", "link_id": "t3_bncvsy", "parent_id": "t3_bncvsy", "score": "267", "subreddit": "PewdiepieSubmissions", "subreddit_id": "t5_3m0tc"}, {"author": "Cooliceage", "body": "Duolingo doesn’t even have Icelandic. Why is Duolingo the recommendation for anything related to languages.", "created_utc": "1556650904.0", "edited": "False", "id": "em5seo2", "is_submitter": "False", "link_id": "t3_bj1oyv", "parent_id": "t1_em57v76", "score": "1", "subreddit": "IWantToLearn", "subreddit_id": "t5_2rjo5"}, {"author": "Cooliceage", "body": "Also if you have any questions please ask!", "created_utc": "1556589943.0", "edited": "False", "id": "em3wugu", "is_submitter": "False", "link_id": "t3_biwqdj", "parent_id": "t1_em3wtal", "score": "1", "subreddit": "IWantToLearn", "subreddit_id": "t5_2rjo5"}, {"author": "Cooliceage", "body": "I agree that Duolingo can be good nut never use it for Korean. For languages not closely related to English it isn't effective. The reason for this is grammar. Languages like Spanish, Norwegian, and Esperanto all have similarish grammars to English nut Korean is very different compared to English, and Duolingo tries to teach grammar simply through enough examples, with little explanation. [Here is a video explaining how complicated Korean can be](https://youtu.be/cJPQEVnr0fg) \nAnother problem is that generally these languages have poorly designed trees and don' teach that well. Lots of mistakes in translation. \nHere are a few recommendations instead.\nSo Korean uses Hangul, a phonetic alphabet that is not too difficult to learn. You should learn this 100%. [Here is a website you could do this on, but honestly you could do this anywhere.](http://www.koreanwikiproject.com/wiki/Learn_hangeul) I like this website because it also gives real words that you can say with the characters you have learned so far.\nAfter this you simply have to learn a lot of grammar and a lot of vocabulary. I have no idea what your goals are or how much time your are willing to put into this task so I will give some options.\nMost people r commend a book for language learning. I have not researched this in depth but I have heard good things for the book \"Talk to me in Korean.\" I have also heard some relatively good things about the Assimil course for Korean. Its a more audio based course and its a little pricy, but I used the books for French and I am now at a high level. They are a little pricey.\nIf you prefer casually working on Korean and don't really care for the huge time investment learning the language is you could use an app. I like the app Lingodeer. It also has a course on Hangul. The earlier lessons are free, so you can see what you like, but I recommend getting the subscription and doing all the lessons. Its a good introduction to the language, and it is pretty simple and fun.\nThere are other routes. I have seen multiple people simply spend many many hours learning mostly vocabulary, using books or podcasts. They would take a book, try to read, find every word they didn't know, make flashcards and then memorize, This route is very time consuming, but in a way it is the most effective path since in any language you need vocabulary.\nAlso I don't know your goals but if you are learning for family or friends it might be good to find a person that you can speak to in Korean or ask questions to.\nAlso if you are learning for things like K-pop or for the sake of it I will remind you that Korean is very difficult. It is considered one of the hardest languages for English speakers, and when the U.S government trains diplomats it takes roughly 2000 hours for the diplomats to learn Korean, as compared to 500 for French, and 350-400 for Spanish. So good luck.\n\n[Here is an example of extensive vocab and using Assimil for Korean. This guy speaks 10 languages so he is well trusted. he set himself a challenge to learn as much as possible in 90 days and he spent like 3 hours per day.](https://www.youtube.com/playlist?list=PLiFB-yYuG2himozgz6ljjbTKKc7UJ2few)", "created_utc": "1556589920.0", "edited": "False", "id": "em3wtal", "is_submitter": "False", "link_id": "t3_biwqdj", "parent_id": "t1_em3nog6", "score": "4", "subreddit": "IWantToLearn", "subreddit_id": "t5_2rjo5"}, {"author": "Cooliceage", "body": "I am sorry if this is late, and I am sorry if this is a useless reply but that is explained in the exact same sene you are referencing. The scene where Hermione is explaining that you can't make food emphasis you can't make it out of nothing. She says you can transform other objects into food.", "created_utc": "1552105918.0", "edited": "False", "id": "ei4cu0s", "is_submitter": "False", "link_id": "t3_ay8608", "parent_id": "t1_ei207z6", "score": "1", "subreddit": "teenagers", "subreddit_id": "t5_2rjli"}, {"author": "Cooliceage", "body": "Legend of Zelda Breath of the Wild", "created_utc": "1550938925.0", "edited": "False", "id": "eh3yl0l", "is_submitter": "False", "link_id": "t3_atqaqz", "parent_id": "t3_atqaqz", "score": "1", "subreddit": "HomeworkHelp", "subreddit_id": "t5_2r6f3"}, {"author": "Cooliceage", "body": "I am pretty sure that Esperantists stress that they want Esperanto to be everyone’s second language, not first. They don’t want to replace any languages.", "created_utc": "1549680533.0", "edited": "False", "id": "eg2ck6f", "is_submitter": "False", "link_id": "t3_aok49y", "parent_id": "t1_eg1mb5s", "score": "10", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Cooliceage", "body": "During those 10 years what have you studied? Have you studied conversational skills or has your classes focused more on other things. You need to personally recognize what is preventing you from talking to others well and then you need to try and improve. A good way to check would be to find a Spanish speaker and try to speak to them for a while. Ask them what you are doing wrong, and force them to answer honestly. Like brutally honest. Also while talking realize what is difficult for you. Do you not know enough word to express yourself? Do you not have a strong enough grasp on verb tenses or sentence structure? Something else? Also if you do not understand others talking to you all you can do is try getting lots of audio input. Try finding easy sources at the start, and use subtitles in Spanish, but once you start to understand completely try harder and harder things. Overall I think that the thing that will help you the most will be recognizing your flaws, and overcoming them. Good luck! ", "created_utc": "1549680330.0", "edited": "False", "id": "eg2cbu8", "is_submitter": "False", "link_id": "t3_aony9h", "parent_id": "t3_aony9h", "score": "6", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Cooliceage", "body": "I just wanted to mention it. I did not think that in that sentence \"people\" meant \"people group.\" I apologize if I was unclear.", "created_utc": "1547816122.0", "edited": "False", "id": "eecmsqu", "is_submitter": "False", "link_id": "t3_ah6rre", "parent_id": "t1_eecmosw", "score": "10", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Cooliceage", "body": "There are actually a few hundred people who natively speak Esperanto.", "created_utc": "1547815762.0", "edited": "False", "id": "eecmdtz", "is_submitter": "False", "link_id": "t3_ah6rre", "parent_id": "t1_eecleo6", "score": "4", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Cooliceage", "body": "It’s kinda more than just that. I would say it can go as far as like Dutch to English especially because pronunciation plays such an important part in all Chinese languages, and that is the thing that changes the most", "created_utc": "1547260158.0", "edited": "False", "id": "edv0tv9", "is_submitter": "False", "link_id": "t3_aey6xe", "parent_id": "t1_eduqchg", "score": "10", "subreddit": "tumblr", "subreddit_id": "t5_2r7hk"}, {"author": "Cooliceage", "body": "Hangul is just the writing system for Korean. It is not a language in its own. Also the whether Chinese, Japanese, or Korean is the hardest is very highly based on personal preference. If  pronunciation is extremely difficult to you then any dialect of Chinese could be considered the hardest. If writing, and grammar is very hard for you then Japanese could be the hardest. Also the grammar of Korean is very foreign to English as well, and also has some sounds that are hard to distinguish for non native speakers.", "created_utc": "1546722517.0", "edited": "False", "id": "edbtvnh", "is_submitter": "False", "link_id": "t3_acwdgd", "parent_id": "t1_edbsu7x", "score": "8", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Cooliceage", "body": "lingua latina per se illustrata is a book for learning latin that is entirely in latin. The only english is the summary on the back. I have been reading it casually and I already have learned a ton.", "created_utc": "1546367079.0", "edited": "False", "id": "ed0w5qq", "is_submitter": "False", "link_id": "t3_abiyha", "parent_id": "t1_ed0rju4", "score": "42", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Cooliceage", "body": "I will be honest your manner of speaking and accent is really good. I cannot tell at all what your native language is, but whatever it is you speal very well. The thing you are really good at are the mannerism of speach. I know a lot of speakers of english who dont speak with a strong accent, but they sound really odd. You sound normal, as if I was talking to a real person, not a robot.I wish you luck with learning german, and maybe one day more people will come through your town, and you will have the chance to speak with them.", "created_utc": "1543445908.0", "edited": "False", "id": "eaobeuk", "is_submitter": "False", "link_id": "t3_a13j4r", "parent_id": "t1_eanexnv", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Cooliceage", "body": "I am sorry because I agree with you. I was a bit lazy ans stupid. I did find the stuff I was looking for afterwards by doing as you recommended but I forgot to delete this post. I will make sure to not make this mistake again. ", "created_utc": "1543108413.0", "edited": "False", "id": "eaefcfx", "is_submitter": "False", "link_id": "t3_9zr338", "parent_id": "t1_eac688z", "score": "1", "subreddit": "ChineseLanguage", "subreddit_id": "t5_2qyz1"}, {"author": "Cooliceage", "body": "To get Italy into the war at all a secret pact was signed between the Entente and the Italian government in 1915. it is called the Treaty of London. This treaty entailed much more land than what was given to Italy by the Treaty of Versaille. Most of the coast of Yugoslavia was to be controlled by the Italians, and they would have control of Albania's foreign affairs. During the conferences,the Italians demanded many times for these pieces of land, and because it was denied over, and over it was one of the reasons that the Italian government fell many times, and this disagreement led Italy to not be included in a lot of discussions regarding the Treaty of Versaille.", "created_utc": "1541974656.0", "edited": "False", "id": "e9iigr5", "is_submitter": "False", "link_id": "t3_9w2ywz", "parent_id": "t1_e9hb8c3", "score": "15", "subreddit": "AskHistorians", "subreddit_id": "t5_2ssp3"}, {"author": "Cooliceage", "body": "Turkish suffixes do really suck, but I believe that once you get them down, conversations become a lot better. I wish you the best of luck ve kolay gelsin.", "created_utc": "1541511848.0", "edited": "False", "id": "e95orbo", "is_submitter": "False", "link_id": "t3_9ujpcv", "parent_id": "t3_9ujpcv", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Cooliceage", "body": "It is Japanese.", "created_utc": "1540240167.0", "edited": "False", "id": "e899cnf", "is_submitter": "False", "link_id": "t3_9qgxt5", "parent_id": "t1_e898qke", "score": "4", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Cooliceage", "body": "I put everything in terms of two but I don't know how to get rid of the -7. I am sorry if this is inconvenient but I would love a description on how to this.", "created_utc": "1538088768.0", "edited": "False", "id": "e6ri3vc", "is_submitter": "True", "link_id": "t3_9jh7we", "parent_id": "t1_e6rg0zs", "score": "1", "subreddit": "cheatatmathhomework", "subreddit_id": "t5_2rbfw"}, {"author": "Cooliceage", "body": "Don't use google translate. DeepL is much better for the languages it has.\nhttps://www.deepl.com/translator", "created_utc": "1537908981.0", "edited": "False", "id": "e6mt59x", "is_submitter": "False", "link_id": "t3_9iu47e", "parent_id": "t3_9iu47e", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "Cooliceage", "body": "The concept is not to hard to grasp, just the way it is implemented into speech. The grammar is very hard for most people. I do not live in Turkey but I know many people who do. When they try to learn English generally the hardest parts for them is the articles (which do not exist in Turkish), and the word order. Turkish is agglutinative so a ton of information is held at the end of words, including, tense possession, and object of the verb. So when they try to learn English and realize that a lot of these concepts use separate words it comes of as very different and hard. To be is generally one of the first things taught in school and so is generally learned early, but just the change from everything being tacked onto the end of words, to having separate words for all of those concepts makes it hard to learn English for many Turks. Sorry if this is long and gave more information than you asked.", "created_utc": "1536079951.0", "edited": "False", "id": "e5dutw7", "is_submitter": "False", "link_id": "t3_9cgtc9", "parent_id": "t1_e5do31i", "score": "2", "subreddit": "linguistics", "subreddit_id": "t5_2qhos"}, {"author": "Cooliceage", "body": "I am sorry I am late but I think I have a good example. In Turkish gelmek has the same meaning as to come but it also has other meaning. A common Turkish saying is kolay gelsin. This is hard to translate but the best description I have is \"let (the work) come to you as easy.\" Gelmek's second meaning is coming off as (adjective). This can be turned into a question aswell. Iyi geldi mi means did it come/appear to as being good. This is is not really a thing in english and is I hope kinda gives an example of something very different then english. Also Turkish does not have a good translation of \"to be.\" There is olmak which means to exist but to indict being one adds an ending to words. So \"I am good\" is \"Iyiyim\" Iyi=good yim=myself/me. This applies to a lot of things which allows Turkish to drop pronouns, which is again very different then english. Sorry if this does not answer your questions directly but I hope it kinda gave you some examples.", "created_utc": "1536072104.0", "edited": "False", "id": "e5dlzxc", "is_submitter": "False", "link_id": "t3_9cgtc9", "parent_id": "t3_9cgtc9", "score": "2", "subreddit": "linguistics", "subreddit_id": "t5_2qhos"}, {"author": "Cooliceage", "body": "You are positive for HIV. Congrats!", "created_utc": "1533467135.0", "edited": "False", "id": "e3n3mxd", "is_submitter": "False", "link_id": "t3_94m3bt", "parent_id": "t3_94m3bt", "score": "1", "subreddit": "ShadowBanned", "subreddit_id": "t5_2ql6u"}, {"author": "Cooliceage", "body": "Srs stands for spaced repetition software and is a form of flashcards that helps with long term memorization. I recommend googling it if you want to know more, but I can try to explain it. So the software will give you cards and you will try to remember it. Then if you knew the answer then it will give you the same card later and later. I may start out with a ten minute delay. Then if I remember it I will see the card the next day. Then if I still remember in 5 days, then 2 weeks and so on. This helps you remember better. I use the software Anki, but there are others like memrise. But anyway good luck!", "created_utc": "1532506987.0", "edited": "False", "id": "e2zvafu", "is_submitter": "False", "link_id": "t3_91pa8l", "parent_id": "t1_e2zsy7g", "score": "5", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Cooliceage", "body": "I laugh and then I feel depressed.", "created_utc": "1532119271.0", "edited": "False", "id": "e2qvipk", "is_submitter": "False", "link_id": "t3_90hn2t", "parent_id": "t3_90hn2t", "score": "15", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Cooliceage", "body": "Persian and Farsi is the same language. Just different names.", "created_utc": "1532099560.0", "edited": "False", "id": "e2q7zea", "is_submitter": "False", "link_id": "t3_906bdv", "parent_id": "t1_e2pt9i6", "score": "7", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Cooliceage", "body": "I guess word order, and how many morphemes are in word determines the structure the most. So wikipedia should have some of that stuff. Anyway good luck and I do not meaning offense but please check your spelling a bit. Have a great day!", "created_utc": "1531298787.0", "edited": "False", "id": "e26j49k", "is_submitter": "False", "link_id": "t3_8xwie6", "parent_id": "t1_e26izjb", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Cooliceage", "body": "Depending on how different you want to go all of these can be different:\nWord order\nVocabulary (from small amounts to the majority of the language)\nArticles/No articles\nMarkers for a lot of things\nHonorifics\nPhonemes\nType of language (agglutination/synthetic)\nIdioms/phrases\nWriting\nNumber of tenses\nNumber of moods\nForms of verb conjugation\nGrouping words together\nNeed for pronouns\nTones\nDialectal variation\nConcepts\nAnd loads of other things which I did not cover.\n\nSo here are some examples.\n\nEnglish: I love you\nTurkish: ben seni çok seviyorum/ seni çok seviyorum\nFrench: je t'aime\n\nAnd here are those translated literally. \nCommas are separations between words, a dash is a separation within a word.\n\nTurkish: I, to you, a lot, love-progressive-me/ to you, a lot, love-progressive-me\nFrench: I, to you, love\n\nTurkish is not related to english in any way linguistically, as you can see from the grammar vocabulary and the way it has a lot of information in one word put on the end of root words. Thats why when I translate it it is not very similar and needs more explanation.\n\nFrench is pretty close to english in a lot of vocabulary and the grammar is not to far. This is because both languages are in the indo-european family of language. Also I kinda cheated because while French and English are not in the same subfamily of indo-european, English has lots of influence from French.\n\nAlso the romance languages are all based on latin, the language of the roman empire, but took in aspects of the local language and changed over time.", "created_utc": "1531286317.0", "edited": "False", "id": "e26ccqs", "is_submitter": "False", "link_id": "t3_8xwie6", "parent_id": "t3_8xwie6", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Cooliceage", "body": "Give ban!", "created_utc": "1531079120.0", "edited": "False", "id": "e20nopl", "is_submitter": "False", "link_id": "t3_8vxsbn", "parent_id": "t3_8vxsbn", "score": "1", "subreddit": "thanosdidnothingwrong", "subreddit_id": "t5_gxikd"}, {"author": "Cooliceage", "body": "Just for the ban. Pls ignore.", "created_utc": "1531078225.0", "edited": "False", "id": "e20mrlg", "is_submitter": "False", "link_id": "t3_8x2pyo", "parent_id": "t3_8x2pyo", "score": "1", "subreddit": "thanosdidnothingwrong", "subreddit_id": "t5_gxikd"}, {"author": "Cooliceage", "body": "The mentality of trying to be a hyperpolyglot is not a good one. Focus more on one language at a time rather then many, and divide that one language into many smaller goals. If your goal is 10 languages then you wont be reaching goals that you set for yourself quick enough and therefore you will lose motivation.", "created_utc": "1528643655.0", "edited": "False", "id": "e0fnww3", "is_submitter": "False", "link_id": "t3_8q172u", "parent_id": "t3_8q172u", "score": "17", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Cooliceage", "body": "The invite link has expired. I would love to join so if there is a new code that would be great! Btw this is a great idea!", "created_utc": "1527793552.0", "edited": "False", "id": "dzwa008", "is_submitter": "False", "link_id": "t3_8nhp03", "parent_id": "t3_8nhp03", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Cooliceage", "body": "R5 was playing on akinator and decided to see if the true leader of America was there. He was.", "created_utc": "1526851705.0", "edited": "False", "id": "dzaut3y", "is_submitter": "True", "link_id": "t3_8kvp6k", "parent_id": "t3_8kvp6k", "score": "7", "subreddit": "Kaiserreich", "subreddit_id": "t5_2wgr5"}, {"author": "Cooliceage", "body": "I mean maybe. If you majority of the grammar beforehand then the thing that is most important after is the number of words you know. If you play games or whatever and learn the meanings of new words when you don't know them that is great. Thats why it is always recommended to have lots of input when learning, so that you can learn new words, and see how the ones you know interact.", "created_utc": "1526746289.0", "edited": "False", "id": "dz8pj6m", "is_submitter": "False", "link_id": "t3_8klxwx", "parent_id": "t3_8klxwx", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Cooliceage", "body": "You must decide, but remember a few things. First these are hard language, like fsi says 2k+ hours of learning, so these are long term goals. Second Arabic has a lot of dialects which are not super distinct but are still sizably different. Also in Arabic there is the standard Arabic which is used in writing and some, some formal things, and breaching dialectal barriers. Therefore learning Arabic is kinds like learning two languages, and you have to choose your favorite dialect (Egyptian seems to be the biggest). Japanese on the other hand is difficult to learn because it has many attributes uncommon to large western languages. These include, agglutination, which is found in Turkish, Finnish and nothing else really, politeness/social standing, which is kinda done in French but this is a lot more, and the word order is different. Second the writing system is very very hard to learn. I wont go into detail but because it is a mixture of two phonetic alphabets and Chinese characters it is really difficult. Honestly choose what interests you more, because these languages are not easy and you are going to need the motivation to learn them. Anyway good luck!", "created_utc": "1526615384.0", "edited": "False", "id": "dz63jcx", "is_submitter": "False", "link_id": "t3_8k7ijj", "parent_id": "t3_8k7ijj", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Cooliceage", "body": "I mean if you really want to do Japanese there is two options. Memorize the alphabets and as much kanji as possible, and later on you can learn the grammar or you can learn the basics of the language. Also if you want you could most likely learn another language quite a lot in that time if you have no time restrictions. You could probably get truly fluent in Esperanto or learn a lot in another romance language. Anyway have fun!", "created_utc": "1526522711.0", "edited": "False", "id": "dz3xk43", "is_submitter": "False", "link_id": "t3_8jy7b9", "parent_id": "t3_8jy7b9", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Cooliceage", "body": "Dankon!", "created_utc": "1525068422.0", "edited": "False", "id": "dy77z0n", "is_submitter": "False", "link_id": "t3_8fuhke", "parent_id": "t1_dy77xrt", "score": "2", "subreddit": "thatHappened", "subreddit_id": "t5_2vmb7"}, {"author": "Cooliceage", "body": "Ne, mi ne parolas blue. Kia lingvo estas blua?", "created_utc": "1525068034.0", "edited": "False", "id": "dy77rp7", "is_submitter": "False", "link_id": "t3_8fuhke", "parent_id": "t1_dy77prh", "score": "2", "subreddit": "thatHappened", "subreddit_id": "t5_2vmb7"}, {"author": "Cooliceage", "body": "I know many Bilingual people, I am bilingual, but I mean multilingual. I live in New England.", "created_utc": "1525058832.0", "edited": "False", "id": "dy71wqy", "is_submitter": "False", "link_id": "t3_8fuhke", "parent_id": "t1_dy71vl1", "score": "1", "subreddit": "thatHappened", "subreddit_id": "t5_2vmb7"}, {"author": "Cooliceage", "body": "I apologize for my mistake. I live in the us on the east coast where bilingualism is honestly very low, so I only guessed based on my experiences. I have many bilingual friends, but I do not know anyone that learned 3 languages at a very young age. ", "created_utc": "1525056903.0", "edited": "False", "id": "dy70cfp", "is_submitter": "False", "link_id": "t3_8fuhke", "parent_id": "t1_dy6ygxn", "score": "3", "subreddit": "thatHappened", "subreddit_id": "t5_2vmb7"}, {"author": "Cooliceage", "body": "I see I am very wrong in my assessment. I am assuming you live in Europe where, compared to the us, bilingualism is much more common. I have personally never met someone that learned 3 languages naturally without any education, but I 100% believe it could be. Anyway have fun teaching!", "created_utc": "1525056683.0", "edited": "False", "id": "dy705s6", "is_submitter": "False", "link_id": "t3_8fuhke", "parent_id": "t1_dy701x7", "score": "2", "subreddit": "thatHappened", "subreddit_id": "t5_2vmb7"}, {"author": "Cooliceage", "body": "I agree I sound like an asshole, sorry. ", "created_utc": "1525055051.0", "edited": "False", "id": "dy6yt5c", "is_submitter": "False", "link_id": "t3_8fuhke", "parent_id": "t1_dy6yfga", "score": "3", "subreddit": "thatHappened", "subreddit_id": "t5_2vmb7"}, {"author": "Cooliceage", "body": "I don't think it impossible just unlikely. Congratulations on trying to teach your child those languages and good luck.  I have no idea if my parents taught improperly or not or if simply I wasn't very good at language learning when I was young.", "created_utc": "1525054294.0", "edited": "False", "id": "dy6y644", "is_submitter": "False", "link_id": "t3_8fuhke", "parent_id": "t1_dy6xu9z", "score": "-2", "subreddit": "thatHappened", "subreddit_id": "t5_2vmb7"}, {"author": "Cooliceage", "body": "I don't mean impossible, just highly unlikely, especially in the us where bilingualism is lower than other places. The only person kid I know of that is multilingual naturally is a friend of mine who speaks english fluently and can only understand Italian and Hebrew, can't speak either. Also how did that person grow up with 7 languages around them?", "created_utc": "1525053201.0", "edited": "False", "id": "dy6x9dd", "is_submitter": "False", "link_id": "t3_8fuhke", "parent_id": "t1_dy6x1qx", "score": "-7", "subreddit": "thatHappened", "subreddit_id": "t5_2vmb7"}, {"author": "Cooliceage", "body": "Good luck! Just with my experience I have never found a multilingual child because the person may know how to listen to three languages but they can not speak all of them. Also there is language decay, but I hope your story is true and good luck again!\nEdit: I apologize. I have lived on the east coast in New England where my personal experience showed me this. I see I am very wrong and I am happy that I was shown this. Thank you anyway and have a great day!", "created_utc": "1525050375.0", "edited": "1525066635.0", "id": "dy6uwac", "is_submitter": "False", "link_id": "t3_8fuhke", "parent_id": "t1_dy6uqz3", "score": "-7", "subreddit": "thatHappened", "subreddit_id": "t5_2vmb7"}, {"author": "Cooliceage", "body": "I mean I learned 2 languages when I was very young. My parents tried to teach me 3 at once, gave up, then I started speaking. Afterward, my mom tried again and taught me Turkish. It may be possible to learn a 3rd but most likely not.", "created_utc": "1525048973.0", "edited": "False", "id": "dy6tq8a", "is_submitter": "False", "link_id": "t3_8fuhke", "parent_id": "t1_dy6t6wr", "score": "-6", "subreddit": "thatHappened", "subreddit_id": "t5_2vmb7"}, {"author": "Cooliceage", "body": "*claps in Spanish*", "created_utc": "1525048121.0", "edited": "False", "id": "dy6t1g3", "is_submitter": "False", "link_id": "t3_8fuhke", "parent_id": "t1_dy6svh8", "score": "73", "subreddit": "thatHappened", "subreddit_id": "t5_2vmb7"}, {"author": "Cooliceage", "body": "vi parolas Esperanto? Mi ankaŭ! Ĝi estas tre bona lingvo!", "created_utc": "1525048083.0", "edited": "False", "id": "dy6t0cv", "is_submitter": "False", "link_id": "t3_8fuhke", "parent_id": "t1_dy6supe", "score": "301", "subreddit": "thatHappened", "subreddit_id": "t5_2vmb7"}, {"author": "Cooliceage", "body": "My parents tried to that. They stopped after I couldn't say anything in any languages for longer then the average. I started speaking really quickly after. It is possible but really unlikely because while I can see 2, (I am bilingual from a young age) I can only see 3 in the rarest of occurances, and who the hell are you going to learn a 4th from?", "created_utc": "1525047928.0", "edited": "False", "id": "dy6svtm", "is_submitter": "False", "link_id": "t3_8fuhke", "parent_id": "t1_dy6r1tw", "score": "0", "subreddit": "thatHappened", "subreddit_id": "t5_2vmb7"}, {"author": "Cooliceage", "body": "Knowing 3 languages and learning a 4th when your 5 is bs. When I was a baby my parents wanted me to be bilingual so they would speak with me in 3 languages. My dad knew French, my mom knew Turkish, and they both knew English. They did this for a while until they realized that I had not spoken a single word yet, when people my age were speaking sentences. They quit and only used English for a while. My mom says two weeks later I started talking. I did later learn Turkish but how the hell can you learn 3 god damn languages when you are 5? ", "created_utc": "1525047640.0", "edited": "False", "id": "dy6snmj", "is_submitter": "False", "link_id": "t3_8fuhke", "parent_id": "t3_8fuhke", "score": "-6", "subreddit": "thatHappened", "subreddit_id": "t5_2vmb7"}, {"author": "Cooliceage", "body": "And there also some in the german tree.", "created_utc": "1524152110.0", "edited": "False", "id": "dxmok0o", "is_submitter": "False", "link_id": "t3_8deurr", "parent_id": "t1_dxmmsi8", "score": "5", "subreddit": "hoi4", "subreddit_id": "t5_2zvvb"}, {"author": "Cooliceage", "body": "I am sorry I simply phrased the question wrong. A better way to phrase it would have been \"many states formed after the treaty of Brest-Litovsk and the Russian Revolution. Some of those like Finland and the baltic states lasted for a while but there were also many smaller states. How did those places work and did they have any real authority?\"", "created_utc": "1524150026.0", "edited": "False", "id": "dxmm9n9", "is_submitter": "True", "link_id": "t3_8da0dl", "parent_id": "t1_dxm3f4g", "score": "1", "subreddit": "AskHistorians", "subreddit_id": "t5_2ssp3"}, {"author": "Cooliceage", "body": "Thank you very much! This was helpful", "created_utc": "1524149831.0", "edited": "False", "id": "dxmm226", "is_submitter": "True", "link_id": "t3_8da0dl", "parent_id": "t1_dxm31dc", "score": "2", "subreddit": "AskHistorians", "subreddit_id": "t5_2ssp3"}, {"author": "Cooliceage", "body": "Finland did last but Ukraine was annexed shortly after into the Soviet Union. I am not mentioning if the country exists today, but the short lasting governments.", "created_utc": "1524105781.0", "edited": "False", "id": "dxlt99c", "is_submitter": "True", "link_id": "t3_8da0dl", "parent_id": "t1_dxlt5wy", "score": "3", "subreddit": "AskHistorians", "subreddit_id": "t5_2ssp3"}, {"author": "Cooliceage", "body": "Absolutely no problem. ", "created_utc": "1524016563.0", "edited": "False", "id": "dxjndl1", "is_submitter": "False", "link_id": "t3_8b7rp0", "parent_id": "t1_dxj76rx", "score": "1", "subreddit": "ShadowBanned", "subreddit_id": "t5_2ql6u"}, {"author": "Cooliceage", "body": "Hello, how are you doing? I am sorry for the delay!", "created_utc": "1523996256.0", "edited": "False", "id": "dxj2dh4", "is_submitter": "False", "link_id": "t3_89g0nu", "parent_id": "t3_89g0nu", "score": "1", "subreddit": "ShadowBanned", "subreddit_id": "t5_2ql6u"}, {"author": "Cooliceage", "body": "No we can luckily see you!", "created_utc": "1523996172.0", "edited": "False", "id": "dxj2a09", "is_submitter": "False", "link_id": "t3_8b7o8b", "parent_id": "t3_8b7o8b", "score": "2", "subreddit": "ShadowBanned", "subreddit_id": "t5_2ql6u"}, {"author": "Cooliceage", "body": "How may I come of assistance my good man or woman?", "created_utc": "1523996151.0", "edited": "False", "id": "dxj293h", "is_submitter": "False", "link_id": "t3_8b7rp0", "parent_id": "t3_8b7rp0", "score": "2", "subreddit": "ShadowBanned", "subreddit_id": "t5_2ql6u"}, {"author": "Cooliceage", "body": "Well done stormtrooper! 100% on the math test! ", "created_utc": "1523996127.0", "edited": "False", "id": "dxj281z", "is_submitter": "False", "link_id": "t3_8b7tkj", "parent_id": "t3_8b7tkj", "score": "1", "subreddit": "ShadowBanned", "subreddit_id": "t5_2ql6u"}, {"author": "Cooliceage", "body": "Test positive, sorry for the delay captain.", "created_utc": "1523996089.0", "edited": "False", "id": "dxj26hw", "is_submitter": "False", "link_id": "t3_8b7uqq", "parent_id": "t3_8b7uqq", "score": "1", "subreddit": "ShadowBanned", "subreddit_id": "t5_2ql6u"}, {"author": "Cooliceage", "body": "Don't be angry, and have a great day!", "created_utc": "1523996069.0", "edited": "False", "id": "dxj25ot", "is_submitter": "False", "link_id": "t3_8b7uqz", "parent_id": "t3_8b7uqz", "score": "1", "subreddit": "ShadowBanned", "subreddit_id": "t5_2ql6u"}, {"author": "Cooliceage", "body": "Sorry for the delay, but have a wonderful day!", "created_utc": "1523996047.0", "edited": "False", "id": "dxj24rd", "is_submitter": "False", "link_id": "t3_8b7vrq", "parent_id": "t3_8b7vrq", "score": "1", "subreddit": "ShadowBanned", "subreddit_id": "t5_2ql6u"}, {"author": "Cooliceage", "body": "Well have a good day, anyway!", "created_utc": "1523995907.0", "edited": "False", "id": "dxj1yy7", "is_submitter": "False", "link_id": "t3_8ctev0", "parent_id": "t3_8ctev0", "score": "1", "subreddit": "ShadowBanned", "subreddit_id": "t5_2ql6u"}, {"author": "Cooliceage", "body": "I won't question the comment, but have a good day!", "created_utc": "1523995880.0", "edited": "False", "id": "dxj1xw4", "is_submitter": "False", "link_id": "t3_8cxlkf", "parent_id": "t3_8cxlkf", "score": "1", "subreddit": "ShadowBanned", "subreddit_id": "t5_2ql6u"}, {"author": "Cooliceage", "body": "It's also why the Algerian Independence was such a big deal. It was considered part of mainland France, and not a colony.", "created_utc": "1523197587.0", "edited": "False", "id": "dx0m9aj", "is_submitter": "False", "link_id": "t3_8apmza", "parent_id": "t1_dx0i8bc", "score": "17", "subreddit": "Kaiserreich", "subreddit_id": "t5_2wgr5"}, {"author": "Cooliceage", "body": "Thanks. I just saw it and pressed it and didn't really realize what it was. Then I read all the top posts and the subreddit and I kinda regret just doing it. But anyway thanks again!", "created_utc": "1522960024.0", "edited": "False", "id": "dwvgnk9", "is_submitter": "True", "link_id": "t3_8a35da", "parent_id": "t1_dwvg74u", "score": "1", "subreddit": "CircleofTrust", "subreddit_id": "t5_2th3v"}, {"author": "Cooliceage", "body": "https://chrome.google.com/webstore/detail/hotspot-shield-vpn-free-p/nlbejmccbhkncgokjcmghpfloaajcffj?hl=en\n", "created_utc": "1522956871.0", "edited": "False", "id": "dwvcsou", "is_submitter": "False", "link_id": "t3_8a0cfx", "parent_id": "t1_dwv8c1v", "score": "5", "subreddit": "Kaiserreich", "subreddit_id": "t5_2wgr5"}, {"author": "Cooliceage", "body": "Well when you open the game and go to the choose a country menu with the map, there will be a trophy at the bottom. It will tell you if you can get achievements and why or why not.", "created_utc": "1521991579.0", "edited": "False", "id": "dw9ezqx", "is_submitter": "False", "link_id": "t3_870e8n", "parent_id": "t3_870e8n", "score": "1", "subreddit": "hoi4", "subreddit_id": "t5_2zvvb"}, {"author": "Cooliceage", "body": "There is a really good tutorial by Count Cristo (one of the best phoi4 players) on all the basics.\nhttps://www.youtube.com/watch?v=ut7BDxhmFJk\nThere's part one. There are four parts and there's one on wars and how to play as Germany, which I recommend for a starting nation.", "created_utc": "1521991471.0", "edited": "False", "id": "dw9ewau", "is_submitter": "False", "link_id": "t3_870x06", "parent_id": "t3_870x06", "score": "1", "subreddit": "hoi4", "subreddit_id": "t5_2zvvb"}, {"author": "Cooliceage", "body": "Thanks. I did not think to look on Wiktionary.", "created_utc": "1521234481.0", "edited": "False", "id": "dvteyss", "is_submitter": "False", "link_id": "t3_84xecc", "parent_id": "t1_dvterxv", "score": "1", "subreddit": "Kaiserreich", "subreddit_id": "t5_2wgr5"}, {"author": "Cooliceage", "body": "I've looked on Wikipedia and a few google searches but can't find where the word \"Batavian\" comes from. Would someone mind telling me?", "created_utc": "1521232665.0", "edited": "False", "id": "dvtd5dt", "is_submitter": "False", "link_id": "t3_84xecc", "parent_id": "t3_84xecc", "score": "1", "subreddit": "Kaiserreich", "subreddit_id": "t5_2wgr5"}, {"author": "Cooliceage", "body": "I mean i read some but I did hear a bit about him drinking but never much. I guess I learned something new. Usually I like to focus on his military campaigns also so that could be it.", "created_utc": "1520881446.0", "edited": "False", "id": "dvl8047", "is_submitter": "False", "link_id": "t3_83mzpf", "parent_id": "t1_dvl052u", "score": "1", "subreddit": "Kaiserreich", "subreddit_id": "t5_2wgr5"}, {"author": "Cooliceage", "body": "Liver cirrhosis is a complex disease and most often is caused by drinking too much alcohol. From what I have read there is no mention of him drinking and liver cirrhosis also has a high amount of unidentified causes. I completely believe he would have died later but I don't know if he could have still fought a war of independence and started a government after a long time. He was in his 50's and had shown signs of bad health in 1937. With luck I can only seeing him giving support to a government by speech or maybe being part of the government but he was to old to lead it.", "created_utc": "1520804612.0", "edited": "False", "id": "dvjmuxw", "is_submitter": "False", "link_id": "t3_83mzpf", "parent_id": "t1_dvjm69d", "score": "4", "subreddit": "Kaiserreich", "subreddit_id": "t5_2wgr5"}, {"author": "Cooliceage", "body": "Do you mean Ataturk?", "created_utc": "1520802517.0", "edited": "False", "id": "dvjkz8g", "is_submitter": "False", "link_id": "t3_83p2kr", "parent_id": "t1_dvjjuor", "score": "33", "subreddit": "Kaiserreich", "subreddit_id": "t5_2wgr5"}, {"author": "Cooliceage", "body": "Im turkish (I am guessing you are too) but Ataturk also smoked a lot and didn't generally live a very healthy lifestyle. I wish he could have lived longer but I don't think he could have by much. ", "created_utc": "1520802401.0", "edited": "False", "id": "dvjkvkv", "is_submitter": "False", "link_id": "t3_83mzpf", "parent_id": "t3_83mzpf", "score": "9", "subreddit": "Kaiserreich", "subreddit_id": "t5_2wgr5"}, {"author": "Cooliceage", "body": "Ataturk died in 1938, didnt he? In game isnt it usually his successor izmit inonu that becomes leader?", "created_utc": "1520802127.0", "edited": "False", "id": "dvjkmrt", "is_submitter": "False", "link_id": "t3_83ndxs", "parent_id": "t3_83ndxs", "score": "14", "subreddit": "Kaiserreich", "subreddit_id": "t5_2wgr5"}, {"author": "Cooliceage", "body": "Actually a question. What does promoting do really? Does it turn the general into a field marshal or buff them or what?", "created_utc": "1520691329.0", "edited": "False", "id": "dvhclnu", "is_submitter": "False", "link_id": "t3_82s94k", "parent_id": "t1_dve4knj", "score": "5", "subreddit": "hoi4", "subreddit_id": "t5_2zvvb"}, {"author": "Cooliceage", "body": "Without the dlc what can the red telephone do? I played one test game and all I saw was the ability to increase airplane competence.", "created_utc": "1520529709.0", "edited": "False", "id": "dvduklv", "is_submitter": "False", "link_id": "t3_82s94k", "parent_id": "t3_82s94k", "score": "19", "subreddit": "hoi4", "subreddit_id": "t5_2zvvb"}, {"author": "Cooliceage", "body": "Hey OP I just saw some comments and want to say thanks for being a nice guy in general. You have most likely paid for this sites existence for like a day or two single handedly and made peoples days better. You seem nice. ", "created_utc": "1519515639.0", "edited": "False", "id": "dus229v", "is_submitter": "False", "link_id": "t3_7zz5hc", "parent_id": "t3_7zz5hc", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "Cooliceage", "body": "Be a happy piano man for me ok?", "created_utc": "1519261995.0", "edited": "False", "id": "dummu43", "is_submitter": "False", "link_id": "t3_7yzmxz", "parent_id": "t3_7yzmxz", "score": "2", "subreddit": "ShadowBanned", "subreddit_id": "t5_2ql6u"}, {"author": "Cooliceage", "body": "It isn't fixed", "created_utc": "1519261971.0", "edited": "False", "id": "dummtce", "is_submitter": "False", "link_id": "t3_7z0kwz", "parent_id": "t3_7z0kwz", "score": "1", "subreddit": "ShadowBanned", "subreddit_id": "t5_2ql6u"}, {"author": "Cooliceage", "body": "Test negative, we will get them next time.", "created_utc": "1519261956.0", "edited": "False", "id": "dummsuw", "is_submitter": "False", "link_id": "t3_7z1614", "parent_id": "t3_7z1614", "score": "1", "subreddit": "ShadowBanned", "subreddit_id": "t5_2ql6u"}, {"author": "Cooliceage", "body": "Your all good", "created_utc": "1519261932.0", "edited": "False", "id": "dumms2a", "is_submitter": "False", "link_id": "t3_7z97gs", "parent_id": "t3_7z97gs", "score": "1", "subreddit": "ShadowBanned", "subreddit_id": "t5_2ql6u"}, {"author": "Cooliceage", "body": "But yes", "created_utc": "1519161835.0", "edited": "False", "id": "duka99l", "is_submitter": "False", "link_id": "t3_7yxr22", "parent_id": "t1_duk3ndd", "score": "1", "subreddit": "ShadowBanned", "subreddit_id": "t5_2ql6u"}, {"author": "Cooliceage", "body": "Thats just getting banned.", "created_utc": "1519161827.0", "edited": "False", "id": "duka8x8", "is_submitter": "False", "link_id": "t3_7yxr22", "parent_id": "t1_duk3ndd", "score": "1", "subreddit": "ShadowBanned", "subreddit_id": "t5_2ql6u"}, {"author": "Cooliceage", "body": "No", "created_utc": "1519150979.0", "edited": "False", "id": "dujy95p", "is_submitter": "False", "link_id": "t3_7xsve8", "parent_id": "t3_7xsve8", "score": "1", "subreddit": "ShadowBanned", "subreddit_id": "t5_2ql6u"}, {"author": "Cooliceage", "body": "N\nO", "created_utc": "1519150966.0", "edited": "False", "id": "dujy8ng", "is_submitter": "False", "link_id": "t3_7yec2b", "parent_id": "t3_7yec2b", "score": "1", "subreddit": "ShadowBanned", "subreddit_id": "t5_2ql6u"}, {"author": "Cooliceage", "body": "No", "created_utc": "1519150960.0", "edited": "False", "id": "dujy8e1", "is_submitter": "False", "link_id": "t3_7yeffk", "parent_id": "t3_7yeffk", "score": "1", "subreddit": "ShadowBanned", "subreddit_id": "t5_2ql6u"}, {"author": "Cooliceage", "body": "You are great", "created_utc": "1519150941.0", "edited": "False", "id": "dujy7lg", "is_submitter": "False", "link_id": "t3_7yxbd3", "parent_id": "t3_7yxbd3", "score": "1", "subreddit": "ShadowBanned", "subreddit_id": "t5_2ql6u"}, {"author": "Cooliceage", "body": "No", "created_utc": "1519150933.0", "edited": "False", "id": "dujy7af", "is_submitter": "False", "link_id": "t3_7yxmyw", "parent_id": "t3_7yxmyw", "score": "1", "subreddit": "ShadowBanned", "subreddit_id": "t5_2ql6u"}, {"author": "Cooliceage", "body": "Your not", "created_utc": "1519150927.0", "edited": "False", "id": "dujy71s", "is_submitter": "False", "link_id": "t3_7yxr22", "parent_id": "t3_7yxr22", "score": "1", "subreddit": "ShadowBanned", "subreddit_id": "t5_2ql6u"}, {"author": "Cooliceage", "body": "Your not", "created_utc": "1519150908.0", "edited": "False", "id": "dujy6bh", "is_submitter": "False", "link_id": "t3_7x8585", "parent_id": "t3_7x8585", "score": "1", "subreddit": "Shadow_Ban", "subreddit_id": "t5_3e54g"}, {"author": "Cooliceage", "body": "You arent shadowbanned btw", "created_utc": "1518363254.0", "edited": "False", "id": "du2zmgv", "is_submitter": "False", "link_id": "t3_7v1y75", "parent_id": "t3_7v1y75", "score": "2", "subreddit": "ShadowBanned", "subreddit_id": "t5_2ql6u"}, {"author": "Cooliceage", "body": "You not banned if you want to know...", "created_utc": "1518294105.0", "edited": "False", "id": "du1s6nu", "is_submitter": "False", "link_id": "t3_7wknp9", "parent_id": "t1_du12vxm", "score": "2", "subreddit": "ShadowBanned", "subreddit_id": "t5_2ql6u"}, {"author": "Cooliceage", "body": "Yes", "created_utc": "1518294044.0", "edited": "False", "id": "du1s4rm", "is_submitter": "False", "link_id": "t3_7wnhrg", "parent_id": "t3_7wnhrg", "score": "2", "subreddit": "ShadowBanned", "subreddit_id": "t5_2ql6u"}, {"author": "Cooliceage", "body": "Is there any country in Kaisserreich that is safe? Is Bhutan safe?", "created_utc": "1518208426.0", "edited": "False", "id": "du045jw", "is_submitter": "False", "link_id": "t3_7wf5zw", "parent_id": "t3_7wf5zw", "score": "12", "subreddit": "Kaiserreich", "subreddit_id": "t5_2wgr5"}, {"author": "Cooliceage", "body": "Breaks", "created_utc": "1518142190.0", "edited": "False", "id": "dtyqu99", "is_submitter": "True", "link_id": "t3_7w8nge", "parent_id": "t1_dtyqtq7", "score": "2", "subreddit": "AskPhysics", "subreddit_id": "t5_2sumo"}, {"author": "Cooliceage", "body": "Ok i could definitely rant about this but ill give a brief list ( I know more modernish history then long ago btw)\nLanguage\nArchitecture- vague but bridges and other related things have allowed cities to truly be built to more then huts\nWriting\nTimekeeping\nLots of navigation things- Need for exploring\nBow and arrow- the god damn mongols destroyed with it\nBooks/paper\nPrinting press- education really matters\nGuns- Also could apply to gunpowder and other weapons\nBoats- I dont know to much about specific boats and stuff but it definitely important\nSkipping a sizable amount of time\nWays for mass Industrialization- Assembly line and others just paved the way for advancements in civilian technology and also the start of the first major wars\nRadio\nTransistors- I also really love talking about computers and wish i knew more\n\nIn my opinion the some of the most important\nIdeologies- From fascism to communism definitely shaped the last few centuries to go past religion and monarchy\n\nPhilosophy- Just the thought that man are special are can do great things have probably driven so many of the greatest \nEvents in history.", "created_utc": "1516597180.0", "edited": "False", "id": "dt1qbp0", "is_submitter": "False", "link_id": "t3_7s37n9", "parent_id": "t1_dt1ponn", "score": "2", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "Cooliceage", "body": "Make sure to add pepper and i know this kinda makes it an omelette but mushrooms", "created_utc": "1516595796.0", "edited": "False", "id": "dt1pbnt", "is_submitter": "False", "link_id": "t3_7s3cm2", "parent_id": "t3_7s3cm2", "score": "2", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "Cooliceage", "body": "Rejection should never be something to put you off from doing something, and life is enjoyable because its not infinite.", "created_utc": "1516595151.0", "edited": "False", "id": "dt1oukp", "is_submitter": "False", "link_id": "t3_7s3agp", "parent_id": "t3_7s3agp", "score": "2", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "Cooliceage", "body": "It would most likely be like my life now except I would be better at not procrastinating and instead doing things. I get the most enjoyment out of succeeding in what I try rather than just limitless pleasure.", "created_utc": "1516595028.0", "edited": "False", "id": "dt1or6v", "is_submitter": "False", "link_id": "t3_7s39vl", "parent_id": "t3_7s39vl", "score": "2", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "Cooliceage", "body": "My parents raised me very well so i will give them that.", "created_utc": "1516594906.0", "edited": "False", "id": "dt1onul", "is_submitter": "False", "link_id": "t3_7s39em", "parent_id": "t3_7s39em", "score": "2", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "Cooliceage", "body": "Hopefully try to be good to yourself and others.", "created_utc": "1516594868.0", "edited": "False", "id": "dt1omta", "is_submitter": "False", "link_id": "t3_7s39la", "parent_id": "t3_7s39la", "score": "0", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "Cooliceage", "body": "I think its not a lack of humour but a very different type. I know people that would laugh at mentioning communism or death and others would think it's mortifying. Its just a matter of perspective that allows you to more relate to another person, atleast in my opinion.", "created_utc": "1516594835.0", "edited": "False", "id": "dt1olxn", "is_submitter": "False", "link_id": "t3_7s39no", "parent_id": "t3_7s39no", "score": "2", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "Cooliceage", "body": "I like to be optimistic with the future. After all nobody expected the car or the computer but here we are!", "created_utc": "1516594733.0", "edited": "False", "id": "dt1oj3m", "is_submitter": "False", "link_id": "t3_7s383c", "parent_id": "t1_dt1ohm5", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "Cooliceage", "body": "Whatever language i was last speaking in usually", "created_utc": "1516594626.0", "edited": "False", "id": "dt1og51", "is_submitter": "False", "link_id": "t3_7s37e6", "parent_id": "t3_7s37e6", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "Cooliceage", "body": "History. I love all of it from the good and the bad.", "created_utc": "1516594583.0", "edited": "False", "id": "dt1oewi", "is_submitter": "False", "link_id": "t3_7s37n9", "parent_id": "t3_7s37n9", "score": "2", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "Cooliceage", "body": "Maybe some cool thing with crispr and medication. If new vaccines could be made better in labs that would be amazing.", "created_utc": "1516594531.0", "edited": "False", "id": "dt1odgb", "is_submitter": "False", "link_id": "t3_7s383c", "parent_id": "t1_dt1obgt", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "Cooliceage", "body": "Any day. Its always good to try to improve somebodies day!", "created_utc": "1516594487.0", "edited": "False", "id": "dt1oc81", "is_submitter": "False", "link_id": "t3_7s370p", "parent_id": "t1_dt1o9b6", "score": "2", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "Cooliceage", "body": "I have a music playlist with upbeat music and like to talk with friends or just play semi nostalgic games like minecraft", "created_utc": "1516594416.0", "edited": "False", "id": "dt1oa80", "is_submitter": "False", "link_id": "t3_7s37pz", "parent_id": "t3_7s37pz", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "Cooliceage", "body": "Im really hoping something in genetics", "created_utc": "1516594344.0", "edited": "False", "id": "dt1o89i", "is_submitter": "False", "link_id": "t3_7s383c", "parent_id": "t3_7s383c", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "Cooliceage", "body": "https://www.reddit.com/r/TheLastAirbender/comments/7mrqag/no_spoilers_made_this_for_the_wendys_social_media/?st=JCPP203G&sh=ed25699c\nI find this one amusing.", "created_utc": "1516594256.0", "edited": "False", "id": "dt1o5ta", "is_submitter": "False", "link_id": "t3_7s370p", "parent_id": "t3_7s370p", "score": "2", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "Cooliceage", "body": "If they sabotaged something i really try a lot at or is really important to me, or abuse the information i have given them to ruin parts of my life.", "created_utc": "1516594159.0", "edited": "False", "id": "dt1o38o", "is_submitter": "False", "link_id": "t3_7s371d", "parent_id": "t3_7s371d", "score": "2", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "Cooliceage", "body": "Enjoy it", "created_utc": "1516594086.0", "edited": "False", "id": "dt1o18j", "is_submitter": "False", "link_id": "t3_7s37b4", "parent_id": "t3_7s37b4", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "Cooliceage", "body": "When your both very happy with each other not only as people but in every regard necessary for a good relationship.", "created_utc": "1516594073.0", "edited": "False", "id": "dt1o0uz", "is_submitter": "False", "link_id": "t3_7s37b7", "parent_id": "t3_7s37b7", "score": "2", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "Cooliceage", "body": "My first idea was starting in like vienna or somewhere but greece is such a great idea. That would be pretty awesome honestly. ", "created_utc": "1515643683.0", "edited": "False", "id": "dsi5u99", "is_submitter": "True", "link_id": "t3_7plbi0", "parent_id": "t1_dsi5qh0", "score": "1", "subreddit": "DnD", "subreddit_id": "t5_2r9ei"}, {"author": "Cooliceage", "body": "What is that music. Its pretty fresh, like your snipes!", "created_utc": "1512328159.0", "edited": "False", "id": "dqpnfbe", "is_submitter": "False", "link_id": "t3_7h9zsw", "parent_id": "t3_7h9zsw", "score": "1", "subreddit": "splatoon", "subreddit_id": "t5_324q4"}, {"author": "Cooliceage", "body": "I touched a buggati Royale once in a museum in france. ", "created_utc": "1512183331.0", "edited": "False", "id": "dqn3qdj", "is_submitter": "False", "link_id": "t3_7gy8ve", "parent_id": "t3_7gy8ve", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "Cooliceage", "body": "Thank you for the answer!", "created_utc": "1511907167.0", "edited": "False", "id": "dqh62o2", "is_submitter": "True", "link_id": "t3_7g7h7y", "parent_id": "t1_dqh60vb", "score": "2", "subreddit": "NoStupidQuestions", "subreddit_id": "t5_2w844"}, {"author": "Cooliceage", "body": "Unimaginable!", "created_utc": "1511746862.0", "edited": "False", "id": "dqdw3fk", "is_submitter": "False", "link_id": "t3_7fpelp", "parent_id": "t1_dqdnfp5", "score": "1", "subreddit": "Overwatch", "subreddit_id": "t5_2u5kl"}, {"author": "Cooliceage", "body": "no", "created_utc": "1510783785.0", "edited": "False", "id": "dpvnfuu", "is_submitter": "False", "link_id": "t3_7d4i4w", "parent_id": "t3_7d4i4w", "score": "2", "subreddit": "ShadowBanned", "subreddit_id": "t5_2ql6u"}, {"author": "Cooliceage", "body": "no", "created_utc": "1510783771.0", "edited": "False", "id": "dpvnfd4", "is_submitter": "False", "link_id": "t3_7d6na9", "parent_id": "t3_7d6na9", "score": "1", "subreddit": "ShadowBanned", "subreddit_id": "t5_2ql6u"}, {"author": "Cooliceage", "body": "Nope", "created_utc": "1509797677.0", "edited": "False", "id": "dpby98n", "is_submitter": "False", "link_id": "t3_7ansar", "parent_id": "t3_7ansar", "score": "1", "subreddit": "ShadowBanned", "subreddit_id": "t5_2ql6u"}, {"author": "Cooliceage", "body": "No", "created_utc": "1509737010.0", "edited": "False", "id": "dpaxdfp", "is_submitter": "False", "link_id": "t3_7aj8nt", "parent_id": "t3_7aj8nt", "score": "2", "subreddit": "ShadowBanned", "subreddit_id": "t5_2ql6u"}, {"author": "Cooliceage", "body": "I think the game is most enjoyable if instead of trying to grind the game to oblivion you upgrade collectors and just log on once or twice a day. Upgrade some stuff and maybe every once in a while do some attacks to get some cool upgrade. I got all 5 builders and have nearly 3k gems without spending a cent so that can also help.", "created_utc": "1509661633.0", "edited": "False", "id": "dp9fmwg", "is_submitter": "False", "link_id": "t3_7ab6ah", "parent_id": "t1_dp8tmkk", "score": "4", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "Cooliceage", "body": "Mild depression doesn't stay mild long.", "created_utc": "1508595418.0", "edited": "False", "id": "dooip7e", "is_submitter": "False", "link_id": "t3_77sq2o", "parent_id": "t3_77sq2o", "score": "-1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "Cooliceage", "body": "They honestly just need to stop invading the soviets when they cannot win. I have not seen a game were they losee from something unrelated to the soviets.", "created_utc": "1506222676.0", "edited": "False", "id": "dnfb47m", "is_submitter": "False", "link_id": "t3_721svr", "parent_id": "t1_dnfas55", "score": "33", "subreddit": "hoi4", "subreddit_id": "t5_2zvvb"}, {"author": "Cooliceage", "body": "Maybe a zelda game and dark souls. Imagine the soundtrack of ocarina of time and the story combined with the difficulty and all of the details and battles of dark souls.", "created_utc": "1504742827.0", "edited": "False", "id": "dmnvknb", "is_submitter": "False", "link_id": "t3_6yh6m4", "parent_id": "t3_6yh6m4", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "Cooliceage", "body": "Yes I am able to do that for nearly every conversation except some specific situations such as math.", "created_utc": "1504644234.0", "edited": "False", "id": "dmlwszw", "is_submitter": "True", "link_id": "t3_6yajt4", "parent_id": "t1_dmluh05", "score": "1", "subreddit": "NoStupidQuestions", "subreddit_id": "t5_2w844"}, {"author": "Cooliceage", "body": "Would you rather know everything or be blissfully ignorant?", "created_utc": "1504565498.0", "edited": "False", "id": "dmkgcoi", "is_submitter": "False", "link_id": "t3_6y05ox", "parent_id": "t3_6y05ox", "score": "19", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "Cooliceage", "body": "I generally don't  like open worlds either but this game. I just love the factor of hey that looks cool lets go there. Then halfway there i get distracted from something else thats also interesting. My recommendation to enjoy the game is get lost on purpose. Don't have a direction in mind because everywhere is interesting.", "created_utc": "1501612709.0", "edited": "False", "id": "dl0vmml", "is_submitter": "False", "link_id": "t3_6qwu14", "parent_id": "t1_dl0via8", "score": "1", "subreddit": "NintendoSwitch", "subreddit_id": "t5_3h47q"}, {"author": "Cooliceage", "body": "Once you get into it you get into it. I have over 145 hours and its really amazing. I still have to finish the trials and do master mode. Its an amazing game.", "created_utc": "1501612541.0", "edited": "False", "id": "dl0vgm4", "is_submitter": "False", "link_id": "t3_6qwu14", "parent_id": "t1_dl0uns9", "score": "1", "subreddit": "NintendoSwitch", "subreddit_id": "t5_3h47q"}, {"author": "Cooliceage", "body": "It is pretty cool. Its kinda odd though.", "created_utc": "1501612329.0", "edited": "False", "id": "dl0v92x", "is_submitter": "False", "link_id": "t3_6qvz0t", "parent_id": "t1_dl0v7bo", "score": "3", "subreddit": "NintendoSwitch", "subreddit_id": "t5_3h47q"}, {"author": "Cooliceage", "body": "You can parry bees. Nearly every form of damage can be blocked or parried.", "created_utc": "1501612226.0", "edited": "False", "id": "dl0v5fr", "is_submitter": "False", "link_id": "t3_6qvz0t", "parent_id": "t3_6qvz0t", "score": "5", "subreddit": "NintendoSwitch", "subreddit_id": "t5_3h47q"}, {"author": "Cooliceage", "body": "I am very stupid sometimes and forgot what im writing.", "created_utc": "1501268734.0", "edited": "False", "id": "dkuskpu", "is_submitter": "False", "link_id": "t3_6q218v", "parent_id": "t1_dkusid2", "score": "3", "subreddit": "splatoon", "subreddit_id": "t5_324q4"}, {"author": "Cooliceage", "body": "Arent they changing the times anyway. I saw a post that was the times for salmon run and all the times were 24 hour long sets every other day. Seems fine. ", "created_utc": "1501240443.0", "edited": "False", "id": "dku51mi", "is_submitter": "False", "link_id": "t3_6q218v", "parent_id": "t1_dktzwtl", "score": "3", "subreddit": "splatoon", "subreddit_id": "t5_324q4"}, {"author": "Cooliceage", "body": "Ehh i dont really mind. It makes it feel a bit more special. Its kinda like if you have your favorite food every day it will get boring. Atleast my idea.", "created_utc": "1501226451.0", "edited": "False", "id": "dktzjww", "is_submitter": "False", "link_id": "t3_6q218v", "parent_id": "t1_dktz0zd", "score": "85", "subreddit": "splatoon", "subreddit_id": "t5_324q4"}, {"author": "Cooliceage", "body": "Well cool. I already have a switch and botw so i dont really need cemu. Played it for 140 hours and still havent done master mode.", "created_utc": "1501224321.0", "edited": "False", "id": "dktyl5j", "is_submitter": "False", "link_id": "t3_6pt2sb", "parent_id": "t1_dkt4f12", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "Cooliceage", "body": "Why high on LSD? Also isn't the current Botw emulation pure trash or did they fix it?", "created_utc": "1501153566.0", "edited": "False", "id": "dkse1mq", "is_submitter": "False", "link_id": "t3_6pt2sb", "parent_id": "t1_dkrzzdn", "score": "9", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "Cooliceage", "body": "Scammers. Dude I just want a switch how did you get 25 of them?", "created_utc": "1501087094.0", "edited": "False", "id": "dkr2dqt", "is_submitter": "False", "link_id": "t3_6pnszq", "parent_id": "t3_6pnszq", "score": "63", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "Cooliceage", "body": "I had gone to 6 different schools before ending middle school while only moving once. I think he best thing I ever did was during middle school I had a question that I wanted to ask a few people so I asked maybe the one person I knew. I decided to ask a few other random people that I barely knew. Then that lunch I got the motivation somehow to ask that question to everybody at lunch. I asked my question to 200 people and a lot of people answered. I started doing these questions a lot and people started to know me as that guy. One day I brought a notebook to school and recorded my question down. I still have that notebook with a around a hundred questions and all the results. It was really fun and most likely how I ended my phobia of interacting with others.", "created_utc": "1500720544.0", "edited": "False", "id": "dkk9lc4", "is_submitter": "False", "link_id": "t3_6otgkc", "parent_id": "t3_6otgkc", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "Cooliceage", "body": "Got Botw and Mk8 physical with splatoon coming in a day or 2 also. Digital I got shovel knight fast RMX and Snipperclips with the bundle that i got for the switch. Will get mario odyssey and maybe a few indie games when i get the money.", "created_utc": "1500665384.0", "edited": "False", "id": "dkjb15q", "is_submitter": "False", "link_id": "t3_6opimj", "parent_id": "t3_6opimj", "score": "2", "subreddit": "NintendoSwitch", "subreddit_id": "t5_3h47q"}, {"author": "Cooliceage", "body": "Pole", "created_utc": "1500536822.0", "edited": "False", "id": "dkgtk8o", "is_submitter": "False", "link_id": "t3_6odm6u", "parent_id": "t3_6odm6u", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "Cooliceage", "body": "Just wait the time. You will spend a lot more time playing splatfests then waiting the time.", "created_utc": "1500535983.0", "edited": "False", "id": "dkgt7ln", "is_submitter": "False", "link_id": "t3_6oe5xq", "parent_id": "t3_6oe5xq", "score": "5", "subreddit": "splatoon", "subreddit_id": "t5_324q4"}, {"author": "Cooliceage", "body": "Probably no wedding. The perfect wedding for me would be a person happy enough with me that they wouldn't need a celebration to announce we are together.", "created_utc": "1500493985.0", "edited": "False", "id": "dkfyp0k", "is_submitter": "False", "link_id": "t3_6o9hjp", "parent_id": "t3_6o9hjp", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "Cooliceage", "body": "I guess im just really lucky but I have two monitors. What im most likely gonna so is have splatoon on one monitor and have discord on my pc monitor. I solved all this. I can just have the music coming from the monitor and headphones discord. Thats what I am going to do.", "created_utc": "1500482164.0", "edited": "False", "id": "dkfmteu", "is_submitter": "False", "link_id": "t3_6o80pr", "parent_id": "t3_6o80pr", "score": "1", "subreddit": "NintendoSwitch", "subreddit_id": "t5_3h47q"}, {"author": "Cooliceage", "body": "Seems like based on the subreddit and google. Of course nobody will know until the day.", "created_utc": "1500472375.0", "edited": "False", "id": "dkfdo50", "is_submitter": "False", "link_id": "t3_6o815k", "parent_id": "t1_dkfdmx5", "score": "3", "subreddit": "splatoon", "subreddit_id": "t5_324q4"}, {"author": "Cooliceage", "body": "Well turns out im wrong. I looked for a bit online and it is being released at midnight est. ", "created_utc": "1500472169.0", "edited": "False", "id": "dkfdi1p", "is_submitter": "False", "link_id": "t3_6o815k", "parent_id": "t1_dkfcmx3", "score": "3", "subreddit": "splatoon", "subreddit_id": "t5_324q4"}, {"author": "Cooliceage", "body": "Gg wp", "created_utc": "1500470452.0", "edited": "False", "id": "dkfc5vc", "is_submitter": "False", "link_id": "t3_6nz0jw", "parent_id": "t3_6nz0jw", "score": "1", "subreddit": "splatoon", "subreddit_id": "t5_324q4"}, {"author": "Cooliceage", "body": "This usually depends on the company. I would say converted because of how the game is Japanese and is being released everywhere but I dont know exactly. Anyway It is only a few hours which wont change much. Enjoy playing!", "created_utc": "1500470335.0", "edited": "False", "id": "dkfc2ra", "is_submitter": "False", "link_id": "t3_6o815k", "parent_id": "t3_6o815k", "score": "3", "subreddit": "splatoon", "subreddit_id": "t5_324q4"}, {"author": "Cooliceage", "body": "A bit late sorry dude.", "created_utc": "1500470080.0", "edited": "False", "id": "dkfbw22", "is_submitter": "False", "link_id": "t3_6o7k7s", "parent_id": "t3_6o7k7s", "score": "3", "subreddit": "splatoon", "subreddit_id": "t5_324q4"}, {"author": "Cooliceage", "body": "I would say casually explained is the king of subtle humor so check a video of him and if you like it you will like it. Also Jacksfilms has a few good long running series such as yiay and your grammer sucks. I would say for yiay older is better and ygs newer is better. Also he has a jackask series which is asking him questions. Any ending with 6 has his gf who is really funny.", "created_utc": "1500449177.0", "edited": "False", "id": "dkf2knd", "is_submitter": "False", "link_id": "t3_6o5gsc", "parent_id": "t3_6o5gsc", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "Cooliceage", "body": "Thanks a lot!", "created_utc": "1500358175.0", "edited": "False", "id": "dkdbd8c", "is_submitter": "False", "link_id": "t3_6nt2q9", "parent_id": "t1_dkclpbr", "score": "2", "subreddit": "NintendoSwitch", "subreddit_id": "t5_3h47q"}, {"author": "Cooliceage", "body": "I mean there are entire studies on this but from what i have heard the pythagorean theorem is said to be the easiest way.", "created_utc": "1500314411.0", "edited": "False", "id": "dkccb4g", "is_submitter": "False", "link_id": "t3_6ntvk6", "parent_id": "t3_6ntvk6", "score": "3", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "Cooliceage", "body": "What ill most likely do is go and find some splatoon discord and just talk with the people I'm playing with there and have splatoon on my second monitor.", "created_utc": "1500300601.0", "edited": "False", "id": "dkbzr88", "is_submitter": "False", "link_id": "t3_6nt2q9", "parent_id": "t3_6nt2q9", "score": "2", "subreddit": "NintendoSwitch", "subreddit_id": "t5_3h47q"}, {"author": "Cooliceage", "body": "One time when I was in third grade i knew this asshole of a girl who kept on teasing all guys that they cant her or so anything because she is a girl. One time she was teasing me so I punched her in the face. She shut up after that.", "created_utc": "1500141290.0", "edited": "False", "id": "dk9fb20", "is_submitter": "False", "link_id": "t3_6nfuqb", "parent_id": "t1_dk98ibb", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "Cooliceage", "body": "Great turn of events. Good story.", "created_utc": "1500133042.0", "edited": "False", "id": "dk99fd8", "is_submitter": "False", "link_id": "t3_6nga0t", "parent_id": "t3_6nga0t", "score": "2", "subreddit": "redcarpetwrites", "subreddit_id": "t5_3m88j"}, {"author": "Cooliceage", "body": "So for some reason earlier this year i got addicted to Bo Burnham and memorized the entire somg kill yourself. I would sing it loudly in hallways.", "created_utc": "1500108276.0", "edited": "False", "id": "dk8y9wd", "is_submitter": "False", "link_id": "t3_6nbmqn", "parent_id": "t3_6nbmqn", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "Cooliceage", "body": "Listening only gets you one of 20 endings. Its a game and not a game.\n", "created_utc": "1499971047.0", "edited": "False", "id": "dk6g1py", "is_submitter": "False", "link_id": "t3_6n1aq0", "parent_id": "t3_6n1aq0", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "Cooliceage", "body": "Dude great series. I would buy a book like this. If this goes on you should set up a Kickstarter.", "created_utc": "1499861179.0", "edited": "False", "id": "dk45x7r", "is_submitter": "False", "link_id": "t3_6mt7rw", "parent_id": "t3_6mt7rw", "score": "4", "subreddit": "Hydrael_Writes", "subreddit_id": "t5_3ke9z"}, {"author": "Cooliceage", "body": "Put nothing then say its what they deserve.", "created_utc": "1499850963.0", "edited": "False", "id": "dk41mwj", "is_submitter": "False", "link_id": "t3_6ms898", "parent_id": "t3_6ms898", "score": "0", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "Cooliceage", "body": "Favorite example is people believing that because nuclear accidents happen nuclear energy will never be a successful practice. Coal mines collapse and gas pressures increase above what is expected. In every form of resource gathering mistakes and accidents happen. So much god damn selection bias in people.", "created_utc": "1499770989.0", "edited": "False", "id": "dk2f7ln", "is_submitter": "False", "link_id": "t3_6mj3b9", "parent_id": "t1_dk20opx", "score": "34", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "Cooliceage", "body": "Audio technica and Seinheiser are just better in my opinion for the price. Also the few people I know with Beats say they are uncomfortable for the long term. To much of the money they get is spent on ads.", "created_utc": "1499623582.0", "edited": "False", "id": "djzrai6", "is_submitter": "False", "link_id": "t3_6m6q8t", "parent_id": "t1_djzfrk6", "score": "63", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "Cooliceage", "body": "I was in fifth grade and I was trying to record something on my mac and was getting a few problem messages. So i decide to ask one of the people i know to help me. He was considered semi popular but knew people. So I ask him for some help and he says he wants 5$ bucks to show me how to fix a minor problem with quicktime player. I say no because that is stupid and he decides that ill pay for that. Somehow gets people to believe i've been trying to steal i formation out of him. Yeah wasn't exactly a good person.", "created_utc": "1499453647.0", "edited": "False", "id": "djwxw3b", "is_submitter": "False", "link_id": "t3_6lu1vx", "parent_id": "t3_6lu1vx", "score": "3", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "Cooliceage", "body": "Time. The ability to track measure and use time to plan events is so important yet people don't appreciate it.", "created_utc": "1499256192.0", "edited": "False", "id": "djsyztk", "is_submitter": "False", "link_id": "t3_6lbohj", "parent_id": "t3_6lbohj", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "Cooliceage", "body": "A war medal from one of my ancestors who thought for the independence of turkey with Ataturk. He was one in a 100 or so.", "created_utc": "1499090037.0", "edited": "False", "id": "djq10g3", "is_submitter": "False", "link_id": "t3_6kyz2l", "parent_id": "t3_6kyz2l", "score": "2", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "Cooliceage", "body": "I dont know if I should upvote for it being creepy as fuck or downvote for being creepy as fuck. But i do know what im going to share with my 5 year old cousin!", "created_utc": "1496009086.0", "edited": "False", "id": "di5vycd", "is_submitter": "False", "link_id": "t3_6dul19", "parent_id": "t3_6dul19", "score": "8", "subreddit": "nosleep", "subreddit_id": "t5_2rm4d"}, {"author": "Cooliceage", "body": "Honestly the Great Plateau was my favorite. It was a bit of the entire game in one. With the mountain for cold, the forest of spirits for forests, the rive of the dead for rivers, some cool buildings, and to top it all off a (basically for the time) boss the talus.", "created_utc": "1495654622.0", "edited": "False", "id": "dhzrdpi", "is_submitter": "False", "link_id": "t3_6d3jn8", "parent_id": "t3_6d3jn8", "score": "20", "subreddit": "Breath_of_the_Wild", "subreddit_id": "t5_3f1s6"}, {"author": "Cooliceage", "body": "A i said dragoon roost b then it wouldnt be a new soundtrack if everything was the same", "created_utc": "1494533109.0", "edited": "False", "id": "dhfpbqz", "is_submitter": "False", "link_id": "t3_6akg8c", "parent_id": "t1_dhfoenh", "score": "-1", "subreddit": "Breath_of_the_Wild", "subreddit_id": "t5_3f1s6"}, {"author": "Cooliceage", "body": "They already do. Rito village is a slowed down version of an older song. The hyrule castle music is a mixture of the original theme and i think there is some zelda lullaby. etc", "created_utc": "1494530805.0", "edited": "False", "id": "dhfn3zb", "is_submitter": "False", "link_id": "t3_6akg8c", "parent_id": "t3_6akg8c", "score": "1", "subreddit": "Breath_of_the_Wild", "subreddit_id": "t5_3f1s6"}, {"author": "Cooliceage", "body": "Sold them", "created_utc": "1494359141.0", "edited": "False", "id": "dhcc9l7", "is_submitter": "False", "link_id": "t3_6a7hhh", "parent_id": "t1_dhcc8vx", "score": "1", "subreddit": "Breath_of_the_Wild", "subreddit_id": "t5_3f1s6"}, {"author": "Cooliceage", "body": "I did eventide last. Removed all hearts and stamina containers and no divine beasts. Really made me feel deserving of the outfit,.", "created_utc": "1494357730.0", "edited": "False", "id": "dhcb5kl", "is_submitter": "False", "link_id": "t3_6a7hhh", "parent_id": "t3_6a7hhh", "score": "5", "subreddit": "Breath_of_the_Wild", "subreddit_id": "t5_3f1s6"}, {"author": "Cooliceage", "body": "If you have done the tarrey town side quest then you can buy it again.", "created_utc": "1494278042.0", "edited": "False", "id": "dhav4xo", "is_submitter": "False", "link_id": "t3_6a0zox", "parent_id": "t3_6a0zox", "score": "11", "subreddit": "Breath_of_the_Wild", "subreddit_id": "t5_3f1s6"}, {"author": "Cooliceage", "body": "Some shrine quests make it that you have to talk with the person you triggered it. Ill link a vid which shows every shrine quest in order and where there triggered.\n\nhttps://www.youtube.com/watch?v=41M4YeV-2cc\n", "created_utc": "1494276384.0", "edited": "False", "id": "dhatmsk", "is_submitter": "False", "link_id": "t3_6a0pbi", "parent_id": "t3_6a0pbi", "score": "1", "subreddit": "Breath_of_the_Wild", "subreddit_id": "t5_3f1s6"}, {"author": "Cooliceage", "body": "So you can only get weapons from enemies and thats it. can you buy stuff.", "created_utc": "1494276273.0", "edited": "False", "id": "dhatj4g", "is_submitter": "False", "link_id": "t3_6a0slx", "parent_id": "t3_6a0slx", "score": "4", "subreddit": "Breath_of_the_Wild", "subreddit_id": "t5_3f1s6"}, {"author": "Cooliceage", "body": "For me it was so easy. I just put stasis on the chest cut the rope with an arrow then switched to magnesis. Spammed a over and over and got it. Maybe i just did it the really easy way. How else can you do it.", "created_utc": "1494276179.0", "edited": "False", "id": "dhatfyk", "is_submitter": "False", "link_id": "t3_6a0ei2", "parent_id": "t3_6a0ei2", "score": "45", "subreddit": "Breath_of_the_Wild", "subreddit_id": "t5_3f1s6"}, {"author": "Cooliceage", "body": "If your on the switch do this. Make a new account then open breath of the wild. New save without deleting last. And this time go in the opposite direction you did last time.", "created_utc": "1494276034.0", "edited": "False", "id": "dhataxj", "is_submitter": "False", "link_id": "t3_69rnr1", "parent_id": "t1_dh96odq", "score": "1", "subreddit": "Breath_of_the_Wild", "subreddit_id": "t5_3f1s6"}, {"author": "Cooliceage", "body": "I had completed all the shrine except the eventide island(I wanted it for last) and it displayed 39 out of 42. For some shrines getting in the shrines completes it. Others you must have triggered it and then it will show as complete. Recommend searching all shrine quest video and they will show you location of the start.", "created_utc": "1494274784.0", "edited": "False", "id": "dhas59r", "is_submitter": "False", "link_id": "t3_6a0i9m", "parent_id": "t3_6a0i9m", "score": "1", "subreddit": "Breath_of_the_Wild", "subreddit_id": "t5_3f1s6"}, {"author": "Cooliceage", "body": "I knew about eventide island from a youtube vid on accident so i made sure that would be my very last shrine. I heard lots of people say it was to hard and it was stupid. I decided on being crazy and i sold all my hearts and stamina disabled all divine beasts and also didnt use stasis+. I killed the hinox by hitting it with the stone over and over again with stasis. It was so fun and I really wish i could do it again. Can't wait until Trial of the Sword.", "created_utc": "1494273293.0", "edited": "False", "id": "dhaqqx9", "is_submitter": "False", "link_id": "t3_69zx7h", "parent_id": "t3_69zx7h", "score": "4", "subreddit": "Breath_of_the_Wild", "subreddit_id": "t5_3f1s6"}, {"author": "Cooliceage", "body": "Lynel clubs can have attack bonuses which occasionally go up to 100+. Few other weapons go above 100. And yes all lynels do eventually scale up to silver except for the one that is for the vah ruta mission.", "created_utc": "1493857231.0", "edited": "False", "id": "dh3mef1", "is_submitter": "False", "link_id": "t3_693w04", "parent_id": "t1_dh3lnfj", "score": "5", "subreddit": "Breath_of_the_Wild", "subreddit_id": "t5_3f1s6"}, {"author": "Cooliceage", "body": "Each lynel is one three types pretty sure. Spear sword and clubs. Each of the lynels have one of the weapons listed above. SPear is generally easiest drops worst weapon in return. Clubs are hardest and drop the best stuff. The difference between white and silver lynels in drops is that silver lynels also drop gems and star fragments.", "created_utc": "1493854046.0", "edited": "False", "id": "dh3jt2k", "is_submitter": "False", "link_id": "t3_693w04", "parent_id": "t3_693w04", "score": "5", "subreddit": "Breath_of_the_Wild", "subreddit_id": "t5_3f1s6"}, {"author": "Cooliceage", "body": "For me it was mixed. Most of the game was easy with the occasional hard part like the lynel for the vah ruta mission. The rest was reasonable.", "created_utc": "1493848380.0", "edited": "False", "id": "dh3fb05", "is_submitter": "False", "link_id": "t3_693fhj", "parent_id": "t3_693fhj", "score": "4", "subreddit": "Breath_of_the_Wild", "subreddit_id": "t5_3f1s6"}, {"author": "Cooliceage", "body": "Isnt there a control setting for that? If not I dont think you can but you will get use to it pretty quickly.", "created_utc": "1493494224.0", "edited": "False", "id": "dgx3b4j", "is_submitter": "False", "link_id": "t3_68au72", "parent_id": "t3_68au72", "score": "0", "subreddit": "Breath_of_the_Wild", "subreddit_id": "t5_3f1s6"}, {"author": "Cooliceage", "body": "I mean Find the Fairy Fountain is a main quest not a side quest. Maybe that is the thing. Also you can never have all quests completed because of the ganon quest which can not be completed kinda.", "created_utc": "1493494063.0", "edited": "False", "id": "dgx36ws", "is_submitter": "False", "link_id": "t3_68aumi", "parent_id": "t3_68aumi", "score": "3", "subreddit": "Breath_of_the_Wild", "subreddit_id": "t5_3f1s6"}, {"author": "Cooliceage", "body": "I find it kind of easy once you get it down. Rarely do i get hit from lynels except for bs. ", "created_utc": "1493064587.0", "edited": "False", "id": "dgp58bz", "is_submitter": "True", "link_id": "t3_67bkzu", "parent_id": "t1_dgp54c2", "score": "1", "subreddit": "Breath_of_the_Wild", "subreddit_id": "t5_3f1s6"}, {"author": "Cooliceage", "body": "I think the hardest thing would be to make it that they dont have that safety net where you always stay alive on a quarter of a heart if you have full health.", "created_utc": "1493063995.0", "edited": "False", "id": "dgp4oxl", "is_submitter": "False", "link_id": "t3_678ycz", "parent_id": "t1_dgoqmjy", "score": "1", "subreddit": "Breath_of_the_Wild", "subreddit_id": "t5_3f1s6"}, {"author": "Cooliceage", "body": "Make it that master sword and hylian shield are allowed only in hyrule  castle. Makes it more fitting. And the map for fast travailing? Are you going to walk everywhere.", "created_utc": "1493062872.0", "edited": "False", "id": "dgp3ntf", "is_submitter": "False", "link_id": "t3_676oz3", "parent_id": "t1_dgoiom7", "score": "2", "subreddit": "Breath_of_the_Wild", "subreddit_id": "t5_3f1s6"}, {"author": "Cooliceage", "body": "yes. !3 are unlocked through searching.", "created_utc": "1492035258.0", "edited": "False", "id": "dg6no5c", "is_submitter": "False", "link_id": "t3_61fn81", "parent_id": "t1_dfs8ay2", "score": "1", "subreddit": "Breath_of_the_Wild", "subreddit_id": "t5_3f1s6"}, {"author": "Cooliceage", "body": "Nerds together, Nerds forever.", "created_utc": "1490990896.0", "edited": "False", "id": "dfny90w", "is_submitter": "False", "link_id": "t3_62lxke", "parent_id": "t3_62lxke", "score": "6", "subreddit": "Breath_of_the_Wild", "subreddit_id": "t5_3f1s6"}, {"author": "Cooliceage", "body": "I think a small nice addition would be heroes should be guilded during the different stages of the game such as rangers to wep so on. Other wise great guide!", "created_utc": "1490450476.0", "edited": "False", "id": "dfe3rfu", "is_submitter": "False", "link_id": "t3_61fjt5", "parent_id": "t3_61fjt5", "score": "2", "subreddit": "ClickerHeroes", "subreddit_id": "t5_32820"}, {"author": "Cooliceage", "body": "thanks also i wanna know do autoclickers work during a timelapse?\n", "created_utc": "1490133314.0", "edited": "False", "id": "df8hnu8", "is_submitter": "True", "link_id": "t3_60pyhb", "parent_id": "t1_df8dz5x", "score": "1", "subreddit": "ClickerHeroes", "subreddit_id": "t5_32820"}, {"author": "Cooliceage", "body": "How is this NSFW?", "created_utc": "1490038482.0", "edited": "False", "id": "df6ojas", "is_submitter": "False", "link_id": "t3_60f54q", "parent_id": "t3_60f54q", "score": "2", "subreddit": "Breath_of_the_Wild", "subreddit_id": "t5_3f1s6"}, {"author": "Cooliceage", "body": "How? Just how?", "created_utc": "1489966028.0", "edited": "False", "id": "df5ele9", "is_submitter": "False", "link_id": "t3_60co8v", "parent_id": "t3_60co8v", "score": "6", "subreddit": "Breath_of_the_Wild", "subreddit_id": "t5_3f1s6"}, {"author": "Cooliceage", "body": "oh ok. I dont play on playstation which would explain it.", "created_utc": "1489948938.0", "edited": "False", "id": "df501y6", "is_submitter": "False", "link_id": "t3_605cmu", "parent_id": "t1_df4xorz", "score": "1", "subreddit": "Breath_of_the_Wild", "subreddit_id": "t5_3f1s6"}, {"author": "Cooliceage", "body": "Do you mean only achieved once?\n", "created_utc": "1489942645.0", "edited": "False", "id": "df4v2ui", "is_submitter": "False", "link_id": "t3_605cmu", "parent_id": "t1_df4rqkm", "score": "1", "subreddit": "Breath_of_the_Wild", "subreddit_id": "t5_3f1s6"}, {"author": "Cooliceage", "body": "I do like these achievements but some of them should have a gold rupee. Not dying at all is one and and who needs upgrades. Those are definitely gold worthy.", "created_utc": "1489930498.0", "edited": "False", "id": "df4n5wb", "is_submitter": "False", "link_id": "t3_605cmu", "parent_id": "t3_605cmu", "score": "1", "subreddit": "Breath_of_the_Wild", "subreddit_id": "t5_3f1s6"}, {"author": "Cooliceage", "body": "How about Horse Friend, tame a horse. Simple yet good. Either green or red.", "created_utc": "1489874918.0", "edited": "False", "id": "df3vc10", "is_submitter": "False", "link_id": "t3_605cmu", "parent_id": "t3_605cmu", "score": "1", "subreddit": "Breath_of_the_Wild", "subreddit_id": "t5_3f1s6"}, {"author": "Cooliceage", "body": "This reminds me of one of does plants versus zombies comics. I don't know why.\n", "created_utc": "1489840681.0", "edited": "False", "id": "df38ql8", "is_submitter": "False", "link_id": "t3_5zywfv", "parent_id": "t3_5zywfv", "score": "1", "subreddit": "Breath_of_the_Wild", "subreddit_id": "t5_3f1s6"}, {"author": "Cooliceage", "body": "lol I get what you mean ( ͡° ͜ʖ ͡°)", "created_utc": "1489521305.0", "edited": "False", "id": "dexfi20", "is_submitter": "False", "link_id": "t3_5zed4l", "parent_id": "t3_5zed4l", "score": "37", "subreddit": "Breath_of_the_Wild", "subreddit_id": "t5_3f1s6"}, {"author": "Cooliceage", "body": "Why are people always so much better then me at drawing?", "created_utc": "1489360083.0", "edited": "False", "id": "deuju4u", "is_submitter": "False", "link_id": "t3_5z1d4s", "parent_id": "t3_5z1d4s", "score": "4", "subreddit": "Breath_of_the_Wild", "subreddit_id": "t5_3f1s6"}, {"author": "Cooliceage", "body": "Thanks for motivation!", "created_utc": "1489260311.0", "edited": "False", "id": "desyac7", "is_submitter": "False", "link_id": "t3_5yu9b4", "parent_id": "t1_desy8vx", "score": "2", "subreddit": "Breath_of_the_Wild", "subreddit_id": "t5_3f1s6"}, {"author": "Cooliceage", "body": "Fine... Its just I always get screwed over by tests not related to the subject and get a B+", "created_utc": "1489259774.0", "edited": "False", "id": "desxwpt", "is_submitter": "False", "link_id": "t3_5yu9b4", "parent_id": "t1_desxg4j", "score": "1", "subreddit": "Breath_of_the_Wild", "subreddit_id": "t5_3f1s6"}, {"author": "Cooliceage", "body": "I want a switch to bad so i can play breath of the wild. Sadly my mom says i can only get it if i get a perfect an A on my next report card in math. Only reason im trying at this point.", "created_utc": "1489256059.0", "edited": "False", "id": "desv73z", "is_submitter": "False", "link_id": "t3_5ysyc8", "parent_id": "t3_5ysyc8", "score": "12", "subreddit": "Breath_of_the_Wild", "subreddit_id": "t5_3f1s6"}, {"author": "Cooliceage", "body": "true that.", "created_utc": "1489255996.0", "edited": "False", "id": "desv5fu", "is_submitter": "False", "link_id": "t3_5ysyc8", "parent_id": "t1_despdx1", "score": "3", "subreddit": "Breath_of_the_Wild", "subreddit_id": "t5_3f1s6"}, {"author": "Cooliceage", "body": "Wow. How did you do that.", "created_utc": "1489255966.0", "edited": "False", "id": "desv4nn", "is_submitter": "False", "link_id": "t3_5yto51", "parent_id": "t3_5yto51", "score": "3", "subreddit": "Breath_of_the_Wild", "subreddit_id": "t5_3f1s6"}, {"author": "Cooliceage", "body": "ik I have already pasted most of the rangers and by my next trans should be gilding on Moloch. This did anwer my question anyway about the characters post wep. Thanks.", "created_utc": "1488739313.0", "edited": "1488739529.0", "id": "dejkw9f", "is_submitter": "False", "link_id": "t3_5wud3d", "parent_id": "t1_dejjs47", "score": "1", "subreddit": "ClickerHeroes", "subreddit_id": "t5_32820"}, {"author": "Cooliceage", "body": "Oh i have seen that chart i mean i have heard you need liek 1.5k AS souls for madzi and I would like to know how many AS is required for any heroes past the rangers to be any good. Thanks.", "created_utc": "1488736534.0", "edited": "False", "id": "dejixtk", "is_submitter": "False", "link_id": "t3_5wud3d", "parent_id": "t1_dejb5j4", "score": "1", "subreddit": "ClickerHeroes", "subreddit_id": "t5_32820"}, {"author": "Cooliceage", "body": "Demon Clickers - Immortal Damage: 1k - Immortal Level: 28\n\nwould be cool if you joined. New clan.", "created_utc": "1488723424.0", "edited": "False", "id": "dejao1z", "is_submitter": "False", "link_id": "t3_5xicuy", "parent_id": "t3_5xicuy", "score": "1", "subreddit": "ClickerHeroesRecruit", "subreddit_id": "t5_398a0"}, {"author": "Cooliceage", "body": "I just wanted to know at what AS is it required to get every hero past frostleaf(That is actually useful and possible in an efficient run) Thanks!", "created_utc": "1488723018.0", "edited": "False", "id": "dejah8v", "is_submitter": "False", "link_id": "t3_5wud3d", "parent_id": "t3_5wud3d", "score": "1", "subreddit": "ClickerHeroes", "subreddit_id": "t5_32820"}, {"author": "Cooliceage", "body": "I mean a few extra hero levels and primals only add so much. Lets say that every boss from 100-200 was primal then you get maybe 100 which may be good enough for the first trans if you do it over and over again but that seems really tedious. I really dont know it seems a bit much.", "created_utc": "1488496898.0", "edited": "False", "id": "defozlg", "is_submitter": "False", "link_id": "t3_5x6myd", "parent_id": "t1_defojoe", "score": "1", "subreddit": "ClickerHeroes", "subreddit_id": "t5_32820"}, {"author": "Cooliceage", "body": "I mean removing solomon isnt that a bit much. How would people get hero souls before the trans power adds up? I do thing the relics need to be buffed though they are pretty useless. And the fact about all the other ancients being linear is really necessary. Im not to far in the game but they are way to expensive after a few levels that they have no use. But maybe im just stupid and not far enoguh in the game(only 40 AS).", "created_utc": "1488496201.0", "edited": "False", "id": "defoele", "is_submitter": "False", "link_id": "t3_5x6myd", "parent_id": "t3_5x6myd", "score": "2", "subreddit": "ClickerHeroes", "subreddit_id": "t5_32820"}, {"author": "Cooliceage", "body": "Thank you guys so much! This will help me immensely! One more question. how does your trans power increase. Is it for a every AS you get a certain amount or is there a formula. And if so at what rate those it become a time to stop leveling phan and level borb?", "created_utc": "1488487083.0", "edited": "False", "id": "defg2oc", "is_submitter": "False", "link_id": "t3_5wud3d", "parent_id": "t1_dee7dm1", "score": "1", "subreddit": "ClickerHeroes", "subreddit_id": "t5_32820"}, {"author": "Cooliceage", "body": "Why is borb so ineffective at lower As counts? In my last run(I just transcended) I reached my cap 100s of levels before my highest level. Was it because my phan was way to high allowing me to get the the cap to quickly?", "created_utc": "1488416823.0", "edited": "False", "id": "dee6u8q", "is_submitter": "False", "link_id": "t3_5wud3d", "parent_id": "t1_dedutqj", "score": "1", "subreddit": "ClickerHeroes", "subreddit_id": "t5_32820"}, {"author": "Cooliceage", "body": "k thx. I know how to use ancient calcs but i dont use them much because they take away from the game. I have actually already seen those links which you seem to tell to a lot of people(They are useful).  I didnt know about the 8-10 AS souls thing which is really helpful so i am going to trans now! Thanks.", "created_utc": "1488399885.0", "edited": "1488400069.0", "id": "dedsix8", "is_submitter": "False", "link_id": "t3_5wud3d", "parent_id": "t1_dedr8ym", "score": "1", "subreddit": "ClickerHeroes", "subreddit_id": "t5_32820"}, {"author": "Cooliceage", "body": "**Outsiders:** Xyliqil (4), Chor'gorloth (1), Phandoryss (4), Borb (2), Ponyboy (13).\n\n**Ancients:** Morgulis (2.0300e7), Bhaal (5001), Fragsworth (5001), Argaiv (1970), Libertas (1001), Siyalatas (1001), Mammon (900), Mimzee (900), Juggernaut (501), Solomon (500), Nogardnit (400), Atman (17), Bubos (17), Chronos (17), Dogcog (17), Dora (17), Fortuna (17), Vaagur (16), Kumawakamaru (13).\n\n**Not Summoned:** Berserker, Chawedo, Energon, Hecatoncheir, Kleptos, Revolc, Sniperino.\n\n**Gilds:** Ivan (1), Brittany (1), Leon (1), Alexa (2), Broyle (1), Ma Zhu (2), Athena (1), Aphrodite (1), Grant (1), Dread Knight (1), Atlas (18), Banana (1), Lilin (184), Cadmia (1), Alabaster (1).\n\n**Miscs:** AS (30 +8, Unspent: 0); TP (1.346%); HS (56, Spent: 5.3785e7, Sacrificed: 1.5314e6); Highest Zone (This Ascension: 2263, This Transcension: 2263, Ever: 2263); Transcensions (1); Ascensions (This Transcension: 17, Total: 64); Relics Found (This Transcension: 35, Total: 149); Immortal Damage (6.5978e7); Rubies (60); 2x multiplier to all your dmg (Yes); Auto Clickers (2); Achievements (111/161).\n\n**Times:** Since Start (316d 1h 3m); Since Transcension (10d 20h 15m); Since Ascension (1d 19h 20m).\n\n**Event:** Presents (Opened: 0; Unopened: 0); Rewards (Candy Canes: 0; Rubies: 0).\n\n**Total Relic Bonuses:**\n\n* +29.00 Mammon\n* +30.00 Mimzee\n* +13.13 Atman\n* +9.49 Kumawakamaru\n* +14.00 Kleptos\n* +3.22 Revolc\n", "created_utc": "1488397820.0", "edited": "1488399795.0", "id": "dedqill", "is_submitter": "False", "link_id": "t3_5wud3d", "parent_id": "t3_5wud3d", "score": "1", "subreddit": "ClickerHeroes", "subreddit_id": "t5_32820"}, {"author": "Cooliceage", "body": "Somebody else took it somehow. I will put another one that is exactly the same. Btw it is level 18 and in a quick ball", "created_utc": "1486829965.0", "edited": "1486830148.0", "id": "ddm6v23", "is_submitter": "False", "link_id": "t3_5tf098", "parent_id": "t1_ddm6f2q", "score": "1", "subreddit": "pokemontrades", "subreddit_id": "t5_2rmov"}, {"author": "Cooliceage", "body": "IGN:Cooliceage\nRequested:Honedge\nDeposited:Herdier\nMessage:Please trade pokemon with me. Thanks in advance.", "created_utc": "1486829191.0", "edited": "False", "id": "ddm6cll", "is_submitter": "False", "link_id": "t3_5tf098", "parent_id": "t3_5tf098", "score": "1", "subreddit": "pokemontrades", "subreddit_id": "t5_2rmov"}, {"author": "Cooliceage", "body": "are you still doing this?\n", "created_utc": "1486828590.0", "edited": "False", "id": "ddm5ydy", "is_submitter": "False", "link_id": "t3_5td55g", "parent_id": "t3_5td55g", "score": "1", "subreddit": "pokemontrades", "subreddit_id": "t5_2rmov"}, {"author": "Cooliceage", "body": "Would it be possible for you to breed one for me? It would be really helpful!\nI decided on putting a less sniped Pokemon. Oddest thing about before was the entire time i still had the spinarak.\nAnyway here are the stuff\n\nIGN:Cooliceage\nDeposited:Ledian Level 24 and quick ball. Female also\nRequested:Totodile\nMessage:Please trade pokemon with me. Thanks in advance\nIf you don't want to breed one for me that is alright. I thank you for your time and patience anyway.", "created_utc": "1486690295.0", "edited": "False", "id": "ddk1dn1", "is_submitter": "False", "link_id": "t3_5t39u2", "parent_id": "t3_5t39u2", "score": "1", "subreddit": "pokemontrades", "subreddit_id": "t5_2rmov"}, {"author": "Cooliceage", "body": "Oh ok ill switch to something else. Please keep it for me.", "created_utc": "1486689628.0", "edited": "False", "id": "ddk0vvu", "is_submitter": "False", "link_id": "t3_5t39u2", "parent_id": "t3_5t39u2", "score": "1", "subreddit": "pokemontrades", "subreddit_id": "t5_2rmov"}, {"author": "Cooliceage", "body": "IGN:Cooliceage\nRequested:Totadile\nDeposited:Spinarak Level 1 and in a great ball\nMessage:Please trade pokemon with me. Thanks in advance\nSorry for no grubbin i didnt have any.", "created_utc": "1486688791.0", "edited": "False", "id": "ddk09hx", "is_submitter": "False", "link_id": "t3_5t39u2", "parent_id": "t3_5t39u2", "score": "1", "subreddit": "pokemontrades", "subreddit_id": "t5_2rmov"}, {"author": "Cooliceage", "body": "Again no grubbin sorry. Also final trade.\nIGN:Cooliceage\nDeposited:Spinarak\nRequested:Totadile\nMessage:Please trade pokemon with me. Thanks in advance!\n\nThank you so much for doing this and i hope one day i can repay you!", "created_utc": "1486687214.0", "edited": "False", "id": "ddjz2e8", "is_submitter": "False", "link_id": "t3_5t39u2", "parent_id": "t3_5t39u2", "score": "1", "subreddit": "pokemontrades", "subreddit_id": "t5_2rmov"}, {"author": "Cooliceage", "body": "Sorry had no grubbins so i deposited ledyba\nIGN:Cooliceage\nDeposited:Ledyba\nRequested Cyndaquil\nMessage:Please trade pokemon with me\nDont have a favorite pokemon but I like infernape", "created_utc": "1486683639.0", "edited": "1486683995.0", "id": "ddjwbwe", "is_submitter": "False", "link_id": "t3_5t39u2", "parent_id": "t3_5t39u2", "score": "1", "subreddit": "pokemontrades", "subreddit_id": "t5_2rmov"}, {"author": "Cooliceage", "body": "Final request\nIGN:Cooliceage\nDepopsited:lillipup Level 1\nRequested:Charmander Ha\nMessage:Please trade Pokemon with me.", "created_utc": "1486683038.0", "edited": "False", "id": "ddjvvf5", "is_submitter": "False", "link_id": "t3_5t2u76", "parent_id": "t3_5t2u76", "score": "1", "subreddit": "pokemontrades", "subreddit_id": "t5_2rmov"}, {"author": "Cooliceage", "body": "Thank you so much! Now i dont have to play an entire game again!", "created_utc": "1486682284.0", "edited": "False", "id": "ddjvapi", "is_submitter": "True", "link_id": "t3_5t3d6f", "parent_id": "t1_ddjuzrq", "score": "1", "subreddit": "pokemontrades", "subreddit_id": "t5_2rmov"}, {"author": "Cooliceage", "body": "IGN:Cooliceage\nDeposited:Lillipup level 12\nRequested:Marainie  HA please\nMessage:Please trade pokemon with me.", "created_utc": "1486682210.0", "edited": "False", "id": "ddjv8p7", "is_submitter": "False", "link_id": "t3_5t2u76", "parent_id": "t3_5t2u76", "score": "1", "subreddit": "pokemontrades", "subreddit_id": "t5_2rmov"}, {"author": "Cooliceage", "body": "I accidentally didn't have upgrade so got it i now can trade. ", "created_utc": "1486681229.0", "edited": "False", "id": "ddjuhjy", "is_submitter": "True", "link_id": "t3_5t3d6f", "parent_id": "t1_ddjtws8", "score": "1", "subreddit": "pokemontrades", "subreddit_id": "t5_2rmov"}, {"author": "Cooliceage", "body": "sorry i forgot to put an item on the porygon. Im going to cacnel put item and then request again. Cancel again then put dubious disc. Do you have a weavile?\n", "created_utc": "1486680718.0", "edited": "False", "id": "ddju360", "is_submitter": "True", "link_id": "t3_5t3d6f", "parent_id": "t1_ddjtuah", "score": "1", "subreddit": "pokemontrades", "subreddit_id": "t5_2rmov"}, {"author": "Cooliceage", "body": "ok", "created_utc": "1486680496.0", "edited": "False", "id": "ddjtws8", "is_submitter": "True", "link_id": "t3_5t3d6f", "parent_id": "t1_ddjtuah", "score": "1", "subreddit": "pokemontrades", "subreddit_id": "t5_2rmov"}, {"author": "Cooliceage", "body": "actually ill ad you", "created_utc": "1486680297.0", "edited": "False", "id": "ddjtr3o", "is_submitter": "True", "link_id": "t3_5t3d6f", "parent_id": "t1_ddjtpxi", "score": "1", "subreddit": "pokemontrades", "subreddit_id": "t5_2rmov"}, {"author": "Cooliceage", "body": "Ok please add me as a friend", "created_utc": "1486680254.0", "edited": "False", "id": "ddjtpxi", "is_submitter": "True", "link_id": "t3_5t3d6f", "parent_id": "t1_ddjt8ui", "score": "1", "subreddit": "pokemontrades", "subreddit_id": "t5_2rmov"}, {"author": "Cooliceage", "body": "IGN: Cooliceage\nDeposited:Level 14 Lillipup\nRequested:Torchic\nMessage:Please Trade pokemon with me.", "created_utc": "1486680120.0", "edited": "False", "id": "ddjtm2a", "is_submitter": "False", "link_id": "t3_5t2u76", "parent_id": "t3_5t2u76", "score": "1", "subreddit": "pokemontrades", "subreddit_id": "t5_2rmov"}, {"author": "Cooliceage", "body": "Hidden ability alola starters are not currently available. Just to note. The parents or original trainer hacked in one of the starters so its not legitimate.", "created_utc": "1486673122.0", "edited": "False", "id": "ddjnpce", "is_submitter": "False", "link_id": "t3_5t0e4k", "parent_id": "t3_5t0e4k", "score": "1", "subreddit": "pokemontrades", "subreddit_id": "t5_2rmov"}]