[{"author": "Correct-Monk-6761", "body": "Thank you very much, I speak Persian very well and I know I will be understood, but I was specifically interested in what natives use.", "created_utc": "1666498190.0", "edited": "False", "id": "itf3jw5", "is_submitter": "True", "link_id": "t3_ya69dm", "parent_id": "t1_itdijme", "score": "1", "subreddit": "farsi", "subreddit_id": "t5_2t22i"}, {"author": "Correct-Monk-6761", "body": "I thought that the Islamic republic of iran is anti US and anti WEST, yet this video has a background song in American English.\nWhat a great choice for background music😂.", "created_utc": "1666043382.0", "edited": "False", "id": "isq7fbb", "is_submitter": "False", "link_id": "t3_y6h8ol", "parent_id": "t3_y6h8ol", "score": "1", "subreddit": "IslamicRepublicOfIran", "subreddit_id": "t5_5xpcym"}, {"author": "Correct-Monk-6761", "body": "Wow that was crazy hot 🥵", "created_utc": "1665844595.0", "edited": "False", "id": "isf58h9", "is_submitter": "False", "link_id": "t3_wwd5r8", "parent_id": "t3_wwd5r8", "score": "1", "subreddit": "DirtyConfession", "subreddit_id": "t5_36g9k"}, {"author": "Correct-Monk-6761", "body": "I (21, F) feel the same towards one of my professors. He is very intelligent, speaks many languages and is very knowledgeable about things outside of his field as well. \nHe is also very good looking for his age (he is 58, but in fact I thought he is 45). His appearance wasn't what made me attracted to him in the first place (although I think it played a role as well), but I actually fell in love with him as soon as he started lecturing, he is the best teacher I've ever had and he is very passionate about his field.\n\nHe also helped me several times without me asking for anything and I really appreciate it.  I try helping him back so it's mutual and I also don't depend on him in any way (it's prohibited to write our names on exam papers).\nI was also meeting him once a week during the summer vocation, he offered to help me with one subject (I actually didn't request any help and I think he probably just wanted to see me during vocation time as well). I know he doesn't give so much attention to other students and I know he does this because he is also attracted to me, but he is in a different stage of life and we both know it won't work. So, we both try keeping it platonic...", "created_utc": "1665820735.0", "edited": "1665844241.0", "id": "ise5zdz", "is_submitter": "False", "link_id": "t3_xzpoxo", "parent_id": "t3_xzpoxo", "score": "1", "subreddit": "DirtyConfession", "subreddit_id": "t5_36g9k"}, {"author": "Correct-Monk-6761", "body": "Yeah but he firmly denies that 😂.\nI told him several times I know he is Iranian but he denied it every single time.\nThankfully he won't bother me any longer and I didn't kill a lot of time on him: His poor chatting skills got me suspicious right away and once I heard his accent in English, it was totally obvious.\n\nI would actually help him if he just told me that he is iranian and not pretend like he isn't.", "created_utc": "1664997291.0", "edited": "False", "id": "ir6rush", "is_submitter": "True", "link_id": "t3_xweanp", "parent_id": "t1_ir6qf8s", "score": "3", "subreddit": "JudgeMyAccent", "subreddit_id": "t5_2ufiq"}, {"author": "Correct-Monk-6761", "body": "Yeah don't worry we weren't talking for a long time and I only managed to teach him some really basic words in Hebrew before I started to get suspicious...\nWhich was very early on😅.", "created_utc": "1664996666.0", "edited": "False", "id": "ir6q87p", "is_submitter": "True", "link_id": "t3_xweanp", "parent_id": "t1_ir6ouwa", "score": "2", "subreddit": "JudgeMyAccent", "subreddit_id": "t5_2ufiq"}, {"author": "Correct-Monk-6761", "body": "Yeah, I was already sure he isn't American when I posted it, I guess I just wanted a confirmation from sombody else because this gentleman denies everything😅.", "created_utc": "1664994732.0", "edited": "False", "id": "ir6l6mt", "is_submitter": "True", "link_id": "t3_xweanp", "parent_id": "t1_ir6cmnf", "score": "4", "subreddit": "JudgeMyAccent", "subreddit_id": "t5_2ufiq"}, {"author": "Correct-Monk-6761", "body": "My first guess is Persian because I am active in some Persian speaking groups on telegram but my second guess is Arabic.\n\nHe said he wants to learn Hebrew, because he is a Persian jew living in the US and wants to migrate to Israel. He had many mistakes in English so I asked him where was he born and he sais Virginia and that nowadays he lives in California lol😂😂😂😂.\nBut I was suspicious so I asked him to record himself in English (before that he only recorded himself in Hebrew where his accent wasn't as obvious), I confronted him but he denied everything. \n\nIf he was just an ordinary iranian or an arab and would tell me the truth about his origins, I would have helped him in Hebrew. But the fact he is lying to me right from the beginning, makes me worry about his true intentions. So I basically told him to go F...", "created_utc": "1664991110.0", "edited": "False", "id": "ir6bspe", "is_submitter": "True", "link_id": "t3_xweanp", "parent_id": "t1_ir66q0a", "score": "5", "subreddit": "JudgeMyAccent", "subreddit_id": "t5_2ufiq"}, {"author": "Correct-Monk-6761", "body": "I am 99.9% sure he isn't who he claims he is, but I guess I just want a confirmation from someone who lives in that area..", "created_utc": "1664985435.0", "edited": "False", "id": "ir5x026", "is_submitter": "True", "link_id": "t3_xweanp", "parent_id": "t3_xweanp", "score": "5", "subreddit": "JudgeMyAccent", "subreddit_id": "t5_2ufiq"}, {"author": "Correct-Monk-6761", "body": "It is written in the Quran that you can't make someone to believe unless Allah wants that. \nI guess Allah just doesn't want me to believe, apparently he loves it that some people go to hell.", "created_utc": "1664950607.0", "edited": "False", "id": "ir4b56l", "is_submitter": "False", "link_id": "t3_xvljn0", "parent_id": "t1_ir4am5g", "score": "3", "subreddit": "learn_arabic", "subreddit_id": "t5_2v4vi"}, {"author": "Correct-Monk-6761", "body": "There are people who want to learn Arabic because they are surrounded by arab speakers and want to communicate with them, people who live in Arab countries, people who are just curious about the culture, some people might be curious about islam but not be Muslims themselves and they too can have tattoos, eat pork etc. \nEither way, everyone who wants, can have tattoos, it's their right and they are the ones in charge of their own body. This subreddit isn't titled Islam, I personally  want to learn it from other reasons rather than reading the Quran.", "created_utc": "1664949997.0", "edited": "False", "id": "ir4acyd", "is_submitter": "False", "link_id": "t3_xvljn0", "parent_id": "t1_ir40b8n", "score": "4", "subreddit": "learn_arabic", "subreddit_id": "t5_2v4vi"}, {"author": "Correct-Monk-6761", "body": "https://m.calcalist.co.il/Article.aspx?guid=hk9jhozr5", "created_utc": "1664914201.0", "edited": "False", "id": "ir286en", "is_submitter": "False", "link_id": "t3_xubdkg", "parent_id": "t1_ir1z7ot", "score": "1", "subreddit": "NoBiases", "subreddit_id": "t5_74pty1"}, {"author": "Correct-Monk-6761", "body": "I can understand it but you should probably work on it so it will become lighter. I am not a native English speaker, but from what I hear you should probably pay more attention to the sounds \"th\" like in the word think, \"th\" like in the, and your sh and s sound extremely close to each other when you pronounce them. It's like you have a sound in between s and sh that you use for both, try to make them more distinguishable.", "created_utc": "1664807969.0", "edited": "False", "id": "iqvzi0k", "is_submitter": "False", "link_id": "t3_xuke81", "parent_id": "t3_xuke81", "score": "2", "subreddit": "JudgeMyAccent", "subreddit_id": "t5_2ufiq"}, {"author": "Correct-Monk-6761", "body": "And by the way, from my home in petah tikva, if I wanted to go on Saturday to the beach I would have to go for 50 minutes by foot just to get to the nearest bus stop which has a bus working on saturdays.", "created_utc": "1664785026.0", "edited": "False", "id": "iquyv14", "is_submitter": "False", "link_id": "t3_xtxtz5", "parent_id": "t1_iqux12t", "score": "2", "subreddit": "Israel", "subreddit_id": "t5_2qhvo"}, {"author": "Correct-Monk-6761", "body": "https://www.israelhayom.co.il/business/article/13006092?amp=1", "created_utc": "1664784763.0", "edited": "False", "id": "iquykp7", "is_submitter": "False", "link_id": "t3_xtxtz5", "parent_id": "t1_iqux12t", "score": "3", "subreddit": "Israel", "subreddit_id": "t5_2qhvo"}, {"author": "Correct-Monk-6761", "body": "There are two scenarios basically:\nThe protestors will be massacred like in previous protests, then the protests will decrease in size and gradually stop.\n\nThe second scenario of a revolution is probably likely only if the forces that should control the riots will start to loose their faith in the government as well and I actually see some signs of it.. \nPeople who go to the riot police do it from either one of two reasons\n1. They are totally brainwashed.\n2. There are not so many vacant jobs in Iran so they go there for money.\n\nThe regime's propoganda is very ineffective and  people have access to western media.\nBlocking websites didn't work because people have VPNs, satellite tv is very commonplace even though it's illegal..\nSo the amount of totally brainwashed people is definitely not growing and among them some switch sides to the side of the protestors, but not many since they have been brainwashed for a really long time.\n\nThe people who do it for money are likely to try avoid orders, or perform them with delays..\nThe irgc is probably the biggest force the Iranian protestors might encounter, but many of the people serving there are doing so because military service is mandatory in Iran and they were assigned to serve there. These young men, aren't necessarily pro regime and many of the soldiers who are there because of mandatory service, might also avoid orders, not do them well etc..\n\nProtestors are also getting more violent with time, they are making Molotov cocktails and throw them at the police forces to defend themselves, they try grabbing weapons from riot police officers, they might try killing the officers if they have an advantage in numbers... It became a very dangerous job and some won't like to continue doing it because of the higher risk for their life.\n\nSo far I believe the cracks inside the ranks of the riot police, irgc and other forces are too small for a revolution from within... But, these protests might be the beginning of the end of the Islamic republic.", "created_utc": "1664784626.0", "edited": "False", "id": "iquyfhz", "is_submitter": "False", "link_id": "t3_xlu23j", "parent_id": "t3_xlu23j", "score": "1", "subreddit": "Israel", "subreddit_id": "t5_2qhvo"}, {"author": "Correct-Monk-6761", "body": "The vast majority in Israel want public transportation on Saturdays but it isn't widely implemented or accessible yet. I can't go from petah tikva to the beach on sabbath unless I have a car or take a taxi, and this is mostly because of a small minority that doesn't work or contribute to society.\nAre you sure we are a western democracy?", "created_utc": "1664782517.0", "edited": "False", "id": "iquw2ey", "is_submitter": "False", "link_id": "t3_xtxtz5", "parent_id": "t1_iquunt7", "score": "5", "subreddit": "Israel", "subreddit_id": "t5_2qhvo"}, {"author": "Correct-Monk-6761", "body": "Both orthodox judaism and islam see the woman's sexuality in particular as a threat. \nBut there is a major difference: most of the people in Iran are against mandatory hijab (even among religious iranians many think it shouldn't be mandatory) and they won't attack you on the streets for not wearing the hijab properly. The morality police will. In mea shearim it's the opposite, you won't go to jail for wearing a short skirt in mea shearim but the people there might attack you and harm you. So, it's exactly the opposite to the situation in Iran.", "created_utc": "1664781131.0", "edited": "False", "id": "iquui5h", "is_submitter": "False", "link_id": "t3_xtxtz5", "parent_id": "t3_xtxtz5", "score": "1", "subreddit": "Israel", "subreddit_id": "t5_2qhvo"}, {"author": "Correct-Monk-6761", "body": "I consume a lot of media in my 4th language and use it for chatting with my friends, but it's very uncommon that I stumble upon a native speaker of this language here where I live. Talking to a native speaker in the real world for the very first time, was very intimidating for me...\n I felt really nervous and excited at the same time, I think my hands were even shaking a bit afterwards.\n\nI think that I would probably feel the same in one of my mother tongues only if I gave a public speech with no preparation. I think maybe his fatigue comes from nervousness and/or excitement...", "created_utc": "1664780251.0", "edited": "False", "id": "iquth30", "is_submitter": "False", "link_id": "t3_xmqffn", "parent_id": "t1_ippyacp", "score": "1", "subreddit": "polyglot", "subreddit_id": "t5_2reiv"}, {"author": "Correct-Monk-6761", "body": "I love playing with the things he is wearing on him: Before starting a handjob or a blowjob I often rub the guy's jeans with my hand where his cock is while I kiss him on the lips/ear/neck.. After he is shirtless I gradually start moving down with the kisses (chest, nipples, abdomen, lower abdomen), then I open the buttons of his pants, unzip the zipper, pull the pants down (or he pulls, it's doesn't matter) and start kissing his underwear.\nI focus my kisses where the head is and it's kinda hot that only a thin fabric is separating between my lips and his most sensitive area.... Sometimes I kiss through the underwear very gently, sometimes I behave like a savage tiger (You can by the way try to pull down the underwear with your teeth in order to reveal his head)..\nThen I take only his cock out and start gently licking where the head meets the rest of his organ for a minute or two, you can also massage the head with a well lubricated hand instead and just continue from there..\n\nBy the way, I love giving oral and I think I enjoy giving it more than receiving. It can be enjoyable for the woman too, but you should first of all overcome your mental blocks.. Try getting used to oral gradually and don't rush, start with kissing and licking him there, then try sucking only the head, then you can try some more if it goes well..\n\nWhat I have going in my head is: The man you love fully trusts you to lets you kiss, lick and suck the most sensitive parts of his body. This level of trust in another person already makes it extremely intimate.. For me, it's a much gentler and more romantic act than what porn usually portrays, and I get hot from giving the man pleasure.\n\nYou don't have to make him orgasm every single time (especially since you need time to get used to the feeling of having something in your mouth) at first just try making it a part of the foreplay before PIV or another sexual activity. I usually feel more relaxed if I know it's just a part of the foreplay and it's not the main event. \n\nWhat I love about giving oral is that I can do everything in my own pace and tell the man: \"don't move at all, just lie on your back and let me do what I want to do with you.\" \nA good oral by the way doesn't have to be deep, I usually put one hand on the balls (and massage them) and another one on the shaft.. The one on the shaft gives men the feeling like it is fully inside your mouth and you should move it roughly in the same pace as the mouth and also move the wrist in a twisting motion as you go up and down.. \nIf the man is moaning it makes me even hotter and want to continue.. \n\nJust focus on these positive feelings: focus on how enjoyable it is for both of you and on how romantic and sensual it is.", "created_utc": "1664739711.0", "edited": "False", "id": "iqsi0xv", "is_submitter": "False", "link_id": "t3_xtuxmg", "parent_id": "t3_xtuxmg", "score": "1", "subreddit": "sex", "subreddit_id": "t5_2qh3p"}, {"author": "Correct-Monk-6761", "body": "I was talking about Corduwener actually..", "created_utc": "1664596112.0", "edited": "False", "id": "iql3mjn", "is_submitter": "True", "link_id": "t3_xr61vj", "parent_id": "t1_iqg3vcb", "score": "1", "subreddit": "unpopularopinion", "subreddit_id": "t5_2tk0s"}, {"author": "Correct-Monk-6761", "body": "Я не против полиглотов как людей, я против самого слова \"полиглот\" потому что оно очень часто применяется необразованными людьми которые хотят похвастаться либо заработать.\n\nאני פשוט באמת לא סובלת את המילה הזאת! בימינו כל אחד יכול להשתמש בה בלי קשר לרמת הידע שלו וזה מה שמעצבן אותי! אבל לפחות החולי הזה לא הגיע לשפה העברית לשמחתינו, אני אפילו לא בטוחה כיצד לומר פוליגלוט בעברית, רב לשוני? פשוט הניחוש הבא שלי \"רב-שפתן\" נשמע לי כמו שם של מפלצת עם המון פיות 😂.\n\nراستی، همچنین فارسی بلدم ولی فارسی من داغون هست به نظرم. اما این مهم نیست چون دانشجویان من اشتباهاتم رو متوجه نمی‌شوند و فکر میکنم که اگر ۲ کلمه بیشتر از دانشجویان بدونم، این کافی هست 😜 (نگران نباش، شوخی میکنم).\n\nTo summarize, I know that real polyglots exist, I can't deny my own existence unless we all live in a matrix and then we all don't exist 😂. \nI just hate that this word is more often used by people who want to brag or scam, rather than actual polyglots who are usually more humble. So this word became pretty much useless. I would rather spend my time learning and practicing languages, instead of advertising some useless courses and writing everywhere that \"I am a polyglot\". I think most of my friends don't even know how many languages nor which languages do I speak😅.", "created_utc": "1664478231.0", "edited": "False", "id": "iqeiloj", "is_submitter": "True", "link_id": "t3_xr61vj", "parent_id": "t1_iqddl68", "score": "3", "subreddit": "unpopularopinion", "subreddit_id": "t5_2tk0s"}, {"author": "Correct-Monk-6761", "body": "Because it's the most important sentence! Imagine you are in Spain and suddenly, you need to ask for directions, or you are feeling sick and want to ask for help, or maybe you just want to impress a Spanish lady... Just use this sentence and the situation will instantly improve! 😂", "created_utc": "1664471901.0", "edited": "False", "id": "iqe2ewb", "is_submitter": "True", "link_id": "t3_xr61vj", "parent_id": "t1_iqdm2rm", "score": "2", "subreddit": "unpopularopinion", "subreddit_id": "t5_2tk0s"}, {"author": "Correct-Monk-6761", "body": "Thank you for your detailed answer. I actually enjoy it when a language teacher uses only the target language right from the beginning and uses repetition and gestures to explain what he/she wants.. But now I understand that some students might feel intimidated and frustrated by that.\nI will take it into consideration.\nOf course I will use stories that are suitable for their level and same with other content. Sadly, I probably won't compare tortillas with them because unfortunately I don't speak Spanish yet, only 🇮🇷🇺🇲🇷🇺🇮🇱 and some 🇸🇦🇫🇷.", "created_utc": "1663879373.0", "edited": "1663879646.0", "id": "ipinole", "is_submitter": "True", "link_id": "t3_xl7vco", "parent_id": "t1_ipia641", "score": "2", "subreddit": "Teachers", "subreddit_id": "t5_2qqcs"}, {"author": "Correct-Monk-6761", "body": "Yeah I really enjoy it, but Persian is still my favorite 😜", "created_utc": "1663594816.0", "edited": "False", "id": "ip29tt3", "is_submitter": "False", "link_id": "t3_xhgg9d", "parent_id": "t1_ip29oeu", "score": "2", "subreddit": "polyglot", "subreddit_id": "t5_2reiv"}, {"author": "Correct-Monk-6761", "body": "I disagree, knowing more than one language broadens your horizons. Monolingual speakers tend to stay within the boundaries of their own culture and the history of their own country.\n\nAlso, maintaining 3 languages on a high level into adulthood definitely takes some effort even if you had learned them as a child:\nI had some friends who migrated from Russia when they were 6-8 years old and their Russian is extremely poor, because they didn't put any effort into maintaining their Russian into adulthood.", "created_utc": "1663582340.0", "edited": "False", "id": "ip1nqth", "is_submitter": "False", "link_id": "t3_v2r4tx", "parent_id": "t3_v2r4tx", "score": "1", "subreddit": "unpopularopinion", "subreddit_id": "t5_2tk0s"}, {"author": "Correct-Monk-6761", "body": "I am currently learning Arabic as a total beginner and still try working on my Persian, I actually thought I would confuse the two a lot but it turns out that since my persian is already pretty good learning Arabic doesn't hinder my progress in it and vice versa.\n\nI think though, if I would learn them together as a total beginner I will start confusing the two..", "created_utc": "1663578984.0", "edited": "False", "id": "ip1jqay", "is_submitter": "False", "link_id": "t3_xhgg9d", "parent_id": "t3_xhgg9d", "score": "2", "subreddit": "polyglot", "subreddit_id": "t5_2reiv"}, {"author": "Correct-Monk-6761", "body": "I think you should tell her, I had the opposite situation (I fell in love in a professor) and felt much better after I told him, even though it was impossible to fulfill my desire. Even if you don't intend doing anything to pursue her, it's worth telling just for the relief it will bring to you and you will also find out are your feelings mutual or not.\nI think it's possible that she feels the same about you.", "created_utc": "1663572655.0", "edited": "False", "id": "ip1cfdm", "is_submitter": "False", "link_id": "t3_w3wtcx", "parent_id": "t3_w3wtcx", "score": "1", "subreddit": "tifu", "subreddit_id": "t5_2to41"}, {"author": "Correct-Monk-6761", "body": "چه خبر؟ فارسی بلدی؟", "created_utc": "1663424078.0", "edited": "False", "id": "iosrpu3", "is_submitter": "False", "link_id": "t3_x89b4t", "parent_id": "t3_x89b4t", "score": "1", "subreddit": "casualiama", "subreddit_id": "t5_2sxwp"}, {"author": "Correct-Monk-6761", "body": "Yeah you are totally right. Israel is absolutely not like Iran, which is very well known for its great treatment towards Arabs, Azeris, Afghans and other minorities. Not to mention all the religious freedom Iran gives to its citizens and its fair treatment towards zoroastrians, jews and christians...", "created_utc": "1663267494.0", "edited": "False", "id": "iokczoa", "is_submitter": "False", "link_id": "t3_xehxrx", "parent_id": "t1_iojmxfp", "score": "-1", "subreddit": "iranian", "subreddit_id": "t5_2s9nc"}, {"author": "Correct-Monk-6761", "body": "باشه برادرم، عصبانی نباش، عاشقتم از اسرائیل 😘😜", "created_utc": "1663266935.0", "edited": "False", "id": "iokbkq2", "is_submitter": "False", "link_id": "t3_xehxrx", "parent_id": "t1_iojnhz9", "score": "1", "subreddit": "iranian", "subreddit_id": "t5_2s9nc"}, {"author": "Correct-Monk-6761", "body": "Stuart is not a typical jewish family name, but Joshua is actually an ancient jewish name or as you should say it in Hebrew Yehoshu'a. As many ancient jewish names it has a meaning and consists of two words: yeho+shua it means \"god will save\" or \"god's salvation\". Hebrew is a semitic language which is somewhat similar to Arabic and Aramaic.\nThis name came into English from the old testament. Anyways, it's such an old Jewish name that it would be like saying \"oh Esfandiyar sounds so American\", if esfandiyar would ever become a popular name in America...", "created_utc": "1663256706.0", "edited": "False", "id": "iojl6g4", "is_submitter": "False", "link_id": "t3_xehxrx", "parent_id": "t1_ioiusuz", "score": "-1", "subreddit": "iranian", "subreddit_id": "t5_2s9nc"}, {"author": "Correct-Monk-6761", "body": "It doesn't matter how old it is, you just sound ignorant for not accepting the facts. Israel is a country, it has its own government, citizens, religion and language. If there is no Israel, then what is it?  Palestine with a Jewish Majority? 😂", "created_utc": "1663245382.0", "edited": "False", "id": "ioiu3k3", "is_submitter": "False", "link_id": "t3_xehxrx", "parent_id": "t1_ioitrn4", "score": "2", "subreddit": "iranian", "subreddit_id": "t5_2s9nc"}, {"author": "Correct-Monk-6761", "body": "Then Russia isn't a country, I mean, I agree with you to some extent about Israel ruling over Palestinians, but Israel is a recognized country.", "created_utc": "1663244978.0", "edited": "False", "id": "ioitamc", "is_submitter": "False", "link_id": "t3_xehxrx", "parent_id": "t1_ioisy3r", "score": "1", "subreddit": "iranian", "subreddit_id": "t5_2s9nc"}, {"author": "Correct-Monk-6761", "body": "USA is not a country, look what they did to the native Americans..", "created_utc": "1663244383.0", "edited": "False", "id": "iois5ad", "is_submitter": "False", "link_id": "t3_xehxrx", "parent_id": "t1_ioipcqt", "score": "2", "subreddit": "iranian", "subreddit_id": "t5_2s9nc"}, {"author": "Correct-Monk-6761", "body": "Israelis do want to compete with iranians and it's really unfortunate that the Iranian athletes on the other hand, are forced to loose or migrate whenever they have to face against our sportsmen...", "created_utc": "1663244229.0", "edited": "False", "id": "ioiruvr", "is_submitter": "False", "link_id": "t3_xehxrx", "parent_id": "t3_xehxrx", "score": "3", "subreddit": "iranian", "subreddit_id": "t5_2s9nc"}, {"author": "Correct-Monk-6761", "body": "I am Israeli and I love Iran! \nI really love the Iranian culture and music\n و همچنین همیشه زبان فارسی رو دوست داشتم چون این خیلی عاشقانه و زیباست به نظرم🥰.\nbut I think most Israelis are absolutely ignorant about Iran, and even if they aren't ignorant, they would be hesitant talking to Iranians because they fear it might get the Iranian person into trouble or because they fear this iranian might be working for the iranian intelligence...\nAnyways, I think all the hate you might encounter comes only from ignorance, there are no reasons for our people to hate each other.", "created_utc": "1663243096.0", "edited": "False", "id": "ioipq5f", "is_submitter": "False", "link_id": "t3_xebk9z", "parent_id": "t3_xebk9z", "score": "1", "subreddit": "iranian", "subreddit_id": "t5_2s9nc"}, {"author": "Correct-Monk-6761", "body": "To learn about another culture is my biggest reason, going out of my comfort zone and discovering something new is my favorite part of it.", "created_utc": "1662864841.0", "edited": "False", "id": "inxuewa", "is_submitter": "False", "link_id": "t3_xav23r", "parent_id": "t3_xav23r", "score": "2", "subreddit": "polyglot", "subreddit_id": "t5_2reiv"}, {"author": "Correct-Monk-6761", "body": "I am in a somewhat similar situation: my university professor and I are way closer than we probably should be, I soon fell in love with him and told him about my feelings and he said he feels something similar to me as well.. But sadly we can't be in a relationship from various reasons, so, we are just \"friends\" at this point and nothing sexual have ever happened between us (yet).\n\nAt the end of the day, you are 2 adults and feel happy with each other, I don't think it's problematic, don't listen to anybody and enjoy your life together.\nI would probably do the same if I had the opportunity...", "created_utc": "1662781630.0", "edited": "False", "id": "intd533", "is_submitter": "False", "link_id": "t3_wzz3ch", "parent_id": "t3_wzz3ch", "score": "1", "subreddit": "TrueOffMyChest", "subreddit_id": "t5_2yuqy"}, {"author": "Correct-Monk-6761", "body": "Learn Russian, a slight American accent sounds really sexy in it (but a big one sounds horrible).", "created_utc": "1662716576.0", "edited": "False", "id": "inpg0kz", "is_submitter": "False", "link_id": "t3_x9fjgw", "parent_id": "t3_x9fjgw", "score": "35", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Correct-Monk-6761", "body": "I wouldn't jump to conclusions yet, maybe she just wanted to compliment you or to start a conversation..", "created_utc": "1662183420.0", "edited": "False", "id": "imw71em", "is_submitter": "False", "link_id": "t3_x0uwki", "parent_id": "t3_x0uwki", "score": "1", "subreddit": "sex", "subreddit_id": "t5_2qh3p"}, {"author": "Correct-Monk-6761", "body": "I think many have a favorite way to kiss and a favorite lip..\nIt doesn't mean you're a bad kisser, it's just your preferred way of kissing and you are used to it so probably it felt weird because of that.", "created_utc": "1662156310.0", "edited": "False", "id": "imuqkfq", "is_submitter": "False", "link_id": "t3_vfo90q", "parent_id": "t3_vfo90q", "score": "1", "subreddit": "sex", "subreddit_id": "t5_2qh3p"}, {"author": "Correct-Monk-6761", "body": "Honestly I have never thought about that. I guess I just got used to all the different genders so much that I don't actively ever think about that but rather go with my gut feeling. \nI don't really worry about remembering the genders of each and every single word I encounter...\nI know it will come to me with time with enough exposure.", "created_utc": "1661924039.0", "edited": "False", "id": "imhk1g4", "is_submitter": "False", "link_id": "t3_uut4l6", "parent_id": "t3_uut4l6", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Correct-Monk-6761", "body": "I'm from Israel and I am sick of: \"Why are you killing Palestinians?\"\nI personally didn't kill anyone and it's kinda like if I would say to arabs \"why do you have sex slaves?\" \n(ISIS has sex slaves)..\nI had Palestinian friends, I work with Israeli arabs on my work and have nothing against them, but some guy from marroco thinks he can just say bad things about my country without knowing me, my views, nor the actual situation here!", "created_utc": "1661834887.0", "edited": "1661835202.0", "id": "imclldl", "is_submitter": "False", "link_id": "t3_x0z81c", "parent_id": "t3_x0z81c", "score": "5", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Correct-Monk-6761", "body": "Reading, listening to music, communicating with natives, watching movies..", "created_utc": "1661833836.0", "edited": "False", "id": "imcjxgb", "is_submitter": "False", "link_id": "t3_wx9rxg", "parent_id": "t1_imbbc2e", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Correct-Monk-6761", "body": "Never used Duolingo so I guess I don't care..", "created_utc": "1661796237.0", "edited": "False", "id": "ima9q15", "is_submitter": "False", "link_id": "t3_wx9rxg", "parent_id": "t3_wx9rxg", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Correct-Monk-6761", "body": "I think I lost you here, people acquire grammar intuitively from exposure.\nI sincerely think language learners shouldn't spend time learning grammar, I know some might enjoy it when they have a set of rules right from the beginning and it's fine. If you enjoy it, go for it.\nBut generally speaking, your brain is gonna notice these patterns anyways so learning all the grammatical structures and rules deliberately, is pretty useless.", "created_utc": "1661794512.0", "edited": "False", "id": "ima5c88", "is_submitter": "False", "link_id": "t3_x0csoi", "parent_id": "t1_im9zdaj", "score": "-6", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Correct-Monk-6761", "body": "Start eating healthy and stop drinking, if you go to the gym but still live an unhealthy lifestyle its benefits will be very limited..", "created_utc": "1661779793.0", "edited": "False", "id": "im95etu", "is_submitter": "False", "link_id": "t3_x0k2oz", "parent_id": "t3_x0k2oz", "score": "1", "subreddit": "TooAfraidToAsk", "subreddit_id": "t5_2ssp7"}, {"author": "Correct-Monk-6761", "body": "I hope so (I am currently learning my 5th), but I also use all of them daily without any difficulty:\nRussian with my parents, Hebrew at work, English for general things and studying, and Persian with my friends or just to have fun whenever I have the time (watching movies, listening to music)...\nI am also trying to learn a fifth language so practically I am using all 5 almost every single day..\n\nBut I think that once you get pretty fluent in a language, you won't forget it easily.. So, even if you will use them once or twice a week on average, it might be enough in order to keep them alive and prevent them from deteriorating.", "created_utc": "1661779291.0", "edited": "False", "id": "im94ctv", "is_submitter": "False", "link_id": "t3_wzx5k4", "parent_id": "t3_wzx5k4", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Correct-Monk-6761", "body": "I speak 4 languages fluently without knowing their grammar (Russian, Hebrew, English and Persian). I think that if you got enough exposure you would speak well.\nStudying the grammar may help, but it is usually unnecessary in my opinion.", "created_utc": "1661777851.0", "edited": "False", "id": "im91cm3", "is_submitter": "False", "link_id": "t3_x0csoi", "parent_id": "t1_im90o72", "score": "-1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Correct-Monk-6761", "body": "Myth: you should focus on grammar at some point.\nReality: grammar may help some people but it's usually unnecessary.", "created_utc": "1661768765.0", "edited": "False", "id": "im8mguw", "is_submitter": "False", "link_id": "t3_x0csoi", "parent_id": "t3_x0csoi", "score": "-5", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Correct-Monk-6761", "body": "Am I the only one who finds it disturbing that you are reading his text messages?\nI think you have some trust issues... I don't tell people about the people I meet daily on my work or university, it isn't strange, I just think most people won't understand things related to my work or university anyways.\nHe said he has nothing with her nowadays, I think you should believe him.", "created_utc": "1661011422.0", "edited": "False", "id": "il2wurb", "is_submitter": "False", "link_id": "t3_wo3lnk", "parent_id": "t3_wo3lnk", "score": "-13", "subreddit": "TrueOffMyChest", "subreddit_id": "t5_2yuqy"}, {"author": "Correct-Monk-6761", "body": "I often orgasm more times than he does in a single session, there are many ways to make a woman get there without using a penis😅. I love it when he makes me orgasm by giving oral before penetration and then I don't care that much if I orgasm during penetration or not. To be honest I don't think it's important to orgasm every single penetration, it depends on what do we do and what is our mood.", "created_utc": "1660934047.0", "edited": "1660934912.0", "id": "ikyujan", "is_submitter": "False", "link_id": "t3_w5zl9d", "parent_id": "t1_ikyo73y", "score": "3", "subreddit": "positivelypremature", "subreddit_id": "t5_4qam2b"}, {"author": "Correct-Monk-6761", "body": "I am talking about learning a second language :/", "created_utc": "1660471295.0", "edited": "False", "id": "ik8j3nj", "is_submitter": "False", "link_id": "t3_wn8ve4", "parent_id": "t1_ik7zp24", "score": "1", "subreddit": "unpopularopinion", "subreddit_id": "t5_2tk0s"}, {"author": "Correct-Monk-6761", "body": "These are things I personally experienced except for the Hebrew one, but I have foreign friends who are currently trying to learn Hebrew.\n\nActually I live in Israel, which is surrounded by Arab countries and has a large Arab minority within it.\nBut I heard that Arabic isn't a useful language even from my own parents...\n\nMy favorite language, Persian, is treated even worse than Arabic here. I actually sometimes find it easier to lie that I have Iranian roots rather than explaining why did I learn \"the language of the enemy\".\n\nThe treatment of Russian isn't as bad as with Arabic or Persian, but still it isn't desirable and its image became even worse after the conflict with Ukraine.\n\nIt feels to me like the only language worth studying in the public opinion is English, they aren't afraid to recklessly label other languages as useless..", "created_utc": "1660416746.0", "edited": "1660417269.0", "id": "ik5snnd", "is_submitter": "False", "link_id": "t3_wn8ve4", "parent_id": "t1_ik5hacm", "score": "1", "subreddit": "unpopularopinion", "subreddit_id": "t5_2tk0s"}, {"author": "Correct-Monk-6761", "body": "It won't necessarily bring you more money, but it will be useful for expanding your knowledge, passing leisure time (by reading or watching movies in that language), finding new friends and other things... Some opportunities might literally fall down from the sky and you can't predict these, but with things like watching content in the language you like, you can choose whether to do this or not. And if you end up using it, by your own will or due to circumstances, it's useful in my opinion.\n\nI don't work with tourists yet on average, I am using 4-5 different languages every single day and I absolutely can't imagine my life without using all these languages. Sometimes I must do certain activities in certain languages (like talking to my parents in Russian), and on the other hand there are activities I love too much to give up upon, like listening to Iranian music in Persian.\nSo it's partially from choice and partially a necessity, but every single language I have learned was very useful for me even if I initially didn't expect that.", "created_utc": "1660408964.0", "edited": "False", "id": "ik59w2l", "is_submitter": "False", "link_id": "t3_wn8ve4", "parent_id": "t1_ik4zljn", "score": "4", "subreddit": "unpopularopinion", "subreddit_id": "t5_2tk0s"}, {"author": "Correct-Monk-6761", "body": "I thought Persian would be pretty useless for me and I initially wanted to learn it only for its music. But in reality, there is so much media and content in Persian: both Iranian and American content that I would have to pay for if I didn't know Persian (Iran doesn't care about copyright rights, yey!).\nIt also broadens the horizons because you learn about another country's culture and history and also get to know more people. \nWhy wouldn't you consider learning a foreign language just to broaden the horizons and learn some new things? \n\nBy the way, I can't travel to Iran and I also don't plan traveling to Tajikistan. I have visited Germany several times, but I never needed to use German there because most speak English or Russian... I think travelling is probably a weak motivation to learn a new language unless you go somewhere frequently on a somewhat regular basis, or the native population doesn't speak English.", "created_utc": "1660405110.0", "edited": "False", "id": "ik50r90", "is_submitter": "False", "link_id": "t3_wn8ve4", "parent_id": "t1_ik4osfp", "score": "2", "subreddit": "unpopularopinion", "subreddit_id": "t5_2tk0s"}, {"author": "Correct-Monk-6761", "body": "I know Hebrew and the text that describes this miracle definitely says wine.", "created_utc": "1660391549.0", "edited": "False", "id": "ik49gj4", "is_submitter": "False", "link_id": "t3_w5nhvg", "parent_id": "t3_w5nhvg", "score": "1", "subreddit": "TrueUnpopularOpinion", "subreddit_id": "t5_lrajx"}, {"author": "Correct-Monk-6761", "body": "Continue using it with her and eventually it will improve.", "created_utc": "1660356062.0", "edited": "False", "id": "ik2sv3o", "is_submitter": "False", "link_id": "t3_wm5z8g", "parent_id": "t1_ik0mwww", "score": "1", "subreddit": "farsi", "subreddit_id": "t5_2t22i"}, {"author": "Correct-Monk-6761", "body": "Did you think about using Persian with your fiance at home? I try using only persian with my iranian friends.", "created_utc": "1660274328.0", "edited": "False", "id": "ijy5zut", "is_submitter": "False", "link_id": "t3_wm5z8g", "parent_id": "t3_wm5z8g", "score": "4", "subreddit": "farsi", "subreddit_id": "t5_2t22i"}, {"author": "Correct-Monk-6761", "body": "It doesn't happen to me very often but I think it's natural to mix them sometimes..", "created_utc": "1660167880.0", "edited": "False", "id": "ijryat9", "is_submitter": "False", "link_id": "t3_wj87el", "parent_id": "t3_wj87el", "score": "1", "subreddit": "polyglot", "subreddit_id": "t5_2reiv"}, {"author": "Correct-Monk-6761", "body": "You can still become a polyglot if you really want that, it will take you many years but it's definitely possible.\nBut you should also consider that learning a language is not a sprint but a marathon, so you should have a great motivation to learn this or that language besides \"becoming a polyglot\".\nMotivation is everything.", "created_utc": "1660105870.0", "edited": "False", "id": "ijofnej", "is_submitter": "False", "link_id": "t3_wjsz47", "parent_id": "t3_wjsz47", "score": "3", "subreddit": "polyglot", "subreddit_id": "t5_2reiv"}, {"author": "Correct-Monk-6761", "body": "Probably making friends with native speakers or hiring a private tutor is your best bet...", "created_utc": "1659943263.0", "edited": "False", "id": "ijewmrq", "is_submitter": "False", "link_id": "t3_wizjlo", "parent_id": "t3_wizjlo", "score": "3", "subreddit": "farsi", "subreddit_id": "t5_2t22i"}, {"author": "Correct-Monk-6761", "body": "I love putting stickers on different objects around the house with their name in my target language, it helps me to learn some vocabulary without putting too much effort into it. I used it in Persian in the past and I am also currently using it in Arabic. I also have a small notebook for writing down interesting words that I think are difficult to remember, but I don't use it very often, I don't like obsessively writing every single new word I hear and usually try absorbing vocabulary naturally.\n\nI also enjoy reading: I love starting from children's books and gradually increasing the difficulty till I can read news and more serious books in my target language. There is a website, storybooks Canada, with children books in many languages, it also has recordings made by native speakers so it's pretty awesome for complete beginners in almost any language 😅 \n\nI usually enjoy watching movies or videos rather than listening to podcasts. \nBut I don't like it when I can't understand anything so I start from some easy content, often children's content and gradually try watching more complex things. \n\nI absolutely love listening to music! But if I can't find a singer I like, I might not do that: I didn't listen to songs in English lol...", "created_utc": "1659810303.0", "edited": "False", "id": "ij7qx93", "is_submitter": "False", "link_id": "t3_whqo6z", "parent_id": "t3_whqo6z", "score": "4", "subreddit": "polyglot", "subreddit_id": "t5_2reiv"}, {"author": "Correct-Monk-6761", "body": "You can try other middle eastern languages and there are many to choose from:\nTurkish, Persian, Urdu, Arabic, Kurdish... I personally think that Persian is the closest to English in its grammar and it's also very nice that objects have no genders in Persian. So, I would suggest you looking towards Persian if you want a language that is both middle eastern, rich, beautiful and closer to English.", "created_utc": "1659677661.0", "edited": "False", "id": "ij0oj9k", "is_submitter": "False", "link_id": "t3_wcyol6", "parent_id": "t1_iiyzeef", "score": "2", "subreddit": "polyglot", "subreddit_id": "t5_2reiv"}, {"author": "Correct-Monk-6761", "body": "You just should find something else that gives you pleasure and hopefully the sensitivity of both your brain and organ will get better after you will stop with the porn and masturbation for some time.\nYou are still young and you will recover...\nI am a girl and, I can actually do it even ten times a day if I want and I have the sex drive to do so..\nBut usually I just think that other things that give me pleasure are a better way to feel good about myself, than getting 10 orgasms and then feeling exhausted by that. I still need about 1-2 times a day to satisfy my high sex drive, but it is like 5 minutes a day at most and it helps me staying in a good mood.\n\nAfter you will find some other passion in your life and quit porn, you can start building healthier relationship with your own body.\nYour way of masturbation isn't necessarily bad, many men masturbate like that, but you should do it in moderation so it will improve your quality of life, not damages it.", "created_utc": "1659594017.0", "edited": "False", "id": "iivu6f4", "is_submitter": "False", "link_id": "t3_wfjvlj", "parent_id": "t1_iivrxw7", "score": "2", "subreddit": "TrueOffMyChest", "subreddit_id": "t5_2yuqy"}, {"author": "Correct-Monk-6761", "body": "I am not a doctor but, I think the chances you damaged your penis with masturbating are pretty slim.. Do you have morning erections? If you do then your penis is probably totally fine or at least the blood flow to it. But porn addiction can make you psychologically getting used to a lot of visual stimulation of more hardcore stuff than whatever you will encounter in the real world, so stopping with the porn is definitely a good idea, your sensitivity should recover after several months with no porn .\n\nHere is pretty hot too outside and easily 35+ and sometimes 40+, what keeps me sane are usually my hobbies:\nStart playing an instrument, learn a language, draw.. It doesn't matter if your hobby is origami, sports or whatever, you should find something that will give you pleasure that isn't masturbation.\nMasturbating is totally normal and it's something everybody does, but too much of a something good is also bad.", "created_utc": "1659567462.0", "edited": "False", "id": "iiue8ud", "is_submitter": "False", "link_id": "t3_wfjvlj", "parent_id": "t3_wfjvlj", "score": "2", "subreddit": "TrueOffMyChest", "subreddit_id": "t5_2yuqy"}, {"author": "Correct-Monk-6761", "body": "The post have been removed but, whatever it was, just become an atheist and it won't be a problem.", "created_utc": "1659566134.0", "edited": "False", "id": "iiuba8z", "is_submitter": "False", "link_id": "t3_wfk37v", "parent_id": "t3_wfk37v", "score": "1", "subreddit": "TrueOffMyChest", "subreddit_id": "t5_2yuqy"}, {"author": "Correct-Monk-6761", "body": "Overall, I met 2 men during my lifetime whose language skills were more impressive than mine: My highschool solfeggio teacher (it was a highschool of arts) was native in Portuguese and Yiddish, fluent like a native in Hebrew, English and German, and I think he was at least somewhat fluent in Spanish, Italian and French as well.\n\nNowadays I began studying middle eastern studies and the head of the faculty is a native English speaker, who speaks Persian, Hebrew and Arabic almost like a native! He is also relatively fluent in Russian which is very impressive!!! \nI also heard him in Spanish a little bit, but I am not sure how good his Spanish is. I guess I should ask him about that on our next meeting, but he is so modest that I don't think I will get a good answer from him (he sais for example that he doesn't speak Russian, when he definitely does and is doing it very successfully!).\nWe have a very nice and friendly relationship with him and our talks are always fun, enjoyable and multilingual!😄", "created_utc": "1659565612.0", "edited": "1659565825.0", "id": "iiua4hm", "is_submitter": "False", "link_id": "t3_wcyol6", "parent_id": "t1_iitwgea", "score": "2", "subreddit": "polyglot", "subreddit_id": "t5_2reiv"}, {"author": "Correct-Monk-6761", "body": "In the second recording it sounded like a Russian accent to me:\nThe way you said succeed and three\nIt sounded like \"seksid\" with Russian i sound (и), and also three, you said it like \" tri\".", "created_utc": "1659370158.0", "edited": "False", "id": "iiitlub", "is_submitter": "False", "link_id": "t3_wdbhm3", "parent_id": "t3_wdbhm3", "score": "1", "subreddit": "JudgeMyAccent", "subreddit_id": "t5_2ufiq"}, {"author": "Correct-Monk-6761", "body": "I sincerely have no idea", "created_utc": "1659366547.0", "edited": "False", "id": "iiikkig", "is_submitter": "False", "link_id": "t3_wd30uv", "parent_id": "t1_iiijtgn", "score": "0", "subreddit": "JudgeMyAccent", "subreddit_id": "t5_2ufiq"}, {"author": "Correct-Monk-6761", "body": "I am not a native English speaker but your accent sounds like a perfect \"general American\" accent to me. Don't give a sh..t:\n\nMy physical appearance completely contradicts my middle eastern accent: I look like the average Russian girl (white skin, freckles, blue eyes...). \nThere is some racism here in Israel towards russians and once an old couple said to me that I have a Russian accent in Hebrew and other racist remarks. I was totally shocked because I am a native Hebrew speaker and I was born here.\nI also speak Russian but I actually feel like I might have a slight Hebrew accent in Russian and not the opposite.\n\nEventually I realized I have no Russian accent whatsoever and that such people are just racists and try to make you feel bad. They assume you have an accent only from your appearance and their sick racist minds, not from your actual speech. \n\nBy the way, I once posted here a recording in Persian which is a language that I learned relatively recently and without knowing my appearance, everyone assumed my accent is either Afghani or Arabic, which makes sense since I am from the middle east.", "created_utc": "1659316929.0", "edited": "False", "id": "iigcl9u", "is_submitter": "False", "link_id": "t3_wd30uv", "parent_id": "t3_wd30uv", "score": "4", "subreddit": "JudgeMyAccent", "subreddit_id": "t5_2ufiq"}, {"author": "Correct-Monk-6761", "body": "A language enthusiast probably.\nI speak 4 languages fluently (English is my third language by the way), and I think I would call myself a language enthusiast as well.\n\nI don't like the term polyglot because lately anyone on YouTube who knows how to say 3 words in a foreign language, calls himself a polyglot.\n\nOnly very few times in my life, I met people whose language skills and talent, truly impressed me! \nBut they weren't ever calling themselves \"polyglots\", they were extremely modest about it.", "created_utc": "1659313341.0", "edited": "False", "id": "iig5bif", "is_submitter": "False", "link_id": "t3_wcyol6", "parent_id": "t3_wcyol6", "score": "2", "subreddit": "polyglot", "subreddit_id": "t5_2reiv"}, {"author": "Correct-Monk-6761", "body": "Мне кажется что персидский намного легче, у вещей нет пола и очень легкая грамматика.. Но читать достаточно сложно, хотя если есть знания арабского, урду или других похожих языков, то проблем с чтением не будет.", "created_utc": "1659310809.0", "edited": "False", "id": "iig03jb", "is_submitter": "False", "link_id": "t3_wd1tpc", "parent_id": "t3_wd1tpc", "score": "5", "subreddit": "farsi", "subreddit_id": "t5_2t22i"}, {"author": "Correct-Monk-6761", "body": "بله اسراییلی ام", "created_utc": "1659258197.0", "edited": "False", "id": "iid1l2m", "is_submitter": "False", "link_id": "t3_vp9xrd", "parent_id": "t1_iicxu1w", "score": "1", "subreddit": "language_exchange", "subreddit_id": "t5_2tdbm"}, {"author": "Correct-Monk-6761", "body": "میدونم که دیر جواب میدم، ولی اگر هنوز میخواهی عبری بلدم.", "created_utc": "1659228975.0", "edited": "False", "id": "iibq87q", "is_submitter": "False", "link_id": "t3_vp9xrd", "parent_id": "t3_vp9xrd", "score": "2", "subreddit": "language_exchange", "subreddit_id": "t5_2tdbm"}, {"author": "Correct-Monk-6761", "body": "Здорово! 😄😄😄😄", "created_utc": "1659119857.0", "edited": "False", "id": "ii5t94v", "is_submitter": "False", "link_id": "t3_w9kxav", "parent_id": "t1_ii5pwbs", "score": "2", "subreddit": "JudgeMyAccent", "subreddit_id": "t5_2ufiq"}, {"author": "Correct-Monk-6761", "body": "Ваш акцент настолько мал что я не знаю как его можно улучшить и понятия не имею откуда вы!\nНаверное ваша страна Греция? Просто у вас европейский акцент и вы неплохо говорите букву р.", "created_utc": "1658962601.0", "edited": "False", "id": "ihx1d0i", "is_submitter": "False", "link_id": "t3_w9kxav", "parent_id": "t3_w9kxav", "score": "1", "subreddit": "JudgeMyAccent", "subreddit_id": "t5_2ufiq"}, {"author": "Correct-Monk-6761", "body": "نه، متاسفانه خانواده من ایرانی نیستند.. منو ببخش، گاهی دیر جواب میدم..", "created_utc": "1658843482.0", "edited": "False", "id": "ihpqncx", "is_submitter": "False", "link_id": "t3_vcsfz0", "parent_id": "t1_icq55ez", "score": "1", "subreddit": "farsi", "subreddit_id": "t5_2t22i"}, {"author": "Correct-Monk-6761", "body": "I tried passing it while doing a deliberately heavy but still understandable Russian accent and then again with my normal accent. This AI indeed works and is also very accurate: \nFor example it concluded my th sounds are like of a native on the second time but when I passed it in my Russian accent it ranked my th as one of the worst (I deliberately pronounced them all as z or s).", "created_utc": "1658637008.0", "edited": "False", "id": "ihespq9", "is_submitter": "False", "link_id": "t3_vx8fgv", "parent_id": "t3_vx8fgv", "score": "9", "subreddit": "u_EnglishCoachingAI", "subreddit_id": "t5_6nw1oz"}, {"author": "Correct-Monk-6761", "body": "I didn't measure but not small and not too big, probably 15-16 cm, and yessss...", "created_utc": "1658577206.0", "edited": "False", "id": "ihb9h7x", "is_submitter": "False", "link_id": "t3_w5zl9d", "parent_id": "t1_ihb9530", "score": "3", "subreddit": "positivelypremature", "subreddit_id": "t5_4qam2b"}, {"author": "Correct-Monk-6761", "body": "Sounds cool, it's always great when desires match!", "created_utc": "1658577015.0", "edited": "False", "id": "ihb96ny", "is_submitter": "False", "link_id": "t3_vttpc3", "parent_id": "t3_vttpc3", "score": "2", "subreddit": "positivelypremature", "subreddit_id": "t5_4qam2b"}, {"author": "Correct-Monk-6761", "body": "All men here where I live are circumcised, I think there is more correlation between personal habits and preferences than circumcised or not.\n\nI had several men who would often come within 30 seconds of oral sex, some circumcised men are extremely sensitive and not less than uncircumcised..", "created_utc": "1658575767.0", "edited": "False", "id": "ihb7bp9", "is_submitter": "False", "link_id": "t3_sfe7xx", "parent_id": "t3_sfe7xx", "score": "2", "subreddit": "positivelypremature", "subreddit_id": "t5_4qam2b"}, {"author": "Correct-Monk-6761", "body": "Persian: no genders, a lot of materials, not too many times, and people are way friendlier and willing to help than what I initially expected. I thought no one would like to speak with me from iran because I am Israeli, but I was wrong!", "created_utc": "1658574997.0", "edited": "False", "id": "ihb68r7", "is_submitter": "False", "link_id": "t3_w5nzjr", "parent_id": "t3_w5nzjr", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Correct-Monk-6761", "body": "They look pretty much the same when erect so I guess I prefer erected.", "created_utc": "1658573979.0", "edited": "False", "id": "ihb4u2w", "is_submitter": "False", "link_id": "t3_w5lael", "parent_id": "t3_w5lael", "score": "1", "subreddit": "TooAfraidToAsk", "subreddit_id": "t5_2ssp7"}, {"author": "Correct-Monk-6761", "body": "Wow that's an amazing transformation!!!", "created_utc": "1658516033.0", "edited": "False", "id": "ih83y24", "is_submitter": "False", "link_id": "t3_vp26fi", "parent_id": "t3_vp26fi", "score": "1", "subreddit": "bald", "subreddit_id": "t5_2sfez"}, {"author": "Correct-Monk-6761", "body": "A woman here! I often orgasm really fast and I once dated a man who needed 15-40 minutes to orgasm, and although some women may like it, it made me really FRUSTRATED...\nSo ... I prefer men who come fast😅", "created_utc": "1657307741.0", "edited": "False", "id": "ifdr6l5", "is_submitter": "False", "link_id": "t3_vqvsmx", "parent_id": "t3_vqvsmx", "score": "1", "subreddit": "PrematureEjaculation", "subreddit_id": "t5_2tjvf"}, {"author": "Correct-Monk-6761", "body": "I understand your feelings but not everything in Arabic culture is about islam and every culture has it's beautiful sides.\nTry to think about the Arabic music or food or pre islamic culture... Do you indeed really hate everything related to this culture or is it concentrated only towards everything related to Islam?\n\nI actually want to learn the Arabic language because I have many arab friends, most of which are atheists so you are definitely not alone. My main motivation is communicating with Arabs, then things like music and videos I wouldn't be able to access in other languages..\nI don't intend reading the Quran in Arabic anytime soon, because I think I will find things that are much more interesting than that in Arabic if I will ever reach that level..😅", "created_utc": "1657224786.0", "edited": "False", "id": "if92rq8", "is_submitter": "False", "link_id": "t3_vt7a1r", "parent_id": "t3_vt7a1r", "score": "1", "subreddit": "confessions", "subreddit_id": "t5_2qq6g"}, {"author": "Correct-Monk-6761", "body": "I am fluent in Persian and a native Hebrew speaker. I recently started to learn Arabic but unlike you, I think that reading in Arabic is probably the least difficult part for me!\n\nAs someone who knows 2 languages where the vowels are often not written and learning a third one, here are some tips that you might find useful:\n\nFirst of all, you should relax. You are overly stressed out by a non existing issue.\nJust take the inability to read new words correctly as granted and part of the process  and not as an issue. It's not a problem!\nThink of ice skating , in the beginning you might fall hard on the ice many times before you succeed. \nBut it's not an issue! It's a natural part of the learning experience. And even doing basic tasks like standing or moving forward is very tricky when you switch from the wooden floor to ice. It's not because skating is incredibly difficult, it's just because it is different from walking.\n\nNow to some more practical tips:\nصبح الخير! كيف حالك؟\n\nI bet you can already read it, but why?\nIt's because you already know these words.\nYour primary tactic in order to read in Arabic is improving your vocabulary! There are no magical methods and this is definitely the best way to tackle this.\n\nThe second tip is recognizing patterns, for example:\nمتجر، مطعم، مكتب ..\nThey follow the same pattern used for places.\n\nThird tip is using the internet or your friends in order to help you with reading new words, you can check the pronunciation of individual words on forvo website or ask some arab friends to read them out loud.", "created_utc": "1657207401.0", "edited": "1657208157.0", "id": "if7tsqy", "is_submitter": "False", "link_id": "t3_u25dwa", "parent_id": "t3_u25dwa", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Correct-Monk-6761", "body": "Not all the arabs inside Israel speak the same, the bedouins in the Negev for example speak in a harsher dialect that sounds more like the Saudi dialect. \nI have a friend from Tira who is a native speaker and she hardly understands bedouins..😅", "created_utc": "1657203628.0", "edited": "False", "id": "if7klnl", "is_submitter": "False", "link_id": "t3_vsghsa", "parent_id": "t1_if31qke", "score": "3", "subreddit": "learn_arabic", "subreddit_id": "t5_2v4vi"}, {"author": "Correct-Monk-6761", "body": "I wish I knew about this channel earlier! 😄", "created_utc": "1656740846.0", "edited": "False", "id": "iejojxh", "is_submitter": "False", "link_id": "t3_vkm5j0", "parent_id": "t3_vkm5j0", "score": "2", "subreddit": "arabiclearning", "subreddit_id": "t5_39mss"}, {"author": "Correct-Monk-6761", "body": "Catching the intonation and pace of the language:\nIt takes a lot of time for me from the moment when I feel like I already understand the most, till I actually sound like a fluent speaker when I speak.", "created_utc": "1656498036.0", "edited": "False", "id": "ie630hw", "is_submitter": "False", "link_id": "t3_vn9vsb", "parent_id": "t3_vn9vsb", "score": "6", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Correct-Monk-6761", "body": "Georgian was just an autocorrection..\nBut wow! Ottoman Turkish is something I didn't consider. It actually makes more sense that it's not Persian inspite my friend who is the owner of this envelope claiming it is. Thank you so much", "created_utc": "1655782688.0", "edited": "False", "id": "id54ben", "is_submitter": "True", "link_id": "t3_vfzxez", "parent_id": "t1_id1b85c", "score": "2", "subreddit": "translator", "subreddit_id": "t5_2ss9z"}, {"author": "Correct-Monk-6761", "body": "I only could read the word اصفهان there, I think there is also the year 1313 (so it should be like 1896 in the Georgian one..)\nI know it was at some point of time in isfahan and Tehran. I showed it now to an urdu speaker and he said it isn't Urdu. My friend has a collection of letters from all over the world and this one really intrigued me, he sais it is in Persian and probably it is in Persian but I can't read it through I know persian..", "created_utc": "1655665191.0", "edited": "False", "id": "icz2pe0", "is_submitter": "True", "link_id": "t3_vfzxez", "parent_id": "t1_icyyrz6", "score": "2", "subreddit": "translator", "subreddit_id": "t5_2ss9z"}, {"author": "Correct-Monk-6761", "body": "I know Persian but this kind of script is absolutely incomprehensible for me and I can't even read it nor understand what language is it written in because I don't recognize any words in all this mess... Any clues would be appreciated.", "created_utc": "1655659347.0", "edited": "1655660061.0", "id": "icyq2di", "is_submitter": "True", "link_id": "t3_vfzxez", "parent_id": "t3_vfzxez", "score": "3", "subreddit": "translator", "subreddit_id": "t5_2ss9z"}, {"author": "Correct-Monk-6761", "body": "I don't agree with you at all! There are so many free resources for learning persian! Children stories translated to English, videos and dubbed movies.. \n\nNot long ago I saw Raya and the last dragon in Persian and the quality was pretty good! But I searched it as رایا و آخرین اژدها.\n\nIf I ever want to find something I usually go to aparat website first and search it in Persian, because it's like YouTube but for iranians. If I can't find it on aparat I spend some time searching on google or I ask my iranian friends for some help.", "created_utc": "1655531108.0", "edited": "False", "id": "icsxrfi", "is_submitter": "False", "link_id": "t3_veos2d", "parent_id": "t1_icrhztb", "score": "6", "subreddit": "farsi", "subreddit_id": "t5_2t22i"}, {"author": "Correct-Monk-6761", "body": "I am always impressed when people in other countries try to learn Hebrew, because of how different it is from other European and Asian languages. Arabic is very close to Hebrew but objectively, it is harder than Hebrew.\nThe grammar in both is usually very hard for foreigners to grasp, the pronunciation in Arabic is hard even for Hebrew speakers and I can't imagine how hard it must be for someone whose native language is English, Chinese or Russian, and of course the fact that it has so many dialects...", "created_utc": "1655462664.0", "edited": "False", "id": "icp073w", "is_submitter": "False", "link_id": "t3_ve2lv1", "parent_id": "t1_icor941", "score": "4", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Correct-Monk-6761", "body": "I think that in most cases, if you decide to study an unpopular language, most natives will be excited to help you!\nPersian speakers often tell me that they barely ever met anyone who wanted to learn their language and most are pretty excited from that.\n\nI think Hebrew is also a good candidate because of how diverse the population of Israel is, and people here have a lot more patience and empathy towards foreigners who are trying to learn Hebrew.", "created_utc": "1655456841.0", "edited": "False", "id": "icot9e1", "is_submitter": "False", "link_id": "t3_ve2lv1", "parent_id": "t3_ve2lv1", "score": "22", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Correct-Monk-6761", "body": "خیلی ممنون، فکر میکنم که خیلی از خارجی ها در یوتیوب که فارسی «بلدند», در زندگی واقعی روان نیستند. \nنمیدونم اگر روان ام یا نه، هنوز اشتباهات دارم ولی تقریباً ۷۵-۸۰ درصد میفهمم...\nخیلی فیلمهای خارجی با دوبله فارسی و چند فیلمهای ایرانی نگاه کردم و همچنین خیلی ویدئو های خنددار دیدم. اخیرا با کلاه قرمزی اشنا شدم و البته دوستش دارم!😄\nدر شروع، تفاوت رو از بین o و آ نمی شنیدم و برام، باتری و بطری یا کشتن و کاشتن یکسان بودند، اما الان بهتر شد.\nق، آ دشوار ترین صدا های بودند به نظرم...", "created_utc": "1655450457.0", "edited": "False", "id": "icolx7x", "is_submitter": "False", "link_id": "t3_vcsfz0", "parent_id": "t1_icofqi6", "score": "2", "subreddit": "farsi", "subreddit_id": "t5_2t22i"}, {"author": "Correct-Monk-6761", "body": "I think most languages have a native word for that, for example there is sex in Hebrew and Persian too, but you can many times see native words like:\nارتباط جنسی، יחסי מין, יחסי אישות..", "created_utc": "1655392022.0", "edited": "False", "id": "icl8u5q", "is_submitter": "False", "link_id": "t3_vdjq7b", "parent_id": "t3_vdjq7b", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Correct-Monk-6761", "body": "Oh thank you😄😊", "created_utc": "1655390558.0", "edited": "False", "id": "icl5gh8", "is_submitter": "True", "link_id": "t3_vcrqor", "parent_id": "t1_ickbtp3", "score": "2", "subreddit": "JudgeMyAccent", "subreddit_id": "t5_2ufiq"}, {"author": "Correct-Monk-6761", "body": "Actually, I watch a lot of iranian videos or dubed movies daily! So I watch a lot of content in Persian.\nTo be honest I really have no idea what vowels are you referring to, I can't hear anything wrong with my Persian even when I listen to it from the side. Myabe the ا and آ ? \nSome things came to me with time like the ق sound, so maybe it will also come with time and experience (I hope so)...", "created_utc": "1655370970.0", "edited": "False", "id": "ick91k9", "is_submitter": "True", "link_id": "t3_vcrqor", "parent_id": "t1_ick7ohj", "score": "3", "subreddit": "JudgeMyAccent", "subreddit_id": "t5_2ufiq"}, {"author": "Correct-Monk-6761", "body": "https://vocaroo.com/1kpk0CQihWJH", "created_utc": "1655368240.0", "edited": "False", "id": "ick61tj", "is_submitter": "True", "link_id": "t3_vcrqor", "parent_id": "t1_icizt51", "score": "2", "subreddit": "JudgeMyAccent", "subreddit_id": "t5_2ufiq"}, {"author": "Correct-Monk-6761", "body": "Thanks, sadly I don't know Arabic (yet), just some basic phrases here and there and I had it for couple of years at school. But my arab friends say that my Arabic accent is really good and I plan learning it in the future.", "created_utc": "1655353287.0", "edited": "False", "id": "icjmp6j", "is_submitter": "True", "link_id": "t3_vcrqor", "parent_id": "t1_icjm2w1", "score": "2", "subreddit": "JudgeMyAccent", "subreddit_id": "t5_2ufiq"}, {"author": "Correct-Monk-6761", "body": "I sadly can't record right now, everyone is sleeping..", "created_utc": "1655341393.0", "edited": "False", "id": "icizmw2", "is_submitter": "True", "link_id": "t3_vcrqor", "parent_id": "t1_iciq91v", "score": "2", "subreddit": "JudgeMyAccent", "subreddit_id": "t5_2ufiq"}, {"author": "Correct-Monk-6761", "body": "I will record something tomorrow where I speak without any pre - written text, and not just read from a book, I think it was more monotonous than my natural way of speaking  only because I was reading..", "created_utc": "1655341099.0", "edited": "False", "id": "iciyztx", "is_submitter": "True", "link_id": "t3_vcrqor", "parent_id": "t1_iciq91v", "score": "2", "subreddit": "JudgeMyAccent", "subreddit_id": "t5_2ufiq"}, {"author": "Correct-Monk-6761", "body": "Not necessarily but most of the content online is in Tehrani accent, so of course my pronunciation is mostly influenced by that. I sometimes watch the videos of an Isfahani YouTuber and can clearly hear the differences between the two accents, but I don't think that I can recreate an esfahani accent very well😂.", "created_utc": "1655315877.0", "edited": "False", "id": "ichdihq", "is_submitter": "False", "link_id": "t3_vcsfz0", "parent_id": "t1_ichb4gl", "score": "1", "subreddit": "farsi", "subreddit_id": "t5_2t22i"}, {"author": "Correct-Monk-6761", "body": "Yeah, actually persian has more sounds than Hebrew, so a Persian accent in Hebrew sounds much better than the opposite. This is how a big Hebrew accent sounds in Persian, so you can know how to recognize it:\n\nhttps://voca.ro/18r0PvVSvEq7\n\nThe biggest clues to look for are probably in the pronunciation of ر، ق، ک، آ.", "created_utc": "1655314809.0", "edited": "False", "id": "ichaw9r", "is_submitter": "False", "link_id": "t3_vcsfz0", "parent_id": "t1_ich16hw", "score": "1", "subreddit": "farsi", "subreddit_id": "t5_2t22i"}, {"author": "Correct-Monk-6761", "body": "Here almost every major university has a persian course, but I think they focus too much on Iran today and shia islam in these classes and not enough on the Persian language itself and the Iranian culture. If I were the teacher, I would show kolah ghermezi or other entertaining videos and not religious speeches of ayatollahs....", "created_utc": "1655310098.0", "edited": "False", "id": "icgzcgv", "is_submitter": "False", "link_id": "t3_vcsfz0", "parent_id": "t1_icgprl2", "score": "1", "subreddit": "farsi", "subreddit_id": "t5_2t22i"}, {"author": "Correct-Monk-6761", "body": "https://youtu.be/V-i-DMsFx6o\nTurn on English subtitles, it's a comedy that takes episodes from jewish history and religion and makes fun of them.", "created_utc": "1655307941.0", "edited": "False", "id": "icgu19b", "is_submitter": "False", "link_id": "t3_vcsfz0", "parent_id": "t1_icgprl2", "score": "1", "subreddit": "farsi", "subreddit_id": "t5_2t22i"}, {"author": "Correct-Monk-6761", "body": "Yeah, you are right, anyways I am glad I don't have a Russian or a Hebrew accent in Persian, and Afghanistan and Pakistan are extremely close to Iran, I can live with that😄.", "created_utc": "1655305996.0", "edited": "False", "id": "icgpbeb", "is_submitter": "False", "link_id": "t3_vcsfz0", "parent_id": "t1_icgp2ze", "score": "1", "subreddit": "farsi", "subreddit_id": "t5_2t22i"}, {"author": "Correct-Monk-6761", "body": "😂 what is your guess then?", "created_utc": "1655305755.0", "edited": "False", "id": "icgoqdh", "is_submitter": "False", "link_id": "t3_vcsfz0", "parent_id": "t1_icgodhe", "score": "1", "subreddit": "farsi", "subreddit_id": "t5_2t22i"}, {"author": "Correct-Monk-6761", "body": "By the way, is it obvious where am I from?", "created_utc": "1655305423.0", "edited": "False", "id": "icgnxmq", "is_submitter": "False", "link_id": "t3_vcsfz0", "parent_id": "t1_icgmzwo", "score": "1", "subreddit": "farsi", "subreddit_id": "t5_2t22i"}, {"author": "Correct-Monk-6761", "body": "Oh, I didn't know, I will try to pay more attention to them", "created_utc": "1655305194.0", "edited": "False", "id": "icgndh3", "is_submitter": "False", "link_id": "t3_vcsfz0", "parent_id": "t1_icgmzwo", "score": "1", "subreddit": "farsi", "subreddit_id": "t5_2t22i"}, {"author": "Correct-Monk-6761", "body": "Is there anything specific I can try working on? Like certain sounds or letters or specific words? Or is it just the intonation and speed in general?", "created_utc": "1655304727.0", "edited": "False", "id": "icgm9uw", "is_submitter": "False", "link_id": "t3_vcsfz0", "parent_id": "t1_icghrl8", "score": "1", "subreddit": "farsi", "subreddit_id": "t5_2t22i"}, {"author": "Correct-Monk-6761", "body": "Hey don't feel too bad, Pakistan has a rich history, very nice people, great food and also urdu is one of the most beautiful languages in the world in my opinion. \nFeel proud, if anyone is going to judge you by this part in you, then it means they aren't worth your time.", "created_utc": "1655295503.0", "edited": "False", "id": "icg2xr5", "is_submitter": "False", "link_id": "t3_vcskdl", "parent_id": "t3_vcskdl", "score": "4", "subreddit": "culture", "subreddit_id": "t5_2qhq2"}, {"author": "Correct-Monk-6761", "body": "Well, people tend to help the weak to survive first.. It's just a social norm.\nIf people will evacuate without panic it won't create a bottle neck, if all men will rush emmidiately to the exit and try to force their way out as fast as possible, it will also make a bottleneck.", "created_utc": "1655203002.0", "edited": "False", "id": "icbb5gv", "is_submitter": "False", "link_id": "t3_vbkgq7", "parent_id": "t1_icbaik4", "score": "1", "subreddit": "TooAfraidToAsk", "subreddit_id": "t5_2ssp7"}, {"author": "Correct-Monk-6761", "body": "Looks like counting marks, not a language that I know of.", "created_utc": "1655180533.0", "edited": "False", "id": "icaj9w9", "is_submitter": "False", "link_id": "t3_vbkb2b", "parent_id": "t3_vbkb2b", "score": "1", "subreddit": "translator", "subreddit_id": "t5_2ss9z"}, {"author": "Correct-Monk-6761", "body": "Erdogan is the sole reason why I will never go to turkey even as a tourist...", "created_utc": "1655179139.0", "edited": "1655289471.0", "id": "icagwqk", "is_submitter": "False", "link_id": "t3_v70ttn", "parent_id": "t3_v70ttn", "score": "1", "subreddit": "atheism", "subreddit_id": "t5_2qh2p"}, {"author": "Correct-Monk-6761", "body": "Only death:\nGod, if you exist please kill me right now.\nBut as always, I am still alive.", "created_utc": "1655164863.0", "edited": "False", "id": "ic9nq5d", "is_submitter": "False", "link_id": "t3_v09mmi", "parent_id": "t3_v09mmi", "score": "0", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "Correct-Monk-6761", "body": "Going out naked, sometimes it's hot and humid, why can't we?!", "created_utc": "1655163626.0", "edited": "False", "id": "ic9l4wt", "is_submitter": "False", "link_id": "t3_vbmnyn", "parent_id": "t3_vbmnyn", "score": "3", "subreddit": "TooAfraidToAsk", "subreddit_id": "t5_2ssp7"}, {"author": "Correct-Monk-6761", "body": "I will say all the good things first:\n\nThe easiest part for me was reading and writing! I know it's not a popular opinion, but I already could read in Arabic when I started and I also speak Hebrew (which is pretty similar in its writing system).\n\nThe grammar wasn't intuitive to me at all, the verb at the end and how sometimes a verb consists of an object+unrelated verb was weird... But I was pretty happy you don't have genders for objects, in Russian which is my native language we have 3 genders!\n\nThe hardest part for me was understanding spoken Persian:\nThe differences between written and spoken Persian are pretty big, for example:\nChand sāl dārid? -> chand sālete? (chand saletune).\nEsme man milad ast -> esmam milāde.\nMan dar khāne hastam -> man khunam.\nMan besiar khaste hastam -> kheili khastam.\nKojā hasti? -> kujāyi?\n\nOn top of that, many words sound a little bit different from their 'correct form' when used in daily conversation. \n\"mitunam\", \"mikhām\", \"ātish\", \"hendune\", \"sab kon\", \"zendun\"...", "created_utc": "1655162805.0", "edited": "False", "id": "ic9jffe", "is_submitter": "False", "link_id": "t3_vb7350", "parent_id": "t3_vb7350", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Correct-Monk-6761", "body": "I think women are evacuated first because they are slower and weaker than men physically.. Just like you would also let children and elderly evacuate first.", "created_utc": "1655153853.0", "edited": "False", "id": "ic8zfg9", "is_submitter": "False", "link_id": "t3_vbkgq7", "parent_id": "t3_vbkgq7", "score": "11", "subreddit": "TooAfraidToAsk", "subreddit_id": "t5_2ssp7"}, {"author": "Correct-Monk-6761", "body": "I love abadis dictionary, I don't know if it's the best but I really recommend checking it out:\nhttps://abadis.ir/", "created_utc": "1655019703.0", "edited": "False", "id": "ic2ct2u", "is_submitter": "False", "link_id": "t3_vaff7o", "parent_id": "t3_vaff7o", "score": "3", "subreddit": "farsi", "subreddit_id": "t5_2t22i"}, {"author": "Correct-Monk-6761", "body": "I didn't pay for anything and I think it worked well for me (I am currently learning Persian, so there are tons of books and movies for free).\nDo you sometimes regret spending so much money?", "created_utc": "1654925075.0", "edited": "False", "id": "iby088h", "is_submitter": "False", "link_id": "t3_v9enaz", "parent_id": "t1_ibw03av", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Correct-Monk-6761", "body": "Вау супер! У меня мама русская немка а папа еврей из грузии, моя мама очень хорошо говорит по русски, но папа говорит плохо и с ошибками))))..", "created_utc": "1654675500.0", "edited": "False", "id": "ibl32oa", "is_submitter": "False", "link_id": "t3_v5joqx", "parent_id": "t1_ibl2b28", "score": "2", "subreddit": "polyglot", "subreddit_id": "t5_2reiv"}, {"author": "Correct-Monk-6761", "body": "Hebrew: \"Akh!\" Or \"aya\"", "created_utc": "1654674690.0", "edited": "False", "id": "ibl26x7", "is_submitter": "False", "link_id": "t3_ua94o4", "parent_id": "t3_ua94o4", "score": "2", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "Correct-Monk-6761", "body": "Из Израиля, а вы родились в России я так понимаю?\nЯ ни разу не была в России но очень хочется посетить Питер как только вся эта война закончится.", "created_utc": "1654674178.0", "edited": "False", "id": "ibl1m65", "is_submitter": "False", "link_id": "t3_v5joqx", "parent_id": "t1_ibl11uv", "score": "1", "subreddit": "polyglot", "subreddit_id": "t5_2reiv"}, {"author": "Correct-Monk-6761", "body": "Я так то говорю на русском, на иврите, на французском и немного на арабском (знаю персидский в котором много арабских слов и у меня был арабский в школе). Я не знаю как вы к этому пришли но иврит звучит совсем не как Арабский, а когда французы пытаются что-то выговорить по русски то я ничего не понимаю 😂.\nОн говорит что у него большой французский акцент, так что, я говорю учтя во внимание БОЛЬШОЙ АКЦЕНТ. На иврите кстати все легче чем на арабском, потому что нету ح، ع، غ، ق، ث، ظ، ط، ص، ض،ذ", "created_utc": "1654673499.0", "edited": "False", "id": "ibl0u3s", "is_submitter": "False", "link_id": "t3_v5joqx", "parent_id": "t1_ibl0bmk", "score": "2", "subreddit": "polyglot", "subreddit_id": "t5_2reiv"}, {"author": "Correct-Monk-6761", "body": "Technically it's not allowed at all!\nSo, how can you deal with it? Become an atheist and enjoy masturbation!\n\nBy the way, many rapists were very religious christians. So if Christianity didn't stop pastors from raping, it shouldn't stop you from something so harmless as masturbating.\n\nhttps://en.m.wikipedia.org/wiki/Catholic_Church_sexual_abuse_cases", "created_utc": "1654672379.0", "edited": "1655164140.0", "id": "ibkzkah", "is_submitter": "False", "link_id": "t3_v78zne", "parent_id": "t3_v78zne", "score": "1", "subreddit": "TooAfraidToAsk", "subreddit_id": "t5_2ssp7"}, {"author": "Correct-Monk-6761", "body": "The answers here are getting from ok, to bad, to even worse.\nWhere is the \"Yes we even encourage each other to do so\"?", "created_utc": "1654671884.0", "edited": "False", "id": "ibkyzch", "is_submitter": "False", "link_id": "t3_v7ifpg", "parent_id": "t3_v7ifpg", "score": "1", "subreddit": "polls", "subreddit_id": "t5_2qh65"}, {"author": "Correct-Monk-6761", "body": "I think you don't love her so it's better if you two divorce. You said you will stay with her if the child is yours, but what if he's not? \nIs the genetics of the child, the only thing that ties you to her?", "created_utc": "1654669847.0", "edited": "False", "id": "ibkwinh", "is_submitter": "False", "link_id": "t3_v79ppz", "parent_id": "t3_v79ppz", "score": "1", "subreddit": "TrueOffMyChest", "subreddit_id": "t5_2yuqy"}, {"author": "Correct-Monk-6761", "body": "Look, I think you don't love her.. You said you will stay with her if the child is your, but what if it's not?\nIs this the only thing that ties you to her?", "created_utc": "1654669068.0", "edited": "False", "id": "ibkviyg", "is_submitter": "False", "link_id": "t3_v79ppz", "parent_id": "t3_v79ppz", "score": "1", "subreddit": "TrueOffMyChest", "subreddit_id": "t5_2yuqy"}, {"author": "Correct-Monk-6761", "body": "Start maybe with children books or for teens, something easy..\nWith time you will start recognising words and reading should become very easy.\n\nI actually think reading was the easiest part in Persian for me when I started learning it from scratch, so it's great you already know many words and can guess the meaning of many of them..\nIt will just take time and practice, the more you read the better you become", "created_utc": "1654668445.0", "edited": "False", "id": "ibkupyq", "is_submitter": "False", "link_id": "t3_uuyx7m", "parent_id": "t3_uuyx7m", "score": "1", "subreddit": "farsi", "subreddit_id": "t5_2t22i"}, {"author": "Correct-Monk-6761", "body": "I strongly disagree! \nI agree that in Hebrew French accent sounds good, I kinda agree with Spanish because there are at least some similarities in the sounds between the two languages and even a big French accent is likely to still be understood.\nBut, why Russian and Arabic as well?! The entire \"configuration\" of the mouth is totally different from French and you are likely to be misunderstood!\n\nAccent is not only about the R's, what about all the: ме, ве, ле and other soft sounds in Russian?\n(I also think that French R sounds really bad in Russian, but I guess it's a matter of taste).\nIt will be like in John Wick movies, I am a native Russian speaker and I can't understand him! \nAnd a French accent isn't much better than an American accent when it comes to Russian to be honest..\n\nArabic is also notorious for being hard to pronounce and I can't even imagine it with a French accent!!!! \nI think that pronouncing، ض، ذ as \"z\", and pronouncing ص، ث as \"s\", and not being able to pronounce many other letters like ع،غ،ق،ح sounds pretty bad in my opinion..\n(Although my Arabic is pretty limited so maybe natives think differently.)", "created_utc": "1654666497.0", "edited": "1654666742.0", "id": "ibks2iv", "is_submitter": "False", "link_id": "t3_v5joqx", "parent_id": "t1_ibcinq0", "score": "1", "subreddit": "polyglot", "subreddit_id": "t5_2reiv"}, {"author": "Correct-Monk-6761", "body": "I think it sounds nice in Hebrew, and also the R sound is the same", "created_utc": "1654664734.0", "edited": "False", "id": "ibkplrx", "is_submitter": "False", "link_id": "t3_v5joqx", "parent_id": "t3_v5joqx", "score": "1", "subreddit": "polyglot", "subreddit_id": "t5_2reiv"}, {"author": "Correct-Monk-6761", "body": "The standard in Persian is <dustet dāram>, or <āsheghetam>.\nGhorbunet beram = I will sacrifice myself for you, which is like saying I adore you.\nSometimes it's also used to say thank you between 2 close people.", "created_utc": "1654664479.0", "edited": "False", "id": "ibkp8nx", "is_submitter": "False", "link_id": "t3_v6b10a", "parent_id": "t3_v6b10a", "score": "3", "subreddit": "polyglot", "subreddit_id": "t5_2reiv"}, {"author": "Correct-Monk-6761", "body": "He treated me really well, I felt very close to him but as friends, we didn't fall in love..", "created_utc": "1654171909.0", "edited": "False", "id": "iawivfu", "is_submitter": "False", "link_id": "t3_upthzu", "parent_id": "t1_i8udjni", "score": "2", "subreddit": "sex", "subreddit_id": "t5_2qh3p"}, {"author": "Correct-Monk-6761", "body": "My favorite is the gay beach, the beaches near Hilton hotel are all nice but the gay one is usually a little bit less crowded and I personally prefer that section..", "created_utc": "1652645408.0", "edited": "False", "id": "i8qgvg5", "is_submitter": "False", "link_id": "t3_uqaqvi", "parent_id": "t3_uqaqvi", "score": "10", "subreddit": "Israel", "subreddit_id": "t5_2qhvo"}, {"author": "Correct-Monk-6761", "body": "I lost mine with a friend, we were in a friends with benefits relationship for several months and my first experience was absolutely fantastic)))\nSo don't listen to anyone, find someone you trust and like, and have fun!\nMy other men really didn't care how I lost it..", "created_utc": "1652642408.0", "edited": "False", "id": "i8qa4d8", "is_submitter": "False", "link_id": "t3_upthzu", "parent_id": "t3_upthzu", "score": "2", "subreddit": "sex", "subreddit_id": "t5_2qh3p"}, {"author": "Correct-Monk-6761", "body": "I would practice first inserting a finger, try it several times, then with a tampon... there are also really small tampons out there, don't stop trying because tampons literally save me whenever I want to do sports or go to sleep..", "created_utc": "1652629447.0", "edited": "False", "id": "i8pgfix", "is_submitter": "False", "link_id": "t3_uq87c0", "parent_id": "t1_i8pdkw9", "score": "2", "subreddit": "TrueOffMyChest", "subreddit_id": "t5_2yuqy"}, {"author": "Correct-Monk-6761", "body": "Ok, maybe you are right, we are great friends overall so I guess it won't be too hard", "created_utc": "1652609308.0", "edited": "False", "id": "i8ohk35", "is_submitter": "True", "link_id": "t3_uq2gs6", "parent_id": "t1_i8oh819", "score": "2", "subreddit": "TrueOffMyChest", "subreddit_id": "t5_2yuqy"}, {"author": "Correct-Monk-6761", "body": "Ok, well, can u explain some more please", "created_utc": "1652608566.0", "edited": "False", "id": "i8ogp1f", "is_submitter": "True", "link_id": "t3_uq2gs6", "parent_id": "t1_i8ogh1p", "score": "1", "subreddit": "TrueOffMyChest", "subreddit_id": "t5_2yuqy"}, {"author": "Correct-Monk-6761", "body": "Disagree... I would tell a firm NO to a fat, shy and depressed guy almost immediately. Without even giving the chance.\nThese two are just huge turn offs for me to overcome (Im not virgin anymore btw).\nImproving yourself is definitely better than accepting your faith..", "created_utc": "1652603477.0", "edited": "False", "id": "i8oaspq", "is_submitter": "False", "link_id": "t3_ulj6m6", "parent_id": "t3_ulj6m6", "score": "1", "subreddit": "virgin", "subreddit_id": "t5_2rs2k"}, {"author": "Correct-Monk-6761", "body": "My first experience was with a virgin guy in his early 20s and I was a virgin as well at the time and it was amazing! Your performance in bed isn't determined by your experience and my first experience was perfect: it wasn't painful and he made me O..... before penetration.\nSo, I am not interested is he a virgin or not, I would rather try to see if we are on the same page, if we want similar things in sex..\nWhat he likes and prefers and how much he is willing to listen, can I be fully open with him about my desires etc..", "created_utc": "1652602427.0", "edited": "False", "id": "i8o9kxg", "is_submitter": "False", "link_id": "t3_t8au1f", "parent_id": "t3_t8au1f", "score": "2", "subreddit": "virgin", "subreddit_id": "t5_2rs2k"}, {"author": "Correct-Monk-6761", "body": "Thank you", "created_utc": "1652595551.0", "edited": "False", "id": "i8o193u", "is_submitter": "True", "link_id": "t3_upz7uw", "parent_id": "t1_i8o03xp", "score": "1", "subreddit": "translator", "subreddit_id": "t5_2ss9z"}, {"author": "Correct-Monk-6761", "body": "\"Estarbucks\"", "created_utc": "1652548774.0", "edited": "False", "id": "i8liazh", "is_submitter": "False", "link_id": "t3_uph0oe", "parent_id": "t3_uph0oe", "score": "7", "subreddit": "farsi", "subreddit_id": "t5_2t22i"}, {"author": "Correct-Monk-6761", "body": "Russian is an lgbt friendly language because it has 3 genders for objects:\nMale, female and a middle one.", "created_utc": "1652547293.0", "edited": "False", "id": "i8lf2m9", "is_submitter": "False", "link_id": "t3_umoi8p", "parent_id": "t3_umoi8p", "score": "2", "subreddit": "languagelearningjerk", "subreddit_id": "t5_37rt5"}, {"author": "Correct-Monk-6761", "body": "I speak 4 fluently, but if I will count all the languages I can somewhat understand it's closer to 10.", "created_utc": "1652544661.0", "edited": "False", "id": "i8l959c", "is_submitter": "False", "link_id": "t3_uom58z", "parent_id": "t3_uom58z", "score": "1", "subreddit": "polyglot", "subreddit_id": "t5_2reiv"}, {"author": "Correct-Monk-6761", "body": "Say it right on play app store, or forvo website", "created_utc": "1652532949.0", "edited": "False", "id": "i8kldfd", "is_submitter": "False", "link_id": "t3_uewqhm", "parent_id": "t3_uewqhm", "score": "1", "subreddit": "iran", "subreddit_id": "t5_2qhzq"}, {"author": "Correct-Monk-6761", "body": "As far as I saw فهرست is also used as \"contents\", so I wasn't sure can I also use it as a list, while لیست is just a list. For example فهرست is used for the page with the names of chapters in a book, I don't think I saw لیست used in that setting..", "created_utc": "1652244094.0", "edited": "False", "id": "i859yxi", "is_submitter": "True", "link_id": "t3_umgp45", "parent_id": "t1_i841ao4", "score": "1", "subreddit": "farsi", "subreddit_id": "t5_2t22i"}, {"author": "Correct-Monk-6761", "body": "In Hebrew and Russian you just have to remember them all, but usually the more you listen, the better you get at remembering genders", "created_utc": "1652188831.0", "edited": "False", "id": "i81pzuv", "is_submitter": "False", "link_id": "t3_umengm", "parent_id": "t3_umengm", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Correct-Monk-6761", "body": "Thanks! I was not sure I am using these two correctly 😊", "created_utc": "1652187273.0", "edited": "False", "id": "i81ms9z", "is_submitter": "True", "link_id": "t3_umgp45", "parent_id": "t1_i81jydl", "score": "1", "subreddit": "farsi", "subreddit_id": "t5_2t22i"}, {"author": "Correct-Monk-6761", "body": "You shouldn't sacrifice anything, just give him more time.\nHe will gradually understand what is English and what isn't English and that you should use English outside. It will take 2-3 months for him to adjust, just give him that time.", "created_utc": "1652165681.0", "edited": "False", "id": "i80tpt7", "is_submitter": "False", "link_id": "t3_ujbtnp", "parent_id": "t3_ujbtnp", "score": "1", "subreddit": "toddlers", "subreddit_id": "t5_2ta5v"}, {"author": "Correct-Monk-6761", "body": "You have a nice foreign accent, it kinda resembles the accent of my best Pakistani friend so I guess you are from that area of the globe 😄.\nPeople already mentioned here what you can improve in your accent, I would rate your pronunciation as 7 because I could understand everything and your foreign accent is very pleasant overall.", "created_utc": "1652163308.0", "edited": "False", "id": "i80qmj3", "is_submitter": "False", "link_id": "t3_ulluqo", "parent_id": "t3_ulluqo", "score": "1", "subreddit": "JudgeMyAccent", "subreddit_id": "t5_2ufiq"}, {"author": "Correct-Monk-6761", "body": "Thank god I am an atheist!\nEnjoy your invisible company:)", "created_utc": "1652161658.0", "edited": "False", "id": "i80ocm8", "is_submitter": "False", "link_id": "t3_ulzph8", "parent_id": "t3_ulzph8", "score": "-1", "subreddit": "TrueOffMyChest", "subreddit_id": "t5_2yuqy"}, {"author": "Correct-Monk-6761", "body": "The water here in toilets is usually so low, I had to remind myself that US toilets are weird", "created_utc": "1652161436.0", "edited": "False", "id": "i80o0yu", "is_submitter": "False", "link_id": "t3_um8v7f", "parent_id": "t3_um8v7f", "score": "1", "subreddit": "TooAfraidToAsk", "subreddit_id": "t5_2ssp7"}, {"author": "Correct-Monk-6761", "body": "I checked the phone number, there is indeed a store in Israel called nedudim, that sells handmade bags and clothes😄.", "created_utc": "1652156931.0", "edited": "False", "id": "i80guiu", "is_submitter": "False", "link_id": "t3_ufqyr1", "parent_id": "t1_i7zhcdv", "score": "1", "subreddit": "language", "subreddit_id": "t5_2qlfj"}, {"author": "Correct-Monk-6761", "body": "Not similar at all. Not in sounds, not in vocabulary, not in grammar.", "created_utc": "1652134005.0", "edited": "False", "id": "i7z42wl", "is_submitter": "False", "link_id": "t3_uiji67", "parent_id": "t3_uiji67", "score": "1", "subreddit": "AskARussian", "subreddit_id": "t5_2xzpo"}, {"author": "Correct-Monk-6761", "body": "Haha, I think it is much more impressive to speak 3 different languages fluently, rather than knowing how to say 3 sentences in 30.\nGood luck in your journey!\nAnother thing that keeps me motivated is the rewards at the end:\n\nThe best part of knowing several languages is being able to access a lot of content that is not available in English, like literature and songs.\nBut also, Netflix kinda looses its relevance when you can find almost everything in Russian or Persian absolutely for free😂", "created_utc": "1652133130.0", "edited": "False", "id": "i7z22tn", "is_submitter": "False", "link_id": "t3_ulxaee", "parent_id": "t1_i7yussd", "score": "3", "subreddit": "polyglot", "subreddit_id": "t5_2reiv"}, {"author": "Correct-Monk-6761", "body": "Well, basically you are monolingual with some limited knowledge in French, I just think it's overly ambitious. \nMaster one language first before making such plans.\nRight now, I am fluent in 4 (English is my third language by the way) and my plan is maybe learning 2 more, it is 6 in total. I may consider learning more languages afterwards because I really enjoy it, but sincerely 18 is a bit unrealistic.", "created_utc": "1652129896.0", "edited": "False", "id": "i7yui9u", "is_submitter": "False", "link_id": "t3_ubzy5u", "parent_id": "t1_i7yt3hp", "score": "1", "subreddit": "polyglot", "subreddit_id": "t5_2reiv"}, {"author": "Correct-Monk-6761", "body": "Can I ask you from curiosity, why 18? Why not 56 or 120?", "created_utc": "1652127098.0", "edited": "False", "id": "i7ynqjz", "is_submitter": "False", "link_id": "t3_ubzy5u", "parent_id": "t3_ubzy5u", "score": "1", "subreddit": "polyglot", "subreddit_id": "t5_2reiv"}, {"author": "Correct-Monk-6761", "body": "Russian from home, Hebrew in kindergarten, English at school but mostly by myself during highschool, Persian by myself after highschool and till now..\nSome French was also involved here and there but my capabilities in french are pretty limited.", "created_utc": "1652126405.0", "edited": "False", "id": "i7ym1tr", "is_submitter": "False", "link_id": "t3_uedgye", "parent_id": "t3_uedgye", "score": "1", "subreddit": "polyglot", "subreddit_id": "t5_2reiv"}, {"author": "Correct-Monk-6761", "body": "Those you enjoy..", "created_utc": "1652125960.0", "edited": "False", "id": "i7ykykh", "is_submitter": "False", "link_id": "t3_ug6uga", "parent_id": "t3_ug6uga", "score": "1", "subreddit": "polyglot", "subreddit_id": "t5_2reiv"}, {"author": "Correct-Monk-6761", "body": "Well I was born here and this is what I mean when I say Israeli food..\nThere are many good Israeli things, but there is no food we invented, at least not that I know of.", "created_utc": "1652124283.0", "edited": "False", "id": "i7ygta6", "is_submitter": "False", "link_id": "t3_ulpfg9", "parent_id": "t1_i7ygbj6", "score": "1", "subreddit": "AskMiddleEast", "subreddit_id": "t5_vkfjx"}, {"author": "Correct-Monk-6761", "body": "I speak 4 languages fluently so I don't know if it counts as a lot of experience (English is my third by the way😅).\nFor me, it's much easier to learn one language at a time, because then you can dedicate more time to that language and as a result you see more progress!!!\nAnd seeing my progress helps me to stay motivated.", "created_utc": "1652123584.0", "edited": "False", "id": "i7yf45k", "is_submitter": "False", "link_id": "t3_ulxaee", "parent_id": "t1_i7yac21", "score": "7", "subreddit": "polyglot", "subreddit_id": "t5_2reiv"}, {"author": "Correct-Monk-6761", "body": "Well, I am not used to Egyptians being nice to me..\nI guess when people say Israeli food they refer to the combination of foods from different countries that is present in Israel.", "created_utc": "1652121865.0", "edited": "False", "id": "i7yaway", "is_submitter": "False", "link_id": "t3_ulpfg9", "parent_id": "t1_i7y9yeb", "score": "1", "subreddit": "AskMiddleEast", "subreddit_id": "t5_vkfjx"}, {"author": "Correct-Monk-6761", "body": "Why not, look:\nFalafel - Egyptian, Sabikh - Iraqi, Tahini - common all around the middle east, and what else?\nOnly shakshuka, but all countries have eggs with things added to them. So they call it omlet and not shakshuka 😂.\nI tell you, there is nothing 100% Israeli in israeli food", "created_utc": "1652121308.0", "edited": "False", "id": "i7y9j2z", "is_submitter": "False", "link_id": "t3_ulpfg9", "parent_id": "t1_i7y94fz", "score": "0", "subreddit": "AskMiddleEast", "subreddit_id": "t5_vkfjx"}, {"author": "Correct-Monk-6761", "body": "Oh sorry, yeah there is no such thing as Israeli food, it's all from elsewhere..", "created_utc": "1652121047.0", "edited": "False", "id": "i7y8w4g", "is_submitter": "False", "link_id": "t3_ulpfg9", "parent_id": "t1_i7y8rd7", "score": "0", "subreddit": "AskMiddleEast", "subreddit_id": "t5_vkfjx"}, {"author": "Correct-Monk-6761", "body": "Sorry did you mean cuisine or food? Because I understood it as literally food..", "created_utc": "1652120963.0", "edited": "False", "id": "i7y8orm", "is_submitter": "False", "link_id": "t3_ulpfg9", "parent_id": "t1_i7y875r", "score": "1", "subreddit": "AskMiddleEast", "subreddit_id": "t5_vkfjx"}, {"author": "Correct-Monk-6761", "body": "Hey, it's not nice of you!\nCome here and see for yourself, no one steals from anyone here, even though we don't cut here hands off, we are not savages:)))", "created_utc": "1652120901.0", "edited": "False", "id": "i7y8j9v", "is_submitter": "False", "link_id": "t3_ulpfg9", "parent_id": "t1_i7y875r", "score": "0", "subreddit": "AskMiddleEast", "subreddit_id": "t5_vkfjx"}, {"author": "Correct-Monk-6761", "body": "I strongly recommend learning one at a time", "created_utc": "1652120677.0", "edited": "False", "id": "i7y7zm7", "is_submitter": "False", "link_id": "t3_ulxaee", "parent_id": "t3_ulxaee", "score": "7", "subreddit": "polyglot", "subreddit_id": "t5_2reiv"}, {"author": "Correct-Monk-6761", "body": "Totally agree with you!\nI live in Israel and arabic food is pretty popular here, like falafel for example and it originated in Egypt.", "created_utc": "1652118932.0", "edited": "False", "id": "i7y3qlk", "is_submitter": "False", "link_id": "t3_ulpfg9", "parent_id": "t1_i7y0p5q", "score": "0", "subreddit": "AskMiddleEast", "subreddit_id": "t5_vkfjx"}, {"author": "Correct-Monk-6761", "body": "I think US food is disgusting - KFC and McDonald's are absolutely terrible. I have no idea how are they so popular around the world. If I would be even given a free meal, I wouldn't eat there.", "created_utc": "1652118449.0", "edited": "False", "id": "i7y2jhz", "is_submitter": "False", "link_id": "t3_ulpfg9", "parent_id": "t3_ulpfg9", "score": "1", "subreddit": "AskMiddleEast", "subreddit_id": "t5_vkfjx"}, {"author": "Correct-Monk-6761", "body": "No, never..\nBut to be sure, be good in bed.. Because even with men I broke up with, if they were amazing in bed I have nothing bad to tell about them😂", "created_utc": "1652117761.0", "edited": "False", "id": "i7y0u0r", "is_submitter": "False", "link_id": "t3_ulr6vh", "parent_id": "t3_ulr6vh", "score": "1", "subreddit": "TooAfraidToAsk", "subreddit_id": "t5_2ssp7"}, {"author": "Correct-Monk-6761", "body": "I listened to a recording of him and it doesn't sound like he can't say it, but his r sounds slightly softer in my opinion.\nBut again, I don't know for sure since his recordings are in very low quality..", "created_utc": "1652100682.0", "edited": "False", "id": "i7wwd1n", "is_submitter": "False", "link_id": "t3_ulg5uf", "parent_id": "t1_i7wtx8u", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Correct-Monk-6761", "body": "Oh really? I used it for Persian and most responded and I also received tons of messages..\nI also found some really good friends there", "created_utc": "1652098601.0", "edited": "False", "id": "i7wskiw", "is_submitter": "False", "link_id": "t3_uloqdf", "parent_id": "t1_i7wo0d5", "score": "7", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Correct-Monk-6761", "body": "Yes tandem is nice👍", "created_utc": "1652098491.0", "edited": "False", "id": "i7wsdrn", "is_submitter": "False", "link_id": "t3_uloqdf", "parent_id": "t3_uloqdf", "score": "4", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Correct-Monk-6761", "body": "It is in Hebrew, it sais nedudim which means wanderings or scatterings (which I think is maybe the name of the shop where it was originally from).\nAnd then it is written: pashut avodat yad which means \"simply handmade\".", "created_utc": "1652096588.0", "edited": "False", "id": "i7wp9i8", "is_submitter": "False", "link_id": "t3_ufqyr1", "parent_id": "t3_ufqyr1", "score": "1", "subreddit": "language", "subreddit_id": "t5_2qlfj"}, {"author": "Correct-Monk-6761", "body": "The R sound is extremely DIFFERENT in every language, I will bring examples only among the languages where I think my R pronunciation is good:\n\nR in Hebrew and French is quite similar, it's a sound you make close to your throat, extremely simple to pronounce in my opinion. Rarely saw Israeli children struggling with it. It feels like only the back portion of the tongue rises upwards and doesn't touch the upper pallet.\n\nR in Russian was the hardest for me to master even though I am a native speaker. It's a rolling r produced by your tongue role close to the upper teeth while you blow air. Here the tongue touches the roof of the mouth close to the teeth. I personally hate this R, I think many russians can't pronounce it.\n\nR in English (American English at least) feels like I am half way of trying to swallow my tongue (because it moves backwards and the tip moves up) but without it touching the roof of the mouth. Pretty counter intuitive..\n\nI hate this letter because every language has a totally different pronunciation of it.", "created_utc": "1652073889.0", "edited": "False", "id": "i7vxrpa", "is_submitter": "False", "link_id": "t3_ulg5uf", "parent_id": "t3_ulg5uf", "score": "8", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Correct-Monk-6761", "body": "I actually found a lot of resources for learning Persian, I think it's popular but not as much as French and Spanish.", "created_utc": "1651919220.0", "edited": "False", "id": "i7nusbd", "is_submitter": "False", "link_id": "t3_udd6oi", "parent_id": "t3_udd6oi", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Correct-Monk-6761", "body": "No, it's like learning Aramaic in order to understand Hebrew and Arabic better later on. It may help, but the time investment doesn't worth it and you better just learn these 2 languages separately!\nSame with latin.\nThe fact languages are connected doesn't make them mutually intelligible and languages tend to be vastly different from each other..", "created_utc": "1651918608.0", "edited": "False", "id": "i7nu2it", "is_submitter": "False", "link_id": "t3_ujsuoe", "parent_id": "t3_ujsuoe", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Correct-Monk-6761", "body": "Learn about other cultures", "created_utc": "1651917479.0", "edited": "False", "id": "i7nsslv", "is_submitter": "False", "link_id": "t3_uk8k9s", "parent_id": "t3_uk8k9s", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Correct-Monk-6761", "body": "I don't know why but actually watching videos works really well for me.\nBut I also love reading and talking so I don't know how much my reading and talking to people influenced my knowledge..\n\nI can try to explain how I approached my learning process:\nI started from reading children books with audio provided so I would first read, try to understand it from reading and then listen to the audio. \n\nThen I gradually started with videos and movies, a lot of these were for children when I just started, I also tend to rewatch content several times and think it helps as well because every single time you listen you pick up something new..\n\nAlso some content is more useful than other:\nI think movies in the target language with subtitles in the target language worked the best for me.", "created_utc": "1651916922.0", "edited": "1651917418.0", "id": "i7ns65h", "is_submitter": "False", "link_id": "t3_uk4c7y", "parent_id": "t3_uk4c7y", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Correct-Monk-6761", "body": "Woman here, it won't inflict pain and you can easily take the entire thing into your mouth during oral😄", "created_utc": "1651915458.0", "edited": "False", "id": "i7nqkoo", "is_submitter": "False", "link_id": "t3_ujl5em", "parent_id": "t3_ujl5em", "score": "2", "subreddit": "TooAfraidToAsk", "subreddit_id": "t5_2ssp7"}, {"author": "Correct-Monk-6761", "body": "No, it can be nice, ok, or really bad... Lifestyle can influence it but it doesn't mean you have to eat pineapples all the time: just not smoking or drinking and less fast food is usually enough..", "created_utc": "1651815180.0", "edited": "False", "id": "i7irwqc", "is_submitter": "False", "link_id": "t3_uivmxa", "parent_id": "t3_uivmxa", "score": "1", "subreddit": "NoStupidQuestions", "subreddit_id": "t5_2w844"}, {"author": "Correct-Monk-6761", "body": "Well, then I think you are good to go!\nI think you are very motivated to learn Ukrainian, good luck!", "created_utc": "1651655434.0", "edited": "False", "id": "i79rpkt", "is_submitter": "False", "link_id": "t3_uhjs38", "parent_id": "t1_i79rflv", "score": "2", "subreddit": "polyglot", "subreddit_id": "t5_2reiv"}, {"author": "Correct-Monk-6761", "body": "But all ukranians understand Russian.🙄\nI think it is actually more disrespectful from ukranians towards you who are treating you differently for speaking Russian rather than the opposite.\nAnyways, consider at least starting Ukranian only after you become more confident in Russian..", "created_utc": "1651655058.0", "edited": "False", "id": "i79rbi5", "is_submitter": "False", "link_id": "t3_uhjs38", "parent_id": "t1_i79pcer", "score": "2", "subreddit": "polyglot", "subreddit_id": "t5_2reiv"}, {"author": "Correct-Monk-6761", "body": "Why do you want to learn Ukranian? Most Russian speakers can understand ukranian to a good extent (it's like 90-95%), so I think you should just focus on Russian honestly, because if you are not very fluent in Russian you will start confusing Russian and Ukranian words because they are so similar..", "created_utc": "1651637802.0", "edited": "False", "id": "i7945l9", "is_submitter": "False", "link_id": "t3_uhjs38", "parent_id": "t1_i77d2f1", "score": "1", "subreddit": "polyglot", "subreddit_id": "t5_2reiv"}, {"author": "Correct-Monk-6761", "body": "Oh now I see.. Here we are very gay friendly in Israel", "created_utc": "1650998913.0", "edited": "False", "id": "i6aukfp", "is_submitter": "False", "link_id": "t3_uc5j8s", "parent_id": "t1_i6ar662", "score": "1", "subreddit": "TooAfraidToAsk", "subreddit_id": "t5_2ssp7"}, {"author": "Correct-Monk-6761", "body": "Because Palestinians always attack first.\nAnd also because Israel is a much more productive state than any future Muslim Palestinian country would ever be.\nNo Muslim country benefited the world with its technology like Israel in modern history.", "created_utc": "1650986171.0", "edited": "False", "id": "i69xihq", "is_submitter": "False", "link_id": "t3_u6xb20", "parent_id": "t3_u6xb20", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "Correct-Monk-6761", "body": "I think against russia is justified, against Israel unjustified. Because of two reasons:\n1. The world should support Israel for being the only sane and productive place in the middle east!\nWhat will happen to Israel if it becomes Palestinian? It will probably look like Syria or Lebanon.\nThere is no Muslim country that benefits to the world in technologies as much as Israel, so for the greater good jews should have their own country in this territory. \n2. Israel never attacked the Palestinians first, never. It's always they are throwing rockets first and Israel is reacting. The Palestinian refugees should only blame themselves for attacking Israel first when Israel's independence was announced, Israel doesn't have to let return people who are hostile to it.\nUnlike the case with Russia and Ukraine where russia just took over areas of Ukraine with no provocation.", "created_utc": "1650985918.0", "edited": "False", "id": "i69wvd3", "is_submitter": "False", "link_id": "t3_u8j8v3", "parent_id": "t3_u8j8v3", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "Correct-Monk-6761", "body": "Most companies when they give you their \"new coffee machine\" for a free trial, it might not be entirely new coffee machine as you want to believe. Because first of all it might be produced a long time ago and second of all: \nIf anyone returns a coffee machine after the free trial, the company cleans it from the inside and outside and will give it to another customer as soon as they are done cleaning it.\n\nSo there is a good chance an entire office was using your new coffee machine for a good month before you got it)))", "created_utc": "1650960560.0", "edited": "False", "id": "i68oneq", "is_submitter": "False", "link_id": "t3_uc73nd", "parent_id": "t3_uc73nd", "score": "2", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "Correct-Monk-6761", "body": "Only positively:\nCaffeine is also a drug:)", "created_utc": "1650959384.0", "edited": "False", "id": "i68nap0", "is_submitter": "False", "link_id": "t3_uc73z5", "parent_id": "t3_uc73z5", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "Correct-Monk-6761", "body": "I love middle eastern looking people, brown eyes, brown or black hair, light brown skin..", "created_utc": "1650959203.0", "edited": "False", "id": "i68n2xy", "is_submitter": "False", "link_id": "t3_uc748x", "parent_id": "t3_uc748x", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "Correct-Monk-6761", "body": "I think it also depends on culture.. People are very open minded in general where I live and they have access to all kinds of pornography.. \nMany men said to me that they get hot from lesbian porn.", "created_utc": "1650958795.0", "edited": "False", "id": "i68mlnk", "is_submitter": "False", "link_id": "t3_uc5j8s", "parent_id": "t1_i68fc9y", "score": "1", "subreddit": "TooAfraidToAsk", "subreddit_id": "t5_2ssp7"}, {"author": "Correct-Monk-6761", "body": "I am a woman but many men enjoy lesbian porn.. I actually think most men enjoy it to some degree.", "created_utc": "1650952133.0", "edited": "False", "id": "i68e20x", "is_submitter": "False", "link_id": "t3_uc5j8s", "parent_id": "t3_uc5j8s", "score": "1", "subreddit": "TooAfraidToAsk", "subreddit_id": "t5_2ssp7"}, {"author": "Correct-Monk-6761", "body": "No turn off. I would wait with the cancer story for later, you don't want to tell things that are too harsh on first dates. \nBut I do think you should tell about it after several dates.", "created_utc": "1650916557.0", "edited": "False", "id": "i668lnj", "is_submitter": "False", "link_id": "t3_u8xcgc", "parent_id": "t3_u8xcgc", "score": "1", "subreddit": "dating", "subreddit_id": "t5_2qhb1"}, {"author": "Correct-Monk-6761", "body": "I would prefer a virgin man to tell me he is a virgin, I actually think it's pretty cute, that I can sort of introduce him to this world..", "created_utc": "1650916151.0", "edited": "False", "id": "i667juq", "is_submitter": "False", "link_id": "t3_u7npjp", "parent_id": "t3_u7npjp", "score": "2", "subreddit": "dating", "subreddit_id": "t5_2qhb1"}, {"author": "Correct-Monk-6761", "body": "If he asks yes, if he doesn't ask it's up to you", "created_utc": "1650916046.0", "edited": "False", "id": "i6679wy", "is_submitter": "False", "link_id": "t3_ubforu", "parent_id": "t3_ubforu", "score": "2", "subreddit": "dating", "subreddit_id": "t5_2qhb1"}, {"author": "Correct-Monk-6761", "body": "He was an immature and insecure man, anyone who cares about it is either religious fanatic or stupid.", "created_utc": "1650915999.0", "edited": "False", "id": "i6675ka", "is_submitter": "False", "link_id": "t3_u6ncy0", "parent_id": "t3_u6ncy0", "score": "1", "subreddit": "dating", "subreddit_id": "t5_2qhb1"}, {"author": "Correct-Monk-6761", "body": "Your biggest problem is that you don't even try because you think you are doomed, but you are not doomed!\n\nWeight: Eat healthy and in moderation, what you eat is what you will look like. Sincerely this is the biggest change you need to do, both for your health (mental+body) and both for the look. Gym can help a lot, but you have to eat healthy and go to the gym for maximum results. \n\nHair: Shave the head completely! Balding looks silly, but completely bald looks sexy! (like Dwain Johnson).\n\nIf you loose weight your penis will look bigger! I am serious: because everything around it will become smaller.\nBut actually women don't need anything big most of the time to be satisfied. How important for you is the woman's vagina length? This is how unimportant penis length is usually for me and for many other women as well.", "created_utc": "1650915172.0", "edited": "False", "id": "i665152", "is_submitter": "False", "link_id": "t3_u9ivtd", "parent_id": "t3_u9ivtd", "score": "1", "subreddit": "confessions", "subreddit_id": "t5_2qq6g"}, {"author": "Correct-Monk-6761", "body": " She is still the same person, she didn't want to be confronted about her past partners. I think lying about virginity is insignificant, and in many Muslim countries not lying would put her in danger.", "created_utc": "1650912679.0", "edited": "False", "id": "i65yokh", "is_submitter": "False", "link_id": "t3_uavgt4", "parent_id": "t3_uavgt4", "score": "1", "subreddit": "TooAfraidToAsk", "subreddit_id": "t5_2ssp7"}, {"author": "Correct-Monk-6761", "body": "Oh jesus christ!", "created_utc": "1650912410.0", "edited": "False", "id": "i65xzse", "is_submitter": "False", "link_id": "t3_ti0ako", "parent_id": "t3_ti0ako", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "Correct-Monk-6761", "body": "Just relax and enjoy, I think duration is not as important to girls as men think it is.\nShe probably compliments you on the duration in order to make you feel good, not necessarily because she is unhappy with your duration.\nAnd 4-5 isn't bad, and also 1-3 isn't. I would say 30 seconds is unsatisfying if it always happens after 30 seconds..", "created_utc": "1650893374.0", "edited": "1650893604.0", "id": "i64lyk0", "is_submitter": "False", "link_id": "t3_ub84zj", "parent_id": "t1_i643c3w", "score": "2", "subreddit": "sex", "subreddit_id": "t5_2qh3p"}, {"author": "Correct-Monk-6761", "body": "I come quickly myself and want my man to come quickly.. more than 10 minutes feels like an eternity for me..", "created_utc": "1650862114.0", "edited": "1650889730.0", "id": "i63cya1", "is_submitter": "False", "link_id": "t3_ub84zj", "parent_id": "t1_i63az7s", "score": "13", "subreddit": "sex", "subreddit_id": "t5_2qh3p"}, {"author": "Correct-Monk-6761", "body": "I prefer the man to give me a small verbal clue like saying \"I am close\" even though I can usually sense it..", "created_utc": "1650859833.0", "edited": "False", "id": "i6391tg", "is_submitter": "False", "link_id": "t3_u7qdsx", "parent_id": "t3_u7qdsx", "score": "1", "subreddit": "sex", "subreddit_id": "t5_2qh3p"}, {"author": "Correct-Monk-6761", "body": "Does your BF smoke/drink/eat unhealthy? I have been with several men who were living pretty healthy, some had slightly salty taste and one didn't have a taste almost at all and it was even slightly sweet. Never had a bitter guy yet.", "created_utc": "1650859558.0", "edited": "False", "id": "i638k4o", "is_submitter": "False", "link_id": "t3_u7e8y5", "parent_id": "t3_u7e8y5", "score": "1", "subreddit": "sex", "subreddit_id": "t5_2qh3p"}, {"author": "Correct-Monk-6761", "body": "I love the most when men come in my mouth and I swallow it. It is less messy, most men really like it, and also the taste isn't that bad (at least not with those I were with). \nMy least favourite is on the face, it's the messiest and I have to go and wash it afterwards..", "created_utc": "1650858973.0", "edited": "False", "id": "i637gxz", "is_submitter": "False", "link_id": "t3_ub8z7p", "parent_id": "t3_ub8z7p", "score": "4", "subreddit": "sex", "subreddit_id": "t5_2qh3p"}, {"author": "Correct-Monk-6761", "body": "I think it depends also what the woman is doing..\nWhen I do it slowly a guy can last much longer, but usually once I start moving in average or high speed it takes them 1-2 minutes.. I also like it when they orgasm fast because then I feel flattered.\nYou can ask the girl to slow down each time you feel close", "created_utc": "1650858374.0", "edited": "False", "id": "i636czb", "is_submitter": "False", "link_id": "t3_uar9za", "parent_id": "t3_uar9za", "score": "2", "subreddit": "sex", "subreddit_id": "t5_2qh3p"}, {"author": "Correct-Monk-6761", "body": "All men I have been with were circumcised so no one could masturbate like you among them, but they all masturbated slightly differently.. some make a ring with just the thumb and middle finger, some with the whole hand, some do it dry, some do it with lube, some just dry hump the bed.. Whatever makes you enjoy is ok! 😄", "created_utc": "1650857958.0", "edited": "False", "id": "i635l0l", "is_submitter": "False", "link_id": "t3_ub63aj", "parent_id": "t3_ub63aj", "score": "1", "subreddit": "sex", "subreddit_id": "t5_2qh3p"}, {"author": "Correct-Monk-6761", "body": "I actually love it when man comes quickly, don't feel pressure to perform, she does it because she likes that..", "created_utc": "1650857010.0", "edited": "False", "id": "i633s0d", "is_submitter": "False", "link_id": "t3_ub84zj", "parent_id": "t3_ub84zj", "score": "40", "subreddit": "sex", "subreddit_id": "t5_2qh3p"}, {"author": "Correct-Monk-6761", "body": "\nIf I was a man I would be pissed off. And as a woman:\nI don't want to feel like my man doesn't like my \"juices\" so I expect the girls also not to get disgusted by men's semen..", "created_utc": "1650836867.0", "edited": "1650837563.0", "id": "i61wjez", "is_submitter": "False", "link_id": "t3_uad8kj", "parent_id": "t3_uad8kj", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "Correct-Monk-6761", "body": "I really like it when a guy comes fast from oral because then think it means that I am REALLY GOOD😂", "created_utc": "1650734127.0", "edited": "False", "id": "i5wd2iz", "is_submitter": "False", "link_id": "t3_tedv36", "parent_id": "t3_tedv36", "score": "1", "subreddit": "AskRedditAfterDark", "subreddit_id": "t5_2vh2s"}, {"author": "Correct-Monk-6761", "body": "It was really nice, we planned it:\nHe payed for an entire floor in a nice house, we both emmidiately went to the bedroom and started kissing.. We were kissing each other everywhere for a good hour, we also gave oral to each other and emmidiately after I got off, he entered all the way in, with one quick thrust:\nThe initial thrust in was pretty painful and I screamed, he carefully asked me if I want him out, I said no and asked him just to stay inside without moving and so he did . The pain faded away really fast and he started to move very slowly and gently.. \nWhen he started to move, it felt really strange, it wasn't painful but rather unusual!\nI didn't enjoy the feeling in my vagina much but it was ok, the whole situation of him being so close to my body, the kissing and also his pleasure felt really good even though my vagina was still adapting to the new sensations, so overall I definitely felt pleasure during penetration but not from the penetration itself, but rather from everything around that. 😅\n\nIt turned out later that I had a lot of blood, slightly less than my period but it was enough to leave many stains behind 🙈.. hopefully the owner of the place wasn't too mad over the ruined white bedsheets, but he was happy when we also came for the second time and never mentioned it..", "created_utc": "1650729677.0", "edited": "False", "id": "i5w2x26", "is_submitter": "False", "link_id": "t3_u95yyy", "parent_id": "t3_u95yyy", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "Correct-Monk-6761", "body": "The upper word looks kinda like سلت but I don't know any word that is written like that..\nIt probably doesn't mean anything and my best guess is that someone who doesn't know arabic or persian tried to write salt with arabic letters.", "created_utc": "1650705878.0", "edited": "False", "id": "i5uxtz9", "is_submitter": "False", "link_id": "t3_u3b91p", "parent_id": "t3_u3b91p", "score": "1", "subreddit": "PERSIAN", "subreddit_id": "t5_2rzk9"}, {"author": "Correct-Monk-6761", "body": "We don't understand arabic at all😂.\nI know both Hebrew and some Persian and I still don't understand Arabic!\nI know many words have similar route between arabic and Hebrew or arabic and Persian but the pronunciation is so different that it is impossible to understand spoken arabic for Hebrew speakers.\nFor example, the persian word مسلط which I think comes from Arabic, in Hebrew it is sholet, and in a sentence it is just impossible to pick it up but I understand written arabic much better because then I can try to search in my head similar words in Hebrew/Persian..", "created_utc": "1650701713.0", "edited": "False", "id": "i5ut41q", "is_submitter": "False", "link_id": "t3_u9qyob", "parent_id": "t1_i5to0q6", "score": "3", "subreddit": "PERSIAN", "subreddit_id": "t5_2rzk9"}, {"author": "Correct-Monk-6761", "body": "Hebrew speaker here, could clearly understand hamsa=5 and la=no, also think she said faalu which I think means \"they did\" or maybe \"an action\"... I think she also said sababa there and it means ok in Hebrew slang but probably it was just a similar sounding word or combination of words, because it didn't really make sense in my head 😂..\n\nI know both Hebrew and some Persian and still can't understand Arabic!", "created_utc": "1650700492.0", "edited": "1650701888.0", "id": "i5urobt", "is_submitter": "False", "link_id": "t3_u9qyob", "parent_id": "t3_u9qyob", "score": "3", "subreddit": "PERSIAN", "subreddit_id": "t5_2rzk9"}, {"author": "Correct-Monk-6761", "body": "Oral = 1-2 minutes if he also puts 2 fingers inside while licking (I adore this sensation!!!), 2-4 oral with nothing inside, 4-6 minutes hands, penetration with direct clitoral stimulation = it depends but anywhere between 30 seconds and 10 minutes, penetration alone= never(((..", "created_utc": "1650697203.0", "edited": "False", "id": "i5uno5e", "is_submitter": "False", "link_id": "t3_tsk0jr", "parent_id": "t3_tsk0jr", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "Correct-Monk-6761", "body": "I once orgasmed from being kissed on the neck but I hardly ever come from penetration, what counts as sex?", "created_utc": "1650696828.0", "edited": "False", "id": "i5un7e2", "is_submitter": "False", "link_id": "t3_u5r34u", "parent_id": "t3_u5r34u", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "Correct-Monk-6761", "body": "I don't, but with oral it takes me 2 minutes", "created_utc": "1650696527.0", "edited": "False", "id": "i5umtv0", "is_submitter": "False", "link_id": "t3_u3ybyo", "parent_id": "t3_u3ybyo", "score": "1", "subreddit": "AskRedditAfterDark", "subreddit_id": "t5_2vh2s"}, {"author": "Correct-Monk-6761", "body": "1-3 minutes. But if it is my second/ 3rd/4th orgasm in that evening, it might take me up to 5 minutes.\n(That's if the performance is good, if it's really bad I might never orgasm😂)", "created_utc": "1650696309.0", "edited": "False", "id": "i5umjtk", "is_submitter": "False", "link_id": "t3_u4cw0l", "parent_id": "t3_u4cw0l", "score": "1", "subreddit": "AskRedditAfterDark", "subreddit_id": "t5_2vh2s"}, {"author": "Correct-Monk-6761", "body": "4 but I usually just feel tired after 3 to continue any further without a small break..", "created_utc": "1650695847.0", "edited": "False", "id": "i5ulyrp", "is_submitter": "False", "link_id": "t3_sa1wk6", "parent_id": "t3_sa1wk6", "score": "1", "subreddit": "AskRedditAfterDark", "subreddit_id": "t5_2vh2s"}, {"author": "Correct-Monk-6761", "body": "I don't know if it counts as multiple orgasms but usually my first one takes about 1-3 minutes and then I can orgasm basically every 2-5 minutes if the stimulation continues.. After the 3rd time I would feel pretty tired and need some rest....\nIn one day I think my maximum is between 8-10, but I feel mentally and physically drained after that..\n\nSometimes I prefer to have just one orgasm and rest afterwards, but sometimes I feel even hotter after my first orgasm and want it to continue to the second and sometimes third..  All orgasms feel nice and powerful but I also get more tired the more times I do it in a row... I don't think I can possibly do it more than 4 times in a row..", "created_utc": "1650694534.0", "edited": "False", "id": "i5uk8i2", "is_submitter": "False", "link_id": "t3_tjvwmq", "parent_id": "t3_tjvwmq", "score": "1", "subreddit": "AskRedditAfterDark", "subreddit_id": "t5_2vh2s"}, {"author": "Correct-Monk-6761", "body": "I also orgasm mostly from oral and PIV feels really good for me right after I orgasm from oral. So don't be harsh to her, it just feels good...\n\nBut doing the same things over and over again feels repetitive...I personally also really love giving oral to the man first because it makes me really hot (sometimes with happy ending and sometimes just to get him hotter), then PIV, and only then receive oral myself or get off with other ways (sometimes we go to the shower together afterwards and I finish there using a stream of water from the showerhead)..\nAlso try maybe finding ways of stimulating her clit during intercourse, so she would also orgasm during it and it wouldn't feel to you like you are \"using her\"..", "created_utc": "1650692824.0", "edited": "False", "id": "i5uhz4n", "is_submitter": "False", "link_id": "t3_u6t1e8", "parent_id": "t3_u6t1e8", "score": "2", "subreddit": "sex", "subreddit_id": "t5_2qh3p"}, {"author": "Correct-Monk-6761", "body": "There is something hot when man eats his own cum from a woman's body and I think generally it's not a bad idea to try prostate stimulation.. Women DON'T view their men as less men after that! Actually I think she will only really appreciate you trying for her.\nBut you should both do what you are comfortable with, so maybe try with small steps: first with fingers or a small toy and gradually incorporated new things...\n\nBut I think she can also try more for you and can give oral without the gagging reflex: She can take just the very the head in, and move her hands on the rest of the length. If she can't do that, you can ask her just to lick and kiss the head and do the rest with the hands..\nI also usually don't gag at all if I control the situation, so I think it is better if you lie down and do nothing while she does whatever she is comfortable with..\nOne more thing you can try is her kissing/licking/sucking the balls/anus and doing a handjob in the same time..", "created_utc": "1650690872.0", "edited": "False", "id": "i5uf9ra", "is_submitter": "False", "link_id": "t3_u0jpxx", "parent_id": "t3_u0jpxx", "score": "1", "subreddit": "sex", "subreddit_id": "t5_2qh3p"}, {"author": "Correct-Monk-6761", "body": "Dating", "created_utc": "1650688592.0", "edited": "False", "id": "i5ubsxt", "is_submitter": "False", "link_id": "t3_u9x70y", "parent_id": "t3_u9x70y", "score": "3", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "Correct-Monk-6761", "body": "Master and margarita has two plots and has a very accurate Russian adaptation in a series, I don't know about other adaptations though.", "created_utc": "1650688333.0", "edited": "False", "id": "i5ubday", "is_submitter": "False", "link_id": "t3_u9x7kp", "parent_id": "t3_u9x7kp", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "Correct-Monk-6761", "body": "I think you should accept your body.. It doesn't seem like you have extra weight that is causing it so probably it's just your nature.\nMost guys like it, I also have wide hips and fat tends to store in my lower half (although I am pretty thin).\nI love wearing slightly big bulky shirts so my shoulders and chest would look bigger and more proportional to my hips width, I also think dresses look very good on such body because a dress shows your narrow waste well..\nWhen I was 50kg (I am almost 170cm tall) my legs were very thin as well, but also my ribs were a bit too visible, the veins on my hands became more visible, I disliked being too thin more than having big hips.", "created_utc": "1650625452.0", "edited": "False", "id": "i5qg194", "is_submitter": "False", "link_id": "t3_u9bncp", "parent_id": "t3_u9bncp", "score": "3", "subreddit": "TooAfraidToAsk", "subreddit_id": "t5_2ssp7"}, {"author": "Correct-Monk-6761", "body": "HIV is for life and herpes may also come back from time to time and when it is genital herpes it is pretty uncomfortable...", "created_utc": "1650623885.0", "edited": "False", "id": "i5qdv10", "is_submitter": "False", "link_id": "t3_u99z2d", "parent_id": "t1_i5qakih", "score": "3", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "Correct-Monk-6761", "body": "A goldfish, because if it's immortal you will be able to take it finally out of the water and pet it 😄", "created_utc": "1650617686.0", "edited": "False", "id": "i5q6ejx", "is_submitter": "False", "link_id": "t3_u99yf8", "parent_id": "t3_u99yf8", "score": "3", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "Correct-Monk-6761", "body": "I wonder how no one mentioned STDs..", "created_utc": "1650617426.0", "edited": "1650623903.0", "id": "i5q6438", "is_submitter": "False", "link_id": "t3_u99z2d", "parent_id": "t3_u99z2d", "score": "2", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "Correct-Monk-6761", "body": "Deep blue", "created_utc": "1650617375.0", "edited": "False", "id": "i5q622h", "is_submitter": "False", "link_id": "t3_u99z6t", "parent_id": "t3_u99z6t", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "Correct-Monk-6761", "body": "Understand my cat", "created_utc": "1650617350.0", "edited": "False", "id": "i5q60zn", "is_submitter": "False", "link_id": "t3_u99zc4", "parent_id": "t3_u99zc4", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "Correct-Monk-6761", "body": "A fireworks show...", "created_utc": "1650217479.0", "edited": "False", "id": "i53ugjk", "is_submitter": "False", "link_id": "t3_u5rzd0", "parent_id": "t3_u5rzd0", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "Correct-Monk-6761", "body": "23 more years to live", "created_utc": "1650217191.0", "edited": "False", "id": "i53tqof", "is_submitter": "False", "link_id": "t3_u5s187", "parent_id": "t3_u5s187", "score": "4", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "Correct-Monk-6761", "body": "Heroes of might and magic 3", "created_utc": "1650058713.0", "edited": "False", "id": "i4vsqbw", "is_submitter": "False", "link_id": "t3_u452b6", "parent_id": "t3_u452b6", "score": "2", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "Correct-Monk-6761", "body": "Well, I actually learned it from my grandmother who was from Tajikistan and used to put a lot of spices into the food. I was very young so I don't remember exactly how it went, but I guess I just asked her what are those seeds in the rice😄...\nMy grandmother died when I was 4 years old or so, so sadly I didn't learn any other persian words until I became an adult..", "created_utc": "1650030426.0", "edited": "False", "id": "i4txp64", "is_submitter": "False", "link_id": "t3_u44z88", "parent_id": "t1_i4tsd3r", "score": "4", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Correct-Monk-6761", "body": "Zire - cumin. But it's a long story how it became my first word in Persian 😅..", "created_utc": "1650027592.0", "edited": "False", "id": "i4trynw", "is_submitter": "False", "link_id": "t3_u44z88", "parent_id": "t3_u44z88", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Correct-Monk-6761", "body": "I know that some just stubbornly don't want to learn the local language. But in that case, the environment is also allowing them to do so:\nLike some people constantly use their children/friends to translate everything, or certain societies speak English better than others and then they don't really need to learn the local language..", "created_utc": "1650026300.0", "edited": "1650026517.0", "id": "i4tpiem", "is_submitter": "False", "link_id": "t3_txsksu", "parent_id": "t1_i4tlepf", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Correct-Monk-6761", "body": "Stop masturbating during prayer...", "created_utc": "1650004579.0", "edited": "False", "id": "i4swxcd", "is_submitter": "False", "link_id": "t3_u3hbuv", "parent_id": "t3_u3hbuv", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "Correct-Monk-6761", "body": "When I am trying to be more logical I would think in English, it's like my language for logical assessment of everything😅.\nWhen I feel romantic or artistic I would often switch to Russian.. \nWhen bored or hungry I might think in Hebrew, don't know why..\nI also sometimes catch myself thinking in Persian but didn't notice a special connection to something specific yet..", "created_utc": "1649887227.0", "edited": "False", "id": "i4mfj1o", "is_submitter": "False", "link_id": "t3_tycdmi", "parent_id": "t3_tycdmi", "score": "3", "subreddit": "polyglot", "subreddit_id": "t5_2reiv"}, {"author": "Correct-Monk-6761", "body": "I don't know why but I really enjoy Persian.. I have been learning it for a year already and I don't regret choosing it!\nIt's melodic, beautiful and poetic language with rich culture 😄.\nRussian and Hebrew will be more difficult for an English speaker in my opinion (I am native in both)\nFrench is nice, I think it is relatively close to Spanish in its vocabulary..", "created_utc": "1649881497.0", "edited": "False", "id": "i4m10m2", "is_submitter": "False", "link_id": "t3_u1i8sz", "parent_id": "t3_u1i8sz", "score": "2", "subreddit": "polyglot", "subreddit_id": "t5_2reiv"}, {"author": "Correct-Monk-6761", "body": "I am also learning Persian but I do it already for a year or so and can help you with materials!!!! \n\nI really enjoyed the content on this website which provides both audio and reading:\nhttps://www.storybookscanada.ca/stories/fa/\nI think it is the best place to start reading children books for complete beginners!\n\nThere are also some YouTube videos that can be helpful, you can easily find something you like on that channel:\nhttps://youtube.com/c/PersianLearning\nThis channel is really rich with content and it has some videos that were really helpful for me.\n\nYou can also learn from songs so here are a couple I liked, one of these is from that channel I just mentioned:\nhttps://youtu.be/FVxFigJed58\nhttps://youtu.be/VYs2mwXQuRY\n\nAnother nice content is the series cafe denj which is on an intermediate level and probably can be difficult for you at this point, but it has persian subtitles and translation and this is one of my favourite resources:\nhttps://farsi.school/library/series/cafe-denj\n\nI love learning from reading, watching movies and listening to songs so most of the things I did are related to that.. I sadly can't help with grammar much if you want books that explain the Grammar....\n\nI feel like there are a lot of materials and actually their amount grows substantially the moment you get into the upper intermediate level! Once you begin to understand around 60%, there are many children books and news in Persian out there that you can read and also many American dubbed movies or iranian movies for free...\n(Actually, one of the best things in learning this language is that you can have access to almost every American movie for free😂.. they have no respect for copyright rights...)", "created_utc": "1649881107.0", "edited": "False", "id": "i4m01c1", "is_submitter": "False", "link_id": "t3_u1i8sz", "parent_id": "t1_i4eiddy", "score": "3", "subreddit": "polyglot", "subreddit_id": "t5_2reiv"}, {"author": "Correct-Monk-6761", "body": "Well, I know you are frustrated, but the people around you just react naturally out of fear..\n\nI live in Israel and sincerely, I get scared every time I see someone who looks like an arab or speaks with an arabic accent... \nWe had a terrorist attack in Tel Aviv recently where 5 people were killed and the day afterwards when I went to work and I entered the office, I saw a new arab worker that I didn't see there before and my heart literally sank from fear...\n\nI really wish I wouldn't feel like this, because in a different world, rather than being scared of a young arab man I would probably don't care of his presence and if I would care it would be to ask him out for a date... \nBut right now my fear is stopping me to get anywhere near unfamiliar arabs...\n\nI should also say that I personally know a person who was stubbed several years ago by an Israeli arab and was severely injured.. \nShe is ok now, but it makes you even more careful after it happens to someone close to you...", "created_utc": "1649875301.0", "edited": "False", "id": "i4llq7d", "is_submitter": "False", "link_id": "t3_u2wpns", "parent_id": "t3_u2wpns", "score": "1", "subreddit": "TrueOffMyChest", "subreddit_id": "t5_2yuqy"}, {"author": "Correct-Monk-6761", "body": "Well, as a girl I think that the penis isn't the sexiest organ in a man, his brain is.\nPenises are fun, but even the total absence of one is not a deal breaker for me if I like that person. For some girls it is going to be a deal breaker, but others will love you no matter what you have down there.\n\nEdit: large penises are painful, I would prefer an extremely small one to a large one..", "created_utc": "1649872876.0", "edited": "1649873256.0", "id": "i4lfd9l", "is_submitter": "False", "link_id": "t3_u2lyd9", "parent_id": "t3_u2lyd9", "score": "2", "subreddit": "TrueOffMyChest", "subreddit_id": "t5_2yuqy"}, {"author": "Correct-Monk-6761", "body": "A dishonest YouTuber:\nI learned French in  7 days.\nAn honest one: I took French classes in highschool for couple of years but got pretty rusty, so I am gonna show you how much it improved in the last 7 days and even after that improvement I am still gonna speak like a French 3 year old..", "created_utc": "1649767058.0", "edited": "False", "id": "i4f58iq", "is_submitter": "False", "link_id": "t3_u1rjyz", "parent_id": "t3_u1rjyz", "score": "14", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Correct-Monk-6761", "body": "That masturbation releases demons that will always remain with you to haunt you😂", "created_utc": "1649717812.0", "edited": "False", "id": "i4csnh3", "is_submitter": "False", "link_id": "t3_u1he1r", "parent_id": "t3_u1he1r", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "Correct-Monk-6761", "body": "Look, it is really sad that you had to go through this but I think you should relax and just love your organ as it is now: my ex also had a bad looking scar from his circumcision.. I don't care of scars and also the penis is not the most important organ in a man, his brain is🤗😍.\nI think you should do a surgery only if it harms functionality, if it doesn't then I think most partners also won't care..", "created_utc": "1649715384.0", "edited": "False", "id": "i4cmtyc", "is_submitter": "False", "link_id": "t3_u1b0lu", "parent_id": "t3_u1b0lu", "score": "-4", "subreddit": "TrueOffMyChest", "subreddit_id": "t5_2yuqy"}, {"author": "Correct-Monk-6761", "body": "Israeli woman here, all the men I ever met were circumcised, never met a man who resented circumcision as a practice... \nI am sure they exist, but they are the minority here in my opinion.\nI don't think that Israelis are less sensitive down there, I never was with an uncircumcised man so I can't compare, but I think because most had it done very early on in their life, their body adapted to it and they feel the same amount of pleasure. \n\nIt also doesn't seem like Israelis last longer in general.. I guess it depends on personal preferences more than on the circumcision.. Some are extremely sensitive and come in less than 30 seconds, while others can last for hours..", "created_utc": "1649713654.0", "edited": "False", "id": "i4cikju", "is_submitter": "False", "link_id": "t3_u176vi", "parent_id": "t3_u176vi", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "Correct-Monk-6761", "body": "Come to Israel, more than 95% are circumcised here😄", "created_utc": "1649710610.0", "edited": "False", "id": "i4cas6j", "is_submitter": "False", "link_id": "t3_u176vi", "parent_id": "t1_i4akyto", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "Correct-Monk-6761", "body": "No, I tried to apply for such jobs, but they want people with official degrees or a lot of proven experience and I am too young to match these requirements. I am a computer science student right now, but I love languages so much that I might try finding a good job in this field later on.", "created_utc": "1649709988.0", "edited": "False", "id": "i4c95os", "is_submitter": "False", "link_id": "t3_u11c2f", "parent_id": "t1_i4bv66s", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Correct-Monk-6761", "body": "I feel that in every language I speak, the R sound is completely different (only Hebrew and French have similar Rs). My mom can't pronounce the American R and I have another friend from Russia who can't pronounce the Russian R, and also pronounces it like the Israeli R!😄 You are definitely not alone!", "created_utc": "1649705927.0", "edited": "False", "id": "i4bys6g", "is_submitter": "False", "link_id": "t3_u11c2f", "parent_id": "t1_i4bh5as", "score": "5", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Correct-Monk-6761", "body": "Here actually, some highschools and universities teach Persian, but there is still not enough content in Hebrew...\nThere is only one book I could find in Hebrew that teaches the basics in Persian and almost no good content accept for that.\nSo, basically it's only resources in English or just plain monolingual Persian content 😅..", "created_utc": "1649704317.0", "edited": "False", "id": "i4buraw", "is_submitter": "False", "link_id": "t3_u11c2f", "parent_id": "t1_i4bmi8e", "score": "6", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Correct-Monk-6761", "body": "Of course! \nI speak both Hebrew and Russian since early childhood and I can read and write in both almost equally well. My writing in Russian is slightly worse in my opinion (but still better than my English), I guess it is because I received my education in Hebrew.", "created_utc": "1649695836.0", "edited": "False", "id": "i4bbt7c", "is_submitter": "False", "link_id": "t3_u11c2f", "parent_id": "t1_i4b69o8", "score": "4", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Correct-Monk-6761", "body": "I think I struggle to understand most English speakers who try to learn Russian, because of their accent... I had a friend who got to B2 in Russian, but I struggled to understand him when he spoke:\nIt felt almost like trying to understand someone who speaks Bulgarian..", "created_utc": "1649687314.0", "edited": "False", "id": "i4aqhup", "is_submitter": "False", "link_id": "t3_u135xw", "parent_id": "t3_u135xw", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Correct-Monk-6761", "body": "I am native in Hebrew and know some basics in Arabic and think that they are extremely close, especially in their grammar but also I think about 50% of words in Hebrew have a very similar word in Arabic..\nBut Hebrew is indeed easier (in its pronunciation and the fact we don't really have dialects)..", "created_utc": "1649684915.0", "edited": "1649686376.0", "id": "i4aktes", "is_submitter": "False", "link_id": "t3_u0rcnu", "parent_id": "t1_i49fe7l", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Correct-Monk-6761", "body": "I don't know enough about all the Languages you listed, I agree that Thai is probably harder than Korean but I don't speak these two..\nArabic is very hard for English speakers in almost every aspect:\nAbsolutely different grammar, different writing system, difficult pronunciation and don't forget its many dialects..\nIt deserves a place in the top hardest.\n\nWhy arabic and not Hebrew?\nThe grammar is almost the same, so this is not the reason.\nPronunciation of words: \nHebrew is definitely easier in this aspect in my opinion.\nWriting system:\nHebrew has the same writing system as arabic (the letters are different but it's very similar to the way you write words in Arabic).. But Hebrew has less letters and most letters don't have a different form when they are at the beginning/middle/end unlike Arabic, accept for 5 letters that have a slightly different form when they are at the end of the word. Maybe it plays an insignificant role as well.\nVocabulary: I think probably Hebrew is less rich than Arabic, because Hebrew was dormant for many years and arabic changed throughout all that time.\nAlso you have to first learn some MSA and then a dialect, because sometimes different dialects have not only different accents, but actually different words for the same stuff.\nAnd in Hebrew we don't really have dialects (Wikipedia sais we do, but here in Israel everyone speaks pretty much the same).", "created_utc": "1649684226.0", "edited": "1649685149.0", "id": "i4aj9do", "is_submitter": "False", "link_id": "t3_u0rcnu", "parent_id": "t3_u0rcnu", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Correct-Monk-6761", "body": "Wow, it is so true! If I didn't learn English first, I wouldn't be able to learn Persian because there are just not enough resources to do so for Hebrew or Russian speakers.. \nEnglish speakers are very lucky in that regard that they can immediately learn whatever language they want, without the need to learn English first or the struggle to find any resources in your first language..", "created_utc": "1649671805.0", "edited": "False", "id": "i49xnyi", "is_submitter": "False", "link_id": "t3_u11c2f", "parent_id": "t1_i49ja0o", "score": "43", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Correct-Monk-6761", "body": "Hebrew for me often sounds pretty boring, but many people outside Israel think it is very exotic 😂...\nBut I am actually glad I am native in both Russian and Hebrew.", "created_utc": "1649671440.0", "edited": "1649696049.0", "id": "i49x79m", "is_submitter": "False", "link_id": "t3_u11c2f", "parent_id": "t3_u11c2f", "score": "12", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Correct-Monk-6761", "body": "Absolutely not!\nIt sounds extremely difficult to translate everything all the time!!!\nI sincerely never translated in my head from English or Persian into my own languages. But when I was a beginner in Persian I would sometimes think about the things I want to say in English and then translate them into Persian (English is actually my 3rd language, but I guess my mind chose it because it is the closest language to Persian that I currently know😅).\nBut it naturally stopped after 2-3 months...", "created_utc": "1649669850.0", "edited": "False", "id": "i49v7ql", "is_submitter": "False", "link_id": "t3_u0yo6o", "parent_id": "t3_u0yo6o", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Correct-Monk-6761", "body": "You know, people are the same everywhere, so don't feel bad for the US... There are not so many places better than the US and most places are much worst in my opinion (everywhere in Africa, the middle east, north Korea, Afghanistan, Syria, Russia, Kazakhstan, Tajikistan, Ukraine (even before the war lol)..).\nSo actually, the US nailed it in many aspects!\nYou are a democratic and free country, you should be proud of yourself..\n\nNow, about the claims that Americans are stupid:\nPeople in the US often think their culture is superior to other cultures so they don't learn much about the world around them. BUT, exactly the same thing can also be said about other places! I am not sure that most Russians are aware that Iran and Iraq are two different countries, or can name more than 2-3 countries located in Africa..\nBut also same happens with the opposite: many smart and EDUCATED people from Iran don't know who is Chekhov or Tchaikovsky..\n\nSo this lack of knowledge in geography, history, art etc, is actually very common not only in western societies but in eastern societies as well.\nI think the only feature that sets Americans apart is that instead of saying \"I don't know\" like the most, they often try to guess, which makes them look more stupid than if they would just say they don't know.\n\nThere are several things you mentioned that I also want to briefly address:\nWhy many people in the US are monolingual? Because they don't have to learn another language.\nWhy people eat garbage in the US? People eat garbage everywhere! So instead of hamburgers, chips and hotdogs, they eat sabikh, falafel and shawarma... It's still not healthy.\nWhy the healthcare is expensive: most people have insurance and at least American doctors are good..\nSo it's not as bad as many make it sound..\nWhy Americans smile a lot? Russians smile less and many people think they are hostile or grumpy because of that. So fake smiles arn't that bad...\nThe measurement systems: you have the right to use whatever you want.. \n\nPeople are the same EVERYWHERE, you should always remember this..", "created_utc": "1649629612.0", "edited": "False", "id": "i47y242", "is_submitter": "False", "link_id": "t3_ty8r2a", "parent_id": "t3_ty8r2a", "score": "1", "subreddit": "offmychest", "subreddit_id": "t5_2ranw"}, {"author": "Correct-Monk-6761", "body": "I think it's normal to learn the new country's language if you are planning to stay for more than couple of months.. I don't think it is related to self esteem much, because when u move to another country you don't have much choice: You either learn it or it will always limit you...", "created_utc": "1649625234.0", "edited": "False", "id": "i47nybp", "is_submitter": "False", "link_id": "t3_txsksu", "parent_id": "t3_txsksu", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Correct-Monk-6761", "body": "Vocabulary, without that you won't understand anything. But without grammar and lots of vocabulary,  you will understand a lot.", "created_utc": "1649592926.0", "edited": "False", "id": "i45llny", "is_submitter": "False", "link_id": "t3_u025xf", "parent_id": "t3_u025xf", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Correct-Monk-6761", "body": "When I was a kid and my English was horrible, I accidentally called it \"pen*s butter\" and everyone around me started laughing like crazy 😂..\nI didn't understand what was so funny about it and no one wanted to explain me😂..", "created_utc": "1649569031.0", "edited": "False", "id": "i44pjjo", "is_submitter": "False", "link_id": "t3_tzwumx", "parent_id": "t3_tzwumx", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "Correct-Monk-6761", "body": "When there are several arab coworkers with you in the same office and you go to your lunch break as usual during Ramadan..", "created_utc": "1649568217.0", "edited": "False", "id": "i44o79t", "is_submitter": "False", "link_id": "t3_tzn2b8", "parent_id": "t3_tzn2b8", "score": "2", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "Correct-Monk-6761", "body": "The total sum in my bank account..", "created_utc": "1649568072.0", "edited": "False", "id": "i44nyy3", "is_submitter": "False", "link_id": "t3_tzzxtd", "parent_id": "t3_tzzxtd", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "Correct-Monk-6761", "body": "My most favorite teacher was severly wounded in a terrorist attack... She is fine now, but I still feel it changed something inside me.", "created_utc": "1649567260.0", "edited": "False", "id": "i44mlxq", "is_submitter": "False", "link_id": "t3_tzywis", "parent_id": "t3_tzywis", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "Correct-Monk-6761", "body": "Well, I agree with you, I know it can work on some people, but it is not good for everyone.\nI personally don't like this method, I don't enjoy it and feel like my mind is forced to jump back and forth between tasks.. I guess I am just not so talented at multitasking as some other people.\nI also don't know where are you from but I guess you don't live in Tel Aviv or anywhere near it: kids can run towards the road, many people ride here on electric bikes or motorcycles and dangerously pass between cars.. I don't feel it is safe for me to do so in the environment I live in, I would probably ignore the audiobook completely because I am so concentrated on the road and if I will pay attention to it, it may cause me to loose my attention on the road during a critical moment.", "created_utc": "1649530171.0", "edited": "False", "id": "i42g1k3", "is_submitter": "False", "link_id": "t3_tzi6q7", "parent_id": "t1_i41xv4v", "score": "6", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Correct-Monk-6761", "body": "I love reading children's books and watching movies (mainly dubbed or for kids because they speak more clearly).\n\nSome vocabulary sinks in quite naturally:\nFor example the word \"snowman\" is repeated a dozen of times in Frozen & even if you don't know a single word in your target language, you are likely to recognize the word for snowman later on. \n\nSometimes I write down a new word in a cute little notebook, alongside with its pronunciation and a sentence or two using that word (and of course I regularly review these words). \nI think it is also important to learn how to use the word and be confident that you know how to use it yourself, this is why I write these sentences..\nI rarely ever write down the translation of words, I just feel it is mostly unnecessary at this point, because I try to come up with good sentences or I just write down the word's synonym in Persian if I know it... I might also write an explanation of it in Persian in two words..\nSo most of the time, unless it is a very obscure word, I would use persian to convey its meaning.", "created_utc": "1649528568.0", "edited": "False", "id": "i42c5sm", "is_submitter": "False", "link_id": "t3_tzi6q7", "parent_id": "t1_i41qqho", "score": "6", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Correct-Monk-6761", "body": "I think that focusing on the grammar is a bad strategy overall and I usually avoid learning grammar rules almost completely..\nI also don't like when people say: I am just listening to an audiobook on my way to and from work while driving and this is how I learned \"language x\"..\nI can't even walk and listen without constantly being distracted by noises and people, so I really don't understand how can you focus on words and on the storyline while driving.. \nYou should focus on driving, while driving! 😂\nAnd in order to understand even children's stories from sound alone, you already should be in a good intermediate level, so I also think that it is not very effective for beginners..", "created_utc": "1649496244.0", "edited": "False", "id": "i40jtei", "is_submitter": "False", "link_id": "t3_tzi6q7", "parent_id": "t1_i40c1zm", "score": "39", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Correct-Monk-6761", "body": "I think that big noses are more attractive that small ones in men. But I don't really think of noses as an important characteristic.... In general, if you don't look good but are confident in yourself, then you will win the heart of most girls😉.", "created_utc": "1649444860.0", "edited": "False", "id": "i3xsr2d", "is_submitter": "False", "link_id": "t3_tz7np2", "parent_id": "t3_tz7np2", "score": "1", "subreddit": "TooAfraidToAsk", "subreddit_id": "t5_2ssp7"}, {"author": "Correct-Monk-6761", "body": "You can ask me, 57kg.", "created_utc": "1649444318.0", "edited": "False", "id": "i3xrdro", "is_submitter": "False", "link_id": "t3_tz809r", "parent_id": "t3_tz809r", "score": "2", "subreddit": "TooAfraidToAsk", "subreddit_id": "t5_2ssp7"}, {"author": "Correct-Monk-6761", "body": "Myth, it is so ridiculous😑.", "created_utc": "1649444010.0", "edited": "False", "id": "i3xqlik", "is_submitter": "False", "link_id": "t3_tz9igj", "parent_id": "t3_tz9igj", "score": "2", "subreddit": "TooAfraidToAsk", "subreddit_id": "t5_2ssp7"}, {"author": "Correct-Monk-6761", "body": "I watched a French movie today and there was lesbian sex there, that wasn't blurred at all..\nAnd why do you think we will never encounter violence? We encounter bombings, terrorist attacks and stones are being thrown at vehicles.. But hey, I live in Israel, so lucky you:)", "created_utc": "1649443609.0", "edited": "False", "id": "i3xpko4", "is_submitter": "False", "link_id": "t3_tza7du", "parent_id": "t3_tza7du", "score": "5", "subreddit": "TooAfraidToAsk", "subreddit_id": "t5_2ssp7"}, {"author": "Correct-Monk-6761", "body": "I absolutely adore chest hair and I actually love it when it's long enough so I can run my fingers across it..  I never saw a man who was too hairy for me and any amount of hair is welcomed🥰.. \nI think most like it or don't care and you can usually just ask the girl you are dating with, what she wants and likes..", "created_utc": "1649443335.0", "edited": "False", "id": "i3xov68", "is_submitter": "False", "link_id": "t3_txg4vf", "parent_id": "t3_txg4vf", "score": "1", "subreddit": "TooAfraidToAsk", "subreddit_id": "t5_2ssp7"}, {"author": "Correct-Monk-6761", "body": "I really want to speak at least 2 more languages.\nI speak Russian, English and Hebrew and after I will feel more confident in my Persian, I would probably start learning Korean or Arabic, or I may decide to improve my French which is pretty limited at the moment.\nAnyways, I actually hope that I won't stop learning languages after hitting a certain number😄.", "created_utc": "1649432732.0", "edited": "False", "id": "i3wwurv", "is_submitter": "False", "link_id": "t3_tyodaf", "parent_id": "t3_tyodaf", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Correct-Monk-6761", "body": "Yeah, Russian and Ukranian are very similar, if you know Russian well you will also be able understand ukranian to some extent..", "created_utc": "1649315790.0", "edited": "False", "id": "i3qgdzn", "is_submitter": "False", "link_id": "t3_txf8u8", "parent_id": "t1_i3q7kn4", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Correct-Monk-6761", "body": "Sincerely, in both you will get to the moment when you realize they are much harder than you thought and feel like u are hitting a brick wall...\nAnd many people give up at this point..\nBut with Russian you can at least start reading very early on. So definitely Russian, because reading is important in my opinion..", "created_utc": "1649306223.0", "edited": "False", "id": "i3q2u90", "is_submitter": "False", "link_id": "t3_txwy0m", "parent_id": "t3_txwy0m", "score": "3", "subreddit": "thisorthatlanguage", "subreddit_id": "t5_4inj8f"}, {"author": "Correct-Monk-6761", "body": "Do you have WiFi here?\nTake a screenshot.\nHey Google!", "created_utc": "1649279128.0", "edited": "False", "id": "i3og1kg", "is_submitter": "False", "link_id": "t3_txrj43", "parent_id": "t3_txrj43", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "Correct-Monk-6761", "body": " I am not sure if it was Russian with a small grammatical mistake or Ukranian 😂\nShe said that you mix it with \" ruskay\", but it's a mistake and you should say ruskim:\nТы его немного смешиваешь с Русским = you mix it (Ukranian) with Russian  a little bit.\n\nBut maybe it's in Ukranian.. I really don't know.. \nIt sounds like Russian with a mistake to me..\n\nEdit: I listened to it again, I think now it is probably still ukranian and not Russian with mistakes 😂..", "created_utc": "1649277784.0", "edited": "1649278467.0", "id": "i3ocg3f", "is_submitter": "False", "link_id": "t3_txf8u8", "parent_id": "t1_i3ob4co", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Correct-Monk-6761", "body": "I hope I will start learning Korean one day, I actually enjoy it more when a language doesn't resemble anything I know.. I felt that Persian for me was completely alien in its grammar and it took me longer to start understanding it than with French..\nMaybe because Persian is the only language I currently speak where the verb is at the end of the sentence and it was just really strange for me in the beginning, also some verbs go in pairs with another verbs and that second verb for most of the time doesn't mean much, but sometimes it may make a verb passive or active, or make the difference between clapping your hands and waving.\nFor example if I translate: man be khondan alaaghe daaram, into English word by word it would be like:\nI to reading like have = I like reading.\n(Alaaghe is more like fondness or interest, but I think the word like is more accurate for this sentence).\nSo it is just mind-blowing when you are a beginner that the words order is so different than what you expect languages to be like.... But I do enjoy other aspects of its grammar, for example objects don't have genders unlike Russian, Hebrew and French..\nLike in french I would have to remember if it's un livre or une livre for every single object.\nSo although alien in one aspect, it was easier to learn new words in Persian because I didn't have to think about the gender of the words..", "created_utc": "1649264414.0", "edited": "False", "id": "i3nc8ap", "is_submitter": "False", "link_id": "t3_txnsyv", "parent_id": "t1_i3n5xuz", "score": "0", "subreddit": "thisorthatlanguage", "subreddit_id": "t5_4inj8f"}, {"author": "Correct-Monk-6761", "body": "I actually wish I was darker, I live in Israel and people treat me here as if I am a Russian immigrant although I was born here and always lived here...\nAnd the Israeli sun is pretty harsh on my skin as well, I have to put sunscreen on every single exposed centimeter during the summer or I will be burned after 15-20 minutes. \nWhenever I go to the beach with my friends, I feel like it takes me an eternity to cover every single exposed bit of skin with sunscreen, while they only put some on the nose and shoulders and I am pretty jealous they don't get burned easily..\nIf I was black, I would still be treated badly but at least the sun won't burn me anymore😄.\n\nAnd I can't get a tan by the way, I only get more freckles if I accidentally burn my skin... \nSo any comments like: \"why are you so white, go and get some sun!\", are especially annoying..", "created_utc": "1649262469.0", "edited": "False", "id": "i3n73am", "is_submitter": "False", "link_id": "t3_tgcrhe", "parent_id": "t3_tgcrhe", "score": "1", "subreddit": "racism", "subreddit_id": "t5_2qhgd"}, {"author": "Correct-Monk-6761", "body": "I actually wish I was darker, I live in Israel and people treat me here as if I am a Russian immigrant although I was born here and always lived here...\nAnd the Israeli sun is pretty harsh on my skin as well, I have to put sunscreen on every single exposed centimeter during the summer or I will be burned after 15-20 minutes. \nWhenever I go to the beach with my friends, I feel like it takes me an eternity to cover every single exposed bit of skin while they only put some on the nose and shoulders, and I am pretty jealous they don't get burned easily..\nIf I was black, I would still be treated badly but at least the sun won't burn me anymore😄.\n\nAnd I can't get a tan by the way, I only get more freckles if I accidentally burn my skin... \nSo any comments like: \"why are you so white, go and get some sun!\", are especially annoying..", "created_utc": "1649262444.0", "edited": "False", "id": "i3n71xb", "is_submitter": "False", "link_id": "t3_tgcrhe", "parent_id": "t3_tgcrhe", "score": "1", "subreddit": "racism", "subreddit_id": "t5_2qhgd"}, {"author": "Correct-Monk-6761", "body": "I would go for Korean simply because their writing system is easier and it is important for me to be able to read and write, I don't know much about the grammar in these languages though..", "created_utc": "1649261230.0", "edited": "False", "id": "i3n3u81", "is_submitter": "False", "link_id": "t3_txnsyv", "parent_id": "t3_txnsyv", "score": "0", "subreddit": "thisorthatlanguage", "subreddit_id": "t5_4inj8f"}, {"author": "Correct-Monk-6761", "body": " I understand you so much.. Actually, I live in Israel and I look extremely white in comparison to anybody else: I was always the whitest girl at school and this is why people always think I am Russian.\nAnd I also have a Russian sounding name which I really like, but it makes people even more certain that I am Russian and there is definitely a lot of stigmas about Russians here.\nIf I don't say anything in Hebrew, then people often treat me as an immigrant or a tourist and that's really annoying: like sometimes someone would approache me on the beach and try to sell me a sandwich for 20 dollars! \nOr people would assume that I drink, or that I am not jewish or less Jewish, or even that I am promiscuous because they apparently think that beautiful Russian girls are promiscuous...\n\nAnd even with good stigmas: when I would play the piano in public (it was my hobby for a long time) I would often hear comments like:\nShe plays well because she is Russian, or at school:\nShe is good in mathematics because she is Russian.\nIt's deliberately downgrading my own work that I put into these fields to become good at them.\nAnd the saddest thing is, that I am not even Russian!\n\n My father is Georgian, my mother is german but was born in Kazakhstan and I have lived here for my ENTIRE LIFE!!! \nMy father and my sister are much darker and look exactly like Israelis and no one tries to sell them sandwiches for 20 bucks!", "created_utc": "1649260867.0", "edited": "False", "id": "i3n2vvx", "is_submitter": "False", "link_id": "t3_tjjrbe", "parent_id": "t3_tjjrbe", "score": "1", "subreddit": "racism", "subreddit_id": "t5_2qhgd"}, {"author": "Correct-Monk-6761", "body": "I guess it depends on the region.. There are places where kazakh is spoken by the majority and other places where it isn't.. I would say that nowadays about 75% speak Kazakh and 90% speak Russian (a large portion of the people speak both to an extent).\nBut I am not sure what are the exact statistics..", "created_utc": "1649255024.0", "edited": "False", "id": "i3mnx49", "is_submitter": "False", "link_id": "t3_tvp726", "parent_id": "t1_i3fkcci", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Correct-Monk-6761", "body": "Actually when I think of it, I currently use 4 languages on every single day for the last year and I don't even do it deliberately.\nSo, I think with determination and right circumstances, it is not impossible to use 10 languages throughout the week.\nI don't think it is possible to use them all every single day but you can alternate between them:\nI use Hebrew at work, English for studying, I communicate with my family in Russian, read and watch movies in my target language which is Persian.. I don't use French much because I don't really have the motivation to maintain it and my speech definitely deteriorated, I find it really hard to speak french at the moment, but I feel like I still understand the most and can watch movies in french. So although my french is really bad right now and I struggle pulling out the words from my brain when I speak, I am confident that I can bring it back very quickly and even though I didn't try to actively maintain it, that little exposure I did have once in a while through movies, news and songs, helped to prevent its rapid deterioration.\n\nIn conclusion, if you find ways to use 10 languages consistently and you alternate between them, you will maintain them all on a really high level.\nAnd you never forget a language completely once you become fluent in it, you can \"bring it back to life\" very quickly...", "created_utc": "1649252817.0", "edited": "1649253394.0", "id": "i3mil22", "is_submitter": "False", "link_id": "t3_txf8u8", "parent_id": "t1_i3mbb4c", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Correct-Monk-6761", "body": "SpongeBob, his laughter is so loud and annoying..", "created_utc": "1649248148.0", "edited": "False", "id": "i3m8iyq", "is_submitter": "False", "link_id": "t3_tx96wt", "parent_id": "t3_tx96wt", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "Correct-Monk-6761", "body": "Current situation?!\nSo for you, some recent political events are a strong reason not to learn a language?! people should stop associating language and politics.", "created_utc": "1649247467.0", "edited": "False", "id": "i3m78dg", "is_submitter": "False", "link_id": "t3_tx90kc", "parent_id": "t1_i3kha9d", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Correct-Monk-6761", "body": "People usually don't forget languages that they learned to a high level completely.. So if you alternate between them you should be able to maintain them even if you use each one only once a week..", "created_utc": "1649244562.0", "edited": "1649246320.0", "id": "i3m27pj", "is_submitter": "False", "link_id": "t3_txf8u8", "parent_id": "t1_i3lxqwv", "score": "9", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Correct-Monk-6761", "body": " I think fluency is when you can consume a verity of content in that language and can express yourself in meaningful ways. \n\nSometimes though I met people who speak Persian very well (iranian jews who live here in Israel) but can't read and write.. I think it is considered fluent as well, just not in reading..", "created_utc": "1649244313.0", "edited": "False", "id": "i3m1t9p", "is_submitter": "False", "link_id": "t3_txf8u8", "parent_id": "t1_i3lxqwv", "score": "4", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Correct-Monk-6761", "body": "I feel it's pretty nice if someone tries to learn my language, but I would probably be pissed off if it is a prank or for a stupid YouTube video... \n\nI work in a hospital in Israel and sometimes patients don't speak Hebrew well, so I actually had to sometimes mix the languages I know in order to communicate with people in a language that I don't know😜: One time on my job I talked with an arabic speaker and she knew Hebrew very poorly, so after she didn't understand my Hebrew I said to her: \"jalese ba doktor, talate wa arbain\" and she seems to understand me perfectly, although I don't know Arabic at all accept for some numbers and saying basic sentences like \"how are you\", but some words are of arabic origin in Hebrew and in Persian and if I try using these words in very simple situations, it can actually work😜. So, I guess if it is for a good cause, why not\nLike, I feel I sometimes speak in broken Arabic if I don't have other choices, so I am ok if people speak broken Hebrew with me and try to be patient to them.", "created_utc": "1649240989.0", "edited": "1649241275.0", "id": "i3lx0d3", "is_submitter": "False", "link_id": "t3_txf8u8", "parent_id": "t1_i3lt2fh", "score": "16", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Correct-Monk-6761", "body": "Yeah, I also think he is dishonest.. I can see how such videos can motivate English speakers to learn more languages, but it also creates a lot of damage: because after watching this, people begin to think that learning a language is easy. And then they become frustrated because some random guy on YouTube claims he learned chinese in 3 months and they can't have even a basic conversation after 3 months...\nWe need more YouTubers to spread the truth:\nLearning couple of sentences is easy, becoming fluent like a native is really hard.", "created_utc": "1649238480.0", "edited": "1649241576.0", "id": "i3ltu7h", "is_submitter": "False", "link_id": "t3_txf8u8", "parent_id": "t1_i3lq3ul", "score": "19", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Correct-Monk-6761", "body": "I think it is possible achieving fluency in 10, but it takes time.. I once had a teacher who could speak English, Portuguese, Spanish, Yiddish, German, some French, and obviously he spoke Hebrew very well because we live in Israel...\nBut it takes a lot of time to achieve fluency in any language, even with full immersion in each..", "created_utc": "1649237504.0", "edited": "1649246228.0", "id": "i3lso14", "is_submitter": "False", "link_id": "t3_txf8u8", "parent_id": "t1_i3lqh6k", "score": "15", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Correct-Monk-6761", "body": "Yeah if someone approaches me abroad in Hebrew and starts chatting with me I will be nice and only ask basic questions because you hear that his Hebrew isn't very good... \nAnd most people are like that:\nSometimes on my job, I would notice people's persian accent and start talking with them in Persian but they would mostly first of all ask me the same questions: how do you know Persian, do you like iranian culture/food/music/poetry, have you ever been in Iran...\nPeople are repetitive because they wana be nice and not ask something too difficult. So if you speak with random people for just 5 minutes you are gona get similar questions from everyone and if you prepare these questions, you can basically make such videos in every language of the world..\nAnd whenever someone asks something different, then are the times \"you get exposed\", but in videos it can be easily edited out", "created_utc": "1649235982.0", "edited": "False", "id": "i3lqwj7", "is_submitter": "False", "link_id": "t3_txf8u8", "parent_id": "t1_i3lo85c", "score": "131", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Correct-Monk-6761", "body": "Haha, I thought I am the only one who hates him. I can even claim that I m nearly Native in Swahili using the magic of preparation and video editing...\nI actually watched now 2 videos of him in Russian, he made one 2 years ago and one last year and he made zero progress in Russian throughout this time and I think his Russian was even worst in the newer video.. \nFor example, in the newer video it is an interview with him in Russian and she asks him in many different ways: what is your daily routine as a polyglot, what do you do in your daily life, how does your day look like? (Which is an extremely basic question).\nAnd he clearly didn't understand it at all! He answered something like:\nYes I am a polyglot I love learning languages and learning about other cultures.. 🤦🏻‍♀️🤦🏻‍♀️🤦🏻‍♀️🤦🏻‍♀️🤦🏻‍♀️🤦🏻‍♀️", "created_utc": "1649234467.0", "edited": "False", "id": "i3lp52u", "is_submitter": "False", "link_id": "t3_txf8u8", "parent_id": "t1_i3ln3lm", "score": "45", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Correct-Monk-6761", "body": "I don't speak Ukranian but even if he would speak basic Russian he would understand what she said.. It was really awkward, for me his russian is also very questionable.. I saw a video of him in Russian and he sounds like he learned it for 3 months.\nHe doesn't sound conversationally fluent to me at all..\nHe also has a video where he allegedly \"speaks Hebrew\" but it is just couple of sentences he learned... I don't know how is he in other languages, but I think it is better achieving really good fluency in 4-5 languages than being able to say 3 sentences in 30.", "created_utc": "1649231470.0", "edited": "False", "id": "i3llmxw", "is_submitter": "False", "link_id": "t3_txf8u8", "parent_id": "t1_i3lfmhe", "score": "108", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Correct-Monk-6761", "body": "Yeah, same for iranian Persian- it has many different accents, people from Esfahan and Tehran sound very different from each other but both can clearly understand each other... Tajik in its many forms is harder for me to understand in general not only because familiar words sound different, but some words are absolutely different between iranian persian and tajik.. For example, I couldn't understand \"man shishtam\" in tajik the first time I heard it, in iranian Persian they say neshastam.\nBut I am not a native speaker, I guess that native speakers understand tajik better than myself...", "created_utc": "1649197300.0", "edited": "False", "id": "i3jt6cu", "is_submitter": "False", "link_id": "t3_tvp726", "parent_id": "t1_i3hfyxi", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Correct-Monk-6761", "body": "I don't know one that includes but I actually never learned nor used those short vowel signs, because they are so rarely used and I also know Hebrew and could read to some extent in Arabic... So didn't really need them in order to start reading..\nTo know the pronunciation for sure I often check it on forvo website or there is an app on Google play that is just like forvo called \"say it right\".\nSometimes I also ask my Persian friends. Like I would read a short story, record it and ask them to correct me.\nHope it will be helpful for you", "created_utc": "1649097764.0", "edited": "False", "id": "i3dwop6", "is_submitter": "False", "link_id": "t3_tw8dix", "parent_id": "t3_tw8dix", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Correct-Monk-6761", "body": "Well, Tajik is a dialect of Persian, I just didn't want to create more confusion so called it persian with russian letters, but ok.. I guess it did the opposite.\nAnyways, I talked to very few people from Tajikistan and I specifically said it is just about those I spoke with! They were bad in Russian and their writing in arabic letters was even worst.. But these are only those several people I spoke with, I know it is not a fair representation of all tajiks and I said it is only about THOSE I SPOKE WITH.", "created_utc": "1649096943.0", "edited": "False", "id": "i3duki3", "is_submitter": "False", "link_id": "t3_tvp726", "parent_id": "t1_i3di933", "score": "-1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Correct-Monk-6761", "body": "You can find people who think alike and who will accept you in any language... I am an atheist and spoke with other atheist arabs which is also not that common. So if you search you will find many who don't care of it or who are also from the LGBTQ community.. \nDon't let this fear stop you, good luck!!!", "created_utc": "1649091648.0", "edited": "False", "id": "i3dgr65", "is_submitter": "False", "link_id": "t3_tw4rao", "parent_id": "t3_tw4rao", "score": "10", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Correct-Monk-6761", "body": "Well, tajik and farsi are dialects of the same language and the tajiks I personally met online barely knew any Russian at all and we would mainly communicate in Persian with some Russian words in between.\nDoes the majority still speak Russian there? Because as for the tajiks I met, their Russian was extremely bad...\nAnd also it seems like some struggle writing in arabic letters, I actually had a friend that whenever we would chat, he would write me in Persian but using the Russian alphabet and I would answer him in the Arabic alphabet (because I m more used to the arabic alphabet).\nBut whenever he tried to write anything in the arabic alphabet he would do many mistakes...", "created_utc": "1649089248.0", "edited": "False", "id": "i3dahzt", "is_submitter": "False", "link_id": "t3_tvp726", "parent_id": "t1_i3d3unf", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Correct-Monk-6761", "body": "Look, sometimes things aren't what they seem.. We all know there is a war with Iran and if you could read their national news, you would see they refer to those terrorists who killed Israelis as martyrs, and refer to bney brak as the occupied territories. But how many iranians do you think actually support this attitude towards Israel?\nIf you talk to iranians you will see that many actually love Israel and I would say at least 60% are absolutely ok with Israel's existence if not more..\nTalk to the people, talk to arabs, to iranians.. and you will be surprised how many indeed just want piece and don't want a war with Israel, and don't need its territory..\nI once talked to someone in the west bank who works in the Israeli territories, he said he has no problem living under the Israeli rule and if he could he would probably prefer living on the Israeli side, but he doesn't want to be treated like a potential terrorist....\nThose terrorist attacks harm the Palestinians as well and this is sad because many are against this war...\nTalk to the people and you will be surprised how many good people are out there.", "created_utc": "1649056825.0", "edited": "1649057170.0", "id": "i3bpziw", "is_submitter": "False", "link_id": "t3_tvgxxa", "parent_id": "t3_tvgxxa", "score": "1", "subreddit": "Israel", "subreddit_id": "t5_2qhvo"}, {"author": "Correct-Monk-6761", "body": "When a bridge starts to collapse and there are people on it, they always jump on the already falling parts and somehow succeed getting to the other side.\nIf it is falling you won't be able to generate enough lifting force with your jump, because the ground is literally falling, so it won't give you much resistance at all if any.", "created_utc": "1649053624.0", "edited": "False", "id": "i3blx9j", "is_submitter": "False", "link_id": "t3_tvg6n3", "parent_id": "t3_tvg6n3", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "Correct-Monk-6761", "body": "Some countries that used to be in the Soviet union like Ukraine and Kazakhstan where most speak Russian as their native language or as a second language.", "created_utc": "1649051252.0", "edited": "False", "id": "i3bipgd", "is_submitter": "False", "link_id": "t3_tvp726", "parent_id": "t3_tvp726", "score": "18", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Correct-Monk-6761", "body": "Haha😂 it seems like a common problem in languages where you don't write all the vowels and especially if several letters sound exactly the same. \nIn my target language (persian) the word for food, judiciary and also the word for Gaza strip are written differently but sound almost the same. So I would always recheck sentences where I talk about food, or it might sound aggressive..(I usually don't wanna cook Gaza 🤣)..", "created_utc": "1649023322.0", "edited": "False", "id": "i39ym5p", "is_submitter": "False", "link_id": "t3_tvhy8r", "parent_id": "t1_i39nv4v", "score": "47", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Correct-Monk-6761", "body": "Sometimes right before sending a message to my language partner, I put it into Google translate and translate it to English, just to be sure I didn't write something totally incomprehensible by mistake..\nI usually don't change anything anyways, but it gives some sense of security..", "created_utc": "1649018070.0", "edited": "False", "id": "i39mfat", "is_submitter": "False", "link_id": "t3_tvhy8r", "parent_id": "t3_tvhy8r", "score": "385", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Correct-Monk-6761", "body": "I am not a native and could read it although it wasn't obvious at first glance, natives should be able to..", "created_utc": "1649017700.0", "edited": "False", "id": "i39ljki", "is_submitter": "False", "link_id": "t3_tveumx", "parent_id": "t3_tveumx", "score": "1", "subreddit": "farsi", "subreddit_id": "t5_2t22i"}, {"author": "Correct-Monk-6761", "body": "Language learning takes so much time, it can take you several years to fully master one of these, so it's better to pick according to which one of them you like the most in my opinion..", "created_utc": "1649003835.0", "edited": "False", "id": "i38nulj", "is_submitter": "False", "link_id": "t3_tvb0ph", "parent_id": "t1_i38n4dz", "score": "2", "subreddit": "thisorthatlanguage", "subreddit_id": "t5_4inj8f"}, {"author": "Correct-Monk-6761", "body": "I would go for chinese first, because I like its culture and I think it sounds better and I know japanese uses some chinese characters..\nChoose the one you like the most in my opinion, not necessarily the most useful.", "created_utc": "1649003227.0", "edited": "False", "id": "i38mea8", "is_submitter": "False", "link_id": "t3_tvb0ph", "parent_id": "t3_tvb0ph", "score": "3", "subreddit": "thisorthatlanguage", "subreddit_id": "t5_4inj8f"}, {"author": "Correct-Monk-6761", "body": "I guess it should be the opposite of dogs, something not 4 legged, without brain, something that can put you in a world of hurt: \nJellyfish! 😑", "created_utc": "1648913325.0", "edited": "False", "id": "i348daa", "is_submitter": "False", "link_id": "t3_tu6xk1", "parent_id": "t3_tu6xk1", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "Correct-Monk-6761", "body": "You sound like a native to me, overall very accurate accent 🤩😁", "created_utc": "1648892613.0", "edited": "False", "id": "i33ag6g", "is_submitter": "False", "link_id": "t3_tu8n66", "parent_id": "t3_tu8n66", "score": "2", "subreddit": "russian", "subreddit_id": "t5_2qlc6"}, {"author": "Correct-Monk-6761", "body": "In Russian many words are in the same length when plural as their singular form:\nМужчина -> Мужчины\nСобака - > собаки \nBut it's not like this with all the words..", "created_utc": "1648881911.0", "edited": "False", "id": "i32y9wr", "is_submitter": "False", "link_id": "t3_tty02t", "parent_id": "t3_tty02t", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Correct-Monk-6761", "body": "The Israeli flag vanished completely and was replaced by Palestinian flag..", "created_utc": "1648876812.0", "edited": "False", "id": "i32rnm9", "is_submitter": "False", "link_id": "t3_tu57sl", "parent_id": "t3_tu57sl", "score": "9", "subreddit": "place", "subreddit_id": "t5_2sxhs"}, {"author": "Correct-Monk-6761", "body": "Russian rolling rrrr here, I feel like both sides vibrate equally.. I press the tip of my tongue upwards, like I am about to say \"d\", blow air and relax the tongue so it vibrates and makes the Russian rrrrr sound.", "created_utc": "1648824848.0", "edited": "False", "id": "i2znjbs", "is_submitter": "False", "link_id": "t3_tpufq8", "parent_id": "t3_tpufq8", "score": "1", "subreddit": "language", "subreddit_id": "t5_2qlfj"}, {"author": "Correct-Monk-6761", "body": "Kasaya for a girl, an Ethiopian name.\nEsfandiar for a man, an old Persian name.\nKhariton for a man, old fashioned  Russian name.\nBut the weirdest was of my Israeli friend Mikiyally, which is weird also in Israel.", "created_utc": "1648753897.0", "edited": "False", "id": "i2vvtm2", "is_submitter": "False", "link_id": "t3_tsxymm", "parent_id": "t3_tsxymm", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "Correct-Monk-6761", "body": "I think it is possible especially if you immerse yourself in the language. Good luck!!!", "created_utc": "1648740102.0", "edited": "False", "id": "i2uvpqa", "is_submitter": "False", "link_id": "t3_tsx93n", "parent_id": "t3_tsx93n", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Correct-Monk-6761", "body": "Yeah in Persian it's also like having a rest, but it is also used for taking a break: like taking a small break at work..", "created_utc": "1648736839.0", "edited": "False", "id": "i2unj83", "is_submitter": "False", "link_id": "t3_tsouo2", "parent_id": "t1_i2umckg", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Correct-Monk-6761", "body": "Kangaroos, dingos and koalas", "created_utc": "1648736009.0", "edited": "False", "id": "i2uljnm", "is_submitter": "False", "link_id": "t3_tsx3yh", "parent_id": "t3_tsx3yh", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "Correct-Monk-6761", "body": "Bamba!!!😂 It's made from peanuts.", "created_utc": "1648735369.0", "edited": "False", "id": "i2uk244", "is_submitter": "False", "link_id": "t3_ts9kip", "parent_id": "t3_ts9kip", "score": "1", "subreddit": "Israel", "subreddit_id": "t5_2qhvo"}, {"author": "Correct-Monk-6761", "body": "First of all, try to find here on Reddit or on other apps other people who are also learning Irish. \nSurely someone else is also learning it! And he or she can help you find some more resources!\nFor a language partner, try looking on tandem or a similar language exchange app.\n\nChanging your phone settings/google settings language can also help to learn some vocabulary.. It might be annoying in the beginning, but eventually it is really nice: I didn't know the word for \"maps\" before changing my google settings, but after accidentally clicking it over and over again, I will never forget it 😂😂😂.\n\nIrish is pretty problematic to find content in, I mean, I tried to do a brief search to get the feeling and I think I understand you.. But I don't know how to write in irish, maybe if you change the google language settings and then choose in the sort options: \"display pages only in Irish\", you will find more..\nContent for children is usually easier to understand in general, so try to scan the internet for that..\nI sometimes listen to very well known disney songs translated to my target language and later write down some noteworthy words. Some songs are translated to like 50 languages or near that, so I will be really shocked if no one translated \"let it go\" or \"we don't talk about Bruno\" to Irish yet..\n\nIf you see that you still can't find much content, then it will be very hard to learn it without finding a language exchange partner, with whom you can talk with on an almost daily basis... So I would concentrate mostly on finding a good Irish friend, with other things just to not let you get too bored..", "created_utc": "1648734371.0", "edited": "1648753483.0", "id": "i2uhrtu", "is_submitter": "False", "link_id": "t3_tsqaqj", "parent_id": "t1_i2u3teq", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Correct-Monk-6761", "body": "German definitely has more resources, I don't know about difficulty of the others though", "created_utc": "1648726219.0", "edited": "False", "id": "i2u292r", "is_submitter": "False", "link_id": "t3_tqi6my", "parent_id": "t3_tqi6my", "score": "1", "subreddit": "thisorthatlanguage", "subreddit_id": "t5_4inj8f"}, {"author": "Correct-Monk-6761", "body": "Yeah when you speak it fluently and can work/study in that language, then I would say you are bilingual.", "created_utc": "1648722970.0", "edited": "False", "id": "i2txkpm", "is_submitter": "False", "link_id": "t3_tl1nz2", "parent_id": "t3_tl1nz2", "score": "1", "subreddit": "bilingual", "subreddit_id": "t5_2woi2"}, {"author": "Correct-Monk-6761", "body": "Yeah that's what I do basically", "created_utc": "1648701353.0", "edited": "False", "id": "i2t5wwv", "is_submitter": "False", "link_id": "t3_tso6ln", "parent_id": "t1_i2si60q", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Correct-Monk-6761", "body": "Esterāhat = a break in Persian", "created_utc": "1648701162.0", "edited": "False", "id": "i2t5l05", "is_submitter": "False", "link_id": "t3_tsouo2", "parent_id": "t3_tsouo2", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Correct-Monk-6761", "body": "I would say the best way to commit is through changing activities.. I read, watch movies, review some vocabulary, speak with my language exchange partner and sometimes I just listen to music in my target language..\nIn general I always try making things that make me happy or things I am interested in, so it is a very pleasurable experience for me.", "created_utc": "1648700885.0", "edited": "False", "id": "i2t5402", "is_submitter": "False", "link_id": "t3_tsqaqj", "parent_id": "t3_tsqaqj", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Correct-Monk-6761", "body": "I didn't use any notebooks at first and tried only to rely on repetitive exposure.. but now I started to write down some and I find it very effective:\nI have a notebook, I write there words that I stumble across or keep forgetting. And I try to review them daily, erasing those that I learned.\n\nI write usually the word itself, sometimes write down it's pronunciation, and a sentence using that word and/or a sentence that describes this word in my target language. If this is a verb I often try to see if there is also times when it's used as an adjective but I don't concentrate on this too much..\n\nAssociations are extremely effective for me, for example kashtan is a type of tree in Russian, but kāshtan is also to plant in Persian.\nBut if I can't find such a strong association, I will use my notebook.", "created_utc": "1648654236.0", "edited": "False", "id": "i2q55ia", "is_submitter": "False", "link_id": "t3_ts3g0k", "parent_id": "t3_ts3g0k", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Correct-Monk-6761", "body": "I love Homayoun Shajarian", "created_utc": "1648617224.0", "edited": "False", "id": "i2ohq4g", "is_submitter": "False", "link_id": "t3_treap6", "parent_id": "t3_treap6", "score": "4", "subreddit": "farsi", "subreddit_id": "t5_2t22i"}, {"author": "Correct-Monk-6761", "body": "I think its writing system can be reformed, but removing all the loaned words is excessive and isn't very practical in my opinion..", "created_utc": "1648573914.0", "edited": "False", "id": "i2l5uk7", "is_submitter": "False", "link_id": "t3_tqixya", "parent_id": "t3_tqixya", "score": "2", "subreddit": "PERSIAN", "subreddit_id": "t5_2rzk9"}, {"author": "Correct-Monk-6761", "body": "No, because first of all learning 50 a day is nearly impossible.\nEven if you feel like you are able to learn 50 new words every single day, it is likely that most of them go to your short term memory and you will forget many of them later on as you continue learning new words..\n\nBut lets assume it's possible and you are a rare genius, knowing words alone is not enough: to understand natives and understand spoken language in general you need to expose yourself to a lot of input.\nNatives often speak fast and understanding can be tricky even if you know every single word by itself.\nIn order to speak well you should also speak with natives a lot as well. You will also do a ton of grammatical mistakes, which is inevitable..\n\nI would say 98% fluency is achievable only after several years, through daily practice and exposure. I am not sure I can even consider myself fluent to such  extent  in English..", "created_utc": "1648566031.0", "edited": "1648566260.0", "id": "i2klbx6", "is_submitter": "False", "link_id": "t3_tqxps1", "parent_id": "t3_tqxps1", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Correct-Monk-6761", "body": "I guess he wrote Мне лублу which is grammatically incorrect, I am actually not sure what did he want to write but it's probably I love you or my love.\nI think he ment to say my love though, which is maya lubimaya: моя любимая.", "created_utc": "1648536232.0", "edited": "False", "id": "i2jaenp", "is_submitter": "False", "link_id": "t3_tqrcg7", "parent_id": "t3_tqrcg7", "score": "2", "subreddit": "translator", "subreddit_id": "t5_2ss9z"}, {"author": "Correct-Monk-6761", "body": "You know, I actually dislike this. You see, I live in Israel, I can't think of something similar would happen here.\nHere all the road signs are written in Hebrew and Arabic, there are tv shows in Arabic, if someone calls on my work who doesn't speak Hebrew well, I would ask an Arabic speaker to return to him. And my service is exactly the same both to arabs and jews.\nBefore the war many ukranians would speak to me in Russian, even though I understand Ukranian as well. \nMany ukranians speak Russian as their mother tongue or a second language, banning Russian everywhere seems to me just wrong, and the saddest is that it happens also outside of Ukraine:\nI have russian speaking relatives in Germany, who originally came from Kazakhstan, but are now bullied at schools even by the teachers for knowing Russian.\nI think it is wrong to mix language and politics, I am absolutely against the Russian position in this war, but as a great language enthusiast I think the Russian language, shouldn't suffer, because it is not the one who started this bloody war.\nAnd as for this ATM, the Russian language shouldn't compromise your love to Ukraine.", "created_utc": "1648533760.0", "edited": "False", "id": "i2j79tt", "is_submitter": "False", "link_id": "t3_tgsa7d", "parent_id": "t3_tgsa7d", "score": "1", "subreddit": "UkrainianConflict", "subreddit_id": "t5_30hhs"}, {"author": "Correct-Monk-6761", "body": "In Russian you are able to discuss the state of the action just by slightly modifying the prefix of a verb and it is pretty unique in my opinion. You clearly didn't understand what I meant so I will try to explain:\n\nYa chital = I read.\n\nya prachital = I read and finished reading it\n\nya dachital = I finished reading something that I have already started reading before.\n\n ya perechital = I have read something that I had read in the past and also finished reading it.\n\nAnd there are also nachital and vīchital but I will have to make an example in order to also explain these two..\n\nWhile it is all the same verb and it will all be translated as \" read\", and has the same route as you can probably see now, but by changing its prefix you change the entire meaning of a sentence adding lots of information. \nSame goes for other verbs, like ya shol = I walked, Ya dashol = I walked and arrived..\nI don't know many languages that can convey so much information by solely changing the prefix of a verb. I am also native in Hebrew and I think Hebrew is not very rich and that I can express myself in wider array of ways in Russian and English..\nI don't say it's bad, but certainly Hebrew feels slightly more narrow when I speak it or translate from Russian to/from it. Hebrew is rich in some specific aspects though, for example it has probably 20 or more ways of saying how someone died: we have died, passed away, murdered and killed just like in English, but also have a word that means killed and used for a soldier killed on the battlefield, or killed by an accident, or killed during the holocaust or in a major disaster..", "created_utc": "1648419759.0", "edited": "False", "id": "i2d7qxx", "is_submitter": "False", "link_id": "t3_tpgben", "parent_id": "t1_i2d2yjp", "score": "-6", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Correct-Monk-6761", "body": "Synonyms, different ways of saying the same sentence, I also consider languages that make long words by combining several other words pretty rich like german, or these where you can say an entire sentence with one word, like in Russian:\n\nЗащищающихся = those who defend themselves.\n\nOr in Russian you can convert lots of information just by changing the verb:\n\nЯ читал книгу = I was reading a book\n\nЯ дочитал книгу = I finished reading a book that I have already started reading before.", "created_utc": "1648415874.0", "edited": "False", "id": "i2czp0f", "is_submitter": "False", "link_id": "t3_tpgben", "parent_id": "t1_i2b7irp", "score": "-2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Correct-Monk-6761", "body": "I guess it can sometimes be a little confusing.. like in Hebrew, there are so many words for the word died, that differ from each other by the circumstances of the death:\nמת = died - met\n\nנפטר = niftar - died from natural causes, parished\n\nנרצח = nirtsakh - was murdered\n\nנהרג = killed by an accident - neherag\n\nנספה = killed by a great disaster or killed during the\n holocaust - nispa\n\nנפל =  used for a soldier who died in the battle field-\nnafal\n\nהתאבד - hit'abed = died by committing suicide\n\nAnd if that wasn't enough, there are also lot's of idioms that also basically mean \"died\":\nנפח את נשמתו, נאסף אל אבותיו, הלך לעולמו, החזיר נשמתו לבורא, מצא את מותו .....\nI think together with all the idioms, there are about 20 different ways to say died in Hebrew.", "created_utc": "1648415269.0", "edited": "False", "id": "i2cyekg", "is_submitter": "False", "link_id": "t3_tpgben", "parent_id": "t1_i2ckr4y", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Correct-Monk-6761", "body": "Yeah absolutely 😄  my knowledge of arabic is extremely limited, I studied it for two years at school and don't remember much..\nI do enjoy the non gender thing indeed, but I enjoy less the fact that you don't have those distinct 3 letter routes for verbs like in Hebrew.. you have so many verbs that for me sound like they are from the same rout but are actually different.. When I was a beginner, if I heard: piano minavaazam and moohaye oo navaazesh kardam, then I would hear navaaz in both and subconsciously assume these verbs are related. Because they have 3 letters in common. It took me some time to understand that even if 1 letter is different, it can be a different verb entirely, like baazi kardan and baaz kardan.\nAlso the fact that the verb is at the end of the sentence was kinda confusing at first..", "created_utc": "1648413229.0", "edited": "False", "id": "i2ctyvy", "is_submitter": "False", "link_id": "t3_tpgben", "parent_id": "t1_i2chkba", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Correct-Monk-6761", "body": "Not at all! Actually it was the simplest aspect in Persian for me so far. I am from Israel and the writing system is extremely similar to Hebrew and Arabic. The fact that some letters sound the same and you are not always sure how to write a word or when you are not sure how to read a new word because many vowels are not written - we have it in Hebrew as well.\n\nBut I think that people who don't speak arabic, Hebrew, urdu or other languages with similar writing systems where you don't write down every single vowel, may find it pretty difficult...", "created_utc": "1648407572.0", "edited": "False", "id": "i2ch42p", "is_submitter": "False", "link_id": "t3_tpgben", "parent_id": "t1_i2cd6m3", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Correct-Monk-6761", "body": "Yes and it doesn't have genders for objects unlike Hebrew.. But Hebrew has only 3 times and its route system makes understanding Hebrew easier because when you know the route and hear a word with that route, you know what it means. But in Persian, there are so many verbs and words that sound similar but are absolutely unrelated!\nLike bāzi kardan and bāz kardan...", "created_utc": "1648402791.0", "edited": "False", "id": "i2c5i2h", "is_submitter": "False", "link_id": "t3_tpfx8l", "parent_id": "t1_i2bz7qy", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Correct-Monk-6761", "body": "I am not a person who thinks much about grammar so I will explain it in my language. Some verbs are one word verbs, like in the sentence:\nمن یک درخت کاشتم.\nI planted a tree.\nKāshtan = to plant.\nWhile other verbs consists of two verbs. You usually have to remember if a verb goes with kardan, daashtan, shodan, gereftan etc.. Like dust daashtan, yaad gereftan, kaar kardan.. \nIf the verb is a one word verb, it is the one that changes depending on the one who speaks, if it has a \"friend\", the friend is the one who changes and both do so in the SAME predictable patterns: I - (verb)am, we - (verb)im... Both in the past and in the present. \n\nSome verbs sound different in past and in present tenses, so you need to remember their sound in present and past tenses, like: man raftam = I went, man miram (miravam) = I go. Notice that both end with am.\n\nIn general, it is really important both for communication and for your vocabulary to surround yourself in Persian content. To remember the words better, I sometimes use Associative learning. I learn the best by finding a good and robust association. Real example from today: I learned the word for inflation = tavaróm. In Russian tavar is a product or goods, in Hebrew rom is kinda like upwards or hights. When prices of tavar get rom = inflation.😂\nAnother technique I used for harder words, is to write them down in a notebook, try to describe them using my limited persian (only rarely writing down the translation), and also write a sentence or two using this word. I would also review these words later when I have some free time and erase those I have already learned..\n\nSometimes, a word was in particularly difficult and I kept forgetting it, so I would do EVERYTHING in order to use it with my iranian friends. Today I said to my friend that I really liked his army photos where he had a beard and a MUSTACHE and he used to have a really nice beard and MUSTACHE.🤣", "created_utc": "1648400507.0", "edited": "1648401410.0", "id": "i2bzzyj", "is_submitter": "False", "link_id": "t3_tpgben", "parent_id": "t1_i2b4b8x", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Correct-Monk-6761", "body": "I am actually not very familiar with the Moroccan dialect, but I plan studying Arabic in the future so hopefully I will be able to appreciate its beauty one day", "created_utc": "1648384140.0", "edited": "False", "id": "i2b1a6x", "is_submitter": "False", "link_id": "t3_tpgben", "parent_id": "t1_i2astb5", "score": "11", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Correct-Monk-6761", "body": "In persian there are many words loaned from Arabic or other languages and then you have both the Persian and Arabic word for the same thing.\nThis language is also very ancient as well and naturally changed through time, so some words are only used in poetry and literature but not used in daily conversations, and some words are just really old fashioned and not used anymore at all... And there are also many expressions, like for example: daste shomā dard nakone = may your hand not hurt, you can use it in order to express your gratitude when someone gives you a gift or helps you by doing a favour or by assisting you..", "created_utc": "1648383866.0", "edited": "False", "id": "i2b0uiy", "is_submitter": "False", "link_id": "t3_tpgben", "parent_id": "t1_i2awbp0", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Correct-Monk-6761", "body": "I try to talk and chat with iranians (I have one good friend I communicate with in Persian on a daily basis and 2 more that I communicate with more rarely), I sometimes watch YouTube videos, read children's books (my persian is not good enough for reading adult content with ease), listen to music and I recently started watching movies and trying to read couple of sentences from news articles (usually I stop after just the first paragraph because it is still pretty hard for me)...\nIn the very beginning I used a very simple app to learn the most basic words, like: hello, sorry, thank you, I , you, walk, read..\nBut I started trying to learn from content straight away, after just a couple of weeks and I didn't use that app any longer.", "created_utc": "1648377094.0", "edited": "False", "id": "i2arwum", "is_submitter": "False", "link_id": "t3_tpgben", "parent_id": "t1_i2aqjvx", "score": "7", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Correct-Monk-6761", "body": "Augustine Hadelich the greatest violinist of our time, with excellent attention to details, intonation, technique, musical phrasing and also very expressive playing", "created_utc": "1648375991.0", "edited": "False", "id": "i2aqlhm", "is_submitter": "False", "link_id": "t3_tp02n5", "parent_id": "t3_tp02n5", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "Correct-Monk-6761", "body": "I recorded myself singing a Disney song in both my native and target language (I am a really good singer), singing couple of lines in each, made it into a video with both subtitles and translation and sent it to my language exchange partner ..\nHe was deeply touched.", "created_utc": "1648375720.0", "edited": "False", "id": "i2aq9tf", "is_submitter": "False", "link_id": "t3_tpapi1", "parent_id": "t3_tpapi1", "score": "5", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Correct-Monk-6761", "body": "I think it may if Russia's attitude will be aggressive for a long time, Russian may become a less popular choice. For example, I think that Iran's political attitude made Persian less attractive language than let's say Hebrew, which has much less native speakers (at least 10 times less). Even though the writing systems in both are pretty similar in their core and I think they are at a similar difficulty for English speakers.\nYou can see that there is Hebrew on Duolingo but no persian. There is actually even Yiddish on Duolingo which has even less native speakers left.\n\nIn the short term though, I think it will only make russian less popular inside Ukraine. I will definitely teach my own children the Russian language and I think the popularity of a language shouldn't suffer due to political conflicts.", "created_utc": "1648374245.0", "edited": "1648402921.0", "id": "i2aohuz", "is_submitter": "False", "link_id": "t3_tpfx8l", "parent_id": "t3_tpfx8l", "score": "9", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Correct-Monk-6761", "body": "We don't want more land, not at all, we want more PEACE😪. Our politicians also don't want going to a useless war as well..", "created_utc": "1648366247.0", "edited": "False", "id": "i2afbn8", "is_submitter": "False", "link_id": "t3_tp3df7", "parent_id": "t1_i290tdg", "score": "5", "subreddit": "Israel", "subreddit_id": "t5_2qhvo"}, {"author": "Correct-Monk-6761", "body": "The last thing Israel needs is a bunch of people from a Hezbollah village.. Even if it wasn't a Hezbollah village, Israel won't even think of conquering this territory. Nowadays they didnt want to take much Ukranian refugees because it will \"harm the jewish identity\", so why would it ever want conquering and getting any lebanese people to itself..", "created_utc": "1648365727.0", "edited": "False", "id": "i2aepfz", "is_submitter": "False", "link_id": "t3_tp3df7", "parent_id": "t3_tp3df7", "score": "1", "subreddit": "Israel", "subreddit_id": "t5_2qhvo"}, {"author": "Correct-Monk-6761", "body": "Thank you very much for the explanations, it was really helpful for me!!! 😊", "created_utc": "1648359328.0", "edited": "False", "id": "i2a6nmq", "is_submitter": "True", "link_id": "t3_tp2d8w", "parent_id": "t1_i29wn3i", "score": "1", "subreddit": "farsi", "subreddit_id": "t5_2t22i"}, {"author": "Correct-Monk-6761", "body": "Oh thank you, I think I understand it much better now, what about باستان؟ \nCan you also explain that word for me please?", "created_utc": "1648329137.0", "edited": "False", "id": "i28kv8f", "is_submitter": "True", "link_id": "t3_tp2d8w", "parent_id": "t1_i28jeoc", "score": "1", "subreddit": "farsi", "subreddit_id": "t5_2t22i"}, {"author": "Correct-Monk-6761", "body": "Oh wow, my teacher was nice but she was indeed really harmed by my actions. Because she thought that during arabic class you should be only paying attention to the lesson and doing anything else is disrespectful..\nI don't know what would be her reaction if I would read a book in Arabic though 😂.\nBut sadly my Arabic back then (and now as well) was extremely limited..", "created_utc": "1648328860.0", "edited": "False", "id": "i28k8wt", "is_submitter": "False", "link_id": "t3_tp2obp", "parent_id": "t1_i28i8ip", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "Correct-Monk-6761", "body": "Ludmilla and also Veronika - those names are just too long and uncomfortable..", "created_utc": "1648328270.0", "edited": "False", "id": "i28ixce", "is_submitter": "False", "link_id": "t3_tofrjv", "parent_id": "t3_tofrjv", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "Correct-Monk-6761", "body": "Yeah, and I was actually getting Excellent Grades in Arabic, so I really don't understand why teachers can't sometimes let children do what they want if it's done quitly..", "created_utc": "1648327721.0", "edited": "False", "id": "i28hot1", "is_submitter": "False", "link_id": "t3_tp2obp", "parent_id": "t1_i28hi0u", "score": "2", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "Correct-Monk-6761", "body": "Happened to me on my Arabic class at school 🤦🏻‍♀️, I had to hand it over but at the end of the day, I said to the teacher that I am deeply sorry and said this book isn't mine and I borrowed it from a friend and have to return it,  and the teacher was kind enough to let me take my book back..", "created_utc": "1648327443.0", "edited": "False", "id": "i28h23w", "is_submitter": "False", "link_id": "t3_tp2obp", "parent_id": "t1_i28crdo", "score": "2", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "Correct-Monk-6761", "body": "I was at school, it was cold inside, I wore gloves, and during the lesson I was slightly playing with them- just taking off, taking on, stretching the fingers of the gloves.. and the teacher found it extremely distracting and asked me to exit the classroom 😳...\nI guess I would also be distracted over seeing a student playing with his gloves, but, I was still very surprised since accept for the teacher himself, it didn't bother anyone else and I was quite the whole time.\nAnd actually it happened twice with different teachers.... \nI am the kind of student who always draws during lessons or plays with a hairband or something like that to keep my hands busy during a lesson, so playing with my gloves was just too tempting for me to say no too..", "created_utc": "1648327014.0", "edited": "False", "id": "i28g3zu", "is_submitter": "False", "link_id": "t3_tp2obp", "parent_id": "t3_tp2obp", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "Correct-Monk-6761", "body": "I have a cat who plays like a human: He knows how to play \"find me\", I hide around the corner, he Mews at first and then runs towards me. \nHe knows how to play \"catch me if you can\", both when I am running after him and when I am the one running away.\nHe knows how to play \"ninjas\":\nWhen I say loudly \"Ati Basya\" (I don't know why I say it, but this is how I imagine ninjas sound like), he makes a funny and cute pose, so I would stroke his belly and his neck.... And I can't hold myself and stroke him 🤣🤣🤣🤣.. it's lazy style kong fu, no enemy can hold his defences against such a cute cat!!!!😄 He also plays find me with my mom, but chasing each other around or playing ninjas is solely our thing with him😄😄😄😄", "created_utc": "1648326166.0", "edited": "1648326419.0", "id": "i28e7y7", "is_submitter": "False", "link_id": "t3_tp2nys", "parent_id": "t3_tp2nys", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "Correct-Monk-6761", "body": "Каштан 🥰", "created_utc": "1648320508.0", "edited": "False", "id": "i281o30", "is_submitter": "False", "link_id": "t3_tc44y4", "parent_id": "t3_tc44y4", "score": "1", "subreddit": "AskARussian", "subreddit_id": "t5_2xzpo"}, {"author": "Correct-Monk-6761", "body": "Tall blond girls and beer 🍺", "created_utc": "1648319395.0", "edited": "False", "id": "i27z5p1", "is_submitter": "False", "link_id": "t3_toonzt", "parent_id": "t3_toonzt", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "Correct-Monk-6761", "body": "Black coffee with lemon slices", "created_utc": "1648273125.0", "edited": "False", "id": "i25ui37", "is_submitter": "False", "link_id": "t3_tnnqfj", "parent_id": "t3_tnnqfj", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "Correct-Monk-6761", "body": "With English I would say the most fun part was when I actually started to understand movies and enjoy them! I have been learning Persian for a year or so, the best part was during the first 3 months, it was really fun and exciting!!!!!!!😄", "created_utc": "1648272662.0", "edited": "False", "id": "i25tv3l", "is_submitter": "False", "link_id": "t3_tneebl", "parent_id": "t3_tneebl", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Correct-Monk-6761", "body": "I think there are more resources and content in Iranian Persian and I chose Iranian Persian myself.\nMost Iranian dialects are very similar to each other, I don't have any problems understanding people both from Tehran and Isfahan even though they are considered pretty different.\nI am also able to communicate with people from Tajikistan as well (who speak dari), but it's slightly more difficult for me. There are couple of words that I couldn't understand in Tajiki persian the first time I heard them like to sit: shishtan in Tajiki = nashastan in iranian persian. \nBut most of the time I could understand the meaning of a sentence even though the pronunciation of some words is slightly different.\nI think that learning Iranian Persian won't limit you in terms of understanding, although I would try to get a wide range of exposure to different dialects by talking to people online..\nI also prefer talking to iranians because their views are more similar to mine (which is kinda surprising since I am Israeli), mainly because they are usually less religious than tajikis, who are more conservative and traditional people.", "created_utc": "1648272182.0", "edited": "False", "id": "i25t76a", "is_submitter": "False", "link_id": "t3_tnbsc3", "parent_id": "t1_i241uop", "score": "1", "subreddit": "thisorthatlanguage", "subreddit_id": "t5_4inj8f"}, {"author": "Correct-Monk-6761", "body": "I am native in both Hebrew and Russian and I actually preferred right from the beginning the arabic writing system, I guess because it is so similar to the Hebrew writing system and because I could find more learning materials in iranian persian..", "created_utc": "1648234499.0", "edited": "False", "id": "i23mctm", "is_submitter": "False", "link_id": "t3_tn8gh6", "parent_id": "t1_i1zya06", "score": "3", "subreddit": "farsi", "subreddit_id": "t5_2t22i"}, {"author": "Correct-Monk-6761", "body": "😂 I didn't think of that, but I actually prefer the word clan when describing how it feels, because I feel it is more like a \"tribal\" feeling of belonging rather than belonging to a club😂.. I know it sounds strange..", "created_utc": "1648233000.0", "edited": "False", "id": "i23ikt3", "is_submitter": "True", "link_id": "t3_tnr5li", "parent_id": "t1_i23h4u8", "score": "4", "subreddit": "polyglot", "subreddit_id": "t5_2reiv"}, {"author": "Correct-Monk-6761", "body": "Spanish, Arabic, French (because it's spoken also in many parts in Africa), Chinese, Russian (can be helpful also to understand people in Ukraine and Belarus).", "created_utc": "1648232409.0", "edited": "False", "id": "i23h34a", "is_submitter": "False", "link_id": "t3_tnesmc", "parent_id": "t3_tnesmc", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Correct-Monk-6761", "body": "I would go with Russian, in Russian the accent and grammar are notoriously difficult for English speakers.. Work on your accent from day one, it's important or no one will understand you (I can't understand Hollywood actors when they speak Russian and I am a native Russian speaker). For the grammar:\nI would recommend you trying to immerse yourself in Russian rather than learning grammar by rules. Some languages obey rules much less than others and Russian is one of these where there are so many rules that there are actually no rules.\nI will explain: \nIn English for example, we learned at school that verbs in the past tend to end with \"ed\",  with some exceptions like swam or taught. This rule is really nice and convenient. \nBut in Russian it is quite the opposite: most of the verbs are like swam, bought, threw, wrote.. and you can barely find any verbs that follow any set of rules..", "created_utc": "1648231767.0", "edited": "False", "id": "i23fhb2", "is_submitter": "False", "link_id": "t3_tcye50", "parent_id": "t3_tcye50", "score": "2", "subreddit": "thisorthatlanguage", "subreddit_id": "t5_4inj8f"}, {"author": "Correct-Monk-6761", "body": "Persian is among the world's 20 most widely spoken languages! With relatively large amounts of monolingual people and also amazing poetry!!!\nI think it's perfect for you😄", "created_utc": "1648229913.0", "edited": "False", "id": "i23aqxg", "is_submitter": "False", "link_id": "t3_tnbsc3", "parent_id": "t3_tnbsc3", "score": "1", "subreddit": "thisorthatlanguage", "subreddit_id": "t5_4inj8f"}, {"author": "Correct-Monk-6761", "body": "In Arabic ya is something you say before a person's name to show respect: ahlan wasahlan ya (name). \nIn Hebrew we say \"ya\" mostly in the opposite situation: to exaggerate something you are going to say, like \"ya idyot!\" in order to call someone an idiot, but it can be also used in good situations: \"Ya! Eyze yafe\" Which is like saying \"wow! it's so pretty!\"\n\n\"i\" (like eeee) is And in Russian and an Island in Hebrew.\n\n\"Oo\" in Persian means He, in French Where, and in Russian At (depends on the context, but like in the sentence:\nВстретимся у меня дома)\nIn Hebrew he is Hoo which is very similar.\n\nI hope I understood the question because actually I am not sure I know the definition of a phoneme correctly 😂", "created_utc": "1648226538.0", "edited": "False", "id": "i2321em", "is_submitter": "False", "link_id": "t3_tlz3dq", "parent_id": "t3_tlz3dq", "score": "2", "subreddit": "polyglot", "subreddit_id": "t5_2reiv"}, {"author": "Correct-Monk-6761", "body": "Yeah correcting too much is destructive.. But I want to be corrected if I mispronounce a word, in a way that it means something bad or silly😂..  Like I used to say olaghe instead of aloghe in my target language and aloghe is \"to like\" or \"favourite\" but olaghe is a donkey..😂😂😂", "created_utc": "1648219589.0", "edited": "False", "id": "i22k9n6", "is_submitter": "True", "link_id": "t3_tln9p1", "parent_id": "t1_i1z5p6g", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Correct-Monk-6761", "body": "Exactly! 😄😄😄😄", "created_utc": "1648218863.0", "edited": "False", "id": "i22ihg4", "is_submitter": "True", "link_id": "t3_tln9p1", "parent_id": "t1_i2166e0", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Correct-Monk-6761", "body": "I disagree, I learn by reading books and movies as well, and you kinda begin to have this internal feeling of what is right the more exposure you get.. I don't feel corrections greatly improved my language, only like with big mistakes or recurring ones..", "created_utc": "1648126694.0", "edited": "False", "id": "i1xb6wr", "is_submitter": "True", "link_id": "t3_tln9p1", "parent_id": "t1_i1wn6ez", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Correct-Monk-6761", "body": "I think the main reason is communication for me...", "created_utc": "1648126493.0", "edited": "False", "id": "i1xase9", "is_submitter": "True", "link_id": "t3_tln9p1", "parent_id": "t1_i1vqdnk", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Correct-Monk-6761", "body": "I am usually not bothered when I am being corrected, but I am bothered when it is done specifically by my best friend. I think it's because he was used to correct every single thing, including spelling when I was a beginner.. so I just prefer having fun with him with no corrections", "created_utc": "1648083400.0", "edited": "False", "id": "i1vfdhh", "is_submitter": "True", "link_id": "t3_tln9p1", "parent_id": "t1_i1vd5fb", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Correct-Monk-6761", "body": "I have been also learning persian for a year or so, I felt like you several months ago but it just means you should find some more comprehensible input and expose yourself to comprehensible spoken language. These are some resources you can use, from total beginner to advanced:\nhttps://storybookscanada.ca/stories/fa/\nThese are children books with audio, you can change the levels there also if the first books are too easy.\nNext this is an educational series I watched and it was EXTREMELY HELPFUL for me. \nhttps://farsi.school/library/series/cafe-denj\n\nSome videos on YouTube, like of ted talks in Persian have persian subtitles:\nhttps://youtu.be/Vq_aq3WXR7Y\n\nAnd when watching movies, start with dubbed movies that you have seen before.. In dubbed movies the voice actors speak more clearly, and if you watched it you know approximately what are they about to say..\n\nBy the way, I still struggle sometimes understanding fast conversations, especially if it's on a a hard topic, but I usually can at least catch some of the words.. Listening comprehension is a skill that can be trained and improved.", "created_utc": "1648076459.0", "edited": "1648076866.0", "id": "i1uzi05", "is_submitter": "False", "link_id": "t3_tjzeoe", "parent_id": "t3_tjzeoe", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Correct-Monk-6761", "body": "You can learn a middle eastern language like Arabic, Persian, Turkish or Hebrew. I personally speak Hebrew and Persian and I think both languages are fantastic! I had some limited exposure to Arabic and I want to learn it in the future as well.\nArabic and Hebrew are very close to each other so learning one can help with the other, but Turkish and Persian are totally unrelated to Arabic and also to each other..", "created_utc": "1648073852.0", "edited": "False", "id": "i1ut641", "is_submitter": "False", "link_id": "t3_tkn1em", "parent_id": "t3_tkn1em", "score": "2", "subreddit": "thisorthatlanguage", "subreddit_id": "t5_4inj8f"}, {"author": "Correct-Monk-6761", "body": "I think both Persian and Hebrew are beautiful, I am a native Hebrew speaker and have been learning Persian for quite a long time.. \nHebrew is closer to Arabic in its grammar and words but Persian is more widely used and is definitely worth the effort in my opinion..", "created_utc": "1648073520.0", "edited": "False", "id": "i1uscl0", "is_submitter": "False", "link_id": "t3_qgh0nt", "parent_id": "t3_qgh0nt", "score": "1", "subreddit": "thisorthatlanguage", "subreddit_id": "t5_4inj8f"}, {"author": "Correct-Monk-6761", "body": "قورباغه \nIt's transliteration is: ghurbaaghe or qurbaaqe. I just find throat sounds quite difficult to pronounce..", "created_utc": "1648073039.0", "edited": "False", "id": "i1ur5eh", "is_submitter": "False", "link_id": "t3_tkud42", "parent_id": "t3_tkud42", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Correct-Monk-6761", "body": "I played family farm on my phone both in persian and french (they have like 20+ languages there) and it helped me to learn some animals and plants names when I was a beginner.. \nBut I don't feel it significantly improved my language abilities, only helped me with this farm related vocabulary))).\nI think it's worth a try", "created_utc": "1648034666.0", "edited": "False", "id": "i1s57m9", "is_submitter": "False", "link_id": "t3_tkducf", "parent_id": "t3_tkducf", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Correct-Monk-6761", "body": "It depends on the language but for the Russian rrrr what helped me was saying d d d d , and then trying to relax my tongue and continue saying d d d d d d d.. while I blow air.. it took some practice but it worked for me..", "created_utc": "1648034205.0", "edited": "False", "id": "i1s4i46", "is_submitter": "False", "link_id": "t3_tkqnsn", "parent_id": "t3_tkqnsn", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Correct-Monk-6761", "body": "You need comprehensible input, I started with reading and listening to children books for preschool children after I learned some basic words.\nI wouldn't recommend listening to the radio much: the visual part of movies can help you understand the meaning. Watch movies that you have already seen in your native language or children movies first, before watching more complicated movies with no subtitles..", "created_utc": "1648033895.0", "edited": "False", "id": "i1s41fj", "is_submitter": "False", "link_id": "t3_tkr9gh", "parent_id": "t3_tkr9gh", "score": "4", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Correct-Monk-6761", "body": "I always spoke several languages from early childhood and I noticed that monolinguals struggle with learning a new language much more than I am, mainly because many keep translating things in their head for a long time while I usually stop doing it naturally after a month or two (even though my vocabulary after a month is extremely limited but it just happens without me actively thinking about that). \nI think the best way to tackle this translation in the head problem is with exposure to the language. Reading and watching videos or movies is very important in my opinion (choose content that you can actually understand).\nNow, there is no constant time frame to when people stop translating in their head:\nI had a monolingual friend who migrated from Russia to Israel when she was 14 and she struggled with Hebrew a lot and said she stopped translating everything in her head only after 3 years. But once she stopped, I think her Hebrew became much better and now she speaks much faster and more confidently as well.\nNowadays she is learning English and we talked about her tendency to translate everything in her head, with English she said she stopped doing that after about half a year. It definitely shows in my opinion that the brain gets more \"elastic\" after learning your first foreign language.\nConstant exposure to the language will help you to get rid of that habbit of translating everything in your head and will make the grammar sink in more naturally. And once you learn one language, other languages become easier to learn! So keep learning!\n\nBy the way, I also noticed that when I learn a new word I often remember the phrase where I first saw it, for example: I remember the verb to release or to let go, from the let it go song in my target language (persian), or I stick some association to the new word: kashtan is a kind of tree in Russian and there is a verb in persian that sounds very similar, that means to plant. Or if I can't find an association I sometimes try to shortly describe to myself what this word means in my target language: \"Dinner is eating in the evening\", \"a clown makes people happy\", \"government is where many liers sit together\" (the funniest the explanation the better it helps me to learn)", "created_utc": "1648031662.0", "edited": "1648032978.0", "id": "i1s0xgt", "is_submitter": "False", "link_id": "t3_tk1xi4", "parent_id": "t3_tk1xi4", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Correct-Monk-6761", "body": "It depends, I think being able to read and understand pre school children's books or being able to construct simple sentences by yourself are good goals.", "created_utc": "1648029302.0", "edited": "False", "id": "i1rxwuq", "is_submitter": "False", "link_id": "t3_tk2y4t", "parent_id": "t3_tk2y4t", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Correct-Monk-6761", "body": "150 words a day is bulshit, I would say 10 words a day is much more realistic. Also, sometimes we learn words unconsciously or understand a word from knowing another similar word.. I don't even think it is possible to accurately measure the amount of words that I learn in a single day because when you are learning from books and movies, you don't translate and write every single word (at least I don't). \nI speak Hebrew, Russian, English, Persian and French (I ordered them by proficiency)\nI consider myself native in Hebrew and Russian, pretty fluent in English, advanced in Persian and intermediate in French. Don't believe people who tell you it is possible to achieve such levels in couple of months, I am almost obsessed with Persian and after an entire year I can't consider myself even nearly as good as a native speaker. I think it takes about 2 - 3 years to achieve really good results, and I won't be surprised even if it will take me 4-5 years till I can finally read ancient persian poetry, which is kinda like trying to read Shakespeare's works in English..", "created_utc": "1648029077.0", "edited": "False", "id": "i1rxnb4", "is_submitter": "False", "link_id": "t3_tkc0gt", "parent_id": "t3_tkc0gt", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Correct-Monk-6761", "body": "Reading children stories while riding the bus, it usually takes me 2-15 minutes depending on the length of the story and it can teach you some new vocabulary and overall improve your reading comprehension.", "created_utc": "1648027097.0", "edited": "False", "id": "i1rvbe3", "is_submitter": "False", "link_id": "t3_tklta0", "parent_id": "t3_tklta0", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Correct-Monk-6761", "body": "I actually think I learn the best alone, but it doesn't mean language classes can't be the right choice for some. Usually you can find many YouTube videos explaining how to pronounce certain sounds and I think if you can just come close enough, then you will be understood.. Also try to get feedback from native speakers who won't make fun of you. Good luck 🤞", "created_utc": "1648026957.0", "edited": "False", "id": "i1rv5k6", "is_submitter": "False", "link_id": "t3_tkp0dp", "parent_id": "t3_tkp0dp", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Correct-Monk-6761", "body": "You can try russian or arabic", "created_utc": "1648024636.0", "edited": "False", "id": "i1rsjc0", "is_submitter": "False", "link_id": "t3_texl1d", "parent_id": "t3_texl1d", "score": "1", "subreddit": "polyglot", "subreddit_id": "t5_2reiv"}, {"author": "Correct-Monk-6761", "body": "I have been learning Persian for a year or so, I feel I got it to a good advanced level and my goal is ultimately getting it to the same level as my English. I also know some French and I can read simple texts and watch movies, but it is worse than my Persian.\nAfter you get to near native fluency in one language, you can better understand how should you learn languages in the future.\n\nI also think that Bilingualism can help in many aspects such as: pronunciation, learning new writing systems and grammar structures. \nBut realistic expectations are important as well: bilingualism doesn't make the process of learning a language \"effortless\".\nSometimes people say to me: I want to learn Russian to read Tolstoy, or I want to learn Hebrew to read the Bible. These goals are realistic but bilingual or not, it will take you several years to actually achieve these goals. Because such things require near native fluency and achieving it requires time, lots of time.\n\nI can effortlessly read iconic English books from the 19th century and I am trying to recreate the same success with Persian. But now, after I already know how to study the best, it takes me much less time: I think my progress in Persian in one year, is significantly bigger than after 9 years of learning English at school.", "created_utc": "1648021806.0", "edited": "1648026371.0", "id": "i1rpb2m", "is_submitter": "False", "link_id": "t3_tbg44r", "parent_id": "t1_i1r0ipn", "score": "2", "subreddit": "bilingual", "subreddit_id": "t5_2woi2"}, {"author": "Correct-Monk-6761", "body": "I live in Israel but my mom migrated from Russia right before I was born. My mother told me that till the age of 3 they would speak solely Russian at home. Then, at the age of 3.5, my mom took me to an Israeli kindergarten with no russian speakers and I quickly learned Hebrew. \n\nToday my Russian and Hebrew are at the same level. I noticed that I am doing certain actions in certain languages: I speak Russian with my parents and some friends, I speak Hebrew at work and in the university.. I also have some habits that make me use both languages almost equally: I prefer watching the news in Hebrew, but if I wanted to read a novel I would prefer Russian or English. In general, I also use English quite often and I watch movies and YouTube videos mostly in English. \nI always loved languages and I think the most important is passing the love towards languages to your children.", "created_utc": "1647985382.0", "edited": "False", "id": "i1psrsd", "is_submitter": "False", "link_id": "t3_tbg44r", "parent_id": "t3_tbg44r", "score": "2", "subreddit": "bilingual", "subreddit_id": "t5_2woi2"}, {"author": "Correct-Monk-6761", "body": "I'm israeli and I am learning Persian. I think you should always remind yourself the reason, why did you start learning Russian in the first place. For me, Persian is very beautiful and romantic language, I love its sound, I also want to learn more about the Iranian people and their culture. \n\nThis is what keeps me motivated and I don't care about the politics when it comes to learning a language.\n\nI actually speak Russian fluently (my Russian is better than my English so I consider myself pretty fluent) and I think this is one of the most beautiful languages in the world, I would definitely recommend you to continue:\nRussian culture is fascinating, russian folk music and dances are very beautiful in my opinion, there are also many famous russian poets and writers and knowing the language can open you to a whole new world of amazing literature. \n\nBut if you still feel lack of motivation, you can switch to Ukranian pretty easily: Many words sound quite similar between the two. I understand about 85-90% when ukranians speak, so, if your motivation is severely impacted it is not a bad idea to switch to Ukranian.. Because motivation is pretty important component in language learning.", "created_utc": "1647969066.0", "edited": "False", "id": "i1oms4j", "is_submitter": "False", "link_id": "t3_t0c1pc", "parent_id": "t3_t0c1pc", "score": "2", "subreddit": "polyglot", "subreddit_id": "t5_2reiv"}, {"author": "Correct-Monk-6761", "body": "זה בגלל שאנחנו גדלנו לתוך השפה העברית. אם אתה לומד עברית בתור שפה זרה זה ממש לא אינטואיטיבי. לדוגמא בצרפתית וגם ברוסית המילה לג'ירפה היא כמעט זהה אבל ברוסית זה זכר ובצרפתית זה נקבה.\n\nוהדרך היחידה לדעת את הדברים הללו באופן אינטואיטיבי זה דרך חשיפה ממושכת לשפה", "created_utc": "1647958690.0", "edited": "False", "id": "i1nwhpy", "is_submitter": "False", "link_id": "t3_tjl5ij", "parent_id": "t3_tjl5ij", "score": "1", "subreddit": "hebrew", "subreddit_id": "t5_2rk3f"}, {"author": "Correct-Monk-6761", "body": "I would say khool in general when talking about traveling abroad, it is just shortened from khutz laaretz:\nחזרתי מחו\"ל \nKhazarti mekhool = I came back from abroad.\nEretz is a country in general but when you say laaretz or haaretz it kinda means: of this country, and we usually refer to Israel when we say haaretz. It implies you are talking about Israel.. For example, if I would live in Canada and talk to an Israeli who lives in Israel, I would say to him: noladeti baarets = I was born in Israel. \nHe would understand by baarets that I mean Israel and not Canada.", "created_utc": "1647958391.0", "edited": "False", "id": "i1nvsqy", "is_submitter": "False", "link_id": "t3_tjc45h", "parent_id": "t3_tjc45h", "score": "1", "subreddit": "hebrew", "subreddit_id": "t5_2rk3f"}, {"author": "Correct-Monk-6761", "body": "There is no rule when to use kholam khaser or male, just the more you read and expose yourself to the language the more you remember how certain words look. Most of the time, if you are not sure, go for the kholam male.", "created_utc": "1647957490.0", "edited": "False", "id": "i1ntpsj", "is_submitter": "False", "link_id": "t3_tk01jn", "parent_id": "t3_tk01jn", "score": "2", "subreddit": "hebrew", "subreddit_id": "t5_2rk3f"}, {"author": "Correct-Monk-6761", "body": "Just as any other day: work, eat, study, sleep..", "created_utc": "1644947026.0", "edited": "False", "id": "hx27gbk", "is_submitter": "False", "link_id": "t3_st8kwe", "parent_id": "t3_st8kwe", "score": "3", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "Correct-Monk-6761", "body": "I checked that website today, looks nice although I prefer forvo more often because I prefer recordings..", "created_utc": "1644946872.0", "edited": "False", "id": "hx271m3", "is_submitter": "False", "link_id": "t3_srkhgg", "parent_id": "t1_hwtlm7s", "score": "1", "subreddit": "farsi", "subreddit_id": "t5_2t22i"}, {"author": "Correct-Monk-6761", "body": "Oh that's really interesting", "created_utc": "1644862178.0", "edited": "False", "id": "hwxorf9", "is_submitter": "True", "link_id": "t3_srjr3u", "parent_id": "t1_hww6hwg", "score": "2", "subreddit": "PERSIAN", "subreddit_id": "t5_2rzk9"}, {"author": "Correct-Monk-6761", "body": "Oh  I heard damet garm but wasnt sure how to use it, thanks for the example))", "created_utc": "1644765000.0", "edited": "False", "id": "hws92uu", "is_submitter": "True", "link_id": "t3_srjr3u", "parent_id": "t1_hws737e", "score": "4", "subreddit": "PERSIAN", "subreddit_id": "t5_2rzk9"}, {"author": "Correct-Monk-6761", "body": "Go find a bunker to survive through those 24 hours", "created_utc": "1644764812.0", "edited": "False", "id": "hws8nmd", "is_submitter": "False", "link_id": "t3_srkfrk", "parent_id": "t3_srkfrk", "score": "2", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "Correct-Monk-6761", "body": "Why don't you eat?", "created_utc": "1644764716.0", "edited": "False", "id": "hws8fym", "is_submitter": "False", "link_id": "t3_srkh6w", "parent_id": "t3_srkh6w", "score": "2", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "Correct-Monk-6761", "body": "Chopin :(\n\nBut I am pretty sure I wouldn't stop ressurecting musicians just after one!", "created_utc": "1644764657.0", "edited": "False", "id": "hws8b2s", "is_submitter": "False", "link_id": "t3_srkh8c", "parent_id": "t3_srkh8c", "score": "2", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "Correct-Monk-6761", "body": "SpongeBob - it is his occupation", "created_utc": "1644764562.0", "edited": "False", "id": "hws83fw", "is_submitter": "False", "link_id": "t3_srkhpc", "parent_id": "t3_srkhpc", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "Correct-Monk-6761", "body": "I dont have such name, maybe it's because my ex and my father share the same name :) HAHA", "created_utc": "1644763094.0", "edited": "False", "id": "hws4vwl", "is_submitter": "False", "link_id": "t3_sr6oht", "parent_id": "t3_sr6oht", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "Correct-Monk-6761", "body": "A true hell is if there is no TV!!!! :)", "created_utc": "1644762922.0", "edited": "False", "id": "hws4il2", "is_submitter": "False", "link_id": "t3_sqpw0c", "parent_id": "t3_sqpw0c", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}]