[{"author": "CrashingFirefly", "body": "Thanks for sharing your experience! 3 lbs sounds like a lot of fat loss in such a short period - to how much weight loss does this translate for you?", "created_utc": "1667139283.0", "edited": "False", "id": "iudejq7", "is_submitter": "True", "link_id": "t3_yhc7v2", "parent_id": "t1_iud90xp", "score": "1", "subreddit": "StrongerByScience", "subreddit_id": "t5_1402ea"}, {"author": "CrashingFirefly", "body": "I'm well familiar with Dr. Israetel's content, and know about minicuts thanks to him. I know he talks about duration, and not a specific weight loss target, which is  why I'm posing the question here. But if I have missed something in his guide/book, please let me know! Usually 'Google it' is a good response, but in this case I have already done so extensively and not found a satisfactory answer.", "created_utc": "1667139177.0", "edited": "False", "id": "iudeb03", "is_submitter": "True", "link_id": "t3_yhc7v2", "parent_id": "t1_iud2yqr", "score": "2", "subreddit": "StrongerByScience", "subreddit_id": "t5_1402ea"}, {"author": "CrashingFirefly", "body": "That sounds very sensible! I'm able to reach 'high' protein intake, but just takes quite a bit effort which maybe just isn't worth the hassle. Monitoring the progress and recovery and adjust if necessary seems like a good idea, thanks!", "created_utc": "1667074207.0", "edited": "False", "id": "iuaccse", "is_submitter": "True", "link_id": "t3_ygbtfy", "parent_id": "t1_iu7zz7s", "score": "1", "subreddit": "MacroFactor", "subreddit_id": "t5_4acm3h"}, {"author": "CrashingFirefly", "body": "Thanks for the input, Greg! In that case, I will stick with medium and see how it goes.", "created_utc": "1667073873.0", "edited": "False", "id": "iuabl5g", "is_submitter": "True", "link_id": "t3_ygbtfy", "parent_id": "t1_iu95kpd", "score": "2", "subreddit": "MacroFactor", "subreddit_id": "t5_4acm3h"}, {"author": "CrashingFirefly", "body": "Past week I've been making a chickpea flour mugcake a few times. I like being able to stir some cupboard ingredients together, fling it in the microwave and create a quite well-tasting, macro-friendly desert. \n\nIn the last SBS Fireside Chat, the dilemma of a life without dairy or gluten was discussed. This recipe actually doesn't contain either. Now, I have already given up dairy some time ago, and I'm definitely not planning on letting gluten go, but I had bought some chickpea flour to try out some different recipes and this came out nicely.\n\nRecipe: \n- Chickpea flour, 25g\n- Protein powder, 10g\n- Cacao powder, 10g\n- Baking powder, 0.5 ts\n- (Plant-based) milk, 75 ml\n- Sweetener, like agave syrup, 10g\n(vanilla extract, cinnamon)\n\n(19/4/26 - P/F/C)\n\nStir dry ingredients. Stir wet ingredients. Put in microwave for 1-2 minutes (depending on your wattage). I like to eat it with some berries. Obviously you can also make it with other types of flour, but the chickpea flour adds some extra protein to it.", "created_utc": "1661998643.0", "edited": "False", "id": "imlw951", "is_submitter": "False", "link_id": "t3_x2m7gr", "parent_id": "t3_x2m7gr", "score": "2", "subreddit": "MacroFactor", "subreddit_id": "t5_4acm3h"}, {"author": "CrashingFirefly", "body": "I wish all food recipe websites would adopt your writing style: clear, straight to the point, using unconventional measuring units (clamshell?) and without a backstory of how you came across this amazing recipe during your honeymoon in Bali 2 years ago. \n\nOn a serious note though: Why not add some spices? ;)", "created_utc": "1661997967.0", "edited": "False", "id": "imlurid", "is_submitter": "False", "link_id": "t3_x2m7gr", "parent_id": "t1_imlb9rv", "score": "4", "subreddit": "MacroFactor", "subreddit_id": "t5_4acm3h"}, {"author": "CrashingFirefly", "body": "Then again, seeing that you're learning Dutch, you should know the words 'kroket' and 'bitterbal' (both made of meat) because nowadays you -fortunately - can find vegan variants of those famous snacks everywhere in the Netherlands! :)", "created_utc": "1661787539.0", "edited": "False", "id": "im9nnv7", "is_submitter": "False", "link_id": "t3_x0n1wk", "parent_id": "t1_im9ams5", "score": "16", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "CrashingFirefly", "body": "Fellow Dutchman (and MF'er) here! I've had some issues with the DB, but I generally eat plenty of common foods (thus do not have much problems). Something I do find quite annoying, however, is that when I add a new food entry - because the one item recognised by the scanner is incorrect (e.g. it's a similar product, but different brand or something) - I still get the original product when I use the scanner, instead of my own correct entry.\n\nIt's a shame that custom food entries are not added to the DB, otherwise you could basically find the macros for every item at the Albert Heijn ;)", "created_utc": "1661256621.0", "edited": "False", "id": "ilg26q5", "is_submitter": "False", "link_id": "t3_wvlqah", "parent_id": "t3_wvlqah", "score": "6", "subreddit": "MacroFactor", "subreddit_id": "t5_4acm3h"}, {"author": "CrashingFirefly", "body": "Yes, I have the same 'problem' at the moment. I work a job where I'm working long days for 6 weeks, after which I get 4 weeks leave. During the work period, I can only go training after my shift, usually around 7/8 'o clock in the evening. As you mention, caffeine is a major sleep disruptor (even if you don't feel like it is) so I simply train without any pre-workout caffeine. I have lowered my overall caffeine intake as well to attenuate energy fluctuations. So far, my training has not suffered, as far as I'm able to notice. In the end it's up to you, but I think it's also good to realize that - although caffeine can support your training - it's definitely not a necessity. Good luck with your job!", "created_utc": "1661250771.0", "edited": "False", "id": "ilfsr7h", "is_submitter": "False", "link_id": "t3_wvl0x7", "parent_id": "t3_wvl0x7", "score": "4", "subreddit": "StrongerByScience", "subreddit_id": "t5_1402ea"}, {"author": "CrashingFirefly", "body": "Hey! If you don't fully understand the program, I would stick with the vanilla program (as it is). Depending on your experience in the gym, I would start with 1 T2 and 2 T3s. For the T3s, you want to focus on bodybuilding and prehab exercises in the high-rep range (15+). This could be anything, but as a suggestion you could start with bicep curls, lateral raises, lat pulldowns and tricep work.", "created_utc": "1660563128.0", "edited": "False", "id": "ikdc3ed", "is_submitter": "False", "link_id": "t3_wohzes", "parent_id": "t1_ikb2mwp", "score": "2", "subreddit": "gzcl", "subreddit_id": "t5_33j1o"}, {"author": "CrashingFirefly", "body": "Pois, percebo perfeitamente as saudades :) E fico feliz a ouvir que há muitas outras coisas que gostas (arenque, às sério, como?!). Sei que o salário é um fator importante para emigrar - e faz tudo o sentido - mas é bom também escolher um país por outras razões.", "created_utc": "1660297052.0", "edited": "False", "id": "ijz356e", "is_submitter": "False", "link_id": "t3_wmc6hx", "parent_id": "t1_ijyxijm", "score": "3", "subreddit": "portugal", "subreddit_id": "t5_2qmie"}, {"author": "CrashingFirefly", "body": "Sim, acontece para pessoas que não têm salário suficiente para pagar a renda. Com um salário de 3500 euros por mês, não será preciso (ou justo).", "created_utc": "1660292764.0", "edited": "False", "id": "ijyxu63", "is_submitter": "False", "link_id": "t3_wmc6hx", "parent_id": "t1_ijyrp4q", "score": "2", "subreddit": "portugal", "subreddit_id": "t5_2qmie"}, {"author": "CrashingFirefly", "body": "Sim, o pessoal é muito bem-vindo na Holanda (há bué de oferta de emprego nesta altura), mas - além do que todas as pessoas pensam - vale a pena aprender a nossa língua. Nem só para mostrar respeito, mas também para integrar melhor na sociedade (em vez de resmungar sobre o facto que os holandeses são frios demais para criar amizades).\n\nO mercado de arrendamento não está descontrolado por todo o país; só nas cidades (maiores). Caso que quiseres viver numa zona mais rural, ainda há bastante opções. \n\nE só uma coisa para acrescentar: tenho de admitir que os nossos (quase) vizinhos do Norte, como a Dinamarca, são ainda mais planejados. No entanto, também acho que lá imigrantes não são tão bem-vindas.", "created_utc": "1660292370.0", "edited": "False", "id": "ijyxclu", "is_submitter": "False", "link_id": "t3_wmc6hx", "parent_id": "t1_ijylzoc", "score": "3", "subreddit": "portugal", "subreddit_id": "t5_2qmie"}, {"author": "CrashingFirefly", "body": "Sendo holandês, faz-me um pouco triste que a única coisa positiva sobre o meu país mencionada por ti é o salário. Sim, entendo que hajam coisas que não gostas sobre os Países Baixos, mas - tal como todos os países e todas as culturas - temos os nossos pontos fortes e fracos.", "created_utc": "1660291817.0", "edited": "False", "id": "ijywoks", "is_submitter": "False", "link_id": "t3_wmc6hx", "parent_id": "t1_ijyriox", "score": "5", "subreddit": "portugal", "subreddit_id": "t5_2qmie"}, {"author": "CrashingFirefly", "body": "Thanks! That makes it a bit more reassuring.", "created_utc": "1659964589.0", "edited": "False", "id": "ijfrl1x", "is_submitter": "False", "link_id": "t3_wi8iim", "parent_id": "t1_ijae9fr", "score": "2", "subreddit": "gzcl", "subreddit_id": "t5_33j1o"}, {"author": "CrashingFirefly", "body": "Yes, you are right - that was what I was referring to. But reading your comments, it seems I should simply finish the first block, maybe not take it too hard on the 1RMs, and then repeat the first six weeks again. Thanks!", "created_utc": "1659964559.0", "edited": "False", "id": "ijfrirj", "is_submitter": "False", "link_id": "t3_wi8iim", "parent_id": "t1_ijev1dq", "score": "1", "subreddit": "gzcl", "subreddit_id": "t5_33j1o"}, {"author": "CrashingFirefly", "body": "Yes, that does sound like a good option, thanks!", "created_utc": "1659964445.0", "edited": "False", "id": "ijfra3o", "is_submitter": "False", "link_id": "t3_wi8iim", "parent_id": "t1_ijayvti", "score": "1", "subreddit": "gzcl", "subreddit_id": "t5_33j1o"}, {"author": "CrashingFirefly", "body": "I am running JnT 2.0 and I'm currently in week 3. As I feel I'm only now starting to do the program as I'm supposed to, I was thinking of simply repeating the first three weeks again with adjustments I've made in the past three weeks. Is it alright to redo the 1st half of the 1st block? \n\nAnd a related question: Would it be alright to skip the 1RM week in its entirety, and instead take a deload week and return to week 1 of JnT again? I'm currently mostly looking to increase size, and I do not like testing out my 1RMs.", "created_utc": "1659853229.0", "edited": "False", "id": "ija52q9", "is_submitter": "False", "link_id": "t3_wi8iim", "parent_id": "t3_wi8iim", "score": "1", "subreddit": "gzcl", "subreddit_id": "t5_33j1o"}, {"author": "CrashingFirefly", "body": "Good luck! \n\nThe setup looks fine to me; maybe add an extra triceps exercise as T3. \n\nAlso, do you mean to say that you're doing IF to compensate for eating 'badly' later at night? Because that doesn't sound like a healthy habit.", "created_utc": "1659337699.0", "edited": "False", "id": "iiharja", "is_submitter": "False", "link_id": "t3_wd1qmh", "parent_id": "t3_wd1qmh", "score": "3", "subreddit": "gzcl", "subreddit_id": "t5_33j1o"}, {"author": "CrashingFirefly", "body": "Cheers, thanks for the suggestion! However, that's exactly why I would like to include the Z-press. I also do dumbell OHP as T2B on bench day.", "created_utc": "1659103497.0", "edited": "False", "id": "ii4ncf6", "is_submitter": "False", "link_id": "t3_wawtic", "parent_id": "t1_ii4gk3h", "score": "1", "subreddit": "gzcl", "subreddit_id": "t5_33j1o"}, {"author": "CrashingFirefly", "body": "I'm currently doing JnT 2.0, and thought about replacing the legs up bench for the Z-press. What do you think about that? I would like to focus more on OHP. However, maybe it's too much to do the Z-press as T2 on the OHP day? Thanks for the input!", "created_utc": "1659094572.0", "edited": "False", "id": "ii459be", "is_submitter": "False", "link_id": "t3_wawtic", "parent_id": "t3_wawtic", "score": "1", "subreddit": "gzcl", "subreddit_id": "t5_33j1o"}, {"author": "CrashingFirefly", "body": "Ah, good to know, thanks! It's a bit far for me, but I'll go there on my day off to buy some stuff in bulk.", "created_utc": "1659015618.0", "edited": "False", "id": "ihzm58t", "is_submitter": "False", "link_id": "t3_w79u23", "parent_id": "t1_ihwwrk9", "score": "1", "subreddit": "Romania", "subreddit_id": "t5_2qm35"}, {"author": "CrashingFirefly", "body": "Cheers, thanks for adding that!", "created_utc": "1659015575.0", "edited": "False", "id": "ihzm1vh", "is_submitter": "False", "link_id": "t3_w79u23", "parent_id": "t1_ihvwhxz", "score": "2", "subreddit": "Romania", "subreddit_id": "t5_2qm35"}, {"author": "CrashingFirefly", "body": "Bună! I'm staying - again - for six weeks in Constanța for work. Last time, I always got my groceries at the Mega Image, but I was wondering what you actually consider the best supermarket to get vegan products (plant-based milk, vegan burgers, etc.). I have access to Mega Image, Carrefour, Lidl and Kaufland (and maybe more?). If these kind of posts are not allowed, my apologies. Mulțumesc!", "created_utc": "1658941165.0", "edited": "False", "id": "ihvh7zz", "is_submitter": "False", "link_id": "t3_w79u23", "parent_id": "t3_w79u23", "score": "7", "subreddit": "Romania", "subreddit_id": "t5_2qm35"}, {"author": "CrashingFirefly", "body": "Not trying to take away from Greg's sangria-making skills, but making sangria is quite straightforward and open to variation. I would just look up a recipe online with fruits you like! :) And also, don't use expensive wine for sangria ;)", "created_utc": "1658925910.0", "edited": "False", "id": "ihufo43", "is_submitter": "False", "link_id": "t3_w9begz", "parent_id": "t3_w9begz", "score": "6", "subreddit": "StrongerByScience", "subreddit_id": "t5_1402ea"}, {"author": "CrashingFirefly", "body": "Thanks for sharing the article! I do have some doubts about it still, though. The article is quite old (which doesn't have to be necessarily bad, of course) and seems to focus mostly on ecological observations and animal studies. The cited trial on iron absorption in humans only increased fibre intake with 11-12 grams, which is still a relatively small increase.\n\nAlso, don't you think that in the quote you included the authors evade the question a bit? A high fibre intake has beneficial effects, but also probably up to a certain point. There might be an inflection point, where the benefits do not outweigh the possible adverse effects anymore. Love to hear what you think!", "created_utc": "1656049931.0", "edited": "False", "id": "idizv9x", "is_submitter": "True", "link_id": "t3_viqt6q", "parent_id": "t1_idfwsmt", "score": "1", "subreddit": "StrongerByScience", "subreddit_id": "t5_1402ea"}, {"author": "CrashingFirefly", "body": "3x15 chin-ups is quite a difficult feat, so I would stick with lat pulldowns as T3. I personally do weighted chin-ups as both T1 and T2 and single-arm lat pulldowns for T3. Gives you ample back volume, but thanks to the different rep ranges also allows you to recover in between!", "created_utc": "1655984807.0", "edited": "False", "id": "idf49yi", "is_submitter": "False", "link_id": "t3_vipuoj", "parent_id": "t1_idescbv", "score": "1", "subreddit": "gzcl", "subreddit_id": "t5_33j1o"}, {"author": "CrashingFirefly", "body": "Cheers, thanks for the suggestion! I guess option 3 seems the most reasonable, but I'm simply a bit hesitant to pauze the cut if not strictly necessary (although it's the smart thing to do, probably!).", "created_utc": "1655637361.0", "edited": "False", "id": "icxlotl", "is_submitter": "True", "link_id": "t3_vf3zoo", "parent_id": "t1_icxjjtz", "score": "1", "subreddit": "StrongerByScience", "subreddit_id": "t5_1402ea"}, {"author": "CrashingFirefly", "body": "Well, it seems to be a combination: I'm having a hard time to complete all the exercises and/or to progress, but I also focus much more on food - although it would be a stretch to say that I'm constantly hungry, and I definitely do not wake up because of hunger (fortunately!). Performance does not decline yet, but I do have to push much harder to not decline yet.", "created_utc": "1655566885.0", "edited": "False", "id": "icubvsa", "is_submitter": "True", "link_id": "t3_vf3zoo", "parent_id": "t1_ictroqz", "score": "1", "subreddit": "StrongerByScience", "subreddit_id": "t5_1402ea"}, {"author": "CrashingFirefly", "body": ">Does your cut have to end in 30 days or can you extend it? You may just   \nneed a mental break from the deficit and/or training. I.e 1/2week diet   \nbreak at maintenance and reducing your NEAT activity and/or a deload.\n\nNo, there is no need to be 'finished' in 30 days, so what you're proposing sounds good.\n\nAlso, you're situation sounds quite similar (0.6% BW loss and about the same time in), so glad to hear that this worked for you! :)", "created_utc": "1655566688.0", "edited": "False", "id": "icubh0p", "is_submitter": "True", "link_id": "t3_vf3zoo", "parent_id": "t1_ictuzgx", "score": "2", "subreddit": "StrongerByScience", "subreddit_id": "t5_1402ea"}, {"author": "CrashingFirefly", "body": "Indoors is usually a bit more tricky, as calisthenics heavily relies on pulling exercises (and using the shower curtains as pull-up bar is somewhat disrespectful to the owners). Rings are, in my opinion, one of the best fitness equipments you can get: easy to carry around and they allow you to set-up a 'gym' almost anywhere you go. For programs, you can just go with the r/bodyweight fitness Recommended Routine or look into the programs by FitnessFAQ or Tom Merrick. If you want a bit of a deep dive, the book 'Overcoming Gravity' is a recommended read. However, you can also keep it simple and straight: just do (some form of) pull-ups, push-ups, rows and legs (e.g. split squats or pistol squats). \n\nAlso, are you staying in one place very remote in Vietnam? If you're staying in an urban area, you can probably (in my experience) find a gym where you can exercise with a one-day pass relatively cheap.\n\nAnd on a final sidenote: If you're going there for travels, I just wouldn't worry too much about it. Doing a lot of activities, like hiking and swimming, means you'll stay quite fit and you don't have to worry about exercising too much :)", "created_utc": "1655540760.0", "edited": "False", "id": "ict93zw", "is_submitter": "False", "link_id": "t3_vf1edv", "parent_id": "t3_vf1edv", "score": "11", "subreddit": "StrongerByScience", "subreddit_id": "t5_1402ea"}, {"author": "CrashingFirefly", "body": "TVP definitely doesn't taste like nothing, but that also means you can turn it into whatever you want! Maybe you're already doing this, but soaking the TVP in broth combined with spices (e.g. smoked paprika, garlic and/or onion powder, Worcester, curry, whatever) is an easy way to give it some more flavour.", "created_utc": "1655353499.0", "edited": "False", "id": "icjn1eo", "is_submitter": "False", "link_id": "t3_vd0i5n", "parent_id": "t1_ichk6w1", "score": "2", "subreddit": "MacroFactor", "subreddit_id": "t5_4acm3h"}, {"author": "CrashingFirefly", "body": "Thank you for chipping in, Greg! In that case, I'll continue to track to the best of my abilities. I also expect that I'll be able to track at least some meals more accurately (assuming I can cook now and then). \n\nAnd keep up the great work with the podcast and the app! :)", "created_utc": "1652779920.0", "edited": "False", "id": "i8xdieo", "is_submitter": "True", "link_id": "t3_uq0ae5", "parent_id": "t1_i8wllpg", "score": "3", "subreddit": "MacroFactor", "subreddit_id": "t5_4acm3h"}, {"author": "CrashingFirefly", "body": "Hi, thanks for your reply! I guess you're right: maybe it's better to see how the situation will be, and adjust my approach accordingly.", "created_utc": "1652688212.0", "edited": "False", "id": "i8so3ui", "is_submitter": "True", "link_id": "t3_uq0ae5", "parent_id": "t1_i8obsaw", "score": "1", "subreddit": "MacroFactor", "subreddit_id": "t5_4acm3h"}, {"author": "CrashingFirefly", "body": "Thanks for sharing your thoughts (and experiences)! I do have internet on-site, so I could definitely do my tracking. I guess what I'm wondering about is whether inaccurately tracking (without food scale) is better than simply not tracking at all. However, what you're saying makes sense: Even if tracking is inaccurate, it will help pick up TDEE estimates quicker once I get back tracking (right?). I'll follow your suggestion, cheers! :)", "created_utc": "1652688155.0", "edited": "False", "id": "i8so1he", "is_submitter": "True", "link_id": "t3_uq0ae5", "parent_id": "t1_i8pgj83", "score": "1", "subreddit": "MacroFactor", "subreddit_id": "t5_4acm3h"}, {"author": "CrashingFirefly", "body": "The Wikipedia page of TVP gives an overview of the nutritional value: [https://en.wikipedia.org/wiki/Textured\\_vegetable\\_protein](https://en.wikipedia.org/wiki/Textured_vegetable_protein) (source is USDA database). The micro-nutrient content is not too shabby, and soy is also considered to be a complete protein. Having said that, I personally (as a vegan) like to diversify my protein sources as much as possible. Following a plant-based diet means - by definition - that you are limiting your food options, so adding some more variety doesn't hurt. Maybe you could also add some pea-rice protein (mixed) to your diet, as they form a complete protein together and are usually not too expensive compared to soy (although this might depend on your locale). All in all, your post might be an interesting topic for a podcast!", "created_utc": "1651410984.0", "edited": "False", "id": "i6whcnf", "is_submitter": "False", "link_id": "t3_ufrwa1", "parent_id": "t3_ufrwa1", "score": "3", "subreddit": "StrongerByScience", "subreddit_id": "t5_1402ea"}, {"author": "CrashingFirefly", "body": "I've mentioned it today to him; he didn't know it yet, but was interested. I've sent him some promising PubMed papers I've found. It seems the medication is still waiting for approval, correct? May I ask how you have got access to enclomiphene?", "created_utc": "1650556557.0", "edited": "False", "id": "i5mpxri", "is_submitter": "False", "link_id": "t3_u7su9h", "parent_id": "t1_i5irpqn", "score": "1", "subreddit": "Testosterone", "subreddit_id": "t5_2se6p"}, {"author": "CrashingFirefly", "body": "Ah, I've seen this pop up several times. What's the difference between enclomiphene and clomiphene?", "created_utc": "1650468928.0", "edited": "False", "id": "i5hr69f", "is_submitter": "False", "link_id": "t3_u7su9h", "parent_id": "t1_i5hjbh4", "score": "1", "subreddit": "Testosterone", "subreddit_id": "t5_2se6p"}, {"author": "CrashingFirefly", "body": "Cheers, thanks for sharing your experience! So when you stopped treatment, you mean you did not take any medication/weren't on any regiment, right? Did you notice significant improvements once you started TRT, compared to when you were on clomid?", "created_utc": "1650459617.0", "edited": "False", "id": "i5h4yb7", "is_submitter": "False", "link_id": "t3_u7su9h", "parent_id": "t1_i5gqnq2", "score": "1", "subreddit": "Testosterone", "subreddit_id": "t5_2se6p"}, {"author": "CrashingFirefly", "body": "Yes, that's true unfortunately. I wish Quorn would extend their range of (vegan) products. Most mock meats are soy-based, so for adding more variety in protein sources on a vegan or vegetarian diet (or any diet for that matter!), Quorn's mycoprotein is great.\n\nAnd yes, the black beans sound a bit weird, but legumes are great for satiety, micronutrients and even flavour. Chocolate and black beans go great together, so it's maybe not as weird as it might sound! ;)", "created_utc": "1650051716.0", "edited": "False", "id": "i4vcx4j", "is_submitter": "False", "link_id": "t3_u417b4", "parent_id": "t1_i4uv8dl", "score": "3", "subreddit": "MacroFactor", "subreddit_id": "t5_4acm3h"}, {"author": "CrashingFirefly", "body": "Correct, you can read about it in this paper: [https://www.ncbi.nlm.nih.gov/pmc/articles/PMC7760812/](https://www.ncbi.nlm.nih.gov/pmc/articles/PMC7760812/). I personally mix pea-rice with a ratio of 0.7/0.3. The vegan protein blends are usually much more expensive than simply mixing it yourself.", "created_utc": "1650012400.0", "edited": "False", "id": "i4t6er0", "is_submitter": "False", "link_id": "t3_u417b4", "parent_id": "t1_i4t30k3", "score": "5", "subreddit": "MacroFactor", "subreddit_id": "t5_4acm3h"}, {"author": "CrashingFirefly", "body": "Yes, I've been vegan for a few years already, and now currently in a deficit with MF on a high protein program (171 grams / 2819 calories). In my opinion, it's necessary to consume some form of protein isolates to reach your target. For me, this is about 60 grams per day of protein powder. I also try to swap in high-protein options wherever I can. With this approach, I hit my daily target quite easily. Most days, I eat more or less the same meals until dinner:  \n\\- Overnight oats (breakfast): Oats, cocoa powder, date syrup (or other sweetener), walnuts, protein powder (pea/rice), black beans  \n\\- Trek bar (snack)  \n\\- Protein shake (after workout): Spinach/kale, banana, soy milk, flaxseed, creatine, protein powder  \n\\- Sandwich (lunchish): Low carb bread (usually enriched with soy protein), home-made hummus, grilled tofu or tempeh or mock meat (e.g. Quorn), condiments  \n\\- Yoghurt: PB yoghurt, high-protein muesli, freezer fruits (berries or mango)\n\nFor dinner, I always eat something different, and it is generally a relatively low protein meal. However, you can keep protein high and calories low by using a lot of vegetables and legumes and opting for a whole-grain carb source (e.g. brown rice or whole-wheat pasta). Depending on your locale, you might also be able to find high-protein carb sources, like pasta made of lentils. If you decide to add a lot of mock meats to your diet, be mindful of the sodium content (which is usually quite high). Good luck, and if you have any other questions, feel free to reach out! Great that you're trying to reduce your consumption of animal products.", "created_utc": "1650004000.0", "edited": "False", "id": "i4sw6jc", "is_submitter": "False", "link_id": "t3_u417b4", "parent_id": "t3_u417b4", "score": "12", "subreddit": "MacroFactor", "subreddit_id": "t5_4acm3h"}, {"author": "CrashingFirefly", "body": "I've made [this](https://www.bbcgoodfood.com/recipes/vegan-jambalaya) vegan jambalaya twice last week. I also added plant-based minced meat, which worked great, but you could add whatever you like to increase the protein content. It is a super satiating and tasty meal, which is easy to make (one-pot!) and doesn't cost much. Also easy to tweak (e.g., throwing in some additional veggies), stores well and has plenty of micro-nutrients. Definitely recommended for meal prepping, and something I will keep in my go-to dishes!", "created_utc": "1649920211.0", "edited": "False", "id": "i4o7pjg", "is_submitter": "False", "link_id": "t3_u31k5s", "parent_id": "t3_u31k5s", "score": "2", "subreddit": "MacroFactor", "subreddit_id": "t5_4acm3h"}, {"author": "CrashingFirefly", "body": "I working towards a 50% weighted chin-up, which would be - grosso modo - 37.5 KG. This week, I did a 25 KG weighted chin (6 x 2). Still quite a way to go, but as I'm still bulking up slowly, I'm hoping that I will be able to keep increasing the weight for some time whilst chipping away my own weight during the upcoming deficit phase.", "created_utc": "1647899224.0", "edited": "False", "id": "i1l1irp", "is_submitter": "False", "link_id": "t3_tiy8tz", "parent_id": "t3_tiy8tz", "score": "2", "subreddit": "MacroFactor", "subreddit_id": "t5_4acm3h"}, {"author": "CrashingFirefly", "body": "Alright, good to know! Then it's probably my Chromium installation. Will reinstall to see if it fixes the problem.", "created_utc": "1647361553.0", "edited": "False", "id": "i0rlq2w", "is_submitter": "True", "link_id": "t3_te4mc8", "parent_id": "t1_i0r6hdu", "score": "1", "subreddit": "tutanota", "subreddit_id": "t5_37gku"}, {"author": "CrashingFirefly", "body": "Thanks! Yes, I agree, I better see how far I can push it. Having said that, I doubt I will be able to add anything to my T2 OHP, as the weight increments are relatively large..", "created_utc": "1646826129.0", "edited": "False", "id": "hzym5tl", "is_submitter": "False", "link_id": "t3_t7t8my", "parent_id": "t1_hztucja", "score": "1", "subreddit": "gzcl", "subreddit_id": "t5_33j1o"}, {"author": "CrashingFirefly", "body": "Glad to hear! I really like the setup of the app, but this missing feature is the only thing holding me back from switching from the Strong app. I also program weighted chin-ups as T1, so it would be great to be able to add those as well.", "created_utc": "1646814597.0", "edited": "False", "id": "hzy84y1", "is_submitter": "False", "link_id": "t3_t9jpu4", "parent_id": "t1_hzw6cg8", "score": "1", "subreddit": "gzcl", "subreddit_id": "t5_33j1o"}, {"author": "CrashingFirefly", "body": "Although you probably are looking for what has already been mentioned in the comments ([eatthismuch.com](https://eatthismuch.com)), you might also want to have a look at this website: [https://nutritiondata.self.com/tools/nutrient-search](https://nutritiondata.self.com/tools/nutrient-search). The website provides a set of different tools, but the one I linked here can be used for finding foods high in a specific macro- or micronutrient and low in another. I think it is particularly useful for those looking to fill certain micronutrient requirements, but are on a deficit and want to keep calories low.", "created_utc": "1646767230.0", "edited": "False", "id": "hzviz2r", "is_submitter": "False", "link_id": "t3_t9h0o0", "parent_id": "t3_t9h0o0", "score": "3", "subreddit": "MacroFactor", "subreddit_id": "t5_4acm3h"}, {"author": "CrashingFirefly", "body": "My most recent workouts (I have also programmed weighted bodyweight exercises as T2's):\n\n* Squat: 60 kg x 10\n* Bench: 60 kg x 10\n* OHP: 35 kg x 8\n* Deadlift: 85 kg x 8\n* Chin-up: +3,75 kg x 10\n* Dip: +13,75 kg x 8\n\nSo far, I'm not getting stuck, but I suspect that I will stall once I start cutting. What would you suggest? :)", "created_utc": "1646738638.0", "edited": "False", "id": "hztpr1q", "is_submitter": "False", "link_id": "t3_t7t8my", "parent_id": "t1_hzmoesx", "score": "1", "subreddit": "gzcl", "subreddit_id": "t5_33j1o"}, {"author": "CrashingFirefly", "body": "Cheers, thanks for providing that background! \n\nWhat you're saying makes a lot of sense. Don't change a working plan, I guess. Would it make sense to cut down on T3 exercises focused on bodybuilding (instead of prehab)?", "created_utc": "1646667822.0", "edited": "False", "id": "hzpq6wj", "is_submitter": "False", "link_id": "t3_t7t8my", "parent_id": "t1_hzmv954", "score": "1", "subreddit": "gzcl", "subreddit_id": "t5_33j1o"}, {"author": "CrashingFirefly", "body": "Will do!", "created_utc": "1646667694.0", "edited": "False", "id": "hzppvrj", "is_submitter": "False", "link_id": "t3_t7t8my", "parent_id": "t1_hzned4e", "score": "1", "subreddit": "gzcl", "subreddit_id": "t5_33j1o"}, {"author": "CrashingFirefly", "body": "Yes, I did already do some resets, so I'm not sure how much would be left on the table by switching. Another reason for me to switch would be to gain experience with another type of program, and a different selection of exercises (although the vanilla program could also be adapted, of course).", "created_utc": "1646572216.0", "edited": "False", "id": "hzklwp9", "is_submitter": "False", "link_id": "t3_t7t8my", "parent_id": "t1_hzkjxkg", "score": "1", "subreddit": "gzcl", "subreddit_id": "t5_33j1o"}, {"author": "CrashingFirefly", "body": "I'm planning to start a cutting phase next month, and I'm considering switching to the Rippler program, as it seems to be geared towards training in a deficit. The last half year or so, I have run GZCLP (both in surplus and deficit). My lift numbers are still quite low (S/B/D/O = 77.5/75/125/45 kg's), so I was wondering whether I should stick to a linear periodization program and see whether I could get those numbers up, or would do better with the Rippler. What would you do? Thanks for the input! :)", "created_utc": "1646569148.0", "edited": "False", "id": "hzkhfw5", "is_submitter": "False", "link_id": "t3_t7t8my", "parent_id": "t3_t7t8my", "score": "3", "subreddit": "gzcl", "subreddit_id": "t5_33j1o"}, {"author": "CrashingFirefly", "body": "Glad to hear it is already going to be included! Also, it is much appreciated that you, the developers, take the time to respond to the questions in this subreddit.", "created_utc": "1642697574.0", "edited": "False", "id": "hth8kba", "is_submitter": "True", "link_id": "t3_s8e3cb", "parent_id": "t1_hth1db6", "score": "2", "subreddit": "MacroFactor", "subreddit_id": "t5_4acm3h"}, {"author": "CrashingFirefly", "body": "Ah, pois, isso faz sentido! Obrigado pela explicação :)", "created_utc": "1639765711.0", "edited": "False", "id": "hoy70op", "is_submitter": "True", "link_id": "t3_rhb7jz", "parent_id": "t1_hoxwpw3", "score": "1", "subreddit": "WriteStreakPT", "subreddit_id": "t5_2gdmbs"}, {"author": "CrashingFirefly", "body": "Obrigado por corrigires o meu texto! :)\n\n>Espero que o Lagos esteja uma beca mais viva no inverno, também.\n\nPorque é que 'viva' em vez de 'vivo'? Visto que 'Lagos' não tem um genro. Obrigado!", "created_utc": "1639735548.0", "edited": "False", "id": "howf8rf", "is_submitter": "True", "link_id": "t3_rhb7jz", "parent_id": "t1_hou4i3r", "score": "1", "subreddit": "WriteStreakPT", "subreddit_id": "t5_2gdmbs"}, {"author": "CrashingFirefly", "body": "Muito obrigado pelas todas as correções, Dani! \n\n>No entanto, a rececionista disse-me que tinha de tirar um número.\n\nPorque é que tenho de usar o imperfeito nesta frase? \n\nHaha, sim, e isso! E ainda não escrevi sobre a minha experiência nos correios...\n\nPois, pelo que ouvi, os portugueses também não são, de facto, grande fãs da Câmara. Mas acho que lidar com os funcionários da Câmara é um desafio em qualquer parte do mundo...", "created_utc": "1639734712.0", "edited": "False", "id": "howe6px", "is_submitter": "True", "link_id": "t3_rghf8i", "parent_id": "t1_hor6ymm", "score": "1", "subreddit": "WriteStreakPT", "subreddit_id": "t5_2gdmbs"}, {"author": "CrashingFirefly", "body": "Muito obrigado pelas todas as correções! É uma ajuda imensa :)", "created_utc": "1639733731.0", "edited": "False", "id": "howcxfr", "is_submitter": "True", "link_id": "t3_rfs4oi", "parent_id": "t1_hoo4wiz", "score": "1", "subreddit": "WriteStreakPT", "subreddit_id": "t5_2gdmbs"}, {"author": "CrashingFirefly", "body": "Obrigado por corrigires o texto! :)", "created_utc": "1639563722.0", "edited": "False", "id": "homnc4d", "is_submitter": "True", "link_id": "t3_rezzhd", "parent_id": "t3_rezzhd", "score": "1", "subreddit": "WriteStreakPT", "subreddit_id": "t5_2gdmbs"}, {"author": "CrashingFirefly", "body": "Obrigado pelas correções adicionais, Dani! :)", "created_utc": "1639563653.0", "edited": "False", "id": "homn969", "is_submitter": "True", "link_id": "t3_re7nzi", "parent_id": "t3_re7nzi", "score": "1", "subreddit": "WriteStreakPT", "subreddit_id": "t5_2gdmbs"}, {"author": "CrashingFirefly", "body": "Muito obrigado pelas correções! :) E para explicar a diferença entre a significação das palavras.", "created_utc": "1639563609.0", "edited": "False", "id": "homn791", "is_submitter": "True", "link_id": "t3_rdhflx", "parent_id": "t3_rdhflx", "score": "1", "subreddit": "WriteStreakPT", "subreddit_id": "t5_2gdmbs"}, {"author": "CrashingFirefly", "body": "Ótimo, fico feliz por ouvir isso! Muito obrigado pela ajuda :)", "created_utc": "1639563204.0", "edited": "False", "id": "hommq4y", "is_submitter": "True", "link_id": "t3_re7nzi", "parent_id": "t1_hod722d", "score": "1", "subreddit": "WriteStreakPT", "subreddit_id": "t5_2gdmbs"}, {"author": "CrashingFirefly", "body": "Muito obrigado pela ajuda, Dani! :)", "created_utc": "1639253309.0", "edited": "False", "id": "ho5rqev", "is_submitter": "True", "link_id": "t3_rbva0b", "parent_id": "t1_hntyiu9", "score": "1", "subreddit": "WriteStreakPT", "subreddit_id": "t5_2gdmbs"}, {"author": "CrashingFirefly", "body": "Muito obrigado pelas correções! :)", "created_utc": "1638916127.0", "edited": "False", "id": "hnnbux7", "is_submitter": "True", "link_id": "t3_r9rhdy", "parent_id": "t1_hnippdb", "score": "1", "subreddit": "WriteStreakPT", "subreddit_id": "t5_2gdmbs"}, {"author": "CrashingFirefly", "body": "Obrigado por corrigires o meu texto! :)\n\nE também obrigado por me dares outra recomendação. Mencionei o livro a essa amiga, e ela também é grande fã! Parece-me que hei-de ler.", "created_utc": "1638916104.0", "edited": "False", "id": "hnnbt3l", "is_submitter": "True", "link_id": "t3_r90wge", "parent_id": "t1_hnd72d0", "score": "1", "subreddit": "WriteStreakPT", "subreddit_id": "t5_2gdmbs"}, {"author": "CrashingFirefly", "body": "Obrigado pelas correções! E também para as recomendações gastronómicas ;)\n\nCom 'pão amanhecido', queria dizer 'stale bread'. Como poderia dizer isso?", "created_utc": "1638916028.0", "edited": "1638916999.0", "id": "hnnbmzi", "is_submitter": "True", "link_id": "t3_rajpgk", "parent_id": "t1_hnmcz7f", "score": "1", "subreddit": "WriteStreakPT", "subreddit_id": "t5_2gdmbs"}, {"author": "CrashingFirefly", "body": "Obrigado por corrigires o meu texto! :)", "created_utc": "1638657195.0", "edited": "False", "id": "hn8zqag", "is_submitter": "True", "link_id": "t3_r88mus", "parent_id": "t1_hn7yv38", "score": "1", "subreddit": "WriteStreakPT", "subreddit_id": "t5_2gdmbs"}, {"author": "CrashingFirefly", "body": "Obrigado pelas correções! :)", "created_utc": "1638657131.0", "edited": "False", "id": "hn8zktp", "is_submitter": "True", "link_id": "t3_r7k85p", "parent_id": "t1_hn36xi2", "score": "1", "subreddit": "WriteStreakPT", "subreddit_id": "t5_2gdmbs"}, {"author": "CrashingFirefly", "body": "Obrigado pelas correções, Dani! :)", "created_utc": "1638526319.0", "edited": "False", "id": "hn1v9qn", "is_submitter": "True", "link_id": "t3_r6nku5", "parent_id": "t3_r6nku5", "score": "1", "subreddit": "WriteStreakPT", "subreddit_id": "t5_2gdmbs"}, {"author": "CrashingFirefly", "body": "Obrigado pelas correções! :)\n\n>É uma discussão que se faz por vezes em Portugal a respeito da guerra colonial, especialmente do lado da esquerda, mas ainda é talvez tudo demasiado recente. E a verdade é que se em muitas ocasiões Portugal não respeitou as leis da guerra, do outro lado muito menos.  \n>  \n>Houve também alguma importação de comportamentos vindos dos Estados Unidos, mas muito timidamente. O caso mais mediático foi o vandalismo de uma estátua do Padre António Vieira, que é das personagens menos merecedoras de «cancelamento». Se falarmos por exemplo de Vasco de Gama, cujas atrocidades chocaram mesmo os seus contemporâneos...\n\nSim, bem observado! Não sou a favor do 'cancelamento' de qualquer maneira; acho que não devemos guardar ressentimentos por todas as coisas que os nossos antepassados fizeram, mas às vezes é simplesmente preciso de dar a mão à palmatória. Isso é o que gosto sobre deste filme que mencionei: mostra perfeitamente como jovens 'normais' tornam-se capazes de cometer crimes de guerra, dado certas circunstândias. Também é um tema na série \"Glória\".\n\nAqui na Angra temos uma estátua do senhor Gama que só foi instalada lá em (volta de) 2015 - parece que a cultura de cancelamento [?] ainda não chegou aos Açores.\n\nJá agora, isso é um bom tema para outro WriteStreak, obrigado!", "created_utc": "1638525982.0", "edited": "False", "id": "hn1uvk0", "is_submitter": "True", "link_id": "t3_r5znav", "parent_id": "t1_hmu0jpn", "score": "1", "subreddit": "WriteStreakPT", "subreddit_id": "t5_2gdmbs"}, {"author": "CrashingFirefly", "body": "Obrigado pelas correções! :)", "created_utc": "1638312602.0", "edited": "False", "id": "hmq12d9", "is_submitter": "True", "link_id": "t3_r3n568", "parent_id": "t1_hmjfcxw", "score": "1", "subreddit": "WriteStreakPT", "subreddit_id": "t5_2gdmbs"}, {"author": "CrashingFirefly", "body": "Obrigado por corrigires o meu texto! :)\n\n>Não podia estar menos de acordo. Só de ler o teu texto fiquei com ansiedade 😅 Mas ainda bem que não somos todos iguais.\n\nExatamente! No entanto, na minha experiência, aprender uma língua também ajudou sentir-me mais confortável falar com desconhecidos.", "created_utc": "1638312583.0", "edited": "False", "id": "hmq10od", "is_submitter": "True", "link_id": "t3_r4g4p2", "parent_id": "t1_hmpsqh1", "score": "1", "subreddit": "WriteStreakPT", "subreddit_id": "t5_2gdmbs"}, {"author": "CrashingFirefly", "body": "Muito obrigado pelas correções! :)", "created_utc": "1638312461.0", "edited": "False", "id": "hmq0q0w", "is_submitter": "True", "link_id": "t3_r58a10", "parent_id": "t1_hmpxbe8", "score": "1", "subreddit": "WriteStreakPT", "subreddit_id": "t5_2gdmbs"}, {"author": "CrashingFirefly", "body": "Obrigado por me corrigires! :)", "created_utc": "1638041312.0", "edited": "False", "id": "hmb3ixz", "is_submitter": "True", "link_id": "t3_r2vzbj", "parent_id": "t1_hm9o7ee", "score": "1", "subreddit": "WriteStreakPT", "subreddit_id": "t5_2gdmbs"}, {"author": "CrashingFirefly", "body": "I think it would be fine as long as you can complete the 3x15+ reps (which is quite high for pull-ups). If you can handle a high rep range for the pull-up, you should be good to go!", "created_utc": "1638014798.0", "edited": "False", "id": "hm9ljsg", "is_submitter": "False", "link_id": "t3_r37ucr", "parent_id": "t1_hm9dd7h", "score": "1", "subreddit": "gzcl", "subreddit_id": "t5_33j1o"}, {"author": "CrashingFirefly", "body": "Obrigado pelas correções! :)", "created_utc": "1637962108.0", "edited": "False", "id": "hm76mfq", "is_submitter": "True", "link_id": "t3_r25q45", "parent_id": "t1_hm6rjuo", "score": "2", "subreddit": "WriteStreakPT", "subreddit_id": "t5_2gdmbs"}, {"author": "CrashingFirefly", "body": ">Het is eindelijk zover, het weekend is ~~pas begonnen~~ aangebroken!\n\nIk begrijp wat je wil zeggen met 'pas begonnen' (n.m. zojuist, korte tijd geleden), maar in deze zin werkt dat niet (al vind ik het moeilijk er de vinger op te leggen *waarom*). Mijn suggestie is het woord 'aanbreken':\n\n* Voorbeeld: De insecten zoemen overal rond; de lente is duidelijk **aangebroken**!\n* Maar ook: Het afwasmiddel was op, dus ik heb een nieuwe fles **aangebroken**.\n\n>... zodat ik nog geen pauze ~~maak~~ **neem**.  \n>  \n>Ik vond ze allebei / *beide* interessant.  \n>  \n> Ik zal (gauw) *binnenkort* graag over de cursus economische geschiedenis schrijven, (want) ik hou ervan en ~~hij~~ **het** helpt me bij het verbeteren van mijn kennis van / *over* de   \nwereld.\n\nGoed gedaan! :)", "created_utc": "1637948501.0", "edited": "False", "id": "hm6d6l6", "is_submitter": "False", "link_id": "t3_r2q8yf", "parent_id": "t3_r2q8yf", "score": "2", "subreddit": "WriteStreakNL", "subreddit_id": "t5_3g5eo9"}, {"author": "CrashingFirefly", "body": "The weather forecast is, quite frankly, completely useless - the weather is way too fickle. If you're looking to escape the UK winter, I could think of better destinations! ;) Some days the weather might be perfectly fine for hiking, but you could be unlucky and have a week of rain making hiking nearly impossible (or at least unsafe). So, I'd you suggest you postpone your trip to spring, to make sure you can actually enjoy the islands! :) Also, if you're into hiking, make sure to include Pico in your itinerary; you'd love it. Good luck!", "created_utc": "1637930533.0", "edited": "False", "id": "hm5dk05", "is_submitter": "False", "link_id": "t3_r2hjdn", "parent_id": "t3_r2hjdn", "score": "5", "subreddit": "azores", "subreddit_id": "t5_2solj"}, {"author": "CrashingFirefly", "body": "Ena, soa bem! Então provavelmente não há falta de lombo de bacalhau e azeite haha. Tens vivido no Luxemburgo, ou estás lá neste momento?", "created_utc": "1637872376.0", "edited": "False", "id": "hm2q9pw", "is_submitter": "True", "link_id": "t3_r1gz48", "parent_id": "t1_hm0pvwc", "score": "1", "subreddit": "WriteStreakPT", "subreddit_id": "t5_2gdmbs"}, {"author": "CrashingFirefly", "body": "Perfeito, obrigado!", "created_utc": "1637849394.0", "edited": "False", "id": "hm1a30j", "is_submitter": "True", "link_id": "t3_r0ipv7", "parent_id": "t1_hm192cm", "score": "1", "subreddit": "WriteStreakPT", "subreddit_id": "t5_2gdmbs"}, {"author": "CrashingFirefly", "body": "Sim, tens razão! No entanto, provavelmente há opções nos Países Baixos também que simplesmente desconheço. No podcast 'Portugueses no Mundo', há sempre muita gente que mora na Holanda. Felizmente, todas as lojas turcas também vendem tremoços! :)", "created_utc": "1637834887.0", "edited": "False", "id": "hm0pjci", "is_submitter": "True", "link_id": "t3_r1gz48", "parent_id": "t1_hm06jax", "score": "2", "subreddit": "WriteStreakPT", "subreddit_id": "t5_2gdmbs"}, {"author": "CrashingFirefly", "body": "Obrigado pelas correções! :)", "created_utc": "1637834686.0", "edited": "False", "id": "hm0pame", "is_submitter": "True", "link_id": "t3_r1gz48", "parent_id": "t1_hlywe5f", "score": "2", "subreddit": "WriteStreakPT", "subreddit_id": "t5_2gdmbs"}, {"author": "CrashingFirefly", "body": "Obrigado pelas correções! :)\n\nEntão, **salteados** refere a pratos asiáticos, ou pode ser qualquer cozinha?", "created_utc": "1637793126.0", "edited": "False", "id": "hlyk396", "is_submitter": "True", "link_id": "t3_r0ipv7", "parent_id": "t1_hlwenk0", "score": "1", "subreddit": "WriteStreakPT", "subreddit_id": "t5_2gdmbs"}, {"author": "CrashingFirefly", "body": "Fico feliz por ouvir que há cá mais apreciadores de tofu! :) E claro que não tens de desculpar, é sempre fixe interagir com uns outros aqui!", "created_utc": "1637793044.0", "edited": "False", "id": "hlyjwey", "is_submitter": "True", "link_id": "t3_r0ipv7", "parent_id": "t1_hltkekb", "score": "1", "subreddit": "WriteStreakPT", "subreddit_id": "t5_2gdmbs"}, {"author": "CrashingFirefly", "body": "Muito obrigado pelas correções! :D", "created_utc": "1637694518.0", "edited": "False", "id": "hlswyki", "is_submitter": "True", "link_id": "t3_qzyx9r", "parent_id": "t1_hlssekl", "score": "1", "subreddit": "WriteStreakPT", "subreddit_id": "t5_2gdmbs"}, {"author": "CrashingFirefly", "body": "Muito obrigado pelas correções, Dani! São bastantes erros; tomo nota deles!", "created_utc": "1637623037.0", "edited": "False", "id": "hlp8ehq", "is_submitter": "True", "link_id": "t3_qz6fx7", "parent_id": "t1_hlosdcs", "score": "1", "subreddit": "WriteStreakPT", "subreddit_id": "t5_2gdmbs"}, {"author": "CrashingFirefly", "body": "Obrigado pelas correções! :)", "created_utc": "1637534612.0", "edited": "False", "id": "hlkg6nc", "is_submitter": "True", "link_id": "t3_qyh2hm", "parent_id": "t1_hliklmg", "score": "1", "subreddit": "WriteStreakPT", "subreddit_id": "t5_2gdmbs"}, {"author": "CrashingFirefly", "body": "Whatever app you're going to use, at some point you will be led to some off-track road, so be prepared! ;) I mainly use Google Maps and [MAPS.ME](https://MAPS.ME). Enjoy your stay!", "created_utc": "1637449302.0", "edited": "False", "id": "hlfwp84", "is_submitter": "False", "link_id": "t3_qyc0ui", "parent_id": "t3_qyc0ui", "score": "3", "subreddit": "azores", "subreddit_id": "t5_2solj"}, {"author": "CrashingFirefly", "body": "Obrigado pelas correções adicionais!\n\n>Da minha parte, tem sido com muito gosto. É muito compensador ver-vos a melhorar de dia para dia 😊\n\nFico muito feliz a ouvir isso 😀", "created_utc": "1637447826.0", "edited": "False", "id": "hlfthmo", "is_submitter": "True", "link_id": "t3_qxqtbo", "parent_id": "t1_hle3m4n", "score": "1", "subreddit": "WriteStreakPT", "subreddit_id": "t5_2gdmbs"}, {"author": "CrashingFirefly", "body": "Muito obrigado pelas correções e as explicações adicionais! \n\n>... ou, mais realisticamente, «desperdicem tempo a» :p\n\nPois, deixo isso ao teu julgamento ;) Mas ficas a saber que a ajuda é muito valorizada!", "created_utc": "1637447703.0", "edited": "False", "id": "hlft7sb", "is_submitter": "True", "link_id": "t3_qxqtbo", "parent_id": "t1_hlc50yx", "score": "1", "subreddit": "WriteStreakPT", "subreddit_id": "t5_2gdmbs"}, {"author": "CrashingFirefly", "body": "Obrigado pelas correções! :)\n\n>Vivi uns anos em Utrecht; a piada que conheço (se bem me lembra) é que quando alguém se muda do sul da Holanda para a Bélgica, o QI médio dos dois países aumenta.\n\nHaha, sim, isso é geralmente o teor destas piadas! Então, provavelmente observaste que há muitas piadas das pessoas do norto do país sobre as pessoas do sul (ou: debaixo dos rios).", "created_utc": "1637322230.0", "edited": "False", "id": "hl8sjj8", "is_submitter": "True", "link_id": "t3_qwz5gg", "parent_id": "t1_hl6qpel", "score": "1", "subreddit": "WriteStreakPT", "subreddit_id": "t5_2gdmbs"}, {"author": "CrashingFirefly", "body": "Muito obrigado por me corrigires! :)", "created_utc": "1637268272.0", "edited": "False", "id": "hl612is", "is_submitter": "True", "link_id": "t3_qwa9fb", "parent_id": "t1_hl3h4cw", "score": "1", "subreddit": "WriteStreakPT", "subreddit_id": "t5_2gdmbs"}, {"author": "CrashingFirefly", "body": "Pois, isso é mesmo espetacular! Eu só pergunto-me por que razão eles escolhem um certo país ou lugar... Quer dizer, Angra do Heroísmo não tem uma comunidade chinesa extensiva (pelo que sei). E sim, estas lojas têm mesmo um vibe 'Action', mas ainda mais atabalhoado haha!", "created_utc": "1637268253.0", "edited": "False", "id": "hl610vq", "is_submitter": "True", "link_id": "t3_qwa9fb", "parent_id": "t1_hl3ulyc", "score": "1", "subreddit": "WriteStreakPT", "subreddit_id": "t5_2gdmbs"}, {"author": "CrashingFirefly", "body": "Perfeito, obrigadíssimo! :)", "created_utc": "1637268057.0", "edited": "False", "id": "hl60izo", "is_submitter": "True", "link_id": "t3_qvjpa0", "parent_id": "t1_hl3pwk2", "score": "1", "subreddit": "WriteStreakPT", "subreddit_id": "t5_2gdmbs"}, {"author": "CrashingFirefly", "body": "Muito obrigado pela ajuda! :)\n\nSó uma coisa: Por que é que deve ser 'todas as coisas se tornam' em vez de 'todas as coisas tornam-se'? Nesta frase, qual é a palavra que é 'responsável' por esta troca? Obrigado!", "created_utc": "1637187034.0", "edited": "False", "id": "hl1l4kr", "is_submitter": "True", "link_id": "t3_qvjpa0", "parent_id": "t1_hkxfoct", "score": "1", "subreddit": "WriteStreakPT", "subreddit_id": "t5_2gdmbs"}, {"author": "CrashingFirefly", "body": "Obrigado por tomares o tempo para explicar! :) Estou a ver; com estas coisas a ênfase é muito importante...", "created_utc": "1637101283.0", "edited": "False", "id": "hkwt7e2", "is_submitter": "True", "link_id": "t3_qu1oyk", "parent_id": "t1_hku5bxe", "score": "1", "subreddit": "WriteStreakPT", "subreddit_id": "t5_2gdmbs"}, {"author": "CrashingFirefly", "body": "Obrigado por me corrigires! :)", "created_utc": "1637101121.0", "edited": "False", "id": "hkwsstc", "is_submitter": "True", "link_id": "t3_quspp4", "parent_id": "t1_hkul7xb", "score": "1", "subreddit": "WriteStreakPT", "subreddit_id": "t5_2gdmbs"}, {"author": "CrashingFirefly", "body": "Obrigado pela adição! :)", "created_utc": "1637055790.0", "edited": "False", "id": "hku3coc", "is_submitter": "True", "link_id": "t3_qu1oyk", "parent_id": "t1_hkpiy6n", "score": "1", "subreddit": "WriteStreakPT", "subreddit_id": "t5_2gdmbs"}, {"author": "CrashingFirefly", "body": "Obrigado por todas as correções! :)\n\nNo entanto, não percebo o que queres dizer nesta frase:\n\n>(1) Sem topicalização, *podem* tem também aqui de passar para o início.", "created_utc": "1637055770.0", "edited": "False", "id": "hku3bxl", "is_submitter": "True", "link_id": "t3_qu1oyk", "parent_id": "t1_hkpds4s", "score": "1", "subreddit": "WriteStreakPT", "subreddit_id": "t5_2gdmbs"}, {"author": "CrashingFirefly", "body": "Hey, não te queria faltar ao respeito! :) O teu texto só me fiz pensar sobre este argumento que já ouvi várias vezes. Então, como respondes: tu não mencionaste uma dieta vegana no teu texto. Seja como for, acho que não é preciso de responderes assim tão defensiva - não estou a tentar insultar-te! ;)", "created_utc": "1637055679.0", "edited": "False", "id": "hku388i", "is_submitter": "False", "link_id": "t3_qujvor", "parent_id": "t1_hks8sg4", "score": "1", "subreddit": "WriteStreakPT", "subreddit_id": "t5_2gdmbs"}, {"author": "CrashingFirefly", "body": "Embora que acorde contigo que melhor seria descontinuar beber leite das vacas (ou qualquer animal não humano), não concordo completamente com a tua linha de raciocínio. Um argumento frequentemente avançado pelos veganos é que o consumo de produtos de origem animal é, em si próprio, nojento. A gelatina é, por exemplo, apresentada como um produto ‘sujo’, porque é feita de resíduos da suinicultura (orelhas, pele, etc.). E, assim sendo, não devíamos comer isto. Na minha opinião, isto é uma falácia de raciocínio, porque este argumento tenta apelar a um juízo de valor. Se uma pessoa não tiver problemas em consumir estes produtos - tendo em conta o processo de produção - o argumento desmoronaria completamente. Além disso, numa dieta vegana, também é possível consumir muitos produtos ‘nojentos’, como tempeh (feijão estragado) ou ‘stinky tofu’. Portanto, acho que é melhor apelar aos argumentos éticos para convencer pessoas. Fora isso, completamente compartilho a tua visão! :)", "created_utc": "1637016282.0", "edited": "False", "id": "hks2k18", "is_submitter": "False", "link_id": "t3_qujvor", "parent_id": "t3_qujvor", "score": "0", "subreddit": "WriteStreakPT", "subreddit_id": "t5_2gdmbs"}, {"author": "CrashingFirefly", "body": "Obrigado, Dani! :)", "created_utc": "1636930304.0", "edited": "False", "id": "hknd02p", "is_submitter": "True", "link_id": "t3_qt8qby", "parent_id": "t1_hkknox5", "score": "1", "subreddit": "WriteStreakPT", "subreddit_id": "t5_2gdmbs"}, {"author": "CrashingFirefly", "body": "Obrigado pelas correções! :)", "created_utc": "1636832997.0", "edited": "False", "id": "hkhrmg3", "is_submitter": "True", "link_id": "t3_qsk7e4", "parent_id": "t1_hkg7btz", "score": "1", "subreddit": "WriteStreakPT", "subreddit_id": "t5_2gdmbs"}, {"author": "CrashingFirefly", "body": "Bom tópico! Gostava de responder a ti, porque o meu autor ‘holandês’ é, de facto, um migrante iraniano. Ele chama-se Kader Abdollah e fugiu aos Países Baixos em 1988 por causa da situação política na Irão. Kader Abdollah não é o nome verdadeiro dele. É um pseudónimo composto pelos nomes de dois amigos falecidos. A sua obra mais famosa, e provavelmente o meu livro preferido, é A Casa da Mesquita (‘Het Huis van de Moskee’). O livro trata das mudanças radicais que ocorriam durante o período em que o xã do Irão deixou o país e a monarquia foi substituído por um estado islâmico, liderado pelo Khomeini. Abdollah mostra aos leitores como as pessoas comuns lidam com estas mudanças difíceis. O livro também nos ajuda entender quão complexo a situação no Irão é e que, além do que ouvimos na média sobre este país, existe um povo que não é tão diferente de nós. Esta obra foi nomeada pelos leitores holandeses com o segundo melhor livro da nossa literatura. Além de ser um escritor espetacular, gosto muito da ideia que uma pessoa pode ser capaz de escrever obras literárias numa língua não materna. No entanto, acho melhor se eu ainda não tentasse escrever livros portugueses.", "created_utc": "1636749195.0", "edited": "False", "id": "hkdjppb", "is_submitter": "False", "link_id": "t3_qs7cpd", "parent_id": "t3_qs7cpd", "score": "2", "subreddit": "WriteStreakPT", "subreddit_id": "t5_2gdmbs"}, {"author": "CrashingFirefly", "body": "Obrigado pelas correções e por me dares as explicações! :)", "created_utc": "1636622642.0", "edited": "False", "id": "hk6mnxs", "is_submitter": "True", "link_id": "t3_qq7o7e", "parent_id": "t1_hk5050p", "score": "1", "subreddit": "WriteStreakPT", "subreddit_id": "t5_2gdmbs"}, {"author": "CrashingFirefly", "body": "Muito obrigado por me corrigires! :)", "created_utc": "1636622204.0", "edited": "False", "id": "hk6m669", "is_submitter": "True", "link_id": "t3_qr48wt", "parent_id": "t1_hk549zb", "score": "1", "subreddit": "WriteStreakPT", "subreddit_id": "t5_2gdmbs"}, {"author": "CrashingFirefly", "body": "Muito obrigado! :)", "created_utc": "1636497450.0", "edited": "False", "id": "hjzths6", "is_submitter": "True", "link_id": "t3_qpoel0", "parent_id": "t1_hjyek2y", "score": "1", "subreddit": "WriteStreakPT", "subreddit_id": "t5_2gdmbs"}, {"author": "CrashingFirefly", "body": "Muito obrigado por corrigires o meu texto! :)\n\n>Vejo muito esta crítica por parte de estrangeiros em Portugal; a mim   \ntoda esta antecipação do Natal só me causa ansiedade ao lembrar-me de   \nque tenho de começar a fazer as compras de Natal — creio que isso é pelo  \n menos parte do objetivo.\n\nHaha, sem dúvida isto é o propósito! Não é uma crítica de Portugal; é igual na Holanda. É só que, para mim, as festas se desvalorizam quando espelharmos por dois meses...", "created_utc": "1636364156.0", "edited": "False", "id": "hjsb1pu", "is_submitter": "True", "link_id": "t3_qoz835", "parent_id": "t1_hjqo8gq", "score": "1", "subreddit": "WriteStreakPT", "subreddit_id": "t5_2gdmbs"}, {"author": "CrashingFirefly", "body": "We've never been asked for an international driving license; they didn't check if we had a license at all. In regards to the credit card: You will probably need this because the rental agency wants to freeze the deposit (which is not possible with a debit card).", "created_utc": "1635505565.0", "edited": "False", "id": "hihxw0k", "is_submitter": "False", "link_id": "t3_qi98xf", "parent_id": "t3_qi98xf", "score": "5", "subreddit": "azores", "subreddit_id": "t5_2solj"}, {"author": "CrashingFirefly", "body": "Haha, nada de mal! :) Passeava pelos Açores, o que provavelmente vai ser o tópico dos meus textos nos dias que vêm", "created_utc": "1635430063.0", "edited": "False", "id": "hidrxek", "is_submitter": "True", "link_id": "t3_q9ge0w", "parent_id": "t1_hidlst6", "score": "1", "subreddit": "WriteStreakPT", "subreddit_id": "t5_2gdmbs"}, {"author": "CrashingFirefly", "body": "Last 1,5 weeks I was on holiday, so I didn't train. When starting again, what weights should I use after this brief intermezzo? Do you prefer to use the same weights you used last time, use slightly lighter weights or follow the GZCL reset protocol? Thanks! :)", "created_utc": "1635428714.0", "edited": "False", "id": "hidovoy", "is_submitter": "False", "link_id": "t3_qhgb6d", "parent_id": "t3_qhgb6d", "score": "1", "subreddit": "gzcl", "subreddit_id": "t5_33j1o"}, {"author": "CrashingFirefly", "body": "Obrigado pelas correções e explicações! :)", "created_utc": "1635418858.0", "edited": "False", "id": "hid72v1", "is_submitter": "True", "link_id": "t3_qaiei5", "parent_id": "t1_hhc2fxz", "score": "1", "subreddit": "WriteStreakPT", "subreddit_id": "t5_2gdmbs"}, {"author": "CrashingFirefly", "body": "Obrigado por me corrigires! :)", "created_utc": "1635418827.0", "edited": "False", "id": "hid719v", "is_submitter": "True", "link_id": "t3_qa879n", "parent_id": "t1_hh7az7y", "score": "1", "subreddit": "WriteStreakPT", "subreddit_id": "t5_2gdmbs"}, {"author": "CrashingFirefly", "body": "Muito obrigado pelas correções! :) Desculpe por não ter agradecido mais cedo; estava fora e não usava o Reddit.", "created_utc": "1635418795.0", "edited": "False", "id": "hid6zq7", "is_submitter": "True", "link_id": "t3_q9ge0w", "parent_id": "t1_hh5mev7", "score": "2", "subreddit": "WriteStreakPT", "subreddit_id": "t5_2gdmbs"}, {"author": "CrashingFirefly", "body": "Obrigado pela ajuda! :)", "created_utc": "1634543571.0", "edited": "False", "id": "hh32e6z", "is_submitter": "True", "link_id": "t3_q8kgu6", "parent_id": "t1_hh078ce", "score": "1", "subreddit": "WriteStreakPT", "subreddit_id": "t5_2gdmbs"}, {"author": "CrashingFirefly", "body": "Obrigado pelas correções! :)\n\n>A conveniência é imensa mas retenho muito mais do que leio se tiver o objeto físico na minha mão.\n\nLá isso também é verdade! Além disso, uma estante cheia de livros é uma boa vista no quarto.", "created_utc": "1634543507.0", "edited": "False", "id": "hh32bm4", "is_submitter": "True", "link_id": "t3_q7w10k", "parent_id": "t1_hgzijql", "score": "1", "subreddit": "WriteStreakPT", "subreddit_id": "t5_2gdmbs"}, {"author": "CrashingFirefly", "body": "Muito obrigado pelas correções, Dani! :)", "created_utc": "1634404920.0", "edited": "False", "id": "hgvqg1u", "is_submitter": "True", "link_id": "t3_q7dl71", "parent_id": "t1_hgmvlyi", "score": "1", "subreddit": "WriteStreakPT", "subreddit_id": "t5_2gdmbs"}, {"author": "CrashingFirefly", "body": "[Video](https://streamable.com/03bfgm) \\- Bench press 3 x 55 kg (121 lbs). \n\nThe bench press is the lift I seem to struggle with the most (in regards to form). Before I got pain in the shoulders and decided to take it easy with the bench press, although I'm not sure if the bench was causing the pain.\n\nAny tips? If the angle of the video is not right, please let me know as well, so I'll try to take it from another perspective next time. Thanks!", "created_utc": "1634297303.0", "edited": "False", "id": "hgq5qq4", "is_submitter": "False", "link_id": "t3_q8i0pl", "parent_id": "t3_q8i0pl", "score": "1", "subreddit": "gzcl", "subreddit_id": "t5_33j1o"}, {"author": "CrashingFirefly", "body": "Obrigado pela ajuda! :)", "created_utc": "1634221229.0", "edited": "False", "id": "hgm43fh", "is_submitter": "True", "link_id": "t3_q6hgf4", "parent_id": "t1_hglmkif", "score": "1", "subreddit": "WriteStreakPT", "subreddit_id": "t5_2gdmbs"}, {"author": "CrashingFirefly", "body": ">Ik zou ook het oude Griekenland en ~~de~~ **het** oude Egypte graag willen bezoeken.\n\n>Het zou ook interessant zijn om de Nederlanden / *het Nederland* van het verleden / *vroeger* te bezoeken.\n\n'de Nederlanden' is niet onjuist, maar je verwijst dan naar de regio die ook België, Luxemburg en delen van Frankrijk omvat (https://nl.wikipedia.org/wiki/Nederlanden). \n\n>Dorestad lijkt **mij** heel interessant en *fascineert me*.\n\n>De Gouden Eeuw lijkt me ook interessant omdat men zegt dat ~~hij~~ *het* één van de beste perioden van de Nederlandse geschiedenis is.\n\nHier zou ik mee oppassen: Tegenwoordig wordt er door velen vrij kritisch naar deze periode gekeken, vanwege wat er in de Nederlandse koloniën gebeurde (uitbuiting, slavernij, etc.). Desalniettemin wel een hele interessante periode inderdaad! :)\n\nGoede tekst, ga zo door!", "created_utc": "1634143279.0", "edited": "False", "id": "hgi2nvx", "is_submitter": "False", "link_id": "t3_q7a1n8", "parent_id": "t3_q7a1n8", "score": "2", "subreddit": "WriteStreakNL", "subreddit_id": "t5_3g5eo9"}, {"author": "CrashingFirefly", "body": "Muito obrigado pelas correções e sugestões! :)\n\n>Como que raio é que o deixaste fugir, o seu papalvo! [Soa a frase de uma personagem do Tintin 😂]\n\nLol, é bom saber! Com as palavras menos comum é sempre díficil de entender em que situações as podemos utilizar.", "created_utc": "1634057800.0", "edited": "False", "id": "hgdhjgq", "is_submitter": "True", "link_id": "t3_q5b6pc", "parent_id": "t1_hgbvgih", "score": "1", "subreddit": "WriteStreakPT", "subreddit_id": "t5_2gdmbs"}, {"author": "CrashingFirefly", "body": "Muito obrigado pelas correções! :)\n\n>Sempre quis visitar os Açores, espero que se divirtam!\n\nObrigado, sem dúvida! :D", "created_utc": "1634057379.0", "edited": "False", "id": "hgdgiym", "is_submitter": "True", "link_id": "t3_q5ver1", "parent_id": "t1_hgcoa45", "score": "1", "subreddit": "WriteStreakPT", "subreddit_id": "t5_2gdmbs"}, {"author": "CrashingFirefly", "body": ">Ze waren tamelijk goedkoop maar ~~uit~~ **van** goede kwaliteit.\n\n>Ik herinner me dat er een heleboel autootjes stond**en**.\n\n>Nu is de keuze kleiner / *beperkter* en **de** autootjes zijn helaas duurder geworden.\n\n> Ze stellen goede / *het zijn goede* herinneringen van mijn kind**er**tijd voor!\n\nGoed bezig! Blijf zo doorgaan.", "created_utc": "1633987480.0", "edited": "False", "id": "hg9zca4", "is_submitter": "False", "link_id": "t3_q4esq0", "parent_id": "t3_q4esq0", "score": "2", "subreddit": "WriteStreakNL", "subreddit_id": "t5_3g5eo9"}, {"author": "CrashingFirefly", "body": ">Kennen jullie deze ~~architecturale~~ **architectonisch** beweging?\n\n>De naam is al duidelijk: deze beweging gaat over (echte?) *kleine* huisjes die perfect zijn~~,~~ voor mensen die op zoek naar een minimalistische en simpele levensstijl zijn.\n\nHier is een komma niet nodig. \n\n>Die huisjes zijn *dan* wel klein, maar ze zien er modern en elegant uit.\n\n>Normaliter bestaan Tiny Houses uit hout of steen en ze worden vaak dicht bij de natuur gebouwd**,** maar er zijn ook Tiny Houses die in de stad staan.\n\nBij het gebruik van het woord 'maar' als tegenstelling kun je beter een komma gebruiken.\n\n>Persoonlijk denk ik dat deze huisjes interessant en ~~geldig~~ *een goed idee* (?) zijn.\n\n'geldig' betekent 'valid', maar ik denk dat je hier refereert naar het Engelse woord 'legitimate'. 'geldig' kan dus niet in een figuurlijke manier worden gebruikt, maar alleen letterlijk. Voorbeeld: 'Hij wilde een kortingscoupon inruilen, maar deze was niet meer geldig.'\n\n>Ik **ben geïnteresseerd in** een minimalistische levensstijl.\n\nWat je had opgeschreven is niet fout en kan prima worden gebruikt, maar dit alternatief klinkt allicht wat natuurlijker.\n\n\nLeuke tekst! :) En goed geschreven; ik haal alleen wat kleine dingetjes eruit. Let wel goed op het gebruik van komma's. \n\nIk ben zelf ook erg fan van deze beweging, al zal het idee van een Tiny House een stuk romantischer zijn dan de werkelijkheid. Ken je dit YouTube-kanaal al? https://www.youtube.com/c/ExploringAlternatives. Heel tof als je in zulke dingen geïnteresseerd bent!", "created_utc": "1633987332.0", "edited": "False", "id": "hg9z0sc", "is_submitter": "False", "link_id": "t3_q5r8lk", "parent_id": "t3_q5r8lk", "score": "2", "subreddit": "WriteStreakNL", "subreddit_id": "t5_3g5eo9"}, {"author": "CrashingFirefly", "body": "Muito obrigado por corrigires o meu texto!\n\n>O homem era parte das ‘SS’ e trabalhava no campo de concentração Sachenhausen\n\n'ser parte' não é uma expressão idiomática?\n\n>este homem tem sorte que o seu passado não tenha sido descoberto mais cedo.\n\nPorque é que tenho de usar o conjuntivo aqui? É por causa da palavra 'sorte'?\n\n>O livro trata da questão do mal. [Um livro trata de uma questão = debruça-se sobre uma questão]\n>\n>O assunto deste livro é fascinante. Trata-se da questão do mal. [Trata-se de = é]\n\nObrigado por explicares isto com mais pormenor! :)", "created_utc": "1633940476.0", "edited": "False", "id": "hg7ggox", "is_submitter": "True", "link_id": "t3_q40h7i", "parent_id": "t1_hg7e1ea", "score": "1", "subreddit": "WriteStreakPT", "subreddit_id": "t5_2gdmbs"}, {"author": "CrashingFirefly", "body": "Muito obrigado por corrigires o meu escrito! :)\n\n>Se fores a ver, todos os que atingiram FIRE continuam a ter alguma ocupação, remunerada ou não. A diferença é que vivem em vez de trabalharem.\n\nAh, tens razão, isso não é a mesma coisa. Viver em vez de trabalhar é, em geral, uma boa ideia.\n\n>trouwens, wist niet dat je Fries was. Mijn man ook!\n\nQue engraçado! Então, também estás a aprender holandês (ou até frísio)?", "created_utc": "1633883268.0", "edited": "False", "id": "hg4aqd1", "is_submitter": "True", "link_id": "t3_q4hlwf", "parent_id": "t1_hg39go0", "score": "1", "subreddit": "WriteStreakPT", "subreddit_id": "t5_2gdmbs"}, {"author": "CrashingFirefly", "body": "Obrigado! :)", "created_utc": "1633868282.0", "edited": "False", "id": "hg3gez9", "is_submitter": "True", "link_id": "t3_q55lf5", "parent_id": "t1_hg3ba0x", "score": "3", "subreddit": "Portuguese", "subreddit_id": "t5_2sqn7"}, {"author": "CrashingFirefly", "body": "Obrigado! :)", "created_utc": "1633858926.0", "edited": "False", "id": "hg34ge4", "is_submitter": "False", "link_id": "t3_q3vf0l", "parent_id": "t1_hfz6lub", "score": "1", "subreddit": "WriteStreakPT", "subreddit_id": "t5_2gdmbs"}, {"author": "CrashingFirefly", "body": "Boa sugestão! Só uma perguntinha: 'maratonar uma série' também se usa em português europeu?", "created_utc": "1633767426.0", "edited": "False", "id": "hfyjhwy", "is_submitter": "False", "link_id": "t3_q3vf0l", "parent_id": "t3_q3vf0l", "score": "3", "subreddit": "WriteStreakPT", "subreddit_id": "t5_2gdmbs"}, {"author": "CrashingFirefly", "body": "Muito obrigado pelas correções! :)", "created_utc": "1633708248.0", "edited": "False", "id": "hfv7nmi", "is_submitter": "True", "link_id": "t3_q34tg2", "parent_id": "t1_hfpr3zu", "score": "2", "subreddit": "WriteStreakPT", "subreddit_id": "t5_2gdmbs"}, {"author": "CrashingFirefly", "body": "Obrigado pelas correções!\n\nBoa dica sobre a maneira correta como me devia dirigir ao leitor :)", "created_utc": "1633539008.0", "edited": "False", "id": "hfmg5v9", "is_submitter": "True", "link_id": "t3_q2g1kx", "parent_id": "t1_hfm2m1b", "score": "1", "subreddit": "WriteStreakPT", "subreddit_id": "t5_2gdmbs"}, {"author": "CrashingFirefly", "body": "Obrigado por corrigires o meu texto! :)", "created_utc": "1633538551.0", "edited": "False", "id": "hfmf1ls", "is_submitter": "True", "link_id": "t3_q11d4l", "parent_id": "t1_hfkyvtj", "score": "1", "subreddit": "WriteStreakPT", "subreddit_id": "t5_2gdmbs"}, {"author": "CrashingFirefly", "body": "Maravilhoso, a tua explicação é muito clara, obrigado! :)", "created_utc": "1633419741.0", "edited": "False", "id": "hfgedfz", "is_submitter": "True", "link_id": "t3_pzrhgu", "parent_id": "t1_hfg84fz", "score": "1", "subreddit": "WriteStreakPT", "subreddit_id": "t5_2gdmbs"}, {"author": "CrashingFirefly", "body": "Muito obrigado pelas correções! :)\n\nSó uma perguntinha em relação a esta frase:\n\n>uma viagem de dois meses por Espanha e Portugal\n\nO país 'Espanha' é acompanhado por um artigo, certo? Porque é que não o devo usar neste contexto?", "created_utc": "1633384214.0", "edited": "False", "id": "hfeoacf", "is_submitter": "True", "link_id": "t3_pzrhgu", "parent_id": "t1_hfdurys", "score": "1", "subreddit": "WriteStreakPT", "subreddit_id": "t5_2gdmbs"}, {"author": "CrashingFirefly", "body": "Muito obrigado pela ajuda! :)", "created_utc": "1633346149.0", "edited": "False", "id": "hfc6m7d", "is_submitter": "True", "link_id": "t3_pz5hdc", "parent_id": "t1_hfbwzp1", "score": "1", "subreddit": "WriteStreakPT", "subreddit_id": "t5_2gdmbs"}, {"author": "CrashingFirefly", "body": "Obrigado pela ajuda! :)\n\n>Achei muita graça falares na bicicleta em segunda mão. Muito holandês da tua parte ;)\n\nHaha, pois, só fico aqui na ilha por uns meses e não vou levar uma bicicleta no avião. Então, não iria investir numa bicicleta boa, mas entendo que pode parecer forreta haha", "created_utc": "1633336777.0", "edited": "False", "id": "hfbvy48", "is_submitter": "True", "link_id": "t3_q0lpm9", "parent_id": "t1_hf9udko", "score": "1", "subreddit": "WriteStreakPT", "subreddit_id": "t5_2gdmbs"}, {"author": "CrashingFirefly", "body": "Boa ideia! Se abrisses este restaurante, deixa-nos saber. Acho que também podes acrescentar que sopa é, consoante os ingredientes, bastante saudável. O que gosto de sopa é que nos permite adicionar mais legumes na nossa dieta facilmente. Aqui em Portugal, sopa é uma parte incontornável da ementa. Diria que quase todos os restaurantes têm, pelo menos, uma sopa do dia no menu. Essa sopa também é feita amiúde a partir de legumes, o que dá jeito quando estiveres à procura de um prato vegetariano – o que pode ser bastante desafiante em Portugal às vezes. \n\nSe eu abrisse um restaurante, seria um restaurante de falafel. Falafel é uma das minhas comidas favoritas. No caso que não estejas familiarizado com estes bolinhos de prazer, hás-de experimentar! Hoje em dia, há muitos restaurantes espalhados por todo o mundo que vendem este salgadinho oriundo do Oriente médio. O ingrediente principal de falafel é grão-de-bico, o que é combinado com cebola, alho e vários temperos, como coentro e cominho. As vantagens que mencionaste acerca de sopa também aplicam a falafel: facil de fazer, barato e – o mais importante – super delicioso. Não é a toa que este prato se tornou tão popular mundialmente. Assim, também não é uma supresa que as origens de falafel são tópico de debate. Vários países, como o Egipto e Israel, alegam que são o criador de falafel. No entanto, o que mais importa é que todos podem aproveitar esta iguaria, seja quem for o criador.", "created_utc": "1633336012.0", "edited": "False", "id": "hfbv4dn", "is_submitter": "False", "link_id": "t3_q0odg4", "parent_id": "t3_q0odg4", "score": "2", "subreddit": "WriteStreakPT", "subreddit_id": "t5_2gdmbs"}, {"author": "CrashingFirefly", "body": "Obrigado pelas correções! :)\n\n>É uma série de jogos de estratégia (era uma tradução assim tão difícil?!)\n\nNão, não é tão difícil. No entanto, no holandês, nós normalmente mantemos o termo inglês. Eu sei que em português isto é menos comum, mas neste caso pensei que a palavra inglesa soaria mais natural. \n\n>construir uma aldeia (também pode ser uma vila mas começas por uma aldeia, não?)\n\nSim, começas por uma aldeia, qual crescerá durante o jogo. Assim, escolhi 'vila' para incluir quer aldeias, quer cidades (mas isto provavelmente não faz muito sentido).\n\n>e tomar nota das correções para não as continuar a repetir! Cof cof\n\nHum, olha, não é de propósito. Sempre passo por todas as correções e tento evitar os mesmos erros. Mesmo assim, ainda tenho muitas dificuldades em escolher o tempo verbal correto e gramática em geral. No que diz respeito à ortografia, tens razão. Isso é uma questão de consultar o dicionário. \n\nAprecio muito a tua ajuda - é incrível que pessoas tomam o tempo para ajudar desconhecidos com a aprendizagem de uma língua. Isso, porém, não dá motivo para ser rude comigo. Provavelmente não tens essa intenção, mas um comentário assim não me agrada. Eu vou ter mais cuidado com os meus textos aqui e, oxalá, faça menos erros no futuro. Obrigado!", "created_utc": "1633254785.0", "edited": "False", "id": "hf7htdc", "is_submitter": "True", "link_id": "t3_pyfiio", "parent_id": "t1_hf2s60p", "score": "2", "subreddit": "WriteStreakPT", "subreddit_id": "t5_2gdmbs"}, {"author": "CrashingFirefly", "body": "Obrigado por todas as correções! :) Muito útil. \n\nDirias que há uma diferença entre 'talvez' e 'se calhar' (no que toca à significação)? Ou 'talvez' simplesmente soa melhor? Obrigado!", "created_utc": "1633253044.0", "edited": "False", "id": "hf7fko0", "is_submitter": "True", "link_id": "t3_pxs78n", "parent_id": "t1_hf2pr3x", "score": "1", "subreddit": "WriteStreakPT", "subreddit_id": "t5_2gdmbs"}, {"author": "CrashingFirefly", "body": ">Ik herinner me toen / *dat* deze Subreddit nauwelijks twintig leden had.\n\n>Hopelijk zal WS-NL ~~steeds~~ **blijven** groeien!\n\nDat hoop ik ook! :)", "created_utc": "1633088594.0", "edited": "False", "id": "heypz5d", "is_submitter": "False", "link_id": "t3_pz4cjm", "parent_id": "t3_pz4cjm", "score": "2", "subreddit": "WriteStreakNL", "subreddit_id": "t5_3g5eo9"}, {"author": "CrashingFirefly", "body": "Muito obrigado! :)\n\n> Atenção: lembra-te que as sugestões do dia são escritas em português do Brasil e por isso é importante verificar se há diferenças de ortografia ou vocabulário!\n\nSim, vou ter mais cuidado!", "created_utc": "1632999035.0", "edited": "False", "id": "heu3bry", "is_submitter": "True", "link_id": "t3_px1rl9", "parent_id": "t1_herhtfg", "score": "1", "subreddit": "WriteStreakPT", "subreddit_id": "t5_2gdmbs"}, {"author": "CrashingFirefly", "body": "Obrigado por corrigires o meu texto! :)\n\n>Em reação à (a-ha!) u/praptipanda\n\nSim, depois que escreveste isso, tornou-se bastante claro haha\n\nEna, este canal, 'Meer voor mannen', é notável. Quando não estiver a transmitir filmes do Bond, provavelmente poderia ver 'Rambo', 'Need for Speed' ou 'Terminator'. Falando sobre estereótipes de género...", "created_utc": "1632998525.0", "edited": "False", "id": "heu2nxf", "is_submitter": "True", "link_id": "t3_pwfe16", "parent_id": "t1_herf7on", "score": "1", "subreddit": "WriteStreakPT", "subreddit_id": "t5_2gdmbs"}, {"author": "CrashingFirefly", "body": "Neem dit met een korreltje zout, want ik ben geen taalkundige: Veel woorden in het Vlaams zijn afgeleid van Nederlandse woorden. Een voorbeeld: Het woord 'punaise' (duidelijk Frans) is in het Vlaams 'duimspijker'. Ander voorbeeld: Het woord 'snackbar' (duidelijk Engels) is in het Vlaams 'frietkot' (letterlijk: french fries hut/house), al zal het woord snackbar ook wel worden gebruikt en is een frietkot niet precies hetzelfde. Hoe dan ook, je zal zelf nog een hoop voorbeelden tegenkomen! In het Nederlands zoals het in Nederland wordt gesproken is, naar mijn idee, een grotere Angelsaksische invloed te vinden.", "created_utc": "1632993886.0", "edited": "False", "id": "hetx8qx", "is_submitter": "False", "link_id": "t3_pxenao", "parent_id": "t1_hereqaf", "score": "2", "subreddit": "WriteStreakNL", "subreddit_id": "t5_3g5eo9"}, {"author": "CrashingFirefly", "body": ">Vandaag was een **hele** interessante dag vol (van) emoties ~~bij wijze van spreken~~. \n\n>Aangezien ik (een) introvert ben, heb ik ~~nu~~ veel tijd nodig om ~~mijn batterijen~~ op te opladen.\n\n'mijn batterijen opladen' is niet echt een uitdrukking die we gebruiken; 'opladen' daarentegen kan je wel gebruiken. \n\n>En **deze** tekst **is** misschien een ~~spiegel~~ **reflectie** van mijn vermoeide en rommelige hoofd haha. \n\n>Ik ben verliefd op ~~deze~~ **dit** fantastische Vlaamse meisje, die ook (een) introvert is. \n\n>Onze situatie is zo schattig maar **ook** een beetje ongemakkelijk (op een positieve manier). \n\n>Ik denk erg veel over / *aan* haar en deze situatie.\n\n'over iemand denken' is niet per se verkeerd, maar 'aan iemand denken' is gebruikelijker. Ook verschilt de betekenis enigzins:\n\n- Boeien wat de buren over ons denken, we gaan gewoon een feestje bouwen!\n- Ik heb vlinders in mijn boek en ik denk de hele tijd aan haar.\n\n'over iemand denken' betekent dus eerder dat iemand een mening over je heeft.\n\n>**Maar** alles **is** goed, alles **is** prachtig.\n\nHet werkwoord 'zijn' weglaten zou eventueel in een erg informele context kunnen, maar over het algemeen wordt dit niet gedaan.\n\n>Ik voelde **me** zo geïnspireerd en gek dat ik me **aanmeldde** om activiteiten (wat bedoel je hier?) te doen, ondanks dat ik (nog) niet klaar was. \n\n>*Ik maakte echter* blijkbaar een goede indruk: ik **slaagde**. \n\nVoor vervoegingen in de verleden tijd vind je hier een ezelsbruggetje: https://onzetaal.nl/taaladvies/t-kofschip. \n\n>Ik heb zo'n cocktail van emoties, ik voel zo enthousiast.\n\nDit klinkt wat gek, dus als alternatief:\n\n- Ik zit in een achtbaan van emoties; ik ben zo enthousiast.\n\n>Later in de middag was ik met haar, de lieve ziel, **zoals** ik haar noem. \n\n'lieve ziel' klinkt erg literair/oudbollig, maar wellicht is dat precies de reden dat je het gebruikt! ;)\n\n>Het meisje ~~dat** mijn hart nam. \n\n>De momenten met haar zijn zo magisch en ik wil ~~altijd~~ niet dat ze eindigen. \n\n>Trouwens**,** vandaag ging een deel van ~~de~~ **het** gesprek over boeken. \n\n>~~Die~~ **Dat** zal ik eens hier bespreken.\n\n>De avond was verwarrend. Ik ontmoette een vriend die ik lang niet heb / *had* gezien. \n\n>Wij / *we* waren in een restaurant voor studenten. \n\n'wij' wordt meestal gebruikt om nadruk te leggen op het persoonlijk voornaamwoord. 'we' is daarom gebruikelijker in dagelijks taalgebruik.\n\n>Toen kwam **er** nog iemand bij ons en ik voelde **me** erg ongemakkelijk op een negatieve manier. \n\n>Ik ben in de war maar het gaat goed en... verrassing, de lieve ziel belde me, haar ~~Oma~~ **oma** schreef me en ik ontspan ~~verwijl~~ **terwijl** ik Nederlands hoor, ~~leze~~ **lees** en schrijf.\n\n\nGoed bezig! :) Leer je Vlaams of Nederlands? De verschillen zijn niet heel groot, maar sommige woorden en uitdrukkingen kunnen anders zijn. En het accent is natuurlijk anders! Zelf vind ik Vlaams mooier en autentieker klinken (en dat zeg ik als Hollander!).", "created_utc": "1632912728.0", "edited": "False", "id": "hephmus", "is_submitter": "False", "link_id": "t3_pxenao", "parent_id": "t3_pxenao", "score": "2", "subreddit": "WriteStreakNL", "subreddit_id": "t5_3g5eo9"}, {"author": "CrashingFirefly", "body": ">... zoals bijvoorbeeld ...\n\nDit is een 'fout' die veel Nederlanders ook maken. Beide woorden impliceren dat je een voorbeeld gaat geven, dus het is beter om het woord 'bijvoorbeeld' weg te laten: \"Daarin zitten interessante dingen zoals oude boeken, oud speelgoed ...\". \n\n>Hoewel hij kapot is zou ik misschien nog een paar bestanddelen / *onderdelen* kunnen gebruiken.\n\n'bestanddelen' klinkt erg technisch en wordt eerder gebruik in formele (/juridische) taal, zoals: \"Het speelgoed werden teruggeroepen, omdat er schadelijke bestanddelen in zouden zitten.\" 'onderdelen' is algemener. \n\n>Sommige~~n~~ las ik toen ik kind was. \n\nPiepklein foutje, lees hier de verschillen tussen *sommigen* en *sommige*: https://www.vlaanderen.be/taaladvies/sommigen-sommige. Mocht je er vragen over hebben, stel ze gerust!\n\n\nWederom goed geschreven! De 'fouten' die je maakt worden ook, zoals ik al aangaf, door veel Nederlanders gemaakt. Je zit dus al op een hoog niveau! :)", "created_utc": "1632911843.0", "edited": "False", "id": "hepghup", "is_submitter": "False", "link_id": "t3_pxq71w", "parent_id": "t3_pxq71w", "score": "2", "subreddit": "WriteStreakNL", "subreddit_id": "t5_3g5eo9"}, {"author": "CrashingFirefly", "body": "Boa que mencionas isso! Não, tentei utilizar o novo acordo ortográfico, mas provavelmente interpretei (ou melhor: li) o dicionário incorreto. Eu uso este dicionário: [https://dicionario.priberam.org/perspetiva](https://dicionario.priberam.org/perspetiva). Quando escrevesse uma palavra no campo (por exemplo 'perspetiva'), o website mostra-me duas opções: perspectiva (aAO) e perspetiva (dAO). Tenho de usar dAO, certo? \n\n>É só para saber se as grafias divergentes devem ser consideradas erros ou escolhas.\n\nPodes considerar erros escolhidos, mas não de propósito haha", "created_utc": "1632902896.0", "edited": "False", "id": "hep6l4m", "is_submitter": "True", "link_id": "t3_pwfe16", "parent_id": "t1_hen4nnf", "score": "1", "subreddit": "WriteStreakPT", "subreddit_id": "t5_2gdmbs"}, {"author": "CrashingFirefly", "body": "Obrigado por partilhares a tua perspectiva, u/praptipanda! Eu nunca pensava sobre ‘O Senhor dos Anéis’ assim, mas é um aspeto interessante sobre que escreveste. Sendo um homem, estas coisas talvez parecam menos óbvias. É verdade que practicamente todos os personagens nos livros do Tolkien são homens; as mulheres só têm um papel secundário. \n\nEmbora não diria que estás a tentar encontrar problemas onde eles não existem, gostaria de acrescentar que o livro foi escrito num zeitgeist [existe uma palavra melhor em português?] tamanho diferente. A triologia foi publicada entre 1954 e 1955, mas o Tolkien já escreveu o livro entre 1937 e 1949. Nessa altura, uma grande parte do mundo ainda não tinha sufrágio feminino. Não é bom, mas isto também é refletido na literatura desta época. \n\nUm outro série de um quase universo fictício que gosto muito é sobre o agente secreto mais famoso do mundo: o James Bond. Estou muito ansioso pelo último filme do Daniel Craig como Bond! O primeiro filme do agente secreto britânico, Dr. No, foi lançado em 1962. Ao longo dos anos, podemos ver uma mudança no papel da bond girl nos filmes. E nem é preciso ver o filme – o cartaz de cada filme já mostra isto (https://www.imdb.com/list/ls056263820/). Por exemplo, compare o cartaz de ‘From Russia with Love’ (1963) com o de ‘Quantum of Solace’ (2008). Vês a diferença?\n\nQuando vemos os primeiros filmes, a maneira em que o Bond trata das mulheres em seu redor é, num certo modo, chocante. Eu diria que quase toca a violação. Estes, e outros, filmes dão-nos a possibilidade de ter uma vista no passado e mostram-nos que as normas sociais podem alterar relativamente rápidas. No entanto, isto obviamente não significa que todos os preconceitos já estão resolvidos. Ainda temos um caminho a percorrer e para as pessoas que sofrem destes problemas agora, a mudança nunca mais chega [?].", "created_utc": "1632743305.0", "edited": "False", "id": "heglq82", "is_submitter": "True", "link_id": "t3_pvvoku", "parent_id": "t1_hed7k15", "score": "1", "subreddit": "WriteStreakPT", "subreddit_id": "t5_2gdmbs"}, {"author": "CrashingFirefly", "body": "Hey! Jazeker, ik zal wat voorbeelden geven:\n\n'bepalen' = to determine, to decide\n- Waarom bepaal alleen jij hoe alles gaat?\n- Zijn keuze om te verhuizen naar Amerika was erg bepalend voor de rest van zijn leven.\n\n'bestemmen' = (to be) destined for\n- Iemand met veel overtuigingskracht is bestemd voor de politiek.\n- Ik ontving een brief van de belastingdienst, maar deze bleek niet voor mij bestemd te zijn. \n\nMaak dit het iets duidelijker? :) Zo niet, laat het weten!", "created_utc": "1632740855.0", "edited": "False", "id": "hegi3dd", "is_submitter": "False", "link_id": "t3_pv11dx", "parent_id": "t1_hecwsy0", "score": "2", "subreddit": "WriteStreakNL", "subreddit_id": "t5_3g5eo9"}, {"author": "CrashingFirefly", "body": ">Sommige mensen hebben ~~een~~ **het** gevoel dat ik echt geen zin in het leven heb, want / *omdat* ik weet niet wat ik wil.\n\n>Maar ~~het~~ **dat** is helemaal niet waar. \n\n>... rond mij / *om mij heen* in deze wereld ~~dat~~ **die** het leven perfect / *mooi* maken.\n\n>... in het universum werkt. \n\n>... dat is ~~helemaal~~ **heel** simpel - ik heb geen (*levens*)doel. \n\n> En ik weet niet hoe mensen zich met zijn zinnen gedragen en wat zij doen om het doel te formeren en daarna het bereiken.\n\nHier begrijp ik niet echt wat je bedoelt. Zou je het op een andere manier kunnen formuleren? :)\n\n> Ik ga **er** verschillende boeken over ~~dat~~ lezen en misschien leer ik iets **nuttigs** (voor mijzelf). \n\n>Hoewel wat ik wil een moeilijk te ontraadselen mysterie is, geloof ik dat ik **er** wel achter zal komen.\n\n\nTja, ik begrijp hoe je je voelt... Ik sta ook op een punt dat ik (het gevoel heb) dat ik moet kiezen wat ik met m'n leven wil, maar ik ben er ook nog niet uit. Goed geschreven en veel succes met het overpeinzen van je toekomst! ;)", "created_utc": "1632740609.0", "edited": "False", "id": "heghrfz", "is_submitter": "False", "link_id": "t3_pw3i0z", "parent_id": "t3_pw3i0z", "score": "1", "subreddit": "WriteStreakNL", "subreddit_id": "t5_3g5eo9"}, {"author": "CrashingFirefly", "body": ">Marcus was een hopeloze suiker**ziekte**patiënt die zijn dokters tot wanhoop dreef. Hij riep graag:”Ik zal het nooit mijn leven laten ~~bestemmen~~ **bepalen**.”\n\nEen 'suikerpatiënt' klinkt eerder als een enorme zoetekauw! ;)\n\n>Maar ze waren onbelangrijk voor elkaar met wederzijdse instemming.\n\n*Maar ze hadden geen interesse in elkaar.**\n\n>wederzijdse instemming \n\nDit klinkt erg formeel.\n\n>Ze komt ~~vrij~~ **thuis** van haar werk.\n\n>Ze belt haar oudste zoon die geld voor **een** scooter spaart en belooft hem 200 euro te geven als hij er *zo snel mogelijk* (OF) *binnen een half uur* achter komt waar oom Marcus wordt geopereerd.\n\n\nGoed gedaan! Je Nederlandse grammatica is praktisch foutloos. Blijf zo doorgaan! :)", "created_utc": "1632669409.0", "edited": "False", "id": "hecsgye", "is_submitter": "False", "link_id": "t3_pv11dx", "parent_id": "t3_pv11dx", "score": "2", "subreddit": "WriteStreakNL", "subreddit_id": "t5_3g5eo9"}, {"author": "CrashingFirefly", "body": "> zal zeker de laatste wandeling van dit jaar **zijn**.\n\nGeniet van de pauze! :)", "created_utc": "1632669044.0", "edited": "False", "id": "hecrnbb", "is_submitter": "False", "link_id": "t3_pv09z5", "parent_id": "t3_pv09z5", "score": "2", "subreddit": "WriteStreakNL", "subreddit_id": "t5_3g5eo9"}, {"author": "CrashingFirefly", "body": "Muito obrigado! :)", "created_utc": "1632592902.0", "edited": "False", "id": "he8wowh", "is_submitter": "True", "link_id": "t3_ptyulx", "parent_id": "t1_he4jfzo", "score": "1", "subreddit": "WriteStreakPT", "subreddit_id": "t5_2gdmbs"}, {"author": "CrashingFirefly", "body": "E também obrigado por as correções adicionais! :)\n\n>Não há bela sem senão.\n\nFixe, não conhecia esta expressão!", "created_utc": "1632592830.0", "edited": "False", "id": "he8wj1d", "is_submitter": "True", "link_id": "t3_pv3po8", "parent_id": "t1_he8oj06", "score": "2", "subreddit": "WriteStreakPT", "subreddit_id": "t5_2gdmbs"}, {"author": "CrashingFirefly", "body": "Perfeito, obrigado por corrigires o meu texto! :)", "created_utc": "1632592763.0", "edited": "False", "id": "he8wdoh", "is_submitter": "True", "link_id": "t3_pv3po8", "parent_id": "t1_he7fjic", "score": "2", "subreddit": "WriteStreakPT", "subreddit_id": "t5_2gdmbs"}, {"author": "CrashingFirefly", "body": "Obrigado pelas correções! :)", "created_utc": "1632592236.0", "edited": "False", "id": "he8v75w", "is_submitter": "True", "link_id": "t3_puflo4", "parent_id": "t1_he8r1dz", "score": "1", "subreddit": "WriteStreakPT", "subreddit_id": "t5_2gdmbs"}, {"author": "CrashingFirefly", "body": ">Não através das histórias, mas através das palavras que têm marcas de género, como adjetivos, verbos, etc.\n\nAh, sim, claro! Obrigado :)\n\n>Começaste por utilizar no masculino, mudaste para o feminino sem razão aparente e depois voltaste ao masculino. Isso torna o texto inconsistente.\n\nSim, às vezes faço isto nos textos ingleses ou holandeses para representar os dois genéros equivalentemente, desde que reparei que autores fazem isso. Mas então isso é invulgar de fazer nos textos portugeses?", "created_utc": "1632493186.0", "edited": "False", "id": "he3eko4", "is_submitter": "True", "link_id": "t3_pt8oz4", "parent_id": "t1_he39tkt", "score": "1", "subreddit": "WriteStreakPT", "subreddit_id": "t5_2gdmbs"}, {"author": "CrashingFirefly", "body": "Muito obrigado pelas correções! :)\n\n>Se ainda não sabes, andas distraído 😄\n\nAi sim? Pois, talvez seja o caso... Mas como teria saber o género através as histórias que pessoas escrevem?\n\n>o CEO\n\nPorque não pode ser 'a CEO' neste caso? Não é uma palavra (acrónimo) de dois géneros?", "created_utc": "1632490390.0", "edited": "False", "id": "he38d9l", "is_submitter": "True", "link_id": "t3_pt8oz4", "parent_id": "t1_he02gx0", "score": "1", "subreddit": "WriteStreakPT", "subreddit_id": "t5_2gdmbs"}, {"author": "CrashingFirefly", "body": ">estava debaixo da língua\n\nO que isto quer dizer?", "created_utc": "1632321162.0", "edited": "False", "id": "hdujuf2", "is_submitter": "True", "link_id": "t3_pshx47", "parent_id": "t1_hdrppzs", "score": "1", "subreddit": "WriteStreakPT", "subreddit_id": "t5_2gdmbs"}, {"author": "CrashingFirefly", "body": ">embora não tenha ilusões(?)\n\nIsso mesmo! Obrigado :)", "created_utc": "1632321149.0", "edited": "False", "id": "hdujtbk", "is_submitter": "True", "link_id": "t3_pshx47", "parent_id": "t1_hdqc10x", "score": "2", "subreddit": "WriteStreakPT", "subreddit_id": "t5_2gdmbs"}, {"author": "CrashingFirefly", "body": "Muito obrigado pelas correções! :)\n\n>... embora não tenha devaneios (dúvidas?) sobre ...\n\nAqui, queria dizer: Não tenho delírios/ilusões que na verdade uma estrangeira consegue passar por um local. O que seria a melhor forma para fazer isto?\n\n>Espero ter ajudado, só queria chamar a atenção para 'coisas' ser uma palavra no feminino\n\nBoa, obrigado, vou ter mais cuidado! :)", "created_utc": "1632321122.0", "edited": "False", "id": "hdujr0s", "is_submitter": "True", "link_id": "t3_pshx47", "parent_id": "t1_hdpnjdh", "score": "1", "subreddit": "WriteStreakPT", "subreddit_id": "t5_2gdmbs"}, {"author": "CrashingFirefly", "body": "Hoje não é ‘Dia de Socializar’, mas mesmo assim gosto de responder a este post do/da r/praptipanda. A minha opinião, porém, não difere muito. Para mim, é espantoso que há pessoas que verdadeiramente acreditem que ‘sucesso’ (na definição tradicional) só pode ser logrado atráves trabalho duro e que todos, neste sentido, têm as mesmas oportunidades – é so uma questão de vontade.\n\nDe acordo com investigação do Glassdoor, um CEO americano ganha – em média – 204 vezes o salário mediano do um empregador da mesma empresa. Embora o fosso entre a CEO e empregador seja mais pequeno na Europa, ainda são ratios incríveis. Eu consigo acreditar que talvez haja pessoas que merecessem ganhar mais do que outros, mas não me digas \\[you don’t tell me?\\] que uma pessoa consegue esforçar-se 204 vezes mais do que uma outra pessoa. Isto é fisicamente impossível.\n\nUm dos argumentos avançados \\[brought forward?\\] para defender os salários chorudos dos CEOs é o seguinte: Se os accionistas estiverem dispostos para pagar este salário, é porque a CEO tem o valor no mercado. Assim, a ideia é que o successo de uma empresa é, por uma grande parte, graças ao empenho e as habilidades do CEO. Por outras palavras, o salário é merecido, porque haveria poucas outras pessoas que conseguem fazer o mesmo.\n\nDepois de ter lido alguns dos livros do economista Nassim Taleb, conhecido pelas suas teorias sobre aleatoriedade, tenho as minhas dúvidas sobre o racicínio destes crentes numa economia de livre mercado. É impossível atribuir o sucesso de uma empresa a um punhado de pessoas só. Eventos imprevistos podem ter um grande impacto no mundo. No entanto, nós só vemos os ‘ganhadores’, porque ninguém compraria um livro de autoajuda de uma pessoa que levou várias empresas a bancarrota.\n\nAlém disso, o CEO não é, por norma, punido pelos ‘erros’, por exemplo com uma subtração do \\[?\\] seu salário. Se fosse assim, seria um pouco mais justo ganhar tanto dinheiro. Enfim, só um pequeno discurso que queria partilhar.", "created_utc": "1632320733.0", "edited": "False", "id": "hduiug4", "is_submitter": "False", "link_id": "t3_pszv1q", "parent_id": "t3_pszv1q", "score": "2", "subreddit": "WriteStreakPT", "subreddit_id": "t5_2gdmbs"}, {"author": "CrashingFirefly", "body": "> Ja ik wilde de nadruk leggen op het feit dat je een artikel altijd kan verbeteren (als je goede bronnen en kennis heeft).\n\nDuidelijk! Kleine verbetering: 'als je goede bronnen en kennis **hebt**'.\n\n>Ik wilde huiswerk en scriptie zeggen, maar ik kon me er niet aan herinneren.\n\nAh, ja, dat is logischer! :)\n\n>Ik heb een vraag: was de constructie had.. kunnen zijn correct? Met betrekking tot de grammatica natuurlijk.\n\nJazeker! Je zou bijvoorbeeld kunnen schrijven: \"Alhoewel de zon niet scheen had het weer een stuk slechter kunnen zijn.\" In jouw zin klinkt het echter wat vreemd; waarschijnlijk door het woord 'vroeger'. Wederom kan ik niet een verklaring bedenken, maar als ik erop kom laat ik het je weten.", "created_utc": "1632319995.0", "edited": "False", "id": "hduh64v", "is_submitter": "False", "link_id": "t3_pt48m5", "parent_id": "t1_hdu0h49", "score": "2", "subreddit": "WriteStreakNL", "subreddit_id": "t5_3g5eo9"}, {"author": "CrashingFirefly", "body": ">Er is een plant in mijn badkamer ~~die~~ **waarvan** ik geen idee heb waarom ~~het~~ hij dood ~~gaat~~ aan het gaan is. Of ~~ging~~ al dood is? **Ik heb** helemaal geen idee of ~~het~~ **hij** nog steeds leeft.\n\n>Ik kreeg **hem** ~~toen~~ **nadat** ik met mijn laatste baan stopte. En voor zeven maanden (lang) was de plant gelukkig en gezond.\n\n>Ik veranderde niets, maar één week geleden besloot ~~het~~ **hij** / *de plant* om te ~~drogen~~ **verwelken** en **te** sterven.\n\n>Eerlijk gezegd~~,~~ ben ik niet zo goed met planten**,** maar **deze** overleefde **het** zo'n lange tijd. Deze keer is het denk ik niet helemaal mijn fout.\n\n>Zoals je **ziet**, vandaag was niet zo'n interessante dag en dus schrijf ik over een dode plant.\n\n>Een minuut (van) stilte voor de plant in de badkamer.\n\n>**Hij** zal gemist worden.\n\n\nHerkenbaar! Ware het niet voor mijn opmerkzame huisgenoten, dan zouden al mijn planten thuis ook al lang gestorven zijn. Goed geschreven, blijf zo doorgaan! :) Let op het gebruik van het/hij/hem (of zij/haar).", "created_utc": "1632319750.0", "edited": "False", "id": "hdugmbz", "is_submitter": "False", "link_id": "t3_psrr85", "parent_id": "t3_psrr85", "score": "2", "subreddit": "WriteStreakNL", "subreddit_id": "t5_3g5eo9"}, {"author": "CrashingFirefly", "body": ">Het is zeker dat Wikipedia best hulpvaardig is. \n\nHet staat vast dat Wikipedia handig is, OF:\nWikipedia is zeker handig. \n\n'Hulpvaardig' (of het synoniem 'behulpzaam') wordt alleen gebruikt om eigenschap van mensen te beschrijven, bijv. 'Mijn buurvrouw was altijd erg behulpzaam'. \n\n>Iedereen mag ~~zelfs~~ aan Wikipedia bijdragen, **meestal** heb je geen profiel nodig om een artikel te veranderen / *aan te passen*.\n\n>Maar is het altijd zo? \n\n-> *Maar is dat wel terecht?* (is it justified?)\n\n>Vroeger / *Voorheen* **was het goed** mogelijk ~~kunnen zijn dat het makkelijk was om~~ verkeerde informatie op Wikipedia te lezen.\n\n>Sommige artikelen kunnen maar door **één** gebruiker worden veranderd\n\n>het is overigens ~~obligatorisch~~ **verplicht** om al **je** bronnen te citeren.\n\n'obligatorisch' is volgens het woordenboek een officieel Nederlands woord, maar je zal het zelden tot nooit tegenkomen. \n\n>En als we zien dat een artikel slecht **is** geschreven, dan kunnen we het ~~ons~~zelf verbeteren**.** \n\n>Als we op goede bronnen en er een goede kennis van kunnen rekenen.\n\nHier begrijp ik niet helemaal wat je wil zeggen. Bedoel je dat je alleen een artikel zou moeten aanpassen als je er zelf iets vanaf weet?\n\n>... taak of een proefwerk ...\n\nEen 'taak' is letterlijk een 'task' (EN), dus het hoort hier niet helemaal thuis. Een 'proefwerk' is een 'test' (EN). Woorden die je wel zou kunnen gebruiken zijn bijv. opstel of essay (meer of minder hetzelfde).\n\nWederom goed geschreven! Je hebt al een uitgebreide woordenschat en je schrijft mooie zinnen. Ga zo door! :)", "created_utc": "1632309810.0", "edited": "False", "id": "hdty15l", "is_submitter": "False", "link_id": "t3_pt48m5", "parent_id": "t3_pt48m5", "score": "2", "subreddit": "WriteStreakNL", "subreddit_id": "t5_3g5eo9"}, {"author": "CrashingFirefly", "body": "Ah, oké dat verklaart het! ;) Het klinkt voor mij nogal seksueel geladen, wat denk ik niet de intentie was.\n\n>De doel was om rijmpjes te oefenen voor kerstmis. Want iemand heeft me gezegd dat er een soort traditie is met het wisselen van gedichten.\n\nKlopt! Al hoort deze traditie eigenlijk eerder bij Sinterklaas. Het is een van mijn favoriete Nederlandse tradities! De gedichten kan je namelijk gebruiken om iemand te complimenteren, maar evengoed om iemand te 'roasten'. Goed om te weten!\n\nDichten in een vreemde taal is inderdaad erg moeilijk... Je kan het gedicht altijd hier posten om er iemand naar te laten kijken. En ik weet zeker dat mensen het op prijs stellen als je moeite doet om in het Nederlands te dichten! :)", "created_utc": "1632238687.0", "edited": "False", "id": "hdq9ixk", "is_submitter": "False", "link_id": "t3_ps51rx", "parent_id": "t1_hdprn5t", "score": "2", "subreddit": "WriteStreakNL", "subreddit_id": "t5_3g5eo9"}, {"author": "CrashingFirefly", "body": "Muito obrigado por corrigires o meu texto! :)", "created_utc": "1632228575.0", "edited": "False", "id": "hdpn03b", "is_submitter": "True", "link_id": "t3_prsulc", "parent_id": "t1_hdpa4u9", "score": "1", "subreddit": "WriteStreakPT", "subreddit_id": "t5_2gdmbs"}, {"author": "CrashingFirefly", "body": ">Als ik een ~~nemesis~~ aartsvijand had?\n\n>Haar slipje tussen de billen,\n\nIk vrees dat ik hier niet helemaal begrijp wat je bedoelt... \n\n>Of dat hij wo**o**rden altijd vergat?\n\n>een geblokkeerde pinpas~~je~~,\n\nWe gebruiken vaak verkleinwoorden in het Nederlands, maar bij het woord 'pinpas' klinkt het wat gek.\n\n>Zo luid als een hamer\n\nWaarschijnlijk is dit literaire vrijheid, maar 'zo luid als een hamer' is niet een expressie die voorkomt in het Nederlands.\n\n\nGoed bezig! Dichten is altijd moeilijk in een andere taal, maar je hebt er iets moois van gemaakt :)", "created_utc": "1632221939.0", "edited": "False", "id": "hdpcei4", "is_submitter": "False", "link_id": "t3_ps51rx", "parent_id": "t3_ps51rx", "score": "2", "subreddit": "WriteStreakNL", "subreddit_id": "t5_3g5eo9"}, {"author": "CrashingFirefly", "body": ">Vandaag neem ik een andere korte pauze. Ik ben een beetje moe vanwege (het) werk en (het) leren (de universiteit zal gauw weer beginnen / *begint binnenkort weer*) en ik heb niet zo veel ideeën gekregen / *ben ideeëloos*.  \n>  \n>Deze maand heb ik het ~~wat~~ *vrij* druk en *houd ik mij* vooral *met* Duits *bezig*. *Dit heb ik* trouwens ook geprobeerd *door* een krimi in het Duits te schrijven. Dat viel gelukkig (best) mee en ik zou het*zelfde* graag willen proberen ~~met~~ *in* het Nederlands. Maar *eerst wil ik* een beter / hoger niveau en een betere woordenschat *hebben*. Het is nog wat vroeg om mijn ~~literarische~~ **literaire** Nederlands te ~~kunnen~~ oefenen.  \n>  \n>In ieder geval zal ik gauw / binnenkort ook op het Nederlands kunnen **concentreren**. Morgen zal ik proberen om over een interessant thema te **schrijven**.\n\nGoed bezig, blijf vooral schrijven! :) (Al is dat gezien jouw streak niet nodig om te zeggen ;) ). Voor een hoop verbeteringen kan ik niet echt een verklaring geven; het klinkt simpelweg wat natuurlijker. Mocht je vragen hebben, laat het me weten!", "created_utc": "1632221662.0", "edited": "False", "id": "hdpc1pa", "is_submitter": "False", "link_id": "t3_psfma5", "parent_id": "t3_psfma5", "score": "2", "subreddit": "WriteStreakNL", "subreddit_id": "t5_3g5eo9"}, {"author": "CrashingFirefly", "body": "Muito obrigado por explicares! :)", "created_utc": "1632217016.0", "edited": "False", "id": "hdp6n7a", "is_submitter": "True", "link_id": "t3_pr6fri", "parent_id": "t1_hdp3msb", "score": "1", "subreddit": "WriteStreakPT", "subreddit_id": "t5_2gdmbs"}, {"author": "CrashingFirefly", "body": "Obrigado mais uma vez por corrigires o meu texto! :)\n\n>Embora houvesse muita gente ...\n\nCom a palavra 'embora', é sempre preciso usar o conjuntivo?\n\n>Deves estar a querer dizer \"casserole\" em inglês? Uma caçarola é outra coisa, pelo menos para mim. Acho que não falamos desse tipo de comida da mesma forma. Ou seja, o recipiente chama-se assadeira (ou Pyrex, se for de vidro) mas não é o recipiente que define o tipo de comida, até porque dá para fazer coisas completamente diferentes, como bacalhau com natas ou empadão de carne.\n\nHmm, nem por isso... No holandês, chamamos isto um 'ovenschotel' (literalmente 'prato cozido no forno'). Neste caso, tentei referir todos os pratos que são cozidos no forno (além do bolos e outros doces), tal como o bacalhau com natas ou empadão de carne que mencionaste. O que tenho de usar neste caso?\n\n>... é muito incomum levar amigos teus ...\n\nObrigado pela correção! 'trazer amigos' é brasileiro? Também vi esta expressão online umas vezes.\n\n>Não é comum os adultos interagirem com as crianças? Devo ficar preocupada com as vossas crianças? 😳\n\nHaha, acho que não; para mim tudo acabou bem ;) E só que (eu acho que) é mais incomum de levar as crianças a um convívio em primeiro lugar, e além disso, as crianças são metadas na cama muito mais cedo.", "created_utc": "1632212949.0", "edited": "False", "id": "hdp2gna", "is_submitter": "True", "link_id": "t3_pr6fri", "parent_id": "t1_hdn89pl", "score": "1", "subreddit": "WriteStreakPT", "subreddit_id": "t5_2gdmbs"}, {"author": "CrashingFirefly", "body": "Goeie vraag! Voor iemand wiens moedertaal Nederlands is, heb ik vaak het idee dat er nog een hoop dingen zijn die ik niet weet... Hoe dan ook, hier vind je een uitleg: [https://onzetaal.nl/taaladvies/makkelijk-gemakkelijk](https://onzetaal.nl/taaladvies/makkelijk-gemakkelijk). Deze website (OnzeTaal) is perfect voor zulk soort vragen. Als je in je zoekmachine, bijvoorbeeld, intypt 'naar aanleiding van of na aanleiding van onzetaal' vind je bijna altijd een antwoord op je Nederlandse taalvraag. Succes! :) Als je andere vragen hebt, laat het me weten!", "created_utc": "1632212158.0", "edited": "False", "id": "hdp1nbh", "is_submitter": "False", "link_id": "t3_prgrix", "parent_id": "t1_hdna828", "score": "2", "subreddit": "WriteStreakNL", "subreddit_id": "t5_3g5eo9"}, {"author": "CrashingFirefly", "body": ">**Bij elk** artikel was (er) een verhaaltje in gemakkelijk / *simpel* Nederlands **dat** op het artikel gebaseerd was.\n\n>**Zo was er bijvoorbeeld** een artikel was over een boer die zijn trouwring **verloor terwijl** hij tussen **de** kalveren was.\n\n>Jaren later, ~~kwam~~ een man **bezocht** zijn huis: het was een slager die de trouwring **had gevonden in** de ~~mag~~ **maag** van een koe.\n\n>... maar (wel) **lief** en aandachtig.\n\n>Ze ontmoetten elkaar **pas** toen hij een hartaanval had / *kreeg*.\n\n>Meestal kon ik de artikelen niet zo goed **begrijpen, omdat** ze te moeilijk waren voor mij.\n\n'verstaan' betekent dat gesproken taal begrijpt; het wordt niet gebruikt voor tekst die je leest.\n\nDe woordvolgorde moet hier nét iets anders zijn. Waarom, dat weet ik helaas ook niet... Sorry! Dit is een moeilijk aspect van het Nederlands.\n\n>Maar de verhaaltjes kon ik wel **volgen** / **begrijpen**.\n\n>Nu begin ik met **twee** andere ~~twee~~ boeken in gemakkelijk Nederlands.\n\n>Ik durf nog niet een echt boek in het Nederlands te lezen, maar met wat geduld zal het *vast goed*komen.\n\n\nZeker weten! Je schrijft in ieder geval al erg goed. Er zijn een hoop simpele jeugdboeken die je misschient kunt lezen. Afhankelijk van welk genre je aanspreekt zou je bijvoorbeeld 'Brief voor de Koning' (fantasie/middeleeuwen) kunnen lezen. Als je van griezelboeken houdt, kan je bijvoorbeeld de boeken van Paul van Loon lezen, zoals de Griezelbus en Dolfje Weerwolfje. Veel succes!", "created_utc": "1632139812.0", "edited": "False", "id": "hdky1ws", "is_submitter": "False", "link_id": "t3_prgrix", "parent_id": "t3_prgrix", "score": "2", "subreddit": "WriteStreakNL", "subreddit_id": "t5_3g5eo9"}, {"author": "CrashingFirefly", "body": ">Gisteren heb ik de bruiloft van een vriend ~~van mij~~ bezocht. Gelukkig was het zonnig weer (vandaag regent het, we hadden best geluk!).\n\nNiet per se verkeerd, maar het is al duidelijk dat het om jouw vriend gaat. \n\n>Er waren ongeveer ~~minder~~ dan veertig gasten **en daarom** was het feest best rustig.\n\nIk neem aan dat je het Engelse 'for that reason' naar het Nederlandse wilde vertalen? In het Nederlands gebruiken we deze uitspraak niet zo letterlijk, maar zeggen we bijv. 'daarom'.\n\n>... er gedanst**;** / *.* ik deed ...\n\nInterpunctie is vrij ingewikkeld (ook voor mijzelf!). Lees hier meer: https://onzetaal.nl/taaladvies/puntkomma. \n\n>Het trouwen **vond** in de kerk plaats door een mis.\n\n'to take place' = plaatsvinden\n\nWat bedoel je hier met een mis? :)\n\n>**Daarna** zijn we allemaal / *met z'n allen* naar een restaurant gegaan om te eten en ~~om~~ te vieren.\n\n>**Daarom** ben ik nog wat moe. \n\n>Ik ben blij voor mijn vriend en ~~voor~~ zijn vrouw. \n\nHet is hier niet nodig om het woord te herhalen.\n\n>Het is altijd aangenaam / *fijn* om een bruiloft te bezoeken dankzij / *vanwege* de positieve sfeer.\n\n'aangenaam' is vrij formeel; ik raad 'fijn' aan.\n\nGoed geschreven! :) Ik ben blij dat je het naar je zin hebt gehad.", "created_utc": "1632139235.0", "edited": "False", "id": "hdkx453", "is_submitter": "False", "link_id": "t3_pr9ook", "parent_id": "t3_pr9ook", "score": "3", "subreddit": "WriteStreakNL", "subreddit_id": "t5_3g5eo9"}, {"author": "CrashingFirefly", "body": "*(Reacção - Streak 22:)*\n\nAntes de mais, bom texto! Eu não conhecia o termo “arte rupestre”, mas graças a uma pesquisa num motor de busca \\[search engine? Se não quiser usar Google\\] posso dizer que me parece muito interessante. E mais, acho que é maravilhoso que já tens uma boa ideia da tua carreira!\n\nIsto é, pelo menos para mim, uma escolha deveras difícil. Daqui a uns meses, se tudo corresse bem, vou formar-me \\[graduate\\]. Assim sendo, já estou à procura de emprego, porque queria evitar ter uma lacuna maior \\[?\\] entre a graduação e o trabalho. Embora que sei que não é assim, tenho o sentimento que agora vou escolher uma carreira pela vida. Visto que passarmos uma grande parte da nossa vida a trabalhar, é importante usar este tempo numa maneira significante. Contudo, encontrar um trabalho ‘significante’ não é tão simples – não podemos nós todos trabalhar para um ONG a salvar o mundo do colapso. O que é considerado ‘significante’ varia de pessoa em pessoa. Contudo, eu próprio preferia não compactuar com o crescimento desmesurado da economia, tentando vender serviços e bens que não precisamos (SodaStream, à sério?).\n\nGostaria de dizer que já tenho uma ideia clara de que eu pretendesse fazer, mas infelizmente isso não é o caso. Tal como muitas pessoas – e nomeadamente a minha geração – queria um emprego em que sinto que estou, ao menos um bocadinho, a contribuir a sociedade ou a conservação da planeta e o nosso éspecie. Mas isso é difícil. Na minha opinião, os problemas da nossa era (alterações climáticas, inteligência artificial e superpopulação entre outros) não vão ser resolvidos graças a tecnologia, a minha área, mas talvez seja cínico demais.\n\nTalvez seja melhor não dar tanta importância à escolha. Felizmente, estou numa posição que tenho a possibilidade de escolher e estou grato por isso. Além disso, sempre existe a hipotése de mudar de carreira – nada é pela vida. Eu sempre gosto de ouvir sobre as vidas de outras pessoas: Porque eles fazerem certas decisões na vida? O que é que eles gostam sobre as suas profissões? Regozijo-me muito em ver uma pessoa a falar sobre as suas paixões com fervor. Então, obrigado por isso u/praptipanda! :)", "created_utc": "1632137093.0", "edited": "False", "id": "hdktul0", "is_submitter": "False", "link_id": "t3_prhdbp", "parent_id": "t3_prhdbp", "score": "1", "subreddit": "WriteStreakPT", "subreddit_id": "t5_2gdmbs"}, {"author": "CrashingFirefly", "body": ">... met mijn vrienden en familieleden te **onder**houden.\n\nhouden = to keep\nonderhouden = to maintain\n\n>**niet** door **veel** vrienden gebruikt.\n\n>Zoom is ook nuttig vanwege de lessen van mijn universiteit.\n\n'Lessen' is niet echt een woord wat veel gebruikt wordt in de context van de universiteit. In plaats van 'lessen' kun je beter 'college' (werkcollege, hoorcollege) gebruiken.\n\n>... kan ik ze ook ~~vanuit~~ **met** mijn smartphone volgen.\n\n>... scannen door **middel van** een foto.\n\n>... dankzij mijn scan-app heb ik ze hem ordelijk en duidelijk kunnen sturen.\n\n'ordelijk' is niet een woord dat vaak gebruikt wordt. Ik weet alleen ook geen alternatieven... Wat bedoel je hier precies met 'ordelijk'? \n\n\nLekker bezig! :) Je schrijft erg netjes - netter dan veel Nederlanders! Je zinsopbouw is erg goed.", "created_utc": "1632048877.0", "edited": "False", "id": "hdg6dio", "is_submitter": "False", "link_id": "t3_ppi1ui", "parent_id": "t3_ppi1ui", "score": "2", "subreddit": "WriteStreakNL", "subreddit_id": "t5_3g5eo9"}, {"author": "CrashingFirefly", "body": "Veel plezier! :)\n\nIk zie geen fouten, al zou ik misschien dit alternatief aanraden:\n\nIk werd door hem uitgenodigd. > Hij nodigde mij uit.", "created_utc": "1632048458.0", "edited": "False", "id": "hdg5uk1", "is_submitter": "False", "link_id": "t3_pqien3", "parent_id": "t3_pqien3", "score": "2", "subreddit": "WriteStreakNL", "subreddit_id": "t5_3g5eo9"}, {"author": "CrashingFirefly", "body": ">En vaak kan ik ze een beetje controleren\\*\\*, m\\*\\*aar niet als **het** terugkerende dromen zijn.\n\nVaak wanneer je een voegwoord, zoals 'maar', gebruikt is het beter om de zinnen te combineren. De tweede zin hoort namelijk bij de eerste zin.\n\n>Met hen ben ik slechts een afwachtende.\n\n*Zulke dromen wacht ik simpelweg af tot ze komen.*\n\n>Soms is / *gaat* de droom over een enorme eindeloos ~~gauwgom~~ **kauwgom** die ~~in~~ aan mijn tanden vastzit / *vastkleeft*. Ik trek en trek, *maar er gebeurt* ~~en~~ niets.\n\n>~~Energetieke~~ Energieke muziek. Ik kon piano spelen toen ik een tiener was, maar nooit kon ik / *lukte het om* iets *te* componeren.\n\n>Maar gisteren had ik een terugkerende droom *en* die maakte me een beetje verdrietig.\n\n>We waren ~~echt dicht bij elkaar op~~ de eerste twee jaar. \n\nSuggestie: We waren *erg close* de eerste twee jaar.\n\nIn het Nederlands gebruiken we vaak woorden uit het Engels. Deze uitspraak (*close* zijn) is daar een voorbeeld van. Als je toch liever een 'Nederlands' alternatief wilt, zou je ook het volgende kunnen schrijven: 'We waren erg dik/goed bevriend in de eerste twee jaar'. \n\n>Maar ze begonen steeds meer te **houden** van **grote feesten** / *uitgaan* en ~~alcohol spelletjes~~ **drankspelletjes**. Iedereen drinkte totdat ze zich ziek voelden. En ik haatte **dat** soort~~en~~ dingen.\n\n>**Toen** had ik mijn eerste vriendje **en** *was er* geen tijd *meer* voor andere dingen (de fouten van de eerste liefde), dus we groeiden uit elkaar en we **ontmoetten** nieuwe vrienden.\n\nDe werkwoordsvervoeging in de verleden tijd voor 'we' is met twee t's (maar dit is voor Nederlands ook vaak moeilijk zat! ;) ).\n\n>Na **mijn** afstuderen aan de universiteit~~,~~ probeerde ik hier en daar met ze te praten. \n\n>Neto was een soort **\"contactpunt\"**.\n\nLosse zelfstandige naamwoorden (en soms ook werkwoorden) mag je altijd aan elkaar schrijven. Dit zijn *samenstellingen*. Lees hier meer: https://onzetaal.nl/taaladvies/samenstelling.\n\n>*Zo* kon ik tenminste weten of ze gezond en blij / *gelukkig* waren.\n\n>**Uiteindelijk** stopten de praatjes / *gesprekjes*.\n\n'Eindelijk' klinkt alsof je blij was dat het 'eindelijk' voorbij was, maar ik denk dat je dat hier niet bedoelt. 'praatjes' wordt eerder gebruikt om te verwijzen naar iemand die opschept, bijvoorbeeld: \"Hij zegt wel dat hij heel goed kan koken, maar geloof ik zijn dat gewoon praatjes.\" \n\n\nErg goed gedaan! :) Je gebruikt een hoop verschillende woorden. Let erop dat je zinnen in het Nederlands vaak aan elkaar kunt schrijven, vooral als je een verbindingswoord (maar, hoewel, dus, etc.) gebruikt.", "created_utc": "1632048364.0", "edited": "False", "id": "hdg5qdg", "is_submitter": "False", "link_id": "t3_pqkkp1", "parent_id": "t3_pqkkp1", "score": "2", "subreddit": "WriteStreakNL", "subreddit_id": "t5_3g5eo9"}, {"author": "CrashingFirefly", "body": "Muito obrigado por as correções e sugestões! :)", "created_utc": "1632046332.0", "edited": "False", "id": "hdg35ql", "is_submitter": "True", "link_id": "t3_pp9a15", "parent_id": "t1_hddqb7h", "score": "1", "subreddit": "WriteStreakPT", "subreddit_id": "t5_2gdmbs"}, {"author": "CrashingFirefly", "body": "Obrigado por corrigires o meu texto! :)", "created_utc": "1632046240.0", "edited": "False", "id": "hdg31mo", "is_submitter": "True", "link_id": "t3_ppw6jc", "parent_id": "t1_hddbe4s", "score": "1", "subreddit": "WriteStreakPT", "subreddit_id": "t5_2gdmbs"}, {"author": "CrashingFirefly", "body": ">Heel goed gedaan, het lijkt bijna alsof Portugees jouw moedertaal is (ik ben Nederlands aan het leren, sorry voor de foutjes).\n\nEnorm bedankt, dat is een groot compliment! En het is niet nodig om je te verontschuldigen, want wat je hebt geschreven bevat geen enkele fout. Goed bezig! :)\n\n>Obrigada por me dares a conhecer a palavra koukleum, também não conhecia e acho que a vou passar a usar (faz demasiado frio para mim aqui na Holanda :p )\n\nGostaria de negar isto, mas infelizmente, sim ;) Se não se importas, onde é que vives na Holanda? Só por curosidade! Estás ativo no WriteStreakNL?", "created_utc": "1632046089.0", "edited": "False", "id": "hdg2uyq", "is_submitter": "True", "link_id": "t3_pqlfmw", "parent_id": "t1_hdd9fkv", "score": "2", "subreddit": "WriteStreakPT", "subreddit_id": "t5_2gdmbs"}, {"author": "CrashingFirefly", "body": "Ah, fixe, vivias na Holanda que conheces estas palavras? :) Sim, 'borrel' também não se deixe traduzir facilmente, mas talvez *convívio* chega?", "created_utc": "1631980877.0", "edited": "False", "id": "hdcf4lg", "is_submitter": "True", "link_id": "t3_pqlfmw", "parent_id": "t1_hdbp77k", "score": "1", "subreddit": "WriteStreakPT", "subreddit_id": "t5_2gdmbs"}, {"author": "CrashingFirefly", "body": "Obrigado por leres e corrigires o meu texto! :)\n\n>Desculpa a demora!\n\nNão peças desculpa! Estou muito grato com os/as corretores, mas não é um dever e não espero que sempre tivessem tempo ;)", "created_utc": "1631965307.0", "edited": "False", "id": "hdbkaed", "is_submitter": "True", "link_id": "t3_pon2qy", "parent_id": "t1_hd9hkud", "score": "2", "subreddit": "WriteStreakPT", "subreddit_id": "t5_2gdmbs"}, {"author": "CrashingFirefly", "body": "Muito obrigado por corrigires o meu texto! :)\n\nTu adicionaste 'eu' porque nessas frases não é óbvio de quem (eu ou o meu avô) estou a falar, certo?\n\n>modo picuinhas\n\nBoa, não conhecia esta palavra, fixe! :D", "created_utc": "1631816724.0", "edited": "False", "id": "hd3yoji", "is_submitter": "True", "link_id": "t3_pnytcd", "parent_id": "t1_hd2xnwj", "score": "1", "subreddit": "WriteStreakPT", "subreddit_id": "t5_2gdmbs"}, {"author": "CrashingFirefly", "body": "Cheers for the feedback!\n\n>I'ld list the chinups/pullups as a T2, even if you currently only have the strength for the T1 range so that your focus is building those up to 6-10 reps\n\nI don't understand this one though.. What do you mean exactly? :) I can do 3x10 reps unweighted, but I'd like to focus on improving the weighted chin-up low reps so this is why I have it programmed as both T1 and T2. Do you suggest removing the T1 altogether?\n\n>Bends my brain that your bench is 65kg but you can do weighted dips\n>Same with weighted chin-ups showing up\n\nMy main focus before weightlifting was callisthenics and I trained a lot with rings, so I believe that might have contributed to having a strong basis in these bodyweight exercises.", "created_utc": "1631692813.0", "edited": "False", "id": "hcxcywf", "is_submitter": "False", "link_id": "t3_pnx0xz", "parent_id": "t1_hcw1yt7", "score": "1", "subreddit": "gzcl", "subreddit_id": "t5_33j1o"}, {"author": "CrashingFirefly", "body": "Yes, exactly, in the case of OHP and chin-up.", "created_utc": "1631633618.0", "edited": "False", "id": "hctxcy3", "is_submitter": "False", "link_id": "t3_pnx0xz", "parent_id": "t1_hctp8m9", "score": "1", "subreddit": "gzcl", "subreddit_id": "t5_33j1o"}, {"author": "CrashingFirefly", "body": "I am currently running GZCLP for already about 4-5 months. So far, I enjoy the program and I see progress especially in the T1 and T2 movements. In my program, I like to give some additional focus to (weighted) bodyweight exercises, so this is why I also programmed in the chin-up/pull-up (-> I alternate the hand position with every reset) and dips. I am currently trying to slowly gain weight and improve my RMs, whilst also working as much as I can on my form in the compound movements. I do all exercises in superset format (i.e. T3a/b/c). Current stats: 75/42.5/65/115 S/O/B/D (in kg's) (M/25y). \n\nThis is my current GZCLP set-up:\n\nA1 – Squat\n\n* T1: Backsquat\n* T2a: Bench press\n* T2b: Pendlay row\n* T3a: Single-leg extension\n* T3b: Single-leg leg curl\n* T3c: Lateral pulldown (cable)\n\nB1 – OHP & Chin-up/Pull-up\n\n* T1a: OHP\n* T1b: Chin-up/Pull-up\n* T2: Conventional deadlift\n* T3a: Triceps pushdown (cable)\n* T3b: Bicep curl (dumbbell)\n* T3c: Incline bench press (dumbbell)\n\nA2 – Bench\n\n* T1: Bench\n* T2a: Backsquat\n* T2b: Weighted (chest) dips\n* T3a: Lateral raises (dumbbell)\n* T3b: Iso-lateral row (machine)\n* T3c: Chest fly (machine)\n\nB2 – Bench\n\n* T1: Deadlift\n* T2a: OHP\n* T2b: Weighted chin-up (light)\n* T3a: Triceps extension (cable)\n* T3b: Bicep curl (EZ-bar)\n\nQuestions: \n\n* Do you have any suggestions or feedback on this program? Do you suggest replacing certain exercises with others? \n* How is the balance between push/pull?\n* Should I choose a variation of the compound lift (e.g. close-grip bench for T2) instead of doing the same lift, or doesn't it matter that much?\n\nThanks in advance!", "created_utc": "1631624059.0", "edited": "False", "id": "hctbls1", "is_submitter": "False", "link_id": "t3_pnx0xz", "parent_id": "t3_pnx0xz", "score": "1", "subreddit": "gzcl", "subreddit_id": "t5_33j1o"}, {"author": "CrashingFirefly", "body": "Obrigado pelas correções! :)", "created_utc": "1631617439.0", "edited": "False", "id": "hct0qfm", "is_submitter": "True", "link_id": "t3_pncq21", "parent_id": "t1_hcsrv2t", "score": "1", "subreddit": "WriteStreakPT", "subreddit_id": "t5_2gdmbs"}, {"author": "CrashingFirefly", "body": "Muito obrigado! :)", "created_utc": "1631550810.0", "edited": "False", "id": "hcpi8eg", "is_submitter": "True", "link_id": "t3_pmtcq9", "parent_id": "t1_hcottsa", "score": "2", "subreddit": "WriteStreakPT", "subreddit_id": "t5_2gdmbs"}, {"author": "CrashingFirefly", "body": "Obrigado por corrigires o meu texto! :)", "created_utc": "1631539763.0", "edited": "False", "id": "hcosfwx", "is_submitter": "True", "link_id": "t3_pmbii5", "parent_id": "t1_hcof40g", "score": "1", "subreddit": "WriteStreakPT", "subreddit_id": "t5_2gdmbs"}, {"author": "CrashingFirefly", "body": "Obrigado a vocês dois! :)", "created_utc": "1631380956.0", "edited": "False", "id": "hcgg3fq", "is_submitter": "True", "link_id": "t3_plk5ki", "parent_id": "t1_hcd2vq4", "score": "2", "subreddit": "WriteStreakPT", "subreddit_id": "t5_2gdmbs"}, {"author": "CrashingFirefly", "body": "Ou seja: Um *meme*, se faz mais sentido", "created_utc": "1631266054.0", "edited": "False", "id": "hcaiw8j", "is_submitter": "True", "link_id": "t3_pkv1ib", "parent_id": "t1_hcaiupl", "score": "2", "subreddit": "WriteStreakPT", "subreddit_id": "t5_2gdmbs"}, {"author": "CrashingFirefly", "body": "Mais uma vez, obrigado por corrigires o meu texto! :)\n\n>Comentário: Não entendi muito bem o que querias dizer aqui, querias dizer que é um programa muito visto pelos portugueses ou algo assim?\n\nQueria dizer que é um programa que, se calhar (?), é considerado um pouco 'tacky', mas sendo na televisão por tanto tempo tornou-se um tipo de 'cult classic' (não sei uma melhora maneira para dizer isso). Aliás, isso é o sensação com fica, depois tenho lido alguns posts, por exemplo, aqui no Reddit (r/Portugal).", "created_utc": "1631266015.0", "edited": "False", "id": "hcaiupl", "is_submitter": "True", "link_id": "t3_pkv1ib", "parent_id": "t1_hc8fa5d", "score": "2", "subreddit": "WriteStreakPT", "subreddit_id": "t5_2gdmbs"}, {"author": "CrashingFirefly", "body": "Obrigado pelas correções e sugestões! :)\n\n>Não fazia ideia de que a grande produção de vacas nas ilhas fosse devido a isso, texto interessante, gostei! Bom trabalho.\n\nBem, provavelmente há muitos outros motivos (económicos) também, mas isso é que o meu supervisor me contou. \n\n>Em caso de dúvidas tentarei responder.\n\nNão, acho que não! Com algumas coisas, por exemplo a diferença entre razão/motivo, tenho algumas dúvidas mas acho que não é muito que podes explicar sobre isso; simplesmente é preciso mais experiência para entender o contexto em que utilizamos uma ou outra.", "created_utc": "1631180128.0", "edited": "False", "id": "hc5vkn2", "is_submitter": "True", "link_id": "t3_pkkqmu", "parent_id": "t1_hc4dz47", "score": "2", "subreddit": "WriteStreakPT", "subreddit_id": "t5_2gdmbs"}, {"author": "CrashingFirefly", "body": "Obrigado por corrigires o meu texto! \n\n>O que é FOMO? não entendi o que querias dizer por isso não corrigi.\n\nFOMO = Fear Of Missing Out. Desculpe, devia ter explicado a significação da sigla! Acho que esta é um termo que não deve ser traduzido, certo?\n\n> Muito bem, estás a melhorar rápido!\n\nObrigado pelo elogio! Infelizmente, não parece-me assim haha. Ainda faço muitos erros simples; provavelmente tenho de prestar mais atenção quando escrevesse.", "created_utc": "1631103925.0", "edited": "False", "id": "hc1u01x", "is_submitter": "True", "link_id": "t3_pj9s71", "parent_id": "t1_hbval3u", "score": "2", "subreddit": "WriteStreakPT", "subreddit_id": "t5_2gdmbs"}, {"author": "CrashingFirefly", "body": "Obrigado! :) Também parece um livro interessante, vou ver se esteja disponível na minha biblioteca.", "created_utc": "1631103591.0", "edited": "False", "id": "hc1teyo", "is_submitter": "True", "link_id": "t3_pjxpyi", "parent_id": "t1_hc12exd", "score": "1", "subreddit": "WriteStreakPT", "subreddit_id": "t5_2gdmbs"}, {"author": "CrashingFirefly", "body": "Muito obrigado mais uma vez! :)", "created_utc": "1631103444.0", "edited": "False", "id": "hc1t5sd", "is_submitter": "True", "link_id": "t3_pjxpyi", "parent_id": "t1_hbzorfa", "score": "2", "subreddit": "WriteStreakPT", "subreddit_id": "t5_2gdmbs"}, {"author": "CrashingFirefly", "body": "Muito obrigado pelo feedback! :) Desculpe por não responder e agradecer mais logo.\n\n>Aqui nesta frase eu substituí o \"Além disso\" porque já tinhas usado essa expressão no inicio da frase anterior ficando então muito repetitivo. Sempre me ensinaram para não começar duas frases seguidas com a mesma expressão, lembra-te disso.\n\nBoa suggestão! Tive o mesmo sentimento, mas não conhecia outras maneiras de dizer isso, obrigado.", "created_utc": "1631103236.0", "edited": "False", "id": "hc1st6q", "is_submitter": "True", "link_id": "t3_pilsgq", "parent_id": "t1_hbv5fai", "score": "2", "subreddit": "WriteStreakPT", "subreddit_id": "t5_2gdmbs"}, {"author": "CrashingFirefly", "body": "Obrigado, Dani! Vejo que já respondeste a minha pergunta ao r/Husjuky, sobre a utilização de banda/trilha sonora :)", "created_utc": "1630878058.0", "edited": "False", "id": "hbqguqt", "is_submitter": "True", "link_id": "t3_pi0el0", "parent_id": "t1_hbqbzzm", "score": "2", "subreddit": "WriteStreakPT", "subreddit_id": "t5_2gdmbs"}, {"author": "CrashingFirefly", "body": "Obrigado por corrigires o meu texto!\n\nJa tive dúvidas sobre a utilização da palavra ´cru´; é só que tanto no inglês quanto no holandês (minha língua materna) é uma maneira de nos expressar.\n\nJá agora, o termo ´trilha sonora´ faz sentido? Segundo o dicionário, este é um termo brasileiro. Também usa-se este termo em Portugal?", "created_utc": "1630877916.0", "edited": "False", "id": "hbqgjyj", "is_submitter": "True", "link_id": "t3_pi0el0", "parent_id": "t1_hbq3g13", "score": "2", "subreddit": "WriteStreakPT", "subreddit_id": "t5_2gdmbs"}, {"author": "CrashingFirefly", "body": "Obrigado pela explicação pormenorizada! \n\n> Neste tipo de exercício, há sempre muitos elementos que podes utilizar na resposta, tens de te treinar para tirar o melhor partido do que está disponível ;)\n\nBoa dica! Tens toda a razão, quando pudesses utilizar palavras já dadas no exercício é um desperdício de não fazer isso.", "created_utc": "1630877531.0", "edited": "False", "id": "hbqfpto", "is_submitter": "True", "link_id": "t3_phapqj", "parent_id": "t1_hbo7pca", "score": "1", "subreddit": "WriteStreakPT", "subreddit_id": "t5_2gdmbs"}, {"author": "CrashingFirefly", "body": "Obrigado pelas correções e sugestões, Dani! :)\n\nPoderia perguntar por que é que propuseste 'rua' em vez de 'estrada'? O que dirias que é a diferença entre as duas? Ou é devido ao facto que 'rua' também é utilizado na descrição?", "created_utc": "1630791719.0", "edited": "False", "id": "hbm76wr", "is_submitter": "True", "link_id": "t3_phapqj", "parent_id": "t1_hbkvz5h", "score": "1", "subreddit": "WriteStreakPT", "subreddit_id": "t5_2gdmbs"}, {"author": "CrashingFirefly", "body": "Obrigado por fazeres estas correções! :)\n\n>Assim que os cientistas mudarem as nossas papilas gustativas e fizerem os vegetais saberem a doces, acho que o problema de alimentação pouco saudável vai desaparecer : )\n\nTemo que tivesses razão, mas acho que o problema é mais ligado a nossa cultura do que o desenvolvimento científico.", "created_utc": "1630692843.0", "edited": "False", "id": "hbh4rmd", "is_submitter": "True", "link_id": "t3_pgnelx", "parent_id": "t1_hbgg85s", "score": "2", "subreddit": "WriteStreakPT", "subreddit_id": "t5_2gdmbs"}, {"author": "CrashingFirefly", "body": "Muito obrigado por todas as sugestões! :)\n\n>Era o que querias dizer?\n\nSim! Tive dificuldade em construir essa frase..", "created_utc": "1630656824.0", "edited": "False", "id": "hbf8ac6", "is_submitter": "True", "link_id": "t3_pg1f05", "parent_id": "t1_hbf2evo", "score": "1", "subreddit": "WriteStreakPT", "subreddit_id": "t5_2gdmbs"}, {"author": "CrashingFirefly", "body": "Muito obrigado pelas sugestões adicionais - e também obrigado à Dani! \n\n>em menor medida\n\nEntão, devia utilizar esta expressão ou soa estranho? Visto que não reconheceste esta expressão, posso imaginar que não é muito usado na língua quotidiana, correto?", "created_utc": "1630525600.0", "edited": "False", "id": "hb86ph4", "is_submitter": "True", "link_id": "t3_pfb0bm", "parent_id": "t1_hb5xpln", "score": "1", "subreddit": "WriteStreakPT", "subreddit_id": "t5_2gdmbs"}, {"author": "CrashingFirefly", "body": "Obrigado por corrigires o meu texto! \n\n>Faz sentido ser popular nos países do Mediterrâneo, lembro-me de ter lido que era já um petisco no tempo dos romanos : )\n\nUau, não sabia! Isto é um vestígio bem mais importante do que a construção do Coliseu. No entanto, tenho o sentimento (mas é bastante infundado) que o tremoço é ainda mais popular em Portugal do que, por exemplo, a Espanha.", "created_utc": "1630483842.0", "edited": "False", "id": "hb5w2te", "is_submitter": "True", "link_id": "t3_pfb0bm", "parent_id": "t1_hb5v5wl", "score": "2", "subreddit": "WriteStreakPT", "subreddit_id": "t5_2gdmbs"}, {"author": "CrashingFirefly", "body": "Ah, percebo! Obrigado por explicares. Tomar um pequeno-almoço é, na verdade, não muito incomum. \n\n>Quanto à frequência de utilização de palavras como \"assaz\", recomendo que pesquises no google \"palavra\" site:.pt e vejas o número de ocorrências e o tipo de frase, de texto e de página em que são utilizadas.\n\nBoa dica! :) Embora a palavra 'assaz' ainda parece assaz (desculpe) frequente no internet, mas como tu disseste, também é importante ver as páginas em que é utilizada.", "created_utc": "1630483534.0", "edited": "False", "id": "hb5vqfk", "is_submitter": "True", "link_id": "t3_peguyk", "parent_id": "t1_hb5okl3", "score": "1", "subreddit": "WriteStreakPT", "subreddit_id": "t5_2gdmbs"}, {"author": "CrashingFirefly", "body": "Muito obrigado, Dani! :)\n\n>Ou seja, acordaste de uma crise de sonambulismo e estavas num café. \n\nNão percebo o que queres dizer aqui. \"Dei por mim\" não faz sentido neste contexto?\n\n>Garanto-te que a grande maioria dos portugueses desconhece a palavra \"assaz\".\n\nAh, okay, boa de saber! Quando um encontro uma nova palavra, é difícil saber quão comum ela é. Por isso, experimento aqui e apreço muito a tua feedback :)", "created_utc": "1630444144.0", "edited": "False", "id": "hb3u5r6", "is_submitter": "True", "link_id": "t3_peguyk", "parent_id": "t1_hb3rvnk", "score": "1", "subreddit": "WriteStreakPT", "subreddit_id": "t5_2gdmbs"}, {"author": "CrashingFirefly", "body": "Ah, fixe! Ambas boas opções :) Porque estes lugares? Para as programas que têm, ou tem mais a ver com as cidades próprias? Só visitei Coimbra uma vez, mas pelo que vi, a cidade practicamente respira a vida estudantil. Espero que tudo funcionasse para ti! \n\n>Já agora, como é que estás a correr o teu estágio? Estás a gostar?\n\nSim, obrigado por perguntares! Gosto muito de estar aqui, mas ainda preciso algum tempo para criar uma rede social (acho mais díficil do que, por exemplo, com um intercâmbio Erasmus+).", "created_utc": "1630432557.0", "edited": "False", "id": "hb32dcw", "is_submitter": "False", "link_id": "t3_pal9xz", "parent_id": "t1_haaw4rs", "score": "2", "subreddit": "WriteStreakPT", "subreddit_id": "t5_2gdmbs"}, {"author": "CrashingFirefly", "body": "Ah, obrigado por esclareceres! :)", "created_utc": "1630432259.0", "edited": "False", "id": "hb31mio", "is_submitter": "True", "link_id": "t3_p8y52v", "parent_id": "t1_hax5zey", "score": "1", "subreddit": "WriteStreakPT", "subreddit_id": "t5_2gdmbs"}, {"author": "CrashingFirefly", "body": "Bom dia! Peço desculpe por não te ter agredecido pelas explicações e correções. Como é que posso distinguir entre farmácias e parafarmácias? Está escrito nas tabuletas? Parece-me que todas têm a cruz verde.", "created_utc": "1630325552.0", "edited": "False", "id": "hax4lh7", "is_submitter": "True", "link_id": "t3_p8y52v", "parent_id": "t1_ha0baa7", "score": "1", "subreddit": "WriteStreakPT", "subreddit_id": "t5_2gdmbs"}, {"author": "CrashingFirefly", "body": "Obrigado pela reação! Sim, este é também o sentimento que tenho, mas não sei se será possível de entrar nos clubes só por um tempo curto. Vou enviar um MP!", "created_utc": "1630007106.0", "edited": "False", "id": "hagquhj", "is_submitter": "True", "link_id": "t3_pbbtzw", "parent_id": "t1_hacjaem", "score": "1", "subreddit": "portugal", "subreddit_id": "t5_2qmie"}, {"author": "CrashingFirefly", "body": "Hm, se tu dizes ;) Mas acho que não é tão simples, não há muitos jovens (neste momento) e pode ser difícil de encontrar uma 'abertura' social.", "created_utc": "1630006940.0", "edited": "False", "id": "hagqfgz", "is_submitter": "True", "link_id": "t3_pbbtzw", "parent_id": "t1_haf9pa3", "score": "1", "subreddit": "portugal", "subreddit_id": "t5_2qmie"}, {"author": "CrashingFirefly", "body": "Sim, diria que é o app mais usado para online dating (aliás, entre jovens). Eu até diria que, neste momento (pois, também devido ao Covid), Tinder é a maneira mais usado para encontrar pessoas.", "created_utc": "1630005362.0", "edited": "False", "id": "hagmhp3", "is_submitter": "True", "link_id": "t3_pbbtzw", "parent_id": "t1_haflufi", "score": "2", "subreddit": "portugal", "subreddit_id": "t5_2qmie"}, {"author": "CrashingFirefly", "body": "Obrigado por explicares! Hm, na minha experiência até agora não é tão fácil, tenho o sentimento que as pessoas não são super abertas (mas bem simpáticas!); talvez precisa mais tempo", "created_utc": "1629923898.0", "edited": "False", "id": "hac7oiy", "is_submitter": "True", "link_id": "t3_pbbtzw", "parent_id": "t1_hac5yeg", "score": "3", "subreddit": "portugal", "subreddit_id": "t5_2qmie"}, {"author": "CrashingFirefly", "body": "Quase, nós referimos a estes três países com a palavra Benelux (Bélgica, *Nederland*, Luxemburgo) - não somos muitos creativos em engendrar nomes. De acordo com a página no Wikipedia, em português também se utiliza a palavra Benelux.", "created_utc": "1629919369.0", "edited": "False", "id": "habw7v1", "is_submitter": "True", "link_id": "t3_pbbtzw", "parent_id": "t1_habduml", "score": "6", "subreddit": "portugal", "subreddit_id": "t5_2qmie"}, {"author": "CrashingFirefly", "body": ">arrumar uma rapariga\n\nHmm, isto provavelmente é uma expressão calão, mas tenho de perguntar: O que significa 'arrumar uma rapariga'? Desculpe, mas a tua resposta não faz sentido nenhum a mim haha", "created_utc": "1629914672.0", "edited": "False", "id": "habki1b", "is_submitter": "True", "link_id": "t3_pbbtzw", "parent_id": "t1_habk3bi", "score": "3", "subreddit": "portugal", "subreddit_id": "t5_2qmie"}, {"author": "CrashingFirefly", "body": ">Não sabes de onde vens, não é Holanda é Países Baixos.\n\nTens razão! ;)\n\n>Agora a sério, não sou dos Açores, mas diria para tentares ver o que o pessoal costuma fazer por aí, visto já estares a morar com portugueses talvez te consigam dar umas dicas, podes também tentar procurar algum trabalho voluntário ou associações que tenham algumas atividades do teu interesse.\n\nObrigado, boa dica! Também pensava em arranjar um emprego simples para conhecer gente, mas não quero interferir com o mercado de trabalho local (que talvez não é óptimo) só porque eu estou à procura de interação social. O que achas disso?\n\n>Já agora, não sei quando começaste a aprender a falar português mas não parece nada mau!\n\nMuito obrigado! Ainda tenho um longo caminha para percorrer, mas aprendo muito aqui com a imersão na língua :) Mas tenho de admitir que o sotaque terceirense não é uma boa ajuda...", "created_utc": "1629911393.0", "edited": "False", "id": "habcbrj", "is_submitter": "True", "link_id": "t3_pbbtzw", "parent_id": "t1_haba2ic", "score": "4", "subreddit": "portugal", "subreddit_id": "t5_2qmie"}, {"author": "CrashingFirefly", "body": "Haha, não é uma pergunta muito incomum, já encontrei-me com esta pergunta várias vezes! ;)\n\nMas para responder: O termo 'correto' é Países Baixos. No entanto, visto que encontro a palavra 'Holanda' mais frequente (também nos formulários oficiais) do que 'Países Baixos', e porque tenho o sentimento que 'Holanda' é a forma mais 'informal' de referir ao meu país, prefiro de usar esta palavra. Tenho de acrescentar que, por norma, os holandeses não se importam muito sobre a distinção.", "created_utc": "1629911128.0", "edited": "False", "id": "habbny0", "is_submitter": "True", "link_id": "t3_pbbtzw", "parent_id": "t1_hab8a09", "score": "9", "subreddit": "portugal", "subreddit_id": "t5_2qmie"}, {"author": "CrashingFirefly", "body": ">Não és fluente em português e já escreves assim? O google translator já deve estar muito evoluído.\n\nObrigado, aceito isso como um elogio! 'fluente' é um termo confuso, mas só queria dizer que ainda não sinto-me 100% comfortável em falar português. Mas força nisso!\n\n>Quanto a sugestões, procura um grupo de Erasmus (ESN) ou Associação de estudantes da Universidade ou grupos no facebook/instagram, clubes desportivos de algo que gostes de fazer/praticar, voluntariado\n\nObrigado pelas boas sugestões! Não pensava sobre o ESN, mas isso é mesma uma boa ideia. \n\n>tenta no Tinder lol\n\nLol, já tentei, mas parece-me que não é muito popular aqui (ou simplesmente estou sem sorte)", "created_utc": "1629907473.0", "edited": "False", "id": "hab2ire", "is_submitter": "True", "link_id": "t3_pbbtzw", "parent_id": "t1_haayv00", "score": "8", "subreddit": "portugal", "subreddit_id": "t5_2qmie"}, {"author": "CrashingFirefly", "body": "Obrigado pela resposta e a tua sugestão!\n\n>Bom, é de uma pequena ilha, no meio do Oceano, que estamos a falar... Tens que ajustar um bocado a expectativas em relação ao que existirá... (Krav Maga e Breakdance, tenho dúvidas)\n\nSim, claro, tens razão! Neste sentido, estou aberto para experimentar novas coisas e não espero que pudesse fazer as mesmas coisas que na Holanda (e também prefiro experiencar mais a vida local).", "created_utc": "1629903783.0", "edited": "False", "id": "haatgm8", "is_submitter": "True", "link_id": "t3_pbbtzw", "parent_id": "t1_haan7ry", "score": "3", "subreddit": "portugal", "subreddit_id": "t5_2qmie"}, {"author": "CrashingFirefly", "body": "Bom trabalho e muito inspirador! Onde é que tu tens a intenção de estudar em Portugal? :)", "created_utc": "1629827104.0", "edited": "False", "id": "ha6rcqz", "is_submitter": "False", "link_id": "t3_pal9xz", "parent_id": "t3_pal9xz", "score": "4", "subreddit": "WriteStreakPT", "subreddit_id": "t5_2gdmbs"}, {"author": "CrashingFirefly", "body": "I just ended my 6-day stay in Mid-Atlantic Boutique Hostel in Angra (Terceira). Definitely can recommend! Very friendly owner and perfect location. It might not be bustling with people in September though (but it will be less crowded anyways in the Azores after August). I haven't visited any other islands yet (I'll be staying here for a while though), so I can't give you any other tips. Enjoy your stay in the Azores!", "created_utc": "1629640640.0", "edited": "False", "id": "h9wr7v0", "is_submitter": "False", "link_id": "t3_p9cjji", "parent_id": "t3_p9cjji", "score": "1", "subreddit": "azores", "subreddit_id": "t5_2solj"}, {"author": "CrashingFirefly", "body": "Obrigado pelas correções, Dani! :)", "created_utc": "1629321755.0", "edited": "False", "id": "h9gei24", "is_submitter": "True", "link_id": "t3_p5i8ne", "parent_id": "t1_h9a0vcw", "score": "1", "subreddit": "WriteStreakPT", "subreddit_id": "t5_2gdmbs"}, {"author": "CrashingFirefly", "body": "Obrigado por me corrigires! :)\n\nSim, a história própria é divertida, mas não sou um grande fã do estilo do autor. No entanto, a teoria que tu estás a descrever soa ainda mais particular!", "created_utc": "1629127342.0", "edited": "False", "id": "h960ew8", "is_submitter": "True", "link_id": "t3_p4v4yf", "parent_id": "t1_h94qk1b", "score": "1", "subreddit": "WriteStreakPT", "subreddit_id": "t5_2gdmbs"}, {"author": "CrashingFirefly", "body": "Obrigado, Dani!\n\nSim, tenhas razão; devia ter mais cuidado com os acentos. Vou utilizar mais o dicionário!", "created_utc": "1629127062.0", "edited": "False", "id": "h95zq1p", "is_submitter": "True", "link_id": "t3_p4v4yf", "parent_id": "t1_h95c1ij", "score": "1", "subreddit": "WriteStreakPT", "subreddit_id": "t5_2gdmbs"}, {"author": "CrashingFirefly", "body": "Obrigado por fazeres as correções! \n\n>Demasiado calão, não soa natural 😁 A frase está correta mas neste   \ncontexto mais vale dizer \"à procura\" em vez de \"à cata\" (Mas admiro o   \nteu estilo)\n\nOkay, bom de saber! Gosto de experimentar com calão até alguém me corrige :)\n\n>Concordo, também ando a tentar ser minimalista desde os últimos 3 ou 4 anos (mas torna-se mais difícil quando não se vive sozinho).\n\nHaha, consigo imaginar! É muito mais difícil quando o parceiro tiver uma outra ideia sobre o que é preciso.. \n\n>Estou curioso com o que os minimalistas fazem nesta situação: o que fazer a prendas que te dão e de que não gostas? : P\n\nHm, isso é difícil... Talvez a melhor coisa que podes fazer é comunicar com amigos e familiares que preferes prendas que não duram (se isso faz sentido), como alimento ou vinho.", "created_utc": "1629052303.0", "edited": "False", "id": "h926tx4", "is_submitter": "True", "link_id": "t3_p49p2n", "parent_id": "t1_h90ekcp", "score": "2", "subreddit": "WriteStreakPT", "subreddit_id": "t5_2gdmbs"}, {"author": "CrashingFirefly", "body": "Obrigado por corrigires o meu texto! :)\n\nSim, mas talvez eu adicionei isso (o carvalho) haha, não estou certo disso", "created_utc": "1628953768.0", "edited": "False", "id": "h8x23cu", "is_submitter": "True", "link_id": "t3_p3mmqd", "parent_id": "t1_h8w7a7a", "score": "1", "subreddit": "WriteStreakPT", "subreddit_id": "t5_2gdmbs"}, {"author": "CrashingFirefly", "body": "Muito obrigado pelas correções, Dani! :)\n\n(E obrigado para explicares como funciona em Portugal ;) )", "created_utc": "1628953667.0", "edited": "False", "id": "h8x1vbw", "is_submitter": "True", "link_id": "t3_p3mmqd", "parent_id": "t1_h8w7dm1", "score": "1", "subreddit": "WriteStreakPT", "subreddit_id": "t5_2gdmbs"}, {"author": "CrashingFirefly", "body": "Sim, já vi muitos memes sobre o migualense! ;) No entanto, a minha destinação é Terceira, pois talvez seja mais fácil lá - pelo que ouvi o sotaque terceirense não é tão forte.\n\nObrigado! :)", "created_utc": "1628858125.0", "edited": "False", "id": "h8rzls6", "is_submitter": "True", "link_id": "t3_p1la7z", "parent_id": "t1_h8rrjix", "score": "1", "subreddit": "Portuguese", "subreddit_id": "t5_2sqn7"}, {"author": "CrashingFirefly", "body": "Muito obrigado por corrigires o meu texto! :)\n\n>para os Açores\n\nIsto deixa-me sempre atarantado.. Quando é preciso usar 'à' ou 'para'?", "created_utc": "1628858011.0", "edited": "False", "id": "h8rzeld", "is_submitter": "True", "link_id": "t3_p36zw6", "parent_id": "t1_h8rhz7g", "score": "1", "subreddit": "WriteStreakPT", "subreddit_id": "t5_2gdmbs"}, {"author": "CrashingFirefly", "body": "Obrigado por revirares o texto! :)", "created_utc": "1628793615.0", "edited": "False", "id": "h8oqdbk", "is_submitter": "True", "link_id": "t3_p28l1z", "parent_id": "t1_h8n6lk9", "score": "2", "subreddit": "WriteStreakPT", "subreddit_id": "t5_2gdmbs"}, {"author": "CrashingFirefly", "body": "Muito obrigado por corrigires o meu texto! :)\n\nNão sei porque sempre quero conjugar o verbo 'dizer' numa forma tão estranha... Devo ter mais cuidado.", "created_utc": "1628754152.0", "edited": "False", "id": "h8mo9s6", "is_submitter": "True", "link_id": "t3_p1xhde", "parent_id": "t1_h8k71l5", "score": "2", "subreddit": "WriteStreakPT", "subreddit_id": "t5_2gdmbs"}, {"author": "CrashingFirefly", "body": "Muito obrigado por corrigires o meu texto! :) \n\n>Como já mencionaste que eras holandês aqui tens um equivalente: je moet niet een gegeven paard in de bek kijken -> a cavalo dado não se olha o dente\n\nHaha, ótimo! Adoro este provérbio, não sabia que também existe em português.", "created_utc": "1628669386.0", "edited": "False", "id": "h8ifcnm", "is_submitter": "True", "link_id": "t3_p1aj3f", "parent_id": "t1_h8gawt7", "score": "2", "subreddit": "WriteStreakPT", "subreddit_id": "t5_2gdmbs"}, {"author": "CrashingFirefly", "body": "Haha, lembras-te! :) Sim, vou aos Açores daqui em uma semana por 4 meses para fazer um estágio com a universidade aí; estou muito ansioso para ir!", "created_utc": "1628617023.0", "edited": "False", "id": "h8fna64", "is_submitter": "True", "link_id": "t3_p1la7z", "parent_id": "t1_h8fl8wt", "score": "2", "subreddit": "Portuguese", "subreddit_id": "t5_2sqn7"}, {"author": "CrashingFirefly", "body": "Obrigado pela sugestão! :) Aliás, é bastante caro.. Quando estou em Portugal, vou buscar este livro nas livrarias.", "created_utc": "1628614136.0", "edited": "False", "id": "h8fgdmy", "is_submitter": "True", "link_id": "t3_p1la7z", "parent_id": "t1_h8e9x3n", "score": "1", "subreddit": "Portuguese", "subreddit_id": "t5_2sqn7"}, {"author": "CrashingFirefly", "body": "Obrigado por me corrigires! :)", "created_utc": "1628614021.0", "edited": "False", "id": "h8fg3kz", "is_submitter": "True", "link_id": "t3_p1la7z", "parent_id": "t1_h8eetju", "score": "1", "subreddit": "Portuguese", "subreddit_id": "t5_2sqn7"}, {"author": "CrashingFirefly", "body": ">Dicionário Aberto de Calão e Expressões Idiomáticas\" de José João Almeida\n\nMuito obrigado pela sugestão! Ja encontrei o PDF online :)", "created_utc": "1628599900.0", "edited": "False", "id": "h8ekp55", "is_submitter": "True", "link_id": "t3_p1aj3f", "parent_id": "t1_h8efrdi", "score": "1", "subreddit": "WriteStreakPT", "subreddit_id": "t5_2gdmbs"}, {"author": "CrashingFirefly", "body": "Muito obrigado por corrigir o meu texto, Dani!", "created_utc": "1628540696.0", "edited": "False", "id": "h8btnlb", "is_submitter": "True", "link_id": "t3_p0mev7", "parent_id": "t1_h8azkg8", "score": "1", "subreddit": "WriteStreakPT", "subreddit_id": "t5_2gdmbs"}, {"author": "CrashingFirefly", "body": "Obrigado pela correção e sugestão!\n\n>Agora com K-pop e TikTok acho que isto está ainda mais na moda, o teu sonho está a tornar-se realidade : )\n\nHaha, lá isso é verdade! No entanto, pergunto-me se com essas danças a dança própria venha em primeiro lugar..", "created_utc": "1628453607.0", "edited": "False", "id": "h87fx50", "is_submitter": "True", "link_id": "t3_ozzrhq", "parent_id": "t1_h8634uw", "score": "1", "subreddit": "WriteStreakPT", "subreddit_id": "t5_2gdmbs"}, {"author": "CrashingFirefly", "body": "Obrigado por me corrigires! :)\n\n>Vivi muitos anos na Holanda, acho-os muito mais educados e respeitadores que os portugueses. No fundo depende sempre da personalidade de cada um : )\n\nLá isso é verdade. Fico feliz de ouvir que os meus conterrâneos tratavam-de ti bem ;) Talvez sejamos, em geral, mais educados, mas também acho que os portugueses são - sem dúvida - mais calorosos, algo que é refletido no linguagem quotidiana como rematar um e-mail (ou carta) com 'abraço' ou 'beijnhos'; mesma num contexto semi-formal.\n\n>Quanto à estratégia das raparigas portuguesas, deixa-me dizer-te, classic move, especialmente quando se está na escola 😅\n\nHaha, okay, bom de saber! Então espero que as estratégias mudam-se ao longo dos anos..", "created_utc": "1628323189.0", "edited": "False", "id": "h818kj7", "is_submitter": "True", "link_id": "t3_oz8k60", "parent_id": "t1_h7zkgye", "score": "1", "subreddit": "WriteStreakPT", "subreddit_id": "t5_2gdmbs"}, {"author": "CrashingFirefly", "body": "Thanks for your reply! :)\n\n>I feel like the video is slightly angled?\n\nAh, yes, could be! I tried to center it, but I'll make sure to pay more attention to it next time.\n\n>ideally there shouldn't be that much space at all, you should be trying to elevate your shoulder blades... like covering your ears with your biceps, \n\nSlightly unrelated maybe, but would it be advisable to therefore train HS without headphones? (since I'm training with them at the moment)\n\n>What happens when you make it a point to overcompensate for the tilt, and try your best to REALLY lengthen the side that's leaning more?\n\nSo far, I have mostly been trying to compensate by rotation, but I should probably focus more on lengthening the side indeed! \n\n>are you stretching out the ribs on that side\n\nWhat do you mean by this? I didn't know this was physically possible haha ;) Do you maybe have a video?\n\n>What happens when you move the more-leaned leg to meet the better leg, and keeping the better leg where it is?\n\nThanks, that's also a good suggestion. I guess I don't do it because I have become used to only balance/create a counterweight with the more-leaned leg. Do you have tips for practising this? Doing it with a back-to-wall HS?", "created_utc": "1628275305.0", "edited": "False", "id": "h7yszj9", "is_submitter": "True", "link_id": "t3_oz9psr", "parent_id": "t1_h7yrb7f", "score": "1", "subreddit": "handbalancing", "subreddit_id": "t5_2y4oa"}, {"author": "CrashingFirefly", "body": "Muito obrigado! :)\n> Sempre achei que trabalhar na área funerária fosse terrível kk\n\nSim, e não és a única pessoas que pensa assim! Normalmente, é a primeira coisa que pessoas dizem ;) Mas na verdade, não é tão triste como algumas imaginam e habituarás-te muito rápido à ideia de carregar um defunto nos ombros.", "created_utc": "1628190269.0", "edited": "False", "id": "h7ucihh", "is_submitter": "True", "link_id": "t3_oyjim1", "parent_id": "t1_h7ts9vm", "score": "2", "subreddit": "WriteStreakPT", "subreddit_id": "t5_2gdmbs"}, {"author": "CrashingFirefly", "body": "Obrigado por corrigires o meu texto! :)", "created_utc": "1628171302.0", "edited": "False", "id": "h7szkas", "is_submitter": "True", "link_id": "t3_oy29xw", "parent_id": "t1_h7shk7e", "score": "1", "subreddit": "WriteStreakPT", "subreddit_id": "t5_2gdmbs"}, {"author": "CrashingFirefly", "body": "Ah okay, obrigado por explicar!", "created_utc": "1628151519.0", "edited": "False", "id": "h7s6492", "is_submitter": "True", "link_id": "t3_oxc10u", "parent_id": "t1_h7s4y33", "score": "2", "subreddit": "WriteStreakPT", "subreddit_id": "t5_2gdmbs"}, {"author": "CrashingFirefly", "body": "Muito obrigado pelas correções adicionais, Dani!", "created_utc": "1628108753.0", "edited": "False", "id": "h7pyn85", "is_submitter": "True", "link_id": "t3_oxc10u", "parent_id": "t1_h7osqjp", "score": "1", "subreddit": "WriteStreakPT", "subreddit_id": "t5_2gdmbs"}, {"author": "CrashingFirefly", "body": "Muito obrigado pelas correções!\n\n>esta é interessante porque ninguém vai á rua concordar com restrições,   \nportanto se disser \"uma participação popular activa\" em relação a   \nrestrições é de supor que discordam\n\nSim, e não tive a intenção de supor que pessoas discordam com a política. É so que tenho a suspeita que, em alguns casos, o vírus tem sido usado para defender certas restrinções que, se calhar, não foram necessárias (pelo menos onde eu moro). \n\n>Em geral, dá para notar que sabes vocabulário que alguns nativos nem se preocupam em usar.\n\nAh, e isso é mal ou não? ;) Quais palavras achas invulgar de utilizar no dia-dia?", "created_utc": "1628108685.0", "edited": "False", "id": "h7pyhdv", "is_submitter": "True", "link_id": "t3_oxc10u", "parent_id": "t1_h7nlyzg", "score": "2", "subreddit": "WriteStreakPT", "subreddit_id": "t5_2gdmbs"}, {"author": "CrashingFirefly", "body": "Muito obrigado por me corrigires! E sim, concordo completamente: podemos fazer muito mais na esfera familiar. Pode soar piroso, mas tratar os outros em volta de nós com gentilidade pode dar mais jeito do que começar com mudar o mundo todo.", "created_utc": "1628019846.0", "edited": "False", "id": "h7l9pae", "is_submitter": "True", "link_id": "t3_owgllz", "parent_id": "t1_h7jlu8m", "score": "2", "subreddit": "WriteStreakPT", "subreddit_id": "t5_2gdmbs"}, {"author": "CrashingFirefly", "body": "Cheers, thanks a lot! Your advice is much appreciated. And will check out the channel you mentioned!", "created_utc": "1627978180.0", "edited": "False", "id": "h7j38rp", "is_submitter": "False", "link_id": "t3_ow8mq2", "parent_id": "t1_h7h8id8", "score": "1", "subreddit": "gzcl", "subreddit_id": "t5_33j1o"}, {"author": "CrashingFirefly", "body": "Although Fridays are dedicated to form checks, I believe I am also allowed to post these in the Daily Thread. If not, let me know! \n\nForm check back squat: [https://streamable.com/jpefer](https://streamable.com/jpefer)\n\nT1 - 3 x 50 Kg, after resetting (5RM = 57.5 Kg)\n\nAny input is very welcome! :) (And please don't mind my weird face expression, that's something in regards to 'form' I should maybe also work on)\n\nAlso, if you have comments on the way I have filmed, I'm happy to hear them. I'm not used to filming my lifts.", "created_utc": "1627918650.0", "edited": "False", "id": "h7ftwvz", "is_submitter": "False", "link_id": "t3_ow8mq2", "parent_id": "t3_ow8mq2", "score": "1", "subreddit": "gzcl", "subreddit_id": "t5_33j1o"}, {"author": "CrashingFirefly", "body": "Muito obrigado! :)", "created_utc": "1627891207.0", "edited": "False", "id": "h7encxh", "is_submitter": "True", "link_id": "t3_ovw3o9", "parent_id": "t1_h7cecb1", "score": "2", "subreddit": "WriteStreakPT", "subreddit_id": "t5_2gdmbs"}, {"author": "CrashingFirefly", "body": "Sim, isso mesmo! 'Meloso', obrigado :)", "created_utc": "1627807074.0", "edited": "False", "id": "h7aln1g", "is_submitter": "True", "link_id": "t3_out9zc", "parent_id": "t1_h78kmxd", "score": "1", "subreddit": "WriteStreakPT", "subreddit_id": "t5_2gdmbs"}, {"author": "CrashingFirefly", "body": "Uau, bem elaborado! Soa muito interesante, vou pôr este livro na minha lista. Julgas este livro bastante difícil (em termos de vocabulário ou estilo)?", "created_utc": "1627760063.0", "edited": "False", "id": "h78ge9u", "is_submitter": "False", "link_id": "t3_ov81h7", "parent_id": "t3_ov81h7", "score": "2", "subreddit": "WriteStreakPT", "subreddit_id": "t5_2gdmbs"}, {"author": "CrashingFirefly", "body": "Muito obrigado, Dani! Hm, com 'meigo' tentei de dizer 'mellow'. Quer dizer, estava a referir a 'muitas viagens, novas pessoas e momentos felizes', porque isto soa (a mim) muito, muito... okay, também não sei a palavra correta, nem em inglês quer em português haha", "created_utc": "1627759751.0", "edited": "False", "id": "h78fru1", "is_submitter": "True", "link_id": "t3_out9zc", "parent_id": "t1_h7841sl", "score": "1", "subreddit": "WriteStreakPT", "subreddit_id": "t5_2gdmbs"}, {"author": "CrashingFirefly", "body": "Ah, já percebo! :) Neste contexto, estive a referir a uma palavra tailandesa 'farang': uma pessoa da América ou Europa. Portanto, talvez não faz sentido aqui, mas é sempre útil conhecer novas palavras.", "created_utc": "1627742792.0", "edited": "False", "id": "h77gnke", "is_submitter": "True", "link_id": "t3_otz95l", "parent_id": "t1_h76umkz", "score": "1", "subreddit": "WriteStreakPT", "subreddit_id": "t5_2gdmbs"}, {"author": "CrashingFirefly", "body": "Muito obrigado! As explicações pormenorizadas são muito bem-vindas. Tenho só uma pergunta: O que significa a palavra **paladar**? Pelo que vejo aqui, https://www.infopedia.pt/dicionarios/lingua-portuguesa/paladar, não sei com qual signifição a palavra corresponde neste contexto.", "created_utc": "1627671893.0", "edited": "False", "id": "h747lr9", "is_submitter": "True", "link_id": "t3_otz95l", "parent_id": "t1_h72ao4w", "score": "1", "subreddit": "WriteStreakPT", "subreddit_id": "t5_2gdmbs"}, {"author": "CrashingFirefly", "body": ">Quem Quer Namorar com o Agriculto\n\nLá isso é engraçado! Na Holanda também esta programa, mas não sabia que também existe uma versão portuguesa. Espero que posso rever os episódios.", "created_utc": "1627626515.0", "edited": "False", "id": "h71yxx4", "is_submitter": "False", "link_id": "t3_otwhhx", "parent_id": "t1_h6yn2xe", "score": "2", "subreddit": "WriteStreakPT", "subreddit_id": "t5_2gdmbs"}, {"author": "CrashingFirefly", "body": "Muito obrigado para partilhar! Este canal parece-me muito útil para me preparar falar português nos Açores. Não sabia que o sotaque seria tão diferente; quase parece uma outra língua...", "created_utc": "1627569570.0", "edited": "False", "id": "h6ylkxw", "is_submitter": "False", "link_id": "t3_otwhhx", "parent_id": "t1_h6yj1a5", "score": "1", "subreddit": "WriteStreakPT", "subreddit_id": "t5_2gdmbs"}, {"author": "CrashingFirefly", "body": "Thanks for the tips! And 100% BW, that's a really impressive stat!\n\nI personally found that doing weighted chin-ups helped me increase reps on bodyweight chin-ups, which is why I think I do benefit from weighted chin-ups even if I cannot do, say, 15+ bodyweight reps. \n\nMay I ask how often you change your grip? Each cycle/training/...?", "created_utc": "1627567930.0", "edited": "False", "id": "h6yhyg2", "is_submitter": "False", "link_id": "t3_otro8i", "parent_id": "t1_h6ygtqj", "score": "1", "subreddit": "gzcl", "subreddit_id": "t5_33j1o"}, {"author": "CrashingFirefly", "body": "Well, actually, I do! :) I might not have explained myself properly. I do chin-up 'derivatives' 3x per week, that is: Heavy (for me) weighted chin-ups as T1, light weighted chin-ups (\\~5kg) as T2 and lat pulldowns as T3.", "created_utc": "1627567014.0", "edited": "False", "id": "h6yfzmz", "is_submitter": "False", "link_id": "t3_otro8i", "parent_id": "t1_h6ye9z4", "score": "1", "subreddit": "gzcl", "subreddit_id": "t5_33j1o"}, {"author": "CrashingFirefly", "body": "Well, I also program chin-ups as a T2 on the day I do the T2 as OHP. In that case, I only do them with relatively little weight (last time: 6x5+ @ 5 kg). When would you suggest starting to do weighted chin-ups?", "created_utc": "1627566914.0", "edited": "False", "id": "h6yfs33", "is_submitter": "False", "link_id": "t3_otro8i", "parent_id": "t1_h6yc06q", "score": "1", "subreddit": "gzcl", "subreddit_id": "t5_33j1o"}, {"author": "CrashingFirefly", "body": "Thanks for the reply! And you raise a good point about the 4x4. \n\n>It sounds like you already got through a full cycle with chins as T1 though? Did you run it with 10x1? What did you stall out at?\n\nWell, I actually didn't. I was doing 6x2 @ 18.75 kg, but I had a small training hiatus of \\~2 weeks and decided to find my 5RM and based on that start a new cycle. The 18.75 kg took quite some effort, so I doubt that I could have gone past 20 kg, anyways. And again, I didn't like the prospect of doing chin-up singles.", "created_utc": "1627566778.0", "edited": "False", "id": "h6yfhwq", "is_submitter": "False", "link_id": "t3_otro8i", "parent_id": "t1_h6ye4g8", "score": "1", "subreddit": "gzcl", "subreddit_id": "t5_33j1o"}, {"author": "CrashingFirefly", "body": "Oh não! Vou aos Açores por algum tempo, mas não me passaria pela cabeça que o sotaque pode ser tão diferente do continental. Tens dicas para facilitar a conversa com açorianos? Obrigado! :)", "created_utc": "1627565893.0", "edited": "False", "id": "h6ydna8", "is_submitter": "False", "link_id": "t3_otwhhx", "parent_id": "t3_otwhhx", "score": "1", "subreddit": "WriteStreakPT", "subreddit_id": "t5_2gdmbs"}, {"author": "CrashingFirefly", "body": "In my GZCLP program, I have programmed a weighted chin-up as T1 (superset with OHP). Yesterday, I tested my 5RM and got to 10 kg (22 lbs) (2RM = 18.75 kg). However, if I would reset the lift according to the guidelines and go with 85%, I would have to do 10 + 75 (bodyweight) = 85 \\* 0.85 = 72.25 weighted chin-ups, which is even less than my current body weight and doesn't seem sensible. As I started the cycle with 12.5 kg for 5x3+, I thought about simply starting again with an additional 2.5 kg, so 15 kg. However, I also thought about programming the chin-up with the alternative rep progression scheme, namely 3x5 > 5x3 > 6x2 (sets x reps) to avoid having to do singles which I do not feel completely comfortable with for the chin-up. In that case, I would probably start below my 5RM, e.g. with 7.5 kg and 3x5. \n\nI'd love to hear suggestions from people who also program the chin-up as a T1 exercise. How do you go about programming and resetting it? And do you also do weighted chin-up singles? Or do you use an alternative rep scheme? And one last question: Why does the alternative rep scheme I mentioned (the 'hypertrophy' rep scheme) not include 4x4? This might make it possible to go on longer without having to reset. Thanks for any input! :)", "created_utc": "1627564020.0", "edited": "False", "id": "h6y9wp7", "is_submitter": "False", "link_id": "t3_otro8i", "parent_id": "t3_otro8i", "score": "1", "subreddit": "gzcl", "subreddit_id": "t5_33j1o"}, {"author": "CrashingFirefly", "body": "Thanks! Is there any benefit to one or the other of the two methods?", "created_utc": "1627470912.0", "edited": "False", "id": "h6tfxcx", "is_submitter": "False", "link_id": "t3_ot3zzw", "parent_id": "t1_h6taeiw", "score": "1", "subreddit": "gzcl", "subreddit_id": "t5_33j1o"}, {"author": "CrashingFirefly", "body": "Good point, thanks! It's just that if I only do a few singles and then wait for next week to test my 5RM, that week's volume is very low. Or could you also retest the 5RM on another day's training?", "created_utc": "1627470874.0", "edited": "False", "id": "h6tfvgw", "is_submitter": "False", "link_id": "t3_ot3zzw", "parent_id": "t1_h6t57ty", "score": "1", "subreddit": "gzcl", "subreddit_id": "t5_33j1o"}, {"author": "CrashingFirefly", "body": "This has probably already been answered, but I couldn't find it: Can you retest your 5RM on the same day that you failed the 10x1? For example, after 4 singles I fail, can I just take a few minutes rest and start working towards the 5RM? Thanks!", "created_utc": "1627459679.0", "edited": "False", "id": "h6t2tdt", "is_submitter": "False", "link_id": "t3_ot3zzw", "parent_id": "t3_ot3zzw", "score": "1", "subreddit": "gzcl", "subreddit_id": "t5_33j1o"}, {"author": "CrashingFirefly", "body": "Muito obrigado pelas correções adicionais!", "created_utc": "1627386587.0", "edited": "False", "id": "h6p3hiv", "is_submitter": "True", "link_id": "t3_os4cqz", "parent_id": "t1_h6p2w5h", "score": "1", "subreddit": "WriteStreakPT", "subreddit_id": "t5_2gdmbs"}, {"author": "CrashingFirefly", "body": "Obrigado por me corrigires! E sim, os tempos verbais ficam-me muito atarantado... \n\nPois, foi um pouco mal pensado, porque nós não tivemos bem em conta os riscos que corríamos e não sabíamos que as regras são muito mais extremas na Áustria, sendo que é (o Tirol) um dos primeiros lugares onde o vírus cheguei na Europa.", "created_utc": "1627386548.0", "edited": "False", "id": "h6p3fc2", "is_submitter": "True", "link_id": "t3_os4cqz", "parent_id": "t1_h6onob1", "score": "2", "subreddit": "WriteStreakPT", "subreddit_id": "t5_2gdmbs"}, {"author": "CrashingFirefly", "body": "Obrigado por me corrigires! :)", "created_utc": "1627301050.0", "edited": "False", "id": "h6kt5wf", "is_submitter": "True", "link_id": "t3_oraw5v", "parent_id": "t1_h6idzst", "score": "1", "subreddit": "WriteStreakPT", "subreddit_id": "t5_2gdmbs"}, {"author": "CrashingFirefly", "body": "Muito obrigado! :)", "created_utc": "1627232617.0", "edited": "False", "id": "h6hou9u", "is_submitter": "True", "link_id": "t3_oqvjol", "parent_id": "t1_h6h3i3d", "score": "1", "subreddit": "WriteStreakPT", "subreddit_id": "t5_2gdmbs"}, {"author": "CrashingFirefly", "body": "Obrigado por me corrigires! :)", "created_utc": "1627122358.0", "edited": "False", "id": "h6comxi", "is_submitter": "True", "link_id": "t3_oq5jig", "parent_id": "t1_h6cav1r", "score": "1", "subreddit": "WriteStreakPT", "subreddit_id": "t5_2gdmbs"}, {"author": "CrashingFirefly", "body": "Ah, obrigado por me advertir! ;) Infelizmente, resta ainda menos... No entanto, além do caldo verde, acho que é bastante comum para restaurantes servir uma sopa de legumes (por norma vegano) para o prato do dia.", "created_utc": "1624990593.0", "edited": "False", "id": "h3gtmeo", "is_submitter": "True", "link_id": "t3_o9if7c", "parent_id": "t1_h3bkypk", "score": "1", "subreddit": "WriteStreakPT", "subreddit_id": "t5_2gdmbs"}, {"author": "CrashingFirefly", "body": "Desculpe que ainda não te agredeci! Muito obrigado pelas correções. Acho difícil de julgar quando tenho de usar, ou mudar, (a)o perfeito ou imperfeito.", "created_utc": "1624990551.0", "edited": "False", "id": "h3gtiyj", "is_submitter": "True", "link_id": "t3_o9if7c", "parent_id": "t1_h3b8uoq", "score": "2", "subreddit": "WriteStreakPT", "subreddit_id": "t5_2gdmbs"}, {"author": "CrashingFirefly", "body": "When doing the backsquat, I feel some pain/stretch in my hip flexors (iliopsoas predominantly, I believe). It seems that those give in before my quads do. Since the last time I did weighted squats (about a year ago), I have significantly improve my hip flexibility (I basically live in the Asian squat now, jokes ;) ), so it might have to do with this. Any tips on what to do? Should I give my legs some rest? Thanks!", "created_utc": "1624908450.0", "edited": "False", "id": "h3csm2w", "is_submitter": "False", "link_id": "t3_o9fbbh", "parent_id": "t3_o9fbbh", "score": "2", "subreddit": "Fitness", "subreddit_id": "t5_2qhx4"}, {"author": "CrashingFirefly", "body": "Obrigado pelas correções e explicações! E ótimo que também que me deste as palavras que desconheci :)", "created_utc": "1624632014.0", "edited": "False", "id": "h3008dp", "is_submitter": "True", "link_id": "t3_o72cfo", "parent_id": "t1_h2wv2ss", "score": "2", "subreddit": "WriteStreakPT", "subreddit_id": "t5_2gdmbs"}, {"author": "CrashingFirefly", "body": "Muito obrigado, tudo claro! :)", "created_utc": "1624540703.0", "edited": "False", "id": "h2vraha", "is_submitter": "True", "link_id": "t3_o68ux5", "parent_id": "t1_h2r5z3b", "score": "2", "subreddit": "WriteStreakPT", "subreddit_id": "t5_2gdmbs"}, {"author": "CrashingFirefly", "body": "Ah, obrigado, isto faz sentido! \n\n> Se não compreendo uma pergunta, basta dizer um seco \"pois\" e nada mais.\n\nNesta frase, não é necessário de usar o presente do conjunctivo? (devido à utilização de \"se\")", "created_utc": "1623651249.0", "edited": "False", "id": "h1pcnoe", "is_submitter": "True", "link_id": "t3_nz4drf", "parent_id": "t1_h1o2y8o", "score": "1", "subreddit": "WriteStreakPT", "subreddit_id": "t5_2gdmbs"}, {"author": "CrashingFirefly", "body": "Muito obrigado! Conjugação continua a ser difícil para mim...\n\n>A cidade e as serras\n\nVejo que está em promoção, ótimo :)", "created_utc": "1623525873.0", "edited": "False", "id": "h1jng5z", "is_submitter": "True", "link_id": "t3_nyb49x", "parent_id": "t1_h1j9mj1", "score": "2", "subreddit": "WriteStreakPT", "subreddit_id": "t5_2gdmbs"}, {"author": "CrashingFirefly", "body": "Obrigado! \"caril\", isso é bom saber :)", "created_utc": "1623481404.0", "edited": "False", "id": "h1hrifs", "is_submitter": "True", "link_id": "t3_nxlio9", "parent_id": "t1_h1fgu3r", "score": "1", "subreddit": "WriteStreakPT", "subreddit_id": "t5_2gdmbs"}, {"author": "CrashingFirefly", "body": "> Em todo o caso, se o OP entender que o termo é demasiado técnico para poder ser traduzido, retiro as minhas sugestões.\n\nNão, acho que tens razão! Já reparava que em português é menos comum de usar palavras directamente do inglês (o que acontece em holandês). \n\n> Acho que preferia «empenhado» ou «entusiasmado », em vez de «apaixonado», só porque me soa a decalque do inglês. Embora, possa ser só impressão minha.\n\nConcordo! \"apaixonado\" talvez soa um pouco \"fingido\" ou até insincero. Gosto do tom de \"empenhado\" mais!\n\nObrigado pela ajuda!", "created_utc": "1623354919.0", "edited": "False", "id": "h1bj6n3", "is_submitter": "True", "link_id": "t3_nwifo7", "parent_id": "t1_h1bf4f8", "score": "2", "subreddit": "WriteStreakPT", "subreddit_id": "t5_2gdmbs"}, {"author": "CrashingFirefly", "body": "És um herói! Obrigado por as correções e as sugestões. \n\n> integrado em mestrado (?)\n\nNão percebo o queres dizer aqui. A pergunta é se o meu estágio é uma parte do meu curso?\n\n> 2 - Does it only identify one palm tree per application (?), or does it identify palm trees or one palm tree species specifically? \n\n>  (I am not from the field, maybe this is a stupid particular)\n\nSó um tipo de palmeira - é bastante específico ;) Mas de certeza, não é uma pergunta estúpida!\n\n> The same with the drone. In Portuguese, generalizations like these are done not by using \"um/uma\", but by just not using articles.\n\nBoa explicação; e isso faz a vida um pouco mais fácil.", "created_utc": "1623354592.0", "edited": "False", "id": "h1bie64", "is_submitter": "True", "link_id": "t3_nwifo7", "parent_id": "t1_h1agtfp", "score": "2", "subreddit": "WriteStreakPT", "subreddit_id": "t5_2gdmbs"}, {"author": "CrashingFirefly", "body": "Ótima ideia! Farei isso logo :) Então, tu estudas arqueologia? Fixe! Não sei muito cerca a utilização do SIG nessa área.", "created_utc": "1623353494.0", "edited": "False", "id": "h1bg0za", "is_submitter": "True", "link_id": "t3_nwifo7", "parent_id": "t1_h1b28iw", "score": "2", "subreddit": "WriteStreakPT", "subreddit_id": "t5_2gdmbs"}, {"author": "CrashingFirefly", "body": "Sim, tens ajudado, sem dúvida! Obrigado :)", "created_utc": "1623313365.0", "edited": "False", "id": "h19a3bw", "is_submitter": "True", "link_id": "t3_nw3zlk", "parent_id": "t1_h16z0ps", "score": "2", "subreddit": "WriteStreakPT", "subreddit_id": "t5_2gdmbs"}, {"author": "CrashingFirefly", "body": "Desculpe para ainda não ter respondido! Obrigado pela ajuda :) \"Está no papo!\" então não é muito comum de utilizar?", "created_utc": "1623266599.0", "edited": "False", "id": "h16v6fv", "is_submitter": "True", "link_id": "t3_nv6dc1", "parent_id": "t1_h14eilz", "score": "1", "subreddit": "WriteStreakPT", "subreddit_id": "t5_2gdmbs"}, {"author": "CrashingFirefly", "body": "First off, thanks to you - the mods - for moderating and maintaining this subreddit. I am always amazed and humbled by people who are willing to invest their own spare time to organize activities for others. I also appreciate the possibility of sharing some thoughts here.\n\n>1. How do you feel the sub has changed over the past year? Good experiences? Bad experiences?\n\nUnfortunately, I have the feeling that this sub has become more of a circle-jerk over the last year (the Reddit dead trap!). I often see questionable, but highly rated, statements in the comment section. You do not need a PhD in sport sciences to join the discussion, but if you want to contribute something then either mention a source or simply speak from *your* experience (and do not directly generalize it). In terms of good experiences, I find that practically everybody on this subreddit behaves friendly and civil.\n\n>2. How can moderation be improved? Which kinds of posts do you hate and should never make the front page?\n\nThe kind of posts I hate are the ones containing questions which either have been answered here already (multiple times!) or could have been answered with a simple search. For example, there are plenty of posts - if not the majority - asking how to start with fitness. This subreddit provides very accessible methods of starting with training, namely the Recommended Routine and the (new) Primer routine. Often I see posts by people who refer to themselves as beginners, and who do not know where to start. Whatever your background, the aforementioned programs will work for practically any beginner. If you have very particular requirements (e.g. disability or severe injury), you should probably be talking with a professional first anyways instead of taking internet advice.  \n\nSecondly, I've noticed that many posts pop up with people describing how they reached their first pull-up or push-up. Don't get me wrong; it's a wonderful thing when you reach a goal! It's understandable that people want to share their achievement. However, in my opinion, it does devaluate this subreddit because it simply isn't very interesting for people who have been around this subreddit for a while (and hopefully I do not sound pretentious here). In the long run, this could turn away experienced BWF athletes (or simply enthusiasts), who might have very valuable insights to share in regards to intermediate or advanced training concepts. These type of posts seem to get little traction on the subreddit. \n\nAnyway, \"Sunday Show-off\" is already a thing, right? As far as I know, this day has been called into existence for sharing your achievements. You do not have to perform a full FL or a do 20 pull-ups under a minute; sharing *your* achievements is what counts. Maybe this could be promoted more? \n\n>4. Do you have any suggestions on how to improve the subreddit, particularly with increased traffic?\n\nI would suggest to moderate stricter. If someone posts a question which clearly already has been asked and answered before, then I would rather see this new post removed. This way, quality of the posts remains high. If a question does not deserve its own posts, you can always ask it in the Daily Discussion; there you usually get an answer quite quickly. Furthermore, very questionable statements - clearly contradicting scientific knowledge or common sense - should, in my opinion, also be removed. \n\nHopefully, my writing doesn't sound too negative! I simply believe the subreddit could be even better than it currently is ;) Keep up the great work!", "created_utc": "1623252680.0", "edited": "False", "id": "h15wi3w", "is_submitter": "False", "link_id": "t3_nvv5mk", "parent_id": "t3_nvv5mk", "score": "3", "subreddit": "bodyweightfitness", "subreddit_id": "t5_2tf0a"}, {"author": "CrashingFirefly", "body": "Muito obrigado pelas correções e os links! :) Você é bom em explicar estas dúvidas.", "created_utc": "1623220293.0", "edited": "False", "id": "h14h44r", "is_submitter": "True", "link_id": "t3_nv1g0l", "parent_id": "t1_h12umjc", "score": "2", "subreddit": "WriteStreakPT", "subreddit_id": "t5_2gdmbs"}, {"author": "CrashingFirefly", "body": "Haha, tens razão! Talvez já sabes, mas usamos o laranja como cor nacional por causa da família real. Nós também chamamos a família real 'De Oranjes' (Os Laranjas?). Não sabia que existe uma Beira Alta e Beira Baixa, obrigado! Tenho de trabalhar no meu conhecimento da geográfia também...", "created_utc": "1623134033.0", "edited": "False", "id": "h105mln", "is_submitter": "True", "link_id": "t3_nu8l74", "parent_id": "t1_h0yc8rh", "score": "2", "subreddit": "WriteStreakPT", "subreddit_id": "t5_2gdmbs"}, {"author": "CrashingFirefly", "body": "Dankjewel! Ótimo que também me dás as explições com as correções.", "created_utc": "1623093833.0", "edited": "False", "id": "h0y0go3", "is_submitter": "True", "link_id": "t3_nu8l74", "parent_id": "t1_h0wjlxm", "score": "2", "subreddit": "WriteStreakPT", "subreddit_id": "t5_2gdmbs"}, {"author": "CrashingFirefly", "body": "Muito obrigado! Então, podemos dizer que \"a gente\" e só utilizado no contexto informal ou na língua falada?", "created_utc": "1623093686.0", "edited": "False", "id": "h0y0443", "is_submitter": "True", "link_id": "t3_nu8l74", "parent_id": "t1_h0whq7i", "score": "2", "subreddit": "WriteStreakPT", "subreddit_id": "t5_2gdmbs"}, {"author": "CrashingFirefly", "body": "Obrigado pelas correções! No que diz respeito ao nome do meu país, estás correto, não tenho problemas com usar \"Holanda\" quando faço a referência aos Países Baixos. Não sou da região Holanda, mas acho que para a maioridade do meu povo, não faz nenhuma diferença (mas podia ser errado!). Por exemplo, durante o campeonato europeu e mundial do futebol, nós identificamos-nos com \"Holanda\" nos canções e tal coisas, provavelmente como uma maneira de expressar a nossa identidade. Espero que isto faz sentido!", "created_utc": "1623093479.0", "edited": "False", "id": "h0xzmj2", "is_submitter": "True", "link_id": "t3_nu8l74", "parent_id": "t1_h0wqye7", "score": "1", "subreddit": "WriteStreakPT", "subreddit_id": "t5_2gdmbs"}, {"author": "CrashingFirefly", "body": "Obrigado! E no que diz respeito à palavra \"volátil\", percebo o que tu dizes; às vezes, é difícil identificar por que uma palavra ou frase não soa natural. Tenho de admitir que não me lembro de encontrar esta palavra, então talvez seja melhor evitá-la. Também obrigado para explicar-me como utilizar \"assaz\". E faz sentido, por que encontrei-a num livro que estava a ler. \n\nTenho uma pergunta sobre a diferença entre o gerúndio e o particípio passado, quando são utilizados (ou utilizandos?) no contexto de \"... feita de uma camisa , embrulhando-a/embrulhada em torno do peito do advogado\". Qual forma é melhor de utilizar aqui, ou porque? Obrigado!", "created_utc": "1623058131.0", "edited": "False", "id": "h0w3iz0", "is_submitter": "True", "link_id": "t3_nttwfi", "parent_id": "t1_h0umt4u", "score": "1", "subreddit": "WriteStreakPT", "subreddit_id": "t5_2gdmbs"}, {"author": "CrashingFirefly", "body": ">não percebo o que queres dizer aqui\n\nQuis dizer que no meu país, não é comum para pessoas falaram português (comparando com, digamos, espanhol ou italiano).", "created_utc": "1623009080.0", "edited": "False", "id": "h0tuqgd", "is_submitter": "True", "link_id": "t3_nt1u0e", "parent_id": "t1_h0rucan", "score": "1", "subreddit": "WriteStreakPT", "subreddit_id": "t5_2gdmbs"}, {"author": "CrashingFirefly", "body": "Obrigado! Muito útil! :)", "created_utc": "1623007304.0", "edited": "False", "id": "h0tqwga", "is_submitter": "True", "link_id": "t3_nt1u0e", "parent_id": "t1_h0rucan", "score": "1", "subreddit": "WriteStreakPT", "subreddit_id": "t5_2gdmbs"}, {"author": "CrashingFirefly", "body": "Obrigado pela sugestão! Não encontrei no RTP Play, mas vou tentar encontrar-o nos Arquivos :)", "created_utc": "1622960196.0", "edited": "False", "id": "h0royk9", "is_submitter": "True", "link_id": "t3_nt1u0e", "parent_id": "t1_h0puct6", "score": "1", "subreddit": "WriteStreakPT", "subreddit_id": "t5_2gdmbs"}, {"author": "CrashingFirefly", "body": "Muito obrigado pela correção! Também dá jeito saber que \"Ilhas das Especiarias\" soa mais adequado em português; em holandês isso soaria estranha. E nunca tinha lido a palavra \"estaminé\", mas parece-me calão, pois não?", "created_utc": "1622880276.0", "edited": "False", "id": "h0nxzgv", "is_submitter": "True", "link_id": "t3_ns92cl", "parent_id": "t1_h0ma6pq", "score": "1", "subreddit": "WriteStreakPT", "subreddit_id": "t5_2gdmbs"}, {"author": "CrashingFirefly", "body": "Mozc is what I use to type Japanese characters; strange that it is included by default in this repo! Must be an anime fan ;)", "created_utc": "1622797832.0", "edited": "False", "id": "h0jpa9b", "is_submitter": "False", "link_id": "t3_nrqdv5", "parent_id": "t3_nrqdv5", "score": "3", "subreddit": "linux4noobs", "subreddit_id": "t5_2qy7t"}, {"author": "CrashingFirefly", "body": "Muito obrigado! Vou mandar-lhe um e-mail. Se calhar, também há outras oportunidades no instituto.", "created_utc": "1622646327.0", "edited": "False", "id": "h0bk7rc", "is_submitter": "True", "link_id": "t3_nqhuw0", "parent_id": "t1_h0b3q48", "score": "3", "subreddit": "portugal", "subreddit_id": "t5_2qmie"}, {"author": "CrashingFirefly", "body": "De um ponto de vista académica, sim", "created_utc": "1622637435.0", "edited": "False", "id": "h0b1x4i", "is_submitter": "True", "link_id": "t3_nqhuw0", "parent_id": "t1_h0apda3", "score": "2", "subreddit": "portugal", "subreddit_id": "t5_2qmie"}, {"author": "CrashingFirefly", "body": "Obrigado! Vou pesquisar algumas organizações.", "created_utc": "1622637381.0", "edited": "False", "id": "h0b1tpe", "is_submitter": "True", "link_id": "t3_nqhuw0", "parent_id": "t1_h0ap38e", "score": "2", "subreddit": "portugal", "subreddit_id": "t5_2qmie"}, {"author": "CrashingFirefly", "body": "Sim, pode ser, mas acho que há uma diferença entre férias e viver por algum tempo num país, não? E além disso, acho também pode ser uma experiência enriquecedora, trabalhar numa cultura diferente.", "created_utc": "1622637355.0", "edited": "False", "id": "h0b1s0s", "is_submitter": "True", "link_id": "t3_nqhuw0", "parent_id": "t1_h0ar3g4", "score": "1", "subreddit": "portugal", "subreddit_id": "t5_2qmie"}, {"author": "CrashingFirefly", "body": "Correto, mas do que vi, 'Holanda' é usado mais frequente na língua portuguesa", "created_utc": "1622637062.0", "edited": "False", "id": "h0b1afn", "is_submitter": "True", "link_id": "t3_nqhuw0", "parent_id": "t1_h0au5l8", "score": "3", "subreddit": "portugal", "subreddit_id": "t5_2qmie"}, {"author": "CrashingFirefly", "body": "Obrigado!", "created_utc": "1622636989.0", "edited": "False", "id": "h0b163g", "is_submitter": "True", "link_id": "t3_nqhuw0", "parent_id": "t1_h0at6bc", "score": "2", "subreddit": "portugal", "subreddit_id": "t5_2qmie"}, {"author": "CrashingFirefly", "body": "This is a great answer! Much appreciated.\n\nIt's easy to answer with something along the lines of \"it depends\", not mentioning the nutritional nuances you've written up here. Yeah, obviously you can have a terrible vegan diet, but I don't think that was the question OP was posing. \n\nAnother question: Do you know if gene expression is also (in a significant degree) involved in absorption of (non-)heme iron?\n\nDespite eating many plant-based sources of non-heme iron (as a vegan), my ferritin stays low. Any ideas about this?", "created_utc": "1621674311.0", "edited": "False", "id": "gz1emp7", "is_submitter": "False", "link_id": "t3_nhyy9s", "parent_id": "t1_gyzjcrh", "score": "6", "subreddit": "nutrition", "subreddit_id": "t5_2qoox"}, {"author": "CrashingFirefly", "body": "Good to know, thanks for the suggestion! (I wasn't enjoying the holds anyways haha)", "created_utc": "1620387194.0", "edited": "False", "id": "gx9fojz", "is_submitter": "True", "link_id": "t3_n69p6o", "parent_id": "t1_gx9d9yx", "score": "2", "subreddit": "bodyweightfitness", "subreddit_id": "t5_2tf0a"}, {"author": "CrashingFirefly", "body": "Ah, HS Skill: Kick-ups and kick-ups to FS holds, trying to work on straddle (~15 min. total). At the end of my routine, I do 2-3 sets of chest-to-wall holds (1 min.) and shoulder taps or wall walks. It is mostly endurance and little strength.", "created_utc": "1620385059.0", "edited": "False", "id": "gx9crlc", "is_submitter": "True", "link_id": "t3_n69p6o", "parent_id": "t1_gx9a8dm", "score": "1", "subreddit": "bodyweightfitness", "subreddit_id": "t5_2tf0a"}, {"author": "CrashingFirefly", "body": "No worries! :)\n\nAh, good to know. I was worried to also include a HSPU progression, since I'm already doing quite a bit of HS skill and conditioning work in my routine. Wouldn't that interfer?", "created_utc": "1620382325.0", "edited": "False", "id": "gx99h68", "is_submitter": "True", "link_id": "t3_n69p6o", "parent_id": "t1_gx996yb", "score": "1", "subreddit": "bodyweightfitness", "subreddit_id": "t5_2tf0a"}, {"author": "CrashingFirefly", "body": "Ah, I see! So basically a RTO PU with a slight lean forward?", "created_utc": "1620377206.0", "edited": "False", "id": "gx93zfh", "is_submitter": "True", "link_id": "t3_n69p6o", "parent_id": "t1_gx93fj1", "score": "1", "subreddit": "bodyweightfitness", "subreddit_id": "t5_2tf0a"}, {"author": "CrashingFirefly", "body": "Thanks for the reply! And your activity on this subreddit is much appreciated :)\n\nDo you suggest doing both HSPUs and PPPUs in the same routine?", "created_utc": "1620376725.0", "edited": "False", "id": "gx93h9g", "is_submitter": "True", "link_id": "t3_n69p6o", "parent_id": "t1_gx6xqn8", "score": "1", "subreddit": "bodyweightfitness", "subreddit_id": "t5_2tf0a"}, {"author": "CrashingFirefly", "body": "Thanks for the suggestions! Did you incorporate both RTO PU and PPPU in the same routine?", "created_utc": "1620375996.0", "edited": "False", "id": "gx92p9r", "is_submitter": "True", "link_id": "t3_n69p6o", "parent_id": "t1_gx6u32x", "score": "1", "subreddit": "bodyweightfitness", "subreddit_id": "t5_2tf0a"}, {"author": "CrashingFirefly", "body": "Thanks for the reply! No, I tried starting with a small angle (~45 degrees). Good idea to start with RTO push-ups! I have worked up to archer PUs, so RTO push-ups might be a good progression. And you're right about the difference between the RTO dip and the Bulgarian, it's probably because there aren't any (?) progressions working up to the RTO dips and Bulgarian dips are just more difficult than regular ring dips.", "created_utc": "1620327455.0", "edited": "False", "id": "gx6m3m1", "is_submitter": "True", "link_id": "t3_n69p6o", "parent_id": "t1_gx6himi", "score": "1", "subreddit": "bodyweightfitness", "subreddit_id": "t5_2tf0a"}, {"author": "CrashingFirefly", "body": "Well, that could definitely be! It's just that, as far as I know, \"Overcoming Gravity\" doesn't cover any weighted exercises.", "created_utc": "1620315192.0", "edited": "False", "id": "gx5sm2o", "is_submitter": "True", "link_id": "t3_n69p6o", "parent_id": "t1_gx5rzm2", "score": "2", "subreddit": "bodyweightfitness", "subreddit_id": "t5_2tf0a"}, {"author": "CrashingFirefly", "body": "Yes, it might be even better, since you've got much more time for recovery! If splitting up works best for you, then go with it. In the end of the day, the total volume is probably what matters most. Good luck!", "created_utc": "1619430991.0", "edited": "False", "id": "gvwvyn3", "is_submitter": "False", "link_id": "t3_myp3qo", "parent_id": "t1_gvwbalk", "score": "1", "subreddit": "bodyweightfitness", "subreddit_id": "t5_2tf0a"}, {"author": "CrashingFirefly", "body": "If you're properly recovered from your illness, then there is no need to ease back into the workout; just get started again! :) If you're worried though, just make sure to warm-up a bit longer and do some mobility work.", "created_utc": "1619430831.0", "edited": "False", "id": "gvwvso8", "is_submitter": "False", "link_id": "t3_myp3qo", "parent_id": "t1_gvwu7ou", "score": "3", "subreddit": "bodyweightfitness", "subreddit_id": "t5_2tf0a"}, {"author": "CrashingFirefly", "body": "Well put! In addition, it should be noted that protein is the most saturating macronutrient and the dietary-induced thermogenesis (the energy expended on 'processing' food) for protein is the highest (after alcohol I believe), thus making it easier to eat less calories on a - relatively - high protein diet. There is not necessarily anything wrong with protein supplements, if they help you get your protein needs, but 'real' food is to be preferred for the micronutrient content.", "created_utc": "1619191684.0", "edited": "False", "id": "gvkr1uq", "is_submitter": "False", "link_id": "t3_mvz06t", "parent_id": "t1_gvf3iap", "score": "1", "subreddit": "bodyweightfitness", "subreddit_id": "t5_2tf0a"}, {"author": "CrashingFirefly", "body": "Impressive that you already had your sidesplits, that's no easy feat! :)\n\nI'm still a few months away from my frontsplits (I think!), but for me those seem to be mostly a matter of hamstring flexibility. \n\nGood luck!", "created_utc": "1619188367.0", "edited": "False", "id": "gvkjfk7", "is_submitter": "False", "link_id": "t3_mwmugp", "parent_id": "t1_gvkev4p", "score": "1", "subreddit": "bodyweightfitness", "subreddit_id": "t5_2tf0a"}, {"author": "CrashingFirefly", "body": "Well, you're giving us a proper cue here; you shouldn't be pushing with your feet ;) Although there could toe pulls, you should try to move your center of gravity forward (or backward, depending on whether your doing back to wall or chest to wall) by using your shoulders or hips. Good luck!", "created_utc": "1619185371.0", "edited": "False", "id": "gvkd0k4", "is_submitter": "False", "link_id": "t3_mwmugp", "parent_id": "t1_gvk27zc", "score": "1", "subreddit": "bodyweightfitness", "subreddit_id": "t5_2tf0a"}, {"author": "CrashingFirefly", "body": "Hm, not that I know of, but the most important 5 to work on are probably the straddle/side split and pancake, front splits, hamstring/calves, deep squat and glutes in general (e.g. pigeon stretch). It does depend on your own body of course: the difference in flexibility between body parts can be huge. I'd love other people to chip in and tell us what you think! :)", "created_utc": "1619185091.0", "edited": "False", "id": "gvkcgg4", "is_submitter": "False", "link_id": "t3_mwmugp", "parent_id": "t1_gvk6fob", "score": "1", "subreddit": "bodyweightfitness", "subreddit_id": "t5_2tf0a"}, {"author": "CrashingFirefly", "body": "Yes, the pike push-up works the shoulders more. Could be handy if you want to work on the (W)HSPU!", "created_utc": "1618340367.0", "edited": "False", "id": "guehr5w", "is_submitter": "False", "link_id": "t3_mpuo1c", "parent_id": "t1_gue9g01", "score": "3", "subreddit": "bodyweightfitness", "subreddit_id": "t5_2tf0a"}, {"author": "CrashingFirefly", "body": "You explain it quite well yourself, actually! ;) Crossing the legs kind of 'anchors' them, thus you need less core tension to keep your body stabilised. It wouldn't say it matters much for the exercise, though.", "created_utc": "1617024439.0", "edited": "False", "id": "gsoo8y0", "is_submitter": "False", "link_id": "t3_mfh901", "parent_id": "t1_gsom8y9", "score": "2", "subreddit": "bodyweightfitness", "subreddit_id": "t5_2tf0a"}, {"author": "CrashingFirefly", "body": "That's good to hear! :)\n\nFor a while, I also considered buying parallettes, but I decided not to because I didn't actually know what benefit they would provide me. Personally, I prefer to be able to do skills (L-sit or handstand) without any equipment - on the floor - so I can do it wherever I want. If you actually like to do HS on parallettes, then sure, they might be a nice investment! As for the L-sit, simply working on the progressions on the floor will get you there just fine! :) \n\nAnother reason for getting parallettes is that they are more gentle on the wrists, so IF your wrists cannot handle your current workout regiment, then you might want to (partially) switch to parallettes. However, in that case it's even better to just take it easy and give your wrist the necessary recovery.", "created_utc": "1616695964.0", "edited": "False", "id": "gs76r2n", "is_submitter": "False", "link_id": "t3_mcpex8", "parent_id": "t1_gs6zk0l", "score": "1", "subreddit": "bodyweightfitness", "subreddit_id": "t5_2tf0a"}, {"author": "CrashingFirefly", "body": "You're strong enough for sure: Work on the easier progression - frog pose - first, then try the crow pose. Good luck!", "created_utc": "1616693004.0", "edited": "False", "id": "gs6zldy", "is_submitter": "False", "link_id": "t3_mcpex8", "parent_id": "t1_gs6ryd4", "score": "2", "subreddit": "bodyweightfitness", "subreddit_id": "t5_2tf0a"}, {"author": "CrashingFirefly", "body": "Nah, if you cannot think of anything you directly need for your training, chances are: you don't need anything! ;) Since you mention the L-sit however, you might want to work on your (active) flexibility. A yoga mat is not strictly necessary, but very helpful for sure! My personal favourite calisthenics/flexibility items are wooden rings, resistance bands, yoga mat and yoga blocks. And good clothing of course!", "created_utc": "1616692876.0", "edited": "False", "id": "gs6z9z4", "is_submitter": "False", "link_id": "t3_mcpex8", "parent_id": "t1_gs6stbb", "score": "2", "subreddit": "bodyweightfitness", "subreddit_id": "t5_2tf0a"}, {"author": "CrashingFirefly", "body": "Hi! Although this subreddit provides a very helpful and welcoming community, it is also appreciated if you take the time to thoroughly read the wiki first: most questions can already be answered there. Check out the recommended routine (RR). Doing an abs circuit and some push-ups is not going to lead to any significant results.", "created_utc": "1616692543.0", "edited": "False", "id": "gs6ygxp", "is_submitter": "False", "link_id": "t3_mcpex8", "parent_id": "t1_gs6toz2", "score": "5", "subreddit": "bodyweightfitness", "subreddit_id": "t5_2tf0a"}, {"author": "CrashingFirefly", "body": "Because it requires three different movements combined into one; that's why! ;) Good luck! :)", "created_utc": "1616506164.0", "edited": "False", "id": "grxd2hm", "is_submitter": "False", "link_id": "t3_mb62wi", "parent_id": "t1_grx53we", "score": "4", "subreddit": "bodyweightfitness", "subreddit_id": "t5_2tf0a"}, {"author": "CrashingFirefly", "body": "Hi, thanks! Yes, I used to do weighted pull-ups when gyms were still open. I personally never felt that it did much for my explosive pull-ups, so that's why I incorporate explosive pull-ups in my routine directly.", "created_utc": "1616437878.0", "edited": "False", "id": "gru8z03", "is_submitter": "False", "link_id": "t3_maeemn", "parent_id": "t1_grtup5n", "score": "1", "subreddit": "bodyweightfitness", "subreddit_id": "t5_2tf0a"}, {"author": "CrashingFirefly", "body": "Thanks for the reply! But that's exactly my question: What is better? Work on getting that move higher or lowering the assistance to the point you can do a bar to belly pull-up unassisted.", "created_utc": "1616418210.0", "edited": "False", "id": "grt1ko3", "is_submitter": "False", "link_id": "t3_maeemn", "parent_id": "t1_grss0c6", "score": "1", "subreddit": "bodyweightfitness", "subreddit_id": "t5_2tf0a"}, {"author": "CrashingFirefly", "body": "Would it be better for high pull-ups to do explosive assisted pull-ups or 'regular', un-assisted explosive pull-ups? My reasoning is that with assistance (i.e. band), you can reach higher and possibly have a larger ROM, thus training the fast-twitch muscle fibres better. Ideas?", "created_utc": "1616407798.0", "edited": "1616408844.0", "id": "grsnm67", "is_submitter": "False", "link_id": "t3_maeemn", "parent_id": "t3_maeemn", "score": "1", "subreddit": "bodyweightfitness", "subreddit_id": "t5_2tf0a"}, {"author": "CrashingFirefly", "body": "What do you consider skill work? If your skill work includes heavy strength work (planche, levers), you might be training too much. If skill work means handstand, you should probably be fine. However, in the end of the day, it mainly comes down to listening to your body and monitoring your fatigue. Good luck!", "created_utc": "1616230985.0", "edited": "False", "id": "grknz4u", "is_submitter": "False", "link_id": "t3_m8z12s", "parent_id": "t1_grkkspn", "score": "2", "subreddit": "bodyweightfitness", "subreddit_id": "t5_2tf0a"}, {"author": "CrashingFirefly", "body": "Nope, both are fine! Do what feels most comfortable, because this is most likely what has the smallest chance of leading to injury.", "created_utc": "1616230865.0", "edited": "False", "id": "grknva0", "is_submitter": "False", "link_id": "t3_m8z12s", "parent_id": "t1_grkmeyb", "score": "2", "subreddit": "bodyweightfitness", "subreddit_id": "t5_2tf0a"}, {"author": "CrashingFirefly", "body": "Yes, this is exactly what I mean! It would be interesting to know how this principle could be leveraged to optimize training.", "created_utc": "1616078480.0", "edited": "False", "id": "grd4s6l", "is_submitter": "False", "link_id": "t3_m6rozs", "parent_id": "t1_grd33lc", "score": "2", "subreddit": "bodyweightfitness", "subreddit_id": "t5_2tf0a"}, {"author": "CrashingFirefly", "body": "Cheers for chipping in! Maybe it's a question I could better post in another subreddit more related to learning.", "created_utc": "1616073015.0", "edited": "False", "id": "grcpqxv", "is_submitter": "False", "link_id": "t3_m6rozs", "parent_id": "t1_grckwm7", "score": "2", "subreddit": "bodyweightfitness", "subreddit_id": "t5_2tf0a"}, {"author": "CrashingFirefly", "body": "Yeah, that is completely true of course. But it is not muscle fatigue I'm referring to, rather the motor pattern underlying a certain movement.", "created_utc": "1616056345.0", "edited": "False", "id": "grbzlhv", "is_submitter": "False", "link_id": "t3_m6rozs", "parent_id": "t1_grb9241", "score": "1", "subreddit": "bodyweightfitness", "subreddit_id": "t5_2tf0a"}, {"author": "CrashingFirefly", "body": "I've noticed that when learning a new skill (bodyweight, breakdance or juggling), there seems to be a sudden improvement after not training the skill for a little while - let's say a week. This seems a bit counterintuitive: not training leads to growth. Does anyone know how this effect is known/works?", "created_utc": "1616011073.0", "edited": "False", "id": "gr9vlg0", "is_submitter": "False", "link_id": "t3_m6rozs", "parent_id": "t3_m6rozs", "score": "3", "subreddit": "bodyweightfitness", "subreddit_id": "t5_2tf0a"}, {"author": "CrashingFirefly", "body": "Yes, if you want to split up the routine, go ahead! The total number of sets/volume per week is what matters.", "created_utc": "1616010259.0", "edited": "False", "id": "gr9trqv", "is_submitter": "False", "link_id": "t3_m6rozs", "parent_id": "t1_gr9oqk1", "score": "2", "subreddit": "bodyweightfitness", "subreddit_id": "t5_2tf0a"}, {"author": "CrashingFirefly", "body": "Thanks Antranik! And you're right, I still might be using the triceps. However, when I compare it to the 'regular' triceps extension, the chest activation seems to be much greater. It might also have to do with the fact that the rings are slightly pushed to the front during the exercise. I will upload a form check.", "created_utc": "1615836983.0", "edited": "False", "id": "gr1pcd8", "is_submitter": "False", "link_id": "t3_m5c8sa", "parent_id": "t1_gr1g31d", "score": "1", "subreddit": "bodyweightfitness", "subreddit_id": "t5_2tf0a"}, {"author": "CrashingFirefly", "body": "When doing triceps extension on rings (\\~50cm above the ground), I mainly feel chest activation and little triceps activation. Any ideas on how to isolate the triceps better? Maybe hang the rings lower, move feet closer to rings, etc.", "created_utc": "1615821936.0", "edited": "1615826130.0", "id": "gr0rd8d", "is_submitter": "False", "link_id": "t3_m5c8sa", "parent_id": "t3_m5c8sa", "score": "1", "subreddit": "bodyweightfitness", "subreddit_id": "t5_2tf0a"}, {"author": "CrashingFirefly", "body": "Push-ups are fine! You could also do some additional triceps extensions, if your injury allows this. Good luck!", "created_utc": "1615806844.0", "edited": "False", "id": "gr01xf3", "is_submitter": "False", "link_id": "t3_m5c8sa", "parent_id": "t1_gr01mq8", "score": "1", "subreddit": "bodyweightfitness", "subreddit_id": "t5_2tf0a"}, {"author": "CrashingFirefly", "body": "Alright, that's more helpful indeed! If you want to get bigger, you need to gain weight. Do you measure you're weight to know if you're gaining weight? If not, start doing this and if necessary, adjust your calorie intake. The volume you have in your routine should be sufficient (and possibly too much). You could try a deload (basically doing half the work for one week) and after that progress to harder variations of the exercises you're currently doing. Experiment a bit, and find out what works for you. Good luck!", "created_utc": "1615806756.0", "edited": "False", "id": "gr01tue", "is_submitter": "False", "link_id": "t3_m5c8sa", "parent_id": "t1_gqzyjax", "score": "1", "subreddit": "bodyweightfitness", "subreddit_id": "t5_2tf0a"}, {"author": "CrashingFirefly", "body": "There could be plenty of reasons why you're not progressing. But to address that, the first question is: What is your goal? Do you want to become stronger and/or bigger, do you want to lose weight, do you want to be able to do other BW progressions or 'simply' be able to do more reps/sets? Let us know, so people here can give better advice! :)", "created_utc": "1615801579.0", "edited": "False", "id": "gqzwj8u", "is_submitter": "False", "link_id": "t3_m5c8sa", "parent_id": "t1_gqzuxoh", "score": "1", "subreddit": "bodyweightfitness", "subreddit_id": "t5_2tf0a"}, {"author": "CrashingFirefly", "body": "BWF, and fitness in general (as the word implies), carries over to all other physical activities, including dancing. That being said, the usefulness of resistance training does depend on the type of dance. For example, in breakdance, there is a great need for strength, flexibility and skill (e.g. balancing), so it is definitely useful. Good luck with your dancing! :)", "created_utc": "1615631236.0", "edited": "False", "id": "gqsd1db", "is_submitter": "False", "link_id": "t3_m42t2e", "parent_id": "t3_m42t2e", "score": "12", "subreddit": "bodyweightfitness", "subreddit_id": "t5_2tf0a"}, {"author": "CrashingFirefly", "body": "The straps of my rings do not have markings and I don't want to buy a new set of rings just for the straps. What is the best way to add length markings to ring straps? (paint, tape, ...?) Thanks in advance!", "created_utc": "1615134883.0", "edited": "False", "id": "gq3yi2h", "is_submitter": "False", "link_id": "t3_lzjlp6", "parent_id": "t3_lzjlp6", "score": "1", "subreddit": "bodyweightfitness", "subreddit_id": "t5_2tf0a"}, {"author": "CrashingFirefly", "body": "Suggestion: Share the PDF directly, without needing to sign up on your website. Otherwise this post might be marked as self-promotion by the moderators.", "created_utc": "1614682145.0", "edited": "False", "id": "gpei242", "is_submitter": "False", "link_id": "t3_lvubed", "parent_id": "t3_lvubed", "score": "4", "subreddit": "bodyweightfitness", "subreddit_id": "t5_2tf0a"}, {"author": "CrashingFirefly", "body": "Although I would definitely encourage buying second-hand, with resistance bands I would be a bit hesitant. You don't know how the previous owner has used it and it is hard to tell the quality of a used band. It's obviously dangerous if the band breaks during training, especially if you use the band as support. Since resistance bands are relatively cheap anyways, I would recommend to buy your own.", "created_utc": "1614526579.0", "edited": "False", "id": "gp6jbo5", "is_submitter": "False", "link_id": "t3_ltgr81", "parent_id": "t1_gp31cco", "score": "1", "subreddit": "bodyweightfitness", "subreddit_id": "t5_2tf0a"}, {"author": "CrashingFirefly", "body": "I would recommend developing proper hamstring and calves flexibility in the standing position before working on the seated forward fold. If you cannot properly sit in the staff pose (legs extended straight in front of you, back upright), you can strain your back in the forward fold. Half splits, triangle pose and lying hamstring stretches (my favourite: https://www.verywellfit.com/reclined-big-toe-pose-supta-padangusthasana-3567126). Good luck!", "created_utc": "1614512335.0", "edited": "False", "id": "gp5vg39", "is_submitter": "False", "link_id": "t3_lu6xf5", "parent_id": "t1_gp5uis2", "score": "1", "subreddit": "bodyweightfitness", "subreddit_id": "t5_2tf0a"}, {"author": "CrashingFirefly", "body": "As already mentioned, there isn't a best program. There a lot of different approaches to successfully developing flexibility, but I would say the common denominator is a frequency of 2/3x per week, active stretching (e.g. PNF or ballistic) and listening to your body. The last point is especially important, because - just as with strength training - the best way to completely stall your progress is by injuring yourself. Try different stretches (from different routines/programs), mind your form and see which ones give you the best stretch (without overdoing it). \n\nTake it slow and be consistent; the program itself doesn't matter much. It is important, however, to align your routine with your goal(s). Try to be clear about your intentions: Where do you want to develop flexibility, and why? Do you need it for a specific sport (e.g. kicking in martial arts or splits for dancing), do you want to simply be able to touch your toes or do you want to impress people with fancy yoga asanas? \n\nGood luck!", "created_utc": "1614511606.0", "edited": "False", "id": "gp5ugvx", "is_submitter": "False", "link_id": "t3_lu21sk", "parent_id": "t3_lu21sk", "score": "1", "subreddit": "bodyweightfitness", "subreddit_id": "t5_2tf0a"}, {"author": "CrashingFirefly", "body": "Yes, L-sit pull-ups are much harder, especially on the bottom part of the movement; completely normal! You can do a progression towards the L-sit pull-up, such as the tuck L-sit pull-up (or any progression towards the normal L-sit). Good luck!", "created_utc": "1614273328.0", "edited": "False", "id": "goq54xr", "is_submitter": "False", "link_id": "t3_lryoqa", "parent_id": "t1_goq26xt", "score": "2", "subreddit": "bodyweightfitness", "subreddit_id": "t5_2tf0a"}, {"author": "CrashingFirefly", "body": "I don't think ring push-ups are easier than the ring dips. However, as you mention, ring support holds are a great stepping stone towards ring dips! When on top of the rings (either vertically or horizontally) you need strength to stabilise your body, which is why they're harder than the bar variation. The shaking is fine for now; it means you're body is giving it all to remain steady! ;)", "created_utc": "1614261777.0", "edited": "False", "id": "gopersd", "is_submitter": "False", "link_id": "t3_lryoqa", "parent_id": "t1_gop6m7o", "score": "2", "subreddit": "bodyweightfitness", "subreddit_id": "t5_2tf0a"}, {"author": "CrashingFirefly", "body": "No worries! Do you turn the rings out (RTO) on top of the movement? If not, start doing that as well, and I'm sure you will feel the chest activation you're after.", "created_utc": "1614193209.0", "edited": "False", "id": "gom5cuo", "is_submitter": "False", "link_id": "t3_lr48n2", "parent_id": "t1_gol1h9y", "score": "2", "subreddit": "bodyweightfitness", "subreddit_id": "t5_2tf0a"}, {"author": "CrashingFirefly", "body": "First off, I'm surprised that var. 2 hits the chest especially. Are you also feeling it in the triceps? Usually, leaning forward targets the chest more, whereas leaning backward (your var. 2) would target the triceps.\n\nAnyway, you've already answered the question yourself! ;) If you can do more reps of var. 1, then it's more challenging than var. 2. I would also consider var. 1 to be the more standard dip, which builds towards other skills (e.g. Bulgarian dip or RTO dip). I believe it's quite natural to feel an exercise more if you're working in a higher rep range (12+), although I'm not entirely sure why this is the case (might have to do with lactic acid build-up in the muscles).\n\nTl;dr Variation 1. \n\nGood luck!", "created_utc": "1614176349.0", "edited": "False", "id": "gol18jd", "is_submitter": "False", "link_id": "t3_lr48n2", "parent_id": "t1_gokyhej", "score": "2", "subreddit": "bodyweightfitness", "subreddit_id": "t5_2tf0a"}, {"author": "CrashingFirefly", "body": "Good to hear you're on a weight loss journey! Weight loss stalls because you're BMR, and thus you're maintenance caloric intake, will decrease as your weight decreases. If you want to keep losing weight, you should reduce your caloric intake ever so often.", "created_utc": "1612777568.0", "edited": "False", "id": "gmkexc0", "is_submitter": "False", "link_id": "t3_lejpgl", "parent_id": "t1_gmk8cny", "score": "1", "subreddit": "Fitness", "subreddit_id": "t5_2qhx4"}, {"author": "CrashingFirefly", "body": "If the pain is truly 'unbearable', then you might want to wear gloves. Otherwise, I'd recommend you to just suck it up for now and before you know it, you have a solid layer of calluses! If you're worried about it, you might want to scrub the top layer of the calluses (with a special scrubbing 'sponge') and apply some hand lotion to prevent ripping, because that can set you back quite a bit. That's usually not necessary, though. Good luck!", "created_utc": "1612024049.0", "edited": "False", "id": "gldorrt", "is_submitter": "False", "link_id": "t3_l8ec6t", "parent_id": "t1_gldmn72", "score": "6", "subreddit": "bodyweightfitness", "subreddit_id": "t5_2tf0a"}, {"author": "CrashingFirefly", "body": "There isn't much mobility required for the support hold, so it's most likely related to strength. I wouldn't worry too much about it; rings have a tendency to find your weakest point, so your left side will probably catch up soon enough. It's great you're filming yourself and you're so aware of your form. Good luck!", "created_utc": "1612018578.0", "edited": "False", "id": "gldealq", "is_submitter": "False", "link_id": "t3_l8ec6t", "parent_id": "t1_glcurxx", "score": "2", "subreddit": "bodyweightfitness", "subreddit_id": "t5_2tf0a"}, {"author": "CrashingFirefly", "body": "Well, if weighted - as in: barbell - is an option, then that's definitely the way to go. Otherwise I'd suggest the pistol squat, but it is up to you what you want to train. The pistol squat gives you a nice challenge and it's a fun skill to work on. Aside from leg strength, you also need some core compression and stability. Good luck!", "created_utc": "1612018339.0", "edited": "False", "id": "glddv9z", "is_submitter": "False", "link_id": "t3_l8ec6t", "parent_id": "t1_gld0pdv", "score": "3", "subreddit": "bodyweightfitness", "subreddit_id": "t5_2tf0a"}, {"author": "CrashingFirefly", "body": "No, you cannot gain weight whilst on a cut, because you are in a negative energy balance (calories going in < calories going out). Muscle tissue, just like adipose tissue, can - and will be - converted into energy.", "created_utc": "1612018028.0", "edited": "False", "id": "glddbpn", "is_submitter": "False", "link_id": "t3_l8iig1", "parent_id": "t1_gldb5xh", "score": "10", "subreddit": "Fitness", "subreddit_id": "t5_2qhx4"}, {"author": "CrashingFirefly", "body": "That's an interesting. Do you have any sources for those claims? As far as I know from a nutrition course I did, high LDL cholesterol levels are actually associated with an increased chance of CVD, so I would call that a detrimental effect.", "created_utc": "1612017794.0", "edited": "False", "id": "gldcxhf", "is_submitter": "False", "link_id": "t3_l8iig1", "parent_id": "t1_gldcc2b", "score": "1", "subreddit": "Fitness", "subreddit_id": "t5_2qhx4"}, {"author": "CrashingFirefly", "body": "The handstand is primarily a skill and doesn't require much strength; the L-sit requires mostly compression strength, some pushing strength and decent flexibility. Strength (and thus hypertrophy) is not the most important factor here. Whether you want to lose or gain weight (or just maintain!) is completely up to you. However, if those two skills are  your only current goals, then you don't need to gain weight. But if you're comfortable in your body as it is, don't worry too much about weight gain :) (as long as it does not get out of hand)", "created_utc": "1611693044.0", "edited": "False", "id": "gkv5jmk", "is_submitter": "False", "link_id": "t3_l56pcx", "parent_id": "t1_gkuvdxu", "score": "1", "subreddit": "bodyweightfitness", "subreddit_id": "t5_2tf0a"}, {"author": "CrashingFirefly", "body": "I would recommend sticking to the same exercise, so you can improve the form/technique of this exercise. Also, although exercises are similar in difficulty, it doesn't mean that they target the exact same muscles. By choosing one exercise, you make sure to develop any weak points you might have.", "created_utc": "1611692528.0", "edited": "False", "id": "gkv491i", "is_submitter": "False", "link_id": "t3_l56pcx", "parent_id": "t1_gkv2btp", "score": "2", "subreddit": "bodyweightfitness", "subreddit_id": "t5_2tf0a"}, {"author": "CrashingFirefly", "body": "Choosing a more difficult progression (e.g. L-sit pull-up) or adding weight should do the trick. For me, higher rep ranges/more volume doesn't seem to be very effective.", "created_utc": "1611516255.0", "edited": "False", "id": "gkmhahv", "is_submitter": "False", "link_id": "t3_l3sxid", "parent_id": "t1_gkmdunb", "score": "2", "subreddit": "bodyweightfitness", "subreddit_id": "t5_2tf0a"}, {"author": "CrashingFirefly", "body": "The C2B pull-up is much harder than a regular pull-up; you might simply lack the strength at this moment. You can progress by doing explosive pull-ups and/or assisted pull-ups to try and reach the chest to bar. Also, make sure to incorporate rows in your routine, as it will help you on the top of the movement.", "created_utc": "1611234138.0", "edited": "False", "id": "gk21ql2", "is_submitter": "False", "link_id": "t3_l1vmyu", "parent_id": "t3_l1vmyu", "score": "6", "subreddit": "bodyweightfitness", "subreddit_id": "t5_2tf0a"}, {"author": "CrashingFirefly", "body": "No, I would recommend against it. If you want, you can do banded/assisted pull-ups after your working set, which are called back-off sets (assuming that you're working exercise is a regular pull-up). Not resting will impede recovery, especially if you're still building up work capacity - which I assume is the case, from the fact that you're doing the bwf primer. Good luck!", "created_utc": "1611233547.0", "edited": "False", "id": "gk20wnk", "is_submitter": "False", "link_id": "t3_l1rhso", "parent_id": "t1_gk1x4az", "score": "1", "subreddit": "bodyweightfitness", "subreddit_id": "t5_2tf0a"}, {"author": "CrashingFirefly", "body": "If possible, practice with a partner. If you have someone to spot you, not much can go wrong. Other than that, I don't have any tips. If you can do both C2W and B2W holds and you can safely bail out, you should be good to go. Also, maybe practice some cartwheels; they might make you more comfortable in bailing out of a HS. Good luck!", "created_utc": "1610894909.0", "edited": "False", "id": "gjldl38", "is_submitter": "False", "link_id": "t3_kz3iqi", "parent_id": "t3_kz3iqi", "score": "1", "subreddit": "bodyweightfitness", "subreddit_id": "t5_2tf0a"}, {"author": "CrashingFirefly", "body": "If possible, practice with a partner. If you have someone to spot you, not much can go wrong. Other than that, I don't have any tips. If you can do both C2W and B2W holds and you can safely bail out, you should be good to go. Also, maybe practice some cartwheels; they might make you more comfortable in bailing out of a HS. Good luck!", "created_utc": "1610894882.0", "edited": "False", "id": "gjldi57", "is_submitter": "False", "link_id": "t3_kz3iqi", "parent_id": "t3_kz3iqi", "score": "6", "subreddit": "bodyweightfitness", "subreddit_id": "t5_2tf0a"}, {"author": "CrashingFirefly", "body": "I've already posted this in the Mint subreddit, but figured this subreddit is probably more active. Any help is very welcome!", "created_utc": "1610548327.0", "edited": "False", "id": "gj45b34", "is_submitter": "True", "link_id": "t3_kwhirw", "parent_id": "t3_kwhirw", "score": "1", "subreddit": "linux4noobs", "subreddit_id": "t5_2qy7t"}, {"author": "CrashingFirefly", "body": "Well, there's a myriad of options to choose from, but it all boils down to increasing the volume. If you need a minute of a rest, then that's perfect. You can just do EMOM (every minute on the minute), which simply means: Pull-up, rest 1 minute, repeat - 10 minutes = 10 pull-ups. Once you get comfortable, you can do 2 pull-ups or increase the total number of sets. Also, you can incorporate back-off sets: After your 'normal' working sets, you do an easier progression of the exercise (or less weight, when using barbell or dumbbells). You could do this with assisted pull-ups (resistance bands) or negative pull-ups. Good luck!", "created_utc": "1610272961.0", "edited": "False", "id": "gir1ygb", "is_submitter": "False", "link_id": "t3_ku7w37", "parent_id": "t1_giqyqkf", "score": "3", "subreddit": "bodyweightfitness", "subreddit_id": "t5_2tf0a"}, {"author": "CrashingFirefly", "body": "Thanks, that's very useful!", "created_utc": "1609926327.0", "edited": "False", "id": "giaes1b", "is_submitter": "True", "link_id": "t3_kr6s7o", "parent_id": "t1_gi8i5tp", "score": "2", "subreddit": "askphilosophy", "subreddit_id": "t5_2sc5r"}, {"author": "CrashingFirefly", "body": "If you have rings, do Ring PU. They're great for building the chest. I believe Dominik Sky has a video with Ring PU progressions. Make sure to do the exercise with RTO to also properly activate the pecs. Good luck!", "created_utc": "1609580401.0", "edited": "False", "id": "ghtbzbj", "is_submitter": "False", "link_id": "t3_koqpg7", "parent_id": "t3_koqpg7", "score": "2", "subreddit": "bodyweightfitness", "subreddit_id": "t5_2tf0a"}, {"author": "CrashingFirefly", "body": "No, because it does not leave any space for rest. Now, that wouldn't be too much of a problem if you don't train to failure, but once you get to a certain number (let's say >100) you won't be able to recover sufficiently. Especially when untrained, this challenge seems like a sure setup for injury. \n\nIf you decide to still do it (again, I do not recommend), split up the number of reps per day in a lot of sets (e.g. 10x5 vs. 2x25).", "created_utc": "1608720695.0", "edited": "False", "id": "ggschct", "is_submitter": "False", "link_id": "t3_kinknq", "parent_id": "t1_ggs9g1g", "score": "1", "subreddit": "bodyweightfitness", "subreddit_id": "t5_2tf0a"}, {"author": "CrashingFirefly", "body": "Yeah, I love that attitude! Good on you! :) I also had to workout in the rain today. Not too comfortable, but we're get to practice some willpower along the way!", "created_utc": "1608575945.0", "edited": "False", "id": "gglz5xf", "is_submitter": "False", "link_id": "t3_khbhuk", "parent_id": "t1_gglgpdn", "score": "2", "subreddit": "bodyweightfitness", "subreddit_id": "t5_2tf0a"}, {"author": "CrashingFirefly", "body": "For handstands you could use the wall to do heel and toe pulls or scissors (alternating legs). This can help to improve form.", "created_utc": "1608204069.0", "edited": "False", "id": "gg4rm4v", "is_submitter": "False", "link_id": "t3_kdg5wy", "parent_id": "t1_gg20pm8", "score": "2", "subreddit": "bodyweightfitness", "subreddit_id": "t5_2tf0a"}, {"author": "CrashingFirefly", "body": "I suppose you could somehow, but as far as l know, GANs are used for generating multimedia data (e.g. imagery). GANs make use of (de)convolutional NNs, and I don't think it makes much sense to apply those to single-dimension data. \n\nFor numeric data, easier approaches exist to generate data, such as bootstrapping or using a normal distribution.", "created_utc": "1608025050.0", "edited": "1608025233.0", "id": "gfwole0", "is_submitter": "False", "link_id": "t3_kdf8yz", "parent_id": "t3_kdf8yz", "score": "1", "subreddit": "learnmachinelearning", "subreddit_id": "t5_3cqa1"}, {"author": "CrashingFirefly", "body": "Thanks! That's really helpful :) I have actually been trying something like that, but I was a bit worried that I'd force myself too much in the position, thereby straining the back. Good to hear that it has worked well for you!", "created_utc": "1607932618.0", "edited": "False", "id": "gfsk2s8", "is_submitter": "True", "link_id": "t3_jmtsn6", "parent_id": "t1_gfr96xl", "score": "2", "subreddit": "flexibility", "subreddit_id": "t5_2t7mg"}, {"author": "CrashingFirefly", "body": "I'm reading about self-supervision. The term 'projection head' pops up all the time, but I cannot find a definition of what it is. Can anyone explain it (in ELI5 wording)? Much appreciated!", "created_utc": "1607514893.0", "edited": "False", "id": "gf5r6wp", "is_submitter": "False", "link_id": "t3_k822f6", "parent_id": "t3_k822f6", "score": "2", "subreddit": "MachineLearning", "subreddit_id": "t5_2r3gv"}, {"author": "CrashingFirefly", "body": "There is no set amount of pull-ups you should be able to do to start adding weight. In the end, what matters is what your goal is and adjust your training accordingly. If you want to focus on strength, you should probably train in the low rep range (say, 3-5 reps per set). In that case, you can add the weight that still allows you to perform those reps with clean form. Whether you're pulling BW or BW + additional weight doesn't matter.", "created_utc": "1606562656.0", "edited": "False", "id": "gduxson", "is_submitter": "False", "link_id": "t3_k2jfr1", "parent_id": "t3_k2jfr1", "score": "3", "subreddit": "bodyweightfitness", "subreddit_id": "t5_2tf0a"}, {"author": "CrashingFirefly", "body": "You clearly have experience with stretching. It seems like you want to share our own struggle regarding flexibility. I do no try to insinuate that I can achieve a perfect pancake in three months, but my problem is that I cannot seem to do the pancake stretch properly (the most basic progressions) and I am asking for help on this subreddit. What is your suggestion?", "created_utc": "1604412410.0", "edited": "False", "id": "gb06vbg", "is_submitter": "True", "link_id": "t3_jmtsn6", "parent_id": "t1_gazwm0g", "score": "1", "subreddit": "flexibility", "subreddit_id": "t5_2t7mg"}, {"author": "CrashingFirefly", "body": "Thank you for sharing. I've tried both, but I just cannot seem to activate the proper muscles. Do you have any posture cues for the elevated or standing pancake?", "created_utc": "1604389067.0", "edited": "False", "id": "gazgzgp", "is_submitter": "True", "link_id": "t3_jmtsn6", "parent_id": "t1_gazcfra", "score": "1", "subreddit": "flexibility", "subreddit_id": "t5_2t7mg"}, {"author": "CrashingFirefly", "body": "I agree, it is incredible! But motivation alone does not seem to help me with the question ;)", "created_utc": "1604389001.0", "edited": "False", "id": "gazgwzc", "is_submitter": "True", "link_id": "t3_jmtsn6", "parent_id": "t1_gayfxz1", "score": "1", "subreddit": "flexibility", "subreddit_id": "t5_2t7mg"}, {"author": "CrashingFirefly", "body": "Yes, it should be no problem that the rings become wet. Just make sure to put them somewhere to dry when you can home from your training (so don't leave them in a closed bag!). Good luck! And awesome that the rain doesn't stop you from training outside ;)", "created_utc": "1603998886.0", "edited": "False", "id": "gaiuekp", "is_submitter": "False", "link_id": "t3_jk4sne", "parent_id": "t1_gai0med", "score": "2", "subreddit": "bodyweightfitness", "subreddit_id": "t5_2tf0a"}, {"author": "CrashingFirefly", "body": "Mobility before exercising is good; passive flexibility should generally be avoided before exercising.", "created_utc": "1603972880.0", "edited": "False", "id": "gahcjop", "is_submitter": "False", "link_id": "t3_jk4sne", "parent_id": "t1_gah7jzw", "score": "3", "subreddit": "bodyweightfitness", "subreddit_id": "t5_2tf0a"}, {"author": "CrashingFirefly", "body": "Yes. By working in different rep ranges, you can train explosiveness, strength, hypertrophy and endurance. However, goals at different ends of the spectrum might not be completely compatible with one another. Anyhow, you might want to have a look into DUP (Daily Undulating Periodization) routines. That's what I'm using and it's quite well suited for improving both strength and explosiveness simultanously. Good luck!", "created_utc": "1603972805.0", "edited": "False", "id": "gahcg22", "is_submitter": "False", "link_id": "t3_jk4sne", "parent_id": "t1_gah3kdv", "score": "2", "subreddit": "bodyweightfitness", "subreddit_id": "t5_2tf0a"}, {"author": "CrashingFirefly", "body": "Thanks! So you did notice that your eyes adjusted to the darkness? And do you have any tips for good, (somewhat) affordable LED clubs? And do torches actually help with visibility (since the handles still might hard to see)?", "created_utc": "1603801771.0", "edited": "False", "id": "ga9l11c", "is_submitter": "True", "link_id": "t3_jilcbs", "parent_id": "t1_ga950lr", "score": "1", "subreddit": "juggling", "subreddit_id": "t5_2qs90"}, {"author": "CrashingFirefly", "body": "Thanks for the tip! Not sure how well those lights would help indeed..", "created_utc": "1603801619.0", "edited": "False", "id": "ga9ktm7", "is_submitter": "True", "link_id": "t3_jilcbs", "parent_id": "t1_ga7ourv", "score": "1", "subreddit": "juggling", "subreddit_id": "t5_2qs90"}, {"author": "CrashingFirefly", "body": "Try deep ring dips. That's what got me to the ring muscle-up. Then, start using the negative ring muscle-ups and try to go as slow as possible. You can also incorporate baby muscle-ups (look up on YT) and try to use your feet less and less. Good luck!", "created_utc": "1600775636.0", "edited": "False", "id": "g67ej67", "is_submitter": "False", "link_id": "t3_iwimg2", "parent_id": "t3_iwimg2", "score": "1", "subreddit": "bodyweightfitness", "subreddit_id": "t5_2tf0a"}, {"author": "CrashingFirefly", "body": "33", "created_utc": "1600499021.0", "edited": "False", "id": "g5sk091", "is_submitter": "False", "link_id": "t3_ivnaqh", "parent_id": "t3_ivnaqh", "score": "2", "subreddit": "bodyweightfitness", "subreddit_id": "t5_2tf0a"}, {"author": "CrashingFirefly", "body": "Yes, stretching should be fine. Especially light stretching (e.g. easy yoga poses), can be done very frequent.", "created_utc": "1600415557.0", "edited": "False", "id": "g5olihl", "is_submitter": "False", "link_id": "t3_iv0na3", "parent_id": "t1_g5okzam", "score": "3", "subreddit": "bodyweightfitness", "subreddit_id": "t5_2tf0a"}, {"author": "CrashingFirefly", "body": "This of course depends on your karate training. I have never done karate, so I do not know: Do you train mostly technique, endurance, strength, ...? I used to do Krav Maga 2-3 times a week, and combined this with strength (RR or 'regular' gym workout) 3 times per week. I also did some running and dancing. I have you find a good balance of different aspects of training (strength, endurance, balance, flexibility and coordination), you can definitely train RR alongside your karate. Just make sure to rest plenty and most importantly: listen to your body.", "created_utc": "1600414530.0", "edited": "False", "id": "g5okjo8", "is_submitter": "False", "link_id": "t3_iv1h39", "parent_id": "t3_iv1h39", "score": "5", "subreddit": "bodyweightfitness", "subreddit_id": "t5_2tf0a"}, {"author": "CrashingFirefly", "body": "Thanks for the advice Ribbit40! So far, I am working on the SA Frog Stand with taking one knee off, so still have some work to do. But it's a good tip, I'll remember it!\n\nAs for the backbend walkover, I cannot do it yet either ;) It's my long(er) term goal. Currently, I'm trying to improve my bridge/wheel and work towards a dropback into bridge. \n\nAnd yeah, juggling (esp. with clubs) is super fun! :) It's also an interesting way to train coordination and mind-muscle connection (which might also carry over to bwt).", "created_utc": "1600409665.0", "edited": "False", "id": "g5ofe3x", "is_submitter": "False", "link_id": "t3_it31rn", "parent_id": "t1_g5mob7y", "score": "1", "subreddit": "bodyweightfitness", "subreddit_id": "t5_2tf0a"}, {"author": "CrashingFirefly", "body": "Sure, splitting up the RR routine (e.g. into Push/Pull) and spreading it over multiple days is fine :) You can easily maintain the same workload (although it will, in total, still take you just as much time).", "created_utc": "1600340855.0", "edited": "False", "id": "g5kni4y", "is_submitter": "False", "link_id": "t3_iudolk", "parent_id": "t1_g5kmhx0", "score": "1", "subreddit": "bodyweightfitness", "subreddit_id": "t5_2tf0a"}, {"author": "CrashingFirefly", "body": "# Male, 23 y, 184 cm (6'0''), ~77 kg / ~170 lbs\n\n**Goals**:\n\n* Main:\n   * 10 sec. FS Handstand in 50% of tries (i.e. kick-up)\n   * Bar Muscle-Up (with kipping)\n* Secondary:\n   * 10 sec. Tuck Planche\n   * 5x5 Pull-Up + 30 Kg\n   * 4x8 Backsquat 60 Kg\n   * 4x8 Deadlift 100 Kg\n   * 10 sec. One Arm Elbow Lever / Peacock Pose / Turtle (bboy)\n   * Pike with flat hands on ground (after warm-up/stretch)\n   * Backbend Walkover\n   * Improve grip strength\n\n**Routine**\n\n*Skillwork* (-> Handstand):\n\n* Chest-2-Wall 3 x 30s \n* Wall Scissors: Take one leg off at the time, alternate\n* Kick-up into Freestanding\n\n*Strength*\n\n* Explosive Pull-Ups: 5 x 2-3\n* Weighted Pull-Ups (+ 10 Kg / 22 Lbs): 5 x 3-5\n* Russian Dips (ass.): 5 x 2-3\n* Squat OR Deadlift: 4 x 5-8\n* SA Frog Stand: 5 x 8s hold\n* Seated Row (64 Kg / 141 Lbs): 4 x 5-8\n\n*Grip* (-> Routine from r/GripTraining\n\n* Pinch Hold: 3 x 15-20s per hand x 16 Kg / 35 Lbs (wooden block)\n* Wrist Curl (25 Kg / 55 Lbs): 3 x 15\n* Rev. Wrist Curl (25 Kg / 55 Lbs): 3 x 15\n\n*Flexibility* (-> Routine from Dominik Sky)\n\n* Hamstring / Pike:\n   * Iso. Hold: 3 x 10s\n   * Jefferson Curl: 3 x 5 + \\~30s hold\n\nI perform this routine 3x per week. As for the \"Squat OR Deadlift\", I plan on alternating this per workout (so performing Squat and Deadlift each 3x per 2 weeks). At the end of the routine, I do either the Grip or Flexibitiy part (same as for Squat and Deadlift). This workout takes me about 1.5 - 2 hours, as I take quite long rest times between sets (esp. for low rep. range exercises). \n\nI plan to stretch additionally (practically) each evening, alternating a Hip Mobility (-> Routine by Tom Merrick) and Backbend / Bridge stretch (from r/flexibility).\n\nOn off-days, I plan to do relatively short running sessions (\\~30 min, 6-7 Km / 3-4 Mile). At the moment, I also do a lot of (club) juggling, which could be seen as a form of LISS. On the off-days, I also like to practice the elbow lever and bboy moves. Next to this, I do bboy and bouldering both 1x per week (in the evening). \n\n**Diet/Mood/Energy/Anything else relevant to your training:**\n\nI have lost some weight in the last months. I plan to lean bulk and I track my weight by measuring it each morning. I am on a plant-based diet (for as far it matters).\n\n**Questions:**\n\nAny feedback is very welcome! I'd love to hear what you think about this routine. At first, I did a u/L routine, but I decided that since my main goals are not really lower-body related, I'd better stick to a Full-body routine. \n\n*Specific questions*:\n\n* Do I include sufficient exercises to train for the muscle-up? Once I have increased the weight of the weighted pull-up and I can confidently perform Russian Dips (unass.), I will incorporate more direct muscle-up exercises into my routine.\n* Do I include sufficient leg work? For now, it is only the backsquat and deadlift (on alternating training days). I have also read people encouraging to squat each training and deadlift only once per week. What are your thoughts? Mind you, leg work is not my main priority, but as you can see from my stats, I do need to improve quite a bit.\n* Should certain exercises be done every day, e.g. the SA Frog Stand / Tuck Planche progressions? Or does it suffice to do these 3x per week (each training)?\n\n&#x200B;\n\nThanks in advance! :)", "created_utc": "1600177623.0", "edited": "False", "id": "g5crtn8", "is_submitter": "False", "link_id": "t3_it31rn", "parent_id": "t3_it31rn", "score": "2", "subreddit": "bodyweightfitness", "subreddit_id": "t5_2tf0a"}, {"author": "CrashingFirefly", "body": "When I considered  (track) running with a weight vest, I read a bit about it. The consensus seems to be that it is risky for the joints, because of the impact of the extra 'loose' weight. So in this case, I would recommend to avoid extra weight for jumping/running. I guess the best way to improve is to have a higher platform to jump on.", "created_utc": "1600015750.0", "edited": "False", "id": "g54p8jt", "is_submitter": "False", "link_id": "t3_irsyt8", "parent_id": "t1_g53nqd7", "score": "1", "subreddit": "bodyweightfitness", "subreddit_id": "t5_2tf0a"}, {"author": "CrashingFirefly", "body": "Start with losing weight, then start to bulk again. Having a higher fat percentage means you will gain more fat (instead of muscle) when bulking. Good luck!", "created_utc": "1600015567.0", "edited": "False", "id": "g54otwa", "is_submitter": "False", "link_id": "t3_irsyt8", "parent_id": "t1_g54n12a", "score": "1", "subreddit": "bodyweightfitness", "subreddit_id": "t5_2tf0a"}, {"author": "CrashingFirefly", "body": "Look up the pancake stretch. It's probably the hip flexors. Also, see r/flexibility for more info.", "created_utc": "1599554357.0", "edited": "False", "id": "g4fafgr", "is_submitter": "False", "link_id": "t3_iood4v", "parent_id": "t1_g4f6qv6", "score": "2", "subreddit": "bodyweightfitness", "subreddit_id": "t5_2tf0a"}, {"author": "CrashingFirefly", "body": "Yes. For example, if you are doing HS on your skill day, you should definitely prepare the wrists. Depending on what skill you are working on, you want to warm-up the required muscles and prep the joints. In general, a warm-up is a good way to also mentally prepare for the workout.", "created_utc": "1599554309.0", "edited": "False", "id": "g4fady2", "is_submitter": "False", "link_id": "t3_iood4v", "parent_id": "t1_g4f7d6q", "score": "2", "subreddit": "bodyweightfitness", "subreddit_id": "t5_2tf0a"}, {"author": "CrashingFirefly", "body": "I do mainly (weighted) calisthenics: Skill and ring work, combined with leg compounds (squat, deadlift). My main goal is skill development and becoming stronger (aesthetics is secundary). However, I do like to know whether it would be better to (lean) bulk or eat in a deficit. Thanks for any help/recommendations!", "created_utc": "1599485996.0", "edited": "False", "id": "g4bv5xf", "is_submitter": "True", "link_id": "t3_io7kkz", "parent_id": "t3_io7kkz", "score": "2", "subreddit": "BulkOrCut", "subreddit_id": "t5_2x3i0"}, {"author": "CrashingFirefly", "body": "Hopefully this thread will be removed by the moderators, but before that happens: Do your own research. Read the Wiki of this subreddit, go through older posts and use Google. Then, when you have a specific question about your routine, post it here. With an attitude of throwing your arms in the air and directly asking others for help, you are compromising your own progression. A major part of training is learning about creating routines, finding appropriate exercises, etc.", "created_utc": "1599307973.0", "edited": "False", "id": "g445lk2", "is_submitter": "False", "link_id": "t3_imy28s", "parent_id": "t3_imy28s", "score": "1", "subreddit": "bodyweightfitness", "subreddit_id": "t5_2tf0a"}, {"author": "CrashingFirefly", "body": "I would go as far to say that the pull-up is the only exercise in the RR you cannot skip ;) You could consider buying a door pull-up bar or rings (which could be hung from a sturdy (!) branch). Do you have a calisthenics park in the vicinity maybe?", "created_utc": "1599030788.0", "edited": "False", "id": "g3ox73v", "is_submitter": "False", "link_id": "t3_il1eo9", "parent_id": "t1_g3ovm80", "score": "5", "subreddit": "bodyweightfitness", "subreddit_id": "t5_2tf0a"}, {"author": "CrashingFirefly", "body": "Do you use a suppinated (chin-up) or pronated grip? In the suppinated grip, you activate the biceps more than in the pronated grip. However, where you feel the movement might also depend on what muscles are more developed. In the pull-up, you can try to activate the back (lats) more by retracting your scapula. Good luck!", "created_utc": "1598519810.0", "edited": "False", "id": "g307pm0", "is_submitter": "False", "link_id": "t3_ihfqym", "parent_id": "t1_g304b0b", "score": "0", "subreddit": "bodyweightfitness", "subreddit_id": "t5_2tf0a"}, {"author": "CrashingFirefly", "body": "I see I basically posted what BatmanBeyond2100 already wrote up.", "created_utc": "1594031264.0", "edited": "False", "id": "fx34ty9", "is_submitter": "False", "link_id": "t3_hm1qx9", "parent_id": "t1_fx34rc1", "score": "4", "subreddit": "bodyweightfitness", "subreddit_id": "t5_2tf0a"}, {"author": "CrashingFirefly", "body": "Rings force you to work muscles you might not use that often with other exercises, because you have to constantly stabilize your body. I believe Ido Portal said something like \"rings always find your weak spot\". If you're just starting out, it is okay that you're shaky on the rings. Try to start with isometric ring holds, with the rings shoulder width apart. As for pulling, you could start with ring rows. If you are not able to do those exercises, I would suggest waiting a bit with the rings and build more foundational strength first. Good luck!", "created_utc": "1594031190.0", "edited": "False", "id": "fx34rc1", "is_submitter": "False", "link_id": "t3_hm1qx9", "parent_id": "t3_hm1qx9", "score": "5", "subreddit": "bodyweightfitness", "subreddit_id": "t5_2tf0a"}, {"author": "CrashingFirefly", "body": "Is it hurting during the stretch, or/also after the stretch?", "created_utc": "1594030136.0", "edited": "False", "id": "fx33qgm", "is_submitter": "False", "link_id": "t3_hm275j", "parent_id": "t1_fx2uhne", "score": "1", "subreddit": "bodyweightfitness", "subreddit_id": "t5_2tf0a"}, {"author": "CrashingFirefly", "body": "'Strong' is really good. Mostly focused on weightlifting, but can be used for calisthenics as well.", "created_utc": "1594030075.0", "edited": "False", "id": "fx33oan", "is_submitter": "False", "link_id": "t3_hm275j", "parent_id": "t1_fx2zu5x", "score": "1", "subreddit": "bodyweightfitness", "subreddit_id": "t5_2tf0a"}, {"author": "CrashingFirefly", "body": "I'd suggest to decrease the reps (in this case to 7) to make sure you are not compromising form. Good luck!", "created_utc": "1593937751.0", "edited": "False", "id": "fwzd1be", "is_submitter": "False", "link_id": "t3_hlhsp0", "parent_id": "t1_fwz9mof", "score": "1", "subreddit": "bodyweightfitness", "subreddit_id": "t5_2tf0a"}, {"author": "CrashingFirefly", "body": "This. Once you have developed a strong habit, it's hard to change. Use it in your favour.", "created_utc": "1593686713.0", "edited": "False", "id": "fwokpc2", "is_submitter": "False", "link_id": "t3_hjdzym", "parent_id": "t1_fwlltc8", "score": "2", "subreddit": "bodyweightfitness", "subreddit_id": "t5_2tf0a"}, {"author": "CrashingFirefly", "body": "Thanks! The system time and hardware clock are now correct, also after a reboot. However, in browser, the incorrect time is still shown (my calendar shows it's 13:30, whilst it is 15:30). The Firefox application shipped with ParrotOS has a lot of privacy protection tools (such as Privacy Badger, uBlock origin, etc.), which migth be blocking computer data from being shared with the browser. However, also after disabling all these tools for the [tutanota.com](https://tutanota.com) website, the incorrect time is still displayed. Any ideas on how to solve this?", "created_utc": "1593437493.0", "edited": "False", "id": "fwd5yvv", "is_submitter": "True", "link_id": "t3_hhfn7i", "parent_id": "t1_fwa1noh", "score": "1", "subreddit": "linux4noobs", "subreddit_id": "t5_2qy7t"}, {"author": "CrashingFirefly", "body": "Thanks for helping! I have tried to sync the hardware clock with UTC by running \\`hwclock -w --localtime\\`, but does not seem to have solved it.\n\n`date` outputs:\n\n`Sun 28 Jun 2020 05:28:52 PM CEST`\n\n`sudo hwclock --show` outputs:\n\n`2020-06-28 17:28:59.762920+02:00`\n\nAlso thanks for the link. However, Windows' clock being off does not matter that much, as Linux is my main OS.", "created_utc": "1593358215.0", "edited": "False", "id": "fw9u4fi", "is_submitter": "True", "link_id": "t3_hhfn7i", "parent_id": "t1_fw9t9vj", "score": "1", "subreddit": "linux4noobs", "subreddit_id": "t5_2qy7t"}, {"author": "CrashingFirefly", "body": "Nope, unfortunately not.. But I should also mention that the time displayed is always incorrect; whether I have rebooted into Windows before or not.", "created_utc": "1593356735.0", "edited": "False", "id": "fw9rjih", "is_submitter": "True", "link_id": "t3_hhfn7i", "parent_id": "t1_fw9rbrl", "score": "1", "subreddit": "linux4noobs", "subreddit_id": "t5_2qy7t"}, {"author": "CrashingFirefly", "body": "Thanks for the feedback! However, I'm a bit confused about what you wrote down: To what variation are you referring with 'this variation'? Because you mention locked elbows in both cases. Clarification would be much appreciated! :)\n\nAnd I will move the rings closer together. But doesn't a wider grip make a movement (in general) harder? Because you are less stable and need more strength to pull the rings together?", "created_utc": "1593178645.0", "edited": "False", "id": "fw27j37", "is_submitter": "False", "link_id": "t3_hg27kl", "parent_id": "t1_fw210wv", "score": "1", "subreddit": "bodyweightfitness", "subreddit_id": "t5_2tf0a"}, {"author": "CrashingFirefly", "body": "[https://streamable.com/mxa8ny](https://streamable.com/mxa8ny)\n\n23M, 76KG, 184cm\n\nRing Archer PU (with RTO at the top of the movement)\n\n4 reps per set max, with arms locked out completey\n\n**Question**: \n\n* Should I lock the arms out like I do know, or is it better to keep a slight bend in the elbows?\n* Is it better to position the rings closer together (approx. shoulder width)?\n\nAny feedback is highly appreciated!\n\nP.S. Don't mind my extremely angry face in the movement.", "created_utc": "1593162103.0", "edited": "False", "id": "fw1n2en", "is_submitter": "False", "link_id": "t3_hg27kl", "parent_id": "t3_hg27kl", "score": "1", "subreddit": "bodyweightfitness", "subreddit_id": "t5_2tf0a"}, {"author": "CrashingFirefly", "body": "If you're in Europe, I suggest buying the Decathlon rings. I'm very happy with them and their customer support is super helpful.", "created_utc": "1593066529.0", "edited": "False", "id": "fvxhzx7", "is_submitter": "False", "link_id": "t3_hevjux", "parent_id": "t1_fvx8w31", "score": "1", "subreddit": "bodyweightfitness", "subreddit_id": "t5_2tf0a"}, {"author": "CrashingFirefly", "body": "Depends on your goal, I'd say. With weighted pull-ups you're focusing more on strength and you will be training in a lower rep range (like you mention). If you are strong enough to do weighted pull-ups, and that's what you want to get better at, I would suggest just starting those. Also, try to only do reps with clean form. If you cannot do 3x8 reps with good form, decrease the reps to a number you can do with proper form consistently. Best of luck!", "created_utc": "1593066469.0", "edited": "False", "id": "fvxhxju", "is_submitter": "False", "link_id": "t3_hevjux", "parent_id": "t1_fvxb24v", "score": "2", "subreddit": "bodyweightfitness", "subreddit_id": "t5_2tf0a"}, {"author": "CrashingFirefly", "body": "Maybe Decathlon? Not sure about the shipping, but they have good, afordable wooden rings.", "created_utc": "1593009864.0", "edited": "False", "id": "fvutak9", "is_submitter": "False", "link_id": "t3_he96wq", "parent_id": "t1_fvrgwrj", "score": "1", "subreddit": "bodyweightfitness", "subreddit_id": "t5_2tf0a"}, {"author": "CrashingFirefly", "body": "Not a physiotherapist, but I don't really see how doing chest exercises would make your posture worse?", "created_utc": "1593009756.0", "edited": "False", "id": "fvut32n", "is_submitter": "False", "link_id": "t3_he96wq", "parent_id": "t1_fvtm5xu", "score": "1", "subreddit": "bodyweightfitness", "subreddit_id": "t5_2tf0a"}, {"author": "CrashingFirefly", "body": "You should see changes, but it oc very much depends on what you're doing. Could you specify? Also, what is your age/gender/height/weight?", "created_utc": "1592750092.0", "edited": "False", "id": "fvjhbwr", "is_submitter": "False", "link_id": "t3_hbvc4c", "parent_id": "t1_fvhe5l4", "score": "1", "subreddit": "bodyweightfitness", "subreddit_id": "t5_2tf0a"}, {"author": "CrashingFirefly", "body": "Anything related to movement will help you get fitter. Define 'fit'. What is your goal?", "created_utc": "1592743744.0", "edited": "False", "id": "fvj8ff3", "is_submitter": "False", "link_id": "t3_hcgwxz", "parent_id": "t1_fvj83eo", "score": "1", "subreddit": "bodyweightfitness", "subreddit_id": "t5_2tf0a"}, {"author": "CrashingFirefly", "body": "Rings anyime! :)", "created_utc": "1592735084.0", "edited": "False", "id": "fviz8dw", "is_submitter": "False", "link_id": "t3_hcgwxz", "parent_id": "t1_fvhi9b3", "score": "2", "subreddit": "bodyweightfitness", "subreddit_id": "t5_2tf0a"}, {"author": "CrashingFirefly", "body": "Increasing the rep amount is not going to help you much. Training in a high rep range (+12) helps to increase endurance, not primarily strenght. To be able to do a OA pull-up, you are better of working on weighted pull-ups. \n\nHere's two sources explaining the OA pull-up progressions:\n\n* [https://www.bodybuilding.com/content/how-to-train-for-a-one-arm-pull-up.html](https://www.bodybuilding.com/content/how-to-train-for-a-one-arm-pull-up.html)\n* [https://thepullupsolution.com/blog/5-smart-steps-to-your-first-1-arm-pull-up](https://thepullupsolution.com/blog/5-smart-steps-to-your-first-1-arm-pull-up)\n\nIn the first article, weighted pull-ups are not being used in the programming. However, other means to increase the intensity of the pull-up are used to build toward a OA pull-up. In the second one, 15-20 pull-ups and a weighted pull-up with \\~50% of your weight is recommended for starting to train the OA pull-up. \n\nIn the end, these are just rough guidelines; every body is different. However, these should give you some idea. \n\nMyself I like to use weighted pull-ups, because it is easy to progressively overload and track progress.\n\nGood luck!", "created_utc": "1592379380.0", "edited": "False", "id": "fv3o80h", "is_submitter": "False", "link_id": "t3_hamgnb", "parent_id": "t3_hamgnb", "score": "3", "subreddit": "bodyweightfitness", "subreddit_id": "t5_2tf0a"}, {"author": "CrashingFirefly", "body": "You should definitely feel your pecs 'working' to keep your body straight and on top of the rings in a RTO support hold. I would suggest to upload a photo/video to show your form (-> use the Friday Form thread), so we can give proper feedback. Anyhow, if you are not feeling the chest, it might be because you are not pushing properly through the shoulders. Give that a try! :)\n\nAlso, I am not sure what you mean by a *dip support hold*? Here is a great example of the support holds: [https://antranik.org/support-hold/](https://antranik.org/support-hold/).", "created_utc": "1592378825.0", "edited": "False", "id": "fv3nnec", "is_submitter": "False", "link_id": "t3_halj1x", "parent_id": "t3_halj1x", "score": "6", "subreddit": "bodyweightfitness", "subreddit_id": "t5_2tf0a"}, {"author": "CrashingFirefly", "body": "Obrigado! É sempre util ter outras opções :)", "created_utc": "1592042094.0", "edited": "False", "id": "fuoulsn", "is_submitter": "True", "link_id": "t3_h0u1ql", "parent_id": "t1_fun7zxp", "score": "1", "subreddit": "Portuguese", "subreddit_id": "t5_2sqn7"}, {"author": "CrashingFirefly", "body": "You are moving at a good pace (although it could be a bit slower) and you seem to be properly pushing through the shoulders at the top of the movement. I would suggest you try to avoid tilting over to the front too much when lowering yourself and instead try to maintain an upright position. It is of course also better to minimise shaking, but I assume this is something you are aware of and already working on.\n\nThis video does a good job explaining the ring dip in more detail: [https://www.youtube.com/watch?v=Kr5Uuuy5DAI](https://www.youtube.com/watch?v=Kr5Uuuy5DAI).", "created_utc": "1590742161.0", "edited": "False", "id": "fs6kfe6", "is_submitter": "False", "link_id": "t3_gsn8gu", "parent_id": "t1_fs6bqjs", "score": "2", "subreddit": "bodyweightfitness", "subreddit_id": "t5_2tf0a"}, {"author": "CrashingFirefly", "body": "I agree, the alternatives seem limited. I was thinking of converting the exam into an essay, which the students only get limited time allocated for. Students could still discuss, but it is much easier to pick out plagiarism. However, the topic (machine learning) might not lend itself too much for this..", "created_utc": "1586419078.0", "edited": "False", "id": "fmvjd29", "is_submitter": "True", "link_id": "t3_fx1lhn", "parent_id": "t1_fmt4l03", "score": "1", "subreddit": "privacy", "subreddit_id": "t5_2qhlc"}, {"author": "CrashingFirefly", "body": "I guess that would work indeed, but this is definitely too much hassle for most students. Aside from GNU/Linux as my daily OS, I also have an installation of Windows (in cases I need to use software which doesn't run on Linux), so in terms of the software I'm not too worried. However, like I mentioned, I don't like to have a third-party inspecting my room, ID, face..", "created_utc": "1586338244.0", "edited": "False", "id": "fmrwopy", "is_submitter": "True", "link_id": "t3_fx1lhn", "parent_id": "t1_fmrwbfv", "score": "2", "subreddit": "privacy", "subreddit_id": "t5_2qhlc"}, {"author": "CrashingFirefly", "body": "Estás a referir ao nosso ministro de economia? Não me sinto muito responsável pelas ações dele, mas qualquer forma, peço-te desculpa por ele ;)", "created_utc": "1586009750.0", "edited": "False", "id": "fmeoeqz", "is_submitter": "False", "link_id": "t3_fu6ouc", "parent_id": "t1_fmcxfv9", "score": "1", "subreddit": "portugal", "subreddit_id": "t5_2qmie"}, {"author": "CrashingFirefly", "body": "Não tinha pensado nisso, mas parece-me uma organização fixe! Obrigado", "created_utc": "1585997808.0", "edited": "False", "id": "fmeboyw", "is_submitter": "False", "link_id": "t3_fu6ouc", "parent_id": "t1_fmbl5ru", "score": "1", "subreddit": "portugal", "subreddit_id": "t5_2qmie"}, {"author": "CrashingFirefly", "body": "Obrigado! Não me importa se uma empresa é um pouca mais atrás. Não estou à procura da melhor empresa no mundo para o meu estágio.", "created_utc": "1585997538.0", "edited": "False", "id": "fmebgy7", "is_submitter": "False", "link_id": "t3_fu6ouc", "parent_id": "t1_fmbxju5", "score": "1", "subreddit": "portugal", "subreddit_id": "t5_2qmie"}, {"author": "CrashingFirefly", "body": "Obrigado! Isso é ótimo! :) E com 'these current times' estás a referir à crise de COVID-19, ou mais em geral (com a situação económica)?", "created_utc": "1585997430.0", "edited": "1586000646.0", "id": "fmebdp7", "is_submitter": "False", "link_id": "t3_fu6ouc", "parent_id": "t1_fmbj22r", "score": "1", "subreddit": "portugal", "subreddit_id": "t5_2qmie"}, {"author": "CrashingFirefly", "body": "Awesome, thanks! Exactly what I was looking for", "created_utc": "1585394059.0", "edited": "False", "id": "flqgpbe", "is_submitter": "True", "link_id": "t3_fq203i", "parent_id": "t1_flpfp7y", "score": "1", "subreddit": "Anki", "subreddit_id": "t5_2s9lm"}, {"author": "CrashingFirefly", "body": "I guess it depends on what you're using Anki for, and what you want to get out of it. Anki is for learning factual information, which is why it is mostly used for studying languages, topography, historical events, etc. Anki does not help you understand any information; you have to have this understanding before creating the flashcards. However, in your case, you might be able to use to learn specific article numbers (idk, I have little knowledge of law). Even after using Anki for multiple years, I still sometimes remove cards because I realise they do make me memorise information I do not actually understand yet. Good luck with your exam!", "created_utc": "1585333472.0", "edited": "False", "id": "flo8cfy", "is_submitter": "False", "link_id": "t3_fpzakj", "parent_id": "t3_fpzakj", "score": "1", "subreddit": "Anki", "subreddit_id": "t5_2s9lm"}, {"author": "CrashingFirefly", "body": "Obrigado! Faz sentido neste contexto :)", "created_utc": "1585293733.0", "edited": "False", "id": "flmrldi", "is_submitter": "True", "link_id": "t3_fpazkp", "parent_id": "t1_fljv462", "score": "3", "subreddit": "Portuguese", "subreddit_id": "t5_2sqn7"}, {"author": "CrashingFirefly", "body": "Não faz mal :) Digital, por que?", "created_utc": "1585293681.0", "edited": "False", "id": "flmrjqo", "is_submitter": "True", "link_id": "t3_fpazkp", "parent_id": "t1_fll7ld0", "score": "1", "subreddit": "Portuguese", "subreddit_id": "t5_2sqn7"}]