[{"author": "Creative_Shallot_860", "body": "It's not a paid gig.", "created_utc": "1666292663.0", "edited": "False", "id": "it3um08", "is_submitter": "False", "link_id": "t3_y914c2", "parent_id": "t1_it3u240", "score": "11", "subreddit": "languagelearningjerk", "subreddit_id": "t5_37rt5"}, {"author": "Creative_Shallot_860", "body": "Damn, I just got my draft papers yesterday. Nevermind that I'm not a Russian citizen, nor do I live in Russia. But Russia is running out of Russian-speaking dudes, so they're using their international outreach channels to get anybody with a B1.5 level or higher.", "created_utc": "1666292274.0", "edited": "False", "id": "it3tm1x", "is_submitter": "False", "link_id": "t3_y914c2", "parent_id": "t1_it3exwz", "score": "21", "subreddit": "languagelearningjerk", "subreddit_id": "t5_37rt5"}, {"author": "Creative_Shallot_860", "body": "But that wasn't what Richards was saying. He said that a good measure of \"fluency\" is if you can carry a conversation in a pub. He didn't qualify the statement about what that conversation could or should be about, he just said a conversation. Any *serious* polyglot or even \"polyglot\" should bristle at the idea just a conversation can even be equated to \"fluent\". \n\nYes, \"fluent\" is a vague idea, but the whole point here is that Richards was setting the bar exceedingly low in order to give himself a pass for having low language skills yet being able to claim \"fluency\". That is the issue. \"Fluency\", in my opinion, should be a fairly lofty goal, why should he be allowed to revise the meaning of that, and thus the achievements of those of us who consider C1 and above to be the benchmarks of \"fluency\", down that low? For a person who presents himself as an authority on language learning methods and advice, he is simply looking for loopholes to cheat the very thing that defines his public persona. \n\nFor a serious language student, the \"pub test\" should be the minimum, not the sign post that \"you have made it!\" Sure, for some that's the goal, but for someone who has put in a decade plus of serious effort to get to where I am in my Russian journey, I find offensive that he can just be allowed to denigrate my achievements to a wider audience and make whatever minimal of the \"pub test\" to be some sort of standard bar.\n\nEdit: I've sat around many tables and debated plenty of philosophy, high politics, and other complicated topics in Russian many times with many people. I've experienced the gamut of your comment. And even when I was doing that on a semi-regular basis, I didn't even consider myself fluent. I considered myself to be \"just pretty good\". Just because someone can hold a coherent conversation in a language with a native speaker doesn't mean they deserve to call themselves fluent.", "created_utc": "1665013276.0", "edited": "1665013644.0", "id": "ir7uod7", "is_submitter": "False", "link_id": "t3_xwi0vp", "parent_id": "t1_ir7sx2q", "score": "10", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Creative_Shallot_860", "body": "He had a video where he claimed that the definition of \"fluency\" was what he called the \"pub test\", basically where you can sit in a pub and have a conversation with a native speaker. This infuriated me that he is peddling *that* as \"fluency\". In my opinion, the \"pub test\" is where you reach the \"fun\" stage of language learning, not fluency. \n\nI've sat in pubs and had conversations in very poor French 10+ years removed from studying French in high school. I was/am by no means fluent in French, as I can barely utter more than a handful of sentences, but I have still had not one, but two, coherent conversations with two different people in pubs. It was great, but, even then, I would never tell anyone that I \"speak\" French, only that I studied for a few years in school. Sure, I got pretty good at it *then*, but I was nowhere near what any logical person would consider \"fluent\".", "created_utc": "1665003233.0", "edited": "False", "id": "ir77n7e", "is_submitter": "False", "link_id": "t3_xwi0vp", "parent_id": "t1_ir6u0z0", "score": "29", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Creative_Shallot_860", "body": "What's your goal - to learn new words or finish the book? If you want to learn words, don't worry about your reading speed - focus on learning the words first, and the speed will come later as you know more and more words. If your goal is speed and finishing the book, you won't learn that many words.\n\nAlso, what do you mean by advanced vocabulary? I find it helpful to seek out certain types of things I want to learn - time expressions, conjunctions, abstract nouns, interesting/specific verbs - and focus my efforts there. I don't need all kinds of adjectives, since ultra descriptive adjectives generally aren't that important in spoken language and only really appear in book contexts. If that's your thing, by all means, go for it. Otherwise, knowing what to skip is just as important as knowing what to include.\n\nAlso, \"advanced vocabulary\" does mean necessarily means \"words\", it also means expressions (groups of words that may or may not translate literally) and collocations. Putting work into understanding these as you consume media will help immensely.\n\nThe way I go about it is to just read. If I come across a word that either A) I believe is crucial to the meaning of the text and I cannot guess the context or B) I think would be super interesting to know, I'll stop and look it up. If I read a selection (sentence, paragraph, page) and just don't understand it, I'll go back and look as much as necessary to fully comprehend, and then add what I feel are the most important words to my flashcards.\n\nHow much media do you consume outside of reading? If you watch a variety of tv show genres, you'll start picking up different types of vocabulary since you'll understand all the words around the unknown words. This is where reading and listening really start to benefit and mutually support each other. Shows will help you understand which words and expressions are more important, and reading will help better reinforce those. Reading will present less prevalent words and expressions and shows will put them in the right contexts.", "created_utc": "1663847505.0", "edited": "False", "id": "ipggby7", "is_submitter": "False", "link_id": "t3_xkv8dc", "parent_id": "t3_xkv8dc", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Creative_Shallot_860", "body": "Learn to sing. Seriously. Singing trains the ear and mouth muscles in ways that speaking exercises, like shadowing, can't. The better you develop your ear, the more nuance you can hear and subsequently imitate. \n\nAccent is also more than just \"accent\". To speak with a proper accent, you also have to account for tone, rhythm, pitch, and various other nuances. Yes, you can have a clean \"accent\" without these features and still be understood, just the same as you can be better understood with these features alongside a heavy accent. But, the two go together and should be practiced together.\n\nAre there particular sounds that are worse than others? Try to repeat those and really push on separating them. For example, I know folks who assimilate \"walk\" and \"work\". In English, these use very different mouth shapes for the values. So practice those shapes and over-exaggerate them. \n\nAgain, learn to sing. Not only will you develop your mouth and ear, you'll also come across many different repetition-based exercises for practicing different sounds and chains of sounds.", "created_utc": "1662810678.0", "edited": "False", "id": "inufoqh", "is_submitter": "False", "link_id": "t3_xa961w", "parent_id": "t3_xa961w", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Creative_Shallot_860", "body": "I'm looking for a paper that describes a Papuan or Oceanic language (pretty sure Papuan), especially its verbal aspect - verbs come in aspectual pairs, but the pairs are more often than not suppleted and do not resemble each other - and bizarre phoneme clusters, e.g. /^ŋ͡m g͡bʷ/\n\nI think the paper was originally hosted here, but I can't confirm - https://www.sil.org/system/files/reapdata/50/99/78/50997829403351414999288811179107096393/B_112.pdf\n\nI swear I had saved a copy somewhere, but I can't find it anywhere.\n\nAlso, if anybody has any papers on wild Papuan or Austonesian verb shenanigans, please pass them on. \n\nThanks!", "created_utc": "1661845280.0", "edited": "False", "id": "imcz5vl", "is_submitter": "False", "link_id": "t3_x0kcx4", "parent_id": "t3_x0kcx4", "score": "5", "subreddit": "conlangs", "subreddit_id": "t5_2red7"}, {"author": "Creative_Shallot_860", "body": "I actually have very little authority to advise on automations unless a customer comes to me to request an automation. Now, that doesn't stop me from making suggestions and trying to work with them for any sorts of workflow optimization (which can then be transferred to code if they decide to go through with the request), but my role is 90% writing the code and 10% making suggestions to the customer in an attempt to make it easier on myself to write the code. All that said, I do seek out potential customers and hawk my services every chance I get. The inefficiencies at my org annoy the hell out of me, so I've made it a personal goal/game to automate as much as humanly possible.", "created_utc": "1660495394.0", "edited": "False", "id": "ik9s15b", "is_submitter": "False", "link_id": "t3_wnig8m", "parent_id": "t1_ik9avij", "score": "2", "subreddit": "cybersecurity", "subreddit_id": "t5_2u559"}, {"author": "Creative_Shallot_860", "body": "It kinda depends. In my case, I don't really know anything about the audits my customers want me to automate, outside of the very basics - compliance testing, user access audit, DRP, etc. Generally my first glimpse at the process comes at the first discovery meeting with the customer. Thus, I'm really just a dev with an OK SOC/greater cyber security environment background.\n\nI think the biggest question in your case is, is your dev going to be designing process, or only designing the automation workflows? It would be extremely difficult if I were tasked with designing process - I have no clue. But I can design the workflow once I'm able to talk to the customer.\n\nHope that helps.", "created_utc": "1660495171.0", "edited": "False", "id": "ik9rhqx", "is_submitter": "False", "link_id": "t3_wnig8m", "parent_id": "t1_ik90sb2", "score": "1", "subreddit": "cybersecurity", "subreddit_id": "t5_2u559"}, {"author": "Creative_Shallot_860", "body": "It’s connected to *all* the ticketing sustems ;)", "created_utc": "1660446080.0", "edited": "False", "id": "ik7jfrn", "is_submitter": "False", "link_id": "t3_wnig8m", "parent_id": "t1_ik6zisr", "score": "6", "subreddit": "cybersecurity", "subreddit_id": "t5_2u559"}, {"author": "Creative_Shallot_860", "body": "Ha! I’ve been working on a lot of audit automation workflows recently and I LOVE it. I would absolutely hate designing or doing the work, but I love designing and implementing the automations. I just like seeing just how much of the process I can automate before someone has to perform any sort of manual action.\n\nEdit: Typing on mobile is hard.", "created_utc": "1660429497.0", "edited": "1660446206.0", "id": "ik6l9yj", "is_submitter": "False", "link_id": "t3_wnig8m", "parent_id": "t1_ik5tsof", "score": "31", "subreddit": "cybersecurity", "subreddit_id": "t5_2u559"}, {"author": "Creative_Shallot_860", "body": "Thanks for the reply. That makes sense, though I’m still impressed with the speed overall. Good job.\n\nI just started up with Turkish about 40 days ago, and I’m working on a couple of graded readers right now, but it’s still tough - I’m nowhere near a point where I can do any sentence mining effectively even though I’m at ~15 new words per day. I don’t spend enough time reading though, especially the past week. I need to hit the reading a lot harder.", "created_utc": "1660268749.0", "edited": "False", "id": "ijxu1bs", "is_submitter": "False", "link_id": "t3_wlpt0x", "parent_id": "t1_ijxr665", "score": "2", "subreddit": "Refold", "subreddit_id": "t5_3azein"}, {"author": "Creative_Shallot_860", "body": "18 books in 3 months? How are you reading the books? What is the general difficulty and length of the books? Are you just reading without necessarily looking up much or switching back and forth between extensive and intensive readings?\n\nI’m always curious how beginners can power through so many books in such short periods. I can’t even do that in my own NL, not to mention a TL.", "created_utc": "1660265110.0", "edited": "False", "id": "ijxlyjd", "is_submitter": "False", "link_id": "t3_wlpt0x", "parent_id": "t1_ijuwdc8", "score": "2", "subreddit": "Refold", "subreddit_id": "t5_3azein"}, {"author": "Creative_Shallot_860", "body": "My family is friends with a family with a 5yo who can competently communicate with his parents/grandparents in English, French, and Armenian. \n\nI think it’s wild and I probably wouldn’t have fully believed the claim if I didn’t know them personally and heard him speak all three regularly.", "created_utc": "1657190746.0", "edited": "False", "id": "if6wgv2", "is_submitter": "False", "link_id": "t3_vt27g3", "parent_id": "t1_if56uh1", "score": "1", "subreddit": "languagelearningjerk", "subreddit_id": "t5_37rt5"}, {"author": "Creative_Shallot_860", "body": "Ты говоришь по-руский? Если да, [Varlamov](https://www.youtube.com/c/ivarlamov) часто рассказывает про архитектуру кода он путешествует по России. \n\n[MoscowWalks](https://www.youtube.com/c/MoscowWalks) тоже интересует архитектуру и по моему описывает места, в частности историю тех мест, более подробно чем Варламов. Он обычнр ходит по Москве, но иногда ходит по другим городам.\n\nОни к сожелению обычно рассказывают всего лишь о том, что видят перед ними, а не того, что было. Глубокие академические дискусии истории Русскии архитектури не часто появлаются, а в этих случаях ведущие явно знают именно о чем говорят.", "created_utc": "1654166785.0", "edited": "1654167466.0", "id": "iawb77i", "is_submitter": "False", "link_id": "t3_v29m3e", "parent_id": "t3_v29m3e", "score": "2", "subreddit": "russian", "subreddit_id": "t5_2qlc6"}, {"author": "Creative_Shallot_860", "body": "OP's history is an idiot. \n\nuj/ OP's history teacher is an idiot.\n\nEdit: Upon further reflection, OP is an even bigger idiot for making such an idiotic post in public. Could have at least skipped the idiot stage and jumped straight to jerk...", "created_utc": "1653558801.0", "edited": "1653559093.0", "id": "ia1oy99", "is_submitter": "False", "link_id": "t3_uy1p3m", "parent_id": "t1_ia1d464", "score": "11", "subreddit": "languagelearningjerk", "subreddit_id": "t5_37rt5"}, {"author": "Creative_Shallot_860", "body": ">\tThis is hardly an issue given how even without transliteration this tends to go wrong. One cannot expect non-speakers to pronounce anything correctly. Hearing Anglo-Saxons pronounce “Jaap de Hoop Scheffer” is rather comical to me.\n\nHold up. It’s funny to hear “Anglo-Saxons” pronounce something in Dutch? Is Anglo-Saxon supposed to mean the British, or white northwestern Europeans in general? If the latter, don’t the Dutch fall somewhat neatly into that group? \n\nAt least it’s good to know that it’s apparently impossible for Brits, Saxons, and large swaths of Americans to correctly pronounce a Dutch name. I mean, it is quite well known that the Dutch don’t actually have pronunciation, and instead just growl while occasionally throwing in some random vowel sounds.\n\nBut don’t get yourselves down, non-Saxon Dutch people! Chinese doesn’t have grammar, so the inevitable Dutch-Chinese super-pidgin will one day be this world’s lingua francs savior, and the whole world can unite and laugh at those dirty Anglo-Saxons together!", "created_utc": "1653558273.0", "edited": "False", "id": "ia1ocp3", "is_submitter": "False", "link_id": "t3_uxxbmo", "parent_id": "t3_uxxbmo", "score": "9", "subreddit": "languagelearningjerk", "subreddit_id": "t5_37rt5"}, {"author": "Creative_Shallot_860", "body": "The best thing to do is to consume content, particularly text. Listening will go a long way, but reading creative writing, in particular really helps in exposing to you more advanced grammar, as well as all kinds of vocabulary. But don't just stick to creative writing, read plenty of news (though pure news doesn't always help with spoken conventions), blogs, comics, whatever interests you.\n\nI was in a similar situation and [recently posted about it](https://www.reddit.com/r/languagelearning/comments/t4z5qq/on_reading_goals_planning_and_fluency/).", "created_utc": "1647870878.0", "edited": "False", "id": "i1j3j8g", "is_submitter": "False", "link_id": "t3_tisz0q", "parent_id": "t3_tisz0q", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Creative_Shallot_860", "body": "It's been a long one.\n\nStarting ~16 years ago, I did 4 years in uni, including two summer studies abroad in Moscow. After that I lived in Moscow for 3.5 years and got another degree from a university in Moscow. I learned a lot during this period, but I definitely did NOT make the most of it. If I could go back now, knowing a lot of the more optimized reading/flashcard/conversation techniques that I've been using recently, I think my skills would have strengthened much quicker. Because of a lack of vocabulary, I didn't speak much.\n\nAfter that I worked a few jobs where I was a Russian SME, so I spent a lot of time reading Russian news and analysis. All this time I had Russian friends but I never really spoke much, unless I had to. \n\nRecently I've been reading more creative writing, which has filled in the gaps that I identified. [See this thread from last week where I detail my recent reading journey](https://www.reddit.com/r/languagelearning/comments/t4z5qq/on_reading_goals_planning_and_fluency/). I still don't speak much, but I'm working on it.\n\nAs for materials, I don't know. There's a great textbook called Граматика в Контексте, but it's more of a 3rd-year uni level book. Graded readers are your friend. The НТВ and СТС YouTube channels are gold mines for TV content. Make sure you learn which cases go with which verbs, and, when reading literature and news, pay special attention to how participles take their arguments - English doesn't have that kind of construction (assuming you're an English speaker...) so they can be counter-intuitive and difficult to wrap your head around, especially in the beginning.", "created_utc": "1646747833.0", "edited": "False", "id": "hzu59k6", "is_submitter": "False", "link_id": "t3_qdmpwc", "parent_id": "t1_hzqguns", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Creative_Shallot_860", "body": "While you're waiting on answers, here are some threads from the past 16 days that address very similar topics:\n\n* [What is your native language and which languages have you learned so far or are you planning to learn in future?](https://www.reddit.com/r/languagelearning/comments/t5x07t/what_is_your_native_language_and_which_languages/)\n* [Why did you learn a different language?](https://www.reddit.com/r/languagelearning/comments/szbsgm/why_did_you_learn_a_different_language/)\n* [What feature / characteristic of the language you're learning do you like ?](https://www.reddit.com/r/languagelearning/comments/suq5x3/what_feature_characteristic_of_the_language_youre/)\n\nYou can also check out everyone's flairs.\n\nI'm not saying any of this to be mean to OP, but this kind of thing gets asked here, in one form or another, constantly. I think many would say that this kind of thread is only tangential to language learning - all it does is invite people to state the languages they are studying, but doesn't provide anything of value or merit in terms of actually helping study any of them.\n\nEdit: Hehe, OP's troll game is short but solid :)", "created_utc": "1646486311.0", "edited": "1646486590.0", "id": "hzg5p7z", "is_submitter": "False", "link_id": "t3_t78s8t", "parent_id": "t3_t78s8t", "score": "18", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Creative_Shallot_860", "body": "https://www.reddit.com/r/LearnJapanese/wiki/index/resources", "created_utc": "1646393953.0", "edited": "False", "id": "hzb029d", "is_submitter": "False", "link_id": "t3_t6f3na", "parent_id": "t3_t6f3na", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Creative_Shallot_860", "body": "Over the past 2-3 days there have been at least 6 or 7 total threads devoted to these topics (one for Anki might have been removed). At least two of those threads had comments noting that the new threads are not adding anything new to the discussion.", "created_utc": "1646393175.0", "edited": "False", "id": "hzaz09a", "is_submitter": "False", "link_id": "t3_t6dhq7", "parent_id": "t3_t6dhq7", "score": "8", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Creative_Shallot_860", "body": "What is your overall goal? General improvement? Better vocabulary? Improvement in a particular area (listening/writing/speaking)? My understanding from your post is that you're looking for \"general improvement\", so I'm going comment on that.\n\n> 30 min / day reading novels or articles\n\nStart with this, but do not feel bound to stop at the 30 minute mark. Instead, enjoy yourself and have fun.\n\nYou say you're B1, so let's start there - you need vocabulary. While reading, prioritize what's important to both you *AND* your goals. My suggestion is to focus first on verbs, common things, time, conjunctions, and adverbs of degree. Those categories will take you the furthest in the shortest amount of time. Comic books are solid, if you can find them, and novels are amazing, but try to stick with relatively recent works(~40 years) in order to maximize the vocabulary and grammar you pull from it.\n\nWhat about TV shows or movies? That type of media is the most accurate in terms of how normal people speak. Prioritize the phrases and constructions you hear in the shows in order to maximize the value of the words when it comes time to speak. Find any sort of downtime during the day and just pop in some headphones to stream your favorite tv content. Pay attention when you can, let it play in the background when you need to. The constant exposure will start to pay off pretty quick.\n\n> 5 - 10 min / day searching for new tools and evaluating my progress\n\nWhy? I would say that this is superfluous and the time would be better spent just reading or watching tv.\n\n> 1-2 h / week learning from a textbook (grammar,...)\n\nIf you already have a solid grasp of grammar, use this as a reference, not an active tool. You'll get the exposure you need in context while reading. When you find something you don't know, look it up and *then* practice it. Native context is always the better route. If your grammar is not all that solid, by all means, use the books *alongside the other practice* to build up your skills.\n\n> 15 min / day using an app (like tv5 monde)\n\nDoes this provide a benefit that reading and other forms of input and practice don't? IMO, once you get past the beginning stages, apps really aren't necessary, so unless you really like it and find solid benefit in it, seriously consider what value it brings to your studies and adjust accordingly.\n\nYou say you want to devote a fair amount of time to writing - that's awesome, absolutely do that. \n\nMost of all\n\n* Don't feel the need to stay boxed into these strict time boxes\n* If something works for you, do it until it stops working\n* If something isn't working for you, do what you can to understand why. If you figure it out, try to fix it. Otherwise, drop it and move on to something else - don't stay bogged down any longer than absolutely necessary.\n\nEdit: Words and punctuation are tricky sometimes.", "created_utc": "1646336259.0", "edited": "False", "id": "hz80mnf", "is_submitter": "False", "link_id": "t3_t5xu9e", "parent_id": "t3_t5xu9e", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Creative_Shallot_860", "body": "See my recent thread here - https://www.reddit.com/r/languagelearning/comments/t4z5qq/on_reading_goals_planning_and_fluency/", "created_utc": "1646311001.0", "edited": "False", "id": "hz6bw0t", "is_submitter": "False", "link_id": "t3_t54kmu", "parent_id": "t1_hz6bghl", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Creative_Shallot_860", "body": "This is really cool. Good job on the challenge and the achievement. \n\nThis sub needs a lot more content like this. It's inspiring, presents thought processes, goals, lessons learned, etc. Thanks for posting it.\n\nI started my reading journey/challenge (?) with the intention of improving my speaking skills. While my vocabulary and comprehension have skyrocketed, I haven't really put much effort into the larger goal - speaking. Now I'm inspired.", "created_utc": "1646307671.0", "edited": "False", "id": "hz66nao", "is_submitter": "False", "link_id": "t3_t54kmu", "parent_id": "t3_t54kmu", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Creative_Shallot_860", "body": "Regarding verbs, two things. First, with reference to my teacher's advice, he meant that you should learn as many verbs as you can - if you come across a text with a lot of unknown words, start by looking up the verbs first and then work your way through other parts of speech. \n\nTo your second question, there's a reason why verbs are often the most difficult part of a language. Most languages in the world pack so much meaning into their verbs that it is virtually impossible to communicate with them if you don't have a solid grasp on those concepts. Therefore, in my opinion, yes, you should master all tenses - that's low hanging fruit that significantly increases your ability to express yourself across a massive range of situations. Conjugation drills are fine in the beginning, but just reading a lot and paying proper attention to usage throughout the readings is more important overall since it's that exposure that really teaches you how the verbs function both overall and in very specific circumstances.\n\nWith YouTube, I'm specifically referring to TV shows and even movies. I should have clarified that it's not easy to find good TV shows for all languages, and, depending on the language (looking at you German...), you still probably need a VPN. But like Russian and Greek, there is precious little content on Netflix, but entire troves of it on YouTube - if I watched Russian tv shows for 8 hours per day, it would take at least a year to get through all of it, and probably a lot more than that. Also, the shows can be hard to find. You might have to find a list of popular shows from a specific TV channel and then search for them individually, rather than simply search for \"<target language> tv shows\".", "created_utc": "1646304377.0", "edited": "False", "id": "hz62agu", "is_submitter": "True", "link_id": "t3_t4z5qq", "parent_id": "t1_hz5mrvg", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Creative_Shallot_860", "body": "I firmly believe that rest plays a big role in anything physical or mental. That goes in terms of both a good night's sleep and a week or two away from your activity of choice. After my first 2.5 books, I was just tired from work, family, and ever-mounting flashcard reviews. \n\nSo I stopped adding flashcards and didn't read for a week and a half. I did watch TV shows though and continue reviewing the cards that I already had, so I didn't stop consuming media entirely. When I got back to the reading, my speed was faster, my overall comprehension was better, and I was able to easily comprehend words that I had been having trouble with earlier. What's more, after the break I started noticing more subtleties and nuance in word formation and derivation, and my ability to intuitively reason out the meanings of words skyrocketed. \n\nSometimes you just need a break for a few days to let your brain catch up to your pace.", "created_utc": "1646253568.0", "edited": "False", "id": "hz3h458", "is_submitter": "True", "link_id": "t3_t4z5qq", "parent_id": "t1_hz2y0ag", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Creative_Shallot_860", "body": "> I actually tried Anki because of discussions I had seen on this sub.\n\nExactly. There were already enough discussions about it on this sub that you didn't need another one.\n\nOP has been posting on this sub for 4 months, and I would bet that s/he had been lurking long before that. There have been plenty of discussions on this topic in that time, and many, many more found with a simple google search. If OP wants to use or experiment with Anki or any other flashcard, yet another thread discussing it is unlikely to be the tipping point.\n\n> Literally nobody on this sub thinks Duolingo alone takes you to fluency\n\nNo, but plenty of people still feel the need to ask, instead of spending 10 minutes reading the multitude of existing posts. There's nothing new being added to those conversations, and the same goes for this conversation.\n\nFor both of the above topics, there is already a wealth of experiences shared. No one is really adding anything new to the conversations. So, let's archive those conversations and point new users there, instead of going through the same motions week in and week out.\n\nEdit: BTW, OP has stated that s/he has been using Anki for >=1 month. If s/he wants a discussion about experiences, s/he should start with his/her own, rather than just throwing up some sort thread with a vague poll attached to it and then not interacting at all with the comments.", "created_utc": "1646242584.0", "edited": "False", "id": "hz2oghl", "is_submitter": "False", "link_id": "t3_t4zdtr", "parent_id": "t1_hz2lipw", "score": "5", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Creative_Shallot_860", "body": "Yeah. Absolutely agree. I skimped on some definitions and qualifications to save some space.", "created_utc": "1646233874.0", "edited": "False", "id": "hz2226h", "is_submitter": "True", "link_id": "t3_t4z5qq", "parent_id": "t1_hz1zq3f", "score": "7", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Creative_Shallot_860", "body": "Novels:\n\n* Корнев - Ритуалист-1 - Fantasy, ultra-descriptive\n* Герберт - Дюна - Yes, that Dune\n* Бек - Новое Назначение - Early 1960s high literature, by far the most difficult\n* Глуховский - Метро 2033 - Very long, but engaging. Kinda depressing\n* Войнович - Москва 2042 - I think I enjoyed this one the most.\n* Лукьяненко - Ночной Дозор - Almost finished with this. I like it, it's certainly different than the movie.\n\nI've also read some Chekhov, Voynovich, and Henry O short stories here and there.\n\nThe Ритуалист is five novellas divided into four equal quarters across 2 books. I read the first 2 (1/2 of the first book) first, then, after the next 4 books on the list above, read the second half of book 1 as a progress test. The improvements were vast. I'm going to read a few more books before starting book 2, and then a few more books before eventually reading the final quarter. I'm also considering branching out into comic books and counting each series of ~20 books as a graphic novel on my list.\n\nShows: \n\n* Пуля - Very good\n* Земляк - Light and fun, audio quality not the best\n* Адмиралы Района - Entertaining but meh overall\n* Уцелевшие - Really enjoyed it\n* Бывших не Бывает - Similar to Уцелевшие, really enjoyed it\n* Личность Не Установлена - Super dark. Much more complex than any of the others.\n* Невский - Тень Архитектора - Watched the entire season, not bad.\n* Невский - Охота на Архитектора - Started this season, but only watched a few episodes so far.\n* На Глубине - Watched a few episodes, but overall meh.\n* Как Я Стал Русским - Funny, standard sitcom.\n\nThese are primarily limited series (8-15 episodes), though Невский is much longer. I much prefer short run, limited shows. НТВ and СТС, among others, have gigantic troves of tv shows across several genres.", "created_utc": "1646233452.0", "edited": "False", "id": "hz211p1", "is_submitter": "True", "link_id": "t3_t4z5qq", "parent_id": "t1_hz1truh", "score": "6", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Creative_Shallot_860", "body": "> You can talk like a self-help book or a biography, but if you talk like a novel, you'll likely encounter problems.\n\nI agree (see \"long-form expert commentary\"). I don't read non-fiction prose much, so I don't read it in other Russian either. But if you read novels AND balance that out with TV shows, you can find a happy middle ground.\n\nI guess \"literary prose\" might be too tight a description.\n\n> If you read most of the news, you'll get a range automatically.\n\nYes, but see the points on the things I was seeking to learn. When I say news I'm talking about standard, dry newspaper news - not interviews or opinion pieces. Yes, all of those other varieties might count as \"news\", but could also be thought of as \"blogs\" or other forms of general content. Of course, this only matters in the sense of defining what one groups under an umbrella term. \n\nIn my opinion, the news is best for vocabulary, especially within specific domains, but only provide limited utility for expressive syntax and grammar constructions.\n\n> YT is the audiovisual form of newspapers/biographies/self-help works/comic books.\n\nYes, but there are plenty of TV shows available on YouTube. Depending on the language, there are entire troves of movies and entire series runs in that language, and the content is often significantly more extensive than Netflix.", "created_utc": "1646231175.0", "edited": "False", "id": "hz1vsx0", "is_submitter": "True", "link_id": "t3_t4z5qq", "parent_id": "t1_hz1s4sx", "score": "7", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Creative_Shallot_860", "body": "Does it matter? Some people do, some people don't. This sub is obsessed with \"Anki? But why?!?!?!?\" and \"What do you mean fluency takes more work than DuoLingo and Youtube how-to-learn videos?\"\n\nSome people use flashcards, be it Anki or something else, some people don't. If you like flashcards, use them. If not, don't. If you don't know, experiment some, figure it out for yourself. Most importantly, study your TL.\n\nThis question, and ones like it, get asked constantly. Statements recorded on this sub are vast. A better use of OP and respondents' time would be to just read something and stop worrying about it. \n\nMods: Can we ban these kinds of posts? There are myriad to link in the FAQ, can we just link some of them for the record and ban future posts?", "created_utc": "1646226466.0", "edited": "False", "id": "hz1m6ah", "is_submitter": "False", "link_id": "t3_t4zdtr", "parent_id": "t3_t4zdtr", "score": "-2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Creative_Shallot_860", "body": "How much time do you put into other skills, like reading?\n\n> I'm becoming increasing pessimistic about developing truly native-level listening any time soon.\n\nDo you think this is because of not focusing on a single dialect, lack of vocabulary, or a combination of the two? \n\nGood job, this is quite impressive.", "created_utc": "1645879411.0", "edited": "False", "id": "hyibemm", "is_submitter": "False", "link_id": "t3_t1ssvb", "parent_id": "t3_t1ssvb", "score": "26", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Creative_Shallot_860", "body": "> you read 1 page in Spanish (L2) then you read 1 page in English (L1) or you do sentence by sentence (that's what I do)\n\nHonest question: What does this accomplish? \n\nTo me, the entire point of reading is to learn how to reason out the internal logic of a language. Constantly switching back and forth between L1 and L2 on a page-by-page or, worse, sentence-by-sentence frequency doesn't contribute to that at all - all that does it use your L1 to fill in the blanks so your brain doesn't have to put in the effort to reason through the L2 text. Plus, at that frequency, you're missing *HALF* of the text, meaning up to half of the repetition, half of the grammar, etc. \n\nIf you come across a piece (sentence, paragraph, page) that you simply CANNOT reason through, use the L1 text as a reference, but, if you're going to actually learn the language, you have to out in solid effort to actually understand the L2 text first. \n\n> It's like you are learning on Youtube. There is audio, video and subtitle (CC). \n\nThese two examples are nothing alike. Consuming three channels of information simultaneously is completely different from alternating which language you're reading in. \n\nDo you mean subtitles in L1 or L2? If L1, then all you're doing is reading in your L1, not trying to comprehend the L2.\n\n> just explanation for top-down\n\nThis video doesn't explain anything, especially whatever this \"top-down\" idea is. If anything, it presents a fairly ignorant and incomplete view of flashcards from the point of view of someone who has never taken the time to figure out how flashcards are a *tool* that assists with vocabulary learning, not the learning method itself. Flashcards assist in remembering the word so that you more easily recognize it the *next time you come across it*, they are not meant to help you in producing that word in conversation.\n\nIf you don't want to use SRS, that's fine, plenty of people get by without it. But doing half-L2/half-L1 without flashcards or some other means of vocabulary reinforcement isn't going to provide enough frequency for any sort of reasonable efficiency.", "created_utc": "1645793903.0", "edited": "False", "id": "hydihs5", "is_submitter": "False", "link_id": "t3_t0lzl5", "parent_id": "t1_hyd068r", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Creative_Shallot_860", "body": "For any given page of a novel, there are many words that you simply do not need - many adjectives (especially verbal adjectives/participles, if your TL does that), less common verbs of expression and their synonyms, adjective-derived adverbs, complex adpositions/location markers. The trick is to learn to filter out the types of words you don't need in order to understand the broader text.\n\nWith this in mind, more complicated pieces of literature (not just YA or pulp novels) become more accessible, even at 85-90% known words per any given page. Most of the words you don't know are likely to be super uncommon, so the time spent learning them beyond a simple dictionary lookup may not be worth it.", "created_utc": "1645700894.0", "edited": "False", "id": "hy86yr4", "is_submitter": "False", "link_id": "t3_szljhk", "parent_id": "t1_hy7cd00", "score": "4", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Creative_Shallot_860", "body": "Since you live there, reading and watching tv are probably your best options. I understand depression and anxiety, but if you're only looking to reinforce previously learned vocabulary, just get plenty of input so that your brain stays in German mode.", "created_utc": "1643642464.0", "edited": "False", "id": "hv035zc", "is_submitter": "False", "link_id": "t3_sgz2xx", "parent_id": "t3_sgz2xx", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Creative_Shallot_860", "body": "You need to read more while also listening more. One of the problems at this stage is that, you've a lot from textbooks and beginner/intermediate videos, but, in reality, that's not actually how people talk. Real speech is littered with adverbs and temporal expressions, among other types of idiomatic quirks that textbooks/apps/instructional videos generally do not teach either well or at all.\n\nBy forcing yourself to read, especially content with a lot of dialogue, you'll start to pick up on all the little things that people say when they speak. \n\nHowever, reading alone isn't enough. You have to reinforce all of the words and phrases that you pick up through the reading. Thus, watch tv shows - not the news, not some person on YouTube telling a story or narrating something. Find plot-driven tv shows, because they are explicitly designed to mimic real life situations in ways that most other content is not. Learning how people speak in conversation teaches you the language's natural rhythms and inconsistencies - once you can pick up and understand those, your listening comprehension will skyrocket and other forms of spoken content will become much easier.\n\nReading and listening reinforce each other. The trick is to find the correct type of content for both so that they are complimentary. In my experience, a novel (yes, it's hard, especially in the beginning) + either cop drama or other type of drama are best, because sitcoms and comedies often has a lot of subtleties that are difficult even for learners at a more advanced stage.", "created_utc": "1643638588.0", "edited": "False", "id": "huzu431", "is_submitter": "False", "link_id": "t3_sgjfhb", "parent_id": "t3_sgjfhb", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Creative_Shallot_860", "body": "This looks great, but do you have any example sentences with IPA/gloss/etc besides the basic word order examples? Languages are much more interesting when presented as such, rather than just a sketch in a spreadsheet.", "created_utc": "1638194933.0", "edited": "False", "id": "hmj63oq", "is_submitter": "False", "link_id": "t3_r4psle", "parent_id": "t3_r4psle", "score": "4", "subreddit": "conlangs", "subreddit_id": "t5_2red7"}, {"author": "Creative_Shallot_860", "body": "This looks great and all, but I'd like to understand more about how the language actually functions. Do you have any example sentences with IPA/gloss/etc?", "created_utc": "1638194829.0", "edited": "False", "id": "hmj5wcc", "is_submitter": "False", "link_id": "t3_r4kcfi", "parent_id": "t3_r4kcfi", "score": "1", "subreddit": "conlangs", "subreddit_id": "t5_2red7"}, {"author": "Creative_Shallot_860", "body": "This is great and all, but how about some example sentences with gloss and pronunciation? Everything in the post looks fine in theory, but a language is far more interesting when it’s put to use.", "created_utc": "1637718464.0", "edited": "False", "id": "hluhiy9", "is_submitter": "False", "link_id": "t3_r0n3j7", "parent_id": "t3_r0n3j7", "score": "4", "subreddit": "conlangs", "subreddit_id": "t5_2red7"}, {"author": "Creative_Shallot_860", "body": "I hate how DL counts \"words\" - it counts each inflection as its own distinct \"word\". So, in Russian, each verb = 11 \"words\" (infinitive, 6 present tense inflections, 4 past tense inflections), and each noun = 12 \"words\" (singular and plural across 6 cases). Thus, to learn 100 Russian \"words\" on DL means that it has actually only exposed you to ~9 verbs and/or ~8 nouns.\n\nAt that rate, folks will be fluent in ~6.125 days, give or take, depending on how many Dostoevsky novels they read in English or how many YouTube videos they make about how the words for \"sightseeing\", \"hello\", and \"all/everything\" are among Russian's top 5 most difficult words (without even actually touching on Russian's most difficult words).", "created_utc": "1636539813.0", "edited": "False", "id": "hk1w2sq", "is_submitter": "False", "link_id": "t3_qqb0fo", "parent_id": "t1_hjza354", "score": "23", "subreddit": "languagelearningjerk", "subreddit_id": "t5_37rt5"}, {"author": "Creative_Shallot_860", "body": "Please see the follow-up question I posed to the poster above.\n\n> Ok, I get what you're saying. That's great for beginners and intermediates, but what about advanced learners who are already at C1? I should have been more clear in the original question - I'm at C1 already and I'm curious how you handle that.\n\n> Yes, authors repeat themselves a lot, but once you know the common words, how do you handle learning the less common words?\n\n> I wasn't clear on the original question - how do you learn the less frequent words you pick up? Not \"how do you identify them\", but what is your method to study them in the absence of SRS, especially when they don't appear commonly enough to reinforce themselves?\n\nSome of us can't read a novel in a week - there's not enough time due to other commitments, some people are naturally slow readers, our TLs are quite difficult, etc, even at C1, so the time between novels is spaced out that much more, further limiting exposure frequency.\n\nReading the news is quite easy - you quickly pick up words within a specific domain, sure, but there aren't that many base news words and constructions and they are used with higher frequency than in most other media. But people don't speak \"the news\". It's good for learning words in certain topics, and those topics don't always help in real world situations.", "created_utc": "1636142699.0", "edited": "False", "id": "hjgjle2", "is_submitter": "False", "link_id": "t3_qmgn0u", "parent_id": "t1_hjg7xv2", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Creative_Shallot_860", "body": "Ok, I get what you're saying. That's great for beginners and intermediates, but what about advanced learners who are already at C1? I should have been more clear in the original question - I'm at C1 already and I'm curious how you handle that.\n\nYes, authors repeat themselves a lot, but once you know the common words, how do you handle learning the less common words?\n\nI wasn't clear on the original question - how do you *learn* the less frequent words you pick up? Not \"how do you identify them\", but what is your method to study them in the absence of SRS, especially when they don't appear commonly enough to reinforce themselves?", "created_utc": "1636142237.0", "edited": "False", "id": "hjgicxj", "is_submitter": "False", "link_id": "t3_qmgn0u", "parent_id": "t1_hjfsgdx", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Creative_Shallot_860", "body": "Honest question for you - if you don't use Anki, I assume that means you don't use flashcards in general. If you do use SRS, this question won't apply to you, but I'm still curious to hear from people who don't use SRS systems.\n\nHow do you handle less common words or non-transparent/infrequent grammatical constructions? Books, especially novels, contains a lot of words that are really good to know, but they don't really come up that often, e.g. enthusiasm, honesty, \"charming frankness\" (that came from a passage I read today), to get around to (do), to pale in comparison (with), to find time to (do), to open up to (someone), to prop oneself up by one's elbows, to stick one's nose into/butt in, bit by bit, various bookish synonyms for degree, etc. This may seem like a random list but they are all found in the current and most previous novels I've read. Also, these words/expressions may or not be transparent in your TL, but most of them can be expressed using a single words in mine.\n\nThese types of words *can* be clear from context, but \"charming frankness\", at least in my book, was a stand alone quote that was used somewhat sarcastically, so it wasn't super obvious. Another example, in my TL, \"enthusiasm\" is generally conveyed in standard speech as \"with pleasure\" or ~\"with gusto\"(kinda), and so I don't think I've ever actually learned the word/root for enthusiasm or enthusiastic.\n\nI'm curious how you learn those words. Maybe you don't, and that doesn't bother you, which is perfectly fine if it fits your goals. But if you do come across less common words, both in your texts and that you may or may not use in specific situations of everyday speech, how do you handle them over the long term? I know the CI argument, but I don't buy it when it comes to real world, by-natives-for-natives texts. It only takes you so far and in real world novels it's value, in my opinion, is rather limited.", "created_utc": "1636125823.0", "edited": "False", "id": "hjfbfvg", "is_submitter": "False", "link_id": "t3_qmgn0u", "parent_id": "t1_hjf0oyr", "score": "4", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Creative_Shallot_860", "body": "But it does? Несколько, некоторый, пара/пару, немного, чуть-чуть…all of those words roughly equal “some” and are used in that context all the time.", "created_utc": "1635342265.0", "edited": "False", "id": "hi8vh6b", "is_submitter": "False", "link_id": "t3_qgv2yb", "parent_id": "t1_hi8u5pc", "score": "20", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Creative_Shallot_860", "body": "As someone who has studied both, I have some thoughts for you.\n\nSimilarities\n\n1. Both use aspectual pairs. Most of the time, in both languages, the pairs are transparent, but for many common verbs they are not.\n\n2. Both rely heavily on word stress. However, Greek is nice and tells you where the stress falls, Russian does not. \n\n3. Both languages use a somewhat similar prefix-root-suffix system for more-or-less transparent word formation. However, Greek is much older and semantic shift has had more time to mess with the meanings of words.\n\n4. Both languages can have fairly long words. Both have cases - in my opinion, Greek cases are more difficult since there are fewer. Learning them is easier, but practical usage is harder since their uses are not necessarily as clear as in Russian, since each case has so many more situations in which they apply.\n\n5. Both languages make extensive use of participles. There is overlap in their usage, but each has its own idiosyncratic ways of using those participles.\n\nGreek\n\n1. The Greek TAM system is more complicated than Russian, but with a Romance background, it's not that bad. That said, I came into Greek having studied Russian for a long, long time, so the overlap meant that I didn't have to learn the Greek TAM system from scratch, I already had strong mental understanding of aspect and its uses, although aspectual usage does differ between the languages.\n\n2. Greek has a much smaller phonetic inventory than Russian, so it has to make do with fewer sounds and relies more on how to combine those sounds, making listening comprehension and vocabulary retention a little more difficult. This inventory is also softer, which can play tricks on the ear sometimes.\n\n3. For English speakers, Greek vocab is not that bad, since large swaths of English (and Romance) words originally came from Greek.\n\nRussian\n\n1. Few people talk about Russian stress, but most learners don't learn it properly after they graduate from coursebooks and graded readers.\n\n2. Verbs of motion are hard, but once you see them used in the wild enough they really aren't that bad. Metaphorical extension of those verbs of motion can be fairly complicated and not transparent at all.\n\n3. Russian tv production is sleeker than Greek to production, but that doesn't necessarily make the quality or enjoyability any better.\n\n4. People always talk about reading the great Russian authors. Yeah, maybe one day, but it's going to be a long while. That's like someone learning English to read Dickens and Brontë - sure, maybe they can, but it's highly specialized and completely unnecessary for everyday communication.\n\n5. Colloquial speech is actually rather simple. The Russians know they have a complicated language, and they keep everyday speech rather simple to accommodate for it. I haven't been studying Greek long enough to have observed anything to this end (although ALL languages simplify spoken language to at least some degree).\n\nAll in all, I'm still a beginner in Greek, whereas I'm a C1 in Russian and I use Russian all the time. I've had more fun learning Greek, but that's because I perceive it as being much easier than Russian, mainly due to all of the concepts I learned while studying Russian. You'll probably progress faster in the beginning stages with Greek, but once you start getting into abstract nouns based on verbs, Russian can be much more transparent, but that's just my experience.\n\nEdit: A couple of spelling and word touchups.", "created_utc": "1634992344.0", "edited": "1634997489.0", "id": "hhqi83j", "is_submitter": "False", "link_id": "t3_qdmpwc", "parent_id": "t3_qdmpwc", "score": "7", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Creative_Shallot_860", "body": "I think you've missed the above poster's point. Trying to learn two languages from the very beginning at the same time is always discouraged. The writing systems don't matter in and of themselves, despite the fact that kanji is not an alphabet, and thus requires significantly more effort and attention than the other systems. In addition, Russian stress is phonemic, and is not written, so you have to devote a portion of your attention and effort into learning how stress works in Russian words.\n\nWhat's your native language? Unless it's Ukrainian/Belorussian or whatever Japanese's closest relative is, Russian and Japanese have extremely steep learning curves, especially in the beginning. Trying to balance both at the same time is only going to work against you. They are completely different linguistic paradigms.\n\nFurther, you want to do use the immersion method. Great, but that method is slow and time consuming. You're essentially committing yourself to 3-4 hours per day PER LANGUAGE. I get that you have plenty of free time, but it's not going to work out like you are imagining it will, especially since you have no prior experience with language learning.\n\nAll I'm saying is, choose one, find a beginner course, and work your way through it, step by step, a little bit at a time, making sure that you know and understand >=85% of the material of the section (including all words presented in the section) before moving on. Don't worry so much about \"learning methods\", just experiment with stuff, find what works best for you, and don't be afraid to change it up every now and then to meet your current need/address particular issues with newer material.", "created_utc": "1634816014.0", "edited": "False", "id": "hhh96kz", "is_submitter": "False", "link_id": "t3_qc3q0g", "parent_id": "t1_hhh5r0p", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Creative_Shallot_860", "body": "Your Russian examples are bad - neither of those words sound the same because the stress is in different places. In Russian, stress is phonemic, which results in few homophones overall.\n\nбольнóй != бóльно - even if the stress were the same, the й changes the о from “o” to “oy” \n\nнéчто != ничтó - нечто != something - it’s a specialized negative meaning “nothing” used in specific constructions. Ничто is not common AT ALL, ничего is by far the most common form of that word.\n\nМне нечто делать = I have nothing to do \nНечем дышать = it’s very stuffy (in here)\n\nRide and raid have completely vowel sounds, they sound nothing alike. I don’t know which dialect of English you speak, but I can’t think of any dialects in which they share a vowel sound.\n\nI moved this comment from its original position in this thread to make sure set you saw it.", "created_utc": "1634478903.0", "edited": "False", "id": "hgzg9zg", "is_submitter": "False", "link_id": "t3_q9754l", "parent_id": "t1_hgu8ic0", "score": "1", "subreddit": "Refold", "subreddit_id": "t5_3azein"}, {"author": "Creative_Shallot_860", "body": "You've done a good job with your write up, and the language is cool. However, one issue I've noticed with a lot of these posts is that there are rarely good examples of the conlang in use. You have a couple of sentences, and some idiomatic phrases, but what about some longer, more complex examples that really show off how the language is used?\n\nAgain, this gripe is about these types of posts as a whole. I just find these types of descriptions to be far more intriguing and engaging with solid examples that show how the language is used in a larger context.", "created_utc": "1634060396.0", "edited": "False", "id": "hgdnt7q", "is_submitter": "False", "link_id": "t3_q6d64y", "parent_id": "t3_q6d64y", "score": "5", "subreddit": "conlangs", "subreddit_id": "t5_2red7"}, {"author": "Creative_Shallot_860", "body": "Yes and no. You are not going to gain new vocabulary and grammar by speaking, no. But, you're not going to gain the ability to speak unless you actually speak. \"Knowing a language\" generally requires for skills - listening, reading, speaking, and writing. Thus, by strengthening any of those, you are improving on your language ability, even though that improvement does not include \"new\" words or grammar.\n\nOn the flip side of that, I would be willing to bet that your ratio of passive to active vocabulary is MUCH greater than it probably should be. What does that mean? Of course you will have a larger passive vocabulary than active, that's just how it works. But, in order to output, you must convert a lot of the passive vocabulary to active, and that is a skill in and of itself. Thus, by converting from passive to active, you are improving on your language abilities.\n\nAll of the concerns you are stating here are for BEGINNERS, or possibly intermediates. At ~7 hours/day and 2+ years into studying, you are neither of those. You are no longer a beginner.\n\n> my end goal is just to be able to interact with native speaker and speak with them, but grinding hours infront your computer reading listening is the fastest way to do that\n\nNot anymore. \n\nIf more and more input is what will help your output, then, with all the input you get every day, why is your output not any good?\n\nThe ONLY thing that is going to improve your output at this stage is, quite literally, practicing output. Yeah, more input will generally equal new words or constructions, but if you can't reasonably use the words, grammar, and constructions you already have, then you need to dedicate MUCH more time to output practice and ensuring that you are able to properly use those words and constructions in impromptu speech.\n\nPut it this way, you will not be able to just speak if you haven't put in the practice. Yes, the input makes it easier in many ways, but without putting in focused practice, the MOST you are doing right now is building up some confidence around the edges, but not paying any attention to the core skill itself. \n\nI will say it again - if you want to get better at output, you no longer need to focus as much attention on input, you need to focus your attention more on practicing output.", "created_utc": "1629899256.0", "edited": "False", "id": "haairb9", "is_submitter": "False", "link_id": "t3_pa0vz8", "parent_id": "t1_haa5we9", "score": "1", "subreddit": "Refold", "subreddit_id": "t5_3azein"}, {"author": "Creative_Shallot_860", "body": "Same answer I gave you last time you asked a very similar question - https://www.reddit.com/r/Refold/comments/ohjpx1/best_content_for_fast_output/h4ss0s5/\n\nBasically, quit worrying about it. You've been studying for 2+ years. If you want to speak, just speak. Stop worrying about it.\n\n> i still intend do stick to immersion\n\nOf course you will - you'll be living there. Yes, sometimes that can be difficult, especially if you find it difficult to speak in the local language, in which case many people around you may push to speak English/your native language because your TL output is so bad.\n\nEdit:\n\n> just wondering how bad is outputting in general ? Like i know that outputting doesnt do anything to improve your language ability\n\nI don't understand this. Language, in and of itself, is literally nothing more than a means of communication. If you don't output, how do you expect to communicate? Maybe you wrote this question wrong, but it's absolutely asinine. Outputting doesn't do anything to improve your language ability? I mean, if you live in country, output *IS* your language ability. Sure you can walk around understanding all you want, but if you can't speak, then there's no point whatsoever in being there, go home. (yes, this final statement is a generality, but point still stands)", "created_utc": "1629748332.0", "edited": "1629749311.0", "id": "ha2lxbt", "is_submitter": "False", "link_id": "t3_pa0vz8", "parent_id": "t3_pa0vz8", "score": "5", "subreddit": "Refold", "subreddit_id": "t5_3azein"}, {"author": "Creative_Shallot_860", "body": "People from the US tend to have a hard time learning this. I find it to be ultra simple, but that is NOT a common opinion in the US. I've used the 24hr system exclusively for >20 years, but, more often than not, when I write down, the other person asks me what it means. I have used 24hr to communicate with my dad for a *long* time, and he still has no clue that it's merely \"h-12\".\n\nPersonally, I think OOPs math intuition is the worst part about the whole thing. I mean, he's not wrong by any means, but he *is* taking the long route to get to a very common and simple  subtraction operation (and, no, we should not jerk about people who have trouble with math, but since it's here, I wanted to point out that that was the point that struck me the most).", "created_utc": "1627908485.0", "edited": "False", "id": "h7f93oh", "is_submitter": "False", "link_id": "t3_ovv5ax", "parent_id": "t1_h7by6zt", "score": "8", "subreddit": "languagelearningjerk", "subreddit_id": "t5_37rt5"}, {"author": "Creative_Shallot_860", "body": "Oh, pod101... I recently bought the Greekpod access. I justify it because they gave me a good deal and I have made *much* worse financial decisions in my life, so it's not the *worst* purchase ever (maybe...).\n\nI got it specifically for 2 things - dialogues and associated sentence-by-sentence breakdowns and \"extensive readings\". One of these is good for a beginner, the other is complete trash.\n\nI like the dialogues, they are short, to the point, and, for a beginner, act as a means of comprehensible input with a transcript, which is actually rather hard to find for Greek - you generally have to pay a Patreon fee to get access to the transcripts. The audio has background noise too, which is nice for mimicking real listening situations. The associated lessons are generally trash, but as pure listening exercises, I won't complain. As an absolute beginner, you can get these dialogues for free. I'm not sure how many are free after the absolute beginner level though.\n\nThe extensive readings, on the other hand, are anything but. It's just a fucking infographic with some words and occasional sentences - there's nothing extensive about it. Furthermore, I can't find any actual \"readings\" anywhere, outside of the dialogue transcripts. It's almost like they decided to completely skip that skill altogether for the purposes of...something? I don't know, it strikes me as a very bizarre omission and a serious flaw in their product design.\n\nAs far as the video lessons go, most are utter horseshit. I do like the listening comprehension videos, though - you know the ones, they're free on YouTube, but the premium version of the site doesn't even have either extended versions OR other exclusive versions. Fuck that.\n\nThe grammar lessons are...fucking awful. This dude goes into these excruciating explanations of grammar constructions that are entirely unnecessary. Yes, sentence dissection and diagramming have their place, but in this case it's merely over-analysis that is useless for most learners, at best, and overly confusing nonsense for others. I've tried sifting through some of it for some supplemental material on verb forms, but, despite knowing exactly what I'm looking for, I can't find it anywhere, meaning that A) the search function is shit B) they don't explain things in that way C) they don't have explanations for it or D) the most likely, a mix of all three of those. Either way, the fact that I can't readily find what I'm looking for is bad enough.\n\nThus, my recommendation, don't waste your money. The videos like one here serve a *VERY* particular purpose, which is as a refresher (but I like the idea of quick grammar rundown videos as reference material). The vocab videos are just shit. It's the clickbait titles which lead to false hopes and unrealistic expectations that are the real failure though - I mean, I know they're trying to be encouraging, but this is just horseshit. Stick with the listening comprehension exercise videos on YouTube, but don't waste your time on the other videos unless you're just looking for a grammar refresher.", "created_utc": "1627907051.0", "edited": "False", "id": "h7f6qyw", "is_submitter": "False", "link_id": "t3_ovr2yj", "parent_id": "t1_h7egi88", "score": "1", "subreddit": "languagelearningjerk", "subreddit_id": "t5_37rt5"}, {"author": "Creative_Shallot_860", "body": "Frankly, I don't know which is worse between the prompt and the reply. At least in the reply OP admits the peculiarity.", "created_utc": "1627825361.0", "edited": "False", "id": "h7b9ii1", "is_submitter": "True", "link_id": "t3_ovrvss", "parent_id": "t3_ovrvss", "score": "12", "subreddit": "languagelearningjerk", "subreddit_id": "t5_37rt5"}, {"author": "Creative_Shallot_860", "body": "As someone who has lived in Moscow as an A2 Russian speaker, if OOP cannot find people who will only speak with him in Russian, he's not even trying... Sounds to me like he's staying inside of a little bubble an not even trying to make contact with the locals - and the cafes he's going to are in the touristy areas, because, outside of those areas, most wait staff certainly do not speak English.\n\nGranted, 12 years ago English wasn't *quite* as widespread as it is today, but still, most of the time the Muscovites would hear me speak English and then only speak Russian to me out of spite because they knew my Russian sucked.\n\nPlus, dude says he's an A2...Muscovites don't have time for that shit (especially with COVID right now...), either speak well or shut up. A2 will hardly get you a burger at McDonald's, and a lot of the Moscow Mickey D's use touchscreen and non-contact ordering now.\n\nEdit: My advice to OOP - quit being a little bitch, ride up to near the top of the grey line or bottom of the red line, and find a restaurant. Good luck getting what you think you ordered and finding your way back home.", "created_utc": "1627554147.0", "edited": "False", "id": "h6xunz0", "is_submitter": "False", "link_id": "t3_otkf8u", "parent_id": "t3_otkf8u", "score": "9", "subreddit": "languagelearningjerk", "subreddit_id": "t5_37rt5"}, {"author": "Creative_Shallot_860", "body": "Holy shit, it's even worse than that - OOP appears to be a native Portuguese speaker. \n\n/uj OOP looks like he's from Brazil, so maybe not as close as some other Romance languages/dialects.\n\n/rj OOP is still a fucking Portuguese speaker. That's not even bizarro French, it's literally just French from the other side of Spain.\n\nI mean, in 7 months I've listened to at least 3 podcasts in Greek - all the way from beginning to end. Bow before me, plebs.", "created_utc": "1627310770.0", "edited": "False", "id": "h6lb3s7", "is_submitter": "False", "link_id": "t3_orwhwd", "parent_id": "t3_orwhwd", "score": "22", "subreddit": "languagelearningjerk", "subreddit_id": "t5_37rt5"}, {"author": "Creative_Shallot_860", "body": "Oh, no, I don't disagree with you. I don't have a problem with Kreshen *per se*, I have a problem with the way that people have cherry picked his arguments and contorted those arguments into this strict, input-only bastard that serves no purpose other than justifying their own laziness. To me, strict input-only adherents are more interested in the social status of their \"race\" to log the most hours watching NL anime than they are in learning a language. But you're right, it's that cherry picking which has removed the \"continuum\" from the online language learning community and now all learning must be either \"traditional\" or \"input only\", apparently.\n\nHowever, my issue with Krashen stems from an anecdote he told in his interview with MvJ: he told a story about how his Spanish study (now) consists primarily of reading sci-fi novels and having a weekly conversation with a cashier at the grocery store. Despite not putting in any active study work (at least at the present time, I don't remember what previous work he had put in), he says that his speech improved with each weekly conversation. I simply fail to see how he is able to truly acquire the necessary vocabulary and store it properly by exclusively committing to extensive reading.\n\nNow, I don't necessarily disagree with that experience - I've had a similar experience with Russian. The difference is that I've been studying Russian for ~16 years, I've lived there, and I already consider myself to be a fluent speaker across a fair range of topics. My understanding of Krashen's anecdote is not that he was a beginner with Spanish, but I didn't see much evidence that he had really done that kind of work with Spanish outside of some basic studies. (I may be misremembering/misinterpreting some of that conversation, apologies if so, I don't mean to). And yes, it *is* Spanish, so I do give him a little bit more leeway due to how close Spanish can be to English. \n\nThe issue is that, in my opinion, this sets unrealistic expectations for beginners (and maybe even intermediates) who think that simple reading is going to make them fluent almost overnight. It's that unrealistic expectation mixed with the idea that you only need to listen A LOT, and that's all you need to learn a foreign language, even one as notoriously difficult as Japanese (at least for English/IE speakers).", "created_utc": "1627215144.0", "edited": "False", "id": "h6gt6yq", "is_submitter": "False", "link_id": "t3_oqstn7", "parent_id": "t1_h6glhl5", "score": "7", "subreddit": "languagelearningjerk", "subreddit_id": "t5_37rt5"}, {"author": "Creative_Shallot_860", "body": "Oh, absolutely. I just don't even understand how someone can look at the assumption and not immediately throw up their hands and question its merits. Then, on top of *not* recognizing the obvious flaws, they go all in like cult members. Like, I mean, you can already read, take advantage of that fact and put it to use. Learn some grammar (doesn't have to be *that* much, but most anything helps at least a little bit), and then learn some words.\n\nJust yesterday I got interested in Japanese verb conjugation patterns (I'm a grammar nerd, it excites me). So I looked it up, and that shit is simple. Like, really simple (I know there are complications, but compared to beginner level Russian and Greek verbs, it's a fucking cakewalk). Yes, your ear has to be conditioned to hear the final vowel sounds, but wouldn't it make SO MUCH MORE FUCKING SENSE to know that going in instead of just listening to gibberish for hours/days/months/years on end and not knowing something so easy and basic?", "created_utc": "1627164055.0", "edited": "False", "id": "h6es6r0", "is_submitter": "False", "link_id": "t3_oqstn7", "parent_id": "t1_h6epdof", "score": "8", "subreddit": "languagelearningjerk", "subreddit_id": "t5_37rt5"}, {"author": "Creative_Shallot_860", "body": "/uj I just don’t get how anybody can hear that and think, “That’s impeccable logic with no holes in it whatsoever.” I mean, it’s obviously flawed. I get that people want to listen to figures of relative authority (Krashen does have a PhD, I think?), but plenty of phds are total hacks and have no clue how the real world works. Plus, it seems to me that most of the people in the AJATT and learnjapanese subs are children, and they tend to be fairly immune to logical reasoning.\n\nFrankly, at least I’m terms of developing a “perfect” accent (I know that’s not addressed here, but I see it all the time, especially with the Refold kids), A) you won’t, B) the single best thing you can do is learn to sing, because that conditions your throat and voice to contort itself in a manner similar to accent development, and C) live in country. Even though some rehearsed phrases and speeches may be with a perfect accent (I get mistaken for native Russian all the time when I use rehearsed speeches), but free speech will quickly devolve into your “real” accent.\n\nBut yeah, if you tell me that you can learn all the vocabulary you ever need without practicing it, I won’t believe you and I’ll call you out on it until you can prove yourself.\n\nHowever, it is true that extensive reading/listening will help you improve, but only AFTER you put in all the requisite work.", "created_utc": "1627155525.0", "edited": "False", "id": "h6ebibr", "is_submitter": "False", "link_id": "t3_oqstn7", "parent_id": "t3_oqstn7", "score": "20", "subreddit": "languagelearningjerk", "subreddit_id": "t5_37rt5"}, {"author": "Creative_Shallot_860", "body": "Right, but you yourself have admitted to spending the bulk of your listening time using English subtitles.\n\n[From a thread 12 days ago](https://www.reddit.com/r/Refold/comments/ogyghq/modern_greek_180_day_update/h4ovmpw/), as of this writing:\n\n> It's been over 9 months, with over 500 closer to 600 hours of immersion. ~450 hours of it was with English subs and the rest raw.\n\nFor those interested, that's ~75%-90% of OP's time spent consuming native content *with* English subtitles (the lower bound assumes [some](https://www.reddit.com/r/ajatt/comments/oiu7ug/the_vital_tool_missing_from_your_japanese_studies/h50jgee/) time spent reading, the upper bound [assumes](https://www.reddit.com/r/languagelearning/comments/ohge2y/has_anyone_else_cut_out_the_formal_way_of/h4ovduy/) no [reading](https://www.reddit.com/r/languagelearning/comments/ohge2y/has_anyone_else_cut_out_the_formal_way_of/h4pv3dl/) - [but maybe a lot of reading?](https://www.reddit.com/r/languagelearning/comments/ogwdz3/anyone_learning_a_language_for_the_purposes_of/h51eduo/)), by his own admission.\n\nSo, then the question is, why are you posting this in a jerk sub? I mean, it's dumbassery at it's finest, but you're literally describing *what you actually do*. You still haven't offered any answers to my question about how you plan to deal with less frequent words/phrases/constructions that appear much less consistently than the most common words/phrases/constructions. Despite your claims of actually learning to listen to Japanese through listening input alone (granted, with somewhat occasional reading), you offer no actually evidence that you can understand more than simple and/or sporadic words and phrases.\n\n[By your own admission](https://www.reddit.com/r/Refold/comments/ogyghq/modern_greek_180_day_update/h4pcrkg/), you're a beginner giving other beginners advice, but you don't seem to ever preface your advice with the fact that you are, in fact, a beginner who seems to do nothing but watch anime and comment on Reddit all day. Plus, some of your advice is simply [naive](https://www.reddit.com/r/LearnJapanese/comments/okp056/help_me_pls/h599jk7/) or [very](https://www.reddit.com/r/LearnJapanese/comments/oh6neb/no_anki/h4o99p2/) [contradictory](https://www.reddit.com/r/languagelearning/comments/ohg8eo/anyone_else_not_make_their_own_flashcards/h4q81am/).\n\nIf your goal is to be king-advice-giver of Reddit rubes, congrats, you have achieved that, but you're not fooling anyone else. Instead, maybe you should actually put in some work, instead of going so far out of your way to justify your own laziness.", "created_utc": "1626966585.0", "edited": "False", "id": "h64utje", "is_submitter": "False", "link_id": "t3_op6jop", "parent_id": "t3_op6jop", "score": "13", "subreddit": "languagelearningjerk", "subreddit_id": "t5_37rt5"}, {"author": "Creative_Shallot_860", "body": "/uj I think Lamont (?) from Days of French n' Swedish summed it up well in a recent video. He admitted that, after thinking it over for a while, he was just scared of it, since there really is no end, it's effectively an infinite process. I think he's on to something - people are scared of the challenge that flashcards bring and the weaknesses that they can expose (can't just look up the word, if you're being honest, you actually *must* fail the card, etc).\n\nI've been using Anki for years, but I admit that I will give up on it after I feel like I've learned as much as I can from the main deck/couple of decks I've been working on. A lot of people who have never used SRS systems before simply don't see the value because they've never experienced it, and I think a lot of people just use \"Anki\" as a catch all term for SRS systems in general. \n\nAnd some people just bore easily, which I think is a cop out, but whatever.", "created_utc": "1626639886.0", "edited": "False", "id": "h5o7dg5", "is_submitter": "False", "link_id": "t3_omt2hb", "parent_id": "t1_h5ndcjv", "score": "15", "subreddit": "languagelearningjerk", "subreddit_id": "t5_37rt5"}, {"author": "Creative_Shallot_860", "body": "In British English (and maybe Australian/other non-American dialects), they use pavement to mean sidewalk. But, I'm not sure if that particular usage is countable or not, though I'm inclined to think so since sidewalk is countable in American English (granted that's not in any way a scientific conclusion). Thus, to me, \"on a pavement\" sounds weird, but would make perfect sense if you replace it with \"on a sidewalk\".", "created_utc": "1626271132.0", "edited": "False", "id": "h55kx6q", "is_submitter": "False", "link_id": "t3_ok0yqg", "parent_id": "t1_h55j5ls", "score": "3", "subreddit": "languagelearningjerk", "subreddit_id": "t5_37rt5"}, {"author": "Creative_Shallot_860", "body": "It's ok, I know just how to speak their language:\n\n> Felicitations malefactors, I am endeavoring to misappropriate the formulary for affordable comestibles. WHO WILL JOIN ME?!\n\nSounds to me like OOP is just trying to be Plankton.", "created_utc": "1626263577.0", "edited": "False", "id": "h557s0e", "is_submitter": "False", "link_id": "t3_ok0yqg", "parent_id": "t1_h554i47", "score": "32", "subreddit": "languagelearningjerk", "subreddit_id": "t5_37rt5"}, {"author": "Creative_Shallot_860", "body": "That was obviously a joke? I have read the website through several times. I'm still allowed to disagree with it. I think that the whole method can be made simpler by just using some supplemental materials and thus these people who claim they don't use any sort of dictionaries, grammar reference, etc, are full of crap.\n\nI also believe that training output from early on is important as it is important to build up all skills in tandem, not one at a time. That saves the effort of essentially starting from scratch when you go to output.\n\nWhen I talk about dumbasses who think they're going to become fluent by watching only tv and reading some, I'm referring to certain people on Reddit (they are loud, you can find them easily). I am fully aware of which materials Refold recommends, I use them too. I am fully aware of how it says one should begin speaking, and I disagree with it. But what I really disagree with/think is absolutely idiotic, is the questions like, \"Is it too early to output? i don't want to form bad habits\" because, guess what, EVERYBODY will form a bad habit in one way or another - don't worry about it, just output if you want to. Continuing to just read novels is not going to help you output if you don't actually train any sort of output.", "created_utc": "1626222186.0", "edited": "False", "id": "h53lhrw", "is_submitter": "True", "link_id": "t3_ojosvq", "parent_id": "t1_h53k4lq", "score": "11", "subreddit": "languagelearningjerk", "subreddit_id": "t5_37rt5"}, {"author": "Creative_Shallot_860", "body": "Hey now, I read the first sentence of some of the paragraphs. I can tell you that, if I just listen enough, I too can learn Japanese without a dictionary, flashcards, grammar study, or anything else. That's the only true way to speak Japanese like a native with no accent. Bonus point if I read Harry Potter as an absolute beginner. Am I doing it right?", "created_utc": "1626220697.0", "edited": "False", "id": "h53ioat", "is_submitter": "True", "link_id": "t3_ojosvq", "parent_id": "t1_h53i0pu", "score": "1", "subreddit": "languagelearningjerk", "subreddit_id": "t5_37rt5"}, {"author": "Creative_Shallot_860", "body": "I've only watched a couple of his videos, but I've never felt like I should watch more. I do believe that there is something to the whole comprehensible input thing, and I can notice marked improvements when listening to more advanced input alongside easier, more comprehensible stuff than just the advanced input alone. When starting out, I don't mind the Refold approach, but it has its limits, and those limits become apparent pretty quickly.\n\nRecently I've been doing whole sentence flashcards both directions (and seeing great success with it), but some kid in there got onto because \"that's not how you train output\". It would be sad if it weren't so ridiculous. \n\nI thought that sub might be something fresh after dealing with the r/languagelearning horseshit for years, but, no, it's not. It's much worse - it's either massive overanalyzing, dumbasses thinking they can become fluent in very difficult languages through listening input alone, and kids who are just lazy and don't want to put in any work.", "created_utc": "1626216567.0", "edited": "False", "id": "h53aquw", "is_submitter": "True", "link_id": "t3_ojosvq", "parent_id": "t1_h538xi8", "score": "7", "subreddit": "languagelearningjerk", "subreddit_id": "t5_37rt5"}, {"author": "Creative_Shallot_860", "body": "I tried to offer advice to OP and actually answer his question, but the two highest rated responses both consisted of either, \"You need to tell us more about how much time you spend consuming input\" or \"you should consume more input\". Ultimately OP seems to have decided that he will just continue to read more out of fear that speaking will lead to the formation of bad habits that he may never be able to break.\n\nI just don't get the mindset over there that input and input alone will make you perfect in a language. Those kids are in for a very rude awakening when they go to speak for the first time and realize that they can't recall any words or form a decently complex sentence. Even worse, *none* of them will be able to write for a very long time since they will have to start essentially from scratch. I mean, come on, just put in some work up front and save yourself all the trouble later...", "created_utc": "1626213360.0", "edited": "False", "id": "h5348lb", "is_submitter": "True", "link_id": "t3_ojosvq", "parent_id": "t3_ojosvq", "score": "19", "subreddit": "languagelearningjerk", "subreddit_id": "t5_37rt5"}, {"author": "Creative_Shallot_860", "body": "> Also how bad is it to output now?\n\nIt's fine, don't worry about it. You will form some bad habits at some point along the way. Some people will tell you that enough immersion prior to output will defeat those habits, but it won't. It will help lessen the impact, but it won't just magically prevent any and all potential bad habits. That's just a fundamental truth of how language learning works - you will make mistakes, your NL will interfere to a degree, and you will develop bad habits at least to a degree. So don't worry about it.\n\nWhen you say your output is lagging, in which way? Are you having trouble forming sentences, stringing individual phrases/constructions into larger sentences, recalling words, using the correct grammar points in the correct places, any combination of those issues? Yes, more input will help alleviate these issues *eventually*, but if you want to output, you need to engage in activities that, you know, train output.\n\nWhen you read, are you reading content that is conducive to mimicking natural speech? This could include YouTube comments or Japan/Japanese-centric Reddit threads (maybe manga? I don't know, I've never read a manga, I don't know how \"conversational\" the language is). \n\nDo you have much experience writing? Writing is harder than you think and it is among the most helpful exercises you can perform. When you sit down to write, you'll be surprised by how little you actually know. A couple of possible exercises: \n\n* Respond to some Reddit posts in the Japanese learning subs and ask people to help correct you. People will help. The comments don't have to be long, just say what you can.\n\n* Try Robin McPherson's Journaly app. I haven't used it myself, but I've heard some good reviews and people do seem to generally want to help.\n\nHave you done any shadowing? Don't pull content directly from native media, but use content from JapanesePod101's listening comprehension series on YouTube. Find an appropriate level, and shadow through the dialogues line by line. Is it perfect? No. Does it train you mouth muscles and rhythmic flow? Yes. \n\nTalk to yourself. Tell the story of what you're doing while you're doing it. Even if the person sitting next to you doesn't speak Japanese, tell them the story of what you're doing right now. There's a difference between talking to yourself and actually speaking to another person. You can tell me a story. I don't speak any Japanese so I can't help you at all, but if you wanted to write up a short story about how you made breakfast and DM it to me, by all means - the act of doing it will help you more than doing nothing at all. (FYI, it was only at this point in writing this that I realized you said that you meet up with Japanese folks regularly, but all the concepts still apply).\n\nAll in all, if you want to output, output. Don't get caught up in the right content, because, by definition, output is the *creation* not the *consumption* of content (shadowing aside). Don't worry about making mistakes, you will make them, laugh at them. Don't worry about bad habits, you will form some, you just need to respect the feedback you get and do what you can to avoid reinforcing the bad habits.", "created_utc": "1626003283.0", "edited": "False", "id": "h4ss0s5", "is_submitter": "False", "link_id": "t3_ohjpx1", "parent_id": "t3_ohjpx1", "score": "4", "subreddit": "Refold", "subreddit_id": "t5_3azein"}, {"author": "Creative_Shallot_860", "body": "> Clearly you don't have the experience of consuming a ton of native material without subtitles or dictionaries like I do.\n\nI guess you missed the part where I lived in Russia for 3.5 years; took grad-level uni classes; watched tv for multiple hours every day (my tv was a cheap Russian POS, it didn't have a subtitles option); my MIL, who has lived with me for 2.5+ years and doesn't speak a word of English, doesn't have subtitles when she speaks; subtitles don't appear across my wife's body when she speaks. \n\nI studied German for ~8 years without ever seeing a subtitle. I can easily watch most TV content, because I put in the work to learn the words . Same for French, but I only actually studied that for ~4 years (it was a lot easier).\n\nPut it this way, if you are younger than 24, I've been studying foreign languages with all kinds of natural input for as long as, or longer than, you've even been alive. You're sharing your experience and I'm sharing mine. Your experience is minuscule to the point of almost non-existent compared to mine.", "created_utc": "1625928108.0", "edited": "False", "id": "h4peugv", "is_submitter": "True", "link_id": "t3_ogyghq", "parent_id": "t1_h4pcrkg", "score": "1", "subreddit": "Refold", "subreddit_id": "t5_3azein"}, {"author": "Creative_Shallot_860", "body": "So, at <=600 hours, that means that, minus certain domain-speciifc terms that may come up in certain situations, you will get decent exposure to ~1500-2000 words regularly enough to be able to rely on that regularity. The question becomes, what happens next? What happens when you get up to the 5000-10000 most frequent range? At that point, you won't be able to place any sort of reliance whatsoever into consistency in comprehension, save for some domain-specific terms, depending on the input. This will probably begin around the time is in the 3000 most frequent range, simply due to the fact that that word may not appear more than 1-2 times every few *weeks*, and then not show up again for another several weeks. Language is just sporadic like that. What about infrequent non-translatable grammar structures (this happens a lot with negatives and adverbs) that only come up on occasion? \n\nPlus, without a means of understanding subtle shades of difference in meaning between close synonyms, how do you propose that you will learn them properly? I still misuse some Russian synonyms, and I've been at Russian for 16+ years, lived there for ~4, and speak it regularly at home.\n\nSay you actually have a strategy for the above problems. Since you won't have been training any output at all or keeping any sort of reference of the words you've \"learned\", how do you propose converting those words to your active vocabulary? You won't have any sort of reference sheet, so how to refresh your memory? Again, the most frequent 1500-2000 (maybe even up to 3000) will be ok, but beyond that, you'll need something else. \n\nYou remind me of the dude learning Russian who used to post on here a lot and, despite being <6 months in, was going around giving out all kinds of advice to anyone who would listen. He admitted to watching TV shows that were not at all appropriate for him and then, after a few months of a Memrise deck, he declared he would read Harry Potter. My question was, since he had absolutely zero grammar foundation, didn't know how to build out extended verb forms, didn't know the basics of verbal aspect, and didn't know many words, how the hell was he going to read a proper novel? He hasn't posted much since, so I have no idea how that's going for him, but my guess would be somewhere between \"not well\" and \"failed\".\n\nFor a ten-day-old account, much less only 9 months of experience, you give out Japanese-learning advice on Reddit like it's your job. It seems to me that you have no qualifications whatsoever to do that. You called me out for how I'm experimenting with production, yet I don't see that you have any experience whatsoever. Based on your comment history, it doesn't appear that this was your method for learning English (which you don't seem to like, so maybe you did English in school as a compulsory class? You don't talk about it like you're self-taught in it at all).\n\nYour original quote was \"There's a reason you don't train production like that\". You haven't actually expounded on \"that reason\" or explained why my approach was \"wrong\". All you offered was \"more input\", which I readily admitted that I needed in my original post, especially \"comprehensible input\". Yes, you've offered, \"If it works for me, go for it\", but that's not what I'm asking. My questions are, beyond raw input, how do you propose I go about \"training production\", and how does your method compares to mine? \n\nAlso, there's a significant likelihood I'll be in Greece 1.5 months from now, how would you suggest I prepare so that I can make the most of my time there?", "created_utc": "1625925390.0", "edited": "False", "id": "h4p9q2z", "is_submitter": "True", "link_id": "t3_ogyghq", "parent_id": "t1_h4p3owb", "score": "4", "subreddit": "Refold", "subreddit_id": "t5_3azein"}, {"author": "Creative_Shallot_860", "body": "> with over 500 closer to 600 hours of immersion. ~450 hours of it was with English subs\n\nOk, you don't use English subtitles *anymore*. But 450 hours is *still* 75-90% of the total hours as per your quote.\n\nStill, how much do you *really* comprehend when you go into a new piece of content with no subtitles or other form of comprehension support?", "created_utc": "1625920943.0", "edited": "False", "id": "h4p2jol", "is_submitter": "True", "link_id": "t3_ogyghq", "parent_id": "t1_h4oz472", "score": "2", "subreddit": "Refold", "subreddit_id": "t5_3azein"}, {"author": "Creative_Shallot_860", "body": "Right. So you've put in an average of ~2.25 hours/day (at the high end) over ~270 days, but ~75% of that has been with English subtitles - of course, you haven't delineated listening from reading, so that math assumes all of it is listening input. If not, then >75% of the listening input has been with English subtitles and <25% has been spent reading. Not that there's anything wrong with that, just pointing it out.\n\nSo, my question then becomes, how can/do you measure the amount of Japanese you intrinsically understand vs how much you get from the English subtitles? Also, what is the nature of the content you're consuming? An average TV show or Peppa Pig/Caillou?\n\nThe problem with your example is that, if you drop me in France, there are no English subtitles (at least I didn't come across any when I lived in Russia for several years...). I mean, if you're an Italian speaker dropped in France, then it's not going to be all that hard.\n\nAre you a Mandarin speaker? If so, you're already way ahead, and that's probably something you should point out when describing your learning style. And yes, I know all about the linguistic differences between the two, but let's not pretend that there haven't been centuries of word borrowings and writing system crossover.\n\nEdit: Forgot to add, in 9 months, how much have you actually achieved? Like, without subtitles, watching proper native content, how much do you really get from it?", "created_utc": "1625918134.0", "edited": "False", "id": "h4oypjr", "is_submitter": "True", "link_id": "t3_ogyghq", "parent_id": "t1_h4ow8fm", "score": "3", "subreddit": "Refold", "subreddit_id": "t5_3azein"}, {"author": "Creative_Shallot_860", "body": "Ok, but how do you actually learn anything new? Like, you just \"learn\" new words by hearing them again and again without even looking them up or understanding their function in the sentence/context? What's your NL/TL?", "created_utc": "1625915693.0", "edited": "False", "id": "h4ovtbz", "is_submitter": "True", "link_id": "t3_ogyghq", "parent_id": "t1_h4ovmpw", "score": "2", "subreddit": "Refold", "subreddit_id": "t5_3azein"}, {"author": "Creative_Shallot_860", "body": "Honest question for you - what is your process and experience for internalization? How long have you been working at your TL? What is your process for learning new words/grammar?", "created_utc": "1625915040.0", "edited": "False", "id": "h4ov3dw", "is_submitter": "True", "link_id": "t3_ogyghq", "parent_id": "t1_h4o2haq", "score": "3", "subreddit": "Refold", "subreddit_id": "t5_3azein"}, {"author": "Creative_Shallot_860", "body": "Exactly. When I lived in Russia, I did *A LOT* of TL-NL cards, and never mixed in any other type of card. Yes, my passive recognition was great, but, despite constant input (watched tv pretty much anytime I was in my room, taking classes in Russian - not Russian classes, grad-level uni classes - talking to friends, etc), so input wasn't exactly lacking, but my recall and production still sucked. \n\nSo, this time around, I wanted to try something new, and thus far the extra effort up front seems to be helping me quite a lot. I know this is the Refold sub and all that, but no single method or philosophy is perfect for every person, and I've really been enjoying experimenting with Refold + whatever else I want to do while learning Greek.", "created_utc": "1625880357.0", "edited": "False", "id": "h4nm91u", "is_submitter": "True", "link_id": "t3_ogyghq", "parent_id": "t1_h4neqr1", "score": "6", "subreddit": "Refold", "subreddit_id": "t5_3azein"}, {"author": "Creative_Shallot_860", "body": "Yeah, I don't really give a shit if that's the \"right way\" or not haha. It has significantly helped me retain the words and recall them in real time when needed. I mean, you can learn the word/sentence in one direction if you want to, but maybe learning it in two directions also provides benefit.\n\nI've done years of experimenting with different ways of using Anki, and this is one that really pushes me and provided solid results, and frankly I don't really give two shits about what the Refold site has to say about it. We all learn differently and we all have different goals.\n\nThere is never any harm in learning collocations and idiomatic speech patterns. My philosophy is, learn them now so you don't sound like a foreigner later. I learn them best via recognition *AND* production. \n\nMaybe you should try it. Other people who speak multiple languages really well (as opposed to one) don't seem to think it's a bad idea to go both directions, so it's obviously not going to hurt you - it might actually help.", "created_utc": "1625850666.0", "edited": "False", "id": "h4m0cui", "is_submitter": "True", "link_id": "t3_ogyghq", "parent_id": "t1_h4lyia2", "score": "8", "subreddit": "Refold", "subreddit_id": "t5_3azein"}, {"author": "Creative_Shallot_860", "body": "Which part are you referring to regarding production?", "created_utc": "1625849164.0", "edited": "False", "id": "h4lwzt9", "is_submitter": "True", "link_id": "t3_ogyghq", "parent_id": "t1_h4lw67o", "score": "0", "subreddit": "Refold", "subreddit_id": "t5_3azein"}, {"author": "Creative_Shallot_860", "body": "# ,Mbeşa\n\n**Xiró ku sẽşũlā kçad şe pēřeb.**\n\n/xi.'ro ku sẽ.'ⁿʃũ.ⁿlaː k͡ɕad̚ ʃe 'peː.ʁeb̚/\n\nI must give money to her in evenly divided segments of time for a period of life\n\nXiró-ø | ku | sẽşũ-lā | kça-d | şe | pēře-b\n---|---|----|----|----|----\nmoney-ABS | her.INST | time-evenly_divided | life-ADV | IMP | give.PFV.PRES-1.SG \n\n,Mbeşa is still a work in progress, so I'm making do the best I can with certain vocabulary constraints. \n\nIn this sentence, the verb is affected by an imperative adverbial. This sentence doesn't quite meet the requirements for being irrealis (here, the IMP + IRR = ought to / should), nor does the verb \"pēřa\" have an imperfective form. That said, this sentence is still not truly indicative, because we don't know that it has actually occurred or if the condition will definitely continue indefinitely, despite the implication that it will. Therefore, the ABS-ERG is used to imply that the speaker is forced into the action, which can be understood by the apparent disagreement between the agent \"xíro\" and verb person, which is 1.SG.", "created_utc": "1622146458.0", "edited": "1622151119.0", "id": "gzoeugm", "is_submitter": "False", "link_id": "t3_nmfbsp", "parent_id": "t3_nmfbsp", "score": "3", "subreddit": "conlangs", "subreddit_id": "t5_2red7"}, {"author": "Creative_Shallot_860", "body": "A few links for reference that may help you:\n\n[Conlang: Fireside Polysynthesis for Novices (Part 1/2)](https://www.youtube.com/watch?v=Qh9oEw3uCNA)\n\n[The Evolution of Noun Incorporation](http://mithun.faculty.linguistics.ucsb.edu/pdfs/1984%20The%20evolution%20of%20noun%20incorporation.PDF)\n\n[Polysynthesis for Novices](http://www.incatena.org/viewtopic.php?p=955527)\n\n[Biblaidion's Ilothwii Case Study](https://www.youtube.com/watch?v=VpXsrBd2xn8)", "created_utc": "1621973941.0", "edited": "False", "id": "gzflipl", "is_submitter": "False", "link_id": "t3_nkybm2", "parent_id": "t3_nkybm2", "score": "12", "subreddit": "conlangs", "subreddit_id": "t5_2red7"}, {"author": "Creative_Shallot_860", "body": "In ,Mbeşa, originally two verb stems - one for imperfective and one for perfective - were followed by a conjugated copula that provided TAM information. Over time this copula fused with the stem and the verb stem itself came to encode tense, aspect, and mood, along with person and number when conjugated.\n\nAt the same time, the copula fused, and thus the stem fused, with a separate marker that encoded evidentiality, resulting in four verb stems - imperfective, perfective, irrealis imperfective and irrealis perfective - which are used for hypotheticals, conditionals, and evidentiality. Each verb stem has three tense forms, resulting in a total of twelve stems for most verbs, although the realis future is slowly being replaced by the irrealis future, and may eventually phase out entirely, leaving only ten stems.\n\nThe copula was not completely discarded though. Now, the standard verb stem can be followed by the copula carrying TAM, person, and number encodings to denote intermediary tenses - recent past, distant past, immediate future, and distant future. \n\nThe verb stems also became the basis for converbs, sucking on case markers to reflect adverbial meanings, giving a total of 11 distinct converbs, due to some converbs carrying both imperfective and perfective encodings.\n\nKāgla keb üdjeg ,mkaşādüla, āho sdūřab\n\n/'kʰaː.gla kʰeb̚  uᵐ.d͡ʑeg̚  'ᵊm͜ka.ʃaː.duᵐ.la aː.jo 'sduː.ʁab̚ /\n\nI told you because it appeared that his animal was being taken away by a foreigner.\n\nKāgla | keb | üdj-eg | ,mkaşād-üla | āho | sdūřa-b\n---|---|----|----|----|---- \nanimal.ABS | 3.SG.POSS | foreigner.ERG | INFER\\take_away.IRR.IPFV.PST-CVB;CAUS | 2.SG;DAT | tell.PFV.PST-1.SG\n\nEdit: Patched up the gloss.", "created_utc": "1621708322.0", "edited": "1621712869.0", "id": "gz2wwea", "is_submitter": "False", "link_id": "t3_ninmdn", "parent_id": "t3_ninmdn", "score": "3", "subreddit": "conlangs", "subreddit_id": "t5_2red7"}, {"author": "Creative_Shallot_860", "body": "I agree with you, I think that speaking and shadowing from the beginning is a good idea. However, there are some caveats with that.\n\nThere are a couple of schools of thought regarding speaking (not necessarily shadowing) from the beginning. One says, absolutely, go for it. The other - Lamont from Days of French 'n' Swedish is of this school, I believe - says that speaking too early will interfere with accent development and therefore should be avoided. I understand where that school is coming from, but I disagree on how much it will affect someone's accent. That said, my mouth is really good with accents, so I might be an exception to the general rule.\n\nOn shadowing, it's all about the source material. For an absolute beginner, the material needs to be a recording of a real person, but only using simplified language, with accompanying text, and with the ability to control the playback speed. For example, LanguagePod101 Absolute Beginner lessons, Teach Yourself lessons, and Glossika are all good resources since they use an appropriate level of language, contain the text that you can read, and you can control the playback speed and slow it down in order to practice the mechanics before speeding up to natural speed. Then, once learned, you can use the audio at natural speed as early listening exercises until you're comfortable with the mechanics, rhythm, and sticking points, such as where minor syllables are reduced.\n\nThere's also the added benefit of greater retention and recall due to being able to pronounce the word correctly, both within and outside of context. In addition, it's also a good method of sentence mining for beginners, since, at this point, if the language level is appropriate, EVERYTHING will be something you need to know, with no uncommon or super difficult words. \n\nLet me give a practical example. I'm learning Greek, which has a really simple and limited phonology, but a lot of vowel-on-vowel sequences, which get pushed together in normal speech. Shadowing at the absolute beginner level - using GreekPod101 lessons and, recently, Glossika - has helped me to learn the mechanics of the language's rhythm and pronunciation as well as to hear those vowel chains and reductions when I immerse.\n\nOn the opposite end of the spectrum, I was flirting with Georgian last summer. Georgian is notorious for ridiculous consonant clusters and series of very similar sounding consonants (I live -> /vts'xovrob/). Without shadowing the texts in my textbooks, my ear would have never learned to hear some of those clusters. Don't get me wrong, I never immersed enough to truly learn to hear it all, but shadowing certainly helped with learning a language that different from English. Since Georgian is my real TL goal, now that I know they have it on Glossika, I may give it another go once I feel comfortable with Greek (which I'm frankly using as something of a proof-of-concept for my own adaptation of Refold).\n\nEdit: Spelling", "created_utc": "1619606920.0", "edited": "1619607511.0", "id": "gw5ox4e", "is_submitter": "False", "link_id": "t3_n09cxk", "parent_id": "t3_n09cxk", "score": "5", "subreddit": "Refold", "subreddit_id": "t5_3azein"}, {"author": "Creative_Shallot_860", "body": "I've thought about this some. The way I see it, it comes down to a few different factors.\n\n1. If it's a word you wouldn't normally use in English, do you think you'll use it in your TL? If, for whatever reason, it keeps popping up (like in the news or something), then go for it, otherwise, you can probably pass.\n2. If you have a 5,000-10,000 word frequency list, you are B2 or lower, and it's not on the list, throw it out.\n3. Does it fit a domain you need? I have a degree in political science and I watch a lot of news, so I find political and government words very useful to my daily activities, so I would keep that. But, for someone not concerned with daily government functions, visas, or immigration, that person really doesn't need a word like that.", "created_utc": "1617810978.0", "edited": "False", "id": "gtp8k1o", "is_submitter": "False", "link_id": "t3_mm4avk", "parent_id": "t3_mm4avk", "score": "5", "subreddit": "Refold", "subreddit_id": "t5_3azein"}, {"author": "Creative_Shallot_860", "body": "Hmm, I would have thought that “taxi” came from the Greek “taxirevo (ταξιδεύω)”, meaning “to travel”.", "created_utc": "1617756310.0", "edited": "False", "id": "gtmvxu2", "is_submitter": "False", "link_id": "t3_ml71dh", "parent_id": "t3_ml71dh", "score": "2", "subreddit": "etymology", "subreddit_id": "t5_2qspe"}, {"author": "Creative_Shallot_860", "body": "Thank you. Spotify has good Greek Rock playlist that I listen to sometimes, but I don't listen to music as often as I should.", "created_utc": "1617722284.0", "edited": "False", "id": "gtktm6n", "is_submitter": "True", "link_id": "t3_mkkk8a", "parent_id": "t1_gtht7b9", "score": "2", "subreddit": "Refold", "subreddit_id": "t5_3azein"}, {"author": "Creative_Shallot_860", "body": "I agree, good content is hard to track down. For the two shows, the first was Στο Πάρα 5, but I had to search out episodes individually as a lot of episodes get hit with country blocks. The second is Το Σόι Σου, with YouTube links [here](https://www.youtube.com/watch?v=Jn4ZMAxs7VM&list=PLDW22STpxhC6-3DUFbym7cUFU0YIKx5-I&index=1) and blurbs [here](https://www.alphatv.gr/show/to-soi-soy/).\n\nI also really like [Timoleon Diamantis](https://www.youtube.com/channel/UCAal85Of_iV4-USqQAQizWg), even though he doesn't have subtitles at all.\n\nDo you like Glossika? I like the idea of it, but I just can't bring myself to spend so much money on it, even with introductory offers and deals. Right now I'm using GreekPod101 conversations for shadowing practice.\n\nI've wanted to do an Assimil course, but I wasn't able to find a bootleg copy so I haven't.", "created_utc": "1617722184.0", "edited": "False", "id": "gtkte66", "is_submitter": "True", "link_id": "t3_mkkk8a", "parent_id": "t1_gtjqxcd", "score": "1", "subreddit": "Refold", "subreddit_id": "t5_3azein"}, {"author": "Creative_Shallot_860", "body": "Thanks for that second channel, I had seen it yet. I really like Καθημερινή Φυσική and The Skeptic Theory. Mikeius Offiical also has some good videos in a similar vein, but I've only found that the older stuff has subtitles.", "created_utc": "1617721207.0", "edited": "False", "id": "gtkr7fy", "is_submitter": "True", "link_id": "t3_mkkk8a", "parent_id": "t1_gti61hf", "score": "1", "subreddit": "Refold", "subreddit_id": "t5_3azein"}, {"author": "Creative_Shallot_860", "body": "Still solidly an A1 as per CEFR. I've been taking my time with a lot of things, so vocab acquisition has been slower than it probably could be in a less busy world, e.g. with Language Transfer, I left a lot of vocab on the table - I should have recorded it and put it in Anki, but I didn't have the time for some of it, as I was a little more focused on grammar than vocabulary. Plus, those words were really common, so I knew I would come across them soon enough through other sources. \n\nHowever, I feel like there is a reasonable expectation that, at my current pace (the biggest variable here), I could reach A2 by the 180 day mark. That may be at the upper range of possibilities, but I don't think it is entirely unreasonable, especially when I start reading more.", "created_utc": "1617643248.0", "edited": "False", "id": "gth2yvo", "is_submitter": "True", "link_id": "t3_mkkk8a", "parent_id": "t1_gth0fua", "score": "1", "subreddit": "Refold", "subreddit_id": "t5_3azein"}, {"author": "Creative_Shallot_860", "body": "Dude, stop. If you don't want to put in the work, then don't study Russian, you're not going to learn it.\n\nI would think that \"learned English with just YouTube\" probably means watched a bunch of English teaching/class-like videos in order to learn things that they then went and studied while also watching native content for comprehension practice.\n\nI've been studying Russian since 2006. I have lived in Moscow for ~4 years. I earned a Master's degree from a Moscow university. My wife is Russian and I communicate often with Russian speakers. My MIL only speaks Russian, comes to visit for 6 months at a time, and doesn't know when to shut up. I still look up words regularly and do flashcards daily because that's just how it goes and I'm always trying to improve. And that's in addition to Greek, which I started in January. \n\nNo, you don't have to, but unless your native language is Belorussian, no, you're not just going to learn Russian by watching YouTube and reading. As per our last conversation, you don't even know your cases yet, much less any other significant grammar. If you don't know your cases, you don't know what's happening. If you don't know how aspect works, you don't know what's happening. If you don't know the most common adverbs, you will not comprehend.\n\nYou're constantly asking questions about how you can be lazier about learning this language. It is hard. It is very different from English - words are formed differently, verbs behave differently, there is more meaning per syllable than in many other languages. There is no easy way out - either put in the work or accept that you're not actually learning the language and find a different hobby.", "created_utc": "1617412437.0", "edited": "False", "id": "gt78z1z", "is_submitter": "False", "link_id": "t3_mit1lo", "parent_id": "t3_mit1lo", "score": "19", "subreddit": "Refold", "subreddit_id": "t5_3azein"}, {"author": "Creative_Shallot_860", "body": "Greek, 3-4 hours/day\n\nRussian, 2+ hours/day maintenance and improvement\n\nTrying to gather the proper materials for Georgian...", "created_utc": "1616633299.0", "edited": "False", "id": "gs48kcl", "is_submitter": "False", "link_id": "t3_mchffp", "parent_id": "t3_mchffp", "score": "3", "subreddit": "Refold", "subreddit_id": "t5_3azein"}, {"author": "Creative_Shallot_860", "body": "Search YouTube.", "created_utc": "1616624475.0", "edited": "False", "id": "gs3q6ud", "is_submitter": "False", "link_id": "t3_mcdk02", "parent_id": "t1_gs3q516", "score": "2", "subreddit": "Refold", "subreddit_id": "t5_3azein"}, {"author": "Creative_Shallot_860", "body": "её*\n\nёе is illegal in Russian phonetics. The umlaut is almost never written, especially in participles - thus, if you don't know whether the participle contains a \"ё\" or a \"e\", you won't know the proper pronunciation.\n\nThat's different that standard phonemic stress. That is never written in native texts and materials, but functions as importantly as a 34th letter of the alphabet.", "created_utc": "1616624441.0", "edited": "False", "id": "gs3q43f", "is_submitter": "False", "link_id": "t3_mcdk02", "parent_id": "t1_gs3pnqc", "score": "1", "subreddit": "Refold", "subreddit_id": "t5_3azein"}, {"author": "Creative_Shallot_860", "body": "Whenever you want - 1-7 times a week, however you like.", "created_utc": "1616624029.0", "edited": "False", "id": "gs3p7uk", "is_submitter": "False", "link_id": "t3_mcdk02", "parent_id": "t1_gs3ovcx", "score": "2", "subreddit": "Refold", "subreddit_id": "t5_3azein"}, {"author": "Creative_Shallot_860", "body": "Also, maybe more importantly than anything else I've said, if you don't know how to recognize an unmarked \"ё\" and don't know where stress falls in words, get off the Harry Potter and LEARN THAT NOW. You WILL NOT learn those subtleties through reading (save for graded readers that mark both uninflected and inflected stress) and listening with subtitles + actively learning the contours of the words + flow of the sentence. \n\nGet the stress wrong in speaking, people will not understand you.", "created_utc": "1616623993.0", "edited": "False", "id": "gs3p50y", "is_submitter": "False", "link_id": "t3_mcdk02", "parent_id": "t1_gs3makk", "score": "2", "subreddit": "Refold", "subreddit_id": "t5_3azein"}, {"author": "Creative_Shallot_860", "body": "That's why I'm suggesting you only look things up for 15-20 minute blocks, the rest of the time you just go about your normal activity.\n\nNo, the decks are not in native context. They do not cover all of the various way in which parts of speech can be used in a sentence. They do not cover the difference in how to use that verb in speech versus in written language.\n\nThe Refold site is a fantastic guide, but at the end of the day you still have to make things work best for you and your learning style. Experiment some, see what works best.", "created_utc": "1616623707.0", "edited": "False", "id": "gs3oiz7", "is_submitter": "False", "link_id": "t3_mcdk02", "parent_id": "t1_gs3nm8d", "score": "3", "subreddit": "Refold", "subreddit_id": "t5_3azein"}, {"author": "Creative_Shallot_860", "body": "Also, remember, spoken Russian is different than written Russian. Books will help you learn words, but not necessarily how to use them in speech. Plus, you will NOT get standard spoken Russian via books - it's totally different once the speech phrases and adverbs get involved.", "created_utc": "1616623145.0", "edited": "False", "id": "gs3natl", "is_submitter": "False", "link_id": "t3_mcdk02", "parent_id": "t1_gs3makk", "score": "3", "subreddit": "Refold", "subreddit_id": "t5_3azein"}, {"author": "Creative_Shallot_860", "body": "Because context. Does the anki deck include aspect pairs and prepositions + cases? If not, you're going to to sniff that stuff out in the real world. Russian has a lot of interesting layers to it, and many verbs can significantly change meaning depending on which preposition/case they take (or if they are reflexive or not, because not all Russian reflexive verbs are true reflexives).\n\nIn addition, there are a LOT of very difficult adverbs and conjunctions formed by smashing together a preposition and declensed question word - the meanings are rarely transparent and they can often overlap, so you MUST learn them in context - no anki deck will properly prepare you to understand or use them.\n\nBut yeah, language learning IS a chore. You're an English speaker learning Russian, you MUST PUT IN THE WORK, because, without that work, it's not going to just \"click\" one day.", "created_utc": "1616623029.0", "edited": "False", "id": "gs3n1oo", "is_submitter": "False", "link_id": "t3_mcdk02", "parent_id": "t1_gs3makk", "score": "2", "subreddit": "Refold", "subreddit_id": "t5_3azein"}, {"author": "Creative_Shallot_860", "body": "Do you want to do the work now or later? At some point you'll have to look up the words, so it's up to you whether you want to get it out of the way now or push it off til later.\n\nYou are still in the early stages of learning - get off the advanced content. Focus on Easy Russian or Russian with Max YouTube channels and learn the basics well.\n\nIf you have a question about whether you need to know a word or not, consult this: https://docs.google.com/spreadsheets/d/1hSsPR0fN7I456-TZOUFJwOb7GjSrqeoOo02hMCy9NfI/edit#gid=7\n\nIf it's not on the list, discard it, you don't need it.\n\nTurn on a video with subs, set a timer for 15-20 minutes, and compile as much as you can get through comfortably in that time - whether it's 5 or 50 words, it doesn't matter, just focus on understanding it and learning what you don't know, as long as it's on that list (which everything from those two channels should be on that list).", "created_utc": "1616622366.0", "edited": "False", "id": "gs3ll9g", "is_submitter": "False", "link_id": "t3_mcdk02", "parent_id": "t3_mcdk02", "score": "3", "subreddit": "Refold", "subreddit_id": "t5_3azein"}, {"author": "Creative_Shallot_860", "body": "They advertisements like what you would find either in the Metro or walking down the street. I used to spend hours a day riding the Moscow Metro - those ads helped me acquire so much grammar and vocabulary. If you don't know what they say, learn them, you'll be shocked how much you will pick up.", "created_utc": "1616605903.0", "edited": "False", "id": "gs2iqx2", "is_submitter": "False", "link_id": "t3_mbpiad", "parent_id": "t1_gs2ifn4", "score": "3", "subreddit": "Refold", "subreddit_id": "t5_3azein"}, {"author": "Creative_Shallot_860", "body": "[рекламы скидок](https://yandex.ru/images/search?text=%D1%80%D0%B5%D0%BA%D0%BB%D0%B0%D0%BC%D1%8B%20%D1%81%D0%BA%D0%B8%D0%B4%D0%BE%D0%BA)\n\n[рекламы работы](https://yandex.ru/images/search?text=%D1%80%D0%B5%D0%BA%D0%BB%D0%B0%D0%BC%D1%8B%20%D1%80%D0%B0%D0%B1%D0%BE%D1%82%D1%8B)\n\n[рекламы сервисов](https://yandex.ru/images/search?text=%D1%80%D0%B5%D0%BA%D0%BB%D0%B0%D0%BC%D1%8B%20%D1%81%D0%B5%D1%80%D0%B2%D0%B8%D1%81%D0%BE%D0%B2)\n\n[рекламы сервисов на метро](https://yandex.ru/images/search?text=%D1%80%D0%B5%D0%BA%D0%BB%D0%B0%D0%BC%D1%8B%20%D1%81%D0%B5%D1%80%D0%B2%D0%B8%D1%81%D0%BE%D0%B2%20%D0%BD%D0%B0%20%D0%BC%D0%B5%D1%82%D1%80%D0%BE)\n\nhttps://drawnstories.ru/comics\n\n[Easy Russian](https://www.youtube.com/channel/UCxvt-g7JsPNnEn8tUtZZBBg)\n\n[Russian with Max](https://www.youtube.com/channel/UCklUqFEcJqFnWKEBozw5p4g)\n\n[RussianPod101](https://www.youtube.com/user/russianpod101)\n\n[33 Poems for schoolchildren to help learn grammar and vocab](https://mamamozhetvse.ru/stixi-pro-shkolu-dlya-nachalnyx-klassov-33-luchshix.html)", "created_utc": "1616605564.0", "edited": "False", "id": "gs2hy1q", "is_submitter": "False", "link_id": "t3_mbpiad", "parent_id": "t1_gs2fdot", "score": "3", "subreddit": "Refold", "subreddit_id": "t5_3azein"}, {"author": "Creative_Shallot_860", "body": "Can you send over some examples?", "created_utc": "1616602108.0", "edited": "False", "id": "gs29o0y", "is_submitter": "False", "link_id": "t3_mbpiad", "parent_id": "t1_gs28pcg", "score": "3", "subreddit": "Refold", "subreddit_id": "t5_3azein"}, {"author": "Creative_Shallot_860", "body": "What are you interested in? Go search for that on Google (or Yandex...). One of the things about finding appropriate content is that you need to use what you know to hunt for it and track it down. If you can't do that yet, you'll need to stick with something like RussianPod101 until you get to that point.\n\nMaybe I could help point you in a direction, but 1) I know nothing about you and 2) if you're an absolute beginner, you probably have a good bit left to learn before jumping into true native-level content. \n\nIn my comment above I gave you some things to think about and investigate, so think about them some and investigate them. There's no good way around learning that stuff, you just have to do it. There are reasons why Russian schoolchildren focus so much of their time growing up on grammar and proper usage - to understand and use the language correctly, you really do need to know those things.", "created_utc": "1616601577.0", "edited": "False", "id": "gs28f01", "is_submitter": "False", "link_id": "t3_mbpiad", "parent_id": "t1_gs25cmr", "score": "3", "subreddit": "Refold", "subreddit_id": "t5_3azein"}, {"author": "Creative_Shallot_860", "body": "If you're a beginner, I think you should focus on much smaller texts in order to better familiarize yourself with the differences between proper Russian, spoken Russian, and literary Russian. Harry Potter falls into the latter category, although in a somewhat simplified manner.\n\nHow familiar are you with the cases and their various uses? What about verb aspect pairs and verb/preposition pairs? Verbs of motion? I know and understand that reading is what is going to help you learn those kinds of things, but having read Harry Potter (and some other books) in Russian myself, I can tell you that it's going to be a nasty slog to get through.\n\nPerhaps more importantly, how familiar are you with verbal adjectives and verbal adverbs (видове причастия / деепричастия)? If you don't have this down, focus on reading the news and understanding how these work, because it's very different from spoken language and they are EVERYWHERE in literary/written-medium Russian.\n\nReading the news, and especially opinion columns, will really help in solidifying a lot of these concepts in bitesized chunks, but you'll still miss out on some literary vocab, but that comes fairly quickly while reading the novel. \n\nAnother idea is to look for elementary school poems - Russian teachers over the decades have developed all kinds of poems meant to teach Russian children various vocab + grammar aspects through little poems. You may not be interested in them, but they are exceedingly useful and will help solidify grammar fundamentals unlike any other resource.\n\nRussian teachers LOVE to say, \"In most languages, words and grammar are connected but separate. In Russian, words and grammar are the same thing.\" I don't know how long you've been studying, how many words you know or how well you know your grammar, so you can tackle Harry Potter if that's what you want to do, but as someone with firsthand experience in every point I've mentioned here, my suggestion is to take it slow and make sure you understand the manner in which words can function, especially in a formal written context, so that you don't have to learn every single thing all at once, but can focus on what matters most in any given sentence.", "created_utc": "1616598548.0", "edited": "False", "id": "gs214hc", "is_submitter": "False", "link_id": "t3_mbpiad", "parent_id": "t3_mbpiad", "score": "4", "subreddit": "Refold", "subreddit_id": "t5_3azein"}, {"author": "Creative_Shallot_860", "body": "It creates two cards - the first is a regular card, and then the next day it shows a flipped version.", "created_utc": "1613784687.0", "edited": "False", "id": "go2mg0y", "is_submitter": "True", "link_id": "t3_lnghnf", "parent_id": "t1_go2jxoi", "score": "1", "subreddit": "Refold", "subreddit_id": "t5_3azein"}, {"author": "Creative_Shallot_860", "body": "I did 4 years of Russian in university classes and lived in Moscow for several years, where I watched A LOT of tv. When I lived there, I still took traditional classes and was immersed (obviously), alongside also studying in a university there for a couple of years (the main courses were in English, but there were Russian classes every day, and most interactions around the uni had to be in Russian). Ultimately married a Russian. I don't live there anymore, but I still watch a lot of news and other content I can find on YouTube, and I talk to my wife, mother-in-law, and friends/acquaintances fairly often.\n\nWhen I look back at some of my classes in Moscow, Anki was still somewhat new, so a lot of the \"best practices\" you see around the internet today didn't really exist at the time, so I spent a lot of time just doing basic cards without much context, and trying to cram in very word I came across. It was terrible and only got me so far. One thing that really helped was playing Magic: The Gathering with Russian cards - that taught me a lot of \"legalese\".\n\nEdit: Should probably note that I've been studying Russian for 16 years.", "created_utc": "1613758045.0", "edited": "1613758402.0", "id": "go14iuc", "is_submitter": "True", "link_id": "t3_lnghnf", "parent_id": "t1_go134fv", "score": "8", "subreddit": "Refold", "subreddit_id": "t5_3azein"}, {"author": "Creative_Shallot_860", "body": "That's a good idea. I've also thought about exporting Memrise out to a CSV in order to create filters and other controls for fine tuning the imports into Anki. Sounds like a fun weekend project. Thank you!", "created_utc": "1613753409.0", "edited": "False", "id": "go0u2cu", "is_submitter": "True", "link_id": "t3_lnghnf", "parent_id": "t1_go0svgy", "score": "6", "subreddit": "Refold", "subreddit_id": "t5_3azein"}, {"author": "Creative_Shallot_860", "body": "For Russian, I always do this:\n\nInfinitive pair + preposition (if needed) + question word\n\nНапример:\n\nрешаться/решиться что/кого\n\nостанавливать/остановить на чём/кём\n\nизвлекать что/кого из|с кого/чего \n\nRussian is very serious about each of these points - any state-administered language test will specifically ask about each of these three points on different parts of the test. Some verbs change meaning with different prepositions and cases (as well as reflexive endings), so it's always important to keep them all clearly defined.", "created_utc": "1613749157.0", "edited": "False", "id": "go0kfjs", "is_submitter": "False", "link_id": "t3_llx2gi", "parent_id": "t3_llx2gi", "score": "2", "subreddit": "Refold", "subreddit_id": "t5_3azein"}, {"author": "Creative_Shallot_860", "body": "Awesome, thank you.", "created_utc": "1610630726.0", "edited": "False", "id": "gj83yxw", "is_submitter": "True", "link_id": "t3_kw4mqf", "parent_id": "t1_gj3myzy", "score": "2", "subreddit": "GREEK", "subreddit_id": "t5_2qpo8"}, {"author": "Creative_Shallot_860", "body": "Awesome, thank you.", "created_utc": "1610630717.0", "edited": "False", "id": "gj83yfh", "is_submitter": "True", "link_id": "t3_kw4mqf", "parent_id": "t1_gj3h7v6", "score": "1", "subreddit": "GREEK", "subreddit_id": "t5_2qpo8"}, {"author": "Creative_Shallot_860", "body": "Thank you for this. I already do this to an extent as part of a larger rotating set of conditioning exercises on my 2x/week conditioning days (I guess my brain classifies this as \"conditioning\" rather than \"running\"). I can increase focus on it in order to train it more often.\n\nLet me rephrase my question a bit - what methods can I implement during the endurance sessions to help address the average pace of the session?\n\nThe ultimate goal is to get from ~10:30/mile to ~8/mile (a long way off, sure, but goals), so I want to address the speed/pace issues from several different angles in as synergistic a manner as possible.", "created_utc": "1605967470.0", "edited": "False", "id": "gd25z2q", "is_submitter": "False", "link_id": "t3_jy0r1u", "parent_id": "t1_gd211c0", "score": "1", "subreddit": "running", "subreddit_id": "t5_2qlit"}, {"author": "Creative_Shallot_860", "body": "That's interesting. Now that I think about it I can find examples. I feel like can also apply to /k/ or even sometimes on a word final /g/.\n\nThank you.", "created_utc": "1603982934.0", "edited": "False", "id": "gahts02", "is_submitter": "False", "link_id": "t3_jdx5ci", "parent_id": "t1_gahoaez", "score": "2", "subreddit": "conlangs", "subreddit_id": "t5_2red7"}, {"author": "Creative_Shallot_860", "body": "Awesome, thank you!", "created_utc": "1603980151.0", "edited": "False", "id": "gahoab3", "is_submitter": "False", "link_id": "t3_jdx5ci", "parent_id": "t1_gahjtok", "score": "1", "subreddit": "conlangs", "subreddit_id": "t5_2red7"}, {"author": "Creative_Shallot_860", "body": "What is the name/IPA transcription of reduced word-final stops that don't fully reduce to glottal stops? For instance, in SE American English (the standard mid-eastern GA/western SC/southern NC Southern US accent), speakers often reduce final stops - both voiced and unvoiced - to a point where they aren't really articulated, but are still articulated to the point where speakers understand which sound is occurring.\n\nFor example, the word \"stop\" ends with a /p/, but that /p/ is merely a implosive pursing of the lips with a little bit of voice and does not include a separate explosion. However, in \"stops\", that explosion occurs since /s/ follows /p/. Of course, some speakers *do* articulate that explosion, but in standard SE accents, it's not common (and this does occur across other English accents, but I'm most familiar with the inner workings of the SE American version).", "created_utc": "1603976411.0", "edited": "False", "id": "gahhmt4", "is_submitter": "False", "link_id": "t3_jdx5ci", "parent_id": "t3_jdx5ci", "score": "2", "subreddit": "conlangs", "subreddit_id": "t5_2red7"}]