[{"author": "CriticalLifeguard804", "body": "I used to have the same problem.  Now I just feel like I look bad in both.  The only time I look ok I think is when I facetime/camera selfie-mode without taking the picture.", "created_utc": "1665443333.0", "edited": "False", "id": "irtmds7", "is_submitter": "False", "link_id": "t3_y0rhzn", "parent_id": "t3_y0rhzn", "score": "3", "subreddit": "CasualConversation", "subreddit_id": "t5_323oy"}, {"author": "CriticalLifeguard804", "body": "Yes, you're right.  I should've added non-European options.  It's just that a lot of the most spoken/popular and geographically widespread languages are European ones.  I wanted the options to be ones that I'm pretty sure everyone here has heard before and too many options would be overwhelming.", "created_utc": "1665429053.0", "edited": "False", "id": "irsp1bs", "is_submitter": "True", "link_id": "t3_y0ljfh", "parent_id": "t1_irsip15", "score": "4", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "CriticalLifeguard804", "body": "A little off topic but you have a good amount of followers though.  I'll never get that many followers.", "created_utc": "1665096625.0", "edited": "False", "id": "irc9okj", "is_submitter": "False", "link_id": "t3_xv6ykw", "parent_id": "t3_xv6ykw", "score": "1", "subreddit": "ugly", "subreddit_id": "t5_2qvoo"}, {"author": "CriticalLifeguard804", "body": "I feel that in terms of speaking, native speakers are automatically C2 or higher at a young age.  Native speakers have strong grasp of things like slangs, nuances, when to use filler words, cultural references that many non-natives who test at the C2 level don't have.  A native speaker can usually tell if someone is non-native (unless they started a language during the critical learning period).  In terms of reading and writing, I do agree that some learners are better prepared than natives because there are some native speakers who are not very educated.  However, I feel that the reading and writing level of highly educated native speakers that did all of their education in their native language would be higher than C2.  For example, students in China would spend high school years learning classical Chinese texts/poems written thousands of years ago.  A C2 exam in Chinese would definitely not test something that difficult.  A highly educated native English speaker would've read many Shakespeare plays in high school.  A C2 test in English would not prove that you can read at that level.  So basically what I'm saying is that I don't disagree there are learners who have a finer command of the language than natives but the proportion of native speakers who are not at a C2 or higher level is much smaller than what some people think (unless we're talking about a country with high illiteracy rates).", "created_utc": "1663060148.0", "edited": "False", "id": "io8h6o3", "is_submitter": "False", "link_id": "t3_xcfxqr", "parent_id": "t1_io765wh", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "CriticalLifeguard804", "body": "The number of times I've had to debate people who tell me that \"There are native speakers who are not at a C2 level\" is truly annoying.  So basically, you're telling me that in 2 years you've reached a self-evaluated level of B2 and you're only 1 level below some native speakers who have spent their entire lives speaking the language?", "created_utc": "1663018446.0", "edited": "False", "id": "io6bvjg", "is_submitter": "False", "link_id": "t3_xcfxqr", "parent_id": "t3_xcfxqr", "score": "4", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "CriticalLifeguard804", "body": "A young Richard Gasquet", "created_utc": "1661284038.0", "edited": "False", "id": "ilhyfeg", "is_submitter": "False", "link_id": "t3_wvxbod", "parent_id": "t3_wvxbod", "score": "1", "subreddit": "tennis", "subreddit_id": "t5_2qiq1"}, {"author": "CriticalLifeguard804", "body": "\"I can't do that to a friend, or even you\"", "created_utc": "1660469659.0", "edited": "False", "id": "ik8h61h", "is_submitter": "False", "link_id": "t3_wnxhcm", "parent_id": "t3_wnxhcm", "score": "1", "subreddit": "victorious", "subreddit_id": "t5_2tt68"}, {"author": "CriticalLifeguard804", "body": "What I've noticed is that quite often, French people are judgmental of other French people speaking French.  I have never heard an American say other Americans are bad at English but I've constantly heard French people complain that other French native speakers are \"bad\" at French...", "created_utc": "1659608669.0", "edited": "False", "id": "iiwcriq", "is_submitter": "False", "link_id": "t3_wfgtse", "parent_id": "t3_wfgtse", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "CriticalLifeguard804", "body": "Je vais repondre en anglais parce-que mon français n'est pas assez bien.\n\nFirst of all, I don't think using the term \"race\", or talking about race makes someone racist.  I have the impression that French people say they don't see race and not talk about it while assuming the problem is bigger in the US because Americans talk about it a lot, so it gives the impression that the problem is bigger there when in reality it might not be the case.  Second of all, in the United States, sticking with only ethnicity is too complicated because it's a country of immigrants and therefore being American is not an ethnicity.  If you asked an American his/her ethnicity, that person might respond with something like 40% German, 20% Dutch...etc.  Most Americans are a mixture of many ethnicities unlike in France where a good amount of people can just say they're ethnically French.  Therefore, race is more of a generalization for simplicity.", "created_utc": "1658063626.0", "edited": "False", "id": "igiiwk2", "is_submitter": "False", "link_id": "t3_w14zdx", "parent_id": "t3_w14zdx", "score": "1", "subreddit": "france", "subreddit_id": "t5_2qhjz"}, {"author": "CriticalLifeguard804", "body": "Bon courage!  Je suis en train d'apprendre le français et je peux pas imaginer étudier la philosophie en français.", "created_utc": "1654896238.0", "edited": "False", "id": "ibwj8kn", "is_submitter": "False", "link_id": "t3_v8pomf", "parent_id": "t3_v8pomf", "score": "1", "subreddit": "CasualConversation", "subreddit_id": "t5_323oy"}, {"author": "CriticalLifeguard804", "body": "I can't believe there are actually parents who do this.  It's like they completely don't give a s\\*\\*\\* about their kids.  I'm really lucky that my parents paid for my undergraduate degree and now is supporting me through grad school.  I didn't know this whole cutting your kids off at 18 is so common here in the US.  I read about it online but I don't know anyone personally who have been treated like that by their parents.", "created_utc": "1654885799.0", "edited": "False", "id": "ibvvy17", "is_submitter": "False", "link_id": "t3_v91423", "parent_id": "t3_v91423", "score": "1", "subreddit": "childfree", "subreddit_id": "t5_2qtwb"}, {"author": "CriticalLifeguard804", "body": "我现在在学法语有一样的问题。每次有两三个人一起说话就听不懂了。我试着经常看一些新闻里的辩论节目因为经常有人抢着说话。当然你看电视的时候没机会自己回复，但也许是练听力的好方法。", "created_utc": "1654628557.0", "edited": "False", "id": "ibiqqm3", "is_submitter": "False", "link_id": "t3_v6c80i", "parent_id": "t3_v6c80i", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "CriticalLifeguard804", "body": "Thank you, that was very helpful!", "created_utc": "1654603179.0", "edited": "False", "id": "ibh7saj", "is_submitter": "False", "link_id": "t3_v62l5l", "parent_id": "t1_ibgdxo1", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "CriticalLifeguard804", "body": "Thanks for your response.  I'm learning French and just passed the DELF B1 exam.  I've been doubting the CEFR scale lately because I've always considered C2 as the level where you could be mistaken for a native speaker.  By that standard, I've been thinking it's not possible my French is B1-B2 because I'm so far away from \"nativelikeness\".  Your description makes a lot of sense.  On a side note though, does the fact that you may never sound like a native speaker in your target language discourage you from learning it?  For me, sometimes it's discouraging to think that my French will most likely never sound like a native speaker and every time I speak it, even at a high level, I will likely have a bit of an accent and probably make some mistakes.", "created_utc": "1654553579.0", "edited": "False", "id": "ibf3e3y", "is_submitter": "False", "link_id": "t3_v62l5l", "parent_id": "t1_ibelpdw", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "CriticalLifeguard804", "body": "Thank you, with these descriptions, it's a lot easier to understand what a B2 speaker is capable of doing.", "created_utc": "1654552167.0", "edited": "False", "id": "ibf0dfn", "is_submitter": "False", "link_id": "t3_v62l5l", "parent_id": "t1_ibe6wki", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "CriticalLifeguard804", "body": "Can you explain a little regarding B2 being considered \"fluent\" because I see this sometimes and I don't really understand it because for me fluent is when you sound like a native speaker or at least very close to it.  I feel a B2 speaker is far from that level.", "created_utc": "1654532274.0", "edited": "False", "id": "ibdqhzf", "is_submitter": "False", "link_id": "t3_v62l5l", "parent_id": "t1_ibdeqia", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "CriticalLifeguard804", "body": "Angèle - Bruxelles je t’aime", "created_utc": "1650739932.0", "edited": "False", "id": "i5wq805", "is_submitter": "False", "link_id": "t3_u9xssh", "parent_id": "t3_u9xssh", "score": "1", "subreddit": "French", "subreddit_id": "t5_2rd5t"}]