[{"author": "CrossHeather", "body": "Flawed though it may have been but aren’t semi consonants extremely rare in Italian though? Words being with i plus another vowel, and words beginning with y (which an English speaking person would recognise as a consonant anyway)?\n\nI’ll be completely honest, until just now I would have written lo iodio as l’iodio before tonight. But I can’t see how IPA would have avoided that? And to be honest even if it had I can’t see how spending the time learning it would have avoided it?", "created_utc": "1666905230.0", "edited": "False", "id": "iu1hl2m", "is_submitter": "False", "link_id": "t3_ydzq8p", "parent_id": "t1_iu1f2eu", "score": "1", "subreddit": "italianlearning", "subreddit_id": "t5_2tuxf"}, {"author": "CrossHeather", "body": "Surely you can realise that nobody has told OP that uovo starts with a consonant (or ever would, because it clearly doesn’t)?\n\nOnly IPA has given that impression.\n\nWhere else would the concept of a w here come from?\n\nAnything else you say falls apart at that fact, because you’re trying to write it off as a coincidence. But it isn’t a coincidence, it’s a flaw of IPA. \n\nIf you want to talk about the good things of IPA and make some valid points about why OP should spend valuable learning Italian learning time on learning it then do that, but at least don’t lie. And acknowledge its flaws rather than pretending they don’t exist.", "created_utc": "1666904026.0", "edited": "False", "id": "iu1ekp4", "is_submitter": "False", "link_id": "t3_ydzq8p", "parent_id": "t1_iu1c9st", "score": "1", "subreddit": "italianlearning", "subreddit_id": "t5_2tuxf"}, {"author": "CrossHeather", "body": "Just because you keep screaming coincidence doesn’t mean the confusion caused by the w introduced by IPA is a coincidence 😂\n\nGo on then, let me fall into a trap. Isn’t the l’ because of the ‘u’ being a vowel such as as in words like ufficio and urbanizzazione?", "created_utc": "1666902361.0", "edited": "False", "id": "iu1a8mc", "is_submitter": "False", "link_id": "t3_ydzq8p", "parent_id": "t1_iu19lp5", "score": "1", "subreddit": "italianlearning", "subreddit_id": "t5_2tuxf"}, {"author": "CrossHeather", "body": "It doesn’t help at all. It’s made the OP think l’ is possibly wrong….", "created_utc": "1666901869.0", "edited": "False", "id": "iu18xff", "is_submitter": "False", "link_id": "t3_ydzq8p", "parent_id": "t1_iu18bs0", "score": "1", "subreddit": "italianlearning", "subreddit_id": "t5_2tuxf"}, {"author": "CrossHeather", "body": "It isn’t coincidental at all. It’s a problem inherent in the use of IPA…\n\nOnly IPA would make an English speaker think uomo won’t work as l’uomo. U is a vowel right? ‘W’ shouldn’t be in anyone’s consideration for this word, but it is because of IPA, and IPA alone.", "created_utc": "1666900725.0", "edited": "False", "id": "iu15y16", "is_submitter": "False", "link_id": "t3_ydzq8p", "parent_id": "t1_iu13dzm", "score": "1", "subreddit": "italianlearning", "subreddit_id": "t5_2tuxf"}, {"author": "CrossHeather", "body": "Do you know what coincidental means? It is the exact opposite of the situation we are talking about. There’s no coincidence at all between the OP thinking w was important and the use of IPA, it’s the exact cause!", "created_utc": "1666899506.0", "edited": "False", "id": "iu12r2q", "is_submitter": "False", "link_id": "t3_ydzq8p", "parent_id": "t1_iu1225s", "score": "1", "subreddit": "italianlearning", "subreddit_id": "t5_2tuxf"}, {"author": "CrossHeather", "body": "Right ok. The point is IPA was used in plenty of language learning materials, because it was more accurate than using some horrendous ‘localised’ spelling for learners ‘Ciao = Hello (chow)’ for example. Hell, the OP is even trying to learn to pronounce uova with it in 2022 despite saying they aren’t a linguist.\n\nIt’s completely outdated in the context of this post. I’ve listed tools that are infinitely better for learning Italian pronunciation. Again, the OP was trying to use IPA instead of these tools. \n\nWhy do you feel the need to defend the use of IPA in all these contexts the OP or I weren’t talking about? 😂\n\nEdit: in fact I’d even go as far as to say IPA is harmful for the majority of language learners as it’s adding layers of complexity that aren’t needed in this day and age. It’s even made the OP think the use of l’uovo is wrong because the consonant w is being used in IPA. You could almost say the method was outdated….", "created_utc": "1666895782.0", "edited": "1666896115.0", "id": "iu0t8v1", "is_submitter": "False", "link_id": "t3_ydzq8p", "parent_id": "t1_iu0pj30", "score": "1", "subreddit": "italianlearning", "subreddit_id": "t5_2tuxf"}, {"author": "CrossHeather", "body": "The quote from Krashen ‘We can only acquire a language, we cannot learn it’", "created_utc": "1666894658.0", "edited": "False", "id": "iu0qbn0", "is_submitter": "False", "link_id": "t3_yendj0", "parent_id": "t3_yendj0", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "CrossHeather", "body": "It’s outdated when we are talking about what would be useful for the vast majority of language learners (who this sub Reddit is for)\n\nIf you’ve taken a course that requires you to write dissertations on phonology, and insert hieroglyphic symbols where sound files could be attached then I guess it isn’t outdated. (Apologies to the billions of people this applies to)", "created_utc": "1666892476.0", "edited": "False", "id": "iu0kns4", "is_submitter": "False", "link_id": "t3_ydzq8p", "parent_id": "t1_ityl1ug", "score": "1", "subreddit": "italianlearning", "subreddit_id": "t5_2tuxf"}, {"author": "CrossHeather", "body": "To be honest, unless you’ve got a deep burning desire to learn IPA I wouldn’t bother. It’s completely outdated now you can look up any word’s pronunciation on the internet. \n\nJust look up the word on Forvo, Youglish or even Google and actually hear it’s pronounciation instead of learning something created to try and provide an imaginary sound in the mind of people pre internet for every single sound in every single language.", "created_utc": "1666809667.0", "edited": "False", "id": "itw0gab", "is_submitter": "False", "link_id": "t3_ydzq8p", "parent_id": "t3_ydzq8p", "score": "1", "subreddit": "italianlearning", "subreddit_id": "t5_2tuxf"}, {"author": "CrossHeather", "body": "Yeah it seems that Amazon have really stepped up their game in terms of making foreign language audiobooks available (in the UK for Italian language at least)\n\nNow I’m at the point where I can understand most things I’m weaning off them (as I never really like fiction audiobooks in English), but there’s a lot to be said for listening to something you’ve already read to help get started with listening.", "created_utc": "1665087822.0", "edited": "False", "id": "irbqk6e", "is_submitter": "False", "link_id": "t3_xx0ude", "parent_id": "t1_ir9k49j", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "CrossHeather", "body": "Reverso is awesome. Until I found a decent Anki deck I used to go on and select a verb at random every day to test myself on its conjugation.", "created_utc": "1665083024.0", "edited": "False", "id": "irbf39n", "is_submitter": "False", "link_id": "t3_xwznf6", "parent_id": "t1_ira6lf0", "score": "2", "subreddit": "italianlearning", "subreddit_id": "t5_2tuxf"}, {"author": "CrossHeather", "body": " This definitely helped me to stop mixing up vedere and venire when I was starting out.", "created_utc": "1665082939.0", "edited": "False", "id": "irbew1z", "is_submitter": "False", "link_id": "t3_xwznf6", "parent_id": "t3_xwznf6", "score": "2", "subreddit": "italianlearning", "subreddit_id": "t5_2tuxf"}, {"author": "CrossHeather", "body": "Commenting here because Italian is my TL too. I can relate for sure, my jokes always miss in Italian (mind you they aren’t exactly home runs in English…)\n\nWith the swear words thing. I can’t get over the fact that cabbage is a swear word. It gives me great joy to exclaim it every chance I get. (Although I’m from the north of England so I swear every other word in my native language also)\n\nFinally, I’m a bit of a maths nerd myself. But in Italian I see a number written down like millenovecentocinquantasette and I just can’t help but laugh. (Although I think that’s the fall out of a work joke about something else many moons ago)", "created_utc": "1665082779.0", "edited": "False", "id": "irbei5x", "is_submitter": "False", "link_id": "t3_xx0dcc", "parent_id": "t1_ir9mj22", "score": "4", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "CrossHeather", "body": "For me, they’re worth watching when you start out and need some ideas on how to actually go about learning a language. I wouldn’t have believed extensive reading was a good method (or even possible) without them all interviewing Krashen or selling tools for it directly as in the cases of SK or OR. I think we underestimate the general public’s intelligence, I honestly think 90% of us can take things with a pinch of salt and not buy into the ‘I learnt Italian in a week!’ (After studying the grammar on and off for 18 months and having a bit of broken Italian - I kid you not this video exists 😂)\n\nHowever, once you’ve decided on a path of study that works for you it’s hard to imagine what real value you’re going to get from them other than the rare watch. I watched the odd 6/12/18 month of immersion type videos by mostly unknown channels (normally just people uploading literally these videos) to give myself motivation that I was following the right path.", "created_utc": "1665040646.0", "edited": "False", "id": "ir95n3j", "is_submitter": "False", "link_id": "t3_xwi0vp", "parent_id": "t3_xwi0vp", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "CrossHeather", "body": "It needs some praise this answer. Some great explanations.", "created_utc": "1664991828.0", "edited": "False", "id": "ir6do1a", "is_submitter": "False", "link_id": "t3_xw6kda", "parent_id": "t1_ir4yans", "score": "2", "subreddit": "learnitalian", "subreddit_id": "t5_2tjay"}, {"author": "CrossHeather", "body": "This is the way.", "created_utc": "1664556830.0", "edited": "False", "id": "iqiq0h7", "is_submitter": "False", "link_id": "t3_xrz4tt", "parent_id": "t1_iqhrni7", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "CrossHeather", "body": "Time to get downvoted to hell, but it was true for me…. \n\nFor me the main problem is it’s hard to believe that acquiring the language through immersion is a better use of time than actively studying it, at least once you know a reasonable amount of the most common words. Until you make that mental switch it seems impossible to understand the wall of noise coming your way when you use one of the phrases you’ve memorised. As such you get dejected and give up, because you think ‘I can’t learn a language, I just don’t have the natural ability for it’. But the problem isn’t you, it’s the methods you’re using (apps, text books, audio courses etc). And sadly these are the methods that are advertised because it’s pretty hard to make money by telling people they should read and listen a lot to the language they want to be able to read and listen to.", "created_utc": "1664556466.0", "edited": "False", "id": "iqip3ap", "is_submitter": "False", "link_id": "t3_xrl2yl", "parent_id": "t3_xrl2yl", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "CrossHeather", "body": "I actually found this really useful when my listening got past a certain point and the problem I was then having was trying to stop my mind wandering.\n\nI could never figure out how people did shadowing out loud (the type where you speak at the same time you are hearing things), but for some reason I am able to do it in my head. Maybe it’s psychological but it’s definitely a good tool for me, if only because it helps me to stay attentive.", "created_utc": "1664106652.0", "edited": "False", "id": "iptv4ks", "is_submitter": "False", "link_id": "t3_xni3zt", "parent_id": "t3_xni3zt", "score": "4", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "CrossHeather", "body": "For me it’s classic Pareto principle. The 20% that gives you 80% of the rewards is doing as much exposure as possible, and the % you understand is fine tuning.\n\nThat being said, I think burning through stuff aimed at beginners is a good way to build a foundation. But when you’re bored just move on. It’s surely infinitely better to watch a 2 hour film than have a night off because you can’t stomach the thought of a beginner video.", "created_utc": "1664093566.0", "edited": "False", "id": "ipter6o", "is_submitter": "False", "link_id": "t3_xnedbk", "parent_id": "t3_xnedbk", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "CrossHeather", "body": "I think it’s important a couple of examples are given to make the whole ‘direct object pronoun’ a bit more clear.\n\nI listened to her yesterday = L'ho ascoltatA ieri\n\nI listened to Anna yesterday = Ieri ho ascoltatO Anna\n\nIt seems that the ‘a’ is only really important when nothing else in the sentence clarifies the object is feminine, but I’m sure somebody will be able to hit me with a counter example (like every  grammar rule ever)", "created_utc": "1664092171.0", "edited": "False", "id": "iptd2yl", "is_submitter": "False", "link_id": "t3_xn1er9", "parent_id": "t3_xn1er9", "score": "1", "subreddit": "italianlearning", "subreddit_id": "t5_2tuxf"}, {"author": "CrossHeather", "body": "As a non American I get to drop my child off to school without the fear of some mad lad turning up with an assault rifle even crossing my mind. If such a crazy thing was to happen for the first ever time in the country’s history and my child got injured I could also at least rely on free healthcare during what would likely be the most difficult time of our lives.\n\nBut you have to ask, is that really worth not having the FREEDOM!!!! to force him to pose for photos with an assault rifle any time I want?", "created_utc": "1662290578.0", "edited": "False", "id": "in1iit3", "is_submitter": "False", "link_id": "t3_x5bgqs", "parent_id": "t3_x5bgqs", "score": "2", "subreddit": "WhitePeopleTwitter", "subreddit_id": "t5_35n7t"}, {"author": "CrossHeather", "body": "Recommendations of the percentage of words you ‘should’ know before reading a book are generally way to high.\n\nThe examples people show, which are meant to indicate ‘only’ 90% is a stress inducing nightmare, actually aren’t that bad at all. Especially when we live in a world where words can be looked up with no real difficulty.\n\nThe benefit of enjoying reading something well written and entertaining far outweighs any theoretical benefit of reading at a 98% comprehension, or whatever figure is plucked from the sky by people who just happen to be involved in the publishing of graded readers.\n\nSure, read a couple as way into reading in your target language, but take any recommendation to read more than that with a massive pinch of salt.", "created_utc": "1661436031.0", "edited": "False", "id": "ilqg4ov", "is_submitter": "False", "link_id": "t3_wxbpjw", "parent_id": "t3_wxbpjw", "score": "22", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "CrossHeather", "body": "Thanks 🙂\n\nFor my first couple of months reading in Italian, I’d read a page in Italian, then pick up the English copy and then do it again for Italian. It worked very well and was very effective, but I’m not sure I’d have the willpower to do it again. This, and the OPs method, sounds like a less stressful way of doing things.", "created_utc": "1661435644.0", "edited": "False", "id": "ilqf6xo", "is_submitter": "False", "link_id": "t3_wx157v", "parent_id": "t1_ilqdmyb", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "CrossHeather", "body": "When you say split screen? Is that one half of the screen in your NL and one half in your TL?", "created_utc": "1661434763.0", "edited": "False", "id": "ilqd3pn", "is_submitter": "False", "link_id": "t3_wx157v", "parent_id": "t1_ilox5bf", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "CrossHeather", "body": "Thank you!", "created_utc": "1661076467.0", "edited": "False", "id": "il6cpf1", "is_submitter": "False", "link_id": "t3_w5q4py", "parent_id": "t1_il68dfi", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "CrossHeather", "body": "Assuming it follows fpl rules and not fantocalcio.\n\n1) Pick 2 of the most expensive players, so you can swap the captaincy between them. Having one forward and one midfielder should give you quite a flexible situation to make an easy transfer if one gets injured at any point.\n2) Try to find the cheapest possible players who actually play to go on your bench. It’s more important that they are cheap than they play, but at least one or two playing will bail you out some weeks.\n3) Look for attacking full backs from the best teams, attacking midfielders and strikers to fill out the majority of the remainder of your budget. The more expensive full backs are generally the best value players in these role sets because they can get clean sheet and attacking points.", "created_utc": "1660335896.0", "edited": "False", "id": "ik1inzn", "is_submitter": "False", "link_id": "t3_wmua0h", "parent_id": "t3_wmua0h", "score": "2", "subreddit": "seriea", "subreddit_id": "t5_2rzix"}, {"author": "CrossHeather", "body": "Not bizarre at all, this is great concise advice.", "created_utc": "1660237902.0", "edited": "False", "id": "ijvpu73", "is_submitter": "False", "link_id": "t3_wlmtra", "parent_id": "t1_ijvm8np", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "CrossHeather", "body": "E non sarai triste\n\n![gif](giphy|m0MpSBdFPMCdT5wB0v)", "created_utc": "1659870967.0", "edited": "False", "id": "ijar3im", "is_submitter": "False", "link_id": "t3_wibsz5", "parent_id": "t3_wibsz5", "score": "0", "subreddit": "Italia", "subreddit_id": "t5_2rbm5"}, {"author": "CrossHeather", "body": "Grazie!", "created_utc": "1659457709.0", "edited": "False", "id": "iintqw5", "is_submitter": "True", "link_id": "t3_wdp9f8", "parent_id": "t1_iinp6pr", "score": "1", "subreddit": "WriteStreakIT", "subreddit_id": "t5_2gcnah"}, {"author": "CrossHeather", "body": "Now, point 2 is a low blow though you know? Surely all can plough through the words we wrote down without a frown, even if they are a little rough!", "created_utc": "1659434839.0", "edited": "False", "id": "iimhze3", "is_submitter": "False", "link_id": "t3_we5pet", "parent_id": "t3_we5pet", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "CrossHeather", "body": "Grazie!", "created_utc": "1659392307.0", "edited": "False", "id": "iikew1s", "is_submitter": "True", "link_id": "t3_wchnt3", "parent_id": "t1_iiken3g", "score": "2", "subreddit": "WriteStreakIT", "subreddit_id": "t5_2gcnah"}, {"author": "CrossHeather", "body": "Seconded. I read 4 of his and was then able to move onto YA like Harry Potter and Hunger Games.", "created_utc": "1659307369.0", "edited": "False", "id": "iifsuj4", "is_submitter": "False", "link_id": "t3_wcv9ev", "parent_id": "t1_iifb9bb", "score": "1", "subreddit": "italianlearning", "subreddit_id": "t5_2tuxf"}, {"author": "CrossHeather", "body": "Hi, just wanted to say thanks for the 20 books in 6 months post. I found it back in January/February when I was wavering over extensive reading. It was definitely a good motivator to carry on, and I can’t believe how effective’s it been.", "created_utc": "1659289397.0", "edited": "False", "id": "iien6fd", "is_submitter": "False", "link_id": "t3_wcqcgc", "parent_id": "t3_wcqcgc", "score": "4", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "CrossHeather", "body": "Grazie!", "created_utc": "1659217794.0", "edited": "False", "id": "iib2u7l", "is_submitter": "True", "link_id": "t3_wbt4nl", "parent_id": "t1_iiauz0h", "score": "2", "subreddit": "WriteStreakIT", "subreddit_id": "t5_2gcnah"}, {"author": "CrossHeather", "body": "Grazie!", "created_utc": "1659020476.0", "edited": "False", "id": "ihzxwp0", "is_submitter": "True", "link_id": "t3_wa6ysq", "parent_id": "t1_ihzhfcd", "score": "2", "subreddit": "WriteStreakIT", "subreddit_id": "t5_2gcnah"}, {"author": "CrossHeather", "body": "Grazie! Questo è un grande aiuto.", "created_utc": "1658910353.0", "edited": "False", "id": "ihtstzv", "is_submitter": "True", "link_id": "t3_w97ctg", "parent_id": "t1_ihtq5ku", "score": "2", "subreddit": "WriteStreakIT", "subreddit_id": "t5_2gcnah"}, {"author": "CrossHeather", "body": "Grazie! Sì, mite sembra meglio 🙂", "created_utc": "1658847212.0", "edited": "False", "id": "ihpziow", "is_submitter": "True", "link_id": "t3_w8f5mg", "parent_id": "t1_ihpyl4w", "score": "2", "subreddit": "WriteStreakIT", "subreddit_id": "t5_2gcnah"}, {"author": "CrossHeather", "body": "No problem. I've finally stopped editing it now, so it'll finally contain pretty much everything I did.\n\nI considered myself a 'false beginner', I'd played around with Duolingo and Memrise in the past (for about 2-3 months back in 2016, and November/December 2021) so my vocab wasn't 0, but it wouldn't have been very high either. I could only conjugate verbs in the present tense. I'd listened to a Paul Noble audiobook a long time ago as well, which is similar to Language Transfer. Honestly, I'd be surprised if your level of Spanish wasn't higher than my level of Italian back in January. It'd probably have been A1 at a stretch.\n\nAs a disclaimer I had studied Spanish for about 4 months in the past, so that maybe helped too.\n\nHonestly, I'd just say go for it and buy one of his (or any other short stories for learner type) books (I think you can even get his volume 1s on Kindle Unlimited if I remember rightly which you can probably access via a free trial). You obviously love reading (the biggest plus point for me), there's enough polyglots out there preaching reading for me to believe that at least one of them isn't saying it solely to sell things, and you can always ditch the books after a month if you find it not helping and go back to your old way of studying :) Its not easy at first, but its amazing how comfortable it becomes in not a very long time.", "created_utc": "1658772705.0", "edited": "False", "id": "ihlwoqc", "is_submitter": "False", "link_id": "t3_w7ajfv", "parent_id": "t1_ihlsz16", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "CrossHeather", "body": "Grazie! La tua spiegazione è molto utile 🙂\n\nOra mi sembra che ho bisogno di imparare il uso corretto di ‘sia’ 😂", "created_utc": "1658770408.0", "edited": "False", "id": "ihlqmxe", "is_submitter": "True", "link_id": "t3_w7l2gq", "parent_id": "t1_ihlomfm", "score": "2", "subreddit": "WriteStreakIT", "subreddit_id": "t5_2gcnah"}, {"author": "CrossHeather", "body": "Thanks!\n\nCertainly.. this will be very lengthy however so the TDLR is basically the same as above (read and listen a lot 🙂), with have a weekly lesson and do a little bit of grammar/verb conjugation study as time progresses thrown in. And just keep increasing the difficulty bit by bit… it soon adds up!\n\nSo reading has been the main ‘keystone’ activity. It’d be wrong to say it was 100% the reason for my success but the % will be high. I saw a lot from people like Stephen Krashen online saying extensive reading of fiction was the best way to boost your vocabulary so that’s what I’ve been doing for the most part. Unless I say otherwise below I usually only look up words if I really want to because I think I need to know it for the benefit of understanding the story, or the word comes up a few times in a row. I find it really helps me be comfortable with not understanding every single word when listening and gets me used to understanding the gyst of what is being said.\n\nAll throughout I dabbled with Anki but have completely scrapped it now. It feels like reading a lot is more useful to me. \n\nI feel like the main benefit of immersing in native materials is the fact that - once you are comfortable with them - its hard to ever get bored. If you find something you enjoy then then motivation is never a factor. On my worst days of 'studying Italian' I'll have read a chapter of a book and listened to some Italian while walking or driving. \n\nMonth 1\n\nI started off with 2 of Ollie Richards' short stories for beginners books. They aren’t fantastic, but they do have notes on ‘how to read’ (which sounds daft, but it’s actually quite useful to get you into extensive reading) and it’s easy enough to get the audiobooks which obviously help with learning pronunciation. Essentially I would read a chapter without looking anything up, check the vocab list, then read through again looking up every word I didn’t know using a Kindle Italian to English dictionary. Just to consolidate everything, I’d read through one more time without looking anything up unless I really needed to. I also listened to the audiobook versions (I think the 1st book twice and the 2nd book once).\n\nAt the same time I decided I was going to intensively read though a non fiction book (turns out these are easier than novels after all) and ‘gold list’ every new word. I gave up on this halfway through the 2nd book I was trying this with and never came back to it! (You should be able to google 'Goldlisting' easily enough, but I don't think its worthwhile with the existence of Anki.)\n\nI watched a little bit of Netflix with spoken Italian and Italian subtitles as well.\n\nMonth 2(ish)\n\nAfter the Ollie Richards books I was pretty certain I never wanted to read a learners short story ever again 😂 I started reading Roald Dahl books (I’d read a lot of his books as a kid and liked them, so it was a nice nostalgia blast). I’d read a chapter in Italian, then in English, then in Italian again. I only needed to do this for the first few chapters of two of these books (The Twits and Fantastic Mr Fox), and since then I’ve never had to use any other method than ‘look up words’ to read a book. I also listened to audiobooks of these when possible (normally while walking or driving, and always after I'd read the book).\n\nTowards the end of this month I decided to book a once a week lesson. At this stage I was pretty much at a point where reading off a script was the only way to keep talking for any length of time, so I’d normally watch a ted x video before the lesson, and then use Microsoft Excel to write a report on it, putting a sentence of English in one column, and get a translation in another column to read out. I found this a good way to ask a native speaker how good the translations were (surprisingly they were usually very good!)\n\nMonth 3(ish) to 4(ish)\n\nAt this point I decided I wanted to move on from Roald Dahl books to books ‘YA fiction’ (The Curious incident of the dog in the night time, Harry Potter and the Hunger Games). I just read these without using any other technique than looking up words if I really wanted to know it. I eventually settled on a system of having one book on the kindle app (where I’ll look up words quite a bit some days if I feel like it) and a paperback which I read before bed (where I hardly ever look up a word). I did also read a couple of non fiction books at this stage. Its something I will eventually go back to as I prefer non fiction, but I'm focused on boosting my vocabulary.\n\nI also wanted to branch out from only listening to audiobooks so I started listening to YouTubers aimed at learners (so they talk only in Italian but with the fact they are talking to learners in mind). Podcast Italiano is a good example.\n\nInspired by things I was learning from my weekly lessons I started looking up grammar. I read though a 'Teach Yourself' Italian grammar book and started looking up verb conjugations on Reverso. This all made much more sense than any grammar study I’ve done in the past due to the reading I’d been doing. Rather than trying to memorise things it became ‘ohhh that’s what that means’. It’s hard to explain how powerful that is 🙂\n\nMonth 5 onwards\n\nFor reading I decided I wanted to keep upping the level so started reading novels aimed at an adult audience (nothing literary but things like Lee Child, Stephen King etc). I’ve just started my first novel which was originally written in Italian and the first 2 chapters have been fine 🙂 I’ll listen to audiobooks of them after I’ve read them. That way if I zone out I don’t get lost as I’ve read the story before.\n\nTowards the end of month 4 I found I was understanding most of the things I was watching on Netflix with subs on so I started watching things without the subs on and branching out to YouTubers who were aimed at a native audience. I can now understand a lot of what I listen to but it was tough until very recently. Because novels use a lot more words than real life talking I think I’m starting to understand the theory that reading is what reaches you the vocabulary and listening/watching tv is the ‘reward’. I’ve also started buying DVDs and have watched a couple of films without subs.  \n\nI decided that my main weakness was verb conjugation (which is pretty much the key to expressing the correct tense and person in both Italian and Spanish I believe). So I know put a random verb into reverso’s conjugator and test myself on the different conjugations. This has worked amazingly well at improving my speaking.\n\nAt around the start of month 5 I could have conversation with my tutor, understanding everything she said and she could understand me perfectly etc.\n\nI think that’s everything. I hope it wasn’t too much, but I wanted to try and give everything useful I’ve done!", "created_utc": "1658769734.0", "edited": "1658771995.0", "id": "ihlou1b", "is_submitter": "False", "link_id": "t3_w7ajfv", "parent_id": "t1_ihlgkmj", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "CrossHeather", "body": "Loads of people saying similar, but thought I’d add for more encouragement as you won’t be the only person thinking this… I’m 36 (soon to be 37) and have progressed from false beginner in Italian to being able to have a conversation for an hour, being able to read novels and listen to most things etc in 6 months mostly through reading a lot, and listening more and more as my comfort levels grew.\n\nThe problem is we convince ourselves it’s too difficult to learn a language because we learned a language at school and never became fluent. Then we tried to replicate the same learning methods, or used a couple of apps etc, and we’re even more convinced learning languages just isn’t for us.\n\nThe frustration for me now is if I’d just known that ‘reading a lot’ was so effective (and how obvious is it really? If you read a lot in your target language you’ll get better at it 😂) I’d have been fluent in Italian a long time ago!\n\nIf you’ve not looked at language transfer for Spanish it might be worth a look by the way (can find it on YouTube). It’s a good confidence booster for beginners as it shows you how easy it is to say quite a lot with a handful of verbs and knowledge of English.", "created_utc": "1658758930.0", "edited": "False", "id": "ihkx7tv", "is_submitter": "False", "link_id": "t3_w7ajfv", "parent_id": "t3_w7ajfv", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "CrossHeather", "body": "Grazie! Sei troppo gentile.", "created_utc": "1658741384.0", "edited": "False", "id": "ihk2vqs", "is_submitter": "True", "link_id": "t3_w6tw42", "parent_id": "t1_ihi14e6", "score": "2", "subreddit": "WriteStreakIT", "subreddit_id": "t5_2gcnah"}, {"author": "CrossHeather", "body": "Grazie mille! Questo feedback è molto utile!", "created_utc": "1658655770.0", "edited": "False", "id": "ihfi52a", "is_submitter": "True", "link_id": "t3_w5xztq", "parent_id": "t1_ihckstm", "score": "2", "subreddit": "WriteStreakIT", "subreddit_id": "t5_2gcnah"}, {"author": "CrossHeather", "body": "At the moment it seems to be missing out filler words that can be glossed over in English.\n\nThe most basic example being ‘that’ is optional in:\n‘I think that…’\n\nBut ‘che’ is not in ‘Penso che…’\n\nI don’t make that specific mistake, but do seem to keep making mistakes of that nature.", "created_utc": "1658570596.0", "edited": "False", "id": "ihb0ifo", "is_submitter": "False", "link_id": "t3_w5q4py", "parent_id": "t3_w5q4py", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "CrossHeather", "body": "I think it’s the ultimate slap in the face when you look up a Italian to English translation and don’t recognize the English word 😂", "created_utc": "1658570048.0", "edited": "False", "id": "ihazuds", "is_submitter": "False", "link_id": "t3_w5q1jp", "parent_id": "t3_w5q1jp", "score": "3", "subreddit": "italianlearning", "subreddit_id": "t5_2tuxf"}, {"author": "CrossHeather", "body": "This sounds exactly like one of Romesh Ranganathan’s stand up shows 😂 He imitates his mother insulting him to her friends in Tamil a lot, and basically points out how ridiculous it is that she never taught him but expects him to somehow talk it perfectly.\n\nTo be fair they seem to get on quite well. If the family are quite ‘brutal’ (and maybe they’re only ‘brutal’ to our sensitive western ways) then surely they can take a little bit of stick back.", "created_utc": "1658569713.0", "edited": "False", "id": "ihazft1", "is_submitter": "False", "link_id": "t3_w5y7yc", "parent_id": "t1_ihavija", "score": "7", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "CrossHeather", "body": "I’m pretty awful at fpl, but assuming all goes well then seems a good idea to dead end the team away from 3 x Liverpool and 2/3 x Man City during gameweeks 8-11 and then wildcard after? Assuming the original team holds up till then of course.", "created_utc": "1658510816.0", "edited": "False", "id": "ih7qika", "is_submitter": "False", "link_id": "t3_w5bwan", "parent_id": "t3_w5bwan", "score": "1", "subreddit": "FantasyPL", "subreddit_id": "t5_2snvr"}, {"author": "CrossHeather", "body": "Grazie, lo guarderò 🙂", "created_utc": "1658504802.0", "edited": "False", "id": "ih7atb5", "is_submitter": "True", "link_id": "t3_w55yw6", "parent_id": "t1_ih79xus", "score": "1", "subreddit": "WriteStreakIT", "subreddit_id": "t5_2gcnah"}, {"author": "CrossHeather", "body": "Grazie!", "created_utc": "1658495232.0", "edited": "False", "id": "ih6nic3", "is_submitter": "False", "link_id": "t3_w513xj", "parent_id": "t1_ih6n1at", "score": "2", "subreddit": "italianlearning", "subreddit_id": "t5_2tuxf"}, {"author": "CrossHeather", "body": "Un allenatore di calcio ha più sicurezza sul lavoro 😬", "created_utc": "1658487012.0", "edited": "False", "id": "ih68w2v", "is_submitter": "False", "link_id": "t3_w4l0h5", "parent_id": "t3_w4l0h5", "score": "1", "subreddit": "Italia", "subreddit_id": "t5_2rbm5"}, {"author": "CrossHeather", "body": "Ho ti mancato un messaggio 🙂", "created_utc": "1658486623.0", "edited": "False", "id": "ih68bz3", "is_submitter": "False", "link_id": "t3_w513xj", "parent_id": "t3_w513xj", "score": "2", "subreddit": "italianlearning", "subreddit_id": "t5_2tuxf"}, {"author": "CrossHeather", "body": "Grazie!", "created_utc": "1658479360.0", "edited": "False", "id": "ih5yz8j", "is_submitter": "True", "link_id": "t3_w3hyeo", "parent_id": "t1_igygt2x", "score": "2", "subreddit": "WriteStreakIT", "subreddit_id": "t5_2gcnah"}, {"author": "CrossHeather", "body": "Grazile mille!", "created_utc": "1658479249.0", "edited": "False", "id": "ih5yu76", "is_submitter": "True", "link_id": "t3_w2nxfx", "parent_id": "t1_igyfl7u", "score": "2", "subreddit": "WriteStreakIT", "subreddit_id": "t5_2gcnah"}, {"author": "CrossHeather", "body": "Glad it helps :)\n\nYeah I've heard American English is easier (spellings in particular), and it must be the most widely spoken variant. \n\nI think the main problem with British English is the very marked differences in how differently its used even in the same country.", "created_utc": "1658476653.0", "edited": "False", "id": "ih5vkj0", "is_submitter": "False", "link_id": "t3_w49jiw", "parent_id": "t1_ih5n6uq", "score": "1", "subreddit": "WriteStreakEN", "subreddit_id": "t5_2y42lo"}, {"author": "CrossHeather", "body": "Grazie! Sto iniziando vedere che lascio troppo non detto! (‘Mentre’ in questo caso)", "created_utc": "1658432454.0", "edited": "False", "id": "ih3cwxd", "is_submitter": "True", "link_id": "t3_w4eahp", "parent_id": "t1_ih3am4t", "score": "2", "subreddit": "WriteStreakIT", "subreddit_id": "t5_2gcnah"}, {"author": "CrossHeather", "body": "Grazie!\n\nPunto 2: Probabilmente un traduzione troppo literale 🙂 Stavo provando dire che credo studierò italiano per il resto della mia vita, perché quelle attivite sono divertente quando si può capire libri, film ecc 🙂", "created_utc": "1658431113.0", "edited": "False", "id": "ih39cln", "is_submitter": "True", "link_id": "t3_w4eahp", "parent_id": "t1_ih36el9", "score": "1", "subreddit": "WriteStreakIT", "subreddit_id": "t5_2gcnah"}, {"author": "CrossHeather", "body": "‘O in italiano.’\n\nProbabilmente la prima volta ho capito una barzelletta in Italiano nell’istante in cui l’ho letto 😂 Grazie per la risata!", "created_utc": "1658422515.0", "edited": "False", "id": "ih2mcmy", "is_submitter": "False", "link_id": "t3_w4br86", "parent_id": "t1_ih20zqi", "score": "2", "subreddit": "Italia", "subreddit_id": "t5_2rbm5"}, {"author": "CrossHeather", "body": "TDLR: there is no easy way to answer this. I’m sorry for the long lost that follows!\n\nAh, a difficult question 🙂And the answer is difficult too I’m afraid 😬\n\nI’m from the UK so a bit of our dislike of confrontation will probably show through with the things I’d use to give an opinion…\n\nMy expectation is normally I wouldn’t have to ask, baring some exceptional circumstances. It’s almost a bit weird to ask as nobody would ever really want to say no. (If I did have to… maybe in a work meeting or something… it would probably be ‘Do you mind if I add something?’. If I was going as far to actually interrupt somebody - the horror! - I’d be apologizing for a long time and probably say ‘it’s just that…’ before adding my opinion.. eg ‘It’s just that the buildings on fire and we need to leave right now’) So instead of asking, I’d normally start the sentence with one of the following:\n\n‘The thing with that is… ‘ if I’m about to criticise somebody’s horrifically bad idea\n\n‘Have you thought about…’ if I think there is something that wouldn’t work with their idea, but I’m not sure. So I’m not really giving an opinion outright, just asking a question to try and get them to clarify they haven’t missed something out.\n\n‘Yeah I think you’re right, it’s just that…’ if I broadly agree but think there’s something important that’s not been mentioned, or an easier way of doing the thing we are talking about.\n\nIf I fully agreed with someone it’d be a simple sentence… something like ‘Yeah, spot on.’ ‘Yeah, I agree’ etc\n\nAnd that’s just covering what I’d use in response to somebody’s ideas 😂\n\nIf someone was asking me what I thought of something they’ve created I’d probably just say ‘Yeah I like it’ if I hated it, and ‘That’s great. I like…’ and then list all the things I like about it if I did actually like it.\n\nIf you’re interested in British English, and how everything being geared towards avoiding conflict shapes how we talk, then as strange a suggestion as it it it might be worth following ‘Very British Problems’  on some form of social media as they do a good job of describing our innate weirdness. If you’re interested in American English or another form, then feel free to ignore this reply 😂", "created_utc": "1658406001.0", "edited": "1658406218.0", "id": "ih1hvgc", "is_submitter": "False", "link_id": "t3_w49jiw", "parent_id": "t1_ih1emhy", "score": "2", "subreddit": "WriteStreakEN", "subreddit_id": "t5_2y42lo"}, {"author": "CrossHeather", "body": "You are correct.\n\nTo ‘chip in’ means to contribute something. Whether that is money, effort towards a goal (eg David really chipped in when we tidied the yard) or just an opinion. To be clear, the most common usage is to pay money towards something. One of the meanings of ‘chip’ is a small piece of something so I suspect the saying comes from that.\n\nTo ‘chime in’ is solely related to saying something, because the proper meaning of ‘chime’ is when a bell makes a ringing sound. As far as I’m aware it’s not used often. I understand the meaning of it as soon as I read it, but I can’t recall ever saying it or hearing it used since being a child (a long long time ago 😂).\n\nSo yes, the confusing part is for giving an opinion both phrases work (though I wouldn’t use either, ‘look who’s chiming in’ would probably come across as offensive). However only ‘chip in’ works when we are talking about providing money or effort. And the only time I’d ever really use ‘chip in’ is if I was thanking someone for paying towards something.", "created_utc": "1658403391.0", "edited": "1658404134.0", "id": "ih1d5xi", "is_submitter": "False", "link_id": "t3_w49jiw", "parent_id": "t3_w49jiw", "score": "1", "subreddit": "WriteStreakEN", "subreddit_id": "t5_2y42lo"}, {"author": "CrossHeather", "body": "Grazie!\n\nQuesto è un grande aiuto 🙂", "created_utc": "1658402078.0", "edited": "False", "id": "ih1b0v7", "is_submitter": "True", "link_id": "t3_w1sukr", "parent_id": "t1_igydqbj", "score": "2", "subreddit": "WriteStreakIT", "subreddit_id": "t5_2gcnah"}, {"author": "CrossHeather", "body": "Grazie mille!", "created_utc": "1658401977.0", "edited": "False", "id": "ih1av9o", "is_submitter": "True", "link_id": "t3_w17koc", "parent_id": "t1_igyarrs", "score": "2", "subreddit": "WriteStreakIT", "subreddit_id": "t5_2gcnah"}, {"author": "CrossHeather", "body": "For i = 0 to 1\n\nIf (a == false && i == 0){ return 0 } else { return 1 }\n\nNext", "created_utc": "1658263291.0", "edited": "False", "id": "igtt3kb", "is_submitter": "False", "link_id": "t3_w2uz7c", "parent_id": "t3_w2uz7c", "score": "1", "subreddit": "ProgrammerHumor", "subreddit_id": "t5_2tex6"}, {"author": "CrossHeather", "body": "Ah great list.\n\nI do a daily activity where I put a verb into reverso’s [conjugator](https://conjugator.reverso.net/conjugation-italian.html) and test myself on the different tenses/pronouns. Having a spreadsheet like this will help no end in picking a verb each day. (Seems like 2 a day and completing the list in less than a year is a challenge I might set myself!)\n\nThanks for sharing!", "created_utc": "1658226703.0", "edited": "False", "id": "igree45", "is_submitter": "False", "link_id": "t3_w27si9", "parent_id": "t3_w27si9", "score": "3", "subreddit": "italianlearning", "subreddit_id": "t5_2tuxf"}, {"author": "CrossHeather", "body": "The top reply to this post is amazing\n\nhttps://www.reddit.com/r/italianlearning/comments/uuqkpy/do_you_guys_know_some_italian_youtubers_not/?utm_source=share&utm_medium=ios_app&utm_name=iossmf", "created_utc": "1658160158.0", "edited": "False", "id": "ignnpf8", "is_submitter": "False", "link_id": "t3_w20xh6", "parent_id": "t3_w20xh6", "score": "5", "subreddit": "italianlearning", "subreddit_id": "t5_2tuxf"}, {"author": "CrossHeather", "body": "[Gazzetta.it](https://www.gazzetta.it/Calcio/Calciomercato/Juventus/17-07-2022/juve-de-ligt-bayern-c-rilancio-70-milioni-piu-bonus-il-si-4401468753822.shtml?app_v2=true) saying current offer is €75 million guarenteed, with €5 million ‘bonus’, so you’re pretty much spot on.", "created_utc": "1658083414.0", "edited": "False", "id": "igjqb8x", "is_submitter": "False", "link_id": "t3_w1c6p4", "parent_id": "t1_igjjowr", "score": "1", "subreddit": "Juve", "subreddit_id": "t5_2t9a7"}, {"author": "CrossHeather", "body": "Grazie. Sei molto gentile a dare tutto questo feedback!", "created_utc": "1658067499.0", "edited": "False", "id": "igiqdvp", "is_submitter": "True", "link_id": "t3_vzu74s", "parent_id": "t1_igioz08", "score": "2", "subreddit": "WriteStreakIT", "subreddit_id": "t5_2gcnah"}, {"author": "CrossHeather", "body": "If you liked Matilde then it’s worth reading a few more by Roald Dahl. I read 4 before moving onto the Hunger Games and was able to read that so it was presumably a decent stepping stone into moving onto YA 🙂", "created_utc": "1657993309.0", "edited": "False", "id": "igf3f0b", "is_submitter": "False", "link_id": "t3_w0ld75", "parent_id": "t3_w0ld75", "score": "2", "subreddit": "italianlearning", "subreddit_id": "t5_2tuxf"}, {"author": "CrossHeather", "body": "Ahhh the ‘filthy’ in front of ‘Otaku’ made me think that was a lot worse than what it actually is 😂", "created_utc": "1657989283.0", "edited": "False", "id": "igetuzg", "is_submitter": "False", "link_id": "t3_w0jlnk", "parent_id": "t1_igetdpx", "score": "6", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "CrossHeather", "body": "Why do I feel like this would be a bad thing to google? 😂", "created_utc": "1657988897.0", "edited": "False", "id": "igesy12", "is_submitter": "False", "link_id": "t3_w0jlnk", "parent_id": "t1_igepurm", "score": "6", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "CrossHeather", "body": "Grazie per avermi dato più feedback! È molto apprezzato!\n\nÈ grazie per la spiegazione 🙂", "created_utc": "1657987012.0", "edited": "False", "id": "igeoidg", "is_submitter": "True", "link_id": "t3_vyot9u", "parent_id": "t1_igekwyb", "score": "1", "subreddit": "WriteStreakIT", "subreddit_id": "t5_2gcnah"}, {"author": "CrossHeather", "body": "No problem! You haven't written too much :) I'd just rather give detailed feedback on a small part of it, rather than tiny bits on the whole piece.\n\nYour written English is good by the way, its only really 'style' (unnecessary words mostly) that could be improved, but that's something that comes with time.  I can understand everything you have written :)", "created_utc": "1657972045.0", "edited": "False", "id": "igdued0", "is_submitter": "False", "link_id": "t3_w04aio", "parent_id": "t1_igds5mp", "score": "2", "subreddit": "WriteStreakEN", "subreddit_id": "t5_2y42lo"}, {"author": "CrossHeather", "body": "No! I'd lose my easy way to have a shortlist of transfer selections if that went....", "created_utc": "1657971023.0", "edited": "False", "id": "igdsta8", "is_submitter": "False", "link_id": "t3_w0cir9", "parent_id": "t3_w0cir9", "score": "0", "subreddit": "FantasyPL", "subreddit_id": "t5_2snvr"}, {"author": "CrossHeather", "body": "I have corrected the first paragraph if anybody else could carry on from there :) \n\n&#x200B;\n\n*In the first place, (I'd lose this, epecially with using 'the first aspect' later on)* **Without** analyzing the background and the meaning of it, I loved how the egg scene was constructed. ~~by itself, loved~~ ~~and~~ **The** despair ~~that how~~  was \\[demonstrated by / shown by/ clear from how\\] Jet and Spike **inhaled** the food in an attempt to avoid thinking about the current situation. Since it was constructed with a**n** **everyday** activity ~~that it’s done by everyone~~, the act of eating, it slightly\\* amplified the gloomy atmosphere of the frame, turning\\* it into a raw and visceral one. After all, when I think about eating, the image that pops into my mind is usually happy ones, where people are enjoying eating together or at least tasting something **delicious**. Who **could** imagine that two people eating eggs would be so depressing and sad?\n\n*\\*('subtly' is probably better than 'slightly'. Subtly implies that it was used well)* \n\n\r\\* You said this only 'slightly' amplifed the gloomy atmostphere, so the thought that this turns the entire scene is a contradiction. \"turning\\* it into a raw and visceral one.\"  would probably be better as \"amplyifing the raw and visceral nature of the moment\"\n\n\r  \nThe first aspect that I want to talk about is regarding the incapacity of them in moving on and expressing their feeling toward others. As I mentioned their lives were difficult and they have so much distress about it, life had coarsened them and they weren’t willing to accept and live new experiences, only living in the past. But, after this scene is really difficult for me to agree totally with that. Although they were living together because they don’t have another place to go, I think they turned into a family. It’s not a family that they want, but was a family that they needed and deep inside, they all have nurtured some kind of fond feeling toward each of them. Since they are all incapable of showing emotions, this scene was the emotional outlet that they needed, the only way that they have found to communicate it and was also the way that was used to avoid dealing with it too. Unfortunately, for this display of affection happens, the departure of their friends was needed.\r  \n\r  \nAnd it gets deeper because I think everyone can relate with this somehow. How many times did you avoid something because you were afraid to be criticized? How many times did you worry about doing something because you didn’t know how would be the reactions of others? How many times did you shirk something because you thought that would be plenty of time in the future to do that? How many times did you fudge an opportunity because you are feeling insecure? This can be quite dangerous because maybe tomorrow could be too late, as shown in this scene.\r  \n\r  \nThe second part that I want to delve into is that Spike is such a disingenuous person when he states “Whatever happens, happens” to everyone, that life is this and that and you should accept it, but he is the one who doesn’t forget what has happened. For me, the person that represents this philosophy is Ed, and it’s easy to make this association. He’s always happy and always living in the present, and never letting the awful things lock up the good mood and embroiling his soul in bad feelings. And when he needs to move on, he simply does, as well as he did when he left the crew to be with his beloved father.\r  \n\r  \nTo be cointinued...", "created_utc": "1657967658.0", "edited": "False", "id": "igdo4ih", "is_submitter": "False", "link_id": "t3_w04aio", "parent_id": "t3_w04aio", "score": "2", "subreddit": "WriteStreakEN", "subreddit_id": "t5_2y42lo"}, {"author": "CrossHeather", "body": "*Wotsit", "created_utc": "1657950755.0", "edited": "False", "id": "igd223b", "is_submitter": "False", "link_id": "t3_vzx0ly", "parent_id": "t1_igb10r7", "score": "2", "subreddit": "unitedkingdom", "subreddit_id": "t5_2qhqb"}, {"author": "CrossHeather", "body": "Grazie!\n\nQuesto feedback è molto utile!", "created_utc": "1657899774.0", "edited": "False", "id": "ig9ylin", "is_submitter": "True", "link_id": "t3_vy7ikv", "parent_id": "t1_ig94xgd", "score": "1", "subreddit": "WriteStreakIT", "subreddit_id": "t5_2gcnah"}, {"author": "CrossHeather", "body": "Yes, lots of good pointers here, but this comment is why having audio to go along with what you are reading is pretty much essential at the beginning. \n\nObviously it can be done without the audio… people would have had to cope without it in the past after all. However, given the low cost of finding audio nowadays (free in plenty of cases) there doesn’t seem any good reason not to.\n\nThe benefits don’t even stop at mastering pronunciation. You can listen to audio in situations where you can’t read, so it’s a great way to get more exposure to the language and allows for more review.", "created_utc": "1657818112.0", "edited": "False", "id": "ig5eve6", "is_submitter": "False", "link_id": "t3_vywwkc", "parent_id": "t1_ig5cvm1", "score": "13", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "CrossHeather", "body": "No problem 🙂", "created_utc": "1657775626.0", "edited": "False", "id": "ig3awm7", "is_submitter": "False", "link_id": "t3_vx9502", "parent_id": "t1_ig2nqyk", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "CrossHeather", "body": "Ah, I haven’t got a clue on access to the subreddit I’m afraid.", "created_utc": "1657736602.0", "edited": "False", "id": "ig0uqrk", "is_submitter": "False", "link_id": "t3_vy8n9t", "parent_id": "t1_ig0npa7", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "CrossHeather", "body": "r/learninggerman - it’s worth asking there too.\n\nFor what it’s worth, if I was starting a language from scratch now I’d watch the Easy Language channel for that language, so Easy German in your case. Search for Easy German 1 on YouTube and you’ll get a beginners video with German and English subtitles.", "created_utc": "1657733531.0", "edited": "1657733815.0", "id": "ig0mui6", "is_submitter": "False", "link_id": "t3_vy8n9t", "parent_id": "t3_vy8n9t", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "CrossHeather", "body": "Fantastic writing!\n\nOnly a few small pointers:\n\n‘Building workers’ should be ‘construction workers’\n\n‘Military defense’ should just be ‘defense’. The two words are never used together.\n\n‘Cultural’ isn’t needed as ‘culture’ is used later in the sentence’\n\n‘Better-known’ the hyphen isn’t needed.\n‘And make the country’s image better known’ would probably be better as ‘and boost the country’s image’", "created_utc": "1657730480.0", "edited": "False", "id": "ig0ev48", "is_submitter": "False", "link_id": "t3_vy6rfk", "parent_id": "t3_vy6rfk", "score": "1", "subreddit": "WriteStreakEN", "subreddit_id": "t5_2y42lo"}, {"author": "CrossHeather", "body": "I’ve read the first Hunger Games. It was the first novel I read after reading a few Roald Dahl books. \n\nBecause it’s written in the first person and mostly in the present tense it’s a pretty good book for people to attempt as a first novel in my opinion. If you’ve read it in English or seen the film even more so.", "created_utc": "1657667236.0", "edited": "False", "id": "ifx5t8v", "is_submitter": "False", "link_id": "t3_vxkgpl", "parent_id": "t3_vxkgpl", "score": "6", "subreddit": "italianlearning", "subreddit_id": "t5_2tuxf"}, {"author": "CrossHeather", "body": "Grazie. I really need to do this!", "created_utc": "1657664522.0", "edited": "False", "id": "ifwzeud", "is_submitter": "False", "link_id": "t3_vx9502", "parent_id": "t1_ifwb6lg", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "CrossHeather", "body": "Yes 😂\n\nIt’s even got it’s own Wikipedia page.", "created_utc": "1657642560.0", "edited": "False", "id": "ifvg3t3", "is_submitter": "False", "link_id": "t3_vxdbtt", "parent_id": "t1_ifvbhkf", "score": "47", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "CrossHeather", "body": "Of course. It’s Italian. 🙂\n\nAs for what verb to choose… I sometimes take one off a top x Italian verbs found from googling, sometimes I use reverso’s verb of the day, but more often than not one just comes to mind that I should practice. Eg this week so far it’s been mangiare ‘to eat’ and bere ‘to drink’. Why those two? I think mangiare come to mind because the ‘i’ is sometimes dropped and I picked up on that when reading over the weekend (I mean I knew it was a thing already, and why it happens, it just jumped out for some reason), and bere today because it’s linked and is irregular.\n\nBut yeah, maybe I should have a better way of choosing 😂", "created_utc": "1657642068.0", "edited": "False", "id": "ifveuvw", "is_submitter": "False", "link_id": "t3_vx9502", "parent_id": "t1_ifvc2wb", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "CrossHeather", "body": "Ah so glad it helps. I saw a YouTube video someone made about talking to themselves and I’d always wanted to improve my conjugation so seemed a good idea to mash the concepts together.\n\nThe way I do it is put the verb into [reverso’s conjugator](https://conjugator.reverso.net/conjugation-English.html) - on my phone, the layout is better for what I’m doing with it - then see that the first tense listed is the present indicitive. I rattle off a sentence for I, you, we etc then check I was right. I then repeat for the next tense, and so on and so on.", "created_utc": "1657640725.0", "edited": "False", "id": "ifvbex2", "is_submitter": "False", "link_id": "t3_vx9502", "parent_id": "t1_ifv9ofj", "score": "6", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "CrossHeather", "body": "No problem. One of those basic things that once you start doing you wonder why you never did it before 🙂", "created_utc": "1657640427.0", "edited": "False", "id": "ifvanls", "is_submitter": "False", "link_id": "t3_vx9502", "parent_id": "t1_ifv7ov2", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "CrossHeather", "body": "For verbs I find [reverso](https://conjugator.reverso.net/conjugation-portuguese.html) very very useful in Italian. \n\nIf you enter an infinitive form (eg in Italian I could  enter ‘andare’ for ‘to go) it will show me how to use the verb in basically every tense and for every pronoun. I can then click on any of the forms it gives me (eg ‘vado’ for ‘I go’) and it shows me example sentences.\n\nIn terms of what verbs to try, [this](https://www.babbel.com/en/magazine/common-portuguese-verbs) looks like the corresponding list to an Italian one I used to reinforce my Italian verbs. \n\nSadly there doesn’t seem to be a Paul Noble audio course for Portuguese… I found this very useful as a first step for saying sentences. I suspect the Michel Thomas method is very similar from what people say about it, and a documentary they showed on the BBC about him many years ago, but I think that is more expensive.", "created_utc": "1657634069.0", "edited": "False", "id": "ifuv2sw", "is_submitter": "False", "link_id": "t3_vxbg29", "parent_id": "t3_vxbg29", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "CrossHeather", "body": "I try and have a baseline of habits that I do everyday as a minimum. I just write them down each month and put the date by each habit when it’s done for the day.\n\n1) Read a chapter of a book (I’ll pretty much always do this before going to sleep, even if I’ve read earlier in the day. Reading a paper back in bed seems to knock me out guarenteed… I’ve never slept so well!)\n2) Listen to 30 minutes of audio. (I tend to do this when walking or driving. Either to or from work, or on my lunch hour)\n3) Pick a verb for the day and conjugate it in a sentence with each pronoun for different tenses. (I do this when I have a mindless boring task)\n4) Write 2 pages (I pretty much fail at this one every day, even though the pages are A5 and I leave a space between each line for corrections after checking in google translate 😂)\n\nI do often do more, but I like this system as it’s stopped me feeling guilty or my mind wandering when I’m doing things in English.", "created_utc": "1657629629.0", "edited": "False", "id": "ifulovc", "is_submitter": "False", "link_id": "t3_vx9502", "parent_id": "t3_vx9502", "score": "125", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "CrossHeather", "body": "Grazie!", "created_utc": "1657628800.0", "edited": "False", "id": "ifuk50o", "is_submitter": "False", "link_id": "t3_vx8rwj", "parent_id": "t1_ifujlqm", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "CrossHeather", "body": "Do you recommend any particular ones for people to get started?", "created_utc": "1657627180.0", "edited": "False", "id": "ifuh9ye", "is_submitter": "False", "link_id": "t3_vx8rwj", "parent_id": "t1_ifuds3x", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "CrossHeather", "body": "Thank you so much for that shout u/InfernalWedgie! Having a look I think this is going to be more inclusive than the official game and allow people of all levels of Italian to play! The game is very very similar to FPL by the looks of things.\n\nI’ll get something set up and let people know the details!", "created_utc": "1657606760.0", "edited": "False", "id": "iftqw94", "is_submitter": "True", "link_id": "t3_vwcscj", "parent_id": "t1_ifs4ifd", "score": "2", "subreddit": "italianlearning", "subreddit_id": "t5_2tuxf"}, {"author": "CrossHeather", "body": "Yes haha. In a strange way though getting the feeling of ‘this ending is ridiculous’ is actually good because it shows you’re understanding what’s happening.\n\nCongrats on getting through a couple of the stories. Honestly it’s worth preserving with because if you keep sticking with reading and upping the difficulty slightly it’s amazing how quick the progress is.", "created_utc": "1657605850.0", "edited": "False", "id": "iftpncq", "is_submitter": "False", "link_id": "t3_vutum8", "parent_id": "t1_ifsj28n", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "CrossHeather", "body": "Hi, piggyback away! Hopefully some kind soul will come along and explain it all to us…. Feels like a good opportunity to give us all some immersion if we can figure it out between us before the season starts in August.\n\nI’ve had a look just now and set up an account etc, but still have more to look at in terms of how to set up a league properly. It feels like I need to get onto the website on a computer and go from there. At least google translate should be easy enough to use with a desktop/laptop. I’m confident I’ll be able to figure out from the Italian  what exactly we will all have to do, but need to devote some time to reading the rules etc (I never twigged before today that the reason fpl seems so user friendly to me is because I’ve played it for the best part of 2 decades 😂)\n\nIf nobody beats me to it I’ll come back to this over the course of the next few days and explain as much as I can in English. Gives me a chance to do some translation (if I can’t find anything in English that already does the job… surely there must be one blog out there on the game by an American or Anglo Italian!)", "created_utc": "1657574887.0", "edited": "False", "id": "ifrx0kt", "is_submitter": "True", "link_id": "t3_vwcscj", "parent_id": "t1_ifrryq3", "score": "1", "subreddit": "italianlearning", "subreddit_id": "t5_2tuxf"}, {"author": "CrossHeather", "body": "Probably not quite what you’re after, but it is technically a crime novel…. I managed to read the translation of the first Jack Reacher novel ‘Zona Pericolosa’ after 4 months of extensive reading and understand what was happening.", "created_utc": "1657559826.0", "edited": "False", "id": "ifqulws", "is_submitter": "False", "link_id": "t3_vwn23h", "parent_id": "t3_vwn23h", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "CrossHeather", "body": "Mi dispiace, avevo dimenticato che Leonardo Da Vinci era il inventore di Internet.", "created_utc": "1657559553.0", "edited": "False", "id": "ifqtwfl", "is_submitter": "False", "link_id": "t3_vwauei", "parent_id": "t1_ifqqg61", "score": "3", "subreddit": "memesITA", "subreddit_id": "t5_258mfq"}, {"author": "CrossHeather", "body": "Che fortuna, Internet non avrebbe funzionato.", "created_utc": "1657542371.0", "edited": "False", "id": "ifpq5er", "is_submitter": "False", "link_id": "t3_vwauei", "parent_id": "t1_ifpnxzf", "score": "3", "subreddit": "memesITA", "subreddit_id": "t5_258mfq"}, {"author": "CrossHeather", "body": "It’s almost as if the Tories don’t actually want people who can just about muster together a buy to let deposit to go out and add competition - therefore raising prices -  to those rich enough to buy properties without worrying about the ‘initiatives’ (taxes) they’ve introduced since taking power.\n\nI for one am shocked! Shocked I tell you! \n\nI know it sounds crazy, but at this rate people will start accusing them of setting policy to help those rich enough to donate to the party and wine and dine the MPs.", "created_utc": "1657541023.0", "edited": "False", "id": "ifpntce", "is_submitter": "False", "link_id": "t3_vwdrra", "parent_id": "t3_vwdrra", "score": "2", "subreddit": "unitedkingdom", "subreddit_id": "t5_2qhqb"}, {"author": "CrossHeather", "body": "‘Nooo, sono in ritardo al lavoro’\n\n*Guarda fuori della finestra \n\n‘Siiii, l’ufficio è stato distrutto’\n\n*Ricorda che lavora da casa", "created_utc": "1657540118.0", "edited": "False", "id": "ifpmbaa", "is_submitter": "False", "link_id": "t3_vwauei", "parent_id": "t3_vwauei", "score": "3", "subreddit": "memesITA", "subreddit_id": "t5_258mfq"}, {"author": "CrossHeather", "body": "Great stuff! I’ll look into it properly and message yourself and anyone else who expresses an interest 🙂", "created_utc": "1657535595.0", "edited": "False", "id": "ifpft61", "is_submitter": "True", "link_id": "t3_vwcscj", "parent_id": "t1_ifpfdyk", "score": "1", "subreddit": "italianlearning", "subreddit_id": "t5_2tuxf"}, {"author": "CrossHeather", "body": "Actually… This reminded me of an epic comment I saw a while back and I’ve managed to dig it out.\n\nhttps://www.reddit.com/r/italianlearning/comments/uuqkpy/do_you_guys_know_some_italian_youtubers_not/i9h83ns/?utm_source=share&utm_medium=ios_app&utm_name=iossmf&context=3\n\nCredit to dog—god ! Reddit doesn’t seem to like the hyphens in their user name when trying to tag the person to say thanks sorry ☹️", "created_utc": "1657531424.0", "edited": "False", "id": "ifparox", "is_submitter": "False", "link_id": "t3_vw6d67", "parent_id": "t1_ifoeach", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "CrossHeather", "body": "If you’ve got any interest in funny little cartoons Scottecs and Cartoni Morti are a couple of channels I stumbled on.\n\nThe main ones I’ve watched quite a bit of that seem to be popular other than that are:\n\nBreaking Italy - usually one man talking about the news, but he does also interview people on occasion which can be a good way to find other things \n\nSilverbrain - animated documentaries about history. The man narrating does talk quickly!\n\nUn po’ di più - A channel about personal development with a female narrator. I think I only watch these because they are easy to understand and I used to read personal development books back in my 20s so I have a bit of a foothold in the things she talks about.\n\nNova Lectio - A well produced channel discussing various things. The titles of his video are normally something related to the current state of a place/topic. Eg ‘the grave consequences of the war in Ukraine on our food’\n\nGeopop - essentially what the channel name hints at. Geography issues/topics explained in way that appeals to a large range of people.\n\nI doubt anyone shares my obsession with football so I’ll refrain from listing all the Calcio ones unless asked 😂", "created_utc": "1657531018.0", "edited": "False", "id": "ifpaau8", "is_submitter": "False", "link_id": "t3_vw6d67", "parent_id": "t1_ifoeach", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "CrossHeather", "body": "Fantastico! Sei una leggenda!\n\nThanks a lot 🙂 Assuming any interest is shown I’ll probably be firing a message your way at some point.", "created_utc": "1657527046.0", "edited": "False", "id": "ifp5p8a", "is_submitter": "True", "link_id": "t3_vwcscj", "parent_id": "t1_ifp4n93", "score": "2", "subreddit": "italianlearning", "subreddit_id": "t5_2tuxf"}, {"author": "CrossHeather", "body": "‘Sometimes had them when both sucked though’ \nI honestly think the start of the season a couple of years back - where everyone got stung - is the sole reason hardly anyone seems to double up on them any more. Looking at their points over the last few seasons I can’t give a logical reason why I don’t just set and forget both to be honest.", "created_utc": "1657459791.0", "edited": "False", "id": "ifldrst", "is_submitter": "False", "link_id": "t3_vvpkqj", "parent_id": "t1_ifld7f2", "score": "1", "subreddit": "FantasyPL", "subreddit_id": "t5_2snvr"}, {"author": "CrossHeather", "body": "!thanks. Decent shout as either are likely to be on my bench more often than not.", "created_utc": "1657459132.0", "edited": "False", "id": "iflcihn", "is_submitter": "False", "link_id": "t3_vvpkqj", "parent_id": "t1_iflavp2", "score": "2", "subreddit": "FantasyPL", "subreddit_id": "t5_2snvr"}, {"author": "CrossHeather", "body": "!thanks\n\nYes, that rings a bell… sure I’ve read that. Might be another Soucek.", "created_utc": "1657459074.0", "edited": "False", "id": "iflcens", "is_submitter": "False", "link_id": "t3_vvpkqj", "parent_id": "t1_iflat7n", "score": "3", "subreddit": "FantasyPL", "subreddit_id": "t5_2snvr"}, {"author": "CrossHeather", "body": "Interesting, and it’s definitely making me think about the double up. I just cant get away from Trent being essential though, feels like anytime I’ve ever not owned him it’s been 2 weeks max before I’ve regretted it 😂", "created_utc": "1657458954.0", "edited": "False", "id": "iflc6fh", "is_submitter": "False", "link_id": "t3_vvpkqj", "parent_id": "t1_ifla637", "score": "1", "subreddit": "FantasyPL", "subreddit_id": "t5_2snvr"}, {"author": "CrossHeather", "body": "Does anyone have the figures? Feels like Trent corners are better - at least in terms of how often they lead to goals - from goals I can remember, and he does seem to take more free kicks as well.", "created_utc": "1657457399.0", "edited": "False", "id": "ifl9el3", "is_submitter": "False", "link_id": "t3_vvpkqj", "parent_id": "t1_ifl8soa", "score": "1", "subreddit": "FantasyPL", "subreddit_id": "t5_2snvr"}, {"author": "CrossHeather", "body": "TAA’s set pieces make him the most essential player for the starting team imo", "created_utc": "1657456402.0", "edited": "False", "id": "ifl7rdr", "is_submitter": "False", "link_id": "t3_vvpkqj", "parent_id": "t1_ifl515o", "score": "1", "subreddit": "FantasyPL", "subreddit_id": "t5_2snvr"}, {"author": "CrossHeather", "body": "Feels like no James is the risk for me. He’s just so capable of popping up with an absolute insane few gameweeks in a row.", "created_utc": "1657456301.0", "edited": "False", "id": "ifl7lg1", "is_submitter": "False", "link_id": "t3_vvpkqj", "parent_id": "t1_ifl5qdn", "score": "2", "subreddit": "FantasyPL", "subreddit_id": "t5_2snvr"}, {"author": "CrossHeather", "body": "Gone with the most template team I could muster up to get the ball rolling this summer…\n\nRaya / Balcombe\n\nTAA Cancelo James Perisic Tomiyasu\n\nSalah Diaz Neto Bruno G Pereira\n\nHaaland Jesus Greenwood \n\nMain things that have tempted me so far to go off template are Perisic > Trippier or Cucarella (if he ends up at Man City) and get 0.5 ITB. Just feels like Perisic isn’t going to play 90 mins.\n\nOther than that, I’m probably going to keep an eye on Raphina as a poss replacement for Diaz, and if I’m honest it’s only Jesus’ 50% plus ownership that has him in my team at present. I just can’t help fight the feeling he’s going to be a flop without Pep managing him. But then other than Havertz who’s really got a chance of becoming essential at that price bracket?\n\nAnyone see anything else where they think the template choice isn’t so great?", "created_utc": "1657456193.0", "edited": "False", "id": "ifl7f5v", "is_submitter": "False", "link_id": "t3_vvpkqj", "parent_id": "t3_vvpkqj", "score": "1", "subreddit": "FantasyPL", "subreddit_id": "t5_2snvr"}, {"author": "CrossHeather", "body": "I wish I could find/remember the user to credit them but I found surprisingly little of [this](http://www.pagef30.com/2011/03/most-effective-method-for-learning.html?m=1) was a great benefit.\n\nEssentially its looping over sentences - using the free Audacity software - and transcribing what is being said. I literally did about 6 hours total of it recently and I’m understanding things that were basically white noise before (Bobo TV… 4 ex Italian footballers shouting at each other in discussions on football being the best example)\n\nI suspect that shadowing might be better than transcribing eventually though, as it’s not limited by your ability to write quickly. I think the main thing is just doing some output you can check to see if you caught absolutely everything, what sounds you mishear regularly etc", "created_utc": "1657392173.0", "edited": "False", "id": "ifi5nbs", "is_submitter": "False", "link_id": "t3_vv4lqb", "parent_id": "t3_vv4lqb", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "CrossHeather", "body": "I can only talk for Italian, but the existence of ebooks and YouTube alone is absolutely incredible.", "created_utc": "1657391594.0", "edited": "False", "id": "ifi4cji", "is_submitter": "False", "link_id": "t3_vuzid6", "parent_id": "t3_vuzid6", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "CrossHeather", "body": "I was taught French at high school and left with an amazing lack of ability to use it at all, despite getting an A at GCSE.\n\nAfter that I didn’t look at languages again until I was 30. I moved to Spain and naively assumed experimenting with things like duolingo and memrise, while using learnt phrases in shops etc (my job used English so I wasn’t using Spanish at work) would lead to me being reasonable at the language. However my complete inability to understand the Spanish being fired back at me compeletely knocked my confidence. \n\nAt a certain point I knew I was moving back to the UK and decided to spend my time learning Italian. It was always the language wanted to learn ‘one day’. Despite finding some info online in regards to immersion methods and a bit of a short confidence boost from using a Paul Noble audiobook, a failed attempt at using the [Listening-Reading Method](https://learnanylanguage.fandom.com/wiki/Listening-Reading_Method) and several real life events got in the way, and I just stopped.\n\nSome time towards the end of 2021 (at the age of 36) I decided to start dabbling on duolingo again and convinced myself that if I commited to extensive reading as a 2022 New Years resolution I’d be able to finally achieve some success (where this confidence came from I have no idea looking back. I only knew the present tense conjugations for some verbs from duolingo and  the passato prossimo from Paul Noble)\n\nI won’t go into full details of my methods as I don’t think you’re after that, but 6 months after throwing myself into an extensive reading routine I now can read novels translated into Italian and understand what’s going on (probably not a surprise given reading is most of my ‘study time’), have a tutor I can converse with for an hour in Italian, and I can understand surprising amounts from watching YouTube videos or tv shows in Italian (a very nice and surprising side effect, although I did incorporate listening as well after starting my New Years resolution. I can’t claim I only read and magically turned on other abilities, though I’m sure the Vocab gained helps) So not bad for somebody who had convinced themselves many times they were incapable of learning a language.", "created_utc": "1657390369.0", "edited": "1657390859.0", "id": "ifi1lgi", "is_submitter": "False", "link_id": "t3_vukifl", "parent_id": "t3_vukifl", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "CrossHeather", "body": "To be fair to him, volume 1 and 2 of his Italian short stories - which I think are the same in all languages anyway - got me off to a good start reading extensively. \n\nThe stories aren’t the best; one or two even had me slightly frustrated with the ending. If anyone has read the one about the hike in the woods they’ll know what I mean 😂. But for me they work as a first step into reading in a target language (at least for Italian).\n\nWhether that step was absolutely essential before the next one I did (reading a chapter of a translated Roald Dahl book, reading it again I’m English then one last time in Italian) I don’t know. But I feel like the month or so of reading and listening to those short stories really helped kickstart my progress in the language. I can’t imagine a world where I recommend them to someone who is already reading, but for someone who has never read a book in their target language? Sure.", "created_utc": "1657370932.0", "edited": "1657371208.0", "id": "ifgvbft", "is_submitter": "False", "link_id": "t3_vutum8", "parent_id": "t1_ifghqwp", "score": "11", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "CrossHeather", "body": "Nice to see Bruce Willis’ kid doing so well for himself.", "created_utc": "1656612724.0", "edited": "False", "id": "iecjul8", "is_submitter": "False", "link_id": "t3_vod1b7", "parent_id": "t3_vod1b7", "score": "-7", "subreddit": "MadeMeSmile", "subreddit_id": "t5_2uqcm"}, {"author": "CrossHeather", "body": "I honestly can’t even pick out lyrics in my native language 😂 I absolutely hate musicals for this reason…. I haven’t got a clue what is going on.", "created_utc": "1656579437.0", "edited": "False", "id": "ieaoki4", "is_submitter": "False", "link_id": "t3_vnl46s", "parent_id": "t3_vnl46s", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "CrossHeather", "body": "I quite envy your position right now (I wish I’d been motivated to continue self studying French after high school).\n\nFor me, you’ve done a lot of ‘studying’ the language, but would it be fair to say you won’t have done much immersing? It would have been the case for me with French back then.\n\nI’d honestly say just give yourself a challenge of either reading something for x amount of time every day with a Spanish-English dictionary in hand, or watching something in Spanish with Spanish subtitles (Netflix or YouTube). I think you’d be surprised how much easier it seems in a month or two given the base you already have.   Just follow your interests.\n\nIf you decide that you want to ‘study’ again after a blast of immersion then there’s nothing stopping you, but I’d suggest getting that habit going first.", "created_utc": "1656362546.0", "edited": "False", "id": "idz4az0", "is_submitter": "False", "link_id": "t3_vm530v", "parent_id": "t3_vm530v", "score": "4", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "CrossHeather", "body": "I honestly think people worry about this too much.\n\nThe first thing is what is a native accent? If you moved to Stoke-on-Trent in England would you really want to lose your cool Brazilian twang so that people think you’ve always said ‘alrayt duck?’ when greeting someone? (I’m allowed to say that as I’m from Stoke 😂)\n\nThe second thing is if you decide ‘ok, maybe not the regional accent of where I’m moving to, but how about Received Pronunciation (or America’s equivalent)?’, well you only have to look at how television has changed. At some point people in charge of the media realised everybody wanted to see normal people on the screen, and that means people with an accent. Anyone who deliberately changes their accent nowadays just comes off as a bit odd (YouTube Garth Crooks for a good example. He’s one of the last football pundits who were told to lose their northern accent to land a job on the BBC)\n\nFinally, if your real concern is people understanding you, then there’s no need to worry. Your accent would morph slightly - your friends at home will say you sound American, while the Americans would say you sound Brazilian - as a natural response to making sure others understand you. My grandad was from Italy, and he was always very obviously Italian despite living in England for 2/3rds of his life, but he obviously subconsciously toned down his natural accent to a state where people in a small 1950s city understood him and befriended him (bear in mind that this was a time where UK people couldn’t even be bothered to learn a foreign name, and called immigrants by an English name 😬)", "created_utc": "1656361414.0", "edited": "False", "id": "idz1j87", "is_submitter": "False", "link_id": "t3_vm25sv", "parent_id": "t3_vm25sv", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "CrossHeather", "body": "You know I had it in my head that that was the newer version of a older dead site…\n\nGood to know there is one that’s still going 🙂", "created_utc": "1656347288.0", "edited": "False", "id": "idy2uka", "is_submitter": "False", "link_id": "t3_vkh2ha", "parent_id": "t1_idxx536", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "CrossHeather", "body": "Ah I see. 🙂 But yeah, the shared word thing makes life so much easier. It just gives you that little foundation at the start to build off doesn’t it.\n\nI followed along with a Paul Noble audiobook for Italian a couple of years back in my first aborted attempt to learn the language, and I swear I still remember things from it even now. (He talks about loan words a lot and you have to shadow what is said). Prenotare being ‘to book’ because it’s basically ‘pre note’ is just one example of something that stuck in my head.", "created_utc": "1656277866.0", "edited": "False", "id": "iduo3hy", "is_submitter": "False", "link_id": "t3_vldui3", "parent_id": "t1_idulzkv", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "CrossHeather", "body": "It’s interesting you don’t mention Italian and English with shared words, given the amount of words that both have that are derived from Latin.\n\nThere are so many words in Italian I can guess the meaning of, and there are certain English words that I just ‘know’ what the Italian will likely be for it. It’s only ever gone wrong once that I can remember when assuming ‘to improve’ in Italian would be ‘improvare’ (it isn’t 😂) But even that was probably just me momentarily mistaking improve for a word that had an ‘ation’ English form. Looking back I was probably confused with improvise/improvisation which is improvvissiare/improvvisazione…\n\nThere’s a decent summary of word endings that usually lead to cognates with English and Italian at the end of this article:\n\nhttps://blogs.transparent.com/italian/italian-cognates/\n\nIf my memory serves it’s pretty much the same with French and Spanish when compared to English too.", "created_utc": "1656276615.0", "edited": "False", "id": "idul9hx", "is_submitter": "False", "link_id": "t3_vldui3", "parent_id": "t3_vldui3", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "CrossHeather", "body": "If you’ve been exposed to Italian as a youngster I’d suggest some graded readers. \n\nAs a false beginner I ground my way through Olly Richard’s short stories 1 and 2 (and also listened to the audio books), then some Roald Dahl translations (for the first 2 I used the English versions to help me, but after that I never seemed to need any assistance other than a Italian to English dictionary on occasion).\n\nThat probably took about 2 to 3 months (and it was fun once I got past the graded readers, I’d enjoyed Roald Dahl as a kid so it was a nice nostalgia hit), and I just kept upping the difficulty of what I read after (young adult fiction then novels such as the first Jack Reacher, 1984, Misery etc).\n\n5 months in with reading as my main method of language ‘study’ I can have a conversation with a tutor for an hour, and can understand audio if I choose the right thing (animate tv series, single presenter YouTube videos etc.) This would seemingly qualify me for at least A1. I try to do an hour in the morning and an hour in the evening most days.\n\nI’ve got to be honest, I’ve done other things than reading - listened to audiobooks when walking/driving, had the radio or YouTube videos on in the background, watched videos/tv/films with and without Italian subtitles and had lessons once a week - but it feels like those have been more of a test of what I’ve learned from reading. (I’m not claiming I learned nothing from those of course!)\n\nI’m quite shocked at the speed of my progress to be honest. Having a conversation and understanding the other person after 5 months feels practically insane when I think back to my experiences of language at high school, or trying to speak Spanish when living in Spain by using memrise.", "created_utc": "1656273932.0", "edited": "False", "id": "iduf851", "is_submitter": "False", "link_id": "t3_vlbe60", "parent_id": "t3_vlbe60", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "CrossHeather", "body": "It’s probably worth asking on r/ajatt as well as it’s basically the perfect language/method mashup for this question.\n\nHowever, for what it’s worth… I’d probably suggest trying some graded readers to start off if you want to be able to read non manga books eventually. I remember looking at the 1st Harry Potter book when I first started reading in Italian 5 months ago and thinking ‘I’ll never understand this’, but after graded readers, some kids books, and some non fiction I read it quite easily.\n\nDifferent language of course. The people who bang on about reading loads of graded readers probably have a point when it comes to a language so far removed from your native one.", "created_utc": "1656272270.0", "edited": "1656272835.0", "id": "idubi6c", "is_submitter": "False", "link_id": "t3_vl81ua", "parent_id": "t3_vl81ua", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "CrossHeather", "body": "There are some learning logs on this forum that might fit the bill?\n\nhttp://how-to-learn-any-language.com/forum/forum_topics.asp?FID=4", "created_utc": "1656176725.0", "edited": "False", "id": "idpgeg2", "is_submitter": "False", "link_id": "t3_vkh2ha", "parent_id": "t3_vkh2ha", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "CrossHeather", "body": "Thanks for such a detailed answer!\n\nYou actually answered the real question I was trying but failed to articulate, ie ‘do you do an entire book like the original method said, or break it up into smaller chunks?’ so that’s really useful🙂\n\nIt’s interesting what you said about re listening / reading the initial parts of media to learn the vocabulary of the creators well before tackling the entire thing. I actually did that myself with Italian a couple of months back and it seemed to be a massive break through in my listening abilities.", "created_utc": "1656159217.0", "edited": "False", "id": "idogw1l", "is_submitter": "False", "link_id": "t3_vjkxg2", "parent_id": "t1_idof4rf", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "CrossHeather", "body": "r/AncientGreek\n\nSomeone there will likely know", "created_utc": "1656152527.0", "edited": "False", "id": "ido84t1", "is_submitter": "False", "link_id": "t3_vkbs6k", "parent_id": "t3_vkbs6k", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "CrossHeather", "body": "I once made the mistake of saying a really good mature cheddar is about as far as my interest in cheese goes and I was banished from the country for 3 years.", "created_utc": "1656149368.0", "edited": "False", "id": "ido4jht", "is_submitter": "False", "link_id": "t3_vk7ofy", "parent_id": "t3_vk7ofy", "score": "1", "subreddit": "AskUK", "subreddit_id": "t5_2t4s3"}, {"author": "CrossHeather", "body": "Thanks for that link. The Listening-Reading method was something that sounded interesting to me in the past, but like you allude to in the post linked the original method sounded a bit too much for me to actually take it on. \n\nHowever…. The fact you use it for related languages to those you already know (combined with immersion being my main way of learning Italian), and don’t worry about parallel texts is making me think about using this for a Romance language in the future after I’ve reached fluency in Italian.\n\nIf you wouldn’t mind answering, do you have a set routine at all? Eg Read and listen in the target language for a chapter, read in language you know and listen for a chapter after etc? It’d just be nice to hear specifics from someone who’s obviously had success with a seemingly less extreme version of it 🙂", "created_utc": "1656148765.0", "edited": "False", "id": "ido3v9x", "is_submitter": "False", "link_id": "t3_vjkxg2", "parent_id": "t1_idjlj6k", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "CrossHeather", "body": "Covfefe", "created_utc": "1656139924.0", "edited": "False", "id": "idnti4k", "is_submitter": "False", "link_id": "t3_vjm1k4", "parent_id": "t3_vjm1k4", "score": "1", "subreddit": "ENGLISH", "subreddit_id": "t5_2qjni"}, {"author": "CrossHeather", "body": "America: ‘Pro-life’\n\nAnche America: Ciao persona cui ha 18 anni e ha  problemi di salute mentale. Vorresti un mitragliatrice?", "created_utc": "1656139864.0", "edited": "False", "id": "idntfc4", "is_submitter": "False", "link_id": "t3_vjpoz1", "parent_id": "t3_vjpoz1", "score": "15", "subreddit": "italy", "subreddit_id": "t5_2qkhk"}, {"author": "CrossHeather", "body": "If you are 6 feet 7 inches tall then you must scan the room to see if I’m there. If I am then you need to fight through the crowd so that you end up standing in front of me.\n \nI believe the punishment for not doing this is quite severe based on how often it used to happen in my younger days.", "created_utc": "1656068973.0", "edited": "False", "id": "idjmnmy", "is_submitter": "False", "link_id": "t3_vjhwz3", "parent_id": "t3_vjhwz3", "score": "1", "subreddit": "AskUK", "subreddit_id": "t5_2t4s3"}, {"author": "CrossHeather", "body": "Good to see an opposing view to it. However, I’m just trying to express the viewpoint ‘Don’t stress too much over this. Even an experts says that learning grammar from direct instruction is hard.’\n\nI think like anything, getting expert direction from a brilliant teacher will never be a bad thing. But it’s probably not worth getting frustrated if you can’t quite figure out what verb form to use in some made up grammar book scenarios. Just leave it for now and come back to it in the future and see if it makes more sense.\n\nI used to be a maths teacher and we’d follow a curriculum designed to introduce topics that get gradually harder over the course of 5 years. As a self learner for languages we’re very unlikely to be able to pick an order of topics to learn that well. So my main point really is just accepting that fact and realising some topics can wait until more experience with the language has been gained.", "created_utc": "1656068594.0", "edited": "False", "id": "idjm4r9", "is_submitter": "False", "link_id": "t3_viykvy", "parent_id": "t1_idjbtlm", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "CrossHeather", "body": "Yeah it’s really hard to explain to people who haven’t tried it isn’t it? \n\nThe clearest one I remember was thinking to myself ‘what does it mean when I keep seeing -ebbe’ and looking it up. And now I don’t think I could ever possibly forget how to say he or she could do something. It seems a lot more memorable than a list of examples of the ‘3rd person conditional’ to me at least!", "created_utc": "1656014403.0", "edited": "False", "id": "idh03l5", "is_submitter": "False", "link_id": "t3_viykvy", "parent_id": "t1_idgxrob", "score": "4", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "CrossHeather", "body": "You’ll know better than me being C2, but I’d definitely agree with that. \n\nI might be lucky with Italian being considered one of the easier languages for a native English speaker to learn, but I find looking at the rules and answering questions now a lot easier than when I was learning French at high school many years ago. The teacher kept talking about perfect and pluperfect tenses… I don’t even know what they are in English (or if they even exist!).", "created_utc": "1656012598.0", "edited": "False", "id": "idgvr5y", "is_submitter": "False", "link_id": "t3_viykvy", "parent_id": "t1_idgp2xs", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "CrossHeather", "body": "Do Americans not think this??? 😂", "created_utc": "1656006670.0", "edited": "False", "id": "idghai5", "is_submitter": "False", "link_id": "t3_vix9e7", "parent_id": "t1_idfpofs", "score": "1", "subreddit": "poker", "subreddit_id": "t5_2qhix"}, {"author": "CrossHeather", "body": "Have you tried any graded readers? I used 2 Olly Richards books for Italian and found them useful (it gives instructions on how to read them - which sounds a bit strange, but the method he describes did work well for me). I also simultaneously read a ‘how to’ book on a topic I know well and painstakingly looked up every word. It was horrendous but definitely improved my vocabulary no end.\n\nAfter that I read a few Roald Dahl books. For the first two I used a method of reading a page in Italian, trying to understand it, reading it in English, then in Italian again. \n\nI’ve found since then I never had to use any ‘methods’ again. I just read and looked up the odd word in an Italian-English dictionary if it seemed important or popped up a few times in a row. \n\nI upped the difficulty gradually, moving on to young adult fiction and then novels. I also replaced the use of an Italian to English dictionary with a monolingual ‘dizionario’\n\nThe process described above took me 4 months to get to novels and read them comfortably. So it’s not an overnight success story or anything but seems worth the initial pain of getting through easy readers (you know I never actually hated the Roald Dahl books, I picked them because I’d liked them when I was a kid).\n\nI have done listening practice, but I honestly think the reading is much better for my progress. They just seem to use a much wider vocabulary than the YouTube videos/tv shows I’m watching.\n\nI can now have a reasonably fluent conversation with my tutor as well, so it’s not just reading ability that improves.", "created_utc": "1656002870.0", "edited": "False", "id": "idg7u2k", "is_submitter": "False", "link_id": "t3_viybap", "parent_id": "t3_viybap", "score": "9", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "CrossHeather", "body": "I don’t want to be that guy who treats everything Krashen says as gospel… but if a linguist of that level states ‘our ability to consciously learn the rules of grammar is very limited’ then I’m inclined to say try not to worry about it too much.\nhttp://www.sdkrashen.com/content/articles/teaching_grammar_why_bother.pdf\n\nWhat I have found helpful is only starting to flick through a grammar book once I reached a level where I could read in my TL pretty well. Each chapter is now a case of me seeing things and thinking ‘that’s why they do that’ rather than trying to memorise yet more things.", "created_utc": "1655999936.0", "edited": "False", "id": "idg0g1p", "is_submitter": "False", "link_id": "t3_viykvy", "parent_id": "t3_viykvy", "score": "16", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "CrossHeather", "body": "I think it depends on your goals too. I was happy to learn how to understand before speaking so I ended up settling with target language in front and native on the back only. I used these until I was able to read most things reasonably comfortably then got rid of them. I’m of the opinion that the time spent doing those cards is better spent reading/listening once you’ve reached a stage where you understand most words when reading/listening.\n\nI know use native to target but very selectively (2 cards a day), and this is more for formulating entire sentences rather than individual words. \n\nOther than that I have some verb conjugation cards (6 a day) - Both languages on the front (example sentences with the conjugation missing from the target language) including the infinitive of the verb - and some collocation cards (5 a day) - sentences with collocations in bold - written in target language only (they don’t even have a reverse, they’re just for exposure to correct groupings of words). With this in mind I’m pretty sure you would be able to use basic and reverse cards then find a way to make them one way only if you ever wanted to in the future.\n\nBit of a ramble but my main point is try out different things and don’t be afraid to suspend cards (make sure you use tags or sub decks to allow you to do this to a lot of cards of one type quickly). Anki is a very personal thing in my opinion and everybody has different needs. For me my main goal is to avoid Anki becoming anything more than a 20 minute (less preferably!) or so ‘warm up’ each day focused on areas I feel I need the most help in. Other people will happily spend hours answering cards on vocab. If it works for them then fair play! The people I can’t understand are those who feel trapped by their Anki sessions; just delete it if it’s putting you off the language.. it’s only one of many tools available.", "created_utc": "1655986366.0", "edited": "False", "id": "idf6uc0", "is_submitter": "False", "link_id": "t3_viuuqr", "parent_id": "t3_viuuqr", "score": "7", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "CrossHeather", "body": "Yeah, I was going to comment something similarly enthusiastic about reading. \n\nI’ve gone from being a false beginner in Italian just about coping with a short stories for learners collection in January to reading novels - I’m currently reading a paperback copy of 1984, and an ebook version of Misery - and the improvement in 3 of the 4 main skills (reading, listening, speaking… I don’t really do any writing) has been insane.\n\nI’m not fluent by any means, but I can find YouTubers I understand, understand animated series on Netflix (the ones aimed at adults, like Bojack Horseman), have a conversation for an hour with my tutor with only a few stops here and there for translations etc.\n\nI can’t speak highly enough of reading for most of the time you allocate to learning a language. Throw in audiobooks of things you’ve read when walking/driving and the listening practice you describe and it’s crazy how quickly you can improve without it ever seeming like a chore.", "created_utc": "1655975796.0", "edited": "False", "id": "idesjjt", "is_submitter": "False", "link_id": "t3_vic9ai", "parent_id": "t1_ideay84", "score": "6", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "CrossHeather", "body": "I’d even stress the reading side of things more. Being battered in the face with words every day is pretty much guaranteed to see a massive improvement in a few months if you’re doing a Romance language as an English speaker. \n\nIt also has the added benefit of every new grammar rule/conjugation you look up being a ‘ohhhh that’s what that was’ moment rather than yet another thing to try and memorise.", "created_utc": "1655969434.0", "edited": "False", "id": "idelcwc", "is_submitter": "False", "link_id": "t3_viguzu", "parent_id": "t3_viguzu", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "CrossHeather", "body": "If you can type all of that without looking up more than a few words it’s a safe bet you’re ‘fluent’ in English. Fluent enough to tell that person to ‘do one’ anyway.", "created_utc": "1655969020.0", "edited": "False", "id": "idekvge", "is_submitter": "False", "link_id": "t3_vi8tgd", "parent_id": "t3_vi8tgd", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "CrossHeather", "body": "It’s better to watch a load of Friends because you love it, than to watch a handful of something you aren’t interested in because it’s not dubbed.", "created_utc": "1655330294.0", "edited": "False", "id": "icibrm9", "is_submitter": "False", "link_id": "t3_vczhnr", "parent_id": "t3_vczhnr", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "CrossHeather", "body": "This. I read 2 collections of short stories for language learners, and I don’t think I could even look at another.  😂", "created_utc": "1655050471.0", "edited": "False", "id": "ic3n97p", "is_submitter": "False", "link_id": "t3_vaf0fh", "parent_id": "t1_ic2ydc5", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "CrossHeather", "body": "If you know no German then Easy German on YouTube is probably worth a look.", "created_utc": "1654941372.0", "edited": "False", "id": "ibyipp5", "is_submitter": "False", "link_id": "t3_v9thqg", "parent_id": "t3_v9thqg", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "CrossHeather", "body": "I think a lot of it is down to confidence. I always believed I could never learn a language until I gave extensive reading a go at the age of 35, and I think pretty much every English person I know (that isn’t a language teacher or spent some of their childhood abroad) has that same opinion - that learning a language is ‘impossible’. And I worked with a lot of people who lived in Spain for at least a couple of years (admittedly they worked in Gibraltar where English was the language used in the office and all emails etc).\n\nQuite why we all have this collective lack of confidence in our abilities I don’t know. At school I did French for 5 years, which seemed to consist of me learning enough vocabulary or phrases such as ‘Ou est la piscine?’ to pass tests but having no real ability to understand or converse in the language. I got an A at GCSE but never felt any confidence in my chances of being able to speak French, so I dread to think how the majority of people who got lower grades felt.", "created_utc": "1654263970.0", "edited": "False", "id": "ib1bby2", "is_submitter": "False", "link_id": "t3_v3wyso", "parent_id": "t3_v3wyso", "score": "0", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "CrossHeather", "body": "I’m learning Italian, which is probably less ‘useful’ than French, Spanish or German - just examples of languages more commonly taught in English schools - if usefulness is counted in number of speakers.\n\nBut because I am pretty desperate to learn Italian - my grandad was Italian, and I have a very Italian name and appearance. Which means I’ve been asked about a million times if I speak Italian and it’s always annoyed me having to say no - I was willing to subject myself to reading, listening and watching things I don’t understand for a few months without quitting. I now feel pretty close to fluency. It’s the first time in my life I feel confident that I will one day be fluent in the language I am learning. So the way I see it is, surely it’s more ‘useful’ to learn a language I will stick with, and become fluent rather than learn a few phrases in a more popular language and give up when I can’t understand what is being said back to me (like my French and Spanish studies in the past 😂)\n\nAnd the thing is, by learning the language I really want to learn first, I’m developing confidence that I can learn languages. In a strange way if I ever needed to know French or Spanish in the future, I am now 100% confident I would be able to, all thanks to my success in Italian. Which is solely down to a strong desire overcoming uncomfortableness.", "created_utc": "1653825756.0", "edited": "False", "id": "iaf29dc", "is_submitter": "False", "link_id": "t3_v06bfo", "parent_id": "t3_v06bfo", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "CrossHeather", "body": "Nice routine.This is like mine on steroids really. I have a ‘bare minumum’ then chuck in other things around it as a bonus if possible.\n\n‘Bare minimum’\nAnki cards in the morning (I tend to be first one up in the household and this feels like a good ‘warm up’). \n\nOne or two newspaper articles for 15 minutes on a morning break. I tend to copy and paste bits to make Cloze anki cards from these.\n\nLunchtime. 45 minutes of an audio book while walking, or a DVD/Stream while using an indoor exercise bike.\n\n30 minutes with headphones on of an audiobook/DVD/stream while waiting for my young son to drop off to sleep. My wife and I try to make as little noise as possible at this stage so seems a good way to sneak in some Italian without \n\nOne chapter of a physical book in bed before sleeping.\n\n‘Bonus’ activities are really just things like listening to radio while I’m working (I’m a a programmer so can get away with this. Sitting with headphones on is practically encouraged in the office 😂), doing some grammar study on rare occasions, watching a film when I have an evening to myself etc, having a weekly lesson.\n\nI was sceptical about input being so powerful before trying it, but it’s bloody amazing isn’t it really.", "created_utc": "1653396731.0", "edited": "False", "id": "i9suw3c", "is_submitter": "False", "link_id": "t3_ugmmpx", "parent_id": "t1_i74dfle", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "CrossHeather", "body": "In Inghilterra non ne parliamo, perché molte medaglie d’oro possono essere vinte in questo modo. (Rowing, equestre, vela ecc)", "created_utc": "1651468874.0", "edited": "False", "id": "i6ztj4r", "is_submitter": "False", "link_id": "t3_ug8ahy", "parent_id": "t3_ug8ahy", "score": "2", "subreddit": "Italia", "subreddit_id": "t5_2rbm5"}, {"author": "CrossHeather", "body": "What a hero, I needed this list myself!", "created_utc": "1651239558.0", "edited": "False", "id": "i6nxupf", "is_submitter": "False", "link_id": "t3_ueb8hr", "parent_id": "t1_i6niqjb", "score": "2", "subreddit": "italianlearning", "subreddit_id": "t5_2tuxf"}, {"author": "CrossHeather", "body": "Just wanted to say thanks for mentioning this Cloze generator. Looks very useful!", "created_utc": "1651001597.0", "edited": "False", "id": "i6b1k76", "is_submitter": "False", "link_id": "t3_uc9ihz", "parent_id": "t1_i69gln9", "score": "1", "subreddit": "Anki", "subreddit_id": "t5_2s9lm"}, {"author": "CrossHeather", "body": "It’s helped me no end in Italian since the start of the year. (I made it my New Years resolution to finally become fluent in Italian and decided that getting good at reading it was going to be the only way that would work for me). As people have alluded to my experience is probably helped by my target language being one of the supposed easier to learn for an English native speaker.\n\nIt’s bloody hard at first, but once you reach a point where you can follow a story easily enough then it’s like a cheat code for language learning because there is now an activity that is fun to do and requires zero willpower to motivate yourself to do. I’m now exposing myself to masses of vocabulary and sentence structures without ever having to use any discipline up. I’m reading books written from first and third person points of view, in present and past tense etc. I’m reading non fiction and getting battered with my target languages versions of things like ‘otherwise’, ‘therefore’, ‘moreover’ etc etc etc. For the first time in my life I feel like understanding another language is actually possible. To be honest, I’m actually shocked there are a handful of people out there trying to discourage people from trying it out.\n\nI can see why people would be skeptical though. The main proponents of the idea of ‘reading = fluency’ on YouTube/language learning websites seem to also throw in the additional ‘but you must understand x% of the words, so you need graded readers’. And then guess what… they have graded readers for sale.", "created_utc": "1650834586.0", "edited": "False", "id": "i61rar9", "is_submitter": "False", "link_id": "t3_uazqwx", "parent_id": "t3_uazqwx", "score": "5", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "CrossHeather", "body": "Well I am English so it helps 🙂\nTrying to write the same in my target language would take me forever…", "created_utc": "1650793979.0", "edited": "False", "id": "i5zf0tm", "is_submitter": "False", "link_id": "t3_ua4qvn", "parent_id": "t1_i5yciw6", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "CrossHeather", "body": "Your tactics are obviously working to some degree, because what you are writing is pretty damn good.\n\nI think though, reading books and articles is always going to be a more accurate representation of ‘proper’ English just because it’s been carefully written, then checked by the person who wrote it and finally an Editor has probably gone through it and made it even better.\n\nThe main problem with a forum like Reddit is any idiot (like myself) can be posting on here and they probably aren’t checking their posts before submitting them.\n\nIf you enjoy it though, and just keep the above in mind, I don’t see what real harm it would do to use Reddit as your prime source of input.\n\nEg: I read through the above quickly and noticed a capital E in the word ‘editor’. That’s a mistake, but even if you saw that, I’d imagine you’d have seen other job titles before and realise that they were never capitalised, so maybe that idiot who has written a job title starting with a capital letter is wrong here. You just have to bear in mind things like that in my opinion.", "created_utc": "1650737726.0", "edited": "1650737941.0", "id": "i5wl8jb", "is_submitter": "False", "link_id": "t3_ua4qvn", "parent_id": "t3_ua4qvn", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "CrossHeather", "body": "Just don’t use ‘y’all’ when speaking to an non-American and you’ll be fine 🙂 Honestly, using no slang is much better than using too much (and any might in fact be too much). \n\nSlang is usually localised and just sounds wrong if it’s in the wrong accent. For example, let’s say somebody learning English decided to watch a London gangster film and start calling me ‘blud’ and ‘fam’. I think I’d throw up on their shoes if they didn’t have a cockney accent. In fact they’d sound like a complete moron to me even if they did have a cockney accent. And just to prove how dangerous the whole slang thing is, I’m basically referring to cockneys being from the entirety of London which is fine in my home town, but would make somebody from ‘darn sarf’ spontaneously combust from pure rage because my use of ‘cockney’ is actually not that which is defined in the dictionary. (I think the actual definition is ‘A person that can watch Eastenders without wanting to throw themselves off a balcony’)\n\nThe random knowledge you need to use slang properly just isn’t worth it. For example, someone from the north west of England might call their friends ‘soft lad’, but wouldn’t say it to a random person from a different town because they know the other person would be completely bewildered by the phrase. And what gain are they really getting from using the term ‘soft lad’?\n\nAnd finally, being funny in English is easy. Just insult people. The more friendly with someone you are, the more you are allowed to insult them. The more insulting the comment, the funnier it is. (Disclaimer: I can only speak for the UK. Maybe Americans don’t introduce their friends as ‘This is my mate Dave. He’s a right c***’ for example)", "created_utc": "1650736649.0", "edited": "1650737040.0", "id": "i5witt9", "is_submitter": "False", "link_id": "t3_u9sb9q", "parent_id": "t3_u9sb9q", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "CrossHeather", "body": "My Italian has improved dramatically from reading over the last 3 months. I’d definitely agree it’s excellent to learn by reading.\n\nI started off with a couple of Olly Richard’s books. They are good practice for being comfortable with not knowing everything (he lays out suggestions for how to read the book in the introduction), and maybe I wouldn’t be reading Italian books comfortably now if it wasn’t for those. Once I’d done with those though I couldn’t bare the thought of any more material aimed at language learners rather than native speakers.\n\nAfter those I read a few childrens books (Roald Dahl). For the first two books it seemed practically impossible at first… but I read a chapter in Italian, then in English, then in Italian and found once I’d done that for a few chapters I no longer needed to. Everything just started making sense. \n\nAfter that, it all just seems easier. Young adult fiction now seems very comprehensible (Hunger Games for example) and I can read news articles from ilpost.it etc.\n\nI think you just start getting used to certain things. It feels like a massive battle at first but once it clicks you feel like you’ve unlocked a cheat code in the language learning process. Just give it a go and see what happens would be my advice 🙂\n\nFor unknown words I only look them up if I feel I need to to understand what’s happening. If a word seems to be relatively useful I add it to anki. I limit myself to 5 of these a chapter so that I’m really selective with what I’m looking up.", "created_utc": "1650225067.0", "edited": "1650225393.0", "id": "i54cb27", "is_submitter": "False", "link_id": "t3_u5i7q2", "parent_id": "t3_u5i7q2", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "CrossHeather", "body": "Heritage, my grandad was Italian and I’ve always wanted to learn it.", "created_utc": "1649962831.0", "edited": "False", "id": "i4qiokn", "is_submitter": "False", "link_id": "t3_u3eku3", "parent_id": "t3_u3eku3", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "CrossHeather", "body": "I had to comment just to say thank you for wiki books! Can’t believe I never knew of this.", "created_utc": "1649660750.0", "edited": "False", "id": "i49k63l", "is_submitter": "False", "link_id": "t3_u0qgc3", "parent_id": "t3_u0qgc3", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "CrossHeather", "body": "Sorry for the long list, but hopefully something in here you’ll find useful.\n\nSomebody has mentioned Charlie and the Chocolate Factory above. If you read Roald Dahl books as a kid then all of them are worth a look really.\n\nI read Gli Sporcelli (The Twits), Furbo, il signore Volpe (Fantastic Mr Fox) and Le Streghe (The witches) all comprehensible after reading a couple of Ollie Richards short story for beginner books.\n\nAfter that I was able to read Lo strano caso del cane ucciso a mezzanote (the curious incident of the dog in the night time by Mark Haddon).\n\nI also read a couple of poker books which I found okay because the advice was pretty much what I’d seen before and the words used are repeated quite often. The good thing with non fiction is you see a lot of sentence filler words like nonostante, soppratutto, inoltre etc etc and get a good feel of how to use them. I guess like a learner of English would need to read nonfiction to get a true feel of ‘not withstanding’, ‘above all’, and ‘in other words’. I think ‘how to’ books about something you know reasonably well are always going to be a decent starting place even if they aren’t going to batter you with as much vocabulary as fiction would do.\n\nI’m currently reading a book called ‘Azzurro 2006 - Un Riscatto Mondiale’ which is easy enough for me to understand. I like football and have good memories of Italy winning that World Cup so that probably helps.\n\nI’m also reading Il Dottore Jeckyll and Mr Hyde, but I’ve had to admit defeat and buy the English version of that. (So I’ll read a chapter in Italian, read it in English then read it in Italian again). If you love 19th century fiction then go for it, but I certainly won’t be rushing to buy any more translations of Victorian works again. Having said that…. I just remembered that I had to do this for the first 2 or 3 chapters of the first two Roald Dahl books I mentioned. (I guess once you’ve got your head around the introduction the rest just follows)", "created_utc": "1649079758.0", "edited": "1649081131.0", "id": "i3cnjdk", "is_submitter": "False", "link_id": "t3_tqac5v", "parent_id": "t3_tqac5v", "score": "2", "subreddit": "italianlearning", "subreddit_id": "t5_2tuxf"}, {"author": "CrossHeather", "body": "Incastrati (or as it’s titled in English ‘Framed - A Sicilian Murder mystery) was something I found comprehensible with the Italian subs on on Netflix. It’s a comedy (admittedly a bit slapstick and silly at times), but I found it funny, entertaining and easy to follow.\n\nFor context I’m nowhere near fluent, i came back to Italian as a false beginner in the middle of January and have been learning by mostly reading since then.", "created_utc": "1649078475.0", "edited": "False", "id": "i3cktax", "is_submitter": "False", "link_id": "t3_tje4pu", "parent_id": "t3_tje4pu", "score": "1", "subreddit": "italianlearning", "subreddit_id": "t5_2tuxf"}, {"author": "CrossHeather", "body": "Try searching for ‘diabetic socks’ on Amazon. My mother bought some after getting diagnosed with T1D (she’s a bit crazy, but her hearts in the right place) and they would probably do the trick,", "created_utc": "1647991221.0", "edited": "False", "id": "i1q6u4b", "is_submitter": "False", "link_id": "t3_tkdnjr", "parent_id": "t3_tkdnjr", "score": "3", "subreddit": "Autism_Parenting", "subreddit_id": "t5_3mosq"}, {"author": "CrossHeather", "body": "The ability to choose a transfer before the deadline without it having to go through straight away. Instead you are saying ‘if I don’t cancel this transfer before the deadline then I want it in place for the upcoming gameweek’\n\nIf you don’t have enough money after price moves it doesn’t happen.", "created_utc": "1647886426.0", "edited": "False", "id": "i1k60ou", "is_submitter": "False", "link_id": "t3_tja5it", "parent_id": "t3_tja5it", "score": "1", "subreddit": "FantasyPL", "subreddit_id": "t5_2snvr"}, {"author": "CrossHeather", "body": "I’m sure the destruction of a railway station is the least of your worries at the moment, but I’m so sorry our countries are doing f*** all to help. I don’t think our leaders can even comprehend just how much it would affect our selfish interests if you guys don’t beat this bastard. I can’t believe you’re being left to do it all by yourselves.", "created_utc": "1647789820.0", "edited": "False", "id": "i1eur14", "is_submitter": "False", "link_id": "t3_tie8l8", "parent_id": "t1_i1dgqkp", "score": "0", "subreddit": "ENGLISH", "subreddit_id": "t5_2qjni"}, {"author": "CrossHeather", "body": "It gives me no pleasure at all to say that I would be expecting to hear ‘had’ rather than ‘have’. \n\nIt would have been ‘have’ before that insane, small penis owning, excuse of a human being, idiotic, psychotic, wankstain that happens to be dictator of one of the few nuclear powers decided to destroy it. \n\nKnowing the English language I’m sure an expert will be able to say why ‘have’ is fine, but it wouldn’t sound right to my ears. \n\nI’m not quite sure ‘intimate connection’ quite works in terms of referring to something that isn’t another person either. Maybe in a novel, but not in non literary use of the language. I think more likely phrases would be things such as:\n\n‘I used to love it there’\n‘I loved it there’\n‘That place/building was (any adjective you like)’\n\n\nI think the reason ‘had an intimate connection with’ sounds wrong is it’s a few too many words to explain quite a simple concept. It also sounds like a weird clash of the active and passive voice, where you own the feeling but the building is doing it to you.", "created_utc": "1647789636.0", "edited": "False", "id": "i1eub80", "is_submitter": "False", "link_id": "t3_tie8l8", "parent_id": "t3_tie8l8", "score": "2", "subreddit": "ENGLISH", "subreddit_id": "t5_2qjni"}, {"author": "CrossHeather", "body": "No problem 🙂. It’s definitely an eye opener isn’t it.", "created_utc": "1646861465.0", "edited": "False", "id": "i00wbts", "is_submitter": "False", "link_id": "t3_taft7u", "parent_id": "t1_i00uhd6", "score": "3", "subreddit": "Autism_Parenting", "subreddit_id": "t5_3mosq"}, {"author": "CrossHeather", "body": "I haven’t gone through the process…. That’s just my personal choice but I understand why others would.\n\nIf you can find it and haven’t seen it the documentary BBC showed ‘Paddy and Christine McGuiness: Our Family And Autism’ is worth a watch. It was basically what pushed me to google the Cambridge QA, which is a questionnaire that is designed to tell you if you have autism. The mother of the family took that and found she had autism, I took it and got one less point than her, so think that I would be able to get a diagnosis too if I really wanted one.\n\nAll in all it’s just helped me realise why I’ve found certain things difficult throughout my life, and why I felt the way I felt in certain situations. I once found my school reports from ages 4 to 11 and the changes from ‘this kid is really really struggling’ to ‘this kid is a mathematical prodigy’  all suddenly make a lot more sense.\n\nAnyway I’m rambling, but the realisation has helped me forgive myself for past behaviour I was always embarrassed about and also has given me this big acceptance of the process he is going through. Yes he will now have a label I avoided, but he’ll also have a lot more support and hopefully just be a lot happier than I was as a kid.", "created_utc": "1646857845.0", "edited": "False", "id": "i00mtzp", "is_submitter": "False", "link_id": "t3_taft7u", "parent_id": "t3_taft7u", "score": "16", "subreddit": "Autism_Parenting", "subreddit_id": "t5_3mosq"}, {"author": "CrossHeather", "body": "To be honest if you aren’t finding people adjust correctly then have at it 😂\n\nWhat people should be doing is either tightening up their opening ranges, then calling down with everything and letting you barrel off at their slow played monsters… or 4 betting a polarised range.\n\nIf nobody is doing either of those things then you’re just exploring them in the correct manner to be fair (though 40% is intriguing 😂 that’s like Q5s)", "created_utc": "1641657543.0", "edited": "False", "id": "hrsfafr", "is_submitter": "False", "link_id": "t3_rytelg", "parent_id": "t3_rytelg", "score": "1", "subreddit": "poker", "subreddit_id": "t5_2qhix"}, {"author": "CrossHeather", "body": "Think Dara O’Keaney was in his 40s when he went pro? I have no idea how good he is, I’ve heard of him through his books, but a modern example for you at least.", "created_utc": "1641544504.0", "edited": "False", "id": "hrm3jc3", "is_submitter": "False", "link_id": "t3_rxn1sq", "parent_id": "t3_rxn1sq", "score": "1", "subreddit": "poker", "subreddit_id": "t5_2qhix"}, {"author": "CrossHeather", "body": "My thought process is this…\n\nIf a player limp calls from early/mid position they’re usually bad. If I’m playing somebody bad, they usually call too much.\n\nI’m betting about 30% pot on the turn to get value from all lower PPs but more likely all the absolute junk hands he limp called with that hit a pair on the board or have 2 clubs.\n\nIf he check raises the turn I’m time banking and thinking through whether this guy has raised a lot (to be honest I normally wouldn’t be in this scenario if it wasn’t someone I’d deemed a calling station anyway, but best to take time to think if your tournament is on the line). Most of the time I’m folding because I’ve specifically bet into this guy because I don’t believe he check raise bluffs enough.\n\nDon’t think he’ll call because of odds on the turn by the way? He’ll have heard of implied odds, trust me, he’s not folding 2 clubs.\n\nIf he bets into me on the river, then I’m folding. I can’t see a scenario where I bet the river if a club comes in, and to be honest the board is scary enough for me to be wary of slow played hands as it is. I’m checking behind the vast majority of the time here.\n\nThis way I’ve bought the showdown on the turn. I’ve got a bit more value from worse hands, and saved some money from calling against players who don’t bluff all that often.\n\nIs this line very exploitable? Yes! But I think in the bizarre world someone regularly limp calls to make me think they’re a calling station, that person is costing themselves a lot more long term by not open raising.\n\nAs everyone has said KK is basically a bluff catcher on this board. I would not play this way against the majority of players. But based on your replies to others suggestions I think you thought there was value to be had, and I agree based on the limp call. \n\nCould somebody be limp calling pre flop to trick me into thinking they’re the kind of player who will barely bluff? Possibly (but let’s be honest, not really). But I think they’re losing far more than they gain by doing that.", "created_utc": "1641543733.0", "edited": "False", "id": "hrm2hv1", "is_submitter": "False", "link_id": "t3_rxyat2", "parent_id": "t3_rxyat2", "score": "2", "subreddit": "poker", "subreddit_id": "t5_2qhix"}, {"author": "CrossHeather", "body": "My thought would be, is he really opening 20% from UTG at this stage of the tourney, as 3 bet seems light if he’s tightening up? Or is that something you’ve seen from early stages when everyone is deep stacked? Nobody knocking around with a 20BB kind of stack waiting for a good opportunity to shove over the top of light openers?", "created_utc": "1634232076.0", "edited": "False", "id": "hgmu851", "is_submitter": "False", "link_id": "t3_q7ej6a", "parent_id": "t3_q7ej6a", "score": "1", "subreddit": "poker", "subreddit_id": "t5_2qhix"}, {"author": "CrossHeather", "body": "Agreed. Hence why it seems so strange to people not under the influence of paranoia inducing drugs I guess. \n\nI’m not a psychologist and I’ve never done any drugs (unless you count alcohol and caffeine) but I suspect some part of them knows they’re being ridiculous and they want the ‘no I’m not a police officer, I’m not going to arrest you’ for reassurance? 🤷‍♂️", "created_utc": "1630755727.0", "edited": "False", "id": "hbk41n4", "is_submitter": "False", "link_id": "t3_phngsv", "parent_id": "t1_hbk3bzk", "score": "4", "subreddit": "london", "subreddit_id": "t5_2qkog"}, {"author": "CrossHeather", "body": "I think you were right to do what you did. I’ve had a fair few people try and start issues with me in the past and the only time trouble has actually started is when I’ve been passive. \n\nMost people who act like this are bullies looking for easy targets in my opinion.\n\nNow, if the guy has a load of friends with him then that’s a different kettle of fish. He’s obviously going to not let his pride be bruised in front of his scum bag mates. Only thing I find that works in those situations is calling the police, odds are at least one of them has a record and most people aren’t going to want to chance that they can carry out whatever aggression they had planned before the police turn up.", "created_utc": "1630755232.0", "edited": "False", "id": "hbk3czt", "is_submitter": "False", "link_id": "t3_phngsv", "parent_id": "t1_hbjt92e", "score": "8", "subreddit": "london", "subreddit_id": "t5_2qkog"}, {"author": "CrossHeather", "body": "I had someone ask me if I was undercover once. (Whilst getting into my car after a doctors appointment). Just felt really ‘off’ as I was minding my own business, and hadn’t noticed the guy before he approached me.\n\nGuess it’s a relatively common drug fuelled paranoia?", "created_utc": "1630754772.0", "edited": "False", "id": "hbk2qlp", "is_submitter": "False", "link_id": "t3_phngsv", "parent_id": "t3_phngsv", "score": "1", "subreddit": "london", "subreddit_id": "t5_2qkog"}, {"author": "CrossHeather", "body": "Not seeing any mention of Yubikeys? People not like them, or they just not that well known?\n\nTo be honest, once all the Binance regulation noise kicked off I decided to keep all my crypto off exchanges.", "created_utc": "1629876093.0", "edited": "False", "id": "ha9kryg", "is_submitter": "False", "link_id": "t3_paus12", "parent_id": "t3_paus12", "score": "1", "subreddit": "Bitcoin", "subreddit_id": "t5_2s3qj"}, {"author": "CrossHeather", "body": "Good god, this is amazing.", "created_utc": "1627893881.0", "edited": "False", "id": "h7eqapu", "is_submitter": "False", "link_id": "t3_omajgg", "parent_id": "t3_omajgg", "score": "13", "subreddit": "FantasyPL", "subreddit_id": "t5_2snvr"}, {"author": "CrossHeather", "body": "I trust this story as much as the one where he says he killed a bear with his bare hands.", "created_utc": "1624604308.0", "edited": "False", "id": "h2yy04x", "is_submitter": "False", "link_id": "t3_o75whu", "parent_id": "t3_o75whu", "score": "1", "subreddit": "ethtrader", "subreddit_id": "t5_37jgj"}, {"author": "CrossHeather", "body": "Heat", "created_utc": "1624485072.0", "edited": "False", "id": "h2tfcn7", "is_submitter": "False", "link_id": "t3_o6ia10", "parent_id": "t3_o6ia10", "score": "2", "subreddit": "Bitcoin", "subreddit_id": "t5_2s3qj"}, {"author": "CrossHeather", "body": "The impact is oversold IMO. Look at market cap of tether, look at market cap of Bitcoin. Then tell me which one of the two should be scared of the collapse of the other.", "created_utc": "1624484862.0", "edited": "False", "id": "h2tewr7", "is_submitter": "False", "link_id": "t3_o6iep2", "parent_id": "t3_o6iep2", "score": "1", "subreddit": "Bitcoin", "subreddit_id": "t5_2s3qj"}, {"author": "CrossHeather", "body": "Few factors already mentioned as to why it probably costs more to operate a supermarket business in the UK. Would farming standards also play a small part? [https://www.which.co.uk/news/2020/07/uk-vs-us-farming-whats-the-difference/](https://www.which.co.uk/news/2020/07/uk-vs-us-farming-whats-the-difference/)\n\nI imagine our 'higher' standards of farming cost more, which leads to higher food prices, which leads to less profit. \n\nTo be honest though after trying Ocado out a few times, I'm convinced it will be the platform of choice for the future 'middle classes'. No substitutions and M and S food without having to put up with the overcrowding their supermarkets always seem to have.", "created_utc": "1623937276.0", "edited": "False", "id": "h236hx6", "is_submitter": "False", "link_id": "t3_o1s8x2", "parent_id": "t3_o1s8x2", "score": "2", "subreddit": "UKInvesting", "subreddit_id": "t5_2x42i"}, {"author": "CrossHeather", "body": "Tether's market cap (based on coingecko) is $60 billion, while crypto as a whole is $1.6 trillion. I make that 4% of the entire market cap of crypto 'belongs' to Tether. (Please correct me if my maths is wrong... a 0 out of place here has massive implications, and I was raised on a billion being a million million in the UK!).\n\nIf 4% of the entire market was rugpulled over night that would start a period of panic for sure. But given the stuff crypto has survived to get this point, is really anything that insane to blow up the whole asset class like some are saying? I imagine a good chunk of that 4% would have been cashed in by that point anyway as people start doing a modern day version of a bank run on Tether. There will of course be quite a few wealthy people/instituations willing to risk holding the bag while this is going on also, who would start snapping Tether up at 90c on the $, then 80c  etc.\n\nCertainly not fud to be sceptical of Tether, but certainly wouldn't use it as a reason to change my long term view of crypto. Its just evidence that we are still very much in the wild west days of this, and you need to be exceptionally careful who you trust. And definitely worth considering getting rid of Tether if you hold it, I certainly wouldn't keep hold of it thinking 'well if this goes to 0, everything goes to 0' as that just isn't true.", "created_utc": "1623935297.0", "edited": "False", "id": "h232o0c", "is_submitter": "False", "link_id": "t3_o1fuw4", "parent_id": "t3_o1fuw4", "score": "1", "subreddit": "CryptoCurrency", "subreddit_id": "t5_2wlj3"}, {"author": "CrossHeather", "body": "Yes the vehicle to property % would be interesting. Imagine it’s not that high with the post office being a separate company?", "created_utc": "1623564637.0", "edited": "False", "id": "h1lgd2u", "is_submitter": "False", "link_id": "t3_nxtg0p", "parent_id": "t1_h1ifm5p", "score": "1", "subreddit": "UKInvesting", "subreddit_id": "t5_2x42i"}, {"author": "CrossHeather", "body": "Assuming those market cap, asset and liabilities figures are all correct then seems a pretty good arb…\n\nGuess it depends what the assets are? But on those figures the business itself is actually being valued at a negative figure right? Seems a bit strange.", "created_utc": "1623498233.0", "edited": "False", "id": "h1i9ec9", "is_submitter": "False", "link_id": "t3_nxtg0p", "parent_id": "t3_nxtg0p", "score": "2", "subreddit": "UKInvesting", "subreddit_id": "t5_2x42i"}, {"author": "CrossHeather", "body": "Surely it’s like anything else? Have a percentage of your portfolio you think should be allocated to it and rebalance accordingly?", "created_utc": "1622378139.0", "edited": "False", "id": "gzywr08", "is_submitter": "False", "link_id": "t3_nl1dqq", "parent_id": "t3_nl1dqq", "score": "1", "subreddit": "UKInvesting", "subreddit_id": "t5_2x42i"}]