[{"author": "DallOggs", "body": "Not gonna lie, if it was asbestos, pinching your nose and wiping with wet toilet paper probably wasn’t the optimal course of action. Just for next time", "created_utc": "1663681007.0", "edited": "False", "id": "ip6xv55", "is_submitter": "False", "link_id": "t3_xj0lin", "parent_id": "t1_ip5v0q2", "score": "5", "subreddit": "asbestoshelp", "subreddit_id": "t5_4i4ldp"}, {"author": "DallOggs", "body": "Tute*", "created_utc": "1663485200.0", "edited": "False", "id": "iowbyds", "is_submitter": "False", "link_id": "t3_xgqfqc", "parent_id": "t3_xgqfqc", "score": "1", "subreddit": "unimelb", "subreddit_id": "t5_2smf4"}, {"author": "DallOggs", "body": "To give you an example, Australia and New Zealand. The two countries are similar in a lot of ways, but there are a lot more businesses in Australia since it is a lot bigger. Much easier to set 10 demos a month there than to do the same in NZ.", "created_utc": "1662963569.0", "edited": "False", "id": "io3ckdb", "is_submitter": "True", "link_id": "t3_xc4o2v", "parent_id": "t1_io3ao7h", "score": "1", "subreddit": "sales", "subreddit_id": "t5_2qib3"}, {"author": "DallOggs", "body": "I would like to quibble with this comment.\n\nOf course, I agree with sdave001 that you are still much more likely to die of something non-asbestos related than something asbestos related.\n\nBut it is not true that your risk is no higher than background exposure levels. And sdave001 defeats himself here by recommending you get yearly chest X-rays (which you certainly should, by the way). If your risk were no higher than background levels, then you would not need this. If your risk after a single large exposure were no higher than background levels, yet you needed yearly X-rays, then we would ALL need yearly chest X-rays, even those of us who’ve only ever had background level exposure. Since this is not the case, it follows that your risk is higher.\n\nI’m not saying you should worry though — if you think that, re-read the first part of my comment. \n\nWorking in construction law, I see too often people who think once doesn’t matter, but it does (albeit probably only a little bit). \n\nThe answers on this thread are usually excellent at identifying asbestos or the possibility of it’s presence, but in my opinion they sometimes understate the risks. Which is great for calming down people who would overreact, but not necessarily for providing the most accurate factual statements.", "created_utc": "1661433267.0", "edited": "False", "id": "ilq9p3t", "is_submitter": "False", "link_id": "t3_wwyv7q", "parent_id": "t1_ilo2qn8", "score": "1", "subreddit": "asbestoshelp", "subreddit_id": "t5_4i4ldp"}, {"author": "DallOggs", "body": "Where are you located? In many jurisdictions strata titled buildings must have an asbestos register and must make the register accessible to occupants upon request. (Based on spelling, I’ll guess you’re in Australia?)\n\nAn unrenovated apartment building from the 70s probably contains asbestos somewhere (in the fire doors, say) but this is not necessarily a hazard if it is all sealed off and safely managed. Definitely worth keeping in mind though if you see tradies going to town on the place without taking any precautions.", "created_utc": "1661046144.0", "edited": "False", "id": "il52ix9", "is_submitter": "False", "link_id": "t3_wtn8i7", "parent_id": "t3_wtn8i7", "score": "3", "subreddit": "asbestoshelp", "subreddit_id": "t5_4i4ldp"}, {"author": "DallOggs", "body": "Monitor Deloitte", "created_utc": "1661044717.0", "edited": "False", "id": "il4zlv5", "is_submitter": "False", "link_id": "t3_wtdgb0", "parent_id": "t3_wtdgb0", "score": "18", "subreddit": "consulting", "subreddit_id": "t5_2r121"}, {"author": "DallOggs", "body": "Machado de Assis, Memórias Póstumas de Brás Cubas.\n\nI was completely stunned when I read it — the man is a genius.\n\nBlack author in the 1800s in Brazil, grandson of slaves, but this guy somehow managed to learn many languages, get to grips with a whole tradition of literature and philosophy, and write one of the most heartwarming and quirky novels of all time (imo).", "created_utc": "1660597507.0", "edited": "False", "id": "ikfmlx8", "is_submitter": "False", "link_id": "t3_wovejw", "parent_id": "t3_wovejw", "score": "1", "subreddit": "Portuguese", "subreddit_id": "t5_2sqn7"}, {"author": "DallOggs", "body": "My wife’s client flirted with her. She fucked him and is now on track not only to being Partner but also to being my ex-partner.", "created_utc": "1660151651.0", "edited": "False", "id": "ijqqx7q", "is_submitter": "False", "link_id": "t3_wkt96a", "parent_id": "t3_wkt96a", "score": "19", "subreddit": "consulting", "subreddit_id": "t5_2r121"}, {"author": "DallOggs", "body": "For all the shit people have piled on this suggestion, I think it’s brilliant. Swedish, say, would be super simple for English native children to get them started with language-learning. \n\nThe argument that it’s not useful is irrelevant. Of course learning Swedish isn’t useful. But learning a “useful” language like French or Spanish to A1 over 6 years of schooling is just as useless. The only difference is, as the OP said, being able to actually get to a decent level in Swedish would inspire confidence to go for one of those useful languages later on.", "created_utc": "1659826438.0", "edited": "False", "id": "ij8r099", "is_submitter": "False", "link_id": "t3_whgrrf", "parent_id": "t3_whgrrf", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "DallOggs", "body": "Odd, I thought I had reasonably good karma for a non-serious redditor", "created_utc": "1658870200.0", "edited": "False", "id": "ihrnf6h", "is_submitter": "True", "link_id": "t3_w8vbx8", "parent_id": "t1_ihrn71l", "score": "1", "subreddit": "berlin", "subreddit_id": "t5_2qt49"}, {"author": "DallOggs", "body": "See from YouTubing them I've had the opposite experience, it's seemed like Matt's vocals are rather weak and lethargic and the mix is just never quite right.\n\nGuess I'll have to suck it up and go see them one day to find out!", "created_utc": "1658771230.0", "edited": "False", "id": "ihlstc1", "is_submitter": "True", "link_id": "t3_w7u9ho", "parent_id": "t1_ihlp9nn", "score": "1", "subreddit": "LetsTalkMusic", "subreddit_id": "t5_2t4it"}, {"author": "DallOggs", "body": "Interesting! Perhaps he's been sloshed in most of the clips I've seen, as it often feels like he's out of breath and possibly on the verge of sleep – both of which could be booze-induced.", "created_utc": "1658770986.0", "edited": "False", "id": "ihls63s", "is_submitter": "True", "link_id": "t3_w7u9ho", "parent_id": "t1_ihlot0s", "score": "3", "subreddit": "LetsTalkMusic", "subreddit_id": "t5_2t4it"}, {"author": "DallOggs", "body": "De serverar mat, alla som sitter här äter pizza och sallad med alkoholfritt öl på sidan! 😂\n\nAldrig hört talas om något sånt förutom i vissa muslimer länder", "created_utc": "1658661160.0", "edited": "False", "id": "ihfou69", "is_submitter": "True", "link_id": "t3_w6t2nr", "parent_id": "t1_ihfof6d", "score": "3", "subreddit": "sweden", "subreddit_id": "t5_2qofe"}, {"author": "DallOggs", "body": "What uses are there in learning to play the piano, or to paint, or to play tennis, or to bake bread, or to play chess? You won't earn any money from them, and nobody will care if they are on your CV or not.\n\nIf you're a curious kind of person, you won't need to have a \"use\" to find pleasure in learning skills like these. If you are a narrow-minded person, you probably won't have the motivation to do any of these things for more than a couple of hours. So \"use\" is irrelevant.\n\nThat said, just by the by I've found Swedish quite useful when talking to Swedes.", "created_utc": "1655718211.0", "edited": "False", "id": "id1itgv", "is_submitter": "False", "link_id": "t3_vg9r6i", "parent_id": "t3_vg9r6i", "score": "5", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "DallOggs", "body": "Ah yes, because accents have not change one iota in the last 400 years.", "created_utc": "1655669466.0", "edited": "False", "id": "iczc182", "is_submitter": "False", "link_id": "t3_vg1mac", "parent_id": "t1_icz0vzm", "score": "10", "subreddit": "linguistics", "subreddit_id": "t5_2qhos"}, {"author": "DallOggs", "body": "\"must\" can be thought of as a conjugated form of \"to have to\". In other words, you can think of \"to have to\" as having two alternate sets of conjugations:\n\nI have to / I must; \n\nyou have to / you must;\n\nshe has to / she must; etc.\n\nWhen you think of it this way, you can understand the requirement of \"have to\" in your sentence by reference to the fact that the \"going to\" construction requires an infinitive after it, and not a conjugated verb form.", "created_utc": "1655669194.0", "edited": "False", "id": "iczbg12", "is_submitter": "False", "link_id": "t3_vg30dm", "parent_id": "t3_vg30dm", "score": "3", "subreddit": "grammar", "subreddit_id": "t5_2qhwy"}, {"author": "DallOggs", "body": "It’s not a false liaison. This is typical pronunciation of sung French.", "created_utc": "1655635578.0", "edited": "False", "id": "icxjk6i", "is_submitter": "False", "link_id": "t3_vfs84h", "parent_id": "t1_icxj2sv", "score": "3", "subreddit": "linguistics", "subreddit_id": "t5_2qhos"}, {"author": "DallOggs", "body": "You also, however, would appear not to see evident sarcasm in the comment to which you are responding.", "created_utc": "1655621969.0", "edited": "False", "id": "icx4h86", "is_submitter": "False", "link_id": "t3_vfoa48", "parent_id": "t1_icx3zy5", "score": "7", "subreddit": "germany", "subreddit_id": "t5_2qi4z"}, {"author": "DallOggs", "body": "NAD, but generally the expiry date on medication tells you when it may no longer be fully effective (because, say, the active ingredient might have been partially destroyed). The expiry date is not generally there because the medication becomes dangerous after that pdate.\n\nUnless by “expired” you mean “I deliberately attempted to cultivate a deadly strain of bacteria in these eye drops”, you have absolutely nothing to worry about.", "created_utc": "1655618275.0", "edited": "False", "id": "icx0029", "is_submitter": "False", "link_id": "t3_vfogjf", "parent_id": "t3_vfogjf", "score": "1", "subreddit": "AskDocs", "subreddit_id": "t5_2xtuc"}, {"author": "DallOggs", "body": "Better to do one thing well than fuck up two things at once. But if you have the headspace for it, then definitely do it.\n\nI find it boring to study one language for more than about an hour, so having another one to switch to makes it easier to keep studying rather than just stop.", "created_utc": "1655365401.0", "edited": "False", "id": "ick2vst", "is_submitter": "False", "link_id": "t3_vdggvm", "parent_id": "t3_vdggvm", "score": "4", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "DallOggs", "body": "You can listen to the Middlemarch episode of Melvyn Bragg’s podcast called In Our Time. There is also a separate episode specifically about the Reform Act.\n\nhttps://www.bbc.co.uk/sounds/play/b00flwh9\n\nhttps://www.bbc.co.uk/sounds/play/b09z1dd7\n\nEdit: be aware that the Middlemarch episode will discuss the plot, and ruin the beautiful suspense of the novel. Start with the Reform Act one.", "created_utc": "1655275391.0", "edited": "1655275653.0", "id": "icfdhjo", "is_submitter": "False", "link_id": "t3_vco5kz", "parent_id": "t3_vco5kz", "score": "1", "subreddit": "AskHistorians", "subreddit_id": "t5_2ssp3"}, {"author": "DallOggs", "body": "Sure, but this isn’t really the outright prohibition that the OP was looking by for. For example, you could masturbate while thinking of your wife and you’d be acting consistently with this verse.", "created_utc": "1655274876.0", "edited": "False", "id": "icfcu3f", "is_submitter": "False", "link_id": "t3_vcnfoc", "parent_id": "t1_icfagys", "score": "4", "subreddit": "exchristian", "subreddit_id": "t5_2r95q"}, {"author": "DallOggs", "body": "You will want to have a close look at your employment contract (and any separate commission agreement that you signed, if applicable). If it doesn’t mention any training course and just stipulates outright that you get 3% per sale you make, then you should generally have a legal right to be back-paid commission for all the sales you have already made, including before that training course.\n\nThey may be clueless, but it seems you’ve discussed this with them several times now, so it sounds to me like you’re getting taken for a ride. Time to stick it to the man.", "created_utc": "1655237858.0", "edited": "False", "id": "icde7xc", "is_submitter": "False", "link_id": "t3_vcc7j1", "parent_id": "t3_vcc7j1", "score": "2", "subreddit": "sales", "subreddit_id": "t5_2qib3"}, {"author": "DallOggs", "body": "This is a ridiculous idea. (Sorry for the brutal honesty.)\n\nGerman is a completely different language. If you were close to fluent in German, you would find Swedish easier because of the large cognate vocabulary. If you are not fairly fluent, you probably won’t be able to easily spot all the cognates, and therefore it won’t be much use. There is also practically no mutual intelligibility between the two  languages either (they sound completely different).\n\nGerman is also a much more difficult language. There are grammatical cases, genders, variable word orders, and all kinds of other tricky things. Swedish is comparatively simple, in fact it has arguably the simplest grammar of all European languages. Learning German for Swedish in this sense would be like learning General Relativity theory in order to better ride a bicycle (i.e. hard and useless). \n\nBy all means learn German — it’s great, and the more languages you learn the easier it is to learn another, especially a related one. But don’t think it won’t still be a whole new battle to learn Swedish later.\n\nBetter to dive right in with some good books and an exchange partner.\n\nEdit: you should check out r/languagelearning", "created_utc": "1655189020.0", "edited": "False", "id": "icav974", "is_submitter": "False", "link_id": "t3_vbrhns", "parent_id": "t3_vbrhns", "score": "13", "subreddit": "German", "subreddit_id": "t5_2qq51"}, {"author": "DallOggs", "body": "Milan Kundera – anything, but especially The Unbearable Lightness of Being", "created_utc": "1655188356.0", "edited": "False", "id": "icaufeu", "is_submitter": "False", "link_id": "t3_vbvm2a", "parent_id": "t3_vbvm2a", "score": "1", "subreddit": "books", "subreddit_id": "t5_2qh4i"}, {"author": "DallOggs", "body": "How does average tenure of 1.5 years fit with usually spending 2.8 years in the assigned role? Is that not contradictory…", "created_utc": "1655103019.0", "edited": "False", "id": "ic6driu", "is_submitter": "False", "link_id": "t3_vb5u7z", "parent_id": "t3_vb5u7z", "score": "1", "subreddit": "sales", "subreddit_id": "t5_2qib3"}, {"author": "DallOggs", "body": "Perfect, thank you!", "created_utc": "1654781776.0", "edited": "False", "id": "ibqamix", "is_submitter": "True", "link_id": "t3_v8gh3u", "parent_id": "t1_ibq7x6s", "score": "1", "subreddit": "AusFinance", "subreddit_id": "t5_2uo3q"}, {"author": "DallOggs", "body": "Keep up your French or you’ll lose it. \n\nIn my experience, if you did IB French you’ll be a bit ahead of the pack. Many people in the class will have only started French at uni 2 years ago (this was me), whereas you’ve had longer term exposure throughout high school. From what I saw, I would say you will have a better accent, better comprehension, and better French instincts than the competition. You’ll keep up just fine.", "created_utc": "1654757167.0", "edited": "False", "id": "ibpe21y", "is_submitter": "False", "link_id": "t3_v8a3bn", "parent_id": "t3_v8a3bn", "score": "5", "subreddit": "unimelb", "subreddit_id": "t5_2smf4"}, {"author": "DallOggs", "body": "I learned French initially at university. I call myself C1, but thanks to the academic rigour of my classes, I find I can often read and write at a more sophisticated level than natives.\n\nThe skill university won’t teach you: speaking in a way that sounds natural and relaxed for a native speaker. Sometimes with the way I say things, I sound like a book from the 1880s rather than a normal human. This is why I say I’m C1.", "created_utc": "1654756941.0", "edited": "False", "id": "ibpds3l", "is_submitter": "False", "link_id": "t3_v8a3n3", "parent_id": "t3_v8a3n3", "score": "12", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "DallOggs", "body": "It’s point is to occupy the prestigious position of “Worst Novel Ever to be Considered ‘Literature’”", "created_utc": "1654680347.0", "edited": "False", "id": "ibl8et7", "is_submitter": "False", "link_id": "t3_v7k8v2", "parent_id": "t3_v7k8v2", "score": "-6", "subreddit": "books", "subreddit_id": "t5_2qh4i"}, {"author": "DallOggs", "body": "You don’t strictly need to meet the progression requirements. I did a third year subject in first year, just emailed the co-ordinator and convinced him I would be a good student, and he wrote me permission to attach to an enrolment variation.\n\nThere are all these rules, but they’re generally able to bend them for you if you go about it the right way.", "created_utc": "1654672511.0", "edited": "False", "id": "ibkzpk8", "is_submitter": "False", "link_id": "t3_v7hw3u", "parent_id": "t3_v7hw3u", "score": "-4", "subreddit": "unimelb", "subreddit_id": "t5_2smf4"}, {"author": "DallOggs", "body": "Why is I belligerent towards me", "created_utc": "1654596311.0", "edited": "False", "id": "ibgyrwm", "is_submitter": "False", "link_id": "t3_v6qndw", "parent_id": "t3_v6qndw", "score": "2", "subreddit": "AskHistory", "subreddit_id": "t5_2sa8i"}, {"author": "DallOggs", "body": "In.\n\nNever heard “complicit with” in my life", "created_utc": "1654525626.0", "edited": "False", "id": "ibdbnap", "is_submitter": "False", "link_id": "t3_v614zd", "parent_id": "t3_v614zd", "score": "1", "subreddit": "grammar", "subreddit_id": "t5_2qhwy"}, {"author": "DallOggs", "body": "I don’t think there is an explanation. Both are perfectly grammatically correct in all four contexts. Even my feeling as a native speaker doesn’t tell me definitively that one or the other is better in any of these contexts. Don’t worry about it.", "created_utc": "1654525547.0", "edited": "False", "id": "ibdbhho", "is_submitter": "False", "link_id": "t3_v5wgjt", "parent_id": "t3_v5wgjt", "score": "1", "subreddit": "grammar", "subreddit_id": "t5_2qhwy"}, {"author": "DallOggs", "body": "I agree with your corporate style guide in the first two cases. Saying “this department” rather than merely “this” adds information about what kind of referent the word “this” has in the particular context. The word “department” does not specifically invoke the Department, it merely points to a kind of entity. \n\nI would deviate as regards “This Earth”. This particular expression seems to really require the capitalisation, but I would say that it has a poetic/emphatic connotation, and is not so much a breach of the rule in your style guide as a creative play with language that has become normalised and banal in our ears.", "created_utc": "1654525274.0", "edited": "False", "id": "ibdawxp", "is_submitter": "False", "link_id": "t3_v61b19", "parent_id": "t3_v61b19", "score": "2", "subreddit": "grammar", "subreddit_id": "t5_2qhwy"}, {"author": "DallOggs", "body": "Keep the hyphen", "created_utc": "1654524603.0", "edited": "False", "id": "ibd9ivz", "is_submitter": "False", "link_id": "t3_v64c3l", "parent_id": "t3_v64c3l", "score": "1", "subreddit": "grammar", "subreddit_id": "t5_2qhwy"}, {"author": "DallOggs", "body": "The “themselves” and “them” are weird to me. Obviously they/them is becoming more accepted these days as a means of referring to an individual in a non-gendered way, but “themselves” still seems weird to me, since it is explicitly plural. “Themself” is a variant I’ve seen, but both feel clunky, especially when written. \n\nSince your GF is a GF, not a non-binary-F, she might well make it “Behind every dancer who believes in herself is a teacher who believed in her first”. This has a much easier ring in my ear.", "created_utc": "1654524389.0", "edited": "False", "id": "ibd934u", "is_submitter": "False", "link_id": "t3_v6432z", "parent_id": "t3_v6432z", "score": "2", "subreddit": "grammar", "subreddit_id": "t5_2qhwy"}, {"author": "DallOggs", "body": "Normally I would say that pronunciation comes over time, and perfection from the very beginning is both unrealistic and unnecessary. But in this case, rolled R is quite an important aspect of pronunciation, so it would definitely be good to learn it. \n\nDon’t pause your learning until you’ve got it though. You may need to do daily exercises for weeks before you can produce the sound, and it won’t be fun to learn nothing of the language in that time.\n\nWorst case scenario where you just can’t get it, I know someone who speaks decent Spanish without a rolled R, and while it doesn’t sound pretty at all, it rarely stops her getting her message across.", "created_utc": "1654514855.0", "edited": "False", "id": "ibcsrfm", "is_submitter": "False", "link_id": "t3_v6174s", "parent_id": "t3_v6174s", "score": "4", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "DallOggs", "body": "If you love technical stuff, my bet is you’ll find sales boring. I too love technical stuff. I did a maths degree, am now doing a law degree part time, and that is the stimulation that keeps sales work bearable.\n\nSales might initially be more attractive financially, but if you’re intellectually bored it will show in your performance. You could always try it out for a year though, couldn’t hurt!", "created_utc": "1654364783.0", "edited": "False", "id": "ib5zqzp", "is_submitter": "False", "link_id": "t3_v4ttzx", "parent_id": "t3_v4ttzx", "score": "11", "subreddit": "sales", "subreddit_id": "t5_2qib3"}, {"author": "DallOggs", "body": "Judging from your command of the English language, I would suggest starting with something gentler.\n\nHave you heard of Dr. Seuss? Or maybe Mr Men?\n\nParadise Lost should be an easy step up once you’ve mastered these.", "created_utc": "1654348534.0", "edited": "False", "id": "ib56grz", "is_submitter": "False", "link_id": "t3_v4o4lj", "parent_id": "t3_v4o4lj", "score": "3", "subreddit": "books", "subreddit_id": "t5_2qh4i"}, {"author": "DallOggs", "body": "Yes, they did use them. These were actually the informal forms of address. “You” was formal. If you’ve heard “hallowed be thy name” and thought we were addressing God with respect, that’s wrong, we’re actually talking to him as our homie. Google the T-V distinction for more cultural and grammatical details.\n\nInterestingly, the religious group the Quakers persisted in using thou for a very long time indeed. You can find it in the speech of Captain Ahab in Moby Dick, as a late example.", "created_utc": "1654289244.0", "edited": "False", "id": "ib2v8oz", "is_submitter": "False", "link_id": "t3_v47is8", "parent_id": "t3_v47is8", "score": "-1", "subreddit": "AskHistorians", "subreddit_id": "t5_2ssp3"}, {"author": "DallOggs", "body": "Won’t work unfortunately\n\nEdit: assuming you don’t want to hop around between towns on regional trains for a day to save 31€", "created_utc": "1654288833.0", "edited": "False", "id": "ib2ueou", "is_submitter": "False", "link_id": "t3_v48esk", "parent_id": "t3_v48esk", "score": "3", "subreddit": "berlin", "subreddit_id": "t5_2qt49"}, {"author": "DallOggs", "body": "Ah, so the powder could be paint? I didn’t think of that, as the place was last painted 5 years ago when it was renovated. Would you still expect some dust like that after so long? \nMy worry is that I wipe it up and it comes back pretty quickly, so it seems like an endless source.", "created_utc": "1654271557.0", "edited": "False", "id": "ib1sfjt", "is_submitter": "True", "link_id": "t3_v416yl", "parent_id": "t1_ib1nvgm", "score": "1", "subreddit": "asbestoshelp", "subreddit_id": "t5_4i4ldp"}, {"author": "DallOggs", "body": "Probably better if you choose one to establish thoroughly first.\n\nI did exactly what you are contemplating, and my Spanish and Italian are fused into a southern Romance lexical mush. On the bright side, though, it causes far more laughs than misunderstandings. So if you’re comfortable with that, keep going with both!", "created_utc": "1654250206.0", "edited": "False", "id": "ib0pm4k", "is_submitter": "False", "link_id": "t3_v3vh7q", "parent_id": "t3_v3vh7q", "score": "15", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "DallOggs", "body": "I use reading as my approach to a new language, and I think it is easily the most effective way to learn except for immersion. Underrated because people in the time of Twitter don’t have motivation to digest more than a sentence or two.\n\nIn my experience, the first 10 pages in a TL are an absolute nightmare. But trust me, even if you do a page every two days, look up everything you don’t know and get it under your belt.\n\nThe next 50 pages are still a nightmare, but you start to find sentences where you don’t need to look up everything, so at least there’s satisfaction in that.\n\nAfter this, you should be flying. Still looking things up, but getting the gist even if you don’t, since you’ve learnt the key vocabulary of the written language by now. At this point, I would say just go for it, stop focusing on memorising everything and try to enjoy the language. Getting to this point is a pain, but it’s easier than you think and extremely rewarding.", "created_utc": "1654112053.0", "edited": "False", "id": "iatnsku", "is_submitter": "False", "link_id": "t3_v2oiud", "parent_id": "t3_v2oiud", "score": "10", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "DallOggs", "body": "Nope", "created_utc": "1653928732.0", "edited": "False", "id": "iak7oen", "is_submitter": "False", "link_id": "t3_v143s4", "parent_id": "t3_v143s4", "score": "7", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "DallOggs", "body": "If you borrowed in A, your interest will be denominated in A (assuming that this bank doesn't do anything funky in its contracts), so you will be liable to pay 20A (if your interest is compounded yearly).\n\nThis inflationary situation is great for you, because you are effectively paying less interest (in real terms) than you signed up for; and conversely terrible for the bank, because the interest you're paying is worth less at the time of payment than 10% of 200A at the time you made the contract.", "created_utc": "1653903202.0", "edited": "False", "id": "iaizn3i", "is_submitter": "False", "link_id": "t3_v0w6g8", "parent_id": "t3_v0w6g8", "score": "2", "subreddit": "AskEconomics", "subreddit_id": "t5_2selg"}, {"author": "DallOggs", "body": "Look at what the newspaper itself does. In this particular case, the “The” is part of the title, so you’ll keep it and capitalise it.", "created_utc": "1653901733.0", "edited": "False", "id": "iaiy1ay", "is_submitter": "False", "link_id": "t3_v0vp3p", "parent_id": "t3_v0vp3p", "score": "29", "subreddit": "grammar", "subreddit_id": "t5_2qhwy"}, {"author": "DallOggs", "body": "They don’t just look at WAM. They also look at the trajectory of your results, as well as where they were from, what area you studied, and at what level you studied.\n\nIt’s also, as I understand it, your WAM across all your studies, rather than your most recent degree, that counts (so you might want to calculate that). \n\nI had a WAM just over 80 from a BA Hons and got a bursary, no CSP. I have friends who did only marginally better than me and got a CSP, so I assume I was just below the cut off. Your WAM is significantly better than mine, and you have a masters, so I would say your chances are very good.\n\nBut of course it depends on the year.", "created_utc": "1653833537.0", "edited": "False", "id": "iafg4cv", "is_submitter": "False", "link_id": "t3_v0be0e", "parent_id": "t3_v0be0e", "score": "4", "subreddit": "unimelb", "subreddit_id": "t5_2smf4"}, {"author": "DallOggs", "body": "Depends to whom I’m talking. \n\nWhere I’m from, standards for “speaking” another language are pretty low, as very few people do it. Hence I opt for around B1. If you can speak at B1 in another language, everyone in my country thinks you a god. \n\nIn Western Europe, as an example to the contrary, it’s not at all uncommon for an educated person to have professional proficiency in 3 or more languages. Such people wouldn’t be too impressed by B1. Hence, there, I don’t say I can speak a language until I’m a solid C1.", "created_utc": "1653733301.0", "edited": "1653741740.0", "id": "iaaqvks", "is_submitter": "False", "link_id": "t3_uzkcyu", "parent_id": "t3_uzkcyu", "score": "34", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "DallOggs", "body": "In a similar boat with an Australian JD.\n\nHere are my general observations:\n\n1. Working for an international law firm with a common law JD should be possible, but Germans also get common law LLMs and such, and come with the additional advantage of speaking German. In my experience, when an American says he/she is conversational in a language, this does not usually indicate a level of proficiency sufficient for professional contexts. If you are, and you get good marks and maybe an international internship or exchange in your JD, you should be ok. If not, good idea to work on your German.\n\n2. Studying law in Germany will require excellent German, and many years. Studying law in another EU country could be better. Once you have an EU law degree, you are technically eligible to sit the bar exams for any EU jurisdiction (you will need to do some self-study of course). To speed things up, you could do the Master in Economic Law at Sciences Po (assuming you have a good enough CV to get in). This is two years, and is in English. Then you self-study and sit the German bar exam. Know a Belgian lawyer who did this. \n\n3. Academia will be tricky but possible. A JD is not an academic degree, so adds little to your attractiveness from a European standpoint. Similarly, a Bachelor won’t generally be sufficient to gain admission to a good PhD in Europe. PhD positions are essentially like jobs in Europe, they generally require a (research) Masters and some research publications. \n\n\nIf I were you, I’d do the most prestigious American JD you can, work like hell on your Deutsch, do an exchange semester to a good German uni, and then you might look attractive to an international law firm or even as an in-house to a big company, as someone who could sort of translate common law stuff into things Germans will understand. Either this, or do a PhD in the US then apply for junior academic roles in Germany", "created_utc": "1653651210.0", "edited": "False", "id": "ia6ja9x", "is_submitter": "False", "link_id": "t3_uyvzt9", "parent_id": "t3_uyvzt9", "score": "2", "subreddit": "germany", "subreddit_id": "t5_2qi4z"}, {"author": "DallOggs", "body": "This is not a historical record per se, but in the Iliad, you read of Greeks and Trojans chatting (or abusing each other) pretty much constantly whilst flinging their spears at each other.", "created_utc": "1653172078.0", "edited": "False", "id": "i9hzk24", "is_submitter": "False", "link_id": "t3_uuwqzq", "parent_id": "t3_uuwqzq", "score": "1", "subreddit": "AskHistorians", "subreddit_id": "t5_2ssp3"}, {"author": "DallOggs", "body": "Stephen King?", "created_utc": "1653033703.0", "edited": "False", "id": "i9ax8vi", "is_submitter": "False", "link_id": "t3_uto3ri", "parent_id": "t1_i9awuw4", "score": "21", "subreddit": "literature", "subreddit_id": "t5_2qhps"}, {"author": "DallOggs", "body": "Just a pointer: the biggest classics ≠ books every American has read.\n\nTalking about the left-hand side of the inequality, in addition to what others have said, I’d add as a minimum:\n\nPortrait of a Lady, The Golden Bowl, As I Lay Dying, For Whom the Bell Tolls, The Grapes of Wrath, Catcher in the Rye, Catch 22, Gravity’s Rainbow, Infinite Jest. \n\nEdit: Google Harold Bloom’s list of the Western Canon, look at the US parts of the list.", "created_utc": "1653033603.0", "edited": "False", "id": "i9ax4s5", "is_submitter": "False", "link_id": "t3_uto3ri", "parent_id": "t3_uto3ri", "score": "187", "subreddit": "literature", "subreddit_id": "t5_2qhps"}, {"author": "DallOggs", "body": "You cannot stop them. The letters have slowly and insidiously become as indispensable a part of reality as capitalism itself. Only when the posties of the world unite will this monstrous paper empire be cast into the recycling bin of history.", "created_utc": "1652941561.0", "edited": "False", "id": "i968i3e", "is_submitter": "False", "link_id": "t3_uswwaw", "parent_id": "t3_uswwaw", "score": "45", "subreddit": "ASX_Bets", "subreddit_id": "t5_2hqqj5"}, {"author": "DallOggs", "body": "Duolingo’s Latin course is utterly useless. You will learn more in your first two hours of class.\n\nIf you want a head start on your class, you would be better advised to get a copy of Wheelock’s Latin and start from page 1.", "created_utc": "1652771605.0", "edited": "False", "id": "i8x4f6o", "is_submitter": "False", "link_id": "t3_urgncp", "parent_id": "t3_urgncp", "score": "7", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "DallOggs", "body": "If your level is low A1, you will find listening to the news (for example) quite boring, as you’ll understand nothing. You’ll probably just tune out entirely.\n\nThe more German you hear, the more your ear will get used to the sounds and rhythms, and this will help you. If you have German TV in the background while you cook, this will by no means be a bad thing. But you asked if you should “invest time” listening to such content, and to that I’d say the answer is not really. Better to focus mostly on content where you understand at least 50%, so you can actually get enough foothold to learn some things from it.\n\nEdit: as a constructive suggestion, try YouTubing episodes of Peppa Wutz, or some kids show, and write down every phrase/word you hear as you watch. Look up what you’ve heard, then rewatch and try to understand more. Repeat ad infinitum and eventually you’ll be ready to hit the more advanced material", "created_utc": "1652691225.0", "edited": "1652691492.0", "id": "i8sreph", "is_submitter": "False", "link_id": "t3_uqpmyz", "parent_id": "t3_uqpmyz", "score": "5", "subreddit": "German", "subreddit_id": "t5_2qq51"}, {"author": "DallOggs", "body": "Dutch and Swedish are easy, Norwegian is a tad harder, though largely mutually intelligible with Swedish. Danish (although you didn’t mention it) is slightly harder again, particularly pronunciation.\n\nGerman is significantly harder than all the others, mainly because of the case system and less familiar vocabulary and grammar. That said, it’s still not Japanese.\n\nSource: English native, live in Germany, lived in Sweden, get around ok in all these languages — except for German, which is taking ages :(", "created_utc": "1652562393.0", "edited": "False", "id": "i8mbuyz", "is_submitter": "False", "link_id": "t3_upq7n0", "parent_id": "t3_upq7n0", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "DallOggs", "body": "Protestants.\n\n(Thank you in advance, dear moderators, for removing this inadequate analysis.)", "created_utc": "1652194005.0", "edited": "False", "id": "i821uh3", "is_submitter": "False", "link_id": "t3_umkcxj", "parent_id": "t3_umkcxj", "score": "1", "subreddit": "AskHistorians", "subreddit_id": "t5_2ssp3"}, {"author": "DallOggs", "body": "> their agenda is about advancing authoritarianism, not about protecting lives\n\nMaybe I’m not cynical enough, but as a spectator from outside it is my impression that many, if not most, pro-life activists have a genuine concern for the ‘souls’ of foetuses?", "created_utc": "1651944979.0", "edited": "False", "id": "i7p7rqz", "is_submitter": "True", "link_id": "t3_ukb9si", "parent_id": "t1_i7oimeo", "score": "1", "subreddit": "exchristian", "subreddit_id": "t5_2r95q"}, {"author": "DallOggs", "body": "Thanks for your response, and sorry for the inevitable downvotes I suppose you’ll receive. \n\nI find your slippery slope argument one of the only arguments worth talking about. I disagree — of course there are many exceptions, but I think common law countries like the US have done a pretty good job of not sliding down slippery slopes. But it undeniably makes an important point.", "created_utc": "1651944766.0", "edited": "False", "id": "i7p7agn", "is_submitter": "True", "link_id": "t3_ukb9si", "parent_id": "t1_i7oucak", "score": "2", "subreddit": "exchristian", "subreddit_id": "t5_2r95q"}, {"author": "DallOggs", "body": "Number 2 is correct. ‘Should’ is not always used to convey a sense of obligation, but is sometimes used more or less as you might use ‘would’, i.e. to express a conditional. (Although admittedly ‘would’ would sound weird instead of ‘should’ in the quote you gave.)\n\nA classic example is the phrase “I should think”, e.g.:\n\nWill it rain today? \nI should think so. The forecast is predicting a storm, in fact. \n\nOr\n\nI should like to know Twitter’s average daily user figures before making an offer to buy it. \n\nAmericans on this sub will likely tell you that these examples are old fashioned, and to some extent that is true. Nonetheless, I hear them used among my British and Australian friends all the time. It is an elegant, perhaps posh/literary phrasing, but it is still in use.\n\nEdit: See definition 3 on wiktionary: https://en.m.wiktionary.org/wiki/should", "created_utc": "1651162414.0", "edited": "False", "id": "i6jscjk", "is_submitter": "False", "link_id": "t3_udy4k5", "parent_id": "t3_udy4k5", "score": "5", "subreddit": "grammar", "subreddit_id": "t5_2qhwy"}, {"author": "DallOggs", "body": "> Every art must eventually be both dependent and independent.\n\nLol makes sense. OP has certainly not been drinking the Derrida Kool-Aid\n\n> Whoever was responsible for her condition, whether it was Hughes or her father\n\nOP showing a sophisticated understanding of the intricacies of human psychology", "created_utc": "1651139284.0", "edited": "False", "id": "i6ij62f", "is_submitter": "False", "link_id": "t3_udpaox", "parent_id": "t3_udpaox", "score": "1", "subreddit": "books", "subreddit_id": "t5_2qh4i"}, {"author": "DallOggs", "body": "Ni måste tillbringa lite tid i Melbourne, tycker jag.\n\nJag kommer från Melbourne själv och då kanske ha lite böjelse, men alla mina europeiska kompisar håller med att Melbourne är något speciellt. Många stadsdelar med helt olika vibes, det kan verka som man har rest till en annan kontinent bara att ta spårvagnen en halvtimme. Invandrare från hela världen, asiatisk/fusion mat som är nästan omöjligt att få nån annanstans i världen, konst och musik och barer överallt.\n\nGer dig gärna några specifika tips om du vill.", "created_utc": "1651068480.0", "edited": "False", "id": "i6ehsc9", "is_submitter": "False", "link_id": "t3_ud3y7g", "parent_id": "t3_ud3y7g", "score": "5", "subreddit": "sweden", "subreddit_id": "t5_2qofe"}, {"author": "DallOggs", "body": "Follow-up: would you worry about the lead paint in the  common stairwell, or is it unlikely to be problematic?", "created_utc": "1650745614.0", "edited": "False", "id": "i5x2od5", "is_submitter": "True", "link_id": "t3_ua2vr4", "parent_id": "t1_i5wz51j", "score": "1", "subreddit": "asbestoshelp", "subreddit_id": "t5_4i4ldp"}, {"author": "DallOggs", "body": "This is really reassuring, thanks", "created_utc": "1650745404.0", "edited": "False", "id": "i5x279v", "is_submitter": "True", "link_id": "t3_ua2vr4", "parent_id": "t1_i5wz51j", "score": "1", "subreddit": "asbestoshelp", "subreddit_id": "t5_4i4ldp"}, {"author": "DallOggs", "body": "Surprisingly little, and I read French, Spanish and Italian. Many of the words are guessable, but many are not. Would love to hear this read aloud!", "created_utc": "1650736007.0", "edited": "False", "id": "i5whdam", "is_submitter": "False", "link_id": "t3_uaaiei", "parent_id": "t3_uaaiei", "score": "278", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "DallOggs", "body": "I would say that, at A2 level, a native speaker is going to find it a pain in the arse to try to talk with you, even if you can indeed communicate somewhat. \n\nB1 is starting to get to the stage where you could have a bit of small talk with a native, without this native speaker getting too impatient repeating herself or struggling to work out what you are trying to say.", "created_utc": "1650232786.0", "edited": "False", "id": "i54u7xk", "is_submitter": "False", "link_id": "t3_u5x4a6", "parent_id": "t3_u5x4a6", "score": "8", "subreddit": "German", "subreddit_id": "t5_2qq51"}, {"author": "DallOggs", "body": "Love this place", "created_utc": "1649577627.0", "edited": "False", "id": "i451zdg", "is_submitter": "True", "link_id": "t3_tzxqfc", "parent_id": "t1_i451sr4", "score": "2", "subreddit": "berlin", "subreddit_id": "t5_2qt49"}, {"author": "DallOggs", "body": "Up in Prenzlauer Berg unfortunately. Looks like I’ll be hopping on the U2 to Neukölln to check these places out", "created_utc": "1649572853.0", "edited": "False", "id": "i44vhdk", "is_submitter": "True", "link_id": "t3_tzxqfc", "parent_id": "t1_i43qaf3", "score": "1", "subreddit": "berlin", "subreddit_id": "t5_2qt49"}, {"author": "DallOggs", "body": "Is this because they don’t check your covid pass? Or is there something more sinister at work there?", "created_utc": "1649572742.0", "edited": "False", "id": "i44vbcu", "is_submitter": "True", "link_id": "t3_tzxqfc", "parent_id": "t1_i431nyt", "score": "1", "subreddit": "berlin", "subreddit_id": "t5_2qt49"}, {"author": "DallOggs", "body": "Just pray that it isn’t asbestos", "created_utc": "1649527773.0", "edited": "False", "id": "i42a8do", "is_submitter": "False", "link_id": "t3_tzyqdp", "parent_id": "t3_tzyqdp", "score": "1", "subreddit": "germany", "subreddit_id": "t5_2qi4z"}, {"author": "DallOggs", "body": "You should consider branching out into English as well as German. Perhaps you could do a ‘world-magnificence better training’?", "created_utc": "1649406200.0", "edited": "False", "id": "i3vinub", "is_submitter": "False", "link_id": "t3_tyyjbt", "parent_id": "t3_tyyjbt", "score": "2", "subreddit": "German", "subreddit_id": "t5_2qq51"}, {"author": "DallOggs", "body": "As a philosophy lover, let me assure you that is an absolutely dope present. You are a good friend", "created_utc": "1649403670.0", "edited": "False", "id": "i3vff08", "is_submitter": "False", "link_id": "t3_tyxzo9", "parent_id": "t3_tyxzo9", "score": "1", "subreddit": "German", "subreddit_id": "t5_2qq51"}, {"author": "DallOggs", "body": "Might be a good idea to read the post you are deleting, before deleting it.", "created_utc": "1649352055.0", "edited": "False", "id": "i3sbacx", "is_submitter": "False", "link_id": "t3_tyhck7", "parent_id": "t1_i3sai8f", "score": "2", "subreddit": "books", "subreddit_id": "t5_2qh4i"}, {"author": "DallOggs", "body": "Dear Mod, this wasn’t a book recommendation request…", "created_utc": "1649351850.0", "edited": "False", "id": "i3sarf1", "is_submitter": "False", "link_id": "t3_tyhck7", "parent_id": "t1_i3sai8f", "score": "4", "subreddit": "books", "subreddit_id": "t5_2qh4i"}, {"author": "DallOggs", "body": "Sounds like a similar situation, got a parcel of about 5kg with about £700 worth of stuff in it.\n\nI guess I’ll just pay whatever they charge me, but I’m worried now. 100 is a lot!", "created_utc": "1649339532.0", "edited": "False", "id": "i3rh4qw", "is_submitter": "True", "link_id": "t3_tycukj", "parent_id": "t1_i3rdvf1", "score": "1", "subreddit": "germany", "subreddit_id": "t5_2qi4z"}, {"author": "DallOggs", "body": "Ohhh I really want to learn Italian, I’m so keen. How will I start? \n\nOh, wait, I’ve got it, I’ll learn Portuguese!", "created_utc": "1649272018.0", "edited": "False", "id": "i3nwqay", "is_submitter": "False", "link_id": "t3_txt2xn", "parent_id": "t3_txt2xn", "score": "10", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "DallOggs", "body": "Lots of native speakers will read Austen for the first time in their last years of school and struggle with it at first. Just keep reading, looking up words, checking chapter summaries where you find things really baffling, and you’ll catch on. For me, 10 years later I still find the first few pages of an 18th or 19th C novel a slog, before I sink into the language again. \n\nOne tip I have is to always get a Penguin Classics edition when the period is unfamiliar to you. The endnotes will  usually explain the key vocabulary or cultural concepts that modern readers are likely to find unfamiliar.", "created_utc": "1649148722.0", "edited": "False", "id": "i3gu4pn", "is_submitter": "False", "link_id": "t3_twqc86", "parent_id": "t3_twqc86", "score": "27", "subreddit": "books", "subreddit_id": "t5_2qh4i"}, {"author": "DallOggs", "body": "Swedish", "created_utc": "1649147645.0", "edited": "False", "id": "i3gsvap", "is_submitter": "False", "link_id": "t3_twpkz0", "parent_id": "t3_twpkz0", "score": "4", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "DallOggs", "body": "Thanks for the lab recommendation.\n\nWhen you say normal settling of particulate, do you mean that the dust is likely due to the paint from the pipe? The thing that worried me was that I’m not sure where the dust is coming from", "created_utc": "1648655788.0", "edited": "False", "id": "i2q900r", "is_submitter": "True", "link_id": "t3_ts4wbc", "parent_id": "t1_i2q3sy3", "score": "2", "subreddit": "asbestoshelp", "subreddit_id": "t5_4i4ldp"}, {"author": "DallOggs", "body": "Given the context, it certainly seems like a candidate!", "created_utc": "1648203851.0", "edited": "False", "id": "i21qn8g", "is_submitter": "False", "link_id": "t3_tnifgw", "parent_id": "t3_tnifgw", "score": "3", "subreddit": "asbestoshelp", "subreddit_id": "t5_4i4ldp"}, {"author": "DallOggs", "body": "As an anally retentive logician I’m inclined to think that what you described is the better way, and that the notation in the OP’s picture is sloppy. But in my experience it’s pretty normal", "created_utc": "1648062626.0", "edited": "False", "id": "i1u07ji", "is_submitter": "False", "link_id": "t3_tkwmbp", "parent_id": "t1_i1txcou", "score": "1", "subreddit": "askmath", "subreddit_id": "t5_2qm4f"}, {"author": "DallOggs", "body": "Could you recommend us a poem with source? Sounds super interesting", "created_utc": "1648057596.0", "edited": "False", "id": "i1tmyb8", "is_submitter": "False", "link_id": "t3_tktxdi", "parent_id": "t1_i1tlsde", "score": "8", "subreddit": "linguistics", "subreddit_id": "t5_2qhos"}, {"author": "DallOggs", "body": "Interesting question. But you should ask on r/AskHistory, the mods here are very strict about answer quality but I assume this question would definitely get a decent casual response there (unless you’re really looking for scholarly detail).", "created_utc": "1648050217.0", "edited": "False", "id": "i1t33of", "is_submitter": "False", "link_id": "t3_tkwn3i", "parent_id": "t3_tkwn3i", "score": "1", "subreddit": "AskHistorians", "subreddit_id": "t5_2ssp3"}, {"author": "DallOggs", "body": "We didn’t. The equals sign in line 3 is introduced to say the right hand side on line 2 is equal to the right hand side on line 3. The modulus of L is still less than or equal to this quantity.\n\nI see how you were mislead by the notation though. This is something you will get used to when dealing with inequalities.", "created_utc": "1648049848.0", "edited": "False", "id": "i1t255w", "is_submitter": "False", "link_id": "t3_tkwmbp", "parent_id": "t3_tkwmbp", "score": "4", "subreddit": "askmath", "subreddit_id": "t5_2qm4f"}, {"author": "DallOggs", "body": "Thank you!!!", "created_utc": "1647682125.0", "edited": "False", "id": "i19h0wb", "is_submitter": "True", "link_id": "t3_thr0z0", "parent_id": "t1_i19gqto", "score": "1", "subreddit": "asbestoshelp", "subreddit_id": "t5_4i4ldp"}, {"author": "DallOggs", "body": "I am so tempted to pay off my HECS just because I hate debt, and I have a lottttt of HECS. \n\nBut I remind myself that in all likelihood my money will compound quicker in my share portfolio than my debt will compound, so it just doesn’t make sense to pay it off.", "created_utc": "1647678527.0", "edited": "False", "id": "i19d3np", "is_submitter": "False", "link_id": "t3_thqnyd", "parent_id": "t3_thqnyd", "score": "6", "subreddit": "AusFinance", "subreddit_id": "t5_2uo3q"}, {"author": "DallOggs", "body": "The latter", "created_utc": "1647669752.0", "edited": "False", "id": "i192vef", "is_submitter": "False", "link_id": "t3_tho6pe", "parent_id": "t3_tho6pe", "score": "1", "subreddit": "grammar", "subreddit_id": "t5_2qhwy"}, {"author": "DallOggs", "body": "Keeping the \"in\" makes it sound more prosaic. To me, in the context you've given, it sounds better with \"in\".\n\nIf you are not including the year in the prose proper, but merely as a parenthetical note, then eliminating the \"in\" could work. Consider: \"Charles Cox (born 1773, New York) was the finest piano-tuner in Manhattan.\"", "created_utc": "1647620168.0", "edited": "False", "id": "i163wa0", "is_submitter": "False", "link_id": "t3_th4vcw", "parent_id": "t3_th4vcw", "score": "5", "subreddit": "grammar", "subreddit_id": "t5_2qhwy"}, {"author": "DallOggs", "body": "This is a question of semantics, not grammar.\n\nGrammatically, colourless green ideas can sleep furiously.\n\nThe fact that that makes no sense whatsoever is because of the meanings of the words, not the rules by which they're strung together. Hence, semantics.", "created_utc": "1647619197.0", "edited": "False", "id": "i161ds5", "is_submitter": "False", "link_id": "t3_tgxief", "parent_id": "t3_tgxief", "score": "5", "subreddit": "grammar", "subreddit_id": "t5_2qhwy"}, {"author": "DallOggs", "body": "Any sentence from Norman Mailer’s Ancient Evenings", "created_utc": "1647551859.0", "edited": "False", "id": "i12kp5y", "is_submitter": "False", "link_id": "t3_tgj80o", "parent_id": "t3_tgj80o", "score": "2", "subreddit": "books", "subreddit_id": "t5_2qh4i"}, {"author": "DallOggs", "body": "Not a dumb question. \n\nSpanish is a faster paced language than English, so a mistake like this is less obvious if you’re speaking at native pace. That said, I would guess that most of the time, the mistake would still be detectable to fluent speakers. \n\nThe real question, though, is does it matter? The answer to that is no. You will be understood in pretty much all contexts making little mistakes like this (I do so all the time and am rarely misunderstood). The only thing you’ll be giving away is that you’re not a native, but that probably won’t be new information to anyone you’re speaking to anyway.\n\nDefinitely try to memorize it and get it right, but don’t stress about it. Grammar like this comes naturally the more you practice.", "created_utc": "1647551415.0", "edited": "False", "id": "i12jjil", "is_submitter": "False", "link_id": "t3_tgk93o", "parent_id": "t3_tgk93o", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "DallOggs", "body": "Thank you for the detailed response! I will refer to these resources in future.", "created_utc": "1647547259.0", "edited": "False", "id": "i128nmx", "is_submitter": "True", "link_id": "t3_tgd08m", "parent_id": "t1_i11gk4p", "score": "2", "subreddit": "etymology", "subreddit_id": "t5_2qspe"}, {"author": "DallOggs", "body": "Halmos is the rightful classic, in my amateur opinion", "created_utc": "1647070022.0", "edited": "False", "id": "i0cfi57", "is_submitter": "False", "link_id": "t3_tcb2jv", "parent_id": "t3_tcb2jv", "score": "1", "subreddit": "askmath", "subreddit_id": "t5_2qm4f"}, {"author": "DallOggs", "body": "If you pick an “easy” language to work on for some variation alongside your Japanese studies, it shouldn’t be too much trouble to make a bit of progress without interfering with Japanese. For example, if you’re native in English (which, judging from your writing, you are), I would say Spanish or Italian would be a nice complement for the time on your commute or in the evening when you don’t feel like doing more Japanese.\n\nI was learning Farsi intensively and Italian in the background, worked nicely.", "created_utc": "1646899957.0", "edited": "False", "id": "i0310z5", "is_submitter": "False", "link_id": "t3_tatuks", "parent_id": "t3_tatuks", "score": "5", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "DallOggs", "body": "Where abouts in the world are you that you found this?", "created_utc": "1645656861.0", "edited": "False", "id": "hy5wb5c", "is_submitter": "False", "link_id": "t3_szp5t0", "parent_id": "t3_szp5t0", "score": "1", "subreddit": "asbestoshelp", "subreddit_id": "t5_4i4ldp"}, {"author": "DallOggs", "body": "Thank you all for these responses! Might sound dumb, but I was pretty convinced – now, thankfully, I am convinced I was about to get scammed. I owe you all !", "created_utc": "1645558281.0", "edited": "False", "id": "hy03hzr", "is_submitter": "True", "link_id": "t3_syuzaz", "parent_id": "t3_syuzaz", "score": "3", "subreddit": "germany", "subreddit_id": "t5_2qi4z"}, {"author": "DallOggs", "body": "Tort law is completely different to contract law. Tort is French for \"wrong\", and deals with when one person wrongs another, e.g. by assault or negligence. There is no need for a contract for a person to sue another at tort.", "created_utc": "1645298634.0", "edited": "False", "id": "hxm2b6e", "is_submitter": "False", "link_id": "t3_swerj0", "parent_id": "t3_swerj0", "score": "8", "subreddit": "auslaw", "subreddit_id": "t5_2stjv"}, {"author": "DallOggs", "body": "Thank you, reached out to a uni law library and they also explained basically exactly this. Found the case though :)", "created_utc": "1645030091.0", "edited": "False", "id": "hx6xo5x", "is_submitter": "True", "link_id": "t3_stax2v", "parent_id": "t3_stax2v", "score": "2", "subreddit": "AskHistorians", "subreddit_id": "t5_2ssp3"}, {"author": "DallOggs", "body": "Yep, pure administrative chaos", "created_utc": "1645029992.0", "edited": "False", "id": "hx6xepw", "is_submitter": "True", "link_id": "t3_stb35j", "parent_id": "t1_hx54nl1", "score": "1", "subreddit": "auslaw", "subreddit_id": "t5_2stjv"}, {"author": "DallOggs", "body": "Right! I was shocked and so wanted to read the whole judgment — but I found it in an article by JJ Spigelman, “Principle of Legality and the Clear Statement Principle”. Worth a look if you’re interested", "created_utc": "1645029898.0", "edited": "False", "id": "hx6x5mj", "is_submitter": "True", "link_id": "t3_stb35j", "parent_id": "t1_hx4oer7", "score": "2", "subreddit": "auslaw", "subreddit_id": "t5_2stjv"}, {"author": "DallOggs", "body": "Well would you look at that. Cheers!", "created_utc": "1644959874.0", "edited": "False", "id": "hx35b3g", "is_submitter": "True", "link_id": "t3_stb35j", "parent_id": "t1_hx34ayn", "score": "1", "subreddit": "auslaw", "subreddit_id": "t5_2stjv"}, {"author": "DallOggs", "body": "Amazing, thanks!", "created_utc": "1644959699.0", "edited": "False", "id": "hx34txv", "is_submitter": "True", "link_id": "t3_stb35j", "parent_id": "t1_hx347tz", "score": "1", "subreddit": "auslaw", "subreddit_id": "t5_2stjv"}, {"author": "DallOggs", "body": "Thanks, this is super helpful!", "created_utc": "1644106407.0", "edited": "False", "id": "hvrcqb9", "is_submitter": "True", "link_id": "t3_sljoie", "parent_id": "t1_hvra824", "score": "1", "subreddit": "Finanzen", "subreddit_id": "t5_35m5e"}, {"author": "DallOggs", "body": "Don’t think so! Here’s a photo of where it’s coming from. Any thoughts?\n\nhttps://imgur.com/a/SPKaoxS", "created_utc": "1643463295.0", "edited": "False", "id": "hupuaun", "is_submitter": "False", "link_id": "t3_sfgmqg", "parent_id": "t1_huppyoa", "score": "1", "subreddit": "asbestoshelp", "subreddit_id": "t5_4i4ldp"}, {"author": "DallOggs", "body": "Thanks for this, that’s a very helpful clarification", "created_utc": "1633382909.0", "edited": "False", "id": "hfekufr", "is_submitter": "True", "link_id": "t3_q12fj2", "parent_id": "t1_hfco590", "score": "1", "subreddit": "econhw", "subreddit_id": "t5_2ywgb"}, {"author": "DallOggs", "body": "That’s a great answer to my first question, thanks! Still confused about how the discount rate works though. Am I right in thinking it disincentivizes owners of dollars from swapping them for gold by giving them better interest on their savings?", "created_utc": "1633295303.0", "edited": "False", "id": "hf9uu2k", "is_submitter": "True", "link_id": "t3_q0gid9", "parent_id": "t1_hf8ymum", "score": "2", "subreddit": "AskHistory", "subreddit_id": "t5_2sa8i"}, {"author": "DallOggs", "body": "How do Muslims justify buying shares in any public companies at all? The OP has said that owning shares and receiving dividends is permissible as long as the company’s business is permissible. But almost all companies, from BHP to your local florist, will use interest-bearing loans to fund a lot of of their operations. It seems to me than any Muslim who buys a share in BHP or even an ethical ETF is profiting from interest-bearing transactions and thus acting impermissibly.\n\nWhat do you think? Is there a theological way out of this that isn’t just double-think?", "created_utc": "1633051393.0", "edited": "False", "id": "hex8hbe", "is_submitter": "False", "link_id": "t3_pyug0e", "parent_id": "t3_pyug0e", "score": "30", "subreddit": "AusFinance", "subreddit_id": "t5_2uo3q"}, {"author": "DallOggs", "body": "These sound like excellent ideas, thanks", "created_utc": "1628934901.0", "edited": "False", "id": "h8w7ao3", "is_submitter": "True", "link_id": "t3_p441cr", "parent_id": "t1_h8w12g6", "score": "3", "subreddit": "Portuguese", "subreddit_id": "t5_2sqn7"}]