[{"author": "DeliciousGuest6884", "body": "Cute name, and I doubt it.", "created_utc": "1665985564.0", "edited": "False", "id": "isn4wsa", "is_submitter": "False", "link_id": "t3_y61whf", "parent_id": "t3_y61whf", "score": "3", "subreddit": "Ukrainian", "subreddit_id": "t5_2qum6"}, {"author": "DeliciousGuest6884", "body": "You're a fan of Маша и медведь? What.\n\nAlso Russian is not an official language in Ukraine.", "created_utc": "1664759587.0", "edited": "False", "id": "iqtu60f", "is_submitter": "False", "link_id": "t3_xtu4eo", "parent_id": "t1_iqshakf", "score": "6", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "DeliciousGuest6884", "body": "Это не моя вина, что ты необразованный ублюдок", "created_utc": "1664594942.0", "edited": "False", "id": "iql1nnt", "is_submitter": "False", "link_id": "t3_xmtuk9", "parent_id": "t1_iqaktbd", "score": "1", "subreddit": "europe", "subreddit_id": "t5_2qh4j"}, {"author": "DeliciousGuest6884", "body": "Мне надоело писать на английском так что писать буду на своём языке\n\nзавали ебало своё и пошёл ты нахуй блять", "created_utc": "1664392524.0", "edited": "False", "id": "iq9ugtv", "is_submitter": "False", "link_id": "t3_xmtuk9", "parent_id": "t1_iq7a536", "score": "1", "subreddit": "europe", "subreddit_id": "t5_2qh4j"}, {"author": "DeliciousGuest6884", "body": "Дружище,\n\nМы можем беседовать на нашем с тобой родном русском языке)\n\nНе надо скрывать тот факт, что ты россиянин. Ты шо, думал, что если скажешь, что ты из РФ то Бэндэра вылазит с Одесского метро, шоб тебя убить? Ты либо русский, либо наивный иностранец который начитался российского пропадганды.\n\nВ любом случай, ты дебил, ибо ты повторяешь Соловьевские наративы, не зная ни-ху-я о вопросах о которых ты пиздешь", "created_utc": "1664334761.0", "edited": "1664392707.0", "id": "iq6x3gz", "is_submitter": "False", "link_id": "t3_xmtuk9", "parent_id": "t1_iq6bnu8", "score": "1", "subreddit": "europe", "subreddit_id": "t5_2qh4j"}, {"author": "DeliciousGuest6884", "body": "You differentiating the Fins from the Ukrainians is because of your preconviced notions about these countries. \n\nI would argue that Bandera is not the Ukrainian Hitler and he is not the Ukrainian Washington. He is the Ukrainian Jackson or Peter 1. Not a good hero, I agree, but more complicated that you may like to believe. We have lots of great heroes, you just don't know about them because you don't know much about our country.", "created_utc": "1664323261.0", "edited": "False", "id": "iq693uc", "is_submitter": "False", "link_id": "t3_xmtuk9", "parent_id": "t1_iq67q7z", "score": "1", "subreddit": "europe", "subreddit_id": "t5_2qh4j"}, {"author": "DeliciousGuest6884", "body": "Yes that is what we are talking about.\n\nMany groups and individuals allied themselves with the Nazis, including the Stalin and Bandera, only to to end up fighting the Nazis months or years later. Most of UPA's leaders were killed in German concentration camps. All of these partisan groups that were in Poland, Lithuania, Latvia and Belarus to some extent participated in the Holocaust then later fought the Nazis. Some Nazis tried to kill Hitler and some defected and worked for western intelligence agencies.\n\nHow should these complicated individuals people be remembered? What is the difference between a freedom fighter vs a terrorist? You could argue either that groups like UPA and the IRA were terrorists or you could argue they were freedom fighters. When talking about a group, how do you weigh the evil things they have done vs their importance to their nation's history. Jackson, Zhukov, Pilsudski, Jefferson, Bandera, King Leopold, King George II, Peter the First. Why is the genocide and tyranny committed by Peter 1 not criticized and the statues in his honor not criticized? People spend their whole lives studying these questions and you think you have got it figured out. Humble yourself.\n\nYou think you are some moral champion but you care for certain groups more than others. You are a racist. I care for all groups equally and don't ignore one groups suffering just because another group also suffered.\n\nAlso Azov is a regiment and not a battalion. I know you aren't a big reader, but check out these articles. \n\n[https://unherd.com/2022/05/why-russia-fears-the-azov-battalion/?=frlh](https://unherd.com/2022/05/why-russia-fears-the-azov-battalion/?=frlh) \n\n[https://euromaidanpress.com/2022/04/02/how-the-west-enabled-genocide-in-mariupol-with-its-misguided-azov-obsession/](https://euromaidanpress.com/2022/04/02/how-the-west-enabled-genocide-in-mariupol-with-its-misguided-azov-obsession/) \n\n[https://euromaidanpress.com/2022/04/07/what-is-azov-regiment-honest-answers-to-the-most-common-questions/](https://euromaidanpress.com/2022/04/07/what-is-azov-regiment-honest-answers-to-the-most-common-questions/) \n\n[https://krytyka.com/en/articles/too-much-ado-about-ukrainian-nationalists-the-azov-movement-and-the-war-in-ukraine](https://krytyka.com/en/articles/too-much-ado-about-ukrainian-nationalists-the-azov-movement-and-the-war-in-ukraine)", "created_utc": "1664321378.0", "edited": "1664322099.0", "id": "iq652yq", "is_submitter": "False", "link_id": "t3_xmtuk9", "parent_id": "t1_iq6103c", "score": "1", "subreddit": "europe", "subreddit_id": "t5_2qh4j"}, {"author": "DeliciousGuest6884", "body": "нє, ви не поняли, її написали по приколу", "created_utc": "1664319189.0", "edited": "False", "id": "iq60b5e", "is_submitter": "False", "link_id": "t3_u683d9", "parent_id": "t1_i58fjel", "score": "2", "subreddit": "belarus", "subreddit_id": "t5_2r2ad"}, {"author": "DeliciousGuest6884", "body": "Lol. Read a book. There is nuance to everything", "created_utc": "1664318481.0", "edited": "False", "id": "iq5yr6y", "is_submitter": "False", "link_id": "t3_xmtuk9", "parent_id": "t1_iq5ylbd", "score": "1", "subreddit": "europe", "subreddit_id": "t5_2qh4j"}, {"author": "DeliciousGuest6884", "body": "I'm not ignoring it, I am just trying to have a discussion that includes nuance. You are clearly incapable of that. You write like a child who read an article or two.\n\nNot implying anything of the sort. Just don't speak on things you don't know anything about. Stick to American issues.", "created_utc": "1664317859.0", "edited": "False", "id": "iq5xdtt", "is_submitter": "False", "link_id": "t3_xmtuk9", "parent_id": "t1_iq5wx90", "score": "1", "subreddit": "europe", "subreddit_id": "t5_2qh4j"}, {"author": "DeliciousGuest6884", "body": "I don't think so, Ukrainian always had large amounts of territories that lived and breathed in Ukrainian, including one big city and several medium sized cities. Even in the Soviet Union there were more Ukrainian speakers than the entire population of Belarus. So the starting market was huge.\n\nBut I could see Ukrainians consuming Belarusian content and vice versa and we could use that to decrease the influence of Russian in our countries.", "created_utc": "1664315865.0", "edited": "False", "id": "iq5ssn3", "is_submitter": "False", "link_id": "t3_xm0ajl", "parent_id": "t1_ipor587", "score": "2", "subreddit": "belarus", "subreddit_id": "t5_2r2ad"}, {"author": "DeliciousGuest6884", "body": "You're retarded. Do you know what the soviets did when they occupied Germany? Raped just about every woman in the country among other things. Look up the Rape of Berlin. Yet you have no problem with Russians and Belarusians having statues of people who organized such things. You are just an uninformed hypocrite who hates Ukrainians\n\nAlso, most of the red army was Ukrainians and Belarusians.", "created_utc": "1664314850.0", "edited": "1664316277.0", "id": "iq5qcti", "is_submitter": "False", "link_id": "t3_xmtuk9", "parent_id": "t1_iq5p6x3", "score": "2", "subreddit": "europe", "subreddit_id": "t5_2qh4j"}, {"author": "DeliciousGuest6884", "body": "Read the books I suggested, get basic knowledge on Ukraine and I would happy to have a discussion with you. They discuss the issues you raise. About the Polish being bad. How much ethnic cleansing is okay in your view? What is the line, how many deaths are acceptable?\n\nIf an ethnic group within a country does not have any rights they will often rise up. There is multi generational trauma behind this, Ukrainians rose up and unleashed hell on innocent people, which is wrong. You have a similar situation with ethnic Russians and Russified Ukrainians in the Donbas. They  (some) don't consider themselves Ukrainians and want to embrace their culture. The difference being that they have a state (the biggest in the world) to move to, Ukrainians only had their own state from 1917-1920 and before that the Cossack states and before that Kyivan Rus. Combine this with the two leading ideologies in the interwar period being Communism and Fascism, these people are a product of their time and should be viewed as such.\n\nSo the question is, how do we preserve national identity, develop our language, while also preventing future issues with neighbors and ethnic minorities within our borders? Zelensky offered an idea to have a program with Poland, Belarus, Russia, Hungary, Romania, Moldova, Bulgaria and Slovakia in which their people in Ukraine as well as Ukrainians have opportunities to learn their languages and cultures as well as Ukrainians in their countries have the opportunity to do the same. You keep national/political identity by making this program a Sunday school type thing. Their primary identity should be Ukrainian, if they don't wish to participate in our society then they have the right to move to the country which they consider their homeland. I agree with this idea and I myself would love to learn all the languages of the countries that Ukraine borders. I support the idea of Ukrainian identity being more political than ethnic, but I think as a political nation Ukrainians should speak Ukrainian in addition to their ethnic language and perhaps English.\n\nSo being that the reason we study history is to draw conclusions from the past and to improve our future, I believe we can make the following conclusions;\n\nUkrainian/Polish/Jewish/Russian ethnic clashes are a result of these groups feeling enslaved within their own states and lashing out (with exception of the Jews, but nevertheless they did not have their own state). If you believe in the european project of ethnic states, then I think it is reasonable for these nations to have their own states. This is not the only factor but also the fact that the interwar area was full of radical ideology and this combination of radicalism and war and suppression allowed for the darkest time in European and world history, especially in Eastern Europe. If the Ukrainians are asked to take down their statues of questionable figures, the Poles and the Russians and the Hungarians should be asked to do the same thing with the same vitriol and hatred you seem to have for Ukrainians. But I suspect you view us as lesser. I am not against the removal of the statues (of which there are few, there are more statues of Russian figures in Ukraine), I think this is a reasonable request, so long as our neighbors will listen to our requests. But if you aren't Polish, Hungarian or Russian I don't know why you are even commenting on this issue. We don't need America's opinion on this, we will deal with this with our neighbors and find a fair compromise. I know it's hard for you guys not to insert yourself in every issue in the world.\n\nThe issue is, that we have been treated as an afterthought and a second class people for our entire history, and you demanding the removal of our statues but ignoring the same issue in Russia, Poland and Hungary and ignoring our concerns means that you do not truly view us as a sovereign state and people. This is our perspective.", "created_utc": "1664313242.0", "edited": "1664314020.0", "id": "iq5mduc", "is_submitter": "False", "link_id": "t3_xmtuk9", "parent_id": "t1_iq4l9n9", "score": "1", "subreddit": "europe", "subreddit_id": "t5_2qh4j"}, {"author": "DeliciousGuest6884", "body": "за\n\nроз\n\nна\n\nпід\n\nнад\n\nз\n\nпо\n\nперед\n\nви\n\nза\n\nдо\n\nвід\n\nпро\n\nоб\n\nв\n\nспів\n\nпри\n\nпроти\n\nThose are all the prefixes I can think of off the top of my head. I may have missed some. I can offer explanations if you need.", "created_utc": "1664244520.0", "edited": "1664250193.0", "id": "iq1xrp8", "is_submitter": "False", "link_id": "t3_xp38ow", "parent_id": "t3_xp38ow", "score": "7", "subreddit": "Ukrainian", "subreddit_id": "t5_2qum6"}, {"author": "DeliciousGuest6884", "body": "I'm going to just agree with everything you said because you clearly know what you are talking about. I was also not trying to go super into detail because I am not an expert and I wouldn't be as eloquent as you in your explanation, but also because these points only become more important for non native speakers to understand at the upper B2 to C1 level (this is just my opinion on language learning, feel free to disagree.)\n\n  \nAs for language not being correct, I agree with what you said that the standards are arbitrary and I think it is interesting that people speak differently, but because of our Soviet and Russian legacy, a learner that speaks with what would be considered by a large majority of Ukrainians to be a village/strong western accent may face some unpleasantness. That is adding on top of the fact that in most of Ukraine it is not comfortable to speak Ukrainian. \n\n  \nThe strong и-е merger, as I think you would agree, doesn't have a very positive connotation. How would most Ukrainians react to speech such as \"ми зходеле до склепу і там купеле бараболю та пероги\"? Obviously, people use devoicing but that is what I was imagining basically. Obviously I think this is dumb that people judge, but this is just kind of the reality we live in. Or maybe I am pessimistic.\n\n  \nBy укання, I mean that I often turn unstressed о into у\n\nПросту \n\nвсе нурмальну\n\nIt is somewhere in between у and о, I don't know how typical this is for Ukrainian speech, I have never really paid attention.", "created_utc": "1664243425.0", "edited": "False", "id": "iq1vcj3", "is_submitter": "False", "link_id": "t3_xlno52", "parent_id": "t1_iq1agp4", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "DeliciousGuest6884", "body": "СУУУКККК", "created_utc": "1664228709.0", "edited": "False", "id": "iq0ydls", "is_submitter": "False", "link_id": "t3_xoee6z", "parent_id": "t3_xoee6z", "score": "2", "subreddit": "ukraina", "subreddit_id": "t5_30y53"}, {"author": "DeliciousGuest6884", "body": "Why is the ethnic cleansing of Poles by Ukrainians more important than the ethnic cleansing of Ukrainians by Poles that you so delicately call \"being mean\"? You're oversimplifying a complex issue.\n\n[https://books.huri.harvard.edu/books/ukrainian-nationalism-in-the-age-of-extremes](https://books.huri.harvard.edu/books/ukrainian-nationalism-in-the-age-of-extremes)\n\n[https://books.huri.harvard.edu/books/the-frontline](https://books.huri.harvard.edu/books/the-frontline)\n\n[https://www.amazon.com/Bloodlands-Europe-Between-Hitler-Stalin/dp/1541600061/ref=pd\\_bxgy\\_sccl\\_2/135-8759389-7504324?pd\\_rd\\_w=vXy8g&content-id=amzn1.sym.7757a8b5-874e-4a67-9d85-54ed32f01737&pf\\_rd\\_p=7757a8b5-874e-4a67-9d85-54ed32f01737&pf\\_rd\\_r=BV1PBYSCN9QBH0KHDGSY&pd\\_rd\\_wg=JwfXA&pd\\_rd\\_r=c3a4576b-40e7-48d1-bcea-f90bd1d1e24d&pd\\_rd\\_i=1541600061&psc=1](https://www.amazon.com/Bloodlands-Europe-Between-Hitler-Stalin/dp/1541600061/ref=pd_bxgy_sccl_2/135-8759389-7504324?pd_rd_w=vXy8g&content-id=amzn1.sym.7757a8b5-874e-4a67-9d85-54ed32f01737&pf_rd_p=7757a8b5-874e-4a67-9d85-54ed32f01737&pf_rd_r=BV1PBYSCN9QBH0KHDGSY&pd_rd_wg=JwfXA&pd_rd_r=c3a4576b-40e7-48d1-bcea-f90bd1d1e24d&pd_rd_i=1541600061&psc=1)\n\n[https://www.amazon.com/Ukrainian-Insurgent-Army-Upa/dp/1783310286](https://www.amazon.com/Ukrainian-Insurgent-Army-Upa/dp/1783310286)\n\n[https://www.amazon.com/Thousands-Roads-Memoir-Ukrainian-Underground/dp/0786407646/ref=sr\\_1\\_1?crid=1T8NXRJWGGPFS&keywords=maria+savchyn&qid=1664225915&s=books&sprefix=maria+savchyn%2Cstripbooks%2C77&sr=1-1](https://www.amazon.com/Thousands-Roads-Memoir-Ukrainian-Underground/dp/0786407646/ref=sr_1_1?crid=1T8NXRJWGGPFS&keywords=maria+savchyn&qid=1664225915&s=books&sprefix=maria+savchyn%2Cstripbooks%2C77&sr=1-1)\n\n[https://books.huri.harvard.edu/books/after-the-holodomor-the-enduring-impact-of-the-great-famine-on-ukraine](https://books.huri.harvard.edu/books/after-the-holodomor-the-enduring-impact-of-the-great-famine-on-ukraine)\n\n[https://www.amazon.com/Gates-Europe-History-Ukraine/dp/1541675649/ref=d\\_pd\\_sim\\_sccl\\_2\\_2/135-8759389-7504324?pd\\_rd\\_w=satjg&content-id=amzn1.sym.9125e5ab-ea95-44ef-9958-112d5f0f26f0&pf\\_rd\\_p=9125e5ab-ea95-44ef-9958-112d5f0f26f0&pf\\_rd\\_r=S00Z17CJ8PKNYDSB37NE&pd\\_rd\\_wg=3qFBt&pd\\_rd\\_r=a3483574-15ad-40a1-9fea-6a8a14936e25&pd\\_rd\\_i=1541675649&psc=1](https://www.amazon.com/Gates-Europe-History-Ukraine/dp/1541675649/ref=d_pd_sim_sccl_2_2/135-8759389-7504324?pd_rd_w=satjg&content-id=amzn1.sym.9125e5ab-ea95-44ef-9958-112d5f0f26f0&pf_rd_p=9125e5ab-ea95-44ef-9958-112d5f0f26f0&pf_rd_r=S00Z17CJ8PKNYDSB37NE&pd_rd_wg=3qFBt&pd_rd_r=a3483574-15ad-40a1-9fea-6a8a14936e25&pd_rd_i=1541675649&psc=1)\n\n[https://books.huri.harvard.edu/books/the-future-of-the-past](https://books.huri.harvard.edu/books/the-future-of-the-past) \n\nCheck out these books.", "created_utc": "1664226314.0", "edited": "1664226535.0", "id": "iq0sfgn", "is_submitter": "False", "link_id": "t3_xmtuk9", "parent_id": "t1_iq07ui0", "score": "2", "subreddit": "europe", "subreddit_id": "t5_2qh4j"}, {"author": "DeliciousGuest6884", "body": "For the record Ukrainians don't really care about Bandera. I don't support naming streets and statues after them. Also he was in prison in Germany when the Volyn massacre occurred. If anyone it was Shukhevych who was responsible for killing Poles, but again, you obviously are out of your depth.\n\nHow is genocide of neighbors different than any other form of genocide? Were native Americans not the neighbors of the United States? And black people?\n\nl'll stop talking about Bandera when the Poles stop talking about Józef Piłsudski. I don't expect them to or demand that they do that. He killed Ukrainians and is important to their history and identity as a nation. We are big boys and can move past this and understand things are complicated.\n\nBut again, most people in Ukraine and Poland don't care about these issues. I doubt you speak Polish and Ukrainian/Russian and have been to these places and talked to people, but I do. There is a reason Poland is our biggest ally despite the back and forth killing. They understand  that once you get past your high school level talking points, history is complicated and most importantly, in the past. You and I are just getting worked up about it on the internet cause we are interested in history and are politically active people.", "created_utc": "1664217493.0", "edited": "1664217711.0", "id": "iq05did", "is_submitter": "False", "link_id": "t3_xmtuk9", "parent_id": "t1_iq03h2g", "score": "1", "subreddit": "europe", "subreddit_id": "t5_2qh4j"}, {"author": "DeliciousGuest6884", "body": "Every country has statues built in the honor of disgusting men who were important to their nations history. I don't like these sorts of statues but it isn't a uniquely Ukrainian problem. The US has hundreds of Robert E Lee statues and schools named in his honor. Andrew Jackson is on the 20 dollar bill and he played a massive part in the genocide of native Americans. The whole country in which you reside is a slave state built on genocide that imprisons its minorities at alarming rate and forces them to do free labor. How about the fact that the US completely ignores its history in putting all japanese americans in internment camps. Take down your FDR statues and rename everything named after him. You have no moral authority on this issue. You have your dark pages in history, we have ours.\n\nAnd you say Russia has justification for denazifying Ukraine. Lol. Learn Russian, learn their history, go to Moscow and walk around and you'll realize the amount of genocidal freaks they same their streets after and build statues to. How many things in Belgium are named after King Leopold? You are talking about countries to which you and have never been, know nothing about, whose languages you don't speak and whose cultures are foreign to you.\n\nSo get off your high horse, you pretentious prick.", "created_utc": "1664213779.0", "edited": "1664214491.0", "id": "ipzvpwo", "is_submitter": "False", "link_id": "t3_xmtuk9", "parent_id": "t1_ipziq98", "score": "1", "subreddit": "europe", "subreddit_id": "t5_2qh4j"}, {"author": "DeliciousGuest6884", "body": "I cited a scholarly article discussing the polish ethnic cleansing of Ukrainians, no way defended Ukrainian ethnic cleansing of poles, just pointing out the facts. Then you say I deserve to be bombed. Maybe read the article, it talks about the things Ukrainians did too.\n\nNice. Useful idiot.", "created_utc": "1664207984.0", "edited": "False", "id": "ipzgr0g", "is_submitter": "False", "link_id": "t3_xmtuk9", "parent_id": "t1_ipyjw03", "score": "1", "subreddit": "europe", "subreddit_id": "t5_2qh4j"}, {"author": "DeliciousGuest6884", "body": "\"the UPA did continue to kill Polish civilians and destroy Polish  \nproperty. However, this was now usually part of a more or less proportional response to attacks by Poles: Polish soldiers, Polish security forces, Polish right-wing nationalist partisans (groups that had remained outside the AK command), or Polish security forces dressed as partisans, or indeed Polish partisans disguised as soldiers. In Poland in 1945, it is likely that more Ukrainians were killed by Poles than Poles were killed by Ukrainians.\"\n\n[“To Resolve the Ukrainian Question Once and For All”: The Ethnic Cleansing of Ukrainians in Poland, 1943-1947](https://cis.mit.edu/sites/default/files/documents/ToResolveTheUkrainianQuestion.pdf)\n\nThe Poles name their streets and build monuments to people who killed Ukrainians and oppressed our people. It was a dark time in history and no one was innocent. Don't speak so confidently on things you don't understand.", "created_utc": "1664166028.0", "edited": "False", "id": "ipxlaii", "is_submitter": "False", "link_id": "t3_xmtuk9", "parent_id": "t1_ipwecb7", "score": "1", "subreddit": "europe", "subreddit_id": "t5_2qh4j"}, {"author": "DeliciousGuest6884", "body": "And the same amount of Ukrainians were exterminated by the Poles", "created_utc": "1664142506.0", "edited": "False", "id": "ipw7xh5", "is_submitter": "False", "link_id": "t3_xmtuk9", "parent_id": "t1_ipvypfg", "score": "1", "subreddit": "europe", "subreddit_id": "t5_2qh4j"}, {"author": "DeliciousGuest6884", "body": "I am from Ukraine. We were required to study Russian and English. Russian is my first language but not my native language and my school was a Russian language school, like all the schools in my city at the time. So Ukrainian was treated as a foreign language that we had classes in, but if your parents didn't want you to study Ukrainian they could write a note and you wouldn't have to take this class.\n\nNative language in Ukrainian and Russian languages has an ethnic and political connotation, saying which language is your native language is more about identifying yourself and less about which language you spoke your first words in.", "created_utc": "1664135379.0", "edited": "False", "id": "ipvpt28", "is_submitter": "False", "link_id": "t3_xnty9k", "parent_id": "t3_xnty9k", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "DeliciousGuest6884", "body": "We will pay the Poles back when they pay us back for occupying us, ethnic cleansing us and repressing us.", "created_utc": "1664134839.0", "edited": "False", "id": "ipvocgx", "is_submitter": "False", "link_id": "t3_xmtuk9", "parent_id": "t1_iptvmn9", "score": "0", "subreddit": "europe", "subreddit_id": "t5_2qh4j"}, {"author": "DeliciousGuest6884", "body": "невероятно грустная ситуация что молодые ребята погибают ни за что, но я рад, что он не среди живых", "created_utc": "1664134543.0", "edited": "1664134730.0", "id": "ipvnjjz", "is_submitter": "False", "link_id": "t3_xngfi4", "parent_id": "t1_iptwb6l", "score": "1", "subreddit": "liberta", "subreddit_id": "t5_38s9u"}, {"author": "DeliciousGuest6884", "body": "Hopefully if Russia is able to become a normal country, they will stop funding all these far right parties. It creeps me out.", "created_utc": "1664099830.0", "edited": "False", "id": "iptm7eb", "is_submitter": "False", "link_id": "t3_xmtuk9", "parent_id": "t1_iptlq78", "score": "3", "subreddit": "europe", "subreddit_id": "t5_2qh4j"}, {"author": "DeliciousGuest6884", "body": "The glorification of Nazi Germany is not at all popular in my country and I have no disdain for the German people. I would invite you to come to Ukraine and talk to people and see for yourself, you would get a warm welcome. I assume you don't mean to be provocative but your question in and of itself is very offensive and misinformed.\n\nThe USSR (Stalin era) and Nazi Germany are viewed pretty much in the same light. About 4 million Ukrainians were killed by Stalin and 1 million Ukrainians were killed by Hitler.\n\nIn the west of the country (eastern Poland at the time) people heard about the horrors of the famine and the repressions in the east. Read Anne Applebaum's book Red Famine to understand what was happening in the east and why they speak Russian there (most of the Ukrainians were starved to death and Russians were moved in). So in the beginning of the war people had a choice, go fight for the Germans or for the Russians. People didn't know just how evil Nazi Germany was at the time so in the first years of the war many from today's Western Ukraine were allied with the Nazis. No one is proud of this fact. Soon they realized that they were just as bad as the Russians and formed partisan groups that would fight against both the Nazis and the Russians. However, most Ukrainians' ancestors fought in the Red army. Some of them were Nazi collaborators, some of them fought in the forests. Some were victims of mass killings from both sides. This story is also true for the Baltic states, though I am not an expert on their history so I won't go into detail. We have a complicated history and it confuses me why you consider Ukrainians to be some super Nazis when the French had more collaborators than Ukraine did.\n\nI wrote another comment in this thread about why eastern Europeans are frustrated with the German people if you care to read it. There is no disdain or hatred, just disappointment and frustration.\n\n>Be happy that we help a country such as yours that is as hostile to us as you are. Also - get rid of all your problems before asking to join our union, nazi apologist.\n\nThese kind of comments are common from Germans. You view us as untermenschen who don't deserve life, and should be kissing your feet for any assistance. Germans stereotypically love being flattered and don't take criticism well (atleast on the political level), but of course these are just stereotypes. My point being is I'm not too surprised by this comment, which is why I said it made me laugh. You have never been here. You don't know our problems, you don't know what is happening here. You know nothing of my country yet you act as if you are the decider of what is correct and what is not. You think you can somehow govern my country better than I can. I don't want to put words in your mouth but this is the vibe I get from these type of comments. All the Poles and Lithuanians and Estonians and Latvians I know say the same thing. But that is anecdotal and I don't live there so I can't say for sure. If you don't understand why comments like these are offensive and dumb considering the history of your country and its foreign policy post WW2, then I don't really see a point in discussing this issue with you.\n\nEdit:\n\nBtw Glorification of Nazi Germany, using Nazi propaganda, display of Nazi symbols and antisemitism in Ukraine are all criminalized.", "created_utc": "1664098613.0", "edited": "1664099990.0", "id": "iptkqr5", "is_submitter": "False", "link_id": "t3_xmtuk9", "parent_id": "t1_iptjib9", "score": "2", "subreddit": "europe", "subreddit_id": "t5_2qh4j"}, {"author": "DeliciousGuest6884", "body": "What I am saying that Ukraine's Nazi problem deserves the same amount of attention as France's or Germany's. We agree that it is a problem that exists that deserves some level of attention. But because it is a Russian talking point it gets talked about constantly and it hurts our relations with countries who we rely on to survive (in the literal sense) at the moment. So I'm not trying to be defensive it just seems like it is overplayed in the media in proportion to the scale of the issue. And that is dangerous for us.\n\nBased on the news you would think that Ukraine is some far right hell hole. This just isn't true and it sucks to be called a Nazi on here when I am just defending my country that is getting fucked from every angle.", "created_utc": "1664097671.0", "edited": "1664099332.0", "id": "iptjnl9", "is_submitter": "False", "link_id": "t3_xmtuk9", "parent_id": "t1_iptj49l", "score": "3", "subreddit": "europe", "subreddit_id": "t5_2qh4j"}, {"author": "DeliciousGuest6884", "body": "This one made me laugh.", "created_utc": "1664096783.0", "edited": "False", "id": "iptimjg", "is_submitter": "False", "link_id": "t3_xmtuk9", "parent_id": "t1_ipti372", "score": "1", "subreddit": "europe", "subreddit_id": "t5_2qh4j"}, {"author": "DeliciousGuest6884", "body": "Yes it is nuts to wear that patch. I agree. Every Ukrainian would agree. My issue with your statement was the implication that this was some huge issue and not just one weirdo. That type of rhetoric makes western countries stop supporting us and gets us killed. Criticize the guy as much as you want but be mindful about the implication of your words when you start lumping us together.\n\nYeah that patch is just a Lion with some crowns. Lviv literally means the city of lions so most people would not recognize this (including me) and think it is just some old Lviv banner from the 19th century. I've never seen it before (maybe one time in school that I don't remember) because we don't have people walking around wearing that stuff. \n\nI think you are a little too much in your own world and like getting worked up about seeing secret Nazi things everywhere you look. I understand Germans being extra sensitive to this so I don't fault you. And I understand it is your hobby to research this history and learn about the symbols, it actually can be interesting. However, in reality 99% of the people here, like in most places, are normal. So just take it easy a bit.", "created_utc": "1664096035.0", "edited": "1664096493.0", "id": "ipthrm2", "is_submitter": "False", "link_id": "t3_xmtuk9", "parent_id": "t1_ipth8bl", "score": "2", "subreddit": "europe", "subreddit_id": "t5_2qh4j"}, {"author": "DeliciousGuest6884", "body": "First of all - most people don't know historical patches and would just think this is a normal Army skull patch. Maybe the guy doesn't even know. Yes, if the guy doesn't know tell him to not wear it. If he does know and has Nazi views and isn't a just an idiot who wants to troll Russians or be edgy or whatever kick him out of the army, sure.\n\nThe thing is if you go on a deployment and look at a bunch of American guys' patches you will find all sorts of problematic stuff. Yes, this is bad. But the problem is that this is not a systematic issue in Ukraine, yep they're is one weirdo with a patch, yell at him have him throw it away, arrest him, I really don't care. But because Russia has spent a lot of money over many years building this narrative stuff like this makes uninformed people in the west think we are Nazis and have this huge far right problem. This causes western governments to not support us as much and get us killed.\n\nThat is the reason Ukrainians fight against all these stuff so hard isn't because we are Nazis or don't care about this stuff it's just the same as it is in any country. Sure, we should combat that problem in every country but you guys make us out to be super radicals all the time.\n\nI have never met a far right person in my life even and I didn't really know about all this Nazi stuff until Russia started talking about how we are Nazis in 2004 because we had protests against rigged elections. Then they spent money on spreading that narrative in the west and when they invaded in 2014 no one cared because we were seen as a bunch of corrupt uneducated Nazis.\n\nAlso, we got bigger problems at the moment so while I agree its bad, I cannot find the energy to give a fuck about a patch on some guy's backpack when I read about 400 bodies in a mass grave and entire families executed in a town 100 kilometers away from me.", "created_utc": "1664095554.0", "edited": "False", "id": "ipth6fd", "is_submitter": "False", "link_id": "t3_xmtuk9", "parent_id": "t1_iptgbp8", "score": "2", "subreddit": "europe", "subreddit_id": "t5_2qh4j"}, {"author": "DeliciousGuest6884", "body": ">It IS AN SYSTEMATIC ISSUE if the soldiers stands next to Selensky and nobody cares:\n\nMost normal people who aren't obsessed with finding Nazis or being Nazis don't know what Nazi patches look like. I have never seen this patch before and I don't think any one I know would recognize it. Maybe Germans know it better because of your education system, but we don't study patches.\n\n&#x200B;\n\n>PR team that doesn’t care.\n\nThe PR team does care. Zelensky posted this photo, people commented saying what it is, he deleted the post. We don't know what went on behind the scenes and if he got reprimanded. Zelensky is jewish and lost his family in the Holocaust, our prime minister is jewish and our minster of defence is jewish. Trust me, there aren't any secret Nazis at the top of government.\n\n>If nazi symbols are banned by law, it is obviously not enforced.\n\nBuddy, we are dealing with hundreds of cases of rape of women and children by Russian soldiers, torture, traitors and collaborators, mass graves, deoccupying our territories, restoring bombed out schools and hospitals, a collapsed economy and the biggest refugee crisis since WW2. The prosecutor's office doesn't have a lot of time to look through photos and go after a guy for a patch. Everyone agrees that this isn't a good thing but come on man read the room.\n\n>„Clean up“ means to kick Neo-Nazis out of governmental service and charge them for wearing nazi emblems\n\nI agree with you that this should happen and in peacetime this may be a bigger deal. But, again, normal people don't know what this patch is and don't have energy to give a fuck to make a scandal out of this. I know you can't empathize with what is like to live in a war zone and you considered yourself principled, but trust me, if you were living here this would be the last of your concerns. Again, not to minimize the issue, people just aren't thinking about this because it isn't a widespread or systemic issue. Yes people with far right views join the military to protect their nation from extinction, you have people like this in all militaries.\n\n>The only correct interaction with Nazis is to put a bullet to their head, like their idol did\n\nThis is dumb.\n\nBut please be more careful with how you paint Ukrainians and your wording. I am begging you, it is much more important than you realize.", "created_utc": "1664094375.0", "edited": "1664094780.0", "id": "iptfpu1", "is_submitter": "False", "link_id": "t3_xmtuk9", "parent_id": "t1_iptemah", "score": "4", "subreddit": "europe", "subreddit_id": "t5_2qh4j"}, {"author": "DeliciousGuest6884", "body": ">However my main point is that drawing the good 'ol NS card seeing OCs flair is a very weak point to make when trying to debate. I'm sure OC would overthink their sentence now you pointed out what the wording could imply, but you could have just gotten to the point instead. Your further comments are much better for educating peiole. It would be great if you could recognize that.\n\nI agree with you 100%, but as you can understand the Nazi stuff gets very old very fast. We usually hear this narrative from Russians (pro-Putin and not) so I tend to go on the defensive and assume the worst.\n\nJust to be clear there isn't really bitterness in Ukraine towards Germans or Germany for the past or shortcomings now. We are grateful for any and all support we get. But it just really sucks seeing headlines like Germany blocking Spain's shipments of tanks. The attitude isn't like \"fuck Germany\", it's \"oh come on guys what are you doing?\" Meaning, we aren't really surprised.\n\nI agree the descendants of Nazis thing is a low blow and a weak argument and I apologize for that. Thanks for the polite reply.\n\nLife just sucks man.\n\nEdit:\n\nThe funny thing about the antifascist guy is we probably agree on most things because I am a democratic-socialist. He just probably has a skewed view of Ukraine and our past due to Soviet and Russian propaganda that most leftists eat up. I wish those people would just come and spend a week here and talk to people and read a book or two on our history.", "created_utc": "1664093086.0", "edited": "1664093520.0", "id": "ipte6o7", "is_submitter": "False", "link_id": "t3_xmtuk9", "parent_id": "t1_iptdoho", "score": "3", "subreddit": "europe", "subreddit_id": "t5_2qh4j"}, {"author": "DeliciousGuest6884", "body": "The point I was making was holding up a mirror to his argument. He said my country has a Nazi problem and wasn't talking about an individual. \n\nMy statement on reparations wasn't an argument. Just an example of yet another time you have managed to fuck us over.", "created_utc": "1664092451.0", "edited": "False", "id": "iptdfff", "is_submitter": "False", "link_id": "t3_xmtuk9", "parent_id": "t1_iptcshx", "score": "6", "subreddit": "europe", "subreddit_id": "t5_2qh4j"}, {"author": "DeliciousGuest6884", "body": "Не знаю, как себя чувствовать.\n\nЭто невероятно грустно, что этот парень прожил такую бессмысленную жизнь, но мне реально абсолютно похуй", "created_utc": "1664092227.0", "edited": "1664092624.0", "id": "iptd5fc", "is_submitter": "False", "link_id": "t3_xngfi4", "parent_id": "t3_xngfi4", "score": "55", "subreddit": "liberta", "subreddit_id": "t5_38s9u"}, {"author": "DeliciousGuest6884", "body": "still don't understand why he is doing this, but if the man is having fun good for him, I guess", "created_utc": "1664091746.0", "edited": "False", "id": "iptckqb", "is_submitter": "False", "link_id": "t3_xne4b5", "parent_id": "t3_xne4b5", "score": "35", "subreddit": "TigerBelly", "subreddit_id": "t5_39xxb"}, {"author": "DeliciousGuest6884", "body": ">Alternative für Deutschland is not a classic nazi party like the NDP\n\nNeither is Свобода. I understand the context of this party, that is why I used the comparison. We don't have any public person or politician that would sympathize with Nazi Germany or the SS or anything like that. Our problem has always been with politicians whitewashing the crimes of the Soviet Union and the Russian Empire against the Ukrainian people. We have been fighting for our right to be Ukrainian within our own country for our entire existence. Ukrainians are tolerant, we are at war with Russia and no one cares that people still speak Russian throughout the country (50% of our population, almost 100% in my city), Russian liberals are invited to speak on our television channels, etc. So saying Ukraine has some sort of Nazi problem just shows a person is obviously not informed about the situation in the country and has never been here. And these comments are incredibly hurtful, not to mention dangerous.\n\nThere is no anti-German sentiment, there is frustration at your politicians' arrogance and looking at Eastern Europeans like lessers. I'll paint a picture so you can understand how all of your Eastern neighbors feel. Your country destroyed our countries almost completely, WW2 was mostly fought on our land. Our people were slaughtered. You get American money and the whole world forgives you right away and helps you rebuild (this isn't necessarily bad). We do not get this, instead we get occupied and face internal repressions until 91. We get independence then your government signs gas deal after gas deal with Russia, ignoring the security and economic concerns of your neighbors. Your government says it owes Russia because of WW2, again ignoring the fact that WW2 was mostly fought on our land. Ukraine gets invaded because you jeopardized all of Eastern European security. Then we hear from the descendants of Nazis that we are the actual Nazis and we need to get our act together. We react poorly to this and tell you you have no understanding of the history of our region and what is going on in our countries and what happened here. That is okay, we don't expect you to understand, but you act like you know better. You call us emotional and irrational and continue to westplain to us on just about every issue there is. You refuse to learn from your mistakes and listen to those who know what they are talking about. We speak Russian, we studied their literature in school, we know their history and culture and how their country and politics work. Yet you refuse to listen. Again and again. Merkel says she regrets nothing. And Germans get upset when the Ukrainian ambassador vocalizes this thought that is held in all countries east of you. All of this is happening while bombs are raining on my city every single day. And then you stop our other allies from giving us tanks and other weapons that save lives.\n\nWe appreciate the help you have given us, don't get me wrong. But sometimes you guys can be pretty naive. To be clear I am talking about politicians, not people.\n\nI am just explaining what we have been trying to explain to you for decades.", "created_utc": "1664090092.0", "edited": "1664091546.0", "id": "iptakze", "is_submitter": "False", "link_id": "t3_xmtuk9", "parent_id": "t1_ipt7qf2", "score": "1", "subreddit": "europe", "subreddit_id": "t5_2qh4j"}, {"author": "DeliciousGuest6884", "body": "You implied it.\n\nIf we aren't making assumptions based on countries then you should say \"that guy should be held responsible for wearing that patch\" instead of claiming it is a Ukrainian problem or some sort of systematic issue that needs to be cleaned up any more than in any democratic state where you  have people with radical views that you do not agree with. The same issue exists in France, Germany, the US, Poland and others and on a larger scale. Signaling out Ukraine is odd, especially considering Russian propaganda and their justification for the slaughter of my people.\n\nNazi symbols are banned in Ukraine by the way, the laws in the country treat Nazi and Soviet symbols and propaganda the same way. We have antisemitism defined and classified as a hate crime that should be punished. Same goes for other forms of discrimination. What do you suggest we do to \"clean up\"?", "created_utc": "1664084644.0", "edited": "1664085750.0", "id": "ipt3k7a", "is_submitter": "False", "link_id": "t3_xmtuk9", "parent_id": "t1_ipt34it", "score": "-18", "subreddit": "europe", "subreddit_id": "t5_2qh4j"}, {"author": "DeliciousGuest6884", "body": "You are doing the same thing brother.\n\nAntifascist lol, every normal person is an antifascist.", "created_utc": "1664084186.0", "edited": "1664084450.0", "id": "ipt2xbl", "is_submitter": "False", "link_id": "t3_xmtuk9", "parent_id": "t1_ipt2t9x", "score": "-9", "subreddit": "europe", "subreddit_id": "t5_2qh4j"}, {"author": "DeliciousGuest6884", "body": "That's pretty rich coming from a German. Alternative für Deutschland got more votes than our far right party Свобода. Let's clean up together :)\n\nGerman arrogance never ceases to amaze me. You have a country full of former Nazi judges, police officers, prosecutors and administrators that never got punished and got to hide their past and get rich from American money. The Americans forgave you and built your country, yet that does not stop you from virtue signaling about democracy and what it means to be \"western\" and \"cultured\" to the nations which your fathers and grandfathers raped and pillaged.\n\nHow about we wait at least 100 years from the genocide Germany committed to lecture the nation that is suffering its 3rd genocide in the last century, mkay?\n\nBtw still waiting on the reparations for the 1 million Ukrainians killed by Germans. Checks sent to Moscow don't count.", "created_utc": "1664083652.0", "edited": "False", "id": "ipt26xj", "is_submitter": "False", "link_id": "t3_xmtuk9", "parent_id": "t1_ips4syr", "score": "-13", "subreddit": "europe", "subreddit_id": "t5_2qh4j"}, {"author": "DeliciousGuest6884", "body": "Gender equality was awful in the Soviet Union.", "created_utc": "1664081479.0", "edited": "False", "id": "ipsz1zf", "is_submitter": "False", "link_id": "t3_xmrgle", "parent_id": "t1_iprlaq3", "score": "1", "subreddit": "europe", "subreddit_id": "t5_2qh4j"}, {"author": "DeliciousGuest6884", "body": "This man has a good soul", "created_utc": "1663965412.0", "edited": "False", "id": "ipmzw68", "is_submitter": "False", "link_id": "t3_xm4up7", "parent_id": "t3_xm4up7", "score": "7", "subreddit": "TigerBelly", "subreddit_id": "t5_39xxb"}, {"author": "DeliciousGuest6884", "body": "I am from Kharkiv. I love every different dialect of Ukrainian, I don't like how in Russian there are basically no accents and variations of the language even though it is spoken in many countries. I obviously understand this is an exaggeration, but I think it is weird and kind of creepy to be honest. It makes the language feel artificial. So I love different accents in Ukrainian and variations of the language, I think it is interesting and dislike when people shit on people for not speaking the \"proper way\". I think that is something that we got from Russians and have put on to our language and situation. \n\nSpeak how you want! Who am I to judge how other people speak? My native language is Russian and I don't like how I sound in this language and I don't feel like myself in it, so I changed it. I don't know if I will ever speak it again. It is a weird feeling basically ignoring your native language, but I think it is important for my development as a person and my countries development.\n\nBad Ukrainian is better than perfect Russian in my opinion.", "created_utc": "1663964962.0", "edited": "False", "id": "ipmyv9t", "is_submitter": "False", "link_id": "t3_xlno52", "parent_id": "t1_iplwowr", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "DeliciousGuest6884", "body": "Прошу!", "created_utc": "1663943944.0", "edited": "False", "id": "iplnpey", "is_submitter": "False", "link_id": "t3_xlno52", "parent_id": "t1_ipljyjs", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "DeliciousGuest6884", "body": ">verb endings \"-ться\" are pronounced \"ця\"\n\nIt seems phonetic to me? I can't even try to pronounce it a different way. тьс = ц in my head phonetically\n\nWoah I never realized т and д in шістьнадцять were silent until now.\n\nAlso, I would argue that pronouncing и like е is not necessarily correct, while also not being incorrect and common. If you are teaching a Russian class you would explain that хорошо is pronounced харашо, but I don't know if I would tell students studying Ukrainian to pronounce бачити like бачите. Or maybe I would just be a bad teacher! Same thing with укання which I personally do without noticing.", "created_utc": "1663943479.0", "edited": "False", "id": "iplmpte", "is_submitter": "False", "link_id": "t3_xlno52", "parent_id": "t1_ipllc6e", "score": "4", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "DeliciousGuest6884", "body": "You're the best type of person. Thank you!", "created_utc": "1663942774.0", "edited": "False", "id": "ipll7px", "is_submitter": "False", "link_id": "t3_xlno52", "parent_id": "t1_ipkt6fo", "score": "4", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "DeliciousGuest6884", "body": "Я теж так думаю. Однак є можливість, що він просто малорос найвищого сорту.", "created_utc": "1663939687.0", "edited": "False", "id": "ipleunr", "is_submitter": "False", "link_id": "t3_xlno52", "parent_id": "t1_iplcjbn", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "DeliciousGuest6884", "body": "His Ukrainian over the past year hasn't changed that much, but from 2019 when he was running for president it has improved a lot. Apparently he now speaks Ukrainian in his personal life. When he does interviews in Russian he often forgets Russian words and seems more comfortable in Ukrainian. However, I'm not sure if this is an act.", "created_utc": "1663939485.0", "edited": "False", "id": "ipleg4v", "is_submitter": "False", "link_id": "t3_xlno52", "parent_id": "t1_iplc685", "score": "8", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "DeliciousGuest6884", "body": "Right now our most popular author is **Сергій Жадан**, he writes prose and poetry, much of his work is about the war in Dobas as he is from Kharkiv. This is like the new Ukrainian classic writer, he made his mark in Ukrainian literature. There is also **Макс Кідрук** who is a very popular science fiction writer. To be honest, I don't read a lot of Ukrainian literature, if anything I read western literature and pop science books in translation. But after 2014 we had an explosion of the Ukrainian market so I know there is a lot of great stuff. I would look at the BBC Книга року awards to get a gauge what people think is good. Books I read in Ukrainian are usually about Ukrainian history and politics. The best Ukrainian history books in my opinion are by **Сергій Плохій**, who is the director of the Ukrainian Institute at Harvard. I like his books Брама Європи (whole general history of Ukraine in 400 pages, interesting read) and  Походження Слов'янських Нації (self explanatory). He has like 10 books which are all great.\n\n**Here are the most famous contemporary Ukrainian films:**\n\n[МОЇ ДУМКИ ТИХІ / MY THOUGHTS ARE SILENT, офіційний український трейлер, 2019](https://www.youtube.com/watch?v=tKQmaiHCOds)\n\n[Bad Roads](https://www.youtube.com/watch?v=P7SrnSKbUtI)\n\n[Донбасс](https://www.youtube.com/watch?v=RlnBzCx9c8M)\n\n[ДОДОМУ / EVGE, офіційний український трейлер, 2019](https://www.youtube.com/watch?v=7uEf--T5J2c)\n\n**Here is some youtube content that I personally watch:**\n\nStandup comedian who recently switched from Russian to Ukrainian, you can find his old stuff in Russian.\n\n[Василь Байдак - стендап про родичів у Росії та повернення в Київ](https://www.youtube.com/watch?v=HyVFwryNuw4)\n\nThis is my favorite Ukrainian language podcast, they're from Odesa and switched to Ukrainian about 1 or 2 years ago, they are comedians and TV writers, they have old episodes in Russian too.\n\n[Сергій Чирков | ХОРОШИЙ ПОГАНИЙ ЗЛИЙ ПОДКАСТ №96](https://www.youtube.com/watch?v=jgWmlHMEiCQ)\n\nЧБД type of show that used to be in Russian and they switched to Ukrainian after the war\n\n[Загін Кіноманів, Роман Щербан в Клубі Дилетантів #16](https://www.youtube.com/watch?v=JVJmoY2_txM)\n\nStand up comedian who switched to Ukrainian about 2 years ago. He also has this special on youtube in Russian\n\n[Антон Тимошенко - \"Поза Політикою\" | Сольний стендап концерт |](https://www.youtube.com/watch?v=GTWj8IbDjbA)\n\nAnother blogger from Odesa who switched to Ukrainian after the war started\n\n[Елітна мама купляє дітям хати і діаманти/ Дивимося СуперМаму](https://www.youtube.com/watch?v=a1ne0oWMhYY)\n\nDurnev, who you may of heard of who is a popular blogger from Mariupol who switched Ukrainian after the war\n\n[Дурнєв і Бєдняков дивляться сторіс ZОМБІ ч.13 (napisy PL)](https://www.youtube.com/watch?v=LEPYi9wEQo4)\n\nCool interview channel, the person getting interviewed is a journalist who also does his own very cool interviews.\n\n[Сергій Іванов. ДОНБАС РОЗВЕЛИ, ЯК ЛОХА! || РОЗМОВА](https://www.youtube.com/watch?v=csDy0HEFYo4)\n\nAnother interview channel, this episode may be particularly interesting to you.\n\n[ЛЕГІОН СВОБОДА РОСІЇ/ВІЙСЬКОВИЙ РФ ПЕРЕЙШОВ НА БІК УКРАЇНИ/ХТО ВОНИ І КОЛИ ПЕРЕВОРОТ У КРЕМЛІ?](https://www.youtube.com/watch?v=oUi_9mDcquU)\n\nAs you may be able to tell from the amount of people I mentioned who switched to Ukrainian, before the war Ukrainian youtube was pretty small with only a couple of popular channels, whose content I personally don't enjoy. There is a lot of reallllyyy high quality investigative journalism in Ukrainian on youtube but I don't know if that is interesting to you, but I enjoy watching it.\n\nThis is also true with podcasts, I mostly listen to news podcasts, this will give you an idea of what people listen to.\n\n[Apple Podcasts — Ukraine — All Podcasts](https://chartable.com/charts/itunes/ua-all-podcasts-podcasts)\n\nВуса Гоголя is a good podcast about literature they are also from Odesa and switched to Ukrainian two years ago hahaha.", "created_utc": "1663932787.0", "edited": "1663933043.0", "id": "ipl2ydo", "is_submitter": "False", "link_id": "t3_xlno52", "parent_id": "t1_ipkx19n", "score": "14", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "DeliciousGuest6884", "body": "yes", "created_utc": "1663924339.0", "edited": "False", "id": "ipksov8", "is_submitter": "False", "link_id": "t3_xlhat2", "parent_id": "t1_ipkrfha", "score": "4", "subreddit": "europe", "subreddit_id": "t5_2qh4j"}, {"author": "DeliciousGuest6884", "body": "To be honest, Ukrainians are very chill about language. We are at war with Russia and our top politicians speak Russian all the time, we have several government funded news channels in Russian. All of our online newspapers have Russian versions, people speak whatever language they want. Ukrainians are bilingual so the government and society could completely function in Russian if it had to, it could also completely function in Ukrainian. There are a lot of people who have switched or are switching to Ukrainian now just because they don't want to have anything in common with Russia and to protect our information space. It personally annoys me that people tolerate the Russian language so much and I don't consume Russian language content and will never speak this language with a person who understands Ukrainian, but that's just my view.\n\nBut really foreigners probably care about our language situation more than most people here do. Russians don't understand that a person can speak Russian and identify as a Ukrainian and support the development of the Ukrainian language. Also in the west people don't understand that Russian speaking regions and people are not pro Russian, pro Russian people here pretty much don't exist except for \"городские сумасшедшие\" (village idiots). I think this is because people from other countries have a hard time grasping how completely bilingual Ukraine is. I can't think of any other country that every pretty much every citizen can speak two languages at a native level. This is also why many people think the languages are more similar than they are. I would say Polish is more similar to Ukrainian than Russian is.\n\nThat's why the idea of the oppression of the Russian speaking population here is so laughable, it is a non issue.", "created_utc": "1663921076.0", "edited": "False", "id": "ipkpb5a", "is_submitter": "False", "link_id": "t3_xlno52", "parent_id": "t1_ipkohpl", "score": "30", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "DeliciousGuest6884", "body": "I wouldn't call Kyiv a Ukrainian speaking city first of all. Kyiv is probably the most completely bilingual city in the world so people switch based on the situation and if they are trying to make a certain point. It is completely normal to speak Ukrainian at work, Russian with friends, Ukrainian with mom and Russian with dad. The language situation has been changing very fast since 2004. People in Kyiv usually have beautiful Ukrainian but that isn't because of the language spoken there but more about the level of education and it is the most affluent city.\n\nThe official standard has been changing a bit since the fall of the Soviet Union because the Soviet government would change dictionaries and the spelling and grammar rules of Ukrainian to make it more similar to Russian. The idea was to draw the languages closer together so that people would just defer to Russian. Since independence and especially after 2014 there has been an effort to restore Ukrainian to its earlier form. The two most famous Ukrainian poets and the forefathers of the Ukrainian language Taras Shevchenko and Ivan Franko are from the very center and far west of the country respectively. There are also many significant Ukrainian writers from the east. They all wrote in their more western/central/eastern forms of Ukrainian so it is hard to say what the standard is. The Ukrainian language has been so oppressed and so many people have been killed, jailed and ridiculed for speaking and writing in Ukrainian over the past 200 years so the language has developed in a very odd way. But in general, people say Lviv is the cultural capital of Ukraine and it is the only big city that has retained its Ukrainianess throughout its entire recent history (last 100 years), so people consider the Ukrainian spoken by the intelligentsia there to be the standard.\n\nSorry for the long reply but I am very passionate about this topic haha", "created_utc": "1663919257.0", "edited": "1663919684.0", "id": "ipknewa", "is_submitter": "False", "link_id": "t3_xlno52", "parent_id": "t1_ipkk89d", "score": "41", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "DeliciousGuest6884", "body": "Also, for masculine plural nouns we always have и/і ending\n\nпо-русски два мальчика, а українською два хлопці\n\nпо-русски два компьютера, а українською два комп'ютери\n\nи так далее и так далее \n\nКороче, если у вас есть еще какие-то вопросы по поводу языка, то пишите, буду рад вам помочь.", "created_utc": "1663912920.0", "edited": "False", "id": "ipkg3ik", "is_submitter": "False", "link_id": "t3_xlno52", "parent_id": "t1_ipkemjw", "score": "33", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "DeliciousGuest6884", "body": "Ukrainian is 100% phonetic, tho there is some vowel reduction in western dialects that is completely different from the vowel reduction in Russian, but it isn't that widespread and is considered not correct.", "created_utc": "1663911922.0", "edited": "False", "id": "ipkeubx", "is_submitter": "False", "link_id": "t3_xlno52", "parent_id": "t1_ipkea2q", "score": "22", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "DeliciousGuest6884", "body": "Нема за що)", "created_utc": "1663911834.0", "edited": "False", "id": "ipkeq73", "is_submitter": "False", "link_id": "t3_xlno52", "parent_id": "t1_ipkemjw", "score": "12", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "DeliciousGuest6884", "body": "Do what Ukrainians who don't speak Ukrainian well do. They just try their best to talk and when they don't know a word they say it in Russian and someone else in the group you are speaking with will tell you how to say it in Ukrainian. It is pretty easy for Russian speakers to learn Ukrainian because you can start talking in surzhyk pretty much right away as soon as you recognize the basic pronunciation, grammar and vocab differences for example:\n\nот - від (отдать - віддати)\n\nрас - роз (рассказать - розказати)\n\nпод - під (подписать - підписати)\n\nс - з (смогу - зможу)\n\nSo basically if you don't know a word, change it based on Ukrainian grammar and phonetics. As you get more comfortable with the language you can learn more literary Ukrainian that is farther away from Russian. While it is widespread to use a lot of Russian constructions and words, it is considered bad Ukrainian that mostly uneducated people speak (but no one really cares, Zelensky sucked at Ukrainian in 2019 and now he has perfect Ukrainian). There are a lot of people who speak such strong surzhyk that it is really hard to say if they are speaking Ukrainian or Russian. So basically don't worry. Also since we don't really have slang that is independent of Russian, we basically use surzhyk to imply irony and use Russian words as slang or when we are joking.\n\nBiggest mistakes Russian speakers make:\n\n\\- Russian и and Ukrainian и are different, Ukrainian is closer to Russian ы but not as deep in the throat. It is pronounced like i in the English word bit.\n\n\\- There is no devoicing of constants in Ukrainian, you say любоф and we say любов, you say друк and we say друг\n\n\\- Same thing with reduction of vowels, you say проста we say просто\n\n\\- Ukrainian е is similar to Russian э\n\n\\- Ukrainian ч is harder than Russian ч\n\n\\- Ukrainian щ is different than Russian щ in Ukrainian it is harder like шч\n\n\\- Ukrainian ж is harder than Russian ж\n\n\\- Ukrainian в is different than Russian в, it is like a mix of в and an english w, Belarusian has a similar sound, it is the letter ў\n\n\\- Ukrainian г is NEVER pronounced like Russian г\n\n\\-хорошого is not pronounced хорошава! Same with all singular masculine genetive case adjectives ОГО А НЕ АВА\n\nIf you take this into account you can get rid of the biggest give aways of your Russian accent.\n\nГероям Слава!\n\nКстаті, украінци інагда пішут вот так на рузькам с украінскімі буквамі, но ета проста па пріколу кагда цитіруєм рузькую рєчь, палучаєтца какой-та дікій бєларузькій (без образ до білорусів, я люблю їхню мову)\n\nEdit:\n\nI don't know how Ukrainians will feel about speaking with you right now, but if you find someone to speak with, they won't laugh at you ever for making mistakes in Ukrainian. It is absolutely unheard of for a Russian to learn Ukrainian more than making fun of our language and using it to mock us. Before 2014 and before the war even a lot of Russian speakers in Ukraine would refuse to speak Ukrainian (some still do наприклад мер Одеси та мер Харькова і такі інші огидні персонажи типу Гордона) so you will get respect.", "created_utc": "1663909889.0", "edited": "1663933191.0", "id": "ipkc4sl", "is_submitter": "False", "link_id": "t3_xlno52", "parent_id": "t3_xlno52", "score": "239", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "DeliciousGuest6884", "body": "The Ukrainian communist party holds much of the responsibility for the Holodomor. They were the ones on the ground enforcing it and hiding data. I believe that every person is responsible to some degree for everything that happens in the world. The smaller the scale, the more responsibility. If bedroom is dirty that is my fault 100%, if my apartment is dirty I share that responsibility with my family, if my street is dirty I share that responsibility with the people on my street, this expands to my neighborhood, my city, my province, my country, my continent and my planet. But while I believe in strict accountability and talking responsibility, I can understand and accept counterarguments.\n\nIf my home, street and city are in order, that is thanks to my efforts or in spite of my lack of effort. This personally encourages me to not litter, donate blood, volunteer, vote in local and national elections, speak out, go to protests for things I believe in and generally be active in my community. I believe that people who do things like this hold less responsibility if things go to shit, but they still hold some. If my apartment building has trash at the entrance or is falling apart and I do nothing to organize with my neighbors to fix it and I don't clean up after myself, it is my fault to a large degree. So the bigger the scale and the smaller the problem, the less responsibility each person holds, also dependent on how active a person is in society. \n\nSo for a Russian person who has worked hard for years to spread democratic values and get rid of the toxicity in Russian society and has gone to protests for years holds less responsibility than those who did nothing or supported the war, yet still has some responsibility. Someone like Face the rapper I think has done the best he can using his platform and he admits it is not enough and he holds some responsibility. Will I cuss this person out or hate them? No, I will commend them for their efforts and I understand that they did the best they could reasonably do.", "created_utc": "1663907481.0", "edited": "False", "id": "ipk8pgu", "is_submitter": "False", "link_id": "t3_xkzc9c", "parent_id": "t1_ipk2v3f", "score": "-7", "subreddit": "europe", "subreddit_id": "t5_2qh4j"}, {"author": "DeliciousGuest6884", "body": "My girlfriend and I also have different languages. When we first met we mostly spoke in my native language and then after a couple of years of me studying I surpassed her and now we speak almost exclusively in hers. I can assure you, if he cares about you he thinks your accent and mistakes are the cutest thing in the world, so you have nothing to be embarrassed about. If I think about my girlfriend being able to speak my language perfectly without an accent or little mistakes or her translating idioms word for word, I would actually be sad, like it is another person. We have shared so many laughs because of mistakes and jokes because of the fact we have different languages.\n\nWe normally speak our own native languages when we are tired or having an argument or serious conversation. This is what I would recommend to you to get more comfortable, ask your boyfriend to speak his native language with you and you just respond in English. You will feel like you are getting to really understand the real him while also being your real self. He will make different jokes, flirt differently with you and compliment you in a way that is more natural to him, no matter how good his english is.\n\nFunnily enough my girlfriend likes it more when I speak my native language and I like it more when she speaks hers. I used to think she would be happier and feel more of an emotional connection hearing me speak her language, but we find that we have a better connection when we are able to hear each other express ourselves naturally. It really is a beautiful thing, so don't cry or be upset, be excited because you are able to form a deep and unique type of bond that most couples don't ever get to experience.\n\nEdit:\n\nDon't take it so seriously! Don't be afraid to switch back and forth and even create your own hybrid like language with him!", "created_utc": "1663893630.0", "edited": "1663894214.0", "id": "ipjipd7", "is_submitter": "False", "link_id": "t3_xl8ptj", "parent_id": "t3_xl8ptj", "score": "10", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "DeliciousGuest6884", "body": "похуй + поєбать", "created_utc": "1663889529.0", "edited": "False", "id": "ipjaf7y", "is_submitter": "False", "link_id": "t3_xkv9r7", "parent_id": "t3_xkv9r7", "score": "1", "subreddit": "ukraina", "subreddit_id": "t5_30y53"}, {"author": "DeliciousGuest6884", "body": "No", "created_utc": "1663889374.0", "edited": "False", "id": "ipja3t1", "is_submitter": "False", "link_id": "t3_xkws7f", "parent_id": "t3_xkws7f", "score": "1", "subreddit": "russian", "subreddit_id": "t5_2qlc6"}, {"author": "DeliciousGuest6884", "body": "Yes Ukrainians and Balts are responsible. And they admit that. Every leader is a reflection of society, good are bad. \n\nThe difference is OBL was a terrorist, I can think a Russian citizen is responsible for something without advocating for their death. I also will take responsibility for bad things my government does. Whose responsibility is it if not mine and my people's?", "created_utc": "1663888463.0", "edited": "False", "id": "ipj88qz", "is_submitter": "False", "link_id": "t3_xkzc9c", "parent_id": "t1_ipicaem", "score": "-12", "subreddit": "europe", "subreddit_id": "t5_2qh4j"}, {"author": "DeliciousGuest6884", "body": "How is it not their fault? They have done absolutely nothing to build democratic values in the country.\n\n\"Давай не будем говорить о политике\"\n\n\"Давай про что-нибудь позитивнее\"\n\n\"Большие дяди порешали\"\n\n\"Политика - грязное дело\"\n\n\"Что поделаешь?\"\n\n\"Я лично не ввел войска\"\n\n\"Но Америка всяка такая\"\n\n\"Русский язык в Украине!\"\n\nThat is all you would hear from a Russian trying to discuss their fucked up country and their imperialism and their backwards culture for the past 20 years. It is 100% their fault, they ignored everything on purpose and act surprised when everyone has been screaming at them to get their shit together, making Russian speaking TV channels and newspapers and videos because they are too proud and stubborn to learn any other language. And you still don't listen.", "created_utc": "1663887121.0", "edited": "1663887461.0", "id": "ipj5i45", "is_submitter": "False", "link_id": "t3_xkzc9c", "parent_id": "t1_ipiqylg", "score": "4", "subreddit": "europe", "subreddit_id": "t5_2qh4j"}, {"author": "DeliciousGuest6884", "body": "It's is a transliteration using the polish alphabet and phonetic system and then a translation into Polish below that", "created_utc": "1663885245.0", "edited": "False", "id": "ipj1i1u", "is_submitter": "False", "link_id": "t3_xlborv", "parent_id": "t1_ipiktmc", "score": "4", "subreddit": "Ukrainian", "subreddit_id": "t5_2qum6"}, {"author": "DeliciousGuest6884", "body": "Twitter is not popular in Ukraine and has only been gaining popularity in the last 6 months. In 2012 the most popular social network was VK, most Ukrainians didn't use western social media sites at that time. Also the language situation has changed dramatically since 2012, both the legal status of the Ukrainian language and its use in film, music, literature, news etc. But for 2012 this looks pretty accurate I guess. Ukrainians are bilingual so before 2004, 2014 and 2022 (three biggest jumps in popularity of Ukrainian) many Ukrainian speakers would speak Russian on the street or online because it was more prestigious.", "created_utc": "1663709656.0", "edited": "False", "id": "ip8zg6n", "is_submitter": "False", "link_id": "t3_xjl2z8", "parent_id": "t3_xjl2z8", "score": "38", "subreddit": "Ukrainian", "subreddit_id": "t5_2qum6"}, {"author": "DeliciousGuest6884", "body": "I wish more Ukrainians were like you :)\n\nIt will take generations to get Russian culture and language out of Ukraine", "created_utc": "1663425608.0", "edited": "False", "id": "iosv4yc", "is_submitter": "False", "link_id": "t3_xfdfpn", "parent_id": "t1_iorwb9x", "score": "1", "subreddit": "Ukrainian", "subreddit_id": "t5_2qum6"}, {"author": "DeliciousGuest6884", "body": "Here is a good article:\n\n[From Pushkin to Putin: Russian Literature’s Imperial Ideology](https://foreignpolicy.com/2022/06/25/russia-ukraine-war-literature-classics-imperialism-ideology-nationalism-putin-pushkin-tolstoy-dostoevsky-caucasus/)\n\nTo notice these things you have to know the history and the dog whistles.", "created_utc": "1663382295.0", "edited": "False", "id": "ioqzq7a", "is_submitter": "False", "link_id": "t3_xfdfpn", "parent_id": "t1_iomzxhz", "score": "2", "subreddit": "Ukrainian", "subreddit_id": "t5_2qum6"}, {"author": "DeliciousGuest6884", "body": "You are.", "created_utc": "1663381982.0", "edited": "False", "id": "ioqz3as", "is_submitter": "False", "link_id": "t3_xf9eax", "parent_id": "t1_iooorg5", "score": "5", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "DeliciousGuest6884", "body": "The population of Los Angeles is 3x the population of Georgia. Of course Georgia is an obscure language. Georgian has no related languages (that I am aware of) and a unique script. I can't think of a better example of an obscure language that a foreigner would want to and be able to learn while still being somewhat useful.  I was obviously not talking about the Georgian language in Georgia, as OP is obviously not from Georgia.", "created_utc": "1663381945.0", "edited": "False", "id": "ioqz0pa", "is_submitter": "False", "link_id": "t3_xf9eax", "parent_id": "t1_iomza67", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "DeliciousGuest6884", "body": "The English language has not been forced upon me. I don't live in a former English colony. I am not against people speaking and learning Russian in countries that are not former Russian colonies (although I think it's useless).  I don't hear English anywhere on the street and it is virtually absent in public life and private communication.  Please, tell me more about my country that you have never been to and about a language you don't speak. The reality is you don't know what you are talking about and you shockingly overconfident of your views for someone so uninformed.", "created_utc": "1663381761.0", "edited": "1663383159.0", "id": "ioqyniu", "is_submitter": "False", "link_id": "t3_xf8dmz", "parent_id": "t1_iomzj0c", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "DeliciousGuest6884", "body": "I appreciate that. I think that trauma is probably in your DNA and you understand better than most anyone in the world.", "created_utc": "1663300174.0", "edited": "False", "id": "iomfudc", "is_submitter": "False", "link_id": "t3_xf8dmz", "parent_id": "t1_iomfpdf", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "DeliciousGuest6884", "body": "You always have a choice. I never lived in the Soviet Union, I learned this language cause it was considered cool and that’s what people spoke in Kyiv. I wasn’t forced. I wanted to fit in. Not too long ago Ukrainians were being shot and sent to Siberia just for writing poems in Ukrainian. Those people were strong, I was not.", "created_utc": "1663299924.0", "edited": "False", "id": "iomfeqf", "is_submitter": "False", "link_id": "t3_xf8dmz", "parent_id": "t1_iomf5qn", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "DeliciousGuest6884", "body": "Because this language has been forced upon people in my country for centuries and has caused my culture and language to be neglected, making this war possible. I played a role in the popularization of this language, therefore culture and country, making the war in part my fault.", "created_utc": "1663299690.0", "edited": "False", "id": "iomezpa", "is_submitter": "False", "link_id": "t3_xf8dmz", "parent_id": "t1_iomd1op", "score": "4", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "DeliciousGuest6884", "body": "I think for your purpose you may find it better to talk to really liberal Russians who are against this war, they are few and far between but they exist. ( r/Russia won’t be helpful as the sub is full of very pro Russian people, r/liberta may be helpful) This may help you more in your writing to understand the guilt and what they may do to try to redeem themselves. \n\nIt’s really hard for Ukrainians to imagine forgiving a Russian soldier, especially the character you described because, as you know, this is a war of genocide and the cases of rape, torture and murder of civilians are seemingly limitless. If you are able to pull off making this guy redeemable, you are a very talented writer. You should be aware of these cultural things your character will have being russian and have him work to overcome his inherent racism/imperialism/ learned hatred towards Ukrainians. \n\nPersonally, if a Russian spetsnaz guy was working for me, I’d just fire him)", "created_utc": "1663294535.0", "edited": "False", "id": "iom4f2a", "is_submitter": "False", "link_id": "t3_xfdfpn", "parent_id": "t1_iom0q8v", "score": "6", "subreddit": "Ukrainian", "subreddit_id": "t5_2qum6"}, {"author": "DeliciousGuest6884", "body": "The problem isn’t the Russian military, it’s Russian culture and their population as a whole. If you learn Russian and read classic Russian literature, you will realize how xenophobic the roots of their culture are. I could give you examples if you like (На независимость Украины - Бродский, Клеветникам России - Пушкин). There are whole articles and books written on this topic, only now are people starting to discuss it in the West. Russian use of racial slurs and homophobia, for example, isn’t a just ugly side of Russia, it is a fundamental part of Russian culture. So before I would be able to forgive a Russian, soldier or civilian, Russian society will have to do a deep reexamination of their literature, cinema and culture as a whole, similar to how the US is re-examining it’s history with black people or Native Americans. This will never happen, Russia as a society has nothing else to fall back on besides their imperial might, they have no great companies, no values, nothing unique to offer the world. Of course they have some composers and some Gagarin, but Russian society is too far gone. \n\nRussian views on life, death, love and family may surprise you if you don’t speak the language, they are not really Western or Eastern, there is essentially no value system. It sounds crazy but consider their actions as a nation for the past 300 years and then it doesn’t sound as crazy. It’s hard to explain if you don’t speak the language and don’t have an understanding of the culture (Ukrainians understand Russians better than anyone, being linguistically and culturally fluent). That being said they are human, they love their kids and their parents and want to be happy. \n\nTo answer your question, no. If a Russian soldier cries and helps some Ukrainian kid or whatever that does not redeem him. They have a lot of work to do. \n\nThere are Russians who fight for Ukraine right now, most (all) Ukrainians view them neutrally-positively. You could look there for inspiration. This is our defining moment as a nation, our culture and our people will never be the same. We don’t want anything to do with them, no matter how many times they say sorry. If they truly change, doing what I stated before, then maybe my great grandkids generation can talk with them.", "created_utc": "1663291830.0", "edited": "False", "id": "iolybq2", "is_submitter": "False", "link_id": "t3_xfdfpn", "parent_id": "t3_xfdfpn", "score": "14", "subreddit": "Ukrainian", "subreddit_id": "t5_2qum6"}, {"author": "DeliciousGuest6884", "body": "No. I know people who took Russian courses after moving to Kyiv because people would make fun of their Ukrainian. Pretty common", "created_utc": "1663289627.0", "edited": "False", "id": "ioltd8j", "is_submitter": "False", "link_id": "t3_xf8dmz", "parent_id": "t1_iolscga", "score": "4", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "DeliciousGuest6884", "body": "Mariupol will be hell.", "created_utc": "1663280806.0", "edited": "False", "id": "iola2v8", "is_submitter": "False", "link_id": "t3_xf8xyg", "parent_id": "t3_xf8xyg", "score": "15", "subreddit": "worldnews", "subreddit_id": "t5_2qh13"}, {"author": "DeliciousGuest6884", "body": "Russian. I’m Ukrainian", "created_utc": "1663280650.0", "edited": "False", "id": "iol9q34", "is_submitter": "False", "link_id": "t3_xf8dmz", "parent_id": "t3_xf8dmz", "score": "18", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "DeliciousGuest6884", "body": "Less spoken languages are more useful on the job market because there less people who speak English + Georgian for example. If you speak English and Spanish you will be competing with millions of bilingual people, assuming you are in the US. It’s more valuable to be an expert in a niche field. Plus, I already speak the most “prestigious” language, which has the most amount of information and entertainment available in it, so it’s not super interesting for me to learn French or something.", "created_utc": "1663280505.0", "edited": "False", "id": "iol9e03", "is_submitter": "False", "link_id": "t3_xf9eax", "parent_id": "t3_xf9eax", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "DeliciousGuest6884", "body": "Steebee", "created_utc": "1663279004.0", "edited": "False", "id": "iol5v4l", "is_submitter": "False", "link_id": "t3_xf0tav", "parent_id": "t3_xf0tav", "score": "6", "subreddit": "TigerBelly", "subreddit_id": "t5_39xxb"}, {"author": "DeliciousGuest6884", "body": "Another episode with the therapy lady.. Here we go", "created_utc": "1663259609.0", "edited": "False", "id": "iojsre3", "is_submitter": "False", "link_id": "t3_xexntf", "parent_id": "t3_xexntf", "score": "1", "subreddit": "TigerBelly", "subreddit_id": "t5_39xxb"}, {"author": "DeliciousGuest6884", "body": "Bro shut up", "created_utc": "1663259456.0", "edited": "False", "id": "iojscv9", "is_submitter": "False", "link_id": "t3_xeohrf", "parent_id": "t1_ioi7i9e", "score": "1", "subreddit": "TigerBelly", "subreddit_id": "t5_39xxb"}, {"author": "DeliciousGuest6884", "body": "Not that great, low B2 with lots of confidence. I think the extent of his Russian studies is trying to manipulate women to sleep with him in as many Russian speaking countries as possible.", "created_utc": "1659563112.0", "edited": "False", "id": "iiu4da8", "is_submitter": "False", "link_id": "t3_wf3hfz", "parent_id": "t3_wf3hfz", "score": "6", "subreddit": "russian", "subreddit_id": "t5_2qlc6"}, {"author": "DeliciousGuest6884", "body": "I’m from Kharkiv and I’m in Kyiv right now and my girlfriend is in Poland. I miss her but it makes me feel better knowing she’s 100% safe. Thank you! dziękuje! Дякую!", "created_utc": "1659559600.0", "edited": "False", "id": "iitw7s1", "is_submitter": "False", "link_id": "t3_wff2ox", "parent_id": "t3_wff2ox", "score": "140", "subreddit": "Polska", "subreddit_id": "t5_2qiqo"}, {"author": "DeliciousGuest6884", "body": "Propaganda is me seeing what’s happening in my home town? You obviously know what’s going on from your village in the middle of nowhere. Go work on your English.", "created_utc": "1659559281.0", "edited": "False", "id": "iitvgzb", "is_submitter": "False", "link_id": "t3_werhb4", "parent_id": "t1_iitvcob", "score": "0", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "DeliciousGuest6884", "body": "It is not in my interest nor it is my responsibility to convince you of anything, after looking at your comments it’s clear your deep in propaganda and unable to self reflect. I am not interested in anything else other than my city not being bombed. \n\nA Russian speaker without biases is what? You have to shed your imperialistic and chauvinistic views before you hope to talk to any Ukrainian, Georgian, Moldovan or Kazakh. It is obvious that you don’t care about your blood connections by how flippantly you discuss the situation. There is a place for raw emotion, cursing and anger. I can’t think of a more fitting instance. \n\nI was trying to listen, yet you made no argument other than “hive mind” and “be an individual”. I don’t understand why you chose to waste both of our time saying nothing, instead of trying to make actual points. You see the problem in everyone but yourself.", "created_utc": "1659558432.0", "edited": "1659559045.0", "id": "iittfuc", "is_submitter": "False", "link_id": "t3_werhb4", "parent_id": "t1_iitrl9s", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "DeliciousGuest6884", "body": "A lot of people assume that everyone who speaks Ukrainian understands Russian. A lot of Ukrainians don’t understand how different they are because they’ve had constant exposure to both from childhood. \n\nAlso, a lot of people who don’t switch do so more out of embarrassment that they don’t speak Ukrainian that well. That is why I am against hate against surzhyk because it discourages people from switching to Ukrainian. Surzhyk is a step on the path to good Ukrainian.\n\nAs for education I’m not sure. The stereotype is, or at least used to be, the opposite. That if you speak Ukrainian in Kyiv you are either from a village, or from Lviv or a nationalist. Now the stereotype is changing a bit, when I hear good, “pure” (I dislike this word talking about languages) Ukrainian, I assume the person is intelligent and has progressive views. Also I don’t think I would consider a person very well educated or intelligent if they couldn’t speak Ukrainian. This is a new occurrence, it used to be the same but replace Ukrainian with Russian. Ukrainian speakers are usually slightly better at English because they are more likely to be from the west of the country and traveled, therefore getting practice. They are also less prone to be deep in the Russian internet, and Ukrainian phonetics are a bit closer to English.", "created_utc": "1659557899.0", "edited": "False", "id": "iits541", "is_submitter": "False", "link_id": "t3_wfbn82", "parent_id": "t1_iitqtgf", "score": "9", "subreddit": "Ukrainian", "subreddit_id": "t5_2qum6"}, {"author": "DeliciousGuest6884", "body": "You are exactly you are are trying not to be. You are a non entity. I remember my 4th year of university I went through the same phase. I read the classics, traveled, learned a few languages. I was convinced I had it figured out. I viewed people who didn’t have the same view on life as me as being ignorant. This is exactly what you are doing, you claim to have escaped the system, yet you didn’t, you have only fallen deeper into it. You have forfeited common sense for vanity. You mastered the ability of using a lot of words while saying nothing, convincing no one but yourself of your intelligence. \n\nIntelligent people don’t talk in an obscure way to seem wise. They speak clearly and concisely. In your messages you have made no point, shared no opinion other than you being better than everyone else. You alone figured out the meaning of life. How rich. You showed no understanding of being able to follow a complex thought and no ability to hold an interesting and constructive dialog.\n\nRead some more books, go around the world one more time, learn a new skill, lose your mother to a rocket, laugh, cry, and scream. Then we will talk.", "created_utc": "1659556261.0", "edited": "1659556468.0", "id": "iito5xo", "is_submitter": "False", "link_id": "t3_werhb4", "parent_id": "t1_iitl69c", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "DeliciousGuest6884", "body": "Люди досі сидять у фейсбуці?", "created_utc": "1659554707.0", "edited": "False", "id": "iitkdxy", "is_submitter": "False", "link_id": "t3_wf5we8", "parent_id": "t3_wf5we8", "score": "4", "subreddit": "ukraina", "subreddit_id": "t5_30y53"}, {"author": "DeliciousGuest6884", "body": "Хахаха ты вообще не понимаешь что происходит здесь. В стране идут очень много дискуссий и споров, но все согласны о том, что они украинцы и хотят жить в Украине.\n\nЗнаешь что было омерзительно? [Когда советские солдаты изнасиловали сотни тысяч женщин в Германии.](https://en.m.wikipedia.org/wiki/Rape_during_the_occupation_of_Germany)\n\nЭто на самом деле очень крутая позиция, не иметь никаких ценностей ни взглядов, при этом говоря «я личность» Напоминает 10 класс, когда все девушки говорят, «я не такая как другие 💅». \n\nМожет, если бы ты переживала за благополучие своих сограждан а не только за свою «личность», у вас бы жилось лучше. \n\nGrow up.", "created_utc": "1659554331.0", "edited": "False", "id": "iitjga5", "is_submitter": "False", "link_id": "t3_werhb4", "parent_id": "t1_iitelzw", "score": "0", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "DeliciousGuest6884", "body": "Lots of people in Kyiv spoke Ukrainian at home and Russian on the streets and with friends to avoid ridicule. The rise in popularity in Ukrainian is in large part due to those people switching completely to Ukrainian. Some people also only spoke Russian only with Ukrainian speakers and now they speak Ukrainian with them. A lot of people also raised their kids in Russian and are only now switching back to Ukrainian cause they didn’t wanted their kid to deal with the difficulties of speaking Ukrainian. \n\nI know instances of both people being Ukrainian speakers but they didn’t find out for a while and spoke Russian with each other because that was the norm. Sometimes they keep speaking Russian cause they’re used to it, sometimes switch and sometimes go back and forth. And since everyone understands both, sometimes you speak Russian without even thinking about it. If someone came up to me quickly on the street and asked what time it is in Russian I may just respond in russian automatically without thinking. Same thing in a coffee shop when they ask for your order in Russian.", "created_utc": "1659552939.0", "edited": "False", "id": "iitg23v", "is_submitter": "False", "link_id": "t3_wfbn82", "parent_id": "t1_iitbfmo", "score": "9", "subreddit": "Ukrainian", "subreddit_id": "t5_2qum6"}, {"author": "DeliciousGuest6884", "body": "Если россиянин не поддерживает войну, то у него есть два варианты. Он может либо остановить эту войну, либо смириться с тем что украинцы будут его ненавидеть и не захотят с ним общаться. Зачем я должен уважать, любить и общаться с народом, который допустил разрушение моего города, убийство своих близких? Этот народ ничего мне не дал кроме руин, боли и смерти. Если человек не поддерживает войну и хотя бы как-то пытается влиять на ситуацию, то может лет через 20 можем с ним иметь нормальные отношения.\n\nА если россиянин поддерживает войну, то ты уже знаешь что о нем скажу.\n\nДумаешь что мы хотим вас ненавидеть? Даже после 2014ого русские музыканты приезжали в наши города, мы читали ваши писателей, говорили на вашем языке и смеялись с ваших стендаперов. Это даже не говоря про преступления, совершенные Москвой против украинского народа до 14ого года. Мы просто хотим жить спокойно.\n\nНе потеряйся в аргументах псевдоинтеллектуалов. Но судя по твоему тону, я подозреваю, что тебе на самом деле плевать на все кроме себя. Легче думать, что это украинцы такие плохие чем может это я еблан.", "created_utc": "1659551945.0", "edited": "False", "id": "iitdla0", "is_submitter": "False", "link_id": "t3_werhb4", "parent_id": "t1_iit589i", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "DeliciousGuest6884", "body": "Смотри, дело не в пропаганде, дело в единстве в обществе. Знаю, что такого единства в российском обществе нет, так что возможно тебе трудновато понять. \n\nВы очень любите говорить о Второй Мировой войне, согласись, это очень сильно влияло и до сих пор влияет на ментальность и мировоззрение россиян. Это почти на уровне ДНК. Подобное событие сейчас происходит в Украине.\n\nСкажем так, я вижу своими глазами как человек убивает мою мать, я кричу о помощи. Пытаюсь сам как-то помочь, но не выходить. Другой человек сидит рядом и смотрит молча на происходящее. Как я по-твоему должен относиться к этому человеку? Да, не он убил мою мать, он не причём, он вне ситуации. Но, я не буду его любить ни уважать, и я точно не буду с ним общаться. Я не буду слушать его песни, смотреть его видосы и так далее.", "created_utc": "1659551935.0", "edited": "False", "id": "iitdkfe", "is_submitter": "False", "link_id": "t3_werhb4", "parent_id": "t1_iit589i", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "DeliciousGuest6884", "body": "It depends how strong it is. If it’s just some words every once and awhile that everyone uses I probably wouldn’t even notice. If it’s pretty bad I would think that it’s funny and endearing. Unfortunately it probably even sounds more natural to use words like вообще, конечно, короче, типа, бред, такое, да etc.\n\nNo one will be offended. Maybe someone will tell you how to say it in Ukrainian depending on your level. If you speak pretty “clean” Ukrainian you will actually get a lot of compliments, especially from Russian speakers and people who use surzhyk in their everyday life. The thing is that a lot of Ukrainian slang is just Russian words, people often use them on purpose when trying to imply irony or the stupidity of a situation or just joking around. \n\nYou may hear something like «він такий тупой» (тупий/друний in Ukrainian) or «тут так красіва» (красиво, гарно)\n\nIf you immerse yourself in Ukrainian content you will inevitably pick up some Russian because people don’t usually switch the language they’re speaking and it’s extremely saturated in our media environment. I’d say Ukraine is probably the most truly bilingual country on earth. The whole language situation is changing rapidly so it’s difficult to say what it will be like in a decade or two. \n\nDespite what you may think and what you may have heard from Russian propaganda no one really makes a big deal out of language, only if it’s a public figure or politican. So theoretically, you could speak Russian and no one would say much, some may just respond to you in Ukrainian. That being said, it makes me very happy and the majority of Ukrainians happy when a foreigner wants to speak our language. So keep going. But as a foreigner in general you can do what you want with respect to language.\n\nEdit: You made my day by saying Russian looks like funny Ukrainian to you. You don’t know how many times I’ve heard Russians say the opposite about our language.)", "created_utc": "1659549150.0", "edited": "1659552388.0", "id": "iit6lue", "is_submitter": "False", "link_id": "t3_wfbn82", "parent_id": "t3_wfbn82", "score": "21", "subreddit": "Ukrainian", "subreddit_id": "t5_2qum6"}, {"author": "DeliciousGuest6884", "body": "Вау такие мудрые слова. Спасибо тебе, русский интеллектуал! Ты прав, с сегодняшнего дня я буду сосать русский член каждый день, чтобы быть личностью, и доказать вам свою лояльность, как говоришь! Спасибо ещё раз, русский хозяин. \n\nУ меня родственники погибли от обстрелов моего Харькова и ваша страна разрушила мою жизнь, надо было раньше сказать, что просто надо отойти от общего разума! Столько любови! Я уже ее чувствую!\n\nЯ не знаю почему я до сих пор охуеваю, когда слышу такую хуйню от россиян, которые хотят казаться такими дохуя умными. Если бы ситуация не была такой серьёзной, то было бы реально очень смешно. \n\nПричём здесь украинский язык? Речь вообще об этом не шла. Меня это не ебет. OP не украинец и у меня уровень английского С2, так что нету здесь чему завидовать. Чем скорее вы все поймёте, что всем на вас похуй и никто не завидует вам - тем лучше. \n\nТы скажешь какой-то бред про газ или Достоевского, или что моя страна всякая такая. Я заранее отвечу вот так: похуй и поебать.", "created_utc": "1659547503.0", "edited": "1659547726.0", "id": "iit2dyy", "is_submitter": "False", "link_id": "t3_werhb4", "parent_id": "t1_iisxr33", "score": "0", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "DeliciousGuest6884", "body": "Да я и так его не смотрю вообще, потому что это хуйня полнейшая. Я уже давным давно выбрался из этого всего. Я ж говорю что ваши курсы и университеты недоразвитые и никому не нужны. Ваша культура идиотская и ничего миру не дала. \n\nЧел сидит под каком-то Омском рассказывая мне о свободе слова в Латвии. Это ор конечно. Единственная причина, по которой я рад, что я знаю русский язык это то, что могу послать тебя нахуй. \n\nИди умри за родину, мамочка новой машины хочет.", "created_utc": "1659544403.0", "edited": "1659544589.0", "id": "iisuc0j", "is_submitter": "False", "link_id": "t3_werhb4", "parent_id": "t1_iisb0dy", "score": "0", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "DeliciousGuest6884", "body": "Качество интернета для меня означает, что есть разный и развивающийся со временем контент. \n\nМеня например не интересуют шуточки Сабурова а-ля «хаха бабы вот такие а мужики вот такие». Также не интересуют русские фильмы, которые постоянно крутятся в тренде Ютуба типа «МОЩНОЕ РУССКОЕ КИНО, МУЖИК РАЗЪЕБАЛ ВСЕХ! СМОТРЕТЬ ДО КОНЦА.»\n\nТакой треш контент безусловно имеет своё место в интернете и обществе в том числе, однако в русском сегменте интернета, интересного контента не хватает. Бесспорно существуют ютуб каналы, которые делают классную работу, но по отношению к количеству людей, потребляющих контент на русском языке, их довольно мало. Смотря русский ютуб, возникает ощущение как будто ты попал в 2012.\n\nИз-за того, что нет свободы слова в русскоговорящих странах, где этот контент делается, приводит к тому, что контент-мейкеры не чувствуют себя комфортно создавая креативные проекты и раздвигаясь границы своей области.", "created_utc": "1659529874.0", "edited": "1659530604.0", "id": "iirvct3", "is_submitter": "False", "link_id": "t3_werhb4", "parent_id": "t1_iiro5si", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "DeliciousGuest6884", "body": "As a tourist it’s 100% fine but it just seems rude and impractical to refuse to learn the native language of the country you’re living in. It only will make his life more difficult.", "created_utc": "1659523940.0", "edited": "False", "id": "iirlelw", "is_submitter": "False", "link_id": "t3_werhb4", "parent_id": "t1_iirc43q", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "DeliciousGuest6884", "body": "By volume yes but quality is much worse than the French or German internet for example. Especially in the last 5 years. And as Ukrainians, Balts, Kazakhs and Moldovans switch to their native languages the quantity and therefore quality will only decrease.", "created_utc": "1659523888.0", "edited": "False", "id": "iirlc02", "is_submitter": "False", "link_id": "t3_werhb4", "parent_id": "t1_iirh4x6", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "DeliciousGuest6884", "body": "Yeah you’re right, I guess I didn’t really understand the point of the original question.", "created_utc": "1659515413.0", "edited": "False", "id": "iirajj6", "is_submitter": "False", "link_id": "t3_wez3kp", "parent_id": "t1_iir6k67", "score": "3", "subreddit": "russian", "subreddit_id": "t5_2qlc6"}, {"author": "DeliciousGuest6884", "body": "Yes. Such as Темно-синий, русско-японская война", "created_utc": "1659510363.0", "edited": "False", "id": "iir43mm", "is_submitter": "False", "link_id": "t3_wez3kp", "parent_id": "t3_wez3kp", "score": "2", "subreddit": "russian", "subreddit_id": "t5_2qlc6"}, {"author": "DeliciousGuest6884", "body": "Yeah I have a degree in Russian literature", "created_utc": "1659510169.0", "edited": "False", "id": "iir3ud7", "is_submitter": "False", "link_id": "t3_werhb4", "parent_id": "t1_iiq7wdi", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "DeliciousGuest6884", "body": "Why are you attracted to these countries with awful standard of living ?", "created_utc": "1659488732.0", "edited": "False", "id": "iiq0m5a", "is_submitter": "False", "link_id": "t3_werhb4", "parent_id": "t1_iiq0dok", "score": "11", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "DeliciousGuest6884", "body": "Learn the language of the country you are going to. If you want to speak Russian go to Russia or Belarus.\n\nEdit: I’m neutral on the Russian language, it’s my native tongue, I’m just telling you what it’s like in Moldova and other countries with Russian speakers", "created_utc": "1659488315.0", "edited": "False", "id": "iipznu2", "is_submitter": "False", "link_id": "t3_werhb4", "parent_id": "t1_iipzhc3", "score": "11", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "DeliciousGuest6884", "body": "Also Russian is only useful is the shittiest parts of the world. No interesting internet content or literature etc. If I could trade my knowledge of this language for 20 bucks, I would.", "created_utc": "1659487417.0", "edited": "False", "id": "iipxmow", "is_submitter": "False", "link_id": "t3_werhb4", "parent_id": "t1_iipwvj0", "score": "-16", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "DeliciousGuest6884", "body": "What do you mean? Do you know anything about the history of the Soviet Union? Or about the history of Moldova? Not strange completely logical and surprisingly there are still some Russian speakers clinging on.", "created_utc": "1659487217.0", "edited": "False", "id": "iipx6pq", "is_submitter": "False", "link_id": "t3_werhb4", "parent_id": "t1_iipwvj0", "score": "41", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "DeliciousGuest6884", "body": "As a Russian speaker.. don’t speak Russian with people in former Soviet Union (esp Ukraine, Georgia and Moldova) counties unless they say they are comfortable with it or they prefer Russian. Especially now. I couldn’t think of a ruder thing. I get offended when people assume I know Russian.\n\nCome on man\n\nEdit: Also Russian is not that popular there and it is losing popularity FAST. If you’re moving to Moldova, learn Romanian. It’s like a person asking on here, I’m moving to the US, should I learn English or Spanish?", "created_utc": "1659486955.0", "edited": "False", "id": "iipwlpy", "is_submitter": "False", "link_id": "t3_werhb4", "parent_id": "t3_werhb4", "score": "73", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "DeliciousGuest6884", "body": "Похуй + поебать", "created_utc": "1659485709.0", "edited": "False", "id": "iiptrxy", "is_submitter": "False", "link_id": "t3_wegu9w", "parent_id": "t1_iio0yp6", "score": "-1", "subreddit": "worldnews", "subreddit_id": "t5_2qh13"}, {"author": "DeliciousGuest6884", "body": "Орууу", "created_utc": "1659485125.0", "edited": "False", "id": "iipsg0g", "is_submitter": "False", "link_id": "t3_wcxn4t", "parent_id": "t1_iif8jxm", "score": "1", "subreddit": "Ukrainian", "subreddit_id": "t5_2qum6"}, {"author": "DeliciousGuest6884", "body": "За нами переміга", "created_utc": "1659485091.0", "edited": "False", "id": "iipsd6x", "is_submitter": "False", "link_id": "t3_wcxn4t", "parent_id": "t3_wcxn4t", "score": "2", "subreddit": "Ukrainian", "subreddit_id": "t5_2qum6"}, {"author": "DeliciousGuest6884", "body": "No problem, good luck)", "created_utc": "1659484922.0", "edited": "False", "id": "iiprz04", "is_submitter": "False", "link_id": "t3_wequl3", "parent_id": "t1_iiprvwd", "score": "5", "subreddit": "russian", "subreddit_id": "t5_2qlc6"}, {"author": "DeliciousGuest6884", "body": "They are different words. Нет is no or the absence of something. Не is like not. \n\nНет, я не хочу.\nNo, I do not want (to)\n\nМамы сейчас дома нет.\nMom is not at home right now. \n\nОн не крутой. \nHe is not cool.\n\nSo In the picture it is \n\nNone of your business. \nIf you said нет твоё дело I would read it as нет, твоё дело. As in No, this is YOUR business. And if you wanted to say the other person didn’t have business or a case or cases or whatever you could say, Нет твоего дела/твоих дел. But this is more like your business exists but it’s not here with us. As if I’m looking for it haha", "created_utc": "1659484571.0", "edited": "1659484871.0", "id": "iipr5yq", "is_submitter": "False", "link_id": "t3_wequl3", "parent_id": "t3_wequl3", "score": "41", "subreddit": "russian", "subreddit_id": "t5_2qlc6"}]