[{"author": "DisappointedCitrus", "body": "\n\nJ’ai surtout commenté pour susciter un peu de discussion et voir si quelqu’un pouvait aider OP, je connais certainement pas la réponse. Un peu plus de contexte ou une reformulation ne ferait pas de mal", "created_utc": "1666151140.0", "edited": "False", "id": "isw8kzw", "is_submitter": "False", "link_id": "t3_y7prqb", "parent_id": "t1_isw5nej", "score": "1", "subreddit": "French", "subreddit_id": "t5_2rd5t"}, {"author": "DisappointedCitrus", "body": "Ce n’est pas clair, du moins pour moi, ce que vous cherchez. Pouvez-vous donner l’exemple exact auquel vous êtes affronté? Parce qu’il semble que vous ayez déjà répondu à votre propre question.", "created_utc": "1666148736.0", "edited": "False", "id": "isw3xgh", "is_submitter": "False", "link_id": "t3_y7prqb", "parent_id": "t3_y7prqb", "score": "2", "subreddit": "French", "subreddit_id": "t5_2rd5t"}, {"author": "DisappointedCitrus", "body": "Les 7 Vies de Léo Belami! I thought the Netflix series was great so I bought the book and am enjoying it", "created_utc": "1665986318.0", "edited": "False", "id": "isn5xa3", "is_submitter": "False", "link_id": "t3_y61l08", "parent_id": "t3_y61l08", "score": "13", "subreddit": "French", "subreddit_id": "t5_2rd5t"}, {"author": "DisappointedCitrus", "body": "Sci-Fi/Suspense/Thriller. I just watched the teaser and it seems not too difficult to understand but I’m sure it depends on your level.", "created_utc": "1665868481.0", "edited": "False", "id": "isgozh5", "is_submitter": "False", "link_id": "t3_y4tgy3", "parent_id": "t1_isggbjp", "score": "5", "subreddit": "French", "subreddit_id": "t5_2rd5t"}, {"author": "DisappointedCitrus", "body": "It anyone makes fun of your accent it just means that they’re an asshole and not worth speaking with in the first place. I find the majority of people are kind and helpful.", "created_utc": "1665447610.0", "edited": "False", "id": "irtvbku", "is_submitter": "False", "link_id": "t3_y0jcgx", "parent_id": "t1_irsv4n4", "score": "6", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "DisappointedCitrus", "body": "This is what I was wondering, your explanation makes sense, thanks", "created_utc": "1664464997.0", "edited": "False", "id": "iqdl1kb", "is_submitter": "False", "link_id": "t3_xql1s0", "parent_id": "t1_iqdk6xq", "score": "2", "subreddit": "learnfrench", "subreddit_id": "t5_2sucz"}, {"author": "DisappointedCitrus", "body": "Serious question because I am still learning. Is it not because the film being referred to is a specific film, not a general film category? And so an definite article would be required?\n\nOr are there examples where du or de la is replaced by de before an adjective, even when a specific object is being discussed?", "created_utc": "1664459531.0", "edited": "False", "id": "iqd7zeq", "is_submitter": "False", "link_id": "t3_xql1s0", "parent_id": "t3_xql1s0", "score": "2", "subreddit": "learnfrench", "subreddit_id": "t5_2sucz"}, {"author": "DisappointedCitrus", "body": "You can \n\n1) read childrens books or books meant for beginners, taking your time to translate words and sentences.\n\n2) read the book in yout TL side by side with a copy of the book in your NL\n\n3) not worry about reading books until you feel comfortable doing so, and focus on learning the basics first", "created_utc": "1663979863.0", "edited": "False", "id": "ipnugc4", "is_submitter": "False", "link_id": "t3_xlppwk", "parent_id": "t3_xlppwk", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "DisappointedCitrus", "body": "I’m a heritage Spanish speaker born in Canada. My first language was Spanish and it’s what I spoke at home until I went to school. Once I started school I spoke almost zero English and was shamed for speaking Spanish, and stopped speaking at all until my teens. I’ll definitely always be better in English, but I’m working on it.\n\nI think in general it will depend on what you are able to use more, and for what purposes. If you only speak at home you may lack vocabulary for other contexts (academic, workplace etc.) and might just have some work to do to get up to speed.", "created_utc": "1663951023.0", "edited": "False", "id": "ipm3d9z", "is_submitter": "False", "link_id": "t3_xliq58", "parent_id": "t3_xliq58", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "DisappointedCitrus", "body": "I was sitting alone at a bar in Paris and a group of women were talking about me in Spanish. I waited for a while, then I made eye contact and introduced myself in Spanish. They died with embarrassment lol, but then we hung out for the rest of the night and it was a fun time.", "created_utc": "1663854230.0", "edited": "False", "id": "ipgu50o", "is_submitter": "False", "link_id": "t3_xkj094", "parent_id": "t1_ipfll1m", "score": "9", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "DisappointedCitrus", "body": "Here’s a university professors page from UQTR on Quebec-specific French, you may find it interesting. The rest of her website is very helpful as well.\n\n[Le français « québécois »](https://oraprdnt.uqtr.uquebec.ca/pls/public/gscw031?owa_no_site=2213&owa_no_fiche=49&owa_bottin=)", "created_utc": "1663206087.0", "edited": "False", "id": "ioh4xgl", "is_submitter": "False", "link_id": "t3_xehivy", "parent_id": "t3_xehivy", "score": "6", "subreddit": "French", "subreddit_id": "t5_2rd5t"}, {"author": "DisappointedCitrus", "body": "I think in English, but I’m currently deep into learning French through immersion and I had a French dream the other night! Tbf everything I could remember from the dream was fairly nonsensical lol, but the words were French.\n\nI do try translating my thoughts into French to get practice forming sentences and see where my gaps are, and now some mornings I wake up half asleep and find I’m already doing it", "created_utc": "1663174525.0", "edited": "False", "id": "iof2myv", "is_submitter": "False", "link_id": "t3_xdszfu", "parent_id": "t3_xdszfu", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "DisappointedCitrus", "body": "No pasa nada, fue pregunta honesta.\nIn fact you taught me that it can be said that way too, typically where I’m from “never heard of..” means “(I’ve) never heard of..” pero usted tiene razón 🙏🏽", "created_utc": "1663165661.0", "edited": "False", "id": "ioefdwn", "is_submitter": "False", "link_id": "t3_xdzqbi", "parent_id": "t1_ioedm7z", "score": "2", "subreddit": "wholesomememes", "subreddit_id": "t5_3gcwj"}, {"author": "DisappointedCitrus", "body": "I do see it now. I read it a few times and I kept hearing “(I’ve) never heard of transparent band-aids before?“", "created_utc": "1663163039.0", "edited": "False", "id": "ioe92xd", "is_submitter": "False", "link_id": "t3_xdzqbi", "parent_id": "t1_ioe8oz5", "score": "-3", "subreddit": "wholesomememes", "subreddit_id": "t5_3gcwj"}, {"author": "DisappointedCitrus", "body": "Ah you’re right, I can hear it now, I think it’s just uncommon to hear it that way where I am.", "created_utc": "1663162917.0", "edited": "False", "id": "ioe8s7r", "is_submitter": "False", "link_id": "t3_xdzqbi", "parent_id": "t1_ioe8e0b", "score": "2", "subreddit": "wholesomememes", "subreddit_id": "t5_3gcwj"}, {"author": "DisappointedCitrus", "body": "Im not sure I’ve ever seen these in stores, I’ll have to keep an eye out", "created_utc": "1663162626.0", "edited": "False", "id": "ioe82zg", "is_submitter": "False", "link_id": "t3_xdzqbi", "parent_id": "t3_xdzqbi", "score": "1", "subreddit": "wholesomememes", "subreddit_id": "t5_3gcwj"}, {"author": "DisappointedCitrus", "body": "Do you mean ever heard?\n\nEdit: I understand now, it was an honest question that I could have worded better. I learned something new.", "created_utc": "1663162531.0", "edited": "1663165739.0", "id": "ioe7urr", "is_submitter": "False", "link_id": "t3_xdzqbi", "parent_id": "t1_ioe033e", "score": "-22", "subreddit": "wholesomememes", "subreddit_id": "t5_3gcwj"}, {"author": "DisappointedCitrus", "body": "Spanish is my heritage language so it’s been a mix of moving passive vocab into active vocab, and filling in the gaps so to speak, I put it to about a B2 but it’s just an estimate. Still lots of work for me to be fully comfortable with it.", "created_utc": "1663047757.0", "edited": "False", "id": "io81xv2", "is_submitter": "False", "link_id": "t3_xcdoot", "parent_id": "t1_io7epls", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "DisappointedCitrus", "body": "If you’re having trouble finding material to import google “Farsi Content LingQ” and there are some discussions on the LingQ forum where people have shared resources. Also since you speak French and German definitely look up resources in those languages! I hear there’s more resources for French speakers.\n\nI wouldn’t necessarily say the benefit trails off, you can continue to import more and more challenging material as your knowledge of the language increases. But like any tool you can put it down once it’s no longer useful.\n\nI’ve been using it for only two months for French, (as well as sampling some other languages) and so far have just paid for monthly subscriptions. I’ve been using it daily though and will probably opt for a 6 month subscription soon.", "created_utc": "1663026077.0", "edited": "False", "id": "io6thsy", "is_submitter": "False", "link_id": "t3_xcdoot", "parent_id": "t1_io6jczc", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "DisappointedCitrus", "body": "Yeap! The ability to import is really what gives LingQ it’s value in my opinion. There is a web extension you can use to import YouTube and Netflix subtitles into lessons within LingQ. \n\nFor YouTube videos you’ll want to make sure the captions are high quality, as the autogenerated ones can be a bit wonky sometimes.\n\nNote that while you can also import audio you can’t import video, but I find neither is necessary anyways. I find it’s just as easy to follow along to anything outside of the app while I read, I actually tend to read first and then watch/listen afterwards to practice recognizing the words I just learned.", "created_utc": "1663025396.0", "edited": "False", "id": "io6rzl4", "is_submitter": "False", "link_id": "t3_xcdoot", "parent_id": "t1_io6iltb", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "DisappointedCitrus", "body": "As others often mention about Lingq it works best when you import material yourself, material that you’re interested in and is appropriate to your level. Depending on the language there’s lots of free material but I mostly just import things I want to learn with.\n\nI got bored of the beginner lessons pretty quick so I imported things I was more interested in, song lyrics, podcast transcriptions, web articles or book summaries, even if they’re short little blurbs it can be useful. I’m reading a book that I’ve imported and having fun reading that lately.", "created_utc": "1663021106.0", "edited": "False", "id": "io6i888", "is_submitter": "False", "link_id": "t3_xcdoot", "parent_id": "t3_xcdoot", "score": "5", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "DisappointedCitrus", "body": "It helped me, but I already understood some basics before I discovered them. I’ve really enjoyed “Little Talk in Slow French” as she explains some vocabulary in English but it’s mostly just in French, and as the title says, slow and well anunciated. You should also be able to find more beginner podcasts than that to get you started.\n\nOne big piece of advice is to read the transcript while you listen, you’ll get a great sense of pronunciation and even translating just a few words here and there will be super helpful.", "created_utc": "1662652477.0", "edited": "False", "id": "inlpw2x", "is_submitter": "False", "link_id": "t3_x8send", "parent_id": "t3_x8send", "score": "1", "subreddit": "French", "subreddit_id": "t5_2rd5t"}, {"author": "DisappointedCitrus", "body": "I’m willing to bet they’ve had conversations about ADHD already and the issues they’re facing based off of the information in the post. There is a possibility that OPs SO could improve but there’s a possibility they won’t. OP is 24 and has an entire world of possibilities ahead of them, I don’t believe anyone is obligated to stay in something dysfunctional or harmful.\n\nBreaking up with someone is sometimes the right solution, depending on the situation.", "created_utc": "1662649800.0", "edited": "False", "id": "inliuvk", "is_submitter": "False", "link_id": "t3_x8pzel", "parent_id": "t1_inlca4a", "score": "20", "subreddit": "ADHD", "subreddit_id": "t5_2qnwb"}, {"author": "DisappointedCitrus", "body": "Great clarification, I guess this essentially answers my question as well. It’s useful to know that “qui” and “que” have more rigid applications in French than their English approximates.", "created_utc": "1662602209.0", "edited": "False", "id": "inj9wcq", "is_submitter": "False", "link_id": "t3_x8jrvv", "parent_id": "t1_inj8nge", "score": "7", "subreddit": "French", "subreddit_id": "t5_2rd5t"}, {"author": "DisappointedCitrus", "body": "Thanks! I haven’t seen it explained in this way before and it’s very helpful.", "created_utc": "1662601821.0", "edited": "False", "id": "inj91hn", "is_submitter": "False", "link_id": "t3_x8jrvv", "parent_id": "t1_inj3o4i", "score": "3", "subreddit": "French", "subreddit_id": "t5_2rd5t"}, {"author": "DisappointedCitrus", "body": "Does the line ever blur in everyday speech? For example I find in English we often interchange the relative pronouns “who” and “that.” In fact I find I use “that” almost exclusively or drop the relative pronoun completely.\n\nDoes something similar occur in French in your experience?", "created_utc": "1662599045.0", "edited": "False", "id": "inj2r10", "is_submitter": "False", "link_id": "t3_x8jrvv", "parent_id": "t1_inisgg0", "score": "18", "subreddit": "French", "subreddit_id": "t5_2rd5t"}, {"author": "DisappointedCitrus", "body": "Probably depends on your goals, region, experience etc. “bad grammar/pronunciation” aka informal register can be found in many movies, shows etc. and is very specific to the region that it’s being made in. It may be useful if you want to understand that areas speech but again depends specifically on your situation.", "created_utc": "1661999438.0", "edited": "False", "id": "imlxz7g", "is_submitter": "False", "link_id": "t3_x2uwsk", "parent_id": "t3_x2uwsk", "score": "6", "subreddit": "French", "subreddit_id": "t5_2rd5t"}, {"author": "DisappointedCitrus", "body": "Depends completely on which part of Canada they’re talking about. Definitely not true in Alberta.", "created_utc": "1660858335.0", "edited": "False", "id": "ikumma5", "is_submitter": "False", "link_id": "t3_wrrsg8", "parent_id": "t3_wrrsg8", "score": "5", "subreddit": "PersonalFinanceCanada", "subreddit_id": "t5_2tasy"}, {"author": "DisappointedCitrus", "body": "Thanks", "created_utc": "1660270099.0", "edited": "False", "id": "ijxx145", "is_submitter": "True", "link_id": "t3_wm8huc", "parent_id": "t1_ijxuxo5", "score": "2", "subreddit": "Entomology", "subreddit_id": "t5_2qygr"}, {"author": "DisappointedCitrus", "body": "I feel that, uni gives you lots of opportunity for learning but definitely isn’t adapted to everyone’s ideal learning style. \n\nFirst off I’d suggest you reframe the way you’re thinking about this, if you believe you need to “grasp the language” you’re starting with a large, vague goal that feels unattainable. Breaking it down into steps with specific goals will be helpful and you’ll feel more encouraged when you tick one off.\n\nPersonally for my classes I made my own questions based off the syllabus. I’d skim for the answer, read enough to feel I get the idea, try to make a couple examples and then skip right to the next thing. Making my own examples (even if I had to look up the answer) helped it sink in instead of straight up memorizing.\n\nFor example for Definite and Indefinite articles I would break it down real simple like:\n\n1. High level, what are definite and indefinite articles? Does English have them?\n2. What are the French definite articles and when are they used? \n3. Can I produce my own example for each?\n4. What are the French indefinite articles and when are they used?\n5. Can I produce my own example for each?\n\nIt’s not a perfectionist method but got me passing grades, you have to learn what works best for you. Also I found out after I graduated I had inattentive ADHD which made everything much more work than it had to be, so if that might be a factor it’s definitely worth your time to ask.", "created_utc": "1660266277.0", "edited": "False", "id": "ijxoioy", "is_submitter": "False", "link_id": "t3_wlybw6", "parent_id": "t1_ijwtgzp", "score": "3", "subreddit": "French", "subreddit_id": "t5_2rd5t"}, {"author": "DisappointedCitrus", "body": "I think I wouldn’t have been able to tell if you didn’t mention it, it just sounds like a native English speaker using a slightly more formal register eg. comprehend vs. understand, tongue instead of language\n\nNot that we’re here at all to pick apart your English, but I think you should be proud that you probably have a better grasp on vocabulary than some native English speakers :)", "created_utc": "1660252405.0", "edited": "False", "id": "ijws03v", "is_submitter": "False", "link_id": "t3_wltgyx", "parent_id": "t1_ijvbx3n", "score": "10", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "DisappointedCitrus", "body": "You may need to ask a specific question if you want more engagement. Is there something in particular you’re struggling with?", "created_utc": "1660244280.0", "edited": "False", "id": "ijw6ov6", "is_submitter": "False", "link_id": "t3_wlybw6", "parent_id": "t3_wlybw6", "score": "8", "subreddit": "French", "subreddit_id": "t5_2rd5t"}, {"author": "DisappointedCitrus", "body": "Easy way to do what? Learning a language and the study of Linguistics have completely different goals. You can be interested in one without any interest in the other.\n\nWhy do you think studying Linguistics would be easier?", "created_utc": "1660240580.0", "edited": "False", "id": "ijvwx6f", "is_submitter": "False", "link_id": "t3_wl445v", "parent_id": "t1_ijrxcvx", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "DisappointedCitrus", "body": "Pretty interesting, the AI is pretty good but a little awkward, sometimes it won’t respond until prompted twice, sometimes it switches to English, or doesn’t understand a some questions. The corrections are a nice touch but don’t seem to catch noun genders. \n\nOverall it provides lots of opportunity for learning new vocab and sentence structure for an intermediate learner. It’d be nice to have a more natural sounding voice for the auto-generated speech. Looking forward to seeing how this develops it’s looking super promising.\n\nAs another commenter asked, are there plans to monetize this in the future?", "created_utc": "1660107868.0", "edited": "False", "id": "ijoj245", "is_submitter": "False", "link_id": "t3_wkk49p", "parent_id": "t3_wkk49p", "score": "7", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "DisappointedCitrus", "body": "You may be confusing aspiration with voicing, the difference between a p and b is that the b is voiced, while the p is just the puff of air.\n\nAspiration refers to the “h” sound that English speakers make after a consonant at the beginning of a word. You intuitively will not aspirate the consonant if there is a sound before it, it’s just a feature of the language. FearlessLau gave a great example, others are:\n\nPin (p is aspirated), Spin (p is not aspirated)\n\nKin (k is aspirated), Skin (k is not aspirated)\n\nTop (t is aspirated), Stop (t is not aspirated)\n\nTry saying the second word, then repeating it by only omitting the first sound. It’ll sound like you’re saying the first word, just with an accent.", "created_utc": "1660010425.0", "edited": "1660010856.0", "id": "ijixc0q", "is_submitter": "False", "link_id": "t3_wj87qt", "parent_id": "t1_ijh238j", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "DisappointedCitrus", "body": "If you’re both C2 speakers there is likely no issue at all. Any “bad habits” your child would pick up would very quickly be compensated for as they gain exposure from external sources, and with English there is no lack of external sources.\n\nPersonally my parents were both ~B2 speakers growing up and I learned English (in Canada to be fair) with no accent, but some mild quirks. E.g until recently I pronounced raspberries like “rozzberies,” but as soon as someone pointed that out I easily adapted.\n\nThe challenge is actually getting your child to speak back in the at-home language, once I entered grade school I refused to respond in Spanish and at 15 years old I had full comprehension but only A-2 Level speaking ability. As long as your child is motivated to speak back to you in the at-home language (in this case English) they will be proficient in the language.", "created_utc": "1659628252.0", "edited": "False", "id": "iixhdsq", "is_submitter": "False", "link_id": "t3_wfzwxt", "parent_id": "t3_wfzwxt", "score": "6", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "DisappointedCitrus", "body": "Haha sounds like that could be it, if you’re interested in reading more about it this is a pretty good website for info:\n[CADDAC ADHD Info](https://caddac.ca/about-adhd/in-general/)", "created_utc": "1659208029.0", "edited": "False", "id": "iiagspp", "is_submitter": "False", "link_id": "t3_wbvk4d", "parent_id": "t1_iiafbu8", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "DisappointedCitrus", "body": "Haha yeah never hurts to ask a doctor, my diagnosis has changed how I approach my work and personal life so I would definitely recommend anyone that is wondering about it to at least ask the question. There’s even some online health providers that specialize in this now", "created_utc": "1659207041.0", "edited": "False", "id": "iiaeipg", "is_submitter": "False", "link_id": "t3_wbvk4d", "parent_id": "t1_iiadqz0", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "DisappointedCitrus", "body": "I do this with all of my interests and recently found out that at least one reason is ADHD. I generally enjoy learning about many languages (how they sound, how they work, their linguistic quirks) but can’t focus enough to actually get into learning any well. \n\nI’ve recently decided to go back and focus on my first target language and between ADHD treatment and some learning strategies I’ve been sticking with it longer than ever before and am seeing great progress. I do think it is also largely about what goals you have in that language.", "created_utc": "1659203664.0", "edited": "False", "id": "iia6o82", "is_submitter": "False", "link_id": "t3_wbvk4d", "parent_id": "t3_wbvk4d", "score": "6", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "DisappointedCitrus", "body": "If you’re learning a little each day it sounds to me like you’re already doing the right thing. I’m not sure anyone can tell you exactly which way to learn is better but the balanced approach you’re taking sounds great.\n\nPersonally I like to learn by just exploring media that I find interesting (podcasts w/ transcripts, videos w/ subtitles, music w/ lyrics), translating sentence by sentence and learning to recognize and hear the words as spoken with a native accent. I think this is a lot of fun and keeps me engaged. I find lots of things I don’t understand and this leads me to learn that grammar/vocabulary in a way that’s fun and puts things in a real world perspective.\n\nYou’ll definitely find what language learning methods work best for you as you keep at it.", "created_utc": "1659200723.0", "edited": "False", "id": "ii9zzyz", "is_submitter": "False", "link_id": "t3_wba7uy", "parent_id": "t1_ii6ymdi", "score": "2", "subreddit": "learnfrench", "subreddit_id": "t5_2sucz"}, {"author": "DisappointedCitrus", "body": "Thank you! I’m watching the first Norwegian from zero lesson and I think you hit the nail on the head with this approach, it’s easy to pick up from context and I appreciate the vocab written in the description.", "created_utc": "1659134460.0", "edited": "False", "id": "ii6sklw", "is_submitter": "False", "link_id": "t3_wbdmzl", "parent_id": "t1_ii6kdnj", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "DisappointedCitrus", "body": "I’ve been using [Reverso](https://conjugueur.reverso.net/conjugaison-francais.html) when I need to look up a conjugation.\n\nJust take it really slow and don’t let yourself get overwhelmed. Languages are complicated, but by learning a little bit each day you’ll be surprised how fast you start to pick things up. The most important part is to keep it fun and rewarding, especially at the beginning, so make sure the medium you’re using is engaging.\n\nAlso not that you asked but Ive personally been learning the verb conjugations in the following order to start with, I’m sure others will have different input on the best order to learn them:\n1. présent\n2. futur proche\n3. passé récent\n4. passé composé\n5. futur simple\n6. imparfait\n7. conditionnel présent\n8. conditionnel passé\n\nI’ve found francais.lingolia.com and lawlessfrench.com to be pretty useful when I need an explanation on a specific conjugation or any other aspect of french.", "created_utc": "1659133925.0", "edited": "False", "id": "ii6rd9s", "is_submitter": "False", "link_id": "t3_wba7uy", "parent_id": "t3_wba7uy", "score": "4", "subreddit": "learnfrench", "subreddit_id": "t5_2sucz"}, {"author": "DisappointedCitrus", "body": "Mind if I ask what the name of your YouTube channel is?", "created_utc": "1659129002.0", "edited": "False", "id": "ii6funz", "is_submitter": "False", "link_id": "t3_wbdmzl", "parent_id": "t1_ii6c37m", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "DisappointedCitrus", "body": "I try not to create labels for myself or tie up my identity with my hobbies/interests/career, since I find that makes it harder to keep those things separate from my pride and sense of self.\n\nIf I make a mistake, experience criticism, or can’t maintain a certain level of attainment in a field, I want to reflect on that to improve myself and not take it personally. And if I decide I need to move on from something because it’s no longer the right thing for me I find it’s easier when it hasn’t become part of how I define myself.\n\nI probably answered your fun question a little too seriously. I generally would say that I love learning languages, learning about them, and connecting with people over them, but it’s more something I do than who I am.", "created_utc": "1659128815.0", "edited": "False", "id": "ii6fem4", "is_submitter": "False", "link_id": "t3_wbdmzl", "parent_id": "t3_wbdmzl", "score": "12", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "DisappointedCitrus", "body": "Lots of other great cities to live in in Canada too. I know you’ve probably done your research to narrow it down to Halifax, but depending on what you’re looking for there are some other pretty nice places to live, and of course within different parts of the same city/province/territory you’ll have a completely different experience.\n\nPersonally I’ve lived in Edmonton, Kamloops and Whitehorse and met great, kind people in each one. Each city had totally different opportunities and experiences. I’ve stayed in Edmonton for the low cost of living and family nearby, but I’d move back to the Central Interior of BC in a heartbeat if I get the opportunity.", "created_utc": "1659127208.0", "edited": "False", "id": "ii6biff", "is_submitter": "False", "link_id": "t3_wb4jgx", "parent_id": "t1_ii5pbdg", "score": "1", "subreddit": "canada", "subreddit_id": "t5_2qh68"}, {"author": "DisappointedCitrus", "body": "I’d say whatever will keep you most interested in continuing. If you start from the beginning you may get bored and discontinue again, but it never hurts to do a quick review.", "created_utc": "1659122302.0", "edited": "False", "id": "ii5zdwc", "is_submitter": "False", "link_id": "t3_wb9ytm", "parent_id": "t3_wb9ytm", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "DisappointedCitrus", "body": "My eskie is very loud. She’s 9 months old now and is getting less jumpy but she loves to be vocal. \nShe barks whenever she gets excited, when she runs, when she hears other dogs barking, when she meets a new dog, when she hears a dog collar jingling etc.\n\nThey are great dogs, so smart and energetic and mine is especially kind and just loves people and cuddles. They might not be the dog for you if you can’t tolerate noise, almost constant shedding, or a high energy dog that literally always wants to be around you and doing something.\n\nEdit: Adding that we live in an apartment and almost always have white noise playing loud throughout the day to mask the sounds that cause her to bark. I work from home and she sleeps the entire work day (with a lunch break) but today she barked during both of my meetings.\n\nI also have reservations about leaving her alone. She’s crate trained but has a lot of separation anxiety, this is mostly training but we haven’t been able to leave her alone and do something without some worrying that she’ll have a barking fit or start howling.", "created_utc": "1658439797.0", "edited": "1658440841.0", "id": "ih3w740", "is_submitter": "False", "link_id": "t3_w42g7x", "parent_id": "t3_w42g7x", "score": "1", "subreddit": "americaneskimo", "subreddit_id": "t5_2tv86"}, {"author": "DisappointedCitrus", "body": "I had it inside under a grow light, my other two lemon trees I started from seed got the priority so this one was just on the side. \n\nAll the leaves fell off except for one that was under the light, and the branches (I thought) they died as they were brown, dry and pretty much just snapped off like dead wood\n\nI was also dealing with a spider mite infestation and there were webs on those branches so I got a bit carried away with cleaning up. Definitely some learning moments", "created_utc": "1657813099.0", "edited": "False", "id": "ig51la1", "is_submitter": "True", "link_id": "t3_vxkr8s", "parent_id": "t1_ig1xs1s", "score": "2", "subreddit": "Citrus", "subreddit_id": "t5_2ti51"}, {"author": "DisappointedCitrus", "body": "Yeah I kind of think so too! Since posting this I’m starting to see some tiny buds at the centre so I’m hopeful it’ll come back strong. I’ll repot it this week to help it along\n\nOn another lemon tree I trimmed a spindly branch down and it exploded in new branches so I’ll try that here once it’s a bit more established again. Thanks!", "created_utc": "1657812747.0", "edited": "False", "id": "ig50o4c", "is_submitter": "True", "link_id": "t3_vxkr8s", "parent_id": "t1_ifwt9gj", "score": "2", "subreddit": "Citrus", "subreddit_id": "t5_2ti51"}, {"author": "DisappointedCitrus", "body": "Interesting, you mean grafting the side branch vertically?", "created_utc": "1657812405.0", "edited": "False", "id": "ig4zrua", "is_submitter": "True", "link_id": "t3_vxkr8s", "parent_id": "t1_ifwskce", "score": "1", "subreddit": "Citrus", "subreddit_id": "t5_2ti51"}, {"author": "DisappointedCitrus", "body": "Yeah in hindsight I messed up, those branches down to where I cut all appeared dry and dead but I should have left things alone until summer", "created_utc": "1657812162.0", "edited": "False", "id": "ig4z53c", "is_submitter": "True", "link_id": "t3_vxkr8s", "parent_id": "t1_ifwpuct", "score": "1", "subreddit": "Citrus", "subreddit_id": "t5_2ti51"}, {"author": "DisappointedCitrus", "body": "Lol, made me laugh at least", "created_utc": "1657659567.0", "edited": "False", "id": "ifwndwc", "is_submitter": "True", "link_id": "t3_vxkr8s", "parent_id": "t1_ifwn9i4", "score": "2", "subreddit": "Citrus", "subreddit_id": "t5_2ti51"}, {"author": "DisappointedCitrus", "body": "I’m glad that you find it useful! I found this American website that may have links to resources you can access, but the information will probably be the same. [Children & Adults with ADHD Website](https://chadd.org)\n\nI know for me it’s been a process of learning and understanding just how much my ADHD has impacted my life and in which ways. I can say now that I’m getting treatment I feel much more optimistic about my future.", "created_utc": "1654625366.0", "edited": "False", "id": "ibijban", "is_submitter": "False", "link_id": "t3_v66xwn", "parent_id": "t1_ibgt0f6", "score": "1", "subreddit": "ADHD", "subreddit_id": "t5_2qnwb"}, {"author": "DisappointedCitrus", "body": "I relate to this 100%. My interests get so deep that I start to plan around them and invest in them, but find a few weeks to months later that it just doesn’t do it for me anymore. I’ve unfortunately spent quite a bit of money that way, but sometimes I find I can cycle back into that interest later.\n\nAs far as work I’m always second guessing and wondering whether I’m in the right field or if the grass is greener elsewhere. I only recently got diagnosed and I’m finding that medication is helping me not only do better at work but enjoy it more too.\n\nCADDAC (Centre for ADHD Awareness, Canada) has a document called “Choosing the Right Career” that you might find useful. [CADDAC Employment Page](https://caddac.ca/about-adhd/in-general/). You just have to click “In Workplace” and it’s near the bottom of the page.", "created_utc": "1654548030.0", "edited": "1654548448.0", "id": "iber3ks", "is_submitter": "False", "link_id": "t3_v66xwn", "parent_id": "t3_v66xwn", "score": "6", "subreddit": "ADHD", "subreddit_id": "t5_2qnwb"}, {"author": "DisappointedCitrus", "body": "Frida is an Alberta telehealth service that helped me get diagnosed, $200 and took a week from making the appointment. So much about my life makes sense since I got diagnosed", "created_utc": "1652861318.0", "edited": "False", "id": "i91tbg7", "is_submitter": "False", "link_id": "t3_u4gsq5", "parent_id": "t3_u4gsq5", "score": "2", "subreddit": "uAlberta", "subreddit_id": "t5_2spif"}, {"author": "DisappointedCitrus", "body": "There’s a new strain of Avian flu in Alberta, if you see a dead bird please call the city’s Dead Animal Removal team through 411 for identification and removal, as they are tracking the spread.", "created_utc": "1652421579.0", "edited": "False", "id": "i8f45w2", "is_submitter": "False", "link_id": "t3_uoivpu", "parent_id": "t3_uoivpu", "score": "15", "subreddit": "Edmonton", "subreddit_id": "t5_2raht"}, {"author": "DisappointedCitrus", "body": "Vocal, she has a lot of barking triggers and she’ll whine and growls a lot to communicate. She’s temperamental sometimes and makes sure I know when she’s not in the mood to be picked up.\n\nAlways down to play, loves to chew, and such a quick study when we’re training.\n\nMaybe atypically she’s also very friendly, she loves when strangers give her attention and pets, though she usually barks at them at first, she’s still a puppy though so some of her behaviours are transient.", "created_utc": "1652386824.0", "edited": "False", "id": "i8d3mgg", "is_submitter": "False", "link_id": "t3_unsoz8", "parent_id": "t3_unsoz8", "score": "4", "subreddit": "americaneskimo", "subreddit_id": "t5_2tv86"}, {"author": "DisappointedCitrus", "body": "My 6 m.o. pup loves to chew mulch, rabbit poop, her own poop, and sometimes rocks.\n\nLately at the vet’s recommendation I’ve been using a basket muzzle, as she got seriously sick for a couple weeks and the x-rays showed she had eaten a few rocks. She’s been healthy for a couple weeks now and I’m starting to let her leave the muzzle off on walks sometimes. I just watch to make sure she’s not in the mood to put all of the ground things in her mouth. \n\nI find beef liver treats are a great incentive for training the “leave it” or “release” command.", "created_utc": "1652385485.0", "edited": "False", "id": "i8d06rp", "is_submitter": "False", "link_id": "t3_unyu81", "parent_id": "t3_unyu81", "score": "3", "subreddit": "puppy101", "subreddit_id": "t5_2rw7o"}, {"author": "DisappointedCitrus", "body": "I’m late to the party but would also recommend the Insight Timer app! It has a ton of guided meditations that provide guidance and advice as well", "created_utc": "1652335115.0", "edited": "False", "id": "i8aaxhe", "is_submitter": "False", "link_id": "t3_t9f4dh", "parent_id": "t3_t9f4dh", "score": "1", "subreddit": "ADHD", "subreddit_id": "t5_2qnwb"}, {"author": "DisappointedCitrus", "body": "Could he have been referring to himself? As in its his turn to be successful.", "created_utc": "1651591718.0", "edited": "False", "id": "i765kxa", "is_submitter": "False", "link_id": "t3_uh8nko", "parent_id": "t1_i74t376", "score": "2", "subreddit": "TattooDesigns", "subreddit_id": "t5_2t57f"}, {"author": "DisappointedCitrus", "body": "It depends on what the complaint is about, and the which team that the comment goes to as far as how fast it will be actioned.\n\nThe citizen dashboard does have some metrics though perhaps not specifically about how fast 311 calls are actioned.\n\n[Citizen Dashboard](https://dashboard.edmonton.ca)", "created_utc": "1651497951.0", "edited": "False", "id": "i70x26l", "is_submitter": "False", "link_id": "t3_ug49d4", "parent_id": "t1_i6z6f5r", "score": "1", "subreddit": "Edmonton", "subreddit_id": "t5_2raht"}, {"author": "DisappointedCitrus", "body": "😒🍋", "created_utc": "1651291673.0", "edited": "False", "id": "i6r5bxs", "is_submitter": "False", "link_id": "t3_ues8yc", "parent_id": "t1_i6qx9ne", "score": "5", "subreddit": "interestingasfuck", "subreddit_id": "t5_2qhsa"}, {"author": "DisappointedCitrus", "body": "Organ harvesting", "created_utc": "1651277032.0", "edited": "False", "id": "i6qcfvk", "is_submitter": "False", "link_id": "t3_ues8yc", "parent_id": "t1_i6qbxw6", "score": "52", "subreddit": "interestingasfuck", "subreddit_id": "t5_2qhsa"}, {"author": "DisappointedCitrus", "body": "Thank you for putting together this very detailed response and additional resources. I’m not OP but this was helpful for me.", "created_utc": "1650652864.0", "edited": "False", "id": "i5s6u0b", "is_submitter": "False", "link_id": "t3_u9h2k0", "parent_id": "t1_i5rg3tl", "score": "1", "subreddit": "Buddhism", "subreddit_id": "t5_2qhnf"}, {"author": "DisappointedCitrus", "body": "Thank you for sharing", "created_utc": "1650412601.0", "edited": "False", "id": "i5exu90", "is_submitter": "False", "link_id": "t3_u7eyi8", "parent_id": "t3_u7eyi8", "score": "2", "subreddit": "Buddhism", "subreddit_id": "t5_2qhnf"}, {"author": "DisappointedCitrus", "body": "By definition fascism is ultranationalist dictatorship", "created_utc": "1650386113.0", "edited": "False", "id": "i5d1hhz", "is_submitter": "False", "link_id": "t3_u6k8oh", "parent_id": "t1_i5a0gvw", "score": "0", "subreddit": "socialism", "subreddit_id": "t5_2qjii"}, {"author": "DisappointedCitrus", "body": "I'm a few years late to this but I would love to read your dissertation if you're still willing to share it!", "created_utc": "1650381674.0", "edited": "False", "id": "i5cput2", "is_submitter": "False", "link_id": "t3_cjb2u9", "parent_id": "t1_evekrmj", "score": "1", "subreddit": "asklinguistics", "subreddit_id": "t5_2u7nj"}, {"author": "DisappointedCitrus", "body": "I work for the City in an engineering department, creating maps, drafting contracts and managing some of them. I’d like to think I’m having a beneficial impact on the community. There’s also good work/life balance so there’s lots of time for things such as practice.", "created_utc": "1648501808.0", "edited": "False", "id": "i2hiu62", "is_submitter": "False", "link_id": "t3_tqcjeh", "parent_id": "t3_tqcjeh", "score": "3", "subreddit": "Buddhism", "subreddit_id": "t5_2qhnf"}, {"author": "DisappointedCitrus", "body": "Looks like the article only used the anecdotal information in this thread as a source", "created_utc": "1648140486.0", "edited": "False", "id": "i1y8srg", "is_submitter": "False", "link_id": "t3_tlzlym", "parent_id": "t1_i1xpubx", "score": "2", "subreddit": "antiwork", "subreddit_id": "t5_2y77d"}, {"author": "DisappointedCitrus", "body": "That’s great congrats on landing that job! It’s great to hear that you were able to do that self-taught, as my current career is largely unrelated.", "created_utc": "1645240814.0", "edited": "False", "id": "hxj9a2k", "is_submitter": "True", "link_id": "t3_svmow7", "parent_id": "t1_hxh96wf", "score": "2", "subreddit": "xrdesign", "subreddit_id": "t5_4wssst"}, {"author": "DisappointedCitrus", "body": "Thanks so much for your well thought out answer! I can tell you have passion", "created_utc": "1645240733.0", "edited": "False", "id": "hxj94e5", "is_submitter": "True", "link_id": "t3_svmow7", "parent_id": "t1_hxi6era", "score": "2", "subreddit": "xrdesign", "subreddit_id": "t5_4wssst"}, {"author": "DisappointedCitrus", "body": "Sounds like a grind, do you get much satisfaction out of the process?", "created_utc": "1645208872.0", "edited": "False", "id": "hxh76m6", "is_submitter": "True", "link_id": "t3_svmow7", "parent_id": "t1_hxh1qiw", "score": "2", "subreddit": "xrdesign", "subreddit_id": "t5_4wssst"}, {"author": "DisappointedCitrus", "body": "Dracaena Massangeana, I have the same one at home", "created_utc": "1642349240.0", "edited": "False", "id": "hsww4fe", "is_submitter": "False", "link_id": "t3_s59u3b", "parent_id": "t3_s59u3b", "score": "6", "subreddit": "whatsthisplant", "subreddit_id": "t5_2si8i"}, {"author": "DisappointedCitrus", "body": "I have an 11 week old American Eskimo, she eats about 1 cup to 1.25 cups per day and is about 7 lbs. \n\nI’m currently using 2 different foods and each bag has a feeding guide for puppies based on weight", "created_utc": "1642019963.0", "edited": "False", "id": "hse9p38", "is_submitter": "False", "link_id": "t3_s23w1f", "parent_id": "t3_s23w1f", "score": "1", "subreddit": "puppy101", "subreddit_id": "t5_2rw7o"}, {"author": "DisappointedCitrus", "body": "r/Zelda would like this", "created_utc": "1635880585.0", "edited": "False", "id": "hj1quvf", "is_submitter": "False", "link_id": "t3_qkv3rt", "parent_id": "t3_qkv3rt", "score": "2", "subreddit": "tattoos", "subreddit_id": "t5_2qj9g"}, {"author": "DisappointedCitrus", "body": "What’s most important is how you feel about it! Personally I like it", "created_utc": "1631423621.0", "edited": "False", "id": "hcj1kgp", "is_submitter": "False", "link_id": "t3_pml3pl", "parent_id": "t3_pml3pl", "score": "1", "subreddit": "TattooDesigns", "subreddit_id": "t5_2t57f"}, {"author": "DisappointedCitrus", "body": "Clinging to ideas of what could be or should be is not conducive to practice in my opinion. When we do so we paint with a biased brush and create a gap between expectations and reality, which just leads to more suffering.", "created_utc": "1629124030.0", "edited": "False", "id": "h95sbj3", "is_submitter": "False", "link_id": "t3_p5gbpd", "parent_id": "t3_p5gbpd", "score": "10", "subreddit": "Buddhism", "subreddit_id": "t5_2qhnf"}, {"author": "DisappointedCitrus", "body": "This is very helpful, thanks for taking the time!", "created_utc": "1625937729.0", "edited": "False", "id": "h4pywsw", "is_submitter": "False", "link_id": "t3_ognxjx", "parent_id": "t1_h4mp5oc", "score": "1", "subreddit": "Citrus", "subreddit_id": "t5_2ti51"}, {"author": "DisappointedCitrus", "body": "For my own education, how would you differentiate between the symptoms of fertilizer burn and nutrient deficiency in citrus? \n\nI have noticed similar symptoms in one of my trees where I over-fertilized, but I recognize it may have had other issues as well", "created_utc": "1625861576.0", "edited": "False", "id": "h4mnkrn", "is_submitter": "False", "link_id": "t3_ognxjx", "parent_id": "t1_h4lq17s", "score": "2", "subreddit": "Citrus", "subreddit_id": "t5_2ti51"}, {"author": "DisappointedCitrus", "body": "Looks like you got a solid response from u/vlantar, I will defer to their experience. Best of luck in your lemon tree recovery!", "created_utc": "1625861166.0", "edited": "False", "id": "h4mmpbr", "is_submitter": "False", "link_id": "t3_ognxjx", "parent_id": "t1_h4lpqz9", "score": "2", "subreddit": "Citrus", "subreddit_id": "t5_2ti51"}, {"author": "DisappointedCitrus", "body": "It may be helpful to provide info on soil type, watering & fertilizer habits, whether it’s inside/outside, how much sun it gets.\n\nThis looks like fertilizer burn to me", "created_utc": "1625806076.0", "edited": "False", "id": "h4k3z10", "is_submitter": "False", "link_id": "t3_ognxjx", "parent_id": "t3_ognxjx", "score": "1", "subreddit": "Citrus", "subreddit_id": "t5_2ti51"}, {"author": "DisappointedCitrus", "body": "This is so great!", "created_utc": "1625754567.0", "edited": "False", "id": "h4h6jzr", "is_submitter": "False", "link_id": "t3_ocpsss", "parent_id": "t3_ocpsss", "score": "1", "subreddit": "Citrus", "subreddit_id": "t5_2ti51"}, {"author": "DisappointedCitrus", "body": "Is kamma not related to intent? There is a difference between euthanizing your pet because it has become inconvenient, and euthanizing it at the suggestion of your Vet due to it’s suffering", "created_utc": "1625604505.0", "edited": "False", "id": "h4a2u6m", "is_submitter": "False", "link_id": "t3_n0w22d", "parent_id": "t1_gwe6jic", "score": "2", "subreddit": "Buddhism", "subreddit_id": "t5_2qhnf"}, {"author": "DisappointedCitrus", "body": "The Years of Rice and Salt by Kim Stanley Robinson", "created_utc": "1625451997.0", "edited": "False", "id": "h436ml2", "is_submitter": "False", "link_id": "t3_odn1fq", "parent_id": "t3_odn1fq", "score": "2", "subreddit": "suggestmeabook", "subreddit_id": "t5_31t41"}, {"author": "DisappointedCitrus", "body": "There’s quite a few free ones I think, I use PictureThis and just use the free version", "created_utc": "1625116572.0", "edited": "False", "id": "h3nfa5j", "is_submitter": "False", "link_id": "t3_oaomho", "parent_id": "t1_h3n41r4", "score": "2", "subreddit": "Albertagardening", "subreddit_id": "t5_29os2v"}, {"author": "DisappointedCitrus", "body": "Looks like an Eve’s pin cactus", "created_utc": "1625070623.0", "edited": "False", "id": "h3ks9d9", "is_submitter": "False", "link_id": "t3_ob0jgx", "parent_id": "t3_ob0jgx", "score": "1", "subreddit": "whatsthisplant", "subreddit_id": "t5_2si8i"}, {"author": "DisappointedCitrus", "body": "Looks like a Haworthia limifolia, aka Fairy Washboard!", "created_utc": "1625070334.0", "edited": "False", "id": "h3krl9g", "is_submitter": "False", "link_id": "t3_ob0k8x", "parent_id": "t3_ob0k8x", "score": "2", "subreddit": "whatsthisplant", "subreddit_id": "t5_2si8i"}, {"author": "DisappointedCitrus", "body": "It’s a Smooth Hydrangea. Full disclosure I used an app to identify it", "created_utc": "1625070042.0", "edited": "False", "id": "h3kqvjk", "is_submitter": "False", "link_id": "t3_oaomho", "parent_id": "t3_oaomho", "score": "6", "subreddit": "Albertagardening", "subreddit_id": "t5_29os2v"}, {"author": "DisappointedCitrus", "body": "This", "created_utc": "1624652816.0", "edited": "False", "id": "h319y4s", "is_submitter": "False", "link_id": "t3_o7elt7", "parent_id": "t1_h30jdcy", "score": "1", "subreddit": "alberta", "subreddit_id": "t5_2qxon"}]