[{"author": "duyihuan", "body": "For me it's Mandarin because it's challenging and there are lots of business opportunities out there for Mandarin speakers.", "created_utc": "1666858672.0", "edited": "False", "id": "ityqivv", "is_submitter": "False", "link_id": "t3_yeg8dx", "parent_id": "t3_yeg8dx", "score": "4", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "duyihuan", "body": "Yosi break.", "created_utc": "1666857442.0", "edited": "False", "id": "ityp42u", "is_submitter": "False", "link_id": "t3_yeh3df", "parent_id": "t3_yeh3df", "score": "1", "subreddit": "PinoyProgrammer", "subreddit_id": "t5_33gof"}, {"author": "duyihuan", "body": "If di mo kaya bitawan games, edi gaming laptop. Pero kung kaya naman at seryoso ka, edi mb.", "created_utc": "1662724427.0", "edited": "False", "id": "inprnmz", "is_submitter": "False", "link_id": "t3_x9ojg1", "parent_id": "t3_x9ojg1", "score": "2", "subreddit": "PinoyProgrammer", "subreddit_id": "t5_33gof"}, {"author": "duyihuan", "body": "Pinakabest at simpleng sagot na madalas gamit ko din.", "created_utc": "1662088950.0", "edited": "False", "id": "imr2auc", "is_submitter": "False", "link_id": "t3_x3kd12", "parent_id": "t1_imq8yag", "score": "3", "subreddit": "PinoyProgrammer", "subreddit_id": "t5_33gof"}, {"author": "duyihuan", "body": "Very easy question. If di supported ng drivers mo linux tapos di mo maiwanan gaming, windows ka. If kaya mo magtiis then go for linux. Kung malakas naman setup mo I suggest virtual machine na lang tapos host mo windows para magawa mo pa din mga need mong gawin na required windows ang gamit.\n\nI don't recommend wine nor dual boot kasi if newbie ka mas mataas chances masira mo configuration ng setup mo.\n\nAnother thing pala is if terminal lang naman habol mo at basic commands, bat di ka na lang magsetup ng WSL sa windows?", "created_utc": "1662088777.0", "edited": "False", "id": "imr1xl1", "is_submitter": "False", "link_id": "t3_x34zqr", "parent_id": "t3_x34zqr", "score": "1", "subreddit": "PinoyProgrammer", "subreddit_id": "t5_33gof"}, {"author": "duyihuan", "body": "Well in the first place, what made you use GNOME 43? And also, have you tried checking out its features that suits your needs and also tried checking out videos about it? If it's not working for you then try out a different desktop environment that will suit your needs and you feel comfortable at.", "created_utc": "1661549201.0", "edited": "False", "id": "ilx8i1b", "is_submitter": "False", "link_id": "t3_wyh2vy", "parent_id": "t3_wyh2vy", "score": "1", "subreddit": "linux", "subreddit_id": "t5_2qh1a"}, {"author": "duyihuan", "body": "As long as there are no documents or receipts that were signed, there is nothing you can do. Damn, this is CL, there is nothing you can do to get a refunds or whatsoever.", "created_utc": "1661451671.0", "edited": "False", "id": "ilrl0lb", "is_submitter": "False", "link_id": "t3_wxgroy", "parent_id": "t3_wxgroy", "score": "2", "subreddit": "craigslist", "subreddit_id": "t5_2qh5k"}, {"author": "duyihuan", "body": "Hmmm. Have you tried checking this out? https://doc.qt.io/qt-6/supported-platforms.html", "created_utc": "1661451487.0", "edited": "False", "id": "ilrkj5k", "is_submitter": "False", "link_id": "t3_wx82hx", "parent_id": "t3_wx82hx", "score": "3", "subreddit": "QtFramework", "subreddit_id": "t5_2sh0k"}, {"author": "duyihuan", "body": "Well, no matter how systems are hardened, hackers and all-alike would always create new exploits and develop tools out of their exploits to make money. It's been like this since forever and the most scary part is that, who knows what exploits out there are not being disclosed yet to the public and is currently being used by the government, military, agencies or organizations who have malicious intent. Just think about the exploits that that were exposed by the The Shadow Brokers (TSB) that were being used by the Equation Group since the mid 90s. Aside from them, there are also similar actors.", "created_utc": "1661451323.0", "edited": "False", "id": "ilrk41y", "is_submitter": "False", "link_id": "t3_wwsvpm", "parent_id": "t3_wwsvpm", "score": "1", "subreddit": "hacking", "subreddit_id": "t5_2qhva"}, {"author": "duyihuan", "body": "A valuable lesson that you need to embrace in this is situation is that in this world, you don't always get what you want and unfair talaga ang mundo. It's not that dinadown kita pero take it as an advice to overcome inggit and do better next time. Its just the matter of how hinandle ng friend mo yung interview, pano siya dumiskarte and also, baka may skills siya na may solid basis and wala ka nun. Di pa naman huli ang lahat kasi fresh grad ka pa lang and dami pang business opportunities out there. Its better na itry mo din ibang companies kung di mo talaga matake na kasama mo friend mo.", "created_utc": "1661450536.0", "edited": "False", "id": "ilri305", "is_submitter": "False", "link_id": "t3_wxadw7", "parent_id": "t3_wxadw7", "score": "3", "subreddit": "phcareers", "subreddit_id": "t5_2sbnx0"}, {"author": "duyihuan", "body": "Ever thought about \"affiliate marketing\" or mayabe use your skills to provide services?", "created_utc": "1661450117.0", "edited": "False", "id": "ilrgzwl", "is_submitter": "False", "link_id": "t3_wx825e", "parent_id": "t3_wx825e", "score": "0", "subreddit": "thesidehustle", "subreddit_id": "t5_11hzjf"}, {"author": "duyihuan", "body": "I believe na hindi ka lang para sa transcribing that's why you need to upskill yourself. While doing that sort of work, I think its best na gawin mo siya as temporary job and on the side, find ways to improve yourself using ibang skills at konting boost ng confidence. Since introvert ka and you love your lappy, I think you are better of with programming or maybe content writing.", "created_utc": "1661450028.0", "edited": "False", "id": "ilrgrh0", "is_submitter": "False", "link_id": "t3_wxbfym", "parent_id": "t3_wxbfym", "score": "2", "subreddit": "buhaydigital", "subreddit_id": "t5_40th7s"}, {"author": "duyihuan", "body": "Edi mag full stack ka tapos gawa ka systems from scratch. In that way, mas magagamit mo in the long run at pwede mo dun gamitin for presentation purposes mga pinagpractisan mo na code na lahat yun gamit. Add mo na din pagdedevelop ng progressive web app or pwa kung tawagin.", "created_utc": "1661428791.0", "edited": "False", "id": "ilq0jqa", "is_submitter": "False", "link_id": "t3_wx7gmp", "parent_id": "t1_ilplre1", "score": "3", "subreddit": "PinoyProgrammer", "subreddit_id": "t5_33gof"}, {"author": "duyihuan", "body": "Well you could use the websocket crate. I wouldn't get into details with the code since there is already a documentation which you could easily grasp on.\n\nWebsocket is similar to UDP but with TCP reliability. What happens is that HTTP would be the initial transport mechanism and keeps the TCP connection alive while it handles ins and outs.\n\nI guess you could use that. Just read the documentation and you're good to go.", "created_utc": "1661102263.0", "edited": "False", "id": "il7qphp", "is_submitter": "False", "link_id": "t3_wu3nxb", "parent_id": "t3_wu3nxb", "score": "6", "subreddit": "rust", "subreddit_id": "t5_2s7lj"}, {"author": "duyihuan", "body": "Depends on the language. There are some websites which gives out free small audio samples that you could listen to how words and sentences are pronounced.", "created_utc": "1661101684.0", "edited": "False", "id": "il7pbj1", "is_submitter": "False", "link_id": "t3_wu30q0", "parent_id": "t3_wu30q0", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "duyihuan", "body": "Hi OP! Since you claim na you did your thesis from scratch all by yourself both front-end and backend, why don't you try to look for open source projects na medyo similar sa thesis mo back then tapos try to tweak the project while studying the programming language and technologies used? At least may hands on approach ka na kaagad instead na aaralin mo ulit from the basics, mas magwaste ka lang ng time if ganon.", "created_utc": "1661101358.0", "edited": "False", "id": "il7oi2c", "is_submitter": "False", "link_id": "t3_wts6sy", "parent_id": "t3_wts6sy", "score": "2", "subreddit": "PinoyProgrammer", "subreddit_id": "t5_33gof"}, {"author": "duyihuan", "body": "I think OP the best way you can think of right now instead of getting all too paranoid is focus more on expanding your business and maintaining the lifestyle you currently have right now. You are already well off for someone na wala pang family na binubuhay though money is perishable in the long run kasi di maiiwasan ang sakit and accidents. To follow na lang yan, yung house and yung cars na want mo.\n\nI have friends din na similar sayo so I know how it feels. Sa iba na bashers mo, I believe ganun lang sila either naartehan lang sayo kasi you are already living the life they couldn't live OR thinking mema ka lang.", "created_utc": "1661098260.0", "edited": "False", "id": "il7guqf", "is_submitter": "False", "link_id": "t3_wu1omo", "parent_id": "t3_wu1omo", "score": "5", "subreddit": "phinvest", "subreddit_id": "t5_32eoz"}, {"author": "duyihuan", "body": "Well if you belong to a rich family and you have rich set of friends who are elitist or you came from an old school family who believes you can't get a job without being in one of the big 4 or a prestigous private school is actually a real big deal.\n\nThroughout the years, I have worked with company owners and CEOs of some companies who came straight out of state universities and sometimes are undergrads or have no means of education at all who are now very rich and very successful in life.\n\nIt's all a matter of talking to the right people, having a working experience, having good connections, maintaining good good friendship with people you work with, how you deliver words, having actual skills, and lastly \"diskarte\".", "created_utc": "1661097660.0", "edited": "False", "id": "il7fdtj", "is_submitter": "False", "link_id": "t3_wtwowb", "parent_id": "t3_wtwowb", "score": "1", "subreddit": "PinoyProgrammer", "subreddit_id": "t5_33gof"}, {"author": "duyihuan", "body": "True. Only software I know that existed way back was Rosetta Stone. At least in modern times, there are newer techniques, new methods of learning and also apps that exists to practice words, phrases and sentences daily.\n\nMandarin is really a hard language and should be taken seriously he once said.", "created_utc": "1661096580.0", "edited": "False", "id": "il7cr4f", "is_submitter": "False", "link_id": "t3_wtyz2c", "parent_id": "t1_il7c3st", "score": "3", "subreddit": "ChineseLanguage", "subreddit_id": "t5_2qyz1"}, {"author": "duyihuan", "body": "Neither of the two because languages are just tools you use to build an actual project and studying it is very easy (shouldn't take more than 2 to 3 days) unless you want to go in-depth.\n\nBest answer is get a project (check out YouTube videos or search for blogs) and challenge yourself by adding features to it and reverse engineering the original source code. Also focus more on the schematic of the actual hardware and the logic rather than coding. That is the best way to learn arduino in my opinion.", "created_utc": "1661096178.0", "edited": "False", "id": "il7bsi3", "is_submitter": "False", "link_id": "t3_wtl8dg", "parent_id": "t3_wtl8dg", "score": "2", "subreddit": "arduino", "subreddit_id": "t5_2qknj"}, {"author": "duyihuan", "body": "I can barely say no because both are still backwards compatible and also, Qt6 just has new additional features. Maybe it has something to do with your project instead of the actual code of plasma.", "created_utc": "1661095912.0", "edited": "False", "id": "il7b5o6", "is_submitter": "False", "link_id": "t3_wtwfnn", "parent_id": "t1_il79kjn", "score": "1", "subreddit": "QtFramework", "subreddit_id": "t5_2sh0k"}, {"author": "duyihuan", "body": "Actually yes, it will boost learning. According to a friend who is also my mentor in Russian, German and Mandarin languages (whenever he has free time) once told me that it took him 9 years to fully speak, read and write in Mandarin fluently and has lived in China for more than 13 years. He only studied using books, articles, audio files, befriending locals and communicating with his business partners.\n\nHe also told me that having a native friend will help you a lot especially those who want to learn foreign language that you know. A language exchange partner  to speak.", "created_utc": "1661095772.0", "edited": "False", "id": "il7atui", "is_submitter": "False", "link_id": "t3_wtyz2c", "parent_id": "t1_il6zvct", "score": "6", "subreddit": "ChineseLanguage", "subreddit_id": "t5_2qyz1"}, {"author": "duyihuan", "body": "Even with more than decade years of experience, I must say that we will never be ready because technology is a never ending cycle of learning what's new and re-learning legacy tech stack.", "created_utc": "1661095090.0", "edited": "False", "id": "il7988k", "is_submitter": "False", "link_id": "t3_wttnnf", "parent_id": "t3_wttnnf", "score": "2", "subreddit": "PinoyProgrammer", "subreddit_id": "t5_33gof"}, {"author": "duyihuan", "body": "Have you considered reading the debug symbols in the binary file to track down the cause of the segmentation fault? These types of errors are known for illegally accessing memory addresses they shouldn't be accessing.", "created_utc": "1661094741.0", "edited": "False", "id": "il78f57", "is_submitter": "False", "link_id": "t3_wtwfnn", "parent_id": "t3_wtwfnn", "score": "1", "subreddit": "QtFramework", "subreddit_id": "t5_2sh0k"}, {"author": "duyihuan", "body": "What about reading the book called \"Fluent Forever by Gabriel Wyner\"? It tells the story of the author on how he became a polyglot and how he increased his vocabulary with ease and his mistakes throughout the years. It also covers techniques in learning language easily which you can use in Deutsch and other languages.", "created_utc": "1661087135.0", "edited": "False", "id": "il6s2u1", "is_submitter": "False", "link_id": "t3_wttbcq", "parent_id": "t3_wttbcq", "score": "2", "subreddit": "German", "subreddit_id": "t5_2qq51"}, {"author": "duyihuan", "body": "Also funny thing is that whenever I get to hangout with friends, they tell me that I still look the same throughout the years. I always comment, it's just a matter of not changing clothes since most of my friends tend to buy from the latest trends.", "created_utc": "1661086890.0", "edited": "False", "id": "il6rmui", "is_submitter": "False", "link_id": "t3_wsq5kv", "parent_id": "t1_il6knm6", "score": "2", "subreddit": "realestateinvesting", "subreddit_id": "t5_2qnt1"}, {"author": "duyihuan", "body": "It's very easy. All you have to do is grab torrent files from from those servers (just look up at Google their respective directories or search via mirrors) then seed. That's all. ;)", "created_utc": "1661086690.0", "edited": "False", "id": "il6r9rq", "is_submitter": "False", "link_id": "t3_wt0zhf", "parent_id": "t1_il5zhsn", "score": "1", "subreddit": "InternetPH", "subreddit_id": "t5_wsr3a"}, {"author": "duyihuan", "body": "Well you can start reading short stories of other writers and try to translate them. Once you get used to it, try to come up with your own story so you won't be having a hard time translating from time to time and you could focus more on being creative.", "created_utc": "1661041996.0", "edited": "False", "id": "il4u1gh", "is_submitter": "False", "link_id": "t3_wtjitp", "parent_id": "t3_wtjitp", "score": "3", "subreddit": "German", "subreddit_id": "t5_2qq51"}, {"author": "duyihuan", "body": "I guess you have to start backing up as a routine since you are officially a linux user. It's more harder with arch since you get to build most stuff from scratch so having a script to automate installations and dependencies also help.\n\nI have had this issue with linux over the years that whenever I delete files especially larger files, my free space won't shrink. Everything is bloated dude, I already searched everywhere for answers. I suggested BleachBit because it helps but only for a short amount of time. I always do fresh installs whenever things get bloated and out of hand.", "created_utc": "1661040721.0", "edited": "False", "id": "il4rfxm", "is_submitter": "False", "link_id": "t3_wtku18", "parent_id": "t1_il4pwm0", "score": "1", "subreddit": "archlinux", "subreddit_id": "t5_2qrzu"}, {"author": "duyihuan", "body": "Apps are just a way to maintain what you have learned day by day if you don't have someone to talk to in the language you are learning.", "created_utc": "1661039903.0", "edited": "False", "id": "il4psc5", "is_submitter": "False", "link_id": "t3_wtk1p6", "parent_id": "t3_wtk1p6", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "duyihuan", "body": "Have you considered backing up your files and doing a fresh install? Or maybe, using tools such as BleachBit?", "created_utc": "1661039642.0", "edited": "False", "id": "il4p950", "is_submitter": "False", "link_id": "t3_wtku18", "parent_id": "t3_wtku18", "score": "-3", "subreddit": "archlinux", "subreddit_id": "t5_2qrzu"}, {"author": "duyihuan", "body": "Well, based dun sa sinabi mo OP in regards na may clear na roadmap kayo at sa isa sa mga nagreply about reverse engineering a pet project, that is indeed already something na pwede mapatunayan na may worth ang kuya mo sa industry.\n\nPero syempre, need pa din niya ng working experience so I would suggest na maghanap siya ng mga freelance projects as a starter gamit yung pet project for portfolio purposes. Dun siya mag grow lalo kasi once makakuha siya project, may instance din na makakuha siya ng project na may tech stack same dun sa previous na ginamit niya so rinse and repeat na lang.\n\nI am 100% if tinry niyo to, di lang worth 30k kuya mo but more.", "created_utc": "1661039243.0", "edited": "False", "id": "il4of7t", "is_submitter": "False", "link_id": "t3_wsyjo0", "parent_id": "t3_wsyjo0", "score": "3", "subreddit": "PinoyProgrammer", "subreddit_id": "t5_33gof"}, {"author": "duyihuan", "body": "That is something straight of a film called Limitless.\n\nWell if you can see yourself as a very fast learner, a fast reader, has the wits, and someone who has willingness then you could either try out becoming a developer or becoming an online marketer that is commission base. There are lots of guides online on how to pull this off. Lastly start posting your services.\n\nI wouldn't recommend becoming a graphics designer because it takes time to become one and you have to very brilliant in coming up designs unlike coding, you have to think logically.", "created_utc": "1661038163.0", "edited": "False", "id": "il4m5gs", "is_submitter": "False", "link_id": "t3_wtk9gn", "parent_id": "t3_wtk9gn", "score": "1", "subreddit": "thesidehustle", "subreddit_id": "t5_11hzjf"}, {"author": "duyihuan", "body": "Wow OP! This is so hardcore and I am very impressed. Well I can see your language levels here but If I may ask, how long have you been studying those 4 languages?", "created_utc": "1661037507.0", "edited": "False", "id": "il4kqdn", "is_submitter": "False", "link_id": "t3_wtid9h", "parent_id": "t3_wtid9h", "score": "6", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "duyihuan", "body": "Well I guess you are right but they are lighter and tend to have greater performance on older machines right? .NET libraries are just so fricking heavy, and also compilation of python into executable for windows imho is kinda crap. I haven't tried out with ELF files yet but with EXEs, execution is slower especially if you develop software with high io usage. Cut to the chase, I believe performance won't be an issue anymore to modern day computing as most users have machines that can process enough data which can make language performance almost all the same than the ones way back.", "created_utc": "1661018487.0", "edited": "False", "id": "il3dm8m", "is_submitter": "False", "link_id": "t3_wt99vi", "parent_id": "t1_il3aagg", "score": "1", "subreddit": "cpp", "subreddit_id": "t5_2qi27"}, {"author": "duyihuan", "body": "Indeed you are right! Those who also hate C++ will also try to point out the flaws such as \"null references\" which was the billion dollar mistake that is the cause of today's buffer overflow vulnerabilities.", "created_utc": "1661014045.0", "edited": "False", "id": "il334h5", "is_submitter": "False", "link_id": "t3_wt99vi", "parent_id": "t1_il32h4e", "score": "0", "subreddit": "cpp", "subreddit_id": "t5_2qi27"}, {"author": "duyihuan", "body": "In my case, I only seed those who have long term support or those with rolling releases. Anyway, good job in keeping up the open source community smooth here. I only hope OP that those you are seeding are servers here in the PH such as PREGINET or RISE. :)", "created_utc": "1661012350.0", "edited": "False", "id": "il2z2bt", "is_submitter": "False", "link_id": "t3_wt0zhf", "parent_id": "t3_wt0zhf", "score": "1", "subreddit": "InternetPH", "subreddit_id": "t5_wsr3a"}, {"author": "duyihuan", "body": "True unless you have \"savant syndrome\" which in terms make you remember everything without the need of maintaining and practicing what you have learned.", "created_utc": "1661010863.0", "edited": "False", "id": "il2vio7", "is_submitter": "False", "link_id": "t3_wt8bjv", "parent_id": "t1_il2kd0e", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "duyihuan", "body": "Well not just young but also those haters who only knows how to produce basic code in C++. I have lots of colleagues who keep bashing C++ because its so damn difficult to code and they just keep saying that you can do the same with C# or Python. Well both language has its limits. Python relies on a python needed to be installed even if you convert it to executable while C# relies heavily on DLLs and other .NET dependencies. If you read in-depth and find use to apply C++ in real world and not just data structures and algorithms like what you learn at the university or online tutorials, you won't be having problems with C++ and the language itself is very versatile to the point you can almost program anything with it.", "created_utc": "1661010177.0", "edited": "False", "id": "il2tvsv", "is_submitter": "False", "link_id": "t3_wt99vi", "parent_id": "t1_il2orip", "score": "4", "subreddit": "cpp", "subreddit_id": "t5_2qi27"}, {"author": "duyihuan", "body": "Based on my personal experience with friends and business partners who are rich AF, they only have one thing in common that they say to me whenever I get to have drinks with them which is to have a vast network in different business fields.\n\nI also have a friend who belongs to a rich Filipino Chinese family. And yes, it is true that at a very young age they are trained to become future businessmen who will take over their family business. They are even forced to go to cram school or have their parents hire private tutors to do better in their studies. Not being a bias but another thing I've learned from them is that the first son would always be the one who inherits the family business. I don't know in other Filipino Chinese family how this works.", "created_utc": "1661001326.0", "edited": "False", "id": "il2afdp", "is_submitter": "False", "link_id": "t3_wt4ay7", "parent_id": "t3_wt4ay7", "score": "20", "subreddit": "phinvest", "subreddit_id": "t5_32eoz"}, {"author": "duyihuan", "body": "We have the same principles so kudos to you. I only spend most of my money on necessary stuff like food and bills. It's just sad that sometimes my wife even drags me to buy new clothes since I wear the same clothes for years.", "created_utc": "1661000694.0", "edited": "False", "id": "il296cd", "is_submitter": "False", "link_id": "t3_wsq5kv", "parent_id": "t1_ikzv8br", "score": "5", "subreddit": "realestateinvesting", "subreddit_id": "t5_2qnt1"}, {"author": "duyihuan", "body": "Best choice na nakikita ko if I were in your shoes is that gumawa ng solid na schedule at magsacrifice ng mga hobbies and interests if gusto mo talaga pagsabayin both. Ang dami kong kilala na ginawa to and are currently successful in life right now. It's just a matter of tiwala sa sarili and pagstick sa schedule strictly.", "created_utc": "1660999918.0", "edited": "False", "id": "il27ohk", "is_submitter": "False", "link_id": "t3_wsppt4", "parent_id": "t3_wsppt4", "score": "2", "subreddit": "phinvest", "subreddit_id": "t5_32eoz"}]