[{"author": "Dysphoriented", "body": "There will be spoilers, so you have been warned.  \n\n\nSo, interesting story about this game. I bought it at launch because I love everything Shinji Mikami touches, RE, Vanquish, Dino Crisis etc. But I just could not get into this game. The first few chapters were \\*horrible\\* to play. The difficulty curve was so ridiculously unfair, even on normal mode.  Introductory bit is cool, uncanny almost, really interesting and grabs you, but I will always remember the game putting me in the middle of nowhere, telling me I have 6 bullets and three matches. It continues to explain that you can kill people faster with headshots but you still need 3-4 shots to kill one enemy even at the best of times and you only have three matches so how are you going to possibly get through the whole village in front of you?   \n\n\nI walk towards the house and I get stuck in a bear trap, damaged immediately and alerted enemies, which feel like they are at least 30-40 (again, I only have three bullets left because I had to kill the first turned police officer), I get killed and start over. This time im smarter, I thought. I would look out for the bear traps but miss the tripwire mines so they blew up and got half of my health and the entire village was again alerted to my presence. Die, start over, im a bit frustrated. I eventually beat the first bit, where I have to keep going through the woods until I get to a valve I have to turn, while all the enemies hear me and I somehow have to get rid of them before I continue.   \n\n\nI die, die, die and die, it is so difficult and frustrating that I quit. I try to replay it at least four more times as the months pass but the fifth time I get so angry that I physically throw away the disc, because it is such complete unfair nonsense, I feel like I never had a chance. Months pass, a year or two and I see the case again, almost like it is mocking me. I decide that I genuinely love Mikamis work enough to give it one more chance, a final chance, just one more time.  \nAfter all, I really want to like the game.   \n\n\nAll the previous attempt had one thing in common, I never made it past the third chapter, so I promised myself, I would get past the third chapter and see what comes after the part where there is a chainsaw enemy stuck inside a barn. I try very hard and eventually I get to a point where im being chased with little to no health. I climb up a ladder thinking that they shouldnt be able to follow me up there, alas, they can climb ladders, too. I get so annoyed that at this point I decide to show my friend through PS4 crossplay or whatever that feature was called, because it cant just be me, there has to be an element of unfairness.   \n\n\nEventually I get past the third chapter and I thought, wow, that was extremely difficult, what is even on the other side of this chapter? And thats when it happened. I realised the game wasnt unfair bullshit, it was just teaching me to never expect to be safe, at any moment I could be harmed, I am not strong like in games with the hero archetype, I am weak, the every day man. The way this realisation came upon me was very Dark Souls-esque. I finally got it.   \n\n\nThe more I played, the more I loved the game, the way it constantly starts to mess with you, the way you are never ever safe, the way Ruvik haunts you no matter where you go. The game was attempting to make me feel helpless.  \n\n\nMy favorite enemy in probably all of video gaming is The Keeper, the bit where you keep running away from him only to finally shut the door behind you, a large metal vault like door, thinking \"finally, im away from him\" and having it subverted immediately with him snapping his own neck to respawn inside the room that you are in? Abslotely marvelous, I genuinely felt afraid of him.   \n\n\nThe actual story is scattered through newspapers and collectibles, sometimes cutscenes, so you understand the motives behind all the people, the DLC adds something that actually matters for once (except the keeper dlc lol) and overall I believe this game is at least on par with the original Resident Evil in terms of quality horror. It really bothered me that Mikami did not direct the sequel because it was clearly lacking his touch. I played it but I felt like it sold out its soul to make it open world, just like everything else at the time. I much prefer the claustrophobic \"you are never safe, not even for a second\" tight scope of the original.", "created_utc": "1666899888.0", "edited": "False", "id": "iu13qxq", "is_submitter": "False", "link_id": "t3_yen69n", "parent_id": "t3_yen69n", "score": "3", "subreddit": "patientgamers", "subreddit_id": "t5_2t3ad"}, {"author": "Dysphoriented", "body": "Personally I think it is the most insulting entry by far. Wind Waker was a masterpiece, this one just felt hollow, soulless and like they were phoning it in. Even Link Between Worlds on 3DS was a masterpiece in comparison to BotW, which, to me, was nothing new or unique.   \nI am so sick of open worlds, please stop it.", "created_utc": "1666888067.0", "edited": "False", "id": "iu098ch", "is_submitter": "False", "link_id": "t3_yeu2jt", "parent_id": "t3_yeu2jt", "score": "0", "subreddit": "gaming", "subreddit_id": "t5_2qh03"}, {"author": "Dysphoriented", "body": "Si, claro.", "created_utc": "1666728389.0", "edited": "False", "id": "itrm9jw", "is_submitter": "False", "link_id": "t3_ydc0mk", "parent_id": "t1_itrm6ey", "score": "1", "subreddit": "Argaming", "subreddit_id": "t5_2v8c6"}, {"author": "Dysphoriented", "body": "No puedo comprar nada en argentina con mi tarjeta y lo unico que dice steam es que por cambios en leyes en argentina ya no aceptan moneda local, alguien sabe como solucionar esto?  El apoyo ha sido peor que inútil", "created_utc": "1666725610.0", "edited": "False", "id": "itrext1", "is_submitter": "False", "link_id": "t3_ydc0mk", "parent_id": "t3_ydc0mk", "score": "2", "subreddit": "Argaming", "subreddit_id": "t5_2v8c6"}, {"author": "Dysphoriented", "body": "The idea it is too difficult to have people work from home.", "created_utc": "1666716737.0", "edited": "False", "id": "itqrss6", "is_submitter": "False", "link_id": "t3_ycgilw", "parent_id": "t3_ycgilw", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "Dysphoriented", "body": "It depends on how good you are at each respective language but since I was B2 in spanish at the time, my advice is based on a B2 understanding of Spanish and no prior understanding of French beyond common phrases. My experience wont be unviersal of course, but it is how I managed.  \n\n\nThe best thing to do is to focus a bit more time to the new language than the one you know substantially well already. It can be in the form of grammar, listening and reading in French while speaking spanish with friends or watching a show completely in spanish, then complementing with some textbook assignments in spanish. The most important thing is to maintain them and even passive learning such as watching a show complemented with some grammar is better than not speaking it at all. Though of course it is better if you have a set schedule like I had in school, where you do 2 hours of Spanish and 1 hour of french every day but everyone may not have the time slot necessary for that type of learning.", "created_utc": "1666621419.0", "edited": "False", "id": "itlbq2y", "is_submitter": "False", "link_id": "t3_yc29xo", "parent_id": "t1_itl82wg", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Dysphoriented", "body": "Generally speaking it is absolutely possible to learn 2 at once, provided that you are good enough in one of them. I was taught Spanish and French simultaneously and it only worked because I was a B2 in Spanish already. In school, I was taught 4 at once, Swedish and English which I grew up with natively, Spanish and later French.  \n\n\nBecause I used Swedish every day when interacting with people in my home country and because I read English every day on forums, video games, tv shows etc, it was easy to add one more language to those in high school, then once in college, you are free to add one more language that you will continue to develop through university, too.", "created_utc": "1666618456.0", "edited": "False", "id": "itl53bi", "is_submitter": "False", "link_id": "t3_yc29xo", "parent_id": "t1_itktwev", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Dysphoriented", "body": "It just sexualises children and promotes misogyny in the form of the social construct of beauty in society, hooray, much better.", "created_utc": "1666475403.0", "edited": "False", "id": "itdt987", "is_submitter": "False", "link_id": "t3_yaqtz9", "parent_id": "t3_yaqtz9", "score": "1", "subreddit": "NoFap", "subreddit_id": "t5_2skrn"}, {"author": "Dysphoriented", "body": "Generally I would have given the developers more time and treated them with the respect that they deserved.", "created_utc": "1666466630.0", "edited": "False", "id": "itd8ge9", "is_submitter": "False", "link_id": "t3_yatg53", "parent_id": "t3_yatg53", "score": "2", "subreddit": "castlevania", "subreddit_id": "t5_2ss33"}, {"author": "Dysphoriented", "body": "Dust an elysian Tail.", "created_utc": "1666452190.0", "edited": "False", "id": "itc9rl4", "is_submitter": "False", "link_id": "t3_yaavfj", "parent_id": "t3_yaavfj", "score": "1", "subreddit": "metroidvania", "subreddit_id": "t5_2tvxq"}, {"author": "Dysphoriented", "body": "Every year we see stories like this and it's just the regular CIA psyop attempt, it's like dealing with taxes, once a year.", "created_utc": "1666452155.0", "edited": "False", "id": "itc9olh", "is_submitter": "False", "link_id": "t3_yakzty", "parent_id": "t3_yakzty", "score": "38", "subreddit": "communism101", "subreddit_id": "t5_2uc81"}, {"author": "Dysphoriented", "body": "I grew up in a bilingual home so I'm not sure if I'm allowed to say English is a native language of mine or not but I was taught English at the same time as I was taught Swedish, from the very beginning. In school I was told to pick a third language and I picked Spanish, in college and through university I picked french, then when I moved to South America I started learning Portuguese. I am turning 30 in the beginning of next year. I would like to learn Catalan and Galician as well but the basic jist is that I was lucky enough to get excellent education.", "created_utc": "1666451834.0", "edited": "False", "id": "itc8xj3", "is_submitter": "False", "link_id": "t3_y9siuy", "parent_id": "t1_itb8hm3", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Dysphoriented", "body": "I said in the responses to OP", "created_utc": "1666390384.0", "edited": "False", "id": "it9f0vn", "is_submitter": "False", "link_id": "t3_y9v3h9", "parent_id": "t1_it9e8vw", "score": "1", "subreddit": "AmItheAsshole", "subreddit_id": "t5_2xhvq"}, {"author": "Dysphoriented", "body": "The original comment did that.", "created_utc": "1666368903.0", "edited": "False", "id": "it7yds1", "is_submitter": "False", "link_id": "t3_y9v3h9", "parent_id": "t1_it7x3lj", "score": "-13", "subreddit": "AmItheAsshole", "subreddit_id": "t5_2xhvq"}, {"author": "Dysphoriented", "body": "Throwing your children to the wolves in this economy is not exactly being a good person either so pick your poison, liberal.", "created_utc": "1666367946.0", "edited": "False", "id": "it7vzd8", "is_submitter": "False", "link_id": "t3_y9v3h9", "parent_id": "t1_it7vqjl", "score": "-14", "subreddit": "AmItheAsshole", "subreddit_id": "t5_2xhvq"}, {"author": "Dysphoriented", "body": "Your cynical comment doesnt matter because yes, it is open for some homeless people that may need it. Furthermore, comparing your \\*own children\\* to the way you clearly resent the homeless says more about you than it does about me. Good day to you.", "created_utc": "1666367745.0", "edited": "False", "id": "it7vh6s", "is_submitter": "False", "link_id": "t3_y9v3h9", "parent_id": "t1_it7ulh1", "score": "6", "subreddit": "AmItheAsshole", "subreddit_id": "t5_2xhvq"}, {"author": "Dysphoriented", "body": "So much liberal brain rot in the responses. Decades of US indoctrination has made it okay to throw your kid, your own child to the wolves if they don't bow down to the whims of the neoliberal market. Gone is any empathy and compassion. Truth is we are in the middle of a global recession the likes of which has not been seen or experienced by our elders, raging unemployment, devaluation of money, health care is crumbling and forget about finding an apartment to live in, there are simply not enough to go around and those that do exist are way too expensive for a just turned adult to afford. You all need a compassion and reality check. Simply wanting something hard enough isn't going to magically make it materialise.", "created_utc": "1666367217.0", "edited": "False", "id": "it7u4oj", "is_submitter": "False", "link_id": "t3_y9v3h9", "parent_id": "t3_y9v3h9", "score": "-10", "subreddit": "AmItheAsshole", "subreddit_id": "t5_2xhvq"}, {"author": "Dysphoriented", "body": "Interpals is a site for people who want to do language exchanges.", "created_utc": "1666361488.0", "edited": "False", "id": "it7g0lo", "is_submitter": "False", "link_id": "t3_y9mxx0", "parent_id": "t3_y9mxx0", "score": "2", "subreddit": "learnfrench", "subreddit_id": "t5_2sucz"}, {"author": "Dysphoriented", "body": "This is how I was taught English in School, from Swedish as a base, textbooks in swedish etc. It is also very helpful.", "created_utc": "1666360778.0", "edited": "False", "id": "it7ecny", "is_submitter": "False", "link_id": "t3_y9siuy", "parent_id": "t1_it7e8ra", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Dysphoriented", "body": "If you know spanish I can name more than fifty, in english? Open Veins of Latin America.", "created_utc": "1666359212.0", "edited": "False", "id": "it7auog", "is_submitter": "False", "link_id": "t3_y9j51r", "parent_id": "t3_y9j51r", "score": "1", "subreddit": "communism101", "subreddit_id": "t5_2uc81"}, {"author": "Dysphoriented", "body": "Pick the one that you are the most interested in the culture and media of. Then it is important to remember to study both French and the new one daily so you do not forget them. Many people make the mistake of getting to B2 in language 1 and then solely focus on language 2, which makes it so they end up losing a lot of language 1.", "created_utc": "1666357328.0", "edited": "False", "id": "it76w0h", "is_submitter": "False", "link_id": "t3_y9siuy", "parent_id": "t3_y9siuy", "score": "85", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Dysphoriented", "body": "Eberhard har ingen aning om SDs historia, helt uppenbart. Vilken clown.", "created_utc": "1666355147.0", "edited": "False", "id": "it72nlb", "is_submitter": "False", "link_id": "t3_y9kuv8", "parent_id": "t3_y9kuv8", "score": "-1", "subreddit": "svenskpolitik", "subreddit_id": "t5_2twun"}, {"author": "Dysphoriented", "body": "The only example I can think of is 70s Chile under Pinochet but thats way later.", "created_utc": "1666355059.0", "edited": "False", "id": "it72hoq", "is_submitter": "False", "link_id": "t3_y9a1xu", "parent_id": "t3_y9a1xu", "score": "1", "subreddit": "DebateCommunism", "subreddit_id": "t5_2vkao"}, {"author": "Dysphoriented", "body": "Rich people aren't inherently bad, they are just part of an exploitative system and profit off of that system. The problem is capitalism, they are just a symptom of that.", "created_utc": "1666352612.0", "edited": "False", "id": "it6y7un", "is_submitter": "False", "link_id": "t3_y9ncsc", "parent_id": "t3_y9ncsc", "score": "3", "subreddit": "DebateCommunism", "subreddit_id": "t5_2vkao"}, {"author": "Dysphoriented", "body": "It's all a Ponzi scheme, abolish money.", "created_utc": "1666352463.0", "edited": "False", "id": "it6xz8j", "is_submitter": "False", "link_id": "t3_y9mvqj", "parent_id": "t3_y9mvqj", "score": "25", "subreddit": "Anarchy101", "subreddit_id": "t5_2s960"}, {"author": "Dysphoriented", "body": "Way to move the goalposts, lol", "created_utc": "1666283864.0", "edited": "False", "id": "it37tsj", "is_submitter": "False", "link_id": "t3_y8egyo", "parent_id": "t1_it37265", "score": "1", "subreddit": "PS5", "subreddit_id": "t5_2s887"}, {"author": "Dysphoriented", "body": "I bought the Halloween bundle because if you put in the \"gold edition\" of RE7 and the halloween bundle, it will not let you skip adding RE7 from your basket, it will force you to buy two copies (one to give away) rather than let you get the season pass at a discount. After you have bought that, the season pass is able to be added separately for cheaper. The Halloween Bundle includes 2, 3, Resistance, RE7 and Village (no DLC for any of them, though, only Resistance for RE3), \\*and\\* re:verse (which isnt even out yet). I also added Biohazard Collection which has RE 4-6, Revelations and Revelations 2 (though it does not give you all the DLC for 6 for some reason), I also got Resident Evil Deluxe Origins Bundle which includes all DLC for 0. Then lastly, I added Umbrella Corps Deluxe Edition.\n\nSo what I bought was:  \nHalloween Bundle: RE2, RE3, RE Resistance (Included in RE3), RE7, RE8, RE:Verse (Though all without DLC)  \nBiohazard Collectors Bundle: RE4, RE5 and DLC, RE6 (No DLC), RE Revelations and DLC, RE Revelations 2 and DLC.  \nResident Evil Deluxe Origins Bundle: RE1 and RE0 with DLC.  \nUmbrella Corps Deluxe Edition (Which includes DLC)  \nRE7 Season Pass (Though through adding the RE7 Gold Edition after buying all the other items in this list separately so it was forced to subtract RE7 base game)\n\nThe only things you are missing if you buy it this way (which I calculated is the cheapest where I live) are the Costume DLC for RE2 and RE3 and the DLCs for RE6. (Which you can buy separately)\n\nI hope this makes sense. If not, ask and I will try to streamline the answer.", "created_utc": "1666283276.0", "edited": "1666283567.0", "id": "it36awr", "is_submitter": "False", "link_id": "t3_y8zhfc", "parent_id": "t3_y8zhfc", "score": "9", "subreddit": "Steam", "subreddit_id": "t5_2qwis"}, {"author": "Dysphoriented", "body": "So much liberal brain rot in this thread, holy shit. \nGet some damn compassion people.", "created_utc": "1666280867.0", "edited": "False", "id": "it301m3", "is_submitter": "False", "link_id": "t3_y8m77x", "parent_id": "t3_y8m77x", "score": "-2", "subreddit": "relationship_advice", "subreddit_id": "t5_2r0cn"}, {"author": "Dysphoriented", "body": "Then I doubt you understand marketing.  Konami did mobile games and pachinkos for ages because that is where they believed the profit was. They did castlevania ports and saw that worked (originally we were only supposed to get the NES ones),and demand proved that it was a worthwhile choice to port the others, too, now they are trying to remake a classic series and even reinvigorate interest in that IP (They are even making a remaster of Suikoden I and II, something I thought I would never see), if their IPs start selling well, it is absolutely obvious they will start bringing back more well known IPs, such as Metal Gear Solid. There is not a single fan of the original MGS games that wouldnt \\*love\\* a MGS3 remaster, that shit would sell and sell and sell. And it makes more sense to try something safe like a remaster rather than a new entry. As I see it, the only reason they would not make it is if they \\*hate\\* Kojima more than they love money.", "created_utc": "1666277923.0", "edited": "1666278205.0", "id": "it2skeq", "is_submitter": "False", "link_id": "t3_y8egyo", "parent_id": "t1_it2om6f", "score": "1", "subreddit": "PS5", "subreddit_id": "t5_2s887"}, {"author": "Dysphoriented", "body": "The foreign language institute estimates it will take 500-550 hours for a native speaker of English. However, I believe this to be false, simply because peoples overall experiences will vary so wildly that it is almost useless as a measurement.   \n\n\nTo answer your question, though, it depends on your exposure, your interest, how much time you dedicate etc etc. The best way to learn is to make a friend or maybe even a love in the target language as it motivates you to learn and to keep up with learning. Not only that but it means you have a free resource that is willing to help you, too. (Though keep in mind that you should not use them as a teacher all the time, obviously)  \n\n\nIf you dont have this, an interest in the culture of the target language in terms of media (books, movies etc) is very very helpful, too.   \n\n\nMany people will tell you that \"oh, learning a language for work is something many people have done and it has worked out fine\" which is true, but with the reasons I stated it will be much much more enjoyable to learn. I am trying out a method for learning a language right now that supposes you spend 1000 hours immersed in a language, i.e, writing, reading, speaking and listening, constantly, that will make you fluent in a year and a half. I will probably update this sub with the results but it is important to know that learning a language is a lifelong experience, it will never stop. Language is fluid and changes throughout time, I am encountering words and phrases in my native language that I cannot understand as I have never heard it before these days and that is okay. It isnt a competition, it is meant to be enjoyable, give yourself time. You will get there.", "created_utc": "1666274809.0", "edited": "False", "id": "it2kx0t", "is_submitter": "False", "link_id": "t3_y8x0aa", "parent_id": "t3_y8x0aa", "score": "3", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "Dysphoriented", "body": "If this and the new Silent Hill sells well im hoping to god that they will finally remaster Metal Gear Soild 3.", "created_utc": "1666264750.0", "edited": "False", "id": "it20t27", "is_submitter": "False", "link_id": "t3_y8egyo", "parent_id": "t3_y8egyo", "score": "1", "subreddit": "PS5", "subreddit_id": "t5_2s887"}, {"author": "Dysphoriented", "body": "Strangers of Swords City was alright", "created_utc": "1666261227.0", "edited": "False", "id": "it1vxpl", "is_submitter": "False", "link_id": "t3_y8p1pd", "parent_id": "t3_y8p1pd", "score": "1", "subreddit": "JRPG", "subreddit_id": "t5_2quw1"}, {"author": "Dysphoriented", "body": "Scala Hotel was fantastic when I stayed last time.", "created_utc": "1666194799.0", "edited": "False", "id": "isy7cb1", "is_submitter": "False", "link_id": "t3_y85sci", "parent_id": "t3_y85sci", "score": "1", "subreddit": "BuenosAires", "subreddit_id": "t5_2r2vr"}, {"author": "Dysphoriented", "body": "Bara för något är enkelt för en person så betyder det inte att det är lika enkelt för alla andra också. Människor är olika och orkar olika mycket, så är det bara. Det är bara det att den nyliberala kapitalistiska marknaden försöker tvinga folk att vara exakt likadana, arbeta lika mycket, bete sig likadant, sova lika mycket. Allt måste vara universalt lika för alla och alla måste vara likadana i prestation. Det är därför det är så kul att en kritik mot kommunismen är att alla vore tvingade att vara exakt likadana. Förövrigt så existerar sådana här Nyheter enbart för att få folk att tänka att om någon handikappad person (för de är ju inte som vi andra) klarar av det, då har fan ingen annan rätt att gnälla heller. Ren propaganda och detta är enda gången vi handikappade är värda något för systemet vi lever under, när vi används som vapen emot de som inte är handikappade. Vidrigt.", "created_utc": "1666193543.0", "edited": "False", "id": "isy467w", "is_submitter": "False", "link_id": "t3_y81p52", "parent_id": "t3_y81p52", "score": "13", "subreddit": "sweden", "subreddit_id": "t5_2qofe"}, {"author": "Dysphoriented", "body": "The best language to learn is the one where you are interested in the culture, media and people of the language, thats how you can maintain interest the easiest.", "created_utc": "1666186220.0", "edited": "False", "id": "isxmxqx", "is_submitter": "False", "link_id": "t3_y7rw5u", "parent_id": "t3_y7rw5u", "score": "5", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Dysphoriented", "body": "Because I believe we have been sold a lie for centuries about how work is supposed to be fulfilling and I would like to find out for myself what I would enjoy doing.   \nThe ideal scenario would be to \"work\" 4 days a week though, then do whatever I want the other three.", "created_utc": "1666133888.0", "edited": "False", "id": "isv73ys", "is_submitter": "False", "link_id": "t3_y78n7x", "parent_id": "t3_y78n7x", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "Dysphoriented", "body": "platser med bra infrastruktur har inga jobb. Generellt sett.", "created_utc": "1666125950.0", "edited": "False", "id": "isununu", "is_submitter": "False", "link_id": "t3_y7eqlo", "parent_id": "t1_isun51v", "score": "1", "subreddit": "sweden", "subreddit_id": "t5_2qofe"}, {"author": "Dysphoriented", "body": "11 år i kö till bostad, minst. Absolut ingen i den åldern har råd att köpa en bostad heller.", "created_utc": "1666122726.0", "edited": "False", "id": "isufben", "is_submitter": "False", "link_id": "t3_y7eqlo", "parent_id": "t1_isuea36", "score": "-5", "subreddit": "sweden", "subreddit_id": "t5_2qofe"}, {"author": "Dysphoriented", "body": "Honestly I am waiting for Saints Row to be put on Steam for less than five dollars before I make my mind up.", "created_utc": "1666121998.0", "edited": "False", "id": "isudejo", "is_submitter": "False", "link_id": "t3_y7eq71", "parent_id": "t3_y7eq71", "score": "1", "subreddit": "gaming", "subreddit_id": "t5_2qh03"}, {"author": "Dysphoriented", "body": "Detta vore ju absurt. Bor man i Stockholm finns det inte en chans att flytta ut vid 17 eller 18.   \nDe flesta bor ju kvar tills 25.", "created_utc": "1666121776.0", "edited": "False", "id": "isuctif", "is_submitter": "False", "link_id": "t3_y7eqlo", "parent_id": "t3_y7eqlo", "score": "3", "subreddit": "sweden", "subreddit_id": "t5_2qofe"}, {"author": "Dysphoriented", "body": "YSL L'homme använder jag. \nDock så är La Nuit bättre för hösten.", "created_utc": "1666112376.0", "edited": "False", "id": "istopkw", "is_submitter": "False", "link_id": "t3_y7b6s2", "parent_id": "t3_y7b6s2", "score": "3", "subreddit": "swedishproblems", "subreddit_id": "t5_2vyct"}, {"author": "Dysphoriented", "body": "The ME Trilogy alone is worth that, lol", "created_utc": "1666096861.0", "edited": "False", "id": "isso052", "is_submitter": "False", "link_id": "t3_y6uoor", "parent_id": "t3_y6uoor", "score": "0", "subreddit": "PS3", "subreddit_id": "t5_2qhhw"}, {"author": "Dysphoriented", "body": "Because by design it promotes monopolies.", "created_utc": "1666051406.0", "edited": "False", "id": "isqon6q", "is_submitter": "False", "link_id": "t3_y6mo59", "parent_id": "t3_y6mo59", "score": "2", "subreddit": "DebateCommunism", "subreddit_id": "t5_2vkao"}, {"author": "Dysphoriented", "body": "If you never speak it, never read it, never use it or engage with it in any way at all, I dont see why you couldnt.", "created_utc": "1666013986.0", "edited": "False", "id": "iso8bfs", "is_submitter": "False", "link_id": "t3_y66psf", "parent_id": "t3_y66psf", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Dysphoriented", "body": "Man kan börja med att behandla dem som människor och se till att verkligen avstigmatisera missbruk. Portugal och Nederländerna har bra tankar om det.", "created_utc": "1666012381.0", "edited": "False", "id": "iso4z0l", "is_submitter": "False", "link_id": "t3_y5jo0q", "parent_id": "t3_y5jo0q", "score": "1", "subreddit": "sweden", "subreddit_id": "t5_2qofe"}, {"author": "Dysphoriented", "body": "I figured OP just wanted an answer, not really any sources. \nWhenever I cite sources I get downvoted for being boring. \n(Though I have not tried here yet)", "created_utc": "1665985112.0", "edited": "False", "id": "isn4agg", "is_submitter": "False", "link_id": "t3_y5ofyk", "parent_id": "t1_ismypdp", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Dysphoriented", "body": "La pregunta fue hecha en inglés.", "created_utc": "1665958347.0", "edited": "False", "id": "islmn2j", "is_submitter": "False", "link_id": "t3_y5o9yb", "parent_id": "t1_islm0o1", "score": "-2", "subreddit": "BuenosAires", "subreddit_id": "t5_2r2vr"}, {"author": "Dysphoriented", "body": "I clarified I meant grammar. Jesus you are insufferable.", "created_utc": "1665950664.0", "edited": "False", "id": "isl3qyj", "is_submitter": "False", "link_id": "t3_y5ofyk", "parent_id": "t1_isl3ldw", "score": "31", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Dysphoriented", "body": "What don't you understand? Learning grammar and learning accents aren't the same, I am speaking about learning to speak the language in a grammatically correct way.", "created_utc": "1665950333.0", "edited": "False", "id": "isl2th6", "is_submitter": "False", "link_id": "t3_y5ofyk", "parent_id": "t1_isl2l4w", "score": "23", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Dysphoriented", "body": "Learning to speak, i e grammar etc is not the same as learning to emulate an accent. However, adults have learned to emulate accents, too, it's just harder.", "created_utc": "1665950193.0", "edited": "False", "id": "isl2fkf", "is_submitter": "False", "link_id": "t3_y5ofyk", "parent_id": "t1_isl225a", "score": "27", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Dysphoriented", "body": "Literally he did it, lol, all existing data shows his policies caused it. Joke all you want, it's still true.", "created_utc": "1665947940.0", "edited": "False", "id": "iskwdtu", "is_submitter": "False", "link_id": "t3_y5o9yb", "parent_id": "t1_iskw757", "score": "-11", "subreddit": "BuenosAires", "subreddit_id": "t5_2r2vr"}, {"author": "Dysphoriented", "body": "International relations and diplomacy.", "created_utc": "1665947447.0", "edited": "False", "id": "iskv2cy", "is_submitter": "False", "link_id": "t3_y565a6", "parent_id": "t3_y565a6", "score": "1", "subreddit": "Feminism", "subreddit_id": "t5_2qr7i"}, {"author": "Dysphoriented", "body": "It's more complicated than that. But for an easy answer, yes.", "created_utc": "1665947412.0", "edited": "False", "id": "iskuyva", "is_submitter": "False", "link_id": "t3_y5o9yb", "parent_id": "t1_iskum81", "score": "1", "subreddit": "BuenosAires", "subreddit_id": "t5_2r2vr"}, {"author": "Dysphoriented", "body": "No, prices only ever raise here.", "created_utc": "1665947369.0", "edited": "False", "id": "iskuuv4", "is_submitter": "False", "link_id": "t3_y5o9yb", "parent_id": "t1_iskuqaq", "score": "14", "subreddit": "BuenosAires", "subreddit_id": "t5_2r2vr"}, {"author": "Dysphoriented", "body": "Science has demonstrated that children and adults are on equal grounds when learning a language (different reasons though) and what is the most important in adulthood is to dedicate enough time.", "created_utc": "1665946262.0", "edited": "False", "id": "iskry13", "is_submitter": "False", "link_id": "t3_y5ofyk", "parent_id": "t3_y5ofyk", "score": "59", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Dysphoriented", "body": "A few months ago the dollar blue was worth 350 Pesos.", "created_utc": "1665946111.0", "edited": "False", "id": "iskrjuf", "is_submitter": "False", "link_id": "t3_y5o9yb", "parent_id": "t3_y5o9yb", "score": "-6", "subreddit": "BuenosAires", "subreddit_id": "t5_2r2vr"}, {"author": "Dysphoriented", "body": "Irrelevant because the dollar and the peso were close to equal in 2015, absolutely crazy what macris neoliberal policies did to this country. I swear even if Alberto wanted to set the country on fire on purpose, he would not come close to destroying the economy in the same way macri did. \nThat being said, just because this government is better than his, that doesn't make it good lol", "created_utc": "1665946054.0", "edited": "False", "id": "iskrepc", "is_submitter": "False", "link_id": "t3_y5o9yb", "parent_id": "t1_iskr0xm", "score": "-23", "subreddit": "BuenosAires", "subreddit_id": "t5_2r2vr"}, {"author": "Dysphoriented", "body": "You are correct. The blue dollar is worth 290 Pesos at time of writing. Macris government screwed up the Peso in 2015, lol", "created_utc": "1665945765.0", "edited": "False", "id": "iskqog9", "is_submitter": "False", "link_id": "t3_y5o9yb", "parent_id": "t3_y5o9yb", "score": "-23", "subreddit": "BuenosAires", "subreddit_id": "t5_2r2vr"}, {"author": "Dysphoriented", "body": "Highly illegal", "created_utc": "1665943520.0", "edited": "False", "id": "iskksge", "is_submitter": "False", "link_id": "t3_y5ki4v", "parent_id": "t3_y5ki4v", "score": "3", "subreddit": "origin", "subreddit_id": "t5_2rq8u"}, {"author": "Dysphoriented", "body": "The reason this happens is because Sweden has the most restrictive rape laws in all of Europe. You do anything remotely sexual to a woman who isn't consenting, that is rape. You can even be convicted for virtual rape in Sweden. Furthermore it also has to do with how the Swedish police logs rape cases. Imagine an example, a woman comes to the police and says \"my husband raped me every day for the past month\" you would think that is one rape case but no, it's logged as 30-31 separate cases of rape. This paired with the fact that there are intrinsical issues with comparing Crime stats in different countries because the legal definitions are so vastly different tells me you are either not reading the data correctly or trying to stoke up hate. \n\nSources: \n\nhttps://www.bbc.com/news/magazine-19592372\n\nhttps://www.reuters.com/article/us-sweden-crime-rape-law-trfn-idUSKBN23T2R3\n\nhttps://www.euronews.com/2017/11/30/swedish-man-sentenced-to-10-years-for-online-rape#:~:text=The%20verdict%20on%20Thursday%20(November,act%20that%20is%20equally%20violating \n\nStop spreading lies.", "created_utc": "1665942529.0", "edited": "False", "id": "iski3rg", "is_submitter": "False", "link_id": "t3_y5jody", "parent_id": "t3_y5jody", "score": "5", "subreddit": "portugueses", "subreddit_id": "t5_3df3b"}, {"author": "Dysphoriented", "body": "As far as I am concerned I would pay full price for any game Kojima was in the vicinity of. 5 dollars for the absolute masterpiece that is MGS4? Easily.", "created_utc": "1665939117.0", "edited": "False", "id": "isk93dl", "is_submitter": "False", "link_id": "t3_y5hxi2", "parent_id": "t3_y5hxi2", "score": "2", "subreddit": "metalgearsolid", "subreddit_id": "t5_2s4hr"}, {"author": "Dysphoriented", "body": "Queue the people asking how visually impaired people would want to play games", "created_utc": "1665928811.0", "edited": "False", "id": "isjk7on", "is_submitter": "False", "link_id": "t3_y5bc61", "parent_id": "t3_y5bc61", "score": "3", "subreddit": "PS5", "subreddit_id": "t5_2s887"}, {"author": "Dysphoriented", "body": "In other news, water is still wet.", "created_utc": "1665924249.0", "edited": "False", "id": "isjbexo", "is_submitter": "False", "link_id": "t3_y587uo", "parent_id": "t3_y587uo", "score": "3", "subreddit": "origin", "subreddit_id": "t5_2rq8u"}, {"author": "Dysphoriented", "body": "To me, a major part of achieving this is through deconstructing ideas where a doctor is worth intrinsically more as a person because of his job than say a plumber. The key to doing that is to make people understand that no matter what job you do it is just as important because someone has to do it for society to function.", "created_utc": "1665884052.0", "edited": "False", "id": "ishn3q3", "is_submitter": "False", "link_id": "t3_y4n5fc", "parent_id": "t3_y4n5fc", "score": "10", "subreddit": "communism101", "subreddit_id": "t5_2uc81"}, {"author": "Dysphoriented", "body": "So I got tired of your \"you can't, you can't\" without any explanation of what you can do and I looked up what is actually the case on the Brazilian Migrations website and according to them you can in fact go there on a tourist visa as a Portuguese citizen and ask for residency. It will take around 180 days but it is your right as a Portuguese citizen thanks to the agreement to get a temporary residence card that you then extend for a few times for a year in total and then, since you are a Portuguese citizen you are entitled to apply for citizenship in Brazil. I suggest that anyone else that wants info goes to the Brazilian Migrations website and read the law of the mutual agreement between Portugal and Brazil. Feel free to email the migration office and ask, too.", "created_utc": "1665867748.0", "edited": "False", "id": "isgnbov", "is_submitter": "False", "link_id": "t3_y4px7y", "parent_id": "t1_isgl1zk", "score": "1", "subreddit": "Brazil", "subreddit_id": "t5_2qmku"}, {"author": "Dysphoriented", "body": "If there's a law that says they have the same rights as citizens, why not? \nAnd if that's not the case, then how does it work?", "created_utc": "1665866783.0", "edited": "False", "id": "isgl1zk", "is_submitter": "False", "link_id": "t3_y4px7y", "parent_id": "t1_isgk62t", "score": "1", "subreddit": "Brazil", "subreddit_id": "t5_2qmku"}, {"author": "Dysphoriented", "body": "They could then simply get in there on a regular tourist visa and apply at migrations office.", "created_utc": "1665866204.0", "edited": "False", "id": "isgjor2", "is_submitter": "False", "link_id": "t3_y4px7y", "parent_id": "t1_isgj40i", "score": "1", "subreddit": "Brazil", "subreddit_id": "t5_2qmku"}, {"author": "Dysphoriented", "body": "\"Since Decree No. 70.391 in 1972, Portuguese citizens benefiting from equal citizenship status are eligible for regular Brazilian identity cards. They enjoy a reciprocal special regimen in recognition of Brazil and Portugal's special relationship. They bear the writing Nacionalidade Portuguesa - Decreto nº 70.391/72, meaning \"Portuguese nationality - Decree No. 70.391/72\".\"   \n\n\nIf you want specifics, I would look into the migration website for brazil.", "created_utc": "1665864691.0", "edited": "False", "id": "isgg53a", "is_submitter": "False", "link_id": "t3_y4px7y", "parent_id": "t1_isgea89", "score": "2", "subreddit": "Brazil", "subreddit_id": "t5_2qmku"}, {"author": "Dysphoriented", "body": "It states there is an easier process and that as a portuguese citizen, you can apply for a Brazilian DNI and vice versa, a DNI is what gives you the right to live, work and study etc. It may not be called DNI, but I live in argentina so it is the equivalent of that, basically an identity card.", "created_utc": "1665863589.0", "edited": "False", "id": "isgdlkb", "is_submitter": "False", "link_id": "t3_y4px7y", "parent_id": "t1_isgd0q5", "score": "1", "subreddit": "Brazil", "subreddit_id": "t5_2qmku"}, {"author": "Dysphoriented", "body": "This should be helpful   \n[https://en.wikipedia.org/wiki/Equality\\_Statute\\_between\\_Brazil\\_and\\_Portugal](https://en.wikipedia.org/wiki/Equality_Statute_between_Brazil_and_Portugal)", "created_utc": "1665847313.0", "edited": "False", "id": "isfbai1", "is_submitter": "False", "link_id": "t3_y4px7y", "parent_id": "t3_y4px7y", "score": "5", "subreddit": "Brazil", "subreddit_id": "t5_2qmku"}, {"author": "Dysphoriented", "body": "I said \"might\", didnt say I agreed.", "created_utc": "1665841719.0", "edited": "False", "id": "isez6yg", "is_submitter": "False", "link_id": "t3_y4ij3a", "parent_id": "t1_isew2jf", "score": "-3", "subreddit": "communism", "subreddit_id": "t5_2qolz"}, {"author": "Dysphoriented", "body": "This is a problem tied to your insecurity, not your friend being proficient in many languages. YTA.", "created_utc": "1665841417.0", "edited": "False", "id": "iseylb6", "is_submitter": "False", "link_id": "t3_y4ngcl", "parent_id": "t3_y4ngcl", "score": "36", "subreddit": "AmItheAsshole", "subreddit_id": "t5_2xhvq"}, {"author": "Dysphoriented", "body": "Anything by Ray Bradbury.", "created_utc": "1665841219.0", "edited": "False", "id": "isey70k", "is_submitter": "False", "link_id": "t3_y4j7zz", "parent_id": "t3_y4j7zz", "score": "2", "subreddit": "literature", "subreddit_id": "t5_2qhps"}, {"author": "Dysphoriented", "body": "I think it would be difficult for me to explain, so even though the post asks for \\*my own words\\* I will quote the author Ursula K. Le Guin.   \n\n\n“We have nothing but our freedom. We have nothing to give you but your own freedom. We have no law but the single principle of mutual aid between individuals. We have no government but the single principle of free association. We have no states, no nations, no presidents, no premiers, no chiefs, no generals, no bosses, no bankers, no landlords, no wages, no charity, no police, no soldiers, no wars. Nor do we have much else. We are sharers, not owners. We are not prosperous. None of us is rich. None of us is powerful. If it is Anarres you want, if it is the future you seek, then I tell you that you must come to it with empty hands. You must come to it alone, and naked, as the child comes into the world, into his future, without any past, without any property, wholly dependent on other people for his life. You cannot take what you have not given, and you must give yourself. You cannot buy the Revolution. You cannot make the Revolution. You can only be the Revolution. It is in your spirit, or it is nowhere.”", "created_utc": "1665841033.0", "edited": "False", "id": "isextr7", "is_submitter": "False", "link_id": "t3_y4fa7r", "parent_id": "t3_y4fa7r", "score": "3", "subreddit": "Anarchy101", "subreddit_id": "t5_2s960"}, {"author": "Dysphoriented", "body": "Or we could make sure life-saving medicines arent extremely expensive? They should be free.   \nAnything people need to live a dignified life should be free.  \nHave some heart, jesus.", "created_utc": "1665840893.0", "edited": "False", "id": "isexjud", "is_submitter": "False", "link_id": "t3_y49xra", "parent_id": "t3_y49xra", "score": "1", "subreddit": "politics", "subreddit_id": "t5_2cneq"}, {"author": "Dysphoriented", "body": "Open Veins of Latin America.", "created_utc": "1665840762.0", "edited": "False", "id": "isexaur", "is_submitter": "False", "link_id": "t3_y4900y", "parent_id": "t3_y4900y", "score": "-1", "subreddit": "LatinAmerica", "subreddit_id": "t5_2qioc"}, {"author": "Dysphoriented", "body": "Without the death of capitalism there will always be a power imbalance in surrogacy, as such, I generally do not like it.", "created_utc": "1665840715.0", "edited": "False", "id": "isex7q6", "is_submitter": "False", "link_id": "t3_y4e22a", "parent_id": "t3_y4e22a", "score": "3", "subreddit": "Feminism", "subreddit_id": "t5_2qr7i"}, {"author": "Dysphoriented", "body": "I think comparing Putin to Hitler is incorrect, but Mussolini might be a better comparison.", "created_utc": "1665840062.0", "edited": "False", "id": "isevyxl", "is_submitter": "False", "link_id": "t3_y4ij3a", "parent_id": "t3_y4ij3a", "score": "-2", "subreddit": "communism", "subreddit_id": "t5_2qolz"}, {"author": "Dysphoriented", "body": "Nevermind the Xbox, the real question is, why on this earth is Radiant Silvergun not on PC?", "created_utc": "1665789536.0", "edited": "False", "id": "iscpf91", "is_submitter": "False", "link_id": "t3_y3g06q", "parent_id": "t3_y3g06q", "score": "3", "subreddit": "shmups", "subreddit_id": "t5_2r4cd"}, {"author": "Dysphoriented", "body": "Folk fattar inte hur nazistiska SD alltid varit.", "created_utc": "1665767776.0", "edited": "False", "id": "isb8tdr", "is_submitter": "False", "link_id": "t3_y3wzg2", "parent_id": "t3_y3wzg2", "score": "5", "subreddit": "sweden", "subreddit_id": "t5_2qofe"}, {"author": "Dysphoriented", "body": "The best thing to do is to play Zestiria and then immediately after, you play Berseria.   \nIf you paid attention, you will be rewarded massively, I consider both of them as one full experience and one without the other is not as good. That being said, I recommend Berseria.", "created_utc": "1665759842.0", "edited": "False", "id": "isap5re", "is_submitter": "False", "link_id": "t3_y3jcpm", "parent_id": "t3_y3jcpm", "score": "1", "subreddit": "JRPG", "subreddit_id": "t5_2quw1"}, {"author": "Dysphoriented", "body": "Torchlight and Torchlight II, made by people who made Diablo.", "created_utc": "1665671335.0", "edited": "False", "id": "is5qd1t", "is_submitter": "False", "link_id": "t3_y2xx6a", "parent_id": "t3_y2xx6a", "score": "23", "subreddit": "rpg_gamers", "subreddit_id": "t5_2su0w"}, {"author": "Dysphoriented", "body": "Gaslighting and deceiving your partner \"to feel safe\" isnt okay and it never will be.   \nThe solution in cases like this should not be loyalty tests or even communication, it should be therapy. Then communication with your partner.", "created_utc": "1665595225.0", "edited": "False", "id": "is1mdim", "is_submitter": "False", "link_id": "t3_y23rj5", "parent_id": "t3_y23rj5", "score": "3", "subreddit": "relationship_advice", "subreddit_id": "t5_2r0cn"}, {"author": "Dysphoriented", "body": "Sometimes its not \"ever since I was a child\" but rather that you always knew there was something, something you couldnt quite put your finger on, but you felt it, then as an adult, you realise and it recontextualises those sentiments felt in childhood. The problem is simply that we have been robbed of language to understand our own experiences.   \n\n\nFurthermore, you could realise your are non binary or trans or any other identity on your deathbed and it would still be equally valid as someone who realised when they were five years old. You and only you dictate the limits of your own identity.", "created_utc": "1665595138.0", "edited": "False", "id": "is1m5kk", "is_submitter": "False", "link_id": "t3_y26mhd", "parent_id": "t3_y26mhd", "score": "14", "subreddit": "NonBinary", "subreddit_id": "t5_2vcez"}, {"author": "Dysphoriented", "body": "That to be morally consistent in their eugenics fueled ideas on animals (i.e we are smarter and therefore we deserve to live more than animals) the same would have to be true if a sentient much more intelligent alien race came to earth and wanted to eat us.", "created_utc": "1665594183.0", "edited": "False", "id": "is1jq84", "is_submitter": "False", "link_id": "t3_y246h9", "parent_id": "t3_y246h9", "score": "4", "subreddit": "vegan", "subreddit_id": "t5_2qhpm"}, {"author": "Dysphoriented", "body": "Anledningen till att kärnkraftverken las ner var för att de inte höll standarden för säkerhet, är så trött på högern som hela tiden säger att miljömuppar stängde alla utan att nämna den lilla detaljen.", "created_utc": "1665582193.0", "edited": "False", "id": "is0qcvw", "is_submitter": "False", "link_id": "t3_y21h3b", "parent_id": "t3_y21h3b", "score": "2", "subreddit": "svenskpolitik", "subreddit_id": "t5_2twun"}, {"author": "Dysphoriented", "body": "thats a lot of assumptions in one post lol", "created_utc": "1665408795.0", "edited": "False", "id": "irrc2g9", "is_submitter": "False", "link_id": "t3_y02v6i", "parent_id": "t3_y02v6i", "score": "1", "subreddit": "xbox", "subreddit_id": "t5_2qoih"}, {"author": "Dysphoriented", "body": "Basura", "created_utc": "1665370187.0", "edited": "False", "id": "irptl4k", "is_submitter": "False", "link_id": "t3_y00oss", "parent_id": "t3_y00oss", "score": "3", "subreddit": "Argaming", "subreddit_id": "t5_2v8c6"}, {"author": "Dysphoriented", "body": "It is a colloquial way of saying someone is very in love, whether or not they are standing isnt relevant to the expression.", "created_utc": "1665356076.0", "edited": "False", "id": "irp0fy7", "is_submitter": "False", "link_id": "t3_xzxb73", "parent_id": "t3_xzxb73", "score": "24", "subreddit": "ENGLISH", "subreddit_id": "t5_2qjni"}, {"author": "Dysphoriented", "body": "Calling people who rightfully complained about it not being playable on console, to the point where even sony was forced to remove the game from the store, \"pussies\" is sure to win people over. Excellent arguments, 10/10.   \n\n\nOn a more serious note, the game is good (I personally really like it) but its nowhere near the best RPG ever made, even looking at it objectively and without bias. But a lot of people had legitimate concerns and grievances and I think you are doing a disservice trying to minimize the issues.", "created_utc": "1665316296.0", "edited": "False", "id": "irmh8yy", "is_submitter": "False", "link_id": "t3_xz4sgv", "parent_id": "t3_xz4sgv", "score": "1", "subreddit": "cyberpunkgame", "subreddit_id": "t5_3az7x"}, {"author": "Dysphoriented", "body": "It has only ever been proven that violent games desensitises us to violence, however, sexualisation of women is different because it reinforces already existing attitudes and stereotypes in society that treat women as objects. Violence is already unacceptable but sexism and misogyny gets a pass in society, generally speaking. As such, violent games are not as much of a concern as the heavy-handed way that women are sexualised in video games.  \nI also would suggest to not use the term \"Degenerate\" as it is a nazi term that stems from the idea of impure race mixing.", "created_utc": "1665309108.0", "edited": "False", "id": "irm8a5x", "is_submitter": "False", "link_id": "t3_xz7883", "parent_id": "t3_xz7883", "score": "3", "subreddit": "truegaming", "subreddit_id": "t5_2sgq6"}, {"author": "Dysphoriented", "body": "Generally speaking, as long as I drink just a bit, I am fine, too much though and it amplifies the dissociation.", "created_utc": "1665245250.0", "edited": "False", "id": "irj00v2", "is_submitter": "False", "link_id": "t3_xywbq1", "parent_id": "t3_xywbq1", "score": "8", "subreddit": "dpdr", "subreddit_id": "t5_2sv5a"}, {"author": "Dysphoriented", "body": "Love of Lesbian is a great spanish band for this.", "created_utc": "1665243570.0", "edited": "False", "id": "iriwnyw", "is_submitter": "False", "link_id": "t3_xyvnch", "parent_id": "t3_xyvnch", "score": "3", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "Dysphoriented", "body": "Onödigt nedlåtande.", "created_utc": "1665230146.0", "edited": "False", "id": "iri9wt0", "is_submitter": "False", "link_id": "t3_xxtv4j", "parent_id": "t1_irhjvs3", "score": "1", "subreddit": "swedishproblems", "subreddit_id": "t5_2vyct"}, {"author": "Dysphoriented", "body": "Levde med detta i 20 års tid, försökte övertala min familj om att det faktiskt räknas som en form av psykisk misshandel att skrika någon vaken varje dag. Det slutade inte förrän jag flyttade till Sydamerika när jag var äldre där ingen kunde väcka mig och jag fick stiga upp i lugn och ro ensam.", "created_utc": "1665147446.0", "edited": "False", "id": "iree4ah", "is_submitter": "False", "link_id": "t3_xxtv4j", "parent_id": "t3_xxtv4j", "score": "12", "subreddit": "swedishproblems", "subreddit_id": "t5_2vyct"}, {"author": "Dysphoriented", "body": "One part of the problem is that capitalism (and patriarchy) is promising young white men the world and when they get nothing (due to failing in school, failing at a job etc) their hatred gets turned on any group of people they see fit. Incels, just like fascism, is a symptom of capitalism, and capitalism in decline especially. It creates the breeding ground for these people and these movements to claim they have all the solutions to peoples problems and when you have nothing, a group that unconditionally accepts you based on X immutable characteristic is extremely seductive when all you are looking for is meaning in life.", "created_utc": "1665145346.0", "edited": "False", "id": "ireag2u", "is_submitter": "False", "link_id": "t3_xxohek", "parent_id": "t3_xxohek", "score": "1", "subreddit": "TwoXChromosomes", "subreddit_id": "t5_2r2jt"}, {"author": "Dysphoriented", "body": "You're right, my bad", "created_utc": "1665086956.0", "edited": "False", "id": "irboi6d", "is_submitter": "False", "link_id": "t3_xx5eac", "parent_id": "t1_irbmjce", "score": "1", "subreddit": "metalgearsolid", "subreddit_id": "t5_2s4hr"}, {"author": "Dysphoriented", "body": "It looks like the in-game chronological order.", "created_utc": "1665078412.0", "edited": "False", "id": "irb3r8o", "is_submitter": "False", "link_id": "t3_xx5eac", "parent_id": "t1_iravjsa", "score": "0", "subreddit": "metalgearsolid", "subreddit_id": "t5_2s4hr"}, {"author": "Dysphoriented", "body": "Radiant Silvergun and its spiritual successor Ikaruga.   \nSome of the most innovative and creative shmups in the genre, no matter how old they are, I will always love coming back to them. Raiden series is a close second.", "created_utc": "1665070003.0", "edited": "False", "id": "irai3x5", "is_submitter": "False", "link_id": "t3_xx6cyh", "parent_id": "t3_xx6cyh", "score": "18", "subreddit": "shmups", "subreddit_id": "t5_2r4cd"}, {"author": "Dysphoriented", "body": "You arent the asshole here, your husband is. If he wants to feel included, he should make an effort to learn sign language. Sign language is the language of the deaf community, shaming your son for choosing to embrace this is one of the worst things he can do for him.For multiple generations, deaf people have been mistreated and targeted because of this perceived difference, there is no reason to allow your husband to act this bigoted and ableist about your son embracing his community. Your son deserves better than this.\n\nTLDR: Make an effort, husband, or stfu.", "created_utc": "1665069854.0", "edited": "False", "id": "irahqk0", "is_submitter": "False", "link_id": "t3_xwx2az", "parent_id": "t3_xwx2az", "score": "2", "subreddit": "AmItheAsshole", "subreddit_id": "t5_2xhvq"}, {"author": "Dysphoriented", "body": "Xenogears is the best RPG ever made. But Cyberpunk is pretty great.", "created_utc": "1665069613.0", "edited": "False", "id": "irah4nk", "is_submitter": "False", "link_id": "t3_xwzh8l", "parent_id": "t3_xwzh8l", "score": "1", "subreddit": "cyberpunkgame", "subreddit_id": "t5_3az7x"}, {"author": "Dysphoriented", "body": "Not a fan of how the thumbnail paints him as a fool, but I do agree misrepresenting languages and how easy/difficult it is to learn them is bad. This is why I despise the youtube polyglots that say 4 phrases in 17 languages and claim to be completely fluent, it gives people the wrong idea and good on you for calling that out and saying that it isnt as simple as he makes it out to be. Truth is always important. Personally speaking, any language will take at least 700 hours to learn to a near fluent level (and to become fluent fluent, several years, but you keep learning for your whole life), its a time investment and to minimize that time into \"learn how to speak korean at a C2 level in 3 months\" is just the modern version of a snakeoil salesman.   \n\n\nAnything you want to get good at takes skill, developing skill takes time. This is how it always works.", "created_utc": "1665064408.0", "edited": "False", "id": "ira4lbg", "is_submitter": "False", "link_id": "t3_xx28dh", "parent_id": "t3_xx28dh", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Dysphoriented", "body": "Hittade en liberal, nice.", "created_utc": "1665062849.0", "edited": "False", "id": "ira15hi", "is_submitter": "False", "link_id": "t3_xx3fcb", "parent_id": "t1_ir9zzw7", "score": "-24", "subreddit": "sweden", "subreddit_id": "t5_2qofe"}, {"author": "Dysphoriented", "body": "I speak swedish, which, considering the other ones, is a minority language in comparison.", "created_utc": "1665061378.0", "edited": "False", "id": "ir9y2j2", "is_submitter": "False", "link_id": "t3_xx1qfg", "parent_id": "t3_xx1qfg", "score": "-3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Dysphoriented", "body": "Neither did I, but I know some people struggle.", "created_utc": "1665061089.0", "edited": "False", "id": "ir9xhln", "is_submitter": "False", "link_id": "t3_xwx6vd", "parent_id": "t1_ir9w2cu", "score": "1", "subreddit": "JRPG", "subreddit_id": "t5_2quw1"}, {"author": "Dysphoriented", "body": "Dreaming Spanish, Duolingo and Anki, but none of these will work on their own, only as complements, you need a textbook and exposure as well. I suggest trying to make friends from the target language country, Interpals is good for this, people try to make friends and find language exchange partners, beware though as many people from Africa on the site are mostly scam bots.", "created_utc": "1665060281.0", "edited": "False", "id": "ir9vve2", "is_submitter": "False", "link_id": "t3_xx2u19", "parent_id": "t3_xx2u19", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Dysphoriented", "body": "Looks like it would be a blast to play! Any release date?", "created_utc": "1665059175.0", "edited": "False", "id": "ir9trks", "is_submitter": "False", "link_id": "t3_xx2m31", "parent_id": "t3_xx2m31", "score": "3", "subreddit": "IndieGaming", "subreddit_id": "t5_2r0e3"}, {"author": "Dysphoriented", "body": "Att tillochmed sverige hatar hemlösa så mycket. Fy.", "created_utc": "1665059076.0", "edited": "False", "id": "ir9tkyg", "is_submitter": "False", "link_id": "t3_xx3fcb", "parent_id": "t3_xx3fcb", "score": "41", "subreddit": "sweden", "subreddit_id": "t5_2qofe"}, {"author": "Dysphoriented", "body": "Voting will only ever amount to harm reduction, forming grassroots movements and trying to help the working class is what is the most important. I vote because I think it does \\*something\\* but I spend most of my time doing active helping on the ground.", "created_utc": "1665058960.0", "edited": "False", "id": "ir9td4u", "is_submitter": "False", "link_id": "t3_xwuljy", "parent_id": "t3_xwuljy", "score": "5", "subreddit": "communism101", "subreddit_id": "t5_2uc81"}, {"author": "Dysphoriented", "body": "They do not demand a return ticket anymore, I have been here since may this year and I did not have a return ticket, they didnt care. The way they do it now is they impose a fee for when you exit due to the amount of days you have overstayed. If you plan to stay for more than 3 months, I suggesst you go to migraciones and ask for your tourist visa to be extended, but do it fairly quickly as they tend to be a bit slow, otherwise you might be greeted with a deportation order.", "created_utc": "1665058766.0", "edited": "False", "id": "ir9t06v", "is_submitter": "False", "link_id": "t3_xwia2c", "parent_id": "t3_xwia2c", "score": "1", "subreddit": "BuenosAires", "subreddit_id": "t5_2r2vr"}, {"author": "Dysphoriented", "body": "This isnt true anymore. I went to Argentina in may of this year (I am still here), did not have a return ticket and they did not care. What they do is they will attach a fee onto you when you leave if you overstay.", "created_utc": "1665058648.0", "edited": "False", "id": "ir9sseh", "is_submitter": "False", "link_id": "t3_xwia2c", "parent_id": "t1_ir6p23n", "score": "2", "subreddit": "BuenosAires", "subreddit_id": "t5_2r2vr"}, {"author": "Dysphoriented", "body": "Theres no up down or back or forth in space, friend, it is all relative.", "created_utc": "1665058416.0", "edited": "False", "id": "ir9sdj7", "is_submitter": "False", "link_id": "t3_xwu1cr", "parent_id": "t3_xwu1cr", "score": "1", "subreddit": "starwarsmemes", "subreddit_id": "t5_2wzm6"}, {"author": "Dysphoriented", "body": "Xenogears and FF12 have hard to grasp plots if you arent used to thinking pretty deeply about philosophy.", "created_utc": "1665058267.0", "edited": "False", "id": "ir9s45a", "is_submitter": "False", "link_id": "t3_xwx6vd", "parent_id": "t3_xwx6vd", "score": "1", "subreddit": "JRPG", "subreddit_id": "t5_2quw1"}, {"author": "Dysphoriented", "body": "Sounds like a terf, which isnt a feminist but a fascist pretending to be a feminist.  \nIf it is a terf, no argument will make them change their mind but it may comfort you to know that the criteria of what makes a man a man and a woman a woman are socially constructed and there is no definition that wouldnt hurt women in some way or another. So the only logical conclusion has to be that your identity is up to you to decide, no one else.", "created_utc": "1665058050.0", "edited": "False", "id": "ir9rqks", "is_submitter": "False", "link_id": "t3_xwzjqb", "parent_id": "t3_xwzjqb", "score": "7", "subreddit": "trans", "subreddit_id": "t5_2shbb"}, {"author": "Dysphoriented", "body": "The reason communism has never been realised is because any time there has been an attempt, capitalist backed imperialism or fascism smashes it, which would be true of any ideology that falls victim to this and as such it is not a critique against communism, but rather a critique of what the liberal hegemony views as a \"weak\" state that the same liberal hegemony starved out to become weak. It is all nonsense, of course.  \nThey are just making up reasons to say it is bad and to not make themselves culpable when they are the very reason it hasnt succeeded.", "created_utc": "1665056680.0", "edited": "False", "id": "ir9pep1", "is_submitter": "False", "link_id": "t3_xx2647", "parent_id": "t3_xx2647", "score": "9", "subreddit": "communism", "subreddit_id": "t5_2qolz"}, {"author": "Dysphoriented", "body": "Vi befinner oss i kapitalismens slutskede, det kommer inte att bli bättre på ett bra tag.", "created_utc": "1665056090.0", "edited": "False", "id": "ir9ofpt", "is_submitter": "False", "link_id": "t3_xx0jem", "parent_id": "t3_xx0jem", "score": "6", "subreddit": "swedishproblems", "subreddit_id": "t5_2vyct"}, {"author": "Dysphoriented", "body": "Many men in this thread will argue it is because it will increase the risk of cheating, however, the real reason is misogyny and patriarchal culture trying to control women and what they do with their bodies and you see this in the double standard where men are studs if they have had a lot of partners, while women are branded as sluts. Downvote me to oblivion, I dont care, this is the truth.", "created_utc": "1665054474.0", "edited": "False", "id": "ir9lzas", "is_submitter": "False", "link_id": "t3_xx0bey", "parent_id": "t3_xx0bey", "score": "1", "subreddit": "relationship_advice", "subreddit_id": "t5_2r0cn"}, {"author": "Dysphoriented", "body": "Prioritise English because its necessary for your job, but for any future questions about methodology when studying two languages, the way to do it is to get a good footing in one first, then start the other. For example, if my target language is Spanish and I have studied it up to a B2 level, halfway to C1, I would start with a new language from the very beginning, but keep spending the same amount of time on the first target language, in this case spanish.\n\nIn school, I was taught Swedish up until second grade of elementary school, the assumption being that I knew enough swedish and had enough exposure due to living in Sweden that it wouldnt mess with the learning process of swedish to learn english alongside it. Once we had English and Swedish up until 6th grade, we got to pick a different language of French, German and Spanish, you continue taking all 3 until college, where you add a fourth if you so choose. So the way that this looked to me was:\n\n\\- Pre-School Swedish for two years (Pre-school until second grade of elementary school)  \n\\- Swedish and English for four years (Second grade until sixth grade of elementary school)  \n\\- Swedish, English and in my case German for four years (sixth grade of elementary school until College)  \n\\- Swedish, English, German and in my case French for three years (from beginning until end of college)\n\nThe way it was distributed was that at least once a day we would do one of the languages that were added to the schedule. at 8 on monday it would be swedish, at 2pm the same monday we would have english, on tuesday german and wednesday french etc etc. Repetition and universal practice is the key to successful learning. Motivational factors like a spouse or friend from the target language country also helps.\n\nIn university I continued taking French alongside my field of study for four years.To this end, you notice the gap inbetween adding new languages, you have to have built up a solid foundation in the original target language to be able to add another, also making sure that you dont mix them up in the case of learning multiple romance languages for example.\n\nHope this helps you or anyone else that has a question like this in the future.", "created_utc": "1664992366.0", "edited": "1664995862.0", "id": "ir6f2km", "is_submitter": "False", "link_id": "t3_xwcvgt", "parent_id": "t3_xwcvgt", "score": "10", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Dysphoriented", "body": "Buy books that are at your level (google is good for this) and then try to interpret meaning but dont overdo it, with time it will become easier.", "created_utc": "1664991455.0", "edited": "False", "id": "ir6cp2l", "is_submitter": "False", "link_id": "t3_xwaghh", "parent_id": "t3_xwaghh", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Dysphoriented", "body": "Sexhundra rasistiska skandaler under ett decennium kanske.", "created_utc": "1664991017.0", "edited": "False", "id": "ir6bjxw", "is_submitter": "False", "link_id": "t3_xwdtu0", "parent_id": "t3_xwdtu0", "score": "3", "subreddit": "swedishproblems", "subreddit_id": "t5_2vyct"}, {"author": "Dysphoriented", "body": "Inflación de mierda", "created_utc": "1664902036.0", "edited": "False", "id": "ir1bngu", "is_submitter": "False", "link_id": "t3_xvhhsc", "parent_id": "t3_xvhhsc", "score": "1", "subreddit": "Argaming", "subreddit_id": "t5_2v8c6"}, {"author": "Dysphoriented", "body": "Just like every other \"can I get to X level in y time?\"that graces this subreddit every so often, the\nAnswer is the same, it depends on you, your motivation, your study ethic, the amount of time you spend studying, talking, watching and reading the language. Complete immersion is often extremely helpful though. \n\nAlso for future questions from others, no you can't get to C2 in 3-6 months, there are probably people who have but that kind of level usually takes several years to master through constant exposure. Learning a language means that you will continue learning for the rest of your life, even at C2 level.\n\nThe best advice I have is to learn at your own pace and not to rush things. Trying to master languages in less then a year is mostly setting yourself up for failure and that risks putting you off altogether.", "created_utc": "1664849093.0", "edited": "1664849306.0", "id": "iqyrini", "is_submitter": "False", "link_id": "t3_xuz1ps", "parent_id": "t3_xuz1ps", "score": "6", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Dysphoriented", "body": "It likely wouldnt as nihilists have a tendency to fall into pro-eugenics camps.", "created_utc": "1664824322.0", "edited": "False", "id": "iqx5ko6", "is_submitter": "False", "link_id": "t3_xuipl7", "parent_id": "t3_xuipl7", "score": "1", "subreddit": "Anarchy101", "subreddit_id": "t5_2s960"}, {"author": "Dysphoriented", "body": "CDKeys seem legit.", "created_utc": "1664823106.0", "edited": "False", "id": "iqx2dp4", "is_submitter": "False", "link_id": "t3_xmwclc", "parent_id": "t3_xmwclc", "score": "1", "subreddit": "gog", "subreddit_id": "t5_2sj1u"}, {"author": "Dysphoriented", "body": "Genuinely horrifying as an outcome.", "created_utc": "1664817169.0", "edited": "False", "id": "iqwmqj6", "is_submitter": "False", "link_id": "t3_xuiv4z", "parent_id": "t3_xuiv4z", "score": "5", "subreddit": "Feminism", "subreddit_id": "t5_2qr7i"}, {"author": "Dysphoriented", "body": "OP mentioned Spanish so I didn't but absolutely.", "created_utc": "1664792168.0", "edited": "False", "id": "iqv6thz", "is_submitter": "False", "link_id": "t3_xtu4eo", "parent_id": "t1_iquk8en", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Dysphoriented", "body": "The platforming is better and more fluid, characters are more fun and interesting, larger weapon variety, the world is better etc, many reasons. But those are some of them.", "created_utc": "1664738104.0", "edited": "False", "id": "iqsdkif", "is_submitter": "False", "link_id": "t3_xtqj3f", "parent_id": "t1_iqsd4lt", "score": "2", "subreddit": "ps2", "subreddit_id": "t5_2r8uk"}, {"author": "Dysphoriented", "body": "Since you are not even reading what I actually say and just tell me what I think and make up things rather than responding to anything I said, we are done here, enjoy your block.", "created_utc": "1664736622.0", "edited": "False", "id": "iqs9ia2", "is_submitter": "False", "link_id": "t3_xtup3b", "parent_id": "t1_iqs913k", "score": "-2", "subreddit": "relationship_advice", "subreddit_id": "t5_2r0cn"}, {"author": "Dysphoriented", "body": "Men hold institutional power over women in society, they have the power to oppress and women dont, you are correct that cases of domestic abuse where men hurt women and women hurt them back makes a man hurting a woman different, since there is no institutional oppression inflicted upon men in the same manner.   \nThis however is actually irrelevant to this example, as the main problem is that he:   \n\n\n\\- Ignored the needs of both his child and his s/o to play games  \n\\- When confronted repeatedly with it, kept ignoring   \n\\- The s/o desperately tries to get his attention for what I can only assume is a loooong time  \n\\- s/o is met with the same apathy and negligent behavior  \n\\- As a last ditch effort she smashes his console, in pure desperation  \n\\- He finally awakens and his first impulse is to hurt her, still not a care in the world for the child or the s/o  \n\n\nThe fact you are willing to defend someone like this as having been harmed too, tells me all I need to know about you. Mutual abuse is a myth, stop swallowing every liberal lie you hear and start working on getting some compassion. If you keep defending him, you are only outing yourself as a misogynist, and frankly, I dont care what misogynists think.", "created_utc": "1664736309.0", "edited": "False", "id": "iqs8o0r", "is_submitter": "False", "link_id": "t3_xtup3b", "parent_id": "t1_iqs7mr6", "score": "-4", "subreddit": "relationship_advice", "subreddit_id": "t5_2r0cn"}, {"author": "Dysphoriented", "body": "Because the situation described here is clearly completely different to the one in your example? lmao, liberalism really is poison to the brain.", "created_utc": "1664735815.0", "edited": "False", "id": "iqs7d2w", "is_submitter": "False", "link_id": "t3_xtup3b", "parent_id": "t1_iqs6u43", "score": "-8", "subreddit": "relationship_advice", "subreddit_id": "t5_2r0cn"}, {"author": "Dysphoriented", "body": "As a fellow fan of Sly Cooper, I recommend Ratchet and Clank over Jak and Daxter.", "created_utc": "1664735719.0", "edited": "False", "id": "iqs73tm", "is_submitter": "False", "link_id": "t3_xtqj3f", "parent_id": "t3_xtqj3f", "score": "0", "subreddit": "ps2", "subreddit_id": "t5_2r8uk"}, {"author": "Dysphoriented", "body": "Como quieras, gringo.", "created_utc": "1664735409.0", "edited": "False", "id": "iqs69qr", "is_submitter": "False", "link_id": "t3_xtvggc", "parent_id": "t3_xtvggc", "score": "3", "subreddit": "Brazil", "subreddit_id": "t5_2qmku"}, {"author": "Dysphoriented", "body": "Only you know what is interesting to you, but if you want general suggestions.   \nKorean, Chinese, Japanese and Portuguese. French cinema is pretty great, too.", "created_utc": "1664735358.0", "edited": "False", "id": "iqs64vr", "is_submitter": "False", "link_id": "t3_xtu4eo", "parent_id": "t3_xtu4eo", "score": "4", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Dysphoriented", "body": "So much liberal brain rot in this thread. \n\"Property damages! Oh no his PS5\" \nNice self reports, the man ignored his own child's needs and even when begged to be helpful, kept ignoring the child for a video game system. Fair enough that it may be an addiction but as a father, when you choose to be a father, you have a responsibility to your child and the mother of your child. \nHer pushing him away in what is clear Self defense isn't abusive, smashing the console as a last desperate attempt to get the man she loved back isn't abusive either. You know what is though? Neglect, neglecting both the needs of the s/o and his own child. He clearly didn't care one bit about the child as he only reacted when he couldn't play games anymore. Stop defending abusers when they are clearly in the wrong and for the love of god male redditors, work on your misogyny problem. Getting some compassion is a good start. You should be ashamed of yourselves.", "created_utc": "1664734652.0", "edited": "False", "id": "iqs480a", "is_submitter": "False", "link_id": "t3_xtup3b", "parent_id": "t3_xtup3b", "score": "-5", "subreddit": "relationship_advice", "subreddit_id": "t5_2r0cn"}, {"author": "Dysphoriented", "body": "Literally begging for a release of Metal Gear Solid 1-4 on GOG or Steam.", "created_utc": "1664729509.0", "edited": "False", "id": "iqrqal1", "is_submitter": "False", "link_id": "t3_xtfycr", "parent_id": "t3_xtfycr", "score": "6", "subreddit": "gog", "subreddit_id": "t5_2sj1u"}, {"author": "Dysphoriented", "body": "Create a set schedule that you follow, the most efficient way is to practice in bursts of 1-2 hours a day, then supplement that with passive learning (if spanish is your target language, watching a show with spoken spanish maybe with english subtitles, listening to spanish music, try changing the language of one of your favorite games into spanish etc) and maybe ten minutes of duolingo/anki whenever you have to wait for something. Total immersion by, for example, having a vacation in the country that speaks the language while studying there is a good idea too, as you are then forced to engage with the language and its culture and people on a daily basis. For example, I wanted to learn spanish so I moved to Argentina. It isnt something everyone can do though obviously, so therefore a vacation might be better.  \n\n\nThe most important aspect though, as per my own experience, is that you have a genuine interest and that you enjoy the learning process, maybe create small goals for yourself \"I will know basic conversations\", \"I will be able to watch a movie and understand most of it\". It is also good if you try to make friends with people from the country of your target language, in order to incentivise learning through that, without these things, every single language will feel like a chore.", "created_utc": "1664720410.0", "edited": "False", "id": "iqr3ir4", "is_submitter": "False", "link_id": "t3_xtlmi8", "parent_id": "t3_xtlmi8", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Dysphoriented", "body": "Godawful level design.", "created_utc": "1664717385.0", "edited": "False", "id": "iqqwucq", "is_submitter": "False", "link_id": "t3_xtcuq8", "parent_id": "t3_xtcuq8", "score": "-1", "subreddit": "halo", "subreddit_id": "t5_2qixk"}, {"author": "Dysphoriented", "body": "The responses in this whole thread reek of misogyny", "created_utc": "1664715364.0", "edited": "False", "id": "iqqsx31", "is_submitter": "False", "link_id": "t3_xtm9z3", "parent_id": "t3_xtm9z3", "score": "-4", "subreddit": "relationship_advice", "subreddit_id": "t5_2r0cn"}, {"author": "Dysphoriented", "body": "För sex eller sju år sedan så blev jag misshandlad utanför centralstationen, de sparkade och slog mig så hårt att de bröt mitt ben, jag anmälde till polisen och tänkte att det är enkelt löst för det är inspelat på en videokamera som fanns ovanpå fasaden till byggnaden bredvid. Förundersökningen las ner iallafall.", "created_utc": "1664707600.0", "edited": "False", "id": "iqqh3o7", "is_submitter": "False", "link_id": "t3_xtjqz0", "parent_id": "t3_xtjqz0", "score": "93", "subreddit": "sweden", "subreddit_id": "t5_2qofe"}, {"author": "Dysphoriented", "body": "TIL", "created_utc": "1664661178.0", "edited": "False", "id": "iqobrmp", "is_submitter": "True", "link_id": "t3_xt6mkm", "parent_id": "t1_iqoabuf", "score": "12", "subreddit": "swedishproblems", "subreddit_id": "t5_2vyct"}, {"author": "Dysphoriented", "body": "This is irrelevant to whether or not you are trans. \nPeople have deeply personal reasons and that's enough for me. I don't need to understand to accept them, to me it is enough that they are happy being who they want to be.", "created_utc": "1664654003.0", "edited": "False", "id": "iqnvgee", "is_submitter": "False", "link_id": "t3_xsn2be", "parent_id": "t1_iqnpri6", "score": "3", "subreddit": "trans", "subreddit_id": "t5_2shbb"}, {"author": "Dysphoriented", "body": "Same about most of them but for PC, lol", "created_utc": "1664647153.0", "edited": "False", "id": "iqnfoji", "is_submitter": "False", "link_id": "t3_xsxrfc", "parent_id": "t3_xsxrfc", "score": "5", "subreddit": "PS5", "subreddit_id": "t5_2s887"}, {"author": "Dysphoriented", "body": "Peacewalker and crisis core.", "created_utc": "1664646556.0", "edited": "False", "id": "iqne8o7", "is_submitter": "False", "link_id": "t3_xsyft2", "parent_id": "t3_xsyft2", "score": "3", "subreddit": "PSP", "subreddit_id": "t5_2qjts"}, {"author": "Dysphoriented", "body": "I recommend David Harvey's companion to Capital, helped me majorly.", "created_utc": "1664645718.0", "edited": "False", "id": "iqnc7oh", "is_submitter": "False", "link_id": "t3_xstpdh", "parent_id": "t3_xstpdh", "score": "2", "subreddit": "communism101", "subreddit_id": "t5_2uc81"}, {"author": "Dysphoriented", "body": "Argentina doesn't tax you if you don't live there for the majority of the year. For example, like me, if you are a european Citizen that lives in Europe but has Argentine citizenship, you pay taxes in Europe and not Argentina.(even though I spend a lot of time in Argentina, they still don't tax me) Changing the way they tax people would require changing the constitution which is almost impossible. \nThere's a lot of misinformation when it comes to Argentina and south america in general and the general rule of thumb is that you should only really trust people who live here, which means Spanish sources. Gob.ar has explanations for everything you need. Don't listen to Yankees and gringos on Reddit that spent a vacation here, listen to the people who actually live here.", "created_utc": "1664645516.0", "edited": "False", "id": "iqnbpy6", "is_submitter": "False", "link_id": "t3_xsoua8", "parent_id": "t3_xsoua8", "score": "2", "subreddit": "BuenosAires", "subreddit_id": "t5_2r2vr"}, {"author": "Dysphoriented", "body": "I think it might happen eventually, when they added ODST, I said they would add Reach eventually too and I was laughed at because it was a \"stupid idea\". Nevertheless eventually they did. Having all the main games in one collection is a really good opportunity to keep the games alive. The real question I am asking is when will they put Halo Wars 2 on Steam? I enjoyed that game a lot, the blitz game mode in particular.", "created_utc": "1664637670.0", "edited": "False", "id": "iqmt8y3", "is_submitter": "False", "link_id": "t3_xsxda1", "parent_id": "t3_xsxda1", "score": "3", "subreddit": "halo", "subreddit_id": "t5_2qixk"}, {"author": "Dysphoriented", "body": "Axiom Verge as a modern interpretation and Dust: An Elysian Tail.", "created_utc": "1664634775.0", "edited": "False", "id": "iqmmoy1", "is_submitter": "False", "link_id": "t3_xsp8gv", "parent_id": "t3_xsp8gv", "score": "1", "subreddit": "metroidvania", "subreddit_id": "t5_2tvxq"}, {"author": "Dysphoriented", "body": "\"Woke\" is a strawman made up by the right, just like SJWs, so they arent real concepts. I dont know why you would ask this question in an anarchist subreddit.", "created_utc": "1664634347.0", "edited": "False", "id": "iqmlr6z", "is_submitter": "False", "link_id": "t3_xsvjwn", "parent_id": "t3_xsvjwn", "score": "3", "subreddit": "Anarchy101", "subreddit_id": "t5_2s960"}, {"author": "Dysphoriented", "body": "You dont need dysphoria to be trans, only terfs and truscum believe that.   \nYou set the boundaries for your own identity. No one else.", "created_utc": "1664627076.0", "edited": "False", "id": "iqm7iov", "is_submitter": "False", "link_id": "t3_xsn2be", "parent_id": "t3_xsn2be", "score": "8", "subreddit": "trans", "subreddit_id": "t5_2shbb"}, {"author": "Dysphoriented", "body": "Prepare to Drop.", "created_utc": "1664626453.0", "edited": "False", "id": "iqm6ha2", "is_submitter": "False", "link_id": "t3_xslmlo", "parent_id": "t3_xslmlo", "score": "1", "subreddit": "halo", "subreddit_id": "t5_2qixk"}, {"author": "Dysphoriented", "body": "Helt klart det mest ironiska jag sett.", "created_utc": "1664626209.0", "edited": "False", "id": "iqm63mf", "is_submitter": "False", "link_id": "t3_xsq286", "parent_id": "t3_xsq286", "score": "13", "subreddit": "svenskpolitik", "subreddit_id": "t5_2twun"}, {"author": "Dysphoriented", "body": "Even if Vader is more powerful in his prime, there is something Luke has that Vader doesnt, Luke is Vaders son, and Vader would not kill Luke purely based on that. I do not believe there is an iteration of Vader that would kill the only thing he has left in this world.", "created_utc": "1664622422.0", "edited": "False", "id": "iqm0shn", "is_submitter": "False", "link_id": "t3_xsj1q4", "parent_id": "t3_xsj1q4", "score": "1", "subreddit": "StarWars", "subreddit_id": "t5_2qi4s"}, {"author": "Dysphoriented", "body": "Short answer, yes.", "created_utc": "1664584875.0", "edited": "False", "id": "iqkin3j", "is_submitter": "False", "link_id": "t3_xsby2s", "parent_id": "t1_iqki5rg", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Dysphoriented", "body": "The vita can emulate the whole PSP library. This includes everything that the PSP can emulate.", "created_utc": "1664582430.0", "edited": "False", "id": "iqkdqbz", "is_submitter": "False", "link_id": "t3_xsfgsk", "parent_id": "t1_iqkdmd8", "score": "6", "subreddit": "PSP", "subreddit_id": "t5_2qjts"}, {"author": "Dysphoriented", "body": "I always preferred the PSP library.", "created_utc": "1664582037.0", "edited": "False", "id": "iqkcxfc", "is_submitter": "False", "link_id": "t3_xsfgsk", "parent_id": "t3_xsfgsk", "score": "5", "subreddit": "PSP", "subreddit_id": "t5_2qjts"}, {"author": "Dysphoriented", "body": "Inflación de mierda.", "created_utc": "1664581183.0", "edited": "False", "id": "iqkb653", "is_submitter": "False", "link_id": "t3_xsey63", "parent_id": "t3_xsey63", "score": "8", "subreddit": "Brazil", "subreddit_id": "t5_2qmku"}, {"author": "Dysphoriented", "body": "Noll förståelse av systemisk analys, förstår att du gillar Gervais när du är lika arrogant obegåvad och ohyggligt otrevlig. Klarar inte ens av att höra att folk tycker olika utan att vara en översittare.", "created_utc": "1664580637.0", "edited": "1664580899.0", "id": "iqka1v4", "is_submitter": "False", "link_id": "t3_xs3krc", "parent_id": "t1_iqk9ot3", "score": "2", "subreddit": "sweden", "subreddit_id": "t5_2qofe"}, {"author": "Dysphoriented", "body": "Du förstår att ordet \"normalt\" existerar för att förtrycka det som normen anser är fel?", "created_utc": "1664580110.0", "edited": "False", "id": "iqk8y4y", "is_submitter": "False", "link_id": "t3_xs3krc", "parent_id": "t1_iqk8lv1", "score": "2", "subreddit": "sweden", "subreddit_id": "t5_2qofe"}, {"author": "Dysphoriented", "body": "Onödig kommentar. Folk tycker olika och det är inget fel med det.", "created_utc": "1664579372.0", "edited": "False", "id": "iqk7fe8", "is_submitter": "False", "link_id": "t3_xs3krc", "parent_id": "t1_iqk7c4r", "score": "1", "subreddit": "sweden", "subreddit_id": "t5_2qofe"}, {"author": "Dysphoriented", "body": "Obviously I am speaking about general understanding, it may be easier or harder for some.", "created_utc": "1664572352.0", "edited": "False", "id": "iqjs4u3", "is_submitter": "False", "link_id": "t3_xsby2s", "parent_id": "t1_iqjr5ef", "score": "4", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Dysphoriented", "body": "It only gets you so far, you need organised learning, too.   \nAt most, knowing one will aid you a little with learning another because of word similarities and grammar similarities but it will not be a cheat to learn very rapidly. (I speak Portuguese, Spanish and French and base my answer on my experience with them).", "created_utc": "1664571073.0", "edited": "False", "id": "iqjp5sq", "is_submitter": "False", "link_id": "t3_xs841g", "parent_id": "t3_xs841g", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Dysphoriented", "body": "From experience I can say that it only helps you get used to hearing the language, it doesnt teach you much beyond a word here and there, the better option is to have it all in the target language.", "created_utc": "1664570930.0", "edited": "False", "id": "iqjotck", "is_submitter": "False", "link_id": "t3_xsa5jl", "parent_id": "t3_xsa5jl", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Dysphoriented", "body": "Generally speaking Japanese pronounciation is easy, it is the grammar that is perceived as very difficult. For Chinese, it is the other way around, the grammar is easier, but nailing sounds (which is a big part of the language) is very difficult.\n\nThe real question you should ask is, how interested in Japanese are you? Do you have a genuine passion? Are you interested in Japanese culture? Planning on moving there? Japanese friends? If not, then maybe you should pick a language that is more rewarding for you personally. I always say that the language you should learn is the one you are the most excited about learning, otherwise it will be a boring struggle.\n\nIt is also important to remember that the language institutes estimates are only approximations, theres no guarantee it will take that long, might take more, might take less time. Depends on factors such as interest, how many hours that one dedicates and how often.", "created_utc": "1664570721.0", "edited": "False", "id": "iqjobap", "is_submitter": "False", "link_id": "t3_xsby2s", "parent_id": "t3_xsby2s", "score": "5", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Dysphoriented", "body": "The level design is its weakest aspect and the level the Library is godawful.   \nGreat game though, singlehandedly saved the Xbox Original.", "created_utc": "1664570108.0", "edited": "False", "id": "iqjmugs", "is_submitter": "False", "link_id": "t3_xs9cg0", "parent_id": "t3_xs9cg0", "score": "-2", "subreddit": "halo", "subreddit_id": "t5_2qixk"}, {"author": "Dysphoriented", "body": "The fact Star Wars and by extension the clone wars and prequels, were heavily political in showing how a democracy decayed into a fascist empire is one of the best things about the whole series, if you ask me. Truth is if you didnt understand Star Wars was always political and that the rebels and empire were meant to be progressive forces fighting fascism, you never understood Star Wars.", "created_utc": "1664569355.0", "edited": "False", "id": "iqjl1eo", "is_submitter": "False", "link_id": "t3_xs0qmp", "parent_id": "t3_xs0qmp", "score": "1", "subreddit": "StarWars", "subreddit_id": "t5_2qi4s"}, {"author": "Dysphoriented", "body": "My argument then is that its easier to have it all portable than on a PS3", "created_utc": "1664558555.0", "edited": "False", "id": "iqiuc29", "is_submitter": "False", "link_id": "t3_xs1qqp", "parent_id": "t1_iqiu44e", "score": "1", "subreddit": "vita", "subreddit_id": "t5_2sjmv"}, {"author": "Dysphoriented", "body": "Eller så har vi bara olika smak.", "created_utc": "1664557369.0", "edited": "False", "id": "iqird1v", "is_submitter": "False", "link_id": "t3_xs3krc", "parent_id": "t1_iqiqu42", "score": "5", "subreddit": "sweden", "subreddit_id": "t5_2qofe"}, {"author": "Dysphoriented", "body": "I would read up on the different tendencies and then make up my own mind if I were you, asking others to decide what ideology you should belong to is kind of counter-intuitive as you are better off having grounded yourself in morals, ethics and principles. I am sure the people on this subreddit (me included) would help you if you had questions about the different tendencies, though.", "created_utc": "1664556507.0", "edited": "False", "id": "iqip702", "is_submitter": "False", "link_id": "t3_xs66gr", "parent_id": "t3_xs66gr", "score": "7", "subreddit": "Anarchy101", "subreddit_id": "t5_2s960"}, {"author": "Dysphoriented", "body": "I disagree with your first response, I still view it as anti-indigenous (being indigenous myself, I often hear these views from others and they are always a way to discriminate against us for being \"backward\" or similar.), but I agree on the other two, perhaps \"expertise\" is better phrasing in order to separate it, but in my view, there is no difference between being an expert on a topic and being the authority on that topic. The only distinction that exists, exists because of the current hierarchical framework, if there was no hierarchy, there would not be a hierarchy attached to the idea of authority.  \n\n\nI will be more clear in the future, thanks.", "created_utc": "1664556229.0", "edited": "False", "id": "iqiohxc", "is_submitter": "False", "link_id": "t3_xs51k9", "parent_id": "t1_iqinxd1", "score": "1", "subreddit": "Anarchy101", "subreddit_id": "t5_2s960"}, {"author": "Dysphoriented", "body": "You owe them nothing.", "created_utc": "1664555832.0", "edited": "False", "id": "iqinhub", "is_submitter": "False", "link_id": "t3_xs27qd", "parent_id": "t3_xs27qd", "score": "1", "subreddit": "AmItheAsshole", "subreddit_id": "t5_2xhvq"}, {"author": "Dysphoriented", "body": "The only way to truly get rid of religion is to exterminate it, as such the only option is genocidal.\n\nMany many indigenous people believe in Gods or Spirits that guide them, some even believe that they are physical manifestations of spirits or Gods, if we are to say they arent \\*truly anarchist\\* thats gatekeepy and anti-indigenous. It would be a very \\*white\\* anarchism, which isnt anarchism at all if you ask me, but rather people clinging onto white supremacy.\n\nIf you disagree with the definition of authority thats fine, but I believe there is a difference between being an authoritarian that supports or creates hierarchies wherever they go, and simply being an authority on a topic that other people arent, which means they will go to you for help. To this end, Doctor, Carpenter, Plumber or Teacher are (in my mind) good examples of a non coercive dynamic free of authoritarianism.\n\nIt should be said that I do not mean these professions within capitalism (as they are extremely coercive at present), I am speaking about how they would operate in an anarchist society.", "created_utc": "1664555140.0", "edited": "False", "id": "iqilr1e", "is_submitter": "False", "link_id": "t3_xs51k9", "parent_id": "t1_iqikx8n", "score": "1", "subreddit": "Anarchy101", "subreddit_id": "t5_2s960"}, {"author": "Dysphoriented", "body": "Georgien med.", "created_utc": "1664554701.0", "edited": "False", "id": "iqikmcl", "is_submitter": "False", "link_id": "t3_xs1f1n", "parent_id": "t1_iqijt23", "score": "6", "subreddit": "sweden", "subreddit_id": "t5_2qofe"}, {"author": "Dysphoriented", "body": "Once in South America and several times in the European Union. It works, many people in line behind me also only had IDs.", "created_utc": "1664554656.0", "edited": "False", "id": "iqikibd", "is_submitter": "False", "link_id": "t3_xs3xhe", "parent_id": "t1_iqijsmz", "score": "7", "subreddit": "Brazil", "subreddit_id": "t5_2qmku"}, {"author": "Dysphoriented", "body": "Authority and hierarchy are different, if the authority proves it is legitimate, it is fine. For example, a teacher and a student, a doctor and a patient or a carpenter and somebody who needs something to be built. You can question authority and they will explain to you, you still have the option to choose what you want to happen. A hierarchy is intrinsically coercive. As such, I believe that people believing in God as an authority are fine.\n\nIf the option is that they arent \\*really\\* anarchists, we are moving into dangerous territory because it would suggest that you cant be an anarchist and be religious, which is at best anti-indigenous and at worst, genocidal.", "created_utc": "1664554527.0", "edited": "False", "id": "iqik6nl", "is_submitter": "False", "link_id": "t3_xs51k9", "parent_id": "t3_xs51k9", "score": "3", "subreddit": "Anarchy101", "subreddit_id": "t5_2s960"}, {"author": "Dysphoriented", "body": "Generally speaking, yes. I imagine so.", "created_utc": "1664554285.0", "edited": "False", "id": "iqijl4a", "is_submitter": "False", "link_id": "t3_xrwss4", "parent_id": "t1_iqijcjj", "score": "4", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Dysphoriented", "body": "Den försvann aldrig, den bytte bara skepnad.", "created_utc": "1664553374.0", "edited": "False", "id": "iqihbs1", "is_submitter": "False", "link_id": "t3_xs1f1n", "parent_id": "t1_iqhxlue", "score": "28", "subreddit": "sweden", "subreddit_id": "t5_2qofe"}, {"author": "Dysphoriented", "body": "They are associated countries and as such it allows free travel between them.   \n[https://en.wikipedia.org/wiki/Citizenship\\_of\\_the\\_Mercosur](https://en.wikipedia.org/wiki/Citizenship_of_the_Mercosur#:~:text=Mercosur%20citizens%20have%20the%20right,security%20systems%20and%20labor%20laws)", "created_utc": "1664552365.0", "edited": "False", "id": "iqieret", "is_submitter": "False", "link_id": "t3_xs3xhe", "parent_id": "t1_iqieg7q", "score": "19", "subreddit": "Brazil", "subreddit_id": "t5_2qmku"}, {"author": "Dysphoriented", "body": "Ricky Gervais", "created_utc": "1664552285.0", "edited": "False", "id": "iqiekcj", "is_submitter": "False", "link_id": "t3_xs3krc", "parent_id": "t3_xs3krc", "score": "-18", "subreddit": "sweden", "subreddit_id": "t5_2qofe"}, {"author": "Dysphoriented", "body": "You probably think you dont look good, but I assure you that we are all beautiful. You too.", "created_utc": "1664551559.0", "edited": "False", "id": "iqicqjf", "is_submitter": "False", "link_id": "t3_xrzfqi", "parent_id": "t3_xrzfqi", "score": "2", "subreddit": "trans", "subreddit_id": "t5_2shbb"}, {"author": "Dysphoriented", "body": "As part of the Mercosur countries, you only need ID.   \nIt works like how EU members can use their ID to fly/travel to other EU countries.", "created_utc": "1664551306.0", "edited": "False", "id": "iqic3iu", "is_submitter": "False", "link_id": "t3_xs3xhe", "parent_id": "t3_xs3xhe", "score": "21", "subreddit": "Brazil", "subreddit_id": "t5_2qmku"}, {"author": "Dysphoriented", "body": "My experience is just my experience, so I thought I would share it, it will not be universal, but it is nevertheless my experience of MLs.   \nGood that you arent dogmatic, though.", "created_utc": "1664551207.0", "edited": "False", "id": "iqibu9b", "is_submitter": "False", "link_id": "t3_xs2ocw", "parent_id": "t1_iqiasex", "score": "33", "subreddit": "Anarchy101", "subreddit_id": "t5_2s960"}, {"author": "Dysphoriented", "body": "Choose the one that you like more or that you are interested in more. Which one comes easier? I lived in Germany for two years and many germans know english too, so you would likely be fine with English there until you have time to properly study german if you choose to later. Being completely immersed like you would be in the actual country, is the best way to learn.", "created_utc": "1664551115.0", "edited": "False", "id": "iqiblxz", "is_submitter": "False", "link_id": "t3_xs3xn6", "parent_id": "t3_xs3xn6", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Dysphoriented", "body": "\"Political lesbianism\", right?", "created_utc": "1664549517.0", "edited": "False", "id": "iqi7o2g", "is_submitter": "False", "link_id": "t3_xrws7c", "parent_id": "t1_iqi3w2l", "score": "3", "subreddit": "lgbt", "subreddit_id": "t5_2qhh7"}, {"author": "Dysphoriented", "body": "some PS1 games, very few, the N64 has a limited library of games that function well that amount to basically all Zelda and Mario games, depending on the emulator, you might run into some issues with certain SNES games and finally when using an NES emulator, it is common to get issues when you try to play the \"2 in 1\" series of roms for NES. Beyond that, most games will run fine, including the ones on GBA, GB and GBC.", "created_utc": "1664548121.0", "edited": "False", "id": "iqi4aqi", "is_submitter": "False", "link_id": "t3_xs1qqp", "parent_id": "t1_iqi3u76", "score": "1", "subreddit": "vita", "subreddit_id": "t5_2sjmv"}, {"author": "Dysphoriented", "body": "Not all of them are tankies, but my biggest problem with them is that they are so rigid and dogmatically bound to the orthodox writings of Marx, Lenin and Mao. Many of them, even the non-tankie ones, praise these people like Gods and it weirds me out because adhering to people instead of principles is a recipe for disaster.", "created_utc": "1664547986.0", "edited": "False", "id": "iqi3z9r", "is_submitter": "False", "link_id": "t3_xs2ocw", "parent_id": "t3_xs2ocw", "score": "161", "subreddit": "Anarchy101", "subreddit_id": "t5_2s960"}, {"author": "Dysphoriented", "body": "The Vita can emulate everything the PSP can (NES, SNES, N64, PS1 etc etc), including the PSP itself so your library of available games will be very large if you decide to go that route.", "created_utc": "1664547725.0", "edited": "False", "id": "iqi3dco", "is_submitter": "False", "link_id": "t3_xs1qqp", "parent_id": "t3_xs1qqp", "score": "1", "subreddit": "vita", "subreddit_id": "t5_2sjmv"}, {"author": "Dysphoriented", "body": "You are right, the next time I will clarify that is what I meant, thanks.", "created_utc": "1664545816.0", "edited": "False", "id": "iqhyz4k", "is_submitter": "False", "link_id": "t3_xs0nri", "parent_id": "t1_iqhytyl", "score": "7", "subreddit": "communism101", "subreddit_id": "t5_2uc81"}, {"author": "Dysphoriented", "body": "In almost all cases it certainly helps because it provides you with a level of motivation that most people are unable to find without it. That being said, there are many who have learned languages even without these aids.", "created_utc": "1664545406.0", "edited": "False", "id": "iqhy21l", "is_submitter": "False", "link_id": "t3_xs1org", "parent_id": "t3_xs1org", "score": "9", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Dysphoriented", "body": "Part of his reason for hating the soviet communists were that he thought they were all jews. Seems pretty clear cut, to me.", "created_utc": "1664545304.0", "edited": "False", "id": "iqhxtvx", "is_submitter": "False", "link_id": "t3_xs0nri", "parent_id": "t1_iqhxkin", "score": "0", "subreddit": "communism101", "subreddit_id": "t5_2uc81"}, {"author": "Dysphoriented", "body": "Honestly, that should be obvious that you would have to do.   \nThe assumed position of mine should be \"he is a bigot and it shows in his writing\" as advice on how to proceed. Did you expect me to lay out every single time he calls a black person the N word or similar? I assumed OP wanted advice, not a lecture about the bigotry of Orwell, which is well documented on the internet. His list is just one of many examples of this.", "created_utc": "1664545160.0", "edited": "False", "id": "iqhxi0w", "is_submitter": "False", "link_id": "t3_xs0nri", "parent_id": "t1_iqhwx9z", "score": "-3", "subreddit": "communism101", "subreddit_id": "t5_2uc81"}, {"author": "Dysphoriented", "body": "Obviously you would have to do that to persuade someone, OP asked how to convince someone and to connect his views with his writing seems obvious to me. The man is dead, how else are you supposed to prove that?", "created_utc": "1664544845.0", "edited": "False", "id": "iqhwsqz", "is_submitter": "False", "link_id": "t3_xs0nri", "parent_id": "t1_iqhwlts", "score": "-5", "subreddit": "communism101", "subreddit_id": "t5_2uc81"}, {"author": "Dysphoriented", "body": "It is ad hominem to point out that a bigot has bad opinions about minorities that shine through in his writing? Even if factually true? Ridiculous.", "created_utc": "1664544654.0", "edited": "False", "id": "iqhwdlb", "is_submitter": "False", "link_id": "t3_xs0nri", "parent_id": "t1_iqhw525", "score": "-15", "subreddit": "communism101", "subreddit_id": "t5_2uc81"}, {"author": "Dysphoriented", "body": "The truth. You can tell by how they claim to care about women but dont give a shit about anything other than \"trans people in bathrooms\". All of them want to restrict rights for women and have a conservative world-view. They use rhetoric and language like \"lesbian erasure\" and \"gender/sex realist\" which echoes \"race realist\" and \"white erasure\".  Every time a lesbian discovers they are trans, they see that as a \"loss for the lesbian community\" much in the same way that white supremacists see a white and black person have a child as a loss for the white race, since even if the child is from a white parent, they are still black. It works like this with how they view trans people, too. They dont care if you are a trans lesbian, it is still a loss because to them, the trans person is \"tainted\". They always talk about \"transwashing\" lesbian history, too. They also claim to be inclusive because they allow trans men into their movement but it is because they view them as biological women. It is not about protecting women, its about protecting the socially constructed idea of what a woman \"should\" be with a made up checklist.  \nTERFs are some of the worst people in modern culture and they threaten our entire existence.", "created_utc": "1664544363.0", "edited": "False", "id": "iqhvr14", "is_submitter": "False", "link_id": "t3_xrws7c", "parent_id": "t1_iqhufu1", "score": "17", "subreddit": "lgbt", "subreddit_id": "t5_2qhh7"}, {"author": "Dysphoriented", "body": "If you are starting from scratch with Portuguese, I suggest you make sure you have a genuine interest in the language as that will make it a lot easier to learn.  \nIf you already are fluent, then I would recommend it, it is fairly easy and definitely possible, though your milage may vary in north america.", "created_utc": "1664543630.0", "edited": "False", "id": "iqhu653", "is_submitter": "False", "link_id": "t3_xrq7bx", "parent_id": "t3_xrq7bx", "score": "4", "subreddit": "TranslationStudies", "subreddit_id": "t5_2uk7r"}, {"author": "Dysphoriented", "body": "I was not arguing, I was clarifying what i meant, thanks for adding nuance to the conversation though. I was just trying to be helpful.  \nThe truth is that it \\*is\\* easier if you have a genuine interest, though.", "created_utc": "1664543389.0", "edited": "False", "id": "iqhtnsf", "is_submitter": "False", "link_id": "t3_xrz4tt", "parent_id": "t1_iqht157", "score": "4", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Dysphoriented", "body": "A bad argument? Establishing that he would be a bigot and therefore unreliable is a bad argument?", "created_utc": "1664543325.0", "edited": "False", "id": "iqhtj03", "is_submitter": "False", "link_id": "t3_xs0nri", "parent_id": "t1_iqhtbfs", "score": "-12", "subreddit": "communism101", "subreddit_id": "t5_2uc81"}, {"author": "Dysphoriented", "body": "Good, he is a right wing extremist with vile views and opinions anyway.", "created_utc": "1664543232.0", "edited": "False", "id": "iqhtc2h", "is_submitter": "False", "link_id": "t3_xrv7su", "parent_id": "t3_xrv7su", "score": "-1", "subreddit": "sweden", "subreddit_id": "t5_2qofe"}, {"author": "Dysphoriented", "body": "Show them orwells list and explain he was a snitch that hated jews and gay people, so he isnt the most reliable person.", "created_utc": "1664542733.0", "edited": "False", "id": "iqhsavi", "is_submitter": "False", "link_id": "t3_xs0nri", "parent_id": "t3_xs0nri", "score": "-1", "subreddit": "communism101", "subreddit_id": "t5_2uc81"}, {"author": "Dysphoriented", "body": "A common side-effect of dysphoria is depersonalisation, so it makes sense.", "created_utc": "1664542023.0", "edited": "False", "id": "iqhqvs0", "is_submitter": "False", "link_id": "t3_xrzwcg", "parent_id": "t3_xrzwcg", "score": "3", "subreddit": "trans", "subreddit_id": "t5_2shbb"}, {"author": "Dysphoriented", "body": "Through the SCART output it should work fine, yes.", "created_utc": "1664541911.0", "edited": "False", "id": "iqhqnvh", "is_submitter": "False", "link_id": "t3_xs05al", "parent_id": "t3_xs05al", "score": "3", "subreddit": "ps2", "subreddit_id": "t5_2r8uk"}, {"author": "Dysphoriented", "body": "Because I assumed OP was looking for helpful information on what will make learning a language easier. This \\*is\\* a language learning community, so my advice was based on that.", "created_utc": "1664541835.0", "edited": "False", "id": "iqhqijj", "is_submitter": "False", "link_id": "t3_xrz4tt", "parent_id": "t1_iqhq973", "score": "9", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Dysphoriented", "body": "A fascist cosplaying as a feminist.", "created_utc": "1664541708.0", "edited": "False", "id": "iqhq9le", "is_submitter": "False", "link_id": "t3_xrws7c", "parent_id": "t3_xrws7c", "score": "22", "subreddit": "lgbt", "subreddit_id": "t5_2qhh7"}, {"author": "Dysphoriented", "body": "Also \"This language gives me clout\" and \"this language brings me money\" are almost the same reason.", "created_utc": "1664541434.0", "edited": "False", "id": "iqhpqec", "is_submitter": "False", "link_id": "t3_xrz4tt", "parent_id": "t1_iqhpn8q", "score": "11", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Dysphoriented", "body": "In terms of aiding with learning, a genuine interest that isnt simply for employment will beat it every time. At least that is what I have observed in my decade of experience being a teacher. People who do it for employment struggle more than people who have a genuine passion for the langauge and culture.   \n\n\nOur opinions may differ on the definition of \"superficial\" but when I said it, I meant anything lacking a genuine passion. Of course a passion can overlap with a wish to get employment in that langauge but my point is that if it is \\*only\\* for employment, you will have a bad time. A worse time than someone who genuinely loves the culture that the language belongs to, for example.", "created_utc": "1664541387.0", "edited": "False", "id": "iqhpn8q", "is_submitter": "False", "link_id": "t3_xrz4tt", "parent_id": "t1_iqhop6m", "score": "28", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Dysphoriented", "body": "That is fine, but I hope that if you have played the original trilogy, you will be rewarded for the knowledge that you have amassed, regardless.", "created_utc": "1664541060.0", "edited": "False", "id": "iqhp0n6", "is_submitter": "False", "link_id": "t3_xrki5i", "parent_id": "t3_xrki5i", "score": "1", "subreddit": "PS5", "subreddit_id": "t5_2s887"}, {"author": "Dysphoriented", "body": "You dont need dysphoria to be trans, just not identifying with your assigned gender is enough. You also dont need to go through medical transition to \"be valid\".   \nYou are valid no matter what because the only person who can dictate the limits of your identity is you.", "created_utc": "1664540934.0", "edited": "False", "id": "iqhorxx", "is_submitter": "False", "link_id": "t3_xrzqoj", "parent_id": "t3_xrzqoj", "score": "1", "subreddit": "trans", "subreddit_id": "t5_2shbb"}, {"author": "Dysphoriented", "body": "Just because republicans had to suffer student loans that doesnt mean everyone else should.", "created_utc": "1664540582.0", "edited": "False", "id": "iqho47j", "is_submitter": "False", "link_id": "t3_xre6n7", "parent_id": "t3_xre6n7", "score": "1", "subreddit": "politics", "subreddit_id": "t5_2cneq"}, {"author": "Dysphoriented", "body": "What you call a \"knack\" I refer to as a predisposition towards learning a language.   \nI tell every student that describes it to me that they really shouldnt waste that opportunity because it usually makes it \"easier\" to learn a language than say, not having heard any of it ever. Many people get this same predisposition from watching subbed anime in japanese but with english subtitles for their entire childhood for example. What you say is 100% true, though.", "created_utc": "1664538975.0", "edited": "False", "id": "iqhl9yb", "is_submitter": "False", "link_id": "t3_xrl2yl", "parent_id": "t1_iqhjux6", "score": "4", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Dysphoriented", "body": "Be prepared to give up a lot of free time that you used to have because you will need it for studying, make sure you have a genuine interest in the language that goes beyond superficial reasons (i.e a genuine interest in the culture and writers for example, rather than simply looking for employment opportunity), perhaps make friends with people who speak russian, then engage with the culture as much as you possibly can, watch movies, read books, play CS GO (joking, mostly), listen to russian music, plan a visit for a month or so if possible, things like that are what helps the most.", "created_utc": "1664538381.0", "edited": "False", "id": "iqhk9sz", "is_submitter": "False", "link_id": "t3_xrz4tt", "parent_id": "t3_xrz4tt", "score": "34", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Dysphoriented", "body": "It is easier to adopt a new word that already exists than think of a brand new way to describe something.", "created_utc": "1664538224.0", "edited": "False", "id": "iqhk06q", "is_submitter": "False", "link_id": "t3_xrwss4", "parent_id": "t3_xrwss4", "score": "14", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Dysphoriented", "body": "Sounds like he fetishises you and other asians, which is concerning.   \nI would re-evaluate your relationship. You deserve better.", "created_utc": "1664537644.0", "edited": "False", "id": "iqhj268", "is_submitter": "False", "link_id": "t3_xryu19", "parent_id": "t3_xryu19", "score": "18", "subreddit": "relationship_advice", "subreddit_id": "t5_2r0cn"}, {"author": "Dysphoriented", "body": "It depends on what your are into playing but absolutely Guild Wars 2 and Path of Exile.", "created_utc": "1664529524.0", "edited": "False", "id": "iqh8dcq", "is_submitter": "False", "link_id": "t3_xrrrnb", "parent_id": "t3_xrrrnb", "score": "1", "subreddit": "Steam", "subreddit_id": "t5_2qwis"}, {"author": "Dysphoriented", "body": "Yes, I work with these languages every day when I work and speak with my friends, so I get constant repetition and practice.", "created_utc": "1664528838.0", "edited": "False", "id": "iqh7ltw", "is_submitter": "False", "link_id": "t3_xr8by3", "parent_id": "t1_iqg2v8d", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Dysphoriented", "body": "You read my mind.", "created_utc": "1664495647.0", "edited": "False", "id": "iqfnmvq", "is_submitter": "False", "link_id": "t3_xrmdm0", "parent_id": "t1_iqfnkcu", "score": "5", "subreddit": "Anarchy101", "subreddit_id": "t5_2s960"}, {"author": "Dysphoriented", "body": "The deforestation of the Amazon rainforest", "created_utc": "1664495155.0", "edited": "False", "id": "iqfml8o", "is_submitter": "False", "link_id": "t3_xrmdm0", "parent_id": "t3_xrmdm0", "score": "15", "subreddit": "Anarchy101", "subreddit_id": "t5_2s960"}, {"author": "Dysphoriented", "body": "Because it requires an incredible time investment that most people, even if they are willing, may not be able to commit to on a regular basis.", "created_utc": "1664491200.0", "edited": "False", "id": "iqfe2ie", "is_submitter": "False", "link_id": "t3_xrl2yl", "parent_id": "t3_xrl2yl", "score": "294", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Dysphoriented", "body": "Since there is no way for a person looking at the post like any other post to know that, I still aim critique at that decision. Thanks for clearing that up, though.", "created_utc": "1664487619.0", "edited": "False", "id": "iqf5x3i", "is_submitter": "False", "link_id": "t3_xqzqie", "parent_id": "t1_iqf4778", "score": "3", "subreddit": "Feminism", "subreddit_id": "t5_2qr7i"}, {"author": "Dysphoriented", "body": "30. But the educational system in my home country helped me majorly, you are theoretically supposed to speak 4 languages by the time you finish university. I was taught Swedish and English in a bilingual home, French in middle school and college, Portuguese in uni and Spanish when I moved.", "created_utc": "1664487534.0", "edited": "False", "id": "iqf5px8", "is_submitter": "False", "link_id": "t3_xr8by3", "parent_id": "t1_iqf513p", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Dysphoriented", "body": "New Vegas, then you will see that anything other than NV type story-telling and quest design is sub-par in terms of Fallout and Elder Scrolls.", "created_utc": "1664485919.0", "edited": "False", "id": "iqf1va3", "is_submitter": "False", "link_id": "t3_xr5ic1", "parent_id": "t3_xr5ic1", "score": "2", "subreddit": "Fallout", "subreddit_id": "t5_2qnzu"}, {"author": "Dysphoriented", "body": "Aria of Sorrow, you will love it.   \nMy personal favorite though, is Castlevania Bloodlines.", "created_utc": "1664485371.0", "edited": "False", "id": "iqf0jz2", "is_submitter": "False", "link_id": "t3_xrhia7", "parent_id": "t3_xrhia7", "score": "6", "subreddit": "castlevania", "subreddit_id": "t5_2ss33"}, {"author": "Dysphoriented", "body": "I speak Swedish, English, Spanish, Portuguese and French.   \nYou can learn any language you set your mind to, and dont let anyone else tell you otherwise.", "created_utc": "1664485317.0", "edited": "False", "id": "iqf0f97", "is_submitter": "False", "link_id": "t3_xr8by3", "parent_id": "t1_iqezicx", "score": "9", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Dysphoriented", "body": "Generally speaking, it is creatively bankrupt to suggest without competition people wouldnt want to innovate, children do not see any profit motive in learning how to walk, people do not need the monetary incentive to create things. In fact, many many people who were never discovered due to their material conditions preventing them from excelling at what they do, would be able to in an anarchist society. I believe we are drawn towards evolution and innovation as a fundamental way of life. We are just a curious bunch and it aligns well with technological progress. Besides, before capitalism even existed, we were still innovating.", "created_utc": "1664485283.0", "edited": "False", "id": "iqf0ca6", "is_submitter": "False", "link_id": "t3_xrioyo", "parent_id": "t3_xrioyo", "score": "28", "subreddit": "Anarchy101", "subreddit_id": "t5_2s960"}, {"author": "Dysphoriented", "body": "I understand you do not want to but you would learn more if you read it on your own.", "created_utc": "1664484040.0", "edited": "False", "id": "iqex8hy", "is_submitter": "False", "link_id": "t3_xribre", "parent_id": "t3_xribre", "score": "13", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Dysphoriented", "body": "To me, the assumption would not to talk to them.", "created_utc": "1664482116.0", "edited": "False", "id": "iqesdey", "is_submitter": "False", "link_id": "t3_xqukbq", "parent_id": "t1_iqervxf", "score": "1", "subreddit": "AmItheAsshole", "subreddit_id": "t5_2xhvq"}, {"author": "Dysphoriented", "body": "If someone tells you they are in a No Contact situation with their family, you can infer they do not want you to talk to them.", "created_utc": "1664481697.0", "edited": "False", "id": "iqerbqr", "is_submitter": "False", "link_id": "t3_xqukbq", "parent_id": "t1_iqer2cy", "score": "1", "subreddit": "AmItheAsshole", "subreddit_id": "t5_2xhvq"}, {"author": "Dysphoriented", "body": "You chose to cross an established boundary so yes, YTA.", "created_utc": "1664481014.0", "edited": "False", "id": "iqeplw7", "is_submitter": "False", "link_id": "t3_xqukbq", "parent_id": "t3_xqukbq", "score": "1", "subreddit": "AmItheAsshole", "subreddit_id": "t5_2xhvq"}, {"author": "Dysphoriented", "body": "Jag tror att jag har pdfs med studiematerial, jag ska se.", "created_utc": "1664480877.0", "edited": "False", "id": "iqep9fg", "is_submitter": "False", "link_id": "t3_xc6w1e", "parent_id": "t1_iqenhw1", "score": "2", "subreddit": "leftistvexillology", "subreddit_id": "t5_3md7s"}, {"author": "Dysphoriented", "body": "If your question is \"will I be gatekept if I dont present as non binary?\" then the answer is no because there is no predetermined way to \\*look\\* non binary. Only TERFs would argue for a list of criteria, if you simply do not identify with your assigned gender, or the other option society gives you, you are non binary, regardless of how you present. The only person setting a limit to your identity and how you choose to present is you. Never let anyone else convince you of otherwise.", "created_utc": "1664480712.0", "edited": "False", "id": "iqeoulg", "is_submitter": "False", "link_id": "t3_xra5ef", "parent_id": "t3_xra5ef", "score": "3", "subreddit": "NonBinary", "subreddit_id": "t5_2vcez"}, {"author": "Dysphoriented", "body": "Jag sa \"alltid, syskon\"   \nJag kan lite fraser bara.", "created_utc": "1664480112.0", "edited": "False", "id": "iqencf5", "is_submitter": "False", "link_id": "t3_xc6w1e", "parent_id": "t1_iqemz4p", "score": "2", "subreddit": "leftistvexillology", "subreddit_id": "t5_3md7s"}, {"author": "Dysphoriented", "body": "Gender is a social construct, age isnt.", "created_utc": "1664479997.0", "edited": "False", "id": "iqen1y7", "is_submitter": "False", "link_id": "t3_xraz3x", "parent_id": "t3_xraz3x", "score": "1", "subreddit": "lgbt", "subreddit_id": "t5_2qhh7"}, {"author": "Dysphoriented", "body": "Jámma, oabbá", "created_utc": "1664479760.0", "edited": "False", "id": "iqemgpw", "is_submitter": "False", "link_id": "t3_xc6w1e", "parent_id": "t1_iqem0w3", "score": "1", "subreddit": "leftistvexillology", "subreddit_id": "t5_3md7s"}, {"author": "Dysphoriented", "body": "Above all, my favorite is the norwegian writer Jens Bjorneboe.  \nBut I dont idolise any specific person, that isnt what anarchism is about.", "created_utc": "1664478920.0", "edited": "False", "id": "iqekc5u", "is_submitter": "False", "link_id": "t3_xrck8w", "parent_id": "t3_xrck8w", "score": "7", "subreddit": "Anarchism", "subreddit_id": "t5_2qh5j"}, {"author": "Dysphoriented", "body": "Language is a skill like any other and it needs maintenance, watch shows, watch movies, read books, talk to people, make friends from a country that speaks your target language.   \n\n\nThis is the main issue for example when people come on here to ask questions like \"what language is the one that is the best to learn?\" or \"which language is the most profitable?\"   \n\n\nIf you only learn a language for work opportunities it is going to be a tough ride, learning one because of a genuine interest in a culture that speaks it, a genuine passion for engaging with the media and lived experiences will always beat any profit motive and it makes it a ton easier to practice and not make it feel like a chore, too.   \n\n\nFor example, I learned Spanish and Portuguese because I wanted to engage with Latin American authors and movies, I had friends from Argentina and Brazil, there was something more behind why I wanted to learn them, and that made it much easier for me.", "created_utc": "1664478676.0", "edited": "False", "id": "iqejq1y", "is_submitter": "False", "link_id": "t3_xrg3o3", "parent_id": "t3_xrg3o3", "score": "19", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Dysphoriented", "body": "The oldest person I had that mastered a language at a C2 level was 88 years old and incredibly proud of her accomplishment.", "created_utc": "1664477585.0", "edited": "False", "id": "iqegy8y", "is_submitter": "False", "link_id": "t3_xr8by3", "parent_id": "t1_iqegifb", "score": "12", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Dysphoriented", "body": "I work as a college teacher and translator. Where I lived before I moved, all education was free and anybody at any age could sign up for education at a college level to qualify for uni later, language classes included. \nMany people who retired in their 60s did so in countries like Spain and Portugal, some had connections through family, so I would teach them these languages at a college level. For adult education in college, half the class was over 55 almost always. Ive met many in their 70s and 80s who's dream it was to learn Spanish but they never found the time until they signed up for my classes.", "created_utc": "1664477414.0", "edited": "False", "id": "iqegifb", "is_submitter": "False", "link_id": "t3_xr8by3", "parent_id": "t1_iqefgtc", "score": "11", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Dysphoriented", "body": "Intense study, little by little and giving up a lot of free time, but most of all, you have to be able to accept that you might not reach your goal and thats okay.", "created_utc": "1664475931.0", "edited": "False", "id": "iqecpau", "is_submitter": "False", "link_id": "t3_xrf30a", "parent_id": "t3_xrf30a", "score": "10", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Dysphoriented", "body": "As an anarchist sami I adore this, thank you so much for making it!", "created_utc": "1664474450.0", "edited": "False", "id": "iqe8xky", "is_submitter": "False", "link_id": "t3_xc6w1e", "parent_id": "t3_xc6w1e", "score": "1", "subreddit": "leftistvexillology", "subreddit_id": "t5_3md7s"}, {"author": "Dysphoriented", "body": "I like the addition of the A inside of the intersex circle, personally.", "created_utc": "1664464269.0", "edited": "False", "id": "iqdj9ar", "is_submitter": "False", "link_id": "t3_xr72sl", "parent_id": "t3_xr72sl", "score": "15", "subreddit": "leftistvexillology", "subreddit_id": "t5_3md7s"}, {"author": "Dysphoriented", "body": "I dont know any specific study but there are studies showing that the aquisition of a language is as efficient as children because as adults we have an understanding they lack that makes up for the lack of \"sponge\" type of learning that children have.  \n\n\nExample:   \n[https://medium.com/@chacon/mit-scientists-prove-adults-learn-language-to-fluency-nearly-as-well-as-children-1de888d1d45f](https://medium.com/@chacon/mit-scientists-prove-adults-learn-language-to-fluency-nearly-as-well-as-children-1de888d1d45f)    \n\n\nI know many people who learned a second language or third at ages of 60, 70 or even 80.   \nIt is possible with enough dedication, dont get discouraged and aim for whatever goal you want. It is all in your hands, friend.", "created_utc": "1664463592.0", "edited": "False", "id": "iqdhmac", "is_submitter": "False", "link_id": "t3_xr8by3", "parent_id": "t3_xr8by3", "score": "28", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Dysphoriented", "body": "Generally speaking, we (the trans community) have a very hard time trusting cis people because of the systemic violence they inflict upon us as a group, this often gets conflated into hate for all cis people, just as people claim feminism is simply hating men, rather than the power structures they created that harm us.   \n\n\nThink of it like a box of chocolates, if theres ten pieces and you know seven are poisoned, you would not risk taking a single chocolate, would you? Well generally speaking, trans people have the same idea about cis people, sometimes, most times, we simply cannot afford the risk of trusting them because it so often ends in murder and violence inflicted upon us.  \n\n\nI personally do not hate anyone except for bigots and fascists.  \n\n\nIt should be said though that if trans people hate cis people, I think to a certain extent, that hate is justified.", "created_utc": "1664463389.0", "edited": "False", "id": "iqdh4g8", "is_submitter": "False", "link_id": "t3_xr7xtf", "parent_id": "t3_xr7xtf", "score": "4", "subreddit": "trans", "subreddit_id": "t5_2shbb"}, {"author": "Dysphoriented", "body": "Oh, my bad, mostly I see people just copy what articles have as headlines verbatim, so I assumed, that is my bad. Though as I understand it, this is a legal decision that has been made, so at least in theory, it should provide abortion for everyone.  \nThank you for clarifying, though. My annoyance is only with the OP, then.", "created_utc": "1664453377.0", "edited": "False", "id": "iqcvh2m", "is_submitter": "False", "link_id": "t3_xqzqie", "parent_id": "t1_iqcv7tc", "score": "38", "subreddit": "Feminism", "subreddit_id": "t5_2qr7i"}, {"author": "Dysphoriented", "body": "Fluency, to me, was always incorporating all four, you need to be at least C1 in my opinion to consider yourself fluent. Though being able to simply \"speak\" well isnt bad either.", "created_utc": "1664450348.0", "edited": "False", "id": "iqcqexr", "is_submitter": "False", "link_id": "t3_xqzxx3", "parent_id": "t3_xqzxx3", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Dysphoriented", "body": "I am going to be honest. As someone who enjoyed Dead Island and Riptide but loved Dying Light (not 2, though), respectfully, this game has been in development hell for nearly ten years at this point and is likely not going to live up to the hype or be good enough to not be forgettable. It should have been released in 2016 to be relevant. Most people who care are starting to forget what Dead Island even is at this point.", "created_utc": "1664450107.0", "edited": "False", "id": "iqcq1oi", "is_submitter": "False", "link_id": "t3_xr0elz", "parent_id": "t3_xr0elz", "score": "5", "subreddit": "PS5", "subreddit_id": "t5_2s887"}, {"author": "Dysphoriented", "body": "The listed specs are likely wrong, I would suggest buying a new TV.", "created_utc": "1664449842.0", "edited": "False", "id": "iqcpnio", "is_submitter": "False", "link_id": "t3_xr2j02", "parent_id": "t1_iqcpc5i", "score": "4", "subreddit": "playstation", "subreddit_id": "t5_2qh6b"}, {"author": "Dysphoriented", "body": "While this is great, I am bothered by the way it describes India as \"poor\" and \"backward\", comes off as very colonialist and racist.", "created_utc": "1664449796.0", "edited": "False", "id": "iqcpl20", "is_submitter": "False", "link_id": "t3_xqzqie", "parent_id": "t3_xqzqie", "score": "276", "subreddit": "Feminism", "subreddit_id": "t5_2qr7i"}, {"author": "Dysphoriented", "body": "The TV outright states it doesnt support it. So it is the TV and not the playstation.", "created_utc": "1664449449.0", "edited": "False", "id": "iqcp2ue", "is_submitter": "False", "link_id": "t3_xr2j02", "parent_id": "t3_xr2j02", "score": "7", "subreddit": "playstation", "subreddit_id": "t5_2qh6b"}, {"author": "Dysphoriented", "body": "Generally speaking you should never be with people who ask you to give up your entire identity to be with them, or to compromise on who you are. You deserve better and I recommend to break things off. You will find someone that accepts you for who you are, even if it seems scary and like you arent going to, you will. I know it.", "created_utc": "1664448721.0", "edited": "False", "id": "iqco1wh", "is_submitter": "False", "link_id": "t3_xr3uf9", "parent_id": "t3_xr3uf9", "score": "479", "subreddit": "trans", "subreddit_id": "t5_2shbb"}, {"author": "Dysphoriented", "body": "Teknokrati är ett riktigt dåligt sätt att styra. \nMer makt åt folket.", "created_utc": "1664387132.0", "edited": "False", "id": "iq9ghm1", "is_submitter": "False", "link_id": "t3_xqefnm", "parent_id": "t3_xqefnm", "score": "1", "subreddit": "svenskpolitik", "subreddit_id": "t5_2twun"}, {"author": "Dysphoriented", "body": "His wife said he made the entire Gulag Archipelago up lol\nPlus, he was a rabid antisemite.", "created_utc": "1664386934.0", "edited": "False", "id": "iq9fyt1", "is_submitter": "False", "link_id": "t3_xq6a60", "parent_id": "t1_iq91y29", "score": "11", "subreddit": "Anarchy101", "subreddit_id": "t5_2s960"}, {"author": "Dysphoriented", "body": "Legend of Heroes is way better. Rivals FF in terms of good storytelling and gameplay.", "created_utc": "1664373934.0", "edited": "False", "id": "iq8j6ei", "is_submitter": "False", "link_id": "t3_xqdi0r", "parent_id": "t3_xqdi0r", "score": "-1", "subreddit": "JRPG", "subreddit_id": "t5_2quw1"}, {"author": "Dysphoriented", "body": "What was your thoughts on the level design?   \nGenerally speaking I think the level design is its weakest aspect, especially when three levels are just backtracking through the same areas.", "created_utc": "1664371874.0", "edited": "False", "id": "iq8ek3m", "is_submitter": "False", "link_id": "t3_xqceoo", "parent_id": "t3_xqceoo", "score": "4", "subreddit": "halo", "subreddit_id": "t5_2qixk"}, {"author": "Dysphoriented", "body": "In the folder they will contain an eboot file and sometimes a JPG.", "created_utc": "1664370561.0", "edited": "False", "id": "iq8bsmj", "is_submitter": "False", "link_id": "t3_xqbqnt", "parent_id": "t1_iq8bk3a", "score": "3", "subreddit": "PSP", "subreddit_id": "t5_2qjts"}, {"author": "Dysphoriented", "body": "Because you cant use bin files and iso files with the PSP if its PSX games, you need eboots. Only ISO files that work are ones that are ripped from PSP games that were developed for the PSP. For Example, God of War Chains of Olympus would be an ISO file, while Breath of Fire IV would be an eboot. Same for Resident Evil 2.  \nIf they arent eboots, they will not work with the PSP.", "created_utc": "1664370156.0", "edited": "False", "id": "iq8ayxb", "is_submitter": "False", "link_id": "t3_xqbqnt", "parent_id": "t1_iq8a92k", "score": "2", "subreddit": "PSP", "subreddit_id": "t5_2qjts"}, {"author": "Dysphoriented", "body": "As far as I know there does not exist one at present.", "created_utc": "1664370038.0", "edited": "False", "id": "iq8aqb1", "is_submitter": "False", "link_id": "t3_xqc259", "parent_id": "t3_xqc259", "score": "1", "subreddit": "PSP", "subreddit_id": "t5_2qjts"}, {"author": "Dysphoriented", "body": "On PSP, PSX games are eboots and not ISO files, only the games that were made for PSP are ISOs. If you look, the PSX on PSP games or official eboots come as eboot files and that is what you need to run them on PSP. You place the folder with the PSX game in the GAME folder rather than the regular ISO folder. Make sure that the PSX game and its JPG are in the same folder, if it is two folders deep with one folder that has the image and then the other has the actual game, you will have to put the image and the eboot in the same folder (only one, not two, so for example it would be GAME > Xenogears > (eboot and image) because otherwise it will show up as a corrupted file in the XMB menu.", "created_utc": "1664369601.0", "edited": "False", "id": "iq89uy9", "is_submitter": "False", "link_id": "t3_xqbqnt", "parent_id": "t3_xqbqnt", "score": "2", "subreddit": "PSP", "subreddit_id": "t5_2qjts"}, {"author": "Dysphoriented", "body": "I used to think, as a child, that the imperial march was something Vader could play whenever he wanted to with the buttons on his chest because it looked like a walkman to me.", "created_utc": "1664367441.0", "edited": "False", "id": "iq85rvo", "is_submitter": "False", "link_id": "t3_xpyia1", "parent_id": "t3_xpyia1", "score": "1", "subreddit": "StarWars", "subreddit_id": "t5_2qi4s"}, {"author": "Dysphoriented", "body": "This reads like incel-ish, red pill shit, I would be concerned for my s/o if I were you and seriously question if they were right for me. It is blatant misogyny and sexism, plain and simple.", "created_utc": "1664364832.0", "edited": "False", "id": "iq81duy", "is_submitter": "False", "link_id": "t3_xq4anx", "parent_id": "t3_xq4anx", "score": "1", "subreddit": "relationship_advice", "subreddit_id": "t5_2r0cn"}, {"author": "Dysphoriented", "body": "No worries, I am just trying to be helpful!", "created_utc": "1664360214.0", "edited": "False", "id": "iq7uwpn", "is_submitter": "False", "link_id": "t3_xq4mxo", "parent_id": "t1_iq7up82", "score": "16", "subreddit": "communism101", "subreddit_id": "t5_2uc81"}, {"author": "Dysphoriented", "body": "Gatekeeping in general is never justified unless you are trying to protect a group from fascists or nazis.", "created_utc": "1664359805.0", "edited": "False", "id": "iq7ueuo", "is_submitter": "False", "link_id": "t3_xpt19z", "parent_id": "t3_xpt19z", "score": "1", "subreddit": "cyberpunkgame", "subreddit_id": "t5_3az7x"}, {"author": "Dysphoriented", "body": "Every year or every few years, stories will pop up about how the people of Cuba no longer supports the regime and just like with #SOScuba and every other time these stories have popped up, it has been propaganda and a general psyop attempt. Most people in Cuba support the revolution and the government at present.", "created_utc": "1664359696.0", "edited": "False", "id": "iq7ua7c", "is_submitter": "False", "link_id": "t3_xq4mxo", "parent_id": "t3_xq4mxo", "score": "135", "subreddit": "communism101", "subreddit_id": "t5_2uc81"}, {"author": "Dysphoriented", "body": "Metal Gear Solid 2 isnt bad, it is a masterpiece crafted by a misunderstood genius that followed it up with what is arguably one of the single greatest games ever made, Metal Gear Solid 3. MGS2 was so ahead of its time that it wasnt appreciated for how truly innovative it was and the same can be said for many Kojima games honestly. Zone of the Enders was just like it.", "created_utc": "1664359013.0", "edited": "False", "id": "iq7th4l", "is_submitter": "False", "link_id": "t3_xpzda0", "parent_id": "t3_xpzda0", "score": "9", "subreddit": "metalgearsolid", "subreddit_id": "t5_2s4hr"}, {"author": "Dysphoriented", "body": "If you want to add something helpful, I suggest you stop acting like a misogynist with your victim blaming attitude. \nDon't think we don't see that stuff, why is it always \"Why do women stay with bad men\"? Why is it never the actual man's fault? This person is desperately reaching out for help and your response is to condescend instead of offering any real advice. Zero regard for how difficult it is for women to leave abusers when they are economically trapped, zero wish to help, zero compassion and finally, zero understanding of systemic misogyny and how it affects the lived experience of all women. You should be ashamed of yourself.", "created_utc": "1664330807.0", "edited": "False", "id": "iq6p7a7", "is_submitter": "False", "link_id": "t3_xpkevq", "parent_id": "t1_iq6l9e9", "score": "-2", "subreddit": "relationship_advice", "subreddit_id": "t5_2r0cn"}, {"author": "Dysphoriented", "body": "Seemed trendy at the time.", "created_utc": "1664318191.0", "edited": "False", "id": "iq5y4fq", "is_submitter": "False", "link_id": "t3_xpswuo", "parent_id": "t3_xpswuo", "score": "29", "subreddit": "vegan", "subreddit_id": "t5_2qhpm"}, {"author": "Dysphoriented", "body": "No one is doing surgery on trans children, that's a lie made up by right wing bigots. What is actually happening is that we give completely reversible puberty blockers to trans children. Something that's statistically proven to lower suicide rates of trans adults by around 93%, anything else is fearmongering propaganda.", "created_utc": "1664296973.0", "edited": "False", "id": "iq4g78s", "is_submitter": "False", "link_id": "t3_xpix0q", "parent_id": "t3_xpix0q", "score": "1", "subreddit": "trans", "subreddit_id": "t5_2shbb"}, {"author": "Dysphoriented", "body": "Xillia 1 and 2 are fantastic.", "created_utc": "1664285379.0", "edited": "False", "id": "iq3o0im", "is_submitter": "False", "link_id": "t3_xp76mv", "parent_id": "t3_xp76mv", "score": "3", "subreddit": "JRPG", "subreddit_id": "t5_2quw1"}, {"author": "Dysphoriented", "body": "Some games come with gifts, for example, Thronebreaker Witcher Tales comes with a free copy of Witcher Enhanced Edition, which will appear as a gift in your inventory.", "created_utc": "1664245218.0", "edited": "False", "id": "iq1zb2n", "is_submitter": "False", "link_id": "t3_xp17mb", "parent_id": "t3_xp17mb", "score": "4", "subreddit": "Steam", "subreddit_id": "t5_2qwis"}, {"author": "Dysphoriented", "body": "Of course it is okay, you dont have to have dysphoria to be trans. The limits of your identity can only be set by you, that is what is so beautiful about it.You are in charge of who you want to be, no matter what people will tell you.Your identity only has to make sense to you.", "created_utc": "1664236086.0", "edited": "1664241756.0", "id": "iq1f326", "is_submitter": "False", "link_id": "t3_xooieq", "parent_id": "t3_xooieq", "score": "2", "subreddit": "trans", "subreddit_id": "t5_2shbb"}, {"author": "Dysphoriented", "body": "The flag of the Aboriginal people of Australia.", "created_utc": "1664226276.0", "edited": "False", "id": "iq0sbza", "is_submitter": "False", "link_id": "t3_xohhu0", "parent_id": "t3_xohhu0", "score": "2", "subreddit": "vexillology", "subreddit_id": "t5_2rygj"}, {"author": "Dysphoriented", "body": "Eduardo Galeano fits this bill better than anyone. Pretty much anything he wrote.  \nI recommend Mirrors: Stories of Everyone, his writing, even though it is political, is absolutely sublime as poetry, too.", "created_utc": "1664226087.0", "edited": "False", "id": "iq0ruo5", "is_submitter": "False", "link_id": "t3_xopyiq", "parent_id": "t3_xopyiq", "score": "3", "subreddit": "literature", "subreddit_id": "t5_2qhps"}, {"author": "Dysphoriented", "body": "Anarcho-capitalists arent anarchists, much like how modern day libertarians arent real libertarians. They are simply branding themselves as such in order to legitimise themselves within a certain sphere. The problem with right wing ideology is its obsession with hierarchy and \"human nature\". It posits that things that are natural must be good and therefore the \"natural state of things\" is good. it fundamentally misunderstands the relationship between people both on a micro and macro level. Therefore it is insufficient in liberating people.   \n\n\nI personally think less of Liberals than Conservatives because historically liberals have been the ones who align with fascists but it is important to remember that they create the breeding ground for fascism to rise. Capitalism in decay is what brings about fascism.", "created_utc": "1664201685.0", "edited": "False", "id": "ipz17nk", "is_submitter": "False", "link_id": "t3_xojr3w", "parent_id": "t3_xojr3w", "score": "48", "subreddit": "Anarchy101", "subreddit_id": "t5_2s960"}, {"author": "Dysphoriented", "body": "While the game is functional now, I still think we should learn from what happened with this game and many others, i.e Halo Master Chief Collection, Battlefield V and others.  \nIt should be unacceptable to launch a game in the state these games were in and we should not make excuses.", "created_utc": "1664201348.0", "edited": "False", "id": "ipz0fhs", "is_submitter": "False", "link_id": "t3_xofmmp", "parent_id": "t3_xofmmp", "score": "1", "subreddit": "cyberpunkgame", "subreddit_id": "t5_3az7x"}, {"author": "Dysphoriented", "body": "I appreciate the added nuance! thank you.", "created_utc": "1664151084.0", "edited": "False", "id": "ipwqw7s", "is_submitter": "False", "link_id": "t3_xntxrs", "parent_id": "t1_ipwq1ei", "score": "9", "subreddit": "communism", "subreddit_id": "t5_2qolz"}, {"author": "Dysphoriented", "body": "It looks like it not reading the disc is the least of your problems.", "created_utc": "1664148341.0", "edited": "False", "id": "ipwl3zd", "is_submitter": "False", "link_id": "t3_xo0uds", "parent_id": "t3_xo0uds", "score": "1", "subreddit": "playstation", "subreddit_id": "t5_2qh6b"}, {"author": "Dysphoriented", "body": "Personally, I think of the Dead Space games a lot like how I think of the Alien franchise.\n\n\\- Dead Space/Alien - Great Scifi Horror- Dead Space 2/Aliens   \n\\- Terrible Dead Space/Alien installment, but fantastic Action.  \n\\- Dead Space 3/Alien Resurrection - I refuse to even acknowledge it exists.", "created_utc": "1664142938.0", "edited": "1664143516.0", "id": "ipw8xvb", "is_submitter": "False", "link_id": "t3_xnwhia", "parent_id": "t3_xnwhia", "score": "-2", "subreddit": "DeadSpace", "subreddit_id": "t5_2r5qf"}, {"author": "Dysphoriented", "body": "I think anarchists can learn from his example, but Jose Carlos Mariategui is a better source of learning imo, as he tried to combine communism with indigenous practice to create an \"indigenous communism\" that resembled anarchism in many ways.", "created_utc": "1664142411.0", "edited": "False", "id": "ipw7pef", "is_submitter": "False", "link_id": "t3_xnylbt", "parent_id": "t3_xnylbt", "score": "136", "subreddit": "Anarchy101", "subreddit_id": "t5_2s960"}, {"author": "Dysphoriented", "body": "Here is one: [https://www.businessinsider.com/a-north-korean-gulag-survivor-admits-he-lied-in-his-best-selling-book-2015-1](https://www.businessinsider.com/a-north-korean-gulag-survivor-admits-he-lied-in-his-best-selling-book-2015-1)  \n\n\nAnd here is an article about it, by The Guardian lol, even they have understood that the amount of money the \"defectors\" get paid for a grandiose tale has incentivized lying. \n\n[https://www.theguardian.com/world/2015/oct/13/why-do-north-korean-defector-testimonies-so-often-fall-apart](https://www.theguardian.com/world/2015/oct/13/why-do-north-korean-defector-testimonies-so-often-fall-apart)", "created_utc": "1664141570.0", "edited": "False", "id": "ipw5pfp", "is_submitter": "False", "link_id": "t3_xntxrs", "parent_id": "t1_ipw2rl7", "score": "19", "subreddit": "communism", "subreddit_id": "t5_2qolz"}, {"author": "Dysphoriented", "body": "In the case of North Korea, many of the defectors have later admitted that they lied for profit.   \nThis is because an interview with a regular story does not get you as much /hour as one with countless human rights violations.", "created_utc": "1664128440.0", "edited": "False", "id": "ipv73um", "is_submitter": "False", "link_id": "t3_xntxrs", "parent_id": "t3_xntxrs", "score": "75", "subreddit": "communism", "subreddit_id": "t5_2qolz"}, {"author": "Dysphoriented", "body": "Seychelles, it is one of the most unique flags.", "created_utc": "1664051639.0", "edited": "False", "id": "iprcgbf", "is_submitter": "False", "link_id": "t3_xn0p59", "parent_id": "t3_xn0p59", "score": "6", "subreddit": "vexillology", "subreddit_id": "t5_2rygj"}, {"author": "Dysphoriented", "body": "Loved Ni No Kuni, All together the Trails of Cold Steel games rival almost any JRPG that isnt Final Fantasy in the modern era. For Tales, I suggest Zesteria and Berseria together because you will be rewarded for paying attention in the first, other than that Xillia is a good one, Destiny, and my favorite Rebirth.", "created_utc": "1663954291.0", "edited": "False", "id": "ipmauis", "is_submitter": "False", "link_id": "t3_xlt2rt", "parent_id": "t1_ipm7924", "score": "1", "subreddit": "JRPG", "subreddit_id": "t5_2quw1"}, {"author": "Dysphoriented", "body": "The US Killed millions in the region during the 70s, funded Pinochet, aided nazis during their escape to latin america, funded dictators in both central america and the carribean, and has actively funded or organised at least 34 coup attemps (successful or otherwise) in the region, which are ongoing to this day, if there is ever going to be peace, all the heavy lifting will have to come from the US. in 2019 they couped Bolivia and in 2021 they tried to coup Venezuela.   \n\n\nIf there is ever going to be any kind of peace, the US will have to \\*stop\\* trying to intervene constantly in the region. All the bad blood comes from them.", "created_utc": "1663954135.0", "edited": "False", "id": "ipmahhn", "is_submitter": "False", "link_id": "t3_xlessd", "parent_id": "t3_xlessd", "score": "1", "subreddit": "asklatinamerica", "subreddit_id": "t5_fda8k"}, {"author": "Dysphoriented", "body": "Ni No Kuni, Trails Series and Tales of series.", "created_utc": "1663944807.0", "edited": "False", "id": "iplpk48", "is_submitter": "False", "link_id": "t3_xlt2rt", "parent_id": "t3_xlt2rt", "score": "1", "subreddit": "JRPG", "subreddit_id": "t5_2quw1"}, {"author": "Dysphoriented", "body": "Har aldrig i mitt liv sett en liberal så glad i att slicka fascisternas skor. Skamligt.", "created_utc": "1663419832.0", "edited": "False", "id": "iosj18h", "is_submitter": "False", "link_id": "t3_xftos4", "parent_id": "t3_xftos4", "score": "1", "subreddit": "svenskpolitik", "subreddit_id": "t5_2twun"}, {"author": "Dysphoriented", "body": "The only person that can set the limits of your identity is you.", "created_utc": "1662920283.0", "edited": "False", "id": "io0ovmz", "is_submitter": "False", "link_id": "t3_xbo327", "parent_id": "t3_xbo327", "score": "5", "subreddit": "trans", "subreddit_id": "t5_2shbb"}, {"author": "Dysphoriented", "body": "The highest I use is 128GB and it works fine, most people settle for 64GB and the theoretical highest is 2TB with a dual adapter but it would take ten minutes to load the game list.", "created_utc": "1662920112.0", "edited": "False", "id": "io0odso", "is_submitter": "False", "link_id": "t3_xbbj08", "parent_id": "t1_io0o06a", "score": "1", "subreddit": "PSP", "subreddit_id": "t5_2qjts"}, {"author": "Dysphoriented", "body": "That is odd, it suggests to me that it isn't a bad ISO but rather that it is something on the system itself that is wrong.", "created_utc": "1662906405.0", "edited": "False", "id": "inzov6i", "is_submitter": "False", "link_id": "t3_xbbj08", "parent_id": "t1_inzo2uv", "score": "1", "subreddit": "PSP", "subreddit_id": "t5_2qjts"}, {"author": "Dysphoriented", "body": "You can be both, but in truth, you can be whatever and whoever you want to be. Your identity is in your hands and your hands alone.", "created_utc": "1662902861.0", "edited": "False", "id": "inzg940", "is_submitter": "False", "link_id": "t3_xbdd6c", "parent_id": "t3_xbdd6c", "score": "2", "subreddit": "NonBinary", "subreddit_id": "t5_2vcez"}, {"author": "Dysphoriented", "body": "Make sure you put them in the correct folder.", "created_utc": "1662900664.0", "edited": "False", "id": "inzbtfn", "is_submitter": "False", "link_id": "t3_xbbj08", "parent_id": "t3_xbbj08", "score": "1", "subreddit": "PSP", "subreddit_id": "t5_2qjts"}, {"author": "Dysphoriented", "body": "Sounds like terfs", "created_utc": "1662900578.0", "edited": "False", "id": "inzbn4a", "is_submitter": "False", "link_id": "t3_xau9xw", "parent_id": "t3_xau9xw", "score": "1", "subreddit": "trans", "subreddit_id": "t5_2shbb"}, {"author": "Dysphoriented", "body": "Absolutely not, it along with Berseria and the duality between them is arguably one of my favourite parts of the whole franchise.", "created_utc": "1662899732.0", "edited": "1662901488.0", "id": "inz9zov", "is_submitter": "False", "link_id": "t3_xbgdrz", "parent_id": "t3_xbgdrz", "score": "18", "subreddit": "JRPG", "subreddit_id": "t5_2quw1"}, {"author": "Dysphoriented", "body": "Does Nonary Games count? They are all about things like that.", "created_utc": "1662899609.0", "edited": "False", "id": "inz9rfb", "is_submitter": "False", "link_id": "t3_xb6hqd", "parent_id": "t3_xb6hqd", "score": "1", "subreddit": "visualnovels", "subreddit_id": "t5_2r5yf"}, {"author": "Dysphoriented", "body": "Because we represent the breaking of the obsolete power systems. Our existence is a revolutionary act. We oppose everything that so many have just accepted as truth until now. We threaten their comfort and they know we will not stop until we have the right to be who we want to be.", "created_utc": "1662899568.0", "edited": "False", "id": "inz9ohs", "is_submitter": "False", "link_id": "t3_xbce2n", "parent_id": "t3_xbce2n", "score": "13", "subreddit": "NonBinary", "subreddit_id": "t5_2vcez"}, {"author": "Dysphoriented", "body": "As I see it, the only real problem with socialism or anarchism is that because of the capitalist hegemony, it will always be toppled eventually, which is why I prefer the more grassroots ideas of for example Trotsky that suggested a state of permanent revolution. Obviously I don't think communism is enough but the core idea of his concept is something that anarchist orgs would have use for.", "created_utc": "1662899434.0", "edited": "False", "id": "inz9f2w", "is_submitter": "False", "link_id": "t3_xbc0w2", "parent_id": "t3_xbc0w2", "score": "1", "subreddit": "Anarchy101", "subreddit_id": "t5_2s960"}, {"author": "Dysphoriented", "body": "J.K Rowling because anything she writes is creatively bankrupt and only serves to reinforce the status quo.", "created_utc": "1662899220.0", "edited": "False", "id": "inz9122", "is_submitter": "False", "link_id": "t3_xaz9hx", "parent_id": "t3_xaz9hx", "score": "4", "subreddit": "books", "subreddit_id": "t5_2qh4i"}, {"author": "Dysphoriented", "body": "If your position is that all definitions are made up, i.e \"there is no correct definition of a word, because in order for me to provide such a thing, I need a system of distinguishing between correct and incorrect definitions in the first place. In other words, I need a correct definition for the term “correct definition”, and thus the very claim to have absolute knowledge over semantic correctness is circular reasoning.\" then why do you cling onto the biological definition of sex, when the only logical conclusion is that sex, too, just like gender, is made up in order to categorise?", "created_utc": "1662730048.0", "edited": "False", "id": "inq2xpo", "is_submitter": "False", "link_id": "t3_x9oyfh", "parent_id": "t3_x9oyfh", "score": "15", "subreddit": "zizek", "subreddit_id": "t5_2s3h6"}, {"author": "Dysphoriented", "body": "I would suggest that you play Parasite Eve and Parasite Eve II if you haven't already as those are the first two in that series. If you've already played them, try Dino Crisis and it's sequel. Personally what I liked so much about Parasite Eve was that it kind of blended RPG elements with Resident Evil action.", "created_utc": "1662381413.0", "edited": "False", "id": "in6drp7", "is_submitter": "False", "link_id": "t3_x65wlc", "parent_id": "t3_x65wlc", "score": "1", "subreddit": "PSP", "subreddit_id": "t5_2qjts"}, {"author": "Dysphoriented", "body": "You are shifting the blame onto individuals, i.e, you want people to stop complaining, but you do not think about why people complain. The problem is systemic, not individual.   \nCapitalism has made the industry stagnate to the point where everyone is too complacent to understand that anything released that is better than far cry isnt a masterpiece.   \n\n\nCyberpunk was horribly broken at launch and it was sold to us with false promises, it deserved all the critique it got. They have finally started fixing it but it should have been released in a state that was playable, and for most it just wasnt.   \n\n\nHorizon Forbidden West stagnates because it doesnt attempt to evolve on any concepts that were created in the original. While it is true that more of the same can be good too, my belief is that any sequel should try to innovate and expand upon the concept created in the original game.   \n\n\nElden Ring has this problem, Breath of the Wild has this problem, Red Dead Redemption 2 has this problem. People need to stop excusing mediocrity.   \n\n\nElden Ring is just Dark Souls in an open world, its not that special, Sekiro and Bloodborne took the concept of the original and expanded on it. That is actual innovation. Calling Elden Ring an \"unparalleled masterpiece\" is an insult to any kind of creativity.   \n\n\nBreath of the Wild is empty and soulless, it is the bare minimum of what a Zelda game is and almost every single Zelda game that came before it did what it does but better.   \n\n\nThings arent masterpieces just because you get an open world to play around in because the open world is ultimately worthless if its padded to the brim with pointless side fluff.  \n\n\nRed Dead Redemption 2 is essentially the same exact story as Red Dead Redemption, with a different character and less compelling. I think praising it is a mistake because it is way worse than its predecessor.  \n\n\nSports games are extremely predatory in nature and therefore the critique there is also justified.    \n\n\nI think you are looking at the wrong thing, you think people that complain are annoying (its clear from your post) but you havent given a thought to why they are or whether or not it is legitimate. Which I think it is.  \n\n\nIt's likely due to the amount of critique I just levied against all these popular games, that I will get some sort of question along the lines of \"What do you even like then?\" so I can address that.   \n\n\nSome of my favorite games are those that break the mold of what a game is meant to be.   \n\n\nDeath Stranding is one of the best games I have ever played and one that I would be okay with calling a masterpiece. Pathologic made me think about the nature of human existence, Nier Automata made me think about what it truly means to have a soul and the original Deus Ex showed me what real creativity looks like in terms of level design.   \n\n\nThe industry can and should do better and we shouldn't be okay with the way it has been lately.", "created_utc": "1651389694.0", "edited": "False", "id": "i6vqisa", "is_submitter": "False", "link_id": "t3_ufto3c", "parent_id": "t3_ufto3c", "score": "-3", "subreddit": "gaming", "subreddit_id": "t5_2qh03"}, {"author": "Dysphoriented", "body": "I see a lot of people talk about how it is absurd to blame the consumers that keep buying the games because the real problem is Rockstar or the actual company with their predatory practices. While this is obviously true, that disregards part of the analysis, likely because people do not want to accept that they are part of the problem. We see this all the time in contemporary society as well, the pivot from systemic to individual.  \nIt is easier to say it is the company itself (which would mean it is the high ups who simply want profit) than to admit all of us play a part in normalising these practices. Much like we do within capitalism. Let me explain what I mean.   \n\n\nLiberalism, the current hegemonic power structure within society, innately necessitates a certain level of apathy and complacency in order to function. This manifests itself in many different ways but one of them is the constant beating down of the population through means of violent propaganda. From the day we are born until the day we die, we are taught to view everything through an individual lens. School shootings? Bad people will always be able to get their hands on guns. The system is intrinsically unfair for those who are disadvantaged? They simply arent trying hard enough. Any systemic issue always becomes individual within this framework because the status quo must be maintained at all costs.  \n\n\nWhile it is true that corporations that are greedy are the main problem, much like how the working class has been misled into voting against their own interests for the past two decades globally, the truth is that companies within the video game industry employ similar if not exactly the same strategy to beat gamers down into accepting mediocrity in games or sub-par conditions. I am reminded of a discussion I had with a friend where they admitted Call of Duty is not a very good franchise because the companies behind it try to constantly screw the playerbase over by implementing more and more features that are predatory in nature.   \n\n\nThink of the frog in a blender, just like corporate capitalism tries to find the perfect balance between screwing over the working class just enough so that the company gets the most amount of profit while keeping the workers from revolting, so does video game companies.   \nFirst it was microtransactions, then it was loot crates, then it was season passes, then multiple season passes. People cried out in anger and sometimes rarely \"won\" to the point where companies would change their practices, but only for that one game, the next iteration the practices were back. They want to normalise the practices to the point where we become so apathetic to their marketing and their practices that we accept it as normal part of playing video games.  \n\n\nTo this end players and companies exist in a symbiosis with each other. Even if unwittingly, we still help normalise the practices when we buy the same CoD or FIFA every year filled with predatory practices. The internalised apathy and complacency is just part of a larger scheme and much like with the rights of the working class, the most important thing to combat the dreadful companies is to teach people about this relationship to an extent where they understand that the power is within them as a collective. If they all agree not to buy a game, companies will lose out to such an extent that they are forced to adapt and we have seen this happen multiple times within the video game industry.  \n\n\nMany people will not believe this but we do have the power to change companies. Just look at any time something is trendy, motion controls or battle royale. Why do you think even Call of Duty jumped on the bandwagon that was battle royale? Because it was deemed to be profitable. Companies are drawn to do what is profitable and it is only through mass-complacency that things keep getting worse and worse. If everyone rises up against the tide, we could attain real change, just like the working class could in a larger societal context.   \n\n\nTLDR; The power is within all of us and only together are we powerful enough to provoke change.", "created_utc": "1648431989.0", "edited": "False", "id": "i2dwysl", "is_submitter": "False", "link_id": "t3_tnznc1", "parent_id": "t3_tnznc1", "score": "3", "subreddit": "truegaming", "subreddit_id": "t5_2sgq6"}]