[{"author": "Earthisacultureshock", "body": "Yes, this is what they don't know. Even if you watch only TV and you watch only the available free 12 channels, you still have RTL news.", "created_utc": "1665527858.0", "edited": "False", "id": "iry849x", "is_submitter": "False", "link_id": "t3_y128aq", "parent_id": "t1_iry5t1l", "score": "3", "subreddit": "2visegrad4you", "subreddit_id": "t5_427he1"}, {"author": "Earthisacultureshock", "body": "And many of them just can't get that", "created_utc": "1665527209.0", "edited": "False", "id": "iry6pfk", "is_submitter": "False", "link_id": "t3_y128aq", "parent_id": "t1_irv5q65", "score": "2", "subreddit": "2visegrad4you", "subreddit_id": "t5_427he1"}, {"author": "Earthisacultureshock", "body": "Those are so downvoted as if they had never existed. It's the same when you are trying to tell the brainwashed type of Fidesz voter that Orbán isn't a God.\n\nEdit: Grammar", "created_utc": "1665527137.0", "edited": "1665527597.0", "id": "iry6jle", "is_submitter": "False", "link_id": "t3_y128aq", "parent_id": "t1_irv31zx", "score": "1", "subreddit": "2visegrad4you", "subreddit_id": "t5_427he1"}, {"author": "Earthisacultureshock", "body": "One of my favorite threads was when someone asked if in villages people really can only see governmental TV channels, can only read governmental daily newspapers and most of them have no internet (and thus can't meet oppositional viewpoints). It's okay to ask rather than spread false myths, but it's just so saddening that there are people, who think villagers are living in the 50s (and it's even more saddening that many of these people are sure about them being the educated, the enlightened).", "created_utc": "1665526383.0", "edited": "False", "id": "iry4vha", "is_submitter": "False", "link_id": "t3_y128aq", "parent_id": "t1_irvbk3d", "score": "2", "subreddit": "2visegrad4you", "subreddit_id": "t5_427he1"}, {"author": "Earthisacultureshock", "body": ">Literally just look around yourself and it's self evident he should fuck off.\n\nMy eyes are probably lost and my ears are probably cut off, because I know Fidesz supporters from my little village, from a large rural town, and from Budapest - and the same can be said for opposition supporters. Regardless of their political views, some of them are just downright idiots, while others aren't.", "created_utc": "1665525993.0", "edited": "False", "id": "iry3zut", "is_submitter": "False", "link_id": "t3_y128aq", "parent_id": "t1_irva1jq", "score": "2", "subreddit": "2visegrad4you", "subreddit_id": "t5_427he1"}, {"author": "Earthisacultureshock", "body": "It's funny that you mention programmers, because in r/hungary a loud crowd tends to work in IT and be proud of it, and they despise everyone if they have a different job or plan to have.", "created_utc": "1665525697.0", "edited": "False", "id": "iry3bdp", "is_submitter": "False", "link_id": "t3_y128aq", "parent_id": "t1_irv3znf", "score": "7", "subreddit": "2visegrad4you", "subreddit_id": "t5_427he1"}, {"author": "Earthisacultureshock", "body": "I feel the same, I don't really feel I can support any party. Sometimes I'm even ashamed of being a right winger, because many associates me with a brainwashed Fidesz or Mi Hazánk supporter. But at the same time, I'm afraid of criticizing the Fidesz, because I will be immediately grouped together with those r/hungary posters.", "created_utc": "1665525350.0", "edited": "False", "id": "iry2ikf", "is_submitter": "False", "link_id": "t3_y128aq", "parent_id": "t1_irv91cz", "score": "5", "subreddit": "2visegrad4you", "subreddit_id": "t5_427he1"}, {"author": "Earthisacultureshock", "body": "I think it's not really about Kárpátia, it's rather that their audience is associated with far-right nationalism, thus when Kárpátia is mentioned, people think of far-right nationalists.", "created_utc": "1665524999.0", "edited": "False", "id": "iry1opw", "is_submitter": "False", "link_id": "t3_y128aq", "parent_id": "t1_irvvw8f", "score": "1", "subreddit": "2visegrad4you", "subreddit_id": "t5_427he1"}, {"author": "Earthisacultureshock", "body": "Actually, I didn't catch this mistake, when I read the post either. So I guess present continuous felt natural. I just thought about it, when I saw the corrections.", "created_utc": "1665217173.0", "edited": "False", "id": "irhw8r6", "is_submitter": "False", "link_id": "t3_xxuj4r", "parent_id": "t1_irge301", "score": "1", "subreddit": "EnglishLearning", "subreddit_id": "t5_2u8ap"}, {"author": "Earthisacultureshock", "body": ">It's like they're obsessed with race.\n\nOftentimes, I just can't understand why they trace back everything, literally everything to race issues. Whenever there is a problem, or something unjust happens, it's always because of racism. It didn't even come to my mind relating to that random news but I just see that it happened because blacks are suppressed and Asians are hated. Yeah, definitely.", "created_utc": "1665179441.0", "edited": "False", "id": "irgasq4", "is_submitter": "False", "link_id": "t3_xy0fun", "parent_id": "t1_irg0cbc", "score": "5", "subreddit": "asklatinamerica", "subreddit_id": "t5_fda8k"}, {"author": "Earthisacultureshock", "body": "Isn't \"I go\" right because it refers to a kind of always true action, thus we need to use present simple?", "created_utc": "1665177736.0", "edited": "False", "id": "irg7c3j", "is_submitter": "False", "link_id": "t3_xxuj4r", "parent_id": "t1_irf9tu9", "score": "1", "subreddit": "EnglishLearning", "subreddit_id": "t5_2u8ap"}, {"author": "Earthisacultureshock", "body": "Nothing came to my mind immediately, but I would say when the \"speech of Őszöd\" was released (2006). In a closed party conference the prime minister (Ferenc Gyurcsány) made a speech about how they had fucked up everything, had done nothing and had lied in the morning, at noon, and in the evening. It was a huge scandal when it was released, the state television and the radio channels broadcasted it, then violent protests broke out. I was too young to have memories, but a lot of people I have talked to said they remembered where they had been when they had heard it first.", "created_utc": "1665127473.0", "edited": "False", "id": "irdpi5p", "is_submitter": "False", "link_id": "t3_xxjfce", "parent_id": "t3_xxjfce", "score": "8", "subreddit": "AskEurope", "subreddit_id": "t5_2uayg"}, {"author": "Earthisacultureshock", "body": "That's why I try to maintain a reputation of someone who is in her little dream world all the time and doesn't notice people around her. It's somewhat true, I really tend to not realize what's going on around me, but if a situation like that happened, it would be believable to say that I didn't see them. Or at least I try to make myself believe that.", "created_utc": "1663108327.0", "edited": "False", "id": "iobhwod", "is_submitter": "False", "link_id": "t3_xd6p8e", "parent_id": "t1_io9sjwd", "score": "3", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "Earthisacultureshock", "body": "Or everyone will answer completely differently and it will be super embarrassing. It happened to me.", "created_utc": "1663107742.0", "edited": "False", "id": "iobgiwm", "is_submitter": "False", "link_id": "t3_xd6p8e", "parent_id": "t1_io95hpn", "score": "2", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "Earthisacultureshock", "body": "North of me is Slovakia. Still an EU country but less hated, at least as developed as Hungary if not slightly more. There's a Hungarian minority so I wouldn't have to say good bye to speak in my native language, but as I love slavic languages I wouldn't mind to learn Slovakian, too.", "created_utc": "1663012583.0", "edited": "False", "id": "io5xcow", "is_submitter": "False", "link_id": "t3_xcebho", "parent_id": "t3_xcebho", "score": "1", "subreddit": "polls", "subreddit_id": "t5_2qh65"}, {"author": "Earthisacultureshock", "body": "To sign up for RTL Most you don't have to have a Hungarian TV subscription, you only have to give an e-mail and a password when you register. However, I don't know if it is possible to sign up and sign in from a different country, I haven't tried that", "created_utc": "1661326908.0", "edited": "False", "id": "ilkey08", "is_submitter": "False", "link_id": "t3_ww7k2s", "parent_id": "t3_ww7k2s", "score": "5", "subreddit": "hungarian", "subreddit_id": "t5_2xeuq"}, {"author": "Earthisacultureshock", "body": "In Hungarian, if we take the color orange, it's also a shade of yellow. Orange is narancssárga, which literally translates 'orange yellow'. Yellow is simply sárga, or if we want to emphasize that it is not orange we can say citromsárga, literally meaning 'lemon yellow\".\n\nPink is compered to the color of roses. Idk why. The word is rózsaszín, which would translate as 'rose color'. \n\nWe have two different reds. One is piros, which is a lighter red and the other one is vörös, which is a stronger red (it has the same root as the word for blood).", "created_utc": "1661036275.0", "edited": "False", "id": "il4i302", "is_submitter": "False", "link_id": "t3_wtf972", "parent_id": "t3_wtf972", "score": "9", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Earthisacultureshock", "body": "It's so interesting, that the Finnish word \"Kukka\" means flower and can be a name of a girl, and meanwhile in Hungarian we have a similar sounding word, \"kuka\", which actually means dustbin", "created_utc": "1660600429.0", "edited": "False", "id": "ikfty0h", "is_submitter": "False", "link_id": "t3_wnwprq", "parent_id": "t1_ik87v9g", "score": "1", "subreddit": "AskEurope", "subreddit_id": "t5_2uayg"}, {"author": "Earthisacultureshock", "body": "\"Пища\" sounds similar to the Hungarian word \"pisa\" (\"s\" pronounced as \"sh\"), which is a slang word for pee", "created_utc": "1660599631.0", "edited": "False", "id": "ikfryvr", "is_submitter": "False", "link_id": "t3_wo95k3", "parent_id": "t1_ika6k0m", "score": "1", "subreddit": "AskEurope", "subreddit_id": "t5_2uayg"}, {"author": "Earthisacultureshock", "body": "I agree, the acceptable period is between something like 10 min early and 10 mins late. And 20 mins late would be not only rude but it would be worrying as well (at least, whenever someone was that late, people thought they had a car crash, or they were kindnapped, or something terrible happened).", "created_utc": "1660156696.0", "edited": "False", "id": "ijr4kwq", "is_submitter": "False", "link_id": "t3_whtk2t", "parent_id": "t1_ij7tmfy", "score": "1", "subreddit": "AskEurope", "subreddit_id": "t5_2uayg"}, {"author": "Earthisacultureshock", "body": "I did that with YouTube, and it's quite funny that now on my second profile YouTube shows me Russian ads, that want to teach me English.", "created_utc": "1659039410.0", "edited": "False", "id": "ii1b3rg", "is_submitter": "False", "link_id": "t3_wa66vy", "parent_id": "t1_ihzoh3u", "score": "8", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Earthisacultureshock", "body": "Then, I'm pretty patient with my three months. Maybe it's better to forget words that way, than realizing after seemingly endless hours of repetition that I still can't recognize the word outside Anki (even though I put context on my flashcards). My main problem with Anki is that it takes too much time. I don't want to spend hours of my day creating my flashcards and pushing squares over and over again.", "created_utc": "1658446713.0", "edited": "False", "id": "ih4crng", "is_submitter": "True", "link_id": "t3_w4trey", "parent_id": "t1_ih47saa", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Earthisacultureshock", "body": "I'm gonna look that up!", "created_utc": "1658446029.0", "edited": "False", "id": "ih4b771", "is_submitter": "True", "link_id": "t3_w4trey", "parent_id": "t1_ih45lhm", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Earthisacultureshock", "body": ">if you’re not enjoying you’re studies it can be worthwhile to go less intensive with your studies and focus on other things for a while\n\nI've actually tried that, it has worked but I don't want to skip one or two months regularly - especially that recently I want to skip every other week. Maybe it's a wrong approach, I should step back and take a break again.\n\n&#x200B;\n\n>it can be worth researching learning materials or methods you might enjoy more, or more goals in the language you’re eager to work towards\n\nYou might be right, I didn't focus on the right thing and I couldn't see the forest for the trees. I should put ahead more of the methods I enjoy and research some new stuff (I hope I won't end up with too many resources again). As for the goals, I have a really hard time staying real and not having too high expectations or being too abstract. I've rethought them recently, but probably I've ended up on the wrong path. Thanks for the advice!", "created_utc": "1658445736.0", "edited": "False", "id": "ih4aj3k", "is_submitter": "True", "link_id": "t3_w4trey", "parent_id": "t1_ih4506t", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Earthisacultureshock", "body": "You're probably right, I wanted to be too efficient and it made me the least efficient. However, the thing is, that with English, I've already experimented with only listening and reading, and even though I enjoyed that, only very few words stuck and I didn't recognize certain advanced grammar until it was pointed out to me. But I think I will go back to that, because as you said it would have been still better to choose the inefficient way than not to learn my TL. Thanks, I really needed to hear that!", "created_utc": "1658444399.0", "edited": "False", "id": "ih47f3m", "is_submitter": "True", "link_id": "t3_w4trey", "parent_id": "t1_ih44ilc", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Earthisacultureshock", "body": "It still would be interesting to read. Thanks for the essay and the drama!", "created_utc": "1657629060.0", "edited": "False", "id": "ifukm4s", "is_submitter": "False", "link_id": "t3_vwofg3", "parent_id": "t1_ifud0r0", "score": "3", "subreddit": "2visegrad4you", "subreddit_id": "t5_427he1"}, {"author": "Earthisacultureshock", "body": "I've never heard about those, but now I'm curious. Can you name some books?", "created_utc": "1657618441.0", "edited": "False", "id": "ifu52lv", "is_submitter": "False", "link_id": "t3_vwofg3", "parent_id": "t1_iftp6gd", "score": "10", "subreddit": "2visegrad4you", "subreddit_id": "t5_427he1"}, {"author": "Earthisacultureshock", "body": "Csak egy félévet voltam minoron, de teljesen átérzem, amit írtál és ezt olvasva teljesen megnyugodtam, hogy jó döntés volt otthagyni. A sok indokolatlan nyelvészet engem is kiakasztott teljesen, az irodalomig nem jutottam el. A legjobb az volt mellette, hogy a főszakom is nyelvszak volt, ott is ugyanezzel szívattam magam.", "created_utc": "1656196695.0", "edited": "False", "id": "idqnafm", "is_submitter": "False", "link_id": "t3_vkjpki", "parent_id": "t1_idpt9x8", "score": "2", "subreddit": "hungary", "subreddit_id": "t5_2qzzt"}, {"author": "Earthisacultureshock", "body": "Nekem minorom volt az anglisztika (vagyis hát pontosabban az amerikanisztika szakirány), de fél év után ott hagytam, nekem nem jött be.   \n\n\nSzeretik elhallgatni, de nagyon sok a nyelvészet (nyelvszakokon nagyon szeretnek ezzel bombázni, visszasírom a gimis nyelvtanórák érthetőségét). Ha nem bírtad a nyelvtant, a mentális egészséged érdekében ne menj, ha viszont szeretted, akkor ajánlom, mert nagyon sok lelkes nyelvész tanár van, és ha szereted az ilyesmit, akkor érdekesek tudnak lenni az óráik.  \n\n\nKell hozzá egy erős angoltudás, mert az óráid legalább egy része angolul lesz (ezt szerintem egyeteme és tanára válogatja), én nagyon féltem, hogy mi lesz, ha nem értem meg a tanárokat, de egy erős B2-vel nem volt ilyen gondom, ilyen szempontból pozitív csalódás volt.  \n\n\nNem tudom mi a helyzet más egyetemekkel, az SZTE-n vannak ún. \"Language class-ok\" (Use of English, Reading, Writing, stb.), ezek elég szívatos tárgyak, amennyire hallottam sokan buknak rajta. Engem a sírás kerülgetett, amikor közölte a tanár, hogy a zh-ban nem lesznek C1-es szintű feladatok, ilyen könnyűeket csak órán fogunk gyakorolni. Readingen nem voltam, arra panaszkodtak még nagyon, hogy hihetetlen száraz, pepecselős, és mindenbe belekötnek, semmi értelme nincs.   \n\n\nNekünk voltak alapozó tárgyaink az amerikai kultúráról, ott egy nagyon rendes tanárom volt, bár maga az anyag elég változó volt. Egy részét nagyon szerettem, egy teljesen más perspektívából látom azóta az amerikai kultúrát, bizonyos dolgok szinte megvilágosodás szerűen nyertek értelmet vagy szimplán csak érdekes volt bizonyos dolgokról megtudni, hogy ilyen is van. Másrésze viszont elég elvont volt, nem volt könnyű értelmet adni neki.  \n\n\nÉn az irodalmakig és törikig nem jutottam már el, arról nem tudok nyilatkozni.  \n\n\nNem akarlak se lebeszélni, se rábeszélni, szerintem akkor menj, ha érdekel a nyelvészet, az irodalom és a kultúra, de ne bánd azt, ha a nyelvészetet töménytelen mennyiségben a nyakadba fogod kapni. Egy jó angoltudás se árt, mert az óráid egy része tényleg angolul lesz. Itt nem igazán arra mennek, hogy megtanítsanak angolul és csak azért nem érdemes jönni, mert jól beszéled és szereted a nyelvet.", "created_utc": "1656196317.0", "edited": "False", "id": "idqmilf", "is_submitter": "False", "link_id": "t3_vkjpki", "parent_id": "t3_vkjpki", "score": "2", "subreddit": "hungary", "subreddit_id": "t5_2qzzt"}, {"author": "Earthisacultureshock", "body": "I don't know if anyone had written that, but I'd like to learn Mansi. It's one of the closest relatives of my native language (Hungarian), and I'm curious about what it would feel like to finally learn a language that's worldview is said to be close to my native language. However, I just can't find any acceptable resources either in English or Hungarian, I hope, that maybe if my Russian will be better, I will be able to find something in Russian. It doesn't help either, that there are only around 900 to 1000 speakers (even in my village more people live).", "created_utc": "1652301677.0", "edited": "False", "id": "i88dnp5", "is_submitter": "False", "link_id": "t3_un0as1", "parent_id": "t3_un0as1", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Earthisacultureshock", "body": "In Hungarian, the letter \"s\" is read as \"sh\" [ʃ] and we use \"sz\" for the sound s ([s]). It's completely fine, while we are talking about Hungarian words, but it's really confusing, when we have to read out loud foreign words and we don't know whether the s means sh or s.\n\n\nAnother things is, that we conjugate our verbs differently, based on whether the object is definite or not.\n\nKommentet írok. / Egy kommentet írok. = I write a comment (indefinite conjugation)\nÍrom a kommentet. = I write the comment (definite conjugation)\n\n\nTo talk about that \"He/she is [adjective or profession]\" we don't use the conjugated form of to be. But in every other numbers and persons we do use the conjugated form of to be. For example:\nŐ orvos. = He/she is a doctor.\nÉn orvos vagyok. = I'm a doctor.\nTe orvos vagy. = You're a doctor.\nAs a native speaker, I don't undetstand why is that.", "created_utc": "1651415487.0", "edited": "False", "id": "i6wq2e4", "is_submitter": "False", "link_id": "t3_uffbbv", "parent_id": "t3_uffbbv", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Earthisacultureshock", "body": "De, legalább annyinak kell rendelkezésre állnia, mint október 15-én.", "created_utc": "1651349407.0", "edited": "False", "id": "i6tsnfg", "is_submitter": "False", "link_id": "t3_uf7xtt", "parent_id": "t1_i6ti3m4", "score": "2", "subreddit": "hungary", "subreddit_id": "t5_2qzzt"}, {"author": "Earthisacultureshock", "body": "Nem járok se edzőterembe, se sportklubba", "created_utc": "1651251813.0", "edited": "False", "id": "i6oriiu", "is_submitter": "False", "link_id": "t3_uej6cf", "parent_id": "t1_i6nq2q3", "score": "1", "subreddit": "hungary", "subreddit_id": "t5_2qzzt"}, {"author": "Earthisacultureshock", "body": "Családon belül nálunk anyukámat nem zavarja a meztelenkedés, ő nyitott ajtónál fürdik, ha olyanja van, egy száll semmiben sétál ki a fürdőszobából, vagy nyitva hagyja a wc ajtót. Apánál már más a helyzet, őt nem emlékszem, hogy valaha is láttam volna meztelenül, egy alsónadrág vagy fürdőnadrág minimum van rajta. Kicsiként volt, hogy együtt fürödtem anyával (apával soha, de talán volt, hogy ő is fürdetett, vagy beszélgettünk, miközben fürödtem), öcsémmel, vagy unokatesómmal (nincs nagy korkülönbség). Kisgyerekként nem voltam ilyen, ez fokozatosan alakult ki, 11-12 évesen nem kezdtem már el család előtt felöltözni reggel. Most már viszont nem tudom miért, de engem egyszerűen csak zavar, ha előttem meztelenkednek, én még fehérneműben se vagyok szívesen anyám előtt (bikinit se hordok, mielőtt valaki felveti, hogy ugyanaz). Emiatt engem nagyon zavarna az is, ha zuhanyzás közben bejönne bárki. Csak ne és kész.", "created_utc": "1651233465.0", "edited": "False", "id": "i6nlsry", "is_submitter": "False", "link_id": "t3_uej6cf", "parent_id": "t3_uej6cf", "score": "3", "subreddit": "hungary", "subreddit_id": "t5_2qzzt"}, {"author": "Earthisacultureshock", "body": "If we are lucky, we have snow in January, but only for a couple of days. When I was a child, in the 2000s, it was snowing in December, and sometimes even at the end of November.", "created_utc": "1651134391.0", "edited": "False", "id": "i6idvoh", "is_submitter": "False", "link_id": "t3_udk5t0", "parent_id": "t3_udk5t0", "score": "2", "subreddit": "AskEasternEurope", "subreddit_id": "t5_3novj2"}, {"author": "Earthisacultureshock", "body": "My native language (Hungarian) has few native speakers, the number of those studying it is even fewer. So, I'm just amazed, when someone even can say a sentence. And I don't think I've ever heard anyone speaking Hungarian with British or American accent.", "created_utc": "1650964749.0", "edited": "False", "id": "i68tbj0", "is_submitter": "False", "link_id": "t3_ubt7kh", "parent_id": "t3_ubt7kh", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Earthisacultureshock", "body": "I think it is optional. The male version is gender neutral, we use that version for most of the professions. For most professions, a female version with -nő would sound forced.\n\nHowever, there are a few exceptions, where can be an optional female version and you might see it quite often.\nSome examples: \n- tanár - tanárnő\n- tanító - tanítónő (the teacher of the pupils in the first four year of elementary school)\n- titkár - titkárnő\n- eladó - eladónő\n- kolléga - kolleganő\n- újsagíró - újságírónő\n- igazgató - igazgatónő\n- színész - színésznő\n- bíró - bírónő\n- író - írónő\n- költő - költőnő\n- énekes - énekesnő\n- pap - papnő\n- pincér - pincérnő\n- festő - festőnő (it's rare, but possible)\n- rendőr - rendőrnő (it's also rare, but possible)\n- doktor - doktornő (only when we address someone, the occupation is orvos)\n- munkás - munkásnő (the female version is possible, but I've only heard it in contexts which were related to the communist era)\n\n\n\nIn some occupations, we use the female version by default - I think because they were traditionally \"typical female\" jobs. \n- nővér (nurse, but we can use ápoló for male-nurses. Instead of nővér, you can say ápolónő, they are synonyms)\n- óvónő (kindergarten teacher - the male version would be óvóbácsi, but there's very few male kindergarten teachers)\n- dajka\n- varrónő (I don't even know if there's a male version)\n\n\nAs for students, for some reason we say diáklány instead of diáknő (diáknő would be logical, though). But diák is also possible if you are a female, maybe it would be even more natural. Diák can be used from elementary school up to university. For university students you can say hallgató, too.", "created_utc": "1650928644.0", "edited": "False", "id": "i671xex", "is_submitter": "False", "link_id": "t3_ubsffd", "parent_id": "t3_ubsffd", "score": "4", "subreddit": "hungarian", "subreddit_id": "t5_2xeuq"}, {"author": "Earthisacultureshock", "body": "Ezt én is csinálom. Szintúgy bárhova megyek, közvetlen az indulás előtt elmegyek wc-re, különben ugyanezen kattogok.", "created_utc": "1650900551.0", "edited": "False", "id": "i65358x", "is_submitter": "False", "link_id": "t3_ubldu1", "parent_id": "t1_i64tt7e", "score": "90", "subreddit": "hungary", "subreddit_id": "t5_2qzzt"}, {"author": "Earthisacultureshock", "body": "I fell in love with the sound of Russian language, I just had to learn it. I'm also interested in Slavic cultures (it would be great to learn other Slavic languages as well) and I'd like to get information about Russia from first hand - not through translations.\n\nEdit: I forgot to mention, but when I started the university, I used to want to be a translator, to which I needed a second foreign language. So, I chose Russian because of the reasons above.", "created_utc": "1650702178.0", "edited": "1650702487.0", "id": "i5utnt7", "is_submitter": "False", "link_id": "t3_u9per4", "parent_id": "t3_u9per4", "score": "7", "subreddit": "AskARussian", "subreddit_id": "t5_2xzpo"}, {"author": "Earthisacultureshock", "body": "Az én ismeretségi körömben a megjött/megvan lett a természetes, úgyhogy leginkább így. Néha közelebbi nő ismerőseimmel egymás szórakoztatására körbeírjuk, pl. hogy a Mikulás úgy döntött áprilisban is meglátogat vagy a szervezetem ismét tudatta velem, hogy nő vagyok.", "created_utc": "1650313583.0", "edited": "False", "id": "i594lwe", "is_submitter": "False", "link_id": "t3_u6hqdv", "parent_id": "t3_u6hqdv", "score": "2", "subreddit": "hungary", "subreddit_id": "t5_2qzzt"}, {"author": "Earthisacultureshock", "body": "remindme! 4 years", "created_utc": "1649922371.0", "edited": "False", "id": "i4oaan7", "is_submitter": "False", "link_id": "t3_u1uah3", "parent_id": "t1_i4ek8tt", "score": "1", "subreddit": "hungary", "subreddit_id": "t5_2qzzt"}, {"author": "Earthisacultureshock", "body": "1. Nem\n2. Igen\n3. Igen (hittan és irodalomóra)\n4. Igen (mint a világirodalom részét, mert szerintem meghatározó része a kultúránknak és pár sztorit, szimbólumot vallásossagtól függetlenül jó, ha ismerünk)", "created_utc": "1649861782.0", "edited": "False", "id": "i4kmdpg", "is_submitter": "False", "link_id": "t3_u2qpgi", "parent_id": "t3_u2qpgi", "score": "1", "subreddit": "hungary", "subreddit_id": "t5_2qzzt"}, {"author": "Earthisacultureshock", "body": "A Fidesz már indított Stop Gyurcsány petíciót", "created_utc": "1649350081.0", "edited": "False", "id": "i3s6arv", "is_submitter": "False", "link_id": "t3_ty7kfg", "parent_id": "t3_ty7kfg", "score": "1", "subreddit": "hungary", "subreddit_id": "t5_2qzzt"}, {"author": "Earthisacultureshock", "body": "Ez is jó. A baloldal nemcsak a gyerekeket akarja átműttetni, hanem azt mondja az embereknek, hogy ne vállaljanak gyereket és utazzanak külföldre, ezzel elárulva Magyarország következő nemzedékeit, elárulva idős honfitársainkat. És a végén ennek megelőzésére szigorítják meg az abortuszt.", "created_utc": "1649142030.0", "edited": "False", "id": "i3gm2sn", "is_submitter": "False", "link_id": "t3_twnw2a", "parent_id": "t1_i3glqwd", "score": "17", "subreddit": "hungary", "subreddit_id": "t5_2qzzt"}, {"author": "Earthisacultureshock", "body": "Valahogy nekem is van egy ilyen érzésem", "created_utc": "1649141249.0", "edited": "False", "id": "i3gl27k", "is_submitter": "False", "link_id": "t3_twnw2a", "parent_id": "t1_i3gkysw", "score": "27", "subreddit": "hungary", "subreddit_id": "t5_2qzzt"}, {"author": "Earthisacultureshock", "body": "Igazad van. Talán annyi, hogy a propaganda tovább tudja szítani ezek között az érdekek és ellenérdekek között a feszültséget, onnantól pedig csak még rosszabb.", "created_utc": "1649098763.0", "edited": "False", "id": "i3dzaer", "is_submitter": "False", "link_id": "t3_tw487q", "parent_id": "t1_i3dyoca", "score": "3", "subreddit": "hungary", "subreddit_id": "t5_2qzzt"}, {"author": "Earthisacultureshock", "body": "Ez az én unpopular opinionom is.", "created_utc": "1649095573.0", "edited": "False", "id": "i3dr03m", "is_submitter": "False", "link_id": "t3_tw487q", "parent_id": "t1_i3czmlm", "score": "1", "subreddit": "hungary", "subreddit_id": "t5_2qzzt"}, {"author": "Earthisacultureshock", "body": "Szerintem nem is általánosságban a vidékiekkel van a baj. Inkább a vidéki idősekkel és középkorúakkal, a fiatalok már inkább az interneten tájékozódnak, kevésbé a tévéből, nem az M1-ből, ellentétben a szüleikkel, nagyszüleikkel, dédszüleikkel. Plusz a fiatalok nagyobb számban tudnak angolul vagy pl. németül.\n\nPersze van kivétel, ismerek olyan fiatalt, aki arra próbálja téríteni a barátait, ismerőseit, hogy a Fideszre szavazzanak (nem érdekből, a szülei Fideszesek, neki is ez a meggyőződése). \n\nKis faluból származok, a közeli városba jártam középiskolába (néhány évvel ezelőtt érettségiztem), ott az osztályomba a környék falvaiból, városaiból jártak diákok, nagyon markáns volt az ellenzéki hang. A kis falumban is ismerek olyat, aki minden áron le akarja váltani Orbánt. Ezzel ellentétben ismerek budapesti családot is, akik mindenáron Fidesz. \n\nDe ezek a különbségek nem is önmagában abból adódnak, hogy ki mikor született. Inkább abból, hogy ki honnan tájékozódik, inkább internet vagy tévé, és azon belül is inkább az ellenzéki vagy a kormánypárti echo chamberben tartja magát. Mert miután eleget olvasta vagy nézte az adott oldalt, csak azt hiszi el, az mond igazat, a másik annyira mást mond, mint a világképe, hogy azt onnantól hazugságnak fogja fel és nem hajlandó vele foglalkozni.\n\nA Fidesz nagyon durva agymosást végzett. Lenyűgöző. Lenyűgöző és egyben elborzasztó ezt a saját életemben, a saját szemem előtt látni megtörténni.", "created_utc": "1649095354.0", "edited": "False", "id": "i3dqfoq", "is_submitter": "False", "link_id": "t3_tw487q", "parent_id": "t3_tw487q", "score": "7", "subreddit": "hungary", "subreddit_id": "t5_2qzzt"}, {"author": "Earthisacultureshock", "body": "Mindenki számára elérhető ingyen 12 tévécsatorna, ha van tévéje, ebben benne van az RTL is. Aki akarná, tudná azt is nézni. Inkább csak nem akarják szerintem.\n\n[https://mindigtv.hu/mindigtv/mindig-tv/a-szolgaltatasrol](https://mindigtv.hu/mindigtv/mindig-tv/a-szolgaltatasrol)\n\n&#x200B;\n\nEdit: typo", "created_utc": "1649064683.0", "edited": "False", "id": "i3bz4ar", "is_submitter": "False", "link_id": "t3_tvuksn", "parent_id": "t1_i3bplaz", "score": "5", "subreddit": "hungary", "subreddit_id": "t5_2qzzt"}, {"author": "Earthisacultureshock", "body": "Nagyon jól megfogalmaztad, hogy miért nem lehet hatni rájuk Mészárossal. Pont ezeket hallom én is vissza.", "created_utc": "1648664978.0", "edited": "False", "id": "i2qw9u3", "is_submitter": "False", "link_id": "t3_ts7yyv", "parent_id": "t1_i2qi9ro", "score": "5", "subreddit": "hungary", "subreddit_id": "t5_2qzzt"}, {"author": "Earthisacultureshock", "body": "Szerintem Zelenszkijnek nagyon fura ez a szinkron, de lehet csak azért, mert hallottam eredetileg milyen a hangja (plusz én az első pár részt megnéztem eredeti szinkron + angol felirattal). Viszont összességében én is rosszabb szinkronra számítottam. Az nem tudom másnak is feltűnt-e, de a szinkronban a rant-jelenet közben mintha lett volna egy utalás az öszödi beszédre, ami meglepett, de adott egy kis plusz színt. Érdekes egyébként, hogy magyarként is mennyi minden átjön, hiába az ukrán rendszer paródiája, mennyi minden igaz a magyar rendszerre is, egy csomó dologgal mi is tudunk azonosulni (sajnos). Nekem személy szerint nagyon tetszett az első pár rész. Ugyanakkor tényleg van egy abszurditása, hogy miközben ezt nézed, ezen nevetsz, mi van Zelenszkijjel, aki bármelyik pillanatban halott lehet.\n\n\n\n\nEdit: Az külön érdekes, hogy az eredeti az nem ukrán, hanem orosz szinkron, csak bele van rakva pár ukrán párbeszéd.", "created_utc": "1647820048.0", "edited": "False", "id": "i1guhb7", "is_submitter": "False", "link_id": "t3_tircea", "parent_id": "t3_tircea", "score": "14", "subreddit": "hungary", "subreddit_id": "t5_2qzzt"}, {"author": "Earthisacultureshock", "body": "Hungarian native here, and for me, it also sounds like Hungarian, except, the words don't make sense. I think the sounds cause that feeling.", "created_utc": "1646435359.0", "edited": "False", "id": "hzdpv4h", "is_submitter": "False", "link_id": "t3_t6p1db", "parent_id": "t1_hzdc264", "score": "18", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Earthisacultureshock", "body": "Szeretném azt mondani, hogy nem.", "created_utc": "1646346770.0", "edited": "False", "id": "hz8q9mp", "is_submitter": "False", "link_id": "t3_t5v0rk", "parent_id": "t1_hz8iny3", "score": "5", "subreddit": "hungary", "subreddit_id": "t5_2qzzt"}, {"author": "Earthisacultureshock", "body": "Amikor megláttam először, azt hittem valami paródia, még nevettem is. Aztán arcul ütött a valóság.", "created_utc": "1646346592.0", "edited": "False", "id": "hz8pudw", "is_submitter": "False", "link_id": "t3_t5v0rk", "parent_id": "t1_hz7p6ec", "score": "9", "subreddit": "hungary", "subreddit_id": "t5_2qzzt"}, {"author": "Earthisacultureshock", "body": "Ha nem vágyná, talán az oktatási rendszer által gyermekeinknek okozott kimerültség, depresszió és pánikbetegség ellen harcolnánk. Szeretnék álmodozni erről.", "created_utc": "1646346187.0", "edited": "False", "id": "hz8ovtl", "is_submitter": "False", "link_id": "t3_t5v0rk", "parent_id": "t1_hz77c8q", "score": "14", "subreddit": "hungary", "subreddit_id": "t5_2qzzt"}, {"author": "Earthisacultureshock", "body": "Mióta láttam ezt a reklámot, próbálok visszaemlékezni az LGBTQ+ propaganda miatt elmaradt matekdogákra, de egy se jut eszembe :(", "created_utc": "1646345885.0", "edited": "False", "id": "hz8o5du", "is_submitter": "False", "link_id": "t3_t5v0rk", "parent_id": "t1_hz76qxr", "score": "31", "subreddit": "hungary", "subreddit_id": "t5_2qzzt"}, {"author": "Earthisacultureshock", "body": "I think the main problem is, that a lot of westerners cannot imagine a flawed democracy or an authoritarian regime – in their heads there’s either democracy with all the freedom or dictatorship. And that’s because they have never lived in such countries.\r\n\r\nI'm not from Russia, but a country that was part of the soviet bloc. Many of these countries have similarities in a sense of corruption, oligarchs, propaganda, etc. \r\n\r\nFor example, I think westerners have a hard time to imagine what is like when the government controls state media and throws out  propaganda on the people all the time (and many believe in the lies) but at the same time opposition have their own tv channels, newspapers, websites, you can hear their viewpoints, but they reach less people.  The freedom of speech does not exist only in the two extremes - either have the right to say whatever you want, whenever you want, in any way you want or saying something bad about the president/prime minister and you will be tortured to death in a prison camp. You won’t be jailed just because you talked to you neighbor about not loving the leader. There’s election fraud all the time, but not necessarily because of burning votes in the backyard, but because of the propaganda, which tries to brainwash people as much as possible and because of the politicians of the governing party, who bend the law, change the constitution and create such rules that they have the highest chance to win over the opposition. I also have to mention, that oftentimes the opposition is a bunch of retards, too, so many people rather don’t go to vote because have no one to vote for. So, it’s almost impossible to change the regime. \r\n\r\nThere’s a scale, not just the two extremes. I also have to add, that Russia is worse, than my country. At least, here we aren’t jailed for protesting.", "created_utc": "1646314718.0", "edited": "False", "id": "hz6iusw", "is_submitter": "False", "link_id": "t3_t5opy5", "parent_id": "t3_t5opy5", "score": "19", "subreddit": "AskARussian", "subreddit_id": "t5_2xzpo"}, {"author": "Earthisacultureshock", "body": "I've heard it was fake news. Zelenskyy only refused to negotiate in Minsk, he wanted another place. But I might be wrong.", "created_utc": "1645927973.0", "edited": "False", "id": "hylcnct", "is_submitter": "False", "link_id": "t3_t252iv", "parent_id": "t1_hyl0tbt", "score": "1", "subreddit": "AskARussian", "subreddit_id": "t5_2xzpo"}, {"author": "Earthisacultureshock", "body": "Engem is ezzel ébresztettek, szóval teljesen átérzem senkinek se kívánom. \n\nHihetetlen még így távolról is belegondolni, hogy mi lehet most azokkal az irodákkal. Annyira szürreális. Nekem egy ukrán ismerősöm van, ő Magyarországon él, de hiába távoli ismerős, nem tud nem eszembe jutni. \n\nÉn nagyon szeretném hinni, hogy nem lesz rosszabb. De nem tudom, őszintén, hogy merjek-e ebben hinni.", "created_utc": "1645927172.0", "edited": "False", "id": "hylazan", "is_submitter": "False", "link_id": "t3_t1xnax", "parent_id": "t1_hyl9pdj", "score": "3", "subreddit": "hungary", "subreddit_id": "t5_2qzzt"}, {"author": "Earthisacultureshock", "body": "Azután, hogy Ukrajnának is mennyire ígérgette Biden, hogy hiába nem NATO, de mennyi segítséget fog kapni, és mennyire biztosítani fogják a biztonságát, aztán az az első, hogy magára hagyja, nekem kicsit elveszti a hitelét az egész. De próbálok hinni abban, hogy a NATO országok mégis kiállnak egymásért. Meg abban bízok, hogy Putyin nem olyan hülye, hogy nekimenjen a NATO-nak, így megmarad a konfliktus Ukrajnában.\n\nEdit: De nekem is nulla szakértelmem van a témában, csak innen-onnan összeszedett infókra hagyatkozok.", "created_utc": "1645925472.0", "edited": "False", "id": "hyl7bsa", "is_submitter": "False", "link_id": "t3_t1xnax", "parent_id": "t1_hyiyalr", "score": "1", "subreddit": "hungary", "subreddit_id": "t5_2qzzt"}, {"author": "Earthisacultureshock", "body": "Szerintem az lehet, hogy ez közelebb van. Hiába láttam képeket a távolabbi dolgokról, megráztak, persze, most is velem vannak. De valahogy az ukrajnai helyzet közelebb van és frissebb. És ilyenkor az ember jobban megijed. Vagy nem tudom. Valószínűleg, ha a Közel-Keleten élnék, más háborúk ráztak volna meg ennyire, és ez kevésbé.", "created_utc": "1645925102.0", "edited": "False", "id": "hyl6je3", "is_submitter": "False", "link_id": "t3_t1xnax", "parent_id": "t1_hyinu7j", "score": "1", "subreddit": "hungary", "subreddit_id": "t5_2qzzt"}, {"author": "Earthisacultureshock", "body": "Nekem az vált be, hogy elkezdtem nézni Zelenszkij sorozatát még azelőttről, hogy elnök lett. Furcsa mód ennek az abszurditása valahogy el tudta terelni a figyelmem (bár mondjuk maga a sorozat is szórakoztató).", "created_utc": "1645924654.0", "edited": "False", "id": "hyl5kfy", "is_submitter": "False", "link_id": "t3_t1xnax", "parent_id": "t1_hyj5eqs", "score": "1", "subreddit": "hungary", "subreddit_id": "t5_2qzzt"}, {"author": "Earthisacultureshock", "body": "Tegnap reggel óta várom (negatív értelemben, inkább próbálok felkészülni), hogy mikor jelentik be, hogy elfoglalták Kijevet. De még mindig semmi. Mindig azt hiszem, lemaradtam a hírekkel, és már megtörtént. De nem. Ki tudja meddig húzódik el az ostrom. Annyira követhetetlennek érzem azt is, hogy a többi városban mi a helyzet.", "created_utc": "1645924137.0", "edited": "False", "id": "hyl4g4c", "is_submitter": "False", "link_id": "t3_t1xnax", "parent_id": "t1_hyjwn1y", "score": "1", "subreddit": "hungary", "subreddit_id": "t5_2qzzt"}, {"author": "Earthisacultureshock", "body": "Az utóbbi napokban olyan képeket láttam, amiket nem biztos, hogy akartam. Hála az internetnek, minden túl gyorsan eljut hozzánk. A halott katonák, a halott gyerekek... Azt a bizonyos hangfelvételt nem volt bátorságom meghallgatni. Ijesztő belegondolni, hogy lehet, akiket látsz a képeken, nem sokkal később halottak. Annyira nem lehet eldönteni, hogy amit látsz, abból ki az ukrán vagy orosz propaganda, mi az emberek félreételmezése, mik a valós infók. Tényleg a tizes évei végén-huszas évei elején járó szinte gyerekeket küld Putyin a háborúba? Azzal a hazugsággal, hogy csak a határra mennek hadgyakorlatra? Mi járhat a városokban maradt civilek fejében? Miért van van az, hogy senki nem akarja egymást lőni és mégis itt tartunk?\n\nAnnyira beteg szinte élőben végignézni távolról az egészet. \n\nPróbálom mára már nem túl idegeskedni magam, de az első két nap nagyon megviselt. Korábban is persze, láttam dolgokat hála az internetnek, de hiába voltak ott a szír menekültek, a lebombázott Gázai övezet, a covid-tömegsírok Brazíliában, vagy a családtagjaiknak lélegeztetőgépért könyörgő indiaiak... Olyan távolinak tűnt az egész... Megrázott, persze, azóta is itt van a tudatom mélyén, de az ukrajnai helyzet annyival frissebb és annyival közelebb van.", "created_utc": "1645923744.0", "edited": "False", "id": "hyl3l8o", "is_submitter": "False", "link_id": "t3_t1xnax", "parent_id": "t1_hyj7jzi", "score": "1", "subreddit": "hungary", "subreddit_id": "t5_2qzzt"}, {"author": "Earthisacultureshock", "body": "Édesanyám is hasonlóan volt. Amikor összejöttek apával, anya megmondta, hogy biztos nem lesz gyerek, ő nem akar, jó neki a szabadság. Aztán születettek babák a környezetükben, és akkor jött rá, hogy ő is szeretne gyereket. Nem úgy tűnik, hogy a sok nehézség ellenére nagyon kiábrándultak volna a dologból, mert lett mellém testvér is.", "created_utc": "1645369286.0", "edited": "False", "id": "hxpjj61", "is_submitter": "False", "link_id": "t3_sx0omb", "parent_id": "t3_sx0omb", "score": "5", "subreddit": "hungary", "subreddit_id": "t5_2qzzt"}, {"author": "Earthisacultureshock", "body": "Köszönöm, hogy ezt ismeretlenül is megállapítod rólam és jobban ismersz, mint én magamat :) Ha már ilyen jól belém látsz, nincs kedved a pszichológusom lenni? Úgyis keresek egyet.", "created_utc": "1645366866.0", "edited": "False", "id": "hxpeikj", "is_submitter": "False", "link_id": "t3_sw81j9", "parent_id": "t1_hxpdalm", "score": "2", "subreddit": "hungary", "subreddit_id": "t5_2qzzt"}, {"author": "Earthisacultureshock", "body": "Én erről a sztoriról lemaradtam", "created_utc": "1645365624.0", "edited": "False", "id": "hxpc58y", "is_submitter": "False", "link_id": "t3_swkhre", "parent_id": "t1_hxooq22", "score": "5", "subreddit": "hungary", "subreddit_id": "t5_2qzzt"}, {"author": "Earthisacultureshock", "body": "Én abban vontam párhuzamot, hogy egy adott csoport egy negatív képviselőjének utálata nem vonja magával automatikusan az adott csoport többi tagjának utálatát.", "created_utc": "1645298753.0", "edited": "False", "id": "hxm2m67", "is_submitter": "False", "link_id": "t3_su2208", "parent_id": "t1_hxhwper", "score": "1", "subreddit": "hungary", "subreddit_id": "t5_2qzzt"}, {"author": "Earthisacultureshock", "body": "Látszik, hogy sokan távol voltak/vannak ettől a problémától az átlag emberek közül is - akár térben, akár időben. Azoknak persze, ez rasszista, kirekesztő és kegyetlen. De amikor szembesülsz azzal, hogy mennyi cigánygyereknek az a karrier már általánosban, hogy ő majd gyerekgyártó kisiparos lesz, eltartja a f*sza, vagy milyen rafináltan kijátssza a rendszert azzal, hogy szüli a gyerekeket, vagy szinte sose látod őket órán, ha bent is vannak, nem tudnak viselkedni, hirtelen megérted Vona miről beszél. És én már csak arra emlékszem a környékünkön, amikor kevésbé volt baj a cigányokkal. Nekem már szerencsére nincsenek meg azok az idők, de sokan meséltek róla, amikor a tezsvírek a csáláddal halomra verték a rendőröket, amikor minden falunapon a szirénázó mentő- és rendőrautókat kellett hallani, vagy amikor este nem lehetett kimenni az utcára. És ez nem Borsod.\n\nNem szimpatizáltam a Jobbik ideológiájával soha, de ezek alapján meg tudom érteni, hogy sokan miért szavaztak rájuk.\n\nMielőtt valaki félreért, tudom, hogy ez nem csak a cigányokat érinti, és nem minden cigány bűnöző.", "created_utc": "1645277209.0", "edited": "False", "id": "hxkp83c", "is_submitter": "False", "link_id": "t3_sw81j9", "parent_id": "t1_hxkhftk", "score": "27", "subreddit": "hungary", "subreddit_id": "t5_2qzzt"}, {"author": "Earthisacultureshock", "body": "Elhiszem, hogy tetszik az, ahogy a Fidesz kiragad kontextusból dolgokat és le akarjuk utánozni, de légyszi ne. Főleg ne úgy, hogy közben háborgunk, ha MZP-vel ugyanezt csinálják.", "created_utc": "1645276259.0", "edited": "False", "id": "hxknlnz", "is_submitter": "False", "link_id": "t3_sw81j9", "parent_id": "t3_sw81j9", "score": "10", "subreddit": "hungary", "subreddit_id": "t5_2qzzt"}, {"author": "Earthisacultureshock", "body": "Szintén nem azért, hogy védjem a Fideszt, de szerintem is igazad van. Volt egy interjú is Szijjártóval (most nem találom, valami amerikai tévénél volt, hátha valakinek megvan), ahol támadták ezzel, mire kiemelte, hogy a Fidesznek nem a zsidókkal van baja, abszolút nem érdekli őket mi Soros vallása, nekik Sorossal van bajuk.\n\nAzt nyilván mindenki eldönti maga, hogy örül-e, hogy a Fidesz Sorosból ellenséget csinál, de azért ne vádoljunk senkit antiszemitizmussal, amiért baja van egy zsidóval. Most vádoljak meg egy csomó embert itt azzal, hogy utálja a szlávokat, amiért bajuk van Putyinnal?", "created_utc": "1645115625.0", "edited": "False", "id": "hxbqf5w", "is_submitter": "False", "link_id": "t3_su2208", "parent_id": "t1_hxai5tp", "score": "3", "subreddit": "hungary", "subreddit_id": "t5_2qzzt"}, {"author": "Earthisacultureshock", "body": "Sokszor kérdezem ezt én is magamtól, de sajnos mindig sikerül meglepniük", "created_utc": "1644599543.0", "edited": "False", "id": "hwizo0p", "is_submitter": "False", "link_id": "t3_sq0ude", "parent_id": "t1_hwiubiy", "score": "12", "subreddit": "hungary", "subreddit_id": "t5_2qzzt"}, {"author": "Earthisacultureshock", "body": "Amikor már egy pillanatra elhinném, hogy nem nincs lejjebb, mindig arcon csap a valóság. Nem is tudom, hogy örüljek-e neki, hogy ezt a sztorit most tudtam meg és nem évekkel ezelőtt.", "created_utc": "1644443323.0", "edited": "False", "id": "hwa61we", "is_submitter": "False", "link_id": "t3_sojqrp", "parent_id": "t1_hw9xusx", "score": "55", "subreddit": "hungary", "subreddit_id": "t5_2qzzt"}, {"author": "Earthisacultureshock", "body": "Vidéki mozi igazgatója mesélte (még Covid előtt), hogy nekik sokszor nem éri meg eredeti nyelven, sokszor felirattal se beszerezni a filmeket, túl kevesen mennek el ezekre. Ezért van a legtöbb dolog náluk magyar szinkronnal.", "created_utc": "1644188579.0", "edited": "False", "id": "hvvevym", "is_submitter": "False", "link_id": "t3_slhugj", "parent_id": "t1_hvr29mb", "score": "1", "subreddit": "hungary", "subreddit_id": "t5_2qzzt"}, {"author": "Earthisacultureshock", "body": "Csak az UHT tejet, a többit nem", "created_utc": "1644184772.0", "edited": "False", "id": "hvv5rti", "is_submitter": "False", "link_id": "t3_sm79rm", "parent_id": "t1_hvux0k0", "score": "3", "subreddit": "hungary", "subreddit_id": "t5_2qzzt"}, {"author": "Earthisacultureshock", "body": "Azért ez jelentős változás, szinte el se hiszi az ember, hogy lehet ilyet egyáltalán... Ezt pozitívan értem, örülök, hogy van végre valaki, aki tett is valamit a városért.", "created_utc": "1644061857.0", "edited": "False", "id": "hvosut0", "is_submitter": "True", "link_id": "t3_sc9sid", "parent_id": "t1_hvlwtdw", "score": "2", "subreddit": "hungary", "subreddit_id": "t5_2qzzt"}, {"author": "Earthisacultureshock", "body": "Köszi, mindenképp el fogom olvasni!", "created_utc": "1643138341.0", "edited": "False", "id": "hu6w4mc", "is_submitter": "False", "link_id": "t3_s61j1n", "parent_id": "t1_hu2at9z", "score": "2", "subreddit": "hungary", "subreddit_id": "t5_2qzzt"}, {"author": "Earthisacultureshock", "body": "Nem is tudom mit mondjak hirtelen... Hallottam, hogy nem stimmeltek ott dolgok, de nem gondoltam volna, hogy ennyire durva volt a helyzet...", "created_utc": "1643136514.0", "edited": "False", "id": "hu6rak5", "is_submitter": "True", "link_id": "t3_sc9sid", "parent_id": "t1_hu643uc", "score": "1", "subreddit": "hungary", "subreddit_id": "t5_2qzzt"}, {"author": "Earthisacultureshock", "body": "Köszi :D Ezeket nem tudom, hogy nem láttam", "created_utc": "1643119421.0", "edited": "False", "id": "hu5j826", "is_submitter": "True", "link_id": "t3_sc9sid", "parent_id": "t1_hu4u05t", "score": "1", "subreddit": "hungary", "subreddit_id": "t5_2qzzt"}, {"author": "Earthisacultureshock", "body": "Because historically there have been a unique friendship between Hungary and Poland, we have helped and supported each other a lot in need. As far as I experienced, a lot of Hungarians and Poles, regardless of political ideology, see each other as friends to this day.", "created_utc": "1642886420.0", "edited": "False", "id": "htsjsg1", "is_submitter": "False", "link_id": "t3_s9ik2s", "parent_id": "t1_hts1e81", "score": "3", "subreddit": "AskEurope", "subreddit_id": "t5_2uayg"}, {"author": "Earthisacultureshock", "body": ">Romanians in particular are hated and looked down on by a huge number of Hungarians.   \n>  \n>Interestingly, the biggest Romanian hater i've ever met was extremely leftist, hating the Orban government and all. \n\nMaybe because I live near to the border, I've seen and heard that nearby a lot of Hungarians and Romanians have peaceful relationships. I also think younger generations in Hungary don't care about the hurt from Trianon that much and thus have no problems with Romanians or Slovakians only because of their ethnicity. But I can accept that there are extremely leftist people who hate Romanians only because they are Romanians (and nothing else).\n\n&#x200B;\n\n>And Hungary was in fact a Christian nation\n\nI said that ironically, reflecting on their hypocracy. I completely agree that Christianity had a huge impact on our culture, it really determined that for centuries and still. It would be a huge mistake to deny that. So yes, Hungary is a Christian nation. But it has a different connotation when someone who hates everyone, beats their wife, cuts off his son from his life because he is gay, wants to kill people with different value systems, religion, color, or ethnicity, knows nothing about the Bible, never goes to the church are proud Christians (and not Christians in their own way of Christianity, but proudly say they belong to a certain established branch and do the complete opposite as its value system).  \n\n\nAs for language, I haven't written my opinion. I myself think Hungarian is a beautiful language, and it is incredibly hard, I'm proud to be a native speaker. I'm incredibly happy when someone can say a few words, not to mention communicating with people in Hungarian who are not native speakers. That's an amazing experience.\n\nBut maybe I wasn't clear enough, I meant, that many on the far-right think the Hungarian language is superior, and despise other languages. Which I personally don't agree with. And I also don't think that everyone should perfectly learn it when they come to Hungary for a few days and I don't agree with shaming tourists for not speaking this difficult language, which I've found common when someone is chauvinistic with their Hungarian identity. Or does leftist do that, too? I might be wrong.\n\n&#x200B;\n\nBut then, I'm curious (not ironically, I'm really curious) how would you describe a far-right Hungarian?", "created_utc": "1642885014.0", "edited": "False", "id": "htsgbys", "is_submitter": "False", "link_id": "t3_s9ik2s", "parent_id": "t1_hts2314", "score": "1", "subreddit": "AskEurope", "subreddit_id": "t5_2uayg"}, {"author": "Earthisacultureshock", "body": "* They use the Greater Hungary symbol without any reason, everywhere, all the time. They also talk about uniting Hungary again, \"taking back Transylvania\" has become a meme to mock them but it describes the situation well. \n* They are 100% certain Romania and Slovakia do not exist, and they will try to persuade you. They insist that Slovakians and Romanians don't have their own history and culture. \n* They hate Slovakians and Romanians, but also Gypsies, Russians, Austrians (because of the Habsburg history), the EU, the West, basically everyone, who is not ethnic Hungarian or Polish.\n* They often wear a Kárpátia-T-shirt (Kárpátia is a musical group that makes patriotic/nationalistic music and have become a far-right symbol).\n* They simultaneously use ancient, pagan symbols (like the turul) and be a proud Christian, because \"Hungary is a Christian nation\" (but they don't follow the Christian value system).\n* They hate those Hungarians who left the country because they are traitors and don't want to serve their motherland where they were born and raised. \n* They think the Hungarian language is superior to every other, it's a kind of original language of humanity, the most complicated, the most beautiful, and the hardest. And obviously, Hungarians are superior, too. Some even go to the idea that Hungarians are not from the Earth, they came here from the Sirius.\n* Many of them won't be able to read this comment, because of not willing to learn other languages and are even angry with tourists who don't speak perfect Hungarian (\"if you come Hungary, you have to speak Hungarian\").", "created_utc": "1642863110.0", "edited": "False", "id": "htqy31j", "is_submitter": "False", "link_id": "t3_s9ik2s", "parent_id": "t3_s9ik2s", "score": "5", "subreddit": "AskEurope", "subreddit_id": "t5_2uayg"}, {"author": "Earthisacultureshock", "body": "Nálunk leginkább az, hogy online sokszor nem is igazán voltak óráink. Van olyan oktató, aki nagyon jól tanít jelenlétiben, az előadáson megjegyzed az anyagot, online viszont csak küldött pár tanulmányt és oldd meg. :( És ő még legalább küldött valamit. Volt, akitől csak egy linket kaptunk és ennyi. Így én is elmegyek egyetemre oktatni.\n\nMivel én nyelvszakon vagyok, ezért a nyelvóráim minősége se volt olyan, bár itt legalább próbálkozott a tanár annak ellenére, hogy nem fiatal és nem ért hozzá, de látszott, hogy kényelmetlen neki az egész. \n\nA pozitív oldala talán, hogy volt, aki videókat csinált vagy hangos ppt-t, és ezeket bármikor visszanézhettük, ami nagyon sokat segített. Meg jó volt sokszor, hogy nem kellett kimozdulni otthonról, nem kellett olyan korán kelni, nem kellett maszkban ülni a nyitott ablaknál megfagyva (nem vagyok maszkellenes, de 6-8 óra után az ember aznapra ledobná).", "created_utc": "1642720364.0", "edited": "False", "id": "htiv072", "is_submitter": "False", "link_id": "t3_s8keyo", "parent_id": "t1_htgv2du", "score": "3", "subreddit": "hungary", "subreddit_id": "t5_2qzzt"}, {"author": "Earthisacultureshock", "body": "Várom a downvote-áradatot, de az a baj, hogy itt a legtöbb ötlet kizárólag ellenzéki, összefogásbeli szemszögből közelít. Ez akkor nem baj, ha kizárólag az összefogás szavazói a célközönség, és nem gondoltok a bizonytalanokra (akik pedig vannak) és a meggyőzhetőbb fideszesekre (akik szintén vannak, de félnek, hogy annál is rosszabb lehet, ami most van).\n\nOlyan dolgokat írtok sokan (nem mindenki, de sokan) amivel csak az ellenzéki szavazók tudnak azonosulni. Amikről az átlag Fidesz-szavazó vagy nem tud, vagy nem érdekli. Sőt, sokszor pont erősítitek is bennük a félelmet.\n\nA két tábor elbeszél egymás mellett teljesen. Ahogyan ti nem lesztek meggyőzve az ő szemszögükből teljesen validnak tűnő \"Gyurcsány jobb vót?\" \"Az ellenzék azt csinálja, amit Brüsszel akar, aki meg beengedi a migránsokat, akik láttuk mit csinálnak Nyugaton!\" érvekkel, úgy őket sem tudjátok meggyőzni azzal, hogy \"A korrupció rossz!\" vagy \"Nézzetek már a Kaleta-ügyre!\" válaszokkal. Mert nem érdekli őket a korrupció, mert nem tudják ki az a Kaleta Gábor. Sőt, ha kiplakátoljátok MZP-t EU-s politikusok mellett, az bizony nekik az igazat, és ők nem a jobb életszínvonalat fogják leszűrni, hanem a \"migránsveszélyt\" és az \"lmbtq+ lobbit\".\n\nAmellett, hogy meg kell győzni az összefogás szavazóit, a többiek félelmeit is el kell oszlatni. Ezért az például egy jó ötlet, hogy \"Orbán megy, a rezsicsökkentés marad\". Vagy ugyanezt a kerítéssel: \"Orbán megy, a kerítés marad\". \n\nAmi szerintem szintén jó volt, azok a Fidesz korábbi migránsozós plakátjaira hajazó plakátok azzal, hogy valójában Orbánék hány migránst telepítettek be. És miért? Mert megtévesztő. Mert a színvilág és a dizájn leutánzásával olyan, mintha a Fidesz tette volna ki. Hányszor hittem ezt első látásra, mire leesett. Hány zavarodik meg, hánynak le fog esni, hogy ezt most az ő drága Viktora tette-e ki?\n\nUgyanúgy be kéne állni amögé, hogy megvédjük a gyermekeinket. A szlogen szintjén nagyon, egyfolytában nyomatva. Ami itt viszont tényleges gyermekvédelmet jelent, nem azt, hogy öngyilkosságba kergetjük a meleg gyermekeinket, vagy nem számít, ha felvágja az ereit, amíg a születési nemében teszi. A népszavazást is úgy kéne bojkottálni, hogy hülye kérdésre hülye válasz: mindenki menjen el és jelöljön Fidesz-ellentétes válaszokat. Trollkodjuk szét.\n\nMeg nem csak beszélni kéne arról, hogy hányan fagytak meg a télen, hanem hiába a kevesebb pénz, vinni a tűzifát. (Lehet volt ilyen, ha igen, linkeljétek) Kifizetni Józsi bácsinak a napelemet, Mari néninek a szigetelést. Sokan meggyőzhetők a tettekkel. Ha a kis faluban látják, hogy nem csak a Fidesz adja a fát, vagy mit jelent MZP rezsicsökkentése, akkor fogékonyabbak. \n\n\nPersze, a keménymagot nem lehet meggyőzni, de minden egyes esetleg átpártolt szavazó számít.", "created_utc": "1642471239.0", "edited": "False", "id": "ht4cnr8", "is_submitter": "False", "link_id": "t3_s67e3a", "parent_id": "t3_s67e3a", "score": "27", "subreddit": "hungary", "subreddit_id": "t5_2qzzt"}, {"author": "Earthisacultureshock", "body": "Nálunk is ugyanez, a 18 év felettiek se mehettek ki (már élhettem volna egyedül, de a suliból nem mehetek ki, wtf). Csak az ofő írhatott papírt (a végére már rájöttek, lehet nem árt, ha a pótofő is írhat), és nem lehetett rendszeres papírt íratni, csak minden egyes alkalommal külön-külön. Még a 18 év alattiakra megértem, de egy 18-19 éves most miért? Ha adtak volna papírt, hogy az én felelősségem, amíg lyukas órában elmegyek magánórára és elcsap egy kocsi, aláírtam volna. Ja, és ez csak 12 óra előtt volt érvényes, utána nyitva volt minden, oda mentél az óráid között, ahova akartál.\n\nA portás meg nem tudott mit csinálni, őt is megértem, a helyében én se akartam volna, hogy bajom legyen esetleg (rendes volt a portásunk amúgy, ne egy olyat képzeljetek el, aki szórakozásból kibaszott volna bárkivel is).\n\nEdit: mondjuk az óra előtti késéses rendszer nem volt, attól azért szerencsére megkíméltek minket.", "created_utc": "1642466397.0", "edited": "False", "id": "ht41c6j", "is_submitter": "False", "link_id": "t3_s6gfug", "parent_id": "t3_s6gfug", "score": "23", "subreddit": "hungary", "subreddit_id": "t5_2qzzt"}, {"author": "Earthisacultureshock", "body": "Általában az a baj, hogy az ilyeneket a tankerület bevállalta, hogy ő és csakis ő fizeti (legalábbis felénk ezt közvetítették), csak a probléma az, hogy nem fizeti. Az igazgatóság meg sajnos nem tud mit csinálni. Pedig normál esetben nekik kéne ezért felelősnek lenni és megoldani.", "created_utc": "1642465350.0", "edited": "False", "id": "ht3ywar", "is_submitter": "False", "link_id": "t3_s6fbjc", "parent_id": "t1_ht39769", "score": "5", "subreddit": "hungary", "subreddit_id": "t5_2qzzt"}, {"author": "Earthisacultureshock", "body": "Nálunk covid előtt is ez volt. Nem fért volna el két osztály a teremben, úgyhogy az egyik ment ki az udvarra, legyen +40 vagy -40. De ez még mindig elfogadhatóbb, mint a nincs kedvem maszkban dirigálni.", "created_utc": "1642465171.0", "edited": "False", "id": "ht3yhb3", "is_submitter": "False", "link_id": "t3_s6fbjc", "parent_id": "t1_ht3fki1", "score": "7", "subreddit": "hungary", "subreddit_id": "t5_2qzzt"}, {"author": "Earthisacultureshock", "body": "Szerintem ez sikerült - bár bevallom, én nem láttam a két adást, úgyhogy nem tudhatom mit hagytál esetleg ki. De a hangneméből nem jött át, hogy húztál volna bármelyik oldalra is, csak leírtad a történteket. Én nagyon örülnék, ha többször megcsinálnád, és annak is, ha minél több emberhez eljutna. Csak hát igen, ez nagyon időigényes.", "created_utc": "1642448943.0", "edited": "False", "id": "ht2tzwt", "is_submitter": "False", "link_id": "t3_s61j1n", "parent_id": "t1_ht2t6q3", "score": "4", "subreddit": "hungary", "subreddit_id": "t5_2qzzt"}, {"author": "Earthisacultureshock", "body": "\nKöszi az összefoglalót és az összehasonlítást! Nagyon jó látni végre valamit, ami nem elvakultan egy oldalt istenít és a másikat támadja, hanem mindkettő szavait gyűlölködés és kiforgatás nélkül szedi össze. Sokkal több ilyen kéne.", "created_utc": "1642446781.0", "edited": "False", "id": "ht2o8hq", "is_submitter": "False", "link_id": "t3_s61j1n", "parent_id": "t3_s61j1n", "score": "13", "subreddit": "hungary", "subreddit_id": "t5_2qzzt"}, {"author": "Earthisacultureshock", "body": "Na pont ez az egyik terület, ami tökéletesen bebizonyítja mekkora baromság a gender-kvóta. Nem értem hogy vette magát komolyan, aki kitalálta, és nem akarom elhinni, hogy voltak, akik ezt tényleg át is vették. Ez nemhogy a nőknek előnyös, hanem a férfiak mellett pont, hogy nekik is hátrányos.", "created_utc": "1640573438.0", "edited": "False", "id": "hq3mwt6", "is_submitter": "False", "link_id": "t3_rp12zc", "parent_id": "t1_hq2news", "score": "1", "subreddit": "hungary", "subreddit_id": "t5_2qzzt"}, {"author": "Earthisacultureshock", "body": "És mi van azzal a férfivel, aki nem ért a számítógépek összerakásához? Vagy azzal a nővel, aki nem szereti az irodát dekorálni? Olyan kellemetlen, amikor mindig a férfiakért ugranak, ha a gépen nem működik valami, mintha el lenne várva, hogy nekik érteniük kéne a legapróbb részleteihez is. Ennek nem kéne nemtől függenie.", "created_utc": "1640573222.0", "edited": "False", "id": "hq3mgrb", "is_submitter": "False", "link_id": "t3_rp12zc", "parent_id": "t1_hq23zx5", "score": "3", "subreddit": "hungary", "subreddit_id": "t5_2qzzt"}, {"author": "Earthisacultureshock", "body": "Ezt a vidéki beidegződést annyira tapasztaltam én is nagyszülőnél. A lány az rendet tart, tud főzni, jó tanuló, a fiú meg kupis és hát azok mindig rosszabbul tanulnak. Túl sokszor jött már elő, hogy \"lány létire milyen rossz jegyei vannak\", vagy \"fiú létire milyen jól tanul\". Próbáltam már ezt megcáfolni, azt is elmagyarázni miért nem ér semmit az osztályozási rendszer, de ő más világban nőtt fel, nem tudott ezzel mit kezdeni. A főzést meg azért említettem, mert egyik gyerekének a családjában nem a feleség, hanem a férj főz, és az milyen dolog már (nálunk anya és apa is főz, érdekes, az nem baj).", "created_utc": "1640572152.0", "edited": "False", "id": "hq3k8zf", "is_submitter": "False", "link_id": "t3_rp12zc", "parent_id": "t1_hq22g0e", "score": "3", "subreddit": "hungary", "subreddit_id": "t5_2qzzt"}, {"author": "Earthisacultureshock", "body": "https://forvo.com/ - kiejtésszótár szinte minden nyelvhez", "created_utc": "1640519780.0", "edited": "False", "id": "hq0n0cg", "is_submitter": "False", "link_id": "t3_ro959j", "parent_id": "t3_ro959j", "score": "4", "subreddit": "hungary", "subreddit_id": "t5_2qzzt"}, {"author": "Earthisacultureshock", "body": "These are the ones I often hear or use:  \n\\- Megered a nyelved valakinek  \n\\- A nyelvére vesz valakit (but I've heard it more as \"Szájára vesz valakit\")  \n\r\r\\- Ott van a nyelvén and Valakinek a nyelve hegyén van valami  \n\\- A nyelvét köszörüli valakin  \n\\- Beletörik a nyelve valamibe  \nElvitte a cica a nyelvedet? (It's sarcastic and it's used when you want to mock someone)  \n\\- Vigyázz a nyelvedre! (or \"Vigyázz a szádra!\")  \n\\- Töri a nyelvet (for example \"Töri a magyart\" \"Töri az angolt\")  \n\r\\- Tud valakinek a nyelvén beszélni   \nMainly in concrete expressions.   \nFor example \"Tud beszélni az állatok nyelvén\" = he/she understands animals very well, knows exactly what they need or \"Tud beszélni a gyerekek nyelvén\" = the same just with children.   \nAnother version of that with the same meaning: \"Ért valakinek a nyelvén\" (actually, I hear it more often), for example \"Ért az állatok nyelvén\"", "created_utc": "1639952380.0", "edited": "False", "id": "hp7zyqz", "is_submitter": "False", "link_id": "t3_rk1r5z", "parent_id": "t1_hp7ompy", "score": "4", "subreddit": "hungarian", "subreddit_id": "t5_2xeuq"}, {"author": "Earthisacultureshock", "body": "Unfourtunately, it happened in my home country, Hungary, too. But I can't speak for other countries.", "created_utc": "1639747163.0", "edited": "False", "id": "howxbru", "is_submitter": "False", "link_id": "t3_ri4ov7", "parent_id": "t1_howqzgp", "score": "10", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "Earthisacultureshock", "body": "Well, I think it depends. I would say we have three national holidays (+ one, the Labour Day on May 1st). \n\nThe 15th of March and 23rd of October are the days to commemorate the revolutions and wars of independence of 1848 and 1956, and they are mainly just days off from school and work. On TV there are parades, politicians have speeches, maybe films about these days. In school (and maybe in kindergarten, but I'm not sure) there are commemorations before these days, so children are taught what's going on. But all in all, most people don't really care. Us neither.\n\nAs I've seen it, the 20th of August is different. Depending on the era, it's always had a different meaning, so actually, it's \"the birthday of Hungary\", the holiday of St. Stephen (our first king and national saint) and the celebration of the \"new bread\". On the 20th of August, there is a firework in almost every place, even in the tiniest village. In the capital, Budapest, there is always a big celebration, in Debrecen, there is the flower carnival. In a lot of villages (not everywhere but in a lot of places), often around this time of the year or on this day, there is something called Falunap (village day) when there are sales, cooking competitions, some musicians are invited, and it's crowned with a firework.\n\nWhen I was younger, we always went to the Falunap, but recently, it's been just a day off. There were years (pre-covid) when we went to Budapest to watch the firework, but unfortunately, that's it.", "created_utc": "1639578310.0", "edited": "False", "id": "honaweb", "is_submitter": "False", "link_id": "t3_rgvfio", "parent_id": "t3_rgvfio", "score": "1", "subreddit": "AskEurope", "subreddit_id": "t5_2uayg"}, {"author": "Earthisacultureshock", "body": "Egy ideális világban lenne elég tanárnak jelentkező pont az ilyenek helyére :(", "created_utc": "1639144872.0", "edited": "False", "id": "hnzjxkf", "is_submitter": "False", "link_id": "t3_rciqe6", "parent_id": "t1_hnz6lrj", "score": "1", "subreddit": "hungary", "subreddit_id": "t5_2qzzt"}, {"author": "Earthisacultureshock", "body": "Ez eléggé unpopular opinion, de én személy szerint 10. felett egy humán és egy reáltárgyat tennék csak kötelezővé, abból kéne érettségizni, plusz egy idegennyelv az érettségihez, a többi válaszható. Ahogy nekem szenvedés volt a sok reáltárgy, úgy én nem akarom, hogy szenvedjenek a reálosok a sok humántárggyal.\n\nA kötelező alapszintet általánosban, esetleg középsuli elején kéne a gyerekekkel megismertetni és akkor úgy megtanitani, hogy meg is maradjon.\n\nViszont ha már a vakcina és az immunrendszer, a biológia tananyagot is meg kéne reformálni általánostól kezdve. Nem tudom mikor jártál, de szerintem inkább kéne az emberrel kezdeni, azt elemezgetni hónapokig, mint a forró övezet növenyvilágát vagy a szivacsok működését. Gyakran nem is jut idő az emberre, vagy ha igen, akkor ki figyel már, a növények után el lett könyvelve a biosz unalmasnak. Fordított esetben, ha épp nem jutna annyi idő a növenyekre, de az embert átbeszéltük, az kevesebb kár. Szerintem. Persze ideális esetben mindenre van elég idő, csak a valóság...\n\nA fizikához még ennyire sem értek, de azt látom, hogy ott is át kéne rendezni az anyagot.", "created_utc": "1639144710.0", "edited": "False", "id": "hnzjlkt", "is_submitter": "False", "link_id": "t3_rciqe6", "parent_id": "t1_hnzheo0", "score": "1", "subreddit": "hungary", "subreddit_id": "t5_2qzzt"}, {"author": "Earthisacultureshock", "body": "Én nagyon meglepődtem, hogy amikor tanultuk az érvelést, mennyien nem éreztek rá, mennyien nem látták át. És nagyon sajnálom, hogy ezt és a hivatalos levelet kiveszik a magyar érettségikből (az egyetlen igazán értelmes dolgot)", "created_utc": "1639138021.0", "edited": "False", "id": "hnz7tx9", "is_submitter": "False", "link_id": "t3_rciqe6", "parent_id": "t1_hnwmgp2", "score": "2", "subreddit": "hungary", "subreddit_id": "t5_2qzzt"}, {"author": "Earthisacultureshock", "body": "A természettudományokat én nem venném bele a fő tárgyakba, mert egy olyannak, aki tudja már, hogy nem akar velük foglalkozni, felesleges 4 éven keresztül heti 2 órában bent ülni rajtuk. Saját tapasztalat, a tanár és a diák is szenved így. Vagy ha már muszáj lett volna választani, én inkább tanultam volna kémiát és föcit 3 évig, mint fizikát és bioszt, azokat nagyon nem szerettem. De nem ez volt a tantervben. Kéne mindegyikből valanennyi, de én inkább válaszhatóvá tenném ki melyikben akar jobban elmélyedni.\n\nA faktok a legtöbb helyen egyébként heti 2 vagy 3 órásak.", "created_utc": "1639137855.0", "edited": "False", "id": "hnz7knh", "is_submitter": "False", "link_id": "t3_rciqe6", "parent_id": "t1_hnwptpj", "score": "0", "subreddit": "hungary", "subreddit_id": "t5_2qzzt"}, {"author": "Earthisacultureshock", "body": "Ebben szerettem én nagyon a töritanáromat gimiben. Nála is kellett persze évszámokat, neveket tudni, de ő sokkal inkább arra ment rá, hogy átlássuk a folyamatokat, tudjunk párhuzamokat vonni, megértsük mi miért történt. Ezt úgy, hogy nem tanított mindent, csak az érettségi és az összefüggések szempontjából fontos dolgokat és még szórakoztatva is adta elő. Nagyon sajnálom, hogy nem ilyen az összes töritanár.", "created_utc": "1639137050.0", "edited": "False", "id": "hnz6fdz", "is_submitter": "False", "link_id": "t3_rciqe6", "parent_id": "t1_hnyfwky", "score": "1", "subreddit": "hungary", "subreddit_id": "t5_2qzzt"}, {"author": "Earthisacultureshock", "body": "Ebből is látszik mennyire kiölik belőlünk eddigre az érdeklődést. Sokszor vettem/veszem észre sajnos én is magamon, hogy csak haladjunk, diktálja le, kérdezzek ki, ne kínlódjunk, hagyjuk egymást. Nagyon ehhez lettünk hozzászoktatva sajnos.", "created_utc": "1639128280.0", "edited": "False", "id": "hnyvjgq", "is_submitter": "False", "link_id": "t3_rciqe6", "parent_id": "t1_hnyucgh", "score": "1", "subreddit": "hungary", "subreddit_id": "t5_2qzzt"}, {"author": "Earthisacultureshock", "body": "Na igen. Amikor épp azon idegeskedsz hogy fogsz felkészülni a többi órára, hogy fogod a házikat megcsinálni, és még magánórára is tanulni kéne, akkor nem az öröm, hanem a sírás kerülget, ha a tanár projektet akar csináltatni.", "created_utc": "1639125127.0", "edited": "False", "id": "hnyrsqx", "is_submitter": "False", "link_id": "t3_rciqe6", "parent_id": "t1_hnypdbc", "score": "1", "subreddit": "hungary", "subreddit_id": "t5_2qzzt"}, {"author": "Earthisacultureshock", "body": "A menzát is meg kéne újítani.\n\nSzerintem több választható kaját kéne biztosítania a menzáknak, ahol a diákok össze tudnák válogatni milyen levest milyen másodikkal, milyen körettel, esetleg milyen desszerttel (nem feltétlen kell édességre gondolni, gyümölcsből is sok mindent ki lehet hozni) ennének szívesen. Ezeket ott helyben fizetnék ki, akinek kedvezményes étkezése van, az kaphatna valami pontgyűjtő füzet-szerűséget, ahol jegyzik, hogy aznap evett-e már (félek egy digitális módszer meghaladná a rendszer képességeit). Egy ilyen rendszer abban is kedvezne, hogy ha épp nincs időm enni nem dobom ki a pénzt az el nem költött kajára, ha viszont van időm és éhes is vagyok, akkor nem akadály, hogy nem vagyok menzás. Szerintem többeket bevonzott volna ez így az én időmben. Ez egy iskolára talán sok így, viszont közel lévő iskolák, kollégiumok menzáját egybe is lehetne vonni, úgy talán kevésbé lenne költséges. \n\nDe ha valaki, aki dolgozott menzán vagy foglalkozott ilyesmivel, és ki tudna javítani, ki tudná egészíteni, annak örülnék.", "created_utc": "1639086831.0", "edited": "False", "id": "hnwmp56", "is_submitter": "False", "link_id": "t3_rciqe6", "parent_id": "t3_rciqe6", "score": "2", "subreddit": "hungary", "subreddit_id": "t5_2qzzt"}, {"author": "Earthisacultureshock", "body": "Nem tudom ezt írta-e már valaki, de én több válaszható órát tennék az órarendbe középiskolában, legalábbis gimnáziumokban biztos. Nagyon nagy probléma, hogy a diákoknak sokszor végig kell ülniük olyan órákat, amik a legkevésbé sem érdeklik őket, amikkel tudják, hogy nem akarnak foglakozni (minek legyek bent 11.-ben fizikán, ha bölcsésszakra megyek, vagy 12.-ben rajzon, ha nincs hozzá tehetségem és egyébként is más terveim vannak) és a tanárt is demotiválja a sok unatkozó, mást tanuló, telefont nyomkodó diák.\n\nEzt az egészet álmaimban kicsit hasonlóan képzelem el az egyetemhez.\n\nLennének a kötelező tárgyak, amiket mindenkinek meg kell csinálni. Ezen kívül viszont neked kell feltölteni az órarended, csak az lenne megadva hány órádnak kell legyen egy héten. Félévenként lehet cserélni ezeket az egyeb tárgyakat. \n\nEz egyrészt azért lenne jó, mert tudnának a diákok kísérletezni, sokkal könnyebbb egy félév után rájönni, hogy valaminek már a bevezetője sem tetszik, mint egyetemen, miután elpazaroltak rá több félévet, de csak nem hagyják ott. Másrészt tudnák jobban az alvási ciklusukhoz is igazítani. Például nekem halál volt bemenni 8-ra, bejárósként fél hatkor keltem, más viszont szenvedett azzal, hogy neki négykor még bent kellett ülnie. Egyetemen áldás, hogy olyan kevésszer kell bemennem 8-ra, amennyire csak lehet. Inkább ülök bent este, csak ne kelljen reggel felkelni. Harmadrészt, a tanároknak kevesebbet kéne olyanokkal szenvedni, akik menekülnének az órájukról. Pont, amit fent írtam.\n\nA probléma viszont a tanárhiány. Honnan szedsz mindenféle érdekes tárgyhoz tanárokat, ráadásul nem csak egy iskolába, hanem mindegyikbe? Jelenleg sehogy. Talán ezen segítene, ha a középiskolák átjárhatóbbak lennének, például városon belül, felvehetnéd másik helyen is az óraidat, de akkor is ki kell képezni új tanárgenerációkat.", "created_utc": "1639085608.0", "edited": "False", "id": "hnwjp8g", "is_submitter": "False", "link_id": "t3_rciqe6", "parent_id": "t3_rciqe6", "score": "7", "subreddit": "hungary", "subreddit_id": "t5_2qzzt"}, {"author": "Earthisacultureshock", "body": "Nálunk is sok tanár panaszkodott, hogy úgy elidőzne még dolgokon, úgy venné ezt inkább, de rohanni kell az anyaggal.\n\nMég amire több tanár is panaszkodott, hogy zavarja őket 30-40 fős osztályoknak órát tartani, úgy érezték annyira nem lehet így kommunikálni és együtt dolgozni a gyerekekkel, annyival jobban szerették, ha csoportbontott órákon taníthattak.", "created_utc": "1639084097.0", "edited": "False", "id": "hnwfz6u", "is_submitter": "False", "link_id": "t3_rciqe6", "parent_id": "t1_hnv0e6z", "score": "6", "subreddit": "hungary", "subreddit_id": "t5_2qzzt"}, {"author": "Earthisacultureshock", "body": "Sok pénzt lehet keresni matek magántanárként, ritka az olyan sulis tanár, aki érthetően el tudja magyarázni az anyagot és azt kéri számon, amit leadott.", "created_utc": "1639083884.0", "edited": "False", "id": "hnwfgbe", "is_submitter": "False", "link_id": "t3_rciqe6", "parent_id": "t1_hnvjf7w", "score": "4", "subreddit": "hungary", "subreddit_id": "t5_2qzzt"}, {"author": "Earthisacultureshock", "body": "Pontosan. Hiába van benne, oda nem jutnak el, vagy a jogi, állampolgári ismeret részekre rávágják a tanárok, hogy nem értenek hozzá.", "created_utc": "1639083706.0", "edited": "False", "id": "hnwf0i7", "is_submitter": "False", "link_id": "t3_rciqe6", "parent_id": "t1_hnwegbj", "score": "2", "subreddit": "hungary", "subreddit_id": "t5_2qzzt"}, {"author": "Earthisacultureshock", "body": "A magyar töri most is odáig tart, utána van még egy állampolgári ismeretek témakör, de azzal már nem nagyon foglalkozik senki.", "created_utc": "1639083570.0", "edited": "False", "id": "hnweodr", "is_submitter": "False", "link_id": "t3_rciqe6", "parent_id": "t1_hnw1qoi", "score": "1", "subreddit": "hungary", "subreddit_id": "t5_2qzzt"}, {"author": "Earthisacultureshock", "body": "Csak az is baj, hogy erre kell tanár is :( Amikor emelt töri fakultáción a tanár megszólal, hogy milyen jó, hogy emelten tétel az alaptörvény, legalább most megtudja mi van benne, azért az sokat elmond. A törinek része egyébként az állampolgári ismeretek, viszont a töritanárok jó része nem ért hozzá, nincs rá kiképezve, így kb. passzolgatva van a töri-föci tanárok között és a vége az, hogy senki nem beszél róla. Az EU is része az anyagnak, de az is annyira a végén van, hogy nincs rá idő nagyon, és hiába emelteztem töriből, a sok infó között teljesen elfelejtettem mi volt az EU-s résznél (bár erről tehet az online oltatás is)\n\nEgyre hallom, hogy bizonyos állami sulikba (ahol hallottam mind mostani nevén már technikumok) elkezdték bevezetni a jogot vagy a pénzügyet, de a tanár szárazon tartja, a diákokat nem köti le, és sokszor panaszkodtak rá a diákok, hogy milyen nyűg. Amik megint csak problémák, így nem lehet megtanítani valami fontosat nekik.", "created_utc": "1639083421.0", "edited": "False", "id": "hnwebh1", "is_submitter": "False", "link_id": "t3_rciqe6", "parent_id": "t1_hnuzxn1", "score": "3", "subreddit": "hungary", "subreddit_id": "t5_2qzzt"}, {"author": "Earthisacultureshock", "body": "A legjobb azt hallani, amikor a tanár meséli, hogy a kémiaeszközök idősebbek nála", "created_utc": "1639082820.0", "edited": "False", "id": "hnwcu1r", "is_submitter": "False", "link_id": "t3_rciqe6", "parent_id": "t1_hnv1a8p", "score": "9", "subreddit": "hungary", "subreddit_id": "t5_2qzzt"}, {"author": "Earthisacultureshock", "body": "Igen, a karrier tanácsadás nagyon hiányzik és lenne is rá igény. Általános és középsuli végén is. Ahova én jártam városba, ott volt lehetőség pszichologusoktól pályaválsztással kapcsolatban tanácsot kérni, de nehéz volt bekerülni, rengetegen mentek. Utolsó évben egy nagyon jó pszichológus került a sulikba, ő is csinált pályaválasztási tanácsadást. Alig lehetett időpontot kapni hozzá. Ő azt mondta, hogy az a baj, hogy nincs elég ember, aki csinálná.\n\nBár lehet már az is segítene, ha jobban el tudnánk érni embereket, akik beszélnek a saját munkájukról és lennének átlátható anyagok, hogy egyes szakmákban mit csinálnak, egyes egyetemeken egyes szakokon mit tanulnak, azzal hova lehet menni dolgozni. A konkrétság és a kézzelfoghatóság hiánya elég nagy gond. (Elég felnézni a felvire, a szakleírások nesze semmi, és ez csak a felszín) Ha nem tudjuk milyen lehetőségeink vannak, nem tudjuk elképzelni a jövőnket.", "created_utc": "1639082670.0", "edited": "False", "id": "hnwcgh0", "is_submitter": "False", "link_id": "t3_rciqe6", "parent_id": "t1_hnuuf5z", "score": "19", "subreddit": "hungary", "subreddit_id": "t5_2qzzt"}, {"author": "Earthisacultureshock", "body": "Ehhez annyit tennék még hozzá, hogy néha a diákok is gátjai a változásnak, legalábbis saját osztálytársaim körében ezt láttam. Például mennyire fontosnak tartotta mindenki, hogy legyen média, ahol beszélünk aktuális témákról, próbálnak kritikus gondolkodásra nevelni minket, aztán amikor lett médiánk, hiába próbálkozott ezzel a tanár, a legtöbben inkább házit írtak a \"fontosabb\" tárgyakra vagy nyomkodták a telefont (én a ritka kisebbség voltam, hogy figyeltem). Pont ez az óra az egyik jó példa volt arra is, mennyire belénk nevelték már a dolgozat-formájú számonkérést. Hiába adott a tanár médiából projektet dolgozat helyett, inkább csak mindenki dünnyögött rajta. Egyszer irodalomból is kellett projekként feldolgozni valamit, de szintén ugyanez, inkább nyűgként álltunk neki. Ami végtelenül szomorú egyébként.", "created_utc": "1639081501.0", "edited": "False", "id": "hnw9k08", "is_submitter": "False", "link_id": "t3_rciqe6", "parent_id": "t1_hnuwouk", "score": "2", "subreddit": "hungary", "subreddit_id": "t5_2qzzt"}, {"author": "Earthisacultureshock", "body": "Amikor én nemrég voltam covidos, akkor a kontaktjaimat kérte a háziorvos, hogy menjenek be a rendelőbe és majd ott csinálnak nekik gyorstesztet. Nem is értettem. Nem tudom máshol is ez-e a gyakorlat.", "created_utc": "1638608568.0", "edited": "False", "id": "hn6drvu", "is_submitter": "False", "link_id": "t3_r8g1ts", "parent_id": "t3_r8g1ts", "score": "1", "subreddit": "hungary", "subreddit_id": "t5_2qzzt"}, {"author": "Earthisacultureshock", "body": "I think Hungarian gamers use the same word (dungeon). In gaming, often English terms are used, ocassionally with Hungarian pronunciation and conjugation.", "created_utc": "1636926010.0", "edited": "False", "id": "hkn2i03", "is_submitter": "False", "link_id": "t3_qtqqtc", "parent_id": "t3_qtqqtc", "score": "6", "subreddit": "hungarian", "subreddit_id": "t5_2xeuq"}, {"author": "Earthisacultureshock", "body": "I also had a dream, where I was a player, but somehow I could manage to become a pink guard (somehow stole one of their clothes and mask) I was trying to find out how to escape but I realized some of my acquaintances were doing the same (being a pink guard and trying to escape), I even talked one of them. I also remember becoming suspicious and almost being caught. But unfourtunately I got up before seeing how it ended up.", "created_utc": "1636585187.0", "edited": "False", "id": "hk4q5um", "is_submitter": "False", "link_id": "t3_qr1pwa", "parent_id": "t1_hk48zsd", "score": "8", "subreddit": "squidgame", "subreddit_id": "t5_4wyeb7"}, {"author": "Earthisacultureshock", "body": "És látod sajnos mégsem :(", "created_utc": "1636456095.0", "edited": "False", "id": "hjx8c3u", "is_submitter": "False", "link_id": "t3_qpl33z", "parent_id": "t1_hjwzeq0", "score": "2", "subreddit": "hungary", "subreddit_id": "t5_2qzzt"}, {"author": "Earthisacultureshock", "body": "Nekem hihetetlen volt szembesülni azzal, hogy van még mindig olyan ember, aki azt hiszi, hogy amit a tévé mond, az úgy igaz. Egy hozzám nagyon közel álló 70+-os emberrel egyszer beszélgettünk, és megjegyeztem az épp tévében menő tartalomra, hogy ez nem biztos, hogy így van, a tévében nem mindig mondják az igazat (nem ezekkel a szavakkal, de ez volt a lényeg) Az a döbbent arc, mint akiben egy világ omlott össze. Pedig én csak kimondt valamit, ami a korosztályom számára nyilvánvaló...\n\nÉn sem mondom azt, hogy a nyugdíjasok hülyék. Csak egy más világban, más normák között felnőtt generáció.", "created_utc": "1636427481.0", "edited": "False", "id": "hjw2hax", "is_submitter": "False", "link_id": "t3_qpl33z", "parent_id": "t1_hjulb89", "score": "3", "subreddit": "hungary", "subreddit_id": "t5_2qzzt"}, {"author": "Earthisacultureshock", "body": "Szerintem ez csak népnyugtató- és propaganda-szöveg (a vicc az egészben, hogy van olyan fideszes ismerősöm is, aki ezt gondolja) Az én környezetemben 4 embert tudok, magamat is beleértve, aki Pfizerrel lett oltva kétszer, és mégis beteg. (Van más beteg is, aki oltott, csak nem tudom mivel, és van olyan is, aki oltott, de nem beteg vagy csak nem tudjuk)", "created_utc": "1636424654.0", "edited": "False", "id": "hjvw8ck", "is_submitter": "False", "link_id": "t3_qp8ygn", "parent_id": "t1_hjs5sxb", "score": "1", "subreddit": "hungary", "subreddit_id": "t5_2qzzt"}, {"author": "Earthisacultureshock", "body": "A én környezetemben azért Pfizeresek között is vannak covidosok. Velem együtt 4-ről tudok, aki két Pfizert kapott, és elkapta.", "created_utc": "1636423945.0", "edited": "False", "id": "hjvumhv", "is_submitter": "False", "link_id": "t3_qp8ygn", "parent_id": "t1_hjs9p1i", "score": "1", "subreddit": "hungary", "subreddit_id": "t5_2qzzt"}, {"author": "Earthisacultureshock", "body": "Nálunk a tesztelés így volt (nem tudom máshol így van-e, én ezen eléggé meglepődtem): Szombaton lettem itthon csinált gyorsteszttel pozitív (előtte volt több negatív gyorstesztem). Mivel a szüleimmel és a kiskorú tesvéremmel élek, az egyik szülő vette fel a kapcsolatot a háziorvossal, neki azt mondták, a kontaktoknak (családtagjaimnak) a rendelőbe kell menni hétfőn, ott csinálnak nekik tesztet, nekem már nem kell menni, az itthon házilag elvégzett gyorsteszt elég. El is mentek, csináltak mindenkinek egy-egy gyorstesztet, két negatív egy pozitív. És ennyi. Semmi pcr, se a negatívakra, se a pozitívra. A negatívakat se tesztelték még egyszer nem-e false az eredmény. Azért itthon kell maradniuk, mert a kontaktjaink, de így ennyi.\n\nNem tudom ez a módszer mennyiben befolyásolja a tesztek számát és az arányokat. Korábban merült már fel nálunk covid gyanú, akkor jött tesztes kocsi, csináltak gyorstesztet is, de pcr-t is (akkor minden negatív volt)", "created_utc": "1636423035.0", "edited": "False", "id": "hjvskny", "is_submitter": "False", "link_id": "t3_qp8ygn", "parent_id": "t1_hjs6f3o", "score": "1", "subreddit": "hungary", "subreddit_id": "t5_2qzzt"}, {"author": "Earthisacultureshock", "body": "Actually, it depends. There are people, who are really sensitive to mentioning their mother in contexes like that - even if it's just a swear word and no one mean it literally. I knew someone, you could say anything to her, she didn't care or made fun of that but when you mentioned her mother, she just freaked out and became incredibely defensive.", "created_utc": "1636412522.0", "edited": "False", "id": "hjv59z9", "is_submitter": "False", "link_id": "t3_qp2382", "parent_id": "t1_hju2img", "score": "2", "subreddit": "budapest", "subreddit_id": "t5_2rxz1"}, {"author": "Earthisacultureshock", "body": "I know some things about it, because I live next to the border, and my parents and my grandma often mention it (at that time my grandma worked at the railways and commuted to work to Romania). My grandma worked in Romania during the revolution, and she told a lot about how terrifing it was, that there were shootings, they were told not to go close to the windows, and they were even allowed not going to work (but she went). I had a Romanian teacher, and she also talked about regime and the revolution, she told us stories, and how she, an ordinary person felt. A relative of mine living in Romania also talked about the situation during the revolution. My mom had a classmate from Romania, and later, my mum told me about her classmate's experiences, her fear, the insecurity, that she saw so many corpses and how terrified she was. Despite the fact, these aren't historical facts, I think because of the personal stories the events of that time came closer to me. At school, we learnt some things about it, it was a part of the curriculum when we talked about the fall of the iron curtain and the events of 1989-91. But the emphasis wasn't on that.", "created_utc": "1636044824.0", "edited": "1636045449.0", "id": "hjawwbr", "is_submitter": "False", "link_id": "t3_qmiqw7", "parent_id": "t3_qmiqw7", "score": "2", "subreddit": "hungary", "subreddit_id": "t5_2qzzt"}, {"author": "Earthisacultureshock", "body": "Ez most sokat jelentett és sok sokat segített, az awkward szituknál probálok majd visszagondolni ezekre. És köszi az ajánlást is, bele fogok nézni.", "created_utc": "1635714598.0", "edited": "False", "id": "hit6oc5", "is_submitter": "False", "link_id": "t3_qj7u9n", "parent_id": "t1_hird5uo", "score": "1", "subreddit": "hungary", "subreddit_id": "t5_2qzzt"}, {"author": "Earthisacultureshock", "body": "Lehet majd idővel, ha elkezdek dolgozni változik a helyzet (mondjuk az egyetemre is ezt mondtam, aztán mi kett belőle) Hogy lendültél túl az awkward szitukon?\n\nEgyébként a kudarcok tartanak vissza. Tudom, ez nem jó válasz. Sokszor fogalmam sincs milyen témát dobjak fel, vagy ha van is valami, akkor sokszor nincs rá válasz. Amikor aztán végre úgy döntök nyitok is egy kicsit, és akkor elkezdek beszélni dolgokról bővebben, akkor gyakran találkozok azzal a reakcióval, hogy másokat nem érdekel. Ilyenkor meg inkább nem akarok kellemetlenséget okozni. Úgyhogy újra bezárkózok. És megint elkezd zavarni a zárkózottságom, nagy nehezen próbálok nyitni, de megint ugyanaz. Ez ismétlődik újra és újra. Az sem segít, hogy mire esetleg feloldódnék, addigra már mindegy mert az illető \"továbbállt\", elkönyvelt valakinek, akivel nem lehet beszélgetni, kialakult egy társaság, amibe már nem férek be.", "created_utc": "1635681722.0", "edited": "False", "id": "hir7f7j", "is_submitter": "False", "link_id": "t3_qj7u9n", "parent_id": "t1_hir6k80", "score": "1", "subreddit": "hungary", "subreddit_id": "t5_2qzzt"}, {"author": "Earthisacultureshock", "body": "Ezt aláírom a mindig telefont nyomkodó, rideg, karót nyelt ember szemszögéből. Nagyon nehezen nyitok, nem is tudom hogy kezdeményezzek beszélgetést, a probálkozásaim is legtöbbször kudarca fulladnak. Így a telefon jobb társaságnak tűnik, az legalább nem olyan kellemetlen, mint bámulni a falat. Viszont annyira örülök/örülnék, ha valaki kezdeményezne, és addig-addig probálkozna, amíg túl nem lendülnék a pánikon, hogy most kommunikálni kell és értelmesen tudnánk beszélgetni. Csak kevés ilyen ember van, és nem várhatom el mástól, hogy odajöjjönek. Tudom, hogy rajtam is múlik, és jobban kéne megpróbálnom nyitni, de nagyon nehéz.", "created_utc": "1635680933.0", "edited": "False", "id": "hir6cek", "is_submitter": "False", "link_id": "t3_qj7u9n", "parent_id": "t1_hip2xvk", "score": "1", "subreddit": "hungary", "subreddit_id": "t5_2qzzt"}, {"author": "Earthisacultureshock", "body": "Gyerekkori barátokkal ugyanez, de nekem az általánosból megismert barátokkal is. Annyira eltávolodott az érdeklődési körünk, annyira más lett a fontos mindenki számára, hogy egy idő után felesleges volt untatni egymást, és fenntartani a legjobb barátok látszatát. Most már ha néha összefutunk, akkor beszélünk, másképp nem keressük egymást, de jobb is így. Legalábbis az én részemről. Utólag visszagondolva nem is tudom, hogy mennyire volt igaz barátság, vagy csak egymás mellé sodródtunk, mert senkinek nem volt senkije, és megpróbáltuk együtt túlélni. Szeretnék hinni benne, hogy ez nem így volt, de amilyen különbözőek voltunk már a kezdetektől, amennyi dolgot nem mondtunk el egymásnak... Mondjuk van olyan gyerekkori barátom, akivel nem bánom, hogy az útjaink külön váltak, mert csak lehúzott és rombolta az önbizalmamat.", "created_utc": "1635680035.0", "edited": "False", "id": "hir55be", "is_submitter": "False", "link_id": "t3_qj7u9n", "parent_id": "t1_hioiybp", "score": "1", "subreddit": "hungary", "subreddit_id": "t5_2qzzt"}, {"author": "Earthisacultureshock", "body": "Pont így vagyok én is. Bár mi jelenlétiben kezdtünk, akkor próbáltam barátkozni, de miután bejött az online oktatás, nem nagyon beszéltem senkivel. Most, hogy visszamentünk, hiába próbáltam csapódni a korábbi társasághoz, annyira érződött, hogy én vagyok a plusz ember (ha odamentem megakadt a beszélgetés, nem nagyon tudtam a témához szólni, ők nem jöttek oda hozzám, csak én hozzájuk), úgyhogy már nem is próbálkozok. Persze, ha valakivel valahogy elkezdünk beszélgetni, vagy kérdeznek tőlem valamit, vagy én tőlük, akkor nem vagyunk bunkók egymással. Olyan semleges a viszony. Csak valahol azért mégis fáj.\n\nA gimis barátaimmal chatelni szoktunk általában, de ott is csak a közös csoportban, és legtöbbször kimerül az egész abban, hogy egyikünk háborog a tanárokon, a többiek próbálunk megértők lenni, tanári aranyköpéseket küldünk, illetve az egyikük Tik-Tok videókat küld. De ez is olyan felüdülés tud lenni. Nagyon ritkán jön az össze, hogy fel tudjuk hívni egymást, mindig mindenkinek van dolga, mindig mindenki elfelejti, hogy a másik felvetette, hogy hétvégén beszélhetnénk (nem vagyok ez alól én se kivétel, annyira a zh-kon pörög az agyam, hogy teljesen kiment legutóbb is a fejemből). Személyesen még ritkábban találkozunk, mert ahányan vagyunk annyi helyre mentünk, egyikükkel mentünk egy városba, vele tavaly egy helyen is laktunk, de a húga is itt tanul idéntől, így már nem lakunk együtt. Amennyi óránk van, és ahogy az óráink vannak, úgy meg találkozni esélytelen. Van másik barátom is, aki egy másik középsuliba, de ugyanabba a városba járt, ahova én, csak ő fiatalabb és maradt még 5. évre. Mióta egyetemen vagyok, alig látjuk egymást, alig beszélünk. Megint egy másik kiment pár éve külföldre, azóta a kapcsolatunk (kezdetben főleg az én hibámból) nagyon hullámzó, de az utóbbi időben egyre kevesebb a közös témánk, és egyre ritkábban hívjuk egymást, egyre ritkábban ír vissza, mindenféle indokokkal, amik nem tudom eldönteni, hogy kifogások, vagy tényleg ilyen szétszórt. (Fenntartom az utóbbira is a lehetőséget, révén én is elég szétszórt vagyok és el tudok feletkezni visszaírni)\n\nMost van egy másik lakótársam, vele egész jól kezdünk összeszokni, de mindketten elég visszahúzódók vagyunk, és így nehéz. Hazaérünk, beszélgetünk, de utána mindenki a saját dolgaival van elfoglalva. De olyan jó, hogy ő van, teljesen egyedül megőrülnék (hiába vagyok introvertált, mítosz az, hogy nekünk nincs szükségünk emberi kapcsolatokra)\n\nDe ez az egész tudom, hogy rajtam is múlik. Csak introvertáltként, ráadásul a zárkózott fajtaként nehéz. Inni se szeretek, mint minden igazi egyetemista. Néha azt is érzem, hogy olyan könnyű mondani, hogy iratkozz be ide, vagy keress embereket itt, de ha lenne is időm, annyira nem tudnám elképzelni magam, hogy csak odaállítok egyedül valahova. Pedig ez lenne a megoldás, csak mégis olyan nehéz ezt kezdeményezni, az első alkalom olyan nehéz.", "created_utc": "1635679405.0", "edited": "False", "id": "hir4c9u", "is_submitter": "False", "link_id": "t3_qj7u9n", "parent_id": "t1_hionoho", "score": "2", "subreddit": "hungary", "subreddit_id": "t5_2qzzt"}, {"author": "Earthisacultureshock", "body": "A másodikra még egy lehetőség: nem biztos, hogy a 6:30-assal beérnek időben. Ha 7-re kell mennem valahova, és a 6:20-assal 6:52-re érek be, a 6:30-assal meg 7:02-re, akkor a 6:20-assal fogok menni, mert nem szeretnék elkésni. És mivel mások is így vannak ezzel, ezért a 6:20-as tömött, a 6:30-ason meg már csak az utazik, akinek 7:10-re, 7:15-re vagy későbbre kell beérnie. \n\nLegalábbis nekem van hasonló tapasztalatom. Amikor 10-re kell bemennem az egyetemre, akkor vagy a 9:27-es vagy a 9:35-ös villamossal megyek, mindkettőn alig lehet mozdulni. De van egy nap, amikor nem egészkor, hanem 8:15-kor kezdünk, ilyenkor a 7:44-essel megyek, azon már alig van bárki is. És szerintem ennek az az oka, hogy azzal 8-ra nem érnének be az egyetemre. (Itt most egyetemistákról beszéltem, mert reggel ők utaznak nagyrészt itt, de ez tetszőlegesen behelyettesíthető bármivel, ahova embereknek nagy tömegben konkrét időpontra kell menni)\n\n\nEdit: távolsági buszokról volt szó, de akkor is igaz ugyanez. Sokan nem kockáztatják meg a késést.", "created_utc": "1633674906.0", "edited": "False", "id": "hftr3sn", "is_submitter": "False", "link_id": "t3_q3qk25", "parent_id": "t3_q3qk25", "score": "4", "subreddit": "hungary", "subreddit_id": "t5_2qzzt"}, {"author": "Earthisacultureshock", "body": "I'm not an ISFJ, but I've had the same issue, my auxiliary function is really underdeveloped. I'm an INFP, but my environment hasn't really supported me using Ne, so I focused more on using my Si and Te, and it was really hard to find out which is my real type. To this day, I have doubts, but I excluded all the other types. \n\nSo yes, it is possible to be an ISFJ with an underdeveloped Fe.", "created_utc": "1633265848.0", "edited": "False", "id": "hf7yk8a", "is_submitter": "False", "link_id": "t3_pzsbgm", "parent_id": "t3_pzsbgm", "score": "2", "subreddit": "isfj", "subreddit_id": "t5_2r39e"}]