[{"author": "easeandchance", "body": "I recommend mastering the 21 pop scout rush build order in the interactive build order mod - then just switch to mongols and it will be much smoother. \nhttps://buildorderguide.com/#/build/25 that should work, too.\nThe most important thing in my experience is to have enough wood for the stable when you reach feudal. So whichever bo you learn, it should include either sending some vills to wood when advancing or even earlier.", "created_utc": "1666787389.0", "edited": "False", "id": "ituig9k", "is_submitter": "True", "link_id": "t3_yd19az", "parent_id": "t1_itu5b68", "score": "2", "subreddit": "aoe2", "subreddit_id": "t5_2sg7u"}, {"author": "easeandchance", "body": "Do you maybe have a link to a build order that achieves that?", "created_utc": "1666696833.0", "edited": "False", "id": "itpjbqf", "is_submitter": "True", "link_id": "t3_yd19az", "parent_id": "t1_itpj92i", "score": "1", "subreddit": "aoe2", "subreddit_id": "t5_2sg7u"}, {"author": "easeandchance", "body": "That's something I have considered but am unsure about. My limited black forest experience were boom-only into post-imp all-in wars matches that took forever and were mostly decided by who had the better unit comp when the first battle hit. \n\nBut I have had to play against Khmer a lot and boy do I hate to see a group of chunky boys with chunky crossbows on their backs marching towards my considerably less chunky army. Would be fun to play that from the other side for once 11", "created_utc": "1666696788.0", "edited": "False", "id": "itpj96o", "is_submitter": "True", "link_id": "t3_yd19az", "parent_id": "t1_itpiphc", "score": "1", "subreddit": "aoe2", "subreddit_id": "t5_2sg7u"}, {"author": "easeandchance", "body": "Sounds good! I actually wasn't aware that there are viable non-dark age infantry rushes", "created_utc": "1666696379.0", "edited": "False", "id": "itpind1", "is_submitter": "True", "link_id": "t3_yd19az", "parent_id": "t1_itpexiy", "score": "1", "subreddit": "aoe2", "subreddit_id": "t5_2sg7u"}, {"author": "easeandchance", "body": "Correct me if I 'm wrong but it seems to me the rest of your point is a list of reasons for why Arabia should be called a semi-open map. I think your points might have some merit, but in this community we use the term \"open map\" for something you would define differently. So you can make very good points and still, the term stands and will not be changed anytime soon.\n\nIn addition, if you mark all maps in the in-game map selector and then deselect all \"open\" and \"closed\" maps you will see there are some maps left which are already \"semi-open\". \n\nSo what I want to say and what I hope the other commenter tried to convene is that the terms are already coined and defined. You can argue that their definitions should adhere to other rules, in other words, you could list good reasons why \"semi open\" would be more fitting than \"open\" for Arabia, but the terms are actually not open to discussion.", "created_utc": "1665451311.0", "edited": "False", "id": "iru3ca5", "is_submitter": "False", "link_id": "t3_y0b0zs", "parent_id": "t1_irtgc0r", "score": "1", "subreddit": "aoe2", "subreddit_id": "t5_2sg7u"}, {"author": "easeandchance", "body": "Iirc, according to the in-game map choice and the wiki, Arabia is indeed an open map https://ageofempires.fandom.com/wiki/Arabia", "created_utc": "1665428276.0", "edited": "False", "id": "irsn4y1", "is_submitter": "False", "link_id": "t3_y0b0zs", "parent_id": "t1_irrawij", "score": "2", "subreddit": "aoe2", "subreddit_id": "t5_2sg7u"}, {"author": "easeandchance", "body": "Thank you!", "created_utc": "1664214485.0", "edited": "False", "id": "ipzxjgm", "is_submitter": "False", "link_id": "t3_xoimf6", "parent_id": "t1_ipz3lim", "score": "1", "subreddit": "DnD", "subreddit_id": "t5_2r9ei"}, {"author": "easeandchance", "body": "Thank you!", "created_utc": "1664214454.0", "edited": "False", "id": "ipzxgoh", "is_submitter": "False", "link_id": "t3_xoimf6", "parent_id": "t1_ipz3iy7", "score": "1", "subreddit": "DnD", "subreddit_id": "t5_2r9ei"}, {"author": "easeandchance", "body": "**\\[5e\\] How do you find spells that you need but don't know about yet?**\n\nWhen I am looking for a spell, as a beginner, I don't want to find a \"conjuration\" spell or a spell that has a long range. Most resources filter spells like this. But first, I would like to find spells by what they generally do. What I mean is something like: \"Which spells deal damage?\" \"I need some spell to move myself or a fellow player during combat. Which are the utility spells?\" \"Where can I see the spells which buff a character?\" \"The enemy is to strong for a direct attack. Which debuffs are available?\"\n\nI haven't found a resource where I can sort the spells by their function or type. Is there some way to do this? Or do I just need to get familiar with all the available spells?", "created_utc": "1664202068.0", "edited": "False", "id": "ipz248n", "is_submitter": "False", "link_id": "t3_xoimf6", "parent_id": "t3_xoimf6", "score": "3", "subreddit": "DnD", "subreddit_id": "t5_2r9ei"}, {"author": "easeandchance", "body": "Could you tell me the title of that video, please? In other words, do you mean that one: [https://www.youtube.com/watch?v=3\\_CzhgFSxmY](https://www.youtube.com/watch?v=3_CzhgFSxmY) (title: \"All Techs in AoE2\")", "created_utc": "1663416264.0", "edited": "False", "id": "ioscr1j", "is_submitter": "False", "link_id": "t3_xarcx8", "parent_id": "t1_inv1tfy", "score": "1", "subreddit": "aoe2", "subreddit_id": "t5_2sg7u"}, {"author": "easeandchance", "body": "Can you please tell me which video that is?", "created_utc": "1662835834.0", "edited": "False", "id": "inw0ko5", "is_submitter": "False", "link_id": "t3_xarcx8", "parent_id": "t1_inv4izo", "score": "7", "subreddit": "aoe2", "subreddit_id": "t5_2sg7u"}, {"author": "easeandchance", "body": "Thank you for your comprehensive reply! \n\nI am talking about a Bachelor's in Central Europe and in social sciences. \n\nSimilar to my response in another comment, I am not really 50 paces ahead of the current status, but I would like to plan ahead. This does not mean that I am planning to do something specific , but that I am considering different options and this is one option I am not sure about - which is why I asked reddit. In more practical matters, I could probably have waited with this question until I got to know the new professor, but I thought thinking about my options and doing something can exist separately. \n\nBecause I have received such stark backlash which I did not expect, I feel like I have to defend myself a bit. I am actually a bit shocked by the responses I got here, as they are pretty serious in nature. \n\nI have already worked with my supervisor for about nine months. In that time, I tried to plan regular meetings about my progress (every month or so). However, in that time, my supervisor did not read my status updates/inspect my progress or showed much interest in that, which was apparent in the few meetings we had. Many times, planned meetings were cancelled because of organizational issues and despite me asking to reschedule instead of cancelling. In total, we met about 6h in the 9 months. Additionally, I am friends with a TA at her chair and two flatmates of mine were student assistants for her for two years (incl during the timeframe I was supervised by her) and both agreed with my assessment regarding us working together. And lastly, she herself made comments about my research interest not really being her cup of tea and that she might not be of much help because that and because of her many other duties as a professor. So my assumptions here are not baseless. Still, I feel like I need to stress that I raised a hypothetical question here and did not act yet but merely consider my options.\nMaybe I could have communicated these issues more clearly? \n\nI feel it's important to point out that in my culture flirting is not seen as a necessarily sexual behavior. You make a similar differentiation, too. But then in your last sentence you leave this important difference out and accuse me of something very grave which I did not do. I see that it might come off weird if one considers it a sexual issue, which I implicitly did not and explicitly do not.\nAdditionally, my comparison is about flirting and the hermeneutics of it and not our relationship. In my courses on cultural studies,  flirting was discussed as a specific way to communicate which also fulfills a specific function in a social and cultural setting, namely preventing to lose face, to the detriment of clarity in communication.  My statement was supposed to illustrate the observation of how in a professional and academic environment, where the setting and the relationship is opposite to the social and cultural setting of flirting, how in this situation, the intended result is similarly opposite, while the communication however might follow a similar structure and be similarly unclear. \n\nAll in all, I hope that it is now clearer why I thought that I considered her views and that I am not comparing our relationship to a sexual one. \n\nNonetheless, it is right that I have not yet asked her about her opinion and have just assumed what she might think. Clearly, this is a train of thought I need to work on, even though I alway planned on asking her about her opinion on the matter. It appears my thought process and my actions are not in harmony or my capacity to write comprehensible is lacking, or both. \nThis became clear to me when I saw that you said \"I think you need to sit down with your supervisor and have a conversation about how things are going. Perhaps you could suggest collaborating with this new PI or co-supervision now that she's not around?\" - which was basically my default strategy (sitting down with her I mean) and one of the other options I considered (I have discussed the idea of co-supervision with an academic coach and with fellow students) and which I considered more appropriate than what I presented here. That's exactly why I didn't ask about them but about the more questionable course of action.", "created_utc": "1662680258.0", "edited": "False", "id": "innoulp", "is_submitter": "True", "link_id": "t3_x8y6op", "parent_id": "t1_inktii4", "score": "-1", "subreddit": "AskAcademia", "subreddit_id": "t5_2sakj"}, {"author": "easeandchance", "body": "Can you please help me understand what makes you say yuck? Especially as you have \"linguistics\" as your flair I would really appreciate it if you could give me a pointer to what I  have done wrong with this sidenote. I considered it basically a harmless play on words or something like that (I don't really know a better term in english which is not my native language) and didn't think more than some seconds about it.", "created_utc": "1662675662.0", "edited": "False", "id": "inne5pm", "is_submitter": "True", "link_id": "t3_x8y6op", "parent_id": "t1_inmwass", "score": "1", "subreddit": "AskAcademia", "subreddit_id": "t5_2sakj"}, {"author": "easeandchance", "body": "Thank you for your response. \n\nI am quite surprised by the reactions I am getting to be honest. I am in no way doing anything before getting to know the other professor. Furthermore, I just asked reddit about this because this is the only situation where I am not sure what to do. I am basically planning for one of the possible outcomes in this situation, and I actually don't understand why this comes off as rushing things. Maybe you can help me understand that? \n\nRegarding your question:\nWhen I applied for my research project, the chair that would have fit my research interest best was vacant. She belonged to the right faculty, but had a completely different focus. The new professor belongs to the same faculty, but is filling the vacancy. I think it's important to know that my university is pretty small, so there is little overlap between chairs. I hope that explains it.", "created_utc": "1662675319.0", "edited": "False", "id": "inndbd8", "is_submitter": "True", "link_id": "t3_x8y6op", "parent_id": "t1_inljtgu", "score": "2", "subreddit": "AskAcademia", "subreddit_id": "t5_2sakj"}, {"author": "easeandchance", "body": "I think I see your point, but I can also imagine a revolution that is more peaceful than not that still holds the guys you named accountable and under control. \n\nApparently violence is seen as inevitable in contemporary left belief. It seems to me you absolutely answered my question, thank you for that!", "created_utc": "1661277955.0", "edited": "False", "id": "ilhik54", "is_submitter": "True", "link_id": "t3_wvn2ma", "parent_id": "t1_ilh3pha", "score": "1", "subreddit": "Socialism_101", "subreddit_id": "t5_2ys9x"}, {"author": "easeandchance", "body": "Thank you for your honest answer. I'm afraid that we have incompatible assumptions about whether or not a human life can be worthless in the grand scheme of things. However, that makes your response even more interesting for me and I will look into \"furies\" by Mayer. Thank you again", "created_utc": "1661277655.0", "edited": "False", "id": "ilhhs9m", "is_submitter": "True", "link_id": "t3_wvn2ma", "parent_id": "t1_ilgm26z", "score": "1", "subreddit": "Socialism_101", "subreddit_id": "t5_2ys9x"}, {"author": "easeandchance", "body": "Thank for your informative response! Thank you for answering precisely with regard to indiscriminative violence. As I tried to say in the post, I am aware of the leftist perception that violent uprising is necessary. I hope it isn't, but I understand where it's coming from. \n\nIncredibly helpful is that you point out my disregard of the violence that people suffer from in today's system. I guess this is something I have read or talked about with far left friends, but in my subconscious I am still not considering it. Which makes a lot of sense considering that I am a cis hetero white man in central Europe.\nThis also puts contemporary violence I perceive into perspective: if the current status is violent, a violent answer is already justified, in this logic. \n\nLastly, I want to reiterate, why I feel that you \n\n>would want indiscriminate violence against the people were working to improve the lives of? The people we want to democratically empower. Whats the point of that?\n\n\nThis stems from the impression of an indiscriminatory verbal violence against everything not far left within leftist subreddits. I guess, it feels a bit like if you rely on complete discrimination in an online forum, it seems questionable whether you are capable of differentiating between the bad ones and \"the people were working to improve the lives of\"\n\nHowever, I recognize that this is always a dilemma of movements, especially concerning oppressed people. On one hand, there are issues where there are clear rights and wrongs you want to follow through with and on the other hand there is the risk of alienating the undecided. It's the age old \"if you are not with us, you are against us\" which might offend some people but might be true at the same time", "created_utc": "1661277470.0", "edited": "False", "id": "ilhhas8", "is_submitter": "True", "link_id": "t3_wvn2ma", "parent_id": "t1_ilgk5a7", "score": "3", "subreddit": "Socialism_101", "subreddit_id": "t5_2ys9x"}, {"author": "easeandchance", "body": "Thank you for your curious and friendly response! I mostly agree with you. Languages are only a small part of getting a job, but I was always interested in jobs where traveling, foreign countries and constant changes to my working location (and language learning) are a requirement. \nThank you for complimenting my wonderful selection of languages! \n\nAbout your second paragraph: Let's say my passion would be woodworking but I'd already have a different career. I would have to work 9 to 5 and could only do woodworking in my freetime. However, if for some reason it would be beneficial to my job, my employer and I might agree to let me spend some work time to do woodworking. \nDoes that make it more understandable?", "created_utc": "1660772298.0", "edited": "False", "id": "ikpos5b", "is_submitter": "True", "link_id": "t3_wpt1c7", "parent_id": "t1_iknz6lq", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "easeandchance", "body": "Generally speaking: I am worried about whether learning languages will be for fun purposes only, as more experienced native speakers are a better fit for any jobs for which I would otherwise learn a language. If that's the case, I could only invest as much time, energy, and money as would be appropriate for a passion project, instead of treating it like something that's part of my career-oriented education.", "created_utc": "1660704958.0", "edited": "False", "id": "iklx6s3", "is_submitter": "True", "link_id": "t3_wpt1c7", "parent_id": "t1_ikixt6w", "score": "4", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "easeandchance", "body": "Which set is that?", "created_utc": "1656891834.0", "edited": "False", "id": "ieras9y", "is_submitter": "False", "link_id": "t3_vqiiig", "parent_id": "t1_ieq9b27", "score": "2", "subreddit": "outriders", "subreddit_id": "t5_k8mix"}, {"author": "easeandchance", "body": "Es ist wirklich nicht so schwer zu verstehen, wenn man es verstehen möchte [hier, vielleicht hilft das](https://i.pinimg.com/originals/ab/41/19/ab41190748bd90451a37cd50a7a3c045.jpg)", "created_utc": "1656635706.0", "edited": "False", "id": "iee3qf3", "is_submitter": "False", "link_id": "t3_vofgq8", "parent_id": "t3_vofgq8", "score": "-1", "subreddit": "dezwo", "subreddit_id": "t5_4egnbw"}, {"author": "easeandchance", "body": "Oh and as you are an historian, maybe you could check out the [the question](https://www.reddit.com/r/AskAcademia/comments/vlq8ul/comment/idz1wxe/?utm_source=share&utm_medium=web2x&context=3) asked by u/The_Uncut_Gem below?", "created_utc": "1656591491.0", "edited": "False", "id": "ieb5eo8", "is_submitter": "False", "link_id": "t3_vlq8ul", "parent_id": "t1_ie82le6", "score": "1", "subreddit": "AskAcademia", "subreddit_id": "t5_2sakj"}, {"author": "easeandchance", "body": "Thank you very much for this thorough answer!\n\nFirst of all, I think you helped me with the following points you made:\n\n1. \\>>Then, and I think this gets to your specific question, I don't zoom back out to look at everything that's potentially relevant. Instead, I ask \"what sort of information would prove or disprove my hypothesis?\" or \"what information do I need to answer my specific question?\"<<\n2. \\>>Of course, the best answer, especially if you're considering a career in academia is to read some methodology guides for your field-- which a professor should be able to direct you to.<<\n3. \\>>The key here is to be thorough in your reasoning as much as your information collecting so you can focus on relevant data, not all data.<<\n\nAnd secondly, I would like to mention that I am familiar with the process you describe in the first three paragraphs and have used it in past, well-graded papers, and I have even tutored on the subject. So I want to reiterate on why I explicitly differentiated between theory-focussed and \"real life events\" literature:\n\nI study politics where we are often tasked with using new noticeable events to polish existing theories or create new ones to enable predictions. In that nature it is often not about finding arguments or past events to verify hypotheses, but about using new/recent events to do that. As is the nature of academia, peer-reviewed literature on recent issues is scarce. So in the pension example it would be something like \"existing literature shows these changes in pension policy have led to longer life-expectancy, but ~~no one has asked if seniors stay healthy for those extra years~~ the 2022 report of the German Federal Ministry of Labour and Social Affair (has data that) seems to contradict that.\"\n\nIn this case, I can almost guarantee that no journal is fast enough to already publish something that would contextualize this report. If that were the case, I could, for example, review the last two years of labor policy in Germany and whether or not that might have had an impact. I could not rely on the academic literature to do that.\n\nAt least that's how I think it is and how I felt about it when I read your answer :)\n\nAnd I want to mention that even in this case, you would've helped me immensely already: I would ask \"what sort of information would prove or disprove my hypothesis?\"; I would probably check back with my prof for a little help in direction regarding methodology and/or read a guide; and last but not least, I would be sure to invest time and energy in my reasoning as much as necessary to not waste it in collecting data. Thank you for again for that help!", "created_utc": "1656591132.0", "edited": "1656591316.0", "id": "ieb4rfa", "is_submitter": "False", "link_id": "t3_vlq8ul", "parent_id": "t1_ie82le6", "score": "1", "subreddit": "AskAcademia", "subreddit_id": "t5_2sakj"}, {"author": "easeandchance", "body": "Hey, I am currently finishing my B.A. in a european university. So while not a prof, I have investigated a bit about the requirements of doing a master's degree in a related but non-consecutive area.\n\nThat's why I would recommend you to do the following: \n\n1. Check out the requirements for masters that interest you on the websites of the universities that interest you. The listed requirments should tell you if its possible or not.\n2. It could be that these universities list \"minimum of XX credits\" in a required field. If that's the case, check back with your current program and see if  you can take enough courses in the area. \n\nIf unsure: call the master's university. \n\nIf you want to know before choosing a bachelors, a major or courses, this is a very individual question and I would answer it very differently. \n\ndisclaimer: While I think that what I say applies to american universites as well as euripean ones, because I checked some of their master programs for myself, *please note that I am not sure if what I said applies to american universities.*", "created_utc": "1656495344.0", "edited": "False", "id": "ie5zs1l", "is_submitter": "False", "link_id": "t3_vlq8ul", "parent_id": "t1_idz1wxe", "score": "1", "subreddit": "AskAcademia", "subreddit_id": "t5_2sakj"}, {"author": "easeandchance", "body": "I would like to know:   \n**Do you have any tips or a method even on how you go on about finding the most important (i.e. relevant for your current work) events of a new topic you started working on? (social sciences)**\n\n* In this context*, I am not talking about general topics or courses* such as \"International Relations\" or \"Behavioral Economics\" or \"Urban Sociology.\" Corresponding, more specific topics in the sense of my question would be \"Neorealism after the Cold War\", \"Moral Engagement in Human Resource Management\", \"Changes between European and American Cities after Corona\". (I learned that, in a broader sense, my profs should choose the most important stuff for each course and then I myself study that. It is my understanding that this is the main job of university profs: They know \"everything\" about their specialty, so their job is to identify what I should study. Teachers in schools do the same but on top of that they teach/study with me. This works quite well for my courses, but the problem described above occurs not in broad courses like politics 101 or sociology 101, but in much more specialised areas of studies.)  \n\n* *It is also very different from finding the most impactful academic literature (theories) and findings about something.* \n\nThis is particulary relevant becaue I am studying a social science and time and time again I run into the problem when writing a paper. Basically, a lot of times I have to identify the most important event(s) in a specific case/timeframe/society/state etc. to enable an analysis of those in conjunction with my theoretic framework. \n\n* An **example**: I am writing a paper about pension policies in country X. Hypothesis: Policy changes between YYYY and YYYY improved the conditions of retired people because of argument Z. Probably my analysis will take a look at events/policies in the timeframe and explain that they had such and such an impact, which - in conjunction with my theory-based arguments - explain the improvement. How would I find these events or major policies, especially if there are a lot of such events in the timeframe?\n\nI have done this a number of times now, but this proves to be as difficult now than it was the first time, because I have no real strategy for it. My **current approach** is bascically to become quite an expert in the topic in the timeframe and then just \"know\" which events are probably the most important ones. However, this means that I need to know *all* events before I can start pinpointing the important ones, or I might miss one. This approach takes a lot of time if done precisly and thourogly - *if done right.* \n\nThank you!", "created_utc": "1656493900.0", "edited": "False", "id": "ie5y3o2", "is_submitter": "False", "link_id": "t3_vlq8ul", "parent_id": "t3_vlq8ul", "score": "1", "subreddit": "AskAcademia", "subreddit_id": "t5_2sakj"}, {"author": "easeandchance", "body": "That is only true to an extend. Please keep in mind that it's actually David Fumeros job to be that good looking. He can invest amounts of time and money which would be unrealistic for people with other jobs. I mean they are called \"unrealistic beauty standards\" for a reason. This does not mean that what they do is not hard work, though", "created_utc": "1655725012.0", "edited": "False", "id": "id1r5ke", "is_submitter": "False", "link_id": "t3_vffdi0", "parent_id": "t1_id1msmd", "score": "1", "subreddit": "brooklynninenine", "subreddit_id": "t5_2x7x1"}, {"author": "easeandchance", "body": "I do get why people downvote my initial statement but the responses I got really helped me clear up why I felt that way.\nSo thank you for being understanding. \n\nThis actually was my favorite episode for a long time, because I always had problems with jealousy and insecureness in past relationships similar to what Jake goes through in that episode. I felt like I had learned a lot from the episode. But when I discovered that Melissa actually is married to the other guy, I felt like every positive message of that episode was just acting, too and thus unreal. Like if Jake was actually right about being jealous etc. \n\nAnyhow, I really like your argument that they choose her husband for that role because of their chemistry. That makes a lot of sense. Thank you for that.", "created_utc": "1655674771.0", "edited": "False", "id": "iczn8qh", "is_submitter": "False", "link_id": "t3_vffdi0", "parent_id": "t1_iczmcmd", "score": "1", "subreddit": "brooklynninenine", "subreddit_id": "t5_2x7x1"}, {"author": "easeandchance", "body": "I never said or meant to say that Melissa Fumero does only like him for his looks!\nI just find it unwise to make a whole episode about that Jake feels like the other guy is better than him in every way (you could also include personality here, as the character is this smart af Puzzlemakler), then have Amy assure him that she likes Jake as he is the person she loves for who he is - but then they choose to let her husband play the person *she does NOT go for*? \n\nI think that's what my criticism boils down to: why cast the one person Melissa Fumero actually choose as her partner as the posterboy for an episode about why she does not choose him?", "created_utc": "1655674256.0", "edited": "False", "id": "iczm6bv", "is_submitter": "False", "link_id": "t3_vffdi0", "parent_id": "t1_iczikqb", "score": "1", "subreddit": "brooklynninenine", "subreddit_id": "t5_2x7x1"}, {"author": "easeandchance", "body": "Is that so? He is definitely not buff, though.\n\nIt's just, I really like Brooklyn 99 because they address a number of social and personal issues of life. In this case they addressed \"normal looking guy thinks his girlfriend is way too good for him and thus gets insecure when hotter, buffer guy gets on the scene\"\nBut in B99, Jake gets reassured by Amy that she likes HIM because of his character traits. But then the truth is Melissa Fumero went for the buffed, hot model.", "created_utc": "1655663714.0", "edited": "False", "id": "icyzhvj", "is_submitter": "False", "link_id": "t3_vffdi0", "parent_id": "t1_icyz15w", "score": "-7", "subreddit": "brooklynninenine", "subreddit_id": "t5_2x7x1"}, {"author": "easeandchance", "body": "Am I the only one who felt so happy that an amazing woman like Amy could be together with a normal-looking fun guy like Jake - just for reality to be so disheartening: Indeed Melissa Fumero went for the hot buffed guy.", "created_utc": "1655663093.0", "edited": "False", "id": "icyy4yf", "is_submitter": "False", "link_id": "t3_vffdi0", "parent_id": "t3_vffdi0", "score": "-12", "subreddit": "brooklynninenine", "subreddit_id": "t5_2x7x1"}, {"author": "easeandchance", "body": "Generally speaking, I believe that the map could/should develop on its own as the (local) graph.\n\nBut I don't really understand your example, so I am not sure how to answer that question.", "created_utc": "1655298316.0", "edited": "False", "id": "icg86fb", "is_submitter": "False", "link_id": "t3_phav02", "parent_id": "t1_icg7m5x", "score": "1", "subreddit": "ObsidianMD", "subreddit_id": "t5_2mz3dr"}, {"author": "easeandchance", "body": "Yes, I think you should put it in the root folder. \n\nIf you want to see a way to find it via it's linkages, I could open a local graph on a broader subject, I could open a note on a broader subject or I would just use the search.\n\nSo in your example I would've made another note called \"Development/Docker\" which would have organically developed Backlinks to the note your searching for (i.e. \"development/docker\" is mentioned in the note you are searching for) or I would've linked the note you're searching for there. \nNow I could open a local graph to find the note or I could look at the backlinks. \nIf I use daily notes, I would probably have written something like \"continue here 15. June 2022\" and could then just start my day with looking whether or not there are backlinks to my daily notes\n\nI hope that makes sense. To sum it up: in some way you will have mentioned the note you are searching for in another, less specific note or you will have linked one of the less specific notes in it. How exactly you do that depends on your workflow.", "created_utc": "1655297287.0", "edited": "False", "id": "icg668u", "is_submitter": "False", "link_id": "t3_phav02", "parent_id": "t1_icfheos", "score": "1", "subreddit": "ObsidianMD", "subreddit_id": "t5_2mz3dr"}, {"author": "easeandchance", "body": "Ah thank you for clearing that up.\nI sometimes wonder whose brilliant idea it was to take a timeframe and call it \"modern\". Postmodernism is already a term and I recently read something about post-postmodernism, I think...\nNext era is gonna be \"the future\" or what? That naming convention is so annoying", "created_utc": "1655189077.0", "edited": "False", "id": "icavbnn", "is_submitter": "False", "link_id": "t3_vblhns", "parent_id": "t1_icav4ql", "score": "1", "subreddit": "ProgrammerHumor", "subreddit_id": "t5_2tex6"}, {"author": "easeandchance", "body": "I am German and never heard of \"klieban\". I also checked a dictionary, so I think you mean \"klieben\". However it is not \"modern German\", but Austrian and southern German dialect.", "created_utc": "1655187475.0", "edited": "False", "id": "icatagw", "is_submitter": "False", "link_id": "t3_vblhns", "parent_id": "t1_ica2ps0", "score": "1", "subreddit": "ProgrammerHumor", "subreddit_id": "t5_2tex6"}, {"author": "easeandchance", "body": "experiment with mods especially on your weapon. I play the same class as you and most of my damage comes from 1. blighted rounds 2. mod I on my primary 3. mod 2 on my primary", "created_utc": "1655160188.0", "edited": "False", "id": "ic9dueu", "is_submitter": "False", "link_id": "t3_vbln24", "parent_id": "t3_vbln24", "score": "3", "subreddit": "outriders", "subreddit_id": "t5_k8mix"}, {"author": "easeandchance", "body": "It's always one of the four things you mentioned but never all of them :D   \nas I pointed out in other comments, I am able to get up to castle with \\~35secs idle TC time consistently. \n\nHowever, other areas of the game seem to suffer whenever I focus enough on a skill area to execute it well.", "created_utc": "1655153605.0", "edited": "False", "id": "ic8yts5", "is_submitter": "True", "link_id": "t3_vbarvx", "parent_id": "t1_ic7b248", "score": "1", "subreddit": "aoe2", "subreddit_id": "t5_2sg7u"}, {"author": "easeandchance", "body": "Hey man, you are doing these nice \"hot take posts\", right? Thanks for chiming in!\n\nAfter playing some games and installing capture age, my whole TC idle time up to Castle Age is about 35 secs. \n\nHowever after reading all these answers and thinking about it, I'm pretty sure its a typical case of \"I can do anything but not everything\", i.e. Yes, I can do anything on that list, but I don't do all of them all the time. \n\nSo when I see somebody saying \"you need to achieve X to get better\" I train to do X, accomplish it, but other areas of the game suffer from that. Then I feel frustrated because now I am doing X but not getting much better.", "created_utc": "1655153359.0", "edited": "False", "id": "ic8y8h1", "is_submitter": "True", "link_id": "t3_vbarvx", "parent_id": "t1_ic7ydc8", "score": "1", "subreddit": "aoe2", "subreddit_id": "t5_2sg7u"}, {"author": "easeandchance", "body": "your first paragraph summarizes perfectly how I felt when writing my post", "created_utc": "1655153065.0", "edited": "False", "id": "ic8xizy", "is_submitter": "True", "link_id": "t3_vbarvx", "parent_id": "t1_ic8gft8", "score": "1", "subreddit": "aoe2", "subreddit_id": "t5_2sg7u"}, {"author": "easeandchance", "body": "what's the best way to share recs?", "created_utc": "1655152811.0", "edited": "False", "id": "ic8www1", "is_submitter": "True", "link_id": "t3_vbarvx", "parent_id": "t1_ic7si4s", "score": "1", "subreddit": "aoe2", "subreddit_id": "t5_2sg7u"}, {"author": "easeandchance", "body": "You might like sniper elite: \n\n\\- exploring\n\n\\- easy inventory management\n\n\\- stealth focussed\n\n\\- not too complex gameplay\n\nyou could try it out on google stadia. you get the pro tier free for one month and as part of that package you can play sniper elite 4 from every chrome device or from the chrome browser. Might not be the highest quality of gaming in regards fps and 4k and whatnot but its perfect to try the game out", "created_utc": "1655132742.0", "edited": "False", "id": "ic7m15m", "is_submitter": "False", "link_id": "t3_vbdzss", "parent_id": "t3_vbdzss", "score": "5", "subreddit": "GhostRecon", "subreddit_id": "t5_2s91l"}, {"author": "easeandchance", "body": "Don't worry, as all the comments and my own reevaluating make clear, I can do anything but not everything on that list :D", "created_utc": "1655132427.0", "edited": "False", "id": "ic7lb8h", "is_submitter": "True", "link_id": "t3_vbarvx", "parent_id": "t1_ic7k375", "score": "2", "subreddit": "aoe2", "subreddit_id": "t5_2sg7u"}, {"author": "easeandchance", "body": "Thank you for your insights!\n\nThe slow switching could make a lot of sense. I often feel like what I'm doing is going great and then I do something else and everything is in shambles 11 \n\nThat really would explain why I feel the way I feel about my skills. Because individually I think I am not exaggerating when I say that I can do those individually but probably only one at a time. \n\nI really like your recommendation of a memorization system. However at the same time I don't know what would be a good example of that. What do you think about \n\n- checking eco 30 sec\n- checking my army 20 sec\n- opponent 20 sec\n- eco 30 sec\n- production 20 sec\n- eco 30 sec\n- reevaluate current strategy 20 sec\n- repeat/adapt as necessary", "created_utc": "1655128660.0", "edited": "False", "id": "ic7d10s", "is_submitter": "True", "link_id": "t3_vbarvx", "parent_id": "t1_ic7aozl", "score": "2", "subreddit": "aoe2", "subreddit_id": "t5_2sg7u"}, {"author": "easeandchance", "body": "Amazing. I will look into that and probably submit one of my games if possible and sensible", "created_utc": "1655128013.0", "edited": "False", "id": "ic7bpmp", "is_submitter": "True", "link_id": "t3_vbarvx", "parent_id": "t1_ic7awdt", "score": "2", "subreddit": "aoe2", "subreddit_id": "t5_2sg7u"}, {"author": "easeandchance", "body": "Ok that makes sense. Thanks for clearing that up.   \nThis is one of the few bigger issues I can improve upon more easily than perfecting uptimes etc. I think.", "created_utc": "1655127451.0", "edited": "False", "id": "ic7aksq", "is_submitter": "True", "link_id": "t3_vbarvx", "parent_id": "t1_ic79ufa", "score": "1", "subreddit": "aoe2", "subreddit_id": "t5_2sg7u"}, {"author": "easeandchance", "body": "After reading all the reply this would be much more awkward than I thought it might be 11\n\nI will now play and record ferociously until I have a rec that I can share without being completly ashamed of myself after gawking out all the things I supposedly execute well enough to be 200elo higher :D", "created_utc": "1655127115.0", "edited": "False", "id": "ic79xb7", "is_submitter": "True", "link_id": "t3_vbarvx", "parent_id": "t1_ic760tx", "score": "4", "subreddit": "aoe2", "subreddit_id": "t5_2sg7u"}, {"author": "easeandchance", "body": "No offense taken. I think I underestimate(d) what constitutes a good execution of these. Of the four things you mentioned here, two can easily be identified: get to 130vils \\[x\\], counter army \\[x\\].\n\nBut after reading all the answers here, I suspect \"better boom\" and to a lesser degree \"get necessary upgrades\" to be much more important and harder to master than I thought.", "created_utc": "1655126888.0", "edited": "False", "id": "ic79hbb", "is_submitter": "True", "link_id": "t3_vbarvx", "parent_id": "t1_ic77x03", "score": "2", "subreddit": "aoe2", "subreddit_id": "t5_2sg7u"}, {"author": "easeandchance", "body": "Thank you for that recommendation! Is capture age included in the game? I thought you had to download/install it (like a mod or smth) but recently I think I saw a button for it in the game. \n\nIt's really refreshing to see so many higher elo players telling me they screw up with the stuff I listed here. That is much more tangible and clearer to improve upon than \"they have better game sense and make better strategical decisions\"", "created_utc": "1655126701.0", "edited": "False", "id": "ic7945e", "is_submitter": "True", "link_id": "t3_vbarvx", "parent_id": "t1_ic77wpk", "score": "2", "subreddit": "aoe2", "subreddit_id": "t5_2sg7u"}, {"author": "easeandchance", "body": "No worries. I already expected something like what you said and are saying, but't I wasn't sure if I'm not missing out on something less obvious. \n\nregarding your example I had to chuckle a little because after reading these answers here and thinking about it, I'm pretty sure I'm doing the opposite: **IF** I have military units you can bet your boar I'm using and microing them - but my game up to that point has room for improvement.", "created_utc": "1655126501.0", "edited": "False", "id": "ic78q29", "is_submitter": "True", "link_id": "t3_vbarvx", "parent_id": "t1_ic785wx", "score": "2", "subreddit": "aoe2", "subreddit_id": "t5_2sg7u"}, {"author": "easeandchance", "body": "Thank you!\n\nI will definitly get back to you with a rec, after playing some matches with all the tips mentioned here in mind. \n\nHaving military buildings producing all the time is something I struggle with, which is why I didn't mention it in my post. Just for clarification:  \nGood players try to never stop producing military units after putting down a military production building? \n\nVill production is generally not such a problem. My keyboard is already starting to look decesivly different on the hotkeys I use for \"selecting town center(s)\" + \"queing vills\"", "created_utc": "1655126232.0", "edited": "False", "id": "ic786so", "is_submitter": "True", "link_id": "t3_vbarvx", "parent_id": "t1_ic75kh5", "score": "1", "subreddit": "aoe2", "subreddit_id": "t5_2sg7u"}, {"author": "easeandchance", "body": "After reading all the replies currently posted, I think I fell into the trap of thinking that there  is \"just this one thing I need to learn to get much better\". But there are no easy solutions. After all the input here, I will defenitly fine tune and try to perfect my execution and play less on the fly.", "created_utc": "1655125808.0", "edited": "False", "id": "ic77cw6", "is_submitter": "True", "link_id": "t3_vbarvx", "parent_id": "t1_ic75xqw", "score": "4", "subreddit": "aoe2", "subreddit_id": "t5_2sg7u"}, {"author": "easeandchance", "body": "I will get back to you, after taking into account the stuff other redditors mentioned here. Seems like I underestimate how perfect you need to execute the build orders, up times and rushes.", "created_utc": "1655125698.0", "edited": "False", "id": "ic774rd", "is_submitter": "True", "link_id": "t3_vbarvx", "parent_id": "t1_ic74682", "score": "1", "subreddit": "aoe2", "subreddit_id": "t5_2sg7u"}, {"author": "easeandchance", "body": "I definitly have a more lax understanding of what constitutes a good execution of a build order or getting up at a decent time. I already learned to get much more precise and improve on the details of the early game from the answers here - and yours especially. Thank you for that.\n\nEDIT: Sending the army forward as soon as possible is something I'm rather comfortable with. Building an army at the right time seems to be more of an issue for me.", "created_utc": "1655125509.0", "edited": "False", "id": "ic76qvo", "is_submitter": "True", "link_id": "t3_vbarvx", "parent_id": "t1_ic73pz6", "score": "1", "subreddit": "aoe2", "subreddit_id": "t5_2sg7u"}, {"author": "easeandchance", "body": "Thank you!\n\nA lot of people recommend looking at the recs. I will do so.\n\nA big thank you for pointing out some things to look out for in play and recs! That will help a lot to prevent me from just watching my own flawed games planlessly lol", "created_utc": "1655125351.0", "edited": "False", "id": "ic76fno", "is_submitter": "True", "link_id": "t3_vbarvx", "parent_id": "t1_ic72ohy", "score": "2", "subreddit": "aoe2", "subreddit_id": "t5_2sg7u"}, {"author": "easeandchance", "body": "*scribblign down furiously ...* \"scouting the enemy\"\n\nGood point! Thank you, I will keep that in mind.\n\nA lot of people recommend looking at my recs. Will try that.", "created_utc": "1655125255.0", "edited": "1655125614.0", "id": "ic76956", "is_submitter": "True", "link_id": "t3_vbarvx", "parent_id": "t1_ic73ia9", "score": "1", "subreddit": "aoe2", "subreddit_id": "t5_2sg7u"}, {"author": "easeandchance", "body": "Ok Thank you!\n\n  \nThis helps a lot already. Knowing that people with higher elo still don't do that stuff perfectly and that doing it better (e.g. devil in the details) makes up a lot of the improvement is something I wasn't sure about. \n\nYour assessment of the linked post is also helpful. \n\nI did try to not sound like rose tinted glasses, because I know I don't do all that stuff perfectly all the time. It's unsatisfying not being able to pinpoint exactly what went wrong - because there were a lot of little things that went wrong, not one big one. \n\nMy takeaway from your comment is that \"improving a lot of the details, i.e. perfecting basic plays = improving overall\" turns out to be as true as \"learn something new&big = improve overall\" .", "created_utc": "1655125090.0", "edited": "False", "id": "ic75xqw", "is_submitter": "True", "link_id": "t3_vbarvx", "parent_id": "t1_ic73bpp", "score": "3", "subreddit": "aoe2", "subreddit_id": "t5_2sg7u"}, {"author": "easeandchance", "body": "I understand your frustration, but such a number of bugs and general unfinishedness is clearly a result of bad management. The coders might have been bad, but then QA should've been better or the games scope should've been limited or whatever. In any way, bad management and supervision", "created_utc": "1654707460.0", "edited": "False", "id": "ibmn4kz", "is_submitter": "False", "link_id": "t3_v7ansm", "parent_id": "t1_ibknk6d", "score": "1", "subreddit": "GhostRecon", "subreddit_id": "t5_2s91l"}, {"author": "easeandchance", "body": "The picture you choose for Germany is actually the symbol of the association of a German state and not the federal republic of Germany, i.e. the country. \nHowever, the German national team as a representation of Germany as well as of the German Football Association (DFB or Deutscher Fußball Bund) wear the eagle on their chest, close to the four stars signifying the four world cup wins. \nHere is a picture of that I found: https://upload.wikimedia.org/wikipedia/de/thumb/e/e3/DFBEagle.svg/1200px-DFBEagle.svg.png", "created_utc": "1654612735.0", "edited": "False", "id": "ibhpwq1", "is_submitter": "False", "link_id": "t3_v6utsi", "parent_id": "t3_v6utsi", "score": "9", "subreddit": "aoe2", "subreddit_id": "t5_2sg7u"}, {"author": "easeandchance", "body": "I know what you mean but I think \"the best playstyle\" is the one I enjoy the most, don't ya think?\n\nIt would be different If I would be playing coop, there I would be focussing on building a \"more meta\" build to not slow down other players", "created_utc": "1654344761.0", "edited": "False", "id": "ib517os", "is_submitter": "True", "link_id": "t3_v4a184", "parent_id": "t1_ib38co3", "score": "2", "subreddit": "outriders", "subreddit_id": "t5_k8mix"}, {"author": "easeandchance", "body": "Thank you again for laying out that info! I understand that RpM matter but I just really like doing a lot of damage with one shot lol\nI just enjoy playing defensively, running around/away or even staying in cover most of the time and then turning around BAAAAM oneshotting the elites and then running again... I thought maybe charged round would accommodate that playstyle better than blighted rounds.", "created_utc": "1654295759.0", "edited": "False", "id": "ib37q2m", "is_submitter": "True", "link_id": "t3_v4a184", "parent_id": "t1_ib36zw1", "score": "3", "subreddit": "outriders", "subreddit_id": "t5_k8mix"}, {"author": "easeandchance", "body": "Thank you!\n\nI feel you.. It's just so satisfying when you have just one shot and you keep nailing it and kill so effectively. It feels rewarding to have to be good at shooting and aiming, i.e. to have skill and be rewarded for if", "created_utc": "1654295145.0", "edited": "False", "id": "ib36l66", "is_submitter": "True", "link_id": "t3_v4a184", "parent_id": "t1_ib35jb3", "score": "4", "subreddit": "outriders", "subreddit_id": "t5_k8mix"}, {"author": "easeandchance", "body": "Thanks for the quick reply! \n\nI didn't know that is broken. Sad face... I hope they fix it even if it's not perfect/meta.\n\nI know that they ignore armor, but I can't imagine that 200% damage increase isn't better than ignoring armor if ignoring higher rpm", "created_utc": "1654294113.0", "edited": "False", "id": "ib34obw", "is_submitter": "True", "link_id": "t3_v4a184", "parent_id": "t1_ib33zl2", "score": "2", "subreddit": "outriders", "subreddit_id": "t5_k8mix"}, {"author": "easeandchance", "body": "GTA is one of the most expensive video games ever made by a company that is famous for their perfectionism and polishing. Ghost Recon on the other hand is made by ubi...  \nSo I'd prefer Ubi not to focus on achieving an ideal dream of a game and underdeliver, but instead do a solid and well made game.", "created_utc": "1654280332.0", "edited": "False", "id": "ib2ckfq", "is_submitter": "False", "link_id": "t3_v3dtju", "parent_id": "t1_ib1e6hf", "score": "1", "subreddit": "GhostRecon", "subreddit_id": "t5_2s91l"}, {"author": "easeandchance", "body": "Guys, why is nobody thinking about how difficult it is to make a city not be a lifeless ghost town (like liberty in breakpoint) or feel like a just a *larger village* (like the \"towns\" in wildlands)?\n\nI'd like to play in a city, but I don't see a story and gameplay combination in a city that is compatible with the technical limitations. \n\n**I much prefer a solid made wasteland and small but bustling maps than soulless inanimate cities with just 1 npc per skyscraper.**", "created_utc": "1654212967.0", "edited": "False", "id": "iaz27u7", "is_submitter": "False", "link_id": "t3_v3dtju", "parent_id": "t3_v3dtju", "score": "2", "subreddit": "GhostRecon", "subreddit_id": "t5_2s91l"}, {"author": "easeandchance", "body": "There are other scenarios like that, which are quite frankly scenarios that are supposed to happen, I think. Imo every Civ needs a \"time to shine\". Most obvious example would be goths with anarchy etc, or biz Catas against a player without helbs, or brit Longbows at a chokepoint, or cumans in late feudal knocking at your door with rams, or franks in early castle pushing knights, or a group of mangudai finding some lonely siege, or ...\n\nIf you let a persian player get to the point where they have such a strong economy then its your fault for letting that happen. Same as with goths. It's just strategically unsound play if you get yourself in this situation.", "created_utc": "1653912765.0", "edited": "False", "id": "iajbm0h", "is_submitter": "False", "link_id": "t3_v0vsin", "parent_id": "t1_iaj4z1d", "score": "8", "subreddit": "aoe2", "subreddit_id": "t5_2sg7u"}, {"author": "easeandchance", "body": "I'm writing my thesis about a related topic and am curious if you maybe have some kind of reference for this definition? I mean if you are right, I've never heard of the word peace used in that way, but I'm not a native English speaker and only now some of the academic definitions, so I'd like to learn about that if possible.", "created_utc": "1649252845.0", "edited": "False", "id": "i3minb0", "is_submitter": "False", "link_id": "t3_twu00f", "parent_id": "t1_i3lqx9e", "score": "1", "subreddit": "MapPorn", "subreddit_id": "t5_2si92"}, {"author": "easeandchance", "body": "That definition fits another word much better: victory.", "created_utc": "1649234136.0", "edited": "False", "id": "i3lorfz", "is_submitter": "False", "link_id": "t3_twu00f", "parent_id": "t1_i3jtqeo", "score": "1", "subreddit": "MapPorn", "subreddit_id": "t5_2si92"}, {"author": "easeandchance", "body": "That's how it was in Wildlands too iirc", "created_utc": "1644675167.0", "edited": "False", "id": "hwnav16", "is_submitter": "False", "link_id": "t3_sqnolz", "parent_id": "t1_hwn26da", "score": "12", "subreddit": "GhostRecon", "subreddit_id": "t5_2s91l"}, {"author": "easeandchance", "body": "\\*  I am sorry, but I didn't include two scopes, either.All screen shots are taken from the same position. Platform I play on is STADIA.  \nOrange number is the width of the hut in cm.  \nBlue numbers are referencing a small rectangle on the frontside of the hut, which I covered in blue.   \nI don't guarantee that these values are exact, but they should be enough to make a definitive ranking. The TXI5 Scope is the one with most zoom.", "created_utc": "1640027968.0", "edited": "1640604068.0", "id": "hpbvkcn", "is_submitter": "True", "link_id": "t3_rkutn9", "parent_id": "t3_rkutn9", "score": "6", "subreddit": "GhostRecon", "subreddit_id": "t5_2s91l"}, {"author": "easeandchance", "body": "Thank you for that answer! I never heard of that because I  discovered stadia relatively recently, so I had a completely different view on it", "created_utc": "1639226912.0", "edited": "False", "id": "ho45vza", "is_submitter": "True", "link_id": "t3_rdjyoq", "parent_id": "t1_ho2pxab", "score": "0", "subreddit": "Stadia", "subreddit_id": "t5_xa0lk"}, {"author": "easeandchance", "body": "I tried to find values which would fit all types of gamers I know. Thus, I looked at the times from friends, family and myself before and after getting out of school, married or pregnant etc\n\nBut more importantly, I think about it that way: if somebody with kids, marriage and work would spend all their free time with woodworking you wouldn't consider them a carpenter but a casual woodworker or something similar, right?", "created_utc": "1639226302.0", "edited": "False", "id": "ho44x2m", "is_submitter": "True", "link_id": "t3_rdjyoq", "parent_id": "t1_ho2ke39", "score": "1", "subreddit": "Stadia", "subreddit_id": "t5_xa0lk"}, {"author": "easeandchance", "body": "Oh man, I'm sorry for that haha I'd still consider you a proud gaming veteran if it helps", "created_utc": "1639226021.0", "edited": "False", "id": "ho44hlj", "is_submitter": "True", "link_id": "t3_rdjyoq", "parent_id": "t1_ho3pm90", "score": "2", "subreddit": "Stadia", "subreddit_id": "t5_xa0lk"}, {"author": "easeandchance", "body": "Present!", "created_utc": "1639174805.0", "edited": "False", "id": "ho1lhqo", "is_submitter": "True", "link_id": "t3_rdjyoq", "parent_id": "t1_ho1kbzd", "score": "2", "subreddit": "Stadia", "subreddit_id": "t5_xa0lk"}, {"author": "easeandchance", "body": "Because of some/the recent gaming awards, one can notice many threads and comments about whether or not Stadia is doomed or still running ok. \n\nI personally feel like a lot of valid criticism is coming from at least enthusiastic gamers who are used to ...\n- playing games from launch on, e.g. the newest game\n- gaming in general\n- have experience with consoles and gaming PCs and compare stadia with that\n- are aware of the gaming industry and it's relevant players (ba dumm tss)\nThey also are ...\n- willing to pay for state of the art hardware\n- keeping an eye on every aspect from FPS, 4k to multiplayer and single player experiences, the different ergonomics of controllers etc\n- willing to pay a premium for day one access to the newest (AAA) games\n\n\nI just think that stadia is still aimed at casual gamers who care less about these things but more about the delay between starting and playing a game, required Hardware and installation and so on.\n\nbluntly formulated: If you consider yourself a hardcore gamer or match most of the points mentioned above: why are you even in this subreddit or why did you ever think stadia is relevant for you? \n\nTo prevent a clusterf*** of comments I want to add - last but not least - that I agree that stadia is in no means perfect and that I wish there was more investment of time and energy into it.", "created_utc": "1639174770.0", "edited": "False", "id": "ho1ler6", "is_submitter": "True", "link_id": "t3_rdjyoq", "parent_id": "t3_rdjyoq", "score": "11", "subreddit": "Stadia", "subreddit_id": "t5_xa0lk"}, {"author": "easeandchance", "body": "I like your argument here, but I think it's based on one type of gamer: the one that always played and wants to play games from day one. \n\nI have been playing games for all my life and I always acted like a r/patientgamers. For me, Stadia is still a valid alternative because my backlog of games I still want to play is shifted about 8 months because I am not willing to pay three times more than if I wait some time (e.g. 60$ at launch vs 20$ down the road). Hardware is also much more expensive on day one instead of some months or years later. \n\nFrom my experience, Stadias library is ok. It's far from perfect, but it doesn't need to compete with Xbox or ps libraries for me and most other patient gamers. \n\nAnd then there is the (very) casual gamer, be it my father who never owned anything resembling a gaming PC , or my brother who has about 4 hours of spare time a week for gaming. If and when the play, they want to get to the playing part fast and preferably from their couch. \n\nFor them, Stadia hits all the marks. \n\n\nI still agree that Alphabet doesn't seem to use Stadias potential, but as somebody gaming many hours every day and as somebody willing to spend some money for it, I honestly think that comparing Stadias appeal to non casual gamers with the one gaming PCs or consoles have is moot.", "created_utc": "1639171663.0", "edited": "False", "id": "ho1dri0", "is_submitter": "False", "link_id": "t3_rd7876", "parent_id": "t1_ho0llw7", "score": "5", "subreddit": "Stadia", "subreddit_id": "t5_xa0lk"}, {"author": "easeandchance", "body": "Well that is true for every tactic, isn't it? I can't quite make out what your point is here - maybe you can explain a bit further? \n\nLike ofc every Trush is resource intense, but as long as I inflict more damage in form of idle time or denial than I invest in Form of resources or idle time, I am successful. Which is true for all tactics. As far as I understand this post, it argues that some tactics perform more successful more often with donjons than with towers. \nAs far as I understand your arguments, you argue that donjons & serjs costs outweigh their benefits?", "created_utc": "1637711748.0", "edited": "1637712197.0", "id": "hlu35hg", "is_submitter": "False", "link_id": "t3_pkdkdg", "parent_id": "t1_hc3hym6", "score": "1", "subreddit": "aoe2", "subreddit_id": "t5_2sg7u"}, {"author": "easeandchance", "body": "Very astute observation!", "created_utc": "1637059930.0", "edited": "False", "id": "hku8a5q", "is_submitter": "False", "link_id": "t3_qulxhg", "parent_id": "t1_hkrm9k0", "score": "1", "subreddit": "GhostRecon", "subreddit_id": "t5_2s91l"}, {"author": "easeandchance", "body": "Oh. That was my autocorrect 😅", "created_utc": "1632246797.0", "edited": "False", "id": "hdqte2o", "is_submitter": "True", "link_id": "t3_pslavs", "parent_id": "t1_hdqro59", "score": "4", "subreddit": "netflixwitcher", "subreddit_id": "t5_ln5kv"}, {"author": "easeandchance", "body": "Thanks! I thought something like that but couldn't find an explanation online and don't have netflix anymore", "created_utc": "1632239148.0", "edited": "False", "id": "hdqan8v", "is_submitter": "True", "link_id": "t3_pslavs", "parent_id": "t1_hdqaamu", "score": "33", "subreddit": "netflixwitcher", "subreddit_id": "t5_ln5kv"}, {"author": "easeandchance", "body": "- It doesn't matter how the middle looks like or if it's in the right or left side\n- or if I'm playing black or white. \n- the engine's next moves never seem good enough to justify loosing the bishop so early", "created_utc": "1631880020.0", "edited": "False", "id": "hd73y3i", "is_submitter": "True", "link_id": "t3_ppyrny", "parent_id": "t3_ppyrny", "score": "1", "subreddit": "chessbeginners", "subreddit_id": "t5_35d04"}, {"author": "easeandchance", "body": "I tried 20min yesterday and suddenly I won five matches in a row, blundering far less and beating players with 200 higher elo. \n\n\nAnd boy - it was much more fun! I get what your saying that the time feels longer. Interestingly I actually felt like the board became clearer, like there was more space between the pieces and less clutter obstructing my view.", "created_utc": "1630935138.0", "edited": "False", "id": "hbt1mvo", "is_submitter": "True", "link_id": "t3_piey90", "parent_id": "t1_hbr09mb", "score": "2", "subreddit": "chess", "subreddit_id": "t5_2qhr7"}, {"author": "easeandchance", "body": "Thanks that's really insightful! And makes me look forward - I actually kinda hoped that an answer will also pop up, something \"yes it might be about avoiding mistakes but apart from that (and getting better with that) there are other different kinds of progress and improvement. Makes me optimistic, thanks for that!\n\n\nI like that chess players seem to agree that there is something more to it than meets eye. I think you could say in the same that musicians can \"read between the lines\".", "created_utc": "1630934953.0", "edited": "False", "id": "hbt19xi", "is_submitter": "True", "link_id": "t3_piey90", "parent_id": "t1_hbsim6t", "score": "1", "subreddit": "chess", "subreddit_id": "t5_2qhr7"}, {"author": "easeandchance", "body": "\"you are probably [...] progressing from incompetence to competence.\"\n\n\nThat's the nicest thing anybody has ever said to me hahaha \n\n\nBut seriously thanks for showing me that model, it seems quite interesting.", "created_utc": "1630934420.0", "edited": "False", "id": "hbt099r", "is_submitter": "True", "link_id": "t3_piey90", "parent_id": "t1_hbrr1zf", "score": "1", "subreddit": "chess", "subreddit_id": "t5_2qhr7"}, {"author": "easeandchance", "body": "My rating is ~450 (chess.com) and heavily fluctuating. I can have ~550 and ~350 in the same week. However, I don't feel sad about having such a bad rating, as chess as an activity profits from many personal traits that are not my strong suits, so I saw it coming.\n\n\nIt's actually nice to see that somebody triple good as I am still has the same problem haha makes the comments about trying a different perspective on things seem more valid, too.", "created_utc": "1630878594.0", "edited": "1630878932.0", "id": "hbqhzmn", "is_submitter": "True", "link_id": "t3_piey90", "parent_id": "t1_hbpu3n5", "score": "3", "subreddit": "chess", "subreddit_id": "t5_2qhr7"}, {"author": "easeandchance", "body": "That's a valid perspective. A real life lesson I learned the guy narrating the chess.com lesson videos was that \"the goal is not to look at your move and it's consequences but that you have a better position after your move than before.\" That actually helped incredibly, made chess fun and helped my mental health in uni. \n\nIt also made me understand that there are maybe some completely predetermined situations on the chess board, but there are so many possible combinations and moves that more often than not you don't have to think about whether your move will become an unavoidable check mate 7 moves later. \n\n\nYou made me realize that I can look at mistakes in the same way as in they can happen but they don't (always) determine the end of the game and also that a smart move is a smart move. No matter if the one before was a blunder. Thank you for that!", "created_utc": "1630862828.0", "edited": "False", "id": "hbpiwyt", "is_submitter": "True", "link_id": "t3_piey90", "parent_id": "t1_hbp2esc", "score": "2", "subreddit": "chess", "subreddit_id": "t5_2qhr7"}, {"author": "easeandchance", "body": "I play what chess . com calls \"rapid.\" I.e. 10 or 20 mins per player.\n\nNow that I think about it, my rating was much better (2x) when I played 20min matches, as that was the default when just using the central \"play now\" button in the app. I am not sure but I think it was 20min and they changed it to 10min. I thought that's what most players do. I also play about four matches with 14days per player. \n\nIf I switch to 20mins however doesn't that make my thought process easier instead of me better? \n\nIn any case already a very good point that I had on my mind but didn't really think about. Thank you for that! As it probably is more fun with 20min for me I wills definitely start playing that more often again.\n\nHowever, I tend to take my time with my moves. To the point of people writing nasty things in the chat as if I were a cheater abandoned the game - sorry for thinking so long lol. But more importantly, that actually is a huge improvement for me, because I didn't take my time before no matter which time control I choose. That's a huge part of the frustration as I notably get better yet make \"stupid mistakes\".", "created_utc": "1630862338.0", "edited": "False", "id": "hbphsu9", "is_submitter": "True", "link_id": "t3_piey90", "parent_id": "t1_hbpd1gp", "score": "2", "subreddit": "chess", "subreddit_id": "t5_2qhr7"}, {"author": "easeandchance", "body": "450 chess.com \n\nI use chess.com because of the more polished UI. I tried the most expensive subscription for a month, used the free version for a year and am now using the cheapest subscription.\n\n\nI think the subscription is only worthwhile if you need/really like the professional presentation and polishing chess.com has. I have ADHD and without the inviting interface, mass-consumer oriented presentation and the spoon-feeding and clear guiding and structure chess.com provides, I wouldn't play or even study chess. \nHowever, I don't recommend spending more than the cheapest subscription, because the more expensive ones only provide more of the same per day or week. If you need that much, you should be capable to get studying material and good players etc from lichess etc. Most resources in chess.com are also available for free from the start. \n\n---\n\nI should add that I may have a shit rating and always blunder, but I play ~ 15 - 30 matches a day at least and have started one year ago. I've used lichess sporadically to try to see what it's all about.", "created_utc": "1630853469.0", "edited": "False", "id": "hboxt06", "is_submitter": "False", "link_id": "t3_oy9j58", "parent_id": "t1_hbnuash", "score": "1", "subreddit": "chessbeginners", "subreddit_id": "t5_35d04"}, {"author": "easeandchance", "body": "Exactly. \n\nFor Obsidian, trying to use known mechanisms to organize notes is like installing a flamethrower in a fire truck. It is an attempt to do what it was actually invented to do away with.\n\nAfaik, programs like Obsidian and Roam are called second brain software or something like that. After months of trying different systems of tags, index based tables and whatnot, I had my breakthrough with Obsidian when I looked at it like this:\nWhen my brain memorizes a thought, every attribute, every category, every relationship or part of it is just another thought. example: If I think about my room's door, I associate it with (the #material) wood, with (the #colour) brown, with (the #concept of) opening and closing and that it is a part of every #interior. And to make it more impressive, in the moment of thinking that, my brain already knows that all of these are #words, part of the English #language and thereby open to #linguistic analysis. It should be clear by now that each tag is a justified tag in a sense of grouping. But at the same time, it is blatantly clear that all of these very different kind of elements my brain has on standby are saved in the same format. Because everything can be the attribute of something and every attribute can have attributes of its own. Hence, sorting and grouping is unlimited in our brains. Limitations of tags, folders, cupboards, room's etc do not limit our brains, they are just the result *of saving human thought in physical space*. \n\nThe marvelous thing is that our brain does *not sort* anything, it doesn't need to. Which is quite frankly a amazing feat. It just is capable of presenting all known associations to each thought on demand, it doesn't need to \"go somewhere and fetch the thought\", it just links everything. \n\nThis is completely different to the standard of opening  folders and subfolders to get a file that you know relates to what you are doing. \n\nSo don't use tags because one day sooner rather than later the tag might be the subject of a note. In addition, you are putting a physical limitation on the concept that you are tagging by designating it the sole dimension \"#tag\".\n\nThank you for coming to TED talk; obligatory sorry for the wall of text.", "created_utc": "1630750876.0", "edited": "False", "id": "hbjxzqu", "is_submitter": "False", "link_id": "t3_phav02", "parent_id": "t1_hbjg6io", "score": "3", "subreddit": "ObsidianMD", "subreddit_id": "t5_2mz3dr"}, {"author": "easeandchance", "body": "I hope I am not invoking an existential question: What about things you *are doing at the moment*? \n\nI tried using almost the same tags but failed thru the question of whether or not I use it as \n\n#todo#done\n\n i.e. hierarchical tags or just plain singular tags.\n\nCould you please elaborate on whether or not every note you write has such a tag or not, if you can?", "created_utc": "1630708704.0", "edited": "False", "id": "hbi3xch", "is_submitter": "False", "link_id": "t3_phav02", "parent_id": "t1_hbhbsof", "score": "2", "subreddit": "ObsidianMD", "subreddit_id": "t5_2mz3dr"}, {"author": "easeandchance", "body": "I remember when some new friends I made brought me to a club that turned out to be a gay club.\nFrom the moment the nice and understanding bouncer let us in to the moment I went home there was something ever so slightly different about the women there, but I couldn't put my finger on it. After talking with one of my female friends there, I recognized that the women there were just so much more relaxed. \nNow when I am in a non-gay nightclub I tend to notice so many small signs of women having their guard up.", "created_utc": "1630305032.0", "edited": "False", "id": "hawelbg", "is_submitter": "False", "link_id": "t3_pdytzc", "parent_id": "t3_pdytzc", "score": "10", "subreddit": "Feminism", "subreddit_id": "t5_2qr7i"}, {"author": "easeandchance", "body": "slight SPOILER WARNING\n\n---\n\nIn Episode Two, i.e. the one with Sam Fisher, you need to do investigate four leads or rather persons. One of them is a former general. Relatively early in his questline, you will go to his house and there is this room. In the quest you'll be looking for cues of his whereabouts on the island.", "created_utc": "1629194419.0", "edited": "False", "id": "h99s9kt", "is_submitter": "False", "link_id": "t3_p5xf32", "parent_id": "t1_h99ityt", "score": "16", "subreddit": "GhostRecon", "subreddit_id": "t5_2s91l"}, {"author": "easeandchance", "body": "@ u/stadiamods you need to pin this! (And keep improving the store page to find games via tags like \"local split screen\") Local split screen/multiplayer is such a rare sight nowadays yet in high demand\n\nAnd the whole \"got a browser? Then you're ready to play\" (without downloading, installing, troubleshooting etc etc) gets on a whole new level when it also applies to local multiplayer! \nBeing able to get from \"let's play together\" to playing without a hassle and in such short time is amazing - console or PC gaming has always messed up the experience, ranging from day 1 patch disasters, over the red ring of death inevitably broadsiding your halo match up to straight up ruining the mood of long-planned get-togethers \n\nIf I can have some friends over, get bored, decide on the spot to play fifa or whatnot with them and get to playing together in less than 7minutes I sure as hell am gonna do it", "created_utc": "1629114856.0", "edited": "False", "id": "h959w9y", "is_submitter": "False", "link_id": "t3_p5cjp3", "parent_id": "t1_h957qd0", "score": "2", "subreddit": "Stadia", "subreddit_id": "t5_xa0lk"}, {"author": "easeandchance", "body": "@ u/stadiamods you need to pin this! (And keep improving the store page to find games via tags like \"local split screen\") Local split screen/multiplayer is such a rare sight nowadays yet in high demand\n\nAnd the whole \"got a browser? Then you're ready to play\" (without downloading, installing, troubleshooting etc etc) gets on a whole new level when it also applies to local multiplayer! \nBeing able to get from \"let's play together\" to playing without a hassle and in such short time is amazing - console or PC gaming has always messed up the experience, ranging from day 1 patch disasters, over the red ring of death inevitably broadsiding your halo match up to straight up ruining the mood of long-planned get-togethers \n\nIf I can have some friends over, get bored, decide on the spot to play fifa or whatnot with them and get to playing together in less than 7minutes I sure as hell am gonna do it", "created_utc": "1629114847.0", "edited": "False", "id": "h959vqe", "is_submitter": "False", "link_id": "t3_p5cjp3", "parent_id": "t1_h957w1t", "score": "7", "subreddit": "Stadia", "subreddit_id": "t5_xa0lk"}, {"author": "easeandchance", "body": "Same here. I'm also using the PWA. I will now try it in the browser and then report back. In any case, I will also send a feedback/support message via the in-game feedback button.", "created_utc": "1627561477.0", "edited": "False", "id": "h6y5860", "is_submitter": "False", "link_id": "t3_osaiy4", "parent_id": "t3_osaiy4", "score": "1", "subreddit": "Stadia", "subreddit_id": "t5_xa0lk"}, {"author": "easeandchance", "body": "Thank you for this very informative and very concise answer! \nApart from playing as real persons, I can understand every point you make! However, I don't take photographs/screenshots :D  but while reading your reply it made me recognize that I also don't like taking photos in real life so  that makes a lot of sense\n\nWhen you say \"documenting\", do you mean you look at these photos at a later time?", "created_utc": "1624116646.0", "edited": "False", "id": "h2bynaz", "is_submitter": "True", "link_id": "t3_o3h0s2", "parent_id": "t1_h2br7d7", "score": "3", "subreddit": "GhostRecon", "subreddit_id": "t5_2s91l"}, {"author": "easeandchance", "body": "Good point.\nI am a very social person outside of gaming, but tend to separate gaming and social life, so I wasn't even thinking about this connection and looking for an explanation inside my perception of \"gaming\" which doesn't include such real life aspects", "created_utc": "1624116317.0", "edited": "False", "id": "h2by0s5", "is_submitter": "True", "link_id": "t3_o3h0s2", "parent_id": "t1_h2bsol8", "score": "2", "subreddit": "GhostRecon", "subreddit_id": "t5_2s91l"}, {"author": "easeandchance", "body": "While I agree with the post, afaik a lot of these things still need to be learned and tought to a variable degree - while fight or flight is extremely deepfried into our brains. For example, It's an important step in raising a child to recognize the time when a child becomes able to learn how to emphasize - the classic \"and how would you fee if Max would eat your chocolate without asking?\" \n\nRegarding these concepts and abilities of the human brain and what really is native or primal in us, \"Sapiens: A Brief History of Humankind\" by Yuval Noah Harari is extremely interesting. \n\nHowever, as others have said, never heard any argument on the lines of instinct or primal whatever that was convincing.", "created_utc": "1621763777.0", "edited": "False", "id": "gz5a8jd", "is_submitter": "False", "link_id": "t3_nifiek", "parent_id": "t3_nifiek", "score": "1", "subreddit": "Feminism", "subreddit_id": "t5_2qr7i"}, {"author": "easeandchance", "body": "please note: the thing with r/Palestine really just happened and before this gets derailed I wanna say that I didn't answer that one because I *don't want to get into that here and now* and it's not intended to communicate any partisanship.", "created_utc": "1621516749.0", "edited": "False", "id": "gythwjn", "is_submitter": "True", "link_id": "t3_ngzy1v", "parent_id": "t3_ngzy1v", "score": "0", "subreddit": "PerfectTiming", "subreddit_id": "t5_2t7te"}, {"author": "easeandchance", "body": "(Yep, I know what you are talking about.) Do you have a ballpark for a salary for such a position?   \nIn any case, I don't think that's something I would like to do and it doesn't scream *career opportunities* either.", "created_utc": "1621515474.0", "edited": "False", "id": "gytfff5", "is_submitter": "True", "link_id": "t3_ngytl3", "parent_id": "t1_gytdpql", "score": "1", "subreddit": "jobs", "subreddit_id": "t5_2qhnd"}, {"author": "easeandchance", "body": "I gave you silver for the comprehensive answer, but actually just the comment on Mr House's favorite nightstand lecture made me lol and my shoulders shrug ... eh .. I mean shake from laugter\n\nI will definitely try out the morally grey way. However, I can't shake the feeling that there aren't a lot of side quests or game decisions that have viable grey options that would make a morally grey character authentic (apart from the yes man main quests).", "created_utc": "1621430924.0", "edited": "False", "id": "gyp03ot", "is_submitter": "False", "link_id": "t3_nadfk8", "parent_id": "t1_gyoqafx", "score": "3", "subreddit": "Gamingcirclejerk", "subreddit_id": "t5_2sf2b"}, {"author": "easeandchance", "body": "I really like that you start with a very low amount of colors. I think it's always easier to add more action to the design than subtract it. \n\nHowever, I would urge you to reconsider your usage of color. As of now, the like button and the home symbol are the most noticeable UI-elements. Should they be that? \n\nI think you could kill two birds with one stone if you use more layers and create additional depth, i.e. box the buttons and use shadows. This way you can use only slightly different colors while still making clear elements possible AND then you can use stronger, starker colors for better contrast and accessibility without overburdening the design.\n\nI would really like to hear your thoughts about it or even see an updated version!", "created_utc": "1621123435.0", "edited": "False", "id": "gy9r606", "is_submitter": "False", "link_id": "t3_nd9sj6", "parent_id": "t3_nd9sj6", "score": "6", "subreddit": "UI_Design", "subreddit_id": "t5_2vqtk"}, {"author": "easeandchance", "body": "Which is the obviously good one? I have 400+ hours in the game but never finished it because I can't decide which faction I want to support - I always want to support the good guys.", "created_utc": "1620829667.0", "edited": "False", "id": "gxuuuwz", "is_submitter": "False", "link_id": "t3_nadfk8", "parent_id": "t1_gxuewwg", "score": "28", "subreddit": "Gamingcirclejerk", "subreddit_id": "t5_2sf2b"}, {"author": "easeandchance", "body": "The terms libertarian, economically liberal, and politically liberal are something of an etymological hobby detective case for me and holy cow am I confused after looking at that sub", "created_utc": "1620466574.0", "edited": "False", "id": "gxdeblo", "is_submitter": "False", "link_id": "t3_n799hl", "parent_id": "t1_gxcjvmn", "score": "1", "subreddit": "menwritingwomen", "subreddit_id": "t5_3ox0h"}, {"author": "easeandchance", "body": "Thank you all in advance! I googled hours for this, but couldn't find it", "created_utc": "1620381742.0", "edited": "False", "id": "gx98to4", "is_submitter": "True", "link_id": "t3_n6uzub", "parent_id": "t3_n6uzub", "score": "1", "subreddit": "tipofmytongue", "subreddit_id": "t5_2r4oc"}, {"author": "easeandchance", "body": "Thank you for the fast reply!", "created_utc": "1619664430.0", "edited": "False", "id": "gw93qc5", "is_submitter": "False", "link_id": "t3_l80mzv", "parent_id": "t1_gw877d0", "score": "1", "subreddit": "OrcsMustDie", "subreddit_id": "t5_2sz2r"}, {"author": "easeandchance", "body": "Hey u/Juicearific, any news on this front?", "created_utc": "1619646826.0", "edited": "False", "id": "gw838fl", "is_submitter": "False", "link_id": "t3_l80mzv", "parent_id": "t1_glp1nwk", "score": "1", "subreddit": "OrcsMustDie", "subreddit_id": "t5_2sz2r"}, {"author": "easeandchance", "body": "First off all, how readable - or better: how constant and steady is your handwriting? Because If your handwriting is as messy as mine (65% of the time I can't understand it myself), you'd spend more time editing and righting what any OCR-reader gives you as output.\n\nI just did a quick search for online ocr tools and came up with a bunch of them, here are some links (note: they are all available for apple products):\n\n\n- [Google lens via Google photos app](https://support.google.com/photos/answer/7539151?co=GENIE.Platform%3DiOS&hl=en) \n\n- [Microsoft Onenote](https://support.microsoft.com/en-us/office/microsoft-onenote-help-ipad-f44e5bcd-5203-4553-9de4-0c56e6500825)\n\n- [iPad iOS 14?!](https://www.google.com/amp/s/www.theverge.com/platform/amp/2020/6/22/21294662/apple-ipados-14-scribble-pencil-handwriting-typed-text-wwdc-2020)\n\n--> it's called [scribble](https://support.apple.com/guide/ipad/enter-text-with-scribble-ipad355ab2a7/ipados) and it's a build in feature from apple \n\nLastly, I want to mention that everytime you need to focus on note-taking, you're memorizing them or at least working with them. If you are for example studying medicine and need to memorize, that's great. It is not a waste of time when you need some more time, some extra focus to make sure the software interprets your handwriting correctly. \n\nHowever, if you just brainstorm or make conceptual or image heavy notes, I would definitely recommended to use this obstacle as an opportunity: export your notes as pictures or pdf and only extract the information that's really important at the end. As others have commented, a lot of people use that to polish their knowledge depot and refine it's content.", "created_utc": "1619641492.0", "edited": "False", "id": "gw7qu5k", "is_submitter": "False", "link_id": "t3_n0a6i9", "parent_id": "t1_gw5lun3", "score": "3", "subreddit": "ObsidianMD", "subreddit_id": "t5_2mz3dr"}, {"author": "easeandchance", "body": "Yeah, nothing special. Except the SATISFACTION. also, I don't need to hide all the time whenever I hear it's engines", "created_utc": "1619458982.0", "edited": "False", "id": "gvycsk8", "is_submitter": "True", "link_id": "t3_mxjnhz", "parent_id": "t1_gvrwkti", "score": "1", "subreddit": "GhostRecon", "subreddit_id": "t5_2s91l"}, {"author": "easeandchance", "body": "I used a sniper rifle, i.e. M82 without a silencer and with the sharpshooter skill.", "created_utc": "1619349616.0", "edited": "False", "id": "gvt3ewz", "is_submitter": "True", "link_id": "t3_mxjnhz", "parent_id": "t1_gvr11yf", "score": "2", "subreddit": "GhostRecon", "subreddit_id": "t5_2s91l"}, {"author": "easeandchance", "body": "Thumbs up to the creative mind who came up with \"Icarus Blues\", which is the name for the mission where you have to shoot an Azrael down.For the ones who don't know what I mean: all drones in the game have names inspired by greek mythology. Icarus is a mythological figure there. He and his father need to get off of an island. To do so, they build wings and use wax as glue. Icarus' father warns him to not fly close to the sun, i.e. too high. Of course, Icarus later on flies to high, the wax melts, and he falls to his death.While the mission name is still not really fitting, as the player SHOOTS DOWN the drone instead of it behaving somewhat irrationally, the title is still much better than the average \"sounds cool and relates to 10% of the quest\" title. In addition, the person coming up with the title probably was not the same person to come up with \"Azrael\", which is pretty fitting.\n\nmakes me think. For somebody spending all his life on the field, when he is not successfully conspiring against the US government, Cole Walker knows a sh\\*t ton about mythology, coming up with all those B-Rank names for the drones.I mean, \"Andras\" instead of \"Cerberus\" (a dog, so almost a wolf) or \"Artemis\" or \"Appollo\" (both gods of the hunt) or something? that's like calling a monster in a game \"Scott Disick\" instead of \"Kim K\" smh", "created_utc": "1619270755.0", "edited": "False", "id": "gvp0e9p", "is_submitter": "True", "link_id": "t3_mxjnhz", "parent_id": "t3_mxjnhz", "score": "12", "subreddit": "GhostRecon", "subreddit_id": "t5_2s91l"}, {"author": "easeandchance", "body": "Can the mods pls add this to the info we need to post when looking for LFG?  \n\nWhat do you think [u/CUDDLE\\_AND\\_BURY](https://www.reddit.com/user/CUDDLE_AND_BURY/) ?", "created_utc": "1619269241.0", "edited": "False", "id": "gvouu7v", "is_submitter": "False", "link_id": "t3_mxh4vw", "parent_id": "t3_mxh4vw", "score": "4", "subreddit": "GhostRecon", "subreddit_id": "t5_2s91l"}, {"author": "easeandchance", "body": "I think you're putting a name to a terminological inconsistency in this thread! \nIf you look at the other comments (mine included), you can notice how everyone is talking about a different concept - somewhere between \"asymmetrical gameplay\" and \"asymmetrical balance\".\n\nIt's hard to draw a line there and I would argue that asymmetrical balance is never the goal overall, that wouldn't be fun  Instead, asymmetrical balance while playing is an unusual momentarily gameplay experience that sticks out between all the classic competitive multiplayer games. \n\nI like to think about the feeling when you're playing battlefield and the enemies' mighty airship spawns. You might be bombed to pieces, but with a view! I just don't think one should expect to make a whole game both have gameplay variety and be based on that feeling alone.", "created_utc": "1619081890.0", "edited": "False", "id": "gvfapve", "is_submitter": "False", "link_id": "t3_mvxfln", "parent_id": "t1_gvf36zb", "score": "4", "subreddit": "patientgamers", "subreddit_id": "t5_2t3ad"}, {"author": "easeandchance", "body": "I disagree and would like to hear your opinion(s) about that. To quote: \"Sorry for the long comment, but your post inspired me to talk about this topic!\"\n\nI immediately thought of the typical \"classes\" in games. they are one archetype of how you can give the player an array of possibilities on how to play, so that she has the freedom to decide when to do what, while all of these options must somehow be viable to the player.\n\nExample Overwatch:\n Everyone has abilities, all abilities have viable use cases, the use cases happen in every game, and so *overall* the different setups equal each other out - however, what you fittingly named the \"moment-to-moment gameplay\" isn't balanced at all times. A tank is gonna crush a healer in 1v1 and so forth\n\nSimilar issues arise in strategy games. \n\nI disagree with the notion that asymmetrical multiplayer is more difficult to design, as one of their unique aspects is that you *only have to design gameplay-possibilities that are balanced in a specific pre-determined constellation*. \nIn other words: The DbD-Developers don't have to think about how balanced a murderer vs murderer match would be. Which is also a reason why the gameplay diversity is limited per the logic of the game.\n\nWhat do you think about that?\n\n\n\nLess thought out and more based on my gut I just think that we don't really want asymmetrical multiplayer games. We want multiplayer games with much more freedom/diversity of gameplay. Damage dealer vs Tank vs healer is now as old as is cavalry beats archery beats infantry beats cavalry etc But from a design perspective and per definition we don't want asymmetrical balance.\n\nackchyually, we want \"new classes\" like \"murderer\" and \"survivor\" that allow us to experience new gameplay. And as the first action of innovation tends to be mixing up what you already have, seemingly asymmetrical multiplayer came up naturally. Take known but not yet combined gameplay like a first person stealth game and a third person shooter and you have the origin story of \"spies vs mercs\" in splinter cell. The asymmetrical part isn't actually the balance, but the difference of ways on how to play.", "created_utc": "1619080950.0", "edited": "False", "id": "gvf9rmv", "is_submitter": "False", "link_id": "t3_mvxfln", "parent_id": "t1_gvexyj7", "score": "2", "subreddit": "patientgamers", "subreddit_id": "t5_2t3ad"}, {"author": "easeandchance", "body": "As Obsidian can't and won't substitute file managers like the basic windows explorer, I need to have folders or I will get way to lost when I have to do something not majorly text-based (i.e. markdown). If I imagine my photoshop stuff or video editing stuff without folders, I surely get nightmares!", "created_utc": "1618937583.0", "edited": "False", "id": "gv7ys33", "is_submitter": "False", "link_id": "t3_muubuv", "parent_id": "t3_muubuv", "score": "8", "subreddit": "ObsidianMD", "subreddit_id": "t5_2mz3dr"}, {"author": "easeandchance", "body": "thanks for the quick answer!", "created_utc": "1618851310.0", "edited": "False", "id": "gv3mymx", "is_submitter": "True", "link_id": "t3_mu3bv9", "parent_id": "t1_gv3es5e", "score": "1", "subreddit": "GhostRecon", "subreddit_id": "t5_2s91l"}, {"author": "easeandchance", "body": "I feel ya. I have not yet finished wildlands, but I have played around 400 hours of it in ghost mode. One day I will start it again, but just thinking about saving Amaru again makes me growl.   \nHowever, I feel like Breakpoint has less terrain glitches than wildlands. Or I use the fast travel more often than in wildlands, I'm not sure. If you've played wildlands, how would you the level of terrain glitchiness between the two?", "created_utc": "1618851297.0", "edited": "False", "id": "gv3mxgq", "is_submitter": "True", "link_id": "t3_mu3bv9", "parent_id": "t1_gv3jouh", "score": "2", "subreddit": "GhostRecon", "subreddit_id": "t5_2s91l"}, {"author": "easeandchance", "body": "I don't think there is such a behaviour possible yet. A start could be to open the graph view in a new window? There you could see the connections.\n\nIt's in no way an adequate substitute for what you are looking for, which is a shame really.", "created_utc": "1617318241.0", "edited": "False", "id": "gt330w0", "is_submitter": "False", "link_id": "t3_mhwher", "parent_id": "t3_mhwher", "score": "1", "subreddit": "ObsidianMD", "subreddit_id": "t5_2mz3dr"}, {"author": "easeandchance", "body": "u/Myrandall I am sorry, I even double checked the rules before writing the post but in the end its ton had changed to what it has become now. Won't happen again :)", "created_utc": "1617226008.0", "edited": "False", "id": "gsyl1cy", "is_submitter": "True", "link_id": "t3_mhc4hk", "parent_id": "t1_gsyay3r", "score": "1", "subreddit": "patientgamers", "subreddit_id": "t5_2t3ad"}, {"author": "easeandchance", "body": "u/cutting_shapes as u/Scribbles_some_words said, the extension includes a little pop-up window which lets you freely decide which parts of the displayed text you take. \n\nI would recommend to just try it, especially if you have a clear idea of what you don't want. As of now, your response makes me think that u/Scribbles_some_words and I have not been able to give you an accurate idea of the extensions features and aim.", "created_utc": "1617213781.0", "edited": "False", "id": "gsxugzk", "is_submitter": "False", "link_id": "t3_mh12cl", "parent_id": "t1_gswfi62", "score": "2", "subreddit": "ObsidianMD", "subreddit_id": "t5_2mz3dr"}, {"author": "easeandchance", "body": "Could you formulate your problem as a question? I don't quite get what you are looking for :) \n\nLike, you want to highlight web pages? And export the results into Obsidian, but only for storage not for reading? Is that right?\n\nIf I read an article in the web and need it for later, I always just print the page as a PDF and can then use any pdf reader.\nHowever, that doesn't sound like something you want.", "created_utc": "1617183032.0", "edited": "False", "id": "gswcngv", "is_submitter": "False", "link_id": "t3_mh12cl", "parent_id": "t1_gswawe2", "score": "3", "subreddit": "ObsidianMD", "subreddit_id": "t5_2mz3dr"}, {"author": "easeandchance", "body": "I second this particular extension.\n\nI tried at least 6 different extensions, more than 10 converter tools and more or less freely available (if you catch my drift) programs. If you want to get any kind of html - so web articles too - into markdown, this extension is the most reliable and non-intrusive one.", "created_utc": "1617182748.0", "edited": "False", "id": "gswcdtl", "is_submitter": "False", "link_id": "t3_mh12cl", "parent_id": "t1_gswc54y", "score": "2", "subreddit": "ObsidianMD", "subreddit_id": "t5_2mz3dr"}, {"author": "easeandchance", "body": "disclaimer: I don't know if we are talking about the exact same things, as I am not a native English speaker.\n\nI also don't know much about east Asian languages, but when somebody (and recent googling haha) explained Chinese syllables diverse meanings depending on tone to me, I came to the conclusion that they are comparable with the different mhm sounds. \nAFAIK, the mhm sounds also have different timing, making the individual sounds identifiable for Western ears while the Chinese syllables I am referring to are one single sound each, but differ in tone. \n\nAn earlier commentator spoke about the glottal STOP (I bet I have to edit this part EDIT: yep) which makes the difference between some mhm-sounds. Again: a STOP means timing not tone.\n\nAn example can be the syllable mā; má; mǎ; mà.\n\nImho this leaves another interesting question, inspired by another different comment: when westeners convey meaning like [Yes = yes, YES! = yes, goddamnit! , yeeees = yes, a win! , or yes /s] via tone and Chinese use tone for a syllables direct meaning, how is such indirect interpersonal communication transported in verbal Chinese communication?", "created_utc": "1614171035.0", "edited": "1614171227.0", "id": "goks5o8", "is_submitter": "False", "link_id": "t3_lqvumh", "parent_id": "t1_gojhn2l", "score": "1", "subreddit": "etymology", "subreddit_id": "t5_2qspe"}, {"author": "easeandchance", "body": "Hm, I am not sure if I understand correctly, but I don't think \"inanimate\" would only describe \"means, motive and opportunity\", but rather one of the states that can be attributed to them.\nI am looking for a more specific word, but I don't know if there is one (and subsequently if this is the right place/sub to ask for it).\nHowever, English ist my second language, so if I don't understand correctly or don't communicate sufficiently clear, pleae show and tell :)!", "created_utc": "1609172846.0", "edited": "False", "id": "ghascek", "is_submitter": "True", "link_id": "t3_kkh2ty", "parent_id": "t1_ghaqz58", "score": "1", "subreddit": "whatstheword", "subreddit_id": "t5_2sjdt"}, {"author": "easeandchance", "body": "Similar to the word \"volition\" contributed by the Reddit above you, all I could find about animus \"belongs to the field of psychology and is referring solely to the human mind. I am looking for something that also could describe other instruments like a gun (the means to kill somebody) or something more complex like a million dollars (the means to buy a company) for example.\"\nThank you for the contribution however! It seems I have a lot of reading to do in regards to psychology.", "created_utc": "1609171868.0", "edited": "False", "id": "ghaqjhi", "is_submitter": "True", "link_id": "t3_kkh2ty", "parent_id": "t1_gh3pims", "score": "1", "subreddit": "whatstheword", "subreddit_id": "t5_2sjdt"}, {"author": "easeandchance", "body": "All I could find about that belongs to the field of psychology and is referring solely to the human mind. I am looking for something that also could describe other instruments like a gun (the means to kill somebody) or something more complex like a million dollars (the means to buy a company) for example. \nHowever I've never heard of volition before, which happens less and less often with English words. So thank you very much for learning something new!", "created_utc": "1609171705.0", "edited": "False", "id": "ghaq8ug", "is_submitter": "True", "link_id": "t3_kkh2ty", "parent_id": "t1_gh2grym", "score": "1", "subreddit": "whatstheword", "subreddit_id": "t5_2sjdt"}, {"author": "easeandchance", "body": "Very interesting, yet even more specific than I thought it could be! Thank you very much!", "created_utc": "1609171487.0", "edited": "False", "id": "ghapuiu", "is_submitter": "True", "link_id": "t3_kkh2ty", "parent_id": "t1_gh2fyt6", "score": "1", "subreddit": "whatstheword", "subreddit_id": "t5_2sjdt"}, {"author": "easeandchance", "body": "That is already pretty interesting, and reinforcing my assumption that I am wandering into the realms of cultural sciences/sociology. Thank you very much!", "created_utc": "1609171419.0", "edited": "False", "id": "ghapq6e", "is_submitter": "True", "link_id": "t3_kkh2ty", "parent_id": "t1_gh2fjqm", "score": "1", "subreddit": "whatstheword", "subreddit_id": "t5_2sjdt"}, {"author": "easeandchance", "body": "I just moved into the flat and my lazy a*s only cooks pasta and thus I discovered this. Short gif available at: http://imgur.com/a/exKcknF", "created_utc": "1602771068.0", "edited": "False", "id": "g8wep5u", "is_submitter": "True", "link_id": "t3_jbo7tq", "parent_id": "t3_jbo7tq", "score": "2", "subreddit": "mildlyinteresting", "subreddit_id": "t5_2ti4h"}, {"author": "easeandchance", "body": "I had the same experience. This is why I am always ending a loop with a jump into the starting sector followed by a second (redundant) jump into the start sector.", "created_utc": "1597997510.0", "edited": "False", "id": "g2b1oep", "is_submitter": "False", "link_id": "t3_idrwu0", "parent_id": "t1_g2aycy3", "score": "8", "subreddit": "avorion", "subreddit_id": "t5_2xcjs"}, {"author": "easeandchance", "body": "I am 75% sure that you are right. But either it's not optimized or that's not it.\n\nWell then its impossible to do that with buying orders, because you can't enter numbers while holding shift.\n\nEDIT: I think you are right. However, that should only be an interim solution. When you are chaining up 10+ orders, which is pretty normal for a small trading cycle, it's already very easy to lift your finger from shift at the wrong time", "created_utc": "1596566569.0", "edited": "1596567435.0", "id": "g0cwzcy", "is_submitter": "True", "link_id": "t3_i3m7aa", "parent_id": "t1_g0cihmo", "score": "2", "subreddit": "avorion", "subreddit_id": "t5_2xcjs"}, {"author": "easeandchance", "body": "Afaik the transporter software needs a range of at least 2km (I use a minimum of 2.3km) for automated trading in sectors without player-presence.  \nCheck if your transport software has sufficient range.   \n\n\nIirc, this is because the tractor beam animation starts only when a player is in sector. If transport software <2km is installed, the tractor beam animation would need to start to enable trading. However, its animation does not start in sectors w/o players present.   \n\n\nI will search for the thread where somebody explained it like this.", "created_utc": "1596550040.0", "edited": "False", "id": "g0bsc13", "is_submitter": "False", "link_id": "t3_i3czud", "parent_id": "t3_i3czud", "score": "3", "subreddit": "avorion", "subreddit_id": "t5_2xcjs"}, {"author": "easeandchance", "body": "Yeah, that's what I thought, but it does not work out. Any idea which one specifically?", "created_utc": "1595696742.0", "edited": "False", "id": "fz7mdxm", "is_submitter": "True", "link_id": "t3_hxq1vl", "parent_id": "t1_fz7lybo", "score": "1", "subreddit": "avorion", "subreddit_id": "t5_2xcjs"}, {"author": "easeandchance", "body": "That is correct.\n\nBasically, I was already on my way out with my whole fleet and suddenly the xsotan warped in. They **do** attack me immediately. I give my vulnerable ships the order to go through the gate and cover their retreat - and sacrifice my two escorts in doing so.", "created_utc": "1595437708.0", "edited": "False", "id": "fyw1q6v", "is_submitter": "True", "link_id": "t3_hsiq7p", "parent_id": "t1_fyd3ep7", "score": "1", "subreddit": "avorion", "subreddit_id": "t5_2xcjs"}, {"author": "easeandchance", "body": "Oh and my other ships made it :)", "created_utc": "1594934683.0", "edited": "False", "id": "fyamzhu", "is_submitter": "True", "link_id": "t3_hsiq7p", "parent_id": "t3_hsiq7p", "score": "2", "subreddit": "avorion", "subreddit_id": "t5_2xcjs"}, {"author": "easeandchance", "body": "Oh and... my other ships made it :)", "created_utc": "1594934079.0", "edited": "False", "id": "fyalqxx", "is_submitter": "False", "link_id": "t3_hsiir0", "parent_id": "t3_hsiir0", "score": "1", "subreddit": "avorion", "subreddit_id": "t5_2xcjs"}, {"author": "easeandchance", "body": "My heart is racing all the time when I take Ritalin. As the others have said: the third day is pretty early. Either your body gets used to it or you should talk to your doctor.\n\nSome tips that still help me:\n\nAvoid stuff that could increase this side effect. Maybe you are drinking coffee, energy drinks or some sorts of tea that contain coffein or similar stimulants? If yes, drink something else, preferably a lot of water.\n\nUnderstand that your subconsciousness will increase all sideeffects. When I noticed my heart racing at first, I became even more nervous and in turn my heart pumped even faster... Instead write down how you feel or what you think and continue with whatever task is ahead of you.\n\nSleep, eat, plan. Sleep well and sufficiently long, eat well and enough and plan ahead the days of your ritalin-induced focus and the power that comes with it.", "created_utc": "1594020715.0", "edited": "False", "id": "fx2uhpt", "is_submitter": "False", "link_id": "t3_hlvpfw", "parent_id": "t3_hlvpfw", "score": "1", "subreddit": "adderall", "subreddit_id": "t5_2rn3k"}, {"author": "easeandchance", "body": "What really are the expectations regarding scientific skills for a Bachelors' Degree/Thesis?\n\nI am currently in the penultimate semester of a Bachelor of Arts in International Relations & Political Science. On our university, we pride ourselves with an untypically strong research focus, leading to - among other things - to a record number of alumni successfully pursuing a doctorate. \n\nAs part of this research focus, even the undergraduates must take classes in fundamental and advanced methods. However, I feel like there is a class missing. On one hand, the very first thing we learn is that the research question mandates the method and not the other way around. On the other hand, the advanced method classes are random every semester and - of course - you have to write a paper, using the respective method, contradicting what was drilled into our minds in \"Science 101: Principles of Research\". Hence, what's missing is a class where you learn which method to use depending on your RQ and data available.\n\nAfter I explained my frustration with this to a friend, he argued that somebody who has a good overview when to use which method knows more than you are supposed to learn within your BA. And that such expectations on an individuals research and methodology know-how are reserved for MAs and PhDs. \n\nIs he correct?", "created_utc": "1591194098.0", "edited": "False", "id": "fsqzif0", "is_submitter": "False", "link_id": "t3_gug32w", "parent_id": "t3_gug32w", "score": "1", "subreddit": "AskAcademia", "subreddit_id": "t5_2sakj"}, {"author": "easeandchance", "body": "Fellow undergrad here, I don't know what's right or wrong in regard to the content, but I can tell you that most of the citation softwares (e.g. citavi, Mendeley, zotero, etc) take this problem away from you. \nI fill unclear citavi references with all viable information and just choose the required citation-style. Citavi then knows exactly how to qoute; what to include and what to exclude.", "created_utc": "1588065498.0", "edited": "False", "id": "fottfr2", "is_submitter": "False", "link_id": "t3_g8vzq8", "parent_id": "t1_fot3kxy", "score": "1", "subreddit": "AskAcademia", "subreddit_id": "t5_2sakj"}, {"author": "easeandchance", "body": "Why shouldn't assassin rogues use devastating blow?\n\nWill definitely look into constant DPS debugffing builds", "created_utc": "1585233934.0", "edited": "False", "id": "flk4te5", "is_submitter": "True", "link_id": "t3_fp0e5a", "parent_id": "t1_fljuwgl", "score": "1", "subreddit": "projecteternity", "subreddit_id": "t5_2v1qz"}, {"author": "easeandchance", "body": "Well, regarding the rogue, I am speaking about \"devastating blow\" and \"finishing blow\". Are you saying you don't use Finishing Blow? If not, why not?\n Using all of the rogues DoT effects is pretty good, but also time consuming and sometimes you need.to kill off a high health enemy quickly.\nLooking at the druid, I only see sunlance and taste of the hunt as non-AoE attacks. TotH is really bad and sunlance is Powerlevel 6, so only available pretty late when you multiclass.\nWizard has so many spells, which is specifically why I asked this question here: which of them are really viable against high health single targets? I use necrotic Lance, but it doesn't seem very good...", "created_utc": "1585185759.0", "edited": "False", "id": "flimjqf", "is_submitter": "True", "link_id": "t3_fp0e5a", "parent_id": "t1_flif7c4", "score": "1", "subreddit": "projecteternity", "subreddit_id": "t5_2v1qz"}, {"author": "easeandchance", "body": "As an undergrad student in the last year, I would like to especially emphasize the usefulness of early quizzes. Every \"difficult\" class I had relied on these quizzes. They made splitting the workload easier and enabled us to understand the courses content early - because often we  were still figuring out how \"studying\" works and otherwise would not have started studying the material as early as necessary.\nBtw - we'll still hate you for it though", "created_utc": "1567211518.0", "edited": "False", "id": "eymk9jh", "is_submitter": "False", "link_id": "t3_cxhjrh", "parent_id": "t1_eyliaed", "score": "3", "subreddit": "AskAcademia", "subreddit_id": "t5_2sakj"}, {"author": "easeandchance", "body": "Yo man, this is amazing. Maybe when I start earning money after uni, I'll approach you to buy some of your stuff. \n\nRemindMe! 1825 days", "created_utc": "1564552629.0", "edited": "False", "id": "evizlxz", "is_submitter": "False", "link_id": "t3_ck0b0j", "parent_id": "t3_ck0b0j", "score": "2", "subreddit": "drawing", "subreddit_id": "t5_2qvp9"}, {"author": "easeandchance", "body": "I think it is a combination of flow and instant gratification. Flow means you are in a state of mind where you are equally challenged and capable of providing a solution, thus you are not bored nor anxious.\nYour level of skill varies from game to game. So at some games, you are easier to get into the flow than in others.\n\nAnd when get into the flow state, you are probably experiencing the instant gratification loop of games as we know it. \nFurther reading: https://www.gamasutra.com/view/feature/166972/cognitive_flow_the_psychology_of_.php", "created_utc": "1563958051.0", "edited": "False", "id": "eupjeza", "is_submitter": "False", "link_id": "t3_ch5h9m", "parent_id": "t3_ch5h9m", "score": "6", "subreddit": "StopGaming", "subreddit_id": "t5_2tjkc"}, {"author": "easeandchance", "body": "Ah, thank you for clearing that up! I am a not an English native and this has been very confusing for me everytime I encounter it.\n\nSomehow a lot of internet registration processes require you to choose from a drop-down list of fields of studies and as a politics student, I sometimes have to choose humanities and sometimes social sciences. Again thanks for clearing that up.", "created_utc": "1563871607.0", "edited": "False", "id": "eujhonm", "is_submitter": "False", "link_id": "t3_cga49x", "parent_id": "t1_eugnijo", "score": "2", "subreddit": "AskAcademia", "subreddit_id": "t5_2sakj"}, {"author": "easeandchance", "body": "Is it only my perception or are there almost no academics from the humanities (especially Political Studies, Sociology, Economics) active on r/askAcademia?\n\nEDIT: I have been informed that I am confusing the humanities and the social sciences here. I will just leave it as it is right now and say that I generally felt underrepresented (in r/askAcademia ) as somebody who studies Politics and considers an academic career.", "created_utc": "1563788734.0", "edited": "1563871843.0", "id": "eufs3l2", "is_submitter": "False", "link_id": "t3_cga49x", "parent_id": "t3_cga49x", "score": "12", "subreddit": "AskAcademia", "subreddit_id": "t5_2sakj"}, {"author": "easeandchance", "body": "I am gonna watch videos of people studying now. If that works, I owe you a drink of your choice. \n\nOn a similar note, I started watching stand up comedy videos before dates, and it made me funnier and more confident, so it might work with studying too.", "created_utc": "1562154251.0", "edited": "False", "id": "esnxzqv", "is_submitter": "False", "link_id": "t3_c8i0b5", "parent_id": "t1_esmynah", "score": "3", "subreddit": "StopGaming", "subreddit_id": "t5_2tjkc"}, {"author": "easeandchance", "body": "I love the alcohol example. Imagine someone going to alcoholics anonymous and telling them that some people enjoy alcohol and that the definition of drinking they have is wrong. \nIn addition I would like to point out how often we have posts here in the line of \"my SO/brother/father is gaming so much that he doesn't spend time with his family/career.\" Even though some of these perceptions might be exaggerated it shows that there are relationships problems that correlate with gaming.", "created_utc": "1560446445.0", "edited": "False", "id": "er2nbp0", "is_submitter": "False", "link_id": "t3_c07yjk", "parent_id": "t1_er2hgpc", "score": "3", "subreddit": "StopGaming", "subreddit_id": "t5_2tjkc"}, {"author": "easeandchance", "body": "Because some of us are no longer able to unwind in other ways. And for me, for example, I would always use gaming as a reward. As a result, I didn't perceive other interests to unwind: sport, dating, art, etc\n\nHowever, of course it is still fine to play in moderation.to unwind", "created_utc": "1560156982.0", "edited": "False", "id": "eqm60y9", "is_submitter": "False", "link_id": "t3_bysvwr", "parent_id": "t1_eqlvkug", "score": "2", "subreddit": "StopGaming", "subreddit_id": "t5_2tjkc"}, {"author": "easeandchance", "body": "I think the point here is hidden in your answer: You still perceive gaming as something as a high reward. Because it is fun. But why is it fun? Because the games exploit your brains mechanisms to get your endorphins rolling. I think the idea is to overcome the \"games are gonna be my reward\" attitude and gain an \"there is already fun in the things I do\" attitude.\n\nFor me it works like that: As long as I game, I am longing for gaming. Thus, I do not enjoy the things I do while \"waiting\" to finally play.", "created_utc": "1560145618.0", "edited": "False", "id": "eqljqmz", "is_submitter": "False", "link_id": "t3_bysvwr", "parent_id": "t3_bysvwr", "score": "2", "subreddit": "StopGaming", "subreddit_id": "t5_2tjkc"}, {"author": "easeandchance", "body": "I know I know, but you are completely misunderstanding me apparently: Severely limiting my options is the whole idea! Think about it like this: You want to buy lunch. Your Budget ist limited. You don't like Mexican food. Only place to eat is a Mexican foodtruck. Would you rather skip lunch or eat what you don't like, knowing that there's gonna be better food around tomorrow?\n\nIf you know there is a certain trait you don't like while there are thousands of options available, why would you take a bad one.\n\nHowever, I am completely ok with having friends without laser focused passions. It's just something I am seriously looking for in a SO.", "created_utc": "1558630188.0", "edited": "False", "id": "eoiz0a2", "is_submitter": "True", "link_id": "t3_brrbt7", "parent_id": "t1_eogbehf", "score": "1", "subreddit": "dating_advice", "subreddit_id": "t5_2s4kl"}, {"author": "easeandchance", "body": "As a student (that has never asked for a better grade) I would recommend you to do two things: First think about a red line you are not willing to cross regarding \"tweaking\" and secondly consider doing one day with open office hours, where you let students in and let them talk with you. You can frame it to be about \"further questions regarding the course\" or even make clear that it's about the grades/final/assignment. I have a bunch of Profs who do this because it eliminates lazy students to make their claim real and effectively costs them less time than looking into all complaints on their own. Our statistics and empirical methods prof (who gets through this every semester) basically has all the exams on his table and picks out yours, hands it to you and let's you make your point quickly. Sometimes it just makes sense and other times it doesn't. Never takes him more than 5min per student and never takes him more than one afternoon, but improves his evaluation by a quarter.", "created_utc": "1558511048.0", "edited": "False", "id": "eoewhze", "is_submitter": "False", "link_id": "t3_brl14a", "parent_id": "t3_brl14a", "score": "4", "subreddit": "AskAcademia", "subreddit_id": "t5_2sakj"}, {"author": "easeandchance", "body": "Well, I had great success in finding interesting topics by looking for something I was already interested in in Encyclopedias and Bibliographys. However I come from social sciences and it could be different in engineering.", "created_utc": "1557132733.0", "edited": "False", "id": "emmpp8k", "is_submitter": "False", "link_id": "t3_bl8e8f", "parent_id": "t3_bl8e8f", "score": "7", "subreddit": "AskAcademia", "subreddit_id": "t5_2sakj"}, {"author": "easeandchance", "body": "\"I guess the first question to ask is \"what is a mental illness\" to begin with? And how is such defined? Can we empirically verify the existence of a mental illness and such?\n\nThe problem being that we can't currently - when you go to a psych they don't take a blood test or give you a brain scan - in rare cases, yes - but in general, no - our knowledge of what causes depression is a hodgepodge of theories as well - \"\n\nI am not 100% sure, but I think this - your - assumption is wrong. Today, psychiatrists can scan brains and see if the mechanisms regarding hormons such as dopamin and generally endorphines work as they are supposed to be. And in contrast to your assumption that this is done only in rare cases, (at least in Germany) every patient that is being diagnosed in a psychiatric unit has to undergo brain scans and other physical examinations.\n\nYour statement that mental illnesses per definition can not exist is quite philosophical imo. However, mental health as \"is your hormone production abnormal?\" can be tested and treated as an illness and not a religion.", "created_utc": "1557059859.0", "edited": "False", "id": "emk19nx", "is_submitter": "False", "link_id": "t3_bkwrlo", "parent_id": "t1_emjzemy", "score": "0", "subreddit": "changemyview", "subreddit_id": "t5_2w2s8"}, {"author": "easeandchance", "body": "Google for communities in your area, Read, Audiobooks, Sleep more", "created_utc": "1556988801.0", "edited": "False", "id": "emhx55t", "is_submitter": "False", "link_id": "t3_bkek4e", "parent_id": "t3_bkek4e", "score": "1", "subreddit": "StopGaming", "subreddit_id": "t5_2tjkc"}, {"author": "easeandchance", "body": "One thing I started doing is pretty simple: Go to sleep earlier, if sensible. That allowed me to wake up ealier and start each day with more energy and if saved me the boredom you describe: not wanting to do anything active and still wanting to so something.\n\nOtherwise: writing stories (maybe start with r/writingprompts) or scripts or poems or similar stuff might work.\nIt is something active, however I find myself always motivated to socialize or hang out with friends. Boardgames had a real comeback the last years.\nIf you don't like reading that much you could try audiobooks.", "created_utc": "1556527731.0", "edited": "False", "id": "em1nm9e", "is_submitter": "False", "link_id": "t3_bin0q6", "parent_id": "t3_bin0q6", "score": "3", "subreddit": "StopGaming", "subreddit_id": "t5_2tjkc"}, {"author": "easeandchance", "body": "Hey, I am not sure if it's the same in english, but if you translated that literally into german, he/she would be somebody who focuses on the research of research itself. I have one prof at my university who is rhe head of the methodology department and he excels in research designs and has conducted numerous studies about the internal and external validity of research methods, e.g. quantative and qualitative approaches like Computer assisted qurstioning, structured interviews, questionnaires and how to structure them, etc\n\nThings you might have heard of in that field are the \"sponsoring effect\", \"effect of social desirability\" and so on.\nI always recommend to other students who are doing research (we are a research focused university, having undergrads who present at international conferences) to take their research design to him and he will rip it apart in 5min just to come up with a better and more cost and time efficient method in another 5min.", "created_utc": "1555496917.0", "edited": "False", "id": "el3a9jn", "is_submitter": "False", "link_id": "t3_be4ejy", "parent_id": "t3_be4ejy", "score": "5", "subreddit": "AskAcademia", "subreddit_id": "t5_2sakj"}, {"author": "easeandchance", "body": "Well, I would recommend two programmes, which could help you tremendously:\n1. Grammarly (or something similar):\nIt will improve your grammar and reduce orthographic mistakes. You will also most probably learn from it.\n2. Citavi:\nThis one is a little more complex. It is structured around the idea that everything you put into a paper is basically some forme of knowledge: your own analysis, citations, summarys and parapharasing parts of others as well as quantatative analysis. What it does, however, is that by doing that, it will help you to consider each little part you put into a paper. By doing that, you will automatically think about the following questions: \"What should I say before addressing this issue? What needs yo be done after addressing it\" and - most importantly - \"is this the right place (in my structure) to explain this issue?\"\n\nHowever, generally I would always recommend, that you let somebody else proofread your stuff.\nAnd even if you do not consider the aforementioned programs, that saved me countless hours, I strictly recommend you to write in a way that you are always able to lay out a structure of your work that is basically a sceleton of your fleshed out (pun intended) text. If somebody reads your structure-sceleton, only compromised of one sentence max per part, and does not understand it, the fulltext will not be understable, too.", "created_utc": "1554989659.0", "edited": "False", "id": "ekmo02g", "is_submitter": "False", "link_id": "t3_bbxj9p", "parent_id": "t3_bbxj9p", "score": "1", "subreddit": "AskAcademia", "subreddit_id": "t5_2sakj"}, {"author": "easeandchance", "body": "Regarding Number 1:\nIf the aufience is very big, the following always works:\nLook at the chest of the second row, the wall in the back and the sides of the room.\nIf you look at the chest of the second row, they think you look in the eyes of the first one, and vice versa.\nGenerally, I concur with u/AceyAceyAcey: nobody gives a damn if you look in their eyes", "created_utc": "1554872691.0", "edited": "False", "id": "ekj0b6e", "is_submitter": "False", "link_id": "t3_bbeh0c", "parent_id": "t1_ekinjsf", "score": "2", "subreddit": "AskAcademia", "subreddit_id": "t5_2sakj"}, {"author": "easeandchance", "body": "Could you please let us know, what your librarian digs up? Fellow IR Scholar here", "created_utc": "1554722012.0", "edited": "False", "id": "ekdofuh", "is_submitter": "False", "link_id": "t3_baqquf", "parent_id": "t1_ekdkp9m", "score": "2", "subreddit": "AskAcademia", "subreddit_id": "t5_2sakj"}, {"author": "easeandchance", "body": "My experience is two fold:\n1. Do something \"bad\" like Netflix or surfing the web (e.g. Reddit or youtube). For me, i save 5h a day on average when i don't game. I will however never watch 5h of Netflix every day (if i stick to movies) and i will get bored with the web sooner rather than later. And I am sorry to break this to you but your brain will need some time until it reorganizes the gratification center, so I was bored in the beginning \n2. Do something you really want to do. This is very difficult, i know. For me, I cooked nice food (takes time and is something you will enjoy a lot).\n\nBut I really was just bored at the beginning. After the first days however everything i did was beeing more and more fun. ", "created_utc": "1554163476.0", "edited": "False", "id": "ejwvfv5", "is_submitter": "False", "link_id": "t3_b88pq5", "parent_id": "t3_b88pq5", "score": "2", "subreddit": "StopGaming", "subreddit_id": "t5_2tjkc"}, {"author": "easeandchance", "body": "Ok. I can do this.\n\nI herby commit myself to not gaming for 90days.\n\nI already stopped like a week ago and noticed how i got a better grip on life right from the start. I got mywelf organized, stopped a lot of procrastinating and in the end achieved gratification not through level ups but through real life things I got done and which will keep on giving\n\n1. I have started applications for internships I am interested in and which will help me with my career (I am a college student). I have written two applications throughout my life while my peers have written up to 20 - thanks gaming... \n\n2. I target my problems and taks head-on and don't postpone them anymore: this has increased my confidence immensely. So much in fact that I had the first one night stand of my life. (i have had my fair share of girlfriends and friends with benefits but never measured the confidence for asking a stranger to get home with me (in part because home was never tidy, thanks to gaming)) \n\n3. I have more time on hand for my friends and social contacts, because I have more time in general.\nThe best thing happening so far was me finishing a task with a whole day to spare until the deadline! I always thought of myself of a chronic procrastinator, but with the time rescued from gaming I beat my habits!\n\nIf I can do this and achieve so much in so little time, so can you! Thanks to the guys running this sub!", "created_utc": "1554105834.0", "edited": "False", "id": "ejv195a", "is_submitter": "False", "link_id": "t3_b7z095", "parent_id": "t3_b7z095", "score": "9", "subreddit": "StopGaming", "subreddit_id": "t5_2tjkc"}, {"author": "easeandchance", "body": "And the crazy thing is how they bundle the feeling of achievment (You managed to kill the mob! Good job!) AND the chance and award system together! It totally works towards your brains gratification center. ", "created_utc": "1553950152.0", "edited": "False", "id": "ejq9x3e", "is_submitter": "False", "link_id": "t3_b7ae0f", "parent_id": "t3_b7ae0f", "score": "12", "subreddit": "StopGaming", "subreddit_id": "t5_2tjkc"}, {"author": "easeandchance", "body": "you mean the worst if you want to stop gaming or they are the worst game that exist?", "created_utc": "1553339976.0", "edited": "False", "id": "ej6qxqg", "is_submitter": "True", "link_id": "t3_b4hz8u", "parent_id": "t1_ej6qnu6", "score": "1", "subreddit": "StopGaming", "subreddit_id": "t5_2tjkc"}, {"author": "easeandchance", "body": "Very short, very sweet. Had to laugh out loud!\n\n&#x200B;", "created_utc": "1546951832.0", "edited": "False", "id": "edk26sc", "is_submitter": "False", "link_id": "t3_adrok0", "parent_id": "t1_edjockh", "score": "3", "subreddit": "WritingPrompts", "subreddit_id": "t5_2s3nb"}]