[{"author": "ella-eerie", "body": "while it depends on a lot of factors, for the most part i like chapters if the fic is more than 15k, honestly! i can read pretty darn fast, but i like having a place i can comfortably stop at instead of going ‘after this… after this… after this…’ until i’m at the end. HOWEVER i do feel chapter breaks need to be satisfying, and if a work has been written intended to be consumed as one long story, it can be hard to break it up without it seeming clunky; it may be better off kept as is if it doesn’t feel natural to insert breaks. (i made this error with my most recent fic, and the regret i feel is IMMEASURABLE. LMAO)", "created_utc": "1666814046.0", "edited": "False", "id": "itwc0dm", "is_submitter": "False", "link_id": "t3_ydfba5", "parent_id": "t3_ydfba5", "score": "1", "subreddit": "AO3", "subreddit_id": "t5_3c2cn"}, {"author": "ella-eerie", "body": "i love the idea of this so much!! excited to give it a try!!", "created_utc": "1666715602.0", "edited": "False", "id": "itqow68", "is_submitter": "False", "link_id": "t3_yd3hpn", "parent_id": "t3_yd3hpn", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "ella-eerie", "body": "found family. in other media, i can be convinced to enjoy it. but in fanfiction, it just… almost always feels forced, arbitrary, and—in certain contexts— performative. i think the biggest problem with liking it, for me, is that it often operates under the idea that friendship… just doesn’t exist, or that it isn’t as valuable as an adoptive/voluntary/surrogate bond that mirrors a typical family dynamic. why are people not allowed to be friends? why are they always “”sibling-coded”” or something?? but yeah hopefully this makes sense LOL", "created_utc": "1666705694.0", "edited": "False", "id": "itq0ahf", "is_submitter": "False", "link_id": "t3_ycimbe", "parent_id": "t3_ycimbe", "score": "1", "subreddit": "FanFiction", "subreddit_id": "t5_2r5kb"}, {"author": "ella-eerie", "body": "speaking anecdotally, i’ve always gotten the sense that a pretty striking number of smut-writers are aspec in SOME capacity??? i am, most of my fic-writing friends (past and present) are, and half the people in this thread are too! cool to see that perspective validated a little bit. these warnings are still very funny one way or another tho HVKHNKKN", "created_utc": "1666704861.0", "edited": "False", "id": "itpyf9r", "is_submitter": "False", "link_id": "t3_ycpgke", "parent_id": "t3_ycpgke", "score": "-1", "subreddit": "AO3", "subreddit_id": "t5_3c2cn"}, {"author": "ella-eerie", "body": "oh!!!! yes!! as much as i feel guilty about it, cause rationally i do not WANT to have gatekeepy sentiments, i 100% get this feeling—about glass animals in particular. it was fun to see everyone enjoying them, at first, but it became a misery so fast. music is the core of my very soul, the special interest to rule all special interests, blah blah etc., you know how it is! my sincere belief that the way others enjoy things is okay is locked into eternal war with my protective instinct and sadness that not everyone is picking apart lyrics to understand them. definitely gets frustrating. :/", "created_utc": "1666657897.0", "edited": "False", "id": "itntgaw", "is_submitter": "False", "link_id": "t3_ycfym3", "parent_id": "t1_itn7i5n", "score": "4", "subreddit": "AutismInWomen", "subreddit_id": "t5_3yx96k"}, {"author": "ella-eerie", "body": "homestuck. definitely not as serious as a lot of the stuff posted here, but i met my “ex” through our mutual special interest in it (though of course i would not know it was one till later). i was 14 and she was 18 at the time, so it was … not GREAT. i always end up thinking i’m over it and crave that familiar material until i actually try to look at anything related to homestuck, at which point i find that the pit in my stomach disagrees!", "created_utc": "1666657108.0", "edited": "False", "id": "itnrnt7", "is_submitter": "False", "link_id": "t3_ycfym3", "parent_id": "t3_ycfym3", "score": "1", "subreddit": "AutismInWomen", "subreddit_id": "t5_3yx96k"}, {"author": "ella-eerie", "body": "arbitrary?? no way, it’s a huge deal to hit novel length on a project!! make it as significant of a milestone as it feels to you, you deserve to celebrate!", "created_utc": "1666655534.0", "edited": "False", "id": "itno6ir", "is_submitter": "False", "link_id": "t3_yc1vrj", "parent_id": "t1_itndy3z", "score": "2", "subreddit": "AO3", "subreddit_id": "t5_3c2cn"}, {"author": "ella-eerie", "body": "that’s so amazing!!! i admire that a lot; congratulations!!", "created_utc": "1666644199.0", "edited": "False", "id": "itmxtkm", "is_submitter": "False", "link_id": "t3_yc1vrj", "parent_id": "t3_yc1vrj", "score": "3", "subreddit": "AO3", "subreddit_id": "t5_3c2cn"}, {"author": "ella-eerie", "body": "hi! i just wanted to say that it’s really interesting and, honestly, reassuring to see another adopted person in here! some of our other experiences are different overall, but i hope you find the connections that are right for you with the rest of your family, even if it’s none at all, and wish you well as you grow spiritually!!", "created_utc": "1666617723.0", "edited": "False", "id": "itl3jfn", "is_submitter": "False", "link_id": "t3_yc0l5n", "parent_id": "t1_itjyemb", "score": "2", "subreddit": "mixedrace", "subreddit_id": "t5_2qnue"}, {"author": "ella-eerie", "body": "tbh… none, except for listening to music and daydreaming a bit. i just have an idea, start writing it and pay for it all with the pieces of my lil soul SUSPENDED in wips that will be wips forever. my hubris stares me down every time and yet i never learn!!", "created_utc": "1666487790.0", "edited": "False", "id": "itejrgz", "is_submitter": "False", "link_id": "t3_yajmnm", "parent_id": "t3_yajmnm", "score": "2", "subreddit": "AO3", "subreddit_id": "t5_3c2cn"}, {"author": "ella-eerie", "body": "couldn’t agree more!!! it’s positively blissful knowing how safe my stuff is on ao3. everywhere else feels like a gamble in comparison.", "created_utc": "1666395361.0", "edited": "False", "id": "it9pmc2", "is_submitter": "False", "link_id": "t3_ya4ccm", "parent_id": "t1_it94wcv", "score": "12", "subreddit": "AO3", "subreddit_id": "t5_3c2cn"}, {"author": "ella-eerie", "body": "tamaki suoh from ouran high school host club is probably my favorite, even though “better” white/asian rep is out there now! apart from the deeper emotional resonance, i think it’s because i love dramatic, “over the top” characters, and his entire aesthetic is also just so fuckin’ SICK to me LMAO", "created_utc": "1665748185.0", "edited": "False", "id": "is9zq25", "is_submitter": "False", "link_id": "t3_y2w9hg", "parent_id": "t3_y2w9hg", "score": "1", "subreddit": "mixedrace", "subreddit_id": "t5_2qnue"}, {"author": "ella-eerie", "body": "if they’re main characters, i probably will. not as a “quality” or judgment thing, it’s more that i rarely go on ao3 without a specific idea in mind of what i’m looking for. but supporting ocs are great! they add vibrancy and freshness to a narrative, and when someone handles them right, they can fit right in seamlessly!", "created_utc": "1665707273.0", "edited": "False", "id": "is879ox", "is_submitter": "False", "link_id": "t3_y3afk8", "parent_id": "t3_y3afk8", "score": "7", "subreddit": "AO3", "subreddit_id": "t5_3c2cn"}, {"author": "ella-eerie", "body": "haha me too!!! “thanks for sharing” is my go-to and my phone expects it all the time. it’s just really nice to (hopefully) convey the message to authors that “i know you didn’t HAVE to write this, let alone share it for no profit, but i’m so happy you did!”", "created_utc": "1664232980.0", "edited": "False", "id": "iq187wz", "is_submitter": "False", "link_id": "t3_xogq48", "parent_id": "t1_ipzs0v5", "score": "3", "subreddit": "AO3", "subreddit_id": "t5_3c2cn"}, {"author": "ella-eerie", "body": "YOOOO i think you might be right!!!! until this comment, i couldn’t articulate why first person doesn’t really bother me in original works, yet i find it unbearable in fics. but i think this shift in the reader’s vantage point of the character IS responsible for how uneasy it makes me feel. i think i recall reading first person divergent trilogy fanfiction in middle school, for example, without problems. astute observation!", "created_utc": "1661881880.0", "edited": "False", "id": "imexnc8", "is_submitter": "False", "link_id": "t3_x1aq11", "parent_id": "t1_imdiv7k", "score": "5", "subreddit": "AO3", "subreddit_id": "t5_3c2cn"}, {"author": "ella-eerie", "body": "a few of my friends know and have seen my writing, only because we do writing projects together. otherwise… nope! my younger sibling knows about it, but doesn’t read my work. i don’t tell my other family members or friends at all. however, i just do it for fun exclusively—if it were something i did as a career or side-job, i think i might tell a few more people about it.", "created_utc": "1661177749.0", "edited": "False", "id": "ilbo6la", "is_submitter": "False", "link_id": "t3_wug8gw", "parent_id": "t3_wug8gw", "score": "1", "subreddit": "writing", "subreddit_id": "t5_2qh2n"}, {"author": "ella-eerie", "body": "if it were halloween you could make them look like candy corn! LMAO but fr the growth looks amazing!!", "created_utc": "1658242574.0", "edited": "False", "id": "igs9whc", "is_submitter": "False", "link_id": "t3_w1z5xs", "parent_id": "t3_w1z5xs", "score": "1", "subreddit": "calmhands", "subreddit_id": "t5_2ssjn"}, {"author": "ella-eerie", "body": "adorable!!! i love these!!!", "created_utc": "1657835625.0", "edited": "False", "id": "ig6o9hx", "is_submitter": "False", "link_id": "t3_vz69bc", "parent_id": "t3_vz69bc", "score": "5", "subreddit": "RedditLaqueristas", "subreddit_id": "t5_2se5q"}, {"author": "ella-eerie", "body": "yeah, you’re probably right! i try to keep the phase of doing that sort of thing very very short, but due to the culture of where i live it’s very hard to make a good impression on people if you don’t do the things they expect. but it is what it is and i shouldn’t be unfair to others.", "created_utc": "1657806138.0", "edited": "False", "id": "ig4kbhi", "is_submitter": "False", "link_id": "t3_vyunlj", "parent_id": "t1_ig4ec1l", "score": "1", "subreddit": "AutismInWomen", "subreddit_id": "t5_3yx96k"}, {"author": "ella-eerie", "body": "thank you so much!!!! i really appreciate it, and will be pushing on the best i can. and yes i AGREE! the skin-biting is DEFINITELY the harder part, i think i didn’t realize just how much i did it (despite the bleeding and repeat infections) until i started trying to stop!", "created_utc": "1657491669.0", "edited": "False", "id": "ifnen4v", "is_submitter": "True", "link_id": "t3_vv5kbs", "parent_id": "t1_ifl66sa", "score": "2", "subreddit": "calmhands", "subreddit_id": "t5_2ssjn"}, {"author": "ella-eerie", "body": "i’m SO late getting back with y’all— geez, almost a month?!? things got really hard in my life, emotionally, but i’m honestly so proud of myself because throughout all of it, i didn’t turn back to the coping mechanism of biting and ripping. instead, i journaled, cleaned, drew, baked. i have held on so firmly to my goals for these hands and have only cracked with occasional chewing of the skin. far from perfect, but it’s so much better than before. i of course haven’t gotten to my goal of “over 3 months” yet, however i feel so confident that i will manage it in the end!!! thank you all so much for your support, i have been keeping you strongly in mind despite being away, and using that kindness to bolster my resolve. (ps peep the very simple accounting textbook, that class is like 40% responsible for how tough this month has been LMAOOOO)", "created_utc": "1657384839.0", "edited": "1657385130.0", "id": "ifhoyyq", "is_submitter": "True", "link_id": "t3_vv5kbs", "parent_id": "t3_vv5kbs", "score": "1", "subreddit": "calmhands", "subreddit_id": "t5_2ssjn"}, {"author": "ella-eerie", "body": "a fellow pianist, hello!!! good luck on your journey, it’s so rewarding to begin to feel you don’t have to pick or bite to work through your stresses in life.", "created_utc": "1657383600.0", "edited": "False", "id": "ifhm2ou", "is_submitter": "False", "link_id": "t3_vuwq9p", "parent_id": "t3_vuwq9p", "score": "1", "subreddit": "calmhands", "subreddit_id": "t5_2ssjn"}, {"author": "ella-eerie", "body": "this is a feeling i totally get! it's hard because even when actively pursuing one beauty standard (which no one should feel obligated to do anyway, but that's a broader discussion) and trying to force it to apply to you often loops back around to making you unattractive by your other cultures' measure!! just the worst!!", "created_utc": "1657294877.0", "edited": "False", "id": "ifcu35b", "is_submitter": "False", "link_id": "t3_vtoe71", "parent_id": "t1_ifbkxbh", "score": "1", "subreddit": "mixedrace", "subreddit_id": "t5_2qnue"}, {"author": "ella-eerie", "body": "that is so amazing, congratulations!! a month is such a big difference!", "created_utc": "1654965797.0", "edited": "False", "id": "ibznpfd", "is_submitter": "False", "link_id": "t3_v9nl80", "parent_id": "t3_v9nl80", "score": "3", "subreddit": "calmhands", "subreddit_id": "t5_2ssjn"}, {"author": "ella-eerie", "body": "honestly, most of them!!! i personally go to fanfiction to fulfill wishes and wants that canon didn’t— if i really enjoy a ship that canon has already tackled in a fulfilling way, why would i need supplementary material? i completely understand those who view it more like “i love this ship and wanna see more of it!!” but that just isn’t my experience. if i love a canon ship, chances are i’ve never actually done more than look at/create fanart of it! LOL", "created_utc": "1654867449.0", "edited": "False", "id": "ibupcx0", "is_submitter": "False", "link_id": "t3_v90p1l", "parent_id": "t3_v90p1l", "score": "4", "subreddit": "FanFiction", "subreddit_id": "t5_2r5kb"}, {"author": "ella-eerie", "body": "major impending “cheese” warning on this one LMAOOO to me, it means “knowing” my biological parents and family in a way i will never get to know them personally. it means tasting food that they might have grown up with the flavors of. it means learning about where our families came from with an open mind. it means listening to famous music in their ancestral languages—wondering if i could hum a melody beside them and find them humming along with me. most of all, it means embracing every single part of me, including the adopted ones! \n\ni spent most of my childhood denying my heritage because i hated my bio parents. being “mixed” means forgiving them—the ones that could not care for me— and being grateful for their blood in my veins, giving me life every day. every time i proudly say that “YES! i am mixed,” i’m giving quiet thanks to them for letting me be here. and just the same, when i say with just as much pride that “YES! i am adopted,” i’m looking to my family with gratitude for choosing me and passing down the culture of the appalachias to me.\n\na lot of things about being mixed are complicated and disorienting; the out-of-place feelings, the uncertainty, all of it. an unfortunate number of people know how that feeling is and how much you subconsciously search for it everywhere you go. but i don’t like to take up anyone else’s space or platform unless invited to, such as questions like this. so being mixed means that i love the microscopic space i was born into holding just for me and my families!\n\ndoes any of this make sense??? LLMSOFSHFJHDKSJFB", "created_utc": "1654795715.0", "edited": "False", "id": "ibr6rz9", "is_submitter": "False", "link_id": "t3_v85h7x", "parent_id": "t3_v85h7x", "score": "2", "subreddit": "mixedrace", "subreddit_id": "t5_2qnue"}, {"author": "ella-eerie", "body": "ahh thank you so much!! i hope they will, i’ve mangled these bad boys a lot and would not be surprised if they grew back in weird HAHSKSFMM", "created_utc": "1654606793.0", "edited": "False", "id": "ibhdvw2", "is_submitter": "True", "link_id": "t3_v461fb", "parent_id": "t1_ibc6day", "score": "2", "subreddit": "calmhands", "subreddit_id": "t5_2ssjn"}, {"author": "ella-eerie", "body": "yeah, if it wasn’t clear, i agree with that completely! it’s for sure not the fault of random people browsing general tags that your fandom might treat you shitty because of what you post, and it’s inconsiderate to demand taking up unexpected space in order to stay “safe” while denying others the ability to straightforwardly do the same thing in their own browsing. i like a lot of the policies and practices on ao3, but the fact this whole issue is just sort of existing in an area they can’t amend based on their own rules is… not GREAT!", "created_utc": "1654606197.0", "edited": "False", "id": "ibhctd6", "is_submitter": "False", "link_id": "t3_v6lg8x", "parent_id": "t1_ibhc6zr", "score": "5", "subreddit": "AO3", "subreddit_id": "t5_3c2cn"}, {"author": "ella-eerie", "body": "to my understanding as a person that was VERY big into the dsmp for like ~1.5 yrs, the reason fics ended up getting tagged this way is often times because they contain problematic or questionable elements—the authors don’t WANT them being found in main tags, or at all. they only want people searching a specific ship tag, for example, to find them, because the fandom is full of children that are a little behind on understanding the “don’t like, don’t read” motto that’s been in fandom for… forever. i don’t think it’s necessarily “okay” that they use the system that way (even if it has protections in place for doing it, it’s more of a “politeness to others” thing) and to me, proper organization matters a hell of a lot more than avoiding some negative reception. but i did want to provide a little bit of context that might be missing from the outside looking in!!", "created_utc": "1654601569.0", "edited": "False", "id": "ibh5ebb", "is_submitter": "False", "link_id": "t3_v6lg8x", "parent_id": "t1_ibg5wrz", "score": "-2", "subreddit": "AO3", "subreddit_id": "t5_3c2cn"}, {"author": "ella-eerie", "body": "i feel pretty much the same about this post!! good points from OP for sure, just not something i can fully get behind. it’s a very complicated topic, but i can’t (personally) make the leap from “i struggle to find acceptance in monoracial spaces” to “i have no race at all.” that just isn’t the solution for me, but it’s good it can be the solution for some people!", "created_utc": "1654600554.0", "edited": "False", "id": "ibh3z27", "is_submitter": "False", "link_id": "t3_v65xv6", "parent_id": "t1_ibgtmzl", "score": "1", "subreddit": "mixedrace", "subreddit_id": "t5_2qnue"}, {"author": "ella-eerie", "body": "great progress, your nails are looking so much better already!! the dry edges are the worst for me too, it really does take such immense restraint to not mess around with them! best of luck with continuing to improve!", "created_utc": "1654469137.0", "edited": "False", "id": "ibaxb49", "is_submitter": "False", "link_id": "t3_v5oce1", "parent_id": "t3_v5oce1", "score": "3", "subreddit": "calmhands", "subreddit_id": "t5_2ssjn"}, {"author": "ella-eerie", "body": "haha thank you!! my effort is validated", "created_utc": "1654342316.0", "edited": "False", "id": "ib4y6wl", "is_submitter": "True", "link_id": "t3_v461fb", "parent_id": "t1_ib35tpd", "score": "2", "subreddit": "calmhands", "subreddit_id": "t5_2ssjn"}, {"author": "ella-eerie", "body": "thank you so much!! i love the color too, the moment i saw it in the store i was like “you will be MINE…” LOL", "created_utc": "1654342273.0", "edited": "False", "id": "ib4y54g", "is_submitter": "True", "link_id": "t3_v461fb", "parent_id": "t1_ib3s97e", "score": "1", "subreddit": "calmhands", "subreddit_id": "t5_2ssjn"}, {"author": "ella-eerie", "body": "was going to say something similar! i don't really hear this rhetoric from white folks on a personal level, either. in my area, at least, there is a very firm boundary they put up-- \"oh, your dad's asian? i see.\" and they will never treat me as \"white\" again. my ancestry instantly changes their perception of me, because to be \"white\" in their eyes means you must be pure, blinding, \"\"\"clean\"\"\" *white*. i have noticed in other people's interactions, however, that there ARE sometimes white folks out there who try to bring mixed friends/family/other loved ones into the \"in-group\" based on how they look. tbh, i suspect that, subconsciously, they've internalized more of how the world works than they think; they want their loved one to *just* be \"white,\" to have the associated privileges, to deny their heritage, etc. because they want them to be safe. the whole discussion is just a clusterfuck of unfortunate things. :(", "created_utc": "1654103142.0", "edited": "False", "id": "iat2d2l", "is_submitter": "False", "link_id": "t3_v2fp5d", "parent_id": "t1_iaspgyi", "score": "10", "subreddit": "mixedrace", "subreddit_id": "t5_2qnue"}, {"author": "ella-eerie", "body": "oooo YES that texture looks like it would be super nice to gnaw on, thank you for the recommendation!!", "created_utc": "1653955653.0", "edited": "False", "id": "ials2zz", "is_submitter": "True", "link_id": "t3_uyvhrr", "parent_id": "t1_ialrsnk", "score": "2", "subreddit": "calmhands", "subreddit_id": "t5_2ssjn"}, {"author": "ella-eerie", "body": "thank you!!! it’s so far, so good on my end. you stopping after that long is amazing, i wish you luck as you press onward with it! i’ve done it for as long as i can remember and it’s hard to find something that really replaces the soothing feelings of chomping away when the urge comes. but learning to deal with stress without it will be good!", "created_utc": "1653955383.0", "edited": "False", "id": "ialrkcm", "is_submitter": "True", "link_id": "t3_uyvhrr", "parent_id": "t1_ialmdq2", "score": "1", "subreddit": "calmhands", "subreddit_id": "t5_2ssjn"}, {"author": "ella-eerie", "body": "thank you so much for the kind words!!! i’m really appreciative of this community and its support, it’s inspiring to see how far so many people have gotten! two months is an amazing streak, imo, and you should be proud of yourself for holding out that long regardless of what came after! you did it once, and you’ll get there & beyond again. good luck!!", "created_utc": "1653736905.0", "edited": "False", "id": "iaav9zl", "is_submitter": "True", "link_id": "t3_uyvhrr", "parent_id": "t1_ia7qked", "score": "1", "subreddit": "calmhands", "subreddit_id": "t5_2ssjn"}, {"author": "ella-eerie", "body": "i managed to stop biting completely for 3 months in 2019, which is still my longest record. but then i broke over life stress and ever since i haven’t made that sort of progress again. today marks the first day of reaching for my new personal “best!” i’ll try to update weekly, so hopefully there’ll be tangible, visible progress for the sub every time and not just spam pics of my fingers LMAOO", "created_utc": "1653648630.0", "edited": "1653737099.0", "id": "ia6flp0", "is_submitter": "True", "link_id": "t3_uyvhrr", "parent_id": "t3_uyvhrr", "score": "2", "subreddit": "calmhands", "subreddit_id": "t5_2ssjn"}, {"author": "ella-eerie", "body": "definitely expose them to elements of culture in ways that encourage them to ask questions and experience it themselves!! this is something i wish my adoptive parents had the foresight to do. kids have sponge-brains; they always want to know more about their world, and being the tiny humans they are, most feel a sense of accomplishment if they perceive they “did it themselves” rather than being told what’s what. if you make their world a place that is naturally full of both english and spanish speaking, that plays music and stories that remind you of your extended family’s origins, and that offers them the chance to taste, see, smell, and touch cultural foods, clothing, etc. you will immerse them in a way that doesn’t feel like a “history lesson!” (though personally, i LOVED history lessons, but i was an odd kid LMAO you might end up with one, too!) it makes it part of their life, not a distant idea that only exists when they see your parents and in-laws. in the end, it’s all up to you, but you’re off to a great start by showing you care about their experience!", "created_utc": "1653606089.0", "edited": "False", "id": "ia4junt", "is_submitter": "False", "link_id": "t3_uyfhum", "parent_id": "t3_uyfhum", "score": "4", "subreddit": "mixedrace", "subreddit_id": "t5_2qnue"}, {"author": "ella-eerie", "body": "thank you!!! i will be putting these tips and thoughts into practice & hoping for the best!", "created_utc": "1653355349.0", "edited": "False", "id": "i9r6fjo", "is_submitter": "False", "link_id": "t3_uvzpm1", "parent_id": "t1_i9q8f9n", "score": "1", "subreddit": "Wavyhair", "subreddit_id": "t5_33ywz"}, {"author": "ella-eerie", "body": "it's been about... four months of putting VERY active effort into making it work, whereabouts? (before that, maybe two or three of sorta-kinda doing it but not giving it my best shot LOL) admittedly there have been a couple product changes throughout for various reasons, usually something being too heavy and requiring me to clarify wash more often than i'd prefer to! i think i follow what you mean about product distribution, and though i *think* i've really been careful about keeping it even, i'll for sure give it a bit of extra attention to be certain!", "created_utc": "1653336341.0", "edited": "False", "id": "i9q22xz", "is_submitter": "False", "link_id": "t3_uvzpm1", "parent_id": "t1_i9peqlp", "score": "2", "subreddit": "Wavyhair", "subreddit_id": "t5_33ywz"}, {"author": "ella-eerie", "body": "hi, here to deliver some extra info!! as in one of the captions, i currently use not your mother’s smooth moves shampoo and conditioner. my hair is low-porosity and quite fine—anything i put in it has a general tendency to sit on the surface. i try not to use heat on it, but i do sometimes blow dry my roots to keep it less greasy for longer! as for texture, i’m honestly not sure and would love some input from y’all about that as well so i could better describe it in the future. i have problems with maintaining volume and resisting my urge to overwash. i am autistic so if my hair is giving me a bad sensory experience by being oily or being visually inconsistent, i get unreasonably stressed out. \n\nthe latter is my issue right now and what i hope y’all might have suggestions for!! i really just want it to be at least MOSTLY one texture without me going back to my old ways of brushing the heck out of it and wetting it down until it’s “straight” LOL,,, so if the best i can get is it being just barely wavy but that way EVERYWHERE? i can live with that!", "created_utc": "1653311191.0", "edited": "False", "id": "i9ogfi9", "is_submitter": "False", "link_id": "t3_uvzpm1", "parent_id": "t1_i9og16q", "score": "3", "subreddit": "Wavyhair", "subreddit_id": "t5_33ywz"}, {"author": "ella-eerie", "body": "short answer: no, or at least i really try to not take it that way (most of the time)!\n\nlong answer: it sort of depends on how and why they’re bringing it up. if it’s more of a passing comment (“you know, i thought you were ONLY white when we first met”) from someone i know, it’s not a big deal! lots of people think that, and it makes sense—that’s part of my ethnicity and the one i most resemble. but when someone phrases it like an accusation, it gets under my skin pretty bad. (“well, you don’t look any part asian to me” / “i think you’re white” ) that puts the blame on me for not looking how they expect and it isn’t an observation, it’s a challenge. they want to see me defend myself, and it hurts because i never wanted to be warring with them in the first place.", "created_utc": "1652737398.0", "edited": "1652737676.0", "id": "i8vfb0t", "is_submitter": "False", "link_id": "t3_uqy7yo", "parent_id": "t3_uqy7yo", "score": "2", "subreddit": "mixedrace", "subreddit_id": "t5_2qnue"}, {"author": "ella-eerie", "body": "not 100% the same situation, but my parents left ME, not just culture! it’s so… disheartening to be an outsider like you’ve described. i don’t resent anyone for “excluding” me at all, it’s not their fault that’s what happened or that they have a type of natural-born connection that i don’t! i just wish i’d had that opportunity, too. :(", "created_utc": "1652451409.0", "edited": "False", "id": "i8gd2z8", "is_submitter": "False", "link_id": "t3_uoo3zk", "parent_id": "t3_uoo3zk", "score": "11", "subreddit": "mixedrace", "subreddit_id": "t5_2qnue"}, {"author": "ella-eerie", "body": "hi!! i’m an adopted person (no-contact & private), so i think that constitutes having no reference point pretty well— hand over those bonus points, bucko! jokes aside, being mixed is often not an easy road to walk, i will admit!!\n\npersonally, i found it helped me a lot to stop “dividing” myself in my language. if it’s relevant i’ll still talk percentages, but otherwise, i’m not “half-asian, quarter-white, etc.” i’m white, i’m asian, AND i’m mixed! not because i am less of either, but because i am BOTH and BEING both ultimately creates the very unique experience we broadly call being “mixed.” warning for impending cheesiness, but there’s a reason folks come here to feel a sense of unity despite the community being such a racially diverse one: most of us don’t have the same exact backgrounds, yet we are ALSO all mixed! it is often kinder and healthier to think of yourself (general “you,” not anyone specific) as being “all” of your heritages than it is to consider yourself “neither” or “none.” i am not a set of individual categories trying to find completeness and identity in a slice of a pie chart. i am a whole, complete, mixed-race human being!! 💖", "created_utc": "1650996621.0", "edited": "False", "id": "i6aonel", "is_submitter": "False", "link_id": "t3_uc13c0", "parent_id": "t3_uc13c0", "score": "1", "subreddit": "mixedrace", "subreddit_id": "t5_2qnue"}, {"author": "ella-eerie", "body": "i’d totally join!!", "created_utc": "1650989650.0", "edited": "False", "id": "i6a6kq0", "is_submitter": "False", "link_id": "t3_uc7qwz", "parent_id": "t3_uc7qwz", "score": "2", "subreddit": "mixedrace", "subreddit_id": "t5_2qnue"}, {"author": "ella-eerie", "body": "it’s never wrong or inappropriate to learn more about your ancestry and family history!! if you have the resources to investigate, there’s no reason you should feel bad for trying to broaden your understanding.", "created_utc": "1650810184.0", "edited": "False", "id": "i604r7t", "is_submitter": "False", "link_id": "t3_uauebl", "parent_id": "t3_uauebl", "score": "7", "subreddit": "mixedrace", "subreddit_id": "t5_2qnue"}, {"author": "ella-eerie", "body": "ahh, i wish i could project this comment into the minds of every person online that worships the “finality” of a dna test being able to say exactly what you “are” or “aren’t” !!! i’m not native or indigenous, but some of the people i love most in this world are, and the type of treatment that mixed natives in particular get is some of the most disgusting shit in the world when it comes to that mentality. dna tests are best left to be used only as a family tree building tool for those that want to do so, and even then it’s gonna be hit or miss.", "created_utc": "1650809411.0", "edited": "False", "id": "i6032bl", "is_submitter": "False", "link_id": "t3_ua6blr", "parent_id": "t1_i5vz8be", "score": "4", "subreddit": "mixedrace", "subreddit_id": "t5_2qnue"}, {"author": "ella-eerie", "body": "i agree with everyone on more intersectional representation— more people of color, queer folks, and even other neurodivergence alongside autism!! something i’d like to see, personally, is an autistic person that’s “liked.” someone that’s outgoing, friendly, and gets along with other people even though it can be much more difficult for them. (and isn’t just “naive” and wandering up to strangers in inappropriate settings, either.) it’s not my experience, no, but it’s someone’s! and i’d just love to see an autistic character that other people in the narrative are genuinely happy to be around as a friend, family, or even a romantic interest, because they’re a whole, complex human being. it would be a really interesting departure from the usual to see someone that isn’t an outcast or only tolerable to the “special” few that “know how to handle them!”", "created_utc": "1650114742.0", "edited": "False", "id": "i4yccp4", "is_submitter": "False", "link_id": "t3_u4k2c3", "parent_id": "t3_u4k2c3", "score": "1", "subreddit": "AutismInWomen", "subreddit_id": "t5_3yx96k"}, {"author": "ella-eerie", "body": "we really SHOULD have a humor & memes tag, actually. it might be the mods attempting to avoid the fate of a lot of subs, where easy-viewing humorous content gets all the upvotes and nothing serious or genuine gets a similar level of attention??? but i think it’s a part of ANY community that deserves its space regardless— c’mon, i’m sure we’re all very funny! LMAO", "created_utc": "1650113881.0", "edited": "False", "id": "i4yascg", "is_submitter": "False", "link_id": "t3_u4cgar", "parent_id": "t1_i4w790w", "score": "4", "subreddit": "mixedrace", "subreddit_id": "t5_2qnue"}, {"author": "ella-eerie", "body": "GOD. this is so fucking real i hate it!! how did they expect it to work out, seriously?\n\ndid anyone else’s parents forbid dating “until marriage is on the table” (so, like… minimum 18+) while being high school sweethearts???? that always infuriated me. they never had an answer either for when i’d be like “if god’s plan was for you guys to be together at that age, what if it’s part of his plan for me and i’m not allowed to get to know the guy???” (i had no interest in boys, it was more just to test the boundaries of their rules that i asked) they basically just said “it won’t be” and left it. how dumb.", "created_utc": "1649945995.0", "edited": "False", "id": "i4pby0t", "is_submitter": "False", "link_id": "t3_u2svob", "parent_id": "t3_u2svob", "score": "5", "subreddit": "HomeschoolRecovery", "subreddit_id": "t5_3cxr2"}, {"author": "ella-eerie", "body": "radical face is a big artist for me when it comes to processing the homeschool feelings; i love “haunted” and “holy branches” a lot!", "created_utc": "1649728339.0", "edited": "False", "id": "i4dgklr", "is_submitter": "False", "link_id": "t3_u16vi5", "parent_id": "t3_u16vi5", "score": "2", "subreddit": "HomeschoolRecovery", "subreddit_id": "t5_3cxr2"}, {"author": "ella-eerie", "body": "dungeons & dragons, harry potter, halloween, digimon, and ESPECIALLY monster high—the dolls and the show. a real shame because i’d have liked them. they’ve actually become more open-minded towards media with time though!", "created_utc": "1649727676.0", "edited": "False", "id": "i4df1gm", "is_submitter": "False", "link_id": "t3_u1bv4b", "parent_id": "t3_u1bv4b", "score": "1", "subreddit": "HomeschoolRecovery", "subreddit_id": "t5_3cxr2"}, {"author": "ella-eerie", "body": "that’s absolutely dreadful, i’m sorry that stuff happens to you and members of your family :( do they think you can just… GET a tribal ID??? like you don’t have to do any paperwork or anything you can just get one like it’s a speedway rewards card???? HUH??", "created_utc": "1649539505.0", "edited": "False", "id": "i431ln0", "is_submitter": "False", "link_id": "t3_tzzbxg", "parent_id": "t1_i42x398", "score": "4", "subreddit": "mixedrace", "subreddit_id": "t5_2qnue"}, {"author": "ella-eerie", "body": "OH MY GOD noooo yikes i can totally imagine it going down EXACTLY like that, that’s HORRIBLE!!! people really do make THEIR failed high school geography course your problem, like… sorry you know fuck-all about the second-largest continent in the world, i guess????", "created_utc": "1649539349.0", "edited": "False", "id": "i4318uw", "is_submitter": "False", "link_id": "t3_tzzbxg", "parent_id": "t1_i4301ge", "score": "6", "subreddit": "mixedrace", "subreddit_id": "t5_2qnue"}, {"author": "ella-eerie", "body": "SO much 😭 it’s really hard, i totally sympathize with how much of a struggle it is to sincerely own ALL of what you are without a level of fear attached. this is sort of a “bright side of a bad thing” perspective and i’ve no idea if it’s at all like this for you, so please do share your thoughts and feelings on it here if you feel comfortable!!! but i’ve found that being mixed with a group that most people are less knowledgeable about is kind of nice, in a way? if i were half-japanese, for example, i would never EVER mention it for fear of getting the “okay, white girl, you’re just a weeb we get it” treatment. but people just don’t really know shit about mongolia beyond genghis khan LMAO it makes the experience all the more isolating to never have community or meet other mongolian folks in real life, but at the same time so few people know enough about it to be that invested in defending it from the “”delusional colonizer””, if that makes sense???", "created_utc": "1649537342.0", "edited": "False", "id": "i42wn88", "is_submitter": "False", "link_id": "t3_tzzbxg", "parent_id": "t3_tzzbxg", "score": "11", "subreddit": "mixedrace", "subreddit_id": "t5_2qnue"}, {"author": "ella-eerie", "body": "social anxiety is a fuckin’ bitch when it comes to this sort of thing, i get it. i think the most important thing to keep in mind is that they’re forcing you into a position of “defending” yourself, but you don’t have to give in to that. you’re not lying, you know your mom and dad, you know you’re mixed. them saying they don’t believe you or think you’re something else has changed nothing about your DNA, upbringing, or life. personally, i default to responding to “i don’t believe you” with “you don’t have to/did i say you have to?” and a blank stare. it makes them deeply uncomfortable that i don’t beg for their approval. usually they just awkwardly shuffle away or change the subject, sometimes they even feel bad enough to apologize for acting like they know me better than me! you go through every day of your life as a mixed person, regardless of who does or doesn’t accept you. an unfortunate reality for a lot of us is that these interactions are just… a part of that daily life experience, but it’s other people that are wrong for making that the experience we get, not our fault for just being here!", "created_utc": "1649513997.0", "edited": "False", "id": "i41ccji", "is_submitter": "False", "link_id": "t3_twjy5l", "parent_id": "t3_twjy5l", "score": "3", "subreddit": "mixedrace", "subreddit_id": "t5_2qnue"}, {"author": "ella-eerie", "body": "i love this sub too— we’re happy to have you!! the mixed experience is so unique to itself and everyone deserves a space to share theirs!", "created_utc": "1649512613.0", "edited": "False", "id": "i419b2g", "is_submitter": "False", "link_id": "t3_tyklte", "parent_id": "t3_tyklte", "score": "1", "subreddit": "mixedrace", "subreddit_id": "t5_2qnue"}, {"author": "ella-eerie", "body": "to be honest, i personally feel like in situations like a cafeteria/dining hall or a person’s own home, it isn’t appropriation to just make a cultural food “incorrectly.” i would never argue that food appropriation doesn’t exist on a market level, because it does— pseudo-spiritual people outside of cultures love to act like they’ve unlocked some magical healing secret with something they did not invent, for example. but using the ingredients and skills at your disposal to make a food that’s not 100% “accurate” is fine. if i can’t get mutton for tsuvian in the middle of the southern USA, i’m not using mutton, and i’m still going to say i’m eating tsuvian! substitutions, or using what you have and not being wasteful, is at the heart of many of the world’s cultures— everyone should be respectful of others’ food, but i don’t see it as a disrespect for a dining hall that never claimed to be an “authentic vietnamese restaurant” to make what they can (even if it’s not perfect). that’s just me, though!", "created_utc": "1648993499.0", "edited": "False", "id": "i380n2p", "is_submitter": "False", "link_id": "t3_tuxxmm", "parent_id": "t3_tuxxmm", "score": "2", "subreddit": "mixedrace", "subreddit_id": "t5_2qnue"}, {"author": "ella-eerie", "body": "for a very long time i was against it— not in the way of harassing or bothering anyone at all, just personally feeling super grossed out by it. but after getting into dsmp, which toes the line, i reflected on it a lot more and now just treat it like any other form of fiction. i still won’t read anything that’s close to “real life,” because it just isn’t for me, but it’s for SOMEBODY and they have a right to not only create it but also post it in an appropriate, secure space designated for that content like ao3 is! if you enjoy it, read it and/or write it to your heart’s content!! if you find it isn’t for you when you look into it, then that’s alright too!", "created_utc": "1648821941.0", "edited": "1648822173.0", "id": "i2zgkuy", "is_submitter": "False", "link_id": "t3_tt53w9", "parent_id": "t3_tt53w9", "score": "1", "subreddit": "AO3", "subreddit_id": "t5_3c2cn"}, {"author": "ella-eerie", "body": "totally get that!! i also developed fast, young, and a LOT. :/ i hope we both can get some good info here, good luck on your own health journey!!!", "created_utc": "1648746749.0", "edited": "False", "id": "i2vd5hx", "is_submitter": "False", "link_id": "t3_tt49lk", "parent_id": "t1_i2vcj01", "score": "1", "subreddit": "ehlersdanlos", "subreddit_id": "t5_2spw0"}, {"author": "ella-eerie", "body": ">!DEFINITELY, though a couple have done it on here which is a little crazy to me! i was mainly just curious to see how i might be interpreted since it’s not like you can just ask random strangers in public where they’d pass you HAHA!<", "created_utc": "1648681943.0", "edited": "False", "id": "i2s1qal", "is_submitter": "False", "link_id": "t3_tqti9v", "parent_id": "t1_i2s14il", "score": "1", "subreddit": "phenotypes", "subreddit_id": "t5_3rlxu8"}, {"author": "ella-eerie", "body": ">!fair play and thank you for participating!!!! you weren’t terribly far off, to your credit!! if you want to know the answer:!< >!i’m half-mongolian, one-quarter russian and a blended remaining quarter ashkenazi & mizrahi israeli. there’s a touch of roma but i don’t count it since it’s so small!<", "created_utc": "1648681478.0", "edited": "False", "id": "i2s0pyq", "is_submitter": "False", "link_id": "t3_tqti9v", "parent_id": "t1_i2s029h", "score": "1", "subreddit": "phenotypes", "subreddit_id": "t5_3rlxu8"}, {"author": "ella-eerie", "body": "OH MY GOD i didn’t realize i said northwest, >!i meant northeast of Afghanistan i’m sorry!!< shouldn’t respond to comments while my head’s in the clouds LOL >!it isn’t central asia though, for a little more direction!!<", "created_utc": "1648681090.0", "edited": "False", "id": "i2rzv1g", "is_submitter": "False", "link_id": "t3_tqti9v", "parent_id": "t1_i2rotwn", "score": "1", "subreddit": "phenotypes", "subreddit_id": "t5_3rlxu8"}, {"author": "ella-eerie", "body": ">!nope, but i’m half of something to the northwest of it!<", "created_utc": "1648672267.0", "edited": "False", "id": "i2rev42", "is_submitter": "False", "link_id": "t3_tqti9v", "parent_id": "t1_i2qe0cc", "score": "1", "subreddit": "phenotypes", "subreddit_id": "t5_3rlxu8"}, {"author": "ella-eerie", "body": "VERY NEAT!! thank you for guessing and telling me why, as i’ve said elsewhere in the thread it has been a lot of fun!", "created_utc": "1648596331.0", "edited": "False", "id": "i2nbvum", "is_submitter": "False", "link_id": "t3_tqti9v", "parent_id": "t1_i2n6o0v", "score": "3", "subreddit": "phenotypes", "subreddit_id": "t5_3rlxu8"}, {"author": "ella-eerie", "body": ">!OHHH, yes you are almost totally right wow!!! 🎉 i am mongolian and russian, yes! i have a couple other things in my last quarter, though not by a lot for any of them.!< if you don’t mind me asking, what about my face informed that guess? >!It’s just really rare for someone to figure it out and i’m so curious about how you did!!<", "created_utc": "1648595480.0", "edited": "False", "id": "i2n63m4", "is_submitter": "False", "link_id": "t3_tqti9v", "parent_id": "t1_i2msrce", "score": "3", "subreddit": "phenotypes", "subreddit_id": "t5_3rlxu8"}, {"author": "ella-eerie", "body": "that’s unbelievable, i’m so sorry someone was taking to you that way!!! is your job situation one where you would feel safe and confident to inform HR or management of this behavior? you shouldn’t have to put up with that somewhere you have to spend so much of your time. ( or ideally at all, but, y’know, LIFE :/ )", "created_utc": "1648582059.0", "edited": "False", "id": "i2lrdh3", "is_submitter": "False", "link_id": "t3_trehvw", "parent_id": "t3_trehvw", "score": "42", "subreddit": "mixedrace", "subreddit_id": "t5_2qnue"}, {"author": "ella-eerie", "body": ">!nope, but i’m half-something very close by!!< for a hint, >!it’s not in central asia!!<", "created_utc": "1648581258.0", "edited": "False", "id": "i2lpas7", "is_submitter": "False", "link_id": "t3_tqti9v", "parent_id": "t1_i2lb29k", "score": "1", "subreddit": "phenotypes", "subreddit_id": "t5_3rlxu8"}, {"author": "ella-eerie", "body": ">!WOOO yeah!!! 🎉 it is russian! not lebanon, but SUUUUPER duper close!!<", "created_utc": "1648580859.0", "edited": "False", "id": "i2loa2o", "is_submitter": "False", "link_id": "t3_tqti9v", "parent_id": "t1_i2lbhes", "score": "1", "subreddit": "phenotypes", "subreddit_id": "t5_3rlxu8"}, {"author": "ella-eerie", "body": ">!no, but you’re in the vicinity— i AM half asian and a quarter european, but both of these countries are proximally north-east of poland and vietnam!! (edit: not me confusing your comment with another like you even said vietnam i am so dumb LOL)!<", "created_utc": "1648572573.0", "edited": "1648581584.0", "id": "i2l2b6j", "is_submitter": "False", "link_id": "t3_tqti9v", "parent_id": "t1_i2kxhzm", "score": "2", "subreddit": "phenotypes", "subreddit_id": "t5_3rlxu8"}, {"author": "ella-eerie", "body": ">!not quite, but i AM half asian, and a quarter european— somewhere towards the east!!<", "created_utc": "1648571876.0", "edited": "False", "id": "i2l0g6v", "is_submitter": "False", "link_id": "t3_tqti9v", "parent_id": "t1_i2kydux", "score": "1", "subreddit": "phenotypes", "subreddit_id": "t5_3rlxu8"}, {"author": "ella-eerie", "body": ">!nope! but i’m getting the sneaking suspicion from this post that i must look quite Turkish HAHAH thanks for guessing, i have loved seeing the responses here!!!<", "created_utc": "1648570705.0", "edited": "False", "id": "i2kxcjf", "is_submitter": "False", "link_id": "t3_tqti9v", "parent_id": "t1_i2kvt5u", "score": "1", "subreddit": "phenotypes", "subreddit_id": "t5_3rlxu8"}, {"author": "ella-eerie", "body": ">!OH! my wording was sort of bad on that part, i’m sorry— i meant to convey that it’s not a full half european, rather a smaller portion. there’s about a quarter of very nearby european! and the remainder is middle eastern, yes!!<", "created_utc": "1648570525.0", "edited": "False", "id": "i2kwvhq", "is_submitter": "False", "link_id": "t3_tqti9v", "parent_id": "t1_i2ktg3h", "score": "2", "subreddit": "phenotypes", "subreddit_id": "t5_3rlxu8"}, {"author": "ella-eerie", "body": ">!nope! no relation to any of those, though lots of people have said turkish, which is pretty cool!!<", "created_utc": "1648564200.0", "edited": "False", "id": "i2kgsrn", "is_submitter": "False", "link_id": "t3_tqti9v", "parent_id": "t1_i2k83y9", "score": "1", "subreddit": "phenotypes", "subreddit_id": "t5_3rlxu8"}, {"author": "ella-eerie", "body": ">!no turkish, but a little bit ashkenazi! it’s blended into part of my bio mom’s heritage— i’d believe it shows up most, though, especially since it was enough to give me the famous ashkenazi health problems LMAOOOO anyways thank you for guessing, i’ve had a lot of fun reading these!!<", "created_utc": "1648557007.0", "edited": "False", "id": "i2k161b", "is_submitter": "False", "link_id": "t3_tqti9v", "parent_id": "t1_i2jzq5u", "score": "2", "subreddit": "phenotypes", "subreddit_id": "t5_3rlxu8"}, {"author": "ella-eerie", "body": ">!not quite, but neighbors to the right region! thanks for guessing n playing along, it’s been really fun!!<", "created_utc": "1648556715.0", "edited": "False", "id": "i2k0mx2", "is_submitter": "False", "link_id": "t3_tqti9v", "parent_id": "t1_i2jtjyk", "score": "1", "subreddit": "phenotypes", "subreddit_id": "t5_3rlxu8"}, {"author": "ella-eerie", "body": ">!not quite half euro, but YES half east asian! it’s mongolian; i’m surprised someone got straight there, i know it doesn’t show up much. i had to google somi and she is SO pretty, i’m flattered by the comparison thank you!!!!<", "created_utc": "1648556481.0", "edited": "False", "id": "i2k07ii", "is_submitter": "False", "link_id": "t3_tqti9v", "parent_id": "t1_i2jhisg", "score": "2", "subreddit": "phenotypes", "subreddit_id": "t5_3rlxu8"}, {"author": "ella-eerie", "body": ">!not NW euro, but quarter middle eastern yes! and REALLY really close; the biggest piece is direct neighbors to central asia!!<", "created_utc": "1648556224.0", "edited": "1648571139.0", "id": "i2jzqoa", "is_submitter": "False", "link_id": "t3_tqti9v", "parent_id": "t1_i2je9jp", "score": "1", "subreddit": "phenotypes", "subreddit_id": "t5_3rlxu8"}, {"author": "ella-eerie", "body": ">!no turkish as far as i know, but geographically moving in the right direction. and yes to levantine— a quarter israeli (not a full quarter since it’s got a bit extra mixed in from my mom, but it’s the dominant part of the quarter at least LOL)!!<", "created_utc": "1648555705.0", "edited": "1648557099.0", "id": "i2jytx0", "is_submitter": "False", "link_id": "t3_tqti9v", "parent_id": "t1_i2jety6", "score": "2", "subreddit": "phenotypes", "subreddit_id": "t5_3rlxu8"}, {"author": "ella-eerie", "body": ">!a different ratio, but that’s the bulk of it yes!!!<", "created_utc": "1648555329.0", "edited": "False", "id": "i2jy6n0", "is_submitter": "False", "link_id": "t3_tqti9v", "parent_id": "t1_i2jm3us", "score": "1", "subreddit": "phenotypes", "subreddit_id": "t5_3rlxu8"}, {"author": "ella-eerie", "body": ">!haha no, but i fully see why you’d think that!!<", "created_utc": "1648539408.0", "edited": "False", "id": "i2je7fg", "is_submitter": "False", "link_id": "t3_tqti9v", "parent_id": "t1_i2je3kd", "score": "1", "subreddit": "phenotypes", "subreddit_id": "t5_3rlxu8"}, {"author": "ella-eerie", "body": "oh, sorry! i realize now that was a bit unclear. >!i mean different races!!<", "created_utc": "1648539207.0", "edited": "False", "id": "i2jdz2d", "is_submitter": "False", "link_id": "t3_tqti9v", "parent_id": "t1_i2jdfuk", "score": "1", "subreddit": "phenotypes", "subreddit_id": "t5_3rlxu8"}, {"author": "ella-eerie", "body": "for posterity, i do have mixed ancestry! but you can just guess what shows, i’m not stressin’.", "created_utc": "1648535478.0", "edited": "False", "id": "i2j9gtj", "is_submitter": "False", "link_id": "t3_tqti9v", "parent_id": "t3_tqti9v", "score": "1", "subreddit": "phenotypes", "subreddit_id": "t5_3rlxu8"}, {"author": "ella-eerie", "body": "i totally get that and honestly feel like the same applies to me— none of the learning types ever seem to work for me either. writing it by hand sounds challenging but rewarding!!!! a big problem doing that for me is that ehlers-danlos makes my hands badly suited to long-term effort with a pen, however i think i’m going to try it out at least on SOME sections of the textbook if it works well for an “unusual” learning style! thank you!!", "created_utc": "1648394368.0", "edited": "False", "id": "i2blkug", "is_submitter": "True", "link_id": "t3_tpirbj", "parent_id": "t1_i2bjbfl", "score": "3", "subreddit": "AutismInWomen", "subreddit_id": "t5_3yx96k"}, {"author": "ella-eerie", "body": "your statement about “you can appreciate and be a guest in your own culture, but not claim it” is a sentiment i’ve heard before, even communicated to others, but not those words in that order— and somehow, it really just resonated with me to see it so plainly. like it just CLICKED, you feel me? i’ve only ever been accepting myself “like a guest” all this time, not as a person that belongs. thank you, genuinely, because i don’t know if i’d ever have recognized alone that there’s a distinction inside and it MATTERS. many well wishes for you!!", "created_utc": "1648389755.0", "edited": "False", "id": "i2bbj9u", "is_submitter": "False", "link_id": "t3_tom8uc", "parent_id": "t1_i27bqxq", "score": "2", "subreddit": "mixedrace", "subreddit_id": "t5_2qnue"}, {"author": "ella-eerie", "body": "yes, you know what i mean! there’s just so much stuff that gets internalized without you even knowing? i’m so happy you’re recognizing and working with your own intelligence, though— it’s so often that people do themselves the disservice of not recognizing their own worth. the task initiation and lack of instant gratification is such a big problem for me, too; it’s like no matter how much i rationally understand “study now=gratification later,” i can’t get my mind to operate like it’s true. it’s tough but it’s reassuring that there are others out there that are struggling, while still doing great stuff like writing books. good luck to all your future endeavors!!!", "created_utc": "1648387708.0", "edited": "False", "id": "i2b7fqq", "is_submitter": "True", "link_id": "t3_tpirbj", "parent_id": "t1_i2b6jp4", "score": "6", "subreddit": "AutismInWomen", "subreddit_id": "t5_3yx96k"}, {"author": "ella-eerie", "body": "okay yes admittedly it doesn’t sound FUN, but it sounds very effective and i honestly really admire that you’re able to do it that!! i probably need to try it out, it’s just the focusing problem that makes it so hard to even make these kinds of preparations, y’know??? but sometimes if you wanna succeed you gotta struggle for it, so thank you!!!!", "created_utc": "1648385819.0", "edited": "False", "id": "i2b42sk", "is_submitter": "True", "link_id": "t3_tpirbj", "parent_id": "t1_i2b1t9x", "score": "9", "subreddit": "AutismInWomen", "subreddit_id": "t5_3yx96k"}, {"author": "ella-eerie", "body": "this seems really helpful and i will be trying it, thank you!!! i can totally see how that type of visualization would help make it stick better!", "created_utc": "1648385622.0", "edited": "False", "id": "i2b3qpp", "is_submitter": "True", "link_id": "t3_tpirbj", "parent_id": "t1_i2b1lcm", "score": "29", "subreddit": "AutismInWomen", "subreddit_id": "t5_3yx96k"}, {"author": "ella-eerie", "body": "ohhh thank you!!! this concept is actually super helpful because i’ll be doing chemistry next semester and have been wondering/dreading how i’m going to get through it.", "created_utc": "1648385519.0", "edited": "False", "id": "i2b3kgz", "is_submitter": "True", "link_id": "t3_tpirbj", "parent_id": "t1_i2b1syi", "score": "7", "subreddit": "AutismInWomen", "subreddit_id": "t5_3yx96k"}, {"author": "ella-eerie", "body": "yeah, i get that feeling completely. :( it’s so uncomfortable and even a bit crushing to be treated like an outsider even when you do your best to not overstep any boundaries with intersectionality. at the end of the day, though, these ARE your cultures!! they are a part of you, your family, your heritage and history, and you deserve to be involved in them as much as anyone else. acknowledging privilege is important, yes, but no privilege you have means that you deserve to be kept away from even just talking conversationally about something that is a part of you. so as much as you feel safe and comfortable to, keep making yourself heard! talk about your personal experiences, your favorite memories, whatever you feel defines your connections to your cultures! i’m still struggling through this myself now; it’s hard to be open KNOWING people will have negative stuff to say. but in the end, if anyone is telling you that you have no place to speak on ANYTHING, EVER, because you’re too much, not enough, or anything else: THEY are the problem, not you!! nothing will make people like that more miserable than seeing your outward indifference to their words and absolute persistence in owning every part of you.", "created_utc": "1648086525.0", "edited": "False", "id": "i1vmdca", "is_submitter": "False", "link_id": "t3_tl4a71", "parent_id": "t3_tl4a71", "score": "8", "subreddit": "mixedrace", "subreddit_id": "t5_2qnue"}, {"author": "ella-eerie", "body": "a tiny bit late but i SEE YOU MADE IT!! congrats, you should be so crazy proud of yourself!!", "created_utc": "1648085129.0", "edited": "False", "id": "i1vj94w", "is_submitter": "False", "link_id": "t3_tk392y", "parent_id": "t1_i1pontd", "score": "1", "subreddit": "HomeschoolRecovery", "subreddit_id": "t5_3cxr2"}, {"author": "ella-eerie", "body": "uncomfortable? definitely. challenging to do “right” and quite an unnatural behavior to me? 100%. but IMPOSSIBLE or TORTURE??? no way! it’s a bit weird for him to act like autistic people are incapable of doing things we don’t enjoy, in my opinion.", "created_utc": "1647995934.0", "edited": "False", "id": "i1qhhau", "is_submitter": "False", "link_id": "t3_tk6fdt", "parent_id": "t3_tk6fdt", "score": "3", "subreddit": "AutismInWomen", "subreddit_id": "t5_3yx96k"}, {"author": "ella-eerie", "body": "you’ve already come so far to be a self-sufficient adult— you can overcome anything, including a test or whatever grade comes after it! good luck!!!", "created_utc": "1647981595.0", "edited": "False", "id": "i1pj70x", "is_submitter": "False", "link_id": "t3_tk392y", "parent_id": "t3_tk392y", "score": "3", "subreddit": "HomeschoolRecovery", "subreddit_id": "t5_3cxr2"}, {"author": "ella-eerie", "body": "it almost looks photoshopped into the picture somehow, very ominous", "created_utc": "1647979618.0", "edited": "False", "id": "i1pe5d3", "is_submitter": "False", "link_id": "t3_stjd4y", "parent_id": "t3_stjd4y", "score": "3", "subreddit": "shittyfood", "subreddit_id": "t5_2u096"}, {"author": "ella-eerie", "body": "i second this— it almost makes it sound terminal!! LOL", "created_utc": "1647978321.0", "edited": "False", "id": "i1paree", "is_submitter": "False", "link_id": "t3_tkaqfj", "parent_id": "t1_i1p8kmw", "score": "16", "subreddit": "AutismInWomen", "subreddit_id": "t5_3yx96k"}, {"author": "ella-eerie", "body": "for myself, i prefer “autistic person.” i understand words and phrasing can be VERY important— but i don’t feel that there is any “blow” that needs to be softened with person-first language. though there are moments it just comes naturally for phrasing, such as in your post: “I’d like to hear opinions from others with autism!” \nall in all, if someone specific has a personal preference for the language i use for/about them, i’ll absolutely do that!! otherwise, i’ll just stick with autistic.", "created_utc": "1647978246.0", "edited": "False", "id": "i1pakem", "is_submitter": "False", "link_id": "t3_tkaqfj", "parent_id": "t3_tkaqfj", "score": "12", "subreddit": "AutismInWomen", "subreddit_id": "t5_3yx96k"}, {"author": "ella-eerie", "body": "hearing it from someone else’s perspective makes me realize how sad that really is, you’re right. :( i think it’s a very deeply ingrained defense mechanism, but in the end it’s probably not better to wound yourself with words first in hopes no one else gets the chance. 😔", "created_utc": "1647882586.0", "edited": "False", "id": "i1jw4nv", "is_submitter": "True", "link_id": "t3_tiset7", "parent_id": "t1_i1grbal", "score": "2", "subreddit": "mixedrace", "subreddit_id": "t5_2qnue"}, {"author": "ella-eerie", "body": "i’m glad you’re in a much better place with your friend group now!!! i’m sure it’s a huge weight off your shoulders to be surrounded by people that treat you better. without going off into my edgy anime backstory (tm) for context, it’s just very hard for me to recognize what’s a normal level of friendly ribbing versus my friends choosing to be mean, most of all when it’s something like this. just the sorta stuff you gotta learn as you go i guess!! :)", "created_utc": "1647882271.0", "edited": "False", "id": "i1jvby7", "is_submitter": "True", "link_id": "t3_tiset7", "parent_id": "t1_i1g357l", "score": "2", "subreddit": "mixedrace", "subreddit_id": "t5_2qnue"}, {"author": "ella-eerie", "body": "which is understandable! however i was just joking about the whole “worldwide unity” thing haha this is about personal interactions with people i know, during which i’m often targeted by these peers. as other comments have mentioned, a lot of it just has to do with your company— but it’s an isolating experience, seeing as i live somewhere mixed folks aren’t as common, so i just wanted to vent somewhere others might understand that feeling.", "created_utc": "1647881551.0", "edited": "False", "id": "i1jthih", "is_submitter": "True", "link_id": "t3_tiset7", "parent_id": "t1_i1gxgti", "score": "2", "subreddit": "mixedrace", "subreddit_id": "t5_2qnue"}, {"author": "ella-eerie", "body": "are you the kind of person that takes tons of photos of your pets? or like sets them as your background, posts about them everywhere, etc.? i always wondered why i missed my pets and not people and recently realized it was because my pets are never that far “out of sight”—if i open my photo gallery or IG or ANYTHING i immediately see them and go :( aw i want to hold them :( LOLLL", "created_utc": "1647806171.0", "edited": "False", "id": "i1fyetk", "is_submitter": "False", "link_id": "t3_ti9a5x", "parent_id": "t1_i1f72gp", "score": "2", "subreddit": "ADHD", "subreddit_id": "t5_2qnwb"}, {"author": "ella-eerie", "body": "hi! i’m so sorry about how difficult your situation sounds, i’m schizoaffective and have hEDS so i can understand some of what it’s like to have both your mind and body coming after you each and every day. :( it is absolutely worth seeking out clarification if you feel like autism seems like it could be a plausible explanation for things that have always challenged you, the sort you described at the end of your post!! while this didn’t happen for me personally, a lot of autistic girls and women will get diagnosed with things like bipolar or BPD when it’s actually autism. if you’ve ever felt like many of the suggestions that you’ve been given to cope with your current diagnoses never seem to help the way they should and medications don’t ease your symptoms, things just never get any better, and so on, that is a big sign they might not be treating you for the right things or just not reaching through the surface stuff to get at what’s beneath it. \n\nif you want to pursue a potential diagnosis and feel comfortable with your current therapist and psychiatrist, you can talk to one of them and see if they can recommend or refer you to anyone for an assessment! they’ll often have a good idea of who’s in network for your insurance and that sort of thing (if that’s a problem you have, i know it’s very american of me to say LOL) and that makes things WAY simpler! if you aren’t sure or feel wary that they might push you away from seeking help, you can start the search yourself. “adult autism assessment near me” “autism specialists in [your city]” and that sort of thing can at least get you started. you might have to make some phone calls or send emails, which i know is something lots of us with autism HATE to do, but if it’s what you want it’s 100% worth it to advocate for yourself. i hope this helps and your situation looks up soon!! \n\nsorry i talk so much i know this might be a lot but!! tl;dr go for it if you want to take this step, talk to your current doctors if they can help, and put yourself first—you’re worth it!", "created_utc": "1647805276.0", "edited": "False", "id": "i1fwbpa", "is_submitter": "False", "link_id": "t3_tisada", "parent_id": "t3_tisada", "score": "1", "subreddit": "AutismInWomen", "subreddit_id": "t5_3yx96k"}, {"author": "ella-eerie", "body": "at least from how i read it (which might of course be wrong!) it may be less about interactions with strangers, and more about personal connections? ex. trying to relate to a shared experience with a latino friend, who then proceeds to say “you don’t get it, you’re white/asian/wasian” when you’ve already told them personally that your parent(s) have latin heritage, too. i think being 100% accurately perceived by strangers isn’t often what someone desires; they know it’s very unlikely to happen!", "created_utc": "1647696096.0", "edited": "False", "id": "i1a00g2", "is_submitter": "False", "link_id": "t3_thlzou", "parent_id": "t1_i19w2cb", "score": "9", "subreddit": "mixedrace", "subreddit_id": "t5_2qnue"}, {"author": "ella-eerie", "body": "that’s totally understandable, too!! i can imagine it must be difficult to get questioned to your face and feel so uncomfortable that way. :( i think people where i live are probably just not as confrontational, is all, so even if they don’t believe it they won’t ask too many questions and just talk behind your back instead LMAO", "created_utc": "1647615702.0", "edited": "False", "id": "i15sifw", "is_submitter": "False", "link_id": "t3_th1ifb", "parent_id": "t1_i15qbjz", "score": "2", "subreddit": "mixedrace", "subreddit_id": "t5_2qnue"}, {"author": "ella-eerie", "body": "bourbon! and! horses!", "created_utc": "1647613281.0", "edited": "False", "id": "i15mlcm", "is_submitter": "False", "link_id": "t3_tgp33x", "parent_id": "t3_tgp33x", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "ella-eerie", "body": "halloween / trick or treating!!! as an adult now i sort of don’t even think i would have enjoyed it that much, but looking out the window at other kids doing it made me so jealous.", "created_utc": "1647612953.0", "edited": "False", "id": "i15lt6i", "is_submitter": "False", "link_id": "t3_tgrnn2", "parent_id": "t3_tgrnn2", "score": "10", "subreddit": "HomeschoolRecovery", "subreddit_id": "t5_3cxr2"}, {"author": "ella-eerie", "body": "so angry. :/ i always end up encountering those videos on TT, too! glad it’s not just me; i explicitly say “i’m not interested” on the menu and then the algorithm goes “ah, so you want to see ANOTHERRRR take on homeschooling instead, RIIIIIGHT?” so frustrating to end up seeing niche content that can genuinely trigger severe anxiety and dread on the worst days!!", "created_utc": "1647053423.0", "edited": "False", "id": "i0boj05", "is_submitter": "False", "link_id": "t3_tbuwp1", "parent_id": "t3_tbuwp1", "score": "3", "subreddit": "HomeschoolRecovery", "subreddit_id": "t5_3cxr2"}, {"author": "ella-eerie", "body": "written roleplay, as cringe as that probably is. i started it in 2006 by passing a notebook back and forth between myself and the one friend i had, detailing our characters interacting, then moved to forums, skype, discord… it’s just always been so fun!!!", "created_utc": "1647041942.0", "edited": "False", "id": "i0b1cec", "is_submitter": "False", "link_id": "t3_tbprar", "parent_id": "t3_tbprar", "score": "1", "subreddit": "ADHD", "subreddit_id": "t5_2qnwb"}, {"author": "ella-eerie", "body": "it IS tough, you’re right!! 😭but to be honest, i’ve found that over time it’s more rewarding? niche fandoms keep their interest for longer, and are much more open-minded/positive about the fics they read because there’s just not as many to choose from. you will absolutely reach the right people just by having the fic there—i still get the occasional comment on a niche fandom fic from 2018! your people are out there and when more folks are able to watch the movie (based on other comments) your work will be right there for that inevitable ao3-scour that comes after. don’t give up! 🫂", "created_utc": "1647041571.0", "edited": "False", "id": "i0b0j95", "is_submitter": "False", "link_id": "t3_tbrh4w", "parent_id": "t3_tbrh4w", "score": "6", "subreddit": "AO3", "subreddit_id": "t5_3c2cn"}, {"author": "ella-eerie", "body": "congrats!!! keep it up, wishing you luck! 💪", "created_utc": "1647009176.0", "edited": "False", "id": "i08sg0u", "is_submitter": "False", "link_id": "t3_tbphg9", "parent_id": "t3_tbphg9", "score": "4", "subreddit": "AO3", "subreddit_id": "t5_3c2cn"}, {"author": "ella-eerie", "body": "yes!!! exactly 😭 did you also always take photos with your eyebrows super raised trying to offset the hoodedness? i still do that without even thinking tbh", "created_utc": "1647008681.0", "edited": "False", "id": "i08rchl", "is_submitter": "False", "link_id": "t3_tbj9o7", "parent_id": "t1_i08qfic", "score": "2", "subreddit": "mixedrace", "subreddit_id": "t5_2qnue"}, {"author": "ella-eerie", "body": "some days i wake up and my eyelids fold over, some days they don’t!!! i have to gently push them with a makeup brush to match LMAO", "created_utc": "1647000382.0", "edited": "False", "id": "i08bvdt", "is_submitter": "False", "link_id": "t3_tbj9o7", "parent_id": "t3_tbj9o7", "score": "4", "subreddit": "mixedrace", "subreddit_id": "t5_2qnue"}, {"author": "ella-eerie", "body": "chosen family and friends are where it’s at!! i think a lot of people have their qualms with a single life being “lonely”—  it’s never lonely if you’re surrounded by friends you love, HELLOOOO??", "created_utc": "1646853188.0", "edited": "False", "id": "i00ax8a", "is_submitter": "True", "link_id": "t3_t9torm", "parent_id": "t1_i005t20", "score": "2", "subreddit": "AutismInWomen", "subreddit_id": "t5_3yx96k"}, {"author": "ella-eerie", "body": "yes!!! exactly 😭 my last (and, as far as my plans go now, FINAL) relationship ended because she didn’t understand why i needed time alone and felt that if i really liked her i’d always want to be with her so it made us both feel just terrible. i understand her pov of course, but man you and me seem to be on the same wavelength about that 🤝🤝 us out here not wanting ppl in our business too often HAHAHAJDLS", "created_utc": "1646851507.0", "edited": "False", "id": "i006kqf", "is_submitter": "True", "link_id": "t3_t9torm", "parent_id": "t1_hzz3250", "score": "3", "subreddit": "AutismInWomen", "subreddit_id": "t5_3yx96k"}, {"author": "ella-eerie", "body": "absolutely a best friend that’s a great joy to be around sounds like a wonderful aspiration for marriage!! so i’m sure your brownie-making future husband is out there perfecting that recipe right now 🤌", "created_utc": "1646784704.0", "edited": "False", "id": "hzwpbiv", "is_submitter": "True", "link_id": "t3_t9torm", "parent_id": "t1_hzwoeby", "score": "4", "subreddit": "AutismInWomen", "subreddit_id": "t5_3yx96k"}, {"author": "ella-eerie", "body": "that’s so wonderful!!! sounds like you guys have great understanding and teamwork!", "created_utc": "1646784433.0", "edited": "False", "id": "hzwoq3n", "is_submitter": "True", "link_id": "t3_t9torm", "parent_id": "t1_hzwo3ia", "score": "3", "subreddit": "AutismInWomen", "subreddit_id": "t5_3yx96k"}, {"author": "ella-eerie", "body": "heyyy, i’m also wlw!!! 🥰 i get what you’re saying about all of this, definitely. and the expectation that people MUST be married to “really” be in it together is so,,, outdated, ur very right on that. i hope one day you find that perfect gal for you!!!!", "created_utc": "1646784395.0", "edited": "False", "id": "hzwon6t", "is_submitter": "True", "link_id": "t3_t9torm", "parent_id": "t1_hzwnqs2", "score": "4", "subreddit": "AutismInWomen", "subreddit_id": "t5_3yx96k"}, {"author": "ella-eerie", "body": "YOOOOO!!!! awesome i’m glad to hear it!!!", "created_utc": "1644963877.0", "edited": "False", "id": "hx3g0zp", "is_submitter": "False", "link_id": "t3_srj6ha", "parent_id": "t1_hwzfcln", "score": "1", "subreddit": "tipofmytongue", "subreddit_id": "t5_2r4oc"}, {"author": "ella-eerie", "body": "for a moment i thought it had no lasagna and was one of those low-carb “wet fucking zucchini is as good as pasta, right?” nightmares my mom was so fond of during my youth. but i think this manages to be worse, you deserve an award of courage my guy this would have been my last straw", "created_utc": "1644767961.0", "edited": "False", "id": "hwsfytl", "is_submitter": "False", "link_id": "t3_sr1z2d", "parent_id": "t3_sr1z2d", "score": "2", "subreddit": "shittyfoodporn", "subreddit_id": "t5_2u1if"}, {"author": "ella-eerie", "body": "super helpful, thank you!!! i’ll keep poking around for it!!", "created_utc": "1644764501.0", "edited": "False", "id": "hws7ypf", "is_submitter": "False", "link_id": "t3_srj6ha", "parent_id": "t1_hws6snx", "score": "1", "subreddit": "tipofmytongue", "subreddit_id": "t5_2r4oc"}, {"author": "ella-eerie", "body": "Is it maybe Confession Rehearsal (HoneyWorks)? https://youtu.be/wCwFfe7_6tA", "created_utc": "1644764426.0", "edited": "False", "id": "hws7sqy", "is_submitter": "False", "link_id": "t3_srjak5", "parent_id": "t3_srjak5", "score": "2", "subreddit": "tipofmytongue", "subreddit_id": "t5_2r4oc"}, {"author": "ella-eerie", "body": "do you have any memory about where you might have heard it? like on youtube, digging through bandcamp, soundcloud, etc.? it sure sounds like a bandcamp type of thing but i haven’t found a thing yet 😭", "created_utc": "1644763563.0", "edited": "False", "id": "hws5wb7", "is_submitter": "False", "link_id": "t3_srj6ha", "parent_id": "t3_srj6ha", "score": "1", "subreddit": "tipofmytongue", "subreddit_id": "t5_2r4oc"}, {"author": "ella-eerie", "body": "Solved!", "created_utc": "1644721230.0", "edited": "False", "id": "hwqb5x1", "is_submitter": "True", "link_id": "t3_sqx7fz", "parent_id": "t1_hwp9bkl", "score": "2", "subreddit": "tipofmytongue", "subreddit_id": "t5_2r4oc"}, {"author": "ella-eerie", "body": "Is it maybe SkyCorp Home Video? https://youtu.be/GjgdyzxiOaE :0", "created_utc": "1644705813.0", "edited": "False", "id": "hwpd0q6", "is_submitter": "False", "link_id": "t3_sr0cmj", "parent_id": "t3_sr0cmj", "score": "1", "subreddit": "tipofmytongue", "subreddit_id": "t5_2r4oc"}, {"author": "ella-eerie", "body": "This is a superb guess, and it may be the one! So many of the details are right on. Still, I really do so vividly remember the chicken appearing and attacking him at his house (and also not having a head at all) but I’m going to send it to my brother to see what he thinks since he was older at the time. Fingers crossed, thank you! Hopefully will be checking in soon!\n\nEdit: He seems to agree that this is the one!! Such is the way of a child’s memory, I think. Thanks everyone so much for your help, I’m about to mark this one solved!!", "created_utc": "1644705441.0", "edited": "1644721226.0", "id": "hwpc4mm", "is_submitter": "True", "link_id": "t3_sqx7fz", "parent_id": "t1_hwp9bkl", "score": "2", "subreddit": "tipofmytongue", "subreddit_id": "t5_2r4oc"}, {"author": "ella-eerie", "body": "Eraserhead is such a bizarre but intriguing film! Sadly though, YEAH you are right that it’s not the one that went THIS bizarre with it. Thanks, I appreciate the suggestion!", "created_utc": "1644701271.0", "edited": "False", "id": "hwp20ar", "is_submitter": "True", "link_id": "t3_sqx7fz", "parent_id": "t1_hwp1lqt", "score": "2", "subreddit": "tipofmytongue", "subreddit_id": "t5_2r4oc"}, {"author": "ella-eerie", "body": "No sorry :( I mentioned that as one of the failed searches in the post— it would be so fitting for that though!", "created_utc": "1644701160.0", "edited": "False", "id": "hwp1qea", "is_submitter": "True", "link_id": "t3_sqx7fz", "parent_id": "t1_hwowq1d", "score": "1", "subreddit": "tipofmytongue", "subreddit_id": "t5_2r4oc"}, {"author": "ella-eerie", "body": "No problem!! I’ll keep an eye out for what it might be if nobody else can find it either, I listen to Creepypastas while doing commission work so there’s always a chance it’ll come up!", "created_utc": "1644694611.0", "edited": "False", "id": "hwolksg", "is_submitter": "False", "link_id": "t3_sqyf0k", "parent_id": "t1_hwol0bx", "score": "1", "subreddit": "tipofmytongue", "subreddit_id": "t5_2r4oc"}, {"author": "ella-eerie", "body": "If there’s the slimmest chance it’s a game, it might be the Silent Hill PT? It was the playable trailer for a game that was never finished!", "created_utc": "1644694278.0", "edited": "False", "id": "hwokrwk", "is_submitter": "False", "link_id": "t3_sqyf0k", "parent_id": "t3_sqyf0k", "score": "1", "subreddit": "tipofmytongue", "subreddit_id": "t5_2r4oc"}, {"author": "ella-eerie", "body": "Sadly I don’t think so, but thank you! This was a live action scene as far as I can recall, it just MIGHT have had that uncanny-looking late-90’s/early-2000’s “live action and CGI animation in the same film but we don’t really know how to do that yet” thing like Smart House, for example LOL", "created_utc": "1644692606.0", "edited": "False", "id": "hwogpfc", "is_submitter": "True", "link_id": "t3_sqx7fz", "parent_id": "t1_hwog17z", "score": "2", "subreddit": "tipofmytongue", "subreddit_id": "t5_2r4oc"}, {"author": "ella-eerie", "body": "What a world we live in that a woman can’t find her childhood horrors on Google!!", "created_utc": "1644688891.0", "edited": "False", "id": "hwo7mu8", "is_submitter": "True", "link_id": "t3_sqx7fz", "parent_id": "t3_sqx7fz", "score": "4", "subreddit": "tipofmytongue", "subreddit_id": "t5_2r4oc"}, {"author": "ella-eerie", "body": "you’re glowing!! seriously, i let out an audible (excited) gasp when i unspoiled the photo— it’s such amazing progress and it’s so visibly paid off to fight to reclaim your health!", "created_utc": "1643897318.0", "edited": "False", "id": "hvf5x6p", "is_submitter": "False", "link_id": "t3_sj432j", "parent_id": "t3_sj432j", "score": "1", "subreddit": "progresspics", "subreddit_id": "t5_2sl0y"}, {"author": "ella-eerie", "body": "it almost pushes me over the edge every time!!! the only person to ever really get it and respect me is my younger sibling. it’s odd how much i sit around thinking about how sad it is that the culture of the USA generally discourages friendly, platonic physical touch and how unhealthy it is for humans as pack animals to be so touch starved… while actively loathing when anyone touches me! LOL", "created_utc": "1642937959.0", "edited": "False", "id": "htvbtkw", "is_submitter": "False", "link_id": "t3_sacces", "parent_id": "t3_sacces", "score": "1", "subreddit": "AutismInWomen", "subreddit_id": "t5_3yx96k"}, {"author": "ella-eerie", "body": "WOAH YES 😯 if i am too aware of the sensation of my eyeballs kinda… rolling back a bit when trying to sleep it can make me so uncomfortable that i don’t sleep that night or have to lie there shoving the heels of my palms against them so the pressure sensation is more noticiable than the movement one, though sadly that isn’t always enough. the sensory stuff a lot of people just get to NOT experience is so crazy to me LMAO", "created_utc": "1641759557.0", "edited": "False", "id": "hryke5m", "is_submitter": "False", "link_id": "t3_rzbk4k", "parent_id": "t1_hrv6uf5", "score": "4", "subreddit": "ADHD", "subreddit_id": "t5_2qnwb"}, {"author": "ella-eerie", "body": "so amazing, congrats!!!", "created_utc": "1641759165.0", "edited": "False", "id": "hryj9rt", "is_submitter": "False", "link_id": "t3_rzee4h", "parent_id": "t3_rzee4h", "score": "3", "subreddit": "AO3", "subreddit_id": "t5_3c2cn"}, {"author": "ella-eerie", "body": "i’ve been on ao3 since 2014 and i have 20 total 😳 one might say i’m a little picky… i even read stuff most every morning through all of 2021 (and now the start of this yr) too 😭🤚", "created_utc": "1641757466.0", "edited": "False", "id": "hryeh2i", "is_submitter": "False", "link_id": "t3_rzhzak", "parent_id": "t3_rzhzak", "score": "1", "subreddit": "AO3", "subreddit_id": "t5_3c2cn"}, {"author": "ella-eerie", "body": "oh boy— the gifted kid thing! i was homeschooled my whole life and placed in oddball types of “””gifted””” programs because of it, but i still had to do formal state testing in elementary and middle school. i’ll never forget finding out from my mother when i was already halfway through high school that they’d received multiple letters from incredibly notable private & magnet schools “begging” (her word, not mine) for me to attend with fully paid tuition. of course, i wasn’t ever allowed to go or even asked if i wanted to since “god had called [us] to homeschooling.” i’ll always wonder what kind of person i could have become if proper professional educators had the chance to see how i behaved. i have a fantasy they might have seen the ways i struggled and suggested help or diagnostic testing for me… but who knows how realistic that is!", "created_utc": "1641569793.0", "edited": "False", "id": "hrnbi1u", "is_submitter": "False", "link_id": "t3_rxilnj", "parent_id": "t3_rxilnj", "score": "2", "subreddit": "AutismInWomen", "subreddit_id": "t5_3yx96k"}, {"author": "ella-eerie", "body": "mongolian IS beautiful! i’m half mongolian on my bio father’s side and i always get a little (too) excited seeing someone mention anything about the culture. it’s a language that you feel DEEP into your chest, you know? ancient and wild really is the best way to describe it!", "created_utc": "1640995739.0", "edited": "False", "id": "hqqw5yn", "is_submitter": "False", "link_id": "t3_rsyttd", "parent_id": "t1_hqpq8lb", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "ella-eerie", "body": "catalan! it just makes everything sound so beautiful, like hearing about a day at the grocery store is a work of fine poetry. all languages have their own form of beauty, of course, so i guess i’d say that catalan is my personal vision of “stunning” LOL", "created_utc": "1640994858.0", "edited": "False", "id": "hqqub6y", "is_submitter": "False", "link_id": "t3_rsyttd", "parent_id": "t3_rsyttd", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "ella-eerie", "body": "NOOO losing one is almost worse than losing both— or at least i’d think so 😩🤚 my galaxy buds (original) have been awesome! so if you end up not buying a replacement for the one earbud like another commenter suggested, these are a pretty nice pick! the newer models have more options than the ogs, but of course more features means more money. the noise cancellation has worked great for me personally! ^^", "created_utc": "1640994202.0", "edited": "False", "id": "hqqsuoe", "is_submitter": "False", "link_id": "t3_rskkcb", "parent_id": "t3_rskkcb", "score": "1", "subreddit": "AutismInWomen", "subreddit_id": "t5_3yx96k"}, {"author": "ella-eerie", "body": "new diagnosis squad!!! getting answers after YEARS is such an amazing feeling and  i’m sincerely glad you get to experience it now! enjoy your time on this sub!! i mainly lurk most days but it’s such a great place to hang around.", "created_utc": "1640993415.0", "edited": "False", "id": "hqqr3og", "is_submitter": "False", "link_id": "t3_rt2ra8", "parent_id": "t3_rt2ra8", "score": "5", "subreddit": "AutismInWomen", "subreddit_id": "t5_3yx96k"}, {"author": "ella-eerie", "body": "this thought has been so heavy on my mind recently, too. i don’t have much in terms of advice because i’m struggling and desperate for answers too, but: you’re not alone and this doesn’t sound whiny at all— not to me, at least. your struggles are legitimate and you will find what works in spite of them!!", "created_utc": "1640993107.0", "edited": "False", "id": "hqqqf6a", "is_submitter": "False", "link_id": "t3_rt362a", "parent_id": "t3_rt362a", "score": "15", "subreddit": "AutismInWomen", "subreddit_id": "t5_3yx96k"}, {"author": "ella-eerie", "body": "infj here! tests are never totally certain where to place me on the last function, so i do occasionally get infp— but i get infj a little more often so i go with that. ^^ i think it works pretty well!! 🥰", "created_utc": "1640453094.0", "edited": "False", "id": "hpxm988", "is_submitter": "False", "link_id": "t3_ro0l4w", "parent_id": "t3_ro0l4w", "score": "2", "subreddit": "AutismInWomen", "subreddit_id": "t5_3yx96k"}, {"author": "ella-eerie", "body": "YOOO let’s go, same oddly specific routine buddies!!! 🤝", "created_utc": "1639914667.0", "edited": "False", "id": "hp5qw61", "is_submitter": "True", "link_id": "t3_rimm3v", "parent_id": "t1_hp2v8gb", "score": "2", "subreddit": "AutismInWomen", "subreddit_id": "t5_3yx96k"}, {"author": "ella-eerie", "body": "thank you so so much for this!!! one detail i neglected to mention is that i’m adopted so my parents and i aren’t biologically related, but otherwise this is all relevant and it means a lot to me. i’m sorry to hear it wasn’t so easy with your parents either. :( once i’m a little more financially able, i’m going to go for it again and try to give the context about my parents and how it may influence the ratings. i didn’t know that about unhealthy home lives impacting ADHD symptoms!! but it makes sense; growing up in a challenging environment just makes EVERYTHING worse. wishing you the best, and i hope the diagnosis and getting some space from them has been liberating!! thanks again!", "created_utc": "1639672816.0", "edited": "False", "id": "hosqzaa", "is_submitter": "False", "link_id": "t3_rhqpat", "parent_id": "t1_hos7z95", "score": "3", "subreddit": "ADHD", "subreddit_id": "t5_2qnwb"}, {"author": "ella-eerie", "body": "i LOVED her!! i can completely understand why someone wouldn’t (especially after the racism, it was a big yikes undeniably) but she’s so interesting. a lot of times women in media get very shallow treatment, so it was pretty neat to see a side character that had clearly been thought through. i hope s2 tells us a bit more about her backstory, but i think that might be just a fantasy 😔", "created_utc": "1639659906.0", "edited": "False", "id": "horxlb5", "is_submitter": "False", "link_id": "t3_rhg68b", "parent_id": "t3_rhg68b", "score": "13", "subreddit": "squidgame", "subreddit_id": "t5_4wyeb7"}, {"author": "ella-eerie", "body": "i saw this in a random youtube comment and it AT LAST allowed me to roll r’s with a bit more fiddling— saying the phrase “pot of tea” (in english) VERY fast over and over eventually moves your tongue in the way it generally should for the trill! obviously it takes trial and error to translate it to an actual spanish word like perro, but because i learn best that way in general it was the thing that did it for me much better and simpler than trying to watch videos of people explaining how to or going a step at a time. good luck, you’ve got this!!!", "created_utc": "1639659300.0", "edited": "False", "id": "horwi72", "is_submitter": "False", "link_id": "t3_rgnctj", "parent_id": "t3_rgnctj", "score": "2", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "ella-eerie", "body": "Thanks so much for sharing Dreaming Spanish! I’m super new to learning, but I was thinking the other day how just having a very simple story or concept told in Spanish without English subtitles (or as much interruption to explain rules and such) would be such a helpful tool in spoken word recognition/using context clues— but I figured most would be too advanced for me right now. This channel is exactly what I needed!", "created_utc": "1639658184.0", "edited": "False", "id": "horukgr", "is_submitter": "False", "link_id": "t3_rhjxqd", "parent_id": "t1_hor3zos", "score": "15", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "ella-eerie", "body": "mine’s mortuary science!! still in the pre-reqs phase, though. 🪦🧪", "created_utc": "1635827185.0", "edited": "False", "id": "hiz4557", "is_submitter": "False", "link_id": "t3_qk31i9", "parent_id": "t3_qk31i9", "score": "2", "subreddit": "AutismInWomen", "subreddit_id": "t5_3yx96k"}, {"author": "ella-eerie", "body": "ABSOLUTELY love it!!! i’m trying to resist the urge to watch it again and start collecting all the behind-the-scenes info and everything because i don’t want to get too distracted but WOW!! such an excellent show and i love the commentary; it’s definitely got elements that reflect SK’s society in ways i can’t personally relate to, being american and all, but the overall message is SO poignant and resonates wonderfully! who ended up being your favorite character, OP??? :0", "created_utc": "1633687111.0", "edited": "False", "id": "hfu4vim", "is_submitter": "False", "link_id": "t3_q3pp3g", "parent_id": "t3_q3pp3g", "score": "3", "subreddit": "AutismInWomen", "subreddit_id": "t5_3yx96k"}, {"author": "ella-eerie", "body": "yes, so much! whenever i saw the common symptom of being “too trusting” i was like “no way, not me”— until i stepped back and realized, like you said, if someone says something i sort of just… assume it’s true and do it? i always assume other people know better than i do. 🤭", "created_utc": "1632173478.0", "edited": "False", "id": "hdn4743", "is_submitter": "False", "link_id": "t3_ps2k73", "parent_id": "t3_ps2k73", "score": "15", "subreddit": "AutismInWomen", "subreddit_id": "t5_3yx96k"}, {"author": "ella-eerie", "body": "for sure, dude! happy to have you interested!\n(https://discord.gg/FgpS3KC link up above should be working since i tested it, BUT if not there you go again! <3 it's open until i edit things to say otherwise-- if i ever do so-- so take ur time!)", "created_utc": "1591586062.0", "edited": "False", "id": "ftc0f5m", "is_submitter": "False", "link_id": "t3_gwnjsk", "parent_id": "t1_ft50mmw", "score": "1", "subreddit": "Roleplay", "subreddit_id": "t5_2qrxs"}, {"author": "ella-eerie", "body": "yes, yes! you're very welcome to join! (sorry i'm behind, i am not the most active redditor ehehehe)\nhere's the link again if it's not working up above! https://discord.gg/FgpS3KC", "created_utc": "1591585996.0", "edited": "False", "id": "ftc0bjq", "is_submitter": "False", "link_id": "t3_gwnjsk", "parent_id": "t1_ft453q6", "score": "1", "subreddit": "Roleplay", "subreddit_id": "t5_2qrxs"}, {"author": "ella-eerie", "body": "hello hello! you are welcome to join via the link posted above. if it's not working there for some reason, here it is again:  \n[https://discord.gg/FgpS3KC](https://discord.gg/FgpS3KC)\n\nwe're excited to have ya!", "created_utc": "1591313108.0", "edited": "False", "id": "fswypbo", "is_submitter": "False", "link_id": "t3_gwnjsk", "parent_id": "t1_fswex7e", "score": "1", "subreddit": "Roleplay", "subreddit_id": "t5_2qrxs"}]