[{"author": "emcuttsy", "body": "I'm a little confused by your post... are you just learning Polish because you want to prove to yourself that you can do something hard? If so, you need to find a new motivation. Either learn to genuinely love Polish, switch to a language you actually like, or don't learn a language at all if you're really not into it...\n\nLearning a language as a proof of psychological macho just isn't going to work out XD", "created_utc": "1666460034.0", "edited": "False", "id": "itcsitd", "is_submitter": "False", "link_id": "t3_yahkly", "parent_id": "t3_yahkly", "score": "14", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "emcuttsy", "body": ">If it helps, no language is intrinsically more or less difficult than another. \n\n... True but misleading. No language is intrinsically more or less difficult than another — only if you're a) a baby or b) an alien with no human first language\n\nOur native languages have a *massive* impact on how hard/easy it is to learn other languages, and learning languages that are more similar to our own native languages is always going to be easier. Learning German as an English speaker is leagues easier than learning German as a Mandarin speaker.", "created_utc": "1666460002.0", "edited": "False", "id": "itcsfyj", "is_submitter": "False", "link_id": "t3_yahkly", "parent_id": "t1_itb82hw", "score": "8", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "emcuttsy", "body": "XD Use the force. Exactly!", "created_utc": "1666459675.0", "edited": "False", "id": "itcrn1t", "is_submitter": "False", "link_id": "t3_y90clc", "parent_id": "t1_itbbb56", "score": "1", "subreddit": "German", "subreddit_id": "t5_2qq51"}, {"author": "emcuttsy", "body": "Lol I don't recommend streams because I'm already old and out of touch at 25 and never got on the stream bandwagon; But you're definitely right — streams would be a great source of comprehensible input and also double as opportunities to do some output... if you're not shy lol. \n\nI'd love to recommend streamers but I don't know enough of them to find people that I'd feel good recommending to folks who read my blog or subscribe to my newsletter XD maybe I need to recruit some friends to help come up with streamer recommendations.", "created_utc": "1666459651.0", "edited": "False", "id": "itcrkuu", "is_submitter": "False", "link_id": "t3_ya9f4a", "parent_id": "t3_ya9f4a", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "emcuttsy", "body": "Learn binary. Definitely the most useful in that region.", "created_utc": "1666459548.0", "edited": "False", "id": "itcrbs7", "is_submitter": "False", "link_id": "t3_ya3h37", "parent_id": "t3_ya3h37", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "emcuttsy", "body": "What a cool project! I don't have time to give the kind of solid feedback you need from beta testers but I'd love to give it a spin once it's out :)", "created_utc": "1666459490.0", "edited": "False", "id": "itcr6ng", "is_submitter": "False", "link_id": "t3_yai4bo", "parent_id": "t3_yai4bo", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "emcuttsy", "body": "To me it sounds like your classmates probably have more experience studying and applying grammar in formal contexts. They know what case is, what gender is, they know the names of the cases, and they've probably memorized the endings for each gender and case.\n\nLuckily knowing things like \"this is the masculine definite article in the accusative case\" is not what makes someone good at actually speaking German fluently. Most German speakers don't think about this at all, they just do what *feels* right and you can build that *feeling* up too. Unless you need to be able to do this for a grade or something I wouldn't sweat your explicit grammar knowledge much so long as you feel like you're making progress in your ability to communicate and understand — and that your \"Bauchgefühl\" for when to use which case (and gender) is also getting more accurate.\n\nAs an encouraging example, I learned case pretty much entirely by feel and not by memorization or coursework: I didn't do any formal studying to learn case and the article endings beyond  reading enough about how case works  to know 1) that case exists, 2) that it acts on nouns and 3)  how, roughly, case impacts meaning, and then just consuming loads of input. With time (about 2 years self-study to b2 ) I developed a pretty good instinct for what article to use when. \n\nAnd yeah it's super super hard, but try not to fall back on English in public haha. My teacher schimpfed me super hard for speaking English with the other students (all non-native speakers who wanted to practice with me between class sessions) and was pretty clear with me and everyone else that using English as a crutch will get in the way of learning German. Staying in international bubbles is kind of a death sentence for language progress as an English speaker... at this point whenever I do go to international meetups I always very specifically try to stick to the German-speaking bubbles until basically forced at social gunpoint to speak English lol", "created_utc": "1666426534.0", "edited": "False", "id": "itb5d67", "is_submitter": "False", "link_id": "t3_y90clc", "parent_id": "t1_itaxanb", "score": "1", "subreddit": "German", "subreddit_id": "t5_2qq51"}, {"author": "emcuttsy", "body": "I still believe pretty firmly that with enough input it is possible to learn a language, that's a point we're just not going to agree on XD But I still want to engage with this because you raise some interesting points and this is helping me crystalize some of my own ideas.\n\nFirst, fair. \"do this do that\" is obviously not as good as people learning to find their own method... but when someone asks for advice being told \"find your own method and strike a balance\" isn't super helpful. Giving some explicit suggestions, especially on a site like reddit where everyone will chime in with a different opinion, gives people a buffet of possibilities to try out themselves to build that individual method ;) \n\nWith that out of the way: I DEFINITELY agree that people often fail at learning via input. They do. I just don't think this is evidence that input alone doesn't work. I think it is evidence that it's possible to do input wrong — of course just watching TV shows for adults and doing nothing else is probably not an effective learning strategy because the input isn't comprehensible if you can't understand it well.\n\nAs an adult, it is admittedly really hard to get the right kind of input as a beginner. As a kid adults just sit around feeding you level-appropriate input all day whether you like it or not. For input to work, you need to understand it pretty well. The average adult will realistically only get this kind of input from some kind of resource for beginners.\n\n\\> What exactly do you mean by studying/explicit learning, then? Because I'd argue learning about cases is studying, and in your first comment, you said that the idea that it's helpful at all is debatable. \n\nRe \"debatable,\" from all I've read, this is just how it is: the point is under active debate in the second language acquisition research community. Meanwhile, \"input is necessary\" is not. Again, this is as best I understand. I'm not in this field but I am trying to read the academic literature when I have time.\n\nRe: \"explicit vs implicit learning,\" this is a borderline point, I agree. I think the difference I see here is a matter of the role of the knowledge. I don't think it's effective to memorize forms and then expect that you can use them — but I do believe that you only acquire the ability to use forms when you understand sentences within which they appear. Knowing case exists means you'll know to pay attention to how nouns change when you are trying to understand sentences, which can improve comprehensibility and therefore acquisition. Just memorizing the endings won't — unless you focus on the meaning of those endings, too. This is the classic \"focus on form\" vs \"focus on meaning\" debate and I think \"focus on meaning\" is what matters, even if you're doing that focus through explicit discussion of grammar. \n\nSeems like a gray zone to me that researchers would have trouble designing an experiment to separate out  — does reading a bunch of sentences in a grammar textbookcount as input or studying? So long as you understand the sentences (which you probably do, thanks to the textbook), it's input. But it's also aimed at teaching you something explicit... tricky stuff. \n\nTDLR with the right kind of input, I think people could acquire case (like kids do). But getting that kind of input as an adult is hard and if people hit their head over incomprehensible input they won't get anywhere. Building grammar awareness (as opposed to grammar form memorization) is a gray zone.", "created_utc": "1666380544.0", "edited": "False", "id": "it8rgo7", "is_submitter": "False", "link_id": "t3_y9tl6y", "parent_id": "t1_it8jfww", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "emcuttsy", "body": "I obviously disagree, but thanks for your comment. Personally, I would buy that being \"aware\" of grammar can be helpful — i.e., knowing case exists and knowing how it changes meaning. That's what I did I was learning German (but didn't study/drill case endings). Still... I obviously don't think memorizing case ending charts helps anyone as much as just reading a bunch of books would.\n\nHere's where I'm coming from: my personal experience with learning German went fine despite never doing formal grammar study until I took at course at C1 level just to meet people once I moved to Austria. English and German are closely related, though, so that certainly makes this method easier. So I base my opinion here also on 0) Steven Krashen's studies and writings, 1) Beniko Mason's studies of Japanese learners of English (two unrelated languages), 2) research including this recent review: [https://onlinelibrary.wiley.com/doi/abs/10.1111/flan.12552](https://onlinelibrary.wiley.com/doi/abs/10.1111/flan.12552) and 3) the stories of people I know in the language community who learned distantly related/not related languages using input.  \nObviously there's a reason this is still controversial. I think I've seen more fights over this on language twitter than over any other topic, and that's probably not changing any time soon.", "created_utc": "1666376727.0", "edited": "False", "id": "it8i0ym", "is_submitter": "False", "link_id": "t3_y9tl6y", "parent_id": "t1_it8gqbc", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "emcuttsy", "body": "Servus — are you also learning Austrian German?\n\nSo... the \"bad\" news is that English is in the same language family as German and being a native English speaker comes with some serious advantages when you're learning German — though the advantage is mostly with vocabulary recognition thanks to the cognates and less with the grammar.\n\nBut!!!! Remember that you have NO idea what your classmates' history is and how hard they're working. Do you know how many years of school they had learning German? Do you know how much they study at home? Do you know how much experience they've had learning languages in general? As a British person I'm guessing they have more experience than you, just because they probably learned English as well as German. \n\nThere are some grammar features that do exist in the Balkan south-Slavic languages, for instance, that don't exist in English but do exist in German (case, for instance). But your native language will be an advantage when it comes to knowing how to use articles (they don't exist in the Slavic languages) to the past tenses, and to remembering irregular verb conjugations (which tend to be similar in English and German, e.g. drink/drank/drunk trinkt/trank/getrunken). It's going to be a mixed bag for every language... but since English is in the same family as German, it almost certainly takes the average English speaker less time to get proficient in German than it takes the average Mandarin speaker, for instance.\n\nDon't get too discouraged, though! Being an anglophone comes with some cultural quirks that can interfere with language learning. As a fellow English speaker, I can say that English can sometimes be a \"disadvantage\" when you're learning because it's so easy to be lazy and not actually use the language. Everyone seems to speak English and it's so important that everyone wants to speak it with you. We anglophones also have more trouble taking the linguistic low ground since we're not use to it. We're always the native speakers in the crowd of learners.\n\nSo... If you're studying in Austria, do you use German when you're out and about? Or do you default to English? Do you insist that people speak German with you once they realize you're a native English speaker and switch to English so they can practice themselves? Do you watch German TV, read German news, and listen to German radio, or do you default to English? After class, do you speak to your classmates in German, or in English?\n\nWhat do you think your classmates do?", "created_utc": "1666376218.0", "edited": "False", "id": "it8gqrf", "is_submitter": "False", "link_id": "t3_y90clc", "parent_id": "t3_y90clc", "score": "1", "subreddit": "German", "subreddit_id": "t5_2qq51"}, {"author": "emcuttsy", "body": "It's great that you're learning from YouTube videos (so, comprehensible input). It sounds to me like you might need to just relax a bit more though, to be honest. Don't expect yourself to know and remember every word every time you watch a video! It takes many exposures to a word before you remember it and even more before it becomes a part of your active vocabulary.\n\nThere was a funny study where they found that just reading through the Harry Potter series was as good or better at teaching English learners academic vocabulary than normal study methods. So maybe consider incorporating some more \"play\" just enjoying English and soaking in it into your routine. Listening to podcasts while commuting or doing chores adds up hours of immersion very quickly. Comprehensible input really works (and it's WAY more fun and less exhausting than the kind of intensive watching you describe!). \n\nThis isn't to say not to do the studying you're already doing. But maybe also give yourself permission to just watch videos for fun without caring about not getting every word, too :)\n\nHere's a link to the Harry Potter study if you're interested: [https://files.eric.ed.gov/fulltext/EJ1276827.pdf](https://files.eric.ed.gov/fulltext/EJ1276827.pdf) \n\nGood luck and congrats on your upcoming move to Canada :)", "created_utc": "1666375223.0", "edited": "False", "id": "it8e92w", "is_submitter": "False", "link_id": "t3_y9tbxu", "parent_id": "t3_y9tbxu", "score": "5", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "emcuttsy", "body": "Hey, I definitely feel you. I was in your shoes — but learning Spanish as an English speaker. I actually never had success with Spanish during all my 4 years at school... despite my great grades I basically never learned to speak it. It's super frustrating.\n\nEverything was different with German (B2 after 2 years self study, now C1 after 3) for one big reason: I discovered comprehensible input and started focusing more on cultivating my love for the language and immersing in it than on \"studying\" it.\n\nDecades of research show that in many cases it's more effective to just read/listen/watch for pleasure in your target language than to do all the things we usually do in class. It's now clear at least that getting a ton of comprehensible input — media you can understand in your target language, so TV/books/podcasts/speech/etc. — is necessary for learning a language and it's probably also sufficient. Meanwhile, whether \"studying\" (i.e., explicit learning) helps at all is still under debate. \n\nSo basically, I'm recommending that you stop trying to learn French and start trying to love French stuff — watch TV, read books, listen to podcasts and audiobooks, find music you love, find bloggers and bloggers and social media accounts you love, read newspapers and magazines, etc. I'm guessing that when you learned English you spent a lot of time with English media, and yeah, it's probably easier to find media you like in English. But try with French. **It seems like your problem is probably that you don't like French enough to spend the time immersing in it that it takes to make progress.** No amount of flashcards or textbook exercises will change that unfortunately... but the good news is that watching YouTube or listening to podcasts is WAY more fun than flashcards! So maybe it's not so unfortunate after all ;)\n\nThere's a great video about comprehensible input (in Spanish!) on the Dreaming Spanish channel if you're interested: [https://www.youtube.com/watch?v=M5RwvFnsZ\\_g&t=197s](https://www.youtube.com/watch?v=M5RwvFnsZ_g&t=197s)  I also wrote a post about comprehensible input on my blog with a bunch of specific advice and some recommendations: [https://www.monoglotanxiety.com/blog/what-is-comprehensible-input-language-learning/](https://www.monoglotanxiety.com/blog/what-is-comprehensible-input-language-learning/) \n\n**There's also a TON about how to use comprehensible input to learn a language on the** [**Refold.la**](https://Refold.la) **website** if you want more specific guidance. Their advice about finding media is great and I think if you're struggling to find stuff you love about French it'll be a big help to focus on discovering media in French that excites you and keeps you motivated to learn the language. \n\nAnyways, this got way longer than I was expecting it to be. All the best with your journey learning French :)", "created_utc": "1666374827.0", "edited": "False", "id": "it8d8u9", "is_submitter": "False", "link_id": "t3_y9tl6y", "parent_id": "t3_y9tl6y", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "emcuttsy", "body": "Thank you, wow this is weirdly effective, at least the first step. I tried it last night and this morning — and I'm not fixed by any means — but it does feel good to say something as simple as \"I'm going to send this email when I'm done writing it\" and then do that thing. I'll see how long I can keep this up. \n\nReally appreciate that you took the time to write this out. Thank you again.", "created_utc": "1650380954.0", "edited": "False", "id": "i5cnzuc", "is_submitter": "False", "link_id": "t3_u6mgks", "parent_id": "t1_i5ahq48", "score": "2", "subreddit": "getdisciplined", "subreddit_id": "t5_2uzju"}, {"author": "emcuttsy", "body": "Thank you for your kind words... I wish I could see myself that way. Sometimes I wish I was religious just because it'd help with accepting that \"blind faith\" thing — I'm a scientist by training and skeptical by nature so it's hard for me to choose to believe things when the evidence is showing me something different. I guess a different interpretation of the same \"evidence\" — i.e., I'm resilient and I keep trying stuff vs. I suck and I keep failing — might be a more accessible way to think about this though.", "created_utc": "1650380871.0", "edited": "False", "id": "i5cns9m", "is_submitter": "False", "link_id": "t3_u6mgks", "parent_id": "t1_i5aawhx", "score": "1", "subreddit": "getdisciplined", "subreddit_id": "t5_2uzju"}, {"author": "emcuttsy", "body": "¡Hola! :) I'm a 25f scientist-turned-science journalist living in Boston. I'm an English native speaker and I'm learning Italian as well, maybe we could do language exchange and also be Italian buddies. For exchange, I really enjoy something called crosstalk where I'd speak English to you and you speak Spanish to me the whole time, but could be interested in normal exchange as well (my Spanish is basic, but I understand very well... frustrating haha). My hobbies are kinda nerdy, I dabble in a bit of building websites (I use Hugo, which is written in Go lol... but I'm no real programmer), learning languages, hiking, reading sci fi and fantasy books, etc. DM me if you like!", "created_utc": "1650327310.0", "edited": "False", "id": "i59zvlt", "is_submitter": "False", "link_id": "t3_u6qryh", "parent_id": "t3_u6qryh", "score": "2", "subreddit": "language_exchange", "subreddit_id": "t5_2tdbm"}, {"author": "emcuttsy", "body": "Thanks. Yeah... it's a tough one. I'm pretty isolated and have a bad track record with people, usually other girls or women, excluding me from friend groups suddenly after being nice for a while, so I find it hard to trust that people actually want to hear from me. Thinking of what to say when i just send a message is hard. But the few times I have done this it has gone well. I just don't have a habit in place for remembering to do this frequently enough to actually maintain connections that are deeper than an occasional chitchat. I'm also just sort of socially... out of it? I'm the kind of person who regularly forgets family birthdays and is generally disinterested in people until I realize I'm totally alone haha.\n\nIs there a way you've found helpful for remembering to reach out to people?", "created_utc": "1650323703.0", "edited": "False", "id": "i59rp2c", "is_submitter": "False", "link_id": "t3_u6mgks", "parent_id": "t1_i59q72v", "score": "2", "subreddit": "getdisciplined", "subreddit_id": "t5_2uzju"}, {"author": "emcuttsy", "body": "Thank you for this. I want to be one of those people who uses apps and calendars and tracking tools with success... its hard to give up on that dream. But it does help to hear that you've found success in learning into listening to your body in the moment. And maybe I should try more of that since it's kind of how I operate naturally. It's kinda a difficult pill to swallow since my impulsivity is one of the things I hate most about myself (I also apparently flunked an impulsivity test when I was tested for ADHD as a kid)... but maybe necessary.\n\nI do have some \"habits,\" though I'd call them tendencies more than habits since they're not orderly or regular. I am pretty good at teaching myself foreign languages and I do this by listening to podcasts in a different language pretty much any time I go for a walk, chores, or go to bed. I go for walks pretty much whenever I get bored, usually twice a day. I have a few language exchange partners I talk to once a week at a regular time. I take showers a lot, that's a pretty neutral habit, sometimes its a procrastination tool. \n\nAlso some bad habits ones:  I usually look at my phone and call my husband first thing when I wake up (a habit I'd like to break, I don't like starting my day with my phone). When I get hungry, I usually take my hunger as an excuse to walk to get takeaway. I check Twitter every time I get frustrated with work or a webpage takes too long to load, or if I don't know what to do.\n\nThank you for sharing the link, I think that might help me.", "created_utc": "1650323571.0", "edited": "False", "id": "i59rei6", "is_submitter": "False", "link_id": "t3_u6mgks", "parent_id": "t1_i59dv3w", "score": "1", "subreddit": "getdisciplined", "subreddit_id": "t5_2uzju"}, {"author": "emcuttsy", "body": "Ciao! Sto imperando l'italiano da \\~5 mesi e vorrei fare più pratica. Io (24F) sono americana e madrelingua inglese, e parlo anche il tedesco abbastanza bene. Mi piacerebbe fare \"crosstalk\" (io parlo in inglese e tu parli in italiano) ma anche scambio di lingua \"normale\" (50/50 italiano/inglese...  o tedesco haha) se è migliore per te. Scrivermi un DM si vuoi!", "created_utc": "1649335755.0", "edited": "False", "id": "i3r8okt", "is_submitter": "False", "link_id": "t3_ty6zrq", "parent_id": "t3_ty6zrq", "score": "3", "subreddit": "language_exchange", "subreddit_id": "t5_2tdbm"}, {"author": "emcuttsy", "body": "Hi there, I'm (24F0 a native US English speaker looking for crosstalk in Spanish (so I'd speak English, you'd speak Spanish back). I could try to speak Spanish, but my Spanish is pretty basic (I understand a lot though, that's why I want to stick to crosstalk for now). If that's something you'd be interested in feel free to message me :)", "created_utc": "1649173783.0", "edited": "False", "id": "i3i537b", "is_submitter": "False", "link_id": "t3_tviazo", "parent_id": "t3_tviazo", "score": "1", "subreddit": "language_exchange", "subreddit_id": "t5_2tdbm"}, {"author": "emcuttsy", "body": "Hey Alan — I'm (24F) an English native speaker and can speak German comfortably at B2-C1. I'm looking for crosstalk in Spanish (you'd speak Spanish and I'd respond in English). If you're potentially interested in crosstalk let me know! We can chat about the struggle of learning German haha. Feel free to message me!", "created_utc": "1649173384.0", "edited": "False", "id": "i3i44nm", "is_submitter": "False", "link_id": "t3_tw4eri", "parent_id": "t3_tw4eri", "score": "1", "subreddit": "language_exchange", "subreddit_id": "t5_2tdbm"}, {"author": "emcuttsy", "body": "I'm (24F, United States) looking for crosstalk in Spanish — chatting where I'd speak in English and you in Spanish the whole time. If that's something you're interested in, let me know! I understand Spanish well when speakers are patient and rephrase/slow down if I didn't understand something, but I don't speak confidently so I'm just looking for crosstalk for now :)", "created_utc": "1649173266.0", "edited": "False", "id": "i3i3vk8", "is_submitter": "False", "link_id": "t3_twc3dp", "parent_id": "t3_twc3dp", "score": "1", "subreddit": "language_exchange", "subreddit_id": "t5_2tdbm"}, {"author": "emcuttsy", "body": "Hey there, I'm (24F) looking for crosstalk in Spanish (I'd speak English, you answer in Spanish instead of 50/50 splitting Spanish and English). I'm about A2 in Spanish speaking but can understand materials made for B2+ haha. Feel free to shoot me a message if you're still looking for English exchange and might be interested :)", "created_utc": "1649172898.0", "edited": "False", "id": "i3i30bp", "is_submitter": "False", "link_id": "t3_twkeja", "parent_id": "t3_twkeja", "score": "2", "subreddit": "language_exchange", "subreddit_id": "t5_2tdbm"}, {"author": "emcuttsy", "body": "Hello, I'm a native US English speaker looking to improve my Spanish (A2 speaking, B1+ understanding, it's easy for me to understand native speakers who speak slowly and rephrase things in Spanish if I didn't understand something the first time). \n\nI'm mainly looking for crosstalk (you'd speak in Spanish, I'd respond in English the whole time), so I'm not sure if that is interesting to you. If so, let me know. I'd be available to meet for 1 hour a day most days of the week. \n\nA bit about me: I'm 24 F, studied biology and geology and work as a science journalist (this summer I'll be at Voice of America, which is one reason I want to improve my spanish!). I speak German too and am learning Italian and Spanish. I'm into science, languages, and really anything nerdy.", "created_utc": "1649171696.0", "edited": "False", "id": "i3hzvsi", "is_submitter": "False", "link_id": "t3_twpjxw", "parent_id": "t3_twpjxw", "score": "2", "subreddit": "language_exchange", "subreddit_id": "t5_2tdbm"}, {"author": "emcuttsy", "body": "I have a new blog design and url structure, check it out here: https://www.monoglotanxiety.com/post/german-anki-template/", "created_utc": "1640507396.0", "edited": "False", "id": "hq09mcl", "is_submitter": "True", "link_id": "t3_luwqc5", "parent_id": "t1_hq082us", "score": "2", "subreddit": "German", "subreddit_id": "t5_2qq51"}, {"author": "emcuttsy", "body": "What I mean with the hormones and bio thing (i consider myself a feminist too) is that its often a red flag that someone is a mysogynist if they go on a lot about women being too \"hormonal\" for things or using our biology (esp periods and pregnancy) as a reason to deny rights. I think, rightfully, it's become something of a touchy subject for that reason. I've found that this justified sensitivity to these themes can sometimes mean that discussing things like how real PMS mood swings can be due to hormones and the reality that periods can sometimes really make someone less productive at work than an otherwise equivalent man might be (does for me...) can get a little touchy.", "created_utc": "1631107102.0", "edited": "False", "id": "hc202vt", "is_submitter": "False", "link_id": "t3_pjjn57", "parent_id": "t1_hc1xcad", "score": "1", "subreddit": "AskWomen", "subreddit_id": "t5_2rxrw"}, {"author": "emcuttsy", "body": "Yikes, c diff is no joke. Glad your primary care doctor caught it, he sounds great.", "created_utc": "1631065581.0", "edited": "False", "id": "hc0aaky", "is_submitter": "False", "link_id": "t3_pjjn57", "parent_id": "t1_hby9bi9", "score": "2", "subreddit": "AskWomen", "subreddit_id": "t5_2rxrw"}, {"author": "emcuttsy", "body": "The sad thing is we can't even blame this on there not being enough female doctors. I've actually received the least thoughtful treatment for reproductive issues from women. The men I've dealt with at least know they don't know shit when you start talking about your uterus and they shut up and listen and try to be helpful.\n\nI truly struggle to wrap my head around why this is the way it is. And as a scientist, I'm sad to say I think at least some of it has to do with the research cycle. Publish or perish, and women and female lab animals take longer (and a lot more money) to properly study because of our cycles. The \"lifespan\" of a typical PhD student (so the lifespan of a typical long-ish term research paper) is usually no longer than 5 years. Much easier to just treat us as \"weird men\" and move on...", "created_utc": "1631065362.0", "edited": "False", "id": "hc09tnv", "is_submitter": "False", "link_id": "t3_pjjn57", "parent_id": "t1_hby358c", "score": "3", "subreddit": "AskWomen", "subreddit_id": "t5_2rxrw"}, {"author": "emcuttsy", "body": "Wow. This rings so many bells. I still haven't forgiven my parents and psychiatrist entirely for putting me on citalophram at 8. I was on it until 20 when I decided to go off on my own. They told my mom it'd be temporary, but nobody ever followed up with me to see if it was still necessary despite being in shrinks' offices all through childhood and young adulthood.  I still wonder about the person I would have become if I hadn't been on it.", "created_utc": "1631065029.0", "edited": "False", "id": "hc09425", "is_submitter": "False", "link_id": "t3_pjjn57", "parent_id": "t1_hby6end", "score": "2", "subreddit": "AskWomen", "subreddit_id": "t5_2rxrw"}, {"author": "emcuttsy", "body": "Endometriosis is one of those things that I just can't believe we don't have better treatments for in 2021. We can land dudes on the moon, but we can't stop \\~10% of women—5% of HUMANS—from having to deal with this potentially devastating condition...", "created_utc": "1631064865.0", "edited": "False", "id": "hc08r8s", "is_submitter": "False", "link_id": "t3_pjjn57", "parent_id": "t1_hbxrls3", "score": "2", "subreddit": "AskWomen", "subreddit_id": "t5_2rxrw"}, {"author": "emcuttsy", "body": "Right? I guess we all have a lot of skin in the game at this point. Talking bad about the pill raises red flags for feminists and acknowledges that women having hormones and reproductive biology is a thing, which also can raise red flags in certain feminist circles. Talking bad about the pill threatens men's access to consequence-free sex. Talking bad about the pill makes you look like you're whining and threatening something important to women who do fine on it. Talking bad about the pill implies that doctors have either been negligent at worse or ignorant at best. Talking bad about the pill and demanding that research account for  women's reproductive biology makes science harder and more expensive. When I think about it that way, of course this happens... doesn't make it okay.", "created_utc": "1631064654.0", "edited": "False", "id": "hc08b30", "is_submitter": "False", "link_id": "t3_pjjn57", "parent_id": "t1_hbyu9uw", "score": "2", "subreddit": "AskWomen", "subreddit_id": "t5_2rxrw"}, {"author": "emcuttsy", "body": "Doctors ignored my IUD problems too. Some people do great on the IUD apparently, but I haven't met anyone who's had a positive experience in real life. All of the women I know who got it, hormonal or copper, either \"naturally\" expelled it (cosmically painful) or had it removed within the first year because of the intolerable side effects. You're not alone.", "created_utc": "1631064347.0", "edited": "False", "id": "hc07neq", "is_submitter": "False", "link_id": "t3_pjjn57", "parent_id": "t1_hbxdrfk", "score": "2", "subreddit": "AskWomen", "subreddit_id": "t5_2rxrw"}, {"author": "emcuttsy", "body": "\"Mood changes\" doesn't cover it. Even if it is on the detailed print labeling, having a doctor tell you that you're imagining things when you report a side effect that \\*is\\* on the labeling isn't okay. Also, it's very hard to identify that your personality is changing while it is happening to you, since it feels like you (it \\*is\\* you in some ways, your hormones are a major part of how the brain works to construct its experience of itself). Without being told how to watch for these things, it's hard to catch them, or at least it was for me and plenty of others anectdotally. When a doctor tells you you're imagining it, it's basically impossible...", "created_utc": "1631060471.0", "edited": "False", "id": "hbzzb7o", "is_submitter": "False", "link_id": "t3_pjjn57", "parent_id": "t1_hbz35mq", "score": "1", "subreddit": "AskWomen", "subreddit_id": "t5_2rxrw"}, {"author": "emcuttsy", "body": "God that sounds like a nightmare. I'm glad you had the confidence and medical knowledge to make wise decisions for yourself even when docs weren't listening.  I was \"lucky\" in that my doctors didn't refuse to take mine out, they just subtly gaslit me into thinking I shouldn't. The one who was finally assigned to do it for me was actually understanding (she was not my point of care through the whole thing, just the first person they could find once I started getting pushy) and seemed almost sad at how defensive I'd had to become about the whole thing.", "created_utc": "1631060325.0", "edited": "False", "id": "hbzyzp2", "is_submitter": "False", "link_id": "t3_pjjn57", "parent_id": "t1_hbz7583", "score": "2", "subreddit": "AskWomen", "subreddit_id": "t5_2rxrw"}, {"author": "emcuttsy", "body": "It is baffling how professionals don't seem to know or care to tell us about this. Weirdly, I've actually found more curiosity about my experience and support from my older male therapist than i ever did from female providers, i think because he's aware he doesn't know everything about how women work and can't project his own experience onto me. He's been nothing but curious and sympathetic as i talked to him about the research -- but it's also a bit scary to me that if a woman came in with depression linked to the pill, he would never even know to ask about her birth control.", "created_utc": "1631022161.0", "edited": "False", "id": "hbxhsqo", "is_submitter": "False", "link_id": "t3_pjjn57", "parent_id": "t1_hbxdgf7", "score": "8", "subreddit": "AskWomen", "subreddit_id": "t5_2rxrw"}, {"author": "emcuttsy", "body": "I read her book after looking through the literature a bit myself -- I'm a researcher so my first instinct is always to Google scholar stuff. The lit i saw immediately raised red flags because some things my doc told me were just clearly not supported by the science (i.e., IUD hormones being 'localized' to the uterus when they can actually e measured in blood serum and also hair i believe... albeit at lower concentrations than with the pill). That opened my eyes to the possibility that i wasn't getting the whole story and following the citations from Hill's book took me the rest of the way.", "created_utc": "1631021999.0", "edited": "False", "id": "hbxhguv", "is_submitter": "False", "link_id": "t3_pjjn57", "parent_id": "t1_hbxf0wk", "score": "7", "subreddit": "AskWomen", "subreddit_id": "t5_2rxrw"}, {"author": "emcuttsy", "body": "Right? I'm not advocating for a ban on birth control at all, but doctors NEED to be honest about what can happen and take our concerns seriously. If even 1 of the 4 doctors who have prescribed it to me over the years had told me to tell a few people that I started a new birth control and to watch out for behavior changes, I would have literally years of my life back.\n\nEdit: There are so many pills and so if one doesn't work, there's always more to try if a woman is up for it. But there's no way I'm going through that process of tinkering with my mind and body without   feeling supported and listened through the process.", "created_utc": "1631019044.0", "edited": "1631019226.0", "id": "hbxbpa0", "is_submitter": "False", "link_id": "t3_pjjn57", "parent_id": "t1_hbxb8aq", "score": "10", "subreddit": "AskWomen", "subreddit_id": "t5_2rxrw"}, {"author": "emcuttsy", "body": "Every time I've had an issue with birth control, I was basically \"uh huh, ok that's veeeerrrrrry interesting...\"'d into thinking i was insane. I wasn't.  After 10 months of nonstop bleeding (\"spotting\" stf it's not spotting if it never stops) on the Mirena IUD, abdominal pain, feeling like i couldn't empty my bladder, and the the worst depression and anxiety I've ever experienced i finally stood my ground and got the demon plastic removed. I felt like myself again almost immediately...\n\nIts happening again to a friend of mine who started the combined pill two months ago and immediately felt depressed, paranoid, and insane a way she hadn't ever before. Doc and psychologist didn't listen to her, instead prescribed antidepressants to fix it, then an anxiety med for the problems the antidepressant caused, and then a sleeping pill for the anxiety med...\n\n... Nobody ONCE told her that birth control can Impact mental health. She only knew that because i told her. Women should not be finding this out by chance because a friend has done the digging. Doctors need to tell us to look out for things like this so we can find what works best for us without losing our sense of who we are 🙃", "created_utc": "1631018603.0", "edited": "1631022433.0", "id": "hbxawef", "is_submitter": "False", "link_id": "t3_pjjn57", "parent_id": "t3_pjjn57", "score": "53", "subreddit": "AskWomen", "subreddit_id": "t5_2rxrw"}, {"author": "emcuttsy", "body": "Now that I think of it, I've found that my boyfriend (edit: native speaker, Austria) usually uses the passive to impose a layer of ironic seriousness over joke statements.\n\nFor instance, he'll yell something like *\"ES WIRD GEKUSCHELT!!!\"* at his dog when she tries to squirm away from an unwanted hug.", "created_utc": "1618585828.0", "edited": "False", "id": "guqdjf9", "is_submitter": "False", "link_id": "t3_mrx1yl", "parent_id": "t3_mrx1yl", "score": "2", "subreddit": "German", "subreddit_id": "t5_2qq51"}, {"author": "emcuttsy", "body": "Is your country, perhaps, the good ol' US of A?\n\nJokey jokes aside, here's what I'd do if I were you. I started with Duolingo after getting fed up with being monolingual and grew into a self-study routine that I'm happy with. I hit B1 within about a year and am currently working towards C1 from B2.\n\n1. If you like Duolingo, keep using it. But only as a phone game. Don't consider it study time. Use it as a way to occupy your iThumbs when you feel like using your phone but not as a replacement for study.\n2. Use Anki to learn your core vocabulary. If you're a true beginner, you could a pre-made deck of core words to start. But I think making your own cards is almost always best. I have a free card template that automatically color-codes nouns by gender and makes fill-in-the-blank (\"cloze\") cards that might be helpful for you [https://www.monoglotanxiety.com/blog/the-best-german-anki-template/](https://www.monoglotanxiety.com/blog/the-best-german-anki-template/)\n3. Feed your Anki deck with additional cards relevant to your needs. Here are two easy ways to do this:\n   1. Get a grammar book and create flashcards based on the concepts you don't understand. The easiest and fastest way I've found to do this is to take 1-2 example sentences for a given concept and to turn them into cloze deletion cards in Anki.\n   2. Turn any mistakes you make while writing or speaking, or sentences that you don't understand while reading, into flashcards. Again, cloze deletions are a fast way to do this. Just copy-paste your mistake/the sentence into Anki and cloze the relevant parts.\n4. Up your passive listening/watching input as much as you possibly can. Podcasts, YouTube, TV, movies, audiobooks, whatever you can find that is 1) in German and 2) interesting to you. Don't worry if you don't understand entirely. So long as you enjoy listening/watching, keep going. So long as you enjoy listening/watching, keep going. If you're feeling extra ambitious, parrot the sounds you hear back while you're listening to or watching things in German.\n5. As soon as you can, start reading. People disagree on what's best to read at first, but IMO you should read the hardest things you can that you can while still enjoying it. I hate beginner stories so I skipped straight to struggling through Harry Potter with the audiobook to help me after about 3 months of vocab building with Duolingo. I'd rather fill in the parts of an interesting story that's a bit too hard for me to understand entirely based on knowing the context than read a kids book or the nth story for language learners about being an exchange student in Munich.\n6. Write write write. This is, IMO, the most helpful way you can actively study a language. Look up words you don't know and grammar concepts you don't understand as you go. Writing will show you where your weak points are. Also, you can get your writing corrected for free at LangCorrect [https://langcorrect.com/](https://langcorrect.com/journal/). Turn your mistakes into flashcards! Writing is a great way to practice productive language skills without needing to arrange for speaking time. You can get corrections on this sub as well, and on r/WriteStreakGerman\n7. Get a tutor on iTalki if you need motivation or speaking practice. German is a relatively expensive language to learn because of exchange rates, but you can still find good teachers for relatively cheap. Shop around before committing to a tutor. Find someone who will challenge you and teach you new things rather than just running through \"How's the weathery\" each conversation.\n8. Join conversation exchange sites if you like. Tandem is rather popular. I prefer working with tutors but some people really enjoy conversation exchanges. Whatever you choose, make sure you have a way to get speaking practice (if you want to speak, some people just want to learn to read/write).\n\nWhoof. Marathon post. Hope that wasn't too much. Of course you don't need to take any of my suggestions and I'm not a polyglot so maybe you shouldn't. But it kind of sounds like you're in a place where getting lots of different ideas could be helpful.\n\nWhatever you decide to do, don't stress too much. The way you study a language doesn't matter nearly as much as how often you study it. Just keep going and you \\*will\\* make progress.", "created_utc": "1618517066.0", "edited": "False", "id": "gun6rrx", "is_submitter": "False", "link_id": "t3_mrlhcq", "parent_id": "t3_mrlhcq", "score": "4", "subreddit": "German", "subreddit_id": "t5_2qq51"}, {"author": "emcuttsy", "body": "I've bought mine using a kindle from [amazon.com](https://amazon.com) (the US one). Be careful with [amazon.de](https://amazon.de). If you're buying Kindle books (or videos, etc.), you often can't get the content you paid for if you aren't in the appropriate country. It has to do with licensing laws. My boyfriend bought me a book for my birthday from Austria using [amazon.de](https://amazon.de) and I couldn't download it in the US because of this -.-", "created_utc": "1618500998.0", "edited": "False", "id": "gum5oe7", "is_submitter": "False", "link_id": "t3_mqvojy", "parent_id": "t3_mqvojy", "score": "2", "subreddit": "German", "subreddit_id": "t5_2qq51"}, {"author": "emcuttsy", "body": "Give it some time, but if class doesn't do it for you, there's no shame in going solo.  You could spend the money you put into class on tutors online instead to get speaking practice and motivation.", "created_utc": "1618498466.0", "edited": "False", "id": "gulzw1a", "is_submitter": "False", "link_id": "t3_mqslu3", "parent_id": "t3_mqslu3", "score": "1", "subreddit": "German", "subreddit_id": "t5_2qq51"}, {"author": "emcuttsy", "body": "\\^this is so real. I literally had to stop myself from sending the link to her recent video on vaccines to my anglophone friends who are afraid of getting the shot XD", "created_utc": "1618498153.0", "edited": "False", "id": "gulz6v3", "is_submitter": "False", "link_id": "t3_mqvafo", "parent_id": "t1_gukhze6", "score": "1", "subreddit": "German", "subreddit_id": "t5_2qq51"}, {"author": "emcuttsy", "body": "I think she does a pretty good job of admitting and explaining the limits of science, actually. At least as good as you'd expect from someone whose job it is to hype science. Much better than any English science YouTuber I've come across.", "created_utc": "1618498085.0", "edited": "False", "id": "gulz18l", "is_submitter": "False", "link_id": "t3_mqvafo", "parent_id": "t1_gukxsfh", "score": "1", "subreddit": "German", "subreddit_id": "t5_2qq51"}, {"author": "emcuttsy", "body": "German Science YouTube is awesome! maiLab and TerraX Lesch & Co are great and were a big part of motivating me to learn German at the beginning. I actually wrote a blog post about this about a month ago, maybe it could be helpful for you. [https://www.monoglotanxiety.com/blog/german-science-youtube-channels/](https://www.monoglotanxiety.com/blog/german-science-youtube-channels/)", "created_utc": "1618498015.0", "edited": "False", "id": "gulyvm5", "is_submitter": "False", "link_id": "t3_mqvafo", "parent_id": "t3_mqvafo", "score": "1", "subreddit": "German", "subreddit_id": "t5_2qq51"}, {"author": "emcuttsy", "body": "As a beginner I think you'd get a lot of use out of an Übungsgrammatik. They have exercises that you can do to test yourself. Not sure about one vs the other of the books you suggested. But having exercises is super useful.\n\nNot what you asked for but re: reading skills, I found it helpful to read along with audiobooks. That way you learn to really link pronunciation to writing.", "created_utc": "1618497545.0", "edited": "False", "id": "gulxup2", "is_submitter": "False", "link_id": "t3_mr8c09", "parent_id": "t3_mr8c09", "score": "4", "subreddit": "German", "subreddit_id": "t5_2qq51"}, {"author": "emcuttsy", "body": "I notice more German creeping into my English. The number of times I've reached for the word \"Verbot\" while speaking my own native English is stupid.", "created_utc": "1618497341.0", "edited": "False", "id": "gulxegv", "is_submitter": "False", "link_id": "t3_mrb8fm", "parent_id": "t3_mrb8fm", "score": "8", "subreddit": "German", "subreddit_id": "t5_2qq51"}, {"author": "emcuttsy", "body": "The best way I've found to learn new words is to write in German and note any time you reach for a word you don't have. Those are words you clearly need, but don't have. Doing this is a good way to make sure you learn words you actually use.\n\nAnd bonus, you get writing practice! If you're burnt out on vocab, writing is a great change of pace and super useful for getting a sense of and addressing your own weak points since it's a productive skill.\n\nTurn the words you \"reach for\" and need to look up into flashcards based on the context of the sentence you wrote---just making a cloze deletion in Anki with the word you had to look up removed is a fast way to do it. And it comes with context built-in. You can get your sentences corrected easily on LangCorrect to make sure they're right. I wrote a blog post on this recently in case you want to see an example of how I do this myself, but it's really just a long-winded rephrase of what I wrote here ;) [https://www.monoglotanxiety.com/blog/spaced-repetition-writing/](https://www.monoglotanxiety.com/blog/spaced-repetition-writing/)", "created_utc": "1618496873.0", "edited": "False", "id": "gulwd8s", "is_submitter": "False", "link_id": "t3_mr6w03", "parent_id": "t3_mr6w03", "score": "1", "subreddit": "German", "subreddit_id": "t5_2qq51"}, {"author": "emcuttsy", "body": "Oof. Though to be fair to your mom, about a year after I started studying German I ended up with an Austrian boyfriend and we've been together for a year now, so the possibility of a language opening up new relationship possibilities for you is definitely real XD. Just maybe not... a threat... \n\n\\*ahem\\* anyways.\n\nDo you need to convince her? Once you're in college, you'll have a safe layer of distance from your family. This honestly seems like one of those cases where you should just live your life on your own and accept that your parents just aren't going to get it.\n\nEven if your parents would do something as bonkers as refusing to pay your tuition if you minor in Korean or Japanese, you can still do plenty of things while at uni that they'll have no idea about. For instance:\n\n* auditing Korean and Japanese classes (won't show up on your transcript)\n* joining Korean and Japanese clubs\n* joining Korean and Japanese meetups in town\n* making friends with Korean and Japanese exchange students through your uni\n* taking Korean and Japanese certification exams\n* self-studying\n\nGetting a minor could be fun for you, but you can still learn Korean and Japanese during college without minoring. And you can still take advantage of a ton of resources related to Korean/Japanese while at uni. \n\nIf you take high-level exams and can clearly communicate fluently, it shouldn't really matter career-wise if you have a transcript full of courses or not. So once your mom can't literally observe and micromanage your time, who cares if she's on your side. You're about to take a big step into adulthood, enjoy the freedom to do what you want (within reason) that comes with that.", "created_utc": "1618496063.0", "edited": "False", "id": "gulul63", "is_submitter": "False", "link_id": "t3_mre0m3", "parent_id": "t3_mre0m3", "score": "8", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "emcuttsy", "body": "Hammer's German Grammar and Usage \n\nAnd then consider an Übungsgrammatik of some kind.", "created_utc": "1615639258.0", "edited": "False", "id": "gqsl7xz", "is_submitter": "False", "link_id": "t3_m3vyb6", "parent_id": "t3_m3vyb6", "score": "1", "subreddit": "German", "subreddit_id": "t5_2qq51"}, {"author": "emcuttsy", "body": "Your experience will 100% depend on your tutor. Shop around for a bit to find one that clicks with you. I tried 3 before settling on the tutor I work with now.", "created_utc": "1615639194.0", "edited": "False", "id": "gqsl54j", "is_submitter": "False", "link_id": "t3_m3vw7g", "parent_id": "t3_m3vw7g", "score": "2", "subreddit": "German", "subreddit_id": "t5_2qq51"}, {"author": "emcuttsy", "body": "Steiner & Madlaina", "created_utc": "1615387342.0", "edited": "False", "id": "gqg70xq", "is_submitter": "False", "link_id": "t3_m1ye0s", "parent_id": "t3_m1ye0s", "score": "5", "subreddit": "German", "subreddit_id": "t5_2qq51"}, {"author": "emcuttsy", "body": "If you're losing the drive to learn, take a step back and ask why you're learning German in the first place. Odds are, it has something to do with communicating with/experiencing the culture of German-speakers, right? My advice on the motivation front is to go find stuff in German that you love--TV, books, music, blogs, movies, podcasts, whatever---and soak in it as much as you can. Media is good reminder that there's a living language out there to experience (and has the bonus of helping you learn German faster). It's also super motivating to see all the great media out there that you couldn't understand before but now understand at like 60%, and to know that if you study a bit more you can get it to 70%, 80% 90%, and eventually 100%.\n\nFor faster learning during your \"real\" study time (i.e. not passive learning), I really recommend using vocabulary flashcards. It's not anything fancy, but it works. And the more words you know, the more exciting media you can consume. Check out Anki if you haven't already. I have a deck here of 1000 words I've been working on for a while ([https://ankiweb.net/shared/info/554728127](https://ankiweb.net/shared/info/554728127)), and the template I made for that deck (linked in the deck description) is reusable and does all kinds of nifty things like automatically color-code and create fill-in-the-blank cards.\n\nFor grammar, you could follow one of the DW courses if you're below B2, and it'd never be a bad idea to pick up a grammar book. Hammer's German Grammar and Usage is a classic, and then there are all the various Übungsgrammatik books that combine grammar explanations with workbook exercises.\n\nOne last super motivating, super helpful thing for me was to get a tutor. It's hard to slack when you know you're meeting someone 1/week to help with your German, and it's exciting to actually use the language instead of studying it.\n\nHope that helps. But like the others say, just keep with it. Motivation slumps are super normal.", "created_utc": "1615275622.0", "edited": "False", "id": "gqb0t8w", "is_submitter": "False", "link_id": "t3_m0sbbu", "parent_id": "t3_m0sbbu", "score": "1", "subreddit": "German", "subreddit_id": "t5_2qq51"}, {"author": "emcuttsy", "body": "Intermediate is where it gets hard, since \"resources\" tend to be most useful for beginners and making the jump from intermediate to advanced has a lot to do with building fluency (a squishy concept) rather than hitting the bullet points on a list of grammar topics.\n\nIf your classes have given you a reasonable understanding of German grammar, then I'd focus mostly on vocabulary building and productive skills (speaking/writing). Here are some suggestions based on how I study those things:\n\n1. Get a tutor and meet weekly for conversation practice \\*and to correct your writing.\\* It's so, so helpful to get writing corrected live, and it makes for a conversation topic. I found a great tutor on iTalki, but there are of course other ways to find them.\n2. If you don't want to get a tutor, find someone else to talk to. There are free conversation exchange sites, and apps like Tandem that people use to practice languages.\n3. Drill vocabulary every day with flashcards on your phone. I use Anki and love it. There are some decent free decks, and I have a flashcard template that automatically color-codes nouns by gender and makes fill-in-the-blank cards in case you'd prefer to make your own: [https://www.monoglotanxiety.com/blog/the-best-german-anki-template/](https://www.monoglotanxiety.com/blog/the-best-german-anki-template/) Make sure you have your basic vocab (especially verbs) down, and start sprinkling in the harder words you encounter in German media as you go. I made this deck for myself: [https://ankiweb.net/shared/info/554728127](https://ankiweb.net/shared/info/554728127). There are plenty more free ones on Ankiweb, some leveled by A1-B2 etc.\n4. Write a lot and get your writing corrected by native speakers. I do this with my iTakli tutor but there are also online resources for this that work great. LangCorrect usually has a good turnaround time for corrections on things that aren't too long. There's also r/WriteStreakGerman and this sub.\n5. Consume a ton of German media. Finding artists/shows/movies/books that you love is super motivating. It also exposes you to a lot of vocabulary and helps with getting an intuitive feel for grammar. (If you haven't already seen them, I highly recommend Dark and How to Sell Drugs Online Fast on Netflix)\n\nThat's it. Best of luck, I hope this helps!", "created_utc": "1615275030.0", "edited": "False", "id": "gqb066s", "is_submitter": "False", "link_id": "t3_m10dkn", "parent_id": "t3_m10dkn", "score": "5", "subreddit": "German", "subreddit_id": "t5_2qq51"}, {"author": "emcuttsy", "body": "Ah awesome, thanks. :)", "created_utc": "1615274221.0", "edited": "False", "id": "gqaz92v", "is_submitter": "False", "link_id": "t3_m0o3t5", "parent_id": "t1_gqas63t", "score": "1", "subreddit": "German", "subreddit_id": "t5_2qq51"}, {"author": "emcuttsy", "body": "Not 100% of the reason, but Faun was a big help in the beginning. Was a big D&D nerd back in the day and loved their mythology references and mix of modern and medieval/renaissance instruments.\n\nNow that I understand the lyrics better I find a lot of it super cringe. I almost can't listen anymore. But there will always be a corner of my heart that lights up for the hurdy gurdy.", "created_utc": "1615237043.0", "edited": "False", "id": "gq9654d", "is_submitter": "False", "link_id": "t3_m0o3t5", "parent_id": "t3_m0o3t5", "score": "6", "subreddit": "German", "subreddit_id": "t5_2qq51"}, {"author": "emcuttsy", "body": "Three good science channels are Mailab, Dinge Erklärt (Kurzgesagt), and TerraX Lesch & Co. Psychologeek is great if you like psychology. MrWissen2Go is good for history and society. Not exactly science or law, but kind of in a similar vein are Too Many Tabs and Strng\\_F.\n\nYou might also like Neo Magazin Royale if your German is at least intermediate. It's essentially Last Week Tonight but for Germany (and often funnier I think). The cancelled Austrian counterpart is Gute Nacht Österreicht, which I really enjoyed until it was recently de-funded out of existence.", "created_utc": "1615021763.0", "edited": "False", "id": "gpwijlg", "is_submitter": "False", "link_id": "t3_lyn85x", "parent_id": "t3_lyn85x", "score": "3", "subreddit": "German", "subreddit_id": "t5_2qq51"}, {"author": "emcuttsy", "body": "Getting a good tutor could be cheaper and more personalized than taking a class, as a potential alternative. But practicing talking to real people from the get-go, no matter how you do it, is a really really good idea.", "created_utc": "1614885773.0", "edited": "False", "id": "gpoqnjv", "is_submitter": "False", "link_id": "t3_lxopkl", "parent_id": "t1_gpo44rf", "score": "2", "subreddit": "German", "subreddit_id": "t5_2qq51"}, {"author": "emcuttsy", "body": "Yup! God I love flashcards.\n\nHere's my deck of 1000 words, it's still a draft. Adding audio and images soon: [https://ankiweb.net/shared/info/554728127](https://ankiweb.net/shared/info/554728127)  . The cards are color-coded by noun gender and verb irregularity and  have cloze deletions. The card format does all that stuff automatically.  \n\nHere's a spreadsheet in case that's a better format for you: [https://docs.google.com/spreadsheets/d/1wHShysTNtzyenqjx1OMXvQtLhajInV1cCemzkuORh04/edit?usp=sharing](https://docs.google.com/spreadsheets/d/1wHShysTNtzyenqjx1OMXvQtLhajInV1cCemzkuORh04/edit?usp=sharing)\n\nThe flashcard format I used for that deck is this one, in case you prefer to build your own decks: [https://www.monoglotanxiety.com/blog/the-best-german-anki-template/](https://www.monoglotanxiety.com/blog/the-best-german-anki-template/)\n\nAlso, see these lists of A1-B2 words from Goethe:\n\n* [https://www.goethe.de/lhr/pro/daz/dfz/dtz\\_Wortliste.pdf](https://www.goethe.de/lhr/pro/daz/dfz/dtz_Wortliste.pdf) (A1-B2)\n* [https://www.goethe.de/pro/relaunch/prf/de/Goethe-Zertifikat\\_B1\\_Wortliste.pdf](https://www.goethe.de/pro/relaunch/prf/de/Goethe-Zertifikat_B1_Wortliste.pdf) (B1)\n* [https://www.goethe.de/pro/relaunch/prf/de/Goethe-Zertifikat\\_A2\\_Wortliste.pdf](https://www.goethe.de/pro/relaunch/prf/de/Goethe-Zertifikat_A2_Wortliste.pdf) (A2)\n* [https://www.goethe.de/pro/relaunch/prf/de/A1\\_SD1\\_Wortliste\\_02.pdf?fbclid=IwAR22e33alYsAZrYw0suPL6J6RUA6OrYwyA-5uRoc29LqgoRWmTFc6oOJqiQ](https://www.goethe.de/pro/relaunch/prf/de/A1_SD1_Wortliste_02.pdf?fbclid=IwAR22e33alYsAZrYw0suPL6J6RUA6OrYwyA-5uRoc29LqgoRWmTFc6oOJqiQ)\n\nEDIT:  also, if you have a grammar book or Übungsgrammatik,  look for word  lists in those. They usually contain some really great tables of words,  usually the important ones that are grammatically tricky. I've found  them to be a great source for verbs.", "created_utc": "1614885541.0", "edited": "False", "id": "gpoq36z", "is_submitter": "False", "link_id": "t3_lxko35", "parent_id": "t3_lxko35", "score": "3", "subreddit": "German", "subreddit_id": "t5_2qq51"}, {"author": "emcuttsy", "body": "So long as you enjoy it, yes. This is basically how I got to A2 haha. Of course, doing other stuff helps. If you learn a bunch of vocab it'll help you with your TV adventures. Grammar can wait, you don't need it to follow a TV plot. And you'd be surprised how much grammar you'll pick up by osmosis if you watch a lot of TV---for instance, I never formally learned German word order, but I rarely mess it up now (at least in the writing I get corrected) even though I'm 100% going on \"feel.\"\n\nJust be sure to turn on German subtitles so you learn to map spelling to sound, and you'll be golden.", "created_utc": "1614884888.0", "edited": "False", "id": "gpooj18", "is_submitter": "False", "link_id": "t3_lxl622", "parent_id": "t3_lxl622", "score": "1", "subreddit": "German", "subreddit_id": "t5_2qq51"}, {"author": "emcuttsy", "body": "I wish my brain was as helpful as yours. When I wake up in the middle of the night, the only thing on my mind is usually \"I really need to stop drinking a full glass of water before going to sleep.\"", "created_utc": "1614707944.0", "edited": "False", "id": "gpft6tq", "is_submitter": "False", "link_id": "t3_lw6nfm", "parent_id": "t3_lw6nfm", "score": "63", "subreddit": "German", "subreddit_id": "t5_2qq51"}, {"author": "emcuttsy", "body": "r/de is the collection pile for all things related to German-speaking countries. Most of the time posts are in German. Not a language-learning sub, don't ask for corrections/help there. Good source of articles.\n\nr/Austria and r/Switzerland are the subs for Austria and Switzerland. r/Austria is a lot of memes right now, but that's totally in character and there's plenty of other stuff too.  \n\nr/WriteStreakGerman for writing practice, r/DEreads for articles, r/germusic for german music, r/FragReddit for the german version of ask reddit.", "created_utc": "1614704832.0", "edited": "False", "id": "gpfm1n5", "is_submitter": "False", "link_id": "t3_lw6x4t", "parent_id": "t3_lw6x4t", "score": "4", "subreddit": "German", "subreddit_id": "t5_2qq51"}, {"author": "emcuttsy", "body": "At the A1-A2 level you can make a lot of progress really fast. And, in general, I think people benefit from jumping into the deepest end of the pool they can manage. Your brain is stretchy and will adapt to the challenges you give it, so long as they're not literally impossible. Talking with other speakers who are better than you will make you better.\n\nHammer's is a good friend to have for this, and if you use it to supplement your coursework you'll probably understand things better than your peers by the end.\n\nGrowing your vocab fast will probably be the biggest deal for keeping up, so either binge a ton of Duolingo/Memrise, or, better, start using Anki to specifically learn the vocabulary lists that show up in your course.\n\nAlso, what's the worst that can happen? If you end up needing to repeat the course once, then that's essentially the same outcome as having dropped down to A1. So long as you stay motivated and feel like you're getting something out of the course, I say stick with it.", "created_utc": "1614695298.0", "edited": "False", "id": "gpf15ye", "is_submitter": "False", "link_id": "t3_lw13pk", "parent_id": "t3_lw13pk", "score": "3", "subreddit": "German", "subreddit_id": "t5_2qq51"}, {"author": "emcuttsy", "body": "Love the kangaroos in your flair haha. The Austrian national animal.", "created_utc": "1614694906.0", "edited": "False", "id": "gpf0dmq", "is_submitter": "False", "link_id": "t3_lw0gsu", "parent_id": "t1_gpephzj", "score": "29", "subreddit": "German", "subreddit_id": "t5_2qq51"}, {"author": "emcuttsy", "body": "Depends on the teacher. My boyfriend is Austrian, and his dialect literally sounded like a different language the first time I heard it. Now I love it, Austrian dialects are awesome. But Austrian standard German isn't like that. It's perfectly comprehensible. \n\nMy iTalki tutor is also Austrian, but she speaks Austrian Standard German with me and is aware of the differences between German Standard German and Austrian Standard German. It mostly comes down to a few different words here and there (and sometimes one choice of gender vs the other for some more ambiguous/less agreed-upon noun genders), but the pronunciation is similar enough that most non-natives probably won't tell the difference. \n\nGermans have dialects too. Get an Austrian tutor if you like her. \n\nAnd side-bonus: getting familiar with Austria isn't something a lot of German learners get to do, since all of the material for us is so focused on Germany. There's a looot of pretty awesome, often hilarious Austrian stuff out there, and if you ever get to a point where you can understand dialect, it really just gets better and better.", "created_utc": "1614694796.0", "edited": "False", "id": "gpf05x2", "is_submitter": "False", "link_id": "t3_lw0gsu", "parent_id": "t3_lw0gsu", "score": "11", "subreddit": "German", "subreddit_id": "t5_2qq51"}, {"author": "emcuttsy", "body": "Hope it helps :)", "created_utc": "1614694336.0", "edited": "False", "id": "gpez9wg", "is_submitter": "False", "link_id": "t3_lvfuv6", "parent_id": "t1_gpey1ap", "score": "2", "subreddit": "German", "subreddit_id": "t5_2qq51"}, {"author": "emcuttsy", "body": "No worries, glad you like it :)", "created_utc": "1614694266.0", "edited": "False", "id": "gpez568", "is_submitter": "False", "link_id": "t3_lvl24x", "parent_id": "t1_gpdfaxz", "score": "1", "subreddit": "German", "subreddit_id": "t5_2qq51"}, {"author": "emcuttsy", "body": "Now that you have the example deck, you should be able to add cards of the same \"Note Type\" (I think its called MonoglotAnxiety) to any other decks as well. \n\nThere should be a button called \"Type\" at the top of the input dialog window, and you can select whatever note type you want for a card in any deck using that :) [https://imgur.com/OSanHHi](https://imgur.com/OSanHHi) <-- example of the input window, the cursor is above the button you want.", "created_utc": "1614652020.0", "edited": "False", "id": "gpddu11", "is_submitter": "False", "link_id": "t3_lvl24x", "parent_id": "t1_gpd5d3o", "score": "2", "subreddit": "German", "subreddit_id": "t5_2qq51"}, {"author": "emcuttsy", "body": "Welcome to grammar hell I mean German.\n\nFor grammar: get an A1-A2 level Übungsgrammatik. They're grammar books that have accompanying practice exercises and are just awesome.  The big bad grammar book I always recommend if you're into grammar is Hammer's German Grammar and Usage.\n\nFor vocabulary: Duolingo can get you to low A2, but if you're willing to do Anki instead, Anki is way more flexible and will grow with you. There are tons of [free flashcard decks on Ankiweb](https://ankiweb.net/shared/decks/german). I used Duo for A1-A2 though, and it was good enough. Just don't use it in place of studying other resources, think of it more like an add-on.\n\nYou can also use Anki to drill grammar topics. Cloze deletion cards are a good way to quiz yourself on things like case endings.\n\nFor structure/coursework: [DW has some great free courses for learners](https://learngerman.dw.com/en/overview). Check those out if you need structure. Otherwise, I found it helpful to just look at the syllabi for a few different German courses and self-teach the topics covered. Here are two: ([1](https://kapitel-zwei.de/en/course-content/))([2](https://www.actilingua.com/en/german-language-course-content/levels/))\n\nFor immersion: Slow German, News in Slow German, and Coffee Break German are all good podcasts for beginners. There are also podcasts from DW made for learners as well. I really recommend Slow German, it's great and you don't feel like a baby listening to it.\n\nEDIT: Toms Deutschseite looks super old, but its good for learning grammar and seeing the relevant topics [http://www.deutschseite.de/](http://www.deutschseite.de/)", "created_utc": "1614648430.0", "edited": "False", "id": "gpd71yj", "is_submitter": "False", "link_id": "t3_lvfuv6", "parent_id": "t3_lvfuv6", "score": "2", "subreddit": "German", "subreddit_id": "t5_2qq51"}, {"author": "emcuttsy", "body": "I've heard that any level of German helps with applying to jobs in Germany, even English-speaking ones. It proves to the company that you'll be willing to integrate. Higher is always better, of course.\n\nRe: tests. There are tests that are modular, meaning that you could aim for A2 but if you fail but still perform well enough for A1 you'd still get A1. I think Goethe is like this for the lower levels.", "created_utc": "1614647651.0", "edited": "False", "id": "gpd5kzp", "is_submitter": "False", "link_id": "t3_lvgsi1", "parent_id": "t3_lvgsi1", "score": "2", "subreddit": "German", "subreddit_id": "t5_2qq51"}, {"author": "emcuttsy", "body": "Just a thought, gamers might not be not...er... the most forgiving demographic to be vulnerable around 😅\n\nUpside: if you're brave enough to speak up on a game server, you're probably brave enough to speak up anywhere haha", "created_utc": "1614647294.0", "edited": "False", "id": "gpd4x3a", "is_submitter": "False", "link_id": "t3_lvon1v", "parent_id": "t3_lvon1v", "score": "11", "subreddit": "German", "subreddit_id": "t5_2qq51"}, {"author": "emcuttsy", "body": "I made that Anki format so I definitely recommend it haha. All it is is basically a template to make it easier to make nice cards: the card can identify the gender of nouns and color-code, highlight irregular verb forms, and--the most helpful thing imo--automatically create fill-in-the-blank ('cloze deletion') cards based on example sentences without you needing to do anything extra. \n\nI use that template to learn new words, and add cards to the deck when I make mistakes writing or speaking that my tutor points out. Also, I use [traditional Anki cloze deletions](https://docs.ankiweb.net/#/editing?id=cloze-deletion) to review sentences with tricky grammar that I've also made mistakes on. \n\nIts super convenient (there are phone apps and desktop versions), and I think a nice replacement for Duo after reaching B1+.\n\nThe blog post in the link has some examples of what cards look like, and you can download some example cards to test out the deck from [here](https://gumroad.com/l/saHJaW).", "created_utc": "1614646888.0", "edited": "False", "id": "gpd460t", "is_submitter": "False", "link_id": "t3_lvl24x", "parent_id": "t1_gpcyhco", "score": "2", "subreddit": "German", "subreddit_id": "t5_2qq51"}, {"author": "emcuttsy", "body": "Glad to hear I'm not totally off base in my advice haha. How have you found Aspekte? I haven't used any textbooks besides an Übungsgrammatik and have been wondering if I'm missing out on anything important there.", "created_utc": "1614642585.0", "edited": "False", "id": "gpcw3fo", "is_submitter": "False", "link_id": "t3_lvl24x", "parent_id": "t1_gpcui0n", "score": "2", "subreddit": "German", "subreddit_id": "t5_2qq51"}, {"author": "emcuttsy", "body": "A note in addition to the other answers: \"bis\" can also mean \"by\" in the sense of \"I need to get this assignment done \\*by\\* next week.\" \n\nA mistake I hear German speakers make in English a lot is to say \"I need to get this assignment done \\*until\\* next week,\" probably because \"bis\" is used in this context in German.", "created_utc": "1614640296.0", "edited": "False", "id": "gpcrnwn", "is_submitter": "False", "link_id": "t3_lvjakp", "parent_id": "t3_lvjakp", "score": "3", "subreddit": "German", "subreddit_id": "t5_2qq51"}, {"author": "emcuttsy", "body": "I'm in a similar boat :) B2 working to C1. Not at C1, so take my advice with a grain of salt. But I'm seeing progress within B2 and this advice mirrors a lot I see around here. \n\nThe grammar books I've been using are Hammer's German Grammar and Usage and Übungsgrammatik für die Mittelstufe aktuell (German edition) by Hering, Matussek, and Perlmann-Balme. The latter has practice problems. Grammar gets important at the intermediate level.\n\nWrite a lot, and get your writing corrected by native speakers. LangCorrect is great for this. You can also post on this sub, or on r/WriteStreakGerman. If you work with a tutor, they can help correct your writing as well.\n\nI use Anki a lot, and it helps with learning a ton of vocabulary very quickly and replacing the phone app niche that Duolingo used to satisfy for me at lower levels. I've got a [card format](https://www.monoglotanxiety.com/blog/the-best-german-anki-template/) for German cards that might be helpful if you like Anki.\n\nAlso, if you don't have someone to talk with, tutors are a real help. Working with a tutor really sped up my progress and got me motivated. iTalki is one option. There are also places for free language exchange like Tandem.\n\nOther than that, listen, read, and watch lots of German media to fill in the times when you can't study actively. Find stuff you love to help motivate you and reinforce studying done elsewhere.\n\nGood luck! Excited to see what resources others post here :)", "created_utc": "1614639301.0", "edited": "False", "id": "gpcpp6q", "is_submitter": "False", "link_id": "t3_lvl24x", "parent_id": "t3_lvl24x", "score": "3", "subreddit": "German", "subreddit_id": "t5_2qq51"}, {"author": "emcuttsy", "body": "First, re: not understanding TV. Don't worry, just keep watching. My first German TV show was Dark, watched in German with German subtitles because I'm super stubborn and would rather understand like 10% of the speech than fall back on English. It doesn't make sense at first, but it gets better. You'd be surprised.\n\nRe: Duo. A few things:\n\n1. Duo won't teach you to speak. **Find someone to speak with, either on an app like Tandem for language exchange, or \\*better\\*, with a tutor.** iTalki has some great ones and they're not too expensive. I spent my first year of learning German not speaking and I regret it immensely, you learn so much faster once you start to speak. **And don't worry if you can barely talk**\\--I'm working with a Danish tutor right now and I can't really even hold a simple conversation without help, but its fine. The point is to get help.\n2. You need more words than Duolingo teaches you. **Replace or supplement Duolingo with Anki flashcards.** You can use Anki as a phone app so it can really 1:1 replace Duolingo. There are some [great free, decks on Ankiweb](https://ankiweb.net/shared/decks/german). If you're interested, I also have a [free flashcard template](https://www.monoglotanxiety.com/blog/the-best-german-anki-template/) for Anki that color-codes and makes fill-in-the-blank flashcards automatically.\n3. Edit: Write a lot, and get your writing corrected by native speakers. Either correct your work live with an iTalki tutor or submit it here, on r/WriteStreakGerman, or on LangCorrect to get corrections for free.\n4. Most important piece of advice: **find German media you love, and listen/watch/read it all the time, even if you don't understand everything.** This is the major thing. Maybe Spongebob is your favorite show but even if it is, you need stuff to listen to when you can't be in front of a TV, and I find it more motivating personally to watch shows that are originally in German than I do to watch shows that are originally in my native English anyways. Podcasts and music are great for passive learning, and they'll reinforce the vocabulary you learn with Duolingo or Anki.", "created_utc": "1614619791.0", "edited": "False", "id": "gpbiepg", "is_submitter": "False", "link_id": "t3_lusnni", "parent_id": "t3_lusnni", "score": "3", "subreddit": "German", "subreddit_id": "t5_2qq51"}, {"author": "emcuttsy", "body": "Ich wundere mich ob es vielleicht sogar schwieriger ist, sich an das richtige Genus zu erinnern, wenn man eine Muttersprache mit einem anderen Genussystem spricht. Es könnte verwirrend sein, wenn ein Nomen maskulin im Deutschen aber feminin in der anderen Sprache ist, zum Beispiel. Oder vielleicht auch nicht. Ich bin selber Amerikanerin und spreche nur Englisch. Aber ich habe mich an diese Frage oft darüber nachgedacht.", "created_utc": "1614614960.0", "edited": "False", "id": "gpb7ln3", "is_submitter": "False", "link_id": "t3_lvbprm", "parent_id": "t3_lvbprm", "score": "3", "subreddit": "German", "subreddit_id": "t5_2qq51"}, {"author": "emcuttsy", "body": "So there aren't official grammar requirements for each level. The A1-C2 scale is meant to work with all languages and is therefore based on what you can communicate, not what grammar you know. Every language school decides for itself what to teach each level, and tests don't explicitly ask grammar questions.\n\nBut that's not to say there aren't patterns though. These language schools both list out the grammar taught to each level on webpagesl:  [https://www.actilingua.com/en/german-language-course-content/levels/](https://www.actilingua.com/en/german-language-course-content/levels/) and [https://kapitel-zwei.de/en/course-content/](https://kapitel-zwei.de/en/course-content/)\n\nThis file is useful as well, it lists grammar subjects and shows differences between how speakers at each level would use them: [https://www.file-upload.net/download-12764678/SK\\_Strukturen-3.docx.html](https://www.file-upload.net/download-12764678/SK_Strukturen-3.docx.html) (taken from another [post](https://www.reddit.com/r/German/comments/76hmgc/what_grammar_topics_should_an_a1_a2_know_how/) on this sub)", "created_utc": "1614610484.0", "edited": "False", "id": "gpayabu", "is_submitter": "False", "link_id": "t3_lva184", "parent_id": "t3_lva184", "score": "2", "subreddit": "German", "subreddit_id": "t5_2qq51"}, {"author": "emcuttsy", "body": "There are also apps like Tandem and Hellotalk where people do conversation exchange for free. It won't be the same experience as a tutor but it can be motivating, although it sounds like you have a good source of casual conversation already.\n\nIf you want your writing corrected by natives for free, there's also LangCorrect :)", "created_utc": "1614607036.0", "edited": "False", "id": "gpartpi", "is_submitter": "False", "link_id": "t3_lunn62", "parent_id": "t1_gpa3rei", "score": "1", "subreddit": "German", "subreddit_id": "t5_2qq51"}, {"author": "emcuttsy", "body": "For grammar, I highly recommend **Hammer's German Grammar and Usage.** It's awesome. There are very useful tables that can be turned into Anki decks as well.\n\n You might also look into an Übungsgrammatik - they're basically grammar books with accompanying exercises. I've really liked **Übungsgrammatik für die Mittelstufe aktuell (German edition) by Hering, Matussek, and Perlmann-Balme.**\n\nI've had nothing but positive experiences with iTalki. But some tips for getting your money's worth: (1) discuss a new topic every lesson. Be up-front with your tutor about wanting more structure and find one who is willing to find you a new article/song/video/whatever to discuss each lesson so you get experience talking about a wide range of subjects, (2) find a tutor who will give you homework and correct your writing with you live during your lesson. It's incredibly helpful to have your errors noted live and noted down on paper instead of lost to conversation, (3) find someone who can be consistent. It's annoying to have to switch tutors all the time.\n\nIf you want, I can recommend my iTalki tutor in DMs. She's fantastic.", "created_utc": "1614548736.0", "edited": "False", "id": "gp8d0rk", "is_submitter": "False", "link_id": "t3_lunn62", "parent_id": "t3_lunn62", "score": "2", "subreddit": "German", "subreddit_id": "t5_2qq51"}, {"author": "emcuttsy", "body": "\"Um den heißen brei herumreden.\" Literally to talk around the hot porridge. In the US we almost always say \"oatmeal\" instead of porridge, which sounds even funnier. It basically means to talk around a subject, to avoid getting to the point. STOP TALKING AROUND THE OATMEAL AND GET TO THE POINT! \n\nI like it because its useful (describes a common situation) and because it has the hilarious property of translating well to an English saying that has nothing to do with the literal translation: \"beat around the bush\"", "created_utc": "1614190567.0", "edited": "False", "id": "goly7wl", "is_submitter": "False", "link_id": "t3_lrh86p", "parent_id": "t3_lrh86p", "score": "3", "subreddit": "German", "subreddit_id": "t5_2qq51"}, {"author": "emcuttsy", "body": "When I first started, I \\*hated\\* all the dumb beginner stories out there so much that I preferred to grit my teeth and only understand like 25% of the harder, better stuff. \n\nGod I wish there had been something like this for me back then. Texts for adult beginners don't need to be written with the plot of a toddler's picture book or rehash on the \"Protagonist is an exchange student in Munich\" story for the billionth time. \n\nWell done, thank you. I will definitely share this with anyone I know who's just getting started.", "created_utc": "1614183216.0", "edited": "False", "id": "golfyxd", "is_submitter": "False", "link_id": "t3_lrdxcx", "parent_id": "t3_lrdxcx", "score": "22", "subreddit": "German", "subreddit_id": "t5_2qq51"}, {"author": "emcuttsy", "body": "Danke! Deine Erklärungen sind super hilfreich :)", "created_utc": "1614177323.0", "edited": "False", "id": "gol35ho", "is_submitter": "True", "link_id": "t3_lr01jj", "parent_id": "t1_gokht5r", "score": "1", "subreddit": "German", "subreddit_id": "t5_2qq51"}, {"author": "emcuttsy", "body": "Woooops. Danke :)", "created_utc": "1614177236.0", "edited": "False", "id": "gol2zce", "is_submitter": "True", "link_id": "t3_lr01jj", "parent_id": "t1_gok6z18", "score": "1", "subreddit": "German", "subreddit_id": "t5_2qq51"}, {"author": "emcuttsy", "body": "Vielen Dank! :D", "created_utc": "1614177223.0", "edited": "False", "id": "gol2yfg", "is_submitter": "True", "link_id": "t3_lr01jj", "parent_id": "t1_gojxg57", "score": "1", "subreddit": "German", "subreddit_id": "t5_2qq51"}, {"author": "emcuttsy", "body": "[https://blog.fluent-forever.com/base-vocabulary-list/](https://blog.fluent-forever.com/base-vocabulary-list/) pretty sure its this one :)", "created_utc": "1614132066.0", "edited": "False", "id": "gojan62", "is_submitter": "False", "link_id": "t3_lqiehb", "parent_id": "t1_goj33uq", "score": "5", "subreddit": "German", "subreddit_id": "t5_2qq51"}, {"author": "emcuttsy", "body": "Is this the Fluent Forever word list?", "created_utc": "1614126297.0", "edited": "False", "id": "goizfbq", "is_submitter": "False", "link_id": "t3_lqiehb", "parent_id": "t3_lqiehb", "score": "2", "subreddit": "German", "subreddit_id": "t5_2qq51"}, {"author": "emcuttsy", "body": "Start thinking of Duolingo as a phone game to occupy your hands when you get that itch to pull out your phone, and start looking elsewhere for learning opportunities.\n\nGetting a tutor can be incredibly motivating. Take a look at iTalki, good ones aren't too expensive (and I can recommend mine in DMs if you want). \n\nMore motivation: find stuff in German that you love. Youtube channels, podcasts, TV, music, movies, books, blogs, whatever. Just find stuff in German that you want to consume. This is also the best way to learn sentence structure, IMO. Just consume a TON of sentences. I got to B1 with almost no formal study just by really going overboard on German media and soaking in it practically 24/7 (+ some Duolingo and some Anki flashcards). And when I get corrections on my German writing now, it's almost never sentence structure that is the problem (that's usually forgetting the genders of words, I feel your pain). I never memorized it, I just encountered enough sentences to get a sense for what feels wrong.\n\nTo learn gender of words, use Anki flashcards or some other flashcard system where you can drill nouns with their articles. It's not flashy, but it works. I have a flashcard format that will automatically color-code German nouns by gender (and do some other handy things) if you want to use it. It's free of course, download from here: [https://www.monoglotanxiety.com/blog/anki-format-for-german-that-automatically-generates-cloze-deletions-and-color-codes-nouns/](https://www.monoglotanxiety.com/blog/anki-format-for-german-that-automatically-generates-cloze-deletions-and-color-codes-nouns/)\n\nOne last thing! Your Mam (grandma?) could be an amazing resource. She doesn't need to teach you, she just needs to talk with you. You two could have a little project together of learning (/re-learning). Offer to watch German movies and TV with her, have a conversation in German on the phone each week, etc. I'm sure she'd love to have something to do with her family and to see that you're interested in her heritage.\n\nTLDR: get a tutor, find German stuff you love to watch/read/listen to, use flashcards for noun gender, and stop thinking of your grandma as a teacher and start thinking of her as an exchange partner and family member who would probably love to spend time re-discovering her native language with you.", "created_utc": "1614051882.0", "edited": "False", "id": "gof77p0", "is_submitter": "False", "link_id": "t3_lpmpdh", "parent_id": "t3_lpmpdh", "score": "8", "subreddit": "German", "subreddit_id": "t5_2qq51"}, {"author": "emcuttsy", "body": "Duolingo is good for occupying your iThumbs with something language-related when you get a phone itch. It can give you enough vocabulary to start understanding German, which opens up other, better study options. But don't think of it as a replacement for study!\n\nMy advice for a casual learner is to spend less time on game apps like Duo and more time watching German TV and movies so that you train your ear properly from the start and get exposed to a lot of vocabulary in a way that's fun and motivating. Then use Duolingo to fill in all those idle moments when we pull out our phones for no reason on the bus, in line, on the toilet, etc.", "created_utc": "1614050957.0", "edited": "False", "id": "gof5g2d", "is_submitter": "False", "link_id": "t3_lpipsz", "parent_id": "t3_lpipsz", "score": "0", "subreddit": "German", "subreddit_id": "t5_2qq51"}, {"author": "emcuttsy", "body": "Find an iTalki tutor who understand the problem with the \"same conversation every time.\" My tutor for German sends me an article, song, or video and a writing exercise before every lesson. I look at what she sent me and do the exercise, and then we talk about the theme of the song/article/video whatever and correct my writing live and talk about it. That way, the conversation hits new topics and you get exposed to new vocabulary. Also, find someone with a consistent schedule (you an look ahead a few weeks on their calendar to see when they teach). Trial lessons are usually cheaper, and you can shop around until you find someone with a consistent schedule who will accommodate this request.\n\nIf you don't want to pay someone to talk to you, you're at the mercy of other people's voluntary schedules, which means consistency will be harder. I tutor English online and my students say good things about tandem.\n\nTLDR: find a \\*good\\* tutor on iTalki. Be upfront with your tutor the first time you meet and say that you want to discuss a new topic each lesson, and shop around until you find one who will make that happen.", "created_utc": "1614050424.0", "edited": "False", "id": "gof4fq2", "is_submitter": "False", "link_id": "t3_lq54hs", "parent_id": "t3_lq54hs", "score": "5", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "emcuttsy", "body": "Das zweite englischsprachige Google-Ergebniss für \"fickschnitzel\" ist von einer Namensbedeutung-Seite [https://imgur.com/a/nw4YTPQ](https://imgur.com/a/nw4YTPQ)\n\n... Anscheinend interessieren sich die Österreicher am meisten für diesen schönen \"Namen\" [https://imgur.com/hqtaR8z](https://imgur.com/hqtaR8z)", "created_utc": "1614049025.0", "edited": "False", "id": "gof1qnr", "is_submitter": "False", "link_id": "t3_lpk707", "parent_id": "t3_lpk707", "score": "1", "subreddit": "de", "subreddit_id": "t5_22i0"}, {"author": "emcuttsy", "body": "I \"learned\" A1-A2 by osmosis mostly, just watching a ton of TV and forcing my way through books I couldn't understand. I'd occasionally look up grammar when I reaaallly didn't understand anything, but I didn't sit down to study it and I never took any classes. I am a bit of a nerd, and already knew a bit about English grammar when I started and how things like cases function/what role they play in expressing meaning.\n\nNow I'm about B2, and I mostly speak without thinking about grammar. I know enough to know why things are wrong when my tutor corrects me, and the things that I get right come from intuition, not from thinking things through.\n\nWhen I do read about grammar now, I mostly experience it as \"Oh, so that's why this thing I already know \\*feels\\* wrong is wrong. Cool.\" \n\nProbably not the optimal/recommended path, but it's working for me well enough and I've avoided the need to spend time drilling through a bunch of grammar instead of just enjoying the language.", "created_utc": "1613874804.0", "edited": "False", "id": "go6ost6", "is_submitter": "False", "link_id": "t3_logw48", "parent_id": "t1_go5vjn2", "score": "3", "subreddit": "German", "subreddit_id": "t5_2qq51"}, {"author": "emcuttsy", "body": "Not sure of your level and tolerance for Österreichisch but I loved the [Brenner Krimis](https://de.wikipedia.org/wiki/Wolf_Haas#Brenner-Krimis) by Wolf Haas. Basically, lousy a middle aged detective stumbles into solving crimes, and the crimes are always set against the backdrop of some important political/social issue (which somehow despite the totally irreverent tone of the books works really well). They're short, and having a series is nice if you end up liking them. There are some movies based on the books too.\n\nAs a side note, I only started reading these books because they were in my boyfriend's kindle library, which he inherited from his ex-girlfriend's mom. So I guess this series might be popular with Austrian moms.   ¯\\\\\\_(ツ)\\_/¯", "created_utc": "1613870803.0", "edited": "False", "id": "go6hj27", "is_submitter": "False", "link_id": "t3_loet1f", "parent_id": "t3_loet1f", "score": "2", "subreddit": "German", "subreddit_id": "t5_2qq51"}, {"author": "emcuttsy", "body": "This is an amazing idea and a really slick implementation. I love the ability to click words to add them to a list.\n\nA few suggestions on format:\n\n1. Allow users to see the transcript next to the video instead of under it, so the text can be read in portrait orientation and stay \"on screen\" longer. For videos with rapid speech, I had trouble clicking words fast enough before they went away.\n2. Allow users to see the entire transcript of the video and select words from it.\n3. Don't make users click on the infinitive form of a verb to see its info. Just serve up the information for conjugated forms as if they were the infinitive and maybe highlight the form, or say which form it is.\n\nBugs/issues:\n\n1. Translations of certain verbs seem to missing. \"Geht\" couldn't be translated.\n2. Nouns come out lower-case, which is wrong for German.\n\nOne great addition IMO would be a way to export the words to CSVs that can be read by Anki. It'd be even better if information like verb conjugations, plural forms, and the article that pairs with nouns (i.e. instead of \"Straße\" alone you get \"die Straße\") could also be exported. I run a blog that's basically just free Anki decks based on themes, and I think it'd be awesome to this to create decks based on youtube channels!\n\nEdit: another feature that'd be great would be the option to link a youtube account.\n\nOverall, awesome. Thanks for making something like this for free.", "created_utc": "1613870259.0", "edited": "False", "id": "go6gju9", "is_submitter": "False", "link_id": "t3_lo6wsp", "parent_id": "t3_lo6wsp", "score": "2", "subreddit": "German", "subreddit_id": "t5_2qq51"}, {"author": "emcuttsy", "body": "My boyfriend is Austrian and he does this every time he says a name.", "created_utc": "1613851016.0", "edited": "False", "id": "go5gfq5", "is_submitter": "False", "link_id": "t3_lob7a9", "parent_id": "t3_lob7a9", "score": "8", "subreddit": "German", "subreddit_id": "t5_2qq51"}, {"author": "emcuttsy", "body": "Ich weiß, dass du normal spielen möchtest, aber falls der Stream spezielle für DeutschlernerInnen ist, dann vielleicht wäre es gleichzeitig lustig und hilfreich im Spiel einkaufen zu gehen und die Namen von den Sachen im Shop laut zu lesen. Ich habe viele Wörter einfach beim Einkaufen in Skyrim gelernt. Auch wenn die Wörter nicht im echten Leben nutzvoll sind, macht es Spaß, Dinge wie die verschiedene Arten von Schwertern zu lernen.", "created_utc": "1611266391.0", "edited": "1611268617.0", "id": "gk3xt4m", "is_submitter": "False", "link_id": "t3_l1xoqz", "parent_id": "t3_l1xoqz", "score": "1", "subreddit": "German", "subreddit_id": "t5_2qq51"}, {"author": "emcuttsy", "body": "I know \"picture dictionary\" sounds pretty basic but this site goes into absurd detail on many topics, from the hyperspecific parts of camping tents  (probably not what you want) to things like astronomy and the natural sciences [http://www.bildwoerterbuch.com/](http://www.bildwoerterbuch.com/)\n\nI'm not sure if it touches on philosophy, but if you want to know all the words related to spaceflight and volcanoes or the names of all the birds, it's a great resources.", "created_utc": "1611264851.0", "edited": "False", "id": "gk3uf04", "is_submitter": "False", "link_id": "t3_l26o5s", "parent_id": "t3_l26o5s", "score": "1", "subreddit": "German", "subreddit_id": "t5_2qq51"}, {"author": "emcuttsy", "body": "Ich habe etwas wie Zork gemeint, aber Point & Click Adventures sind auch gut. Das Wichtigste ist, dass das Spiel keine Feinmotorik braucht. Ich spiele Computerspiele gerne, aber darin bin ich zu schrecklich um gleichzeitig auf spielen und Deutschlernen zu konzentrieren. Danke für die Empfehlungen :)", "created_utc": "1611204015.0", "edited": "False", "id": "gk12p1m", "is_submitter": "True", "link_id": "t3_l1ob60", "parent_id": "t1_gk0mfcz", "score": "3", "subreddit": "German", "subreddit_id": "t5_2qq51"}, {"author": "emcuttsy", "body": "Cool that there are already some libraries out there for declining nouns haha! If only there was one for verbs, but it makes sense that the transltion API can handle conjugation. I've been writing little scripts for Anki card formats that can automatically cloze words and do things like identify when verbs are irregular and highlight them, and verbs took me a looong time to figure out. Still a tad buggy. Even the rules for regular verbs have so many exceptions.\n\nOne more idea: there are vocab lists ([A1](https://www.goethe.de/pro/relaunch/prf/de/A1_SD1_Wortliste_02.pdf?fbclid=IwAR22e33alYsAZrYw0suPL6J6RUA6OrYwyA-5uRoc29LqgoRWmTFc6oOJqiQ) [A2](https://www.goethe.de/pro/relaunch/prf/de/Goethe-Zertifikat_A2_Wortliste.pdf) [B1](https://www.goethe.de/pro/relaunch/prf/de/Goethe-Zertifikat_B1_Wortliste.pdf)) available for the low-mid levels that you could probably scrape for vocab to exclude. Like if someone feels solid on A1-A2 they could just say not to add any words on the A1-A2 lists.", "created_utc": "1611193631.0", "edited": "False", "id": "gk0ixeh", "is_submitter": "False", "link_id": "t3_l15ad5", "parent_id": "t1_gk0cxhf", "score": "1", "subreddit": "German", "subreddit_id": "t5_2qq51"}, {"author": "emcuttsy", "body": "What a cool idea! Being able to exclude simple words would be a big plus. But having a program decide what \"simple\" is could be hard. Maybe having a toggle to remove the top X most frequent words would work. \n\nCurious how it handles verb conjugation and noun declension under the hood.", "created_utc": "1611182500.0", "edited": "False", "id": "gjzx0t2", "is_submitter": "False", "link_id": "t3_l15ad5", "parent_id": "t3_l15ad5", "score": "1", "subreddit": "German", "subreddit_id": "t5_2qq51"}, {"author": "emcuttsy", "body": "+1 for grammar books", "created_utc": "1610916028.0", "edited": "False", "id": "gjn9a1v", "is_submitter": "False", "link_id": "t3_kz30be", "parent_id": "t1_gjlii59", "score": "3", "subreddit": "German", "subreddit_id": "t5_2qq51"}, {"author": "emcuttsy", "body": "Anki flashcards. If you use the anki app it's a good 1:1 replacement for duolingo in terms of scratching the \"suddenly I need to use my phone right now\" itch. \n\nAnki a great supplement since you can include whatever phrases and words from Babel (and elsewhere) give you particular trouble, and you can aquire a lot of vocabulary really fast. There are free decks on Ankiweb for the A1-B2 level vocab lists specifically. And for grammar, you can make cloze deletion cards of sentences that involve the grammar concept you want to remember. Definitely more a \"choose your own adventure\" approach than apps though. \n\nBut really, it sounds like you might actually just be wanting a grammar book or Übungsgrammatik. Want to know how the feminine works? Flip to the section on noun gender and do the exercises.", "created_utc": "1610915660.0", "edited": "1610915972.0", "id": "gjn8iyn", "is_submitter": "False", "link_id": "t3_kz30be", "parent_id": "t3_kz30be", "score": "1", "subreddit": "German", "subreddit_id": "t5_2qq51"}, {"author": "emcuttsy", "body": "There are some *amazing* German science youtube channels: Mailab, TerraX Lesch & Co, and Kurzgesagt to name a few. TerraX on youtube is a bit like the discovery channel in terms of programming. MrWissen2Go is a good history channel. Neo Magazin Royal is on youtube and it's basically Last Week Tonight but German. If you like cooking channels and don't mind a bit of Österreichisch then Kein Stress Kochen is hilarious. I hate cooking but I still can't recommend it enough, he's just hilarious.\n\nAlso, you didn't ask for podcasts but I feel like I have to recommend Mordlust - if you like true crime, its a great one. The journalists retell the stories in a really interesting way and they also chat with each other a lot, so it's good for hearing natural speech. Slow German is a good podcast for learners.", "created_utc": "1610498490.0", "edited": "False", "id": "gj2885b", "is_submitter": "False", "link_id": "t3_kvvmhd", "parent_id": "t3_kvvmhd", "score": "2", "subreddit": "German", "subreddit_id": "t5_2qq51"}, {"author": "emcuttsy", "body": "My mom is having the same frustration (or amusement?) with Pimsleur Portuguese. So you're not alone haha. But if you think German's bad, try Danish. [Even the Norwegians think it sounds ridiculous](https://www.youtube.com/watch?v=FqgRC5sfCaQ), mutual intelligibility or not. \n\nThe good news is that standard German pronunciation is super predictable (much more than English!), so once you start reading a bit more it should click. I actually don't really remember a time when I was confused by German spelling not matching up to pronunciation, which is probably because I was super lazy and didn't do anything to study except some Duolingo and watching movies in German with German subtitles until about A2-ish comprehension levels...", "created_utc": "1610496095.0", "edited": "False", "id": "gj23pq0", "is_submitter": "False", "link_id": "t3_kw0oei", "parent_id": "t3_kw0oei", "score": "1", "subreddit": "German", "subreddit_id": "t5_2qq51"}, {"author": "emcuttsy", "body": "I'm at about the same level as you, maybe more on the B2-C1 border. One thing that really helped me with my plateau was starting to work with an online tutor. If speaking is what you're after, speaking is what you should practice, and conversations with tutors can feel more like chatting with a friend after a while than \"studying.\" Also, it is low effort in that someone else does most of the heavy-lifting in terms of figuring out how you should study.I love my iTalki tutor and would love to throw her a referral, so PM me if you want a link to her profile :)\n\nPimsleur is also something to consider if you want something speech-focused that is very structured. It will help you get more comfortable responding quickly to speech, but the conversations are admittedly pretty limited (and biased towards retirees and businesspeople). At your level, I'd recommend doing the free trial of the subscription version for 1 week and seeing how the Level 5 lessons feel. If you feel like they can still teach you something, the program is very, *very* structured (30 min, 1x a day, for 30 days) and might help with getting out of a motivation slump. Skip the low-level lessons that are too easy for you at B1-B2.\n\nStill, I think t**he best advice for low-effort learning is finding podcasts, TV, and youtube channels that you enjoy**. Finding German content you enjoy  both improves your German is a great motivation to \"study\" more. German with German subtitles is great, especially at B1+.\n\nAlso, if you want to communicate complex concepts, immersion content is very important---instead of reading about how to form a complex sentence, you can simply listen to enough of them that your brain starts stringing them together itself. Educational/complex content for native speakers will help a lot more with this than structured content targeted at language learners.\n\nHere are some of my favorites:\n\nPodcasts\n\n* *Mordlust -* fantastic true crime hosted by two journalists. The cases are retold as stories, so the structure is easy to follow and if you miss something it's easy to piece together what happened from context. Also, the hosts chat a lot with each other informally so it's a good way to hear natural speech.\n* *Deutsch mit Schmidt* \\- a podcast aimed at intermediate learners. The host teaches a few B1-C2 level words/phrases and gives example sentences. Episodes are super short, and they feel more like auditory flashcards than podcast episodes. But if you're looking for structure, this is super structured.\n* *Slow German* \\- slowly-spoken short podcasts about German culture. It's for learners, and therefore tends to cover a lot of the typical tourist topics but also some very interesting ones. Great immersion for folks not ready for full-speed speech.\n* *Coffee Break German* \\- very structured. It's not good immersion content, but it's a good way to learn grammar without having to sit down with a grammar book or consume so much immersion content that you don't need a grammar book.\n\nTV & Youtube\n\n* *Dark -* watching this show over and over is pretty much how I got to A2 (it's better if you come back later and actually understand everything, of course haha). It is just great television, and the concept of the show means that scenes repeat. It's almost like spaced repetition: the show, and it rewards rewatches.\n* *How to Sell Drugs Online (Fast)* \\- the best TV depiction of life as a digital native that I've ever seen. Very fun, often hilarious, and based on a mostly true story.\n* *Charite* \\- Downton Abbey but in a German hospital in 1888. There's a follow-up series set during WW2 called *Charite at War*.\n* *Altes Geld* \\- An Austrian... comedy? Austrian humor often really walks the line between gallows humor and just plain gallows. Still, I loved it (maybe an omen that I'd end up together with a dark-humored Austrian...) and it's great concept: a filthy rich Viennese man pits his family against each other to find him a replacement liver.\n* Your favorite kids animation dubbed into German - animations aren't annoying to watch dubbed like live TV is. Picking a show you already love and seeing how it sounds in German can be pretty fun (and funny, if the dubs are bad)\n* Mailab - superb science youtube channel. Even if you're not into science, it is very good, since many of the topics have more to do with social issues, popular trends, and common misconceptions than technical science.\n* MrWissen2Go - history channel with a series on pretty much whatever topic you could possibly be interested in.\n* TerraX (and TerraX Lesch & Co) - basically the discovery channel, but in German and on Youtube. Lesch & Co is physics/astronomy popular science hosted by a guy who is basically a Disney animation of a professor but brought to life and put on youtube.\n* Kurzgesagt - beautiful youtube channel with animations about science, philosophy, politics, and other interesting topics.\n* Neo Magazin Royal - German *Last Week Tonight* (and the host similarly needs a large legal team haha). The youtube channel has many complete episodes.\n\nA good place to look for youtube channels and podcasts is funk, which is a public-service content network that supports some really amazing creators. [Here's a list of funk programs.](https://presse.funk.net/format/)\n\nJust as a last thing: don't feel bad about not having a lot of motivation. You can still make a lot of progress without doing things 100% optimally. I started learning German in a pretty rough time when I barely had the motivation to brush my teeth let alone \"study,\" and I got better at German in 3 months than I ever was at Spanish after 4 years of classes just by watching a load of TV. My accent definitely benefited from all that listening, too. So don't underestimate \"low-motivation!\" A slump in energy can be a great opportunity to soak in immersion content.", "created_utc": "1610424912.0", "edited": "1610425317.0", "id": "giysx1s", "is_submitter": "False", "link_id": "t3_kv2hqv", "parent_id": "t3_kv2hqv", "score": "3", "subreddit": "German", "subreddit_id": "t5_2qq51"}, {"author": "emcuttsy", "body": "**Hammer's German Grammar and Usage** is great. It has answered so many of my questions and is really easy to navigate. There are also some very useful tables if you're into things like making flashcards of irregular verbs.\n\nA side note: one thing I really like about this book is that it attempts to describe how German is *actually* used rather than just how one might think it *should* be used. You get to see the \"right\" way and the \"real\" way and decide for yourself what to say!", "created_utc": "1610421250.0", "edited": "False", "id": "giym075", "is_submitter": "False", "link_id": "t3_kvcmv9", "parent_id": "t3_kvcmv9", "score": "3", "subreddit": "German", "subreddit_id": "t5_2qq51"}, {"author": "emcuttsy", "body": "The respect the dothraki deserve!", "created_utc": "1558922729.0", "edited": "False", "id": "eoxe8zp", "is_submitter": "False", "link_id": "t3_btfeun", "parent_id": "t3_btfeun", "score": "1", "subreddit": "freefolk", "subreddit_id": "t5_37tpy"}, {"author": "emcuttsy", "body": "Lyanna Stark died in childbirth, which was unfortunately a not uncommon way to die in ye olden days", "created_utc": "1558922153.0", "edited": "False", "id": "eoxcsnj", "is_submitter": "False", "link_id": "t3_btfvey", "parent_id": "t3_btfvey", "score": "3", "subreddit": "freefolk", "subreddit_id": "t5_37tpy"}, {"author": "emcuttsy", "body": "If Barristan hadn't been killed for no reason, Dany would probably never have gone Ash Queen. So maybe that's why they killed him... sigh", "created_utc": "1558833680.0", "edited": "False", "id": "eot23td", "is_submitter": "False", "link_id": "t3_bt25k1", "parent_id": "t3_bt25k1", "score": "11", "subreddit": "freefolk", "subreddit_id": "t5_37tpy"}, {"author": "emcuttsy", "body": "> I say that we stop trashing them for being bad writers, and start trashing them for being absolute cocks who fucked up the end of the show, not by incompetence, but by laziness. \n\n&#x200B;\n\nThis. It's like charging someone with criminal negligence for something that was really a murder. They let S8 die because they chose to let it die, not because they didn't know how to take care of it.", "created_utc": "1558828839.0", "edited": "False", "id": "eost6lw", "is_submitter": "False", "link_id": "t3_bt0h1i", "parent_id": "t3_bt0h1i", "score": "5", "subreddit": "freefolk", "subreddit_id": "t5_37tpy"}, {"author": "emcuttsy", "body": "The DNA is even a right-handed helix way to get the details right Dany", "created_utc": "1558828316.0", "edited": "False", "id": "eoss3wg", "is_submitter": "False", "link_id": "t3_bt0vdp", "parent_id": "t3_bt0vdp", "score": "7", "subreddit": "freefolk", "subreddit_id": "t5_37tpy"}, {"author": "emcuttsy", "body": "y e s", "created_utc": "1558827697.0", "edited": "False", "id": "eosquyu", "is_submitter": "False", "link_id": "t3_bt176z", "parent_id": "t3_bt176z", "score": "74", "subreddit": "freefolk", "subreddit_id": "t5_37tpy"}, {"author": "emcuttsy", "body": "Her laugh when he says he wouldn't change anything about the ending is priceless.", "created_utc": "1558819241.0", "edited": "False", "id": "eos8f76", "is_submitter": "False", "link_id": "t3_bszcir", "parent_id": "t3_bszcir", "score": "8", "subreddit": "freefolk", "subreddit_id": "t5_37tpy"}, {"author": "emcuttsy", "body": "Can you imagine if barristan had lived to watch his second targaryen monarch go full burninator? That would have been so heartbreaking...", "created_utc": "1558736340.0", "edited": "False", "id": "eooe66m", "is_submitter": "False", "link_id": "t3_bshpfx", "parent_id": "t3_bshpfx", "score": "84", "subreddit": "freefolk", "subreddit_id": "t5_37tpy"}, {"author": "emcuttsy", "body": "Bobby B, how do you feel about higher education?", "created_utc": "1558715767.0", "edited": "False", "id": "eonlvnn", "is_submitter": "False", "link_id": "t3_bs8ego", "parent_id": "t1_eom5ltm", "score": "1", "subreddit": "freefolk", "subreddit_id": "t5_37tpy"}, {"author": "emcuttsy", "body": "The Caltech license plate frame somehow makes this even better", "created_utc": "1558676046.0", "edited": "False", "id": "eoltdnt", "is_submitter": "False", "link_id": "t3_bs8ego", "parent_id": "t3_bs8ego", "score": "1", "subreddit": "freefolk", "subreddit_id": "t5_37tpy"}, {"author": "emcuttsy", "body": "Gender filter Sansa looks like Daniel Radcliffe", "created_utc": "1558647475.0", "edited": "False", "id": "eok5lm0", "is_submitter": "False", "link_id": "t3_bs1csk", "parent_id": "t3_bs1csk", "score": "2", "subreddit": "freefolk", "subreddit_id": "t5_37tpy"}, {"author": "emcuttsy", "body": "I'm not crying you're crying", "created_utc": "1558408849.0", "edited": "False", "id": "eoa71ku", "is_submitter": "False", "link_id": "t3_br1dc3", "parent_id": "t1_eo9uf1y", "score": "69", "subreddit": "freefolk", "subreddit_id": "t5_37tpy"}, {"author": "emcuttsy", "body": "Honestly Jon really got me in this scene. He was great. And seeing Jon say words and express emotion made me feel so robbed--he could have been doing that *all season* but we just got 5 episodes of muh kween.", "created_utc": "1558399227.0", "edited": "False", "id": "eo9slhc", "is_submitter": "False", "link_id": "t3_br0iia", "parent_id": "t3_br0iia", "score": "141", "subreddit": "freefolk", "subreddit_id": "t5_37tpy"}, {"author": "emcuttsy", "body": "Brienne did it on purpose to symbolize how no matter how great your character arc is, it can all be smeared to meaningless crap in a few seconds by a careless writer", "created_utc": "1558398376.0", "edited": "False", "id": "eo9rcu8", "is_submitter": "False", "link_id": "t3_bquniw", "parent_id": "t3_bquniw", "score": "3", "subreddit": "freefolk", "subreddit_id": "t5_37tpy"}, {"author": "emcuttsy", "body": "I didn't think there would ever be a day when I was glad that one of my buddies decided it was a good idea to waste three hours of my life explaining the entire goddamn plot of Warhammer 40k plot to me.\n\nI also didn't think there would ever be a day when the best thing about a GOT episode was a sad CGI lizard. But here we are.", "created_utc": "1558391615.0", "edited": "False", "id": "eo9hm05", "is_submitter": "False", "link_id": "t3_bqpj8y", "parent_id": "t3_bqpj8y", "score": "1", "subreddit": "freefolk", "subreddit_id": "t5_37tpy"}, {"author": "emcuttsy", "body": "I don't think I've ever heard anyone use \"hooray\" unironically in English... but maybe I just happen to be running with a depressed crowd XD", "created_utc": "1553103427.0", "edited": "False", "id": "eiz14tl", "is_submitter": "False", "link_id": "t3_b3dio2", "parent_id": "t3_b3dio2", "score": "27", "subreddit": "German", "subreddit_id": "t5_2qq51"}, {"author": "emcuttsy", "body": "Not sure what you consider a legitimate source but this wiki page mentions it (as well as the Ludnasadh festival which is in the song): [https://en.wikipedia.org/wiki/Lugus](https://en.wikipedia.org/wiki/Lugus).", "created_utc": "1551158997.0", "edited": "1551162358.0", "id": "ehawltb", "is_submitter": "False", "link_id": "t3_aufuqj", "parent_id": "t1_eh89oi7", "score": "2", "subreddit": "German", "subreddit_id": "t5_2qq51"}, {"author": "emcuttsy", "body": "This. I felt guilty for laughing at it half the time but it's really really good. Quite different from Dark though.", "created_utc": "1551126319.0", "edited": "False", "id": "eh9pe67", "is_submitter": "False", "link_id": "t3_atzaws", "parent_id": "t1_eh4h92x", "score": "1", "subreddit": "German", "subreddit_id": "t5_2qq51"}, {"author": "emcuttsy", "body": "The song is about the Celtic sun god Lugh I think, who is often associated with ravens.  \n", "created_utc": "1551068235.0", "edited": "False", "id": "eh82w1x", "is_submitter": "False", "link_id": "t3_aufuqj", "parent_id": "t3_aufuqj", "score": "1", "subreddit": "German", "subreddit_id": "t5_2qq51"}, {"author": "emcuttsy", "body": "Really fun idea. Reminds me of full metal alchemist a bit in that its still magic, but it follows some important constraints from natural laws like conservation of matter/energy.", "created_utc": "1518637347.0", "edited": "False", "id": "du8zayl", "is_submitter": "False", "link_id": "t3_7xcdzk", "parent_id": "t3_7xcdzk", "score": "1", "subreddit": "worldbuilding", "subreddit_id": "t5_2rd6n"}, {"author": "emcuttsy", "body": "I spent a lot of time drawing studies of this - the best solutions I can come up with are specially designed shirts. If you have enough avian people that they have a culture, they have probably come up with clothes that fit their wings.\n\nOpen back shirts are great. I find tops that fasten around the neck and have a scoop back which fastens at the small of the back to work well. Also you could have straps on shirts join into a razorback which goes down as a strip between the wings and rejoins the rest of the shirt near the small of the back. \n\nWing slits in normal jackets without some kind of real thought given to how they thread their wings through the jacket and back out is hard. I imagine it could work well if there was a zipper/button/Velcro holding an additional slit closed which runs perpendicular to the up and down wing slit and connecting across the front of the jacket to the main zipper. This would allow the jacket to \"butterfly\" open for the wings to go into or out of the slits more easily.\n\nLmk if you want some sketches, I might have time to throw some together.", "created_utc": "1518636953.0", "edited": "False", "id": "du8yvu2", "is_submitter": "False", "link_id": "t3_7xjpzu", "parent_id": "t3_7xjpzu", "score": "1", "subreddit": "worldbuilding", "subreddit_id": "t5_2rd6n"}, {"author": "emcuttsy", "body": "To compensate for the generations of female players who had to wear ridiculous hats while you boys got baseball caps.", "created_utc": "1470667856.0", "edited": "False", "id": "d691v47", "is_submitter": "False", "link_id": "t3_4wmlub", "parent_id": "t1_d68x1yf", "score": "7", "subreddit": "pokemongo", "subreddit_id": "t5_34jka"}, {"author": "emcuttsy", "body": "In most of my worlds, gods are just especially powerful spirits that have been \"fed\" (like you said) enough \"belief\" to exist. In that case, so long as people believe in an idea, a god or divine being should exist for that idea - meaning there should be arbitrarily many divine beings of whom only a handful are especially powerful. In this case, having a ton of gods is fine -- just think of how many the Greeks and Norse pantheons have! \n\nYour players will probably only care about the gods that are important to them, or are important to their story. Many polytheistic people were this way, favoring one or a small collection of gods while acknowledging the existence of the others. Just think of how Ragnar from Vikings mostly prays to Odin, while Lagertha mostly prays to Frey. They seek guidance and blessings from the gods that appeal to their morals and goals the most. \n\nTldr. You're fine, real polytheistic pantheons are huge.", "created_utc": "1469396042.0", "edited": "1469459042.0", "id": "d5p69kf", "is_submitter": "False", "link_id": "t3_4udee5", "parent_id": "t3_4udee5", "score": "2", "subreddit": "worldbuilding", "subreddit_id": "t5_2rd6n"}, {"author": "emcuttsy", "body": "Being unfamiliar with this series, could I ask you explain?", "created_utc": "1468725319.0", "edited": "False", "id": "d5f94xr", "is_submitter": "True", "link_id": "t3_4t7pr7", "parent_id": "t1_d5f7th8", "score": "1", "subreddit": "worldbuilding", "subreddit_id": "t5_2rd6n"}, {"author": "emcuttsy", "body": "If you're dedicated, developing a language for your setting is a good way to make your names consistent. Or, at least, decide on the vowels and consonants that language uses and create a limited lexicon that you can use for naming places and things. ", "created_utc": "1468722660.0", "edited": "False", "id": "d5f7tmc", "is_submitter": "False", "link_id": "t3_4t61e5", "parent_id": "t3_4t61e5", "score": "2", "subreddit": "worldbuilding", "subreddit_id": "t5_2rd6n"}, {"author": "emcuttsy", "body": "Caltech has a really well recognized geology program, but doesn't give merit aid. The institute *does* give a lot of need based financial aide however, so if money is an issue, you'll probably still be able to go without taking out loans. There are plenty of people who get their entire tuition paid by the school.", "created_utc": "1468722432.0", "edited": "False", "id": "d5f7pgx", "is_submitter": "False", "link_id": "t3_4t4chp", "parent_id": "t3_4t4chp", "score": "2", "subreddit": "geology", "subreddit_id": "t5_2qshr"}, {"author": "emcuttsy", "body": "Not so. While the prospect of extended surface habitation is probably impractical, water (of which there is no shortage on Europa) is a very good radiation shield. Under enough ice, subsurface habitation would be possible. The interior (including most of the ice crust and ocean) would be effectively shielded from radiation. Although technically difficult, considering we haven't really developed extensive subterranean habitation on Earth, let alone figured out ways to live under water for extended periods of time, it wouldn't be impossible to settle Europa or at least have a few science outposts buried in the ice. ", "created_utc": "1468618864.0", "edited": "False", "id": "d5durmr", "is_submitter": "False", "link_id": "t3_4t0ac0", "parent_id": "t1_d5drk6u", "score": "4", "subreddit": "nasa", "subreddit_id": "t5_2qk6m"}, {"author": "emcuttsy", "body": "Just to be clear - the oxygen \"atmosphere\" isn't the kind of thing you could breathe - it's about 10^-13 the pressure of Earth's atmosphere at the surface of Europa, so practically vacuum. What is compelling to astrobiologists is the subsurface ocean. Europa is probably composed of an ice crust, liquid global water ocean, and a rocky center with a dense core. \n\nOxygen is generated at the surface not by biology, but by radiation breaking apart compounds on the surface of the water-ice crust (a process called radiolysis, if you're interested) could be important if it is brought down and dissolved into the ocean below, where life might actually be able to exist (this is entirely subject to debate, as of now. We simply don't know enough about Europa and about life to know if life could have emerged/persisted there)\n\nThe launch date for clipper is yet to be determined, but it's likely to go out somewhere in the 2020s.", "created_utc": "1468609155.0", "edited": "False", "id": "d5dnur6", "is_submitter": "False", "link_id": "t3_4t0ac0", "parent_id": "t1_d5dkz3u", "score": "5", "subreddit": "nasa", "subreddit_id": "t5_2qk6m"}, {"author": "emcuttsy", "body": "My world is based on a dualistic philosophy of change vs preservation instead of good vs evil", "created_utc": "1467741915.0", "edited": "False", "id": "d50a558", "is_submitter": "False", "link_id": "t3_4rcrgo", "parent_id": "t3_4rcrgo", "score": "1", "subreddit": "worldbuilding", "subreddit_id": "t5_2rd6n"}, {"author": "emcuttsy", "body": "I like the idea of cultures -- I don't know how I'd deal with the subrace mechanic already in place in 5e though. Because wood elf/high elf seems like a cultural distinction to me, but they're treated as subraces in 5e and that's what I'm designing this setting to work with.\n\nI totally agree with your comments on catfolk and kitsune being played silly and kind of ruining the feel of the setting. I think maybe making kitsune purely spirits and kind of dangerous (not a playe race) would be more in-setting. For catfolk, I think maybe making them spirit/human hybrids or something along those lines, not a playable race. Some of my players really want catfolk to be playable, though, so I don't really know what to do.", "created_utc": "1439488466.0", "edited": "False", "id": "cu1thwl", "is_submitter": "True", "link_id": "t3_3gt3hl", "parent_id": "t1_cu1gsgo", "score": "1", "subreddit": "rpg", "subreddit_id": "t5_2qh2s"}, {"author": "emcuttsy", "body": "That's why I'm not trying to do all originals -- I just have developed a few original subraces to add on to original fantasy races and now I'm trying to decide which of the stock races that have been put out over the years to put into my setting", "created_utc": "1439438189.0", "edited": "False", "id": "cu188cv", "is_submitter": "True", "link_id": "t3_3gt3hl", "parent_id": "t1_cu18633", "score": "2", "subreddit": "rpg", "subreddit_id": "t5_2qh2s"}, {"author": "emcuttsy", "body": "Maybe punish them for looting somehow -- a corpse could have a disease that a greedy player contracts on contact, or perhaps an item they pick up is cursed. When the negative effect begins to mess with their character in-game, the rest of the group would be alerted to their partymate's activities and have an in-game opportunity to  confront them about the looting.", "created_utc": "1438218277.0", "edited": "False", "id": "ctl09ly", "is_submitter": "False", "link_id": "t3_3f18lf", "parent_id": "t3_3f18lf", "score": "1", "subreddit": "dndnext", "subreddit_id": "t5_2vbgl"}, {"author": "emcuttsy", "body": "I went back and made a few changes.\n\nYou're right about cliff elves. I like the idea of vehicle proficiency for cliff elves. What about dropping the bonus to see if they're being cheated, leaving them with int(double) on object value and pirates/trade, water vehicle proficiency, and then JUST giving them the friends cantrip? The reason I want to give them friends is because the other advantages they get are really context specific and may/may not come into play.\n\nI'll look at that trait for snow elves.\n\nSun elves -- I took away that swim and climb entirely and gave them the create flame cantrip instead for lore reasons (I changed the lore a bit too). I like the idea of just saying which way is north a LOT! That's great. ", "created_utc": "1438217269.0", "edited": "False", "id": "ctkznzf", "is_submitter": "True", "link_id": "t3_3ezzeu", "parent_id": "t1_ctknthq", "score": "1", "subreddit": "dndnext", "subreddit_id": "t5_2vbgl"}, {"author": "emcuttsy", "body": "Hey thanks for your criticisms, I've been paying a lot more attention to the lore than to the balance of these things, and I was really looking for help with the more mechanical aspects.\nI changed the cliff elf trait to advantage on intelligence checks to determine object values and wisdom checks to determine if they're being cheated (that would be insight, correct?). Also, I gave snow elves their proficiency bonus on any save against fear or stun instead of just wisdom. I'm also giving sun elves some fire magic and changing their lore up a bit to explain that. \n\nAs far as having more/less than other subraces, I was modeling the amount of added features off of the high elf and wood elf features. High elves get an extra wizard cantrip of their choice, an extra language, weapon proficiency, and a +1 bonus to int, and that's kind of the level of added features that I've been going for with these subraces. Whether or not I've succeeded, well, I hope I have! When I put in traits that only rarely would be useful (the tradewise and mountainwise features, for example) I tend to add something else that has a bit more utility, like a cantrip. ", "created_utc": "1438194236.0", "edited": "False", "id": "ctkk502", "is_submitter": "True", "link_id": "t3_3ezzeu", "parent_id": "t1_ctk2tbr", "score": "1", "subreddit": "dndnext", "subreddit_id": "t5_2vbgl"}, {"author": "emcuttsy", "body": "Thanks for those suggestions. If this had been Pathfinder, I would have given snow elves exotic weapon proficiencies, but they boiled everything down to european weapons in 5e (and provided some substitute names). I'm going to look into other weapon proficiencies. I totally agree with the advantage note -- it is pretty strong, and I think it's probably better to do the scaling proficiency bonus. ", "created_utc": "1438153611.0", "edited": "False", "id": "ctk0e65", "is_submitter": "True", "link_id": "t3_3ezzeu", "parent_id": "t1_ctk0bju", "score": "2", "subreddit": "dndnext", "subreddit_id": "t5_2vbgl"}, {"author": "emcuttsy", "body": "Perhaps: \"kills anything with green skin before asking questions\" could be thrown in?", "created_utc": "1438152296.0", "edited": "False", "id": "ctjzyti", "is_submitter": "False", "link_id": "t3_3ezcrk", "parent_id": "t3_3ezcrk", "score": "2", "subreddit": "dndnext", "subreddit_id": "t5_2vbgl"}]