[{"author": "espressoBump", "body": "This isn't a shock. What you should be shocked by is the amount of people who believe in these same things as this man and don't condemn his actions.", "created_utc": "1667012038.0", "edited": "False", "id": "iu7dj5p", "is_submitter": "False", "link_id": "t3_yfw1z8", "parent_id": "t1_iu5i5vv", "score": "1", "subreddit": "politics", "subreddit_id": "t5_2cneq"}, {"author": "espressoBump", "body": "Or ... I sinned and god forgave me but YOU need to obey the rules because it's wrong. I'm an atheist but It's pretty clear Christ preached that you better look at yourself and not give a shit what your neighbor is doing because we're all gonna die, really soon, and you want to be in with the lord.", "created_utc": "1666985801.0", "edited": "False", "id": "iu5t5k3", "is_submitter": "False", "link_id": "t3_yfogbf", "parent_id": "t1_iu4cuzp", "score": "3", "subreddit": "WhitePeopleTwitter", "subreddit_id": "t5_35n7t"}, {"author": "espressoBump", "body": "I stopped reading midway in your second paragraph. We  don't know what created the universe or what the universe is. A giant ostrich could have gave birth to the universe, and by ostrich I mean god. In other words something created something and we're just observing it.", "created_utc": "1666837917.0", "edited": "False", "id": "itxvl5c", "is_submitter": "False", "link_id": "t3_ye9puo", "parent_id": "t3_ye9puo", "score": "1", "subreddit": "DebateAnAtheist", "subreddit_id": "t5_2ryfy"}, {"author": "espressoBump", "body": "That's an understandable reason why social security is benefits are depelting.", "created_utc": "1666809691.0", "edited": "False", "id": "itw0iir", "is_submitter": "False", "link_id": "t3_ydtodg", "parent_id": "t1_itvf4cm", "score": "1", "subreddit": "antiwork", "subreddit_id": "t5_2y77d"}, {"author": "espressoBump", "body": "And why is social security so bad? There won't be any left for many gen xers never mind millenials. Where does all the money go? Something doesn't add up IMO. I understand people use welfare but other countries do it much better, our system is so inefficient. Is that the difference? The middle men - health insurance companies - are robbing us blind and perpetuating a cycle of health insurance debt and making everyone poor. I know other wealthy countries have these issues too, but it seems like we have more: more homeless, more mental health issues, more poverty, and more car related deaths. Please fact check me, idk if it's all true I'm just bringing up talking points.", "created_utc": "1666791213.0", "edited": "1666794084.0", "id": "ituq5u8", "is_submitter": "False", "link_id": "t3_ydtodg", "parent_id": "t1_ituli6s", "score": "13", "subreddit": "antiwork", "subreddit_id": "t5_2y77d"}, {"author": "espressoBump", "body": "I was well on my way of getting out of the brainwashing, but \"Religiousnes\" helped a lot. To this day I think Bill Maher is an asshole, and an idiot but I like him too. Something about him is important. Around that same time one of the major news companies made a sensationalist piece saying archeologists discovered Jesus's bones. I felt my entire thought system collapse. I obviously knew it wasn't real, but the point was how feeble those beliefs were. I saw reality, and was really disappointed in many \"believers\".\n\nSo essentially Religiousness primed an already questioning soul around my 18th birthday and then the news segment was when the switch flipped. Throughout college i explored my beliefs and didn't feel comfortable saying I was atheist until I moved to North Carolina at 30. People are so religious it empowered me to start using the word. Before that I was fine just not believing and putting up with it.", "created_utc": "1666522108.0", "edited": "False", "id": "itfyhxf", "is_submitter": "False", "link_id": "t3_yb52ng", "parent_id": "t3_yb52ng", "score": "1", "subreddit": "atheism", "subreddit_id": "t5_2qh2p"}, {"author": "espressoBump", "body": "Honestly, it seems like the judge is on a power trip.", "created_utc": "1666354376.0", "edited": "False", "id": "it718zf", "is_submitter": "False", "link_id": "t3_y9ewem", "parent_id": "t3_y9ewem", "score": "-2", "subreddit": "videos", "subreddit_id": "t5_2qh1e"}, {"author": "espressoBump", "body": "This is a fantastic point! I think there is some controversy with this where Quebecois think they should be called Latin. And also, ironically a french person started the nomenclature to unite against the British. I could be wrong, but I'm pretty sure these facts are true.", "created_utc": "1666045324.0", "edited": "False", "id": "isqbulm", "is_submitter": "False", "link_id": "t3_y6j1a3", "parent_id": "t1_ispklie", "score": "1", "subreddit": "MapPorn", "subreddit_id": "t5_2si92"}, {"author": "espressoBump", "body": "Christianity.", "created_utc": "1666006283.0", "edited": "False", "id": "isnu7th", "is_submitter": "False", "link_id": "t3_y5wxnn", "parent_id": "t1_ismn41v", "score": "0", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "espressoBump", "body": "I'm practically from the Berkshires! I love Western MA. The college consortium is really great, and I love everything they're doing with East Hampton. I rode around all of the paths with my friend a few years back and visited Pittsfield for the first time! I love it. Noho isn't the same as it used to be but the rest of the area is ok. I mean, the breweries keep the area alive. If you haven't been to the Montgomery Book Mill you should check it out.", "created_utc": "1665925819.0", "edited": "False", "id": "isje7rl", "is_submitter": "True", "link_id": "t3_y4ooj8", "parent_id": "t1_isi2169", "score": "2", "subreddit": "lostgeneration", "subreddit_id": "t5_2r40j"}, {"author": "espressoBump", "body": "It's scary. I go down this train of thought too.", "created_utc": "1665866813.0", "edited": "False", "id": "isgl4hg", "is_submitter": "True", "link_id": "t3_y4ooj8", "parent_id": "t1_isgkfbl", "score": "51", "subreddit": "lostgeneration", "subreddit_id": "t5_2r40j"}, {"author": "espressoBump", "body": "I saved your comment. I'm gonna have to check it out.", "created_utc": "1665866012.0", "edited": "False", "id": "isgj8b5", "is_submitter": "True", "link_id": "t3_y4ooj8", "parent_id": "t1_isge2vp", "score": "5", "subreddit": "lostgeneration", "subreddit_id": "t5_2r40j"}, {"author": "espressoBump", "body": "This is too true. It's kind of scary to me, I know people who have never left their town. It's just not the type of person I am - I don't blame them I just live a completely different lifestyle. I wish there were more travel opportunities for US citizens if they want it.", "created_utc": "1665865971.0", "edited": "False", "id": "isgj4x3", "is_submitter": "True", "link_id": "t3_y4ooj8", "parent_id": "t1_isg8vpb", "score": "29", "subreddit": "lostgeneration", "subreddit_id": "t5_2r40j"}, {"author": "espressoBump", "body": "I've heard tons of great things about Prague, it sounds lovely.", "created_utc": "1665865820.0", "edited": "False", "id": "isgis5p", "is_submitter": "True", "link_id": "t3_y4ooj8", "parent_id": "t1_isgdlog", "score": "75", "subreddit": "lostgeneration", "subreddit_id": "t5_2r40j"}, {"author": "espressoBump", "body": "Thank you again. This was said better than me.", "created_utc": "1665865579.0", "edited": "False", "id": "isgi7wp", "is_submitter": "True", "link_id": "t3_y4ooj8", "parent_id": "t1_isgambj", "score": "9", "subreddit": "lostgeneration", "subreddit_id": "t5_2r40j"}, {"author": "espressoBump", "body": "Thank you.", "created_utc": "1665865442.0", "edited": "False", "id": "isghw9j", "is_submitter": "True", "link_id": "t3_y4ooj8", "parent_id": "t1_isg54bo", "score": "9", "subreddit": "lostgeneration", "subreddit_id": "t5_2r40j"}, {"author": "espressoBump", "body": "Yes I'm so happy your asked!\n\nIf you're under 30 you can do a work and holiday/working holiday visa.\n\nI was 23 when I got TEFL/TOFL certified, but I highly recommend doing the CELTA. You'll need a bachelors to get hired by most companies. Generally most teachers were 24-30 but some people make a career out of it.\n\nI will update this with more details later.", "created_utc": "1665855267.0", "edited": "False", "id": "isftzyw", "is_submitter": "True", "link_id": "t3_y4ooj8", "parent_id": "t1_isfre6q", "score": "6", "subreddit": "lostgeneration", "subreddit_id": "t5_2r40j"}, {"author": "espressoBump", "body": "This isn't an aha moment. I'm asking where's my blindspot? I'm looking for an explanation.", "created_utc": "1665852769.0", "edited": "False", "id": "isfnyot", "is_submitter": "True", "link_id": "t3_y4ooj8", "parent_id": "t1_isfjxf9", "score": "11", "subreddit": "lostgeneration", "subreddit_id": "t5_2r40j"}, {"author": "espressoBump", "body": "I think I laid out reasonable explanations why I don't want to live in areas with an excess of homeless people, generally I just don't feel safe. Especially after being attacked and the erratic behavior of my customers. Please tell me how I am wrong and how I could have acted differently in these situations to feel safer instead of just calling me a name. I've made it clear these people need help and I want them to be helped. \n\nI don't want to live around unclean or unpredictable people. If that makes me an elitist I accept it.\n\nI just think most people here are opinionated without having worked around or with the homeless population.", "created_utc": "1665850922.0", "edited": "False", "id": "isfjkvc", "is_submitter": "True", "link_id": "t3_y4ooj8", "parent_id": "t1_isfhh63", "score": "14", "subreddit": "lostgeneration", "subreddit_id": "t5_2r40j"}, {"author": "espressoBump", "body": "If it's a few people I don't care, but I lived in Santa Monica doing retail and served tons of homeless people daily. Firstly, they have trouble washing so our store constantly smelled. We had to wear gloves to take our the trash after a person in Seattle contracted HIV by getting pricked with a needle. One homeless woman locked herself in the bathroom, was screaming violently and disturbing everyone for 30 minutes, then attacked one of my managers so I had to call the cops. Another homeless regular beat the shit out of her to \"protect us\". In my home state, I had to escort a homesless regular who was drunk. Everyone, customers, started to get mad at me for not calling the cops sooner because I knew I could treat him with respect and walk him out. It worked. I also took a bunch of food and gave it to every homeless person I could find in that area. I was young. The last guy I gave food to told me to fuck off and said I couldn't change the world. Back in LA, I sat with some homeless folks outside of In and Out for two hours and chatted. I bought them a full meal and gave them my jacket. My biggest beef is having been attacked. I passed a homeless dude in DC and he started punching me in the face. Completely unprovoked, he dropped all of his bags and punched me in the face in one fluid motion. I luckily dodged the second hit and started running as fast I could. What the fuck is elitist about this?", "created_utc": "1665848796.0", "edited": "1665866401.0", "id": "isfenqb", "is_submitter": "True", "link_id": "t3_y4ooj8", "parent_id": "t1_isfd4f3", "score": "7", "subreddit": "lostgeneration", "subreddit_id": "t5_2r40j"}, {"author": "espressoBump", "body": "Then I am an elitist. I don't feel superior or better than homeless people, I think you're missing my point. I don't want them to be homeless either.", "created_utc": "1665847651.0", "edited": "False", "id": "isfc1sz", "is_submitter": "True", "link_id": "t3_y4ooj8", "parent_id": "t1_isfbgdu", "score": "19", "subreddit": "lostgeneration", "subreddit_id": "t5_2r40j"}, {"author": "espressoBump", "body": "That's right, I don't want to live anywhere near or around a lot* of homeless people, but I don't want them to \"dissapear\". I think redistributing wealth and making the wealthy pay their fair share is a step in the right direction, but there are other systemic problems too. It's not just money, but it's a huge part of it. If we redistributed wealth evenly there would be tons of problems. Socialization and isolation are some. I don't think mass shooting happen because white kids are poor. It's more complex than that and even more complex than what I said.\n\nI have a college degree that I got mainly through scholarships. I worked throughout highscool, college, and I was an English teacher in a foreign country - they paid for my flight and housing. I saved that money to go to another foreign country and got lucky applying to jobs. I lived illegally with 8 people in a 2 bedroom apartment. One dude slept in a tent in the living room. I then travelled the US by living with relatives across the country. 3 in particular my parents, and two separate aunts. None of this is fucking elitist, lol.\n\nEdit: a lot of homeless", "created_utc": "1665846606.0", "edited": "1665847960.0", "id": "isf9oxk", "is_submitter": "True", "link_id": "t3_y4ooj8", "parent_id": "t1_isf4r56", "score": "15", "subreddit": "lostgeneration", "subreddit_id": "t5_2r40j"}, {"author": "espressoBump", "body": "Yeah, I mean this is a good point. This is what we're coming to realize will be the best option. Especially since WFH is a thing.", "created_utc": "1665845355.0", "edited": "False", "id": "isf6wma", "is_submitter": "True", "link_id": "t3_y4ooj8", "parent_id": "t1_isf4m8m", "score": "6", "subreddit": "lostgeneration", "subreddit_id": "t5_2r40j"}, {"author": "espressoBump", "body": "Tazza Kitchen and Trophys has pretty good cheap pizza. I'm really disappointed with most food in the area but i don't mind paying for those. Don't go to Mellow Mushroom, it's overrated as all hell.", "created_utc": "1665795338.0", "edited": "False", "id": "isd1huz", "is_submitter": "False", "link_id": "t3_y43g7v", "parent_id": "t3_y43g7v", "score": "0", "subreddit": "raleigh", "subreddit_id": "t5_2r0z3"}, {"author": "espressoBump", "body": "Is this a US state?", "created_utc": "1665795089.0", "edited": "False", "id": "isd0znx", "is_submitter": "False", "link_id": "t3_y3ngv7", "parent_id": "t3_y3ngv7", "score": "1", "subreddit": "fuckcars", "subreddit_id": "t5_3cs2l"}, {"author": "espressoBump", "body": "We need to storm the streets an boycott", "created_utc": "1665775003.0", "edited": "False", "id": "isbqun4", "is_submitter": "False", "link_id": "t3_y3tdh3", "parent_id": "t1_isar7ny", "score": "3", "subreddit": "antiwork", "subreddit_id": "t5_2y77d"}, {"author": "espressoBump", "body": "Isn't there another church with a similar name that is actually evil and does horrendous stuff?", "created_utc": "1665774855.0", "edited": "False", "id": "isbqh70", "is_submitter": "False", "link_id": "t3_y3jx2r", "parent_id": "t1_is9ed85", "score": "0", "subreddit": "atheism", "subreddit_id": "t5_2qh2p"}, {"author": "espressoBump", "body": "I'm Italian-American and feel the same way. I am so happy to see this. Whenever I've brought it up on Reddit people are like STFU YOURE WHITE. I'm happy to see support.", "created_utc": "1665655978.0", "edited": "False", "id": "is4xuqt", "is_submitter": "False", "link_id": "t3_y2cfvt", "parent_id": "t3_y2cfvt", "score": "1", "subreddit": "nottheonion", "subreddit_id": "t5_2qnts"}, {"author": "espressoBump", "body": "Right. I didn't know BC people called Italy, Italy.", "created_utc": "1665579600.0", "edited": "False", "id": "is0kumt", "is_submitter": "False", "link_id": "t3_y1byvu", "parent_id": "t1_is0i60p", "score": "2", "subreddit": "confidentlyincorrect", "subreddit_id": "t5_2cn1kk"}, {"author": "espressoBump", "body": "Italy was not a formed country so he was Genoese, not Italian.  r/confidentlyincorrect", "created_utc": "1665567517.0", "edited": "False", "id": "is02cqs", "is_submitter": "False", "link_id": "t3_y1byvu", "parent_id": "t1_irwfx66", "score": "1", "subreddit": "confidentlyincorrect", "subreddit_id": "t5_2cn1kk"}, {"author": "espressoBump", "body": "r/suddenlygay", "created_utc": "1665503025.0", "edited": "False", "id": "irwh66u", "is_submitter": "False", "link_id": "t3_y10m1f", "parent_id": "t3_y10m1f", "score": "1", "subreddit": "me_irl", "subreddit_id": "t5_2vegg"}, {"author": "espressoBump", "body": "Sometimes I wonder if it's a subconscious thing where Republicans only vote for people who are like themselves; part of being Christian is hugely pretentious and ostentatious (not what their prophet Jesus said, I mean the culture) so bragging about being a good Christian but then having morals like a Trump family member is totally in line with these people. Then they want to take someone like Biden down because they need to feel better about themselves for not being able to be a good person like him. Surely, he must have a deep dark secret like all of us Christians so let's expose it. Of course, some people are overtly doing it and it's not subconscious but I'd say most people would deny it.", "created_utc": "1665489043.0", "edited": "False", "id": "irvn3ea", "is_submitter": "False", "link_id": "t3_y0yef8", "parent_id": "t1_irulcz7", "score": "6", "subreddit": "WhitePeopleTwitter", "subreddit_id": "t5_35n7t"}, {"author": "espressoBump", "body": "I made a post once in my towns subreddit because there's TWO separate dumb fucks who let their pitties outside without leashes. One has two pitbulls the other has one. I briefly described the woman in the post to gsther more info to call animal control and people downvoted me for doxing (fuck that). I called animal patrol and they couldn't do much without me being able to identify her.\n\nThe single dog has ran in my direction twice. The first time I was luckily next to my car, so I dropped all of my bags and hopped in. I was too flustered to record. The second time I was too busy running up the stairs to my apartment. A THIRD time while I just got in my car I saw the dog prancing over to a person blowing leaves and the leaf blower was frightened and blew air at the dog, I sped over and got between them. The dog left and didn't look like he was looking for prey. I circled around again and saw the woman and yelled at her from within my car. I said something like \"get that dog on a lease\". I realized having been in the car I would be visualized as the aggressor and left salty. I realized it's stupid too because, people have guns. I told my wife and we decided it's better not to talk to anyone in public because we don't know how angry or violent they can be. I mean if you have a pitbull why not a gun? It's the same fantasy. And in that situation she, the owner, could have been frightened by me.\n\nI'm especially afraid for my wife's safety if she takes out the trash without me being there. She's not super observant and tries to ignore people so I'm afraid she wouldn't see the dog until it's too late. Not to mention I see kids playing in that direction these days...\n\nMy life is unsafe because some asshats can live their killer dog fantasy. I don't give a rat's ass, they need not be bred anymore. \n\nGet these things out of my neighborhood.\n\nCall animal patrol every time my friend.\n\nUnleash your inner Karen.", "created_utc": "1665315329.0", "edited": "1665316361.0", "id": "irmfuz2", "is_submitter": "False", "link_id": "t3_xz3sza", "parent_id": "t1_irlw6dw", "score": "1", "subreddit": "TerrifyingAsFuck", "subreddit_id": "t5_31d92"}, {"author": "espressoBump", "body": "Go Vote.", "created_utc": "1665101909.0", "edited": "False", "id": "ircjopl", "is_submitter": "False", "link_id": "t3_xxdxbk", "parent_id": "t1_irbvsev", "score": "3", "subreddit": "politics", "subreddit_id": "t5_2cneq"}, {"author": "espressoBump", "body": "That's what brought us into this timeline.", "created_utc": "1665015671.0", "edited": "False", "id": "ir7zix5", "is_submitter": "False", "link_id": "t3_xwk6s2", "parent_id": "t1_ir72qci", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "espressoBump", "body": "Entitled car owners.", "created_utc": "1664882215.0", "edited": "False", "id": "ir03c6z", "is_submitter": "False", "link_id": "t3_xuqcyy", "parent_id": "t1_iqxxi6a", "score": "47", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "espressoBump", "body": "Lol. My company offshored work to Asia, Brazil, and India now they're overworked and work from home.", "created_utc": "1664870671.0", "edited": "False", "id": "iqzpb4w", "is_submitter": "False", "link_id": "t3_xuu6pv", "parent_id": "t3_xuu6pv", "score": "1", "subreddit": "antiwork", "subreddit_id": "t5_2y77d"}, {"author": "espressoBump", "body": "This is impressive. You're the type of person I'm talking about! So how long have you been studying your languages? And if you don't mind me asking what do you do for work?", "created_utc": "1664549425.0", "edited": "False", "id": "iqi7fyu", "is_submitter": "True", "link_id": "t3_xryh7n", "parent_id": "t1_iqi5wby", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "espressoBump", "body": "This is my goal.", "created_utc": "1664544394.0", "edited": "False", "id": "iqhvtd5", "is_submitter": "True", "link_id": "t3_xryh7n", "parent_id": "t1_iqhpdbi", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "espressoBump", "body": "I didn't understand his last video about voting early.... I have my day penciled in. Are there any polling locations that open early? But he seems like an awesome dude.", "created_utc": "1664478908.0", "edited": "False", "id": "iqekb3a", "is_submitter": "False", "link_id": "t3_xr68gh", "parent_id": "t3_xr68gh", "score": "3", "subreddit": "ncpolitics", "subreddit_id": "t5_2sfme"}, {"author": "espressoBump", "body": "But y'all didn't vote?", "created_utc": "1664420775.0", "edited": "False", "id": "iqbmnnq", "is_submitter": "False", "link_id": "t3_xqm1by", "parent_id": "t3_xqm1by", "score": "1", "subreddit": "worldnews", "subreddit_id": "t5_2qh13"}, {"author": "espressoBump", "body": "Makes sense I had an existential crisis on salvia and a existential revival on MDMA.", "created_utc": "1664420708.0", "edited": "False", "id": "iqbmj26", "is_submitter": "False", "link_id": "t3_xqc7su", "parent_id": "t3_xqc7su", "score": "1", "subreddit": "science", "subreddit_id": "t5_mouw"}, {"author": "espressoBump", "body": "Ok for something \"newer\" Blood Sugar Sex Magic - RHCP. I used to run to it.", "created_utc": "1664415489.0", "edited": "False", "id": "iqbbozd", "is_submitter": "False", "link_id": "t3_xqi5n6", "parent_id": "t3_xqi5n6", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "espressoBump", "body": "It's actually a small amount of money but I could live comfortably on it. All of my basic necessities would be covered except living. Like if I needed to go grocery shopping I could simply spend $1,000 that day which is way too much, or whatever day of the year I needed to buy new clothes I can spend a thousand or even the next day I could just spend a thousand again.\n\nI wouldn't be able to buy a house immediately, and $1,000 isn't really enough for rent anywhere in the United States or most countries around the world so I would still have to work but I could save all that money that I'm not spending on rent to save up. I would definitely designate one day of the week or a few days in the month where I would just keep giving people I know money, charities and organizations I admire. At some point 1k a day is too much.", "created_utc": "1664325329.0", "edited": "False", "id": "iq6dgl2", "is_submitter": "False", "link_id": "t3_xpgvdb", "parent_id": "t3_xpgvdb", "score": "1", "subreddit": "AskMen", "subreddit_id": "t5_2s30g"}, {"author": "espressoBump", "body": "I just think it's more natural for human hierarchies to be corrupt. Most people will get away with as much as they can as long as there aren't any consequences. People who assume power and are on the top of hierarchies are probably more likely to make bold decisions that the rest of us won't, plus they're egotistical narcissists. When they're weighing risks versus benefits they'll probably just take risks we wouldn't. Meanwhile, the \"nice\" people are being too nice. I've gone to a few DSA meetings and they vote for eeeeeverything. It takes so long for anything to get done and it's just too mentally taxing. Point being, evil people will get voted into power more easily than good people and the generally public has no reason to sacrifice a thing, because it takes work, and it's easier to let the powers that be run until it actually affects them. Once they're affected it's too late.", "created_utc": "1664324543.0", "edited": "False", "id": "iq6bsy0", "is_submitter": "False", "link_id": "t3_xpcmj8", "parent_id": "t3_xpcmj8", "score": "1", "subreddit": "dankmemes", "subreddit_id": "t5_2zmfe"}, {"author": "espressoBump", "body": "It's like Santa Claus, he certainly isn't real but everyone knows what you're talking about and likes to believe in it. Unless you're an asshole.", "created_utc": "1664245863.0", "edited": "False", "id": "iq20pe4", "is_submitter": "False", "link_id": "t3_xom74h", "parent_id": "t1_ipzqnna", "score": "2", "subreddit": "NoStupidQuestions", "subreddit_id": "t5_2w844"}, {"author": "espressoBump", "body": "He also dodges a car but doesn't really know it, that's skill.", "created_utc": "1664244070.0", "edited": "False", "id": "iq1wrz0", "is_submitter": "False", "link_id": "t3_xombp4", "parent_id": "t1_ipzlwii", "score": "1", "subreddit": "CrazyFuckingVideos", "subreddit_id": "t5_45hae8"}, {"author": "espressoBump", "body": "Yeah, let's make sure our boy Snowden is safe. Also, feel the same way about Assange. I mean I'm not Australian but wgaf m8.", "created_utc": "1664243518.0", "edited": "False", "id": "iq1vk3j", "is_submitter": "False", "link_id": "t3_xonl8h", "parent_id": "t1_iq0foh7", "score": "1", "subreddit": "worldnews", "subreddit_id": "t5_2qh13"}, {"author": "espressoBump", "body": "Because all of the sad and good stuff. But also I just like getting up and morning and looking outside, breathing air.", "created_utc": "1664243282.0", "edited": "False", "id": "iq1v1az", "is_submitter": "False", "link_id": "t3_xoow7a", "parent_id": "t3_xoow7a", "score": "1", "subreddit": "DebateAnAtheist", "subreddit_id": "t5_2ryfy"}, {"author": "espressoBump", "body": "Sorry am I misunderstanding the graph? There were 9 Republican \"Yeas\"", "created_utc": "1664032294.0", "edited": "False", "id": "ipq3it5", "is_submitter": "False", "link_id": "t3_xlwfz8", "parent_id": "t3_xlwfz8", "score": "1", "subreddit": "ncpolitics", "subreddit_id": "t5_2sfme"}, {"author": "espressoBump", "body": "Hell yes. Thank you.", "created_utc": "1664027124.0", "edited": "False", "id": "ippsmtv", "is_submitter": "False", "link_id": "t3_xmrwhw", "parent_id": "t1_ippme46", "score": "1", "subreddit": "NoStupidQuestions", "subreddit_id": "t5_2w844"}, {"author": "espressoBump", "body": "This is manslaughter", "created_utc": "1663996088.0", "edited": "False", "id": "ipon4cm", "is_submitter": "False", "link_id": "t3_xm85ck", "parent_id": "t1_ipn2s1h", "score": "1", "subreddit": "PublicFreakout", "subreddit_id": "t5_2yrq6"}, {"author": "espressoBump", "body": "Small claims court is better than a gun! I've heard of people just looking for a reason. This is why I don't beep anymore while driving.", "created_utc": "1663987217.0", "edited": "False", "id": "ipo8o1v", "is_submitter": "False", "link_id": "t3_xm25bl", "parent_id": "t1_ipo8c3a", "score": "3", "subreddit": "raleigh", "subreddit_id": "t5_2r0z3"}, {"author": "espressoBump", "body": "This happened to me and my co worker too. They only steal lose change because no one would bother bringing them to small claims court.", "created_utc": "1663980128.0", "edited": "False", "id": "ipnuz7p", "is_submitter": "False", "link_id": "t3_xm25bl", "parent_id": "t1_ipm9juv", "score": "3", "subreddit": "raleigh", "subreddit_id": "t5_2r0z3"}, {"author": "espressoBump", "body": "I mean, the overall quality is bad even if you cherry pick a few places, but what would you recommend for a guinea like me?", "created_utc": "1663960031.0", "edited": "False", "id": "ipmnuod", "is_submitter": "False", "link_id": "t3_xlkwaw", "parent_id": "t1_ipm8opc", "score": "1", "subreddit": "raleigh", "subreddit_id": "t5_2r0z3"}, {"author": "espressoBump", "body": "Thank you! That's helpful.", "created_utc": "1663944869.0", "edited": "False", "id": "iplpp4h", "is_submitter": "True", "link_id": "t3_xlfw6d", "parent_id": "t1_ipkknhd", "score": "2", "subreddit": "Korean", "subreddit_id": "t5_2rd8q"}, {"author": "espressoBump", "body": "Bro. Anything to make the food down here better. Please, come New Jerseyites.", "created_utc": "1663934478.0", "edited": "False", "id": "ipl5l15", "is_submitter": "False", "link_id": "t3_xlkwaw", "parent_id": "t1_ipkacpc", "score": "12", "subreddit": "raleigh", "subreddit_id": "t5_2r0z3"}, {"author": "espressoBump", "body": "First I tried living in my college town and couldn't make ends meet. I moved out of the country, life was great. Came back to the US and couldn't afford living on my own again so I moved around the county until I got a job that I could pay *to rent*. It ain't easy here that's for sure. I definitely moved in and out of my parents house adjusting to different places.", "created_utc": "1663847099.0", "edited": "False", "id": "ipgfmgh", "is_submitter": "False", "link_id": "t3_xkrpev", "parent_id": "t3_xkrpev", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "espressoBump", "body": "Bro. How many subs do you go on to look for real political and social change? Reddit is not the place it's just an influence.", "created_utc": "1663820537.0", "edited": "False", "id": "ipfg2fl", "is_submitter": "False", "link_id": "t3_xkmesm", "parent_id": "t3_xkmesm", "score": "7", "subreddit": "fuckcars", "subreddit_id": "t5_3cs2l"}, {"author": "espressoBump", "body": "My brain didn't process like or guppy", "created_utc": "1663769382.0", "edited": "False", "id": "ipbzpy6", "is_submitter": "False", "link_id": "t3_xk2rk8", "parent_id": "t1_ipbyza9", "score": "14", "subreddit": "WhitePeopleTwitter", "subreddit_id": "t5_35n7t"}, {"author": "espressoBump", "body": "Swapping Melanias is funny. Swapping her with a 4 year old is disgusting and brings up the resentment I already have for Trump which makes me entertain the idea if he would do such a thing. Yuck.", "created_utc": "1663767247.0", "edited": "False", "id": "ipbunuq", "is_submitter": "False", "link_id": "t3_xk2rk8", "parent_id": "t3_xk2rk8", "score": "-36", "subreddit": "WhitePeopleTwitter", "subreddit_id": "t5_35n7t"}, {"author": "espressoBump", "body": "What is she being held accountable for?", "created_utc": "1663766859.0", "edited": "False", "id": "ipbtrnh", "is_submitter": "False", "link_id": "t3_xk0fe0", "parent_id": "t1_ipbea3w", "score": "1", "subreddit": "WhitePeopleTwitter", "subreddit_id": "t5_35n7t"}, {"author": "espressoBump", "body": "If they like Desantis they're probably happy about it. Don't underestimate how stupid these people can be they still donate to Trump. Why the fuck would anyone give money to Trump in the first place?", "created_utc": "1663755701.0", "edited": "False", "id": "ipb9njl", "is_submitter": "False", "link_id": "t3_xjrt6k", "parent_id": "t1_ipa9t6x", "score": "3", "subreddit": "news", "subreddit_id": "t5_2qh3l"}, {"author": "espressoBump", "body": "I dislike Republicans and am voting all Democrat (there's no independents with enough traction for me to vote for in my state and I don't want the crazies to win) but Im sure a few Democrats are up to no good, but I think insider trading is equally as and more Democrats do it.", "created_utc": "1663710253.0", "edited": "False", "id": "ip90wz5", "is_submitter": "False", "link_id": "t3_xjgwl3", "parent_id": "t1_ip8am3b", "score": "1", "subreddit": "politics", "subreddit_id": "t5_2cneq"}, {"author": "espressoBump", "body": "What is justice?", "created_utc": "1663636603.0", "edited": "False", "id": "ip517jx", "is_submitter": "False", "link_id": "t3_xip1u2", "parent_id": "t1_ip4in07", "score": "1", "subreddit": "psychology", "subreddit_id": "t5_2qhcz"}, {"author": "espressoBump", "body": "How do we get these things into existence? Pressure our local representatives? Go to town halls? This is a serious question I keep seeing these things people want, like ranked choice voting, but it's not a thing where I live.", "created_utc": "1663576829.0", "edited": "False", "id": "ip1h8qv", "is_submitter": "False", "link_id": "t3_xhlxjf", "parent_id": "t1_iozcvtx", "score": "1", "subreddit": "politics", "subreddit_id": "t5_2cneq"}, {"author": "espressoBump", "body": "I'm a pessimist for humanity too, we're all going to die, but I'm not going to be someone who bitches and doesn't do anything about it. Real change happens in this world. Your one vote isn't responsible for the fate of humanity but when people are dedicated to making something happen it can change, just think of technology if politics is too tiresome for you. You don't have to vote that's fine, but for us that do it will make a change.\n\nWhen people stop believing is when it fails. I totally agree that the act of voting may not make the change or be the means to the end we need but I don't think the anarchist/nihilist perspective of just ignoring the issue and do nothing, indifference, is a recipe for failure.\n\nOf course, the structure of voting could be completely broken but if that's the case we just need to take our energy, organize and do something else to achieve the change we need.", "created_utc": "1663539816.0", "edited": "False", "id": "iozlad2", "is_submitter": "False", "link_id": "t3_xhhapq", "parent_id": "t1_iozjd7p", "score": "7", "subreddit": "atheism", "subreddit_id": "t5_2qh2p"}, {"author": "espressoBump", "body": "It does go vote.", "created_utc": "1663538665.0", "edited": "False", "id": "iozihj9", "is_submitter": "False", "link_id": "t3_xhhapq", "parent_id": "t1_iozhla1", "score": "4", "subreddit": "atheism", "subreddit_id": "t5_2qh2p"}, {"author": "espressoBump", "body": "Starting fights", "created_utc": "1663534941.0", "edited": "False", "id": "ioz8ykj", "is_submitter": "False", "link_id": "t3_xhocft", "parent_id": "t1_ioylscd", "score": "1", "subreddit": "AskMen", "subreddit_id": "t5_2s30g"}, {"author": "espressoBump", "body": "It's all so stupid. Romani and Arabs are white people according to the US Census because they're from the peoples deriving from the Caucaus (like all \"white\" people). Spaniards can be Latino which is especially stupid because the word derives from a perosn coming from Latin America, not Latins who are the predecessors of all the Latin Languages which is where some of the culture (at least Spanish comes from not necessarily all of the people) \n\n Putting people into races isn't right at all, there are way too many ethnic groups who don't fit nearly into our broad categories, there's so many that white black brown and asian doesn't really do them justice (for example the many different peoples of the many different counties in Africa), and an ethnic groups racial status changes overtime, Italian, Irish and today likely Latinos.\n\nWhatever disney just start making new shit.", "created_utc": "1663524592.0", "edited": "1663526512.0", "id": "ioygjcw", "is_submitter": "False", "link_id": "t3_xh8zku", "parent_id": "t1_iowhe9f", "score": "3", "subreddit": "Funnymemes", "subreddit_id": "t5_2xqtc"}, {"author": "espressoBump", "body": "This is what bothers me - it's a leopards ate my face type  of selfishness. Knowing humanity will end by climate change vindicates their belief that their storm god will save them because they're so egotistical they can't comprehend being condemned for life and this is their opportunity to prove it at the expense of humanity. Not only do they think their beliefs in their Christian god will be vindicated but they'll also be morally exonerated. They should read the old testament because  the o.g. Yahweh yeets the Isreali ethnic group practically every time it rains; obviously it's all fictional and likely written for some political gain and social cohesion, but point being if that's the same god they choose to acknowledge his character is more likely to want to see the majority of his followers burn to death and throw their souls in an abyss of nothingness. Even Jesus makes it clear most people won't join his god. To summarize not only is it clear to me they got the message wrong, but also they're willing to sacrifice all of humanity for it. I'm an atheist and I vote.", "created_utc": "1663516626.0", "edited": "False", "id": "ioxvjgi", "is_submitter": "False", "link_id": "t3_xhhapq", "parent_id": "t1_ioxsldd", "score": "40", "subreddit": "atheism", "subreddit_id": "t5_2qh2p"}, {"author": "espressoBump", "body": "It's really the rest of the world. Korea is amazing, super safe.", "created_utc": "1663422154.0", "edited": "False", "id": "iosnm7x", "is_submitter": "False", "link_id": "t3_xfwlcv", "parent_id": "t1_ioqr874", "score": "1", "subreddit": "iamatotalpieceofshit", "subreddit_id": "t5_3jj03"}, {"author": "espressoBump", "body": "My poor wife!", "created_utc": "1663406971.0", "edited": "False", "id": "iorzzw0", "is_submitter": "False", "link_id": "t3_xg4zv0", "parent_id": "t3_xg4zv0", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "espressoBump", "body": "Neither of them should operate a car; he's mentally unstable and she's too old. Unfortunately, we live in a society that's dependent upon cars and these two represent a large part of the population. Best thing you can do is drive defensively, be kind, and hope no one pulls a gun on you.", "created_utc": "1663333879.0", "edited": "False", "id": "iontc4w", "is_submitter": "False", "link_id": "t3_xfoyos", "parent_id": "t3_xfoyos", "score": "9", "subreddit": "raleigh", "subreddit_id": "t5_2r0z3"}, {"author": "espressoBump", "body": "Go vote and hold your friends and family accountable. Joe Biden got the most votes in US presidential history, second is Trump. We haven't won this race yet.", "created_utc": "1663297440.0", "edited": "False", "id": "ioman96", "is_submitter": "False", "link_id": "t3_xewuvj", "parent_id": "t1_ioj92j8", "score": "1", "subreddit": "PoliticalHumor", "subreddit_id": "t5_2qm21"}, {"author": "espressoBump", "body": "They're probably just two dudes who typed your name into the same \"when will I do\" Myspace quiz that used the same formula, your name, to come up with the same answer... August 27th.", "created_utc": "1663209535.0", "edited": "False", "id": "iohcgx5", "is_submitter": "False", "link_id": "t3_xdye1j", "parent_id": "t1_ioe6d6n", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "espressoBump", "body": "But leaving fingerprints on the money... there's always a way.", "created_utc": "1663209234.0", "edited": "False", "id": "iohbtnf", "is_submitter": "False", "link_id": "t3_xdye1j", "parent_id": "t1_ioe17g5", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "espressoBump", "body": "I get depressed on Sundays for this reason.", "created_utc": "1663209168.0", "edited": "False", "id": "iohbojz", "is_submitter": "False", "link_id": "t3_xdye1j", "parent_id": "t1_iodr24l", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "espressoBump", "body": "It's not East Coast it's just gotten worst nationally over the last 10-15 years.  I say this because I grew up on the East Coast and never understood why we were labelled such bad drivers when I would go anywhere else and see they were just as bad, and worse in their own ways. Like the worst place to be a pedestrian is California, and there morning news let's you know so you can adjust your route or leave early. Is it raining? Do you live in the south? There *will* be an accident on the way to your destination. IMO the south has the worst drivers because they are way more dangerous, but collectively America is just a car brain society with too many hot headed and entitled idiots that shouldn't have a license, so we're all at fault. Best drivers are sparsely populated areas like Utah.", "created_utc": "1663115418.0", "edited": "False", "id": "iobxx2z", "is_submitter": "False", "link_id": "t3_xdcjvj", "parent_id": "t1_ioa6oxd", "score": "1", "subreddit": "IdiotsInCars", "subreddit_id": "t5_3aimx"}, {"author": "espressoBump", "body": "Yeah, this is torture and it's not funny at all. I get really mad at many of the crimes inmates have committed but we still have to treat them humanely. I have a hard time accepting my own statement especially for heinous and violent crimes but this itself is also a crime. I hope these officers are punished.", "created_utc": "1663071526.0", "edited": "False", "id": "io8xnvp", "is_submitter": "False", "link_id": "t3_xcnuzz", "parent_id": "t1_io6jkut", "score": "1", "subreddit": "nottheonion", "subreddit_id": "t5_2qnts"}, {"author": "espressoBump", "body": "I was a fan but I had to stop watching.", "created_utc": "1662969071.0", "edited": "False", "id": "io3j7w3", "is_submitter": "False", "link_id": "t3_xbwyyf", "parent_id": "t3_xbwyyf", "score": "1", "subreddit": "antiwork", "subreddit_id": "t5_2y77d"}, {"author": "espressoBump", "body": "lol what the fuck is wrong with this dude...", "created_utc": "1662817613.0", "edited": "False", "id": "inusaxn", "is_submitter": "False", "link_id": "t3_x9yfg6", "parent_id": "t3_x9yfg6", "score": "1", "subreddit": "WhitePeopleTwitter", "subreddit_id": "t5_35n7t"}, {"author": "espressoBump", "body": "It's really just how powerful cults are. Look at any other cult, look at maga people, look at the rest of Christianity. The bible has little significance, it's all about being a rank and file member of the culture (loyal). It's no surprise to me a group of people subjugated by the bible took it and fell for it.", "created_utc": "1662773975.0", "edited": "False", "id": "insy8n6", "is_submitter": "False", "link_id": "t3_xa9rs5", "parent_id": "t3_xa9rs5", "score": "1", "subreddit": "atheism", "subreddit_id": "t5_2qh2p"}, {"author": "espressoBump", "body": "That's why I stopped riding. I also have a dashcam now, people are insane these days.", "created_utc": "1662762119.0", "edited": "False", "id": "ins959q", "is_submitter": "False", "link_id": "t3_x9rzr5", "parent_id": "t1_inpprsd", "score": "1", "subreddit": "IdiotsInCars", "subreddit_id": "t5_3aimx"}, {"author": "espressoBump", "body": "Yeah people have been pretty awful to me. I'm 5'1\". Women have repetitively made it clear throughout my life that I am not attractive solely based on my height. In high school my gf told me that at her friends decided I'd be attractive if only I were taller. After college, I went out with a women I had feelings for and when we arrived at the bar we saw her friend. She said how'd you get her? She said I drove and she laughed and said \"can he even reach the pedals\". Two months ago I went out with some of my colleagues and the bouncer stopped me to say \"You have to be this tall to get on the ride\". I don't let it stop me but when I was in college, I had to learn that I'm very different and it hurt. I'm happily married and have dated a lot of women, it's not an issue. Because there's such a stigma on short men I seriously wonder if they have shorter running times in the military. That's really all I wanted to know.", "created_utc": "1662756494.0", "edited": "False", "id": "inrw0f5", "is_submitter": "False", "link_id": "t3_x9swcy", "parent_id": "t1_inr4c71", "score": "1", "subreddit": "OldSchoolCool", "subreddit_id": "t5_2tycb"}, {"author": "espressoBump", "body": "Im short. It's empowering to see a short man as a soldier! I have wondered if really short dudes can keep up with top athletes. Being a solider encompasses many different types of athletic prowess which could be a challenge for shorter dudes. Does anyone know his height? How many short dudes are in the army?", "created_utc": "1662733934.0", "edited": "False", "id": "inqbuw8", "is_submitter": "False", "link_id": "t3_x9swcy", "parent_id": "t3_x9swcy", "score": "-12", "subreddit": "OldSchoolCool", "subreddit_id": "t5_2tycb"}, {"author": "espressoBump", "body": "Hmmm. Then I think your argument should be drivers are more dangerous here (the south) than most of the US. LA might be the only competitor.\n\nThe safety for cyclists and pedestrians is as good as it gets, it the drivers. If you want anything safer it simply doesn't exist. What do you think?", "created_utc": "1662728876.0", "edited": "False", "id": "inq0f8q", "is_submitter": "False", "link_id": "t3_x9iqmx", "parent_id": "t1_inpoeby", "score": "1", "subreddit": "raleigh", "subreddit_id": "t5_2r0z3"}, {"author": "espressoBump", "body": "I absolutely disagree. It's one way for the conception to spread. Most Americans haven't even seen good public transportation, but it's out there. Minimally, the subreddit is great so people can visualize a better America. It's not real change because that would take further organizing like everything else. I don't think any subreddit is going to make people organizers but it may introduce them to something new, stop hating. If you don't like it then ignore it, don't subscribe to it.", "created_utc": "1662725118.0", "edited": "False", "id": "inpswn9", "is_submitter": "False", "link_id": "t3_x9iqmx", "parent_id": "t1_inpp0tn", "score": "3", "subreddit": "raleigh", "subreddit_id": "t5_2r0z3"}, {"author": "espressoBump", "body": "Raleigh is the best  city of a country that has the worst infrastructure for pedestrians and cyclists. So let me introduce you to r/fuckcars my friend! But anyway, no matter the argument it would be foolish to have because all cities, especially the major ones, are not great places for pedestrians and cyclists. So it's hard comparing such a rural place to NYC or LA - or better yet Sydney or Seoul. You'd have to compare Raleigh with a similar population size so maybe Long Beach CA or Colorado Springs Colorado? A simple google search makes these places look like bike havens on google maps. I would put all 3 on top of my list of great towns to cycle in; comparable to college towns across the US. But once you're off that path you're as good as dead. That's just the American experience.\n\nHere are things I agree with (US in general): everything is too far. Even if you have a bike it's impossible to get anywhere useful unless you live in a college town. The public transportation is lacking, and cities with good transportation are extremely dirty and have tons of homeless people. Cars are getting bigger and taking up too much of the road.", "created_utc": "1662719028.0", "edited": "False", "id": "inpj4rf", "is_submitter": "False", "link_id": "t3_x9iqmx", "parent_id": "t3_x9iqmx", "score": "10", "subreddit": "raleigh", "subreddit_id": "t5_2r0z3"}, {"author": "espressoBump", "body": "I'm forced to downvote you because some dumb fuck is gonna believe it", "created_utc": "1662687148.0", "edited": "False", "id": "ino4hs3", "is_submitter": "False", "link_id": "t3_x9ciwd", "parent_id": "t1_innqz9h", "score": "7", "subreddit": "WhitePeopleTwitter", "subreddit_id": "t5_35n7t"}, {"author": "espressoBump", "body": "What kind of crap tweet is this? This is the stupid primal shit I hate from the Republican party. I don't like the Democrats, but I hate Republicans a whole lot more. Dems look great compared to the goofy and immature Trump and Bush, but my god, I don't want them to be my presidents they're just the next best thing.", "created_utc": "1662684968.0", "edited": "False", "id": "innzg7n", "is_submitter": "False", "link_id": "t3_x90v40", "parent_id": "t3_x90v40", "score": "1", "subreddit": "WhitePeopleTwitter", "subreddit_id": "t5_35n7t"}, {"author": "espressoBump", "body": "Now you know why I'm an atheist", "created_utc": "1662512099.0", "edited": "False", "id": "ine1bnb", "is_submitter": "False", "link_id": "t3_x7bv7f", "parent_id": "t3_x7bv7f", "score": "0", "subreddit": "oddlyterrifying", "subreddit_id": "t5_2yo6b"}, {"author": "espressoBump", "body": "You can be considered latino by the US census because it includes people from Spain. I assume that's because America competed with Spain over control in Latin American countries.", "created_utc": "1662511154.0", "edited": "False", "id": "indz801", "is_submitter": "False", "link_id": "t3_x7fivr", "parent_id": "t1_incly1m", "score": "1", "subreddit": "BlackPeopleTwitter", "subreddit_id": "t5_33x33"}, {"author": "espressoBump", "body": "I also don't want to ask my relatives who voted for Trump about this because I'm concerned they've just gone further down the rabbit hole.", "created_utc": "1662470616.0", "edited": "False", "id": "inb7adx", "is_submitter": "False", "link_id": "t3_x6t3v7", "parent_id": "t1_in9ge14", "score": "2", "subreddit": "politics", "subreddit_id": "t5_2cneq"}, {"author": "espressoBump", "body": "The mode of transportation hasn't changed at all....", "created_utc": "1662205268.0", "edited": "False", "id": "imwydxg", "is_submitter": "False", "link_id": "t3_x48hx0", "parent_id": "t3_x48hx0", "score": "1", "subreddit": "OldSchoolCool", "subreddit_id": "t5_2tycb"}, {"author": "espressoBump", "body": "No one's going to mention that claw reach she has? It's like when the limbs snap in stranger things", "created_utc": "1662152563.0", "edited": "False", "id": "imuht4w", "is_submitter": "False", "link_id": "t3_x46mbt", "parent_id": "t3_x46mbt", "score": "1", "subreddit": "BeAmazed", "subreddit_id": "t5_363r3"}, {"author": "espressoBump", "body": "Because my girlfriend's boyfriend has a lot of it so I think she likes it.", "created_utc": "1662086055.0", "edited": "False", "id": "imqw4m5", "is_submitter": "False", "link_id": "t3_x3jd0h", "parent_id": "t3_x3jd0h", "score": "1", "subreddit": "Wallstreetsilver", "subreddit_id": "t5_3ug1ww"}, {"author": "espressoBump", "body": "I feel like we just shut the devil back into its possessed book. You know, one of those movies where the kids from the block have to fight a demon in order for the world not to burn. The demon came out of a book, the kids are the US, and the black magic is the Republican party. We're shutting that shit in and closing it. We only got about 49 other books. Let's go.", "created_utc": "1662000809.0", "edited": "False", "id": "imm0vp8", "is_submitter": "False", "link_id": "t3_x2tf7c", "parent_id": "t1_imlqvp9", "score": "1", "subreddit": "politics", "subreddit_id": "t5_2cneq"}, {"author": "espressoBump", "body": "... this was a question", "created_utc": "1661963796.0", "edited": "False", "id": "imjhwh4", "is_submitter": "False", "link_id": "t3_x01r2q", "parent_id": "t1_im6hfza", "score": "1", "subreddit": "atheism", "subreddit_id": "t5_2qh2p"}, {"author": "espressoBump", "body": "Goo goo ga ga bang bang.", "created_utc": "1661958583.0", "edited": "False", "id": "imj4dq6", "is_submitter": "False", "link_id": "t3_x23wh4", "parent_id": "t1_imhcs6i", "score": "1", "subreddit": "news", "subreddit_id": "t5_2qh3l"}, {"author": "espressoBump", "body": "I would like to believe the FBI is well coordinated and organized enough that it is aware of the backlash it would cause so they're not just apprehending a previous president. People would be angry, they already organized one attack so I would imagine the FBI knows it would cause more. There's also all of the loose ends that aren't public. This dude lived a complete privileged lifestyle and even more privileged becoming president. If you ask me they have to wait and it seems nothing out of the ordinary for such people.", "created_utc": "1661958402.0", "edited": "False", "id": "imj3x68", "is_submitter": "False", "link_id": "t3_x2aceu", "parent_id": "t1_imiqz0e", "score": "7", "subreddit": "politics", "subreddit_id": "t5_2cneq"}, {"author": "espressoBump", "body": "The park bureaucracy who got that piece of shit and should have installed something better.", "created_utc": "1661827027.0", "edited": "False", "id": "imc77i6", "is_submitter": "False", "link_id": "t3_x0ynqh", "parent_id": "t3_x0ynqh", "score": "1", "subreddit": "wholesomememes", "subreddit_id": "t5_3gcwj"}, {"author": "espressoBump", "body": "Holy shit us too!", "created_utc": "1661823449.0", "edited": "False", "id": "imbzfgg", "is_submitter": "False", "link_id": "t3_x0t82x", "parent_id": "t1_ima4bej", "score": "1", "subreddit": "OldSchoolCool", "subreddit_id": "t5_2tycb"}, {"author": "espressoBump", "body": "Well it turns out they riot anyway so wtf", "created_utc": "1661785567.0", "edited": "False", "id": "im9itts", "is_submitter": "False", "link_id": "t3_x0ey4r", "parent_id": "t3_x0ey4r", "score": "1", "subreddit": "politics", "subreddit_id": "t5_2cneq"}, {"author": "espressoBump", "body": "So this can be taken as something like \"we have united as one from many,\" and not \"there is one great person (or people) out of the many (of the world)\"", "created_utc": "1661722964.0", "edited": "False", "id": "im6hfza", "is_submitter": "False", "link_id": "t3_x01r2q", "parent_id": "t1_im5r7i1", "score": "40", "subreddit": "atheism", "subreddit_id": "t5_2qh2p"}, {"author": "espressoBump", "body": "THIS dude in particular looks like it could be his father wtf", "created_utc": "1661660527.0", "edited": "False", "id": "im39r8u", "is_submitter": "False", "link_id": "t3_wzfq9h", "parent_id": "t1_im2urke", "score": "14", "subreddit": "Damnthatsinteresting", "subreddit_id": "t5_2xxyj"}, {"author": "espressoBump", "body": "The Japanese scientists who ran abhoring experiments on Koreans, Chinese, and South East Asians. They were as bad as  Nazis. Throwing water on limbs in below freezing temperature until they fell off, putting a mother and her baby in a room that cooked from the floor to see what she would do (eventually she steps on the baby). Really fucked up shit.", "created_utc": "1661652635.0", "edited": "False", "id": "im2v9ik", "is_submitter": "False", "link_id": "t3_wzeb1c", "parent_id": "t1_im230ec", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "espressoBump", "body": "Wait till you find out about cars.", "created_utc": "1661640601.0", "edited": "False", "id": "im26okn", "is_submitter": "False", "link_id": "t3_wzaal2", "parent_id": "t1_im1auyk", "score": "14", "subreddit": "Maine", "subreddit_id": "t5_2qts0"}, {"author": "espressoBump", "body": "That's tough man. I would also being lying if I said I don't judge my friends who never eat at home. Come on, like you can't even cook pasta? What did your momma teach you?", "created_utc": "1661612374.0", "edited": "False", "id": "im0cg1x", "is_submitter": "False", "link_id": "t3_wymmzi", "parent_id": "t1_ilzqt32", "score": "2", "subreddit": "lostgeneration", "subreddit_id": "t5_2r40j"}, {"author": "espressoBump", "body": "Last year we invested in a rice cooker, air fryer, and the year before an espresso machine. Life changing! We still get lattes on the weekends but having this stuff at home really means I can have as much as I want without having to worry about price. Bon appetit!\n\nI feel like a lot of our economy is predatory towards families.", "created_utc": "1661612256.0", "edited": "False", "id": "im0c66s", "is_submitter": "False", "link_id": "t3_wymmzi", "parent_id": "t1_ilzpsoq", "score": "3", "subreddit": "lostgeneration", "subreddit_id": "t5_2r40j"}, {"author": "espressoBump", "body": "My wife and I got two burgers, 1 fry and 1 coke at Five Guys on Wednesday and it was $30s. For that amount of money we should have had been given combo meals.   No bacon either, just cheese patties.\n\nI only get fastfood during my lunch break at work, if I'm hungover. Otherwise, I won't eat unless my company is paying for it. My wife and I together used to go out 4x a week when we lived out of the country. There's almost nothing here that's worth (quality and taste) it so we go out 1 once a month.\n\nAnd it's mainly because we just don't want to spend the time cooking and cleaning so we have small handful of business we give our money to that are all on the way home from the gym, because of the lack of public transportation too it's not worth going anywhere just for a shitty pattie.\n\nShe's become a better cook and I love being able to cook everything exactly how I want. Plus, it's much. Cheaper. We only shop at costco (because f grocery stores too) and we finally started saving money (we're on one salary ATM - no kids). If we had to do this in any other country we lived in it would  be challenging because the food was good and all of our friends went out together. In the US, the food is such trash so it has been easy to change our lifestyle. Not to mention you have to tip on top of paying for already shitty food...\n\nAn official boycott would be great. There's no reason for companies to make this much money and not pay their employees for salaried jobs. Don't even get me started with shrinkflation.\n\nEdit: tons of spelling mistakes. Buy an air fryer. Whatever your favorite food is look up how to make it right now and do it tonight. You'll get better overtime. Buy spices too.", "created_utc": "1661597331.0", "edited": "1661611209.0", "id": "ilzkfej", "is_submitter": "False", "link_id": "t3_wymmzi", "parent_id": "t3_wymmzi", "score": "5", "subreddit": "lostgeneration", "subreddit_id": "t5_2r40j"}, {"author": "espressoBump", "body": "I made a post like this and I just got push back \"you obviously don't have kids\". At least I have standards. And if I were to have kids they would too.", "created_utc": "1661596887.0", "edited": "False", "id": "ilzju4w", "is_submitter": "False", "link_id": "t3_wymmzi", "parent_id": "t1_ily9vr4", "score": "9", "subreddit": "lostgeneration", "subreddit_id": "t5_2r40j"}, {"author": "espressoBump", "body": "I want to play devil's advocate. I think things were harder for them psychology. Back then you just accepted shit. I think of this everytime I see a Stephen King movie, and their parents/grandparents came out of WW1/2 - who probably beat the f*** out of them and told them they were useless. So baby boomers are the first generation to not overwhelmingly pass down the physical abuse, but can't avoid the projection because they're still psychology unstable. I'm generalizing, and this is just my assumption.", "created_utc": "1661565490.0", "edited": "False", "id": "ily87sk", "is_submitter": "False", "link_id": "t3_wyf41h", "parent_id": "t3_wyf41h", "score": "8", "subreddit": "lostgeneration", "subreddit_id": "t5_2r40j"}, {"author": "espressoBump", "body": "Tank? When have the Republicans tanked? They have never had a bad year in my lifetime. The majority of the US favors what you're saying but the people who actually vote prefer Republicans over the entire population. If I knew exactly who didn't vote and why then I'd fix the system, I don't know that. I'm only saying I've never seen the Republicans lose any power in my lifetime. My advice is to vote and tell everyone you work with to vote, because this extremism isn't ending by one simple good year of people voting Democrat, it goes beyond that.", "created_utc": "1661473181.0", "edited": "False", "id": "ilt1kvs", "is_submitter": "False", "link_id": "t3_ww1l34", "parent_id": "t1_ilimjc0", "score": "1", "subreddit": "politics", "subreddit_id": "t5_2cneq"}, {"author": "espressoBump", "body": "Welcome to Reddit", "created_utc": "1661472112.0", "edited": "False", "id": "ilsz8x5", "is_submitter": "False", "link_id": "t3_wxohqp", "parent_id": "t1_ils8e3g", "score": "1", "subreddit": "Unexpected", "subreddit_id": "t5_2w67q"}, {"author": "espressoBump", "body": "No we watched the death of normal Christianity and the birth of Christian extremism.", "created_utc": "1661465471.0", "edited": "False", "id": "ilsk3fw", "is_submitter": "False", "link_id": "t3_wxgtyu", "parent_id": "t3_wxgtyu", "score": "1", "subreddit": "atheism", "subreddit_id": "t5_2qh2p"}, {"author": "espressoBump", "body": "It's never a good time to drive like an idiot.", "created_utc": "1661434424.0", "edited": "False", "id": "ilqcbgy", "is_submitter": "False", "link_id": "t3_wwirwb", "parent_id": "t1_ilq6t0w", "score": "1", "subreddit": "science", "subreddit_id": "t5_mouw"}, {"author": "espressoBump", "body": "I get what you're saying, but the obvious one at fault is always the person in a 1-ton speeding death trap. It looks like the same phenomenon as blaming the victim, not that I would ever advocate for cyclists being some sort of minority group persecuted, no; it's just the mindset most Americans have because they're ignorant to cycling.\n\nA few days ago, there was a post on unpopular opinion blaming pedestrians for having too much immunity and saying they're at fault for \"stepping out in traffic more than ever before.\" Yeah, no. Cars are a convenience. We need to understand the absurd privilege it is to have them historically. Average people can get to many places faster than at any other point in history. It's a luxury, and we're abusing it.  Not to mention how empowered each individual is by having their own car. The planet is being destroyed and most idiots can't even slow down or stop for cyclists never mind considering a society with good public transportation.", "created_utc": "1661426319.0", "edited": "False", "id": "ilpw7f6", "is_submitter": "False", "link_id": "t3_wwirwb", "parent_id": "t1_ilp4pbq", "score": "1", "subreddit": "science", "subreddit_id": "t5_mouw"}, {"author": "espressoBump", "body": "Yeah I mean that's pretty much how I feel about cars. A majority of drivers are just incompetent. Like the way you worry about a measly dude on a bicycle going 16mph maybe weighing double his weight do to velocity is nothing compared to the asshole tailgating on the highway in a 2 ton truck going 80 MPH who could injure everyone around them. People have to really focus on bad driving instead of bicycles. A bike will never do as much damage as a car. Cars are dangerous. Look up the amount of bicycle deaths per year versus cars. \n\nLet's get high speed rail and bike lanes!!!!!!", "created_utc": "1661390579.0", "edited": "False", "id": "ilobvs2", "is_submitter": "False", "link_id": "t3_wwirwb", "parent_id": "t1_ilnz6wn", "score": "3", "subreddit": "science", "subreddit_id": "t5_mouw"}, {"author": "espressoBump", "body": "Just collectively listening to Democracy now and being on Reddit, but a quick Google search says I'm wrong. I swear that's what I heard people say; maybe that's my misunderstanding. I'll update my post.", "created_utc": "1661298858.0", "edited": "False", "id": "iliz9qx", "is_submitter": "False", "link_id": "t3_wvsy1i", "parent_id": "t1_ilit6qj", "score": "4", "subreddit": "news", "subreddit_id": "t5_2qh3l"}, {"author": "espressoBump", "body": "They use the word left to talk about conservatives, that's my point. The continuum is reversed if you're comparing them as two separate sets of data, not the same. Otherwise I see why I'm being downvoted.", "created_utc": "1661295016.0", "edited": "False", "id": "iliqd9q", "is_submitter": "False", "link_id": "t3_wvsy1i", "parent_id": "t1_ilip1y6", "score": "-5", "subreddit": "news", "subreddit_id": "t5_2qh3l"}, {"author": "espressoBump", "body": "I think that's true on fiscal issues but not social, Europeans are still pretty conservative socially. Especially more homogeneous countries. \n\nSo I said it mind of wrong. The same conservative in America would be to the EXTREME left in Europe, on their scale. Because to the left means your conservative", "created_utc": "1661291739.0", "edited": "False", "id": "iliiee1", "is_submitter": "False", "link_id": "t3_wvsy1i", "parent_id": "t1_ilihwrh", "score": "-12", "subreddit": "news", "subreddit_id": "t5_2qh3l"}, {"author": "espressoBump", "body": "Edit: I'm def wrong. Don't even bother reading.\n\nFor my fellow uninformed Americans. I believe in most of Europe they're left is our right and our right is their left. So a conservative in America is to the right but that same conservative in German leans left.", "created_utc": "1661291426.0", "edited": "1661298889.0", "id": "ilihlrr", "is_submitter": "False", "link_id": "t3_wvsy1i", "parent_id": "t1_ilids0f", "score": "-10", "subreddit": "news", "subreddit_id": "t5_2qh3l"}, {"author": "espressoBump", "body": "Whose god? What is god?", "created_utc": "1661259484.0", "edited": "False", "id": "ilg7xb5", "is_submitter": "False", "link_id": "t3_wvkjk0", "parent_id": "t1_ilfv8n8", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "espressoBump", "body": "Oh hello me. I moved from up North, my wife moved here from the other side of the world. We HATE the cockroaches and they crawled on us too.\n\nThe huge red and brown nightmarish ones come in especially when it rains a lot. They live outside but come inside when it rains, so it's not alarming although disgusting. The black ones mean there's an infestation in the building. This is what everyone says and it sounds like at that point you're f*cked. Oddly we get those too but have only had to kill 8-10 last year and 8 this year in total, combining both kinds of roaches.\n\nStay clean, use pesticide and expect it to die down in the fall/winter. Sorry you're dealing with this! We hate it too.", "created_utc": "1661105191.0", "edited": "False", "id": "il7xv08", "is_submitter": "False", "link_id": "t3_wu082g", "parent_id": "t3_wu082g", "score": "2", "subreddit": "raleigh", "subreddit_id": "t5_2r0z3"}, {"author": "espressoBump", "body": "How much do you spend on groceries a month?", "created_utc": "1661096991.0", "edited": "False", "id": "il7dqrb", "is_submitter": "False", "link_id": "t3_wtx9vi", "parent_id": "t1_il6yqv6", "score": "7", "subreddit": "jobs", "subreddit_id": "t5_2qhnd"}, {"author": "espressoBump", "body": "Or you better get your hands on 23andme", "created_utc": "1661096013.0", "edited": "False", "id": "il7be5l", "is_submitter": "False", "link_id": "t3_wtlqw8", "parent_id": "t3_wtlqw8", "score": "1", "subreddit": "funny", "subreddit_id": "t5_2qh33"}, {"author": "espressoBump", "body": "I didn't even check just your comment looked odd", "created_utc": "1661095713.0", "edited": "False", "id": "il7ap0a", "is_submitter": "True", "link_id": "t3_wte7ei", "parent_id": "t1_il78ex3", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "espressoBump", "body": "Is this a bot?", "created_utc": "1661091334.0", "edited": "False", "id": "il70ksj", "is_submitter": "True", "link_id": "t3_wte7ei", "parent_id": "t1_il4yw8u", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "espressoBump", "body": "Yes, I mean, we are essentially talking about Plato's forms.", "created_utc": "1661091314.0", "edited": "False", "id": "il70ja2", "is_submitter": "True", "link_id": "t3_wte7ei", "parent_id": "t1_il6p1z4", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "espressoBump", "body": "Got to love Grandpas!", "created_utc": "1661091275.0", "edited": "False", "id": "il70gbc", "is_submitter": "True", "link_id": "t3_wte7ei", "parent_id": "t1_il3kki4", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "espressoBump", "body": "Very [interesting](https://en.wikipedia.org/wiki/Pirah%C3%A3_language#Pirah%C3%A3_and_linguistic_relativity): \n\n\"Daniel Everett claims that the absence of recursion in the language, if real, falsifies the basic assumption of modern Chomskyan linguistics. This claim is contested by many linguists, who claim that recursion has been observed in Pirahã by Daniel Everett himself, while Everett argues that those utterances that superficially seemed recursive to him at first were misinterpretations caused by his earlier lack of familiarity with the language. Furthermore, some linguists, including Chomsky himself, argue that even if Pirahã lacked recursion, that would have no implications for Chomskyan linguistics.\\[1\\]\\[10\\]\\[13\\]\"", "created_utc": "1661091230.0", "edited": "False", "id": "il70cwy", "is_submitter": "True", "link_id": "t3_wte7ei", "parent_id": "t1_il55v80", "score": "4", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "espressoBump", "body": "Those are my thoughts :)", "created_utc": "1661090707.0", "edited": "False", "id": "il6z96r", "is_submitter": "True", "link_id": "t3_wte7ei", "parent_id": "t1_il6ytv0", "score": "0", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "espressoBump", "body": "Lol that's another thing. \"Ok who is Asian to you? What do you meeeaaaan?\" If I questioned him I feel like he'd either get more prejudice or change the direction of what he meant. Honestly, I think he'd just get more prejudice. Whenever we talk about the work our team from his native country completes, he chimes in how great they are. Without fail. They're great, yes, but they're just like everyone else! Wtfrig.", "created_utc": "1661090379.0", "edited": "False", "id": "il6yjpb", "is_submitter": "True", "link_id": "t3_wte7ei", "parent_id": "t1_il6mdmi", "score": "0", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "espressoBump", "body": "First, your understanding of the concept needs to exist within you then you use anything you mentioned to communicate. If you don't have the concept for vrolaxees then you'll fill something in it's place until you have a build conception of this thing. Vrolaxees don't exist, so you could have put any filler in their because you don't know the concept for I'm talking about. You could of thought of a pool skimmer, a Rolex, or a flying monster because it's the closest association you have to that word. You could have even thought of not knowing a word which is an abstract concept you have a built image or conception of. We could keep going through life and have a completely different conception of Vrolaxees because of what our outside stimuli reinforces. Every time you touch/smell/look at/feel a book people call it vrolaxees so you know vrolaxees is a book. You have a conception of  vrolaxees (book) that is in you and it's built over time. You may have a word, or picture for that concept to represent it and it may change over time but you have a concept of it once u0u learned what vrolaxees was. Now you can output it. You can draw it, use a word to describe it, think of it with an image, and so on. I'm pretty much talking about Plato's forms.\n\nI think Asian people and everyone else do this same exact thing, regardless of language. The only difference is the language itself, which is the vessel to think in.\n\nHe could have been talking about the structure of the sentence, which is different and a slightly inaccurate choice of words on his part. Then he should have said you have to understand the strucute of *an* Asian language before you speak it. He classified all Asian languages as the same and thinks all of the people from Asia \"think conceptually.\" This is where I'm making my generalization on him, because he is making a generalization on Asians. Russian, Japanese, Hindi, Vietnamese, and Chinese are all very different. In any combination you use to group Asians based on their language and say \"these people\" think conceptually is a generalization to me. It's just a way of saying they're different, they don't think like us. I find this surprising from a man who claims to be a polyglot. I get there are cultural differences but they also doesn't hinder the language learning process.\n\nThe only other way I can take it is, you have to think conceptually to understand Asian languages. Meaning, I have to think in abstract thoughts to speak an Asian language. In my case this is not true at all. I can quite literally find words to translate and convey everyone of my ideas.\n\nAsian discrimination is a silent one and I don't think they get enough support. I know because, I do everything I can to make sure I understand how my wife feels. I clarify things all of the time. These situations, are common for her and she puts up with it. She thinks he's an idiot too.", "created_utc": "1661089103.0", "edited": "1661089338.0", "id": "il6vvn1", "is_submitter": "True", "link_id": "t3_wte7ei", "parent_id": "t1_il6jl1o", "score": "-1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "espressoBump", "body": "It just felt like he was talking beyond culture. Taken literally, thinking in concepts is how we all think. The words we use represent the ideas we have and concepts we feel.\n\nWhen I say \"turn on the light.\" I already know what I want and my brain spits out that sentence because those are the words I know to represent this concept.\n\nWhat bothers me is I don't have to *think* any differently once I know the language. I need the vocabulary, grammatical structure, and words to act as a vessel to get my ideas out.\n\n불커 in Korean is turn on the light. 불 is light, 커 is to turn on. I have this concept and use these words to express it in two different ways \"turn on the light\" and \"불 커\".\n\nSo the issue I have with him isn't thinking in concepts, but rather, pointing Asians out as different for having to do so. I have to assume he thinks he can't learn an Asian language without thinking in *their* concepts.\n\nThe other naive point is that he wrapped all Asian languages into one. I just wonder if his same rules apply to all Asian languages. Why don't Germanic and Romance language speakers think concepts?\n\nI think he was just intimidated by such an extremely different language and thought, \"wow, I can't do this without thinking like them\". Which is just a weird response from someone who claims to be a polyglot (Portuguese, Spanish, Italian, French, English and German).", "created_utc": "1661086687.0", "edited": "False", "id": "il6r9lm", "is_submitter": "True", "link_id": "t3_wte7ei", "parent_id": "t1_il6beql", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "espressoBump", "body": "Yeah, exactly. Sometimes, when I learn new vocabulary I try to feel it and associate the feeling with the way it feels coming out of my mouth. So it's like ok, this is what I'm thinking (concept) and then this is how I express it (word).", "created_utc": "1661083756.0", "edited": "False", "id": "il6md19", "is_submitter": "True", "link_id": "t3_wte7ei", "parent_id": "t1_il3y7ec", "score": "0", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "espressoBump", "body": "I'm still a beginner at the three I started in college and post-college (Korean, Italian, Spanish). So I want to complete those first, but I dream of speaking German, Arabic, and Russian. If I could snap my fingers and put work in, they would be Mandarin and French.", "created_utc": "1661047307.0", "edited": "False", "id": "il54wrc", "is_submitter": "False", "link_id": "t3_wthcby", "parent_id": "t3_wthcby", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "espressoBump", "body": "I feel bad for the cop and I'm not saying I'd make the best decision under pressure (but I'm also not trained for this and it's not my *job*) but it looks like everything he did was incredibly stupid.\n\nDon't cops shoot to kill? Had he just ran over with his gun and killed the perpetrator the public would be up in arms but he put himself in so much more danger by not shooting someone who tried to kill him. I feel like there's a lot I don't understand here.", "created_utc": "1660914868.0", "edited": "False", "id": "ikxhqpe", "is_submitter": "False", "link_id": "t3_wrx9ig", "parent_id": "t1_ikwjknx", "score": "1", "subreddit": "PublicFreakout", "subreddit_id": "t5_2yrq6"}, {"author": "espressoBump", "body": "Republicans running the job market too.", "created_utc": "1660871919.0", "edited": "False", "id": "ikvitqk", "is_submitter": "False", "link_id": "t3_wrpzhk", "parent_id": "t3_wrpzhk", "score": "6", "subreddit": "antiwork", "subreddit_id": "t5_2y77d"}, {"author": "espressoBump", "body": "Americans are insane.", "created_utc": "1660828997.0", "edited": "False", "id": "iksji9l", "is_submitter": "False", "link_id": "t3_wqz62j", "parent_id": "t3_wqz62j", "score": "1", "subreddit": "CrazyFuckingVideos", "subreddit_id": "t5_45hae8"}, {"author": "espressoBump", "body": "Attack on Titan", "created_utc": "1660652408.0", "edited": "False", "id": "ikidj5z", "is_submitter": "False", "link_id": "t3_wpcgbz", "parent_id": "t3_wpcgbz", "score": "1", "subreddit": "interestingasfuck", "subreddit_id": "t5_2qhsa"}, {"author": "espressoBump", "body": "Omg. I'm not the only one? Years of abuse and I thought  it was just me. People have walked me off of every side walk, doorway, and squished me in every elevator. Be careful with this one he's a hero.", "created_utc": "1660616495.0", "edited": "False", "id": "ikguxrf", "is_submitter": "False", "link_id": "t3_wp3p92", "parent_id": "t1_ikflh7c", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "espressoBump", "body": "The other problem in America, our healthcare system. Really, it's cheaper just to die.", "created_utc": "1660568107.0", "edited": "False", "id": "ikdkyct", "is_submitter": "False", "link_id": "t3_won9ho", "parent_id": "t1_ikchova", "score": "2", "subreddit": "news", "subreddit_id": "t5_2qh3l"}, {"author": "espressoBump", "body": "I still can't believe they waited 8 months, but I guess they have to act like he was a president otherwise chaos would probably ensue overnight.\n\nI still don't understand why it took until Jan 2022 for anything to happen. Did it take that long for them to notice these vital documents were missing?", "created_utc": "1660522365.0", "edited": "False", "id": "ikbjegx", "is_submitter": "False", "link_id": "t3_wobc0a", "parent_id": "t1_ikae571", "score": "1", "subreddit": "politics", "subreddit_id": "t5_2cneq"}, {"author": "espressoBump", "body": "Was this some of the classified information leaked by Wikikeaks (Julian Assange)? I denounce what these soldiers did and think it's horrible, as was the crimes in Vietnam. I just don't understand why this was posted today for any other reason than trying to view people going to jail for espionage in a positive light with some fringe believe that Trump is doing society a justice. Nah. I'm not saying it's impossible, I'm just saying it's highly unlikely and he looks crooked AF to me. I hope this was posted only because there have been talks about the espionage act, and so this came to the forefront of people's minds. And this shit is truly terrifying, I hate to see it.", "created_utc": "1660449498.0", "edited": "False", "id": "ik7plgm", "is_submitter": "False", "link_id": "t3_wnprip", "parent_id": "t3_wnprip", "score": "1", "subreddit": "TerrifyingAsFuck", "subreddit_id": "t5_31d92"}, {"author": "espressoBump", "body": "He has neeeeeever had to hold any restraint, at all, in his life. He couldn't stop if he wanted to.", "created_utc": "1660435826.0", "edited": "False", "id": "ik6yj4y", "is_submitter": "False", "link_id": "t3_wnopd3", "parent_id": "t1_ik6d05q", "score": "1", "subreddit": "politics", "subreddit_id": "t5_2cneq"}, {"author": "espressoBump", "body": "Never. I lack the belief of a god, so I literally just think of other shit. Sometimes I think about death and it's hard to imagine at some point I'll never wake up again, but I deal with it. Sometimes I think about having better opportunities in my life, hoping I get lucky, win the lottery or get a better job. I think about doing my hobbies and accomplishing the goals in my life - no god.\n\nThe only time I think about anything remotely similar is when theists talk about their belief in god. Then I'm forced to think of the concept to engage in conversation, that's about it.", "created_utc": "1660429919.0", "edited": "False", "id": "ik6m670", "is_submitter": "False", "link_id": "t3_wnma5m", "parent_id": "t3_wnma5m", "score": "2", "subreddit": "DebateAnAtheist", "subreddit_id": "t5_2ryfy"}, {"author": "espressoBump", "body": "Yeah, excessive force.", "created_utc": "1660428439.0", "edited": "False", "id": "ik6j00z", "is_submitter": "False", "link_id": "t3_wnd9x9", "parent_id": "t1_ik4iycn", "score": "0", "subreddit": "AbruptChaos", "subreddit_id": "t5_3nasz"}, {"author": "espressoBump", "body": "Where is this?", "created_utc": "1660401898.0", "edited": "False", "id": "ik4t8bd", "is_submitter": "False", "link_id": "t3_wnbhyq", "parent_id": "t3_wnbhyq", "score": "1", "subreddit": "PublicFreakout", "subreddit_id": "t5_2yrq6"}, {"author": "espressoBump", "body": "Wait, what? We're making the wrong people responsible how about the amount of mentally ill and homeless in the city? Maybe it's the government's fault. Maybe, there's a bigger problem. I don't want to live in a place where there's pepper spray on the table where I go to eat just in case.", "created_utc": "1660401864.0", "edited": "False", "id": "ik4t5i1", "is_submitter": "False", "link_id": "t3_wnbhyq", "parent_id": "t1_ik49lix", "score": "1", "subreddit": "PublicFreakout", "subreddit_id": "t5_2yrq6"}, {"author": "espressoBump", "body": "This is the problem, the man hasn't done an ounce of work a single day in his life; he likely did not touch or carry any boxes of documents. Even when handing them over to other people, I'm sure he had a henchman do it. I would like to believe storing them in your *home* would violate the espionage act, but we know maga will picture him guilt-free no matter what.", "created_utc": "1660401557.0", "edited": "False", "id": "ik4sg4v", "is_submitter": "False", "link_id": "t3_wnaz6s", "parent_id": "t1_ik4hk85", "score": "6", "subreddit": "politics", "subreddit_id": "t5_2cneq"}, {"author": "espressoBump", "body": "I imagine that he had a bunch of his goons among white house staff and officials who moved the boxes of documents for him. I've read they're fingerprinting the document, which won't be the thing to nail Trump because he doesn't read.", "created_utc": "1660401281.0", "edited": "False", "id": "ik4rtdb", "is_submitter": "False", "link_id": "t3_wnaz6s", "parent_id": "t1_ik45ob1", "score": "3", "subreddit": "politics", "subreddit_id": "t5_2cneq"}, {"author": "espressoBump", "body": "It's funny that we have the electoral college to prevent a populist but lack basic safeguards like a reading test.", "created_utc": "1660397899.0", "edited": "False", "id": "ik4ko3k", "is_submitter": "False", "link_id": "t3_wn3fr0", "parent_id": "t1_ik3eaak", "score": "3", "subreddit": "politics", "subreddit_id": "t5_2cneq"}, {"author": "espressoBump", "body": "Thank you for clearing this up, it makes sense. I was starting to wonder why Bernie or any of the squad members don't withhold their votes. My quick reaction is, well if democratic conservatives are doing it why can't progressives? Just imagine if Bernie held up a bill the Democratic establishment would immediately call him out for Hillary losing and then Manchin would use that as fuel to strip away more of any bill. It would be nice if progressives had that kind of power but we don't, the majority of our representatives are conservative (going through party lines). This tactic would really only work with a real democratic majority.\n\nAlso, screw Jimmy Dore. He's just a sensationalist, probably getting paid by some oligarch.", "created_utc": "1660305252.0", "edited": "False", "id": "ijzf5cr", "is_submitter": "False", "link_id": "t3_wm1yvv", "parent_id": "t1_ijy67ww", "score": "3", "subreddit": "ncpolitics", "subreddit_id": "t5_2sfme"}, {"author": "espressoBump", "body": "I'm a \"recovered\" insomniac. I had many years of emotional abuse and trauma. But, after I learned how to let all that go I still realize I'm a light sleeper AND I sleep seven hours punctually - I can time myself within 10 minutes of when I wake up if I know when I go go sleep, if it's not accurate than I'm sleep deprived. Most of my bad sleeping habits would have been avoided if I just stuck to a good schedule and got up early unlike everyone in my family and having fun with my friends and family in high school college.\n\nHow do I survive? It's easy, don't give a shit. My bodies tired ... but never that tired to go to sleep. I can always push myself and do more. Really, it would take a lot to not manage. I've done weeks with only a collective of 10 hours of sleep. Your body can do it.", "created_utc": "1660262215.0", "edited": "False", "id": "ijxfje0", "is_submitter": "False", "link_id": "t3_wlr2od", "parent_id": "t3_wlr2od", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "espressoBump", "body": "Kind of an important detail I felt like was left out of the museum (although I'm not sure about that one guy in particular)", "created_utc": "1660169304.0", "edited": "False", "id": "ijs1wuh", "is_submitter": "True", "link_id": "t3_wl6hou", "parent_id": "t1_ijrfeea", "score": "1", "subreddit": "AskHistory", "subreddit_id": "t5_2sa8i"}, {"author": "espressoBump", "body": "Morals too. I know that's not the direction of this post but people who are high up have to be willing to hurt others. A lot of people I know are too nice, that's a good thing but it's not to one's own benefit.", "created_utc": "1660150157.0", "edited": "False", "id": "ijqmvgs", "is_submitter": "False", "link_id": "t3_wkkmnz", "parent_id": "t1_ijo9ojs", "score": "1", "subreddit": "YouShouldKnow", "subreddit_id": "t5_2r94o"}, {"author": "espressoBump", "body": "American here. I love Australia! My wife and I would move if we could (she's korean).", "created_utc": "1660149955.0", "edited": "False", "id": "ijqmbpf", "is_submitter": "False", "link_id": "t3_wko6gp", "parent_id": "t3_wko6gp", "score": "1", "subreddit": "brisbane", "subreddit_id": "t5_2qutz"}, {"author": "espressoBump", "body": "Is this r/science?", "created_utc": "1660137488.0", "edited": "False", "id": "ijpqt9p", "is_submitter": "False", "link_id": "t3_wksyif", "parent_id": "t1_ijp4tla", "score": "1", "subreddit": "politics", "subreddit_id": "t5_2cneq"}, {"author": "espressoBump", "body": "And for a while I thought they would be too. Glad we voted in a sane president even if he sucks. Will vote for him AGAIN if he can barely mumble his own name.", "created_utc": "1660041447.0", "edited": "False", "id": "ijk9xea", "is_submitter": "False", "link_id": "t3_wjoj1w", "parent_id": "t1_ijjg7hc", "score": "2", "subreddit": "politics", "subreddit_id": "t5_2cneq"}, {"author": "espressoBump", "body": "Hugging my wife and telling her how great she's been to my life.", "created_utc": "1659951696.0", "edited": "False", "id": "ijf6wcz", "is_submitter": "False", "link_id": "t3_wilg75", "parent_id": "t3_wilg75", "score": "2", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "espressoBump", "body": "It's a muggy and humid 90 degrees in North Carolina. I didn't expect it to be this hot when I moved here, but it is! NC is definitely part of the US South.", "created_utc": "1659911724.0", "edited": "False", "id": "ijdafob", "is_submitter": "False", "link_id": "t3_wighyg", "parent_id": "t3_wighyg", "score": "1", "subreddit": "MechanicalKeyboards", "subreddit_id": "t5_2ugo7"}, {"author": "espressoBump", "body": "Can we just start suing news outlets and companies for disinformation? I'm tired of this crap.", "created_utc": "1659885264.0", "edited": "False", "id": "ijbi3g1", "is_submitter": "False", "link_id": "t3_wie84x", "parent_id": "t3_wie84x", "score": "1", "subreddit": "antiwork", "subreddit_id": "t5_2y77d"}, {"author": "espressoBump", "body": "My wife and I are watching 우여우, \"Extraordinary Attorney Woo\" and catching up on Breaking Bad. Both are great and completely different genres.", "created_utc": "1659871458.0", "edited": "False", "id": "ijarrl3", "is_submitter": "False", "link_id": "t3_wi7eg1", "parent_id": "t3_wi7eg1", "score": "1", "subreddit": "MechanicalKeyboards", "subreddit_id": "t5_2ugo7"}, {"author": "espressoBump", "body": "Doesn't matter we need her.\n\nHonestly, I feel the same way about Bernie. If he died due to old age while in office then we still get a push in the right direction with an administration that is for the people. The affect it would have on our country would be immense, and good.\n\nI *don't* want Bernie to run he's too old, I'm just saying the logic is the same. We need a peoples president and to me there's no valid argument against it.\n\nThe amount of people AOC would empower for 8 years would alone be enough to not worry about new leaders in our country; her career would be absolutely fine and she would have enough connections to be well off financially. I see this all around as a win. Sorry to talk about Bernie when we're talking about AOC!", "created_utc": "1659795276.0", "edited": "False", "id": "ij6rkga", "is_submitter": "False", "link_id": "t3_wgouqm", "parent_id": "t1_ij10gdg", "score": "1", "subreddit": "MurderedByAOC", "subreddit_id": "t5_xkt2h"}, {"author": "espressoBump", "body": "Agreed, there can only be so many brazen assholes and incompetent crooks. Not every single one of them is stupid, it's just not possible.", "created_utc": "1659794421.0", "edited": "False", "id": "ij6prd4", "is_submitter": "False", "link_id": "t3_wh7qhl", "parent_id": "t1_ij4o1ah", "score": "1", "subreddit": "news", "subreddit_id": "t5_2qh3l"}, {"author": "espressoBump", "body": "Checks out.", "created_utc": "1659655749.0", "edited": "False", "id": "iizg38l", "is_submitter": "False", "link_id": "t3_wg50x2", "parent_id": "t1_iiy4ao7", "score": "1", "subreddit": "politics", "subreddit_id": "t5_2cneq"}, {"author": "espressoBump", "body": "They are still \"roommates\" to this day", "created_utc": "1659646913.0", "edited": "False", "id": "iiyujk9", "is_submitter": "False", "link_id": "t3_wg270l", "parent_id": "t3_wg270l", "score": "12", "subreddit": "wwiipics", "subreddit_id": "t5_2tb0j"}, {"author": "espressoBump", "body": "\"But he's cute, he doesn't mean any harm\" - paraphrasing Joe Rogan", "created_utc": "1659537169.0", "edited": "False", "id": "iisbkqv", "is_submitter": "False", "link_id": "t3_wethpp", "parent_id": "t3_wethpp", "score": "1", "subreddit": "PublicFreakout", "subreddit_id": "t5_2yrq6"}, {"author": "espressoBump", "body": "Important when pronouncing every letter as it is written is so distracting and pretentious I get very annoyed when I hear it. Colloquially we don't put a hard stop on the first t, the sound is from throat. When native English speakers pronounce it this way, it sounds abnormal.\n\nTo me it would be like pronouncing the B in comb.", "created_utc": "1659534293.0", "edited": "False", "id": "iis4op9", "is_submitter": "False", "link_id": "t3_wf0sqo", "parent_id": "t3_wf0sqo", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "espressoBump", "body": "I get disappointed because this allusion we have been taught only existed for a short period of time when the boomers ranked in money. The golden era was just the result of a war and by no means a guarantee. Are we just jaded because we're from a country that has squashed all leftist movements and being anti-labour, excessively pro-business, corporate greed, or is this a wider phenomena of society across all countries? Is the world waking up to the idea that economies are plagued with the top always taking in excess, will be indifferent to it, or has it only been amplified this bad in America and we need to wake up?", "created_utc": "1659458002.0", "edited": "False", "id": "iinujzw", "is_submitter": "False", "link_id": "t3_we8h6i", "parent_id": "t3_we8h6i", "score": "1", "subreddit": "lostgeneration", "subreddit_id": "t5_2r40j"}, {"author": "espressoBump", "body": "Is there any scientific literature on this because I've had the same question for a while. Modern human has been around for so long it's hard for me to conceptualize that we haven't evolved so much more in even the last 100 years when we can watch other animals change over time.", "created_utc": "1659438958.0", "edited": "False", "id": "iimnmcs", "is_submitter": "False", "link_id": "t3_wdzwtf", "parent_id": "t1_iilradl", "score": "1", "subreddit": "science", "subreddit_id": "t5_mouw"}, {"author": "espressoBump", "body": "That's got to be tough, could even be harmful.", "created_utc": "1659400387.0", "edited": "False", "id": "iikxcp9", "is_submitter": "False", "link_id": "t3_wdryor", "parent_id": "t1_iikfkmw", "score": "22", "subreddit": "WhitePeopleTwitter", "subreddit_id": "t5_35n7t"}, {"author": "espressoBump", "body": "That's just not true. I, like many people, didn't vote for Hillary in 2016 and the following presidency caused an insurrection on our own capital, so I learned my lesson. Democrats are better than Republicans and I'll vote for them. Don't get me wrong, they're still bought and paid for, shitty careerists, but at least they're not Christian fascists.\n\nBiden is expanding the wall, he's left Children in cages, and hasn't kept half of his promises, but Republicans couldn't care less if their own base died from COVID. The difference is apparent to me.\n\nWhich progressive is worse than who? This is just more bs from you.", "created_utc": "1659302953.0", "edited": "False", "id": "iifj03n", "is_submitter": "False", "link_id": "t3_wcnncq", "parent_id": "t1_iiednoy", "score": "1", "subreddit": "economy", "subreddit_id": "t5_2qhpn"}, {"author": "espressoBump", "body": "Yeah, that's me, but I wouldn't say all progressives are that way... I don't like Republicans and don't want them in power, so I vote for democrats in hopes there's a better alternative. The second part of this is missing, no one wants to run. It's a huge sacrifice and Dems don't make up the slack. I mean, this crowd like you usually says OK DON'T VOTE like that's going to fix everything and drain corporate power. No, even if we all didn't vote en masse, it wouldn't stop democrats or republicans from gaining power and getting in office, so it's pointless to argue this point. Alternatives need to run. Not voting will do nothing, choosing the better of two evils isn't enough. Pick your poison or run. Better yet, organize.", "created_utc": "1659284037.0", "edited": "False", "id": "iieaez7", "is_submitter": "False", "link_id": "t3_wcnncq", "parent_id": "t1_iie5ld2", "score": "5", "subreddit": "economy", "subreddit_id": "t5_2qhpn"}, {"author": "espressoBump", "body": "That's not progressive, it's centrist. I think we can all pretty much agree that we're f*cked and in a recession.", "created_utc": "1659277425.0", "edited": "False", "id": "iidv4u1", "is_submitter": "False", "link_id": "t3_wcnncq", "parent_id": "t1_iidoquu", "score": "7", "subreddit": "economy", "subreddit_id": "t5_2qhpn"}, {"author": "espressoBump", "body": "Yup. Everyone liked Bernie but no one voted for him because they just don't give a shit about politics and never have.\n\nMany people prefer video games, drinking, gambling, sports. fucking crypto, or just raising their kids. Those of us on Reddit who lean left are probably the loudest of the 8%. \n\nIt's a catch-22. Get your society to a comfortable spot so that the people don't need to care about \"politics\" because nothing is burdening them, but then society doesn't care about politics so the institutions break down. We need an unprecedented mass mobilization effort for all Democracies to work in the future. Right now, best we can do is mandatory voting with an option to vote for no one, but we can't even agree on that.", "created_utc": "1659276974.0", "edited": "False", "id": "iidu4ch", "is_submitter": "False", "link_id": "t3_wbzm3i", "parent_id": "t1_iib4tb8", "score": "0", "subreddit": "WhitePeopleTwitter", "subreddit_id": "t5_35n7t"}, {"author": "espressoBump", "body": "Call animal patrol next time and follow the dog in your car. Identify the owner and take a photo of them and give it to animal patrol as well.\n\nThere's two seperate families around Lake Johnson who let their pitbulls run around unleashed, one has chased me. There's 3 dogs in total. So that dog you saw could be lost or just part of the general negligence trend.\n\nIt's extremely unsafe for these dogs to be unleashed and I'm sick of it. For your safety I wouldn't approach anything bigger than a Chihuahua.", "created_utc": "1659265839.0", "edited": "False", "id": "iidavn7", "is_submitter": "False", "link_id": "t3_wccq7l", "parent_id": "t3_wccq7l", "score": "3", "subreddit": "raleigh", "subreddit_id": "t5_2r0z3"}, {"author": "espressoBump", "body": "Along with everything else people here are saying it's the dominant religion of our country (or whatever country you're probably talking about) so we have more examples of it. My wife is from Korea and we discuss religion a lot and she ways flips what I said on it's head.  Like a lot of Buddhists seem like dicks. But they have a lot of Christians in their country too who aren't as bad as the ones here. At the end of the day I think it's the US's history and culture.", "created_utc": "1659177194.0", "edited": "False", "id": "ii8rf3j", "is_submitter": "False", "link_id": "t3_wbpei3", "parent_id": "t3_wbpei3", "score": "2", "subreddit": "atheism", "subreddit_id": "t5_2qh2p"}, {"author": "espressoBump", "body": "But I'd rather her lose and fail instead of our entire country. There's really no turning back and by the looks of it Republicans are going to take over hard, the dems are what they always were (useless) so it's just a ticking time bomb. Not enough progressives will make it to the Senate so I'd rather she AOC fail trying for president because the Senate is always a failure, and I'd rather see her fail AS president even if that were the case because at least progressives at least had one chance. Idc if everything gets shot down it is already.", "created_utc": "1659115119.0", "edited": "False", "id": "ii5h7cq", "is_submitter": "False", "link_id": "t3_wb1yaw", "parent_id": "t1_ii4h00w", "score": "1", "subreddit": "politics", "subreddit_id": "t5_2cneq"}, {"author": "espressoBump", "body": "Finding and reading a whole book that changes your opinion on something. Then finding out people are bias. Those were the days!", "created_utc": "1659114936.0", "edited": "False", "id": "ii5gqhp", "is_submitter": "False", "link_id": "t3_wb607x", "parent_id": "t3_wb607x", "score": "1", "subreddit": "meirl", "subreddit_id": "t5_2s5ti"}, {"author": "espressoBump", "body": "I've seen this too. I think it's mainly from bad written articles discussing the great apes and the missing link, not the entirety of evolution. But I also don't know if this is true.", "created_utc": "1659053423.0", "edited": "False", "id": "ii28pkw", "is_submitter": "False", "link_id": "t3_waaqgl", "parent_id": "t1_ii1vp52", "score": "3", "subreddit": "DebateAnAtheist", "subreddit_id": "t5_2ryfy"}, {"author": "espressoBump", "body": "The dude has just as much appeal as my thumb; thanks for not giving a single shit when your election was stolen, and here you go again doing nothing. This isn't an argument to support Republicans, you better believe they're going to destroy this world quicker, I'm just pissed these guys didn't do anything about it.", "created_utc": "1658967545.0", "edited": "False", "id": "ihxcq73", "is_submitter": "False", "link_id": "t3_w9355l", "parent_id": "t3_w9355l", "score": "1", "subreddit": "GlobalWarming", "subreddit_id": "t5_2qi7x"}, {"author": "espressoBump", "body": "And now we have Monkey Pox.", "created_utc": "1658717414.0", "edited": "False", "id": "ihj3j9s", "is_submitter": "False", "link_id": "t3_w6wuqp", "parent_id": "t1_ihgjaob", "score": "1", "subreddit": "interestingasfuck", "subreddit_id": "t5_2qhsa"}, {"author": "espressoBump", "body": "\"But she's a good one\"", "created_utc": "1658702131.0", "edited": "False", "id": "ihi7203", "is_submitter": "False", "link_id": "t3_w70050", "parent_id": "t3_w70050", "score": "1", "subreddit": "WhitePeopleTwitter", "subreddit_id": "t5_35n7t"}, {"author": "espressoBump", "body": "I tell myself every morning.", "created_utc": "1658701722.0", "edited": "False", "id": "ihi648r", "is_submitter": "False", "link_id": "t3_w6zzky", "parent_id": "t3_w6zzky", "score": "1", "subreddit": "lostgeneration", "subreddit_id": "t5_2r40j"}, {"author": "espressoBump", "body": "How did you even draw this conclusion? The article says three things:\n\n1. Feds rising interest rates\n2. Strong US bonds, foreign countries can invest\n3. Being energy self-sufficient", "created_utc": "1658667281.0", "edited": "False", "id": "ihfybg7", "is_submitter": "False", "link_id": "t3_w6kcz0", "parent_id": "t1_ihf17mh", "score": "5", "subreddit": "economy", "subreddit_id": "t5_2qhpn"}, {"author": "espressoBump", "body": "This is upsetting. My wife and I wanted to move to Maine and this scsres the shit out of us. She's not white.", "created_utc": "1658596451.0", "edited": "False", "id": "ihcdr6r", "is_submitter": "False", "link_id": "t3_w4w197", "parent_id": "t3_w4w197", "score": "3", "subreddit": "Maine", "subreddit_id": "t5_2qts0"}, {"author": "espressoBump", "body": "Here is my ink, drink it and you will remember me.", "created_utc": "1658587726.0", "edited": "False", "id": "ihbtik7", "is_submitter": "False", "link_id": "t3_w5q819", "parent_id": "t1_ih9i42z", "score": "2", "subreddit": "atheism", "subreddit_id": "t5_2qh2p"}, {"author": "espressoBump", "body": "It's crazy when you have an idea and you see it popping up around all over the place! I have had very similar thoughts these days.\n\n1. The rich want us bonded to our jobs through mortgages and families, once you're trapped they'll promote you less and less.\n\n2. Prevent abortions so there's more bodies to do labor, or fodder for wars.\n\n3. Keep people uneducated and religious because it perpetuates the cycle.\n\nBut in regards to your conversation I want to point out that it's a weird double edged sword. Like, if we didn't have people who depending on us than we wouldn't have anything to fight for either. I'd probably just gain 100lbs and play video games. Like, we only want to be radical to make a better society for our loved ones. We need to fight to have an equal society for everyone. That annoying asshole in the park, the homeless guy, your neighbor, your momma etc.", "created_utc": "1658581635.0", "edited": "False", "id": "ihbh0o8", "is_submitter": "False", "link_id": "t3_w5bf7f", "parent_id": "t3_w5bf7f", "score": "2", "subreddit": "antiwork", "subreddit_id": "t5_2y77d"}, {"author": "espressoBump", "body": "Most of us figured this out in high school, I'd say as early as elementary. We can't stop greed, that's the problem.", "created_utc": "1658580459.0", "edited": "False", "id": "ihbevgr", "is_submitter": "False", "link_id": "t3_w5h1t1", "parent_id": "t3_w5h1t1", "score": "1", "subreddit": "science", "subreddit_id": "t5_mouw"}, {"author": "espressoBump", "body": "Agreed. I think he had everything going against him (the Democrats) but at the end of the day people didn't vote for him. We're stupid and there's no one else to blame.", "created_utc": "1658578208.0", "edited": "False", "id": "ihbb2l3", "is_submitter": "False", "link_id": "t3_w5wsud", "parent_id": "t1_ihak5nq", "score": "2", "subreddit": "WhitePeopleTwitter", "subreddit_id": "t5_35n7t"}, {"author": "espressoBump", "body": "Opposite happened to me. I heard about some great-great uncle of mine who was a \"good man\" but he died \"tragically\" because his wife shot him. I clarified, and said, \"his wife SHOT him? What did he do?\" My aunt looked at me and nodded, and said \"he may have been abusive\".", "created_utc": "1658500712.0", "edited": "False", "id": "ih70d8j", "is_submitter": "False", "link_id": "t3_w4v64g", "parent_id": "t3_w4v64g", "score": "1", "subreddit": "TwoXChromosomes", "subreddit_id": "t5_2r2jt"}, {"author": "espressoBump", "body": "Lol, bro I only need to go to my aunts house in one of our many crumbling cities.", "created_utc": "1658429433.0", "edited": "False", "id": "ih34wjd", "is_submitter": "False", "link_id": "t3_w4eoa4", "parent_id": "t1_ih1er8s", "score": "0", "subreddit": "politics", "subreddit_id": "t5_2cneq"}, {"author": "espressoBump", "body": "This is why I'm bringing it up. I feel like it's important for people like us to make sure our ideas are out there too.", "created_utc": "1658428218.0", "edited": "False", "id": "ih31nor", "is_submitter": "True", "link_id": "t3_w4dzkh", "parent_id": "t1_ih31fob", "score": "1", "subreddit": "atheism", "subreddit_id": "t5_2qh2p"}, {"author": "espressoBump", "body": "Agreed! 100%. Sometimes I think people just need to know we're out there.", "created_utc": "1658421300.0", "edited": "False", "id": "ih2j1eg", "is_submitter": "True", "link_id": "t3_w4dzkh", "parent_id": "t1_ih2fp7g", "score": "2", "subreddit": "atheism", "subreddit_id": "t5_2qh2p"}, {"author": "espressoBump", "body": "Yeah, I mean I really don't like it but I feel like it's how the boomers are getting radicalized.", "created_utc": "1658407376.0", "edited": "False", "id": "ih1kjw6", "is_submitter": "True", "link_id": "t3_w4dzkh", "parent_id": "t1_ih1b8vh", "score": "1", "subreddit": "atheism", "subreddit_id": "t5_2qh2p"}, {"author": "espressoBump", "body": "I don't like the push back for wanting to persuade religious that they should become atheists. Like, it's ok, if that's what I want.", "created_utc": "1658261713.0", "edited": "False", "id": "igtou8i", "is_submitter": "False", "link_id": "t3_w2qoph", "parent_id": "t3_w2qoph", "score": "2", "subreddit": "atheism", "subreddit_id": "t5_2qh2p"}, {"author": "espressoBump", "body": "The single white cross is terrifying.", "created_utc": "1658192923.0", "edited": "False", "id": "igpvr06", "is_submitter": "False", "link_id": "t3_w1ys46", "parent_id": "t3_w1ys46", "score": "1", "subreddit": "terriblefacebookmemes", "subreddit_id": "t5_2tja6"}, {"author": "espressoBump", "body": "Don't let boomers see this photo: \"see this is what happens when you increase minimum wage, $40 dollars  for a happy meal\"", "created_utc": "1658192855.0", "edited": "False", "id": "igpvlkc", "is_submitter": "False", "link_id": "t3_w1vyid", "parent_id": "t1_ign59t3", "score": "1", "subreddit": "mildlyinteresting", "subreddit_id": "t5_2ti4h"}, {"author": "espressoBump", "body": "Many times I just click links. Not this one, nope.", "created_utc": "1658108514.0", "edited": "False", "id": "igl9l1y", "is_submitter": "False", "link_id": "t3_w16s1w", "parent_id": "t1_igiqc1h", "score": "1", "subreddit": "Unexpected", "subreddit_id": "t5_2w67q"}, {"author": "espressoBump", "body": "BRO. Just load that shit up with cheese, I mean come on... but seriously, do a variety of cheeses and not too many fancy ones. My mother's secret ingredient is mustard, she puts a small squirt in and mixes it in evenly.", "created_utc": "1658108326.0", "edited": "False", "id": "igl974i", "is_submitter": "False", "link_id": "t3_w1d86e", "parent_id": "t3_w1d86e", "score": "1", "subreddit": "NoStupidQuestions", "subreddit_id": "t5_2w844"}, {"author": "espressoBump", "body": "She was an activist that saved the panther 21 by defending herself in court and exposing the FBI's corruption.", "created_utc": "1658061592.0", "edited": "False", "id": "igifevf", "is_submitter": "False", "link_id": "t3_w0rpwk", "parent_id": "t1_iggards", "score": "0", "subreddit": "todayilearned", "subreddit_id": "t5_2qqjc"}, {"author": "espressoBump", "body": "Have you ever been rock climbing?", "created_utc": "1658060321.0", "edited": "False", "id": "igidec3", "is_submitter": "False", "link_id": "t3_stm423", "parent_id": "t1_igh1ggi", "score": "-6", "subreddit": "Maine", "subreddit_id": "t5_2qts0"}, {"author": "espressoBump", "body": "Ok, so it's like the rest of NE! Thank you.", "created_utc": "1658060198.0", "edited": "False", "id": "igid7i1", "is_submitter": "False", "link_id": "t3_stm423", "parent_id": "t1_igh0jwp", "score": "2", "subreddit": "Maine", "subreddit_id": "t5_2qts0"}, {"author": "espressoBump", "body": "How's rock climbing in Maine?", "created_utc": "1658000867.0", "edited": "False", "id": "igfl12j", "is_submitter": "False", "link_id": "t3_stm423", "parent_id": "t3_stm423", "score": "0", "subreddit": "Maine", "subreddit_id": "t5_2qts0"}, {"author": "espressoBump", "body": "Do a lot of the apartments in Portland have gyms?", "created_utc": "1657999065.0", "edited": "False", "id": "igfguoa", "is_submitter": "False", "link_id": "t3_stm423", "parent_id": "t3_stm423", "score": "-3", "subreddit": "Maine", "subreddit_id": "t5_2qts0"}, {"author": "espressoBump", "body": "Korea.", "created_utc": "1657998175.0", "edited": "False", "id": "igfesmg", "is_submitter": "False", "link_id": "t3_w0i8qn", "parent_id": "t3_w0i8qn", "score": "4", "subreddit": "AskHistory", "subreddit_id": "t5_2sa8i"}, {"author": "espressoBump", "body": "What church is this?", "created_utc": "1657980643.0", "edited": "False", "id": "igea7wh", "is_submitter": "False", "link_id": "t3_vzxg9m", "parent_id": "t3_vzxg9m", "score": "2", "subreddit": "ncpolitics", "subreddit_id": "t5_2sfme"}, {"author": "espressoBump", "body": "We have a long way to go and each of us can get much, much poorer before there's civil unrest, or collective action - think of other countries. Americans are unstable and there's a pletherea of angry people so one-off acts of aggression will increase 10 fold. Since we are way too individualistic and never consider helping one another, we don't support our communities - the one people who do are churches and they're some of the most extremist people, so there will be no collective action until we come together and I don't see that happening anytime soon.", "created_utc": "1657876055.0", "edited": "False", "id": "ig8qa4o", "is_submitter": "False", "link_id": "t3_vz7x57", "parent_id": "t1_ig7ivta", "score": "19", "subreddit": "lostgeneration", "subreddit_id": "t5_2r40j"}, {"author": "espressoBump", "body": "And everything is a pop up. \n\nAnd everything is a subscription.", "created_utc": "1657826241.0", "edited": "False", "id": "ig607iq", "is_submitter": "False", "link_id": "t3_vyxka4", "parent_id": "t1_ig578ki", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "espressoBump", "body": "How old are you? Are you tired already? Do you think every generation has had perfect representation? If any generation skips a beat then they ruin it for the next, we're not only fighting for ourselves but for the future and we need to begin the fight today.\n\nFor me it's easy to vote blue, because it prevents Republicans from gaining power. I'm not voting because I agree with any of the Democrats decisions or policies, it's just the safer option. Voting blue is the slower degradation of our democracy, and not nearly as overt.\n\n I think most people fail to realize voting is just one small responsibility we have. When every institution is crumbling around you, and all of your friends and family are complaining, it should be obvious only voting isn't going to help. We need new leaders. Encourage your friends and family. Organize, get involved. Run for local office.", "created_utc": "1657234551.0", "edited": "False", "id": "if9qu9w", "is_submitter": "False", "link_id": "t3_vti55w", "parent_id": "t1_if8s30i", "score": "1", "subreddit": "atheism", "subreddit_id": "t5_2qh2p"}, {"author": "espressoBump", "body": "The difference between men and women. This woman is a god.", "created_utc": "1656941394.0", "edited": "False", "id": "ietduyg", "is_submitter": "False", "link_id": "t3_vr5aqf", "parent_id": "t1_iet3hf3", "score": "10", "subreddit": "WhitePeopleTwitter", "subreddit_id": "t5_35n7t"}, {"author": "espressoBump", "body": "Yeah because I was going to say there's a place at Myrtle Beach like this but it's just so disgusting commercial.", "created_utc": "1656941271.0", "edited": "False", "id": "ietdmg7", "is_submitter": "False", "link_id": "t3_vr2oup", "parent_id": "t1_iesz7o2", "score": "2", "subreddit": "fuckcars", "subreddit_id": "t5_3cs2l"}, {"author": "espressoBump", "body": "Lol.... Ah the presidency.", "created_utc": "1656896216.0", "edited": "False", "id": "ierj3p6", "is_submitter": "False", "link_id": "t3_vqrd5x", "parent_id": "t1_ier2nsu", "score": "1", "subreddit": "Justrolledintotheshop", "subreddit_id": "t5_2tteh"}, {"author": "espressoBump", "body": "The hamburgerlar", "created_utc": "1656827181.0", "edited": "False", "id": "ieo0p7d", "is_submitter": "False", "link_id": "t3_vq2fti", "parent_id": "t3_vq2fti", "score": "1", "subreddit": "shitposting", "subreddit_id": "t5_2usxq"}, {"author": "espressoBump", "body": "I've been thinking about this a lot lately, I think we should. Idk how to start.", "created_utc": "1656807938.0", "edited": "False", "id": "ien2tz7", "is_submitter": "False", "link_id": "t3_vpx7hr", "parent_id": "t3_vpx7hr", "score": "2", "subreddit": "atheism", "subreddit_id": "t5_2qh2p"}, {"author": "espressoBump", "body": "It's cool, I'm here to learn. Thank you.", "created_utc": "1656779509.0", "edited": "False", "id": "ieldby0", "is_submitter": "False", "link_id": "t3_vps3rm", "parent_id": "t1_iela0gz", "score": "2", "subreddit": "DebateReligion", "subreddit_id": "t5_2snuc"}, {"author": "espressoBump", "body": "But that's only Matthew. Mark, Luke, and John do not explicitly say this. Each book was written by different sects of priests with different outcomes in mind. It's really not clear exactly what he wanted. Even this sentence is cryptic, plus he didn't come back, so are we following the law or Moses or not?", "created_utc": "1656777457.0", "edited": "False", "id": "iel8obx", "is_submitter": "False", "link_id": "t3_vps3rm", "parent_id": "t1_ieky7pp", "score": "6", "subreddit": "DebateReligion", "subreddit_id": "t5_2snuc"}, {"author": "espressoBump", "body": "Yeah, the old testament is lawless. The problem is Christian believers use the new testament to conveniently forget the rest of the book. It's not clear if Jesus said to totally reject the law of moses or not. I really think depending on which gospel you prefer, then you could justify sexual slavery because it's the law of moses.", "created_utc": "1656770792.0", "edited": "False", "id": "iektzug", "is_submitter": "False", "link_id": "t3_vps3rm", "parent_id": "t3_vps3rm", "score": "3", "subreddit": "DebateReligion", "subreddit_id": "t5_2snuc"}, {"author": "espressoBump", "body": "I loved \"Get Out\" so I'll I'll probably always watch his movies, but am I excited? No. I thought US sucked so I don't have high expectations for anything else he makes.", "created_utc": "1656757201.0", "edited": "False", "id": "iek8mv7", "is_submitter": "False", "link_id": "t3_vpfqsz", "parent_id": "t3_vpfqsz", "score": "1", "subreddit": "horror", "subreddit_id": "t5_2qh9x"}, {"author": "espressoBump", "body": "I think it's foolish to think that work ethic is on some left right devide, it shouldn't be, it's way too personal to be on a continuum. Plus, people may work extremely different in different situations and environments.", "created_utc": "1656680019.0", "edited": "False", "id": "ieg2okq", "is_submitter": "False", "link_id": "t3_vomed0", "parent_id": "t1_ieeo4za", "score": "29", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "espressoBump", "body": "Serious question. For the blue and purple how do you find shoe shine for them? Do they need to be exact matches or can someone similar work? I have red shoes and they're looking old.", "created_utc": "1656665325.0", "edited": "False", "id": "iefh9g2", "is_submitter": "False", "link_id": "t3_vodbao", "parent_id": "t3_vodbao", "score": "2", "subreddit": "pics", "subreddit_id": "t5_2qh0u"}, {"author": "espressoBump", "body": "The most beautiful place in the world for me is New Zealand - Queenstown and Wanaka, I wish I knew the American equivalent.", "created_utc": "1656664962.0", "edited": "False", "id": "iefgtry", "is_submitter": "False", "link_id": "t3_vojmxt", "parent_id": "t3_vojmxt", "score": "1", "subreddit": "unpopularopinion", "subreddit_id": "t5_2tk0s"}, {"author": "espressoBump", "body": "Anddddd now we have monkey poxs.", "created_utc": "1656642984.0", "edited": "False", "id": "ieeit08", "is_submitter": "False", "link_id": "t3_vo5r6z", "parent_id": "t1_ieb4zi1", "score": "2", "subreddit": "oddlyspecific", "subreddit_id": "t5_2wjlc"}, {"author": "espressoBump", "body": "I just can't openly bash it because my family members are almost all Christian. I love them, I hate what they believe in, and in turn what it does to this country. I'm not ready to break all ties with my family because they respect me as an atheist and I'd rather influence them by letting them know we exist than shutting them out completely. It's hard. There are days where I want to post my mind and I don't, but I'd love to.", "created_utc": "1656287841.0", "edited": "False", "id": "idv9d9g", "is_submitter": "False", "link_id": "t3_vlbyp3", "parent_id": "t3_vlbyp3", "score": "1", "subreddit": "atheism", "subreddit_id": "t5_2qh2p"}, {"author": "espressoBump", "body": "A small group of dedicated people can make changes in the real world. If you're not willing to do anything don't bring the rest of us down.", "created_utc": "1656286242.0", "edited": "False", "id": "idv646i", "is_submitter": "False", "link_id": "t3_vl8a6q", "parent_id": "t1_iduyz6m", "score": "12", "subreddit": "atheism", "subreddit_id": "t5_2qh2p"}, {"author": "espressoBump", "body": "Politics aside this image is confusing as fuck.", "created_utc": "1656273025.0", "edited": "False", "id": "idud79a", "is_submitter": "False", "link_id": "t3_vl6xtw", "parent_id": "t1_idtqym6", "score": "12", "subreddit": "WhitePeopleTwitter", "subreddit_id": "t5_35n7t"}, {"author": "espressoBump", "body": "Ancient Egyptians", "created_utc": "1656244978.0", "edited": "False", "id": "idsps76", "is_submitter": "False", "link_id": "t3_vkzowv", "parent_id": "t3_vkzowv", "score": "1", "subreddit": "BeAmazed", "subreddit_id": "t5_363r3"}]