[{"author": "EternityMirror", "body": ">I’m wondering if it’s possible to be two types.\n\nWell, no. AP is all about your attitude towards the aspects it measures - you can't have self-positive & others-negative disposition towards emotion AND self-negative & others-positive disposition towards emotion at the same time. It's one or the other.\n\nConsider your approach towards the emotion and logic aspects - which one are you confident in and which one are you unbothered in? Read [this](https://www.attitudinalpsyche.com/positions/confident/) and [this](https://www.attitudinalpsyche.com/positions/unbothered/) to compare. I think it should be quite easy to figure out which type you are after that.", "created_utc": "1663759024.0", "edited": "False", "id": "ipbejco", "is_submitter": "False", "link_id": "t3_xjgmdd", "parent_id": "t3_xjgmdd", "score": "1", "subreddit": "attitudinalpsyche", "subreddit_id": "t5_2o92bb"}, {"author": "EternityMirror", "body": ">If you live in Europe everyone knows around 3-4 languages at least\n\nAnd how many of those people can actually fluently communicate in those 3-4 languages, or at least understand them? Just because schools in Europe try to teach 2 foreign languages at once doesn't mean that all Europeans actually *know* those languages. At least in my country, most people only speak their native language + English.", "created_utc": "1660900532.0", "edited": "False", "id": "ikwtv2e", "is_submitter": "False", "link_id": "t3_ws1ocp", "parent_id": "t1_ikwb49k", "score": "6", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "EternityMirror", "body": "God, what about the Libra stereotypes *doesn't* bother me lmao? Jk, but I wish people stopped acting like Libras have no spine/are doormats simply because Libra cares about balance & harmony. Balance, peace, agreement... that can all be achieved in lots of ways, also through being assertive. Not all Libras are allergic to conflict and start crying the moment someone raises their voice at them. \n\nI also wish people remembered Libra cares not only about beauty, but also about justice and fairness. Saturn is literally exalted in Libra.", "created_utc": "1660748506.0", "edited": "False", "id": "iknxlk6", "is_submitter": "False", "link_id": "t3_wqjfs9", "parent_id": "t3_wqjfs9", "score": "81", "subreddit": "astrology", "subreddit_id": "t5_2qi4c"}, {"author": "EternityMirror", "body": "Kurwa, ale to jest jednak straszne. Bo tu już nawet nie chodzi o samą ekologię i środowisko, ale przecież zatajanie tego, co się działo z Odrą, to było narażanie zdrowia i życia obywateli na niebezpieczeństwo. Nawet jak ktoś mieszka z dala od Odry, to nie przeraża go myśl, że coś podobnego może się wydarzyć w pobliżu jego domu i też rząd będzie mieć wyjebane? \n\nTo znaczy ja wiem, że ludzie mają to w dupie. Ale mimo wszystko mnie to szokuje.", "created_utc": "1660737546.0", "edited": "False", "id": "ikn8vbu", "is_submitter": "False", "link_id": "t3_wqkkqa", "parent_id": "t1_ikn6evf", "score": "29", "subreddit": "Polska", "subreddit_id": "t5_2qiqo"}, {"author": "EternityMirror", "body": "I've been fascinated with Greenlandic since I was a kid, and am hoping I'll get to give it a try someday - actually, Greenlandic is the reason why I decided to start learning Danish, so that I can have access to more resources for Greenlandic in the future.", "created_utc": "1659781131.0", "edited": "False", "id": "ij647bd", "is_submitter": "False", "link_id": "t3_wh44xu", "parent_id": "t3_wh44xu", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "EternityMirror", "body": "Personally, because I'm AFAB and look like a woman irl, \"lesbian\" seems like the most correct label to use - since by others I am treated just like a cis lesbian, the people who are attracted to me are the ones who like women, etc.\n\nThat said, my own personal feelings about the lesbian label are complicated. I try to avoid calling myself that over the Internet, since I identify as bigender. It feels wrong to claim to be a non-man attracted to other non-men when I don't identify as a non-man in the first place - I want the man part of me to be as important as the woman part, goddamnit!\n\nBut again, my internal feelings about my gender identity don't influence how I come off in real life and how I'm treated. I'm not transitioning to male (and in my country it's not possible to change the gender marker to nonbinary, so I'm forced to exist within the binary whether I like it or not), so the lesbian experience is also my experience. Identity is just... complicated.", "created_utc": "1658406131.0", "edited": "1658408709.0", "id": "ih1i4bt", "is_submitter": "False", "link_id": "t3_w49lo9", "parent_id": "t3_w49lo9", "score": "14", "subreddit": "NonBinaryTalk", "subreddit_id": "t5_3e2zi"}, {"author": "EternityMirror", "body": "W życiu niczego tak nie potrzebowalxm jak tych skarpetek", "created_utc": "1657308261.0", "edited": "False", "id": "ifdsghg", "is_submitter": "False", "link_id": "t3_vud1jg", "parent_id": "t3_vud1jg", "score": "3", "subreddit": "poland", "subreddit_id": "t5_2qkmn"}, {"author": "EternityMirror", "body": "oh it's stunning!", "created_utc": "1656672329.0", "edited": "False", "id": "iefpz1w", "is_submitter": "False", "link_id": "t3_voxjpb", "parent_id": "t3_voxjpb", "score": "2", "subreddit": "succulents", "subreddit_id": "t5_2smnv"}, {"author": "EternityMirror", "body": "i think this comment section really shows how much cancer and libra suns square in real life LMAO. the biased comments are shitty and bring nothing to the discussion, but ironically they do work to show that cancer and libra are nothing alike\n\npersonally, even though i have a cancer moon, i clash with cancer suns a lot too. haven't yet met a cancer sun i'd get along with tbh. i'm not gonna blame them for that, obviously, since it's no one's fault, we just work differently! but i think this does show perfectly how different these signs actually are. not alike at all, very likely to hate each other's guts lmao\n\nbtw, \"cancers/libras are toxic and manipulative and selfish\" - guys, get off reddit and go to therapy. astrology is not a tool meant to help you cope with that stuff.", "created_utc": "1656664286.0", "edited": "False", "id": "iefg06r", "is_submitter": "False", "link_id": "t3_voit64", "parent_id": "t3_voit64", "score": "4", "subreddit": "astrology", "subreddit_id": "t5_2qi4c"}, {"author": "EternityMirror", "body": "Oof... getting told that I do seem to have body dysphoria was a big blow. But you might be right here, and I might be in denial. I definitely do have the tendency to ignore any negative things I feel (\"if I don't acknowledge it, it doesn't exist\") - and after starting to question my gender identity, I've been feeling a bit more uncomfortable with being a woman, so... whoops. \n\nAnd thank you, I'll definitely keep exploring my gender identity - seems like there's no way out of this situation at this point lmao. I appreciate the support and input, it means a lot to me!\n\n(and sorry for replying so late, I was too scared to check the replies to my post for a while)", "created_utc": "1655634376.0", "edited": "False", "id": "icxi7e4", "is_submitter": "False", "link_id": "t3_vdlejw", "parent_id": "t1_icl29g9", "score": "1", "subreddit": "asktransgender", "subreddit_id": "t5_2r4b9"}, {"author": "EternityMirror", "body": "Sorry for responding so late, I'm a coward so I needed a few days to gather up courage and read the replies to my post 😅\n\nThank you for your input and support! I'm slowly starting to accept that I'm most likely not cis, although I still have trouble with figuring out what *exactly* I am, but I guess that takes time. Seeing how supportive the community is definitely makes me feel better about this whole mess that I am, though, so thank you once again!", "created_utc": "1655634022.0", "edited": "False", "id": "icxhtjy", "is_submitter": "False", "link_id": "t3_vdlejw", "parent_id": "t1_ickt81q", "score": "2", "subreddit": "asktransgender", "subreddit_id": "t5_2r4b9"}, {"author": "EternityMirror", "body": "Sorry for not responding immediately - I'm a coward, so the first thing I did after posting the question was closing reddit for a few days and refusing to look at what people had to say to me 😭 (mostly because I knew I would not like the answers). But your input is greatly appreciated.To answer the questions:\n\n1. I'd assume they most likely aren't cis. I guess I'm slowly coming to terms with the fact that I simply probably am not cis, whether I'm trans binary or non-binary, but even admitting to that is terrifying. I guess I really like the comfortable bubble of considering myself a cis person.\n2. ...Yeah, I would. 99% chance I would. I mean, I keep thinking \"but would I REALLY want to be a man if I were to turn out to be uglier/less attractive than I am now?\" or \"could I really be transmasc without stereotypically masculine interests/without cishet male friends?\" but if we assume that my body would look the way I'd want it to, and I could keep the friends I have now, etc., while just... being a man, then yes. Sounds like the best alternate timeline, tbh.\n\nI have no idea why I'd want that, though. I don't find male bodies attractive and I don't really get along well with most cishet men, so... why would I want to be a man? It'd just feel more right somehow. I don't really hate being a woman in a way I see a lot trans people say they do, what I suppose is giving me extreme impostor syndrome (like, I feel guilty for even questioning my gender). I'm just in an extreme state of denial currently and keep fluctuating between hours of \"yeah, I do want to be a guy\" and then sudden switch to \"no, being a girl is easier, let's just leave it\" and then switching to \"I do want to be a guy tho :/\" again. I keep feeling that I'm destroying my life by thinking about this, because the more I think about it, the less comfortable I feel with being a woman. But then I don't know what I am and it scares the shit out of me and it makes me want to repress everything even more and go back to my peaceful cis life.\n\nBut I guess I'm probably *not* cis. And if I'm not, then no amount of stress and denial will change that (and it might come back to kick me in the ass later, so it's probably best to figure things out now than wait for later).\n\nThank you once again, your input was really helpful.", "created_utc": "1655633500.0", "edited": "False", "id": "icxh8qv", "is_submitter": "False", "link_id": "t3_vdlejw", "parent_id": "t1_ickvfqr", "score": "2", "subreddit": "asktransgender", "subreddit_id": "t5_2r4b9"}]