[{"author": "evelyn6073", "body": "Oh yeah, I always thought it was interesting. I’ve seen signs and videos playing on like the subways to promote using more pure korean.", "created_utc": "1667984479.0", "edited": "False", "id": "ivnuj24", "is_submitter": "False", "link_id": "t3_ypqk5x", "parent_id": "t3_ypqk5x", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "evelyn6073", "body": "Oh, yes. I work in Seoul. Apparently it’s super common (so I learned after I expressed concerns about it). No idea what the shot is comprised of though.", "created_utc": "1667132096.0", "edited": "False", "id": "iud11l8", "is_submitter": "False", "link_id": "t3_yhcj5b", "parent_id": "t1_iud0w3k", "score": "17", "subreddit": "todayilearned", "subreddit_id": "t5_2qqjc"}, {"author": "evelyn6073", "body": "Super random, but 90% of my elementary school students get nightly ‘shots’ from their parents to apparently help them grow taller lol so I’m not sure id blame height difference on just nutrition", "created_utc": "1667131925.0", "edited": "False", "id": "iud0sa0", "is_submitter": "False", "link_id": "t3_yhcj5b", "parent_id": "t1_iuczpjd", "score": "3", "subreddit": "todayilearned", "subreddit_id": "t5_2qqjc"}, {"author": "evelyn6073", "body": "Geezer is the only one that sounds right to me", "created_utc": "1667044393.0", "edited": "False", "id": "iu8jtgr", "is_submitter": "False", "link_id": "t3_yfqcvq", "parent_id": "t3_yfqcvq", "score": "1", "subreddit": "EnglishLearning", "subreddit_id": "t5_2u8ap"}, {"author": "evelyn6073", "body": "Hmmm I don’t have any giant regrets but probably the amount of time I’ve spent ‘passively’ learning Korean. Eg living in Korea and picking up words here and there but never writing them down or studying them, relying on my basic conversation skills to get me through all interactions, just watching Korean content for fun and not using it as an opportunity to study or learn more deeply. \n\n\nI’m sure I got better over time just being exposed to Korean and using it for daily interactions, but I would probably have made so much more progress if I tried to actively improve rather than be somewhat content with being able to communicate at all lol.", "created_utc": "1666518449.0", "edited": "False", "id": "itftwt8", "is_submitter": "False", "link_id": "t3_yaywvv", "parent_id": "t3_yaywvv", "score": "2", "subreddit": "Korean", "subreddit_id": "t5_2rd8q"}, {"author": "evelyn6073", "body": "High frequency words. I didn’t actively try, but after a while I did notice I don’t read out words I know well, it’s just pretty automatic recognition. It doesn’t take me any effort to read these words and sometimes I don’t notice if it’s English or Korean. I think it just happens after a lot of exposure! I also read A LOT in Korean to study.", "created_utc": "1666003948.0", "edited": "False", "id": "isnqszw", "is_submitter": "False", "link_id": "t3_y5wfpo", "parent_id": "t3_y5wfpo", "score": "3", "subreddit": "Korean", "subreddit_id": "t5_2rd8q"}, {"author": "evelyn6073", "body": "I try to make SMART goals: specific, measurable, attainable, relevant, time bound. \n\n\nFor example\n\nI will use duolingo or Memrise to study vocabulary everyday \n\nI will read 2 chapters of my book each week and write the vocab list. \n\nI will talk in TL with another person for 1 hour+ each week (with online tutor or on HelloTalk).\n\nHonestly I’m just casually learning so this is enough for me to gradually improve/not degrade my languages!", "created_utc": "1665926603.0", "edited": "False", "id": "isjfptp", "is_submitter": "False", "link_id": "t3_y5ayeo", "parent_id": "t3_y5ayeo", "score": "4", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "evelyn6073", "body": "It was written for a white audience. There’s some nice quotes. Im thinking of tumblr discussions circa 2014 lol. I did kinda laugh at how the main character always had these perfect responses in the moment even though she was supposed to be like ‘realizing’ it. Also I read it maybe 2 years ago, and a lot of the slang is out of it’s time (of course- slang changes pretty fast lol). I will say if I had read this when I was in high school it would have been accurate for how teens talk. I think it’s just outdated and simple. \n\n\nNot to say it isn’t good for some audiences. I think it mentions a lot of very important topics. A little lecture-y, but some people might relate and understand it more if it’s in a narrative form.", "created_utc": "1665923984.0", "edited": "False", "id": "isjaylk", "is_submitter": "False", "link_id": "t3_y51x60", "parent_id": "t3_y51x60", "score": "3", "subreddit": "books", "subreddit_id": "t5_2qh4i"}, {"author": "evelyn6073", "body": "Random lists of words, partial sentences, scribbled lists, sometimes I tried a nice color coding but I always have up lol\nNow I just sometimes write words down on my phones notes app", "created_utc": "1665654173.0", "edited": "False", "id": "is4vo92", "is_submitter": "False", "link_id": "t3_y24qyr", "parent_id": "t3_y24qyr", "score": "1", "subreddit": "Korean", "subreddit_id": "t5_2rd8q"}, {"author": "evelyn6073", "body": "Use another book’s dust cover.", "created_utc": "1665479716.0", "edited": "False", "id": "irvb0cf", "is_submitter": "False", "link_id": "t3_y0woir", "parent_id": "t3_y0woir", "score": "2", "subreddit": "books", "subreddit_id": "t5_2qh4i"}, {"author": "evelyn6073", "body": "Not sure what your last comment means..but if it helps, I don’t move my lips at all when saying 스트레스. I just open my mouth in a relaxed(?) wide way and say it. You don’t need to strain. \n\nMaybe uploading a vocaroo would help us help you?", "created_utc": "1665216710.0", "edited": "False", "id": "irhvs2n", "is_submitter": "False", "link_id": "t3_xylk2u", "parent_id": "t3_xylk2u", "score": "6", "subreddit": "Korean", "subreddit_id": "t5_2rd8q"}, {"author": "evelyn6073", "body": "It’s kinda weird to caption that lol. Didn’t you think of how other people might read it? Gotta start thinking about what you post cause as you noticed, people can’t know your intention. I’d definitely secretly screenshot a post like that and send to the group chat to be like WTF if I’d had seen it. \n\nAlso I’m Mexican and would be weirded out more by the Mexican quantifier than the animal thing personally 😂 but all of it is weird. Not fired worthy, but I prob wouldn’t choose to be friends with you if I worked with you and saw it.", "created_utc": "1664774023.0", "edited": "False", "id": "iqulcuq", "is_submitter": "False", "link_id": "t3_xu9j4h", "parent_id": "t3_xu9j4h", "score": "2864", "subreddit": "tifu", "subreddit_id": "t5_2to41"}, {"author": "evelyn6073", "body": "I’ve felt plateaued for the past 3 years of Korean >< in theory I’ve learned more…but there’s no evidence of that. I’ve been ‘daily life capable’ 3-4 years into my learning and I still feel ‘just capable’ 7 years in. \n\nThough if I look through the novels I tried to read, I can see words I now know that I had written in the margins to study… I also agree that it’s probably a motivation thing as some others mentioned. The words I study from advanced materials I won’t easily come across ‘in the wild’ so it seems less pertinent to memorize and more difficult to remember since I see it less often", "created_utc": "1664756971.0", "edited": "False", "id": "iqtofib", "is_submitter": "False", "link_id": "t3_xnupx1", "parent_id": "t3_xnupx1", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "evelyn6073", "body": "I don’t game really… but I did play those dating sim games A LOT when I was learning korean lol (anyone else play mystic messenger?)", "created_utc": "1664717108.0", "edited": "False", "id": "iqqw9ys", "is_submitter": "False", "link_id": "t3_xspsyp", "parent_id": "t3_xspsyp", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "evelyn6073", "body": "Yeah I only got those comments as a beginner where I had some stock phrases to introduce myself and such lol. \n\n\nNow we just talk in my target language. They might compliment me once they find out how long I’ve lived in the country, but in most conversations people just converse normally about whatever topic without mentioning language (even though it’s still obvious I’m not fluent yet haha…)", "created_utc": "1664716413.0", "edited": "False", "id": "iqqux1l", "is_submitter": "False", "link_id": "t3_xtmn36", "parent_id": "t3_xtmn36", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "evelyn6073", "body": "Huh. I’ve been living in Korea since 2019 and I wonder if the whole masks thing has had an impact on my learning. \n\nBut I think I understand everyone pretty much fine at my level…and everyone still wears masks so I can’t really compare lol. Though I notice my students struggle with phonics/spelling because they mumble English due to not being able to hear the correct words. Interesting!", "created_utc": "1664701904.0", "edited": "False", "id": "iqq9q9z", "is_submitter": "False", "link_id": "t3_xmfoki", "parent_id": "t3_xmfoki", "score": "1", "subreddit": "Korean", "subreddit_id": "t5_2rd8q"}, {"author": "evelyn6073", "body": "I read during lunch breaks and on my phone while waiting in line for coffee, waiting for the train, etc. It’s helped a lot to read on my phone (Libby!).", "created_utc": "1664196039.0", "edited": "False", "id": "ipyp6wj", "is_submitter": "False", "link_id": "t3_xo997f", "parent_id": "t3_xo997f", "score": "4", "subreddit": "52book", "subreddit_id": "t5_2s935"}, {"author": "evelyn6073", "body": "Night ( Elie Wiesel was a teenager when he and his family were taken from their home in 1944 to Auschwitz concentration camp, and then to Buchenwald. ), \nbetween the world and me (nonfiction memoir that addresses the contemporary effects of historical racism and the current events as well), at night all blood is black (two friends from Senegal fight in WW1 with the French army. The friend asks the other to mercy kill him. A choice was made and the effects are harrowing), a long walk to water (story of one of the lost boys of Sudan). I think all are under 200 pages! (My opinion of ‘easy reads’ may be different from yours…sorry in advance!) on mobile so there’s terrible formatting going on..", "created_utc": "1663336919.0", "edited": "False", "id": "ioo0cgr", "is_submitter": "False", "link_id": "t3_xfgl5y", "parent_id": "t3_xfgl5y", "score": "2", "subreddit": "52book", "subreddit_id": "t5_2s935"}, {"author": "evelyn6073", "body": "Unrelated but like..there’s that and meanwhile I’m trying to assert that I worked really hard to get to my intermediate level and people here in Korea (foreigners and Koreans!) just assume I learned from kpop and dramas. I studied so much!!! Let me tell you how much I suffered over the years to be able to shyly ask for trash bags at the convenience store >< \nIt’s like people don’t believe me…or they can’t believe I apparently studied so hard and am still not fluent and probably never will be lol\nI have a friend who’s fluent in English and Japanese and learned Korean from dramas and talking to friends…she can’t read or write hangul…I’m so jealous cause she’s better than me without having taken an actual formal class.", "created_utc": "1663336098.0", "edited": "False", "id": "ionydxz", "is_submitter": "False", "link_id": "t3_xf31x1", "parent_id": "t3_xf31x1", "score": "1", "subreddit": "Korean", "subreddit_id": "t5_2rd8q"}, {"author": "evelyn6073", "body": "I love to say 쭈꾸미 (jjoo-kkoo-mee). It’s kinda…a little octopus. \nDouble consonants always sound sooo cute to me. I used to say 딸기 (strawberry) was my favorite word to say until I learned 쭈꾸미 lolol.", "created_utc": "1657067694.0", "edited": "False", "id": "if0is5g", "is_submitter": "False", "link_id": "t3_vrlh4c", "parent_id": "t1_iew8fff", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "evelyn6073", "body": "What are you trying to say?", "created_utc": "1651049518.0", "edited": "False", "id": "i6dmq5z", "is_submitter": "False", "link_id": "t3_ucyf85", "parent_id": "t3_ucyf85", "score": "0", "subreddit": "Korean", "subreddit_id": "t5_2rd8q"}, {"author": "evelyn6073", "body": "I agree. I think I only learned to read well once I took a lit course in uni. We had to try to annotate and while at first it was annoying, it definitely helped finding themes and symbols that showed up. \nI also read super quickly lol like..so quickly I can miss things. I’m definitely the person whose eyes skip to the bottom paragraph of a page when something tense or exciting is happening…it’s a curse. So that def helped me curb that instinct. \n\nI dont highlight in every book I read but when I feel the need to, it’s for really beautiful writing or those jaw drop moments. On rereads it’s nice to remember how impactful those sentences were the first time I read them ><", "created_utc": "1651031549.0", "edited": "False", "id": "i6cxxr5", "is_submitter": "False", "link_id": "t3_uabpje", "parent_id": "t1_i5wo89m", "score": "2", "subreddit": "books", "subreddit_id": "t5_2qh4i"}, {"author": "evelyn6073", "body": "Idk I purposely write ‘don’t correct’ on my posts lol. I use HT like a social media app mostly for language learning community. I’m not the only one, I’ve been using HT for 5 years. So I know how it can be used :)", "created_utc": "1649915352.0", "edited": "False", "id": "i4o1f6m", "is_submitter": "False", "link_id": "t3_u37q0j", "parent_id": "t1_i4nvsy1", "score": "4", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "evelyn6073", "body": "HT isn’t just language exchange tho. It’s also a social media app. And I have a tutor to give me accurate and detailed corrections and some friends I let correct me :)", "created_utc": "1649915195.0", "edited": "False", "id": "i4o17ca", "is_submitter": "False", "link_id": "t3_u37q0j", "parent_id": "t1_i4o0tce", "score": "-5", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "evelyn6073", "body": "Korean? Ummm 6 years and I’m still super slow and need a dictionary for some necessary words hahaha….hoping this year I can stick to my goal and read more in Korean", "created_utc": "1649910231.0", "edited": "False", "id": "i4ntky0", "is_submitter": "False", "link_id": "t3_u340r5", "parent_id": "t3_u340r5", "score": "9", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "evelyn6073", "body": "Unless people ask for corrections, don’t give it. I hate getting corrections on a post when I’m just trying to share my thoughts on something and people ignore the whole message of my post to correct one typo haha. \n\nI am conversational in my TL, so correcting every mistake or unnatural expression is just breaking the flow of convo and discouraging. I just want to talk in my TL. Language learning for me is to communicate, not to just have perfect textbook grammar lol so I don’t mind my personal language quirks while speaking tbh. The way I speak my TL is like part of my personality, accent and quirks included. As long as my message gets conveyed, I’m cool with it. \n\nIn conclusion, people learn languages differently so just let people be…", "created_utc": "1649909890.0", "edited": "False", "id": "i4nszxa", "is_submitter": "False", "link_id": "t3_u37q0j", "parent_id": "t3_u37q0j", "score": "22", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "evelyn6073", "body": "I screenrecord the videos and slow it down / mirror in the app InShot", "created_utc": "1649508629.0", "edited": "False", "id": "i411cx3", "is_submitter": "False", "link_id": "t3_tzq5tg", "parent_id": "t3_tzq5tg", "score": "1", "subreddit": "Dance", "subreddit_id": "t5_2qhs0"}, {"author": "evelyn6073", "body": "I was saying 문신 for a while and every korean person I talked to said 타투 lol. So I now just say 타투 since it seemed more common in my circles.", "created_utc": "1649294109.0", "edited": "False", "id": "i3pencm", "is_submitter": "False", "link_id": "t3_ty00zl", "parent_id": "t3_ty00zl", "score": "21", "subreddit": "Korean", "subreddit_id": "t5_2rd8q"}, {"author": "evelyn6073", "body": "You are doing the action of opening. So I opened the door. \n문이 바람에 열렸어요 the door ‘was opened’ by the wind.\nI’m sure someone can give a more detailed explanation 😓", "created_utc": "1649293973.0", "edited": "False", "id": "i3pecfp", "is_submitter": "False", "link_id": "t3_ty0wee", "parent_id": "t3_ty0wee", "score": "1", "subreddit": "Korean", "subreddit_id": "t5_2rd8q"}, {"author": "evelyn6073", "body": "I’ll send a DM.", "created_utc": "1649216227.0", "edited": "False", "id": "i3kyzdg", "is_submitter": "False", "link_id": "t3_txabzz", "parent_id": "t3_txabzz", "score": "1", "subreddit": "language_exchange", "subreddit_id": "t5_2tdbm"}, {"author": "evelyn6073", "body": "Do u mean it’s hard to find interesting content that has Korean subtitles…? There’s tons of Korean content online lol. Perhaps you need to search outside your usual content preferences? \nLet me know what you want to find and maybe I can help. Korea seems a little behind on the accessibility thing since they don’t really sub native tho. I’ve def watched dramas on Netflix with Korean subs, but I had to have my VPN set to Korea for better options. \nInterviews on YouTube, variety type shows, and vlives are your best bet for korean subtitles IMO.", "created_utc": "1649068193.0", "edited": "False", "id": "i3c3j8o", "is_submitter": "False", "link_id": "t3_tvqa6g", "parent_id": "t1_i3b3v1t", "score": "9", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "evelyn6073", "body": "Vlive has korean subs. It’s idol content but it’s realistic conversation and free lol", "created_utc": "1648991682.0", "edited": "False", "id": "i37x8oe", "is_submitter": "False", "link_id": "t3_tv6u6x", "parent_id": "t3_tv6u6x", "score": "7", "subreddit": "Korean", "subreddit_id": "t5_2rd8q"}, {"author": "evelyn6073", "body": "I haven’t purposely studied grammar in years lol. But i studied grammar and vocabulary in a very structured way for the first year or two in my Korean journey. \nAfterwards I haven’t really tried to learn any grammar…I just hear a lot of things and ‘guess the meaning’. After hearing something said so often I end up trying to use it…sometimes my conjugation is off or the nuance can be different but usually it seems to work out since no one has ever really called me out lol. \nAt some point I’ve just begun parroting things I’ve heard before just going by gut feeling and seeing people’s reactions to see if it was correct lol. I’m sure many people do this…? But I agree it seems very hard to do without a base of grammar. Get to a point where you can understand most of the content you can understand and see what you can pick up from what you don’t! I also get so bored looking at Korean learning books and grammar/vocab drills and flash cards…so do what helps you learn best. I think we all agree that a lot a lot a lot of input is super important :)\n\nAlso, children’s books and dramas are a certain type of Korean…books use weird words and dramas also use a lot of high level vocab…I guess depending on the genre. if you want to use these as input it could be hard as a beginner. I recommend variety shows or Vlives since it’s people actually just talking. So much easier and useful even though people might talk really fast to you at first. Though I also remember watching cheesy romance web dramas as a beginner and it was easy to understand haha. Good luck!", "created_utc": "1647857805.0", "edited": "False", "id": "i1ihyh7", "is_submitter": "False", "link_id": "t3_tj2o28", "parent_id": "t3_tj2o28", "score": "2", "subreddit": "Korean", "subreddit_id": "t5_2rd8q"}, {"author": "evelyn6073", "body": "In Korean we usually memorize the first syllable (mon, tues, wed, etc) in one like long word or song(?). So for a while I’d have to count on my fingers il, wohl, hwa, soo, mok, geum, toh to get to the weekday I needed lol. But having the whole little song of the first syllable was a good stepping stone for me to find the day I needed when I was starting to speak.", "created_utc": "1646296835.0", "edited": "False", "id": "hz5sz0o", "is_submitter": "False", "link_id": "t3_t5l6oq", "parent_id": "t3_t5l6oq", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "evelyn6073", "body": "So many people at language exchange apps or meetups for Korean are just really trying to invite you to their cult-y church ):  I don’t mind if they are religious or want to talk about it, but it’s so overwhelming. They either want all your time dedicated to it or your money lol. Korean Christians are always trying to recruit foreigners…rarely are they there for actual language reasons. So sadly I’ve started filtering out the blatantly religious ones to hopefully avoid this.", "created_utc": "1646280372.0", "edited": "False", "id": "hz5392m", "is_submitter": "False", "link_id": "t3_t58n5u", "parent_id": "t3_t58n5u", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "evelyn6073", "body": "Looks like it’s around 39:30. I just hear chanyeol say if the door is locked it means something big/important is happening ‘큰일’", "created_utc": "1645872366.0", "edited": "False", "id": "hyi27oj", "is_submitter": "False", "link_id": "t3_t1u283", "parent_id": "t3_t1u283", "score": "3", "subreddit": "Korean", "subreddit_id": "t5_2rd8q"}, {"author": "evelyn6073", "body": "Depends on how necessary to the plot it feels to me…but usually I don’t like references to sexual things lol. For example when the kid was sitting at the cabin naked and just admiring his ‘young body’ or whatever lol. Who does that??? It made me so uncomfortable just bc it felt so random and strange (the emphasis on the ‘young’ part lol…anyways I can’t remember which murakami book this was, possibly not Norwegian wood…)\n\nI also remember feeling the same when reading Circe and there were weird sexual situations or rape references. I can read some otherwise ‘crude’ books but usually I know what I’m getting into depending on the summary or the author. I think my problem is just not expecting it and feeling it was unnecessary. I just skim through it and hope it’s not a recurring thing.", "created_utc": "1643735839.0", "edited": "False", "id": "hv5mrf1", "is_submitter": "False", "link_id": "t3_shw17t", "parent_id": "t3_shw17t", "score": "2", "subreddit": "books", "subreddit_id": "t5_2qh4i"}, {"author": "evelyn6073", "body": "Afaik they don’t do the whole polish squeaky clean thing here…perhaps at a place that caters to Americans. But yeah, scaling is just scaling.", "created_utc": "1643478675.0", "edited": "False", "id": "huqt9yi", "is_submitter": "False", "link_id": "t3_sfmq4i", "parent_id": "t3_sfmq4i", "score": "2", "subreddit": "Korean", "subreddit_id": "t5_2rd8q"}, {"author": "evelyn6073", "body": "Hi. They wrote it incorrectly. You do not add 예요 to a verb. \n마시다—> 마시(delete 다) add 어요/아요—> 마시어요 becomes 마셔요", "created_utc": "1642601534.0", "edited": "False", "id": "htbi4ov", "is_submitter": "False", "link_id": "t3_s7px88", "parent_id": "t1_htbejse", "score": "12", "subreddit": "Korean", "subreddit_id": "t5_2rd8q"}, {"author": "evelyn6073", "body": "Get a solid base on vocabulary and beginner-intermediate grammar and you should be good to go. Look up grammar as you come across it. I never remember grammar points I try to study from a book anyways lol. Exposure to it in context really let’s you get an actual feel for how it’s used.", "created_utc": "1640000815.0", "edited": "False", "id": "hpa9wud", "is_submitter": "False", "link_id": "t3_rkg18c", "parent_id": "t3_rkg18c", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "evelyn6073", "body": "You could get a keyboard cover that has both. I got one on Amazon.", "created_utc": "1639575352.0", "edited": "False", "id": "hon4svi", "is_submitter": "False", "link_id": "t3_rgyuot", "parent_id": "t3_rgyuot", "score": "4", "subreddit": "Korean", "subreddit_id": "t5_2rd8q"}, {"author": "evelyn6073", "body": "Oh my main is skz ahhahaha I just follow korean accts so it’s not like they hiding but like…they all have their circles of 트친 I feel like lol but yay for learning!\nBtw 알티 is RT and 맘찍 is clicking the heart! Just check the trending for any fun tags that fandoms take part in :)", "created_utc": "1639102020.0", "edited": "False", "id": "hnxliy1", "is_submitter": "False", "link_id": "t3_rc1i9r", "parent_id": "t1_hnwo27i", "score": "2", "subreddit": "Korean", "subreddit_id": "t5_2rd8q"}, {"author": "evelyn6073", "body": "Hmmm I always participate in 트친소 and people post if they are open to DMs or mentions. There’s also those tag trends of like ‘맘찍 if you want to be closer, 알티 if you want to DM, 멘션 if you want to talk 반모’ so if any followers post that, that’s a way to open the door to be closer!\n\nBut yeah it’s crazy how big of a difference I feel in my fandom acts. The most welcoming and interactive one is sf9 and they are the group I know least/recently started to like haha. I wish my main stan acct was just as active 🥲", "created_utc": "1639086850.0", "edited": "False", "id": "hnwmqv6", "is_submitter": "False", "link_id": "t3_rc1i9r", "parent_id": "t1_hnuurhs", "score": "2", "subreddit": "Korean", "subreddit_id": "t5_2rd8q"}, {"author": "evelyn6073", "body": "Oh yeah for sure! I also catch myself when I write in korean doing a lot more asides like (????? \nOr like (0명) hahahah\n\nI have three Stan accounts bc I’m crazy but the way I haven’t tweeted in English in about a year is crazy and so fun. Idk if my korean has actually gotten any better but it’s fun! I think I am better at skimming and reading more quickly to see if I’m interested in a tweet or not ahah. Love my 깅들 who probably see tweets that make little sense and are just on board for it all haha", "created_utc": "1639054755.0", "edited": "False", "id": "hnuhsm7", "is_submitter": "False", "link_id": "t3_rc1i9r", "parent_id": "t1_hnuhfyb", "score": "3", "subreddit": "Korean", "subreddit_id": "t5_2rd8q"}, {"author": "evelyn6073", "body": "Interested :)", "created_utc": "1639051485.0", "edited": "False", "id": "hnuck4m", "is_submitter": "False", "link_id": "t3_rbyn2p", "parent_id": "t3_rbyn2p", "score": "1", "subreddit": "Korean", "subreddit_id": "t5_2rd8q"}, {"author": "evelyn6073", "body": "I’m on korean Twitter too~ I’ve definitely become more fluent in Twitter specific slangs 😂 sometimes I write it to people who aren’t on Twitter because I forget it’s not just ‘normal’ korean lol. \n쫀아~ 맞점~ 쫀밤~ are my most used phrases now haha.  \n\nI often have to search ___뜻 트위터 to find the meaning of some terms lol there are some good lists out there though (in korean of course) that explain Twitter lingo~", "created_utc": "1639051379.0", "edited": "False", "id": "hnucehf", "is_submitter": "False", "link_id": "t3_rc1i9r", "parent_id": "t3_rc1i9r", "score": "4", "subreddit": "Korean", "subreddit_id": "t5_2rd8q"}, {"author": "evelyn6073", "body": "Yeah I’ve seen it in official show editing and it’s sometimes jokingly. Like two idol members are arguing and it will caption “the friends (?) enjoy their vacation” or whatever lol.", "created_utc": "1638794687.0", "edited": "False", "id": "hngay8x", "is_submitter": "False", "link_id": "t3_r9yq91", "parent_id": "t1_hng2kj3", "score": "22", "subreddit": "Korean", "subreddit_id": "t5_2rd8q"}, {"author": "evelyn6073", "body": "It’s pretty weird if you are DMing random korean people. Find people on apps like HelloTalk and make posts about being insta friends. Maybe check tags like 맞팔 (idk what else but read some insta tags and try ones that seem friendly) and get some mutual followers that you can like and comment their pics first.", "created_utc": "1638794146.0", "edited": "False", "id": "hnga2k6", "is_submitter": "False", "link_id": "t3_ra5sgm", "parent_id": "t3_ra5sgm", "score": "32", "subreddit": "Korean", "subreddit_id": "t5_2rd8q"}, {"author": "evelyn6073", "body": "I’m interested:) I’m upper intermediate I would say!", "created_utc": "1636985611.0", "edited": "False", "id": "hkpz1ts", "is_submitter": "False", "link_id": "t3_qugn02", "parent_id": "t3_qugn02", "score": "1", "subreddit": "language_exchange", "subreddit_id": "t5_2tdbm"}, {"author": "evelyn6073", "body": "If I were writing a book I’d write it out. But if I’m writing casually like a tweet or a message to a friend I’d often shorten it. Yes it’s common in spoken as well.", "created_utc": "1635905023.0", "edited": "False", "id": "hj3fwq5", "is_submitter": "False", "link_id": "t3_ql3kte", "parent_id": "t1_hj3cm7c", "score": "5", "subreddit": "Korean", "subreddit_id": "t5_2rd8q"}, {"author": "evelyn6073", "body": "I believe it is a shortened form of the particle 는 like how 저는 can become 전.", "created_utc": "1635858046.0", "edited": "False", "id": "hj08f5s", "is_submitter": "False", "link_id": "t3_ql3kte", "parent_id": "t3_ql3kte", "score": "60", "subreddit": "Korean", "subreddit_id": "t5_2rd8q"}, {"author": "evelyn6073", "body": "…what? I don’t get why the teacher is so terrible or why the assignment was so bad. Sounds better than just listing the safety rules or something. \n\nI think it’s fine your teacher heard you, she probably has heard it all before. If she didn’t LOVE you then it won’t even change her opinion of u or anything. All kids are going to think teachers are annoying no matter who the teacher is or who the kid is.", "created_utc": "1634651575.0", "edited": "False", "id": "hh8duqp", "is_submitter": "False", "link_id": "t3_qbbcte", "parent_id": "t3_qbbcte", "score": "4", "subreddit": "tifu", "subreddit_id": "t5_2to41"}, {"author": "evelyn6073", "body": "Delete your address. Usually you can search the street name and it will provide you a clickable address. Then you put the details like apt # in a separate box", "created_utc": "1634651058.0", "edited": "False", "id": "hh8crdn", "is_submitter": "False", "link_id": "t3_qbbeiw", "parent_id": "t3_qbbeiw", "score": "1", "subreddit": "Korean", "subreddit_id": "t5_2rd8q"}, {"author": "evelyn6073", "body": "This might be better posted in /korean. Also, Papago has a great voice reader. \nIf I had to write it in English, [eet-dah] would be the closest.", "created_utc": "1628645489.0", "edited": "False", "id": "h8hej0y", "is_submitter": "False", "link_id": "t3_p22zuj", "parent_id": "t3_p22zuj", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "evelyn6073", "body": "I have no idea what this means. Do your best to pronounce it correctly/like native speakers.", "created_utc": "1628021656.0", "edited": "False", "id": "h7le4bx", "is_submitter": "False", "link_id": "t3_oxbjqh", "parent_id": "t3_oxbjqh", "score": "13", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "evelyn6073", "body": "I would be annoyed to being paying for a class and mainly getting input, which I can do for free lol but that output with feedback is not as easy to come by. Honestly it sounds normal to be assigned new random topics too. The language skills you learn through this go beyond ‘giving directions to the post office’.", "created_utc": "1628021147.0", "edited": "False", "id": "h7lcvp3", "is_submitter": "False", "link_id": "t3_ox4b6b", "parent_id": "t3_ox4b6b", "score": "11", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "evelyn6073", "body": "I also struggle with studying a language other than my family’s language. I will say though, you would most likely never regret putting the effort into learning your family’s language even a little bit.", "created_utc": "1624543706.0", "edited": "False", "id": "h2vx8en", "is_submitter": "False", "link_id": "t3_o711th", "parent_id": "t3_o711th", "score": "55", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "evelyn6073", "body": "I think you need to just look at genre lol ethnicity isn’t the main difference in what you said. \n\nBut anyways I only know 1mill has an online class system but I am not sure how it works.", "created_utc": "1624539172.0", "edited": "False", "id": "h2vok9y", "is_submitter": "False", "link_id": "t3_o6zpc8", "parent_id": "t3_o6zpc8", "score": "3", "subreddit": "Dance", "subreddit_id": "t5_2qhs0"}, {"author": "evelyn6073", "body": "Interesting, my family is from Mexico City btw. So not a super small town. I never heard people speak English there, but maybe that’s because I was always with my family", "created_utc": "1624500924.0", "edited": "False", "id": "h2u9nvs", "is_submitter": "False", "link_id": "t3_o6q7xo", "parent_id": "t1_h2u9az9", "score": "4", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "evelyn6073", "body": "That’s impressive. I’m interested if it’s related to it being a tourist area? My family lives in Mexico and don’t know any english. Like any haha.", "created_utc": "1624500134.0", "edited": "False", "id": "h2u84ai", "is_submitter": "False", "link_id": "t3_o6q7xo", "parent_id": "t3_o6q7xo", "score": "9", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "evelyn6073", "body": "True. Try not to get too annoyed, it’s just people not knowing much about what the country has to offer. You can always ask if they are really interested in knowing more, and if so you could teach them what else the country has to offer!\n\nAlso, as someone who used to be there, don’t fall into the trap of thinking you are better because you aren’t ‘just’ a kpop fan. Not being into dramas or kpop is not a badge of honor, but There’s a group of leaners who tend to view it that way lol. \n\nAlso: I suggest getting into dramas or variety shows if you are serious about learning. Just like kpop isn’t the only music genre in korea, the silly rom com’s (if that is not your thing) are not the only type of drama.", "created_utc": "1624499863.0", "edited": "False", "id": "h2u7liq", "is_submitter": "False", "link_id": "t3_o6o9u5", "parent_id": "t3_o6o9u5", "score": "52", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "evelyn6073", "body": "Yeah I also had someone who was suuuper creepy and found out some personal info and had to be blocked multiple times.", "created_utc": "1622888724.0", "edited": "False", "id": "h0o791c", "is_submitter": "False", "link_id": "t3_nsqnlj", "parent_id": "t1_h0nygg5", "score": "7", "subreddit": "Korean", "subreddit_id": "t5_2rd8q"}, {"author": "evelyn6073", "body": "정말 감사합니다 ☺️", "created_utc": "1622131681.0", "edited": "False", "id": "gznfyu9", "is_submitter": "True", "link_id": "t3_nm0ok6", "parent_id": "t1_gzmvdiu", "score": "1", "subreddit": "WriteStreakKorean", "subreddit_id": "t5_3ij1p6"}, {"author": "evelyn6073", "body": "안녕하세요~ ㅎㅎ 네 네 우리 화이팅합시다^^", "created_utc": "1622131571.0", "edited": "False", "id": "gznfpqh", "is_submitter": "True", "link_id": "t3_nm0ok6", "parent_id": "t1_gzmeut0", "score": "2", "subreddit": "WriteStreakKorean", "subreddit_id": "t5_3ij1p6"}, {"author": "evelyn6073", "body": "Nice! You have a good amount of power coming through. I’m a stray kids fan, would love to learn their dances one day haha. Jealous of your group!", "created_utc": "1621956547.0", "edited": "False", "id": "gzeghp5", "is_submitter": "False", "link_id": "t3_nkoaac", "parent_id": "t3_nkoaac", "score": "2", "subreddit": "Dance", "subreddit_id": "t5_2qhs0"}, {"author": "evelyn6073", "body": "I’m trying to read more books but I get bored/ tired after 3 pages even if I want to read more lol. What I’ve done to get better is to underline as I read. Even just the act of lightly tracing while I read helps me move more quickly. I also have keys like underlining unknown words, wavy lines under unknown grammar post, circling important points helps me get the main idea. Only as I read, I don’t really go back for anything lol focusing on extensive reading rather than intensive. But giving myself a job makes me pay attention better. \n\nAlso, if I get tired I start reading aloud to make myself focus. Even just mumbling (because actually saying it clearly is too much effort and makes me tired physically instead of just mentally lol so will want to stop sooner). \n\nI wish I could get to the point of being able to ‘scan’ in Korean, but lack of sight word skills makes that kind of impossible lol. The more you read the better it will get though! I’ve definitely noticed great improvement as I’ve used the methods I wrote about tho. Good luck!", "created_utc": "1621956128.0", "edited": "False", "id": "gzefj6i", "is_submitter": "False", "link_id": "t3_nkilw4", "parent_id": "t3_nkilw4", "score": "3", "subreddit": "Korean", "subreddit_id": "t5_2rd8q"}, {"author": "evelyn6073", "body": "I’ve gotten misprinted books straight from the publishing warehouse haha it happens.", "created_utc": "1621819783.0", "edited": "False", "id": "gz85m1h", "is_submitter": "False", "link_id": "t3_njbq0x", "parent_id": "t3_njbq0x", "score": "1", "subreddit": "books", "subreddit_id": "t5_2qh4i"}, {"author": "evelyn6073", "body": "If it makes you feel better, I am level one in duolingo but my family is from mexico (I’m born in the US). I’d say forget studying. Take time to appreciate the language and enjoy it. Talk to friends, watch shows, read interesting things (if it gets boring or hard just choose something new) and don’t both to memorize the vocab from it. Using the skills you already have IS learning and hopefully will help you get over the burn out and frustration. I commend you for getting to this point!", "created_utc": "1621819068.0", "edited": "False", "id": "gz848pt", "is_submitter": "False", "link_id": "t3_njc8pc", "parent_id": "t3_njc8pc", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "evelyn6073", "body": "I loved this novel! Definitely top 3.", "created_utc": "1621759525.0", "edited": "False", "id": "gz55xwf", "is_submitter": "False", "link_id": "t3_nirztz", "parent_id": "t3_nirztz", "score": "3", "subreddit": "52book", "subreddit_id": "t5_2s935"}, {"author": "evelyn6073", "body": "Sounds like english to me,but I can’t make out exactly what he’s saying.", "created_utc": "1621759276.0", "edited": "False", "id": "gz55ovf", "is_submitter": "False", "link_id": "t3_nj1s4i", "parent_id": "t3_nj1s4i", "score": "6", "subreddit": "Korean", "subreddit_id": "t5_2rd8q"}, {"author": "evelyn6073", "body": "I don’t have any stories for you, but I do remember when I first started learning I joined some groups/liked some pages on FB that interested me. I would look for ones that had interesting posts or IRL experiences haha even memes. It might be something to try and search for :)", "created_utc": "1621436598.0", "edited": "False", "id": "gypdba1", "is_submitter": "False", "link_id": "t3_ng80jz", "parent_id": "t3_ng80jz", "score": "1", "subreddit": "Korean", "subreddit_id": "t5_2rd8q"}, {"author": "evelyn6073", "body": "Haha yeah it’s weird but it’s a lie we all keep. The students speak English pretty well so there’s no need for Korean. I do sometimes wonder if they think I’m stupid since I have to confirm that I have lived here for two years and don’t know how to say ‘hello’ lol.", "created_utc": "1621217257.0", "edited": "False", "id": "gye9dm1", "is_submitter": "False", "link_id": "t3_ndma54", "parent_id": "t1_gyd4z6d", "score": "4", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "evelyn6073", "body": "I also live in Korea, but I speak Korean so people are usually relieved when I approach them in korean lol. Honestly my method is always go in strong with Korean— I go into the phone store and I’m like (in korean) ‘hello I have this problem can you help me?’ or into the restaurant like ‘hello we are 4 people to eat in’. Like I don’t ever speak English to them, and I don’t really give people a chance to switch to English haha. It might be hard as a beginner, but I think you should just only speak Korean to them! Most will go to the easiest, and if you’re trying to speak Korean then they will go to it lol. \n\nWhen I first came here I would go to the same coffee shop and order from the same part timer, the poor kid haha. He heard me trying like 100 different ways to express what I wanted and I would check his reactions to see which was most correct haha. You’re right that you gotta use it! Just make an intentional effort everyday like ‘I’m going to give the taxi driver directions in Korean’ or ‘I’m going to use the new ‘have a good day’ phrase I learned’. \n\nAnd make Korean your hobby! If people are like ‘don’t do your hobby!’ That would be super weird, right? So just say ‘oh! I think learning korean is so interesting and it’s a hobby to try and keep learning more.’ I think many people will be impressed rather than ‘judge’ your enjoyment or your level. Best of luck!\n\nEdit; I’ll also add that I work at an English school where I’m not allowed to speak any Korean nor can anyone know I know it haha. So if it doesn’t seem to be something you can practice at work, you can still totally advance outside of it!", "created_utc": "1621169643.0", "edited": "False", "id": "gybirez", "is_submitter": "False", "link_id": "t3_ndma54", "parent_id": "t3_ndma54", "score": "25", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "evelyn6073", "body": "어울려요, 양화대교 (im intermediate - advanced)", "created_utc": "1620364292.0", "edited": "False", "id": "gx8oqwp", "is_submitter": "False", "link_id": "t3_n66qtr", "parent_id": "t3_n66qtr", "score": "1", "subreddit": "Korean", "subreddit_id": "t5_2rd8q"}, {"author": "evelyn6073", "body": "HTSK is best used as a resource rather than a self learning guide. I also found ttmik cringe so I never used it that heavily haha but their pdfs are good notes and their YouTube videos can be helpful! Using a variety of sources will ensure you see a lot of examples and different ways of explaining. You are doing well, good luck!", "created_utc": "1619843083.0", "edited": "False", "id": "gwibbfv", "is_submitter": "False", "link_id": "t3_n29k3l", "parent_id": "t3_n29k3l", "score": "8", "subreddit": "Korean", "subreddit_id": "t5_2rd8q"}, {"author": "evelyn6073", "body": "I’m interested~ I can speak Korean at an intermediate level but I want to practice more to reach advanced haha. DM if you want to chat!", "created_utc": "1619803254.0", "edited": "False", "id": "gwg4l0c", "is_submitter": "False", "link_id": "t3_n1o73z", "parent_id": "t3_n1o73z", "score": "2", "subreddit": "language_exchange", "subreddit_id": "t5_2tdbm"}, {"author": "evelyn6073", "body": "You can find videos subtitled in both! But I think it’s best to avoid only subtitles in English because you will be more focused on the English than actually hearing the korean lol. But I remember I would watch vloggers who put captions in both or would watch idol videos with korean subtitles first to see what I pick up, then with english to check if I was right. You can get pretty good at ‘guessing’ through context as well :)", "created_utc": "1619503696.0", "edited": "False", "id": "gw0sfzg", "is_submitter": "False", "link_id": "t3_mzbsq8", "parent_id": "t1_gw0mspd", "score": "5", "subreddit": "Korean", "subreddit_id": "t5_2rd8q"}, {"author": "evelyn6073", "body": "Studying from books and lessons is great and all but...you need to be doing more with Korean to really see your progress. This wouldn’t really count as ‘studying hours’ in my eyes— watching korean subtitled videos, talking or messaging in korean to practice, korean noraebang(lol) will all help your progress. Your free time needs to be surrounded by korean so your ear is trained and your comprehension will pick up once you start noticing what you study coming up more in more in the korean subtitled videos/dramas/vlives you watch. \nThis is just my experience, I don’t know if you do this already, but I recommend you only consume media in korean as much as possible!", "created_utc": "1619494865.0", "edited": "False", "id": "gw0g2ga", "is_submitter": "False", "link_id": "t3_mzbsq8", "parent_id": "t3_mzbsq8", "score": "27", "subreddit": "Korean", "subreddit_id": "t5_2rd8q"}, {"author": "evelyn6073", "body": "Kids.donga .com and kid.chosun. com ! Or I just just read the regular news sites like yonghap news.", "created_utc": "1619442261.0", "edited": "False", "id": "gvxbchp", "is_submitter": "False", "link_id": "t3_mw5r9s", "parent_id": "t1_gvk4kvs", "score": "2", "subreddit": "Korean", "subreddit_id": "t5_2rd8q"}, {"author": "evelyn6073", "body": "I have the same problem. I’m between intermediate and advanced and regular classes just don’t do it for me. I’m currently reading 기사 and doing a 토론 type class (in person) bc I lack advanced grammar and struggle to make complex, well thought out points still. Maybe you could ask someone to do that? I’m also looking into finding a tutor who will do a book club or something similar so I can get more used to fiction readings or dramas/movies.", "created_utc": "1619151809.0", "edited": "False", "id": "gvj4you", "is_submitter": "False", "link_id": "t3_mw5r9s", "parent_id": "t3_mw5r9s", "score": "2", "subreddit": "Korean", "subreddit_id": "t5_2rd8q"}, {"author": "evelyn6073", "body": "I’ve never studied Spanish but I want to start!", "created_utc": "1617985595.0", "edited": "False", "id": "gty315v", "is_submitter": "False", "link_id": "t3_mn469a", "parent_id": "t3_mn469a", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "evelyn6073", "body": "I did not realize ;;; was a korean thing— I use it all the time. It’s possible I just saw it a lot and started using it in English too haha", "created_utc": "1617940662.0", "edited": "False", "id": "gtw6o1a", "is_submitter": "False", "link_id": "t3_mmyw3f", "parent_id": "t3_mmyw3f", "score": "13", "subreddit": "Korean", "subreddit_id": "t5_2rd8q"}, {"author": "evelyn6073", "body": "I was just saying my experience in case others think only your experience is true lol we can both have different experiences but very interesting that yours is so different", "created_utc": "1615260590.0", "edited": "False", "id": "gqafu4y", "is_submitter": "False", "link_id": "t3_m03ply", "parent_id": "t1_gqae2jn", "score": "2", "subreddit": "Korean", "subreddit_id": "t5_2rd8q"}, {"author": "evelyn6073", "body": "I live in Korea and was always shocked at how Koreans always finish a large amount of food lol in the US we would usually take home extras almost every big meal but everyone finishes here so I had to adjust a lot 😳", "created_utc": "1615224517.0", "edited": "False", "id": "gq8cqzc", "is_submitter": "False", "link_id": "t3_m03ply", "parent_id": "t1_gq7sng2", "score": "1", "subreddit": "Korean", "subreddit_id": "t5_2rd8q"}, {"author": "evelyn6073", "body": "I found at the beginning stages having structure like a language class helped. For example: go over vocabulary terms (10-15?), read and listen to a dialogue using the vocabulary, review one or two new grammar points that came out in the dialogue, examples of grammar point used in songs, dramas, memes, etc. then the students can discuss the dialogue either by creating their own dialogue using new grammar/vocab, answer written comprehension questions, or memorize (or just practice enough to read at a good pace) and ‘perform’ the dialogue.", "created_utc": "1614775596.0", "edited": "False", "id": "gpj0oy3", "is_submitter": "False", "link_id": "t3_lwnrys", "parent_id": "t3_lwnrys", "score": "2", "subreddit": "Korean", "subreddit_id": "t5_2rd8q"}, {"author": "evelyn6073", "body": "Japanese speakers have trouble pronouncing 받침 because Japanese is consonant-vowel for the most part. So it may be you are not saying ㅇ 받침 or you pronounce 받침 like ㄷ,ㅅ,ㄱ etc incorrectly. Ask for specific feedback when you say certain words that include these and practice based on what natives say. (Example; I always struggled with 불균형 lol the ㄴ and ㅇ 받침 next to each other always mixed me up lol but u need to find ur problem area specifically", "created_utc": "1614176001.0", "edited": "False", "id": "gol0knq", "is_submitter": "False", "link_id": "t3_lr8voy", "parent_id": "t3_lr8voy", "score": "9", "subreddit": "Korean", "subreddit_id": "t5_2rd8q"}, {"author": "evelyn6073", "body": "I agree with ur friends just being used to it lol even if I ask my friends to correct they say but it’s just the way you talk! Bc for most people it doesn’t hinder understanding. I don’t get the repeats from strangers anymore after some time so I’ve obviously improved in some respect lol maybe just fluidity and intonation making it sound more natural, making it generally more understandable to ppl unused to talking to foreigners?\nBut ya get a tutor or lang exchange who is actually gonna tell u what sounds off", "created_utc": "1613739985.0", "edited": "False", "id": "go0322w", "is_submitter": "False", "link_id": "t3_lnagmr", "parent_id": "t3_lnagmr", "score": "12", "subreddit": "Korean", "subreddit_id": "t5_2rd8q"}, {"author": "evelyn6073", "body": "Hi! I’m an American (25F) living in Seoul. We could call if you are available on the weekends^^ 저는 한국어 공부하기 오랫동안 했지만 대화는 아직 어려워요 ㅎㅎ", "created_utc": "1610548545.0", "edited": "False", "id": "gj45pg1", "is_submitter": "False", "link_id": "t3_kwdmjt", "parent_id": "t3_kwdmjt", "score": "2", "subreddit": "language_exchange", "subreddit_id": "t5_2tdbm"}, {"author": "evelyn6073", "body": "Love this!", "created_utc": "1610092283.0", "edited": "False", "id": "giis2e6", "is_submitter": "False", "link_id": "t3_ksw0ed", "parent_id": "t3_ksw0ed", "score": "4", "subreddit": "52book", "subreddit_id": "t5_2s935"}, {"author": "evelyn6073", "body": "Great! Maybe I’ll do a write up soon as well, it seems like a nice way to summarize and reflect on the year. Good luck with your studies!", "created_utc": "1609416096.0", "edited": "False", "id": "ghll4g3", "is_submitter": "False", "link_id": "t3_knog7w", "parent_id": "t3_knog7w", "score": "2", "subreddit": "Korean", "subreddit_id": "t5_2rd8q"}, {"author": "evelyn6073", "body": "I’m not sure but you might want to try searching the same of the show in hangul and add 더빙. I’ve watched Korean dubbed anime that way.", "created_utc": "1608318946.0", "edited": "False", "id": "gga6jed", "is_submitter": "False", "link_id": "t3_kdry2l", "parent_id": "t1_gg30y3s", "score": "2", "subreddit": "Korean", "subreddit_id": "t5_2rd8q"}, {"author": "evelyn6073", "body": "Work in sections. Do slow 10 seconds of the choreo, record, review and try to fix ONE thing. Example: oh I didn’t bring my legs back together. Try it for the next recording. Once that is okay, choose another part to fix (arms angle, head turn, awkward hands, etc). Work slow to fix it all. Then up the speed and put it all together. Really focus on the part you are fixing, the rest should become muscle memory. It’s all about repetition!", "created_utc": "1608187081.0", "edited": "False", "id": "gg49oze", "is_submitter": "False", "link_id": "t3_keprr1", "parent_id": "t3_keprr1", "score": "3", "subreddit": "Dance", "subreddit_id": "t5_2qhs0"}, {"author": "evelyn6073", "body": "Not native but I’d guess the -지 is the grammar that means ‘become’. So ‘doesnt become filled’ is a possible translation.", "created_utc": "1607880467.0", "edited": "False", "id": "gfpudoh", "is_submitter": "False", "link_id": "t3_kcdmgc", "parent_id": "t3_kcdmgc", "score": "5", "subreddit": "Korean", "subreddit_id": "t5_2rd8q"}, {"author": "evelyn6073", "body": "I have insta for learning but now Twitter 😅 I didn’t know study Twitter was a thing! Maybe I will join one day lol", "created_utc": "1607586993.0", "edited": "False", "id": "gf9bmki", "is_submitter": "False", "link_id": "t3_ka4e4i", "parent_id": "t3_ka4e4i", "score": "1", "subreddit": "Korean", "subreddit_id": "t5_2rd8q"}, {"author": "evelyn6073", "body": "Seems average to me", "created_utc": "1607486749.0", "edited": "False", "id": "gf4unse", "is_submitter": "False", "link_id": "t3_k984bf", "parent_id": "t3_k984bf", "score": "2", "subreddit": "Korean", "subreddit_id": "t5_2rd8q"}, {"author": "evelyn6073", "body": "You inspired me haha I’ve always wanted to make one and I follow a bunch...so now I have one! I am dochiiya. I will follow you :)\n\nEdit: I’m also learning korean!", "created_utc": "1607347689.0", "edited": "1607347906.0", "id": "gextnye", "is_submitter": "False", "link_id": "t3_k8a4jh", "parent_id": "t3_k8a4jh", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "evelyn6073", "body": "I believe 싶다 here means ‘thinking’. Looking at other examples, you can use 나/ㄴ가 or 다 before it to show speculation.", "created_utc": "1607244198.0", "edited": "1607244460.0", "id": "gesu692", "is_submitter": "False", "link_id": "t3_k7pxnn", "parent_id": "t3_k7pxnn", "score": "1", "subreddit": "Korean", "subreddit_id": "t5_2rd8q"}, {"author": "evelyn6073", "body": "Maybe you are hearing 말도 안돼? It means something like ‘it can’t be true’.", "created_utc": "1607231391.0", "edited": "False", "id": "ges712v", "is_submitter": "False", "link_id": "t3_k7ngvm", "parent_id": "t3_k7ngvm", "score": "31", "subreddit": "Korean", "subreddit_id": "t5_2rd8q"}, {"author": "evelyn6073", "body": "I’ve been studying korean for 5 years or so and I live in Korea— accent is super important. My accent is good, intonation is good, but there are still instances where I need to repeat myself for old guy taxi drivers lol they are not used to hearing a different way of korean being spoken (I still have an accent when I say ㄹ and I don’t do ㅊ strong enough so it is not perfect). I’d say don’t worry about it too much now if you are not able to make your own sentences yet, but it’s something you should practice so you can improve over time. 1. Read EVERYTHING aloud. 2. Listen listen listen. And repeat back. Echoing may help you if you don’t have someone to check your pronunciation.", "created_utc": "1607229505.0", "edited": "False", "id": "ges36jc", "is_submitter": "False", "link_id": "t3_k7ha82", "parent_id": "t3_k7ha82", "score": "6", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "evelyn6073", "body": "Learn the infinitive. When you learn grammar you will need to know the dictionary form in order to conjugate correctly.", "created_utc": "1607053731.0", "edited": "False", "id": "gek7430", "is_submitter": "False", "link_id": "t3_k61t8p", "parent_id": "t3_k61t8p", "score": "0", "subreddit": "Korean", "subreddit_id": "t5_2rd8q"}, {"author": "evelyn6073", "body": "I have been yelled at my many old men when they realize I’m not fluent because my accent isn’t what they expect (in Korea). I have begun answering all phone calls with an obvious accent and introducing myself as a foreigner when I go places lol. I think the key is understandable accent so communication is easy VS spending unreasonable amounts of time improving native accent rathe than working on communication skills or other aspects of the language. But it may be different for other languages or places.", "created_utc": "1607053595.0", "edited": "False", "id": "gek6w98", "is_submitter": "False", "link_id": "t3_k68xft", "parent_id": "t1_gejx0zq", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "evelyn6073", "body": "Hello, I’d love to chat and practice! 안녕하세요^^", "created_utc": "1606751364.0", "edited": "False", "id": "ge5npdo", "is_submitter": "False", "link_id": "t3_k3xgmf", "parent_id": "t3_k3xgmf", "score": "1", "subreddit": "language_exchange", "subreddit_id": "t5_2tdbm"}, {"author": "evelyn6073", "body": "I have boox ereader and downloaded the yes24 book app. You can buy ebooks on the website (also maybe app, not sure).", "created_utc": "1606561649.0", "edited": "False", "id": "gduwi23", "is_submitter": "False", "link_id": "t3_k2j80r", "parent_id": "t3_k2j80r", "score": "1", "subreddit": "ebooks", "subreddit_id": "t5_2qqfh"}, {"author": "evelyn6073", "body": "I agree it depends on what you consider conversational lol I’ve been studying for 5 years and recently became more comfortable talking about most topics (not super advanced topics though). I think after year 2 (korean uni classes and talking with korean friends) I was able to get through daily convos with korean. Year 1 left me with basic phrases and vocabulary to regurgitate but I wouldn’t have called it conversation even if it was a back and forth with someone about their weekend and my weekend. Year 1 topics: job, school, hobbies, self introduction. If that is your goal then it is totally possible.", "created_utc": "1606449032.0", "edited": "False", "id": "gdqdxro", "is_submitter": "False", "link_id": "t3_k1phqd", "parent_id": "t3_k1phqd", "score": "2", "subreddit": "Korean", "subreddit_id": "t5_2rd8q"}, {"author": "evelyn6073", "body": "Thank you! I work at a 학원 so I hear that word but wasn’t sure if the difference.", "created_utc": "1606313842.0", "edited": "False", "id": "gdjzky4", "is_submitter": "False", "link_id": "t3_k0lzgs", "parent_id": "t1_gdjzbc8", "score": "2", "subreddit": "Korean", "subreddit_id": "t5_2rd8q"}, {"author": "evelyn6073", "body": "What about 강사? Is it the same as 교사?", "created_utc": "1606313383.0", "edited": "False", "id": "gdjyufc", "is_submitter": "False", "link_id": "t3_k0lzgs", "parent_id": "t1_gdiywjg", "score": "1", "subreddit": "Korean", "subreddit_id": "t5_2rd8q"}, {"author": "evelyn6073", "body": "I live in Seoul and I felt the same way for the first 6 months (despite having studied Korean for 3 years before coming) since I am only allowed to speak English at work and my friend group was comprised only of my coworkers (all other foreigners) I didn't get much practice outside of Taxi drivers lol.\n\nPeople complain that it is hard especially in Seoul bc everyone speaks English but like...that is not my experience. IMO people will always rather speak Korean (unless you go to things like language meetings which I do not). I always go into cafes, restaurants, pharmacies, clothing stores, literally anywhere and start the conversation in korean. If people greet me in English I push on in Korean to communicate whatever I need. They always switch to Korean (usually gratefully lol). You just gotta be confident. \n\nIt also helped that I take on the role of 'mom' in the group and make it a point to order food for the table, ask questions for my friends, etc. I do that because my friends don't know Korean, but even if I'm with a Korean friend I try to do that (especially since then the native can step in if something is not getting communicated lol). You have to make the opportunities.\n\nI also have used apps to make friends that will speak to me in Korean (better if they don't want to learn English lol). I watch Netflix, read korean books (slowly), and watch youtube vlogs/content I'm interested in by korean YouTubers. Self immerse! It is hard and not always fun or easy but it really has helped. I also got a tutor who will listen to me stumble over a thought for 10 seconds, help me say it, and let me repeat before moving the convo on. It has helped a lot to speak without any real consequences lol.", "created_utc": "1605443201.0", "edited": "1605443669.0", "id": "gcdt3np", "is_submitter": "False", "link_id": "t3_judyg5", "parent_id": "t3_judyg5", "score": "9", "subreddit": "Korean", "subreddit_id": "t5_2rd8q"}, {"author": "evelyn6073", "body": "Native English speaker (and teacher!)\nDDCB DBDC ADBC CCAD ADCA BD\nLet me know if you are confused :)", "created_utc": "1604858697.0", "edited": "False", "id": "gbmufzt", "is_submitter": "False", "link_id": "t3_jqg1al", "parent_id": "t3_jqg1al", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "evelyn6073", "body": "You could read translations of classic lit in korean if you are interested in that. I see korean students reading those books for school often.", "created_utc": "1604413212.0", "edited": "False", "id": "gb08a4x", "is_submitter": "False", "link_id": "t3_jnamgd", "parent_id": "t3_jnamgd", "score": "1", "subreddit": "Korean", "subreddit_id": "t5_2rd8q"}, {"author": "evelyn6073", "body": "반 is class so it’s like saying korean class 1, 2, etc.", "created_utc": "1604202690.0", "edited": "False", "id": "garfeug", "is_submitter": "False", "link_id": "t3_jkxygt", "parent_id": "t1_gaqpca1", "score": "1", "subreddit": "Korean", "subreddit_id": "t5_2rd8q"}, {"author": "evelyn6073", "body": "주시다 and 드리다 are different. I believe since you are not the person giving help to a higher person you wouldn’t use 드리다. I could be wrong but that’s how I understand it.", "created_utc": "1604202645.0", "edited": "False", "id": "garfcnf", "is_submitter": "False", "link_id": "t3_jkxygt", "parent_id": "t1_gaprlhk", "score": "1", "subreddit": "Korean", "subreddit_id": "t5_2rd8q"}, {"author": "evelyn6073", "body": "You right lol", "created_utc": "1604202238.0", "edited": "False", "id": "garetfu", "is_submitter": "False", "link_id": "t3_jkxygt", "parent_id": "t1_gap6t1m", "score": "1", "subreddit": "Korean", "subreddit_id": "t5_2rd8q"}, {"author": "evelyn6073", "body": "13. Double negative kind of ‘didn’t not know’ delete 안. 14. I would call it 사반, 삼반 but idk lol. 드세요 is eat. 들으세요 is correct. 18. Order seems off.", "created_utc": "1604076137.0", "edited": "False", "id": "gam5n4d", "is_submitter": "False", "link_id": "t3_jkxygt", "parent_id": "t3_jkxygt", "score": "1", "subreddit": "Korean", "subreddit_id": "t5_2rd8q"}, {"author": "evelyn6073", "body": "Fellow learner, just some notes to help you get on track. 1. -고 means ‘and’. If you don’t say anything after that it is weird. So just make 만나다 in the correct tense :). 2. Make sure you add location particles to places.  3. 재미없게 is acting as an adverb to describe how you watched, but you want it to be an adjective for movie. I would say 어제 본 영화를 재미없었어요. 6. 주세요 is a command not a question so the question mark is weird? I think lol. 7. Order 8. I think the order is good. 9. Very awkward. Questions end in ‘ㅂ니까?’ I would say 저기요 질문 물어봐도 돼요? But usually I’d just ask the question lol. 10. We can say 제 (저의) but 우리 엄마 is better. 돈을 보내 주셨어요 12. 입으세요 .", "created_utc": "1604075809.0", "edited": "False", "id": "gam4yy4", "is_submitter": "False", "link_id": "t3_jkxygt", "parent_id": "t3_jkxygt", "score": "2", "subreddit": "Korean", "subreddit_id": "t5_2rd8q"}, {"author": "evelyn6073", "body": "Good job! You have a feel of the moves and you do the foot work well. I think if you memorized and got more comfortable with the moves it would look better. I think you can practice extending your arms and putting more energy once you have the dance down to like muscle memory. Great job, it’s a hard dance!", "created_utc": "1602391689.0", "edited": "False", "id": "g8fma6a", "is_submitter": "False", "link_id": "t3_j8xyw2", "parent_id": "t3_j8xyw2", "score": "1", "subreddit": "Dance", "subreddit_id": "t5_2qhs0"}, {"author": "evelyn6073", "body": "For me it was TV shows (youtube and variety) first then like blogs and memoir or YA books. The spoken korean used in the videos I watched had a lot of the same words (especially if you watch the same subject) and general grammar points. I was always better at reading/writing while studying Korean in uni until recently when I started watching vlogs and shows passively and my listening improved very quickly.\nI'm not able to read fiction/fantasy novels or watch movies without subtitles due to the vocabulary though. So still lacking comprehension on both parts haha. I would have more confidence hearing something and understanding than just reading to understand it.", "created_utc": "1599586393.0", "edited": "False", "id": "g4gkxr0", "is_submitter": "False", "link_id": "t3_ijsod1", "parent_id": "t3_ijsod1", "score": "2", "subreddit": "Korean", "subreddit_id": "t5_2rd8q"}, {"author": "evelyn6073", "body": "https://imgur.com/53RnSfK\nhere's mine! it's pretty similar to my writing in English imo lol", "created_utc": "1596887570.0", "edited": "False", "id": "g0s58oq", "is_submitter": "False", "link_id": "t3_i5ihpm", "parent_id": "t3_i5ihpm", "score": "1", "subreddit": "Korean", "subreddit_id": "t5_2rd8q"}, {"author": "evelyn6073", "body": "Hi I live in Gangnam too (24F) and would be interested in language exchange! Feel free to DM. I’m about an intermediate speaker :)", "created_utc": "1579696721.0", "edited": "False", "id": "ff8up4v", "is_submitter": "False", "link_id": "t3_erpuwi", "parent_id": "t3_erpuwi", "score": "1", "subreddit": "Korean", "subreddit_id": "t5_2rd8q"}, {"author": "evelyn6073", "body": "yes That’s a great place to start. :)", "created_utc": "1579696598.0", "edited": "False", "id": "ff8ukn7", "is_submitter": "False", "link_id": "t3_ersagn", "parent_id": "t1_ff6z5d2", "score": "1", "subreddit": "SkincareAddiction", "subreddit_id": "t5_2tbbg"}, {"author": "evelyn6073", "body": "Weekly (or like me every other night lol) AHA/BHA will help a lot. Also make sure you use SPF every day and wash your face at night! \nRealistically, a light fraxel laser will have faster results but the above definitely helped me before I could afford the good stuff.", "created_utc": "1579630014.0", "edited": "False", "id": "ff6lxq0", "is_submitter": "False", "link_id": "t3_ersagn", "parent_id": "t3_ersagn", "score": "2", "subreddit": "SkincareAddiction", "subreddit_id": "t5_2tbbg"}]