[{"author": "EventuallyPerplexed", "body": "That's [the correct pronuniciation in Standard American English](https://dictionary.cambridge.org/pronunciation/english/pistachio), not sure why you think it comes from Sicilian? In Italian the word is \"pistacchio\" and the \"chi\" sound there has a hard c, while the \"ci\" in \"siciliano\" is a soft c, so your example doesn't apply imho.\n\nIt's probably just that English got the word from the French \"[pistache](https://en.wiktionary.org/wiki/pistache)\".", "created_utc": "1665651431.0", "edited": "False", "id": "is4skuy", "is_submitter": "False", "link_id": "t3_y2dao9", "parent_id": "t3_y2dao9", "score": "2", "subreddit": "italianlearning", "subreddit_id": "t5_2tuxf"}, {"author": "EventuallyPerplexed", "body": "As far as I know, Spanish is usually considered the easiest among the tree because of its regular grammar and pronunciation, while French is considered the most complex.\n\nI think that Spanish is more regular than Italian in both grammar and pronunciation, but for a foreigner that doesn't speak any of the two the difference might be really minimal. Maybe the real advantage is that being a more international language, Spanish has way more content accessible for learners all over the world.\n\nHowever, if this \"somone who doesn't speak any other Romance language\" is an English speaker, they might want to take into consideration that French is the romance language with the highest lexical similarity with English.", "created_utc": "1660905501.0", "edited": "False", "id": "ikx0fj8", "is_submitter": "False", "link_id": "t3_wrl00n", "parent_id": "t3_wrl00n", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "EventuallyPerplexed", "body": "I think it's important to understand what is not working for you in your own current method and the study routine that you follow, but you aren't sharing enough information for that imho.\n\nYou say you've been learning with a tutor, but what do you mean? How many times per week have you been studying with them? Are you following a structured program or is your tutor just a support you have to ask questions and most of your study is by self learning?\n\nIf as an example you study with your tutor only once a week, then even after 3 years it's not that much study hours.\n\nFor me, joining a structured class (online, small group of people with native teacher) has been very useful because it  helped me have structure and forced me to commit to the progression of the class. When I was studying by myself with a tutor it was too easy to postpone our lessons because I was too tired or I had conflicts with my job: I can't do this with a regular class, so I have to keep up with the program of the class. \n\nYou need to find out what's blocking you. Is it that you don't invest enough time? That you invest time only occasionally? (you normally get better results by studying for 30 minutes every day than from studying 4 hours on a Sunday) That the tools you are using aren't good enough? (e.g. certain apps are fun and give you satisfaction as a beginner, but at a certain point you can use the time you spend on them in a way that brings results more efficiently) Do the textbooks you use provide you with enough practice for your needs? Are you using content which is suitable for your level and provides you with the right level of \"challenge\", or is it too difficult (frustrating) / too easy (doesn't make you improve)?", "created_utc": "1660903366.0", "edited": "False", "id": "ikwxgjj", "is_submitter": "False", "link_id": "t3_ws94uu", "parent_id": "t3_ws94uu", "score": "10", "subreddit": "ChineseLanguage", "subreddit_id": "t5_2qyz1"}, {"author": "EventuallyPerplexed", "body": "1) Burro:\nIn Italian it means butter, in Spanish it means donkey.\n\nThis is probably the only one I would call amusing because the other ones in my list are just annoying imho XD\n\n2) Aceite in Spanish means oil, and in Italian it is called olio. Aceto in Italian means vinegar :D\n\n3) Caldo in Italian means hot, not cold. It can also be very confusing when Germans say Kalt.\n\n4) Libreria in Italian is a bookshop, a library is called a biblioteca. Italians will confuse them a lot when speaking English.\n\n5) Same with factory, which gets wrongly used as the word for fattoria (farm)\n\n6) Salir \nIn Italian it is a contraction of salire and it means \"to go up\" (the stairs, a floor). In Spanish it means\" to go out\" (in Italian that would be uscire).\n\"To go up\" in Spanish would be subir, but in Italian the verb subire has only the meaning of undergo/suffer/endure.\n\n7) In French the verb \"fermer\" is used to say that a place is closed. In Italian \"fermare\" is used to say you're stopping something.\n\n8) In Italian pistacchi means pistachioes, in Genoese pistacci means peanuts", "created_utc": "1659042795.0", "edited": "False", "id": "ii1juay", "is_submitter": "False", "link_id": "t3_wa5c1m", "parent_id": "t3_wa5c1m", "score": "8", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "EventuallyPerplexed", "body": "I got Sango. \n\nWhile it's the first time I hear about it and I really doubt I will ever have many chances to use it...It's a tonal creole language, and since I don't speak any African language and the only tonal language I know (\"know\"...I'm working on it... XD) is Mandarin, I think it could be the gateway to more languages and better understanding of African and tonal languages in general, so... intant fluency!", "created_utc": "1658487407.0", "edited": "False", "id": "ih69gwg", "is_submitter": "False", "link_id": "t3_w4fzz4", "parent_id": "t3_w4fzz4", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "EventuallyPerplexed", "body": "in Mandarin Chinese there are words which are written and pronounced in the same way, but have different meanings depending on context, such as:\n\n* 十分 *shífēn* can mean both \"10 minutes\" or \"extremely\"\n* 提醒 *tíxǐng* can mean both “warn” and “remind”\n* 常识 *chángshí* mean both “general knowledge” and “common sense”\n* 精神 *jīngshén* can mean both “spirit”/“spiritual” and “mind”/”psyche” or “mental”/“psychological”\n\nThen you have words that are written in a different way but are pronounced in the same way, such as\n\n* *quánlì* that when written 权利 means “power\" in the sense of \"right, privilege” while when written as 权力 means “power\" in the sense of \"authority”\n* 手势, 首饰, 守势 are all pronounced shǒushì but they mean respectively “gesture, signal”,  “jewellery”, “defensive position”\n* 喜剧 and 洗具 are both pronounced *xǐjù* and mean respectively \"comedy\" and \"washing tool\"\n\nAnd then you have words that differ for their tones, such as\n\n眼睛 *yǎnjīng* = eyes  \n眼镜 *yǎnjìng* = glasses", "created_utc": "1657707333.0", "edited": "1657876084.0", "id": "ifz22jr", "is_submitter": "False", "link_id": "t3_vxja15", "parent_id": "t3_vxja15", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "EventuallyPerplexed", "body": "As others have said, it doesn't work because you need to use a possessive adjective (as you do in English) \n\nHere are some examples https://grammar.collinsdictionary.com/french-easy-learning/what-are-the-possessive-adjectives-in-french", "created_utc": "1657695105.0", "edited": "False", "id": "ifyn2ne", "is_submitter": "False", "link_id": "t3_vxrtcl", "parent_id": "t3_vxrtcl", "score": "3", "subreddit": "learnfrench", "subreddit_id": "t5_2sucz"}, {"author": "EventuallyPerplexed", "body": "If you can spend around 10€ per month, I found [https://www.semantica-portuguese.com/](https://www.semantica-portuguese.com/) a really nice place to start. They teach the language via a series of novelas they recorded specifically for learners of Brazilian Portuguese.", "created_utc": "1656598818.0", "edited": "False", "id": "iebkv49", "is_submitter": "False", "link_id": "t3_vo78f5", "parent_id": "t3_vo78f5", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "EventuallyPerplexed", "body": "A dedicated Italian speaker who isn't necessarily particularly good at learning languages can reach a B2 level in Spanish in six months starting from scratch. Even less if they are fully immersed. \n\nA child doesn't learn a language at that level of proficiency that quickly.\n\nAs adults we already know another language, we already know how languages (at least the languages close to our own) \"work\", so we can exploit that knowledge to speed up the learning process. \n\nBtw, imho in general language learning process is not necessarily \"by translation\": a lot is usually achieved \"by inference\".", "created_utc": "1656584407.0", "edited": "False", "id": "ieaulek", "is_submitter": "False", "link_id": "t3_vnm4yz", "parent_id": "t3_vnm4yz", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "EventuallyPerplexed", "body": "If I were you I would force myself to talk with your fiancé in Spanish as much as possible.\n\nI would also suggest to start consuming content in the language, but adequate to your level (podcasts for learners, graded readers).\n\nConsider getting a proper textbook to study to clarify grammar topics, exercise, and maybe investing in tutoring hours on platforms like italki or preply.\n\nHaving a Spanish peaker in your life is great for conversation, but the guidance from a proper teacher can boost your learning and direct you to resources and learning methods better suited for you.", "created_utc": "1656582127.0", "edited": "1656660560.0", "id": "iearr6s", "is_submitter": "False", "link_id": "t3_vnyuny", "parent_id": "t3_vnyuny", "score": "8", "subreddit": "duolingo", "subreddit_id": "t5_2t6ze"}, {"author": "EventuallyPerplexed", "body": "Have you thought about trying with flashcards as people do when learning vocabulary in a new language?\n\nAs an example you could create your own deck in Anki, add the words with their definition as you encounter them, and test yourself on their definitions. This way you should be able to retain them in the long run even if you don't encounter them often in other material.", "created_utc": "1656580745.0", "edited": "False", "id": "ieaq45b", "is_submitter": "False", "link_id": "t3_vo3s9k", "parent_id": "t3_vo3s9k", "score": "11", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "EventuallyPerplexed", "body": "Another user already suggested [italki.com](https://italki.com), you can also find native brazilian portuguese teachers on [preply.com](https://preply.com) .", "created_utc": "1656578274.0", "edited": "False", "id": "iean7dn", "is_submitter": "False", "link_id": "t3_vnz1k5", "parent_id": "t3_vnz1k5", "score": "2", "subreddit": "Portuguese", "subreddit_id": "t5_2sqn7"}, {"author": "EventuallyPerplexed", "body": "It just says \"HSK 4\" on top and the score you achieved on the HSKK Intermediate is added below the scores for the HSK 4 sections, listed as \"speaking\".\n\nSo basically you have:\n\n\\- a grid showing the scores for the listening, reading, writing sections of the HSK4, the total score you got on the HSK4 and the passing score.  \n\\- a grid showing the score you got in the HSKK Intermediate listed as \"speaking\", with the passing score for that part.", "created_utc": "1655800516.0", "edited": "False", "id": "id5sg8e", "is_submitter": "False", "link_id": "t3_v7brde", "parent_id": "t1_icl2y3j", "score": "1", "subreddit": "ChineseLanguage", "subreddit_id": "t5_2qyz1"}, {"author": "EventuallyPerplexed", "body": "You get separate results with separate scoring, but the certificate is a single one that shows both (took HSK4 and HSKK Intermediate in April)", "created_utc": "1655303258.0", "edited": "False", "id": "icgiu4a", "is_submitter": "False", "link_id": "t3_v7brde", "parent_id": "t1_ibo6tzv", "score": "1", "subreddit": "ChineseLanguage", "subreddit_id": "t5_2qyz1"}, {"author": "EventuallyPerplexed", "body": "あかい and しろい are adjectives (i-adjectives, there's another class of adjectives called na-adjectives), while あか  and しろ are nouns.\n\nSo you will use  あか when you are referring to the color red, but you will say あかいりんご to refer to a red apple.", "created_utc": "1655224335.0", "edited": "False", "id": "icch9ii", "is_submitter": "False", "link_id": "t3_vc7aj7", "parent_id": "t3_vc7aj7", "score": "3", "subreddit": "LearnJapanese", "subreddit_id": "t5_2qyls"}, {"author": "EventuallyPerplexed", "body": "I think context is needed here, because I can think both of situations where this would be a terrible thing to do, and others where it could make sense (but in both cases imho it has to do with management problems).\n\nIs someone here forcing the use of English because they're afraid their employees will speak badly about them behind their backs? They will do it in English too when you're not listening... maybe ask yourself why your employees are doing that and if it has something to do with your management...\n\nIs this a place with many people of different backgrounds, speaking many different languages, and people have started dividing themselves into groups? Using English as a lingua franca can help communication between everyone, but the fact that people split into smaller groups could be a sign that they are looking for belonging, which management is obviously not able to foster. I don't think in that case prohibition is a good solution.", "created_utc": "1655115401.0", "edited": "False", "id": "ic6rlbu", "is_submitter": "False", "link_id": "t3_vazfxg", "parent_id": "t3_vazfxg", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "EventuallyPerplexed", "body": "From Italki's website:\n\n\"Popular payment methods such as Credit Card, Paypal, Skrill, Apple Pay, UnionPay, Alipay are available.\"", "created_utc": "1654196888.0", "edited": "False", "id": "iay2d91", "is_submitter": "False", "link_id": "t3_v30o3j", "parent_id": "t3_v30o3j", "score": "2", "subreddit": "ChineseLanguage", "subreddit_id": "t5_2qyz1"}, {"author": "EventuallyPerplexed", "body": "Good to know, I had no idea they existed!", "created_utc": "1653244226.0", "edited": "False", "id": "i9lc6ee", "is_submitter": "False", "link_id": "t3_uvdj6y", "parent_id": "t1_i9kzn61", "score": "3", "subreddit": "duolingo", "subreddit_id": "t5_2t6ze"}, {"author": "EventuallyPerplexed", "body": "HSK1-6 are going to stay the same this year, they're only adding the single exam for 7-9. Some sources say they will change in 2024. (I think they will have to at least release updated preparation books before starting to test people on the new format).\n\nRemeber that starting from this year, if you take HSK4 you have to take HSKK Intermediate at the same time, while if you take HSK5 you have to take HSKK Advanced. It's part of the transition process to the new format.", "created_utc": "1653058241.0", "edited": "False", "id": "i9c3grh", "is_submitter": "False", "link_id": "t3_uslw11", "parent_id": "t3_uslw11", "score": "1", "subreddit": "ChineseLanguage", "subreddit_id": "t5_2qyz1"}, {"author": "EventuallyPerplexed", "body": "I think the website came first. Its revenue stream at the time came from a crowdsourced translation service: as a user you could test yourself translating parts of texts and others could correct them.", "created_utc": "1653027793.0", "edited": "False", "id": "i9aq9ir", "is_submitter": "False", "link_id": "t3_ut3yoe", "parent_id": "t1_i988ihq", "score": "3", "subreddit": "duolingo", "subreddit_id": "t5_2t6ze"}, {"author": "EventuallyPerplexed", "body": "I usually use Duolingo in English because the trees seem to be more developed and have more content. You should imho check if this is the same for German.", "created_utc": "1652100943.0", "edited": "False", "id": "i7wwuzi", "is_submitter": "False", "link_id": "t3_ulq05u", "parent_id": "t3_ulq05u", "score": "4", "subreddit": "duolingo", "subreddit_id": "t5_2t6ze"}, {"author": "EventuallyPerplexed", "body": "On Netflix I've watched these series:\n- The forest\n- Black spot\n- Ganglands\n- Sakho & Mangane\n- Le chalet\n- Into the night\n- La mante\n\nAnd these films:\n- He Even Has Your Eyes\n- The Brand New Testament\n\n(Some are French, some Belgian, one series is from Senegal)", "created_utc": "1652041534.0", "edited": "False", "id": "i7u6cyu", "is_submitter": "False", "link_id": "t3_uku6e9", "parent_id": "t3_uku6e9", "score": "1", "subreddit": "French", "subreddit_id": "t5_2rd5t"}, {"author": "EventuallyPerplexed", "body": "In Italian we have the same expression: \"battere il ferro finché è caldo\"", "created_utc": "1651993622.0", "edited": "False", "id": "i7rsryv", "is_submitter": "False", "link_id": "t3_uklp4d", "parent_id": "t3_uklp4d", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "EventuallyPerplexed", "body": "If had an interest in both and if I couldn't study both at the same time, I would focus on the one that I enjoy the most studying. \n\nI would also ask myself questions such as\n- what do I find interesting about it?\n- what do I want to do with the language?\n- what type of content am I going to consume?\n- if I had to choose one and only one to speak (and consume content in) for the rest of my life, which one would it be?\n\nSecondly, if you still can't pick one, you could also consider the \"usefulness\" of the language.\nMaybe you want to work in a field where you could work with countries that speak one of the languages? English is a lingua franca for international business, but knowing the language of the countries you work with is always appreciated, and can help you better understand the culture of the place.\nYou have friends or want to travel to places that speak the language?\n\nOthers instead could focus on the one that would be quicker for them to learn, so that they can reach independence soon and start studying an additional one.\n\nIn the end, I think it all comes down to the reason why you want to learn these languages.", "created_utc": "1651936492.0", "edited": "False", "id": "i7oon84", "is_submitter": "False", "link_id": "t3_ukbpah", "parent_id": "t3_ukbpah", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "EventuallyPerplexed", "body": "Specifically for the exam I used 新HSK速成强化教程四级. \n\nIt's good for getting accustomed with the test structure and strategies, and focuses on the the things students at this level tend to find more tricky (e g. use of certain words, structures like the 把 structure...)", "created_utc": "1651900366.0", "edited": "False", "id": "i7n897o", "is_submitter": "False", "link_id": "t3_ujw98z", "parent_id": "t3_ujw98z", "score": "2", "subreddit": "ChineseLanguage", "subreddit_id": "t5_2qyz1"}, {"author": "EventuallyPerplexed", "body": "English shares a lot of vocabulary with Romance languages through French and Latin, so it can definitely help a lot, but while some English speakers might find Spanish more accessible than German in  terms of grammar, I'm not so sure they'd find Romanian more accessible than Dutch...", "created_utc": "1651824676.0", "edited": "False", "id": "i7j3omw", "is_submitter": "False", "link_id": "t3_uiwh72", "parent_id": "t3_uiwh72", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "EventuallyPerplexed", "body": "I suppose they wouldn't understand you because the languages belong to separate families. \n\nIf you want to do some comparisons, you can look up vocabulary in different sign languages here [https://www.spreadthesign.com/](https://www.spreadthesign.com/)  \nWhile here are some resources from Stockholm University [https://teckensprakslexikon.su.se/](https://teckensprakslexikon.su.se/)", "created_utc": "1651667343.0", "edited": "False", "id": "i7a8iys", "is_submitter": "False", "link_id": "t3_ui1qgs", "parent_id": "t3_ui1qgs", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "EventuallyPerplexed", "body": "On the website of the Beijing Language and Culture University Press they have ebook versions, but the description says they can only be read on PC [https://www.blcup.com/enPList?\\_content=eBook:%20Developing%20Chinese%20advanced#001](https://www.blcup.com/enPList?_content=eBook:%20Developing%20Chinese%20advanced#001)", "created_utc": "1651495671.0", "edited": "False", "id": "i70sl5o", "is_submitter": "False", "link_id": "t3_ufmezs", "parent_id": "t3_ufmezs", "score": "1", "subreddit": "ChineseLanguage", "subreddit_id": "t5_2qyz1"}, {"author": "EventuallyPerplexed", "body": "\"Prendo giornal***e*** dagli uomini\" without an article before \"giornale\" would be wrong. You could say \"Prendo giornal***i*** dagli uomini\": the grammar is correct, but it would sound weird.", "created_utc": "1651493520.0", "edited": "False", "id": "i70os5w", "is_submitter": "False", "link_id": "t3_ugkyeq", "parent_id": "t1_i70cuca", "score": "4", "subreddit": "duolingo", "subreddit_id": "t5_2t6ze"}, {"author": "EventuallyPerplexed", "body": "Desculpe, eu queria sugerir o livro. Compartilhei o site porque contém as referências do livro.   \nNão sei onde deveria estar o código, usei o livro há muitos anos.  \nTalvez tenha sido em um cartão que eu não tenho mais. (não usei o site, apenas o livro)", "created_utc": "1651477062.0", "edited": "False", "id": "i703sv0", "is_submitter": "False", "link_id": "t3_udob1r", "parent_id": "t1_i6kw744", "score": "1", "subreddit": "Portuguese", "subreddit_id": "t5_2sqn7"}, {"author": "EventuallyPerplexed", "body": "Não é precisamente a mesma coisa, mas eu tenho esse livro http://www.eurom5.com/bem-vindos  \nÉ um manual para a \"intercompreensão\" das línguas românicas. Contém textos em 5 línguas românicas (italiano, espanhol, catalão, português, francês), divididos por nível CEFR.   \nPara cada texto, o livro compara as palavras e gramática com a das outras línguas românicas.", "created_utc": "1651139569.0", "edited": "False", "id": "i6ijhio", "is_submitter": "False", "link_id": "t3_udob1r", "parent_id": "t3_udob1r", "score": "7", "subreddit": "Portuguese", "subreddit_id": "t5_2sqn7"}]