[{"author": "Ever_ephemeral", "body": "Ahh it usually does that to me on mobile as well but it saved when i back out. It seems like yours is updated tho.", "created_utc": "1662572960.0", "edited": "False", "id": "inh8vwm", "is_submitter": "False", "link_id": "t3_x848d4", "parent_id": "t3_x848d4", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Ever_ephemeral", "body": "Hahaha I love this one! It's not extremely common but it is an interesting one", "created_utc": "1660774335.0", "edited": "False", "id": "ikptzfo", "is_submitter": "False", "link_id": "t3_wr1gcv", "parent_id": "t3_wr1gcv", "score": "3", "subreddit": "NativeTIL", "subreddit_id": "t5_6v5ak7"}, {"author": "Ever_ephemeral", "body": "Having worked the patient side of the medical field for a while, i think the most common word used is post. For example: \"there are still a lot of symptoms to be discovered when it comes to post covid syndrome\" is one i heard directly from a news article recently.", "created_utc": "1660459183.0", "edited": "False", "id": "ik845y4", "is_submitter": "False", "link_id": "t3_wnu67h", "parent_id": "t3_wnu67h", "score": "5", "subreddit": "NativeTIL", "subreddit_id": "t5_6v5ak7"}, {"author": "Ever_ephemeral", "body": "So let's take a step back and look at what sort of base we have to build on for secondary learning versus native learning. You start your native language knowing absolutely nothing. You learn from context clues and nonverbal communication around you. Your native language will take you longer to communicate properly in because you're learning it socially with no initial base.\n\nAfter you start your first secondary language, you try to imitate this process. The thing is, you already have a solid foundation to work with. You know one or more languages already, you're just adding to that foundation. \n\nThe human brain is amazing because the more languages you learn the more likely you are to streamline this process and the quicker you'll pick up your next language. \n\nAs an example (this is just what worked for me before) I'm learning Spanish now and by combining the Spanish words and sentence structure i know and substituting what I don't know with English (my native language) I can practice Spanish and receive feedback that i wouldn't have been able to if this was my native language.", "created_utc": "1657958176.0", "edited": "False", "id": "igdcbb2", "is_submitter": "False", "link_id": "t3_vzr89b", "parent_id": "t3_vzr89b", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Ever_ephemeral", "body": "The same with no, yes and to indicate you're thinking about something", "created_utc": "1657941614.0", "edited": "False", "id": "igcmhvq", "is_submitter": "False", "link_id": "t3_vzua5u", "parent_id": "t1_igc6h09", "score": "7", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Ever_ephemeral", "body": "So I've never seen it mentioned before but I really like the app Drops and I've been using it to learn many languages for years now.\n\nWhen it comes down to learning basic words and phrases I actually think this app does much better than Anki. However it should be used *with* other learning resources to better understand the vocabulary you're picking up. It is a free resource for 5 minutes every day. They also have alternate apps for kids (drops kids) and for writing in your TL or learning ASL (Scripts). They're a progressive app with frequent updates to ensure accuracy.\n\nThere is also Toucan which is a browser extension that translates random words for you to learn. \n\nAnother I like, but less so because it's expensive, is lingvist. It feels more like a cross between Anki and reading sentences.", "created_utc": "1656482760.0", "edited": "False", "id": "ie5kf0k", "is_submitter": "False", "link_id": "t3_vms3l7", "parent_id": "t3_vms3l7", "score": "7", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Ever_ephemeral", "body": "I actually get migraines with aura that are exacerbated by my POTS. According to my primary, headaches and migraines are really common in people with POTS. At this point I'm taking preventive medication to help with them. I would definitely recommend talking with your doctor or specialist about this.", "created_utc": "1636965712.0", "edited": "False", "id": "hkp6r2f", "is_submitter": "False", "link_id": "t3_qu9in6", "parent_id": "t3_qu9in6", "score": "2", "subreddit": "POTS", "subreddit_id": "t5_2saq9"}, {"author": "Ever_ephemeral", "body": "I've had 7 doctors tell me i can't get sterilized until I'm 27 with 2 kids and my husband's permission despite my feelings towards it...I've been lobbying for this for 10 years now and finally have a doctor that understands. It's rough when people think they should have more control over your body and decisions than the one who has to live with it. I hope your procedure can move on and that everything goes well. Good luck", "created_utc": "1623571060.0", "edited": "False", "id": "h1lnk7v", "is_submitter": "False", "link_id": "t3_nwzjzd", "parent_id": "t3_nwzjzd", "score": "1", "subreddit": "TwoXChromosomes", "subreddit_id": "t5_2r2jt"}, {"author": "Ever_ephemeral", "body": "Elevators. If I lay down they're fine but I can't just stop them from moving if I'm feeling bad unlike literally anything else I do. Plus there's a lot of places where I am that are only accessable via elevator and, being a delivery driver, stairs increase my delivery times but I can't take the elevator without squishing someone else's food...", "created_utc": "1569160623.0", "edited": "False", "id": "f13hvgm", "is_submitter": "False", "link_id": "t3_d5zzd9", "parent_id": "t3_d5zzd9", "score": "2", "subreddit": "POTS", "subreddit_id": "t5_2saq9"}, {"author": "Ever_ephemeral", "body": "I just had one done about 4 days ago. They tell you not to eat or drink for 12 hours before (and trust me you're going to want to follow that). They'll hook you up to an IV to hydrate you and they'll put a strap around your knees and one just above your waist. You'll probably have 9 leads attached so they can monitor your heart rate and they'll put a blood pressure cuff on you. The BP cuff likely will go off every 3 mins. They'll let you lay for about 5ish mins then tilt you almost upright. If you don't pass out within 10 mins (which I didn't...it just made my heart rate spike 37 pointz and made me kinda dizzy) then they give you some medicine that'll likely trigger the symptoms you reported feeling. The medicine portion lasts 10 mins (I only lasted 8 before passing out) and they look for large drops in blood pressure or heart rate. If you pass out the test is over and they don't do anything else other than help get the blood back to your brain. For me the test was extremely taxing and I was numb and cold for 10 mins after but they took care of that. I couldn't drive and moving any more than I had to was utterly exhausting so likely if you manage to make it through the test just plan on not doing anything for the rest of the day.\n\nSorry it's so long but I figured if I had known I wouldn't have been so stressed when I went in so I hope it helps you some.", "created_utc": "1569160021.0", "edited": "False", "id": "f13gb67", "is_submitter": "False", "link_id": "t3_d6fvjw", "parent_id": "t3_d6fvjw", "score": "1", "subreddit": "POTS", "subreddit_id": "t5_2saq9"}, {"author": "Ever_ephemeral", "body": "Regarding medical professionals, I've had similar experiences. I'm 22 and most people I talk to (professionals or otherwise) strongly believe that younger people can't have heart conditions.\nI used to live in California, which with how expensive it is you'd think they'd have good healthcare but no. I started to notice I was having issues with breathing, my heart beating too fast, chest pain, numbness and passing out. When I went into the emergency room one day with my oxygen at 50 and my heart rate at 170 they just gave me an IV and said I had too much to drink and to talk to my PCP about my \"problem\". I only drink twice a year and this had happened a lot more frequently than that.\nWhen I went in to see my PCP about it they had me walk around the clinic with my heart rate hitting a max of 167, they ordered blood work and asked me to call when I got through it. I did so and received a call that my blood work was fine, that the heart rate was a fluke and that I just needed to drink more water. After months of try to get another opinion I gave up and later ended up moving. \nAfter moving to another state I was once again sent to the ER for passing out and having an abnormally high heart rate. They gave me an IV, did an MRI and some blood work and said I looked fine but to talk to my PCP ASAP about it so I tried again. The PCP ordered blood work, an event monitor, an echocardiogram, a CT scan, a tilt table test and a neurology appointment.\nGot everything but neurology done in less than 2 months and come to find out I have a disorder known as POTS, which when left undiagnosed can create significant life problems. It can't be cured but can be managed and just knowing what to do can save me from going into cardiac arrest or getting seriously injured.\nIt's sad that the people we trust with our lives will just pass off health conditions because they don't fit within the parameters the doctors believe exist.", "created_utc": "1569153131.0", "edited": "False", "id": "f133xnp", "is_submitter": "False", "link_id": "t3_d7h01g", "parent_id": "t3_d7h01g", "score": "2", "subreddit": "TwoXChromosomes", "subreddit_id": "t5_2r2jt"}, {"author": "Ever_ephemeral", "body": "Get \"Your name\" tattooed somewhere private so you can hit in girls at the pub. It really works", "created_utc": "1561324529.0", "edited": "False", "id": "ervtc8g", "is_submitter": "False", "link_id": "t3_c4byue", "parent_id": "t3_c4byue", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}]