[{"author": "f_d_a_6", "body": "Estereótipo?", "created_utc": "1666877431.0", "edited": "False", "id": "itzivgx", "is_submitter": "False", "link_id": "t3_yep383", "parent_id": "t1_itz4an8", "score": "2", "subreddit": "portugal", "subreddit_id": "t5_2qmie"}, {"author": "f_d_a_6", "body": "Como italiano, acho bastante estranho que a língua portuguesa não tem duas palavras distintas para indicar a \"stazione\" (como a estação do metro) e a \"stagione\" (como primavera, verão, etc).\n\nSei que é a mesma coisa em espanhol também (portanto suponho que é simplesmente como as palavras são nas línguas neolatinas ocidentais), mas pronto, ainda não faz sentido para mim...", "created_utc": "1666872592.0", "edited": "False", "id": "itz979o", "is_submitter": "False", "link_id": "t3_yep383", "parent_id": "t3_yep383", "score": "6", "subreddit": "portugal", "subreddit_id": "t5_2qmie"}, {"author": "f_d_a_6", "body": "Portogallo, nello specifico Lisbona. Ci son stato per un mese nel 2018 e ho trovato la città perfetta per me, dalla bellezza architettonica al clima, passando per gli svaghi ed il cibo. Poi ho anche la fortuna di masticare abbastanza bene il portoghese europeo, lingua che trovo magnifica.\n\nPeccato solo che la situazione immobiliare al momento sia a dir poco catastrofica, penso che sia un aspetto che mi frenerà ancora per un bel po' di tempo dal potermi realisticamente trasferire.", "created_utc": "1665481030.0", "edited": "False", "id": "irvcgf3", "is_submitter": "False", "link_id": "t3_y13jze", "parent_id": "t3_y13jze", "score": "5", "subreddit": "Italia", "subreddit_id": "t5_2rbm5"}, {"author": "f_d_a_6", "body": "Porquê é que em português não há diferenças entre as palavras \"station\" (estação) e \"season\" (estação)? \n\nNa minha língua nativa, que é muito parecida ao português (italiano), as duas palavras são \"stazione\" e \"stagione\".\n\nAcho que as palavras querem dizer duas coisas demasiado diferentes para ser literalmente idênticas.", "created_utc": "1664891860.0", "edited": "False", "id": "ir0luvw", "is_submitter": "False", "link_id": "t3_xv9e4d", "parent_id": "t3_xv9e4d", "score": "1", "subreddit": "portugal", "subreddit_id": "t5_2qmie"}, {"author": "f_d_a_6", "body": "The second part sounds a lot like: \"Thank you for participating in our closed beta testing. You give us your money now, we'll give you the complete game in 6+ months\".\n\nAh man, game developers these days...", "created_utc": "1664795714.0", "edited": "False", "id": "iqvbizx", "is_submitter": "False", "link_id": "t3_xugg4t", "parent_id": "t3_xugg4t", "score": "3", "subreddit": "DakartheGame", "subreddit_id": "t5_3pkn7"}, {"author": "f_d_a_6", "body": "Here I am!\n\nDiehard fan since 2014, I own every album and know the lyrics of all her songs.\n\nI went to her concert in Rome in June and I loved it. I was surely in a quite \"rare\" category of fans, but that didn't stop me from having and amazing time and from signing all the songs she played.\n\nYou're in good company mate!", "created_utc": "1664522461.0", "edited": "False", "id": "iqh0e1x", "is_submitter": "False", "link_id": "t3_xrsxaj", "parent_id": "t3_xrsxaj", "score": "17", "subreddit": "lorde", "subreddit_id": "t5_2xpe1"}, {"author": "f_d_a_6", "body": "I'll answer about your last question:\n\nWe don't have a \"truly Italian\" expression for double stacking, we just call it for what it actually is, a double pit-stop.\n\nTherefore it would be \"pit-stop doppio\" (you can also say \"doppio pit-stop\") or \"sosta doppia (you can also say \"doppia sosta\"). Sosta is the \"most Italian\" translation of the word pit-stop, but the English expression is more directly related to F1.", "created_utc": "1664438016.0", "edited": "False", "id": "iqcblc9", "is_submitter": "False", "link_id": "t3_xqi1oh", "parent_id": "t3_xqi1oh", "score": "2", "subreddit": "Italian", "subreddit_id": "t5_2rqc6"}, {"author": "f_d_a_6", "body": "I personally don't like the idea of calling a language \"overrated\", as there might be a million reasons why people might like a specific language, and I simply wouldn't like to argue against those. But if I have to mention a \"popular\" language that I specifically don't find very appealing, I would say French, although I totally recognise its importance and I rate it as one of the most elegant languages to my ear.\n\nOn the other hand, one language that I personally find very underrated is European Portuguese. It's often considered not as melodic - and at times even harsher, almost \"rude\" - as its Brazilian counterpart, but I think it has some very \"flowy\" sounds that make it very pleasant to my ear, and even better when I speak it, as a learner. But well, I might be biased because of my immense appreciation of Portugal!", "created_utc": "1663927032.0", "edited": "False", "id": "ipkvl8f", "is_submitter": "False", "link_id": "t3_xlsooa", "parent_id": "t3_xlsooa", "score": "8", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "f_d_a_6", "body": "Hello,  \n\n\nItalian here. I can't give you a 100% correct answer - as I'm not French - but I'm sure there will be a lot of similarities as our nations are under the same geographical division in both companies.  \n\n\nLet me first tell you that the two companies and the jobs they offer are **almost** identical in everything. If you could take the logo out of their offices, their devices, etc., you wouldn't recognise one from the other during a standard work day.\n\nThis said, from what I know, there is still a very **little** difference: PwC is slightly bigger in terms of revenues and employees, but it's somewhat slower than EY in adopting the \"Tech Consulting side\" into its services. On the other hand, EY is slightly smaller, but has transitioned faster into the Tech Consulting world (the kind of consulting that companies like Accenture do, just to be clear) and I'd say it has cemented its place as the second best of the Big4 in that area, with Deloitte being first.  \n\n\nThe importance of this difference mainly depends on the service line you'll be working in. If you're interested in a tech role, keep in mind that EY could generally be slightly stronger than PwC in that area.  \n\n\nFor clients and reputation, I think there is really no big difference between the two of them. They generally both have such important clients that you can be sure of working for \"big names\" no matter the company you're in. Moreover, clients don't generally work with one service provider only: for example, you could have \\[Insert random big French company\\] working with PwC for a Strategy project and with EY for Cybersecurity operations.\n\nIt really depends a lot on the area you're in, but you can be absolutely sure that you'll work with big clients anyway.", "created_utc": "1663664208.0", "edited": "False", "id": "ip67dle", "is_submitter": "False", "link_id": "t3_xj2ha7", "parent_id": "t3_xj2ha7", "score": "2", "subreddit": "Big4", "subreddit_id": "t5_2vosp"}, {"author": "f_d_a_6", "body": "Allora spero che il tuo dialetto ti abbia aiutato con la pronuncia dei due suoni \"th\" inglesi, dato che sono probabilmente tra i più difficili da replicare per i non nativi, ahahah!\n\nHai assolutamente ragione sulla cadenza pugliese, anche se credo che quella salentina sia un po' più vicina all'italiano standard di quella del centro-nord della Puglia (province di Bari, BAT e Foggia), che è probabilmente quella che tutti hanno in mente quando pensano al \"classico\" accento pugliese.\n\nIo stesso, specialmente quando parlo con persone di altre parti d'Italia, me ne vergogno un po' (perché penso sia tra gli accenti più \"duri\" e \"grezzi\" d'Italia) e cerco di standardizzarla il più possibile, a costo di sembrare anche molto poco naturale nei confronti delle persone della mia stessa zona. Per quanto mi alleni, però, c'è da dire che continuo ugualmente a sbagliare 2 accenti su 3 per le vocali e ed o. Chiudo dove dovrebbero essere aperti, e apro dove dovrebbero essere chiusi, un classico dei pugliesi, ahahah!", "created_utc": "1662533835.0", "edited": "False", "id": "inf5o3k", "is_submitter": "False", "link_id": "t3_x6db2u", "parent_id": "t1_inc0z73", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "f_d_a_6", "body": "Beh, lì penso sia una questione di pura e semplice inclinazione ed interessi personali.\n\nFatto sta che, per un appassionato di linguistica, non c'è dubbio che la zona friulana sia tra le più interessanti d'Italia, soprattutto (almeno per quel che mi riguarda) per la fonetica. Quindi posso capire benissimo la curiosità dello zio, ahahah! :)", "created_utc": "1662475672.0", "edited": "False", "id": "inbiv8u", "is_submitter": "False", "link_id": "t3_x6db2u", "parent_id": "t1_inb8izb", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "f_d_a_6", "body": "Ma figurati! :)\n\nTrovo sempre molto interessanti queste tematiche linguistiche relative a zone linguisticamente molto variegate (come il FVG), soprattutto considerando che non è affatto facile trovare persone che abbiano conoscenze a riguardo.", "created_utc": "1662466084.0", "edited": "False", "id": "inaygtw", "is_submitter": "False", "link_id": "t3_x6db2u", "parent_id": "t1_inatlm5", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "f_d_a_6", "body": "Sono in tutt'altro ambito (Strategy & Consulting), ma in ormai in anno di Accenture posso dirti di non aver mai visto uno straordinario (non che ne abbia fatti tantissimi) pagato. Al tempo stesso però, grazie anche alla flessibilità del lavoro da remoto, non ho mai dovuto richiedere permessi nelle occasioni in cui ho avuto bisogno di un po' di tempo (fino ad un paio d'ore) in orario lavorativo per motivi personali. Si può dire che le due cose finiscono per compensarsi.\n\nPer quel che riguarda il lato tecnico relativo alla posizione, lascio la parola a qualcuno che ne sappia più di me in materia.", "created_utc": "1662461377.0", "edited": "False", "id": "inaqw5i", "is_submitter": "False", "link_id": "t3_x76yyz", "parent_id": "t3_x76yyz", "score": "7", "subreddit": "ItaliaCareerAdvice", "subreddit_id": "t5_4d8k5g"}, {"author": "f_d_a_6", "body": "Wow, thank you for your explanation, it was really detailed! \n\nIt's really fascinating to see how dialects can differ a lot even among very close places based on the sociopolitical status and how even inside the same province two quite far \"idioms\" can coexist.\n\nBut well, let's say that FVG is probably a linguistic dream (or nightmare, it depends on the point of view, haha) with this, while we don't get the same kind of diversity in many other Italian regions. It's definitely very interesting!", "created_utc": "1662458776.0", "edited": "False", "id": "inanegh", "is_submitter": "False", "link_id": "t3_x6db2u", "parent_id": "t1_inalu6g", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "f_d_a_6", "body": "I think it's something that dates back to many decades ago, when the nationwide teaching of Italian as national language had just begun.\n\nAt that time there was a dualism between what was the natural language for almost everyone (local dialect) and what was academically \"imposed\" as a neutral language for the whole nation to speak (Italian).\n\nWith a process like this taking place, it was only natural that in formal circumstances (especially in those where there are speakers from many different parts of the nation) only Italian would become acceptable.", "created_utc": "1662447641.0", "edited": "False", "id": "inaa5mg", "is_submitter": "False", "link_id": "t3_x6db2u", "parent_id": "t1_in8pj65", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "f_d_a_6", "body": "That's definitely interesting! How come you have more fluency in the dialect of another region than in the one of your own town? Have you been more exposed to veneto than to the friulano of Aviano? Doesn't it feel \"unnatural\" to speak veneto instead of friulano of Aviano as dialect in your own town? \n\nAnd yes, it's exactly the same here with the pride of throwing dialect into Italian.", "created_utc": "1662446979.0", "edited": "False", "id": "ina9b05", "is_submitter": "False", "link_id": "t3_x6db2u", "parent_id": "t1_in8ee7w", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "f_d_a_6", "body": "I'm from Bari, and the situation is quite different here.\n\nBasically everyone understands the local dialect, no matter the age. With speaking, things become slightly different, but I feel like a good portion of the population is still able to speak full dialect or a slighly \"diluted\" - but still very realistic - dialect.\n\nI'd say a good 70 % of the people I (26M, with full tertiary education) know are able to speak very good dialect, with percentages becomimg higher the older people I take into account.\n\nThe really curious thing, though, is how dialect is used among the different groups of people: while, on the one hand, older people (60+ years old) are just used to communicating in dialect (for informal situations only, obviously) about everything, people around my same age only ever do that as a joke, like purposely wanting to look \"uneducated\" (it comes without saying that we *generally* assume that Italian is the language of the \"educated\"). While older people would find absolutely normal to just chat about everyday things in dialect, people of my same age would very rarely do that, but we can definitely speak it, and we use it very often in the aforementioned situations.", "created_utc": "1662409062.0", "edited": "False", "id": "in86hyr", "is_submitter": "False", "link_id": "t3_x6db2u", "parent_id": "t1_in6al5x", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "f_d_a_6", "body": "What I'd do to have a reboot of the series on the current gen consoles. I love Forza Horizon and I regularly play it, but the PGR series was simply on a whole different level.", "created_utc": "1661539283.0", "edited": "False", "id": "ilwjx79", "is_submitter": "False", "link_id": "t3_wy54p3", "parent_id": "t3_wy54p3", "score": "2", "subreddit": "xbox", "subreddit_id": "t5_2qoih"}, {"author": "f_d_a_6", "body": "Businesses in the IT area/tertiary sector in Italy usually close for at least two full weeks in August, specifically the central weeks around the religious festivity of the 15th.\n\nIn areas like IT/Business Consulting (which is where I work) this period could last even more, as many clients of consulting firms just fully avoid signing contracts that require work in August, as they know it's a less productive month given the (at least) two weeks of closure. In my specific case, for example, I'll only restart working on the 29th of August after having finished on the 29th of July.\n\nNeedless to say that there are many other kinds of businesses where this approach just couldn't work, and they're required to be open even when they don't have a lot of work to do.", "created_utc": "1661346903.0", "edited": "False", "id": "ill9crr", "is_submitter": "False", "link_id": "t3_wwhd51", "parent_id": "t3_wwhd51", "score": "1", "subreddit": "AskEurope", "subreddit_id": "t5_2uayg"}, {"author": "f_d_a_6", "body": "Athletes sweat.", "created_utc": "1661023249.0", "edited": "False", "id": "il3oqzk", "is_submitter": "False", "link_id": "t3_wtf2aj", "parent_id": "t3_wtf2aj", "score": "1", "subreddit": "formula1", "subreddit_id": "t5_2qimj"}, {"author": "f_d_a_6", "body": "A sério? Eu também sou um rapaz italiano que gostaria de viver e trabalhar em Lisboa. Já trabalho numa empresa de consultoria IT (na Itália) e tenho quase dois anos de experiência.\n\nComecei a estudar português para tentar chegar ao meu objectivo, mas até agora achava que o meu nível (provavelmente B2) não fosse suficiente para encontrar um trabalho aí, apesar da grande falta de profissionais qualificados na área de IT.\n\nMas se o que dizes é a verdade, então vou ficar muito mais motivado!", "created_utc": "1660426615.0", "edited": "False", "id": "ik6f0f0", "is_submitter": "False", "link_id": "t3_wnk8t8", "parent_id": "t1_ik5tyu3", "score": "7", "subreddit": "devpt", "subreddit_id": "t5_3838x"}]