[{"author": "Fantastic_Goat_2959", "body": "Lingala. It’s been a few years since I’ve actually used it so I’m pretty rusty, but it’s still a fun language. Pretty much unheard of outside of Africa, and virtually no one outside of Central Africa can speak or understand it.", "created_utc": "1665067618.0", "edited": "False", "id": "irac6hl", "is_submitter": "False", "link_id": "t3_xx1qfg", "parent_id": "t3_xx1qfg", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Fantastic_Goat_2959", "body": "Uzbek is definitely the way to go, trust me on this.", "created_utc": "1663703859.0", "edited": "False", "id": "ip8kmho", "is_submitter": "False", "link_id": "t3_xjid8n", "parent_id": "t3_xjid8n", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Fantastic_Goat_2959", "body": "Doesn’t look like it. Searching for “Bedouin,” “Learn Arabic,” and “Tudor Studios” didn’t turn anything up. Probably only on Google Play at this point.", "created_utc": "1658176712.0", "edited": "False", "id": "igotnnv", "is_submitter": "False", "link_id": "t3_w21r97", "parent_id": "t1_igo6p2d", "score": "2", "subreddit": "learn_arabic", "subreddit_id": "t5_2v4vi"}, {"author": "Fantastic_Goat_2959", "body": "The implication that time and resources are the determining factors of whether one can learn a language or not is extremely inaccurate. In the vast majority of cases, sub-Saharan Africans are polyglots not because they want to be, but because they need to be. Take the Democratic Republic if the Congo for instance. A child born in the capital city of Kinshasa to parents from the city of Mbuji-Mayi will be raised at home and taught to speak Tshiluba (one of the four national languages of the DRC, predominately spoken in the regions surrounding Mbuji-Mayi). As they grow up, they will be exposed to and learn Lingala, the national language spoken by the peoples in the areas surrounding Kinshasa. They will also be required to learn French, which is the official language of the Congo and functions as a lingua franca. This allows the person in question to communicate with other Congolese who speak Kikongo or Kiswahili rather than Tshiluba or Lingala, a necessary skill in a multilingual, multiethnic country where intranational migration is very common. None of these languages are learned by the child because they want to, they have to in order to function in society. \nAmericans don’t have the same needs, and can get away with being monolingual. The country was predominantly settled and populated by English speakers (who were more than happy to massacre and forcibly re-educate linguistic and ethnic minorities, i.e., enslaved Africans, Indigenous peoples, Mexicans who lived in the west prior to annexation of Mexican land, Asian immigrants, etc) , and assimilation into the anglosphere was largely required for non-English speaking European immigrants to function into society. Due to these and other factors, English has become the dominant language in the USA, and most Americans simply don’t bother to learn other languages as “everyone speaks English anyway.” This is true to the point that videos of white people screaming at minorities for daring to speak a language other than English in America are commonplace.  \nThe relative richness of a country has nothing to do with the degree of multilingualism in its population. It depends entirely on the needs of the population. Europe is also (generally speaking) relatively rich, but they are far from being monolingual. Interaction between peoples of different linguistic backgrounds encourages multilingualism, and even makes it necessary if one wants to be a functional member of society.", "created_utc": "1655768863.0", "edited": "False", "id": "id4cy06", "is_submitter": "False", "link_id": "t3_vgwzw1", "parent_id": "t1_id43aql", "score": "10", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}]