[{"author": "FirstPianist3312", "body": "It just smells so bad, I don't really care what people do as long as it doesnt make me gag. I wish we would outlaw cigarettes for the same reason", "created_utc": "1668224005.0", "edited": "False", "id": "iw16kxj", "is_submitter": "False", "link_id": "t3_ys92q9", "parent_id": "t3_ys92q9", "score": "2", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "FirstPianist3312", "body": "Yeah", "created_utc": "1668223689.0", "edited": "False", "id": "iw160r5", "is_submitter": "False", "link_id": "t3_yss678", "parent_id": "t3_yss678", "score": "2", "subreddit": "ENGLISH", "subreddit_id": "t5_2qjni"}, {"author": "FirstPianist3312", "body": "1. English because it's my native language so I'm stuck with it but it's also arguably the number 1 most useful language \n2. German, its my current target language and I wanna live there \n3. Japanese, my bf wants to live there and I plan on keeping him \n4. (Assuming my native language doesnt count) Korean or Spanish. I have alot more interest in Korean but I live in the US now so Spanish would just be more useful", "created_utc": "1668199611.0", "edited": "False", "id": "ivzrfi7", "is_submitter": "False", "link_id": "t3_ysj8al", "parent_id": "t3_ysj8al", "score": "11", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "FirstPianist3312", "body": "The only time an accent would \"bother\" me is when its so thick that it actually becomes difficult to understand what you're saying, im not even sure bother is the right word in that situation. And to be perfectly honest, I've never experienced this with people who's first language wasn't English, it's always Scottish or Irish or English accents that I'm likely to struggle with. If it bothered me whenever someone spoke with an accent tho I'd be living a very negative and sad life because I talk to people with accents all the time.", "created_utc": "1668191608.0", "edited": "False", "id": "ivz7pjq", "is_submitter": "False", "link_id": "t3_ysg7la", "parent_id": "t3_ysg7la", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "FirstPianist3312", "body": "Sometimes I speak English with German sentace structure after a long study or immersion session.....it is...interesting\n\nI'm just glad I'm not the only one with german acting like a parasite", "created_utc": "1668095570.0", "edited": "False", "id": "ivtu8yh", "is_submitter": "False", "link_id": "t3_yrafhq", "parent_id": "t3_yrafhq", "score": "14", "subreddit": "German", "subreddit_id": "t5_2qq51"}, {"author": "FirstPianist3312", "body": "I started with duolingo because it's free and gamified and it will get you a very solid foundation. I'm not yet halfway through my course and I'm already seeing great results, I can watch Disney movies and kids shows now and understand enough to get the plot line as well as some of the nuances. Everything else that I looked at costs money and at the time german was only an interest so im glad I didn't invest anything. Now that I know for sure it's more than just a temporary interest I have chosen to invest by buying beginner books and by subscribing to duolingo plus.\n\nI hope this helps", "created_utc": "1668095366.0", "edited": "False", "id": "ivttqb3", "is_submitter": "False", "link_id": "t3_yra9af", "parent_id": "t3_yra9af", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "FirstPianist3312", "body": "We can learn through exposure, its how we all learned our native language, put it was also presented to us in a learnable way which can be replicated even into adulthood. If you look up \"learn Korean in korean\" you can see an example of this.\n\nIt does become harder to learn through immersion as we get older because of brain plasticity. The brain is an amazing organ and brain plasticity is basically a fancy term for how easy it is for your brain to make connections. When we are young its imperative for our brain to make millions of connections in a short amount of time, some connections get used over and over and those get stronger, other never get used again and they away over time. The older we get the more our brain \"stiffens\" it's like if you tried to stretch a piece of gum every couple minutes. It's just becomes harder to make new connections.", "created_utc": "1668094976.0", "edited": "False", "id": "ivtsr9z", "is_submitter": "False", "link_id": "t3_yrb4kb", "parent_id": "t3_yrb4kb", "score": "0", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "FirstPianist3312", "body": "Can't say for sure, if you get selected for a/b testing then yes. If they decide the gold legendary is the one they want then yes but much later on. If neither of those happen, then no", "created_utc": "1668038319.0", "edited": "False", "id": "ivr2suu", "is_submitter": "False", "link_id": "t3_yqk0rb", "parent_id": "t1_ivr2f72", "score": "1", "subreddit": "duolingo", "subreddit_id": "t5_2t6ze"}, {"author": "FirstPianist3312", "body": "I'd literally stop doing legendary tbh", "created_utc": "1668026224.0", "edited": "False", "id": "ivq901s", "is_submitter": "False", "link_id": "t3_yqf5ak", "parent_id": "t1_ivq5o4p", "score": "5", "subreddit": "duolingo", "subreddit_id": "t5_2t6ze"}, {"author": "FirstPianist3312", "body": "It's in a/b testing I guess. Tbh I'd just not do the legendary, hopefully that'll give them shit analytics and they'll keep it at the 3 mistakes. I refuse to do an unfair test that forces you to pay an absurd amount of gems for a fucking typo", "created_utc": "1668015714.0", "edited": "False", "id": "ivphti6", "is_submitter": "False", "link_id": "t3_yqnvmx", "parent_id": "t3_yqnvmx", "score": "100", "subreddit": "duolingo", "subreddit_id": "t5_2t6ze"}, {"author": "FirstPianist3312", "body": "Whenever you want, nobody said you had to master a language in order to move on to the next. People also study multiple languages at once all the time, the only thing to pay attention to is how YOU handle it", "created_utc": "1668014445.0", "edited": "False", "id": "ivpehfe", "is_submitter": "False", "link_id": "t3_ypw6a5", "parent_id": "t3_ypw6a5", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "FirstPianist3312", "body": "I'm not sure I've had an entire moment but definitely a bunch of small ones. Every now and then I'll see a German post and understand it and I'll smile and squeal at that fact that I can understand it. I have a book that's out of my league but every couple months I open to a random page and read a paragraph or two and understand a little more each time which is also so exciting. I have another book called \"short stories in german for beginners\" that I can actually understand and each month I work through a new story and that is also super exciting. I listen to a lot of German music and sometimes I'll learn the right couple words and and suddenly it makes another song click and I'll understand what that song is about, that's ALSO super exciting every single time.\n\nI have more but it'll make this comment really long", "created_utc": "1668013984.0", "edited": "False", "id": "ivpdamw", "is_submitter": "False", "link_id": "t3_yqjy07", "parent_id": "t3_yqjy07", "score": "20", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "FirstPianist3312", "body": "This is probably such an obscure answer but my mom has a friend that spent years learning Chinese and dropped it because he couldnt handle it, he switched to Japanese and I guess he believes it was a great decision and it was supposedly much much easier.\n\nAlso I wouldnt learn japanese on duolingo because I tried that and they basically throw kanji at your face without even saying good luck. I've been using Japanese from zero, I like it because he slowly introduces hiragana in the first book, katakana in the second book, and kanji in the rest (im not even done with the first book becauseits not my target language, but i do really like the flow and format). The one downside I guess is that it's geared to be conversational and natural vs textbook and more formal, so I guess it depends on what you're looking for.\n\nAs for Chinese I got nothing other than mandarin is the second most spoken language in the world (I believe) and there are some obvious advantages that come with it. Its also very tonal, much more than japanese. If you go for Chinese then good luck, either way I think you will enjoy the language you choose", "created_utc": "1668013460.0", "edited": "False", "id": "ivpbyc4", "is_submitter": "False", "link_id": "t3_yq7t4f", "parent_id": "t3_yq7t4f", "score": "4", "subreddit": "duolingo", "subreddit_id": "t5_2t6ze"}, {"author": "FirstPianist3312", "body": "I'm just here wondering why this is NSFW", "created_utc": "1668011890.0", "edited": "False", "id": "ivp7xpx", "is_submitter": "False", "link_id": "t3_ypiybh", "parent_id": "t3_ypiybh", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "FirstPianist3312", "body": "I have, I still have typos every now and then that escape the spell check but it's definitely super handy\n\nIt's one of the first things I do when I plan on learning a new language", "created_utc": "1668011738.0", "edited": "False", "id": "ivp7jwg", "is_submitter": "False", "link_id": "t3_yqf5ak", "parent_id": "t1_ivp6meu", "score": "6", "subreddit": "duolingo", "subreddit_id": "t5_2t6ze"}, {"author": "FirstPianist3312", "body": "The zero mistake thing is so infuriating especially when duolingo isn't so great at typos", "created_utc": "1668009127.0", "edited": "False", "id": "ivp10b7", "is_submitter": "False", "link_id": "t3_yqf5ak", "parent_id": "t1_ivoya0b", "score": "97", "subreddit": "duolingo", "subreddit_id": "t5_2t6ze"}, {"author": "FirstPianist3312", "body": "I know that **I** mind it very much because I have 2 different UIs depending on if I use my phone or iPad and it's a little irritating to have these differences. I wish their testing would be based on account, not devices at the very least", "created_utc": "1668008993.0", "edited": "False", "id": "ivp0o43", "is_submitter": "False", "link_id": "t3_yqf5ak", "parent_id": "t1_ivovil9", "score": "14", "subreddit": "duolingo", "subreddit_id": "t5_2t6ze"}, {"author": "FirstPianist3312", "body": "It seems like more people are getting the update every day so I would just say be patient. I saw on some other comment in a different thread that rolling out major updates all at once can cause problems and it came from a software engineer so I'm betting that guy is right. You'd think everyone would have it though after a week and a half....im sorry you dont have it but I do believe it's coming", "created_utc": "1668008776.0", "edited": "False", "id": "ivp04da", "is_submitter": "False", "link_id": "t3_yqhssy", "parent_id": "t3_yqhssy", "score": "3", "subreddit": "duolingo", "subreddit_id": "t5_2t6ze"}, {"author": "FirstPianist3312", "body": "Just the purple", "created_utc": "1668008571.0", "edited": "False", "id": "ivozlwy", "is_submitter": "False", "link_id": "t3_yqj3xw", "parent_id": "t3_yqj3xw", "score": "2", "subreddit": "duolingo", "subreddit_id": "t5_2t6ze"}, {"author": "FirstPianist3312", "body": "Apparently yes and no, legendary is supposedly gold now and gold doesn't exist. It's seems to me like it's in A/B testing but I dont know for sure. I wouldn't worry about it either way cuz the actual feature isn't going away", "created_utc": "1668008515.0", "edited": "False", "id": "ivozgvf", "is_submitter": "False", "link_id": "t3_yqk0rb", "parent_id": "t3_yqk0rb", "score": "2", "subreddit": "duolingo", "subreddit_id": "t5_2t6ze"}, {"author": "FirstPianist3312", "body": "I dont know that you can **change** it but there should be an Italian for Spanish learners course available. You might have to scroll farther or click a \"more\" button or something but it should be there. Unfortunately this is a completely separate course so it would reset your progress (which you can just test out to catch up) but it's also possible that it wouldn't be in the same order but I don't know for sure. \n\nIt wouldn't hurt to try, you can always go back to the English version if it doesn't work out", "created_utc": "1667953865.0", "edited": "False", "id": "ivmctjp", "is_submitter": "False", "link_id": "t3_yq3d8k", "parent_id": "t3_yq3d8k", "score": "1", "subreddit": "duolingo", "subreddit_id": "t5_2t6ze"}, {"author": "FirstPianist3312", "body": "Arabic. I used to live in saudi Arabia and at my school it was mandatory. I rarely used it back then because everyone wanted to practice their English but it came in handy every now and then. Now that I live in the US again I've forgotten most of it, ive said hello a handful of times in the last 6 years and I've forgotten nearly everything else, I've even noticed that my alphabet retention is fading.", "created_utc": "1667832096.0", "edited": "False", "id": "ivf2u30", "is_submitter": "False", "link_id": "t3_ynx1gv", "parent_id": "t3_ynx1gv", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "FirstPianist3312", "body": "I got mine from Barnes n noble and I really like it, its great tool for learning but it's also a great tool for monitoring your progress. When I initially read the first story I was so happy that I could get through it and mostly understand and now when I read it again I am equally thrilled that I can read through it with ease. I'll always recommend for german learners", "created_utc": "1667682403.0", "edited": "False", "id": "iv78lcd", "is_submitter": "False", "link_id": "t3_ymhhm4", "parent_id": "t3_ymhhm4", "score": "2", "subreddit": "German", "subreddit_id": "t5_2qq51"}, {"author": "FirstPianist3312", "body": "This was my problem with hellotalk and I ended up deleting it because I was getting too many super creepy messages and I couldn't handle it", "created_utc": "1667675742.0", "edited": "False", "id": "iv6srsq", "is_submitter": "False", "link_id": "t3_ym7rhv", "parent_id": "t1_iv61h6q", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "FirstPianist3312", "body": "Holy shit that sounds like a threat??", "created_utc": "1667675470.0", "edited": "False", "id": "iv6s507", "is_submitter": "False", "link_id": "t3_ylfbrh", "parent_id": "t1_iv2f5qg", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "FirstPianist3312", "body": "I'm not like this so I'm answering from a different perspective. Logically, I suppose your accent would get better through exposure, maybe you could try to simulate it with german media, I personally like to use disney+ because of the wide range of beginner content but if you feel comfortable in the language maybe you could try to find youtube channels. Music is also an easy one because you can play that for hours and not get bored but I don't know if that would help accent-wise. Podcasts can sometime feel like a conversation, maybe you could find one in german or just with a german host speaking English with a german accent. If you really need the conversation, on HelloTalk you can phone call and video chat with native Germans on there\n\nIt would be really interesting to find out if your chameleon effect is secretly a huge advantage", "created_utc": "1667674458.0", "edited": "False", "id": "iv6pqsd", "is_submitter": "False", "link_id": "t3_yn0q49", "parent_id": "t3_yn0q49", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "FirstPianist3312", "body": "The fact that you were able to make this post in your second language should tell you that you ARE bilingual \n\nIf you want a specific line drawn between bilingual and monolingual I would probably put that line at around upper B1 or B2 in your second language \n\nIf you aren't entirly sure what bilingual means \"bi\" = 2, \"lingual\" = language/languages\n\nIn conclusion, yes", "created_utc": "1667673729.0", "edited": "False", "id": "iv6nzi7", "is_submitter": "False", "link_id": "t3_ymvu06", "parent_id": "t3_ymvu06", "score": "9", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "FirstPianist3312", "body": "No but now it's a goal lmao", "created_utc": "1667610645.0", "edited": "False", "id": "iv3o6hc", "is_submitter": "False", "link_id": "t3_ymf7m3", "parent_id": "t3_ymf7m3", "score": "17", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "FirstPianist3312", "body": "What age do you think a boomer is", "created_utc": "1667583042.0", "edited": "False", "id": "iv1vgyx", "is_submitter": "False", "link_id": "t3_ym1lxv", "parent_id": "t1_iv1vbju", "score": "8", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "FirstPianist3312", "body": "I'd love to see when Moses parted the sea", "created_utc": "1667582283.0", "edited": "False", "id": "iv1tgg3", "is_submitter": "False", "link_id": "t3_ym3zx4", "parent_id": "t1_iv1qpeb", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "FirstPianist3312", "body": "\"Dude, where's my car?\"", "created_utc": "1667582057.0", "edited": "False", "id": "iv1svd2", "is_submitter": "False", "link_id": "t3_ylmiir", "parent_id": "t3_ylmiir", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "FirstPianist3312", "body": "I love the change, I've always felt like I wanted a little more direction and instruction because I've never learned a language before and the update I feel like provides exactly that. Also I really like to plan ahead and know when I might finish something and for me the pathway is much easier to get an estimate in because I usually finish a unit in about a week. \n\nI just think the people that hate the update are louder than the people who don't", "created_utc": "1667579572.0", "edited": "False", "id": "iv1mfzu", "is_submitter": "False", "link_id": "t3_ym32uj", "parent_id": "t3_ym32uj", "score": "9", "subreddit": "duolingo", "subreddit_id": "t5_2t6ze"}, {"author": "FirstPianist3312", "body": "My brother deadass starts going through withdrawals when he visits but swears up and down his constantly being high isn't a problem.", "created_utc": "1667578446.0", "edited": "False", "id": "iv1jky4", "is_submitter": "False", "link_id": "t3_ym29b4", "parent_id": "t1_iv1ejas", "score": "4", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "FirstPianist3312", "body": "I wanna say mcdonalds onky because they're everywhere but I think chickfila is actually rated #1", "created_utc": "1667578054.0", "edited": "False", "id": "iv1ikx4", "is_submitter": "False", "link_id": "t3_ym2mvt", "parent_id": "t3_ym2mvt", "score": "0", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "FirstPianist3312", "body": "As a Texan........ok?", "created_utc": "1667577995.0", "edited": "False", "id": "iv1ifog", "is_submitter": "False", "link_id": "t3_ym2mvt", "parent_id": "t1_iv1gw0m", "score": "2", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "FirstPianist3312", "body": "Oh that german rebuild totally messed me up, I was almost done with my tree when that happened (maybe like a month or two worth of stuff) and that rebuild put me in unit 2 with a little bit of unit 4 or something in gold, im still not done with the tree. Im so glad the pathway placed me in an accurate spot, I think I only had to redo 2 or 3 concepts", "created_utc": "1667577610.0", "edited": "False", "id": "iv1hfx0", "is_submitter": "False", "link_id": "t3_ylvl4v", "parent_id": "t1_iv1g72i", "score": "4", "subreddit": "duolingo", "subreddit_id": "t5_2t6ze"}, {"author": "FirstPianist3312", "body": "You should really put your phone down when you're out to eat with people. Maybe it's because I grew up with that rule but I know when I'm getting lunch with a friend or something I find it incredibly irritating when they're on their phone\n\nEdit: holy shit my first award??", "created_utc": "1667575721.0", "edited": "1667589705.0", "id": "iv1cllx", "is_submitter": "False", "link_id": "t3_ym1lxv", "parent_id": "t3_ym1lxv", "score": "11517", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "FirstPianist3312", "body": "Das ist WUNDERBAR herzlich Glückwunsch 🎉🎉", "created_utc": "1667575119.0", "edited": "False", "id": "iv1b2ma", "is_submitter": "False", "link_id": "t3_ylz6wh", "parent_id": "t3_ylz6wh", "score": "5", "subreddit": "German", "subreddit_id": "t5_2qq51"}, {"author": "FirstPianist3312", "body": "There are fishless sushi rolls out there, I like cucumber and cream cheese rolls, also eel sauce does not contain eel (that was an issue with my mom) and it's pure yumminess. The selection is definitely limited but you could also make your own with spam or chicken or something else, it's not difficult or expensive and pretty much always tasty.", "created_utc": "1667542753.0", "edited": "False", "id": "iuzvdbh", "is_submitter": "False", "link_id": "t3_ylfbrh", "parent_id": "t1_iuzfrcr", "score": "14", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "FirstPianist3312", "body": "I actually like cauliflower pizza but it is definitely not \"just like pizza\" they are two totally different entities", "created_utc": "1667542196.0", "edited": "False", "id": "iuzuooy", "is_submitter": "False", "link_id": "t3_ylfbrh", "parent_id": "t1_iuyp7o0", "score": "5", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "FirstPianist3312", "body": "\"You'll change your mind when your older :)\" if I had a dollar for everytime someone said that to me I might actually be able to afford to have one.", "created_utc": "1667541991.0", "edited": "False", "id": "iuzufma", "is_submitter": "False", "link_id": "t3_ylfbrh", "parent_id": "t1_iuy6dk8", "score": "46", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "FirstPianist3312", "body": "Having kids. My family always tells me \"oh you'll change your mind when your older\" or \"it's different when it's your own\" or \"having kids is the greatest joy anybody can experience\" I cant even take them seriously because I know for a fact they wanted to be parents since they were little. My mom always wanted to be a mom, my dad adores children, my aunt had dreams of having 10 kids, etc. Why can't I just not want kids?", "created_utc": "1667541507.0", "edited": "False", "id": "iuzttrl", "is_submitter": "False", "link_id": "t3_ylfbrh", "parent_id": "t3_ylfbrh", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "FirstPianist3312", "body": "I understand why people like the death penalty and i do actually agree that those who take life deserve the same fate... but the problem for me lies in the fact that the executed could be innocent, its happened several times before where we've put someone to death and then found the real culprite afterwards. You can't undo the death penalty", "created_utc": "1667540899.0", "edited": "False", "id": "iuzt1i8", "is_submitter": "False", "link_id": "t3_ylptyp", "parent_id": "t3_ylptyp", "score": "38", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "FirstPianist3312", "body": "Rose vanilla, its the best combo for rainy days and curling up in a blanket to play cozy video games", "created_utc": "1667540451.0", "edited": "False", "id": "iuzsg1t", "is_submitter": "False", "link_id": "t3_ylplqn", "parent_id": "t3_ylplqn", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "FirstPianist3312", "body": "They are incredibly annoying and I hate being around children. Dont get me wrong, I do my best to be nice to them because they are still humans and theyre in their most fragile state when they're young but I definitely try to stay away from them as much as possible. I'd be devastated if I ever found myself pregnant", "created_utc": "1667540161.0", "edited": "False", "id": "iuzs1tg", "is_submitter": "False", "link_id": "t3_ylpfdz", "parent_id": "t3_ylpfdz", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "FirstPianist3312", "body": "どういたしまして！", "created_utc": "1667510880.0", "edited": "False", "id": "iuy5hb2", "is_submitter": "False", "link_id": "t3_yla6op", "parent_id": "t1_iuy4p4b", "score": "1", "subreddit": "duolingo", "subreddit_id": "t5_2t6ze"}, {"author": "FirstPianist3312", "body": "I have definitely given up on duolingo for Japanese, I now use \"learn japanese from zero\" I forget the author, BUT he has a YouTube channel by the same name and he goes through each lesson in his book and explains things further but the videos are still helpful on their own. I got the first book from Amazon and it wasn't very much (i got the ebook and i screenshot excersize pages because it was even cheaper). I'd recommend checking out his YouTube tho", "created_utc": "1667510523.0", "edited": "False", "id": "iuy4ked", "is_submitter": "False", "link_id": "t3_yla6op", "parent_id": "t1_iuy3qkg", "score": "1", "subreddit": "duolingo", "subreddit_id": "t5_2t6ze"}, {"author": "FirstPianist3312", "body": "Theres an app called kanji garden, I highly recommend it for learning kanji because they use spaced repetition and it gives thorough explanations on each kanji and the order that it presents the kanji in is also really intuitive. It very much does not line up with duolingo so I guess just be aware of that. It also doesn't provide writing practice but if you tap on the picture of the character it'll tell you the stroke order and you can go from there. Definitely check it out, it's completely free last I checked and SO helpful", "created_utc": "1667510141.0", "edited": "False", "id": "iuy3lgf", "is_submitter": "False", "link_id": "t3_yla6op", "parent_id": "t3_yla6op", "score": "1", "subreddit": "duolingo", "subreddit_id": "t5_2t6ze"}, {"author": "FirstPianist3312", "body": "Hot in german is heiß \n\nYou're only technically incorrect, it's not an entirely false translation but that is why", "created_utc": "1667509179.0", "edited": "False", "id": "iuy15c3", "is_submitter": "False", "link_id": "t3_yle90x", "parent_id": "t3_yle90x", "score": "7", "subreddit": "duolingo", "subreddit_id": "t5_2t6ze"}, {"author": "FirstPianist3312", "body": "Not particularly, they usually come from random interests. I dabbled in French when my band performed in France for the 75th anniversary of d-day. I dabbled in Japanese because my bf wants to live there someday so I'm planning on switching to Japanese as my tl later on but sometimes I get antsy, I dabbled in Korean cuz the writing system looks cool and I have a Korean friend. I even dabbled in Arabic because I used to live in saudi and it was mandatory at my school to learn it but my teacher had some weird vendetta against me that I still don't understand years later but I dabbled to make up for that bitter feeling (it didnt work) \n\nIt really is just me going \"ooh shiny\" 😅", "created_utc": "1667508983.0", "edited": "False", "id": "iuy0mrj", "is_submitter": "False", "link_id": "t3_yl6uup", "parent_id": "t1_iuxupqv", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "FirstPianist3312", "body": "I've never been officially diagnosed with adhd but my mom has it and so do my brothers and my mom suspects I have it so take this next part with a grain of salt because I only think I might have it and this is how I stay focused\n\nI wander. If a language piques my interest I delve in and I usually go back to my target language in a week or so. In the time of my learning German I have dabbled in French, Korean, and Japanese and it somehow \"recharges\" my desire to learn German? I kind of think of it like a social battery but for language because there are many times where I just dread even spending 5 minutes on german but then gladly turn around and spend 5 or 6 hours learning how to read hangul and researching every aspect of korea and stay up till 4 am making a plan on how to move there and then foolishly try to understand episode 1 of squid games in only Korean (this may or may not be based on true events...) \n\nEdit: I forgot to mention that I let myself burn out in languages that aren't German and then when I get back into German I try very hard to NOT do that for German, i very purposely try to pace myself and I basically give myself a \"cliffhanger\" by not totally scratching that German itch so I still have the itch the next day which can be very difficult for me.\n\nIdk I hope this helps somehow", "created_utc": "1667503615.0", "edited": "1667503923.0", "id": "iuxmfgs", "is_submitter": "False", "link_id": "t3_yl6uup", "parent_id": "t3_yl6uup", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "FirstPianist3312", "body": "The only way to know for sure is to get tested, it could be covid but it could also just be a cold.", "created_utc": "1667502221.0", "edited": "False", "id": "iuxitwz", "is_submitter": "False", "link_id": "t3_ylaa0i", "parent_id": "t1_iuxh8b5", "score": "3", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "FirstPianist3312", "body": "I'm not sure where they line up but I do know im in unit 47 of the German pathway and I would say I'm either towards the end of A1 or at the beginning of A2\n\nI know it's not exactly an answer but I hope it helps anyway", "created_utc": "1667501581.0", "edited": "False", "id": "iuxh54f", "is_submitter": "False", "link_id": "t3_ykijzy", "parent_id": "t3_ykijzy", "score": "1", "subreddit": "duolingo", "subreddit_id": "t5_2t6ze"}, {"author": "FirstPianist3312", "body": "I was vaccinated and still got covid really bad, shame on you for even commenting that", "created_utc": "1667501204.0", "edited": "False", "id": "iuxg52r", "is_submitter": "False", "link_id": "t3_ylaa0i", "parent_id": "t1_iuxc9dh", "score": "6", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "FirstPianist3312", "body": "I got it in January so not exactly the most recent but I had the worst headache of my life for about a week and my entire body felt like i was run over by a steamroller. My clothes hurt my skin and my throat felt like I swallowed a pack of razors, and I was so so cold and nothing would warm me up.The only time I could sleep was for about 4 hours after I took 2 advil and 1 tylonal (as the doctor had suggested while he tested me) but as soon as that wore off, the big ***hurt*** would wake me up and I would take another dose and go back to sleep. My family and I literally lived off of advil, tylonal, and 2 boxes of donut holes because we were too tired to do anything else, including eating.\n\nAfter I had \"recovered\" I was exhausted and constantly out of breath for about another month and a half, whenever I would go to work (im a waitress) i would tell my colleagues that they were free to take any of my tables because I just had no energy. My singing was affected untill around August when I was finally to hit higher notes, I honestly thought my range was permanently damaged and as a choir kid that made me really sad but I'm glad I did eventually get that back.", "created_utc": "1667500913.0", "edited": "False", "id": "iuxfdhz", "is_submitter": "False", "link_id": "t3_ylaa0i", "parent_id": "t3_ylaa0i", "score": "3", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "FirstPianist3312", "body": "You paid for the year, you'll get the year if you cancel today. It would be fraud if it reverted back without the refund", "created_utc": "1667499027.0", "edited": "False", "id": "iuxagot", "is_submitter": "False", "link_id": "t3_yl04pa", "parent_id": "t3_yl04pa", "score": "1", "subreddit": "duolingo", "subreddit_id": "t5_2t6ze"}, {"author": "FirstPianist3312", "body": "It's a natural stress reliever tho so its actually quite effective", "created_utc": "1667498550.0", "edited": "False", "id": "iux97ww", "is_submitter": "False", "link_id": "t3_yl9crx", "parent_id": "t1_iux8onq", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "FirstPianist3312", "body": "Would you know how to describe how to make that sound in the back of the throat? It's a very hard sound for Americans so I could use all the help I can get", "created_utc": "1667493155.0", "edited": "False", "id": "iuwv0hm", "is_submitter": "False", "link_id": "t3_ykcw3y", "parent_id": "t1_iuv9htt", "score": "1", "subreddit": "German", "subreddit_id": "t5_2qq51"}, {"author": "FirstPianist3312", "body": "I definitely work on the slower side and with the update my learning has been so much faster. Duolingo has built in spaced repetition and I wanna say about twice a unit you will get a personalized practice which is usually about 3 or 4 lessons and they specifically target your weaker areas. Duolingo has really streamlined and polished the learning process and I have yet to get stuck on a skill (I used to get stuck all the time and would dread coming back on Duolingo) I absolutely enjoy duolingo a lot more since the update, I personally got it maybe 2 or 3 months ago so I've had a lot of time to form this opinion, trust me, it benefits slower learners", "created_utc": "1667461083.0", "edited": "False", "id": "iuv9qei", "is_submitter": "False", "link_id": "t3_ykeex9", "parent_id": "t3_ykeex9", "score": "3", "subreddit": "duolingo", "subreddit_id": "t5_2t6ze"}, {"author": "FirstPianist3312", "body": "Theyre just asking if you connect the dots when writing or if you leave them in dot form \n\nDo you write über or ūber", "created_utc": "1667436634.0", "edited": "False", "id": "iuu3zbw", "is_submitter": "False", "link_id": "t3_ykdcv0", "parent_id": "t1_iutlt8p", "score": "3", "subreddit": "German", "subreddit_id": "t5_2qq51"}, {"author": "FirstPianist3312", "body": "I tend to make a dash, it was something my Arabic teacher taught me when I learned Arabic and I guess in learning German the habit translated. I'm trying to reverse the habit because I'm not sure it's correct as a dash", "created_utc": "1667436270.0", "edited": "False", "id": "iuu34q9", "is_submitter": "False", "link_id": "t3_ykdcv0", "parent_id": "t3_ykdcv0", "score": "1", "subreddit": "German", "subreddit_id": "t5_2qq51"}, {"author": "FirstPianist3312", "body": "Probably, I always think of A1 as kindergarten or first grade level, its probably a very useful phrase to know", "created_utc": "1667404601.0", "edited": "False", "id": "iurvfym", "is_submitter": "False", "link_id": "t3_y1nswk", "parent_id": "t1_is22s9v", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "FirstPianist3312", "body": "That's exactly what I was just thinking, no sane person person will say that phrase but anyone with C2 level will know exactly what that just said", "created_utc": "1667404225.0", "edited": "False", "id": "iurugxm", "is_submitter": "False", "link_id": "t3_y1nswk", "parent_id": "t1_irzeyyq", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "FirstPianist3312", "body": "Absolutely agreed there, I would die if duolingo added the feature", "created_utc": "1667357144.0", "edited": "False", "id": "iuppl6u", "is_submitter": "False", "link_id": "t3_yjjalr", "parent_id": "t1_iuppgbo", "score": "2", "subreddit": "duolingo", "subreddit_id": "t5_2t6ze"}, {"author": "FirstPianist3312", "body": "The problem with these apps (at least hellotalk) is that alot of people want to use it for dating? I used it for maybe a month and got dozens of creepy and suggestive messages and I hear that's a common experience. But yes they do exist", "created_utc": "1667357043.0", "edited": "False", "id": "iuppdcf", "is_submitter": "False", "link_id": "t3_yjjalr", "parent_id": "t1_iup60fl", "score": "2", "subreddit": "duolingo", "subreddit_id": "t5_2t6ze"}, {"author": "FirstPianist3312", "body": "I agree, especially because when you start your speaking with a teacher, they will know your level and work with that and challenge it only the right amount when you speak one to one. I always recommend talking with a teacher to help with intimidation too", "created_utc": "1667271957.0", "edited": "False", "id": "iukzide", "is_submitter": "False", "link_id": "t3_yipc1s", "parent_id": "t1_iujzb5e", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "FirstPianist3312", "body": "The only reason that I can really think of is that you won't get anywhere with an extremely limited vocabulary. You simply can't express much when the only words you know are \"hello\" \"bye\" \"bread\" and \"pig\"\n\nI think the moment you have learned enough words to where you can actually speak multiple sentances, even simple ones like \"hello, Today is great\" or \"pigs are my favorite animal\" is probably the point when you should start speaking. Otherwise what you are probably going to get out of the interaction is meaningless and arbitrary at best.\n\nThis is only my opinion tho", "created_utc": "1667271744.0", "edited": "False", "id": "iukz3q2", "is_submitter": "False", "link_id": "t3_yipc1s", "parent_id": "t3_yipc1s", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "FirstPianist3312", "body": "No thats king Kong, a \"frong\" is a type of women's underwear", "created_utc": "1667249793.0", "edited": "False", "id": "iujo63g", "is_submitter": "False", "link_id": "t3_yifvkn", "parent_id": "t1_iujcyh3", "score": "102", "subreddit": "duolingo", "subreddit_id": "t5_2t6ze"}, {"author": "FirstPianist3312", "body": "I've been getting this feeling too and one thing that helped me was \"short stories in german for beginners\" by Olly Richards and Alex Rawlings. I found it in Barnes n noble and it's for levels A2-B1 and it's a book that teaches you new vocabulary. Anyway, enough about the book, the reason I find it useful is because it uses very easy language, especially in the first story, and it helps reassure me that I AM learning the language and not just memorizing duolingo sentences. I'm working through it very very slowly because I feel it's still a little too advanced but I have zero regrets in buying it when I did.\nFor context im in unit 47 of the new pathway", "created_utc": "1667153843.0", "edited": "False", "id": "iueds5v", "is_submitter": "False", "link_id": "t3_ygqbg3", "parent_id": "t3_ygqbg3", "score": "1", "subreddit": "German", "subreddit_id": "t5_2qq51"}, {"author": "FirstPianist3312", "body": "I think its much easier, im learning German and I get many more perfect lessons now and duo says \"you're acing this level, would you like to move ahead\" alot more often too. I used to struggle getting through one lesson without using up my hearts, its actually one of the main reasons I subscribed to plus (it was also a gift to myself for getting 100 days) I feel like I could turn off the unlimited hearts function and still be fine (I won't, but I could)", "created_utc": "1667152920.0", "edited": "False", "id": "iuebdp5", "is_submitter": "False", "link_id": "t3_ygw9dv", "parent_id": "t3_ygw9dv", "score": "4", "subreddit": "duolingo", "subreddit_id": "t5_2t6ze"}, {"author": "FirstPianist3312", "body": "That's just depends on your pace, I wanna say it took me a few months to complete them, maybe longer for the words", "created_utc": "1667151996.0", "edited": "False", "id": "iue8zpe", "is_submitter": "False", "link_id": "t3_yhitc3", "parent_id": "t3_yhitc3", "score": "3", "subreddit": "duolingo", "subreddit_id": "t5_2t6ze"}, {"author": "FirstPianist3312", "body": "Just in time before the new update, too, congratulations!!", "created_utc": "1667150248.0", "edited": "False", "id": "iue4jdo", "is_submitter": "False", "link_id": "t3_yh0obm", "parent_id": "t3_yh0obm", "score": "1", "subreddit": "duolingo", "subreddit_id": "t5_2t6ze"}, {"author": "FirstPianist3312", "body": "I have strong German heritage and I would like to bring the language back to my family as well as get more in touch with culture. I really would like to live there maybe after college or through a transfer program in my senior year but I'd have to do more research about that tho. I also have a few friends from Germany but that's a minor factor in my wanting to learn.\n\nI want to learn Japanese because my boyfriend and I have a dream of living there for a few years and it just seems rude to not even try learning the language. We want to live there because the culture is interesting and we both really love the food, he loves cars and wants to explore that scene and I love art and would love to explore that over there as well. We also bond over anime but that is also a minor factor.", "created_utc": "1666648650.0", "edited": "False", "id": "itn8x0j", "is_submitter": "False", "link_id": "t3_yccwb1", "parent_id": "t1_itn4s8o", "score": "5", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "FirstPianist3312", "body": "1. I haven't finished a language on duolingo yet but I've heard that duolingo won't get you fluent, but it will get you really really solid foundation and will get you far enough to where figuring out how to continue is pretty easy. I believe Spanish and French go up to B2 (I could be wrong) and those are the most fleshed out courses. \n2. Xp is useless but it will get you a few achievements and it's what controls leagues, I guess it depends on whether or not leagues are important to you", "created_utc": "1666639114.0", "edited": "False", "id": "itmkl07", "is_submitter": "False", "link_id": "t3_ybypqj", "parent_id": "t3_ybypqj", "score": "1", "subreddit": "duolingo", "subreddit_id": "t5_2t6ze"}, {"author": "FirstPianist3312", "body": "I would suggest \"learn Korean in Korean\" its a YouTube channel and I learned the alphabet super easily from him and he has a separate video explaining the ending consonants. While they are entirely in Korean, I promise it's not confusing at all.\n\nI believe the answers you have shown are \"gang\" \"nat\" \"gap\" and \"gat\" so there is only one right answer here (but I could be wrong about that because Korean is not my current target language, I've only dabbled. If I am right then that should prove how good the youtube channel is!)", "created_utc": "1666638107.0", "edited": "1666638424.0", "id": "itmhzzy", "is_submitter": "False", "link_id": "t3_ycb98e", "parent_id": "t3_ycb98e", "score": "1", "subreddit": "duolingo", "subreddit_id": "t5_2t6ze"}, {"author": "FirstPianist3312", "body": "If your only goal is to ask for directions and order food then A1 is probably absolutely fine, you might not even need to be at THAT level. If you wish to talk to people and try to connect with them on your travels then I would say B1 is more suitable. If you want to totally immerse yourself into the culture while you're there or you want to stay a little more long term then maybe shoot for B2-C2.\nIt all just depends what you wish to get out of the language you're learning, theres no one-size-fits-all solution. If you feel like you have enough vocabulary under your belt then chances are, you do", "created_utc": "1666634301.0", "edited": "False", "id": "itm81s8", "is_submitter": "False", "link_id": "t3_ycdnjc", "parent_id": "t3_ycdnjc", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "FirstPianist3312", "body": "Honestly I let myself dabble. I'm learning German but in the process I've definitely learned some Japanese and Korean because I get burned out and bored in german. Whenever I feel like I want to stray I just let myself do some stuff with Japanese or Korean and usually a few days later I can get back into German and not be dreading it.", "created_utc": "1666633059.0", "edited": "False", "id": "itm4ttx", "is_submitter": "False", "link_id": "t3_yc29xo", "parent_id": "t3_yc29xo", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "FirstPianist3312", "body": "My end goal is German, japanese, korean, Spanish, and arabic. In that order. I'm learning German right now and I'd say I'm maybe around A2 level but I'm not sure, I'd have to test it.", "created_utc": "1666632686.0", "edited": "False", "id": "itm3v94", "is_submitter": "False", "link_id": "t3_yccwb1", "parent_id": "t3_yccwb1", "score": "15", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "FirstPianist3312", "body": "I think \"Mädchen\" was one of the first things I learned, idk what kind of glitch would cause an entire word to go missing....although now that I think about....it's been a while since I've seen \"Mädchen\" in my lessons, im going to have to keep a lookout now", "created_utc": "1666631460.0", "edited": "False", "id": "itm0odb", "is_submitter": "False", "link_id": "t3_yc5c2c", "parent_id": "t3_yc5c2c", "score": "2", "subreddit": "duolingo", "subreddit_id": "t5_2t6ze"}, {"author": "FirstPianist3312", "body": "I'm taking a German class in college so I have someone who will answer my questions and who will critique me when necessary. I also have a book, \"short stories in german for beginners\" by Olly Richard's, there are books for several languages by him and I highly recommend it for anyone that has it available to them. I am also watching a bunch of my Disney favorites in german and I have created a fairly long \"Deutsche musik\" Playlist that I love listening to", "created_utc": "1666543245.0", "edited": "False", "id": "ith41cb", "is_submitter": "False", "link_id": "t3_yaq5xo", "parent_id": "t3_yaq5xo", "score": "1", "subreddit": "duolingo", "subreddit_id": "t5_2t6ze"}, {"author": "FirstPianist3312", "body": "On the version I have I can go back and read stories whenever I want, as long as I've unlocked them. So maybe that's one of the features that will get rolled out with the path in November", "created_utc": "1666460196.0", "edited": "False", "id": "itcsxdv", "is_submitter": "False", "link_id": "t3_yaerm9", "parent_id": "t1_itc6qbb", "score": "3", "subreddit": "duolingo", "subreddit_id": "t5_2t6ze"}, {"author": "FirstPianist3312", "body": "I love it, it seems to go by faster in my opinion despite how long it looks. I especially like that the units are much smaller, I can now do a unit in 5-8 days vs 2-4 months. I must be retaining information better because I make significantly fewer mistakes and I get the \"you've been acing this level, would you like to skip ahead?\" Message a lot more. \nMy advice would just be to use it with an open mind because I remember hating it so much when I first got this layout and now I much prefer it to the old one.", "created_utc": "1666459959.0", "edited": "False", "id": "itcsc35", "is_submitter": "False", "link_id": "t3_yaerm9", "parent_id": "t3_yaerm9", "score": "9", "subreddit": "duolingo", "subreddit_id": "t5_2t6ze"}, {"author": "FirstPianist3312", "body": "When I learned the Arabic alphabet, my teacher taught me 4-5 letters each day and then my homework was to look for those letters when I went places. I lived in saudi at the time so finding letters to recognize was super easy but im assuming you don't live in the middle east so my suggestion would be to print off phrases and posters and put them around your place and just spend a week or so learning a few letters at a time and looking for them. This method has helped me learn the Arabic, Korean, and Japanese (aside from kanji) alphabets and it works like a charm every time.", "created_utc": "1666400447.0", "edited": "False", "id": "ita0a0a", "is_submitter": "False", "link_id": "t3_ya3y5a", "parent_id": "t3_ya3y5a", "score": "2", "subreddit": "duolingo", "subreddit_id": "t5_2t6ze"}, {"author": "FirstPianist3312", "body": "I actually prefer the new update. From what I can tell, you work on each skill 3 times (instead of 5) and about twice per unit you will get a personalized practice that will address your struggle points. It visually looks longer but once you get going it doesn't feel as long, I can knock out a unit in about 5-8 days depending on my motivation level. It takes some getting used to but I would encourage you use the new layout with an open mind before you make up your mind because I didn't like the new layout when I first got it.", "created_utc": "1666379071.0", "edited": "False", "id": "it8nujd", "is_submitter": "False", "link_id": "t3_y9ktuq", "parent_id": "t3_y9ktuq", "score": "1", "subreddit": "duolingo", "subreddit_id": "t5_2t6ze"}, {"author": "FirstPianist3312", "body": "Because they updated the layout recently, everyone will have your layout on November 1", "created_utc": "1666378204.0", "edited": "False", "id": "it8lp8g", "is_submitter": "False", "link_id": "t3_ya0x4q", "parent_id": "t3_ya0x4q", "score": "1", "subreddit": "duolingo", "subreddit_id": "t5_2t6ze"}, {"author": "FirstPianist3312", "body": "It definitely doesn't say \"can you watch my dog\"", "created_utc": "1666373522.0", "edited": "False", "id": "it89ycx", "is_submitter": "True", "link_id": "t3_y9zhk0", "parent_id": "t3_y9zhk0", "score": "2", "subreddit": "duolingo", "subreddit_id": "t5_2t6ze"}, {"author": "FirstPianist3312", "body": "Not that I'm at this level, I wish I was, but according to CEFR you should be pretty ok at B2-C1, C2 is the best", "created_utc": "1666371620.0", "edited": "False", "id": "it856v6", "is_submitter": "False", "link_id": "t3_y9rz50", "parent_id": "t3_y9rz50", "score": "4", "subreddit": "German", "subreddit_id": "t5_2qq51"}, {"author": "FirstPianist3312", "body": "The fact that things are said how they are spelled and you can realistically get a words pronunciation from reading. You will never have a issue similar to \"though, through, cough, and tough\"", "created_utc": "1666371436.0", "edited": "False", "id": "it84q7f", "is_submitter": "False", "link_id": "t3_y9o9ws", "parent_id": "t3_y9o9ws", "score": "2", "subreddit": "German", "subreddit_id": "t5_2qq51"}, {"author": "FirstPianist3312", "body": "I'm learning German and I've only learned the metric system so far, I think I'd have to look up words for imperial measurements. I actually kind of wish they would include some conversion sentances to help familiarize us with the information like \"five kilometers is a little over three miles\" or even sentences like \"thirty six degrees Celsius is really hot\".", "created_utc": "1666293805.0", "edited": "False", "id": "it3xjt1", "is_submitter": "False", "link_id": "t3_y90aq8", "parent_id": "t3_y90aq8", "score": "3", "subreddit": "duolingo", "subreddit_id": "t5_2t6ze"}, {"author": "FirstPianist3312", "body": "Do the free trial, then cancel, then do the free trial again. That should give you a month. Duolingo let me do the free trial twice with the same email, but that was over a year ago, so hopefully they haven't fixed that and hopefully you can do it more than twice", "created_utc": "1666292400.0", "edited": "False", "id": "it3txmv", "is_submitter": "False", "link_id": "t3_y96e9r", "parent_id": "t3_y96e9r", "score": "5", "subreddit": "duolingo", "subreddit_id": "t5_2t6ze"}, {"author": "FirstPianist3312", "body": "It should roll out to everyone on November 1, so be patient and you will have it soon", "created_utc": "1666239766.0", "edited": "False", "id": "it157x3", "is_submitter": "False", "link_id": "t3_y8getx", "parent_id": "t3_y8getx", "score": "3", "subreddit": "duolingo", "subreddit_id": "t5_2t6ze"}, {"author": "FirstPianist3312", "body": "There was a time when I was learning both German and French at the same time and my brain couldn't handle it so I ended up dropping French and focused on German. I think if you're going to do two languages at the same time you need to be in very different stages of the learning process (I was not at the time, definitelymade it much harder) and/or the languages need to be so different that you would have a hard time mixing them up (ei: Spanish and korean)\n\nThere's no harm in trying though, I think you will figure out pretty quickly what you can and can't handle", "created_utc": "1666205347.0", "edited": "False", "id": "isyye6x", "is_submitter": "False", "link_id": "t3_y7r0rz", "parent_id": "t1_iswv686", "score": "2", "subreddit": "duolingo", "subreddit_id": "t5_2t6ze"}, {"author": "FirstPianist3312", "body": "Yeah you'll be fine, it'll roll over", "created_utc": "1665529736.0", "edited": "False", "id": "iryc437", "is_submitter": "False", "link_id": "t3_y1dc8a", "parent_id": "t3_y1dc8a", "score": "1", "subreddit": "duolingo", "subreddit_id": "t5_2t6ze"}]