[{"author": "FloofBunnyBuns", "body": "That's weird, I've literally taken summer classes there, if you look it up there's even summer catalogs of classes that have been available previously. I know the summer classes are more limited though. \n\nWinter session at DVC is a short few weeks online early December to beginning of January I believe, mainly for students that really want to get a class out of the way. And the main semesters are Spring/Fall. Definitely is a summer semester but that's more optional. \n\nFeel free to DM me too if you have questions!", "created_utc": "1664345468.0", "edited": "False", "id": "iq7dwt8", "is_submitter": "False", "link_id": "t3_xpv6j2", "parent_id": "t1_iq6n99h", "score": "2", "subreddit": "berkeley", "subreddit_id": "t5_2qh9w"}, {"author": "FloofBunnyBuns", "body": "Highly recommend this website https://www.universityofcalifornia.edu/about-us/information-center/transfers-major it shows how many people transferred into Berkeley/ other UCs from community college by major and shows what community college they came from.\n\nI also went from DVC to Berkeley. I tried getting in from highschool and was denied but DVC has a ton of opportunities and great programs that really beefed up my application and the classes really prepared me for here. \n\nCommunity College difficulty varies a lot depending on the school and what classes you're taking. Hard science classes like physics and chem were super intense at DVC, but a lot of GenEd classes were easy. However, there's a ton of tutoring available and professors almost always have time/ want to help you outside of class. Overall it's a really good quality of eduction and sometimes I honestly like it more than Berkeley haha!", "created_utc": "1664329433.0", "edited": "False", "id": "iq6m8j6", "is_submitter": "False", "link_id": "t3_xpv6j2", "parent_id": "t3_xpv6j2", "score": "2", "subreddit": "berkeley", "subreddit_id": "t5_2qh9w"}, {"author": "FloofBunnyBuns", "body": "I like to lock up my bike next to a bike that's not locked up as well if possible. Makes my bike look like it's much harder to steal in comparison. Also using multiple locks/ locks that look beefy helps sell the image of it being too much of a hassle to care about. It's all about mentally deterring potential theft.", "created_utc": "1664318622.0", "edited": "False", "id": "iq5z2f3", "is_submitter": "False", "link_id": "t3_xp4uut", "parent_id": "t3_xp4uut", "score": "1", "subreddit": "berkeley", "subreddit_id": "t5_2qh9w"}, {"author": "FloofBunnyBuns", "body": "Bubbly and a little goofy in a cute way, like something I'd hear on sesame street from a character that speaks their own little muppet language", "created_utc": "1664228664.0", "edited": "False", "id": "iq0y9r0", "is_submitter": "False", "link_id": "t3_xoif6w", "parent_id": "t3_xoif6w", "score": "1", "subreddit": "Svenska", "subreddit_id": "t5_2scor"}, {"author": "FloofBunnyBuns", "body": "What an evil vile woman. Definitely used you to direct her xenophobic anger on. I bet you she's just all around an unpleasant person. I'm so sorry. ❤️ Sending lots of love", "created_utc": "1663793599.0", "edited": "False", "id": "ipdrzxf", "is_submitter": "False", "link_id": "t3_xk9wdn", "parent_id": "t3_xk9wdn", "score": "1", "subreddit": "TillSverige", "subreddit_id": "t5_2rwl7"}, {"author": "FloofBunnyBuns", "body": "Hello! Just wanted to start of saying that you are seen, heard, and so so valued as a person. Sending you lots of love. ❤️\n\nThere are definitely areas within the US where there is a lot of diversity and acceptance of queer people.\n\nI'm a queer black Brazilian-American living in the Bay Area in California. Never felt uncomfortable being openly queer near SF. Plus, it can be quite diverse. In general I like California a lot because it feels a bit like an oasis from other states which are going backwards on LGBT laws. Of course, this is just one state of many and I reccomend looking up other queer friendly cities to see what best fits where you would like to live, I'm just biased because I grew up here haha! \n\nCollege is definitely the best route to setting up a life in the US. Computer science is a wonderful profession to go into! Lots of amazing job opportunities and good wages. I know the price of college is TERRIFYING. Many of my friends were low income, and received little if at all financial support from family. However, there are many scholarships and financial aid available especially as a US citizen. I started off in community college and it was PERFECT for me. A lot less pressure, people tend to be friendlier, and way way cheaper. \n\nI know the wait until you can go to college feels awful, and feels like it'll be forever. While my experiences are no where near as intense to what you might be going through, I grew up in a homophobic household and it felt like things would never end, but now that I'm finally independent, life is so so much better. \n\nIt sounds corny to say, but things WILL get better. ❤️", "created_utc": "1661554701.0", "edited": "False", "id": "ilxlcek", "is_submitter": "False", "link_id": "t3_wybdjq", "parent_id": "t3_wybdjq", "score": "16", "subreddit": "IWantOut", "subreddit_id": "t5_2r5hw"}, {"author": "FloofBunnyBuns", "body": "Oski what is your opinion on pineapple on pizza?", "created_utc": "1661545555.0", "edited": "False", "id": "ilwzkj8", "is_submitter": "False", "link_id": "t3_wyhm4f", "parent_id": "t3_wyhm4f", "score": "27", "subreddit": "berkeley", "subreddit_id": "t5_2qh9w"}, {"author": "FloofBunnyBuns", "body": "I try not to skip days, but there's a looot of times where either for emotional/schedule reasons it feels impossible to do something I'll do 5 minutes of Duolingo or watch a short video. \n\nI know if I skip a day I'll get into the spiral of oh I can skip tomorrow, maybe I'll skip the day after that too..... \n\nKeeping a streak holds me accountable and makes me quite motivated and those \"easy days\" give me enough confidence to do more intensive studying when I'm ready.", "created_utc": "1661543146.0", "edited": "False", "id": "ilwtku8", "is_submitter": "False", "link_id": "t3_wx4ax5", "parent_id": "t3_wx4ax5", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "FloofBunnyBuns", "body": "I met a bunch of non-Brazilians learning Brazilian Portuguese from my university. Literally was so surprised and at first it was kind of weird, maybe just because I so closely associate Brazilian Portuguese with my Brazilian heritage and I never was exposed to people outside of that group speaking the language, but after that initial shock I LOVED it. I'm so impressed with how much dedication people put behind it. Makes me really stop and appreciate how much I love the language and how other people totally disconnected from my world love it too.", "created_utc": "1661416649.0", "edited": "False", "id": "ilpj8uo", "is_submitter": "False", "link_id": "t3_wwod1g", "parent_id": "t3_wwod1g", "score": "5", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "FloofBunnyBuns", "body": "Thank you! This was super insightful for me! A great motivator to really keep up with my language learning too.", "created_utc": "1661335533.0", "edited": "False", "id": "ilkphak", "is_submitter": "True", "link_id": "t3_wssnsr", "parent_id": "t1_il19ko2", "score": "2", "subreddit": "TillSverige", "subreddit_id": "t5_2rwl7"}, {"author": "FloofBunnyBuns", "body": "For anyone wanting to post this in any local forums/in general spreading awareness here is a version with a Google voice number as I originally cut off my personal number for reddit: \n https://www.canva.com/design/DAFJU1le2ks/xYrpL74tDoXU4ZJvMu5SHw/view?utm_content=DAFJU1le2ks&utm_campaign=share_your_design&utm_medium=link&utm_source=shareyourdesignpanel", "created_utc": "1660530110.0", "edited": "False", "id": "ikbzrrl", "is_submitter": "True", "link_id": "t3_wokgmv", "parent_id": "t3_wokgmv", "score": "7", "subreddit": "bayarea", "subreddit_id": "t5_2qjyy"}, {"author": "FloofBunnyBuns", "body": "Here's a version with a Google voice number! Thank you! \n https://www.canva.com/design/DAFJU1le2ks/xYrpL74tDoXU4ZJvMu5SHw/view?utm_content=DAFJU1le2ks&utm_campaign=share_your_design&utm_medium=link&utm_source=shareyourdesignpanel", "created_utc": "1660528826.0", "edited": "False", "id": "ikbx3s7", "is_submitter": "True", "link_id": "t3_wokgmv", "parent_id": "t1_ikbs1sa", "score": "9", "subreddit": "bayarea", "subreddit_id": "t5_2qjyy"}, {"author": "FloofBunnyBuns", "body": "Sorry I found this all out a few hours ago so still in panic mode. People can email me at candykittensena@hotmail.com or DM me here.\n\nDidn't want to post my number on Reddit so I cut it off for the post.", "created_utc": "1660525446.0", "edited": "False", "id": "ikbpx7w", "is_submitter": "True", "link_id": "t3_wokgmv", "parent_id": "t1_ikbprup", "score": "17", "subreddit": "bayarea", "subreddit_id": "t5_2qjyy"}, {"author": "FloofBunnyBuns", "body": "If you already have an apartment/room for a decent price then it's really easy finding a roommate. People are desperate for housing. I literally became overwhelmed from how many people were asking about my place when I was looking for a roommate (though my post was for a private room in an apartment for like $1000). If you post on Facebook be detailed about you and the place (it's near these shops, I'm a clean person, it's pet friendly, etc) it makes you stand out and makes people not feel like they're talking to a total stranger. I had a lot of people commenting they were particularly interested because of how much information I provided. \n\nI also interviewed people who were interested in rooming with me over zoom and I made sure to be very enthusiastic about the place (oh it's so close to the bus stops!  There's great views!) It also doesn't hurt to post to multiple Facebook groups. \n\nGood luck!", "created_utc": "1651354495.0", "edited": "False", "id": "i6u32vb", "is_submitter": "False", "link_id": "t3_ufgf23", "parent_id": "t3_ufgf23", "score": "2", "subreddit": "berkeley", "subreddit_id": "t5_2qh9w"}]