[{"author": "fragilearia", "body": "Nice, thank you!", "created_utc": "1662368223.0", "edited": "False", "id": "in5w2s4", "is_submitter": "False", "link_id": "t3_x5j5ku", "parent_id": "t1_in5sy23", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "fragilearia", "body": "As an Italian speaker who is learning French, it doesn't really bug me because I can get away with so many things that I feel like I can't be mad when trying to make Italian sound French doesn't work (and rightly so!) :'D", "created_utc": "1662326873.0", "edited": "False", "id": "in3t9ev", "is_submitter": "False", "link_id": "t3_x5x4lw", "parent_id": "t3_x5x4lw", "score": "5", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "fragilearia", "body": "I will definitely check his books out, thanks!\n\nAnd I can't blame you for netflix, or for enjoying lupin and dix pour cent, they are some of my favorites as well.\n\nI have another question: did you learn any cool idioms or slang words that you particularly enjoyed?", "created_utc": "1662325231.0", "edited": "False", "id": "in3per2", "is_submitter": "False", "link_id": "t3_x5j5ku", "parent_id": "t1_in2tvux", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "fragilearia", "body": "Thank you for taking the time to write this and congratulations on your progress!\n\nAs a fellow French learner I'll ask: what are some good movies/tv shows/books that you discovered while you were there?", "created_utc": "1662308303.0", "edited": "False", "id": "in2k28h", "is_submitter": "False", "link_id": "t3_x5j5ku", "parent_id": "t3_x5j5ku", "score": "7", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "fragilearia", "body": "I think a lot of people can relate. Have you ever tried picking one language to study for real, and allowing yourself to dabble casually in other languages? \n\nI'm focusing on my french, but to scratch that itch that makes me want to start 10 other languages I'll use gamified apps such as Duolingo and Drops to play around with Greek and Chinese whenever I feel like it. It's nothing serious, I'm not learning those languages, I just find them fun ìactivities in their own right.", "created_utc": "1662053923.0", "edited": "False", "id": "imoq8bj", "is_submitter": "False", "link_id": "t3_x3ct18", "parent_id": "t3_x3ct18", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "fragilearia", "body": "haha I love spontaneous decisions like that! Congrats on the progress you made already, that sounds great!", "created_utc": "1662053192.0", "edited": "False", "id": "imooc1c", "is_submitter": "False", "link_id": "t3_x34mtd", "parent_id": "t1_imokfq7", "score": "1", "subreddit": "languagechallenge", "subreddit_id": "t5_6v54r3"}, {"author": "fragilearia", "body": "Oh wow, that's a lot of languages! I admire your commitment. What motivated you to tackle them all at the same time? Especially Chinese and Swedish. Do you need to study them for school/work?", "created_utc": "1662053050.0", "edited": "False", "id": "imonypi", "is_submitter": "False", "link_id": "t3_x34mtd", "parent_id": "t1_imo5p7t", "score": "2", "subreddit": "languagechallenge", "subreddit_id": "t5_6v54r3"}, {"author": "fragilearia", "body": "Relatable! You can do it :)", "created_utc": "1662052917.0", "edited": "False", "id": "imonma8", "is_submitter": "False", "link_id": "t3_x34mtd", "parent_id": "t1_imnusqu", "score": "3", "subreddit": "languagechallenge", "subreddit_id": "t5_6v54r3"}, {"author": "fragilearia", "body": "I mean, given what sub this is most people are going to encourage you to learn the language, and I will too. You're there, why not take this opportunity to fully appreciate the country you're in, or at least try to? You don't need to be fluent to enjoy daily interactions.\n\nYou're also lucky because you already have a clear goal in mind: you want to be able to talk about gym stuff and get feedback on your form. This means that you can already focus on that aspect of the language. Maybe ask some bodybuilders what words are essential to body building, translate them (or as someone to translate them), and start learning them. Stuff like numbers, the words for left and right, the words for body parts and different movements related to bodybuilding, adverbs and adjectives to describe how working out makes you feel (I'm tired, I'm out of breath, my knee hurts, my muscle feels weird).\n\nA lot of the time we don't understand what someone is saying because we don't know enough words and we never know what is going to be thrown our way, but if you know that you're going to be talking about working out, you have more control over it.  I'm also sure your coach will try and speak slowly and clearly if you ask him so even accent/speed shouldn't be a problem.\n\nSo if I were in your shoes I would definitely try to at least start learning vocabulary and basic grammar, focusing on that specific goal: communicating with the trainer. Maybe there are even youtube videos about body-building in your target language to help you review words and increase your motivation both to work out and learn the language, idk!", "created_utc": "1662040230.0", "edited": "1662040518.0", "id": "imnr72o", "is_submitter": "False", "link_id": "t3_x37d8t", "parent_id": "t3_x37d8t", "score": "6", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "fragilearia", "body": "1. English, French\n2. I wanted to read the first chapter of a french graded reader I've had around forever and use the app WordUp for ten minutes to improve my English vocabulary. \n3. I've done both those things already so I'm really happy about today. I'm trying to get back into a language learning routine after neglecting both my TLs for a long time, so I'm taking baby steps.\n4. I'm proud of how focused I was while reading in french, taking my time to enjoy it and be mindful instead of rushing through it just for the sake of finishing the chapter.", "created_utc": "1662036984.0", "edited": "False", "id": "imnjyj4", "is_submitter": "False", "link_id": "t3_x34mtd", "parent_id": "t3_x34mtd", "score": "9", "subreddit": "languagechallenge", "subreddit_id": "t5_6v54r3"}, {"author": "fragilearia", "body": "I do! Whenever I'm reading something and I come across a word that I don't understand or that I don't think I'd be able to use naturally in my own speech, I write it down. If I read a beautiful passage in a novel, I copy it in a notebook with all the best bits from the books I've read and I re-read them frequently to inspire me. I'm even thinking of making an anki deck but laziness is winning at the moment.\n\nImproving my native language is also the reason why I finally gave up and started reading more than one book at a time : a challenging book for when I have more mental energy and a less challenging one that doesn't require me to be extremely focused.", "created_utc": "1662036132.0", "edited": "False", "id": "imni6e6", "is_submitter": "False", "link_id": "t3_x35pqd", "parent_id": "t3_x35pqd", "score": "50", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "fragilearia", "body": "I've had a couple of good experiences, which came down to two scenarios: (1) we just clicked, for some reason, and it felt very spontaneous as if I was talking to a friend which also meant that there was banter, immediate inside jokes, and a general overlap of at least a few interests; (2) we were just serious about our language learning and would write really thoughtful messages about our day, our opinions, the things we read and watched, and since we wanted to improve and we saw that the other person also wanted to improve and help the other do so, we were more willing to engage.\n\nThis last scenario usually started with longer messages, as if we were writing emails, and sometimes turned into chats. Sometimes it was interesting, sometimes it wasn't, but it didn't matter: we found someone who was serious about learning and helping others and we valued it above \"entertainment\".  We would just tell each other about our day, write short summaries or write about whatever we wanted to without worrying too much about how interesting it was. \n\nThe problem is that a lot of people look for the \"instant chemistry\" even though you can definitely just go into it with a bit more of a business mentality. I help you, you help me. If we become friends, great, if not, whatever, unless it's painfully uninspiring I'll keep going - it's still language practise. \n\nAlso, online there are a bunch of lists with \"interesting questions to ask\" and I do give them a look sometimes and save my favorite ones so that I can use them whenever I'm in need.", "created_utc": "1661859601.0", "edited": "False", "id": "imdhdd9", "is_submitter": "False", "link_id": "t3_x14sp2", "parent_id": "t3_x14sp2", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "fragilearia", "body": "Yes, I would say they didn't mind all that much! I never felt like they were being rude to me or openly annoyed because of it. I'm not the chatty type though so my interactions have never gone further than \"Hi, I would like this, thank you!\" or stuff like \"I only have cash, is it okay?\" so pretty basic stuff that doesn't require a deep understanding of the language or knowledge outside of the vocabulary which can come up in a restaurant or store setting. \n\nThey do sometimes reply in french anyways but since I can generally understand the gist of it I didn't pay too much attention to it.", "created_utc": "1661856725.0", "edited": "False", "id": "imdcw8r", "is_submitter": "False", "link_id": "t3_x0ulv2", "parent_id": "t1_imc87b7", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "fragilearia", "body": "I'm not sure how people in restaurants and shops take it because I have no experience with that (every time I've been to France I used english for those interactions), but my very unreliable french, which comes mostly from me trying to guess what the french word would be based on the Italian one, was very much appreciated by some of my brother's friends when I was visiting him. We went out one night and only one of them (out of 4) spoke english fluently so I had to use french and they just seemed to be really happy about me trying not to use english and just winging it in french instead, no matter how lacking my abilities were, since they could only speak french.", "created_utc": "1661808154.0", "edited": "False", "id": "imb1z86", "is_submitter": "False", "link_id": "t3_x0ulv2", "parent_id": "t3_x0ulv2", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "fragilearia", "body": "Hey! Languages make us engage in content that we otherwise would probably never come across (I'm sure it's not just me!). What's one (if any) book/movie/tv show that you watched/read solely because it was in your target language that you ended up absolutely loving?", "created_utc": "1661705945.0", "edited": "False", "id": "im5cecq", "is_submitter": "False", "link_id": "t3_wzxkkm", "parent_id": "t3_wzxkkm", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "fragilearia", "body": "It’s called a flashbulb memory: a very vivid and long-lasting memory of the moment you learned about an impactful event.", "created_utc": "1660662136.0", "edited": "False", "id": "ikizgik", "is_submitter": "False", "link_id": "t3_wpr9kx", "parent_id": "t1_ikitqfs", "score": "8", "subreddit": "interestingasfuck", "subreddit_id": "t5_2qhsa"}, {"author": "fragilearia", "body": "Il problema non ce lo vedi tu e non ce lo vedo io. Come dicevo, mi stavo riferendo al fatto che la maggior parte delle persone sente la parola \"scorie\" e spegne il cervello, immaginandosi già chissà quali strane mutazioni genetiche per tutta la popolazione nel raggio di centinaia di chilometri.\n\nIgnorando, tra l'altro, che l'industria nucleare non è la sola a produrre rifiuti che devono essere stoccati e che quindi noi, un deposito, lo dobbiamo trovare comunque.", "created_utc": "1644697061.0", "edited": "False", "id": "hwormeg", "is_submitter": "False", "link_id": "t3_sptdib", "parent_id": "t1_hwly5kw", "score": "3", "subreddit": "italy", "subreddit_id": "t5_2qkhk"}, {"author": "fragilearia", "body": "La paura più grande che ho riscontrato io è relativa alle scorie. Secondo me il grande scoglio da accettare per le persone è quello. Sento a dire in tanti \"okay, chernobyl non succederà mai più ed era una situazione particolare... ma le scorie?\"", "created_utc": "1644616157.0", "edited": "False", "id": "hwk8qqu", "is_submitter": "False", "link_id": "t3_sptdib", "parent_id": "t1_hwhtjna", "score": "2", "subreddit": "italy", "subreddit_id": "t5_2qkhk"}, {"author": "fragilearia", "body": "Parisi entered the chat :'D", "created_utc": "1644615958.0", "edited": "False", "id": "hwk87vd", "is_submitter": "False", "link_id": "t3_sptdib", "parent_id": "t1_hwhqcb4", "score": "1", "subreddit": "italy", "subreddit_id": "t5_2qkhk"}, {"author": "fragilearia", "body": "Asked leading questions.\n\nWhen told that I was struggling to focus on preparing for my exams because I felt anxious, he said \"people who are truly anxious study way more than needed\"\n\nHe let me go there for almost two years without ever bringing up that I clearly wasn't opening up or making any progress. \n\nThe one time I actually said something relevant, telling him my biggest fear, he seemed to have forgotten about it by our next session. He forgot things we talked about a lot.", "created_utc": "1644017309.0", "edited": "False", "id": "hvmomfy", "is_submitter": "False", "link_id": "t3_skfcgj", "parent_id": "t3_skfcgj", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "fragilearia", "body": "I didn't even know this was a thing and now I'm so happy this whole new world opened up for me! Maybe I won't enjoy it, but if I will it's going to be a total game changer!", "created_utc": "1644013301.0", "edited": "False", "id": "hvmesgk", "is_submitter": "False", "link_id": "t3_skcikl", "parent_id": "t3_skcikl", "score": "2", "subreddit": "EatCheapAndHealthy", "subreddit_id": "t5_2vvpi"}, {"author": "fragilearia", "body": "First of all: yikes for that person. Not cool.\n\nIn general, I agree with you. I don't see myself focusing on improving my accent to the point where native speakers can't tell I'm a foreigner. I do want to have a good accent though, because that undeniably helps when communicating. It makes it easier for people to understand you and it generally gives off a vibe of comfort with the language that I think helps make people feel like they can talk to you in a natural way.  In my experience, at least, based on my interactions with people learning Italian. \n\nThe only scenario where I think that I would personally put a bit more effort into sounding native would be if I was planning on moving abroad long-term. If I moved to an English-speaking country, for example, with a clear intention of settling down there, I'd probably start working on my accent to get it as close to native as possible.\n\nSo I do work on my accent because I think it's helpful and also because I genuinely enjoy it, but I don't go crazy about it. If someone corrects me and gives me tips, I try to implement them, but that's still the aspect I care for the least.", "created_utc": "1643997489.0", "edited": "False", "id": "hvl8xaa", "is_submitter": "False", "link_id": "t3_skhka2", "parent_id": "t3_skhka2", "score": "6", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "fragilearia", "body": "People underestimate the value of language classes in school a lot.\n\nI do think that I managed to reach a decent level of English mainly because I consumed a lot of content, but I also know that classes were really helpful as well. Getting your big chunk of input outside of school and having a teacher in school who takes care of figuring out what grammar to expose you to and monitors your output efforts is actually a good combination!\n\nI think I was also lucky enough to have teachers who were very engaging and used grammar as a way to make us understand the language better, rather than something to work on specifically. Maybe this makes me more willing to give credit where credit is due (at least a little bit), I don't know.\n\nSo, yeah... I don't think people do that in bad faith. They know a lot of people who went through the same education system as they did and can barely have a basic conversation and draw the conclusion: school classes don't work. They just don't realize that maybe immersion worked so well *because* school classes already took them to a level where they could easily find enjoyable, comprehensible input.", "created_utc": "1643631580.0", "edited": "False", "id": "huzgs26", "is_submitter": "False", "link_id": "t3_sgi49u", "parent_id": "t3_sgi49u", "score": "4", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "fragilearia", "body": "I used to work in a preschool and one day this little girl was looking out the fence, very close to the entrance gate, crying and asking for her dad. This group of moms arrived to drop off their kids, saw the girl and one of them said \"Aww, her dad must have dropped her off for once\". Like, in their minds she couldn't possibly be missing her dad because, you know, you can miss your dad too! No, it had to be because he was the last person she saw and therefore called for him instead of what she normally would/should have done, which was asking for her mom. \n\nIt still makes my blood boil.", "created_utc": "1643455338.0", "edited": "False", "id": "hupijcl", "is_submitter": "False", "link_id": "t3_sf98u2", "parent_id": "t1_huowgdf", "score": "19", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "fragilearia", "body": "Zuppa al pomodoro con lenticchie e spinaci.", "created_utc": "1643314660.0", "edited": "False", "id": "huhhtg0", "is_submitter": "False", "link_id": "t3_se6jft", "parent_id": "t3_se6jft", "score": "3", "subreddit": "veganita", "subreddit_id": "t5_3jwb3"}, {"author": "fragilearia", "body": "Lenticchie rosse e noci mi sembra un'accoppiata intrigante, aggiorna assolutamente, sì!\n\nHo provato a farlo con il trito vegano e mi piace molto in quanto a sapore, ma la consistenza non mi fa impazzire (potrebbe anche essere perché non lo faccio andare moltissimo? Non lo so, io e la cucina siamo mondi distinti)\n\nUna volta, un paio di anni fa, l'ho fatto con il tempeh e ricordo di averlo assaggiato e di aver pensato che fosse una bomba! Non l'avevo usato per la pasta, però, ma per fare la moussaka. Vuoi per il costo, vuoi perché il tempeh non lo compro mai, non l'ho più rifatto. \n\nUna combinazione letta su internet che mi aveva incuriosita era cavolfiori+noci, ma era presentata più come farcizione (è una parola? che dubbi) per dei taco che altro. Però nella mia testa avevo pensato che magari anche un sugo poteva venire bene. \n\nNon ho mai provato nemmeno funghi e noci, ma visto che entrambi gli ingredienti mi piacciono moltissimo sarebbe il caso di vincere la pigrizia ed informarmi :'D", "created_utc": "1643309125.0", "edited": "False", "id": "huh2p8a", "is_submitter": "False", "link_id": "t3_se4jnh", "parent_id": "t3_se4jnh", "score": "3", "subreddit": "veganita", "subreddit_id": "t5_3jwb3"}, {"author": "fragilearia", "body": "Same. I've recently decided to start reading books in English more frequently and right now I'm reading a Science-Fiction book. On top of the many words I don't understand, there's also the constant dilemma: is this a fictional object/concept/animal belonging to this fictional world or is this a genuine english word? Fun times :'D", "created_utc": "1643296535.0", "edited": "False", "id": "hug3zy5", "is_submitter": "False", "link_id": "t3_sdku3w", "parent_id": "t3_sdku3w", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "fragilearia", "body": ">Thank god they had smoked BBQ flavor popcorns.\n\n  \nThis cracked me up :'D\n\n  \nAnd I can't really link any specific study, but hearing and vision are heavily connected in speech perception. A very famous experiment that can attest to that is the McGurk Effect (https://www.youtube.com/watch?v=2k8fHR9jKVM). I also suggest reading up on the Wikipedia article for a better understanding of the topic.\n\n  \nI don't know if this is exactly what you were looking for, but hopefully from there you might be able to dig and find other articles that can explain way better than me how our brains process speech perception and communication.", "created_utc": "1642894904.0", "edited": "False", "id": "htt4m1o", "is_submitter": "False", "link_id": "t3_s9sn1n", "parent_id": "t3_s9sn1n", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "fragilearia", "body": "\"I guess my experience wouldn't be complete without today's game\"\n\nIs my man joking about it? I don't know wether to respect his composure or question his mindset.\n\nStill, so much respect for him.", "created_utc": "1639152797.0", "edited": "False", "id": "ho023v1", "is_submitter": "False", "link_id": "t3_rdbl92", "parent_id": "t3_rdbl92", "score": "1", "subreddit": "chess", "subreddit_id": "t5_2qhr7"}, {"author": "fragilearia", "body": "Can't wait to see how reddit reacts.", "created_utc": "1638976510.0", "edited": "False", "id": "hnq4bx4", "is_submitter": "False", "link_id": "t3_rbj8g0", "parent_id": "t1_hnq3ofu", "score": "3", "subreddit": "chess", "subreddit_id": "t5_2qhr7"}, {"author": "fragilearia", "body": "Why is Ian so classy during these press conferences? I don't want to feel for him any more than I already do! :(", "created_utc": "1638723973.0", "edited": "False", "id": "hnccfvc", "is_submitter": "False", "link_id": "t3_r9jfa3", "parent_id": "t3_r9jfa3", "score": "120", "subreddit": "chess", "subreddit_id": "t5_2qhr7"}, {"author": "fragilearia", "body": "I just watched a youtube video that mentioned how even if that were true, being vegan would still be the ethical thing to do because most plants are fed to animals, so not eating animals would reduce the amount of plants eaten overall.\n\nI think that's a nice comeback to have when people mention that nonsense!", "created_utc": "1636720527.0", "edited": "False", "id": "hkbq7l4", "is_submitter": "False", "link_id": "t3_qrsgh2", "parent_id": "t1_hk8wawk", "score": "5", "subreddit": "vegan", "subreddit_id": "t5_2qhpm"}, {"author": "fragilearia", "body": "Some of my teachers used to mark with a check incomplete answers. Not sure, memories are a bit foggy.", "created_utc": "1624020567.0", "edited": "False", "id": "h27cuzd", "is_submitter": "False", "link_id": "t3_o2hgo8", "parent_id": "t1_h26kue4", "score": "1", "subreddit": "AskEurope", "subreddit_id": "t5_2uayg"}, {"author": "fragilearia", "body": "I just did the rapid test and tested positive, waiting on the PCR results they performed right after.\n\nRight now I only have a strong cold... but my colds are always like this so I thought it was a common cold as well but got tested anyways for safety. \n\nI wish you well, hopefully your symptoms don't worsen!", "created_utc": "1610965396.0", "edited": "False", "id": "gjpilj8", "is_submitter": "False", "link_id": "t3_kzkr8y", "parent_id": "t3_kzkr8y", "score": "1", "subreddit": "COVID19positive", "subreddit_id": "t5_2hnraa"}, {"author": "fragilearia", "body": "The one time I cheer for mercedes...", "created_utc": "1607283587.0", "edited": "False", "id": "gev57bb", "is_submitter": "False", "link_id": "t3_k7zdg9", "parent_id": "t1_geuxsb4", "score": "5", "subreddit": "formula1", "subreddit_id": "t5_2qimj"}, {"author": "fragilearia", "body": "yeah a common combo is tuna + onions", "created_utc": "1601451025.0", "edited": "False", "id": "g75hml2", "is_submitter": "False", "link_id": "t3_j1ip7c", "parent_id": "t1_g71ly8u", "score": "1", "subreddit": "Cooking", "subreddit_id": "t5_2qh7f"}, {"author": "fragilearia", "body": "Every pizza place in Italy offers tuna on pizza lol", "created_utc": "1601366915.0", "edited": "False", "id": "g71hkg5", "is_submitter": "False", "link_id": "t3_j1ip7c", "parent_id": "t1_g6zu0gj", "score": "2", "subreddit": "Cooking", "subreddit_id": "t5_2qh7f"}, {"author": "fragilearia", "body": "I know this thread is kinda old, but. \n\nMaybe she already had the earrings before dying for the first time and it was only by dying that the healing power arose, but only for wounds she got after becoming immortal, leaving any pre-existing scar there. I'm sure they all would have noticed something was weird about them long before actually dying otherwise.", "created_utc": "1600964679.0", "edited": "False", "id": "g6ft3bm", "is_submitter": "False", "link_id": "t3_ht7iy1", "parent_id": "t1_fyg2uqw", "score": "2", "subreddit": "movies", "subreddit_id": "t5_2qh3s"}, {"author": "fragilearia", "body": "I needed to read this 4 years ago, but reading it now is doing a lot of good for me anyways. Thank you for taking the time to post it.", "created_utc": "1600111171.0", "edited": "False", "id": "g59qr83", "is_submitter": "False", "link_id": "t3_ism0t9", "parent_id": "t1_g58pxzd", "score": "4", "subreddit": "AskEurope", "subreddit_id": "t5_2uayg"}, {"author": "fragilearia", "body": "I feel you. Basically same age.\n\nI once left my computer screen on while I went to the bathroom and I came back to her leaning towards it and reading the chat messages that I was getting. \n\nI was 21. I didn't even confront her. Every time I think about it I feel so much rage. \n\nNot to mention the time she cried and screamed because she thought a classmate of mine got a better grade than I did.\n\nAnd these are just two things of the many.\n\nJust looking at her most times makes me uncomfortable. So many little things that add up, seemingly insignificant.", "created_utc": "1596467034.0", "edited": "False", "id": "g07px9v", "is_submitter": "False", "link_id": "t3_i2yh6s", "parent_id": "t3_i2yh6s", "score": "1", "subreddit": "relationship_advice", "subreddit_id": "t5_2r0cn"}, {"author": "fragilearia", "body": "I am not a fan of Hyram, but I was following him back when he had 30 000 subscribers and he was raving about that YTTP cleanser long before he was offered a position.\n\nAt least, this is what I remember.", "created_utc": "1596023765.0", "edited": "False", "id": "fzm2q23", "is_submitter": "False", "link_id": "t3_hz8sk4", "parent_id": "t1_fzk3wg2", "score": "14", "subreddit": "SkincareAddiction", "subreddit_id": "t5_2tbbg"}, {"author": "fragilearia", "body": "hahaha please do", "created_utc": "1595533633.0", "edited": "False", "id": "fz0i9ot", "is_submitter": "False", "link_id": "t3_hwjhp4", "parent_id": "t1_fz018hz", "score": "2", "subreddit": "SCAcirclejerk", "subreddit_id": "t5_342e9"}, {"author": "fragilearia", "body": "\"As a college drop out, I spend 10 hours a day researching skincare ingredients and the best products out there. This is my routine\"\n\nisn't it much more compelling? haha", "created_utc": "1595528573.0", "edited": "False", "id": "fz07bxb", "is_submitter": "False", "link_id": "t3_hwh4re", "parent_id": "t1_fyzzjpl", "score": "196", "subreddit": "SkincareAddiction", "subreddit_id": "t5_2tbbg"}, {"author": "fragilearia", "body": "Nivea Sun SPF50\n\n [https://www.youtube.com/watch?v=Uc4TfJtDOQA](https://www.youtube.com/watch?v=Uc4TfJtDOQA)", "created_utc": "1595192381.0", "edited": "False", "id": "fyleazn", "is_submitter": "False", "link_id": "t3_htyqux", "parent_id": "t3_htyqux", "score": "2", "subreddit": "SkincareAddictionUK", "subreddit_id": "t5_32evd"}, {"author": "fragilearia", "body": ">Actually yeah rereading it you are very insulting to other women and that you think you are better than other people for some unknown reason.\n\nAgree 100%\n\nThere isn't much else to say.", "created_utc": "1595166773.0", "edited": "False", "id": "fyk3o32", "is_submitter": "False", "link_id": "t3_hty5uj", "parent_id": "t1_fyjzcc7", "score": "4", "subreddit": "askwomenadvice", "subreddit_id": "t5_30m5u"}, {"author": "fragilearia", "body": "I will check those out, thanks!", "created_utc": "1595165831.0", "edited": "False", "id": "fyk28sr", "is_submitter": "True", "link_id": "t3_hsavhc", "parent_id": "t1_fych0fp", "score": "2", "subreddit": "EuroSkincare", "subreddit_id": "t5_3j88u"}, {"author": "fragilearia", "body": "Same!\n\nI so wanted to love this, but nope.", "created_utc": "1595165779.0", "edited": "False", "id": "fyk2635", "is_submitter": "False", "link_id": "t3_hthbyi", "parent_id": "t1_fyhf6qy", "score": "2", "subreddit": "SkincareAddiction", "subreddit_id": "t5_2tbbg"}, {"author": "fragilearia", "body": "What are the Bionike products you would recommend?", "created_utc": "1594978463.0", "edited": "False", "id": "fyceczm", "is_submitter": "True", "link_id": "t3_hsavhc", "parent_id": "t1_fyaragz", "score": "1", "subreddit": "EuroSkincare", "subreddit_id": "t5_3j88u"}, {"author": "fragilearia", "body": "Thank you for sharing the ingredients and your experience as well\n\nI'll be careful if I ever decide to purchase it, I will definitely look more into it before that though", "created_utc": "1594933817.0", "edited": "False", "id": "fyal7gc", "is_submitter": "True", "link_id": "t3_hsavhc", "parent_id": "t1_fyabsio", "score": "1", "subreddit": "EuroSkincare", "subreddit_id": "t5_3j88u"}, {"author": "fragilearia", "body": "I've actually never tried spray suncreens, I might do that now though! Thanks", "created_utc": "1594933169.0", "edited": "False", "id": "fyajur8", "is_submitter": "True", "link_id": "t3_hsavhc", "parent_id": "t1_fy9snqr", "score": "1", "subreddit": "EuroSkincare", "subreddit_id": "t5_3j88u"}, {"author": "fragilearia", "body": "Uuh, I will give it a try then, very nice in texture and finish intrigues me more than the white cast puts me off (I have fair skin). Thank you for your reply!", "created_utc": "1594933125.0", "edited": "False", "id": "fyajr9o", "is_submitter": "True", "link_id": "t3_hsavhc", "parent_id": "t1_fy9d0iq", "score": "2", "subreddit": "EuroSkincare", "subreddit_id": "t5_3j88u"}, {"author": "fragilearia", "body": "same, skincareaddiction and curlyhair have made my wallet a lot lighter.", "created_utc": "1594894303.0", "edited": "False", "id": "fy8m4e2", "is_submitter": "False", "link_id": "t3_hrwqpa", "parent_id": "t1_fy84a0e", "score": "7", "subreddit": "SkincareAddiction", "subreddit_id": "t5_2tbbg"}, {"author": "fragilearia", "body": " [https://www.cucchiaio.it/](https://www.cucchiaio.it/) \n\n I feel like this one deserves to be mentioned, the recipe books they make are pretty famous\n\n [https://www.lacucinaitaliana.it/](https://www.lacucinaitaliana.it/) \n\nI really like the magazine for the visuals, but my mom made a couple of them and they were delicious!\n\nAlso, there's a youtube channel called Italia Squisita. It's usually professional chefs showing their recipes, which can be complicated, but pretty much all videos have English subtitles and you can definitely find useful information about Italian cuisine in general.", "created_utc": "1592517227.0", "edited": "False", "id": "fv9xku0", "is_submitter": "False", "link_id": "t3_hbhfxi", "parent_id": "t1_fv9tk2q", "score": "2", "subreddit": "AskEurope", "subreddit_id": "t5_2uayg"}, {"author": "fragilearia", "body": "Pasta is great, you can make sauces in large batches and then freeze them so that you can just take one portion out of the freezer when needed, heat it up in a sauce pan as your pasta cooks and you're good to go.\n\nReally easy sauces include: tuna sauce, chickpeas w or w/o sauce, beans w/o sauce. Just plain tomato sauce.  You can make pasta with pretty much any leftover vegetable tbh. You could make ragù or lentils ragù although these do take a bit more time, but you can freeze it.\n\nLegumes soups are also a good idea.\n\nI really like lentils and spinach in tomato sauce\n\nYou let some oil heat in a pot as you cut an onion, then you throw the onion in there and let it cook for a little. Next you add the (precooked ) lentils in, salt and pepper to season it a bit, stir a bit, add the tomato sauce and some other spices. I like to put some turmeric, oregano, thyme. If you have fresh spinach you add them in gradually and keep stirring, otherwise you let the sauce cook a bit, taste it and when you like it you add your cooked spinach, give it a quick mix.  Some bread on the side and you have your meal.\n\nIf you don't want to do the onion bit, I reckon you could start with the tomato sauce, add in some onion and garlic powder, and then add the lentils and it would still be good.\n\nBeans burgers / meatballs are something you can make ahead and freeze too. There's recipes online you can play with a bit and find what you like most. I think many recipes call for some beans,  potatoes, flour and spices.  They can be a bit dry though.", "created_utc": "1592479779.0", "edited": "False", "id": "fv80vwm", "is_submitter": "False", "link_id": "t3_hb4i0a", "parent_id": "t3_hb4i0a", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "fragilearia", "body": "thank you! i'll try it out and hope for the best", "created_utc": "1591884885.0", "edited": "False", "id": "ftp4c1g", "is_submitter": "False", "link_id": "t3_gwh3j3", "parent_id": "t1_ftoxzmi", "score": "1", "subreddit": "curlyhair", "subreddit_id": "t5_2t79l"}, {"author": "fragilearia", "body": "I'm not sure whether i'm lacking moisture or protein, so I was trying to go for a routine with as little protein as possible to start out. I have a gel with protein so I was hoping to avoid it in all other products. Does the recommended Tresemme Botanique conditioner have protein in it? (re read and take a shot everytime I wrote protein lol)", "created_utc": "1591875814.0", "edited": "False", "id": "ftopq0v", "is_submitter": "False", "link_id": "t3_gwh3j3", "parent_id": "t3_gwh3j3", "score": "1", "subreddit": "curlyhair", "subreddit_id": "t5_2t79l"}, {"author": "fragilearia", "body": "Well they can't eat fish if it all dies because of plastic straws instead of fishers, can they", "created_utc": "1591709693.0", "edited": "False", "id": "fth3bia", "is_submitter": "False", "link_id": "t3_gzin5l", "parent_id": "t3_gzin5l", "score": "2", "subreddit": "vegan", "subreddit_id": "t5_2qhpm"}]