[{"author": "frejasade", "body": "Thank you, I’ll definitely keep that in mind. I can’t say I love science and tech, but I think it’s definitely smart to study something that I could fall back on.", "created_utc": "1666499121.0", "edited": "False", "id": "itf52ec", "is_submitter": "False", "link_id": "t3_y7zme1", "parent_id": "t1_iteyoz3", "score": "1", "subreddit": "linguistics", "subreddit_id": "t5_2qhos"}, {"author": "frejasade", "body": "Really anything that you would have liked to know when you were just getting into university and maybe some advice on how to become a researcher or professor in the future—honestly any insights you may have gained about academia and turning a passion for linguistics into a viable profession (I know this seems pretty nebulous but I’m not really sure where to start haha)", "created_utc": "1666477729.0", "edited": "False", "id": "itdyccs", "is_submitter": "False", "link_id": "t3_y7zme1", "parent_id": "t1_itdud59", "score": "1", "subreddit": "linguistics", "subreddit_id": "t5_2qhos"}, {"author": "frejasade", "body": "Hello! Like many of you here, I’ve always been interested in languages and linguistics and have been set on working it into my career since when I was very young. I do, however, realise how difficult some areas of the field are to get into. For anyone who has followed a linguistic career path, what guidance and advice might you have for someone looking to work as either a researcher or professor in linguistics (especially if you have studied and worked in Europe, specifically the Netherlands)?", "created_utc": "1666467507.0", "edited": "False", "id": "itdaht5", "is_submitter": "False", "link_id": "t3_y7zme1", "parent_id": "t3_y7zme1", "score": "3", "subreddit": "linguistics", "subreddit_id": "t5_2qhos"}, {"author": "frejasade", "body": "If you’re open to trade, I do have a SS XXS short-sleeved jumpsuit in blue daisy chain if that happens to interest you.", "created_utc": "1665745586.0", "edited": "False", "id": "is9vk8i", "is_submitter": "False", "link_id": "t3_xyzjqt", "parent_id": "t3_xyzjqt", "score": "1", "subreddit": "BigBudPress", "subreddit_id": "t5_2euibr"}, {"author": "frejasade", "body": "Yep I totally get it, just wanted to check and see if you’d be interested ❤️", "created_utc": "1665114128.0", "edited": "False", "id": "ird7imn", "is_submitter": "False", "link_id": "t3_xosxoa", "parent_id": "t1_ircxc71", "score": "1", "subreddit": "BigBudPress", "subreddit_id": "t5_2euibr"}, {"author": "frejasade", "body": "jazeker haha, maar ik vind het gewoon lastig om televisieseries, films en andere media te vinden, en laat me zelfs niet beginnen over het kopen van nederlandstalige boeken buiten europa…", "created_utc": "1664756227.0", "edited": "False", "id": "iqtmt1s", "is_submitter": "False", "link_id": "t3_xtu4eo", "parent_id": "t1_iqtk7j6", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "frejasade", "body": "It’s interesting to me that you include Dutch, because in my experience it’s been difficult to find interesting media, at least media that’s available outside the Netherlands and Belgium.", "created_utc": "1664745421.0", "edited": "False", "id": "iqsx9qs", "is_submitter": "False", "link_id": "t3_xtu4eo", "parent_id": "t1_iqsq1ze", "score": "5", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "frejasade", "body": "Thanks, I was only confused because Dutch Wikipedia says “Het IJ is een rivier, voorheen een zeearm, in Noord-Holland”, but I guess since it used to be a *zeearm* that that’s where the etymology would come from—or maybe I just shouldn’t trust Wikipedia haha", "created_utc": "1664740301.0", "edited": "False", "id": "iqsjnji", "is_submitter": "False", "link_id": "t3_xso94z", "parent_id": "t1_iqqa4xi", "score": "1", "subreddit": "learndutch", "subreddit_id": "t5_2t6rf"}, {"author": "frejasade", "body": "The first river I could think of was ‘Het IJ’ which is a het-word haha, though I guess it’s technically a bay?", "created_utc": "1664653909.0", "edited": "False", "id": "iqnv8t4", "is_submitter": "False", "link_id": "t3_xso94z", "parent_id": "t1_iqlvw48", "score": "1", "subreddit": "learndutch", "subreddit_id": "t5_2t6rf"}, {"author": "frejasade", "body": "I know it’s not exactly what you’re asking for but I have a blue daisy chain print jumpsuit (size XXS) if you happen to be interested!", "created_utc": "1664573085.0", "edited": "False", "id": "iqjttn0", "is_submitter": "False", "link_id": "t3_xosxoa", "parent_id": "t3_xosxoa", "score": "2", "subreddit": "BigBudPress", "subreddit_id": "t5_2euibr"}, {"author": "frejasade", "body": "Wat leuk! Heb je een discord account of een ander platform dat je verkiest? Stuur me gerust een DM en we kunnen iets regelen!", "created_utc": "1664077631.0", "edited": "False", "id": "ipssx7i", "is_submitter": "True", "link_id": "t3_xn0xqt", "parent_id": "t1_iprq3s3", "score": "1", "subreddit": "language_exchange", "subreddit_id": "t5_2tdbm"}, {"author": "frejasade", "body": "I love the pattern and wish I could keep it, it’s just a bit to snug of a fit for me unfortunately. I might also be interested in trading for XXS work pants, trousers, or overalls (XXS is my usual size, just too snug for the jumpsuit)—just let me know what you have if you’re interested!", "created_utc": "1664068856.0", "edited": "1664069155.0", "id": "ipscrfw", "is_submitter": "False", "link_id": "t3_xn3jgb", "parent_id": "t3_xn3jgb", "score": "1", "subreddit": "BigBudPress", "subreddit_id": "t5_2euibr"}, {"author": "frejasade", "body": "it’s really worth looking into the anglo-uzbek language family, they’re so similar that some linguists actually consider them dialects of the same language", "created_utc": "1664066440.0", "edited": "False", "id": "ips8162", "is_submitter": "False", "link_id": "t3_xn4nji", "parent_id": "t1_ips1a4w", "score": "10", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "frejasade", "body": "There are no languages that can directly translate into English. Additionally, even languages that are related to English or share a lot of vocabulary, like for example Dutch or French, typically take years of hard work and persistence to learn.", "created_utc": "1664065849.0", "edited": "False", "id": "ips6uex", "is_submitter": "False", "link_id": "t3_xn4nji", "parent_id": "t3_xn4nji", "score": "17", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "frejasade", "body": "It’s the Ancient Greek word “σωφροσύνη”. Known as *sophrosyne* in English, it has a few translations but I would recommend researching the Ancient Greek concept. Hope this helps!", "created_utc": "1660687726.0", "edited": "False", "id": "ikkufbq", "is_submitter": "False", "link_id": "t3_wq6xgz", "parent_id": "t3_wq6xgz", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "frejasade", "body": "I would like to add, however, that since Pāli and Sanskrit are so similar, it’s unwise to learn them both at the same time. I have heard that it’s easier to go from Sanskrit to Pāli than vice versa, so if you were to start with either of these I would start with Sanskrit. Since they are so similar, though, I’d personally recommend choosing either one or the other depending on whether you intend to study the Theravāda Canon or the Mahāyāna Canon.", "created_utc": "1660539162.0", "edited": "False", "id": "ikcgcia", "is_submitter": "False", "link_id": "t3_wopwkb", "parent_id": "t1_ikcg5fu", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "frejasade", "body": "From personal experience, the language that you’re most intrigued by at the moment will be the easiest for you to learn since you’ll have the motivation to continue learning, even when it gets tough. So go ahead and jump right into the language that excites you the most right now! \n\nAs a side note for you as a beginner in Tibetan, though, I highly recommend *Manual of Standard Tibetan* by Nicolas Tournadre and Sangda Dorje. Though it does have more linguistics jargon and academic explanations in comparison to other language resources I’ve used in the past, it’s an invaluable resource for both colloquial Lhasa Tibetan and for introducing Classical Tibetan and formal registers of the language. Though I may be off base, it seems from your language choices that you’re interested in Buddhism and its classical languages. You may already be well aware, but it’s good to keep in mind that modern spoken Tibetan and the classical language are quite different when it comes to grammatical structures and vocabulary and aren’t necessarily mutually intelligible (if you learn the spoken language you won’t be able to read classical texts without further study)—that is if you are intending to read Buddhist texts in Tibetan. If you *are* interested in the classical language, however, I also highly recommend *Translating Buddhism from Tibetan* by Joe Wilson, which has a wonderful introduction to the classical language. \n\nGood luck with your studies!", "created_utc": "1660538235.0", "edited": "1660538469.0", "id": "ikceuya", "is_submitter": "False", "link_id": "t3_wopwkb", "parent_id": "t3_wopwkb", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "frejasade", "body": "If you are looking for textbooks though, I *highly* recommend *Manual of Standard Tibetan* by Nicolas Tournadre and Sangda Dorje, it’s an excellent resource for both colloquial and introducing Classical Tibetan, though it does use quite a bit of linguistics jargon and academic explanations in comparison to most language resources I’ve used.", "created_utc": "1660222465.0", "edited": "False", "id": "ijunkca", "is_submitter": "False", "link_id": "t3_wkxslx", "parent_id": "t1_ijtutwp", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "frejasade", "body": "**Tibetan**. While I wouldn’t expect Tibetan to be common on language apps and on the internet necessarily, its online presence is almost entirely absent. In my opinion, decent resources for learning colloquial spoken Tibetan have only been made available in English or French in the last decade or so (though reputable Classical Tibetan resources mainly pertaining to Buddhism have been available for quite some time). For such an influential culture with a key position in Asian and Buddhist literature, I think it’s such a shame that Tibetan isn’t more accessible due to what I suspect are political reasons what with the ambiguous political position of Tibet.", "created_utc": "1660143607.0", "edited": "1660145522.0", "id": "ijq5jfa", "is_submitter": "False", "link_id": "t3_wkxslx", "parent_id": "t3_wkxslx", "score": "111", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "frejasade", "body": "I would say that **Dutch** is a surprisingly difficult language for English speakers. I think that since it’s so easy to begin learning Dutch with all of the cognates in simple speech, learners gain a false sense of confidence in how easy the rest of their language-learning journey will be. But when it comes to more advanced and academic Dutch, you soon realise that English has more in common with French and other romance languages than it does with other Germanic languages due to all of the borrowing. To me, this is especially compounded with the fact that almost every Dutch or Flemish person you meet will have a very advanced level of English. This makes me personally feel that English speakers need to be quite advanced in Dutch in order to make it worth speaking to Dutch speakers who would otherwise speak English better than you speak Dutch.\n\nTL;DR: Dutch can be a difficult language to perfect and chances are Dutch speakers will speak better English than you can speak Dutch regardless, so depending on your perspective and language goals you might have a high bar to reach going in.", "created_utc": "1660140987.0", "edited": "1660142234.0", "id": "ijpz0cw", "is_submitter": "False", "link_id": "t3_wkvk0j", "parent_id": "t3_wkvk0j", "score": "154", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "frejasade", "body": "Thank you for identifying it—do you happen to know in which cases using this variant might be more common or preferred?", "created_utc": "1660003392.0", "edited": "False", "id": "ijigvc6", "is_submitter": "True", "link_id": "t3_wjmp1m", "parent_id": "t1_ijia8ch", "score": "3", "subreddit": "AncientGreek", "subreddit_id": "t5_2qwux"}]