[{"author": "Fruit_Milk", "body": "Just checked it out, ALG looks like they have stuff more at my level. Thanks for the resources!", "created_utc": "1666291878.0", "edited": "False", "id": "it3skzn", "is_submitter": "False", "link_id": "t3_y8kl60", "parent_id": "t1_it3rjvr", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Fruit_Milk", "body": "Maybe I just haven't found it yet or maybe I need to wait until I'm better, but Mandarin. Things are either too easy (I found a YouTube channel that specializes in comprehensible input, but it's just repeating things like \"I like to eat pizza\" over and over lol. Or they're too hard, even baby and kids shows are too difficult (Peppa Pig is too hard to understand without reading subs, slowing it down, and looking up words. Baby shows are just songs which aren't helpful.) \n\nI had an extremely easy time finding content when I was learning Korean and Japanese, so it does feel a bit different in terms of what I have access to.", "created_utc": "1666277989.0", "edited": "False", "id": "it2sqh2", "is_submitter": "False", "link_id": "t3_y8kl60", "parent_id": "t3_y8kl60", "score": "5", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Fruit_Milk", "body": "I don't think that's it though; my partner also hasn't been able to find a family doctor. We've both used healthcare connect since we've been here 2 years ago, and we've called them multiple times and just end up on hold for hours before they hang up. They've actually assigned us to multiple doctors that when we call, they aren't even taking patients lol. We've manually called doctors ourselves going down lists but everyone is full. We've even moved to different and less populous areas and the doctor availability situation is horrible all around no matter what. Unless you go to a rural area, it seems extremely scarce.\n\nMy partner also hasn't been able to find a family doctor and has had the same negative experiences with doctors, maybe even worse (they were in the ER two days in a row for something they should have been treated immediately the first day. When another doctor down the line saw them, they were upset because of the negligence shown and timeliness of treating; go figure). Similar experiences to me. We've seen people in the ER walk out with bleeding limbs because they've been waiting hours and hours and haven't been seen. I was in the ER for almost a whole day just waiting for an x-ray. And there's countless stories of ERs straight up just closing because they can't see anyone else. People have had to drive hours and hours to the next ER. My partner is a Canadian native and the experience is the same in Vancouver as well. \n\nAnd honestly, I'd rather have more tests done than none at all. I've never had negative experiences in the US, and I've moved like every year or two to different states across the US. I shouldn't be refused simple tests or not even given them at all. For example, if I have all the symptoms of strep, why shouldn't I just be tested for strep? I get not wanting to do invasive tests, especially if the patient doesn't want it. But it's not that, and if the patient is having symptoms for a long time with no improvement, and desperately wants an answer, I don't see the point in denying a test; especially when a majority are not something that hurts you, and the alternative is not being treated at all. As well as if everything else has been explored already and the patient asks for it.\n\nDoctors in the US get paid more and have an incentive to dig in; doctors in Canada have no incentive and actually have MORE of an incentive to rush people through because they only get paid enough when they see a patient every 5 minutes lol. Of course the care is going to be worse and they're going to rush someone out. I don't care if it's driven by greed if I'm getting better and more often quality of care. Walk-ins in the US didn't have this horrible of an experience, I don't think it's a walk-in thing either. I was never rushed out 5 mins into an appointment and saw big signs everywhere that say \"one issue per appointment\". \n\nAlso, the ADHD thing happened more than a year after not having a family doctor already and having issues with the system, so it's 100% not something in my file. I also had already been prescribed the same medication even from the same clinic, and had sent in my diagnosis prior. I think I just got a shitty doctor (he literally asked if my meds were for \"depression or something\" and seemed clueless about ADHD. The reason I brought it up was because in comparison, the paid services I use are significantly higher in quality and frequency of care compared to the standard here. The fact that I could just pay $30 a month and bypass the hassle of all of that for significantly better care and constant, confirmed appointments. It works with anything else I can be seen online for as well; I can be seen the same day for an appointment, and I'm thoroughly taken care of with follow-ups and professional care. \n\nMy experience with the two-tiered healthcare system in the US has been nothing but great, and I've had experience with both spectrums (free government healthcare and insured through employer). The quality of care wasn't different in any way, I was seen mostly immediately, and I didn't have a fear about going to the doctor and not being able to get taken care of for months. It's so nice to just get things out of the way and not have issues linger, and it shouldn't be the norm here. \n\nI think people in Canada are too caught up in trying to one-up the US to admit it's not working, but honestly unless something changes, doctors will continue to leave for the US and things will only get worse. I'm honestly excited I'm starting to see it crumble, because that means something will change. Maybe we can come back in the future, because honestly everything else about Canada is really nice. It's just too big of an impact on life to stay.", "created_utc": "1666277384.0", "edited": "False", "id": "it2r7dp", "is_submitter": "False", "link_id": "t3_y8dqnz", "parent_id": "t1_it1zp5h", "score": "1", "subreddit": "askTO", "subreddit_id": "t5_2xjsd"}, {"author": "Fruit_Milk", "body": "Because as an American, now a resident in Canada; healthcare here is absolute dogwater and one of the main reasons I want to move back to the US.\n\nI've never had to wait for appointments in the US, maybe 2 weeks max for some referral appointment and that was pretty rare. Walk-in and get seen within 15 mins, doctors were very willing to test me for things and explore what's wrong. \n\nMy health has SIGNIFICANTLY declined since I've been here; I'm only in my early 20s. Medical issue after medical issue piling up because appointments have long wait times and I can't be seen anyway. I've been living here for 2 years and still don't have a family doctor. Wait times for a simple allergy test are at the one year mark. Tests can take months to even get an appointment. I'm still waiting for places to even call me back for tests, half of them don't even pick up.\n\nMy partner's mother was having symptoms and was refused testing until availability opened up like a year later. She flew out of country, got seen, tested, diagnosed, and treated within 3 days. She had CANCER. If she had waited in Canada...she wouldn't be here. In fact, waiting in Canada 100% made things worse. \n\nI have diagnosed ADHD and need medication to function in my day-to-day. I was refused a refill by a walk-in clinic, and was told I need my family doctor to give it to me. I don't have one. They reluctantly said they'd refer me to a psych and hung up immediately. That was almost a year ago and I still haven't heard a single thing back lol. I was without meds for so long. But I found a website that you pay $30 a month for, and can talk to a doctor, nurses, etc that manage your care. I'm able to get my meds every month, have follow-ups scheduled, no issues, care is amazing. Any other care I can get virtually, I use a similar service my employer pays for with telemedicine. Amazing experiences. Starting to see a pattern with paid experiences and Canada's experiences.\n\nI'm worried my and my family's health is going to be permanently impacted because we have to wait so long for everything. Extremely dismissive doctors, sub-par care, rushing out the door within 2 minutes of an appointment. \n\nI would CERTAINLY pay to get seen. I just want the option. And in Canada, right now the option is just wait and let your health deteriorate.\n \nMy experience with public healthcare has been nothing but negative. I'm tired of being in pain or sick all the time for things that should be extremely easy to diagnose and treat if I could just GET SEEN and taken care of. \n\nThe one thing this healthcare system is good for is if you have cancer and are getting treated, then your wallet is safe. Probably it. Otherwise, if you have anything chronic, or honestly anything else, and especially if you don't have a family doctor, good luck. Preventative care doesn't exist, and you're barely treated until it's absolutely fatal, then they'll MAYBE rush you into treatment when it's late.\n\nRight now it feels like the system just makes for a shitty experience for all.", "created_utc": "1666247879.0", "edited": "False", "id": "it1gnll", "is_submitter": "False", "link_id": "t3_y8dqnz", "parent_id": "t1_it0tpff", "score": "2", "subreddit": "askTO", "subreddit_id": "t5_2xjsd"}, {"author": "Fruit_Milk", "body": "Thought this was r/outside lol", "created_utc": "1666245960.0", "edited": "False", "id": "it1e7ir", "is_submitter": "False", "link_id": "t3_y8n7rv", "parent_id": "t3_y8n7rv", "score": "1", "subreddit": "Showerthoughts", "subreddit_id": "t5_2szyo"}, {"author": "Fruit_Milk", "body": "People are just haters, he climbed his way to the top", "created_utc": "1666022023.0", "edited": "False", "id": "isoq8pc", "is_submitter": "False", "link_id": "t3_y6az9t", "parent_id": "t3_y6az9t", "score": "24", "subreddit": "dalle2", "subreddit_id": "t5_66jnlu"}, {"author": "Fruit_Milk", "body": "Everything. I have ADHD with usually comes with an auditory processing disorder. You know that thing that happens sometimes where someone says something, you say \"what?\" But then a few moments later you realize what they said? It's exactly like that. With something like a movie or show it would be extremely annoying and be like lagging and constantly trying to catch up.", "created_utc": "1665677179.0", "edited": "False", "id": "is64vvc", "is_submitter": "False", "link_id": "t3_y2cyhv", "parent_id": "t1_is2rgpz", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Fruit_Milk", "body": "Global warming", "created_utc": "1665515071.0", "edited": "False", "id": "irxc6ef", "is_submitter": "False", "link_id": "t3_y0umcw", "parent_id": "t3_y0umcw", "score": "3", "subreddit": "dalle2", "subreddit_id": "t5_66jnlu"}, {"author": "Fruit_Milk", "body": "Yeah that's madness to me! I can barely do 10 new words a day and even then phewww", "created_utc": "1665233968.0", "edited": "False", "id": "irifd8a", "is_submitter": "False", "link_id": "t3_xyepdw", "parent_id": "t1_iri9w72", "score": "9", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Fruit_Milk", "body": "LOL. Yeah if it were just a pen and paper I wouldn't care about it. I'm an artist so what drew me in was the scrapbooking aspect and making it fun; drawing on it, gluing stuff, washi tape, colored pens and markers, stickers, all that. When I tried using just pens it was so ugly I just stopped using it", "created_utc": "1665068268.0", "edited": "False", "id": "iradsab", "is_submitter": "False", "link_id": "t3_xwuqs4", "parent_id": "t1_ir9qkpg", "score": "4", "subreddit": "irlADHD", "subreddit_id": "t5_5owohs"}, {"author": "Fruit_Milk", "body": "Probably at least $200 on bullet journal supplies (was into it for a year straight, then off and on for half a year until eventually dropping it).\n\n~$500 on League of Legends skins (over like 10 years)\n\nMaybe $200 on an MMO literally only for customizing my character\n\nDon't even know how much I've spent on games I haven't even played that I saw on sale and thought I'd pick up lol (spoiler alert; they still sit there)", "created_utc": "1665036524.0", "edited": "False", "id": "ir90j4a", "is_submitter": "False", "link_id": "t3_xwuqs4", "parent_id": "t3_xwuqs4", "score": "16", "subreddit": "irlADHD", "subreddit_id": "t5_5owohs"}, {"author": "Fruit_Milk", "body": "100%. Seeing so many people call him cringey is just so sad. He's always been my inspo for trying to even ATTEMPT to use my Mandarin. I could only dream of ordering something without freaking out lol. \n\nPlus, he's always helping out the people in his videos. He's never just using them for views, he's buying local products and often promoting their businesses. It's a win for everyone.\n\nWhen I watch him, even if I didn't want to study, it gives me a little kick to get started and get in the right mindset.", "created_utc": "1665035878.0", "edited": "False", "id": "ir8zomw", "is_submitter": "False", "link_id": "t3_xwi0vp", "parent_id": "t1_ir8l28d", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Fruit_Milk", "body": "Omg I always purposely made mine soft too and my people always thought I was weird!! I put ice cream in the microwave for like 10 seconds looool", "created_utc": "1664218609.0", "edited": "False", "id": "iq089qa", "is_submitter": "False", "link_id": "t3_xo3rtt", "parent_id": "t1_ipxg83v", "score": "2", "subreddit": "adhdwomen", "subreddit_id": "t5_31aao"}, {"author": "Fruit_Milk", "body": "As an artist, it feels like a slap in the face when people say I'm \"talented\". Art is never something someone was just born knowing how to do, and it took years and years of practicing, improvement, school, etc to get to where I am. When people say it's talent, it feels like it's discrediting it and also furthers the idea that these things like dancing, art, etc are inherent and not learned. Then people who try to do the same tend to give up immediately because the outcome is different and they believe it's just \"not for them\".\n\nI definitely understand people aren't thinking like that majority of the time and think it's just a compliment, but I think it would be helpful if more people did think more about stuff like that and consider saying things like \"you're so skilled!\" or \"you're a hard worker\"! I see it mentioned alot when parents are learning how to talk to their kids even, apparently psychologically it's a better compliment.", "created_utc": "1663869753.0", "edited": "False", "id": "iphyjoj", "is_submitter": "False", "link_id": "t3_xkynq4", "parent_id": "t1_iphje34", "score": "1", "subreddit": "unpopularkpopopinions", "subreddit_id": "t5_gsxgd"}, {"author": "Fruit_Milk", "body": "Yeah. I got a puppy around a year and a half ago and that's when I started realizing maybe kids isn't for me. Even just taking the dog out throughout the day is a big thing in addition to the rest of chores, work, doctor appointments, etc. Anything more and idk how that's physically possible. And this is with chores and stuff split with my partner already. Oof", "created_utc": "1663867073.0", "edited": "False", "id": "iphrdz9", "is_submitter": "False", "link_id": "t3_xks6rt", "parent_id": "t1_ipgaq3n", "score": "4", "subreddit": "adhdmeme", "subreddit_id": "t5_2u0zn"}, {"author": "Fruit_Milk", "body": "Lmao yep, it's mind-boggling. They say they \"just do it\" apparently. Amazing.", "created_utc": "1663866966.0", "edited": "False", "id": "iphr3p7", "is_submitter": "False", "link_id": "t3_xks6rt", "parent_id": "t1_ipgo5cl", "score": "11", "subreddit": "adhdmeme", "subreddit_id": "t5_2u0zn"}, {"author": "Fruit_Milk", "body": "RIGHT?? I go to work, cook dinner, shower, AND am able to play a game or something? That's a really REALLY good day lmaoo", "created_utc": "1663866918.0", "edited": "False", "id": "iphqz2o", "is_submitter": "False", "link_id": "t3_xks6rt", "parent_id": "t1_ipgbis2", "score": "11", "subreddit": "adhdmeme", "subreddit_id": "t5_2u0zn"}, {"author": "Fruit_Milk", "body": "Probably because no one uses it in China, they use Esperanto", "created_utc": "1663866551.0", "edited": "False", "id": "iphpzly", "is_submitter": "False", "link_id": "t3_xl5ur1", "parent_id": "t3_xl5ur1", "score": "30", "subreddit": "languagelearningjerk", "subreddit_id": "t5_37rt5"}, {"author": "Fruit_Milk", "body": "I can hear the \"naur\" in these pics", "created_utc": "1663866493.0", "edited": "False", "id": "iphptzu", "is_submitter": "False", "link_id": "t3_xki6v6", "parent_id": "t3_xki6v6", "score": "2", "subreddit": "Instagramreality", "subreddit_id": "t5_3pmoe"}, {"author": "Fruit_Milk", "body": "That's an awesome idea! Sleepy teas and decaf coffees, I'd love to go to a cafe for night owls or people who want something to put them to sleep instead of perk them up 😁", "created_utc": "1663864751.0", "edited": "False", "id": "iphl3xw", "is_submitter": "False", "link_id": "t3_xl0mbs", "parent_id": "t1_iphk0qp", "score": "9", "subreddit": "storyofseasons", "subreddit_id": "t5_35m3k"}, {"author": "Fruit_Milk", "body": "Coffee makes me sleepy because I have ADHD lolol. \n\nAlso the game Coffee Talk is about a cafe that runs at night; could be interesting if they really leaned into it!", "created_utc": "1663862338.0", "edited": "False", "id": "ipheq1r", "is_submitter": "False", "link_id": "t3_xl0mbs", "parent_id": "t1_ipguql0", "score": "45", "subreddit": "storyofseasons", "subreddit_id": "t5_35m3k"}, {"author": "Fruit_Milk", "body": "Wtf?!?! It's not even on beat with anything??? What was the reason?! I never noticed it wow", "created_utc": "1663352971.0", "edited": "False", "id": "iop5inq", "is_submitter": "False", "link_id": "t3_xft6ci", "parent_id": "t1_iop0xeg", "score": "38", "subreddit": "kpopthoughts", "subreddit_id": "t5_2730wn"}, {"author": "Fruit_Milk", "body": "But how else will the young fans know they should look up to them and eat up their every comeback??1!! /s", "created_utc": "1663338665.0", "edited": "False", "id": "ioo4n5z", "is_submitter": "False", "link_id": "t3_xfh01h", "parent_id": "t1_iomxhpe", "score": "1", "subreddit": "unpopularkpopopinions", "subreddit_id": "t5_gsxgd"}, {"author": "Fruit_Milk", "body": "Their entire brand feels like it's based on not growing lol", "created_utc": "1663338463.0", "edited": "False", "id": "ioo44v3", "is_submitter": "False", "link_id": "t3_xfh01h", "parent_id": "t1_ion3k9l", "score": "38", "subreddit": "unpopularkpopopinions", "subreddit_id": "t5_gsxgd"}, {"author": "Fruit_Milk", "body": "Yep. Diagnosed with ADHD as an adult now lol. Whole life through school and uni was just procrastinating and then working like hell at the last second, or doing the bare minimum, finding out it worked (and I was often praised for it) and repeat.  Unfortunately still do it now as an adult (remote work kind of enables it for me) but medication and learning what works for me makes it a bit better. \n\nWish I had the same resources as a kid and not just thrown the \"gifted\" title.", "created_utc": "1663273297.0", "edited": "False", "id": "iokrs6c", "is_submitter": "False", "link_id": "t3_xeri1m", "parent_id": "t1_iojwu1l", "score": "3", "subreddit": "Showerthoughts", "subreddit_id": "t5_2szyo"}, {"author": "Fruit_Milk", "body": "这个东西，这东西，这个东西", "created_utc": "1663174557.0", "edited": "False", "id": "iof2pyd", "is_submitter": "False", "link_id": "t3_xdot83", "parent_id": "t3_xdot83", "score": "1", "subreddit": "languagelearningjerk", "subreddit_id": "t5_37rt5"}, {"author": "Fruit_Milk", "body": "Because I always try to find a similar game and can never find anything remotely similar. Also nostalgia, but it never feels quite the same.", "created_utc": "1663040130.0", "edited": "False", "id": "io7p8mv", "is_submitter": "False", "link_id": "t3_xcv0b6", "parent_id": "t3_xcv0b6", "score": "31", "subreddit": "Mabinogi", "subreddit_id": "t5_2s4k2"}, {"author": "Fruit_Milk", "body": "Next you're gonna tell me Graggle Simpson doesn't exist 🙄", "created_utc": "1662967377.0", "edited": "False", "id": "io3ha4h", "is_submitter": "False", "link_id": "t3_xc5jne", "parent_id": "t3_xc5jne", "score": "249", "subreddit": "dalle2", "subreddit_id": "t5_66jnlu"}, {"author": "Fruit_Milk", "body": "Oh yeah? Name every Uzbek word", "created_utc": "1662920371.0", "edited": "False", "id": "io0p54n", "is_submitter": "False", "link_id": "t3_xbkjxr", "parent_id": "t1_io0oody", "score": "12", "subreddit": "languagelearningjerk", "subreddit_id": "t5_37rt5"}, {"author": "Fruit_Milk", "body": "You're asking the wrong question. The real question is why aren't you learning Uzbek instead?", "created_utc": "1662920177.0", "edited": "False", "id": "io0okp5", "is_submitter": "False", "link_id": "t3_xbkjxr", "parent_id": "t3_xbkjxr", "score": "18", "subreddit": "languagelearningjerk", "subreddit_id": "t5_37rt5"}, {"author": "Fruit_Milk", "body": "I think the best part is \"you give me butterflies you know\" ♥️", "created_utc": "1662852023.0", "edited": "False", "id": "inx3fov", "is_submitter": "False", "link_id": "t3_xaxppz", "parent_id": "t1_inwzc15", "score": "232", "subreddit": "kpopthoughts", "subreddit_id": "t5_2730wn"}, {"author": "Fruit_Milk", "body": "P1Harmony - Do It Like This", "created_utc": "1662843841.0", "edited": "False", "id": "inwk8e3", "is_submitter": "False", "link_id": "t3_xaum8a", "parent_id": "t3_xaum8a", "score": "2", "subreddit": "kpopthoughts", "subreddit_id": "t5_2730wn"}, {"author": "Fruit_Milk", "body": "Another person here also recommended doing sentence cards, so I'll have to set up some different format cards for these! I really like the choosing between two options kind of deal you mentioned, that's what usually goes on in my head when trying to format something. Thanks so much!", "created_utc": "1662757762.0", "edited": "False", "id": "inrz25a", "is_submitter": "True", "link_id": "t3_xa1hp8", "parent_id": "t1_inrb0xr", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Fruit_Milk", "body": "I do use Notion as well (for stuff other than language learning) but this is a good idea! I'll definitely have to add this to my study routine. Thanks for the advice :)", "created_utc": "1662757630.0", "edited": "False", "id": "inryqwt", "is_submitter": "True", "link_id": "t3_xa1hp8", "parent_id": "t1_inrrpt1", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Fruit_Milk", "body": "Awesome, thanks for the help 🙂", "created_utc": "1662747906.0", "edited": "False", "id": "inrawns", "is_submitter": "True", "link_id": "t3_xa1hp8", "parent_id": "t1_inralx7", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Fruit_Milk", "body": "That's a good idea, do you just put your native language on the front and TL in the back? Not sure how I should set those kind of cards up", "created_utc": "1662746947.0", "edited": "False", "id": "inr8ju2", "is_submitter": "True", "link_id": "t3_xa1hp8", "parent_id": "t1_inr6uao", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Fruit_Milk", "body": "Sorry, probably should have reworded the title. I never get mad, I'm extremely grateful. I just feel like I look at the correction and then I immediately forget and keep making the same mistake or forget I was even corrected in the first place. I'm wondering if there's a way I could integrate it into my study routine :)", "created_utc": "1662745975.0", "edited": "False", "id": "inr647a", "is_submitter": "True", "link_id": "t3_xa1hp8", "parent_id": "t1_inr4azv", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Fruit_Milk", "body": "I disagree that it's not possible. I'm 24, happily married (we met on Tinder funny enough), we both work from home with a job that allows unlimited pto, lots of downtime, and we're saving for our first house. We both have good incomes (software engineer at a FAANG company and designer at a game company) and we're well on our way. We just don't have kids so that's where a majority of that income and free time come into play. It's pretty doable, as long as you set yourself up for success, put yourself in the right situations, and always try to be better.", "created_utc": "1662744297.0", "edited": "1662747335.0", "id": "inr1u75", "is_submitter": "False", "link_id": "t3_x9cqc6", "parent_id": "t1_innbm09", "score": "2", "subreddit": "Adulting", "subreddit_id": "t5_394gd"}, {"author": "Fruit_Milk", "body": "You can just look up on the app store \"learn ___\" and you can usually find at least 5 pretty good apps per language. Also I assume if someone is looking on Reddit for Duolingo stuff or asking on language learning subs, they have probably seen other apps or know they can ask for suggestions for other apps. Even just a Google search for \"Chinese learning app\" for example will bring up lists of good ones with what they offer. \n\nI actually have never seen any Duolingo marketing besides people showing me how shit it seems to be funny enough lol.", "created_utc": "1662570943.0", "edited": "False", "id": "inh3g2j", "is_submitter": "False", "link_id": "t3_x7vmk3", "parent_id": "t1_inh0vyt", "score": "3", "subreddit": "languagelearningjerk", "subreddit_id": "t5_37rt5"}, {"author": "Fruit_Milk", "body": "I don't understand why people use Duolingo over other apps even. For majority of languages, there are apps that are specifically made for that language rather than one that claims to be for all. The sentences don't make sense and the things you learn seem not useful. I think Duolingo as a product itself seems pretty bad, other gamified apps do a much better job of actually teaching if that's what people are looking for.", "created_utc": "1662564634.0", "edited": "False", "id": "ingmwx7", "is_submitter": "False", "link_id": "t3_x7vmk3", "parent_id": "t1_infx2pq", "score": "5", "subreddit": "languagelearningjerk", "subreddit_id": "t5_37rt5"}, {"author": "Fruit_Milk", "body": "Wouldn't something like HelloChinese be way better than Duolingo for Mandarin? The sentences and vocab actually seem useful, plus they have stuff like stories, ask you to talk, and real-life situations.", "created_utc": "1662561159.0", "edited": "1662571077.0", "id": "inge5xx", "is_submitter": "False", "link_id": "t3_x7vmk3", "parent_id": "t1_infys6s", "score": "6", "subreddit": "languagelearningjerk", "subreddit_id": "t5_37rt5"}, {"author": "Fruit_Milk", "body": "When classes moved to online in 2020 I actually got diagnosed with ADHD because of how much it took away all my safety nets. In a way, very thankful for it lol. It was also my last year in uni and I now wfh, so it kind of prepared me for the future. Luckily it all worked out for me in the end. I wonder what would have happened if the pandemic never happened; I might never have needed that extra push to get checked out!", "created_utc": "1662457240.0", "edited": "False", "id": "inalijy", "is_submitter": "False", "link_id": "t3_x6eehg", "parent_id": "t3_x6eehg", "score": "1", "subreddit": "adhdmeme", "subreddit_id": "t5_2u0zn"}, {"author": "Fruit_Milk", "body": "Went to an amusement park the other day and was watching a basketball acrobatics show. They played NCT, couldn't believe my ears", "created_utc": "1662358472.0", "edited": "False", "id": "in5joon", "is_submitter": "False", "link_id": "t3_x61jtp", "parent_id": "t3_x61jtp", "score": "3", "subreddit": "kpopthoughts", "subreddit_id": "t5_2730wn"}, {"author": "Fruit_Milk", "body": "Just eat 9 then", "created_utc": "1662355132.0", "edited": "False", "id": "in5epuc", "is_submitter": "False", "link_id": "t3_x5l1jf", "parent_id": "t1_in2s55q", "score": "1", "subreddit": "youngpeopleyoutube", "subreddit_id": "t5_nngwo"}, {"author": "Fruit_Milk", "body": "From the sky", "created_utc": "1662334608.0", "edited": "False", "id": "in4a2un", "is_submitter": "False", "link_id": "t3_x5vigh", "parent_id": "t1_in41tx8", "score": "14", "subreddit": "ac_newhorizons", "subreddit_id": "t5_13014w"}, {"author": "Fruit_Milk", "body": "I use this Chrome extension that you can use with Netflix and YouTube: https://www.languagereactor.com\nLanguage Reactor\n\nYou can choose to have your native subs on or off, and it also gives you the definition for each word when you hover over it along with some example sentences. I find it immensely useful.\n\nI'll usually dedicate some time to watch a video with active listening (a vlog in my TL for example). So I'll watch it without subs first, trying to see if I can recognize anything. Most of the time I have no clue what's going on, but here and there I can kinda guess what's going on and maybe pick up a word or two. Then I'll go back and turn the subs on in my TL and native language, and I'll go line by line, writing down words I think I will definitely use soon or are high frequency (no point in writing every single word down) and make them into flashcards. I usually make a point to do 10-15 words a day. Then I'll review the new words with the example sentences in Anki. \n\nI also have some time where I watch a show without actively trying to learn new words. I'll watch a show with the TL dub, but my native subs. It's good to just get used to the way the language sounds, hear some of the words you know, and sometimes I can learn a phrase or two just by hearing it so often. I don't make an effort to write anything down, this is more for fun and more \"passive\" learning.\n\nI think doing both of these methods works really well from me. I'm a beginner in my language but since doing this, I think my level has significantly jumped.", "created_utc": "1661918106.0", "edited": "False", "id": "imhal6v", "is_submitter": "False", "link_id": "t3_x1zdqa", "parent_id": "t3_x1zdqa", "score": "6", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Fruit_Milk", "body": "You are what you eat", "created_utc": "1661666667.0", "edited": "False", "id": "im3ixj3", "is_submitter": "False", "link_id": "t3_wz9l9e", "parent_id": "t1_im1wj37", "score": "9", "subreddit": "weirddalle", "subreddit_id": "t5_6hxzck"}, {"author": "Fruit_Milk", "body": "Just saw yours; he gives off CEO vibes haha! Very nice and elegant 🙂", "created_utc": "1661273235.0", "edited": "False", "id": "ilh63oa", "is_submitter": "True", "link_id": "t3_wvc0q2", "parent_id": "t1_ilh54u9", "score": "3", "subreddit": "ac_newhorizons", "subreddit_id": "t5_13014w"}, {"author": "Fruit_Milk", "body": "Jojo pose moment", "created_utc": "1661264625.0", "edited": "False", "id": "ilgjwd9", "is_submitter": "False", "link_id": "t3_wvjtla", "parent_id": "t3_wvjtla", "score": "5", "subreddit": "runefactory", "subreddit_id": "t5_2tkdl"}, {"author": "Fruit_Milk", "body": "Wait, there's actually dialogue for putting down trash bag items in front of their house? 😯", "created_utc": "1661263749.0", "edited": "False", "id": "ilghqur", "is_submitter": "False", "link_id": "t3_wvl9ci", "parent_id": "t1_ilgdafs", "score": "1", "subreddit": "AnimalCrossingNewHor", "subreddit_id": "t5_2eyuem"}, {"author": "Fruit_Milk", "body": "Thanks! It's on my island 🙂 That's awesome! He has so much personality~", "created_utc": "1661262049.0", "edited": "False", "id": "ilgdnyu", "is_submitter": "True", "link_id": "t3_wvc0q2", "parent_id": "t1_ilf9o5q", "score": "3", "subreddit": "ac_newhorizons", "subreddit_id": "t5_13014w"}, {"author": "Fruit_Milk", "body": "Fantuan? That app is available completely in English", "created_utc": "1660858133.0", "edited": "False", "id": "ikum35c", "is_submitter": "False", "link_id": "t3_wrglz4", "parent_id": "t1_ikt3a91", "score": "3", "subreddit": "toronto", "subreddit_id": "t5_2qi63"}, {"author": "Fruit_Milk", "body": "Mensho's ramen is out of this world. Visited SF last week and had it, I've been daydreaming about it ever since lol", "created_utc": "1660855241.0", "edited": "False", "id": "ikuecly", "is_submitter": "False", "link_id": "t3_wrnp39", "parent_id": "t3_wrnp39", "score": "17", "subreddit": "AskSF", "subreddit_id": "t5_2yxdh"}, {"author": "Fruit_Milk", "body": "It's funny, I'm in Canada as an American and desperately trying to move back to the US. The lack of access to healthcare here is abhorrent. The wait time and dismissiveness, as well as rushed visits (no more than one issue per appointment, and they're rushing out the door 5 mins in) has literally almost killed family members. \n\nMy health has been deteriorating here the past couple years, when it should have been extremely simple things to test for and take no time. I can't wait to get back. My partner's mom just left and got treated for everything within days, meanwhile here it would have been half a year wait for ONE test that she's been begging doctors for. I've lived here for 2 years and still don't even have a family doctor.", "created_utc": "1660796770.0", "edited": "1660797024.0", "id": "ikr77qy", "is_submitter": "False", "link_id": "t3_wlvi6q", "parent_id": "t1_ijvmgsy", "score": "1", "subreddit": "ChronicIllness", "subreddit_id": "t5_2vh1a"}, {"author": "Fruit_Milk", "body": "I think it could be related to Purikura? It's Japanese photo booths that add stickers, effects, and people usually edit them at the end however they like (one of the popular ways is editing the face, with biggers eyes, a smaller face shape, etc). It isn't meant to look natural but more of an exaggerated cute way. Gyaru culture also could have an influence here.\n\nhttps://images.app.goo.gl/yo3ZsaY9qJxHWPpw5", "created_utc": "1659552574.0", "edited": "False", "id": "iitf5ki", "is_submitter": "False", "link_id": "t3_wezj3u", "parent_id": "t1_iit5si6", "score": "1", "subreddit": "Instagramreality", "subreddit_id": "t5_3pmoe"}, {"author": "Fruit_Milk", "body": "Pressed the \"coffee\" button on machine, went to go make breakfast. Forgot to put the cup under the machine, didn't realize until the catcher was already overflowing with coffee :DD", "created_utc": "1659551879.0", "edited": "False", "id": "iitdff4", "is_submitter": "False", "link_id": "t3_wezu4l", "parent_id": "t3_wezu4l", "score": "2", "subreddit": "ADHD", "subreddit_id": "t5_2qnwb"}, {"author": "Fruit_Milk", "body": "Jhope, I feel like he'd be so fun to be around, always making me laugh. But he also seems dependable if something serious comes around.", "created_utc": "1659118812.0", "edited": "False", "id": "ii5qmef", "is_submitter": "False", "link_id": "t3_waoumu", "parent_id": "t3_waoumu", "score": "4", "subreddit": "kpopthoughts", "subreddit_id": "t5_2730wn"}, {"author": "Fruit_Milk", "body": "Urgot is a champion from League of Legends", "created_utc": "1658602866.0", "edited": "False", "id": "ihcsnyl", "is_submitter": "False", "link_id": "t3_w5zj23", "parent_id": "t1_ihboufs", "score": "5", "subreddit": "weirddalle", "subreddit_id": "t5_6hxzck"}, {"author": "Fruit_Milk", "body": "Nope! :'D", "created_utc": "1658554598.0", "edited": "False", "id": "ihafqrl", "is_submitter": "False", "link_id": "t3_w5fgyv", "parent_id": "t1_ihafmsc", "score": "1", "subreddit": "teenagers", "subreddit_id": "t5_2rjli"}, {"author": "Fruit_Milk", "body": "Yeah, tbh I can't think of any other words to describe it alone that couldn't be applied to anything else without being obvious.\n\nBooks, battle, king", "created_utc": "1658554466.0", "edited": "False", "id": "ihafjji", "is_submitter": "False", "link_id": "t3_w5fgyv", "parent_id": "t1_ihafawy", "score": "1", "subreddit": "teenagers", "subreddit_id": "t5_2rjli"}, {"author": "Fruit_Milk", "body": "I've been signed up with health care connect for 2+ years and haven't had any luck. About half a year ago I got referred to 2 doctors, and after contacting them, they both weren't even taking patients. I've been calling healthcareconnect almost everyday and after waiting on hold for hours they just hang up. :/ I've tried reaching out to doctors myself but none of them are ever taking patients.", "created_utc": "1658553979.0", "edited": "False", "id": "ihaeset", "is_submitter": "False", "link_id": "t3_w4xi59", "parent_id": "t1_ih7hgt1", "score": "1", "subreddit": "toronto", "subreddit_id": "t5_2qi63"}, {"author": "Fruit_Milk", "body": "Don't think anyone will get this...\n\nLightning.", "created_utc": "1658553546.0", "edited": "False", "id": "ihae3lb", "is_submitter": "False", "link_id": "t3_w5fgyv", "parent_id": "t3_w5fgyv", "score": "1", "subreddit": "teenagers", "subreddit_id": "t5_2rjli"}, {"author": "Fruit_Milk", "body": "I was literally about to type this LOL! I have dust mite allergies and there's absolutely no way I'd step in a room covered in carpets, blankets, curtains, pillows, and all that stuff.", "created_utc": "1658497066.0", "edited": "False", "id": "ih6rkt1", "is_submitter": "False", "link_id": "t3_w4mam8", "parent_id": "t1_ih5krxg", "score": "1", "subreddit": "HomeDecorating", "subreddit_id": "t5_2t8de"}, {"author": "Fruit_Milk", "body": "Not having access to medical care. Came from the US 2 years ago, haven't found a family doctor since. My health has significantly declined here. Every time I go to a doctor, I get anxious and know it won't end with anything resolving.\n\nThe amount of dismissive doctors, rushing out the door after 5 minutes, refusing to test for anything. Walk-ins requiring appointments, not being able to get appointments forever. Waiting for a specialist for 1 year+. Clinics straight up not picking up the phone for days.\n\nI was on free government health care in the US and never had to wait for anything; and any other doctor, even specialists, I could usually see that same day or the next. My treatment was efficient, very thorough, and doctors weren't afraid to try testing. I always got my things taken care of.\n\nLooking to move back at this point as I'm scared I'm going to die here at this rate lol. I'm in my early 20s and really shouldn't be having this many health problems, when they could easily have been resolved in the US. I have a list of things I need to get checked out, but because walk-in clinics have a \"1 issue per visit\" rule, and they start walking out before you're even finished talking, it will probably be years before I even talk about them. The more I wait, the worse it gets.\n\nMy partner's mom literally developed cancer while in Canada because of how slow the system works. They really do wait for things to get severe before letting you get treatment. Preventative health is unheard of. She went to another country and got the tests she had been begging for months for; got seen, diagnosed, and treated within THREE DAYS. \n\nMy partner is from BC and they've never had to deal with the medical system; now that they have, they're also fed up and want to move away. I feel like most people are okay with this because they either don't deal with medical issues, or have been fed anti-US propaganda about how they're going to spend a million dollars for a doctor appointment, so ofc it's better here.\n\nIt's really sad because if it weren't for the healthcare, I would want to stay here. I feel like I was fed lies about how great it is, how there isn't any waiting, and then came here and experienced what it's really like.\n\nLooking at other places outside of Toronto that might be different, if anyone has any recommendations in Canada please let me know. I know the country's medical system as a whole is kind of crumbling right now.", "created_utc": "1658496996.0", "edited": "False", "id": "ih6rezy", "is_submitter": "False", "link_id": "t3_w4xi59", "parent_id": "t3_w4xi59", "score": "4", "subreddit": "toronto", "subreddit_id": "t5_2qi63"}, {"author": "Fruit_Milk", "body": "Don't know why, but this and the PS2 start-up sound always scared me and felt eerie lol", "created_utc": "1658293501.0", "edited": "False", "id": "igvoe42", "is_submitter": "False", "link_id": "t3_w375bb", "parent_id": "t3_w375bb", "score": "1", "subreddit": "nostalgia", "subreddit_id": "t5_2qnub"}, {"author": "Fruit_Milk", "body": "SECRET TUNNELLLLL", "created_utc": "1657500789.0", "edited": "False", "id": "ifnxzp0", "is_submitter": "False", "link_id": "t3_vvxy6m", "parent_id": "t1_ifmt5ty", "score": "0", "subreddit": "nextfuckinglevel", "subreddit_id": "t5_m0bnr"}, {"author": "Fruit_Milk", "body": "Unless they use the same technology as San Junipero, that might be a yikes 🥹", "created_utc": "1657215301.0", "edited": "False", "id": "if8e4b4", "is_submitter": "False", "link_id": "t3_vszw51", "parent_id": "t1_if62n7m", "score": "2", "subreddit": "blackmirror", "subreddit_id": "t5_2v08h"}, {"author": "Fruit_Milk", "body": "To add to this, in my experience textbooks seem to be catered to people in school, and the things they teach are, on top of not being very realistic, not very relevant like you said. Imo I shouldn't be learning vocab for the classroom and fruits before things that are more prevalent like phone, laptop, hobbies, etc. I learned apple and watermelon as my first words for some reason but only later learned how to say toilet and computer. \n\nWhen teaching a grammar structure, instead of saying:\n\n\"The watermelon is next to the banana.\"\n\nThey could say:\n\n\"My house is next to the subway.\" Or even \"My phone is next to my computer.\"\n\nAll things I say WAY more on a daily basis. I don't remember the last time I said pear or pens lol.", "created_utc": "1657214930.0", "edited": "1657256558.0", "id": "if8d5dn", "is_submitter": "False", "link_id": "t3_vtd5m4", "parent_id": "t1_if6phc8", "score": "6", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Fruit_Milk", "body": "Yes! 🙂", "created_utc": "1656794566.0", "edited": "False", "id": "iemavka", "is_submitter": "False", "link_id": "t3_vpy1jn", "parent_id": "t1_iematel", "score": "6", "subreddit": "kpopthoughts", "subreddit_id": "t5_2730wn"}, {"author": "Fruit_Milk", "body": "Idol: 😎🚲💥😅🐨", "created_utc": "1656794262.0", "edited": "False", "id": "iema8fy", "is_submitter": "False", "link_id": "t3_vpy1jn", "parent_id": "t3_vpy1jn", "score": "23", "subreddit": "kpopthoughts", "subreddit_id": "t5_2730wn"}, {"author": "Fruit_Milk", "body": "For reading, a couple I've used beside Du Chinese are the Chairman's Bao, and depending on your reading level, Lingo Ace Chinese Books (it's for children and has different difficulties, with audio, pictures, and just a great looking UI). HelloChinese also has a reading tab where they have stories they wrote just for the app (and they're always something that would happen in real life, like a specific scenario).", "created_utc": "1656425553.0", "edited": "False", "id": "ie224e2", "is_submitter": "False", "link_id": "t3_vmd8ev", "parent_id": "t1_ie1py23", "score": "2", "subreddit": "ChineseLanguage", "subreddit_id": "t5_2qyz1"}, {"author": "Fruit_Milk", "body": "The Spongebob always looked like it was bleeding from its gumball eyes lol, core memory for me.", "created_utc": "1656424894.0", "edited": "False", "id": "ie20lpc", "is_submitter": "False", "link_id": "t3_vmdv04", "parent_id": "t3_vmdv04", "score": "5", "subreddit": "nostalgia", "subreddit_id": "t5_2qnub"}, {"author": "Fruit_Milk", "body": "Another option in addition to everything everyone else mentioned, maybe adding in some temporary flooring if you want to switch things up or add a pop of color; Ikea has these removable tiles we used in our previous rental balcony. They have different woods, faux grass, diff colors and patterns. \n\nMaybe some sheer curtains for privacy/cozyness with fairy lights/lantern?\n\nA small place to put drinks down, like a small table or corner shelf.", "created_utc": "1656356912.0", "edited": "False", "id": "idyqri1", "is_submitter": "False", "link_id": "t3_vm1jtn", "parent_id": "t3_vm1jtn", "score": "53", "subreddit": "HomeDecorating", "subreddit_id": "t5_2t8de"}, {"author": "Fruit_Milk", "body": "Finding half a worm in your apple?", "created_utc": "1656356469.0", "edited": "False", "id": "idypp24", "is_submitter": "False", "link_id": "t3_vlx92t", "parent_id": "t1_idypcef", "score": "93", "subreddit": "Weird", "subreddit_id": "t5_2qlia"}, {"author": "Fruit_Milk", "body": "What the heck?! This looks SO COZY!! Amazing job!!", "created_utc": "1656356306.0", "edited": "False", "id": "idyparh", "is_submitter": "False", "link_id": "t3_vll2iv", "parent_id": "t3_vll2iv", "score": "3", "subreddit": "HomeDecorating", "subreddit_id": "t5_2t8de"}, {"author": "Fruit_Milk", "body": "There's actually some truth to this (not saying it applies to you). Many people have itchiness, rashes, eczema, dry eyes, etc. caused by demodex. They have to use special wipes or face washes to basically kill them.", "created_utc": "1656007532.0", "edited": "False", "id": "idgjexg", "is_submitter": "False", "link_id": "t3_viqxa5", "parent_id": "t1_idf16gb", "score": "4", "subreddit": "Weird", "subreddit_id": "t5_2qlia"}, {"author": "Fruit_Milk", "body": "Correct!!", "created_utc": "1655912018.0", "edited": "False", "id": "idbd5jr", "is_submitter": "False", "link_id": "t3_vhfejs", "parent_id": "t1_ida4odm", "score": "2", "subreddit": "kpopthoughts", "subreddit_id": "t5_2730wn"}, {"author": "Fruit_Milk", "body": "This egg head looking hairstyle that pops up every now and then.\n\n[D.O from Exo](https://images.app.goo.gl/wuySpgFuiG8fEr646)\n\nIn a similar fashion, [RM's hair from Fire era](https://images.app.goo.gl/Y4e4CS6ATqvgxK318)", "created_utc": "1655883221.0", "edited": "False", "id": "ida2cds", "is_submitter": "False", "link_id": "t3_vhtumq", "parent_id": "t3_vhtumq", "score": "12", "subreddit": "kpopthoughts", "subreddit_id": "t5_2730wn"}, {"author": "Fruit_Milk", "body": "Genuinely asking; was it hard to do OP? I know I’d have a hard time killing him after watching him grow for 10 years, but for all I know, that’s just life on the farm.", "created_utc": "1655882898.0", "edited": "False", "id": "ida1ynb", "is_submitter": "False", "link_id": "t3_vhlkz3", "parent_id": "t3_vhlkz3", "score": "1", "subreddit": "AbsoluteUnits", "subreddit_id": "t5_a7wuv"}, {"author": "Fruit_Milk", "body": "Golden muscle bunny", "created_utc": "1655880598.0", "edited": "False", "id": "id9z5s6", "is_submitter": "False", "link_id": "t3_vhfejs", "parent_id": "t3_vhfejs", "score": "4", "subreddit": "kpopthoughts", "subreddit_id": "t5_2730wn"}, {"author": "Fruit_Milk", "body": "Can you give me an example from the video? 😮", "created_utc": "1655230809.0", "edited": "False", "id": "iccx7o8", "is_submitter": "False", "link_id": "t3_v36w1p", "parent_id": "t1_iccsl2a", "score": "2", "subreddit": "ChineseLanguage", "subreddit_id": "t5_2qyz1"}, {"author": "Fruit_Milk", "body": "I never even saw that; I was thinking of multiple occasions from 2014. I just did a quick album but over the years they've slept together multiple times:\n\nhttps://imgur.com/a/GwOuINR\n\n\nV has even said outright that it makes him feel comfortable to hug someone while sleeping; when he can't, he hugs his pillow. He's just cuddled with everyone at this point lmaoo. RM even said that V had asked him and he mentioned that he had boundaries", "created_utc": "1654208155.0", "edited": "1654210919.0", "id": "iayrv09", "is_submitter": "False", "link_id": "t3_v3dfud", "parent_id": "t1_iayed7l", "score": "9", "subreddit": "kpopthoughts", "subreddit_id": "t5_2730wn"}, {"author": "Fruit_Milk", "body": "Not sure which time you're referring to, but they've done it a LOTTT. There are a ton of pictures and videos from different days; on different couches, on different beds", "created_utc": "1654201522.0", "edited": "False", "id": "iayd21z", "is_submitter": "False", "link_id": "t3_v3dfud", "parent_id": "t1_iayabsa", "score": "10", "subreddit": "kpopthoughts", "subreddit_id": "t5_2730wn"}, {"author": "Fruit_Milk", "body": "I see! That sounds difficult and very stressful. I have social anxiety so I can relate somewhat. \n\nNot sure if it might help, but maybe wearing a hat or sunglasses + mask so you feel more \"covered up\" might help? I find that when I am wearing stuff like that I feel like I can't be seen as much. That, and I'll listen to a podcast or something and try not to look at people, that way I'm kinda in my own zone and focusing on walking and listening rather than looking at people.", "created_utc": "1654194632.0", "edited": "False", "id": "iaxx3on", "is_submitter": "False", "link_id": "t3_v3douj", "parent_id": "t1_iaxwic2", "score": "16", "subreddit": "adhdwomen", "subreddit_id": "t5_31aao"}, {"author": "Fruit_Milk", "body": "V and Jungkook from BTS would sleep in the same bed, often cuddling with each other or just spread out on top of each other.", "created_utc": "1654193273.0", "edited": "False", "id": "iaxtx0l", "is_submitter": "False", "link_id": "t3_v3dfud", "parent_id": "t3_v3dfud", "score": "10", "subreddit": "kpopthoughts", "subreddit_id": "t5_2730wn"}, {"author": "Fruit_Milk", "body": "On a side note, are you able to do grocery delivery like Instacart? Or even curbside pickup? \n\nI wonder if there's something you can pinpoint that you might not like about what you're going out for; is it interacting with people? Having to go down aisles? Whatever you can do to make it easier may help!\n\nIf it's just leaving the house in general (which I struggle with soooo much sometimes), what helps me is having a place nearby that I can go to after to make it feel like a treat! Maybe to pick up coffee after, or just sit at a nice park or something that seems like a reward.", "created_utc": "1654193019.0", "edited": "False", "id": "iaxtbtk", "is_submitter": "False", "link_id": "t3_v3douj", "parent_id": "t3_v3douj", "score": "12", "subreddit": "adhdwomen", "subreddit_id": "t5_31aao"}, {"author": "Fruit_Milk", "body": "https://youtu.be/2GVoeHYJi38\n\nThis one. \n\nI couldn't for the life of me figure out why my sentences sounded so robotic and off despite having the correct tones. This video was one of the only ones I could find that described the way native speakers put specific amounts of time per word, some shorter and longer, depending on it's part of speech, relation to other tones, and place in the sentence.", "created_utc": "1654183209.0", "edited": "False", "id": "iax639a", "is_submitter": "False", "link_id": "t3_v36w1p", "parent_id": "t3_v36w1p", "score": "22", "subreddit": "ChineseLanguage", "subreddit_id": "t5_2qyz1"}, {"author": "Fruit_Milk", "body": "Might not be useful for every occasion, but I've found doing work at a table with http://lifeat.io is really useful for me! You can choose different settings for the sounds, music, and environments. A lot of them have video of people doing work in different environments (library, cafe, etc).\n\nThere are also study with me or clean with me type videos on YouTube!", "created_utc": "1653754202.0", "edited": "False", "id": "iabr2za", "is_submitter": "False", "link_id": "t3_uznwwp", "parent_id": "t3_uznwwp", "score": "2", "subreddit": "adhdwomen", "subreddit_id": "t5_31aao"}, {"author": "Fruit_Milk", "body": "Seconded! I actually bought a cool gadget that lets you put your phone on the shower wall so you can watch stuff in there, it has touchscreen capabilities too! Counts as a sensory experience when you're just watching something you like, also makes it less mundane 🙂 \n\nWaterproof Shower Phone Holder, URROY 360° Rotation Shower Phone Case, Anti-Fog High Sensitivity Cover Mount Box for Bathroom Wall Mirror Bathtub Kitchen, Compatible with 4\" - 7\" Cell Phones https://www.amazon.ca/dp/B096ZLC53V/ref=cm_sw_r_apan_i_0PWG8T4JZ336XZ008Z14", "created_utc": "1653538040.0", "edited": "False", "id": "ia0ys96", "is_submitter": "False", "link_id": "t3_uxsf9l", "parent_id": "t1_i9zujnh", "score": "4", "subreddit": "adhdwomen", "subreddit_id": "t5_31aao"}, {"author": "Fruit_Milk", "body": "I feel like Nosedive is one of the most Black Mirror-est episodes out of the series", "created_utc": "1653517049.0", "edited": "False", "id": "i9zr5t3", "is_submitter": "False", "link_id": "t3_uxr6bs", "parent_id": "t1_i9zme58", "score": "13", "subreddit": "blackmirror", "subreddit_id": "t5_2v08h"}, {"author": "Fruit_Milk", "body": "I personally really enjoyed it; I think it showed some very interesting ideas about how people think about their relationships and sexuality, the spectrum it might have, and also how technology might impact that. It also left some ambiguity and room for debate I felt, with how Karl looks at Danny at the end. I think I really like the episodes like San Junipero where we learn a lot about characters and their relationships.", "created_utc": "1653515835.0", "edited": "False", "id": "i9zofex", "is_submitter": "False", "link_id": "t3_uxr6bs", "parent_id": "t1_i9znxab", "score": "2", "subreddit": "blackmirror", "subreddit_id": "t5_2v08h"}, {"author": "Fruit_Milk", "body": "I'd have to move Striking Vipers up, USS Calister up, San Junipero to S, and Playtest down a couple for mine! Otherwise I think I agree with everything 🙂", "created_utc": "1653515485.0", "edited": "False", "id": "i9znm48", "is_submitter": "False", "link_id": "t3_uxr6bs", "parent_id": "t3_uxr6bs", "score": "2", "subreddit": "blackmirror", "subreddit_id": "t5_2v08h"}, {"author": "Fruit_Milk", "body": "Hey, are you able to message me? I couldn't message you; I have some info that might be able to help you. I went through the exact same thing for about 4 years but I finally was able to figure it out with the help of a doctor here in Toronto who ACTUALLY listened. \n\nNot sure if you're still going through the same issues but thought I could help someone else", "created_utc": "1653418651.0", "edited": "False", "id": "i9u9son", "is_submitter": "False", "link_id": "t3_syqyk0", "parent_id": "t1_hy21h5u", "score": "1", "subreddit": "ontario", "subreddit_id": "t5_2qsf3"}, {"author": "Fruit_Milk", "body": "Hi hi! I also like kpop and have 0 friends to talk about it with LOL. Don't seem to be able to dm you but hi!!", "created_utc": "1653156484.0", "edited": "False", "id": "i9h493h", "is_submitter": "False", "link_id": "t3_uu76t5", "parent_id": "t3_uu76t5", "score": "2", "subreddit": "TorontoHangoutFriends", "subreddit_id": "t5_4wwf1s"}, {"author": "Fruit_Milk", "body": "r/homedecorating", "created_utc": "1652835204.0", "edited": "False", "id": "i90mzp6", "is_submitter": "False", "link_id": "t3_ury5de", "parent_id": "t3_ury5de", "score": "1", "subreddit": "findareddit", "subreddit_id": "t5_2sey6"}, {"author": "Fruit_Milk", "body": "If you look up \"Korean aesthetic interior design\" you can find a lot of this style", "created_utc": "1652393637.0", "edited": "False", "id": "i8dk6tv", "is_submitter": "False", "link_id": "t3_uo5tii", "parent_id": "t3_uo5tii", "score": "5", "subreddit": "HomeDecorating", "subreddit_id": "t5_2t8de"}, {"author": "Fruit_Milk", "body": "Hol' up 🤨", "created_utc": "1652340992.0", "edited": "False", "id": "i8aii0x", "is_submitter": "False", "link_id": "t3_unsygh", "parent_id": "t1_i8a6gv8", "score": "4", "subreddit": "Weird", "subreddit_id": "t5_2qlia"}, {"author": "Fruit_Milk", "body": "Another use you could use it for is to put some kind of big decorative plant that spills over the sides! Like a fern or something", "created_utc": "1652300262.0", "edited": "False", "id": "i88a26v", "is_submitter": "False", "link_id": "t3_ungu1j", "parent_id": "t3_ungu1j", "score": "2", "subreddit": "HomeDecorating", "subreddit_id": "t5_2t8de"}, {"author": "Fruit_Milk", "body": "The entire Everything, Everywhere, All At Once movie.", "created_utc": "1652293399.0", "edited": "False", "id": "i87sk41", "is_submitter": "False", "link_id": "t3_un62oy", "parent_id": "t3_un62oy", "score": "1", "subreddit": "ADHD", "subreddit_id": "t5_2qnwb"}, {"author": "Fruit_Milk", "body": "Looks like they drank the kool-aid 🥲", "created_utc": "1652076337.0", "edited": "False", "id": "i7w1174", "is_submitter": "False", "link_id": "t3_uljiim", "parent_id": "t3_uljiim", "score": "1", "subreddit": "Damnthatsinteresting", "subreddit_id": "t5_2xxyj"}, {"author": "Fruit_Milk", "body": "A sausage and egg croissant with ketchup was my go-to breakfast for the past week, until I ran out and was extremely grateful because I realized I was already getting sick of it. Made me so sad because I had really enjoyed making it every morning", "created_utc": "1651684315.0", "edited": "False", "id": "i7bcdyl", "is_submitter": "False", "link_id": "t3_uhy9x9", "parent_id": "t3_uhy9x9", "score": "1", "subreddit": "adhdwomen", "subreddit_id": "t5_31aao"}, {"author": "Fruit_Milk", "body": "There is a group of 3-4 raccoons that live in a tree in my backyard. My dog refuses to go to the bathroom when they're there at night and barks up a storm, she's terrified of them. It's a mess lol", "created_utc": "1651602681.0", "edited": "False", "id": "i76xbwm", "is_submitter": "False", "link_id": "t3_uh5ae6", "parent_id": "t1_i743abs", "score": "13", "subreddit": "husky", "subreddit_id": "t5_2roay"}, {"author": "Fruit_Milk", "body": "[Dara at Coachella; no way this would fly in this day with ggs lolol](https://images.app.goo.gl/CGA4o59QDqy68Szw9)", "created_utc": "1651585916.0", "edited": "False", "id": "i75rci7", "is_submitter": "False", "link_id": "t3_ugxxvr", "parent_id": "t1_i75qut2", "score": "2", "subreddit": "kpopthoughts", "subreddit_id": "t5_2730wn"}, {"author": "Fruit_Milk", "body": "I feel like the concept is still unique to 2NE1 and I haven't seen anything quite like it in ggs since. 2NE1 does feel more badass and authentic, BP feels like girlcrush but I wouldn't say badass. I really can't see BP or any new gen groups trying to do this without it coming off as inauthentic and tryhard. It just works with 2NE1 imo, there's some level of maturity there that I feel is lacking in newer ggs. It just kinda comes off as \"aw how cute/pretty\" when BP does it where it almost seems like 2NE1s concept was more of rejecting some of the typical \"pretty\" style and act. I mean, look at some of the hairstyles Dara sported in I am the Best, those aren't exactly flattering but more for effect and \"idgaf\". They really feel in their element", "created_utc": "1651585705.0", "edited": "False", "id": "i75qut2", "is_submitter": "False", "link_id": "t3_ugxxvr", "parent_id": "t1_i73fep4", "score": "1", "subreddit": "kpopthoughts", "subreddit_id": "t5_2730wn"}, {"author": "Fruit_Milk", "body": "The scariest part of that is probably the money spent to get that good of a seat only for it to be wasted 🥹", "created_utc": "1650902296.0", "edited": "False", "id": "i657lhg", "is_submitter": "False", "link_id": "t3_ubh5bj", "parent_id": "t1_i6422gd", "score": "8", "subreddit": "kpopthoughts", "subreddit_id": "t5_2730wn"}, {"author": "Fruit_Milk", "body": "Wow, I feel so stupid LOL. Thanks y'all!!", "created_utc": "1650852603.0", "edited": "False", "id": "i62uv4m", "is_submitter": "True", "link_id": "t3_uba89f", "parent_id": "t1_i62uiu7", "score": "2", "subreddit": "runefactory", "subreddit_id": "t5_2tkdl"}, {"author": "Fruit_Milk", "body": "Parts of Sticker from NCT remind me of Exo, specifically kokobop era for some reason", "created_utc": "1650703220.0", "edited": "False", "id": "i5uuv1a", "is_submitter": "False", "link_id": "t3_u54dku", "parent_id": "t3_u54dku", "score": "1", "subreddit": "kpopthoughts", "subreddit_id": "t5_2730wn"}, {"author": "Fruit_Milk", "body": "The amount of times I tried destroying them when I first encountered them was embarrassing really 🥹", "created_utc": "1648870149.0", "edited": "False", "id": "i32h1ej", "is_submitter": "True", "link_id": "t3_tu4f3f", "parent_id": "t1_i31vx2w", "score": "2", "subreddit": "runefactory", "subreddit_id": "t5_2tkdl"}, {"author": "Fruit_Milk", "body": "Conspiracy theories, it's so easy to go down the rabbit hole of them. Although I don't believe in a majority of them, I end up finding a lot of weird communities and seeing why they think certain things. I've watched entire documentaries on them. \n\nTrue crime, even though it makes me so scared in the real world lol. Cult stuff, the supernatural. \n\nWikipedia articles on...everything really. I'll end up looking for an actor or something and somehow I'm looking at a random device from the 1900s. \n\nThe biography of every single Nintendo CEO in order. I went in knowing nothing; came out knowing everything lmao. I'm not even particularly interested in Nintendo. \n\nARGs. \n\nI think really, anything that has a lot of speculation, different \"sources\" and references, are prime rabbit hole material for me. I can spend hours poring over details I might have missed or trying to figure out why something happened.", "created_utc": "1648830786.0", "edited": "False", "id": "i302esr", "is_submitter": "False", "link_id": "t3_tt5vi5", "parent_id": "t3_tt5vi5", "score": "1", "subreddit": "ADHD", "subreddit_id": "t5_2qnwb"}, {"author": "Fruit_Milk", "body": "I was thinking the same! Like a little forest village with different creatures. I would definitely do some Studio Ghibli style stuff hehe.", "created_utc": "1648425491.0", "edited": "False", "id": "i2djjvj", "is_submitter": "False", "link_id": "t3_tprinn", "parent_id": "t1_i2d67o9", "score": "8", "subreddit": "femalelivingspace", "subreddit_id": "t5_2vcz8"}, {"author": "Fruit_Milk", "body": "Wow, this looks so pretty. So jealous of the sunlight you have! Also that couch color is just gorgeous with the green of the plants!!", "created_utc": "1648423944.0", "edited": "False", "id": "i2dgb6k", "is_submitter": "False", "link_id": "t3_tpst9x", "parent_id": "t3_tpst9x", "score": "6", "subreddit": "HomeDecorating", "subreddit_id": "t5_2t8de"}, {"author": "Fruit_Milk", "body": "Huge difference! Love it, looks very cozy. I think some candles if you're into those would make it even cozier!", "created_utc": "1648423779.0", "edited": "False", "id": "i2dfypo", "is_submitter": "False", "link_id": "t3_tpp8al", "parent_id": "t3_tpp8al", "score": "1", "subreddit": "HomeDecorating", "subreddit_id": "t5_2t8de"}, {"author": "Fruit_Milk", "body": "Thanks for all the amazing suggestions everyone!! Here's a little mockup I did. I did end up moving the couch up quite a bit (although the picture here uses an older pic where it's not). Added a console table and some other stuff to balance out everything. \n\nhttps://pasteboard.co/xo36GNycttSG.png", "created_utc": "1647793298.0", "edited": "False", "id": "i1f32vv", "is_submitter": "True", "link_id": "t3_ti3fyr", "parent_id": "t3_ti3fyr", "score": "1", "subreddit": "HomeDecorating", "subreddit_id": "t5_2t8de"}, {"author": "Fruit_Milk", "body": "Oh this is perfect! Thanks for the link!!", "created_utc": "1647792388.0", "edited": "False", "id": "i1f0v5x", "is_submitter": "True", "link_id": "t3_ti3fyr", "parent_id": "t1_i1cvi46", "score": "2", "subreddit": "HomeDecorating", "subreddit_id": "t5_2t8de"}, {"author": "Fruit_Milk", "body": "Adding height on top of the console table sounds like it would do a great job 🙂", "created_utc": "1647792370.0", "edited": "False", "id": "i1f0tlo", "is_submitter": "True", "link_id": "t3_ti3fyr", "parent_id": "t1_i1c96g1", "score": "2", "subreddit": "HomeDecorating", "subreddit_id": "t5_2t8de"}, {"author": "Fruit_Milk", "body": "Great point about the wall mattering less like this. Definitely did the trick 🙂", "created_utc": "1647792203.0", "edited": "False", "id": "i1f0f41", "is_submitter": "True", "link_id": "t3_ti3fyr", "parent_id": "t1_i1eiqha", "score": "2", "subreddit": "HomeDecorating", "subreddit_id": "t5_2t8de"}, {"author": "Fruit_Milk", "body": "I think because I haven't really had furniture in a larger space before, haha. I've mostly lived in small apartments where the only choice was against the wall, and I haven't had many opportunities to actually try out space behind it or adding more furniture to a space. \n\nI actually moved up the couch since everyone suggested it and it feels so much more cozier! The thought just never occurred to me honestly, how funny is that? 😆", "created_utc": "1647792138.0", "edited": "False", "id": "i1f098q", "is_submitter": "True", "link_id": "t3_ti3fyr", "parent_id": "t1_i1bpj3p", "score": "1", "subreddit": "HomeDecorating", "subreddit_id": "t5_2t8de"}, {"author": "Fruit_Milk", "body": "Hi! So I've been trying to figure out what to do with this space because it's so awkward. The half-wall leaves an empty space behind half of the couch that just looks awkward. I've been trying to figure out what to put there but can't figure out what would look best.\n\nThe sofa absolutely must be there; my partner and I use the TV every day for movies, video games, etc. If we were to move the sofa, it wouldn't be centered to the TV and would cause some neck strain and generally be uncomfortable. \n\nI was considering a room divider of some sort but it felt like it might look a bit tacky? I was also looking at bookcases to make something for the entryway but it might look weird with the back facing the couch. A console table might not help fill the back of the space I'm trying to fill...not sure what to do. \n\nI live in a rental so I can't do too much besides putting in furniture. Any advice is greatly appreciated!", "created_utc": "1647720166.0", "edited": "False", "id": "i1bip9a", "is_submitter": "True", "link_id": "t3_ti3fyr", "parent_id": "t3_ti3fyr", "score": "0", "subreddit": "HomeDecorating", "subreddit_id": "t5_2t8de"}, {"author": "Fruit_Milk", "body": "Soooo gorgeous! I love how well it works with the color of the wood too", "created_utc": "1647450554.0", "edited": "False", "id": "i0wner8", "is_submitter": "False", "link_id": "t3_tfjysd", "parent_id": "t3_tfjysd", "score": "1", "subreddit": "HomeDecorating", "subreddit_id": "t5_2t8de"}, {"author": "Fruit_Milk", "body": "Thanks SO MUCH for all the help and advice guys! I ended up buying 1 chair, moving the ottoman. I also bought a rug! Will post update pictures when the other stuff comes in :)", "created_utc": "1647385284.0", "edited": "False", "id": "i0tapr6", "is_submitter": "True", "link_id": "t3_tdh5vw", "parent_id": "t3_tdh5vw", "score": "1", "subreddit": "HomeDecorating", "subreddit_id": "t5_2t8de"}, {"author": "Fruit_Milk", "body": "Oh that's odd! It's in a separate comment, but here are the links:\n\n[https://www.ikea.com/ca/en/p/ulriksberg-armchair-rattan-anthracite-90434310/](https://www.ikea.com/ca/en/p/ulriksberg-armchair-rattan-anthracite-90434310/)  \n\n\n[https://www.structube.com/en\\_ca/serbi-rattan-and-teak-wood-accent-chair-77-25-15-42?pid=26134](https://www.structube.com/en_ca/serbi-rattan-and-teak-wood-accent-chair-77-25-15-42?pid=26134)", "created_utc": "1647211510.0", "edited": "False", "id": "i0jqlpc", "is_submitter": "True", "link_id": "t3_tdh5vw", "parent_id": "t1_i0jq0ve", "score": "1", "subreddit": "HomeDecorating", "subreddit_id": "t5_2t8de"}, {"author": "Fruit_Milk", "body": "Thanks so much! Yeah, I've been on the hunt for a coffee table 🙂 Do you have an opinion on which chair would look better in the space? (I linked it in my comment)", "created_utc": "1647210685.0", "edited": "False", "id": "i0jooak", "is_submitter": "True", "link_id": "t3_tdh5vw", "parent_id": "t1_i0jkhtk", "score": "1", "subreddit": "HomeDecorating", "subreddit_id": "t5_2t8de"}, {"author": "Fruit_Milk", "body": "Hi! I'm currently triyng to style my living room in the Japandi style. I'm purchasing furniture and not sure whether it would look better with 2 chairs or 1. I don't know if  \n it might look too crowded with 2 chairs? I'd put them under the window probably.\n\nThinking of getting 2 of these: [https://www.ikea.com/ca/en/p/ulriksberg-armchair-rattan-anthracite-90434310/](https://www.ikea.com/ca/en/p/ulriksberg-armchair-rattan-anthracite-90434310/)\n\nOr 1 of these: [https://www.structube.com/en\\_ca/serbi-rattan-and-teak-wood-accent-chair-77-25-15-42?pid=26134](https://www.structube.com/en_ca/serbi-rattan-and-teak-wood-accent-chair-77-25-15-42?pid=26134)\n\nTo get a better idea of the style I'm going for:\n\nI'm also getting a couple of these floor seats for extra seating: [https://www.aliexpress.com/item/1005003170302057.html?spm=a2g0o.cart.0.0.7eae3c00RlTNtx&mp=1](https://www.aliexpress.com/item/1005003170302057.html?spm=a2g0o.cart.0.0.7eae3c00RlTNtx&mp=1)\n\nAlong with this carpet: [https://www.ikea.com/ca/en/p/sporup-rug-low-pile-light-beige-30453448/](https://www.ikea.com/ca/en/p/sporup-rug-low-pile-light-beige-30453448/)\n\nThanks for any help/advice anyone can offer!", "created_utc": "1647207526.0", "edited": "False", "id": "i0jha5s", "is_submitter": "True", "link_id": "t3_tdh5vw", "parent_id": "t3_tdh5vw", "score": "1", "subreddit": "HomeDecorating", "subreddit_id": "t5_2t8de"}, {"author": "Fruit_Milk", "body": "I do my normal showers at night and if I have to wash my hair, I will do it in the morning/earlier in the day.", "created_utc": "1646332511.0", "edited": "False", "id": "hz7qzzg", "is_submitter": "False", "link_id": "t3_t5e5yi", "parent_id": "t1_hz6x0yg", "score": "6", "subreddit": "adhdwomen", "subreddit_id": "t5_31aao"}, {"author": "Fruit_Milk", "body": "Oh man, when you said \"trying not to be neurotypical\" that really resonated with me. I was diagnosed about a year ago and through this journey of understanding myself I've really just come to terms with the fact that there are things I will just have to do MY way, even if it means going against what others typically do. It's definitely always been a bit of a fight within myself feeling bad I'm doing things the \"wrong way\". Acceptance has definitely improved my life and how I view myself and let's me lean into things that improve my life. Even if it means my partner has a bit of a giggle sometimes, haha.", "created_utc": "1646328443.0", "edited": "False", "id": "hz7g9al", "is_submitter": "False", "link_id": "t3_t59dim", "parent_id": "t1_hz3qed1", "score": "2", "subreddit": "adhdwomen", "subreddit_id": "t5_31aao"}, {"author": "Fruit_Milk", "body": "Yup! It's a long parka that goes past my knees, it's a Uniqlo heatech parka! Very warm ☺️", "created_utc": "1637275706.0", "edited": "False", "id": "hl6jc1r", "is_submitter": "True", "link_id": "t3_pmm61h", "parent_id": "t1_hl54gk9", "score": "1", "subreddit": "femalefashionadvice", "subreddit_id": "t5_2s8o5"}, {"author": "Fruit_Milk", "body": "Pretty much all of the comments people made here worked for me! I think what flatters me the most is deep cut shirts, cropped sweater with v neck. Also something I haven't seen mentioned, I like to wear a parka (I'm in a very cold region) so I don't have to layer underneath and get to look cute when I go indoors but still stay warm outside LOL. The wrap style clothing options are great too.", "created_utc": "1636918923.0", "edited": "False", "id": "hkmk1f1", "is_submitter": "True", "link_id": "t3_pmm61h", "parent_id": "t1_hk7e4cw", "score": "2", "subreddit": "femalefashionadvice", "subreddit_id": "t5_2s8o5"}, {"author": "Fruit_Milk", "body": "Must be a compliment! I see the little cafe-looking setup in the corner; she must love your coffee 🤗", "created_utc": "1636338197.0", "edited": "False", "id": "hjr85f0", "is_submitter": "False", "link_id": "t3_qp0gd9", "parent_id": "t3_qp0gd9", "score": "31", "subreddit": "ac_newhorizons", "subreddit_id": "t5_13014w"}, {"author": "Fruit_Milk", "body": "So cute! Now you have to put Cherry next door and they can be fruit neighbors 😌", "created_utc": "1636338088.0", "edited": "False", "id": "hjr7xae", "is_submitter": "False", "link_id": "t3_qovrwe", "parent_id": "t3_qovrwe", "score": "2", "subreddit": "ac_newhorizons", "subreddit_id": "t5_13014w"}, {"author": "Fruit_Milk", "body": "Do paths / custom paths / custom designs on the ground, as paintings, etc. count towards the island rating in anyway positively / negatively?", "created_utc": "1636337970.0", "edited": "False", "id": "hjr7o6j", "is_submitter": "False", "link_id": "t3_qkwjzk", "parent_id": "t3_qkwjzk", "score": "1", "subreddit": "ac_newhorizons", "subreddit_id": "t5_13014w"}, {"author": "Fruit_Milk", "body": "With Teacher Lottie as a substitute! 🙂", "created_utc": "1636337822.0", "edited": "False", "id": "hjr7cnf", "is_submitter": "True", "link_id": "t3_qp3qto", "parent_id": "t3_qp3qto", "score": "1", "subreddit": "ac_newhorizons", "subreddit_id": "t5_13014w"}, {"author": "Fruit_Milk", "body": "Is your island 3 stars and did you have K.K come to your town already? I also was completely missing all the cooking stuff. Turns out I had to wait the day after he came for it to show up.", "created_utc": "1636337680.0", "edited": "False", "id": "hjr71wz", "is_submitter": "False", "link_id": "t3_qp3ann", "parent_id": "t3_qp3ann", "score": "3", "subreddit": "ac_newhorizons", "subreddit_id": "t5_13014w"}, {"author": "Fruit_Milk", "body": "Update: Looks like I had to wait the day after K.K Slider came to my town! The cooking stuff is available for me now.", "created_utc": "1636134419.0", "edited": "False", "id": "hjfxqbr", "is_submitter": "False", "link_id": "t3_qmwkm6", "parent_id": "t1_hjd6nux", "score": "2", "subreddit": "ac_newhorizons", "subreddit_id": "t5_13014w"}, {"author": "Fruit_Milk", "body": "Would love an answer to this too. My island is 3 stars, K.K just came to my island today, idk what else to do lol.", "created_utc": "1636078417.0", "edited": "False", "id": "hjd6nux", "is_submitter": "False", "link_id": "t3_qmwkm6", "parent_id": "t3_qmwkm6", "score": "2", "subreddit": "ac_newhorizons", "subreddit_id": "t5_13014w"}, {"author": "Fruit_Milk", "body": "I'm 3 stars and didn't get the cooking recipes :/", "created_utc": "1636065831.0", "edited": "False", "id": "hjcdxjr", "is_submitter": "False", "link_id": "t3_qmaxfv", "parent_id": "t1_hj8mx1p", "score": "1", "subreddit": "ac_newhorizons", "subreddit_id": "t5_13014w"}, {"author": "Fruit_Milk", "body": "Nookea is an app that has exactly what you're looking for! It shows items, custom designs, etc and they have a cottagecore section! 🙂", "created_utc": "1636064550.0", "edited": "False", "id": "hjcav6u", "is_submitter": "False", "link_id": "t3_qmw5fp", "parent_id": "t3_qmw5fp", "score": "4", "subreddit": "ac_newhorizons", "subreddit_id": "t5_13014w"}, {"author": "Fruit_Milk", "body": "Flip is in boxes! DM me if you'd like to take him 🙂", "created_utc": "1636043513.0", "edited": "False", "id": "hjath3q", "is_submitter": "False", "link_id": "t3_ootun8", "parent_id": "t3_ootun8", "score": "2", "subreddit": "ac_newhorizons", "subreddit_id": "t5_13014w"}, {"author": "Fruit_Milk", "body": "Aw, yeah :/ I studied Korean and Japanese in the past and found some great resources that I feel Mandarin learners don't have. \n\nI'm not quite ready for language exchange I think, as I'm around hsk level 1, so I just wanted a way to practice simple conversations where I know the script somewhat and I know the vocab is more controlled haha.", "created_utc": "1632754977.0", "edited": "False", "id": "heh8zok", "is_submitter": "True", "link_id": "t3_pvguqp", "parent_id": "t1_hea3smx", "score": "1", "subreddit": "ChineseLanguage", "subreddit_id": "t5_2qyz1"}, {"author": "Fruit_Milk", "body": "Good tips! I'm on the lookout for some sweater dresses, looks like I might have to go online or wait until it gets a little colder as I wasn't able to find any this weekend :( \n\nThe ribbed/cropped idea is great, I do think that would look good on me, especially since I'm shorter haha. \n\nI actually just bought a moto jacket after reading this and it looks AMAZING! I also bought a belted coat.\n\nThanks for your help and advice!! :)", "created_utc": "1631638351.0", "edited": "False", "id": "hcu96jk", "is_submitter": "True", "link_id": "t3_pmm61h", "parent_id": "t1_hcjgqas", "score": "1", "subreddit": "femalefashionadvice", "subreddit_id": "t5_2s8o5"}, {"author": "Fruit_Milk", "body": "Good tips! I bought some fleece tights so I can wear skirts in the colder weather, never thought about that! I do have a long wool skirt that looks good on me so I'll keep looking for similar ones and try A-line as well! On the lookout for some knee high boots as well.\n\nI'm planning on going to Banana Republic sometime as well, I've heard some good things about that brand for us hourglass shorties haha. \n\nThanks for your help!!", "created_utc": "1631638201.0", "edited": "False", "id": "hcu8t3y", "is_submitter": "True", "link_id": "t3_pmm61h", "parent_id": "t1_hcjk8d0", "score": "2", "subreddit": "femalefashionadvice", "subreddit_id": "t5_2s8o5"}, {"author": "Fruit_Milk", "body": "Thank you!! ♥️ \n\nI actually just went shopping and bought a few things from your list, they looked AMAZING on me! My eyes are open now hahaha.", "created_utc": "1631638030.0", "edited": "False", "id": "hcu8dkg", "is_submitter": "True", "link_id": "t3_pmm61h", "parent_id": "t1_hcj6jq9", "score": "3", "subreddit": "femalefashionadvice", "subreddit_id": "t5_2s8o5"}, {"author": "Fruit_Milk", "body": "Awesome news!!", "created_utc": "1625612031.0", "edited": "False", "id": "h4aiief", "is_submitter": "False", "link_id": "t3_oejcw3", "parent_id": "t1_h4aiflp", "score": "2", "subreddit": "runefactory", "subreddit_id": "t5_2tkdl"}, {"author": "Fruit_Milk", "body": "The fact that gaining recipes from bread is like a toss-up, in that it doesn't tell you when you'll actually gain a recipe or not from it. Would love some kind of \"you've unlocked a new recipe\" notification if you level up your cooking/forging etc enough to gain something. I'm always grinding and hoping it's enough to unlock something, only to be surprised with the annoying \"HUH? I DIDN'T LEARN ANYTHING\" dialogue after eating recipe bread. I know you can just go on the wiki and see what levels stuff is unlocked at, but it seems like a real UX flaw to not include that notification in-game.\n\nThe inventory space in the backpack doesn't have an upgrade option. It's so easy to run out of space when you're out on an adventure and annoying to then have to stop to go back home and dump it into your storage lol. You can upgrade your chest and fridge, as well as others like your room and field, so I feel like it makes sense.\n\nThe lack of simple back buttons that don't completely make you restart dialogue by closing out on you (buying recipe bread and canceling takes you out of the convo, for example).\n\nLack of a \"Title menu\" or \"Load\" option. If I want to load one of my save slots I have to restart the entire device.", "created_utc": "1625599781.0", "edited": "1625600127.0", "id": "h49ryz5", "is_submitter": "False", "link_id": "t3_oejcw3", "parent_id": "t3_oejcw3", "score": "9", "subreddit": "runefactory", "subreddit_id": "t5_2tkdl"}, {"author": "Fruit_Milk", "body": "Also on the furniture note, the lack of ability to rotate anything. It's all in the same orientation.", "created_utc": "1625599528.0", "edited": "False", "id": "h49rezj", "is_submitter": "False", "link_id": "t3_oejcw3", "parent_id": "t1_h48kg5n", "score": "5", "subreddit": "runefactory", "subreddit_id": "t5_2tkdl"}, {"author": "Fruit_Milk", "body": "I've taken everyone's feedback and am working on it some more. Verry helpful. Some of the comments about the last couple gave me some laughs too, haha. Something in the design isn't working if people see things I don't intend for them to see! ;)\n\nThanks for all of the feedback everyone!", "created_utc": "1615014560.0", "edited": "False", "id": "gpvqaxn", "is_submitter": "False", "link_id": "t3_lynno1", "parent_id": "t3_lynno1", "score": "3", "subreddit": "logodesign", "subreddit_id": "t5_2s4v6"}, {"author": "Fruit_Milk", "body": "I think I agree, I just realized how much of the graphic the leaves take up! One of my worries was differentiating it from a flower vs cotton, so that might help. \n\nThanks for the feedback 🙂", "created_utc": "1614989313.0", "edited": "False", "id": "gpu0of8", "is_submitter": "False", "link_id": "t3_lynno1", "parent_id": "t1_gptztvd", "score": "3", "subreddit": "logodesign", "subreddit_id": "t5_2s4v6"}, {"author": "Fruit_Milk", "body": "I agree; so much to work with and lots of room for creativity with this name! I would hate to see all of the options wittled down to something that could go for any generic company :(", "created_utc": "1614987799.0", "edited": "False", "id": "gptxvcg", "is_submitter": "False", "link_id": "t3_lyofkc", "parent_id": "t1_gptupx3", "score": "5", "subreddit": "logodesign", "subreddit_id": "t5_2s4v6"}, {"author": "Fruit_Milk", "body": "I think the tires could be simplified down even more to the simple shape rather than having those rugged indents- they're such a tiny detail that it gets lost anyway, especially if this were to be shrunken down even more. I also think it would help the whole bike become more cohesive overall, since the other shapes are also basic shapes without much detail.\n\nAs for the background, I agree with the other comments about the trees and everything being too detailed. I think a good middleground could be removing the extra detail (like you already have with the rest of the bike) and making the trees just a solid block of color. You could keep the mountain shadows at the top, I think that still fits in pretty well.\n\nLastly, I like the texture you have on the type, but I'm not sure it fits in with the logo since that's the only place you see it (the type and picture could feel a little disjointed). I think the acronym is too long; no one can pronounce it, and I'm not sure people would say the letters either. I'm sure for the demographic it's not a problem of recognizing what it stands for, but more of practicality; at the end of the day, I think they're still going to just say \"oh, I really like St. Louis Mountain Biking\" rather than saying \"I like S-T-L-M--T-B\". I think just keeping the full length of the words and stacking it could be more effective and practical than having the acronym, especially since there's a lot going on in the image already.\n\nOverall, I think some tweaks could help, but it already looks really nice!", "created_utc": "1614987663.0", "edited": "False", "id": "gptxmc0", "is_submitter": "False", "link_id": "t3_lxufit", "parent_id": "t3_lxufit", "score": "1", "subreddit": "logodesign", "subreddit_id": "t5_2s4v6"}, {"author": "Fruit_Milk", "body": "Wow wow wow, this is amazing! I think you have a very cohesive style throughout this.\n\nI agree with what was said about the \"B\"; I would really love to see that in the spotlight more. It's so strong and I could see that being the mark when used alone, rather than the flower. I think having the \"bright beauty\" by itself as a logotype would be very effective; you still have enough of that heart in the b (and a lovely shape for the letterform itself) to be strong by itself.\n\nNot sure about the typeface for \"beauty\" under it, the y feels a little off. Maybe you can edit it a bit to align it more, or change it altogether? I understand the fun, \"patchwork\" kind of feel I get from some of the stickers, and I love that and think it's fine, but it feels a bit out of place in this.\n\nOverall, love love loveeee. The stickers are probably my favorite part!", "created_utc": "1614985546.0", "edited": "False", "id": "gpttmgc", "is_submitter": "False", "link_id": "t3_ly25pp", "parent_id": "t3_ly25pp", "score": "1", "subreddit": "design_critiques", "subreddit_id": "t5_2roqr"}, {"author": "Fruit_Milk", "body": "I agree with everything said here! I know when I was working on something similar for a cover (coincidentally, also with sand), I found it really helpful to add another layer of like, sprinkled sand over, so it's not just a solid layer of sand. Having stuff peek out could help by erasing some of the sand and making some hard edges with shadows. If you can find some kind of asset like that (or maybe make your own) that might be helpful!", "created_utc": "1614985170.0", "edited": "False", "id": "gptswmv", "is_submitter": "False", "link_id": "t3_lymz97", "parent_id": "t1_gptr17s", "score": "6", "subreddit": "design_critiques", "subreddit_id": "t5_2roqr"}, {"author": "Fruit_Milk", "body": "I think it's a cool concept, but I worry about readability. The \"tea\" was a little hard to read, and I'm not sure why the \"bubble\" is on a curve; I don't think that's necessary (it also feels like an afterthought).\n\nDoes the shop have a name? What makes this shop unique and different from other bubble tea shops? What is its personality? I think starting with that could help you in making it simpler and really highlight the brand. Right now, I have no idea what this brand stands for or what it's like. I think you have some good ideas you could incorporate with the brand image to really show that off and help with the rebrand.", "created_utc": "1614982714.0", "edited": "1614983945.0", "id": "gpto5cl", "is_submitter": "False", "link_id": "t3_luwdbt", "parent_id": "t3_luwdbt", "score": "1", "subreddit": "Logo_Critique", "subreddit_id": "t5_2soc0"}, {"author": "Fruit_Milk", "body": "So excited and happy for you! Sooo fun and addicting, and calming, and ergh. Welcome to the fam haha", "created_utc": "1612730277.0", "edited": "False", "id": "gmi3vbk", "is_submitter": "False", "link_id": "t3_lehh7c", "parent_id": "t3_lehh7c", "score": "2", "subreddit": "runefactory", "subreddit_id": "t5_2tkdl"}, {"author": "Fruit_Milk", "body": "Looks great already! Maybe consider adding some stuff to personalize it and make it more \"you\"? :)", "created_utc": "1611950957.0", "edited": "False", "id": "gla77tq", "is_submitter": "False", "link_id": "t3_l7cof9", "parent_id": "t3_l7cof9", "score": "1", "subreddit": "battlestations", "subreddit_id": "t5_2rdbn"}, {"author": "Fruit_Milk", "body": "Your mousepad is so cute!", "created_utc": "1611948000.0", "edited": "False", "id": "gl9ypbz", "is_submitter": "False", "link_id": "t3_l7czai", "parent_id": "t3_l7czai", "score": "1", "subreddit": "battlestations", "subreddit_id": "t5_2rdbn"}]