[{"author": "frustratedlady15", "body": "I took some agency work in hotel housekeeping (UK) - I’ve done Novotel and Premier Inn. Idk if its in the US, but novotel is a chain of 4 star ‘business’ kinda hotels, premier inn is maybe 2/3 star (based on location). Its demographic is business travellers and also people travelling for holidays. \n\nnever went back to Novotel but went back to Premier Inn several times - housekeeping work generally sucks, but at novotel they wanted us to do 40 rooms in an 8 hour shift, was during covid lockdown and we werent even told to exchange/wash the cups/mugs, just wipe them down with water and pillowcase (even if there was lipstick on the glass). \n\nAt premier inn, my list was like 18 rooms for an 8 hour shift. Glasses and cups were always exchanged. Premier Inn was 100% cleaner than novotel, although both hotels were changing bed linen, towels etc. between every guest. \n\nGranted, premier inn is one of the nicer ‘budget’ UK hotel chains, but i was totally shocked about novotel being gross, its marketed as a ‘fancier’ option for an exec/business traveller. \n\nIn general though, i wouldnt stay at a hotel if there was a single review saying bedbugs/dirty bedding.", "created_utc": "1666506411.0", "edited": "False", "id": "itffa9p", "is_submitter": "False", "link_id": "t3_yb2mbb", "parent_id": "t1_itejxcg", "score": "5", "subreddit": "Frugal", "subreddit_id": "t5_2qhbe"}, {"author": "frustratedlady15", "body": "Agreed", "created_utc": "1665382591.0", "edited": "False", "id": "irqd4ob", "is_submitter": "False", "link_id": "t3_xzt24d", "parent_id": "t1_iro60sb", "score": "-1", "subreddit": "PetiteFashionAdvice", "subreddit_id": "t5_34m7m"}, {"author": "frustratedlady15", "body": "When I try to find UK gov information or nhs stuff it always defaults to american shit even if i add ‘uk’ or ‘nhs’ to the beginning/end. Im yankphobic at this point. Just show me information relevant to the specified geographical area !!!", "created_utc": "1665381868.0", "edited": "False", "id": "irqc7mr", "is_submitter": "False", "link_id": "t3_xzs2yx", "parent_id": "t3_xzs2yx", "score": "45", "subreddit": "USdefaultism", "subreddit_id": "t5_2ns55u"}, {"author": "frustratedlady15", "body": "And the feminine counterpart; Вера Ивановна", "created_utc": "1665159897.0", "edited": "False", "id": "irf4ga0", "is_submitter": "False", "link_id": "t3_xxwhg4", "parent_id": "t1_irep56f", "score": "5", "subreddit": "russian", "subreddit_id": "t5_2qlc6"}, {"author": "frustratedlady15", "body": "This is a ridiculous and unrealistic suggestion. Come on", "created_utc": "1663779873.0", "edited": "False", "id": "ipcrejn", "is_submitter": "False", "link_id": "t3_xjjbqv", "parent_id": "t1_ip9608j", "score": "1", "subreddit": "AskUK", "subreddit_id": "t5_2t4s3"}, {"author": "frustratedlady15", "body": "Brown, beige, greige, grey. Wall to wall carpet. My current (otherwise beautiful) rental place has wall to wall brown carpet in all but two rooms (kitchen, bathroom) and i fucking hate it. I have two cats and I love colour. I’m making [progress](https://imgur.com/a/V28kTxV). Still waiting for my art and other stuff to arrive", "created_utc": "1663602415.0", "edited": "False", "id": "ip2s8vg", "is_submitter": "False", "link_id": "t3_xhz44j", "parent_id": "t3_xhz44j", "score": "5", "subreddit": "HomeDecorating", "subreddit_id": "t5_2t8de"}, {"author": "frustratedlady15", "body": "In the UK, a net curtain is a very dated style of sheer curtain that people put up under their real curtains for privacy. Sometimes they are patterned. Say ‘net curtains’ in the UK and a [very specific kind of old lady curtains](https://imgur.com/a/UTVHEpY) comes to mind.", "created_utc": "1663601912.0", "edited": "False", "id": "ip2qypr", "is_submitter": "False", "link_id": "t3_xhz44j", "parent_id": "t1_ip23bjv", "score": "3", "subreddit": "HomeDecorating", "subreddit_id": "t5_2t8de"}, {"author": "frustratedlady15", "body": "Definitely looks more modern. Well done! Idk if I’m the only one but i actually love it before, I would have made some changes and refreshed it but the layout was unique and it looked bigger before. However, this is HOME decorating and its your home :) congrats", "created_utc": "1663601304.0", "edited": "False", "id": "ip2pfs8", "is_submitter": "False", "link_id": "t3_xi424n", "parent_id": "t3_xi424n", "score": "32", "subreddit": "HomeDecorating", "subreddit_id": "t5_2t8de"}, {"author": "frustratedlady15", "body": "All boobs sag irrespective of whether you wear a bra. I have implants and contrary to popular belief, they will sag too. Its gravity. Unless they invent an anti gravity bra, its not gonna prevent sagging", "created_utc": "1663326298.0", "edited": "False", "id": "ionf3mf", "is_submitter": "False", "link_id": "t3_xffm3r", "parent_id": "t3_xffm3r", "score": "1", "subreddit": "badwomensanatomy", "subreddit_id": "t5_2zlzd"}, {"author": "frustratedlady15", "body": "Dover", "created_utc": "1661892858.0", "edited": "False", "id": "imfqbao", "is_submitter": "False", "link_id": "t3_x1pkgp", "parent_id": "t3_x1pkgp", "score": "8", "subreddit": "AskUK", "subreddit_id": "t5_2t4s3"}, {"author": "frustratedlady15", "body": "Nobody uses bunsen burners anymore (in medical/biochemical labs) we use a heating mantle instead. The hair down thing is due to cross contamination. Its even more important when your endpoints are related to DNA damage, as is often the case in cancer research. (Source: my bsc medical biochemistry with cancer research lab experience) 🤓", "created_utc": "1661892589.0", "edited": "False", "id": "imfplss", "is_submitter": "False", "link_id": "t3_x1re0r", "parent_id": "t1_imfer2d", "score": "46", "subreddit": "gymsnark", "subreddit_id": "t5_3jnvp5"}, {"author": "frustratedlady15", "body": "The romanisation of cyrillic will always be difficult because the letters of the latin alphabet (esp. in english) can be pronounced so many different ways. Of course this is also true for cyrillic. Idk, I understand a standardised romanisation procedure for simplicity but it leads to weird romanisations sometimes. My (bulgarian) ex had the last name стайков romanised to staykov, but i feel like the use of Y after A makes a completely different sound to how he pronounced it. I feel like sometimes ай is better romanised to ai \n\nPersonally, i think there should be a standard romanisation for a language and maybe two options for the romanisations of names. So you can choose between Sergei and Sergey etc", "created_utc": "1661257788.0", "edited": "False", "id": "ilg4fub", "is_submitter": "False", "link_id": "t3_wvlcpr", "parent_id": "t3_wvlcpr", "score": "2", "subreddit": "russian", "subreddit_id": "t5_2qlc6"}, {"author": "frustratedlady15", "body": "Its because he’s had a complete orchiectomy after there was necrosis of the other testicle. Bilateral orchiectomy results in significantly reduced testosterone levels. A bilateral orchiectomy is effectively a castration", "created_utc": "1661244718.0", "edited": "False", "id": "ilfl5r6", "is_submitter": "False", "link_id": "t3_wv8k91", "parent_id": "t1_ile01d1", "score": "2", "subreddit": "MedicalGore", "subreddit_id": "t5_2zkms"}, {"author": "frustratedlady15", "body": "It could be [church slavonic](https://en.wikipedia.org/wiki/Church_Slavonic?wprov=sfti1) which is used as a liturgical language in the eastern orthodox church. Church slavonic is a descendent of Old Church Slavonic which was where Cyrillic started being used in slavic speaking countries instead of Glagolitic alphabet!", "created_utc": "1661207850.0", "edited": "False", "id": "ildrrbz", "is_submitter": "False", "link_id": "t3_wv2h1r", "parent_id": "t1_ild1is9", "score": "8", "subreddit": "russian", "subreddit_id": "t5_2qlc6"}, {"author": "frustratedlady15", "body": "My boyfriend is from Nicaragua and I’m learning spanish because of him but he speaks english. I would estimate my french proficiency as A2. I get estimated C1 when i test reading but i dont speak or understand spoken french. Ive been learning Russian since Oct 2021. When I met my bf i thought fuck it, my large french vocab will probably help a bit, and I can definitely reach conversational level in Spanish ages before I’d reach it in Russian. Я не говорю пo-pyccки :(\n\nI wouldn’t attempt a relationship with a language barrier though. He speaks english and imo I’d be crazy not to utilise the opportunity of a close relationship with a native speaker!", "created_utc": "1660566366.0", "edited": "False", "id": "ikdhm41", "is_submitter": "False", "link_id": "t3_woorw0", "parent_id": "t3_woorw0", "score": "5", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "frustratedlady15", "body": "Most unions have lower rates for part time workers or those on low income. Im in the UK too and unionised", "created_utc": "1656164507.0", "edited": "False", "id": "idopvw2", "is_submitter": "False", "link_id": "t3_vkar9n", "parent_id": "t1_ido3rtd", "score": "1", "subreddit": "antiwork", "subreddit_id": "t5_2y77d"}, {"author": "frustratedlady15", "body": "You cant do that with flares…", "created_utc": "1655070626.0", "edited": "False", "id": "ic4un0g", "is_submitter": "False", "link_id": "t3_v97icr", "parent_id": "t1_ibx0lo3", "score": "1", "subreddit": "PetiteFashionAdvice", "subreddit_id": "t5_34m7m"}, {"author": "frustratedlady15", "body": "Everything i have ever bought from asos petite has been too long. Im 151cm", "created_utc": "1654904103.0", "edited": "False", "id": "ibwz7xl", "is_submitter": "False", "link_id": "t3_v97icr", "parent_id": "t1_ibuqh39", "score": "2", "subreddit": "PetiteFashionAdvice", "subreddit_id": "t5_34m7m"}, {"author": "frustratedlady15", "body": "Like two weeks. She is feral and put her kittens in my ex boyfriends room after a different kitten was killed by a male cat. She didn’t come back", "created_utc": "1654715744.0", "edited": "False", "id": "ibn6qf6", "is_submitter": "False", "link_id": "t3_v7peoy", "parent_id": "t1_ibm3p3c", "score": "2", "subreddit": "IllegallySmolCats", "subreddit_id": "t5_23e19j"}, {"author": "frustratedlady15", "body": "I do this with Russian as well! It’s definitely helpful for my listening skills too and if i see a frequently repeated word, I’ll learn it. I think it helps keep me ‘invested’ in learning the language too, and prevents language attrition if i’m busy and cant study for a week", "created_utc": "1654165772.0", "edited": "False", "id": "iaw9vp4", "is_submitter": "False", "link_id": "t3_v1nda4", "parent_id": "t1_iaqmhts", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "frustratedlady15", "body": "I figured its not a high security lock, as its one of two locks on an interior door. I also figured that its an extremely common lock so any locksmith should know how to open it. When the scammer came, it happened so fast i didnt have time to object. The legit locksmith said that kind of lock is so easy to open that I probably could have opened it myself with a card. Now i know", "created_utc": "1653383255.0", "edited": "False", "id": "i9sc7a3", "is_submitter": "False", "link_id": "t3_uvp8iy", "parent_id": "t1_i9qr0rn", "score": "2", "subreddit": "Locksmith", "subreddit_id": "t5_2r3oj"}, {"author": "frustratedlady15", "body": "I didnt go for the cheapest, I ignored the ones offering £39 call outs as I assumed these were scams. I selected this one as I figured £60 for a call out from a local locksmith sounded realistic, I rang a brick and mortar locksmith on my highstreet today and he said he’d charge around that amount, especially since the lock would have been so easy to pick. I now have a number for a reputable 24 hour locksmith in my area so it will not happen again. I actually traced the top 7 or 8 search results back to the directors of the scammy company. I definitely made mistakes here but their website looked really legitimate and they seemed transparent :(", "created_utc": "1653319778.0", "edited": "False", "id": "i9oyy1s", "is_submitter": "False", "link_id": "t3_uvp8iy", "parent_id": "t1_i9ogius", "score": "2", "subreddit": "Locksmith", "subreddit_id": "t5_2r3oj"}, {"author": "frustratedlady15", "body": "Thank you for your help! The repairman for my property manager came over and he was able to unlock it using my new key, but he was not a locksmith and could not pass judgement on the job done by the scammer. So you are definitely right that I accidentally deadlocked it. \n\nThe ‘locksmith’ who came yesterday drilled into the cylinder and replaced it for a cost of £114 excluding the labour. After reading about how insane that price is for a standard cylinder, I was worrying that this ‘locksmith’ might have installed the replacement incorrectly considering he was clearly not a locksmith at all. \n\nIm reporting to trading standards and I asked for a number of a reputable locksmith from my estate agent. \n\nI’ll definitely call them to ask if they can prevent it from being deadlocked again! The door has two locks and its an interior door. \n\nThanks again to you and all legitimate locksmiths on this sub!", "created_utc": "1653303537.0", "edited": "False", "id": "i9o46ae", "is_submitter": "False", "link_id": "t3_uvp8iy", "parent_id": "t1_i9nxr7v", "score": "4", "subreddit": "Locksmith", "subreddit_id": "t5_2r3oj"}]