[{"author": "frvnkhl", "body": "Suhlasim! Musim sa priznat, ze dlhodobo som porovnaval SK so zapadom (byval som v UK, Holandsku, Dansku..) a bol som z toho dost nervozny, ze ako krajina sme stale za opicami.\n\nPotom som chvilu byval v Mexiku a som si uvedomil, ze Slovensko je na tom velmi dobre. Namiesto 6dnoveho pracovneho tyzdna, mame 5dnovy. Tam, co sa povazuje za relativne dobry plat (tak €400) u nas uz zdaleka nie je taky bezny ako ked som bol decko.\n\nTiez, tym, ze na SK uz nezijem ale chodim za rodinou na vychod tak 2krat do roka uz niekolko rokov, vidim, ze sa celkova zivotna uroven zvysuje. \n\nAno, nie sme na urovni takeho Holandska a je super si z takychto krajin brat priklad. Ale zase tiez by som to u nas nevidel uplne tragicky.", "created_utc": "1667032296.0", "edited": "False", "id": "iu857rm", "is_submitter": "False", "link_id": "t3_yfvp1t", "parent_id": "t1_iu67zb5", "score": "1", "subreddit": "Slovakia", "subreddit_id": "t5_2qyjb"}, {"author": "frvnkhl", "body": "Co diskoteka, ja sa pamatam ked som mal 15 a v obchodaku som sa ani nemohol pozriet na typka z ineho sidliska bez toho aby za mnou prisiel, ci sa chcem bit.\n\nNa mojom sidlisku som dostal aj raz do drzky, lebo som proste mal na hlave klobuk. Teraz jak sa pozeram, tak este mam “stastie”, ze nie som homosexual. \n\nUz som si myslel, ze tieto casy u nas su davno prec, ale poslednu dobu si uvedomujem, ze uz som asi dlho mimo Slovenska, preto si to myslim. Dufam, ze vinnika najdu a ze taketo veci ludom nebudu prechadzat.", "created_utc": "1666950151.0", "edited": "False", "id": "iu3oyse", "is_submitter": "False", "link_id": "t3_yes2tj", "parent_id": "t1_itzwsme", "score": "2", "subreddit": "Slovakia", "subreddit_id": "t5_2qyjb"}, {"author": "frvnkhl", "body": "Ja si pamatam, ked som byval v Spanielsku posta do Brazilie (mala bublinkova obalka) isla tak ~2 tyzdne.\n\nRaz som tak do Brazilie poslal zo SK nasou postou. Poslal som obalku zaciatkom septembra a bola dorucena v strede januara a to som ju este posielal prvou triedou. 🤷🏻‍♂️", "created_utc": "1666881664.0", "edited": "False", "id": "itzsxa6", "is_submitter": "False", "link_id": "t3_yemmkz", "parent_id": "t3_yemmkz", "score": "1", "subreddit": "Slovakia", "subreddit_id": "t5_2qyjb"}, {"author": "frvnkhl", "body": "Aspon v CR v lidle maju caj, co ma napis “COLD BREW”. Su to v podstate cajove sacky, co luhujes v studenej vode a spravis si tak ladovy caj. Mne osobne chutia aj bez medu/cukru a je to aj zdravsia moznost.", "created_utc": "1666335963.0", "edited": "False", "id": "it6dbka", "is_submitter": "False", "link_id": "t3_y968ot", "parent_id": "t3_y968ot", "score": "1", "subreddit": "Slovakia", "subreddit_id": "t5_2qyjb"}, {"author": "frvnkhl", "body": "Je super, ze ti nevadia a keby mal k tomu kazdy taky postoj ako ty, tak by to nikto “nemusel pchat” druhym.\n\nA ano, mozno je Slovak zvyknuty na muz + zena vztah, tak muz + muz mu moze prist divne. Ale to este neznamena, ze sa tito ludia maju zahrabat a schovavat pred ostatnymi ak nechcu dostat od niekoho do drzky alebo pocuvat jak po nich pokrikuju.\n\nHovoris, ze ti vadi ten konflikt a tvoje riesenie je, aby tito ludia boli ticho, lebo ludia na to tu nie su zvyknuti. Sorry, ale takto sa to len zhorsi z dlhodobeho hladiska. A posledne dni len ukazuju, ze nieco sa s tym robit musi ak nechceme byt krajina, kde sa ludia budu bat byt tym, cim su.", "created_utc": "1666256442.0", "edited": "False", "id": "it1qcz3", "is_submitter": "False", "link_id": "t3_y8quto", "parent_id": "t1_it1opqp", "score": "7", "subreddit": "Slovakia", "subreddit_id": "t5_2qyjb"}, {"author": "frvnkhl", "body": "Czechia in 1992 had also around 10 million people. Slovakia around 5 and it’s left untouched.", "created_utc": "1666187314.0", "edited": "False", "id": "isxpb7a", "is_submitter": "False", "link_id": "t3_y7yr8s", "parent_id": "t1_isxny1c", "score": "1", "subreddit": "MapPorn", "subreddit_id": "t5_2si92"}, {"author": "frvnkhl", "body": "Studuje tu v Prahe. Ale spoznali sme sa tesne predtym nez sem prisla cez appku na trenovanie jazykov.\n\nOna sa chcela naucit nejake slova a frazy cesky, ja niekoho s kym mozem trenovat spanielcinu (uz predtym som vedel celkom dobre, len som chcel viac trenovat) a tak sme sa nasli. Potom sme si zacali pisat, rozumeli sme si, potom sme sa stretli a bola tam chemia, cize asi tak. 🤷🏻‍♂️", "created_utc": "1666175403.0", "edited": "False", "id": "isx4agg", "is_submitter": "False", "link_id": "t3_y7hxy4", "parent_id": "t1_iswxmgf", "score": "5", "subreddit": "czech", "subreddit_id": "t5_2qiht"}, {"author": "frvnkhl", "body": "Za mna latiny aj vyzorovo, aj povahovo. Ale konkretne krajinu asi musim povedat Peru kedze mam odtial mladu. \n\nInac co sa tyka Europy, za mna osobne by Italie a Spanielsko sedelo.. mozno by som este pridal Portugalsko. Ale zas osobne mam radsej tmavsie baby s bokmi, cize je to len otazka vkusu kedze pocuvam casto od inych, ze sa im najviac pacia Slovenky a Cesky.", "created_utc": "1666164453.0", "edited": "False", "id": "iswrtxw", "is_submitter": "False", "link_id": "t3_y7hxy4", "parent_id": "t3_y7hxy4", "score": "9", "subreddit": "czech", "subreddit_id": "t5_2qiht"}, {"author": "frvnkhl", "body": "To je shrinkflation, kde vyrobca namiesto zvysovania ceny iba zmensi balenie aby nechal rovnaku cenu. Nedeje sa to iba na Slovensku, ale vsade kde je vysoka inflacia. Co je minimalne polovica sveta momentalne. 😅\n\nAk by ta to nejak viac zaujimalo, npr ma o tom zaujimavy clanok.\n['Shrinkflation' accelerates globally as manufacturers quietly shrink package sizes](https://www.npr.org/2022/06/08/1103766334/shrinkflation-globally-manufacturers-shrink-package-sizes)", "created_utc": "1665912500.0", "edited": "False", "id": "isivloq", "is_submitter": "False", "link_id": "t3_y5c0o4", "parent_id": "t3_y5c0o4", "score": "56", "subreddit": "Slovakia", "subreddit_id": "t5_2qyjb"}, {"author": "frvnkhl", "body": "Exactly! To me what you said to the girl wasn’t oversharing at all. I would react the same way because if I ask, I expect an honest answer. I don’t necessarily have an urge to give advice or solve your problems.\n\nBut judging by the comments, many people see it as oversharing. We all have a different bar for what we consider oversharing and that’s okay. And sometimes it can be very tricky, especially if you don’t realise you might be oversharing.\n\nAs you said, if that’s who you are and someone gets uncomfortable straight away, your friendship wouldn’t go a long way. So if you’re after actual genuine friendship/connection it’s not a bad thing although you might make some people uncomfortable. I watch it only when meeting people for work related stuff, since in that context I’m more after good impression rather than friendship.", "created_utc": "1665638395.0", "edited": "False", "id": "is4cjzu", "is_submitter": "False", "link_id": "t3_y1ixuq", "parent_id": "t1_is2j3wt", "score": "1", "subreddit": "socialskills", "subreddit_id": "t5_2r275"}, {"author": "frvnkhl", "body": "This reminded me when I moved to Prague and at the party one guy with whom I had quite a long conversation asked me then why I moved here. I simply said “My dad was having health issues, so I moved here to help him in his company.”\n\nHe got slightly uncomfortable and we didn’t speak much after that. Like you, I said it just to answer truthfully without going into any more details and I said it as a matter of fact without any emotions attached to it.\n\nThe thing is, some people will get uncomfortable with those kinds of things and in the professional setting I watch that. But when I’m talking to people in my personal life, I prefer to be honest and answer truthfully. And I actually prefer when people talk to me this way as well. For this reason I’m well aware of it but don’t always necessarily filter myself when getting to know people on a personal level.", "created_utc": "1665582523.0", "edited": "False", "id": "is0r32n", "is_submitter": "False", "link_id": "t3_y1ixuq", "parent_id": "t3_y1ixuq", "score": "1", "subreddit": "socialskills", "subreddit_id": "t5_2r275"}, {"author": "frvnkhl", "body": "Don’t take negative people’s comments seriously here. Although I don’t live in Slovakia anymore, Kosice is really nice. Only some people tend to shit on it because it’s on the eastern side of the country and all they know about the city is that there’s Lunik IX.\n\nMost of the historical main attractions are in the old town. I’d suggest going for a walk through the main street (Hlavná) and you’ll pass many cool sights. St. Elizabeth’s Cathedral (Dom sv. Alzbety) is the most famous one, but there’s also a cool technical museum and personally my favourite there is the theater building. \n\nAlso if you’re on the main street, there are many cool cafés, pubs and restaurants to discover if the weather will be too cold. And if you like movies, Kino Úsmev is the place to go. It’s an old reopened movie theater with a bar inside.\n\nWhile in the Old town, you should also visit Hrnciaraka street, there are many little local stores to see! Apart from that, many backstreets in the old town are lovely just to wander around.\n\nPersonally my favourite place is Kulturpark. More specifically Steelpark science museum. It’s an interactive science museum and even people not interested in science have a lot of fun there. Not to mention, it’s a short walk from the old town. Also, in the Kulturpark there are many different events and gigs so you can check that if you want to have a night out as well. \n\nIf you’re gonna be there for a longer period of time, you can also visit places outside center such as botanical garden, zoo, Jazero or many cool views of the city (the center itself is in the valley).\n\nI hope you’re gonna have a great trip and if you have some questions/want to know something specific, let me know. I’ll be happy to help if I can. :)", "created_utc": "1665328085.0", "edited": "False", "id": "irn41hd", "is_submitter": "False", "link_id": "t3_xzmeo8", "parent_id": "t3_xzmeo8", "score": "10", "subreddit": "Slovakia", "subreddit_id": "t5_2qyjb"}, {"author": "frvnkhl", "body": "I like the idea, however here in Prague many people complain about those scooters. \n\nMain reason being that in some central parts of Prague finding a parking spot can be a challenge as it is and then you see that some people with a big brain keep leaving those scooters parked in a very silly way where 2 cars could be parked. \n\nBut at the end of the day, I support scooter sharing but parking issue should be solved. Especially in a city like Prague that hasn’t been very big on scooters on general like for instance Milan.", "created_utc": "1665142251.0", "edited": "False", "id": "ire5qbl", "is_submitter": "False", "link_id": "t3_xxqurm", "parent_id": "t1_irdigpn", "score": "2", "subreddit": "UrbanHell", "subreddit_id": "t5_2yokk"}, {"author": "frvnkhl", "body": "Tiez som to vzdy volal rucna alebo strunova kosacka. Az som musel googlit co je krovinorez a vyzinacka. 😂", "created_utc": "1664542230.0", "edited": "False", "id": "iqhraho", "is_submitter": "False", "link_id": "t3_xrynb5", "parent_id": "t1_iqhkpib", "score": "3", "subreddit": "Slovakia", "subreddit_id": "t5_2qyjb"}, {"author": "frvnkhl", "body": "Vraj v Quechua (domorody jazyk Inkov) maju tento zvuk.\n\nInak som si myslel, ze aj Poliaci? Vyzera, ze nie podla mapy.", "created_utc": "1664301933.0", "edited": "False", "id": "iq4t176", "is_submitter": "False", "link_id": "t3_xphimw", "parent_id": "t1_iq3s9u5", "score": "3", "subreddit": "czech", "subreddit_id": "t5_2qiht"}, {"author": "frvnkhl", "body": "This or SAPA.", "created_utc": "1664282466.0", "edited": "False", "id": "iq3i4mi", "is_submitter": "False", "link_id": "t3_xp924k", "parent_id": "t1_iq2z0qe", "score": "2", "subreddit": "Prague", "subreddit_id": "t5_2qiss"}, {"author": "frvnkhl", "body": "Ako mozno je to selection bias. Suhlasim s tebou, ze su ludia, co robia banalne chyby ako to haber vs a ver, ale nemam pocit, ze by to bolo ovela horsie ako u nas. Poznam aj u nas vysokoskolsky vzdelanych ludi, co napisu veci typu “urobyt”. \n\nPoznam aj ludi, co napisu ke miesto que ale zas tiez nemam pocit, ze by to bola nejaka vacsina. Prizvuky zas beriem ako u nas diakritiku ak ich nepouzivaju. \n\nSlangove slova tiez nepocitam ako gramaticky zle. Je pravda, ze niektori pisu velmi zle ale zase videl som vela Slovakov, ktori tiez pisu velmi zle.\n\nAunque no sé si estás hablando sólo de los mexicanos o latinos en general pero lo que estás diciendo no es mi experiencia. Si, hay gente que escriben como dices tú y también alguna gente tiene sus cositas (yo también, mi gramática tampoco es perfecta) pero no tengo sentido que la proporción de la gente que escribe muy mal es tan diferente que en Eslovaquia.", "created_utc": "1664281888.0", "edited": "False", "id": "iq3h1g8", "is_submitter": "False", "link_id": "t3_xov3oo", "parent_id": "t1_iq3d9eg", "score": "1", "subreddit": "Slovakia", "subreddit_id": "t5_2qyjb"}, {"author": "frvnkhl", "body": "Neviem s tou LatAm na reddite.. Som na Peruanskom a Mexickom subreddite a vacsinou skoro vsetci pisu dobre. Nepostrehol som, ze by sa to urovnou az tak lisilo od SK alebo CZ subredditu.\n\nZlu gramatiku som takto zazil skor od ludi v LatAm, co boli z nejakych vidieckych oblasti a doma ani nehovorili spanielsky ale nejakym domorodym jazykom. Hlavne chyby ako zamienanie b/v. Ale tychto moc na reddite neuvidis. Skor fb, yt alebo tiktok.\n\nS anglictinou detto, k Nemcine sa vyjadrit neviem.", "created_utc": "1664278469.0", "edited": "False", "id": "iq3b301", "is_submitter": "False", "link_id": "t3_xov3oo", "parent_id": "t1_iq2xmcp", "score": "1", "subreddit": "Slovakia", "subreddit_id": "t5_2qyjb"}, {"author": "frvnkhl", "body": "Ja diakritiku nepouzivam dlhe roky. Na mobile je to zdlhavejsie a na compe som zvyknuty na americku klavesnicu. Na Slovenskej mam pomaly vsetky znaky inac, ze ma to spomaluje ked napr neviem najst otaznik a tak.", "created_utc": "1664254736.0", "edited": "False", "id": "iq2h53i", "is_submitter": "False", "link_id": "t3_xov3oo", "parent_id": "t3_xov3oo", "score": "5", "subreddit": "Slovakia", "subreddit_id": "t5_2qyjb"}, {"author": "frvnkhl", "body": "Could be. Slovak and Czech are very similar though, in fact as similar as my hometown dialect to standard Slovak lol.\n\nBut to be honest, I think ability to communicate quite well in one language from one group makes it easier to learn another one from that group. \n\nE.g. French seems quite intuitive if you speak Spanish. Both have their own quirks but their logic is almost identical. :)", "created_utc": "1663699651.0", "edited": "False", "id": "ip89o4m", "is_submitter": "False", "link_id": "t3_xinc2l", "parent_id": "t1_ip7edv9", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "frvnkhl", "body": "As someone with a Slavic native language I approve the no articles change! To this day I often struggle with it.", "created_utc": "1663679547.0", "edited": "False", "id": "ip6umrp", "is_submitter": "False", "link_id": "t3_xinc2l", "parent_id": "t1_ip4jbbf", "score": "7", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "frvnkhl", "body": "It’s not as special as you’d think. Yeah, I don’t commute but most people don’t work over 40h/week where I live. Might be different in North America if that’s where you’re from.\n\nOP mentioned the model from 19th century, not hunter gatherers.. but even amount of their free time seems to vary based on the location and it’s not as straightforward as stated in your study, since it has a sample of a tribe in Philippines. For instance, feel free to check daily life of Hadza people (one of the last hunter gatherers in our times). The amount of their free time doesn’t differ that much to let’s say average Czech or German person. Although now I do realise it’s really hard to generalise as the lifestyle varies across continents now and it probably did 6000 years ago as well.\n\n[hadza tribe](https://philosophy.dept.shef.ac.uk/culture&mind/people/crittendena/)", "created_utc": "1663144079.0", "edited": "False", "id": "iodd2bl", "is_submitter": "False", "link_id": "t3_xdr13b", "parent_id": "t1_ioday49", "score": "6", "subreddit": "unpopularopinion", "subreddit_id": "t5_2tk0s"}, {"author": "frvnkhl", "body": "That’s quite an assumption from your side. I live alone, I don’t have that many things, it doesn’t take a lot of time to clean my flat.\n\nI admit, I didn’t calculate washing the dishes.. also cooking time but my point is, I don’t need to cook if I don’t want to. My job provides me enough to have a choice of more free time or cooking at home. But even with this, add 2-3 more hours. It’s still not a lot compared to my grandparents’ lifestyle.", "created_utc": "1663141796.0", "edited": "False", "id": "ioda6gi", "is_submitter": "False", "link_id": "t3_xdr13b", "parent_id": "t1_iod9hnm", "score": "4", "subreddit": "unpopularopinion", "subreddit_id": "t5_2tk0s"}, {"author": "frvnkhl", "body": "I’m doing home office these days, so no commute time for me. I work 40h/week + I do side projects (which is more like a hobby that brings me $) which is around 5-7h/week. Chores like grocery shopping and cleaning around the house maybe 3h/week in total? \n\nSo 50h/week and I’m free to do anything I want after that. 🤷🏻‍♂️", "created_utc": "1663139812.0", "edited": "False", "id": "iod7npi", "is_submitter": "False", "link_id": "t3_xdr13b", "parent_id": "t1_iod682i", "score": "5", "subreddit": "unpopularopinion", "subreddit_id": "t5_2tk0s"}, {"author": "frvnkhl", "body": "Not really.. if you have to grow/hunt your own food,  make your own clothes, go somewhere just for the fresh water etc. All those things take a lot of time just to be able to survive in the society. That is unless you define those as “free time” activities. In most cases even kids were helping out, so it’s really not like we have “less free time”.", "created_utc": "1663138672.0", "edited": "False", "id": "iod60t0", "is_submitter": "False", "link_id": "t3_xdr13b", "parent_id": "t1_iod4ubp", "score": "12", "subreddit": "unpopularopinion", "subreddit_id": "t5_2tk0s"}, {"author": "frvnkhl", "body": "Uz nefajcim cez dva roky, ale na strednej som daval tak krabicku denne. Sice nasi ma nenutili dat celu krabicku na posedenie, ale snazili sa ma “silou” donutit aby som prestal. \n\nCo sa ale stalo, z trucu som v tom pokracoval dalej, lebo predsa “nemozu ma zlomit”. Mohli po mne kricat, zakazovat mi veci, viac ma kontrolovat. Jedine, co tym dosiahli bolo to, ze som bol viac prefikany, lepsie schovaval veci pred nimi a naucil som sa byt viac tajnostkar. Vela veci, ktore som sa neskor aj musel odnaucit.\n\nAle priznam sa, mal som aj spoluziakov, co sa bali tak svojich rodicov, ze kvoli nim na strednej nepili, nefajcili, boli slusni len aby nebol doma krik. Vela z nich sa doslova utrhlo z retaze na vyske alebo po strednej jak odisli z domu. A ver mi, vela z nich doteraz neprestalo.\n\nUprimne neviem ako by si dohovoril nieco takemuto decku. Ale viem, ze doslova prinutit nemozes nikoho.. minimalne nie na vzdy. Motivacia musi byt vnutorna, aby clovek prestal. Viem to sam, lebo neprestal som s tym iba raz.", "created_utc": "1663083893.0", "edited": "False", "id": "io9rxf9", "is_submitter": "False", "link_id": "t3_xd4pp8", "parent_id": "t1_io8uaqz", "score": "3", "subreddit": "czech", "subreddit_id": "t5_2qiht"}, {"author": "frvnkhl", "body": "I’m not sure about others, but I’m a person from Slovakia living in Prague, Czechia. In my case it’s easier to say Europe because many people simply haven’t heard about my country. And who’s really interested in knowing the country will ask where exactly in Europe otherwise we just move on.", "created_utc": "1662961916.0", "edited": "False", "id": "io3acwq", "is_submitter": "False", "link_id": "t3_xbjs1p", "parent_id": "t1_io2pe2q", "score": "10", "subreddit": "unpopularopinion", "subreddit_id": "t5_2tk0s"}, {"author": "frvnkhl", "body": "Z mojej skusenosti dost Francuzov, co som stretol malo podobny humor tomu nasmu. Francuzky az tak moc nie, skor naopak vela z nich bolo az moc politicky korektnych. Ale zase, je to len moja skusenost.\n\nTiez som napriklad mal jedneho tepleho spoluziaka Holandana, ktory mal taky humor, ze ziaden joke nebol too offensive. \n\nAle vo vseobecnosti s tebou suhlasim, ze je to tam docela ine. Najhorsi mi v tomto prisli Nemci, pri ktorych som sa prichytil, ze sa musim az moc filtrovat.\n\nTeraz mam napriklad priatelku z Peru a ona ma obcas ostrejsie vtipy ako ja a ozaj nemozem byt stastnejsi.", "created_utc": "1662757634.0", "edited": "False", "id": "inryr66", "is_submitter": "False", "link_id": "t3_x9wqtu", "parent_id": "t3_x9wqtu", "score": "6", "subreddit": "czech", "subreddit_id": "t5_2qiht"}, {"author": "frvnkhl", "body": "Mne sa ta myslienka paci. Ale realne ak by sme sa mali niekedy dat dokopy, radsej by som videl konfederaciu. Ci uz Ceskoslovensku, Karpatsku, na mene nezalezi.\n\nIdealne by som tu konfederaciu rozdelil este na mensie celky, napriklad dnesne kraje v SR, aj CR. Tie by mali urcitu nezavislost ako vo Svajciarsku kantony. A okresy by som spravil ako su vo Sviaciarsku communes. V podstate by sa veci riesili takto->\n\nNa urovni konfederacie: veci ako medzinarodne vztahy, bezpecnost, obrana atd.\n\nNa urovni krajov/kantonov: rozpocet, dane, celkovo politicky system atd. (Vo Svajciarsku kazdy kanton ma vlastnu ustavu, parlament a sudy)\n\nNa urovni okresov/communes: skoly, welfare, miestna infrastruktura, miestne planovanie a dane.\n\nV tom pripade by mi ani nevadilo, keby hlavne mesto bola Praha, aj ked mas pravdu, Brno by davalo vacsi zmysel. Ale aj tak by som bol za vacsi lokalizmus ako popisujes ty.\n\nDovodom je, ako niekto spomenul, ze Praha nemala pochoponie pre Slovensko. Takisto Bratislava nema vzdy pochopenie pre Kosice a preto by som to rozlozil este viac. Myslim si, ze Svajciarsky model funguje celkom dobre a ak by sa zrodila nejaka myslienka opatovneho zjednotenia bol by to pre nas dobry vzor.\n\nKazdopadne, je to iba moj nazor.. ale keby sa nieco take dialo, bol by som rad.", "created_utc": "1662123014.0", "edited": "False", "id": "imsgqpv", "is_submitter": "False", "link_id": "t3_x3xokf", "parent_id": "t3_x3xokf", "score": "-1", "subreddit": "Slovakia", "subreddit_id": "t5_2qyjb"}, {"author": "frvnkhl", "body": "Amazing, you’re a lifesaver! Thank you very much for your input. Hopefully it’ll be working for some time 🤞🏻", "created_utc": "1661953329.0", "edited": "False", "id": "imirfct", "is_submitter": "True", "link_id": "t3_x2cqol", "parent_id": "t1_imilx8m", "score": "3", "subreddit": "duolingo", "subreddit_id": "t5_2t6ze"}, {"author": "frvnkhl", "body": "I used to study in the Netherlands before. What you're talking about applies only to non-EU nationals.\n\nEU students get the place only if there's a room left after all non-EU students. I loved the Netherlands and my studies there and I recommend it to almost everyone. I have lived in 8 countries and honestly, the NL is one of my favourites. \n\nHowever, I have heard of many cases this year in particular that people from my own country (in the EU) didn't start their education simply because they couldn't find the accommodation, despite applying for it as soon as they were accepted and spending the month and a half in the NL trying to find it there. Thankfully, I didn't have this problem when I did my studies, but things seem to have changed since then.", "created_utc": "1661500974.0", "edited": "False", "id": "ilue54g", "is_submitter": "False", "link_id": "t3_wxbx0h", "parent_id": "t1_ilub27w", "score": "7", "subreddit": "Netherlands", "subreddit_id": "t5_2r0ol"}, {"author": "frvnkhl", "body": "Nemusi ani uplne z Prahy. Ja byvam na periferii a sneh tu bol cca 2 mesiace tento rok, zatial co v centre mozno len tak par dni dokopy.", "created_utc": "1660931210.0", "edited": "False", "id": "ikyn9q1", "is_submitter": "False", "link_id": "t3_wsbqpq", "parent_id": "t1_ikxsa0a", "score": "3", "subreddit": "czech", "subreddit_id": "t5_2qiht"}, {"author": "frvnkhl", "body": "Davam award. Hlavne kvoli tomu, ze moj otec je na tom podobne ako ten tvoj momentalne.\n\nJe to inac inteligentny clovek, inzinier. Ale ma chybu, ze si obcas nevie priznat, ze sa myli. Vysvetlovanie, ako funguju socialne media akurat dokazali to, ze on to pochopil, ze ta “druha strana” je zahltena v echo chambers, tak som to aj nejak vzdal.\n\nCastokrat mi to trha srdce, mam toho cloveka rad, vela mi dal a vela ma naucil. Ale mam pocit, ze dosiel do isteho bodu a veku, kde uz uplne nechape nove veci a co sa deje. A je vidno, ze nie je stastny a tymto si ventiluje svoj vztek. Rad by som mu pomohol, ale neviem ako.\n\nNajhorsie je na tom, ze ani sa nebavime o politike a on sa zacne rozculovat a kricat ak si nahodou nejaku vetu spoji s niecim politickym. A zdiela strasne vela tychto veci na facebooku a ozaj sa bojim, ze tymto si aj pokazi reputaciu kedze je podnikatel v mensom meste. A bohuzial, to ze sa mu momentalne az tak nedari (predsalen je recesia) tomu ozaj nenapomaha.\n\nSorry za dlhy rant, ale ozaj si vazim niekoho kto takto s nadhladom a bez zbytocneho sudenia sa k tomuto vie vyjadrit. Lebo ozaj nie su to len “absolventi vysokej skoly zivota”, co toto konzumuju, sa nad tymto rozculuju a veria tymto veciam.", "created_utc": "1660925888.0", "edited": "False", "id": "iky9e0j", "is_submitter": "False", "link_id": "t3_wsb1fw", "parent_id": "t1_ikxh6m9", "score": "49", "subreddit": "Slovakia", "subreddit_id": "t5_2qyjb"}, {"author": "frvnkhl", "body": "It’s not only for the internet orders, but any orders outside the shop.\n\nhttps://europa.eu/youreurope/citizens/consumers/shopping/guarantees-returns/indexamp_en.htm\n\n“If you bought a product or a service online or outside of a shop (by telephone, mail order, from a door-to-door salesperson), you also have the right to cancel and return your order within 14 days, for any reason and without a justification.”", "created_utc": "1660900628.0", "edited": "False", "id": "ikwtz7p", "is_submitter": "False", "link_id": "t3_wrrsa3", "parent_id": "t1_ikv0txh", "score": "3", "subreddit": "Netherlands", "subreddit_id": "t5_2r0ol"}, {"author": "frvnkhl", "body": "Ja byvam na okraji Prahy, cize vacsinou ked idem na kolo, tak mimo mesta, kde sa vseobecne ludia spravaju trochu lepsie ale tiez som narazil na podobne paka.\n\nCelkovo najvacsi problem, co tu vidim (aspon Praha a okolie) je nedostatok infrastruktury pre kola. A tym nemyslim nejake ciary namalovane na ceste cim sa zuzi pruh pre auta natolko, ze tretina aut je sirsia ako ten pruh. Ale realne cyklostezky, co su oddelene od aut aj chodcov a nikto si nikomu nebude zavadzat. \n\nTakto to napriklad maju v Holandsku, kde kola s autami zdielaju iba malo frekventovane cesty medzi domami a s chodcami iba stare ulicky v centre. Obavam sa, ze pokial takuto infrastrukturu nebudeme mat aj tu v Prahe, situacia sa nezlepsi. \n\nAko ridic aj cyklista chapem obe strany a bohuzial vyzera to tak, ze si este chvilu budeme takto zavadzat. Hlavne ked vidim akym stylom sa tato infrastruktura buduje. A tiez, bohuzial vela ludi nema pochopenie pre tu druhu stranu, co situacii moc nepomaha a tak potom tu mame paka, co na druhych ludi vykrikuju a riesia si komplexy. Je mi luto, ze kvoli niekomu takemu si sa aj poranila.. to aby clovek zacal nosit go-pro na helme.", "created_utc": "1660571448.0", "edited": "False", "id": "ikds1rg", "is_submitter": "False", "link_id": "t3_woweu0", "parent_id": "t3_woweu0", "score": "5", "subreddit": "czech", "subreddit_id": "t5_2qiht"}, {"author": "frvnkhl", "body": "Uprimne mi to nevadi. Byval som vo vela krajinach a kedze som Slovak, vela ludi si to plietlo so Slovinskom.\n\nTakze ak niekto povedal Czechoslovakia tak som na to reagoval typu: “ahh, close enough!”. A kedze teraz byvam v Prahe, tak to uz vobec nejak neriesim, maximalne ich opravim. 🤷🏻‍♂️", "created_utc": "1660548787.0", "edited": "False", "id": "ikctjjk", "is_submitter": "False", "link_id": "t3_wopwkj", "parent_id": "t3_wopwkj", "score": "4", "subreddit": "czech", "subreddit_id": "t5_2qiht"}, {"author": "frvnkhl", "body": "I understand that it’s not easy. But there are still many parents that are honestly shit parents.\n\nWhen I worked as a waiter, there were many kids misbehaving and I do understand it as I was a kid like that as well. Sometimes kids would even run really fast around me carrying drinks and glass bottles.\n\nNow, there were parents who wouldn’t say anything to their kids behaving this way.. there were ones that took their kids aside to discipline them but the ones that just ignore their kids doing these kinds of things were the worst kind.\n\nKids will only do what they know/think they will get away with. So yeah, if you won’t even let that kid know that what they’re doing is wrong, I’m not cutting them some slack. That’s bad parenting.", "created_utc": "1660289602.0", "edited": "False", "id": "ijytwyt", "is_submitter": "False", "link_id": "t3_wmeeqg", "parent_id": "t1_ijyskvf", "score": "6", "subreddit": "unpopularopinion", "subreddit_id": "t5_2tk0s"}, {"author": "frvnkhl", "body": "RIP your skin", "created_utc": "1660216119.0", "edited": "False", "id": "ijucezp", "is_submitter": "False", "link_id": "t3_wldnn7", "parent_id": "t1_ijttxv3", "score": "9", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "frvnkhl", "body": "Ok.. uz pridavas nove zdroje, aby sa ti to hodilo do argumentu. :D Tam kde je uvadzane tych 21% hovoria o mladych ludoch, k comu som sa uz vyjadroval predtym a dokonce sme sa ciastocne aj na niecom zhodli.\n\nNicmene, vidim, ze tato debata nema zmysel, kedze mas nejaky nazor a snazis sa ho za kazdu cenu pretlacovat ako ten argument s tym lavakom, ktory ignoruje strasne vela ostatnych variant ako napr. spolocenske, ci nabozenske stigma (nepocul som nikoho povedat, ze ak si lavak pojdes do pekla alebo ze byt lavakom je proti prirode). Z tohto dovodu je tazko vobec povedat, kolko ludi v minulosti v sebe taku tu homosexualitu napr. potlacalo. Vela skupin bolo/je diskriminovanych a niekedy im moze trvat kym sa ozvu z X roznych dovodov.\n\nAle myslim si, ze ak toto budes citat a reagovat na to takym istym sposobom ako doteraz, tak nasa konverzacia nadobudla koniec. Tvoj nazor samozrejme respektujem, akurat ho nezdielam. Nie je to nic osobne.\n\nPrajem ti inac prijemny zvysok dna! Vybehni von, je pekne pocasie. :)", "created_utc": "1660057612.0", "edited": "False", "id": "ijl6w8f", "is_submitter": "False", "link_id": "t3_wb6fn6", "parent_id": "t1_ijku9yc", "score": "1", "subreddit": "czech", "subreddit_id": "t5_2qiht"}, {"author": "frvnkhl", "body": ">u zen slo o to, ze to samotne casto jako diskriminaci vubec nevidely a samy bojovaly proti zrovnopravneni (protoze by jim napr. prineslo ztratu nekterych vyhod - viz Phyllis Schlafly)\n\nA opat, to ze to nevideli alebo si neuvedomovali diskriminaciu, to este neznamena, ze tam nebola. A ano, niektore bojovali proti zrovnopravneniu ale to uz je tak trochu nitpicking.\n\n&#x200B;\n\n>U jinych ras a etnicit samozrejme o diskriminaci slo - ale byly to oddelene skupiny u kterych bylo snadne vytvaret narativy \"my vs oni\" a zpravidla jich bylo vyrazne min nez 1/5 populace.\n\nA u LGBTQ ludi nie je lahko vytvarat tieto narativy? Naviac, neviem odkial si si vybral tych 1/5 ludi ako pravidlo, ale budis. Hovoril si o 1/6 ludi, ktori sa identifikuju ako LGBTQ  a ako je mozne, ze tito ludia boli diskriminovani tak dlho. 1/5 je viac ako 1/6 predsa, nie? \n\n&#x200B;\n\n>Ty oproti tomu tvrdis, ze vznikla siroka diskriminace LGBTQ prestoze prumerne se nejaky zastupce vyskytoval v kazde rodine\n\nToto som nepovedal. Nebavili sme sa o tom, ze je v kazdej rodine nejaky zastupca.    Prosim ta, [precitaj si definiciu diskriminacie](https://sk.wikipedia.org/wiki/Diskrimin%C3%A1cia_(znev%C3%BDhod%C5%88ovanie)) lebo mam pocit, ze tebe sa pletu tieto dojmy.\n\n&#x200B;\n\n>Proc podle tebe byli siroce diskriminovani LGBTQ, ale levaci ne?\n\nNeviem preco stale vytahujes tych lavakov. Uprimne neviem ti povedat uplne preco jedna skupina bola diskriminovana a ina nie. To asi nevie nikto kedze svet je celkom komplexny. A navyse, tolko kultur existovalo a aj existuje vo svete, mozno bola aj jedna, kde sa lavaci nemohli brat alebo byt otvorene lavakmi na verejnosti. (nemusis robit fact-checking, je to len hypoteza, lebo na tuto otazku sa ozaj inac odpovedat neda)", "created_utc": "1660050636.0", "edited": "False", "id": "ijkq3y3", "is_submitter": "False", "link_id": "t3_wb6fn6", "parent_id": "t1_ijkmsz0", "score": "1", "subreddit": "czech", "subreddit_id": "t5_2qiht"}, {"author": "frvnkhl", "body": "Nemam pocit, ze by som miesal socialnu rolu s diskriminaciou. Ano, zeny mali (aj maju) inu socialnu rolu ako muzi. Znamena to, ze ked zeny same nemohli jazdit autom alebo volit neslo o diskriminaciu ale o odlisnu socialnu rolu?\n\nTo iste neplati len o zenach, ale aj o inych rasach, etnicitach a pod v roznych kulturach pocas historie. Aj tam slo podla teba o socialnu rolu a nie o diskriminaciu?\n\nUprimne, aj ked suhlasim, ze ine socialne role v kulture maju vseobecne ine ocakavania stale nechapem tvoj argument proti diskriminacii kedze jedno automaticky nevylucuje to druhe.", "created_utc": "1660044729.0", "edited": "False", "id": "ijkewvi", "is_submitter": "False", "link_id": "t3_wb6fn6", "parent_id": "t1_ijk9ui7", "score": "1", "subreddit": "czech", "subreddit_id": "t5_2qiht"}, {"author": "frvnkhl", "body": "Rady, co by som ti dal ohladom odstahovania sa uz tu zazneli. Proste si to cele naplanujte a pripravte s priatelkou a oznam to rodicom ako hotovu vec. Bude to v momente zlozite ale z dlhodobeho hladiska sa ti ulavi.\n\nCo sa inac tyka psychologa, nieco podobne som nedavno riesil. Ak budes potrebovat nejaku odbornu pomoc, mne pomohlo najst si psychologa cez terap.io. Je to sice cez internet, cize vsetky sedenia som mal cez videohovor a sedenie (1h) je od nejakych 500kc. A termin som mal vzdy najneskor do 2 tyzdnov. Mne tie sedenia dost dali a pomohli. \n\nDufam, ze ti to pomoze a drzim ti palce!", "created_utc": "1659949956.0", "edited": "False", "id": "ijf4s4t", "is_submitter": "False", "link_id": "t3_wizhga", "parent_id": "t3_wizhga", "score": "3", "subreddit": "czech", "subreddit_id": "t5_2qiht"}, {"author": "frvnkhl", "body": "My grandpa was in the primary school when war took place and told me few stories about soldiers searching for Jewish people and him hiding his neighbours in the wardrobe for few hours so they could escape once the soldiers were gone. He said his only luck was that soldiers in his village trusted little boy, so they didn’t question it when he said no one was inside and without searching their house they moved on to another one.\n\nI know that memory can be a tricky thing and maybe not every village/town was the same but those stories and sudden drop in Jewish population in Slovakia can tell you that it was no picnic for them here in WWII.\n\nI’ve actually talked about this with many old people that were kids while this was happening and most common memory amongst all of them was “lot of my neighbours/friends suddenly started disappearing”.", "created_utc": "1659610644.0", "edited": "1659611127.0", "id": "iiwfk1j", "is_submitter": "False", "link_id": "t3_wfx5en", "parent_id": "t3_wfx5en", "score": "72", "subreddit": "Slovakia", "subreddit_id": "t5_2qyjb"}, {"author": "frvnkhl", "body": "Moja babka je Rusinka a viem ze rusinsky som mal dost problem rozumiet obcas aj ked to nie je narecie. Goralom tiez tazko rozumiem. Mimo toho vseobecne ked som niekedy nieco nepochytil bolo to skor tym, ze som nebol zvyknuty na prizvuk nez samotnym narecim.\n\nInac ako Slovak z vychodu, co zije v Prahe, mam obcas dost problem rozlisit niektore zapadoslovenske narecia od moravskych 😂", "created_utc": "1659530602.0", "edited": "False", "id": "iirwrzx", "is_submitter": "False", "link_id": "t3_wf09eg", "parent_id": "t3_wf09eg", "score": "9", "subreddit": "Slovakia", "subreddit_id": "t5_2qyjb"}, {"author": "frvnkhl", "body": "Par rokov dozadu som sa na tuto temu bavil s jednou zenou. Ona mi povedala “ak nevies svoju erekciu kontrolovat, znamena to, ze si slaby chlap”.\n\nUprimne, nevedel som ako na to odpovedat niekomu, kto ocividne nema ani tusenie ako funguje mechanika muzskych pohlavnych organov.", "created_utc": "1659520091.0", "edited": "False", "id": "iirgb1u", "is_submitter": "False", "link_id": "t3_wezhko", "parent_id": "t1_iirbfr4", "score": "64", "subreddit": "czech", "subreddit_id": "t5_2qiht"}, {"author": "frvnkhl", "body": "Myslim si, ze tym, ze to predtym bolo taboo a vela ludi mozno v sebe tu homosexualitu potlacovalo, nemozeme mat uplne presne data z minulosti kolkym chlapom prisli chlapi atraktivny a pod.\n\nSamozrejme, budu stale mladi, ktori chcu byt ini a specialni. Vacsina z nich z toho vyrastie. Ale pokial je “edgy” byt homosexual, tak si memyslim, ze ide o spolocnost, kde ta homosexualita je brana za nieco normalne.\n\nAko priklad, byval som nejaky cas v Holandsku, aj som tam studoval. Je to tusim prva krajina, kde same-sex marriages boli legalne, tusim ze viac nez 10 rokov pred USA (kludne mozes spravit fact-check kedze si nepamatam presne cifry). Kazdopadne, v rocniku bolo zopar ludi, co boli homosexuali, bi atd. Nikto to neriesil, kazdy zil svoj zivot.\n\nTento priklad davam len kvoli tomu, ze keby tam som sa identifikoval inac, len aby som sa citil specialne alebo iny, asi by mi to moc nevyslo. Jedine by som mozno ziskal pozornost od chalanov. Ale ak to dookola budu ludia riesit, preco je to zle alebo preco by sme to mali oslavovat, ono sa to do toho bodu normalnosti nedostane tak rychlo. \n\nA ked sa ti nezda, ze by 1/6 populacie mohla byt tak diskriminovana v minulosti. Tak sa ta mozem spytat, ze jak sa stalo, ze zeny nemohli volit alebo ze v Saudskej Arabii donedavna bolo pre zeny ilegalne ridit auto? Zien je tam viac nez 1/6 populacie a aj tak taka velka cast populacie bola (v podstate z velkej casto stale je) diskriminovana.", "created_utc": "1659259957.0", "edited": "False", "id": "iid3phb", "is_submitter": "False", "link_id": "t3_wb6fn6", "parent_id": "t1_ii8jxld", "score": "1", "subreddit": "czech", "subreddit_id": "t5_2qiht"}, {"author": "frvnkhl", "body": "Ja som pocul argument od jedneho spoluziaka zo strednej “chcem mat raz deti a ked toto bude normalne tak aj moje deti take budu”. V podstate nevedel som co mu na to odpovedat. Akurat dufam, ze ak naozaj bude mat raz deti, nebudu homosexuali, lebo nebudu to s nim mat lahke.\n\nTym, ze som z maleho mesta z vychodneho Slovenska pocul som uz velmi vela ludi vyjadrovat preco su proti tomu. Ale este som nepocul dovod, ktory by realne daval zmysel.", "created_utc": "1659166739.0", "edited": "False", "id": "ii8ewzt", "is_submitter": "False", "link_id": "t3_wb6fn6", "parent_id": "t3_wb6fn6", "score": "3", "subreddit": "czech", "subreddit_id": "t5_2qiht"}, {"author": "frvnkhl", "body": "Spotify will let me save yt videos offline? 😂", "created_utc": "1657971015.0", "edited": "False", "id": "igdssui", "is_submitter": "False", "link_id": "t3_w078k6", "parent_id": "t1_igdldwu", "score": "5", "subreddit": "unpopularopinion", "subreddit_id": "t5_2tk0s"}, {"author": "frvnkhl", "body": "Not sure why you’re being downvoted lol. \n\nIn my country youtube premium is €1.50 more expensive then Spotify premium. This difference is really nothing considering you can then save videos offline, having no ads, play even books/podcasts on youtube on the background.\n\nAlso, I generally like yt’s songs recommendations much more than the songs Spotify recommended me while using their app. But that was few years back, maybe their AI improved since.", "created_utc": "1657957921.0", "edited": "False", "id": "igdbzbs", "is_submitter": "False", "link_id": "t3_w078k6", "parent_id": "t1_igd3q5e", "score": "6", "subreddit": "unpopularopinion", "subreddit_id": "t5_2tk0s"}, {"author": "frvnkhl", "body": "I was in a similar situation, I worked on myself and tried many things. You know how I actually got with my current girlfriend? \n\nFirst, I deleted my dating apps and told myself, I’m not gonna actively look for a relationship. But I’ll be opened to it. I didn’t want anything casual, so I felt like dating apps were a distraction for me.\n\nSecond, I focused on my job, improving my programming skills, spending quality time with my friends. Honestly doing the things good for me and for the loved ones.\n\nAnd then, one day on language exchange app she wrote me and we just hit it off.\n\nYou know, it’s great you have a good job, you take care of yourself physically and mentally. But in this process of mine I realised people are attracted to that energy if you do it for yourself, not just to be more attractive to women. Put a break on dating. Do not actively seek relationships. Do the things that make you feel come alive and don’t be ashamed of that. Women will find a guy who loves knitting and isn’t ashamed of it more attractive than someone working out just because “women like that”. \n\nAnd also, get to know yourself on a deeper level! From your post it seems like behind most of the things you did was an agenda to meet women/get dates. Volunteering, socialising, doing sports, those are all great things, but do them for yourself. Just live enjoying your life, if someone wants to join, cool. If not, it seems like your life isn’t that bad overall, so why not just keep enjoying it doing what you like?", "created_utc": "1656076676.0", "edited": "False", "id": "idjzmpb", "is_submitter": "False", "link_id": "t3_vj9xv5", "parent_id": "t3_vj9xv5", "score": "1", "subreddit": "TrueOffMyChest", "subreddit_id": "t5_2yuqy"}, {"author": "frvnkhl", "body": "I had a similar experience to you, so it might help you! \n\nI had a best friend from my high school days. After high school I could feel I was growing, meeting new people and overall becoming a more rounded person. He was kinda stagnating. I saw it and with the mentality “no man stays behind” I helped to get him job in my mom’s advertising agency. He liked doing graphics, so I figured out this would be a great opportunity for him to kickstart his career.\n\nHowever, as the time went by, I would hear two different stories from him and my parents about him at work. My parents would complain that he talks way too much and works too little. I would talk to him about it so he wouldn’t loose that job. However, he would often dismiss what I say as nonsense.\n\nNonetheless, in a year he would get fired because when he went on a trip and missed his train home he wouldn’t even let my parents know he wasn’t going to work. I was still friends with him in that time but something was starting to differ.\n\nI think I was starting to growing a little resentment, but I always would talk to him about stuff. But then I also starting noticing different behaviour from his side. In a high school I was very shy and he was good with women so he was always helping me in that regard. But then I noticed he would put  me down in front of strangers way too often. Not just this, but somehow we would argue more.\n\nAnd then at the end it hit me. It hit me, that if I want to get further in life, I can’t babysit him, in fact, I can’t even be his friend if I want to be a fully functional adult. I realised that he would make me feel less confident in many situations, he would make me feel worse about myself. And I knew at that moment that if I wanted to be a fully functional adult on whom people can depend and be at my best for my loved ones, I had to stop hanging out with him.\n\nI didn’t know what to do, it was all confusing and difficult for me. So at the end I just kinda ghosted him out of my life. I knew he would be too proud to ask for closure, so I took an easy way out. I’m not very proud of that and in fact, I felt really bad about it but at the same time it felt like I dropped so much weight out of my shoulders if that makes sense. Part of me also kinda  hoped that this would be a wake up call for him and he would eventually outgrow me. \n\nNow it’s been 4 years, my life has been amazing and I feel like this was something I just had to do. I heard about him recently and unfortunately it doesn’t seem like he’s done much progress on his part. It was a little a bit painful because he isn’t dumb or anything.. just stubborn and not willing to listen. I still hope he’ll learn one day but I know no one else can make him. And I had to accept that if he doesn’t want to drive in my lane with me in life, that’s okay. But unless I want to drive in his, I had to gtfo unfortunately.", "created_utc": "1655965380.0", "edited": "1655965585.0", "id": "idegc3r", "is_submitter": "False", "link_id": "t3_vi87i2", "parent_id": "t3_vi87i2", "score": "1", "subreddit": "socialskills", "subreddit_id": "t5_2r275"}, {"author": "frvnkhl", "body": "I’m also a software dev and you’re right that many people don’t pay too much attention to it now. However, I have seen a hype in web3.0 lately which uses this technology. I think it’s all in the initial state and commercial widespread use of it is still yet to come. \n\nAdvocates for this technology see potential use for non-fungible tokens for voting online, using it as an official digital identification etc.. for now, it’s all still being explored as it’s a very new technology but it looks like it’s here to stay.", "created_utc": "1652610085.0", "edited": "False", "id": "i8oign0", "is_submitter": "False", "link_id": "t3_upkh1e", "parent_id": "t1_i8oa6ue", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "frvnkhl", "body": "A traditional database can be manipulated. Whereas with blockchain database, once you add “block” (piece of information) to the chain, it’s there forever and any new piece of information comes on top of the previous ones without being able to change the previous ones. For this reason it’s that more secure and trustworthy. \n\nHonestly I don’t know why people are being downvoted here, they’re actually right about technology.", "created_utc": "1652599687.0", "edited": "False", "id": "i8o6cwu", "is_submitter": "False", "link_id": "t3_upkh1e", "parent_id": "t1_i8o4e0x", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "frvnkhl", "body": "Storm from X-Men. I loved Halle Berry!", "created_utc": "1652164721.0", "edited": "False", "id": "i80shs8", "is_submitter": "False", "link_id": "t3_um9s8b", "parent_id": "t3_um9s8b", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "frvnkhl", "body": "Yes, anytime there’s a time pressure (e.g. you’ll loose access to something in 48hrs), it’s usually a scam. They’re trying to make you feel some kind of urgency so you’d click on the link without thinking twice.\n\nAlso, next time if you’re unsure, try logging in to the site (not through the link in the email but by typing the site in the browser) to double check. If there isn’t anything there, it’s a scam.", "created_utc": "1651774343.0", "edited": "False", "id": "i7ge6iz", "is_submitter": "False", "link_id": "t3_uj0r58", "parent_id": "t3_uj0r58", "score": "21", "subreddit": "Scams", "subreddit_id": "t5_2qrt0"}, {"author": "frvnkhl", "body": "I have had couple of arguments with my girlfriend because of me saying “yeah, we can do that” in an uncertain way. \n\nShe then thinks I don’t want to do the thing. But the reason behind it is often that I’m processing the information, circumstances, all the possibilities, making the plan on the go, so it’s not really that I don’t want to do the thing, it’s more about me being pensive. It’s more like it’s a new information and for me personally at least it takes some more time to generate an emotional response. Sometimes I don’t even know how to do it without it being unnatural, so generally it’s more subtle. \n\nI tried to explain this to my girlfriend many times but I don’t think she fully understands it. I even try to do my best to not be like that but many times it comes to me so fast and naturally that I don’t even realise it.", "created_utc": "1651222030.0", "edited": "1651222456.0", "id": "i6n6kjw", "is_submitter": "False", "link_id": "t3_ue8slf", "parent_id": "t1_i6n0psn", "score": "295", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "frvnkhl", "body": "Sometimes I have that too.. for me, the main thing is switch in the mindset. You don’t have to run, you get to run, you’re a healthy person with healthy legs. When I don’t feel like running I think of all times I couldn’t run (I had a twisted ankle few years ago) and how privileged I am that I can do that. Also I think of all times when I didn’t feel like running and had no energy but I still showed up and as I proceeded to run, my energy level started to increase and I realised that the drain was mostly mental, not physical. It might sound cliche, but a little shift in a mindset can do wonders in such situations.", "created_utc": "1624521580.0", "edited": "False", "id": "h2v3byz", "is_submitter": "False", "link_id": "t3_o5sqvy", "parent_id": "t3_o5sqvy", "score": "2", "subreddit": "nikerunclub", "subreddit_id": "t5_3be5y"}, {"author": "frvnkhl", "body": "Thank you! Ever since I started doing speed runs every now and then, I’m surprised how my pace is improving.", "created_utc": "1624509059.0", "edited": "False", "id": "h2unsvt", "is_submitter": "True", "link_id": "t3_o6k2p6", "parent_id": "t1_h2t4gs4", "score": "0", "subreddit": "nikerunclub", "subreddit_id": "t5_3be5y"}, {"author": "frvnkhl", "body": "Theme & Shell  -> Orchis purple dark compact\n\nIcons -> Tela purple dark\n\nWallpaper ->[https://www.wallpaperflare.com/digital-digital-art-artwork-city-lights-street-car-vehicle-wallpaper-udzdl/](https://www.wallpaperflare.com/digital-digital-art-artwork-city-lights-street-car-vehicle-wallpaper-udzdl/)\n\nCursor -> GoogleDot black, you can't see it in a screenshot but I like it a lot, hence the honorable mention", "created_utc": "1623091138.0", "edited": "False", "id": "h0xu2gb", "is_submitter": "True", "link_id": "t3_nujtdk", "parent_id": "t3_nujtdk", "score": "1", "subreddit": "pop_os", "subreddit_id": "t5_3m5eg"}, {"author": "frvnkhl", "body": "Dekujuuu 😇", "created_utc": "1622286761.0", "edited": "False", "id": "gzv06a9", "is_submitter": "True", "link_id": "t3_nnjnic", "parent_id": "t1_gzuxxf4", "score": "1", "subreddit": "nikerunclub", "subreddit_id": "t5_3be5y"}, {"author": "frvnkhl", "body": "Thank you for your input! I was looking at HubSpot and it seems really appealing especially due to their academy and documentation :) \n\nThere's only one thing I noticed on their web. In regards to marketing emails, I saw their prices are quite high and if we were to send one marketing campaign to our current mailing list, the cost would double on a starter plan. Do you have any experience with having HubSpot integrated with marketing email tools such as SendInBlue or MailChimp?", "created_utc": "1619193771.0", "edited": "False", "id": "gvkvvw4", "is_submitter": "True", "link_id": "t3_mwvo4y", "parent_id": "t1_gvkj1yq", "score": "1", "subreddit": "CRM", "subreddit_id": "t5_2qs9e"}]