[{"author": "gammalsvenska", "body": "That is exactly the problem when you try to integrate such code into a proprietary or copylefted codebase.", "created_utc": "1666860024.0", "edited": "False", "id": "itys1km", "is_submitter": "False", "link_id": "t3_ye5et2", "parent_id": "t1_ityrj0t", "score": "2", "subreddit": "programming", "subreddit_id": "t5_2fwo"}, {"author": "gammalsvenska", "body": "> Bachelor and master both are stupid systems which are highly disputed since its integration.\n\nYes. There were (and still are) good reasons to integrate them anyways. Both systems have advantages and disadvantages, freedom of movement being one of them (which I have used to my advantage).\n\n> You do know you literally made a point for \"less education is better\".\n\nNo, because you conflate \"education\" with \"higher education\". Otherwise, yes.\n\nYou might want to look around you and see the lack of skilled workers everywhere around you. Skilled workers are not educated workers, and educated workers are not skilled workers. Different markets, and focusing on one of them will cause problems in the other.\n\n> You do not have to set a low bar to \"get everyone to pass\".\n\nIt is. I do have teaching experience, and when the (implicit or explicit) requirement is to not fail people, then you will choose the examination criteria accordingly. (Oh boy am I happy to have left that clusterfuck...)\n\n> Back then when someone came out with a diplom they could work immediately, now, even after 9 months of training most are still incapable.\n\nMy university mostly renamed the diploma classes and assigned them into their bachelor/master courses. So the master's level education was virtually identical to the previous diploma system. Also, I know enough diploma students (i.e. the people who were a year or three older than me) to just smile at your statement. You couldn't be more wrong.\n\n> Also what do you mean with split between high school and learning for job school system?\n\nThe split between \"Gesamt/Realschule + Ausbildung\" and \"Gymnasium + Hochschule/Universität\". As in, people are free to leave school early if it is not for them, learn a job early and work without being looked down. The last part being the most important: In Germany, you are not seen as a lesser citizen for going that route, and it used to be the large majority who did. Additionally, \"Zweiter Bildungsweg\" means that higher education is **not** impossible should you wish for it later in life.\n\nI now live in a country which does things differently, and... I consider that inferior. The German system is a good adaptation to the necessity of covering all your bases, especially in a post-war environment (looking at the topic). However, the way it is currently run is not playing to its strengths.\n\n> It's going south since the bachelor and master was integrated. Useless graduates everywhere.\n\nNah, it has been going down even before. And you won't get a huge pile of useless graduates if you didn't have such an easy intake of  students aiming to become a useless graduate in the first place.", "created_utc": "1666859451.0", "edited": "False", "id": "ityrees", "is_submitter": "False", "link_id": "t3_yc3bog", "parent_id": "t1_itu1rve", "score": "1", "subreddit": "explainlikeimfive", "subreddit_id": "t5_2sokd"}, {"author": "gammalsvenska", "body": "When it comes to the kernel, there are abstractions to keep the code maintainable.\n\nSince you can't call assembly instructions directly anyway, such primitives are always called through a wrapper function - which will emulate the functionality on a processor if necessary. This is not even specific to the 486, and the emulation won't be compiled in if the kernel is compiled for 586+.\n\nThe 486 contains all necessary instructions for SMP operation on a 32-bit level (64-bit primitives were added with the Pentium and it's 64-bit bus). The 386 lacked those, which caused issues for multithreading. When I looked at the patches to remove 386 support, most of the support code was in the \"undefined instruction\" handler to emulate them.\n\nIt surely was ugly code, but it wasn't spread throughout the kernel, and it wasn't even too much. And it was not compiled into any kernel compiled for 486+ either. Your poor 386 was transparent to userspace and even most of the kernel itself.\n\nFor most projects, you are perfectly right. For the kernel, I am far less sure I want to agree. I've seen the code.", "created_utc": "1666857505.0", "edited": "False", "id": "ityp6oj", "is_submitter": "False", "link_id": "t3_ycy33i", "parent_id": "t1_itu3790", "score": "1", "subreddit": "linux", "subreddit_id": "t5_2qh1a"}, {"author": "gammalsvenska", "body": "Natural iodine is not universally available. Some regions are extremely low in iodine (e.g. Austria) and supplements are far higher (and very much necessary) when compared to other regions where iodine is abundant.\n\nMaking sure that everyone gets enough iodine is a national health concern. This becomes an increasing issue with people refusing more and more traditional food for a variety of reasons.", "created_utc": "1666761122.0", "edited": "False", "id": "ittk5wf", "is_submitter": "False", "link_id": "t3_ydc8h6", "parent_id": "t1_ittg7rx", "score": "1", "subreddit": "askscience", "subreddit_id": "t5_2qm4e"}, {"author": "gammalsvenska", "body": "Does that mean the lyrics are literally impossible to understand?", "created_utc": "1666760452.0", "edited": "False", "id": "ittj6kb", "is_submitter": "False", "link_id": "t3_ydl9dk", "parent_id": "t1_itten7k", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "gammalsvenska", "body": "XTerm still outspeeds most other terminal emulators (especially those used by default on any modern distribution) and is available everywhere. Doesn't matter whether it can do tek4014 (which is a neat party gnuplot party trick).\n\nI don't care about tearing. I care about XTerm updating faster than the screen frame rate. Because that is what I use a lot, spotting patterns in megabytes of logfiles.", "created_utc": "1666760265.0", "edited": "False", "id": "ittiwk7", "is_submitter": "False", "link_id": "t3_ycy33i", "parent_id": "t1_itr9eug", "score": "2", "subreddit": "linux", "subreddit_id": "t5_2qh1a"}, {"author": "gammalsvenska", "body": "Unfortunately, you are wrong.\n\nI have tried to recreate a system using NetBSD 1.5 (which was my first contact with it), and while the base system works and installs fine, nothing else does. Package sources (or binaries) have moved or fully disappeared, companies and people have died.\n\nWhen Google decided that FTP must die (removing it from Chrome), many projects shutdown their FTP servers. Most websites are not available via HTTP either, and strictly require HTTPS with TLS 1.2.", "created_utc": "1666759937.0", "edited": "False", "id": "ittieli", "is_submitter": "False", "link_id": "t3_ycy33i", "parent_id": "t1_itqb1d1", "score": "2", "subreddit": "linux", "subreddit_id": "t5_2qh1a"}, {"author": "gammalsvenska", "body": "It is easier to treat your i486 as an embedded machine and cross-compile. Do not think debian, arch or gentoo - think buildroot or yocto. Most recent DOS development is done using cross-tools and emulation, but the same is true for game consoles, mobile devices and many other forms of embedded system.", "created_utc": "1666759215.0", "edited": "False", "id": "ittha9w", "is_submitter": "False", "link_id": "t3_ycy33i", "parent_id": "t1_itp7uee", "score": "1", "subreddit": "linux", "subreddit_id": "t5_2qh1a"}, {"author": "gammalsvenska", "body": "There is no runtime cost. You won't run any i486 kernel on your slightly more modern 32-bit machine, you'd run the i686 kernel instead (because it will run much faster). The i686 kernel won't contain the relevant math or instruction emulation support, because it doesn't need it.\n\nThe cost is purely in development and testing.", "created_utc": "1666758882.0", "edited": "False", "id": "ittgr59", "is_submitter": "False", "link_id": "t3_ycy33i", "parent_id": "t1_itqb3iw", "score": "1", "subreddit": "linux", "subreddit_id": "t5_2qh1a"}, {"author": "gammalsvenska", "body": "My Pentium 133 is definitely an i586 and it does not know about either MMX or SSE. But it does support RDTSC and probably CMPXCHG8B.", "created_utc": "1666758638.0", "edited": "False", "id": "ittgd82", "is_submitter": "False", "link_id": "t3_ycy33i", "parent_id": "t1_itqqbha", "score": "1", "subreddit": "linux", "subreddit_id": "t5_2qh1a"}, {"author": "gammalsvenska", "body": "Lund ebenfalls.", "created_utc": "1666755111.0", "edited": "False", "id": "itta8rq", "is_submitter": "False", "link_id": "t3_ydbprb", "parent_id": "t1_itrhbeu", "score": "2", "subreddit": "de", "subreddit_id": "t5_22i0"}, {"author": "gammalsvenska", "body": "Settlers 2 allowed you to connect a second mouse to COM2, to support local split-screen multiplayer. That was fun.\n\nRight player got keyboard shortcuts on the numpad, left player on the regular keys (apart from a few shortcuts, not keyboard usage required).\n\nMPX is a lot of fun, although many apps don't handle multiple separate pointers well. Maybe touch-aware applications would treat them as multi-finger gestures, not sure...", "created_utc": "1666753921.0", "edited": "False", "id": "itt81mp", "is_submitter": "False", "link_id": "t3_xvw68j", "parent_id": "t1_ir9pfbl", "score": "1", "subreddit": "talesfromtechsupport", "subreddit_id": "t5_2sfg5"}, {"author": "gammalsvenska", "body": "From Wikipedia, I didn't remember the name: https://upload.wikimedia.org/wikipedia/commons/d/d0/Rasterbrille.jpg", "created_utc": "1666742804.0", "edited": "False", "id": "itskj3m", "is_submitter": "False", "link_id": "t3_yde4rh", "parent_id": "t1_its9anm", "score": "1", "subreddit": "explainlikeimfive", "subreddit_id": "t5_2sokd"}, {"author": "gammalsvenska", "body": "The whole point of the EU was to be an *economic* cooperation based on the assumption that a heavily interconnected economy causes too many dependencies which in term make war too expensive therefore bringing peace.\n\nEconomic cooperation also brings prosperity, which is a nice side-effect.", "created_utc": "1666742714.0", "edited": "False", "id": "itskbz5", "is_submitter": "False", "link_id": "t3_yc3bog", "parent_id": "t1_itkr8ny", "score": "1", "subreddit": "explainlikeimfive", "subreddit_id": "t5_2sokd"}, {"author": "gammalsvenska", "body": "Germany's borders are not particularly defendable either (except the Alps to the south). There is no protective geography around. The between-the-wars mess of the eastern borders plus enclave didn't help, either.", "created_utc": "1666742327.0", "edited": "False", "id": "itsjhcz", "is_submitter": "False", "link_id": "t3_yc3bog", "parent_id": "t1_itl5tqr", "score": "1", "subreddit": "explainlikeimfive", "subreddit_id": "t5_2sokd"}, {"author": "gammalsvenska", "body": "Lets assume people earn enough to get by (= fair compensation, enforced by strong institutions), and they are safe safe (= low criminality, enforced by strong institutions), including economically (= decent healthcare, unemployment support, low corruption caused by strong institutions).\n\nWell, such people have far less motivation to cheat customers (also, there would be consequences) and they are likely to have less personal stress as well. Both contribute to more effective staff.\n\nCombine that with a culture of \"work is work and play is play\" and you end up with workers going to work with the intention of simply working (and going home when finished). Not team building, not friendship building, not wasting time with bullshit. Just doing their job and doing it well because that is why they are there.\n\nNo tipping culture, which just encourages competition between staff members. Instead, cooperation - because everyone has an interest in a functioning company, because at the end of the day, that company pays their rent.", "created_utc": "1666740648.0", "edited": "False", "id": "itsfst3", "is_submitter": "False", "link_id": "t3_yc3bog", "parent_id": "t1_itkqa3i", "score": "1", "subreddit": "explainlikeimfive", "subreddit_id": "t5_2sokd"}, {"author": "gammalsvenska", "body": "There is no point teaching people if they will never use the knowledge. A person studying for 20 years is leeching the system, not supporting it.\n\nAlso, there is no point in having a large percentage of the population getting higher education. First, it destroys the value of the education itself (you need to set a *very* low bar to get everyone to pass), and second, you won't have anyone left for jobs which do not require a higher education.\n\nThe German three-stage school system together with the split between \"high school\" (as prep for higher education) and \"learning a job\" (as prep for regular jobs) did understand that fairly well, and is in my opinion a major contributing factor to the economic success of Germany.", "created_utc": "1666739535.0", "edited": "False", "id": "itsdb8y", "is_submitter": "False", "link_id": "t3_yc3bog", "parent_id": "t1_itpd5jq", "score": "1", "subreddit": "explainlikeimfive", "subreddit_id": "t5_2sokd"}, {"author": "gammalsvenska", "body": "Which is exactly why my friend (and his family) left Romania. He was tired of having to bribe people to get anything done. I think he will give up his passport as soon as possible due to all the hassle they have getting them renewed.", "created_utc": "1666738058.0", "edited": "False", "id": "itsa14d", "is_submitter": "False", "link_id": "t3_yc3bog", "parent_id": "t1_itnkzh2", "score": "1", "subreddit": "explainlikeimfive", "subreddit_id": "t5_2sokd"}, {"author": "gammalsvenska", "body": "This is also the working principle of those fake glasses (lots of small holes) which are sold to \"cure\" eye issues. Which is obviously garbage. Both use optics principles, just different ones - neither change your eyes.", "created_utc": "1666737002.0", "edited": "False", "id": "its7p0y", "is_submitter": "False", "link_id": "t3_yde4rh", "parent_id": "t1_its7ab0", "score": "1", "subreddit": "explainlikeimfive", "subreddit_id": "t5_2sokd"}, {"author": "gammalsvenska", "body": "I wouldn't call it fetishization (except for Japan), but I've met Indians (in Sweden) who would only speak English to each other because they had no other common language. In my experience, working with Indians is very much hit-or-miss and and Indians also have had the biggest disconnect between self-description and reality, of all education levels. For me, there is almost no by-default trust remaining - yet some of the best people I work with are Indian.\n\nOutside of India, you are most likely to find Indians who prefer English to Hindi and that includes business communication. This is in contrast to dealing with Japanese or Chinese, where business communication is often limited by lack of useful(!) English knowledge on their side.", "created_utc": "1666685220.0", "edited": "False", "id": "itp4xw5", "is_submitter": "False", "link_id": "t3_yclmz7", "parent_id": "t1_itoq91a", "score": "6", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "gammalsvenska", "body": "That's how I usually react. Or if they wonder about something which I know the answer to, I might just tell them. Depends on the situation, though.", "created_utc": "1665948938.0", "edited": "False", "id": "iskz1st", "is_submitter": "False", "link_id": "t3_y5hb14", "parent_id": "t1_isjmftd", "score": "6", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "gammalsvenska", "body": "Laundry.", "created_utc": "1664621235.0", "edited": "False", "id": "iqlzb9e", "is_submitter": "False", "link_id": "t3_xsh39t", "parent_id": "t3_xsh39t", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "gammalsvenska", "body": "You generally don't drink while sleeping. Your body also slows down production of urine. If you drank a lot before going to sleep, you are likely to wake up early because you need to go (or accept the mishap).", "created_utc": "1664620507.0", "edited": "False", "id": "iqlyfv0", "is_submitter": "False", "link_id": "t3_xsq1iy", "parent_id": "t3_xsq1iy", "score": "3", "subreddit": "explainlikeimfive", "subreddit_id": "t5_2sokd"}, {"author": "gammalsvenska", "body": "Many fully blind people suffer from insomnia and have irregular sleep patterns. Their \"inner clock\" is not synchronized to the day-night cycle at all because they do not perceive any light. This is an indication that humans are unable to meaningfully detect light except for the eyes. So even if there are light-sensing cells, we cannot use them for light sensing.", "created_utc": "1664619724.0", "edited": "False", "id": "iqlximu", "is_submitter": "False", "link_id": "t3_xs4rhf", "parent_id": "t1_iqk1nsq", "score": "8", "subreddit": "askscience", "subreddit_id": "t5_2qm4e"}, {"author": "gammalsvenska", "body": "\"want to communicate with people\" can be an objective by itself. If you are willing to commit, then I wish you the best of luck.", "created_utc": "1664585106.0", "edited": "False", "id": "iqkj3s1", "is_submitter": "False", "link_id": "t3_xsby2s", "parent_id": "t1_iqkinwq", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "gammalsvenska", "body": "Carry a nail file. Everytime you feel like biting off an edge, file that \"problem\" off instead of biting on it. Over time, the nail edge will become smooth so you may feel less like biting on it.", "created_utc": "1664575807.0", "edited": "False", "id": "iqjzx6e", "is_submitter": "False", "link_id": "t3_xriir9", "parent_id": "t3_xriir9", "score": "1", "subreddit": "nailbiting", "subreddit_id": "t5_2vaej"}, {"author": "gammalsvenska", "body": "If you are wondering whether you want to start learning Japanese without any real reason, then my advice is: Don't. Learning a language requires long-term commitment, unfortunately.\n\nAs far as Japanese goes, the pronounciation is easy. The grammar is not particularly hard, but it is very different. The writing system however, is a pain and mastering Kanji will take years of constant practice. That knowledge also fades away unless used.", "created_utc": "1664572726.0", "edited": "False", "id": "iqjszeu", "is_submitter": "False", "link_id": "t3_xsby2s", "parent_id": "t3_xsby2s", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "gammalsvenska", "body": "Almost zero. Flies can't detect slow motion. Move slow enough and you can almost squish it.", "created_utc": "1664571492.0", "edited": "False", "id": "iqjq4u2", "is_submitter": "False", "link_id": "t3_xsbyj4", "parent_id": "t3_xsbyj4", "score": "2", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "gammalsvenska", "body": "In Sweden? Basically necessary. An increasing number of services move towards app-based infrastructure.", "created_utc": "1664571372.0", "edited": "False", "id": "iqjput5", "is_submitter": "False", "link_id": "t3_xsc14y", "parent_id": "t3_xsc14y", "score": "2", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "gammalsvenska", "body": "Private fireworks (new year's eve tradition).", "created_utc": "1664571284.0", "edited": "False", "id": "iqjpnfu", "is_submitter": "False", "link_id": "t3_xsc2k4", "parent_id": "t3_xsc2k4", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "gammalsvenska", "body": "In Swedish, \"vår\" and \"höst\" are used as well.", "created_utc": "1450407829.0", "edited": "False", "id": "cy2zvn7", "is_submitter": "False", "link_id": "t3_3b8ypq", "parent_id": "t1_csxysrt", "score": "1", "subreddit": "danishlanguage", "subreddit_id": "t5_2wjcu"}, {"author": "gammalsvenska", "body": "Knowing Swedish (but no Danish), I have the same problem. Reading works fairly well, but listening is next to impossible. Your problem with Danish is probably not that you miss hearing words, it is that some words *are not even spoken*, which throws you off because you expect them.\n\nI am not against using subtitles, but if you are constantly staring at the screen (and good at reading), that's no good. My recommendation would be to keep some (talkative) radio station or podcast up and running in the background to make your brain more comfortable with the sound.", "created_utc": "1450386773.0", "edited": "False", "id": "cy2nm8w", "is_submitter": "False", "link_id": "t3_3x1ncz", "parent_id": "t3_3x1ncz", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "gammalsvenska", "body": "Struwwelpeter?", "created_utc": "1450385760.0", "edited": "False", "id": "cy2mxiq", "is_submitter": "False", "link_id": "t3_3x2nij", "parent_id": "t1_cy1t49x", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "gammalsvenska", "body": "Same for Danes in Sweden. I have a hard time understanding Danish, so sometimes I just get a comment like \"okay, then I'll have to fake a swedish accent\", which is fair enough. Or the conversation continues in English.", "created_utc": "1450034149.0", "edited": "1450391468.0", "id": "cxxqrwz", "is_submitter": "False", "link_id": "t3_3wdnzv", "parent_id": "t1_cxwzpqx", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "gammalsvenska", "body": "Humans. Think about it.", "created_utc": "1450031479.0", "edited": "False", "id": "cxxow56", "is_submitter": "False", "link_id": "t3_3wob55", "parent_id": "t3_3wob55", "score": "2", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "gammalsvenska", "body": "They could easily do many other things, too. For example, using a different algorithm (or using multiple algorithms!).\n\nBut I tried to point out that usually, you download your files from the same source that you get your checksums from (sometimes even inline!), which is perfectly fine just for corruption checking - even with a bad hashing function.", "created_utc": "1449870023.0", "edited": "False", "id": "cxvsu95", "is_submitter": "False", "link_id": "t3_3wfag4", "parent_id": "t1_cxvrxzp", "score": "1", "subreddit": "linux", "subreddit_id": "t5_2qh1a"}, {"author": "gammalsvenska", "body": "I don't know Spanish, so can't answer that.", "created_utc": "1449869489.0", "edited": "False", "id": "cxvshw2", "is_submitter": "False", "link_id": "t3_3wfab8", "parent_id": "t1_cxvs3e9", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "gammalsvenska", "body": "That depends on the language. In some languages, the writing system is just another language (e.g. Chinese, Japanese), but even in some Germanic languages (e.g. Swiss German or Danish) there is a huge difference between writing and speaking.", "created_utc": "1449868338.0", "edited": "False", "id": "cxvrqng", "is_submitter": "False", "link_id": "t3_3wfab8", "parent_id": "t1_cxvqxdb", "score": "2", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "gammalsvenska", "body": "MD5 is broken for the case of \"I want to generate two messages with the same hash\". It is not broken (yet) for the case of \"I have a message A with some hash and want to create a message B with the same hash\".\n\nIf an attacker is able to replace or change your distribution ISO, then he is also able to replace the MD5 checksum, which is usually stored unencrypted next to the ISO. Here, MD5 is not used as a cryptographic signature, but as a simple check against (e.g. download) corruption. The chance of a randomly changed file to have the same MD5 hash as the original file is extremely low.", "created_utc": "1449868008.0", "edited": "False", "id": "cxvris1", "is_submitter": "False", "link_id": "t3_3wfag4", "parent_id": "t3_3wfag4", "score": "18", "subreddit": "linux", "subreddit_id": "t5_2qh1a"}, {"author": "gammalsvenska", "body": "It's called [confirmation bias](https://en.wikipedia.org/wiki/Confirmation_bias); people want to hear what they already believe, and are much less likely to accept being proven wrong.", "created_utc": "1449697952.0", "edited": "False", "id": "cxtc7e5", "is_submitter": "False", "link_id": "t3_3w4o2v", "parent_id": "t3_3w4o2v", "score": "32", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "gammalsvenska", "body": "Practice doesn't make perfect; practice makes permanent.", "created_utc": "1449697222.0", "edited": "False", "id": "cxtbnfl", "is_submitter": "False", "link_id": "t3_3w4oqd", "parent_id": "t3_3w4oqd", "score": "4", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "gammalsvenska", "body": "Probably not. The common lactose intolerance appears later in life (after you stop drinking your mother's breast milk). That's why it usually isn't a concern for babies. Of course there may be other reasons for intolerance which already appear in newborns.", "created_utc": "1449696200.0", "edited": "False", "id": "cxtavpx", "is_submitter": "False", "link_id": "t3_3w3tt9", "parent_id": "t3_3w3tt9", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "gammalsvenska", "body": "I'm more concerned about the parking brake freezing to the wheel in a cold winter (happened multiple times). Frost is never a problem with leaving it in 1st gear, though.\n\nSide note: On old Saab cars, you actually must put in reverse, otherwise you can't remove the key.", "created_utc": "1449694929.0", "edited": "False", "id": "cxt9xe2", "is_submitter": "False", "link_id": "t3_3w3ybg", "parent_id": "t1_cxt4jli", "score": "1", "subreddit": "explainlikeimfive", "subreddit_id": "t5_2sokd"}, {"author": "gammalsvenska", "body": "    alias ös='ls'\nmost important typo-fixer ever; 'ö' is next to L on my keyboard. ;-)", "created_utc": "1449506201.0", "edited": "False", "id": "cxqdt39", "is_submitter": "False", "link_id": "t3_3vrycr", "parent_id": "t3_3vrycr", "score": "9", "subreddit": "linux", "subreddit_id": "t5_2qh1a"}, {"author": "gammalsvenska", "body": "Interestingly enough, Swedish (and as far as I know, at least Danish and standard Norwegian) differentiate between male/female (utrum) and neutrum.", "created_utc": "1447441753.0", "edited": "False", "id": "cwz6ffo", "is_submitter": "False", "link_id": "t3_3skx6a", "parent_id": "t1_cwypmi7", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "gammalsvenska", "body": "German and Swedish show remarkable differences as well.\nIt is better to treat similarities as coincidences.", "created_utc": "1447375030.0", "edited": "False", "id": "cwycif1", "is_submitter": "False", "link_id": "t3_3skx6a", "parent_id": "t1_cwy9ur8", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "gammalsvenska", "body": "Does it matter? The amount of sleep you need is not constant anyway (as a baby you slept most of the day; as an old person you will probably sleep a lot more than now, too). Your body knows when (and how much) sleep it needs, just listen. You can also distribute smaller amounts of sleep over the day.", "created_utc": "1447357325.0", "edited": "False", "id": "cwy0uz1", "is_submitter": "False", "link_id": "t3_3sk1sc", "parent_id": "t1_cwxwc4d", "score": "2", "subreddit": "explainlikeimfive", "subreddit_id": "t5_2sokd"}, {"author": "gammalsvenska", "body": "There are official reasons (preventing crime before it happens, or even before the criminal in question even had the idea), and there are the real reasons (power). If you know something non-public about another person, then you wield power over that person. \"Knowledge is power.\"\n\nAlso, if you are spying on everyone, you don't have to justify spying on any person anymore. This leads to enough kompromat (blackmail-usable knowledge) to destroy lives and carriers of people you don't want to rise (e.g. current european right-wing parties).\n\nIncidently, that's why countries spy on each other, that's why companies spy on each other. It is a balance-of-power game. Which, in my opinion, is a different game than a government spying on its own citizens.", "created_utc": "1447356616.0", "edited": "False", "id": "cwy0dje", "is_submitter": "False", "link_id": "t3_3sk4ho", "parent_id": "t3_3sk4ho", "score": "1", "subreddit": "explainlikeimfive", "subreddit_id": "t5_2sokd"}, {"author": "gammalsvenska", "body": "The same as \"why do people believe in <insert religion of choice here>?\" Because it provides answers to questions. It doesn't matter whether these answers are correct or not, but nevertheless they provide a guideline to follow.", "created_utc": "1447355823.0", "edited": "False", "id": "cwxztzq", "is_submitter": "False", "link_id": "t3_3skf2i", "parent_id": "t3_3skf2i", "score": "3", "subreddit": "explainlikeimfive", "subreddit_id": "t5_2sokd"}, {"author": "gammalsvenska", "body": "Decide early which country you want to go to and read the documentation. Expect that bureaucracy people do not know their own regulations! Expect that things take forever because of delays, ignorance, whatever. Expect inconsistencies, because the local population is expected to have all kinds of things you don't have and people might not know how to handle these situations (and sometimes flat-out refuse service).\n\nTry to save up as much money as possible beforehand, not only the trip. Try to get a job (or at least some contacts, to see what your chances are) before moving. Learn the basics of the language. When you are there, USE the local language, otherwise you'll never learn it.\n\nHousing might be a problem. Assume that you will pay a lot for rent. Some cities are insane (e.g. Stockholm), so better assume additional expenses for travelling to any job. Generally, assume everything to be twice as expensive as you expect it to be (you don't specify your current country, so it's hard to compare) - better have some money left than missing it.\n\nHealth insurance might be a problem. Talk to your insurance about how things work if you live outside the country: They may expect you to pay the full price yourself, which may be more than what you'd think. You may not be allowed to register in your destination country unless you can prove your health insurance. When you get a job, this may include health insurance due to you paying taxes, check the local regulations. It may or may not be easy to lose your old country health plan at that time.\n\nBanking might be a problem. For example, Sweden uses two banking systems (...giro), which probably don't exist in your country - which means that you might not be able to pay any bills unless you have a bank account in your destination country (which will cost money). You can pay those in cash at e.g. Forex, but they take a fee is per-transaction and that adds up easily. You might not be able to open a bank account unless you are properly registered - which may or may not be fast. You may or may not be able to get a job unless you have a bank account (many employers don't want the hassle of paying to a foreign account; if it is possible, this may affect the amount of tax you pay and your health care). Expect to be sent around in circles if people don't know their rules. If needed, try to have questions escalated so that people will call you back with a more trustworthy answer. You might need a written statement from your home bank that you are a good citizen.\n\nIf you trust your parents, provide them with a letter of authorization, so that they can handle everything related to you without you needing to be present (helped me immensely with health insurance stuff). Keep strong home ties until things are going smoothly (may cost extra because paying twice for a while). There is no need to stress yourself additionally while having all the basic stuff (language, job, unfamiliar environment, ...) already going on. Think about specific import tax regulations (e.g. importing a car might cost much more than buying a used better car would cost).\n\nWhen you have decided your country, try to look on the internet for forums specific, they tend to know more details.\n\nedit: Schengen regulations allow for staying three months only; try to register early to get a residence permit (and e.g. personal number) as soon as possible.\n\nMy background: Moved to Sweden in 2012 to study, currently employed. Getting the personal number took 10 months (PITA). Getting proof of health insurance took 11 months.", "created_utc": "1447349547.0", "edited": "1447349798.0", "id": "cwxvjvz", "is_submitter": "False", "link_id": "t3_3sjerr", "parent_id": "t3_3sjerr", "score": "1", "subreddit": "personalfinance", "subreddit_id": "t5_2qstm"}, {"author": "gammalsvenska", "body": "Plus, you only need one printer for the letter and one machine to put the letter into the envelope instead of two printers. And you can buy huge amounts of envelopes in a standard size at a time.", "created_utc": "1447022422.0", "edited": "False", "id": "cwtd5xj", "is_submitter": "False", "link_id": "t3_3s24ew", "parent_id": "t1_cwtd0em", "score": "1", "subreddit": "explainlikeimfive", "subreddit_id": "t5_2sokd"}, {"author": "gammalsvenska", "body": "Earth itself has a magnetic field, and if it can, a magnet will move until the magnetic north pole will point (roughly) to the north pole, and the magnetic south pole will point (roughly) to the south pole. That's how a compass works.", "created_utc": "1447022204.0", "edited": "False", "id": "cwtd0oi", "is_submitter": "False", "link_id": "t3_3s24gg", "parent_id": "t3_3s24gg", "score": "3", "subreddit": "explainlikeimfive", "subreddit_id": "t5_2sokd"}, {"author": "gammalsvenska", "body": "I found a bible in a hotel with one verse translated into many languages. The Turkish translation mentioned \"Allah\" (although my collegue mentioned that Turkish does have different words for Allah and god). None of us could understand the Arabic translations to check those, though.\n\nFun fact: Strictly religious jews won't even write \"Jehovah\" on a piece of paper, since while writing is allowed, destroying anything with the name of God is forbidden.", "created_utc": "1447022053.0", "edited": "False", "id": "cwtcx7s", "is_submitter": "False", "link_id": "t3_3s1x23", "parent_id": "t1_cwtazvs", "score": "2", "subreddit": "explainlikeimfive", "subreddit_id": "t5_2sokd"}, {"author": "gammalsvenska", "body": "You might not hire another employee, but you might spread happyness and pay your current employee better. In exchange for that, the employee might want to stay with your shop (you don't need to search for and train employees), might increase quality of service (happy employees = happy customers), which might increase your income (happy customers = more money). That's the theory.", "created_utc": "1447021334.0", "edited": "False", "id": "cwtcfx6", "is_submitter": "False", "link_id": "t3_3s21bt", "parent_id": "t3_3s21bt", "score": "1", "subreddit": "explainlikeimfive", "subreddit_id": "t5_2sokd"}, {"author": "gammalsvenska", "body": "How do you define \"they look 30\" or \"they look 50\"? One major reason is the quality of their skin. For example, skin doesn't like sunlight (UV exposure) or lots of chemicals, and detoriates faster. The body can't regenerate cells forever (and the replacements tend to be of lower quality, because of DNA copy mistakes and stuff; that's why sunburn is related to skin cancer). How good the cell regeneration system works, and what cell quality people start at is largely genetic.\n\nYou can't change your genes, but you can accelerate aging.", "created_utc": "1447020733.0", "edited": "False", "id": "cwtc19p", "is_submitter": "False", "link_id": "t3_3s1r2a", "parent_id": "t3_3s1r2a", "score": "1", "subreddit": "explainlikeimfive", "subreddit_id": "t5_2sokd"}, {"author": "gammalsvenska", "body": "Static electricity.\n\nYou and the door knob are on different electric potentials (that means: there is a voltage between both), and when you touch the door know, a current will flow until the potential is the same again. The voltage could be really high, multiple kilo-volts; that's why it hurts. (The current is very small, that's why there's no danger.)\n\nIf you use shoes with rubber soles on plastic ground, you attract charges, which will raise your electric potential compared to the rest of the world. Depending on the environment (air humidity etc.) you discharge faster or slower over time. If the difference in potential (voltage) is big enough, you get shocked.\n\nTry to change your shoes if it happens too often. Or touch something grounded (heater, water pipe, etc.) to discharge. Use a metal key to not hurt yourself. :-)", "created_utc": "1447019863.0", "edited": "False", "id": "cwtbg2e", "is_submitter": "False", "link_id": "t3_3s1tsm", "parent_id": "t3_3s1tsm", "score": "2", "subreddit": "explainlikeimfive", "subreddit_id": "t5_2sokd"}, {"author": "gammalsvenska", "body": "One reason is deliberately omitting information, best explained by the [SNAFU principle](http://www.jargon.net/jargonfile/s/SNAFUprinciple.html), and also related is deniability or ass-covering: The higher-ups can always show that they did not have the correct / full information needed to do the correct decision. At the same time, they make sure that they are not told everything, by waving things off and having the lower levels worry about. In international companies - by no means banks only - this goes on for multiple layers, where each layer is concerned about not knowing too much, leading to *structural* incompetence.\n\nAt some point, it is impossible to see whether something was done with malicious intent (corruption) or not (stupidity). See your favourite politian or the party they're in.", "created_utc": "1447019022.0", "edited": "False", "id": "cwtauxq", "is_submitter": "False", "link_id": "t3_3s1ue4", "parent_id": "t3_3s1ue4", "score": "1", "subreddit": "explainlikeimfive", "subreddit_id": "t5_2sokd"}, {"author": "gammalsvenska", "body": "Traditionally, USB provided 5 V at 500 mA (2.5 W total) on each port. This only applies to the USB device correctly registering and specifying its consumption (e.g. mobile phones using USB on-the-go often won't supply more than 100 mA to conserve the battery; their operating system would then reject a device asking for more). That's e.g. why Y-cables for portable hard drives violate the standard. However, since many chipsets don't care too hard, devices stopped caring, leading to some problems.\n\nThe USB battery charging specification describes, how (with some resistors) devices can be allowed to charge more than 100 mA without a functioning USB host. To my knowledge, Apple is the only company ignoring that standard today, so using Apple chargers with USB devices - or Apple devices with USB chargers - may damage either of them. (Note that Apple using the USB to charge batteries predates the specification.)\n\nUSB 3 allows higher currents and consequently requires better cables and different connectors for this.", "created_utc": "1447017621.0", "edited": "False", "id": "cwt9trp", "is_submitter": "False", "link_id": "t3_3s11nd", "parent_id": "t3_3s11nd", "score": "1", "subreddit": "explainlikeimfive", "subreddit_id": "t5_2sokd"}]