[{"author": "getsandom", "body": "I guess that anime community is getting to the point where some of us who are a into anime and a bit older will have had kids that are now old enough to be watching. I'm 40 and while I don't have kids, my nephew who is 16 been watching for a long while now an  my niece whos is 11 is has been going through the usual suspects (Naruto, One Piece, probably others) for some time.\n\nThe curious thing in my case is that as a kid I couldn't care less, I was almost 30 when I started getting into anime.", "created_utc": "1667190423.0", "edited": "False", "id": "iugnq8g", "is_submitter": "False", "link_id": "t3_yh6ops", "parent_id": "t1_iudd84n", "score": "1", "subreddit": "anime", "subreddit_id": "t5_2qh22"}, {"author": "getsandom", "body": "I just wish it wasn't necessary but with the output expected from studios these days its to be expected. CG is a curious thing, when done well it will disappear in the background but it's more work than the 2D animation so when you use it as a shortcut which will prevent it to be well done it gets as jarring as in Black Summoner. I this particular case I, just wish the didn't use it so much on the main characters, a bunch of mobs on the background would be fine but what they did looked like someone took some cell shaded game footage (which is usually awful) and interspersed with the 2d.", "created_utc": "1667189849.0", "edited": "False", "id": "iugmuty", "is_submitter": "False", "link_id": "t3_yhc97j", "parent_id": "t3_yhc97j", "score": "1", "subreddit": "anime", "subreddit_id": "t5_2qh22"}, {"author": "getsandom", "body": "Juni Taisen (Zodiac War): little gem of a show, judging by your taste the level of gore wouldn't be a problem.", "created_utc": "1667189200.0", "edited": "False", "id": "iuglun6", "is_submitter": "False", "link_id": "t3_yhe7i3", "parent_id": "t3_yhe7i3", "score": "1", "subreddit": "anime", "subreddit_id": "t5_2qh22"}, {"author": "getsandom", "body": "I haven't been trough my background list as much recently, so it's been a while since I posted here but there were a few recent updates\n\nTaiho Shichau zo (You Are Under Arrest) (1996): finished this week, typical 1990's vibe on this one, was mostly on the background as I did other things.\n\nHanda-kun (2016): Not as old as the stuff I usually simmer in the background, just not interesting enough to be a foreground player.\n\nTetsuwan Birdy (OVAs) (1996): I'm a fan of the manga and had watched the full anime a couple of times but only got around to watch the original OVAs recently.", "created_utc": "1667188313.0", "edited": "False", "id": "iugkdvi", "is_submitter": "False", "link_id": "t3_yho9rz", "parent_id": "t3_yho9rz", "score": "3", "subreddit": "anime", "subreddit_id": "t5_2qh22"}, {"author": "getsandom", "body": "If I'm not expecting much from something it usually gets pushed to the back of my to-watch list but sometimes I do get a show here and there I don't know a thing about and a had my share of pleasant surprises. Otome Youkai Zakuro, Katanagatari, Shangri-La, Cop Craft, Un-Go, Ride Back, Shion no Ou, to name a few.", "created_utc": "1667187186.0", "edited": "False", "id": "iugifop", "is_submitter": "False", "link_id": "t3_yhpoc6", "parent_id": "t3_yhpoc6", "score": "2", "subreddit": "anime", "subreddit_id": "t5_2qh22"}, {"author": "getsandom", "body": "As a kid I actively avoided anime, only ever watched the odd episode on here and there on airwave TV (I'm old enough to cable not to be a thing here in Brazil at the time) when there was nothing else to watch, I only really picked up something to see what it was like on an almost dare from a pair of friends an never looked back.\n\nFirst thing I watched start to finish was Cardcaptor Sakura, you might say almost a challenge to myself to see what people liked so much in shows that were supposedly targeted not only kids but girls from an outsider perspective, you might say I was blown away by how different anime treats the audience. At the time (some \\~13 years ago) American animation was way far on its last legs and kids shows were basically written by condescending nannies, while anime preserved the wit and depth I loved from the older 2D Disney movies but with a way wider array of arguments/subjects, the Japanese basically treat animation as it ought to be, as medium, a canvas that accepts everything. Over 21000 episodes latter I don't see a time I'd ever stop watching.", "created_utc": "1667185775.0", "edited": "False", "id": "iugfsqi", "is_submitter": "False", "link_id": "t3_yht0p2", "parent_id": "t3_yht0p2", "score": "1", "subreddit": "anime", "subreddit_id": "t5_2qh22"}, {"author": "getsandom", "body": "AFAIK Durarara is a play on the headless rider who is a Dullahan, a form of spirit from Irish folklore.", "created_utc": "1667114877.0", "edited": "False", "id": "iucfse4", "is_submitter": "False", "link_id": "t3_ygafjb", "parent_id": "t1_iu9msjp", "score": "2", "subreddit": "anime", "subreddit_id": "t5_2qh22"}, {"author": "getsandom", "body": "The inability of letting something that is making you unhappy go, even if it's only a slight annoyance for wasting your free time, is definitely unhealthy.", "created_utc": "1667114419.0", "edited": "False", "id": "iucf8nn", "is_submitter": "False", "link_id": "t3_ygk31x", "parent_id": "t3_ygk31x", "score": "1", "subreddit": "anime", "subreddit_id": "t5_2qh22"}, {"author": "getsandom", "body": "New Vegas I only ever modded to make it more playable.\n\nMinecraft more or less the same, the base game is nice enough but i can get more fun with mods. \n\nSkyrim on the other hand, the base game can be completely different depending on the set of mods you use and you can easily double the content, or can literally play another full featured AAA game with Enderal, I'd argue it would be hard to find that range in another game even the other Bethesda ones.", "created_utc": "1667108288.0", "edited": "False", "id": "iuc7lz8", "is_submitter": "False", "link_id": "t3_yh1hno", "parent_id": "t3_yh1hno", "score": "3", "subreddit": "gaming", "subreddit_id": "t5_2qh03"}, {"author": "getsandom", "body": "Maybe some more down to earth romance like Golden Time or Tada-kun wa Koi wo Shinai. Gosick is a good semi-historic mystery one. Shinrei Tantei Yakumo is good detective show. Or some light fantasy like Otome Youkai Zakuro.", "created_utc": "1666672606.0", "edited": "False", "id": "itoogdx", "is_submitter": "False", "link_id": "t3_yc0wiz", "parent_id": "t3_yc0wiz", "score": "1", "subreddit": "anime", "subreddit_id": "t5_2qh22"}, {"author": "getsandom", "body": "If I had to choose, Cardcaptor Sakura, which incidentally was the first anime I picked to watch start to end. Also Ranma 1/2, it's very much an 1980's title but it's whole lot of fun.", "created_utc": "1666671326.0", "edited": "False", "id": "itombng", "is_submitter": "False", "link_id": "t3_yc62mg", "parent_id": "t3_yc62mg", "score": "1", "subreddit": "anime", "subreddit_id": "t5_2qh22"}, {"author": "getsandom", "body": "When I'm up for some unwinding from real life (and not to overlap with the other comments excelent suggestions) my favorite escape is some of the sillier OP-MC isekais, Leadale, Kuma Kuma Kuma Bear, Fruit of Evolution, and the like.\n\nIf you a up to something very laidback but less out there, there is a little gem called Isekai Shokudou, which is incidentally is a reverse isekai.", "created_utc": "1666670100.0", "edited": "False", "id": "itok5nh", "is_submitter": "False", "link_id": "t3_yc997d", "parent_id": "t3_yc997d", "score": "2", "subreddit": "anime", "subreddit_id": "t5_2qh22"}, {"author": "getsandom", "body": "I'm not sure most people, me included, will understand where you are coming from. If you are talking about interacting with the anime community, even if you ever only watched one episode, you still should be able to to talk about it. Watching anything, anime included, is supposed to be for your entertainment not to produce stats.\n\nThere is a section of the community that is unhealthily completionist and won't, for example, drop an anime they don't enjoy just for the sake of adding it to the list, my only advice for you would be don't do that. Watch anime to have fun, and come here talk to us weebs about it at your own pace.", "created_utc": "1666669291.0", "edited": "False", "id": "itoio0e", "is_submitter": "False", "link_id": "t3_yca9dn", "parent_id": "t3_yca9dn", "score": "2", "subreddit": "anime", "subreddit_id": "t5_2qh22"}, {"author": "getsandom", "body": "I'm up to 21062 in this exact moment.\n\nI've been watching anime for some 13 years now but if I had to say, almost half of that time I was on hiatus either because nothing caught my eye or I was focused into something else and while I watch a lot I not exactly obsessive with it.\n\nI go through 12 to 15 episodes a day at the most so I'd say for a full lifetime even if you go strong but moderate like me 100K is a low number, 300\\~400K episodes would probably last a lifetime tough.", "created_utc": "1666668133.0", "edited": "False", "id": "itogf87", "is_submitter": "False", "link_id": "t3_ychg8s", "parent_id": "t3_ychg8s", "score": "2", "subreddit": "anime", "subreddit_id": "t5_2qh22"}, {"author": "getsandom", "body": "People who go looking for it will always find it, most of the time just to justify that they want to be the anime community but want anime to bend to their \"victimist\" world views.", "created_utc": "1666580487.0", "edited": "False", "id": "itjltks", "is_submitter": "False", "link_id": "t3_ybbn75", "parent_id": "t3_ybbn75", "score": "0", "subreddit": "anime", "subreddit_id": "t5_2qh22"}, {"author": "getsandom", "body": "From the point of view of use, they are used very sparingly.\n\nThe only anime made using full rotoscoping I ever heard of was Flowers of Evil, to a result so bad in my opinion I didn't manage to get past a full episode so disturbingly distracting it was.\n\nMotion capture is used for 3d animation in general but since the reason for using it is to get as natural an animation as possible it doesn't really have much of a place in the 3d that is inserted into anime. Although full 3d animated shows are becoming more common specially some of the \"promotional\" and low production value ones, when most anime usually uses cell shaded 3d it is as cost saving measure, for example when you need to animate large groups of \"mob\" characters ou for things with a lot of flat  surfaces like vehicles/mechas/background buildings that don't get weird when cell-shaded from 3d.\n\nThe thing is, paradoxically, 2d animation can do things that are simply not possible to make look good or natural in 3d, so any technic that brings the limitations of 3d will generally not have widespread use.", "created_utc": "1666577591.0", "edited": "False", "id": "itjfrz4", "is_submitter": "False", "link_id": "t3_ybuyfh", "parent_id": "t3_ybuyfh", "score": "1", "subreddit": "anime", "subreddit_id": "t5_2qh22"}, {"author": "getsandom", "body": "To me anime always felt like it never get much beyond what you would find in a run of the mill B level slasher horror, them again I'm not squeamish at all and watched the likes of Elm Street for the giggles.\n\nManga on the other hand can get way out there, my favorite manga of all time is quite on that vein, Franken Fran it's a seriously underrated gem.\n\nIf I had to say, the one I've read that could get most people unsettled though would be Tokyo Akazukin.\n\nP.S.: I've being reading (and loving) Torture Princess and it can get gruesome but since it's novel it's not as impactful", "created_utc": "1666506123.0", "edited": "1666506865.0", "id": "itfex6c", "is_submitter": "False", "link_id": "t3_yangzn", "parent_id": "t3_yangzn", "score": "1", "subreddit": "anime", "subreddit_id": "t5_2qh22"}, {"author": "getsandom", "body": "Basically the same for me on the isekai side", "created_utc": "1666504580.0", "edited": "False", "id": "itfcy45", "is_submitter": "False", "link_id": "t3_yavth3", "parent_id": "t1_itfc44y", "score": "1", "subreddit": "anime", "subreddit_id": "t5_2qh22"}, {"author": "getsandom", "body": "For me it's not a particular show per se, I have a huge soft spot for the OP-MC-everything-always-goes-right isekai the likes of Leadale ou Kuma Kuma Kuma Bear. I usually watch those (or some comfy treat like Yurucamp) to turn my brain of and relax, unwind the day so to speak.", "created_utc": "1666504396.0", "edited": "1666504652.0", "id": "itfcpnx", "is_submitter": "False", "link_id": "t3_yavth3", "parent_id": "t3_yavth3", "score": "1", "subreddit": "anime", "subreddit_id": "t5_2qh22"}, {"author": "getsandom", "body": "I don't much care for the normal world itself since we a going to get there at some point anyway but I have an absolute fascination with the Unlimited Neutral Field from Accel World.", "created_utc": "1666503476.0", "edited": "False", "id": "itfbhe2", "is_submitter": "False", "link_id": "t3_yb5fo4", "parent_id": "t3_yb5fo4", "score": "2", "subreddit": "anime", "subreddit_id": "t5_2qh22"}, {"author": "getsandom", "body": "The advantage of a PC it's you don't have to choose. I play with my PC connected on my LG C1.", "created_utc": "1666501201.0", "edited": "False", "id": "itf8a46", "is_submitter": "False", "link_id": "t3_yazijz", "parent_id": "t3_yazijz", "score": "1", "subreddit": "gaming", "subreddit_id": "t5_2qh03"}, {"author": "getsandom", "body": "There are some very long ones if you are a completionist but they don't get much over 200 hours, The Witcher 3 took me 275 hours to play but I did in Death March (highest difficulty) and I literally did every single quest an visited every single rock and patch of land in the map, including every single rock poking out of the water or bit of floating debris in Skellige.\n\nIf you are talking about games you can solo or are single player excluding MMOs the only titles I'd say can get some people to play that long are sandbox RPGs like the Bethesda ones which have the advantage of the huge mod community to keep them fresh and sandbox survival ones like Minecraft and No Mans Sky.\n\nMe personally, I have a good 2500 hours in Skyrim but it's been a couple of years since I've done a playthrough. I've played some 800 hours of No Mans Sky mostly roaming the galaxies since I ain't much of a base builder and at least double that in Minecraft. Those and Borderlands 2 (300+ hours in it) are the only ones I keep getting eventually back to even if I take a break.", "created_utc": "1666499811.0", "edited": "False", "id": "itf65y6", "is_submitter": "False", "link_id": "t3_yb1o1z", "parent_id": "t3_yb1o1z", "score": "1", "subreddit": "gaming", "subreddit_id": "t5_2qh03"}, {"author": "getsandom", "body": "Being power efficient it's always inversely proportional to being capable to actually go through all the data transformation necessary for the processing being made in the time allotted. \n\nThe best example that a simple instruction set does not mean less power draw if the data you have to go through is huge are exactly the GPUs you mentioned. GPU cores are a lot simpler than ARM or maybe even RISC-V ones since they barely have to do anything other that move data around and do basic math with it and still here we are with GPUs asking to be provided with up to 600W of power because to get through with all the data in time to pump 3840x2160x120 pixels per second or more they have to have upwards of 10000 of the simple cores instead of the max 128 for x86 CPUs or 80 for the ARM ones.", "created_utc": "1666498229.0", "edited": "False", "id": "itf3m8j", "is_submitter": "False", "link_id": "t3_yb1o3d", "parent_id": "t3_yb1o3d", "score": "1", "subreddit": "gaming", "subreddit_id": "t5_2qh03"}, {"author": "getsandom", "body": "Here in Brazil we exclusively use the Sabin (oral) vaccine since it was included in the children's standard vaccination program back in the 1970's. As far a I know polio has been eradicated with no cases since before I was born, the last case transmitted here that I'm aware of is from 1980.\n\nIt's a shame the shoddy effectiveness of basically all Covid vaccines put the trust in vaccines in general at risk, here in Brazil one of the few truly effective public health programs was the vaccination campaigns.", "created_utc": "1666420240.0", "edited": "False", "id": "itaxps0", "is_submitter": "False", "link_id": "t3_ya2uy5", "parent_id": "t1_itas17l", "score": "6", "subreddit": "news", "subreddit_id": "t5_2qh3l"}, {"author": "getsandom", "body": "I've been watching anime for some 13 years now with a few year-plus-long pauses here and there, I just got past over 21000 episodes from 1684 series/seasons/shows.", "created_utc": "1666150817.0", "edited": "False", "id": "isw7z76", "is_submitter": "False", "link_id": "t3_y77cuw", "parent_id": "t3_y77cuw", "score": "1", "subreddit": "anime", "subreddit_id": "t5_2qh22"}, {"author": "getsandom", "body": "I've seen a few chromatic planets that do that but they were not this pleasant to be at, I've seen a few that had a monochrome color around the player but were grayscale at the horizon or vice-versa. Also I've come across a couple where the grass changes color depending whether is in light or shade. I remember having a base on one paradise planet that had grass that was orange in day light but green in shadow or at night. If I manage to dig the coords I'll post then latter.", "created_utc": "1666148981.0", "edited": "False", "id": "isw4eut", "is_submitter": "False", "link_id": "t3_y7mv79", "parent_id": "t3_y7mv79", "score": "5", "subreddit": "NMSCoordinateExchange", "subreddit_id": "t5_3lqlo"}, {"author": "getsandom", "body": "The composer is [Inon Zur](https://en.wikipedia.org/wiki/Inon_Zur), I'm quite a fan and his work is amazing, he is quite well known in the game industry with works on the Baldurs Gate,  Warhammer, Prince of Persia and other famous series and has worked with Bethesda a number of times including in Fallout 3 and 4 and now Starfield.", "created_utc": "1666129409.0", "edited": "False", "id": "isuwmfp", "is_submitter": "False", "link_id": "t3_y7h884", "parent_id": "t3_y7h884", "score": "1", "subreddit": "gaming", "subreddit_id": "t5_2qh03"}, {"author": "getsandom", "body": "To me, knowing a story and watching it performed are two distinct and completely unrelated experiences, to the point I can affirm you cannot spoil a show/movie for me, not in this sense anyway.\n\nWhen I still cared to got the the movies I used to go because I've read the book not despite of it. To a lesser extent with anime, there were times I ran ahead and read the manga or novel before watching the show.\n\nYou could say my enjoyment it's compartmentalized and surprise plays absolutely no part in it.", "created_utc": "1666060508.0", "edited": "False", "id": "isr7sei", "is_submitter": "False", "link_id": "t3_y5zwrj", "parent_id": "t3_y5zwrj", "score": "1", "subreddit": "anime", "subreddit_id": "t5_2qh22"}, {"author": "getsandom", "body": "First, IQ is way overated by most people, probably because it's a number which means you can get and objective comparisons out of it, still I'm yet to find a single 200+ IQ owner you would easily find the name of just by asking someone on the streets at random.\n\nSecond, what the IQ number represents it's a portion of intelligence that rarely take part in artistic endeavor, IQ tests a made to test raw logical reasoning on the \"capacity to do math\" level similar to a computer benchmark, so while I'm sure it doesn't hurt to be math smart i don't think it's a hard requirement to be a good storyteller.", "created_utc": "1665976318.0", "edited": "False", "id": "ismprml", "is_submitter": "False", "link_id": "t3_y5wpku", "parent_id": "t3_y5wpku", "score": "3", "subreddit": "anime", "subreddit_id": "t5_2qh22"}, {"author": "getsandom", "body": "When I get into something I like to dive into it, I'm of the type to pick a volume of a book and only put it down after finishing it, so in my case I always been a binge watcher for everything, even back when I also consumed western media regularly.\n\nI couldn't care less about the so called \"community talk\", first I watch/listen/read things for my enjoyment, getting to discuss them with other people is a small bonus not the crux of the matter, second if a series/show/movie is interesting it's not going to fade away as soon as it's finish airing.\n\nAnother point some people bring in which I'm quite different it's spoilers, basically no one can spoil a movie or show for me, you telling me a story and me watching are completely different experiences, knowing how a story goes is not the same as watching it performed and one cannot diminish the enjoyment of the other.\n\nIn the end of the day though, it's a quite personal thing though and it might even be a different experience depending on the show for you.", "created_utc": "1665975534.0", "edited": "False", "id": "ismo6lf", "is_submitter": "False", "link_id": "t3_y5ya79", "parent_id": "t3_y5ya79", "score": "1", "subreddit": "anime", "subreddit_id": "t5_2qh22"}, {"author": "getsandom", "body": "With a few exceptions I don't generally rewatch shows as a general rule, for Girls Last Tour while I loved it is not the kind of show that would get on my select rewatch list.\n\nIf you started but didn't get to finish though, getting back from the start might be a good idea and it wouldn't take long anyway.", "created_utc": "1665894064.0", "edited": "False", "id": "isi6xa8", "is_submitter": "False", "link_id": "t3_y4q9jo", "parent_id": "t3_y4q9jo", "score": "1", "subreddit": "anime", "subreddit_id": "t5_2qh22"}, {"author": "getsandom", "body": "Full Dive: This Ultimate Next-Gen Full Dive RPG Is Even Shittier than Real Life!\n\nThe title should have been a red flag but I generally try to give even bad ideas a chance, usually to much regret.\n\nI'm not a completionist, if I'm not feeling a story I'll drop it, but in this one the characters were so annoying they managed to make me not finish the second episode.", "created_utc": "1665893596.0", "edited": "False", "id": "isi65fb", "is_submitter": "False", "link_id": "t3_y4r2hp", "parent_id": "t3_y4r2hp", "score": "3", "subreddit": "anime", "subreddit_id": "t5_2qh22"}, {"author": "getsandom", "body": "For me was not even about the situations per se, but every character was so damn unsettling I didn't care to go back for the second episode.", "created_utc": "1665893166.0", "edited": "False", "id": "isi5evs", "is_submitter": "False", "link_id": "t3_y4r2hp", "parent_id": "t1_ish4732", "score": "1", "subreddit": "anime", "subreddit_id": "t5_2qh22"}, {"author": "getsandom", "body": "I somewhat of an unempathetic old bastard so the only way media usually makes me feel is annoyed for investing my time when something turns out not to be fun.\n\nIn the particular case of Edgerunners, it managed to not suck for longer than I care to admit even if the the end was, let's say, unsatisfying, for me at least. The one thing I'll admit tough, I need more Rebecca in my life for sure.", "created_utc": "1665892510.0", "edited": "False", "id": "isi48fo", "is_submitter": "False", "link_id": "t3_y4yn6q", "parent_id": "t3_y4yn6q", "score": "1", "subreddit": "anime", "subreddit_id": "t5_2qh22"}, {"author": "getsandom", "body": "Juuni Taisen, short little gem I watched a bit ago.", "created_utc": "1665891686.0", "edited": "False", "id": "isi2oxt", "is_submitter": "False", "link_id": "t3_y54px2", "parent_id": "t3_y54px2", "score": "1", "subreddit": "anime", "subreddit_id": "t5_2qh22"}, {"author": "getsandom", "body": "When I heard of the concept they were going to into for the movies I tough it had a lot of potential, but after watching it, what I cannot fathom for the life of me is why they felt the need to split movie Asuna that badly from anime and novel when she is awesome as she already is. In my opinion was a hell of shit move, awfully diluting her reason to be the way she is in the rest of the story.\n\nI don't dislike Mito as character as much as the fact that she was shoehorned in, if she was always a part of the story it would not be a problem, what I cannot stand it's the interference from the movie producers, not only changing the stablished story from the novels and previous anime but also against Kawahara's wishes. I even heard rumors they asked him to retcon her into Progressive.", "created_utc": "1665889869.0", "edited": "False", "id": "ishz5ux", "is_submitter": "False", "link_id": "t3_y3l1ve", "parent_id": "t3_y3l1ve", "score": "1", "subreddit": "swordartonline", "subreddit_id": "t5_2uikt"}, {"author": "getsandom", "body": "I haven't been a kid in a long while (I'm probably older than you) but if I had to put into words I'd say for me what keeps me getting back to anime in general is 2 things: \n\nFirst 2d animation have no bounds. Even 3d animation have limitations that 2d don't have, paradoxical as it may sound.\n\nSecond, in anime there is something for everyone literally from shows targeted a preschool kids to porn, and even when a show is made with kids in consideration it doesn't threat the audience like a condescending half-brained nanny like western animation has in the last 20 years.\n\nThat's probably a lot more philosophical than what gets your kid in front of the TV tough, as people have commented, you should probably try to watch together once in a while to get his side of the story.", "created_utc": "1665812051.0", "edited": "False", "id": "isdvcm0", "is_submitter": "False", "link_id": "t3_y2jgn6", "parent_id": "t3_y2jgn6", "score": "1", "subreddit": "anime", "subreddit_id": "t5_2qh22"}, {"author": "getsandom", "body": "Just because something is made with kids in mind it shouldn't mean adults cannot enjoy. I'm a 40 year old burly gray bearded guy and didn't get into anime until I was almost 30 and some of my favorite shows not only would be called \"for kids\"  but probably \"for girls\" by the \"normies\" and I couldn't give half a fart on any ones opinions.", "created_utc": "1665810564.0", "edited": "False", "id": "isdt9z7", "is_submitter": "False", "link_id": "t3_y3g46p", "parent_id": "t3_y3g46p", "score": "1", "subreddit": "anime", "subreddit_id": "t5_2qh22"}, {"author": "getsandom", "body": "I was under the impression the the manga was the original but it was super short (like less than 10 chapters short) and the story was vastly expanded for the anime. Maybe they picked the argument, expanded for the anime then adapted it back to continue the manga?", "created_utc": "1665808386.0", "edited": "False", "id": "isdq2bn", "is_submitter": "False", "link_id": "t3_y3gn3y", "parent_id": "t1_is8vqcj", "score": "1", "subreddit": "anime", "subreddit_id": "t5_2qh22"}, {"author": "getsandom", "body": "A lot of turn-based strategy games can be played effectively with mouse only, something like the Divinity, XCOM or Wasteland series.", "created_utc": "1665214022.0", "edited": "False", "id": "irht02h", "is_submitter": "False", "link_id": "t3_xybgzr", "parent_id": "t3_xybgzr", "score": "1", "subreddit": "gaming", "subreddit_id": "t5_2qh03"}, {"author": "getsandom", "body": "SAO the anime might be 10 but SAO as franchise is 20 already. SAO started as a web-novel in 2002.", "created_utc": "1664689133.0", "edited": "False", "id": "iqpt6s1", "is_submitter": "False", "link_id": "t3_xswiz8", "parent_id": "t1_iqnz3vv", "score": "6", "subreddit": "swordartonline", "subreddit_id": "t5_2uikt"}, {"author": "getsandom", "body": "I'm almost sure it's intentional and not an animation limitation, the tech we have for video processing was not that much inferior to what we have now just a decade ago, most of the advance we got was on file size, which it's not as important in a professional video editing setting as they usually deal on raw video formats. They could easily just pick a video of the real sky and blend it to a uniform color field on the animation background just as you would do with a greenscreen on live action, it would just take a couple of times longer to render the episodes, say 10 hours instead o 2\\~3 we'd get today, no big deal in my opinion.\n\nEdit: looking closer on the Alicization side, I'm almost sure they did just what I was saying, blend live action video to the animation.", "created_utc": "1664655705.0", "edited": "1664655907.0", "id": "iqnzb9r", "is_submitter": "False", "link_id": "t3_xswiz8", "parent_id": "t1_iqns9gc", "score": "10", "subreddit": "swordartonline", "subreddit_id": "t5_2uikt"}, {"author": "getsandom", "body": "I'm not sure if it's intentional but it would make sense if it was. SAO was a game, polygon based like any of the ones we have now just streamed straight into you brain instead of a screen, the Underworld uses your own memories of the real world to be basically indistinguishable of reality like as if it was a shared dream.", "created_utc": "1664651978.0", "edited": "False", "id": "iqnqvki", "is_submitter": "False", "link_id": "t3_xswiz8", "parent_id": "t3_xswiz8", "score": "91", "subreddit": "swordartonline", "subreddit_id": "t5_2uikt"}, {"author": "getsandom", "body": "The surprise to me it's that you feel it's odd, that's the status quo all over the world and not only in anime. As far as I can tell, original content made for TV or cinema have been dominated by adaptations for the last maybe 30\\~40 years.", "created_utc": "1664604782.0", "edited": "False", "id": "iqlg87x", "is_submitter": "False", "link_id": "t3_xrvgvy", "parent_id": "t3_xrvgvy", "score": "1", "subreddit": "anime", "subreddit_id": "t5_2qh22"}, {"author": "getsandom", "body": "I usually don't rewatch stuff, too much new content pending for life to give me the time to go back to what I've seem already even if it's extraordinary, but the few I did give another go always felt the same to me. Maybe because I started with anime a lot older than most fans (I'm 40, watching anime since around 27\\~8).", "created_utc": "1664604485.0", "edited": "False", "id": "iqlfus1", "is_submitter": "False", "link_id": "t3_xrvkke", "parent_id": "t3_xrvkke", "score": "1", "subreddit": "anime", "subreddit_id": "t5_2qh22"}, {"author": "getsandom", "body": "So long as we don't have a real life equivalent of the Nervegear the metaverse is not to be.\n\nAs long as there is no full-dive experience (and that is at least 30 years away in my most optimistic estimate) there will not be a metaverse.\n\nThe kind of experience they are selling cannot be accomplished by any kind of improvement of the current hardware, no matter how hi-res, light, fast and wireless you make a headset, you still are mentally in the real world having to be aware of your physical environment (or being rudely reminded of it by a stumble or fall).", "created_utc": "1663826981.0", "edited": "False", "id": "ipfpt8f", "is_submitter": "False", "link_id": "t3_xkptbr", "parent_id": "t1_ipfl4op", "score": "2", "subreddit": "technology", "subreddit_id": "t5_2qh16"}, {"author": "getsandom", "body": "If you are asking what makes something porn when there are no actual explicit \"genitals under use\" on screen, as the say goes, I might not be able to explain but I know it when I see it. In my opinion it's a very personal thing, your definition is probably different from mine and everybody else's.", "created_utc": "1662003580.0", "edited": "False", "id": "imm6da8", "is_submitter": "False", "link_id": "t3_x21d67", "parent_id": "t3_x21d67", "score": "1", "subreddit": "anime", "subreddit_id": "t5_2qh22"}, {"author": "getsandom", "body": "I'm not a manga reader per se, and the manga I've read usually don't have a anime adaptation. Two exceptions though: One was Tetsuwan Birdy, I watched the anime first and gone after the manga after. The other would be Gunnm (Battle Angel Alita) which I've had read the original series and a good chunk of the sequel before watching the OVAs.\n\nNovels are not much different although I read a bit more novels than manga. The one series that has an anime and I keep up with is SAO, I had watched about half of the first season when I started with the novels. I do keep up with Accel World but while I do think there should be more anime of it, it got both overshadowed by SAO and a rough start so I don't think we are getting any more of it unless it's story does link with SAO in the future.", "created_utc": "1661653869.0", "edited": "False", "id": "im2xpc6", "is_submitter": "False", "link_id": "t3_wyftq1", "parent_id": "t3_wyftq1", "score": "1", "subreddit": "anime", "subreddit_id": "t5_2qh22"}, {"author": "getsandom", "body": "A Place Further Than the Universe. I'm normally a binge watcher so much so I don't watch at all things that are on air but even still most of the time I do 6\\~7 episodes of a show at a time. This one though, I was basically hooked half way through the first episode and practically watch the whole thing in one sitting.", "created_utc": "1661652459.0", "edited": "False", "id": "im2ux8i", "is_submitter": "False", "link_id": "t3_wyr3p2", "parent_id": "t3_wyr3p2", "score": "1", "subreddit": "anime", "subreddit_id": "t5_2qh22"}, {"author": "getsandom", "body": ">The Flowers of Evil  \n>  \n>... very controversial art style.\n\nRotoscoping manage to be worst than 3D cell shading. In my opinion neither should ever be considered a style choice, both feel lazy at best and rotoscoping comes with the added negative of wasting the actors performances for no added effect.", "created_utc": "1661651767.0", "edited": "False", "id": "im2tk5b", "is_submitter": "False", "link_id": "t3_wyztwj", "parent_id": "t1_im0bkti", "score": "1", "subreddit": "anime", "subreddit_id": "t5_2qh22"}, {"author": "getsandom", "body": "I guess that would be the most current volume (v26) as it is the only one that is not translated yet, I don't read Japanese so I can only go up to the translated volumes.\n\nAbout Graphite Edge, \\[Accel World - Volume 17+\\]>! at the very beginning of his appearance in the story I too had the impression that he could be Kirito, now I'm almost sure he is not. The reason being the fact that he played as a normal part of Nega Nebulus before being trapped at the castle. I don't see Kirito just going along and playing as if Brain Burst was just another game.!<", "created_utc": "1661610010.0", "edited": "False", "id": "im06w89", "is_submitter": "False", "link_id": "t3_wx385r", "parent_id": "t1_ilyi7jr", "score": "1", "subreddit": "swordartonline", "subreddit_id": "t5_2uikt"}, {"author": "getsandom", "body": "I don't know up to which volume you are at but \\[Accel World - Volume 25\\] >!When the team is trying to free Graphite Edge from the castle, at one moment Silvercrow goes to the higher level to observe and end up getting trapped by Snow Fairy. He then uses the technique he learned from Centaurea Sentry which allows him to \"fade\" from the processing flow of the world and become \"immaterial\" to scape, as he does that he can feel the data flow of the accelerated world and in that he can perceive not only Brain Burst but also the other dead games Cosmos Corrupt and Accel Assault, and in the background he feel the data flow of a living and still very active 4th world which in my opinion is the still existing Underworld which by that time would be running internally from 20000+ to a possibly millions of internal years depending on which level its running on.!<", "created_utc": "1661568124.0", "edited": "False", "id": "ilydko5", "is_submitter": "False", "link_id": "t3_wx385r", "parent_id": "t1_ilow4gi", "score": "1", "subreddit": "swordartonline", "subreddit_id": "t5_2uikt"}, {"author": "getsandom", "body": "In Portuguese we call it guarda-chuva from guardar (guard or protect) and chuva (rain), as in guarding against the rain.", "created_utc": "1661561966.0", "edited": "False", "id": "ily0vx3", "is_submitter": "False", "link_id": "t3_wyavnt", "parent_id": "t1_ilxfkw6", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "getsandom", "body": "Reverse isekai is not that uncommon, a full tensei (reincarnation) reverse isekai on the other hand I never heard of one, at least not with the isekai'ed person fully reincarnated as an everyday human in an fully human family.", "created_utc": "1661224952.0", "edited": "False", "id": "ilesydj", "is_submitter": "False", "link_id": "t3_wuq624", "parent_id": "t3_wuq624", "score": "2", "subreddit": "anime", "subreddit_id": "t5_2qh22"}, {"author": "getsandom", "body": "SAO is definitely not an isekai. Isekai requires that the character ceases to physically be on the original world either by transport or death. Also coming back to the original world does not invalidate a series from being an isekai, so long as the character has being completely on the \"other world\" for a period of the story, something like Otherside Picnic is an isekai while something like Bofuri and almost every \"locked inside a game\" either completely isn't or is not for sure isekai.", "created_utc": "1661052644.0", "edited": "False", "id": "il5fhmg", "is_submitter": "False", "link_id": "t3_wtbpwm", "parent_id": "t1_il3ftbk", "score": "0", "subreddit": "anime", "subreddit_id": "t5_2qh22"}, {"author": "getsandom", "body": "Even though I only really got into anime around 2009\\~2010 here are a few titles from before 2000 I hank high on my list:\n\nMagic Knight Rayearth (1994)\n\nKaitou Saint Tail (1995)\n\nPrincess Nine: Kisaragi Joshikou Yakyuubu (1998)\n\nSeikai no Monshou (Crest of the Starts) (1999)", "created_utc": "1661050879.0", "edited": "False", "id": "il5c395", "is_submitter": "False", "link_id": "t3_wtmh0x", "parent_id": "t3_wtmh0x", "score": "1", "subreddit": "anime", "subreddit_id": "t5_2qh22"}, {"author": "getsandom", "body": "[My Stats at 2022-08-19](https://www.anime-planet.com/users/getsandom)\n\nProbably gonna break the 24/7/365 full year in anime by the end of 2022, that is, if I was to rewatch everything from scratch at a reasonable 4 hours a day it would take 6 years to finish my rewatch.", "created_utc": "1660954921.0", "edited": "False", "id": "il08ua8", "is_submitter": "False", "link_id": "t3_wsegkz", "parent_id": "t3_wsegkz", "score": "1", "subreddit": "anime", "subreddit_id": "t5_2qh22"}, {"author": "getsandom", "body": "As of now Accel and SAO do take place in the same reality but are not **as of yet** part of the same story. As far as I know rumor is the intention of the author to actually link the end of SAO to the beginning of Accel, take that with a heaping teaspoon of salt though.\n\nIf you actually read the source material there is hugely glaring hint in \\[Accel World - V25\\] >!In the latest volume of Accel right as Silvercrow is trapped by Snow Fairy in the highest level of the Accelerated World as he was observing the team that was about to free Graphite Edge from the castle, he uses the technique of blending his presence with the background to become immaterial in the Main Visualizer and scape his restraints, as he does that he can fell the flow of data from the Accelerated World not only from Brain Burst but also from Accel Assault and Cosmos\nCorrupt that are the dead failed accelerated experiments and a FOURTH accelerated world which is still very active of which even the Originators might not have knowledge. That fourth world is most probably the still running Underworld which would have gone through eons of time by now as the highest level runs at the maximum speed the Main Visualizer can process, 5 million times faster than physical reality.!<", "created_utc": "1660953438.0", "edited": "False", "id": "il05lku", "is_submitter": "False", "link_id": "t3_wsngx1", "parent_id": "t3_wsngx1", "score": "1", "subreddit": "anime", "subreddit_id": "t5_2qh22"}, {"author": "getsandom", "body": "When that happens I usually go back and rewatch from the start. I still got quite a few titles that are stuck in the \"stalled\" list like Kill La Kill, Blood-C and Tiger & Bunny.\n\nOne I stopped midway through even though I loved it was Gosick, took a over a couple of years to get back at it. \n\nCharlotte and Sankarea I started watching then started something else and ended up not returning until long after.\n\nShakugan no Shana I watched the first and second seasons as the third was airing but didn't get to it until a few years after. A few others that got the same treatment stalled between seasons were Log Horizon and To Aru Kagaku no Railgun.\n\nBut the one I think has the longest hiatus in my list would be Spice and Wolf, I'm pretty sure I started the first season all the way back when I started getting in to anime around 2010 and didn't finish it until couple of months back this year.", "created_utc": "1660795456.0", "edited": "False", "id": "ikr4x7k", "is_submitter": "False", "link_id": "t3_wqllhj", "parent_id": "t3_wqllhj", "score": "1", "subreddit": "anime", "subreddit_id": "t5_2qh22"}, {"author": "getsandom", "body": "In Goblin Slayer, as in Overlord there is a reason for it, it's damn awful and in my opinion portrayed in the wrong way in the anime for shock value, but there is a reason and it fits the narrative.\n\nRedo of a Healer in the other hand, it's basically all there is to the show.", "created_utc": "1660792927.0", "edited": "False", "id": "ikr03q6", "is_submitter": "False", "link_id": "t3_wqve64", "parent_id": "t1_ikqi817", "score": "2", "subreddit": "anime", "subreddit_id": "t5_2qh22"}, {"author": "getsandom", "body": "SAO is currently the only series I follow the source material.\n\nIt's so unfortunate that people stop at the surface with the anime and don't normally think about anything that isn't at the screen.\n\nSAO has a world of subtext to explore from the social and ethical discussions to the absolute nerdiness of Kawahara in the way he implements the devices on the story based in actual if underdeveloped scientific research (look up Sir Roger Penrose and his theory of consciousness).", "created_utc": "1660703085.0", "edited": "False", "id": "iklt8n0", "is_submitter": "False", "link_id": "t3_wpmii5", "parent_id": "t1_ikk1wah", "score": "1", "subreddit": "anime", "subreddit_id": "t5_2qh22"}, {"author": "getsandom", "body": "You example with My Hero Academia is basically akin to western comic names which would be weird in real life use, but in Japanese a most of real everyday first names are actual words with meaning (including Uta which is not that uncommon) not just a set of sounds as most western names which had a meaning in the past but got changed through time or transferred into another language, in English the closest it gets is girls named after flowers.", "created_utc": "1660620343.0", "edited": "False", "id": "ikh35ff", "is_submitter": "False", "link_id": "t3_wp66bh", "parent_id": "t3_wp66bh", "score": "1", "subreddit": "anime", "subreddit_id": "t5_2qh22"}, {"author": "getsandom", "body": ">Nausicaa, like Berserk,   \n>  \n>and Akira  \n>  \n> is a movie based on the initial outline of a very very very long manga.  I'm not sure anymore if the movie is an adaptation of the manga, or the manga began as a retelling of the movie.\n\nActually neither, Miyazaki was convinced to make the manga as a companion to the movie, so they were produced in conjunction and the manga continued after. The movie tells less than 1/3 of the story.\n\nI absolutely love Nausicaa the movie, is the anime title I rewatched the most to the point I completely lost count o how many times (20+ I'm sure), but the manga is something special, in my opinion is as great as all of other Miyazaki's works combined.", "created_utc": "1660451258.0", "edited": "False", "id": "ik7sixx", "is_submitter": "False", "link_id": "t3_wnoibi", "parent_id": "t1_ik6pvpn", "score": "2", "subreddit": "anime", "subreddit_id": "t5_2qh22"}, {"author": "getsandom", "body": "Much as I would like activist shit driven Disney to just implode right this moment to keep it's sweaty mice paws out of anime, best you can do with the equivalent of a 100 ton bolder rolling down the hill is to get out of the way.\n\nGet you anime any way that does not get your money through Disney, pirate it if you must and show your support for the creator another way.\n\nSupport the original creator as directly as you can, as often as you can, so they know what they are doing now is what you want. Anime is still business that listen to people's wallets, something western media seems to have forgotten.", "created_utc": "1660450424.0", "edited": "False", "id": "ik7r58t", "is_submitter": "False", "link_id": "t3_wntzeh", "parent_id": "t3_wntzeh", "score": "-1", "subreddit": "anime", "subreddit_id": "t5_2qh22"}, {"author": "getsandom", "body": "If you exclude the ones that actually try to be like one of the trash western adult cartoons the closest one I've watched was Heroman. It's so cartoon-like you'd be excused to think it was a Nickelodeon show if you watched it dubbed, also it's was made with the collaboration of Stan Lee (he even gets a cameo).", "created_utc": "1660277711.0", "edited": "False", "id": "ijycbpp", "is_submitter": "False", "link_id": "t3_wmbfby", "parent_id": "t3_wmbfby", "score": "4", "subreddit": "anime", "subreddit_id": "t5_2qh22"}, {"author": "getsandom", "body": "The question you should ask yourself is, reading the subs is taking anything away from your experience? \n\nThe reason I say that it's that is twofold. \n\nFirst, people who prefer subs are somewhat vehement about it even when some people with limited capability for reading might not be able to enjoy the show if they are forced to read the subs. In my particular case I'm a fast reader and with all the anime I've watched I don't even need the subs if the dialog is more mundane or slow paced.\n\nThe second reason I ask is, if you can enjoy the original fully even having to read the subs why go through an unnecessary layer of translation? I always prefer to get as close to the original cretors intent as possible.", "created_utc": "1660277014.0", "edited": "False", "id": "ijyb2m3", "is_submitter": "False", "link_id": "t3_wlldz2", "parent_id": "t3_wlldz2", "score": "1", "subreddit": "anime", "subreddit_id": "t5_2qh22"}, {"author": "getsandom", "body": "I absolutely loved Cells at Work, as with any \"edutainment\" title you should always take the supposed real world \"info\" with a grain of salt, but the execution of the show was insanely engaging.\n\nCells at Work Code Black ended in a huge cliffhanger, if they manage to get a new season out I'm all for it.", "created_utc": "1660275968.0", "edited": "False", "id": "ijy95jf", "is_submitter": "False", "link_id": "t3_wlqhyj", "parent_id": "t3_wlqhyj", "score": "1", "subreddit": "anime", "subreddit_id": "t5_2qh22"}, {"author": "getsandom", "body": "That was trip an a half for sure.\n\nOne thing about Flip Flappers, I'm not one to pay attention to an anime OP generally and I'm not into electronic music but I absolutely adore the opening.", "created_utc": "1660275605.0", "edited": "False", "id": "ijy8gvv", "is_submitter": "False", "link_id": "t3_wlqhyj", "parent_id": "t1_ijx6z16", "score": "2", "subreddit": "anime", "subreddit_id": "t5_2qh22"}, {"author": "getsandom", "body": "I feel since a good chunk of people keep to the anime an it's somewhat flawed execution they are certainly missing on the amazing subtext Kawahara manages in the novels.", "created_utc": "1660275079.0", "edited": "False", "id": "ijy7gle", "is_submitter": "False", "link_id": "t3_wluo56", "parent_id": "t1_ijvwdkg", "score": "1", "subreddit": "anime", "subreddit_id": "t5_2qh22"}, {"author": "getsandom", "body": "I'm absolutely fascinated by the Unlimited Neutral Field of Accel World. I'd risk a venture there to learn it's secrets. In Aincrad and the Underworld of SAO Cardinal was limited to keep the \"ecological\" balance, the version of Cardinal that overlays the stage on the Neutral Field seems a lot more \"free\" to be creative about it.", "created_utc": "1660274167.0", "edited": "False", "id": "ijy5ods", "is_submitter": "False", "link_id": "t3_wm3ynf", "parent_id": "t3_wm3ynf", "score": "2", "subreddit": "anime", "subreddit_id": "t5_2qh22"}, {"author": "getsandom", "body": "One thing most people in the west in general don't get, nudity and eroticism are separate matters in Japanese culture, point in case you called yourself with Yuru Camp. The show doesn't have a drop of eroticism to it, it's actually the only show I can ever record that doesn't even have the girls commenting on each others figures even once in 2 seasons and nudity is still present, in this case because communal bathing is highly ingrained in Japanese culture.", "created_utc": "1660273083.0", "edited": "False", "id": "ijy3gwa", "is_submitter": "False", "link_id": "t3_wm6eeh", "parent_id": "t3_wm6eeh", "score": "1", "subreddit": "anime", "subreddit_id": "t5_2qh22"}, {"author": "getsandom", "body": "If I'd had to describe, I'm somewhat hyperactive in a weird way, I'm like a sponge that absorbs huge amounts of information and while I'm a veritable nerd in the fact that would be glad to learn about anything from anthropology to zoology and all things in between that's not enough to keep my information thirst quenched so I ended up getting into fictional media almost for the shear unmeasurable volume.\n\nI'm somewhat older that the average anime appreciator so before the internet was a thing in everybody's homes I was a huge bookworm, I managed to read 167 volumes in one year at one point. When I started working and got a PC with internet access, a universe of media of all types to be consumed opened to me.\n\nFor a while I was all about every bit of media I could consume, I watched 25 seasons of Star Trek (TNG, Voyager, DS9, and Enterprise) in one fell swoop for example. I spent some 2/3 of the time I was not working or sleeping consuming some kind of media. I took a while and some pushing from friends but when I ended taking on anime I fell hard for it.\n\nAs of the last 6\\~7 years most western media basically lost it's luster so, with the exception of some gaming and a few novels, anime now composes the majority of what I watch.\n\nThat's basically a very long-winded way to say anime keeps my information-hypoglycemic brain fed in a fun way.", "created_utc": "1660190598.0", "edited": "False", "id": "ijtdfkr", "is_submitter": "False", "link_id": "t3_wktzq7", "parent_id": "t3_wktzq7", "score": "2", "subreddit": "anime", "subreddit_id": "t5_2qh22"}, {"author": "getsandom", "body": "Almost all of the time I can get past a character's personality and quirks and even if I don't like him or her as person I can appreciate whatever they bring to the story.\n\nThat said, if I had to name one character I would despise as a person it would be Seiji Noumi from Accel World, he just ticks me off in all the wrong ways to the point that I believe his arc in the story is one of the major reasons Accell was so overwhelmingly overshadowed by SAO. It's not that the character is bad, almost the opposite, I really like the writing that went into him but that made him way to realistically disgusting.", "created_utc": "1660184771.0", "edited": "False", "id": "ijt1plp", "is_submitter": "False", "link_id": "t3_wl8am0", "parent_id": "t3_wl8am0", "score": "1", "subreddit": "anime", "subreddit_id": "t5_2qh22"}, {"author": "getsandom", "body": "As far as the Lightcube goes, a person will not die if its memory capacity is reached, is just like a hard disk, doesn't stop working just can't get new things in. If the processes that makes it capable of processing mimic the brain to a higher level it probably would start to overwrite old/less accessed memories with new ones.\n\n\\[SAO - Alicization Rising\\]>!That's basically why Quinella wanted to use the girl that ended up fused with the Cardinal correction program, she basically was going to use her Lightcube as an external hard drive to copy her main memories, as lighter/cleaner version of herself with space to spare.!<", "created_utc": "1660097951.0", "edited": "1660099493.0", "id": "ijnzu7e", "is_submitter": "False", "link_id": "t3_wjwabc", "parent_id": "t1_ijk8kqb", "score": "2", "subreddit": "swordartonline", "subreddit_id": "t5_2uikt"}, {"author": "getsandom", "body": "Curiously, because o abec (SAO char. designer/illustrator). I'm a huge fan of a few select artists like Range Murata and Noizi Ito and I saw a few of the promotional visuals for the anime and was hooked on the design of the characters and ended up looking for more content from the artist. I've always been a bookworm but I was not into novels at all at the time, I was just starting to get into anime as well but after I saw the first season I could not get enough. It didn't help that I got a couple of coworkers at the time that did turn into fans as well.", "created_utc": "1660013571.0", "edited": "False", "id": "ijj4ic2", "is_submitter": "False", "link_id": "t3_wfwirh", "parent_id": "t3_wfwirh", "score": "1", "subreddit": "swordartonline", "subreddit_id": "t5_2uikt"}, {"author": "getsandom", "body": "The deal with SAO content is that all of the story told in the anime until the end of the Alicization arc was already out by 2008.\n\nPeople who keep up with the anime only might not know but SAO was a webnovel and the story from Aincrad to Alicization was published as such between 2002 and 2008. That's how they got the anime to follow so close to the novel, with then exception of some side stories, the novels are just a redressing for print of the original from the web. \n\nThe thing is that now the anime caught up with what was available and the new completely novel original arc which is Unital Ring is only beginning with with only a few volumes so far. Since SAO usually does full seasons it would take at least 6\\~8 volumes to have enough of a story, but with the pacing of this new arc unless the story picks up I'd say more like 10,  which would take another couple of years at the bare minimum since there have been around a couple of volumes per year, so the main SAO story might not be getting a new season until at least 2025 in my estimate.", "created_utc": "1660011702.0", "edited": "False", "id": "ijj0boh", "is_submitter": "False", "link_id": "t3_wj1mng", "parent_id": "t3_wj1mng", "score": "2", "subreddit": "swordartonline", "subreddit_id": "t5_2uikt"}, {"author": "getsandom", "body": "I don't know how old you are but Kowloon was basically the face of almost anything with dystopian urban decay as a background from the late 1970's to the mid to late 90's either directly or as an inspiration. And the media isn't limited to cyberpunk scenarios, Van Damme's [Bloodsport (1988)](https://www.imdb.com/title/tt0092675/) basically takes place at an illegal martial arts tournament there even if they don't name the place. I'm almost sure you can even find films shot inside the actual city.\n\nAs for anime, Sakasama no Patema comes to mind though it takes place mostly underground. Osamu Tezuka's Metropolis also remind me of it. Also the Scrapyard in Gunmm (Battle Angel Alita) though I like the James Cameron movie better than the OVAs even if it still falls short of the manga.", "created_utc": "1659847125.0", "edited": "False", "id": "ij9vv06", "is_submitter": "False", "link_id": "t3_wh5h5c", "parent_id": "t3_wh5h5c", "score": "1", "subreddit": "anime", "subreddit_id": "t5_2qh22"}, {"author": "getsandom", "body": "Hayate no Gotoku! It's a fun watch but is of the mark with the kind of character you are asking about. It's a comedy, and can get  quite over the top, it doesn't take itself seriously at all.\n\nIt is about a 16 year old who's parents were so bad they sold him to a Yakusa clan as payment for a 100M yen gambling debt. He is saved by a rich young girl who pays his debt (basically buying him) and end up working as her buttler to pay the debt which will probably take longer than his lifetime.", "created_utc": "1659845071.0", "edited": "False", "id": "ij9sbap", "is_submitter": "False", "link_id": "t3_whd8v7", "parent_id": "t1_ij50j09", "score": "1", "subreddit": "anime", "subreddit_id": "t5_2qh22"}, {"author": "getsandom", "body": "I'm from São Paulo. The accents are really different, in my opinion people who don't talk Portuguese might even mistake them for different languages.", "created_utc": "1659299763.0", "edited": "False", "id": "iifbk3c", "is_submitter": "False", "link_id": "t3_wcss9d", "parent_id": "t1_iif7loy", "score": "2", "subreddit": "askscience", "subreddit_id": "t5_2qm4e"}, {"author": "getsandom", "body": "I was just commenting on it, the Nicaraguan Sign Language was a completely naturally created language, its less than 50 years old and was created from scratch by children in the late 1970's.", "created_utc": "1659287245.0", "edited": "False", "id": "iiei210", "is_submitter": "False", "link_id": "t3_wcss9d", "parent_id": "t1_iiee1nf", "score": "6", "subreddit": "askscience", "subreddit_id": "t5_2qm4e"}, {"author": "getsandom", "body": "As long as people have groups that can talk to each other every day and groups that don't you will always have new languages form.\n\nI'm from Brazil and there have being talk for a long time now that Brazilian and European Portuguese drifted apart enough that they are not even dialects anymore but full distinct if mutually comprehensible languages.\n\nYou only need to look at the Nicaraguan Sign Language to see that necessity drives creation fast. The language was spontaneously created by deaf children in the late 1970's out of their necessity of communicating with each other in the specialized schools the government built for them at the time.", "created_utc": "1659286922.0", "edited": "False", "id": "iieha0d", "is_submitter": "False", "link_id": "t3_wcss9d", "parent_id": "t3_wcss9d", "score": "292", "subreddit": "askscience", "subreddit_id": "t5_2qm4e"}, {"author": "getsandom", "body": "You would never get the full frontal Game of Thrones style in anime even in hentai proper without censorship, so depends on if you consider simply being unclothed as in a bath nudity.\n\nIn the first 2 seasons there is your typical fare anime fanservice bathing scene, no nipples visible so not ecchi levels of service but is there, no much beyond what you get from the onsen scenes in Yurucamp though.\n\nThe end of the 3rd season is a bit more heavy. It isn't, in my opinion, fanservice for the sake of it as much as an statement of the character but it is there prominently.", "created_utc": "1659282358.0", "edited": "1659282623.0", "id": "iie6gok", "is_submitter": "False", "link_id": "t3_wcql3m", "parent_id": "t3_wcql3m", "score": "2", "subreddit": "swordartonline", "subreddit_id": "t5_2uikt"}, {"author": "getsandom", "body": "I'm very surprised at this, as far as I know here in Brazil drivers have been able to know the fare value in advance almost since the service began in the country, the destination was also added quite a while ago. As far as I remember it was actually a request by the riders since with the value predetermined it prevented drivers from taking a roundabout long path to stretch the distance and rise the fare. I always assumed they implemented the same policy/functionality worldwide.", "created_utc": "1659157601.0", "edited": "False", "id": "ii82gks", "is_submitter": "False", "link_id": "t3_wbm4ji", "parent_id": "t3_wbm4ji", "score": "1", "subreddit": "technology", "subreddit_id": "t5_2qh16"}, {"author": "getsandom", "body": "I'm 40 and actually didn't get into anime until I was almost as old as you are now and while you wouldn't guess my taste for it just from looking at me, with over 20000 episodes watched I'd say I've loved most shows I've seen.\n\nDifferent from me, who actively avoided anime as a kid, a lot of people between my age and yours grew up with anime in the late 1980's and 90's, even if the word wasn't as well known at the time. A lot of these people also still keep up with other media like games and comics that would be considered \"for kids\" by generations past, so you will have no problem finding a lot of anime fans in their 30s, 40s even 50s and older specially since with the web we can get at the good stuff that was kept in Japan only in the past.", "created_utc": "1659153074.0", "edited": "False", "id": "ii7uyt3", "is_submitter": "False", "link_id": "t3_wbhr45", "parent_id": "t3_wbhr45", "score": "5", "subreddit": "anime", "subreddit_id": "t5_2qh22"}, {"author": "getsandom", "body": "It's been a while since I finished school so I don't exactly know the state   of literature in teaching this day here in Brazil.\n\nWhen I was a student 25+ years ago we had a mix o Brazilian and Portuguese literature mostly from 18 and 19 centuries with some \"modern\" and \"classic\" sprinkled on occasion, being a bookworm at the time I didn't mind much.\n\nIn my case in particular read a lot of Machado de Assis, José de Alencar, and some others even older classics like Luis de Camões or a few more modern like Jorge Amado who was quite influential as several of his novels ended as TV series, soap operas or movies. There was only one author, Éça de Queiroz, I could not stand to the point of never finishing either of the books I tried, I left both \"A Reliquia\" and \"Os Maias\" before the first quarter.", "created_utc": "1658551494.0", "edited": "False", "id": "ihaaqr4", "is_submitter": "False", "link_id": "t3_w5csuf", "parent_id": "t3_w5csuf", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "getsandom", "body": "Silly as it was I loved it, looking forward to the next season, that kind of self-aware \"over-the-toppiness\" is kinda missing in anime nowadays.", "created_utc": "1658545841.0", "edited": "False", "id": "iha0enh", "is_submitter": "False", "link_id": "t3_w58ipb", "parent_id": "t1_ih9nd2l", "score": "1", "subreddit": "anime", "subreddit_id": "t5_2qh22"}, {"author": "getsandom", "body": "Peter Grill Kenja no Jikan.\n\nKenja no Jikan (losely \"time of the sage\") is a play on a Japanese expression meaning the few moments after you \"done the deed\" and have your most clear thoughts as you are free of lust.", "created_utc": "1658545218.0", "edited": "False", "id": "ih9z6c9", "is_submitter": "False", "link_id": "t3_w58ipb", "parent_id": "t1_ih82z76", "score": "2", "subreddit": "anime", "subreddit_id": "t5_2qh22"}, {"author": "getsandom", "body": "As far as I remember, he wrote the story with where the brother die in the end exactly because he felt guilty of surviving and didn't feel like he deserved.", "created_utc": "1658543602.0", "edited": "False", "id": "ih9vwkx", "is_submitter": "False", "link_id": "t3_w5h8o0", "parent_id": "t1_ih8g42d", "score": "2", "subreddit": "anime", "subreddit_id": "t5_2qh22"}, {"author": "getsandom", "body": "People who grew up watching American animation in the last 15\\~20 years, specially with how big Disney influence has become, will often be surprised like yourself at what is considered \"for kids\" in anime.\n\nYounger people who have not experienced what animation was like even in the US before The Mouse spread its dumbing influence usually will have no memory that most of what they find \"uncommon\" in kids anime was actually not that abnormal in cartoon from the 1940's to the 70's to the point that by the 80's boomers started to take notice and things like the prohibition o showing blood or have characters smoking came into place with support from companies like Disney.\n\nJapan was lucky that their boomers didn't had as much influence and lobby.", "created_utc": "1658463474.0", "edited": "False", "id": "ih5bucj", "is_submitter": "False", "link_id": "t3_w4zmjp", "parent_id": "t3_w4zmjp", "score": "1", "subreddit": "anime", "subreddit_id": "t5_2qh22"}, {"author": "getsandom", "body": "I'm normally quite unempathetic so I don't often get \"moved\" by things I watch but if I had to say the one series that managed to getting me felling a bit under it would be xxxHolic, to the point it actually changed my watching habit.\n\nNowadays from the time I'm able to dedicate to anime I usually reserve time for at least a couple of episodes of a more light hearted title to finish the day on a brighter tone, that maybe a slice of life with some comedy or lately I taken a liking to the more silly side of isekai.\n\nThinking back it was a habit I formed after finishing xxxHolic.", "created_utc": "1658461598.0", "edited": "False", "id": "ih58d2s", "is_submitter": "False", "link_id": "t3_w4i9m2", "parent_id": "t3_w4i9m2", "score": "1", "subreddit": "anime", "subreddit_id": "t5_2qh22"}, {"author": "getsandom", "body": "I had fun with it but it was nothing extraordinary, I think the title got many people's expectation to high for something special when its just your run of the mill high school romance SOL.", "created_utc": "1658460045.0", "edited": "False", "id": "ih55d02", "is_submitter": "False", "link_id": "t3_w4o1me", "parent_id": "t3_w4o1me", "score": "2", "subreddit": "anime", "subreddit_id": "t5_2qh22"}, {"author": "getsandom", "body": "If you rasterize your vector frames before you convert them to video you are defeating the purposed of having vector frames in the first place because once you make an image raster you locked its resolution to a fixed size which is exactly what already happens now.\n\nThe problem I was getting at with the file formats is that there is no video format that stores the frames as vector to be rasterized at the time of playing them so that you can chose the resolution during the execution. And even if there was I'm not sure the result would be any perceptually better that simply scaling a raster frame as it's done now.\n\nThat's not even considering how much more computing it would take to rasterize 24/30/60 vectors per second in comparison with modern video formats. The current video formats are very optimized to be a lot easier to \"decompress/decode\" for viewing than to compress since you might want to play the video in your mobile for example.", "created_utc": "1658440687.0", "edited": "False", "id": "ih3yf94", "is_submitter": "False", "link_id": "t3_w3atnn", "parent_id": "t1_ih29a77", "score": "1", "subreddit": "anime", "subreddit_id": "t5_2qh22"}, {"author": "getsandom", "body": "The original raw animation nowadays IS made mostly digitally with vector and 3d playing a big part of it, the problem comes with the fact that every video format in existence was developed to compress raster images taken with a camera and every video player and streaming service makes use of standard video formats.\n\nThe amount of understanding of how the human vision works and the development of the algorithms necessary to compress a sequence of images to the point of having less than a bit per video pixel as compressed modern formats do is insane and because the optimization is so specialized to work raster images there is not way to \"shoe in\" a vector format alternative.\n\nIn my 20+ years of being a software developer, with big curiosity about things like compression algorithms and file formats I only ever heard a rumor of a video format based on vector once some 10 years ago.\n\nAlso because of how scaling algorithms work when you have big flat-color areas as in 2d animation, there is no guarantee that you video player magnifying a frame will not be as good as a freshly rendered vector image with a fraction of the computing power.", "created_utc": "1658376215.0", "edited": "False", "id": "ih0avmg", "is_submitter": "False", "link_id": "t3_w3atnn", "parent_id": "t3_w3atnn", "score": "1", "subreddit": "anime", "subreddit_id": "t5_2qh22"}, {"author": "getsandom", "body": "I cannot sing enough praise to Hina Suguta, Marin's VA, that kind of character is so insanely easy to get wrong. Her acting bringing Marin to life is absolutely stellar in my opinion.", "created_utc": "1658375253.0", "edited": "False", "id": "ih094cx", "is_submitter": "False", "link_id": "t3_w3kwt4", "parent_id": "t1_igwu6zh", "score": "1", "subreddit": "anime", "subreddit_id": "t5_2qh22"}, {"author": "getsandom", "body": "I was thoroughly surprised at how engaging that show is, I'm a binge watcher by nature but that show I almost finished in one sitting.", "created_utc": "1658374861.0", "edited": "False", "id": "ih08e13", "is_submitter": "False", "link_id": "t3_w3kwt4", "parent_id": "t1_igxcsbt", "score": "1", "subreddit": "anime", "subreddit_id": "t5_2qh22"}, {"author": "getsandom", "body": ">Isn’t the fun of watching anime engaging with the community as it releases?\n\nThat affirmation feels to me just a couple of steps below the obsession of the completionists that finish all anime they start regardless if the find it fun or not. For those that have the patience to wait a week between episodes the interaction with the community should be a nice side effect not the crux of the matter. Also that interaction does not end with the show otherwise shows like Death Note and other 'classics' and 'must watch' that keep coming back to discussion would have no fanbase at all.\n\nIf you cannot enjoy the show by itself, before you discuss it with others, perhaps you should reconsider the shows you are watching.\n\n&#x200B;\n\n>What anime have you done this for?\n\nI'm a binge watcher, I never watch shows while they air, when I like a title I want as much of it as I can get in one go.", "created_utc": "1658373780.0", "edited": "1658374032.0", "id": "ih06asr", "is_submitter": "False", "link_id": "t3_w3tgyr", "parent_id": "t3_w3tgyr", "score": "1", "subreddit": "anime", "subreddit_id": "t5_2qh22"}, {"author": "getsandom", "body": "Depends a lot on the show, Overlord I basically gone through the 3 seasons that were already out in 4 days and gone through Danmachi in less than a week, Dr Stone and Fire Force on the other hand I watched the first season but haven't started the second yet.\n\nI usually don't watch a show exclusively either, even if I watch 7/8/9 episodes of a show I still mix that with 3 or 4 episodes of what I call my background list which is composed of most older stuff I either missed  on past seasons or from before I had and interest in anime.", "created_utc": "1658197209.0", "edited": "False", "id": "igq5c6d", "is_submitter": "False", "link_id": "t3_w1ss82", "parent_id": "t3_w1ss82", "score": "1", "subreddit": "anime", "subreddit_id": "t5_2qh22"}, {"author": "getsandom", "body": "There is not enough source material to draw from. What was in the anime came almost to the end of the manga that was already out.\n\nAs popular as it was it's almost certain to come back when there is enough story to tell but that will take at least a couple of years at the bare minimum.", "created_utc": "1658195889.0", "edited": "False", "id": "igq2e01", "is_submitter": "False", "link_id": "t3_w2csxi", "parent_id": "t3_w2csxi", "score": "1", "subreddit": "anime", "subreddit_id": "t5_2qh22"}, {"author": "getsandom", "body": "I'm from Brazil, I speak Portuguese as my native language.", "created_utc": "1658115450.0", "edited": "False", "id": "iglmsrz", "is_submitter": "False", "link_id": "t3_vzgs23", "parent_id": "t1_iglmgqq", "score": "1", "subreddit": "anime", "subreddit_id": "t5_2qh22"}, {"author": "getsandom", "body": "Everybody is obviously different and there are people that like to take time to digest a story while for me I prefer get as much out of it as a can.\n\nAs a binge watcher I do understand the drive to keep going when you find something that capture your attention but even in my days off I normally don't watch more than 14\\~15 episodes maybe 20 if I'm really on a roll.\n\nThat said even for me who can keep in good health with a little over 4 hours sleep a night 50+ episodes in a day would be pushing.", "created_utc": "1658115314.0", "edited": "False", "id": "iglmkma", "is_submitter": "False", "link_id": "t3_w1do80", "parent_id": "t3_w1do80", "score": "1", "subreddit": "anime", "subreddit_id": "t5_2qh22"}, {"author": "getsandom", "body": "While I've never lived in Japan to have a direct experience, in my opinion if that focus exists in real world at any level outside of porn is almost certainly something that came post-war with western influence. If you look at Japanese traditional female clothing there is basically no focus on the bust as there have been in western clothing in basically forever, the Minoans 4000 years ago had dresses that literally exposed the breasts. Even if you look at literally pornographic Japanese illustrations from the 17/18/19 century the focus on the breasts isn't there. \n\nWhen it comes to anime its really hard to remember a title where \"figure\" doesn't play any part in dialog, if I had to say the only one that immediately comes to mind is Yurucamp.", "created_utc": "1658112980.0", "edited": "False", "id": "iglig6d", "is_submitter": "False", "link_id": "t3_w1jv7m", "parent_id": "t3_w1jv7m", "score": "2", "subreddit": "anime", "subreddit_id": "t5_2qh22"}, {"author": "getsandom", "body": "To my mind no amount of anyone telling me what happens in a story will ever take away from the experience of watching it myself, being surprised by the story does not add to the enjoyment, so to me I couldn't care less about either \"reading ahead\" as you ask or plain old \"spoilers\".", "created_utc": "1658031780.0", "edited": "False", "id": "ighc21h", "is_submitter": "False", "link_id": "t3_w0cgb8", "parent_id": "t3_w0cgb8", "score": "1", "subreddit": "anime", "subreddit_id": "t5_2qh22"}, {"author": "getsandom", "body": "Although I do keep my lists, the main reason I use the site I have an account on it's the focus on recommendations.\n\nI use [Anime Planet](https://www.anime-planet.com), and the main characteristic of the site its the focus on recommendations by the community. The other reason I found to use it it's how refined you can get with a search when trying to find a show it's absolutely unparalleled.\n\nThe way I watch anime also benefits from keeping tabs on what I'm watching. I never watch shows that are still airing, Even when I'm very interested I wait until the season is finished and binge it over 2\\~4 days depending of the length of the season. Together with that I have what I call my background list, right now I have some 20 titles I watch a couple of episodes at a time either before or after the \"main watch\" when I have the time or when in mid season if I already watched all I had interest and I'm waiting for the more current stuff to end for me to pick it up, so some times I go several weeks between getting to an episode of a show.\n\nAlso, I'm sure there are some people that like the stats going up at least a little like me, I for example just crossed 20000 episodes watched.", "created_utc": "1658031328.0", "edited": "False", "id": "ighbavc", "is_submitter": "False", "link_id": "t3_w0ddeg", "parent_id": "t3_w0ddeg", "score": "1", "subreddit": "anime", "subreddit_id": "t5_2qh22"}, {"author": "getsandom", "body": "The village has being going on for over 3 millennia, plenty of time for people to either be banished for crimes or move out on their own will. It's far more unreasonable for there to have only 40 people or so in the village, or for the village to have such variation in physical appearance.\n\nI had a lot of fun with the show but for a title with science as a theme  that village is veritable mountain of inconsistencies.", "created_utc": "1658029267.0", "edited": "False", "id": "igh7qj7", "is_submitter": "False", "link_id": "t3_w0ks4s", "parent_id": "t3_w0ks4s", "score": "1", "subreddit": "anime", "subreddit_id": "t5_2qh22"}, {"author": "getsandom", "body": "Sorry, English is not my first language, sometimes I get a bit exaggerated in the way I write.\n\nWhat I mean by \"untouched subjects\" are things that were always present in anime but don't happen in kids American animation now or did not happen until recently. \n\nFor example, homosexual couples didn't appear in American kids shows until some 8\\~9 years ago.\n\nIn anime in the 1990's in the original Sailor Moon series Sailor Uranus and Sailor Neptune were couple, there are even a few \"not explicit\" scenes of them in bed together. When the show was aired in the US they changed their relationship to cousins instead of lovers to try to explain why they were so close.\n\nThat is just one example.\n\nIf you search you will see that is normal for characters in anime to have complicated relationships or have big flaws of character even when they are the hero of the story.\n\nWhile in cartoons they cut even things like characters smoking cigarettes or having characters use guns that exist in the real world.", "created_utc": "1658021077.0", "edited": "False", "id": "iggs5vo", "is_submitter": "False", "link_id": "t3_vzgs23", "parent_id": "t1_igfx3tc", "score": "1", "subreddit": "anime", "subreddit_id": "t5_2qh22"}, {"author": "getsandom", "body": "I don't know about this specific Stitch! show as I usually avoid things that take to much inspiration from western sources but anime in general is not afraid of things like having a character you actually see in the show die, or if there are fights character shedding blood (which is forbidden since the 1980s in American cartoons) even in shows that are meant for kids under 10. There are no untouched subjects like in current American animation, Sakura Cardcaptors which supposedly would target girls under 12 for example has number of relationships that wouldn't fly in an American show and were cut from the first American version.\n\nAnother thing that is almost unheard of in current for kids American animation is having an overarching story, American kid shows are almost exclusively episodic featuring basically \"for the laughs\" silliness only and treat the audience in a way I would find insulting if a was a kid nowadays.\n\nIn the case of this Stitch! show it might be the case of American media picking up in the fact that it might actually have a story to tell instead of the brainless supposedly humor that is foisted at kids now even though the original Disney Lilo & Stitch animated series was levels of magnitude above what Disney do this days.", "created_utc": "1657947120.0", "edited": "False", "id": "igcwbs7", "is_submitter": "False", "link_id": "t3_vzgs23", "parent_id": "t3_vzgs23", "score": "2", "subreddit": "anime", "subreddit_id": "t5_2qh22"}, {"author": "getsandom", "body": "My main source of possible shows to watch has been [Anime Planet](https://www.anime-planet.com) for almost as long as I've been an anime fan. \n\nI keep my lists there but the main 2 things that kept me using it for a decade now is the site focus mainly in content recommendation by the community and it's easy of use specially for the search function which is lightyears better than any other list site.\n\nThere is not to say that web hearsay or a personal recommendation didn't yield an enjoyable watch here an there, specially since I've been a bit less of a lurker and a bit more interactive here in the sub, but most of the content I end up watching that is not glaring new fresh from airing comes from there.\n\nThat said, I'm not much one for planning. I do have \"want to watch\" list a few dozen titles long but a show being in there have no weight in me actually getting down to watch it, it's more a \"remind me latter, I'm busy now\" list than anything else.", "created_utc": "1657944441.0", "edited": "False", "id": "igcrphs", "is_submitter": "False", "link_id": "t3_vzuixm", "parent_id": "t3_vzuixm", "score": "2", "subreddit": "anime", "subreddit_id": "t5_2qh22"}, {"author": "getsandom", "body": "There are two things put a show right out of my radar. One is when a series gains such a rabid following as to look more like a cult than a fanbase, like Death Note, Evangelion, Jojo and the like. The other is when a show reaches the \"everyone and their aunt knows is anime\" stage like Naruto, Dragonball and One Piece.\n\nIf I had to name few recent titles I was curious about but the excess on the popularity steered me away it would be Kaguya-sama, My Hero Academia and Demon Slayer. Unlike the \"cults\" and the \"big n\" I haven't completely discarded giving them a try but they are very much at the end of an ever growing queue.", "created_utc": "1657852149.0", "edited": "False", "id": "ig7p4am", "is_submitter": "False", "link_id": "t3_vyvusk", "parent_id": "t3_vyvusk", "score": "2", "subreddit": "anime", "subreddit_id": "t5_2qh22"}, {"author": "getsandom", "body": "As I've commented on another thread with an overlapping subject, there will always be some isekai as it always has been since anime/manga/novels are a thing. With respect about the current \"epidemic\" I believe that the wave is hitting peak around now and will subside once the big names that managed to get more than 2 seasons of adaptation like SAO, Overlord, Tensura and so on finish. \n\nI don't know about the others as the only novel I keep up with is SAO but I believe it will take 10+ years before the novels hit the mark the author intends which is for all I've heard the joining of the end of SAO with the begging of Accel. If the current momentum keeps up it would still take another 5+ years after that for anime to come out. \n\nIf we look at the number of volumes the other series have now and the typical length of finished long format series, unless something very unusual happens we are looking in to some 20+ years worth of isekai prominence before the genre go back to the backseat it had in the 1970's through the 90's though I don't think it will keep the peak we have now all the way to the start of the decline.", "created_utc": "1657850202.0", "edited": "False", "id": "ig7ky2e", "is_submitter": "False", "link_id": "t3_vz3fb4", "parent_id": "t3_vz3fb4", "score": "1", "subreddit": "anime", "subreddit_id": "t5_2qh22"}, {"author": "getsandom", "body": "I'd say the To Aru franchise have kind of a split in the fanbase. A number of fans, me included, prefer the Railgun side of the story.\n\nOn the novel vs. anime side I happen to agree with u/MiLiLeFa, I've read the 12 first volumes of the novel and have to say I prefer the anime. Novel authors tend to be verbose, over-explanatory and some times repetitive by nature, the To Aru author does that to a fault in my opinion.\n\nI have to say though that the 3rd season of the anime didn't catch my eye either. I might go back to it latter, perhaps rewatch from the start to refresh, but I stalled after the 5th episode, just failed to keep my attention.", "created_utc": "1657770261.0", "edited": "False", "id": "ig31lhi", "is_submitter": "False", "link_id": "t3_vyh9xi", "parent_id": "t1_ig2bh91", "score": "5", "subreddit": "anime", "subreddit_id": "t5_2qh22"}, {"author": "getsandom", "body": "While it evolved in it's own thing for a while now to the point of influencing the west back in things like Avatar the Last Airbender and the number of Netflix shows that straight call themselves anime, the whole \"anime\" look started because Osamu Tezuka got inspired by the looks of the Disney characters from the 1940's, 50's and 60's. That's basic culture for you, recycling/circulation/rehashing is natural and happens all the time.\n\nAs for Japanese shows that \"try to be cartoon-like\", I usually avoid the titles that look to take \"inspiration\" from modern western animation because for me they are either as \"meh\" as western animation or plain horrible. The one relatively popular that comes to mind that while being an original work of an Japanese studio would be totally at home in one of the \"adult\" animation slots in the west would be Panty & Stocking with Garterbelt. I couldn't take more than 1 episode of it but for the little I saw it has most if not all the characteristics of modern American \"adult\" animation.", "created_utc": "1657754774.0", "edited": "False", "id": "ig23ygn", "is_submitter": "False", "link_id": "t3_vycycf", "parent_id": "t3_vycycf", "score": "1", "subreddit": "anime", "subreddit_id": "t5_2qh22"}, {"author": "getsandom", "body": "Divisive as it may be the one thing SAO is not is small. There are maybe half a dozen multi-media franchises involving anime with current content that has as much reach.", "created_utc": "1657594615.0", "edited": "False", "id": "ift6a6r", "is_submitter": "False", "link_id": "t3_vwsf2o", "parent_id": "t1_ifrqygz", "score": "1", "subreddit": "anime", "subreddit_id": "t5_2qh22"}, {"author": "getsandom", "body": "When I rate an anime I usually think of \"watchability\" instead of going about any \"technical\" point, I don't see any reason to try objectivity with something that is inherently subjective.\n\nMy scoring considers the following: \n\n* Will I be watching the show until the end\n* Would I want to watch more of the show if it gets more content\n* Would I be willing to rewatch the show in the future\n* Would I recommend the show for someone else to watch\n\nIn a 0-10 scale each of this points would add 1 to the score if I feel moderately and 2 if I feel strongly about it. Since they don't add to 10 the 2 is a base score I only discount from if a show is exceptionally annoying/disturbing/boring.", "created_utc": "1657494144.0", "edited": "False", "id": "ifnk4kn", "is_submitter": "False", "link_id": "t3_vvgak2", "parent_id": "t3_vvgak2", "score": "1", "subreddit": "anime", "subreddit_id": "t5_2qh22"}, {"author": "getsandom", "body": "I usually give most series the typical 3+ episodes before ditching but there were some that did disagree with me to the point of not finishing the first episode.\n\nAsobi Asobase, to me it felt like motion sickness, the kind of humor they were trying to convey was already not to my taste but what my brain couldn't cope was with the discrepancy between the characters looks and actions.\n\nPanty & Stocking with Garterbelt, felt like I was just watching one of the modern trash \"adult\" western cartoons, western animation died to me in the early 2000s.\n\nAraburu Kisetsu no Otome-domo yo, every character felt off, like they were trying to hard to take themselves too seriously and make that be the comedy the show should have.\n\nKanata no Astra, everything felt like it had been done better elsewhere, even with all the action taking place it failed hard to keep my attention.\n\nShinigami Bocchan to Kuro Maid, aside from being full CG which I usually avoid was a immensurable bore.", "created_utc": "1657492762.0", "edited": "False", "id": "ifnh3qu", "is_submitter": "False", "link_id": "t3_vvq16y", "parent_id": "t3_vvq16y", "score": "1", "subreddit": "anime", "subreddit_id": "t5_2qh22"}, {"author": "getsandom", "body": "I almost never rewatch serialized content, the only titles I go back to on occasion are Yurucamp and Non Non Biyori which are basically my relax and unwind go-tos, I've watched both at least 3 times.\n\nAside from those I only ever rewatch a series if there is new content of it coming out and it's been more that couple of years since I watched last or I took long while to pick the latest content out. Right now I'm intending to go through Log Horizon from the start since I only watched the first season almost as soon as it came out in 2013 and been wanting to finish it up.", "created_utc": "1657490219.0", "edited": "False", "id": "ifnbcy5", "is_submitter": "False", "link_id": "t3_vvyru5", "parent_id": "t3_vvyru5", "score": "1", "subreddit": "anime", "subreddit_id": "t5_2qh22"}, {"author": "getsandom", "body": "For most anime I usually watch a couple of times, I'm a binge watcher so there is no sense in \"getting the mood\" for the show every \\~20 minutes.", "created_utc": "1657250231.0", "edited": "False", "id": "ifaq11n", "is_submitter": "False", "link_id": "t3_vtab3y", "parent_id": "t3_vtab3y", "score": "1", "subreddit": "anime", "subreddit_id": "t5_2qh22"}, {"author": "getsandom", "body": "I would say it will, as anything to do with tastes, vary from person to person.\n\nI'm 40, when I was a kid I actively avoided anime, I wanted nothing to do with Dragonball, Saint Seya, YuYu Hakusho and the like that were available on airwave TV on the 1990's here in Brazil.\n\nI didn't pick up anime until I was almost 30, almost as a dare from a pair of friends of mine, since then it's been almost 20000 episodes from basically any and every genre and demographic you can imagine.\n\nOn anime as media in general, I'd say it got to where it was going on terms of target demographic of the shows. The only thing I see happening is the occasional rotation of the most prolific genre, as it happened with isekai on the last 10+ years.", "created_utc": "1657248906.0", "edited": "False", "id": "ifan7vd", "is_submitter": "False", "link_id": "t3_vtemw8", "parent_id": "t3_vtemw8", "score": "1", "subreddit": "anime", "subreddit_id": "t5_2qh22"}, {"author": "getsandom", "body": "\\[Rising of the Shield Hero\\] >!As far as I remember its said that he didn't play the \"specific game\" from his version of Japan not that he didn't play games at all. It's obvious just by paying attention that while he didn't know the mechanics of the world right away he \"mastered\" the enhancement of the shield pretty fast and did know a lot of general game mechanics that still applied to the world.!<\n\nTL;DR he was basically noob of that game he didn't know doing a blind playthrough while being reasonably good at games in general", "created_utc": "1656988666.0", "edited": "1656989024.0", "id": "iew9mlz", "is_submitter": "False", "link_id": "t3_vrndgq", "parent_id": "t3_vrndgq", "score": "12", "subreddit": "anime", "subreddit_id": "t5_2qh22"}, {"author": "getsandom", "body": "The evilest of evils for me would be rotoscoping (tracing and flat color over live action) if I know before hand I'm not touching it.\n\nCell shaded full 3d is normally a no go, is horrible anywhere is applied, to me that extends to games for example. In animation it feels lazy, in games a waste of resources for no aesthetic gain whatsoever.\n\nAnything that tries to hard to mimic modern western animation while not a hard pass is a red flag usually because style is not the only thing that comes over from the current western trash.\n\nAnything else I usually give a go.", "created_utc": "1656987735.0", "edited": "False", "id": "iew7wc9", "is_submitter": "False", "link_id": "t3_vr5cys", "parent_id": "t3_vr5cys", "score": "0", "subreddit": "anime", "subreddit_id": "t5_2qh22"}, {"author": "getsandom", "body": "Isekai has been around \"forever\" and a few will be around as long as there is anime/novels/manga, but if you are talking about the current epidemic that started with SAO (which ironically is **not** isekai) I'd say I'd will subside once the big names driving it finish, maybe even with SAO itself which if I'd had to venture a guess will have content around for the next 15 years or so and another 5\\~10 year after that for the genre go back to the backseat it had before the 2000s.", "created_utc": "1656984449.0", "edited": "False", "id": "iew1seo", "is_submitter": "False", "link_id": "t3_vrgz56", "parent_id": "t3_vrgz56", "score": "1", "subreddit": "anime", "subreddit_id": "t5_2qh22"}, {"author": "getsandom", "body": "Is very rare a week I don't watch at least 10+ different shows or more. Even when I'm plowing through \"current\" stuff I still have a list of 20+ titles I'm going through slowly usually a couple of episodes at a time. I'm a binge watcher normally so I don't watch the shows as they air but it's not often for me to go through more than 6\\~7 episodes of a single show at once.", "created_utc": "1656983211.0", "edited": "False", "id": "ievzh2q", "is_submitter": "False", "link_id": "t3_vrju9f", "parent_id": "t3_vrju9f", "score": "1", "subreddit": "anime", "subreddit_id": "t5_2qh22"}, {"author": "getsandom", "body": "I don't drop a series on the first episode that often but a do drop them early if I don't find it to be fun.\n\nAnyone who torture themselves watching something they don't find fun should be looking for mental health advice in my opinion.", "created_utc": "1656886024.0", "edited": "False", "id": "ieqyw7t", "is_submitter": "False", "link_id": "t3_vqrkiy", "parent_id": "t3_vqrkiy", "score": "3", "subreddit": "anime", "subreddit_id": "t5_2qh22"}, {"author": "getsandom", "body": "I'm binge watcher, so much so that I won't start a show if is still airing, but as for going for a full franchise depends on how I'm feeling.\n\nI watched all the 3 seasons of Overlord that are already out back to back almost without anything in between for example, I did basically the same for Danmachi, but I watched only the first season of Fire Force and Dr.Stone so far even though I had a lot of fun with both.\n\nIt's very rare for me to rewatch anything but the few titles I do rewatch on occasion I usually go straight through. One thing that might make me do a rewatch is if new content of the franchise is getting out after a while, for example, since the recent movie is getting out on Bluray next week I did a full rewatch of SAO not long ago.", "created_utc": "1656815985.0", "edited": "False", "id": "ieni1zz", "is_submitter": "False", "link_id": "t3_vq2jwu", "parent_id": "t3_vq2jwu", "score": "1", "subreddit": "anime", "subreddit_id": "t5_2qh22"}, {"author": "getsandom", "body": "I've seen a few besides the ones you listed, you probably heard of those as well, but here you go:\n\nTsuki ga Michibiku Isekai Douchuu is kind of a middle of the road but it doesn't take itself seriously. The MC is not the \"hunk/cutie\" you see all the isekai girls falling for and it makes for a quite fun watch.\n\nShinka no Mi: Shiranai Uchi ni Kachigumi Jinsei is quite \"out there\" on the silly comedy but I liked it.\n\nMaou-sama, Retry! is typical of the relax isekai OP MC sub-genre.\n\nKami-tachi ni Hirowareta Otoko is another one you would find looking for it.\n\nKenja no Deshi wo Nanoru Kenja feels at the start like it could develop in to something more like Overlord but as far as the season that is out it doesn't. The argument of the story feels like it has potential but this first season is quite relaxed.", "created_utc": "1656737355.0", "edited": "False", "id": "iejjemt", "is_submitter": "False", "link_id": "t3_voiu6a", "parent_id": "t1_iefe4na", "score": "1", "subreddit": "anime", "subreddit_id": "t5_2qh22"}, {"author": "getsandom", "body": "I have a soft spot for the silly side of the OP MC.\n\nNot that some cannot be good but most are power-fantasy a là Arifureta and such. I don't exactly dislike those but they are hit-or-miss for me most of the time.\n\nOn the other hand I'm quite fond of the \"turn your brain off and enjoy\" kind like In the Land of Leadale, Kuma Kuma Kuma Bear and the like. Specially if I'm a bit tired or was watching something a bit more \"heavy\" in any sense.", "created_utc": "1656651215.0", "edited": "False", "id": "ieexx83", "is_submitter": "False", "link_id": "t3_voiu6a", "parent_id": "t3_voiu6a", "score": "3", "subreddit": "anime", "subreddit_id": "t5_2qh22"}, {"author": "getsandom", "body": "If fortune smile on us we hopefully will not. I'm yet to see any show, anime or western, going past 150 episodes and keeping quality. \n\nThat and the cult-like air that forms around the \"classics\"/\"must-watch\"/\"big n\" is the reason I avoid them.", "created_utc": "1656559945.0", "edited": "False", "id": "ie9wvgz", "is_submitter": "False", "link_id": "t3_vn9ik2", "parent_id": "t3_vn9ik2", "score": "1", "subreddit": "anime", "subreddit_id": "t5_2qh22"}, {"author": "getsandom", "body": "My whole scoring method is based in how much I'd recommend and how much of a chance there is that I'd rewatch a title myself.", "created_utc": "1656469004.0", "edited": "False", "id": "ie4wpov", "is_submitter": "False", "link_id": "t3_vmyprc", "parent_id": "t3_vmyprc", "score": "1", "subreddit": "anime", "subreddit_id": "t5_2qh22"}, {"author": "getsandom", "body": "Num lugar onde a infraestrutura não é um lixo como aqui no Brasil, usando somente tecnologias que já existem, sem precisar desenvolver nada do zero, A Intel está gastando mais de 10 bilhões de dólares em um única fabrica que está sendo desenvolvida no Arizona-EUA.\n\nAqui no Brasil pra ter o mesmo resultado eles gastariam no mínimo 5\\~10 vezes isso, os 10 bi que pagam a fabrica inteira nos EUA ia ser gasto só pra molhar a mão de político que não entende merda de tecnologia.\n\nSobre o post original: Depois do avião, nunca houve tecnologia significativa originada no Brasil, toda \"alternativa\" que havia nos anos da ditadura era cópia malfeita de tecnologia que já existia lá fora. A abertura de mercado feita pelo Collor só fez mostrar o ridículo do atraso das tecnologias usadas aqui em relação ao que estava disponível lá fora que está sendo mantido até hoje com a estupidez dos impostos de importação.\n\nEu trabalho com tecnologia, sou desenvolvedor de software especializado em automação industrial, aqui no Brasil as empresas estão apelando pra tecnologias que lá fora são usadas por amadores como Arduino e Raspberry Pi pra fazer automação e tentar implantar algo que seja uma sombra do que deveria ser a industria 4.0.", "created_utc": "1656467042.0", "edited": "1656467478.0", "id": "ie4sn8o", "is_submitter": "False", "link_id": "t3_vml3bq", "parent_id": "t1_ie4otsz", "score": "1", "subreddit": "InternetBrasil", "subreddit_id": "t5_3f3s5"}, {"author": "getsandom", "body": "I'm kinda voracious when it come to anime. I've been watching anime, with a couple of year+ long hiatuses, for some 13 years now.\n\nI've watched 19784 episodes from 1618 series/seasons. 1405 completed, 76 stalled, 128 dropped and some 20 or so currently watching between a couple of main titles and a background of old stuff I go through slowly over time. That's about 10 1/2 months of anime if you would watch 24/7. At the speed I going though stuff currently I believe it will be a full year by the end of 2022.\n\nIf you get curious here's a link to my list on [Anime-Planet](https://www.anime-planet.com/users/getsandom)", "created_utc": "1656385966.0", "edited": "1656386438.0", "id": "ie0ei2u", "is_submitter": "False", "link_id": "t3_vlt03u", "parent_id": "t3_vlt03u", "score": "1", "subreddit": "anime", "subreddit_id": "t5_2qh22"}, {"author": "getsandom", "body": "I basically gave up on non-interactive western media since a couple of years ago so except for some occasional gaming or reading a novel or manga here and there, anime composes some 2/3 of my media consumption or about half of my free time.", "created_utc": "1656385375.0", "edited": "False", "id": "ie0ddgt", "is_submitter": "False", "link_id": "t3_vludav", "parent_id": "t3_vludav", "score": "0", "subreddit": "anime", "subreddit_id": "t5_2qh22"}, {"author": "getsandom", "body": "People are attracted **because** there is no reality constraint **not despite** of it.", "created_utc": "1656384857.0", "edited": "False", "id": "ie0cdjj", "is_submitter": "False", "link_id": "t3_vm5pqk", "parent_id": "t3_vm5pqk", "score": "1", "subreddit": "anime", "subreddit_id": "t5_2qh22"}, {"author": "getsandom", "body": "Kumo no You ni Kaze no You ni\n\n**From Anilist:**\n\nThe country of Sokan is in turmoil. Following the death of the Emperor, a power struggle over the line of succession ensues. To cement the crown prince's rule, he must find a suitable bride. And so, the hunt for a new empress begins!\r  \n\r  \nGinga is a straightforward, lively country girl who joins the competition for the emperor's hand. Her earnest innocence shocks and reinvigorates the denizens of the palace. But can one girl's optimistic spirit help to save a kingdom facing threats both from within and without?", "created_utc": "1656297964.0", "edited": "False", "id": "idvtzi5", "is_submitter": "False", "link_id": "t3_vlifjn", "parent_id": "t3_vlifjn", "score": "2", "subreddit": "anime", "subreddit_id": "t5_2qh22"}, {"author": "getsandom", "body": "What is or not child appropriate is not universally agreed, you have to remember that while modern American kids are not allowed to go beyond their own backyard alone in Japan primary school kids are expected to got to school by themselves using public transport. \n\nAnime and manga are ultimately created with the Japanese cultural frame in mind and barring more explicit intentionally sexual content will target an audience that would not be allowed to see it in western countries.", "created_utc": "1656285946.0", "edited": "False", "id": "idv5ih3", "is_submitter": "False", "link_id": "t3_vl0ais", "parent_id": "t3_vl0ais", "score": "1", "subreddit": "anime", "subreddit_id": "t5_2qh22"}, {"author": "getsandom", "body": "There are a few highly regarded titles I just don't care for. \n\nThere were a couple that just didn't do for me and I dropped after the first episode, namely Astra Lost in Space and Asobi Asobase.\n\nKonosuba, the first season was good enough to finish, the second went downhill for me.\n\nOne I dropped recently and early was GATE, if you look at the scores and synopsis it looks solid but to me was pure boredom.\n\nThose are just a few. With the amount of shows I tried I'd say my dropped list, as long it its, is not as bad.", "created_utc": "1656282248.0", "edited": "False", "id": "iduxra6", "is_submitter": "False", "link_id": "t3_vledpj", "parent_id": "t3_vledpj", "score": "2", "subreddit": "anime", "subreddit_id": "t5_2qh22"}, {"author": "getsandom", "body": "I usually avoid any title that has one of the \"must watch\", \"classic\", ''big n\" and so on labels attached, I made the mistake of making Evangelion an exception, those were 5 regretful episodes I've endured.\n\nThere is a limit to the popularity of a show beyond which it the fanbase basically turns to a cult, Evangelion and Death Note are the worst offenders in this regard in my opinion.", "created_utc": "1656281254.0", "edited": "False", "id": "iduvlpr", "is_submitter": "False", "link_id": "t3_vledpj", "parent_id": "t1_iduu75z", "score": "3", "subreddit": "anime", "subreddit_id": "t5_2qh22"}, {"author": "getsandom", "body": "This past week several of the 12\\~13 episode shows of the current season finished airing so I'm basically rampaging through the \"new stuff\" at the moment though I did pick up a couple of relatively big name shows I've being dragging my feet about:\n\n**Goblin Slayer -** I actually like the more somber tone specially of the MC, some anime can suffer for being \"excessively colorful\". I do think that while I wouldn't remove the more \"heavy\" stuff outright as in my opinion is essential to the story, the anime does go into the \"shock value\" territory unnecessarily. Still, looking forward to the new season when it comes out.\n\n**Rising of the Shield Hero -** Mixed feelings here. I like the MC and his troupe, I'm not really sure about the main plot with all the holes it leaves hanging. For what comments I've read, the second season its supposed to have a different feeling from the first most people disliked. I do intend to go through the second season when it's done though.", "created_utc": "1656280231.0", "edited": "False", "id": "idutdu2", "is_submitter": "False", "link_id": "t3_vlbru2", "parent_id": "t3_vlbru2", "score": "4", "subreddit": "anime", "subreddit_id": "t5_2qh22"}, {"author": "getsandom", "body": "Different from the constants, that are either defined to be their value (like the speed of light) or measured to the best approximation possible (like the plank constant), the exponents in physics formulas in general come from the mathematical generalization of the model not from measurements. That is not to say that there are not \"complicated\" exponents, you don't have to get to deep in physics to start to find \"pi\" and \"e\" all over the place even in exponents, and while they look neet in  the formula you have to remember they are just a shorthand for numbers we don't know the exact value.", "created_utc": "1656212779.0", "edited": "False", "id": "idri4xk", "is_submitter": "False", "link_id": "t3_vktlsa", "parent_id": "t3_vktlsa", "score": "4", "subreddit": "askscience", "subreddit_id": "t5_2qm4e"}, {"author": "getsandom", "body": "SAO isn't going anywhere any time soon. With the momentum it has now i'd say it has the potential to be adapted to the end whenever it comes.\n\nAccell World on the other hand was all but sidelined.", "created_utc": "1655858654.0", "edited": "False", "id": "id8xuyx", "is_submitter": "False", "link_id": "t3_vh2m7r", "parent_id": "t1_id4xlm9", "score": "1", "subreddit": "anime", "subreddit_id": "t5_2qh22"}, {"author": "getsandom", "body": "My mid-season dropped list is 127 titles long so I won't go into detail but there are a few highlights.\n\nI usually keep away from anything that get called \"classic\", \"must watch\", \"big x\", etc. The one big exception I made was for Evangelion and damn it was bad, 5 episodes was all I could stomach.\n\nTwo big names I got through a season and just didn't bother to continue were Spice and Wolf and Attack on Titan, both are not bad but nowhere near as good as people make it look.\n\nOne that has a modicum of success that manage to put me off was Quintessential Quintuplets, I can't put my finger to it but it literally irk me out. I like me some yuri but I got the same feeling from Citrus. I don't know if it's the voice acting, character interaction, there isn't a definite thing that made me want stop watching I just couldn't continue.", "created_utc": "1655857655.0", "edited": "False", "id": "id8vudx", "is_submitter": "False", "link_id": "t3_vh6poh", "parent_id": "t3_vh6poh", "score": "1", "subreddit": "anime", "subreddit_id": "t5_2qh22"}, {"author": "getsandom", "body": "The one thing that put me off watching a title is extreme long term popularity to the point of \"mithification\". Things like Naruto, Dragonball, Death Note, Evangelion, <<put your \"my aunt know is anime here\">>, smell like herd mentality to me.\n\nNot that I completely cut of any title. Sometimes I do try one of the \"Big N/classics\" usually only to discover that they are either insipid or annoying.", "created_utc": "1655523726.0", "edited": "False", "id": "icsmzv2", "is_submitter": "False", "link_id": "t3_vemvd2", "parent_id": "t3_vemvd2", "score": "1", "subreddit": "anime", "subreddit_id": "t5_2qh22"}, {"author": "getsandom", "body": "In my opinion, being a completionist is something a few people in the community should work to be freed of. \n\nYou watch anime to have fun and enjoy, no point keeping up with it if it isn't any of those things. I'm sure you got a title here and there that caught your eye but when you got to the synopsis it wasn't to your taste, why should it be any different after any number of episodes?\n\nIf you were intent in writing a review that might be a reason to keep up but that's about the only reason I can think of to finish a show you are not into.", "created_utc": "1655522783.0", "edited": "False", "id": "icslh01", "is_submitter": "False", "link_id": "t3_veo25i", "parent_id": "t3_veo25i", "score": "2", "subreddit": "anime", "subreddit_id": "t5_2qh22"}, {"author": "getsandom", "body": "If I had to say, with the help of my list, the first \"out there\" anime I can remember watching would be \"Majin Tantei Nougami Neuro\". I was up to a few dozen shows/seasons by then, most good but the \"standard fare\".", "created_utc": "1655522094.0", "edited": "False", "id": "icskbkm", "is_submitter": "False", "link_id": "t3_ves7t9", "parent_id": "t3_ves7t9", "score": "1", "subreddit": "anime", "subreddit_id": "t5_2qh22"}, {"author": "getsandom", "body": "Cardcaptor Sakura was the first anime I watched start to finish and one of very very few I rewatch occasionally. While is obviously targeted at an younger crowd and have some episodic structure is an realy good watch.\n\nSakura is also the root of the CLAMP multiverse although not the main/most detailed story. All work based on the manga from CLAMP is interlinked in a multiverse, if you give it a chance and like it you might want to watch at the very least xxxHolic and Tsubasa Chronicles as well.", "created_utc": "1655431157.0", "edited": "False", "id": "icnp27l", "is_submitter": "False", "link_id": "t3_vddo24", "parent_id": "t3_vddo24", "score": "1", "subreddit": "anime", "subreddit_id": "t5_2qh22"}, {"author": "getsandom", "body": "The simple fact that there is a tension between localizers and fans tells you all you need to know.\n\nThe work of the localizers should be make the show understandable with as little interference as possible to the original meaning, if they are not doing that to the point that the fans are taking notice they are failing on what they were paid to do to begin with.\n\n**The fans are the audience**, if the localizers are changing things despite the fans protests they are doing so to fulfill their own views not that of the audience and should be stopped.", "created_utc": "1655255128.0", "edited": "False", "id": "iceezkq", "is_submitter": "False", "link_id": "t3_vbug4c", "parent_id": "t3_vbug4c", "score": "2", "subreddit": "anime", "subreddit_id": "t5_2qh22"}, {"author": "getsandom", "body": "It shouldn't, the character should physically cease to be on the original world either by death or transport, to my knowledge most of the trapped in a VR game don't classify. Even Overlord to me doesn't hit 100% certainty. The only one I'm sure is an isekai is Leadale where the MC dies in the real world but keeps living as her character in a world that is supposed to be the one of the game she played.", "created_utc": "1655177876.0", "edited": "False", "id": "icaekrm", "is_submitter": "False", "link_id": "t3_vbd61n", "parent_id": "t1_icaal6t", "score": "1", "subreddit": "anime", "subreddit_id": "t5_2qh22"}, {"author": "getsandom", "body": "If the character have not physically ceased to be on the original world it should not be considered isekai", "created_utc": "1655177360.0", "edited": "False", "id": "icadipf", "is_submitter": "False", "link_id": "t3_vbd61n", "parent_id": "t1_ic8nupt", "score": "1", "subreddit": "anime", "subreddit_id": "t5_2qh22"}, {"author": "getsandom", "body": "I'm not well versed on the Fate franchise but aren't the servants \"non-existing\" while they have not been summoned? For the little I remember they don't have an existence independent from their summoner before the summoning and they are not a \"reincarnation\" of the hero they represent.", "created_utc": "1655176888.0", "edited": "False", "id": "icacj5g", "is_submitter": "False", "link_id": "t3_vbd61n", "parent_id": "t1_ic90vlb", "score": "1", "subreddit": "anime", "subreddit_id": "t5_2qh22"}, {"author": "getsandom", "body": "Hozuki no Reitetsu: It's basically a slice of life about the mythical figures of the Japanese afterlife. The MC is basically the second in command of the 5th circle of hell. Of the many hundreds of shows I've seem is one of the most unique and bizarre things I ever watched and I loved every second of it.", "created_utc": "1654919980.0", "edited": "False", "id": "ibxsta3", "is_submitter": "False", "link_id": "t3_v9ngx6", "parent_id": "t3_v9ngx6", "score": "3", "subreddit": "anime", "subreddit_id": "t5_2qh22"}, {"author": "getsandom", "body": "Technically, laws about pornography don't apply to \"hand created art\" in Japan including photorealistic 3d models, the UN has been putting pressure in Japan to criminalize loli porn for decades now with no results.\n\nAs for real people, Japan was one of the last countries to consider child nudity as porn in 1999.", "created_utc": "1654835428.0", "edited": "False", "id": "ibthsl8", "is_submitter": "False", "link_id": "t3_v8b8nw", "parent_id": "t1_ibphrly", "score": "1", "subreddit": "anime", "subreddit_id": "t5_2qh22"}, {"author": "getsandom", "body": "I'm up to 19504 episodes from 1596 series/seasons as of writing this, by the end of the year I'll probably have watched enough anime that rewatching it would take a full year watching 24/7 nonstop.\n\nIf I had to say what I'd consider a lot, I've felt like having watched a lot when I got past about 1/3 of what I watched up to now.", "created_utc": "1654832477.0", "edited": "False", "id": "ibtcyk3", "is_submitter": "False", "link_id": "t3_v87yo8", "parent_id": "t3_v87yo8", "score": "1", "subreddit": "anime", "subreddit_id": "t5_2qh22"}, {"author": "getsandom", "body": "We still have a few weeks to go before the current short season shows finish airing and I finally get to dig at the fresher stuff so I'm still going through my background list with a highlight here and there.\n\nThis week I was more in a relax mood so no great adventures:\n\n**Hozuki no Reitetsu**, finished, whatever that show was about only the oni and yokai know, all I know is that was quite fun to watch. Thoroughly recommend if you are after some nonsense sprinkled with mythology to turn your brain off and laugh at.\n\n**Taisho Otome Otogibanashi**, finished, slice of life comedy drama romance with a relatively rare actual real life historical backing. Despite what the premise of the show is supposed to be it manages a level of \"fluffyness\" I mighty only have seen in the likes of Yurucamp. I find it hard to put into words in a way that doesn't feel demeaning to the show so I'll only say I enjoyed it a lot.\n\n**Assassins Pride**, finished, this one I consider a mixed bag, it feels like it had potential but it suffers from the same \"throw you naked in the middle of the fight\" problem as \"The Master of Ragnarok & Blesser of Einherjar\", there is a whole world that needs and completely lacks building with the focus almost always pinpointed on the here and now of the MC. I know is based on ongoing novel series so I might give it a peek to see where the fault lies.", "created_utc": "1654478211.0", "edited": "False", "id": "ibbewqg", "is_submitter": "False", "link_id": "t3_v5k1gg", "parent_id": "t3_v5k1gg", "score": "3", "subreddit": "anime", "subreddit_id": "t5_2qh22"}, {"author": "getsandom", "body": "**First and foremost, anything you do for your own enjoyment without bothering anybody else is nobody's business besides your own.**\n\nSecond, most people who live in places where American animation is the main source of \"understanding\" what animation is unfortunately suffer from what I like to call \"Disney Syndrome\" from which is very hard to break someone away specially if they gave up on animation themselves just because of age. If you think your folks can be reasoned with you could try a short watch of something that is \"dead serious\" but not \"tropey\" like \"Grave of the Fireflies\", anyone that think that is kids title better get mental health help soon.\n\nThird, just because something IS for kids does that have to mean adults don't get to have fun with it as well? Even if you look away from anime that definitely have adult content (on every sense), you have no shortage of adults that love Pixar animations just to cite one example. A lot of anime that IS for kids is still amazing as well, in my opinion because they don't treat kids as mentally underdeveloped like American TV animation usually do this days.\n\nI'm a 40 year old guy who didn't \"get into\" anime until I was already older than you are now and I don't see me stopping for anything anytime soon so, so long as it's not getting in the way of your own life, keep enjoying and just let the critics wash away.", "created_utc": "1654410906.0", "edited": "False", "id": "ib86w9o", "is_submitter": "False", "link_id": "t3_v4tfn5", "parent_id": "t3_v4tfn5", "score": "1", "subreddit": "anime", "subreddit_id": "t5_2qh22"}, {"author": "getsandom", "body": "I usually rate based on \"watchability\", that is: \n\n* How much I would recommend someone else to watch\n* How much I'd be willing to rewatch\n* How much I want to keep watching\n* How much of my attention the watching will take\n\nI use Anime-Planet which uses a 0-5 scales so mine would be:\n\n5 As good as it gets, as nothing is perfect\n\n4+ Would watch to the end, potentially rewatch, recommend to others if I'm aware of the persons tastes and demographic\n\n3+ Would finish but generally not rewatch, unless is some brainless fun and/or for the laughs might not recommend\n\n2+ Finishing is doubtful, might use as background noise as I do other things\n\nLess than 2 definitely dropping, not wasting my time and concentration\n\nI usually take a 3 episode approach to make a decision, with some exceptions, if I get past the 3rd episode of the show/season I'll rate it even if I drop it. The rating I give after the 3rd episode might change if I get at the end of the show or if I dropped it.\n\nSometimes I do drop a show after the 1st episode even if it might be good as it might not be for me and normally I don't even register those to my list.", "created_utc": "1653961339.0", "edited": "False", "id": "iam379j", "is_submitter": "False", "link_id": "t3_v14o1d", "parent_id": "t3_v14o1d", "score": "1", "subreddit": "anime", "subreddit_id": "t5_2qh22"}, {"author": "getsandom", "body": "As per normal, all I watch are things that finished airing but since we are literally in the middle of the current season there is a lot I'm holding until I can binge the new shows that caught my eye. Follows a run of what I watched besides my usual old stuff background list:\n\n**Our Last Crusade or the Rise of a New World**, finished, had started a couple of weeks ago and had stalled.\n\n**Cells at Work! Code Black**, continuing from Cells at Work! that I watched last week, brilliant show, ended in a bit of a cliffhanger definitely picking a new season up in case there is one.\n\n**Hozuki's Coolheadedness**, picked and finished the first season, currently on the second.\n\n**A Certain Scientific Railgun T**, started and currently midway through, always preferred Railgun over Index. I dropped Index 3rd season as the story managed to get uninteresting and convoluted at the same time, while that's normally not me, might pick it back up for the sake of completion but will probably have a peek at Accelerator first.", "created_utc": "1653860756.0", "edited": "False", "id": "iah2jld", "is_submitter": "False", "link_id": "t3_v0hvfw", "parent_id": "t3_v0hvfw", "score": "5", "subreddit": "anime", "subreddit_id": "t5_2qh22"}, {"author": "getsandom", "body": "I tried Flowers of Evil before knowing it was rotoscoped, that is, flat color traced over live action pretending to be animation. To me rotoscoping its on the same level of chromatic aberration and motion blur in games, not only it shouldn't exist but also makes me physically sick as my brain tries to make sense of what is wrong with the image.", "created_utc": "1653801951.0", "edited": "False", "id": "iaea3lr", "is_submitter": "False", "link_id": "t3_uzggil", "parent_id": "t3_uzggil", "score": "1", "subreddit": "anime", "subreddit_id": "t5_2qh22"}, {"author": "getsandom", "body": "The studio \"master copy\" might be even greater resolution (6K/8K/12K) and movies might get a release in 4K if there is a master from where to get that level of quality but TV series BluRay is usually lowered to 1080p to get a number of episodes in each disc.\n\nOn the consumer side 2d animation doesn't benefit as much of higher resolution as 3d animation and live action, if you have a high enough bitrate so there are no compression artifacts you can scale 1080p to be perceptually undistinguishable from 4K or bigger. The problem arises with streaming which is where most people get anime nowadays, they might say the resolution is 1080p but the bitrate is lowered to save on network bandwidth and that can cause havoc with compression artifacts since the algorithms used are the same as the ones for compressing live action and are not optimized for 2d animation which normally have a lot of \"hard edge\" color transitions.", "created_utc": "1653800275.0", "edited": "False", "id": "iae7ro7", "is_submitter": "False", "link_id": "t3_uzs5p5", "parent_id": "t3_uzs5p5", "score": "1", "subreddit": "anime", "subreddit_id": "t5_2qh22"}, {"author": "getsandom", "body": "All media, anime included always original audio no matter what.\n\nFor anime, Japanese is not a hard language to comprehend so the subs for me are just a crutch I peek when dialog is to fast or the characters are speaking about some less mundane subject.\n\nAlso maybe because English is not my first language dubs generally rub be the wrong way and just don't fell as well matched to the animation as the original.", "created_utc": "1653711165.0", "edited": "False", "id": "iaa0aj8", "is_submitter": "False", "link_id": "t3_uza3a6", "parent_id": "t3_uza3a6", "score": "5", "subreddit": "anime", "subreddit_id": "t5_2qh22"}, {"author": "getsandom", "body": "As a lot of people have mentioned, Unital Ring, the current arc is still being worked on. Without going in to spoilers, to the point I've read (last one available in English V24) the story is still on the \"setup\" just starting to get into gear.\n\nOne thing most people will not normally be aware is that \"technically\" all arcs of SAO up to the end of Alicization were already out before animation started. SAO was published as a web-novel from 2002 to 2008, the light novels were basically a \"redressing\" and the animation producers had material to work even if the novels were still being in production. Unital Ring in contrast is completely new story picking up from were Alicization left.\n\nQuality aside, SAO is a huge cash cow, you can count in your fingers the number of franchises with as much popular appeal so even if it takes a while a new series is sure to come. In my opinion, if the author writes all he planned there will be material for at least 2 full seasons even if takes a while.", "created_utc": "1653540655.0", "edited": "False", "id": "ia12vxs", "is_submitter": "False", "link_id": "t3_uxhoca", "parent_id": "t3_uxhoca", "score": "0", "subreddit": "swordartonline", "subreddit_id": "t5_2uikt"}, {"author": "getsandom", "body": "In anime the first one with full-dive tech I watched would be Corrector Yui (1999), I didn't watch when it aired but it was one of the first I watched when I started to get serious with anime and was definitely before SAO launched.", "created_utc": "1653538272.0", "edited": "False", "id": "ia0z5yc", "is_submitter": "False", "link_id": "t3_uxsbno", "parent_id": "t3_uxsbno", "score": "1", "subreddit": "swordartonline", "subreddit_id": "t5_2uikt"}, {"author": "getsandom", "body": "Being a fan o both, I think that are 2 reasons that Accel didn't get the attention it deserves.\n\nThe first and more obvious is that timewise it overlapped with SAO and got overshadowed, the popularity o SAO was somewhat explosive and producers being business people will follow the money sometimes in detriment of the art.\n\nThe second is in my opinion that the first arc o Accel started the series in the wrong foot, as good as the story is, it's super creepy/cringy even in the novel, and that was kind of amplified in the animation and I think that put a number of people off.\n\nThat said, since I'm on vacation lazing around at home I decided to catch up with the novel and in my opinion they lost a huge opportunity, the arcs following the ones that got animated are on another level compared with the first ones. Since SAO will be without a series for a while until there is enough content in Unital Ring they should revisit Accel specially since the author plans to link both stories by the end of SAO.", "created_utc": "1653533580.0", "edited": "False", "id": "ia0qln9", "is_submitter": "False", "link_id": "t3_uxkie0", "parent_id": "t1_i9yc9ro", "score": "3", "subreddit": "anime", "subreddit_id": "t5_2qh22"}, {"author": "getsandom", "body": "Depends heavily on the execution but I'd watch that for sure.", "created_utc": "1653459222.0", "edited": "False", "id": "i9wl4ov", "is_submitter": "False", "link_id": "t3_uxanz3", "parent_id": "t3_uxanz3", "score": "1", "subreddit": "anime", "subreddit_id": "t5_2qh22"}, {"author": "getsandom", "body": "I finished Cells at Work yesterday and \"damn\", I'm a huge nerd and somewhat of a polymath so a reasonable chunk of the information side of things was not new to me but the execution was amazing.", "created_utc": "1653373240.0", "edited": "False", "id": "i9s0zn0", "is_submitter": "False", "link_id": "t3_uwcwo0", "parent_id": "t1_i9rfo6t", "score": "1", "subreddit": "anime", "subreddit_id": "t5_2qh22"}, {"author": "getsandom", "body": "I'd have no qualms with anime getting popular however, tall order as it may be, I'd like the Japanese producers to cut the middle man to avoid western \"feedback\" to influence what gets produced. A number loud \"squeaky wheels\" that don't really represent the community seem to get a say nowadays with the streaming side of things.\n\nWestern stream services and the localizers they employ while not on a Hollywood level yet, have been contaminated by the cesspool of the American culture clash with thrash trying to get in from both of the stupid sides of it.\n\nI an ideal world we could get anime translated and streamed straight from the source with the producers not only being responsible for how it gets done but also receiving the monetary side of things as straight from the fans as possible. Unfortunately, with the exception of some extraordinary development, I don't see it happening. It happened in a similar fashion to the music industry, by the time streaming became a thing licensing was the most economically viable way for studios as the infrastructure needed is big and costly and already in place in the west, which give streaming services to much clout. When someone pays you a god chunk of your income you listen to then on what your product should be.", "created_utc": "1653372864.0", "edited": "False", "id": "i9s0iqi", "is_submitter": "False", "link_id": "t3_uwdnob", "parent_id": "t3_uwdnob", "score": "1", "subreddit": "anime", "subreddit_id": "t5_2qh22"}, {"author": "getsandom", "body": "I usually am quite open to give a chance for anything, length or art style are important but never a deal breaker, I'm not fussy/queasy about argument/subject matter of the story either. \n\nSnobby as it may sound, the one thing that will make me push a tittle to the bottom or even out of the queue is how big of a name a title gets, basically all the \"everyone and their aunt knows is anime\" titles like Naruto, Dragonball, One Piece, <name your BIG N titles here>, ..., something about having the \"western eye\" on a title puts me off wanting to watch it.", "created_utc": "1653370882.0", "edited": "False", "id": "i9rxyzg", "is_submitter": "False", "link_id": "t3_uwgaqy", "parent_id": "t3_uwgaqy", "score": "1", "subreddit": "anime", "subreddit_id": "t5_2qh22"}, {"author": "getsandom", "body": "The movie is very good but the age does show (1984 - almost as old as I am), the manga on the other hand is Miyazaki's masterpiece, much more than any of his movies. I do recommend to go for both if you have access and can afford the time though.", "created_utc": "1653287816.0", "edited": "False", "id": "i9nme17", "is_submitter": "False", "link_id": "t3_uv5pr5", "parent_id": "t3_uv5pr5", "score": "1", "subreddit": "anime", "subreddit_id": "t5_2qh22"}, {"author": "getsandom", "body": "I use MPC-HC so don't know about other players as I don't like the \"user friendly over control\" of most \"modern\" ones, and it has support for HLSL shaders and has some that come preinstalled but I usually use only for filtering if I pick up some older and hard to find show with a not so great video quality.\n\nYou can create your own, but is basically a script that is run on top of the pixels, so you should be comfortable with programming. Or you could rummage around the internet, there is sure to be a repo or 2 on GitHub with a CRT effect HLSL pixel shader.", "created_utc": "1653286112.0", "edited": "False", "id": "i9nk8om", "is_submitter": "False", "link_id": "t3_uvki7u", "parent_id": "t3_uvki7u", "score": "1", "subreddit": "anime", "subreddit_id": "t5_2qh22"}, {"author": "getsandom", "body": "I don't believe I'll ever skip an anime because it's art aged. I just finished Dirty Pair (1985 - almost as old as me) this week for example, I'm slowly going through Ranma 1/2 (1989) and You're Under Arrest (1996) on my background list, I picked up Slayers (1995) this week and was pleasantly surprised at how fun it was for me.\n\nThe only things I usually avoid are the \"everyone knows is anime\" titles, everything else if the summary catches my eye I might give it try.", "created_utc": "1653285061.0", "edited": "False", "id": "i9nivf1", "is_submitter": "False", "link_id": "t3_uvlmwt", "parent_id": "t3_uvlmwt", "score": "1", "subreddit": "anime", "subreddit_id": "t5_2qh22"}, {"author": "getsandom", "body": "If what I heard the author has plans for gets published, unless he get stupidly sloppy, a single full season won't cover all there is to tell. The plan is to link the end of SAO with the beginning of Accel World, that in time alone is 13 years of gap at the moment. \n\nAs for time, my guess would be end 2025 to get a full season for the first part of Unital Ring at current pace. If they want to maintain relevance the movies will fall short in my opinion, they should definitely animate Progressive from the novel side in full, though that is wishful thinking at the moment.", "created_utc": "1653192563.0", "edited": "False", "id": "i9j0kn7", "is_submitter": "False", "link_id": "t3_uus9is", "parent_id": "t1_i9h2n8t", "score": "1", "subreddit": "anime", "subreddit_id": "t5_2qh22"}, {"author": "getsandom", "body": "If I had to say, it would take another couple of years, I've being keeping up with the novels as they are translated (just read main series V24 and Progressive V7 this week) and given the number of pages per volume and pacing of the story I'd say it would take up to V28 which will probably be out at the end of 2023 to get a half-season/cour.\n\nThe story did pick up the pace in the V24 but I'd guess that since SAO usually comes out in full 20+eps seasons it will take until at least 2025 to have enough new material.\n\nOne thing people might not be aware of is that what was adapted until now, including the Alicization arc, already \"technically\" out even before the anime even started so the producers of the anime had material to work even if the novels where still bering worked on. SAO was originally a web novel, and the whole story up to Alicization was written before the novel started being published (2008), the author was basically \"dressing it up\" to get a to a novel format. Unital Ring on the other hand is being written completely from scratch which would take reasonably longer.\n\nAs to where it will go, as far as I heard, the intention of the author is to link SAO and Accel World, so there are 13 years of story to cover between 2026 where SAO is now and 2039 where the first accelerated game started.", "created_utc": "1653191502.0", "edited": "False", "id": "i9iyy8u", "is_submitter": "False", "link_id": "t3_uus9is", "parent_id": "t3_uus9is", "score": "2", "subreddit": "anime", "subreddit_id": "t5_2qh22"}, {"author": "getsandom", "body": "2d animation doesn't benefit much from bigger resolution, flat color fields with hard color change edges make it easy to upscale without loss of quality, less compression on the other hand would be a bless, video compression is made to work on \"real\" looking images and do a number on \"drawings\" when you crank the settings to get smaller files for streaming for example.", "created_utc": "1653013464.0", "edited": "False", "id": "i9a2zbb", "is_submitter": "False", "link_id": "t3_ut4451", "parent_id": "t3_ut4451", "score": "1", "subreddit": "anime", "subreddit_id": "t5_2qh22"}, {"author": "getsandom", "body": "There are a few things I learned with the little interaction I usually have with the community one of them is most people a really shallow and never get past the first layer of most of what they watch, as a consequence people with nuanced opinion are relatively rare.\n\nWithout going to deep as you have not seem it yet, in the case of Re:Zero I'd say the cringy and bipolar nature of the MC is one of the main points of contention, some people think is a \"touch of genius\" since it sets the MC apart from most isekai characters while others which might have got into it expecting a \"by the books\" isekai get frustrated by it.\n\nIn my personal opinion, the story being told make it worth it, I don't know the source material so I couldn't tell how faithful is the adaptation is, so while I do think the way the MC behaves could be toned down just a notch, that doesn't take away from the rest of the show.\n\nAll of that actually should not stop you trying it, only you can form your opinion.", "created_utc": "1653011141.0", "edited": "False", "id": "i99y9ee", "is_submitter": "False", "link_id": "t3_utdd1n", "parent_id": "t3_utdd1n", "score": "2", "subreddit": "anime", "subreddit_id": "t5_2qh22"}, {"author": "getsandom", "body": "I felt about the same as you, and while I did finish the first season, I couldn't be bothered to continue.\n\nIn my opinion if I'm not having fun is not worth my time. You should always watch first an foremost for your enjoyment, if you are not enjoying there is no point.\n\nDon't ever feel you need to be a completionist.", "created_utc": "1652844299.0", "edited": "False", "id": "i915sua", "is_submitter": "False", "link_id": "t3_urifmm", "parent_id": "t3_urifmm", "score": "1", "subreddit": "anime", "subreddit_id": "t5_2qh22"}, {"author": "getsandom", "body": "The problem is not the use of shounen per se specially since most people actually mean action/adventure/battle shounen, the problem is most people thinking any piece of media, not only anime, should fit in a box. I'm yet to find any media that can be described as \"this is only drama\", most media don't even have a \"main\" genre.", "created_utc": "1652762270.0", "edited": "False", "id": "i8ws301", "is_submitter": "False", "link_id": "t3_uqzg69", "parent_id": "t3_uqzg69", "score": "1", "subreddit": "anime", "subreddit_id": "t5_2qh22"}, {"author": "getsandom", "body": "I liked it enough to actually want another season however I was left with the impression that the story we got so far was just the setup, I don't now the source material and how well it was adapted but the anime felt like it was just getting started at the end of the part 2, like pieces were just beginning to move on the board. I felt the same way about \\[Ascendance of a Bookworm\\] >!when it took all the way to the end to finally see Myne as someone people would give more attention than a smarter than average kid!<.\n\nEdit: I usually binge the seasons after they finish so the current state of Ascendance of a Bookworm is unknown to me at the moment.", "created_utc": "1652680541.0", "edited": "1652680879.0", "id": "i8septn", "is_submitter": "False", "link_id": "t3_uqa94j", "parent_id": "t3_uqa94j", "score": "2", "subreddit": "anime", "subreddit_id": "t5_2qh22"}, {"author": "getsandom", "body": "Your comment remembered me of bit of a curiosity, I was re-watching Birdy the Mighty-Decode a few days ago, I watched almost 1600 shows/seasons at this point and have a reasonable memory but as far as I can recall it's the only anime I ever watched to mention the experiments done by the Japanese military during WWII.", "created_utc": "1652679170.0", "edited": "False", "id": "i8sctlu", "is_submitter": "False", "link_id": "t3_uqmrnu", "parent_id": "t1_i8s3g5o", "score": "3", "subreddit": "anime", "subreddit_id": "t5_2qh22"}, {"author": "getsandom", "body": "I'm not one to rewatch almost anything but I literally lost count how many times I watched Nausicaa (20+ for sure).\n\nIf you haven't already and have the opportunity, read the manga, the movie is amazing but it's age shows, the manga on the other hand is Miyazaki's magnum opus and a timeless masterpiece.", "created_utc": "1652590296.0", "edited": "False", "id": "i8nu08p", "is_submitter": "False", "link_id": "t3_uon5d9", "parent_id": "t1_i8g8txw", "score": "1", "subreddit": "anime", "subreddit_id": "t5_2qh22"}, {"author": "getsandom", "body": "You might be the very few people I ever found on the internet to actually get the point of the story. People get so chained to the tropes and characters they completely ignore all the wonderful subtext the author brings to the table for discussion on basically what is reality and does it matter if its artificial.", "created_utc": "1652589486.0", "edited": "False", "id": "i8nspse", "is_submitter": "False", "link_id": "t3_uoyzo3", "parent_id": "t1_i8hxnph", "score": "2", "subreddit": "anime", "subreddit_id": "t5_2qh22"}, {"author": "getsandom", "body": "I watched but didn't think much of it as a show per se, is background noise at best, what I like is the fact that it exists, outside of actual hentai is one of a few titles that proves that animation can accept anything and anime is not shy of trying the ridiculous and the inappropriate, different from what American animation seems to think, as in if is made of drawings it should be for kids.", "created_utc": "1652588912.0", "edited": "False", "id": "i8nrsu7", "is_submitter": "False", "link_id": "t3_up2zzt", "parent_id": "t3_up2zzt", "score": "2", "subreddit": "anime", "subreddit_id": "t5_2qh22"}, {"author": "getsandom", "body": "I liked Simoun, specially the art style, but I do agree with you. I never read the original material (manga) but heard that is really short, like a one-shot volume short, and focus almost exclusively in the relationships. Most of the story told in the anime was written for it which is certainly the origin of the inconsistencies in quality.", "created_utc": "1652587870.0", "edited": "False", "id": "i8nq4hb", "is_submitter": "False", "link_id": "t3_upeukn", "parent_id": "t1_i8kfbgj", "score": "1", "subreddit": "anime", "subreddit_id": "t5_2qh22"}, {"author": "getsandom", "body": "That's only strictly true if you look outside Japan, many games that turn into anime get there for being popular in Japan. The thing is that the way those games play, mostly through dialog trees, is not popular almost at all outside Japan. They use this kind of mechanic because make making games from a premade \"framework\" really easy and usually use the storytelling as the selling point.\n\nIn the west  in contrast, outside retro/indie games, we expect close to real animations and interactions on top of a good enough story so the play style of most visual novels look immensely boring in contrast no matter the quality of the story being told.", "created_utc": "1652587278.0", "edited": "False", "id": "i8np4xa", "is_submitter": "False", "link_id": "t3_uph7ih", "parent_id": "t3_uph7ih", "score": "1", "subreddit": "anime", "subreddit_id": "t5_2qh22"}, {"author": "getsandom", "body": "Ocean Waves is a tiny bit less \"cartoony\" but if you look past the caricature they normally make of older characters Ghibli keep humans minimally stylized in general, also Ghibli don't use the bright hair colors most anime do as rule even in fantasy/fiction, San from Mononoke has brown hair and Nausicaa's and Arrietty's are a reasonably realistic red.", "created_utc": "1652586066.0", "edited": "False", "id": "i8nn3im", "is_submitter": "False", "link_id": "t3_upqv0x", "parent_id": "t3_upqv0x", "score": "1", "subreddit": "anime", "subreddit_id": "t5_2qh22"}, {"author": "getsandom", "body": "For someone who is getting on in years I do have a pretty good memory but after almost 1600 shows/seasons I'd say there are some 10% I only remember that I have watched and nothing else, about half of the rest I remember what the show was about and the main characters but no details like that of the overarching or any particular episode story. Out of curiosity I had a glance at my list and a there were a few the didn't ring any bells like Caligula, Fantasista Doll, Galilei Donna, Himegoto...", "created_utc": "1652413452.0", "edited": "False", "id": "i8eqob6", "is_submitter": "False", "link_id": "t3_uo9cf1", "parent_id": "t3_uo9cf1", "score": "1", "subreddit": "anime", "subreddit_id": "t5_2qh22"}, {"author": "getsandom", "body": "First, something I seem to tell a lot, I'm 40 and didn't get into anime until I was almost 30. I've seem a few people get caught up with the fact they are liking something they believe was \"made for the young\", my recommendation is try as hard as you can to get out of this mind frame. Different from American animation which was basically tied to kids with a chain by Disney, anime can and often do have the whole range of stories to tell and even those that ARE directed to children don't treat them as mentally less capable. \n\nAbout SAO, I'm sure you got that from the other comments already but it is a highly divisive title. Most people like it but the ones who dislike tend to have an almost hatred towards it. I for one like it a lot but for reasons different from most people. I do like the story being told and the characters even when they get \"cliche'ed\" but for me is more about the underlying text, on the tech and how the author sees it implemented, the way he imagines the impact on society with full dive VR an true AI, etc. There is a lot of depth to it if you get past the \"it's an anime\" layer but people and specially the detractors seem to get hanged on the tropes.\n\nAs for recommendations, if you fancy something a bit more seriously executed, Mushoku Tensei is a recent favorite mine and of the community, more on the true fantasy vein, not really ominous as you requested, but excellent in my opinion.", "created_utc": "1652328023.0", "edited": "False", "id": "i89zrsh", "is_submitter": "False", "link_id": "t3_un1xdi", "parent_id": "t3_un1xdi", "score": "1", "subreddit": "anime", "subreddit_id": "t5_2qh22"}, {"author": "getsandom", "body": "There are quite a few titles I'd like a remaster, as in refine the animation, tweak the character design and bring it to modern standards and make it high resolution.\n\nThere are quite a few less I'd change anything, I'm not that much of a manga/novel reader so I usually don't have the proper grasp of the source material to be able to tell if remaking would improve anything, that said, one less know title I'd love to see adapted to it's full potential would be Birdy the Mighty, the anime is not bad by any means in my opinion but the manga is amazing. \n\nI've seem quite a few people commenting about Soul Eater, of the bigger ones its one I agree they dropped the ball on the latter part, quality wise I'd say a \"fresh coat of paint\" would do, but following the manga closer would do wonders for the story.", "created_utc": "1652325725.0", "edited": "False", "id": "i89vgk6", "is_submitter": "False", "link_id": "t3_un27uz", "parent_id": "t3_un27uz", "score": "1", "subreddit": "anime", "subreddit_id": "t5_2qh22"}, {"author": "getsandom", "body": "They are both sci-fi, there is no fantasy in Nausicaa, just a bit of folklore. As for what you should read, I'm a huge fan of both but I like Nausicaa just the tiniest bit better so I'd recommend getting both if you can afford the time and the purchase but if I were you I'd get Nausicaa first.", "created_utc": "1652239976.0", "edited": "False", "id": "i852fkx", "is_submitter": "False", "link_id": "t3_umw7p7", "parent_id": "t1_i84a6at", "score": "2", "subreddit": "manga", "subreddit_id": "t5_2ql0i"}, {"author": "getsandom", "body": "The anime adaptation (as per usual) doesn't go as deep as the manga as for how much was adapted I cannot be sure it's been quite a while since I watched and read, but by what little I remember if you think the show was good you be blown away by the manga.\n\nA little correction on my reading, to show how fuzzy my memory is, I read up to chapter 135, the manga is divided in 3 series:\n\nA oneshot volume with 7 chapters, I think the original OVAs from 1996 where based on that.\n\nThe main series which is 20 volumes 218 chapters, the 2 season anime comes from here but as I said I can't remember where the adaptation ends, I did a quick search but it wasn't too enlightening either.\n\nThen there is the Evolution series which is 77 chapters, so you could say the even if they compressed the story for the anime they still didn't adapt all that was available since Evolution came out after the anime had aired.", "created_utc": "1652155723.0", "edited": "False", "id": "i80eoh7", "is_submitter": "False", "link_id": "t3_ulztnw", "parent_id": "t1_i803s9w", "score": "1", "subreddit": "anime", "subreddit_id": "t5_2qh22"}, {"author": "getsandom", "body": "The most curious thing is, while SAO has a huge hand in the current \"isekai epidemic\", technically SAO itself is not isekai as the characters never left their original world.", "created_utc": "1652151412.0", "edited": "False", "id": "i806ay0", "is_submitter": "False", "link_id": "t3_um69dq", "parent_id": "t1_i804dna", "score": "2", "subreddit": "anime", "subreddit_id": "t5_2qh22"}, {"author": "getsandom", "body": "Birdy is one of my favorites, severely underrated in my opinion. I watched the anime and read the manga up to chapter 235.", "created_utc": "1652149912.0", "edited": "False", "id": "i8037hw", "is_submitter": "False", "link_id": "t3_ulztnw", "parent_id": "t3_ulztnw", "score": "2", "subreddit": "anime", "subreddit_id": "t5_2qh22"}, {"author": "getsandom", "body": "A lot of people who criticize SAO seem to get hanged on the tropes and seem uncapable of looking past them. For me besides the story, which for all it's flaws is not bad, is the background the author built that keep getting me back, the ideas about how the tech is supposed to work, the influence something like the Nervegear could have if it was made possible in short timeframe (I don't see it done in the next 40 years), the philosophical and ethical implications of a true full dive experience and true AI. There is a lot below the surface of SAO to make you think if you stop being annoyed at it being an anime.", "created_utc": "1652146370.0", "edited": "False", "id": "i7zvcbq", "is_submitter": "False", "link_id": "t3_um69dq", "parent_id": "t3_um69dq", "score": "1", "subreddit": "anime", "subreddit_id": "t5_2qh22"}, {"author": "getsandom", "body": "Does the title have to be in English too? \n\nI'm particularly fond of Kiri from Monoral the OP of Ergo Proxy, \"kiri\" means \"fog\" in Japanese but the song itself has the whole lyrics in English.", "created_utc": "1652072822.0", "edited": "False", "id": "i7vw8pu", "is_submitter": "False", "link_id": "t3_ukzd5r", "parent_id": "t3_ukzd5r", "score": "1", "subreddit": "anime", "subreddit_id": "t5_2qh22"}, {"author": "getsandom", "body": "I do keep a (longish) list of 15\\~25 shows (mostly older stuff) I watch in the background a couple of episodes at a time but it's been some 7\\~8 years since I last time I've tried to watch a show that was on air, so to me every \"main\" watch is a binge. As for what I watched in the last few weeks:\n\nQualidea Code\n\nFire Force - Season 1, the second is on the queue but I haven't stared yet\n\nInfinite Dendrogram\n\nOverlord - All the 3 seasons that are already out\n\nSaihate no Paladin\n\nCop Craft", "created_utc": "1652071908.0", "edited": "False", "id": "i7vuw1n", "is_submitter": "False", "link_id": "t3_ul5y1d", "parent_id": "t3_ul5y1d", "score": "1", "subreddit": "anime", "subreddit_id": "t5_2qh22"}, {"author": "getsandom", "body": "I gone through almost 1600 shows/seasons and none of the \"big 3\" ever even crossed my mind when choosing what to watch.\n\nYou should never few obligated to watch anything. I watch anime to enjoy, not to \"check a box on my list\" or \"to get into the conversation\", if you don't feel like watching just skip, there are literally thousands of titles and even if you dedicated all day every day it would take you a long while to run out of content.", "created_utc": "1652070180.0", "edited": "False", "id": "i7vs7r0", "is_submitter": "False", "link_id": "t3_ul9zmh", "parent_id": "t3_ul9zmh", "score": "1", "subreddit": "anime", "subreddit_id": "t5_2qh22"}, {"author": "getsandom", "body": "If you are not hanged on genre 100 is barely a scratch to the surface, I'm on the way to 1600 shows/seasons 19000+ episodes and always run out of time instead of content. \n\nIf you use a list site you might being hanged-up on the scores too much, I use Anime-Planet and the show pages have various stats right together with the use score. The first one I look is the proportion of watched to dropped, in my experience a show that have a just above average score but most people finish is usually more enjoyable than a show that a lot people can't get to the end even if the score is high.\n\nAlso Anime-Plane is centered on recommendations so you might give it a try.", "created_utc": "1651988883.0", "edited": "False", "id": "i7rmpbo", "is_submitter": "False", "link_id": "t3_ukhswa", "parent_id": "t3_ukhswa", "score": "1", "subreddit": "anime", "subreddit_id": "t5_2qh22"}, {"author": "getsandom", "body": "I use a LG C1 48\", both to watch stuff on and as my PC monitor as it can do variable refresh rate which is great for gaming, so far I had no regrets on the buy. There are a few things that could be better if you use it attached to a PC like I do but as a TV is great.", "created_utc": "1651987567.0", "edited": "1651987815.0", "id": "i7rkuk5", "is_submitter": "False", "link_id": "t3_uklg59", "parent_id": "t1_i7qgzuo", "score": "1", "subreddit": "anime", "subreddit_id": "t5_2qh22"}, {"author": "getsandom", "body": "I'm not much into rewatching but I usually have a \"background list\" usually of older stuff I slowly go through as a \"wind down\" after half a dozen or so episodes of whatever I might be concentrating at the moment as I almost always binge the shows after they finished airing.\n\nMy backlist is not all \"light\" stuff but most stuff I've been meaning to watch and didn't pick up right when it finished or stuff from before I got into anime so if I had to pick one to be my current go to when I just want to turn my brain off and watch would be Ranma ½.", "created_utc": "1651987233.0", "edited": "False", "id": "i7rkcmu", "is_submitter": "False", "link_id": "t3_ukmefb", "parent_id": "t3_ukmefb", "score": "1", "subreddit": "anime", "subreddit_id": "t5_2qh22"}, {"author": "getsandom", "body": "I told this story a couple of times already, I'm kind of an odd case when it comes to anime. \n\nHere in Brazil we got a couple of big names like Dragonball, Saint Seya, Inuyasha, etc. on airwave TV back in 1990s but I almost actively avoided anime as teen. I got into it way older than most people here in the sub are now.\n\nAnimation, specially 2d, has the capacity of telling stories in a way live action can't, the thing that got me hooked was that anime achieves just that to a large extent instead of being content to distract kids like most American animation in the last 20 or so years.\n\nThe first anime I remember picking up from start to finish was Cardcaptor Sakura back in maybe 2009, from there on and off I've being through many thousands of episodes.", "created_utc": "1651986555.0", "edited": "False", "id": "i7rjbbb", "is_submitter": "False", "link_id": "t3_ukmgci", "parent_id": "t3_ukmgci", "score": "2", "subreddit": "anime", "subreddit_id": "t5_2qh22"}, {"author": "getsandom", "body": "There are very few anime for which I read the original work, of the top of my head xxxHolic and Tsubasa Chronicles, Chobits, Soul Eater, SAO, and Zero no Tsukaima.\n\nI do read manga/novels on occasion but most I just the anime.", "created_utc": "1651982674.0", "edited": "False", "id": "i7rcoez", "is_submitter": "False", "link_id": "t3_ukr6zj", "parent_id": "t3_ukr6zj", "score": "2", "subreddit": "anime", "subreddit_id": "t5_2qh22"}, {"author": "getsandom", "body": "I was quite the avid reader when younger to the point of going through 157 volumes in a single year once but always steered away from anything by Eça de Queiroz, it might not be available in English though since the author is Portuguese and from XIX century but he's the only author ever I picked a book and didn't finish.\n\nI'm from Brazil and we got both Brazilian and Portuguese literature back when I was at school and different from most people I quite liked a lot of the classics. Eça de Queiroz is considered one of the greatest Portuguese authors but never sat well with me...", "created_utc": "1651964387.0", "edited": "False", "id": "i7qe2bv", "is_submitter": "False", "link_id": "t3_uke1gi", "parent_id": "t3_uke1gi", "score": "1", "subreddit": "suggestmeabook", "subreddit_id": "t5_31t41"}, {"author": "getsandom", "body": "By now I watched so much anime that picking even a top 5 is hard but there are a few I can pull up from the top of my mind. \n\nMy most recent favorite would be My Dress-Up Darling, that one surprised me in the best of ways specially the the voice acting for Marin, that kind of character is so easy to get wrong but the job done by the VA was amazing doing justice to the \"feel\" of the story.\n\nI'm generally not much for rewatching shows/movies but there are a few I go back to occasionally, Yurucamp and Non Non Biyori are just the fluffy comfy warm stuff to wind the day down.\n\nThere are a couple of the Ghibli movies I keep coming back to, not the ones everybody seems to like best tough, I watched Nausicaa of the Valley of the Wind 20+ times, to me is Miyazaki's masterpiece when you couple it with the manga, Whisper of the Heart and From Up on Poppy Hill are not far in watch count. But the one that left most impressed was Grave of the Fireflies, everyone should watch it at least once but its the only ever piece of any media a swore I won't touch again.", "created_utc": "1651893782.0", "edited": "False", "id": "i7mxh4e", "is_submitter": "False", "link_id": "t3_ujyx06", "parent_id": "t3_ujyx06", "score": "1", "subreddit": "anime", "subreddit_id": "t5_2qh22"}, {"author": "getsandom", "body": "None whatsoever, I'm probably older than 90% of the people in the sub so I have a bit more life behind me to give me perspective and one thing I know is that it takes more than will to run a business and  my complete lack of business acumen. I wasn't even in a proper business but I was self-employed  for 4 years and barely scrapping by. Now 15 years later as a fully employed senior software developer I make the equivalent of 5x what I did back then with all the benefits that come with someone else having to worry from were the money comes.", "created_utc": "1651892463.0", "edited": "False", "id": "i7mv2d7", "is_submitter": "False", "link_id": "t3_ujzhkp", "parent_id": "t3_ujzhkp", "score": "1", "subreddit": "anime", "subreddit_id": "t5_2qh22"}, {"author": "getsandom", "body": "One I watched recently and even recommended a couple of times in the sub would be Cop Craft.", "created_utc": "1651891596.0", "edited": "False", "id": "i7mtfco", "is_submitter": "False", "link_id": "t3_uk2lhf", "parent_id": "t3_uk2lhf", "score": "1", "subreddit": "anime", "subreddit_id": "t5_2qh22"}, {"author": "getsandom", "body": "MPC-HC ainda existe e é mantido e atualizado, não tem porque não usar. Ele já vem empacotado com os codecs no K-Lite, basicamente pacote pronto pra qualquer tipo de combinação de audio/video/container/legenda.", "created_utc": "1651887909.0", "edited": "False", "id": "i7mm8yt", "is_submitter": "False", "link_id": "t3_ujzuyl", "parent_id": "t1_i7mi2cx", "score": "5", "subreddit": "brasil", "subreddit_id": "t5_2qh9i"}, {"author": "getsandom", "body": "If you discount individual experiences, I would put it down to a couple of points:\n\nAnimation in general and 2D animation in particular can express things visually in a way is not possible with live action even with all the tech we have now with CG. Live action as a media causes one to have expectations that cannot be surpassed by \"suspension of disbelief\" while animation does just that.\n\nAnime in particular uses animation to its full storytelling potential by not limiting itself to \"for kids\" content like American animation which was basically tied by the ankle to kids by the influence of Disney, you can literally find content from toddler educational to porn with everything in between in anime. Anime manages all that without (generally) falling in the pitfalls of the European animation which in my opinion can and often is \"artsy\" for the sake of it instead of artful for the sake of the story being told.", "created_utc": "1651808497.0", "edited": "False", "id": "i7ih70v", "is_submitter": "False", "link_id": "t3_uixmlp", "parent_id": "t3_uixmlp", "score": "1", "subreddit": "anime", "subreddit_id": "t5_2qh22"}, {"author": "getsandom", "body": "As songs go, the OP of Soul Eater (Papermoon by Tommy Heavenly6) got me to have a second look at Japanese music in general to the point  have a few of singers/bands/groups among my favorites regardless of anime status.\n\nAnimation-wise I don't watch the OPs an EDs much so if I had to choose one I remember well it would be Katanagatari. Windows 7 had this awesome feature called Dreamscape that allowed you to use a video as your desktop background, I used the Katanagatari OP for a while because I loved the art style of the series in general.", "created_utc": "1651725574.0", "edited": "False", "id": "i7e035c", "is_submitter": "False", "link_id": "t3_uil3dp", "parent_id": "t3_uil3dp", "score": "2", "subreddit": "anime", "subreddit_id": "t5_2qh22"}, {"author": "getsandom", "body": "I usually don't watch the OPs an EDs more that a couple of times for a given series but I find myself liking the endings a whole lot more than openings, specially the songs.", "created_utc": "1651724700.0", "edited": "False", "id": "i7dymss", "is_submitter": "False", "link_id": "t3_uila3l", "parent_id": "t3_uila3l", "score": "3", "subreddit": "anime", "subreddit_id": "t5_2qh22"}, {"author": "getsandom", "body": "I cannot say that for other languages, I'm from Brazil and the very few PT-BR dubs tend to be OK, the Brazilian version of Cardcaptor Sakura for example kept the whole context of the characters polemic relationships for example, but anyone who knows about the butchering of the localization of Nausicaa of the Valley of the Wind should know to stay away from American dubbing.\n\nFrom what little I watched besides how amateurish it sounds compared to the original, it seems the American localizers cannot be content to do work they are paid to do and have always a secondary agenda, in the 1990's was the \"sanitization\" of content they deemed \"inappropriate\", nowadays it seems cultural politics keep seeping in were it shouldn't so I just avoid it. For me with how much anime I watched even subs are just a crutch for when the dialog gets to fast or \"jargon-ey\" anyway so I have no reason to watch dubs at all.", "created_utc": "1651724450.0", "edited": "False", "id": "i7dy6w3", "is_submitter": "False", "link_id": "t3_uio06q", "parent_id": "t3_uio06q", "score": "2", "subreddit": "anime", "subreddit_id": "t5_2qh22"}, {"author": "getsandom", "body": "If Brazilian military wasn't all right wing Brazil would be something between Cuba and Russia now.", "created_utc": "1651721651.0", "edited": "False", "id": "i7dszi3", "is_submitter": "False", "link_id": "t3_ui4eai", "parent_id": "t1_i7bd6ma", "score": "-1", "subreddit": "brasil", "subreddit_id": "t5_2qh9i"}, {"author": "getsandom", "body": "Não tem terceira via popular no Brasil. Todos os outros candidatos ou só são conhecidos dentro dos respectivos estados ou não tem apoio popular quase nenhum, no caso de João Dória (governador do estado de São Paulo) por exemplo é os dois casos, desconhecido fora do estado e impopular dentro. Infelizmente os poucos brasileiros que não são cordeirinhos devotos de um dos dois estão sem opção, a maioria dos brasileiros é simplesmente ignorante e trata politico como uma mistura de ídolo de futebol e santo.", "created_utc": "1651720939.0", "edited": "False", "id": "i7drme3", "is_submitter": "False", "link_id": "t3_ui4eai", "parent_id": "t1_i7c76xc", "score": "2", "subreddit": "brasil", "subreddit_id": "t5_2qh9i"}, {"author": "getsandom", "body": "He is a socialist of the worst order, his only as \"soft\" as he is because the Brazilian military is all right wing. His government saw to the creation of the BRICS block and turn China in Brazil's largest commercial partner.", "created_utc": "1651720004.0", "edited": "False", "id": "i7dpsdz", "is_submitter": "False", "link_id": "t3_ui4eai", "parent_id": "t1_i7cx4bi", "score": "0", "subreddit": "brasil", "subreddit_id": "t5_2qh9i"}, {"author": "getsandom", "body": "Technical quality aside, I liked Ergo Proxy a lot better.\n\nNot the Elfen Lied is bad per se but is executed more like a slasher movie, gore and shock over story.", "created_utc": "1651635417.0", "edited": "False", "id": "i78zkk9", "is_submitter": "False", "link_id": "t3_uhdudj", "parent_id": "t3_uhdudj", "score": "1", "subreddit": "anime", "subreddit_id": "t5_2qh22"}, {"author": "getsandom", "body": "I'm 40 and almost actively avoided anime until I was 27\\~28, I'm now 19000+ episodes in and counting.\n\nIt's never to late to watch something you enjoy. Also you should never fell pressured to finish something because is popular, I either dropped or didn't care to look at a lot of the \"everyone knows is anime\" titles because they are not my thing.", "created_utc": "1651634810.0", "edited": "False", "id": "i78ydia", "is_submitter": "False", "link_id": "t3_uhgfuq", "parent_id": "t3_uhgfuq", "score": "1", "subreddit": "anime", "subreddit_id": "t5_2qh22"}, {"author": "getsandom", "body": "I used to keep up with a few series that were on air when I started getting into anime (some 10+ years ago) but now even if it is a series that is both getting a good buzz from the community and picked my interest I'll wait to binge when it is completed.\n\nWhen I was young(er), before internet was a thing in every home and I read a lot more books, since I'm a very fast reader if I got a good book I would go through it in a few hours. I guess old habits are hard to kill.", "created_utc": "1651633132.0", "edited": "False", "id": "i78ux8w", "is_submitter": "False", "link_id": "t3_uhme47", "parent_id": "t3_uhme47", "score": "1", "subreddit": "anime", "subreddit_id": "t5_2qh22"}, {"author": "getsandom", "body": "The only ones you got on that vein in my opinion would be the cartoony ones directed at selling toys/games to kids like Pokemon and Beyblade and the \"big 3\" One Piece, Naruto and Dragonball. Depending if there is some \"current big name\" like AOT you might be able to get away with it. Most everything else is going to be either unknown or \"stereotypified\" in the eyes of people outside the community.", "created_utc": "1651460245.0", "edited": "False", "id": "i6zfmwi", "is_submitter": "False", "link_id": "t3_ug3jlv", "parent_id": "t3_ug3jlv", "score": "2", "subreddit": "anime", "subreddit_id": "t5_2qh22"}, {"author": "getsandom", "body": ">\\[Whisper of the Heart\\]>!The violin scene is probably my favorite animated scene ever!<", "created_utc": "1651459159.0", "edited": "False", "id": "i6zdmf4", "is_submitter": "False", "link_id": "t3_ug6jrp", "parent_id": "t1_i6xtnvt", "score": "2", "subreddit": "anime", "subreddit_id": "t5_2qh22"}, {"author": "getsandom", "body": "I'm not the nostalgic type, I usually don't form those \"fond memories\" people use their \"rose tinted glasses\" to describe so I usually don't rewatch anime unless I have no access to new content at all and still Nausicaa is by far the anime I watched most times (20+ for sure). \n\nNausicaa as a whole is Miyazaki's masterpiece, the movie does hold it's own despite being almost as old as I am but if you are going to appreciate it to it's fullest you owe yourself to read the manga after watching it. The release from the time constraint for a movie that the manga brings pull forward the best in Miyazaki's art and storytelling.", "created_utc": "1651458988.0", "edited": "False", "id": "i6zdaov", "is_submitter": "False", "link_id": "t3_ug6jrp", "parent_id": "t3_ug6jrp", "score": "1", "subreddit": "anime", "subreddit_id": "t5_2qh22"}, {"author": "getsandom", "body": "Besides my customary background list I got through the 3 available seasons of Overlord and the first one of Fire Force and Infinite Dendrogram. \n\nI did finish a couple shows that were stuck in my list of stalled forever, both were less than a third remaining to finish so I pick then back up: Sankarea and Mikagura School Suite.", "created_utc": "1651458339.0", "edited": "False", "id": "i6zc1w7", "is_submitter": "False", "link_id": "t3_ug6rco", "parent_id": "t3_ug6rco", "score": "2", "subreddit": "anime", "subreddit_id": "t5_2qh22"}, {"author": "getsandom", "body": "That kind of sketch with color outlines is basic to any style of anime regardless of the final product and not representative of a change in plans for the style. It's usually the step after the raw outline and before the flat coloring and is used as a guide to apply the color pallet chosen for the show.", "created_utc": "1651376941.0", "edited": "False", "id": "i6v973p", "is_submitter": "False", "link_id": "t3_uf99u4", "parent_id": "t3_uf99u4", "score": "2", "subreddit": "anime", "subreddit_id": "t5_2qh22"}, {"author": "getsandom", "body": "The first thing the comes to mind at least to me that may make people not even consider a show for the looks of it is that when a show has an art style \"way out there\" is it might be trying to hard to be artsy and different and that could be in detriment of the story.", "created_utc": "1651376572.0", "edited": "False", "id": "i6v8luq", "is_submitter": "False", "link_id": "t3_uffw8y", "parent_id": "t3_uffw8y", "score": "1", "subreddit": "anime", "subreddit_id": "t5_2qh22"}, {"author": "getsandom", "body": "My first contact with \"source material\" I'd say would be the novel for Zero no Tsukaima.\n\nI'm a huge fan of CLAMP so I read a lot of the mangas from shows like Tsubasa Chronicle, xxxHolic, Magic Knight Rayearth.\n\nI have the Sword Art Online novels, I was kind of getting seriously into anime at the time the first season came around and just happened to have a pair of coworkers who were fans of SAO as well. Despite the (sometimes warranted) criticisms I love the way the authors mind seams to work in regards to the tech and the philosophical/ethical aspects of the level of simulation and AI, more so than the story itself which in my opinion it's not bad.", "created_utc": "1651294495.0", "edited": "False", "id": "i6r9pld", "is_submitter": "False", "link_id": "t3_ueit6n", "parent_id": "t3_ueit6n", "score": "2", "subreddit": "anime", "subreddit_id": "t5_2qh22"}, {"author": "getsandom", "body": "The average user expects an action in a computer to, at the bare minimum, give some feedback after 750ms.\n\nAnything the developer know that can take more than that 3/4 of a second should always include a progress indicator.\n\nBeing a dev myself it is one of the first things I think when doing long running processes the user interacts directly like a web search with a potential for a lot of results.\n\nEdit: compared what I suspect is the average age of people around this sub, at 40, I'm old too but I still expect proper UI/UX on the things I use, specially when I make the effort in my own work.", "created_utc": "1651292987.0", "edited": "1651293341.0", "id": "i6r7f2g", "is_submitter": "False", "link_id": "t3_uetpbs", "parent_id": "t1_i6piwsw", "score": "1", "subreddit": "anime", "subreddit_id": "t5_2qh22"}, {"author": "getsandom", "body": "I do too, being using it for 10 years now. I like the layout, the \"episode management\" is really easy with the widget basically everywhere the show title appears, the search functionality is epic and I like the fact that the main purpose of the site is recommendations.", "created_utc": "1651292666.0", "edited": "False", "id": "i6r6x60", "is_submitter": "False", "link_id": "t3_uetpbs", "parent_id": "t1_i6ptvqq", "score": "1", "subreddit": "anime", "subreddit_id": "t5_2qh22"}, {"author": "getsandom", "body": "One thing I think happens a lot in fandoms in general but is quite intense in anime at least in my perception is that people seem to be into it to be astonished instead of entertained and some people seam to revel in the fact they can almost never be satisfied.", "created_utc": "1651291667.0", "edited": "False", "id": "i6r5bk1", "is_submitter": "False", "link_id": "t3_ueyb3c", "parent_id": "t3_ueyb3c", "score": "1", "subreddit": "anime", "subreddit_id": "t5_2qh22"}, {"author": "getsandom", "body": "I use Anime-Planet, but here are my 2 cents anyway.\n\nIf you take away things I used as background noise while doing other things I'd say Only Yesterday (Omohide Poro Poro) which got the equivalent of a 5/10 from me, which is to show not everything Ghibli makes is an instant masterpiece, the movie is such a bore the first time I tried to watch I didn't get to the end, and the time I got to the end I regreted wasting the time even coming from mostly the same people who made Nausicaa of the Valley of the Wind which I literally don't know how many times I watched (20+ at least for sure). And that's not to say Ghibli can't make slice of life, From Up on Poppy Hill is amazing, same with \\[Whisper of the Heart\\]>!The violine scene to me is magic made movie!<, Only Yesterday just droppped the ball hard in comparison.", "created_utc": "1651209914.0", "edited": "False", "id": "i6mrkqh", "is_submitter": "False", "link_id": "t3_ueeelq", "parent_id": "t3_ueeelq", "score": "0", "subreddit": "anime", "subreddit_id": "t5_2qh22"}, {"author": "getsandom", "body": "SAO is not bad, is divisive, people hate it or love it with very little reasonable people in between. I like it enough that is one of very few anime I have the source material as well (novels up to vol.20). \n\nSAO became an absolute phenomenon mainly because the fact that VR was the talk of the day when it came out combined with the availability of anime in the west not being limited anymore to what was licensed for TV because of streaming and that didn't sit well with \"pseudo-hardcore\" anime fans that saw their favorite shows overshadowed by what they saw as \"for the masses\" below average material.\n\nIt doesn't help that SAO also make 2 tropes some people detest very popular, those being isekai and trapped on game, even though SAO itself might not even be isekai depending on your definition.\n\nFor me even if the story itself like most anime have its flaws, it's the discussion about the definition of reality, intelligence and humanity is what keeps me getting back to it, I also like quite a lot the technical aspect of how the author proposes the tech to work.\n\nAll that said, one should always make ones own mind, so if you are curious give it a try and if you don't like it just drop it.", "created_utc": "1651207547.0", "edited": "False", "id": "i6mnxa4", "is_submitter": "False", "link_id": "t3_ue2e6g", "parent_id": "t3_ue2e6g", "score": "1", "subreddit": "anime", "subreddit_id": "t5_2qh22"}, {"author": "getsandom", "body": "Bokutachi no Remake (Remake our Life!) is \"almost\" a slice of life, with the added difference that the characters are already in college which is not that common.", "created_utc": "1651117775.0", "edited": "False", "id": "i6hqu3m", "is_submitter": "False", "link_id": "t3_udgr0w", "parent_id": "t3_udgr0w", "score": "1", "subreddit": "anime", "subreddit_id": "t5_2qh22"}, {"author": "getsandom", "body": "SAO is very polarizing for some reason, I personally like it enough that I own the novels up to volume 20, but as with any art is matter of taste. \n\nFor example, people sing praises high and low to Evangelion, I couldn't bear 5 episodes of it, Attack on Titan is another that didn't make for me I watched a season and while I don't think is bad I just couldn't care enough to continue.\n\nMy point is, don't use peoples opinions as a deciding factor, if you are curious give it a try and don't fell bad to drop if it's not for you.", "created_utc": "1651117262.0", "edited": "False", "id": "i6hpt24", "is_submitter": "False", "link_id": "t3_udh5bs", "parent_id": "t3_udh5bs", "score": "2", "subreddit": "anime", "subreddit_id": "t5_2qh22"}, {"author": "getsandom", "body": "People give flak to SAO for various (some reasonable) reasons but that discussion it brought about the philosophy and technology is what mainly keep getting me back to it.", "created_utc": "1651031386.0", "edited": "False", "id": "i6cxml4", "is_submitter": "False", "link_id": "t3_ucu8ke", "parent_id": "t1_i6cwobn", "score": "2", "subreddit": "anime", "subreddit_id": "t5_2qh22"}, {"author": "getsandom", "body": "That's quite a philosophical question since technically they never \"disappeared\" from their original world...", "created_utc": "1651030965.0", "edited": "False", "id": "i6cwu13", "is_submitter": "False", "link_id": "t3_ucu8ke", "parent_id": "t1_i6cw4vs", "score": "2", "subreddit": "anime", "subreddit_id": "t5_2qh22"}, {"author": "getsandom", "body": "Magic Knight Rayearth, right when I started to get into anime. I'm quite a fan of the CLAMP work that are adapted from their manga and how they subtly tie together in a multiverse of sorts. I actually have the Rayearth manga, is one o very few I have in physical form.", "created_utc": "1651030798.0", "edited": "False", "id": "i6cwi8y", "is_submitter": "False", "link_id": "t3_ucu8ke", "parent_id": "t3_ucu8ke", "score": "7", "subreddit": "anime", "subreddit_id": "t5_2qh22"}, {"author": "getsandom", "body": "The Monogatari series might be well known in the anime community but it is very niche, not a widespread phenomenon like SAO and AOT outside already anime viewers", "created_utc": "1650950161.0", "edited": "False", "id": "i68b5ds", "is_submitter": "False", "link_id": "t3_ubihhp", "parent_id": "t1_i64cd0v", "score": "0", "subreddit": "anime", "subreddit_id": "t5_2qh22"}, {"author": "getsandom", "body": "Here are a few varied ones I liked that not many people have watched:\n\nOtome Youkai Zakuro\n\nShangri-La\n\nCop Craft\n\nGirls' Last Tour\n\nJinrui wa Suitai Shimashita (Humanity Has Declined)\n\nIkoku Meiro no Croisee (Croisee in a Foreign Labyrinth)\n\nTetsuwan Birdy: Decode (Birdy the Mighty: Decode)\n\nNatsu no Arashi!\n\nRide Back\n\nShion no Ou\n\nDennou Coil\n\nMy taste is quite eclectic so there is a little of everything there.", "created_utc": "1650949268.0", "edited": "False", "id": "i689rmw", "is_submitter": "False", "link_id": "t3_ubqx30", "parent_id": "t3_ubqx30", "score": "1", "subreddit": "anime", "subreddit_id": "t5_2qh22"}, {"author": "getsandom", "body": "I was telling this in another thread, I'm a odd one in this regard.\n\nWhen I was a kid in the 1980's\\~90's I almost avoided anime on purpose. I'm from Brazil and then, basically before the word anime was a thing outside Japan, we had a few of the \"classics\" like Dragonball, Saint Seya, Yu Yu Hakusho and the like but they never caught my eye (still don't).\n\nIt wasn't until I was 27\\~28 (I'm 40 now) that I actually started to pay attention to anime, the first series I watched start to finish was Cardcaptor Sakura, just the first 70 of thousands of episodes.", "created_utc": "1650948232.0", "edited": "False", "id": "i6883by", "is_submitter": "False", "link_id": "t3_ubsotv", "parent_id": "t3_ubsotv", "score": "1", "subreddit": "anime", "subreddit_id": "t5_2qh22"}, {"author": "getsandom", "body": "I've been through 1570+ series/seasons 18900+ episodes so far, I can get about 65% of dialog, up to 90% if it's about more mundane subjects, I did study a little bit grammar and I like languages an linguistic as a subject but I'm quite lazy do dedicate my time to something I might not have daily use so I never got to full comprehension. If I ever get serious with novels I might go back and study for real again.\n\nIn language there are 4 skills you have to master to be fluent: reading, writing, listening/comprehension and speech and Japanese is very peculiar because it's hardest skill to master is one that is the easiest is most languages which is reading because of the mish-mash of writing systems. Comprehension in the other hand is very easy because o how limited the sound catalog of the language is, less than 100 phoneme/vowel combinations in contrast to my native Portuguese which have well over 1800.\n\nIf you are thinking of using anime as a study medium I would recommend against with the exception of training comprehension. I say this to people who think they can use music as a medium as well, music is \"attached to by the hip\" with poetry with lots o liberties and figures mixed in. Anime by it's nature takes liberties with the language that might give you a lot of bad habits at the very least. It's not like it would be if you were to do an immersion period going to Japan to get through daily life without translation help which if you are serious about learning and have the means Id totally recommend after a bit of theory study.\n\nTL;DR no, I'm not fluent and you cannot get fluent without studying.", "created_utc": "1650945334.0", "edited": "1650945793.0", "id": "i68322m", "is_submitter": "False", "link_id": "t3_uby5mz", "parent_id": "t3_uby5mz", "score": "1", "subreddit": "anime", "subreddit_id": "t5_2qh22"}, {"author": "getsandom", "body": "If I had to say, Urasekai Picnic could be a lot better developed, in my opinion you can feel there is a lot that isn't being told and a lot of story potential not being used. Haven't read the novel so I don't know if it is like that in the original or an artifact of the adaptation. I liked the concepts but felt the execution lacking.", "created_utc": "1650943469.0", "edited": "False", "id": "i67zfwj", "is_submitter": "False", "link_id": "t3_uc14et", "parent_id": "t3_uc14et", "score": "21", "subreddit": "anime", "subreddit_id": "t5_2qh22"}, {"author": "getsandom", "body": "My reaction would be a very pleasant surprise, looking from the outside when the show was announced looked like another fan-service title with a bit of a prettier art than typical, not that there is anything wrong with that, but then as the show progressed I got really intrigued by the reaction and reviews.\n\nI don't watch shows that are still airing so I only got to see after the season finished and damn it was good. \n\nWhile Gojou is kind of typical for the scenario, my highest praise to Marin's seyuu, Hina Suguta, the kind of character Marin is is really hard to pull out like she did, it basically walks on razor's edge between the \"cute and bubbly\" and the obnoxious, on a manga while you read you put your own spin on the character, when animated we don't always get that kind of quality.", "created_utc": "1650848721.0", "edited": "False", "id": "i62mek8", "is_submitter": "False", "link_id": "t3_ub3n00", "parent_id": "t3_ub3n00", "score": "1", "subreddit": "anime", "subreddit_id": "t5_2qh22"}, {"author": "getsandom", "body": "I use [Anime-Planet](https://www.anime-planet.com) instead of MAL, AniList or any of the other list sites for the specific reason the site main purpose is recommendations.\n\nAny show page will have a list of others shows recommended by the community. Your profile page will also have both a recommendation list based on what your watched as well as a list of related shows/movies/OVAs you haven't marked yet.\n\nAlso even if you don't follow the recommendations, making a site-wide search is really easy using the filter system, you can find a title based on almost any metadata like tags, year/season, studio, rating, number of episodes and more.", "created_utc": "1650845089.0", "edited": "False", "id": "i62elgk", "is_submitter": "False", "link_id": "t3_ub58ab", "parent_id": "t3_ub58ab", "score": "1", "subreddit": "anime", "subreddit_id": "t5_2qh22"}, {"author": "getsandom", "body": "I usually avoid \"classics\" and big name ones like Bleach and the like, but I do try the odd one out on occasion. Sports anime are other category I usually skip, so no opinion there.\n\nRight now I'm slowly going through Ranma ½ in the background and despite the obvious 1980's feel is been quite fun. Curiously Urusei Yatsura just wasn't my thing, they have a very similar feel but Urusei Yatsura just didn't hold my attention.\n\nI tried Kodomo no Omocha and Marmalade Boy and they are just not for me, the combination of 90's animation and obvious caricature level shoujo tropes just irked me out of then.\n\nI watched all of the Ojamajo Doremi series and the are quite fun but they are very much kids shows so it's the \"you're rewatching your childhood cartoons\" kind of fun.", "created_utc": "1650774961.0", "edited": "False", "id": "i5ypwd2", "is_submitter": "False", "link_id": "t3_ua8tvg", "parent_id": "t3_ua8tvg", "score": "1", "subreddit": "anime", "subreddit_id": "t5_2qh22"}, {"author": "getsandom", "body": "Ga-Rei: Zero, Shikabane Hime (Corpse Princess) and Shinsekai Yori(From the New World) are a couple of good slasher style (more gore than suspense) ones.", "created_utc": "1650772557.0", "edited": "False", "id": "i5ylrbe", "is_submitter": "False", "link_id": "t3_uaelu4", "parent_id": "t3_uaelu4", "score": "0", "subreddit": "anime", "subreddit_id": "t5_2qh22"}, {"author": "getsandom", "body": "I see a lot of people started as a kid or young, most are actually still young compare to me in my 40's.\n\nMine is curious tale, so here you go:\n\nAs a kid and teen I couldn't give a rat's ass about the scant anime we had access here in Brazil in the 1980's and 90's, things like Saint Seya, Inuyasha, Yu Yu Hakusho, Dragonball, the things that got to TV before the word anime got to the west, were all the rage with the kids and I was basically about the only one not watching.\n\nIt wasn't until I was 27\\~28, I was in the home of a pair of friends , a couple of siblings brother and sister, I was helping them with a router that was giving them grief, the normal kind of thing you ask a friend who is a developer.\n\nAs I was messing about trying different settings we were making small talk and the subject veered to anime, Naruto was the big thing then  but if memory serves there was a Saint Seya rerun going on a the time that go the theme going. I was joking to them on how I knew basically the same about anime as they did about routers and something about that conversation stuck to me.\n\nThe \"classics\" like Dragonball never caught my eye even now, but I remembered being quite intrigued with the few episodes of Cardcaptor Sakura I've seem in passing on TV. Streaming was basically starting in the US and wasn't really a possibility here at the time so, while I don't condone it if you have the means,  downloading fansubs was the way to go then. I remember taking a week to go through the 70 episodes, I was hooked from the start and here we are now 12 years after with 18925 episodes from 1569 series under my belt so to speak.", "created_utc": "1650689237.0", "edited": "False", "id": "i5ucu0s", "is_submitter": "False", "link_id": "t3_u9lilc", "parent_id": "t3_u9lilc", "score": "1", "subreddit": "anime", "subreddit_id": "t5_2qh22"}, {"author": "getsandom", "body": "I use Anime-Planet and the show pages have the watch statistics straight together with the synopsis. The one thing I look first when checking a recommendation is the ratio between watched and dropped, I find it more indicative of an enjoyable show than the score. A show that has a high score but also a high drop count might be good but is usually either very niche or has a lot o fanboying biasing the score.", "created_utc": "1650684846.0", "edited": "False", "id": "i5u5a0e", "is_submitter": "False", "link_id": "t3_u9s1fk", "parent_id": "t3_u9s1fk", "score": "3", "subreddit": "anime", "subreddit_id": "t5_2qh22"}, {"author": "getsandom", "body": "I call what you described about American animation the \"Disney Syndrome\", since Disney's weight on the media both because of American puritanism and for commercial purposes is basically what killed American exploration of animation as a general purpose medium.\n\nAbout anime, the use of animation for mature (in all senses of the word) content is not exclusive to Japan. Europe has a tradition of mature themed animation the difference being it's not an industry in the scale anime is but more experimental, in my opinion sometimes to the point of being artsy as opposed to meaningfully artistic.", "created_utc": "1650596852.0", "edited": "False", "id": "i5pcdvj", "is_submitter": "False", "link_id": "t3_u92d3j", "parent_id": "t1_i5pakx0", "score": "4", "subreddit": "anime", "subreddit_id": "t5_2qh22"}, {"author": "getsandom", "body": "I'm not the \"hang onto things\" kind so I really rarely rewatch anything. The only things I go through every couple of years are a few movies (no points for guessing which ones). In the anime side of things there are a few Ghibli ones I got to from time to time: From Up on Poppy Hill, Whisper of the Heart, Nausicaa of the Valley of the Wind, Laputa: Castle in the Sky, as you can see not even the \"popular/revered\" ones.", "created_utc": "1650595434.0", "edited": "False", "id": "i5p9h5e", "is_submitter": "False", "link_id": "t3_u92thd", "parent_id": "t3_u92thd", "score": "1", "subreddit": "anime", "subreddit_id": "t5_2qh22"}, {"author": "getsandom", "body": "Unless it's obvious that it is a version of the OP or ED in that the story is still ongoing with only the theme playing, I might watch once ot twice but never on every episode.\n\nI never watch anime in the season that it airs as I prefer to binge, depending if it is interesting enough and I have the time I might go through a whole half season (12\\~13 eps.) in one go so watching the OP and ED every time doesn't make sense to me.", "created_utc": "1650594585.0", "edited": "False", "id": "i5p7ogv", "is_submitter": "False", "link_id": "t3_u93pnn", "parent_id": "t3_u93pnn", "score": "1", "subreddit": "anime", "subreddit_id": "t5_2qh22"}, {"author": "getsandom", "body": "Akagami no Shirayuki-hime was quite popular for what I could gauge from the stats", "created_utc": "1650594097.0", "edited": "False", "id": "i5p6n5q", "is_submitter": "False", "link_id": "t3_u8s03e", "parent_id": "t1_i5n2f3x", "score": "2", "subreddit": "anime", "subreddit_id": "t5_2qh22"}, {"author": "getsandom", "body": "One good surprise I watched just last week was Cop Craft, shame besides not being as popular as I think it deserved it was based of a quite short novel (only 6 vols.) so 12 eps. will be all there is to it.", "created_utc": "1650593759.0", "edited": "False", "id": "i5p5w65", "is_submitter": "False", "link_id": "t3_u8s03e", "parent_id": "t3_u8s03e", "score": "1", "subreddit": "anime", "subreddit_id": "t5_2qh22"}, {"author": "getsandom", "body": "I've used Anime-Planet for the last 10 years, basically since I got \"serious\" with anime.\n\nThe things I like are basically:\n\nThe site is essentially based on recommendations, so if you are wanting to find your next watch in my opinion Anime-Planet is the place to go.\n\nIf you are trying to find a show, the filtering is light-years ahead of everywhere else, all kinds o metadata like type, year/season, tags, score, etc. makes easy to filter.\n\nTo me the interface is not as stale as the other sites. Besides the layout the show pages have quite a few useful stats besides score like how many people \"dropped\" the show, I find the dropped/watched ratio is sometimes more indicative of how interesting a show is than the score.\n\nIt's very easy to keep your list since the \"list update widget\" is everywhere the show information is.\n\nThe one thing I'd say is that the data might not be as thorough as other sites, there is no data on episodes for example but that far from essential to me.", "created_utc": "1650592693.0", "edited": "False", "id": "i5p3jyo", "is_submitter": "False", "link_id": "t3_u8trnv", "parent_id": "t3_u8trnv", "score": "2", "subreddit": "anime", "subreddit_id": "t5_2qh22"}, {"author": "getsandom", "body": "I've started watching some 10 years ago but wasn't all anime all the time, even though anime currently occupies 80%+ of my free time I did slow down or stop a couple of times, right now I've been back a year or so on after an almost 3 year \"break\".\n\nMy list on Anime-Planet have some 88 shows \"stalled\" and another 100+ on my \"want to watch\" queue and leaving a series half way for the next shinning thing is something I do it all the time and sometimes even with series I'm seriously into. It took me 3+ years to go back and finish Gosick for example even though was one of my favorite series when I started it.\n\nI don't believe taking a break from something is a \"fault\" you have to correct, **watching anime it's not a project you agreed to finish for someone else, it should always be for your own enjoyment**.\n\nSometime it's worth to do a cleanup as well, I go through my lists from time to time, did it yesterday in fact, to see if what's worth to keep and what to drop and dropping is also something I think some people seriously need to learn.", "created_utc": "1650589806.0", "edited": "False", "id": "i5oxcb4", "is_submitter": "False", "link_id": "t3_u91qte", "parent_id": "t3_u91qte", "score": "1", "subreddit": "anime", "subreddit_id": "t5_2qh22"}, {"author": "getsandom", "body": "Even the novel is not that old (2014 if memory serves), isekai as genre has existed since the 1980's.\n\nIf I had to say, after Magic Knight Rayearth there has being at least one isekai title per year and SAO is the one which triggered the current \"isekai epidemic\".", "created_utc": "1650520842.0", "edited": "False", "id": "i5l205h", "is_submitter": "False", "link_id": "t3_u8fmna", "parent_id": "t3_u8fmna", "score": "2", "subreddit": "anime", "subreddit_id": "t5_2qh22"}, {"author": "getsandom", "body": "I've being kind of in a roll with isekais since I got back into anime seriously about a year ago and so far the best thing I've seen in the genre has to be Mushoku Tensei by very far. Not that others are not enjoyable, I absolutely love the \"turn your brain off and relax\" kind like \"In the Land of Leadale\", but Mushoku Tensei has a combination o fun, interesting and intriguing that it's rare this days.\n\nI've seem a lot of people in the thread echoing OP with Re:Zero, I've seen the first season and the second is in my queue, I'll give it that it manages to keep being interesting despite having to stop to \"wash of the cringe\" on occasion to manage to get to the end, here is hopping season 2 isn't as bipolar mood swinging as the MC and season 1 and still maintain the interesting bits.", "created_utc": "1650518663.0", "edited": "False", "id": "i5kyvar", "is_submitter": "False", "link_id": "t3_u84iz5", "parent_id": "t3_u84iz5", "score": "1", "subreddit": "anime", "subreddit_id": "t5_2qh22"}, {"author": "getsandom", "body": "The thread made curious so I gave a look on Anime-Planet where I keep my lists and Ex-Arm is one o very few series to have a rating that had more people drop it than finish. I make me \\*\\*\\*almost\\*\\*\\* want to watch to see what they messed so bad, the anime has a 1.32/5 rating while the original manga has a 3.43/5.", "created_utc": "1650514055.0", "edited": "1650514469.0", "id": "i5krbsf", "is_submitter": "False", "link_id": "t3_u88zcb", "parent_id": "t1_i5jpj00", "score": "2", "subreddit": "anime", "subreddit_id": "t5_2qh22"}, {"author": "getsandom", "body": "If you cross out the \"typical little girl anime\" like Precure and Jewelpet (some can be good but most are Disney like toy commercials) there are still a few I'd recommend for a younger audience:\n\nFlying Witch is a recent chill one I liked a lot.\n\nAkebi-chan no Sailor Fuku was a surprise this last season.\n\nMaou-jou de Oyasumi was one of the funniest and most original things I watched in a while.\n\nThe are a few older ones I recommend but they might not be easy to find:\n\nKaitou Saint Tail and Mujin Wakusei Survive are a couple favorites.", "created_utc": "1650346919.0", "edited": "False", "id": "i5b4cvo", "is_submitter": "False", "link_id": "t3_u64cs0", "parent_id": "t3_u64cs0", "score": "1", "subreddit": "anime", "subreddit_id": "t5_2qh22"}, {"author": "getsandom", "body": "That's quite far in the story though \\[Zero no Tsukaima\\]>!as far as I remember Tabitha is only revealed as a princess in past the middle of the first season and the details about her mother only really come after the middle of the third season!<", "created_utc": "1650344639.0", "edited": "1650344850.0", "id": "i5b0teh", "is_submitter": "False", "link_id": "t3_u69vit", "parent_id": "t1_i596ygj", "score": "1", "subreddit": "anime", "subreddit_id": "t5_2qh22"}, {"author": "getsandom", "body": "Up to a year ago I took a big break from anime (some 3 years maybe.. I'm not certain), not for any specific reason just had other things going on so I'm kinda catching up with the period in a sort of watching frenzy (2000+ eps. in the last year).\n\nThat said I got a few pleasant surprises from the newer titles that were not news seasons from older shows:\n\nMy Dress-Up Darling and Mushoku Tensei were both extraordinary in their own ways in my opinion.\n\nThere were a few others I watched that caught my eye as well like Akebi-chan no Sailor Fuku and Mieruko-chan.", "created_utc": "1650240008.0", "edited": "False", "id": "i55a96m", "is_submitter": "False", "link_id": "t3_u5w5hy", "parent_id": "t3_u5w5hy", "score": "1", "subreddit": "anime", "subreddit_id": "t5_2qh22"}, {"author": "getsandom", "body": "The less fantasy drama ones from Ghibli like \"When Marnie Was There\" and \"The Wind Rises\" would make a good choice I think. If you feel adventurous \"Grave of the Fireflies\" would sure make the point of separating media (animation) from audience (children), though I think would be kind of heavy handed.", "created_utc": "1650238079.0", "edited": "False", "id": "i5562uv", "is_submitter": "False", "link_id": "t3_u5idif", "parent_id": "t1_i54ryqr", "score": "1", "subreddit": "anime", "subreddit_id": "t5_2qh22"}, {"author": "getsandom", "body": "One that doesn't get into the gore and jump-scare much I consider quite underrated is Jigoku Shoujo. It's a bit long though as there are 3 full seasons (26 eps. each) and a 12 eps. half-season.", "created_utc": "1650219357.0", "edited": "False", "id": "i53z199", "is_submitter": "False", "link_id": "t3_u5gvsh", "parent_id": "t3_u5gvsh", "score": "1", "subreddit": "anime", "subreddit_id": "t5_2qh22"}, {"author": "getsandom", "body": "It's rather hard to pull people out of what I call the \"Disney Syndrome\", people who grew-up with American animation will have this strong feel of \"if it's made of drawings it's for children\". \n\nI would not say to try to convince her about anime itself but to give her a couple of examples that animation=/=children story. Beginning with a series would be heavy-handed so I say choose something that can be a one time and done thing like a movie with a serious story.", "created_utc": "1650218779.0", "edited": "False", "id": "i53xo86", "is_submitter": "False", "link_id": "t3_u5idif", "parent_id": "t3_u5idif", "score": "1", "subreddit": "anime", "subreddit_id": "t5_2qh22"}, {"author": "getsandom", "body": "I use Anime-Planet to keep my lists.\n\nMy \"Want to Watch\" list got some 109 titles currently with another 88 that are \"Stalled\" that I watched at least 2 episodes but didn't drop completely and might go back at some point.", "created_utc": "1650085333.0", "edited": "False", "id": "i4x9lck", "is_submitter": "False", "link_id": "t3_u4nxmv", "parent_id": "t3_u4nxmv", "score": "2", "subreddit": "anime", "subreddit_id": "t5_2qh22"}, {"author": "getsandom", "body": "If you don't mind cutesy to much, there is Hakumei to Mikochi, which is a very 'day-to-day' afair but doesn't have any humans in it.\n\nCentaur no Nayami is another one where the setting is very SoL but the characters are not.", "created_utc": "1650084036.0", "edited": "False", "id": "i4x7gry", "is_submitter": "False", "link_id": "t3_u4okiy", "parent_id": "t3_u4okiy", "score": "2", "subreddit": "anime", "subreddit_id": "t5_2qh22"}, {"author": "getsandom", "body": "I've both watched the anime and read the manga as far as I can remember there are no fillers but it's been a while so I cannot be 100% sure. The manga is not the biggest but still quite lengthy (213 chap. in 19 vol.)  and the show was a full season (24 ep.), a half season (13 ep.) and a couple of specials so I don't think they even got to cover all of it.", "created_utc": "1649987123.0", "edited": "False", "id": "i4s32ti", "is_submitter": "False", "link_id": "t3_u3wjjj", "parent_id": "t3_u3wjjj", "score": "1", "subreddit": "anime", "subreddit_id": "t5_2qh22"}, {"author": "getsandom", "body": "There is very little a actively dislike, I most avoid the \"every one knows its anime\" titles because they are way overhyped but if I had to choose a title people generally think it's amazing but I might not be able to withstand watching to save my life it would be Evangelion, I sincerely tried but couldn't get past 5 episodes of it.", "created_utc": "1649984445.0", "edited": "False", "id": "i4rxc59", "is_submitter": "False", "link_id": "t3_u3rhel", "parent_id": "t3_u3rhel", "score": "1", "subreddit": "anime", "subreddit_id": "t5_2qh22"}, {"author": "getsandom", "body": "In the original Genei wo Kakeru Taiyou (Day Break Illusion) not much for what it means but just for the sound of it.\n\nTranslated would be Unbreakable Machine-Doll (Kikou Shoujo wa Kizutsukanai) I like the sound of it in the original as well but I think the English title is quite nice, I'm Brazilian but the titles generally don't sound as good in Portuguese.", "created_utc": "1649904052.0", "edited": "False", "id": "i4nht7g", "is_submitter": "False", "link_id": "t3_u2klke", "parent_id": "t3_u2klke", "score": "1", "subreddit": "anime", "subreddit_id": "t5_2qh22"}, {"author": "getsandom", "body": "I usually have 2 or 3 \"main watches\" and 15 to 20 series a slowly go through basically as an occasional break from the mains, so at least to me a dozen is nowhere near to much. Also I don't watch anything that is still airing, I rather binge after at least the current season is finished.", "created_utc": "1649903059.0", "edited": "False", "id": "i4nfq1m", "is_submitter": "False", "link_id": "t3_u2o60l", "parent_id": "t3_u2o60l", "score": "1", "subreddit": "anime", "subreddit_id": "t5_2qh22"}, {"author": "getsandom", "body": "Was just commenting about Shangri-La in another thread, is a favorite of mine. In Shangri-La the overgrowth is a result of a try to capture carbon from the atmosphere with trees gone wrong, is not a plot point per se but actually a background for the story to play into. There is a very minor point of a \"carbon credit\" market but it's not story altering in any way.", "created_utc": "1649902239.0", "edited": "False", "id": "i4ndy7c", "is_submitter": "False", "link_id": "t3_u2swai", "parent_id": "t1_i4miidq", "score": "1", "subreddit": "anime", "subreddit_id": "t5_2qh22"}, {"author": "getsandom", "body": "There is a few quite well known series I like so I won't go into those. \n\nIf I had to chose a unique one would be Katanagatari. The art style really catch the eye and I loved the story. It's quite well regarded but not as well know as it should.\n\nOne I watched recently and got to my favorite list almost instantly was Cop Craft, quite a unique mix of American cop show and anime. A shame it was based on a relatively short novel series (6 volumes) I haven't read it yet so I don't know if the show gone through all of it or if there is more to the story, if there is I would love another season. Another thing I liked it's the fact the character design is by Range Murata, I got a couple of his art books, absolutely adore his art.\n\nNot so coincidently another not all that well know favorite of mine is Shangri-La which have character design by Murata as well. The setting of the show is quite unique in a close future where fighting climate change gone completely awry.", "created_utc": "1649901372.0", "edited": "False", "id": "i4nc0b8", "is_submitter": "False", "link_id": "t3_u2ze6d", "parent_id": "t3_u2ze6d", "score": "1", "subreddit": "anime", "subreddit_id": "t5_2qh22"}, {"author": "getsandom", "body": "I use Anime-Planet that uses a 0-5 scale with half points so adjusting for scale, here are some of my favorites that would be equivalent to a 7 or less:\n\nShangri-La\n\nCop Craft (just finished yesterday, to me it's amazing)\n\nBlack Rock Shooter\n\nKaibutsu Oujo\n\nAoi Hana\n\nNatsu no Arashi!\n\nKyou no 5 no 2\n\nKiddy Grade\n\nClockwork Planet\n\nRenai Boukun\n\nGenei wo Kakeru Taiyou\n\nCoppelion", "created_utc": "1649820114.0", "edited": "False", "id": "i4iqox8", "is_submitter": "False", "link_id": "t3_u2f6zr", "parent_id": "t3_u2f6zr", "score": "3", "subreddit": "anime", "subreddit_id": "t5_2qh22"}, {"author": "getsandom", "body": "I try to keep myself separated from the hype trains but I have to say this past season had a couple of shows did really caught my eye for being popular and good, things that rarely go together.\n\nAkebi-chan no Sailor Fuku and specially Sono Bisque Doll wa Koi wo Suru were a pleasant surprises.\n\nI've seem a few comments with Konosuba as a positive while to me is just the opposite, the first season was just fun enough to finish, the second season I just couldn't be bothered with.", "created_utc": "1649732118.0", "edited": "False", "id": "i4dp048", "is_submitter": "False", "link_id": "t3_u1nbgh", "parent_id": "t3_u1nbgh", "score": "1", "subreddit": "anime", "subreddit_id": "t5_2qh22"}, {"author": "getsandom", "body": "About Cowboy Bebop, didn't watch so I don't have an opinion on it specifically. I do tend to avoid the \"classics\" unless they really caught my eye or I have absolutely nothing else to watch and I have to say I'm often disappointed. \n\nSomething I'm not at all is nostalgic. It seems my \"rose tinted glasses\" got lost, so I don't mind most of the newer trends and don't tend to put things on a pedestal. Also I'm 40 and started to look into anime when I was almost as old as you are now so that may also contribute.\n\nAs for recommendations, It's not only fine but great for you to want to share something that you like, but I don't like the concept of \"starter anime\" at all. Is my opinion that one should look for whatever catch their attention by themselves.", "created_utc": "1649730373.0", "edited": "False", "id": "i4dl6vv", "is_submitter": "False", "link_id": "t3_u12jl3", "parent_id": "t3_u12jl3", "score": "1", "subreddit": "anime", "subreddit_id": "t5_2qh22"}, {"author": "getsandom", "body": "Here is a few with very different feels from each other:\n\nJinrui wa Suitai Shimashita\n\nCoppelion\n\nPlanetarian\n\nSakasama no Patema", "created_utc": "1649627529.0", "edited": "False", "id": "i47tat3", "is_submitter": "False", "link_id": "t3_u0bizq", "parent_id": "t3_u0bizq", "score": "2", "subreddit": "anime", "subreddit_id": "t5_2qh22"}, {"author": "getsandom", "body": "If anything I think there has being a \"Hollywoodyfication\" of anime as of late.  Anime has become ever \"tropier\" over the last years, a lot of cookie cutting going around. Just like Hollywood, original work is ever harder to come by, with the exception of the \"sell toys to little girls\" style of show like Precure everything is based on previous not always quality work. I've seen around that even \"remakes\" are on  the table now, Urusei Yatsura is getting remade for what I gather and that sets a incredibly bad precedent.", "created_utc": "1649627131.0", "edited": "False", "id": "i47sdid", "is_submitter": "False", "link_id": "t3_u0g1r7", "parent_id": "t3_u0g1r7", "score": "0", "subreddit": "anime", "subreddit_id": "t5_2qh22"}, {"author": "getsandom", "body": ">Strongest Sage with the Weakest Crest- Does this acount as an isekai?\n\nDon't think so, the guy reincarnated in the same world", "created_utc": "1649623064.0", "edited": "False", "id": "i47itkt", "is_submitter": "False", "link_id": "t3_u0ody1", "parent_id": "t1_i47e4cq", "score": "1", "subreddit": "anime", "subreddit_id": "t5_2qh22"}, {"author": "getsandom", "body": "Actually both: \\[Mushoku Tensei\\] >!He got in the bad side of some rough types because they were cutting a line, they beat him up and tied him naked to the school gate. He got \"traumatized\" for that and NEET'd himself until he turned 30-something in his parents house. The first time he got out of the house then he got truck'red and isekai'ed!<", "created_utc": "1649622653.0", "edited": "False", "id": "i47huoj", "is_submitter": "False", "link_id": "t3_u0ody1", "parent_id": "t1_i47ctke", "score": "1", "subreddit": "anime", "subreddit_id": "t5_2qh22"}, {"author": "getsandom", "body": "Since I usually only watch finished seasons and we are just at the time of the seasonal change I'm going through some older stuff that I've been putting off for a while so the next few days my main watch is going to be Akame ga Kill!", "created_utc": "1649622067.0", "edited": "1649622882.0", "id": "i47gfpt", "is_submitter": "False", "link_id": "t3_u0ody1", "parent_id": "t3_u0ody1", "score": "3", "subreddit": "anime", "subreddit_id": "t5_2qh22"}, {"author": "getsandom", "body": "Even if you are talking about the novel and not only the anime, it's not an old title at all, the anime barely finish the second half season and the novel started  in 2014. \n\nIsekai has being a anime staple from at least the early 1990's and if I had to point a title that got the current 'isekai epidemic' I'd say Sword Art Online (the 1st season of which is from 2012) is the one which got the trend the boost to get to what it is now for better or worst.", "created_utc": "1649621942.0", "edited": "False", "id": "i47g4m8", "is_submitter": "False", "link_id": "t3_u0ody1", "parent_id": "t1_i47bf0l", "score": "2", "subreddit": "anime", "subreddit_id": "t5_2qh22"}, {"author": "getsandom", "body": "Since I would very much like to be fluent in Japanese and both grammar and pronunciation are incredibly easy, I'd ask if I could instantly lean to read. Japanese writing is an absolute nightmare when compared with the other aspects of the language.", "created_utc": "1649519537.0", "edited": "False", "id": "i41psac", "is_submitter": "False", "link_id": "t3_tzvr1k", "parent_id": "t3_tzvr1k", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "getsandom", "body": "I most of the world incest between consenting adults is socially frowned upon but not illegal", "created_utc": "1649517776.0", "edited": "False", "id": "i41lehm", "is_submitter": "False", "link_id": "t3_tznbt9", "parent_id": "t1_i41jcqy", "score": "1", "subreddit": "memes", "subreddit_id": "t5_2qjpg"}, {"author": "getsandom", "body": "I said this a couple of times in the last few days but here you go: avoid the big names before you found \"what\" you like about anime if you get to like anime at all.\n\nAbout how to find recommendations any anime list site will be a start although I usually recommend Anime-Planet since the whole concept of the site is based in recommendations and what to watch.", "created_utc": "1649460479.0", "edited": "False", "id": "i3yus2q", "is_submitter": "False", "link_id": "t3_tysbft", "parent_id": "t3_tysbft", "score": "1", "subreddit": "anime", "subreddit_id": "t5_2qh22"}, {"author": "getsandom", "body": "Never, no one should. I'll drop in heartbeat anything that is not engaging enough.", "created_utc": "1649459788.0", "edited": "False", "id": "i3yt7po", "is_submitter": "False", "link_id": "t3_tyv2iv", "parent_id": "t3_tyv2iv", "score": "1", "subreddit": "anime", "subreddit_id": "t5_2qh22"}, {"author": "getsandom", "body": "At this point after 10+ years and 1500+ shows I just glance at the subs when dialog get more complex, I can get 60\\~70% of the dialog just by listening and associating with the animation.\n\nI did study a tiny bit of Japanese and vocabulary, grammar and pronunciation are all very simple. The real monster in learning Japanese is reading since they use like 5 different writing systems all mixed but that doesn't really affect anime significantly.\n\nI'm also a very fast reader by nature anyway so even two-liner subs don't take a full second to process.\n\nAlso even though I'm Brazilian I prefer subs in English. English is more compact and you would be surprised at how much more of a direct translation you can get, Portuguese has a lot more information in the grammar and that can get in the way of a compact translation.", "created_utc": "1649375656.0", "edited": "False", "id": "i3tyorf", "is_submitter": "False", "link_id": "t3_txzvu0", "parent_id": "t3_txzvu0", "score": "1", "subreddit": "anime", "subreddit_id": "t5_2qh22"}, {"author": "getsandom", "body": "I normally got 15\\~20 titles I slowly go through in the background in between the \"major watches\" which I usually binge. \n\nIf had to choose a main current watch I'd say it would be a Cop Craft.", "created_utc": "1649372989.0", "edited": "False", "id": "i3tsgc1", "is_submitter": "False", "link_id": "t3_tya3k3", "parent_id": "t3_tya3k3", "score": "2", "subreddit": "anime", "subreddit_id": "t5_2qh22"}, {"author": "getsandom", "body": "Peoples likes are usually very personal, most people will get you a list of what they liked the most and it might not be your cup of tea.\n\nThe one thing I recommend is: get off the beaten path. Avoid the big names until you found \"what\"  you like about anime.", "created_utc": "1649287288.0", "edited": "False", "id": "i3ozmos", "is_submitter": "False", "link_id": "t3_txrj9e", "parent_id": "t3_txrj9e", "score": "1", "subreddit": "anime", "subreddit_id": "t5_2qh22"}, {"author": "getsandom", "body": "The \"classics\" like Dragonball, Saint Seya and the like that were everywhere before people started to actually know what anime was were never my kind of thing.\n\nI'd say the first one I watched knowing it was anime and for it being anime would be Chobits.", "created_utc": "1649286861.0", "edited": "False", "id": "i3oyo0p", "is_submitter": "False", "link_id": "t3_txs3pg", "parent_id": "t3_txs3pg", "score": "1", "subreddit": "anime", "subreddit_id": "t5_2qh22"}, {"author": "getsandom", "body": "I've used Anime Planet for 10 years now, I've tried most others and to me none of then offer anything that would make me change.\n\nThe thing I like about Anime Planet the most is how it deals with recommendations, they are very easy to find and are in every show page, the site is based on them basically.\n\nThe filtering when you are trying to find a show by basically anything is outstanding, very useful when you just finished a show and want more of on the same vein.\n\nIt's  very easy to keep up with your own list on your profile. You can update your list from basically anywhere, if the show title is there, so is your episode count and score.\n\nYou can not only view other users lists but compare with theirs to yours and apply filters over it.\n\nYou can make custom lists both public and private.\n\nI'm not into manga much but you can keep you manga and novel lists there as well.\n\nThe UI is modern and not out of the 2000's like most other anime list sites.\n\nIt has some very useful stats on the show page, it will tell you not only the score but also how many people finished, are watching, want to watch an most useful how many people dropped a show. I find that the proportion of finished to dropped is almost more informative than the score itself.\n\nThe one criticism I'd make is that the information on the show pages could be more complete, but it's not a deal breaker for me as I need the general gist of a show and the community reaction to it to see if I'm gonna try it.", "created_utc": "1649285204.0", "edited": "1649285678.0", "id": "i3ouz3k", "is_submitter": "False", "link_id": "t3_txvwwy", "parent_id": "t3_txvwwy", "score": "4", "subreddit": "anime", "subreddit_id": "t5_2qh22"}, {"author": "getsandom", "body": "People should practice dropping shows they don't like more often. You see quite a few \"Didn't like but watched to the end to prove I'm an Otaku\" kind of reviews instead of actual proper criticism in the typical anime sites.", "created_utc": "1649198391.0", "edited": "False", "id": "i3jvplh", "is_submitter": "False", "link_id": "t3_tx0uiw", "parent_id": "t1_i3ivxal", "score": "51", "subreddit": "anime", "subreddit_id": "t5_2qh22"}, {"author": "getsandom", "body": "Quite a few didn't sit right with me:\n\nKonoSuba - The 1st season was nothing special, started the second just couldn't bother to finish\n\nAstra Lost in Space - Gone through the first few episodes but the premise of the show is nothing new and the characters just didn't feel right for me\n\nDurarara!! - Lost interest\n\nAsobi Asobase - Not my kind o humor, specially with the \"gap moe\" they try with the character desing\n\nMagi: The Labyrinth of Magic - Lost interest\n\nWelcome to Demon School, Iruma-kun - To childish without something interesting to couter-balance, I like quite a few kids shows this was not one of them\n\nSilver Spoon - Lost interest\n\nQuintessential Quintuplets - Something I can't put my finger on irks me out about the girls, all of them. Citrus is another that is a bit famous that I felt the same way, I like me my romance more \"dramatic & realistic\" and don't mind at all same sex relationships (Adachi to Shimamura was one of my recent favorites) but I don't know if its something with the acting or the voices chosen I just couldn't keep watching.\n\nWith 1500+ shows watched, my drop list is way longer than that but those are some relatively recent with the big user scores.", "created_utc": "1649197904.0", "edited": "1649198801.0", "id": "i3jul3h", "is_submitter": "False", "link_id": "t3_tx0uiw", "parent_id": "t3_tx0uiw", "score": "1", "subreddit": "anime", "subreddit_id": "t5_2qh22"}, {"author": "getsandom", "body": "One recent (probably easier to find newer ones), quite chill and family friendly was Flying Witch.\n\nThere is also a little gem called Uninhabited Planet Survive (Mujin Wakusei Survive) very much a 'for kids' show but really good, shame is quite older and not as well know not to mention quite long (52 eps).", "created_utc": "1649128941.0", "edited": "False", "id": "i3g17p3", "is_submitter": "False", "link_id": "t3_twjamw", "parent_id": "t3_twjamw", "score": "1", "subreddit": "anime", "subreddit_id": "t5_2qh22"}, {"author": "getsandom", "body": "Osamu Tezuka's Metropolis is kinda at the limit of your year rangE but though it was quite good", "created_utc": "1649127590.0", "edited": "False", "id": "i3fyewj", "is_submitter": "False", "link_id": "t3_tw2hqi", "parent_id": "t3_tw2hqi", "score": "1", "subreddit": "anime", "subreddit_id": "t5_2qh22"}, {"author": "getsandom", "body": "What kind of OCD one has have to think any form of art has to have a main or even single category?", "created_utc": "1649127002.0", "edited": "False", "id": "i3fx6ew", "is_submitter": "False", "link_id": "t3_tw5k5j", "parent_id": "t3_tw5k5j", "score": "2", "subreddit": "anime", "subreddit_id": "t5_2qh22"}, {"author": "getsandom", "body": "I'm guessing that you mean least favorite anime that we watched to the end anyway. For me at least, I don't watch every anime I start to the end, if is not my cup of tea or it's just bad I just drop it.\n\nThat said the one that hanks the lowest that I still finished would be Excel Saga.", "created_utc": "1648954094.0", "edited": "False", "id": "i36eumz", "is_submitter": "False", "link_id": "t3_tupgsb", "parent_id": "t3_tupgsb", "score": "1", "subreddit": "anime", "subreddit_id": "t5_2qh22"}, {"author": "getsandom", "body": "I would recommend you don't commit yourself to a show just to see it to the end, if a show doesn't rock your boat just drop it.\n\nI sure understand your point about how people idolization of this show may be undeserved. Maybe because I got into anime way older than most (I 'started' at about 30, I'm 40 now) the teen angst just didn't vibe with me, I could not for the life of me get past the 5th episode.", "created_utc": "1648779739.0", "edited": "False", "id": "i2xlc66", "is_submitter": "False", "link_id": "t3_ttdzvt", "parent_id": "t3_ttdzvt", "score": "1", "subreddit": "anime", "subreddit_id": "t5_2qh22"}, {"author": "getsandom", "body": "Most of those are {In the Real World} style titles so you may like Slow Loop which just finished", "created_utc": "1648778697.0", "edited": "False", "id": "i2xj2cn", "is_submitter": "False", "link_id": "t3_tteqzh", "parent_id": "t3_tteqzh", "score": "5", "subreddit": "anime", "subreddit_id": "t5_2qh22"}, {"author": "getsandom", "body": "With a very cursory glance at your list I'd say your taste overlap a fair bit with mine so he is a bit of a filtered down view of what I've watched: [https://www.anime-planet.com/users/getsandom/anime/watched?sort=rating&order=desc&rating\\_greater=3.5](https://www.anime-planet.com/users/getsandom/anime/watched?sort=rating&order=desc&rating_greater=3.5)\n\nIf you want recommendations by the community, not only synopsis and list tracking I'd say [Anime-Planet](https://www.anime-planet.com) is the place to go.", "created_utc": "1648770063.0", "edited": "False", "id": "i2x0184", "is_submitter": "False", "link_id": "t3_tt4ewy", "parent_id": "t3_tt4ewy", "score": "1", "subreddit": "anime", "subreddit_id": "t5_2qh22"}, {"author": "getsandom", "body": "Except for the Ghibli films I'd avoid the big name ones at the start to avoid getting a skewed view of what anime can offer, if you know it is an anime before doing any searching leave it for later, other than that the go to AniDB, Anilist or Anime-Planet and if the synopsis pick you interest go for it.", "created_utc": "1648686696.0", "edited": "False", "id": "i2sc1f5", "is_submitter": "False", "link_id": "t3_tsbr0q", "parent_id": "t3_tsbr0q", "score": "1", "subreddit": "anime", "subreddit_id": "t5_2qh22"}, {"author": "getsandom", "body": "I typically not into things from before 2000 but I've being watching Ranma 1/2 and is quite a lot o fun even if it is obviously dated.", "created_utc": "1648686076.0", "edited": "False", "id": "i2sap39", "is_submitter": "False", "link_id": "t3_ts3vn2", "parent_id": "t3_ts3vn2", "score": "1", "subreddit": "anime", "subreddit_id": "t5_2qh22"}, {"author": "getsandom", "body": "I keep my list on Anime-Planet since in my opinion i has a better user experience and way better recommendation system than the other sites I tried. \n\nThey use a ☆ system but since you can give half ☆'s is essentially a 1-10 system.\n\n As for my classification:\n\n☆ Bad enough I dropped before half way through\n\n☆☆ Not worth paying attention, might not finish\n\n☆☆☆ Watchable enough I'll see it to the end\n\n☆☆☆☆ Good enough I'd consider rewatching\n\n☆☆☆☆☆ I'd recomend even to people who are not into anime generally", "created_utc": "1648684612.0", "edited": "False", "id": "i2s7i02", "is_submitter": "False", "link_id": "t3_tsijiz", "parent_id": "t3_tsijiz", "score": "1", "subreddit": "anime", "subreddit_id": "t5_2qh22"}, {"author": "getsandom", "body": "Mesmo se ignorar as acusações e condenações que a pilha de esterco que é o Lula (e o resto PT) receberam. O fato de ter gente que acha que ele foi um bom presidente por causa dos programas sociais, quando eles na verdade foram desenhados pra por os ignorantes numa coleira eleitoral, é o exato motivo pelo qual acabamos com a outra pilha de esterco que é o Bolsonaro. \n\nEu cada vez mais passo a acreditar na máxima que democracia é a tirania dos idiotas, um pais como o Brasil com um povo que não só é ignorante mas quase que orgulhoso disso e que na sua maioria trata políco como cantor ou jogador de futebol ídolo recebe o que merece.", "created_utc": "1648431280.0", "edited": "False", "id": "i2dvio3", "is_submitter": "False", "link_id": "t3_tpnw0y", "parent_id": "t1_i2cyyiv", "score": "1", "subreddit": "brasil", "subreddit_id": "t5_2qh9i"}, {"author": "getsandom", "body": "Just finished Tonikaku Kawaii half an hour ago so I'm fine I'd guess.", "created_utc": "1648414032.0", "edited": "False", "id": "i2cvq9e", "is_submitter": "False", "link_id": "t3_tpfgm8", "parent_id": "t3_tpfgm8", "score": "1", "subreddit": "anime", "subreddit_id": "t5_2qh22"}, {"author": "getsandom", "body": "Ao invés de focar no que pode ou não em campanha o povo deveria é prestar atenção no fato que são um par de pilhas de merda.\n\nInfelizmente não temos uma 3a opção sequer viável na disputa por causa das boiadas de gado eleitor quem tratam um ou o outro como mistura de santo com artilheiro do time favorito.", "created_utc": "1648410066.0", "edited": "False", "id": "i2cmwdk", "is_submitter": "False", "link_id": "t3_tpnw0y", "parent_id": "t3_tpnw0y", "score": "-14", "subreddit": "brasil", "subreddit_id": "t5_2qh9i"}, {"author": "getsandom", "body": "In my opinion, in the case of the US, there is a cultural to it that it's hard to get rid of, in the case of the US the lobby culture ensures money keep moving mountains. \n\nI'm from Brazil and here we are 'technically' the same as Scandinavia in that unions are formed by work area rater than by company but most of the unions here either serve for the benefit of the union staff or as a political trampoline, Brazil's Worker Party which is one of the most disgustingly corrupt organizations in the world was originally formed by the heads of a few regional metalworker unions.", "created_utc": "1648272790.0", "edited": "False", "id": "i25u1jt", "is_submitter": "False", "link_id": "t3_tnxb71", "parent_id": "t1_i257ajk", "score": "3", "subreddit": "technology", "subreddit_id": "t5_2qh16"}, {"author": "getsandom", "body": "I'm 40 and I got into anime late as well, I'm from Brazil and here we got a few of the big ones in the 90's (Saint Seya, Dragonball an the like) before they were known as anime but I was never into them back then. I got in to anime some 10 years ago an even though some times I do take a few months without watching much (if I'm into a big game for example) I'm up to 18,235 episodes from 1451 series.", "created_utc": "1647993538.0", "edited": "False", "id": "i1qc4r4", "is_submitter": "False", "link_id": "t3_tk2z04", "parent_id": "t3_tk2z04", "score": "1", "subreddit": "anime", "subreddit_id": "t5_2qh22"}, {"author": "getsandom", "body": "I'm a huge CLAMP and Ghibli fan so, if you take them out there are still a few full marks on my list, it's a 1400+ series long list after all.\n\nIn order of newer to older: Made in Abyss, Zetsuen no Tempest, Otome Youkai Zakuro, Katanagatari, Shangri-La, Nijuu-Mensou no Musume, Ergo Proxy.\n\nThere isn't to say they are perfect but still so good (to me at least) the shortcomings don't warrant taking points out.", "created_utc": "1646545564.0", "edited": "False", "id": "hzjmoi9", "is_submitter": "False", "link_id": "t3_t7ev0a", "parent_id": "t3_t7ev0a", "score": "2", "subreddit": "anime", "subreddit_id": "t5_2qh22"}, {"author": "getsandom", "body": "A good chunk of people here read mostly literature originally written in English so this will be mostly unknown.\n\nI'm Brazilian, and in school got the \"obligatory classics\" from  Portuguese literature and while I was a bookworm (still am in some capacity) and most of 18-19 century writing from Brazil and Portugal was enjoyable to me there was one author, Eça de Queiroz, I could not get a single book down. His writing just rubbed me the wrong way no matter what.", "created_utc": "1642905103.0", "edited": "False", "id": "httss3a", "is_submitter": "False", "link_id": "t3_sabsyg", "parent_id": "t3_sabsyg", "score": "2", "subreddit": "books", "subreddit_id": "t5_2qh4i"}, {"author": "getsandom", "body": "The games made people want to read the books which got them famous outside of Poland, specially since some of the quest stories in The Witcher 3 are an absolute masterpiece of writing. I've read all of the series and while the world building is great and a few pearls do shine here and there Sapkowski sure is not the \"Polish Tolkien\" many early (mainly polish) fans tout about.", "created_utc": "1642904554.0", "edited": "False", "id": "httrid3", "is_submitter": "False", "link_id": "t3_sabsyg", "parent_id": "t1_httgqjg", "score": "1", "subreddit": "books", "subreddit_id": "t5_2qh4i"}, {"author": "getsandom", "body": "Philip Pullman and Antoine de Saint-Exupéry", "created_utc": "1640825572.0", "edited": "False", "id": "hqhgdu4", "is_submitter": "False", "link_id": "t3_rqvp9m", "parent_id": "t3_rqvp9m", "score": "1", "subreddit": "books", "subreddit_id": "t5_2qh4i"}, {"author": "getsandom", "body": "To me it's one o very few non-fantasy that would make my top lists.\n\nPeople get irked by it because of how the theme is distorted, to many people (many of which wouldn't touch the book with tent pole) it's basically child porn. In reality it's neither a glorification of the sick relationship of the main characters nor even a critic of it, if you really read into it the main theme of the book is a critic of how post-war American society actually turned a blind eye to that kind of thing in the name of keeping it's perfect façade.", "created_utc": "1640554561.0", "edited": "False", "id": "hq2iyji", "is_submitter": "False", "link_id": "t3_rosj2u", "parent_id": "t1_hq1ylnf", "score": "4", "subreddit": "books", "subreddit_id": "t5_2qh4i"}, {"author": "getsandom", "body": "Adaptations always get things lost in the translations between medias, and written media always has a lot more detail and a lot more freedom besides in this case being the source material.\n\nThat said, answering your question, if you are good with reading (not everybody watching anime is) you definitely should go for the novels. Just take in account what some of the other answers said, Kirito's and Asuna's story might have started in SAO but every arc has a different feel to it, after the end of the first 2 arcs (which season 1 covers) the story move forward and SAO incident becomes a background to the narrative.", "created_utc": "1639880681.0", "edited": "False", "id": "hp4d1ep", "is_submitter": "False", "link_id": "t3_rj9qfq", "parent_id": "t3_rj9qfq", "score": "3", "subreddit": "swordartonline", "subreddit_id": "t5_2uikt"}, {"author": "getsandom", "body": "You can get slow on uncoordinated just by have a part of your brain touched, without permanent damage, this way the doctor can know how much they can take of to avoid the tumor coming back without cutting into something essential.", "created_utc": "1639834800.0", "edited": "False", "id": "hp1olf0", "is_submitter": "False", "link_id": "t3_rixxtq", "parent_id": "t1_hp1n0c2", "score": "2", "subreddit": "nextfuckinglevel", "subreddit_id": "t5_m0bnr"}, {"author": "getsandom", "body": "Progressive will probably go up to the point Kirito and Asuna each go their own way, most likely to the end of the elf's questline.", "created_utc": "1639543266.0", "edited": "False", "id": "holupv9", "is_submitter": "False", "link_id": "t3_rgb9s7", "parent_id": "t3_rgb9s7", "score": "0", "subreddit": "swordartonline", "subreddit_id": "t5_2uikt"}, {"author": "getsandom", "body": "Socially is not far off, we have no changed that much as a society since the early 2000's when the series was conceived.\n\nOn the hardware and software development we are way off still. The kind of tech needed for something even close what the NerveGear can do will not be available for the next 40\\~50 years and no amount of research done within the modern science ethic guidelines can pull that date any closer, I'd go so far as to say that even with an absolute genius like Kayaba Akihiko, with limitless resources and no ethical consideration at all during the experimental phase we still would be 20+ years from the NerveGear equivalent let alone the Soul Translator.\n\nI'd say we are going to achieve a partial dive in the next 10\\~15 years with the hardware being able to translate movement intent without the need for controllers but the feedback will still be a better version of the current screen and speaker we already use today.", "created_utc": "1639541905.0", "edited": "False", "id": "hols5j7", "is_submitter": "False", "link_id": "t3_rgaepg", "parent_id": "t3_rgaepg", "score": "1", "subreddit": "swordartonline", "subreddit_id": "t5_2uikt"}, {"author": "getsandom", "body": "Blood and Wine is a nice send of to the game but the story in Hearts of Stone is better", "created_utc": "1639456661.0", "edited": "False", "id": "hoh1n60", "is_submitter": "False", "link_id": "t3_rfjphl", "parent_id": "t3_rfjphl", "score": "1", "subreddit": "gaming", "subreddit_id": "t5_2qh03"}, {"author": "getsandom", "body": "Women are \"genetically stripey\" as they have 2 X chromosomes and they are active in an alternate pattern, it may be that she has the some of the albinism factors in one of the X chromosomes but not the other and her left eye and some hair uses the albinism free one to process melanin.", "created_utc": "1639316193.0", "edited": "False", "id": "ho8t5p2", "is_submitter": "False", "link_id": "t3_rem0rl", "parent_id": "t1_ho8fq29", "score": "6", "subreddit": "pics", "subreddit_id": "t5_2qh0u"}, {"author": "getsandom", "body": "Just to complement Jsder-'s response, the platinum version is a collection of the volumes 1-20 of the novels with some extra artwork bonus, current japanese volume number is 26, the english translation goes to volume 23.", "created_utc": "1639313958.0", "edited": "False", "id": "ho8p7ok", "is_submitter": "False", "link_id": "t3_refoa3", "parent_id": "t3_refoa3", "score": "3", "subreddit": "swordartonline", "subreddit_id": "t5_2uikt"}, {"author": "getsandom", "body": "Most of the overly popular \"I don't watch anime but heard of it\" titles like Naruto, One Piece, Dragon Ball, Saint Seya and so on simply don't get my attention.\n\nSome of the \"real anime\" like Evangelion I tried to watch just to drop 3 episodes in, could not stand the emo self-torture.\n\nAttack on Titan I did get through the first, it just wasn't good enough to get me back to it on the following seasons.\n\nSame deal with the Monogatari series, just didn't got my attention enough.", "created_utc": "1639194274.0", "edited": "False", "id": "ho2t6wi", "is_submitter": "False", "link_id": "t3_rdid9a", "parent_id": "t3_rdid9a", "score": "1", "subreddit": "anime", "subreddit_id": "t5_2qh22"}, {"author": "getsandom", "body": "Agil from SAO should be relatively well know although as secondary character most of the time. There are also Lashiti and the Tibesti prince brothers from Dimension W which are very central to the story.", "created_utc": "1637628486.0", "edited": "False", "id": "hlpk40a", "is_submitter": "False", "link_id": "t3_qzyi1z", "parent_id": "t3_qzyi1z", "score": "6", "subreddit": "anime", "subreddit_id": "t5_2qh22"}, {"author": "getsandom", "body": "You got xxxHolic and Chobits already, I'd say at least you should get Tsubasa Reservoir Chronicles as besides being really good also ties all of the work from Clamp (the authors of these and the likes of Cardcaptor Sakura and others ) in an integrated universe. People going to manga are probably also at least aware of the Studio Ghibli movies but most don't know the best work of Hayao Miyazaki is actually the manga of Nausicaa of the Valey of the Wind, it's an amazing story and goes so much deeper than the movie I'd say it's a must read even if you are not a manga fan.", "created_utc": "1637011306.0", "edited": "1637012270.0", "id": "hkrq5yp", "is_submitter": "False", "link_id": "t3_qun3at", "parent_id": "t3_qun3at", "score": "1", "subreddit": "manga", "subreddit_id": "t5_2ql0i"}, {"author": "getsandom", "body": "All they needed to do for business explode is make easy to access the content directly from outside Japan without the corrupt middle-men like the American branch of Sony and Chinese puppets like Tencent.\n\nHere is hoping Kadokawa go down the drain as fast as possible and become the example the rest of Japanese media needs to see that what they need is not to bend to outside pressure from Chinese Dictatorship, Western SWJ Rotten Media or otherwise.", "created_utc": "1635718325.0", "edited": "False", "id": "hiteqd8", "is_submitter": "False", "link_id": "t3_qjgu3z", "parent_id": "t3_qjgu3z", "score": "2", "subreddit": "LightNovels", "subreddit_id": "t5_2sloz"}, {"author": "getsandom", "body": "I think people pick on the \"generic\" themes of SAO without looking to deep in to it.  I absolutely love it, but the novels are very much styled as fanfiction even tough its mostly original work. The detractors, I think, mainly don't like the fact that what they think is a \"by the books\" story got so much media over their favorite \"unique\" title.\n\nAnd that is compounded with the fact that it brought forth an era of lookalikes and copycats and just made the isekai pandemic that very much worse.", "created_utc": "1635004852.0", "edited": "False", "id": "hhr37mr", "is_submitter": "False", "link_id": "t3_qe5485", "parent_id": "t1_hhqqyma", "score": "5", "subreddit": "anime", "subreddit_id": "t5_2qh22"}, {"author": "getsandom", "body": "Last real protests in mainland China were all the way back on th 1980's, there is more than an entire generation of people who grew up in to adulthood being fed the propaganda.", "created_utc": "1632371240.0", "edited": "False", "id": "hdxeied", "is_submitter": "False", "link_id": "t3_pt7lvk", "parent_id": "t1_hdwcmxf", "score": "1", "subreddit": "worldnews", "subreddit_id": "t5_2qh13"}, {"author": "getsandom", "body": "The thing about Santos Dumont is dependent on two things: First is how you consider what is a plane. His was totally self-contained, no external device was needed for the plane to take off, for which he won a prize in France where he was working a the time. Second he was very public about his work and never patented any of his designs while the Wright worked in away from the public hopping for a commercial and military contracts.", "created_utc": "1621030003.0", "edited": "False", "id": "gy5gt1m", "is_submitter": "False", "link_id": "t3_nc4del", "parent_id": "t1_gy4j1vl", "score": "1", "subreddit": "todayilearned", "subreddit_id": "t5_2qqjc"}, {"author": "getsandom", "body": "It's all about choice and customization, on PC you do you, no fanboying for developers and/or manufacturers needed, no RGB required either.\n\nYou can change the games config to match your machine for perf or looks, no need to have the best machine right out of the gate. You can also upgrade gradually, no changing the whole machine at once. You can mod the games to be an do what you want, no manufacturer limiting what you do.\n\nYou have 50 years of gaming at your disposal through emulation including old consoles while modern consoles have barely got back-compatibility on the last 2 gens and only inside their own families.\n\nThe only excuse consoles had was that they were capable of be turned on and play straight away, that's not valid anymore. Gaming on a TV on the couch with a controller is just as easy on PC. All the convenience they had over PC is lost. And absolutely NO, exclusive games are NOT reason enough for a console to exist still.\n\nFrom both the PS4 and Xbox One onwards they are just locked-up prebuilt PCs. They use the same hardware, they need all the same updating of the OS and patching of games as a PC only you don't get control of what/when/how this happens for the most part. In the case of Xbox even the core of the OS is the same as a common PC just with a lock and a \"coat of paint\" on the UI.\n\nIn my opinion the fact that \"PC like\" consoles exist hurts all players, they make developers lazy as they know they can get away with putting incomplete games out and patch them after the fact as well as optimizing them badly as console player got used to be fed the \"cinematic\" excuse for bad performance.\n\nP.S.: Most PC players don't play on top machines either, just search the [Steam statistics](https://store.steampowered.com/hwsurvey) and you would see, the PC I'm writing this on doesn't have better hardware than a current gen Xbox or PS5.", "created_utc": "1619833305.0", "edited": "1619834106.0", "id": "gwhuy8j", "is_submitter": "False", "link_id": "t3_n250y6", "parent_id": "t3_n250y6", "score": "1", "subreddit": "gaming", "subreddit_id": "t5_2qh03"}, {"author": "getsandom", "body": "There are a lot of Proto-Gek type fauna, would this be a form of Proto-Vy'keen?", "created_utc": "1615068995.0", "edited": "False", "id": "gq10bo1", "is_submitter": "False", "link_id": "t3_lyvdxf", "parent_id": "t3_lyvdxf", "score": "1", "subreddit": "NMSCoordinateExchange", "subreddit_id": "t5_3lqlo"}, {"author": "getsandom", "body": "LOD, that's how, the farther an object the less detail you put on it with things like alternate models and mipmapped textures. Also some games will not render things that are out of the field of view of the player. You can see that in Skyrim if you mod it for example, if you walk through something like a bush with a modded model it will disappear because the game will think the original model would be out of view and unload it from the render pipeline while the modded one would still be visible. Loading optimization gone wrong are also the root cause of the pop-in effect most of the time.", "created_utc": "1614982882.0", "edited": "False", "id": "gptoh6a", "is_submitter": "False", "link_id": "t3_lyc2n1", "parent_id": "t1_gpt1duw", "score": "2", "subreddit": "gaming", "subreddit_id": "t5_2qh03"}, {"author": "getsandom", "body": "Would be amazing to tame the big flying beasts, besides dragons there are quite a few griffons, fellbeasts (flying nazgûl rides), even some moths and butterflies big enough to carry someone.", "created_utc": "1614385010.0", "edited": "False", "id": "gowyqqv", "is_submitter": "False", "link_id": "t3_lsu460", "parent_id": "t3_lsu460", "score": "3", "subreddit": "NMSCoordinateExchange", "subreddit_id": "t5_3lqlo"}, {"author": "getsandom", "body": "It is a star-nosed mole-bear, I found a moon with small ones about 60cm (2ft). [Several of other interesting fauna as well.](https://www.reddit.com/r/NMSCoordinateExchange/comments/lox1ap/single_moon_many_companion_possibilities/)", "created_utc": "1613946990.0", "edited": "False", "id": "go9xus7", "is_submitter": "False", "link_id": "t3_lp5s9z", "parent_id": "t3_lp5s9z", "score": "3", "subreddit": "NMSCoordinateExchange", "subreddit_id": "t5_3lqlo"}, {"author": "getsandom", "body": "New here, have to get hang of the jargon still.", "created_utc": "1609705460.0", "edited": "False", "id": "ghzngiy", "is_submitter": "True", "link_id": "t3_kpk7z3", "parent_id": "t1_ghyjhjz", "score": "1", "subreddit": "NMSCoordinateExchange", "subreddit_id": "t5_3lqlo"}, {"author": "getsandom", "body": "Sundome is manages to have sex as the main underlying theme and have a great story", "created_utc": "1600982385.0", "edited": "False", "id": "g6gxpg5", "is_submitter": "False", "link_id": "t3_iz5so7", "parent_id": "t3_iz5so7", "score": "2", "subreddit": "manga", "subreddit_id": "t5_2ql0i"}, {"author": "getsandom", "body": "More than any of his films, the Nausicaa manga is Miyazaki-sensei's magnum opus, the freedom it gave him from the length constraint movies have brought forth his best storytelling.", "created_utc": "1594774986.0", "edited": "False", "id": "fy3iqj6", "is_submitter": "False", "link_id": "t3_hr7b06", "parent_id": "t1_fy31uz4", "score": "2", "subreddit": "anime", "subreddit_id": "t5_2qh22"}, {"author": "getsandom", "body": "People who are more on the animation side will probably tell you that Spirited Away is Miyazaki-sensei's best work, I for one consider Nausicaa manga his magnum opus. He is a genius when it come to animation but he is an even better history teller in general and the fact that a manga doesn't have to rush things to fit in \\~2 hour final product brings the best of him.", "created_utc": "1588817055.0", "edited": "False", "id": "fpq82ml", "is_submitter": "False", "link_id": "t3_gerwr9", "parent_id": "t3_gerwr9", "score": "8", "subreddit": "books", "subreddit_id": "t5_2qh4i"}, {"author": "getsandom", "body": "In Brazil there is a minimum income limit below which you have no obligation to turn any tax declaration and most people earn way less than that.", "created_utc": "1576719015.0", "edited": "False", "id": "fbc9rg1", "is_submitter": "False", "link_id": "t3_ecj65n", "parent_id": "t1_fbc0u78", "score": "15", "subreddit": "todayilearned", "subreddit_id": "t5_2qqjc"}, {"author": "getsandom", "body": "Or Brazil, I certainly never heard of it. We were always friendly with the British and also we were a colony of Portugal which has the longest lasting friendship and collaboration alliance with the British signed in 1373 and still in effect today, if they needed something like a military base in Brazil all they would do was ask the Portuguese. They sure influenced our history with things like the run of the Portuguese to Brazil in 1808 which was indirectly cause by this alliance as they refused Napoleon when he demanded the Portuguese to stop trading with the British. The Paraguay War and the end of the slave trade were pushed by the British as they wanted more market and less competition for their textiles but I'm pretty sure there never was a direct military British intervention here.", "created_utc": "1554645579.0", "edited": "False", "id": "ekba9x2", "is_submitter": "False", "link_id": "t3_bafjbx", "parent_id": "t1_ekb8r8w", "score": "5", "subreddit": "todayilearned", "subreddit_id": "t5_2qqjc"}, {"author": "getsandom", "body": "I live close to the city of São Paulo and here I never heard it pronounced that way, in the city I live we do have some variation on the pronunciation of  \"de\" and \"di\" though, we have a lot of people from the South here and they say those \"syllables\" in a very dental way touching the tongue to the top front teeth, while São Paulo natives do it more loose with \"di\" sounding more like an English  \"jee\".", "created_utc": "1548980345.0", "edited": "False", "id": "efhe6qv", "is_submitter": "False", "link_id": "t3_alhf38", "parent_id": "t1_eff6szm", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "getsandom", "body": "Different from written Brazilian Portuguese, which is standardized, in actual everyday pronunciation there is as much variety in manners of speech in Brazil that one could even call some of it dialects. \n\nRio de Janeiro for one has a closer way of speech to European Portuguese than the rest of Brazil because of the late 1800's imigration.\n\nSão Paulo on the other hand kept some of the sounding of the 16th century Portuguese with some indigenous Brazilian native influence. \n\nAll the while in the Northeast of the country there is an immense influence from African languages because of the heavy African slave income from the 16th to mid 19th century, to the point some of the pronunciation and most of the vocabulary is only borderline intelligible to someone from the South.\n\nWhat most people call Brazilian Portuguese outside Brazil is most likely the way people talk in the city of São Paulo or some times the Brasilia metropolitan areas but even within the state of São Paulo we have differences in urban and caipira (rural,redneck) speech.\n\nTL;DR; no such thing as Brazilian Portuguese in everyday speech.", "created_utc": "1548901918.0", "edited": "False", "id": "efes35e", "is_submitter": "False", "link_id": "t3_alhf38", "parent_id": "t3_alhf38", "score": "5", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "getsandom", "body": "The red distinction is interesting as we have basic the same in Portuguese, red in general is \"vermelho\" but \"ruivo\" for the natural orange-red of human hair.", "created_utc": "1543536273.0", "edited": "False", "id": "ear3rpt", "is_submitter": "False", "link_id": "t3_a1g1jx", "parent_id": "t3_a1g1jx", "score": "6", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "getsandom", "body": "All of CLAMP's works beside being very good are an actual concise interlinked universe, everything from Angelic Layer to X are shown to be a united multiverse by  xxxHolic and Tsubasa: Reservoir Chronicle. And a good deal of it actually is a multimedia franchise even if not a coordinated \"Cinematic Universe\" yet as a good chunk has being produced as anime. They gone as far as have the latest installment of Sakura Cardcaptors having a \"coordinated\" release between manga and anime, from that to a full blown CU is basically as step.", "created_utc": "1538276886.0", "edited": "1538277521.0", "id": "e6w1555", "is_submitter": "False", "link_id": "t3_9jxakm", "parent_id": "t3_9jxakm", "score": "1", "subreddit": "anime", "subreddit_id": "t5_2qh22"}, {"author": "getsandom", "body": "Well I'm 36, I was older than you are now when I watched the series the first time, and both Avatar series for me are some of the best things I ever watched. That I believe goes to show the magnificence of the series, it can entertain kids that are barely old enough to go to school while still being complex, rich, engaging and an absolute pleasure to watch to someone like me who is already graying out.", "created_utc": "1538108320.0", "edited": "False", "id": "e6s2347", "is_submitter": "False", "link_id": "t3_9jhimr", "parent_id": "t1_e6s0s64", "score": "6", "subreddit": "TheLastAirbender", "subreddit_id": "t5_2rybx"}, {"author": "getsandom", "body": "That's only if the engine is not designed to use ethanol, the article is not talking about cars that run on gasoline converted to ethanol, they are thought to use ethanol or a mix of it with gasoline from the start. It's been about 40 years since general availability of ethanol fueled car here in Brazil and their durability is the same if not better that gasoline only cars.", "created_utc": "1498617601.0", "edited": "False", "id": "djhsl12", "is_submitter": "False", "link_id": "t3_6jr6kf", "parent_id": "t1_djhjugc", "score": "1", "subreddit": "todayilearned", "subreddit_id": "t5_2qqjc"}, {"author": "getsandom", "body": "Some research has revealed that flapping wings are more energy efficient than jets and propellers, but they are not used in large scale because the mechanical stresses make engineering a flapping winged plane incredibly harder than one with fixed wings....", "created_utc": "1454600144.0", "edited": "False", "id": "cznlwx3", "is_submitter": "False", "link_id": "t3_445fpp", "parent_id": "t3_445fpp", "score": "25", "subreddit": "anime", "subreddit_id": "t5_2qh22"}, {"author": "getsandom", "body": "Ergo Proxy os quite realistic in style", "created_utc": "1454098191.0", "edited": "False", "id": "czgs3t4", "is_submitter": "False", "link_id": "t3_43ais3", "parent_id": "t3_43ais3", "score": "9", "subreddit": "anime", "subreddit_id": "t5_2qh22"}, {"author": "getsandom", "body": "Actually is not, in Brazil in the standard post address the number comes after the street name and we normally have another subdivision (district, village, and so on) after it before the city as newly developed districts tend not to have street names causing bigger cities to have repeated street names (usually numbers)...", "created_utc": "1453221939.0", "edited": "False", "id": "cz429pn", "is_submitter": "False", "link_id": "t3_41pf2b", "parent_id": "t3_41pf2b", "score": "2", "subreddit": "explainlikeimfive", "subreddit_id": "t5_2sokd"}, {"author": "getsandom", "body": "The between Tsubasa Chronicles and xxxHolic the stories are actually intermingled, they run more or less in parallel touching occasionally but in very important moments.", "created_utc": "1451432169.0", "edited": "False", "id": "cyfisga", "is_submitter": "False", "link_id": "t3_3yob8e", "parent_id": "t1_cyfbk2h", "score": "2", "subreddit": "manga", "subreddit_id": "t5_2ql0i"}, {"author": "getsandom", "body": "Actually together with Tsubasa Chronicles, xxxHolic ties all CLAMP work in one single concise universe. If you intend to read the manga I'd recommend you at least read Tsubasa Chronicles too, but you should not discard the other CLAMP work, all of it is amazing, if you don't fell like reading a big part of it has anime versions: Sakura Cardcaptors, Chobits, Angelic Layer, Rayearth, just to name a few and all make some part of xxxHolic background...", "created_utc": "1451411855.0", "edited": "False", "id": "cyf5jd1", "is_submitter": "False", "link_id": "t3_3yob8e", "parent_id": "t3_3yob8e", "score": "3", "subreddit": "manga", "subreddit_id": "t5_2ql0i"}, {"author": "getsandom", "body": "Miyazaki-sensei's uncle owned an airplane parts factory during and after WWII so he grew up fascinated by planes and the idea o flight,  which is why it's a very common theme on his movies. When he gone and helped found Studio Ghibli he also took from his interest to find this unique name.", "created_utc": "1410098661.0", "edited": "False", "id": "ckbk7es", "is_submitter": "False", "link_id": "t3_2fpl12", "parent_id": "t3_2fpl12", "score": "1", "subreddit": "todayilearned", "subreddit_id": "t5_2qqjc"}, {"author": "getsandom", "body": "They worked for CERN, where the web as we know started...", "created_utc": "1408746210.0", "edited": "False", "id": "cjxv86m", "is_submitter": "False", "link_id": "t3_2ebbkm", "parent_id": "t3_2ebbkm", "score": "2", "subreddit": "pics", "subreddit_id": "t5_2qh0u"}, {"author": "getsandom", "body": "Anime in Japan don't have the same meaning we use in western culture, in japanese anime is anything that is animated, including things made in the west like Adveture Time or Simpsons or 3D like Pixar movies. And anime produced in Japan target any demographic with things like Precure aimed at little girls the same way My Little Pony or Barbie animations are, most people just don't get to know the variety of anime because we get mostly mainstream things like Naruto, Evangelion or Attack on the Titan, that is, the not so kiddie like shows. And there are those otakus which being full grown adults do watch things like Precure, sometimes even openly sporting merchandising (clothing, figures etc.) and attending events that were supposed to be for kids. Those usually only serve to reinforce the archetype of mentally unstable and creppy created by the incident Redcrimson posted the link about.", "created_utc": "1405809861.0", "edited": "False", "id": "cj23y2i", "is_submitter": "False", "link_id": "t3_2b5th9", "parent_id": "t1_cj22uyy", "score": "12", "subreddit": "anime", "subreddit_id": "t5_2qh22"}, {"author": "getsandom", "body": "That's not entirely true, I live in Brazil and here we have a variant of  cricket that is played on the streets with broomsticks and cans and no regard to the size or weight of the ball as long as you can throw it with one hand. Although its considered kids play, not being considered a proper sport. \nPopularity of baseball in other countries its most certainly from presence influence, as there are US military bases in several places where its popular, take post-WWII Japan for example. \nAnother confusion that the title of the post brings is the fact that most countries in America as a whole were never British colonies, most were Spanish, with Brazil being colony of Portugal. So British sports older than soccer never made here the way cricket made to the US (as baseball is derived from it) and Australia. You can see this colonial influence in Mexico as soccer is the most popular sport there as well even it being in North America.\nIn Brazil soccer as sport was introduced in a time where there was a great number of British here from companies constructing railroads to facilitate transport of coffee and cotton (main export commodities at the time) and it was about the end of the 1800's (first soccer team in Brazil is from 1895) when its was a popular past-time among the British.", "created_utc": "1402680001.0", "edited": "False", "id": "ci6p875", "is_submitter": "False", "link_id": "t3_281quh", "parent_id": "t1_ci6j9hc", "score": "1", "subreddit": "explainlikeimfive", "subreddit_id": "t5_2sokd"}, {"author": "getsandom", "body": "I happen to feel it too. It has to do with the way perspective is rendered by the game. Games cannot in their current form create real-time photorealistic images because of limitations to what the hardware can do, in real life when you look at an environment each of the objects in in have it's own perspective scape point, the game cannot create one scape point per object in a scene because it would be way to computationally expensive making it unplayable. Because of that our brains when trying to interpret the image (and the changes to it as you move your character) will catch this limitation as a distortion and react in a similar way to when get a blurry vision from drinking to much making you sick. In Skyrim for the PC specifically you can access a developers console and give the game a command to change the viewing angle of the camera, when you do it and set the angle to one bigger than the default (which is 75 degrees) you can clearly see the distortion of perspective. A little tip, never play on an empty stomach it'll make you sick faster and get to a bigger distance from the screen as it will disguise the distortion a little...", "created_utc": "1401064102.0", "edited": "False", "id": "chr2p66", "is_submitter": "False", "link_id": "t3_26hd5w", "parent_id": "t3_26hd5w", "score": "1", "subreddit": "explainlikeimfive", "subreddit_id": "t5_2sokd"}, {"author": "getsandom", "body": "If you liked Nozoki Ana and Minamoto Monogatari then you would love Sundome. Though the art style is more crude than the previous 2, the story and erotism can be even more intense...... \n", "created_utc": "1387644038.0", "edited": "False", "id": "ce73qn8", "is_submitter": "False", "link_id": "t3_1sryg7", "parent_id": "t3_1sryg7", "score": "1", "subreddit": "manga", "subreddit_id": "t5_2ql0i"}, {"author": "getsandom", "body": "Because I hate bad subs I've got my english fluent so I could do that (I'm brazilian, my native language is portuguese) and since I watch a lot of anime I'm in the process of doing the same for japanese .", "created_utc": "1387643439.0", "edited": "False", "id": "ce73jub", "is_submitter": "False", "link_id": "t3_1te6qr", "parent_id": "t3_1te6qr", "score": "1", "subreddit": "AdviceAnimals", "subreddit_id": "t5_2s7tt"}, {"author": "getsandom", "body": "As far as can be learned from the novels (the anime left most tech info out as i would take too long). The Nervgear interacts with the cranial nervous system only, the signal is intercepted before it goes out of the cranium and blocked there, otherwise we would have people running around and swinging fake swords in their beds (which they don't do using the Nervgear). So if the cause of the paralisis is outside of the brain (99.999% of it is), this people would still be capable of doing the exactly same as anyone else inside the game... ", "created_utc": "1386543717.0", "edited": "False", "id": "cdwxghf", "is_submitter": "False", "link_id": "t3_1sbosb", "parent_id": "t1_cdvy3or", "score": "1", "subreddit": "swordartonline", "subreddit_id": "t5_2uikt"}, {"author": "getsandom", "body": "OP/ED are usually a big deal for anime and that's very unlike cartoon which, when it have a definite OP, is 30s max to maximize the time for the ads on the interval. About the timming LightBladeX explained it well. The \"theme\" itself though is usually a normal lenght music (3-5 mins) cut short to a bridge/chorus to fit the OP animation.......", "created_utc": "1382880230.0", "edited": "False", "id": "cd0lfex", "is_submitter": "False", "link_id": "t3_1paxb9", "parent_id": "t3_1paxb9", "score": "1", "subreddit": "anime", "subreddit_id": "t5_2qh22"}, {"author": "getsandom", "body": "If memory serves he did respond that in a question thursday. He is 6'1\"|1.85m (tall but not that much) if I'm not mistaken....", "created_utc": "1382799039.0", "edited": "False", "id": "cd00nmh", "is_submitter": "False", "link_id": "t3_1p6l7b", "parent_id": "t3_1p6l7b", "score": "1", "subreddit": "nerdfighters", "subreddit_id": "t5_2rocp"}, {"author": "getsandom", "body": "Here on Brazil they are still pretty commom in more rural areas, they where commom place ever in the city 'till some 15 years ago.My house is pretty old (almost 30 years) so my mother's bedroom is still locked with one....", "created_utc": "1382797996.0", "edited": "False", "id": "cd00dux", "is_submitter": "False", "link_id": "t3_1p8zhe", "parent_id": "t1_cczxzvc", "score": "2", "subreddit": "pics", "subreddit_id": "t5_2qh0u"}, {"author": "getsandom", "body": "Sorry for the miss, I usually check words I don't use everyday. And I was talking ideograms in general but since I'm studying japanese I've grown used to say 'kanji', though japanese can use 4 or 5 writing systems in a single sentence at times....", "created_utc": "1382487449.0", "edited": "1382488030.0", "id": "ccxhw6g", "is_submitter": "False", "link_id": "t3_1ou2bj", "parent_id": "t1_ccw5at7", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "getsandom", "body": "Actually, dislexia is something that is somewhat tied to the wrinting system. The Latin alphabeth (and other alphabeths for that matter) is a way to put speech sounds into graphic symbols (usually called glyphs), which is why ocidental dislexic people have a hard time with converting writen words to sound (e.g. mixing letters) and then into to meaningfull ideas during reading. Kanji (that composes most of Japanese wrinting) actually tie the idea behind a glyph straight to the glyph in the same way we tie a persons face to his/her name, actually the same part of the brain that process recognizing faces is responsible for learning oriental writing like Kanji, so you may be dislexic for alphabeths but not for ideograms and vice-versa. That are real cases in China of people that cannot read Kanji (and have a hard time remmebering peoples faces) but can read alphabethic wrinting quite well...", "created_utc": "1382315820.0", "edited": "False", "id": "ccvzh6t", "is_submitter": "False", "link_id": "t3_1ou2bj", "parent_id": "t1_ccvnfhx", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "getsandom", "body": "I'm going to rewatch the episodes carefully later but as bbctol said and as far as I remember nobody said there has been only one Harmonic Convergence between the fusion o Raava and Wan and the criation of the Avatar and the current timeline. And your math doesn't check, You are forgetting that Korra is already 17, which means Aang died age 165 (12 before the war, 100 on the ice, 70 to Korra's time less her 17 years age). Besides is known that aside Kyoshi who lived to be 230 and other Avatars where supposed to largelly outlive normal people....", "created_utc": "1382230296.0", "edited": "1382230526.0", "id": "ccvaynp", "is_submitter": "False", "link_id": "t3_1orpnt", "parent_id": "t1_ccv8a5o", "score": "1", "subreddit": "TheLastAirbender", "subreddit_id": "t5_2rybx"}, {"author": "getsandom", "body": "That's the thing, even Pixar have nothing of worth this year. I see your point on  the fact that Miyazaki might be persona-non-grata for having refused to get to the ceremony last time, but if you take in acount that peer and popular pressure have a great deal of value for the 'Academy' (Titanic for example, pure popular pressure) and Kaze Tachinu is already an acclaimed piece of art, that maybe reason enough to let the past in the past. Rearding technique is actually not true, Toy Story was made with 3D tech and is from 1995 while Spirited Away is from 2001 when digital animation was already mostly well stablished. About uniqueness, I think Kaze Tachinu is unique enough, as is not aways someone try to put up a (mostly) realistic biography of a real historic person, specially someone that could cause polemic for being a war hero from the loosing side of sorts, I at least have no recollection of anything of the kind....", "created_utc": "1380462225.0", "edited": "False", "id": "cchjd6g", "is_submitter": "True", "link_id": "t3_1nc4g8", "parent_id": "t1_cchbiwh", "score": "1", "subreddit": "anime", "subreddit_id": "t5_2qh22"}, {"author": "getsandom", "body": "I watched most of CLAMP(Kobato, Chobits, Sakura Card Captors Tsubasa Chronicle, xxxHolic) more than 2x. If you count movies I've watched everything Ghibli more than 10x (Nausicaa more than 20x for sure) except Grave of the Fireflies, amazing movie but I haven't got the guts to watch it again as it's just too sad. Another exception is Only Yesterday, got only half way through and is the only boring thing Ghibli ever made.", "created_utc": "1380404494.0", "edited": "False", "id": "cch7ovm", "is_submitter": "False", "link_id": "t3_1n7q0r", "parent_id": "t3_1n7q0r", "score": "1", "subreddit": "anime", "subreddit_id": "t5_2qh22"}, {"author": "getsandom", "body": "I don't know if any of you guys read the novels (I've got to volume 10 of SAO) but as far as I know [in the novels](/ln \"Kirito begins to work for a company that developed a way of storing the quantum information of a human brain and ways to interact with a living brain in a quantum level, this tech allowed then to accelarate the 'sensation of time' by more than 1000 times been the base of the tech in of the Brain Burst, also Kirito is going to na american university after highschool on a scholarship to work with the team that developed the brain implants they use in Accel. As Kirito and Asuna as parents of Kuroyukihime, the timming is actually good but the novels don't point this way so far\"). I have not readed Accel or the last 3 volumes because I'm studying japanese, I going to read then in the original so I know only the anime....", "created_utc": "1380237154.0", "edited": "False", "id": "ccg2wfv", "is_submitter": "False", "link_id": "t3_1mctwp", "parent_id": "t1_cc81o39", "score": "1", "subreddit": "swordartonline", "subreddit_id": "t5_2uikt"}, {"author": "getsandom", "body": "Run for it while is still online a [Baka-Tsuki](http://www.baka-tsuki.org/project/index.php?title=Sword_Art_Online) or wait to buy the official published translation....", "created_utc": "1380236100.0", "edited": "False", "id": "ccg2kim", "is_submitter": "False", "link_id": "t3_1mweui", "parent_id": "t3_1mweui", "score": "1", "subreddit": "swordartonline", "subreddit_id": "t5_2uikt"}, {"author": "getsandom", "body": "Still a waste of time...Why not go straight for full-dive instead of this dimwitted halfways??", "created_utc": "1380235821.0", "edited": "False", "id": "ccg2h8z", "is_submitter": "False", "link_id": "t3_1n3yzt", "parent_id": "t1_ccfjtmp", "score": "2", "subreddit": "swordartonline", "subreddit_id": "t5_2uikt"}, {"author": "getsandom", "body": "Here on Brazil is really hard to get anything other than blockbusters on theater, so I probably gonna have to wait for the Bluray release, but for what little I've seem he probably going for his 2nd Oscar with 'Kaze Tachinu'....", "created_utc": "1379716592.0", "edited": "False", "id": "ccccass", "is_submitter": "False", "link_id": "t3_1d4e5w", "parent_id": "t1_ccbv6pv", "score": "1", "subreddit": "Nausicaa", "subreddit_id": "t5_2rktw"}, {"author": "getsandom", "body": "Too bad master Miyazaki retired from the big screen but maybe we can get other pieces like the Nausicaa in manga since is more slow paced and less consuming for someone of his age than to produce than movies.....", "created_utc": "1379645379.0", "edited": "False", "id": "ccbu85p", "is_submitter": "False", "link_id": "t3_1d4e5w", "parent_id": "t1_ccbtlii", "score": "1", "subreddit": "Nausicaa", "subreddit_id": "t5_2rktw"}, {"author": "getsandom", "body": "The chamber was supposed to hold the humans from before the 7 Days of Fire, once Earth was restored to be habitable by then it would be inhabitable by the ones like Nausicaa because they were modified to survive in the wasted world and guard the chambre and then to be destroyed as a broken tool after the restoration. This is actually one of my favorite things about Miyazaki, his characters are neither good nor bad, simply human (when human). Just like in the begining of the story when she takes the bite from the fox-squirrel willingly but a few moments later kill 5 soldier in could blooded rage for having killed her father, Nausicaa is strong willed and decide to kill all the survivors from the past to preserve her own kind.....", "created_utc": "1379642496.0", "edited": "False", "id": "ccbtas9", "is_submitter": "False", "link_id": "t3_1d4e5w", "parent_id": "t3_1d4e5w", "score": "3", "subreddit": "Nausicaa", "subreddit_id": "t5_2rktw"}, {"author": "getsandom", "body": "Here on Brazil the rare ones are exactly the small ones, we call then 'abacates' (from awacatl in mayan I think). We have some 6/7 varieties and the smaller of then is a 2/3 pounds (1/1.5kg) fruit. My mother have a small strech of land with some fruit trees and we got some as big as a good sized melon.", "created_utc": "1379640409.0", "edited": "False", "id": "ccbslpa", "is_submitter": "False", "link_id": "t3_1mqr0q", "parent_id": "t3_1mqr0q", "score": "2", "subreddit": "pics", "subreddit_id": "t5_2qh0u"}, {"author": "getsandom", "body": "When I was to get my English to work, understanding spoken English was the main drag. Specially American English which deviates from textbook grammar a lot in casual conversation and is more fast paced in general. I solved it using my taste, I'd go and watch loads of shows(mainly TV series) at first with subs then after some time with a hearing vocabular good enough without the subs. Now that I'm learning Japanese the main drag is reading. Japanese often uses 3+ wrinting systems (2 kanas, kanji, roman chars, arabic numerals, etc) in a single period and it's a normal thing. The way I've been dealing with that is again using my tastes. I picked up one manga (Saki for those otaku enough to know) and I'm translating it to my native language. I'm now finishing the third volume and I can now translate some time 6/7 pages without help from a dictionary. I'd suggest you go with what suits your tastes as your main tool. It's always better whe its fun...", "created_utc": "1379471331.0", "edited": "False", "id": "ccaisec", "is_submitter": "False", "link_id": "t3_1mjiw7", "parent_id": "t3_1mjiw7", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "getsandom", "body": "You may find people interrested to exchange help at [Lang-8](http://lang-8.com/)", "created_utc": "1379470273.0", "edited": "False", "id": "ccaig7d", "is_submitter": "False", "link_id": "t3_1mbl8r", "parent_id": "t3_1mbl8r", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "getsandom", "body": "If you can take the gore you would like [Franken Fran](http://www.anime-planet.com/manga/franken-fran)...", "created_utc": "1379380705.0", "edited": "False", "id": "cc9tlfg", "is_submitter": "False", "link_id": "t3_1mfbjc", "parent_id": "t3_1mfbjc", "score": "1", "subreddit": "manga", "subreddit_id": "t5_2ql0i"}, {"author": "getsandom", "body": "Since you readed xxxHolic, have you read [Tsubasa Reservoir Chronicles](http://mangafox.me/manga/tsubasa_reservoir_chronicle/) yet?? if you have not, it should be your next one. The story is complementary to xxxHolic and explains a lot of what happens there. It's also the main tie-up on the CLAMP universe joining things as diverse as Chobits, X, Sakura Cardcaptors etc. All of CLAMP in a single story. Also, since you're looking for a long running one, is 28 volumes long (9 more than xxxHolic)...", "created_utc": "1379380339.0", "edited": "1379380533.0", "id": "cc9tgu2", "is_submitter": "False", "link_id": "t3_1mgq2e", "parent_id": "t3_1mgq2e", "score": "1", "subreddit": "manga", "subreddit_id": "t5_2ql0i"}, {"author": "getsandom", "body": "Right now, from recent memory, my current is Franken Fran. You just have to fall for the stitches and bolts......", "created_utc": "1379211088.0", "edited": "False", "id": "cc8iljz", "is_submitter": "False", "link_id": "t3_1ly2k7", "parent_id": "t3_1ly2k7", "score": "1", "subreddit": "manga", "subreddit_id": "t5_2ql0i"}, {"author": "getsandom", "body": "My favorite are actually tie of three titles.\nI love Nausicaä, the best work of the greatest animation genius ever(Hayao Miyasaki). And I love how xxxHolic and Tsubasa Resevoir Chronicles join the whole CLAMP universe and show that everything they ever draw/writen is related and exists in a vast multiverse... ", "created_utc": "1379210736.0", "edited": "False", "id": "cc8ihyu", "is_submitter": "False", "link_id": "t3_1lyhto", "parent_id": "t3_1lyhto", "score": "2", "subreddit": "manga", "subreddit_id": "t5_2ql0i"}, {"author": "getsandom", "body": "There is nothing as epic as the manga version o \"Nausicaä of the Valley of the Wind\". If you know anything about the Studio Ghibli movies you'll love this. Was writen and draw completely by none other than the just retired master Miyazaki himself.", "created_utc": "1379210423.0", "edited": "False", "id": "cc8ieup", "is_submitter": "False", "link_id": "t3_1m3fbt", "parent_id": "t3_1m3fbt", "score": "1", "subreddit": "manga", "subreddit_id": "t5_2ql0i"}, {"author": "getsandom", "body": "Here on Brazil only the very popular (Naruto , Bleach, One Piece, and so on) get to be released on press. Most of us go with scanlations. I do like the feeling of tha paper. I do have a few printed volumes I came across while travelling for work (none from the mainstream a cited before as my taste is both more refined & perverted than average) and as I love the feel of paper and the sensation of owning it I would have a lot more if they are published here, but they don't so most of what I've ever readed was digital....P.S. I HATE reading anything online so I download it.", "created_utc": "1379209830.0", "edited": "False", "id": "cc8i8pz", "is_submitter": "False", "link_id": "t3_1m7nhg", "parent_id": "t3_1m7nhg", "score": "1", "subreddit": "manga", "subreddit_id": "t5_2ql0i"}, {"author": "getsandom", "body": "I use [ComicRack](http://comicrack.cyolito.com/).\nIt has a very good, very customizable free cliente for Windows.\nIt has free and paid versions for iOS na Android.\nHas library functionality and you can sync your libraries across devices, supports most formats of comic books(cbz,cbt,cbr,cb7,pdf,WebComic).\nIt can put metadata into the archives (Author, Series, Volume,Parental Rating, and tons more).\nEven have scripting capabilities that allow those who can program to extend it, and some awesome comunity created scripts to for example create self-updating WebComics to get the latest chapter from your preffered online reader...\n", "created_utc": "1379208873.0", "edited": "False", "id": "cc8hyz7", "is_submitter": "False", "link_id": "t3_1meow6", "parent_id": "t3_1meow6", "score": "4", "subreddit": "manga", "subreddit_id": "t5_2ql0i"}, {"author": "getsandom", "body": "I really think they are going to make all of SAO into anime but be patient, it's going to take time. If you look at Shakugan no Shana, with 25 volumes took almost 10 years to get most of it animated into 3 long seasons(20+ eps). For SAO what were animated so far covers pretty thoroughly the first 4 volumes, if they keep up been detailed on the adaptation the next story arcs (current volume is #13) have already amassed story for 2 more seasons (for what I've readed possibly 3), So you have a decade to look up for at least. Also, don't know if you watched but, Accel World goes by the same original author and happens in the same universe as SAO (some 24+ years after) and already goes by volume 10+ last I've checked....", "created_utc": "1379187923.0", "edited": "1379188130.0", "id": "cc8bug5", "is_submitter": "False", "link_id": "t3_1m5ne9", "parent_id": "t1_cc660sq", "score": "1", "subreddit": "anime", "subreddit_id": "t5_2qh22"}, {"author": "getsandom", "body": "The one thing I'm most excited about is Wan, the first Avatar. If anything else, should clear na old theory I had in mind since The Last Airbender. The giant Lion-Turtle that taught Aang to spirit-bend is the animal guide to the first Avatar.", "created_utc": "1379042041.0", "edited": "False", "id": "cc7c62f", "is_submitter": "False", "link_id": "t3_1m0fd4", "parent_id": "t3_1m0fd4", "score": "2", "subreddit": "TheLastAirbender", "subreddit_id": "t5_2rybx"}, {"author": "getsandom", "body": "First, tecnically, being na anime it have nothing to do with the staff. Heroman was created and partially writen by none other than Stan Lee (yes, the one you are thinking) but is an anime for being released originally in Japan. \nSecond there are 2 points to the discussion, the Avatar franchise is heavily influenced by anime though not being it itself. And the show is so good that even hardcore anime fans (otakus such as myself) consider it great, which is rare(read as non-existent). Anime fans tend to ignored american animation (most is actually garbage), I myself have not seen anything worth my time  (aside Avatar) since Samurai Jack, thus people discuss if its not na anime because anime fans watch it also....", "created_utc": "1379040837.0", "edited": "False", "id": "cc7bq6r", "is_submitter": "False", "link_id": "t3_1m53gs", "parent_id": "t1_cc625bz", "score": "1", "subreddit": "TheLastAirbender", "subreddit_id": "t5_2rybx"}]