[{"author": "GiantCuddlyPenguin", "body": "I was interested in it until I learned about the dialect fragmentation. Didn't want to spend 5 years studying Egyptian Arabic just to realize that I would still have difficulties communicating in the Levant", "created_utc": "1664693255.0", "edited": "False", "id": "iqpyptf", "is_submitter": "False", "link_id": "t3_xs67lx", "parent_id": "t1_iqpf6ax", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "GiantCuddlyPenguin", "body": "You need a lot more time to get to a high level (B2 and above) than you think.  \nPlenty of people expect to attend a course twice a week and become fluent. In reality, you're probably going to need several years of constant, almost daily work to get good. Try to economize your time as far as possible: reading on public transport is an excellent \"free\" way to get more study time in, for instance. \n\nVocabulary will be a massive wall at some points. My breakthrough from low B2 to solid C1 only happened once I started using Anki religiously every day.\n\nAt the intermediate stages, dubbed content might be better for practicing listening than native content since the dub speakers tend to speak more clearly. This is especially true for dramas.", "created_utc": "1664553048.0", "edited": "False", "id": "iqigi51", "is_submitter": "False", "link_id": "t3_xrz4tt", "parent_id": "t3_xrz4tt", "score": "15", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "GiantCuddlyPenguin", "body": "The fight has been cleared with a warrior + smn in the party with a DNC death, with allegedly no tome weapon (see video description):\n\n[kill video](https://www.youtube.com/watch?v=hAara8ZzcRo&t=254s)\n\nIs the DPS check tight? Yea. Is it so tight that it's impossible to clear without a tome weapon and a perfect comp? This video is empirical truth that it's not, assuming it's telling the truth about the tome weapon.\n\nPF will struggle week 1, but then, it always has. It'll be perfectly doable week 2 +.", "created_utc": "1662076130.0", "edited": "False", "id": "imqa7p1", "is_submitter": "False", "link_id": "t3_x32b5d", "parent_id": "t1_imnujfy", "score": "9", "subreddit": "ffxivdiscussion", "subreddit_id": "t5_22ly7r"}, {"author": "GiantCuddlyPenguin", "body": "You might experience some slow queues in the early afternoon, but they should start picking up towards the evening. If you mostly play at 8pm ish, then Materia would indeed be a good choice for a new Aussie player. Would suggest Ravana/Sophia/Sephirot for servers that are more populated, to make it easier to find a Free Company to start your journey with.", "created_utc": "1657528596.0", "edited": "False", "id": "ifp7inz", "is_submitter": "False", "link_id": "t3_vwbm3w", "parent_id": "t1_ifp6ke8", "score": "3", "subreddit": "ffxiv", "subreddit_id": "t5_2rgs7"}, {"author": "GiantCuddlyPenguin", "body": "If you play largely during OCE prime time (eg. Weekday evenings), then, as many mentioned, Materia is a good choice, especially for new players.\n\n  \n\n\nHowever, if you play mostly during off hours (eg. A lot of weekday morning and afternoon gaming) then Materia will likely NOT be a good choice due to the lower overall population and lack of people playing in alternate timezones compared to the other datacenters. In this situation, consider NA servers or Tonberry/Kujata/Typhon in the Elemental data centre.", "created_utc": "1657527111.0", "edited": "False", "id": "ifp5s0c", "is_submitter": "False", "link_id": "t3_vwbm3w", "parent_id": "t3_vwbm3w", "score": "1", "subreddit": "ffxiv", "subreddit_id": "t5_2rgs7"}, {"author": "GiantCuddlyPenguin", "body": "Hmm, Materia has never seen the release of a new raid tier, and I think there is a massive difference between progging a tier fresh, and progging a tier when there are multiple bored, geared helpers around to help out.\n\nTo provide some context, in Elemental even before OCE released, if you exclusively PF, you run a high risk of falling into the \"middle tier trap\". A very small group of highly skilled PF people will rush the tier and clear it week 1 or week 2. If you couldn't start on day 1, couldn't match their pace, or didn't get into their groups, you might clear the third floor by week 2....then you'll be stuck on the fourth floor till week 4/5, simply because you just cannot find enough competent people to fill the groups until gear gets better and average midcore statics clear and came to PF to help out. Either that, or you set your client to JP and try to sneak into JP parties to hopefully find better people.\n\nThis problem will likely exist on steroids when the new tier releases on Materia, which will likely make progging outside of statics quite a significant challenge. The frustration might cause many to rethink whether to stay on materia. Anecdotally, when part of my friend group transferred to Materia day 1, they had to wait 3 weeks for other people on Elemental to level alts on Materia to even begin to prog P4S, simply because there wasn't enough experienced people back then.\n\nMoreover, the fundamental problem still exists: If one wants to do more than merely clear the tier, but is looking for a Week 1 group, Ultimate group, or competent 95+ or even purple+ parse party, then OCE will still be a tough neighborhood unless you already have connections or are very, very good at making them.", "created_utc": "1656599249.0", "edited": "1656599534.0", "id": "ieblw91", "is_submitter": "False", "link_id": "t3_vo71o6", "parent_id": "t1_iebhnbj", "score": "5", "subreddit": "ffxivdiscussion", "subreddit_id": "t5_22ly7r"}, {"author": "GiantCuddlyPenguin", "body": "Yup! A lot of Taiwanese players are on Typhon, and the Mana DC is currently in a culture war with the flock of mainland Chinese players who are on Asura.\n\n  \n\n\nCurrently, Kujata and Tonberry play host to the vast majority of English speaking SEA players (PH, SG, MY, Indonesia etc), so you could say that these enclaves already exist on Elemental.", "created_utc": "1656597240.0", "edited": "False", "id": "iebh5zc", "is_submitter": "False", "link_id": "t3_vo71o6", "parent_id": "t1_iebexjr", "score": "5", "subreddit": "ffxivdiscussion", "subreddit_id": "t5_22ly7r"}, {"author": "GiantCuddlyPenguin", "body": "Wall of text warning!\n\nI think it really depends on what one means by viable.  \n\n\nFor the vast majority of casual players who play solely in OCE prime time, I think Materia will be...fine? If all one does is hang around, socialize, do roulettes, maybe do some of the current patch content, materia should have a decent enough population to support that. It's also a heaven for those who want to get a house.\n\n  \n\n\nThe issues start when one starts to want to do more specific content that requires multiple people to have certain skill sets and commit. Want to do Dragonsong's Reprise? Welp, only 4 groups (32 people total) have cleared across the entire DC, so good luck finding a group of 8 people competent enough to clear it if you aren't already in the \"in gang\". A single small JP server like Unicorn has more clears than that. Want to do parse parties? The talent pool is so shallow that you will be hard pressed to find good people. Want to do delubrum savage? Start your own 24 hour RP Cafe? Host a major RP production play? Run a musical festival and invite many musical groups? Do something in the off hours? It's possible.. but much, much more difficult on materia.\n\nThe fact remains that the DC is targeted only at the OCE region, which really isn't that large population wise to begin with. Add to that the lateness of its release, the HORRIBLE timing, and the lack of DC travel, things will remain difficult for quite a while.\n\nFor savage players, 6.2, I think, is when the hopium will either play out or run out. If by 6.2 the savage capable population doesn't grow significantly, then savage players will likely start to transfer off. One could say that these people should stay and grow the community and all that, but in the end, it's a video game. Asking people to effectively struggle to play for 2 years just to wait for the population to grow is a hard ask, especially if they already have ties somewhere else on JP or NA.\n\n  \n\n\nTl;DR Fine for casual play, tough for serious group play of any sort. 6.2 will likely start a virtuous spiral of growth, or a death spiral for sub-communities on OCE, especially raiders. Only time will tell.", "created_utc": "1656596992.0", "edited": "False", "id": "iebglq5", "is_submitter": "False", "link_id": "t3_vo71o6", "parent_id": "t3_vo71o6", "score": "8", "subreddit": "ffxivdiscussion", "subreddit_id": "t5_22ly7r"}, {"author": "GiantCuddlyPenguin", "body": "SEA wouldn't move to materia even if it changed. The ping will be largely identical to JP and to Aus even in the best case scenario, and the vast majority of SEA already have strong roots in JP. For people in Malaysia northwards, ping to JP will already start to be slightly better than Aus", "created_utc": "1656595974.0", "edited": "False", "id": "iebechd", "is_submitter": "False", "link_id": "t3_vo71o6", "parent_id": "t1_ieba6ri", "score": "6", "subreddit": "ffxivdiscussion", "subreddit_id": "t5_22ly7r"}, {"author": "GiantCuddlyPenguin", "body": "Kujata is the main alternate English speaking server on elemental. Most of the other servers have at least some English speaking players though", "created_utc": "1656380231.0", "edited": "False", "id": "ie02xns", "is_submitter": "False", "link_id": "t3_vlyqpt", "parent_id": "t1_idzx01k", "score": "4", "subreddit": "ffxiv", "subreddit_id": "t5_2rgs7"}, {"author": "GiantCuddlyPenguin", "body": "I think many of them genuinely are/were interested in serving the public.\n\n  \n\n\nIt's just that after they start work, they realize that a large portion of their work has nothing to do with serving the public at all. Just ask a current civil servant on how much time is spent on paperwork, staff work, and making sure everything is pristine for audits.", "created_utc": "1654745999.0", "edited": "False", "id": "iboxxhv", "is_submitter": "False", "link_id": "t3_v7kgie", "parent_id": "t1_ibloncg", "score": "1", "subreddit": "singapore", "subreddit_id": "t5_2qh8c"}, {"author": "GiantCuddlyPenguin", "body": "I should have been clearer in this context: Navalny is firmly against \\*the current war in Ukraine\\*. This is a fact.  That's the limit of my claim.  \n\n\nAs for his other views, I am not well versed enough to comment, though a quick search suggests that his views might have evolved/changed over the years (https://www.newyorker.com/news/our-columnists/the-evolution-of-alexey-navalnys-nationalism)", "created_utc": "1649994530.0", "edited": "False", "id": "i4shwgh", "is_submitter": "False", "link_id": "t3_u3xeri", "parent_id": "t1_i4sgz2i", "score": "2", "subreddit": "worldnews", "subreddit_id": "t5_2qh13"}, {"author": "GiantCuddlyPenguin", "body": "Go to petting zoo. Charge for cuddles. Get rich.", "created_utc": "1649991335.0", "edited": "False", "id": "i4sbsol", "is_submitter": "False", "link_id": "t3_u3hbuv", "parent_id": "t3_u3hbuv", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "GiantCuddlyPenguin", "body": "No, he is not. Navalny is firmly anti-war.   \n\n\nSource: His own YouTube and Telegram channels.", "created_utc": "1649990397.0", "edited": "False", "id": "i4s9wfh", "is_submitter": "False", "link_id": "t3_u3xeri", "parent_id": "t1_i4s7q2d", "score": "31", "subreddit": "worldnews", "subreddit_id": "t5_2qh13"}, {"author": "GiantCuddlyPenguin", "body": "I vividly recall having a conversation with some close friends. They were, and are, perfectly nice and educated people.  \n\n\nI asked them what they would do if they received what, to them, was a clear message from God telling them to kill someone innocent, like a child. After much avoiding (\"oh God would never tell us to do that..\"), they told me that they would follow God's command in the end.   \n\n\nThat was when I truly realized how dangerous unquestioning faith can be. It allows even ordinarily good, kind people to be manipulated to heinous ends.", "created_utc": "1649696762.0", "edited": "False", "id": "i4beatq", "is_submitter": "False", "link_id": "t3_u1750s", "parent_id": "t3_u1750s", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "GiantCuddlyPenguin", "body": "For my TL (Russian), in my experience, listening has the highest ceiling while speaking has the highest floor.\n\nI can understand the vast majority of speakers in news, podcasts, YouTube videos and dubbed shows., but some native TV shows and movies are ludicrously difficult. Especially when they use a large amount of slang and are whispering in a typhoon for some reason. Doesn't help that Russian native content basically never has subtitles in Russian. This skill is the hardest to master by far.\n\nSpeaking has the highest \"floor\" to be considered fluent in my experience. Some people including me are just not great at talking to begin with, and having to do so in a foreign language is just...hard. It's very easy to get confused and/or make grammatical mistakes while trying to conjure a sentence up on the spot, and that doesn't even incluse the difficulties of pronunciation.", "created_utc": "1646285439.0", "edited": "False", "id": "hz5cduc", "is_submitter": "False", "link_id": "t3_t4rdq8", "parent_id": "t3_t4rdq8", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "GiantCuddlyPenguin", "body": "The only thing that will be a sizable boost to Materia's growth is if cross-region DC travel and play is allowed and made very easy to access. This would make the switch much easier for most.  \n\n\nOther than that, the fundamentals of the Materia DC launch were just poor to begin with, as it was launched 10 years into the game's lifespan, was launched halfway through a raid tier, and is  worse ping and timezone wise for the sizable SEA population, which in other games would find a natural home in OCE.   \n\n\nWithout cross-region DC travel, all one can do is hope that there is a massive wave of people held up on JP/NA due to statics and will start transferring over close to 6.1.  It's still too early to tell how the population on Materia is doing. If the population is still horrible when the 6.2 tier launches, that's personally when I think that talk about \"oh it will fill up eventually given time/when x happens\" is just copium, and people ought to start reconsidering whether they want to stay on Materia if SE doesn't do something about it.", "created_utc": "1644380240.0", "edited": "False", "id": "hw6kyw6", "is_submitter": "False", "link_id": "t3_sne0et", "parent_id": "t3_sne0et", "score": "3", "subreddit": "ffxivdiscussion", "subreddit_id": "t5_22ly7r"}, {"author": "GiantCuddlyPenguin", "body": "Not sure which server you're on, but there are quite a lot of English speakers and English FCs left on Tonberry, Kujata and Typhon(?) . That could be one option to consider. \n\n120ms on OCE would definitely be playable, but would definitely be a huge difference compared to 5ms. Timezone is another very important factor to consider; there will be times of the year when Aus has DST and become 2 hours ahead of JP, which could be a problem if you get off work late regularly.\n\nWould rule out NA just due to timezone alone unless you have an uncommon working schedule.", "created_utc": "1643412941.0", "edited": "False", "id": "hungskk", "is_submitter": "False", "link_id": "t3_sephw3", "parent_id": "t3_sephw3", "score": "2", "subreddit": "ffxivdiscussion", "subreddit_id": "t5_22ly7r"}, {"author": "GiantCuddlyPenguin", "body": "Apparently if you're on starhub or M1 the ping to OCE is about 20ms higher.\n\n  \n\n\nIf you're on singtel the ping to OCE is like twice that to elemental.", "created_utc": "1643107657.0", "edited": "False", "id": "hu4zpl0", "is_submitter": "False", "link_id": "t3_s9z8uj", "parent_id": "t1_hu4y1si", "score": "1", "subreddit": "ffxiv", "subreddit_id": "t5_2rgs7"}, {"author": "GiantCuddlyPenguin", "body": "Yep! What I do for Russian is that I keep replaying the same parts I don't understand multiple times. If after that I still don't get it, I find a version with English or Russian subtitles(not a lot of shows with Russian subs though) , watch that, then listen again to see if I can pick up the words now that I have more context.\n\n  \n\n\nThat said, personally I have also come to the realization that sometimes, the person on screen might just not be speaking clearly 😅 Just like bad handwriting, sometimes it's just hard for everyone, learner or native.", "created_utc": "1643035437.0", "edited": "False", "id": "hu0urt5", "is_submitter": "False", "link_id": "t3_sbabo6", "parent_id": "t1_hu06g2u", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "GiantCuddlyPenguin", "body": "If it makes you feel better, I'm an English native speaker, and I \\*still\\* don't get a lot of dialogue in some shows. I remember trying to re-watch the movie \"Dunkirk\" recently and just couldn't understand a good part of the dialogue.\n\n  \n\n\nThis can be due to a variety of reasons, the most notable being: unfamiliar accents, background noise in the video muffling speech, use of slang, and unclear, uttered speech with syllables that get skipped. Listening more to various kinds of speakers in different settings, preferably with a speech transcript for you to check against, is pretty much the only way.\n\n  \n\n\nIt's a long hard slog. I'm in the same boat as you too, but with Russian. I can understand what's said in documentaries, interviews, podcasts, dubbed videos and YouTube videos just fine, but then struggle when it comes to watching Russian dramas.", "created_utc": "1643010575.0", "edited": "1643010967.0", "id": "htztbsf", "is_submitter": "False", "link_id": "t3_sbabo6", "parent_id": "t3_sbabo6", "score": "6", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "GiantCuddlyPenguin", "body": "Depends on where you are. If SG or Indo, ping will be about 20 ms better to JP than to Aus. The further north you go, the better JP will be.\n\n  \n\n\nAlso depends on ISP routing. For some ISPs ping to Sydney is 50ms worse than to Tokyo for some reason if you don't use a VPN to get better routing.", "created_utc": "1642983645.0", "edited": "False", "id": "htyadbd", "is_submitter": "False", "link_id": "t3_s9z8uj", "parent_id": "t1_htur749", "score": "1", "subreddit": "ffxiv", "subreddit_id": "t5_2rgs7"}, {"author": "GiantCuddlyPenguin", "body": "All we know so far is that there is a very strong incentive for OCE to move, and a very weak incentive for SEA to move. No one can know for sure what the EN population will be like in 5 months' time.\n\nBesides, the relative percentage of JP:EN parties does not matter; the absolute number of EN parties does. I don't care if there are 100 JP parties for every 10 EN P4S parties on PF. It only becomes a problem if there are consistently no EN parties on PF, regardless of the number of JP parties.\n\nMoreover, JP Duty Finder is perfectly fine for clearing at least the first 3 floors of each tier regardless of your chosen language, which is an advantage that's not often talked about for reclears.", "created_utc": "1642925929.0", "edited": "False", "id": "htuw87o", "is_submitter": "False", "link_id": "t3_s9cqom", "parent_id": "t1_htuva8j", "score": "2", "subreddit": "ffxivdiscussion", "subreddit_id": "t5_22ly7r"}, {"author": "GiantCuddlyPenguin", "body": "There will definitely be a change in the status quo but likely nothing as drastic as 99% JP Only, at least for now.  \n\n\nSEA + TW probably makes up at least half of the EN speaking population on Elemental, if not a decent majority. OCE DC will definitely have a worse time zone for SEA compared to JP, and likely worse ping as well. From what I can tell, a staggering majority of SEA/TW players I know on Elemental have no intention to move as OCE is a strictly inferior option in every aspect except language. Unless, of course,  SE throws us a curveball and puts the servers in Perth or Singapore.   \n\n\nIt is however, a certainty that the number of EN parties in Elemental will decrease. The main question then comes to whether the SEA + OCE left on Elemental will be enough to sustain a healthy population, which is a question that no one can really answer until 4-5 months down the road. The worst outcome for everyone is if the population splits but neither the OCE migrants or the remainers on SEA + OCE are large enough to sustain a healthy population, leading to a slow death spiral for both communities, at least for more niche activities such as savage raiding.", "created_utc": "1642924818.0", "edited": "False", "id": "htuuqaq", "is_submitter": "False", "link_id": "t3_s9cqom", "parent_id": "t1_hturx86", "score": "2", "subreddit": "ffxivdiscussion", "subreddit_id": "t5_22ly7r"}, {"author": "GiantCuddlyPenguin", "body": "A decent chunk of OCE people I know are moving, but a very sizable chunk are staying on NA/JP too. Main concerns against moving are:\n\n  \n\n\n1) Breaking up existing social connections (since cross region DC is not a thing for now and may not happen at all since they are still considering it) \n\n2) People already having medium/large houses and not wanting to lose those\n\n3) Perhaps most importantly, population. We will see on Tuesday, but it is highly likely that ping to the OCE server will be worse for SEA than to JP. This will make many SEA reluctant to move, which means that the OCE DC will be populated largely only by Aus/NZ.\n\nPersonally? I am highly doubtful that Aus+NZ, with a combined population about that of Malaysia's, will be a large enough player base. There will certainly be enough people to play with, but if you're looking for more specific content like high end raiding, it will almost certainly be more difficult to find like minded players. It is for this reason that most serious OCE raiders that I personally know are keeping their mains in JP/NA for now, particularly since they're still doing reclears with their statics.\n\n  \n\n\nThat said, new OCE or SEA players might gravitate towards the OCE servers since it would seem to be the most obvious choice to them. Only time will tell whether the OCE servers are successful, or end up relatively barren like in Wow (where the servers had to be joined, and that's with OCE servers there being the best choice ping and time zone wise for SEA too). For now, my friends and I might send alts there to sniff around, and make a more informed decision down the road.", "created_utc": "1642783051.0", "edited": "1642783857.0", "id": "htm7o39", "is_submitter": "False", "link_id": "t3_s9cqom", "parent_id": "t3_s9cqom", "score": "28", "subreddit": "ffxivdiscussion", "subreddit_id": "t5_22ly7r"}, {"author": "GiantCuddlyPenguin", "body": "Yea, unfortunately most statics want some experience. The way to do it would be to suffer through party finder for one tier, then use that experience to apply for a static the next tier.", "created_utc": "1642160413.0", "edited": "False", "id": "hsm7z5e", "is_submitter": "False", "link_id": "t3_s3j72p", "parent_id": "t1_hsm2sqv", "score": "1", "subreddit": "ffxiv", "subreddit_id": "t5_2rgs7"}, {"author": "GiantCuddlyPenguin", "body": "I don't think anyone is questioning whether the OCE server is good for OCE players. Most will agree that it is on paper.\n\n  \n\n\nThe question is whether the OCE player base is large enough to support a sizable community, particularly for those playing at the higher end of savage/ultimate content.\n\n  \n\n\nWoW's Oceanic servers are linked to NA, if I'm not mistaken, which was my original point. And that's with SEA players choosing OCE over other regions on WoW too.\n\n  \n\n\nSo yes, I am aware that Oceania does not include Asia. And that's exactly the issue. In other games (eg. Wow) Oceanic servers played host to both OCE AND SEA populations and still had population issues. Now ff14's OCE will launch, but without the sea population moving.\n\n  \n\n\nDoes SE know something that I do not? Most likely. But judging from the status of OCE populations in other games, people are rightfully wary about whether just OCE without SEA will be able to support a healthy DC population.\n\n  \n\n\nAlso, transferring has costs. For one, if you transfer to a server labeled \"new“, I believe there is a time lock before you can transfer back. Also, you might have to lose your house or leave your static to transfer.", "created_utc": "1642153587.0", "edited": "False", "id": "hslywij", "is_submitter": "False", "link_id": "t3_s3j72p", "parent_id": "t1_hslxnkx", "score": "1", "subreddit": "ffxiv", "subreddit_id": "t5_2rgs7"}, {"author": "GiantCuddlyPenguin", "body": "They may have the data but they may not necessarily be interpreting the data correctly.\n\n  \n\n\nIf they, for instance, calculated their numbers with the expectation that the SEA population will move to the OCE servers when they launch, they may be in for a very nasty surprise. Staying in JP will be a better option ping, timezone and established social networks wise.\n\n  \n\n\nHistorically, OCE servers in MMOs and most other games have had very low populations, to the extent that those servers end up having to be linked to ones in other regions.", "created_utc": "1642151198.0", "edited": "False", "id": "hslvvfy", "is_submitter": "False", "link_id": "t3_s3j72p", "parent_id": "t1_hslofr1", "score": "3", "subreddit": "ffxiv", "subreddit_id": "t5_2rgs7"}, {"author": "GiantCuddlyPenguin", "body": "I have 3 tutors. With 2 of them, I just jump right into a conversation to practise speaking. With the third, I write up an essay beforehand and have her correct my writing during the lesson. Works pretty well for me", "created_utc": "1638505143.0", "edited": "False", "id": "hn10ldt", "is_submitter": "False", "link_id": "t3_r66c1m", "parent_id": "t3_r66c1m", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "GiantCuddlyPenguin", "body": "First and maybe second week allocate bis to DPS to make dps checks easier. Week 3 and maybe week 4 will be priority to tanks or healers.\n\n  \n\n\nAfter that it's one item per floor based on BIS. For the random weapon drops from the fourth floor, we have people list down beforehand a couple of alt jobs they want to play and they get priority on those, rolling only against others who have those alt jobs listed as well. This is to avoid people rolling on everything for shits and giggles. Tome upgrade items are round robin; each person only gets one of each every eight weeks, regardless of bis requirements.\n\n  \n\n\nIs this the most efficient way to make reclears easier? Nope. Is this the best balance we have found between making reclears easier, making T/H players not feel shortchanged, and not put all our eggs in one basket if we have members in the static whom we are not familiar with? Yep. Human relations are the hardest boss. Loot rules that minimize drama and minimize the impact of drama once it happens tends to work better than loot rules solely focused on clear efficiency in my experience.", "created_utc": "1635207291.0", "edited": "False", "id": "hi1xot0", "is_submitter": "False", "link_id": "t3_qfcnxe", "parent_id": "t3_qfcnxe", "score": "1", "subreddit": "ffxivdiscussion", "subreddit_id": "t5_22ly7r"}, {"author": "GiantCuddlyPenguin", "body": "Where exactly will the OCE servers be located? Will any existing servers automatically be moved to the OCE DC?", "created_utc": "1632190718.0", "edited": "False", "id": "hdo5dsz", "is_submitter": "False", "link_id": "t3_ps7ivc", "parent_id": "t3_ps7ivc", "score": "-2", "subreddit": "ffxiv", "subreddit_id": "t5_2rgs7"}, {"author": "GiantCuddlyPenguin", "body": "The OCE DC is a bad idea at this stage of the game, assuming the servers are in Sydney.\n\n  \n\n\n1) SEA players have a better choice time zone and ping wise in JP than Sydney. So, unlike WoW, OCE servers won't have SEA players to buttress the pop.\n\n2) Unlike WoW, which had OCE Designated servers to congregate relevant players from the start (even if the servers were not physically in OCE), current players already have long roots in NA/JP that will be hard to pluck.\n\n3) Cross region DC travel is unlikely to launch with OCE, if ever, which forces people to choose between better ping or their friends upon launch.\n\nUltimately, I forsee OCE being bereft of players, with long queue times for basic roulettes and a dearth of good players for harder content. The EN community on JP will also be sundered, to the detriment of those who are staying in JP.", "created_utc": "1632190149.0", "edited": "False", "id": "hdo46u3", "is_submitter": "False", "link_id": "t3_prwdkf", "parent_id": "t3_prwdkf", "score": "0", "subreddit": "ffxiv", "subreddit_id": "t5_2rgs7"}, {"author": "GiantCuddlyPenguin", "body": "I haven't been to evolve, so I can't comment on what makes one better than the other. That said, FAMA's instructors have a well planned curriculum, and the partners and people there have been nothing but welcoming and helpful. Best to try both gyms' trial period and see which one fits you better", "created_utc": "1623769092.0", "edited": "False", "id": "h1urqrb", "is_submitter": "False", "link_id": "t3_n0xo93", "parent_id": "t1_h1tghcr", "score": "3", "subreddit": "bjj", "subreddit_id": "t5_2qn02"}, {"author": "GiantCuddlyPenguin", "body": "This is in the right direction but not totally correct.\n\nRegen does not need to be up 100%, nor do you want to use it as much as possible.   While very strong, it is still a GCD that incurs an oportunity cost. At high levels, regen is very rarely used with a competent, geared tank. It should only be used when a) someone is taking very, very significant damage, b)i f you need to heal up one particular person (eg. someone who just rezzed) and you don't have any more efficient tools or c) during progression in difficult content, where you just want to be safe to see more mechanics.\n\nPast level 74, when you get afflatus misery, your priority should be OGCDs > Lilies > Regen > Cure II. You'll often let people drop a little lower to combo lilies + ogcds for a big burst heal, since weave windows are otherwise rare for WHM.\n\nBefore level 74, before you get afflatus misery, then yes, the priority should be OGCDs > Regen > Lilies > Cure II, since without misery, lilies are just another GCD.\n\nEdit: I should also add that in reality, things are a little more complicated due to the all or nothing nature of afflatus misery charges. Afflatus Solace/rapture are only \"discounted\" gcds if, by the end of the fight, you get to cash out on afflatus misery. But that's a level of optimization for much higher tiers of play.\n\nTL;DR: Regen is strong and good, but there is no need too keep it up 100% if you're talking about optimization. That said, if you're just playing casually, nothing wrong with just keeping regen up and going to town with damage spells - that still makes you better than like...80% of WHMs you'll run into", "created_utc": "1622939080.0", "edited": "1622939626.0", "id": "h0qsd2f", "is_submitter": "False", "link_id": "t3_nsxerf", "parent_id": "t1_h0ql1fw", "score": "15", "subreddit": "TalesFromDF", "subreddit_id": "t5_21q0in"}, {"author": "GiantCuddlyPenguin", "body": "Even for sg, Malaysia and Indonesia(maybe, have not tested for Indonesia), ping to Tokyo is much better than ping to Sydney. This is likely due to poor routing issues. For sg, the ping to Tokyo can be 20ms faster, or even 50ms faster.\n\n  \n\n\nFor the other sea countries, ping to Tokyo is so much better, it's not even close.\n\nIf the oceanic data centre is located in Sydney, then people in SEA will have a very difficult choice to make", "created_utc": "1621125270.0", "edited": "False", "id": "gy9uh1c", "is_submitter": "False", "link_id": "t3_ncphwh", "parent_id": "t1_gy7f0g2", "score": "2", "subreddit": "ffxiv", "subreddit_id": "t5_2rgs7"}, {"author": "GiantCuddlyPenguin", "body": "The main idea of my comment stands and was not directed at your performance personally. It was directed at your statement of a) a healer who only heals in not playing technically wrong, as he is fulfilling her role and b) it is not someone's prerogative to call someone out when they are playing wrong.\n\n  \n\n\nMy hypothetical scenario shows that is is perfectly possible for everyone to play strictly \"according to their role\" - my tank holds aggro and nothing more, my dps just does a tiny bit of dps, and no more - and still lead to a horrible experience for everyone. And if someone is dragging down everyone else, even if it's a game, everyone else has the right to call them out, just like how I would not like to play soccer with someone who insists on only walking and kicking with their left leg once a minute.", "created_utc": "1620002213.0", "edited": "False", "id": "gwq8r64", "is_submitter": "False", "link_id": "t3_n37fb5", "parent_id": "t1_gwq6c47", "score": "5", "subreddit": "ffxiv", "subreddit_id": "t5_2rgs7"}, {"author": "GiantCuddlyPenguin", "body": "Let's imagine a dungeon run together with my friends. You can heal. I'll play a tank. I'll hit the mobs JUST enough to maintain aggro and nothing more. My 2 dps friends will hit their single target dps button maybe once every 10 seconds.\n\n  \n\n\nWe're all fulfilling our role here. I maintain aggro, you heal, my friends are doing damage. But this dungeon run is probably going to take 45 minutes,if not more. Triple the usual time.\n\n  \n\n\nThere is absolutely a \"wrong\" way to play. You can choose to continue playing that way - it's a game, it's your choice, but other people are also absolutely right in calling you out for not pulling your own weight in the group.", "created_utc": "1620000242.0", "edited": "False", "id": "gwq54dg", "is_submitter": "False", "link_id": "t3_n37fb5", "parent_id": "t1_gwprug1", "score": "7", "subreddit": "ffxiv", "subreddit_id": "t5_2rgs7"}, {"author": "GiantCuddlyPenguin", "body": "For Clarke Quay, FAMA is very good. Excellent instruction, diverse rolling partners and good schedule. Vibe is very chill, welcoming and helpful. Would highly recommend trying it out", "created_utc": "1619763298.0", "edited": "False", "id": "gwe88jo", "is_submitter": "False", "link_id": "t3_n0xo93", "parent_id": "t3_n0xo93", "score": "3", "subreddit": "bjj", "subreddit_id": "t5_2qn02"}, {"author": "GiantCuddlyPenguin", "body": "It's a tried and tested sales tactic to get you to experience the service first. If you tried the service and like it, you are less likely to be put off by the price. BJJ gyms in particular tend to do this, since BJJ tends to cost more than other martial arts, from my experience.", "created_utc": "1611557497.0", "edited": "False", "id": "gkomqho", "is_submitter": "False", "link_id": "t3_l4hzey", "parent_id": "t3_l4hzey", "score": "18", "subreddit": "bjj", "subreddit_id": "t5_2qn02"}, {"author": "GiantCuddlyPenguin", "body": "Final Fantasy X captured my imagination from the very start when To Zanarkand started playing, and never really fully let it go even after all these years.", "created_utc": "1596646526.0", "edited": "False", "id": "g0goeyt", "is_submitter": "False", "link_id": "t3_i434d5", "parent_id": "t3_i434d5", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "GiantCuddlyPenguin", "body": "Hey, I'll actually be OK with what spawns =)", "created_utc": "1591663392.0", "edited": "False", "id": "ftfeps9", "is_submitter": "False", "link_id": "t3_gz52ae", "parent_id": "t3_gz52ae", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "GiantCuddlyPenguin", "body": "The English speaking SEA Community tends to play on the Elemental Data Centre. Tonberry has the largest English speaking community, followed by Kujata.\n\n  \n\n\nNot sure how the ping would be like for you ; you could try pinging the data centers and see for yourself at [https://arrstatus.com/](https://arrstatus.com/)", "created_utc": "1589367297.0", "edited": "False", "id": "fqh49q7", "is_submitter": "False", "link_id": "t3_giwfob", "parent_id": "t3_giwfob", "score": "2", "subreddit": "ffxiv", "subreddit_id": "t5_2rgs7"}, {"author": "GiantCuddlyPenguin", "body": "Just managed to pug clear E8S, and light rampant was easily the biggest hurdle in the progging process. Just a few reasons why:\n\n1) It needs all 8 people to perform the mechanic properly, with any mistake usually leading to a wipe. Assuming that everyone only screws up 1/20 times, that still leads to a 1/3 chance to wipe on average overall if my math is not wrong. And a lot of people screw up more than 1 in 20 times.\n\n  \n\n\n2) The Illya strat (equivalent to milne on JP servers, if I'm not mistaken) seems simple, but has a lot of slight adjustments that a lot of people will not get if they just blindly follow the strat. Eg. The need to wait for a GCD after protean before rotating for orbs, need to stand at the back of second towers to avoid popping orbs too early, need to fan out in a proper v shape after second towers, and the need for chains to squish after the debuff is gone.\n\nSwitching to the Ayatori strategy popular on JP servers massively increased my pug groups' success rates on LR, but if it's not widespread on your server then it's just a matter of grinding it out. My clear group used the illya/milne strat.", "created_utc": "1584853515.0", "edited": "False", "id": "fl63sfg", "is_submitter": "False", "link_id": "t3_fmsn4a", "parent_id": "t3_fmsn4a", "score": "8", "subreddit": "ffxiv", "subreddit_id": "t5_2rgs7"}, {"author": "GiantCuddlyPenguin", "body": "Zyrk's Guide to the Principles of Healing is essential reading for any healer thinking of getting into Higher end content.\n\nBesides that, as others said, check out the balance discord; it has all you need, including the aforementioned guide.\n\nGood luck in savage!", "created_utc": "1581642606.0", "edited": "False", "id": "fhjc8ya", "is_submitter": "False", "link_id": "t3_f3jnj6", "parent_id": "t3_f3jnj6", "score": "5", "subreddit": "ffxiv", "subreddit_id": "t5_2rgs7"}, {"author": "GiantCuddlyPenguin", "body": "As a rule of thumb, what would be the Dps difference between max ilvl bis and max ilvl non- BIS? Take for example, a job in BIS and a job that has the \"other\" item in every slot except for the weapon (I. E. Aug deepshadow when BIS is edengrace and vice versa).", "created_utc": "1578886255.0", "edited": "False", "id": "fe6bkcg", "is_submitter": "False", "link_id": "t3_enma54", "parent_id": "t3_enma54", "score": "1", "subreddit": "ffxiv", "subreddit_id": "t5_2rgs7"}, {"author": "GiantCuddlyPenguin", "body": "Found it in Idyllshire. Thanks a lot!", "created_utc": "1577849361.0", "edited": "False", "id": "fcp3j12", "is_submitter": "False", "link_id": "t3_ei1jci", "parent_id": "t1_fcp0qca", "score": "2", "subreddit": "ffxiv", "subreddit_id": "t5_2rgs7"}, {"author": "GiantCuddlyPenguin", "body": "According to this link: [https://ffxiv.gamerescape.com/wiki/Scrip\\_Exchange\\_(The\\_Crystarium)/Crafters%27\\_Scrip\\_Exchange#Others%20](https://ffxiv.gamerescape.com/wiki/Scrip_Exchange_(The_Crystarium)/Crafters%27_Scrip_Exchange#Others%20)\n\nDryad Sap is supposed to be available at the level 58 Yellow Crafter's Scrip exchange (under the Others tab). I might be going crazy, but I actually can't find Dryad sap under this tab. On my screen, it skips right from Goblin Cup to Sweet Cream Milk (so stuff like Purified Coke is missing as well)  \n\n\nHas there been a change to how Dryad Sap is obtained that I am not aware of?", "created_utc": "1577846541.0", "edited": "False", "id": "fcp09he", "is_submitter": "False", "link_id": "t3_ei1jci", "parent_id": "t3_ei1jci", "score": "1", "subreddit": "ffxiv", "subreddit_id": "t5_2rgs7"}, {"author": "GiantCuddlyPenguin", "body": "Since you have the exp bonus, I would highly recommend levelling at least 2 jobs at once. This makes efficient use of the MSQ exp, and gives your gameplay more variety to boot!", "created_utc": "1577064015.0", "edited": "False", "id": "fbsz3bx", "is_submitter": "False", "link_id": "t3_eecf9r", "parent_id": "t3_eecf9r", "score": "2", "subreddit": "ffxiv", "subreddit_id": "t5_2rgs7"}, {"author": "GiantCuddlyPenguin", "body": "You can (and should) do around 40%-50% of a BLM's DPS on a healer.\n\nThat's pretty significant. 2 healers not dpsing is the equivalent of losing an entire dps class.", "created_utc": "1575448085.0", "edited": "False", "id": "f9m9z5a", "is_submitter": "False", "link_id": "t3_e5vou4", "parent_id": "t1_f9m93ms", "score": "10", "subreddit": "ffxiv", "subreddit_id": "t5_2rgs7"}, {"author": "GiantCuddlyPenguin", "body": "Emotional support animal", "created_utc": "1574307118.0", "edited": "False", "id": "f86ubwd", "is_submitter": "False", "link_id": "t3_dz9qdt", "parent_id": "t3_dz9qdt", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "GiantCuddlyPenguin", "body": "\"Hello there\"", "created_utc": "1574156109.0", "edited": "False", "id": "f818ubr", "is_submitter": "False", "link_id": "t3_dycsmw", "parent_id": "t3_dycsmw", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "GiantCuddlyPenguin", "body": "I'm in this photo and I don't like it.\n\n... Please give me more fish", "created_utc": "1574085295.0", "edited": "1574085744.0", "id": "f7y3des", "is_submitter": "False", "link_id": "t3_dy1ion", "parent_id": "t3_dy1ion", "score": "2", "subreddit": "AbsoluteUnits", "subreddit_id": "t5_a7wuv"}, {"author": "GiantCuddlyPenguin", "body": "To help the healers adjust, make sure to stand 30 yalms away from the rest of the party and never stand in asylum, sacred soil or earthly star. This has the added benefit of helping you RP as the lonely, sorcerer outcast haunted by your past.", "created_utc": "1570770464.0", "edited": "False", "id": "f3aeus9", "is_submitter": "False", "link_id": "t3_dg3n1n", "parent_id": "t3_dg3n1n", "score": "7", "subreddit": "ffxiv", "subreddit_id": "t5_2rgs7"}, {"author": "GiantCuddlyPenguin", "body": "Anet's templates are limited to 6 per character, for both builds and gear. Arc has unlimited.\n\nThe limited number of builds makes it worse than Arc for anyone with more than 6 builds, even if Anet's version has other benefits. People are paying a decent sum of money per character to have LESS templates available than before.\n\nAnd since some people seem to have remarkable difficulty believing that anyone could ever want to have more than 6 builds on a char, note that you could be a super casual and have 2 builds per game mode (one per elite spec, say) and still reach the limit of 6. Cost aside, the limit of 6 is only tenable if people don't play multiple game modes. \"Build templates are fine.. If you don't play a good portion of the game!\" isn't exactly a great selling point.\n\n  \n\n\nLong story short? People may have been mostly OK paying for an upgrade to arc. Doesn't take a stretch of the imagination to understand why people would not be happy paying for a downgrade.", "created_utc": "1570193646.0", "edited": "False", "id": "f2efds4", "is_submitter": "False", "link_id": "t3_dcxtc9", "parent_id": "t1_f2edk2a", "score": "5", "subreddit": "Guildwars2", "subreddit_id": "t5_2r9po"}, {"author": "GiantCuddlyPenguin", "body": "I think the issue is more nuanced than that. People may have been happy to pay for a version of templates that is a significant improvement over current free alternatives (eg. With transmutation templates as well, or the ability to share gear across characters). People may even have been happy to pay for something that is equivalent to what arc has now, just with a nicer UI and more stability.\n\nThe issue now is that many players will lose access to arc, and will likely have to pay a decent sum of money for a large LOSS in QOL. I would say that is a justifiable ground for complaint.", "created_utc": "1570017062.0", "edited": "False", "id": "f26mraa", "is_submitter": "True", "link_id": "t3_dc6v08", "parent_id": "t1_f26lv5r", "score": "19", "subreddit": "Guildwars2", "subreddit_id": "t5_2r9po"}, {"author": "GiantCuddlyPenguin", "body": "Indeed! And I happily pay FFXIV's 13/month sub too, given all the content and QOL that I am getting for my money.\n\nIn this case however, we are talking about paying for reduced functionality (relative to arc templates). I'm sure you understand why people would consider paying for 4 months access to a large amount of content acceptable, but be unhappy with paying the same amount of money to retain a QOL feature that was already provided for free.", "created_utc": "1570004195.0", "edited": "False", "id": "f26damj", "is_submitter": "True", "link_id": "t3_dc6v08", "parent_id": "t1_f26bjx2", "score": "14", "subreddit": "Guildwars2", "subreddit_id": "t5_2r9po"}, {"author": "GiantCuddlyPenguin", "body": "Judging by your post, I can infer that you are not using arcdps templates currently. Thus, for you, Anet's templates are a net gain (from no templates to SOME templates).\n\nThose who have been using Arc's templates however, will now have to pay quite a sum of money to retain functionality (from many templates to fewer templates or equal number of templates, depending on how much one spends). While I am glad that you and your friends do not find coping with Anet's templates an issue, I hope you can understand why some people who have been using arc would be very unsatisfied with this recent announcement.", "created_utc": "1570003794.0", "edited": "False", "id": "f26d0p4", "is_submitter": "True", "link_id": "t3_dc6v08", "parent_id": "t1_f26bijx", "score": "11", "subreddit": "Guildwars2", "subreddit_id": "t5_2r9po"}, {"author": "GiantCuddlyPenguin", "body": "I chose my words poorly; maybe \"minute\" wasn't the best term.\n\nThink of the \"minute\" adjustments as changing runes or stats to fulfill the same role. For example, you might want Thief Runes on your power firebrand in raids to cap crit chance, but you want scholar runes instead in fractals since you get more crit chance in fractals. Or maybe you want pack runes for more boon duration for less optimised groups.\n\nSo it's basically the same role (quickness providing power firebrand), but every time you make an adjustment in the role you need to change runes/stats on your equipment. Without templates, having to switch out all the items all the time quickly becomes a chore.", "created_utc": "1569938566.0", "edited": "False", "id": "f23vccz", "is_submitter": "False", "link_id": "t3_dbikib", "parent_id": "t1_f23uvce", "score": "1", "subreddit": "Guildwars2", "subreddit_id": "t5_2r9po"}, {"author": "GiantCuddlyPenguin", "body": "15 is an exaggeration for raids alone, but if you look at a class for all game modes it can get quite ridiculous.\n\nAn example for my guardian (when I still used to play actively) :\n\n  \n\n\n1. Raid DPS DH\n\n2. Condi Quickbrand\n\n3. Power Quickbrand\n\n4. Condi DPS Firebrand\n\n5. Heal firebrand\n\nSo that's at least 5 for raids/fracs. You can easily double that if you add in Pvp, Wvw, and open world.Not even counting the minute adjustments that one would make for some of the sets (eg. Min maxing crit rate for fracs/raids for DH and FB , using more minstrels on heal FB for less experienced groups).\n\nAnd don't even get me started on the number of builds my mesmer needs.", "created_utc": "1569937021.0", "edited": "False", "id": "f23t91s", "is_submitter": "False", "link_id": "t3_dbikib", "parent_id": "t1_f23ro6u", "score": "3", "subreddit": "Guildwars2", "subreddit_id": "t5_2r9po"}, {"author": "GiantCuddlyPenguin", "body": "You get it by creating a character on a server labelled \"new\" or \"preferred\"", "created_utc": "1568366595.0", "edited": "False", "id": "f03qz8v", "is_submitter": "False", "link_id": "t3_d3fuxe", "parent_id": "t1_f03cygm", "score": "4", "subreddit": "ffxiv", "subreddit_id": "t5_2rgs7"}, {"author": "GiantCuddlyPenguin", "body": "If you have the road to 70 bonus, I would highly suggest levelling at least 2 combat jobs at once. Otherwise, as you have noticed, it is very easy to out level the MSQ by a significant degree.\n\nI would suggest levelling 1 dps and 1 healer or tank. Tank + ranged/caster or healer + melee dps preferred, due to how MSQ gear rewards work before shadowbringers. As a rule, give the MSQ exp rewards to your DPS, and do MSQ group content on healer/Tank for fast queues. Do roulettes if either falls behind in levels (unlikely). In fact, using roulettes and allocating quest exp wisely can allow you to level 3 classes simultaneously to at least 70 without too much of an effort, especially with the \"walls\" at 50, 60 and 70.\n\n  \n\n\nWhatever route you choose, do note that the road to 70 lasts only for 3 months, so if you stay on the trial for too long you might not be able to enjoy it for later levels. Finally, imo, while the road to 70 isn't a big deal for combat classes in the medium to long run, it is very, very, VERY helpful for levelling gathering and crafting classes. If you ever plan to craft, try to get as many Doh/Dol to 70 while you still have the buff if possible.", "created_utc": "1568333177.0", "edited": "False", "id": "f02l96w", "is_submitter": "False", "link_id": "t3_d3fuxe", "parent_id": "t3_d3fuxe", "score": "3", "subreddit": "ffxiv", "subreddit_id": "t5_2rgs7"}, {"author": "GiantCuddlyPenguin", "body": "Fellow on hiatus GW2 player here too. Even as a medium-core player, the pace of content releases was too slow to keep me engaged. Replayable, challenging content (raids, fractals, pvp, wvw, ESPECIALLY wvw) barely get any major releases, with the focus being on living story episodes once every 3 months that you can play through in 2 hours and be done.\n\n  \n\n\nRaid training discords on NA have shrunk from 3 active ones + many guilds to just one discord. Many raiding guilds have quit (with some coming here to FF). Wvw guilds are quitting one after another; anet could remove a tier entirely and still have population problems now. Moreover, there has still been no word on the next expansion, with anet choosing to delay/cancel it in favor of yet another living story season (even though it has been almost 2 years since the last expansion) .\n\nStarted ffxiv a month ago. Having a blast so far. And having actual build templates (which gw2 doesn't yet have after 7 years) is actually amazing.", "created_utc": "1563757408.0", "edited": "False", "id": "eueyeev", "is_submitter": "False", "link_id": "t3_cg4o1c", "parent_id": "t3_cg4o1c", "score": "3", "subreddit": "ffxiv", "subreddit_id": "t5_2rgs7"}, {"author": "GiantCuddlyPenguin", "body": "SONO CHI NO SADAME", "created_utc": "1559312595.0", "edited": "False", "id": "epmfx68", "is_submitter": "False", "link_id": "t3_bv5ex7", "parent_id": "t3_bv5ex7", "score": "1", "subreddit": "Animemes", "subreddit_id": "t5_2w6fe"}]