[{"author": "gorob4ik", "body": "Try it and let me know how it goes. If you have any questions or challenges, I'll be happy to help", "created_utc": "1665850841.0", "edited": "False", "id": "isfjdut", "is_submitter": "False", "link_id": "t3_y3ycxg", "parent_id": "t1_isff2sg", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "gorob4ik", "body": "I have used movies and TV shows expensively to learn English, and helped my students to do the same.\n\nFrom what I experienced myself, and what my readers and students told me, you can watch movies in English when you're still learning it 2 ways:\n\nMost learners try two extremes when attempting to learn a language using movies or TV shows:\n\n* Enjoying the show\n* Language-mining\n\nI wouldn't call the first one \"a learning mode\". If you don't take any deliberate action while watching, you won't be getting much out of it in terms of improving English skills. After the episode/movie is over, you can't do in English more than what you could before you started. It's \"watching for fun\", \"what happens next?\" kind of watching where English is not a priority. It's still useful to do it, if you don't get annoyed at unfamiliar words, but if you ONLY do this, you can expect to make much progress in English.\n\nThe second option is so focused on analyzing the language that it usually saps all joy from the process. If you try to pause for every line you don't quite understand to look up vocabulary, analyze grammar etc while watching, it not only becomes slow - it becomes a chore (and doesn't last, in the long run)\n\nThe optimal way of using TV shows and movies is to be in the middle.\n\nIf you watch a TV show episode for the 1st time, there's no point digging into vocabulary and grammar - you just want the story, if the TV series is any good.\n\nBut if you don't take any action afterward, you're missing an exceptional opportunity.\n\nThere are numerous ways you can make watching TV shows a learning experience by \"activating\" the process.\n\n**Here's what you can do** (depending on how much time you have):\n\n&#x200B;\n\n* Recollect 3 most interesting phrases or unusually used familiar words #vocabulary \n* Rewind and do a 10-15 second shadowing #pronunciation \n* Rewind to a random place or your favorite/most interesting scene and think of an alternative response to the question/line in the dialogue #speaking #grammar #vocabulary \n* Write 1-3 sentences about this episode (#writing #grammar #vocabulary)\n\nFor example:\n\n* Your rating for this movie and why so high or so low \n* The character that stood out in this episode, and why you singled him/her out\n* Where do you think it's going? (the story or the relationship between characters) \n* There are numerous ways you can make watching TV shows a learning experience by \"activating\" the process.\n\nI've been doing it with my students using workbooks, and they love it, because it's creative, it's flexible, and they make progress.\n\nOf course, if you could meet and discuss the episode with people who've watched the same episode and are using the same activities, it would help you understand the TV show (and the language) better, consolidate what you've learned, and make speaking easier.", "created_utc": "1665821564.0", "edited": "False", "id": "ise6xkx", "is_submitter": "False", "link_id": "t3_y3ycxg", "parent_id": "t3_y3ycxg", "score": "5", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "gorob4ik", "body": "Incredulously: it's outside her expectations, that's why she can't believe it.", "created_utc": "1664456994.0", "edited": "False", "id": "iqd2fyi", "is_submitter": "False", "link_id": "t3_xr5y1j", "parent_id": "t3_xr5y1j", "score": "3", "subreddit": "EnglishLearning", "subreddit_id": "t5_2u8ap"}, {"author": "gorob4ik", "body": "Another way to put the question: How do you prefer to watch movies: by random selection or by genre/topic etc?", "created_utc": "1663917974.0", "edited": "False", "id": "ipkm1uk", "is_submitter": "True", "link_id": "t3_xk2twu", "parent_id": "t1_ipbkwla", "score": "1", "subreddit": "EnglishLearning", "subreddit_id": "t5_2u8ap"}, {"author": "gorob4ik", "body": "Prompt?\nGuide?", "created_utc": "1663860720.0", "edited": "False", "id": "iphafkf", "is_submitter": "False", "link_id": "t3_xkk6my", "parent_id": "t3_xkk6my", "score": "1", "subreddit": "EnglishLearning", "subreddit_id": "t5_2u8ap"}, {"author": "gorob4ik", "body": "Thank you! It makes sense to me personally, but I wasn't sure if others thought like that. I really appreciate your feedback.", "created_utc": "1663860618.0", "edited": "False", "id": "ipha66d", "is_submitter": "True", "link_id": "t3_xk2twu", "parent_id": "t1_ipcihke", "score": "1", "subreddit": "EnglishLearning", "subreddit_id": "t5_2u8ap"}, {"author": "gorob4ik", "body": "Thank you. I offered them an option in the survey \"grouped by genre\", but no one selected it, that's why I'm asking about what would appeal to you more: watching random movies or movies grouped by topic. Sorry if I didn't make that clear.", "created_utc": "1663767701.0", "edited": "False", "id": "ipbvpx5", "is_submitter": "True", "link_id": "t3_xk2twu", "parent_id": "t1_ipboakr", "score": "2", "subreddit": "EnglishLearning", "subreddit_id": "t5_2u8ap"}, {"author": "gorob4ik", "body": "I'm not sure how relevant it will be for your needs, but you can try joining our movie discussion club. We all watch a movie (independently) and then get together online and discuss it in English. The average level of attendees is approximately B2.  I provide the questions beforehand, so you can prepare (organize your thoughts and facts), but you don't have to memorize your answers - it's all very informal and spontaneous. But at the same time, it's deeper than just small talk. Let me know if you're interested.", "created_utc": "1663425003.0", "edited": "False", "id": "iosts0r", "is_submitter": "False", "link_id": "t3_xau1mb", "parent_id": "t3_xau1mb", "score": "2", "subreddit": "EnglishLearning", "subreddit_id": "t5_2u8ap"}, {"author": "gorob4ik", "body": "A lot of learners tend to use the same words and phrases in their conversations not because they don't know other words, but because they mostly have the same types of conversations. Small talk, typical questions and answers and comments. There's hardly any need to bring up the vocabulary you know, because it might feel awkward, or because you feel so comfortable that you don't think about doing it. \r  \n\r  \nI recommend seeking deeper conversations. Join a book or movie club, this sort of thing. These are not limited to everyday phrases, but allow you to \"flex your language muscles\" while talking about topics beyond small talk. I loved participating in a book club (a long time ago), and now I'm organizing movie discussions with learners of English. \r  \nI also share with my community members the questions about a movie beforehand, so they can think them through, pay attention to certain moments in the film, and make sure they know what they want to say (without the need to memorize anything). \r  \n\r  \nIn brief, find a challenging and interesting speaking/writing opportunity to use your vocabulary and express yourself by talking about things you love talking about.", "created_utc": "1663417038.0", "edited": "False", "id": "iose28v", "is_submitter": "False", "link_id": "t3_w6edbg", "parent_id": "t3_w6edbg", "score": "2", "subreddit": "EnglishLearning", "subreddit_id": "t5_2u8ap"}, {"author": "gorob4ik", "body": "I recommend participating in a book or movie club where you can express your thoughts about different topics, more than a usual small talk conversation. If you're interested in a movie club, I can send you the link to the one that I've been organizing for more than a year", "created_utc": "1663409816.0", "edited": "False", "id": "ios3nwx", "is_submitter": "False", "link_id": "t3_91jelg", "parent_id": "t3_91jelg", "score": "2", "subreddit": "EnglishLearning", "subreddit_id": "t5_2u8ap"}, {"author": "gorob4ik", "body": "I've been organizing movie speaking clubs for B1-B2 learners of English for a year and a half, and here's what they found helpful 9I hope it \"translates\" into your experience in French):\n\nwatching a movie dubbed into your native language and then - the original (or choosing to watch the movie in English which you've seen before and know well)\r  \n\r  \nusing subtitles of the target language to understand what words are being said. \n\nAim at **getting the plot and main pieces of dialog.** Don't get stuck on the details (unless they are essential) - so no, I don't recommend translating every unfamiliar word because watching will soon become a chore.\n\nIf you can join a community/group where people discuss the same movie in your target language, it might help, especially if it's a language-learning community.", "created_utc": "1663267877.0", "edited": "False", "id": "iokdyme", "is_submitter": "False", "link_id": "t3_vpg7yb", "parent_id": "t3_vpg7yb", "score": "1", "subreddit": "learnfrench", "subreddit_id": "t5_2sucz"}, {"author": "gorob4ik", "body": "I’ve been organizing movie speaking clubs for a year and a half, and here’re some of the movies the members of my community (B1-B2 levels) liked discussing (admittedly, not all them are sci-fi or thrillers, and we don’t discuss horror movies):\r  \n•\tGifted (drama)\r  \n•\tMrs Doubtfire (comedy, drama)\r  \n•\tEquilibrium (action, sci-fi, drama - you might like it)\r  \n•\tThe Imitation Game (biography, drama, thriller)\r  \n•\tThe Holiday (comedy, romance)\r  \n•\tKnives Out (crime/mystery, comedy, drama)\r  \n•\tDead Poets Society (drama, comedy)\r  \n•\tGattaca (sci-fi, thriller, drama)\r  \n•\tsoon we’re planning to watch “Ender’s Game” (sci-fi, adventure, action)\r  \n\n\nDramas, romance movies and comedies have the benefit of realistic, contemporary language (unlike some historical movies, for example)\n\n\r  \nI also occasionally share explanations of key quotes or answer their questions in our community. if you don’t understand it all. Aim at getting the plot and main pieces of dialog. Don’t get stuck on the details (unless they are essential)\r  \n2 tactics that have been helpful to my tribe:\r\n\n* watching the dubbed movie and then - the original, or watching the movie in English which they’ve seen and know well\n* using English subtitles to understand the dialogue\r  \nI also occasionally share explanations of key quotes or answer their questions in our community.\n\n\r  \nBTW, I’m also Ukrainian, so feel free if you have additional questions", "created_utc": "1663265137.0", "edited": "False", "id": "iok70hu", "is_submitter": "False", "link_id": "t3_vz1d4h", "parent_id": "t3_vz1d4h", "score": "1", "subreddit": "NetflixBestOf", "subreddit_id": "t5_2ro0h"}, {"author": "gorob4ik", "body": "I've been organizing movie speaking clubs for a year and a half, and here're some of the movies the members of my community (B1-B2 levels) liked discussing (admittedly, not all them are sci-fi or thrillers, and we don't discuss horror movies):\n\n* Gifted (drama)\n* Mrs Doubtfire (comedy, drama)\n* Equilibrium (action, sci-fi, drama - you might like it)\n* The Imitation Game (biography, drama, thriller)\n* The Holiday (comedy, romance)\n* Knives Out (crime/mystery, comedy, drama)\n* Dead Poets Society (drama, comedy)\n* Gattaca (sci-fi, thriller, drama)\n* soon we're planning to watch \"Ender's Game\" (sci-fi, adventure, action)\n\nDramas, romance movies and comedies have the benefit of contemporary realistic language (unlike some historical movies, for example)\n\nI also occasionally share explanations of key quotes or answer their questions in our community. Aim at getting the plot and main pieces of dialog. Don't get stuck on the details (unless they are essential)\n\n2 tactics that have been helpful to my tribe:\n\n* watching the dubbed movie and then - the original, or watching the movie in English which they've seen and know well\n* using subtitles\n\n&#x200B;\n\n&#x200B;\n\nBTW, I'm also Ukrainian, so feel free if you have additional questions", "created_utc": "1663264741.0", "edited": "1663267689.0", "id": "iok60k3", "is_submitter": "False", "link_id": "t3_xeqinx", "parent_id": "t3_xeqinx", "score": "1", "subreddit": "MovieSuggestions", "subreddit_id": "t5_2sqpa"}, {"author": "gorob4ik", "body": "In other words: \"In your opinion, what is the purpose of...?\"", "created_utc": "1663228744.0", "edited": "False", "id": "ioi6i52", "is_submitter": "False", "link_id": "t3_xeijhu", "parent_id": "t3_xeijhu", "score": "1", "subreddit": "EnglishLearning", "subreddit_id": "t5_2u8ap"}, {"author": "gorob4ik", "body": "Hav-hav (Ukrainian)", "created_utc": "1662799462.0", "edited": "False", "id": "inu1ki0", "is_submitter": "False", "link_id": "t3_xa1qtp", "parent_id": "t3_xa1qtp", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "gorob4ik", "body": "[This level quiz](https://tetianabilokin.com/what-is-your-level-of-english/) is also relatively short (24 questions) and has some listening tasks as well", "created_utc": "1662616618.0", "edited": "False", "id": "ink007a", "is_submitter": "False", "link_id": "t3_x8gvao", "parent_id": "t3_x8gvao", "score": "2", "subreddit": "EnglishLearning", "subreddit_id": "t5_2u8ap"}, {"author": "gorob4ik", "body": "If we talk about books, I'd suggest starting with graded readers for starter to elementary levels. You can look for these:  \n[Published by Penguin](https://www.penguinreaders.co.uk/books/?&category=contemporary)  \n[By Cambridge](https://www.cambridge.org/de/cambridgeenglish/catalog/secondary/cambridge-english-readers/components?llvl%5B%5D=Level+1&llvl%5B%5D=Level+1+Beginner%2FElementary&sortOrder=pubSysSortOrder%5Basc%5D&openOptions[]=facet_llvl&openOptions[]=facet_lvar&openOptions[]=facet_format)  \n[By Macmillan](http://macmillaneducationebooks.com/elt/graded-readers/levels/beginner)  \nYou don't necessarily buy them from these websites, but you can see what's available and find them at your local bookstores or resellers.", "created_utc": "1662439543.0", "edited": "False", "id": "in9yjsr", "is_submitter": "False", "link_id": "t3_x5qnxb", "parent_id": "t1_in3p68r", "score": "1", "subreddit": "EnglishLearning", "subreddit_id": "t5_2u8ap"}, {"author": "gorob4ik", "body": "If you're just looking for speaking opportunities, [join our movie club](https://lu.ma/tetianabilokin) \\- we hang out (online) every 2 weeks and discuss a movie we've seen. But it's for people who love watching movies (not everyone does, as it turns out 🤷‍♀️)", "created_utc": "1662317070.0", "edited": "False", "id": "in366gg", "is_submitter": "False", "link_id": "t3_x5tisp", "parent_id": "t1_in31sgu", "score": "9", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "gorob4ik", "body": "I agree with MikasMinerva, reading helps a lot, because you see the words repeatedly, in different contexts, at your own pace.\n\nOne of the rules of language learning is not only to expand vocabulary, but to **prevent forgetting what you've already learned**. \n\nGood textbooks use recycling: the target words are used in different exercises and texts over and over again, long after the words were \"introduced\". It helps a lot.\n\nReading a lot serves the same purpose. I find watching movies and TV series helpful, too. \n\nAlso, try to use target vocabulary to express your own thoughts and emotions.   \nFor my movie club members, I send discussion questions that contain some words and phrases from the movie (or not, but are still useful vocabulary). While discussing the movie questions, club members have to use the vocabulary to use the words, and remember them so much better afterward.", "created_utc": "1662316309.0", "edited": "False", "id": "in34bt9", "is_submitter": "False", "link_id": "t3_x5qnxb", "parent_id": "t3_x5qnxb", "score": "3", "subreddit": "EnglishLearning", "subreddit_id": "t5_2u8ap"}, {"author": "gorob4ik", "body": "I've been learning English for 25+ years and teaching for 20, and I still come across new words and phrases in books and movies (I read and watch a lot). Mostly abbreviations, cultural references, or terminology (I remember a couple of fantasy novels that took place on ships, and oh boy, I heard more about ship parts than I ever wanted, even in my native language). but occasionally phrasal verbs or slang. I understand them from context, but I'm curious to look them up.  \nAlso, I recently had a chance to fill up my vocabulary with military terms (again, even in my native language I rarely thought about the differences between a bullet and a round, or a gun and a weapon etc) while interpreting Western military instructors training our 🇺🇦 soldiers.   \nIf you're curious about the language, you keep being fascinated by new stuff you keep noticing. It does get easier though.", "created_utc": "1662315425.0", "edited": "False", "id": "in326q8", "is_submitter": "False", "link_id": "t3_x5il71", "parent_id": "t3_x5il71", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "gorob4ik", "body": "Or maybe vintage. I'm not 💯 sure it's applicable here, but I've heard it used about \"old\" clothes (which are quite expensive)", "created_utc": "1662229795.0", "edited": "False", "id": "imygu33", "is_submitter": "False", "link_id": "t3_x3krjx", "parent_id": "t3_x3krjx", "score": "1", "subreddit": "EnglishLearning", "subreddit_id": "t5_2u8ap"}, {"author": "gorob4ik", "body": "If your have no trouble expressing your thoughts in writing, you could try to transition from writing to speaking by reading aloud what you wrote. If it goes OK, by saying what you wrote (you can record yourself - at first it would make the task more challenging, but it will help identify problems).\nIf forming sentences aloud is going fine, you can try participating in speaking clubs or other live events. \nYou don't have to say anything, but you can challenge yourself to do so (start with a tiny goal). \nAs you get more comfortable doing it, your confidence will grow, and the speaking fluency will improve.", "created_utc": "1662229611.0", "edited": "1662439607.0", "id": "imyge9s", "is_submitter": "False", "link_id": "t3_x3nfxp", "parent_id": "t3_x3nfxp", "score": "1", "subreddit": "EnglishLearning", "subreddit_id": "t5_2u8ap"}, {"author": "gorob4ik", "body": "As someone said already, reading.\nI find movies and TV shows helpful (lifelike dialogs with lots of interesting vocabulary)\nI also like exploring examples in learner's dictionaries like Longman or Oxford learner's dictionaries.", "created_utc": "1662229021.0", "edited": "False", "id": "imyezg6", "is_submitter": "False", "link_id": "t3_x3vf2z", "parent_id": "t3_x3vf2z", "score": "1", "subreddit": "EnglishLearning", "subreddit_id": "t5_2u8ap"}, {"author": "gorob4ik", "body": "You don't have to read books, if that's not something you do for fun, even in your native language.\n\nI'd suggest reading anything interesting you find on the internet. Is there a blogger you follow/like? a French celebrity you're actually interested in? Try reading short passages (1-2 paragraphs). \n\nEven is that is too difficult (because it's authentic, not graded to your level), try using \"Read aloud\" option in Edge browser - it's really decent for English, I haven't tried for any other language. In addition to this function, I'd recommend using Readlang extension.", "created_utc": "1661701422.0", "edited": "False", "id": "im515el", "is_submitter": "False", "link_id": "t3_wz41ou", "parent_id": "t3_wz41ou", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "gorob4ik", "body": "I've been organizing a movie discussion club meetings aimed at learners of English.  If you're interested, our next meeting is taking place in two weeks, and right now I'm [trying to decide the next movie](https://www.reddit.com/r/MovieClub_English/comments/wz9bh8/choosing_the_movie_for_next_movie_club_meeting/?utm_source=share&utm_medium=web2x&context=3). Let me know if it's something you might want to join.", "created_utc": "1661623672.0", "edited": "False", "id": "im13xy4", "is_submitter": "False", "link_id": "t3_wyey2x", "parent_id": "t3_wyey2x", "score": "1", "subreddit": "movies", "subreddit_id": "t5_2qh3s"}, {"author": "gorob4ik", "body": "A lot of comprehensible input.\n\nI had my first English-speaking dream after I finished my first graded reader (my mom told me I was speaking English in my sleep, not sure how good it was) - I was about 12-13 at the time.\n\nI read and watch content in English (about 90% in relation to other language input).\n\nI love fantasy novels, drama TV series and movies, and often have moments when I speak ?think English  without being able to quickly translate it into my native language.\n\nI've started writing in English a while ago: first just my journal, later - my microblog and newsletter. Expressing my ideas and feeling in English comes naturally, easier than in my native language (I don't write as much in Ukrainian as I do in English).\n\nPassive vocabulary is underrated.\n\nIf you consistently provide your brain with a lot of high-quality input, thinking in English will become a second nature.", "created_utc": "1661497351.0", "edited": "1661497835.0", "id": "ilu9pmy", "is_submitter": "False", "link_id": "t3_wxp7lu", "parent_id": "t3_wxp7lu", "score": "5", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "gorob4ik", "body": "No idea if it's doable, just brainstorming (as an ESL teacher and a learner of several languages)\n\n* ability to save phrases (not words) from what I read\n* pronunciation by native speakers (not machine-generated audio)\n* tasks to \"activate\" selected phrases in my own sentences (without prompts - active recall/production)\n* spaced repetition system (review what I've been forgetting)\n* writing prompts to do writing tasks\n* ability to share my (completed) assignments with a native speaker/teacher to give me feedback\n* habit tracker (with or without metrics)\n* exchanging voice messages with other users (1:1 or group)\n* learning journal (maybe with reflection questions/prompts)", "created_utc": "1661496764.0", "edited": "False", "id": "ilu8ymf", "is_submitter": "False", "link_id": "t3_wxstct", "parent_id": "t3_wxstct", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "gorob4ik", "body": "[Will this be helpful?](https://imgur.com/a/d0wJUyr)", "created_utc": "1661091788.0", "edited": "False", "id": "il71kl0", "is_submitter": "False", "link_id": "t3_wt840i", "parent_id": "t3_wt840i", "score": "1", "subreddit": "russian", "subreddit_id": "t5_2qlc6"}, {"author": "gorob4ik", "body": "Assassin's Apprentice by Robin Hobb  (and the whole series that follows)", "created_utc": "1660939887.0", "edited": "False", "id": "ikz9h23", "is_submitter": "False", "link_id": "t3_wsdkiv", "parent_id": "t3_wsdkiv", "score": "3", "subreddit": "books", "subreddit_id": "t5_2qh4i"}, {"author": "gorob4ik", "body": "I'm not sure it will make you feel better, but I made mistakes in my Instagram posts, too - and I'm an English teacher, so I'm supposed to be good 🙄 Sometimes those were just typos (I don't check before posting, especially if I'm typing on my phone). Sometimes grammatical mistakes due to edits (and again without checking).\nIt doesn't mean my English is bad.\nIt just means I made a mistake.\nIf you're too focused on being perfect, you won't make much progress.\nJust keep doing what works for you. Years from now, you'll be laughing at being so concerned about this.", "created_utc": "1660930648.0", "edited": "False", "id": "ikylt5j", "is_submitter": "False", "link_id": "t3_wsj6nn", "parent_id": "t3_wsj6nn", "score": "19", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "gorob4ik", "body": "Yes, good practice with phrases like \"I'm going to\", \"I'll...\" or \"I'm planning to\", if you prefer to write full sentences. I actually did it to focus on my priorities, but it works well as language workout as well", "created_utc": "1660930310.0", "edited": "1661058660.0", "id": "ikykxni", "is_submitter": "False", "link_id": "t3_wsh27n", "parent_id": "t1_ikyjrmr", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "gorob4ik", "body": "About passwords and foreign languages: as a Ukrainian native speaker, I used to use  a Ukrainian phrase, written with English letters (like a transcripton), but with missing endings. It would look something like PrySkoBychk-aya-? (прив'яжи скоріш бичка - а якого?)\nAnother tactic I used - I typed a Ukrainian phrase with the English keyboard on, the result was gibberish.\nNow I just use password generator, but occasionally make such passwords for accounts I don't want the forget the password from.", "created_utc": "1660930186.0", "edited": "False", "id": "ikyklz1", "is_submitter": "False", "link_id": "t3_wrmr7l", "parent_id": "t3_wrmr7l", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "gorob4ik", "body": "Writing / typing a todo list (in my target language)", "created_utc": "1660929750.0", "edited": "False", "id": "ikyjgyt", "is_submitter": "False", "link_id": "t3_wsh27n", "parent_id": "t3_wsh27n", "score": "10", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "gorob4ik", "body": "What you're feeling is natural. Everyone who speaks a foreign language fluently went through this stage.\n\nMy only addition to other comments would be: find the activity you really enjoy and would do it even in your native language. For me, it was watching TV series and movies. On the plus side, you'll hear how German sounds in dialogues and will pick up a lot of things no textbook will teach you.\n\nAlso, don't expect too much of yourself. You won't be able to understand 100% of the movie. Maybe not even 90%. Again, it's OK. Don't try to catch every word and translate them all.  Watch what you can (especially if you've seen it in your native language), and only analyze the language from a very short fragment (30 seconds, then maybe 60 secs). \n\nAnd always try to \"activate\" whatever you learn - use it to express what you think, feel, want etc. Join a relevant and interesting German-language group on Facebook and interact with people there: ask questions, respond to their comments etc. Alternatively, you can start a micro-blog about {whatever rocks your boat} and write / make videos in German. I personally didn't do that, but a few of my former students did, and found it useful.", "created_utc": "1660482168.0", "edited": "False", "id": "ik8yqun", "is_submitter": "False", "link_id": "t3_wnpw81", "parent_id": "t3_wnpw81", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "gorob4ik", "body": "You're very welcome", "created_utc": "1660481239.0", "edited": "False", "id": "ik8x367", "is_submitter": "False", "link_id": "t3_wnvyuf", "parent_id": "t1_ik7nv37", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "gorob4ik", "body": "In Ukrainian, we ask without the verb \"go\": \"Як справи?\"(the literal translation would be \"How are things/is business?\"), but in the answer you could totally use it \"Справи **йдуть** добре\" (Things are going fine)", "created_utc": "1660481207.0", "edited": "False", "id": "ik8x15u", "is_submitter": "False", "link_id": "t3_wo1edu", "parent_id": "t3_wo1edu", "score": "10", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "gorob4ik", "body": "I didn't mean to make you feel bad. My intention was to help you stop procrastinating and focus on **learning** the language.", "created_utc": "1660455815.0", "edited": "False", "id": "ik7zizf", "is_submitter": "False", "link_id": "t3_wmwg0n", "parent_id": "t1_ik7sacy", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "gorob4ik", "body": "Try to imitate the pronunciation of the sounds, intonation pattern, and emotion behind it, but not the voice.\n\nThe advice I give my students when they shadow:  imagine you were cast in a movie to play the role of this character and say this line exactly as that actor/actress did. \n\nIn your case, imagine they cast you (a man) for a role that used to be played by a woman. Use your (male) voice to shadow them, preserving everything else.", "created_utc": "1660448411.0", "edited": "False", "id": "ik7nozu", "is_submitter": "False", "link_id": "t3_wnvyuf", "parent_id": "t3_wnvyuf", "score": "13", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "gorob4ik", "body": "When someone spends hours watching youtube videos (in their native language) about the best way to learn the language, I as an English teacher feel like pulling my hair out. \n\nDeciding which method is superior is procrastination. \n\nThere is **no \"best\" way** \\- there are more or less effective ones for **each** person and **each** situation. IMHO, there are less-useful activities (I don't believe they improve language skills much), but even they are better than \"researching the best way to learn English\". \n\nLike someone already said, show up, sit down, and put in the hours. Work on the language, not around it.\n\n* Get enough language exposure\n* pay attention to details in what you're trying to improve\n* balance input and output activities (passive/active skills)\n* get feedback\n* don't feel disheartened when you don't feel immediate results\n* and don't stop. \n\nThat's it in a nutshell.\n\n&#x200B;\n\nAlso, there is such a thing as decision fatigue. Organize your process/habit /system in a way that requires you to make as few decisions as possible.", "created_utc": "1660401836.0", "edited": "False", "id": "ik4t33j", "is_submitter": "False", "link_id": "t3_wmwg0n", "parent_id": "t3_wmwg0n", "score": "12", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "gorob4ik", "body": "Yep, that's how I did it, and recommend my students to do it, if they use their native language in their learning process.", "created_utc": "1660396381.0", "edited": "False", "id": "ik4hq8s", "is_submitter": "False", "link_id": "t3_wnau17", "parent_id": "t1_ik48z8s", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "gorob4ik", "body": "I use Quizlet flashcards instead of Anki, and I recommend using \"Target > Native\" for learning new vocabulary, and \"Native > Target\" to check if you remember them (after learning) and to revise (some time later).", "created_utc": "1660387983.0", "edited": "False", "id": "ik44ex8", "is_submitter": "False", "link_id": "t3_wnau17", "parent_id": "t3_wnau17", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "gorob4ik", "body": "\"Which\" grammatically acts as singular (it/she/he). \n\nImagine you have \"which thing\" there: \n\n*Which thing* terrifies you more, typhoons or earthquakes? = Which terrifies you more, typhoons or earthquakes?", "created_utc": "1660387249.0", "edited": "False", "id": "ik43h12", "is_submitter": "False", "link_id": "t3_wna0lz", "parent_id": "t3_wna0lz", "score": "8", "subreddit": "EnglishLearning", "subreddit_id": "t5_2u8ap"}, {"author": "gorob4ik", "body": "Maybe \"stay up late\"? \n\n= to not go to bed at the time you would normally go to bed\n\ne.g.: \n\n* *Yesterday I had to stay up late finishing the project.*\n* *We stayed up all night talking.*\n* *I let the kids stay up late on Fridays.*", "created_utc": "1660386493.0", "edited": "False", "id": "ik42j79", "is_submitter": "False", "link_id": "t3_wnaigk", "parent_id": "t3_wnaigk", "score": "14", "subreddit": "EnglishLearning", "subreddit_id": "t5_2u8ap"}, {"author": "gorob4ik", "body": "If your goal is to speak English better, you won't get far if you don't practice speaking regularly, that's true. On the other hand, there is only so much you can learn while speaking with someone.   \nWe learn when we **notice** something good, **imitate** it, and try to **use** it in our own speaking. \n\nThe challenge my students often face is that they do not always notice the things worth imitating/using - or noticing one word and ignoring the details. That's how they make mistakes like \"~~I am agree~~\", \"~~I do not angry~~\", \"~~I do mistakes~~\" or \"I ~~am learning~~ English for 2 years\": they hear \"agree\", but they don't notice that it's a normal verb like \"work\" (>>\"**I don't agree**\"), they hear \"angry\", but they don't realize that it's an adjective, not a verb (>> \"I **am not** angry\"), they hear \"mistake\", but don't pay attention to which verbs can go together with it (**make mistakes**, not ~~do mistakes~~), and they understand \"for 2 years\", but overlook *which tense form* should be used with it (Perfect Simple or Perfect Continuous: \"I'**ve been learning** it for 2 years\").  \nYou DEFINITELY should do speaking practice, but if you really want to improve, you also need to figure out what to pay attention to.", "created_utc": "1660385009.0", "edited": "False", "id": "ik40qa4", "is_submitter": "False", "link_id": "t3_bhh4yn", "parent_id": "t1_eltjhsd", "score": "2", "subreddit": "EnglishLearning", "subreddit_id": "t5_2u8ap"}, {"author": "gorob4ik", "body": "They have become a laughing-stock of the world, after being feared for so long.", "created_utc": "1646117098.0", "edited": "False", "id": "hyvtkid", "is_submitter": "False", "link_id": "t3_t3h1wf", "parent_id": "t3_t3h1wf", "score": "1", "subreddit": "memes", "subreddit_id": "t5_2qjpg"}, {"author": "gorob4ik", "body": "I'm gonna be honest, I didn't vote for him and didn't support most of his pre-war policies. BUT I totally and absolutely respect and support the way he behaves now.", "created_utc": "1646116889.0", "edited": "False", "id": "hyvt9ox", "is_submitter": "False", "link_id": "t3_t3one8", "parent_id": "t3_t3one8", "score": "2", "subreddit": "Damnthatsinteresting", "subreddit_id": "t5_2xxyj"}, {"author": "gorob4ik", "body": "This is hilarious 😂 Or are they serious?", "created_utc": "1646116509.0", "edited": "False", "id": "hyvspkh", "is_submitter": "False", "link_id": "t3_t3bu81", "parent_id": "t3_t3bu81", "score": "1", "subreddit": "ukraina", "subreddit_id": "t5_30y53"}, {"author": "gorob4ik", "body": "\"Making rounds in the hood\" sounds about right 👍", "created_utc": "1646116430.0", "edited": "False", "id": "hyvsl84", "is_submitter": "False", "link_id": "t3_t3k2ld", "parent_id": "t3_t3k2ld", "score": "1", "subreddit": "memes", "subreddit_id": "t5_2qjpg"}, {"author": "gorob4ik", "body": "Everything shared publicly is propaganda, one way or another. This one is just more obvious", "created_utc": "1646052559.0", "edited": "False", "id": "hyrsy9h", "is_submitter": "False", "link_id": "t3_t2zaf9", "parent_id": "t1_hyr51j4", "score": "1", "subreddit": "AdviceAnimals", "subreddit_id": "t5_2s7tt"}, {"author": "gorob4ik", "body": "I know that, but a lot of them do support the attack on Ukraine (due to fake news, fear,  brainwashing, or simple viciousness).", "created_utc": "1646052439.0", "edited": "False", "id": "hyrsqwh", "is_submitter": "False", "link_id": "t3_t2zaf9", "parent_id": "t1_hyrdziy", "score": "1", "subreddit": "AdviceAnimals", "subreddit_id": "t5_2s7tt"}, {"author": "gorob4ik", "body": "You are not wrong. We have always been badass.", "created_utc": "1646052312.0", "edited": "False", "id": "hyrsj2t", "is_submitter": "False", "link_id": "t3_t2zaf9", "parent_id": "t1_hyrpmiv", "score": "1", "subreddit": "AdviceAnimals", "subreddit_id": "t5_2s7tt"}, {"author": "gorob4ik", "body": "I'm moved and thankful to the international community for helping Ukraine in this difficult time", "created_utc": "1646052155.0", "edited": "False", "id": "hyrs9m0", "is_submitter": "False", "link_id": "t3_t3a3eh", "parent_id": "t3_t3a3eh", "score": "3", "subreddit": "ukraina", "subreddit_id": "t5_30y53"}, {"author": "gorob4ik", "body": "Today is the 5th day of fighting", "created_utc": "1646051640.0", "edited": "False", "id": "hyrrfbj", "is_submitter": "False", "link_id": "t3_t3azt5", "parent_id": "t1_hyra3k2", "score": "2", "subreddit": "nextfuckinglevel", "subreddit_id": "t5_m0bnr"}, {"author": "gorob4ik", "body": "Смотрела в оригинале, первая серия очень зацепила, вот теперь думаю - смотреть по одной, на нервах одидая следующей или дождаться, когда он закончится и посмотеть все сразу. Наверное не выдержу.", "created_utc": "1630573305.0", "edited": "False", "id": "hbalycx", "is_submitter": "False", "link_id": "t3_peh74r", "parent_id": "t3_peh74r", "score": "3", "subreddit": "tellyport", "subreddit_id": "t5_pov11"}, {"author": "gorob4ik", "body": "Thank you!", "created_utc": "1623154871.0", "edited": "False", "id": "h10qp3o", "is_submitter": "True", "link_id": "t3_nryoa8", "parent_id": "t1_h0sc44v", "score": "1", "subreddit": "ESL_Teachers", "subreddit_id": "t5_2xx1d"}, {"author": "gorob4ik", "body": "I haven't seen the first adaptation (1957), but I'm aware of the differences with the ending. What makes you like that version better?", "created_utc": "1622794133.0", "edited": "False", "id": "h0jl3uo", "is_submitter": "True", "link_id": "t3_nryoa8", "parent_id": "t1_h0jidsi", "score": "1", "subreddit": "ESL_Teachers", "subreddit_id": "t5_2xx1d"}, {"author": "gorob4ik", "body": "I thought I was the only one who watched it 3 times (and will probably watch again)", "created_utc": "1622403738.0", "edited": "False", "id": "h0087ro", "is_submitter": "False", "link_id": "t3_nmcuyb", "parent_id": "t1_gzqijp8", "score": "2", "subreddit": "TedLasso", "subreddit_id": "t5_26lae1"}, {"author": "gorob4ik", "body": "[Gifted](https://www.imdb.com/title/tt4481414/?ref_=fn_al_tt_1) (2017) has a beautiful ensemble: Chris Evans, Octavia Spencer, Mckenna Grace and Lindsay Duncan", "created_utc": "1622357846.0", "edited": "False", "id": "gzyb0g0", "is_submitter": "False", "link_id": "t3_no0hw3", "parent_id": "t3_no0hw3", "score": "1", "subreddit": "Movie_Club", "subreddit_id": "t5_3978o"}, {"author": "gorob4ik", "body": "Up to some point, you will still try to translate it in order to understand it.   \nIt happens less and less with time, but I found that it's almost impossible to prevent learners from translating stuff (in their heads) when they don't have enough context (A1-A2 levels). I'm **not** saying you *should* translate, but translation has its uses.", "created_utc": "1622357471.0", "edited": "False", "id": "gzyalgd", "is_submitter": "False", "link_id": "t3_nn11na", "parent_id": "t1_gzuxt66", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "gorob4ik", "body": "I really like Nebo for Windows, but maybe there are even better apps that I am not aware of.\n\nNebo homepage https://www.myscript.com/nebo", "created_utc": "1504866386.0", "edited": "False", "id": "dmq3pgd", "is_submitter": "False", "link_id": "t3_6y27mh", "parent_id": "t1_dmkg7w2", "score": "1", "subreddit": "OneNote", "subreddit_id": "t5_2uhau"}, {"author": "gorob4ik", "body": "Middle-aged Fitz - Anson Mount (you might know him from \"Hell on Wheels\"), whereas young (teenager) Fitz would be good by Logan Lerman\n\nthe Fool - Tilda Swinton, can't imagine anyone else since I've seen Orlando in Orlando and Gabriel in Konstantine.\n \nRegal - Robert Pattinson or Zac Efron\n\nShrewd - Peter O'Tool if he was alive, that's how I imagine him\n\nChade - maybe Jeremy Irons or, as someone mentioned, Ian McKellen\n\nKettriken - Cate Blanchett or Gwendoline Christie\n\nBurrich -  Russel Crowe, he must be quite good-looking even when he is old\n\nMolly - Laura Fraser or at someone's suggestion - Abigail Spencer\n\nPatience - only Helena Bonham Carter\n\nGalen - Christopher Heyerdahl\n\nsome images http://www.pinterest.com/votrexflame/the-elderlings-realm", "created_utc": "1411060856.0", "edited": "1411062939.0", "id": "cklxzdy", "is_submitter": "False", "link_id": "t3_2dlntb", "parent_id": "t3_2dlntb", "score": "1", "subreddit": "robinhobb", "subreddit_id": "t5_2sppx"}]