[{"author": "gragev95", "body": "Olin yllättynyt kun Suomeen muuttaessa jopa kotiin tilatut paketit meni lähimmälle ABC:lle, vaikka siis nimenomaan tilasin kotiinkuljetuksella. 🤔 Onneksi oli auto käytössä, muuten olis ollut vähän paha lähteä 5 km suuntaansa moottoritien reunaa pakettia noutamaan. Briteissä ja nyt täällä Kaliforniassa kaikki tulee kotiovelle.", "created_utc": "1665774274.0", "edited": "False", "id": "isbp12d", "is_submitter": "False", "link_id": "t3_y34qkc", "parent_id": "t3_y34qkc", "score": "1", "subreddit": "arkisuomi", "subreddit_id": "t5_njkds"}, {"author": "gragev95", "body": "Yes please, it's been years since I've had these!", "created_utc": "1665773904.0", "edited": "False", "id": "isbo3dz", "is_submitter": "False", "link_id": "t3_y3eigi", "parent_id": "t1_is9h9wz", "score": "1", "subreddit": "VeganFoodPorn", "subreddit_id": "t5_2s6ud"}, {"author": "gragev95", "body": "Loved living in Puotila for the same reasons.", "created_utc": "1665470089.0", "edited": "False", "id": "irv08j7", "is_submitter": "False", "link_id": "t3_y0grwz", "parent_id": "t1_irry3rd", "score": "3", "subreddit": "helsinki", "subreddit_id": "t5_2s0h4"}, {"author": "gragev95", "body": "There's a documentary on YouTube called \"The Consequences of Marrying Your Cousin\". Absolutely heartbreaking.\n\nEdit: [Found it](https://youtu.be/kyNP3s5mxI8)", "created_utc": "1665276405.0", "edited": "False", "id": "irkt6qp", "is_submitter": "False", "link_id": "t3_xyneob", "parent_id": "t1_iri89ow", "score": "2", "subreddit": "MapPorn", "subreddit_id": "t5_2si92"}, {"author": "gragev95", "body": "Added you :)\n\nPlease use mine:\n4GBXA7N5", "created_utc": "1665004200.0", "edited": "False", "id": "ir7a366", "is_submitter": "False", "link_id": "t3_wwz3h0", "parent_id": "t3_wwz3h0", "score": "1", "subreddit": "referralcodes", "subreddit_id": "t5_31den"}, {"author": "gragev95", "body": "Added you :)\n\nPlease use mine:\n4GBXA7N5", "created_utc": "1665004124.0", "edited": "False", "id": "ir79wgi", "is_submitter": "False", "link_id": "t3_xepo45", "parent_id": "t3_xepo45", "score": "3", "subreddit": "referralcodes", "subreddit_id": "t5_31den"}, {"author": "gragev95", "body": "I live in central Fremont and don't have a car. It's been ok but I don't mind walking 20-30 minutes to get to places. But I barely see any other people walking, and while all the grocery shops are close, there really aren't many places to go. Jack's is kind of cute but I'm not into sports. 😅 And it's strange that there's no bus from central Fremont to Lake Elizabeth?", "created_utc": "1664950100.0", "edited": "False", "id": "ir4ahqm", "is_submitter": "False", "link_id": "t3_xvlzrc", "parent_id": "t1_ir39vhm", "score": "7", "subreddit": "Fremont", "subreddit_id": "t5_2st1m"}, {"author": "gragev95", "body": "I just saw this for the first time yesterday, at Fremont TJ's", "created_utc": "1664949058.0", "edited": "False", "id": "ir49453", "is_submitter": "False", "link_id": "t3_xvjt9h", "parent_id": "t3_xvjt9h", "score": "1", "subreddit": "bayarea", "subreddit_id": "t5_2qjyy"}, {"author": "gragev95", "body": "Me ollaan mun miehen kanssa saman pituisia, 165 cm.  Hänen pituudella ei missään vaiheessa ole ollut mitään väliä ja saadaan paljon kommentteja, että näytetään hyvältä yhdessä jne. Hän kantaa itsensä ylpeydellä ja sekin varmasti vaikuttaa. Toisaalta olen myös huomannut, että jotkut asiat on helpompia kun ei ole suurta pituuseroa: ei tarvi koko ajan tuijotella ylös päin jne. :D Panosta muihin juttuihin, oman itsetunnon kasvattamiseen ym. ja seuraa varmasti löytyy. Tinderin sijasta olen kuullut OK Cupidista hyvää.", "created_utc": "1664828445.0", "edited": "False", "id": "iqxgeue", "is_submitter": "False", "link_id": "t3_xufgeh", "parent_id": "t3_xufgeh", "score": "2", "subreddit": "Suomi", "subreddit_id": "t5_2qlq3"}, {"author": "gragev95", "body": "Ok good to know, thanks for the info! Still learning about this issue.", "created_utc": "1664319737.0", "edited": "False", "id": "iq61i89", "is_submitter": "False", "link_id": "t3_xluho7", "parent_id": "t1_ipn1qsw", "score": "1", "subreddit": "MapPorn", "subreddit_id": "t5_2si92"}, {"author": "gragev95", "body": "Many libraries in Finland do this too, it's awesome. Like I don't want to buy a sowing machine or a 600€ rug steamer if I only need it once a year.", "created_utc": "1663955601.0", "edited": "False", "id": "ipmdv3i", "is_submitter": "False", "link_id": "t3_xlyjvs", "parent_id": "t3_xlyjvs", "score": "1", "subreddit": "mildlyinteresting", "subreddit_id": "t5_2ti4h"}, {"author": "gragev95", "body": "I realised how huge Brazil really is when I visited my friend in Rondônia six years ago. Flew in to São Paulo from London, then had to fly another 4-5 hours just to reach the western side of the country. Just endless forest (and farmland 😔) from the plane window.", "created_utc": "1663955402.0", "edited": "False", "id": "ipmdeta", "is_submitter": "False", "link_id": "t3_xluho7", "parent_id": "t1_ipl52i2", "score": "18", "subreddit": "MapPorn", "subreddit_id": "t5_2si92"}, {"author": "gragev95", "body": "Ghost House in Fremont 15th-30th October: http://candlelighters.com/", "created_utc": "1663191718.0", "edited": "False", "id": "iog9di7", "is_submitter": "False", "link_id": "t3_xdiznw", "parent_id": "t3_xdiznw", "score": "1", "subreddit": "bayarea", "subreddit_id": "t5_2qjyy"}, {"author": "gragev95", "body": "Näitä varastetaan ihan valtoimenaan täällä päin maailmaa, mutten koskaan ollut kuullut, että olisi Suomessa ongelma. Paikallinen kierrätysfirma ym. jäi täällä vähän aikaa sitten kiinni näiden ostamisesta: https://www.nbcbayarea.com/news/local/fremont-recycling-company-catalytic-converters/2973010/", "created_utc": "1662859255.0", "edited": "False", "id": "inxizgb", "is_submitter": "False", "link_id": "t3_xajq3q", "parent_id": "t3_xajq3q", "score": "3", "subreddit": "Suomi", "subreddit_id": "t5_2qlq3"}, {"author": "gragev95", "body": "I think it's sweet. Seems like a more demanding hobby than you'd first expect it to be. It's like a combination of arts and crafts (a lot of the kids (and adults) make the horses by hand!), sport, and performance/acting.", "created_utc": "1662858776.0", "edited": "False", "id": "inxhzag", "is_submitter": "False", "link_id": "t3_xaoz0i", "parent_id": "t1_invbv8g", "score": "47", "subreddit": "Damnthatsinteresting", "subreddit_id": "t5_2xxyj"}, {"author": "gragev95", "body": "When I was moving back to Finland from the UK, to Helsinki for the first time in my life, everyone told me to steer clear of the eastern parts of Helsinki. Ended up moving to Puotila in East Helsinki and absolutely loved it. Cute houses, a tree-lined boulevard, a manorhouse, near the beach, the metro, community gardens, and amazing trails.", "created_utc": "1662711270.0", "edited": "False", "id": "inp9r36", "is_submitter": "False", "link_id": "t3_x8wufh", "parent_id": "t3_x8wufh", "score": "3", "subreddit": "Finland", "subreddit_id": "t5_2qztz"}, {"author": "gragev95", "body": "Sauna\n\nwhen people pronounce it \"saw-nuh\" 😡  \n\n\nbecause it is THE ONLY commonly used Finnish word in the English language and people can't get even that one word right.\n\n  \nThis is the only correct way: https://www.facebook.com/herfinland/videos/how-to-correctly-pronounce-sauna-in-finnish-/3131706537043953/", "created_utc": "1662683418.0", "edited": "False", "id": "innvvw1", "is_submitter": "False", "link_id": "t3_x940ai", "parent_id": "t3_x940ai", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "gragev95", "body": "If you choose Finland (Helsinki), I wouldn't worry about the language so much. It's harder to become fluent in it than in Swedish for sure especially if your first language is Germanic/Indo-European but it's not absolutely necessary to learn it. People will really appreciate it if you're interested in learning the language but you won't have any issues at work or making friends if you only speak English. Your kids will pick it up really quickly.  \n\n\nI've lived in Finland with my Indian husband who speaks very little Finnish and he found it easy to get around, communicate with people, do shopping etc. I also have many foreign friends who have lived in the Helsinki area for 5+ years and have been fine without knowing Finnish.", "created_utc": "1662681576.0", "edited": "1662681836.0", "id": "innrr8b", "is_submitter": "False", "link_id": "t3_x8uh89", "parent_id": "t3_x8uh89", "score": "1", "subreddit": "Finland", "subreddit_id": "t5_2qztz"}, {"author": "gragev95", "body": "I love Cinnaholic but it's all just way too sweet for me 🥲 I can't eat maybe a quarter max", "created_utc": "1662594305.0", "edited": "False", "id": "inirysm", "is_submitter": "False", "link_id": "t3_x87bn0", "parent_id": "t3_x87bn0", "score": "2", "subreddit": "VeganFoodPorn", "subreddit_id": "t5_2s6ud"}, {"author": "gragev95", "body": "Brb I'll just drive to you from Finland", "created_utc": "1662590348.0", "edited": "False", "id": "iniiu47", "is_submitter": "False", "link_id": "t3_x7lzky", "parent_id": "t1_inden0z", "score": "1", "subreddit": "geography", "subreddit_id": "t5_2qnms"}, {"author": "gragev95", "body": "Wow. Whenever I feel bad about choosing a UK university instead of staying in my home country (Finland) where higher education is free (the government even gives you monetary support while you're a student), I'll just think of this map. My whole degree cost less than a year at any of these universities.", "created_utc": "1662590117.0", "edited": "False", "id": "iniia77", "is_submitter": "False", "link_id": "t3_x7ra90", "parent_id": "t3_x7ra90", "score": "1", "subreddit": "dataisbeautiful", "subreddit_id": "t5_2tk95"}, {"author": "gragev95", "body": "I'm European (like born and raised in Europe) and we welcome Indians 🙏🏼 My country (Finland) is actually trying to get more skilled people to move there from India 🇫🇮🇮🇳", "created_utc": "1662448897.0", "edited": "False", "id": "inabq4d", "is_submitter": "False", "link_id": "t3_x40wgu", "parent_id": "t3_x40wgu", "score": "1", "subreddit": "facepalm", "subreddit_id": "t5_2r5rp"}, {"author": "gragev95", "body": "I'm a Finn who always wanted to move abroad. During family holidays in Denmark and Germany when I was 10 or even younger, I remember wondering what life there would be like.\n\nMy aunt lived in London, I was a huge Harry Potter fan and I felt something about British culture really resonated with me so I kind of made it my life goal to move there as soon as I finished school, and so I did. Lived, worked and studied there for a number of years and I still love it but I don't think I would want to settle there for the rest of my life. I love the progressive/artsy/slightly zany atmosphere of the area that I lived in, the variety of food, and British humour. But the climate, even in the southern parts of England, isn't significantly better than in Finland, the houses are cold and moldy, and in general I feel like a country that's supposed to be one of the \"most developed\" countries in the world shouldn't be so crappy. A lot of things (infrastructure, public transport, services/bureaucracy etc.) are just really messy or don't work. And I feel like a lot of British people, especially older people in the countryside, still have this 'imperial' idea that they're the center of the world and I just find it really annoying. 😅\n\nEnded up marrying an Indian guy and we're now living in California. We're both in tech so Silicon Valley is undoubtedly the best place to be for us in terms of career opportunities and salaries. I was never really interested in the US but I fell in love with the nature here on the west coast the first time I visited. I'm still trying to understand this place and I'm not really interested in even visiting a big chunk of this country but I really enjoy how international it is (even London, doesn't compare!) and the wide variety of different kinds of places this country offers. Where we live, near the coast, it still gets pretty cold sometimes but 95% of the time it's between 10 and 30 Celcius, never really too hot or cold, and it's sunny nearly every day. Almost all locals (people who were raised in the US) I've interacted with have been absolutely lovely as well.\n\nWe tried living in Finland (Helsinki) for a bit but it was during the worst time of the year (September-January) and during covid and we just felt kind of isolated socially. People have their own groups, it takes a long time to get to know them, or they need at least a week's notice before meeting. Cost of living is about half of what it is here but salaries even before tax are 3-4 times lower. And I just can't deal with the darkness right now, but I would really like to give Finland another try perhaps a few years from now.\n\nSome other places I've considered:\n\n• India - We'll most likely move there for a while at some point. A lot of cities really have this \"up and coming\" feel, there's interesting stuff happening all the time, good climate, amazing nature and food everywhere.\n\n• The Netherlands - Some tech opportunities, cute cities, bike- and vegan-friendly, not too far. Feels like a cool, less conservative little sibling of Germany.\n\n• Portugal - Never been but I've heard that it's similar to California in some ways. It would be lovely to be able to stay in Europe and still have some sunshine throughout the year.\n\n• Australia - I was mostly interested because of my fascination with the UK. Always though Australia would be kind of like a mix between the UK, Nordics and Asia but with good weather. Didn't live up to the hype when I visited, and it's so freaking far!\n\n• New Zealand - Same as with Australia. Like England but with more amazing nature.\n\n• Canada - Like the US but with better politics and fewer opportunities. But it's just too cold. I feel like if I had to move somewhere cold, I might as well just move back to Finland.\n\n• Iceland/Norway/Denmark - Would be interesting but again, I feel like they're too similar so might as well just live in Finland. The inconvenience of moving and learning the language and how things work outweighs the positives for me. 🤷🏼‍♀️", "created_utc": "1662447945.0", "edited": "1662448188.0", "id": "inaajxq", "is_submitter": "False", "link_id": "t3_x6mj4k", "parent_id": "t3_x6mj4k", "score": "10", "subreddit": "Finland", "subreddit_id": "t5_2qztz"}, {"author": "gragev95", "body": "Kuuntelen jonkun ohjatun unimeditaation Calm-sovelluksesta (Tamara Levittin lukeman), YouTubestakin löytyy jotain. Keskityn kuuntelemaan sitä rauhallista puhetta niin muut ajatukset ei pyöri päässä niin lujaa. Nukahdan AINA.", "created_utc": "1662368280.0", "edited": "False", "id": "in5w55c", "is_submitter": "False", "link_id": "t3_x65b05", "parent_id": "t3_x65b05", "score": "2", "subreddit": "Suomi", "subreddit_id": "t5_2qlq3"}, {"author": "gragev95", "body": "Salad (made this [orzo lentil salad](https://www.veganricha.com/lentil-orzo-salad/) multiple times this summer, the dressing is so good)\n\nCold soup\n\nCold tofu dishes\n\nSushi", "created_utc": "1662340858.0", "edited": "False", "id": "in4nesg", "is_submitter": "False", "link_id": "t3_x5ynkc", "parent_id": "t3_x5ynkc", "score": "1", "subreddit": "bayarea", "subreddit_id": "t5_2qjyy"}, {"author": "gragev95", "body": "Skins. I adore seasons 1-4 and they were such a big part of my pre-teen/teen years but seasons 5-6 and the 7th \"reunion\" seasons were absolute rubbish. S5 and S6 almost felt like a different series altogether.", "created_utc": "1662326884.0", "edited": "False", "id": "in3taaf", "is_submitter": "False", "link_id": "t3_x5m9jt", "parent_id": "t3_x5m9jt", "score": "3", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "gragev95", "body": "I was pretty surprised by this too. I regularly visit India (yellow) and feel a lot safer there than I ever did in Brazil (RJ, SP, Rondônia) as a white Finnish woman. I get some stares for sure but I've never been followed or had anything stolen in India, while this all happened during my three-week visit to Brazil! Both my and my friend's debit cards got copied and some fraudulent transactions on them even though we almost exclusively used cash and only used the cards at the (reputable) hotel and one or two fancier restaurants.", "created_utc": "1662325686.0", "edited": "False", "id": "in3qh8z", "is_submitter": "False", "link_id": "t3_x5j62p", "parent_id": "t1_in1mywd", "score": "1", "subreddit": "dataisbeautiful", "subreddit_id": "t5_2tk95"}, {"author": "gragev95", "body": "Yep the shipping charges have gone crazy since Brexit. 🙄", "created_utc": "1662315794.0", "edited": "False", "id": "in332ww", "is_submitter": "False", "link_id": "t3_x4ln70", "parent_id": "t1_in1ozue", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "gragev95", "body": "Just realised that Disney+ has Finnish as audio and subtitle option even if you're outside of Finland. There's lots of non-kids' stuff as well.", "created_utc": "1662230366.0", "edited": "False", "id": "imyi7qa", "is_submitter": "False", "link_id": "t3_x4tk8u", "parent_id": "t3_x4tk8u", "score": "2", "subreddit": "LearnFinnish", "subreddit_id": "t5_2xe7f"}, {"author": "gragev95", "body": "Where do you live? I (used to) love those too but I haven't seen any outside of Finland. I know Cloetta has one (\"Mint Mint täytelakritsi\") but unfortunately it has gelatine. Fazer also has some new-ish filled liquorice bars (täytelaku) which are all vegan but I don't think they have mint flavour, at least I haven't seen it when visiting Finland.", "created_utc": "1662213383.0", "edited": "False", "id": "imxddqb", "is_submitter": "False", "link_id": "t3_x4ln70", "parent_id": "t1_imxauys", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "gragev95", "body": "Haha, I have chronically low blood pressure - all the more reason to eat lots of liquorice and salmiakki!", "created_utc": "1662212972.0", "edited": "False", "id": "imxciv5", "is_submitter": "False", "link_id": "t3_x4ln70", "parent_id": "t1_imx40of", "score": "2", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "gragev95", "body": "Nice, don't think I've tried the Icelandic kind! Didn't come across any when I was in Reykjavík.", "created_utc": "1662212908.0", "edited": "False", "id": "imxce19", "is_submitter": "False", "link_id": "t3_x4ln70", "parent_id": "t1_imx403d", "score": "2", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "gragev95", "body": "Yes, now I realise that. Had to look it up after that first experience. So it's basically spices you would use in a pumpkin pie. I somehow always thought \"pumpkin spice\" was like \"spiced pumpkin\" or \"pumpkin + spice\", not just spice.  \n\n\nIf anyone actually likes pumpkin and would like to try something new this season, I absolutely love pumpkin cooked the Indian way: [kaddu ki sabzi](https://www.vegrecipesofindia.com/kaddu-ki-sabzi/). It's kind of like what I thought pumpkin spice would be like but in savoury form. :D", "created_utc": "1662208344.0", "edited": "False", "id": "imx3fa8", "is_submitter": "False", "link_id": "t3_x4ln70", "parent_id": "t1_imx29xa", "score": "2", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "gragev95", "body": "That's surprising! I've spotted Finnish sweets (mostly Fazer filled chocolates) at a random grocery store in Poland, and at Hong Kong airport.", "created_utc": "1662207456.0", "edited": "False", "id": "imx1vzv", "is_submitter": "False", "link_id": "t3_x4ln70", "parent_id": "t1_imx07ad", "score": "2", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "gragev95", "body": "Wow, dream come true! Did she like it?\nMy family and I used to make a stop at the Panda factory shop on our way to my grandma's place when I was little and they basically had unlimited samples, and huge boxers for sale for ridiculously low prices. Some of my most precious memories. 😁", "created_utc": "1662207336.0", "edited": "False", "id": "imx1oth", "is_submitter": "False", "link_id": "t3_x4ln70", "parent_id": "t1_imwzw7w", "score": "3", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "gragev95", "body": "This is so sweet. I once stayed in a relationship for way too long because we had a rescue dog together. Then I realised one shouldn't stay in a relationship just for the dog. We amicably shared custody until he passed away from cancer last year.", "created_utc": "1662202660.0", "edited": "False", "id": "imwuojd", "is_submitter": "False", "link_id": "t3_x4g8zi", "parent_id": "t3_x4g8zi", "score": "3", "subreddit": "MadeMeSmile", "subreddit_id": "t5_2uqcm"}, {"author": "gragev95", "body": "Oh yeah, I'm vegan and I hate it when they add gelatine to liquorice or salmiakki! There's this one brand in Finland that does that (Halva) and I don't get it.\n\nI'll check these out, thanks so much!", "created_utc": "1662202459.0", "edited": "False", "id": "imwuexv", "is_submitter": "False", "link_id": "t3_x4ln70", "parent_id": "t1_imwthuh", "score": "2", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "gragev95", "body": "As far as I know, salmiakki is a mixture of ammonium chloride and liquorice.  Ammonium chloride is what gives it that unique taste.", "created_utc": "1662199294.0", "edited": "False", "id": "imwqhpx", "is_submitter": "False", "link_id": "t3_x4ln70", "parent_id": "t1_imwptz7", "score": "3", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "gragev95", "body": "Awesome, let us know what you think! It may take a moment to get used to it.", "created_utc": "1662198562.0", "edited": "False", "id": "imwpmic", "is_submitter": "False", "link_id": "t3_x4ln70", "parent_id": "t1_imwoxfn", "score": "3", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "gragev95", "body": "Yeah I really don't understand people who go out to eat and then order pasta (and pay like $20 for it)? I've never had amazing pasta at a restaurant, at least anything that I couldn't make at home.", "created_utc": "1662198416.0", "edited": "False", "id": "imwpgc7", "is_submitter": "False", "link_id": "t3_x4ln70", "parent_id": "t1_imwd71j", "score": "3", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "gragev95", "body": "Growing up in a country with no pumpkin spice anything, I always thought the flavour would be like a soft pumpkin flavour with a little cinnamon or something so I was really confused when I finally had it (a pumpkin spice latte at Starbucks in London, three pumpkin seasons ago). I'll probably have to give it another shot now that I live in the promised land of pumpkin spice everything but it was way more bitter and weird than I expected, based on all the hype?", "created_utc": "1662198272.0", "edited": "False", "id": "imwpa9u", "is_submitter": "False", "link_id": "t3_x4ln70", "parent_id": "t1_imw5wmk", "score": "8", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "gragev95", "body": "How spicy is ultra spicy for you? I keep hearing people saying this but spiciness is so relative, and your tolerance for spice can increase if you slowly eat spicier and spicier food. I, for example, enjoy a little habanero sauce on almost everything and I feel like it completes the flavour and just brings that extra \"oomph\" to it but I know some of my friends would feel that the spiciness is overpowering.", "created_utc": "1662198021.0", "edited": "False", "id": "imwozvt", "is_submitter": "False", "link_id": "t3_x4ln70", "parent_id": "t1_imw7bim", "score": "3", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "gragev95", "body": "Same! I never liked it. The fresh berries on top were always my favourite part... The rest of it is just too mushy and moist and bland. People thought I was crazy when I said I'd rather have pizza for my birthday than cake. I do enjoy some dry/dryer cakes though, like the ones we call \"spice cakes\" in Finland/probably the other Nordic countries too.", "created_utc": "1662197649.0", "edited": "False", "id": "imwokak", "is_submitter": "False", "link_id": "t3_x4ln70", "parent_id": "t1_imwcl8o", "score": "20", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "gragev95", "body": "What are some good Dutch brands? Perhaps they would be easier to find here in the US.", "created_utc": "1662197363.0", "edited": "False", "id": "imwo8eq", "is_submitter": "False", "link_id": "t3_x4ln70", "parent_id": "t1_imwn3ci", "score": "2", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "gragev95", "body": "It's an acquired taste - takes some getting used to if you weren't fortunate enough to grow up with the stuff. My Indian husband found the taste a bit overwhelming at first but now he's happy to share the bag with me. Although, I introduced him to salmiakki ice cream this summer and he wasn't a big fan but neither am I tbh. All the saltiest salmiakki are my favourite: Sisu, Turkinpippuri, Dracula, Pääkallot, Pommix, Lakrisal etc. You'll learn to love it over time!", "created_utc": "1662197206.0", "edited": "False", "id": "imwo20t", "is_submitter": "False", "link_id": "t3_x4ln70", "parent_id": "t1_imwegbv", "score": "3", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "gragev95", "body": "Finnish liquorice has a subtle, soft, smooth flavour with just the right amount of sweetness and a hint of aniseed. It's soft and sometimes a little bit brittle.  \n\n\nThe liquorice I've tried in other countries has been chewy with a hard surface, kind of tasteless or with a bitter flavour. To be honest, it's been years since I've tried it - I tried them all when I first moved abroad but came to the conclusion that it's not worth the money because I could never finish the bag.", "created_utc": "1662196558.0", "edited": "False", "id": "imwnaof", "is_submitter": "False", "link_id": "t3_x4ln70", "parent_id": "t1_imwk5bf", "score": "22", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "gragev95", "body": "Visited for the first time in May, seemed like a really nice city! Took the ferry to Centre Island to get a good look of the skyline, definitely worth it.", "created_utc": "1662188978.0", "edited": "False", "id": "imweb0b", "is_submitter": "False", "link_id": "t3_x40xvb", "parent_id": "t3_x40xvb", "score": "3", "subreddit": "CityPorn", "subreddit_id": "t5_2scjs"}, {"author": "gragev95", "body": "I grew up eating liquorice, loved it, then I moved out of Finland and realised that other countries don't know what they're doing with their liquorice. The stuff you get in Central Europe, UK, Australia, US... you can't even call it liquorice. Yuk! Try and get your hands on some Panda liquorice, I've seen it at Sprouts in the US and in various shops around the UK. Feel the bag, it's best when it's fresh and soft. Kouvolan Lakritsi is the best liquorice in the world but hard to come by outside of Finland.", "created_utc": "1662188305.0", "edited": "1662196599.0", "id": "imwdgnj", "is_submitter": "False", "link_id": "t3_x4ln70", "parent_id": "t1_imw70v0", "score": "261", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "gragev95", "body": "Exactly. I'm a non-Indian (Finnish) woman married to a North Indian guy and it did take him some guts to convince his parents but luckily they came around. It's unfortunate if the parents are not willing to try and understand but if he really wants to be with you, he'll stand up for you.\n\nCheck out almostindianwife on Instagram, she has a lot of info about this kind of stuff.", "created_utc": "1662184982.0", "edited": "False", "id": "imw96k0", "is_submitter": "False", "link_id": "t3_x49wr6", "parent_id": "t1_imucqxk", "score": "75", "subreddit": "india", "subreddit_id": "t5_2qh1q"}, {"author": "gragev95", "body": "Hi u/Purple_soup, how was your interview? I will also have mine in SF later this month and would like to know what it was like, what they asked and what documents you brought with you, if you can still remember. Thanks!", "created_utc": "1662151069.0", "edited": "False", "id": "imue7ed", "is_submitter": "False", "link_id": "t3_p1tqek", "parent_id": "t3_p1tqek", "score": "1", "subreddit": "IndiansAcrossTheWorld", "subreddit_id": "t5_11fur6"}, {"author": "gragev95", "body": "Hi u/therationaltroll, did you have your interview? I will also have mine in SF later this month and would also like to know what it was like, what they asked and what documents you brought with you.", "created_utc": "1662150773.0", "edited": "False", "id": "imudhfu", "is_submitter": "False", "link_id": "t3_v4cdnc", "parent_id": "t3_v4cdnc", "score": "1", "subreddit": "nri", "subreddit_id": "t5_2se46"}, {"author": "gragev95", "body": "I used to walk through/take the bus from Old Steine a lot and there was often this skinny lady asking for 40p to get a bus to the hospital or something. Happened to me multiple times 4-8 years ago, not sure if it's the same lady.", "created_utc": "1662058924.0", "edited": "False", "id": "imp39qk", "is_submitter": "False", "link_id": "t3_x347p0", "parent_id": "t1_imo4gac", "score": "4", "subreddit": "brighton", "subreddit_id": "t5_2qprp"}, {"author": "gragev95", "body": "Warcraft\n\nI was dragged to the cinema by someone and I can usually find some entertainment in any movie but I literally had to walk out because I was so bored.", "created_utc": "1662056452.0", "edited": "False", "id": "imowtz2", "is_submitter": "False", "link_id": "t3_x2pa9l", "parent_id": "t3_x2pa9l", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "gragev95", "body": "Oh yeah, same! Finnish is my first language, his is Hindi, we speak English together and live in an English-speaking area with a lot of Hispanic people so Spanish is everywhere. We're learning each other's mother tongues.\n\nHe grew up surrounded by different Indian languages (Sanskrit, Marathi, Tamil, Kannada etc.) and also learned some Mandarin while living in Singapore. I have studied Swedish (+ the other Scandinavian languages), German, French, and Japanese.\n\nWe use words and phrases from all these languages all the time, some of them are very incorporated in our daily life and I feel like I'm learning something new all the time - it's fun! 😁", "created_utc": "1661972172.0", "edited": "False", "id": "imk3q3g", "is_submitter": "False", "link_id": "t3_x20i3n", "parent_id": "t1_imi4ink", "score": "4", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "gragev95", "body": "Then just imagine the fact that when you see a foreign movie at the cinema in Finland, they have both Finnish and Swedish subtitles on top of each other. 😁 Somehow it works, and when you're used to it you don't even notice.", "created_utc": "1661971318.0", "edited": "False", "id": "imk1gvc", "is_submitter": "False", "link_id": "t3_x1zdqa", "parent_id": "t1_imh06ow", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "gragev95", "body": "Depends on your level I think.\n\nWhere I'm at right now with Hindi, I have English subtitles on and just make sure to listen to the audio really well and it helps me pick up some words, phrases, sentence structures etc. I find that it also improves my pronunciation. Most of the time, I can't follow the plot properly if I don't have English subtitles on and miss important details.\n\nOnce I understand a little more (only miss a word here and there), I'm going to start watching stuff with Hindi (romanised) subtitles.", "created_utc": "1661971191.0", "edited": "False", "id": "imk14vz", "is_submitter": "False", "link_id": "t3_x1zdqa", "parent_id": "t3_x1zdqa", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "gragev95", "body": "Funny, I was reading points 3 and 4 and wondering whether it's the same Fremont you're talking about. I moved here from Europe (Finland/UK) earlier this year and I feel like I barely see any cyclists or pedestrians around. 😅\n\nInteresting observations!", "created_utc": "1661939663.0", "edited": "False", "id": "imi36nj", "is_submitter": "False", "link_id": "t3_x1rsw6", "parent_id": "t3_x1rsw6", "score": "3", "subreddit": "Fremont", "subreddit_id": "t5_2st1m"}, {"author": "gragev95", "body": "Asun ulkomailla ja muutama vuosi sitten tuli kaveri Suomesta puoleksitoista viikoksi kylään. Asuin pienessä kämpässä ja hän nukkui keskellä olohuonetta. Puolitoista viikkoa suunnittelin kaikki ruokailut ja menemiset ja hän arvosteli mun muovimattoja ja ihmetteli kun kylppärissä ei ollut edes lattialämmitystä. Maksoin reilun 20 neliön kämpästäni silloin opiskelijana puolet enemmän kuin hän Itä-Suomessa omasta kolmiostaan. 🙄 Hän valitti kaikesta ja puhui asuinmaastani hyvin negatiiviseen/vähättelevään sävyyn. Olin muutaman päivän jälkeen jo ihan loppu, muttaa hän oli masentunut (kuten minäkin) ja vieraassa maassa, joten en kehdannut sanoa mitään tai potkia pihalle. Yritin kyllä tsempata ja pitää tunnelman positiivisena. Hänen lähtönsä jälkeen siivosin kokispurkkeja hänen vierassänkynsä alta. Ei olla oltu erityisemmin tekemisissä tämän vierailun jälkeen.", "created_utc": "1661798744.0", "edited": "False", "id": "imafv7r", "is_submitter": "False", "link_id": "t3_x036lj", "parent_id": "t3_x036lj", "score": "2", "subreddit": "Suomi", "subreddit_id": "t5_2qlq3"}, {"author": "gragev95", "body": "Never have I appreciated clean air more than after a November in Ghaziabad/Delhi. The first few days, I always keep coughing up grey phlegm. After that, you kind of get used to it but realise that you don't really remember what fresh air feels like. It's the main reason I could never live in NCR long-term.", "created_utc": "1661724663.0", "edited": "False", "id": "im6le6k", "is_submitter": "False", "link_id": "t3_wzm46w", "parent_id": "t1_im3pg9g", "score": "1", "subreddit": "india", "subreddit_id": "t5_2qh1q"}, {"author": "gragev95", "body": "There's a great show on HBO Max called The Dog House UK which is all about shelter/rescue dogs, and it sometimes goes into detail on why people give up their pets, but also gives a good idea of the variety of dogs that get abandoned and the issues new owners may face and how to get over them etc. The UK also has a huge homeless dog issue and I used to have a rescue staffie (small pitbull type) from a shelter many years ago.", "created_utc": "1661654399.0", "edited": "False", "id": "im2yqt8", "is_submitter": "False", "link_id": "t3_wzbmqc", "parent_id": "t1_im2e32c", "score": "1", "subreddit": "bayarea", "subreddit_id": "t5_2qjyy"}, {"author": "gragev95", "body": "Pui yuet? (I recently saw this video by a Canadian living in Hong Kong: [https://youtu.be/0veTFRTMcT8](https://youtu.be/0veTFRTMcT8))  \nThat does sound cheap, I've heard of it being quite a bit more expensive than that in HK.", "created_utc": "1661561296.0", "edited": "False", "id": "ilxzh1i", "is_submitter": "False", "link_id": "t3_wyfpnb", "parent_id": "t1_ilxe5tu", "score": "1", "subreddit": "bayarea", "subreddit_id": "t5_2qjyy"}, {"author": "gragev95", "body": "Yeah I've noticed this too. Dark humour and sarcasm is sometimes seen as rudeness/a bit too much/weird by some. 😅 And then I watch the ads here and find none of them funny.", "created_utc": "1661460966.0", "edited": "False", "id": "ils8zd1", "is_submitter": "False", "link_id": "t3_wxduqg", "parent_id": "t1_ilrq2bg", "score": "1", "subreddit": "bayarea", "subreddit_id": "t5_2qjyy"}, {"author": "gragev95", "body": "I always find myself only shopping at these kinds of places on special occasions/when I need something specific that I can't find elsewhere. There's no way I could afford doing my weekly shopping here.", "created_utc": "1661454715.0", "edited": "False", "id": "ilrsw13", "is_submitter": "False", "link_id": "t3_wuztri", "parent_id": "t1_ildovl0", "score": "1", "subreddit": "vegan", "subreddit_id": "t5_2qhpm"}, {"author": "gragev95", "body": "Finland is the most overall vegan-friendly country I have been (but I may be biased). I find that in most countries in Europe and elsewhere, there may be cities or parts of the country that are great but as soon as you leave those areas, it's really hard to find anything. In Finland, pretty much all cafés, petrol stations, grocery shops etc. have at least a decent selection of vegan stuff. I used to live in Brighton, UK for years and it was amazing to have so many options within walking distance but smaller towns and the countryside in the UK is generally not great for vegans.\n\nI found it pretty easy to be vegan in Toronto. This post was very helpful: https://justinpluslauren.com/best-vegan-restaurants-toronto/", "created_utc": "1661454328.0", "edited": "False", "id": "ilrrx0j", "is_submitter": "False", "link_id": "t3_wtw6f8", "parent_id": "t3_wtw6f8", "score": "1", "subreddit": "vegan", "subreddit_id": "t5_2qhpm"}, {"author": "gragev95", "body": "Interesting to hear this because I also moved here from the UK but I'm originally from Finland and I feel like the cultural difference between the UK and the US is much smaller than the one between Finland and the UK. I haven't felt a big culture shock after living in the UK for a big chunk of the last decade. I see a lot of similarities between the UK and the US. But American sense of humour is very hit or miss for me still.", "created_utc": "1661453253.0", "edited": "False", "id": "ilrp4i0", "is_submitter": "False", "link_id": "t3_wxduqg", "parent_id": "t1_ilrir4y", "score": "3", "subreddit": "bayarea", "subreddit_id": "t5_2qjyy"}, {"author": "gragev95", "body": "Take it slow with street food. I'm non-Indian and got bad food poisoning (hospitalised for two days) on my 5th visit after eating some pani puri at a mall. I usually opt for reputable restaurants and home food.", "created_utc": "1661369936.0", "edited": "False", "id": "ilmwo7m", "is_submitter": "False", "link_id": "t3_wwi5pv", "parent_id": "t3_wwi5pv", "score": "1", "subreddit": "india", "subreddit_id": "t5_2qh1q"}, {"author": "gragev95", "body": "This right here. I'm vegan (no animal products, including milk) and always choose the vegan meal (sticker should say VGML). Sometimes I have received something with milk (creamer, margarine with milk solids) with my vegan meal but I've never had meat or egg. The main is usually the same as vegetarian meal anyway, and the special meals are usually served first. :D", "created_utc": "1661369671.0", "edited": "False", "id": "ilmvz04", "is_submitter": "False", "link_id": "t3_wvubu6", "parent_id": "t1_ili80de", "score": "2", "subreddit": "india", "subreddit_id": "t5_2qh1q"}, {"author": "gragev95", "body": "I'm a non-Indian (Nordic/European) person married to an Indian guy in the US. We were also long distance for the first many years of our relationship/marriage while I was still living in Europe.\n\nWe were pretty sure that his traditional parents in India would not be OK with our relationship but he told them about me very soon after we made it official and he was ready to fight for us. Surprisingly, they have accepted me as a part of the family. I'm learning their language (and he's learning mine) and sure, it is a bit frustrating not being able to communicate properly but nobody is expecting me to be fluent at this point. Like you said, it takes years.\n\nNo one should be forcing you to conform to Indian culture and you shouldn't feel like you need to turn into an Indian girl for his family. Any adjustment should be happening out of your own free will, and it should be happening from his side too.\n\nSorry but he is clearly not committed to you. It sounds like you have tried to communicate your concerns with him for a long time. You should stop wasting your time (26 is not too old!) and move on. All the best!", "created_utc": "1661368756.0", "edited": "False", "id": "ilmtjn2", "is_submitter": "False", "link_id": "t3_ww29xv", "parent_id": "t3_ww29xv", "score": "2", "subreddit": "india", "subreddit_id": "t5_2qh1q"}, {"author": "gragev95", "body": "I agree. I'm a Finn living in the US and although the questioning has eased a bit since I got permanent residency, the anxiety is still there because of all my previous experiences. I'm a bit worried for when my family come and visit at some point. Outside of the airport/CBP, I've been constantly surprised by how friendly Americans are.  \n\n\nGlad you've enjoyed your time in Finland and welcome back!", "created_utc": "1661366533.0", "edited": "False", "id": "ilmno38", "is_submitter": "False", "link_id": "t3_ww7b0b", "parent_id": "t1_iljypif", "score": "3", "subreddit": "Finland", "subreddit_id": "t5_2qztz"}, {"author": "gragev95", "body": "I think you'll be shocked to find out how many baby cows are killed in the dairy industry.", "created_utc": "1661056985.0", "edited": "False", "id": "il5nani", "is_submitter": "False", "link_id": "t3_wt5saa", "parent_id": "t1_il26e76", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "gragev95", "body": "Wow, I'm a Finnish vegan and I had no idea this place existed. Wish I had known when I visited Brazil a few years ago! Next time for sure, seems really interesting.", "created_utc": "1660939827.0", "edited": "False", "id": "ikz9bnf", "is_submitter": "False", "link_id": "t3_wnqav8", "parent_id": "t3_wnqav8", "score": "1", "subreddit": "Finland", "subreddit_id": "t5_2qztz"}, {"author": "gragev95", "body": "Same here. I was 21 and he was 26 when we started talking, got married when I had just turned 25 and he was about to turn 30 (so 5 years of difference).", "created_utc": "1660915302.0", "edited": "False", "id": "ikxiqns", "is_submitter": "False", "link_id": "t3_wroy9a", "parent_id": "t1_iktiafi", "score": "1", "subreddit": "ask", "subreddit_id": "t5_2qhlj"}, {"author": "gragev95", "body": "These kinds of things just make it harder for us vegans and vegetarians, when somebody calls themselves vegan or vegetarian but is stk ok with meat etc. \"sometimes\". Non-veg people, be it relatives/friends/restaurant workers, they get confused and think that all of us are fine with a little meat here and there. 🙄", "created_utc": "1660856828.0", "edited": "False", "id": "ikuinc2", "is_submitter": "False", "link_id": "t3_wr6bbi", "parent_id": "t3_wr6bbi", "score": "1", "subreddit": "IndianMatchmaking", "subreddit_id": "t5_2s8cga"}, {"author": "gragev95", "body": "We'd known each other for over 8 years by the time we'll finally met IRL. Had been kind of romantic for about two years at that point.", "created_utc": "1660763063.0", "edited": "False", "id": "ikp05e0", "is_submitter": "False", "link_id": "t3_wqm8h8", "parent_id": "t3_wqm8h8", "score": "3", "subreddit": "wemetonline", "subreddit_id": "t5_2svz3"}, {"author": "gragev95", "body": "I want to see more Indian-born Indians in the US (preferably in California/Bay Area) who are looking to meet people still living in India. There are literally hundreds of thousands of Indians here and this seems to be a super common scenario here and I want to understand why? :D", "created_utc": "1660693565.0", "edited": "False", "id": "ikl7uwy", "is_submitter": "False", "link_id": "t3_wp7l3y", "parent_id": "t3_wp7l3y", "score": "3", "subreddit": "IndianMatchmaking", "subreddit_id": "t5_2s8cga"}, {"author": "gragev95", "body": "I've seen some pretty sketchy stuff on BART regardless of the time of the day but never felt I was in danger or anything.", "created_utc": "1660620922.0", "edited": "False", "id": "ikh4ahl", "is_submitter": "False", "link_id": "t3_wns2xb", "parent_id": "t1_ikgwj87", "score": "2", "subreddit": "bayarea", "subreddit_id": "t5_2qjyy"}, {"author": "gragev95", "body": "All our Indian friends go to ID (Idly Dosa) Company in Newark for South Indian. It seems to be really popular and I think the Mysore masala dosa and podi idly are good.", "created_utc": "1660595790.0", "edited": "False", "id": "ikfi2j7", "is_submitter": "False", "link_id": "t3_wnw64k", "parent_id": "t3_wnw64k", "score": "1", "subreddit": "bayarea", "subreddit_id": "t5_2qjyy"}, {"author": "gragev95", "body": "Hmm yeah I took the last BART from Oakland towards Berryessa on Saturday and it was fine. Sometimes it's worse, but those new trains are actually pretty nice and the Milpitas station is amazing!", "created_utc": "1660594191.0", "edited": "False", "id": "ikfdts0", "is_submitter": "False", "link_id": "t3_wns2xb", "parent_id": "t1_ik9j5xo", "score": "2", "subreddit": "bayarea", "subreddit_id": "t5_2qjyy"}, {"author": "gragev95", "body": "Oh man, I'd been warned about street food ever since I first visited India and I grew up in a country where everyone working anywhere near food needs to do a hygiene course, restaurants get checked all the time and have to show their ratings to customers etc. so I definitely don't have those antibodies. 😅 So I was always super careful when eating out, just home food 99% of the time, and everybody was amazed that I never even got an upset stomach. 😂 Then last year during my fifth visit, I ate some pani puri and momos at a mall in Udaipur on the way to the airport, got sick and spent two days on an IV at a hospital. 🥲", "created_utc": "1660265398.0", "edited": "False", "id": "ijxml6m", "is_submitter": "False", "link_id": "t3_wlxr8z", "parent_id": "t1_ijwbdpq", "score": "31", "subreddit": "india", "subreddit_id": "t5_2qh1q"}, {"author": "gragev95", "body": "Yeah seriously, why are all the bars here so loud? Even the ones that are clearly not meant for dancing. I miss going to pubs in the UK just to chill, listen to good music and to chat with friends.", "created_utc": "1660184307.0", "edited": "False", "id": "ijt0opk", "is_submitter": "False", "link_id": "t3_wk86ga", "parent_id": "t1_ijn28b1", "score": "1", "subreddit": "bayarea", "subreddit_id": "t5_2qjyy"}, {"author": "gragev95", "body": "Indigo Burger in Newark!", "created_utc": "1660183865.0", "edited": "False", "id": "ijszppf", "is_submitter": "False", "link_id": "t3_wkqz1v", "parent_id": "t3_wkqz1v", "score": "1", "subreddit": "bayarea", "subreddit_id": "t5_2qjyy"}, {"author": "gragev95", "body": "Sorry to hear that, I hope you find him soon. I used to have a rescue staffie back in the UK and I can only imagine how you're feeling.", "created_utc": "1660183250.0", "edited": "False", "id": "ijsycf5", "is_submitter": "False", "link_id": "t3_wkkvuq", "parent_id": "t3_wkkvuq", "score": "1", "subreddit": "bayarea", "subreddit_id": "t5_2qjyy"}, {"author": "gragev95", "body": "I think this may be based on the World Happiness Report: [https://worldhappiness.report/](https://worldhappiness.report/) (you can read the methodology/criteria over there)\n\nMy homeland, Finland, has topped this ranking for five years in a row. I wouldn't say that Finnish people are beaming and screaming out of happiness every day but it's more a feeling of contentment.\n\nWe have progressively high taxes but free/very cheap healthcare, free education (including university), good infrastructure and good social services so pretty much everyone gets an equal chance to succeed in life. If you become unemployed or have health (including mental health) issues that make you unable to work, you get government assistance to still live a decent life and to help you get back on track. We also rank very high when it comes to freedom of speech and gender equality.\n\nIt's a small country of 5.5 million people who are quite culturally homogeneous and have a strong community spirit because of our history (we were occupied by Sweden and Russia for hundreds of years until our independence in 1917). On paper it may be a majority-Christian country but in practice, it's a very secular country and religion does not cause a lot of conflict or affect our morals. Especially the younger generation is generally tolerant, progressive, and open about mental health and things like that.\n\nEven after independence, we went through some wars and were definitely not a wealthy country, so spending time in nature and enjoying the little things in life are very ingrained in the culture. In general, Finns appreciate minimalism and don't put a lot of emphasis on material things. Most people are a bit introverted and enjoy spending time on their own. Families are close but people value independence and privacy.\n\nMy Indian husband was amazed the first time he visited that even the smallest villages had pretty much the same level of development in terms of infrastructure, good schools, high quality housing as any bigger city. It's not a perfect country by any means, there are still issues and the winters are harsh (cold and extremely dark) but on average, things are good.", "created_utc": "1660179141.0", "edited": "1660179369.0", "id": "ijsoyxc", "is_submitter": "False", "link_id": "t3_wkwr7j", "parent_id": "t3_wkwr7j", "score": "1", "subreddit": "india", "subreddit_id": "t5_2qh1q"}, {"author": "gragev95", "body": "I have really enjoyed the food (+ service + vibe) at these places:\n\n• Merit Vegan in Sunnyvale - visited the first time I came here, the food is consistently good, and there's this one guy working there who's just so sweet, always great service\n\n• Spices in Fremont - recent discovery, been looking for good Hunan/Sichuan food for a while, loved the hot and sour cucumber salad, and spicy sizzling eggplant and tofu\n\n• Shizen in SF - Japanese, nice aesthetic, innovative food and cocktails, special occasions kind of a place\n\n• Ettan in Palo Alto - Cal-Indian fusion, great vibe for a special occasion, really enjoyed the edamame vada, sesame leaf chaat, and corn kofte\n\n• Zareen's in Palo Alto/Mountain View/Redwood City - North Indian/Pakistani \"fast food\", I always get the aloo tikki thali, everything about it is tasty\n\n• ID (Idly Dosa) Company in Newark - good quality South Indian food, Mysore Masala dosa and karam podi idly are my go-to, first time I've seen dosas with vegan meat in them on the menu but haven't tried them yet\n\n• RawASF in Fremont/Milpitas - the jalapeño burger is so delicious I've never tried anything else 😅, a friend ordered a coffee and said it was good as well\n\n• Indigo Burger in Newark - all-vegan burger joint, only been once but everything we ordered (Indigo burger, friend chic'n sandwich, seasoned fries and a strawberry milkshake) was seriously great,\n\n• Coconuts in Palo Alto - Jamaican food, I love the jerk tofu\n\n• Golden Era in SF - one of the best if not the best Chinese place I've tried, the Spicy Mongolian Delight is amazing\n\nI moved here quite recently so I haven't found any regular absolute favourites yet, hence the long list. 😅", "created_utc": "1660169397.0", "edited": "1660170060.0", "id": "ijs25ew", "is_submitter": "False", "link_id": "t3_wkjbbm", "parent_id": "t3_wkjbbm", "score": "2", "subreddit": "bayarea", "subreddit_id": "t5_2qjyy"}, {"author": "gragev95", "body": "Yep, next to RawASF and Banter Bookshop. It's been under renovation for a while now so should hopefully be opening soon.", "created_utc": "1660165201.0", "edited": "False", "id": "ijrrbza", "is_submitter": "False", "link_id": "t3_wkjbbm", "parent_id": "t1_ijq5lre", "score": "1", "subreddit": "bayarea", "subreddit_id": "t5_2qjyy"}, {"author": "gragev95", "body": "Oh nice, I'll need to check out Elmwood. How much would you pay for a 1-bed 1-bath there? We pay a bit under $2K here in Fremont, it's not super modern but freshly renovated and the complex is super green and next to everything we need (which is essential because we don't have a car).", "created_utc": "1660162235.0", "edited": "False", "id": "ijrjczl", "is_submitter": "False", "link_id": "t3_wk8u17", "parent_id": "t1_ijp7sbu", "score": "1", "subreddit": "bayarea", "subreddit_id": "t5_2qjyy"}, {"author": "gragev95", "body": "$1945 ($1783 on average with one month off) for a pretty spacious 1-bed 1-bath in a nice lush apartment complex in Fremont 😊", "created_utc": "1660079743.0", "edited": "False", "id": "ijmtjy8", "is_submitter": "False", "link_id": "t3_wjlks5", "parent_id": "t3_wjlks5", "score": "1", "subreddit": "bayarea", "subreddit_id": "t5_2qjyy"}, {"author": "gragev95", "body": "I'm a North European immigrant living in Fremont with my Asian (Indian/Singaporean) husband. Fremont is about 63% Asian and our apartment complex is (accidentally) like 99% Indian. Basically all of our friends and acquaintances here are (South/SE/East) Asian.  \n\n\nWe chose to live next to amenities and it's easy to get to SF and other parts of Fremont/Newark/Hayward by public transport but ideally I would love to live somewhere more walkable. I grew up and lived in Europe until recently and I feel like there are very few places here that are anywhere close to as vibrant and walkable as most places in Europe. When I lived in a similarly-sized (by population) city in the UK, I used to walk EVERYWHERE - to work, shops/pubs/cafés, to meet friends.   \n\n\nThis area is relatively affordable compared to a lot of areas: for example, to live in a similar apartment as we do here in Fremont, we would have to pay about 50% more in Berkeley. Those more vibrant, walkable areas tend to be more expensive and I think this plays a big part in why people choose to live here.", "created_utc": "1660078830.0", "edited": "False", "id": "ijmr7js", "is_submitter": "False", "link_id": "t3_wk8u17", "parent_id": "t3_wk8u17", "score": "109", "subreddit": "bayarea", "subreddit_id": "t5_2qjyy"}, {"author": "gragev95", "body": "I absolutely loved living next to the orange orchard in north SJ a couple of years back. I can only imagine how lovely it must have been before all the others disappeared! The center feels pretty dead but looks like it could have potential to be much more fun and lively.", "created_utc": "1659749481.0", "edited": "False", "id": "ij4s592", "is_submitter": "False", "link_id": "t3_wh7y9h", "parent_id": "t1_ij46bh3", "score": "1", "subreddit": "bayarea", "subreddit_id": "t5_2qjyy"}, {"author": "gragev95", "body": "Which country are you moving from? :)\n\nFremont is kind of a weird one because it's a union of I think four or five (historically independent) towns, each with its own little centre. Niles is cute but more like a cafés/antique shops/parks/ice cream shops/farmer's markets kind of a place. The \"center\" center (Fremont Hub area/Capitol Ave) seems to be under development and I think it'll be really nice in a couple of years (it's already got a new events center and some cafés and a book shop) but you won't find any clubs here. 😅\n\nI don't know if some other city in the East/South Bay has more bars/clubs but tbh I think NYC will be a better choice for you if you're looking for night life and that kind of a thing. I'm not a big drinker or keen on clubbing but I enjoyed the pub culture in the UK and I haven't found anything like that here. Palo Alto has some bars (thanks to Stanford and all the students I guess) but I feel like everywhere closes really early here, even in SF. I used to love sitting at a pub, chatting and listening to music until late at night but if you walk in downtown PA or Redwood City, by 10 p.m. it's pretty dead even during the weekend.", "created_utc": "1659748508.0", "edited": "False", "id": "ij4q4b7", "is_submitter": "False", "link_id": "t3_wgybbe", "parent_id": "t1_ij3ek7j", "score": "1", "subreddit": "bayarea", "subreddit_id": "t5_2qjyy"}, {"author": "gragev95", "body": "I'm in my 20s, from Europe (Finland/UK), and I love it here in the Bay Area. My husband used to work at the MPK office and lot of our friends still do, and we all live just across the Dumbarton bridge in Fremont (there's a shuttle).\n\nI've visited both NYC and Seattle and while they do have more of a city feel than most of the Bay Area, the weather is colder/gloomier and the vibe is a bit different. Depending on where you are in the Bay Area, the weather is always at least good and almost always sunny. I don't have a car so it's a bit tricky sometimes but public transport is alright and it's easy to get to SF when you miss that city feel. The nature around us is amazing and I feel like there's stuff to do (Palo Alto, Mountain View, Sunnyvale, Redwood City downtowns are cute) especially if you enjoy being outdoors.\n\nIt's expensive for sure but I don't think either of your other options is much more affordable. $120K should be more than sufficient.", "created_utc": "1659719397.0", "edited": "1659727159.0", "id": "ij2s6nk", "is_submitter": "False", "link_id": "t3_wgybbe", "parent_id": "t3_wgybbe", "score": "3", "subreddit": "bayarea", "subreddit_id": "t5_2qjyy"}, {"author": "gragev95", "body": "Two adults, we spend about $600-650 on food per month. This includes three daily meals + snacks at home and occasional eating out (once in 1-2 weeks). \n\nI'd like to say we eat well, relatively healthy and as much as we'd like. We're both vegan and buy vegan meats and other processed stuff in moderation - beans, lentils, seitan and tofu are our staple proteins. We have a Target, Safeway, Trader Joe's and an Indian store nearby and we buy stuff wherever it's cheapest. :) We usually make a meal plan on Sunday and then buy stuff based on that. We cook enough for 2-3 meals every night and then have the previous night's food for lunch the next day.", "created_utc": "1659690928.0", "edited": "1659750302.0", "id": "ij15xuy", "is_submitter": "False", "link_id": "t3_wg87c7", "parent_id": "t3_wg87c7", "score": "2", "subreddit": "bayarea", "subreddit_id": "t5_2qjyy"}, {"author": "gragev95", "body": "This happened to me a couple of times at the US border before we were married.\n\nFirst time, I told the officer I was visiting a friend for a few weeks, he asked if it was a friend or a boyfriend and I said boyfriend. He went on to ask about how and when we met, his immigration status and nationality. After that his questions and comments seemed to imply that my now-husband was a predatory brown person who was surely seeing other girls while I was not there. 🙄 Couldn't really say anything back in that situation.  \n\n\nI was kind of shaken by this, so the next time a few months later I was really nervous. I had all the proof (university enrolment certificate from Europe, lease agreement, return tickets) but they wouldn't believe that I was going to go back after my six weeks in the US. Eventually, they let me through but the whole thing caused a lot of anxiety.  \n\n\nBut then the next time it was all fine. They just asked me if I'd visited before, where I was planning to go and just let me through. It's all about luck, what kind of an officer you happen to get. Sorry you had to experience this! It'll be fine, just make sure you always have as much proof as possible.", "created_utc": "1659126356.0", "edited": "False", "id": "ii69fjp", "is_submitter": "False", "link_id": "t3_wb87ok", "parent_id": "t3_wb87ok", "score": "4", "subreddit": "LongDistance", "subreddit_id": "t5_2s6ky"}, {"author": "gragev95", "body": "Banana in Hindi is \"to make\" but 🍌 in basically every other language \n\n(Banana in Hindi is \"kela\" केला)", "created_utc": "1659086308.0", "edited": "False", "id": "ii3tmak", "is_submitter": "False", "link_id": "t3_wa5c1m", "parent_id": "t3_wa5c1m", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "gragev95", "body": "I'm a foreigner (from Finland) with an Indian husband and I get so many of these \"white woman married to an Indian guy\" accounts in my recommendations. They can get thousands and millions of followers just by saying namaste or wearing a saree and doing some reels with Bollywood songs. 🤯 I find it kind of cringy tbh although I understand this need for validation (Finns also get super excited about acknowledgement from foreigners).", "created_utc": "1659083573.0", "edited": "False", "id": "ii3q9ea", "is_submitter": "False", "link_id": "t3_waa83w", "parent_id": "t1_ii07bfk", "score": "7", "subreddit": "india", "subreddit_id": "t5_2qh1q"}, {"author": "gragev95", "body": "I'm also not Indian (I'm Finnish) but my husband is and most of our friends are. One of our friends had a child last year and everyone kept calling her \"beautiful\". I thought it was kind of a weird word choice, why not cute or something? Took me a while to realise it was code for \"light-skinned\". 🙄\n\nMy husband also gets weird comments from people (mostly strangers) when we visit India because nobody can believe a \"fair\" blue-eyed foreigner would marry a dark-skinned person. 🤦🏼‍♀️", "created_utc": "1659082684.0", "edited": "1659082871.0", "id": "ii3p5bl", "is_submitter": "False", "link_id": "t3_waa83w", "parent_id": "t1_ii0bb59", "score": "9", "subreddit": "india", "subreddit_id": "t5_2qh1q"}, {"author": "gragev95", "body": "For sure, it happens, but also London doesn't really represent the whole country. Where I lived (another major city with a lot of tourists), I never heard about a car having been broken into. My aunt who still lives there is a freelance photographer and always keeps most of her equipment in her car - no expensive cameras of course. But then again, most of my friends don't have or need a car because there's proper public transport. 🤷‍♀️", "created_utc": "1659049888.0", "edited": "False", "id": "ii20vyx", "is_submitter": "False", "link_id": "t3_w9ii7q", "parent_id": "t1_ihxhbgd", "score": "1", "subreddit": "bayarea", "subreddit_id": "t5_2qjyy"}, {"author": "gragev95", "body": "I grew up in Finland, then lived in the UK for years, moved to the US six months ago. I've extensively travelled around Europe by car. Recently visited family in Finland and told them not to leave anything in the car, they said not to worry. It's something that I've only just learned since living here - cars don't get broken into like this in many places. Obviously you shouldn't leave electronics or piles of cash on the seats but I've never seen it this bad anywhere else. So I wouldn't blame the tourists. It's exceptionally bad here.", "created_utc": "1658958473.0", "edited": "False", "id": "ihwr6xo", "is_submitter": "False", "link_id": "t3_w9ii7q", "parent_id": "t1_ihvgqhd", "score": "16", "subreddit": "bayarea", "subreddit_id": "t5_2qjyy"}, {"author": "gragev95", "body": "Guys, where can I get good vegan pizza? I'm sick of cauliflower crusts 😭 I'm vegan not celiac", "created_utc": "1658621106.0", "edited": "False", "id": "ihdxdko", "is_submitter": "False", "link_id": "t3_w6c8oy", "parent_id": "t3_w6c8oy", "score": "1", "subreddit": "bayarea", "subreddit_id": "t5_2qjyy"}, {"author": "gragev95", "body": "I used to live in one of the flata right opposite from Casablancas and they played the exact same songs every single Friday. Single-layer windows and they used to keep their doors open so I could hear it as if I was there. Until 2 a.m. 🥲", "created_utc": "1658475999.0", "edited": "False", "id": "ih5uqjc", "is_submitter": "False", "link_id": "t3_w4f8y8", "parent_id": "t1_ih30nwn", "score": "3", "subreddit": "brighton", "subreddit_id": "t5_2qprp"}, {"author": "gragev95", "body": "This! I wanted to go to a concert of an artist I like, went to buy the tickets but it wasn't possible. Instead, I would have needed to subscribe to some service for $99 a month which would have given me access to some other concerts and events too... No! I just wanted to go to that one concert. Didn't end up going.", "created_utc": "1657846330.0", "edited": "False", "id": "ig7clgm", "is_submitter": "False", "link_id": "t3_vyxka4", "parent_id": "t1_ig5ewa7", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "gragev95", "body": "And fake British ones. I went to a mostly English-speaking high school in a non-English-speaking country and had a couple of these \"Anglophile\" girls who were obsessed with Doctor Who, Benedict Cumberbatch, Harry Potter etc. and spoke with this really bad \"British\" accent. It wasn't even the accent that annoyed me but the fact that they claimed to have a British accent when they most definitely didn't. 😂", "created_utc": "1657300140.0", "edited": "False", "id": "ifd7z1a", "is_submitter": "False", "link_id": "t3_vtvtlw", "parent_id": "t1_ifb9ghc", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "gragev95", "body": "Where can I find it?", "created_utc": "1657246131.0", "edited": "False", "id": "ifah5g6", "is_submitter": "False", "link_id": "t3_vtsl84", "parent_id": "t1_ifa77f7", "score": "1", "subreddit": "oddlysatisfying", "subreddit_id": "t5_2x93b"}, {"author": "gragev95", "body": "South/East", "created_utc": "1656648329.0", "edited": "False", "id": "ieesymi", "is_submitter": "False", "link_id": "t3_vn75zt", "parent_id": "t1_iecu03n", "score": "1", "subreddit": "bayarea", "subreddit_id": "t5_2qjyy"}, {"author": "gragev95", "body": "My husband is Indian (born and raised there, lived in Singapore for a decade before moving here) and I'm a white immigrant from Northern Europe (Finland), and we barely see other interracial couples here. All of our South Asian friends and neighbours married within their community. I feel like it's a bit more common in SF.", "created_utc": "1656612827.0", "edited": "False", "id": "ieck3vk", "is_submitter": "False", "link_id": "t3_vn75zt", "parent_id": "t1_iebwv6r", "score": "1", "subreddit": "bayarea", "subreddit_id": "t5_2qjyy"}, {"author": "gragev95", "body": "I haven't been yet but thinking of taking my ~20yo brothers to Musée Mécanique (like an old-school arcade) which looks really cool", "created_utc": "1656569523.0", "edited": "False", "id": "ieac9b1", "is_submitter": "False", "link_id": "t3_vo05lt", "parent_id": "t3_vo05lt", "score": "5", "subreddit": "bayarea", "subreddit_id": "t5_2qjyy"}, {"author": "gragev95", "body": "My husband was living in Sunnyvale when we met and he's attractive AF. 🤔 We live in the East Bay now so maybe that brought the rating down. 😝 Seriously though, seems a bit sus that all the \"least attractive\" people live in places with high numbers of POC. 🤔", "created_utc": "1656488357.0", "edited": "False", "id": "ie5rkmt", "is_submitter": "False", "link_id": "t3_vn75zt", "parent_id": "t3_vn75zt", "score": "8", "subreddit": "bayarea", "subreddit_id": "t5_2qjyy"}, {"author": "gragev95", "body": "I'm learning Hindi and I hate it when I'm in India and people ask me to say something in Hindi... 😫", "created_utc": "1656380528.0", "edited": "False", "id": "ie03jwb", "is_submitter": "False", "link_id": "t3_vlyz1l", "parent_id": "t3_vlyz1l", "score": "4", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "gragev95", "body": "Basic soya milk (Silk) is my go-to but I like Oatly and Not Milk too. Not everyone likes everything but there are so many options, try them and you'll find your favourites.", "created_utc": "1656378964.0", "edited": "False", "id": "ie00aif", "is_submitter": "False", "link_id": "t3_vm6rz8", "parent_id": "t1_idzl4ls", "score": "3", "subreddit": "interestingasfuck", "subreddit_id": "t5_2qhsa"}, {"author": "gragev95", "body": "I just moved here in January, from a European country with good public transport. I don't have a car and I was really keen to take advantage of having a BART station near me. I've gone up to SF a few times now and it's been a really mixed experience.\n\nI feel like I need to stay alert all the time. People are openly doing drugs on the trains. You can barely see through the windows, it's so dirty and worn down. When my Clipper card wasn't scanning properly and I couldn't get through the gates (which seemed to be a BART issue because on buses it always works just fine), there was either no staff around or they were really reluctant to help (literally told me it was my own problem and they couldn't help). I'd still really love to use public transport here but currently I'm happy I don't need to take BART often. 😔", "created_utc": "1656021512.0", "edited": "False", "id": "idhh18c", "is_submitter": "False", "link_id": "t3_vimweh", "parent_id": "t1_ideebwz", "score": "9", "subreddit": "bayarea", "subreddit_id": "t5_2qjyy"}, {"author": "gragev95", "body": "That's amazing! Beans, lentils, and even tofu and tempeh are still cheap compared to meat. Beans are 99 cents a can at Sprouts and if you're willing to go through a little effort, dried beans are even cheaper. Tofu is less than $1.50 for a 14-oz pack in a lot of places, Trader Joe's I think has the cheapest tempeh.  \n\n\nCheck out Indian stores like Bharat Bazaar and other Asian and Middle Eastern stores for cheap big bags of lentils, beans and nuts. Masoor daal (red split lentils) is my favourite taste-wise and it's also so fast to cook! Vegan Richa and The Korean Vegan's books and blogs are full of fail-proof recipes, definitely my go-to for any Indian or Korean recipes.", "created_utc": "1655308909.0", "edited": "False", "id": "icgwff9", "is_submitter": "False", "link_id": "t3_vch9c0", "parent_id": "t1_iceehqi", "score": "1", "subreddit": "bayarea", "subreddit_id": "t5_2qjyy"}, {"author": "gragev95", "body": "I absolutely love Indian food from all parts of the country but I can't get over the (spongy) texture of upma, idli and dhokla, which happen to be some of the dishes my mother-in-law makes regularly. Took me three month-long India trips to gather the courage to tell her I didn't really enjoy them. 🥲", "created_utc": "1655029502.0", "edited": "False", "id": "ic2nhwl", "is_submitter": "False", "link_id": "t3_v9u9tw", "parent_id": "t3_v9u9tw", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "gragev95", "body": "Ja pavut ja linssit on myös halpoja, sekä esim. Lidlin tofu. Aasialaisista kaupoista saa vielä halvemmalla (jos sattuu asumaan sellaisen lähellä). Niillä voi hyvin korvata lihan keitoissa ja kastikkeissa, esim. kikherneet sopii salaatteihin, mustapavut sekä keittoihin että kastikkeisiin ja esim. tortillojen täytteeksi. Maustaminen ja valmistaminen vaan vaatii hieman opettelua. ☺️", "created_utc": "1654525255.0", "edited": "False", "id": "ibdavi2", "is_submitter": "False", "link_id": "t3_v3zqhx", "parent_id": "t1_ib1hd5t", "score": "1", "subreddit": "Suomi", "subreddit_id": "t5_2qlq3"}, {"author": "gragev95", "body": "Made in Heaven", "created_utc": "1654458361.0", "edited": "False", "id": "ibab9vf", "is_submitter": "False", "link_id": "t3_v50hb0", "parent_id": "t3_v50hb0", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "gragev95", "body": "Hiii 🐷💞", "created_utc": "1654458193.0", "edited": "False", "id": "ibaaxne", "is_submitter": "False", "link_id": "t3_v5a0d5", "parent_id": "t1_ib9iyrx", "score": "17", "subreddit": "aww", "subreddit_id": "t5_2qh1o"}, {"author": "gragev95", "body": "I'm in Northern India (Delhi) right now and I don't need scientists to believe it. It's been +40-50 Celcius for weeks. 🥵", "created_utc": "1654107439.0", "edited": "False", "id": "iatcp07", "is_submitter": "False", "link_id": "t3_v2f8tk", "parent_id": "t3_v2f8tk", "score": "1", "subreddit": "MapPorn", "subreddit_id": "t5_2si92"}, {"author": "gragev95", "body": "Yes or Younghearted or Isaac Sene! All of them so much better than The Rasmus", "created_utc": "1652731412.0", "edited": "False", "id": "i8v0vru", "is_submitter": "False", "link_id": "t3_uqeugi", "parent_id": "t1_i8r1br0", "score": "1", "subreddit": "eurovision", "subreddit_id": "t5_2rsu8"}, {"author": "gragev95", "body": "Oh ok, well that would be great! I thought I saw somewhere a while ago that he wouldn't be doing Eurovision this year.", "created_utc": "1652481065.0", "edited": "False", "id": "i8ic4yk", "is_submitter": "False", "link_id": "t3_uouqyh", "parent_id": "t1_i8i6pfr", "score": "3", "subreddit": "eurovision", "subreddit_id": "t5_2rsu8"}, {"author": "gragev95", "body": "I don't think so, unfortunately.\n\nI watched some videos of Johnny Weir (skating, interviews, Masked Singer) because I wasn't really familiar and I'm a fan now so I'll be happy to see him doing the commentary tomorrow! 😁", "created_utc": "1652478256.0", "edited": "False", "id": "i8i60c3", "is_submitter": "False", "link_id": "t3_uouqyh", "parent_id": "t1_i8i4b25", "score": "4", "subreddit": "eurovision", "subreddit_id": "t5_2rsu8"}, {"author": "gragev95", "body": "Yes! As a Finn, I was so disappointed that this bland and problematic song got picked to represent Finland! 😩 UMK (Uuden musiikin kilpailu) had so many good entries this year and Jezebel was my least favourite. Check out BESS - Ram pam pam, Younghearted - Sun numero, Olivera - Thank God I'm an Atheist and Isaac Sene - Kuuma jäbä. 🇫🇮🎶", "created_utc": "1652477716.0", "edited": "False", "id": "i8i4t0k", "is_submitter": "False", "link_id": "t3_uopkij", "parent_id": "t1_i8gsly5", "score": "5", "subreddit": "eurovision", "subreddit_id": "t5_2rsu8"}, {"author": "gragev95", "body": " I just moved to the US from Finland/UK and was a bit sceptical about the US (Peacock) stream but I actually really like Johnny Weir! He seems really knowledgeable and pronounces European names really well. Didn't notice any ads. 🤔 I was going to look for the UK stream (as I have non-Finnish speakers coming to my Eurovision brunch, thus can't watch the Finnish one) but found out Graham isn't actually doing the commentary this year.", "created_utc": "1652476695.0", "edited": "False", "id": "i8i2j99", "is_submitter": "False", "link_id": "t3_uouqyh", "parent_id": "t1_i8hys9w", "score": "16", "subreddit": "eurovision", "subreddit_id": "t5_2rsu8"}, {"author": "gragev95", "body": "I mean, I think he sings well and the message is good (f men being not allowed to show their emotions) but the song is pretty boring.", "created_utc": "1652401176.0", "edited": "False", "id": "i8e0qd8", "is_submitter": "False", "link_id": "t3_uobksb", "parent_id": "t1_i8ddl7l", "score": "1", "subreddit": "eurovision", "subreddit_id": "t5_2rsu8"}, {"author": "gragev95", "body": "You can see in this from 1:30 onwards https://areena.yle.fi/1-50981133", "created_utc": "1652398981.0", "edited": "False", "id": "i8dw22b", "is_submitter": "False", "link_id": "t3_uobmrw", "parent_id": "t1_i8dfdmt", "score": "7", "subreddit": "eurovision", "subreddit_id": "t5_2rsu8"}, {"author": "gragev95", "body": "Yeah, honestly, that song is pretty great but I find it a bit triggering", "created_utc": "1652398135.0", "edited": "False", "id": "i8du75h", "is_submitter": "False", "link_id": "t3_umd3xp", "parent_id": "t1_i8dqahd", "score": "1", "subreddit": "eurovision", "subreddit_id": "t5_2rsu8"}, {"author": "gragev95", "body": "Sameee it's all about breakups and identity struggles 😫 I think Europe's depressed", "created_utc": "1652391949.0", "edited": "False", "id": "i8dg8kv", "is_submitter": "False", "link_id": "t3_umd3xp", "parent_id": "t1_i8dfgwm", "score": "5", "subreddit": "eurovision", "subreddit_id": "t5_2rsu8"}, {"author": "gragev95", "body": "Hey, thanks for this thread. I'm a Finn who used to live in the UK but just moved to the US. My husband is Indian and I got him really into Eurovision, and now we have some Indian, Mexican and Finnish friends coming over to watch Eurovision. I was hoping to find the BBC stream somewhere because I think Graham Norton is just brilliant but he's not doing the commentary this year! I did some research on Johnny Weir, I'd never heard of him but he seems great so I'm going to give the Peacock stream a shot.", "created_utc": "1652240868.0", "edited": "False", "id": "i8546bf", "is_submitter": "False", "link_id": "t3_umouz8", "parent_id": "t3_umouz8", "score": "2", "subreddit": "eurovision", "subreddit_id": "t5_2rsu8"}, {"author": "gragev95", "body": "I visited this place in November after driving past it a hundred times and it's honestly gorgeous! I've visited many temples and castles around the world but Akshardham is probably the most impressive of all. Not only is the temple full of amazingly intricate details but the whole area is so tidy and beautiful. 🥺\n\nAt first I was a bit upset that we were not allowed to take phones or cameras inside (they had to be left at a cloakroom at the entrance) but it actually made the experience better because everyone was just focusing on the beauty of the place rather than taking photos. 🧘‍♀️", "created_utc": "1647887682.0", "edited": "1647888031.0", "id": "i1k99hs", "is_submitter": "False", "link_id": "t3_tj3rh1", "parent_id": "t3_tj3rh1", "score": "4", "subreddit": "ArchitecturePorn", "subreddit_id": "t5_2skim"}, {"author": "gragev95", "body": "Myös näin etäopiskeluaikoina monet opiskelijat on kotipaikkakunnillaan ja kämpät/soluhuoneet tyhjillään, joten niihin voi päästä alivuokralle ainakin joksikin aikaa, jos hyvä tuuri sattuu. HOAS:illa päävuokralainen ei saa veloittaa senttiäkään varsinaista vuokraa enempää. Itse asuin valtaosan viime vuodesta soluhuoneessa alivuokralla, vaikka kirjoilla olen ulkomaalaisessa yliopistossa, enkä varsinaisesti olisi täyttänyt HOAS:in kriteereitä. Suurimman osaan tuosta ajasta kämpän kaksi muuta huonetta oli tyhjillään. 329e/kk sisältäen kaiken ja viihdyin erinomaisesti!", "created_utc": "1647394090.0", "edited": "False", "id": "i0tutok", "is_submitter": "False", "link_id": "t3_tekbno", "parent_id": "t1_i0qb2dp", "score": "2", "subreddit": "Suomi", "subreddit_id": "t5_2qlq3"}, {"author": "gragev95", "body": "I used to live in the UK (Brighton) and never felt threatened by the big homeless population there. There were some people I used to chat with and bring food/hot drinks to pretty regularly. Now I live in the San Francisco Bay Area and frankly, feel a bit scared to go out. I've been followed around in parks and shouted at from a metre's distance (for no reason at all) on a beach. I don't know what's different here and I wish I could do something to help but it seems like such a huge issue here.", "created_utc": "1647392597.0", "edited": "False", "id": "i0trflp", "is_submitter": "False", "link_id": "t3_tetsju", "parent_id": "t1_i0swd5u", "score": "5", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "gragev95", "body": "With ESTA, you can only stay for 90 days within 180 days. It's a rolling 180-day window, so you're only allowed 20 more days max before end of May/beginning of June (depending on when you entered the country). They usually recommend that you stay out of the country for a few months before going back.  \n\n\nI once stayed for about 40 days and then returned 3 months later and they took me to secondary. It really depends on the officer you happen to get. Especially if your studies are online, I would bring extra proof of your strong ties to your country, e.g. employment contract, tenancy agreement.", "created_utc": "1646882355.0", "edited": "False", "id": "i028k2e", "is_submitter": "False", "link_id": "t3_talr85", "parent_id": "t3_talr85", "score": "0", "subreddit": "immigration", "subreddit_id": "t5_2qvj0"}, {"author": "gragev95", "body": "This palace is absolutely gorgeous, beautiful room after another! Definitely recommend visiting if you ever get the chance.", "created_utc": "1646856632.0", "edited": "False", "id": "i00jqln", "is_submitter": "False", "link_id": "t3_taac3v", "parent_id": "t3_taac3v", "score": "31", "subreddit": "ArchitecturePorn", "subreddit_id": "t5_2skim"}, {"author": "gragev95", "body": "Congrats! All the best :)  \n\n\nSince you mentioned the visa, I have a piece of information that may be useful for you (having just moved to the US from Finland, I have been following these processes for a while now):  \nCurrently (pretty much since the beginning of the pandemic), the K-1 process is almost as long as the CR-1/IR-1 process. In either case, the person outside the US needs to stay outside of the US for the duration of the immigration process. The difference is that if you file for K-1 and then get married, they need to wait for green card/employment authorisation before being able to work, and also cannot leave the US until they receive their GC. So if you're ready for it and want to start working as soon as you move to the US, it may make sense to consider getting married first and then filing for CR-1/IR-1 right away. :)", "created_utc": "1646696708.0", "edited": "False", "id": "hzrrust", "is_submitter": "False", "link_id": "t3_t8lt1e", "parent_id": "t3_t8lt1e", "score": "2", "subreddit": "LDR", "subreddit_id": "t5_2rx8p"}, {"author": "gragev95", "body": "My high school burnt down in the middle of a school day, in the middle of my final exam season. We all had to be evacuated, luckily nobody got hurt and exam papers somehow survived in a safety-deposit. Finished our exams on desks that were saved from the burnt down school, the whole exam room smelled like smoke. 🔥\n\nAlso, pretty basic but a girl a year above me started dating this awkward science teacher who was in his 30s when she was 15-16. They weren't public about it but I felt like there was something weird going on for a long time, they \"accidentally\" were checking in at the same places on Facebook (small village in 2009-ish, everyone was friends with everyone on FB) and then as soon as she turned 18, she started driving to school in his car etc. 🤔 I think they were together for a good few years and he ended up becoming the headmaster of the local high school (not the one that burned down)...", "created_utc": "1641644002.0", "edited": "False", "id": "hrrp8pq", "is_submitter": "False", "link_id": "t3_ryg5v1", "parent_id": "t3_ryg5v1", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "gragev95", "body": "Remember to fill in Air Suvidha and book your test", "created_utc": "1639872480.0", "edited": "False", "id": "hp3wvtq", "is_submitter": "False", "link_id": "t3_rabpm2", "parent_id": "t3_rabpm2", "score": "1", "subreddit": "AskIndia", "subreddit_id": "t5_2s8wu"}, {"author": "gragev95", "body": "Same here, my husband is Indian and I'm Nordic (Finnish). We met online!", "created_utc": "1639872120.0", "edited": "False", "id": "hp3w58m", "is_submitter": "False", "link_id": "t3_riau3r", "parent_id": "t1_hoxjemv", "score": "3", "subreddit": "AskIndia", "subreddit_id": "t5_2s8wu"}, {"author": "gragev95", "body": "Wow congrats! Hope it all goes well for you guys! 🙏🏼\n\nMy husband and I were also online friends for over 8 years before meeting IRL a bit over 3 years ago, things got romantic two years before we met and now we've been married for almost 2 years and finally about to close the distance. 🤩 It's so crazy meeting up after knowing someone for so long!", "created_utc": "1639764796.0", "edited": "1639765137.0", "id": "hoy4pdr", "is_submitter": "False", "link_id": "t3_ri6j0f", "parent_id": "t3_ri6j0f", "score": "5", "subreddit": "LDR", "subreddit_id": "t5_2rx8p"}, {"author": "gragev95", "body": "Finland doesn't have that many fully vegan/vegetarian places (although there are more opening up all the time) but 99% of restaurants (chain ones also) will have at least a couple of good vegan options these days. 🙌🏼 Even in my small town in Eastern Finland, you can get vegan burgers, pizza, kebab, Italian food, and the Thai place has a whole vegan menu. 🌱💪🏼", "created_utc": "1639611555.0", "edited": "False", "id": "hopmi6x", "is_submitter": "False", "link_id": "t3_rh201y", "parent_id": "t3_rh201y", "score": "6", "subreddit": "vegan", "subreddit_id": "t5_2qhpm"}, {"author": "gragev95", "body": "We've been doing this too the whole time, tried everything else and nothing was ever as reliable. Works for us.", "created_utc": "1639573326.0", "edited": "False", "id": "hon10tb", "is_submitter": "False", "link_id": "t3_rg3d4d", "parent_id": "t1_hoijluq", "score": "2", "subreddit": "LDR", "subreddit_id": "t5_2rx8p"}, {"author": "gragev95", "body": "When was this filmed? Looks pre-covid", "created_utc": "1639562167.0", "edited": "False", "id": "homlif1", "is_submitter": "False", "link_id": "t3_rbalku", "parent_id": "t1_hollfjt", "score": "1", "subreddit": "90DayFiance", "subreddit_id": "t5_34i5y"}, {"author": "gragev95", "body": "He had a work trip to Singapore and it was Chinese New Year and he got me a little ceramic pig to represent that year (our first full year officially together) and the year I was born. The pig came in a pretty box and has a cute little bindi on its forehead (my husband is Indian). That pig is going to stay with me for the rest of my life. 🐷", "created_utc": "1639435956.0", "edited": "False", "id": "hoft6v2", "is_submitter": "False", "link_id": "t3_rfnvc4", "parent_id": "t3_rfnvc4", "score": "3", "subreddit": "LDR", "subreddit_id": "t5_2rx8p"}, {"author": "gragev95", "body": "Glad to see another Finnish 90DF fan on here! 😁  \nI saw the first couple of episodes and the couples seem pretty genuine, especially Juho-Kustaa and Aleyna. They're very cute! Laura and Mike on the other hand seem really awkward but not in the cute way and I doubt it's going to go anywhere.", "created_utc": "1638922154.0", "edited": "False", "id": "hnnowf7", "is_submitter": "False", "link_id": "t3_rbalku", "parent_id": "t3_rbalku", "score": "15", "subreddit": "90DayFiance", "subreddit_id": "t5_34i5y"}, {"author": "gragev95", "body": "They seem to have been processing about 4 days a week recently. Once you're documentarily qualified, how soon you get your interview appointment depends on the embassy/consulate and how backlogged they are.", "created_utc": "1633614978.0", "edited": "False", "id": "hfq93w2", "is_submitter": "False", "link_id": "t3_q2zd9f", "parent_id": "t3_q2zd9f", "score": "2", "subreddit": "immigration", "subreddit_id": "t5_2qvj0"}, {"author": "gragev95", "body": "They haven't heard anything yet.", "created_utc": "1633566870.0", "edited": "False", "id": "hfo77lf", "is_submitter": "False", "link_id": "t3_pks8fa", "parent_id": "t1_hfjnpcj", "score": "1", "subreddit": "immigration", "subreddit_id": "t5_2qvj0"}, {"author": "gragev95", "body": "If you're a UK citizen and fully vaccinated, I believe you should be able to visit on ESTA starting sometime in early November. Not sure what visas the embassy is prioritising atm but there may be a long wait for tourist visas.", "created_utc": "1633438568.0", "edited": "False", "id": "hfh28k4", "is_submitter": "False", "link_id": "t3_q1u27q", "parent_id": "t3_q1u27q", "score": "1", "subreddit": "immigration", "subreddit_id": "t5_2qvj0"}, {"author": "gragev95", "body": "Yes, In India, people seem to be much more comfortable with farting and burping outloud in front of other people. Would be considered a bit rude or at least odd where I grew up in Northern Europe. 😅", "created_utc": "1633399194.0", "edited": "False", "id": "hffj1ev", "is_submitter": "False", "link_id": "t3_q19060", "parent_id": "t1_hfe9x68", "score": "35", "subreddit": "india", "subreddit_id": "t5_2qh1q"}, {"author": "gragev95", "body": "Hi, I was in the same situation. NOA1 was Jun 15, 2020, received the \"in active process\" update on Jan 12, 2021 and i-130 was approved on Jun 18, 2021 so it took just over a year. Best of luck!", "created_utc": "1633379898.0", "edited": "False", "id": "hfecpf5", "is_submitter": "False", "link_id": "t3_q0j10i", "parent_id": "t3_q0j10i", "score": "2", "subreddit": "immigration", "subreddit_id": "t5_2qvj0"}, {"author": "gragev95", "body": "Yes and those ears look like border collie to me.", "created_utc": "1632214966.0", "edited": "False", "id": "hdp4i6i", "is_submitter": "False", "link_id": "t3_ps29kr", "parent_id": "t1_hdmytc7", "score": "2", "subreddit": "rescuedogs", "subreddit_id": "t5_2ryfq"}, {"author": "gragev95", "body": "To me it just sounds like you two really enjoy each other's company. 🤷🏼‍♀️ Completely normal. 😸\n\nI struggle with keeping this balance too sometimes, but if your situation is not long-term but you're going to move in together after the wedding, then I wouldn't worry about it too much. If it's more long-term, I'd recommend setting some sort of a schedule for talking vs doing other things.", "created_utc": "1632141109.0", "edited": "False", "id": "hdl0a5y", "is_submitter": "False", "link_id": "t3_provpd", "parent_id": "t3_provpd", "score": "3", "subreddit": "LDR", "subreddit_id": "t5_2rx8p"}, {"author": "gragev95", "body": "We like to read articles, r/relationships and Slate's Dear Prudence column together, sometimes we listen to podcasts, watch documentaries... these things always bring up some new topics to discuss.", "created_utc": "1632129586.0", "edited": "False", "id": "hdkkn4a", "is_submitter": "False", "link_id": "t3_prp805", "parent_id": "t3_prp805", "score": "2", "subreddit": "LongDistance", "subreddit_id": "t5_2s6ky"}, {"author": "gragev95", "body": "And to get dairy 🥛🍨🍫, you do this to a bull, artificially get a cow pregnant so that she starts producing milk, take away the calf, and take the milk 🤔", "created_utc": "1631749316.0", "edited": "False", "id": "hd0k1mz", "is_submitter": "False", "link_id": "t3_pos4yk", "parent_id": "t3_pos4yk", "score": "2", "subreddit": "Damnthatsinteresting", "subreddit_id": "t5_2xxyj"}, {"author": "gragev95", "body": "There are some local groups on Meetup.com focused on hiking and things like that", "created_utc": "1631657326.0", "edited": "False", "id": "hcvk95u", "is_submitter": "False", "link_id": "t3_pny4ht", "parent_id": "t3_pny4ht", "score": "3", "subreddit": "Finland", "subreddit_id": "t5_2qztz"}, {"author": "gragev95", "body": "Same here.", "created_utc": "1631576175.0", "edited": "False", "id": "hcr6gay", "is_submitter": "False", "link_id": "t3_pnbso4", "parent_id": "t1_hcoaqc4", "score": "3", "subreddit": "duolingo", "subreddit_id": "t5_2t6ze"}, {"author": "gragev95", "body": "We just included tons of photos from our trips, with friends and family and from our wedding, some receipts for transport and hotels, and I was on his health insurance. One of our friends wrote a letter basically confirming that we're a legitimate couple. Couldn't open a joint bank account etc. because we're living in different countries. I-130 was approved. 😊", "created_utc": "1631238747.0", "edited": "False", "id": "hc9ccuk", "is_submitter": "False", "link_id": "t3_pl311w", "parent_id": "t1_hc988x6", "score": "3", "subreddit": "immigration", "subreddit_id": "t5_2qvj0"}, {"author": "gragev95", "body": "I was in an international LDR (different sides of Europe) with my ex all through high school. He was working (3 years my senior) and came to meet me a couple of times a year, I worked part-time throughout the year (mail delivery) and full-time for a month or two in the summer and visited him during holidays. Closed the distance and lived together for a few years before breaking up for other reasons. It can work. 🤷🏼‍♀️", "created_utc": "1631237103.0", "edited": "False", "id": "hc98kxg", "is_submitter": "False", "link_id": "t3_pl8ckr", "parent_id": "t1_hc8qgnh", "score": "1", "subreddit": "LongDistance", "subreddit_id": "t5_2s6ky"}, {"author": "gragev95", "body": "That's a grocery store chain, for anyone non-Finnish 😊", "created_utc": "1631226678.0", "edited": "False", "id": "hc8ll81", "is_submitter": "False", "link_id": "t3_pl4c44", "parent_id": "t1_hc87ix9", "score": "215", "subreddit": "MapPorn", "subreddit_id": "t5_2si92"}, {"author": "gragev95", "body": "I have a friend couple who are in the same situation as you with the Mumbai consulate, they were DQ'd in November 2020 and still waiting. I think I read on VisaJourney that people DQ'd in March 2020 are getting interview dates now. Hope you get your appointment soon!", "created_utc": "1631182033.0", "edited": "False", "id": "hc5xoa6", "is_submitter": "False", "link_id": "t3_pks8fa", "parent_id": "t3_pks8fa", "score": "1", "subreddit": "immigration", "subreddit_id": "t5_2qvj0"}, {"author": "gragev95", "body": "As someone who grew up in Europe (Finland), I was a bit taken aback when I first visited my Indian husband in the US and him and his Indian flatmates had a swastika on the door. 😂 Obviously I didn't know the meaning of it in Hinduism yet.", "created_utc": "1631180964.0", "edited": "False", "id": "hc5wglh", "is_submitter": "False", "link_id": "t3_pkd9tx", "parent_id": "t1_hc4cd0z", "score": "9", "subreddit": "MapPorn", "subreddit_id": "t5_2si92"}, {"author": "gragev95", "body": "Hope you get to meet soon! 🙏🏼 My long distance partner (husband) is Indian too ☺️", "created_utc": "1631134931.0", "edited": "False", "id": "hc3sw88", "is_submitter": "False", "link_id": "t3_pkemac", "parent_id": "t3_pkemac", "score": "3", "subreddit": "LongDistance", "subreddit_id": "t5_2s6ky"}, {"author": "gragev95", "body": "Probably depends which language you're using it for, it could be really good for improving your vocabulary. Unfortunately it really sucks for Hindi (I end up reporting 1/3 of the content for being plain wrong), I sent them feedback and they straight-up told me the course is old and needs to be worked on.", "created_utc": "1631096567.0", "edited": "False", "id": "hc1j91y", "is_submitter": "False", "link_id": "t3_pjwcua", "parent_id": "t1_hc0p2uf", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "gragev95", "body": "It will be a little awkward and feel a bit surreal for a moment. The first time I met my husband in person (after knowing for 8 years and talking every day for 2 years) still feels like a dream. He grabbed my hand and it felt unreal. Is this really happening? 😁 Just take it easy, go into it with an open mind - if it's meant to be, you'll find that connection in real life too and everything will click into place. Good luck, I'm excited for you!", "created_utc": "1631039531.0", "edited": "False", "id": "hbyn4dr", "is_submitter": "False", "link_id": "t3_pjrgfz", "parent_id": "t3_pjrgfz", "score": "4", "subreddit": "LongDistance", "subreddit_id": "t5_2s6ky"}, {"author": "gragev95", "body": "I've heard good things about Frangipani but haven't tried it myself", "created_utc": "1631017614.0", "edited": "False", "id": "hbx969g", "is_submitter": "False", "link_id": "t3_pjhhnv", "parent_id": "t3_pjhhnv", "score": "2", "subreddit": "helsinki", "subreddit_id": "t5_2s0h4"}, {"author": "gragev95", "body": "Dress up, get the same food (both order pizza for example), some nice drink, watch a film (we usually just \"3, 2, 1\" with Netflix), play some games. :) This is what we usually do on special days, almost as if you were together.", "created_utc": "1631013043.0", "edited": "False", "id": "hbx26pk", "is_submitter": "False", "link_id": "t3_pjjuwq", "parent_id": "t3_pjjuwq", "score": "3", "subreddit": "LongDistance", "subreddit_id": "t5_2s6ky"}, {"author": "gragev95", "body": "That was always my motivation to enjoy the mandatory Swedish - I felt like it connected us to the rest of the Nordics. I've never had to use it in real life so I'm not really fluent at speaking it but I can read or listen and understand. Also came in handy when I worked in a Nordic team while living in the UK and could read all the Swedish/Norwegian/Danish emails that we received. \n\nTervetuloa Suomeen! 😊", "created_utc": "1631005397.0", "edited": "False", "id": "hbwt2k8", "is_submitter": "False", "link_id": "t3_pj5v8g", "parent_id": "t1_hbwn2t1", "score": "5", "subreddit": "Finland", "subreddit_id": "t5_2qztz"}, {"author": "gragev95", "body": "Same here! It's so buggy sometimes but the video quality is the best. We've taken screenshots and the difference compared to anything else is drastic.", "created_utc": "1630776227.0", "edited": "False", "id": "hbl93kd", "is_submitter": "False", "link_id": "t3_pgwm5q", "parent_id": "t1_hbhf0c9", "score": "3", "subreddit": "LongDistance", "subreddit_id": "t5_2s6ky"}, {"author": "gragev95", "body": "Check out the \"Love is not tourism Finland\" group on Facebook. Unless you're married or she's a US citizen/green card holder, she would currently need to stay in Mexico, Turkey etc. for 14 days before entering the US as the European travel ban is still in place.\n\nIf you get married, it would probably take about 18 months - 2 years for her to get her green card. USCIS, NVC and all the US embassies around the world have backlog because of covid. Check out the Visa Journey website.", "created_utc": "1630775870.0", "edited": "False", "id": "hbl8a8w", "is_submitter": "False", "link_id": "t3_pgyr85", "parent_id": "t3_pgyr85", "score": "1", "subreddit": "LongDistance", "subreddit_id": "t5_2s6ky"}, {"author": "gragev95", "body": "Don't really have any specific advice but girl, I've been there and I know how much it sucks! I swear once you get over the goodbyes, it's going to get easier. Video calls will feel weird for a second but just get back to your normal call routine. Keep yourself busy, (safely) meet up with friends and family and start planning for your next trip - you'll be fine. 🤍", "created_utc": "1630773757.0", "edited": "False", "id": "hbl3g6r", "is_submitter": "False", "link_id": "t3_phpi1q", "parent_id": "t3_phpi1q", "score": "6", "subreddit": "LongDistance", "subreddit_id": "t5_2s6ky"}, {"author": "gragev95", "body": "The NG combination I guess is another exception, and the way some single consonants are sometimes pronounced almost as if it was a double (take \"appelsiini\" as an example, but there may be some regional differences too).", "created_utc": "1630768710.0", "edited": "False", "id": "hbks2d9", "is_submitter": "False", "link_id": "t3_pg5sy5", "parent_id": "t1_hb9xo31", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "gragev95", "body": "Biang! has an actually decent Chinese lunch buffet, and Vegoshi in Kluuvi does some really good lunch bowls, both about 11€.", "created_utc": "1625680246.0", "edited": "False", "id": "h4dmmjd", "is_submitter": "False", "link_id": "t3_offl3t", "parent_id": "t3_offl3t", "score": "2", "subreddit": "helsinki", "subreddit_id": "t5_2s0h4"}, {"author": "gragev95", "body": "We were friends for years before we got together, only video called three times before we met in person a few years ago. Now we mostly video call and have been doing that every day since we met IRL. It definitely feels more like you're together in person and involved in each other's lives, helps a lot. 😌", "created_utc": "1620469639.0", "edited": "False", "id": "gxdhg3n", "is_submitter": "False", "link_id": "t3_n7jlg7", "parent_id": "t1_gxdgf8n", "score": "1", "subreddit": "LongDistance", "subreddit_id": "t5_2s6ky"}, {"author": "gragev95", "body": "Definitely do not get married before you feel ready and actually want to do so! There's obviously a chance it could work out but you're really young and there are other solutions. I probably would have felt ready to marry my husband when I first met him IRL and we would probably be living together at this point if we had but I had this rule for myself that I wouldn't get married before I'm 25 and wanted to spend more time together in person, and I'm still glad we waited before making it official. Is it's possible for you to move to Brazil for a while? Or you could find a third country that both of you can move to? It doesn't need to be permanent. Best of luck!", "created_utc": "1620468576.0", "edited": "False", "id": "gxdgc7d", "is_submitter": "False", "link_id": "t3_n7hucf", "parent_id": "t3_n7hucf", "score": "2", "subreddit": "LongDistance", "subreddit_id": "t5_2s6ky"}, {"author": "gragev95", "body": "We have a 10-hour time difference, both sleep about 24-8 and work 10-18. We do a video call in my morning (8-10) before he sleeps and while I get ready for the day, and then again in my evening, usually when he wakes up and then again before I go to bed. I think this kind of an arrangement could work for you too with your time difference, depending on your work etc., there's definitely an overlap. All the best. 😊", "created_utc": "1620468105.0", "edited": "False", "id": "gxdfuuv", "is_submitter": "False", "link_id": "t3_n7jlg7", "parent_id": "t3_n7jlg7", "score": "1", "subreddit": "LongDistance", "subreddit_id": "t5_2s6ky"}, {"author": "gragev95", "body": "Good luck, hope it goes quickly! We've been waiting for nearly a year now (just had our first wedding anniversary a week ago), fingers crossed 🤞🏼", "created_utc": "1616725593.0", "edited": "False", "id": "gs8xx8f", "is_submitter": "False", "link_id": "t3_mddt0y", "parent_id": "t3_mddt0y", "score": "4", "subreddit": "LongDistance", "subreddit_id": "t5_2s6ky"}, {"author": "gragev95", "body": "I see, that's exciting! In that case I'd print out a copy of her passport and get her to write and sign an invitation letter with both your full names, your passport number and her contact details on it. I normally do this when my husband comes to visit (for his visa application) but it might come in handy at the border check. You can find sample letters if you google \"Schengen visa invitation letter\" or something like that. \n\nIn my experience the agents at the border are pretty chill. One time my husband came to visit before we were married, the agent asked him if he was visiting a friend and my husband told him yes and the name of my little village. The agent seemed surprised and asked him if he'd been before and when he said yes, the agent said \"must be a pretty special friend 😉 if you want to visit again\" 😅 And my hubby is not a white American! So I really wouldn't worry too much as long as you double-check with the airline and then follow all the health and quarantine guidelines.", "created_utc": "1600270107.0", "edited": "False", "id": "g5h9cl4", "is_submitter": "False", "link_id": "t3_itlq8f", "parent_id": "t1_g5h35wm", "score": "1", "subreddit": "helsinki", "subreddit_id": "t5_2s0h4"}, {"author": "gragev95", "body": "From 19th September (this coming Saturday) onwards, there will be new guidelines in place: https://www.raja.fi/current_issues/guidelines_for_border_traffic\n\nThe US is in category 2 and it does list \"dating relationship\" as a \"pressing family matter\" which would allow you into the country but as you said, at the end of the day, it's up to the border control agent you happen to get. Also, the airlines may be hesitant to take somebody without a citizenship/residence permit on board if you're not married and don't have a work reason etc. to travel.\n\nI would carry some documents with me just in case. Those could be a copy of your partner's passport, a printout of their \"henkilötiedot\", a tenancy agreement with both your names on it if you've lived together before, and maybe some other proof of your relationship like some messages, photos together, an invitation letter. My husband is also travelling from the US to Finland soon and he found this document signed by the ambassador on the Finnish embassy's FB page which you could print to possibly make your travels easier, perhaps check that out as well. 😊\n\nBest of luck, stay safe and please make sure to quarantine for 14 days after your arrival!", "created_utc": "1600265537.0", "edited": "False", "id": "g5h0iaz", "is_submitter": "False", "link_id": "t3_itlq8f", "parent_id": "t3_itlq8f", "score": "3", "subreddit": "helsinki", "subreddit_id": "t5_2s0h4"}]