[{"author": "GrassAffectionate363", "body": "English is not my \"natural\" or \"native\" language (that is Spanish), but it is the language of the country where I was born and raised. Often I use grammatical constructions that are weird in English but are normal in Spanish. For example, subject pronouns often are unnecessary in Spanish, so \"I am a woman\" translates to \"Soy una mujer\", and when I speak to other people, I would usually say \"Am a woman\" instead of \"I am a woman\" because of Spanish grammar.\n\nOther times I have trouble finding the right word in English, so I always default to Spanish. Yesterday I was visiting the house of my friend, and I wanted to know where the kitchen was, so I asked \"Where is the cocina?\"; I forgot the English word \"kitchen\", which is \"la cocina\" in Spanish. My friend was a Latina who knew a little bit of Spanish, so she understood.", "created_utc": "1660928250.0", "edited": "False", "id": "ikyfkyr", "is_submitter": "False", "link_id": "t3_wrsij1", "parent_id": "t3_wrsij1", "score": "2", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "GrassAffectionate363", "body": "Are there any questions you would like to ask me that could give you an idea about my language situation?\n\nI would not say that I am a native English speaker. I only started learning English when I was nine years old. I always talk to myself in Spanish. All my emotions are in Spanish; I always default to Spanish whenever I am excited, angry, scared, or feeling any intense emotion. I understand Spanish more easily and intuitively than English. All my dreams are in Spanish. When I handwrite in English, I often make spelling mistakes related to Spanish (I often spell \"cat\" with a \"g\" because \"cat\" in Spanish is \"gato\", for example). When I am speaking English, I often use incorrect forms of irregular verbs (I often say \"thinked\" instead of \"thought\", for example). I also sometimes use incorrect forms of adjectives, which do not have to agree with nouns in English but they have to in Spanish (for instance, I occasionally say \"bigs houses\" instead of \"big houses\"). Also, when I am speaking English, I struggle with expressions (for instance, \"Soy para\" literally translates to \"I am for\" but means \"I am in the mood for\", so I usually say \"I am for \\_\\_\" when I really mean \"I am in the mood for \\_\\_\"). I also use Spanish-type possession in English (for instance, I would always say \"\\_\\_ of Isabel\" because possession in Spanish is shown using \"de\"; I would never say \"Isabel's \\_\\_\").\n\nIn my opinion, my accent is much closer to the accent of a native Spanish speaker than the accent of a Chicano English speaker. My KIT vowel sounds like /i/, rather than /ɪ/. My FOOT vowel sounds like /u/, rather than /ʊ/. My BATH and PALM vowels sounds like /a/, rather than /æ/. My PRICE vowel sounds like /ai/, rather than /aɪ/. My CHOICE vowel sounds like /oi/, rather than /ɔɪ/. My FACE and GOAT vowels are monophthongs. My STRUT and commA vowels sound the same. My /t/ and /θ/, /d/ and /ð/, /b/ and /v/, and /s/ and /z/ sounds sound the same. My prosody is syllable-timed, but most English dialects, even Chicano English, are stress-timed.\n\nI think I became like this for multiple reasons: I had zero exposure to English before I was nine years old; I always watch and listen to movies, shows, news, and songs in Spanish (never in English); I read all my books in Spanish outside school; I had zero exposure to English outside the classroom until I graduated high school (I always spoke to my friends in Spanish outside school); even in school, I spoke Spanish with almost all my friends; even in school, I took all my notes in Spanish (I looked up any words I did not know); even after third grade, I always studied in Spanish. I always felt more connected to Spanish than English. My family and I believed that immersing me in a Spanish-only household for my childhood would help me retain my Spanish, and it worked. I think my years in English schooling helped me (22/F) achieve fluency but did not give me native-level fluency in English (just something close).", "created_utc": "1660529766.0", "edited": "1660681379.0", "id": "ikbz227", "is_submitter": "True", "link_id": "t3_wnor1w", "parent_id": "t1_ika0d75", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "GrassAffectionate363", "body": "English spelling is strange. The last major spelling reform was before the Great Vowel shift, so most words do not sound exactly how they are spelled. This is normal; even native speakers with whom I talk have difficulty with this. Spelling was a major hurdle when I was learning English (because Spanish spelling is mostly phonetic), and even nowadays my spelling is awful.", "created_utc": "1660224271.0", "edited": "False", "id": "ijurctb", "is_submitter": "False", "link_id": "t3_wljvr4", "parent_id": "t3_wljvr4", "score": "3", "subreddit": "EnglishLearning", "subreddit_id": "t5_2u8ap"}, {"author": "GrassAffectionate363", "body": "I remember testing my English CEFR level when I was in elementary school (I am ESL). When I felt that I \"spoke\" English, I was at B2, which was fifth grade for me. However, even at B2, I had little to no confidence in my ability to hold conversations in English.", "created_utc": "1660210134.0", "edited": "1660593702.0", "id": "iju4ga3", "is_submitter": "False", "link_id": "t3_wl7123", "parent_id": "t3_wl7123", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}]