[{"author": "Grouchy-Couple-9776", "body": "That's actually super-helpful! ❤️ I know I'm not completely \"caucasian\" (wrong term, I know). So, thank you!", "created_utc": "1663890190.0", "edited": "False", "id": "ipjbrkp", "is_submitter": "False", "link_id": "t3_xl0l2t", "parent_id": "t1_ipj4qo5", "score": "5", "subreddit": "eyes", "subreddit_id": "t5_2rbii"}, {"author": "Grouchy-Couple-9776", "body": "Your eye color is pretty unique and beautiful! Can I inquire into your ethnicity? (You can be as nebulous as you wish. It's just that I'm adopted and my eye-shape is just like yours (btw, I also have hazel eyes!!)).", "created_utc": "1663886404.0", "edited": "False", "id": "ipj3zj6", "is_submitter": "False", "link_id": "t3_xl0l2t", "parent_id": "t3_xl0l2t", "score": "5", "subreddit": "eyes", "subreddit_id": "t5_2rbii"}, {"author": "Grouchy-Couple-9776", "body": "A full-on Latin revival would be so cool, not gonna lie.", "created_utc": "1663641110.0", "edited": "False", "id": "ip5au91", "is_submitter": "False", "link_id": "t3_xinc2l", "parent_id": "t1_ip52ibj", "score": "132", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Grouchy-Couple-9776", "body": "I don't mind it as much as I should because I use the swipe setting. It honestly makes writing on a phone less of a burden. It's not the same as writing with a proper keyboard but it does the trick.", "created_utc": "1659366158.0", "edited": "False", "id": "iiijmy7", "is_submitter": "False", "link_id": "t3_wd98sr", "parent_id": "t3_wd98sr", "score": "1", "subreddit": "FanFiction", "subreddit_id": "t5_2r5kb"}, {"author": "Grouchy-Couple-9776", "body": "Is anything worth it in the end? Why try anything at all, then? The truth is that not everything is a race to the finish line. Sometimes, the things we learn along the way are more valuable than a \"C2 Level Accomplishment\" diploma.\n\nI remember that Data from Star Trek: The Next Generation once said (text taken from: https://www.quotes.net/mquote/864673)\n\n\"Lal:\nI watch them, and I can do the things they do, but I will never feel the emotions. I'll never know love.\n\nLt. Cmdr. Data:\nIt is a limitation we must learn to accept, Lal.\n\nLal:\nThen why do you still try to emulate humans? What purpose does it serve except to remind you that you are incomplete?\n\nLt. Cmdr. Data:\nI have asked myself that many times, as I have struggled to be more human. Until I realized, it is the struggle itself that is most important. We must strive to be more than we are, Lal. It does not matter that we will never reach our ultimate goal. The effort yields its own rewards.\"", "created_utc": "1658635314.0", "edited": "False", "id": "ihepr6j", "is_submitter": "False", "link_id": "t3_w6jaxc", "parent_id": "t3_w6jaxc", "score": "8", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Grouchy-Couple-9776", "body": "I've seen this one in that exact fandom lmao! The author was talking about Lightning, if I remember correctly.", "created_utc": "1658015601.0", "edited": "False", "id": "igghb52", "is_submitter": "False", "link_id": "t3_w0jefc", "parent_id": "t1_igexxsr", "score": "1", "subreddit": "FanFiction", "subreddit_id": "t5_2r5kb"}, {"author": "Grouchy-Couple-9776", "body": "If you think it doesn't fit the rest of the story, you could always take the chapters and character arc that you wrote for this character and turn them into a spin-off fic. :)", "created_utc": "1657509893.0", "edited": "False", "id": "ifogexg", "is_submitter": "False", "link_id": "t3_vvmo97", "parent_id": "t1_ifkxyx1", "score": "2", "subreddit": "FanFiction", "subreddit_id": "t5_2r5kb"}, {"author": "Grouchy-Couple-9776", "body": "Wait a minute... there are two unfinished fics that I liked very much and (although they're unfinished, I remember loving them to bits):\n\nAbandoned Sparks by Teefarino on FF.NET (don't worry, in spite of the comments, it's not Zucest)\n\nmy treason engendered by traitors beyond me by\npresumptious_quirks on AO3\n\n(I'll keep you posted if I remember another good fic!)", "created_utc": "1657035740.0", "edited": "False", "id": "ieyd5r0", "is_submitter": "False", "link_id": "t3_vrtgk5", "parent_id": "t1_ieyaonu", "score": "2", "subreddit": "Azula", "subreddit_id": "t5_2uz0o"}, {"author": "Grouchy-Couple-9776", "body": "I remember enjoying these (although I read them years ago and they might not be as good as I remember):\n\n水火 by Trascendenza on AO3\n\nLights in the Shadow by Iantur on AO3 - Azula/OC\n\nA Thousand Little Faces by Tashii on AO3 - Azula/Aang\n\nAzula Trilogy Part I: Heart of Fire by MasterGhandalf on FF.NET (I only ever read this part of the Trilogy. Nothing more haha)", "created_utc": "1657034741.0", "edited": "1657034937.0", "id": "ieyaonu", "is_submitter": "False", "link_id": "t3_vrtgk5", "parent_id": "t3_vrtgk5", "score": "1", "subreddit": "Azula", "subreddit_id": "t5_2uz0o"}, {"author": "Grouchy-Couple-9776", "body": "Most of the AtLA characters might suffer for some sort of PTSD. So, yes. \n\nOn a side-note: I understand why you'd think she could have BPD. But at the same time, I don't see it. I'm only talking about the cartoon, BTW.\n\nIn the show, Azula doesn't have mood swings. She is not as violent or destructive as other firebenders.\n\nShe doesn't idolize anyone but her own country/people. She knows what her father is, that's why she says \"you can't treat me like Zuko\". She strives to keep him happy in order not to get treated like, well, Zuko.\n\nShe is a perfectionist out of survival (in fact, her most toxic behaviors are a response to the environment she was raised in). Charm, efficiency and a silver-tongue will get you everywhere in a royal court.\n\nAnd she doesn't blame her misfortunes on anyone but herself. Even the mirror scene shows us that she blames herself, once again, \"what choice do *I* have?\" Is the perfect quote to exemplify this. \n\n\"My own mother thought I was a monster. SHE WAS RIGHT. But it still hurt.\" She wasn't demonizing Ursa. She didn't say anything bad about her mother. She even agreed with what her mother thought of her.", "created_utc": "1656785537.0", "edited": "False", "id": "ielr5x5", "is_submitter": "False", "link_id": "t3_vpkl9b", "parent_id": "t1_iel3g3t", "score": "3", "subreddit": "Azula", "subreddit_id": "t5_2uz0o"}, {"author": "Grouchy-Couple-9776", "body": "It, honestly, depends.\n\nWhat if she had a nervous breakdown? She will only need sleep (valerian leaves might help), yoga and willpower. Ideally, you'd remove the person from the source of stress for a while.\n\nWhat if you want to believe that she had qigong deviation? A healer might help help with the appropriate exercises.\n\nWhat if it wasn't her mental illness flaring up but her conscience? Zuko had a fever and nightmares when he was undergoing a change. This could be Azula's manifestation of said change - the mirror scene is very telling. She knows that her methods failed and \"fear\" only brought her loneliness and pain in the end, but she doesn't know how to change. \"What choice do I have?\"*\n\nHonestly, if I were to give her a \"mental illness\", I wouldn't say Schizophrenia or Narcissistic Personality Disorder/NPD (as some people are keen to diagnose her with) because:\n\n(a) Schizophrenia is rare. And no one gets it right. There are some people without family history who develop the illness, sure. Nonetheless, The Fire Nation Royal Family has no family history of schizophrenia in the show. Why should we believe that schizophrenia is what she has? A stress-induced (nervous) breakdown is more likely than what you think. \n\n(b) Azula is a Princess. A member of the Royal Family from the most powerful country in the world (which was true up to the finale). She is not a Disney princess. The only person who surpasses her in rank is the Fire Lord. Her behavior is not representative of NPD. \n\nThe mental illness I'd give her (if I had to give her one) is: *ANXIETY* (with a parent like Ozai, who wouldn't suffer from anxiety? She might have abandonment issues from Ursa. And yadayada.)\n\n...\n\nThe thing is, it depends on how you read that scene. I personally believe that Azula was undergoing a great change. Like we saw with Zuko, the path to change is thorny, hard and painful (one even might take one step forward and then take two steps back).", "created_utc": "1656774686.0", "edited": "1656774976.0", "id": "iel2ew4", "is_submitter": "False", "link_id": "t3_vpkl9b", "parent_id": "t3_vpkl9b", "score": "3", "subreddit": "Azula", "subreddit_id": "t5_2uz0o"}, {"author": "Grouchy-Couple-9776", "body": "Ha! Good to know! \n\nBTW, it has come to my attention that the final part of the trilogy is incomplete on AO3, so... I found it on FF.net:\n https://m.fanfiction.net/s/5248250/1/Azula-Trilogy-Part-3-Soul-of-Fire\n\nAnyhow, feast and enjoy!", "created_utc": "1655585888.0", "edited": "False", "id": "icvfljb", "is_submitter": "False", "link_id": "t3_ve7v4i", "parent_id": "t1_icvdnul", "score": "2", "subreddit": "Azula", "subreddit_id": "t5_2uz0o"}, {"author": "Grouchy-Couple-9776", "body": "There you go: https://archiveofourown.org/series/281202", "created_utc": "1655469257.0", "edited": "False", "id": "icpafy8", "is_submitter": "False", "link_id": "t3_ve7v4i", "parent_id": "t3_ve7v4i", "score": "7", "subreddit": "Azula", "subreddit_id": "t5_2uz0o"}, {"author": "Grouchy-Couple-9776", "body": "Whenever I feel the urge to delete my fics, I just orphan them. That way, I get rid of them without erasing them.", "created_utc": "1655314203.0", "edited": "False", "id": "ich9ep4", "is_submitter": "False", "link_id": "t3_vc8c9c", "parent_id": "t3_vc8c9c", "score": "2", "subreddit": "FanFiction", "subreddit_id": "t5_2r5kb"}, {"author": "Grouchy-Couple-9776", "body": "For real. In historical/xianxia/etc. dramas the first 15 episodes are a gorgeous open-world adventure and by episode 25 we're deep in Angst-land.\n\nEdit: I mean, I love it. Still, though... why do all my faves have to die???", "created_utc": "1655089547.0", "edited": "False", "id": "ic5ul7p", "is_submitter": "False", "link_id": "t3_uvrqi1", "parent_id": "t3_uvrqi1", "score": "4", "subreddit": "CDrama", "subreddit_id": "t5_34fkz"}, {"author": "Grouchy-Couple-9776", "body": "My headcanons:\n\nAzula is aromantic bisexual.\n\nMy favorite ships for Azula are (1) Azuki and (2) Azulaang.\n\nAs for Azula and Suki, they're two sides of the same coin. Different yet similar. They'd balance and complement each other in battle/life. They'd be the perfect \"enemies to rivals to frenemies to gay pining to angsty pining to lovers\".\n\nI don't know, man, these two fill me with so much warmth.", "created_utc": "1655084733.0", "edited": "False", "id": "ic5lt8l", "is_submitter": "False", "link_id": "t3_vapcw3", "parent_id": "t3_vapcw3", "score": "4", "subreddit": "Azula", "subreddit_id": "t5_2uz0o"}, {"author": "Grouchy-Couple-9776", "body": "Azulaang and Azuki (Azula x Suki). Those are my to-go pairings.", "created_utc": "1655005438.0", "edited": "False", "id": "ic1t5vh", "is_submitter": "False", "link_id": "t3_vac9n1", "parent_id": "t3_vac9n1", "score": "7", "subreddit": "Azula", "subreddit_id": "t5_2uz0o"}, {"author": "Grouchy-Couple-9776", "body": "Thank you. :) I've long suspected either Greek, Turkish or Syrian ancestry. Thus, this is actually reaffirming in a way!", "created_utc": "1630365368.0", "edited": "False", "id": "haznu2p", "is_submitter": "False", "link_id": "t3_petaau", "parent_id": "t1_hazlivj", "score": "1", "subreddit": "eyes", "subreddit_id": "t5_2rbii"}]