[{"author": "hanazakari", "body": "Great topic! Right now certainly is the time to stock up on awesome books! \n\nSome books I enjoyed this year and haven’t seen recommended on this sub:\n\nおいしいごはんが食べられますように - 高瀬隼子\n\nThe winner of the last round of the Akutagawa prize. Focuses on a love triangle-esque relationship between three colleagues and explores what it means to work and spend time with others and what role food plays in relationships and life in general. \nExtremely relatable if you work in or have ever worked in an office environment! I was constantly finding myself or those around me in the characters. The humor is also deliciously dark and I found myself laughing out loud during a few parts. \nVery approachable literary read - would put this at N2 or above, comparable to other famous Akutagawa winner コンビニ人間.\n\n憤死 - 綿矢りさ\n\nThree whacky, horror adjacent short stories loosely based on the concept of looking back on bizarre childhood memories as an adult. Was there anything you remember witnessing as a child that you just accepted at the time but when you got older and thought back you realized it was actually weird, scary or inappropriate? This book captures that feeling really well! \nI read the entire first short story 「トイレの懺悔室」on a flight without reading the summary first and slowly found myself thinking what? What?! Wtf?! As the story progressed and reached the climax. You never have any idea where 綿矢りさ stories are going (in the best way possible) and it’s always a wild ride, especially in this book! I enthusiastically recommend this if you are looking for something a little out there. \nThis had fairly easy language as it features a lot of childhood scenes - would rank it as N2 or above. \n\n葡萄が目に染みる - 林真理子 \n\nComing of age story about high school life, romance, and the pitfalls and joys of growing up in the inaka. From the 1980s, it’s absolutely oozing with retro 昭和vibes. \nAnyone who is a fan of shojo manga or older anime like Studio Ghibli’s 海がきこえる would enjoy this. \nSince it’s a slice of life high school story, the language isn’t too advanced - again approachable for N2 or above!", "created_utc": "1666123552.0", "edited": "1666126093.0", "id": "isuhhx6", "is_submitter": "False", "link_id": "t3_y75isl", "parent_id": "t3_y75isl", "score": "7", "subreddit": "LearnJapanese", "subreddit_id": "t5_2qyls"}, {"author": "hanazakari", "body": "I meet with one tutor every 1-2 weeks depending on my schedule for an hour. We decide on a general topic in advance and she sends over an interesting article, essay, movie, podcast etc. and prepares a document with discussion questions and highlights any interesting phrases she thinks I could add to my vocabulary. \n\nI read or watch whatever she sends in advance and take notes, then review the phrases she picked out for me and the discussion questions. I will also look up and try to learn any vocabulary I need to discuss whatever the topic is ahead of the lesson so I practice using it actively when we speak. \n\nWhen we have our session, we have a very fun and interesting chat for an hour about whatever the topic is (with the occasional tangent too!). Whenever I struggle to find the write word of phrase something she will gently jump in and offer suggestions or rephrase my errors.  \n\nI could probably meet with her or another tutor more frequently to further improve my speaking abilities but Japanese is just a fun hobby for me and it already takes a bit of time to prep for our sessions so I’m happy for the moment. \n\nI am interested in working with a tutor on improving my writing eventually, but have no idea how the sessions would work! If anyone has worked with a tutor to improve writing before I’d be curious to read your experience too!", "created_utc": "1665683888.0", "edited": "False", "id": "is6m3tn", "is_submitter": "False", "link_id": "t3_y31qt5", "parent_id": "t3_y31qt5", "score": "3", "subreddit": "LearnJapanese", "subreddit_id": "t5_2qyls"}, {"author": "hanazakari", "body": "Congratulations on your accomplishment! That’s fantastic! I love seeing other learners out there reading and just enjoying all the awesome untranslated Japanese books out there! \n\nSince you enjoyed 流浪の月, I would also recommend 凪良ゆう‘s latest release 汝、星のごとく. I’ve read a lot of her books and think it’s one of her best (and liked it even more than 流浪の月)! \n\nSince you like 告白and also read another book by 道尾秀介 , I’d also recommend 向日葵の咲かない夏 . The pages were just flying by when I read it!\n\nI have more recommendations and also a post about my own experience reading in my post history since you asked at the end of yours. \n\nRead on!", "created_utc": "1665603333.0", "edited": "False", "id": "is2788c", "is_submitter": "False", "link_id": "t3_y23hjd", "parent_id": "t3_y23hjd", "score": "3", "subreddit": "LearnJapanese", "subreddit_id": "t5_2qyls"}, {"author": "hanazakari", "body": "Have you tried looking into using a reference book? A quick search for data science reference books on Amazon Japan returns a lot of [results.](https://www.amazon.co.jp/s?k=%E3%83%87%E3%83%BC%E3%82%BF%E3%82%B5%E3%82%A4%E3%82%A8%E3%83%B3%E3%83%86%E3%82%A3%E3%82%B9%E3%83%88%E6%A4%9C%E5%AE%9A&crid=3LHGA64CDL7ZZ&sprefix=%E3%81%A7%E3%83%BC%E3%81%9F%2Caps%2C423&ref=nb_sb_ss_ts-doa-p_1_3) A lot of them appear to be study guides for a data science certification called the データサイエンティスト検定,  which may be a great starting point to learn not only the Japanese terminology but also about data science in general. Maybe searching for the データサイエンティスト検定 or データ分析 on YouTube or other learning platforms like udemy will return some results as well if you want to learn via listening/video.", "created_utc": "1665326481.0", "edited": "False", "id": "irn0cwz", "is_submitter": "False", "link_id": "t3_xzmytd", "parent_id": "t3_xzmytd", "score": "1", "subreddit": "LearnJapanese", "subreddit_id": "t5_2qyls"}, {"author": "hanazakari", "body": "You’re welcome! I hope you find it as helpful as I did and know what you mean about feeling like you sound offensive or like an idiot.", "created_utc": "1665319278.0", "edited": "False", "id": "irmlxso", "is_submitter": "True", "link_id": "t3_xzic23", "parent_id": "t1_irmkj2v", "score": "1", "subreddit": "LearnJapanese", "subreddit_id": "t5_2qyls"}, {"author": "hanazakari", "body": "Her books may be a stretch for you (at least for the first chapters at your level), but I would recommend 辻村深月, specially her books that have younger characters in them like かがみの孤城、琥珀の夏、or 闇祓 as they are on the easier side to read and don’t use a lot of crazy vocabulary. She has a lot of books in addition to those so just try the sample feature on kindle to try out the first few pages of some and see if you enjoy the story.\n\nSource: I found all three of the books I recommended above easier than 君の名は and Harry Potter. :) \nGood luck!", "created_utc": "1663512484.0", "edited": "False", "id": "ioxlc3y", "is_submitter": "False", "link_id": "t3_xh81pb", "parent_id": "t3_xh81pb", "score": "3", "subreddit": "LearnJapanese", "subreddit_id": "t5_2qyls"}, {"author": "hanazakari", "body": "I was traveling today so my learning was done on the go. I did all my anki reviews and listened to an audiobook for about 2 hours while in flight.", "created_utc": "1663512023.0", "edited": "False", "id": "ioxk7vt", "is_submitter": "False", "link_id": "t3_xhdybr", "parent_id": "t3_xhdybr", "score": "1", "subreddit": "LearnJapanese", "subreddit_id": "t5_2qyls"}, {"author": "hanazakari", "body": "I’m a big fan of hers, having read nearly all of her novels and short stories in Japanese and would actually agree that this was one of her weaker efforts. I even had the sense her publisher told her to write this short story collection to serve as kind of a “summary” of what she’s about as a writer because it would sell due to her name and be a good choice for translation, as most of her books aren’t translated in foreign markets and Life Stories would be a good overview into her world (who knows what the truth is, though, that’s just my theory!). It felt extremely flat to me and I found many ideas (and even entire storylines) recycled from her other books which was quite disappointing. \n\nI hope some more of her works get translated as she has offerings that better than Life Stories and that I found personally more “profound”.", "created_utc": "1662386991.0", "edited": "False", "id": "in6owpj", "is_submitter": "False", "link_id": "t3_x1y7fu", "parent_id": "t1_imikiu7", "score": "3", "subreddit": "TrueLit", "subreddit_id": "t5_2982c7"}, {"author": "hanazakari", "body": "I’ve taken TestDaF and can share a few tips! \n\nIf you have already passed the GZ with a 75% already, I am sure you can get the scores needed on the TestDaF. It will just be important that you are familiar with the test format. \n\nI can recommend [this](https://www.amazon.de/J%C3%B6rg-Roche/dp/3190016992/ref=mp_s_a_1_2?crid=20WJW8X0HGYRE&keywords=testdaf&qid=1661835566&sprefix=testdaf%2Caps%2C128&sr=8-2) book for prepping and familiarizing yourself with the test. A lot of the speaking and writing questions focus specifically on describing charts and graphs and this has the vocabulary and formatting you need + a good amount of practice questions. \n\nUsing the book above I was able to get a 5 on every section except writing, where I only scored a 4. So, my personal advice would be to practice writing a lot if you can as it’s harder to score higher on if you aren’t already strong in that area. \n\nReading and listening are very standard and what you would expect, with a focus on academic/uni life topics. \n\nSpeaking is a little weird simply because you aren’t actually talking to someone and are speaking into a recorder but I just imagined someone sitting in front of me and that helped a bit. I also practiced answering the speaking prompts in the book aloud and memorized some “Bausteine” I could use to help me get my thoughts across in a clear, advanced manner. \n\nGood luck!", "created_utc": "1661836355.0", "edited": "False", "id": "imcns4e", "is_submitter": "False", "link_id": "t3_x0pgh2", "parent_id": "t3_x0pgh2", "score": "1", "subreddit": "German", "subreddit_id": "t5_2qq51"}, {"author": "hanazakari", "body": "Yes! That “being held at an arm’s length” serves what he is going for in a lot of his books but unfortunately doesn’t overlap with what causes books to resonate with me. However, he does have a great style and I have read and mostly enjoyed all of his full length novels (get why you dropped IQ84, though..). \n\nAlso nice, high five fellow Japanese speaker!", "created_utc": "1661834748.0", "edited": "False", "id": "imcldip", "is_submitter": "False", "link_id": "t3_x0nsoi", "parent_id": "t1_imcjotg", "score": "2", "subreddit": "TrueLit", "subreddit_id": "t5_2982c7"}, {"author": "hanazakari", "body": "I speak and do a lot of reading in Japanese so that’s absolutely on the mark! \n\nI enjoy some of Murakami’s books but my favorites are usually stories that explore human relationships and trigger an emotional response and his characters often don’t do it for me personally in that regard. \nAlthough I would note that I did enjoy South of the Border, West of the Sun from him as it had some elements of the above.", "created_utc": "1661833302.0", "edited": "False", "id": "imcj1xy", "is_submitter": "False", "link_id": "t3_x0nsoi", "parent_id": "t1_imbbhxu", "score": "2", "subreddit": "TrueLit", "subreddit_id": "t5_2982c7"}, {"author": "hanazakari", "body": "Oh god, this is hilarious and has, dare I say, perhaps a teensy bit of truth to it (don’t listen to Lana Del Rey though). Thanks for the laugh!", "created_utc": "1661807772.0", "edited": "False", "id": "imb13m1", "is_submitter": "False", "link_id": "t3_x0nsoi", "parent_id": "t1_imasf0r", "score": "1", "subreddit": "TrueLit", "subreddit_id": "t5_2982c7"}, {"author": "hanazakari", "body": "The Woman in the Dunes - Kobo Abe \n\nThe Heart is a Lonely Hunter - Carson McCullers \n\nGiovanni’s Room - James Baldwin \n\nKokoro - Natsume Soseki  \n\nBeware of Pity - Stefan Zweig", "created_utc": "1661801441.0", "edited": "False", "id": "imamcco", "is_submitter": "False", "link_id": "t3_x0nsoi", "parent_id": "t3_x0nsoi", "score": "5", "subreddit": "TrueLit", "subreddit_id": "t5_2982c7"}, {"author": "hanazakari", "body": "I feel very much the same way about spending time in my TL and agree that it should be something that brings joy! Thanks for sharing your passion!", "created_utc": "1661422805.0", "edited": "False", "id": "ilpqxwd", "is_submitter": "False", "link_id": "t3_wx4ax5", "parent_id": "t1_ilpkt7k", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "hanazakari", "body": "I work full time but manage to get in 15-20 hours a week of active study (textbook study, review, intensive reading, writing, italki) in for my two TLs (Korean and Japanese). I mostly study in the morning before work or on the weekend. \n\nOn top of that, I probably get in another 10 or so hours of passive learning in my stronger TL (Japanese) from reading or listening to audiobooks. \n\nLanguage learning and reading are my hobbies so studying doesn’t feel like work to me. They are rather just a part of my lifestyle and how I spend my free time!", "created_utc": "1661164862.0", "edited": "1661175498.0", "id": "ilazpnd", "is_submitter": "False", "link_id": "t3_wumn8q", "parent_id": "t3_wumn8q", "score": "9", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "hanazakari", "body": "I add as many new words that I encounter and feel like adding but only do 5 new cards a day per deck.", "created_utc": "1661028529.0", "edited": "False", "id": "il40ux0", "is_submitter": "False", "link_id": "t3_wtg6vx", "parent_id": "t3_wtg6vx", "score": "21", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "hanazakari", "body": "Sure! Here are some of the channels I like to watch below. They make videos about individual books but also ones talking about books in general. However, If I'm ever looking for a video analysis on a specific book, I'll just type \\[book name\\] + 解釈 in the search bar.\n\n  \n[文学YouTuberベル](https://www.youtube.com/c/BellelinWall/videos) \\- Belle, the most famous Japanese BookTuber. Covers a variety of genres but with a focus on 純文学/エンタメ小説. She usually makes videos about nominees for literary awards and best sellers of the year so her channel is great for keeping up with what's going on with Japanese publishing. \n\n[純文学YouTuberつかっちゃん](https://www.youtube.com/channel/UCutvzRcGtbBNhtGvGihHLjA/videos) \\- A casual, talk-style channel run by a guy named つかさ that focuses on 純文学. This guy reads and introduces a massive amount of books so I always find something I'm interested in reading from his videos. If you are interested in the 芥川賞, he makes videos covering all the nominees each time and it's fun to watch them for the summaries and try to predict which book will win! His passion for books always puts me in the mood to go read. \n\n[梨ちゃねる -](https://www.youtube.com/channel/UCwaQfJf70EbMhTfTc5kASYQ/videos) Nashi makes videos mostly about literary fiction and literary magazines.  She recommends a lot of stuff I've never heard of which I always find expands my horizons. I find she also notices things in books that I don't when I read through them so I appreciate her videos for giving me a new point of view as well!  All-around chill vibes and nice to watch!\n\n[文学系マジシャン蓬生](https://www.youtube.com/channel/UCSXPB3skMIlx-c0mqsTkZYg/featured) \\- Hojo is a magician who makes videos both about literature and magic trick how-tos, so if you get tired of learning about books you can learn how to do card tricks from him too (lol). His videos focus more on literary analysis and interpretation and he has ones for a lot of really famous, commonly read works. He's really laid back, doesn't talk too fast, and also uses visual aids to explain so his videos are easy to follow. \n\n[ほんタメ](https://www.youtube.com/channel/UC0zArNuGZKdvzSkfHbR9yLA) \\- Talkshow format hosted by a literature-loving actress named Akari and a guy from the STEM world named Takumi. Akari is really funny and bubbly and reads a lot of different types of books and I always find interesting recs from her. Takumi reads mysteries, so there is a really good spread of recommendations here in addition to their entertaining videos.", "created_utc": "1659501724.0", "edited": "False", "id": "iiqrf4a", "is_submitter": "False", "link_id": "t3_wefn0h", "parent_id": "t1_iiqcc90", "score": "6", "subreddit": "LearnJapanese", "subreddit_id": "t5_2qyls"}, {"author": "hanazakari", "body": "I enjoy physical books and manga a lot, but I also buy ebooks because I don’t live in Japan and the shipping costs if purchasing from Japan get expensive! If I did live in Japan I would certainly purchase the physical version of something I’d like to read in 9/10 cases, though.\n\nI would add a note that I enjoyed reading ebooks more until I reached around ~50 books and needed to look up words less while reading. The popup dictionary really is a big help when starting out (but is definitely not a must)!", "created_utc": "1659474064.0", "edited": "False", "id": "iip19ee", "is_submitter": "False", "link_id": "t3_wem8kr", "parent_id": "t3_wem8kr", "score": "8", "subreddit": "LearnJapanese", "subreddit_id": "t5_2qyls"}, {"author": "hanazakari", "body": "I keep it really simple. I either read physical books or on my kindle and just look up words I don’t know on the dictionary app on my phone (the app allows me to save words so I’ll save interesting ones to export to anki one day) or with the pop up dictionary on my kindle.\n\nIf I am reading literature with a capital L (or in other words, 純文学), sometimes I’ll keep a notebook nearby to write down quotes from the book that I found interesting or try to write my thoughts after finishing so the reading experience is more interactive. I also like to watch YouTube videos analyzing books or read reviews on Amazon or literary blogs. This helps get in some nice listening or additional reading practice but is super optional. \n\nI have more info about reading in my post history!", "created_utc": "1659468081.0", "edited": "False", "id": "iiolf4c", "is_submitter": "False", "link_id": "t3_wefn0h", "parent_id": "t3_wefn0h", "score": "7", "subreddit": "LearnJapanese", "subreddit_id": "t5_2qyls"}, {"author": "hanazakari", "body": "I have a dedicated monthly budget for books and buy all my books as kindle ebooks from amazon. If you look for non-new releases, you find some that are only ¥300-¥500. I am also subscribed to kindle unlimited's 読み放題. They change the main featured books monthly and sometimes have some big-name titles plus a range of books of all different genres. I've found some absolute gems through kindle unlimited that I wouldn't have read otherwise and about half my monthly reading is books I find there which keeps costs down.\n\nJapanese ebooks are generally cheaper than the physical versions and you don't need to pay for shipping if you live abroad so I recommend them to keep costs down!", "created_utc": "1659285653.0", "edited": "False", "id": "iiee8dp", "is_submitter": "True", "link_id": "t3_v5z4tf", "parent_id": "t1_iidit0u", "score": "1", "subreddit": "LearnJapanese", "subreddit_id": "t5_2qyls"}, {"author": "hanazakari", "body": "Penmanship and calligraphy is one of my hobbies. I write things down by hand a lot in notebooks so I’d like to be able to write Japanese off the top of my head too and write it beautifully. :)", "created_utc": "1659167903.0", "edited": "False", "id": "ii8gc1h", "is_submitter": "False", "link_id": "t3_wbajd4", "parent_id": "t1_ii6tmb6", "score": "2", "subreddit": "LearnJapanese", "subreddit_id": "t5_2qyls"}, {"author": "hanazakari", "body": "Thanks for sharing and congratulations on your achievement! This is an interesting and helpful post. \n\nI’ve slowly been working my way through the kanken levels for the past few year or so, starting from level 9. I’m now at level 6 and often wonder if it would be more efficient to “skip” ahead to a higher level since my kanji knowledge itself is already quite strong. However, your experience makes sense and I think I’ll keep chugging away at the lower levels since it’s really my writing ability I want to improve and I have no need to pass the test.", "created_utc": "1659130893.0", "edited": "False", "id": "ii6kcj4", "is_submitter": "False", "link_id": "t3_wbajd4", "parent_id": "t3_wbajd4", "score": "2", "subreddit": "LearnJapanese", "subreddit_id": "t5_2qyls"}, {"author": "hanazakari", "body": "I speak German at work and it took me about 1.5 - 2 years to understand everything comfortably and around 3 years in total to reach a level where I could comfortably function verbally (but with an accent) and write at the same level as my German coworkers and do things like negotiations, event planning, or project work. This was after starting at a B2 level.\n\nI didn’t use any specific resources to learn business German but tried to absorb absolutely as much as I possibly could in every interaction with colleagues. I would often write down useful phrases I would hear in meetings for later use and I would save bits of emails that I wanted to reuse or repurpose for when I had to write my own business emails in German, essentially creating my own learning resources. After enough parroting and copying natives (and stumbling my way through German corporate life) I eventually managed to internalize a lot of it and function quite comfortably now. Real life and exposure will be your best teachers!", "created_utc": "1658779999.0", "edited": "1659523221.0", "id": "ihmfrr6", "is_submitter": "False", "link_id": "t3_w6y2a0", "parent_id": "t3_w6y2a0", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "hanazakari", "body": "In addition to perhaps checking out some simpler books (which maybe you already are since you mentioned reading novels for elementary students), I would also say don’t forget that reading endurance needs to be trained like a muscle! \n\nHere are some ideas for building up your endurance based on my own experience becoming a bookworm in my TL (which also happens to be Japanese):\n\n- Read earlier in the day when your brain is more awake and able to focus \n- Make a goal of at least reading a page every single day to get in the habit\n- Once in the habit, set a daily page goal of 10 pages and increase it slowly every week and adjust accordingly to the difficulty of your current book and your personal schedule\n- Follow some book review accounts on social media like Instagram or Twitter and spend time seeking out books you find interesting and really WANT to read. Don’t just read random things because they’re “easy”, your interest in the story is also important.\n- Create a reading/progress journal where you jot down interesting things from the books you read or a sentence or two about the difficulty level and reading experience after you finish a book. This doesn’t need to be anything fancy at all, but looking back on it later will allow you to see your own growth (which can be hard to gauge when improving reading skills). \n\nGood luck!", "created_utc": "1658308072.0", "edited": "False", "id": "igw80f2", "is_submitter": "False", "link_id": "t3_w3gdec", "parent_id": "t3_w3gdec", "score": "16", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "hanazakari", "body": "I think 上橋菜穂子's books would match what you are looking for, despite not being \"classic\" fantasy. She is an ethnology professor in addition to being a fantasy writer and this really comes through in her books where her rich world-building shines. The 精霊の守り人, 鹿の王, and 獣の奏者 series are all fun reads with 獣の奏者 being the easiest and a good starting point!", "created_utc": "1658241109.0", "edited": "False", "id": "igs67au", "is_submitter": "False", "link_id": "t3_w2sogx", "parent_id": "t3_w2sogx", "score": "64", "subreddit": "LearnJapanese", "subreddit_id": "t5_2qyls"}, {"author": "hanazakari", "body": "Yes, it pops up from time to time and would be worth knowing if you are interested in reading in Japanese. Joyo kanji are the kanji you will see in newspapers or the media but outside of those people will use whatever kanji they want according to their personal writing style and preference. A writer who isn't a journalist won't necessarily consciously think if the kanji they are using are joyo or not. \n\nIf you aren't interested in reading at all I think it's not so important to know, though. It just depends on what your learning goals are.", "created_utc": "1658219708.0", "edited": "False", "id": "igr5jvn", "is_submitter": "False", "link_id": "t3_w22cz4", "parent_id": "t3_w22cz4", "score": "1", "subreddit": "LearnJapanese", "subreddit_id": "t5_2qyls"}, {"author": "hanazakari", "body": "I’d recommend the 角川つばさ文庫 version of [ナミヤ雑貨店の奇跡](https://www.amazon.co.jp/%E6%9D%B1%E9%87%8E-%E5%9C%AD%E5%90%BE/dp/4046317442/ref=mp_s_a_1_7?crid=1B5Q6G24LNV2C&keywords=%E3%83%8A%E3%83%9F%E3%83%A4%E9%9B%91%E8%B2%A8%E5%BA%97%E3%81%AE%E8%BB%8C%E8%B7%A1&qid=1657880155&sprefix=%E3%83%8A%E3%83%9F%E3%83%A4%E9%9B%91%E8%B2%A8%E5%BA%97%E3%81%AE%E3%81%8D%E3%81%9B%E3%81%8D%2Caps%2C369&sr=8-7) by 東野圭吾. It is a mystery but also has slice of life elements and is a fun read.", "created_utc": "1657880336.0", "edited": "False", "id": "ig8vir1", "is_submitter": "False", "link_id": "t3_vzggow", "parent_id": "t3_vzggow", "score": "3", "subreddit": "LearnJapanese", "subreddit_id": "t5_2qyls"}, {"author": "hanazakari", "body": "It sounds like you may be interested in the キクタン series of books. They divide vocabulary words and example sentences up by day and have an accompanying audio track where words with translations are repeated over background music. \n\nThey have some specifically for Japanese learners based on JLPT levels [here](https://www.amazon.co.jp/%E5%89%8D%E5%9D%8A-%E9%A6%99%E8%8F%9C%E5%AD%90/dp/4757428561/ref=mp_s_a_1_2?crid=2SYX6BUEZWNAW&keywords=%E3%82%AD%E3%82%AF%E3%82%BF%E3%83%B3%E6%97%A5%E6%9C%AC%E8%AA%9E&qid=1657624924&sprefix=%E3%82%AD%E3%82%AF%E3%82%BF%E3%83%B3+%E6%97%A5%E6%9C%AC%E8%AA%9E%2Caps%2C342&sr=8-2) but you may also want to look into キクタン英語 where they will have English -> Japanese -> English. You should be able to find the corresponding audio on audiobook.jp’s website or their mobile app.", "created_utc": "1657625156.0", "edited": "False", "id": "ifudzgl", "is_submitter": "False", "link_id": "t3_vx7kf5", "parent_id": "t3_vx7kf5", "score": "2", "subreddit": "LearnJapanese", "subreddit_id": "t5_2qyls"}, {"author": "hanazakari", "body": "The drama 「リコカツ」was quite popular in Japan when it was airing last year and is entertaining. \n\nIf you like soapy dramatic type shows and want a 和風 version of one,「私たちはどうかしている」is fun to watch (and as a bonus you will learn a lot about 和菓子).", "created_utc": "1657624783.0", "edited": "False", "id": "ifudevp", "is_submitter": "False", "link_id": "t3_vwytgk", "parent_id": "t3_vwytgk", "score": "2", "subreddit": "LearnJapanese", "subreddit_id": "t5_2qyls"}, {"author": "hanazakari", "body": "Great post! Really mirrors my own experience improving my Japanese and other languages and speaks to the power of having fun with engaging content in your target language.  \n\nYou said you aren’t setting goals currently but is there any media or any experiences you’re looking forward to enjoying in Japanese now that you’ve reached the level you have?", "created_utc": "1656354115.0", "edited": "False", "id": "idyk1my", "is_submitter": "False", "link_id": "t3_vlw3jy", "parent_id": "t3_vlw3jy", "score": "8", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "hanazakari", "body": "I would recommend setting a target date, such as the December JLPT, counting the number of weeks until then and then dividing that by the number of chapters in your textbooks. If you have 24 weeks to go and each textbook has 8 chapters, it means you would have to do 1/3 chapters a week to stay on target. Then you can go through a small amount of the material every week, decipher it and review things with anki/Quizlet/your method of choice and work towards your goal while figuring out how to use the textbooks best. Breaking the material down into manageable chunks makes it seem less overwhelming, will help you organize your studies while doing your masters, and you’ll still make steady and consistent progress (The 24 weeks are just an example here, the target date can be whenever you want!).\n\nBesides that, you could do some fun reading on the side to internalize grammar and vocabulary (anki optional). Improving reading skills will give you a big overall boost on the N1.\n\nI improved my own speaking skills by reading more/getting more exposure to the language and, well, just speaking! I recommend italki for finding someone to talk with. \n\nGood luck!", "created_utc": "1655186222.0", "edited": "False", "id": "icarn0v", "is_submitter": "False", "link_id": "t3_vbhskl", "parent_id": "t3_vbhskl", "score": "5", "subreddit": "LearnJapanese", "subreddit_id": "t5_2qyls"}, {"author": "hanazakari", "body": "I have made some recommendations in other comments in this thread so check those out! I may also eventually make a separate post with recommendations for specific reading levels.\n\nSince I started reading post N1 I was already familiar with most grammar so I can't speak to that but if I encountered sentences that didn't make sense, I usually employed these two strategies:\n\n* Gave it a reread to identify what the issue is. If the problem is vocabulary, I would look it up on my kindle. If the definition wasn't in the kindle dictionary, I would try to guess based on feeling and context. If I knew all the words in the sentence but rereading it still didn't help me parse it, I usually moved on and just kept reading if it's not an important sentence.\n* If understanding the sentence or particular word/slang/whatever gave me issues was important for understanding the action in a scene, then I would analyze and google if necessary.\n\nHowever, there are sentences I just outright skipped over or slang I became really curious about and started googling. It mostly depends on mood - there is no right or wrong, just follow where your curiosity leads you.", "created_utc": "1655033977.0", "edited": "1656672293.0", "id": "ic2sxar", "is_submitter": "True", "link_id": "t3_v5z4tf", "parent_id": "t1_ibz5sj0", "score": "1", "subreddit": "LearnJapanese", "subreddit_id": "t5_2qyls"}, {"author": "hanazakari", "body": "Seconding this choice, it’s excellent for writing kanji!", "created_utc": "1654987190.0", "edited": "False", "id": "ic0vr2a", "is_submitter": "False", "link_id": "t3_v9boju", "parent_id": "t1_ibwp2a5", "score": "1", "subreddit": "LearnJapanese", "subreddit_id": "t5_2qyls"}, {"author": "hanazakari", "body": "I'm happy to hear my post helped you! Having fun is an important ingredient in a sustainable study routine so it sounds like you are on the right track. \n\nBooks from 青い鳥文庫、角川つばさ文庫、小学館ジュニア文庫 etc. that have furigana for every word can really be a game changer and lower the main hurdle to building Japanese literacy by making all kanji \"readable\". Plus, not all of the books they publish are necessarily for children. Some of them are adult books that also happen to be appropriate for younger audiences, simply adapted with furigana.", "created_utc": "1654975459.0", "edited": "False", "id": "ic089ma", "is_submitter": "False", "link_id": "t3_v8o3py", "parent_id": "t1_ic06qmx", "score": "1", "subreddit": "LearnJapanese", "subreddit_id": "t5_2qyls"}, {"author": "hanazakari", "body": "Hello! I am the OP from that post so I thought I'd chime in here.\n\nAs u/HanzaiPodcast aptly mentioned, I was already at a higher level when I started the project that I wrote the post about and the target audience was rather those who may have a bit more foundational knowledge and would be curious to know about how they can improve their literacy.\n\nHowever, I don't mean to discourage you! I would say simply based on my experience learning other languages as an adult that I started reading in much earlier and now speak fluently, I think it's a good idea to first get a strong grasp of the basics before attempting to learn purely through reading. Having a solid grasp of essential, basic grammar and vocabulary will serve you later on and when you want to learn through immersion-type activities.\n\nIf you do want to do some reading as a total beginner, I think it can be a great supplemental activity and opportunity to practice and solidify grammar concepts and vocabulary. There are lots of great suggestions for graded reader-type stuff in other comments of this thread so check those out in addition to the reading practice in whichever textbook or beginner's resource you use! Implementing a bit of reading as a non-main, practice activity at the start of your learning can help keep things fun and remind you that there's a big world of Japanese out there beyond what is in your textbook and help you keep your eyes on the prize of reading full-length books one day.\n\nGood luck with your studies! :)", "created_utc": "1654972178.0", "edited": "1655144118.0", "id": "ic01eqv", "is_submitter": "False", "link_id": "t3_v8o3py", "parent_id": "t3_v8o3py", "score": "4", "subreddit": "LearnJapanese", "subreddit_id": "t5_2qyls"}, {"author": "hanazakari", "body": "I use both a lot! \n\nI tend to use a J->J dictionary when I can infer the meaning of a word from context but just want to double-check the reading or make sure I inferred correctly. \n\nI use J->E for things like specific nouns, plant names, uncommon adjectives, etc. where I want to know specifically what the word is/means.\n\nBonus: I use google images when I find words describing things, for example in a Japanese home, where I have no idea how they look and want to \"look them up\". Some stuff I've googled are 勝手口 or 葡萄棚 (they don't grow grapes the same way where I live!). \n\nI know there is some discussion on the benefits of only using a J->J dictionary but I've never been too fussed about it and have incorporated English with good results still.", "created_utc": "1654666075.0", "edited": "False", "id": "ibkrhu6", "is_submitter": "True", "link_id": "t3_v5z4tf", "parent_id": "t1_ibjs920", "score": "3", "subreddit": "LearnJapanese", "subreddit_id": "t5_2qyls"}, {"author": "hanazakari", "body": "I have never read a VN but I have played Fire Emblem Three Houses which is quite text-heavy and found it to be a great learning experience. It exposed me to a lot of new vocab and the combo of voiceover + text meant I could practice listening and reading at the same time which is always fantastic. \n\nI would imagine if you read a VN with a voice-over, it's also a great learning tool. \n\nHowever, I think video games just don't have the text density that a book does, so depending on your goals and interests books may be a better medium to make the core of your immersion routine.", "created_utc": "1654627535.0", "edited": "False", "id": "ibiodys", "is_submitter": "True", "link_id": "t3_v5z4tf", "parent_id": "t1_ibe66b6", "score": "1", "subreddit": "LearnJapanese", "subreddit_id": "t5_2qyls"}, {"author": "hanazakari", "body": "Absolutely! Why not? :)", "created_utc": "1654627279.0", "edited": "False", "id": "ibinslo", "is_submitter": "True", "link_id": "t3_v5z4tf", "parent_id": "t1_ibf14u6", "score": "2", "subreddit": "LearnJapanese", "subreddit_id": "t5_2qyls"}, {"author": "hanazakari", "body": "Check out NHK easy news and Satori reader if you'd like to start getting used to reading at that level!", "created_utc": "1654627244.0", "edited": "1655144393.0", "id": "ibinpm8", "is_submitter": "True", "link_id": "t3_v5z4tf", "parent_id": "t1_ibg50fl", "score": "2", "subreddit": "LearnJapanese", "subreddit_id": "t5_2qyls"}, {"author": "hanazakari", "body": "I can certainly relate to this. As an adult language learner, it can feel a bit weird reading children's books and there is definitely an urge and temptation to dive into the literary masterpieces of your target language right away. However, I found keeping the \"training wheels\" on for longer and reading some fun easier books kept me engaged and learning long enough to get to a comfort level where I can really fully enjoy adult books.", "created_utc": "1654627198.0", "edited": "False", "id": "ibinlqs", "is_submitter": "True", "link_id": "t3_v5z4tf", "parent_id": "t1_ibgs79j", "score": "1", "subreddit": "LearnJapanese", "subreddit_id": "t5_2qyls"}, {"author": "hanazakari", "body": "It sounds unbelievable but eventually, you will start to remember the meaning of words you have seen and looked up many times, and it will all start to compound. If you look up 400 words in a book and remember 40 of them, that's 40 fewer words you'll look up the next time. So don't sweat it, focus on the gains and read on! :)\n\nI only make flashcards if I encounter a very low-frequency word or a word where I think, \"I want to remember this/know how to say this!\".", "created_utc": "1654627014.0", "edited": "False", "id": "ibin6cn", "is_submitter": "True", "link_id": "t3_v5z4tf", "parent_id": "t1_ibgyxjb", "score": "4", "subreddit": "LearnJapanese", "subreddit_id": "t5_2qyls"}, {"author": "hanazakari", "body": "For the N2 level I used various 日本語総まとめ books (and would definitely recommend them).\n\nFor N1, I used 日本語総まとめ for 文法 and 漢字、 日本語能力試験ターゲット2000 N1単語 for vocabulary, 読解攻略!日本語能力試験N1レベル for reading and 日本語能力試験レベルアップトレーニング聴解N1 for listening. If you plan to take the test, it can be nice to have a specific textbook that focuses on each skill. If not, I don't think a reading comprehension or listening comprehension book is necessary (In my case, not only do I love books but also textbooks, hence why I had so many!). \n\nGood luck leveling up after Tobira!", "created_utc": "1654626757.0", "edited": "False", "id": "ibimku2", "is_submitter": "True", "link_id": "t3_v5z4tf", "parent_id": "t1_ibgyjam", "score": "2", "subreddit": "LearnJapanese", "subreddit_id": "t5_2qyls"}, {"author": "hanazakari", "body": "This is a discussion I think a lot about myself as a language learning enthusiast. In the end, I think it isn't possible to outright say whether or not Anki is necessary as it comes down to many factors like personal learning preference, goals, desired learning speed and native/target language. However, I can offer my experience as an interesting data point and contribution to the discussion:\n \n* I relied heavily on Anki as a learning supplement when studying up to the N1 level. Once I began reading more, I learned most of my vocabulary from books, but the base I had from using Anki made reading easier. I use Anki now for things like memorizing very low-frequency words, memorizing readings for people and place names, and learning 諺 and I think it's great for that purpose and my goals (to be able to read as well as an average Japanese adult). I don't think there is another way to be able to learn obscure words and names as fast and as efficiently.\n\n* I learned another language to C1 fluency as an adult that I speak everyday with no problems and didn't use Anki at all in the learning process. I took courses on and off and learned via immersion + writing down all the words I didn't know in a notebook. This language was closer to my native one which helped, but I definitely have a smaller vocabulary in this language than I do in Japanese because of this (I also rarely read in this language).\n\n* I'm now studying Korean and using Anki as a supplement to help me remember the vocab and grammar I learn with great success. I do not, however, use it as the main pillar of my learning. I personally think I would have a really hard time memorizing vocabulary without Anki though, as the words are so different from those in my native language.", "created_utc": "1654585335.0", "edited": "False", "id": "ibgn1op", "is_submitter": "True", "link_id": "t3_v5z4tf", "parent_id": "t1_ibeamsq", "score": "7", "subreddit": "LearnJapanese", "subreddit_id": "t5_2qyls"}, {"author": "hanazakari", "body": "I replied to another comment with some books I'd recommend and their links. :)", "created_utc": "1654584874.0", "edited": "False", "id": "ibgmihv", "is_submitter": "True", "link_id": "t3_v5z4tf", "parent_id": "t1_ibeebg0", "score": "2", "subreddit": "LearnJapanese", "subreddit_id": "t5_2qyls"}, {"author": "hanazakari", "body": "1. I looked up every word because I was always very curious about the meanings and wanted to learn the 読み方. I have a very high tolerance for repetitive tasks though so your mileage may vary. :)\n \n2. I don't know for sure if it is possible as I didn't do this with Japanese but I am just beginning the same experiment in Korean now (starting to read novels with a vocab of only 2,500 words) - so check back with me in 6 months. ;) \n\n3. Some of my favorite authors are 今村夏子、東野遥 and 村田沙耶香.\n \n4. Thanks!", "created_utc": "1654584844.0", "edited": "False", "id": "ibgmh5n", "is_submitter": "True", "link_id": "t3_v5z4tf", "parent_id": "t1_ibem88g", "score": "3", "subreddit": "LearnJapanese", "subreddit_id": "t5_2qyls"}, {"author": "hanazakari", "body": "I replied to another comment with a few suggestions and links of easier books. :)", "created_utc": "1654584649.0", "edited": "False", "id": "ibgm93t", "is_submitter": "True", "link_id": "t3_v5z4tf", "parent_id": "t1_ibg7e67", "score": "2", "subreddit": "LearnJapanese", "subreddit_id": "t5_2qyls"}, {"author": "hanazakari", "body": "If you liked a book so much that you wouldn't mind immediately rereading it I think you could. I just personally never did so because I always wanted to move on to another story right away.\n\n Another user who has made great posts on this sub before (u/SuikaCider) has talked before about how \"quantity eventually becomes quality\" when it comes to reading and those were basically the words I lived by during my reading journey. There were definitely books I couldn't read without looking lots of things up/books where I had less comprehension than I would have liked, but I figured as long as I was learning some new words or internalizing grammar that reading the book was still a net positive.", "created_utc": "1654584619.0", "edited": "False", "id": "ibgm7r1", "is_submitter": "True", "link_id": "t3_v5z4tf", "parent_id": "t1_ibgc115", "score": "1", "subreddit": "LearnJapanese", "subreddit_id": "t5_2qyls"}, {"author": "hanazakari", "body": "Don't despair - I could definitely read harder adult books with an N1 level but was reading very slowly. I decided to dial things back and start with children's books since I had high comprehension of them already and could more efficiently improve my reading speed and vocabulary due to that. We can all read whatever we like.\n\nYou absolutely don't need to wait until N1 to start reading - I certainly wish I didn't wait so long! :)", "created_utc": "1654538928.0", "edited": "False", "id": "ibe63lk", "is_submitter": "True", "link_id": "t3_v5z4tf", "parent_id": "t1_ibe55nv", "score": "19", "subreddit": "LearnJapanese", "subreddit_id": "t5_2qyls"}, {"author": "hanazakari", "body": "I recommend starting with books from children's publishers that have furigana such as 青い鳥文庫、角川つばさ文庫、and 小学館ジュニア文庫 and using the sample feature on Amazon to read the first pages to check the difficulty when starting out. You can do the same for any book you are interested in, really. \n\nOver time you will start to get a feel for what books are out there and start seeing the same books pop up over and over again on Amazon or social media sites and naturally gain familiarity.\n\nAt this point it is easy for me to know how difficult a book will be to read or not just based on the summary and cover art alone since different genres and types of books will each have their own cover art style!", "created_utc": "1654538740.0", "edited": "False", "id": "ibe5nol", "is_submitter": "True", "link_id": "t3_v5z4tf", "parent_id": "t1_ibe1jcs", "score": "5", "subreddit": "LearnJapanese", "subreddit_id": "t5_2qyls"}, {"author": "hanazakari", "body": "It's hard for me to answer this in terms of Japanese since I waited so long to start reading, but I can offer some advice based on other languages I have learned. \n\nI think the ideal time to start reading depends on a lot of factors such as your experience learning other languages, related languages you may know, the amount of vocab known, and your tolerance for ambiguity. However, I would say the best time to start reading is when you want to start reading. If it isn't something you want to do and don't enjoy, it will feel like work and you will end up not doing it consistently. You will never feel ready to start reading because no matter what level you are at, there will still be unknown words and you will read slow when starting out. But, the sooner you accept that and simply show up to read every day, the faster you'll make progress.  \n\nIf you feel like you want to read already, I would say look for some easy texts on satori reader or graded readers and go for it. However, if you try that out and find yourself struggling, don't despair - boosting your total known vocab up to 1,000 - 2,000 words + learning more grammar structures will also give you an easier time of things. Just experiment a bit and find what works for you!", "created_utc": "1654538427.0", "edited": "False", "id": "ibe4x7w", "is_submitter": "True", "link_id": "t3_v5z4tf", "parent_id": "t1_ibdyxhu", "score": "5", "subreddit": "LearnJapanese", "subreddit_id": "t5_2qyls"}, {"author": "hanazakari", "body": "Completely agree! Separate skills need to be practiced on their own but reading helps pull up your base level in each skill. \n\nGood luck with your reading practice! You will be reading full novels in no time!", "created_utc": "1654537902.0", "edited": "False", "id": "ibe3p74", "is_submitter": "True", "link_id": "t3_v5z4tf", "parent_id": "t1_ibdqv1x", "score": "6", "subreddit": "LearnJapanese", "subreddit_id": "t5_2qyls"}, {"author": "hanazakari", "body": "I did spend a lot of time looking up words when I started until I started reading easier books.\n\nThen, it became faster at some point to look up the word two or three times using my Kindle and have it stick that way as opposed to going through the effort of putting my book down and creating an Anki card (I know there are ways of exporting Kindle highlights to Anki cards but I don't use any kind of extensions or technology - it's just me, the book, and my kindle's dictionary!).\n\nHowever, I have started reading in Korean recently where I only have a level equivalent to N3 and am utilizing some light sentence mining there with great gains.", "created_utc": "1654537802.0", "edited": "False", "id": "ibe3gr0", "is_submitter": "True", "link_id": "t3_v5z4tf", "parent_id": "t1_ibdqued", "score": "8", "subreddit": "LearnJapanese", "subreddit_id": "t5_2qyls"}, {"author": "hanazakari", "body": "I read with a Kindle or an iPad with the Kindle app for reference type books with images.", "created_utc": "1654537522.0", "edited": "False", "id": "ibe2tr6", "is_submitter": "True", "link_id": "t3_v5z4tf", "parent_id": "t1_ibdqekg", "score": "2", "subreddit": "LearnJapanese", "subreddit_id": "t5_2qyls"}, {"author": "hanazakari", "body": "I would have a very hard time picking a top 5 as there are just so many great Japanese books out there, but as I wrote in another comment I loved こちらあみ子 by 今村夏子. I also enjoyed most of the 芥川賞 prize winners from recent years and many of 村田沙耶香's books.\n\nIn terms of historical fiction, that's one of the genres that I actually spend the least time with but I enjoyed 火喰鳥――羽州ぼろ鳶組 by  \t\n今村翔吾 and 黒牢城 by 米澤穂信 (one of the 直木賞 winners from this January) so maybe check those two out. :)", "created_utc": "1654537486.0", "edited": "False", "id": "ibe2qtq", "is_submitter": "True", "link_id": "t3_v5z4tf", "parent_id": "t1_ibdlft9", "score": "6", "subreddit": "LearnJapanese", "subreddit_id": "t5_2qyls"}, {"author": "hanazakari", "body": "Thanks for the reply! Though normally a lurker, I'm a big fan of your posts (have even bought a few of the textbooks you've recommended including the Routledge translation course) so it's great to hear from you! \n\nIn response to your questions: \n\n* What are your plans from here on with Japanese?\n\nI don't have any concrete plans at all. I don't live in Japan, know any Japanese speakers in my city or use Japanese at work. Learning and reading in Japanese is purely a hobby and something I do to relax in my free time and I think it will stay that way for the near future. I simply find the language acquisition process very fun. \n\nHowever, there are a few things I think it'd be cool to try one day like working at a Japanese company or getting into literary translation, so let's see!\n\n* How many of those books were audiobooks? Did you read your books while listening to the audio?\n\nAbout 25 of these were audiobooks (so does that may mean I technically only read 175 books depending on interpretation). I have read 1 or 2 books in tandem with the audiobook but I don't enjoy it as I find the reading voice slower than my reading speed. I prefer to listen to audiobooks on their own while doing something else like practicing writing kanji. \n\nAudiobooks are a very valuable part of my reading routine as they help me make connections between kanji I've seen before and how it sounds in my head, and the actual sounds/pitch as native speakers pronounce them. \n\nI wish you luck with your study and reading ventures and look forward to your future posts. :)", "created_utc": "1654527121.0", "edited": "False", "id": "ibdetsj", "is_submitter": "True", "link_id": "t3_v5z4tf", "parent_id": "t1_ibdcq21", "score": "9", "subreddit": "LearnJapanese", "subreddit_id": "t5_2qyls"}, {"author": "hanazakari", "body": "30 books is a great milestone! Congratulations on your progress!\n\nNo, I don't use book meter for tracking (just a spreadsheet). Sorry! :(", "created_utc": "1654525717.0", "edited": "False", "id": "ibdbu1g", "is_submitter": "True", "link_id": "t3_v5z4tf", "parent_id": "t1_ibd6pl6", "score": "7", "subreddit": "LearnJapanese", "subreddit_id": "t5_2qyls"}, {"author": "hanazakari", "body": "You seem like you are on good path with the books you've read already. I would see if any of the related books to those on amazon spark your interest. \n\nYou've already read かがみの孤城 - if you liked that check out 辻村深月’s other books as well. They are all at a similar level and approachable for an intermediate. \n\nI would also recommend むらさきのスカートの女 by 今村夏子 if you like absurd stories and would like to begin dipping your toes into adult books this is a great option. It should be pretty approachable for an intermediate and uses simple language!", "created_utc": "1654524977.0", "edited": "False", "id": "ibdaauj", "is_submitter": "True", "link_id": "t3_v5z4tf", "parent_id": "t1_ibd1ea3", "score": "12", "subreddit": "LearnJapanese", "subreddit_id": "t5_2qyls"}, {"author": "hanazakari", "body": "I read manga too! I just don't count it towards my total.", "created_utc": "1654524684.0", "edited": "False", "id": "ibd9p60", "is_submitter": "True", "link_id": "t3_v5z4tf", "parent_id": "t1_ibd471b", "score": "10", "subreddit": "LearnJapanese", "subreddit_id": "t5_2qyls"}, {"author": "hanazakari", "body": "Good luck on the JLPT! Reading is definitely a great way to get an ability boost before the exam. \n\nI enjoy listening to 朝日新聞：ニュースの現場から and 好書好日：本好きの昼休み on spotify. :)", "created_utc": "1654524597.0", "edited": "False", "id": "ibd9ifl", "is_submitter": "True", "link_id": "t3_v5z4tf", "parent_id": "t1_ibd10jx", "score": "10", "subreddit": "LearnJapanese", "subreddit_id": "t5_2qyls"}, {"author": "hanazakari", "body": "Once you get started reading you are halfway there! The trick is to start again and again every day.", "created_utc": "1654514898.0", "edited": "False", "id": "ibcsth7", "is_submitter": "True", "link_id": "t3_v5z4tf", "parent_id": "t1_ibcsgaj", "score": "11", "subreddit": "LearnJapanese", "subreddit_id": "t5_2qyls"}, {"author": "hanazakari", "body": "I have read that link before and also have experience learning German as a foreign language and would absolutely agree with it in the context of Indo-European languages (assuming your native language is also an Indo-European one). \n\nI think for Japanese, the number of books is a little higher, perhaps around 150-175 (but I don't have any real data to quantify my experience - just going on feeling here!). However, reading becomes enjoyable way before that point so there is no real need to stress over the numbers. :) \n\nGood luck with your reading endeavors! If you were a bookworm as a kid, I'm sure it'll come back to you.", "created_utc": "1654514409.0", "edited": "False", "id": "ibcs5qx", "is_submitter": "True", "link_id": "t3_v5z4tf", "parent_id": "t1_ibcoi0n", "score": "29", "subreddit": "LearnJapanese", "subreddit_id": "t5_2qyls"}, {"author": "hanazakari", "body": "Thanks for the response! I had a lot of free time and love reading so I thought I'd take advantage. \n\nRegarding my top five reads from the lower levels - Absolutely! \n\nナミヤ雑貨店の奇蹟 (角川つばさ文庫) - Really engrossing (non-crime) mystery by 東野圭吾. This edition has furigana. \nhttps://www.amazon.co.jp/dp/4046317442/ref=cm_sw_em_r_mt_dp_SFDTM3J9SF0PN6P093WX\n\n多摩川にすてられたミーコ (角川つばさ文庫) - This is a children's book but it was an interesting look into the life of the homeless in Japan and animal welfare. Warning: if you have a cat there is a 100% chance this will make you cry. https://www.amazon.co.jp/dp/B00IFWA7NU/ref=cm_sw_em_r_mt_dp_1TNMVNWT01MDS2B5FRME\n\n霧のむこうのふしぎな町 (新装版) (講談社青い鳥文庫) - Strange but fun to read story, served as inspiration for Spirited Away. https://www.amazon.co.jp/dp/4061486683/ref=cm_sw_em_r_mt_dp_NFZRN1KAP2M9KSD0BRT3?_encoding=UTF8&psc=1\n\n「獣の奏者（青い鳥文庫版）」シリーズ  - All of the 上橋菜穂子 fantasy series are interesting and this one is no exception! The level is for this series is slightly lower than her others and you can read it with furigana here https://www.amazon.co.jp/dp/B07ZTVJJBP?ref=cm_sw_em_r_nmg_sd_rwt_55ngsXBDPi3mq\n\n【TOジュニア文庫】本好きの下剋上 - These are just charming and fun there is also an anime you can watch in parallel to improve your comprehension. Furigana version here https://www.amazon.co.jp/dp/B07WP6TKF3?ref=cm_sw_em_r_nmg_sd_rwt_R6qN8jyTHmIKJ", "created_utc": "1654514203.0", "edited": "False", "id": "ibcrvyo", "is_submitter": "True", "link_id": "t3_v5z4tf", "parent_id": "t1_ibcorcc", "score": "56", "subreddit": "LearnJapanese", "subreddit_id": "t5_2qyls"}, {"author": "hanazakari", "body": "Good luck! It will just get easier from here on out! \n\nInterestingly enough, 夜は短し歩けよ乙女 was one of the books I attempted to read early on and had to set aside as I found it too difficult. I wish you more success than I had with it!", "created_utc": "1654513634.0", "edited": "False", "id": "ibcr5l6", "is_submitter": "True", "link_id": "t3_v5z4tf", "parent_id": "t1_ibcowom", "score": "5", "subreddit": "LearnJapanese", "subreddit_id": "t5_2qyls"}, {"author": "hanazakari", "body": "I use a kindle connected to an account I made at Amazon Japan. I buy ebooks there while connected to a VPN and they download straight to my kindle. \n\nI think it should be possible to buy books from Amazon JP or Bookwalker and use Calibre to change the formatting and then manually add them to a Kobo, though.", "created_utc": "1654510065.0", "edited": "False", "id": "ibcmke5", "is_submitter": "True", "link_id": "t3_v5z4tf", "parent_id": "t1_ibclbp7", "score": "30", "subreddit": "LearnJapanese", "subreddit_id": "t5_2qyls"}]