[{"author": "Hedgehog-Moist", "body": "Actively look for texts (news articles, books) and audio materials (news reports, TV shows, podcasts) of your target language. Delve into every word and grammar that you are not familiar with. Learn the new words and grammar and familiarize yourself until you feel completely comfortable with the text and reconstructing the entire text/paragraphs yourself.", "created_utc": "1663955639.0", "edited": "False", "id": "ipmdy8r", "is_submitter": "False", "link_id": "t3_xm4a41", "parent_id": "t3_xm4a41", "score": "11", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Hedgehog-Moist", "body": "Good to know! And I agree with you. I feel like learning linguistically near languages at once or sequentially makes a synergy effect, which becomes a huge bonus for learning other similar languages.", "created_utc": "1663955256.0", "edited": "False", "id": "ipmd2q2", "is_submitter": "True", "link_id": "t3_xm3ukx", "parent_id": "t1_ipmcd75", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Hedgehog-Moist", "body": "As I said, you chose your language based on your needs. You can't be spending your time learning Spanish or Mandarin - two \"useful\" languages - if you are about to be deployed to Thailand for example. I have no Idea what your needs are. You know your needs better than anyone else. Therefore it is your own duty to chose your languages based on your needs instead of asking for advice on what to learn from randos on Reddit who knows little about your intentions. Yes, some languages open more opportunities than others. Therefore since your priority is utility and you don't seem to have a clear cut goal on what to achieve from your languages studies, you may chose to learn whatever you think are the most useful. Since you plan on traveling to Germany, yes, you may learn German. Since you find Spanish useful, yes, you may learn Spanish. Since you have no interest in learning Spanish, yes, you may chose not to learn Spanish.", "created_utc": "1663894542.0", "edited": "1663895515.0", "id": "ipjkln7", "is_submitter": "False", "link_id": "t3_xj2leh", "parent_id": "t1_ipikdev", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Hedgehog-Moist", "body": "Yes it is bad. Translating what you want to say mid-sentence is a bad habit, because it will hinder you from building your sentences fast enough. Granted you are still in your learning phase as a beginner, but you cannot resort to this habit as your level advances. You need to be used to thinking in your TL directly from the beginning. You can acquire this habit by becoming familiar with the sentence structure so that you don't get stuck mid-sentence, and try practicing talking out loud on your own, and try to talk almost as fast as a native speaker.", "created_utc": "1663807032.0", "edited": "False", "id": "ipenfce", "is_submitter": "False", "link_id": "t3_xkc858", "parent_id": "t3_xkc858", "score": "-5", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Hedgehog-Moist", "body": "Khmer is not a tonal language. And tones are something that can be easily overcome with a few weeks of practice; speaking from personal experience. Their alphabets are fairly complicated indeed but the effort needed for overcoming the hurdle of a new script is only a very small proportion of the entire process of learning a new language.", "created_utc": "1663805913.0", "edited": "1663806245.0", "id": "ipekupo", "is_submitter": "False", "link_id": "t3_xjr84s", "parent_id": "t1_ipd7jas", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Hedgehog-Moist", "body": "The answer for this question only depends on the amount of effort you actually put into practicing speaking. If you had practiced speaking along with listening and reading simultaneously the three skills would have been in par. Some learners claim they have far worse listening skills compared to speaking, it is a result of different methods and priorities when learning a new language.", "created_utc": "1663771857.0", "edited": "1663772158.0", "id": "ipc60eg", "is_submitter": "False", "link_id": "t3_xk5wnb", "parent_id": "t3_xk5wnb", "score": "7", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Hedgehog-Moist", "body": "Bulgarian, Macedonian, Farsi, Mandarin, Tibetan, Thai, Lao, Khmer, Burmese. These languages have fairly simple grammar. You might think it's very odd to see Mandarin here, but trust me, Mandarin has very simple grammar.", "created_utc": "1663747616.0", "edited": "False", "id": "ipazswy", "is_submitter": "False", "link_id": "t3_xjr84s", "parent_id": "t3_xjr84s", "score": "-1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Hedgehog-Moist", "body": "Thanks for the new insight. Could you give me the source of the paper by Kaufmanm et al.? I'd like to have a further look into the study.", "created_utc": "1663733107.0", "edited": "False", "id": "ipaelrk", "is_submitter": "False", "link_id": "t3_xjndaz", "parent_id": "t1_ip9pzjx", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Hedgehog-Moist", "body": "This can only be overcome by practicing more listening comprehension. Look for videos in your target language with subtitles in the same language and try listening to them repeatedly.", "created_utc": "1663720183.0", "edited": "False", "id": "ip9ngwk", "is_submitter": "False", "link_id": "t3_xjl5xa", "parent_id": "t3_xjl5xa", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Hedgehog-Moist", "body": "Immediately. Toddlers learn languages differently from adults. Adults learn languages from books and classes while they are already equipped with a fluent mother tongue. In such cases students are advised to practice their words and sentences out loud as soon as they learn.", "created_utc": "1663719808.0", "edited": "False", "id": "ip9mnh6", "is_submitter": "False", "link_id": "t3_xjndaz", "parent_id": "t3_xjndaz", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Hedgehog-Moist", "body": "Take a look at [this interview](https://www.youtube.com/watch?v=GROe8h3tA3M&t=504) by Dr. Alexander Arguelles from 8:24 to 10:57. The method of not mixing up different (yet closely related) languages while learning simultaneously is building separate categories for different languages in your mind. I too have studied similar languages simultaneously and from my experience I can tell you that you will not come across this problem if you study with much precision and .", "created_utc": "1663675794.0", "edited": "False", "id": "ip6n8ou", "is_submitter": "False", "link_id": "t3_xj46wi", "parent_id": "t3_xj46wi", "score": "5", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Hedgehog-Moist", "body": "There are quite a lot of resources online and offline. I suggest you to do more research on Google or Amazon. I wonder how you came to that conclusion...", "created_utc": "1663663513.0", "edited": "False", "id": "ip66mr1", "is_submitter": "False", "link_id": "t3_xix4uh", "parent_id": "t1_ip5tb2k", "score": "17", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Hedgehog-Moist", "body": "Terrible curriculum. German phonetics isn't terribly difficult; it is something that can be dealt with by a couple of hours of classes or straight up reading words or dialogues aloud.", "created_utc": "1663663136.0", "edited": "False", "id": "ip667v9", "is_submitter": "False", "link_id": "t3_xj15p9", "parent_id": "t3_xj15p9", "score": "0", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Hedgehog-Moist", "body": "There are no good line ups or bad line ups. You learn whatever you chose to learn based on your interests and need.", "created_utc": "1663663031.0", "edited": "False", "id": "ip663nj", "is_submitter": "False", "link_id": "t3_xj2leh", "parent_id": "t3_xj2leh", "score": "45", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Hedgehog-Moist", "body": "I focus on every aspects of a language: written and spoken language, listening and reading comprehension, conversation skills in general. I mention them because use of dictionaries and a good understanding in grammar are necessary for all aspects of a language including speaking.", "created_utc": "1663603743.0", "edited": "False", "id": "ip2vmep", "is_submitter": "False", "link_id": "t3_xia2hu", "parent_id": "t1_ip2okxp", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Hedgehog-Moist", "body": "In short: The methods you can use as a senior language learner are no different from methods that young adults use, with a few exceptions.\n\nA new language learner of old age might be concerned of the popular belief that language learning is only efficient when learnt at a young age. This is known as the [critical theory hypothesis](https://en.wikipedia.org/wiki/Critical_period_hypothesis). However there are many independent studies and experiments that rebut this theory. As someone who is past this age myself, I am also a big skeptic of this theory. In fact, I believe that the more experienced with studying in general you are the more efficiently you can learn a new language.\n\nYoung kids can easily pick up a new language because they are put in situations in which mostly basic words with short sentences are spoken around them, which facilitates them to pick up words and structures of a language through constant exposure only. Teens or adults however cannot be put into such situations as we live in rather professional settings. Words of low frequency and long & complex sentences are used everywhere, which makes it difficult to naturally pick up a new language through exposure only. More importantly, at this stage, unlike children we are already equipped with a fluent mother tongue, which forces us to learn a new language through the medium of textbooks and classes written and conducted in our mother tongue.\n\nMany studies have proved that adults preform far better than kids when they are taught a new language with this method thanks to years of studying experiences in high school and college. In this case, we take the general path of learning a new language through classes and books. This method can be used by young and senior adults alike.\n\nHowever, considering the difference in lifestyle between seniors and young adults, seniors might want to take a look into these differences.\n\nLanguage learning requires the learner to be constantly exposed to the target language. The **internet** is the most ideal medium for this effort. People can read articles, watch videos or TV shows of foreign media outlets with the help of the internet. We can also communicate with native speakers of our target languages through the internet. Considering the fact that senior adults might not be very familiar with these platforms, they can try reaching out for help to young people to introduce themselves to these websites or apps such as YouTube, Tandem or Discord. On the other hand, if utilizing the internet is not an ideal option, they can also look for community services or social clubs which help them with classes or language exchanges.\n\nApart from these specific advice for senior adults, everyone can ask for general advice for language learning on this subreddit, in which many users would be happy to reach out and help.\n\nedit: typo and a few words", "created_utc": "1663596996.0", "edited": "1663599102.0", "id": "ip2evb3", "is_submitter": "False", "link_id": "t3_xicpqi", "parent_id": "t3_xicpqi", "score": "155", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Hedgehog-Moist", "body": "I have never used materials that solely target enhancing speaking skills, since ordinary textbooks did the job for me. However I assume that you might want to look for textbooks that are focused on the spoken (colloquial) language. It should provide up-to-date usage of words, dialogues based on various situations and a good number of modern slangs. It goes without saying that the book has accompanying audio files for each dialogues.", "created_utc": "1663595595.0", "edited": "False", "id": "ip2bldu", "is_submitter": "False", "link_id": "t3_xia2hu", "parent_id": "t1_ip29qch", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Hedgehog-Moist", "body": "Lack of decent resources to study with. Notably, an online dictionary with full conjugations, a standardized and comprehensive reference grammar, textbooks and readers of various levels from basic to advanced.", "created_utc": "1663593264.0", "edited": "False", "id": "ip26eqi", "is_submitter": "False", "link_id": "t3_xia2hu", "parent_id": "t3_xia2hu", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Hedgehog-Moist", "body": "No because they are low quality materials imo. But I've looked into quite a few of them", "created_utc": "1663585533.0", "edited": "False", "id": "ip1saf9", "is_submitter": "False", "link_id": "t3_xhpxgd", "parent_id": "t1_ip1pm5k", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Hedgehog-Moist", "body": "The answer to this question applies the same to all languages. Not a single language requires more or less number of words for a certain level of proficiency. How would you define \"foundation\"? According to [CEFR](https://www.coe.int/en/web/common-european-framework-reference-languages/table-1-cefr-3.3-common-reference-levels-global-scale) standards you need to know at least six thousand words to \"understand the main ideas of complex text on both concrete and abstract topics\" (B1) and eight thousand words to \"understand the main points of clear standard input on familiar matters regularly encountered in work, school, leisure, etc.\"", "created_utc": "1663572190.0", "edited": "False", "id": "ip1bw8j", "is_submitter": "False", "link_id": "t3_xi3wob", "parent_id": "t3_xi3wob", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Hedgehog-Moist", "body": "I fully agree with all of your points above. Better quality with textbooks and courses due to advance in education technology, more materials accessible online, better access to native speakers and teachers even at home.", "created_utc": "1663567237.0", "edited": "False", "id": "ip15oq6", "is_submitter": "False", "link_id": "t3_xi33ls", "parent_id": "t3_xi33ls", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Hedgehog-Moist", "body": "No. I've learned similar languages simultaneously and I have never come across this problem despite of my early worries, thanks to a habit of trying to learn them as accurately as possible with precision.", "created_utc": "1663566902.0", "edited": "False", "id": "ip158l2", "is_submitter": "False", "link_id": "t3_xhg60r", "parent_id": "t3_xhg60r", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Hedgehog-Moist", "body": "The more, the better. As long as you take enough breaks to cool your brain and take some time to internalize what you learned form classes, you can try studying as much as 10 hours everyday. Speaking from personal experience.", "created_utc": "1663566201.0", "edited": "False", "id": "ip149ph", "is_submitter": "False", "link_id": "t3_xhi0ix", "parent_id": "t3_xhi0ix", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Hedgehog-Moist", "body": "Indonesian and Thai might be what you are looking for. The languages are spoken by a large number of people and there are tons of modern modern contents online. Vietnamese is also widely spoken but I find them to rather lack of contents online in relation to the number of speakers.", "created_utc": "1663566037.0", "edited": "False", "id": "ip141bg", "is_submitter": "False", "link_id": "t3_xhib5t", "parent_id": "t3_xhib5t", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Hedgehog-Moist", "body": "Once you become familiar with Thai script and the phonetics which will probably take a few weeks, you will advance very quickly since the grammar is very simple unlike Russian. No genders, complex tenses or conjugations.", "created_utc": "1663565422.0", "edited": "False", "id": "ip13584", "is_submitter": "False", "link_id": "t3_xhn5x2", "parent_id": "t3_xhn5x2", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Hedgehog-Moist", "body": "The method I use is not exactly shadowing: I just repeat after the audio and build my own sentences and dialogues out loud. The method has been very helpful for me: my pronunciation is fairly good in all languages that I learn, and I can also build sentences fairly well. I do not record myself and listen to my own voice because I find it time consuming and unnecessary. Repeating until I sound fairly natural and convincing has been enough.", "created_utc": "1663565211.0", "edited": "False", "id": "ip12twj", "is_submitter": "False", "link_id": "t3_xhox4z", "parent_id": "t3_xhox4z", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Hedgehog-Moist", "body": "Naver sure is the best and most comprehensive dictionary out there, and almost all of the time it is fairly accurate. I think it's just a few uncommon words where the definitions need some more proper descriptions. For better accuracy I suggest you use Korean-Korean dictionaries too, if your Korean is actually good enough to utilize words like 발름하다.", "created_utc": "1663564925.0", "edited": "False", "id": "ip12esl", "is_submitter": "False", "link_id": "t3_xi1khc", "parent_id": "t1_ip11vwj", "score": "48", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Hedgehog-Moist", "body": "You might also want to spend some more time in reading and output and internalization. Grammar and listening are two of many aspects of input. You also need reading for proper input. You also need to allocate some of your time for output by building your own sentences or practicing your new knowledge with native speakers so that what you have newly learned sticks with you, and repeat the process to internalize your new skills and memory.", "created_utc": "1663564671.0", "edited": "False", "id": "ip12147", "is_submitter": "False", "link_id": "t3_xhpqgj", "parent_id": "t3_xhpqgj", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Hedgehog-Moist", "body": "It is neither good nor bad. Such courses naturally offer what can be offered within a week or two. No matter how much or little the quantity of the contents are, the duration only depends on how fast you study them with determination. So if you are a lazy learner, a typical one week course will take a month. If you are a studious learner like me, you only need two or three days to finish a textbook.", "created_utc": "1663564375.0", "edited": "False", "id": "ip11ljz", "is_submitter": "False", "link_id": "t3_xhpxgd", "parent_id": "t3_xhpxgd", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Hedgehog-Moist", "body": "Despite having used Korean for the past two decades I have never seen this word before. And the definition you brought here is incorrect; it means to be open mildly, not too wide. It seems like you got that definition from Naver Dictionary but my further research tells otherwise.", "created_utc": "1663564026.0", "edited": "False", "id": "ip112di", "is_submitter": "False", "link_id": "t3_xi1khc", "parent_id": "t3_xi1khc", "score": "51", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Hedgehog-Moist", "body": "From personal experience reading Wikipedia articles of my favorite subjects in English significantly improved my reading comprehension and allowed me to read twice as fast. Reading subjects that I like helped me ro naturally immerse into my materials.", "created_utc": "1663563822.0", "edited": "False", "id": "ip10qei", "is_submitter": "False", "link_id": "t3_xi1ohe", "parent_id": "t3_xi1ohe", "score": "16", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Hedgehog-Moist", "body": "I cannot understand when people claim learning two different languages simultaneously can cause confusion because I've tried it myself (two or three linguistically close & distant languages) and I've never experienced this problem. I think some people find it confusing because they don't put in proper input without enough focus. Studying languages needs immersion. When you study literature and social studies, or two different chapters of science during the same day after a few hours in high school you don't mix up the knowledge of different contexts.", "created_utc": "1663505481.0", "edited": "1663563537.0", "id": "iox5x7n", "is_submitter": "False", "link_id": "t3_xh3t1l", "parent_id": "t1_iowry05", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Hedgehog-Moist", "body": "Then you might want to make a decision as soon as possible. You can either choose to learn Spanish so that you don't feel bad anymore, or make up your mind to stop feeling bad over not doing something that you don't feel motivated enough to.", "created_utc": "1663487711.0", "edited": "False", "id": "iowf5l3", "is_submitter": "False", "link_id": "t3_xfssjf", "parent_id": "t3_xfssjf", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Hedgehog-Moist", "body": "Since you are already fairly good with grammar, try reading a few books written for youths. Set a goal of familiarizing yourself with every single words in the book. If one is not easily motivated, no words or advice can suddenly spark up a motivation. Therefore if you are really committed into learning some new words, force yourself into learning by setting a goal.", "created_utc": "1663487131.0", "edited": "False", "id": "iowef09", "is_submitter": "False", "link_id": "t3_xg5zhj", "parent_id": "t3_xg5zhj", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Hedgehog-Moist", "body": "Definitely the latter. The more mistakes you make are corrected with proper feedback the more you will improve. But also make sure the tutor gives you a lot of space to express yourself on your own, and then corrects your mistakes afterwards.", "created_utc": "1663486755.0", "edited": "False", "id": "iowdxeu", "is_submitter": "False", "link_id": "t3_xgf8fx", "parent_id": "t3_xgf8fx", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Hedgehog-Moist", "body": "I adhere to a rather controversial but progressive and effective way when learning new words. I never use flashcards, or make a huge list of words to memorize, because they are time consuming to make. It is very difficult to internalize their meanings and use them in real conversations afterwards through this method. I learn new words through context of long passages. I don't memorize words; I memorize and familiarize myself with sentences and passages. I highlight words that I am not familiar with in sentences or long articles in my textbook, and I constantly repeat reciting those sentences by memory day after day until I feel completely confident with using the words in real contexts. I also expose myself to a lot of input by reading and listening more articles and sentences, so that I hopefully bump into those words again in completely different contexts, that way I can augment the memory and knowledge of recently or previously learnt new words.", "created_utc": "1663486234.0", "edited": "1663486529.0", "id": "iowd9t1", "is_submitter": "False", "link_id": "t3_xggkuq", "parent_id": "t3_xggkuq", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Hedgehog-Moist", "body": "I prefer the traditional way, because I find them the most effective and helpful. I mostly study with textbooks and audio files. I sometimes use the internet for online dictionaries or media materials like videos and news articles. Plus lots of practice and application (not apps but applying for actual use). I never use silly apps or programs like Duolingo, Rosetta Stone or Anki, because my progress with books is more than twice as fast as their pace.", "created_utc": "1663485468.0", "edited": "False", "id": "iowcajy", "is_submitter": "False", "link_id": "t3_xgr9v8", "parent_id": "t3_xgr9v8", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Hedgehog-Moist", "body": "You did mention that you already know English, but despite of this I chose to say the best language for traveling is English. It can be used to various extents no matter where you are at. The rest of the languages only depend on where you intend to travel to. Surely French, Russian or Arabic is spoken by a lot of people in many countries, but obviously you cannot make use of them when you are traveling around South East Asia for example. Your concern should be \"I chose to travel to (insert countries or region), what language would be useful to learn?\" instead.", "created_utc": "1663484733.0", "edited": "1663485288.0", "id": "iowbcsh", "is_submitter": "False", "link_id": "t3_xgukt9", "parent_id": "t3_xgukt9", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Hedgehog-Moist", "body": "I personally see nothing wrong with this plan. We have all been through high school or college years of studying multiple subjects in a day. The same goes with languages. As long as you plan and execute your schedules wisely nothing will go wrong with studying multiple languages simultaneously.", "created_utc": "1663484359.0", "edited": "False", "id": "iowav1g", "is_submitter": "False", "link_id": "t3_xgv361", "parent_id": "t3_xgv361", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Hedgehog-Moist", "body": "Why not learn both Swedish and Spanish simultaneously? What need is there to regret over not learning a certain desired language? If you feel bad about not trying something I suggest you to go for it without second thoughts and plan out your schedule wisely. I am personally working on three languages simultaneously despite of my packed schedules. One is fairly popular while the other two are not very well known. If you manage your time wisely enough you will have the time and motivation to juggle through multiple languages.", "created_utc": "1663483675.0", "edited": "False", "id": "iow9x7j", "is_submitter": "False", "link_id": "t3_xh3t1l", "parent_id": "t3_xh3t1l", "score": "4", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Hedgehog-Moist", "body": "I mostly use books and sometimes online materials like dictionary, news articles and videos. Once I am done with looking through a few chapters of my textbook, I try constructing my own sentences out loud by using the words and grammar within the chapters.", "created_utc": "1663483255.0", "edited": "False", "id": "iow9cd9", "is_submitter": "False", "link_id": "t3_xh5x9p", "parent_id": "t3_xh5x9p", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Hedgehog-Moist", "body": "This is a very natural phenomenon. During your first try of reading the sentences you must have studied through unfamiliar words and grammar. But your problem is that you get back to them *a few days* or even *a week* later. I suggest you to look in to the [Forgetting curve](https://en.wikipedia.org/wiki/Forgetting_curve) hypothesis; in order to maintain a certain memory you are required to review it *every day* for a while with *consistency.* To those who are unfamiliar with the language, Korean is indeed a tricky language to learn, so you might want to look into your materials more frequently.", "created_utc": "1663483035.0", "edited": "1663483322.0", "id": "iow91h4", "is_submitter": "False", "link_id": "t3_xh736w", "parent_id": "t3_xh736w", "score": "14", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Hedgehog-Moist", "body": "My native language is SOV, and I've dealt with a few SOV(Turkic and Indo-Aryan langauges), SVO and VSO(Tagalog and Arabic) languages. From my experience, as soon as I got used to the sentence structure in general (which took a few weeks,)  unfamiliar word order never became a hassle.", "created_utc": "1663336001.0", "edited": "False", "id": "iony5s6", "is_submitter": "False", "link_id": "t3_xfg21u", "parent_id": "t3_xfg21u", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Hedgehog-Moist", "body": "The best way to learn Romanian applies to learning any other languages. There are so many ways to reach so many different levels that learners want to achieve. I am personally very skeptical against using language apps as a learning medium; I suggest using textbooks that can be easily found or ordered online, such as *Colloquial Romanian* or *You Can Speak Romanian!* Make sure to closely follow through the dialogues with audio files, and then if the basics are done, try reading news articles or watching news in Romanian online. http://www.dictionare.com/ is a great online dictionary.", "created_utc": "1663335393.0", "edited": "False", "id": "ionwql7", "is_submitter": "False", "link_id": "t3_xfq72o", "parent_id": "t3_xfq72o", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Hedgehog-Moist", "body": ">English words are quite common in Farsi\n\nThey are not *English words*, they are English loan words in Farsi, which are basically Farsi words.\n\n>It almost feels like I’m mocking the accent\n\nThere is absolutely no reason to feel this way. Just pronounce the word in the way natives of your target language pronounce it.\n\n>I imagine this is probably common in quite a few languages\n\nAlmost all languages have English or Western loan words. Despite of their roots they are all pronounced in their own unique ways.", "created_utc": "1663335012.0", "edited": "False", "id": "ionvvem", "is_submitter": "False", "link_id": "t3_xfqkw1", "parent_id": "t3_xfqkw1", "score": "25", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Hedgehog-Moist", "body": "I adhere to these three rules for vocabulary acquisition:\n\n1. **Repetition.** Repetition is the key of internalizing newly learnt words. Put some effort into looking into the words repeatedly, like once every day or week.\n2. **Repeated exposure in meaningful contexts.** Learning words through a random list of words with words of target language and their meanings in your medium language are not effective. Try actively learning new words within a long passage, so that you can easily remember the meanings and associate them into a specific context.\n3. **Root and Etymology.** Oftentimes big words are made of a number of small components. When you look into a new word, try focusing on the roots of the words so that you can easily guess and memorize its meaning. Or try associating the words with other words of another language that you already know.", "created_utc": "1662865109.0", "edited": "False", "id": "inxuy6o", "is_submitter": "False", "link_id": "t3_xb1h4d", "parent_id": "t3_xb1h4d", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Hedgehog-Moist", "body": "Absolutely not. Even the smartest AIs often miss specific nuances between different languages. No professional uses computerized tools (i.e. translation tools) for serious settings.", "created_utc": "1662864656.0", "edited": "False", "id": "inxu1qm", "is_submitter": "False", "link_id": "t3_xb2li9", "parent_id": "t3_xb2li9", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Hedgehog-Moist", "body": "The 'most important words' you are referring to are probably 'most frequently used words'. On [https://1000mostcommonwords.com/](https://1000mostcommonwords.com/) you can check out lists of the 1000 most commonly used words of many dozens of languages. Aside from this, by a little bit of googling you can find many other websites that shows lists of 1000 or more words.", "created_utc": "1662864204.0", "edited": "False", "id": "inxt5rg", "is_submitter": "False", "link_id": "t3_xb65ce", "parent_id": "t3_xb65ce", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Hedgehog-Moist", "body": "As a mentor (not a teacher) the best you can do is encouraging your brother to learn and giving motivation. You can stir up his motivation by talking or chatting with him in French, much like the advice that the other folks here have given already. However nudging someone to be motivated has its limits, so do not be too disappointed if he is not as enthusiastic as you are.\n\nSince you mentioned \"critical language learning period\", if one learns a language from books or apps unlike naturally picking up in casual settings, the age gap of critical language theory is of no use. In such cases adults are meant to learn languages faster than kids, since a man's brain continues to develop until around the age of 25.", "created_utc": "1662798356.0", "edited": "1662865384.0", "id": "inu0ah2", "is_submitter": "False", "link_id": "t3_x9jgll", "parent_id": "t3_x9jgll", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Hedgehog-Moist", "body": "Sorry, I got your meaning completely wrong. Yes, 5 days a week is actually a good schedule. A rule of thumb in language learning is that you study EVERYDAY, whether that be 5 minutes or 2 hours each day. So during the remaining two days you can chill by shortly reviewing your words or phrases. You don't necessarily need input 7 days a week nonstop.", "created_utc": "1662797987.0", "edited": "False", "id": "intzusf", "is_submitter": "False", "link_id": "t3_xaj5hx", "parent_id": "t1_intzjtx", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Hedgehog-Moist", "body": "This sounds like a better deal because the weekly intervals can give you time to internalize your memory. You can practice phrases or listen to the audios during your commute, which will be a far better boost than cramming everything in a few dozen hours.", "created_utc": "1662796878.0", "edited": "False", "id": "intyk0c", "is_submitter": "False", "link_id": "t3_xaj5hx", "parent_id": "t1_inty1a8", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Hedgehog-Moist", "body": "I don't think being multilingual has helped me improve my memory. I've just gotten to acquire better skills for internalizing words/phrases/grammar, which isn't the same as memory skills in general. I feel like my memory is just the same as 10 years ago.", "created_utc": "1662796708.0", "edited": "False", "id": "intycsh", "is_submitter": "False", "link_id": "t3_x9yqed", "parent_id": "t3_x9yqed", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Hedgehog-Moist", "body": "Good to see you here, lingdocs. I eventually came across your grammar and dictionary and am progressing well with your resources.", "created_utc": "1662795612.0", "edited": "False", "id": "intx236", "is_submitter": "True", "link_id": "t3_vwainf", "parent_id": "t1_inafsfc", "score": "2", "subreddit": "Pashtun", "subreddit_id": "t5_2s9mm"}, {"author": "Hedgehog-Moist", "body": "I hope my comment above brings you some insight.", "created_utc": "1662795329.0", "edited": "False", "id": "intwq77", "is_submitter": "False", "link_id": "t3_xa1b26", "parent_id": "t1_int3aid", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Hedgehog-Moist", "body": "Since it has been quite a while since you've learned Latvian, forget about the progress you have made so far, if you are determined to relearn a language you haven't touched for a while, try starting from the beginning again. Because 1) your prior knowledge of words and grammar must have deteriorated over time, and 2) you need to be sure you do not make the wrong assumption that you are already around intermediate level and as a result skip a few chapters or levels of which you failed to fully grasp. Take this opportunity to review your prior knowledge and make sure you don't miss any basic details.", "created_utc": "1662795288.0", "edited": "1662795474.0", "id": "intwogj", "is_submitter": "False", "link_id": "t3_xa1b26", "parent_id": "t3_xa1b26", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Hedgehog-Moist", "body": "I am a fast learner especially in languages. From my experience language classes in groups always bored me out because of their slow pace. I prefer studying completely on my own with books, audios and online resources. I'd often ask native speakers questions and chat with them online. If I were to learn with a teacher I'd take private 1 on 1 classes.", "created_utc": "1662794247.0", "edited": "False", "id": "intvflv", "is_submitter": "False", "link_id": "t3_xa3ws5", "parent_id": "t3_xa3ws5", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Hedgehog-Moist", "body": "I am fairly good in a certain foreign language. This ability gave me the ability to learn another foreign language with very few resources in English and my NL. I ordered several very good books online from this country of which the language I am fairly good at, and am in the process in advancing with my new language.", "created_utc": "1662794036.0", "edited": "False", "id": "intv6gw", "is_submitter": "False", "link_id": "t3_xa4inb", "parent_id": "t3_xa4inb", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Hedgehog-Moist", "body": "The best language for traveling only depends on where you intend to visit. The only language that is helpful everywhere would be English. Since you already know English and you intend to learn a new language for the purpose of traveling, before deciding what language to learn I suggest you to set a target travel destination first and learn the related languages.", "created_utc": "1662793145.0", "edited": "False", "id": "intu31j", "is_submitter": "False", "link_id": "t3_xaccan", "parent_id": "t3_xaccan", "score": "5", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Hedgehog-Moist", "body": "Learning one and teaching another cannot be done simultaneously. The best way to do both is to divide your time devoted into two parts, one in which you learn, another in which you teach.", "created_utc": "1662792840.0", "edited": "False", "id": "inttpl5", "is_submitter": "False", "link_id": "t3_x9v18k", "parent_id": "t3_x9v18k", "score": "0", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Hedgehog-Moist", "body": "u/savevideo", "created_utc": "1662385018.0", "edited": "False", "id": "in6ko12", "is_submitter": "False", "link_id": "t3_vvofas", "parent_id": "t3_vvofas", "score": "1", "subreddit": "Pashtun", "subreddit_id": "t5_2s9mm"}, {"author": "Hedgehog-Moist", "body": "What I'm looking for is a dictionary that shows inflections for all words, but that looks like a great reference! I'll check it out 🙏🙏", "created_utc": "1657687740.0", "edited": "False", "id": "ifych54", "is_submitter": "True", "link_id": "t3_vwainf", "parent_id": "t1_ifpbtmc", "score": "2", "subreddit": "Pashtun", "subreddit_id": "t5_2s9mm"}, {"author": "Hedgehog-Moist", "body": "we are so proud of you sarto  \n\\- dorj", "created_utc": "1655120318.0", "edited": "False", "id": "ic6y1k2", "is_submitter": "False", "link_id": "t3_vaourr", "parent_id": "t3_vaourr", "score": "1", "subreddit": "mongolia", "subreddit_id": "t5_2qll8"}, {"author": "Hedgehog-Moist", "body": ">My dad (M55) invited me (F36)\n\nuh oh...", "created_utc": "1654668656.0", "edited": "False", "id": "ibkuzsp", "is_submitter": "False", "link_id": "t3_v764ir", "parent_id": "t3_v764ir", "score": "0", "subreddit": "relationships", "subreddit_id": "t5_2qjvn"}, {"author": "Hedgehog-Moist", "body": "I see, thanks", "created_utc": "1652366291.0", "edited": "False", "id": "i8bnaz7", "is_submitter": "True", "link_id": "t3_unyw6d", "parent_id": "t1_i8bkkzw", "score": "1", "subreddit": "malta", "subreddit_id": "t5_2qrbz"}, {"author": "Hedgehog-Moist", "body": "Looks useful! Only if my Maltese is good enough for this though, but thanks 👍", "created_utc": "1652355796.0", "edited": "False", "id": "i8b120i", "is_submitter": "True", "link_id": "t3_unyw6d", "parent_id": "t1_i8b05ov", "score": "1", "subreddit": "malta", "subreddit_id": "t5_2qrbz"}, {"author": "Hedgehog-Moist", "body": "Only at around 0:25 did I realize she is speaking english", "created_utc": "1651906557.0", "edited": "False", "id": "i7nght8", "is_submitter": "False", "link_id": "t3_ujx2yr", "parent_id": "t3_ujx2yr", "score": "3", "subreddit": "Somalia", "subreddit_id": "t5_2qm0m"}, {"author": "Hedgehog-Moist", "body": "Plain polite is not used for siblings or friends. It is more fit for older family members or adults that we are intimate with. Also includes teachers, so deferential is a bit too formal to use for talking with your teachers. Deferential form is fit for literary text or official announcements.\n\nKorean honorifics has so much more forms apart from these. There are separate intimate forms used for friends or siblings.", "created_utc": "1644892426.0", "edited": "False", "id": "hwziepc", "is_submitter": "False", "link_id": "t3_ssr8uk", "parent_id": "t3_ssr8uk", "score": "1", "subreddit": "Korean", "subreddit_id": "t5_2rd8q"}, {"author": "Hedgehog-Moist", "body": "\\`vertical-lr\\`", "created_utc": "1644590629.0", "edited": "False", "id": "hwice7i", "is_submitter": "False", "link_id": "t3_spvcmh", "parent_id": "t3_spvcmh", "score": "3", "subreddit": "linguisticshumor", "subreddit_id": "t5_2vwiq"}, {"author": "Hedgehog-Moist", "body": "Inspired by https://www.reddit.com/r/linguisticshumor/comments/se1qeg/n%C3%A9/", "created_utc": "1644130177.0", "edited": "False", "id": "hvs8ru2", "is_submitter": "True", "link_id": "t3_slqakq", "parent_id": "t3_slqakq", "score": "6", "subreddit": "linguisticshumor", "subreddit_id": "t5_2vwiq"}, {"author": "Hedgehog-Moist", "body": "Non-Pakistani here, what's up with written Pashto? How does it look posh?", "created_utc": "1630731558.0", "edited": "False", "id": "hbjakgj", "is_submitter": "False", "link_id": "t3_phd2d1", "parent_id": "t3_phd2d1", "score": "4", "subreddit": "pakistan", "subreddit_id": "t5_2qh89"}, {"author": "Hedgehog-Moist", "body": "Just in case you have not yet come across with this, DLI Dari courses are accessible online and its quality is exceptionally good. https://yojik.eu/languages/DLI/DLI-Dari.html", "created_utc": "1629471977.0", "edited": "False", "id": "h9o4whi", "is_submitter": "False", "link_id": "t3_ow8hmz", "parent_id": "t1_h7hft54", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Hedgehog-Moist", "body": "Thanks for the advice!", "created_utc": "1629459017.0", "edited": "False", "id": "h9ne163", "is_submitter": "True", "link_id": "t3_p7f27k", "parent_id": "t1_h9lw2iw", "score": "1", "subreddit": "Pashtun", "subreddit_id": "t5_2s9mm"}, {"author": "Hedgehog-Moist", "body": "bruh", "created_utc": "1628352483.0", "edited": "False", "id": "h82h518", "is_submitter": "False", "link_id": "t3_ozvoxp", "parent_id": "t3_ozvoxp", "score": "2", "subreddit": "Kazakhstan", "subreddit_id": "t5_2rvej"}, {"author": "Hedgehog-Moist", "body": "How can someone have the audacity to think that Canada can be more chad than the Balkans?", "created_utc": "1627811572.0", "edited": "False", "id": "h7aql82", "is_submitter": "False", "link_id": "t3_ovdjy4", "parent_id": "t3_ovdjy4", "score": "7", "subreddit": "greentext", "subreddit_id": "t5_2srr9"}, {"author": "Hedgehog-Moist", "body": "oh now I see. thanks a lot!", "created_utc": "1615456428.0", "edited": "False", "id": "gqk17f6", "is_submitter": "True", "link_id": "t3_m2et3c", "parent_id": "t1_gqjbnme", "score": "1", "subreddit": "srilanka", "subreddit_id": "t5_2qh8a"}, {"author": "Hedgehog-Moist", "body": "nothing happens, looks like the keyboard is incomplete. gboard seems fine tho. (edit: double-tapping the key at the top left renders some more characters including the L. thanks)", "created_utc": "1615456341.0", "edited": "False", "id": "gqk13r2", "is_submitter": "True", "link_id": "t3_m2et3c", "parent_id": "t1_gqixfqt", "score": "1", "subreddit": "srilanka", "subreddit_id": "t5_2qh8a"}, {"author": "Hedgehog-Moist", "body": "Hmm. Any other suggestions then?", "created_utc": "1615430124.0", "edited": "False", "id": "gqivtul", "is_submitter": "True", "link_id": "t3_m2et3c", "parent_id": "t1_gqiuzrb", "score": "1", "subreddit": "srilanka", "subreddit_id": "t5_2qh8a"}, {"author": "Hedgehog-Moist", "body": "The font I used for the second image is [Mongolian Baiti](https://fontzone.net/download/mongolian-baiti), is there any way to type the correct spelling with this?", "created_utc": "1610515209.0", "edited": "False", "id": "gj31sb9", "is_submitter": "True", "link_id": "t3_kw19ts", "parent_id": "t1_gj29gsj", "score": "1", "subreddit": "Mongolian", "subreddit_id": "t5_2yawj"}, {"author": "Hedgehog-Moist", "body": "Thanks for the detailed reply!", "created_utc": "1610512884.0", "edited": "False", "id": "gj2ya4q", "is_submitter": "True", "link_id": "t3_kw19ts", "parent_id": "t1_gj29gsj", "score": "1", "subreddit": "Mongolian", "subreddit_id": "t5_2yawj"}, {"author": "Hedgehog-Moist", "body": "what is the title of the traditional Mongolian textbook?", "created_utc": "1610135303.0", "edited": "False", "id": "gikq7gx", "is_submitter": "False", "link_id": "t3_kpqyr8", "parent_id": "t3_kpqyr8", "score": "1", "subreddit": "Mongolian", "subreddit_id": "t5_2yawj"}, {"author": "Hedgehog-Moist", "body": "Looks like there is much more than I know, thanks for the insight!", "created_utc": "1607930508.0", "edited": "False", "id": "gfshtow", "is_submitter": "True", "link_id": "t3_k7z33l", "parent_id": "t1_gey2kms", "score": "3", "subreddit": "ManchuStudies", "subreddit_id": "t5_332p9"}]