[{"author": "HiThereFellowHumans", "body": "INFP", "created_utc": "1666671637.0", "edited": "False", "id": "itomuwi", "is_submitter": "False", "link_id": "t3_ycpsij", "parent_id": "t3_ycpsij", "score": "3", "subreddit": "Enneagram5", "subreddit_id": "t5_346ek"}, {"author": "HiThereFellowHumans", "body": "I guess I'm not sure when his grandfather received his (I don't think it was before my husband was born, though), but I know his father only got it once my husband was an adult. So he then had to wait quite a while for his father's citizenship to be finalized before he could qualify.", "created_utc": "1666330447.0", "edited": "False", "id": "it65xgn", "is_submitter": "False", "link_id": "t3_y8tkmc", "parent_id": "t1_it5vp5e", "score": "1", "subreddit": "europe", "subreddit_id": "t5_2qh4j"}, {"author": "HiThereFellowHumans", "body": "Yeah, for sure Portugal. My understanding is that you can't skip a generation, though. So although it was my husband's great-grandfather that emigrated to Brazil, he was able to qualify because his grandfather and then his father applied first.", "created_utc": "1666316219.0", "edited": "False", "id": "it5efwn", "is_submitter": "False", "link_id": "t3_y8tkmc", "parent_id": "t1_it2az99", "score": "1", "subreddit": "europe", "subreddit_id": "t5_2qh4j"}, {"author": "HiThereFellowHumans", "body": "Oh, I would be *very* interested in seeing this as well!", "created_utc": "1666144449.0", "edited": "False", "id": "isvuqo4", "is_submitter": "False", "link_id": "t3_y6z79r", "parent_id": "t1_istqk1u", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "HiThereFellowHumans", "body": "Agreed, I don't think this is NLOG. It feels more like standing up to the patriarchy and what women are expected to do, not about her putting down other women.", "created_utc": "1666062142.0", "edited": "False", "id": "isrb42v", "is_submitter": "False", "link_id": "t3_y6m98z", "parent_id": "t1_isr2d5f", "score": "8", "subreddit": "notliketheothergirls", "subreddit_id": "t5_3opft"}, {"author": "HiThereFellowHumans", "body": "I write professionally and have my own business doing so", "created_utc": "1665462182.0", "edited": "False", "id": "irupa4o", "is_submitter": "False", "link_id": "t3_y0ib2s", "parent_id": "t3_y0ib2s", "score": "2", "subreddit": "Enneagram5", "subreddit_id": "t5_346ek"}, {"author": "HiThereFellowHumans", "body": "Live near Warm Springs ish and CL was AWFUL for us (as in, so bad my husband and I sometimes couldn't have video meetings at the same time).   \n\n\nWe recently switched to T-Mboile's internet. I didn't even know they had internet, but we're having way fewer issues (and their customer service is quite responsive as well).", "created_utc": "1665160917.0", "edited": "False", "id": "irf6r88", "is_submitter": "False", "link_id": "t3_xwske3", "parent_id": "t3_xwske3", "score": "1", "subreddit": "Boise", "subreddit_id": "t5_2qlk4"}, {"author": "HiThereFellowHumans", "body": "For me, about 10-15 minutes of easy yoga (especially one that involves twisting) also gets 'er done", "created_utc": "1665156706.0", "edited": "False", "id": "irexclx", "is_submitter": "False", "link_id": "t3_xxbx1b", "parent_id": "t3_xxbx1b", "score": "1", "subreddit": "XXRunning", "subreddit_id": "t5_3ft56"}, {"author": "HiThereFellowHumans", "body": "Going to second finding a private tutor that's a native speaker on Italki (or Verbling, which is basically the same thing). I've still found lots of good quality teachers on the platform.", "created_utc": "1663726636.0", "edited": "False", "id": "ipa1i3w", "is_submitter": "False", "link_id": "t3_xix4uh", "parent_id": "t1_ip6d9gh", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "HiThereFellowHumans", "body": "I use my name and have a .co \r  \n\r  \nSeemed easier to me than agonizing over a brand name (especially if I switch directions in the future), and it's working well for me. Though I'm also not interested in expanding into an agency or anything like that, which may make more sense to do under a business name", "created_utc": "1663347847.0", "edited": "False", "id": "iooscf9", "is_submitter": "False", "link_id": "t3_xftp0y", "parent_id": "t3_xftp0y", "score": "2", "subreddit": "copywriting", "subreddit_id": "t5_2qq49"}, {"author": "HiThereFellowHumans", "body": "I actually just launched a new website for myself with Squarespace, and I'm very very happy with it. It'll cost about $200/year, but I was using WordPress for years before this and I find Squarespace much easier.", "created_utc": "1662917986.0", "edited": "False", "id": "io0iciz", "is_submitter": "False", "link_id": "t3_xblw0w", "parent_id": "t3_xblw0w", "score": "2", "subreddit": "copywriting", "subreddit_id": "t5_2qq49"}, {"author": "HiThereFellowHumans", "body": "According to my Portuguese-speaking husband: \"au au\"", "created_utc": "1662757776.0", "edited": "False", "id": "inrz3b6", "is_submitter": "False", "link_id": "t3_xa1qtp", "parent_id": "t3_xa1qtp", "score": "4", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "HiThereFellowHumans", "body": "First, I would say that your concerns are valid and you deserve to be taken seriously. And yes, lots of women do have rough experiences with IUD insertion for sure. \n\nThat said, I'm not sure if it helps, but just in case you *haven't* yet come across a positive one, I want to let you know that IUD insertion isn't guaranteed to be bad. Getting my own was honestly basically painless (though the cramps afterwards were what really got me, they super sucked). But the insertion itself was so much better than I expected it to be", "created_utc": "1661914591.0", "edited": "False", "id": "imh3wr0", "is_submitter": "False", "link_id": "t3_x1jqqy", "parent_id": "t3_x1jqqy", "score": "1", "subreddit": "TwoXChromosomes", "subreddit_id": "t5_2r2jt"}, {"author": "HiThereFellowHumans", "body": "Would definitely recommend Caroline Girvan - she is amazing and has lots of great free programs to choose from!", "created_utc": "1661731287.0", "edited": "False", "id": "im6zsnx", "is_submitter": "False", "link_id": "t3_wzz0c2", "parent_id": "t1_im59jhh", "score": "3", "subreddit": "xxfitness", "subreddit_id": "t5_2ryzy"}, {"author": "HiThereFellowHumans", "body": "On its own, the age difference isn't a guaranteed red flag (for reference: I met my husband when I was 19 and he was 36, we've now been together for about 10 years and married for 8 and he's my favorite human in the entire world).   \nIs there something else that's making you feel weird about the situation? If there's something in your gut that feels off beyond strictly the age, then that's probably something to take seriously. Don't discount your instincts.", "created_utc": "1661653540.0", "edited": "False", "id": "im2x1u6", "is_submitter": "False", "link_id": "t3_wyvu48", "parent_id": "t3_wyvu48", "score": "-1", "subreddit": "TwoXChromosomes", "subreddit_id": "t5_2r2jt"}, {"author": "HiThereFellowHumans", "body": "Oh, I think you can make great progress with just an hour a day! \r  \n\r  \nI go in streaks where I do more, but now I probably average out to about 1 hour per day.   \n Normally, this will be dedicated to a 1:1 conversation-based lesson online with my teacher. \r  \n\r  \nOtherwise, if I don't have a lesson scheduled,  I'm at a high enough level in my languages that most of my additional time is spent engaging with content for natives (listening to podcasts and writing out new sentences/words that are of interest, watching videos, etc.).  \n\n\nJudging by my performance and speaking in my 1:1 lessons, I do feel like I'm making consistent progress even without a ton of time to dedicate. Though I think that's because I've found the activities that are most effective and give me, if you will, the \"biggest bang for my buck.\"", "created_utc": "1661531043.0", "edited": "False", "id": "ilvytub", "is_submitter": "False", "link_id": "t3_wy2t51", "parent_id": "t3_wy2t51", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "HiThereFellowHumans", "body": "Yeah, it was the book we used in my university's Arabic program and seems to be pretty standard for school curriculum for some reason.", "created_utc": "1661475176.0", "edited": "False", "id": "ilt5yzu", "is_submitter": "False", "link_id": "t3_wx6g41", "parent_id": "t1_ilq1uzg", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "HiThereFellowHumans", "body": "This is technically Jordanian, but there's a Youtube channel that has fun little cartoon videos in Levantine that are not too hard to understand thanks to the images. I watch them as Arabic homework and then discuss the plot/new expressions & grammatical structures that I learned with my teacher, and they are quite helpful. Plus, there are subs in Arabic and in English. \n\nIt's called حياة عيلتنا, or \"Our Family Life: https://www.youtube.com/watch?v=1aLqgsZ7GfY&list=PLsRcJmc7xsAW-872drN6qo9tKm-wtijn2&index=42", "created_utc": "1661298526.0", "edited": "False", "id": "iliyimm", "is_submitter": "False", "link_id": "t3_wvts6a", "parent_id": "t3_wvts6a", "score": "5", "subreddit": "learn_arabic", "subreddit_id": "t5_2v4vi"}, {"author": "HiThereFellowHumans", "body": "Love Catch-22, but that element can definitely be pretty off-putting. That said, my understanding is that it certainly is supposed to be satire and intentionally capture just how absurd war (and military culture) is.", "created_utc": "1659890991.0", "edited": "False", "id": "ijbvvup", "is_submitter": "False", "link_id": "t3_wg4u0p", "parent_id": "t1_iixkegk", "score": "4", "subreddit": "menwritingwomen", "subreddit_id": "t5_3ox0h"}, {"author": "HiThereFellowHumans", "body": "Definitely a tough decision, but I would generally recommend choosing the one you're most interested in (AKA Maghrebi)! That will definitely help with motivation and with enjoyment, since you already said you listen to a lot of music from this dialect (which you then have an excuse to continue doing by learning it).   \n\n\nI'm sure you're aware, but the challenge with Maghrebi as opposed to Egyptian, Levantine, etc. is that it isn't quite as adaptable as the other dialects to communicate with Arabic speakers from other regions. So I guess it comes down to what's more important to you: the ability to communicate with the widest range of Arabic speakers as possible, or personal passion/interest?   \n\n\nTo answer some of your other questions, there's tons of Arabic music not in the Egyptian dialect, and I'd imagine that most Arab artists sing in their dialect rather than switching to Egyptian. In some cases maybe they do so for a wider reach (can't speak on how common that is), but there's an abundance of music/content/media/shows/movies in any dialect you may choose. So those Algerian artists you are listening to are unlikely to be singing in the Egyptian dialect.   \n\n\nAlready knowing one dialect before learning another will definitely give you a leg up as there's lots of overlap when you dive in.   \nHave you considered the Levantine dialect as an option as well? This is the one I learned/am learning and I love love love it. It's also quite practical, which seems to be the reason you're considering Egyptian. And I've been able to use it with mixed results when I've been in Northern Africa (but through some combination of French and my Levantine Arabic, communication wasn't a big problem).   \n\n\nPS As you're someone who has studied linguistics/language learning formally, I'd love to hear some of your insights/the steps in your language learning process in general if you don't mind sharing :-)   \n\n\nPPS Just wanted to mention that I was in Tunisia recently and it was INCREDIBLE. So underrated, I wish more people thought of visiting because it's a delight.", "created_utc": "1656541707.0", "edited": "False", "id": "ie8u3xp", "is_submitter": "False", "link_id": "t3_vnksnj", "parent_id": "t3_vnksnj", "score": "2", "subreddit": "learn_arabic", "subreddit_id": "t5_2v4vi"}, {"author": "HiThereFellowHumans", "body": "Shadow Puppet Wine Bar seems like a good one to support! Yesterday they posted something on their IG saying all proceeds for that night would be donated to Planned Parenthood Idaho.", "created_utc": "1656200052.0", "edited": "False", "id": "idqu4n4", "is_submitter": "False", "link_id": "t3_vkk0mf", "parent_id": "t3_vkk0mf", "score": "12", "subreddit": "Boise", "subreddit_id": "t5_2qlk4"}, {"author": "HiThereFellowHumans", "body": "Idaho here and T-minus 30 days until they are banned, so same.", "created_utc": "1656092843.0", "edited": "False", "id": "idl4abr", "is_submitter": "False", "link_id": "t3_vjq3m8", "parent_id": "t1_idkk236", "score": "8", "subreddit": "TwoXChromosomes", "subreddit_id": "t5_2r2jt"}, {"author": "HiThereFellowHumans", "body": "I'm not from a bilingual family unfortunately, but I can speak from the perspective of some friends of mine who have trilingual (and I mean trilingual - they sound fully native in all 3 languages!) 8-year-old twins. \n\nThe family is Brazilian, so they learned/speak Portuguese at home. They go to an English school so they learned/speak English at school. But they live in Puerto Rico so speak they learned/speak Spanish with their schoolmates and friends. It's very impressive! And they introduced all 3 languages when they were very young. At first, the kids used to mix a lot, but it's a lot better now. And in the long-term, I think it'll be a huge advantage.", "created_utc": "1655998892.0", "edited": "False", "id": "idfxurc", "is_submitter": "False", "link_id": "t3_vitake", "parent_id": "t3_vitake", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "HiThereFellowHumans", "body": "Tunisia is where it's at! Has all the things that make Morocco great (coastline, history, souks, desert) but with much friendlier/less pushy people. I felt pretty safe overall, and I was alone for a part of my trip (though I do still recommend bringing your son).", "created_utc": "1655864794.0", "edited": "False", "id": "id9a218", "is_submitter": "False", "link_id": "t3_vhczge", "parent_id": "t1_id932p7", "score": "6", "subreddit": "TwoXChromosomes", "subreddit_id": "t5_2r2jt"}, {"author": "HiThereFellowHumans", "body": "Hi professor - thanks for taking the time to join us!   \n\n\nI have a few questions if you don't mind...   \n1. Maybe this has been asked before, but what is your favorite language(s) today? Which one(s) did you struggle most with to study/learn? \n\n2. I know you speak MSA, but do you speak/have you studied any other dialects of Arabic? (I study Levantine, so I had to ask!) \r  \n\r  \n3: What's your response to people who say they just \"aren't good at\" foreign languages? I honestly hear this aaall the time from people when we get on the topic of languages (I literally run a local language exchange group and I even hear it there), and I hate that this mindset discourages so many from pursuing other languages. I have my own opinion on how I'd respond, but I'd like to hear what your proper professional response would be so I can help convince them otherwise :-)   \n\n\n(PS give Merlin a few pets for me, please!)", "created_utc": "1655485054.0", "edited": "False", "id": "icqfjnn", "is_submitter": "False", "link_id": "t3_veb16o", "parent_id": "t3_veb16o", "score": "25", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "HiThereFellowHumans", "body": "Definitely Meetup.com! \n\nThere are groups for just about everything. And if you don't find one for what you're interested in, you can always create one yourself (I recently created my own group for a particular hobby of mine and have started hosting events, and it's been a great way to meet people interested in the same thing as me!).", "created_utc": "1654471681.0", "edited": "False", "id": "ibb28pb", "is_submitter": "False", "link_id": "t3_v4szy4", "parent_id": "t3_v4szy4", "score": "2", "subreddit": "Boise", "subreddit_id": "t5_2qlk4"}, {"author": "HiThereFellowHumans", "body": "I already know Spanish and Portuguese to a decent level (tested at C1), and my current focuses are French and Levantine Arabic. \n\nOnce I get my Arabic to a level I'm really happy with (since that one is kind of my passion project), I'm very interested in learning Farsi. And then maaaybe some Hindi since it's one of my best friend's mother tongues, her family doesn't speak English, and I'd love to be able to chat with them. And then I think I'll probably call it done and just keep improving my levels in the languages I already have :-)   \n\nHonestly, the more I learn, the more surprised I am by how much easier each language gets. So although I definitely understand the fear of running out brain real estate, I actually think language learning helps our brains work better and better.", "created_utc": "1654467780.0", "edited": "False", "id": "ibaun4e", "is_submitter": "False", "link_id": "t3_v5ll4p", "parent_id": "t3_v5ll4p", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "HiThereFellowHumans", "body": "This is a lovely story. Here's to many more excellent dates between the two of you! \n\nAlso, ignore those people complaining about the age gap. You sound like you've thought it through and are aware that yeah, there is the potential for risk with an age gap. \n\nBut honestly, I met my husband when I was 20 and we have a 16 year age difference...but we've now been together happily for nearly 10 years. So age gaps aren't always as important as people make them out to be.", "created_utc": "1654452240.0", "edited": "False", "id": "ib9yhc3", "is_submitter": "False", "link_id": "t3_v55ju2", "parent_id": "t3_v55ju2", "score": "1", "subreddit": "TwoXChromosomes", "subreddit_id": "t5_2r2jt"}, {"author": "HiThereFellowHumans", "body": "Good list...just one more thing to mention! If you don't happen to have a language meetup group in your city, you can always create one yourself. I recently started one in my city, and it's been a big hit!", "created_utc": "1654405885.0", "edited": "False", "id": "ib80hph", "is_submitter": "False", "link_id": "t3_v4y79c", "parent_id": "t3_v4y79c", "score": "6", "subreddit": "French", "subreddit_id": "t5_2rd5t"}, {"author": "HiThereFellowHumans", "body": "I like anything near Lucky Peak (Kepros, Shaw Mountain, Cervidae, etc) a lot! The views are lovely and I bet the flowers are blooming this time of the year. They're also not very far from Boise (well under an hour).", "created_utc": "1654226303.0", "edited": "False", "id": "iaztv19", "is_submitter": "False", "link_id": "t3_v3lhqt", "parent_id": "t3_v3lhqt", "score": "1", "subreddit": "Boise", "subreddit_id": "t5_2qlk4"}, {"author": "HiThereFellowHumans", "body": "Hey, don't be too hard on yourself!\n\nAs many others have said, 6-7 months really isn't that much time at all, especially for a language like Korean. Language learning takes time, and it can be a while until you really start to see the \"fruits of your effort\" (which is one reason why I think people tend to give up so often on language learning).\n\nFor example, I studied Arabic on and off for YEARS before one day something \"clicked\" and I was able to have proper conversations. But I'm so so so glad I've stuck with it even during the times when I wanted nothing to do with it. It still tires me out and frustrates me sometimes, of course...but 5+ years later, it's developed into a true labor of love. \n\nI will also add that the additional pressure of speaking to a partner's family (who you presumably want to impress) can make it worse. I've been with a Brazilian for nearly 10 years and my Portuguese is very advanced when I'm speaking with him and basically anyone else, but even today I sometimes \"clam up\" when I have to interact with some of his more intimidating family members.\n\nAnd one final thing: I'm not sure what you've been doing while studying, but listening and speaking are skillsets that need to be practiced on their own. I know people who can, for example, read and write really well in another language but can't really speak because it's not something they practice. So I'd highly recommend getting a private tutor from Italki or Verbling to get that real-world speaking practice in...it makes a huge difference!", "created_utc": "1654188734.0", "edited": "False", "id": "iaxj1r2", "is_submitter": "False", "link_id": "t3_v374tv", "parent_id": "t3_v374tv", "score": "5", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "HiThereFellowHumans", "body": "This is the right recommendation. \n\nI spent years learning BP (married to a Brazilian) only to then have to take a big language test in EP which broke my brain. But spending a LOT of time listening to EP made a big difference and is really the best thing you can do.", "created_utc": "1652391642.0", "edited": "False", "id": "i8dfi1x", "is_submitter": "False", "link_id": "t3_uo47vr", "parent_id": "t1_i8c9g8z", "score": "3", "subreddit": "Portuguese", "subreddit_id": "t5_2sqn7"}, {"author": "HiThereFellowHumans", "body": "Will second CopyHackers and Copy Schoool here!", "created_utc": "1650826979.0", "edited": "False", "id": "i619amp", "is_submitter": "False", "link_id": "t3_uavffd", "parent_id": "t1_i609uso", "score": "5", "subreddit": "copywriting", "subreddit_id": "t5_2qq49"}, {"author": "HiThereFellowHumans", "body": "Most of my \"study\" time is spent speaking or listening either with 1:1 lessons from Italki/Verbling, the language exchange group that I'm a part of, and looots of foreign-language podcasts.   \n\n\nI honestly don't do much structured study these days, but I have a pretty solid base in all of my languages already so the speaking/listening approach works for me and I see marked improvements with whatever language I'm focusing on at the moment.   \n\n\nIf I were to start another language from closer to the beginning, I would probably incorporate some more typical \"language learning\" tools or programs.  I used to do a lot of Anki (which I think helped majorly at the beginning), but now I'm at a level where I'm able to internalize a lot of new words via repetition (ex. them coming up multiple times in something I'm listening to, in conversations, etc.). I also think this way is more fun.", "created_utc": "1650647811.0", "edited": "False", "id": "i5ru083", "is_submitter": "False", "link_id": "t3_u93zkn", "parent_id": "t3_u93zkn", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "HiThereFellowHumans", "body": "Have you tried any of the podcasts made for French learners? I really like InnerFrench, for example. They are quite a bit easier to understand than, say, Netflix (which I struggle with even though my comprehension is overall quite good)", "created_utc": "1650647267.0", "edited": "False", "id": "i5rslx8", "is_submitter": "False", "link_id": "t3_u9fs84", "parent_id": "t1_i5r5qva", "score": "5", "subreddit": "French", "subreddit_id": "t5_2rd5t"}, {"author": "HiThereFellowHumans", "body": "It has certainly happened to me (I find that native speakers of some languages are worse than others when it comes to this).   \n\n\nDepending on my mood I ignore it. Or if capable in that language, I say something like \"oh sorry, this is my third/fourth language\" since, in my experience, those who criticize are often those who don't speak another language. Or if I'm feeling sassy and want to make them slightly uncomfortable, I go a bit harder \"oh, so sorry would you prefer language X (in language X), language Y (in language Y), or language Z (in language Z)?\"   \n\n\nThough sometimes they do, in fact, know language X or Y or Z so my attempt at light shame doesn't work.", "created_utc": "1649349561.0", "edited": "False", "id": "i3s4z03", "is_submitter": "False", "link_id": "t3_txvyen", "parent_id": "t3_txvyen", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "HiThereFellowHumans", "body": "Huh, this is so surprising to me! My husband is from SP so I've been in Brazil once a year for the last 7 years or so  \n\n\nOut of all the languages I speak, I'd say that native Portuguese speakers have been the most encouraging (and the most excited to hear a \"gringa\" speaking it). It's one of the reasons that Portuguese is my favorite language to speak. And unlike other languages I speak, I think it's the only one that I've never had a negative experience speaking in as a foreigner.", "created_utc": "1649349048.0", "edited": "False", "id": "i3s3mwz", "is_submitter": "False", "link_id": "t3_txvyen", "parent_id": "t1_i3rljmd", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "HiThereFellowHumans", "body": "Unfortunately, Paris is a bit famous for this. I will say that, at least in my experience, people outside the major cities are *far* more patient and very supportive of any attempts to speak the language (I was recently in some small towns in French alps, for example, and I remember the people in Lille being great). So you may want to include some of those smaller cities in your itinerary :-)   \n\n\nI lived in Brussels for a while, and my experience in Belgium was that, overall, people are quite kind about it as well. Though Brussels itself is so international that French isn't always needed.", "created_utc": "1649348626.0", "edited": "False", "id": "i3s2ire", "is_submitter": "False", "link_id": "t3_txvyen", "parent_id": "t1_i3pi0wh", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "HiThereFellowHumans", "body": "I've always done them online, normally via Verbling or Italki. For Arabic, I use a cool organization called \"Natakallam\" who hires refugees...and I think they've expanded beyond Arabic at this point and have a few different languages now.   \n\n\nMy schedule changes a lot and I don't really have a consistent time/weekday that I take lessons on, so it's helpful (and saves me time) to do online because I can just choose from the platform's calendar. Though I do also try to get some in-person language practice in whenever I can via a weekly in-person language exchange group that I just set up in my city.", "created_utc": "1649348184.0", "edited": "False", "id": "i3s1e2a", "is_submitter": "False", "link_id": "t3_tyb60q", "parent_id": "t1_i3rwgbq", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "HiThereFellowHumans", "body": "Do it!!! \n\nI've been taking private lessons in a handful of languages for probably 5 years or so without any major goal. But I love them and see still good progress (if you're able to take them, I very much believe private lessons are the most effective way to learn a language) and have made great friends with some of my teachers with plans to visit them in person soon. Plus peaking in another language is also just plain good for the brain. 110% recommend.\n\nEdit: a missed word", "created_utc": "1649345318.0", "edited": "1649370978.0", "id": "i3ruc0s", "is_submitter": "False", "link_id": "t3_tyb60q", "parent_id": "t3_tyb60q", "score": "6", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "HiThereFellowHumans", "body": "Commercial Northwest is the property management company who we rent from and they are (surprisingly) decent. Been here a year and no complaints. Could just be for our exact apartment complex though....", "created_utc": "1647359418.0", "edited": "False", "id": "i0rg7v3", "is_submitter": "False", "link_id": "t3_tdgh6r", "parent_id": "t3_tdgh6r", "score": "1", "subreddit": "Boise", "subreddit_id": "t5_2qlk4"}, {"author": "HiThereFellowHumans", "body": "This is totally true! Perhaps not within my immediate family, but my husband and I are both fluent in each other's native languages so we switch between them a lot and blend words together from the languages that don't actually exist in either.  Occasionally it's a problem because I don't realize that the word doesn't actually exist in his language and I try it out with his family or something, but for the most part it's fun haha", "created_utc": "1647096432.0", "edited": "False", "id": "i0dfvyv", "is_submitter": "False", "link_id": "t3_tc4z4q", "parent_id": "t3_tc4z4q", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "HiThereFellowHumans", "body": "Serious question here...what is it that you want Biden to do? \n\nI don't love Biden myself, but I keep hearing people he say he won't do anything. But at least in my mind, he doesn't exactly have a ton of options here, does he?   \n\n\nAmericans don't want to be involved in another war, so sending soldiers doesn't really feel like an option (not to mention, this would mean all-out war against Russia). And there's a limit to what can be done with sanctions. There are still a few \"last resort\" actions we can take from a sanctions standpoint (like cutting Russia off from the SWIFT system), but at some point we've done it all. And it doesn't make sense to go through with these \"last resort\" options quite yet because then we've lost all our leverage. Or am I missing an option here?", "created_utc": "1645679516.0", "edited": "False", "id": "hy7ad3f", "is_submitter": "False", "link_id": "t3_t009rq", "parent_id": "t1_hy76p9z", "score": "1", "subreddit": "Conservative", "subreddit_id": "t5_2qh6p"}, {"author": "HiThereFellowHumans", "body": "Oh, there was for sure weird stuff going on there that we won't ever know - won't argue against that!", "created_utc": "1645679018.0", "edited": "False", "id": "hy79d48", "is_submitter": "False", "link_id": "t3_szzy5e", "parent_id": "t1_hy78v1e", "score": "1", "subreddit": "ukraine", "subreddit_id": "t5_2qqcn"}, {"author": "HiThereFellowHumans", "body": "As much as I love blaming Trump for things (and he often deserves the blame), for once this isn't his fault. Putin is Putin, and he's the asshole to blame. Not a U.S. president.   \n\n\nAnd unless we had a president who Putin *knew* would send troops to Ukraine as a response (which there wouldn't be b/c none want to take that risk of retaliation), this was always going to happen.", "created_utc": "1645678619.0", "edited": "False", "id": "hy78jxf", "is_submitter": "False", "link_id": "t3_szzy5e", "parent_id": "t1_hy75qu6", "score": "6", "subreddit": "ukraine", "subreddit_id": "t5_2qqcn"}, {"author": "HiThereFellowHumans", "body": "NATO is a military alliance that includes much of Europe and the U.S and was actually first created to \"counterweight\" the Soviet armies after WWII.   \n\n\nWhen you join NATO, it's essentially a pledge that you will protect other members militarily if needed, and that they will protect you. So if Russia were to invade, say, Bulgaria...the U.S. and other NATO members would get involved militarily to prevent that. There are also some NATO missions around the world (Kosovo, Somalia, Afghanistan, etc.) made up from soldiers from all the countries that are part of NATO.    \n\n\nSo if Ukraine were to join NATO, they would be \"protected\" by other members when needed (such as the case of this current invasion). But if they joined this also means that there would then be NATO troops (including American) stationed in Ukraine, which Russia feels uncomfortable with as it's right next door and argues that this is a threat.", "created_utc": "1645678248.0", "edited": "False", "id": "hy77t1l", "is_submitter": "False", "link_id": "t3_t009zk", "parent_id": "t1_hy75nay", "score": "6", "subreddit": "ukraine", "subreddit_id": "t5_2qqcn"}, {"author": "HiThereFellowHumans", "body": "Unfortunately, you're right. I don't think any help from anywhere is coming to Ukraine...", "created_utc": "1645677083.0", "edited": "False", "id": "hy75ff6", "is_submitter": "False", "link_id": "t3_sztt5t", "parent_id": "t1_hy6t1hh", "score": "17", "subreddit": "TrueOffMyChest", "subreddit_id": "t5_2yuqy"}, {"author": "HiThereFellowHumans", "body": "I'm an ESL instructor who usually teaches classes where the students don't share a first language (ex. a class of 15 will have 9 different languages among them)...so 100% of my classes have to be run in the target language. And when I was taking French classes in Belgium, 100% of the class was in French as well since students were from all over the world and we didn't have another universal language to fall back on.   \n\n\nAnd in cases like these, obviously this \"target language from day 1\" approach makes sense. So I wonder if that's where the trend came from overall?   \n\n\nThough it's silly because in something like a university language class there IS normally another shared language everyone can (and should) use to speed up/clarify some of the early learning.", "created_utc": "1645151912.0", "edited": "False", "id": "hxe9lfz", "is_submitter": "False", "link_id": "t3_suydb2", "parent_id": "t1_hxdzzok", "score": "37", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "HiThereFellowHumans", "body": "You use \"ma\" after a few particular words (often time related but not anyways) when they are followed by a verb. For example, anytime you use \"qbl\" or \"b3d\" followed by a verb, you need \"ma.\" So you don't need it because of the كبرت you used in your example, but because of the بعد.   \n\n\nThere may be a rule on when to use it, but I just try to memorize the words/expressions that need it when followed by verbs. Such as:   \n\n\nبعد ما + verb    \nقبل مل + verb  \nطول ما (\"as long as\")  ... this one may not need a verb afterwards, I'm not sure    \nكل ما (\"everytime I do\") + verb \n\nبدون ما/ بلا ما (\"without\") + ing verb", "created_utc": "1643746671.0", "edited": "False", "id": "hv6g4v6", "is_submitter": "False", "link_id": "t3_shpku8", "parent_id": "t1_hv5qiiw", "score": "4", "subreddit": "learn_arabic", "subreddit_id": "t5_2v4vi"}, {"author": "HiThereFellowHumans", "body": "INFP !", "created_utc": "1643646487.0", "edited": "False", "id": "hv0df3l", "is_submitter": "False", "link_id": "t3_sgyqj1", "parent_id": "t3_sgyqj1", "score": "15", "subreddit": "Enneagram5", "subreddit_id": "t5_346ek"}, {"author": "HiThereFellowHumans", "body": "Honestly though. Even in my native language I sometimes find it quite hard to express myself since I just generally don't like speaking up in front of others. And if I'm under pressure, I'll stumble over my words or explain things in totally roundabout ways...", "created_utc": "1641750581.0", "edited": "False", "id": "hrxv0vg", "is_submitter": "False", "link_id": "t3_rzsjo1", "parent_id": "t1_hrxmh8u", "score": "14", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "HiThereFellowHumans", "body": "I was once in Tibet and got invited to a sky burial. Once I could set aside some of my western \"discomforts\" with death, it was really a really beautiful thing to witness. \n\nObviously this is just a single experience from one outsider (and the best scenario would be to actually hear from said family members), but I didn't witness any sadness or tears or that heaviness I've seen in funerals back home. It was only men from the family (as well as male friends). But if there was anything I picked up on, it was a sense of camaraderie and a \"get it done\" attitude. \n\nThe whole thing was outdoors and afterwards they sat around a bonfire and drank tea (although we were respectfully keeping out distance, they invited us to share in their tea which was very kind). Unfortunately I don't know what they were talking about exactly, but the atmosphere felt very light and there was lots of laughing exchanged.", "created_utc": "1641749219.0", "edited": "False", "id": "hrxrc3q", "is_submitter": "False", "link_id": "t3_rzrw23", "parent_id": "t1_hrwwn3t", "score": "1", "subreddit": "WitchesVsPatriarchy", "subreddit_id": "t5_p3r73"}, {"author": "HiThereFellowHumans", "body": "If you are claiming to be learning 3+ languages from a low level (ex A1, A2), then I certainly agree with what you're saying here. But if you're already an intermediate ish level in a language (or strong enough that you're \"learning\" is less about going through grammar books and more about engaging with native material - reading articles, watching series, chatting with an online tutor, etc.) - then it's certainly possible. \n\nFor example, I am a decent to strong level in multiple languages and so my \"studying\" in these languages looks very different than it did when I was learning from a lower level. Because of this, I can engage with/actively work on/focus on 3 or so languages more or less at once.", "created_utc": "1641428969.0", "edited": "False", "id": "hrffy1w", "is_submitter": "False", "link_id": "t3_rwwjzx", "parent_id": "t3_rwwjzx", "score": "4", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "HiThereFellowHumans", "body": "Heard my 25-year-old unvaxxed brother tested positive for covid a few days ago. Just found out that he's already had to go to the hospital *twice* because he couldn't breathe (one time was so bad had to call an ambulance). And they found something on his lungs (likely covid related) that he has to go back to the doctor for in a few days.  \n\n\nThe fact that my brother who I love with my whole heart would likely have died in his mid-20s if he didn't have hospital care because of something that he could have prevented makes me want to scream. And punch something.", "created_utc": "1641011444.0", "edited": "False", "id": "hqrrp5o", "is_submitter": "False", "link_id": "t3_rslxsl", "parent_id": "t3_rslxsl", "score": "3", "subreddit": "HermanCainAward", "subreddit_id": "t5_35e6ns"}, {"author": "HiThereFellowHumans", "body": "It was a little scary at the time since there weren't many people around (though thankfully I knew I would be a lot faster than the guy if need be....which is a great reason to run in itself). But it is quite funny to think on today! \n\n(Also thanks for the reward - it's my first one and I feel like a real live redditor now)", "created_utc": "1640882647.0", "edited": "False", "id": "hqkb5fh", "is_submitter": "False", "link_id": "t3_rrbnps", "parent_id": "t1_hqg0dqd", "score": "2", "subreddit": "running", "subreddit_id": "t5_2qlit"}, {"author": "HiThereFellowHumans", "body": "Also in Pristina, Kosovo...as a young female runner in a place without a lot of young female runners, an old dude in the park I was doing loops through seemed to think I was a prostitute for hire who whistled at me on loop 1, waved what I believe what was money on loop 2, and completely opened up his pants and took the dong out on loop 3 (needless to say, there wasn't a loop 4)", "created_utc": "1640802423.0", "edited": "False", "id": "hqfu9tp", "is_submitter": "False", "link_id": "t3_rrbnps", "parent_id": "t1_hqfd0kv", "score": "29", "subreddit": "running", "subreddit_id": "t5_2qlit"}, {"author": "HiThereFellowHumans", "body": "To be fully honest, these are kind of the same reasons I stumbled into copywriting years ago. I also studied English, was good at writing/research, just generally liked learning new things, and wanted to work remotely. (If it helps, I'm an INFP ... so quite similar to you!) \n\nThat said, I don't think these features inherently mean someone is suited to copywriting. Writing copy is, after all, verrrryyy different from anything I ever wrote with my English degree. But I do think my background gave me an appreciation of words and language that ultimately helped me adapt to writing copy well. \n\nI think what's probably more important is that you have a ton of empathy (so you can \"get inside\" the heads of the audience you're writing to) and can deal with the more solitary aspects of the career (especially if you work for yourself). \n\nI know it can be pretty overwhelming to get started, so feel free to send me a DM if you have any Qs I can answer for you :-)", "created_utc": "1640546009.0", "edited": "False", "id": "hq20zj3", "is_submitter": "False", "link_id": "t3_rp182e", "parent_id": "t3_rp182e", "score": "13", "subreddit": "copywriting", "subreddit_id": "t5_2qq49"}, {"author": "HiThereFellowHumans", "body": "Oh, this is a really good tip...thanks!", "created_utc": "1639766260.0", "edited": "False", "id": "hoy8gmt", "is_submitter": "False", "link_id": "t3_rfgccd", "parent_id": "t1_hov6q05", "score": "2", "subreddit": "Boise", "subreddit_id": "t5_2qlk4"}, {"author": "HiThereFellowHumans", "body": "Neither of us are from Sweden, but my husband is an EU citizen as well. And we had already been living in Sweden for a while so we were both enrolled in the public healthcare system. Sorry, not sure how it works if you're not technically a resident of Sweden though :-/", "created_utc": "1639672532.0", "edited": "False", "id": "hosq96l", "is_submitter": "False", "link_id": "t3_rh8joe", "parent_id": "t1_horej66", "score": "2", "subreddit": "childfree", "subreddit_id": "t5_2qtwb"}, {"author": "HiThereFellowHumans", "body": "Yeah, this is definitely why I don't work at an agency. I don't think I could be a copywriter if I wasn't able to choose my own clients! There's just too many slimeballs out there that I have zero interest in helping make more money", "created_utc": "1639672304.0", "edited": "False", "id": "hospoco", "is_submitter": "False", "link_id": "t3_rhmtuv", "parent_id": "t1_horia7k", "score": "6", "subreddit": "copywriting", "subreddit_id": "t5_2qq49"}, {"author": "HiThereFellowHumans", "body": "Huh, I haven't done any of his uncovered courses, but I have his short stories and have done a few of his 30-day challenges for French (both of which I thought were good and useful). \n\nIt could be as you say though...a good guy overall (I like his YT and blog), but got involved in too many projects.", "created_utc": "1639672217.0", "edited": "False", "id": "hospgb2", "is_submitter": "False", "link_id": "t3_rhjxqd", "parent_id": "t3_rhjxqd", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "HiThereFellowHumans", "body": "Yeah Sweden! I lived there for two years, and my husband got his vasectomy there and paid a grand total of about $35 for the entire operation. With absolutely zero pressure from  to doctor towards either of us about being fairly young and childless and making this permanent.  \n\n\nI'm so thankful we were able to get it there when I read all the horror stories other people post here...", "created_utc": "1639621741.0", "edited": "False", "id": "hoq96za", "is_submitter": "False", "link_id": "t3_rh8joe", "parent_id": "t3_rh8joe", "score": "5", "subreddit": "childfree", "subreddit_id": "t5_2qtwb"}, {"author": "HiThereFellowHumans", "body": "Anyone have any recommendations for where I could store some off-season tires (apartment is way too small to fit them)? Are there any options besides just storage units?", "created_utc": "1639620919.0", "edited": "False", "id": "hoq7b1a", "is_submitter": "False", "link_id": "t3_rfgccd", "parent_id": "t3_rfgccd", "score": "2", "subreddit": "Boise", "subreddit_id": "t5_2qlk4"}, {"author": "HiThereFellowHumans", "body": "Cloud Atlas is amazing!!! I also really liked the series Sense8 that the Wachowskis made (has somewhat of the feel of Cloud Atlas). Was very sad when it was cancelled.", "created_utc": "1638900315.0", "edited": "False", "id": "hnmaq0z", "is_submitter": "False", "link_id": "t3_rarbar", "parent_id": "t1_hnlo05s", "score": "2", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "HiThereFellowHumans", "body": "Honestly, I'm glad you mentioned this...it's a good reminder that we're not \"in the clear\" even if we're vaccinated. \n\nHope you feel better soon!", "created_utc": "1637451983.0", "edited": "False", "id": "hlg2jil", "is_submitter": "False", "link_id": "t3_qy6h7y", "parent_id": "t1_hleuexa", "score": "3", "subreddit": "childfree", "subreddit_id": "t5_2qtwb"}, {"author": "HiThereFellowHumans", "body": "Huh, interesting! I was always under the impression that it was better to rest those muscles after working them (ex. taking a rest day after training them, not using them everyday). But it sounds like you found that not to be true?", "created_utc": "1636828335.0", "edited": "False", "id": "hkhgted", "is_submitter": "False", "link_id": "t3_qspvex", "parent_id": "t1_hkh6smt", "score": "3", "subreddit": "xxfitness", "subreddit_id": "t5_2ryzy"}, {"author": "HiThereFellowHumans", "body": "And what'd you tell them? (Looking for the secret myself here :-)", "created_utc": "1636805483.0", "edited": "False", "id": "hkg6vit", "is_submitter": "False", "link_id": "t3_qspvex", "parent_id": "t1_hkep69h", "score": "10", "subreddit": "xxfitness", "subreddit_id": "t5_2ryzy"}, {"author": "HiThereFellowHumans", "body": "Generally, I think most of these companies suck and I'm surprised if stories like yours are the norm. \n\nThough if it helps anyone else out there, so far we've actually had pretty good experiences with Commercial Northwest as our property manager.", "created_utc": "1635108903.0", "edited": "False", "id": "hhwp650", "is_submitter": "False", "link_id": "t3_qezzlt", "parent_id": "t3_qezzlt", "score": "5", "subreddit": "Boise", "subreddit_id": "t5_2qlk4"}, {"author": "HiThereFellowHumans", "body": "I mean, I love languages and learn them for fun...but I'm also doing it 110% to converse and embrace those human connections. It sounds cheesy, but being able to converse in other languages has opened up so many doors and allowed me to meet so many wonderful people I wouldn't have been able to otherwise. \n\nAdmittedly, I do have lots of opportunities to use all the languages I learn. For example, I only speak in Portuguese with my in-laws and my husband's entire family, I spend a lot of time in Spain/have friends there so Spanish is useful, I was living in Brussels so French came into play, I run into Arabic speakers all over the world, etc.\n\nAll that said...you do you!", "created_utc": "1634473226.0", "edited": "False", "id": "hgz631b", "is_submitter": "False", "link_id": "t3_q9jff3", "parent_id": "t3_q9jff3", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "HiThereFellowHumans", "body": "I believe nmom means \"narcissist mom\" and nparents are \"narcissist parents.\" So basically parents that only think of themselves.", "created_utc": "1633360307.0", "edited": "False", "id": "hfcx2j0", "is_submitter": "False", "link_id": "t3_q11i8v", "parent_id": "t1_hfcwmaq", "score": "31", "subreddit": "childfree", "subreddit_id": "t5_2qtwb"}, {"author": "HiThereFellowHumans", "body": "Hahaha this is totally fair. I also think game-changer is way too overused and it's one of those phrases that I make a point not to use when I'm actually writing copy. \n\nBut when I was thinking of how to describe Airstory conversationally here (since I really really love it), that word happened to be what came to mind :-)", "created_utc": "1632013849.0", "edited": "False", "id": "hdeliux", "is_submitter": "False", "link_id": "t3_pql53i", "parent_id": "t1_hde64oo", "score": "5", "subreddit": "copywriting", "subreddit_id": "t5_2qq49"}, {"author": "HiThereFellowHumans", "body": "Airstory has been a serious game-changer when it comes to research for me. I can put any relevant \"chunks\" of research into cards which I can then tag and then drag-and-drop as I'm writing. It keeps me organized and also helps me write faster.", "created_utc": "1631977499.0", "edited": "1632013751.0", "id": "hdc7eaq", "is_submitter": "False", "link_id": "t3_pql53i", "parent_id": "t3_pql53i", "score": "3", "subreddit": "copywriting", "subreddit_id": "t5_2qq49"}, {"author": "HiThereFellowHumans", "body": "**Spanish:** It was the first foreign language I began learning (in school + having the chance to travel to a few Spanish-speaking countries), and I basically just fell in love with everything about it and couldn't imagine not continuing and making it a part of my life \n\n**Portuguese:** Husband is from Brazil and much of his family only speaks Portuguese and we are there every single year, so it just kind of made sense :-) \n\n**Arabic:** It's a bit of a passion project of mine though it causes me so many more headaches than any romance language I've learned. I have a personal interest in the Middle East and think it's a beautiful language and just generally love the challenge & satisfaction of being able to communicate in something totally different from what I already know. \n\n**French:** It was a logical progression and not so so hard to learn when I already had a base of two romance languages. And after so long studying Arabic, it was actually quite the confidence booster because I was able to learn it quite fast. I had always wanted to learn French as well, and then I moved to Belgium so that was my chance", "created_utc": "1631892905.0", "edited": "False", "id": "hd7vft4", "is_submitter": "False", "link_id": "t3_ppzt1i", "parent_id": "t3_ppzt1i", "score": "16", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "HiThereFellowHumans", "body": "Sure, it's an administration problem. \n\nBut that doesn't change the fact that we are currently at capacity when we don't need to be (or normally wouldn't be) because people are unvaccinated.", "created_utc": "1631844657.0", "edited": "False", "id": "hd5pd24", "is_submitter": "False", "link_id": "t3_ppevlb", "parent_id": "t1_hd4vm56", "score": "5", "subreddit": "Boise", "subreddit_id": "t5_2qlk4"}, {"author": "HiThereFellowHumans", "body": "These are the two major reasons that I, a vaccinated person, care:   \n\n\n\\#1: if you're unvaccinated, you're much more likely to pick up the virus and continue spreading to others which increases the chances of mutation and more fun variants like delta (or one that's worse). Which could mean at some point we have a variant that the vaccines don't protect against.   \n\n\n\\#2: The overwhelming majority of covid patients in the hospital right now aren't vaccinated (most stats I've seen from various hospitals/sources puts this around 95% of current hospitalizations). The situation is so bad in my particular state and others that we have a grand total of 4 staffed ICU beds left in the state, and they are bringing in the National Guard, letting medical students graduate early, and trying to bringing doctors/nurses out of retirement to care for patients.   \n\n\nWhy do I care about this as someone who is vaccinated? For one, I care about those poor overworked medical workers who are stuck in this fully preventable situation.    \n\n\nBut I also care from selfish standpoint in realizing that there may not be a bed for me if, god forbid, something happened like a car accident and I needed it. It's enough that I have to seriously consider the activities I take part in. For example, is it worth the risk to mountain bike or perhaps ski this winter if I know that I may not have access to quick medical care if I really wiped out (and I've definitely had bad wipeouts in the past)?   \n\n\nIf these people in the hospitals got vaccinated, the situation wouldn't have to look like this.", "created_utc": "1631755241.0", "edited": "False", "id": "hd0wkiv", "is_submitter": "False", "link_id": "t3_poxfsp", "parent_id": "t1_hd0rp7q", "score": "11", "subreddit": "PoliticalHumor", "subreddit_id": "t5_2qm21"}, {"author": "HiThereFellowHumans", "body": "My teacher isn't currently taking on new students unfortunately, but you can find lots of great ones on either of those two websites (you can even filter to search for teachers from Palestine specifically if that's what you're looking for)", "created_utc": "1631719716.0", "edited": "False", "id": "hcyla6z", "is_submitter": "False", "link_id": "t3_p9uud5", "parent_id": "t1_hcxiytb", "score": "1", "subreddit": "learn_arabic", "subreddit_id": "t5_2v4vi"}, {"author": "HiThereFellowHumans", "body": "Oiii eu estou casada com um brasileiro e já visitei o Brasil um monte de vezes então eu diria sim! Por exemplo, meu marido é paulista mas posso dizer na hora se alguem é carioca. Eu posso entender esses dois sotaques muito bem...mas estive recentemente no Ceará e foi bem mais difícil. Os sotaques do interior tbm podem ser dificeis para mim.\n\nE nem me fale sobre o sotaque do Portugal....", "created_utc": "1631548231.0", "edited": "False", "id": "hcpc05q", "is_submitter": "False", "link_id": "t3_pmyya3", "parent_id": "t1_hcmjh2m", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "HiThereFellowHumans", "body": "Honestly, I think it's super weird as well. \n\nYou'd never this obsession with a single politician in, say, Europe and most other places in the world (though admittedly, they have way more parties and politicians to choose from overall...so screw the 2-party system). But where I DO see this type of \"worship\" elsewhere is places that have dictators who've developed a 'cult of personality' around themselves.", "created_utc": "1631383412.0", "edited": "False", "id": "hcglu9b", "is_submitter": "False", "link_id": "t3_pm21gp", "parent_id": "t1_hcgkm6s", "score": "17", "subreddit": "Boise", "subreddit_id": "t5_2qlk4"}, {"author": "HiThereFellowHumans", "body": "It's totally up to you. I've started providing wireframes lately because I think they are fun and it's something a little extra I can offer as I have high rates. It's not usually an expectation, though.", "created_utc": "1631239709.0", "edited": "False", "id": "hc9eiex", "is_submitter": "False", "link_id": "t3_plamhu", "parent_id": "t3_plamhu", "score": "2", "subreddit": "copywriting", "subreddit_id": "t5_2qq49"}, {"author": "HiThereFellowHumans", "body": "I think I saw somewhere that they're going to be \"launching\" the balloons at like 7:20 AM ... but I'm not really sure how long they are in the sky after that or how it all works exactly.", "created_utc": "1630792073.0", "edited": "False", "id": "hbm7ya2", "is_submitter": "False", "link_id": "t3_phtbgi", "parent_id": "t1_hblu2hg", "score": "2", "subreddit": "Boise", "subreddit_id": "t5_2qlk4"}, {"author": "HiThereFellowHumans", "body": "Aww I don't think Boise is quite that bad (at least not yet). Housing is no longer cheap unfortunately but at least there are trees + green spaces + lakes/rivers + outdoor stuffs to do.", "created_utc": "1630776672.0", "edited": "False", "id": "hbla3bw", "is_submitter": "False", "link_id": "t3_phrjpv", "parent_id": "t1_hbkq93o", "score": "4", "subreddit": "LifeProTips", "subreddit_id": "t5_2s5oq"}, {"author": "HiThereFellowHumans", "body": "Instead of Paypal, you can offer to send the client an invoice for them to pay whoever they like (I used waveapps.com in the past to send invoices and it worked great). As a bonus, this also makes you look more professional and legit. I'd just recommend requesting the payment upfront.", "created_utc": "1630599485.0", "edited": "False", "id": "hbbyvwt", "is_submitter": "False", "link_id": "t3_pgj74z", "parent_id": "t3_pgj74z", "score": "3", "subreddit": "copywriting", "subreddit_id": "t5_2qq49"}, {"author": "HiThereFellowHumans", "body": "As far as I know, online applications for the ESTA are still open and being processed. You just might not be able to actually get into the US without the 14 days spent somewhere else even with your ESTA.", "created_utc": "1630336614.0", "edited": "False", "id": "haxrolv", "is_submitter": "False", "link_id": "t3_pej7vk", "parent_id": "t1_haxmdsk", "score": "4", "subreddit": "USTravelBan", "subreddit_id": "t5_2rq35e"}, {"author": "HiThereFellowHumans", "body": "Oi, tudo bem? Eu não sei se você pode \"quarantine\" em Paraguai, mas tenho familia que fez isso no Caribe (e Mexico) e podia entrar nos Estados Unidos sem problemas.", "created_utc": "1630336434.0", "edited": "False", "id": "haxr9e9", "is_submitter": "False", "link_id": "t3_pej7vk", "parent_id": "t3_pej7vk", "score": "2", "subreddit": "USTravelBan", "subreddit_id": "t5_2rq35e"}, {"author": "HiThereFellowHumans", "body": "Italki or Verbling for private teachers has been the way to go for me", "created_utc": "1629728736.0", "edited": "False", "id": "ha1amcu", "is_submitter": "False", "link_id": "t3_p9uud5", "parent_id": "t3_p9uud5", "score": "3", "subreddit": "learn_arabic", "subreddit_id": "t5_2v4vi"}, {"author": "HiThereFellowHumans", "body": "I get where you're going with this, but I don't inherently agree with this.   \n\n\nI think the point is that she doesn't relate to your average 40-year-old because most of them have very different priorities (AKA kid-focused lifestyles).   \n\n\nGiven that she leads a fairly different lifestyle from your \"average\" 40-year-old, this makes sense.  I'm not yet 40, but even still I find I'm having a hard time relating to many individuals my own age as they've begun having kids, focusing on the white-picket-fence dream, seeking out stability, etc.", "created_utc": "1628532090.0", "edited": "False", "id": "h8b9bhh", "is_submitter": "False", "link_id": "t3_p0x6s5", "parent_id": "t1_h8avruv", "score": "7", "subreddit": "childfree", "subreddit_id": "t5_2qtwb"}, {"author": "HiThereFellowHumans", "body": "Haha I think our situation is quite similar in that my husband also easily looks (and acts!) a decade younger than his age.  \n\n\nBecause of this, we don't look like a strange couple in public at all in the slightest. The issues were primarily with friends/family of mine *before* they met him (which is a natural reaction as they had my best interests at heart, to be honest). But once they met him, they quickly realized it wasn't an issue.", "created_utc": "1628525663.0", "edited": "False", "id": "h8au2ne", "is_submitter": "False", "link_id": "t3_p0x6s5", "parent_id": "t1_h8ahbt7", "score": "2", "subreddit": "childfree", "subreddit_id": "t5_2qtwb"}, {"author": "HiThereFellowHumans", "body": "Are you eating enough after your runs (both immediately after as well as throughout your day) to refuel, by any chance?   \n\n\nIf I'm not really careful with my refueling, I crash.", "created_utc": "1628525286.0", "edited": "False", "id": "h8at7as", "is_submitter": "False", "link_id": "t3_p1198n", "parent_id": "t3_p1198n", "score": "5", "subreddit": "running", "subreddit_id": "t5_2qlit"}, {"author": "HiThereFellowHumans", "body": "Just curious...why do you assume a power imbalance will probably arise in the relationship?   \n\n\nObviously, there's plenty of relationships with large age differences that are wildly unhealthy, but I think it's a little unfair to assume this is the default.   \n\n\nMy husband (44 M) and I (28 F), for example, have a 16-year age difference. And while we have had small issues arise because of the age difference (though honestly, most of these issues were related to the reactions of other people and nothing to do with us), a power imbalance has never been something we've encountered at all.", "created_utc": "1628518585.0", "edited": "False", "id": "h8ae46g", "is_submitter": "False", "link_id": "t3_p0x6s5", "parent_id": "t1_h8a3bqf", "score": "6", "subreddit": "childfree", "subreddit_id": "t5_2qtwb"}, {"author": "HiThereFellowHumans", "body": "For one, it's a huge bundle with a bunch of different courses in it. There's one focused on website copy, one on email campaigns, one on landing pages, one on sales pages, one of Facebook pages, etc.   \n\n\nEach course is incredibly detailed and really walks you through the entire process of writing conversion copy from A to B (plus, the templates are amazing - especially for the emails). It gave me so much more confidence in writing copy in a way that I was able to charge more, get better clients, as well as deliver copy to clients with results that merited this confidence. \n\nI mean, the creator (Jo) is kinda the \"original\" conversion copywriter. And she really knows her stuff.", "created_utc": "1626747370.0", "edited": "False", "id": "h5ttwi0", "is_submitter": "False", "link_id": "t3_ongwdd", "parent_id": "t1_h5tgbm9", "score": "4", "subreddit": "copywriting", "subreddit_id": "t5_2qq49"}, {"author": "HiThereFellowHumans", "body": "Honestly, CopySchool (and 10x FC) was one of the BEST investments I ever made. Would 110% recommend if you have the money. I also think they have a pretty extensive refund policy if you try it and decide it's not for you.", "created_utc": "1626732874.0", "edited": "False", "id": "h5t0ei4", "is_submitter": "False", "link_id": "t3_ongwdd", "parent_id": "t3_ongwdd", "score": "1", "subreddit": "copywriting", "subreddit_id": "t5_2qq49"}, {"author": "HiThereFellowHumans", "body": "Not OP, but I'm a big fan of Italki over here and have been using it for 4 or 5 years and with multiple languages. It's just about finding the right teacher (some are better than others).", "created_utc": "1626223739.0", "edited": "False", "id": "h53oh3f", "is_submitter": "False", "link_id": "t3_ojgc3w", "parent_id": "t1_h52y664", "score": "6", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "HiThereFellowHumans", "body": "I feel pretty confident that he'll appreciate it when he's older and it's worth the effort! My parents didn't read HP to me, unfortunately, but a friend of mine's used to read HP to her every night, and I used to love staying over at her house for that very reason. It made a huge mark on me, tbh, and it wasn't even my own parents.", "created_utc": "1626190506.0", "edited": "1626200078.0", "id": "h51p18n", "is_submitter": "False", "link_id": "t3_oj6eix", "parent_id": "t1_h512vrl", "score": "8", "subreddit": "harrypotter", "subreddit_id": "t5_2qiqi"}, {"author": "HiThereFellowHumans", "body": "Okay you have a lot of responses here but let me throw mine in here too....joining XC in 10th grade was one of the best decisions I ever made! \n\nIt hurt a lot at first (I don't think I could run more than a mile or two at the time), but I ended up loving it (still running today like a decade later) and made some incredible friends. Honestly, XC was one of the highlights of high school in general for me despite not being a \"runner\" before I joined. And as you'll likely find, runners tend to be very kind and willing to help, especially if you're new :-)", "created_utc": "1626188783.0", "edited": "False", "id": "h51l6y6", "is_submitter": "False", "link_id": "t3_oj40b1", "parent_id": "t3_oj40b1", "score": "1", "subreddit": "running", "subreddit_id": "t5_2qlit"}, {"author": "HiThereFellowHumans", "body": "Oh hey - I took this exact test a while ago and also found it hard to get info ahead of time so I'm happy to pitch in here. \n\nLike you, I learned Portuguese mostly through immersion and hadn't ever studied it formally or studied much grammar (though I did have a background in Spanish which did give me an overall idea of how the language worked). I only focused on the grammar once I realized I had to take this test, so I imagine my situation was a little bit like yours. \n\nSo, there's a few things I did that really helped. \n\n1: I found a European Portuguese private tutor from Verbling or Italki that was familiar with the CAPLE exam. Before every class I'd either write something (she had a list of test writing subjects)  or do some practice grammatical exercises (or an entire practice exam) which we'd go through together and correct live. It was extremely helpful, and I don't honestly know if I would have passed otherwise.\n\n2: I also signed up for The Portuguese Lab course (https://portugueselabacademy.com/). As I had never studied PT grammar formally, I had to \"go back to basics\" a little bit and this course was helpful. You can pay for a monthly membership, and I believe I just did 1 or 2 months...just enough time for me to review the parts of the language I knew I needed to practice/hadn't ever learned.   \n\n3: I did a loooot of practice tests (which, as I said, I reviewed and corrected with my private tutor afterwards. And if there were certain grammatical points that I kept getting wrong, we'd review them as well). These practice tests will also give you an idea of what the writing topics are (I think for me one was to write a letter? and the other was to \"argue\" my opinion about something). \n\nI remember finding a bunch of practice exams on Scribd and if you search, you may be able to find others. I think you can get a free 30-day trial with Scrib. \n\nAnd here's a random list of the various test resources I had saved on my computer (I didn't review these before sending so sorry if there are any repeats in there or if they aren't for the B2 level...though they might be worth trying out anyway for practice!):  \n\nhttps://www.scribd.com/document/350441219/DIPLE-PIE\n\n https://www.scribd.com/doc/234883559/Modelo-Exame-DUPLE\n\nhttps://www.scribd.com/doc/152400950/Modelo-Exame-DIPLE\n\nhttps://www.scribd.com/doc/57579636/DIPLE\n\nhttps://issuu.com/lidel/docs/exames_de_portugue__s_b2\n\n\nBoa sorte!", "created_utc": "1625959574.0", "edited": "False", "id": "h4r3opi", "is_submitter": "False", "link_id": "t3_ohlihd", "parent_id": "t3_ohlihd", "score": "2", "subreddit": "Portuguese", "subreddit_id": "t5_2sqn7"}, {"author": "HiThereFellowHumans", "body": "Hi! \n\nI'd be happy to answer some more questions \n\n(I'm learning the Levantine dialect, if it makes a difference)", "created_utc": "1623435878.0", "edited": "False", "id": "h1fjm7x", "is_submitter": "False", "link_id": "t3_nxd88i", "parent_id": "t3_nxd88i", "score": "2", "subreddit": "learn_arabic", "subreddit_id": "t5_2v4vi"}, {"author": "HiThereFellowHumans", "body": "I'm really prone to injuries, so I do have to follow somewhat of a plan to make sure I'm running generally consistently or not increasing my intensity too quickly (which I'm sure I'd do if I just run when/how I felt like it :-) \n\nBut if that doesn't seem to be an issue for you...then you do you!", "created_utc": "1623435768.0", "edited": "False", "id": "h1fjd7y", "is_submitter": "False", "link_id": "t3_nwvz8q", "parent_id": "t3_nwvz8q", "score": "1", "subreddit": "running", "subreddit_id": "t5_2qlit"}, {"author": "HiThereFellowHumans", "body": "I've been meaning to try barking at my next catcallers one of these days after seeing it recommended on a thread somewhere. Figure it'll make them think I'm crazy enough to leave me alone (and eliminate my concern of them following me). \n\nBut otherwise, I tend to just ignore them because I'm usually too slow to react.", "created_utc": "1623252164.0", "edited": "False", "id": "h15v80f", "is_submitter": "False", "link_id": "t3_nvxlot", "parent_id": "t3_nvxlot", "score": "5", "subreddit": "xxfitness", "subreddit_id": "t5_2ryzy"}, {"author": "HiThereFellowHumans", "body": "I was always told to focus on having a constant effort up the hill, not pace. In other words, make the effort you put going up the hill match the effort you were putting in when it was flat for that particular run. For example, if you're doing an easy, conversational run...then slow down enough up the hill that it still feels easy and conversational. And if that means there's a bit of walking in there, then there's a bit of walking in there.", "created_utc": "1622992258.0", "edited": "False", "id": "h0svfh4", "is_submitter": "False", "link_id": "t3_nt6540", "parent_id": "t3_nt6540", "score": "2", "subreddit": "XXRunning", "subreddit_id": "t5_3ft56"}, {"author": "HiThereFellowHumans", "body": "I did gymnastics from about age 10-18. I really loved it, but I was always pretty mid-level and eventually ended up quitting my senior year in high school because it just got too competitive    \n for me to continue to enjoy it.   \n\n\nAround age 25, I moved somewhere temporarily where the local college had a casual gymnastics club and I asked if I could join. Minus me feeling like an old lady (I forgot how big of a difference there is between a mid-20-year-old and 18-year-old college freshmen haha)...it was a blast! I even competed in one local meet.   \n\n\nThat said, it definitely wasn't the same as when as I was 16. There were a lot of skills I didn't get back (whether because I'm more cautious - and thus more afraid to try stuff - or just a lack of ability) and it was soooo much harder. So it was quite humbling. But like you, I had also missed being active in this really specific way, and was happy to be back. It did bring up some of the negative feelings I felt back in the day, but I found I was able to reign them in by focusing on the parts of the practice that I liked (admittedly, I'm not sure how that applies to rowing since it doesn't have multiple events like gymnastics does).", "created_utc": "1622920164.0", "edited": "False", "id": "h0ps8ss", "is_submitter": "False", "link_id": "t3_nsxfm6", "parent_id": "t3_nsxfm6", "score": "1", "subreddit": "xxfitness", "subreddit_id": "t5_2ryzy"}, {"author": "HiThereFellowHumans", "body": "Levantine is my personal favorite...but that's because I have a personal interest in Palestine. So I'd go based on the dialect you're most interested in. So if you have Egyptian friends, enjoy Egyptian cinema, want to visit Egypt, etc, choose Egyptian. If those things are true but for Lebanon, choose Levantine. If they are true but for Gulf countries, choose Khaliji.  And so on...   \n\n\nAs to courses, I think Mango languages has a decent Egyptian course. Italki and Verbling are great for getting private tutors (I think you can probably find ones under $10/hr if you're on a budget).", "created_utc": "1622919643.0", "edited": "False", "id": "h0pr88a", "is_submitter": "False", "link_id": "t3_nsz4hj", "parent_id": "t1_h0pqki4", "score": "7", "subreddit": "learn_arabic", "subreddit_id": "t5_2v4vi"}, {"author": "HiThereFellowHumans", "body": "This is so so helpful - thanks for taking the time for that whole breakdown here! \n\nAlso, those are some serious impressive numbers...amazing work getting to the point of nailing them even with a 20lb vest!", "created_utc": "1622908368.0", "edited": "False", "id": "h0p4izv", "is_submitter": "True", "link_id": "t3_nshb50", "parent_id": "t1_h0otkpw", "score": "1", "subreddit": "xxfitness", "subreddit_id": "t5_2ryzy"}, {"author": "HiThereFellowHumans", "body": "Hey thanks for this!   \n\n\nI suppose I should have clarified...my back also feels a bit \"noodley\" too (or as noodley as a back can feel), so I am certainly working my back as well.   \n\n\nThat said, you may be right in that I'm not really sure how to properly pull with the lats and am not using it as I should. Because everytime I try to do a pull-up, things just feel...off? Like I potentially have the strength, but my body just doesn't even know how to begin pulling myself up there. I don't have this issue with chin-ups, which I guess makes sense since my understanding is that these use a lot more biceps.    \n\n\nBased on a quick Google search, scap pulls are NOT something I've been doing. So perhaps I'll give some of those a try as well to see if they help me get a better feel for what the motion is like.", "created_utc": "1622863307.0", "edited": "False", "id": "h0nb447", "is_submitter": "True", "link_id": "t3_nshb50", "parent_id": "t1_h0mu6sy", "score": "4", "subreddit": "xxfitness", "subreddit_id": "t5_2ryzy"}, {"author": "HiThereFellowHumans", "body": "Huh, this is a good way to think about it! I guess been purely thinking about pull-ups purely as a strength thing, while forgetting that the form/movement itself (AKA the gymnastic part of it) is important too. Which I really should know given that I did gymnastics for basically all of my school years...", "created_utc": "1622850078.0", "edited": "False", "id": "h0mmwje", "is_submitter": "True", "link_id": "t3_nshb50", "parent_id": "t1_h0mlmhw", "score": "2", "subreddit": "xxfitness", "subreddit_id": "t5_2ryzy"}, {"author": "HiThereFellowHumans", "body": "If you don't mind me asking here since you're the PT... is it not better to \"rest\" those pull-up muscles on the days that you don't do them? As opposed to doing them almost every day?  \n\n\nFor example, I do a specific back/bicep workout involving pull-ups every 5 days or so and I go pretty hard (basically until failure on the limited chin-ups -- not yet pull-ups -- that I can do + negatives + other related exercises). But on the days in between, I make a point not to work those same muscles (and may do a chest/tricep workout instead, run, yoga, lower body strength, etc.)...especially because I'm often so sore. In other words, I never work my pull-up muscles two days in a row.   \n\n\nIt's certainly gotten me stronger (plus made my arm muscles pop quite nicely), but it also  sounds kinda like the opposite of what you recommend. And I still can't do a pull-up...so would you say I've got the wrong way of going about this?", "created_utc": "1622844451.0", "edited": "False", "id": "h0mbox9", "is_submitter": "False", "link_id": "t3_ns4kaf", "parent_id": "t1_h0l7tyx", "score": "1", "subreddit": "xxfitness", "subreddit_id": "t5_2ryzy"}, {"author": "HiThereFellowHumans", "body": "Hey, thanks for sharing those links! \n\nDo you know where I can get the audio for the first one?", "created_utc": "1622558685.0", "edited": "False", "id": "h075adb", "is_submitter": "False", "link_id": "t3_npm3t8", "parent_id": "t1_h05znu6", "score": "3", "subreddit": "learn_arabic", "subreddit_id": "t5_2v4vi"}, {"author": "HiThereFellowHumans", "body": "My husband and I weren't really interested in a wedding (though I wouldn't say we \"hated\" it...I have seen how stressful it has been to plan for other friends!). Plus, it felt very much like it was meant to be for other people, not us.   \n\n\nSo instead, we just got married in the courthouse and used all the money that we saved by not having a wedding towards a great honeymoon. Highly recommend!", "created_utc": "1622493527.0", "edited": "False", "id": "h04be4o", "is_submitter": "False", "link_id": "t3_np28qf", "parent_id": "t3_np28qf", "score": "1", "subreddit": "TwoXChromosomes", "subreddit_id": "t5_2r2jt"}, {"author": "HiThereFellowHumans", "body": "Can confirm: Copyschool by Copyhackers is one of the few that I will fully endorse (10x Freelancer by Copyhackers is honestly really good as well for the business side of things)", "created_utc": "1621611930.0", "edited": "False", "id": "gyydsta", "is_submitter": "False", "link_id": "t3_nhojbt", "parent_id": "t1_gyxx9bx", "score": "3", "subreddit": "copywriting", "subreddit_id": "t5_2qq49"}, {"author": "HiThereFellowHumans", "body": "Honestly, I'd choose whichever one you're more interested in! The stronger and more personal the motivation, the easier it is to learn.   \n\n\nAnd since it sounds like learning the Palestinian dialect is more meaningful to you, that's where I'd focus your energy. There are definitely resources available (perhaps fewer than Egyptian, but I'm learning Levantine and it's certainly doable!).   \n\n\nOnce you've got a strong grasp on Levantine, from there you can transition into Egyptian if you like.", "created_utc": "1621290250.0", "edited": "False", "id": "gyi0pm4", "is_submitter": "False", "link_id": "t3_nehct0", "parent_id": "t3_nehct0", "score": "1", "subreddit": "learn_arabic", "subreddit_id": "t5_2v4vi"}, {"author": "HiThereFellowHumans", "body": "Personally, I'd keep wearing it to protect the people who can't get vaccinated. \n\nFor example, a good friend of mine who is only in her 30s has a whole host of immune disorders + a history of allergies to other vaccinations in the past. If she gets COVID, it almost definitely won't turn out well for her. However, she also can't get the vaccine because she's not sure how her body will respond to it. \n\nSo, I'll continue to wear mine indoors in public places to protect people like her.", "created_utc": "1621195038.0", "edited": "False", "id": "gyczntw", "is_submitter": "False", "link_id": "t3_nchs7s", "parent_id": "t1_gy7yhra", "score": "6", "subreddit": "Boise", "subreddit_id": "t5_2qlk4"}, {"author": "HiThereFellowHumans", "body": "Oh I just came across her a few weeks ago...she's great!!! Have you done any of her programs?   \n\n\nI kinda just pick and choose her videos based on what I want to work on that day...but perhaps a more specific program could be the way to go for me.", "created_utc": "1620867821.0", "edited": "False", "id": "gxxbnon", "is_submitter": "False", "link_id": "t3_nazjuz", "parent_id": "t1_gxwl0gl", "score": "8", "subreddit": "xxfitness", "subreddit_id": "t5_2ryzy"}, {"author": "HiThereFellowHumans", "body": "Probably depends on the person, but I'm someone who seems to get injured *very* easily, so I have to be super careful about upping intensity. So if I did want to transition to frequent two-a-days, I'd be one of the people who should probably take 4 months+ to build up into the intensity/frequency that I want.", "created_utc": "1620245112.0", "edited": "False", "id": "gx2ffm2", "is_submitter": "False", "link_id": "t3_n5d8rq", "parent_id": "t1_gx1ajhy", "score": "3", "subreddit": "xxfitness", "subreddit_id": "t5_2ryzy"}, {"author": "HiThereFellowHumans", "body": "When someone mentions their pet (in this case, a dog) in a post, they are required by law to share a picture of said pet with us here :-)", "created_utc": "1620235668.0", "edited": "False", "id": "gx1t2e2", "is_submitter": "False", "link_id": "t3_n5c6d0", "parent_id": "t1_gx1rojo", "score": "20", "subreddit": "childfree", "subreddit_id": "t5_2qtwb"}, {"author": "HiThereFellowHumans", "body": "Not the person you asked, but my (28F) husband (43M) have never once questioned it...we were always just too happy with the life we have with each other. And we have a lifestyle that's not really conducive to having kids anyway (lots of traveling, pretty regular moving around, etc.), so it's really never been on our radar. \n\nAs others have said, communication is key...and it's always good to reaffirm from time to time. Or if one of you does randomly have this desire to have kids, take a hot sec to make sure it's not just hormones or societal pressure talkin' and that it's truly something you want. \n\nIf you're both serious and feel comfortable with it, you may want to consider one (or both) of you getting sterilized. My husband got a vasectomy about 2 years ago, and that really sealed the deal for us and was the best decision ever.  So if I was ever worried about him changing his mind at some point, that's off the table now haha", "created_utc": "1620056390.0", "edited": "False", "id": "gwsll99", "is_submitter": "False", "link_id": "t3_n3qj35", "parent_id": "t1_gws0jwa", "score": "9", "subreddit": "childfree", "subreddit_id": "t5_2qtwb"}, {"author": "HiThereFellowHumans", "body": "I'm honestly really confused by this. Did they not work with COVID patients directly? Did they not see how horribly sick it made some people?", "created_utc": "1619927743.0", "edited": "False", "id": "gwmera1", "is_submitter": "False", "link_id": "t3_n2shf1", "parent_id": "t1_gwmasnj", "score": "41", "subreddit": "news", "subreddit_id": "t5_2qh3l"}, {"author": "HiThereFellowHumans", "body": "Yes, I've noticed that! Just judging by the yard signs & bumper stickers I see, there seems to be a world of difference politically between parts of Boise and basically anywhere in Meridian, Garden City, etc.", "created_utc": "1619456743.0", "edited": "False", "id": "gvy7hb3", "is_submitter": "False", "link_id": "t3_my2dju", "parent_id": "t1_gvvmnbz", "score": "3", "subreddit": "childfree", "subreddit_id": "t5_2qtwb"}, {"author": "HiThereFellowHumans", "body": "Hahaha I've just moved here, and can confirm that there really aren't (which is super strange when coming from DC where everyone takes this thing seriously).", "created_utc": "1619371160.0", "edited": "False", "id": "gvu4p1h", "is_submitter": "False", "link_id": "t3_my2dju", "parent_id": "t1_gvt9053", "score": "16", "subreddit": "childfree", "subreddit_id": "t5_2qtwb"}, {"author": "HiThereFellowHumans", "body": "Hope you're able to run it but if not, sounds like a great goal to work towards!", "created_utc": "1614801694.0", "edited": "False", "id": "gpklaf5", "is_submitter": "False", "link_id": "t3_lwtn4r", "parent_id": "t1_gpjdez1", "score": "4", "subreddit": "XXRunning", "subreddit_id": "t5_3ft56"}, {"author": "HiThereFellowHumans", "body": "Hey, congrats! \n\nThere are lots of good plans out there that can get you up to 10K just fine...but on race day, here's my biggest piece of advice (learned from personal experience): don't let the excitement/adrenaline make you start out too fast even if you feel great. Better to start slow and get faster than vice versa :-) \n\nP.S. Where are you that races are happening still?? All of these things are still very much cancelled where I am", "created_utc": "1614782158.0", "edited": "False", "id": "gpjcdbi", "is_submitter": "False", "link_id": "t3_lwtn4r", "parent_id": "t3_lwtn4r", "score": "24", "subreddit": "XXRunning", "subreddit_id": "t5_3ft56"}, {"author": "HiThereFellowHumans", "body": "Honestly, I think it's also important to bring it up just so people realize it's an option! So many people don't even realize they have a choice in the matter, so I think something as simple as telling them you don't want children yourself is enough to get the gears turning. \n\nI've uh, definitely made a point to bring it up casually to all the young couples in my life haha (including my brother and his new fiance)", "created_utc": "1614608637.0", "edited": "False", "id": "gpaupvf", "is_submitter": "False", "link_id": "t3_luvw9s", "parent_id": "t3_luvw9s", "score": "5", "subreddit": "childfree", "subreddit_id": "t5_2qtwb"}, {"author": "HiThereFellowHumans", "body": "While there's definitely a place for native-level materials, I think you'll get a lot more from it if you focus (for now) on material that you understand 70% of.   \n\n\nThe Inner French podcast is great, and I also like a lot of Olly Richard's stuff for French (his \"Conversations\" program really helped my listening).", "created_utc": "1613522137.0", "edited": "False", "id": "gnpkncq", "is_submitter": "False", "link_id": "t3_llefti", "parent_id": "t3_llefti", "score": "3", "subreddit": "learnfrench", "subreddit_id": "t5_2sucz"}, {"author": "HiThereFellowHumans", "body": "Ugh, sorry to hear that happened to you...but I promise good childfree men exist! \n\nI met my husband while traveling (we were staying at the same hostel) and neither of us have ever, ever wanted kids. \n\nOf course, people still don't believe that we actually don't plan on having kids...but at least we're sure haha", "created_utc": "1613482405.0", "edited": "False", "id": "gnn7hv8", "is_submitter": "False", "link_id": "t3_lkube0", "parent_id": "t3_lkube0", "score": "1", "subreddit": "childfree", "subreddit_id": "t5_2qtwb"}, {"author": "HiThereFellowHumans", "body": "I agree with this here! \n\nWhile I think working out has been great for my self-confidence (feeling strong as a lady is fun) and I've certainly built muscle tone that I've proud of, my core body shape (upside-down triangle w/ wide shoulders, straight waist/pancake butt that won't inflate despite my best efforts, and a pretty flat chest) is very much there. \n\nEven with fitness, there is only so much we can do with our natural body structure...and embracing that has been very helpful for me as someone who will never have a bubble butt/hourglass shape/big boobs without surgery or photoshop :-)", "created_utc": "1613055372.0", "edited": "False", "id": "gmxyx2l", "is_submitter": "False", "link_id": "t3_lhk07p", "parent_id": "t1_gmxofac", "score": "13", "subreddit": "xxfitness", "subreddit_id": "t5_2ryzy"}, {"author": "HiThereFellowHumans", "body": "Honestly, it's really up to which one you want to focus on! Or perhaps which one you think you're more likely to commit to.   \n\n\nFor example, as much as I like lifting, running is my favorite so find it easier to commit to a routine that prioritizes it (and start to wig out a little mentally if I go too long without it). But I do also go through cycles where I put in less mileage and focus on lifting for a few weeks/months. The benefit of this is that it ultimately makes me a faster & stronger runner, so it's really a win-win all around.   \n\n\nI'm not sure if this helps, but here's my general schedule at the moment (working out 5-6 days a week). I'm not training for any particular race, so I'm running less than I usually would be:    \n\n\n* 3 days of running (1 day easy, 1 day longer, 1 day with some speed or hill sprints...I run on trails most days, so I get to work the legs/booty quite well just by running!) \n* 2 days of upper body + core strength \n* 1-2 days of \"fun\" fitness (whatever I feel like, basically...yoga, tennis, hiking, roller blading, etc.) ... 1 of these days may overlap with upper body day \n* 1-2 days of lower body strength (1 session usually added after a run, other session may be standalone or use one of the \"fun\" activities to count for it)", "created_utc": "1611619214.0", "edited": "False", "id": "gkrnew0", "is_submitter": "False", "link_id": "t3_l3vfus", "parent_id": "t3_l3vfus", "score": "2", "subreddit": "xxfitness", "subreddit_id": "t5_2ryzy"}, {"author": "HiThereFellowHumans", "body": "I encounter a good amount of hikers/walkers when I trail run, and usually just saying something like \"on your left\" is enough as I approach them. Seems to work a little more effectively than an \"excuse me\" so they know exactly where you are.", "created_utc": "1611089794.0", "edited": "False", "id": "gjvdlyz", "is_submitter": "False", "link_id": "t3_l0mgiz", "parent_id": "t3_l0mgiz", "score": "1", "subreddit": "running", "subreddit_id": "t5_2qlit"}, {"author": "HiThereFellowHumans", "body": "Oh no I totally agree with you here! I don't think really anyone wins here when these situations (whether it's a man or a woman) aren't taken seriously or believed.", "created_utc": "1610841432.0", "edited": "False", "id": "gjir67d", "is_submitter": "False", "link_id": "t3_ky7tn8", "parent_id": "t1_gjhkw2g", "score": "3", "subreddit": "XXRunning", "subreddit_id": "t5_3ft56"}, {"author": "HiThereFellowHumans", "body": "It's definitely not the same. I'm sure it's also annoying, but as a woman it's frightening to know that just about any man who catcalls me could physically overpower me if they wanted to (even if I may be a stronger than average female). It's probably pretty infrequent that man hear a catcall and are concerned for their safety.", "created_utc": "1610810580.0", "edited": "False", "id": "gjgtrkn", "is_submitter": "False", "link_id": "t3_ky7tn8", "parent_id": "t1_gjenl2z", "score": "10", "subreddit": "XXRunning", "subreddit_id": "t5_3ft56"}, {"author": "HiThereFellowHumans", "body": "First of all, proud of you for getting back out there! \n\nI was never hitting your paces, but I also took a huge hiatus from running when the pandemic hit and all my races were cancelled, so I can relate to how disheartening it is to start up again. \n\nIt looks like others have already mentioned the 10% rule. But beyond that, I highly highly recommend focusing a lot on strength to accompany your running as you build it up again. You've likely lost some of the strength you gained from running before (though I'm sure it'll come back quickly!), and you don't want this to affect your form in a way that gets you injured.", "created_utc": "1610466894.0", "edited": "False", "id": "gj0d03d", "is_submitter": "False", "link_id": "t3_kvkz6j", "parent_id": "t3_kvkz6j", "score": "5", "subreddit": "running", "subreddit_id": "t5_2qlit"}, {"author": "HiThereFellowHumans", "body": "Haha at least based on this thread there seems to be! I'm INFP/J", "created_utc": "1610375817.0", "edited": "False", "id": "givuvk0", "is_submitter": "False", "link_id": "t3_kv00fb", "parent_id": "t3_kv00fb", "score": "2", "subreddit": "hsp", "subreddit_id": "t5_2sf60"}, {"author": "HiThereFellowHumans", "body": "Oh, definitely! For example, there are a few verb conjugations used in MSA that are, thankfully, not used in dialect (so it's a bit of a waste of time to learn them tbh)", "created_utc": "1610320148.0", "edited": "False", "id": "git7ucy", "is_submitter": "False", "link_id": "t3_ksy70r", "parent_id": "t1_gippa3z", "score": "1", "subreddit": "learn_arabic", "subreddit_id": "t5_2v4vi"}, {"author": "HiThereFellowHumans", "body": "This is a good question that I struggle with too. Even with an online dictionary, I often struggle to spell out a word I've heard well enough that it can be found haha", "created_utc": "1610209577.0", "edited": "False", "id": "gio0j2j", "is_submitter": "False", "link_id": "t3_ktrrwt", "parent_id": "t3_ktrrwt", "score": "1", "subreddit": "learn_arabic", "subreddit_id": "t5_2v4vi"}, {"author": "HiThereFellowHumans", "body": "MSA grammar is quite a bit more complicated than dialect grammar (for example, MSA has some extra verb conjugations that you won't need to know/use) so I'd just be wary of that as you dive into the grammar :-)", "created_utc": "1610209253.0", "edited": "False", "id": "ginzwl3", "is_submitter": "False", "link_id": "t3_ksy70r", "parent_id": "t1_gimqxg5", "score": "1", "subreddit": "learn_arabic", "subreddit_id": "t5_2v4vi"}, {"author": "HiThereFellowHumans", "body": "I'd dive straight into learning the dialect. \n\nMSA is quite a bit more complex grammatically than the dialects and less useful if your goal is communication. For example, I learned MSA for a while in school only to find that I couldn't really communicate at all upon landing in Palestine. Switched to a dialect (Levantine)...and it's so much better and more personal. \n\nWhatever you choose to do...good luck! Arabic is a wonderful language to pursue :-)", "created_utc": "1610124401.0", "edited": "False", "id": "gik1cfw", "is_submitter": "False", "link_id": "t3_ksy70r", "parent_id": "t3_ksy70r", "score": "2", "subreddit": "learn_arabic", "subreddit_id": "t5_2v4vi"}, {"author": "HiThereFellowHumans", "body": "I was wondering this as well. I'd assume it was a reporter (and thus not someone who could actively help the officer).", "created_utc": "1609991967.0", "edited": "False", "id": "gidzhjx", "is_submitter": "False", "link_id": "t3_krxmet", "parent_id": "t1_gicrydp", "score": "3", "subreddit": "washingtondc", "subreddit_id": "t5_2qi2g"}, {"author": "HiThereFellowHumans", "body": "100%. I had a deadline today (I write for a living...and writing can be a challenge at the best of times) but couldn't focus to save my life. Thankfully, client understood.", "created_utc": "1609991699.0", "edited": "False", "id": "gidyy8e", "is_submitter": "False", "link_id": "t3_krs3pu", "parent_id": "t1_gidov1p", "score": "9", "subreddit": "washingtondc", "subreddit_id": "t5_2qi2g"}, {"author": "HiThereFellowHumans", "body": "Once you feel comfortable in Spanish, it won't be so difficult to transition to Br Portuguese :-)", "created_utc": "1609684997.0", "edited": "False", "id": "ghyf95s", "is_submitter": "False", "link_id": "t3_kphvzn", "parent_id": "t1_ghy9hq1", "score": "5", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "HiThereFellowHumans", "body": "I definitely have a mental \"cap\" as to how many languages I want to be able to communicate in.\n\nSo after the long, arduous project that is Arabic, I'd love to learn Farsi and potentially Hindi (and then I'll think I'll call it good and focus on making the languages I already speak stronger). Can't learn it all, after all!", "created_utc": "1609684838.0", "edited": "False", "id": "ghyewve", "is_submitter": "False", "link_id": "t3_kphvzn", "parent_id": "t3_kphvzn", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "HiThereFellowHumans", "body": "I'd recommend finding a private tutor who speaks the Khaliji dialect on either Italki or Verbling. Hands down the best way to learn Arabic (or any language), in my opinion. You could probably even find some who specialized in business Arabic if you wanted to.", "created_utc": "1609425546.0", "edited": "False", "id": "ghlx2kr", "is_submitter": "False", "link_id": "t3_knnk34", "parent_id": "t3_knnk34", "score": "7", "subreddit": "learn_arabic", "subreddit_id": "t5_2v4vi"}, {"author": "HiThereFellowHumans", "body": "Ooooo what are you doing to work your pull ups? My goal is also to get one this year (and I feel so close but yet so far!)", "created_utc": "1609169144.0", "edited": "False", "id": "ghals21", "is_submitter": "False", "link_id": "t3_klabms", "parent_id": "t1_gh7sw9j", "score": "2", "subreddit": "xxfitness", "subreddit_id": "t5_2ryzy"}, {"author": "HiThereFellowHumans", "body": "Did you find a solution that worked here? I need private time wayyyy more than my husband does, so I'm always curious about how other couples navigate this difference in personalities.", "created_utc": "1609115010.0", "edited": "False", "id": "gh8l5ft", "is_submitter": "False", "link_id": "t3_klcpdo", "parent_id": "t1_gh87mb9", "score": "9", "subreddit": "infj", "subreddit_id": "t5_2r39a"}, {"author": "HiThereFellowHumans", "body": "I'd never really thought to describe it this way...but I'm definitely like this as well! \n\nFor example, there are a few games (#simsforlife) that I like to play, but I never play them when my husband is around...and we've been married for 6+ years. Or like if I'm listening to music or a podcast, I always always always have headphones in. \n\nIt's so strange because like...I'm not doing anything that strange or personal? But I just really really like keeping those things for myself haha", "created_utc": "1609114933.0", "edited": "False", "id": "gh8l00e", "is_submitter": "False", "link_id": "t3_klcpdo", "parent_id": "t3_klcpdo", "score": "3", "subreddit": "infj", "subreddit_id": "t5_2r39a"}, {"author": "HiThereFellowHumans", "body": "Hmm unfortunately I'm learning Levantine so I can't speak specifically to the quality of the resources I'll recommend below for MSA or Egyptian... but I can let you know what I've found helpful for Levantine. \n\nI've quite liked Lingualism's books for Levantine, and I believe I saw they had material for Egyptian & MSA so may be worth checking out. I also tried Mango Languages for a bit which I liked, but it just didn't suit my level at the time. And I also think they have a variety of dialects. \n\nFor listening, Playaling is great. It's free, has subtitles in English & Arabic, and you can sort by level and dialect. \n\nAll that said, the best thing I did for my Arabic was getting a private language tutor (from Italki or Verbling) early on, so you should be able to quite easily find one for the dialects you're looking for.\n\nedited because I forgot how to write", "created_utc": "1607356930.0", "edited": "False", "id": "gey9kq0", "is_submitter": "False", "link_id": "t3_k77sub", "parent_id": "t1_geurd7u", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "HiThereFellowHumans", "body": "Hmm that depends! Are you learning a dialect? Or MSA?", "created_utc": "1607213041.0", "edited": "False", "id": "ger5ift", "is_submitter": "False", "link_id": "t3_k77sub", "parent_id": "t1_geqvrxy", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "HiThereFellowHumans", "body": "I usually study anywhere from 45 minutes - 2 hours a day 5 or 6 days a week. \n\n(Sometimes less than that, but this is what I aim for! Especially with the pandemic, I have a lot more time at home and a lot less other commitments to get in the way) \n\nMost of my study time involves either speaking or actively listening to this language as I've found this to be the best way to focus my time. This means a 1-hour conversation with a private teacher 3 days a week. And then I begin my own study sessions with perhaps 30 minutes or so of active listening (in other words, listening multiple times to material that is in my level, taking note of new phrases, mirroring back what I hear, etc...rather than passively watching a series or movie, although I think those have their place too). I make a point to try to understand new material as well as re-listen to material I've reviewed previously as I find it really helps me \"intuitively\" learn a lot of new vocab and sentence structures without having to actively memorize it.  \n\nFrom there, I spend 15 minutes or so going through my trusty Anki deck and adding in new words/expressions as needed. For \"homework\" between my lessons, one of my teachers has me watch a short video and take notes so I can explain to her what I saw during our next lesson (this has been one of the best things to help with my spoken fluency - highly recommend it!), and the other has me write a short text to review during the session, so working on these fall somewhere in there as well.\n\nUsually, I spend 10-15 minutes or so reviewing grammatical concepts, but this very much depends on the language. For example, I'm focusing on Arabic right now and very little of my time is devoted to grammar outside of writing down the conjugations of one new verb from an Arabic verbs book daily. Frankly, the reason I don't do much grammar is simply that it's hard to find good grammar resources for Arabic dialects. And I don't feel like it's the grammar that's holding me back at the moment, it's more my vocabulary and low comprehension. But for other languages, I do usually put a bit more focus into grammar.", "created_utc": "1607187592.0", "edited": "False", "id": "gepo1ru", "is_submitter": "False", "link_id": "t3_k77sub", "parent_id": "t3_k77sub", "score": "12", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "HiThereFellowHumans", "body": "Yes, I loved that aspect of NaTakallam as well!   \n\n\nAs to learning some basics or not...I'm not honestly sure what is best. I started taking private lessons with no background in Levantine, but I had taken a few semesters of MSA a few years prior. I didn't remember a ton, but I did already know the alphabet, some basic phrases (although there were actually very few words in common that I already knew), and some basic grammatical structures which I'm sure helped.   \n\n\nI'm definitely a big proponent of trying to speak/communicate in a new language as early as you possibly can, so I'd certainly recommend getting a tutor before you feel \"ready\" to have a conversation :-)  \n\n\nIf anything, it's probably worth learning the alphabet on your own...but set up to find a tutor shortly thereafter.", "created_utc": "1606865360.0", "edited": "False", "id": "geb9d1b", "is_submitter": "False", "link_id": "t3_k20qqt", "parent_id": "t1_gdsbuqe", "score": "1", "subreddit": "learn_arabic", "subreddit_id": "t5_2v4vi"}, {"author": "HiThereFellowHumans", "body": "100% this\n\nWhen I was on my high school CC team, I distinctly remember us making t-shirts that said \"Our sport is your sport's punishment\"", "created_utc": "1606864891.0", "edited": "False", "id": "geb8h66", "is_submitter": "False", "link_id": "t3_k4ntuw", "parent_id": "t1_geacasy", "score": "8", "subreddit": "XXRunning", "subreddit_id": "t5_3ft56"}, {"author": "HiThereFellowHumans", "body": "Cool, maybe I'll take a peek at the sources since it can be quite hard to get good grammatical explanations for any dialects (and perhaps there is something there)", "created_utc": "1606836173.0", "edited": "False", "id": "ge9kef6", "is_submitter": "False", "link_id": "t3_k4jjla", "parent_id": "t1_ge9jc21", "score": "2", "subreddit": "learn_arabic", "subreddit_id": "t5_2v4vi"}, {"author": "HiThereFellowHumans", "body": "Once my friend and I were running during one of the classic Midwest \"blizzards,\" and we helped the owners dig out and then push 2 separate cars that got stuck in the snow. It was fun and made us feel a bit like superheroes :-)", "created_utc": "1606834916.0", "edited": "False", "id": "ge9i040", "is_submitter": "False", "link_id": "t3_k4kett", "parent_id": "t3_k4kett", "score": "9", "subreddit": "running", "subreddit_id": "t5_2qlit"}, {"author": "HiThereFellowHumans", "body": "Ooooh this book looks intriguing! Does it focus on MSA? Or is it for a dialect?", "created_utc": "1606834654.0", "edited": "False", "id": "ge9hil9", "is_submitter": "False", "link_id": "t3_k4jjla", "parent_id": "t1_ge9e45a", "score": "2", "subreddit": "learn_arabic", "subreddit_id": "t5_2v4vi"}, {"author": "HiThereFellowHumans", "body": "Honestly not a bad tip! Unfortunately, I usually run with a mask these days so maybe something to try post corona...", "created_utc": "1606834433.0", "edited": "False", "id": "ge9h3sl", "is_submitter": "False", "link_id": "t3_k4bp54", "parent_id": "t1_ge8nn8h", "score": "3", "subreddit": "XXRunning", "subreddit_id": "t5_3ft56"}, {"author": "HiThereFellowHumans", "body": "We were a little surprised as well, but as I didn't go to the appointment, I'm honestly not sure what the deal was. He might have only mentioned it when he booked the appointment.", "created_utc": "1606834060.0", "edited": "False", "id": "ge9gfe9", "is_submitter": "True", "link_id": "t3_k40dft", "parent_id": "t1_ge80ayp", "score": "3", "subreddit": "childfree", "subreddit_id": "t5_2qtwb"}, {"author": "HiThereFellowHumans", "body": "I mean, it certainly wasn't deliberate on our part since we know how upsetting infertility can be to those who want children. When my husband made the appointment, he let the clinic know that he wanted the fertility test expressly to check the efficacy of his vasectomy, so I imagine the doctor just forgot at some point since this probably isn't very common.", "created_utc": "1606833983.0", "edited": "False", "id": "ge9gagj", "is_submitter": "True", "link_id": "t3_k40dft", "parent_id": "t1_ge8cia7", "score": "4", "subreddit": "childfree", "subreddit_id": "t5_2qtwb"}, {"author": "HiThereFellowHumans", "body": "Eeep I had to look up what ICD10 is so I'm 100% sure I understand what this means, but in this case this wasn't in the US and the procedure was done in a different country than where this doctor was, so don't think it would have helped him :-)", "created_utc": "1606772492.0", "edited": "False", "id": "ge6vzqu", "is_submitter": "True", "link_id": "t3_k40dft", "parent_id": "t1_ge6po0x", "score": "27", "subreddit": "childfree", "subreddit_id": "t5_2qtwb"}, {"author": "HiThereFellowHumans", "body": "Oh, I certainly believe it! I can only imagine the type of reactions he was used to receiving...", "created_utc": "1606766916.0", "edited": "False", "id": "ge6k92s", "is_submitter": "True", "link_id": "t3_k40dft", "parent_id": "t1_ge6jp7c", "score": "112", "subreddit": "childfree", "subreddit_id": "t5_2qtwb"}, {"author": "HiThereFellowHumans", "body": "If I was in the US, I'd say this wasn't certainly the case. But it was in Europe, where I have a little more faith in the health system so hopefully not", "created_utc": "1606766838.0", "edited": "False", "id": "ge6k334", "is_submitter": "True", "link_id": "t3_k40dft", "parent_id": "t1_ge6gigy", "score": "64", "subreddit": "childfree", "subreddit_id": "t5_2qtwb"}, {"author": "HiThereFellowHumans", "body": "It definitely depends on when you go, but I run there several times a week and I've never found it so busy that I didn't feel safe crowd-wise or unable to social distance. \n\nDuring the weekdays, it's quite empty so I'd certainly try to go then if you're concerned about the busy-ness. It gets busier during the weekend, but there are honestly so many trails that it's not that hard to spread out and have some space.", "created_utc": "1606696828.0", "edited": "False", "id": "ge3m429", "is_submitter": "False", "link_id": "t3_k3f4km", "parent_id": "t1_ge3k2c6", "score": "9", "subreddit": "washingtondc", "subreddit_id": "t5_2qi2g"}, {"author": "HiThereFellowHumans", "body": "This is a beautiful reason to learn a language - good luck on your journey! \n\nAs others have mentioned, it sounds like Levantine is where you are going to want to focus rather than MSA. \n\nAnd the absolute best thing I did for my Arabic was taking private lessons with a native speaker online. They can be quite reasonably priced, depending on where you go (anywhere from 10-20 USD per hour). If you're okay with the cost, this is 110% the most efficient way to learn.   \n\nYou can find them on websites like Italki or Verbling (you can even filter specifically by where they are from, so perhaps you'd like someone from Syria or could do Syria, Lebanon, Jordan, or Palestine for the Levantine dialect). \n\nI've also taken private lessons from a Syrian teacher with a really great organization called NaTakallam. They employ refugees as teachers.", "created_utc": "1606492853.0", "edited": "False", "id": "gdrvmob", "is_submitter": "False", "link_id": "t3_k20qqt", "parent_id": "t3_k20qqt", "score": "3", "subreddit": "learn_arabic", "subreddit_id": "t5_2v4vi"}, {"author": "HiThereFellowHumans", "body": "I definitely think it's okay to be this way! I'm this way myself. But it certainly makes me feel badly sometimes, especially since I'm married to a very extroverted person who would happily be together basically all the time. \n\nAfter enough years together, he's respectful of my need for alone time, but certainly doesn't understand or relate to it. And I still feel guilty taking it. \n\nI think it can also be quite hard for others who don't have this need to take our need for it personally.", "created_utc": "1606258495.0", "edited": "False", "id": "gdht76f", "is_submitter": "False", "link_id": "t3_k072u9", "parent_id": "t3_k072u9", "score": "3", "subreddit": "infj", "subreddit_id": "t5_2r39a"}, {"author": "HiThereFellowHumans", "body": "If I remember correctly, the integrated curriculum is a combination of MSA and Levantine. \n\nI wasn't really interested in the MSA aspects, so I just have private lessons with one of their Levantine teachers (I'd say this is the best way to go if you want to focus on dialect) \n\nI didn't do their integrated curriculum,", "created_utc": "1606142104.0", "edited": "False", "id": "gdc0gz6", "is_submitter": "False", "link_id": "t3_jzae7v", "parent_id": "t3_jzae7v", "score": "2", "subreddit": "learn_arabic", "subreddit_id": "t5_2v4vi"}, {"author": "HiThereFellowHumans", "body": "Haha I think I've also definitely scared people off before because of this! \n\nThat said, those that reciprocate and are into those types of conversations do tend to blossom into some wonderful friendships.", "created_utc": "1605799668.0", "edited": "False", "id": "gcu49yf", "is_submitter": "False", "link_id": "t3_jwuie8", "parent_id": "t1_gcsjb20", "score": "1", "subreddit": "infj", "subreddit_id": "t5_2r39a"}, {"author": "HiThereFellowHumans", "body": "Hiya. Honestly, I also feel like I missed on a lot of friendships in high school and college. Most of my closest friends now are ones that I've met as an adult...so it is possible! \n\nOnce major thing is just knowing that it takes patience. You can put yourself out there all your want, but I've found that is often just a matter of being in the right place at the right time that gets you to meet someone you \"click\" with. And that you realistically won't \"click\" with most people you meet. \n\nFor example, I lived in Sweden for two years and for the first year and a half, I had nothing but shallow relationships just because I didn't really meet anyone I could properly connect with despite my efforts. By chance, I met a girl at a meetup I was at, we just instantly \"clicked\" and now she's one of my best friends although we live halfway across the world from each other. \n\nAnyway, here's a pre-pandemic write-up I did a while ago of all the ways I've made new friends. Although I find it pretty exhausting and don't exactly like making new friends (though I do love having them!), I move a lot so learning how to do it has been kind of essential for my sanity. \n\n1) Meetup.com - has meetups for just about any interest/hobby, etc. you can imagine. You can also create your own group or set up an event if what you're looking for isn't there.\n\n2) Clubs for hobbies you have/sports you like - personally, I usually try to join a local running club and a local hiking club. But there are clubs for just about anything out there! Either Google or find them on meetup.com\n\n3) Join Facebook groups for people new to the city and make a post seeing if people want to meet for a coffee/beer sometime\n\n4) Go to expat/foreigner meetups - not sure where you are or where you are from, but I think this still stands even if you are living in your home country (like an American living in the U.S.) In general, I've found foreigners (particularly if they are new to the city) tend to be much more receptive to meeting new people and building friendships given that most of their friends/family are still back home or spread throughout other places. I usually find these through Facebook groups, meetup.com or couchsurfing events\n\n5) Go to Couchsurfing events\n\n6) Take the initiative when the opportunity presents itself - I don't always do this as often as I should, but if you find someone you click with, invite them out to do something else even if it feels a bit forward. Sure, sometimes it won't work out (the person sounds interested but when you try to make plans it just keeps falling through), but you can't take it personally. Some people, particularly if they are kind of established in the city already, don't necessarily have the time/energy for new friends beyond their current social circle (this also probably explains why it can be easier to befriend foreigners/expats).\n\nBut a bit of initiative can go a long way. I can think of two really wonderful friendships I've developed because the other person (not me, unfortunately haha) took initiative right away. One of them we a girl who I met one day at a group run and then invited me to go to her neighborhood picnic two days later. The other was a girl I met at a yoga class who then invited me to go hiking with her the next day even though we hadn't had more than a 15-minute conversation. Their initiative might have seemed a bit forward at the time, but I myself was really looking for friends and I very much appreciated them having the courage to ask. And several years later, am still friends with both of them :-)", "created_utc": "1605717724.0", "edited": "False", "id": "gcqeavv", "is_submitter": "False", "link_id": "t3_jw5d4e", "parent_id": "t3_jw5d4e", "score": "3", "subreddit": "infp", "subreddit_id": "t5_2qn2o"}, {"author": "HiThereFellowHumans", "body": "Yeah, not my thing", "created_utc": "1605538983.0", "edited": "False", "id": "gci0j8x", "is_submitter": "False", "link_id": "t3_jv25dk", "parent_id": "t3_jv25dk", "score": "1", "subreddit": "copywriting", "subreddit_id": "t5_2qq49"}, {"author": "HiThereFellowHumans", "body": "Totally depends on the day! \n\nSometimes nothing. Sometimes mundane stuff. Sometimes things I need to work through pop up even though I hadn't realized they were stressing me out. \n\nI'm also really big into languages, so I often spend some time thinking/translating things in my head into another language for at least part of the run ;-) \n\nNone of this is really conscious, though. I just focus on my running and let my mind do its thing. I figure we don't have much time in our daily lives to let our minds simply \"wander,\" so I try not to force anything when I'm running.", "created_utc": "1605458456.0", "edited": "False", "id": "gcehssa", "is_submitter": "False", "link_id": "t3_jujzy9", "parent_id": "t3_jujzy9", "score": "1", "subreddit": "running", "subreddit_id": "t5_2qlit"}, {"author": "HiThereFellowHumans", "body": "Like everyone else said, definitely up your water intake! \n\nI definitely noticed some extra joint soreness, too, so I deliberately eased back on intensity for a while. So just be sure you're mindful of that. I also started taking some joint supplements (glucosamine, etc.). I'm not sure if they helped, but I figured it couldn't hurt. \n\nGood luck! I know accutane gets a lot of hate and it is quite a \"serious\" drug, but it's been years since I still took it and my skin is still clear (minus some \"mask-ne,\" but what's a girl to do) and it was 110% worth it in my situation.", "created_utc": "1605458173.0", "edited": "False", "id": "gcehaop", "is_submitter": "False", "link_id": "t3_julhb1", "parent_id": "t3_julhb1", "score": "2", "subreddit": "XXRunning", "subreddit_id": "t5_3ft56"}, {"author": "HiThereFellowHumans", "body": "I was there and I can confirm over the course of several hours, I saw a grand total of FOUR people without a mask. \n\nI see more maskless people than this in a single picture from the MAGA march.", "created_utc": "1605456973.0", "edited": "False", "id": "gcef63n", "is_submitter": "False", "link_id": "t3_juc4h9", "parent_id": "t1_gcdo2v6", "score": "0", "subreddit": "washingtondc", "subreddit_id": "t5_2qi2g"}, {"author": "HiThereFellowHumans", "body": "I also don't particularly like texting (maybe because I write all day for my job, so when I'm done with work the last thing I want to do is write more haha). \n\nI've found what works for me is to send short voice recordings back (works if you're in Messenger or Whatsapp, not sure about normal texts) since they are a lot more fun and personable.", "created_utc": "1605100660.0", "edited": "False", "id": "gbxk8or", "is_submitter": "False", "link_id": "t3_js48zd", "parent_id": "t3_js48zd", "score": "1", "subreddit": "infj", "subreddit_id": "t5_2r39a"}, {"author": "HiThereFellowHumans", "body": "Also curious about this. And do you have to pay for it? Or does the government front the cost?", "created_utc": "1605024840.0", "edited": "False", "id": "gbu7vi5", "is_submitter": "False", "link_id": "t3_jr6ij5", "parent_id": "t1_gbtnubs", "score": "5", "subreddit": "childfree", "subreddit_id": "t5_2qtwb"}, {"author": "HiThereFellowHumans", "body": "Definitely possible to break into. I personally got into it 2 years after graduating (with a degree in English lit and Spanish...so not necessarily copywriting things).    \n\n\nHonestly, I found clients aren't that particular about your experience. What they care about is knowing that you can do the job they are asking you to do. For example, when I first got started, I got jobs because I created some really good samples that I could send to potential clients.   \n\n\nThis article was actually one of the first things that got me into copywriting, so maybe it'll be of use: [https://freelancetowin.com/how-to-become-a-copywriter/](https://freelancetowin.com/how-to-become-a-copywriter/)", "created_utc": "1604703670.0", "edited": "False", "id": "gbebkfh", "is_submitter": "False", "link_id": "t3_jpblkx", "parent_id": "t3_jpblkx", "score": "1", "subreddit": "copywriting", "subreddit_id": "t5_2qq49"}, {"author": "HiThereFellowHumans", "body": "Ugh, do we have any idea *when* it might be officially determined? I honestly don't know how much more my nerves (or all the week I haven't gotten done this week) can take!", "created_utc": "1604688134.0", "edited": "False", "id": "gbdfib3", "is_submitter": "False", "link_id": "t3_jp5xei", "parent_id": "t1_gbcryew", "score": "1", "subreddit": "TwoXChromosomes", "subreddit_id": "t5_2r2jt"}, {"author": "HiThereFellowHumans", "body": "I just learned this from my teacher today! \n\nApparently, زِفت means something like \"shit.\" But not as strong though (it technically means \"muddy\" I think and implies that something is really bad, but it isn't necessarily a curse word).", "created_utc": "1604501646.0", "edited": "False", "id": "gb4ct41", "is_submitter": "False", "link_id": "t3_jnru1e", "parent_id": "t3_jnru1e", "score": "3", "subreddit": "learn_arabic", "subreddit_id": "t5_2v4vi"}, {"author": "HiThereFellowHumans", "body": "Hey, I've been there myself!   \n\n\nOne time, my husband and I ran a half marathon together. I trained pretty strictly for it for 4 months, he decided in the last month that he wanted in and didn't really train properly at all. Guess who finished at *the. exact. same. time.*\n\nAlas, I think there really is so much we can do about biology here.", "created_utc": "1604446579.0", "edited": "False", "id": "gb24n4i", "is_submitter": "False", "link_id": "t3_jni9fd", "parent_id": "t3_jni9fd", "score": "24", "subreddit": "XXRunning", "subreddit_id": "t5_3ft56"}, {"author": "HiThereFellowHumans", "body": "What places do you have on your bucket list :-) ?", "created_utc": "1604072992.0", "edited": "False", "id": "galz7hv", "is_submitter": "False", "link_id": "t3_jktild", "parent_id": "t1_gal2agt", "score": "5", "subreddit": "childfree", "subreddit_id": "t5_2qtwb"}, {"author": "HiThereFellowHumans", "body": "Was going to say the same!", "created_utc": "1604003679.0", "edited": "False", "id": "gaj4ml8", "is_submitter": "False", "link_id": "t3_jkfy9b", "parent_id": "t1_gaiu94e", "score": "15", "subreddit": "childfree", "subreddit_id": "t5_2qtwb"}, {"author": "HiThereFellowHumans", "body": "I super love Kat Musni Fitness on Youtube. \n\nShe got lots of 30+ minute dumbbell workouts for all parts of the body. She also has a \"beginner workouts\" playlist that might be a good place to start?", "created_utc": "1603639526.0", "edited": "False", "id": "ga2d0an", "is_submitter": "False", "link_id": "t3_jhu3go", "parent_id": "t3_jhu3go", "score": "2", "subreddit": "xxfitness", "subreddit_id": "t5_2ryzy"}, {"author": "HiThereFellowHumans", "body": "There's definitely true potential for it being a reliable and lucrative career, especially since hourly and project rates can be quite high once you've got some experience under your belt.  \n\nIt all depends on what you want from your job, to be honest. For example, I don't have much interest in getting to 6 figures (although I suppose if I agreed to more projects and did a bit more hustling, this could be possible). \n\nBut because my hourly rate is quite high and I work as a contractor, copywriting allows me to make a comfortable salary with a very flexible schedule for wayyyy fewer hours than your average job. As someone who likes to spend several months out of each year traveling (during non-pandemic times, obviously) and dedicate time to other hobbies (running, language learning, spending time with friends/family, etc.), I'd much rather have this flexibility than 6 figures.   \n\nSo to answer your question about what causes the disparity...sure, there's going to be some people out there struggling to make copywriting a viable career which would pull down the average salary. But I'd imagine that there are far more people like me who value their job for its other benefits but just may not be interested in the hustle that comes with 100k/year.", "created_utc": "1603639235.0", "edited": "False", "id": "ga2ci02", "is_submitter": "False", "link_id": "t3_jhioyk", "parent_id": "t3_jhioyk", "score": "4", "subreddit": "copywriting", "subreddit_id": "t5_2qq49"}, {"author": "HiThereFellowHumans", "body": "Man, IT bands suck.   \n\n\nWhile rest and stretching are a good start, 110% the best thing I did for it was strengthening (general strengthening - legs, core, etc. - and ITB specific stuff).   \n\n\nThis is the ITB specific routine I started adding after runs 3-4 days a week: [https://strengthrunning.com/2011/02/the-itb-rehab-routine-video-demonstration/](https://strengthrunning.com/2011/02/the-itb-rehab-routine-video-demonstration/)   \n\n\nThe website above also has some other strength stuff on the blog and whatnot, and it's made a big difference.   \n\n\nI mean, I had ITB issues for YEARS and as long as I keep up on my strength and don't increase my mileage too quickly (still trying to learn not to do that), it seems mostly under control.", "created_utc": "1602544358.0", "edited": "False", "id": "g8n1l9r", "is_submitter": "False", "link_id": "t3_ja091r", "parent_id": "t3_ja091r", "score": "8", "subreddit": "running", "subreddit_id": "t5_2qlit"}, {"author": "HiThereFellowHumans", "body": "Honestly, Copyhackers is amazing.   \n\n\nI personally think their paid course is 110% worth it, but there's also a ton of excellent free stuff there (like the tutorial tuesdays).", "created_utc": "1602537019.0", "edited": "False", "id": "g8mocxt", "is_submitter": "False", "link_id": "t3_j9vezp", "parent_id": "t1_g8lzpl3", "score": "5", "subreddit": "copywriting", "subreddit_id": "t5_2qq49"}, {"author": "HiThereFellowHumans", "body": "Ah, muito obrigada! Gosto muito do Fabio Porchat e não estou sorpresa que ele seja \"childfree\"", "created_utc": "1602362086.0", "edited": "False", "id": "g8d7r56", "is_submitter": "False", "link_id": "t3_j86oo2", "parent_id": "t1_g8cgs2h", "score": "2", "subreddit": "childfree", "subreddit_id": "t5_2qtwb"}, {"author": "HiThereFellowHumans", "body": "Mind sending me the article? I speak Portuguese and I'm curious. \n\n(PS: are you from Brazil? Portugal? Or another Lusophone country?)", "created_utc": "1602351679.0", "edited": "False", "id": "g8ccwx9", "is_submitter": "False", "link_id": "t3_j86oo2", "parent_id": "t3_j86oo2", "score": "2", "subreddit": "childfree", "subreddit_id": "t5_2qtwb"}, {"author": "HiThereFellowHumans", "body": "Not OP, but speak both and can pitch in :-) \n\nI learned Spanish first, so when I first started learning Portuguese, I definitely mixed them up. A lot. It very much felt like the better my Portuguese got, the worse my Spanish got which was a little disheartening (even if the Spanish also made it possible to learn Portuguese fairly quickly).  \n\nThat said, I don't honestly think there's any secret to avoiding this mix up except for practice, practice, practice. I still slip the occasional Portuguese word into my Spanish and vice versa, but after years of using both, I've finally gotten to a point where they are pretty well separated in my head.", "created_utc": "1602256311.0", "edited": "False", "id": "g881ds5", "is_submitter": "False", "link_id": "t3_j7f5sn", "parent_id": "t1_g874wlx", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "HiThereFellowHumans", "body": "Have you found a textbook that you like? I find good resources to be one of the hardest things about learning an Arabic dialect.   \n\n\nUnfortunately, I'm afraid I can't speak to a place for good Arabic exercises since I don't really do any structured grammar/other exercises (although I probably should...just haven't found a good resource).   \n\n\nIf you're concerned about pronunciation, I found [TalkInArabic.com](https://TalkInArabic.com) to be a good listening resource (although there's no structure - it's just a \"pick n' choose\" type of thing). [Forvo.com](https://Forvo.com) is also great to check on the pronunciation of individual words in just about any language. I also did a bit of Mango languages and thought it helpful. I believe they have Egyptian, so maybe worth giving a try?", "created_utc": "1602164133.0", "edited": "False", "id": "g83uwfz", "is_submitter": "True", "link_id": "t3_j6qjg5", "parent_id": "t1_g812ei3", "score": "1", "subreddit": "learn_arabic", "subreddit_id": "t5_2v4vi"}, {"author": "HiThereFellowHumans", "body": "Hey, thanks for this!   \n\n\nI actually did lessons for a while with him (he lives in Turkey, right?). I liked the structure and found it good for grammar, but his approach was a little too rigid for me in that it was 99% drills and not much direct real-world/normal life communication. \n\nBut perhaps I'll return and combine his lessons with my other teachers.", "created_utc": "1602089488.0", "edited": "False", "id": "g80odf2", "is_submitter": "True", "link_id": "t3_j6qjg5", "parent_id": "t1_g80c3bs", "score": "2", "subreddit": "learn_arabic", "subreddit_id": "t5_2v4vi"}, {"author": "HiThereFellowHumans", "body": "Hmm I guess I can't really peg a moment in which I consciously decided *not* to have children...it was more that I just never, ever had the slightest desire *to* have them, if that makes sense?   \n\n\nThere was just no single part of parenthood that I looked at and said \"yeah, I want that.\"  And I've never once regretted it.", "created_utc": "1601919427.0", "edited": "False", "id": "g7t5d72", "is_submitter": "False", "link_id": "t3_j5ibop", "parent_id": "t3_j5ibop", "score": "1", "subreddit": "childfree", "subreddit_id": "t5_2qtwb"}, {"author": "HiThereFellowHumans", "body": "My husband also got a vasectomy, and I feel you hard on the stigma around this (and just more generally around not having kids).   \n\n\nPerhaps you'd like to join us over in r/childfree? I think lots of people there can relate to this kind of pressure :-)", "created_utc": "1601915799.0", "edited": "False", "id": "g7sx5eo", "is_submitter": "False", "link_id": "t3_j5l6yi", "parent_id": "t3_j5l6yi", "score": "127", "subreddit": "TwoXChromosomes", "subreddit_id": "t5_2r2jt"}, {"author": "HiThereFellowHumans", "body": "Have you checked craigslist or facebook marketplace?   \n\n\nI had a really hard time finding them as well...but we found some guy giving them away for free on craiglists (a literal hero).", "created_utc": "1601683859.0", "edited": "False", "id": "g7gr7zg", "is_submitter": "False", "link_id": "t3_j3g58c", "parent_id": "t3_j3g58c", "score": "2", "subreddit": "xxfitness", "subreddit_id": "t5_2ryzy"}, {"author": "HiThereFellowHumans", "body": "Sorry that you went through this, what a sucky experience :-(   \n\n\nI did krav maga for a while as a form of self defense (plus it was fun!), and it made me feel a lot better. Not that I've been in a situation like this, thankfully, but I feel better equipped to deal if I needed to.   \n\n\nAlongside krav maga, my instructor also gave an \"Empowerment Self Defense Workshop for Women\" and it was GREAT. Highly recommend finding something like this if you can in your area. It was helpful for moments like this, but also just generally sticking up for yourself when sh\\*t goes down.", "created_utc": "1601683651.0", "edited": "False", "id": "g7gqw2s", "is_submitter": "False", "link_id": "t3_j43ka1", "parent_id": "t3_j43ka1", "score": "1", "subreddit": "xxfitness", "subreddit_id": "t5_2ryzy"}, {"author": "HiThereFellowHumans", "body": "First all, 100% agree on running being the most therapeutic :-)   \n\n\nI guess I don't know your whole situation, but I saw someone somewhere here say that some people just have bad biomechanics for running, and I think I might be one of them. \n\nBut after years of injuries/weird joint stuff, here's a list of things I've done that seem to let me run pretty smoothly these days: \n\n1) Avoid running on concrete for a bit (gravel road, grass, trail, etc.) -- I find this to be much kinder to my joints and I mostly run on trails if I can   \n2) Follow some sort of strength for runner's plan (could be a strength issue that's affecting your form and putting strain on your joints) -- there's a website called Strength Running that has lots of good stuff.   \n3) Do yoga or make sure you're keeping up with stretching/overall mobility (could also be a tightness somewhere that's affecting your form and putting strain on your joints - plus, I've found that yoga + all the balancing has been great for strengthening my ankles!)   \n   \n4) Do reverse calf raises all 3 ways -- meaning forward, outward, inward (I do these 3 times a week after each run and my shin splints are nill after years of having them all the time)   \n5) Get more minimalist shoes (I love love love my Saucony Kinvaras. They are much lighter than the previous Asics I used to wear and allow me to have more of a mid/fore foot strike than a heavy heel strike. NOTE: if you go this route, make sure you ease into it! If you entirely switch to a new style of shoes and running form overnight, you're setting yourself up for injury. You have to slowly transition into it)   \n6) Take some joint supplements? (I can't guarantee they work, but I'm paranoid about my joints/injuries so I religiously take glucosamine and collagen)   \n\n\nHope this helps because I'd be heartbroken if I couldn't run anymore... and good luck!", "created_utc": "1600882664.0", "edited": "False", "id": "g6c6lwo", "is_submitter": "False", "link_id": "t3_ixftrq", "parent_id": "t3_ixftrq", "score": "1", "subreddit": "xxfitness", "subreddit_id": "t5_2ryzy"}, {"author": "HiThereFellowHumans", "body": "Oh, this was so cool! Is there an app or anything you did to make this? Or did you literally just film a short video everyday and put it all together?", "created_utc": "1600620139.0", "edited": "False", "id": "g5zx6ne", "is_submitter": "False", "link_id": "t3_iwekcc", "parent_id": "t3_iwekcc", "score": "6", "subreddit": "TwoXChromosomes", "subreddit_id": "t5_2r2jt"}, {"author": "HiThereFellowHumans", "body": "Você quer usar um recurso de graça? Ou quer pagar para um curso? \n\nSe você esta disponivel a pagar, posso recomendar muito os cursos de Francês de Olly Richards aqui: https://www.iwillteachyoualanguage.com/learn/french/courses\n\nEu fiz alguns e gostei muito.\n\nTambém, acho que a melhor coisa que você pode fazer é achar um \"private language teacher\" em italki ou verbling. Foi a coisa mais útil que fiz para meu Francês (e meu Português tbm haha)   \n\nBoa sorte!", "created_utc": "1600350223.0", "edited": "False", "id": "g5l18iq", "is_submitter": "False", "link_id": "t3_iu8l10", "parent_id": "t3_iu8l10", "score": "1", "subreddit": "Idiomas", "subreddit_id": "t5_u3gok"}, {"author": "HiThereFellowHumans", "body": "I agree with those who said strengthening your core....but I've also found I get back pain if my hips are really tight. So, perhaps adding a bit of yoga or just hip stretches (nothing fancy...low lunges do the job) may help", "created_utc": "1600118117.0", "edited": "False", "id": "g5ac4ue", "is_submitter": "False", "link_id": "t3_iss5wh", "parent_id": "t3_iss5wh", "score": "10", "subreddit": "XXRunning", "subreddit_id": "t5_3ft56"}, {"author": "HiThereFellowHumans", "body": "So yes, I do have a Lusophone spouse from Brazil which makes a BIG difference (the cliché about it being the best way to learn a language is 100% true). And I already spoke Spanish and we visit Brazil each summer, so it really just made sense for me to learn. \n\nWith the Spanish background, I guess it really didn't take too long for me to become conversational and understand much of what was being said. But getting to an advanced level (or \"fluent\" as you call it...although I think that's an incredibly subjective term) takes time. \n\nThat said, YES THERE ARE STILL SO MANY DOUBTS. Honestly, my Portuguese is strong (C1 tested) and I can get around perfectly fine. That said, I do struggle with my Portuguese sometimes even today (especially when I'm under pressure...ex. speaking with the intimidating in-laws gets me way tongue tied haha). And it gets frustrating when I'm just not quite able to express myself as well as I could in my native language...and there's plenty of times where I feel discouraged because even after many years of using Portuguese, there's still plenty I don't know about the language.  \n\nHonestly, I think the doubt is just part of language learning and getting discouraged from time to time is going to happen. The key is to just keep powering through despite it since it really is a journey. And going into with the assumption that you'll \"always be learning\" in some capacity helps. \n\n(PS: hope Brazil works out next year! What city will you be going to?)", "created_utc": "1599666857.0", "edited": "False", "id": "g4k1ugb", "is_submitter": "False", "link_id": "t3_ip6gbv", "parent_id": "t3_ip6gbv", "score": "3", "subreddit": "Portuguese", "subreddit_id": "t5_2sqn7"}, {"author": "HiThereFellowHumans", "body": "If you're already at a B2 in Spanish, then I'd say go for it! Especially since Spanish will help a ton with the French.   \n\n\nActually, the best thing you can do (at least in my experience) is \"laddering\" the languages. In other words, try to learn French through Spanish rather than through English.", "created_utc": "1599577838.0", "edited": "False", "id": "g4g46s2", "is_submitter": "False", "link_id": "t3_iorrfr", "parent_id": "t3_iorrfr", "score": "11", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "HiThereFellowHumans", "body": "Haha it IS hard! \n\nWell, then those can be some easier \"excuses\" for you to try out in the meantime :-)", "created_utc": "1599572477.0", "edited": "False", "id": "g4fupb7", "is_submitter": "False", "link_id": "t3_iodhay", "parent_id": "t1_g4f4ebd", "score": "2", "subreddit": "TwoXChromosomes", "subreddit_id": "t5_2r2jt"}, {"author": "HiThereFellowHumans", "body": "Kudos to you for being direct about it, honestly. I'm currently working on being more assertive, but in most scenarios I'd probably just say \"sure\" :-/    \n\n\nBut one thing I did try the other day was to take advantage of the pandemic. So I said that yes, I could answer a question. But could he please stay where he was since I'm immunocompromised and need to be extra careful about the pandemic and not getting too close to others.    \n\n\nHonestly, I'm not immunocompromised and I feel hard for those who are... but this allowed me to keep some distance between us just in case. Thankfully, he was pretty harmless and actually did just want directions and 100% respected my request for space.   \n\n\nOf course, you may also run into an a-hole who then wants to argue with you about the pandemic which doesn't help...in which case, I've seen people have luck saying they are off-duty nurses who want to keep their distance to \"protect\" you. Even if people don't care enough about *your* health, they usually aren't willing to take the chance on *their own*.   \n\n\nAlternatively, I sometimes have headphones in and just pretend that I can't hear them. Or occasionally pretend that I don't speak the same language they do  (which may or may not work depending on where you are).", "created_utc": "1599514125.0", "edited": "False", "id": "g4dp9qq", "is_submitter": "False", "link_id": "t3_iodhay", "parent_id": "t3_iodhay", "score": "4", "subreddit": "TwoXChromosomes", "subreddit_id": "t5_2r2jt"}, {"author": "HiThereFellowHumans", "body": "Haha I'm of the opposite mind! I've done most of her challenges, but her 2 most recent ones (Home & True) are definitely my favorites over her older ones. \n\nThat said, she has like 6 altogether and if you go to her website and click \"free yoga videos\" on the menu at the top, you can find all of them.", "created_utc": "1598967681.0", "edited": "False", "id": "g3l4amp", "is_submitter": "False", "link_id": "t3_ikb0yr", "parent_id": "t1_g3kw953", "score": "7", "subreddit": "xxfitness", "subreddit_id": "t5_2ryzy"}, {"author": "HiThereFellowHumans", "body": "Dang, so many of you here don't eat anything before you run in the morning! How do you survive???   \n\n\nOn the 2 occasions I've tried it, not eating before makes me feel like absolute nauseous trash.", "created_utc": "1597843639.0", "edited": "False", "id": "g23l3w4", "is_submitter": "False", "link_id": "t3_ic2zab", "parent_id": "t3_ic2zab", "score": "1", "subreddit": "XXRunning", "subreddit_id": "t5_3ft56"}, {"author": "HiThereFellowHumans", "body": "As someone who lived in Brussels and loved it, I'm seconding this! \n\nI think it's something crazy like 1/3 of the city are not Belgian.", "created_utc": "1597329311.0", "edited": "False", "id": "g1bximt", "is_submitter": "False", "link_id": "t3_i8h1e6", "parent_id": "t1_g194a0j", "score": "2", "subreddit": "digitalnomad", "subreddit_id": "t5_2r9w0"}, {"author": "HiThereFellowHumans", "body": "I'm not sure if it helps, but my 5K and half marathon times are comparable to yours, and I run my easy runs at 10:30-12:00 pace. For me, 8-min miles would be reserved for tempo workouts, definitely not slow run days. \n\nIt felt super weird at first and took me a while to actually admit that yes, it really is okay to slow down. But now that I've gotten used to it and truly keep my easy runs easy, I've found that my times have actually improved, I recover better, and am less likely to get injured.", "created_utc": "1596655344.0", "edited": "False", "id": "g0h7c6d", "is_submitter": "False", "link_id": "t3_i47kz9", "parent_id": "t1_g0gyd9q", "score": "2", "subreddit": "running", "subreddit_id": "t5_2qlit"}, {"author": "HiThereFellowHumans", "body": "Nothing wrong with a bit of slow, easy running!\n\nBut if you don't mind me saying, during your previous training...any chance you are running your easy runs too fast? (Or perhaps you've got some more potential in ya for the half time :-) \n\nMy half pace is under 8:30/mile, but my easy pace is 10:30-12:00/mile (or a 2+ min difference VS your 20-second difference). \n\nMay be something to evaluate as you keep on getting back out there. Especially because I personally found that my times and rate of injury improve a LOT once I really started slowing down my easy days.", "created_utc": "1596655169.0", "edited": "False", "id": "g0h6xgi", "is_submitter": "False", "link_id": "t3_i47kz9", "parent_id": "t1_g0h1jqy", "score": "1", "subreddit": "running", "subreddit_id": "t5_2qlit"}, {"author": "HiThereFellowHumans", "body": "This 100%! One of the major reasons my husband and I worked was not just that our personalities meshed, but that our LIFESTYLES (meaning no children and rather nomadic) did. \n\nI mean, as much as I love him for other reasons, I don't think we could have stayed together if kids and a big family were a major priority for him.", "created_utc": "1596646971.0", "edited": "False", "id": "g0gpe41", "is_submitter": "False", "link_id": "t3_i41st1", "parent_id": "t1_g0gnsdh", "score": "5", "subreddit": "childfree", "subreddit_id": "t5_2qtwb"}, {"author": "HiThereFellowHumans", "body": "Mongolia. \n\nHands-down the most beautiful place I've ever ever been to.", "created_utc": "1596407039.0", "edited": "False", "id": "g05dlfh", "is_submitter": "False", "link_id": "t3_i2e83m", "parent_id": "t3_i2e83m", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "HiThereFellowHumans", "body": "Turns out the guy who got my dad already had MULTIPLE DWIs in various states. And was still driving legally. \n\nGlad to hear you're okay, at the very least. But scary to know that the driver is still out and about...\n\nNot sure if you're US or somewhere else with deeply flawed laws, but I wish the US was more strict and actually revoked licenses for drunk driving like many other countries do.", "created_utc": "1596312093.0", "edited": "False", "id": "g00mssa", "is_submitter": "False", "link_id": "t3_i1td5t", "parent_id": "t1_g00macs", "score": "14", "subreddit": "childfree", "subreddit_id": "t5_2qtwb"}, {"author": "HiThereFellowHumans", "body": "My father was killed by a drunk driver (while standing inside a building nonetheless) and unfortunately they don't always end up behind bars nearly as often nor as long as they should\n\nAlso, the legal battles to get them there can be a real b*tch depending on the circumstance. So here's to hoping at least that part of things is smooth for OP so she doesn't have yet another thing on her plate to deal with.", "created_utc": "1596311768.0", "edited": "False", "id": "g00m6uu", "is_submitter": "False", "link_id": "t3_i1td5t", "parent_id": "t1_fzzun6d", "score": "20", "subreddit": "childfree", "subreddit_id": "t5_2qtwb"}, {"author": "HiThereFellowHumans", "body": "Def might be a regional thing because I'm also a native English speaker and \"I just got the notice\" is perfectly okay (and is actually probably how I would say it)", "created_utc": "1596050153.0", "edited": "False", "id": "fznf8h1", "is_submitter": "False", "link_id": "t3_hzy4ph", "parent_id": "t1_fzmo501", "score": "4", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "HiThereFellowHumans", "body": "Yes, mask wearing actually is completely normalized in much of east Asia! \n\nI lived in Korea for a while and wearing masks is completely commonplace for all ages (even my kindergarten students wore them sometimes). I mean, I saw people wearing masks (and even had one of my own) all the time and no one ever bat an eye nor complained.  \n\nSometimes they wore them on days when the pollution was really bad, sometimes because someone at home was sick and they didn't want to spread it, or because they had a cold themselves and didn't want to spread. It's honestly not that hard to do so I just like....don't get why it's such a big issue in other parts of the world?", "created_utc": "1596048231.0", "edited": "False", "id": "fznb4jq", "is_submitter": "False", "link_id": "t3_hzxvwt", "parent_id": "t1_fzmbbsx", "score": "1", "subreddit": "WhitePeopleTwitter", "subreddit_id": "t5_35n7t"}, {"author": "HiThereFellowHumans", "body": "Yikes well...they always say learning a language for love is the best way to learn! \n\nIn all seriousness though, if money isn't an issue, get yourself a private French teacher from Italki or Verbling and take as many classes a week as you possibly can. I've done this in several languages and it is 110% the most efficient way to learn a language.  \n\nBe sure to tell the teacher that you have a specific goal (namely, a trip to Paris where you need to get around smoothly). This way, instead of focusing and wasting time on terms/situations that you may not need to deal with, they can help you learn vocab and practice for the situations that you do (ex. buying tickets, asking for directions, ordering food at restaurants). \n\nAlongside the private lessons, rather than use free Duolingo, I'd pay for Rocket Languages. I found it pretty useful when I first started French as it allows you to practice your listening, pronunciation, grammar, vocab, etc. all at once. \n\nI'd also get started listening to French fairly early on so you start getting a feel for the rhythm of the language. Coffee Break French is a good beginner podcast. And Inner French is great for when you get to more of an intermediate level.  \n\nAny chance you speak any other language beyond English already? Because if you speak another related language like Spanish or Portuguese, you could definitely get to a conversational level of French in that time period.", "created_utc": "1595948016.0", "edited": "False", "id": "fzin31z", "is_submitter": "False", "link_id": "t3_hzddl6", "parent_id": "t3_hzddl6", "score": "3", "subreddit": "French", "subreddit_id": "t5_2rd5t"}, {"author": "HiThereFellowHumans", "body": "Happy to help and good luck out there! \n\nHopefully, you won't run into pushier people as you get into those \"prime child birthing\" years. I still don't think my mom believes me when I say we don't plan to have kids (although I didn't tell her my husband had a vasectomy...no need to crush her lingering hope), but at least she has stopped asking. My in-laws on the other hand...", "created_utc": "1595947215.0", "edited": "False", "id": "fzilji7", "is_submitter": "False", "link_id": "t3_hycz3z", "parent_id": "t1_fzclydn", "score": "2", "subreddit": "TwoXChromosomes", "subreddit_id": "t5_2r2jt"}, {"author": "HiThereFellowHumans", "body": "I'm 27 and married to a wonderful man who is also not interested in kids. I've never, ever believed kids to be in my future and have not ever changed my mind (despite the millions of times I've heard I would). I've also never once doubted in the slightest that this was the right decision for me (or us). \n\nOf course, it's always possible that you will change your mind someday. And there's nothing wrong with that! But I think the important thing here is that you change your mind because you truly want to and not just because society/family/friends have pressured you into it. Nor because you believe that you are expected to do so.   \n\nBecause honestly, judging by the fact that people are telling you that you'll \"change your mind,\" both the pressure and the expectation for you to have kids are very real. Not to mention, there's a pretty significant stigma that I've personally encountered around women who choose not to have children.  \n\nAnd while many people are great parents who truly wanted to be parents, honestly kids just aren't for everyone. And I wish people would stop believing that they are (a little like how everyone assumes that going to college and getting a 4-year degree is the only option).  \n\nSo yes, you'll likely continue to hear this for a long, long time if that is the decision you make. But just keep in mind that the decision is your own.", "created_utc": "1595802897.0", "edited": "False", "id": "fzchtmk", "is_submitter": "False", "link_id": "t3_hycz3z", "parent_id": "t3_hycz3z", "score": "7", "subreddit": "TwoXChromosomes", "subreddit_id": "t5_2r2jt"}, {"author": "HiThereFellowHumans", "body": "Do you have to stay in the same time zone and still work US hours, though? Or can you pick your hours?", "created_utc": "1595771873.0", "edited": "False", "id": "fzauug1", "is_submitter": "False", "link_id": "t3_hy2af3", "parent_id": "t1_fza4no5", "score": "3", "subreddit": "digitalnomad", "subreddit_id": "t5_2r9w0"}, {"author": "HiThereFellowHumans", "body": "Copywriter here. And I don't use word nor Skype, but Google Docs and Zoom :-)", "created_utc": "1595541638.0", "edited": "False", "id": "fz0yrr7", "is_submitter": "False", "link_id": "t3_hwivbd", "parent_id": "t1_fz0rnl7", "score": "2", "subreddit": "digitalnomad", "subreddit_id": "t5_2r9w0"}, {"author": "HiThereFellowHumans", "body": "Haha yes, it's possible! \n\nUnfortunately, I wasn't able to be this picky about clients upfront since  I was really just trying to get experience. But now that my client load is more stable (well, outside of the pandemic that is), I can be more selective with who I work with.", "created_utc": "1595524614.0", "edited": "False", "id": "fyzylbj", "is_submitter": "False", "link_id": "t3_hvjl01", "parent_id": "t1_fyxgpjy", "score": "1", "subreddit": "copywriting", "subreddit_id": "t5_2qq49"}, {"author": "HiThereFellowHumans", "body": "This can be a bit tricky. \n\nBut I think you can get quite a good read on things simply from talking to the client. For example, if they can't tell you why their product/service is better than the alternatives or if they can't seem to offer you any good reason for why someone should work with them (other than that the client you're speaking with wants more money), that's a bit of a warning. Also get a read on how they talk about their product/service...do they seem to have some pride (but not arrogance) about what they've created? And do they talk about their own clients with respect and empathy for the pain points that they are experiencing? Or do they speak about them as if they are merely a means to an end? \n\nI find it can also be pretty insightful asking a client how/why they got into the field that they are now. Is it because they wanted to help their own clients in some capacity and knew they had the skillset to do so? \n\nFor example, one client that I worked with was a breakup/dating coach. Honestly, I had some pretty bad impressions of her industry, but she scheduled a consultation so I figured I'd chat with her. After speaking with her, any hesitations I had about working with her were thrown out the window. As she explained, she chose to go into this type of work after going through a traumatic breakup (broken engagement) of her own. She learned a lot throughout the experience and wanted to help others go through the same challenges. She came across as incredibly genuine and was really able to support, in detail, how she could actually help clients (another major thing to look for - if they can't confidently tell you how this can help their audience, then it's a no go). Plus, she took on distinctly non-slimy approach to it (wayyy different from anyone else in her industry). \n\nIn certain circumstances, you may be able to try the product/service yourself. For example, if they are selling a course you can go through the course yourself and see if you think it's useful and worth the selling price. \n\nBut above all, probably the absolute best thing you can do is look to testimonials, case studies, or other 3rd-party reviews they might have. After all, if the clients/customers are saying they've been helped and received value from working with your client, this is much better proof of the quality of the service than the client simply telling you about it. \n\nIn the best case scenario, you'd actually be able to interview a few of your client's clients directly (I do this often before I begin writing to get insights) and hear how they talk about the product/service. For example, I did this with the clients of the breakup coach above, and I was honestly blown away by how much my client had impacted their lives. In which case, I knew I made the right choice by working with her because I was 110% sold on her skills and my work would ultimately help her help more people. \n\nI've also conducted these client interviews for a small business IT company (whose services were saving the poor overworked office managers who got stuck dealing with IT issues 5+ hours each week....so clearly a genuinely good service) and for a succession planner (a field a usually stay away from, but he brought incredible piece of mind to his clients and really helped them navigate familial issues that they wouldn't have gotten through otherwise, so I took him on). \n\nUnfortunately, you probably won't be able to do these interviews until after you've already taken the job (seems highly unlikely a client would allow you to interview their client when you're not yet working for them). But definitely see if you can get some insight on what their clients are saying elsewhere before you make your decision.", "created_utc": "1595443458.0", "edited": "False", "id": "fywe1pf", "is_submitter": "False", "link_id": "t3_hvjl01", "parent_id": "t1_fyu1rgk", "score": "1", "subreddit": "copywriting", "subreddit_id": "t5_2qq49"}, {"author": "HiThereFellowHumans", "body": "Just tried as well and same here", "created_utc": "1595435522.0", "edited": "False", "id": "fyvx6y8", "is_submitter": "False", "link_id": "t3_hvsces", "parent_id": "t1_fyvu7g8", "score": "5", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "HiThereFellowHumans", "body": "I felt this way as well when I first got into copywriting. \n\nWhat I've found the solution to be is simple: only work with clients who actually sell a good service/product that will genuinely help their clients.", "created_utc": "1595383532.0", "edited": "False", "id": "fytx7vw", "is_submitter": "False", "link_id": "t3_hvjl01", "parent_id": "t3_hvjl01", "score": "7", "subreddit": "copywriting", "subreddit_id": "t5_2qq49"}, {"author": "HiThereFellowHumans", "body": "Right? Thankfully, Belgium wasn't quite as strict as neighboring France or Spain (in that we were still able to go outdoors for \"exercise\" so I could walk, run, bike - truly a lifesaver), but I didn't go farther than walking or short biking distance from my apartment for like 4 months. \n\nWhereas my friends in the US (depending on where they were, obviously) could just hop in their cars and at least go for a drive and see something new/just get out of their apartments even if everything was closed.", "created_utc": "1595364359.0", "edited": "False", "id": "fysya10", "is_submitter": "False", "link_id": "t3_hv4dxz", "parent_id": "t1_fysluq3", "score": "3", "subreddit": "digitalnomad", "subreddit_id": "t5_2r9w0"}, {"author": "HiThereFellowHumans", "body": "Welp, I just moved back to the US unfortunately in the interest of not losing my husband's green card (was a tough decision about whether to simply forfeit it or not given the American situation...but we decided it was too valuable to give up), but up until very recently was living in Brussels, Belgium. \n\nYeah, the lockdown was a LOT stricter there than it was most places in the US (which is why I can't help but laugh when Americans talk about \"lockdown\"....I could hardly leave my house legally), but at least I felt safer. Sure, the response wasn't perfect and there were/are definitely still issues with irresponsible people going against health regulations, but at least I have a little more faith in their structures and social system, ya know? \n\nBy the time we left, Belgium was quite stable and quite open and life was actually feeling pretty normal (able to travel domestically, actually see friends, etc.)....so it felt way weird to be leaving that to come back to the US. \n\nPlus, I had real health coverage (funnily enough, it's my same European insurance plan that is covering me now that I'm back in the US - it's just emergency coverage though, which isn't great). \n\nI had a temporary residence that expired in May that I was worried about extending, but I think they were making a lot of concessions for people like me and I somehow got a 5-year residence card. So luckily, I didn't have to worry about my passport. That said, I didn't travel outside of Belgium while living there and I'm 100% sure what would have happened if I did even if I had the European residency.", "created_utc": "1595347093.0", "edited": "False", "id": "fyryf7x", "is_submitter": "False", "link_id": "t3_hv4dxz", "parent_id": "t3_hv4dxz", "score": "5", "subreddit": "digitalnomad", "subreddit_id": "t5_2r9w0"}, {"author": "HiThereFellowHumans", "body": "There's no way your 10k pace is the same as your 5k pace though? Or am I doing something way wrong? \n\nBecause my 10k pace per mile is a full 30 seconds slower per mile.", "created_utc": "1595017043.0", "edited": "False", "id": "fye8rwp", "is_submitter": "False", "link_id": "t3_hszeyx", "parent_id": "t1_fydrr8e", "score": "21", "subreddit": "running", "subreddit_id": "t5_2qlit"}, {"author": "HiThereFellowHumans", "body": "Honestly what I was thinking when I saw. Yeah, I'm American and yeah, it's mildly annoying. But I'm not going to be out there complaining about it when there's a pandemic and this is literally always the reality of so many people permanently.", "created_utc": "1594912857.0", "edited": "False", "id": "fy9doyq", "is_submitter": "False", "link_id": "t3_hs0wze", "parent_id": "t1_fy9bmsc", "score": "9", "subreddit": "digitalnomad", "subreddit_id": "t5_2r9w0"}, {"author": "HiThereFellowHumans", "body": "Oh, is it? In that case, I'll change my description and thank you   \n\n\nAny secret you have for being able to tell the difference as a non-native speaker?", "created_utc": "1594835736.0", "edited": "False", "id": "fy60jdo", "is_submitter": "True", "link_id": "t3_hrru3v", "parent_id": "t1_fy5zfmr", "score": "1", "subreddit": "learn_arabic", "subreddit_id": "t5_2v4vi"}, {"author": "HiThereFellowHumans", "body": "100% agreed there! \n\nObviously I can't speak to where they get all their funding, but I was curious about them and joined their mailing list and they are asking for donations pretty aggressively. So I'd imagine they've raised quite a lot (2.6 mil in total contributions, according to a quick online search). I'm not Republican, but I personally donated a bit because I wanted their \"rich mitch\" ad slamming mitch mcconnell to run in Kentucky. So I'd assume there are others like me out there + obviously some bigger contributors (who I don't know enough about to have an opinion on at this point)", "created_utc": "1594323676.0", "edited": "False", "id": "fxgepnf", "is_submitter": "False", "link_id": "t3_ho0lq9", "parent_id": "t1_fxfevkx", "score": "2", "subreddit": "facepalm", "subreddit_id": "t5_2r5rp"}, {"author": "HiThereFellowHumans", "body": "Based on what I can tell, they are backing Biden purely out of being a part of the \"never Trump\" crowd, not because they are actually aligned with Biden. But TBD I guess", "created_utc": "1594322913.0", "edited": "False", "id": "fxgd4b0", "is_submitter": "False", "link_id": "t3_ho0lq9", "parent_id": "t1_fxfk18d", "score": "1", "subreddit": "facepalm", "subreddit_id": "t5_2r5rp"}, {"author": "HiThereFellowHumans", "body": "This may be true, but at this point they are officially backing Biden and doing whatever they can to make sure Trump doesn't win, so I'll take 'em (even if I may not agree with many more conservative policies personally). \n\nThey are also doing more than just tweeting. They are running tons and tons of ads all over areas with a high concentration of Trump voters. Highly recommend looking some up, since I think they really have the potential to make a difference if the ads get in front of the right people.", "created_utc": "1594306206.0", "edited": "False", "id": "fxfe12m", "is_submitter": "False", "link_id": "t3_ho0lq9", "parent_id": "t1_fxfd7xf", "score": "0", "subreddit": "facepalm", "subreddit_id": "t5_2r5rp"}, {"author": "HiThereFellowHumans", "body": "Like other people have said here, I don't honestly think there is any secret other than lots and lots and lots of exposure to active listening. \n\nHowever, while listening to native-level things is a good habit to get started on (ex. watching Portuguese Netflix), I'd recommend focusing on lower-level listening tools that you understand a good chunk of to work your way up on. Because watching a show that you don't understand much of may not be a whole lot of help now other than to help you get a feel for the cadence of a language. That said, native-level material can be amazing when you get stronger in your listening skills. \n\nI think I've recommended this before, but Semantica Portuguese was really really good for my comprehension. I'd also recommend finding a Portuguese podcast for learners (but one that focuses on going through dialogues/discussing a topic, not one that talks about a new grammatical point for the day or anything like that). I'm not sure where your level is at now, but I enjoyed Carioca Connection. Or just google \"portuguese podcast for learners\" or \"portuguese podcast for XXX level\" and you should be able to find something that interests you. \n\nI'd definitely look around for some transcripts of the podcast. Then, you can try listening once or twice without the transcript, try listening while reading the transcript, then listen again without the transcript to see what new things you understand. It's a great way to tune your ears.", "created_utc": "1594230956.0", "edited": "False", "id": "fxc3izo", "is_submitter": "False", "link_id": "t3_hnddoe", "parent_id": "t3_hnddoe", "score": "2", "subreddit": "Portuguese", "subreddit_id": "t5_2sqn7"}, {"author": "HiThereFellowHumans", "body": "Hey, any chance you figured this out? I just moved to DC and bought a car from a private seller and managed to get it home...but then realized I can't drive it anymore because I can't get tags haha", "created_utc": "1594156054.0", "edited": "False", "id": "fx8v0gs", "is_submitter": "False", "link_id": "t3_hewu56", "parent_id": "t1_fvu19zh", "score": "1", "subreddit": "washingtondc", "subreddit_id": "t5_2qi2g"}, {"author": "HiThereFellowHumans", "body": "Agreed with the Olly Richards book!", "created_utc": "1592219613.0", "edited": "False", "id": "fuw3bqi", "is_submitter": "False", "link_id": "t3_h9da3t", "parent_id": "t1_fuw0095", "score": "3", "subreddit": "Portuguese", "subreddit_id": "t5_2sqn7"}, {"author": "HiThereFellowHumans", "body": "People always seem to forget about neighboring Belgium for learning French, so as someone who lives here and loves it, allow me to throw it in as an option :-) \n\nWhen I first moved here, I took some intensive courses at the Alliance Francais in Brussels and really learned a lot from them. Compared to other schools, the price is quite reasonable. And if you're concerned about other costs, Brussels is certainly cheaper than Paris. Plus, people are quite friendly here and very supportive/patient of your French attemps.", "created_utc": "1591276192.0", "edited": "False", "id": "fsuubxo", "is_submitter": "False", "link_id": "t3_gwed37", "parent_id": "t3_gwed37", "score": "4", "subreddit": "French", "subreddit_id": "t5_2rd5t"}, {"author": "HiThereFellowHumans", "body": "At the Mountains of Madness by Lovecraft is a class about this topic", "created_utc": "1591181727.0", "edited": "False", "id": "fsqgshk", "is_submitter": "False", "link_id": "t3_gvlgsf", "parent_id": "t3_gvlgsf", "score": "21", "subreddit": "printSF", "subreddit_id": "t5_2rzjk"}, {"author": "HiThereFellowHumans", "body": "Got it, thanks for the response. The fact that he was actively voted in is seriously worrisome.", "created_utc": "1591046460.0", "edited": "False", "id": "fskfpmr", "is_submitter": "False", "link_id": "t3_gur06n", "parent_id": "t1_fska0b2", "score": "6", "subreddit": "Minneapolis", "subreddit_id": "t5_2r3bl"}, {"author": "HiThereFellowHumans", "body": "I'm not really sure of the structure of city police...Can anyone speak to how Bob Kroll got into the position he was in? As in, was he actually elected and chosen by people?", "created_utc": "1591042459.0", "edited": "False", "id": "fsk7j7e", "is_submitter": "False", "link_id": "t3_gur06n", "parent_id": "t3_gur06n", "score": "4", "subreddit": "Minneapolis", "subreddit_id": "t5_2r3bl"}, {"author": "HiThereFellowHumans", "body": "Similiar to what you said....often, when I mention my husband had a vasectomy people come back with \"well, I've heard they can be reversed!\" \n\nRight. Because that's exactly the reason we had a what should be a permanent procedure done. It's like they just can't get it into their minds that the permanent aspect was deliberate.", "created_utc": "1589709502.0", "edited": "False", "id": "fqwm2vo", "is_submitter": "False", "link_id": "t3_gl83tx", "parent_id": "t3_gl83tx", "score": "26", "subreddit": "childfree", "subreddit_id": "t5_2qtwb"}, {"author": "HiThereFellowHumans", "body": "I haven't seen Neville's (the guy behind kopywriting kourse)youtube channel, but there's honestly a lot of really good free content on the website (can't vouch for any of the paid stuff though since I haven't taken it myself).", "created_utc": "1589632643.0", "edited": "False", "id": "fqt7x0v", "is_submitter": "False", "link_id": "t3_gkpk6d", "parent_id": "t3_gkpk6d", "score": "6", "subreddit": "copywriting", "subreddit_id": "t5_2qq49"}, {"author": "HiThereFellowHumans", "body": "Honestly, the logic of the root system is one of my favorite things about Arabic. \n\nThat said, how the heck do you all keep the words separate and not mix them up because they are so similar?!\n\nI have such a hard time with this and shamelessly mix up various root-related words while speaking.", "created_utc": "1589448234.0", "edited": "False", "id": "fql6s24", "is_submitter": "False", "link_id": "t3_gjdqrl", "parent_id": "t3_gjdqrl", "score": "5", "subreddit": "learn_arabic", "subreddit_id": "t5_2v4vi"}, {"author": "HiThereFellowHumans", "body": "Any other books by Vandermeer you can recommend? I really enjoyed the Southern Reach and would like to read some more of his work", "created_utc": "1589116326.0", "edited": "False", "id": "fq5sl9n", "is_submitter": "False", "link_id": "t3_ggy32k", "parent_id": "t1_fq5i5ze", "score": "6", "subreddit": "printSF", "subreddit_id": "t5_2rzjk"}, {"author": "HiThereFellowHumans", "body": "I fully support your goal to learn Spanish, but I've gotta tell you that \"fluent Japanese in around 2 weeks\" is 100% not possible (even with full immersion this takes months)", "created_utc": "1589116126.0", "edited": "False", "id": "fq5sc71", "is_submitter": "False", "link_id": "t3_ggqp6q", "parent_id": "t1_fq4swp9", "score": "7", "subreddit": "gatekeeping", "subreddit_id": "t5_3fkyp"}, {"author": "HiThereFellowHumans", "body": "Sense8. 100% one of the best and most beautiful shows I've ever seen. Huge shame that it was canceled.", "created_utc": "1588925187.0", "edited": "False", "id": "fpuvjp9", "is_submitter": "False", "link_id": "t3_gfjiul", "parent_id": "t3_gfjiul", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "HiThereFellowHumans", "body": "I'm going to have to agree here as I was going to write something similiar. While we all go through slumps with running and in some circumstances we just need to push through them (like when we're in the middle of training for a race), if I find myself at a point where I start to really dread running and not ejoy my runs at all, I simply take a break. \n\n\nDuring the break, I just focus on other types of exercise (weight training, yoga, biking etc...all of which conveniently make me a better running by the time I get back to it!). And usually after a period of time, my legs get that \"itchy\" feeling and I find myself actually wanting to run. And that's when I get back to it! \n\n\nThis is exactly what happened to me when the pandemic broke out and the lockdowns began. I was in the midst of training for 2 races that I was really excited for but then got cancelled, and I just generally felt overwhelmed/anxious/kinda depressed with everything and found that running felt like an absolute, miserable slog (and it didn't help that I live in a country with a quite strict lockdown so I couldn't venture far from home). \n\n\nSo, I just didn't run and focused on other forms of exercise until I got to the point where I wanted to run again. It took nearly 2 months, but I recently woke up and said \"hey, I really want to run today.\" \n\n\nAnd that's where I am today - sure, I've lost some of my running fitness, but I was still strength training and biking over the run break, so I'm just easing back into it. But most importantly, I'm enjoying it and looking forward to my runs again.", "created_utc": "1588688334.0", "edited": "False", "id": "fpk5f18", "is_submitter": "False", "link_id": "t3_gdxppk", "parent_id": "t1_fpk1uix", "score": "54", "subreddit": "running", "subreddit_id": "t5_2qlit"}, {"author": "HiThereFellowHumans", "body": "Também tem alguns casos/frases em que você usaria o subjunctivo em PTPT, mais não usaria em BRPT\n\nAh, e BRPT não usa \"duma\" (\"de uma\")", "created_utc": "1587219435.0", "edited": "False", "id": "fnsdsya", "is_submitter": "False", "link_id": "t3_g3c6j4", "parent_id": "t1_fnrfhp5", "score": "2", "subreddit": "Portuguese", "subreddit_id": "t5_2sqn7"}, {"author": "HiThereFellowHumans", "body": "For a Portuguese learner, they are pretty significantly different (much more different than say, Spanish from Spain vs. Spanish from South America, for example). I had been speaking Brazilian Portuguese very comfortably for about 5 years when I needed to do a test in European Portuguese, and even though my Brazilian Portuguese was very strong, I still had to re-learn a lot of things to actually pass the test (comprension in particular was a big challenge as was writing). \n\nThere's a good number of words that are different, some grammatical structures that are different, and the accents between the two are quite distinct. \n\nIn other words, I'd definitely choose one (whichever interests you more) to focus on. \n\nI do remember it being hard to find resources in European Portuguese before the test as well...but I found Portuguese Lab to be a really good resource if that's the direction you choose.\n\nAnd no matter which one you choose, I highly highly recommend getting a speaking partner and/or private tutor from Italki or Verbling", "created_utc": "1587219104.0", "edited": "False", "id": "fnsdan7", "is_submitter": "False", "link_id": "t3_g3c6j4", "parent_id": "t3_g3c6j4", "score": "2", "subreddit": "Portuguese", "subreddit_id": "t5_2sqn7"}, {"author": "HiThereFellowHumans", "body": "A MILLION PERCENT YES. \n\nI mean, I struggle with my own emotions constantly and spend a lot of my time anxious/in a mild existential crisis and \"adopt\" the emotions of those around me to an extent that's likely a bit unhealthy. No way I could handle a child and their emotions and, god forbid, the relatively high chances that something bad would actually happen to them", "created_utc": "1587211927.0", "edited": "False", "id": "fns3zwh", "is_submitter": "False", "link_id": "t3_g3i7tg", "parent_id": "t3_g3i7tg", "score": "6", "subreddit": "childfree", "subreddit_id": "t5_2qtwb"}, {"author": "HiThereFellowHumans", "body": "I agree with most of what people are saying here about moving on despite there being a lack of motivation, but I'm going to go against the grain slightly and say that, if you get to the point where it starts to feel like a serious chore (in other words, that you're no longer enjoying the language or the thought of studying it just makes you feel stressed out), then it really is okay to take a short break from the language. \n\nI do this from time to time and usually find that a week or two (occasionally more) is really all I need for a bit of a \"reset\" and to miss the language and get excited to be learning it again.  \n\nBut of course, the important thing is just that you make sure you actually go back to it :-)", "created_utc": "1587143232.0", "edited": "False", "id": "fnpcs34", "is_submitter": "False", "link_id": "t3_g2vosx", "parent_id": "t1_fnntqd6", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "HiThereFellowHumans", "body": "I'd truly like to know the logic they'd use to justify this.", "created_utc": "1587053532.0", "edited": "False", "id": "fnlha43", "is_submitter": "False", "link_id": "t3_g2dv38", "parent_id": "t1_fnktu1f", "score": "1", "subreddit": "politics", "subreddit_id": "t5_2cneq"}, {"author": "HiThereFellowHumans", "body": "Find a French teacher from quebec on italki or verbling", "created_utc": "1587053400.0", "edited": "False", "id": "fnlh0h7", "is_submitter": "False", "link_id": "t3_g282sq", "parent_id": "t3_g282sq", "score": "1", "subreddit": "learnfrench", "subreddit_id": "t5_2sucz"}, {"author": "HiThereFellowHumans", "body": "Not trying to argue here, but curious (since I live in Belgium but am not Belgian). In which ways do you feel Belgium has acted incompetently? Based on what I can tell, their reaction has been fairly similiar to its neighbors and with a comparable timeline (and actually stronger than, say, the Netherlands).", "created_utc": "1586851951.0", "edited": "False", "id": "fncypmn", "is_submitter": "False", "link_id": "t3_g0tmss", "parent_id": "t1_fncde6j", "score": "1", "subreddit": "TwoXChromosomes", "subreddit_id": "t5_2r2jt"}, {"author": "HiThereFellowHumans", "body": "I'm 27 and still hear this allll the time. So, gear up because because unfortunately you'll probably get this for a long time :-/", "created_utc": "1586769519.0", "edited": "False", "id": "fn9e75o", "is_submitter": "False", "link_id": "t3_g0csyc", "parent_id": "t3_g0csyc", "score": "16", "subreddit": "childfree", "subreddit_id": "t5_2qtwb"}, {"author": "HiThereFellowHumans", "body": "Hahaha this is gold. My husband and I are from different countries so if people irritate us, we just say he married me for the green card and I married him for the European passport.", "created_utc": "1586768743.0", "edited": "False", "id": "fn9di7a", "is_submitter": "False", "link_id": "t3_g09zaw", "parent_id": "t1_fn8x7u0", "score": "30", "subreddit": "childfree", "subreddit_id": "t5_2qtwb"}, {"author": "HiThereFellowHumans", "body": "Boa sorte e se cuida :-(", "created_utc": "1586765280.0", "edited": "False", "id": "fn9af6c", "is_submitter": "False", "link_id": "t3_fzxhcy", "parent_id": "t1_fn7n2sp", "score": "2", "subreddit": "Coronavirus", "subreddit_id": "t5_2x4yx"}, {"author": "HiThereFellowHumans", "body": "This is so crazy to me (husband is Brazilian so we are dealing with people he knows firsthand not taking it seriously). Just show them articles about Italy and Spain and tell them that could have been them without the quarantine. Frankly, I think it's better to feel like you've overracted when looking back on the event rather than regret underreacting (and thus being the cause for tens of thousands of preventable deaths) in the future. \n\nNot to mention, Brazil's deaths are likely wildely underreported: https://www.theguardian.com/global-development/2020/apr/04/medics-in-brazil-fear-official-coronavirus-tally-ignores-a-mountain-of-deaths", "created_utc": "1586723373.0", "edited": "False", "id": "fn7mnek", "is_submitter": "False", "link_id": "t3_fzxhcy", "parent_id": "t1_fn7jvmy", "score": "2", "subreddit": "Coronavirus", "subreddit_id": "t5_2x4yx"}, {"author": "HiThereFellowHumans", "body": "Mind posting the results of the survey once they are in? I'd be curious to see what they find!", "created_utc": "1586337522.0", "edited": "False", "id": "fmrw0cx", "is_submitter": "False", "link_id": "t3_fwzzmi", "parent_id": "t1_fmrf3cg", "score": "11", "subreddit": "childfree", "subreddit_id": "t5_2qtwb"}, {"author": "HiThereFellowHumans", "body": "Sorry, going to write this in English because feeling a bit lazy today ;-) \n\nI also spoke very good Spanish before learning Portuguese and learning Portuguese did some major damage to my Spanish for a while (especially because I'm married to a native Portuguese speaker so I spent way more time speaking in Portuguese than Spanish). Frankly, it took me several years until I really felt like I could transition back and forth with the languages without shamelessly mixing them up and could speak in Spanish properly without just thinking in Portuguese. Honestly, I don't think there is any secret here other than it just takes time (years, in my case, to get back to my original pre-Portuguese level of Spanish) and continual exposure. \n\nDepending on your levels in the languages, it might be helpful to make a point to keep your studies with each language separate (ex. half a week focused on Portuguese, half a week focused on Spanish without putting both languages on a single day). Although, I don't usually recommend actively studying two languages at once unless they are from very different language families....so maybe something more like an 80/20 split (80% of your time dedicated to improving your Portuguese with 20% of your time dedicated to not improving but maintaining your Spanish). Or perhaps you just focus on improving your level of Portuguese now and, once you're at a strong level, head back to focusing on Spanish for a while. \n \nAlternatively, one of the most useful things for me was to learn Portuguese through Spanish. At least for me, something about seeing how one works through the other and connects actually helped me keep them separate in my mind and helped me keep my Spanish fresh (ex. I'd translate new words from Portuguese to Spanish rather than Portuguese to English and also got a book in Spanish for learning Portuguese).", "created_utc": "1586255200.0", "edited": "False", "id": "fmodphz", "is_submitter": "False", "link_id": "t3_fw4q41", "parent_id": "t3_fw4q41", "score": "2", "subreddit": "Portuguese", "subreddit_id": "t5_2sqn7"}, {"author": "HiThereFellowHumans", "body": "Have you tried looking into refurbished iPods? I'm not sure if you can still find them, but I found an refurbished iPod nano somewhere online (don't remember exactly where, unfortunately). Refurbished is a safer bet than something that's used.", "created_utc": "1585925711.0", "edited": "False", "id": "fmbg6qg", "is_submitter": "False", "link_id": "t3_fu0oqt", "parent_id": "t3_fu0oqt", "score": "2", "subreddit": "nosurf", "subreddit_id": "t5_2st2y"}, {"author": "HiThereFellowHumans", "body": "This question is also not directed at me, but learning languages in the same family is a huge help. \n\nFor example, I spoke very good Spanish & Portuguese before beginning French. After about 4-5 months, I was conversational in French and could understand/read with a good amount of proficiency (notice how I didn't say I'm *fluent*....because I'm not, but I can use the language!). \n\nOn the other hand, I've been learning Arabic for the past 2.5 years or so. Despite the time, given that it's completely unlike any other language I've learned, I'd say my level of French is now above my Arabic and got there in a fraction of the time.", "created_utc": "1585819191.0", "edited": "1585819516.0", "id": "fm7abcc", "is_submitter": "False", "link_id": "t3_ft88xq", "parent_id": "t1_fm5sxh6", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "HiThereFellowHumans", "body": "Do you know where Omar is from or what dialect he speaks?", "created_utc": "1584970968.0", "edited": "False", "id": "fl9wa6f", "is_submitter": "False", "link_id": "t3_fnfchy", "parent_id": "t1_fl9sxzb", "score": "3", "subreddit": "learn_arabic", "subreddit_id": "t5_2v4vi"}, {"author": "HiThereFellowHumans", "body": "100% interested! Someone that's uh, we'll say \"very close to me\" was a legionaire so I'd love to hear more about this!", "created_utc": "1584714259.0", "edited": "False", "id": "fl0rpoc", "is_submitter": "False", "link_id": "t3_flfq2u", "parent_id": "t1_fkybfzs", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "HiThereFellowHumans", "body": "I think it's okay. \n\nI'm in a country that's in full lockdown right now (Belgium), where we aren't allowed to leave our houses except for groceries, medical-related things, or emergencies. This is even being monitered by the police. \n\nHowever, we are still allowed and even encouraged to go outside on an individual basis OR with someone who lives under the same roof as you to run/walk/exercise. Only okay with the expectation that we are keeping our distance from others. \n\nUnfortunately, some countries that had this privelage (like Spain) eventually made it forbidden as well because there were too many people in parks and in groups to some extent. So, hopefully that won't change here. \n\nIn other words, I think it's okay as long as you're smart about it.", "created_utc": "1584528295.0", "edited": "False", "id": "fktnw58", "is_submitter": "False", "link_id": "t3_fk8ppt", "parent_id": "t3_fk8ppt", "score": "1", "subreddit": "running", "subreddit_id": "t5_2qlit"}, {"author": "HiThereFellowHumans", "body": "Oh hey from Belgium as well! \n\nUnfortunately, I'm not getting quite as much quiet here because there is massive construction (whyyyy) happening on my apartment building right now :-( \n\nEdit: fixed an embarrassing spelling mistake\nIt's making it quite hard to work from home and participate in meetings with all the drilling!", "created_utc": "1584379186.0", "edited": "False", "id": "fko343v", "is_submitter": "False", "link_id": "t3_fjioj6", "parent_id": "t1_fkn6w2z", "score": "2", "subreddit": "childfree", "subreddit_id": "t5_2qtwb"}, {"author": "HiThereFellowHumans", "body": "I'm over in neighboring Belgium so schools are at least closed...but otherwise, this seems about right :-(", "created_utc": "1584281110.0", "edited": "False", "id": "fkkd8gd", "is_submitter": "False", "link_id": "t3_fiy3i1", "parent_id": "t3_fiy3i1", "score": "1", "subreddit": "starterpacks", "subreddit_id": "t5_34o9s"}, {"author": "HiThereFellowHumans", "body": "Hi...welcome to the club! \n\nIf you're truly new, there's a big risk of doing too much too fast. \n\nAnd if you're having a hard time acclimating to the breathing, I recommend doing two things: \n\n1. Don't be afraid to slow down to a pace that makes the breathing easier even if it feels way slow (faster paces can come into play later...not something for you to worry about yet while just getting started!) \n\n2. Also don't be afraid to walk and give yourself a minute or two to breathe (I know it's drilled into our heads not to do it...but it's really not a bad thing!). Even today, after years of running, I take these breaks from time-to-time if my body needs it. It might be helpful to look into one a run-walk program (just google for one) as a good starting point.", "created_utc": "1583511554.0", "edited": "False", "id": "fjnoj17", "is_submitter": "False", "link_id": "t3_fedi73", "parent_id": "t3_fedi73", "score": "2", "subreddit": "running", "subreddit_id": "t5_2qlit"}, {"author": "HiThereFellowHumans", "body": "Serious question: what justification did they all give for not voting if they care that much? \n\nI mean, I live overseas and I still found a way to vote.", "created_utc": "1583333842.0", "edited": "False", "id": "fjgrc53", "is_submitter": "False", "link_id": "t3_fdcdlc", "parent_id": "t1_fjggy8h", "score": "2", "subreddit": "SandersForPresident", "subreddit_id": "t5_2zbq7"}, {"author": "HiThereFellowHumans", "body": "To start, I'm sorry that happened to you, and I hope you are healing (both mentally and physically) as best you can. \n\nAnd no, I definitely do *not* think you are being unreasonable or pushy. And frankly, if he was as child free as he says he is, then a vasectomy is the obvious choice (particularly compared to the other others or the female procedure, which is much more invasive!). \n\nThat said, the hope would be that he comes to this decision on his own (unless he just happens to be really really uneducated about it as an option?) or is at least willing to discuss it with you. Thankfully, this wasn't an issue with my husband (he's amazing and actually came to me with the idea of him getting a vasectomy - I never had to ask or broach the topic). \n\nBut for better or worse, a vasectomy is still a big, (mostly) permanent decision that some dudes struggle to make. Could be that your partner actually has a few doubts about not having kids, worries that this will make him feel emasculated (I hate this argument, but it does seem relatively common), or just doesn't have the facts and thinks it's more of a surgical procedure than it is (and it's not - my husband was in-and-out in less than an hour, stayed fully awake, was able to work the next day, and was back to normal in all aspects in a couple of weeks). \n\nSo while opening up the discussion and presenting your thoughts/your arguments on it (which again, I think he should be willing to do), the decision is on him so you don't just cause resentment/regret from his side later on", "created_utc": "1582797497.0", "edited": "False", "id": "fiwq19w", "is_submitter": "False", "link_id": "t3_f953eo", "parent_id": "t3_f953eo", "score": "1", "subreddit": "childfree", "subreddit_id": "t5_2qtwb"}, {"author": "HiThereFellowHumans", "body": "I don't always take something with me (definitely depends on where I'm running and how populated it'll be), but sometimes I take a small, hand-held pepper gel (apparently, it's easier to hit your target with gel than the spray). Mine has a little hand strap and really isn't very big, so it's very easy/non-intrusive to hold. I think the brand is Sabre and you can get it at a place like Fleet Farm (if you're US-based, that is). \n\nI actually got it as a present from my mom who was nervous about me running by myself through some isolated trails. And frankly, I was surprised by how much safer/less paranoid I felt when I started running with it. So even if the likelihood of me ever having to use it is slim, I think it's worth it simply for the peace of mind", "created_utc": "1580462330.0", "edited": "False", "id": "fg2yz0e", "is_submitter": "False", "link_id": "t3_ewbymg", "parent_id": "t3_ewbymg", "score": "2", "subreddit": "XXRunning", "subreddit_id": "t5_3ft56"}, {"author": "HiThereFellowHumans", "body": "I'm not sure if I can add links here, but do you know Blogilates (just search for her website on Google if not)? She's a fitness instructor who has a ton of free workout videos on Youtube. \n\nIf you're on her website, go to calendars at the top and you'll find a 28-day beginner calendar (no weights needed) which may be exactly what you're looking for :-)", "created_utc": "1580289955.0", "edited": "False", "id": "ffw8tvg", "is_submitter": "False", "link_id": "t3_evbrxb", "parent_id": "t3_evbrxb", "score": "2", "subreddit": "xxfitness", "subreddit_id": "t5_2ryzy"}, {"author": "HiThereFellowHumans", "body": "I'm sorry to some of you who had bad experiences taking Accutane....the side effects clearly seem to vary person-to-person. For me, frankly, it was a godsend (and my skin still looks good years later, thank goodness). \n\nMy personal side effects were annoying (dry skin, joint soreness)...but nowhere near as bad as some of the stories here. So, sounds like it can be really hit or miss, moral of the story.", "created_utc": "1580117673.0", "edited": "False", "id": "ffq31wj", "is_submitter": "False", "link_id": "t3_eub16e", "parent_id": "t1_ffnqbj4", "score": "5", "subreddit": "Instagramreality", "subreddit_id": "t5_3pmoe"}, {"author": "HiThereFellowHumans", "body": "Writing was exactly what I was going to say. On the downside, writing is literally my job. On the plus side, I'm great at my job.", "created_utc": "1579800211.0", "edited": "False", "id": "ffcijpe", "is_submitter": "False", "link_id": "t3_esr647", "parent_id": "t1_ffbq51r", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "HiThereFellowHumans", "body": "Experienced this myself. The best thing for me has been to instead start my day with a 10-20 minute yoga/meditation video (which I set up the night before, so I just open up my computer and it's there without me having to click around).", "created_utc": "1579520097.0", "edited": "False", "id": "ff2qym6", "is_submitter": "False", "link_id": "t3_er6xae", "parent_id": "t3_er6xae", "score": "1", "subreddit": "nosurf", "subreddit_id": "t5_2st2y"}, {"author": "HiThereFellowHumans", "body": "Congrats on the engagement! But yes, agreed to the Blogilates bridal boot camp series", "created_utc": "1578991278.0", "edited": "False", "id": "feczkq7", "is_submitter": "False", "link_id": "t3_eog5yw", "parent_id": "t1_fectdjx", "score": "2", "subreddit": "xxfitness", "subreddit_id": "t5_2ryzy"}, {"author": "HiThereFellowHumans", "body": "Yup, I'm definitely in it for the location independence and to not have the need to set my alarm clock each day haha", "created_utc": "1578737747.0", "edited": "False", "id": "fdura0n", "is_submitter": "False", "link_id": "t3_ems4uy", "parent_id": "t1_fdu3vet", "score": "1", "subreddit": "digitalnomad", "subreddit_id": "t5_2r9w0"}, {"author": "HiThereFellowHumans", "body": "A 10-15 minute yoga video (you can search \"yoga for hips\" on Youtube if you want, but most yoga includes elements of hip stretching) each morning when I wake up. Makes a really big difference!", "created_utc": "1578737678.0", "edited": "False", "id": "fdur3sr", "is_submitter": "False", "link_id": "t3_emvyxw", "parent_id": "t3_emvyxw", "score": "2", "subreddit": "XXRunning", "subreddit_id": "t5_3ft56"}, {"author": "HiThereFellowHumans", "body": "In my experience, French speakers in Belgium also happen to be a bit kinder/more patient as you're learning and speaking with them in public than those in France :-)", "created_utc": "1577032427.0", "edited": "False", "id": "fbqjn74", "is_submitter": "False", "link_id": "t3_edtoj2", "parent_id": "t1_fbly21m", "score": "3", "subreddit": "French", "subreddit_id": "t5_2rd5t"}, {"author": "HiThereFellowHumans", "body": "Have you thought about learning French in Belgium rather than France? I just did a 1-month French immersion course with the Alliance Française in Brussels, and really got a lot from it. It was very reasonably priced as well.", "created_utc": "1576973101.0", "edited": "False", "id": "fblxtk1", "is_submitter": "False", "link_id": "t3_edtoj2", "parent_id": "t3_edtoj2", "score": "2", "subreddit": "French", "subreddit_id": "t5_2rd5t"}, {"author": "HiThereFellowHumans", "body": "Focus on strength (full body) - *not* just running! And actually educate your athletes on why it's important.\n\nFor some reason, my CC and track teams really focused on just the running aspect, and I feel certain so many injuries (from both myself and my teammates) could have been avoided if we prioritized strength more.", "created_utc": "1576613136.0", "edited": "False", "id": "fb8g2ho", "is_submitter": "False", "link_id": "t3_ebwu5y", "parent_id": "t3_ebwu5y", "score": "1", "subreddit": "running", "subreddit_id": "t5_2qlit"}, {"author": "HiThereFellowHumans", "body": "Oh, this is super helpful. Thank you!!", "created_utc": "1575833595.0", "edited": "False", "id": "fa7cxns", "is_submitter": "False", "link_id": "t3_e7ljxp", "parent_id": "t1_fa4q5bw", "score": "1", "subreddit": "trailrunning", "subreddit_id": "t5_2s3qi"}, {"author": "HiThereFellowHumans", "body": "Do you have any specific trails in Forêt Des Soignes (or anywhere else not too far from Brussels center) that you can recommend, ideally easily accessible via public transportation? I've moved to Brussels not long ago and am trying to find my new running spots :-)", "created_utc": "1575804282.0", "edited": "False", "id": "fa4fuac", "is_submitter": "False", "link_id": "t3_e7ljxp", "parent_id": "t1_fa16jnf", "score": "1", "subreddit": "trailrunning", "subreddit_id": "t5_2s3qi"}, {"author": "HiThereFellowHumans", "body": "I spend quite a bit of money (anywhere from $250-300 monthly or $3,000 ish per year) on private language lessons. And no, I don't have a particularly high salary or anything, this is just something I prioritize in my life :-) \n\nFor one, because the lessons (and the ability to speak multiple langues) makes me super happy. And two, I think private lessons are the efficient way to learn another language!", "created_utc": "1574937016.0", "edited": "False", "id": "f8xwp8n", "is_submitter": "False", "link_id": "t3_e2q8ia", "parent_id": "t3_e2q8ia", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "HiThereFellowHumans", "body": "I actually use the old version of Reddit (just go to old.reddit.com) and like it a lot more. There's only a certain number of items you see at once so you have to actively click \"next\" to go to the next page with more. \n\nI find this helps me a lot because then I just limit myself to seeing what's interesting on the first page or two and then be done.", "created_utc": "1574147043.0", "edited": "False", "id": "f812hjy", "is_submitter": "False", "link_id": "t3_dyen66", "parent_id": "t3_dyen66", "score": "3", "subreddit": "nosurf", "subreddit_id": "t5_2st2y"}, {"author": "HiThereFellowHumans", "body": "Depends where I am. Generally, I quite like it because it makes me feel like a bada$$...but where I live now, I don't feel super safe running in the dark so I try to avoid it (hard to do in the winter with so few hours of daylight, alas).", "created_utc": "1574085494.0", "edited": "False", "id": "f7y3lst", "is_submitter": "False", "link_id": "t3_dxw2jv", "parent_id": "t3_dxw2jv", "score": "1", "subreddit": "running", "subreddit_id": "t5_2qlit"}, {"author": "HiThereFellowHumans", "body": "I usually take online private lessons with Italki or Verbling. They can be really reasonably priced and you have lots of teachers to choose from. Not all the teachers will have a structured curriculum, so you'll just have to ask around/read the profiles/perhaps try a few trial lessons until you find one that fits in with what you're looking for.  \n\nEnjoy BR Portuguese! It's one of my favorite languages ever....so feel free to reach out if you ever need some more specific advice", "created_utc": "1574085353.0", "edited": "False", "id": "f7y3fw8", "is_submitter": "False", "link_id": "t3_dy1w9l", "parent_id": "t3_dy1w9l", "score": "7", "subreddit": "Portuguese", "subreddit_id": "t5_2sqn7"}, {"author": "HiThereFellowHumans", "body": "In most cases, it seems Portuguese speakers have a much easier time understanding Spanish than the other way around. I think it's that the pronunciation of Portuguese is simply harder to understand/is less clear than that of Spanish. Plus, Portuguese speakers are more likely to have exposure to Spanish (simply given the number of countries that speak it and the amount of Spanish-speaking media) than Spanish speakers are to Portuguese. \n\nRegardless, just because a Portuguese speaker can understand some Spanish does *not* mean they can speak it nor that they can understand all the details. They are still separate languages and efforts needs to be put into learning either one. \n\nHowever, since there a lot of similarities in words and grammatical structures between the two languages, learning one first will definitely help the other. For example, I spoke Spanish before I began learning Portuguese. Having this base with Spanish was a huge benefit which helped me learn Portuguese quite quickly. Although, my problem now is that I mix them up quite a bit :-) \n\nSo if I were you, I would simply start by learning the one that is most interesting & useful to you. Then, once you have a firm grasp on it, you can consider learning the other.", "created_utc": "1574084984.0", "edited": "False", "id": "f7y30cv", "is_submitter": "False", "link_id": "t3_dy35fu", "parent_id": "t3_dy35fu", "score": "13", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "HiThereFellowHumans", "body": "Haha I love this deal! (Although I do agree with another comment that said learning a language is significantly more challenging than getting a driver's license) \n\nOne caveat I would add is that, just because you are a native speaker of a language, does *not* mean that you are also a good teacher of said language, as I encountered when learning my husband's native language (Portuguese). \n\nWhat I ended up doing was instead taking the responsibility of learning upon myself (through classes, self-study, etc.) and then just utilize my husband as a resource to ask questions to when I had them, to help me through any Portuguese content we were reading/listening to, and as a conversation partner. \n\nToday, we actually speak a lot to each other in Portuguese rather than English and he will of course correct me and help me with anything I'm unsure of as best he can...but I still consider myself responsible for continuing to learn more advanced vocab & grammatical structures.", "created_utc": "1573821222.0", "edited": "False", "id": "f7kp38e", "is_submitter": "False", "link_id": "t3_dwbwlc", "parent_id": "t3_dwbwlc", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "HiThereFellowHumans", "body": "I second the Alliance Francaise! I'm taking an intensive French course (3 hours 5 days per week) here in Brussels, and I've found it to be really helpful (as well as pretty reasonably priced). \n\nBeyond that, I supplement with a private lesson (during which I focus mostly on speaking) from Italki or Verbling", "created_utc": "1573294252.0", "edited": "False", "id": "f6ys5kc", "is_submitter": "False", "link_id": "t3_dtrwwk", "parent_id": "t1_f6ykwev", "score": "1", "subreddit": "French", "subreddit_id": "t5_2rd5t"}, {"author": "HiThereFellowHumans", "body": "I downloaded \"Short Stories in French for Beginners\" by Olly Richards.  You can get it on Amazon and I've found it to be really helpful.", "created_utc": "1573042025.0", "edited": "False", "id": "f6oz6mj", "is_submitter": "False", "link_id": "t3_ds8ipx", "parent_id": "t3_ds8ipx", "score": "0", "subreddit": "French", "subreddit_id": "t5_2rd5t"}, {"author": "HiThereFellowHumans", "body": "I think this is probably kinda the direction I should head out. Helps keep the love of running alive when you can be more unstructured about it!", "created_utc": "1572287114.0", "edited": "False", "id": "f5m6s7l", "is_submitter": "True", "link_id": "t3_doas0x", "parent_id": "t1_f5liuzy", "score": "2", "subreddit": "running", "subreddit_id": "t5_2qlit"}, {"author": "HiThereFellowHumans", "body": "Have you found that you've been able to hop back into running intensely pretty quickly after a period when you're not running much? Unfortunately, I seem quite prone to injury so even if I'm fit/have been working out a lot otherwise, if I go a long period without running (such as 90 days), I have to ease back into running quite slowly if I don't want to get hurt.", "created_utc": "1572287056.0", "edited": "False", "id": "f5m6mnz", "is_submitter": "True", "link_id": "t3_doas0x", "parent_id": "t1_f5lrx4w", "score": "2", "subreddit": "running", "subreddit_id": "t5_2qlit"}, {"author": "HiThereFellowHumans", "body": "Do you make a specific plan? Or do you just kind of head out and do what you feel like?", "created_utc": "1572286938.0", "edited": "False", "id": "f5m6b1q", "is_submitter": "True", "link_id": "t3_doas0x", "parent_id": "t1_f5lqhc1", "score": "1", "subreddit": "running", "subreddit_id": "t5_2qlit"}, {"author": "HiThereFellowHumans", "body": "I second Belgium! I've just moved here (to the French-speaking part) and thus far have found the people pretty friendly. They even tolerate my super basic (like, we're talking kindergartner level) French with patience and general kindness.", "created_utc": "1571061322.0", "edited": "False", "id": "f3plx18", "is_submitter": "False", "link_id": "t3_dhnd9g", "parent_id": "t1_f3pdqmw", "score": "7", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "HiThereFellowHumans", "body": "Ahhhh Cloud Atlas is my favorite book in the whole wide world!! Would love to go to an event by David Mitchelle someday", "created_utc": "1570888052.0", "edited": "False", "id": "f3f0mqv", "is_submitter": "False", "link_id": "t3_dgm5jv", "parent_id": "t1_f3di08o", "score": "2", "subreddit": "printSF", "subreddit_id": "t5_2rzjk"}, {"author": "HiThereFellowHumans", "body": "Ah, got it. In that case, good to know that's an option!", "created_utc": "1570804184.0", "edited": "False", "id": "f3b89vw", "is_submitter": "False", "link_id": "t3_dgbiik", "parent_id": "t1_f3b79xl", "score": "1", "subreddit": "digitalnomad", "subreddit_id": "t5_2r9w0"}, {"author": "HiThereFellowHumans", "body": "Seconding copywriting! Even if it's not what you ultimately go into, it's a useful skill to have no matter what. Copy Hackers is a good place to start (they have a ton of free content including a free beginner's course, I think).", "created_utc": "1570802881.0", "edited": "False", "id": "f3b6g5o", "is_submitter": "False", "link_id": "t3_dgbiik", "parent_id": "t1_f3aok31", "score": "27", "subreddit": "digitalnomad", "subreddit_id": "t5_2r9w0"}, {"author": "HiThereFellowHumans", "body": "You can get a TEFL qualification for £14?? Can't imagine it's a very useful course that you'll actually learn stuff from then :-)", "created_utc": "1570802640.0", "edited": "False", "id": "f3b64g7", "is_submitter": "False", "link_id": "t3_dgbiik", "parent_id": "t1_f3aok17", "score": "1", "subreddit": "digitalnomad", "subreddit_id": "t5_2r9w0"}, {"author": "HiThereFellowHumans", "body": "I'm going to guess VIPKid? I see a lot of people talking about it", "created_utc": "1570802593.0", "edited": "False", "id": "f3b627y", "is_submitter": "False", "link_id": "t3_dgbiik", "parent_id": "t1_f3axi13", "score": "1", "subreddit": "digitalnomad", "subreddit_id": "t5_2r9w0"}, {"author": "HiThereFellowHumans", "body": "I just started learning French not long ago and here's what I've been using starting from scratch (although I also speak two other romance languages so that did give me quite a good base to work from): \n\n1. Rocket French (I don't usually like audio courses but I've found this one helps me retain the content quite well & is great for accent training) \n\n2.Glossika \n\n3. the Coffee Break French podcast (which I listen to basically any time I can) \n\nSoon, I also plan to start taking private lessons for speaking from Italki or Verbling. Even if the prospect of holding a whole conversation in French freaks you out, I really can't recommend doing this enough...it's been amazingly useful for my other languages!\n\nBonne chance :-)\n\n(edit: sorry about the weird formatting - I can't figure out how to fix it!)", "created_utc": "1570550623.0", "edited": "False", "id": "f30bciv", "is_submitter": "False", "link_id": "t3_dewvc9", "parent_id": "t3_dewvc9", "score": "5", "subreddit": "learnfrench", "subreddit_id": "t5_2sucz"}, {"author": "HiThereFellowHumans", "body": "Agree with this 100% (or at least it was my experience as well). \n\nHated teaching children (though didn't realize it at the time), love teaching adults.", "created_utc": "1570450931.0", "edited": "False", "id": "f2vdvy9", "is_submitter": "False", "link_id": "t3_dei0oq", "parent_id": "t1_f2v8jvl", "score": "2", "subreddit": "TEFL", "subreddit_id": "t5_2qq76"}, {"author": "HiThereFellowHumans", "body": "Neither my husband nor I (both big fitness people) drink all that much, but it's not directly because of fitness reasons? As in, I don't avoid it because I'm concerned about calories or it harming gainz or anything. \n\nIt's mostly just that the more we've gotten into fitness/just generally taking care of ourselves, we quite like the feeling of being healthy and energized. And so, alcohol just tends not to make ourselves feel very good...so I guess we've just kind of subconsciously being drawn less and less to it over time, if that makes sense?", "created_utc": "1570450755.0", "edited": "False", "id": "f2vdiqh", "is_submitter": "False", "link_id": "t3_deawli", "parent_id": "t3_deawli", "score": "1", "subreddit": "xxfitness", "subreddit_id": "t5_2ryzy"}, {"author": "HiThereFellowHumans", "body": "To check pronunciation for things, I highly recommend forvo.com \n\nOh, and also it's امبارح with an alif (at least according to my Palestinian teacher) :-) \n\nIt's free - all you have to do is paste امبارح (or any of the other words given above) into the search bar and you can hear it. Probably easier than having us try to explain how to pronounce it. It's also works for a bunch of other languages, so that's fun.\n\nEdit: a spelling correction", "created_utc": "1570184233.0", "edited": "1570184429.0", "id": "f2e6xf7", "is_submitter": "False", "link_id": "t3_dcw68y", "parent_id": "t1_f2c1ke5", "score": "1", "subreddit": "learn_arabic", "subreddit_id": "t5_2v4vi"}, {"author": "HiThereFellowHumans", "body": "Eu gostei muito de Semantica Portugues. É pago mais é super util", "created_utc": "1570040811.0", "edited": "False", "id": "f27ldgk", "is_submitter": "False", "link_id": "t3_dcbced", "parent_id": "t3_dcbced", "score": "4", "subreddit": "Portuguese", "subreddit_id": "t5_2sqn7"}, {"author": "HiThereFellowHumans", "body": "You can (usually) check out e-books for free & download them to your e-reader from your local library.", "created_utc": "1569525267.0", "edited": "False", "id": "f1jn6zy", "is_submitter": "False", "link_id": "t3_d9i7ob", "parent_id": "t3_d9i7ob", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "HiThereFellowHumans", "body": "Dangerous in what way?", "created_utc": "1568517352.0", "edited": "False", "id": "f0apf00", "is_submitter": "False", "link_id": "t3_d4dxb8", "parent_id": "t1_f0anoxv", "score": "4", "subreddit": "trailrunning", "subreddit_id": "t5_2s3qi"}, {"author": "HiThereFellowHumans", "body": "I'm sorry to hear about your dad, mine passed about a year after yours (the 2-year anniversary is tomorrow). \n\nForgive me if I'm overstepping, but I'd consider trying out another therapist. I did grief therapy which helped immensely, and not once did she pull any of that \"he's with god and in a better place.\" Which, as a good therapist, she should know probably won't help her patient at all to hear.", "created_utc": "1568329489.0", "edited": "False", "id": "f02fdey", "is_submitter": "False", "link_id": "t3_d32t69", "parent_id": "t1_ezz8xki", "score": "2", "subreddit": "GriefSupport", "subreddit_id": "t5_2s36e"}, {"author": "HiThereFellowHumans", "body": "I'm sorry to hear about your nightmares, and I wish that this type of delayed grief was something more people talk about because I think it's more common than we think. For example, I was able to function much more normally right after the death than I was a few months down the road when it finally hit, and yet it's really only \"acceptable\" to take time off from school/work right after it happens. \n\nFrankly, it took me about a year to start properly grieving after my dad's death. It probably would have taken me much longer if I didn't decide to begin therapy and had a wonderful therapist who helped me work through and address all those emotions. \n\nI think initially I was just in such shock (it was a sudden accident) and I also had a habit of repressing emotions as a defense mechanism (meaning it was just something my body was doing without my direction), so I just managed to ignore things until they caught up to me. Likely not too dissimilar to what's going on with you. \n\nWhat actually made me seek out therapy was not overt grief, but that I felt that it was starting to affect me subconsciously (anxiety, depression, panicking about things happening to other people in my life, etc.). \n\nIf anything, this is probably just your body's way of telling you \"hey, you've got to address and feel some of these things now.\" \n\nAnd no matter how painful it is, I recommend listening to your body - whether that means taking some time off, just letting those emotions hang out, or even seeking therapy.", "created_utc": "1568329328.0", "edited": "False", "id": "f02f4ow", "is_submitter": "False", "link_id": "t3_d34kso", "parent_id": "t3_d34kso", "score": "1", "subreddit": "GriefSupport", "subreddit_id": "t5_2s36e"}, {"author": "HiThereFellowHumans", "body": "I'm not sure about sleeping, but I did find keeping the radio on for background noise while doing other things (even without focusing to hear the specifics) helped me get a feel for the cadence of the language (which is obviously very different from Brazilian Portuguese)...which ultimately made it a bit easier for me to follow when in normal conversation.", "created_utc": "1568326872.0", "edited": "False", "id": "f02ar2k", "is_submitter": "False", "link_id": "t3_d35xq6", "parent_id": "t1_f0297o4", "score": "3", "subreddit": "Portuguese", "subreddit_id": "t5_2sqn7"}, {"author": "HiThereFellowHumans", "body": "Oof I can relate hard to this. After years of speaking Brazilian Portuguese, I had to take a language test in European Portuguese (long story) and it was a painful process to switch over.  \n\nI think the people here have pointed out phonetic differences to watch out for plenty so no need for me to add in there, but I will say that what helped me a lot was lots of listening exposure to European Portuguese. I found it best when I could read along (so I could read words I already knew and then realize \"oh, so THAT'S how they pronounce that word\"). Like a TV show with Portuguese subtitles or a podcast with a transcript.", "created_utc": "1568324855.0", "edited": "False", "id": "f027f95", "is_submitter": "False", "link_id": "t3_d35xq6", "parent_id": "t3_d35xq6", "score": "4", "subreddit": "Portuguese", "subreddit_id": "t5_2sqn7"}, {"author": "HiThereFellowHumans", "body": "What dialect are these shows in?", "created_utc": "1568324502.0", "edited": "False", "id": "f026vjp", "is_submitter": "False", "link_id": "t3_d3b870", "parent_id": "t1_f01a81j", "score": "2", "subreddit": "learn_arabic", "subreddit_id": "t5_2v4vi"}, {"author": "HiThereFellowHumans", "body": "Frankly, I might not have even started the work without getting paid first :-)", "created_utc": "1567795859.0", "edited": "False", "id": "eza6t78", "is_submitter": "False", "link_id": "t3_d0hvkk", "parent_id": "t3_d0hvkk", "score": "3", "subreddit": "copywriting", "subreddit_id": "t5_2qq49"}, {"author": "HiThereFellowHumans", "body": "As of January of this year, Americans can visit Belarus 30-days visit free (it was just 5 before) :-)", "created_utc": "1567373897.0", "edited": "False", "id": "eyrodmf", "is_submitter": "False", "link_id": "t3_cy5qwi", "parent_id": "t1_eyqjj6l", "score": "2", "subreddit": "digitalnomad", "subreddit_id": "t5_2r9w0"}, {"author": "HiThereFellowHumans", "body": "Oi, tudo bem? \n\nSorry, I'm going to write in English because I'm feeling a bit lazy tonight :-) \n\nI can't speak to the usefulness of the CAPLE for the business world (though I'd imagine employers would like to see this). \n\nBut if you didn't grow up in a Portuguese-speaking country, then you'll have to take the test anyway to apply for citizenship. As was already said, the minimum level for this is the A2 test. \n\nBut if you can pass the CAPLE at a higher, it certainly won't hurt your citizenship case to do so! \n\nI'm actually also beginning the process to apply for Portuguese citizenship through family (marriage) and took the B2 level CAPLE (DIPLE) a few months ago, so feel free to reach out if you have any questions. \n\nPS: I'm not sure how different your citizenship application is from mine since mine is from marriage, but do you also have to show \"ties to the Portuguese community?\" I'm struggling with this part, so I'd love to see any insight/hear how you are doing it if so :-)", "created_utc": "1566446041.0", "edited": "False", "id": "exn4g0w", "is_submitter": "False", "link_id": "t3_ctjjv6", "parent_id": "t3_ctjjv6", "score": "2", "subreddit": "Portuguese", "subreddit_id": "t5_2sqn7"}, {"author": "HiThereFellowHumans", "body": "Ugh, I wish it could be as possible as \"I just don't want to right now.\" \n\nWhat I usually say is that I have a pretty sensitive stomach and get nauseous quite easily...so, I usually say alcohol often just makes me feel kinda nauseous/sick. People seem to buy that just fine (and it's also not so far from the truth). \n\nI could also say come from a family of alcoholics and that someone in my immediate family died because a drunk driver hit them, but that tends to make people a lot more uncomfortable than the above", "created_utc": "1565970246.0", "edited": "False", "id": "ex2ixm0", "is_submitter": "False", "link_id": "t3_cqx1hs", "parent_id": "t3_cqx1hs", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "HiThereFellowHumans", "body": "Curious: why do you say you can't connect with it because you are a millennial? I'm a millennial (although on the younger side, if that makes a difference) also and it's one of my favorite books ever. \n\nI'd say it's more of a personality/personal taste/sense of humor thing than a generational thing...", "created_utc": "1565403511.0", "edited": "1565403657.0", "id": "ewhbwe3", "is_submitter": "False", "link_id": "t3_co5kb2", "parent_id": "t1_ewhak5y", "score": "9", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "HiThereFellowHumans", "body": "Running clubs have been the best for me! \n\nOr any type of \"outdoor workout\" type of club. \n\nI guess being outside just makes people happy and ready to make friends :-)", "created_utc": "1565403243.0", "edited": "False", "id": "ewhbkjv", "is_submitter": "False", "link_id": "t3_co9wyv", "parent_id": "t3_co9wyv", "score": "10", "subreddit": "xxfitness", "subreddit_id": "t5_2ryzy"}, {"author": "HiThereFellowHumans", "body": "Semantica Portuguese is paid, but it helped me a lot. \n\nAlso, 3% is a Brazilian series on Netflix that I found pretty useful", "created_utc": "1565361567.0", "edited": "False", "id": "ewfig0a", "is_submitter": "False", "link_id": "t3_cnv6qr", "parent_id": "t3_cnv6qr", "score": "4", "subreddit": "Portuguese", "subreddit_id": "t5_2sqn7"}, {"author": "HiThereFellowHumans", "body": "Hahaha this is the most beautiful description", "created_utc": "1565197871.0", "edited": "False", "id": "ew7v942", "is_submitter": "True", "link_id": "t3_cmjy1a", "parent_id": "t1_ew5yprj", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "HiThereFellowHumans", "body": "I certainly didn't mean for this post to come across as sad...while it might be sad for some people in similar cases, he very deliberately left Brazil many many years ago and has very deliberately not maintained a lot of his ties there. In other words, his situation came about by his own choice, not because of \"cultural repression\" or a \"robbed identity.\" Although, I will absolutely acknowledge that this isn't true for everyone. In other words, no need to call him a poor guy - he's perfectly happy with it :-) \n\nAnd while I will agree the US certainly does focus on that particular cultural expression, this example really doesn't have anything to do with the US given that he's never actually lived there. So, I think that may have been an unnecessary assumption. I mean, unless you want to make the argument that I, as the American wife, has robbed him of his non-Anglophone identity...but he had already been speaking English almost exclusively for years before we met, and thus we communicate mostly in English today since his English is a lot better than my Portuguese.", "created_utc": "1565142277.0", "edited": "False", "id": "ew5q12g", "is_submitter": "True", "link_id": "t3_cmjy1a", "parent_id": "t1_ew3k44i", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "HiThereFellowHumans", "body": "Why do you say that about Portuguese academic writing? I've never learned Portuguese in a formal setting, so haven't dealt with it much :-)", "created_utc": "1565141755.0", "edited": "False", "id": "ew5p9mx", "is_submitter": "True", "link_id": "t3_cmjy1a", "parent_id": "t1_ew4jjbd", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "HiThereFellowHumans", "body": "Oooh this is a good example of learning situational language. \n\nWith this type of logic in mind, it makes sense that he'd actually feel better expressing more complicated ideas/thoughts/arguments, etc. in English rather than Portuguese since that is what he has been doing for most of his adult life (as well as studying academically, of course).", "created_utc": "1565141388.0", "edited": "False", "id": "ew5oq60", "is_submitter": "True", "link_id": "t3_cmjy1a", "parent_id": "t1_ew35q1m", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "HiThereFellowHumans", "body": "You're right this is a fair point - I should be more careful with my phrasing with things like \"native level.\"", "created_utc": "1565141269.0", "edited": "False", "id": "ew5ojw2", "is_submitter": "True", "link_id": "t3_cmjy1a", "parent_id": "t1_ew3ja0e", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "HiThereFellowHumans", "body": "This makes a lot of sense that if English happens to be the language they study in more academic terms", "created_utc": "1565140907.0", "edited": "False", "id": "ew5o0yk", "is_submitter": "True", "link_id": "t3_cmjy1a", "parent_id": "t1_ew39voq", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "HiThereFellowHumans", "body": "Cassey Ho from Blogilates. \n\nShe just seems like such a genuinely nice person. And although she's super strong & fit (which you can tell by her videos....which are tough!) she looks like a normal, generally fit person? Like, not 8-pack and model skinny (which tends to just make me feel kinda badly about myself honestly).", "created_utc": "1564691604.0", "edited": "False", "id": "evqexwf", "is_submitter": "False", "link_id": "t3_ckgzpx", "parent_id": "t3_ckgzpx", "score": "2", "subreddit": "xxfitness", "subreddit_id": "t5_2ryzy"}, {"author": "HiThereFellowHumans", "body": "Yikes - I've done 3 hours classes before...but never 4! \n\nThat said, looks like other people have covered some great general tips so I'll add in some lesson planning advice. \n\nFor my longer classes, I used this website all the time (http://film-english.com/) and then either merged plans together or adapted/added to the plans there to build out the class. It's a lifesaver because the topics are super interesting and include a lot of related, yet different, activities. \n\n\nGood luck!", "created_utc": "1563994037.0", "edited": "False", "id": "eurh2wa", "is_submitter": "False", "link_id": "t3_ch7soo", "parent_id": "t3_ch7soo", "score": "2", "subreddit": "TEFL", "subreddit_id": "t5_2qq76"}, {"author": "HiThereFellowHumans", "body": "I'm basically the same here and use running 100% as therapy (use it to cope with a death in my immediate family, with stress, with being anxious, etc.) \n\nI have a tendency to repress/ignore a lot of my emotions (but not in like a healthy, this-is-sustainable-long-term way) and running alone has always been an amazing way for me to process and actually let 'em (the emotions) rip. \n\nIn other words, OP, I'd say this is completely normal. If anything, some tears were probably exactly what you needed at the moment and that run just gave you the space to feel the feels :-) \n\n(PS: not enough alone time would also be enough for me to breakdown in tears haha)", "created_utc": "1562560123.0", "edited": "False", "id": "et8lcpk", "is_submitter": "False", "link_id": "t3_caex6l", "parent_id": "t1_et8a0ii", "score": "21", "subreddit": "running", "subreddit_id": "t5_2qlit"}, {"author": "HiThereFellowHumans", "body": "It certainly cost more, but that's because it's in person and you have actual observed teaching hours. \n\nHonestly, I don't think anyone actually learns that much from the online TEFL courses...they are more just for \"show\" so you can get a job. So if you're serious about your teaching and want to teach well, then I'd highly recommend something in person. \n\nAlso, it gives you a fun excuse to go to Peru :-)", "created_utc": "1562428862.0", "edited": "False", "id": "et36xfj", "is_submitter": "False", "link_id": "t3_c9ghwn", "parent_id": "t1_et1oe3l", "score": "2", "subreddit": "TEFL", "subreddit_id": "t5_2qq76"}, {"author": "HiThereFellowHumans", "body": "I did a 1-month TEFL program at a school in Cusco called Máximo Nivel. It was a few years ago, but I had a really good experience and learned a lot. \n\nI didn't personally stay, but I know that a few of my classmates stayed on to teach directly at the same school", "created_utc": "1562375299.0", "edited": "False", "id": "et09wqm", "is_submitter": "False", "link_id": "t3_c9ghwn", "parent_id": "t3_c9ghwn", "score": "2", "subreddit": "TEFL", "subreddit_id": "t5_2qq76"}, {"author": "HiThereFellowHumans", "body": "Ooof maybe that Modern Standard Arabic has verb conjugations for 13 (!!!!) different subjects? \n\n(This is one of many reasons I'm learning an Arabic dialect instead. But even then, there's still 8 conjugations...top that Romance languages!)\n\nOr that adjectives that describe non-human plurals (such as trees or cookies) are actually in their singular feminine form??", "created_utc": "1562173762.0", "edited": "False", "id": "esot3a6", "is_submitter": "False", "link_id": "t3_c8mn8q", "parent_id": "t3_c8mn8q", "score": "13", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "HiThereFellowHumans", "body": "Semantica Portuguese is paid but it was awesome for my listening skills", "created_utc": "1561995337.0", "edited": "False", "id": "eshku1y", "is_submitter": "False", "link_id": "t3_c7kelx", "parent_id": "t3_c7kelx", "score": "1", "subreddit": "Portuguese", "subreddit_id": "t5_2sqn7"}, {"author": "HiThereFellowHumans", "body": "Agree with this. I aim for 2-3 per week if I can, but sometimes my schedule just doesn't allow that many.", "created_utc": "1561426077.0", "edited": "False", "id": "erz5bv2", "is_submitter": "False", "link_id": "t3_c4p4ax", "parent_id": "t1_erxr7fy", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "HiThereFellowHumans", "body": "My tutor usually prepares activities for it unless there is something specific I ask to work on", "created_utc": "1561425835.0", "edited": "False", "id": "erz505c", "is_submitter": "False", "link_id": "t3_c4tq0n", "parent_id": "t3_c4tq0n", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "HiThereFellowHumans", "body": "I'd really recommend doing an in-person one with live classroom teaching if you don't already have teaching experience and actually want to teach well for your students (I unfortunately meet far too many ESL teachers who don't want to do this so felt it was worth mentioning). \n\nThe online one might help you get a job, but won't get you so far when it comes to teaching. Obviously the in-person ones are more expensive, but a good one is really worth it because you can learn so much more. In-person ones also give you an excuse to travel somewhere new to take it, so that's another nice benefit :-) \n\nI actually did an intensive 1-month TEFL course in Cusco, Peru at a school called Máximo Nivel. I loved my program...learned a ton, really felt a lot more confident teaching, was able to travel, and was also able to stay with a host family to practice my Spanish. I came away with a certificate that seems to be accepted anywhere I've applied.", "created_utc": "1561339144.0", "edited": "False", "id": "erwc02r", "is_submitter": "False", "link_id": "t3_c454xn", "parent_id": "t3_c454xn", "score": "2", "subreddit": "TEFL", "subreddit_id": "t5_2qq76"}, {"author": "HiThereFellowHumans", "body": "People who are very self-centered and show no interest in other people. \n\nLike the type of people who will talk forever in a conversation about themselves as long as you ask them questions, but will never express any curiousity in you nor ask you anything back. \n\nConversations/relationships are a 2-way street, people!", "created_utc": "1560997867.0", "edited": "False", "id": "erlvd45", "is_submitter": "False", "link_id": "t3_c2oud5", "parent_id": "t3_c2oud5", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "HiThereFellowHumans", "body": "I can be a bit like this too, so I actually found I quite like studying two languages at once. I usually commit 1/2 my week to 1, then 1/2 my week to the other. \n\nIdeally, you are able to get to a relatively high level (B2ish) before you do this so you don't mix things up, but if you still find yourself struggling to stay focused to get to this level first, then just make sure you're studying languages from different language families so you can keep them separate in your head. \n\nBeyond that, it all comes down to motivation (for example, finding a good friend or partner who speaks that language) and just having the willpower to move through those language plateaus :-)", "created_utc": "1560912931.0", "edited": "False", "id": "erj1fhb", "is_submitter": "False", "link_id": "t3_c27rpe", "parent_id": "t3_c27rpe", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "HiThereFellowHumans", "body": "Agree with this. Definitely look into copywriting. Probably the most feasible (and profitable) way to actually make a living writing.", "created_utc": "1560912679.0", "edited": "False", "id": "erj13wk", "is_submitter": "False", "link_id": "t3_c2aiwr", "parent_id": "t1_erizc3n", "score": "2", "subreddit": "digitalnomad", "subreddit_id": "t5_2r9w0"}, {"author": "HiThereFellowHumans", "body": "Agreed about Sense8!", "created_utc": "1560912393.0", "edited": "False", "id": "erj0qtq", "is_submitter": "False", "link_id": "t3_c2a2to", "parent_id": "t1_eriw17u", "score": "13", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "HiThereFellowHumans", "body": "Yeah, I've always found Portuguese to be very phonetic once you know the rules", "created_utc": "1560889253.0", "edited": "False", "id": "eri4d9t", "is_submitter": "False", "link_id": "t3_c2266a", "parent_id": "t1_eri33as", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "HiThereFellowHumans", "body": "Do you have any secrets for success :-)?", "created_utc": "1560888945.0", "edited": "False", "id": "eri3urp", "is_submitter": "False", "link_id": "t3_c23feu", "parent_id": "t3_c23feu", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "HiThereFellowHumans", "body": "Man, I hate making new friends tbh. It's great once you have them, but I move a lot and it's always exhausting to start anew each time.\n\nAnyway, I have picked up some good \"techniques\" over the years!\n\n1) Meetup.com - has meetups for just about any interest/hobby, etc. you can imagine. You can also create your own group or set up an event if what you're looking for isn't there.\n\n2) Clubs for hobbies you have/sports you like - personally, I usually try to join a local running club and a local hiking club. But there are clubs for just about anything out there! Either Google or find them on meetup.com\n\n3) Join Facebook groups for people new to the city and make a post seeing if people want to meet for a coffee/beer sometime\n\n4) Go to expat/foreigner meetups - not sure where you are or where you are from, but I think this still stands even if you are living in your home country (like an American living in the U.S.) In general, I've found foreigners (particularly if they are new to the city) tend to be much more receptive to meeting new people and building friendships given that most of their friends/family are still back home or spread throughout other places. I usually find these through Facebook groups, meetup.com or couchsurfing events\n\n5) Go to Couchsurfing events\n\n6) Take the initiative when the opportunity presents itself - I don't always do this as often as I should, but if you find someone you click with, invite them out to do something else even if it feels a bit forward. Sure, sometimes it won't work out (the person sounds interested but when you try to make plans it just keeps falling through), but you can't take it personally. Some people, particularly if they are kind of established in the city already, don't necessarily have the time/energy for new friends beyond their current social circle (this also probably explains why it can be easier to befriend foreigners/expats).\n\nBut a bit of initiative can go a long way. I can think of two really wonderful friendships I've developed because the other person (not me, unfortunately haha) took initiative right away. One of them we a girl who I met one day at a group run and then invited me to go to her neighborhood picnic two days later. The other was a girl I met at a yoga class who then invited me to go hiking with her the next day even though we hadn't had more than a 15-minute conversation. Their initiative might have seemed a bit forward at the time, but I myself was really looking for friends and I very much appreciated them having the courage to ask. And several years later, am still friends with both of them :-)\n\nIn summary, making new friends kinda sucks and takes a lot of effort. But I find the effort usually pays off!", "created_utc": "1560888890.0", "edited": "False", "id": "eri3rhl", "is_submitter": "False", "link_id": "t3_c23y2n", "parent_id": "t3_c23y2n", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "HiThereFellowHumans", "body": "I also live in Sweden (but am from a state in the U.S. where everyone always says hi to everyone else) and was going to comment the same thing about Sweden specifically! \n\nIt's wild. As in, if I see a runner approaching me from a distance, I sometimes literally see them avert their eyes as we pass one another. I guess I hadn't realized how much of a little energy boost you get simply from the quick smile or head nod of another runner until I moved here and found I missed it!", "created_utc": "1560871775.0", "edited": "False", "id": "erhbn0z", "is_submitter": "False", "link_id": "t3_c1xl3l", "parent_id": "t1_ergm252", "score": "2", "subreddit": "running", "subreddit_id": "t5_2qlit"}, {"author": "HiThereFellowHumans", "body": "Ladder your languages....AKA learn your third language in the second (in your case, learn Spanish through French)!", "created_utc": "1560810471.0", "edited": "False", "id": "erfkapq", "is_submitter": "False", "link_id": "t3_c1twbz", "parent_id": "t3_c1twbz", "score": "6", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "HiThereFellowHumans", "body": "I've done a lot of traveling alone as a female (to developed as well as undeveloped places)...of course you have to be careful/aware and there will certainly be places I wouldn't go by myself, but much of the world isn't nearly as frightening as we make it out to be :-) \n\nTraveling alone can be one of the most liberating things out there. Even if you can't do it overseas or don't feel comfortable doing it overseas, solo trips in your area are a good place to start!", "created_utc": "1560784938.0", "edited": "False", "id": "ereih2i", "is_submitter": "False", "link_id": "t3_c1lphv", "parent_id": "t1_ereegqc", "score": "4", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "HiThereFellowHumans", "body": "Sense8. \n\nOne of the most beautiful (if a bit cheesy at times) shows I've ever seen. Still heartbroken they cancelled it so soon :-(", "created_utc": "1560731797.0", "edited": "False", "id": "erd5uu1", "is_submitter": "False", "link_id": "t3_c1awn6", "parent_id": "t3_c1awn6", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "HiThereFellowHumans", "body": "Honestly, I did something similar....My parents were divorced and instead of putting my mom on FAFSA (who had a pretty decent salary/savings), I put my dad since he had just started a business and literally had a negative income at the moment with all the new business expenses.\n\nWile I may feel a bit \"spoiled\" when I look around when all my friends have student debt, I don't feel \"guilty\" for the decision. Just extremely lucky and grateful that I had this alternative available to me.", "created_utc": "1560639161.0", "edited": "False", "id": "eraatu4", "is_submitter": "False", "link_id": "t3_c10x1r", "parent_id": "t3_c10x1r", "score": "1", "subreddit": "confession", "subreddit_id": "t5_2qo2a"}, {"author": "HiThereFellowHumans", "body": "BA Degrees in English and Spanish....now I'm a copywriter/ghostwriter (and no one has ever asked about my degree ever haha)", "created_utc": "1560613996.0", "edited": "False", "id": "er8yi1x", "is_submitter": "False", "link_id": "t3_c0sg2c", "parent_id": "t3_c0sg2c", "score": "2", "subreddit": "digitalnomad", "subreddit_id": "t5_2r9w0"}, {"author": "HiThereFellowHumans", "body": "I'm learning shami and thus was really excited to hear about this show because thought it could be some really good listening training (even if the plot line is kinda cheesy). Do you think it's so poorly written/weirdly translated that it would actually do more damage to my Arabic to try it out?", "created_utc": "1560527149.0", "edited": "False", "id": "er5j7z2", "is_submitter": "False", "link_id": "t3_c06fxw", "parent_id": "t1_er3n2u9", "score": "1", "subreddit": "arabs", "subreddit_id": "t5_2qt0d"}, {"author": "HiThereFellowHumans", "body": "It's in shami (levantine dialect)", "created_utc": "1560527001.0", "edited": "False", "id": "er5iyx7", "is_submitter": "False", "link_id": "t3_bau88m", "parent_id": "t1_ekekd8u", "score": "1", "subreddit": "netflix", "subreddit_id": "t5_2qoxj"}, {"author": "HiThereFellowHumans", "body": "Running - an average person (who doesn't run or runs minimally) is often impressed with the distances/paces I run....but a pro runner might just laugh in my face (although, runners are some of the nicest people in the world based on my experience so unlikely!)", "created_utc": "1560234781.0", "edited": "False", "id": "eqqvvzw", "is_submitter": "False", "link_id": "t3_bz0zdd", "parent_id": "t3_bz0zdd", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "HiThereFellowHumans", "body": "Hey - congrats on the progress and glad you were able to see it as a win! \n\nAnd if you don't mind me asking - where have you recently moved? I've never heard of a gym requesting medical certificates/being difficult to join...", "created_utc": "1560168865.0", "edited": "False", "id": "eqmx7hd", "is_submitter": "False", "link_id": "t3_bywl0u", "parent_id": "t3_bywl0u", "score": "3", "subreddit": "xxfitness", "subreddit_id": "t5_2ryzy"}, {"author": "HiThereFellowHumans", "body": "Man, I hate making new friends tbh. It's great once you have them, but I move a lot and it's always exhausting to start anew each time. \n\nAnyway, I have picked up some good \"techniques\" over the years. \n\n1) Meetup.com - has meetups for just about any interest/hobby, etc. you can imagine. You can also create your own group or set up an event if what you're looking for isn't there.  \n\n2) Clubs for hobbies you have/sports you like - personally, I usually try to join a local running club and a local hiking club. But there are clubs for just about anything out there! Either Google or find them on meetup.com \n\n3) Join Facebook groups for people new to the city and make a post seeing if people want to meet for a coffee/beer sometime \n\n4) Go to expat/foreigner meetups - not sure where you are or where you are from, but I think this still stands even if you are living in your home country (like an American living in the U.S.) In general, I've found foreigners (particularly if they are new to the city) tend to be much more receptive to meeting new people and building friendships given that most of their friends/family are still back home or spread throughout other places. I usually find these through Facebook groups, meetup.com or couchsurfing events \n\n5) Go to Couchsurfing events\n\n6) Take the initiative when the opportunity presents itself - I don't always do this as often as I should, but if you find someone you click with, invite them out to do something else even if it feels a bit forward. Sure, sometimes it won't work out (the person sounds interested but when you try to make plans it just keeps falling through), but you can't take it personally. Some people, particularly if they are kind of established in the city already, don't necessarily have the time/energy for new friends beyond their current social circle (this also probably explains why it can be easier to befriend foreigners/expats). \n\nBut a bit of initiative can go a long way. I can think of two really wonderful friendships I've developed because the other person (not me, unfortunately haha) took initiative right away. One of them we a girl who I met one day at a group run and then invited me to go to her neighborhood picnic two days later. The other was a girl I met at a yoga class who then invited me to go hiking with her the next day even though we hadn't had more than a 15-minute conversation. Their initiative might have seemed a bit forward at the time, but I myself was really looking for friends and I very much appreciated them having the courage to ask. And several years later, am still friends with both of them :-) \n\n--- \n\nIn summary, making new friends kinda sucks and takes a lot of effort. But I find the effort usually pays off!", "created_utc": "1559893065.0", "edited": "False", "id": "eq98gaa", "is_submitter": "False", "link_id": "t3_bxat83", "parent_id": "t3_bxat83", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "HiThereFellowHumans", "body": "Guess I have two here. \n\n1) \"Stay strong.\" \n\nSooo annoying when something kinda awful happens (like your father dying suddenly in a car accident) and everyone keeps telling you this like they think it helps. If anything, it makes it worse because then people are encouraged to avoid their emotions & work through things and instead just pretend everything is okay. \n\n2) \"Oh, you'll change your mind about not having kids when you're older.\" \n\nWonder at what age people will finally stop saying this to me :-)", "created_utc": "1559891969.0", "edited": "False", "id": "eq97qim", "is_submitter": "False", "link_id": "t3_bxa37i", "parent_id": "t3_bxa37i", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "HiThereFellowHumans", "body": "Curious - what were you doing in Jeddah? Not exactly a common (nor particularly) easy place to visit unless you're there for work", "created_utc": "1559891499.0", "edited": "False", "id": "eq97f5e", "is_submitter": "False", "link_id": "t3_bxedu7", "parent_id": "t1_eq5x18i", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "HiThereFellowHumans", "body": "Yeah, 8 hours a day of deep concentration (like writing and writing well) just isn't possible. I've got an average of 3-5 (and 5 is only if I'm super caffeine fueled) hours of writing in me daily. Rest of time is spent on client calls, research, sometimes brainstorming for projects, catching up on other things, or self-study. Not on writing, though.", "created_utc": "1559580598.0", "edited": "False", "id": "epwo2gm", "is_submitter": "False", "link_id": "t3_bwafna", "parent_id": "t3_bwafna", "score": "1", "subreddit": "copywriting", "subreddit_id": "t5_2qq49"}, {"author": "HiThereFellowHumans", "body": "I learned Portuguese through Spanish and thought it was easier than learning it through my native language (English) since the two languages have so many connections. I think because of this I was able to get to a conversational level of Portuguese quite quickly. \n\nThat said, haven't quite figured out the best way to not mix them up and do still occasionally sub in a word or phrase from 1 language when I'm speaking the other. Downfall of learning related languages I guess.\n\nBut as to recommendations: I recommend getting a private Portuguese teacher via Italki or Verbling and requesting they teach you through Spanish", "created_utc": "1559549590.0", "edited": "False", "id": "epvt8xd", "is_submitter": "False", "link_id": "t3_bw0qoq", "parent_id": "t3_bw0qoq", "score": "5", "subreddit": "Portuguese", "subreddit_id": "t5_2sqn7"}, {"author": "HiThereFellowHumans", "body": "I'm sure this would mean so much to your grandmother. Good luck :-)", "created_utc": "1559413303.0", "edited": "False", "id": "epqvspz", "is_submitter": "False", "link_id": "t3_bvknuo", "parent_id": "t1_eppzazz", "score": "8", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "HiThereFellowHumans", "body": "As a non-Swede who has lived in quite a few different countries and currently lives in Sweden...in my experience, Sweden certainly isn't perfect, but it does a lot right and I think what earns it that title is a matter of comparison with the rest of the world. From a comparative standpoint, it easily falls into one of the top 10 highest standards of living in the world...if you can get over the difficulties of integrating into society and the dark, dark winters that is :-)  \n\nSo no, not a complete utopia...but doing far better than most of the other places in the world.", "created_utc": "1559413061.0", "edited": "False", "id": "epqvcsd", "is_submitter": "False", "link_id": "t3_bvjcpk", "parent_id": "t1_epq1no2", "score": "9", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "HiThereFellowHumans", "body": "Spanish seems very phonetic to me. \n\nNot sure about least phonetic...but English has to be pretty high up there on the scale (example: \"through,\" \"thorough,\" \"thought\")", "created_utc": "1559316351.0", "edited": "False", "id": "epmqojn", "is_submitter": "False", "link_id": "t3_bv7r1p", "parent_id": "t3_bv7r1p", "score": "6", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "HiThereFellowHumans", "body": "I also had an unpleasant surprise when I found out the Portuguese subjunctive rules didn't match with those of Spanish :-(", "created_utc": "1559316164.0", "edited": "False", "id": "epmq579", "is_submitter": "False", "link_id": "t3_bv5csf", "parent_id": "t1_epmgazd", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "HiThereFellowHumans", "body": "+1 for persian", "created_utc": "1559233264.0", "edited": "False", "id": "epi0l3l", "is_submitter": "False", "link_id": "t3_butf1g", "parent_id": "t1_ephik14", "score": "5", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "HiThereFellowHumans", "body": "Charles Schwab for accounts and debit cards for sure. They've probably paid me back hundreds of dollars in ATM fees worldwide over the years.", "created_utc": "1559231061.0", "edited": "False", "id": "ephtyof", "is_submitter": "False", "link_id": "t3_buox2q", "parent_id": "t1_epfhfrt", "score": "4", "subreddit": "digitalnomad", "subreddit_id": "t5_2r9w0"}, {"author": "HiThereFellowHumans", "body": "Ooooh thank you for this question because I was just thinking about this and wanted to ask myself! \n\nIt's already been said, but Embassytown by China Mieville", "created_utc": "1559133703.0", "edited": "False", "id": "epauok1", "is_submitter": "False", "link_id": "t3_bu9gb7", "parent_id": "t3_bu9gb7", "score": "0", "subreddit": "printSF", "subreddit_id": "t5_2rzjk"}, {"author": "HiThereFellowHumans", "body": "Each teacher sets their own cost but for most languages it's $10-$20/hour. \n\nI guess this can add up quickly if you're taking classes multiple times a week, but in my experience the progress you make with private lessons is faaaar faster than any other way of doing it. AKA 110% worth the cost if you can afford it", "created_utc": "1558544704.0", "edited": "False", "id": "eofvto3", "is_submitter": "False", "link_id": "t3_brl7mh", "parent_id": "t1_eof6xjw", "score": "1", "subreddit": "learn_arabic", "subreddit_id": "t5_2v4vi"}, {"author": "HiThereFellowHumans", "body": "26", "created_utc": "1558544612.0", "edited": "False", "id": "eofvozk", "is_submitter": "False", "link_id": "t3_brotg7", "parent_id": "t3_brotg7", "score": "2", "subreddit": "digitalnomad", "subreddit_id": "t5_2r9w0"}, {"author": "HiThereFellowHumans", "body": "Take lessons on Italki or Verbling with a teacher from Palestine :-) \n\nThat's what I'm doing and I LOVE my teacher (as in, she's literally one of my favorite people in the world and I've never even meet her in real life....hopefully happening soon though). \n\nFeel free to PM if you'd like her name (otherwise, on the websites you can search by where the teachers are from so I'm sure you can find lots of other great teachers from Palestine).", "created_utc": "1558516028.0", "edited": "False", "id": "eof0lek", "is_submitter": "False", "link_id": "t3_brl7mh", "parent_id": "t3_brl7mh", "score": "7", "subreddit": "learn_arabic", "subreddit_id": "t5_2v4vi"}, {"author": "HiThereFellowHumans", "body": "This website has AMAZING conversation lesson plans: http://film-english.com/blog/\n\nI used them for my adult ESL classes and they were a big hit. Try searching with the bar at the top and see if they have anything about the topics you're doing. \n\nIf they don't have a topic/lesson you can use, read through some of his lesson plans for ideas that you can adapt to your unit now.", "created_utc": "1558403151.0", "edited": "False", "id": "eo9ybmq", "is_submitter": "False", "link_id": "t3_br08bn", "parent_id": "t3_br08bn", "score": "5", "subreddit": "TEFL", "subreddit_id": "t5_2qq76"}, {"author": "HiThereFellowHumans", "body": "So true! I think knowing Spanish helped me learn Portuguese really quickly/relatively easily....but the mixing up happens a lot. \n\nThe spelling is what gets me as well since the differences are tiny. For example, Spanish = vivir and Portuguese = viver", "created_utc": "1557303195.0", "edited": "False", "id": "emt9s2c", "is_submitter": "False", "link_id": "t3_blud34", "parent_id": "t1_emrkcox", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "HiThereFellowHumans", "body": "I guess neither of us were exactly DNs at the time we met, just nomads. Perhaps I can still answer though :-) \n\nWe met in the common area of a hostel in Croatia...and it certainly worked out because we're married now. \n\nNeither of us were locals, but we are from different countries (myself from the US and him from Brazil). No language barriers for us (his English is excellent and I've since learned Portuguese) and  cultural differences are to be respected but are mostly just fun/interesting to discover along the way. \n\nVisa barriers sucked big time though and because of that we did distance for years. And although we were both mostly \"nomadic,\" we also had some of our own individual commitments that kept us apart for a while - for example, I had some schooling that I had to go back and finish, and he had a 6-month work contract in Chile. As expected, immigration stuff got significantly easier when we got married. Mostly because he has dual citizenship with another European Union country which means I also get the \"right\" to live/stay for as long as I like anywhere within the EU with him. \n\nWe've been more less on the go (and have since both started working online) since then, currently live in Europe, and are attempting to decide where to go next. \n\nAs to changes to my life/DN plans: well, beyond it just generally being awesome to have someone at your side who wants this type of lifestyle too...it does occasionally require some sacrifices. For example, when it's just you...you can basically go where you want when you want. With someone else, you also have to consider what the other person wants and have to compromise and/or stay a bit more stationary than you'd like sometimes if the other person has a commitment. All that said, I wouldn't have it any other way!", "created_utc": "1557243326.0", "edited": "False", "id": "emqw5wg", "is_submitter": "False", "link_id": "t3_blrgfi", "parent_id": "t3_blrgfi", "score": "16", "subreddit": "digitalnomad", "subreddit_id": "t5_2r9w0"}, {"author": "HiThereFellowHumans", "body": "Agree with this!\n\nAnd 1 more thing to keep in mind: occasionally, the response \"it just sounds right\" will in fact be the right one. Not everything we do in English has a hard and fast rule (unfortunately haha) and sometimes \"it just is\" is all you can say when a student asks.\n\nedit: a word", "created_utc": "1557042361.0", "edited": "False", "id": "emjqigm", "is_submitter": "False", "link_id": "t3_bktzfl", "parent_id": "t1_emjpcgo", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "HiThereFellowHumans", "body": "Is Hans Wehr strictly for MSA? Or are there any out there for dialects (Levantine, specifically) that you know of?", "created_utc": "1556975789.0", "edited": "False", "id": "emhejwe", "is_submitter": "False", "link_id": "t3_bkdny7", "parent_id": "t1_emfxikz", "score": "1", "subreddit": "learn_arabic", "subreddit_id": "t5_2v4vi"}, {"author": "HiThereFellowHumans", "body": "Find a native speaker from Egypt to talk with ASAP (I recommend using Italki or Verbling). They can help point you in the right direction even if you're starting from the beginning. \n\nAlso find a list of most common words in Egyptian Arabic and start ruthlessly memorizing them (perhaps with Anki flashcards). Knowing the vocab is the first step to be able to talk, so I'd recommend beginning with this and then moving on to some grammar later on.", "created_utc": "1556975722.0", "edited": "False", "id": "emhegyq", "is_submitter": "False", "link_id": "t3_bkki6x", "parent_id": "t3_bkki6x", "score": "2", "subreddit": "learn_arabic", "subreddit_id": "t5_2v4vi"}, {"author": "HiThereFellowHumans", "body": "Could be an issue of either strength or them just being tight. \n\nAs to strength, I can't speak to that personally. \n\nBut as to them being tight: I used to get a lot of hip pain as well, but found with a bit of stretching each day, it's gone away completely. The first thing I do each morning is 10-15 minutes of easy yoga stretching (yoga with adrienne on youtube is amazing) and it's done the trick. \n\nI guess you could also stretch immediately after your run, but I've found the next day approach works quite well for me.", "created_utc": "1556877812.0", "edited": "False", "id": "emeaoad", "is_submitter": "False", "link_id": "t3_bk2y1i", "parent_id": "t3_bk2y1i", "score": "1", "subreddit": "running", "subreddit_id": "t5_2qlit"}, {"author": "HiThereFellowHumans", "body": "I was there a few months ago and super excited to use my Arabic....only to find that this was 100% true and it mostly just confused people. \n\nEnjoy your trip though!", "created_utc": "1556865337.0", "edited": "False", "id": "eme0fbi", "is_submitter": "False", "link_id": "t3_bk3uhx", "parent_id": "t1_emdsam9", "score": "8", "subreddit": "learn_arabic", "subreddit_id": "t5_2v4vi"}, {"author": "HiThereFellowHumans", "body": "Both are wonderful - totally depends on what you're looking for. \n\nI second answering these questions tangosolo asked before anyone here can give you an opinion.", "created_utc": "1556379191.0", "edited": "False", "id": "elx012z", "is_submitter": "False", "link_id": "t3_bhx649", "parent_id": "t1_elwndbk", "score": "2", "subreddit": "digitalnomad", "subreddit_id": "t5_2r9w0"}, {"author": "HiThereFellowHumans", "body": "Haha well, I usually only race 1-2 races max a year so this is kind of a special occasion where the budget isn't so much an issue. \n\nI think you're right though - I certainly don't imagine I can properly \"race\" both of them.", "created_utc": "1556272233.0", "edited": "False", "id": "eltixnl", "is_submitter": "True", "link_id": "t3_bh8z67", "parent_id": "t1_elsonks", "score": "1", "subreddit": "running", "subreddit_id": "t5_2qlit"}, {"author": "HiThereFellowHumans", "body": "I've never done a long trail race before, so the first race is going to be less for time/pace and more just for the experience. In which case, there shall be no going nuts :-)", "created_utc": "1556272135.0", "edited": "False", "id": "eltiv18", "is_submitter": "True", "link_id": "t3_bh8z67", "parent_id": "t1_elr8me9", "score": "1", "subreddit": "running", "subreddit_id": "t5_2qlit"}, {"author": "HiThereFellowHumans", "body": "Hey, thanks for all those training & nutrition details! \n\nIf I do decide to do this, I'll try the double weekends and see how they go.", "created_utc": "1556272075.0", "edited": "False", "id": "eltiths", "is_submitter": "True", "link_id": "t3_bh8z67", "parent_id": "t1_elr0lbz", "score": "1", "subreddit": "running", "subreddit_id": "t5_2qlit"}, {"author": "HiThereFellowHumans", "body": "I think that's what I'm leaning towards considering otherwise I'll probably just be miserable", "created_utc": "1556271327.0", "edited": "False", "id": "eltibkv", "is_submitter": "True", "link_id": "t3_bh8z67", "parent_id": "t1_elqwiuq", "score": "1", "subreddit": "running", "subreddit_id": "t5_2qlit"}, {"author": "HiThereFellowHumans", "body": "Hey - thanks for the response! \n\nWhat B2 program are you talking about? I've found a few practice tests, but those don't exactly outline the exact topics/skills you'll be tested on. \n\nUgh, and listening can be so hard to practice as well! I'm listening to the radio/audiobooks, etc. in Portuguese, but I've only been able to get the listening section recording for 2 practice exams. How did you practice for the listening section? \n\nGood to know about the speaking - I feel pretty confident in my speaking since I learned how to communicate in Port much before I did anything with grammar). But again, what B2 program do you mean? And what do you mean you can only be tested on the topics covered in the program?", "created_utc": "1556109739.0", "edited": "False", "id": "elngzwr", "is_submitter": "True", "link_id": "t3_bgs5j0", "parent_id": "t1_elnf563", "score": "1", "subreddit": "Portuguese", "subreddit_id": "t5_2sqn7"}, {"author": "HiThereFellowHumans", "body": "In Dubai and the rest of the UAE all VoIP programs (or basically anything that allows you to actually talk with your voice over the internet) are banned. \n\nThis includes Skype, Zoom, Whatsapp calls, etc. \n\nThis is the only place I've had serious issues with video calling, though. \n\nElsewhere, if the internet is on the slow side, I've found just turning off the videos seems to work fine. Also, in general, I've found Zoom to be more reliable than Skype.", "created_utc": "1556090023.0", "edited": "False", "id": "eln18q1", "is_submitter": "False", "link_id": "t3_bgoajq", "parent_id": "t3_bgoajq", "score": "1", "subreddit": "digitalnomad", "subreddit_id": "t5_2r9w0"}, {"author": "HiThereFellowHumans", "body": "Definitely possible. Some Brazilian friends of mine have 6-year-old twins and live in Puerto Rico. At home, they speak Portuguese with their parents. They study at an English school and thus speak English all day with their teacher and in their classes. With their school friends and their nanny, they speak Spanish. \n\nThe kids do mix up the languages a bit or sub in a word in another language if they don't know it, but my friends have done a lot of research into this (not to mention the wife is a linguist) and it sounds like things will straighten out as they get older. Progress with each language will be slower than if they were growing up monolingual, but that's to be expected. \n\nIt's a huge advantage to grow up learning a language (soooo much easier than learning as an adult). So if you're able to make it work with your kids, then I'd say go for it!", "created_utc": "1556054430.0", "edited": "False", "id": "elltj9r", "is_submitter": "False", "link_id": "t3_bggp3i", "parent_id": "t3_bggp3i", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "HiThereFellowHumans", "body": "Haha not really. Well, luckily Sweden is full of wonderful trails like this all over the country!", "created_utc": "1555877844.0", "edited": "False", "id": "elg44f7", "is_submitter": "False", "link_id": "t3_bfr97h", "parent_id": "t1_elg3xwh", "score": "1", "subreddit": "trailrunning", "subreddit_id": "t5_2s3qi"}, {"author": "HiThereFellowHumans", "body": "Any chance you're near Gothenburg? This looks suspiciously like where I live :-)", "created_utc": "1555877639.0", "edited": "False", "id": "elg3uit", "is_submitter": "False", "link_id": "t3_bfr97h", "parent_id": "t3_bfr97h", "score": "1", "subreddit": "trailrunning", "subreddit_id": "t5_2s3qi"}, {"author": "HiThereFellowHumans", "body": "It's certainly worth doing even if you don't actively have ITB issues :-)", "created_utc": "1555872740.0", "edited": "False", "id": "elfx6ce", "is_submitter": "False", "link_id": "t3_bfn5mv", "parent_id": "t1_elfr8qn", "score": "2", "subreddit": "running", "subreddit_id": "t5_2qlit"}, {"author": "HiThereFellowHumans", "body": "I used to have ITB issues all the time, but I \"fixed\" it by doing a lot of additional strength training. \n\nIf I slack on the strength, my ITB does act up a bit. But if I'm on top of things and keep doing this routine 3-4 days a week, it doesn't really affect my running (although it still does when I do long downhill hikes - can't win it all, I guess!)\n\nThis is the routine I use (and it'll basically be what any PT gives you): https://strengthrunning.com/2011/02/the-itb-rehab-routine-video-demonstration/", "created_utc": "1555848997.0", "edited": "False", "id": "elf0uz1", "is_submitter": "False", "link_id": "t3_bfn5mv", "parent_id": "t3_bfn5mv", "score": "5", "subreddit": "running", "subreddit_id": "t5_2qlit"}, {"author": "HiThereFellowHumans", "body": "Ooooh yes please do make the post!", "created_utc": "1555752530.0", "edited": "False", "id": "elc4o0y", "is_submitter": "False", "link_id": "t3_ber7ro", "parent_id": "t1_elb4mbu", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "HiThereFellowHumans", "body": "Ah, thank you! I've done exactly this but didn't realize that's what it was called. \n\nI used Spanish to learn Portuguese myself and I found it to be really helpful in helping me see the differences clearly between the languages & helping keep them separate in my mind", "created_utc": "1555708975.0", "edited": "False", "id": "elasguc", "is_submitter": "False", "link_id": "t3_bf235y", "parent_id": "t1_elamj6q", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "HiThereFellowHumans", "body": "What does \"laddering your languages\" mean?", "created_utc": "1555704498.0", "edited": "False", "id": "elam05q", "is_submitter": "False", "link_id": "t3_bf235y", "parent_id": "t1_elah7lm", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "HiThereFellowHumans", "body": "First of all, sorry to hear that the semester hasn't been going well. Here's to hoping things start to look up for you :-) \n\nIf you don't mind me asking, what was the cost of the EF program? Or how much were you planning to save up ?\n\nInstead of taking a 2-week intensive course at an EF school (which I imagine is very expensive), would you perhaps be able to use that time/money and spend time in a country that speaks the language you want to learn? \n\nFor one, 2 weeks is not going to get you very far in any language unless you already have a strong base, unfortunately. And rather than just 2 weeks of study (since you are taking a semester off and presumably have the time) I think you'd get a lot more out of your experience without necessarily spending more money. \n\nGroup, private lessons, or even immersion-style courses can be quite cheap depending on what country you travel to. If money is really a concern, you could also consider doing something of a volunteer exchange (where you get accomodation with a homestay that speaks the language you want to learn OR language lessons in exchange for some volunteer work).  \n\nI've done a fair amount of this type of thing and have gotten pretty good at traveling cheaply (as in, I often spend less while traveling than I do with just normal living back home), so let me know if you have any questions and I'll try to help!", "created_utc": "1555690366.0", "edited": "False", "id": "el9yy7b", "is_submitter": "False", "link_id": "t3_bezzli", "parent_id": "t3_bezzli", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "HiThereFellowHumans", "body": "Ooooh what do you think of these books so far....would you recommend them? \n\nAlso, where did you order them from? \n\n(Sorry, I'm nosy but also excited because I don't often see good resources for Shami!!)", "created_utc": "1555661164.0", "edited": "False", "id": "el93783", "is_submitter": "False", "link_id": "t3_ber7ro", "parent_id": "t3_ber7ro", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "HiThereFellowHumans", "body": "I don't have the science, but from personal experience I understand where you're coming from completely. \n\nFrankly, sometimes I think running is what keeps me sane! I know for a fact it's not just great for my physical well-being, but quite literally one of the best things I can do for my mental well-being. \n\nIt sounds so cheesy, but I really feel like running has been there for me through life's ups and downs. \n\nIt's what makes me feel (even) happy(ier) when things are going well. It's what calms me down when I'm stressed or anxious or experiencing any other emotion. It's what gives me the clear mind and space to process difficult things in life. \n\nI distinctly remember long solo runs being one of the major things that got me (and are still getting me) through my dad's death. And that the first thing I did when I got home from my grandmother's funeral was go for a loooooong run (while shedding some tears along the way, naturally). \n\nIt sounds ridiculous, but if I'm injured or go a few days without running, I definitely feel less....balanced, perhaps? Like something is off. And it just feels weird and I don't like it. \n\n Although I quite like things like mediation, yoga, and journaling to generally manage mental health, nothing quite competes like running does. \n\nAnyway, sorry about all that rambling....but yes, indeed, running makes me happy too and I'm glad you've found it :-)", "created_utc": "1555354876.0", "edited": "False", "id": "ekyn7q7", "is_submitter": "False", "link_id": "t3_bdgfq5", "parent_id": "t3_bdgfq5", "score": "11", "subreddit": "running", "subreddit_id": "t5_2qlit"}, {"author": "HiThereFellowHumans", "body": "Depends on which dialect you're asking about. \n\nI don't know about the others, but in the Levantine dialect (shami) they conjugate the verb كان (was) and then follow it with another verb conjugated in the present (but without the 'b'). \n\nExamples: \n\nكنت امشي = I was walking \nهي كانت تمشي = she was walking \n\nBased on that, I believe the sentence michalfabik gave (كنت آكل في الساعة الخامسة أمس) is correct.", "created_utc": "1554810294.0", "edited": "False", "id": "ekgmvkw", "is_submitter": "False", "link_id": "t3_bb685k", "parent_id": "t3_bb685k", "score": "4", "subreddit": "learn_arabic", "subreddit_id": "t5_2v4vi"}, {"author": "HiThereFellowHumans", "body": "Actually, it's a super low-key hotel/hostel that you can stay at! \n\nI visited the fortress, but unfortunately accommodation was booked out for like months in advance.", "created_utc": "1554751868.0", "edited": "False", "id": "eket81s", "is_submitter": "False", "link_id": "t3_bats3j", "parent_id": "t1_ekes6qr", "score": "6", "subreddit": "pics", "subreddit_id": "t5_2qh0u"}, {"author": "HiThereFellowHumans", "body": "Yes, thank you Vote_4Cthulhu - that was exactly what I was trying to say. \n\nI'm sorry if that's not how it came off, Beautdotgiles. I do absolutely believe his story is one to be heard and remembered. ", "created_utc": "1554733093.0", "edited": "False", "id": "eke000e", "is_submitter": "False", "link_id": "t3_bailof", "parent_id": "t1_ekdrhrn", "score": "1", "subreddit": "running", "subreddit_id": "t5_2qlit"}, {"author": "HiThereFellowHumans", "body": "Hi! American here who went in early 2016 and ran the 10k part of the race (weirdly enough, I actually placed 3rd and got to receive a fancy vase in the center of the largest stadium in the world since I think all the fast people ran the 1/2 and full marathons....but that's a story for another day). \n\nSo yes, Americans could go just fine before the ban. Although, it's not just a ban on the U.S. side....most tour companies (including the one I went with) no longer take Americans on their tours. \n\nBut you're right that NK actually does encourage western tourism. One reason for that is since you can only visit with an organized tour and aren't allowed to wander independently. This means that the tours will take you to the \"nice\" parts of the country with the hope that you'll return back home and tell all your friends and family what a wonderful, not-terrible-place-at-all NK is and how wrong we all are about it.  \n\nUnfortunately, there were some people dumb enough on our tour to believe all the bulls*t they were fed. Obviously, just because we didn't go to the labor camps or see all the other things that go on there doesn't mean they don't exist. \n\nThat said, if you're a bit more discerning, you can still learn quite a bit about what makes NK tick by reading \"between the lines.\" Honestly, I still have a hard time putting my experience there into words. In some ways, it was exactly as you'd expect. In other ways, it was completely different. \n\nIt was a wild experience, to say the least. \n\nAs to safety (and the chances of you being detained): basically nothing as long as you follow the rules (which really aren't that hard to follow). Thousands of foreign tourists (and plenty of Americans) have visited over the years with 0 issues. Before you depart, you get a briefing that is veryyy clear about what you can and can't do. It sounds crazy, but I felt safer visiting there than visiting many other places worldwide (although, I guess the threat here is quite different than visiting Brazil or Venezuela, as examples). \n\nAs to feeling comfortable spending money there: that's a more complicated issue (which I still question to this day). ", "created_utc": "1554665823.0", "edited": "False", "id": "ekc1zz7", "is_submitter": "False", "link_id": "t3_bailof", "parent_id": "t1_ekbrtwo", "score": "7", "subreddit": "running", "subreddit_id": "t5_2qlit"}, {"author": "HiThereFellowHumans", "body": "I thought they might be, but wasn't sure (thus the ?).   \n\n\nIn which case, thanks for mentioning it \n\n  \n\n\n&#x200B;", "created_utc": "1554656325.0", "edited": "False", "id": "ekboh0m", "is_submitter": "False", "link_id": "t3_bafqcl", "parent_id": "t1_ekb8d9w", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "HiThereFellowHumans", "body": "Arabic and Persian? \n", "created_utc": "1554640465.0", "edited": "False", "id": "ekb5jv4", "is_submitter": "False", "link_id": "t3_bafqcl", "parent_id": "t3_bafqcl", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "HiThereFellowHumans", "body": "This has 110% been my experience with learning languages. In any second language I know, I've always struggled more with listening than with speaking. For example, in Arabic right now, I speak quite well....but I don't understand much of what is said back to me (even if it's quite basic and words that I know how to say myself -- it's like my brain freezes a bit when I listen!). \n\nIt sounds like most people undergo the opposite problem (being able to understand but not speak), so they always seem surprised when I say the opposite is true for me. \n\nBut moral of the story, I don't think it means you are doing something wrong necessarily considering I happen to be exactly the same! I haven't been able to pinpoint exactly why this is true for me, but my guess is it's just something about learning styles or how your brain processes new languages. In some ways, maybe it's actually an advantage to be able to speak first :-) \n\nAt least for me, there's not really any way around it: I have to spend LOTS of time listening to my target language for my comprension to get stronger. This means having the radio with the language on in the background (even if I don't understand what it's talking about, I find just getting used to the sounds and the cadence help), listening to podcasts, watching videos, listening to music, taking classes with native speakers (through Italki or Verbling), etc. \n\nOne thing that was amazing for my Spanish comprehension was a podcast called \"Notes in Spanish.\" They have Spanish podcasts at quite a few different levels so you can start wherever you need to. \n\nAnd just one last thing that might be tripping you up: don't get too discouraged if you don't understand everything in a podcast, conversation, etc. For me, I found what was happening is I'd often get tripped up if I didn't understand a word/phrase. Then, I'd focus on trying to figure out what it was that I didn't understand and I'd miss the rest of what I was listening to. \n\nGood luck!! \n  \nEdit: a word ", "created_utc": "1554622646.0", "edited": "False", "id": "ekav5zv", "is_submitter": "False", "link_id": "t3_bad032", "parent_id": "t3_bad032", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "HiThereFellowHumans", "body": "That's good to know. It sounds like generally the most important thing is just being used to the trail terrain. \n\nWhat made you switch from road to trail completely? \n\nAs to getting hooked, well, I've always loved running on trails like a million times more than running on the road (seriously, it makes me feel like a superhero!). So, I suspect actually doing a race will just cement that :-)  ", "created_utc": "1554542053.0", "edited": "False", "id": "ek8kjyt", "is_submitter": "True", "link_id": "t3_b9wgag", "parent_id": "t1_ek7ue2w", "score": "1", "subreddit": "running", "subreddit_id": "t5_2qlit"}, {"author": "HiThereFellowHumans", "body": "Ooooh that's super helpful....thank you! ", "created_utc": "1554541829.0", "edited": "False", "id": "ek8kfj2", "is_submitter": "True", "link_id": "t3_b9wgag", "parent_id": "t1_ek812o0", "score": "1", "subreddit": "running", "subreddit_id": "t5_2qlit"}, {"author": "HiThereFellowHumans", "body": "Good luck!! ", "created_utc": "1554541781.0", "edited": "False", "id": "ek8kelp", "is_submitter": "True", "link_id": "t3_b9wgag", "parent_id": "t1_ek7mg4v", "score": "2", "subreddit": "running", "subreddit_id": "t5_2qlit"}, {"author": "HiThereFellowHumans", "body": "It's in Sweden near the city of Gothenburg :-) What's yours? \n\nAny thoughts on how you'll train for it?", "created_utc": "1554501688.0", "edited": "False", "id": "ek7j074", "is_submitter": "True", "link_id": "t3_b9wgag", "parent_id": "t1_ek7g757", "score": "1", "subreddit": "running", "subreddit_id": "t5_2qlit"}, {"author": "HiThereFellowHumans", "body": "Are there actually that many examples of that, though? \n\nI mean, there really aren't that many politicans in the U.S. that actually know a 2nd language in the first place. Which is one reason why Pete knowing more than just a 2nd language is impressive/stands out/makes people talk about him, etc. Although, if you just look at some of the comments above, lots of people are cautiously skeptical of his language claims (even if he's a democrat). \n\nI think it's been like 80 years since we've had a president in office that speaks a 2nd language if that says anything about it. \n\nAs to Republicans, who are you actually thinking of? I know Jeb Bush and Marco Rubio speak Spanish and did it on the campaign trail, but I don't think anyone had any problems with them. Beyond them, there's certainly not that many other Republican politicians that speak Spanish or another language (nor more than one more foreign language).   \n\nI do remember when Bloomberg was roasted for his Spanish skills after Hurriane Sandy, though. But frankly, if you heard the video of him speaking...but he kinda deserved the roasts (because it was pretty funny). What he did was probably more like pandering since it was clear he didn't actually speak Spanish and had just memorized a translated speech. \n\n\n\nEdit: a sentence I forgot to add ", "created_utc": "1554463384.0", "edited": "1554463686.0", "id": "ek63abv", "is_submitter": "False", "link_id": "t3_b9cveq", "parent_id": "t1_ek5wrys", "score": "6", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "HiThereFellowHumans", "body": "A different story in what way? I think the language skills would be impressive whether he was democrat or republican ", "created_utc": "1554413818.0", "edited": "False", "id": "ek4s68n", "is_submitter": "False", "link_id": "t3_b9cveq", "parent_id": "t1_ek4kf8t", "score": "6", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "HiThereFellowHumans", "body": "It sounds cliché, but I think the key is that you just speak *despite* being afraid. There's not really a way to get over the fear or prevent the fear from happening, especially at first. \n\nAs an example, I've been speaking Portuguese for years but I still occasionally have days/situations where I'm nervous to speak. But I just speak anyways (mostly because I don't have another option haha). \n\nObviously, this is easier said than done...but I highly agree with the italki recommendation below. Although the fear may stick for a while, I find 1-on-1 lessons to be one of the best ways to get more comfortable speaking. \n\nBuena suerte! ", "created_utc": "1551850705.0", "edited": "False", "id": "ehwdmag", "is_submitter": "False", "link_id": "t3_axt6jm", "parent_id": "t3_axt6jm", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "HiThereFellowHumans", "body": "I don't remember what episode exactly, but I believe the story was that some of their friends were murdered (violently and in front of them) by an atypical. The details of the murder aren't given beyond that. However, it was traumatic enough that when they later found out Mark was atypical, they just couldn't accept it.   \n\n\nSo to answer your questions: no, I don't believe it was anything Mark did specifically. ", "created_utc": "1551437464.0", "edited": "False", "id": "ehjo1ny", "is_submitter": "False", "link_id": "t3_ap9ts3", "parent_id": "t3_ap9ts3", "score": "6", "subreddit": "thebrightsessions", "subreddit_id": "t5_3bgjr"}, {"author": "HiThereFellowHumans", "body": "I was going to recommend Semantica as well. It's paid, but I really thought it was one of the best resources I used for Brazilian Portuguese (especially because it focuses on language people actually use, not just the formal language you learn in school) \n\nedit: a word", "created_utc": "1551011206.0", "edited": "False", "id": "eh645ha", "is_submitter": "False", "link_id": "t3_au2ksa", "parent_id": "t1_eh55b4c", "score": "3", "subreddit": "Portuguese", "subreddit_id": "t5_2sqn7"}, {"author": "HiThereFellowHumans", "body": "I'm married to a Brazilian and I've only ever heard it used like \"tudo bem\" or as a greeting, never as a compliment/way to flirt.  ", "created_utc": "1550831214.0", "edited": "False", "id": "eh0s4tw", "is_submitter": "False", "link_id": "t3_at9wgx", "parent_id": "t1_eh0a9hk", "score": "2", "subreddit": "Portuguese", "subreddit_id": "t5_2sqn7"}, {"author": "HiThereFellowHumans", "body": "Glad I wasn't the only one", "created_utc": "1550586201.0", "edited": "False", "id": "egsw6qo", "is_submitter": "False", "link_id": "t3_as9le2", "parent_id": "t1_egst8be", "score": "1", "subreddit": "HealthInsurance", "subreddit_id": "t5_2qnt0"}, {"author": "HiThereFellowHumans", "body": "Was going to say this same one! ", "created_utc": "1550576952.0", "edited": "False", "id": "egsn6rv", "is_submitter": "False", "link_id": "t3_as93sp", "parent_id": "t1_egsmhg6", "score": "2", "subreddit": "Portuguese", "subreddit_id": "t5_2sqn7"}, {"author": "HiThereFellowHumans", "body": "I have a lot of ITB band issues as well, so I do this routine 3-4 days a week (after every run): https://strengthrunning.com/2011/02/the-itb-rehab-routine-video-demonstration/ \n\nIt's been super helpful and my IT band rarely acts up these days. You do need to get elastic bands, though. \n\nAs to hip issues, I've found if I don't stretch/do yoga regularly (I highly recommend \"yoga with adriene\" 10-20 minute videos on youtube) then my hip starts to get angry. \n\nOn days I don't run (so usually 2-3 days a week), I do strength training for abs & upper body. I don't go to the gym or anything, but just do bodyweight (or elastic band) exercises at home. I know these are spots that runners don't always think about, but I've noticed a big difference in how running feels now that I've built up my full body strength. \n\nGood luck on the marathon training! \n", "created_utc": "1549801470.0", "edited": "False", "id": "eg5gz47", "is_submitter": "False", "link_id": "t3_ap0vbv", "parent_id": "t3_ap0vbv", "score": "9", "subreddit": "xxfitness", "subreddit_id": "t5_2ryzy"}, {"author": "HiThereFellowHumans", "body": "I second Toggl. It's free and you can also download PDFs of your reported hours to send to your clients if need be. ", "created_utc": "1549621107.0", "edited": "False", "id": "eg0dazp", "is_submitter": "False", "link_id": "t3_ao9kgy", "parent_id": "t1_efz868n", "score": "2", "subreddit": "WFH", "subreddit_id": "t5_2s7wa"}, {"author": "HiThereFellowHumans", "body": "I think I saw another thread asking almost the same question a 2-3 days ago on r/languagelearning, and there was lots of good advice there. \n\nMight be helpful to find it for more comments/ideas :-) ", "created_utc": "1549482942.0", "edited": "False", "id": "efw4kwq", "is_submitter": "False", "link_id": "t3_anrgpy", "parent_id": "t3_anrgpy", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "HiThereFellowHumans", "body": "1:55 it is then :-) ", "created_utc": "1549367243.0", "edited": "False", "id": "efsftcz", "is_submitter": "False", "link_id": "t3_an85l9", "parent_id": "t1_efrku8y", "score": "3", "subreddit": "running", "subreddit_id": "t5_2qlit"}, {"author": "HiThereFellowHumans", "body": "Haha you're definitely not the only one!   \n\n\nIt kind of makes sense that would happen with similar languages (like Spanish/Portuguese or French/Spanish) and usually people don't mind, but things start to get a little more embarrassing/ridiculous when I'm speaking in Portuguese and a random Arabic word comes out (thus confusing everyone around me even more than myself) ", "created_utc": "1549366866.0", "edited": "False", "id": "efsfk2i", "is_submitter": "False", "link_id": "t3_ancmk8", "parent_id": "t1_efsfde5", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "HiThereFellowHumans", "body": "When I was really working on my Spanish comprehension, the \"Notes in Spanish\" podcasts were amazing! They have them for different levels (beginner, intermediate, advanced & upper advanced) ", "created_utc": "1549366735.0", "edited": "False", "id": "efsfgw4", "is_submitter": "False", "link_id": "t3_anahh9", "parent_id": "t3_anahh9", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "HiThereFellowHumans", "body": "Ugh, this is totally something I struggle with as well.   \n\n\nI find it's helpful if I do mini \"immersions\" of each language instead of doing a bit of several on a single day. For example, if I'm studying Arabic & Farsi, I might study Arabic Monday to Thursday and then Farsi Friday to Sunday. Or do 1 week of Arabic focus, 1 week of Farsi focus, etc. etc.   \n\n\nI find this helps me not only progress faster, but also solidify my skills in whatever I was learning that week more before I transition to something else.   \n\n\nSometimes, though, you just can't help mixing things up. I think the most confusing thing in the world for me was when I went to a party in Puerto Rico (meaning I needed to speak Spanish with a lot of people) with a group of Brazilian friends (meaning I neede to speak in Portuguese with them). Honestly, by the end of the night I had no idea which language was even coming out of my mouth anymore :-) ", "created_utc": "1549366327.0", "edited": "False", "id": "efsf7bo", "is_submitter": "False", "link_id": "t3_ancmk8", "parent_id": "t3_ancmk8", "score": "4", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "HiThereFellowHumans", "body": "If you want to work in a private school (AKA a \"hagwon\"), be very careful about the position you choose. \n\nSome hagwons are great, others are an absolute nightmare. Ask to speak to a current/former foreign teacher and definitely check to make sure the school isn't on any blacklists. \n \nGood luck!  \n", "created_utc": "1549356696.0", "edited": "False", "id": "efs9sjl", "is_submitter": "False", "link_id": "t3_an5qdf", "parent_id": "t3_an5qdf", "score": "1", "subreddit": "TEFL", "subreddit_id": "t5_2qq76"}, {"author": "HiThereFellowHumans", "body": "Likely not, especially since your university will likely teach you MSA and not a dialect. \n\nIt may help with job prospects, though. ", "created_utc": "1549356428.0", "edited": "False", "id": "efs9n5m", "is_submitter": "False", "link_id": "t3_an7ypy", "parent_id": "t3_an7ypy", "score": "3", "subreddit": "learn_arabic", "subreddit_id": "t5_2v4vi"}, {"author": "HiThereFellowHumans", "body": "I think it's worth it (and I'm learning Shami as well), but I got an lifetime membership a while ago (like a year and a half or more) for something like $99.   \n\n\nDo they have a lifetime membership option still? It may be worth doing that considering they do continue to upload new videos. Otherwise, if you have doubts, perhaps just try a month for $15 to you like it?   \n\n\nI've had a hard time finding good material in Shami as well, so TalkinArabic has been really useful (especially since I always seem to struggle with listening comprehension more than anything else when I learn languages).   \n\n\nGood luck! ", "created_utc": "1549317482.0", "edited": "False", "id": "efr4z99", "is_submitter": "False", "link_id": "t3_acx91c", "parent_id": "t3_acx91c", "score": "1", "subreddit": "learn_arabic", "subreddit_id": "t5_2v4vi"}, {"author": "HiThereFellowHumans", "body": "I've seen a few people recommend resistance bands and I definitely agree. If you don't have access to weights, they are probably the next best thing (plus they are super light & easy to pack). \n\nAs to hotel room workouts, I'm a big fan of Casey Ho (just search \"Blogilates\" on Youtube). If you go to her website, she also has a monthly calendar plus a few beginner calendars you can follow. Her videos are great, you don't need equipment for most of them, and I just like her as a person (honestly, she feels so much more \"real\" than people like Kayla and also more like an actual human rather than an intimidating fitness model haha). ", "created_utc": "1549309408.0", "edited": "False", "id": "efqtaxt", "is_submitter": "False", "link_id": "t3_an21yb", "parent_id": "t3_an21yb", "score": "4", "subreddit": "xxfitness", "subreddit_id": "t5_2ryzy"}, {"author": "HiThereFellowHumans", "body": "Just downloaded -- thanks OP! ", "created_utc": "1548933394.0", "edited": "False", "id": "effjaap", "is_submitter": "False", "link_id": "t3_alecei", "parent_id": "t3_alecei", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "HiThereFellowHumans", "body": "Only in some parts of Brazil (like the northeast).   \n\n\nIn São Paulo, for example, you'll never hear someone use \"tu\" ", "created_utc": "1548932716.0", "edited": "False", "id": "effip73", "is_submitter": "False", "link_id": "t3_alhf38", "parent_id": "t1_effe98u", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}]