[{"author": "honjapiano", "body": "hmm stairway to heaven isn’t easy either. not that it’s near the level of la campanella. i was thinking more that it’s very overplayed.", "created_utc": "1666890773.0", "edited": "False", "id": "iu0g8mz", "is_submitter": "False", "link_id": "t3_yeolw9", "parent_id": "t1_iu0cbgv", "score": "2", "subreddit": "piano", "subreddit_id": "t5_2qnw8"}, {"author": "honjapiano", "body": "river flows in you, chopsticks, für elise, experience by einaudi, la campanella. so many more", "created_utc": "1666885380.0", "edited": "False", "id": "iu02cin", "is_submitter": "False", "link_id": "t3_yeolw9", "parent_id": "t3_yeolw9", "score": "5", "subreddit": "piano", "subreddit_id": "t5_2qnw8"}, {"author": "honjapiano", "body": "Ayee outro estudante português europeu!\n\nI found Card Captor Sakura and Pokémon as dub options on Netflix (EU Pt is listed as Portuguese in Canadian Netflix, at least), and I’m pretty sure they’re the original dubs. \n\nSailor Moon, I found on Desporto Sapo but I think it was taken down 😔 I’m on the search for another place to stream it. \n\nI found out that they had Pt dubs from [this video](https://youtu.be/6ldWoicz9hk)", "created_utc": "1666877980.0", "edited": "False", "id": "itzk39p", "is_submitter": "False", "link_id": "t3_ydz78y", "parent_id": "t1_itzfeec", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "honjapiano", "body": "I dont know any native cartoons, though the Portuguese and Spanish dubs of animes tend to be really good. Especially the older animes like Sailor Moon, Card Captor Sakura or Pokémon because they were localized to the regions. The animes also have BR or EU Portuguese options, which is cool.", "created_utc": "1666809546.0", "edited": "False", "id": "itw04w9", "is_submitter": "False", "link_id": "t3_ydz78y", "parent_id": "t3_ydz78y", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "honjapiano", "body": "I was a kid that ignored grammar and learned the accent instead. While I dont recommend doing this (my writing is atrocious), I basically learned the accent through mimicking tv shows and singing songs. I always tried to \"sound french\", so I would repeat sentences from google translate (I also don't recommend translators now though... this was 2010) and later on, Netflix. I found that really helpful and do it today with French and my other language studies. Just make sure that you're listening to the accent you want. Québécois vs Belgian vs Congolese vs French are all different.\n\nThe more you practice speaking full sentences, even if they aren't necessarily your sentences, the easier it will be to have them come out naturally. I've been speaking French since elementary school, and I still stumble over words and stand silently, waving my hands and waiting for a word to come to me.\n\nDepending on how long you've studied the language, it might just come with time. I've been slowly learning Spanish for yearssss and only recently got the hang of the R,,, and only for Ra or Re sounds.\n\nThe best way I can describe the French R is that it's like gargling water without the water. It's a roll in the back of your mouth/top of your throat. It'll sound god awful at first, but if you practice it, you can tone down and soften it.", "created_utc": "1666809365.0", "edited": "False", "id": "itvzo7n", "is_submitter": "False", "link_id": "t3_ydyjrx", "parent_id": "t3_ydyjrx", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "honjapiano", "body": "If I’m honest, I kinda just practice when I walk by the piano. I sit and work on two lines, or do a run through, and then I’m done and move on. Mostly when I’m waiting for my tea to heat up or the oven to preheat. \n\nI’m an awful practice-er, because I’ll get nothing done if i’m not in the mood for it. End of the day, get what you can done, and don’t pressure yourself to get everything done every session. Putting stress into your practice is going to make you less motivated and probably isn’t as effective.", "created_utc": "1666660402.0", "edited": "False", "id": "itnzdor", "is_submitter": "False", "link_id": "t3_yceg2w", "parent_id": "t3_yceg2w", "score": "1", "subreddit": "piano", "subreddit_id": "t5_2qnw8"}, {"author": "honjapiano", "body": "If I’m honest, I kinda just practice when I walk by the piano. I sit and work on two lines, or do a run through, and then I’m done and move on. Mostly when I’m waiting for my tea to heat up or the oven to preheat. \n\nI’m an awful practice-er, because I’ll get nothing done if i’m not in the mood for it. End of the day, get what you can done, and don’t pressure yourself to get everything done every session. Putting stress into your practice is going to make you less motivated and probably isn’t as effective.", "created_utc": "1666660369.0", "edited": "False", "id": "itnzawt", "is_submitter": "False", "link_id": "t3_yceg2w", "parent_id": "t3_yceg2w", "score": "13", "subreddit": "piano", "subreddit_id": "t5_2qnw8"}, {"author": "honjapiano", "body": "I learned French, then Portuguese and now Spanish. The hardest thing is not mixing them up. I still do it from time to time! At first it’s really helpful, using french grammar to infer spanish rules, and a lot of the root words are the same, so it’s great for comprehension. Speaking is where the trouble is,,, but that just gets better the more you immerse yourself in the language. I found language stacking to make code-switching even worse. \n\nI’d say to go: French -> Italian -> Portuguese -> Spanish, just because I think they relate to each other in that order (and i’ve heard that Spanish is easier for Portuguese speakers than Portuguese is for Spanish). But that’s just my own opinion. In the end, you can do it in whatever order you want. There’s no real “way” to do it.\n\nWhat’s nice about the remaining three is that the other two will be easier to learn. I think French is the furthest from all of them. Learn the language that interests you the most, and the other two will come easier. \n\nI personally skipped Italian all together, learned Portuguese from my parents, and am now taking a Spanish course.", "created_utc": "1666388402.0", "edited": "False", "id": "it9ajug", "is_submitter": "False", "link_id": "t3_y9siuy", "parent_id": "t3_y9siuy", "score": "7", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "honjapiano", "body": "Hi, thanks for the reply! I’ll work on holding onto sleep darts and maintaining high ground. I think most of it is panic, but that’s okay. \nMy accuracy with projectiles is worse than hitscan, so I tend to stay scoped in for almost all my shots. I’ll work on that too. Thanks again!", "created_utc": "1666277364.0", "edited": "False", "id": "it2r5l8", "is_submitter": "True", "link_id": "t3_y8kkx1", "parent_id": "t1_it1hae3", "score": "1", "subreddit": "OverwatchUniversity", "subreddit_id": "t5_3ejpe"}, {"author": "honjapiano", "body": "Hi, thanks for the reply and advice! I definitely panic-sleep dart a lot. I’ll pay attention to that (and everything else) from now on :)\n\nI’m curious about what you thought about the nano on Bap. I got flamed for it, but my intention was to keep him alive because I knew we were both going to die. Was it a bad move? \n\nAlso, you’re English is pretty solid, so dont worry about that.", "created_utc": "1666277138.0", "edited": "False", "id": "it2qlag", "is_submitter": "True", "link_id": "t3_y8kkx1", "parent_id": "t1_it23cf1", "score": "2", "subreddit": "OverwatchUniversity", "subreddit_id": "t5_3ejpe"}, {"author": "honjapiano", "body": "using corners is really important in ow2 and esp to Cass since he’s a little squishier without his stun. Don’t be afraid to use your ult to secure two kills. Sometimes getting just one pick makes a big difference (especially if it’s a support).\n\ni’m not a dps player, so i can’t personally give a lot more advice, but you might want to check out [Wanted’s youtube channel.](https://youtube.com/c/JWantedL) They’re a high level Cass player with some educational videos. Plus, just watching what high level players do might help you a bit. KarQ’s 1 tip for every hero video might be useful too \n\nComp is a really rough place, by the way. I have a good win ratio on all roles in qp, but get stomped in comp. Depending on how new you are to comp, the system might just be trying to place you in the right elo, so it should get a little easier. Although, with the comp bug at the beginning of ow2, it may take a little longer than usual.", "created_utc": "1666234659.0", "edited": "False", "id": "it0vwef", "is_submitter": "False", "link_id": "t3_y8lze1", "parent_id": "t3_y8lze1", "score": "2", "subreddit": "OverwatchUniversity", "subreddit_id": "t5_3ejpe"}, {"author": "honjapiano", "body": "to be honest, i’d recommend just speaking more and don’t worry about speaking quickly. practice speaking slowly with the correct sentence structure. you’ll get used to it and be able to reproduce it faster later on. \n\nalso, don’t worry too much about saying all the words in the right order. i do some of my university degree in french and i still don’t always get it right. just get more comfortable with the language, some review by reading out loud or talking to yourself, and don’t put any pressure on yourself to speak quickly or perfectly. speaking at the early stages of language acquisition is going to be slow. \n\ni usually wouldn’t recommend duolingo, but their writing exercises can be useful because it’ll force you to put the words in the right order. that might be an easy way to review.", "created_utc": "1666234172.0", "edited": "False", "id": "it0uvfd", "is_submitter": "False", "link_id": "t3_y8c7dt", "parent_id": "t3_y8c7dt", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "honjapiano", "body": "If you’re looking for your own stats, the tracker network is working on an app for OW2 like they have with Val. I have no idea if that’s what you’re looking for, but if you’re a number nerd like me, then it might be something to keep an eye out for.", "created_utc": "1666233651.0", "edited": "False", "id": "it0tr1f", "is_submitter": "False", "link_id": "t3_y8g99t", "parent_id": "t3_y8g99t", "score": "2", "subreddit": "OverwatchUniversity", "subreddit_id": "t5_3ejpe"}, {"author": "honjapiano", "body": "I had ow before, so I had her anyway, but I got there a few days ago", "created_utc": "1666194246.0", "edited": "False", "id": "isy5xei", "is_submitter": "False", "link_id": "t3_y7vxd9", "parent_id": "t3_y7vxd9", "score": "1", "subreddit": "Overwatch", "subreddit_id": "t5_2u5kl"}, {"author": "honjapiano", "body": "For cooldown management, it mostly comes with time, but you can also watch Flats’ “spectating bronze” series. Although it’s spectating people who are at the lowest in the ranking, he’s spectated a bunch of characters from all the roles and he talks a LOT about fundamentals that you might find really useful. \n\nHell, I learned a lot from watching his bronze tank videos even as a support main. Also, Emongg talks a lot about Zarya shield and general utility [here](https://youtu.be/ity3Ugt5ymk), and has a bunch of DVa VOD reviews and gameplay. \n\nAs for ult usage, it really depends on the situation. Don’t hold onto it and try to only go for a 4k+ with his ult because jumping in the middle of the enemy team might get you melted before the voice line finishes. Sometimes getting two picks on their support, or finishing off their tank when they’re not paying attention is huge.\n\nI don’t play reaper at all, really, so I can’t give much more than that. [This video](https://youtu.be/tBYXmr7P2Ik) is pretty old (you can’t wraith out of zarya’s grav anymore) but still has some good tips for dealing with other heroes.", "created_utc": "1666194223.0", "edited": "False", "id": "isy5v9p", "is_submitter": "False", "link_id": "t3_y73ztr", "parent_id": "t1_isxy639", "score": "2", "subreddit": "OverwatchUniversity", "subreddit_id": "t5_3ejpe"}, {"author": "honjapiano", "body": "some people find it really useful to write notes and put words down, but i just watch the show and try to understand as much as possible with the subtitles if i need them. \n\ni’m watching Elite (Spanish Netflix show), and at first I understood barely anything unless I slowed the show down to 0.5, but I’m a season in and have picked up a lot of words just through context and repetition. \n\nI do use a subtitle chrome extension that will highlight and translate words if you hover them, so that helps. I think it was called Language React or something.", "created_utc": "1666151292.0", "edited": "False", "id": "isw8v47", "is_submitter": "False", "link_id": "t3_y7h24m", "parent_id": "t3_y7h24m", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "honjapiano", "body": "i recommend finding short and easy pieces that you’ve never heard or played before. sight read through them or learn them. i used to go through all my lower level piano books before each lesson and play two to three lines of a piece i didn’t play when i was at that level. \n\nif you keep reading new pieces, it’ll prevent you from automatically learning by ear bc you know the tune already. \n\ni will say: playing without listening can be really bad. yes, being able to learn and identify notes is really important, but audiation is SO important. i always had a really good ear and tended to learn a lot by it, so my sight reading is a little weaker. i just have to remind myself to go slowly, because sometimes my ear is wrong — maybe there’s an unexpected note that sounds wrong to me, but it’s really right. \n\nit’s okay (and actually really great) to work on your plain reading skills, but don’t let that affect your audiation, because knowing the notes only takes you so far in sounding good. a lot of people i know play the notes perfectly but don’t sound as good as others who play “by ear”; not that they learned without sheer music, but they play more by sound than ink.", "created_utc": "1666150982.0", "edited": "False", "id": "isw8abv", "is_submitter": "False", "link_id": "t3_y7m6l7", "parent_id": "t3_y7m6l7", "score": "2", "subreddit": "piano", "subreddit_id": "t5_2qnw8"}, {"author": "honjapiano", "body": "20/20 two weeks in a row, somehow", "created_utc": "1666118419.0", "edited": "False", "id": "isu41po", "is_submitter": "False", "link_id": "t3_y7ceyj", "parent_id": "t3_y7ceyj", "score": "1", "subreddit": "Overwatch", "subreddit_id": "t5_2u5kl"}, {"author": "honjapiano", "body": "Kayo! The bane of my existence! (jk, raze is worse). Welcome to Overwatch! \n\nIn the beginning, watching educational videos helped me a LOT — same with val. The first thing I’d do is try out all the characters that you have. Maybe even some more in the practice range if not all of them are unlocked. Check out their kit, see how it’s used, look at their cooldowns, etc. Having a good understanding of how each hero works makes it easier to learn them them as well as counter them. \n\nBut if there’s a certain role you like, start off with some educational vids! ML7, KarQ, and Flats are the ones that I really like. (ML has [a great beginners guide](https://youtu.be/hiGCWJX89uY) that goes over the different game modes, heroes, and other tips for general players. \n\nif you’re interested in Tank, 100% recommend watching Flats! He’s done a bunch of vod reviews and, although he can be harsh sometimes. he talks a lot about positioning, decision making and stuff like that. If you want to focus on DVA or Zarya, Emongg might be one to look at/watch. I’m not sure if he has a lot of educational stuff, but I know he’s great at those two. \n\now game sense is very different from val, and that’ll just come with time. learning the maps, flank routes, and how to aim at always moving fast targets are some things that are important. in the end, you’ll learn a lot just by playing and dying a shitton—have fun and don’t give up!", "created_utc": "1666100584.0", "edited": "False", "id": "issvpub", "is_submitter": "False", "link_id": "t3_y73ztr", "parent_id": "t3_y73ztr", "score": "2", "subreddit": "OverwatchUniversity", "subreddit_id": "t5_3ejpe"}, {"author": "honjapiano", "body": "My mum (over 50) always said she wanted to learn piano but never did, so I got her lessons and she’s really skyrocketed in a short time. \n\nI’d say the most important thing is to find a teacher that will actually help you with your goal—blues. Find a blues and/or jazz teacher. Classical piano and jazz/blues have some very different fundamentals, so learning all of that from the beginning is really important. I know that seems really obvious but it’s really important. A good teacher makes a HUGE difference — and there’s no shame in changing teachers if one isn’t working for you!\n\nAnd maybe find beginner theory books that outline chord progressions and stuff. Structure is really important to blues, so there’ll be more focus on chords and their relationship to one another. \n\nAlso, basic finger exercises like Hanon or Czerny, but maybe non-classical versions. Getting your fingers warmed up is big, especially if you’ve never played piano before. A lot of people struggle with all the movement, but those exercises build good muscle memory and they’re short.", "created_utc": "1666099712.0", "edited": "False", "id": "issttqe", "is_submitter": "False", "link_id": "t3_y6t3ie", "parent_id": "t3_y6t3ie", "score": "2", "subreddit": "piano", "subreddit_id": "t5_2qnw8"}, {"author": "honjapiano", "body": "you’re not doing anything wrong. you’re just new. even if you have great mechanical skills, the pace of the game and the way the game is played might not have clicked yet. \n\nwhen i first started, it took me a while to realize that i’d been playing in a way that would tilt people — running into enemies as ana or mercy, making bad decisions because i’m panicking, etc. i got flamed, and it was a bit discouraging because ow was my first fps ever (only been playing two years), but it helped me learn the game. \n\nbut i learn by fire. i’d say, you’d learn a LOT by watching high level streamers’ educational videos and just gameplay in general. i learned a lot from ml7 and flats’ content. \n\nquick play is casual though. the only thing less casual is arcade (i used to only play dps in no-limits bc i was scared). if people are wrongfully and unrelentingly flaming me or a teammate, i always just say “imagine getting tilted in qp”, bc it pisses them off but also should remind them that it’s not comp. if they want something serious, they should be in comp. \n\nsometimes they do have a point, but (esp if you’re support), it’s usually just people who are already having a bad run and want to take it out on someone. the game also might be trying to adjust your mmr to get playing with people your level. \n\nbut keep at it! i swear the flaming lessens (never goes away tho) and sometimes, you might be inclined to flame people. don’t. it’s hardly worth it.", "created_utc": "1666098701.0", "edited": "False", "id": "issrp5a", "is_submitter": "False", "link_id": "t3_y6rrh2", "parent_id": "t3_y6rrh2", "score": "1", "subreddit": "OverwatchUniversity", "subreddit_id": "t5_3ejpe"}, {"author": "honjapiano", "body": "not sure about ABRSM, but for RCM 7/8 they weren’t really tough, you just needed to have good sightreading skills to do them. i was awful at sight reading. absolutely deplorable, but from what i remember, a lot of them are pattern based, so identifying them and creating chunks of information to simplify the piece helped me. \n\ndon’t stop if you make a mistake! there’s no harm in playing slowly. also 10/10 recommend just sight reading more — get a book, or go through your own books before each practice session and aight read two lines from a piece you never played. \n\nit’s been a few years since i did exams, but good luck!", "created_utc": "1666098107.0", "edited": "False", "id": "issqhpg", "is_submitter": "False", "link_id": "t3_y6ym09", "parent_id": "t3_y6ym09", "score": "2", "subreddit": "piano", "subreddit_id": "t5_2qnw8"}, {"author": "honjapiano", "body": "he does! i’m lucky that i can sleep the genji’s at my level with some sort of consistency, but if i miss then almost my entire team is wiped before i can blink", "created_utc": "1666097376.0", "edited": "False", "id": "issp0ld", "is_submitter": "False", "link_id": "t3_y6vglj", "parent_id": "t1_isrxt3u", "score": "1", "subreddit": "Overwatch", "subreddit_id": "t5_2u5kl"}, {"author": "honjapiano", "body": "they’re not worse tho. they’re different. people have been saying since the beta that support is going to change as a role and not be so healbot. you have to learn to position, survive and win duels", "created_utc": "1666097251.0", "edited": "False", "id": "issorkn", "is_submitter": "False", "link_id": "t3_y6vglj", "parent_id": "t1_iss2aec", "score": "1", "subreddit": "Overwatch", "subreddit_id": "t5_2u5kl"}, {"author": "honjapiano", "body": "sombra is really annoying and 100% needs nerfs. i’ve found that people are way more open to grouping up and playing as a team. some games, they ignore pings, but others, i find my dps to be more responsive. maybe it’s just cuz i don’t use voice chat, so i had no way of communicating outside typing in ow1", "created_utc": "1666096621.0", "edited": "False", "id": "issnjo5", "is_submitter": "False", "link_id": "t3_y6vglj", "parent_id": "t1_isrw350", "score": "1", "subreddit": "Overwatch", "subreddit_id": "t5_2u5kl"}, {"author": "honjapiano", "body": "i don’t mean carry in a team fight by getting a 5k by yourself. i mean carry with your kit. you can enable your team so much more now, even if you’re being focused by the enemy team.", "created_utc": "1666096433.0", "edited": "False", "id": "issn6lg", "is_submitter": "False", "link_id": "t3_y6vglj", "parent_id": "t1_isrvd6r", "score": "1", "subreddit": "Overwatch", "subreddit_id": "t5_2u5kl"}, {"author": "honjapiano", "body": "i’m a low elo support so that’s how i learned to play. it was only near the end of ow1 that i found out i could play differently. but even then, i found myself healing like crazy because having two bronze tanks that are feeding machines doesn’t always allow for much more. \n\ni ended up really like playing a more dps-ana and ow2 let’s me do that a lot more", "created_utc": "1666096211.0", "edited": "False", "id": "issmrp4", "is_submitter": "False", "link_id": "t3_y6vglj", "parent_id": "t1_isrvjde", "score": "1", "subreddit": "Overwatch", "subreddit_id": "t5_2u5kl"}, {"author": "honjapiano", "body": "I feel like support’s better right now. Yes, being flanked sucks ass esp if your other teammates are completely unaware or ignore calls/pings, but i’m so glad not to sit behind two tanks and healbot until some random flanker kills me or until my tanks over extend and die. i can do damage, i can get big nades without 45 shields and a doomfist in the way, etc. \n\ni feel like the role has way more impact. “skill issue” tho is so tilting, especially when the people saying that aren’t support. i think we have the ability to carry, but there’s only so much you can do when 3/5 teammates are brain afk… but then again, that’s no different from ow1.", "created_utc": "1666068215.0", "edited": "False", "id": "isrm589", "is_submitter": "False", "link_id": "t3_y6vglj", "parent_id": "t3_y6vglj", "score": "47", "subreddit": "Overwatch", "subreddit_id": "t5_2u5kl"}, {"author": "honjapiano", "body": "wait that’s genius. i can’t believe i didn’t think of tracking it like that! \n\ni understand the stress of being stuck at 18. last week i was stuck at 19 for two days before witnessing a team kill with a stray dva bomb while backfilling.", "created_utc": "1666067767.0", "edited": "False", "id": "isrlga3", "is_submitter": "False", "link_id": "t3_y6wrxz", "parent_id": "t1_isrl9nq", "score": "4", "subreddit": "Overwatch", "subreddit_id": "t5_2u5kl"}, {"author": "honjapiano", "body": "i’ve succeeded with that one pretty easily. the one that nearly made me rage was the “win 10 games each in two different roles” bc there’s no way to tell if you’re close! grinded out tank so much in qp just to get it", "created_utc": "1666067507.0", "edited": "False", "id": "isrl1i1", "is_submitter": "False", "link_id": "t3_y6wrxz", "parent_id": "t3_y6wrxz", "score": "37", "subreddit": "Overwatch", "subreddit_id": "t5_2u5kl"}, {"author": "honjapiano", "body": "My mum quit after a year-ish of lessons due to some family stuff as a kid (7-ish) but successfully came back to it 45 years later when I got her some lessons with my teacher for christmas. \n\nthe beginning is tough, especially if you quit early and didn’t develop hand coordination and stuff like that. without a teacher, i would think it’s a little harder too. \n\nmy advice would change depending on how far you got before, but piano is very much like riding a bike. you’ll get the bulk of it back after refreshing for a while — even if it feels slow at first. the sight reading is a bit different… that’s a muscle that you’ll have to train again just by practice. \n\nif you don’t have any theory books, then i’d say it might be good to take a look at a new piece every once and a while. doesn’t have to be anything that you would play, but try to identify the key signature, patterns, name random intervals (major/minor/perfect/etc), name chord progressions and inversions, key changes made outside the key signature. \n\nbeing able to identify those musical structures helps a lot with sight reading, as you’ll recognize them and would likely be able to play them with less thought.", "created_utc": "1666067424.0", "edited": "False", "id": "isrkwqb", "is_submitter": "False", "link_id": "t3_y6fvvg", "parent_id": "t3_y6fvvg", "score": "2", "subreddit": "piano", "subreddit_id": "t5_2qnw8"}, {"author": "honjapiano", "body": "i’ve seen some great comments already, so I probably wont add anything to the conversation, but unclench your jaw! it makes a huge difference for me. it looks stupid, but if i can’t relax, i practice with my mouth open and loose. sometimes i clench my jaw and i have no idea for a while, which makes me tense up like crazy. dont let your teeth touch", "created_utc": "1666046854.0", "edited": "False", "id": "isqf66w", "is_submitter": "False", "link_id": "t3_y6gvne", "parent_id": "t3_y6gvne", "score": "2", "subreddit": "piano", "subreddit_id": "t5_2qnw8"}, {"author": "honjapiano", "body": "Ten years in, I still find myself with that pain when I play with my fingers more than my arms and if I'm stiff.\n\nI unfortunately don't have a solution, but if you notice you're tense, take a short break (make a tea or something) and come back to it. Also, sometimes playing with my jaw loose/open works for me -- obviously not all the time, but when I notice I'm tense, I stop, shake out my jaw, and force myself to play with a slack jaw. Having tension in your jaw while focusing will make you tense all the way down your body.", "created_utc": "1666043957.0", "edited": "False", "id": "isq8rmg", "is_submitter": "False", "link_id": "t3_y6gc5f", "parent_id": "t3_y6gc5f", "score": "1", "subreddit": "piano", "subreddit_id": "t5_2qnw8"}, {"author": "honjapiano", "body": "Easiest: Spanish. I’ve found the grammar and comprehension very straight forward and really easy. \n\nHardest: Portuguese. Holy shit I can’t speak the language at all! I understand it perfectly and I can read no problem but I can’t produce anything. I can’t speak or write to save my life. It’s been really really hard and, despite it being my family’s language, I never get to practice it. \n\nA language I found easier than people said: Japanese. Now, I would never imply that Japanese is an easy language, especially with Kanji, but I was amazed at how much I could understand in a short period of time. I didn’t put a whole lot of time or effort into it. Just some duolingo to hit my daily goal, but by the time I got to the second checkpoint, I was able to understand a Studio Ghibli movie with relative ease. The kanji tho… that’s not so easy.", "created_utc": "1666016073.0", "edited": "False", "id": "isocuxd", "is_submitter": "False", "link_id": "t3_y63pu2", "parent_id": "t3_y63pu2", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "honjapiano", "body": "so… i write on wattpad but publish on ao3. i’d say wattpad is a great place to start if you’re feeling intimidated by ao3, but ao3 is definitely the better platform imo", "created_utc": "1665976639.0", "edited": "False", "id": "ismqead", "is_submitter": "False", "link_id": "t3_y5prs3", "parent_id": "t3_y5prs3", "score": "1", "subreddit": "FanFiction", "subreddit_id": "t5_2r5kb"}, {"author": "honjapiano", "body": "If you like hitscans, definitely go for Ashe, Cass and Soldier. Sojourn might be some fun too.\n\nIf you’re ever up for trying support at any point, Ana might be a good introduction. Her DPS is relatively low, but she has a cool kit and she’s very aim-dependent. Bapstiste’s primary fire reminds me of the stinger/bulldog, so that might feel right at home for you too.", "created_utc": "1665812721.0", "edited": "False", "id": "isdw91f", "is_submitter": "False", "link_id": "t3_y3ypdk", "parent_id": "t3_y3ypdk", "score": "1", "subreddit": "OverwatchUniversity", "subreddit_id": "t5_3ejpe"}, {"author": "honjapiano", "body": "Nope. That’s where accidentals can get a bit confusing. So, in the key signature, an accidental implies that /all/ (let’s say) B’s are flat. But, if it’s used as a regular accidental (not key signature) then it’s only that specific note. \n\nSo, if you’re in D major, Fs and Cs are sharp. But if one bar shows that middle C is natural, then all middle C’s in that bar are natural — only middle C. You could have a C an octave lower or higher in the same bar, but unless those are also denoted with a natural, they will remain sharp.", "created_utc": "1665812126.0", "edited": "False", "id": "isdvgfc", "is_submitter": "False", "link_id": "t3_y4aiil", "parent_id": "t1_isdul1j", "score": "6", "subreddit": "piano", "subreddit_id": "t5_2qnw8"}, {"author": "honjapiano", "body": "the key signature always related to the entire piece (both/all clefs). once it’s stated at the first bar of each line (or after a key change), they’re all implied. so, if you see an F# in the first bar, assume that all F’s are # unless otherwise noted. \n\nOnce an accidental is noted (outside the key signature), that specific instance of the note remains altered until the end of the bar. So, if the F5 is made natural, all F5s after that are natural until the bar ends.  \n\nSometimes, if the accidental is made natural in a previous bar or in a different hand, the next note that’s played will have a “courtesy accidental”. Ex. If it’s Bb in the key signature, but in one bar, i play B natural, the next B i play that’s not in the same bar might have a flat again, just to remind you that they’re back to flats. \n\nI hope that makes sense", "created_utc": "1665811190.0", "edited": "False", "id": "isdu5s4", "is_submitter": "False", "link_id": "t3_y4aiil", "parent_id": "t1_isdslno", "score": "11", "subreddit": "piano", "subreddit_id": "t5_2qnw8"}, {"author": "honjapiano", "body": "If you want to learn the characters, definitely try mystery heroes. It keeps you in a rotation of heroes and you have to adjust quickly to the changes. Otherwise, try out quick play classic or no limits. \n\nWhen I first started, I basically only played against AI when learning a new hero because I didn’t want to lose (esp if others were relying on me) but that’s part of the game and part of learning the heroes. \n\nFeeling outmatched definitely sucks, but sometimes it’s good. You’ll get better by playing against slightly better players. I’d never played FPS before Overwatch and got my ass beat for a while. Sure made me learn quickly though. \n\nIf you’re interested in a specific hero, KarQ has a series on youtube with tips for every hero. If you’re interested in support, check out KarQ or ML7. Tank? Emongg or Flats. Not sure about DPS (Stylosa?Wanted?), but there’s a lot of educational content if you’re looking for specific heroes or roles.", "created_utc": "1665806910.0", "edited": "False", "id": "isdnnac", "is_submitter": "False", "link_id": "t3_y4absr", "parent_id": "t3_y4absr", "score": "0", "subreddit": "OverwatchUniversity", "subreddit_id": "t5_3ejpe"}, {"author": "honjapiano", "body": "I’d say that you should learn all the heroes at a basic level. Understand their cooldowns, ults, etc, so you at least know what to expect when you see one on your team or the opposite. \n\nOtherwise, start off learning a few heroes from a certain role, then move on to the next. If you want to flex between roles, try out new heroes in low-stress environments like quick play classic or no-limits. In the end, learn whoever you have fun with! Sure, there’s a meta and certain heroes are counters to others, but that only /really/ matters in comp or when you want to try-hard the game. \n\nYour game sense will get better as you get your ass kicked and kick ass, so your feelings about each role might change. Not sure if this is helpful at all, but there are my two cents.", "created_utc": "1665806435.0", "edited": "False", "id": "isdmupn", "is_submitter": "False", "link_id": "t3_y4cw0s", "parent_id": "t3_y4cw0s", "score": "2", "subreddit": "OverwatchUniversity", "subreddit_id": "t5_3ejpe"}, {"author": "honjapiano", "body": "30. trying to get to the park ranger skin, but that’s a while away", "created_utc": "1665503706.0", "edited": "False", "id": "irwivqv", "is_submitter": "False", "link_id": "t3_y1a6xy", "parent_id": "t3_y1a6xy", "score": "1", "subreddit": "Overwatch", "subreddit_id": "t5_2u5kl"}, {"author": "honjapiano", "body": "i got three in one game but it took me forever to go from 19 to 20. definitely a little funky. both too easy and also total luck", "created_utc": "1665345069.0", "edited": "False", "id": "iroaqt9", "is_submitter": "False", "link_id": "t3_xzqj3a", "parent_id": "t3_xzqj3a", "score": "2", "subreddit": "Overwatch", "subreddit_id": "t5_2u5kl"}, {"author": "honjapiano", "body": "it looks like Moodle/eClass. It’s a program that unis and some high schools use for testing and homework", "created_utc": "1664805243.0", "edited": "False", "id": "iqvt7n3", "is_submitter": "False", "link_id": "t3_xtxsi5", "parent_id": "t1_iqui5xa", "score": "7", "subreddit": "French", "subreddit_id": "t5_2rd5t"}, {"author": "honjapiano", "body": "i’d love a portuguese character", "created_utc": "1664627661.0", "edited": "False", "id": "iqm8hcg", "is_submitter": "False", "link_id": "t3_xsbrp6", "parent_id": "t3_xsbrp6", "score": "1", "subreddit": "VALORANT", "subreddit_id": "t5_2dkvmc"}, {"author": "honjapiano", "body": "i like to play chamber in spike rush so i can learn the character. i’d hate to ruin 45 minutes of someone’s game bc i can’t figure out working his tps in-game. i mostly use spike rush as a warm up and to learn how to use agent util in-game. \n\nbut i do understand the concern with his ult. it’s annoying as hell. luckily i have a 0% hit rate on it so i’m no detriment to anyone 🤩", "created_utc": "1664292189.0", "edited": "False", "id": "iq43y09", "is_submitter": "False", "link_id": "t3_xp8w2x", "parent_id": "t3_xp8w2x", "score": "0", "subreddit": "VALORANT", "subreddit_id": "t5_2dkvmc"}, {"author": "honjapiano", "body": "I’d love to have a Portuguese character especially since Lisbon’s being introduced as a map", "created_utc": "1663853161.0", "edited": "False", "id": "ipgrp5j", "is_submitter": "False", "link_id": "t3_xkdz8t", "parent_id": "t3_xkdz8t", "score": "1", "subreddit": "Overwatch", "subreddit_id": "t5_2u5kl"}, {"author": "honjapiano", "body": "The muscle memory pieces at the beginning can help you find patterns in more complicated music, so if you see a common run, it'll be easier to sight-read. The early stuff tends to be a bit more memory, but there are important foundations that you learn from them, even if you don't actually notice them being used until much later in your piano journey.\n\nAs for \"I want to learn this piece\", that's more sight-reading, which tends to be stuff that's far below your technical level, but again, these foundational pieces make them so much easier to tackle at higher levels.\n\nFor pieces that make you hard stop, you have to think about *why* it's making you stop. Is it your technical level? Your approach? etc. [There's](https://www.youtube.com/watch?v=HPg_auEBL1Y)[ a piece I'm working on now](https://www.youtube.com/watch?v=HPg_auEBL1Y) that made me hard stop because I just didn't have a good enough sense of theory and patterns for it to make sense when I read it. And again, it came right back down to recognizing patterns and breaking things down to the basics that I skimped out on as a kid.\n\nIt can feel very unrewarding at first, but it's worth your while to spend serious time on it. Of course, if you have a teacher, you should bring this up to them. They may be able to find better ways to teach the same concepts to you.", "created_utc": "1663643775.0", "edited": "False", "id": "ip5g389", "is_submitter": "False", "link_id": "t3_xit93m", "parent_id": "t3_xit93m", "score": "1", "subreddit": "piano", "subreddit_id": "t5_2qnw8"}, {"author": "honjapiano", "body": "i was basically the same situation! i started with mercy bc ow was my first fps and was a support main for months before touching dps. i am by no means a great player. i’m bronze dps (1200-1400SR), but i’m good enough not to get flamed in quickplay all the time so i’ll give my two cents. \n\nif you want to try dps with little stress on the game, play quickplay classic! there’s very little pressure out on those games and it’s a great way to experience playing against people in a new role! i started off with AI games until i realized i’d memorized their pathing patterns. \n\nalso queuing up for quickplay support as well as dps usually gives you a backfill dps role (if dps at all), which warmed me up to playing actual quickplay. \n\nI also started with the cowboy and I had a blast. I hate projectile so i stuck with Cass/Cree until I learned Ashe and Tracer. go experiment with the heroes and find some that you think are fun to play.  \n\ndon’t get discouraged if you die a million times! it’ll happen to matter what, and OW is very much a “die by fire” type game. you’ll learn where you can push and when you need to back off. ultimately, just enjoy the role! i have a lot of fun in dps because i put less pressure on myself to perform well, whereas support has a lot of responsibility tacked into it.", "created_utc": "1662691730.0", "edited": "False", "id": "inof0fv", "is_submitter": "False", "link_id": "t3_x8sxrn", "parent_id": "t3_x8sxrn", "score": "2", "subreddit": "OverwatchUniversity", "subreddit_id": "t5_3ejpe"}, {"author": "honjapiano", "body": "i also came from overwatch, and what i found helped was warming up with one round at the practice range and a deathmatch. sometimes it’s really frustrating when you keep dying but at least you get to respawn and try again. \n\ni’m silver in val (not that silver’s crazy high or anything) but the depths of bronze in ow solely because my aim can’t help me climb further than 1200. \n\naiming in val feels like a different beast — i avoid marshal and op because i don’t hit anything while scoped, despite being an ana/ashe main in ow.", "created_utc": "1662652764.0", "edited": "False", "id": "inlqn7j", "is_submitter": "False", "link_id": "t3_x90l89", "parent_id": "t1_inl7t12", "score": "2", "subreddit": "VALORANT", "subreddit_id": "t5_2dkvmc"}, {"author": "honjapiano", "body": "i enjoy controller because it feels like a support role. i like enabling my team to get onto/out of sites and set up. i like blocking the enemy team’s LOSs (esp against chamber or jetts with ops). \n\ni can’t figure out omen for my life tho. i have no idea how placing his smokes work.", "created_utc": "1662415767.0", "edited": "False", "id": "in8lvdo", "is_submitter": "False", "link_id": "t3_x6g9db", "parent_id": "t3_x6g9db", "score": "1", "subreddit": "VALORANT", "subreddit_id": "t5_2dkvmc"}, {"author": "honjapiano", "body": "i use default settings for everything other than sensitivity. same keybinds, crosshairs, volume levels, etc. as long as it works for you, then who cares?", "created_utc": "1662171282.0", "edited": "False", "id": "imvm5mp", "is_submitter": "False", "link_id": "t3_x3zye1", "parent_id": "t3_x3zye1", "score": "1", "subreddit": "VALORANT", "subreddit_id": "t5_2dkvmc"}, {"author": "honjapiano", "body": "lots of fanart is written in japanese and korean and i like being able to understand the gist without having to go to google translate. that’s why i learned how to read their alphabets.", "created_utc": "1661770482.0", "edited": "False", "id": "im8ot2x", "is_submitter": "False", "link_id": "t3_x05jin", "parent_id": "t3_x05jin", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "honjapiano", "body": "r/AskDocs might be a good reddit to ask. they tend to be pretty helpful over there", "created_utc": "1661770142.0", "edited": "False", "id": "im8obvz", "is_submitter": "False", "link_id": "t3_x0k2oz", "parent_id": "t3_x0k2oz", "score": "10", "subreddit": "TooAfraidToAsk", "subreddit_id": "t5_2ssp7"}, {"author": "honjapiano", "body": "i feel your pain. my parents didn’t teach me my heritage language simply because they thought it wouldn’t be useful, but then put me in french school bc “knowing another language is useful”. as if being in a hugely multicultural, knowing my heritage language, in which we make up a large population, wouldn’t be useful??\n\nit still pisses me off because i get clowned by my family — they find it amusing. my parents didn’t put in any effort, but neither did my grandparents. i had to learn it myself, and put myself in classes at school (which my parents said would be a waste of a course), and make myself sit in on other people speaking to bring my comprehension up. now, i understand it completely and can write, but i can’t speak it whatsoever. \n\nsure there are resources for me to use, but finding good european portuguese resources that also work for me is impossible. not to mention that there are no azorean lessons, so i get clowned for my accent immediately.", "created_utc": "1661691997.0", "edited": "False", "id": "im4gcnl", "is_submitter": "False", "link_id": "t3_wzhlwg", "parent_id": "t3_wzhlwg", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "honjapiano", "body": "neptune! i think that’s a vandal skin? the one with the fish in it? it’s my favourite and i check the market every day for it bc i missed the event by like… four days", "created_utc": "1661533905.0", "edited": "False", "id": "ilw6a0t", "is_submitter": "False", "link_id": "t3_wy88hi", "parent_id": "t3_wy88hi", "score": "1", "subreddit": "VALORANT", "subreddit_id": "t5_2dkvmc"}, {"author": "honjapiano", "body": "i wish they sold them individually because elysium is beautiful", "created_utc": "1661533676.0", "edited": "False", "id": "ilw5otu", "is_submitter": "False", "link_id": "t3_wxu6yh", "parent_id": "t3_wxu6yh", "score": "1", "subreddit": "HadesTheGame", "subreddit_id": "t5_sfted"}, {"author": "honjapiano", "body": "i’d love the seasonal events if they changed it up a bit. like, maybe adding a new mission to archives, or a new gamemode to the halloween event and switched it up every year or so. \n\ni love the archive event so much, i’d be really bummed if they got rid of it. i still haven’t beat all the extreme modes", "created_utc": "1661533597.0", "edited": "False", "id": "ilw5hj2", "is_submitter": "False", "link_id": "t3_wya3xo", "parent_id": "t3_wya3xo", "score": "3", "subreddit": "Overwatch", "subreddit_id": "t5_2u5kl"}, {"author": "honjapiano", "body": "dang this is a great comment, thank you! with regard to object permanence (sorta…), i’m never sure when to chase someone down vs poke and leave them alone. sometimes i’ll go for someone who’s flanking and then they run away, and unless they’re a 1 tap away from death, i don’t know whether to let them be or not. \n\ni usually warn my team about anyone i let go, but i also don’t want to be playing tag all over the map\n\nand, definitely. learning to not waste my mobility was huge!", "created_utc": "1661454527.0", "edited": "False", "id": "ilrset6", "is_submitter": "True", "link_id": "t3_wxfdf6", "parent_id": "t1_ilr0qsw", "score": "4", "subreddit": "OverwatchUniversity", "subreddit_id": "t5_3ejpe"}, {"author": "honjapiano", "body": "as dps, i get a lot of value from high ground and always try to use it if the hero’s effective that way. especially tossing an unexpected dynamite into a group or to their back line! i probably should have a bit more patient. thinking back, i feel like i might spam shoot sometimes and that probably gives away my position if i miss my shot lol. thanks for your advice! \n\ni definitely struggle with it more for support because everyone runs from my LOS...", "created_utc": "1661454279.0", "edited": "False", "id": "ilrrsfw", "is_submitter": "True", "link_id": "t3_wxfdf6", "parent_id": "t1_ilqy369", "score": "1", "subreddit": "OverwatchUniversity", "subreddit_id": "t5_3ejpe"}, {"author": "honjapiano", "body": "my choice in dps is pretty limited to ashe, cowboy, widow, pharah and soldier, at the moment. a bit of a ragtag group there lol. \n\nyou’re right about lucio. he’s a game changer on the right maps, i should probably practice him a little bit. thanks!", "created_utc": "1661453650.0", "edited": "False", "id": "ilrq5xh", "is_submitter": "True", "link_id": "t3_wxfdf6", "parent_id": "t1_ilqxikf", "score": "1", "subreddit": "OverwatchUniversity", "subreddit_id": "t5_3ejpe"}, {"author": "honjapiano", "body": "that was one thing that i always did, even at the start. ow was my first fps and i was kinda scared to get into the fights as dps so i would try to get out of the battle grounds and poke from above. esp with my love for scoped weapons, i definitely see the value in it", "created_utc": "1661452745.0", "edited": "False", "id": "ilrnt29", "is_submitter": "True", "link_id": "t3_wxfdf6", "parent_id": "t1_ilqvzc8", "score": "2", "subreddit": "OverwatchUniversity", "subreddit_id": "t5_3ejpe"}, {"author": "honjapiano", "body": "I never name any of my chapters. Just numbers. Not that I have any WIPs that have gotten as far as more than the first paragraph 💀 Not much to name at that point.", "created_utc": "1661359885.0", "edited": "False", "id": "ilm5zal", "is_submitter": "False", "link_id": "t3_ww8qs3", "parent_id": "t3_ww8qs3", "score": "1", "subreddit": "FanFiction", "subreddit_id": "t5_2r5kb"}, {"author": "honjapiano", "body": "i don’t wish i didn’t know english, but i sure as hell wish that my parents taught me their language. i was going to learn english regardless, so it would have been cool to have some sort of connection to my heritage. \n\nand i think knowing english makes it harder to practice naturally with others. i went to the middle-of-nowhere, tried to speak the language, and was immediately told off and asked to speak english instead. \n\neither way, to say having english as a native language is /not/ an advantage would be stupid, but there are downsides to it being your only native language when it comes to learning others", "created_utc": "1661313711.0", "edited": "False", "id": "iljvpre", "is_submitter": "False", "link_id": "t3_wvounl", "parent_id": "t3_wvounl", "score": "4", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "honjapiano", "body": "krita’s been the best alternative i’ve found. used it for years before moving to csp", "created_utc": "1661261781.0", "edited": "False", "id": "ilgd1sa", "is_submitter": "False", "link_id": "t3_wv74k1", "parent_id": "t3_wv74k1", "score": "6", "subreddit": "ClipStudio", "subreddit_id": "t5_3a4b5"}, {"author": "honjapiano", "body": "“Love You Forever” by Robert Munsch!", "created_utc": "1660873705.0", "edited": "False", "id": "ikvmu13", "is_submitter": "False", "link_id": "t3_wrx583", "parent_id": "t3_wrx583", "score": "1", "subreddit": "suggestmeabook", "subreddit_id": "t5_31t41"}, {"author": "honjapiano", "body": "i love the idea that reaper has an album called dangerous woman 💀", "created_utc": "1660873563.0", "edited": "False", "id": "ikvmiqo", "is_submitter": "False", "link_id": "t3_wrrgks", "parent_id": "t3_wrrgks", "score": "1", "subreddit": "Overwatch", "subreddit_id": "t5_2u5kl"}, {"author": "honjapiano", "body": "as someone who’s in bronze and has stopped quite a few of these: i just make sure to keep watching the ticker at the top and ping “i need help” while making my way back — i try not to stray too far from point but that’s easier as ana than mercy. i try to use the “group up” line to keep people near point. if most of your team is near the payload, it’s hard to get away with a cap without someone noticing, pinging, or saying it in chat while dead. \n\ni feel your bronze support pain, man. i usually try to see how attentive/communicative my team is near the beginning of the game — i don’t use voice, so i see whether they come to me when they need healing or when i need help. sometimes it’s more effective for me to hide and type it quickly. probably not effective in the long run, but you gotta do what you gotta do. \n\ni know bronze-to-bronze advice probably won’t help with any tech or combat, but at least i somewhat understand the struggle.", "created_utc": "1659747053.0", "edited": "False", "id": "ij4n34z", "is_submitter": "False", "link_id": "t3_wh08ca", "parent_id": "t3_wh08ca", "score": "2", "subreddit": "OverwatchUniversity", "subreddit_id": "t5_3ejpe"}, {"author": "honjapiano", "body": "i just want some more hanzo angst", "created_utc": "1659325026.0", "edited": "False", "id": "iigs71y", "is_submitter": "False", "link_id": "t3_wd1i0a", "parent_id": "t3_wd1i0a", "score": "23", "subreddit": "Overwatch", "subreddit_id": "t5_2u5kl"}, {"author": "honjapiano", "body": "wait really?? i’ll keep an eye out for it then", "created_utc": "1659313552.0", "edited": "False", "id": "iig5qyk", "is_submitter": "False", "link_id": "t3_wcom24", "parent_id": "t1_iig4aam", "score": "3", "subreddit": "VALORANT", "subreddit_id": "t5_2dkvmc"}, {"author": "honjapiano", "body": "this is also a really good point! i think it’s fair to say that a lot of the playerbase isn’t on reddit so these posts don’t reach everyone, but it does reach at least 2.5k people (based on upvotes alone), which is a huge amount of people. \n\nalso it being a spectrum is very true — i hadn’t thought of it that way even tho it seems very obvious. thanks for your input!", "created_utc": "1659298690.0", "edited": "False", "id": "iif91wr", "is_submitter": "False", "link_id": "t3_wclxy7", "parent_id": "t1_iif6zjz", "score": "2", "subreddit": "VALORANT", "subreddit_id": "t5_2dkvmc"}, {"author": "honjapiano", "body": "i really want the neptune (aquarium) set! i missed the event by FOUR DAYS", "created_utc": "1659293780.0", "edited": "False", "id": "iiexnc1", "is_submitter": "False", "link_id": "t3_wcom24", "parent_id": "t3_wcom24", "score": "3", "subreddit": "VALORANT", "subreddit_id": "t5_2dkvmc"}, {"author": "honjapiano", "body": "i agree with you, and personally don’t think talking to the toxic players would make much of a difference — obv is doesn’t. i’m more concerned with a way of making riot care about it a bit more. i’ve been told that they’re making advances on banning people, but idk how much of a difference it makes tbh.", "created_utc": "1659292416.0", "edited": "False", "id": "iieucvk", "is_submitter": "False", "link_id": "t3_wclxy7", "parent_id": "t1_iieojhl", "score": "1", "subreddit": "VALORANT", "subreddit_id": "t5_2dkvmc"}, {"author": "honjapiano", "body": "that’s a fair take — with all the people on reddit, sometimes i forget that not everyone’s on reddit. i wonder how it would be addressed to the wider community, then. i’m a part of the young-ish crowd, i think? maybe i’m in the middle ground. but i’m old enough that i have no idea where you would find the young ones nor how to actually /reach/ them. i have a feeling they aren’t gonna give two shits about a tiktok\n\nto be honest, i wish there was a way for riot to do something about it themselves. i’m not tech-savvy so i can’t even think up suggestions. but they must be aware of the problem, right?", "created_utc": "1659270687.0", "edited": "False", "id": "iidi1xw", "is_submitter": "False", "link_id": "t3_wclxy7", "parent_id": "t1_iidhhzl", "score": "8", "subreddit": "VALORANT", "subreddit_id": "t5_2dkvmc"}, {"author": "honjapiano", "body": "oh hey that’s cool! i think it’s still considered a “second language” since you learned it second? my parents learned english second but use it way more than their “first” language, so they call it their “main” language.", "created_utc": "1659270419.0", "edited": "False", "id": "iidhm3w", "is_submitter": "False", "link_id": "t3_wclxy7", "parent_id": "t1_iidhbmq", "score": "1", "subreddit": "VALORANT", "subreddit_id": "t5_2dkvmc"}, {"author": "honjapiano", "body": "these comments are ridiculous ffs. why is it that any time anyone wants to raise awareness of an issue in the game/player base, the reddit can’t handle it? “NO. you can’t make criticisms of this game that i like. i know a lot of people are purposefully and unrelentingly racist/sexist/homophobic but how dare you create conversation about this thing that bothers you and so many other people in the game!”\n\ni’ve seen posts like this a lot. have people ever thought that maybe, if it’s being brought up so often, that it might be a PROBLEM? i’m constantly in fear of being harassed by people, so i don’t play with chat or mic on - and i lose out on the game because of it, and i know other people are too. and let’s not forget that players harass each other without knowing who’s being the username, like what happened with OP\n\n“complaining on a reddit post isn’t gonna do anything”. you’re right, but you commenting that also does nothing to solve the problem, so if anything, you’re even more useless by getting involved in a conversation that you add absolutely no value to.\n\nOP, your english is fine, dude. i didn’t know it was your second language ‘till i read it in a comment.", "created_utc": "1659269936.0", "edited": "False", "id": "iidgu0p", "is_submitter": "False", "link_id": "t3_wclxy7", "parent_id": "t3_wclxy7", "score": "46", "subreddit": "VALORANT", "subreddit_id": "t5_2dkvmc"}, {"author": "honjapiano", "body": "console’s hard as hell. anyone who plays it deserves an award. i started on the Switch (cursed, ik) before convincing my brother to let me use his PC. i definitely couldn’t use any projectile heroes. thank god for gyro", "created_utc": "1659235278.0", "edited": "False", "id": "iic2xmj", "is_submitter": "False", "link_id": "t3_wca09j", "parent_id": "t1_iibzham", "score": "2", "subreddit": "OverwatchUniversity", "subreddit_id": "t5_3ejpe"}, {"author": "honjapiano", "body": "the most important thing is finding two or three heroes from each role that you /enjoy/ playing. i found pretty quickly that i’m dogshit at projectiles, so I avoid heroes like Junk. \n\nonce you know the game a little better, then venture out into getting better at them. but in the beginning, just enjoy learning all of them and find some that you have fun playing with", "created_utc": "1659232220.0", "edited": "False", "id": "iibwsv1", "is_submitter": "False", "link_id": "t3_wca09j", "parent_id": "t3_wca09j", "score": "3", "subreddit": "OverwatchUniversity", "subreddit_id": "t5_3ejpe"}, {"author": "honjapiano", "body": "wot, it’s playing for me… maybe your browser’s a little funky ?", "created_utc": "1658976778.0", "edited": "False", "id": "ihxxfqa", "is_submitter": "False", "link_id": "t3_w9xely", "parent_id": "t1_ihxv2vz", "score": "1", "subreddit": "Overwatch", "subreddit_id": "t5_2u5kl"}, {"author": "honjapiano", "body": "i definitely have problems nanoing. they’re always too early or too late. you’re right, i should probably think of  more proactively instead of reactive to my other teammates. \n\nas for positioning, i’m never too sure how far back i should play from my team. should i prioritize high ground or is staying anywhere near my team good?\n\ni’ll get some comp games in this week, hopefully", "created_utc": "1658801454.0", "edited": "False", "id": "ihnuxuv", "is_submitter": "False", "link_id": "t3_w84r6i", "parent_id": "t1_ihnpklb", "score": "1", "subreddit": "OverwatchUniversity", "subreddit_id": "t5_3ejpe"}, {"author": "honjapiano", "body": "i also don’t play tank 🥴 everything about my play style is mid", "created_utc": "1658702384.0", "edited": "False", "id": "ihi7m8c", "is_submitter": "False", "link_id": "t3_w7684j", "parent_id": "t1_ihi5fqc", "score": "0", "subreddit": "Overwatch", "subreddit_id": "t5_2u5kl"}, {"author": "honjapiano", "body": "\\*\\*i'm team 2 DVA (sheikah) and had no idea what was going on the entire time", "created_utc": "1658697518.0", "edited": "False", "id": "ihhwaod", "is_submitter": "False", "link_id": "t3_w7684j", "parent_id": "t3_w7684j", "score": "1", "subreddit": "Overwatch", "subreddit_id": "t5_2u5kl"}, {"author": "honjapiano", "body": "lucio’s is vamos esculachar, which i think i’d along the lines of “let’s rock” — ngl i always heard it as vamos escutar, meaning “let’s listen” and i thought that was a little weird", "created_utc": "1658579956.0", "edited": "False", "id": "ihbe007", "is_submitter": "False", "link_id": "t3_w5r8oa", "parent_id": "t1_iha2ypj", "score": "4", "subreddit": "Overwatch", "subreddit_id": "t5_2u5kl"}, {"author": "honjapiano", "body": "yes, great choice!", "created_utc": "1658521505.0", "edited": "False", "id": "ih8ht2p", "is_submitter": "False", "link_id": "t3_w59k6v", "parent_id": "t1_ih8gfz2", "score": "2", "subreddit": "French", "subreddit_id": "t5_2rd5t"}, {"author": "honjapiano", "body": "I insta-click but don’t lock in for this reason. i have maybe two agents that i can play effectively since i’m very new, so i click jett almost instantly, but if i see everyone’s going duelists, i’ll switch to brim or sage. \n\ni don’t know team comps to make decisions based on that, but instalock sucks and puts a lot of people in bad moods right off the bat", "created_utc": "1658514445.0", "edited": "False", "id": "ih7zweg", "is_submitter": "False", "link_id": "t3_w5dd5r", "parent_id": "t3_w5dd5r", "score": "54", "subreddit": "VALORANT", "subreddit_id": "t5_2dkvmc"}, {"author": "honjapiano", "body": "Anything by Angèle!! Her music’s great! I really like Plus de sense, Bruxelles je t’aime, La thune, and Balance ton quoi", "created_utc": "1658508570.0", "edited": "False", "id": "ih7kmhz", "is_submitter": "False", "link_id": "t3_w59k6v", "parent_id": "t3_w59k6v", "score": "24", "subreddit": "French", "subreddit_id": "t5_2rd5t"}, {"author": "honjapiano", "body": "I got an Ace and top fragged an entire game, and the next I had a 17 deaths and 4 kills… so yeah, we definitely have bad games—and of course those are the ones that you get the toxic teammates/opponents on.", "created_utc": "1658508447.0", "edited": "False", "id": "ih7katn", "is_submitter": "False", "link_id": "t3_w52sxi", "parent_id": "t3_w52sxi", "score": "1", "subreddit": "VALORANT", "subreddit_id": "t5_2dkvmc"}, {"author": "honjapiano", "body": "i've done both and it doesn't show up in the application support folder either way...", "created_utc": "1658280957.0", "edited": "False", "id": "iguzek4", "is_submitter": "False", "link_id": "t3_w3823t", "parent_id": "t1_igux0dy", "score": "1", "subreddit": "macgaming", "subreddit_id": "t5_2rk3e"}, {"author": "honjapiano", "body": "pls let me be in the range while queuing! or have queue deathmatch or smth. i hate just sitting waiting for a game :/", "created_utc": "1658278765.0", "edited": "False", "id": "iguuhsi", "is_submitter": "False", "link_id": "t3_w2t4cx", "parent_id": "t3_w2t4cx", "score": "5", "subreddit": "VALORANT", "subreddit_id": "t5_2dkvmc"}, {"author": "honjapiano", "body": "where would i connect the other side of the usb to? also to the monitor?", "created_utc": "1658267828.0", "edited": "False", "id": "igu4wa0", "is_submitter": "False", "link_id": "t3_w1ldnh", "parent_id": "t1_iglcbl6", "score": "1", "subreddit": "macbookpro", "subreddit_id": "t5_2xhss"}, {"author": "honjapiano", "body": "maybe. i definitely hear canadians say mum all over the country though. a good mix of both at the very least. \n\nmaybe that’s why i doesn’t bug me. i’m used to hearing both so it doesn’t seem out of place heh", "created_utc": "1658083626.0", "edited": "False", "id": "igjqstt", "is_submitter": "False", "link_id": "t3_w0tx2k", "parent_id": "t1_igjkh5y", "score": "1", "subreddit": "FanFiction", "subreddit_id": "t5_2r5kb"}, {"author": "honjapiano", "body": "i was 12 when my doc said i wouldn’t grow again… and he was right. i’m stuck at 5’, which doesn’t seem too bad for a girl, but i can’t reach the chip bags on the fridge. that aside, there are short girls who need short guys! i personally would be mortified to be an entire foot shorter than my s/o. \n\nin the end, your height really won’t matter, but trust that even if it did, it’s nothing to worry about.", "created_utc": "1658034475.0", "edited": "False", "id": "ighgb2k", "is_submitter": "False", "link_id": "t3_w0lmqm", "parent_id": "t1_igf2ju5", "score": "1", "subreddit": "AskDocs", "subreddit_id": "t5_2xtuc"}, {"author": "honjapiano", "body": "i prefer past tense but i don’t care as long as it’s consistent. nothing ticks me off like inconsistent tenses! (especially in essays omg)", "created_utc": "1658033107.0", "edited": "False", "id": "ighe6dm", "is_submitter": "False", "link_id": "t3_w0pxk8", "parent_id": "t3_w0pxk8", "score": "1", "subreddit": "FanFiction", "subreddit_id": "t5_2r5kb"}, {"author": "honjapiano", "body": "to be fair, a lot of north americans say mum. so i always write mum unless it doesn’t make sense with a specific dialect. brits saying “mom” seems a little wonky though. that’d definitely take me out of the story a bit", "created_utc": "1658032963.0", "edited": "False", "id": "ighdydp", "is_submitter": "False", "link_id": "t3_w0tx2k", "parent_id": "t1_iggq27c", "score": "12", "subreddit": "FanFiction", "subreddit_id": "t5_2r5kb"}, {"author": "honjapiano", "body": "i’ve always gone to male doctors and i’ve always been cool with it. they’ve treated me well and i wasn’t raised to fear/reject male doctors like many of my friends were. although i can understand why some women feel uncomfortable/unsafe. \n\nas long as they take my questions and concerns seriously, it doesn’t really matter.", "created_utc": "1657989765.0", "edited": "1657989943.0", "id": "igev0k3", "is_submitter": "False", "link_id": "t3_w0kdym", "parent_id": "t3_w0kdym", "score": "7", "subreddit": "TooAfraidToAsk", "subreddit_id": "t5_2ssp7"}, {"author": "honjapiano", "body": "i really like pearl! i love all the twists, turns and flank routes, and it’s not HUGE. \n\ni’m a new player (been playing for a month or two), but i love it.", "created_utc": "1657743409.0", "edited": "False", "id": "ig1cbm7", "is_submitter": "False", "link_id": "t3_vy82oy", "parent_id": "t3_vy82oy", "score": "1", "subreddit": "VALORANT", "subreddit_id": "t5_2dkvmc"}, {"author": "honjapiano", "body": "all of 76’s lines. all of them. “get the fuck off my lawn”, “i’m not your fucking dad”, “if our goal was to lose, we’re doing fucking fantastic”", "created_utc": "1657507537.0", "edited": "False", "id": "ifobsjk", "is_submitter": "False", "link_id": "t3_vw6mb9", "parent_id": "t3_vw6mb9", "score": "6", "subreddit": "Overwatch", "subreddit_id": "t5_2u5kl"}, {"author": "honjapiano", "body": "that’s definitely part of it, i don’t play a whole lot of tank unless it’s for the lootbox or if i’m duoing, but i’m just surprised that i place gold consistently. i think i’m pretty awful at tank in general — i have no game sense for it — but it’s always my highest placement and always around 2100", "created_utc": "1657506816.0", "edited": "False", "id": "ifoabyn", "is_submitter": "False", "link_id": "t3_vvi3o8", "parent_id": "t1_ifkdw1m", "score": "2", "subreddit": "OverwatchUniversity", "subreddit_id": "t5_3ejpe"}, {"author": "honjapiano", "body": "i usually play a few comp matches every time a play — probably once or twice a week. i play dps/support comp the most, but if i’m ever playing with friends, i’ll play a few tank games. \n\ni’m just confused because my sup/dps are consistently going down, but my tank placements are always 2100.", "created_utc": "1657506325.0", "edited": "False", "id": "ifo9co5", "is_submitter": "False", "link_id": "t3_vvi3o8", "parent_id": "t1_ifnj0d5", "score": "1", "subreddit": "OverwatchUniversity", "subreddit_id": "t5_3ejpe"}, {"author": "honjapiano", "body": "i won 4/5 matches and got placed at 1500 💀 perma-bronze here i come", "created_utc": "1657422192.0", "edited": "False", "id": "ifjwgdl", "is_submitter": "False", "link_id": "t3_vv5h35", "parent_id": "t3_vv5h35", "score": "1", "subreddit": "OverwatchUniversity", "subreddit_id": "t5_3ejpe"}, {"author": "honjapiano", "body": "it was worth all $90 that i had to spend in Canada", "created_utc": "1657386514.0", "edited": "False", "id": "ifhsv79", "is_submitter": "False", "link_id": "t3_vuyr2k", "parent_id": "t3_vuyr2k", "score": "1", "subreddit": "Breath_of_the_Wild", "subreddit_id": "t5_3f1s6"}, {"author": "honjapiano", "body": "not really. it’s more that i think it would be embarrassing to introduce someone to my family or friends. it’s not really the relationship but the amount of judgement. \n\ni know my family be supportive, they’ve always been very open about my siblings and i being loved and supported, but they’d still judge the person, it’s only natural when you meet someone.", "created_utc": "1657362961.0", "edited": "False", "id": "ifgjm4w", "is_submitter": "False", "link_id": "t3_vuu34m", "parent_id": "t1_ifgamvn", "score": "1", "subreddit": "TooAfraidToAsk", "subreddit_id": "t5_2ssp7"}, {"author": "honjapiano", "body": "i’m slowly making my way through them, and it’s an interesting experience, that’s for sure. i get no value out of the first few games of an agent lol it’s fun tho", "created_utc": "1657362777.0", "edited": "False", "id": "ifgjdwa", "is_submitter": "False", "link_id": "t3_vugprj", "parent_id": "t1_ifgcwxb", "score": "1", "subreddit": "VALORANT", "subreddit_id": "t5_2dkvmc"}, {"author": "honjapiano", "body": "I have a dog 💀", "created_utc": "1657362694.0", "edited": "False", "id": "ifgja89", "is_submitter": "False", "link_id": "t3_vuu34m", "parent_id": "t1_iffxte8", "score": "1", "subreddit": "TooAfraidToAsk", "subreddit_id": "t5_2ssp7"}, {"author": "honjapiano", "body": "i’m learning the game right now, and i only know how to play jett without throwing. fuck everyone else, i’ll instalock. \n\nif there’s a character i want to play, and only one person can play them on my team, then you bet i’m gonna do all i can to lock that character. who cares what others say? they’re just mad that they couldn’t instalock them first.", "created_utc": "1657343016.0", "edited": "False", "id": "ifftxqh", "is_submitter": "False", "link_id": "t3_vugprj", "parent_id": "t3_vugprj", "score": "2", "subreddit": "VALORANT", "subreddit_id": "t5_2dkvmc"}, {"author": "honjapiano", "body": "as someone who had never been of interest to others, people tend to be frank with me in a way that they aren’t with people they’re attracted to. i get more blunt and honest comments/gossip/etc rather than cushy/curated stuff. i guess it’s cuz people get nervous and more conscious of themselves when they interact with people they like", "created_utc": "1657341344.0", "edited": "False", "id": "iffr8ah", "is_submitter": "False", "link_id": "t3_vu7gc2", "parent_id": "t3_vu7gc2", "score": "2", "subreddit": "TooAfraidToAsk", "subreddit_id": "t5_2ssp7"}, {"author": "honjapiano", "body": "i understand french as french immediately and somehow don’t actively translate anything. if someone speaks to me in english, my brain short circuits before i fully understand. it’s almost like an on and off switch for me.", "created_utc": "1657340821.0", "edited": "False", "id": "iffqd1u", "is_submitter": "False", "link_id": "t3_vuhsat", "parent_id": "t3_vuhsat", "score": "1", "subreddit": "TooAfraidToAsk", "subreddit_id": "t5_2ssp7"}, {"author": "honjapiano", "body": "If your aim is listening comprehension, and you already understand the bulk of it with french subs, then you should try to watch without subs as an experiment. \n\nsee if watching without the subs helps over time. you’re not going to understand everything at the beginning (i think my comprehension went down a bit at the start), but i found that watching without subs and using the context clues of the show helped a lot. i don’t know all the words, but i understand based on the visual cues and other words that i already know. \n\nit may not work for you, but i’d give it a shot for a few weeks. try watching a show that you already watched with french subs. then you can rule out whether it’s the subs that are holding you back, or if it’s linked to your disorder.", "created_utc": "1657203194.0", "edited": "False", "id": "if7jl71", "is_submitter": "False", "link_id": "t3_vtgodm", "parent_id": "t3_vtgodm", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "honjapiano", "body": "i have a feeling dudes are just as nervous to ask people out. and tbh i think a lot of guys get too few genuine compliments on their looks/personality/etc., so i don’t think it would hurt\n\ngo for it!", "created_utc": "1657201609.0", "edited": "False", "id": "if7g05e", "is_submitter": "False", "link_id": "t3_vtd9t7", "parent_id": "t3_vtd9t7", "score": "1", "subreddit": "TooAfraidToAsk", "subreddit_id": "t5_2ssp7"}, {"author": "honjapiano", "body": "i wouldn’t want anyone talking about my appearance to me. ever. but i think that’s a minority of women. \n\nas long as you don’t word it in a creepy way, i think she’d probably find it flattering. like “you’re hot” vs “i think you’re attractive” have two different connotations imo", "created_utc": "1657201388.0", "edited": "False", "id": "if7filc", "is_submitter": "False", "link_id": "t3_vt8kkj", "parent_id": "t3_vt8kkj", "score": "1", "subreddit": "TooAfraidToAsk", "subreddit_id": "t5_2ssp7"}, {"author": "honjapiano", "body": "graduating college at all is fantastic! it’s hard as hell, and is even harder as you get older if you have to balance it with work. \n\nin the long run, graduating a few years late means /nothing/. i’m going through uni right now and i think anyone who puts up with that bs all the way through is a champ", "created_utc": "1657120628.0", "edited": "False", "id": "if30w1c", "is_submitter": "False", "link_id": "t3_vsptzz", "parent_id": "t3_vsptzz", "score": "1", "subreddit": "TooAfraidToAsk", "subreddit_id": "t5_2ssp7"}, {"author": "honjapiano", "body": "ping system and the gun sounds!! ana’s fire is BEAUTIFUL", "created_utc": "1657074505.0", "edited": "False", "id": "if0xb3q", "is_submitter": "False", "link_id": "t3_vs0p9w", "parent_id": "t3_vs0p9w", "score": "1", "subreddit": "Overwatch", "subreddit_id": "t5_2u5kl"}, {"author": "honjapiano", "body": "Jett, since I haven’t figured out how any of the other agents (save for Sage) work…. it’s been about two weeks", "created_utc": "1657059850.0", "edited": "False", "id": "if01e0k", "is_submitter": "False", "link_id": "t3_vrqfnm", "parent_id": "t3_vrqfnm", "score": "1", "subreddit": "VALORANT", "subreddit_id": "t5_2dkvmc"}, {"author": "honjapiano", "body": "cool thank you so much!", "created_utc": "1657021995.0", "edited": "False", "id": "iexk7ob", "is_submitter": "True", "link_id": "t3_vrmizv", "parent_id": "t1_iew89vy", "score": "2", "subreddit": "fireemblem", "subreddit_id": "t5_2t0cn"}, {"author": "honjapiano", "body": "anything to save my boy! spoil away, my friend.", "created_utc": "1656987317.0", "edited": "False", "id": "iew749y", "is_submitter": "True", "link_id": "t3_vrmizv", "parent_id": "t1_iew5o2t", "score": "1", "subreddit": "fireemblem", "subreddit_id": "t5_2t0cn"}, {"author": "honjapiano", "body": "Ok, that makes sense. Thank you!", "created_utc": "1656985344.0", "edited": "False", "id": "iew3gfd", "is_submitter": "True", "link_id": "t3_vrmizv", "parent_id": "t1_iew2z5w", "score": "1", "subreddit": "fireemblem", "subreddit_id": "t5_2t0cn"}, {"author": "honjapiano", "body": "That’s good! I was a bit heartbroken that he disappeared and it wasn’t addressed. Glad I’ll see him again!", "created_utc": "1656985331.0", "edited": "False", "id": "iew3fjs", "is_submitter": "True", "link_id": "t3_vrmizv", "parent_id": "t1_iew2vbh", "score": "3", "subreddit": "fireemblem", "subreddit_id": "t5_2t0cn"}, {"author": "honjapiano", "body": "Awesome, thanks!", "created_utc": "1656985299.0", "edited": "False", "id": "iew3de1", "is_submitter": "True", "link_id": "t3_vrmizv", "parent_id": "t1_iew2uui", "score": "1", "subreddit": "fireemblem", "subreddit_id": "t5_2t0cn"}, {"author": "honjapiano", "body": "i’m the WORST with motion controls that aren’t WII sports… lots of range quits in the first scorpion fight lol. you get used to it though! now i prefer the motion to buttons!", "created_utc": "1656638703.0", "edited": "False", "id": "iee9zzn", "is_submitter": "True", "link_id": "t3_vo80dx", "parent_id": "t1_iee8yqa", "score": "3", "subreddit": "zelda", "subreddit_id": "t5_2r61g"}, {"author": "honjapiano", "body": "it definitely scared the shit outta me until i remembered i could fly", "created_utc": "1656627150.0", "edited": "False", "id": "iedkhmc", "is_submitter": "True", "link_id": "t3_vo80dx", "parent_id": "t1_ied8wjr", "score": "4", "subreddit": "zelda", "subreddit_id": "t5_2r61g"}, {"author": "honjapiano", "body": "( minor spoiler ) once you unlock lake floria, i think?", "created_utc": "1656610244.0", "edited": "False", "id": "iecdjy9", "is_submitter": "True", "link_id": "t3_vo80dx", "parent_id": "t1_iec7qem", "score": "9", "subreddit": "zelda", "subreddit_id": "t5_2r61g"}, {"author": "honjapiano", "body": "one of the islands in sky loft. near the edges toward the pumpkin shop, i think", "created_utc": "1656610171.0", "edited": "False", "id": "iecdd3z", "is_submitter": "True", "link_id": "t3_vo80dx", "parent_id": "t1_iebz4uo", "score": "6", "subreddit": "zelda", "subreddit_id": "t5_2r61g"}, {"author": "honjapiano", "body": "i abandoned an old (wattpad) account from 2012-ish and deleted it. i regret it so much because i could have easily privated the stories, but i just up and deleted all of them… i wish i could go back and keep them even if they were shit and cringey. \n\none of them hit almost 30k reads too… oh well. it’s gone forever now", "created_utc": "1656554669.0", "edited": "False", "id": "ie9me5c", "is_submitter": "False", "link_id": "t3_vnutgt", "parent_id": "t3_vnutgt", "score": "2", "subreddit": "FanFiction", "subreddit_id": "t5_2r5kb"}, {"author": "honjapiano", "body": "i’m the same! it’s so nerve wracking (esp as a young woman, so i avoid vc), but honestly, by best advice is to play with friends if you can! you’ll get more comfortable with the mechanics and probably be more relaxed in general. \n\nalso, i played a shitton of spike rush which helped a lot. i guess having so many games with such little expectations made me think of unranked as a bunch of spike rushes together, and made it a little less intimidating. \n\ni’ve played comp in other games (mostly ow) and i still get nervous. now THAT is all confidence in your own abilities. it helps to turn off chat entirely, because i always get stuck on what other’s might say or think. — these are things that helped me, anyway", "created_utc": "1656459204.0", "edited": "False", "id": "ie4cbqu", "is_submitter": "False", "link_id": "t3_vmkm1s", "parent_id": "t3_vmkm1s", "score": "1", "subreddit": "VALORANT", "subreddit_id": "t5_2dkvmc"}, {"author": "honjapiano", "body": "thank you so much! you’re a life saver!", "created_utc": "1656444092.0", "edited": "False", "id": "ie3ciut", "is_submitter": "False", "link_id": "t3_vmtfcf", "parent_id": "t1_ie3551l", "score": "1", "subreddit": "excel", "subreddit_id": "t5_2qur2"}, {"author": "honjapiano", "body": "it’s not registering as a range unfortunately. would you mind giving me an example? i have a feeling i’m formatting it wrong. \n\nmy original formula is: =vlookup(K11, F12:I54,2,FALSE)\n\nK is where the control value is, then G:I are the three columns full of values.\n\nedit: nevermind! got it lol", "created_utc": "1656440959.0", "edited": "False", "id": "ie34ovt", "is_submitter": "False", "link_id": "t3_vmtfcf", "parent_id": "t1_ie31uu1", "score": "1", "subreddit": "excel", "subreddit_id": "t5_2qur2"}, {"author": "honjapiano", "body": "i’m not writing bc i love it too much to actually do it. i’m never okay with anything i write and never finish anything which leads me to resenting it all together. \n\nprobably best for me to not write at all", "created_utc": "1656386216.0", "edited": "False", "id": "ie0ez12", "is_submitter": "False", "link_id": "t3_vm52f6", "parent_id": "t3_vm52f6", "score": "2", "subreddit": "FanFiction", "subreddit_id": "t5_2r5kb"}, {"author": "honjapiano", "body": "honestly, it depends on the connotation, which unfortunately changes from person to person (i’m still a little confused on what proshipping is tbh). but when i see “proshippers dni” it’s usually targeted at people who ship adult/minor ships (or any other morally wrong ships like incest and stuff). other times it’s people who simply don’t want ANY ships or shipping content.\n\na lot of the time it refers to people who are toxic (for lack of a better word) with shipping culture — ex. actively involving IRL people in their shipping activities, pushing ships onto people who don’t share the same ship, etc. \n\nit’s really hard to tell the difference because i can never actually get a straight and consistent answer as to what a “proshipper” is — it seems like nobody can agree upon it.\n\ni am pro-shipping (obv), but i personally wouldn’t interact with media that’s an adult/minor age-gap ship or incest.", "created_utc": "1656366347.0", "edited": "False", "id": "idz9250", "is_submitter": "False", "link_id": "t3_vm43x4", "parent_id": "t3_vm43x4", "score": "-6", "subreddit": "FanFiction", "subreddit_id": "t5_2r5kb"}, {"author": "honjapiano", "body": "i avoid both of those 💀 dionysus and demeter’s are the only dashes i like", "created_utc": "1656275488.0", "edited": "False", "id": "iduipnq", "is_submitter": "False", "link_id": "t3_vkplmb", "parent_id": "t3_vkplmb", "score": "1", "subreddit": "HadesTheGame", "subreddit_id": "t5_sfted"}, {"author": "honjapiano", "body": "i’ve heard that loot boxes already know what’s in them when you receive them, it’s not calculated when you open them. they might just automatically add it to your inventory/credit bank", "created_utc": "1655814694.0", "edited": "False", "id": "id6au5q", "is_submitter": "False", "link_id": "t3_vhajn0", "parent_id": "t3_vhajn0", "score": "9", "subreddit": "Overwatch", "subreddit_id": "t5_2u5kl"}, {"author": "honjapiano", "body": "wow this takes me back to my middle-school writing phase. i can’t believe i forgot about those blogs! thanks!", "created_utc": "1655778804.0", "edited": "False", "id": "id4x2ut", "is_submitter": "True", "link_id": "t3_vgcojz", "parent_id": "t1_id1fubj", "score": "1", "subreddit": "FanFiction", "subreddit_id": "t5_2r5kb"}, {"author": "honjapiano", "body": "dang, this comment is so helpful, thank you!! 5-times/5-1 things fics are so good, i can’t believe i never thought of writing one. i also never thought of breaking it down into five mini stories, even tho it seems so obvious!", "created_utc": "1655778641.0", "edited": "False", "id": "id4wree", "is_submitter": "True", "link_id": "t3_vgcojz", "parent_id": "t1_id16og7", "score": "2", "subreddit": "FanFiction", "subreddit_id": "t5_2r5kb"}, {"author": "honjapiano", "body": "i hadn’t thought of drabbles like that…but it sounds like fun, thanks!", "created_utc": "1655774258.0", "edited": "False", "id": "id4nvys", "is_submitter": "True", "link_id": "t3_vgcojz", "parent_id": "t1_id0xrdt", "score": "3", "subreddit": "FanFiction", "subreddit_id": "t5_2r5kb"}, {"author": "honjapiano", "body": "the gift exchange sounds pretty cool! i feel like something like that might give me some motivation to finish something, whether it’s polished or not. \n\ni definitely struggle to write short stories (under 1k), which may be a good challenge for me.\n\ni appreciate all of this, so thanks!!", "created_utc": "1655774154.0", "edited": "False", "id": "id4noej", "is_submitter": "True", "link_id": "t3_vgcojz", "parent_id": "t1_id4eavm", "score": "2", "subreddit": "FanFiction", "subreddit_id": "t5_2r5kb"}, {"author": "honjapiano", "body": "breathe vs breath. I DONT KNOW THE DIFFERENCE 😭 my friends clown me all the time but god, it doesn’t stick in my head.", "created_utc": "1655697873.0", "edited": "False", "id": "id0tr5x", "is_submitter": "False", "link_id": "t3_vg74sa", "parent_id": "t3_vg74sa", "score": "1", "subreddit": "FanFiction", "subreddit_id": "t5_2r5kb"}, {"author": "honjapiano", "body": "in my experience, it’s hard to have an appreciation for classical music if you haven’t studied music or grown up with it. \n\nlooney toons had a LOT of classical music in it so when my parents were kids, they were exposed to it and i guess some came to really like it.\n\ni cant see any scenario where kids these days grow up with classical music (save for studying or watching looney toons like i did) as anything other than “ambience/study” music, because that’s how it’s “marketed” to people on the internet. \n\nalso, the people who think they know classical music bc they listen to dark academia study playlists on youtube… ugh. the playlists are always so basic with the most popular choices… good luck finding one that excludes clair de lune, le danube bleu Einaudi, AND the Satie gnossiennes… there’s almost always one of them.", "created_utc": "1655697700.0", "edited": "False", "id": "id0th6a", "is_submitter": "False", "link_id": "t3_vfvc3h", "parent_id": "t3_vfvc3h", "score": "1", "subreddit": "classicalmusic", "subreddit_id": "t5_2qhyq"}, {"author": "honjapiano", "body": "huh, that’s pretty interesting! i’ve never found any patterns with the ch pronunciation, so i thought it was for everything 🤔 to be fair, my regional portuguese accent is subtitled in the mainland, so i can’t really talk about wacky pronunciation", "created_utc": "1655658572.0", "edited": "False", "id": "icyoeny", "is_submitter": "False", "link_id": "t3_vfm7ig", "parent_id": "t1_icyeg4i", "score": "1", "subreddit": "Overwatch", "subreddit_id": "t5_2u5kl"}, {"author": "honjapiano", "body": "makes sense. i know the br accent has a chi-ish sound instead of “do” sometimes (like, sometimes i hear do menino as ji/chi menino), so i thought it’d be the same. guess not. i only speak the euro accent. \n\ni do agree, tho. i wish they had a VA that spoke it just a little bit… it’d be cool to have proper pt voice lines in-game.", "created_utc": "1655653097.0", "edited": "False", "id": "icycmrb", "is_submitter": "False", "link_id": "t3_vfm7ig", "parent_id": "t1_icy8kg2", "score": "1", "subreddit": "Overwatch", "subreddit_id": "t5_2u5kl"}, {"author": "honjapiano", "body": "i’m pretty sure that brazilian portuguese has a lot of ‘ch’ sounds and probably is pronounced ‘achelerando’ in some regions. european pt would 100% be pronounces aselerando tho.", "created_utc": "1655646971.0", "edited": "False", "id": "icy0ct8", "is_submitter": "False", "link_id": "t3_vfm7ig", "parent_id": "t1_icxyv4i", "score": "-1", "subreddit": "Overwatch", "subreddit_id": "t5_2u5kl"}, {"author": "honjapiano", "body": "that sounds like my current season! i started comp in season 33 and won a good 50%-ish and stayed relatively the same SR, but this season has me falling like crazy. it’s nice to know that it happens from time to time and i’m not on a 1-track road down to -500 bronze.\n\ni don’t play comp very often, somewhat because i keep losing, but maybe it’s partly /because/ i don’t play it a lot. hopefully i don’t stay in bronze… that’d bruise my ego lol", "created_utc": "1655646754.0", "edited": "False", "id": "icxzylg", "is_submitter": "True", "link_id": "t3_vfmez6", "parent_id": "t1_icx07f5", "score": "2", "subreddit": "OverwatchUniversity", "subreddit_id": "t5_3ejpe"}, {"author": "honjapiano", "body": "OW is my first fps game and i’ve never played pc before, so i had really bad intuition of when i should be moving in, falling back, healing vs damage, reaction time, etc. so i’ve used the few vod reviews to focus on that (and positioning! still working on that one).\n\ni know being in VC can help (esp solo queuing) but i’d rather not get flamed cuz i’m a girl, and most people my ELO don’t use voice anyway...\n\nbut either way, thanks for the reply!", "created_utc": "1655646444.0", "edited": "False", "id": "icxze0j", "is_submitter": "True", "link_id": "t3_vfmez6", "parent_id": "t1_icwxeky", "score": "3", "subreddit": "OverwatchUniversity", "subreddit_id": "t5_3ejpe"}, {"author": "honjapiano", "body": "i would add some replay codes but they got reset after the last patch so i only have qp right now", "created_utc": "1655646061.0", "edited": "False", "id": "icxypa1", "is_submitter": "True", "link_id": "t3_vfmez6", "parent_id": "t1_icwxq1k", "score": "3", "subreddit": "OverwatchUniversity", "subreddit_id": "t5_3ejpe"}, {"author": "honjapiano", "body": "karq made a video detailing the new stuff from OW2 beta1 in comparison to the live game — all the stats and abilities. might be of use:\n\nhttps://youtu.be/8qmmQgCGsjU", "created_utc": "1655610561.0", "edited": "False", "id": "icwp8af", "is_submitter": "False", "link_id": "t3_velsj2", "parent_id": "t3_velsj2", "score": "1", "subreddit": "Overwatch", "subreddit_id": "t5_2u5kl"}, {"author": "honjapiano", "body": "i had a mei on my ass all match too, so i have no idea how this worked out", "created_utc": "1655208930.0", "edited": "False", "id": "icbjr0z", "is_submitter": "True", "link_id": "t3_vbmunc", "parent_id": "t1_icb8cvs", "score": "2", "subreddit": "Overwatch", "subreddit_id": "t5_2u5kl"}, {"author": "honjapiano", "body": "i appreciate that he looked directly at me and just walked the other way. he forgor 💀", "created_utc": "1655166577.0", "edited": "False", "id": "ic9r7do", "is_submitter": "True", "link_id": "t3_vbmunc", "parent_id": "t1_ic9bn20", "score": "37", "subreddit": "Overwatch", "subreddit_id": "t5_2u5kl"}, {"author": "honjapiano", "body": "it totally confused me too but that's just the way that the replays work. definitely takes some getting used to", "created_utc": "1655156585.0", "edited": "False", "id": "ic95szc", "is_submitter": "True", "link_id": "t3_vbmunc", "parent_id": "t1_ic94bvf", "score": "22", "subreddit": "Overwatch", "subreddit_id": "t5_2u5kl"}, {"author": "honjapiano", "body": "What are the chances of an M2 Pro/Max MBP coming out this year? \n\nMy early 2015 MBP is in desperate need of replacing, and with the WWDC, I know I'll be looking at a Max M chip for my next computer (I study in design/editing, so I need smth powerful). But I don't want to spend $5k on a new computer if the M2 has a high chance of being released in October. \n\nAny speculation? I definitely can't wait until 2023, but I can wait until October,,, maybe.", "created_utc": "1654907686.0", "edited": "False", "id": "ibx5wy0", "is_submitter": "False", "link_id": "t3_v94awc", "parent_id": "t3_v94awc", "score": "1", "subreddit": "apple", "subreddit_id": "t5_2qh1f"}, {"author": "honjapiano", "body": "Great, thanks! Now I just have to pray that they don't come out with an M2 Pro/Max chip in October, or else I'll kick myself for not waiting....", "created_utc": "1654905841.0", "edited": "False", "id": "ibx2i0w", "is_submitter": "False", "link_id": "t3_v9hkgo", "parent_id": "t1_ibwh0u7", "score": "1", "subreddit": "macbook", "subreddit_id": "t5_2qkjr"}, {"author": "honjapiano", "body": "thanks for the reply! this is all super useful!\n\ni'm curious about why to stop playing qp, if you can elaborate on that? i get nervous on comp so i only play if i have a good round of 'warm up's' on qp. i don't have climbing as a priority, but falling in the ranks does suck, and if i can somehow get a little better, that's all i'm really after.", "created_utc": "1653876273.0", "edited": "False", "id": "iahwguc", "is_submitter": "False", "link_id": "t3_v0dd50", "parent_id": "t1_iag31pj", "score": "1", "subreddit": "OverwatchUniversity", "subreddit_id": "t5_3ejpe"}, {"author": "honjapiano", "body": "Now that you say that, I do recall running out of bullets at the worst times. I’ll keep watch for that, thanks!!", "created_utc": "1653872024.0", "edited": "False", "id": "iaho6pd", "is_submitter": "False", "link_id": "t3_v0dd50", "parent_id": "t1_iag5n3k", "score": "1", "subreddit": "OverwatchUniversity", "subreddit_id": "t5_3ejpe"}, {"author": "honjapiano", "body": "dang! i missed it! but i’ll keep an eye out for the next stream. do you do VOD reviews every stream?", "created_utc": "1653871325.0", "edited": "False", "id": "iahmuup", "is_submitter": "False", "link_id": "t3_v0dd50", "parent_id": "t1_iagowz4", "score": "1", "subreddit": "OverwatchUniversity", "subreddit_id": "t5_3ejpe"}, {"author": "honjapiano", "body": "i’ve learned the hard way, if i want smth done right. i gotta do it myself 😤 srs though, i got so much praise from my team when i nano’d the rein and was super flustered but looking back, i coulda helped him out a bit 💀 i just tossed him in to die", "created_utc": "1653841703.0", "edited": "False", "id": "iafy0iq", "is_submitter": "True", "link_id": "t3_v048du", "parent_id": "t1_iafvixs", "score": "2", "subreddit": "Overwatch", "subreddit_id": "t5_2u5kl"}, {"author": "honjapiano", "body": "it’s similar, but not the same. i think only the first two bars are the same. although i see where you’re coming from", "created_utc": "1653841541.0", "edited": "False", "id": "iafxnen", "is_submitter": "True", "link_id": "t3_uzbj7t", "parent_id": "t1_iaev3bv", "score": "1", "subreddit": "piano", "subreddit_id": "t5_2qnw8"}, {"author": "honjapiano", "body": "no idea why i just stood there like an idiot instead of healing my rein smh. it was my first ever match as ana, two months into playing pc, but still! embarrassing", "created_utc": "1653801187.0", "edited": "False", "id": "iae92c5", "is_submitter": "True", "link_id": "t3_v048du", "parent_id": "t3_v048du", "score": "8", "subreddit": "Overwatch", "subreddit_id": "t5_2u5kl"}, {"author": "honjapiano", "body": "Not an author, but I got feedback on an assignment I handed in, and I was reading it over, only to find a very obvious and silly spelling mistake on the *first* page. \n\nI feel the rage. I can't count the number of times I proofread my research proposal.", "created_utc": "1653792762.0", "edited": "False", "id": "iadw12d", "is_submitter": "False", "link_id": "t3_uzvzma", "parent_id": "t3_uzvzma", "score": "3", "subreddit": "FanFiction", "subreddit_id": "t5_2r5kb"}, {"author": "honjapiano", "body": "For me, it depends on context/what you need to use the language for.\n\nFor Spanish and Portuguese, I don't have a high bar. I can understand most of what's being said to me in both, and I can communicate in writing, but I have a bit of a \"fear\" of speaking out loud. That being said, I would consider myself a Portuguese speaker before a Spanish speaker because I can get by in Portuguese more easily. Simply from my exposure from my family, I can wing it, but I definitely can't with Spanish.\n\nBut if it's a language you learn at school or work: I consider myself a French speaker because I can do my schooling/profession in French, and that's the bar I've set for myself.\n\nI think the base of it is the ability to communicate effectively. I know a lot of people who are heritage speakers of a language and can't do school in it, but they're far more proficient in communicating than I am in my second language.", "created_utc": "1653792221.0", "edited": "False", "id": "iadv3rp", "is_submitter": "False", "link_id": "t3_uzkcyu", "parent_id": "t3_uzkcyu", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "honjapiano", "body": "people on r/piano seemed to think this was okay so i thought i would share this work in progress here too -- currently working on the second half, sorry for the abrupt ending", "created_utc": "1653767949.0", "edited": "False", "id": "iacjyw7", "is_submitter": "True", "link_id": "t3_uzuwyx", "parent_id": "t3_uzuwyx", "score": "6", "subreddit": "zelda", "subreddit_id": "t5_2r61g"}, {"author": "honjapiano", "body": "i'm playing this an octave lower than it should be (there's an 8 symbol on both the bass and treble clef). my copy of the piece is almost identical to the one on [ninsheetmusic.org](https://ninsheetmusic.org) (mine is missing the intro).", "created_utc": "1653767505.0", "edited": "False", "id": "iacj2la", "is_submitter": "True", "link_id": "t3_uzbj7t", "parent_id": "t1_iacesgu", "score": "2", "subreddit": "piano", "subreddit_id": "t5_2qnw8"}, {"author": "honjapiano", "body": "the Hanzo-DVA and Cassidy-Ashe interactions in OW2 have become my favourites. for OW1, Hanzo-Moira and Genji-Hanzo ones make me laugh", "created_utc": "1653764219.0", "edited": "False", "id": "iacc5ay", "is_submitter": "False", "link_id": "t3_uzqorr", "parent_id": "t3_uzqorr", "score": "0", "subreddit": "Overwatch", "subreddit_id": "t5_2u5kl"}, {"author": "honjapiano", "body": "It’s possible, I know that it was widely out of tune beforehand. Our pianos might be tuned slightly sharp and flat from the original note and maybe that’s why it sounds like there’s a huge difference between them", "created_utc": "1653763824.0", "edited": "False", "id": "iacbc9q", "is_submitter": "True", "link_id": "t3_uzbj7t", "parent_id": "t1_iacack8", "score": "1", "subreddit": "piano", "subreddit_id": "t5_2qnw8"}, {"author": "honjapiano", "body": "this and the main theme are just so good! the entire OST is great lol. good luck with this piece!", "created_utc": "1653762865.0", "edited": "False", "id": "iac9d82", "is_submitter": "True", "link_id": "t3_uzbj7t", "parent_id": "t1_iac8x91", "score": "2", "subreddit": "piano", "subreddit_id": "t5_2qnw8"}, {"author": "honjapiano", "body": "i’m working on the second half now, but i’ll post it when it’s done!", "created_utc": "1653762673.0", "edited": "False", "id": "iac8z3h", "is_submitter": "True", "link_id": "t3_uzbj7t", "parent_id": "t1_iac604w", "score": "1", "subreddit": "piano", "subreddit_id": "t5_2qnw8"}, {"author": "honjapiano", "body": "you’re too sweet, thank you!! i’ll definitely try to iron out the dynamics a bit more once i’ve got the second half done. and i agree, it sounds really nice when it’s slowed down a little bit, which surprised me too", "created_utc": "1653762627.0", "edited": "False", "id": "iac8vql", "is_submitter": "True", "link_id": "t3_uzbj7t", "parent_id": "t1_iaain2n", "score": "1", "subreddit": "piano", "subreddit_id": "t5_2qnw8"}, {"author": "honjapiano", "body": "thank you!!", "created_utc": "1653762495.0", "edited": "False", "id": "iac8m2k", "is_submitter": "True", "link_id": "t3_uzbj7t", "parent_id": "t1_iabjpmy", "score": "1", "subreddit": "piano", "subreddit_id": "t5_2qnw8"}, {"author": "honjapiano", "body": "thanks!", "created_utc": "1653762486.0", "edited": "False", "id": "iac8lga", "is_submitter": "True", "link_id": "t3_uzbj7t", "parent_id": "t1_iabxydp", "score": "2", "subreddit": "piano", "subreddit_id": "t5_2qnw8"}, {"author": "honjapiano", "body": "now that you say that, i hear it — i’ll look out for it, thanks!", "created_utc": "1653762473.0", "edited": "False", "id": "iac8ke0", "is_submitter": "True", "link_id": "t3_uzbj7t", "parent_id": "t1_iac5tlj", "score": "2", "subreddit": "piano", "subreddit_id": "t5_2qnw8"}, {"author": "honjapiano", "body": "thanks!! that actually makes me really happy because my small hands have stopped me from playing LOTS of things. i worked really hard to make this work and i’m glad it paid off!", "created_utc": "1653762433.0", "edited": "False", "id": "iac8hil", "is_submitter": "True", "link_id": "t3_uzbj7t", "parent_id": "t1_iabzfrg", "score": "1", "subreddit": "piano", "subreddit_id": "t5_2qnw8"}, {"author": "honjapiano", "body": "you can find it on [ninsheetmusic.org](https://www.ninsheetmusic.org/download/pdf/3548) !", "created_utc": "1653762260.0", "edited": "False", "id": "iac84pe", "is_submitter": "True", "link_id": "t3_uzbj7t", "parent_id": "t1_iac0f4z", "score": "1", "subreddit": "piano", "subreddit_id": "t5_2qnw8"}, {"author": "honjapiano", "body": "not sure where my teacher found it, but my version is exactly the same as ninsheet except it’s missing the little into part", "created_utc": "1653762222.0", "edited": "False", "id": "iac81y5", "is_submitter": "True", "link_id": "t3_uzbj7t", "parent_id": "t1_iabscxk", "score": "1", "subreddit": "piano", "subreddit_id": "t5_2qnw8"}, {"author": "honjapiano", "body": "my teacher asked if I wanted to play any video game music and she came up with this. Not sure where she found my version but it’s very very similar to the [ninsheetmusic.org](https://www.ninsheetmusic.org/download/pdf/3548) version. mine is missing the intro, but i think it’s exactly the same\n\nif the right hand pattern is hard (for my small hands it was a bit of a challenge), it might be worth checking out the ocarina of time version, which doesn’t have polyrhythms and the right hand is a different pattern", "created_utc": "1653761965.0", "edited": "1653767590.0", "id": "iac7ij4", "is_submitter": "True", "link_id": "t3_uzbj7t", "parent_id": "t1_iaaj2cv", "score": "3", "subreddit": "piano", "subreddit_id": "t5_2qnw8"}, {"author": "honjapiano", "body": "not chopin, it’s the great fairy fountain from breath of the wild", "created_utc": "1653761628.0", "edited": "False", "id": "iac6tik", "is_submitter": "True", "link_id": "t3_uzbj7t", "parent_id": "t1_ia9vjgm", "score": "1", "subreddit": "piano", "subreddit_id": "t5_2qnw8"}, {"author": "honjapiano", "body": " i’m learning this so that i can get polyrhythms down for fantasie, and i totally see where you’re coming from. good luck on it!!", "created_utc": "1653761459.0", "edited": "False", "id": "iac6h2k", "is_submitter": "True", "link_id": "t3_uzbj7t", "parent_id": "t1_ia9sngw", "score": "5", "subreddit": "piano", "subreddit_id": "t5_2qnw8"}, {"author": "honjapiano", "body": "nope! the great fairy fountain from zelda: breath of the wild", "created_utc": "1653761384.0", "edited": "False", "id": "iac6bhg", "is_submitter": "True", "link_id": "t3_uzbj7t", "parent_id": "t1_iaa92cn", "score": "1", "subreddit": "piano", "subreddit_id": "t5_2qnw8"}, {"author": "honjapiano", "body": "i think that might just be my notes that are muddled. the sheet asks for the pedal to be held the entire bar, although i’m considering changing it up a bit", "created_utc": "1653761242.0", "edited": "False", "id": "iac610b", "is_submitter": "True", "link_id": "t3_uzbj7t", "parent_id": "t1_iaapumn", "score": "1", "subreddit": "piano", "subreddit_id": "t5_2qnw8"}, {"author": "honjapiano", "body": "I don’t know where my teacher found it somewhere but it’s very similar to the one on ninsheetmusic.org (under the breath of the wild section)", "created_utc": "1653761193.0", "edited": "False", "id": "iac5xhs", "is_submitter": "True", "link_id": "t3_uzbj7t", "parent_id": "t1_iabppgd", "score": "1", "subreddit": "piano", "subreddit_id": "t5_2qnw8"}, {"author": "honjapiano", "body": "it was tuned yesterday but thanks.", "created_utc": "1653760889.0", "edited": "False", "id": "iac5al4", "is_submitter": "True", "link_id": "t3_uzbj7t", "parent_id": "t1_iab8z07", "score": "2", "subreddit": "piano", "subreddit_id": "t5_2qnw8"}, {"author": "honjapiano", "body": "I’ve listened to this recording (and my own playing) so many times that I needed a new ear to critique it. The accents are definitely a bit of a challenge but I’m excited to bump up the tempo slowly! Thanks for the comment!", "created_utc": "1653706265.0", "edited": "False", "id": "ia9rper", "is_submitter": "True", "link_id": "t3_uzbj7t", "parent_id": "t1_ia9byec", "score": "9", "subreddit": "piano", "subreddit_id": "t5_2qnw8"}, {"author": "honjapiano", "body": "every time i get thanked, i feel all warm and fuzzy because it’s rare. especially after matches, if someone says “great heals” it makes me feel so good and more motivated to play well. \n\ni rarely play dps, but when i do, i know my support must be bending over backwards to keep me alive so i always thank them.", "created_utc": "1653395728.0", "edited": "False", "id": "i9st2f6", "is_submitter": "False", "link_id": "t3_uwdj3l", "parent_id": "t3_uwdj3l", "score": "1", "subreddit": "Overwatch", "subreddit_id": "t5_2u5kl"}, {"author": "honjapiano", "body": "My teacher starts people off with Db major since it fits under the hands well and it hits all the black keys. Another comfortable scale is Ab and Eb major. The intuition really does just come with practice and repetition of songs in that key. I still have issues with Gb major because my brain refuses to remember the flat C…\n\nOne thing I used to do was practice my scales/arpeggios in each key in succession. So I’d work from A major, to B major, to C major (etc), which might force you to recognize the keys for the scale more quickly. Otherwise, before you start a piece, always look at the key signature, observe the accidentals, and maybe even do a run of the scale before starting.\n\nI doubt this was any help, but I thought I’d put my two cents in just in case.", "created_utc": "1652732329.0", "edited": "False", "id": "i8v343h", "is_submitter": "False", "link_id": "t3_ur33gx", "parent_id": "t3_ur33gx", "score": "4", "subreddit": "piano", "subreddit_id": "t5_2qnw8"}, {"author": "honjapiano", "body": "tried to crouch-shift as moira and fucked it up and now this won’t go away. doesn’t show up in loading screens, so it’s an OW setting, not PC, i think?", "created_utc": "1652477379.0", "edited": "False", "id": "i8i421k", "is_submitter": "False", "link_id": "t3_up1wbn", "parent_id": "t3_up1wbn", "score": "1", "subreddit": "Overwatch", "subreddit_id": "t5_2u5kl"}, {"author": "honjapiano", "body": "go into the sound settings. there should be a tab that says subtitles. you can turn them on for everything or just critical gameplay. i think it’s sound the voice chat options?", "created_utc": "1652313862.0", "edited": "False", "id": "i895qao", "is_submitter": "False", "link_id": "t3_unho12", "parent_id": "t1_i88ojwn", "score": "11", "subreddit": "Overwatch", "subreddit_id": "t5_2u5kl"}, {"author": "honjapiano", "body": "100% read more. not just in the target language, but maybe try speed reading in your native language too (unless it’s a different script like Japanese or Korean… that’s a little harder). Honestly, even if you miss the subs, the more you watch (and read) with subs, you’ll ultimately get faster at reading them. if they really are SUPER fast, maybe try slowing down the show itself by -0.25 or smth (netflix has those options, i think)", "created_utc": "1652288897.0", "edited": "False", "id": "i87h1n5", "is_submitter": "False", "link_id": "t3_un8ibn", "parent_id": "t3_un8ibn", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "honjapiano", "body": "i have the exact same thing, but i don’t play bassoon. i started piano when i was 8 and have played for 11 years. maybe it’s just a musician’s curse. my ring fingers are also cursed, but the opposite direction", "created_utc": "1652287168.0", "edited": "False", "id": "i87ck7n", "is_submitter": "False", "link_id": "t3_umzi82", "parent_id": "t3_umzi82", "score": "1", "subreddit": "bassoon", "subreddit_id": "t5_2sc37"}, {"author": "honjapiano", "body": "Happens a lot with those types of languages! Especially among immigrants in multicultural places like Canada. My grandma and her neighbour always spoke to each other in their respective languages (Portuguese and Italian) and never actually learned the other’s language. I thought it was magic until I made a friend who spoke Spanish and found it came quite easily.", "created_utc": "1652215994.0", "edited": "False", "id": "i83l0h6", "is_submitter": "False", "link_id": "t3_umka0k", "parent_id": "t1_i83i00c", "score": "5", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "honjapiano", "body": "Thanks, I’ll give it a try!", "created_utc": "1652129264.0", "edited": "False", "id": "i7yt04y", "is_submitter": "False", "link_id": "t3_uli0qr", "parent_id": "t1_i7yibqy", "score": "1", "subreddit": "learnart", "subreddit_id": "t5_2s6fc"}, {"author": "honjapiano", "body": "I’ll try that, thanks!", "created_utc": "1652128934.0", "edited": "False", "id": "i7ys7dd", "is_submitter": "False", "link_id": "t3_uli0qr", "parent_id": "t1_i7wavly", "score": "1", "subreddit": "learnart", "subreddit_id": "t5_2s6fc"}, {"author": "honjapiano", "body": "I’ve had pretty much the same experience with my family/peers. Got clowned for not speaking Portuguese, then when I tried to learn, I got clowned for not being good at it. When I visited Portugal and tried to practice, I got asked to stop and just speak English. It’s really intimidating and upsetting. I haven’t spoken Portuguese out loud since. \n\nI think it hurts more because they’re related to you and it’s your own cultural language, but it really just comes with practice and you can’t let it bug you (as hard as it is). I’ve only gained confidence in conversing through joining language learning discords (specific to the language). Slowly, I’m getting to the point where I might consider speaking to my family, but somehow strangers online feel safer. \n\nSomething that did help my pronunciation is singing to songs. Helped the flow of words and expanded my vocabulary, even tho the syntax isn’t standard to regular talk.", "created_utc": "1652128471.0", "edited": "False", "id": "i7yr2to", "is_submitter": "False", "link_id": "t3_ulqyhz", "parent_id": "t3_ulqyhz", "score": "5", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "honjapiano", "body": "if you’ve seen anything from Karina Farek (dilfosaur) that’s sorta what i want. her art isn’t realism yet she has proper anatomy, and she somehow makes it work with a stylized, more cartoon-y face. the art for Hades (game) is also something that is sorta what i want \n\nwith regard to apollo: i tend to be quite good at mimicry for some reason. if i have a direct reference in front of me, i can copy it pretty easily, but i can’t manipulate it in any way or else it all goes to hell. even having multiple direct references and then piecing them together doesn’t really work for me.", "created_utc": "1652115508.0", "edited": "False", "id": "i7xv6lz", "is_submitter": "False", "link_id": "t3_uli0qr", "parent_id": "t1_i7vslr9", "score": "2", "subreddit": "learnart", "subreddit_id": "t5_2s6fc"}, {"author": "honjapiano", "body": "I know so many native English speakers who can’t pronounce the “th” all the time. It’s a total menace!", "created_utc": "1652115054.0", "edited": "False", "id": "i7xu1g4", "is_submitter": "False", "link_id": "t3_ulg5uf", "parent_id": "t1_i7xt1bp", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "honjapiano", "body": "Duolingo says carro — it think it’s from Spain but i know it’s not 100% reliable. \n\nAnyway, my Portuguese accent is a bit wonky since I speak a mix of one of the Açorean and Continental accents (i’ve got a mixed family). Most of the Portuguese people I know don’t roll their R’s at all (unless they want to be mock-fancy) and sounds more akin to the French R", "created_utc": "1652114708.0", "edited": "False", "id": "i7xt5vg", "is_submitter": "False", "link_id": "t3_ulg5uf", "parent_id": "t1_i7xs3ob", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "honjapiano", "body": "He’s 10 but very into video games, so maybe I can play into that. Either way, thanks for the comment! Especially the tidbit about winning over an audience!", "created_utc": "1652113102.0", "edited": "False", "id": "i7xp4s2", "is_submitter": "True", "link_id": "t3_ulhgmk", "parent_id": "t1_i7vz6hs", "score": "2", "subreddit": "piano", "subreddit_id": "t5_2qnw8"}, {"author": "honjapiano", "body": "A few of these books definitely ring a bell. I think I still have my old faber books too, so maybe I’ll review them. Thanks for the comment! I appreciate it", "created_utc": "1652112979.0", "edited": "False", "id": "i7xotk1", "is_submitter": "True", "link_id": "t3_ulhgmk", "parent_id": "t1_i7wwtbi", "score": "1", "subreddit": "piano", "subreddit_id": "t5_2qnw8"}, {"author": "honjapiano", "body": "that’s a really good idea! i hadn’t thought of that, thanks!", "created_utc": "1652112749.0", "edited": "False", "id": "i7xo8o1", "is_submitter": "True", "link_id": "t3_ulhgmk", "parent_id": "t1_i7wajtq", "score": "1", "subreddit": "piano", "subreddit_id": "t5_2qnw8"}, {"author": "honjapiano", "body": "somehow that makes me feel better, thanks!", "created_utc": "1652112713.0", "edited": "False", "id": "i7xo5ju", "is_submitter": "True", "link_id": "t3_ulhgmk", "parent_id": "t1_i7vxf1a", "score": "1", "subreddit": "piano", "subreddit_id": "t5_2qnw8"}, {"author": "honjapiano", "body": "I’ve always seen the French R as a sort of guttural sound. I started off with it just being like gargling water but without the water… like rolling your R but from your throat rather than your tongue. \n\nbut when you gargle, the back of your tongue is gonna feel quite low so if you slowly ease it a bit higher, you can get it. then, if you raise it too high then you lose it, so you need to find a nice sweet spot. then once you get the hang of it, you can get it a bit more airy and relaxed \n\ni’m no linguist or anything, so this might definitely not be the most professional way of learning but maybe this will help… this is how my eight year old self figured it out.", "created_utc": "1652097188.0", "edited": "1652111601.0", "id": "i7wq87q", "is_submitter": "False", "link_id": "t3_ulg5uf", "parent_id": "t1_i7vwc7t", "score": "5", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "honjapiano", "body": "I found the Portuguese and French R’s really easy but SPANISH??? i’ve tried for /years/ to roll my r’s and i’ve given up at this point. am i saying something’s expensive or talking about a car? nobody will ever know at this point.", "created_utc": "1652064440.0", "edited": "False", "id": "i7vib3s", "is_submitter": "False", "link_id": "t3_ulg5uf", "parent_id": "t3_ulg5uf", "score": "56", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "honjapiano", "body": "I really enjoy:\n• Gad Gone Wild\n• Sugar Sammy (you can find his comedy on youtube)\n• Il a déjà tes yeux \n• Dix pour cent\n• Lupin\n• Hookup Plan\n• A Very Secret Service\n\nI also enjoyed watching anime with French dub! Better than english imo", "created_utc": "1652062811.0", "edited": "False", "id": "i7vf3qu", "is_submitter": "False", "link_id": "t3_uku6e9", "parent_id": "t3_uku6e9", "score": "1", "subreddit": "French", "subreddit_id": "t5_2rd5t"}, {"author": "honjapiano", "body": "What I did was: I would read a chapter of a book and then write a summary in French. Then, I would put it through LanguageTool (or smth like that) and check what went wrong. I would always handwrite it in a notebook and handwrite the corrections since I seemed to remember them better. I read the entire harry potter series in French and worked like this, and it helped a bit. Plus, if you read in French, it can help with speaking if you do it out loud!\n\nTBH, my listening/speaking/reading have always been much better than my writing. I always struggled with it a lot and after over 13 years of learning, I only really got better at writing when I had to do essays in uni because it forced me to practice more.\n\nMore recently, I just started keeping a personal journal, and I try to write a bit every week in one of the languages I’m learning. It’s really all about repetition and practice. From someone who thought they would never improve, I swear it gets better.", "created_utc": "1652062455.0", "edited": "False", "id": "i7veehu", "is_submitter": "False", "link_id": "t3_ulemgn", "parent_id": "t3_ulemgn", "score": "5", "subreddit": "French", "subreddit_id": "t5_2rd5t"}, {"author": "honjapiano", "body": "I watched the movies before I could read english super well, and then ended up just watching them instead of reading. I did end up reading the series at 19 and really enjoyed it — I also read it in french for “educational purposes” which was actually a lot more fun because I could try to decipher the puns. I’d say, if you’re a fan of the movies, they’re a good, easy read.", "created_utc": "1652027323.0", "edited": "False", "id": "i7t9wc1", "is_submitter": "False", "link_id": "t3_ul2fv7", "parent_id": "t3_ul2fv7", "score": "1", "subreddit": "books", "subreddit_id": "t5_2qh4i"}, {"author": "honjapiano", "body": "A lot of people who are fluent in Chinese languages can’t read it. A lot of my friends speak Mando/Canto fluently and could easily have professional conversations but they can’t read or write because they never learned. So I guess it depends on what they need the fluency for.", "created_utc": "1652027136.0", "edited": "False", "id": "i7t9h50", "is_submitter": "False", "link_id": "t3_ukufts", "parent_id": "t3_ukufts", "score": "2", "subreddit": "NoStupidQuestions", "subreddit_id": "t5_2w844"}, {"author": "honjapiano", "body": "i feel like i’m a third party here: someone who grew up in a multilingual family but never learned the language. \n\nsomething i find hard to explain to both parties is how out of place I feel in my family/around others of the same culture simply because i don’t speak the language. it makes me take cultural issues and discourse a lot more seriously because a lack of it matters so much to me. maybe that’s just a personal thing tho", "created_utc": "1651597675.0", "edited": "False", "id": "i76kzbm", "is_submitter": "False", "link_id": "t3_uh97aq", "parent_id": "t3_uh97aq", "score": "9", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "honjapiano", "body": "they made soldier more grumpy and reaper a drama queen. i LOVE it 💀", "created_utc": "1651597274.0", "edited": "False", "id": "i76jyid", "is_submitter": "False", "link_id": "t3_uhb9j9", "parent_id": "t3_uhb9j9", "score": "4", "subreddit": "Overwatch", "subreddit_id": "t5_2u5kl"}, {"author": "honjapiano", "body": "I graduated high school with a B1 in French (estimated) and now I’m halfway through a bilingual (EN-FR) degree at uni and loving it.\n\nMy writing skills were ASS but I could speak well when I started my first year. Still struggling a bit with grammar rules but I definitely didn’t get close to failing lol. Luckily languages degrees tend to be about both practical and written language — at least mine is.", "created_utc": "1651596305.0", "edited": "False", "id": "i76hfz2", "is_submitter": "False", "link_id": "t3_uhg441", "parent_id": "t3_uhg441", "score": "5", "subreddit": "French", "subreddit_id": "t5_2rd5t"}, {"author": "honjapiano", "body": "tbh i was forced into it as a kid through my school program but as i got older and was more involved in online communities, a lot of my friends ended up speaking different languages and i wanted to be able to interact with them in their native languages instead of always english. i’m doing a bilingual undergrad which i’m loving. \n\ni mostly learn new languages to be able to interact with my friends (and sometimes their parents) in new ways — it’s also great for jobs, so i’m trying to learn spanish too, as both are very useful in canada", "created_utc": "1651595930.0", "edited": "False", "id": "i76ggtm", "is_submitter": "False", "link_id": "t3_uhd24u", "parent_id": "t3_uhd24u", "score": "1", "subreddit": "French", "subreddit_id": "t5_2rd5t"}, {"author": "honjapiano", "body": "i'm too scared of getting roasted to do dps placements, but 2.1k tank and 1.7k support aint too bad in my books\n\nalthough, i have no idea how i got gold tank... i'm ass at tank lol", "created_utc": "1651546366.0", "edited": "False", "id": "i742ltr", "is_submitter": "False", "link_id": "t3_uh1mws", "parent_id": "t3_uh1mws", "score": "1", "subreddit": "Overwatch", "subreddit_id": "t5_2u5kl"}, {"author": "honjapiano", "body": "I get this sometimes. usually I save and quit CSP then make sure my wacom driver is up-to-date and then re-open CSP and just draw with my wacom driver open. I don’t know why it works but it does", "created_utc": "1651443510.0", "edited": "False", "id": "i6yi2u0", "is_submitter": "False", "link_id": "t3_ug8v0c", "parent_id": "t3_ug8v0c", "score": "6", "subreddit": "ClipStudio", "subreddit_id": "t5_3a4b5"}, {"author": "honjapiano", "body": "I was so scared of this, only to not have a single reaction. IDK what kind of anesthesia y’all are getting in the US, but I got my wisdom teeth out and it was nothing like those videos. I was woozy and giggly but nothing was out of control.", "created_utc": "1651285952.0", "edited": "False", "id": "i6quv0z", "is_submitter": "False", "link_id": "t3_uevy24", "parent_id": "t3_uevy24", "score": "1", "subreddit": "NoStupidQuestions", "subreddit_id": "t5_2w844"}, {"author": "honjapiano", "body": "Somehow this migrated to Canada too! Thought it was a Canadian thing but I guess not", "created_utc": "1651169994.0", "edited": "False", "id": "i6kb7x7", "is_submitter": "False", "link_id": "t3_udpvcz", "parent_id": "t1_i6jmkry", "score": "4", "subreddit": "French", "subreddit_id": "t5_2rd5t"}, {"author": "honjapiano", "body": "I regret not going in spoiler/walkthrough/playthrough free. Go explore and adventure naturally! It’s open world and for the most part, you can do stuff in any order you want!\n\nMaybe I’m just a simp for storylines", "created_utc": "1651162012.0", "edited": "False", "id": "i6jrd31", "is_submitter": "False", "link_id": "t3_udtpih", "parent_id": "t3_udtpih", "score": "1", "subreddit": "Breath_of_the_Wild", "subreddit_id": "t5_3f1s6"}, {"author": "honjapiano", "body": "I got it ASAP but I know someone else who had to wait like 30 mins. The servers are down for me anyway, so I’m sure they’re rolling them out a bit slowly. I did have to restart the battle.net app before it showed up.", "created_utc": "1651098508.0", "edited": "False", "id": "i6gl1o7", "is_submitter": "False", "link_id": "t3_udegdm", "parent_id": "t3_udegdm", "score": "2", "subreddit": "Overwatch", "subreddit_id": "t5_2u5kl"}, {"author": "honjapiano", "body": "It gives me a sense of community, I guess. I (begrudgingly) don’t really have a connection to my heritage, so it gives me a space that I feel I can belong, even though I’m not necessarily of that culture. \n\nIn the absence of any cultural connections, it does give me a chance to at least /try/ to find some semblance of it, even if it’s just to be used on Facebook with family across the globe.", "created_utc": "1651031627.0", "edited": "False", "id": "i6cy2zt", "is_submitter": "False", "link_id": "t3_ucs3f4", "parent_id": "t3_ucs3f4", "score": "5", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "honjapiano", "body": "Ohh whoops!", "created_utc": "1651007593.0", "edited": "False", "id": "i6bgmm7", "is_submitter": "False", "link_id": "t3_ucbohb", "parent_id": "t1_i6bd3f9", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "honjapiano", "body": "Porkglish — Or, I guess, Portglish— is what we (or maybe just my family) call mixed Portuguese-English. Somehow, Portuguese immigrants got called “Porkchops” (not sure where it came from or if anyone uses it anymore). \n\nI always have to pause before typing tale, and I’m a native speaker, so I feel that pain.", "created_utc": "1650999973.0", "edited": "False", "id": "i6axbs9", "is_submitter": "False", "link_id": "t3_ucbohb", "parent_id": "t1_i6aveie", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "honjapiano", "body": "100% cursed but I love it. It’s hilarious when my continental portuguese friends try to understand my neighbours — spoiler: the don’t heh. \n\nI guess it’s even worse when they speak Porkglish.", "created_utc": "1650995309.0", "edited": "False", "id": "i6al8vq", "is_submitter": "False", "link_id": "t3_ucbohb", "parent_id": "t1_i6ak9wb", "score": "6", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "honjapiano", "body": "Yeah! A lot of Portuguese immigrants are from São Miguel in Canada (including my family lol). I think I spelled it right?? Please tell me if I didn’t !\n\nI’ve heard that they have to subtitle them on continental news sources!", "created_utc": "1650995247.0", "edited": "False", "id": "i6al31d", "is_submitter": "False", "link_id": "t3_ucbohb", "parent_id": "t1_i6ahlla", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "honjapiano", "body": "I definitely understand that thought process! As someone who speaks/learns all three, trying to differentiate them in the moment is a nightmare — I never get French and Spanish mixed up, BUT i always get Portuguese/French and Spanish/Portuguese mixed!", "created_utc": "1650984658.0", "edited": "False", "id": "i69tmm2", "is_submitter": "False", "link_id": "t3_ucbohb", "parent_id": "t1_i69qixi", "score": "4", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "honjapiano", "body": "To me, Brazilian Portuguese doesn’t sound /anything/ like Russian. I honestly get it mixed up with Spanish more often. If people are getting Brazilian mixed up with Russian… they should listen to the Açorean accent 😅😅", "created_utc": "1650984520.0", "edited": "False", "id": "i69t9zl", "is_submitter": "False", "link_id": "t3_ucbohb", "parent_id": "t1_i69r5bx", "score": "6", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "honjapiano", "body": "It really depends on the dialect tho. Continental Portuguese definitely doesn’t sound like Russian at all to me and I don’t get it. But if you listen to the Rabo de Peixe accent? Ok, fine, I can see how people can get confused if they don’t know Portuguese. I think it’s bc of all the throaty sh/ch sounds. Like drunk Spanish", "created_utc": "1650984405.0", "edited": "False", "id": "i69szjv", "is_submitter": "False", "link_id": "t3_ucbohb", "parent_id": "t1_i69nwan", "score": "6", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "honjapiano", "body": "It doesn’t actually sound like Russian to anyone who actually knows either language, but a lot of people think European Portuguese sounds like Russian. \n\nI would suggest learning the Russian alphabet though, if you’re interested in Russian. It’s a bit tedious but once you learn it, you’ll never forget it!", "created_utc": "1650977765.0", "edited": "False", "id": "i69dg33", "is_submitter": "False", "link_id": "t3_ucbohb", "parent_id": "t3_ucbohb", "score": "275", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "honjapiano", "body": "Oooo I like that take!", "created_utc": "1650838786.0", "edited": "False", "id": "i620wjo", "is_submitter": "False", "link_id": "t3_uazbch", "parent_id": "t1_i61qd50", "score": "3", "subreddit": "Overwatch", "subreddit_id": "t5_2u5kl"}, {"author": "honjapiano", "body": "Ana, Cassidy, Mercy… I have no idea at this point.", "created_utc": "1650830069.0", "edited": "False", "id": "i61gmip", "is_submitter": "False", "link_id": "t3_uazbch", "parent_id": "t3_uazbch", "score": "2", "subreddit": "Overwatch", "subreddit_id": "t5_2u5kl"}, {"author": "honjapiano", "body": "glad you liked it 😘", "created_utc": "1650813177.0", "edited": "False", "id": "i60bs8w", "is_submitter": "False", "link_id": "t3_uanmnx", "parent_id": "t1_i5zcttf", "score": "2", "subreddit": "Overwatch", "subreddit_id": "t5_2u5kl"}, {"author": "honjapiano", "body": "I haven’t but I’ll add it to my list!! i’ve heard disco elysium is good too, although i think it’s dubbed in english…", "created_utc": "1650777009.0", "edited": "False", "id": "i5yt8da", "is_submitter": "False", "link_id": "t3_u9ya5d", "parent_id": "t1_i5yqttr", "score": "2", "subreddit": "French", "subreddit_id": "t5_2rd5t"}, {"author": "honjapiano", "body": "right! although, if you have a DS i think the rest of the series has translations (don’t quote me on it tho). I have a feeling they’ll be porting Apollo Justice onto the switch at some point and i’m praying that they’ll have a French option again", "created_utc": "1650775401.0", "edited": "False", "id": "i5yqmhi", "is_submitter": "False", "link_id": "t3_u9ya5d", "parent_id": "t1_i5yqflw", "score": "2", "subreddit": "French", "subreddit_id": "t5_2rd5t"}, {"author": "honjapiano", "body": "I’m playing AA2 and i gotta say, i had a very similar experience with the first case. i liked the second case a lot more, but the third case (imo) was really boring (i think it’s bc it’s so long). but i love the plot, there was just too much fluff for me, so i just used a walk through to get all the tea but get through it quickly. i’m starting 2-4 right now and i’m enjoying it more.", "created_utc": "1650775171.0", "edited": "False", "id": "i5yq8r7", "is_submitter": "False", "link_id": "t3_uah0bn", "parent_id": "t3_uah0bn", "score": "3", "subreddit": "AceAttorney", "subreddit_id": "t5_2so0n"}, {"author": "honjapiano", "body": "For a second I thought your competitive points was your SR, but congrats!! I placed 1989 for support and fell like 300 SR right away, which scarred me, but this gives me hope. Maybe I'll try my hand at comp again.", "created_utc": "1650771322.0", "edited": "False", "id": "i5yjk05", "is_submitter": "False", "link_id": "t3_uaioak", "parent_id": "t3_uaioak", "score": "0", "subreddit": "Overwatch", "subreddit_id": "t5_2u5kl"}, {"author": "honjapiano", "body": "Less than 19 simply because I was in a French immersion program for a few years and then continued with French courses afterwards.\n\nBy my own choice, also under 19. In high school I tried my hand at Korean for two years and Japanese (enough to watch Ghibli without subs) but never got further than that.\n\nI only ended up getting somewhere (and sticking with) Spanish and Portuguese.", "created_utc": "1650771050.0", "edited": "False", "id": "i5yj286", "is_submitter": "False", "link_id": "t3_uai83a", "parent_id": "t3_uai83a", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "honjapiano", "body": "I don't really like drawing on-screen and I like the feel of my wacom more. I definitely prefer CSP on desktop to the tablet version.\n\nSince I save my files in .psd, I draw at home, and if I'm on the move, I send it to my iPad and continue on Procreate, then, when I'm done, I send it back to my computer if .psd and it's like I never left. It is a bit of a pain to find the exact same brushes but I can usually fudge it a bit.\n\nCSP is 100% a more powerful program- it's got a bunch more tools- but I prefer Procreate on the iPad. I would never change my CSP desktop version for anything else. I also prefer paying once — get it on sale and never pay again, versus paying monthly? No thanks, I'll take the minor dent in my wallet all at once.", "created_utc": "1650750698.0", "edited": "False", "id": "i5xdq7w", "is_submitter": "False", "link_id": "t3_uafbsj", "parent_id": "t3_uafbsj", "score": "2", "subreddit": "ClipStudio", "subreddit_id": "t5_3a4b5"}, {"author": "honjapiano", "body": "That’s not weird at all? I spend a lot of time with my dad, and I’m almost 20. I still hang around him and lean on him all the time. Hell, I’m pretty sure I napped on him while he watched hockey a week or two ago. \n\nI have a great relationship with him and I think it’s partially because we always had a relationship that was expressed through physical love. I got lots of hugs and kisses and still do.", "created_utc": "1650750203.0", "edited": "False", "id": "i5xcnna", "is_submitter": "False", "link_id": "t3_ua6688", "parent_id": "t3_ua6688", "score": "1", "subreddit": "NoStupidQuestions", "subreddit_id": "t5_2w844"}, {"author": "honjapiano", "body": "BOTW has a pretty good one. I think it even has a difference between Canadian and European French, which is cool.\n\nI know you said 'not only subs' BUT what if the game doesn't have any voice acting? If you're looking for listening practice, then maybe not. But if you're just looking for a game that doesn't clash French subs and English dubs:\n\nI played Ace Attorney in French, and it was pretty fun (especially with all the pun names!). Stardew valley is good. I also changed my switch language to French to get Animal Crossing, and pkm Sword.", "created_utc": "1650746025.0", "edited": "False", "id": "i5x3lnn", "is_submitter": "False", "link_id": "t3_u9ya5d", "parent_id": "t3_u9ya5d", "score": "3", "subreddit": "French", "subreddit_id": "t5_2rd5t"}, {"author": "honjapiano", "body": "I don't know anything about D'un monde à l'autre or La passe-miroir, so I won't comment on those, but I'd say that Harry Potter would be a great place to start if you're familiar with the story already. I find it really helpful to try to read and understand through context, so reading a story that I already know allows me to make educated guesses and not stop to translate every second word. With Harry Potter, though, there are a lot of made-up words (like the spells and Hogwarts houses), so I would google the list of made-up words and what they're translated to. A lot of them are silly puns, which are fun!\n\nLe petit prince can be a bit of a hard read depending on what you want to get out of it. If it's simply to read the story, then I've been told it uses fairly simple language. But I know that there's a lot of philosophical discourse around it that you might not be able to grasp in French. But, I've never read it, it's just what I've heard from friends who read it in French class.\n\nNot sure if this helps at all, but hopefully it does.", "created_utc": "1650745576.0", "edited": "False", "id": "i5x2las", "is_submitter": "False", "link_id": "t3_uadp57", "parent_id": "t3_uadp57", "score": "2", "subreddit": "French", "subreddit_id": "t5_2rd5t"}, {"author": "honjapiano", "body": "Maybe it's just my own learning style, but I don't find translating every word I don't know to be useful. I usually get the most out of reading from piecing everything together from the context (visual context helps a lot, so comics are good). \n\nI've done a lot of reading in French, and almost I never translate any words I don't know unless they're pivotal to understanding what's happening.\n\nI think the best way to go about it is to casually read. Don't put any pressure or force on making notes, just try to see how much you understand. If a word really bugged me, sometimes I would write a guess on a sticky note, then after reading I'd see if it was anywhere close.", "created_utc": "1650744758.0", "edited": "False", "id": "i5x0ric", "is_submitter": "False", "link_id": "t3_uaaj8v", "parent_id": "t3_uaaj8v", "score": "1", "subreddit": "French", "subreddit_id": "t5_2rd5t"}, {"author": "honjapiano", "body": "I don't necessarily need to like a character to like a book, but it's extremely hard for me to get immersed in a world if I hate the main character(s)... especially if I'm supposed to root for them. I think it usually boils down to how they're written (obv) and how they move the plot along.  \n\nHowever, I do agree that disliking a book because \"can't relate to\" the MC is really stupid. I absolutely can't relate to the murderous tendencies of the Darkling in S&B, but I adore him anyway.\n\nI really like \"unlikable\" characters, but I can't stand boring characters.", "created_utc": "1650744267.0", "edited": "False", "id": "i5wzp1s", "is_submitter": "False", "link_id": "t3_uabike", "parent_id": "t3_uabike", "score": "4", "subreddit": "books", "subreddit_id": "t5_2qh4i"}, {"author": "honjapiano", "body": "I wish they made the player-select screen the same as they did in the PvEs like Retribution. I always thought those looked so cool!", "created_utc": "1650676727.0", "edited": "False", "id": "i5tp1pu", "is_submitter": "False", "link_id": "t3_u9lfk8", "parent_id": "t3_u9lfk8", "score": "4", "subreddit": "Overwatch", "subreddit_id": "t5_2u5kl"}, {"author": "honjapiano", "body": "Honestly, brush it off. I’ve failed nearly every grammar exam I’ve had for French in my 10+ years of school, no matter how much I studied for it. I genuinely thought I was just really bad at French until a prof came up to me and told me she’d just pretend the exam didn’t happen because it didn’t reflect my capabilities in the language. \n\nTests don’t mean you’re not good at your language or that you’re not learning. They definitely aren’t a way that I can express my knowledge, so I make sure to nail the other assignments and show my profs what I know before I (unfortunately inevitably) fail my final exam heh. \n\nDon’t lose hope!", "created_utc": "1650413784.0", "edited": "False", "id": "i5f0kll", "is_submitter": "False", "link_id": "t3_u71eps", "parent_id": "t3_u71eps", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "honjapiano", "body": "Honestly, brush it off. I’ve failed nearly every grammar exam I’ve had for French in my 10+ years of school, no matter how much I studied for it. I genuinely thought I was just really bad at French until a prof came up to me and told me she’d just pretend the exam didn’t happen because it didn’t reflect my capabilities in the language. \n\nTests don’t mean you’re not good at your language or that you’re not learning. They definitely aren’t a way that I can express my knowledge, so I make sure to nail the other assignments and show my profs what I know before I (unfortunately inevitably) fail my final exam heh. \n\nDon’t lose hope!", "created_utc": "1650413775.0", "edited": "False", "id": "i5f0js5", "is_submitter": "False", "link_id": "t3_u71eps", "parent_id": "t3_u71eps", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "honjapiano", "body": "i found a DS cartridge of it on eBay for like $20 CAD. that’s how i played it, anyway.", "created_utc": "1650303778.0", "edited": "False", "id": "i58g7d4", "is_submitter": "False", "link_id": "t3_u5ruyf", "parent_id": "t3_u5ruyf", "score": "1", "subreddit": "AceAttorney", "subreddit_id": "t5_2so0n"}, {"author": "honjapiano", "body": "i like the both of them a lot but i don’t have the patience for danganronpa. they repeat useless things a million times more than in AA, but the story is really good. if you have the patience, then i 100% think you’d enjoy it — i didn’t have the patience and ended up watching the game grumps play through instead and i’m loving it!", "created_utc": "1650303575.0", "edited": "False", "id": "i58fp66", "is_submitter": "False", "link_id": "t3_u623nz", "parent_id": "t3_u623nz", "score": "1", "subreddit": "AceAttorney", "subreddit_id": "t5_2so0n"}, {"author": "honjapiano", "body": "1. i help my opponents get their beauty rest\n2. somersault master \n\nbonus for when i feel bold: furry con attendee", "created_utc": "1650242018.0", "edited": "False", "id": "i55elkx", "is_submitter": "False", "link_id": "t3_u5ver2", "parent_id": "t3_u5ver2", "score": "1", "subreddit": "Overwatch", "subreddit_id": "t5_2u5kl"}, {"author": "honjapiano", "body": "Some of that does sound familiar. I definitely am a bit conservative with my antinades, so I'll try to be more agressive with it, thanks!\n\nI'm not really sure how to fix positioning, tho. I mostly just go for where I can see my tanks/dps.", "created_utc": "1650210259.0", "edited": "False", "id": "i53d1ye", "is_submitter": "True", "link_id": "t3_u5b9em", "parent_id": "t1_i50yr6m", "score": "1", "subreddit": "OverwatchUniversity", "subreddit_id": "t5_3ejpe"}, {"author": "honjapiano", "body": "well, damn does that make me feel better! thanks", "created_utc": "1650144952.0", "edited": "False", "id": "i5086wy", "is_submitter": "True", "link_id": "t3_u4oxos", "parent_id": "t1_i507btm", "score": "2", "subreddit": "OverwatchUniversity", "subreddit_id": "t5_3ejpe"}, {"author": "honjapiano", "body": "ouff i’ve had far too many of those. i played tracer in the archive event and got a 6k with my ult, one of the 6 being me…", "created_utc": "1650140474.0", "edited": "False", "id": "i4zy7f7", "is_submitter": "True", "link_id": "t3_u4oxos", "parent_id": "t1_i4xkfad", "score": "2", "subreddit": "OverwatchUniversity", "subreddit_id": "t5_3ejpe"}, {"author": "honjapiano", "body": "dw, man, it actually was funny! i’m 1900 after the support placement, i’m pretty sure i’d fall a good 300 if i played comp again heh", "created_utc": "1650135661.0", "edited": "False", "id": "i4znnij", "is_submitter": "True", "link_id": "t3_u4oxos", "parent_id": "t1_i4yyinz", "score": "1", "subreddit": "OverwatchUniversity", "subreddit_id": "t5_3ejpe"}, {"author": "honjapiano", "body": "i had to play torb (a hero i never touched) during one of the archive events and somehow got potg, but it was just my turret doing everything while i tried to shoot people with my hammer thinking it was the gun", "created_utc": "1650124754.0", "edited": "False", "id": "i4yybd0", "is_submitter": "True", "link_id": "t3_u4oxos", "parent_id": "t1_i4x0akh", "score": "8", "subreddit": "OverwatchUniversity", "subreddit_id": "t5_3ejpe"}, {"author": "honjapiano", "body": "I prefer Anubis to Volskaya or Lunar. I like Hanamura tho 👀", "created_utc": "1649969223.0", "edited": "False", "id": "i4qytmf", "is_submitter": "False", "link_id": "t3_u379qr", "parent_id": "t3_u379qr", "score": "1", "subreddit": "Overwatch", "subreddit_id": "t5_2u5kl"}, {"author": "honjapiano", "body": "I'd suggest Mythos by Stephen Frye. He goes through a lot of the basic and popular stories and explains them pretty well from what I've heard.\n\nFrom what I know, there isn't one single book that goes over the entire mythology, but I'd recommend reading the Iliad and the Odyssey if you want some old stories. Even the Oresteia by Aeschylus.\n\nFor Roman mythology (almost the same, they just have different names) I'd suggest the Metamorphoses by Ovid — it has *a bunch* of tales and they go somewhat in order. \n\nOtherwise, definitely check out Percy Jackson or the Song of Achilles. PJO isn't known for being 100% accurate, but if you're interested in those dynamics, it's a good easy read.", "created_utc": "1649796624.0", "edited": "False", "id": "i4h93gu", "is_submitter": "False", "link_id": "t3_u22v84", "parent_id": "t3_u22v84", "score": "1", "subreddit": "suggestmeabook", "subreddit_id": "t5_31t41"}, {"author": "honjapiano", "body": "For reference, I've taken piano lessons for 10 years. I think I pay my teacher $65/hr  (CAD) once a week for intermediate/advanced classical lessons. My first teacher was $50/hr (CAD), I think?\n\nI think having a teacher at the beginning is really important. I was a bit lazy with that, and I ended up missing *a lot* of really important foundational things — eight years in, I was told that I wasn't pressing the keys right!\n\nBeing able to learn the foundations (as simple as they seem) right from the beginning is important because, speaking from experience, going back ten years later to fix it is *not fun.* \n\nAs for finding online lessons, I'm lucky to have been introduced personally to my teachers, but there's tons of relatively cheap lessons (I've seen as low as $30 CAD) if you look. If they're strictly online, you might even be able to find a teacher outside your country whose rates are better suited to you. Try checking out local music stores, sometimes they have flyers.\n\nWith regard to money: paying the higher-end isn't necessary at the beginning, imo. There's a lot of fantastic teachers who are in the middle-ground. If money really is an issue, I'd suggest seeing if they offer half-hour lessons instead. For the first four or five years, I took half-hour lessons at $25/half-hour, and it worked out for me. You get more done in an hour (obviously), but it might be a more viable option until you, 1) have less of a financial burden, and 2) know you want to continue lessons.\n\nHopefully this comment helped a little bit, but either way, good luck finding something!", "created_utc": "1649730788.0", "edited": "False", "id": "i4dm3xv", "is_submitter": "False", "link_id": "t3_u1mi9f", "parent_id": "t3_u1mi9f", "score": "3", "subreddit": "piano", "subreddit_id": "t5_2qnw8"}, {"author": "honjapiano", "body": "I'm not translating in my head, but sometimes I use other languages to infer an unknown/new word, since they're all romance languages. But I do tend to think in Spanish when I'm put on the spot to speak French, which I think is funny considering I've spoken French for most of my life and only recently started Spanish.", "created_utc": "1649728619.0", "edited": "False", "id": "i4dh7sg", "is_submitter": "False", "link_id": "t3_u0yo6o", "parent_id": "t3_u0yo6o", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "honjapiano", "body": "100% The Murder of Roger Ackroyd by Agatha Christie\n\nMurder on the Orient Express is also great.", "created_utc": "1649543550.0", "edited": "False", "id": "i43arhd", "is_submitter": "False", "link_id": "t3_tzwz5h", "parent_id": "t3_tzwz5h", "score": "2", "subreddit": "suggestmeabook", "subreddit_id": "t5_31t41"}, {"author": "honjapiano", "body": "playing with joy-con drift and the switch’s gyro function is nasty and looks exactly like this, so i feel the pain. i always try to sneak onto my sibling’s pc when i can…", "created_utc": "1649541331.0", "edited": "False", "id": "i435sfk", "is_submitter": "False", "link_id": "t3_tzydoh", "parent_id": "t3_tzydoh", "score": "2", "subreddit": "Overwatch", "subreddit_id": "t5_2u5kl"}, {"author": "honjapiano", "body": "Depends on what you consider “learning”. I’m doing a bilingual French degree at uni, but not actually /learning/ French. I’m not actively learning Portuguese, but my family speaks it so I understand it,,, I’m just a bit shy in speaking. For Spanish, I do a little bit of Duolingo every day (I know enough to understand my friend’s mom heh), but no real classes.\n\nAs for Italian…. I’ve gotten as far as singing e più ti penso and that’s it.\n\nSo basically, I’m both learning and not learning three of them.", "created_utc": "1649541040.0", "edited": "False", "id": "i4354l3", "is_submitter": "False", "link_id": "t3_tzvu5o", "parent_id": "t3_tzvu5o", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "honjapiano", "body": "i watch most shows/youtube videos in 2x speed because they just take so long to talk. i think i talk faster than most people, so when people are enunciating every syllable, it grates on my nerves. \n\nas long as you can read quickly, i don’t see the problem 😅", "created_utc": "1649130291.0", "edited": "False", "id": "i3g3w5m", "is_submitter": "False", "link_id": "t3_twdlyw", "parent_id": "t3_twdlyw", "score": "1", "subreddit": "anime", "subreddit_id": "t5_2qh22"}, {"author": "honjapiano", "body": "no problem!", "created_utc": "1649041401.0", "edited": "False", "id": "i3b1srf", "is_submitter": "False", "link_id": "t3_tvp23n", "parent_id": "t1_i3b1cqs", "score": "1", "subreddit": "ClipStudio", "subreddit_id": "t5_3a4b5"}, {"author": "honjapiano", "body": "i can’t read kanji but your best bet is to try to copy it by hand/handwrite it into google translate and then take the characters and search it. \n\ni think it’s this one: https://assets.clip-studio.com/ja-jp/detail?id=1598927", "created_utc": "1649040828.0", "edited": "False", "id": "i3b0m4a", "is_submitter": "False", "link_id": "t3_tvp23n", "parent_id": "t3_tvp23n", "score": "4", "subreddit": "ClipStudio", "subreddit_id": "t5_3a4b5"}, {"author": "honjapiano", "body": "dense watercolour 😩 it just looks so good for sketches", "created_utc": "1649017589.0", "edited": "False", "id": "i39la9x", "is_submitter": "False", "link_id": "t3_tv9h2m", "parent_id": "t3_tv9h2m", "score": "2", "subreddit": "ClipStudio", "subreddit_id": "t5_3a4b5"}, {"author": "honjapiano", "body": "also! try updating your driver or just having it open when you draw. sometimes i just have to have the Wacom Driver app open and it fixes", "created_utc": "1649017260.0", "edited": "False", "id": "i39khz3", "is_submitter": "False", "link_id": "t3_tuo66t", "parent_id": "t1_i35i06u", "score": "1", "subreddit": "ClipStudio", "subreddit_id": "t5_3a4b5"}, {"author": "honjapiano", "body": "I get this often on my MacBook (early 2015). Usually, I have to do is restart the programs, and it fixes itself — sometimes I restart my computer, and it works then.   \n\n\nIt's super annoying, so I feel your pain. I have no idea why it happens. I typically try to have as few programs running (no Chrome or anything) and sometimes that helps prevent it.", "created_utc": "1648934356.0", "edited": "False", "id": "i35i06u", "is_submitter": "False", "link_id": "t3_tuo66t", "parent_id": "t3_tuo66t", "score": "1", "subreddit": "ClipStudio", "subreddit_id": "t5_3a4b5"}, {"author": "honjapiano", "body": "cool, i’ll check it out, thanks!", "created_utc": "1648927450.0", "edited": "False", "id": "i353j0i", "is_submitter": "False", "link_id": "t3_ttc8i1", "parent_id": "t1_i2xiloy", "score": "1", "subreddit": "animation", "subreddit_id": "t5_2qlmp"}, {"author": "honjapiano", "body": "Selene, after the goddess of the moon and a SHINee song", "created_utc": "1648767059.0", "edited": "False", "id": "i2wt5xv", "is_submitter": "False", "link_id": "t3_tt6taj", "parent_id": "t3_tt6taj", "score": "3", "subreddit": "AnimalCrossing", "subreddit_id": "t5_2ro2c"}, {"author": "honjapiano", "body": "i’ll watch out for that, thanks!", "created_utc": "1648437006.0", "edited": "False", "id": "i2e6umi", "is_submitter": "False", "link_id": "t3_tpsio4", "parent_id": "t1_i2dsjg9", "score": "1", "subreddit": "GoodNotes", "subreddit_id": "t5_3c93e"}, {"author": "honjapiano", "body": "no worries! it’s for an international studies course that i’m taking. we learned a bit about the history and development of states as well as neoliberalism and some other stuff", "created_utc": "1648436949.0", "edited": "False", "id": "i2e6qry", "is_submitter": "False", "link_id": "t3_tpsio4", "parent_id": "t1_i2e0uqv", "score": "3", "subreddit": "GoodNotes", "subreddit_id": "t5_3c93e"}, {"author": "honjapiano", "body": "it has been a year since i replaced the pen and ipad, but the issue didn’t happen again until more recently. i’ll definitely try re-inserting the tip, thanks!", "created_utc": "1648419773.0", "edited": "False", "id": "i2d7s03", "is_submitter": "False", "link_id": "t3_tpsio4", "parent_id": "t1_i2d6ssu", "score": "1", "subreddit": "GoodNotes", "subreddit_id": "t5_3c93e"}, {"author": "honjapiano", "body": "i use an Apple Pencil (gen 2) on my ipad and i get this a lot. I replaced by apple pencil AND the ipad through apple care and it still happens? it can’t just be me, right?", "created_utc": "1648413241.0", "edited": "False", "id": "i2ctzv3", "is_submitter": "False", "link_id": "t3_tpsio4", "parent_id": "t3_tpsio4", "score": "4", "subreddit": "GoodNotes", "subreddit_id": "t5_3c93e"}, {"author": "honjapiano", "body": "I went from FF.net to Wattpad to AO3 and haven’t looked back. wattpad, from what i remember, is full of writers who don’t speak english as their first language and is full of mistakes. i find a lot more quality writing on AO3, and i prefer it to FF.net because that website’s hardly up to date anymore.", "created_utc": "1648136122.0", "edited": "False", "id": "i1xxfa5", "is_submitter": "False", "link_id": "t3_tl4k8w", "parent_id": "t3_tl4k8w", "score": "1", "subreddit": "FanFiction", "subreddit_id": "t5_2r5kb"}, {"author": "honjapiano", "body": "I see comments like these all the time and it makes me feel very weird. My entire life, I’ve never been approached by anyone ever in public, let alone spoken to or asked to do something. Even in a city with over 3 million people. I’m glad not to be harassed but it definitely feels odd.\n\nIs it really that common?", "created_utc": "1647906845.0", "edited": "False", "id": "i1lja6l", "is_submitter": "False", "link_id": "t3_tjm2kx", "parent_id": "t1_i1lfom0", "score": "66", "subreddit": "NoStupidQuestions", "subreddit_id": "t5_2w844"}, {"author": "honjapiano", "body": "i choose not to question other plays at this point. under pressure i’ve made some wack decisions 💀", "created_utc": "1647830440.0", "edited": "False", "id": "i1hg3l5", "is_submitter": "True", "link_id": "t3_tiuni2", "parent_id": "t1_i1h1x7b", "score": "3", "subreddit": "Overwatch", "subreddit_id": "t5_2u5kl"}, {"author": "honjapiano", "body": "A DVA who got a 4k… not sure why that got it over mine, but I’m sure there was a reason", "created_utc": "1647812797.0", "edited": "False", "id": "i1ge0gh", "is_submitter": "True", "link_id": "t3_tiuni2", "parent_id": "t1_i1g7351", "score": "6", "subreddit": "Overwatch", "subreddit_id": "t5_2u5kl"}, {"author": "honjapiano", "body": "I loved the picture of dorian grey because it’s INSANE. the entire plot is a whirlwind and everyone is so dramatic", "created_utc": "1647788918.0", "edited": "False", "id": "i1esnic", "is_submitter": "False", "link_id": "t3_ti1ths", "parent_id": "t3_ti1ths", "score": "2", "subreddit": "suggestmeabook", "subreddit_id": "t5_31t41"}, {"author": "honjapiano", "body": "If i’m 100% honest, there isn’t much. I’m an intermediate-advanced french speaker and beginner at spanish and portuguese. what i found worked for me was, if i want to speak/study spanish, i only allow myself to be immersed in spanish media/lessons/music for that period of time. i watch youtube or just do duolingo in spanish for the hour or so. then if i need french later, i do the same thing. \n\nafter a while, i got used to having those two languages separated that i don’t mix them up as much anymore. i do pull from them often to help make inferences for words i don’t know, but they’re not as intrusive. \n\nit was really hard at the beginning tho, and when i get nervous, it gets a bit worse lol", "created_utc": "1646584371.0", "edited": "False", "id": "hzlamdb", "is_submitter": "False", "link_id": "t3_t7wrx0", "parent_id": "t3_t7wrx0", "score": "3", "subreddit": "French", "subreddit_id": "t5_2rd5t"}, {"author": "honjapiano", "body": "I’ve been studying French for 13 years in school, I slowly study Euro Portuguese, and I’ve recently picked up Spanish (Mexican)", "created_utc": "1646540696.0", "edited": "False", "id": "hzje87c", "is_submitter": "False", "link_id": "t3_t78s8t", "parent_id": "t3_t78s8t", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "honjapiano", "body": "I'm pretty much only funny in English (N) because I'm far too conscious about what I'm saying to be cracking jokes. I'm mediocre in French since it 100% has to be conversation driven and I lose all my wit.", "created_utc": "1645653451.0", "edited": "False", "id": "hy5nn9g", "is_submitter": "False", "link_id": "t3_szhk8d", "parent_id": "t3_szhk8d", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "honjapiano", "body": "i'm always made fun of when i try to speak portuguese. it's my family's language but i was never taught by them so i went out of my way to take a class in high school.\n\ni learned enough to understand pretty much all the conversations around me, but i had trouble speaking, so when i went to visit my family in portugal, i thought it was the perfect chance to practice, except i was made fun of the entire time. i knew that my accent was gonna be wonky because my parents are from places with different dialects, and i speak french, so everything has a bit of a francophone tone to it. my family joked around but we have that sort of relationship and we all do it to each other, so that was okay, but what really got me was that the locals would laugh and just immediately ask me to stop trying and just speak english.\n\nto say the least, i haven't felt comfortable speaking portuguese since.", "created_utc": "1645402710.0", "edited": "False", "id": "hxrqqul", "is_submitter": "False", "link_id": "t3_sx0lkr", "parent_id": "t3_sx0lkr", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "honjapiano", "body": "Learning Italian and Spanish at the same time can be challenging since they're so similar, but it's also a really useful tool for understanding unknown words and inferencing what certain things mean.\n\nI'd say, if you're not having a lot of trouble with Italian (or just romance languages in general) then go for it! You might pick Spanish up quickly if you get to use it irl.", "created_utc": "1644345448.0", "edited": "False", "id": "hw460av", "is_submitter": "False", "link_id": "t3_snpaly", "parent_id": "t3_snpaly", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "honjapiano", "body": "The first one that comes to mind is ambulance in German, krankenwagen, and madrugada (Portuguese) which means dawn\n\nA funny one that always makes me laugh is that chopsticks are \"baguettes chinoises\" in french", "created_utc": "1644345045.0", "edited": "False", "id": "hw44vum", "is_submitter": "False", "link_id": "t3_snpwg0", "parent_id": "t3_snpwg0", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "honjapiano", "body": "I would like to preface this by saying that I'm not a parent, but I did go to school in a bilingual environment and have parents who speak different languages at home. Sorry this is so long.\n\nI'd say the most important thing is to ask which language your kid has more interest in. Being shoved in a class for a language you don't even really want to learn can kinda suck. But if they don't have a preference, I would suggest German because you have some background in it.\n\nMy parents put me in a French school when I was young, but they didn't speak a lick of the language, so when I was struggling in math (specifically word problems), there was no one to help, and it was really discouraging. Most of the kids in my classes were picking up the language no problem because they either had tutors or parents who could help, but I didn't. According to my parents, I \"shut down\", and left the program entirely. I ended up picking French up again, and now I'm at university for it.\n\nI took a Portuguese course in high school and had a much better experience learning because I could get help from my parents/family. I also felt more motivation to learn it because I would actually have some use for it outside of school.\n\nYou say the activities don't have grades and are low-pressure, so maybe your kid(s) won't have an experience like mine, but I would always suggest a language that you can help with... but maybe I'm projecting haha\n\nAlso, a little note about Mandarin: unless they're teaching Pinyin, the Mandarin script can be a real challenge — I have Chinese friends who won't even bother learning it, despite being fluent in speaking Mandarin — so you might end up learning a bit of Chinese if your kid ever needs help.", "created_utc": "1644343714.0", "edited": "False", "id": "hw415qh", "is_submitter": "False", "link_id": "t3_snnwgx", "parent_id": "t3_snnwgx", "score": "7", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "honjapiano", "body": "i definitely find console players to be more pissy and just dip asap when a match goes south. i play on console (switch) because i don’t have a pc, but i play on my brother’s pc and i found it way less stressful. \n\ni’ve been dropped into half-done qp matches more often than full ones at this point and it kinda sucks. \n\nplus, there’s hardly any conversing on console save for hellos and some other VLs, so when someone does go through the work of typing, it’s usually an insult that’s obviously from a child.", "created_utc": "1642366431.0", "edited": "False", "id": "hsy58pm", "is_submitter": "False", "link_id": "t3_s52twv", "parent_id": "t3_s52twv", "score": "2", "subreddit": "OverwatchUniversity", "subreddit_id": "t5_3ejpe"}, {"author": "honjapiano", "body": "The Odyssey by Homer and The Oresteia by Aeschylus are one of my favourites. I read them for a Greco-Roman literature course last year and absolutely fell in love with them.", "created_utc": "1642353430.0", "edited": "False", "id": "hsx6n08", "is_submitter": "False", "link_id": "t3_s4yvea", "parent_id": "t3_s4yvea", "score": "1", "subreddit": "suggestmeabook", "subreddit_id": "t5_31t41"}, {"author": "honjapiano", "body": "thanks for the reply! you’re right, maybe i should let myself go out of my comfort zone a bit. i’ll definitely try out the more offensive healers (and check out those content creators too. thanks!", "created_utc": "1642314385.0", "edited": "False", "id": "hsvdre4", "is_submitter": "False", "link_id": "t3_s49sbu", "parent_id": "t1_hsta148", "score": "1", "subreddit": "OverwatchUniversity", "subreddit_id": "t5_3ejpe"}, {"author": "honjapiano", "body": "nice to hear from someone who came from a similar position as me. thanks for the advice!😊", "created_utc": "1642314192.0", "edited": "False", "id": "hsvdgo7", "is_submitter": "False", "link_id": "t3_s49sbu", "parent_id": "t1_hsqrimw", "score": "2", "subreddit": "OverwatchUniversity", "subreddit_id": "t5_3ejpe"}, {"author": "honjapiano", "body": "Cool! I’ll try to be more perceptive of that, thanks!", "created_utc": "1642314111.0", "edited": "False", "id": "hsvdc0t", "is_submitter": "False", "link_id": "t3_s49sbu", "parent_id": "t1_hsqiy83", "score": "1", "subreddit": "OverwatchUniversity", "subreddit_id": "t5_3ejpe"}, {"author": "honjapiano", "body": "huh, i hadn’t thought of changing my support role, i’ll try that too. thanks for the reply!", "created_utc": "1642221031.0", "edited": "False", "id": "hsq4sdn", "is_submitter": "False", "link_id": "t3_s49sbu", "parent_id": "t1_hsps0f6", "score": "1", "subreddit": "OverwatchUniversity", "subreddit_id": "t5_3ejpe"}, {"author": "honjapiano", "body": "i adore the look of japanese, as cliche as that is. i also think arabic and ancient greek look cool as hell", "created_utc": "1641079383.0", "edited": "False", "id": "hqv5ou0", "is_submitter": "False", "link_id": "t3_rtpgfu", "parent_id": "t3_rtpgfu", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "honjapiano", "body": "i’d say it’s good for comprehension. after three months of japanese, passing 1.5 checkpoints, i understood most of a studio ghibli movie, but i definitely wouldn’t be able to converse with someone. \n\ni think it can be quite useful, but i wouldn’t use it as a sole source of studying unless you’re busy. \n\nim in uni right now and don’t have the time to take on a full curriculum, so i do a bit of spanish duolingo and it’s good enough for me. one down-side is that it doesn’t actually /teach/ grammar, which can be kinda frustrating, but i think it’s also sometimes good because it forces you to recognize patterns yourself", "created_utc": "1641070872.0", "edited": "False", "id": "hquljti", "is_submitter": "False", "link_id": "t3_rtnco0", "parent_id": "t3_rtnco0", "score": "4", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "honjapiano", "body": "Yes! I love this idea! I change a lot of my video games into other languages but having a video game with the purpose of learning a new language would be cool (maybe I'd finally be able to speak Spanish hah)", "created_utc": "1640815882.0", "edited": "False", "id": "hqgt3s5", "is_submitter": "False", "link_id": "t3_rql4pc", "parent_id": "t3_rql4pc", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "honjapiano", "body": "the first time i got passed any of the bosses was with the bow, and i have to say its my favourite, but i also got the aim upgrade (can't remember what its called) asap, which helped a lot. \n\ni'm also a bit of a chicken, so i end up leaning toward long-range combat instead.", "created_utc": "1640814963.0", "edited": "False", "id": "hqgqrjn", "is_submitter": "False", "link_id": "t3_rr6qg6", "parent_id": "t3_rr6qg6", "score": "1", "subreddit": "HadesTheGame", "subreddit_id": "t5_sfted"}, {"author": "honjapiano", "body": "i totally forgot about that! thanks for reminding me (i knew i was missing something major)", "created_utc": "1639454877.0", "edited": "False", "id": "hogy1b7", "is_submitter": "False", "link_id": "t3_rfykke", "parent_id": "t1_hogxbov", "score": "2", "subreddit": "zelda", "subreddit_id": "t5_2r61g"}, {"author": "honjapiano", "body": "For the most part, no. I've read up on it (thanks to a project at school) and there aren't really any negatives unless you make them yourself. It can be stressful and you can put so much pressure that it isn't fun anymore, so I'd say that's the biggest pitfall (especially when there are so many polyglots online who are learning 8 languages at once and you're struggling with one lol).", "created_utc": "1639416165.0", "edited": "False", "id": "hoegj6i", "is_submitter": "False", "link_id": "t3_rfilfc", "parent_id": "t3_rfilfc", "score": "5", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "honjapiano", "body": "my piano tuner had /just/ left and i got excited to play, so i just pulled it down", "created_utc": "1637154425.0", "edited": "False", "id": "hkzek1s", "is_submitter": "False", "link_id": "t3_qvclop", "parent_id": "t1_hkxum7a", "score": "2", "subreddit": "piano", "subreddit_id": "t5_2qnw8"}, {"author": "honjapiano", "body": "ultimately it depends on the weather in your area. in my area of canada, it gets super humid in the summer, dry in the fall, freezing in the winter, and wet in the spring, so i tune once per season. \n\nusually, if you live in a climate with both winter and summer, people recommend tuning when the heat comes on in the winter, and when the AC comes on in the summer", "created_utc": "1637109614.0", "edited": "False", "id": "hkxclc0", "is_submitter": "False", "link_id": "t3_qvclop", "parent_id": "t1_hkxbfqr", "score": "1", "subreddit": "piano", "subreddit_id": "t5_2qnw8"}, {"author": "honjapiano", "body": "RE: [This Video](https://www.reddit.com/r/piano/comments/q8w47e/advice_for_trills_this_is_one_of_my_better_runs/?utm_source=share&utm_medium=ios_app&utm_name=iossmf)\n\nI got my piano tuned this morning, and since my last post got a bunch of “TUNE YOUR PIANO” comments, I thought I’d give an update that is better for all of you who have fine ears. Apologies for my flub at the end, the runs make me panic and I haven’t gotten them down yet lol", "created_utc": "1637082844.0", "edited": "False", "id": "hkviaoy", "is_submitter": "False", "link_id": "t3_qvclop", "parent_id": "t3_qvclop", "score": "5", "subreddit": "piano", "subreddit_id": "t5_2qnw8"}, {"author": "honjapiano", "body": "isn’t it a song since it has lyrics? at least… i think the original ode to joy had lyrics", "created_utc": "1635520973.0", "edited": "False", "id": "hiitt7b", "is_submitter": "False", "link_id": "t3_qhtfr1", "parent_id": "t1_hihj162", "score": "6", "subreddit": "piano", "subreddit_id": "t5_2qnw8"}, {"author": "honjapiano", "body": "As cliché as it is, I’m learning Japanese and Korean with the intent of watching tv, reading and listening to music without translations. I don’t have any way to communicate with anyone in those languages irl so speaking (verbally) isn’t the top of my list. I find that I end up practicing a bit and I do want to be able to express myself at an elementary level if need be, but it’s not one of my goals as of now.", "created_utc": "1634444027.0", "edited": "False", "id": "hgy2vki", "is_submitter": "False", "link_id": "t3_q9jff3", "parent_id": "t3_q9jff3", "score": "18", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "honjapiano", "body": "I find Korean to be much harder to learn once you get past learning the alphabet. I’ve studied on and off for about three years (i’m at the beginning of TTMIK5 if that means anything) and I still find it much harder to remember than Japanese. \n\nI’ve only recently started Japanese, but even within these past two-ish months, I understand much more of Japanese media (namely children’s anime like Ghibli) than Korean — not for a lack of trying, as I’ve definitely had more intake of Korean media in the past few years than Japanese. I don’t really have any reason why… I just find it very hard to remember all the particles and when to use each one. I find Japanese grammar to be much more straight forward (although Kanji do be a rough time and I still have trouble with half the katakana alphabet…)\n\nOufff and don’t get me started on the ridiculousness of Korean pronunciation compared to Japanese ㅠㅠ", "created_utc": "1634440500.0", "edited": "False", "id": "hgxwby6", "is_submitter": "False", "link_id": "t3_q9m10b", "parent_id": "t3_q9m10b", "score": "16", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "honjapiano", "body": "seems like you’ve taken a look into my brain with that internal dialogue — that’s definitely something that crosses my mind when i play them! thanks for the advice!", "created_utc": "1634418737.0", "edited": "False", "id": "hgwmip6", "is_submitter": "True", "link_id": "t3_q8w47e", "parent_id": "t1_hgu7u7i", "score": "2", "subreddit": "piano", "subreddit_id": "t5_2qnw8"}, {"author": "honjapiano", "body": "trust me, i know how painful it is to hear it, but i gotta wait till the winter to tune it again so i’m stuck with this :/", "created_utc": "1634418680.0", "edited": "False", "id": "hgwme2i", "is_submitter": "True", "link_id": "t3_q8w47e", "parent_id": "t1_hgu2pya", "score": "1", "subreddit": "piano", "subreddit_id": "t5_2qnw8"}, {"author": "honjapiano", "body": "omg i always struggled learning beethoven (still do after 10 years oml), but it’s so worth powering through! especially a piece like für elise", "created_utc": "1634418628.0", "edited": "False", "id": "hgwm9xb", "is_submitter": "True", "link_id": "t3_q8w47e", "parent_id": "t1_hgtw9e8", "score": "1", "subreddit": "piano", "subreddit_id": "t5_2qnw8"}, {"author": "honjapiano", "body": "to be honest, i have no idea. i’ve always played super stiffly (to the point where i would hold my breath) so i think i’m just overcompensating to make sure that my shoulders don’t tighten (especially since it’s not a fast moving piece)", "created_utc": "1634418555.0", "edited": "False", "id": "hgwm42h", "is_submitter": "True", "link_id": "t3_q8w47e", "parent_id": "t1_hguer4o", "score": "2", "subreddit": "piano", "subreddit_id": "t5_2qnw8"}, {"author": "honjapiano", "body": "The humidity and heat changes the tubing of the piano, especially when the furnace or AC is suddenly turned on. So, if i were to tune it now, I’d have to re-tune it as soon as it hits mid-November anyway", "created_utc": "1634407162.0", "edited": "False", "id": "hgvvo5c", "is_submitter": "True", "link_id": "t3_q8w47e", "parent_id": "t1_hgvhexc", "score": "1", "subreddit": "piano", "subreddit_id": "t5_2qnw8"}, {"author": "honjapiano", "body": "It’s Chopin’s Nocturne in c# minor (sometimes called Nocturne Op Posth)", "created_utc": "1634407093.0", "edited": "False", "id": "hgvvil5", "is_submitter": "True", "link_id": "t3_q8w47e", "parent_id": "t1_hgvfk8x", "score": "1", "subreddit": "piano", "subreddit_id": "t5_2qnw8"}, {"author": "honjapiano", "body": "Nocturne in c# major by Chopin (aka Nocturne Op Posth)", "created_utc": "1634407050.0", "edited": "False", "id": "hgvvf5x", "is_submitter": "True", "link_id": "t3_q8w47e", "parent_id": "t1_hgvjgyy", "score": "2", "subreddit": "piano", "subreddit_id": "t5_2qnw8"}, {"author": "honjapiano", "body": "My piano’s awfully out of tune — gotta wait for the furnace to turn on so I can tune it so i’m stuck with this :/", "created_utc": "1634398999.0", "edited": "False", "id": "hgvcuq4", "is_submitter": "True", "link_id": "t3_q8w47e", "parent_id": "t1_hgvaflg", "score": "1", "subreddit": "piano", "subreddit_id": "t5_2qnw8"}, {"author": "honjapiano", "body": "Nocturne in c# minor by chopin (aka Nocturne Op Posth)", "created_utc": "1634398847.0", "edited": "False", "id": "hgvchyu", "is_submitter": "True", "link_id": "t3_q8w47e", "parent_id": "t1_hgvb25i", "score": "1", "subreddit": "piano", "subreddit_id": "t5_2qnw8"}, {"author": "honjapiano", "body": "I didn't even notice that I moved my arms like that until I watched the video back! Definitely seems a bit much lol. I also never noticed that I don't move my arms when doing the trills (maybe I'm too tense). Eitherway, thanks for the reply!", "created_utc": "1634351622.0", "edited": "False", "id": "hgtefgt", "is_submitter": "True", "link_id": "t3_q8w47e", "parent_id": "t1_hgt553b", "score": "4", "subreddit": "piano", "subreddit_id": "t5_2qnw8"}, {"author": "honjapiano", "body": "Thanks for the advice! That left hand one sounds a bit odd, but my left hand is a bit weak anyway, so maybe it'll benefit me in two ways :)", "created_utc": "1634351520.0", "edited": "False", "id": "hgte8n7", "is_submitter": "True", "link_id": "t3_q8w47e", "parent_id": "t1_hgt553e", "score": "1", "subreddit": "piano", "subreddit_id": "t5_2qnw8"}, {"author": "honjapiano", "body": "i got a couple comments about the tuning of my piano and yes i know it's awful (it hurts my fine ear)! i've been bugging my parents for a while to get it tuned, but because i live in canada, i have to wait another couple weeks before getting it tuned (no point in fixing it now when i'd have to get it done again once the furnace comes on lol)", "created_utc": "1634345005.0", "edited": "False", "id": "hgt26g1", "is_submitter": "True", "link_id": "t3_q8w47e", "parent_id": "t3_q8w47e", "score": "5", "subreddit": "piano", "subreddit_id": "t5_2qnw8"}, {"author": "honjapiano", "body": "That's a really interesting perspective, i'll totally give that a try! Thanks!", "created_utc": "1634344770.0", "edited": "False", "id": "hgt1qdw", "is_submitter": "True", "link_id": "t3_q8w47e", "parent_id": "t1_hgskyw7", "score": "9", "subreddit": "piano", "subreddit_id": "t5_2qnw8"}, {"author": "honjapiano", "body": "Thank you!! \n\nAhhh prelude 15, I've struggled through that too (I tried learning it way too early for what skill I had at the time). It's awesome that you returned to playing after such a long break! I've always worried that I'd never continue studying if I ever quit.", "created_utc": "1634344714.0", "edited": "False", "id": "hgt1mgj", "is_submitter": "True", "link_id": "t3_q8w47e", "parent_id": "t1_hgsjkep", "score": "4", "subreddit": "piano", "subreddit_id": "t5_2qnw8"}, {"author": "honjapiano", "body": "Thanks for the advice (and the youtube link)! Also, yes, I've been bugging my parents for *weeks* to get it tuned but I have to wait for the furnace to turn on for the winter ㅠ.ㅠ the struggles", "created_utc": "1634331007.0", "edited": "False", "id": "hgs9h3p", "is_submitter": "True", "link_id": "t3_q8w47e", "parent_id": "t1_hgs63cn", "score": "2", "subreddit": "piano", "subreddit_id": "t5_2qnw8"}, {"author": "honjapiano", "body": "I keep bugging my dad to call the tuner! Gotta wait for the heater to turn on for the winter... I guess it'll be another week or two :/\n\nThanks!", "created_utc": "1634330920.0", "edited": "False", "id": "hgs99vo", "is_submitter": "True", "link_id": "t3_q8w47e", "parent_id": "t1_hgs3x3s", "score": "15", "subreddit": "piano", "subreddit_id": "t5_2qnw8"}, {"author": "honjapiano", "body": "Nocturne in C# Minor No. 20 by Chopin. Sometimes it's just referred to as \"Nocturne Op. Posth\"", "created_utc": "1634330850.0", "edited": "False", "id": "hgs948w", "is_submitter": "True", "link_id": "t3_q8w47e", "parent_id": "t1_hgs444m", "score": "29", "subreddit": "piano", "subreddit_id": "t5_2qnw8"}, {"author": "honjapiano", "body": "this is a great recording! i'm probably not the best advice-giver, but you seem a bit tense near the end and it's being shown in the sound (although i think it could probably be fixed with time as you get more used to the section). also, it seems like your dynamics are quite sudden rather than building up (and/or whatever the reverse of building up) to where you want to go.\n\nsorry if this is absolutely no help, i'm not a teacher. i enjoyed listening to your recording tho! took me a long time to get through this piece and i'm still working on it", "created_utc": "1634319752.0", "edited": "False", "id": "hgripbg", "is_submitter": "False", "link_id": "t3_q8eac4", "parent_id": "t3_q8eac4", "score": "2", "subreddit": "piano", "subreddit_id": "t5_2qnw8"}, {"author": "honjapiano", "body": "thank you!", "created_utc": "1633890734.0", "edited": "False", "id": "hg4sldk", "is_submitter": "False", "link_id": "t3_q4x3b2", "parent_id": "t1_hg4no8c", "score": "1", "subreddit": "LearnJapanese", "subreddit_id": "t5_2qyls"}, {"author": "honjapiano", "body": "what is the difference between 隣 (となり) and 横 (よこ)?\n\ni've googled it but i still don't have a great idea about how i can differentiate them", "created_utc": "1633884633.0", "edited": "False", "id": "hg4dus1", "is_submitter": "False", "link_id": "t3_q4x3b2", "parent_id": "t3_q4x3b2", "score": "1", "subreddit": "LearnJapanese", "subreddit_id": "t5_2qyls"}, {"author": "honjapiano", "body": "spanish is much easier! there are many more resources for spanish and the language is entirely phonetic—it’s pronounced how it’s written. \nif you want to learn both languages, i’d say learn portuguese first, as portuguese people tend to understand spanish easier than spanish people understand portuguese.", "created_utc": "1633118165.0", "edited": "False", "id": "hf0i6dv", "is_submitter": "False", "link_id": "t3_pzdjjt", "parent_id": "t3_pzdjjt", "score": "19", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "honjapiano", "body": "my family is basically the same as yours (except portuguese on both sides).despite most of them growing up in canada, i see all my cousins speaking portuguese to the elderly family and even amongst themselves it’s a really odd feeling to be left out!", "created_utc": "1632689421.0", "edited": "False", "id": "hee5n1w", "is_submitter": "True", "link_id": "t3_pvn0xb", "parent_id": "t1_hee3tat", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "honjapiano", "body": "European Portuguese (more accurately Azorean)", "created_utc": "1632688663.0", "edited": "False", "id": "hee3u01", "is_submitter": "True", "link_id": "t3_pvn0xb", "parent_id": "t1_hee2v9n", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "honjapiano", "body": "yes!! when i went to portugal, i tried to speak portuguese and natives asked me to stop!! why?! my little cousins were excited to practice their english, so it makes sense for them, but workers at restaurants and even just asking strangers for directions, everyone just asked me speak english! i think i spoke more portuguese on the plane to portugal than i did in all three weeks i was there!", "created_utc": "1632686071.0", "edited": "1632697678.0", "id": "hedxf9c", "is_submitter": "True", "link_id": "t3_pvn0xb", "parent_id": "t1_hedu9xf", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "honjapiano", "body": "that's a pretty awesome story, ngl. i think using ASL as a secret language (esp despite your father) is super cool! i always thought that it should have been taught in schools, even as at an elementary level. i can't imagine how hard it is to find a Signing person at a bank or something.", "created_utc": "1632678567.0", "edited": "False", "id": "hedem02", "is_submitter": "True", "link_id": "t3_pvn0xb", "parent_id": "t1_hed5a8x", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "honjapiano", "body": "my grandmother is the same! she also has alzheimer’s and has reverted mostly to portuguese. she always says she doesn’t understand what we’re saying in english (but i think it’s just because we talk quite fast) but then only ever speaks to me in english and gets confused when i speak to her in portuguese… it’s an odd experience. i’m glad i understand portuguese and we can converse in porkglish, or we’d just be sitting on the couch watching church livestreams in silence… not my idea of a fun time.", "created_utc": "1632677509.0", "edited": "False", "id": "hedbuni", "is_submitter": "True", "link_id": "t3_pvn0xb", "parent_id": "t1_hed4dkv", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "honjapiano", "body": "yes, this is so accurate!! thanks for your response. gave me a bit of comfort :)", "created_utc": "1632676937.0", "edited": "False", "id": "hedad4z", "is_submitter": "True", "link_id": "t3_pvn0xb", "parent_id": "t1_hed1nab", "score": "6", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "honjapiano", "body": "it’s funny. i actually had quite an opposite experience growing up. i was always around people of different cultures and i always felt embarrassed as to how ‘americanized’ (canadianized) i had grown up. i hardly ever had portuguese food for lunch and all the kids with their rice bowls and curry made me and my jelly sandwich a bit insecure. i still don’t want to bring friends over to eat in fear of them thinking badly of the food or that it’s too bland for their liking. as a kid in elementary school, i always tried to bring up my heritage in conversations to show that i wasn’t an “uncultured white person” as i always feared of being called. anyway, thanks for you response!", "created_utc": "1632676863.0", "edited": "False", "id": "heda6b8", "is_submitter": "True", "link_id": "t3_pvn0xb", "parent_id": "t1_hed080b", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "honjapiano", "body": "oh yes! i can’t get over the awkwardness of speaking portuguese to them! i know that they’d correct me and not be condescending but wow i almost can’t bring myself to do it. i find it easier to talk to strangest funnily enough", "created_utc": "1632672221.0", "edited": "False", "id": "hecz11e", "is_submitter": "True", "link_id": "t3_pvn0xb", "parent_id": "t1_hecybae", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "honjapiano", "body": "i was lucky to be able to take a course in grade 9 that got me to an A1 level-ish (i could understand most basic conversations and i could read simple books), but i only took that one course. otherwise, i’ve just been using duolingo and some other resources, and just doing a lot of listening to my parents and grandparents’ conversations. i definitely think in class lessons are so much easier to learn with (i learned more in that one year than the four since then). i’m hoping to take a course in uni.\ni don’t think it’s too late to learn tbh. i sort of avoided portuguese classes because i didn’t want to be stuck with children, but finding out that they had courses in university made me want to take a course again, because i’d be with adults that are just as confused as me! i’d definitely suggest looking into taking a course at a local university or college if you can (i think that you can take a couple courses without having to take an entire degree)", "created_utc": "1632672110.0", "edited": "False", "id": "hecyrcp", "is_submitter": "True", "link_id": "t3_pvn0xb", "parent_id": "t1_hecwxdg", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "honjapiano", "body": "i feel the same! i try to keep in contact with my family in portugal through facebook and it’s the only time i ever get to converse in it. otherwise, i’d be totally isolated from them", "created_utc": "1632671180.0", "edited": "False", "id": "hecwjlt", "is_submitter": "True", "link_id": "t3_pvn0xb", "parent_id": "t1_hecw85n", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "honjapiano", "body": "it didn’t work since it snaps to a straight 180° angle and my reading is on such a slight angle downward, but i didn’t know about the resize button, so thanks!", "created_utc": "1632671067.0", "edited": "False", "id": "hecwa72", "is_submitter": "False", "link_id": "t3_pvkbks", "parent_id": "t1_heat1m2", "score": "2", "subreddit": "GoodNotes", "subreddit_id": "t5_3c93e"}, {"author": "honjapiano", "body": "for whatever reason, it wasn’t working. maybe i had the pen too close to the screen? either way, it’s working now, so thanks!", "created_utc": "1632670954.0", "edited": "False", "id": "hecw0d9", "is_submitter": "False", "link_id": "t3_pvkbks", "parent_id": "t1_hecotro", "score": "2", "subreddit": "GoodNotes", "subreddit_id": "t5_3c93e"}, {"author": "honjapiano", "body": "thank you!", "created_utc": "1632670896.0", "edited": "False", "id": "hecvvc8", "is_submitter": "False", "link_id": "t3_pvkbks", "parent_id": "t1_heblrss", "score": "1", "subreddit": "GoodNotes", "subreddit_id": "t5_3c93e"}, {"author": "honjapiano", "body": "oh man, having been in french immersion, i totally understand that. french immersion (at least, from my experience) isn’t effective whatsoever unless you have french speaking parents at home to help (and even then, the drop out rates are super high)! my teachers were awful at helping me understand the concepts (namely math) in french, i ended up dropping out in late elementary school into the core system. it made my education and learning better, but i’ve never gotten above a B2 level (hopefully doing uni partly in french helps!). i also live near a francophone school, so i hear them speaking so fluently all the time! definitely wish i was them lol", "created_utc": "1632669741.0", "edited": "False", "id": "hect8bw", "is_submitter": "True", "link_id": "t3_pvn0xb", "parent_id": "t1_hecse2w", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "honjapiano", "body": "i’ve never thought of it like that, thanks. (and i’ll definitely check out DELE (or whatever the portuguese one is))", "created_utc": "1632665630.0", "edited": "False", "id": "heck1iz", "is_submitter": "True", "link_id": "t3_pvn0xb", "parent_id": "t1_hecjhj8", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "honjapiano", "body": "thanks for the reply! again, very useful :)", "created_utc": "1632665163.0", "edited": "False", "id": "hecj179", "is_submitter": "True", "link_id": "t3_pvn0xb", "parent_id": "t1_hecgfa0", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "honjapiano", "body": "hmmm that’s an interesting take! my mum didn’t learn it immediately because she was having issues speaking and then took lessons later… maybe it was partly my dad, who grew up with it as his first language at home (though i’m sure it was a joint decision)", "created_utc": "1632664968.0", "edited": "False", "id": "hecilhr", "is_submitter": "True", "link_id": "t3_pvn0xb", "parent_id": "t1_hecfqjx", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "honjapiano", "body": "yes, absolutely! i’ve been studying it for a couple years and am always surrounded by it when my grandparents visit, so i understand it quite well… i just can’t speak at all", "created_utc": "1632664888.0", "edited": "False", "id": "hecif2o", "is_submitter": "True", "link_id": "t3_pvn0xb", "parent_id": "t1_hechgvo", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "honjapiano", "body": "thank you for your reply! i appreciate it! (also, i LOVE the word scandihooligans)", "created_utc": "1632664702.0", "edited": "False", "id": "heci0mh", "is_submitter": "True", "link_id": "t3_pvn0xb", "parent_id": "t1_hebrq2z", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "honjapiano", "body": "what an awful thing to experience! i always forget that some people get made fun of for that type of stuff!", "created_utc": "1632664606.0", "edited": "False", "id": "hechtby", "is_submitter": "True", "link_id": "t3_pvn0xb", "parent_id": "t1_hebpqjl", "score": "10", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "honjapiano", "body": "hi, thank you for your reply!! i really appreciate it", "created_utc": "1632664480.0", "edited": "False", "id": "hechjzp", "is_submitter": "True", "link_id": "t3_pvn0xb", "parent_id": "t1_hebnovq", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "honjapiano", "body": "absolutely!! i feel the same. when relatives come over, i definitely feel the “oh poor you” vibes from some of them. also, i’ve never heard of Luganda, where is it from?", "created_utc": "1632664408.0", "edited": "False", "id": "hechehq", "is_submitter": "True", "link_id": "t3_pvn0xb", "parent_id": "t1_hebmdkz", "score": "16", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "honjapiano", "body": "nah, it wasn’t that. maybe the thought had changed by 2000? not sure. my parents just say that they didn’t think it would matter if i learned the language", "created_utc": "1632664200.0", "edited": "False", "id": "hecgyja", "is_submitter": "True", "link_id": "t3_pvn0xb", "parent_id": "t1_hebjcc2", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "honjapiano", "body": "i totally understand the first bit, but my parents are children of immigrants (my parents grew up in canada) — it seems i confused a lot of people, so i guess i didn’t explain that part. \n\nas for learning at home, my parents always spoke portuguese to their parents, to the neighbours (and between themselves if they didn’t want us to know what they were saying) so, i picked up a little bit of it. i can understand the language fluently, i just can’t converse with people… like, at all. anyway, thanks for your reply!", "created_utc": "1632664050.0", "edited": "False", "id": "hecgn2q", "is_submitter": "True", "link_id": "t3_pvn0xb", "parent_id": "t1_hebj9cc", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "honjapiano", "body": "hah! yes, i’m fluent in angry portuguese (which maybe says that i was a badly behaved child lol)", "created_utc": "1632663816.0", "edited": "False", "id": "hecg4xo", "is_submitter": "True", "link_id": "t3_pvn0xb", "parent_id": "t1_hebic80", "score": "31", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "honjapiano", "body": "definitely! i’d have no idea what to do if i were in your position. thanks for the comment!", "created_utc": "1632663773.0", "edited": "False", "id": "hecg1nm", "is_submitter": "True", "link_id": "t3_pvn0xb", "parent_id": "t1_hebghi4", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "honjapiano", "body": "thanks for your reply! i’ve been studying for four years and i can understand almost fluently, but i can’t really speak ~ mostly because it’s embarrassing when i make a mistake and i’ve been outwardly laughed at by some people (not my parents). although, yes, there probably is a part of me that doesn’t /really/ want to work for it, though i’m trying to defeat that part of my brain", "created_utc": "1632663712.0", "edited": "False", "id": "hecfwx8", "is_submitter": "True", "link_id": "t3_pvn0xb", "parent_id": "t1_hebffqu", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "honjapiano", "body": "i appreciate your comment, thanks!", "created_utc": "1632663431.0", "edited": "False", "id": "hecfav5", "is_submitter": "True", "link_id": "t3_pvn0xb", "parent_id": "t1_hebeudf", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "honjapiano", "body": "that’s a really interesting story, thanks for the reply. russian is such a cool language! i’m curious as to how well you knew it before living there? i’ve always wanted to immerse myself for some period of time but after a bad experience (natives told me to stop and just speak english 😭) i’m hesitating", "created_utc": "1632663244.0", "edited": "False", "id": "hecew37", "is_submitter": "True", "link_id": "t3_pvn0xb", "parent_id": "t1_hecddwe", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "honjapiano", "body": "thanks for you reply! i do think russian math is a bit torturous though (i had to take math in french at school… i shiver when i think of it😂)", "created_utc": "1632663081.0", "edited": "False", "id": "hecejsg", "is_submitter": "True", "link_id": "t3_pvn0xb", "parent_id": "t1_hece7hn", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "honjapiano", "body": "aw that sucks! i definitely feel the pain. portuguese was a language they used to talk to each other so nobody would understand, but now that i understand the language for the most part, they just say it in english 😅 gossip is invaluable i guess", "created_utc": "1632662924.0", "edited": "False", "id": "hece81n", "is_submitter": "True", "link_id": "t3_pvn0xb", "parent_id": "t1_hecclfl", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "honjapiano", "body": "well, family events are a different universe lol, but i’ve definitely felt the same. my (much younger) cousins visited from portugal and made fun of me the entire time for not speaking portuguese — i never knew a 6 year old could be so hurtful lol. \n\ni do understand the “small white town” aspect tho. people in the suburbs can be so mean for no reason! i live in a big city, so i don’t see it as often", "created_utc": "1632662812.0", "edited": "False", "id": "hecdzy0", "is_submitter": "True", "link_id": "t3_pvn0xb", "parent_id": "t1_hecc1pl", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "honjapiano", "body": "thank you, this is such an awesome reply! when you said that people took you speaking english personally, it made me laugh. i know a lot of chinese friends who are judged by others even outside of their family for not speaking mando or canto very well — luckily outsiders don’t really care, but whenever family visits, they definitely give a sad look when they find out i can’t speak back to them.", "created_utc": "1632662685.0", "edited": "False", "id": "hecdr0o", "is_submitter": "True", "link_id": "t3_pvn0xb", "parent_id": "t1_hecb9kg", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "honjapiano", "body": "that’s nice of them! i’ve considered getting a job and just being thrown into the fire, but i visited portugal 2019 and tried to practice speaking but the natives asked me to stop… maybe i’m traumatized 😅", "created_utc": "1632662396.0", "edited": "False", "id": "hecd6rg", "is_submitter": "True", "link_id": "t3_pvn0xb", "parent_id": "t1_heca2qc", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "honjapiano", "body": "i can’t believe people are made fun of for stuff like that! i’m from a very multicultural area, so maybe i’m just not used to it…\nthanks for your reply!", "created_utc": "1632662180.0", "edited": "False", "id": "heccrqn", "is_submitter": "True", "link_id": "t3_pvn0xb", "parent_id": "t1_hec4iti", "score": "16", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "honjapiano", "body": "i really appreciate your input, thank you for making me feel less alone in this :) that’s such a sad story about your nana but i understand her reasoning.", "created_utc": "1632661912.0", "edited": "False", "id": "hecc9ec", "is_submitter": "True", "link_id": "t3_pvn0xb", "parent_id": "t1_hec4b5d", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "honjapiano", "body": "yes! this is exactly how i feel. my parents were born in canada, but grew up involved in the community, but once they were living together (away from their parents ig) they just stopped and i’ve never been able to feel a sense of community like they did.", "created_utc": "1632661760.0", "edited": "False", "id": "hecbz1k", "is_submitter": "True", "link_id": "t3_pvn0xb", "parent_id": "t1_hec3674", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "honjapiano", "body": "definitely! i’d love to learn the dialect of where my family comes from, but it’s hard enough to find european portuguese resources let alone a açorean ones. \n\ni have a lot of friends who peak dialects like hoiping and toisan (forgive my spelling) and they’re parents say the same thing even though they /know/ how to speak it lol", "created_utc": "1632661665.0", "edited": "False", "id": "hecbsjx", "is_submitter": "True", "link_id": "t3_pvn0xb", "parent_id": "t1_hec30md", "score": "6", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "honjapiano", "body": "thanks for your reply! i guess i should have clarified that my parents aren’t immigrants — they were the first generation born in canada. seems like i confused a lot of people 😅", "created_utc": "1632661480.0", "edited": "False", "id": "hecbfvl", "is_submitter": "True", "link_id": "t3_pvn0xb", "parent_id": "t1_hec2zu2", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "honjapiano", "body": "absolutely. i’m not sure if porkglish is even a word people use but it’s what my family calls “immigrant portuguese” where a bunch of english just gets filtered in randomly. like lixo (garbage) becomes garbeech lol", "created_utc": "1632661385.0", "edited": "False", "id": "hecb9ga", "is_submitter": "True", "link_id": "t3_pvn0xb", "parent_id": "t1_hec1uop", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "honjapiano", "body": "that makes total sense. i don’t think my parents personally experienced that, but it could have been a factor. thanks!", "created_utc": "1632661293.0", "edited": "False", "id": "hecb3e2", "is_submitter": "True", "link_id": "t3_pvn0xb", "parent_id": "t1_hec1igm", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "honjapiano", "body": "hi, yes. animosity is totally a strong word, but when i posted i couldn’t think of a better one and now it won’t let me change the title! i’m stuck with it :/", "created_utc": "1632661147.0", "edited": "False", "id": "hecatvz", "is_submitter": "True", "link_id": "t3_pvn0xb", "parent_id": "t1_hebejgh", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "honjapiano", "body": "definitely a strong word! i couldn’t think of a synonym at the point of posting and it won’t let me change the title, so i’m suck with it. thanks for the reply!", "created_utc": "1632660914.0", "edited": "False", "id": "hecaf1d", "is_submitter": "True", "link_id": "t3_pvn0xb", "parent_id": "t1_hebjlq4", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "honjapiano", "body": "you don’t need to get defensive about whether i or any other users like your comment. i appreciate that you took the time to respond at all. my response to you was just to clarify that it sucked that they didn’t try at all, not that i have to study it now. obviously animosity and jealousy hasn’t gotten me anywhere. just watching my friends speak their languages hasn’t magically given me linguistic ability lol. i’ve been studying for four years and still can’t speak for shit — it’s not much fun being able to understand people perfectly but not being able to speak back. either way, i appreciate your response (the downvotes don’t mean shit about the quality of your answer)", "created_utc": "1632635923.0", "edited": "False", "id": "hebczpz", "is_submitter": "True", "link_id": "t3_pvn0xb", "parent_id": "t1_hebbeu2", "score": "11", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "honjapiano", "body": "i am actively studying right now (and have been for four years…definitely not fluent). i’m doing the best i can with what i learned in a high school course and with free sources since i can’t put any money into it. anyway, it’s not the actual act of studying that frustrates me, it’s the fact that they didn’t even /try/ to teach it", "created_utc": "1632634206.0", "edited": "False", "id": "hebacja", "is_submitter": "True", "link_id": "t3_pvn0xb", "parent_id": "t1_heb870z", "score": "14", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "honjapiano", "body": "i wish they’d made a decision like that but my parents’ answer when i asked why they didn’t teach my brother and i was “because they didn’t think it would be important” 😅 i totally understand why you would have chosen to stop speaking spanish, but at least you tried and then made a decision off of that.", "created_utc": "1632632572.0", "edited": "False", "id": "heb7m8j", "is_submitter": "True", "link_id": "t3_pvn0xb", "parent_id": "t1_heb74pf", "score": "37", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "honjapiano", "body": "this looks pretty good for an early attempt! i’m not a great artist but i have a good eye, so i think you’d benefit from focusing on smaller areas before jumping into an entire figures. \n\none of the best things to do are “studies” — theyre especially helpful when trying to mimic certain styles. just do an entire page of a bunch of different characters’ noses, or hands, or eyes, or poses (etc). i know a lot of artists do that and say it really helps them. the point of the study isn’t gr them to look perfect, but it helps to understand anatomy and makes it a lot easier to pull poses from your mental library rather than constantly being bound by references (like me… i can recreate, but i can’t draw anything original…)", "created_utc": "1632025475.0", "edited": "False", "id": "hdfashd", "is_submitter": "False", "link_id": "t3_pqv34w", "parent_id": "t3_pqv34w", "score": "2", "subreddit": "StardustCrusaders", "subreddit_id": "t5_2tny5"}, {"author": "honjapiano", "body": "thank you!!", "created_utc": "1631920193.0", "edited": "False", "id": "hd9mhxn", "is_submitter": "False", "link_id": "t3_pq9xip", "parent_id": "t1_hd9jdma", "score": "1", "subreddit": "zelda", "subreddit_id": "t5_2r61g"}, {"author": "honjapiano", "body": "This is super helpful, thanks!", "created_utc": "1631162131.0", "edited": "False", "id": "hc5as7t", "is_submitter": "True", "link_id": "t3_pko21c", "parent_id": "t1_hc531u3", "score": "6", "subreddit": "LearnJapanese", "subreddit_id": "t5_2qyls"}, {"author": "honjapiano", "body": "oh yeah. it was quite the wild ride, but i’m low key glad i watched it in that order because it really got me invested in the origins, which made me go back and watch the older parts", "created_utc": "1630765276.0", "edited": "False", "id": "hbkkofb", "is_submitter": "False", "link_id": "t3_phr3ka", "parent_id": "t1_hbkiam2", "score": "3", "subreddit": "ShitPostCrusaders", "subreddit_id": "t5_3f7q5"}, {"author": "honjapiano", "body": "in february, when i was avoiding my mid-terms, i started watching jojo because i thought the memes that my friends sent were funny but i had NO idea wtf it was about. \n\ni started with part 4 and thought that the entire series was gonna be fun up-beat shenanigans. i moved onto part 5 and quickly realized that (spoiler) everyone fucking dies and it is NOT up-beat shenanigans. then, i moved to part 3 to cheer myself up only to become even more attached to and sad about the characters.\n\nso here i am now, not watching the last few eps of part 3 because i KNOW how it ends and i’m procrastinating it by having watched part 1, being halfway through part 2, and reading part 6.", "created_utc": "1630763381.0", "edited": "False", "id": "hbkgsn9", "is_submitter": "False", "link_id": "t3_phr3ka", "parent_id": "t3_phr3ka", "score": "3", "subreddit": "ShitPostCrusaders", "subreddit_id": "t5_3f7q5"}, {"author": "honjapiano", "body": "It was a play, but Dear Evan Hansen was much better than the book... However it's a bit of special case since the book and the play were written alongside each other", "created_utc": "1630763081.0", "edited": "False", "id": "hbkg7ik", "is_submitter": "False", "link_id": "t3_phkj89", "parent_id": "t3_phkj89", "score": "1", "subreddit": "books", "subreddit_id": "t5_2qh4i"}, {"author": "honjapiano", "body": "To Kill A Kingdom! It had everything I love; enemies to lovers, disney retellings, supernatural aspects (etc), but it was SO SO SO boring. As soon as it got interesting, it got boring again.", "created_utc": "1630521200.0", "edited": "False", "id": "hb7vx5g", "is_submitter": "False", "link_id": "t3_pfj7y4", "parent_id": "t3_pfj7y4", "score": "1", "subreddit": "books", "subreddit_id": "t5_2qh4i"}, {"author": "honjapiano", "body": "thanks!", "created_utc": "1628884297.0", "edited": "False", "id": "h8tn7vb", "is_submitter": "False", "link_id": "t3_p181l1", "parent_id": "t1_h8dm41v", "score": "1", "subreddit": "singing", "subreddit_id": "t5_2rlcx"}, {"author": "honjapiano", "body": "thank you!", "created_utc": "1628884291.0", "edited": "False", "id": "h8tn7dl", "is_submitter": "False", "link_id": "t3_p181l1", "parent_id": "t1_h8ct6rv", "score": "1", "subreddit": "singing", "subreddit_id": "t5_2rlcx"}, {"author": "honjapiano", "body": "i’d suggest listening to a bunch of different genre’s within the classical music genre (waltz’s, nocturnes, sonatas, sonatinas, fugues, etc).\n\nwith complete bias, i say you should listen to chopin (especially his waltz’s and nocturnes), debussy and liszt just because they’re my favourites.\n\nchopin is a great place to start because all of his works are quite pretty and easy on the ears while still being classic(al) piano pieces. bach and scarlatti are great introductions to the baroque era. rachmaninoff and mozart are also very popular composers who are staples of the classical music genre.\n\nseparately, i think it’d be nice to listen to some christopher norton. he’s not a classical composer, rather the more jazzy type, but some of his lower level stuff have great technical lessons that help with classical studies.", "created_utc": "1628540755.0", "edited": "False", "id": "h8btslx", "is_submitter": "False", "link_id": "t3_p14jce", "parent_id": "t3_p14jce", "score": "2", "subreddit": "piano", "subreddit_id": "t5_2qnw8"}, {"author": "honjapiano", "body": "awesome! thank you!!", "created_utc": "1628538618.0", "edited": "False", "id": "h8borb4", "is_submitter": "False", "link_id": "t3_p181l1", "parent_id": "t1_h8bnjmp", "score": "2", "subreddit": "singing", "subreddit_id": "t5_2rlcx"}, {"author": "honjapiano", "body": "thank you!!", "created_utc": "1628178040.0", "edited": "False", "id": "h7tiiqu", "is_submitter": "False", "link_id": "t3_oy1msz", "parent_id": "t1_h7q9peq", "score": "1", "subreddit": "manga", "subreddit_id": "t5_2ql0i"}, {"author": "honjapiano", "body": "ahhhh thanks! do you know if it’s the same for part 3?", "created_utc": "1628178008.0", "edited": "False", "id": "h7tig1d", "is_submitter": "False", "link_id": "t3_oy1msz", "parent_id": "t1_h7q1236", "score": "1", "subreddit": "manga", "subreddit_id": "t5_2ql0i"}, {"author": "honjapiano", "body": "it didn’t specify, unfortunately. although, for first generation uni students, it usually says “having no immediate family pursue post-secondary education”", "created_utc": "1628177970.0", "edited": "False", "id": "h7ticrl", "is_submitter": "False", "link_id": "t3_oxymbr", "parent_id": "t1_h7q3ovi", "score": "1", "subreddit": "NoStupidQuestions", "subreddit_id": "t5_2w844"}, {"author": "honjapiano", "body": "i hadn’t thought of graphic novels, thanks for the suggestions!", "created_utc": "1626496302.0", "edited": "False", "id": "h5he2a5", "is_submitter": "False", "link_id": "t3_olnmos", "parent_id": "t1_h5flzzo", "score": "2", "subreddit": "booksuggestions", "subreddit_id": "t5_2ryqe"}, {"author": "honjapiano", "body": "i’ll definitely tell him to check it out. sounds right up his alley!", "created_utc": "1626496262.0", "edited": "False", "id": "h5he02l", "is_submitter": "False", "link_id": "t3_olnmos", "parent_id": "t1_h5g3mvp", "score": "1", "subreddit": "booksuggestions", "subreddit_id": "t5_2ryqe"}, {"author": "honjapiano", "body": "that’s wonderful! i happen to own the book so i might pass it over to him :)", "created_utc": "1626496211.0", "edited": "False", "id": "h5hdx6t", "is_submitter": "False", "link_id": "t3_olnmos", "parent_id": "t1_h5fje7j", "score": "1", "subreddit": "booksuggestions", "subreddit_id": "t5_2ryqe"}, {"author": "honjapiano", "body": "i- thank you! 🥺 i think that’s the nicest thing someone has ever said about my playing", "created_utc": "1615475730.0", "edited": "False", "id": "gqkw63g", "is_submitter": "False", "link_id": "t3_m2rhmc", "parent_id": "t1_gqksyrg", "score": "2", "subreddit": "piano", "subreddit_id": "t5_2qnw8"}, {"author": "honjapiano", "body": "The barrel is clean and so is the grip — The cap has a bit of residue though. \n\nI don’t move the pen too much (save for when it’s being used) since I put it in its case and leave it on my desk...", "created_utc": "1615143991.0", "edited": "False", "id": "gq4iw8y", "is_submitter": "False", "link_id": "t3_lzx022", "parent_id": "t1_gq4hx1i", "score": "2", "subreddit": "fountainpens", "subreddit_id": "t5_2s0ew"}, {"author": "honjapiano", "body": "Hi, i got this Pilot pen recently from my dad (who’s owned it for a while). I noticed that when I take it out of the cap, there’s always ink on it (shown above). I store it horizontally on the desk, not angled downward in a stand or something like that. I can’t figure out why it’s happening and if I should be worried or not...\n\nI’ve gone through 2 ink cartridges already and it’s been the same situation for both. \n\nThe ink flow isn’t too heavy when I write — it’s only when I store it and then comeback hours later that I see the ink build up again", "created_utc": "1615143508.0", "edited": "False", "id": "gq4hppl", "is_submitter": "False", "link_id": "t3_lzx022", "parent_id": "t3_lzx022", "score": "2", "subreddit": "fountainpens", "subreddit_id": "t5_2s0ew"}, {"author": "honjapiano", "body": "A Little Life by Hanya Yanagihara", "created_utc": "1614999861.0", "edited": "False", "id": "gputktf", "is_submitter": "False", "link_id": "t3_lyny1b", "parent_id": "t3_lyny1b", "score": "2", "subreddit": "suggestmeabook", "subreddit_id": "t5_31t41"}, {"author": "honjapiano", "body": "Usually, if you’re looking for a certain composer or content, buying a whole book is often the best way to go. That, or just print it out and stick it in a binder (sometimes I just print a page or two instead of the entire piece).", "created_utc": "1602123828.0", "edited": "False", "id": "g82jlon", "is_submitter": "False", "link_id": "t3_j5iagh", "parent_id": "t1_g82i1tz", "score": "2", "subreddit": "piano", "subreddit_id": "t5_2qnw8"}, {"author": "honjapiano", "body": "thanks for your reply! my education system is pretty good about destigmatizing but awful at explaining exactly what makes the two brains different. so that helped, thanks!\n\nalso, i know that growing up will obviously give me more exposure to different mental illnesses. but i just found it kind of shocking that growing up, mental health was something so distant, and now, at 17, i feel like i know more people who are diagnosed with something than not haha", "created_utc": "1593989705.0", "edited": "False", "id": "fx1law1", "is_submitter": "False", "link_id": "t3_hlv87h", "parent_id": "t1_fx1i8c3", "score": "1", "subreddit": "mentalhealth", "subreddit_id": "t5_2qirg"}]