[{"author": "illustriousgarb", "body": "I genuinely don't understand why this doesn't get more attention. While not all veterans have seen active combat, they were all willing to put their lives on the line for our country. The very least we can do is ensure they're cared for in return.\n\nOur country is willing to let our military personnel die for us, and we wax poetic about the heroes that make the \"ultimate sacrifice,\" but we don't really give a shit about them.", "created_utc": "1666709754.0", "edited": "False", "id": "itqa210", "is_submitter": "False", "link_id": "t3_yd3iv9", "parent_id": "t3_yd3iv9", "score": "7", "subreddit": "wisconsin", "subreddit_id": "t5_2qrc2"}, {"author": "illustriousgarb", "body": "God that last sentence is so true and hurts. My grandfather saw active combat during WWII. He literally lived through hell, and that's only from the stories he was willing to tell us.\n\nThe fact that there are people out there who are happily buying into Nazi propaganda makes me ill.", "created_utc": "1666381437.0", "edited": "False", "id": "it8tn9j", "is_submitter": "False", "link_id": "t3_y9vxsi", "parent_id": "t1_it7yp7r", "score": "5", "subreddit": "wisconsin", "subreddit_id": "t5_2qrc2"}, {"author": "illustriousgarb", "body": "I am so fucking tired of the \"late term abortion\" bogeyman they keep bringing up. Literally no one is seeking late term abortions for funsies. \n\nDo none of these people realize doctors do indeed have to adhere to a code of ethics? They're not sitting there ready to kill a healthy baby as soon as it exits the womb. Anyone with a functioning brain cell would realize this if they took a second to think. But alas, thinking is a rare skill these days.", "created_utc": "1665930906.0", "edited": "False", "id": "isjotqf", "is_submitter": "False", "link_id": "t3_y528fc", "parent_id": "t3_y528fc", "score": "11", "subreddit": "wisconsin", "subreddit_id": "t5_2qrc2"}, {"author": "illustriousgarb", "body": "Yep. I used to work in a Choice school in Milwaukee, and this happened a lot. It's one of the biggest reasons I'm against the \"voucher programs\" that keep getting pushed. Sure, it sounds great to us parents on paper, but in reality, it's another way we fuck over public schools.", "created_utc": "1665870506.0", "edited": "False", "id": "isgtm4u", "is_submitter": "False", "link_id": "t3_y4ksqk", "parent_id": "t1_isf55f5", "score": "11", "subreddit": "wisconsin", "subreddit_id": "t5_2qrc2"}, {"author": "illustriousgarb", "body": "I attend the convention you're talking about, and although I didn't wear it the Orient Express year - I was hella pregnant and refused to do corsets, and also didn't want to get mixed up in the orientalism nonsense that started on Facebook - I might be one of those white ladies you see with kimono/obi incorporated into my outfit.\n\nI'm also married to a first-generation American Asian man and spent time living in Japan, so I'm very careful with my research and construction. I'm primarily repurposing unwearable kimono fabric (this is an actual thing that is done out of respect for the artisans who create kimono).\n\nThat being said: you are absolutely right with the \"white lady geisha\" nonsense with \"oriental\" themes. There's a tremendous difference between paying homage/wearing cultural clothing appropriately, and turning a whole culture into a fantasy. Apparently there was some really awful stuff in the Wild West year, too. It's incredibly frustrating because my whole thing at conventions is doing educational panels for white people on \"how to not be an appropriative doofus,\" and then you have a person in straight up yellow face walk right in front of you with photographers in tow.\n\nI wish I could say I was surprised that CoCo pulled this but ... given their problematic history, I wasn't. I hate it because there really are ways to be white and wear clothing from other cultures, but until shit like this stops, it's going to continue to be a minefield.", "created_utc": "1665373141.0", "edited": "False", "id": "irpz6ha", "is_submitter": "False", "link_id": "t3_xlqeqx", "parent_id": "t1_ir6q87r", "score": "6", "subreddit": "craftsnark", "subreddit_id": "t5_hu6et"}, {"author": "illustriousgarb", "body": "S I G H. This is the shit that makes me embarrassed to admit I was raised Catholic.\n\nIt's not even Satan lady, put the pearls down.", "created_utc": "1665099058.0", "edited": "False", "id": "ircect7", "is_submitter": "False", "link_id": "t3_xx75rf", "parent_id": "t3_xx75rf", "score": "2", "subreddit": "ShitMomGroupsSay", "subreddit_id": "t5_gajhd"}, {"author": "illustriousgarb", "body": "I'm not from a Hispanic background, but I am from a Catholic background and it flabbergasts me how many people I used to attend church with will only focus on that abortion issue. Jesus said a lot about caring for vulnerable people (the poor, the sick, the refugees) but pretty much nothing about abortion. Yet so many Catholics make it their only issue, ignoring the fact that \"pro-life\" is supposed to mean \"pro-ALL life,\" not just fetuses. It's... bizarre.", "created_utc": "1663524104.0", "edited": "False", "id": "ioyf6f7", "is_submitter": "False", "link_id": "t3_xhj95u", "parent_id": "t1_ioy3dk7", "score": "4", "subreddit": "wisconsin", "subreddit_id": "t5_2qrc2"}, {"author": "illustriousgarb", "body": "Jesus Christ. I am so sorry for your friend. I lost very much wanted pregnancies at much earlier stages and it was already a mess trying to get D&Cs before R v W was overturned. The emotional trauma she's enduring must be devastating.\n\n\nFuck these people trying to control our uteruses.", "created_utc": "1663469376.0", "edited": "False", "id": "iovmn0x", "is_submitter": "False", "link_id": "t3_xgqa1h", "parent_id": "t1_iouwiw3", "score": "12", "subreddit": "wisconsin", "subreddit_id": "t5_2qrc2"}, {"author": "illustriousgarb", "body": "I can't, for the life of me, understand why they don't care if \"the kid doesn't do it at home.\" As a parent, if my kid was exhibiting violent behavior at school that wasn't happening at home, I'd be really fucking concerned!", "created_utc": "1662833608.0", "edited": "False", "id": "invuvdy", "is_submitter": "False", "link_id": "t3_xagyd5", "parent_id": "t1_invk7js", "score": "45", "subreddit": "ShitMomGroupsSay", "subreddit_id": "t5_gajhd"}, {"author": "illustriousgarb", "body": "This is the kind of shit that killed women for centuries before modern obstetrics. Ffs.", "created_utc": "1662652808.0", "edited": "False", "id": "inlqrer", "is_submitter": "False", "link_id": "t3_x8z50o", "parent_id": "t3_x8z50o", "score": "229", "subreddit": "ShitMomGroupsSay", "subreddit_id": "t5_gajhd"}, {"author": "illustriousgarb", "body": "This scares the hell out of me. I'm in an interracial marriage. We have biological children. I am so worried for them.\n\nI do not understand why \"the party of family values\" is so desperate to strip our rights.\n\nFRJ", "created_utc": "1662584479.0", "edited": "False", "id": "ini406g", "is_submitter": "False", "link_id": "t3_x894rj", "parent_id": "t1_ingxjrb", "score": "51", "subreddit": "wisconsin", "subreddit_id": "t5_2qrc2"}, {"author": "illustriousgarb", "body": "Okay cool rando thanks for the implication that I'm lying, but I'll listen to my doctor thanks", "created_utc": "1662480641.0", "edited": "False", "id": "inbv9ko", "is_submitter": "False", "link_id": "t3_x6wuvu", "parent_id": "t1_inbuj44", "score": "7", "subreddit": "antiMLM", "subreddit_id": "t5_2swge"}, {"author": "illustriousgarb", "body": "I know this is just bait trolling but because people and their weight cause a great deal of emotional distress and I don't want someone reading this to take it to heart - this is patently false.\n\nThe entire concept of \"being lazy\" is bullshit predicated on the fact that productivity= good, even if said productivity is toxic.\n\nAlso, frequently, fat is a symptom of an underlying condition that's frequently dismissed because of this FaT pEoPlE aRe LaZy rhetoric. I was finally diagnosed after not losing weight despite engaging in daily aerobic activity and having a demonstrable and documented calorie deficit, don't come at me about laziness.", "created_utc": "1662479606.0", "edited": "False", "id": "inbsnem", "is_submitter": "False", "link_id": "t3_x6wuvu", "parent_id": "t1_inbfff1", "score": "10", "subreddit": "antiMLM", "subreddit_id": "t5_2swge"}, {"author": "illustriousgarb", "body": "You know...I may have. I'll look into that, thanks!", "created_utc": "1661458397.0", "edited": "False", "id": "ils2dft", "is_submitter": "False", "link_id": "t3_wxhcpy", "parent_id": "t1_ils28v8", "score": "7", "subreddit": "wisconsin", "subreddit_id": "t5_2qrc2"}, {"author": "illustriousgarb", "body": "Beautiful!!", "created_utc": "1661456757.0", "edited": "False", "id": "ilry56q", "is_submitter": "False", "link_id": "t3_wxdubm", "parent_id": "t3_wxdubm", "score": "2", "subreddit": "DotHack", "subreddit_id": "t5_2sgry"}, {"author": "illustriousgarb", "body": "The \"useless major\" in particular enrages me. I have what would be considered a \"useless degree\" by these types. We were told employers wanted liberal arts majors because of how well-rounded it made us, etc etc. We were sold a lie and now we're being blamed for having useless degrees.\n\nScrew these people.", "created_utc": "1661456657.0", "edited": "False", "id": "ilrxvuv", "is_submitter": "False", "link_id": "t3_wxit2n", "parent_id": "t3_wxit2n", "score": "1", "subreddit": "terriblefacebookmemes", "subreddit_id": "t5_2tja6"}, {"author": "illustriousgarb", "body": "Look friends. I paid my loans off two years ago. Am I jealous I didn't get some of them forgiven? Sure, but I don't find this unfair at all. I'm glad something is being done so my friends and fellow humans can get some relief.\n\nFRJ.", "created_utc": "1661456448.0", "edited": "False", "id": "ilrxcm9", "is_submitter": "False", "link_id": "t3_wxhcpy", "parent_id": "t3_wxhcpy", "score": "30", "subreddit": "wisconsin", "subreddit_id": "t5_2qrc2"}, {"author": "illustriousgarb", "body": "When you're so boring you have to compensate by advertising to the world what weapons you own", "created_utc": "1661382467.0", "edited": "False", "id": "ilnsxil", "is_submitter": "False", "link_id": "t3_wwwklx", "parent_id": "t3_wwwklx", "score": "12", "subreddit": "ShitMomGroupsSay", "subreddit_id": "t5_gajhd"}, {"author": "illustriousgarb", "body": "Hell, I had a student determine I had a deviated septum, which no doctor had ever told me I had before. I'm totally cool with students in the room.", "created_utc": "1660962598.0", "edited": "False", "id": "il0p04u", "is_submitter": "False", "link_id": "t3_wsqg24", "parent_id": "t1_il0doub", "score": "3", "subreddit": "ShitMomGroupsSay", "subreddit_id": "t5_gajhd"}, {"author": "illustriousgarb", "body": "Right? Lol! I have no idea what my kids' signs are. My MIL knows what their Chinese signs are, but that's because she's kind of into that stuff, but even with her it's just for fun. It's \"Oh little Billy is a snake, just like Grandma!\" Not \"oh no she's a rooster, you'll never get along.\"", "created_utc": "1660827024.0", "edited": "False", "id": "iksf7wq", "is_submitter": "False", "link_id": "t3_wrfi7k", "parent_id": "t1_iks26ib", "score": "9", "subreddit": "ShitMomGroupsSay", "subreddit_id": "t5_gajhd"}, {"author": "illustriousgarb", "body": "And here I was feeling terrible about sending my first (who I thought would be an only) to preschool because I just needed a fucking break. \n\nI feel so bad for her child.", "created_utc": "1660762954.0", "edited": "False", "id": "ikozv5h", "is_submitter": "False", "link_id": "t3_wqplh5", "parent_id": "t3_wqplh5", "score": "25", "subreddit": "ShitMomGroupsSay", "subreddit_id": "t5_gajhd"}, {"author": "illustriousgarb", "body": "Stop. Demonizing. Formula.\n\nAlso stop acting like autism is some fate worse than death.", "created_utc": "1660747089.0", "edited": "False", "id": "ikntzqa", "is_submitter": "False", "link_id": "t3_wqofum", "parent_id": "t3_wqofum", "score": "169", "subreddit": "ShitMomGroupsSay", "subreddit_id": "t5_gajhd"}, {"author": "illustriousgarb", "body": "You've got some great answers so far. I'm also a part-timer, primarily because I am also the primary caregiver for my children atm, which makes it hard to just \"pop into the booth\" for an audition.\n\nWhen I have live gigs booked, those are my priorities on the day of the session. I make sure my voice is warmed up before the session. I'll throw out a couple of auditions after the session if I'm feeling up to it (I generally try to go on vocal rest if I've done any yelling), and then just kind of squeeze in auditions when I get a chance throughout the day.\n\nOtherwise I have time set aside for recording the stuff that doesn't require a live session. This time is non-negotiable. If I don't have work at the moment, that time is for auditions.\n\nOne thing I haven't seen mentioned, is taking care of your voice and body. Your voice is your instrument, and it needs to be powered by your lungs. You really need to pay attention to  caring for these aspects of your body. You don't necessarily need to be physically fit, but you need to make sure you have healthy habits that keep your lungs and voice in good condition. Personally, I bought one of those water bottles with timer marks on them to tell me how much water I should have at certain points of the day. I've noticed great improvement in my recordings because I'm properly hydrated.\n\nEvery VA's day looks different, but like others have said, it's really mostly auditioning. If you decide to go on this path, be gentle with yourself because it really does take time to get going.", "created_utc": "1660745462.0", "edited": "False", "id": "iknpyf4", "is_submitter": "False", "link_id": "t3_wqn2yf", "parent_id": "t3_wqn2yf", "score": "3", "subreddit": "VoiceActing", "subreddit_id": "t5_2r878"}, {"author": "illustriousgarb", "body": "Yes, this! Gender disappointment is real but most people get past it. This is.... something, but it ain't gender disappointment.", "created_utc": "1660744724.0", "edited": "False", "id": "ikno52c", "is_submitter": "False", "link_id": "t3_wqmc8r", "parent_id": "t1_iknaiwi", "score": "5", "subreddit": "ShitMomGroupsSay", "subreddit_id": "t5_gajhd"}, {"author": "illustriousgarb", "body": "I worked in the pharmaceutical industry. FRJ.", "created_utc": "1660744547.0", "edited": "False", "id": "iknnpgs", "is_submitter": "False", "link_id": "t3_wqodcl", "parent_id": "t3_wqodcl", "score": "9", "subreddit": "wisconsin", "subreddit_id": "t5_2qrc2"}, {"author": "illustriousgarb", "body": "I am old enough that the chicken pox vaccine was not available. When chicken pox parties were a reasonable thing to do because you wanted to make sure you got it in childhood (not infanthood) because it is worse to get it as an adult. And you were virtually guaranteed to get it at some point in your life, so it was a reasonable thing to try and control when you got it.\n\nI got it from my sister. I had a mild case. It was two weeks of hell, trying not to scratch the itches while feeling miserable. I have lifelong scars. I will have to get the shingles shot because having chicken pox puts you at risk for this horribly painful condition. My parents, and many of my friends have had shingles. It's fucking horrible to live through.\n\nYou'd better believe both my kids got the chicken pox vaccine the second they were eligible. Don't make your kids live through this disease when prevention is so easy.", "created_utc": "1660744080.0", "edited": "False", "id": "iknmki4", "is_submitter": "False", "link_id": "t3_wqjj7b", "parent_id": "t3_wqjj7b", "score": "2", "subreddit": "ShitMomGroupsSay", "subreddit_id": "t5_gajhd"}, {"author": "illustriousgarb", "body": "I will never understand why this is such a controversial take. If basic human needs include food, clothing, and shelter (and healthcare), those things all cost money in the capitalist world.", "created_utc": "1660680515.0", "edited": "False", "id": "ikkcisz", "is_submitter": "False", "link_id": "t3_wpxl4v", "parent_id": "t3_wpxl4v", "score": "1", "subreddit": "antiwork", "subreddit_id": "t5_2y77d"}, {"author": "illustriousgarb", "body": "Thank you, I'll check that out!", "created_utc": "1660671980.0", "edited": "False", "id": "ikjq4dw", "is_submitter": "False", "link_id": "t3_wpxnlr", "parent_id": "t1_ikjq1ck", "score": "1", "subreddit": "madisonwi", "subreddit_id": "t5_2r8rz"}, {"author": "illustriousgarb", "body": "Thanks!", "created_utc": "1660671344.0", "edited": "False", "id": "ikjog4r", "is_submitter": "False", "link_id": "t3_wpxnlr", "parent_id": "t1_ikjodxg", "score": "2", "subreddit": "madisonwi", "subreddit_id": "t5_2r8rz"}, {"author": "illustriousgarb", "body": "What's a little E.coli with your dinner? Adds some flavor.\n\n/s", "created_utc": "1660610947.0", "edited": "False", "id": "ikgi7n5", "is_submitter": "False", "link_id": "t3_wpd7hg", "parent_id": "t3_wpd7hg", "score": "6", "subreddit": "ShitMomGroupsSay", "subreddit_id": "t5_gajhd"}, {"author": "illustriousgarb", "body": "Seriously, I'm gonna call all my friends snow roaches now. That's hilarious.", "created_utc": "1660525299.0", "edited": "False", "id": "ikbplr0", "is_submitter": "False", "link_id": "t3_woffn5", "parent_id": "t1_ikb2ahl", "score": "2", "subreddit": "terriblefacebookmemes", "subreddit_id": "t5_2tja6"}, {"author": "illustriousgarb", "body": "Oh for fuck's sake. I'm a vegetarian. It's not a religion, I don't need to proselytize.", "created_utc": "1660524733.0", "edited": "False", "id": "ikboebw", "is_submitter": "False", "link_id": "t3_wohvdl", "parent_id": "t3_wohvdl", "score": "9", "subreddit": "ShitMomGroupsSay", "subreddit_id": "t5_gajhd"}, {"author": "illustriousgarb", "body": "Watching YouTube videos while on your toilet is not research.", "created_utc": "1660266622.0", "edited": "False", "id": "ijxpa9n", "is_submitter": "False", "link_id": "t3_wm6kwf", "parent_id": "t3_wm6kwf", "score": "40", "subreddit": "ShitMomGroupsSay", "subreddit_id": "t5_gajhd"}, {"author": "illustriousgarb", "body": "In an ideal world, I'd love to do both, but practicality-wise yes, I agree with you. I want to be able to read museum exhibits and find my way around town and watch TV shows without needing subtitles. \n\nLet's be real, I'm a native English speaker living in the US. It's rare that I'll even get the opportunity to speak to locals in their native tongue, let alone need to be a \"fluent speaker.\" Would I like to be? Absolutely. But I'd have a better shot at using my target language by being a translator, which requires fluent understanding, but not necessarily speaking.\n\nAlso, I seem to process written words more quickly than spoken, so it makes more sense for me to prioritize understanding over speaking.", "created_utc": "1660147958.0", "edited": "False", "id": "ijqgxiz", "is_submitter": "False", "link_id": "t3_wksyqt", "parent_id": "t3_wksyqt", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "illustriousgarb", "body": "Lmfao I love when people throw a bunch of scientific words together and out themselves as the person who slept through biology.", "created_utc": "1660140819.0", "edited": "False", "id": "ijpylj9", "is_submitter": "False", "link_id": "t3_wku0if", "parent_id": "t3_wku0if", "score": "7", "subreddit": "ShitMomGroupsSay", "subreddit_id": "t5_gajhd"}, {"author": "illustriousgarb", "body": "Yup, I remember being called a \"college hippy who thought I knew everything\" by a family member because I protested. For me personally, this was where I really started getting disillusioned with my country.", "created_utc": "1660140641.0", "edited": "False", "id": "ijpy5zw", "is_submitter": "False", "link_id": "t3_wkfbar", "parent_id": "t1_ijpdi34", "score": "20", "subreddit": "terriblefacebookmemes", "subreddit_id": "t5_2tja6"}, {"author": "illustriousgarb", "body": "Another user already posted a much better answer, but yes. I was in university at the time, and our student population as a whole was vocally against the invasion. We attended huge protests in our city, and neighboring cities. I don't know how \"huge\" it was, but I remember joining a LiveJournal group that sprang up in response and we actively shared information about how to voice our dissent.\n\nThe internet and social media was still in its earlier stages at this point, so it's entirely possible that your friend didn't see a lot of this dissent, but it was absolutely there.", "created_utc": "1660140501.0", "edited": "False", "id": "ijpxtv0", "is_submitter": "False", "link_id": "t3_wkfbar", "parent_id": "t1_ijptvya", "score": "6", "subreddit": "terriblefacebookmemes", "subreddit_id": "t5_2tja6"}, {"author": "illustriousgarb", "body": "I just don't get it. My baby narrowly avoided the NICU, and as it was they were doing all sorts of extra testing to be sure she could safely go home. Things can go wrong very quickly, having help right there is much better than waiting for an ambulance. I can't imagine taking that risk with your newborn.", "created_utc": "1660139865.0", "edited": "False", "id": "ijpwap5", "is_submitter": "False", "link_id": "t3_wkuogs", "parent_id": "t3_wkuogs", "score": "12", "subreddit": "ShitMomGroupsSay", "subreddit_id": "t5_gajhd"}, {"author": "illustriousgarb", "body": "Obviously I have no idea about this family, but there's a good chance granny's also on a fixed income here. Most retired people are. \n\nEven if granny's super rich, she's not wrong.", "created_utc": "1660086476.0", "edited": "False", "id": "ijn9zog", "is_submitter": "False", "link_id": "t3_wkfm1h", "parent_id": "t3_wkfm1h", "score": "64", "subreddit": "ShitMomGroupsSay", "subreddit_id": "t5_gajhd"}, {"author": "illustriousgarb", "body": "Sanctimommies are the fucking worst. Sleep deprivation can cause literal psychosis and hallucinations. It's a major reason why people develop PPD. It's gross as hell that we normalize and even glamorize sleep deprivation and \"mommy martyrdom.\"\n\nNo. You are NOT selfish for sleep training your baby. Good sleep habits are important for everyone, including your baby. It is okay to prioritize your needs, too.", "created_utc": "1660086042.0", "edited": "False", "id": "ijn8zbl", "is_submitter": "False", "link_id": "t3_wkg2j2", "parent_id": "t3_wkg2j2", "score": "26", "subreddit": "ShitMomGroupsSay", "subreddit_id": "t5_gajhd"}, {"author": "illustriousgarb", "body": "Wait till she finds out that I actively chose not to breastfeed my second after the horror story I had trying to breastfeed with my first. Guess I was selfish for wanting my children to have a mentally healthy mother. 🤷‍♀️", "created_utc": "1660067471.0", "edited": "False", "id": "ijlx7q3", "is_submitter": "False", "link_id": "t3_wk4b13", "parent_id": "t3_wk4b13", "score": "1", "subreddit": "ShitMomGroupsSay", "subreddit_id": "t5_gajhd"}, {"author": "illustriousgarb", "body": "I absolutely hate this \"moms should give up everything for their kids\" rhetoric. You know what your kids will appreciate way more than breastmilk? A fucking healthy-as-possible parent. \n\nBREASTMILK IS JUST FOOD. It's not worth martyring yourself for.", "created_utc": "1659913593.0", "edited": "False", "id": "ijdenk2", "is_submitter": "False", "link_id": "t3_wilqj5", "parent_id": "t3_wilqj5", "score": "3", "subreddit": "ShitMomGroupsSay", "subreddit_id": "t5_gajhd"}, {"author": "illustriousgarb", "body": "Just spit balling here, but have you looked into audio engineering? You've got a lot of experience that would be helpful in this job. Voice actors, studios, indie artists, even podcasters are all often on the hunt for a good audio engineer.\n\nYou probably would need a demo of things you've done sound work on, if you don't already have one, but I imagine you could put one together pretty quickly. It might take a while to get some of the better paying clients, but they typically give you steadier work...and they won't ghost you.", "created_utc": "1659893407.0", "edited": "False", "id": "ijc1tt0", "is_submitter": "False", "link_id": "t3_wijird", "parent_id": "t3_wijird", "score": "1", "subreddit": "findapath", "subreddit_id": "t5_2wqq6"}, {"author": "illustriousgarb", "body": "It hurts me to say it, but Thai. My in-laws moved to the US from Thailand, and I've tried, but I just have so much trouble with the tonal aspect of the language. They're also totally fluent in English, and my husband and his sister don't speak Thai...so for them it's more of a novelty to practice with me, and it doesn't happen often.", "created_utc": "1659881080.0", "edited": "False", "id": "ijb8mji", "is_submitter": "False", "link_id": "t3_wi6us0", "parent_id": "t3_wi6us0", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "illustriousgarb", "body": "I'm a little surprised at some of the comments to be honest. My 7 year old just had her yearly well-child check, and the doctor still looked at her \"private area.\" She explained the whole time what was happening, that mom was right there, and that no one should touch her private area. The doctor only looked, and did not touch anything. This happens at every yearly well child check.\n\nThis is done to ensure both healthy and proper growth (early puberty is a thing and can be caught if the doctor sees pubic hair growing) and to make sure there aren't signs that your child is being sexually abused. \n\nAbsolutely, consent is important, but so are regular wellness checks.", "created_utc": "1659879018.0", "edited": "False", "id": "ijb4a9t", "is_submitter": "False", "link_id": "t3_wicoaz", "parent_id": "t3_wicoaz", "score": "1012", "subreddit": "ShitMomGroupsSay", "subreddit_id": "t5_gajhd"}, {"author": "illustriousgarb", "body": "And this is exactly why I make sure our family is as up to date on vaccines as possible. Yes sure, it sucks watching little Billy cry when he gets poked, but you know what sucks a lot more? Little Billy watching a friend or classmate get sick and/or die. Civilized people protect their vulnerable, and I cannot believe the complete narcissism of anti-vaxxers just not caring.", "created_utc": "1659878361.0", "edited": "False", "id": "ijb308m", "is_submitter": "False", "link_id": "t3_wi42hy", "parent_id": "t1_ijazha6", "score": "5", "subreddit": "ShitMomGroupsSay", "subreddit_id": "t5_gajhd"}, {"author": "illustriousgarb", "body": "I'm sorry WHAT\n\nThis has to be some form of assault. I guarantee you Erin's parents did not consent to their child ingesting your BODILY FLUIDS. Holy fuck.\n\nEDIT: okay they DEFINITELY didn't consent. I'd lose my absolute shit if someone did this to my kid.", "created_utc": "1659839519.0", "edited": "False", "id": "ij9htnm", "is_submitter": "False", "link_id": "t3_wi4h42", "parent_id": "t3_wi4h42", "score": "68", "subreddit": "ShitMomGroupsSay", "subreddit_id": "t5_gajhd"}, {"author": "illustriousgarb", "body": "My husband went to Platteville for computer science and has been gainfully employed ever since graduating. This was a while ago, though, so I'd recommend doing a bit of research into how the program is now.", "created_utc": "1659838553.0", "edited": "False", "id": "ij9fwpu", "is_submitter": "False", "link_id": "t3_wi4gcv", "parent_id": "t3_wi4gcv", "score": "18", "subreddit": "wisconsin", "subreddit_id": "t5_2qrc2"}, {"author": "illustriousgarb", "body": "Idk maybe vaccinate your kid and you won't have to be sad about him missing out on school? Bonus: you won't have to be sad about him being hospitalized for a preventable disease, either!", "created_utc": "1659838358.0", "edited": "False", "id": "ij9fit0", "is_submitter": "False", "link_id": "t3_wi42hy", "parent_id": "t3_wi42hy", "score": "168", "subreddit": "ShitMomGroupsSay", "subreddit_id": "t5_gajhd"}, {"author": "illustriousgarb", "body": "That's a really great question. Best I can tell is it appears to be local, but inspired by the Big Sur region of California. It doesn't appear to be a chain but I've only done some googling. I'm not affiliated with the restaurant at all.", "created_utc": "1659830546.0", "edited": "False", "id": "ij8zldw", "is_submitter": "True", "link_id": "t3_wi0g7h", "parent_id": "t1_ij8z5l7", "score": "1", "subreddit": "madisonwi", "subreddit_id": "t5_2r8rz"}, {"author": "illustriousgarb", "body": "Came for the cool pictures, got an interesting education on hunting. I'm not a hunter, so it's pretty neat to learn a little bit more about how it works in our state. Thanks fellow Redditors!", "created_utc": "1659820003.0", "edited": "False", "id": "ij8czw0", "is_submitter": "False", "link_id": "t3_whl5l8", "parent_id": "t3_whl5l8", "score": "2", "subreddit": "wisconsin", "subreddit_id": "t5_2qrc2"}, {"author": "illustriousgarb", "body": "My kids don't stay still long enough to bring a sharp object near their heads. I'd like to keep their eyeballs intact, Cheryl.", "created_utc": "1659819582.0", "edited": "False", "id": "ij8c18h", "is_submitter": "False", "link_id": "t3_whxna3", "parent_id": "t3_whxna3", "score": "152", "subreddit": "ShitMomGroupsSay", "subreddit_id": "t5_gajhd"}, {"author": "illustriousgarb", "body": "I 100% get that infidelity fucks with your mind. I also don't necessarily blame her for jumping to this particular fear, because people make irrational assumptions all the time.\n\nBut your second thought should absolutely be HELLO SHES 14, and I'm really, really grossed out by the commenters not bringing this up.\n\nMy hope (call me an optimist) is that the 14 year old is confiding in him about something...I mean, that would be my first guess, as an outsider. Please all deities of the universe, let that be the case.", "created_utc": "1659714178.0", "edited": "False", "id": "ij2ekct", "is_submitter": "False", "link_id": "t3_wgnosh", "parent_id": "t3_wgnosh", "score": "7", "subreddit": "ShitMomGroupsSay", "subreddit_id": "t5_gajhd"}, {"author": "illustriousgarb", "body": "For my master's thesis, I worked with an autistic child (I'll admit I have to actually stop and think to write it that way) and I was raked across the coals for not using person-first language in my first draft. I changed it all to \"child with autism.\" This was 10 years ago, mind you, but now I'm horrified to learn that this was pushed from AS. I've known about AS as a hate group for a while, but this makes me want to go back and change the wording of my thesis.\n\nThank you so much for writing this up because I learned something new and important.", "created_utc": "1659651179.0", "edited": "False", "id": "iiz5cc2", "is_submitter": "False", "link_id": "t3_wfyikn", "parent_id": "t1_iiy7dj2", "score": "2", "subreddit": "ShitMomGroupsSay", "subreddit_id": "t5_gajhd"}, {"author": "illustriousgarb", "body": "If they have availability, Ruffin It Resort is my recommendation. I definitely booked on short notice with them a few times.", "created_utc": "1659620334.0", "edited": "False", "id": "iiwxp9x", "is_submitter": "False", "link_id": "t3_wg03vt", "parent_id": "t3_wg03vt", "score": "3", "subreddit": "madisonwi", "subreddit_id": "t5_2r8rz"}, {"author": "illustriousgarb", "body": "This is actually pretty intriguing to me. So far I've only been selling stuff I no longer wear, but maybe I should look into reselling. I love shopping and having things too, but I've been trying not to buy things because I only have so much house space. Maybe reselling would help me scratch that itch.", "created_utc": "1659620077.0", "edited": "False", "id": "iiwx4l4", "is_submitter": "False", "link_id": "t3_wfqaxu", "parent_id": "t1_iivlck7", "score": "11", "subreddit": "poshmark", "subreddit_id": "t5_34hq6"}, {"author": "illustriousgarb", "body": "Holy crap. \"Don't open your legs if you're going to take medicine while pregnant!\" Geez guess I should pull out my crystal ball and make sure I'm not going to get sick, get gestational diabetes, get hurt, etc.\n\nAlso...fuck these people for implying that mothers are to blame for their child's autism.", "created_utc": "1659619294.0", "edited": "False", "id": "iiwveqs", "is_submitter": "False", "link_id": "t3_wfyikn", "parent_id": "t3_wfyikn", "score": "519", "subreddit": "ShitMomGroupsSay", "subreddit_id": "t5_gajhd"}, {"author": "illustriousgarb", "body": "I haven't managed to get to a meeting yet, but I'm going to be much more proactive about it now. I honestly didn't realize it had gotten quite this bad.", "created_utc": "1659546105.0", "edited": "False", "id": "iisys0m", "is_submitter": "False", "link_id": "t3_wf9vuw", "parent_id": "t1_iisygjx", "score": "15", "subreddit": "madisonwi", "subreddit_id": "t5_2r8rz"}, {"author": "illustriousgarb", "body": "As a parent of an MMSD student, I'm so worried. I used to be a teacher, so I get it. And when we were vetting the school district years ago, I had very frank and honest conversations with teachers I knew about the district, and they assured me that MMSD wasn't the shit show I came from. Looks like the shit show caught up with us.", "created_utc": "1659545905.0", "edited": "False", "id": "iisy99w", "is_submitter": "False", "link_id": "t3_wf9vuw", "parent_id": "t3_wf9vuw", "score": "29", "subreddit": "madisonwi", "subreddit_id": "t5_2r8rz"}, {"author": "illustriousgarb", "body": "If you're going years without sex, it's not because mom is breastfeeding.", "created_utc": "1659542510.0", "edited": "False", "id": "iispcn8", "is_submitter": "False", "link_id": "t3_wf8yqp", "parent_id": "t3_wf8yqp", "score": "684", "subreddit": "ShitMomGroupsSay", "subreddit_id": "t5_gajhd"}, {"author": "illustriousgarb", "body": "So... instead of talking to a pediatrician, which is where she really should be starting, let's perform exorcisms. Or maybe it's because vaccines. Or maybe because she didn't use pronouns in the Facebook post.", "created_utc": "1659491347.0", "edited": "False", "id": "iiq6izk", "is_submitter": "False", "link_id": "t3_wetd71", "parent_id": "t3_wetd71", "score": "987", "subreddit": "ShitMomGroupsSay", "subreddit_id": "t5_gajhd"}, {"author": "illustriousgarb", "body": "Yay this is wonderful news!!", "created_utc": "1659480988.0", "edited": "False", "id": "iipit5n", "is_submitter": "False", "link_id": "t3_wensiw", "parent_id": "t3_wensiw", "score": "7", "subreddit": "madisonwi", "subreddit_id": "t5_2r8rz"}, {"author": "illustriousgarb", "body": "I.... My first question is how in the hell are you in the mood while you're nursing? That's literally the least sexy thing I can think of.", "created_utc": "1659480921.0", "edited": "False", "id": "iipinb8", "is_submitter": "False", "link_id": "t3_wepkq2", "parent_id": "t3_wepkq2", "score": "3140", "subreddit": "ShitMomGroupsSay", "subreddit_id": "t5_gajhd"}, {"author": "illustriousgarb", "body": "I just want to send you an internet hug. I had so much breastfeeding guilt with my first because it just didn't work for us. I tried pumping and everything, and we still ended up exclusively on formula. The guilt is real.\n\nMy oldest is 7 now. She's healthy, happy, and no different than her peers. You can't tell who was breastfed and who wasn't. Be gentle with yourself. At the end of the day, formula and breast milk are both just food for your baby, and your baby is fed and growing. \n\nFormula parents are not lazy and I really wish that narrative would stop.", "created_utc": "1659354503.0", "edited": "False", "id": "iihvr2u", "is_submitter": "False", "link_id": "t3_wd98ym", "parent_id": "t1_iihprmg", "score": "11", "subreddit": "ShitMomGroupsSay", "subreddit_id": "t5_gajhd"}, {"author": "illustriousgarb", "body": "Looooool.\n\nCheck back in when they won't stay the fuck off of you for 5 minutes.", "created_utc": "1659326965.0", "edited": "False", "id": "iigvj4s", "is_submitter": "False", "link_id": "t3_wd68q4", "parent_id": "t3_wd68q4", "score": "102", "subreddit": "ShitMomGroupsSay", "subreddit_id": "t5_gajhd"}, {"author": "illustriousgarb", "body": "If I'm not mistaken, doesn't Dallas have a pretty good community theater scene? I'd start auditioning while you're there. There's also a lot of opportunities for voice actors in Texas, as some of the big dubbing studios are there. \n\nAlso, you might want to check out the job markets in your target areas. Are there a lot of openings that look appealing to you in these areas? That might help you make a decision about geographic location.\n\nI'd also like to suggest looking at the business side of entertainment for some job opportunities. If you're able to work in marketing or something for an entertainment company, it might be a good way to get insight into other aspects of the industry, which is always good for actors.", "created_utc": "1659278658.0", "edited": "False", "id": "iidxvyy", "is_submitter": "False", "link_id": "t3_wcgkqn", "parent_id": "t3_wcgkqn", "score": "2", "subreddit": "findapath", "subreddit_id": "t5_2wqq6"}, {"author": "illustriousgarb", "body": "42lolita is run by 42agent, which is a very reputable shopping service. I've personally used 42agent multiple times and I highly recommend them.", "created_utc": "1659231586.0", "edited": "False", "id": "iibviwq", "is_submitter": "False", "link_id": "t3_wccxs8", "parent_id": "t3_wccxs8", "score": "10", "subreddit": "Lolita", "subreddit_id": "t5_2sf5v"}, {"author": "illustriousgarb", "body": "In addition to above, get involved as much as you can in your local theater scene. If you're in an area with a decent theater scene, they're often looking for stitchers/dressers/wardrobe assistants who work under a costume designer. It's a good way to get a foot in the door and these positions are often paid.", "created_utc": "1659231429.0", "edited": "False", "id": "iibv7hy", "is_submitter": "False", "link_id": "t3_wcc9ey", "parent_id": "t3_wcc9ey", "score": "6", "subreddit": "findapath", "subreddit_id": "t5_2wqq6"}, {"author": "illustriousgarb", "body": "Ugh OP, I'm sorry. I'm a drinker who is married to a non-drinker. I promise there are partners out there who won't be shitty about your choice to abstain from alcohol.", "created_utc": "1659227026.0", "edited": "False", "id": "iibm5zf", "is_submitter": "False", "link_id": "t3_wc6ig2", "parent_id": "t3_wc6ig2", "score": "1", "subreddit": "mildlyinfuriating", "subreddit_id": "t5_2ubgg"}, {"author": "illustriousgarb", "body": "Thiiiiiiiiis! Doulas are support people, not providers. Far too many of them fancy themselves to be capable of practicing way out of their scope. Doulas are important for some people, but stay in your lane.", "created_utc": "1659226815.0", "edited": "False", "id": "iiblqfz", "is_submitter": "False", "link_id": "t3_wc9ha4", "parent_id": "t1_iibakzn", "score": "332", "subreddit": "ShitMomGroupsSay", "subreddit_id": "t5_gajhd"}, {"author": "illustriousgarb", "body": "I just flew internationally earlier this month. I'd definitely do at least 2.5 hours if not the full three. Right now, airports and airlines are really struggling with staffing issues, especially since travel volume is higher than they expected for this summer.\n\nAnd for your return trip, I'd definitely do the full 3. It took us nearly an hour to go through passport control during a 2.5 hour layover, and we barely made our flight. Don't risk missing an international flight.", "created_utc": "1659226408.0", "edited": "False", "id": "iibkwq1", "is_submitter": "False", "link_id": "t3_wc1yud", "parent_id": "t3_wc1yud", "score": "1", "subreddit": "travel", "subreddit_id": "t5_2qh41"}, {"author": "illustriousgarb", "body": "I drink, but my husband doesn't. There's a lot to do that doesn't involve drinking honestly. It kind of depends on what you're into. My husband is a big gamer and enjoys a fair amount of the Wisconsin social scene.\n\nLots of outdoor activities in the summer and winter alike, plenty of artsy stuff especially in the bigger cities. I think it's a bit harder to find social activities that aren't centered around alcohol in the rural areas, but they definitely exist.\n\nHonestly even the festivals centered around beer often have special pricing or free admission for the DD, with non-alcoholic beverage options. Many breweries have non-alcoholic beverages if you want to socialize with people who are drinking.\n\nI know Wisconsin has a reputation of being blitzed all the time, but there really are a lot of non-drinkers in this state, and most decent people will be respectful of your choice to not drink.", "created_utc": "1659218970.0", "edited": "False", "id": "iib5d9c", "is_submitter": "False", "link_id": "t3_wc8eew", "parent_id": "t3_wc8eew", "score": "9", "subreddit": "wisconsin", "subreddit_id": "t5_2qrc2"}, {"author": "illustriousgarb", "body": "You can learn a fair amount from Duolingo.\n\nI've actually learned quite a bit of new vocabulary and some grammar from it. Am I going to get fluent with it? Nah, but the gamification keeps me motivated to do it every day, and then I feel like I can grasp a few more things when I'm doing my immersion stuff.", "created_utc": "1659210719.0", "edited": "False", "id": "iiamxcc", "is_submitter": "False", "link_id": "t3_wc1nl4", "parent_id": "t3_wc1nl4", "score": "238", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "illustriousgarb", "body": "On the next episode of Snapped....", "created_utc": "1659210353.0", "edited": "False", "id": "iiam3y7", "is_submitter": "False", "link_id": "t3_wc2u8k", "parent_id": "t3_wc2u8k", "score": "4", "subreddit": "ShitMomGroupsSay", "subreddit_id": "t5_gajhd"}, {"author": "illustriousgarb", "body": "I'm not exactly sure what she wants us to tell her here. Your man is trash. Get rid of him.", "created_utc": "1659105060.0", "edited": "False", "id": "ii4r61z", "is_submitter": "False", "link_id": "t3_wb4vwt", "parent_id": "t3_wb4vwt", "score": "34", "subreddit": "ShitMomGroupsSay", "subreddit_id": "t5_gajhd"}, {"author": "illustriousgarb", "body": "This narrative of \"doctors just want to get to a golf game\" needs to fucking stop. I'm sure there are shitty providers out there who do this, but the absolute vast majority of doctors and nurses just want us to walk out of the delivery room alive and as unscathed as possible.", "created_utc": "1659099155.0", "edited": "False", "id": "ii4dr6k", "is_submitter": "False", "link_id": "t3_wap396", "parent_id": "t1_ii2ohy0", "score": "15", "subreddit": "ShitMomGroupsSay", "subreddit_id": "t5_gajhd"}, {"author": "illustriousgarb", "body": "Babies have digestive systems. Hence, gas is going to happen. If you're worried about their farts as babies, I've got bad news about their older years for you.", "created_utc": "1659025751.0", "edited": "False", "id": "ii0bjcu", "is_submitter": "False", "link_id": "t3_wactg4", "parent_id": "t3_wactg4", "score": "37", "subreddit": "ShitMomGroupsSay", "subreddit_id": "t5_gajhd"}, {"author": "illustriousgarb", "body": "Thank you for answering my question, and I'm so sorry for the further strain this is putting on providers.", "created_utc": "1659025322.0", "edited": "False", "id": "ii0aekl", "is_submitter": "False", "link_id": "t3_w9rk9c", "parent_id": "t1_ii09tyu", "score": "3", "subreddit": "wisconsin", "subreddit_id": "t5_2qrc2"}, {"author": "illustriousgarb", "body": "Just out of curiosity - does this include abortions for reasons of miscarriage (D&C). I'm certain I know the answer, but I'd like to hear it from an actual provider.", "created_utc": "1659023635.0", "edited": "False", "id": "ii05z51", "is_submitter": "False", "link_id": "t3_w9rk9c", "parent_id": "t1_ihzplav", "score": "5", "subreddit": "wisconsin", "subreddit_id": "t5_2qrc2"}, {"author": "illustriousgarb", "body": "Pure blood?? Is this a Harry Potter fanfiction? Wtf. These people are bananas.\n\nAt least one sane person said to go to the hospital.", "created_utc": "1658924991.0", "edited": "False", "id": "ihudvdo", "is_submitter": "False", "link_id": "t3_w9cnhz", "parent_id": "t3_w9cnhz", "score": "889", "subreddit": "ShitMomGroupsSay", "subreddit_id": "t5_gajhd"}, {"author": "illustriousgarb", "body": "Oh there are so many red flags here. There's a huge difference between culture differences in attitudes towards nudity and the things this 5 year old is saying. These kids need to see a therapist asap.", "created_utc": "1658877041.0", "edited": "False", "id": "ihs40c6", "is_submitter": "False", "link_id": "t3_w8ry1o", "parent_id": "t3_w8ry1o", "score": "8", "subreddit": "ShitMomGroupsSay", "subreddit_id": "t5_gajhd"}, {"author": "illustriousgarb", "body": "Sounds like a shill for Big Cancer.\n\nFor real though, friends, please get your preventative care. I know far too many people who have had serious cancers at young ages.", "created_utc": "1658803043.0", "edited": "False", "id": "ihnyfv7", "is_submitter": "False", "link_id": "t3_w87q1r", "parent_id": "t3_w87q1r", "score": "189", "subreddit": "ShitMomGroupsSay", "subreddit_id": "t5_gajhd"}, {"author": "illustriousgarb", "body": "I'm studying Japanese by myself. I lived in Japan for a while and made several friends who I'm still in touch with. Additionally, I consume a fair amount of Japanese content through social media, film, etc... So this is what keeps me motivated. I used to be really obsessed with passing the various JLPT levels, but I found that studying for those actually had a de-motivational effect, as I'm not going for any jobs at the moment. I'm just kind of letting myself learn it leisurely, and oddly enough I feel like I'm learning more this way.", "created_utc": "1658802511.0", "edited": "False", "id": "ihnxa9i", "is_submitter": "False", "link_id": "t3_w7ysfv", "parent_id": "t3_w7ysfv", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "illustriousgarb", "body": "Publicly shaming your child is a great way to ensure they never speak to you again.\n\nGuarantee you in five years this mom will be upset that her daughter doesn't come home for the holidays.", "created_utc": "1658797319.0", "edited": "False", "id": "ihnlmto", "is_submitter": "False", "link_id": "t3_w824og", "parent_id": "t3_w824og", "score": "59", "subreddit": "ShitMomGroupsSay", "subreddit_id": "t5_gajhd"}, {"author": "illustriousgarb", "body": "Okay first off, \"smacking upside the head\" and \"yanking her ponytail\" is not spanking. Second of all abuse is abuse no matter how you frame it.\n\nGee Brenda, I wonder why she won't speak to you.", "created_utc": "1658795378.0", "edited": "False", "id": "ihnhaxv", "is_submitter": "False", "link_id": "t3_w82134", "parent_id": "t3_w82134", "score": "153", "subreddit": "ShitMomGroupsSay", "subreddit_id": "t5_gajhd"}, {"author": "illustriousgarb", "body": "The one I was talked into was not. The ped didn't want to do it but an LC pushed me into it. It was a whole thing and I regret it.", "created_utc": "1658794427.0", "edited": "False", "id": "ihnf65b", "is_submitter": "False", "link_id": "t3_w83258", "parent_id": "t1_ihnevgp", "score": "1", "subreddit": "ShitMomGroupsSay", "subreddit_id": "t5_gajhd"}, {"author": "illustriousgarb", "body": "This horrifies me! I have girls but before we knew what they'd be assigned at birth, the doctor, my husband, and I agreed it would not be something we'd do unless medically indicated.\n\nUnfortunately I got talked into an unnecessary \"tongue tie clip\" procedure though, so I get particularly mad when doctors prey on the parents of newborns.\n\nEdit: since it's apparently unclear and I don't feel like reliving my medical trauma, my point was that it's easy to get talked into unnecessary things when you're sleep deprived/emotional and medical personnel should be careful about that.", "created_utc": "1658793881.0", "edited": "1658798973.0", "id": "ihndy5c", "is_submitter": "False", "link_id": "t3_w83258", "parent_id": "t1_ihnb93a", "score": "3", "subreddit": "ShitMomGroupsSay", "subreddit_id": "t5_gajhd"}, {"author": "illustriousgarb", "body": "Right? Like what the fuck \"make sure it's bare after\" it's not a God damned shave.", "created_utc": "1658793632.0", "edited": "False", "id": "ihnddtt", "is_submitter": "False", "link_id": "t3_w83258", "parent_id": "t1_ihn78bz", "score": "96", "subreddit": "ShitMomGroupsSay", "subreddit_id": "t5_gajhd"}, {"author": "illustriousgarb", "body": "I'm turning 40 next month. Most of my language learning occurred after I was 18, because I had the opportunity to learn more than what was offered in US public schools (spoiler: not much).\n\nLearning a new language requires interest in said language. People learn them for all reasons. My MIL didn't speak a word of English when she moved here in her 20's. The only way you'd know she wasn't a native speaker now is because she'll tell you. She's in her late 60's and is just now starting to learn a third language because she spends a lot of time with speakers of that language. \n\nIt's not harder to learn languages as an adult. In fact, you often have more motivation and opportunity to do so.", "created_utc": "1658767006.0", "edited": "False", "id": "ihlhmqm", "is_submitter": "False", "link_id": "t3_w7swep", "parent_id": "t3_w7swep", "score": "5", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "illustriousgarb", "body": "She's...she's 17. She's a teenager. She's gonna do shit you don't like, often just to piss you off. Maybe start acting like the parent you're supposed to be and show her a bit of unconditional love??\n\nJesus these people.", "created_utc": "1658671684.0", "edited": "False", "id": "ihg73eu", "is_submitter": "False", "link_id": "t3_w6oo57", "parent_id": "t3_w6oo57", "score": "171", "subreddit": "ShitMomGroupsSay", "subreddit_id": "t5_gajhd"}, {"author": "illustriousgarb", "body": "My grandmother smoked through her whole pregnancy with my mom, too. This was back before they knew better. My mother was born almost 2 months prematurely and had to spend the first few weeks of her life in an incubator, and my grandparents couldn't hold her. She had so many allergies as a child that she had to get all sorts of shots to make sure she could breathe.\n\nMy mother is now in her late 60s and has had lifelong problems with her lungs. This made the pandemic extra terrifying for us. My grandmother is no longer with us, but she carried that trauma and guilt surrounding my mom's birth and childhood with her for the rest of her life. \n\nIf her child truly is \"as healthy as an ox,\" which I highly doubt, then she needs to get down on her knees and thank every deity in the universe.", "created_utc": "1658578473.0", "edited": "False", "id": "ihbbi1p", "is_submitter": "False", "link_id": "t3_w5i0nh", "parent_id": "t3_w5i0nh", "score": "5", "subreddit": "ShitMomGroupsSay", "subreddit_id": "t5_gajhd"}, {"author": "illustriousgarb", "body": "I'm very sad to see them go. I was really hoping the sale would go through and they'd bounce back. Such a bummer.", "created_utc": "1658540477.0", "edited": "False", "id": "ih9pdxp", "is_submitter": "False", "link_id": "t3_w5oot0", "parent_id": "t3_w5oot0", "score": "3", "subreddit": "madisonwi", "subreddit_id": "t5_2r8rz"}, {"author": "illustriousgarb", "body": "I'm very sensitive to gore, so GoT is not a series I watch...but seriously, you're worried about the SEX and not all the horrifically graphic violence????", "created_utc": "1658523465.0", "edited": "False", "id": "ih8mtt6", "is_submitter": "False", "link_id": "t3_w56wsd", "parent_id": "t3_w56wsd", "score": "2", "subreddit": "ShitMomGroupsSay", "subreddit_id": "t5_gajhd"}, {"author": "illustriousgarb", "body": "It's not narcissistic at all. I'd love to have a recording from my grandparents telling me they loved me, and I know having something like this from my parents would be wonderful. Do it, even if they don't look at it for another 50+ years, it'll mean something.", "created_utc": "1658523163.0", "edited": "False", "id": "ih8m22y", "is_submitter": "False", "link_id": "t3_w5fhgv", "parent_id": "t1_ih8ila1", "score": "43", "subreddit": "ShitMomGroupsSay", "subreddit_id": "t5_gajhd"}, {"author": "illustriousgarb", "body": "In the past few months, I've lost my PCP, my therapist, my kids' PCP, and my husband's PCP. Apparently my kids' doctor has chosen not to practice anymore, and my therapist chose to retire early. In a non-UW system where turnover used to be pretty rare. I'm genuinely worried about our health care professionals, and by extension, the future of our care.", "created_utc": "1658522735.0", "edited": "False", "id": "ih8kydz", "is_submitter": "False", "link_id": "t3_w5cj21", "parent_id": "t1_ih7jeln", "score": "11", "subreddit": "madisonwi", "subreddit_id": "t5_2r8rz"}, {"author": "illustriousgarb", "body": "So many of these types don't understand that we're all only one misfortune away from being those vulnerable ourselves. It's horrifying that they live among us.", "created_utc": "1658522267.0", "edited": "False", "id": "ih8jr56", "is_submitter": "False", "link_id": "t3_w5cj21", "parent_id": "t1_ih7y74z", "score": "12", "subreddit": "madisonwi", "subreddit_id": "t5_2r8rz"}, {"author": "illustriousgarb", "body": "Thank you. I got my rainbow babies and I'm okay now. But it makes me so mad that others in my shoes might have to jump through even more hoops because a bunch of anti-choice people fancy themselves the dictators of uteruses.", "created_utc": "1658425827.0", "edited": "False", "id": "ih2va2z", "is_submitter": "False", "link_id": "t3_w4iw91", "parent_id": "t1_ih2twcx", "score": "9", "subreddit": "wisconsin", "subreddit_id": "t5_2qrc2"}, {"author": "illustriousgarb", "body": "I'm glad he thinks that the abortion I needed (to resolve a god damn miscarriage, a pregnancy that I WANTED) isn't a \"big issue.\"\n\nFRJ.", "created_utc": "1658423338.0", "edited": "False", "id": "ih2okkq", "is_submitter": "False", "link_id": "t3_w4iw91", "parent_id": "t3_w4iw91", "score": "15", "subreddit": "wisconsin", "subreddit_id": "t5_2qrc2"}, {"author": "illustriousgarb", "body": "Holy shit. I'm so glad this wasn't as pervasive when I was naively spending time in these mom groups.", "created_utc": "1658423131.0", "edited": "False", "id": "ih2o0l3", "is_submitter": "False", "link_id": "t3_w4hh5t", "parent_id": "t3_w4hh5t", "score": "5", "subreddit": "ShitMomGroupsSay", "subreddit_id": "t5_gajhd"}, {"author": "illustriousgarb", "body": "This is the reason I love this city.", "created_utc": "1658422273.0", "edited": "False", "id": "ih2loyw", "is_submitter": "False", "link_id": "t3_w47grd", "parent_id": "t3_w47grd", "score": "3", "subreddit": "madisonwi", "subreddit_id": "t5_2r8rz"}, {"author": "illustriousgarb", "body": "I hate this! Yes, I'm a mom, but I'm also a human with a name. Unless you're my kid, use my actual name.", "created_utc": "1658334278.0", "edited": "False", "id": "igxnsjh", "is_submitter": "False", "link_id": "t3_w3faiz", "parent_id": "t1_igxbwhh", "score": "53", "subreddit": "ShitMomGroupsSay", "subreddit_id": "t5_gajhd"}, {"author": "illustriousgarb", "body": "Good grief, these people act so desperate to \"prove doctors wrong.\" Idk I'm gonna trust the person who dedicated their life to 8+ years of education, residency, etc over randos on the Internet.", "created_utc": "1658333851.0", "edited": "False", "id": "igxmnjs", "is_submitter": "False", "link_id": "t3_w33bin", "parent_id": "t3_w33bin", "score": "1", "subreddit": "ShitMomGroupsSay", "subreddit_id": "t5_gajhd"}, {"author": "illustriousgarb", "body": "I love this!!! What a great comic, thank you for sharing.", "created_utc": "1657770928.0", "edited": "False", "id": "ig32uwm", "is_submitter": "False", "link_id": "t3_vxzhue", "parent_id": "t3_vxzhue", "score": "2", "subreddit": "DotHack", "subreddit_id": "t5_2sgry"}, {"author": "illustriousgarb", "body": "When you realize you hit \"reply all\"", "created_utc": "1654311439.0", "edited": "False", "id": "ib3ysh1", "is_submitter": "False", "link_id": "t3_v44l5o", "parent_id": "t3_v44l5o", "score": "5", "subreddit": "miraculousladybug", "subreddit_id": "t5_39tdz"}, {"author": "illustriousgarb", "body": "Mmm, maybe, but I think it would be difficult to speculate as to what, if she did. They didn't really address, *why* Sabine changed her name, just that she did. It's possible that she wanted to appear \"less foreign\" (very much a thing for immigrants in all countries), and in that case she probably wouldn't have given Marinette a name in Mandarin.\n\nFor context, my husband's parents emigrated to the US from Thailand in the 70s. Years later, they had two kids. They elected to give their kids typical American names because they worried about how the kids would be perceived with their clearly-not-European last name. My gut would say that Sabine probably did something similar.\n\nIt could also be that she's waiting for Marinette to show interest in wanting a Mandarin name. Her parents did allude to the fact that they hoped she'd take an interest in her family history in the Shanghai special. \n\nRegardless, I have no idea what it could be, so I have no speculations. :)", "created_utc": "1650151173.0", "edited": "False", "id": "i50m1rr", "is_submitter": "False", "link_id": "t3_u56zvb", "parent_id": "t3_u56zvb", "score": "5", "subreddit": "miraculousladybug", "subreddit_id": "t5_39tdz"}, {"author": "illustriousgarb", "body": "This is fantastic news. For both fans and VAs. Great work everyone!", "created_utc": "1648934073.0", "edited": "False", "id": "i35heu1", "is_submitter": "False", "link_id": "t3_tuoyvk", "parent_id": "t3_tuoyvk", "score": "4", "subreddit": "miraculousladybug", "subreddit_id": "t5_39tdz"}, {"author": "illustriousgarb", "body": "The whole season finale, but especially that final scene. I really thought the season would end with a big fight between LB/CN, or with a reveal of Shadow Moth's identity. \n\nI was wrooooong and I love it.", "created_utc": "1648655753.0", "edited": "False", "id": "i2q8x26", "is_submitter": "False", "link_id": "t3_trw76e", "parent_id": "t3_trw76e", "score": "3", "subreddit": "miraculousladybug", "subreddit_id": "t5_39tdz"}, {"author": "illustriousgarb", "body": "Oh I love your style! It's super cute, thanks for sharing!", "created_utc": "1648655494.0", "edited": "False", "id": "i2q8a0q", "is_submitter": "False", "link_id": "t3_ts82bf", "parent_id": "t3_ts82bf", "score": "7", "subreddit": "miraculousladybug", "subreddit_id": "t5_39tdz"}, {"author": "illustriousgarb", "body": "I'm happy to hear this. SAMG's animation is beautiful.", "created_utc": "1648655309.0", "edited": "False", "id": "i2q7tka", "is_submitter": "False", "link_id": "t3_ts4x1o", "parent_id": "t3_ts4x1o", "score": "6", "subreddit": "miraculousladybug", "subreddit_id": "t5_39tdz"}, {"author": "illustriousgarb", "body": "I literally snorted out loud. Thank you for this.", "created_utc": "1648655255.0", "edited": "False", "id": "i2q7ou8", "is_submitter": "False", "link_id": "t3_ts4x1o", "parent_id": "t1_i2pkm6k", "score": "13", "subreddit": "miraculousladybug", "subreddit_id": "t5_39tdz"}, {"author": "illustriousgarb", "body": "Most dubbing work is not done through a union. This is actually a hot topic of discussion at the moment in the voice acting community, as many actors are pushing for it.\n\nDub work is unfortunately one of the lower paying gigs out there.", "created_utc": "1648615053.0", "edited": "False", "id": "i2oe90a", "is_submitter": "False", "link_id": "t3_tprzax", "parent_id": "t1_i2e4c3d", "score": "2", "subreddit": "miraculousladybug", "subreddit_id": "t5_39tdz"}, {"author": "illustriousgarb", "body": "I do not know where the money comes from, as I stated in the section you quoted. I suggested contacting Disney, because they currently hold the rights, and also have some hand in production, as they are named as such in the opening credits. Disney may have been more likely to get something done. \n\nEither way it's a moot point as the update indicates that Zag is on the case.", "created_utc": "1648513687.0", "edited": "False", "id": "i2i70k7", "is_submitter": "False", "link_id": "t3_tprzax", "parent_id": "t1_i2i665l", "score": "3", "subreddit": "miraculousladybug", "subreddit_id": "t5_39tdz"}, {"author": "illustriousgarb", "body": "When I appreciate your perspective, I respectfully disagree. Yes, this is a show aimed at children. However, that does not excuse the studio from paying fair wages, and threatening to recast people when they ask to be paid fairly.\n\nDubbing is the poorest paying type of voice acting. It's also extremely competitive, and studios use this knowledge to pay their actors as little as possible. And honestly, that's terrible, because it requires an immense amount of skill to act while also timing your lines to the lip flaps and cold reading a script. I've had incidents where the script has had to be re-written on the spot because the dialogue doesn't match the lip flaps, and I've just gotta roll with it.\n\nAdd this in with the fact that animation dubbing studios are often located in LA or Dallas/Houston, both of which have a high cost of living, and you have to live local if you want to be considered for roles. Most of us aren't dubbing for the money, but for the love of the craft. Unfortunately, love doesn't pay the bills.\n\nThe work of artists is consistently undervalued, and people should be paid fairly for their work. Sometimes you have to walk away from a great role because the studio won't pay what you're worth. Maybe it will finally spur the industry into paying their actors better.", "created_utc": "1648484554.0", "edited": "False", "id": "i2gcp6i", "is_submitter": "False", "link_id": "t3_tprzax", "parent_id": "t1_i2ek4q4", "score": "14", "subreddit": "miraculousladybug", "subreddit_id": "t5_39tdz"}, {"author": "illustriousgarb", "body": "There's a pretty big push from the voice acting community not to take these roles. Something similar happened with John DiMaggio - they were going to recast Bender because of pay - and between fan outrage, VAs refusing to audition for the role, and possibly internal pressure, they worked something out.\n\nLet's hope this happens for these actors as well. That's a lot of recasts to deal with, and now that it's public knowledge why - hopefully there's some better contacts being written.", "created_utc": "1648420020.0", "edited": "False", "id": "i2d89xc", "is_submitter": "False", "link_id": "t3_tprzax", "parent_id": "t1_i2cuo1u", "score": "63", "subreddit": "miraculousladybug", "subreddit_id": "t5_39tdz"}, {"author": "illustriousgarb", "body": "I wrote this in another thread, but it's worth putting here too:\n\nI'm a semi-pro voice actor, and I do live action dubbing.  Often, the pay itself comes from the dubbing studio, not necessarily the overall production company. Be careful about who you get mad at here.\n\nI don't know who pays the Miraculous VAs. Depending on contracts, Zag may have zero control over the pay of the voice actors. It's certainly worth bringing this to Zag's attention, but since Disney owns the rights in the US, it's probably going to be better to contact Disney to express your disappointment in the treatment of the cast (and likely the crew too).\n\nI'm so happy to see many of you wanting fair pay for voice actors. Please make sure you're being respectful when taking action about this. Hateful behavior and threats will not get actors rehired for better pay, which is ultimately what the goal is here.", "created_utc": "1648417139.0", "edited": "False", "id": "i2d2cqk", "is_submitter": "False", "link_id": "t3_tprzax", "parent_id": "t3_tprzax", "score": "128", "subreddit": "miraculousladybug", "subreddit_id": "t5_39tdz"}, {"author": "illustriousgarb", "body": "Hey friends, I'm a semi-pro voice actor who does some live action dubbing. I just want to point out that when it comes to dubbing work, your pay often comes from the dubbing studio itself. Zag may have zero control over this, depending on what contracts are involved with the US dubbing studio.\n\nI'm all for getting them to pay voice actors (and really all production staff) a fair wage, just be careful about where you're directing your anger here.\n\nAs for how to help? Express your displeasure (RESPECTFULLY please, you won't get people rehired by being hateful) to the people who control the production here. Since Disney owns the rights in the US, that's a pretty good place to start. \n\n[This article](https://wegotthiscovered.com/featured/anime-has-never-been-bigger-so-why-are-voice-actors-struggling-to-get-by/?fbclid=IwAR3gWnD6DRS07zxOR_Iggv8bpMoMokvl47Q4l8M0wNRRMQQAv62bPIQQqns) is more focused on anime, but it addresses many of the issues with low pay in dub work, which is unfortunately true whether you're working on animation or live action.", "created_utc": "1648416215.0", "edited": "False", "id": "i2d0f5q", "is_submitter": "False", "link_id": "t3_tphs4i", "parent_id": "t3_tphs4i", "score": "12", "subreddit": "miraculousladybug", "subreddit_id": "t5_39tdz"}, {"author": "illustriousgarb", "body": "Adrien knooooows\n\nHe knows Felix is the one who betrayed Ladybug. He's gonna figure out that Gabriel is Hawkmoth.\n\nPoor kitty is gonna figure out that his daddy's a jerkface.", "created_utc": "1647146629.0", "edited": "False", "id": "i0gghgh", "is_submitter": "False", "link_id": "t3_tbap1t", "parent_id": "t3_tbap1t", "score": "6", "subreddit": "miraculousladybug", "subreddit_id": "t5_39tdz"}, {"author": "illustriousgarb", "body": "Millions of women died in childbirth during history, but I'm totally not going to believe this midwife.", "created_utc": "1645292924.0", "edited": "False", "id": "hxlocyh", "is_submitter": "False", "link_id": "t3_swdjff", "parent_id": "t3_swdjff", "score": "13", "subreddit": "ShitMomGroupsSay", "subreddit_id": "t5_gajhd"}, {"author": "illustriousgarb", "body": "Gee, a man worried about his stepdaughter and grandchild. \"Ugh, why do my parents care about our safety?\"", "created_utc": "1643906512.0", "edited": "False", "id": "hvftcvn", "is_submitter": "False", "link_id": "t3_sjfrtd", "parent_id": "t3_sjfrtd", "score": "65", "subreddit": "ShitMomGroupsSay", "subreddit_id": "t5_gajhd"}, {"author": "illustriousgarb", "body": "God also gave us brains and doctors. Use them.", "created_utc": "1643837511.0", "edited": "False", "id": "hvby39g", "is_submitter": "False", "link_id": "t3_sixpl3", "parent_id": "t3_sixpl3", "score": "10", "subreddit": "ShitMomGroupsSay", "subreddit_id": "t5_gajhd"}, {"author": "illustriousgarb", "body": "Uh I live in a place where we have public health warnings because the wind chill gets so cold. My kids are going to wear a coat, thanks.\n\nMy kids would also go days without brushing their teeth if I let them. Still gonna make them brush their teeth. Their brains aren't fully formed yet, so maybe as a parent, it's indeed my responsibility to sometimes make them do things they don't want to do, for their own health and safety.", "created_utc": "1643837331.0", "edited": "False", "id": "hvbxla3", "is_submitter": "False", "link_id": "t3_sixlaz", "parent_id": "t3_sixlaz", "score": "11", "subreddit": "ShitMomGroupsSay", "subreddit_id": "t5_gajhd"}, {"author": "illustriousgarb", "body": "Lmao this sub isn't anti-work. It's anti-exploitation.", "created_utc": "1642697486.0", "edited": "False", "id": "hth8bbv", "is_submitter": "False", "link_id": "t3_s8jc02", "parent_id": "t3_s8jc02", "score": "1", "subreddit": "antiwork", "subreddit_id": "t5_2y77d"}, {"author": "illustriousgarb", "body": "I started learning it for the anime. I then fell in love with the culture and moved there. Now I study it to communicate with my friends and read native texts.", "created_utc": "1641704733.0", "edited": "False", "id": "hrvkkq2", "is_submitter": "False", "link_id": "t3_rzbvjg", "parent_id": "t3_rzbvjg", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "illustriousgarb", "body": "Freaking same.", "created_utc": "1641504285.0", "edited": "False", "id": "hrjnzme", "is_submitter": "False", "link_id": "t3_rxltsw", "parent_id": "t1_hrj2ayq", "score": "8", "subreddit": "madisonwi", "subreddit_id": "t5_2r8rz"}, {"author": "illustriousgarb", "body": "I understand the staffing issues. I'm a former teacher myself. I get it. \n\nBut damn it my kids also need some freaking stability  and this back and forth about whether they'll be virtual or not is so frustrating. It would have made more sense to just take the whole week off rather than making teachers spend 3 days creating two days of work.", "created_utc": "1641504265.0", "edited": "False", "id": "hrjnxoh", "is_submitter": "False", "link_id": "t3_rxltsw", "parent_id": "t3_rxltsw", "score": "66", "subreddit": "madisonwi", "subreddit_id": "t5_2r8rz"}, {"author": "illustriousgarb", "body": "Same here. I toyed with the idea of signing up for the sub pool. Former teacher, Master's Degree, specialized in special needs....not worth it.", "created_utc": "1641503960.0", "edited": "False", "id": "hrjn3wj", "is_submitter": "False", "link_id": "t3_rxd6kd", "parent_id": "t1_hrhww7m", "score": "3", "subreddit": "madisonwi", "subreddit_id": "t5_2r8rz"}, {"author": "illustriousgarb", "body": "I hate it. I don't want to return to virtual learning for my first grader, it's going to be a shitshow just like last year.\n\nBut, I am also very thankful that the district is taking the health of our children and the educational staff's health seriously. Yea, it sucks but this is reality and my kid will catch up. We'll be okay.\n\nI really feel for working parents, though. It's very difficult to get childcare on short notice in the best of times.", "created_utc": "1640923686.0", "edited": "False", "id": "hqn31jd", "is_submitter": "False", "link_id": "t3_rsfd9t", "parent_id": "t3_rsfd9t", "score": "10", "subreddit": "madisonwi", "subreddit_id": "t5_2r8rz"}, {"author": "illustriousgarb", "body": "Unsurprising, unfortunately. If I hadn't already quit my job due to childcare costs, I would have absolutely had to during the pandemic. My job couldn't have been done remotely, and they definitely wouldn't have given me the necessary time off to help my kindergartener with virtual learning.", "created_utc": "1640658076.0", "edited": "False", "id": "hq85v6y", "is_submitter": "False", "link_id": "t3_rpqora", "parent_id": "t3_rpqora", "score": "8", "subreddit": "wisconsin", "subreddit_id": "t5_2qrc2"}, {"author": "illustriousgarb", "body": "I don't know that I've found my calling per se, but I've found \\*a\\* path, which is just accepting that I have many interests. I encourage everyone to try anything they're remotely interested in. \n\nOne of the silver linings of the pandemic is that many places are offering virtual lessons, or video sneak peeks. If something looks interesting, take a class! Watch a video on the subject. You never know what will spark passion until you try it.", "created_utc": "1640096876.0", "edited": "False", "id": "hpfe6xq", "is_submitter": "False", "link_id": "t3_rlcfij", "parent_id": "t3_rlcfij", "score": "12", "subreddit": "findapath", "subreddit_id": "t5_2wqq6"}, {"author": "illustriousgarb", "body": "Ephemeral was a great episode and I'm not sorry.🤷", "created_utc": "1639340450.0", "edited": "False", "id": "hoag50r", "is_submitter": "False", "link_id": "t3_rerq5o", "parent_id": "t3_rerq5o", "score": "1", "subreddit": "miraculousladybug", "subreddit_id": "t5_39tdz"}, {"author": "illustriousgarb", "body": "Yup. Too bad he wasn't faster.", "created_utc": "1639194926.0", "edited": "False", "id": "ho2ujik", "is_submitter": "False", "link_id": "t3_rdkfx8", "parent_id": "t3_rdkfx8", "score": "1", "subreddit": "miraculousladybug", "subreddit_id": "t5_39tdz"}, {"author": "illustriousgarb", "body": "As someone who is married with kids - you don't sacrifice your kids' happiness to bring back your spouse. That's not love at all.", "created_utc": "1639021400.0", "edited": "False", "id": "hnt5zfv", "is_submitter": "False", "link_id": "t3_rbelfh", "parent_id": "t3_rbelfh", "score": "2", "subreddit": "miraculousladybug", "subreddit_id": "t5_39tdz"}, {"author": "illustriousgarb", "body": ">I can say that the only thing about Adrien which he cares of is that his son is alive.\n\nThis really struck me. I am reminded of Valkyrie Profile 2, in which one of the main protagonists was created to be a \"vessel\" for the main villain. I don't think the Adrien/Gabriel relationship is quite that dark, but it's got me thinking.", "created_utc": "1639021155.0", "edited": "False", "id": "hnt5ha8", "is_submitter": "False", "link_id": "t3_rbelfh", "parent_id": "t1_hnozr7y", "score": "2", "subreddit": "miraculousladybug", "subreddit_id": "t5_39tdz"}, {"author": "illustriousgarb", "body": "I think the best candidate so far is Lila. She \\*hates\\* Ladybug. Felix seems to just hate Gabriel (gosh I hope he's part of the defeat of Shadowmoth) and Chloe is...well Chloe. She might hate Ladybug right now, but I don't think her anger is enough to turn her into a full-blown villain. I honestly think she'll eventually become a semi-decent human being with the help of Zoe, but that's a story for another time.", "created_utc": "1638589061.0", "edited": "False", "id": "hn5jhh4", "is_submitter": "False", "link_id": "t3_r8ckx0", "parent_id": "t3_r8ckx0", "score": "56", "subreddit": "miraculousladybug", "subreddit_id": "t5_39tdz"}, {"author": "illustriousgarb", "body": "Tell me you haven't watched this show without telling me you haven't watched it.\n\nIt's literally a doctor who takes care of stuffed animals. There's no \"girly\" aspect of it other than the protagonist being female.\n\nThis is why I have no mom friends.", "created_utc": "1638072560.0", "edited": "False", "id": "hmd064k", "is_submitter": "False", "link_id": "t3_r3rzua", "parent_id": "t3_r3rzua", "score": "76", "subreddit": "ShitMomGroupsSay", "subreddit_id": "t5_gajhd"}, {"author": "illustriousgarb", "body": "Ephemeral was a great episode. It wasn't \"just filler,\" there were several important plot points addressed.", "created_utc": "1638071558.0", "edited": "False", "id": "hmcy86s", "is_submitter": "False", "link_id": "t3_r3lovo", "parent_id": "t3_r3lovo", "score": "2", "subreddit": "miraculousladybug", "subreddit_id": "t5_39tdz"}, {"author": "illustriousgarb", "body": "Shoving things where they don't belong sounds like a great way to get other infections, though.", "created_utc": "1635697556.0", "edited": "1635698556.0", "id": "his2e8h", "is_submitter": "False", "link_id": "t3_qjpizo", "parent_id": "t3_qjpizo", "score": "10", "subreddit": "ShitMomGroupsSay", "subreddit_id": "t5_gajhd"}, {"author": "illustriousgarb", "body": "Nice job! You did great!", "created_utc": "1635697035.0", "edited": "False", "id": "his16ok", "is_submitter": "False", "link_id": "t3_qjhksq", "parent_id": "t3_qjhksq", "score": "2", "subreddit": "madisonwi", "subreddit_id": "t5_2r8rz"}, {"author": "illustriousgarb", "body": "I'm so sorry this happened to you. Unfortunately, we have racists here, too, as embarrassing as it is. Last year, we had a staff member at a Madison school give us grief over my kid's obviously-Asian last name. I lit into them, of course, because I wasn't going to let my Asian husband and biracial children watch me stay silent. \n\nHearing about these incidents makes me furious.", "created_utc": "1635607361.0", "edited": "False", "id": "hinh6mc", "is_submitter": "False", "link_id": "t3_qiqabc", "parent_id": "t3_qiqabc", "score": "2", "subreddit": "madisonwi", "subreddit_id": "t5_2r8rz"}, {"author": "illustriousgarb", "body": "I think the fact that you are so interested in Icelandic is reason enough to focus on it. We don't always have to do things because they're more practical. Just having an interest is enough. Plus, you never know what the future holds - there could be many opportunities for Icelandic speakers in the future.\n\nWhile it wasn't the first language I studied, the first language I truly focused on was Japanese. It's also a \"difficult\" language for native English speakers. I haven't attained fluency yet because of life, but I am much more proficient in Japanese than any other language I've dabbled in. I attribute that to the fact that I was so interested in the language. I think you'll be fine in learning Icelandic, given how interested you are in it.", "created_utc": "1635606952.0", "edited": "False", "id": "hing9p4", "is_submitter": "False", "link_id": "t3_qj1vwq", "parent_id": "t3_qj1vwq", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "illustriousgarb", "body": "\"Keep investigating until we get the results we want!\"  \n\nI would like my tax dollars refunded, please.", "created_utc": "1635265842.0", "edited": "False", "id": "hi4rkew", "is_submitter": "False", "link_id": "t3_qg2s7n", "parent_id": "t3_qg2s7n", "score": "5", "subreddit": "wisconsin", "subreddit_id": "t5_2qrc2"}, {"author": "illustriousgarb", "body": "Ha! I love this city so much.", "created_utc": "1634398416.0", "edited": "False", "id": "hgvbjl0", "is_submitter": "False", "link_id": "t3_q91zyr", "parent_id": "t3_q91zyr", "score": "5", "subreddit": "madisonwi", "subreddit_id": "t5_2r8rz"}, {"author": "illustriousgarb", "body": "Thank you for sharing this. Hopefully it can help people push back against the pitch!", "created_utc": "1634222220.0", "edited": "False", "id": "hgm6eek", "is_submitter": "False", "link_id": "t3_q7x2h4", "parent_id": "t3_q7x2h4", "score": "4", "subreddit": "antiMLM", "subreddit_id": "t5_2swge"}, {"author": "illustriousgarb", "body": "Nextdoor is such a goldmine for this stuff.", "created_utc": "1633992850.0", "edited": "False", "id": "hgaajn9", "is_submitter": "False", "link_id": "t3_q66qrh", "parent_id": "t3_q66qrh", "score": "15", "subreddit": "ShitMomGroupsSay", "subreddit_id": "t5_gajhd"}, {"author": "illustriousgarb", "body": "Absolute insanity. Holy crap I have no words.", "created_utc": "1633629361.0", "edited": "False", "id": "hfr7gob", "is_submitter": "False", "link_id": "t3_q3cjzo", "parent_id": "t1_hfr7746", "score": "2", "subreddit": "byebyejob", "subreddit_id": "t5_2q7cco"}, {"author": "illustriousgarb", "body": "Wtaf is wrong with people?", "created_utc": "1633624446.0", "edited": "False", "id": "hfqvde3", "is_submitter": "False", "link_id": "t3_q3cjzo", "parent_id": "t3_q3cjzo", "score": "5", "subreddit": "byebyejob", "subreddit_id": "t5_2q7cco"}, {"author": "illustriousgarb", "body": "Ruuuuun! Block before they slide into your DMs!", "created_utc": "1633615211.0", "edited": "False", "id": "hfq9lsj", "is_submitter": "False", "link_id": "t3_q38p0q", "parent_id": "t3_q38p0q", "score": "32", "subreddit": "antiMLM", "subreddit_id": "t5_2swge"}, {"author": "illustriousgarb", "body": "I'd like to be able to converse with my friends in their native language.\n\nThat and I'm tired of feeling stupid for only being fluent in one language.", "created_utc": "1633529831.0", "edited": "False", "id": "hflu6u1", "is_submitter": "False", "link_id": "t3_q2h92u", "parent_id": "t3_q2h92u", "score": "5", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "illustriousgarb", "body": "Watching Hawkmoth's frustration is 100% worth it.", "created_utc": "1633436864.0", "edited": "False", "id": "hfgz3zh", "is_submitter": "False", "link_id": "t3_q13gv4", "parent_id": "t1_hfg68oh", "score": "1", "subreddit": "miraculousladybug", "subreddit_id": "t5_39tdz"}, {"author": "illustriousgarb", "body": "I sure as shit think you're selfish, especially if you actually \\*did\\* work with COVID patients and watched them struggle to breathe, and then had the audacity to refuse the vaccine.", "created_utc": "1633365564.0", "edited": "False", "id": "hfd9xrk", "is_submitter": "False", "link_id": "t3_q10jzq", "parent_id": "t3_q10jzq", "score": "3", "subreddit": "byebyejob", "subreddit_id": "t5_2q7cco"}, {"author": "illustriousgarb", "body": "He akumatized Mr Pigeon, who Hawkmoth himself said was hopeless, 72 times. Gabriel may be a great fashion designer, but a genius he is not.", "created_utc": "1633350675.0", "edited": "False", "id": "hfcdjvz", "is_submitter": "False", "link_id": "t3_q13gv4", "parent_id": "t3_q13gv4", "score": "70", "subreddit": "miraculousladybug", "subreddit_id": "t5_39tdz"}, {"author": "illustriousgarb", "body": "It's never too early for immersion language learning. I used to teach English as a foreign language at an immersion school, and we had students of all ages and abilities. It doesn't hurt to have a basic vocabulary, but it also isn't really going to hinder your progress either. You'll pick the important stuff up pretty quickly.", "created_utc": "1633350531.0", "edited": "False", "id": "hfcdbi1", "is_submitter": "False", "link_id": "t3_q147ai", "parent_id": "t3_q147ai", "score": "2", "subreddit": "LearnJapanese", "subreddit_id": "t5_2qyls"}, {"author": "illustriousgarb", "body": "Good. If you can't do the bare minimum to protect your patients, you don't belong in healthcare.", "created_utc": "1633297641.0", "edited": "False", "id": "hfa0auf", "is_submitter": "False", "link_id": "t3_q0fl2b", "parent_id": "t3_q0fl2b", "score": "4", "subreddit": "byebyejob", "subreddit_id": "t5_2q7cco"}, {"author": "illustriousgarb", "body": "This makes me so sad. I love Ian's, they're an amazing company with amazing staff. I guess I'm going to make the journey downtown to get some pizza this week.", "created_utc": "1633297402.0", "edited": "False", "id": "hf9zqgu", "is_submitter": "False", "link_id": "t3_q0l14w", "parent_id": "t3_q0l14w", "score": "14", "subreddit": "madisonwi", "subreddit_id": "t5_2r8rz"}, {"author": "illustriousgarb", "body": "I do both, thanks. They're are safe and effective. I've also been involved in vaccine development and understand science so, troll harder anti-vaxxer.", "created_utc": "1633120177.0", "edited": "False", "id": "hf0mkek", "is_submitter": "False", "link_id": "t3_pzainr", "parent_id": "t1_hf0m867", "score": "93", "subreddit": "ShitMomGroupsSay", "subreddit_id": "t5_gajhd"}, {"author": "illustriousgarb", "body": "\"I don't want the government telling me what to do!\"\n\nIf you don't work for the government, they \\*aren't\\* telling you what to do, your employer is. I'm sure your employer also has requirements about office attire, safety, etc, but surely she does those.", "created_utc": "1633108963.0", "edited": "False", "id": "hezx79g", "is_submitter": "False", "link_id": "t3_pzainr", "parent_id": "t1_hezuhqi", "score": "24", "subreddit": "ShitMomGroupsSay", "subreddit_id": "t5_gajhd"}, {"author": "illustriousgarb", "body": "\"I took a job to protect the public/help people/take care of the sick, but I refuse to get a safe and effective vaccine to protect them! Pity me!\"", "created_utc": "1633108869.0", "edited": "False", "id": "hezwzbl", "is_submitter": "False", "link_id": "t3_pzainr", "parent_id": "t3_pzainr", "score": "103", "subreddit": "ShitMomGroupsSay", "subreddit_id": "t5_gajhd"}, {"author": "illustriousgarb", "body": "Haha honestly, this is true for so many franchises. It's the power of human imagination that makes fanfiction so awesome.\n\nI still prefer the canon, but it's very fun to explore other aspects of characters and \"what if\" scenarios.", "created_utc": "1633100918.0", "edited": "False", "id": "hezeg64", "is_submitter": "False", "link_id": "t3_pz5pl6", "parent_id": "t3_pz5pl6", "score": "1", "subreddit": "miraculousladybug", "subreddit_id": "t5_39tdz"}, {"author": "illustriousgarb", "body": "Oh my god, someone who went to school for years and wrote a dissertation and did all sorts of research must totally be an idiot! I learned so much more from my toilet session YouTube education!", "created_utc": "1633038445.0", "edited": "False", "id": "hewhmsh", "is_submitter": "False", "link_id": "t3_pyo86r", "parent_id": "t3_pyo86r", "score": "20", "subreddit": "ShitMomGroupsSay", "subreddit_id": "t5_gajhd"}, {"author": "illustriousgarb", "body": "Sabine is the real MVP of this episode.", "created_utc": "1633024062.0", "edited": "False", "id": "hevk3fl", "is_submitter": "False", "link_id": "t3_pygrzq", "parent_id": "t3_pygrzq", "score": "1", "subreddit": "miraculousladybug", "subreddit_id": "t5_39tdz"}, {"author": "illustriousgarb", "body": "OMG I love this one. Fabulous job!", "created_utc": "1633023878.0", "edited": "False", "id": "hevjndk", "is_submitter": "False", "link_id": "t3_pykq1c", "parent_id": "t3_pykq1c", "score": "6", "subreddit": "miraculousladybug", "subreddit_id": "t5_39tdz"}, {"author": "illustriousgarb", "body": "Evers has already made it clear that he would veto.\n\nI'm really tired of the red herring nonsense they keep trying to pull. How about doing something productive for the state?", "created_utc": "1632932855.0", "edited": "False", "id": "heqmzo8", "is_submitter": "False", "link_id": "t3_pxopci", "parent_id": "t3_pxopci", "score": "4", "subreddit": "madisonwi", "subreddit_id": "t5_2r8rz"}, {"author": "illustriousgarb", "body": "I did! I used to live in Japan and have been studying the language for a while, so I got a double nerd whammy when I realized the connection.\n\nAw yea, my polyglot plan is finally coming together.", "created_utc": "1632932591.0", "edited": "False", "id": "heqmb95", "is_submitter": "False", "link_id": "t3_pxq6ff", "parent_id": "t3_pxq6ff", "score": "2", "subreddit": "miraculousladybug", "subreddit_id": "t5_39tdz"}, {"author": "illustriousgarb", "body": "That kid is going to grow up to adore Halloween.", "created_utc": "1632841006.0", "edited": "False", "id": "heloo8c", "is_submitter": "False", "link_id": "t3_pwuvfc", "parent_id": "t3_pwuvfc", "score": "17", "subreddit": "ShitMomGroupsSay", "subreddit_id": "t5_gajhd"}, {"author": "illustriousgarb", "body": "I've always joked that I'm an \"aspiring polyglot.\" I'll probably never attain a high level in more than 3 languages, though, based on my circumstances.\n\nI think that so much of this depends on an individual's situation. If you're in a situation where you can actively use multiple languages with native speakers often, it's possible to speak those languages at a high level.\n\nBut a random \"influencer?\" No way.  Even less so if they're advertising an app.", "created_utc": "1632781812.0", "edited": "False", "id": "heiw7ki", "is_submitter": "False", "link_id": "t3_pwkehl", "parent_id": "t3_pwkehl", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "illustriousgarb", "body": "Pegabug!", "created_utc": "1632692124.0", "edited": "False", "id": "heebxfb", "is_submitter": "False", "link_id": "t3_pvvslp", "parent_id": "t3_pvvslp", "score": "1", "subreddit": "miraculousladybug", "subreddit_id": "t5_39tdz"}, {"author": "illustriousgarb", "body": "I definitely agree that the power-ups have been underutilized. I hope we'll see more of them soon.", "created_utc": "1632611218.0", "edited": "False", "id": "hea102j", "is_submitter": "False", "link_id": "t3_pvggsu", "parent_id": "t3_pvggsu", "score": "9", "subreddit": "miraculousladybug", "subreddit_id": "t5_39tdz"}, {"author": "illustriousgarb", "body": "She's very relatable, lol! I was also a totally clumsy teenager who couldn't tell my crush I liked him.", "created_utc": "1632610996.0", "edited": "False", "id": "hea0j7p", "is_submitter": "False", "link_id": "t3_pv8h9j", "parent_id": "t3_pv8h9j", "score": "2", "subreddit": "miraculousladybug", "subreddit_id": "t5_39tdz"}, {"author": "illustriousgarb", "body": "Poor Kayden, living with a parent who is afraid of pizza AND safe sex.", "created_utc": "1632608580.0", "edited": "False", "id": "he9vgc4", "is_submitter": "False", "link_id": "t3_pv8hjd", "parent_id": "t3_pv8hjd", "score": "29", "subreddit": "ShitMomGroupsSay", "subreddit_id": "t5_gajhd"}, {"author": "illustriousgarb", "body": "This is fantastic, thank you for sharing. Plagg is my Patronus. Cheese is life, yo!", "created_utc": "1632409200.0", "edited": "False", "id": "hdyz4v4", "is_submitter": "False", "link_id": "t3_pticko", "parent_id": "t3_pticko", "score": "1", "subreddit": "miraculousladybug", "subreddit_id": "t5_39tdz"}, {"author": "illustriousgarb", "body": "It enrages me that in the year of our lord 2021 people are okay with putting their children at risk for something we can easily prevent.", "created_utc": "1632408681.0", "edited": "False", "id": "hdyxx0p", "is_submitter": "False", "link_id": "t3_ptolgt", "parent_id": "t3_ptolgt", "score": "16", "subreddit": "ShitMomGroupsSay", "subreddit_id": "t5_gajhd"}, {"author": "illustriousgarb", "body": "We've had a fair number of snowy Halloweens in my years here, but like others have said, it doesn't really stick until later.", "created_utc": "1632265422.0", "edited": "False", "id": "hds0yfz", "is_submitter": "False", "link_id": "t3_pstp2d", "parent_id": "t3_pstp2d", "score": "4", "subreddit": "wisconsin", "subreddit_id": "t5_2qrc2"}, {"author": "illustriousgarb", "body": "Ahahaha, mine isn't this bad (yet), but it probably will be someday! I like just playing around in languages that aren't my TL. Can be a fun brain break.", "created_utc": "1632172229.0", "edited": "False", "id": "hdn1ayn", "is_submitter": "False", "link_id": "t3_prjf5d", "parent_id": "t3_prjf5d", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "illustriousgarb", "body": "Sad people who have nothing better to do than down vote random posts.\n\nI hope you find the girls' family.", "created_utc": "1632069430.0", "edited": "False", "id": "hdhauds", "is_submitter": "False", "link_id": "t3_prb9l0", "parent_id": "t1_hdhao2o", "score": "2", "subreddit": "madisonwi", "subreddit_id": "t5_2r8rz"}, {"author": "illustriousgarb", "body": "Unfortunately this seems to be the trend in fandom in general these days. People think that they're anonymous on the internet, and that somehow makes it okay to say these horrible things.\n\nThey think creators, actors, and artists \"deserve\" the hate simply because they have a verified Twitter account. It's bizarre.\n\n*Knees crack* Back in my day, we just made fanfiction when things didn't go our way.", "created_utc": "1632069308.0", "edited": "False", "id": "hdhajpz", "is_submitter": "False", "link_id": "t3_prakkb", "parent_id": "t1_hdh7aw7", "score": "7", "subreddit": "miraculousladybug", "subreddit_id": "t5_39tdz"}, {"author": "illustriousgarb", "body": "I think that since Fu passed the box on to  \"Ladybug\" and not \"Marinette,\" that they'll use a loophole so she doesn't forget things.\n\nEither that or she will just be the guardian for life.", "created_utc": "1632068501.0", "edited": "False", "id": "hdh8lfv", "is_submitter": "False", "link_id": "t3_pr7zg1", "parent_id": "t3_pr7zg1", "score": "16", "subreddit": "miraculousladybug", "subreddit_id": "t5_39tdz"}, {"author": "illustriousgarb", "body": "I'm not going to lie, I break the rules. I choose one language to be my \"serious study\" language and then play around on apps like Duolingo in the others. It might take me longer to be fluent this way, but it satisfies my curiosity enough to keep me from getting distracted.", "created_utc": "1632068327.0", "edited": "False", "id": "hdh85w1", "is_submitter": "False", "link_id": "t3_pqvkcj", "parent_id": "t3_pqvkcj", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "illustriousgarb", "body": "I'm interested in essentially everything, especially \"endangered languages.\" My biggest interest right now is probably Irish Gaelic, followed closely by Welsh and Scottish Gaelic. Also interested in Korean and Mandarin.\n\nI'm casually studying Thai and Swedish. More seriously studying Japanese and French.", "created_utc": "1632067542.0", "edited": "False", "id": "hdh6atc", "is_submitter": "False", "link_id": "t3_pqk5df", "parent_id": "t3_pqk5df", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "illustriousgarb", "body": "I should like to introduce this smol boi to my dairy homeland.", "created_utc": "1631755228.0", "edited": "False", "id": "hd0wjho", "is_submitter": "False", "link_id": "t3_pox48k", "parent_id": "t3_pox48k", "score": "1", "subreddit": "miraculousladybug", "subreddit_id": "t5_39tdz"}, {"author": "illustriousgarb", "body": "This is definitely an interesting theory. Good catch with the pins!", "created_utc": "1631572685.0", "edited": "False", "id": "hcqz0ca", "is_submitter": "False", "link_id": "t3_pnl3sb", "parent_id": "t3_pnl3sb", "score": "3", "subreddit": "miraculousladybug", "subreddit_id": "t5_39tdz"}, {"author": "illustriousgarb", "body": "Who gave Shadowmoth a Twitter account? This feels like an attempt at akumatizing the fandom.", "created_utc": "1631556021.0", "edited": "False", "id": "hcpux6p", "is_submitter": "False", "link_id": "t3_pngq53", "parent_id": "t3_pngq53", "score": "12", "subreddit": "miraculousladybug", "subreddit_id": "t5_39tdz"}, {"author": "illustriousgarb", "body": "Copycat. 🙃", "created_utc": "1631555401.0", "edited": "False", "id": "hcptezb", "is_submitter": "False", "link_id": "t3_png2gs", "parent_id": "t3_png2gs", "score": "6", "subreddit": "miraculousladybug", "subreddit_id": "t5_39tdz"}, {"author": "illustriousgarb", "body": "Oof coming for me on a Monday morning", "created_utc": "1631554894.0", "edited": "False", "id": "hcps6cp", "is_submitter": "False", "link_id": "t3_pnbjoe", "parent_id": "t3_pnbjoe", "score": "1", "subreddit": "miraculousladybug", "subreddit_id": "t5_39tdz"}, {"author": "illustriousgarb", "body": "Ah thanks! I'll need to rewatch Mega Leech, I didn't catch that the first time around.", "created_utc": "1631535122.0", "edited": "False", "id": "hcojtax", "is_submitter": "False", "link_id": "t3_pmkjew", "parent_id": "t1_hcogblc", "score": "2", "subreddit": "miraculousladybug", "subreddit_id": "t5_39tdz"}, {"author": "illustriousgarb", "body": "At the risk of disclosing how old I am, the way the fandom approaches this theory really reminds me of how the Harry Potter fandom used to argue about the \"Harry is a horcrux\" theory. I appreciate that this particular conversation is being kept civil.\n\nI'm still not convinced of the Adrien is a sentimonster theory. However, regardless of which way things shake out, there's no excuse for the way Gabriel treats his son, and quite frankly, Nooroo. I sure hope people don't try to invalidate the abuse.", "created_utc": "1631496892.0", "edited": "False", "id": "hcn0oyd", "is_submitter": "False", "link_id": "t3_pmwv54", "parent_id": "t3_pmwv54", "score": "11", "subreddit": "miraculousladybug", "subreddit_id": "t5_39tdz"}, {"author": "illustriousgarb", "body": "Yea I'm really glad I found this sub so I know to avoid Gloob.", "created_utc": "1631460047.0", "edited": "False", "id": "hckl6gg", "is_submitter": "False", "link_id": "t3_pmuhm2", "parent_id": "t3_pmuhm2", "score": "6", "subreddit": "miraculousladybug", "subreddit_id": "t5_39tdz"}, {"author": "illustriousgarb", "body": "I hope so!", "created_utc": "1631455925.0", "edited": "False", "id": "hckc2gd", "is_submitter": "False", "link_id": "t3_pmkjew", "parent_id": "t1_hckb8j0", "score": "2", "subreddit": "miraculousladybug", "subreddit_id": "t5_39tdz"}, {"author": "illustriousgarb", "body": "I like Kagami. She's had a lot of character development in her short time on screen. And honestly? I liked that Marinette sort of \"gave up\" on Adrien so that Adrigami could happen for a few episodes. That whole arc really pushed a lot of plot and character development, and I thought it was beautiful the way that tension got resolved.\n\nWhat I want to know though - and what seems to not get discussed much - is exactly what \"business dealings\" do Ms. Tsurugi and Gabriel keep having? Ms. Tsurugi doesn't seem to be into fashion, so... Is it something more sinister? I hope that question gets answered.", "created_utc": "1631454752.0", "edited": "False", "id": "hck9l6c", "is_submitter": "False", "link_id": "t3_pmkjew", "parent_id": "t3_pmkjew", "score": "9", "subreddit": "miraculousladybug", "subreddit_id": "t5_39tdz"}, {"author": "illustriousgarb", "body": "My reason is a little dark, so apologies in advance. \n\nI watched this show first with my daughter. I loved how Sailor Moon-esque and silly it was. We had a death in the family shortly after, and MLB sort of became a way for me to escape from the intensity of real life. I could turn off my brain and just watch a silly, cute, wholesome superhero show.\n\nSomewhere along the line, I became invested in the story, and here I am. I love seeing a fun teenage superhero story.", "created_utc": "1631376901.0", "edited": "False", "id": "hcg6rqw", "is_submitter": "False", "link_id": "t3_pm6ipx", "parent_id": "t3_pm6ipx", "score": "15", "subreddit": "miraculousladybug", "subreddit_id": "t5_39tdz"}, {"author": "illustriousgarb", "body": "True!", "created_utc": "1631237469.0", "edited": "False", "id": "hc99ebm", "is_submitter": "False", "link_id": "t3_plaqrr", "parent_id": "t1_hc99c15", "score": "6", "subreddit": "miraculousladybug", "subreddit_id": "t5_39tdz"}, {"author": "illustriousgarb", "body": "Yay! Bummed that it will be a bit for a new episode, but thrilled to have some dates to look forward to!", "created_utc": "1631237201.0", "edited": "False", "id": "hc98sud", "is_submitter": "False", "link_id": "t3_plaqrr", "parent_id": "t3_plaqrr", "score": "32", "subreddit": "miraculousladybug", "subreddit_id": "t5_39tdz"}, {"author": "illustriousgarb", "body": "FFS, I don't *want* my kids to fear me, I want them to trust me. Sorry but from a parent perspective, making them fear you is indeed abuse.", "created_utc": "1631237127.0", "edited": "False", "id": "hc98mva", "is_submitter": "False", "link_id": "t3_plaw9v", "parent_id": "t3_plaw9v", "score": "140", "subreddit": "ShitMomGroupsSay", "subreddit_id": "t5_gajhd"}, {"author": "illustriousgarb", "body": "Oh this is awesome!", "created_utc": "1631110577.0", "edited": "False", "id": "hc27k2o", "is_submitter": "False", "link_id": "t3_pk8nev", "parent_id": "t3_pk8nev", "score": "3", "subreddit": "miraculousladybug", "subreddit_id": "t5_39tdz"}, {"author": "illustriousgarb", "body": "I particularly hate how these MLMs prey on women's insecurities. Want to look pretty? Want to lose weight?  Buy into our pyramid scheme!", "created_utc": "1631017957.0", "edited": "False", "id": "hbx9r8r", "is_submitter": "False", "link_id": "t3_pjliqm", "parent_id": "t3_pjliqm", "score": "70", "subreddit": "antiMLM", "subreddit_id": "t5_2swge"}, {"author": "illustriousgarb", "body": "Completely agree. Chloe and Zoe are two totally different characters, and I think both are necessary to make the story more interesting. Personally, I think they're going to help each other grow, but they don't need to change at all to make the story enjoyable.", "created_utc": "1631017785.0", "edited": "False", "id": "hbx9goj", "is_submitter": "False", "link_id": "t3_pjh5ev", "parent_id": "t1_hbwj4jq", "score": "5", "subreddit": "miraculousladybug", "subreddit_id": "t5_39tdz"}, {"author": "illustriousgarb", "body": "Sheesh, 100%. When I started interacting with the MLB fandom, I thought I had accidentally stumbled into the Star Wars fandom.", "created_utc": "1630959177.0", "edited": "False", "id": "hbujjz9", "is_submitter": "False", "link_id": "t3_piqpla", "parent_id": "t3_piqpla", "score": "3", "subreddit": "miraculousladybug", "subreddit_id": "t5_39tdz"}, {"author": "illustriousgarb", "body": "Meh, I'm one of the older ones, but seriously people, don't get worried about your age. You like what you like, watch what makes you happy.", "created_utc": "1629913692.0", "edited": "False", "id": "habi1u2", "is_submitter": "False", "link_id": "t3_pb097h", "parent_id": "t3_pb097h", "score": "2", "subreddit": "TheDragonPrince", "subreddit_id": "t5_lghxu"}, {"author": "illustriousgarb", "body": "This right here. I'm a parent myself, most of us would do anything to save our kids. Yes, even if it resulted in someone else's demise. I strongly doubt Lissa was against saving Soren by any means possible.\n\nIt's much more likely that she couldn't deal with his obsessive nature.\n\nI honestly think she might be the first coin though. I don't think it was ever outright stated, but I think it's implied that she hasn't seen the kids since the split. Unless she's just a terrible parent, that's suspicious.", "created_utc": "1625266363.0", "edited": "False", "id": "h3v1k5a", "is_submitter": "False", "link_id": "t3_oc91ib", "parent_id": "t1_h3uroyn", "score": "1", "subreddit": "TheDragonPrince", "subreddit_id": "t5_lghxu"}, {"author": "illustriousgarb", "body": "Welcome to the obsession!\n\nBeautiful art.", "created_utc": "1622568009.0", "edited": "False", "id": "h07qgjz", "is_submitter": "False", "link_id": "t3_npdn2z", "parent_id": "t3_npdn2z", "score": "2", "subreddit": "TheDragonPrince", "subreddit_id": "t5_lghxu"}, {"author": "illustriousgarb", "body": "I....love this lmao", "created_utc": "1618677525.0", "edited": "False", "id": "guvegol", "is_submitter": "False", "link_id": "t3_msp8cy", "parent_id": "t3_msp8cy", "score": "7", "subreddit": "TheDragonPrince", "subreddit_id": "t5_lghxu"}, {"author": "illustriousgarb", "body": "People are so damn brazen about their racism these days. My husband is Asian, and people have said shit to me, in front of our kids. On the plus side, my kids at least get to see a white lady go ballistic on racists, so I guess there's that.", "created_utc": "1618674306.0", "edited": "False", "id": "guv53yp", "is_submitter": "False", "link_id": "t3_ms4dyt", "parent_id": "t1_gut2vl6", "score": "7", "subreddit": "ShitMomGroupsSay", "subreddit_id": "t5_gajhd"}, {"author": "illustriousgarb", "body": "Fantastic! I love everything about this!", "created_utc": "1617021138.0", "edited": "False", "id": "gsoii8u", "is_submitter": "False", "link_id": "t3_mfahu0", "parent_id": "t3_mfahu0", "score": "2", "subreddit": "TheDragonPrince", "subreddit_id": "t5_lghxu"}, {"author": "illustriousgarb", "body": "There is a lot of passion about this apparently! Lol! I found it to be a humorous and relatable scene. After all, anything can be a weapon, and you've gotta use what you've got.", "created_utc": "1616420367.0", "edited": "False", "id": "grt5iyw", "is_submitter": "False", "link_id": "t3_ma44as", "parent_id": "t1_grqecst", "score": "2", "subreddit": "TheDragonPrince", "subreddit_id": "t5_lghxu"}, {"author": "illustriousgarb", "body": "Iroh was a fire-bending warrior, though.\n\nBarius was a baker.\n\nUse what you've got.", "created_utc": "1616415249.0", "edited": "False", "id": "grswsyh", "is_submitter": "False", "link_id": "t3_ma44as", "parent_id": "t1_grse1rv", "score": "6", "subreddit": "TheDragonPrince", "subreddit_id": "t5_lghxu"}, {"author": "illustriousgarb", "body": "Just @ me next time sheesh", "created_utc": "1610233354.0", "edited": "False", "id": "gipcvp2", "is_submitter": "False", "link_id": "t3_ktuo07", "parent_id": "t3_ktuo07", "score": "1", "subreddit": "TheDragonPrince", "subreddit_id": "t5_lghxu"}, {"author": "illustriousgarb", "body": "10/10 I love it", "created_utc": "1606536078.0", "edited": "False", "id": "gdu16qb", "is_submitter": "False", "link_id": "t3_k29elx", "parent_id": "t3_k29elx", "score": "4", "subreddit": "TheLastAirbender", "subreddit_id": "t5_2rybx"}, {"author": "illustriousgarb", "body": "I'd play a game set in Madison that's bar-themed. This needs to happen.", "created_utc": "1605834720.0", "edited": "False", "id": "gcw7z6x", "is_submitter": "False", "link_id": "t3_jxbq9e", "parent_id": "t1_gcw0zi2", "score": "2", "subreddit": "madisonwi", "subreddit_id": "t5_2r8rz"}, {"author": "illustriousgarb", "body": "Jesus Christ we can't get this idiot out of office fast enough.", "created_utc": "1603916251.0", "edited": "False", "id": "gaf1lij", "is_submitter": "False", "link_id": "t3_jjo2rl", "parent_id": "t3_jjo2rl", "score": "3", "subreddit": "wisconsin", "subreddit_id": "t5_2qrc2"}, {"author": "illustriousgarb", "body": "It's so true", "created_utc": "1603673190.0", "edited": "False", "id": "ga4di4j", "is_submitter": "False", "link_id": "t3_jhpl0x", "parent_id": "t3_jhpl0x", "score": "1", "subreddit": "TheDragonPrince", "subreddit_id": "t5_lghxu"}, {"author": "illustriousgarb", "body": "I sure do love things like eating bread and complaining all the time!", "created_utc": "1603217739.0", "edited": "False", "id": "g9ggle3", "is_submitter": "False", "link_id": "t3_jel9br", "parent_id": "t3_jel9br", "score": "4", "subreddit": "TheDragonPrince", "subreddit_id": "t5_lghxu"}, {"author": "illustriousgarb", "body": "I'm just gonna tell myself December 2021 so I am pleasantly surprised if it comes earlier.", "created_utc": "1603061695.0", "edited": "False", "id": "g99pi6z", "is_submitter": "False", "link_id": "t3_jdj7f1", "parent_id": "t3_jdj7f1", "score": "9", "subreddit": "TheDragonPrince", "subreddit_id": "t5_lghxu"}, {"author": "illustriousgarb", "body": "That comment you linked to had me all kinds of shook when he posted it. But I am trying to convince myself that Aaron is screwing with us in that one - these are the creators behind ATLA, and it *is* a \"kid's\" show...sooooo this is what I'm telling myself to convince myself they'll see each other again lol.\n\nBecause if they don't I swear I will rage write all the fanfiction.", "created_utc": "1602790705.0", "edited": "False", "id": "g8xhqq6", "is_submitter": "False", "link_id": "t3_jblgk6", "parent_id": "t1_g8w4pbi", "score": "3", "subreddit": "TheDragonPrince", "subreddit_id": "t5_lghxu"}, {"author": "illustriousgarb", "body": "THANK YOU! You were already my favorite local brewery, and this just solidifies that. I'm going to go stock up on my favorite brews now.", "created_utc": "1602782370.0", "edited": "False", "id": "g8x0zdn", "is_submitter": "False", "link_id": "t3_jb5ltp", "parent_id": "t3_jb5ltp", "score": "3", "subreddit": "madisonwi", "subreddit_id": "t5_2r8rz"}, {"author": "illustriousgarb", "body": "Most of my thoughts have already been addressed in these comments, but one thing I found particularly interesting was how the images of the assassins were the same as the images of the dark magic assassins that Viren sent after the other human kingdom leaders.\n\nThe concept of them being angry with her for their deaths was a bit at odds with the whole \"I am already dead\" mindset. Furthermore, they didn't seem nearly as upset with Rayla as Runaan did when she didn't kill Marcos. IMO, the \"hate\" they felt for Rayla was probably more directed at the rage felt by being used for dark magic. They may have somehow been caught between life and death, and seeing her binding gone freed them.\n\nJust my random thoughts.", "created_utc": "1602114449.0", "edited": "False", "id": "g8222ou", "is_submitter": "False", "link_id": "t3_iobr0w", "parent_id": "t3_iobr0w", "score": "8", "subreddit": "TheDragonPrince", "subreddit_id": "t5_lghxu"}, {"author": "illustriousgarb", "body": "Based on what the creators said on last night's IG live, I don't think there will be more books before S4. From what I recall, they specifically said there were no further books in the works (although they \\*want\\* to do more), but they are actively working on S4 now.", "created_utc": "1602114008.0", "edited": "False", "id": "g821a97", "is_submitter": "False", "link_id": "t3_iobr0w", "parent_id": "t1_g81w0qu", "score": "5", "subreddit": "TheDragonPrince", "subreddit_id": "t5_lghxu"}, {"author": "illustriousgarb", "body": "I used to love this state. Now I want out.", "created_utc": "1600471059.0", "edited": "False", "id": "g5r7w14", "is_submitter": "False", "link_id": "t3_ivcosh", "parent_id": "t3_ivcosh", "score": "11", "subreddit": "wisconsin", "subreddit_id": "t5_2qrc2"}, {"author": "illustriousgarb", "body": "Great work!!", "created_utc": "1599496403.0", "edited": "False", "id": "g4cjimp", "is_submitter": "False", "link_id": "t3_io4rki", "parent_id": "t3_io4rki", "score": "6", "subreddit": "TheDragonPrince", "subreddit_id": "t5_lghxu"}, {"author": "illustriousgarb", "body": "103000 people who made $100 collectively last year! They can't be wrong!", "created_utc": "1599164724.0", "edited": "False", "id": "g3wcdg5", "is_submitter": "False", "link_id": "t3_ilzbqy", "parent_id": "t3_ilzbqy", "score": "12", "subreddit": "antiMLM", "subreddit_id": "t5_2swge"}, {"author": "illustriousgarb", "body": "\"Not homophobic\" but was offended by one line that the kid totally wouldn't have gotten (hell, I barely caught it the first time around).\n\nYea. This person is homophobic.", "created_utc": "1599103026.0", "edited": "False", "id": "g3sz36w", "is_submitter": "False", "link_id": "t3_ilj3uf", "parent_id": "t3_ilj3uf", "score": "13", "subreddit": "TheDragonPrince", "subreddit_id": "t5_lghxu"}, {"author": "illustriousgarb", "body": "I like Soren's pronunciation better.", "created_utc": "1598986567.0", "edited": "False", "id": "g3mjt45", "is_submitter": "False", "link_id": "t3_iknz2k", "parent_id": "t3_iknz2k", "score": "15", "subreddit": "TheDragonPrince", "subreddit_id": "t5_lghxu"}, {"author": "illustriousgarb", "body": "I love this! He looks great!", "created_utc": "1598740232.0", "edited": "False", "id": "g3aje5p", "is_submitter": "False", "link_id": "t3_ij1dj2", "parent_id": "t3_ij1dj2", "score": "2", "subreddit": "TheDragonPrince", "subreddit_id": "t5_lghxu"}, {"author": "illustriousgarb", "body": "Personally, I'm hoping for a Aaravos/Callum face-off. :D\n\nI'm in agreement that Viren probably won't be searching for primal stones, since he has Aaravos. As to where he got it, I suspect he stole it on a previous trip to Xadia.", "created_utc": "1598476540.0", "edited": "False", "id": "g2yc72b", "is_submitter": "False", "link_id": "t3_ih77c0", "parent_id": "t3_ih77c0", "score": "6", "subreddit": "TheDragonPrince", "subreddit_id": "t5_lghxu"}, {"author": "illustriousgarb", "body": "I really came to love Soren by the end of season 3. He's such a great character.", "created_utc": "1598473522.0", "edited": "False", "id": "g2y5mgb", "is_submitter": "False", "link_id": "t3_igx7i1", "parent_id": "t3_igx7i1", "score": "22", "subreddit": "TheDragonPrince", "subreddit_id": "t5_lghxu"}, {"author": "illustriousgarb", "body": "Where did you get this picture of me?", "created_utc": "1598370610.0", "edited": "False", "id": "g2t807q", "is_submitter": "False", "link_id": "t3_ig67zi", "parent_id": "t3_ig67zi", "score": "1", "subreddit": "TheDragonPrince", "subreddit_id": "t5_lghxu"}, {"author": "illustriousgarb", "body": "Ka-yoot!!!!\n\nGreat work!", "created_utc": "1598370527.0", "edited": "False", "id": "g2t7ssb", "is_submitter": "False", "link_id": "t3_ig9zwu", "parent_id": "t3_ig9zwu", "score": "5", "subreddit": "TheDragonPrince", "subreddit_id": "t5_lghxu"}, {"author": "illustriousgarb", "body": "My favorite line in the whole show", "created_utc": "1598291438.0", "edited": "False", "id": "g2pp4l4", "is_submitter": "False", "link_id": "t3_ifljvk", "parent_id": "t3_ifljvk", "score": "6", "subreddit": "TheDragonPrince", "subreddit_id": "t5_lghxu"}, {"author": "illustriousgarb", "body": "Holy shit I share a birthday with Amaya, this is the best thing ever", "created_utc": "1598048424.0", "edited": "False", "id": "g2dghq1", "is_submitter": "False", "link_id": "t3_idx6pe", "parent_id": "t3_idx6pe", "score": "2", "subreddit": "TheDragonPrince", "subreddit_id": "t5_lghxu"}, {"author": "illustriousgarb", "body": "To answer your first question, I think Azula was quite feminine. She was very much an awkward teenage girl who was interested in boys (ex., The Beach), and she had other female friends. \n\nTo your second question: No, a female does not need to be \"feminine\" to be a good female character. All that is required is an interesting character who is female.", "created_utc": "1597099608.0", "edited": "False", "id": "g11kcj5", "is_submitter": "False", "link_id": "t3_i7fbh4", "parent_id": "t3_i7fbh4", "score": "7", "subreddit": "TheLastAirbender", "subreddit_id": "t5_2rybx"}, {"author": "illustriousgarb", "body": "I freaking love Mai", "created_utc": "1595966465.0", "edited": "False", "id": "fzjpbj5", "is_submitter": "False", "link_id": "t3_hzinl1", "parent_id": "t3_hzinl1", "score": "199", "subreddit": "TheLastAirbender", "subreddit_id": "t5_2rybx"}, {"author": "illustriousgarb", "body": "Former teacher here: \n\nSchools warn you to watch what you post on your social media. Satire or not, this was a completely stupid thing to post.", "created_utc": "1595696800.0", "edited": "False", "id": "fz7mhvg", "is_submitter": "False", "link_id": "t3_hxntjn", "parent_id": "t3_hxntjn", "score": "65", "subreddit": "byebyejob", "subreddit_id": "t5_2q7cco"}, {"author": "illustriousgarb", "body": "Not yet! But I'm guessing I'm going to get my wish? :)", "created_utc": "1595688239.0", "edited": "False", "id": "fz77d05", "is_submitter": "False", "link_id": "t3_hxmx0r", "parent_id": "t1_fz7429w", "score": "3", "subreddit": "TheLastAirbender", "subreddit_id": "t5_2rybx"}, {"author": "illustriousgarb", "body": "I haven't watched everything on Netflix yet, but I'd like there to be some reference to Sokka. Everytime Callum speaks, all I hear is Sokka lol!", "created_utc": "1595685278.0", "edited": "False", "id": "fz72pwg", "is_submitter": "False", "link_id": "t3_hxmx0r", "parent_id": "t3_hxmx0r", "score": "11", "subreddit": "TheLastAirbender", "subreddit_id": "t5_2rybx"}, {"author": "illustriousgarb", "body": "Oh god the license plate holder is cringe. Everything about this is cringe. Yikes on all the bikes.", "created_utc": "1595685080.0", "edited": "False", "id": "fz72f9v", "is_submitter": "False", "link_id": "t3_hxmzuo", "parent_id": "t3_hxmzuo", "score": "2", "subreddit": "antiMLM", "subreddit_id": "t5_2swge"}, {"author": "illustriousgarb", "body": "Oh this is great! Thanks for sharing!", "created_utc": "1595685015.0", "edited": "False", "id": "fz72bsd", "is_submitter": "False", "link_id": "t3_hxmblt", "parent_id": "t3_hxmblt", "score": "9", "subreddit": "TheLastAirbender", "subreddit_id": "t5_2rybx"}, {"author": "illustriousgarb", "body": "I'm so sorry. Losing a furbaby is so hard. I lost my good girl very suddenly two years ago, and I still miss her. I am lucky I have her son (it was an odd adoption scenario), so I didn't really lose the routine, but I miss her happy barks and snuggles.\n\nLet yourself grieve for your dog and give yourself some grace for the next couple of weeks. You loved her very much and everything you feel is valid.", "created_utc": "1595684698.0", "edited": "False", "id": "fz71uzt", "is_submitter": "False", "link_id": "t3_hxhq6d", "parent_id": "t1_fz6g4v6", "score": "2", "subreddit": "pics", "subreddit_id": "t5_2qh0u"}, {"author": "illustriousgarb", "body": "'Tis my favorite. They're just adorable.", "created_utc": "1595684102.0", "edited": "False", "id": "fz71069", "is_submitter": "False", "link_id": "t3_hxmnyb", "parent_id": "t3_hxmnyb", "score": "8", "subreddit": "TheLastAirbender", "subreddit_id": "t5_2rybx"}, {"author": "illustriousgarb", "body": "I was introduced to it as an adult and loved it. I didn't really start getting into it until the end of book 1, though. That being said, I have two small kids and I have no issues with kids' shows lol. I've also always liked animation and cartoons. \n\nYou don't have to like it, and that's okay! It's okay to not be into popular shows.", "created_utc": "1595542610.0", "edited": "False", "id": "fz10p6a", "is_submitter": "False", "link_id": "t3_hwo9bi", "parent_id": "t3_hwo9bi", "score": "1", "subreddit": "TheLastAirbender", "subreddit_id": "t5_2rybx"}, {"author": "illustriousgarb", "body": "Fuck that guy.", "created_utc": "1595523448.0", "edited": "False", "id": "fyzvzpw", "is_submitter": "False", "link_id": "t3_hwiwg7", "parent_id": "t1_fyzti59", "score": "6", "subreddit": "TheLastAirbender", "subreddit_id": "t5_2rybx"}, {"author": "illustriousgarb", "body": "Fact: 100% of people who use dihydrogen monoxide die!!", "created_utc": "1595523316.0", "edited": "False", "id": "fyzvp0e", "is_submitter": "False", "link_id": "t3_hwdejf", "parent_id": "t1_fyyzwpd", "score": "42", "subreddit": "ShitMomGroupsSay", "subreddit_id": "t5_gajhd"}, {"author": "illustriousgarb", "body": "Ah, so this is why my pediatrician is visibly relieved when I say, \"yea, give my kid the sh6it.\"", "created_utc": "1595523039.0", "edited": "False", "id": "fyzv3c6", "is_submitter": "False", "link_id": "t3_hwc2x4", "parent_id": "t3_hwc2x4", "score": "2", "subreddit": "insaneparents", "subreddit_id": "t5_3pkgv"}, {"author": "illustriousgarb", "body": "Wanting healthy poor people is communism! Something something bIg PhArMa", "created_utc": "1595522918.0", "edited": "False", "id": "fyzuu37", "is_submitter": "False", "link_id": "t3_hwc2x4", "parent_id": "t1_fyzhvoe", "score": "5", "subreddit": "insaneparents", "subreddit_id": "t5_3pkgv"}, {"author": "illustriousgarb", "body": "Absolutely beautiful!", "created_utc": "1595285778.0", "edited": "False", "id": "fypj2i7", "is_submitter": "False", "link_id": "t3_huv7qa", "parent_id": "t3_huv7qa", "score": "1", "subreddit": "TheLastAirbender", "subreddit_id": "t5_2rybx"}, {"author": "illustriousgarb", "body": "Personally, I thought the story was rushed. I realize it was made for a much younger audience, and thus the pacing had to be quick, but as an adult, I'd like to see more character development and a bit more depth into the story.\n\nGranted, it has all of these things on an appropriate level for 9-12 year olds, but I'm an old cranky lady who can never be satisfied. ;)", "created_utc": "1595281982.0", "edited": "False", "id": "fypbkxs", "is_submitter": "False", "link_id": "t3_huqmhs", "parent_id": "t3_huqmhs", "score": "1", "subreddit": "TheLastAirbender", "subreddit_id": "t5_2rybx"}, {"author": "illustriousgarb", "body": "Just to throw my unnecessary two cents in, I am one of the people who didn't see ATLA when it first aired, I saw it for the first time when it came to Netflix this spring. I watched LOK immediately after, so the nostalgia argument doesn't work for me.\n\nI wanted to like LOK, I really did. But it just fell flat for me.  I guess I wouldn't classify myself as a hater though.", "created_utc": "1595281410.0", "edited": "False", "id": "fypaezz", "is_submitter": "False", "link_id": "t3_hus4tk", "parent_id": "t3_hus4tk", "score": "2", "subreddit": "TheLastAirbender", "subreddit_id": "t5_2rybx"}, {"author": "illustriousgarb", "body": "What the fuck? Lol!", "created_utc": "1595124095.0", "edited": "False", "id": "fyiqkiz", "is_submitter": "False", "link_id": "t3_htrxm2", "parent_id": "t3_htrxm2", "score": "2", "subreddit": "ShitMomGroupsSay", "subreddit_id": "t5_gajhd"}, {"author": "illustriousgarb", "body": "Here, here. I'm also seriously considering leaving the USA. I'm terrified for the future of my biracial children.", "created_utc": "1595100868.0", "edited": "False", "id": "fyhncay", "is_submitter": "False", "link_id": "t3_htf44j", "parent_id": "t1_fygj4qp", "score": "16", "subreddit": "findapath", "subreddit_id": "t5_2wqq6"}, {"author": "illustriousgarb", "body": "It has done a bit of both for me.\n\nI was working on getting a fashion line off the ground when everything shut down. This fashion line was specific to mother-of-the-brides. Weddings have been delayed, cancelled, or minimized, so demand has declined. Furthermore, retail stores are very hesitant to take a chance on a new designer's product right now. So I've had to re-tool my business. For a while I was selling handmade masks, and I enjoyed it. Since it's really unlikely that the event industry is going to pick back up for a while, I think I'm probably going to scale back my business and focus on handmade products for a while.\n\nAdditionally, I've started to realize that I don't really miss costuming. I'm not sure what that means. I don't want to let go of the friends I've made through it, and I still like wearing pretty things, but I haven't seen a garment for myself since the lockdown started. And I'm okay with that.\n\nI've taken up drawing again and realized that I missed it. Because the local tech college is doing all it's continuing education courses online, I have the opportunity to take classes just for fun. That was a lot harder for me to do in person, because I have two small children.\n\nSo some doors have closed for me, while others have opened. It's been kind of interesting to see what I've focused on.", "created_utc": "1595100668.0", "edited": "False", "id": "fyhmzec", "is_submitter": "False", "link_id": "t3_htf44j", "parent_id": "t3_htf44j", "score": "2", "subreddit": "findapath", "subreddit_id": "t5_2wqq6"}, {"author": "illustriousgarb", "body": "Art has immense value in our society, and people seem to forget that because it doesn't produce revenue they way, say, a pharmaceutical company does.\n\nBut just look at Hamilton. how many people are getting a new perspective on American history? Not to mention the societal issues it has brought to light, the way it legitimized hip hop and rap as art forms on Broadway, etc etc. Art enriches and enhances life. It makes it worth living. This may not have a dollar value, but it's absolutely invaluable.", "created_utc": "1595100116.0", "edited": "False", "id": "fyhlzur", "is_submitter": "False", "link_id": "t3_htf44j", "parent_id": "t1_fyhfree", "score": "10", "subreddit": "findapath", "subreddit_id": "t5_2wqq6"}, {"author": "illustriousgarb", "body": "Floofy birb!!! So cute and awesome name!", "created_utc": "1594848069.0", "edited": "False", "id": "fy6qhnr", "is_submitter": "False", "link_id": "t3_hrvyh9", "parent_id": "t3_hrvyh9", "score": "3", "subreddit": "TheLastAirbender", "subreddit_id": "t5_2rybx"}, {"author": "illustriousgarb", "body": "Beautiful work!", "created_utc": "1594847979.0", "edited": "False", "id": "fy6qayb", "is_submitter": "False", "link_id": "t3_hrw3x6", "parent_id": "t3_hrw3x6", "score": "1", "subreddit": "TheLastAirbender", "subreddit_id": "t5_2rybx"}, {"author": "illustriousgarb", "body": "Another thought I just had - what about going into medical law? I don't mean like an ambulance chaser, but a lawyer that works with hospitals, or perhaps working in compliance or regulatory affairs?", "created_utc": "1594836577.0", "edited": "False", "id": "fy62c37", "is_submitter": "False", "link_id": "t3_hrqn1k", "parent_id": "t1_fy6173s", "score": "1", "subreddit": "findapath", "subreddit_id": "t5_2wqq6"}, {"author": "illustriousgarb", "body": "I've got a decade on you, and let me just say, starting a new career at an \"older age\" is perfectly fine. \n\nReading through your post, I have one question for you - do you *want* to be in medicine? I understand that the MCAT is difficult and is your barrier to moving on, but is this what you want?\n\nOptometry may be less secure than medicine, but it's still secure. People will always need glasses, contacts, eye surgeries, etc. And it's still quite prestigious. Likely a bit less stressful than medicine.\n\nLaw school is also quite a process, but if it's something you really want, it will be worth it.\n\nIf I were to make the choice for you, just based on this post, I think the optometry route is the most practical based on your skills and experience. But ultimately, you are the one who must live with the choice, so take my opinion with a grain of salt.", "created_utc": "1594836042.0", "edited": "False", "id": "fy6173s", "is_submitter": "False", "link_id": "t3_hrqn1k", "parent_id": "t3_hrqn1k", "score": "1", "subreddit": "findapath", "subreddit_id": "t5_2wqq6"}, {"author": "illustriousgarb", "body": "1) safety in the workplace - I'm really hoping this changes the American mentality of coming to the workplace while sick. \n\n2) job security - I'm concerned about how the virus will change industries and how many non-essential industries will still be around.\n\n3) I'm a bit older than the average poster in this sub, and I've been struggling with my career anyway (I'm a stay-at-home mom who will re-enter the workforce in the next 2-5 years), so this might be me specific, but how bad ageism will be will things return to \"normal.\" I am nearing 40, so I fear I might be facing a lot of this.", "created_utc": "1594576747.0", "edited": "False", "id": "fxul50h", "is_submitter": "False", "link_id": "t3_hpwf44", "parent_id": "t3_hpwf44", "score": "3", "subreddit": "findapath", "subreddit_id": "t5_2wqq6"}, {"author": "illustriousgarb", "body": "Lmao! Happy cake day! Mine was yesterday...:D", "created_utc": "1594316539.0", "edited": "False", "id": "fxfzff8", "is_submitter": "False", "link_id": "t3_ho7c71", "parent_id": "t3_ho7c71", "score": "2", "subreddit": "TheLastAirbender", "subreddit_id": "t5_2rybx"}, {"author": "illustriousgarb", "body": "I'm pretty sure this is fine and falls under fair use. There are a number of parody/inspired by songs out there. Seagulls (Stop it Now) comes to mind.", "created_utc": "1594316484.0", "edited": "False", "id": "fxfzb13", "is_submitter": "False", "link_id": "t3_ho7dl3", "parent_id": "t3_ho7dl3", "score": "6", "subreddit": "TheLastAirbender", "subreddit_id": "t5_2rybx"}, {"author": "illustriousgarb", "body": "Why hello fellow 37 year old.\n\nSo when I came back from Japan, I was horribly shocked to find out how little my experience out there counted for anything. You are really wise to be planning ahead like this, so kudos to you for that. I'm not an expert in any of these fields, but I think both culinary school and carpentry are good options. And you certainly don't have to discard your writing or voice work. In fact, I'd encourage you to keep both of those in your back pocket - you never know how you can put those skills to use in the future.\n\nI don't think culinary school is a waste of time. At the very \"worst,\" it is a good way to network. And if you are not a self-starter, it's probably a more effective way to get into the field. You might not have to work nights if you're able to get in somewhere prestigious, but I suspect that most entry level jobs are going to be nights and weekends. There's also the option of working in an already established food cart - these are gaining a lot of popularity in urban areas, and they tend to be a \"lunch time\" thing, at least in my city. Maybe culinary school will clue you in to other types of jobs you can get within the culinary industry that don't require nights. Regardless, if this is where your passion lies, my gut is to tell you to go the food & cookery route.\n\nI also think carpentry is a great idea. The trades are one of the areas that seem to be hurting for good employees, so this is a good route, too. I think you should definitely try to get some experience before committing to that path, though. I don't know where you are in Japan, but perhaps your local community center has some classes, or could hook you up with a carpenter in the area?\n\nBoth options are good, and I wish you luck in deciding which route to take.", "created_utc": "1594314019.0", "edited": "False", "id": "fxfu0ze", "is_submitter": "False", "link_id": "t3_ho2gzc", "parent_id": "t3_ho2gzc", "score": "1", "subreddit": "findapath", "subreddit_id": "t5_2wqq6"}, {"author": "illustriousgarb", "body": "Thank you!!", "created_utc": "1594251596.0", "edited": "False", "id": "fxd9vpv", "is_submitter": "False", "link_id": "t3_hnqq1h", "parent_id": "t1_fxd36p6", "score": "1", "subreddit": "TheLastAirbender", "subreddit_id": "t5_2rybx"}, {"author": "illustriousgarb", "body": "Iroh is a gift", "created_utc": "1594246860.0", "edited": "False", "id": "fxd0xcm", "is_submitter": "False", "link_id": "t3_hnqq1h", "parent_id": "t3_hnqq1h", "score": "2", "subreddit": "TheLastAirbender", "subreddit_id": "t5_2rybx"}, {"author": "illustriousgarb", "body": "Air. Being able to basically fly would be so cool.", "created_utc": "1594246633.0", "edited": "False", "id": "fxd0h9v", "is_submitter": "False", "link_id": "t3_hnqgzv", "parent_id": "t3_hnqgzv", "score": "3", "subreddit": "TheLastAirbender", "subreddit_id": "t5_2rybx"}, {"author": "illustriousgarb", "body": "Coming from someone who didn't really like TLOK - it's definitely worth a watch. I'm currently reading through the comics and enjoying them. There's also a ton of fanfiction out there, if that's your thing!", "created_utc": "1594246509.0", "edited": "False", "id": "fxd08fv", "is_submitter": "False", "link_id": "t3_hnqjoz", "parent_id": "t3_hnqjoz", "score": "2", "subreddit": "TheLastAirbender", "subreddit_id": "t5_2rybx"}, {"author": "illustriousgarb", "body": "37 here and just joined the fandom. It's so awesome here.", "created_utc": "1593453846.0", "edited": "False", "id": "fwe1ldz", "is_submitter": "False", "link_id": "t3_hhx6w5", "parent_id": "t3_hhx6w5", "score": "1", "subreddit": "TheLastAirbender", "subreddit_id": "t5_2rybx"}, {"author": "illustriousgarb", "body": "Same lol.", "created_utc": "1593191959.0", "edited": "False", "id": "fw2xyys", "is_submitter": "False", "link_id": "t3_hfy2nc", "parent_id": "t1_fw16qur", "score": "2", "subreddit": "findapath", "subreddit_id": "t5_2wqq6"}, {"author": "illustriousgarb", "body": "There is nothing wrong with living a simple life, especially if that is what brings you and your family joy. I'd echo what others have said, make sure to do lots of research before making the jump, but there's nothing wrong with wanting this.\n\nAs to your current predicament, if your job is making you unhappy, definitely get out. Even if you ultimately decide not to go the homestead route, find something else, even if it's a different sales job. I've worked jobs that I've hated, and it sucks the life out of you and will take away your drive to do anything else. You spend at least 1/3 of your life at work, don't let it destroy the other 2/3.", "created_utc": "1593100547.0", "edited": "False", "id": "fvyr4wi", "is_submitter": "False", "link_id": "t3_hfa1ca", "parent_id": "t3_hfa1ca", "score": "1", "subreddit": "findapath", "subreddit_id": "t5_2wqq6"}, {"author": "illustriousgarb", "body": "The short answer: Yes.\n\nGlobalization may have had a negative impact on much of the world, but it is impossible to stop it now. And to be honest, trying to reverse it now would result in some anti-humanitarian events.\n\nThe key to not becoming a \"white savior\" is your mindset. Remember that you are there to serve people, not \"save\" them. I used to teach in a school with predominantly black students who lived in poverty. So many teachers would come in, determined that they would \"save\" these kids. They didn't need saving, they needed teaching. These \"white savior\" teachers would \"correct\" the children's AAVE. They'd sneer at the parents for sending their kids to second-shift daycare (because they were working). They'd complain about how loud the children were, as if that was something unique to black children. The students got an education, sure. But they were not blind to the subtle ways their teachers thought they were \"better\" than them.\n\nIf you're going to do humanitarian work, research the organization you're hoping to work for. Honor the culture of the people that you're serving. Recognize that you're a visitor to their community, and don't be an obnoxious tourist.\n\nI don't have any recommendations for specific organizations, but I would imagine working for emergency relief groups would be a good start. Or perhaps consider working on a country that is making specific efforts to preserve their heritage. Could you be their English translator and help build a website to spread awareness? Maybe you can help an organization trying to get clean water to everyone. \n\nThere are lots of ways to help people without falling into the white savior trap. Research and respect will get you there.", "created_utc": "1591224604.0", "edited": "False", "id": "fsss2s1", "is_submitter": "False", "link_id": "t3_gw311o", "parent_id": "t3_gw311o", "score": "7", "subreddit": "findapath", "subreddit_id": "t5_2wqq6"}, {"author": "illustriousgarb", "body": "Not only are you dealing with mental health issues, you are going through a global trauma on a scale that hasn't been seen in most of our lifetimes.\n\nPlease allow yourself some grace.\n\nTake one day at a time. Set a goal for that day. It can be as ambitious as a house project, or as minor as getting out of bed. If you don't meet that goal, that's okay. Little steps at a time. Every day, reflect on what good happened during the day. Stop putting yourself under the pressure to \"accomplish more.\" It's okay to come out of the lockdown with no new skills or projects. It's okay to not be okay.", "created_utc": "1590551979.0", "edited": "False", "id": "fry17um", "is_submitter": "False", "link_id": "t3_gr6ow6", "parent_id": "t3_gr6ow6", "score": "4", "subreddit": "findapath", "subreddit_id": "t5_2wqq6"}, {"author": "illustriousgarb", "body": "Of course not. In fact, I think it's wonderful to aspire to live a modest, but fulfilling life.\n\nThe \"productive member of society\" concept is an outdated idea. Let's be real, a lot of jobs are little more than busywork that makes someone else rich. It might pay the bills, but it's not fulfilling.\n\nI think that given the current situation in the world, and a growing dissatisfaction with the 40 (really more like 50+) hour work week, we are poised to have a lot more people looking into fulfillment, rather than money. You don't need to be a billionaire to be happy.", "created_utc": "1589999253.0", "edited": "False", "id": "fr9krfi", "is_submitter": "False", "link_id": "t3_gn4z6h", "parent_id": "t3_gn4z6h", "score": "7", "subreddit": "findapath", "subreddit_id": "t5_2wqq6"}, {"author": "illustriousgarb", "body": "I had a lactation consultant tell me this in the hospital after my first born. \"Rub it on your skin, it will make it better!\" No. It made it sticky.", "created_utc": "1586471685.0", "edited": "False", "id": "fmxtq3o", "is_submitter": "False", "link_id": "t3_fxzfpl", "parent_id": "t3_fxzfpl", "score": "25", "subreddit": "ShitMomGroupsSay", "subreddit_id": "t5_gajhd"}, {"author": "illustriousgarb", "body": "Like wtf is this person's issue? I have kids. I don't care if other people are using the same streaming service as us. I'd be more angry with Netflix.\n\nPeople without kids are allowed to enjoy things, too.", "created_utc": "1586470577.0", "edited": "False", "id": "fmxrpr4", "is_submitter": "False", "link_id": "t3_fy1d4h", "parent_id": "t3_fy1d4h", "score": "13", "subreddit": "ShitMomGroupsSay", "subreddit_id": "t5_gajhd"}, {"author": "illustriousgarb", "body": "I haven't looked into the psychology behind it very much, but there is a growing belief that what we think is \"laziness and procrastination\" is actually a symptom of a deeper issue. It could be that you're afraid of success. Or that you subconsciously don't want to go down this path. It could also be that you have depression, anxiety, or another undiagnosed health issue.\n\nFor myself, I'm always full of ideas, but depression and anxiety love to get in the way. It has absolutely hindered me. Working through it has helped me get some momentum, but it is always a struggle.\n\nIf you're full of ideas and inspiration, it's probably the right path, or at least the right direction. Take some time to reflect on what exactly it is that's making you procrastinate. Does the work seem too daunting? Are you afraid of success? Or is something else calling you? \n\nGood luck!", "created_utc": "1586470406.0", "edited": "False", "id": "fmxrele", "is_submitter": "False", "link_id": "t3_fxqihm", "parent_id": "t3_fxqihm", "score": "1", "subreddit": "findapath", "subreddit_id": "t5_2wqq6"}, {"author": "illustriousgarb", "body": "Leadership is not a weird path at all. Leadership takes a specific set of skills, and not everyone is cut out to be one. I'd recommend getting a solid foundation in business knowledge, and get networking. You don't say if you're planning to go to school or not, but business majors, MBAs, etc may be useful ways to do this depending on where you are in life. Look into leadership training and opportunities. Even being a shift manager at a fast food chain will give you some great insight into what it takes to be a leader.\n\nAs to what fields will be stable in the coming years, this is a bit more difficult to say than it was at the beginning of the year. The current global pandemic will have a significant economic impact, and we can't be completely sure how significant for a while yet. For sure, healthcare and pharmaceutical companies will be stable. I suspect technology companies will also stay pretty stable.", "created_utc": "1585759651.0", "edited": "False", "id": "fm4rujx", "is_submitter": "False", "link_id": "t3_fsvq0p", "parent_id": "t3_fsvq0p", "score": "1", "subreddit": "findapath", "subreddit_id": "t5_2wqq6"}, {"author": "illustriousgarb", "body": "So I don't have any experience in nautical science, so I can't help you there, but I do want to impart some advice I was once given. There's nothing we can do about our age, and teachers in universities (as well as mentors in a new field) often see adult career changers as people who are serious about their studies and learning. I don't think you should get too hung up on your age here. If nautical science is what you want to do, then go for it.\n\nA thought occurred to me as I was reading, too. You say you enjoy what you do, but not the environment. And you are expressing an interest in ships - what about kitchen/culinary work on cruise ships? And I don't know much about container ships, buy certainly they must have some sort of kitchen on board. Could an environment shift be beneficial? Could this even get you an \"in\" to the companies you mentioned? Just a thought I had, hope it helps!", "created_utc": "1585759186.0", "edited": "False", "id": "fm4qyob", "is_submitter": "False", "link_id": "t3_ft1070", "parent_id": "t3_ft1070", "score": "2", "subreddit": "findapath", "subreddit_id": "t5_2wqq6"}, {"author": "illustriousgarb", "body": "Oh why not.\n\nMe :)", "created_utc": "1579213999.0", "edited": "False", "id": "fel4pb0", "is_submitter": "False", "link_id": "t3_epoxbg", "parent_id": "t3_epoxbg", "score": "2", "subreddit": "findapath", "subreddit_id": "t5_2wqq6"}, {"author": "illustriousgarb", "body": "I love this!", "created_utc": "1574379166.0", "edited": "False", "id": "f89sdhx", "is_submitter": "False", "link_id": "t3_dzig9m", "parent_id": "t3_dzig9m", "score": "2", "subreddit": "Lolita", "subreddit_id": "t5_2sf5v"}, {"author": "illustriousgarb", "body": "Working abroad was one of the most educational and interesting experiences of my life. I will always recommend doing it if you can.", "created_utc": "1572555176.0", "edited": "False", "id": "f5yf1qv", "is_submitter": "False", "link_id": "t3_dpk1lf", "parent_id": "t3_dpk1lf", "score": "1", "subreddit": "findapath", "subreddit_id": "t5_2wqq6"}, {"author": "illustriousgarb", "body": "Taobao is basically Chinese Amazon. Taobao focus appears to be a shopping service for Taobao. Many people use shopping services to buy from Taobao, either because they can't buy direct (the shops don't ship everywhere), or they don't speak Mandarin.\n\nIt's legit, though, and both Taobao and their shopping services do their best to not sell knockoffs. They're so cheap because things can be manufactured for much cheaper in China. They are resold on the second hand market for more because shipping is expensive. Resellers like DevilInspired though, are trying to make a profit.\n\nI've been very happy with everything I've gotten from Taobao so far. It's not necessarily AP quality, but it's still pretty good.", "created_utc": "1569435709.0", "edited": "False", "id": "f1f2jqe", "is_submitter": "False", "link_id": "t3_d96u3r", "parent_id": "t3_d96u3r", "score": "12", "subreddit": "Lolita", "subreddit_id": "t5_2sf5v"}, {"author": "illustriousgarb", "body": "It's Nya Nya/ Cha Cha Love and Death! I have that one . Love it!", "created_utc": "1569344764.0", "edited": "False", "id": "f1bwutm", "is_submitter": "False", "link_id": "t3_d8poh6", "parent_id": "t1_f1buipw", "score": "6", "subreddit": "Lolita", "subreddit_id": "t5_2sf5v"}, {"author": "illustriousgarb", "body": "What is your go to for gothic lolita shoes? Everything I'm finding reads too \"sweet.\"", "created_utc": "1568924701.0", "edited": "False", "id": "f0tm41i", "is_submitter": "False", "link_id": "t3_d2gxo9", "parent_id": "t3_d2gxo9", "score": "3", "subreddit": "Lolita", "subreddit_id": "t5_2sf5v"}, {"author": "illustriousgarb", "body": "Yep. I totally ship Ciel x Lizzie. But I'm in the minority, I think.", "created_utc": "1568321365.0", "edited": "False", "id": "f020at4", "is_submitter": "False", "link_id": "t3_d1st5g", "parent_id": "t3_d1st5g", "score": "3", "subreddit": "blackbutler", "subreddit_id": "t5_2tu8z"}, {"author": "illustriousgarb", "body": "You could also try steaming! I've had good luck getting storage wrinkles out of delicate fabrics with my steamer.", "created_utc": "1567093571.0", "edited": "False", "id": "eyhvzoc", "is_submitter": "False", "link_id": "t3_cx1llp", "parent_id": "t1_eyhuv6l", "score": "5", "subreddit": "Lolita", "subreddit_id": "t5_2sf5v"}, {"author": "illustriousgarb", "body": "Wrinkling is generally fixable with ironing or steaming. If they are really bad, sometimes a wash or wrinkle release can also help. I'd save those for desperate times though, as the print can bleed if it isn't colorfast.\n\nFor Lolita dresses, I'd use a press cloth to iron the first time around. Keep the iron on the lowest setting that's necessary to get there wrinkles out.", "created_utc": "1567092796.0", "edited": "False", "id": "eyhu80y", "is_submitter": "False", "link_id": "t3_cx1llp", "parent_id": "t3_cx1llp", "score": "4", "subreddit": "Lolita", "subreddit_id": "t5_2sf5v"}, {"author": "illustriousgarb", "body": "I seriously love this dress. Trying to scrape together the funds to order it. :) I'm glad you got it!!", "created_utc": "1567092567.0", "edited": "False", "id": "eyhtofc", "is_submitter": "False", "link_id": "t3_cwlsi3", "parent_id": "t3_cwlsi3", "score": "2", "subreddit": "Lolita", "subreddit_id": "t5_2sf5v"}, {"author": "illustriousgarb", "body": "Hi! I've been interested in Lolita fashion since I learned about it on cosplay.com (/old), but I was always too scared to try it.\n\nI'm at a phase in my life where I give no fucks about what people think about me, so I'm finally diving in. I'm starting to document my journey into this fashion, and if I can get a spare moment, I'll get the videos up on YouTube.\n\nMy favorite substyle is Wa/Qi, but I seem to be mostly leaning towards Gothic and Classic styles.\n\nI'm also a costumer, writer, and I like to draw. I love fashion and clothing in general, especially \"slow\" fashion.", "created_utc": "1567092471.0", "edited": "False", "id": "eyhtgh2", "is_submitter": "False", "link_id": "t3_cvnzfz", "parent_id": "t3_cvnzfz", "score": "6", "subreddit": "Lolita", "subreddit_id": "t5_2sf5v"}, {"author": "illustriousgarb", "body": "Be careful with the traditional \"diet\" shakes, I found that some of them had more carbs than I could do for a snack. Oddly enough, the store generic ones had a carb count in the range that I could do.\n\nI actually liked protein bars for meal replacement, Balance bars in particular. They have a low glycemic index and taste better to me than some of the others.\n\nI'm afraid I don't know about almond milk, but your best bet is to check the carb content!", "created_utc": "1565978241.0", "edited": "False", "id": "ex30hzc", "is_submitter": "False", "link_id": "t3_cr91xm", "parent_id": "t3_cr91xm", "score": "2", "subreddit": "GestationalDiabetes", "subreddit_id": "t5_2w321"}, {"author": "illustriousgarb", "body": "I love her. And I've always loved her, lol. \n\nI think she is frequently misunderstood, though. And without going into spoiler territory, I think once she's had some time to process things, she'll be changing who she sides with.", "created_utc": "1565725747.0", "edited": "False", "id": "ewse9gi", "is_submitter": "False", "link_id": "t3_cmibte", "parent_id": "t3_cmibte", "score": "1", "subreddit": "blackbutler", "subreddit_id": "t5_2tu8z"}, {"author": "illustriousgarb", "body": "I don't necessarily think he's blowing you off, because it can take quite a bit for your body to return to normal, especially if you are breastfeeding. And your A1C is looking good. You're right to be concerned, but I think this one of those things that has to be diagnosed over time.\n\nAlso, remember that the parameters for GD are very tight, and what is normal for a non-pregnant person may be \"high\" for a pregnant one.", "created_utc": "1563895425.0", "edited": "False", "id": "eul0gpj", "is_submitter": "False", "link_id": "t3_cgttdw", "parent_id": "t3_cgttdw", "score": "3", "subreddit": "GestationalDiabetes", "subreddit_id": "t5_2w321"}, {"author": "illustriousgarb", "body": "I said cosplayer and writer, but for this I might dust off my art supplies lol.", "created_utc": "1561072856.0", "edited": "False", "id": "eroa4yz", "is_submitter": "False", "link_id": "t3_c2p3n5", "parent_id": "t3_c2p3n5", "score": "1", "subreddit": "blackbutler", "subreddit_id": "t5_2tu8z"}, {"author": "illustriousgarb", "body": "You've really never met anyone under 35 who can sew? I assure you, there are a ton. Especially with the cosplay boom.\n\nThat being said, I don't know too many people who take in jeans. They're not usually worth it.", "created_utc": "1559344681.0", "edited": "False", "id": "epohu8s", "is_submitter": "False", "link_id": "t3_bvdy4f", "parent_id": "t1_epoeu0d", "score": "4", "subreddit": "poshmark", "subreddit_id": "t5_34hq6"}, {"author": "illustriousgarb", "body": "So I have a Master's and went to a trade school for a post baccalaureate certificate. I recommend the latter, especially if you aren't certain what you want to do. Your Master's program is really a time to specialize, not so much exploring happens.\n\nYour local community college may offer some post-bacc certifications, so that is something to look into as well.\n\nHow do you handle stress and unconventional work schedules? My first thought for a suggestion is something in the hospitality industry. Bakery, restaurant, hotel work come to mind. And I don't necessarily mean the low-level work. Wanting to interact with people is a huge plus for management. But, as you already know as a barista, there's a lot of difficult aspects to hospitality. \n\nEvent planning also comes to mind, but there will be a fair about of administrative work that comes along with that. You'll have to decide if the good sides are enough to outweigh the bad sides.", "created_utc": "1559239921.0", "edited": "False", "id": "epijdtj", "is_submitter": "False", "link_id": "t3_buvyss", "parent_id": "t3_buvyss", "score": "2", "subreddit": "findapath", "subreddit_id": "t5_2wqq6"}, {"author": "illustriousgarb", "body": "Someone get the creator of this meme a Nobel prize! The cure for cancer was in fruit all along! Take that Big pHARMa.\n\n/S in case not obvious", "created_utc": "1557530845.0", "edited": "False", "id": "en2e9w8", "is_submitter": "False", "link_id": "t3_bn54db", "parent_id": "t3_bn54db", "score": "166", "subreddit": "ShitMomGroupsSay", "subreddit_id": "t5_gajhd"}, {"author": "illustriousgarb", "body": "My eyes burn just reading this.", "created_utc": "1557443523.0", "edited": "False", "id": "emyt9an", "is_submitter": "False", "link_id": "t3_bmqjhh", "parent_id": "t3_bmqjhh", "score": "54", "subreddit": "ShitMomGroupsSay", "subreddit_id": "t5_gajhd"}, {"author": "illustriousgarb", "body": "Nooooooooooo! I love my Thinx..... I'll have to find an alternative if they go MLM.", "created_utc": "1556645388.0", "edited": "False", "id": "em5jdhc", "is_submitter": "False", "link_id": "t3_bj5xk6", "parent_id": "t3_bj5xk6", "score": "3", "subreddit": "antiMLM", "subreddit_id": "t5_2swge"}, {"author": "illustriousgarb", "body": "To declutter!", "created_utc": "1555619918.0", "edited": "False", "id": "el7s3oy", "is_submitter": "False", "link_id": "t3_ben7en", "parent_id": "t3_ben7en", "score": "4", "subreddit": "poshmark", "subreddit_id": "t5_34hq6"}, {"author": "illustriousgarb", "body": "White person married to a POC here.\n\nMy biggest issue with this is it's yet another white person \"getting offended\" on behalf of POC without any POC starting the conversation. We don't get to decide what is and isn't offensive to POC, and acting like some superior white person by \"calling out\" without being asked is just another way to marginalize them.\n\nOffensive pieces are gross and should not actively be searched out, and probably not sold, but you have zero idea what a supposed white person (as others have said, you can't tell just from a profile) knows about cultural items. I have a bunch of kimono and items from Japanese and Thai culture. I know what they mean and how to appropriately wear them because I've done a shit load of research. In all fairness, I probably wouldn't sell the cultural pieces on Poshmark, because there is a better second hand market for them elsewhere.", "created_utc": "1555616024.0", "edited": "False", "id": "el7lpzl", "is_submitter": "False", "link_id": "t3_ben8ux", "parent_id": "t3_ben8ux", "score": "16", "subreddit": "poshmark", "subreddit_id": "t5_34hq6"}, {"author": "illustriousgarb", "body": "It depends on what is \"too hot\" for you. I've visited Thailand/Vietnam in May and it was quite pleasant, but I love heat. Also, the temperatures vary depending on where you're going - some locations don't have big differences in temperature throughout the year.\n\nI'd be more concerned about monsoon season, tbh.", "created_utc": "1551907085.0", "edited": "False", "id": "ehy28jg", "is_submitter": "False", "link_id": "t3_ay419k", "parent_id": "t3_ay419k", "score": "2", "subreddit": "travel", "subreddit_id": "t5_2qh41"}, {"author": "illustriousgarb", "body": "Yes, I think probably in the neighborhood of 5 years now.", "created_utc": "1550287919.0", "edited": "False", "id": "egksi5i", "is_submitter": "False", "link_id": "t3_ar1qoo", "parent_id": "t1_egkdk6u", "score": "2", "subreddit": "Lolita", "subreddit_id": "t5_2sf5v"}, {"author": "illustriousgarb", "body": "This is why I get so damned frustrated when people try to sell me essential oils when I'm fighting an infection. I'm already prone to pneumonia due to some respiratory issues I had when I was younger. I've already had issues from being too close to a forest fire, why the fuck would I invite that shit into my own home?", "created_utc": "1550165841.0", "edited": "False", "id": "eggxrwg", "is_submitter": "False", "link_id": "t3_aqlk8m", "parent_id": "t3_aqlk8m", "score": "3", "subreddit": "antiMLM", "subreddit_id": "t5_2swge"}, {"author": "illustriousgarb", "body": "What the hell? This is a new one.", "created_utc": "1550165504.0", "edited": "False", "id": "eggx9zr", "is_submitter": "False", "link_id": "t3_aqlwyr", "parent_id": "t3_aqlwyr", "score": "2", "subreddit": "ShitMomGroupsSay", "subreddit_id": "t5_gajhd"}, {"author": "illustriousgarb", "body": "How times have changed. I never sang the Pledge of Allegiance either. We only recited it. \n\nI'm so tired of \"we can't talk about God in schools.\" Yes you fucking can. Teachers/administrators just can't pontificate or force students to engage in religious activities like prayer. How terrible that not everyone is Christian. (/S in case not obvious)", "created_utc": "1550080644.0", "edited": "False", "id": "egeaphz", "is_submitter": "False", "link_id": "t3_aq8rn9", "parent_id": "t3_aq8rn9", "score": "62", "subreddit": "ShitMomGroupsSay", "subreddit_id": "t5_gajhd"}, {"author": "illustriousgarb", "body": "If I'm paying nearly $100 for a damn drink, it better be the best goddamn alcohol I've ever had.", "created_utc": "1549984242.0", "edited": "False", "id": "egb5cu1", "is_submitter": "False", "link_id": "t3_aptesv", "parent_id": "t3_aptesv", "score": "27", "subreddit": "antiMLM", "subreddit_id": "t5_2swge"}, {"author": "illustriousgarb", "body": "I miss when Scary Mommy was a fun page to follow. Now its just fanning the flames of stupid mommy wars.", "created_utc": "1549984125.0", "edited": "False", "id": "egb57a5", "is_submitter": "False", "link_id": "t3_apti8b", "parent_id": "t3_apti8b", "score": "6", "subreddit": "ShitMomGroupsSay", "subreddit_id": "t5_gajhd"}, {"author": "illustriousgarb", "body": "Literally every time I've gone abroad with a tour group, some whiney A-hole cries about how they don't speak English in said country. Brenda, if you wanted to go somewhere where everyone spoke English, why did you pay money to come to Korea?", "created_utc": "1548864484.0", "edited": "False", "id": "efd8zxz", "is_submitter": "False", "link_id": "t3_alcf59", "parent_id": "t3_alcf59", "score": "1", "subreddit": "pics", "subreddit_id": "t5_2qh0u"}, {"author": "illustriousgarb", "body": "The WHO has a money making business?\n\nAlso Karen, you're keeping \"big medicine\" in business by spreading disease but okay about being woke.", "created_utc": "1548233299.0", "edited": "False", "id": "eer7w5u", "is_submitter": "False", "link_id": "t3_aiwcz2", "parent_id": "t3_aiwcz2", "score": "27", "subreddit": "ShitMomGroupsSay", "subreddit_id": "t5_gajhd"}, {"author": "illustriousgarb", "body": "My husband had this issue too. Can confirm, it is that bad. I drink, and I'll offer him sips of what I'm having, but it's really not that hard to just take no for an answer.\n\n\"Would you like some wine?\" \n\"No thanks.\"\n\"Cool, how about a soda or something else?\"\n\nNot hard.", "created_utc": "1547768032.0", "edited": "False", "id": "eeb8ykn", "is_submitter": "False", "link_id": "t3_agy2m7", "parent_id": "t1_eea03j9", "score": "4", "subreddit": "antiMLM", "subreddit_id": "t5_2swge"}, {"author": "illustriousgarb", "body": "I hate that! And I hate being referred to as such by grown ass adults. Unless you're talking with my kid, use my name. ", "created_utc": "1547570156.0", "edited": "False", "id": "ee4nrgy", "is_submitter": "False", "link_id": "t3_ag8cc8", "parent_id": "t1_ee48k2l", "score": "5", "subreddit": "antiMLM", "subreddit_id": "t5_2swge"}, {"author": "illustriousgarb", "body": "Given that the mucus and hair in your nose are the first defense against airborne pathogens, it seems like a bad idea to shove a cream up there, antibiotic or not.\n\nProper hand washing and vaccination are still your best bets in flu prevention.", "created_utc": "1547516779.0", "edited": "False", "id": "ee39cbq", "is_submitter": "False", "link_id": "t3_ag2tny", "parent_id": "t3_ag2tny", "score": "87", "subreddit": "ShitMomGroupsSay", "subreddit_id": "t5_gajhd"}, {"author": "illustriousgarb", "body": "Well....those are all certainly words.", "created_utc": "1547335465.0", "edited": "False", "id": "edxjyl9", "is_submitter": "False", "link_id": "t3_afczq1", "parent_id": "t3_afczq1", "score": "71", "subreddit": "antiMLM", "subreddit_id": "t5_2swge"}, {"author": "illustriousgarb", "body": ".... What the fuck. My oldest daughter loves cars and construction. Lots of traditional \"boy\" things. Check your damn assumptions, lady. It's 2019, not 1940.\n\nAlso, you won't breastfeed a baby girl, but you would breastfeed a baby boy? I'm totally pro-\"feeding your child however you want....\" But damn there's a lot to unpack there. ", "created_utc": "1547051183.0", "edited": "False", "id": "edn5vur", "is_submitter": "False", "link_id": "t3_ae8cdl", "parent_id": "t3_ae8cdl", "score": "1036", "subreddit": "ShitMomGroupsSay", "subreddit_id": "t5_gajhd"}, {"author": "illustriousgarb", "body": "\"I'd rather have a dead baby than an autistic one.\"\n\nFucking gross from literally every angle.", "created_utc": "1546813827.0", "edited": "False", "id": "edf8dt5", "is_submitter": "False", "link_id": "t3_adahl3", "parent_id": "t3_adahl3", "score": "654", "subreddit": "ShitMomGroupsSay", "subreddit_id": "t5_gajhd"}, {"author": "illustriousgarb", "body": "Oh man, I don't have alpha-gal, but I do get sick when I eat meat, so I feel you on this. I'm glad my reaction is minor GI upset. Anaphylaxis is scary stuff.", "created_utc": "1546751967.0", "edited": "False", "id": "edd02a3", "is_submitter": "False", "link_id": "t3_ad2drz", "parent_id": "t1_edcxkch", "score": "6", "subreddit": "antiMLM", "subreddit_id": "t5_2swge"}, {"author": "illustriousgarb", "body": "I'm not yet postpartum, so I can't speak to that, but I wouldn't worry too much about your numbers right now. Even if you had an easy delivery, your body is all out of whack right now with healing, sleep deprivation, etc. It's likely that your blood sugars will be wacky, too.", "created_utc": "1546739632.0", "edited": "False", "id": "edciwdw", "is_submitter": "False", "link_id": "t3_ad03fr", "parent_id": "t3_ad03fr", "score": "2", "subreddit": "GestationalDiabetes", "subreddit_id": "t5_2w321"}, {"author": "illustriousgarb", "body": "She's either straight up lying, or doesn't understand what \"FDA approved\" actually means. I suspect the latter. An alarming number of people think that anything that is sold as a \"thing to put in your body\" means the FDA has approved of its sale.", "created_utc": "1546735282.0", "edited": "False", "id": "edccygu", "is_submitter": "False", "link_id": "t3_acysai", "parent_id": "t1_edcaj7c", "score": "19", "subreddit": "antiMLM", "subreddit_id": "t5_2swge"}, {"author": "illustriousgarb", "body": "I would totally trust a source called \"Vaxxter.\"\n\nSeriously though, they love to freak out about including more than one vaccine per jab, but the reality is that it isn't going to overwhelm a child's immune system. The FDA is serious about making sure this stuff is safe. This hysteria drives me nuts.", "created_utc": "1546733103.0", "edited": "False", "id": "edc9qg6", "is_submitter": "False", "link_id": "t3_aczsbo", "parent_id": "t3_aczsbo", "score": "25", "subreddit": "ShitMomGroupsSay", "subreddit_id": "t5_gajhd"}, {"author": "illustriousgarb", "body": "You're correct. Oils, vitamins, supplements....none of these are FDA regulated. ", "created_utc": "1546732888.0", "edited": "False", "id": "edc9dtm", "is_submitter": "False", "link_id": "t3_acysai", "parent_id": "t3_acysai", "score": "24", "subreddit": "antiMLM", "subreddit_id": "t5_2swge"}, {"author": "illustriousgarb", "body": "You said you don't want to be in the lab environment anymore, but the first thing I thought of when I finished reading your post was veterinary lab work. I imagine you'd probably have to get some sort of formal schooling eventually, but with your skill set and love of animals, I wonder if this is something you've considered? I live near a major university and I know they have a whole department dedicated to veterinary diagnostics, and they pay for further education.\n\nEdit: words", "created_utc": "1546699993.0", "edited": "False", "id": "edavqer", "is_submitter": "False", "link_id": "t3_ac70e5", "parent_id": "t3_ac70e5", "score": "1", "subreddit": "findapath", "subreddit_id": "t5_2wqq6"}, {"author": "illustriousgarb", "body": "And this mentality is why women are winding up with PPD exacerbated by breastfeeding pressure. Look, if it works for you and you enjoy it, that's awesome! But formula is a totally fine option for those of us who cannot or do not want to breastfeed. ", "created_utc": "1546649248.0", "edited": "False", "id": "ed9llsk", "is_submitter": "False", "link_id": "t3_acom2w", "parent_id": "t3_acom2w", "score": "130", "subreddit": "ShitMomGroupsSay", "subreddit_id": "t5_gajhd"}, {"author": "illustriousgarb", "body": "And McDonald's actually can be a decent source of nutrition, if one is mindful of what they order! It's a shitty comparison intended to shame formula feeders.", "created_utc": "1546649122.0", "edited": "False", "id": "ed9lgch", "is_submitter": "False", "link_id": "t3_acom2w", "parent_id": "t1_ed9l3bs", "score": "25", "subreddit": "ShitMomGroupsSay", "subreddit_id": "t5_gajhd"}, {"author": "illustriousgarb", "body": "Look at this food that I'm cooking! Boiling water is GMOzes!", "created_utc": "1546647640.0", "edited": "False", "id": "ed9jo4r", "is_submitter": "False", "link_id": "t3_acofm1", "parent_id": "t3_acofm1", "score": "319", "subreddit": "ShitMomGroupsSay", "subreddit_id": "t5_gajhd"}, {"author": "illustriousgarb", "body": "People love to believe that \"you get what you deserve,\" and especially so when it comes to diabetes. Hell, even in other subs on Reddit, you'll see people talking about how \"diabetes is your fault because you ate too much sugar.\" But that's not how it works, as virtually all of us here have discovered. Shitty luck and genetics are the biggest factors, but it's so ingrained in us to believe diabetes is somehow our fault, that many of us feel ashamed and shocked when we get the GD diagnosis.", "created_utc": "1546568087.0", "edited": "False", "id": "ed718xi", "is_submitter": "False", "link_id": "t3_acbtv4", "parent_id": "t1_ed6vie5", "score": "6", "subreddit": "GestationalDiabetes", "subreddit_id": "t5_2w321"}, {"author": "illustriousgarb", "body": "Yeah, the stigma is real. I've had to stop talking about my GD with most people because they think they know better than my RD and test results when it comes to what I eat. I've literally had my in-laws bring me food that I can't eat and argue that it's not processed/organic/whatever, so surely I can eat it. \n\nAnd there are the general misconceptions about what diabetes even is. I was in shock when I was first diagnosed, because I had barely gained any weight this pregnancy, and they kept chastising me about it. I didn't understand how I could possibly be diabetic when I hadn't even gained 10lbs. Now I'm losing weight on the GD diet and still getting chastised about it....sigh.\n\nFortunately I'm far enough into it that I've figured out where I can relax a little, but those first few weeks of figuring out what my body would and wouldn't react to....they we're tough. I can't wait to be able to eat real pasta again.", "created_utc": "1546567758.0", "edited": "False", "id": "ed70ujn", "is_submitter": "False", "link_id": "t3_acbtv4", "parent_id": "t1_ed6w9af", "score": "4", "subreddit": "GestationalDiabetes", "subreddit_id": "t5_2w321"}, {"author": "illustriousgarb", "body": "This is me, too. In some situations, I'm quite chatty. In others, I prefer to be alone and quiet. I think we are too quick to fall into introvert vs. extrovert. It's rare that someone is only one or the other.", "created_utc": "1546397883.0", "edited": "False", "id": "ed1zzvv", "is_submitter": "False", "link_id": "t3_abnmnk", "parent_id": "t1_ed1x2cx", "score": "6", "subreddit": "Showerthoughts", "subreddit_id": "t5_2szyo"}, {"author": "illustriousgarb", "body": "I definitely think there is more to R!Ciel being manipulative than the flashbacks have let on. We know that *something* went down the night of the murders, because of Tanaka starting to tell O!Ciel that something had happened with his twin, but he gets cut off. Some fans speculate that R!Ciel himself may be responsible for the murders somehow.\n\nIn any case, I think you're right.", "created_utc": "1546397451.0", "edited": "False", "id": "ed1zif5", "is_submitter": "False", "link_id": "t3_aboupv", "parent_id": "t3_aboupv", "score": "17", "subreddit": "blackbutler", "subreddit_id": "t5_2tu8z"}, {"author": "illustriousgarb", "body": "Yes, there are many legitimate ways to work from home nowadays. I am personally fond of the Rat Race Rebellion website, because they post legitimate remote work positions from reputable companies that actually exist. \n\nOne pitfall of remote work is that it can be difficult to do while also caring for children. Many positions, especially customer service ones, require a quiet environment. They are also typically shift work.\n\nAnother option is to start your own (legit, not joining an MLM) business, but again, it's pretty work intensive and may not be suitable for someone simultaneously providing childcare.\n\nI'm a stay at home mom, and I've found that the most efficient way to financially support my family is through part time work where I can hand off the childcare duties to my husband, and also through couponing, rebate apps, etc. These things seem trivial, but when you're saving hundreds to thousands of dollars a year, it makes a difference.\n\nGood luck to your friend. It can be done! But avoid MLMs like the plague!", "created_utc": "1546360183.0", "edited": "False", "id": "ed0nk36", "is_submitter": "False", "link_id": "t3_abjcv9", "parent_id": "t3_abjcv9", "score": "31", "subreddit": "antiMLM", "subreddit_id": "t5_2swge"}, {"author": "illustriousgarb", "body": "*5 likes.*\n\nJesus these people are sick.", "created_utc": "1546356405.0", "edited": "False", "id": "ed0jz5p", "is_submitter": "False", "link_id": "t3_abitah", "parent_id": "t3_abitah", "score": "930", "subreddit": "ShitMomGroupsSay", "subreddit_id": "t5_gajhd"}, {"author": "illustriousgarb", "body": "And then the aliens came down and gave him a PhD.\n\nIt definitely sounds like satire though.", "created_utc": "1546286365.0", "edited": "False", "id": "ecyrvwi", "is_submitter": "False", "link_id": "t3_abag9l", "parent_id": "t3_abag9l", "score": "1416", "subreddit": "ShitMomGroupsSay", "subreddit_id": "t5_gajhd"}, {"author": "illustriousgarb", "body": "How terrible that my husband has to change a diaper while I'm out earning money, or - God forbid - enjoying some \"kid free\" time!! ", "created_utc": "1546112862.0", "edited": "False", "id": "ectkfoi", "is_submitter": "False", "link_id": "t3_aanvj3", "parent_id": "t3_aanvj3", "score": "248", "subreddit": "ShitMomGroupsSay", "subreddit_id": "t5_gajhd"}, {"author": "illustriousgarb", "body": "Yep. Most likely. I've seen women shocked that other people aren't okay with eating baked goods that contain breastmilk. ", "created_utc": "1546112764.0", "edited": "False", "id": "ectkaz7", "is_submitter": "False", "link_id": "t3_aao5ln", "parent_id": "t3_aao5ln", "score": "4", "subreddit": "ShitMomGroupsSay", "subreddit_id": "t5_gajhd"}, {"author": "illustriousgarb", "body": "My daughter has this! It makes her hair really messy, sadly.", "created_utc": "1546101836.0", "edited": "False", "id": "ect6fqo", "is_submitter": "False", "link_id": "t3_aal7la", "parent_id": "t3_aal7la", "score": "1", "subreddit": "mildlyinteresting", "subreddit_id": "t5_2ti4h"}, {"author": "illustriousgarb", "body": "This is absolutely disgusting. I'm sorry that this Hun is preying on your willingness to open up about ED. ", "created_utc": "1546033729.0", "edited": "False", "id": "ecrdji5", "is_submitter": "False", "link_id": "t3_aaeoc7", "parent_id": "t3_aaeoc7", "score": "10", "subreddit": "antiMLM", "subreddit_id": "t5_2swge"}, {"author": "illustriousgarb", "body": "I have VPI, but there are lots of options out there! It might even be worth talking to your vet to see what they recommend.", "created_utc": "1546032270.0", "edited": "False", "id": "ecrbj2x", "is_submitter": "False", "link_id": "t3_aad0i8", "parent_id": "t1_ecraagv", "score": "2", "subreddit": "aww", "subreddit_id": "t5_2qh1o"}, {"author": "illustriousgarb", "body": "I know someone already suggested pet insurance to you, but it's still a good idea to have this savings plan in place. The way my insurance works for my dogs is that I have to pay the bill upfront and they reimburse me some percentage, depending on what had to be done. It has definitely been worth it for me (my late good girl had around $15k of surgeries and I was reimbursed for most of it), but having that money set aside can still save your bacon in the interim.", "created_utc": "1546029745.0", "edited": "False", "id": "ecr7ru6", "is_submitter": "False", "link_id": "t3_aad0i8", "parent_id": "t1_ecr340t", "score": "2", "subreddit": "aww", "subreddit_id": "t5_2qh1o"}, {"author": "illustriousgarb", "body": "There's an oil for that, right?", "created_utc": "1546020673.0", "edited": "False", "id": "ecqtbn2", "is_submitter": "False", "link_id": "t3_aacjoo", "parent_id": "t1_ecqt8zi", "score": "17", "subreddit": "ShitMomGroupsSay", "subreddit_id": "t5_gajhd"}, {"author": "illustriousgarb", "body": "I'm not going to trust an electrician just because he went to school and apprenticed for the job. I can just wire my own house after 20 minutes of googling!", "created_utc": "1546020594.0", "edited": "False", "id": "ecqt7st", "is_submitter": "False", "link_id": "t3_aacjoo", "parent_id": "t3_aacjoo", "score": "55", "subreddit": "ShitMomGroupsSay", "subreddit_id": "t5_gajhd"}, {"author": "illustriousgarb", "body": "I'm in the start-up phase for a clothing brand, and this advice has actually been given to me - to look for \"free for trade\" or whatever photoshoots, where I basically get free photos in return for the photographer to use my photos in his/her portfolio. I can't bring myself to do this. Sure, I don't have a huge budget, or really much money at all, but good product shots are vital for sales, and good photos take work. Product shots are really not the place to cheap out in business ", "created_utc": "1546020110.0", "edited": "False", "id": "ecqskaf", "is_submitter": "False", "link_id": "t3_aaa6pr", "parent_id": "t1_ecqmn74", "score": "3", "subreddit": "ChoosingBeggars", "subreddit_id": "t5_35fmc"}, {"author": "illustriousgarb", "body": "Hell yes.  If my family and friends want to see all my stuff, have at it, but they can choose not to watch. Also, I'd take them on a kick ass vacation so I'm sure they'd be cool with my decision.", "created_utc": "1545973006.0", "edited": "False", "id": "ecpj6h9", "is_submitter": "False", "link_id": "t3_aa1bx1", "parent_id": "t3_aa1bx1", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "illustriousgarb", "body": "\"Big calcium.\" Wut. Is that like big hydrogen?", "created_utc": "1545965717.0", "edited": "False", "id": "ecpav0z", "is_submitter": "False", "link_id": "t3_aa5pd9", "parent_id": "t1_ecp98yj", "score": "37", "subreddit": "antiMLM", "subreddit_id": "t5_2swge"}, {"author": "illustriousgarb", "body": "If that kid truly broke his arm, he's in for a future of surgeries trying to repair the damage being done by mommy's woo.\n\nBut I agree that it's probably generous use of the term \"broken.\" I've had a pretty serious break in my wrist, and compression helped ease the pain, but it sure as hell didn't fix the fact that I couldn't move my wrist.", "created_utc": "1545965552.0", "edited": "False", "id": "ecpaoco", "is_submitter": "False", "link_id": "t3_aa5vy6", "parent_id": "t3_aa5vy6", "score": "95", "subreddit": "ShitMomGroupsSay", "subreddit_id": "t5_gajhd"}, {"author": "illustriousgarb", "body": "Are you in the US? Walgreens may have some inexpensive test strips that can get you through. When my insurance company wasn't going to pay for my lancets until a certain date, the pharmacist pointed out that they had a very inexpensive generic that could get me through. I ended up not needing them, but it was nice to have the option of spending $10 instead of $28.", "created_utc": "1545955090.0", "edited": "False", "id": "ecoyx92", "is_submitter": "False", "link_id": "t3_aa3tdh", "parent_id": "t3_aa3tdh", "score": "3", "subreddit": "GestationalDiabetes", "subreddit_id": "t5_2w321"}, {"author": "illustriousgarb", "body": "\"love on them with oils\"\n\nWell, that's fucking creepy.", "created_utc": "1545954863.0", "edited": "False", "id": "ecoyntk", "is_submitter": "False", "link_id": "t3_aa41xo", "parent_id": "t3_aa41xo", "score": "141", "subreddit": "ShitMomGroupsSay", "subreddit_id": "t5_gajhd"}, {"author": "illustriousgarb", "body": "As a pregnant woman with gestational diabetes ready to deliver any day now, everything about this post pisses me off.\n\nP.S. if blood sugar is your concern, fucking crackers are a terrible choice.", "created_utc": "1545954587.0", "edited": "False", "id": "ecoyc9j", "is_submitter": "False", "link_id": "t3_aa49w3", "parent_id": "t3_aa49w3", "score": "17", "subreddit": "antiMLM", "subreddit_id": "t5_2swge"}, {"author": "illustriousgarb", "body": "A blood panel is what helped us determine that my dog had problems with her parathyroids, and that was why she was inappropriately urinating. We thought she was just getting old and nearing her time. Because of that blood panel, we were able to treat her with surgery and give her a few more years and good quality of life for the time she did have left. And she stopped peeing in the house, which was awesome for us.\n\nSo seriously people, spend the extra money and get the blood panel done. You might just be able to give your pet a bit more quality time with you.", "created_utc": "1545883096.0", "edited": "False", "id": "ecmul6r", "is_submitter": "False", "link_id": "t3_a9pnse", "parent_id": "t1_eclzirn", "score": "3", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "illustriousgarb", "body": "This mentality drives me batshit insane. \n\nMy dad retired from a company last year after being there for 20 years because after being the golden boy for years, he suddenly was \"not a team player\" because he refused to give into his boss' insane demands. She would expect him to work from home after his 8 hour shift at the company and 2 hour commute home. He had to take time off to care for my mother after a significant surgery, but he offered to work from home. Apparently this was unacceptable, and his boss literally made him write up a report what he did everyday. They were basically creating a paper trail to let him go - sadly this is a very common trend for people approaching retirement, especially when they've been at the company for a long time. \n\nYour employer doesn't give a shit about you and will replace you in a heartbeat if they can find someone for cheaper. Don't throw away your personal life for them.", "created_utc": "1545875336.0", "edited": "False", "id": "ecmlo9o", "is_submitter": "False", "link_id": "t3_a9oqxi", "parent_id": "t1_eclna85", "score": "3", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "illustriousgarb", "body": "I've seen a couple of theories that Undertaker somehow \"stole\" R!Ciel's soul back from Sebastian when he stabbed him on the Campania with his sythe. \n\nIt's an interesting idea, but I'm not certain of it's plausibility. R!Ciel seems to be pretty close to the real deal, but it's a bit of a stretch to think there's any way for a soul to be retrieved once a demon has eaten it.", "created_utc": "1545718383.0", "edited": "False", "id": "eci8ife", "is_submitter": "False", "link_id": "t3_a9arh3", "parent_id": "t3_a9arh3", "score": "3", "subreddit": "blackbutler", "subreddit_id": "t5_2tu8z"}, {"author": "illustriousgarb", "body": "\"why should I take my child to a well child check just to be told he's healthy?\"\n\nWell, Karen, I know this might be surprising, but preventative care is done to catch issues early, and you know, prevent bigger issues. There's an oil for how stupid you are, I'm sure.", "created_utc": "1545628206.0", "edited": "False", "id": "ecfus5q", "is_submitter": "False", "link_id": "t3_a91r0w", "parent_id": "t3_a91r0w", "score": "7", "subreddit": "antiMLM", "subreddit_id": "t5_2swge"}, {"author": "illustriousgarb", "body": "It could definitely be the stress and lack of sleep.\n\nIt could also be your meter, or something you touched prior to testing. Do you have a test solution to check and make sure your meter isn't off? \n\nYou could also just be developing more insulin resistance. It's pretty common as your pregnancy progresses, unfortunately. I had the exact same meal one week apart, and the first week it was okay, the second it was way high. GD can be so frustrating.", "created_utc": "1545529504.0", "edited": "False", "id": "eccusa4", "is_submitter": "False", "link_id": "t3_a8q9t1", "parent_id": "t3_a8q9t1", "score": "2", "subreddit": "GestationalDiabetes", "subreddit_id": "t5_2w321"}, {"author": "illustriousgarb", "body": "How awful! Listening to an educated professional over a random mom on Facebook! Such persecution!", "created_utc": "1545413134.0", "edited": "False", "id": "ec9hd1j", "is_submitter": "False", "link_id": "t3_a8c4o6", "parent_id": "t3_a8c4o6", "score": "60", "subreddit": "ShitMomGroupsSay", "subreddit_id": "t5_gajhd"}, {"author": "illustriousgarb", "body": "99% of laboratory scenes. \"Let me just run this random sample through this machine and I have all these forensic data!\"\n\nNo lab has that kind of money. Prep work takes a long time. There's not a magic database full of criminals that the whole lab has access to. Also, for fuck's sake, no food in the lab!!!!", "created_utc": "1545337955.0", "edited": "False", "id": "ec7cx19", "is_submitter": "False", "link_id": "t3_a81bcw", "parent_id": "t3_a81bcw", "score": "3", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "illustriousgarb", "body": "I can't pronounce it, so it must be dangerous.", "created_utc": "1545321370.0", "edited": "False", "id": "ec6r0gt", "is_submitter": "False", "link_id": "t3_a7yprd", "parent_id": "t3_a7yprd", "score": "45", "subreddit": "antiMLM", "subreddit_id": "t5_2swge"}, {"author": "illustriousgarb", "body": "He doesn't even believe that vaccines cause autism. He was just trying to discredit the existing MMR vaccine so he could patent his own and make money. These people make him into a martyr, and they don't even take the time to figure out why he lost his medical license. ", "created_utc": "1545321286.0", "edited": "False", "id": "ec6qwln", "is_submitter": "False", "link_id": "t3_a7yri6", "parent_id": "t3_a7yri6", "score": "3", "subreddit": "ShitMomGroupsSay", "subreddit_id": "t5_gajhd"}, {"author": "illustriousgarb", "body": "I bawled my eyes out when I got the diagnosis. I think many of us did! It's an especially crappy time of year to be on a restricted diet!", "created_utc": "1545321031.0", "edited": "False", "id": "ec6qksg", "is_submitter": "False", "link_id": "t3_a7yzg4", "parent_id": "t1_ec6qgmx", "score": "3", "subreddit": "GestationalDiabetes", "subreddit_id": "t5_2w321"}, {"author": "illustriousgarb", "body": "In that case, I'm definitely inclined to think it skewed your results. Fingers crossed that you pass the 3 hour test with flying colors!", "created_utc": "1545320858.0", "edited": "False", "id": "ec6qcq5", "is_submitter": "False", "link_id": "t3_a7yzg4", "parent_id": "t1_ec6q7zn", "score": "2", "subreddit": "GestationalDiabetes", "subreddit_id": "t5_2w321"}, {"author": "illustriousgarb", "body": "Drinking the hot chocolate may have thrown off your results, if you drank it during the time you were supposed to be fasting. But not all doctors require the fasting. Did you tell them about the hot chocolate? \n\nThe good news is that the 3 hour test will give you a definitive answer.", "created_utc": "1545320684.0", "edited": "False", "id": "ec6q4q8", "is_submitter": "False", "link_id": "t3_a7yzg4", "parent_id": "t3_a7yzg4", "score": "2", "subreddit": "GestationalDiabetes", "subreddit_id": "t5_2w321"}, {"author": "illustriousgarb", "body": "The arts are tricky, but if you're willing to be flexible, I see a few options here.\n\nOne is in academia. That will of course require a Master's at minimum, most likely a PhD. You could teach music comp and eighteenth century music history at the University level. That will also leave the door open to compose in your particular area of interest.\n\nAnother is teaching high school orchestra. This will require a teaching certification. Downsides include being pulled away from composition and dealing with current education issues.\n\nAnother option might be to work in a piano or music store, especially one that does repairs. That could get you experience with the construction of keyboard instruments without extra schooling.\n\nThis isn't necessarily a career, but creating content online is one way that artistic people find a way to monetize their passions. It's tough work, and you'll need to have some sort of day job, but that could also be a way to keep composing.\n\nMost likely, you'll need to find some combination of music-related work to keep the bills paid. But it can definitely be done. I'm not a musician, but I'm also in the arts, so I get the struggle with that lack of lucrative career options. The good news is that a lot of artists are able to make something work so that they can continue with their passions. Good luck!", "created_utc": "1545281356.0", "edited": "False", "id": "ec5u30r", "is_submitter": "False", "link_id": "t3_a7mf1a", "parent_id": "t3_a7mf1a", "score": "2", "subreddit": "findapath", "subreddit_id": "t5_2wqq6"}, {"author": "illustriousgarb", "body": "Lab testing at a pharmaceutical company or pharmaceutical contracting company. You usually can't get a research position at the entry level, but most of these companies have an R&D department that you can work your way into.", "created_utc": "1545280446.0", "edited": "False", "id": "ec5t6nb", "is_submitter": "False", "link_id": "t3_a7mfq1", "parent_id": "t3_a7mfq1", "score": "1", "subreddit": "findapath", "subreddit_id": "t5_2wqq6"}, {"author": "illustriousgarb", "body": "Oh yes. Every once in a while, one will pop in and try and convince us that MLMs aren't pyramid schemes, we're just haters who failed at MLMs, etc etc. ", "created_utc": "1545267440.0", "edited": "False", "id": "ec5f0tb", "is_submitter": "False", "link_id": "t3_a7scuj", "parent_id": "t3_a7scuj", "score": "69", "subreddit": "antiMLM", "subreddit_id": "t5_2swge"}, {"author": "illustriousgarb", "body": "And then the entire internet stood up and clapped.", "created_utc": "1545264134.0", "edited": "False", "id": "ec5bfih", "is_submitter": "False", "link_id": "t3_a7ruxv", "parent_id": "t3_a7ruxv", "score": "16", "subreddit": "ShitMomGroupsSay", "subreddit_id": "t5_gajhd"}, {"author": "illustriousgarb", "body": "That's disgusting. That poor woman. I hope she never babysits for that Hun again.", "created_utc": "1545259314.0", "edited": "False", "id": "ec55v3w", "is_submitter": "False", "link_id": "t3_a7rf8h", "parent_id": "t3_a7rf8h", "score": "112", "subreddit": "antiMLM", "subreddit_id": "t5_2swge"}, {"author": "illustriousgarb", "body": "Yes, all of this. Fight or flight is real and powerful. I was shocked at how I reacted when faced with a life-threatening situation, it was nothing like I had imagined. Having a plan is a great idea, but your instincts WILL take over.", "created_utc": "1545232512.0", "edited": "False", "id": "ec46qc8", "is_submitter": "False", "link_id": "t3_a7fmzr", "parent_id": "t1_ec3sun0", "score": "9", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "illustriousgarb", "body": "A lot of \"organic\" pesticides are much, much worse for the environment as well. ", "created_utc": "1545162404.0", "edited": "False", "id": "ec2bf2y", "is_submitter": "False", "link_id": "t3_a7adnz", "parent_id": "t1_ec1mqo9", "score": "1", "subreddit": "antiMLM", "subreddit_id": "t5_2swge"}, {"author": "illustriousgarb", "body": "Entirely possible. I don't know much about safety testing outside of FDA regulated products, but I recall an Arbonne Hun once telling me that they do their testing on humans, instead of animals. Which sounds great in theory, but given that we don't do several types of testing on humans (example: toxicity), I am skeptical as to how rigorous any testing might be if it's done at all.", "created_utc": "1545162269.0", "edited": "False", "id": "ec2b8nb", "is_submitter": "False", "link_id": "t3_a7adnz", "parent_id": "t1_ec1uiqr", "score": "38", "subreddit": "antiMLM", "subreddit_id": "t5_2swge"}, {"author": "illustriousgarb", "body": "How to prove you're a shit parent AND an irresponsible gun owner in one post.", "created_utc": "1545156337.0", "edited": "False", "id": "ec23cgn", "is_submitter": "False", "link_id": "t3_a7bewy", "parent_id": "t3_a7bewy", "score": "3", "subreddit": "iamverybadass", "subreddit_id": "t5_386om"}, {"author": "illustriousgarb", "body": "Holy shit. As a parent myself, I am so sorry that your parents are complete assholes.", "created_utc": "1545156118.0", "edited": "False", "id": "ec231kz", "is_submitter": "False", "link_id": "t3_a7bewy", "parent_id": "t1_ec1weeh", "score": "3", "subreddit": "iamverybadass", "subreddit_id": "t5_386om"}, {"author": "illustriousgarb", "body": "Congratulations on getting out! Best of luck to you in 2019!", "created_utc": "1545076026.0", "edited": "False", "id": "ebzwlvk", "is_submitter": "False", "link_id": "t3_a72wzr", "parent_id": "t3_a72wzr", "score": "49", "subreddit": "antiMLM", "subreddit_id": "t5_2swge"}, {"author": "illustriousgarb", "body": "Since \"Greg\" is short for \"Gregory,\" you should be fine. My last name is long enough that it sometimes gets cut off on the boarding pass, and I've not encountered any issues. ", "created_utc": "1545064192.0", "edited": "False", "id": "ebzhap5", "is_submitter": "False", "link_id": "t3_a717bw", "parent_id": "t3_a717bw", "score": "3", "subreddit": "travel", "subreddit_id": "t5_2qh41"}, {"author": "illustriousgarb", "body": "I'm in the late weeks of pregnancy, and the particular medicine I take can cause problems with the fetus at this stage, so we're trying to keep me off of them as long as possible. I see my psychiatrist tomorrow morning, so things should get better. For tonight, I'm just trying to take it easy.", "created_utc": "1545017293.0", "edited": "False", "id": "ebyg217", "is_submitter": "False", "link_id": "t3_a6tz86", "parent_id": "t1_ebye4lw", "score": "2", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "illustriousgarb", "body": "Moisturize! And wear sunscreen!", "created_utc": "1545014353.0", "edited": "False", "id": "ebycrni", "is_submitter": "False", "link_id": "t3_a6vmz0", "parent_id": "t3_a6vmz0", "score": "4", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "illustriousgarb", "body": "My anxiety is sky high. I can't get my brain to focus on non-disaster situations. I wish I could take my meds.", "created_utc": "1545012215.0", "edited": "False", "id": "ebyachy", "is_submitter": "False", "link_id": "t3_a6tz86", "parent_id": "t3_a6tz86", "score": "2", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "illustriousgarb", "body": "That sounds super sanitary.", "created_utc": "1544889523.0", "edited": "False", "id": "ebui3mf", "is_submitter": "False", "link_id": "t3_a69l7z", "parent_id": "t1_ebt98xn", "score": "4", "subreddit": "ShitMomGroupsSay", "subreddit_id": "t5_gajhd"}, {"author": "illustriousgarb", "body": "This is me, too. I generally feel like there's no joy in food or this season. :/", "created_utc": "1544829050.0", "edited": "False", "id": "ebt5931", "is_submitter": "False", "link_id": "t3_a69g2x", "parent_id": "t1_ebt2vo0", "score": "3", "subreddit": "GestationalDiabetes", "subreddit_id": "t5_2w321"}, {"author": "illustriousgarb", "body": "Uggggh I hate the placenta eating thing. We aren't animals trying to hide from predators ffs. ", "created_utc": "1544828972.0", "edited": "False", "id": "ebt55x7", "is_submitter": "False", "link_id": "t3_a69l7z", "parent_id": "t3_a69l7z", "score": "30", "subreddit": "ShitMomGroupsSay", "subreddit_id": "t5_gajhd"}, {"author": "illustriousgarb", "body": "Toilet paper goes down the toilet, like everywhere else in the world. I don't know about pet waste.", "created_utc": "1544828871.0", "edited": "False", "id": "ebt51we", "is_submitter": "False", "link_id": "t3_a69wxq", "parent_id": "t3_a69wxq", "score": "1", "subreddit": "japan", "subreddit_id": "t5_2qh2u"}, {"author": "illustriousgarb", "body": "I/we are totally not reading/texting a script.", "created_utc": "1544718122.0", "edited": "False", "id": "ebpeft0", "is_submitter": "False", "link_id": "t3_a5ulnt", "parent_id": "t3_a5ulnt", "score": "17", "subreddit": "antiMLM", "subreddit_id": "t5_2swge"}, {"author": "illustriousgarb", "body": "I like pumpkin spice drinks, but only in October. Apparently this makes me evil. ", "created_utc": "1544716145.0", "edited": "False", "id": "ebpbs81", "is_submitter": "False", "link_id": "t3_a5soex", "parent_id": "t3_a5soex", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "illustriousgarb", "body": "This.....this is amazing.", "created_utc": "1544648824.0", "edited": "False", "id": "ebnmc25", "is_submitter": "False", "link_id": "t3_a5m9qn", "parent_id": "t3_a5m9qn", "score": "202", "subreddit": "ShitMomGroupsSay", "subreddit_id": "t5_gajhd"}, {"author": "illustriousgarb", "body": "Do we get double shill bucks if we worked in the pharmaceutical industry? Cuz I need a side gig.", "created_utc": "1544584109.0", "edited": "False", "id": "eblwe36", "is_submitter": "False", "link_id": "t3_a5e1pp", "parent_id": "t3_a5e1pp", "score": "156", "subreddit": "ShitMomGroupsSay", "subreddit_id": "t5_gajhd"}, {"author": "illustriousgarb", "body": "I hate when people use \"isle\" when they mean \"aisle.\" It makes me irrationally angry. Two very different words, people!!", "created_utc": "1544571595.0", "edited": "False", "id": "ebli7nn", "is_submitter": "False", "link_id": "t3_a52no6", "parent_id": "t1_ebjexbb", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "illustriousgarb", "body": "What the actual fuck is this nonsense? The mental gymnastics needed to even create this meme could win an Olympic medal.", "created_utc": "1544551875.0", "edited": "False", "id": "ebkrvdf", "is_submitter": "False", "link_id": "t3_a592lk", "parent_id": "t3_a592lk", "score": "12", "subreddit": "ShitMomGroupsSay", "subreddit_id": "t5_gajhd"}, {"author": "illustriousgarb", "body": "I lived in a smallish city. I could have gotten by without knowing anything, but honestly, knowing enough Japanese to \"get by\" made life a lot easier. I was by no means fluent, but I was able to do simple things like order food at a restaurant, buy train tickets, etc. ", "created_utc": "1544502646.0", "edited": "False", "id": "ebjls05", "is_submitter": "False", "link_id": "t3_a53bcm", "parent_id": "t3_a53bcm", "score": "1", "subreddit": "japan", "subreddit_id": "t5_2qh2u"}, {"author": "illustriousgarb", "body": "Must be the tOxInS!!!!", "created_utc": "1544497361.0", "edited": "False", "id": "ebjfr20", "is_submitter": "False", "link_id": "t3_a51ly4", "parent_id": "t3_a51ly4", "score": "3", "subreddit": "ShitMomGroupsSay", "subreddit_id": "t5_gajhd"}, {"author": "illustriousgarb", "body": "Right? That was a huge part of my \"reverse\" culture shock when I came back from Japan. All the choices! Also how big restaurants and stores were....", "created_utc": "1544492313.0", "edited": "False", "id": "ebj9pnq", "is_submitter": "False", "link_id": "t3_a4ux8m", "parent_id": "t1_ebhvtyr", "score": "2", "subreddit": "AskAnAmerican", "subreddit_id": "t5_2uah7"}, {"author": "illustriousgarb", "body": "Nah. You should be okay as long as you don't go on some extremely difficult trails the first day you're there. If you do any hiking, give yourselves extra time and water, and you'll be okay.", "created_utc": "1544412848.0", "edited": "False", "id": "ebh4b3m", "is_submitter": "False", "link_id": "t3_a4rw6c", "parent_id": "t3_a4rw6c", "score": "1", "subreddit": "travel", "subreddit_id": "t5_2qh41"}, {"author": "illustriousgarb", "body": "Lmao. If I'm an incel, that's news to me, my husband, and my children. I just don't like businesses that prey on stay at home parents and people struggling to pay the bills. But hey, I guess I hate women since I don't want them to be scammed. ", "created_utc": "1544371576.0", "edited": "False", "id": "ebfm0rt", "is_submitter": "False", "link_id": "t3_a4lup9", "parent_id": "t3_a4lup9", "score": "4160", "subreddit": "antiMLM", "subreddit_id": "t5_2swge"}, {"author": "illustriousgarb", "body": "I am formula feeding from the start. My reasons are not only GD related, but it's definitely part of the puzzle. My first had to have her blood sugar monitored because she was pre-term, and despite her crashing blood sugar, I kept getting told she was getting enough from me. I'm not playing that game this time. \n\nYou're not selfish for considering your needs, nor wanting your body back. Regardless of the way you choose to feed your baby in the end, it's okay to make your mental health a priority.", "created_utc": "1544245017.0", "edited": "False", "id": "ebc6t7x", "is_submitter": "False", "link_id": "t3_a3odah", "parent_id": "t3_a3odah", "score": "3", "subreddit": "GestationalDiabetes", "subreddit_id": "t5_2w321"}, {"author": "illustriousgarb", "body": "Excuse me while I pick my jaw up off the floor.", "created_utc": "1544124864.0", "edited": "False", "id": "eb8g6v8", "is_submitter": "False", "link_id": "t3_a3qekt", "parent_id": "t1_eb892fq", "score": "119", "subreddit": "ShitMomGroupsSay", "subreddit_id": "t5_gajhd"}, {"author": "illustriousgarb", "body": "\"I feel like she wouldn't give us something that would harm us.\"\n\nScience doesn't give a shit about your feelings, Brenda.", "created_utc": "1544123920.0", "edited": "False", "id": "eb8erym", "is_submitter": "False", "link_id": "t3_a3nrb4", "parent_id": "t3_a3nrb4", "score": "13", "subreddit": "antiMLM", "subreddit_id": "t5_2swge"}, {"author": "illustriousgarb", "body": "Omg this is one of the lactivist taking points that pisses me off the most. It's dangerous advice and betrays a fundamental lack of understanding about what immunity even is.\n\nYour breastmilk isn't going to protect against whopping cough, measles, or any of the nasty diseases that can easily kill an infant. Fucking vaccinate.", "created_utc": "1543897913.0", "edited": "False", "id": "eb1th7k", "is_submitter": "False", "link_id": "t3_a2wq54", "parent_id": "t3_a2wq54", "score": "35", "subreddit": "ShitMomGroupsSay", "subreddit_id": "t5_gajhd"}, {"author": "illustriousgarb", "body": "I don't even have a tattoo and I'm in pain from reading this.", "created_utc": "1543897364.0", "edited": "False", "id": "eb1sy65", "is_submitter": "False", "link_id": "t3_a2wxcf", "parent_id": "t3_a2wxcf", "score": "8", "subreddit": "antiMLM", "subreddit_id": "t5_2swge"}, {"author": "illustriousgarb", "body": "Yeah, something similar happened to me, too. I was in a gifted program until 6th grade, even my dad's job moved to a different state, and I had to start at a new school. Suddenly I didn't qualify because I'd come from a different state, despite my test scores and grades qualifying me for the program. Strange.", "created_utc": "1543896532.0", "edited": "False", "id": "eb1s3qc", "is_submitter": "False", "link_id": "t3_a2o50c", "parent_id": "t1_eb0vjbl", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "illustriousgarb", "body": "Hey. I often feel this way too, but I'm over a decade older than you. I'm a stay at home mom with graduate degree that I sometimes feel was useless to get. This was never supposed to be my life. I was supposed to be a successful career woman, a breadwinner who could give my husband the opportunity to stay at home. But life didn't work out that way, and I sometimes think it's because of my crappy choices. Im working towards starting my own business now, and  having that goal has helped me immensely. Here my thoughts:\n\nIf your dream is still to travel and start your own business, then you can still achieve these things. Yes, they might have to be put on hold for a while so you can properly care for your son, but you've got a lot of life ahead of you yet.\n\nI think your first step shoul be to determine what you'd want to do if you started your own business. Identify that goal and then start taking baby steps towards it. It's not going to happen overnight, and it might even be something that takes years to build. That's okay. Having a goal that you can take baby steps towards will help you reestablish a feeling of purpose besides parenthood (which is a great purpose, but a lonely and sometimes unfulfilling one). It can sometimes help to look at our jobs as means to an end, rather than making it part of our identities. This job can be what you need to pay the bills while you slowly save up some money to travel, too. \n\nIt's not easy to reframe our thinking like this, especially when we feel like we sold ourselves short. But, if you can set some goals to get yourself out of your current situation, you may find some of those feelings disappear. Good luck.", "created_utc": "1543885243.0", "edited": "False", "id": "eb1eynw", "is_submitter": "False", "link_id": "t3_a2uzag", "parent_id": "t3_a2uzag", "score": "1", "subreddit": "findapath", "subreddit_id": "t5_2wqq6"}, {"author": "illustriousgarb", "body": "I joke (privately) with my friends and family about how much I love wine. It was born out of a misunderstanding with my husband(who doesn't drink at all) thinking I was an alcoholic because I would occasionally have a beer with dinner on the weekends. We had a good laugh about it, and my friends and family all know it's all in good fun.\n\nSo when I had my first child and saw all the joking about \"Mommy needs wine,\" I giggled, thinking it was the same type of innocent fun..........\n\nIt's not. There are legitimately women out there who drink every day to cope with the difficulties of parenting. I was horrified. I mean, I still drink on occasion when I'm not pregnant, but not when I'm the only adult around, and certainly not every day. Hell, I'm not sure I even do it every week.\n\nMom culture on social media really is obnoxious.", "created_utc": "1543859625.0", "edited": "False", "id": "eb0gjca", "is_submitter": "False", "link_id": "t3_a2kzi1", "parent_id": "t1_eazs1wr", "score": "3", "subreddit": "antiMLM", "subreddit_id": "t5_2swge"}, {"author": "illustriousgarb", "body": "Holy crap, that's one of the worst stories I've heard! I've witnessed other moms tearing each other apart, but nothing that extreme. That's scary. I'm sorry it happened to you.", "created_utc": "1543857427.0", "edited": "False", "id": "eb0ddly", "is_submitter": "False", "link_id": "t3_a2kzi1", "parent_id": "t1_eb0d4jp", "score": "6", "subreddit": "antiMLM", "subreddit_id": "t5_2swge"}, {"author": "illustriousgarb", "body": "That's a dick move, but unfortunately I've seen it happen before. These mom groups can be great, but they've definitely got some shitty people in them. :(", "created_utc": "1543811178.0", "edited": "False", "id": "eazbzrz", "is_submitter": "False", "link_id": "t3_a2kzi1", "parent_id": "t3_a2kzi1", "score": "1296", "subreddit": "antiMLM", "subreddit_id": "t5_2swge"}, {"author": "illustriousgarb", "body": "Thank you. I lost my beloved dog over the summer. I had wanted to be with her when it happened, but she stopped breathing when they brought her out of anesthesia, and they couldn't get her back. I hate that I wasn't with her in the end, but there was nothing I could have done. It was all very sudden, and I have so much guilt for not realizing something was wrong with her until she dropped in the middle of my floor and had a seizure. I hope she knows how much she was loved.", "created_utc": "1543803314.0", "edited": "False", "id": "eaz3554", "is_submitter": "False", "link_id": "t3_a2dyal", "parent_id": "t1_eaxtrjr", "score": "1", "subreddit": "LifeProTips", "subreddit_id": "t5_2s5oq"}, {"author": "illustriousgarb", "body": "Get your daughter to a real damn doctor, Jesus people.", "created_utc": "1543801781.0", "edited": "False", "id": "eaz1ctx", "is_submitter": "False", "link_id": "t3_a2ixda", "parent_id": "t3_a2ixda", "score": "35", "subreddit": "ShitMomGroupsSay", "subreddit_id": "t5_gajhd"}, {"author": "illustriousgarb", "body": "I often see women in mom groups talk about hiding purchases from their husbands. It's such a great way to wind up in financial trouble and puts a huge strain on your marriage when you get get found out - when, not if. I don't get how they can be so proud of it.", "created_utc": "1543639100.0", "edited": "False", "id": "eau3d06", "is_submitter": "False", "link_id": "t3_a1zjkm", "parent_id": "t3_a1zjkm", "score": "30", "subreddit": "ShitMomGroupsSay", "subreddit_id": "t5_gajhd"}, {"author": "illustriousgarb", "body": "Not Asian myself, but married into an Asian family. My husband's family lineage stems from China. My sister-in-law never had GD, and as far as we know, none of their cousins have either. So simply being Asian isn't necessarily a guarantee, but risk could very well be skewed by region.\n\nAlso, based on what I've learned since getting here is that your weight really isn't a determining factor for GD. There's plenty of us here who were a healthy weight prior to pregnancy, and I have several obese friends who never got the diagnosis. \n\nI know it seems really scary. I'm severely needle-phobic, and I was so upset when I got diagnosed. But as others have said, it's really not that bad. Yeah, it sucks to need to monitor your blood sugar and abstain from certain foods, but it truly is manageable.", "created_utc": "1543622491.0", "edited": "False", "id": "eatm6xl", "is_submitter": "False", "link_id": "t3_a1wv0p", "parent_id": "t3_a1wv0p", "score": "1", "subreddit": "GestationalDiabetes", "subreddit_id": "t5_2w321"}, {"author": "illustriousgarb", "body": "Support our crappy products, and we'll give more crappy products to poor people! That's helpful, right?", "created_utc": "1543592244.0", "edited": "False", "id": "easitrn", "is_submitter": "False", "link_id": "t3_a1qbwj", "parent_id": "t3_a1qbwj", "score": "1", "subreddit": "antiMLM", "subreddit_id": "t5_2swge"}, {"author": "illustriousgarb", "body": "Yeah, I'm really lucky. My husband and I have always been in the same wavelength in terms of finances and spending. I agree, it's something that needs to be discussed more, because money can be an enormous stressor in marriage.", "created_utc": "1543516560.0", "edited": "False", "id": "eaqe0xk", "is_submitter": "False", "link_id": "t3_a1hdby", "parent_id": "t1_eaqcrnu", "score": "3", "subreddit": "FIREyFemmes", "subreddit_id": "t5_3n8rr"}, {"author": "illustriousgarb", "body": "A fashion line, of all things, lol. But this is the industry I've come to love, so it's a good fit.", "created_utc": "1543514016.0", "edited": "False", "id": "eaqaaf4", "is_submitter": "False", "link_id": "t3_a1hdby", "parent_id": "t1_eaq9oxf", "score": "4", "subreddit": "FIREyFemmes", "subreddit_id": "t5_3n8rr"}, {"author": "illustriousgarb", "body": "I'm thankful that I've found this sub! Financial independence is something I've always hoped to achieve, but I hit a blip a few years ago when dealing with infertility and miscarriages, then I would up quitting my job because it made more sense for me to do so than to pay for daycare...ugh...\n\nAnyway, I'm working on starting a business to rebuild the savings that I've depleted. I know that sounds counterintuitive, but it really is both a great option for me as a SAHM, and I've also found some  great options for keeping my start up expenses low. My husband and I are also working together to cut expenses, too. I feel like I'm more likely to find people in this sub who can relate to my situation and give good advice. I'm obviously not as flexible as a 20-something single person, but I still think I can follow the FIRE lifestyle. :)", "created_utc": "1543513176.0", "edited": "False", "id": "eaq90wx", "is_submitter": "False", "link_id": "t3_a1hdby", "parent_id": "t3_a1hdby", "score": "12", "subreddit": "FIREyFemmes", "subreddit_id": "t5_3n8rr"}, {"author": "illustriousgarb", "body": "Holy crap. I've had three miscarriages, myself. I would have lost my shit on this girl. It's really sick when people use your grief against you.\n\nI'm so sorry for your loss, OP.", "created_utc": "1543508119.0", "edited": "False", "id": "eaq1wst", "is_submitter": "False", "link_id": "t3_a0znla", "parent_id": "t3_a0znla", "score": "4", "subreddit": "antiMLM", "subreddit_id": "t5_2swge"}, {"author": "illustriousgarb", "body": "Truly. Sometimes you just can't save people from themselves.", "created_utc": "1543507974.0", "edited": "False", "id": "eaq1pkw", "is_submitter": "False", "link_id": "t3_a13c4s", "parent_id": "t1_eaq0tnd", "score": "7", "subreddit": "antiMLM", "subreddit_id": "t5_2swge"}, {"author": "illustriousgarb", "body": "Wait, so the only reason she had money in her card is because *she bought something from herself*? Doesn't seem like something I would brag about there, Hun.", "created_utc": "1543507892.0", "edited": "False", "id": "eaq1lj4", "is_submitter": "False", "link_id": "t3_a1in0u", "parent_id": "t3_a1in0u", "score": "8", "subreddit": "antiMLM", "subreddit_id": "t5_2swge"}, {"author": "illustriousgarb", "body": "That, I would totally believe. I formula fed, and a lot of the crap said to me was nuts.", "created_utc": "1543453220.0", "edited": "False", "id": "eaokons", "is_submitter": "False", "link_id": "t3_a1bq5o", "parent_id": "t1_eaojvg2", "score": "48", "subreddit": "ShitMomGroupsSay", "subreddit_id": "t5_gajhd"}, {"author": "illustriousgarb", "body": "Haha, I'd love to see what prompted this.", "created_utc": "1543451119.0", "edited": "False", "id": "eaoi515", "is_submitter": "False", "link_id": "t3_a1bq5o", "parent_id": "t3_a1bq5o", "score": "106", "subreddit": "ShitMomGroupsSay", "subreddit_id": "t5_gajhd"}, {"author": "illustriousgarb", "body": "Hell, I think people should have to retake their road tests every 10 years regardless of age. I totally agree that as you age, you may have diminished ability to drive, and for everyone's safely, I'm on board with requiring more tests as you age.", "created_utc": "1543422416.0", "edited": "False", "id": "eandsam", "is_submitter": "False", "link_id": "t3_a11tc8", "parent_id": "t1_eamwx2l", "score": "2", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "illustriousgarb", "body": "Honestly, thank you for sharing. I used to work in the pharmaceutical industry, so I'm quite familiar with the difference between regulated medicine and supplements. I get so frustrated to hear about people dying from treatable cancers because they insisted on treating things \"naturally,\" and most of my exposure to that mentality comes from people shilling for MLMs. It's really nice to know that people like you in the alternative medicine world are still sensible people.", "created_utc": "1543419196.0", "edited": "False", "id": "ean8ynv", "is_submitter": "False", "link_id": "t3_a11tc8", "parent_id": "t1_ean2dp0", "score": "2", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "illustriousgarb", "body": "This is my Doxie, too. He flips out when new people come over, but then he's fine until they go to leave. Then it's bark city again. They're quirky little dogs.", "created_utc": "1543372052.0", "edited": "False", "id": "eam4s5a", "is_submitter": "False", "link_id": "t3_a0xl9s", "parent_id": "t1_ealzrv4", "score": "4", "subreddit": "starterpacks", "subreddit_id": "t5_34o9s"}, {"author": "illustriousgarb", "body": "I used that Alli shit years ago. Can confirm, it is not fun on your digestive system. Easier to just not eat fat, lol.", "created_utc": "1543370099.0", "edited": "False", "id": "eam2klm", "is_submitter": "False", "link_id": "t3_a1071p", "parent_id": "t1_ealvmtd", "score": "2", "subreddit": "antiMLM", "subreddit_id": "t5_2swge"}, {"author": "illustriousgarb", "body": "Omfg! What is with these people and their obsession with sticking things up the butt? Just go to a doctor! At least their suppositories work! ", "created_utc": "1543361718.0", "edited": "False", "id": "ealt71y", "is_submitter": "False", "link_id": "t3_a0y0rx", "parent_id": "t3_a0y0rx", "score": "46", "subreddit": "ShitMomGroupsSay", "subreddit_id": "t5_gajhd"}, {"author": "illustriousgarb", "body": "Good news, you can use the oil for dressing!\n\n", "created_utc": "1543293637.0", "edited": "False", "id": "eajv6fs", "is_submitter": "False", "link_id": "t3_a0r3v6", "parent_id": "t1_eajt04z", "score": "27", "subreddit": "antiMLM", "subreddit_id": "t5_2swge"}, {"author": "illustriousgarb", "body": "Oh sure, Karen. I totally believe people who are now homeless have been distraught because they nEeD tEh PlExUs. \n\nSeriously though, OP. I'm sorry. These people are so deep in their delusion, they don't care how tone deaf they are.", "created_utc": "1543293538.0", "edited": "False", "id": "eajv35m", "is_submitter": "False", "link_id": "t3_a0rex6", "parent_id": "t3_a0rex6", "score": "532", "subreddit": "antiMLM", "subreddit_id": "t5_2swge"}, {"author": "illustriousgarb", "body": "I'm going to second considering relocation, and I'm going to throw a bit of a curve ball here: look at Madison, WI. We have a lot of healthcare/biotech type jobs here. It's not a \"big\" city, but it is decently sized, and close to Chicago and Milwaukee. I am not currently working, but I was in the biotech field here for a while, and we definitely had former pre-med and other biological sciences majors at my company. There are also quite a few healthcare jobs that are connected with research with the UW.\n\nI don't know how it compares to Portland in terms of affordability, but since we're also a bit of a college town, there's housing in many price points here.\n\nBest of luck, it sucks to feel like your degree is worthless. Btdt, with both a BA and MA.", "created_utc": "1543205923.0", "edited": "False", "id": "eahfk03", "is_submitter": "False", "link_id": "t3_a0d4zj", "parent_id": "t1_eah22na", "score": "3", "subreddit": "findapath", "subreddit_id": "t5_2wqq6"}, {"author": "illustriousgarb", "body": "I was one of those moms who was told my starving baby was fine. She literally had brick dust in her diaper and lost >10% of her birth weight (she was a month early, so this was completely unacceptable), and her blood sugar readings were plummeting, but they kept telling me \"she's getting enough.\" I've got gestational diabetes this time, and I'm not screwing around this time. Formula straight from the start. I think it's awesome if women can and want to breastfeed, but I'm not one of those women.", "created_utc": "1543194467.0", "edited": "False", "id": "eah2wcw", "is_submitter": "False", "link_id": "t3_9zv8ea", "parent_id": "t1_eadxt23", "score": "2", "subreddit": "ShitMomGroupsSay", "subreddit_id": "t5_gajhd"}, {"author": "illustriousgarb", "body": "Just wait until she finds out I'm going straight to formula when #2 is born! Not even gonna need around with trying to breastfeed this time around. Chemicals for us!!", "created_utc": "1543193906.0", "edited": "False", "id": "eah29s3", "is_submitter": "False", "link_id": "t3_9zv8ea", "parent_id": "t3_9zv8ea", "score": "2", "subreddit": "ShitMomGroupsSay", "subreddit_id": "t5_gajhd"}, {"author": "illustriousgarb", "body": ".... because we all know you're full of shit, Karen. There's been a ton of research on vaccines, we know they're safe, and \"big Pharma\" has oversight.\n\nComparing that to believing sexual assault victims betrays your disgusting ignorance and privilege.", "created_utc": "1543172374.0", "edited": "False", "id": "eag8yqj", "is_submitter": "False", "link_id": "t3_a0b31c", "parent_id": "t3_a0b31c", "score": "146", "subreddit": "ShitMomGroupsSay", "subreddit_id": "t5_gajhd"}, {"author": "illustriousgarb", "body": "Yeeeeesssssss. Satisfying to see these kinds of posts in the wild.", "created_utc": "1543172058.0", "edited": "False", "id": "eag8i2a", "is_submitter": "False", "link_id": "t3_a05nfw", "parent_id": "t3_a05nfw", "score": "3", "subreddit": "antiMLM", "subreddit_id": "t5_2swge"}, {"author": "illustriousgarb", "body": "Omg are you me?", "created_utc": "1543169661.0", "edited": "False", "id": "eag50a4", "is_submitter": "False", "link_id": "t3_a07q48", "parent_id": "t1_eafso7p", "score": "10", "subreddit": "ChoosingBeggars", "subreddit_id": "t5_35fmc"}, {"author": "illustriousgarb", "body": "Lol balancing out the WiFi. I wonder how this blogger balances out cellular data.", "created_utc": "1542929659.0", "edited": "False", "id": "ea9j0v1", "is_submitter": "False", "link_id": "t3_9zi732", "parent_id": "t3_9zi732", "score": "93", "subreddit": "ShitMomGroupsSay", "subreddit_id": "t5_gajhd"}, {"author": "illustriousgarb", "body": "Hey there! I also felt horrible when I find got the diagnosis. I made the mistake of being open about my diagnosis and got a lot of unhelpful advice, including insistence that diet soda, or X food or Y choice is what caused my GD. In fact, my own upset first post is somewhere in this sub. \n\nThe reality is, GD is not a death sentence, there's not really a cause other than we just drew the shitty straws with our placentas. It's not a guarantee that we'll develop Type 2 later on in life. It sucks, especially at this time of year, but it truly is manageable. \n\nOnce you're able to get your meter, you'll figure out what works for you with some trial and error. Some people can eat a wider variety of food than others. For example, potatoes seem to be okay for me, as long as they are paired with a protein. Anything flour or rice based - forget it for me. Other women in this sub can't have potatoes at all, while others can handle small portions of rice. You'll find what works for you, and although it sucks to have to pass on that piece of pie or that delicious Starbucks drink, it's temporary.  The biggest thing you can do at this point is watch your carb intake. Your care team will give you specific parameters that work best for you, but until you have that information, try to keep your protein intake up and your carb intake down.\n\nSorry that you got the diagnosis, but this is a great and supportive sub!", "created_utc": "1542929350.0", "edited": "False", "id": "ea9iphx", "is_submitter": "False", "link_id": "t3_9z9i8w", "parent_id": "t3_9z9i8w", "score": "1", "subreddit": "GestationalDiabetes", "subreddit_id": "t5_2w321"}, {"author": "illustriousgarb", "body": "I've had 3 miscarriages, all wanted pregnancies. If some asshole tried to turn me into a criminal for that... Well, they'd succeed, because I'd probably get some nasty assault charges.", "created_utc": "1542756885.0", "edited": "False", "id": "ea4ud9i", "is_submitter": "False", "link_id": "t3_9yplyk", "parent_id": "t1_ea3rxzx", "score": "3", "subreddit": "atheism", "subreddit_id": "t5_2qh2p"}, {"author": "illustriousgarb", "body": "Not even outside of marriage. There are a good chunk of Christians who think women shouldn't be allowed pain relief during labor. Because \"your body was made for this\" or some garbage.", "created_utc": "1542732398.0", "edited": "False", "id": "ea3yoe2", "is_submitter": "False", "link_id": "t3_9ys5dd", "parent_id": "t1_ea3qche", "score": "14", "subreddit": "atheism", "subreddit_id": "t5_2qh2p"}, {"author": "illustriousgarb", "body": "Yes, it can prevent reoccurrence.", "created_utc": "1542730859.0", "edited": "False", "id": "ea3wpjv", "is_submitter": "False", "link_id": "t3_9ynqdq", "parent_id": "t1_ea3t7ov", "score": "1", "subreddit": "antiMLM", "subreddit_id": "t5_2swge"}, {"author": "illustriousgarb", "body": "It's fucking patronizing. I'm a grown ass woman with a name. The only people allowed to call me momma are my kids.", "created_utc": "1542730434.0", "edited": "False", "id": "ea3w5zc", "is_submitter": "False", "link_id": "t3_9yt4oz", "parent_id": "t1_ea3v2pq", "score": "35", "subreddit": "antiMLM", "subreddit_id": "t5_2swge"}, {"author": "illustriousgarb", "body": "To be fair, my flu shot this year hurt worse than my TdaP in terms of after-the-shot soreness.\n\nStill better than the alternative, though.", "created_utc": "1542685696.0", "edited": "False", "id": "ea2wdvg", "is_submitter": "False", "link_id": "t3_9ynqdq", "parent_id": "t1_ea2vu9i", "score": "15", "subreddit": "antiMLM", "subreddit_id": "t5_2swge"}, {"author": "illustriousgarb", "body": "Exactly. While I wouldn't recommend doing it often without consulting your vet, there are some\"people foods\" that are safe to feed dogs if you're in a pinch. Our vet had us give our beagle green beans to help with her weight. A family member mixes rice into his dog's food regularly.", "created_utc": "1542681973.0", "edited": "False", "id": "ea2s3su", "is_submitter": "False", "link_id": "t3_9yic46", "parent_id": "t1_ea2o194", "score": "3", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "illustriousgarb", "body": "Ooooh, ty!!!", "created_utc": "1542681032.0", "edited": "False", "id": "ea2qzmq", "is_submitter": "False", "link_id": "t3_9ynbnv", "parent_id": "t3_9ynbnv", "score": "2", "subreddit": "blackbutler", "subreddit_id": "t5_2tu8z"}, {"author": "illustriousgarb", "body": "I'm not a pharmacy tech, but I've seen people lose their shit on you guys too often. I once watched a woman flip out at the tech because her insurance wasn't covering her medicine, and started demanding that the tech pay for it. It was ludicrous. I'm sorry for what you deal with everyday, but most of us appreciate you!!!!", "created_utc": "1542671284.0", "edited": "1542671757.0", "id": "ea2fjw1", "is_submitter": "False", "link_id": "t3_9yic46", "parent_id": "t1_ea21b1u", "score": "4", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "illustriousgarb", "body": "Holy shit. How many ridiculous mom/wife stereotypes can you for in one paragraph? ", "created_utc": "1542598153.0", "edited": "False", "id": "ea0i7cl", "is_submitter": "False", "link_id": "t3_9yct4b", "parent_id": "t3_9yct4b", "score": "73", "subreddit": "antiMLM", "subreddit_id": "t5_2swge"}, {"author": "illustriousgarb", "body": "Yay! Overpriced garbage instead of cheap fresh herbs!", "created_utc": "1542597830.0", "edited": "False", "id": "ea0hv8c", "is_submitter": "False", "link_id": "t3_9yctaz", "parent_id": "t3_9yctaz", "score": "156", "subreddit": "antiMLM", "subreddit_id": "t5_2swge"}, {"author": "illustriousgarb", "body": "I worked for \"little pharma\" for a while, and I hate this website with the fire of 1,000 suns. \"We can't trust big pharma, but we can trust the totally ridiculous misspelled website!\"", "created_utc": "1542597737.0", "edited": "False", "id": "ea0hrjo", "is_submitter": "False", "link_id": "t3_9yankm", "parent_id": "t1_ea0h4as", "score": "11", "subreddit": "antiMLM", "subreddit_id": "t5_2swge"}, {"author": "illustriousgarb", "body": "Don't feel too bad about drinking the Kool-aid in the past. I have an advanced degree and a science background, and I fell for this shit for a while, too. Otherwise intelligent people get sucked into this crap all the time. My chemical engineer SIL loves Norwex because it's \"chemical-free.\"", "created_utc": "1542597582.0", "edited": "False", "id": "ea0hloj", "is_submitter": "False", "link_id": "t3_9yankm", "parent_id": "t1_ea01193", "score": "7", "subreddit": "antiMLM", "subreddit_id": "t5_2swge"}, {"author": "illustriousgarb", "body": "I don't think you're being overly worried. It's totally normal to feel uneasy if the doctor you're most comfortable with won't be with you. I had an emergency C-section with my first, and of course my OB wasn't on call, so a different doctor delivered my first child. I was uneasy at first, but I was also terrified, so I got over it pretty quickly. It turned out that the OB I delivered with was very skilled with stitching me up, and I was pretty pleased with his care.\n\nThat being said, I think your feelings are totally valid. ", "created_utc": "1542596185.0", "edited": "False", "id": "ea0g48f", "is_submitter": "False", "link_id": "t3_9ycgxm", "parent_id": "t3_9ycgxm", "score": "4", "subreddit": "GestationalDiabetes", "subreddit_id": "t5_2w321"}, {"author": "illustriousgarb", "body": "Amazing, lol. But actually helpful as to what questions I'll need to ask my tax professional when I go to file taxes best year with my (non-MLM) new business.", "created_utc": "1542572301.0", "edited": "False", "id": "e9zno67", "is_submitter": "False", "link_id": "t3_9y36dc", "parent_id": "t3_9y36dc", "score": "2", "subreddit": "antiMLM", "subreddit_id": "t5_2swge"}, {"author": "illustriousgarb", "body": "Holy crap. I'd be super pissed if someone used MY wedding registry to sell their crappy MLM shit.", "created_utc": "1542568470.0", "edited": "False", "id": "e9zift9", "is_submitter": "False", "link_id": "t3_9y7wkv", "parent_id": "t3_9y7wkv", "score": "47", "subreddit": "antiMLM", "subreddit_id": "t5_2swge"}, {"author": "illustriousgarb", "body": "Well I'm glad her car smells amazing, but her chickens can't lay eggs if they're poisoned...", "created_utc": "1542323593.0", "edited": "False", "id": "e9s3jbc", "is_submitter": "False", "link_id": "t3_9xgam5", "parent_id": "t3_9xgam5", "score": "113", "subreddit": "antiMLM", "subreddit_id": "t5_2swge"}, {"author": "illustriousgarb", "body": "And this is why these relief organizations keep telling people to stop sending useless crap and just send money.", "created_utc": "1542319805.0", "edited": "False", "id": "e9ryftq", "is_submitter": "False", "link_id": "t3_9xfuie", "parent_id": "t3_9xfuie", "score": "10", "subreddit": "antiMLM", "subreddit_id": "t5_2swge"}, {"author": "illustriousgarb", "body": "Well, I mean, setting it on fire is probably a better use for it than putting it in your hair. Most people probably prefer candles, though.", "created_utc": "1542317595.0", "edited": "False", "id": "e9rviid", "is_submitter": "False", "link_id": "t3_9xfauu", "parent_id": "t3_9xfauu", "score": "20", "subreddit": "antiMLM", "subreddit_id": "t5_2swge"}, {"author": "illustriousgarb", "body": "Damn, I feel so bad for the real makers that attend these things. I really want to go to a holiday market, but I'm so leery of supporting a fair that's okay with MLMs.", "created_utc": "1542315362.0", "edited": "False", "id": "e9rsh94", "is_submitter": "False", "link_id": "t3_9xf6ex", "parent_id": "t3_9xf6ex", "score": "2", "subreddit": "antiMLM", "subreddit_id": "t5_2swge"}, {"author": "illustriousgarb", "body": "I love wine. I'd love to work in a winery for a living. I almost got sucked into Traveling Vineyard. Thank goodness I googled it first.... Nothing is sacred to the scammers. :(", "created_utc": "1542300210.0", "edited": "False", "id": "e9r7ya7", "is_submitter": "False", "link_id": "t3_9xc5sa", "parent_id": "t3_9xc5sa", "score": "3", "subreddit": "antiMLM", "subreddit_id": "t5_2swge"}, {"author": "illustriousgarb", "body": "Nooooo! Holy shit you'd be better off with burbon (I'm not advocating that, btw). This is awful! ", "created_utc": "1542258621.0", "edited": "False", "id": "e9q9zde", "is_submitter": "False", "link_id": "t3_9x7y1j", "parent_id": "t3_9x7y1j", "score": "49", "subreddit": "antiMLM", "subreddit_id": "t5_2swge"}, {"author": "illustriousgarb", "body": "Wtf? That's so incredibly inappropriate. Good for you for calling them out. Update us when they respond, please.", "created_utc": "1542223021.0", "edited": "False", "id": "e9p5fvw", "is_submitter": "False", "link_id": "t3_9x2dr3", "parent_id": "t3_9x2dr3", "score": "35", "subreddit": "antiMLM", "subreddit_id": "t5_2swge"}, {"author": "illustriousgarb", "body": "Oh man thank you, this gives me hope. I have a toddler and I'm 31 weeks pregnant with #2, and this pregnancy has been hell. I break down at least once a week wondering how I'm going to handle a newborn with a toddler.... But this is seriously what I needed to hear this morning.", "created_utc": "1542036726.0", "edited": "False", "id": "e9k2kl5", "is_submitter": "False", "link_id": "t3_9w884k", "parent_id": "t1_e9jrwme", "score": "3", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "illustriousgarb", "body": "100%. There are a lot of people who looooove newborns, but I am not one of them. I way prefer the toddler stage. Can't believe I am about to do the newborn stage again...", "created_utc": "1542036499.0", "edited": "False", "id": "e9k2b55", "is_submitter": "False", "link_id": "t3_9w884k", "parent_id": "t1_e9jeuko", "score": "2", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "illustriousgarb", "body": "This absolutely needs to be reported. This is straight up exploitation and could be grounds for losing accreditation, licenses, you name it. It's one thing to scam competent adults, it's criminal to do this to people with dementia.", "created_utc": "1541997751.0", "edited": "False", "id": "e9jb1oo", "is_submitter": "False", "link_id": "t3_9wacab", "parent_id": "t3_9wacab", "score": "105", "subreddit": "antiMLM", "subreddit_id": "t5_2swge"}, {"author": "illustriousgarb", "body": "I'm not sure where you're from, but in the US, we have several \"lost dog/cat of X state\" pages on Facebook that are really good about getting the word out and have a lot of success in reuniting people and their pets. I do recommend them. I hope your Daisy comes home soon.", "created_utc": "1541989485.0", "edited": "False", "id": "e9j2m4e", "is_submitter": "False", "link_id": "t3_9w8jgb", "parent_id": "t1_e9itd9a", "score": "1", "subreddit": "aww", "subreddit_id": "t5_2qh1o"}, {"author": "illustriousgarb", "body": "Your daughter is amazing. I hope she does end up doing something with dogs for her career, but I totally understand not wanting to be a vet. I feel the same.", "created_utc": "1541989348.0", "edited": "False", "id": "e9j2gqi", "is_submitter": "False", "link_id": "t3_9w8jgb", "parent_id": "t3_9w8jgb", "score": "1", "subreddit": "aww", "subreddit_id": "t5_2qh1o"}, {"author": "illustriousgarb", "body": "Not all heroes wear capes. I love when the pyramid schemes get screwed.", "created_utc": "1541989232.0", "edited": "False", "id": "e9j2cbb", "is_submitter": "False", "link_id": "t3_9w7q46", "parent_id": "t3_9w7q46", "score": "11", "subreddit": "antiMLM", "subreddit_id": "t5_2swge"}, {"author": "illustriousgarb", "body": "Of course it's your imbalanced hormones! It couldn't possibly be our low quality shitty jewelry! /S", "created_utc": "1541989048.0", "edited": "False", "id": "e9j25hr", "is_submitter": "False", "link_id": "t3_9w9sbo", "parent_id": "t3_9w9sbo", "score": "30", "subreddit": "antiMLM", "subreddit_id": "t5_2swge"}, {"author": "illustriousgarb", "body": "This is probably the best thing that could have happened to her \"business.\"", "created_utc": "1541965898.0", "edited": "False", "id": "e9i44p5", "is_submitter": "False", "link_id": "t3_9w6kqf", "parent_id": "t3_9w6kqf", "score": "12", "subreddit": "antiMLM", "subreddit_id": "t5_2swge"}, {"author": "illustriousgarb", "body": "Are you definitely leaving out of terminal 5? I've left out of the domestic terminals on Luftansa before. They don't automatically send you through the international terminal if you're departing on an international flight, especially if it's an airline like Luftansa that has partnership with United.\n\nThat being said, you should still have plenty of time. While O'Hare is a big airport, it's easy to navigate, and you should be able to get to your terminal in a reasonable amount of time.", "created_utc": "1541910981.0", "edited": "False", "id": "e9gqrwp", "is_submitter": "False", "link_id": "t3_9w0s9g", "parent_id": "t3_9w0s9g", "score": "2", "subreddit": "travel", "subreddit_id": "t5_2qh41"}, {"author": "illustriousgarb", "body": "I'm sewing a dress for an event next weekend. None of the ones I own fit because of the bump lol.", "created_utc": "1541904191.0", "edited": "False", "id": "e9gk3qa", "is_submitter": "True", "link_id": "t3_9w09ju", "parent_id": "t1_e9gk0oy", "score": "1", "subreddit": "GestationalDiabetes", "subreddit_id": "t5_2w321"}, {"author": "illustriousgarb", "body": "I was on the floor cutting out some fabric, so maybe the crawling around made a difference? ", "created_utc": "1541904034.0", "edited": "False", "id": "e9gjy6q", "is_submitter": "True", "link_id": "t3_9w09ju", "parent_id": "t1_e9gjuxj", "score": "1", "subreddit": "GestationalDiabetes", "subreddit_id": "t5_2w321"}, {"author": "illustriousgarb", "body": "Thank you for your reassurance. I slept like garbage last night and had a very stressful evening yesterday. I wonder if that's part of the issue. Anyway, I'm glad that this one high isn't terrible, but it's so obnoxious that I had no problem with these foods and now suddenly they're a problem. GD sucks!!!!", "created_utc": "1541903878.0", "edited": "False", "id": "e9gjseb", "is_submitter": "True", "link_id": "t3_9w09ju", "parent_id": "t1_e9gjlul", "score": "1", "subreddit": "GestationalDiabetes", "subreddit_id": "t5_2w321"}, {"author": "illustriousgarb", "body": "Holy shit. Tone deaf AND insulting. \"If he'd just had my magic elixir, he never would have shot people!\"  ", "created_utc": "1541892603.0", "edited": "False", "id": "e9g8d2t", "is_submitter": "False", "link_id": "t3_9vymrl", "parent_id": "t3_9vymrl", "score": "8", "subreddit": "antiMLM", "subreddit_id": "t5_2swge"}, {"author": "illustriousgarb", "body": "Yes, the REAL ID meets the requirements for domestic travel in the US. Some driver's licenses are no longer enough, but as long as you have the REAL ID, you're good.", "created_utc": "1541892407.0", "edited": "False", "id": "e9g85d8", "is_submitter": "False", "link_id": "t3_9vyv2t", "parent_id": "t3_9vyv2t", "score": "1", "subreddit": "travel", "subreddit_id": "t5_2qh41"}, {"author": "illustriousgarb", "body": "My dietician said pumpkin pie is the \"best\" of the pie(diet wise), so she suggested a small piece of that. But if you don't want to do that, I'd also suggest looking at low carb cheesecake.\n\nGreen beans also! Not a casserole, just the beans. Would a broccoli based stuffing be an option, so you're not doing cauliflower overkill? I'm not a stuffing eater, so I'm just throwing it out there. :)", "created_utc": "1541872096.0", "edited": "False", "id": "e9ficd8", "is_submitter": "False", "link_id": "t3_9vw4n0", "parent_id": "t3_9vw4n0", "score": "2", "subreddit": "GestationalDiabetes", "subreddit_id": "t5_2w321"}, {"author": "illustriousgarb", "body": "Holy HIPAA violation, Batman!", "created_utc": "1541820589.0", "edited": "False", "id": "e9egdev", "is_submitter": "False", "link_id": "t3_9vqtue", "parent_id": "t3_9vqtue", "score": "327", "subreddit": "antiMLM", "subreddit_id": "t5_2swge"}, {"author": "illustriousgarb", "body": "I'm 36 and at the tail end of a rough pregnancy, so take this with a grain of salt because I'm pretty crabby these days.\n\nI'm not great. I feel like I had kids too late and wasted so much of my potential during my working years. I was an exemplary student in school and got a job overseas when I graduated college. I came back to the US and couldn't find a job so I would up taking the first offer and it's been a string of shit jobs ever since. \n\nI'm now a stay-at-home mom and feel like I'm still wasting my potential. Don't get me wrong, I love my child, and this baby on the way is an enormous blessing that I thought I would never have after the infertility hell I dealt with to get my first. But I just wonder if this is all there is to me.\n\nAnyway, with that salt all laid bare, I'm hopeful that 40 will be better for me.", "created_utc": "1541799985.0", "edited": "False", "id": "e9dvbf9", "is_submitter": "False", "link_id": "t3_9vjzhj", "parent_id": "t3_9vjzhj", "score": "3", "subreddit": "AskWomen", "subreddit_id": "t5_2rxrw"}, {"author": "illustriousgarb", "body": "Not for pleasure, but I have traveled during Thanksgiving weekend. Be prepared for long lines at the airport. Yes, most places will be closed on Thanksgiving Day, as it is a federal holiday, but there are things to do. For example, the Macy's parade. If that's out of the question, many other cities have their own version. But many places are open on Friday and the weekend. You'd have to specify a place to find out what their hours will be.", "created_utc": "1541725204.0", "edited": "False", "id": "e9btqn6", "is_submitter": "False", "link_id": "t3_9vfpk8", "parent_id": "t3_9vfpk8", "score": "2", "subreddit": "travel", "subreddit_id": "t5_2qh41"}, {"author": "illustriousgarb", "body": "Thank you. I don't have PTSD, but I do have two other diagnosed mental illnesses, and I'm getting really fucking tired of this excuse. ", "created_utc": "1541713736.0", "edited": "False", "id": "e9bgryk", "is_submitter": "False", "link_id": "t3_9vbzku", "parent_id": "t1_e9ayv5d", "score": "7", "subreddit": "antiMLM", "subreddit_id": "t5_2swge"}, {"author": "illustriousgarb", "body": "Oh, it 100% is. Even non-MLM companies get in on the chemphobia. The Honest Company got busted for using a chemical they kept spouting as \"unsafe\" a while back. Nothing like fear-based marketing!", "created_utc": "1541713114.0", "edited": "False", "id": "e9bfzvg", "is_submitter": "False", "link_id": "t3_9vcmww", "parent_id": "t1_e9bd52z", "score": "2", "subreddit": "antiMLM", "subreddit_id": "t5_2swge"}, {"author": "illustriousgarb", "body": "\"I got blocked from a Facebook group for trying to make sales and recruit people, even though they have rules against that! So being so mean!!\"", "created_utc": "1541696528.0", "edited": "False", "id": "e9aulhj", "is_submitter": "False", "link_id": "t3_9vbmd0", "parent_id": "t3_9vbmd0", "score": "1", "subreddit": "antiMLM", "subreddit_id": "t5_2swge"}, {"author": "illustriousgarb", "body": "...oh. oh my. ", "created_utc": "1541631407.0", "edited": "False", "id": "e999u0a", "is_submitter": "False", "link_id": "t3_9v3jgg", "parent_id": "t3_9v3jgg", "score": "3", "subreddit": "antiMLM", "subreddit_id": "t5_2swge"}, {"author": "illustriousgarb", "body": "I think as long is it remains profitable, they will. There's so much more to the story after BoA, it would be a shame if that was it.", "created_utc": "1541617614.0", "edited": "False", "id": "e98rec1", "is_submitter": "False", "link_id": "t3_9v26x3", "parent_id": "t3_9v26x3", "score": "19", "subreddit": "blackbutler", "subreddit_id": "t5_2tu8z"}, {"author": "illustriousgarb", "body": "I'm using AccuCheck. So far, I like it. It doesn't really hurt, but every once in a while I get a sting if I hit a sensitive spot on my finger. Nothing too terrible, though, and I'm not having any issues with lingering scabs or anything.", "created_utc": "1541613258.0", "edited": "False", "id": "e98lrea", "is_submitter": "False", "link_id": "t3_9v1gnh", "parent_id": "t3_9v1gnh", "score": "3", "subreddit": "GestationalDiabetes", "subreddit_id": "t5_2w321"}, {"author": "illustriousgarb", "body": "I am 100% concerned about this, freaked out, even. I've also got PCOS, so that's another strike against me.\n\nHonestly, I have had diabetes checks prior to being pregnant, and I've been okay. While we're statistically more likely to develop T2, my doctors have all said it's not something you should dwell on. Of course, as others have pointed out, we should get our A1C checked and maintain healthy lifestyles as much as possible, but the reality is that developing diabetes (as we all have learned) is much more complex than just, \"you're overweight, you're going to get diabetes.\"\n\nI also brought up this concern to my dietician, and she said that T2 is extremely manageable these days, even more so than GD. So, it's best to just try not to get too upset about it, and try to live as best you can.\n\n&#x200B;", "created_utc": "1541612979.0", "edited": "False", "id": "e98le9x", "is_submitter": "False", "link_id": "t3_9uzsmd", "parent_id": "t3_9uzsmd", "score": "4", "subreddit": "GestationalDiabetes", "subreddit_id": "t5_2w321"}, {"author": "illustriousgarb", "body": "Scarily enough, there is a new \"polio-like\" illness that has been popping up in the US. They have no idea what the cause is. It's pretty terrifying stuff. I hope we aren't about to see what your dad did.", "created_utc": "1541560469.0", "edited": "False", "id": "e97ci8k", "is_submitter": "False", "link_id": "t3_9usivx", "parent_id": "t1_e9762lo", "score": "15", "subreddit": "WhitePeopleTwitter", "subreddit_id": "t5_35n7t"}, {"author": "illustriousgarb", "body": "I hope the people running the parrot booth lost their shit. Birds are extremely sensitive to scented stuff. I had to put away all candles when I brought home my parrotlet, and for good reason. This stuff is well known to be bad for birds.", "created_utc": "1541545482.0", "edited": "False", "id": "e96vj6r", "is_submitter": "False", "link_id": "t3_9us9oz", "parent_id": "t3_9us9oz", "score": "11", "subreddit": "antiMLM", "subreddit_id": "t5_2swge"}, {"author": "illustriousgarb", "body": "Ew, I think it's pretty unprofessional that the ultrasound tech asked if you'd cheated on your diet. They aren't supposed to be making medical recommendations or suggestions like that, and even if it were okay, the appropriate thing to ask would be how your numbers were.\n\nAnyway, I'm sorry. Increased fluid can be scary. I hope the diabetes doctor can help put your mind at ease.", "created_utc": "1541534640.0", "edited": "False", "id": "e96herc", "is_submitter": "False", "link_id": "t3_9urq2w", "parent_id": "t3_9urq2w", "score": "8", "subreddit": "GestationalDiabetes", "subreddit_id": "t5_2w321"}, {"author": "illustriousgarb", "body": "Yes, the points you make are exactly why I formed a LLC immediately upon starting my business (don't worry, it's legit, not an MLM). Though the chances of getting sued with my business are slim at most, they exist and I want to protect my personal assets. That's part of why I hate MLMs so much.... They are luring people into a situation that could devastate them much more than just draining their bank accounts.", "created_utc": "1541533837.0", "edited": "False", "id": "e96gbw7", "is_submitter": "False", "link_id": "t3_9ureod", "parent_id": "t3_9ureod", "score": "3", "subreddit": "antiMLM", "subreddit_id": "t5_2swge"}, {"author": "illustriousgarb", "body": "Phew, I'm so glad they don't put vegans in their products!", "created_utc": "1541533341.0", "edited": "False", "id": "e96fnk4", "is_submitter": "False", "link_id": "t3_9urip2", "parent_id": "t3_9urip2", "score": "69", "subreddit": "antiMLM", "subreddit_id": "t5_2swge"}, {"author": "illustriousgarb", "body": "Omg yes! Cake. And a huge glass of wine. I'm starting to make a list of things I'm going to eat the instant this baby is born, lol.", "created_utc": "1541472504.0", "edited": "False", "id": "e94xu0u", "is_submitter": "False", "link_id": "t3_9uje0n", "parent_id": "t3_9uje0n", "score": "2", "subreddit": "GestationalDiabetes", "subreddit_id": "t5_2w321"}, {"author": "illustriousgarb", "body": "This might be the best story I've read in this sub. Thanks for sharing, but sorry you didn't get your threesome!", "created_utc": "1541464532.0", "edited": "False", "id": "e94oybq", "is_submitter": "False", "link_id": "t3_9ufv1n", "parent_id": "t3_9ufv1n", "score": "9", "subreddit": "antiMLM", "subreddit_id": "t5_2swge"}, {"author": "illustriousgarb", "body": "Interesting, I'm a vegetarian and no one even batted an eye at that! You're right, loneliness and cultural differences will happen everywhere, and because of Japan's general \"foreigners are outsiders\" idea, it can feel even more isolating. That being said, I made a lot of Japanese friends that I still communicate with, and I was in a smallish city. \n\nI suspect the long hours complaint may have come from a JET. I've heard that from them before, and I think they are more susceptible to it. I worked a normal 40 hour week. So it is important to go in with your eyes wide open, and research the company/group you're going to go with. Just like in Korea. :)", "created_utc": "1541452112.0", "edited": "False", "id": "e94aiva", "is_submitter": "False", "link_id": "t3_9ua6mf", "parent_id": "t1_e9445jw", "score": "2", "subreddit": "travel", "subreddit_id": "t5_2qh41"}, {"author": "illustriousgarb", "body": "I mean, he's also big into \"natural\" parenting, so it's not really surprising. :/", "created_utc": "1541447212.0", "edited": "False", "id": "e9442qf", "is_submitter": "False", "link_id": "t3_9ugb7w", "parent_id": "t1_e9415li", "score": "5", "subreddit": "antiMLM", "subreddit_id": "t5_2swge"}, {"author": "illustriousgarb", "body": "Sure! I mean, part of it depends on where you end up, but the English teaching gig is pretty nice. I was a teacher for an eikaiwa (English school outside of the school system), and I taught kids and adults. The school provided us with the texts, and we had to teach specific pages depending on the week, but you had the freedom to create your own lessons. \n\nWhat sorts of negative things have you heard? I mean, there are definitely some things that are hard to get around, like the fact that you'll always be an outsider as a foreigner, but there are plenty of people who are interested in making friends with English speakers. There's also a fair number of foreigners and they wind up forming communities too. You'll find a lot of people complaining on the internet, but honestly there's a great deal of good, and the country as a whole is pretty safe.", "created_utc": "1541446215.0", "edited": "False", "id": "e942s3t", "is_submitter": "False", "link_id": "t3_9ua6mf", "parent_id": "t1_e941qe5", "score": "2", "subreddit": "travel", "subreddit_id": "t5_2qh41"}, {"author": "illustriousgarb", "body": "I was a teacher in Japan, but not Thailand. My  in-laws are from there. :)", "created_utc": "1541445149.0", "edited": "False", "id": "e941eak", "is_submitter": "False", "link_id": "t3_9ua6mf", "parent_id": "t1_e93xulh", "score": "2", "subreddit": "travel", "subreddit_id": "t5_2qh41"}, {"author": "illustriousgarb", "body": "I'd be pretty pissed off too, if my mom was sneaking crap into my food and onto my stuff.", "created_utc": "1541425401.0", "edited": "False", "id": "e93dxfa", "is_submitter": "False", "link_id": "t3_9ucrs5", "parent_id": "t3_9ucrs5", "score": "695", "subreddit": "antiMLM", "subreddit_id": "t5_2swge"}, {"author": "illustriousgarb", "body": "I'm not a \"big time\" traveler, but I've done enough that I totally get this feeling. You sort of start to live with the sense of having two homes. Your \"native\" home, and your second, or even third home. Japan will always be my second home, with Thailand starting to be a third home, since I literally have family there. \n\nI've tried to stay connected by getting involved in local festivals, groups, etc where I can experience some of the little cultural differences that aren't so easy to replicate at home. I have found a few markets that sell food products from my second home. I keep up on language study and stay in touch with my friends. It also helps to start planning a trip \"home\" so that you have something to look forward to.", "created_utc": "1541397279.0", "edited": "False", "id": "e92ykwu", "is_submitter": "False", "link_id": "t3_9ua6mf", "parent_id": "t3_9ua6mf", "score": "3", "subreddit": "travel", "subreddit_id": "t5_2qh41"}, {"author": "illustriousgarb", "body": "These people have no concept of the amount of money you would need to fucking retire at 29. If you're making it that big, you don't need to advertise on social media. Wtf.", "created_utc": "1541396803.0", "edited": "False", "id": "e92ya5x", "is_submitter": "False", "link_id": "t3_9uabpo", "parent_id": "t3_9uabpo", "score": "22", "subreddit": "antiMLM", "subreddit_id": "t5_2swge"}, {"author": "illustriousgarb", "body": "OMG! But it's still sugar! Uuuuuugh I'm sorry!", "created_utc": "1541360008.0", "edited": "False", "id": "e91sy7i", "is_submitter": "False", "link_id": "t3_9u5yca", "parent_id": "t1_e91sj5z", "score": "2", "subreddit": "GestationalDiabetes", "subreddit_id": "t5_2w321"}, {"author": "illustriousgarb", "body": "Uuuuuugh I hate Usborne. My kid's daycare does \"Usborne book fairs,\" and I just see red every time it comes up. They even make the teachers create \"Usborne classroom wish lists\" to try and guilt you into buying from the fair. No thanks, I'd rather buy books from the Scholastic brochures.\n\nIf you have a website, please feel free to pm me what it is. My kid loves books and I'm all about not supporting MLMs. :)", "created_utc": "1541359929.0", "edited": "False", "id": "e91suhz", "is_submitter": "False", "link_id": "t3_9u67of", "parent_id": "t3_9u67of", "score": "283", "subreddit": "antiMLM", "subreddit_id": "t5_2swge"}, {"author": "illustriousgarb", "body": "Oh man, I have yet to run into this attitude with my GD, but I've seen it before in other scenarios. I'm sorry you encountered that, but you're 100% right. For us, sugar is sugar, it doesn't matter where it came from.", "created_utc": "1541359479.0", "edited": "False", "id": "e91s96p", "is_submitter": "False", "link_id": "t3_9u5yca", "parent_id": "t3_9u5yca", "score": "7", "subreddit": "GestationalDiabetes", "subreddit_id": "t5_2w321"}, {"author": "illustriousgarb", "body": "Yes, with the way the packets are ripped, I'm pretty sure her kid didn't actually do this. It's way too clean.", "created_utc": "1541220524.0", "edited": "False", "id": "e8yknwj", "is_submitter": "False", "link_id": "t3_9tqahs", "parent_id": "t1_e8yhedc", "score": "12", "subreddit": "antiMLM", "subreddit_id": "t5_2swge"}, {"author": "illustriousgarb", "body": "Nah. They'll probably get excited about it. I wore a kimono to a spring festival in Toyama, and I was treated like sort of a mini celebrity because \"white girl in kimono!\" The Japanese generally don't get upset about this sort of thing.\n\nEdit: it totally flew over my head that this was cosplay. But again, nope, it wouldn't be cultural appropriation. This would fall under \"parody\" or could even be called \"historical interpretation,\" depending on what direction you go with it. ", "created_utc": "1541130741.0", "edited": "1541130950.0", "id": "e8w73ec", "is_submitter": "False", "link_id": "t3_9tg9ew", "parent_id": "t3_9tg9ew", "score": "2", "subreddit": "japan", "subreddit_id": "t5_2qh2u"}, {"author": "illustriousgarb", "body": "Aw hell no. Should tell her to quit practicing medicine without a license.\n\n I'm glad you've got a good sense of needing your meds, OP, because I've been suckered into that \"go off your meds\" shit before, and it sets me back every time. Don't tell people to go off their meds.", "created_utc": "1541130367.0", "edited": "False", "id": "e8w6r7i", "is_submitter": "False", "link_id": "t3_9tgnc1", "parent_id": "t3_9tgnc1", "score": "91", "subreddit": "antiMLM", "subreddit_id": "t5_2swge"}, {"author": "illustriousgarb", "body": "Unlikely. If this is in the US, the FDA does require that \"statements not evaluated by the FDA\" disclaimer if you make these claims and it's not an actual drug.", "created_utc": "1541114923.0", "edited": "False", "id": "e8vpwhc", "is_submitter": "False", "link_id": "t3_9teor5", "parent_id": "t3_9teor5", "score": "9", "subreddit": "antiMLM", "subreddit_id": "t5_2swge"}, {"author": "illustriousgarb", "body": "Ugh, I'm so sorry you had to experience that. People who shill things as a treatment for cancer are evil. A friend of mine had her dad die from cancer, and some oil Hun tried to hit her up, too. It was cruel.\n\nI'm glad you're stable, and I sincerely hope no Hun's ever bother you again.", "created_utc": "1541106181.0", "edited": "False", "id": "e8vfpsd", "is_submitter": "False", "link_id": "t3_9tdfgq", "parent_id": "t3_9tdfgq", "score": "16", "subreddit": "antiMLM", "subreddit_id": "t5_2swge"}, {"author": "illustriousgarb", "body": "This! I do a great deal of cross-cultural interaction (I married into a family that is a different race than my biological family - I'm super white), and the only time they get pissed about this stuff is when they are openly being mocked. You wanna wear clothes from their home country? Great! They'll help you find a good deal!\n\nMeanwhile, some white girl is mad because another white girl dared to wear a kimono.", "created_utc": "1541090947.0", "edited": "False", "id": "e8uw1yr", "is_submitter": "False", "link_id": "t3_9t9ks1", "parent_id": "t1_e8utdg1", "score": "6", "subreddit": "unpopularopinion", "subreddit_id": "t5_2tk0s"}, {"author": "illustriousgarb", "body": "My mother-in-law sent over cookies and cupcakes yesterday. I was so mad!!!!", "created_utc": "1541090265.0", "edited": "False", "id": "e8uv6ml", "is_submitter": "False", "link_id": "t3_9t317c", "parent_id": "t3_9t317c", "score": "1", "subreddit": "GestationalDiabetes", "subreddit_id": "t5_2w321"}, {"author": "illustriousgarb", "body": "Holy shit! Is it even appropriate for a triage nurse to send *anyone* home with out evaluation? Anytime I've called the triage nurse line, they'll give me guidelines for managing things at home, but they're very clear that I should go to the ER if symptoms change, or if I'm concerned. I've never had a nurse make the call to send me home.", "created_utc": "1541083358.0", "edited": "False", "id": "e8umzye", "is_submitter": "False", "link_id": "t3_9t745d", "parent_id": "t3_9t745d", "score": "27", "subreddit": "antiMLM", "subreddit_id": "t5_2swge"}, {"author": "illustriousgarb", "body": "Yeah......I'm gonna need to see this Hun's lab notes. Looks like we call scientific misconduct, aka LYING.", "created_utc": "1541039060.0", "edited": "False", "id": "e8tsxwd", "is_submitter": "False", "link_id": "t3_9t5gqe", "parent_id": "t3_9t5gqe", "score": "6", "subreddit": "antiMLM", "subreddit_id": "t5_2swge"}, {"author": "illustriousgarb", "body": "Two of the women in my writing critique group are lawyers, one has a private practice for a while. It can definitely be done and quite honestly, I think having a career lends itself to more interesting plots. Both of them have very interesting stories that involve a bit of law.\n\nYou may not be able to write as often as you want, but you'll find a way, as long as it continues to be a passion.", "created_utc": "1541025683.0", "edited": "False", "id": "e8tfp5k", "is_submitter": "False", "link_id": "t3_9t1cp0", "parent_id": "t3_9t1cp0", "score": "1", "subreddit": "writing", "subreddit_id": "t5_2qh2n"}, {"author": "illustriousgarb", "body": "That's disgusting.", "created_utc": "1540950711.0", "edited": "False", "id": "e8rjko0", "is_submitter": "False", "link_id": "t3_9stnwd", "parent_id": "t3_9stnwd", "score": "14", "subreddit": "antiMLM", "subreddit_id": "t5_2swge"}, {"author": "illustriousgarb", "body": "I love how the \"Crafters and woodworkers\" are an unnamed after thought.", "created_utc": "1540934842.0", "edited": "False", "id": "e8r1n07", "is_submitter": "False", "link_id": "t3_9ss8gf", "parent_id": "t3_9ss8gf", "score": "58", "subreddit": "antiMLM", "subreddit_id": "t5_2swge"}, {"author": "illustriousgarb", "body": "My in-laws were not citizens (here legally though) at the time of my husband's birth. I'm terrified as well. This is not okay and I'm sorry.", "created_utc": "1540922023.0", "edited": "False", "id": "e8qlda5", "is_submitter": "False", "link_id": "t3_9smbfb", "parent_id": "t1_e8pvi4u", "score": "1", "subreddit": "politics", "subreddit_id": "t5_2cneq"}, {"author": "illustriousgarb", "body": "That should be a very short class. \"Essential oils are not safe for animals, don't use them on or around then, the end.\"\n\n", "created_utc": "1540875311.0", "edited": "False", "id": "e8pjyur", "is_submitter": "False", "link_id": "t3_9sktg7", "parent_id": "t3_9sktg7", "score": "87", "subreddit": "antiMLM", "subreddit_id": "t5_2swge"}, {"author": "illustriousgarb", "body": "\"doctors, schools and hospitals are starting to use essential oils.\" No. No they aren't. A quick gander at this subreddit (or Google) can easily prove this Hun wrong. Freaking liars.", "created_utc": "1540765778.0", "edited": "False", "id": "e8mnka0", "is_submitter": "False", "link_id": "t3_9s3z5k", "parent_id": "t3_9s3z5k", "score": "21", "subreddit": "antiMLM", "subreddit_id": "t5_2swge"}, {"author": "illustriousgarb", "body": "I wouldn't say I've \"overcome\" it, but I manage it with a combination of therapy and medication. I have had anxiety and depression for most of my life, and although I can have minor \"pick me ups\" with exercise and getting out into the world, medication and the talk therapy are the best help.", "created_utc": "1540695617.0", "edited": "False", "id": "e8l0cg2", "is_submitter": "False", "link_id": "t3_9rtza3", "parent_id": "t3_9rtza3", "score": "1", "subreddit": "AskWomen", "subreddit_id": "t5_2rxrw"}, {"author": "illustriousgarb", "body": "Thank you! I'm already on watch for a previous pre-term delivery, and likely repeat C-section for low-lying placenta. I just feel like it's complication after complication here. I'm glad to hear that life doesn't look so grim for those of us who don't eat red meat. :)", "created_utc": "1540676530.0", "edited": "False", "id": "e8khxlh", "is_submitter": "True", "link_id": "t3_9rvjaz", "parent_id": "t1_e8keun0", "score": "2", "subreddit": "GestationalDiabetes", "subreddit_id": "t5_2w321"}, {"author": "illustriousgarb", "body": "It drives me crazy that it never crosses their tiny minds that these things can HURT people. I'm not a terribly scent sensitive person, but I've also had a reaction to someone's EO's. So annoying. I'm glad you're okay.", "created_utc": "1540676369.0", "edited": "False", "id": "e8khsby", "is_submitter": "False", "link_id": "t3_9rrs7c", "parent_id": "t3_9rrs7c", "score": "7", "subreddit": "antiMLM", "subreddit_id": "t5_2swge"}, {"author": "illustriousgarb", "body": "Thank you.", "created_utc": "1540662312.0", "edited": "False", "id": "e8k3c11", "is_submitter": "True", "link_id": "t3_9rvjaz", "parent_id": "t1_e8k37b9", "score": "3", "subreddit": "GestationalDiabetes", "subreddit_id": "t5_2w321"}, {"author": "illustriousgarb", "body": "Thank you. I suspected I went too far in the low carb direction. I hope things are going well for you even though you've had to go to insulin", "created_utc": "1540662245.0", "edited": "False", "id": "e8k39ea", "is_submitter": "True", "link_id": "t3_9rvjaz", "parent_id": "t1_e8k1quk", "score": "2", "subreddit": "GestationalDiabetes", "subreddit_id": "t5_2w321"}, {"author": "illustriousgarb", "body": "Thank you. I know ultimately this isn't as big of a deal as I'm making it out to be...but you know how pregnancy is with emotions. Thank you for the reassurance.", "created_utc": "1540659872.0", "edited": "False", "id": "e8k0n63", "is_submitter": "True", "link_id": "t3_9rvjaz", "parent_id": "t1_e8k05hz", "score": "4", "subreddit": "GestationalDiabetes", "subreddit_id": "t5_2w321"}, {"author": "illustriousgarb", "body": "My inner Biblical scholar is twitching.", "created_utc": "1540612646.0", "edited": "False", "id": "e8j4d9h", "is_submitter": "False", "link_id": "t3_9rqp3y", "parent_id": "t3_9rqp3y", "score": "19", "subreddit": "antiMLM", "subreddit_id": "t5_2swge"}, {"author": "illustriousgarb", "body": "Dude. No way in hell am I spending $40 on a pair of pajamas that my kid is probably just going to have an epic shit blowout in. Guess I'm just not motivated enough to flush money down the toilet.", "created_utc": "1540612385.0", "edited": "False", "id": "e8j45de", "is_submitter": "False", "link_id": "t3_9rq86w", "parent_id": "t3_9rq86w", "score": "74", "subreddit": "antiMLM", "subreddit_id": "t5_2swge"}, {"author": "illustriousgarb", "body": "Lol literally every MLM talking point in one message.", "created_utc": "1540597373.0", "edited": "False", "id": "e8iq98k", "is_submitter": "False", "link_id": "t3_9rotg8", "parent_id": "t3_9rotg8", "score": "8", "subreddit": "antiMLM", "subreddit_id": "t5_2swge"}, {"author": "illustriousgarb", "body": "Holy shit, those are hideous!", "created_utc": "1540586406.0", "edited": "False", "id": "e8if1px", "is_submitter": "False", "link_id": "t3_9rmyen", "parent_id": "t1_e8i4dzx", "score": "11", "subreddit": "antiMLM", "subreddit_id": "t5_2swge"}, {"author": "illustriousgarb", "body": "Ugh, I have minor respiratory flare ups from time to time, and the place where I normally get massages was \"diffusing\" (spraying) some oil at the counter the last time I went. It made *me* choke and cough, I'm sure it could cause an asthma attack or an allergic reaction. That's cool Becky, lets break the rules so that some poor kid needs the hospital all because you can't science.", "created_utc": "1540520465.0", "edited": "False", "id": "e8gs13t", "is_submitter": "False", "link_id": "t3_9rgd6y", "parent_id": "t3_9rgd6y", "score": "11", "subreddit": "antiMLM", "subreddit_id": "t5_2swge"}, {"author": "illustriousgarb", "body": "I am not an ad rater, but I am definitely having issues with their tool. It has gotten so bad that I'm spending 3 hours to do about 1 hour of work because of all the crashing/refreshing we have to do. I submitted a ticket and got told not to submit a ticket. I've also been watching the question boards, and they basically get ignored...so no, it's not just you.", "created_utc": "1540508944.0", "edited": "False", "id": "e8gfgm0", "is_submitter": "False", "link_id": "t3_9rf9q3", "parent_id": "t3_9rf9q3", "score": "1", "subreddit": "WorkOnline", "subreddit_id": "t5_2y178"}, {"author": "illustriousgarb", "body": "Omg look! Someone in a vulnerable position that I can prey on to push my quackery! And don't forget to protect your family from teh evil sugarz!\n\nI'm glad your husband is okay, OP. That sounds scary.", "created_utc": "1540488032.0", "edited": "False", "id": "e8fqlxu", "is_submitter": "False", "link_id": "t3_9rbpek", "parent_id": "t3_9rbpek", "score": "9", "subreddit": "antiMLM", "subreddit_id": "t5_2swge"}, {"author": "illustriousgarb", "body": "So, I was just diagnosed with gestational diabetes, and this really pisses me off. There's already a shitload of garbage information out there about diabetes (I'm so sorry to those of you who are living with it chronically, I don't know how you stand the fear mongering and bullshit), and telling people that your magic oil is going to fix someone's diabetes is just cruel. ", "created_utc": "1540487820.0", "edited": "False", "id": "e8fqcec", "is_submitter": "False", "link_id": "t3_9ralcy", "parent_id": "t3_9ralcy", "score": "3", "subreddit": "antiMLM", "subreddit_id": "t5_2swge"}, {"author": "illustriousgarb", "body": "\"I've noticed I'm no longer making money off of you! Why???? Come back and give me money!\"", "created_utc": "1540487383.0", "edited": "False", "id": "e8fpt1n", "is_submitter": "False", "link_id": "t3_9rb7aa", "parent_id": "t3_9rb7aa", "score": "158", "subreddit": "antiMLM", "subreddit_id": "t5_2swge"}, {"author": "illustriousgarb", "body": "My bad. My brain isn't functioning tonight. ", "created_utc": "1540432239.0", "edited": "False", "id": "e8egbu1", "is_submitter": "False", "link_id": "t3_9r48pk", "parent_id": "t1_e8eg1hl", "score": "3", "subreddit": "antiMLM", "subreddit_id": "t5_2swge"}, {"author": "illustriousgarb", "body": "Probably because they know they won't pass the FDA requirements. The FDA requires that you can prove a product is both safe AND effective, and as we've all seen, itworks is definitely not effective.", "created_utc": "1540431476.0", "edited": "False", "id": "e8efhz6", "is_submitter": "False", "link_id": "t3_9r48pk", "parent_id": "t1_e8eecqz", "score": "6", "subreddit": "antiMLM", "subreddit_id": "t5_2swge"}, {"author": "illustriousgarb", "body": "I used to work in the pharmaceutical industry. Like on the end where you get to see all the product testing and how rigorous it is, and how most drugs never make it to market because they fail all these tests.\n\nA coworker of mine insisted she didn't want to get the flu shot because that's how the government controlled us. \n\nIt's a bit mind boggling how people in healthcare/science fields fall for this stuff, isn't it? ", "created_utc": "1540336489.0", "edited": "False", "id": "e8bspi6", "is_submitter": "False", "link_id": "t3_9qrunz", "parent_id": "t3_9qrunz", "score": "18", "subreddit": "antiMLM", "subreddit_id": "t5_2swge"}, {"author": "illustriousgarb", "body": "I hate everything I write, too. A successfully published author once explained that it's sort of a rite of passage to hate your work. But you keep at it, and eventually you get into a mindset where you'll not hate it all the time. But for sure, you won't get better if you keep deleting everything you write.\n\nWrite the terrible story. Hate every word. Then go back and edit it, or just set it aside if it doesn't work. We are out own worst critics, and I know that's cliche, but it's true. I can't tell you how many times I've sent something I deem \"horrible\" off for critique, and my writing group loves it. ", "created_utc": "1540248498.0", "edited": "False", "id": "e89isn3", "is_submitter": "False", "link_id": "t3_9qhj1o", "parent_id": "t3_9qhj1o", "score": "1", "subreddit": "writing", "subreddit_id": "t5_2qh2n"}, {"author": "illustriousgarb", "body": "Oh my goodness, I remember seeing these on my campus, but I was too busy to try and get a \"job,\" so I never looked into it. Never realized they were an MLM.", "created_utc": "1540248204.0", "edited": "False", "id": "e89ihhu", "is_submitter": "False", "link_id": "t3_9qhr25", "parent_id": "t3_9qhr25", "score": "2", "subreddit": "antiMLM", "subreddit_id": "t5_2swge"}, {"author": "illustriousgarb", "body": "I am a stay-at-home mom. You *are* a real mom. What the fuck. I'm so tired of these shitty people who try to pit stay-at-home parents against working parents, and it's even worse that she tried to guilt you into joining an MLM this way. Fuck her. I hope she gets fired.", "created_utc": "1540247689.0", "edited": "False", "id": "e89hxsr", "is_submitter": "False", "link_id": "t3_9qietd", "parent_id": "t3_9qietd", "score": "1664", "subreddit": "antiMLM", "subreddit_id": "t5_2swge"}, {"author": "illustriousgarb", "body": "I'm on a job, and the tech issues that they keep having have basically made it so I'm lucky if I can get an hour of work in a day. I'm definitely not making $30/day with them. Maybe if you are on a job AND lucky enough to not have tech issues.", "created_utc": "1540161753.0", "edited": "False", "id": "e87cb7y", "is_submitter": "False", "link_id": "t3_9q2kpw", "parent_id": "t1_e873nml", "score": "1", "subreddit": "WorkOnline", "subreddit_id": "t5_2y178"}, {"author": "illustriousgarb", "body": "But grief and stupidity aren't the same thing. Grief alters your ability to make sound and rational decisions. You didn't do anything wrong, she is 100% the bad guy in this situation. ", "created_utc": "1540161356.0", "edited": "False", "id": "e87bwe9", "is_submitter": "False", "link_id": "t3_9q42y0", "parent_id": "t1_e86yvh1", "score": "10", "subreddit": "antiMLM", "subreddit_id": "t5_2swge"}, {"author": "illustriousgarb", "body": "Fuck that doctor for comparing formula to sand. I too, had supply issues and needed to switch to formula. We get enough judgement from the world by just being mothers, our doctors shouldn't be part of that judgement. \n", "created_utc": "1540159856.0", "edited": "False", "id": "e87ac8d", "is_submitter": "False", "link_id": "t3_9q29i0", "parent_id": "t1_e86zbea", "score": "9", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "illustriousgarb", "body": "I went to Vietnam, Singapore, and Thailand with my 1.5 year old. The jet lag was a bit of a bear for a couple of days, but honestly it was much easier than I anticipated. I agree with the above posters, check out websites for activities and planning, and above all, be flexible. It's definitely not the nightmare we are led to believe. :)", "created_utc": "1540085838.0", "edited": "False", "id": "e85hslt", "is_submitter": "False", "link_id": "t3_9px5ib", "parent_id": "t3_9px5ib", "score": "2", "subreddit": "travel", "subreddit_id": "t5_2qh41"}, {"author": "illustriousgarb", "body": "Uuuuuugh essential oil MLMs are a plague on humanity.", "created_utc": "1539897631.0", "edited": "False", "id": "e80va74", "is_submitter": "False", "link_id": "t3_9pbnro", "parent_id": "t3_9pbnro", "score": "2", "subreddit": "antiMLM", "subreddit_id": "t5_2swge"}, {"author": "illustriousgarb", "body": "Your sewing group sounds awesome and I want to be a part of it\n\n&#x200B;", "created_utc": "1539891940.0", "edited": "False", "id": "e80o9la", "is_submitter": "False", "link_id": "t3_9p7j6s", "parent_id": "t3_9p7j6s", "score": "3", "subreddit": "antiMLM", "subreddit_id": "t5_2swge"}, {"author": "illustriousgarb", "body": "At least OP will know who patient zero is in the office E. coli outbreak?\n\nSeriously though, fucking gross.", "created_utc": "1539891119.0", "edited": "False", "id": "e80n82a", "is_submitter": "False", "link_id": "t3_9p63kq", "parent_id": "t3_9p63kq", "score": "4", "subreddit": "antiMLM", "subreddit_id": "t5_2swge"}, {"author": "illustriousgarb", "body": "I very much agree. I actually think Sebastian eating his soul is too predictable of an ending. For my personal satisfaction, I'd like to see a twist ending. It would be awesome if it was a \"good\" ending. Not necessarily a happy one, just not the one we're expecting.", "created_utc": "1539748668.0", "edited": "False", "id": "e7wzsz2", "is_submitter": "False", "link_id": "t3_9mx8um", "parent_id": "t1_e7llaj3", "score": "6", "subreddit": "blackbutler", "subreddit_id": "t5_2tu8z"}, {"author": "illustriousgarb", "body": "I tried cloth diapering, and there's some perks...but when I was doing insane amounts of laundry, i decided it just wasn't the right option for us. I agree with monstermuddy, give it a try but don't feel bad if it doesn't work for you! And honestly, that goes across the board for parenting, within reason of course. I wanted to follow the crunchy route, but literally none of it worked for us. My kid still turned into a threenager. :) Good on you for sticking to the vaccinating!", "created_utc": "1538873718.0", "edited": "False", "id": "e7b0vlj", "is_submitter": "False", "link_id": "t3_9lwodq", "parent_id": "t1_e7at3ol", "score": "5", "subreddit": "antiMLM", "subreddit_id": "t5_2swge"}, {"author": "illustriousgarb", "body": "Omg these sound like great ways to get a one way ticket on the bankruptcy train.", "created_utc": "1538789278.0", "edited": "False", "id": "e791510", "is_submitter": "False", "link_id": "t3_9lrnxv", "parent_id": "t3_9lrnxv", "score": "7", "subreddit": "antiMLM", "subreddit_id": "t5_2swge"}, {"author": "illustriousgarb", "body": "Omg this is so true. I took on a \"work from home\" job, naively thinking I could watch my three year old and get work done at the same time. Nope. Nope nope nope.", "created_utc": "1538081163.0", "edited": "False", "id": "e6r93dh", "is_submitter": "False", "link_id": "t3_9jftmb", "parent_id": "t1_e6r7894", "score": "14", "subreddit": "antiMLM", "subreddit_id": "t5_2swge"}, {"author": "illustriousgarb", "body": "Hoo boy. Time to rename it to a \"resale shop.\"", "created_utc": "1537645181.0", "edited": "False", "id": "e6g9tlt", "is_submitter": "False", "link_id": "t3_9i1tjk", "parent_id": "t3_9i1tjk", "score": "2", "subreddit": "antiMLM", "subreddit_id": "t5_2swge"}, {"author": "illustriousgarb", "body": "Damn, guess my gut instinct was right about Traveling Vineyard. They almost sucked me in. It's easy to lure me with wine though.....", "created_utc": "1535583125.0", "edited": "False", "id": "e52bxgs", "is_submitter": "False", "link_id": "t3_9aolhe", "parent_id": "t3_9aolhe", "score": "2", "subreddit": "antiMLM", "subreddit_id": "t5_2swge"}, {"author": "illustriousgarb", "body": "If you are asking this question, you're probably not an awful writer. \n\nWe all hate what we write, at least at first. And probably all the way until publication. \n\nBeing self-aware enough to recognize a need for improvement, and a desire to do so already put you in a place where you shouldn't worry too much about being awful.", "created_utc": "1535327352.0", "edited": "False", "id": "e4w0m7k", "is_submitter": "False", "link_id": "t3_9aiy8w", "parent_id": "t3_9aiy8w", "score": "14", "subreddit": "writing", "subreddit_id": "t5_2qh2n"}, {"author": "illustriousgarb", "body": "I don't know a ton about coding, but I do know that Ruby on Rails is still a relevant language, as my husband has done some coding with it at his job. But it may have changed a little bit, so maybe check out https://www.codecademy.com/ for a starting point.", "created_utc": "1533998829.0", "edited": "False", "id": "e40ct2q", "is_submitter": "False", "link_id": "t3_96c856", "parent_id": "t1_e3zq6a2", "score": "3", "subreddit": "WorkOnline", "subreddit_id": "t5_2y178"}, {"author": "illustriousgarb", "body": "That's pretty much exactly my story, but I'm a little younger. It's weird how it happens, but it does.", "created_utc": "1533323620.0", "edited": "False", "id": "e3jxmax", "is_submitter": "False", "link_id": "t3_948h8m", "parent_id": "t1_e3jxj83", "score": "5", "subreddit": "antiMLM", "subreddit_id": "t5_2swge"}, {"author": "illustriousgarb", "body": "Hang on, you're a junior in college with a writing/copywriting actual job? \n\nThese people are either 1) jealous, as has already been pointed out, or 2) completely naiive as to how the real world works. You're out there making money with your passion and you don't even have a degree yet. Hell, *I'm* jealous. But don't worry, I won't tear you down. :) \n\nBrush them off. They're dust on your shoulder. You're on a path to live while doing your passion. That's the dream, yo!", "created_utc": "1533322381.0", "edited": "False", "id": "e3jw6b5", "is_submitter": "False", "link_id": "t3_945cxz", "parent_id": "t3_945cxz", "score": "3", "subreddit": "writing", "subreddit_id": "t5_2qh2n"}, {"author": "illustriousgarb", "body": "I'm sorry you lost your mother. \n\nThere's no timeline on grief, so take it slowly. Maybe write a little bit here and there when you're feeling good, and you may start to see some motivation come back. But if it hurts too much, it's totally okay to step back and try again later.\n", "created_utc": "1533321875.0", "edited": "False", "id": "e3jvktr", "is_submitter": "False", "link_id": "t3_94bsj5", "parent_id": "t3_94bsj5", "score": "5", "subreddit": "writing", "subreddit_id": "t5_2qh2n"}, {"author": "illustriousgarb", "body": "I'm so sorry. I'm glad both of you came out of that alright.", "created_utc": "1533308215.0", "edited": "False", "id": "e3jf25a", "is_submitter": "False", "link_id": "t3_943etv", "parent_id": "t3_943etv", "score": "1", "subreddit": "antiMLM", "subreddit_id": "t5_2swge"}, {"author": "illustriousgarb", "body": "I fucking hate people who prey on women dealing with infertility like that. \"Falling pregnant after years of IVF!\" Yea, I dealt with infertility and now I'm suddenly naturally pregnant with #2, but it's because the root of my infertility actually had a treatable cause and....we got lucky. Not some magic supplement, nor any other \"lifestyle change\" or whatever bullshit they want to spout. Sometimes people get pregnant despite infertility issues, and it is seriously nothing more than fucking luck. \n\nThese people prey on desperation and it's disgusting.", "created_utc": "1533308090.0", "edited": "False", "id": "e3jewwj", "is_submitter": "False", "link_id": "t3_948h8m", "parent_id": "t3_948h8m", "score": "36", "subreddit": "antiMLM", "subreddit_id": "t5_2swge"}, {"author": "illustriousgarb", "body": "\"Burnout doesn't exist.\"\n\nHahahahahahahahahahahahahahahahahahahaha.", "created_utc": "1533160225.0", "edited": "False", "id": "e3ftf2m", "is_submitter": "False", "link_id": "t3_93otqi", "parent_id": "t3_93otqi", "score": "24", "subreddit": "LateStageCapitalism", "subreddit_id": "t5_39qgx"}, {"author": "illustriousgarb", "body": "I react that way, too. For me, it's a combination of too much skepticism and years of having smoke blown up my butt when dealing with infertility. I get that people like to be encouraged, but most of the time I just roll my eyes at the platitudes.\n\nThat being said, a lot of the people who have commented are on point. There's nothing wrong with you, OP. :)", "created_utc": "1533159137.0", "edited": "False", "id": "e3fs54n", "is_submitter": "False", "link_id": "t3_93q8pg", "parent_id": "t3_93q8pg", "score": "3", "subreddit": "writing", "subreddit_id": "t5_2qh2n"}, {"author": "illustriousgarb", "body": "Thiiiiiiis.\n\nI used to work in the pharmaceutical industry. Despite what people seem to believe, the FDA is no joke. The safety and regulation involved with drugs is NUTS. \n\nSo yeah, I'm way less concerned with a regulated medication than a supplement.", "created_utc": "1531851200.0", "edited": "False", "id": "e2k03ur", "is_submitter": "False", "link_id": "t3_8zlp2q", "parent_id": "t1_e2jq5bn", "score": "27", "subreddit": "antiMLM", "subreddit_id": "t5_2swge"}, {"author": "illustriousgarb", "body": "Honestly, I'd be interested, but I'm a total amateur still honing my craft.", "created_utc": "1531834202.0", "edited": "False", "id": "e2jg5z7", "is_submitter": "False", "link_id": "t3_8yjbuj", "parent_id": "t3_8yjbuj", "score": "1", "subreddit": "WorkOnline", "subreddit_id": "t5_2y178"}, {"author": "illustriousgarb", "body": "I hope next time TSA confiscates her migraine trigger machine.", "created_utc": "1531691110.0", "edited": "False", "id": "e2g5zhq", "is_submitter": "False", "link_id": "t3_8z3w8o", "parent_id": "t3_8z3w8o", "score": "19", "subreddit": "antiMLM", "subreddit_id": "t5_2swge"}, {"author": "illustriousgarb", "body": "I've written for content mills that have specified that you're ghostwriting.... But unless they specifically told you this, then they're pretty darn skeevy. There's just no way they were hacked just to change your byline. I suspect someone just wanted an article they could take credit for.\n\nAs for what to do, I'm not sure about the legalities, but I'd definitely blacklist them as a client.", "created_utc": "1531451770.0", "edited": "1531452256.0", "id": "e2apput", "is_submitter": "False", "link_id": "t3_8ygdgh", "parent_id": "t3_8ygdgh", "score": "11", "subreddit": "writing", "subreddit_id": "t5_2qh2n"}, {"author": "illustriousgarb", "body": "Oh my God no. Those poor birds!! When we had our parrotlet, we read so many stories about how scented candles were so awful for their little lungs.....", "created_utc": "1531443631.0", "edited": "False", "id": "e2ahkuj", "is_submitter": "False", "link_id": "t3_8yc2zl", "parent_id": "t3_8yc2zl", "score": "4", "subreddit": "antiMLM", "subreddit_id": "t5_2swge"}, {"author": "illustriousgarb", "body": "I'm so glad social media wasn't a thing when I was in middle school. My naiive, desperate self would have jumped on this shit.", "created_utc": "1531428908.0", "edited": "False", "id": "e2a1gze", "is_submitter": "False", "link_id": "t3_8y9qh0", "parent_id": "t3_8y9qh0", "score": "2", "subreddit": "antiMLM", "subreddit_id": "t5_2swge"}, {"author": "illustriousgarb", "body": "I fucking hated this when I lived in Japan. People, your skin color is gorgeous, don't bleach it!", "created_utc": "1531428661.0", "edited": "False", "id": "e2a162o", "is_submitter": "False", "link_id": "t3_8yaqxx", "parent_id": "t1_e29ju73", "score": "24", "subreddit": "antiMLM", "subreddit_id": "t5_2swge"}, {"author": "illustriousgarb", "body": "Well hello fellow Madisonians.", "created_utc": "1531356665.0", "edited": "False", "id": "e287nez", "is_submitter": "False", "link_id": "t3_8xw122", "parent_id": "t1_e273gby", "score": "3", "subreddit": "antiMLM", "subreddit_id": "t5_2swge"}, {"author": "illustriousgarb", "body": "I mean, writing is meant to be thought provoking, and we aren't always supposed to be comfortable. I don't think this is a bad idea.\n\nHowever, it might be good to use the environment or other characters to give a sense of \"this is not right\" so the reader doesn't jump to a \"victim blaming\" conclusion.", "created_utc": "1531093712.0", "edited": "False", "id": "e211zb9", "is_submitter": "False", "link_id": "t3_8x5t6t", "parent_id": "t3_8x5t6t", "score": "22", "subreddit": "writing", "subreddit_id": "t5_2qh2n"}, {"author": "illustriousgarb", "body": "I didn't \"get my feelings hurt.\" My hospital lactation consultants told me my baby was getting adequate food from me despite the fact that her blood sugars were plummeting. My boobs never made milk. They allowed her to be discharged even though she lost >10% of her birth weight and didn't even tell me. I've since learned that is done so they can mark me as \"breastfeeding\" and get their money from the BFHI. \n\nThere are countless other stories of babies being harmed from aggressive breastfeeding promotion. Fed is Best shares many.\n\nIf you think \"Fed Is Best\" exists because of hurt feelings, you are dead wrong.", "created_utc": "1531093085.0", "edited": "False", "id": "e211dy1", "is_submitter": "False", "link_id": "t3_8x1v6u", "parent_id": "t1_e20rqpr", "score": "-1", "subreddit": "worldnews", "subreddit_id": "t5_2qh13"}, {"author": "illustriousgarb", "body": "I was personally told I should never have had a child if I wasn't going to breastfeed. Because I could have foreseen that my boobs weren't going to work or some garbage. \n\nOh, and the hospital allowed her to be discharged despite the fact that she had lost >10&#37; of her birth weight. Without telling me. And she was preterm. SO that was a thing.", "created_utc": "1531088581.0", "edited": "False", "id": "e20wzyp", "is_submitter": "False", "link_id": "t3_8x1ji4", "parent_id": "t1_e20nqcb", "score": "2", "subreddit": "politics", "subreddit_id": "t5_2cneq"}]