[{"author": "ImDuckDamnYou", "body": "The series will end by hinting at the next game in the franchise and with many open plot threads.", "created_utc": "1667175895.0", "edited": "False", "id": "iufuxr6", "is_submitter": "False", "link_id": "t3_yhn2mi", "parent_id": "t3_yhn2mi", "score": "3", "subreddit": "KingdomHearts", "subreddit_id": "t5_2s3jo"}, {"author": "ImDuckDamnYou", "body": "Barab looks like he could legitimately be a character Nomura introduces in the next game. Look, he has twice the zippers that regular Xigbar has!", "created_utc": "1667175630.0", "edited": "False", "id": "iufudgx", "is_submitter": "False", "link_id": "t3_yh7ymr", "parent_id": "t3_yh7ymr", "score": "2", "subreddit": "KingdomHearts", "subreddit_id": "t5_2s3jo"}, {"author": "ImDuckDamnYou", "body": "Not a saying or phrase, I just love how ピーチクパーチク sounds", "created_utc": "1667114232.0", "edited": "False", "id": "iucf0cl", "is_submitter": "False", "link_id": "t3_ygqdlj", "parent_id": "t3_ygqdlj", "score": "1", "subreddit": "LearnJapanese", "subreddit_id": "t5_2qyls"}, {"author": "ImDuckDamnYou", "body": "It does feel like as a healer at times you need to find like the guy on your team who is most likely to carry and support him as much as possible\n\nLike at times during those crappy games where people just don't group up I have to bite the bullet, find someone who I think has potential and sometimes we can turn the fight around or stay alive lpng enough for the rest of the team to catch up", "created_utc": "1666910301.0", "edited": "False", "id": "iu1tcj6", "is_submitter": "False", "link_id": "t3_yer4wt", "parent_id": "t1_iu16rwf", "score": "4", "subreddit": "Overwatch", "subreddit_id": "t5_2u5kl"}, {"author": "ImDuckDamnYou", "body": "Are these in common use? I've never seen them used before.", "created_utc": "1666314456.0", "edited": "False", "id": "it5ague", "is_submitter": "False", "link_id": "t3_y96p1o", "parent_id": "t3_y96p1o", "score": "7", "subreddit": "LearnJapanese", "subreddit_id": "t5_2qyls"}, {"author": "ImDuckDamnYou", "body": "Maybe, but also Duusu didn't outright say Natalie was his former holder, so it might only apply when a kwami is saying something that outright confirms a former or present holder.", "created_utc": "1665918195.0", "edited": "False", "id": "isj2gtw", "is_submitter": "False", "link_id": "t3_y56qkp", "parent_id": "t1_isixuf8", "score": "5", "subreddit": "miraculousladybug", "subreddit_id": "t5_39tdz"}, {"author": "ImDuckDamnYou", "body": "Even if you could find an APK, I'm not sure it would work since there are no servers anymore.", "created_utc": "1665894054.0", "edited": "False", "id": "isi6wqd", "is_submitter": "False", "link_id": "t3_y54n1b", "parent_id": "t3_y54n1b", "score": "8", "subreddit": "TapTogether", "subreddit_id": "t5_gad5f"}, {"author": "ImDuckDamnYou", "body": "Went to school in Australia.\n\nAt my primary school German was mandatory from grade 1 to grade 6. I retained literally nothing of this. The only words I know are \"Ich\", \"bin\", \"eins\", \"zwei\", \"drei\". Absolutely nothing else.\n\nIn high school, my school offered Japanese, Chinese and French as languages they taught. I think usually they made it a foreign language of your choosing was compulsive in grade 7, but for the year I started they changed it up and made it compulsive for each grade 7 student to spend a term studying a different language. So in the first term, my class was learning french. In term two we were learning Chinese and in term three we were learning Japanese.\n\nI spent my time after grade 7 learning Japanese and that took me to a pretty comfortable N5.\n\nA lot of nearby schools offered Indonesian to their students too.\n\nIn my state years 11 and 12 are conducted at a separate school, college (different to university). My college offered Chinese, Japanese and French once again, but with the addition of Latin. I once again studied Japanese, by the time I graduated I was quite close to N4. Additionally my college also had some informal classes. These were ran by volunteers and were not part of the curriculum. So there was a woman who taught some Spanish to a small amount of students if they were willing. I did attend these lessons but I once again have retained nothing.", "created_utc": "1664183586.0", "edited": "False", "id": "ipy7luf", "is_submitter": "False", "link_id": "t3_xnty9k", "parent_id": "t3_xnty9k", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "ImDuckDamnYou", "body": "I know a lot of people use Satori Reader for shadowing.", "created_utc": "1663274653.0", "edited": "False", "id": "iokv759", "is_submitter": "False", "link_id": "t3_xf66m2", "parent_id": "t3_xf66m2", "score": "3", "subreddit": "LearnJapanese", "subreddit_id": "t5_2qyls"}, {"author": "ImDuckDamnYou", "body": "Went through the netflix order. Honestly, I hated Miraculous. Like I really hated it because I was like \"Oh, so it's just monster of the week, no overarching plot, not even an introduction episode! I'm just supposed to understand what's happening?\"\n\nTook like a 12 month break, saw some stuff about the New York special and started to watch it again. Still in the Netflix order. But I persisted this time and grew to really enjoy it by the end. Either that or stockholm set in...", "created_utc": "1663187075.0", "edited": "False", "id": "iofy6v0", "is_submitter": "False", "link_id": "t3_xdqfuo", "parent_id": "t3_xdqfuo", "score": "1", "subreddit": "miraculousladybug", "subreddit_id": "t5_39tdz"}, {"author": "ImDuckDamnYou", "body": "A1.りんご、島、帽子、船、手紙、北\n\nA2.なべ、心臓、絵、結婚、ドレス、警察\n\nB1.タオル、 馬、キッチン、セーター、ボウル、植物\n\nB2.？、？、玉ねぎ、？、カエル、ココナツ\n\nC1.？、？、木、？、せーらー、？\n\nC2.？、？、？、フレンチホルン、？、？\n\nYou can really tell where my vocab drops off a cliff", "created_utc": "1663120571.0", "edited": "False", "id": "ioc9ldo", "is_submitter": "False", "link_id": "t3_xd81ah", "parent_id": "t3_xd81ah", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "ImDuckDamnYou", "body": "A local is a missing a toy poodle if that fits with what you saw", "created_utc": "1662540801.0", "edited": "False", "id": "infe4my", "is_submitter": "False", "link_id": "t3_x4r1xr", "parent_id": "t3_x4r1xr", "score": "1", "subreddit": "hobart", "subreddit_id": "t5_2rjvn"}, {"author": "ImDuckDamnYou", "body": "I believe we did, a co-worker of mine was mentioning his kid had a student free day yesterday.", "created_utc": "1662132436.0", "edited": "False", "id": "imt33ic", "is_submitter": "False", "link_id": "t3_x3xijq", "parent_id": "t1_ims12bf", "score": "2", "subreddit": "australia", "subreddit_id": "t5_2qh8e"}, {"author": "ImDuckDamnYou", "body": "Between Adrien and Marinette, Adrien is just a much more interesting character because he is intrinsically involved with the main plot regardless of whether or not he is cat noir. Marinette on the other hand would have absolutely nothing to do with the plot if she wasn't Ladybug. She has no stakes in this really apart from being the main character.", "created_utc": "1661297160.0", "edited": "False", "id": "ilivdt7", "is_submitter": "False", "link_id": "t3_wvs1g0", "parent_id": "t1_ilhcdbc", "score": "11", "subreddit": "miraculousladybug", "subreddit_id": "t5_39tdz"}, {"author": "ImDuckDamnYou", "body": "had to check if this was the fma subreddit", "created_utc": "1658275096.0", "edited": "False", "id": "igum34k", "is_submitter": "False", "link_id": "t3_w2mor5", "parent_id": "t3_w2mor5", "score": "1", "subreddit": "Neverbrokeabone", "subreddit_id": "t5_2zvcf"}, {"author": "ImDuckDamnYou", "body": "When dictator just doesn't have the same ring anymore", "created_utc": "1657570501.0", "edited": "False", "id": "ifrltft", "is_submitter": "False", "link_id": "t3_vweauy", "parent_id": "t3_vweauy", "score": "1", "subreddit": "worldnews", "subreddit_id": "t5_2qh13"}, {"author": "ImDuckDamnYou", "body": "It's hard, hang in there!\n\nI work 12 hours a day so it can be hard to keep up with reviews. During my breaks at work, I take the time to push through my reviews/lessons on Wanikani and Satori Reader. After a shift I'll read a new chapter of Satori Reader and either watch an episode of an anime with Japanese subs or read a few pages of whatever book I'm reading as I cry about my lack of free time and how I need to go to sleep now or else I'll never get up in time for work tomorrow. \n\nOn my days off I silently pray this weekend never ends as I finally take the time to indulge in some escapism. I will sometimes hop onto VR chat to make a sincere attempt at speaking some japanese on the JP EN exchange world which usually ends in my feeling worse about myself. Spend some more time reading, watching anime. And push through all my housework and talk to friends online (clearly I do not have a regular social life).\n\nThe only way you can do this is to take advantage of any small breaks you have to push through your reviews and when you do have more free time you can do immersion. It's not entirely fun and sometimes you'll trip and fall behind on reviews but once you find a rhythm that works for you it isn't as hard anymore.", "created_utc": "1656084909.0", "edited": "False", "id": "idkj6jy", "is_submitter": "False", "link_id": "t3_vj5lk2", "parent_id": "t3_vj5lk2", "score": "1", "subreddit": "LearnJapanese", "subreddit_id": "t5_2qyls"}, {"author": "ImDuckDamnYou", "body": "I feel a need to say this, I'm sorry for your loss.", "created_utc": "1655756170.0", "edited": "False", "id": "id3lar5", "is_submitter": "False", "link_id": "t3_vgocbi", "parent_id": "t3_vgocbi", "score": "48", "subreddit": "LearnJapanese", "subreddit_id": "t5_2qyls"}, {"author": "ImDuckDamnYou", "body": "OP. this is a joke, you can go to northgate but it is just a regular shopping centre, no art.", "created_utc": "1655703891.0", "edited": "False", "id": "id12dsy", "is_submitter": "False", "link_id": "t3_vgdd00", "parent_id": "t1_id10aw2", "score": "7", "subreddit": "hobart", "subreddit_id": "t5_2rjvn"}, {"author": "ImDuckDamnYou", "body": "I have, I tried to overcome the tsunami for a little bit before I gave up and rolled back to the beginning. It can be very discouraging, vacation mode is a godsend though.", "created_utc": "1655448985.0", "edited": "False", "id": "icok3il", "is_submitter": "False", "link_id": "t3_vdondu", "parent_id": "t1_icojcke", "score": "2", "subreddit": "LearnJapanese", "subreddit_id": "t5_2qyls"}, {"author": "ImDuckDamnYou", "body": "I'm around 23 levels in and thought I would challenge myself to singing karaoke reading everything in Japanese, I was able to read most of the kanji in the songs!", "created_utc": "1655398090.0", "edited": "False", "id": "iclnam4", "is_submitter": "False", "link_id": "t3_vdondu", "parent_id": "t1_icllfni", "score": "45", "subreddit": "LearnJapanese", "subreddit_id": "t5_2qyls"}, {"author": "ImDuckDamnYou", "body": "I think the real question is why are you asking google if you broke a bone. Is there something you're not telling us... ?", "created_utc": "1654723586.0", "edited": "False", "id": "ibnox5f", "is_submitter": "False", "link_id": "t3_v7vzw3", "parent_id": "t3_v7vzw3", "score": "25", "subreddit": "Neverbrokeabone", "subreddit_id": "t5_2zvcf"}, {"author": "ImDuckDamnYou", "body": "I love satori reader, especially since it goes into detail about more complicated grammatical structures that you come across when reading", "created_utc": "1654236536.0", "edited": "False", "id": "ib0aakw", "is_submitter": "False", "link_id": "t3_v3r043", "parent_id": "t3_v3r043", "score": "4", "subreddit": "LearnJapanese", "subreddit_id": "t5_2qyls"}, {"author": "ImDuckDamnYou", "body": "Pls I only just got on reddit for the first time today. Every other time I picked up my phone was to do my wanikani reviews. It's 7pm, Please sir!", "created_utc": "1654160384.0", "edited": "False", "id": "iaw3q42", "is_submitter": "False", "link_id": "t3_v2xq75", "parent_id": "t3_v2xq75", "score": "2", "subreddit": "LearnJapanese", "subreddit_id": "t5_2qyls"}, {"author": "ImDuckDamnYou", "body": "Badly.\n\nMostly I use wanikani and Satori Reader rn. I also have anki but I don't use it seriously. Like if I miss a day on it or something I will live.\n\nApart from that I am very slowly reading through Harry Potter and I'm watching Inuyasha with Japanese subs.\n\nI know I need to get a tutor or someone to practice output with but to be honest, my social anxiety is a little too much for me to do that now.", "created_utc": "1652864579.0", "edited": "False", "id": "i91ws0o", "is_submitter": "False", "link_id": "t3_us16rt", "parent_id": "t3_us16rt", "score": "4", "subreddit": "LearnJapanese", "subreddit_id": "t5_2qyls"}, {"author": "ImDuckDamnYou", "body": "Big fan of idol music, they have some interesting quirks which became really common\n\nFor instance, if there is a small tsu, they will pronounce the vowel before it twice. So \"決まって\" ends up sounding like\"きまっあって\"\n\nAlso whenever a they end a phrase with \"て\" in a more upbeat song it'll turn into a weird little \"てゃ\"\n\nI remember watching a video about all the quirks morning musume singers have a while ago but there's no way I'd find it now.\n\nAlso pitch accent is non existent when sung.", "created_utc": "1652857200.0", "edited": "1652857449.0", "id": "i91op19", "is_submitter": "False", "link_id": "t3_urs185", "parent_id": "t3_urs185", "score": "1", "subreddit": "LearnJapanese", "subreddit_id": "t5_2qyls"}, {"author": "ImDuckDamnYou", "body": "I had to check if we were in the same comment chain because the exact same thing happened to me about a month ago when talking about reading Harry Potter.", "created_utc": "1652846709.0", "edited": "False", "id": "i91a2nr", "is_submitter": "False", "link_id": "t3_urlgvw", "parent_id": "t1_i8z0x7x", "score": "0", "subreddit": "LearnJapanese", "subreddit_id": "t5_2qyls"}, {"author": "ImDuckDamnYou", "body": "Keyhole TV? I recently found that again on my old laptop", "created_utc": "1652616684.0", "edited": "False", "id": "i8or94w", "is_submitter": "False", "link_id": "t3_uq07r8", "parent_id": "t1_i8oatle", "score": "1", "subreddit": "LearnJapanese", "subreddit_id": "t5_2qyls"}, {"author": "ImDuckDamnYou", "body": "Like others have said you don't need that much equipment. It's really unnecessary. Also consider he is a YouTuber so of course he will have somewhat more expensive equipment.\n\nIf you want to record while shadowing, most phones have a voice recording application you can use. If you want to do it on the computer, just go out and get a cheap microphone and headphones. There is a free program you can use called Audacity which will work fine for what you need.\n\nI'd really advise going out of your way to buy $100+ on equipment if it's just for shadowing.", "created_utc": "1652004069.0", "edited": "False", "id": "i7s4s07", "is_submitter": "False", "link_id": "t3_uko7pd", "parent_id": "t3_uko7pd", "score": "1", "subreddit": "LearnJapanese", "subreddit_id": "t5_2qyls"}, {"author": "ImDuckDamnYou", "body": "It's very anxiety inducing. It's not really taking offence to my presence being noted, but it is a very unpleasant experience if someone says my name in stream without me saying anything in chat.\n\nIt's like, I would rather view and not interact. So when a streamer will say my name they are forcibly taking away my ability to avoid interaction. \n\nRegardless, at the end of the day shouldn't the streamer be making allowances to make the viewer as comfortable as possible? After all, a streamer has little reason to exist without a viewer.", "created_utc": "1651772983.0", "edited": "False", "id": "i7gashq", "is_submitter": "False", "link_id": "t3_uixeuj", "parent_id": "t1_i7fuy63", "score": "2", "subreddit": "Twitch", "subreddit_id": "t5_2s0fe"}, {"author": "ImDuckDamnYou", "body": "Thank you!", "created_utc": "1650620752.0", "edited": "False", "id": "i5q9ypv", "is_submitter": "False", "link_id": "t3_u6sv4h", "parent_id": "t1_i5kosig", "score": "1", "subreddit": "LearnJapanese", "subreddit_id": "t5_2qyls"}, {"author": "ImDuckDamnYou", "body": "I spent SO long yesterday trying to find a way to do this on Funimation, does it work on there?", "created_utc": "1650396995.0", "edited": "False", "id": "i5dulzp", "is_submitter": "False", "link_id": "t3_u6sv4h", "parent_id": "t3_u6sv4h", "score": "1", "subreddit": "LearnJapanese", "subreddit_id": "t5_2qyls"}, {"author": "ImDuckDamnYou", "body": "Just to clarify, I have previously read a few light novels but I am still very much at the lower level of intermediate.\n\nI think the main point of reading Harry Potter is to start dipping your toes into reading in your target language. At such an early point I'm not sure if it's really so important in understanding a Japanese mindset in literature when you can barely put together the sentences you are reading. I don't see anything wrong with reading a book you are already acquainted with and enjoy in order to solidify your understanding of grammar and vocabulary. I think it helps build confidence to start attempting native material that maybe you aren't familiar with. It's not like every book you'll ever read in your target language will be translations of books you already know regardless, I think it will be much more interesting getting to a point where you feel confident in your ability to try reading completely foreign language.\n\nThat and I don't know how many people have previously read much translated Japanese literature.\n\nAs far as what the translation on the Harry Potter books are like, I'm not really sure I'm qualified to answer because I can't personally discern between native prose and clunky and stiff translations. All I can say is it gets the idea across and the sentences seem to be all translated directly from the original language, without any weird flourishes.", "created_utc": "1649895456.0", "edited": "1649896689.0", "id": "i4mygv6", "is_submitter": "False", "link_id": "t3_u2u45m", "parent_id": "t1_i4mhwle", "score": "19", "subreddit": "LearnJapanese", "subreddit_id": "t5_2qyls"}, {"author": "ImDuckDamnYou", "body": "Currently reading Harry Potter. That first chapter is just so hard to power through. I'm a few chapters in now and it's a lot easier to read. \n\nI think the first chapter of every book you read though will be a bit of a slog though since there isn't much dialogue, and it's all flowery language explaining the scenes and world. I've heard that world building is what makes the books hard to start.", "created_utc": "1649874544.0", "edited": "False", "id": "i4ljqbl", "is_submitter": "False", "link_id": "t3_u2u45m", "parent_id": "t1_i4l5mq5", "score": "40", "subreddit": "LearnJapanese", "subreddit_id": "t5_2qyls"}, {"author": "ImDuckDamnYou", "body": "I think we'd need to collaborate with r/australia to do that.", "created_utc": "1648960916.0", "edited": "False", "id": "i36rhso", "is_submitter": "False", "link_id": "t3_tv0584", "parent_id": "t3_tv0584", "score": "4", "subreddit": "hobart", "subreddit_id": "t5_2rjvn"}, {"author": "ImDuckDamnYou", "body": "Leave wikipedia out of it, they can barely pay for the upkeep of their website as it is :(", "created_utc": "1648767634.0", "edited": "False", "id": "i2wuh2j", "is_submitter": "False", "link_id": "t3_tt830f", "parent_id": "t3_tt830f", "score": "1", "subreddit": "worldnews", "subreddit_id": "t5_2qh13"}, {"author": "ImDuckDamnYou", "body": "Was this a problem in Tasmania before the passenger trains went out of service too?", "created_utc": "1648034740.0", "edited": "False", "id": "i1s5bpr", "is_submitter": "False", "link_id": "t3_tkf8kk", "parent_id": "t1_i1qsbnk", "score": "1", "subreddit": "hobart", "subreddit_id": "t5_2rjvn"}, {"author": "ImDuckDamnYou", "body": "No, CN was a bit complicated when it was originally happened. At first they said they would be able to graduate with the characters and models to go independent, but later explained the situation had changed and that was no longer the case. None of the characters that originated from Hololive CN are currently or ever will be active again.", "created_utc": "1645709002.0", "edited": "False", "id": "hy8kf7x", "is_submitter": "False", "link_id": "t3_t03p7x", "parent_id": "t1_hy8ilcn", "score": "74", "subreddit": "Hololive", "subreddit_id": "t5_29numb"}, {"author": "ImDuckDamnYou", "body": "Not much, I kind of stopped using it when they started disguising ads as posts. All it would take is an evolution of that.", "created_utc": "1638372440.0", "edited": "False", "id": "hmszrxa", "is_submitter": "False", "link_id": "t3_r69tbl", "parent_id": "t3_r69tbl", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "ImDuckDamnYou", "body": "He wasn't confirmed positive until after he was caught. They had him take a test after. So before he was just in regular isolation like any other traveller.", "created_utc": "1634186569.0", "edited": "False", "id": "hgkqq6c", "is_submitter": "False", "link_id": "t3_q741mb", "parent_id": "t1_hggjhu2", "score": "4", "subreddit": "hobart", "subreddit_id": "t5_2rjvn"}, {"author": "ImDuckDamnYou", "body": "Is he rich compared to other state alchemists...?\n\nI mean Shou Tucker lived in a massive mansion in the suburbs.\n\nI think state alchemists are probably compensated quite nicely for their time since they are specialists. Sheska and Lieutenant Ross are both regular personnel and are most likely paid way less than Ed.", "created_utc": "1628543814.0", "edited": "False", "id": "h8c0wpr", "is_submitter": "False", "link_id": "t3_p0wo5y", "parent_id": "t3_p0wo5y", "score": "5", "subreddit": "FullmetalAlchemist", "subreddit_id": "t5_2t27s"}, {"author": "ImDuckDamnYou", "body": "Gender reveal parties by themselves are fine I think\n\nBut it's this constant one upping that people do, wanting to make an even more clickbaity gender reveal for more likes on instagram. It's this trend that has gotten us to this point in society.", "created_utc": "1626913212.0", "edited": "False", "id": "h62i4vn", "is_submitter": "False", "link_id": "t3_oop79v", "parent_id": "t1_h62fx10", "score": "1", "subreddit": "JusticeServed", "subreddit_id": "t5_2vxxc"}, {"author": "ImDuckDamnYou", "body": "Interesting how much peoples opinion on here  has changed. I remember several years ago I was down voted because I said didn't want the cable car.", "created_utc": "1626778787.0", "edited": "False", "id": "h5v0x5d", "is_submitter": "False", "link_id": "t3_ont9ii", "parent_id": "t3_ont9ii", "score": "1", "subreddit": "hobart", "subreddit_id": "t5_2rjvn"}, {"author": "ImDuckDamnYou", "body": "Bad but I had a lot of fun watching it with a friend when it came out.", "created_utc": "1626080706.0", "edited": "False", "id": "h4wgua5", "is_submitter": "False", "link_id": "t3_oibq6d", "parent_id": "t3_oibq6d", "score": "7", "subreddit": "FullmetalAlchemist", "subreddit_id": "t5_2t27s"}, {"author": "ImDuckDamnYou", "body": "Shin Megami tensei", "created_utc": "1625757241.0", "edited": "False", "id": "h4hcd3a", "is_submitter": "False", "link_id": "t3_og253s", "parent_id": "t1_h4h5xvc", "score": "19", "subreddit": "yakuzagames", "subreddit_id": "t5_2xx8w"}, {"author": "ImDuckDamnYou", "body": "I'm not sure if it's necessarily something fma related. It's just been marketed as \"hey fma author is doing some stuff stay tuned\" \n\nI worry there will be backlash if it isn't actually fma related. That being said I certainly hope it's fma related but I'm keeping my expectations low.", "created_utc": "1624926013.0", "edited": "False", "id": "h3dugc8", "is_submitter": "False", "link_id": "t3_o7u2v6", "parent_id": "t1_h3117v2", "score": "1", "subreddit": "FullmetalAlchemist", "subreddit_id": "t5_2t27s"}, {"author": "ImDuckDamnYou", "body": "First thing that comes to mind if that the checkpoints need to be touched up. I'm playing through Jak II at the moment and while I do remember it being worse when I was younger there are certainly times when the checkpoints are brutal.\n\nAs another thought, camera controls need to have an option on whether they are inverted and or not. I keep looking left when I'm trying to look right, and vice versa. Very annoying.", "created_utc": "1624789956.0", "edited": "False", "id": "h376oat", "is_submitter": "False", "link_id": "t3_o8ss2u", "parent_id": "t3_o8ss2u", "score": "1", "subreddit": "jakanddaxter", "subreddit_id": "t5_2t4tn"}, {"author": "ImDuckDamnYou", "body": "Can't believe you stole his ps5", "created_utc": "1624469940.0", "edited": "False", "id": "h2shysg", "is_submitter": "False", "link_id": "t3_o6bum3", "parent_id": "t3_o6bum3", "score": "10", "subreddit": "jakanddaxter", "subreddit_id": "t5_2t4tn"}, {"author": "ImDuckDamnYou", "body": "and here I am playing through Jak 2 on PS2 like a chump.\n\nHeaven knows I have a PS5 for status, not to game on it", "created_utc": "1623825302.0", "edited": "False", "id": "h1xwbp2", "is_submitter": "False", "link_id": "t3_o0sagy", "parent_id": "t3_o0sagy", "score": "16", "subreddit": "jakanddaxter", "subreddit_id": "t5_2t4tn"}, {"author": "ImDuckDamnYou", "body": "The models definitely look unfinished but they aren't really meant to be viewed up close I guess.\n\nLike the hair isn't really textured and is only coloured yellow with no green. Daxter is a mess. But it makes you wonder why did someone go to the effort of making this brand new model of the two while sly didn't get the same treatment.", "created_utc": "1623540610.0", "edited": "False", "id": "h1ken4t", "is_submitter": "False", "link_id": "t3_nyi9pt", "parent_id": "t3_nyi9pt", "score": "46", "subreddit": "jakanddaxter", "subreddit_id": "t5_2t4tn"}, {"author": "ImDuckDamnYou", "body": "Something I was kind of taught learning Japanese is if you get \"nihongo jouzu\"d then it means that it's somewhat obvious that you're not fluent but you are trying your best. If a Japanese person doesn't say that to you then you have really succeeded in learning the language.\n\nI don't know how true that is though.\n\nI wonder if Kiara or Coco got the good ol' \"nihongo jouzu\" treatment too?", "created_utc": "1622636425.0", "edited": "False", "id": "h0b097k", "is_submitter": "False", "link_id": "t3_nqcy47", "parent_id": "t3_nqcy47", "score": "8", "subreddit": "Hololive", "subreddit_id": "t5_29numb"}, {"author": "ImDuckDamnYou", "body": "I did manage to climb up to plat but then I got dragged back down to silver after I stopped playing comp for a few months", "created_utc": "1617780119.0", "edited": "False", "id": "gtnwpro", "is_submitter": "False", "link_id": "t3_mlj1x9", "parent_id": "t1_gtnhv32", "score": "2", "subreddit": "Overwatch", "subreddit_id": "t5_2u5kl"}, {"author": "ImDuckDamnYou", "body": "I think I fell asleep for a while... did something happen?", "created_utc": "1613211971.0", "edited": "False", "id": "gn6j5o2", "is_submitter": "False", "link_id": "t3_lguqx1", "parent_id": "t1_gn6crro", "score": "1", "subreddit": "thanosdidnothingwrong", "subreddit_id": "t5_gxikd"}]