[{"author": "JaevligFaen", "body": "Anime on desporto sapo? How strange.\n\nThanks! It's a shame it was taken down. I wish we could download these things while they're available for streaming before they disappear forever.", "created_utc": "1666881393.0", "edited": "False", "id": "itzs8gp", "is_submitter": "False", "link_id": "t3_ydz78y", "parent_id": "t1_itzk39p", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "JaevligFaen", "body": "z-lib.org", "created_utc": "1666876093.0", "edited": "False", "id": "itzfzsv", "is_submitter": "False", "link_id": "t3_yep2fc", "parent_id": "t3_yep2fc", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "JaevligFaen", "body": "> And it’s SO hard to find a language app/class that is European and not Brazilian\n\nHe knows the struggle", "created_utc": "1666875840.0", "edited": "False", "id": "itzfgnu", "is_submitter": "False", "link_id": "t3_yeg8dx", "parent_id": "t1_itz05ni", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "JaevligFaen", "body": "This is amazing. Where can I find these shows in EU Portuguese?", "created_utc": "1666875810.0", "edited": "False", "id": "itzfeec", "is_submitter": "False", "link_id": "t3_ydz78y", "parent_id": "t1_itw04w9", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "JaevligFaen", "body": "Hard to recommend what to do without knowing your (estimated) level in the TL", "created_utc": "1666802545.0", "edited": "False", "id": "itvhyh4", "is_submitter": "False", "link_id": "t3_ydm12l", "parent_id": "t3_ydm12l", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "JaevligFaen", "body": "Traditional study *then* reading extensively *then* listening extensively *then* conversing extensively", "created_utc": "1666796291.0", "edited": "False", "id": "itv24wf", "is_submitter": "False", "link_id": "t3_yduk17", "parent_id": "t3_yduk17", "score": "4", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "JaevligFaen", "body": "That's true body language also probably helps a lot!", "created_utc": "1666777379.0", "edited": "False", "id": "itu3p06", "is_submitter": "False", "link_id": "t3_ycu032", "parent_id": "t1_itsheeu", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "JaevligFaen", "body": "I don't doubt you've witnessed that, but I do have doubts about the effectiveness of the \"speak early\" approach. \n\nThe times I tried this usually resulted in very awkward interactions. I think without a solid history of reading/listening to a language, you're forced to make a lot of assumptions on how things are said, which are very often wrong. I have an example from my own experience: I didn't know how to say \"make sure\" so I made a quick assumption and directly translated the words \"be sure\" into the language I was speaking. Even though I changed the phrase into a form I assumed would make sense, the person I was speaking with still didn't understand what I meant, because basically it was wrong.\n\nThen there is the issue of comprehension, which I'd argue is the most important aspect of all. You can't have a conversation if you can't understand the person you're speaking with. You might be able to convey a message using only words you know, but the response will contain whatever collection of words the speaker wants to use regardless of which words you're familiar with.\n\nSo for these reasons, and due to the nature of my own goals, I focus exclusively on input. My only goal in regards to output is being able to speak well enough that people don't immediately switch to English for me.", "created_utc": "1666712474.0", "edited": "False", "id": "itqgwrb", "is_submitter": "False", "link_id": "t3_yd3qhv", "parent_id": "t3_yd3qhv", "score": "8", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "JaevligFaen", "body": "This is the current set of stages that I've noticed seem right after years of learning the wrong way. I'm still trying it out myself though, so it's just ideas so far. Also this is with European languages in mind. It will absolutely be a more complicated process for languages with alternative writing systems or very different grammar.\n\nFundamentals: The stuff you learn from textbooks or apps, first 1000 common words, some basic grammar. (Optionally, you could try some ambient listening without worrying about understanding any of it, just to get a feel for how the language sounds)\n\nReading: (The longest stage) If you're learning a popular language you'll be able to find graded readers and gradually scale up to novels. If you're learning a less popular language you might have to start with novels and just slowly work through them. Put new words or phrases in anki (or any SRS) until you get pretty comfortable reading, then scale down your use of SRS and just read for enjoyment. The reason I put this before listening is because I think not having to worry about the accent or speed simplifies the process.\n\nListening: Podcasts, TV, movies, etc. I prefer to know a lot of vocabulary before worrying about this because gaps in vocabulary knowledge while listening can make it feel like the accent is too hard (or people speak too fast) when really you just need to know more words and phrases. \n\nOutput: Writing/speaking. If you want to be more eloquent in your target language, it makes sense to practice a lot of writing and speaking at this point. I don't stress about it personally, my goals are much more targeted towards comprehension.\n\n> But what about speaking early?\n\nAt least for me, speaking early doesn't make sense at all. Like trying to learn how to draw without looking at any references. In training, our brains require examples to reference later. Whenever I've tried speaking a language before reading enough, I always end up directly translating phrases like \"make sure\" which won't make sense. But when you've read (or heard) the correct phrase enough times, you'll remember the correct phrase before even thinking of how to translate it directly.", "created_utc": "1666699689.0", "edited": "False", "id": "itpo1qv", "is_submitter": "False", "link_id": "t3_ycu032", "parent_id": "t3_ycu032", "score": "5", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "JaevligFaen", "body": "Obrigado! Portugal é um país cheio de pessoas amáveis que me faz sentir bem-vindo, então quero trabalhar duro para atingir um nível alto na lingua deles.\n\nNa mesma linha, há muitos viajantes no mundo que falam português como lingua materna, sendo de Portugal ou Brasil, então acho que é muito útil saber português.", "created_utc": "1666694301.0", "edited": "False", "id": "itpfom1", "is_submitter": "False", "link_id": "t3_yccwb1", "parent_id": "t1_itp87ue", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "JaevligFaen", "body": "Definitely. I actually began with Spanish over 10 years ago when I was in high school. Even though I never reached a high level, the fundamentals helped immensely with Portuguese. I'm confident that some day I'll reach a high level in both.", "created_utc": "1666693301.0", "edited": "False", "id": "itped9y", "is_submitter": "False", "link_id": "t3_yccwb1", "parent_id": "t1_itmyj0n", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "JaevligFaen", "body": "You would not have survived the gulags", "created_utc": "1666685908.0", "edited": "False", "id": "itp5puk", "is_submitter": "False", "link_id": "t3_ycb6hp", "parent_id": "t1_itnet5w", "score": "2", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "JaevligFaen", "body": "Wow thanks! Seems like my kind of book as well.\n\nAlso I found \"O Mistério da Estrada de Sintra\" on audible, which is definitely PT-PT as well. Might try making a torrent for the mp3 if I can extract it.", "created_utc": "1666644508.0", "edited": "False", "id": "itmylxf", "is_submitter": "False", "link_id": "t3_y5h36f", "parent_id": "t1_itmkvah", "score": "1", "subreddit": "Portuguese", "subreddit_id": "t5_2sqn7"}, {"author": "JaevligFaen", "body": "Realistic: Portuguese, maybe French some day.\n\nPipe-dream: All major Romance languages, German (including Swiss German), the 3 Scandinavian languages, and Japanese.", "created_utc": "1666632551.0", "edited": "False", "id": "itm3is8", "is_submitter": "False", "link_id": "t3_yccwb1", "parent_id": "t3_yccwb1", "score": "6", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "JaevligFaen", "body": "Here's a harsh reality for you: People vote for socialist policies and then blame the ramifications on capitalism.", "created_utc": "1666632013.0", "edited": "False", "id": "itm245r", "is_submitter": "False", "link_id": "t3_ycb6hp", "parent_id": "t1_itm0bcu", "score": "-27", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "JaevligFaen", "body": "Yeah that's my point", "created_utc": "1666631935.0", "edited": "False", "id": "itm1wyc", "is_submitter": "False", "link_id": "t3_ycb6hp", "parent_id": "t1_itlzmcj", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "JaevligFaen", "body": "Imagine living during the black plague. Or through the hundreds of wars throughout the middle ages. I'm sure nobody had a particularly optimistic outlook on the future of humanity back then either.", "created_utc": "1666630709.0", "edited": "False", "id": "itlyqk4", "is_submitter": "False", "link_id": "t3_ycb6hp", "parent_id": "t1_itlqvzo", "score": "0", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "JaevligFaen", "body": "> He typed on his Macbook while sipping his Starbucks latte", "created_utc": "1666628747.0", "edited": "False", "id": "itltop3", "is_submitter": "False", "link_id": "t3_ycb6hp", "parent_id": "t1_itl843e", "score": "155", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "JaevligFaen", "body": "People love to say beauty is all on the inside, because it sounds nice.\n\nBut looks matter a lot. It's especially unfortunate since the most important things in life are dependent on it.", "created_utc": "1666627610.0", "edited": "False", "id": "itlqtnh", "is_submitter": "False", "link_id": "t3_ycb6hp", "parent_id": "t3_ycb6hp", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "JaevligFaen", "body": "Land ownership.\n\nI'm sure this is something that varies from country to country, but so far from what I've seen, I think the best value land is in the US. In other countries where I've looked, you have a variety of issues:\n\n* Higher prices, lower quality\n\n* Public roads run through the middle of the property\n\n* Abandoned/deteriorating structures require permits to demolish, new permits to build new structures\n\n* Laws that don't respect your right to the property\n\n* Laws that allow anyone to use your land\n\nI'm hoping there are other countries out there without these issues, but from what I've seen the US is the best country for someone who wants to live in the countryside and have actual ownership over some land", "created_utc": "1666616634.0", "edited": "False", "id": "itl1bbi", "is_submitter": "False", "link_id": "t3_ybqslg", "parent_id": "t3_ybqslg", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "JaevligFaen", "body": "I think it depends at what age you're cut off from it.\n\nI've heard plenty of stories from people who grew up speaking Spanish until the age of 5 or so, moved to the US with their family, and English became their true native language as they never fully \"learned\" Spanish.\n\nWould definitely be interested to hear how this would affect someone at an older age though. Like a 20 year old who became permanently cut off from his native language, would he forget it? I wonder as well.", "created_utc": "1666613765.0", "edited": "False", "id": "itkvw1k", "is_submitter": "False", "link_id": "t3_yc8m28", "parent_id": "t3_yc8m28", "score": "29", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "JaevligFaen", "body": "I'd say yes to this actually. If that's what you want to do.\n\nExample: Portuguese has loads of content but most of it is from Brazil, which has a very different accent. For me to practice listening to the Portugal accent, I need lots of podcasts, or video content. Everything I've managed to find is from within the past 10 years. So if I had started 10 years ago, I imagine it would've been a lot harder. Or at the very least, I would've been forced to listen/watch content I'm not interested in. \n\nThere was a time some years ago when I was learning Norwegian. I've put it on hold now, and honestly I've had the same line of thought as you, hoping when I pick it up again in the distant future that I'll be pleasantly surprised with a lot more content. I believe even in the 3 or so years I've had Norwegian on hold, there are been some comprehensible input youtube channels made, so that's already a good sign.", "created_utc": "1666610986.0", "edited": "False", "id": "itkrbiv", "is_submitter": "False", "link_id": "t3_ybyhq4", "parent_id": "t3_ybyhq4", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "JaevligFaen", "body": "I wish I knew the difference between learning the fundamentals of the language and actually practicing it.\n\nMore specifically what I would tell myself is, first of all, don't rely on academia in the US or expect it to lead me to fluency. They teach the fundamentals well enough, but beyond that it's severely lacking. The way I'd approach it instead is, after learning the fundamentals, just focus on reading interesting content in the language and picking up vocabulary. After doing that for a few years, then I'd get to the fun stuff, listening to podcasts, watching movies/tv, video games, etc. \n\nAs for the top resources, my number 1 is always z-lib.org. There are all kinds of novels of course, but in addition there are even language textbooks for learning the fundamentals.", "created_utc": "1666609605.0", "edited": "False", "id": "itkpb2g", "is_submitter": "False", "link_id": "t3_yc0x4p", "parent_id": "t3_yc0x4p", "score": "14", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "JaevligFaen", "body": "Look into the *why*. For example, why do you want to learn Dutch or German when basically everyone in those countries speaks English already? Do you plan to spend an extended period of time in Ukraine? Do you really like French movies and tv? What do you see yourself *doing* with fluency in any of these languages? Is that thing worth it when you know reaching that level will take thousands of hours of dedication?", "created_utc": "1666607503.0", "edited": "False", "id": "itkmgzf", "is_submitter": "False", "link_id": "t3_yc29xo", "parent_id": "t3_yc29xo", "score": "4", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "JaevligFaen", "body": "Been asking myself this question for years. I think the answer is just more exposure.\n\nI did a little experiment watching a Scottish show with some strong accents, and I noticed my comprehension of the accent skyrocket over the course of just a few days. But I already know English vocabulary quite extensively, so that element isn't a problem for me. \n\nAs for Portuguese, my focus for now is reading and picking up vocabulary. But after I'm more familiar with the vocabulary, I intend on doing the same thing and \"tuning my ear\" to the accents using whatever material I can get my hands on. The accent in Portugal is much more difficult (in my opinion) than the accent in Brazil, and unfortunately it's also harder to find content for. But I guess with enough exposure your mind just automatically picks up the accent.", "created_utc": "1666555438.0", "edited": "False", "id": "ithzyij", "is_submitter": "False", "link_id": "t3_ybgkpb", "parent_id": "t3_ybgkpb", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "JaevligFaen", "body": "z-lib.org is my favorite.", "created_utc": "1666553870.0", "edited": "False", "id": "ithvpnz", "is_submitter": "False", "link_id": "t3_yblxgw", "parent_id": "t3_yblxgw", "score": "15", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "JaevligFaen", "body": "Fair point. All I'll say to this is that I think it probably depends a lot on which particular languages are involved. Germanic languages for example are similar enough in nature that I doubt it would be a significant issue. An English novel translated into Chinese on the other hand, I can see how that can raise concerns.", "created_utc": "1666529375.0", "edited": "False", "id": "itg9g2e", "is_submitter": "True", "link_id": "t3_yanlj6", "parent_id": "t1_iteg9q6", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "JaevligFaen", "body": "To be honest, I can't really think of an instance where I've experienced what you're describing.", "created_utc": "1666528731.0", "edited": "False", "id": "itg8cd3", "is_submitter": "True", "link_id": "t3_yanlj6", "parent_id": "t1_itdrznt", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "JaevligFaen", "body": "We all have different goals. I agree that it's great to dive into a culture, but I still just find it hard to reason that the origin of the content makes any a difference for the actual process of learning the language. As long as the translation is well done, that is.", "created_utc": "1666528652.0", "edited": "False", "id": "itg87im", "is_submitter": "True", "link_id": "t3_yanlj6", "parent_id": "t1_itcm12m", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "JaevligFaen", "body": "This argument makes sense if the goal is to understand the text you're reading as deeply as possible, or if the goal is to obtain a deep understanding of the culture of a particular country. But what if your goal is to just be fluent in the language? And by fluent, I just mean able to sit down in a cafe with a friend and have a basic conversation without struggle.", "created_utc": "1666528331.0", "edited": "False", "id": "itg7nwx", "is_submitter": "True", "link_id": "t3_yanlj6", "parent_id": "t1_itcm4a7", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "JaevligFaen", "body": "> BTW, it's much better picking up books whose ORIGINAL LANGUAGE is your TL! Either graded reads (abridged/simplified versions) or actual novels/books that are expression of the national language/culture, and not the translation of something foreign.\n\nKind of a different topic but I'd like to discuss that because I've heard people say this before, but without explaining why. So... why? Isn't a language just a collection of words and phrases used to convey meaning? How does the origin of the content make a difference?", "created_utc": "1666456903.0", "edited": "False", "id": "itckvb2", "is_submitter": "True", "link_id": "t3_yanlj6", "parent_id": "t1_itcf24p", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "JaevligFaen", "body": "I actually haven't heard of this \"Lexile level\" thing before. But yeah, the only graded reader I tried in Portuguese was too easy and also dull as content gets. I'm definitely in that \"murky\" area you describe! Thanks for the suggestions!", "created_utc": "1666456228.0", "edited": "False", "id": "itcj90q", "is_submitter": "True", "link_id": "t3_yanlj6", "parent_id": "t1_itc7sa2", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "JaevligFaen", "body": "Hunger Games books are definitely available in Portuguese, I remember coming across them at some point. Good suggestion!", "created_utc": "1666451566.0", "edited": "False", "id": "itc8bm3", "is_submitter": "True", "link_id": "t3_yanlj6", "parent_id": "t1_itbzt26", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "JaevligFaen", "body": "Yeah, the availability is another reason I'm tempted to try it. But if the difficulty isn't much lower, I figure I might as well stick to what I'm reading for now.", "created_utc": "1666451452.0", "edited": "False", "id": "itc829f", "is_submitter": "True", "link_id": "t3_yanlj6", "parent_id": "t1_itbv6rw", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "JaevligFaen", "body": "Nice I read Goosebumps as a kid too! Did a quick search on z-lib and found them in Portuguese, nice suggestion.", "created_utc": "1666451320.0", "edited": "False", "id": "itc7rpl", "is_submitter": "True", "link_id": "t3_yanlj6", "parent_id": "t1_itbzn5h", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "JaevligFaen", "body": "I agree with your opinion. It seems to me like diminishing returns. At a beginner level it's beneficial, but once you get around an intermediate level it's no longer very useful. Of course any language app would love for you to continue with it for as long as possible, so they never inform you when you should just start reading books in Spanish.", "created_utc": "1666112980.0", "edited": "False", "id": "istq8ax", "is_submitter": "False", "link_id": "t3_y79ck2", "parent_id": "t3_y79ck2", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "JaevligFaen", "body": "Man, I'd be happy finding *any* audiobook in PT-PT.", "created_utc": "1666037367.0", "edited": "False", "id": "ispseet", "is_submitter": "False", "link_id": "t3_y5h36f", "parent_id": "t3_y5h36f", "score": "2", "subreddit": "Portuguese", "subreddit_id": "t5_2sqn7"}, {"author": "JaevligFaen", "body": "That hair could only be CGI", "created_utc": "1665989600.0", "edited": "False", "id": "isna38e", "is_submitter": "False", "link_id": "t3_y5wxnn", "parent_id": "t1_ism86w3", "score": "8", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "JaevligFaen", "body": "I think a lot of people who believe this are suffering from internet addiction. If you go out into the real world and talk to real people, very few have this sort of \"with enough money and surgery, you can be anything/anyone you want\" mentality.", "created_utc": "1665989073.0", "edited": "False", "id": "isn9g1i", "is_submitter": "False", "link_id": "t3_y5wxnn", "parent_id": "t1_ismc5xv", "score": "5", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "JaevligFaen", "body": "Would you call a plastic surgery that gives someone a younger appearance an \"age-change operation\"?", "created_utc": "1665989048.0", "edited": "False", "id": "isn9ey3", "is_submitter": "False", "link_id": "t3_y5wxnn", "parent_id": "t1_isn1183", "score": "16", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "JaevligFaen", "body": "All of them. I wake up at 5am to immediately begin Spanish, and fall asleep at 3am after grinding Haitian Creole and Klingon at the same time.", "created_utc": "1665926238.0", "edited": "False", "id": "isjf06x", "is_submitter": "False", "link_id": "t3_y5fyrd", "parent_id": "t3_y5fyrd", "score": "20", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "JaevligFaen", "body": "Icelandic is barely changed from the old viking language \"old norse\"\n\nApparently Icelandic speakers can even read the old viking manuscripts", "created_utc": "1665826159.0", "edited": "False", "id": "isec4v5", "is_submitter": "False", "link_id": "t3_y3zngh", "parent_id": "t1_isbm9n4", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "JaevligFaen", "body": "My middle school actually offered Spanish and French, taught by the same teacher. But it was optional. High school required 2 years of either Spanish or French, and offered a 3rd year option. And if I remember right, maybe even a 4th year option. So if I had known earlier that this was my thing, I could have taken 6 years of a foreign language before graduating high school. Most people only take the 2 required years, and subsequently forget everything.", "created_utc": "1665645840.0", "edited": "False", "id": "is4m9l2", "is_submitter": "False", "link_id": "t3_y2ez6h", "parent_id": "t3_y2ez6h", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "JaevligFaen", "body": "How many books did you have to read to reach that point? Any idea of how many pages you've read?", "created_utc": "1665644878.0", "edited": "False", "id": "is4l3xm", "is_submitter": "False", "link_id": "t3_y2l874", "parent_id": "t3_y2l874", "score": "16", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "JaevligFaen", "body": "Well to be honest, poetry isn't really my cup of tea. I've shared my experience on here before, but basically I took a lot of college Spanish classes, and they force you to read ancient literature and poetry. For me it just made the class an absolute chore, and demotivated me from language learning entirely. I'm sure you agree the content needs to be interesting to you personally to keep you engaged in reading.\n\nActually I've always been a picky reader, even when I was a kid. But looking for books exclusively in Portuguese from Portugal has been surprisingly fun, I've easily spent hours combing through z-lib.org, and I've found a good collection of books I'm excited to read. By the way, do you read multiple novels at a time, or do you prefer to focus exclusively on one and finish it before starting the next?", "created_utc": "1665558273.0", "edited": "False", "id": "irzrydm", "is_submitter": "False", "link_id": "t3_xy96mo", "parent_id": "t1_irt03wa", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "JaevligFaen", "body": "It wasn't Portugal, once upon a time I was learning a different language and living in a different country in Europe. \n\nI really made every effort to use the language with everyone. Hotel reception, restaurants, grocery stores, everywhere I went. The problem in my opinion, was that my level wasn't high enough yet. There would be lots of times where I make mistakes or don't understand someone, and I'd really beat myself up over it. After that experience, I know now that conversing with native speakers is a high-level activity. Which is done after lots of low/medium-level activities, such as reading and listening.", "created_utc": "1665384870.0", "edited": "False", "id": "irqfy7j", "is_submitter": "False", "link_id": "t3_y02zo8", "parent_id": "t3_y02zo8", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "JaevligFaen", "body": "Loretta Stone hands down. Once you know how to say magazine and scarf in a language, you're practically fluent.", "created_utc": "1665354663.0", "edited": "False", "id": "iroxegu", "is_submitter": "False", "link_id": "t3_xzwphz", "parent_id": "t3_xzwphz", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "JaevligFaen", "body": "I thought this post was going to be about the numerous dubbed languages available for this show. (Even separate varieties of Portuguese! Woo!)", "created_utc": "1665354539.0", "edited": "False", "id": "irox4vu", "is_submitter": "False", "link_id": "t3_xz8f3p", "parent_id": "t3_xz8f3p", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "JaevligFaen", "body": "What is AJATT?", "created_utc": "1665353836.0", "edited": "False", "id": "irovlva", "is_submitter": "False", "link_id": "t3_xzmzw8", "parent_id": "t1_irn2grp", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "JaevligFaen", "body": "I call it \"B1 hell\"", "created_utc": "1665353729.0", "edited": "False", "id": "irovdm0", "is_submitter": "False", "link_id": "t3_xzq91n", "parent_id": "t1_iroh7hw", "score": "21", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "JaevligFaen", "body": "Wish I could inform myself on how to actually learn. I was misguided by the typical advice.", "created_utc": "1665347993.0", "edited": "False", "id": "iroi6ua", "is_submitter": "False", "link_id": "t3_xzmzw8", "parent_id": "t3_xzmzw8", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "JaevligFaen", "body": "Lol yeah I'll put this one under \"things that definitely happened without any doubt\"\n\nI swear this site is full of the most gullible people of the world", "created_utc": "1665346991.0", "edited": "False", "id": "irofr6g", "is_submitter": "False", "link_id": "t3_xzp5d5", "parent_id": "t3_xzp5d5", "score": "1", "subreddit": "pics", "subreddit_id": "t5_2qh0u"}, {"author": "JaevligFaen", "body": "It's nice to see an update from you. I really liked your original post. I had planned to read a lot in order to learn, but the way you quantified it into page counts and explained the difficulty at each level really motivated me to focus a lot more on just reading. I know you said you don't use an e-reader but I ended up buying one and it's been really fun trying to find e-books in Portuguese.", "created_utc": "1665302493.0", "edited": "False", "id": "irm0ade", "is_submitter": "False", "link_id": "t3_xy96mo", "parent_id": "t3_xy96mo", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "JaevligFaen", "body": "The tone of the sentence is often really good context to get the meaning of words. When I'm reading with no audio, a lot of the time I have to change the tone I'm imagining in my head in order for the sentence to make sense.", "created_utc": "1665133294.0", "edited": "False", "id": "irdvd4q", "is_submitter": "False", "link_id": "t3_xx0ude", "parent_id": "t1_ir9k49j", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "JaevligFaen", "body": "For me it was not trying to sprint before you know how to crawl. \n\nFirst time I tried living in a foreign country and learning the language, I made a huge effort to speak with locals in their language all the time. It resulted in lots of embarrassing moments and frustration.\n\nNow my approach is to focus on reading first, once reading comes really easy (I'm almost there now), I will start to practice listening. Once my listening comprehension is good, only then will I begin to practice real conversations with locals.", "created_utc": "1665133162.0", "edited": "False", "id": "irdv8hy", "is_submitter": "False", "link_id": "t3_xx0ude", "parent_id": "t3_xx0ude", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "JaevligFaen", "body": "Japanese, Chinese, Korean, Arabic, and Russian. Some of the hardest languages for an English speaker to learn. Then I'd just go on with what I'm already learning.", "created_utc": "1665039627.0", "edited": "False", "id": "ir94foj", "is_submitter": "False", "link_id": "t3_xwszc1", "parent_id": "t3_xwszc1", "score": "29", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "JaevligFaen", "body": "z-lib.org is what I recommend for anyone B1 and above", "created_utc": "1664956185.0", "edited": "False", "id": "ir4hvcw", "is_submitter": "False", "link_id": "t3_xvvwvf", "parent_id": "t3_xvvwvf", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "JaevligFaen", "body": "That's true, actually being active and walking around while working is something I miss a lot from jobs I've had in the past. Glad you enjoy it!", "created_utc": "1664913234.0", "edited": "False", "id": "ir25k1z", "is_submitter": "False", "link_id": "t3_xue3x9", "parent_id": "t1_ir1hpwm", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "JaevligFaen", "body": "Living in a trendy expat-nomad type of city means it's easy to get sucked into an English-speaking bubble, and difficult to make friends who grew up there. That's the frustrating part for me. \n\nStill I've met some fantastic people from all around the world, so I'm happy about that. But I'm not sure what to do or where I should go in order to make friends who are natives.", "created_utc": "1664901360.0", "edited": "False", "id": "ir19ura", "is_submitter": "False", "link_id": "t3_xvbdjl", "parent_id": "t3_xvbdjl", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "JaevligFaen", "body": "No I can't, sounds brutal. Not the part about being in Italy, but the air travel every week part. Can't express my appreciation for you guys enough.", "created_utc": "1664832186.0", "edited": "False", "id": "iqxpxh5", "is_submitter": "False", "link_id": "t3_xue3x9", "parent_id": "t1_iqw4bwm", "score": "21", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "JaevligFaen", "body": "Befriend my neighbors", "created_utc": "1664831934.0", "edited": "False", "id": "iqxpay8", "is_submitter": "False", "link_id": "t3_xue3x9", "parent_id": "t3_xue3x9", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "JaevligFaen", "body": "I refuse to be a *super-trendy* *digital-nomad* *expat* living in Portugal, at least not without making an effort to understand the members of the community in which I've found myself. Actually, most people who move here do make an effort, but not a very substantial one. There is a quickly growing resentment against those of us who moved here, many blame the rising cost of living and other problems on us. And on top of that, the \"expat-bubble\" is very real here, it's pretty uncommon to meet a Portuguese person in those circles. \n\nThere's an argument to be made that I'm letting the opinions of others have too much of an impact on me, but I'd say so far even with the limited skills I have in Portuguese, it's made my experience better. I mean I guess learning a language will always do that. Maybe I just hope to separate myself from the rest as someone who appreciates being given the opportunity to experience living here long-term.", "created_utc": "1664742384.0", "edited": "False", "id": "iqspdjy", "is_submitter": "False", "link_id": "t3_xtwkmi", "parent_id": "t3_xtwkmi", "score": "9", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "JaevligFaen", "body": "I've always been jealous of Europeans who learned English just from enjoying the same content I've consumed, such as movies and shows from Hollywood or video games from the US or Japan. Now I realize a gigantic amount of that stuff is available in French and German, and that has me excited to try learning one of those languages.", "created_utc": "1664740019.0", "edited": "False", "id": "iqsiv7j", "is_submitter": "False", "link_id": "t3_xtu4eo", "parent_id": "t3_xtu4eo", "score": "60", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "JaevligFaen", "body": "I voted 4, but that doesn't include languages that are so similar they're basically intelligible.", "created_utc": "1664738182.0", "edited": "False", "id": "iqsds1i", "is_submitter": "False", "link_id": "t3_xtpozd", "parent_id": "t3_xtpozd", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "JaevligFaen", "body": "In order to break the \"language barrier\" it's all vocabulary. Even grammar is less relevant, you can say ME HUNGRY WHERE RESTAURANT AT and you'll still be understood. \n\nBUT I think listening comprehension is important, and I've come to realize that just knowing the words often isn't enough. The accent of another language (or even an accent in your native language) can be really hard to get your ear used to. So to that extent, I agree, there should be a lot more focus on accent.", "created_utc": "1664731114.0", "edited": "False", "id": "iqrufmz", "is_submitter": "False", "link_id": "t3_xtpbuy", "parent_id": "t3_xtpbuy", "score": "7", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "JaevligFaen", "body": "I only really look for RPGs. Most other games probably won't have enough dialogue to make it worth the time (unless you were gonna play that game anyway, might as well do it in your TL)\n\nThe \"Tales of\" series has a good amount of dialogue. Tales of Vesperia has enough words it could be considered the size of two novels.", "created_utc": "1664704583.0", "edited": "False", "id": "iqqd7nn", "is_submitter": "False", "link_id": "t3_xt0djr", "parent_id": "t3_xt0djr", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "JaevligFaen", "body": "> As far as I know the difference in written language is basically the same as you'd see between UK and US English.\n\nThis is false. The differences between these two varieties of Portuguese are significant. [Here's a list of words that are different, and this is just vocabulary, there are also many grammar differences, and the accent is completely different as well.](https://www.queroirla.com.br/dicionario-portugues-brasil-portugal/)", "created_utc": "1664642403.0", "edited": "False", "id": "iqn496s", "is_submitter": "False", "link_id": "t3_xspsyp", "parent_id": "t1_iqmt33v", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "JaevligFaen", "body": "Interesting. Do you find PT-PT difficult to understand?", "created_utc": "1664642302.0", "edited": "False", "id": "iqn40n9", "is_submitter": "False", "link_id": "t3_xspsyp", "parent_id": "t1_iqmog4z", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "JaevligFaen", "body": "The differences are more significant than the varieties of Spanish or English. [Here's a list of words that are different, and this is just vocabulary, there are also many grammar differences, and the accent is completely different as well.](https://www.queroirla.com.br/dicionario-portugues-brasil-portugal/)", "created_utc": "1664642230.0", "edited": "False", "id": "iqn3uks", "is_submitter": "False", "link_id": "t3_xspsyp", "parent_id": "t1_iqmf5z3", "score": "5", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "JaevligFaen", "body": "If you go on Steam you can search for games by language, and they have a separate tag for European Portuguese. Portal 1 and 2, Mirror's Edge, Red Dead Redemption 2 etc have text in PT-PT (no audio though)\n\nAs for fan translations, [these are the only ones I could find](https://bluntbit.wordpress.com/romhacking/)", "created_utc": "1664642089.0", "edited": "False", "id": "iqn3ig6", "is_submitter": "False", "link_id": "t3_xspsyp", "parent_id": "t1_iqm5115", "score": "5", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "JaevligFaen", "body": "For official translations its easy to search on Steam, the more recent Tales games (which have LOTS of dialogue) are available in PT-BR. For fan translations check out https://romhackers.org/traducoes/ and https://www.romhacking.net/?page=translations&languageid=11&perpage=50&startpage=1\n\nChrono Trigger and Breath of Fire are on there", "created_utc": "1664625308.0", "edited": "False", "id": "iqm4pb2", "is_submitter": "False", "link_id": "t3_xspsyp", "parent_id": "t1_iqlyozb", "score": "7", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "JaevligFaen", "body": "I tried it for Portuguese.\n\nFirst I tried it on my laptop on the \"Tiny\" model. It detected the language as Polish, and so as you can imagine the transcript was just gibberish.\nThen I switched to my gaming rig and tried it on the \"Large\" model. It detected Portuguese correctly but then it exited with the simple message: \"killed\". I guess my GTX 1060 isn't powerful enough.\n\nFinally, I tried it on \"Medium\" and it was able to fully transcribe the audio. From what I can tell, it seems pretty accurate. Really cool.", "created_utc": "1664616458.0", "edited": "False", "id": "iqltt45", "is_submitter": "False", "link_id": "t3_xspsyl", "parent_id": "t3_xspsyl", "score": "5", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "JaevligFaen", "body": "I've only been able to find a small handful of games in European Portuguese, but I agree. They're great since they tend to have much easier vocabulary than books. I disagree with \"B2 or higher\" I'd start immediately after finishing learning the basics of the language and the first 1k or so common words. \n\nSome games have more text/dialogue than others, playing Mario in your TL isn't going to be useful. Final Fantasy on the other hand will be. \n\nTo other Portuguese learners, take note that Brazilians have made over a thousand fan translations of a huge variety of games. I've been told to avoid BR Portuguese to avoid confusion with EU Portuguese, but I got into these games anyways because it's just too nice to resist.", "created_utc": "1664616272.0", "edited": "False", "id": "iqltlot", "is_submitter": "False", "link_id": "t3_xspsyp", "parent_id": "t3_xspsyp", "score": "41", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "JaevligFaen", "body": "True. It's amazing how many people (in the US at least) think Duolingo or god-forbid Rosetta Stone is the answer. The other thing people seem to always get stuck in is upper-level language classes. I guess it could be beneficial to be \"forced\" to practice a language, but for me it was all boring material which makes it an awful experience. The perfect language class that doesn't exist is one where you choose what you get to read but still get pushed to keep reading it, and still have all the benefits of having a teacher.", "created_utc": "1664614418.0", "edited": "False", "id": "iqlrjyg", "is_submitter": "False", "link_id": "t3_xrl2yl", "parent_id": "t1_iqg1136", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "JaevligFaen", "body": "It's not clear to most people what to do after reaching the intermediate level. They think in terms of \"which app will teach me\" or \"what class do I take now\" because that's what people who don't know what they're talking about generally recommend.\n\nThen they either get frustrated because progress gets REALLY slow if you're just using duolingo to grind through tens of thousands of words, or taking a class and having a teacher yell at you in your target language because you didn't do the assignment right.\n\nWhat I've realized is that learning a language is 1% initial studying and 99% practice. These apps, classes, and other bullshit that people always recommend are only good for the first 1%. My recommended \"app\" is z-lib.org. Always.", "created_utc": "1664613515.0", "edited": "False", "id": "iqlqjgy", "is_submitter": "False", "link_id": "t3_xrl2yl", "parent_id": "t3_xrl2yl", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "JaevligFaen", "body": "If I had all the time in the world, I would've loved to get into Asian languages like Japanese, Korean, and Chinese. It's always really impressive to me when I hear non-natives speaking these languages. I'm aware of the difficulty though so I'm sticking with a European language for now.", "created_utc": "1664612322.0", "edited": "False", "id": "iqlp6os", "is_submitter": "False", "link_id": "t3_xs67lx", "parent_id": "t3_xs67lx", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "JaevligFaen", "body": "Tuition for classes that had a huge focus on grade and no focus on learning the language", "created_utc": "1664611481.0", "edited": "False", "id": "iqlo8xl", "is_submitter": "False", "link_id": "t3_xsbfno", "parent_id": "t3_xsbfno", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "JaevligFaen", "body": "I heard from a podcast that once you reach a high level, it only takes about 20 hours per year to maintain it. Not sure how true that is, but it's motivating for me to hear that.\n\nI also don't worry too much about that, because even if you start to forget a language, it doesn't seem to take much practice before it comes back.", "created_utc": "1664379533.0", "edited": "False", "id": "iq8wvtp", "is_submitter": "False", "link_id": "t3_xq4zoy", "parent_id": "t3_xq4zoy", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "JaevligFaen", "body": "Gosto que a bandeira da irlanda está ao contrário", "created_utc": "1664235276.0", "edited": "False", "id": "iq1dao3", "is_submitter": "False", "link_id": "t3_xou9u5", "parent_id": "t3_xou9u5", "score": "1", "subreddit": "PORTUGALCARALHO", "subreddit_id": "t5_366ul"}, {"author": "JaevligFaen", "body": "I married my target language after I realized I'm too ugly for people", "created_utc": "1664183836.0", "edited": "False", "id": "ipy7vkm", "is_submitter": "False", "link_id": "t3_xnvvlk", "parent_id": "t3_xnvvlk", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "JaevligFaen", "body": "Yeah. I do have a couple European friends who studied Brazilian Portuguese because of the higher population of native speakers, and also because I guess they had met Brazilians before traveling who didn't know English very well. One of those friends is learning Russian now for that same reason. But you're totally right, it's rare to meet people who intend to learn it despite the clear usefulness.", "created_utc": "1664009895.0", "edited": "False", "id": "ipp49c4", "is_submitter": "False", "link_id": "t3_xlsooa", "parent_id": "t1_ipo6gsr", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "JaevligFaen", "body": "It would be cool to see this extend into Sintra", "created_utc": "1663963077.0", "edited": "False", "id": "ipmunne", "is_submitter": "False", "link_id": "t3_xlyfqs", "parent_id": "t3_xlyfqs", "score": "1", "subreddit": "lisboa", "subreddit_id": "t5_2sein"}, {"author": "JaevligFaen", "body": "> I can still speak my Brazilian Portuguese with someone from Portugal and be easily understood and vice versa\n\nThis is somewhat surprising to me since I have some Brazilian friends and they've told me it's quite a struggle *at first* understanding PT-PT. Although it depends I'm sure on various things. Portuguese people have no trouble at all understanding Brazilians though. And sure people say this is because they watch Brazilian media, which is probably the primary reason, but I also think PT-BR is pronounced more clearly. \n\nIs it really accurate though to call PT-BR just an accent? I've been considering it a dialect. I've been told enough times to avoid using PT-BR content for immersion in order to avoid confusion that I figured they were quite different. Although there's such an ocean of PT-BR content online that it's really hard to resist the temptation lol.", "created_utc": "1663962935.0", "edited": "False", "id": "ipmucl2", "is_submitter": "False", "link_id": "t3_xlsooa", "parent_id": "t1_ipm6qmf", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "JaevligFaen", "body": "Right now it's very little because I'm focusing on reading comprehension and vocabulary. Once I can read fairly easily without needing to look up too many words I'll probably practice listening for at least an hour per day.", "created_utc": "1663941413.0", "edited": "False", "id": "iplid77", "is_submitter": "False", "link_id": "t3_xltgnd", "parent_id": "t3_xltgnd", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "JaevligFaen", "body": "Portuguese (from Portugal) is underrated in my opinion. I see it as more difficult to learn than Brazilian Portuguese and Spanish, but also I see those two as easily attainable after having a good level in Portuguese. It's not 3 for the price of 1, but there is a good element of a \"discount\".\n\nI don't think Japanese is overrated. But I do think people who choose it are the most often disillusioned in the end by the difficulty, and usefulness of the language. And I don't mean weebs, it's super useful for them. I mean people who invest time into it, thinking (like a european language) they'll learn it in a few years, then go try living in Japan. Not only do they realize it's one of the most difficult languages in the world, but also they don't really want to live in Japan.", "created_utc": "1663928323.0", "edited": "False", "id": "ipkx29u", "is_submitter": "False", "link_id": "t3_xlsooa", "parent_id": "t3_xlsooa", "score": "20", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "JaevligFaen", "body": "> the recent news\n\nMind sharing an article?", "created_utc": "1663873548.0", "edited": "False", "id": "ipi8met", "is_submitter": "False", "link_id": "t3_xl9exm", "parent_id": "t3_xl9exm", "score": "138", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "JaevligFaen", "body": "I don't want to be just another expat living in the English-speaking bubble. That's currently *exactly* what I am, but I'm slowly working on getting out of it.", "created_utc": "1663859929.0", "edited": "False", "id": "iph8d53", "is_submitter": "False", "link_id": "t3_xkj094", "parent_id": "t3_xkj094", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "JaevligFaen", "body": "A combination of becoming skilled at something marketable, and luck. \n\nI think too many people now are focused on just getting a college diploma (in anything) and then are shocked when the only jobs they can get are barely above minimum wage. And I don't blame them, my boomer parents shoved that diploma narrative down my throat too, and I did the same thing. In the end it wasn't my diploma that got me a great job, it was a skill that I learned *completely* outside of school.", "created_utc": "1663859480.0", "edited": "False", "id": "iph77i7", "is_submitter": "False", "link_id": "t3_xkrpev", "parent_id": "t3_xkrpev", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "JaevligFaen", "body": "Idk anything about dreaming spanish. If it were me, I would probably just read the short stories and SRS any critical vocabulary. Then upgrade to real novels when those become easy. After novels become easy, then I would listen to podcasts. Only after lots of reading/listening input would I practice speaking *in the field.*\n\nWith Spanish (and Portuguese in my case) the grammar is actually super easy, just hard to memorize. What's helped me has been focusing only on learning the simplest forms of verbs. In your reading, if you come across a really crazy verb conjugation, look it up on a verb conjugation site. Take mental note of what it was, move on with reading. This is my strategy (as someone who is still very much not fluent yet lol)", "created_utc": "1663693953.0", "edited": "False", "id": "ip7utgs", "is_submitter": "False", "link_id": "t3_xjc51k", "parent_id": "t3_xjc51k", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "JaevligFaen", "body": "I'm skeptical. What kind of novels are available in Esperanto? Are there podcasts you can listen to?\n\nI never really had any trouble getting past the beginning stage in any language.. It's the intermediate-advanced part where the struggle is. That's where I've always lost motivation. Reading novels has changed that for me though. My focus isn't on progressing in the language anymore, it's about just enjoying the content and staying consistent with it. And another part of my motivation is knowing the language will be useful in my life.\n\nI will say though I agree that I think it makes sense to learn an easier language before trying to tackle a language like Japanese.", "created_utc": "1663690529.0", "edited": "False", "id": "ip7lnr1", "is_submitter": "False", "link_id": "t3_xj85ef", "parent_id": "t3_xj85ef", "score": "6", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "JaevligFaen", "body": "I've only ever lived on the west coast, never been to the south. I'm honestly so taken aback I almost don't even believe you.", "created_utc": "1663609429.0", "edited": "False", "id": "ip3ac5n", "is_submitter": "False", "link_id": "t3_xi0rzj", "parent_id": "t1_ip2snz9", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "JaevligFaen", "body": "Student of 🇵🇹, and student of life.", "created_utc": "1663539921.0", "edited": "False", "id": "iozljlo", "is_submitter": "False", "link_id": "t3_xhbczj", "parent_id": "t1_ioysvzf", "score": "6", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "JaevligFaen", "body": "Moro em Portugal. E tens razão! Desde comecei a aprender português, percebo espanhol melhor que antes. Talvez o sotaque espanhol é mais fácil perceber que o sotaque português.", "created_utc": "1663506843.0", "edited": "False", "id": "iox8s8h", "is_submitter": "False", "link_id": "t3_xhbczj", "parent_id": "t1_iox80fh", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "JaevligFaen", "body": "I don't really care about the \"admirability\" of how I learn a language. What's important to me is the effectiveness, and for me, the most effective method to learn is to pick content I enjoy, regardless of origin.", "created_utc": "1663503236.0", "edited": "False", "id": "iox1eyl", "is_submitter": "False", "link_id": "t3_xh3t1l", "parent_id": "t1_iox02co", "score": "6", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "JaevligFaen", "body": "My preferred method now is to start with textbooks to get the basics down. Then spend a few months grinding the most common 2000 words. Once that's done, finally I look for content to read, probably mostly ebooks. \n\nIf it were a popular language I'm learning, I'd look for ebooks I've already read before so that I still remember the story, and I know I'll enjoy it. However, for more specific targets (like Portuguese from Portugal), it's proven to be difficult to find those specific books (most are in Brazilian Portuguese). So in this case, I'm looking through booklists on z-lib.org that contain only PT-PT books, and picking out those that look interesting. \n\nAfter a year or two of just reading, I'd gradually start listening to podcasts and watching shows. Then finally speaking. I know speaking this late is debatable, but my preference is to have my comprehension solid before I worry much about speaking. My goals are centered around comprehension, and I've learned over my experiences that day-to-day life in the TL country is made only a bit better from speaking, but lightyears better by comprehending.", "created_utc": "1663500158.0", "edited": "False", "id": "ioww0in", "is_submitter": "False", "link_id": "t3_xh5x9p", "parent_id": "t3_xh5x9p", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "JaevligFaen", "body": "I totally get this. Finding content to read, listen to, and watch in Swedish probably isn't too hard, but finding content you're familiar with and already know you enjoy is probably very hard. I'm always reminded that people learning Spanish, French, and German have seemingly everything in their language. Even obscure books I loved when I was younger I was able to find for free in those languages. My next language will be one of those just because it will be really fun to practice it.", "created_utc": "1663498950.0", "edited": "False", "id": "iowtyka", "is_submitter": "False", "link_id": "t3_xh3t1l", "parent_id": "t3_xh3t1l", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "JaevligFaen", "body": "Similar thing happened to me. I started learning Spanish in high school, which started off as just a required class but I ended up enjoying it and continuing with it in college. I always had nice teachers until the last few years of college, I had this one teacher who just made learning an extremely stressful experience, and it kind of made me lose interest in Spanish. It's been long enough now that I'm over it and I'd gladly go back to learning Spanish if needed, but Portuguese is far more relevant in my life right now.\n\n\"You were learning the language just because of the teacher\" is such reddit logic btw, don't listen to that armchair psychology. Any hobby can feel ruined from a bad experience, but we get over it.", "created_utc": "1663498386.0", "edited": "False", "id": "iowt1ct", "is_submitter": "False", "link_id": "t3_xhbczj", "parent_id": "t3_xhbczj", "score": "36", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "JaevligFaen", "body": "Nice I'll check that out thanks", "created_utc": "1663497872.0", "edited": "False", "id": "iows833", "is_submitter": "False", "link_id": "t3_xh1jtj", "parent_id": "t1_iowa4p6", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "JaevligFaen", "body": "First thing that came to mind is something that can import epub (ebook) files, then while you read it and look up unknown words, it adds them automatically to a flash card deck. With a threshold for how common the word is (if it's too uncommon, skip adding it)\n\nAn amazing tool though would be something like DeepL except perfect. I want to be able to translate English articles and even ebooks into European Portuguese.", "created_utc": "1663465242.0", "edited": "False", "id": "iove2mz", "is_submitter": "False", "link_id": "t3_xh1jtj", "parent_id": "t3_xh1jtj", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "JaevligFaen", "body": "z-lib.org is my favorite tool.", "created_utc": "1663435546.0", "edited": "False", "id": "iotj2dp", "is_submitter": "False", "link_id": "t3_xgr9v8", "parent_id": "t3_xgr9v8", "score": "23", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "JaevligFaen", "body": "Ha, I already don't speak the language of the country I'm currently in. So it's only gain for me.", "created_utc": "1663406614.0", "edited": "False", "id": "iorzj95", "is_submitter": "False", "link_id": "t3_xg1xxv", "parent_id": "t3_xg1xxv", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "JaevligFaen", "body": "I think it depends on both the skill level and the difficulty level of the text. So maybe something like this: <50% comprehension, use SRS. >50%, just look up the meanings of words. >80% you can figure out meanings just from the context. \n\nDoes this sound about right? Would be nice to get alternative views.", "created_utc": "1663350404.0", "edited": "False", "id": "iooyyv7", "is_submitter": "False", "link_id": "t3_xfwphu", "parent_id": "t3_xfwphu", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "JaevligFaen", "body": "There was a time I was living in Norway and even with my abysmal Norwegian skills there were still people who were kind enough to continue in Norwegian. My friends would even help me practice with them, despite the fact that I *definitely* wasn't ready to practice with native speakers.", "created_utc": "1663348906.0", "edited": "False", "id": "ioov309", "is_submitter": "False", "link_id": "t3_xfuajm", "parent_id": "t3_xfuajm", "score": "11", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "JaevligFaen", "body": "I think most people who get a bachelor's degree in a foreign language can't actually understand the language very well unless they did a lot of practice outside of class.", "created_utc": "1663266326.0", "edited": "False", "id": "ioka1ar", "is_submitter": "False", "link_id": "t3_xf1rkc", "parent_id": "t3_xf1rkc", "score": "6", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "JaevligFaen", "body": "Thanks, appreciate that. Sounds like I'll be better off sticking to native material", "created_utc": "1663076200.0", "edited": "False", "id": "io97zau", "is_submitter": "True", "link_id": "t3_xcexxq", "parent_id": "t1_io83seh", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "JaevligFaen", "body": "They're always bus drivers", "created_utc": "1663040461.0", "edited": "False", "id": "io7pvmw", "is_submitter": "False", "link_id": "t3_xcp40c", "parent_id": "t3_xcp40c", "score": "5", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "JaevligFaen", "body": "I'm obviously not gonna do it if people say it's a bad idea. That's why I asked first.", "created_utc": "1663010546.0", "edited": "False", "id": "io5sl79", "is_submitter": "True", "link_id": "t3_xcexxq", "parent_id": "t1_io5pih2", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "JaevligFaen", "body": "Of course, I'm not exactly starving for content (although it can be challenging to get specifically *Portugal* Portuguese content which is usually mixed in with Brazilian Portuguese stuff) If there's something I come across though (in English) that I actually feel really compelled to read (a book or article or anything) I often think \"What a waste, I'd understand this in Portuguese but there isn't a translation.\"", "created_utc": "1663005110.0", "edited": "False", "id": "io5ezy8", "is_submitter": "True", "link_id": "t3_xcexxq", "parent_id": "t1_io57lt5", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "JaevligFaen", "body": "The primary reasons I've been considering this lately is because I want to replace certain things in my life (that are in English) to Portuguese. Sometimes when I'm playing a video game, for example, I think \"What a waste, I'd understand this even in Portuguese but there isn't a translation.\" Sometimes there's a Brazilian Portuguese translation, but I saw that DeepL lets you specify European Portuguese which is pretty cool.", "created_utc": "1663003145.0", "edited": "False", "id": "io59yyj", "is_submitter": "True", "link_id": "t3_xcexxq", "parent_id": "t1_io4wyz5", "score": "0", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "JaevligFaen", "body": "That's a good point. Although, what would you say for somebody who doesn't care as much about speaking or writing, who only wants to be able to comprehend the language well?\n\n*Oh and in regards to finding native content online, that's true, but what about finding easier-level content that's engaging to read?", "created_utc": "1663001922.0", "edited": "False", "id": "io56v17", "is_submitter": "True", "link_id": "t3_xcexxq", "parent_id": "t1_io4q11a", "score": "0", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "JaevligFaen", "body": "Yeah it's definitely optimal to have natural phrasing when speaking. Currently though, I'm only concerned with comprehension. My overall goal really is just to understand my TL, in which case vocabulary is the most crucial part. That's what lead me (from one thing to another) to eventually considering this.", "created_utc": "1663001793.0", "edited": "False", "id": "io56izn", "is_submitter": "True", "link_id": "t3_xcexxq", "parent_id": "t1_io4orv6", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "JaevligFaen", "body": "Yep every time I see the word \"article\" in a google translated text (PT to EN) I know it should be \"package\"", "created_utc": "1662992667.0", "edited": "False", "id": "io4juek", "is_submitter": "False", "link_id": "t3_xb2li9", "parent_id": "t1_inx8323", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "JaevligFaen", "body": "People tend to look more favorably at the humble.", "created_utc": "1662834999.0", "edited": "False", "id": "invyg8q", "is_submitter": "False", "link_id": "t3_xatsog", "parent_id": "t3_xatsog", "score": "70", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "JaevligFaen", "body": "I've shared my experience here before but I'll do it again since I think it's valuable info. \n\nI'd say the benefits of classes diminish quickly as you get to a higher level in the language. I took many Spanish classes and at the intermediate/advanced level, it became really miserable (for me). Being forced to read boring novels and write boring essays was torture. I'd almost go as far as to say it ruined Spanish for me. Also I think they push you to speak really early which can be really nervewracking, and I don't think is very beneficial. I'm a believer in getting lots of input before worrying about speaking/writing, and I'm also a big believer in minimizing discomfort while learning. I used to think discomfort and awkwardness were \"just part of the journey to fluency\" but now I look back and realize most of those bad experiences could've been avoided if I had just spent more time reading and listening. \n\nIf old literature/poetry is something that gets you excited, then maybe you'll have a better experience than I did in these classes. I think that was the primary issue for me, the material just bored me to tears.", "created_utc": "1662762726.0", "edited": "False", "id": "insaiv2", "is_submitter": "False", "link_id": "t3_xa3ws5", "parent_id": "t3_xa3ws5", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "JaevligFaen", "body": "B2 after 2.5 years seems pretty quick. Nice job.", "created_utc": "1662756297.0", "edited": "False", "id": "inrvj2a", "is_submitter": "False", "link_id": "t3_x9zrrv", "parent_id": "t3_x9zrrv", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "JaevligFaen", "body": "It makes life easier when you can communicate with the people around you. I'm learning the language of the country in which I live.", "created_utc": "1662733439.0", "edited": "False", "id": "inqaoa2", "is_submitter": "False", "link_id": "t3_x9j74g", "parent_id": "t3_x9j74g", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "JaevligFaen", "body": "> Accordingly, I have not found many programmers who are also very good at human languages. More commonly, they are good at process planning, i.e. what needs to happen when and in which order, at understanding large systems, or at math\n\nThis is interesting. Programming came really naturally to me, but language learning never did.", "created_utc": "1662733174.0", "edited": "False", "id": "inqa1bz", "is_submitter": "False", "link_id": "t3_x9vpqh", "parent_id": "t3_x9vpqh", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "JaevligFaen", "body": "I think specific dates are pretty important actually, not for output but for input. At least in my experience dates come up pretty frequently. \n\nAnyway I was pretty annoyed when Memrise's default Portuguese wordlists started teaching me loads of fruits and clothing items. Lemon, lime, scarf, vest. Had to learn road, flight, phone, etc. elsewhere.", "created_utc": "1662674953.0", "edited": "False", "id": "inncfi6", "is_submitter": "False", "link_id": "t3_x98qyz", "parent_id": "t3_x98qyz", "score": "23", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "JaevligFaen", "body": "Yep exactly", "created_utc": "1662588824.0", "edited": "False", "id": "inif4ty", "is_submitter": "False", "link_id": "t3_x87azz", "parent_id": "t1_ini23r5", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "JaevligFaen", "body": "Switch to Spanish.\n\nMy experience taking advanced language classes in University (in the US) was terrible. It could be different at your school, but I think most likely you'll be told *what* to read, and forced to write essays on that literature. If that's what you like, fine. For me it was excruciatingly boring and I didn't come out feeling like I learned much. If you want to improve your German now, I think you're better off at this point extensively reading whatever you enjoy, and luckily German has a wealth of great content for free online.\n\nBeginner level language classes in University though tend to be alright in my opinion, so if that's what you're taking for Spanish I'd say it's probably worth it.", "created_utc": "1662574275.0", "edited": "False", "id": "inhcecz", "is_submitter": "False", "link_id": "t3_x8aero", "parent_id": "t3_x8aero", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "JaevligFaen", "body": "> What do you think is the most important thing to understand about learning a language?\n\n* Some are *way* harder than others. Learning Dutch (as an English speaker) is going to be extremely easier than Japanese.\n\n* Learning materials and good content is extremely available for languages like French, German, Japanese. Not so much for obscure languages like Zulu or Navajo. \n\n* Some languages are just more useful to know than others. Depends a lot on your situation but learning Swedish to travel for 2 weeks in Sweden is pretty much pointless.", "created_utc": "1662573556.0", "edited": "False", "id": "inhahc7", "is_submitter": "False", "link_id": "t3_x87azz", "parent_id": "t3_x87azz", "score": "28", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "JaevligFaen", "body": "First time I dropped a language, it was because it didn't feel useful for me. Second time due to a lack of resources. Third time it was too difficult a language.\n\nI would actually love to go back and practice them, but Portuguese takes priority since it's useful (for me), has the resources available, and isn't super difficult.", "created_utc": "1662529910.0", "edited": "False", "id": "inf08yr", "is_submitter": "False", "link_id": "t3_x7srom", "parent_id": "t3_x7srom", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "JaevligFaen", "body": "Portuguese is the most useful language for me right now, it has sufficient learning resources, and it isn't difficult enough to discourage me. The other languages were either not useful, too difficult, or lacked resources.", "created_utc": "1662528970.0", "edited": "False", "id": "ineyun1", "is_submitter": "False", "link_id": "t3_x576mg", "parent_id": "t1_in8bvfw", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "JaevligFaen", "body": "I don't think switching to Japanese is the answer tbh. Kind of sounds like \"I feel stuck with Algebra, should I switch to Nuclear Physics?\" I'd revisit why you chose French originally, and see if your reasons still fit. You don't want to get 2 years into Japanese and start wishing you stuck with French. If you really want to study Japanese you'll just do it regardless of what reddit says.", "created_utc": "1662506366.0", "edited": "False", "id": "indopaj", "is_submitter": "False", "link_id": "t3_x7mwyp", "parent_id": "t3_x7mwyp", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "JaevligFaen", "body": "Generating graded content would be pretty amazing, as long as it's accurate. But it also has to be entertaining to read. I tried graded readers and the problem was that they were boring. It's more entertaining for me to read something engaging that I only understand 80-90% of, than a boring text that I understand 98% of. \n\nAlso, for me it would be a really nice if there was an AI trained to convert Brazilian Portuguese to European Portuguese.", "created_utc": "1662476594.0", "edited": "False", "id": "inbl4je", "is_submitter": "False", "link_id": "t3_x7632b", "parent_id": "t3_x7632b", "score": "5", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "JaevligFaen", "body": "Only when talking to a cute girl, but it comes back as soon as she leaves", "created_utc": "1662400172.0", "edited": "False", "id": "in7l6lt", "is_submitter": "False", "link_id": "t3_x6iy9i", "parent_id": "t3_x6iy9i", "score": "64", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "JaevligFaen", "body": "I'm learning European Portuguese, but those retro game translations are too tempting too resist.", "created_utc": "1662331661.0", "edited": "False", "id": "in43wem", "is_submitter": "False", "link_id": "t3_x5qgw3", "parent_id": "t1_in3rbub", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "JaevligFaen", "body": "If you think that's hard, how about a/an before an acronym. Is it \"a ROP\" or \"an ROP\"?", "created_utc": "1662316433.0", "edited": "False", "id": "in34mlj", "is_submitter": "False", "link_id": "t3_x5tisp", "parent_id": "t1_in327nk", "score": "4", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "JaevligFaen", "body": "Steam is great, I really appreciate the fact that they specify *which* version of Portuguese a game has. And you can browse and filter games by Portuguese (Brazil) and Portuguese (Portugal). Even e-book libraries don't have this distinction so I appreciate that they added it.\n\nAlso, check out https://romhackers.org/traducoes/ Brazilians are amazing. They've fan translated over a thousand games into Portuguese.", "created_utc": "1662312381.0", "edited": "False", "id": "in2uk2k", "is_submitter": "False", "link_id": "t3_x5qgw3", "parent_id": "t3_x5qgw3", "score": "5", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "JaevligFaen", "body": "What you are describing is B1 hell.\n\nFrom what I understand, the only way through it is to read as much as you can. Just read read read. There have been some great posts by people who have gone through the basics, read loads of content, learned loads of vocab this way, and gone on to become fluent. When you remember a word, it doesn't feel like progress, but when you have to look up a word you forgot, it feels like a step backwards. But the reality is, it's a step forwards, because you will probably remember it next time. Just keep **reading!!!**", "created_utc": "1662260170.0", "edited": "False", "id": "in0ces6", "is_submitter": "False", "link_id": "t3_x58xpn", "parent_id": "t3_x58xpn", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "JaevligFaen", "body": "I'm still a proponent of learning the basics on your own, but beyond that just communicate in Spanish as much as possible and it should come fast.", "created_utc": "1662259899.0", "edited": "False", "id": "in0bvl1", "is_submitter": "False", "link_id": "t3_x58wz6", "parent_id": "t3_x58wz6", "score": "6", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "JaevligFaen", "body": "I've had a similar thing happen, but I've also switched TL entirely 3 times, without ever reaching fluency. And I know from other hobbies that I'm just the type of person to jump to a new and exciting thing before finishing the old one. \n\nMy goal is to reach fluency in my current TL, so I have to be careful because I know my own tendencies.", "created_utc": "1662247189.0", "edited": "False", "id": "imzlffj", "is_submitter": "False", "link_id": "t3_x576mg", "parent_id": "t3_x576mg", "score": "8", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "JaevligFaen", "body": "linguee", "created_utc": "1662237303.0", "edited": "False", "id": "imyywet", "is_submitter": "False", "link_id": "t3_x53p3c", "parent_id": "t3_x53p3c", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "JaevligFaen", "body": "As people are saying, it's preferable to learn words by reading. I'll add to that by saying I prefer to quantify by pages I'm able to read per day, rather than new words learned per day. Beginning stages should just be 1 to 2 pages per day, but as you improve and know increasingly more words, eventually 50 pages per day will be easy. And the only upper limit is your own motivation and interest in the content you're actually reading.", "created_utc": "1662223949.0", "edited": "False", "id": "imy2lhj", "is_submitter": "False", "link_id": "t3_x4xmys", "parent_id": "t3_x4xmys", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "JaevligFaen", "body": "I think there's a benefit to taking a week or two off after studying for a few months. But I don't think it has to be the same week you vacation. If I vacation when feeling excited about learning I'll read/study on a beach somewhere.", "created_utc": "1662220900.0", "edited": "False", "id": "imxuzvj", "is_submitter": "False", "link_id": "t3_x4xbid", "parent_id": "t3_x4xbid", "score": "5", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "JaevligFaen", "body": "Honestly, I don't think I would do it.\n\nI've realized that trying to throw myself headfirst into immersion as a beginner is really stressful. I end up self-doubting a lot, and ultimately feel bad about myself and my progress.\n\nWhat I'd do instead is build up my vocabulary first. In the case of French, this should be free. There are endless resources in French. I'd spend like a year just reading books, (and playing video games since there are so many translated to French lol). Then listening practice. It's not until I'm comfortable with my vocab and listening comprehension that I would start to stress over immersion. (I'd still travel before this, sure, but wouldn't beat myself up over not being able to understand people)", "created_utc": "1662214480.0", "edited": "False", "id": "imxfqzx", "is_submitter": "False", "link_id": "t3_x4rk41", "parent_id": "t3_x4rk41", "score": "5", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "JaevligFaen", "body": "Portuguese with Leo has an exclusive 1 hour per month podcast with a transcript. https://www.patreon.com/portuguesewithleo\n\nAnd this one has some exclusive stuff as well https://www.patreon.com/thesoundsofportuguese", "created_utc": "1662172712.0", "edited": "False", "id": "imvozlx", "is_submitter": "False", "link_id": "t3_x4iy84", "parent_id": "t3_x4iy84", "score": "6", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "JaevligFaen", "body": "Similar situation for me. Portuguese (Portugal) is the most useful for my life situation, but there are certain things about it that make it annoying to study. (Seemingly every online resource is BR-PT)\n\nWhat helps me decide though is knowing more characteristics of the language, and advantages (or lack of advantages) of knowing it. \n\nFor example, Latin American countries tend to have *drastically* fewer English-proficient people than Germany or Austria. German also has a lot of dialects (and don't be fooled into thinking you'll understand Swiss German). Spanish has dialects too, but they are similar and intelligible. Both languages have a wealth of online resources, so you won't be stuck reading boring content. But even still, do some searches online for content you already enjoy, but translated into either language, and see what you can find. I was very surprised to see several of my favorite videogames of all time have been fan-translated into Spanish, while they're not even available in French or German.", "created_utc": "1662159388.0", "edited": "False", "id": "imuxfm6", "is_submitter": "False", "link_id": "t3_x4emr1", "parent_id": "t3_x4emr1", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "JaevligFaen", "body": "For so long this concept was counter-intuitive to me, because obviously we learn to read our native language *after* we already can understand and speak it.\n\nBut for foreign language acquisition, it seems that reading comes first, and trying to understand native speech too early is putting the cart before the horse. So now, I don't think there's any point in trying to understand native speech before you can read somewhat easily.", "created_utc": "1662158274.0", "edited": "False", "id": "imuuz4n", "is_submitter": "False", "link_id": "t3_x47r36", "parent_id": "t3_x47r36", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "JaevligFaen", "body": "People getting offended is their own problem. Unless you're obviously mocking them, I wouldn't worry about it.", "created_utc": "1662090861.0", "edited": "False", "id": "imr613d", "is_submitter": "False", "link_id": "t3_x3q7qv", "parent_id": "t3_x3q7qv", "score": "9", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "JaevligFaen", "body": "swag", "created_utc": "1662063850.0", "edited": "False", "id": "impg6ad", "is_submitter": "False", "link_id": "t3_x2mlxx", "parent_id": "t1_imnif63", "score": "1", "subreddit": "Portuguese", "subreddit_id": "t5_2sqn7"}, {"author": "JaevligFaen", "body": "I've been there, and I know the exact feeling. Sometimes you just gotta be a recluse for a week or two and take a break. No studying, just let your brain digest what you've taken in.", "created_utc": "1662061999.0", "edited": "False", "id": "impb9sy", "is_submitter": "False", "link_id": "t3_x3bct4", "parent_id": "t3_x3bct4", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "JaevligFaen", "body": "Even if you don't plan to live there, Japanese has a huge wealth of entertaining content. And if you're into anything obscure it probably won't be translated.", "created_utc": "1662046209.0", "edited": "False", "id": "imo62kv", "is_submitter": "False", "link_id": "t3_x2t4km", "parent_id": "t3_x2t4km", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "JaevligFaen", "body": "I'm in my late 20's and I'm still only fluent in English.", "created_utc": "1661986121.0", "edited": "False", "id": "iml3q4x", "is_submitter": "False", "link_id": "t3_x2obim", "parent_id": "t3_x2obim", "score": "4", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "JaevligFaen", "body": "I'd just rather my relaxation time watching TV or playing video games is useful on some level. If I'm maintaining a language I learned, then it's kind of like being productive without making any effort, right?", "created_utc": "1661972724.0", "edited": "False", "id": "imk575x", "is_submitter": "False", "link_id": "t3_x2k1gz", "parent_id": "t3_x2k1gz", "score": "9", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "JaevligFaen", "body": "Thank you very much for this explanation.\n\nYeah I'm mostly interested in fiction. Unfortunately even if (English) fiction is 20th century like H.G. Wells books, the translation is certain to be from recent years. Thankfully though it seems with some trial and error though it's not impossible to find EP editions even on z-lib.", "created_utc": "1661971692.0", "edited": "False", "id": "imk2glp", "is_submitter": "True", "link_id": "t3_x1mdak", "parent_id": "t1_imjfc69", "score": "2", "subreddit": "Portuguese", "subreddit_id": "t5_2sqn7"}, {"author": "JaevligFaen", "body": "Muito bom. Obrigado!", "created_utc": "1661882896.0", "edited": "False", "id": "imf09wg", "is_submitter": "True", "link_id": "t3_x1mdak", "parent_id": "t1_imewivi", "score": "1", "subreddit": "Portuguese", "subreddit_id": "t5_2sqn7"}, {"author": "JaevligFaen", "body": "Ótimo! Muito obrigado!", "created_utc": "1661877302.0", "edited": "False", "id": "imelplh", "is_submitter": "True", "link_id": "t3_x1mdak", "parent_id": "t1_imeicst", "score": "1", "subreddit": "Portuguese", "subreddit_id": "t5_2sqn7"}, {"author": "JaevligFaen", "body": "Ótimo! Muito obrigado!", "created_utc": "1661877290.0", "edited": "False", "id": "imelofr", "is_submitter": "True", "link_id": "t3_x1mdak", "parent_id": "t1_imeebjq", "score": "1", "subreddit": "Portuguese", "subreddit_id": "t5_2sqn7"}, {"author": "JaevligFaen", "body": "Thanks haha", "created_utc": "1661870739.0", "edited": "False", "id": "ime4xt6", "is_submitter": "False", "link_id": "t3_x0s10k", "parent_id": "t1_imcjtc0", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "JaevligFaen", "body": "I'm a very efficiency-minded person, and I do aspire to know multiple languages. So I'm very aware when I'm \"wasting\" time. (TV, video games, browsing the web) And I know people say there's nothing wrong with these things, nobody can be productive 24/7. But at least if I knew another language to a high level, it could be both relaxing and productive at the same time?- At least that's what I'm told. \n\nThere is a lot of great content available in Portuguese, but someday I plan to study French or German which has a massive amount of fantastic content available. If I were to spend my relaxation time enjoying content in other languages, it would only be a matter of time before reaching a really high level without even trying. That's my reasoning, at least.", "created_utc": "1661820280.0", "edited": "False", "id": "imbsg9x", "is_submitter": "False", "link_id": "t3_x0r2o2", "parent_id": "t3_x0r2o2", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "JaevligFaen", "body": "Sure, it is the most standard one, but that doesn't necessarily mean it's easy to find content exclusively in the Oslo or even exclusively eastern Norwegian dialects. Podcasts, radio, television, etc are probably going to be a big mix. But it's been a while since I was studying this language so maybe I'm wrong. Audiobooks might be the way to go, if you can find those.", "created_utc": "1661806675.0", "edited": "False", "id": "imaym48", "is_submitter": "False", "link_id": "t3_x0s10k", "parent_id": "t1_imapzvw", "score": "6", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "JaevligFaen", "body": "To answer the title, I would say no.\n\nReading it is easy, it's listening comprehension that's the biggest struggle. Norwegians have a lot of different dialects due to towns being separated for centuries by mountains and lakes. Native speakers have no trouble at all understanding them, but I definitely had a hard time with it. Even Swedish is more similar than some of these more isolated dialects.\n\nThe other issue I found was lack of content available to get through B1 hell. Plenty of native-level podcasts and books, but finding anything lower level is a challenge.\n\nBeautiful language though, and beautiful country. If you're willing to accept the challenge you should go for it.", "created_utc": "1661795303.0", "edited": "False", "id": "ima7d13", "is_submitter": "False", "link_id": "t3_x0s10k", "parent_id": "t3_x0s10k", "score": "25", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "JaevligFaen", "body": "I think the biggest myth is that if you live in a country, you'll automatically pick up the language over time. This is so wrong. \n\nIt all depends on what you do while living there. If you're constantly practicing with natives, you'll obviously improve. But if you spend all your time speaking English, that obviously won't help. \n\nOn the bright side, I've found that living in a foreign country is really motivating for learning the language. Even though I do most of my learning alone (reading and listening to content, which I could have done in my home country of course), it motivates me to continue whenever something I've learned becomes actually useful in daily life.", "created_utc": "1661787379.0", "edited": "False", "id": "im9n9ly", "is_submitter": "False", "link_id": "t3_x0csoi", "parent_id": "t3_x0csoi", "score": "26", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "JaevligFaen", "body": "Neither are my native language but \"fita\" (ribbon/tape) in Portuguese is like \"fitta\" (pussy) in Norwegian", "created_utc": "1661720838.0", "edited": "False", "id": "im6cf2j", "is_submitter": "False", "link_id": "t3_x02wir", "parent_id": "t3_x02wir", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "JaevligFaen", "body": "Yeah I'm curious to know a proper explanation as well", "created_utc": "1661712108.0", "edited": "False", "id": "im5rgze", "is_submitter": "False", "link_id": "t3_wzyapn", "parent_id": "t1_im5fmoh", "score": "1", "subreddit": "Portuguese", "subreddit_id": "t5_2sqn7"}, {"author": "JaevligFaen", "body": "I guess B is the only one where she actually asks for the book. In A she's only stating that she needs it, not requesting it. And in C she doesn't ask for it either. Only B has a question mark. Does that sound right?", "created_utc": "1661706865.0", "edited": "False", "id": "im5eo1l", "is_submitter": "False", "link_id": "t3_wzyapn", "parent_id": "t3_wzyapn", "score": "1", "subreddit": "Portuguese", "subreddit_id": "t5_2sqn7"}, {"author": "JaevligFaen", "body": "Thanks!", "created_utc": "1661705703.0", "edited": "False", "id": "im5bsje", "is_submitter": "False", "link_id": "t3_wzxkkm", "parent_id": "t1_im58tyh", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "JaevligFaen", "body": "Do you think it's better to focus on one dialect (avoiding content unless it's that dialect) or get a whole variety all at once?\n\nIn my case, learning European Portuguese, there is a decent amount of content out there, but Brazilian Portuguese content is *so* much more abundant. However, Portuguese from Portugal is what I need to learn. I'm considering only allowing PT-BR content in my reading, but avoiding it for listening. I know you learned PT-BR so curious what your opinion is.", "created_utc": "1661703988.0", "edited": "False", "id": "im57gcm", "is_submitter": "False", "link_id": "t3_wzxkkm", "parent_id": "t3_wzxkkm", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "JaevligFaen", "body": "> it was actually more important that I understand what was said to me, than my ability to speak\n\nCouldn't agree more. I had this experience as well many years ago when I studied abroad, unfortunately my speaking abilities were far beyond my listening comprehension. I absolutely loathe the situation where a native speaker responds to me and I didn't understand, so I ask them to repeat and I still don't understand, so finally they have to repeat a *third* time in English. I always feel guilty, and realized I'd much rather be the one who has to repeat. So that's why I only focus on reading and listening now.", "created_utc": "1661701312.0", "edited": "False", "id": "im50vol", "is_submitter": "False", "link_id": "t3_wzxe5y", "parent_id": "t3_wzxe5y", "score": "7", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "JaevligFaen", "body": "How much time does it take you to maintain each language? What methods do you use?", "created_utc": "1661700878.0", "edited": "False", "id": "im4ztzz", "is_submitter": "False", "link_id": "t3_wzxkkm", "parent_id": "t1_im4wkcp", "score": "11", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "JaevligFaen", "body": "I never really had an interest in French until recently. From struggling with a few difficult languages in the past, I was looking for a language that has lots of content available and no crazy dialects. It came down to Spanish, French, and German, and French seems to be the most standardized one. \n\nNot saying French is an easy language by any means. But when I see how much fantastic content is available in French (with no need to clarify which variety of French it is), I can't help but think \"French learners cannot suffer\" lol.", "created_utc": "1661699777.0", "edited": "False", "id": "im4x7ru", "is_submitter": "False", "link_id": "t3_wzs3g0", "parent_id": "t3_wzs3g0", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "JaevligFaen", "body": "I heard from a podcast that once you reach a high level, it only takes about 20 hours per year to maintain it. Not sure how true that is, but it's motivating for me to hear that.\n\nI also don't worry too much about that, because even if you start to forget a language, it doesn't seem to take much practice before it comes back.", "created_utc": "1661652042.0", "edited": "False", "id": "im2u3hq", "is_submitter": "False", "link_id": "t3_wzgfu3", "parent_id": "t3_wzgfu3", "score": "14", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "JaevligFaen", "body": "Spanish- Had a bad time in school learning it in classrooms, embarrassing myself in front of native speakers, and having a teacher who busted my ass. I'm perfectly happy learning Portuguese, pretty sure it's even improved my comprehension of Spanish. Now I can speak Portuguese to Spanish speakers and confuse them, which is a much more interesting result anyways.\n\nJapanese- I found removing any interest in Japan from my brain easier than learning this crazy ass language. Hats off to anyone who manages that nightmare in less than 10 years. \n\nNorwegian- I had/have an unhealthy obsession with this country, and I used to think it's an easy language because it's so close to English. Then I realized the word \"language\" doesn't even accurately fit this thing, it's more of a collection of crazy dialects that differ more from each other than they do from Swedish. I still might have a secret fling with this language every once in a while but the lack of learning resources and content make it a bit more difficult. And forget any podcast that has a collection of dialects all being spoken, that shit isn't helping anybody.", "created_utc": "1661642477.0", "edited": "False", "id": "im2ani1", "is_submitter": "False", "link_id": "t3_wzeewj", "parent_id": "t3_wzeewj", "score": "10", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "JaevligFaen", "body": "Oh yeah I only tried it in Portugal, you might need a VPN.", "created_utc": "1661638009.0", "edited": "False", "id": "im211r5", "is_submitter": "False", "link_id": "t3_wyieur", "parent_id": "t1_im10hph", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "JaevligFaen", "body": "Heh yeah the thing with dubs, they are hit or miss.\n\nThankfully the European Portuguese dub is so hilariously bad that the show has become *more* entertaining to watch as a result.", "created_utc": "1661561454.0", "edited": "False", "id": "ilxzths", "is_submitter": "False", "link_id": "t3_wyieur", "parent_id": "t1_ilxy28u", "score": "8", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "JaevligFaen", "body": "Avatar the last airbender. Still holds up as an adult and has a lot of dubs on netflix, including separate dubs for EU/BR Portuguese.\n\nIf I ever try learning French I'll probably watch Code Lyoko, loved that show as a kid lol.", "created_utc": "1661547977.0", "edited": "False", "id": "ilx5jik", "is_submitter": "False", "link_id": "t3_wyieur", "parent_id": "t3_wyieur", "score": "37", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "JaevligFaen", "body": "Do you plan to use them?", "created_utc": "1661541008.0", "edited": "False", "id": "ilwo8f5", "is_submitter": "False", "link_id": "t3_wyg5sx", "parent_id": "t3_wyg5sx", "score": "9", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "JaevligFaen", "body": "Yeah, this isn't meant to be a criticism of the language teachers in academia. Really, I just think the way we lump in different educational subjects together into what we call a \"curriculum\" is pretty archaic. Languages just aren't learned the same way as subjects like Biology or Algebra.\n\nOn one hand, having a few beginner classes in a language in high school is great to introduce people to foreign languages as a subject. That's how I originally became interested in pursuing languages, and I'm grateful for that. But so-called \"advanced\" language classes in universities are a total joke, to be honest. At some point, I think you just need lots of input and one-on-one practice, which isn't really practical in traditional academia.", "created_utc": "1661476872.0", "edited": "False", "id": "ilt9pzu", "is_submitter": "False", "link_id": "t3_wxbpjw", "parent_id": "t1_ilt3nji", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "JaevligFaen", "body": "Thanks. One other question: Do you have any trouble with listening comprehension? Or is that easy after so much reading?", "created_utc": "1661475231.0", "edited": "False", "id": "ilt63bf", "is_submitter": "False", "link_id": "t3_wxi4ve", "parent_id": "t1_ilt2wst", "score": "5", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "JaevligFaen", "body": "Very valuable post. Thanks. Do you use physical books or an e-reader? If e-reader, which one do you prefer? Thanks.", "created_utc": "1661468669.0", "edited": "False", "id": "ilsrl64", "is_submitter": "False", "link_id": "t3_wxi4ve", "parent_id": "t3_wxi4ve", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "JaevligFaen", "body": "I think we can all agree that language classes are usually a pretty inefficient/slow way to learn, and even when attending them, the bulk of learning comes from self-study.", "created_utc": "1661435128.0", "edited": "False", "id": "ilqdyis", "is_submitter": "False", "link_id": "t3_wxbpjw", "parent_id": "t3_wxbpjw", "score": "16", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "JaevligFaen", "body": "In my view, PT-PT speakers have an easier time understanding PT-BR speakers than the other way around. I focus all my practice on PT-PT, and yet when I come across PT-BR I still find the accent to be easier. I hear as well from Portuguese people that they understand PT-BR no problem, while Brazilians need a bit of practice to get used to the accents of Portugal. \n\nAside from the accent, the vocabulary is slightly different as well, meaning if you want to understand both, you'll need to know the word differences.", "created_utc": "1661382400.0", "edited": "False", "id": "ilnsrvp", "is_submitter": "False", "link_id": "t3_wwwi3x", "parent_id": "t3_wwwi3x", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "JaevligFaen", "body": "I look somewhat foreign in Portugal, so I get some funny reactions when I speak to native speakers sometimes. Usually there's no reaction, business as usual, but sometimes they laugh as soon as they hear me speak in Portuguese. \n\nNot a ridiculing laugh, but more like they weren't expecting to hear it so it was funny. Or maybe it was ridiculing idk lol. But they're always friendly.", "created_utc": "1661361899.0", "edited": "False", "id": "ilmbd7n", "is_submitter": "False", "link_id": "t3_wwod1g", "parent_id": "t3_wwod1g", "score": "24", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "JaevligFaen", "body": "Currently I use memrise", "created_utc": "1661361060.0", "edited": "False", "id": "ilm949f", "is_submitter": "False", "link_id": "t3_wwjy4f", "parent_id": "t1_ilm8kao", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "JaevligFaen", "body": "Kinda different but \"fita\" in Portuguese means ribbon or tape, so it's a fairly common word. But whenever I hear it I cringe, because in Norwegian, \"fitta\" means pussy lol.", "created_utc": "1661360856.0", "edited": "False", "id": "ilm8kuf", "is_submitter": "False", "link_id": "t3_wwnxiq", "parent_id": "t3_wwnxiq", "score": "30", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "JaevligFaen", "body": "If you've ever watched auto-generated subtitles in English then you know they're hilariously inaccurate.\n\nSo, depending on the language, it might be easy to find good content on youtube. For German, French, Spanish, there should be a lot of native speakers who have lots of content on youtube where they speak slowly, clearly, with simple vocab, and have added subtitles. For my case, European Portuguese, as far as I know, only has a few channels like that. If you're learning Haitian Creole, you're probably out of luck. \n\nIf you do manage to find a channel like that, I think it's the best way to learn (after you've already learned the basics). I also create flash cards for words/phrases that come up that I don't know.", "created_utc": "1661360045.0", "edited": "False", "id": "ilm6ej6", "is_submitter": "False", "link_id": "t3_wwjy4f", "parent_id": "t3_wwjy4f", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "JaevligFaen", "body": "Haha yeah I am", "created_utc": "1661358914.0", "edited": "False", "id": "ilm3d6n", "is_submitter": "False", "link_id": "t3_ww9eco", "parent_id": "t1_illxhpz", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "JaevligFaen", "body": "Most proud moment:\n\nMy doorbell rang and it was a guy from the water company. I had forgotten to pay the bill, and he was there to cut off my water service. I thankfully understood what he said, and I managed to convince him to give me a day to pay it. Not bad for B1", "created_utc": "1661355746.0", "edited": "False", "id": "illuz5v", "is_submitter": "False", "link_id": "t3_ww9eco", "parent_id": "t3_ww9eco", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "JaevligFaen", "body": "I get a blank page when I click to sign up", "created_utc": "1661280979.0", "edited": "False", "id": "ilhqefo", "is_submitter": "False", "link_id": "t3_wvrvda", "parent_id": "t3_wvrvda", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "JaevligFaen", "body": "Totally. Lots of Brazilians are motivated to learn English as well, some of them even live in Portugal. It is quite a different accent/dialect though.", "created_utc": "1661280867.0", "edited": "False", "id": "ilhq3kx", "is_submitter": "False", "link_id": "t3_wvounl", "parent_id": "t1_ilhn3oj", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "JaevligFaen", "body": "I've done 5 months in Portugal so far, and even with my friends being English speakers and not going out of my way to immerse myself, I still think I've come pretty far. The biggest benefit to living in the TL country I think is that you gain a *lot* of motivation to learn the language. Your day is filled with constant reminders to study.", "created_utc": "1661280531.0", "edited": "False", "id": "ilhp7rs", "is_submitter": "False", "link_id": "t3_wvcn2l", "parent_id": "t3_wvcn2l", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "JaevligFaen", "body": "Yeah exactly. Portuguese people are particularly well educated in English too, so yeah I have a better shot at just making some local friends and paying them in beer to help me learn.", "created_utc": "1661278465.0", "edited": "False", "id": "ilhjv7z", "is_submitter": "False", "link_id": "t3_wvounl", "parent_id": "t1_ilh4ink", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "JaevligFaen", "body": "> You are always in demand to learn from\n\nNot in my experience in Europe, unfortunately. Very hard for me to find language exchange partners.", "created_utc": "1661272003.0", "edited": "False", "id": "ilh2u78", "is_submitter": "False", "link_id": "t3_wvounl", "parent_id": "t3_wvounl", "score": "5", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "JaevligFaen", "body": "First thing in the morning, 30min to 1hr watching youtube lessons/videos and making new flash cards. \n\nAfter lunch, 10-20 minutes reviewing the flash cards.\n\nIn the evening I just relax and enjoy some content in Portuguese. Or in English if I'm feeling lazy. \n\nI should probably do more, but for now this works and it's low enough effort that I can't make any excuses for not doing it.", "created_utc": "1661184089.0", "edited": "False", "id": "ilc43ik", "is_submitter": "False", "link_id": "t3_wumn8q", "parent_id": "t3_wumn8q", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "JaevligFaen", "body": "Thanks I was looking for this!", "created_utc": "1661175621.0", "edited": "False", "id": "ilbj6ob", "is_submitter": "False", "link_id": "t3_wukelp", "parent_id": "t1_ilb04nl", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "JaevligFaen", "body": "Thanks!", "created_utc": "1661175280.0", "edited": "False", "id": "ilbiesn", "is_submitter": "False", "link_id": "t3_wtl82q", "parent_id": "t1_il8w184", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "JaevligFaen", "body": "I think the true reasons go way back to my childhood. I never really resonated at all with the place where I grew up. \n\nThis led to me obsessing over different places around the world for years, while being stuck in school in my hometown. Also I saw the Bourne series of films and idolized the scenes where he's just able to respond to whatever language is being spoken to him in whatever situation. I studied Spanish in high school and university, but I always had \"shiny-object syndrome\" (wanting to switch to an exciting new language after just a year or so of studying).\n\nAt one point I basically sat down and decided to research actionable steps I could take to eventually move to another country. And the research went on for a few years, kind of replacing my interest in languages for a while. There are so many amazing opportunities around the world, I got lost in all the possibilities. Last year I decided Portugal was the country that made the most sense for me. The visa process took 6 long months and lots of jumping through hoops, but finally I made the move. \n\nFinally having moved to Europe, I no longer felt the need to research all these different countries around the world. I didn't realize until then that it was actually something that occupied my mind a lot. With that distraction gone, the obsession with languages rushed back in.\n\nI had studied Portuguese a little before moving to Portugal, and Spanish knowledge from school helped a lot, but I now feel a massive frustration with how poorly I speak and understand any of the languages I've tried to learn in the past. So I made a pledge to myself. If I'm able to understand Portuguese TV, radio, podcasts etc. by June 2024, then I'll start on a new language. Otherwise I'll continue until I get there.", "created_utc": "1661095981.0", "edited": "False", "id": "il7bbg4", "is_submitter": "False", "link_id": "t3_wtl82q", "parent_id": "t3_wtl82q", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "JaevligFaen", "body": "Avatar the last Airbender. \n\nIt's dubbed in a lot of languages, even has two separate dubs for Portuguese. The audio and subtitles don't match, but sometimes I think it's better to just turn the subtitles off anyway. \n\nIf you're like me and watched this show a lot as a kid, it's perfect because you aren't gonna miss the plot if you don't understand a few lines. And you'll remember a good amount of the original lines before they come up, so you'll be more prepared to understand them.\n\nWith Harry Potter as the standard reading practice, I'm surprised that Avatar isn't the standard for listening practice.", "created_utc": "1661091959.0", "edited": "False", "id": "il71y3l", "is_submitter": "False", "link_id": "t3_wtqzzx", "parent_id": "t3_wtqzzx", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "JaevligFaen", "body": "In the past I always got stuck in B1 hell, so I'm trying to get through it this time. I keep motivated by thinking how easy and fun it will be to practice Portuguese once I get past this part. Just watching TV, listening to podcasts, doing stuff I would normally do except in Portuguese. I want to get there so badly.\n\nIt's also motivating to hear from people who became fluent in another language how easy it is to maintain it.", "created_utc": "1661091161.0", "edited": "False", "id": "il707rx", "is_submitter": "False", "link_id": "t3_wtzlc7", "parent_id": "t3_wtzlc7", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "JaevligFaen", "body": "Oh maybe. Never been before", "created_utc": "1661089504.0", "edited": "False", "id": "il6wq11", "is_submitter": "False", "link_id": "t3_wtf972", "parent_id": "t1_il4o1fh", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "JaevligFaen", "body": "I take it that you don't subscribe to the idea of studying one language at a time, reaching \"fluency\" before initiating another, then. \n\nDo you worry about the speed of progress with this strategy at all? I know for me, I need to have some noticeable progress to stay motivated, and that's hard enough even studying just one language.", "created_utc": "1661036254.0", "edited": "False", "id": "il4i1f1", "is_submitter": "False", "link_id": "t3_wtid9h", "parent_id": "t3_wtid9h", "score": "4", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "JaevligFaen", "body": "It's funny because I took Japanese in university, and they kind of just breeze over this and tell us that 青 means blue, and 緑 or みどり means green. Then 青信号 means \"green light\".", "created_utc": "1661033279.0", "edited": "False", "id": "il4bklb", "is_submitter": "False", "link_id": "t3_wtf972", "parent_id": "t1_il3uigu", "score": "5", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "JaevligFaen", "body": "I always thought the indigo thing was stupid. \n\nI had a science teacher in elementary school who told us indigo is a color of the rainbow, and stressed this fact as if it was proven and established. Even as a kid I had to wonder why indigo counts, but something between red and orange doesn't.", "created_utc": "1661032870.0", "edited": "False", "id": "il4anx7", "is_submitter": "False", "link_id": "t3_wtf972", "parent_id": "t3_wtf972", "score": "21", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "JaevligFaen", "body": "Korean. \n\nI have some far-off goal of joining a charity that helps North Koreans who escaped to China to reach South Korea (or any safe haven). But part of the requirement is to know Korean. \n\nCurrently I'm only learning Portuguese, but I have some plans to learn other languages after I reach a high level in Portuguese. So Korean is pretty low on the list, but maybe a low level would be enough.", "created_utc": "1661032230.0", "edited": "False", "id": "il498hc", "is_submitter": "False", "link_id": "t3_wthcby", "parent_id": "t3_wthcby", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "JaevligFaen", "body": "I've heard that a lot of people take a month off from studying and when they return, they find that they've somehow improved a bit. \n\nSomething about the brain practicing on its own while you sleep. Pretty amazing.", "created_utc": "1661001174.0", "edited": "False", "id": "il2a4f0", "is_submitter": "False", "link_id": "t3_wssv8s", "parent_id": "t3_wssv8s", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "JaevligFaen", "body": "Literally just a guess. I don't think it matters that much.", "created_utc": "1661000955.0", "edited": "False", "id": "il29oro", "is_submitter": "False", "link_id": "t3_wso8sz", "parent_id": "t3_wso8sz", "score": "4", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "JaevligFaen", "body": "Say something in Portuguese!\n\nLike what?\n\nIdk, anything!\n\n\"Qualquer coisa\"", "created_utc": "1660997915.0", "edited": "False", "id": "il242zj", "is_submitter": "False", "link_id": "t3_ws1ocp", "parent_id": "t3_ws1ocp", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "JaevligFaen", "body": "I'm not so sure that's the whole story. I already know from many years of language learning that I struggle the most with listening. So on my current mission to learn Portuguese, I've put a massive focus on practicing listening comprehension, yet still I find it to be the hardest of the 4.", "created_utc": "1660993054.0", "edited": "False", "id": "il1wr32", "is_submitter": "False", "link_id": "t3_wsi606", "parent_id": "t1_ikyn79l", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "JaevligFaen", "body": "My university (California) basically threw beginners into native-level Spanish literature classes. Imagine reading Spanish literature as a beginner in front of a class of native speakers. Not exactly a comfortable learning environment. \n\nI think maybe if I were interested in literature it would have worked out after some time, but to me the material was excruciatingly boring. So in the end I don't feel like I picked up the language.", "created_utc": "1660890214.0", "edited": "False", "id": "ikwgq7s", "is_submitter": "False", "link_id": "t3_ws070y", "parent_id": "t1_ikvzayn", "score": "13", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "JaevligFaen", "body": "It's the same for me currently. Which I think means we both need to practice listening to online content, and not feel bad or beat ourselves up for not understanding people's speech yet.", "created_utc": "1660826853.0", "edited": "False", "id": "iksev6r", "is_submitter": "False", "link_id": "t3_wqiuoy", "parent_id": "t1_iknfb87", "score": "2", "subreddit": "Portuguese", "subreddit_id": "t5_2sqn7"}, {"author": "JaevligFaen", "body": "This", "created_utc": "1660826608.0", "edited": "False", "id": "iksed84", "is_submitter": "False", "link_id": "t3_wqxumk", "parent_id": "t1_ikre784", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "JaevligFaen", "body": "Because I live in Portugal", "created_utc": "1660823762.0", "edited": "False", "id": "iks8vrb", "is_submitter": "False", "link_id": "t3_wqxumk", "parent_id": "t3_wqxumk", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "JaevligFaen", "body": "I don't actually feel like I've fully given up on any language. \n\nI know which languages interest me and which don't, and there are really *only* 5 that I'll ever study. So I'm fine with putting one on hold to focus on another, knowing I might not come back to it again in many years. 5 may seem like a lot, but life is long so I'm not worried about that number.", "created_utc": "1660817612.0", "edited": "False", "id": "ikrz4bw", "is_submitter": "False", "link_id": "t3_wqs04d", "parent_id": "t3_wqs04d", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "JaevligFaen", "body": "Tell them all to learn Latin so we can revive it", "created_utc": "1660816079.0", "edited": "False", "id": "ikrx3zx", "is_submitter": "False", "link_id": "t3_wr1uha", "parent_id": "t1_ikq3kqs", "score": "24", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "JaevligFaen", "body": "We all know they're dumb because we're experienced in learning languages, but the randoms on youtube eat that stuff up. To them it probably sounds feasible.", "created_utc": "1660815949.0", "edited": "False", "id": "ikrwxw6", "is_submitter": "False", "link_id": "t3_wr1uha", "parent_id": "t1_ikpuv9h", "score": "15", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "JaevligFaen", "body": "I never had anyone show real impatience.\n\nIn Portugal, if you speak Portuguese to a decent level, they won't switch to English. If you struggle, they'll switch to English if they know it. If they don't know English though, I've found what happens is that I actually get impatient with myself for not knowing how to say what I'm trying to say. And they reassure me that I'm doing fine, there's no rush, etc. So basically my experience with the locals has been really great.", "created_utc": "1660744827.0", "edited": "False", "id": "iknoe9j", "is_submitter": "False", "link_id": "t3_wqheji", "parent_id": "t3_wqheji", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "JaevligFaen", "body": "I still can't do it either and I started learning Spanish 13 years ago lol. \n\nYou could always switch to Portuguese. The Portuguese 'rr' is a strong 'h' sound (like the 'g' in gente in Spanish). \n\nI think I have heard Portuguese people roll their r's, but it's much much rarer than Spanish.", "created_utc": "1660734506.0", "edited": "False", "id": "ikn3rtj", "is_submitter": "False", "link_id": "t3_wq9o1e", "parent_id": "t3_wq9o1e", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "JaevligFaen", "body": "Have you ever tried learningwithtexts.online?\n\nI was told it's like a free LingQ, but judging by the site it seems like it might be more of a pain to use. It also seems like the website isn't maintained.", "created_utc": "1660733839.0", "edited": "False", "id": "ikn2r8l", "is_submitter": "False", "link_id": "t3_wq8zuo", "parent_id": "t1_iklouix", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "JaevligFaen", "body": "Sounds like a good idea to me. I think I would use it.\n\nI don't have an e-reader but I was planning to get one and just add words to memrise on the side while I read. But if it could all be done on the e-reader itself, that would be a lot more convenient. \n\nIf the flashcards also had audio recordings of the words being pronounced, that would be ideal.", "created_utc": "1660733251.0", "edited": "False", "id": "ikn1vx0", "is_submitter": "False", "link_id": "t3_wqjxmr", "parent_id": "t3_wqjxmr", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "JaevligFaen", "body": "I log the vocab I don't know into an SRS app, otherwise I tend to forget a lot more words. \n\nIt's weird how some words will stick after just seeing them once, but some words take a LOT of review before they stick. In these cases, it's frustrating for me to have to look the same word up again and again, I'd rather just log it in memrise. Sometimes with the context as well, if I think it will help me remember. \n\nI don't even spend that much time using memrise anyway, but I feel like the 10-20 mins per day does make a big difference in \"solidifying\" vocab that otherwise would have probably faded.", "created_utc": "1660732629.0", "edited": "False", "id": "ikn0zmx", "is_submitter": "False", "link_id": "t3_wqg142", "parent_id": "t3_wqg142", "score": "5", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "JaevligFaen", "body": "I voted \"too difficult to listen and comprehend\"\n\nI got really good at navigating my way around speaking and getting my point across using just the words I know. But you can't control which words somebody else uses. Also I think I just have a natural lack of talent with listening comprehension, even in my native language lol.", "created_utc": "1660663163.0", "edited": "False", "id": "ikj2ha1", "is_submitter": "False", "link_id": "t3_wpsl0b", "parent_id": "t3_wpsl0b", "score": "6", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "JaevligFaen", "body": "I'm learning Portuguese now but when I studied Spanish, I spent so much time in classrooms.\n\nIn university, as least where I went, the classes seem to jump straight from beginner level to native with nothing between. I was sat in a classroom of native Spanish speakers learning literature while I could barely communicate. And I was *expected* to speak in front of the class as part of the grade. This is not a comfortable environment for learning anything. Honestly I dreaded going to these classes. Might be part of the reason I switched to Portuguese.", "created_utc": "1660662177.0", "edited": "False", "id": "ikizlc3", "is_submitter": "False", "link_id": "t3_wppaxe", "parent_id": "t3_wppaxe", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "JaevligFaen", "body": "We need decentralized fiat -> crypto ramps", "created_utc": "1659188998.0", "edited": "False", "id": "ii9abtj", "is_submitter": "False", "link_id": "t3_wbuawi", "parent_id": "t3_wbuawi", "score": "10", "subreddit": "Monero", "subreddit_id": "t5_31hbr"}, {"author": "JaevligFaen", "body": "Will this enable Monero to Bitcoin atomic swaps?", "created_utc": "1658939590.0", "edited": "False", "id": "ihvcycp", "is_submitter": "False", "link_id": "t3_w9dnt9", "parent_id": "t3_w9dnt9", "score": "7", "subreddit": "Monero", "subreddit_id": "t5_31hbr"}, {"author": "JaevligFaen", "body": "Gotta keep that echo chamber clean", "created_utc": "1643398940.0", "edited": "False", "id": "humhbwu", "is_submitter": "False", "link_id": "t3_seechm", "parent_id": "t1_hujx6vs", "score": "5", "subreddit": "antiwork", "subreddit_id": "t5_2y77d"}, {"author": "JaevligFaen", "body": "Cash by mail requires a lot of trust. It would be great if there were a more reliable method.", "created_utc": "1640997570.0", "edited": "False", "id": "hqr00ww", "is_submitter": "False", "link_id": "t3_rshq9h", "parent_id": "t1_hqn1wlv", "score": "1", "subreddit": "Monero", "subreddit_id": "t5_31hbr"}, {"author": "JaevligFaen", "body": "This is the reason why we don't need a minimum wage", "created_utc": "1640970529.0", "edited": "False", "id": "hqp9bf4", "is_submitter": "False", "link_id": "t3_rsuuu4", "parent_id": "t3_rsuuu4", "score": "-4", "subreddit": "antiwork", "subreddit_id": "t5_2y77d"}, {"author": "JaevligFaen", "body": "Well to be honest I'm not super familiar with this idea. But it sounds similar to how a lot of new companies these days have less of a vertical hierarchical structure and more of a horizontal one. I agree this is way better than the traditional large corporation where your CEO doesn't even know your name let alone your needs.", "created_utc": "1640927104.0", "edited": "False", "id": "hqn9pao", "is_submitter": "False", "link_id": "t3_rrjsgu", "parent_id": "t1_hqlys5y", "score": "1", "subreddit": "antiwork", "subreddit_id": "t5_2y77d"}, {"author": "JaevligFaen", "body": ">The economy should not be built in such a way that people need to be this cutthroat about goods and services. \n\nWhy not?\n\nI agree though about the current system we live in. It's better than monarchies, feudal societies, and obviously better than dictatorships. But that doesn't mean it's good. Like you say, those who have connections have way too much power. Agree completely.", "created_utc": "1640926898.0", "edited": "False", "id": "hqn9b70", "is_submitter": "False", "link_id": "t3_rrjsgu", "parent_id": "t1_hqlyh4p", "score": "1", "subreddit": "antiwork", "subreddit_id": "t5_2y77d"}, {"author": "JaevligFaen", "body": "If people want to live in expensive hellholes who am I to stop them? Imagine choosing to live in LA and complaining about expensive real estate. You can buy an entire farm in the midwest for a fraction of the cost of a home in LA.", "created_utc": "1640926434.0", "edited": "False", "id": "hqn8fmf", "is_submitter": "False", "link_id": "t3_rrk93k", "parent_id": "t1_hqlv7pe", "score": "0", "subreddit": "antiwork", "subreddit_id": "t5_2y77d"}, {"author": "JaevligFaen", "body": "If you don't want anything for free or cheap, then what is the issue? \n\nBoycotting a small business on the assumption they don't pay their workers enough is just shortsighted. I bet OP still buys cheap products that were made overseas by people who were paid a fraction of what our workers in the west are paid.", "created_utc": "1640926311.0", "edited": "False", "id": "hqn879m", "is_submitter": "False", "link_id": "t3_rrd41l", "parent_id": "t1_hqlsp3g", "score": "1", "subreddit": "antiwork", "subreddit_id": "t5_2y77d"}, {"author": "JaevligFaen", "body": ">To qualify for many jobs that DO PAY LIVABLE WAGE a diploma is needed since it is required by those employers.\n\nAh yes the almighty magical diploma without which one is doomed forever to never see a decent income. Please don't question this absolute fact or else the colleges might stop profiting so much!", "created_utc": "1640925966.0", "edited": "False", "id": "hqn7jbd", "is_submitter": "False", "link_id": "t3_rr2j82", "parent_id": "t1_hqlclm1", "score": "1", "subreddit": "antiwork", "subreddit_id": "t5_2y77d"}, {"author": "JaevligFaen", "body": "You're waving your finger at a stranger on the internet for not buying into the fearmongering bullshit the mainstream media is constantly shoving down our throats. Seriously if you turn all that shit off you'll see the world isn't such a scary place. Be free, dude.", "created_utc": "1640892594.0", "edited": "False", "id": "hql1cqq", "is_submitter": "False", "link_id": "t3_rqzp8a", "parent_id": "t1_hqj6uvd", "score": "1", "subreddit": "antiwork", "subreddit_id": "t5_2y77d"}, {"author": "JaevligFaen", "body": "It's easier to keep someone remote who you know is a valuable employee than take your chances with someone new", "created_utc": "1640892402.0", "edited": "False", "id": "hql0unj", "is_submitter": "False", "link_id": "t3_rrc9mg", "parent_id": "t1_hqip80b", "score": "1", "subreddit": "antiwork", "subreddit_id": "t5_2y77d"}, {"author": "JaevligFaen", "body": "So what's the incentive of taking higher risk to build a business from nothing if you can get paid the same to just get a regular job?", "created_utc": "1640892205.0", "edited": "False", "id": "hql0c4h", "is_submitter": "False", "link_id": "t3_rrjsgu", "parent_id": "t1_hqijrgp", "score": "0", "subreddit": "antiwork", "subreddit_id": "t5_2y77d"}, {"author": "JaevligFaen", "body": "Sounds more like you want the government to enforce artificial price controls on your labor to make it more expensive to hire you. Which in the end just means you have to work harder anyway, or someone else who can provide higher quality labor will replace you. Or a machine since a machine doesn't need a \"living wage\".", "created_utc": "1640892102.0", "edited": "False", "id": "hql028t", "is_submitter": "False", "link_id": "t3_rrd41l", "parent_id": "t1_hqig4er", "score": "0", "subreddit": "antiwork", "subreddit_id": "t5_2y77d"}, {"author": "JaevligFaen", "body": "It might surprise you to hear it but I actually think subsidizing healthcare is not the worst idea in the world. The health insurance oriented system currently in the US is probably the worst idea in the world.", "created_utc": "1640891934.0", "edited": "False", "id": "hqkzmaw", "is_submitter": "False", "link_id": "t3_rrjsgu", "parent_id": "t1_hqi3u5i", "score": "2", "subreddit": "antiwork", "subreddit_id": "t5_2y77d"}, {"author": "JaevligFaen", "body": "You consider yourself an anarchist? That is interesting. Without a government, monarchy, or dictatorship, who is going to force business owners to surrender their businesses to the workers?", "created_utc": "1640891840.0", "edited": "False", "id": "hqkzdj2", "is_submitter": "False", "link_id": "t3_rrjsgu", "parent_id": "t1_hqhye11", "score": "1", "subreddit": "antiwork", "subreddit_id": "t5_2y77d"}, {"author": "JaevligFaen", "body": "Ok here's an example. Your sink clogs so you hire a plumber to fix it. It takes him an hour. You want to purchase an hour of his labor. But wait! Another plumber shows up and offers to do the same work for half the price. This price falls below minimum wage. Do you go with the cheap option? Or do you pay the first plumber out of the kindness of your heart?\n\nYou might say \"I'd pay the first plumber, I have morals and I don't want to pay someone below a living wage.\" But you don't know the situation. Maybe the cheaper plumber is desperate for the work experience. Maybe he's simply training so that when he is more skilled he can charge more for his labor. \n\nWhen you make the threshold a \"living wage\", it cuts off the bottom rung of the ladder and only those who already climbed up are able to benefit from it. The rest are left unemployed. This is why college is so damn popular now. Nobody can get work experience so they go into massive debt instead out of desperation to reach that new lowest threshold. Minimum wage is nothing but an artificial price control on labor, and throughout history, price controls simply don't work. If you sold apples you'd probably be shouting for price controls on apples to make them more expensive. However if you bake apple pies for a living, you probably would be fighting tooth and nail against it. People are just selfish and want the government to make what they're selling worth more. In most people's case, the commodity in question is simply labor. Now we have this idea that labor is somehow above other commodities, but from an objective viewpoint it is not.", "created_utc": "1640891710.0", "edited": "False", "id": "hqkz197", "is_submitter": "False", "link_id": "t3_rrjsgu", "parent_id": "t1_hqhy5mb", "score": "1", "subreddit": "antiwork", "subreddit_id": "t5_2y77d"}, {"author": "JaevligFaen", "body": "Average home prices in the most expensive segments of the US, but you'd rather cherrypick than look in the literally thousands of other cities that exist within the country.", "created_utc": "1640890540.0", "edited": "False", "id": "hqkw02q", "is_submitter": "False", "link_id": "t3_rrk93k", "parent_id": "t1_hqhxwd2", "score": "0", "subreddit": "antiwork", "subreddit_id": "t5_2y77d"}, {"author": "JaevligFaen", "body": ">If the federal reserve would stop controlling currency, many risks would appear. We had a good taste of those risks in 1929.\n\nIt's riskier with the FED. They suppress interest rates to the point where you have to invest and risk your hard earned savings just to keep them from being decimated by the inflation they create. It's *despicable* what these people do to us, and they don't deserve you making excuses for them.", "created_utc": "1640831877.0", "edited": "False", "id": "hqhum66", "is_submitter": "False", "link_id": "t3_rr7m8u", "parent_id": "t1_hqhr344", "score": "1", "subreddit": "antiwork", "subreddit_id": "t5_2y77d"}, {"author": "JaevligFaen", "body": "Did I ever say that $750k is cheap? Obviously housing prices in big tech cities are exploding (which is nothing new) but let's not fucking pretend that it's impossible to get a house under A MILLION FREAKING DOLLARS. At least not yet lol", "created_utc": "1640831200.0", "edited": "False", "id": "hqht3ds", "is_submitter": "False", "link_id": "t3_rrk93k", "parent_id": "t1_hqhqvwb", "score": "0", "subreddit": "antiwork", "subreddit_id": "t5_2y77d"}, {"author": "JaevligFaen", "body": "Then start your own business and surrender it to your workers lol. Oh no you don't want to do that, you want your benevolent dictator to do it for you. Good luck with that.", "created_utc": "1640829547.0", "edited": "False", "id": "hqhpe4u", "is_submitter": "False", "link_id": "t3_rrjsgu", "parent_id": "t1_hqhgodo", "score": "-1", "subreddit": "antiwork", "subreddit_id": "t5_2y77d"}, {"author": "JaevligFaen", "body": "And how do you think \"they\" keep prices up? You think \"they\" just collaborate with every business in the entire US? No. It's through inflation. It's hard for us to understand as 2-3% inflation doesn't sound like much, but it's like compound interest. Over time it makes a MASSIVE difference. It's the biggest crime in the world and it needs to end. Going after business owners for raising prices is like shooting the messenger. Completely wrong.", "created_utc": "1640829223.0", "edited": "False", "id": "hqhonwf", "is_submitter": "False", "link_id": "t3_rr7m8u", "parent_id": "t1_hqhg37e", "score": "1", "subreddit": "antiwork", "subreddit_id": "t5_2y77d"}, {"author": "JaevligFaen", "body": "Are we really going to judge the entire US housing market on LA of all places???? Give me a break.", "created_utc": "1640828895.0", "edited": "False", "id": "hqhnw79", "is_submitter": "False", "link_id": "t3_rrk93k", "parent_id": "t1_hqhg1z5", "score": "-4", "subreddit": "antiwork", "subreddit_id": "t5_2y77d"}, {"author": "JaevligFaen", "body": "So we're really going to judge the housing market now on the most expensive cities in the US? They are not $1 million minimum in Seattle, I lived there literally a few months ago. My roommate bought a house there for way under a million.", "created_utc": "1640828818.0", "edited": "False", "id": "hqhnpy9", "is_submitter": "False", "link_id": "t3_rrk93k", "parent_id": "t1_hqhg0h2", "score": "2", "subreddit": "antiwork", "subreddit_id": "t5_2y77d"}, {"author": "JaevligFaen", "body": "That is insane. Yet I'm not surprised after all it's California LOL. People will spend their life savings on a 4x4 meter plot next to an airport in California. No wonder people are leaving that hellhole.", "created_utc": "1640828675.0", "edited": "False", "id": "hqhne8t", "is_submitter": "False", "link_id": "t3_rrk93k", "parent_id": "t1_hqhfaty", "score": "-3", "subreddit": "antiwork", "subreddit_id": "t5_2y77d"}, {"author": "JaevligFaen", "body": "I agree somewhat with the first part, but disagree with the last part. If you recognize inflation as an increase in the money supply, then it can't be ignored that wages have fallen WAY behind inflation. Nobody is earning 40% more at the same job they had before 2020, yet the increase in the money supply has been 40% or maybe even more. \n\nI do agree though that anticipation and more importantly FAITH in the currency has a major impact on price increases. This is probably why despite the inflation in the US so far, we haven't seen drastic increases in everyday prices (yet). Once people start to really lose faith in the currency, that's when it really spirals downwards. (Or upwards I guess lol)", "created_utc": "1640828550.0", "edited": "False", "id": "hqhn42y", "is_submitter": "False", "link_id": "t3_rr7m8u", "parent_id": "t1_hqhdhed", "score": "1", "subreddit": "antiwork", "subreddit_id": "t5_2y77d"}, {"author": "JaevligFaen", "body": "Hey I'm not defending the massive inflation that led to the recent spike in property valuations. But let's at least be honest, at least for now there are loads of single family homes WELL under $1 million in the US. \n\nBut I'm aware the folks on this board are keen on outright buying up 4 bedroom homes for themselves on minimum wage LOL", "created_utc": "1640828326.0", "edited": "False", "id": "hqhmlza", "is_submitter": "False", "link_id": "t3_rrk93k", "parent_id": "t1_hqhd2qc", "score": "2", "subreddit": "antiwork", "subreddit_id": "t5_2y77d"}, {"author": "JaevligFaen", "body": "You're actually sending me a quote from Karl Marx? Lol come on man. \n\nLabor is no different from goods/services on the market. You probably paid market price for the computer you typed that comment on. You didn't pay extra out of the kindness of your heart for the poor Taiwanese factory workers who assembled it. How dare you, you capitalist pig!", "created_utc": "1640827876.0", "edited": "False", "id": "hqhlkqp", "is_submitter": "False", "link_id": "t3_rrjsgu", "parent_id": "t1_hqhcjkd", "score": "-1", "subreddit": "antiwork", "subreddit_id": "t5_2y77d"}, {"author": "JaevligFaen", "body": "I'm pro small business", "created_utc": "1640827550.0", "edited": "False", "id": "hqhkuci", "is_submitter": "False", "link_id": "t3_rrjsgu", "parent_id": "t1_hqhbuj7", "score": "-9", "subreddit": "antiwork", "subreddit_id": "t5_2y77d"}, {"author": "JaevligFaen", "body": "Which system in particular? I assume you mean the US, which has declined rapidly in recent years, 100% agree. The wealth gap is massive. But if you understood the financial system the US operates on, you'd realize that the majority of this is due to corrupt officials in DC who dictate financial policy. Their game is bringing in politicians and central bankers who feign empathy for the \"average American\" while simultaneously creating policies that make it even worse!", "created_utc": "1640827515.0", "edited": "False", "id": "hqhkrkb", "is_submitter": "False", "link_id": "t3_rrjsgu", "parent_id": "t1_hqhbg74", "score": "-1", "subreddit": "antiwork", "subreddit_id": "t5_2y77d"}, {"author": "JaevligFaen", "body": "You're right, the workers do make it happen. The workers who build up a business from nothing and sacrifice every day to take massive risk on the slight chance of seeing some success. Only to one day need to hire entitled and hubris employees who think they are owed the world and have them demand to be paid in surplus of the revenue they bring in.", "created_utc": "1640827235.0", "edited": "False", "id": "hqhk525", "is_submitter": "False", "link_id": "t3_rrjsgu", "parent_id": "t1_hqhav0q", "score": "-12", "subreddit": "antiwork", "subreddit_id": "t5_2y77d"}, {"author": "JaevligFaen", "body": "If you have then you should know the value of labor and be thankful for every fucking paycheck. That's how I know you probably haven't. You probably think sharing an apartment in a big city is \"roughing it\" while being ungrateful for everything you have. Instead you want more, and you want it for free. This board reeks of hubris and entitlement.", "created_utc": "1640826902.0", "edited": "False", "id": "hqhjdv4", "is_submitter": "False", "link_id": "t3_rrd41l", "parent_id": "t1_hqh9exv", "score": "-5", "subreddit": "antiwork", "subreddit_id": "t5_2y77d"}, {"author": "JaevligFaen", "body": "I mean it's technically true, but you can gain those extra wages by running your own business. Or do you expect your boss to work for free?", "created_utc": "1640821562.0", "edited": "False", "id": "hqh6za9", "is_submitter": "False", "link_id": "t3_rrjsgu", "parent_id": "t3_rrjsgu", "score": "-21", "subreddit": "antiwork", "subreddit_id": "t5_2y77d"}, {"author": "JaevligFaen", "body": "But we have the vaccine so it should be safe????? Or are you saying we should lock down every winter?", "created_utc": "1640821427.0", "edited": "False", "id": "hqh6nq3", "is_submitter": "False", "link_id": "t3_rrdxhq", "parent_id": "t3_rrdxhq", "score": "-2", "subreddit": "antiwork", "subreddit_id": "t5_2y77d"}, {"author": "JaevligFaen", "body": "The government is stealing everyone's wages all the time but of course they get a free pass because they hand us \"free stuff\" worth a fraction of what they steal.", "created_utc": "1640821250.0", "edited": "False", "id": "hqh68lj", "is_submitter": "False", "link_id": "t3_rrc7kj", "parent_id": "t3_rrc7kj", "score": "-7", "subreddit": "antiwork", "subreddit_id": "t5_2y77d"}, {"author": "JaevligFaen", "body": "Where do you live that houses are $1MM minimum???? Fucking Monaco?\n\nOr do you need a 7 bedroom house to survive?", "created_utc": "1640821122.0", "edited": "False", "id": "hqh5xpy", "is_submitter": "False", "link_id": "t3_rrk93k", "parent_id": "t1_hqgw30c", "score": "-12", "subreddit": "antiwork", "subreddit_id": "t5_2y77d"}, {"author": "JaevligFaen", "body": "You've clearly never been desperate for work. Have you ever lived out of a car? This is why I won't hire anyone, people too entitled these days lol. Thank god I can run my business alone. It's hard but its better than dealing with whining kids who think $28 an hour isn't enough to survive.", "created_utc": "1640821027.0", "edited": "False", "id": "hqh5pim", "is_submitter": "False", "link_id": "t3_rrd41l", "parent_id": "t3_rrd41l", "score": "-15", "subreddit": "antiwork", "subreddit_id": "t5_2y77d"}, {"author": "JaevligFaen", "body": "I like this because too many people just text back \"fuck you I quit!\" which makes it easy on the manager because he knows what's going on. This is the way to handle it, keep them thinking just a few more minutes, he'll be here for sure.", "created_utc": "1640820808.0", "edited": "False", "id": "hqh56ul", "is_submitter": "False", "link_id": "t3_rrd8te", "parent_id": "t3_rrd8te", "score": "34", "subreddit": "antiwork", "subreddit_id": "t5_2y77d"}, {"author": "JaevligFaen", "body": "Yeah basically the US has a terrible government that tries to make things cheaper by doing things that make them more expensive. I've already seen the writing on the wall lol. Start looking into residence permits and visas like I did, it's not too hard to move abroad.", "created_utc": "1640820565.0", "edited": "False", "id": "hqh4mb3", "is_submitter": "False", "link_id": "t3_rr7fia", "parent_id": "t3_rr7fia", "score": "1", "subreddit": "TIHI", "subreddit_id": "t5_r1l2z"}, {"author": "JaevligFaen", "body": "Small business owners are not usually very wealthy tbh..... In fact a lot of them struggle and at the end of the day if the employees quit, it's the owner who has to do the labor on top of running the business. But of course nobody here will understand as everyone here is brainwashed into believing that any business owner is a fat cat sitting on millions and whipping his slaves into working 70 hours a week.", "created_utc": "1640820465.0", "edited": "False", "id": "hqh4drk", "is_submitter": "False", "link_id": "t3_rrbj12", "parent_id": "t3_rrbj12", "score": "1", "subreddit": "antiwork", "subreddit_id": "t5_2y77d"}, {"author": "JaevligFaen", "body": "People don't realize this \"return to the office\" thing is a massive bluff. I told my company \"nah lol\" and got my contract extended.", "created_utc": "1640820298.0", "edited": "False", "id": "hqh3zi2", "is_submitter": "False", "link_id": "t3_rrc9mg", "parent_id": "t3_rrc9mg", "score": "13", "subreddit": "antiwork", "subreddit_id": "t5_2y77d"}, {"author": "JaevligFaen", "body": "Probably too busy running a company that employs thousands of people. And you probably bought something at least a couple times from Amazon so you've contributed to his wealth lol", "created_utc": "1640820243.0", "edited": "False", "id": "hqh3unk", "is_submitter": "False", "link_id": "t3_rremwd", "parent_id": "t3_rremwd", "score": "1", "subreddit": "antiwork", "subreddit_id": "t5_2y77d"}, {"author": "JaevligFaen", "body": "Do it, you won't regret it.", "created_utc": "1640817643.0", "edited": "False", "id": "hqgxhhb", "is_submitter": "False", "link_id": "t3_rrkvc7", "parent_id": "t3_rrkvc7", "score": "2", "subreddit": "antiwork", "subreddit_id": "t5_2y77d"}, {"author": "JaevligFaen", "body": "In my line of work they use \"sprints\" (two week intervals of work) to make it feel like there are deadlines. But if your work is moved to the next sprint there's really no repercussion lol.", "created_utc": "1640817610.0", "edited": "False", "id": "hqgxeii", "is_submitter": "False", "link_id": "t3_rrkvnf", "parent_id": "t3_rrkvnf", "score": "3", "subreddit": "antiwork", "subreddit_id": "t5_2y77d"}, {"author": "JaevligFaen", "body": "Fake corporate drones who have long since lost their souls would feign grief in front of the rest of the company, when inside they feel nothing in fact maybe even relief if they were planning to fire you.", "created_utc": "1640817532.0", "edited": "False", "id": "hqgx7rp", "is_submitter": "False", "link_id": "t3_rrkvpi", "parent_id": "t3_rrkvpi", "score": "3", "subreddit": "antiwork", "subreddit_id": "t5_2y77d"}, {"author": "JaevligFaen", "body": "Ah that's amazing I never knew that. So then, I presume you have quit your job and live like a nomad then, surviving only off nature. Amazing you have internet and a computer out in the forest.", "created_utc": "1640816744.0", "edited": "False", "id": "hqgv93e", "is_submitter": "False", "link_id": "t3_rr9raz", "parent_id": "t1_hqgqx6w", "score": "-2", "subreddit": "antiwork", "subreddit_id": "t5_2y77d"}, {"author": "JaevligFaen", "body": "Yes, but in my opinion this is best addressed by tackling the underlying issue which is inflation. It baffles me that we still use a currency that is manipulated by rich and corrupt central bankers who have absolutely no remorse for the average person.", "created_utc": "1640816459.0", "edited": "False", "id": "hqgujm0", "is_submitter": "False", "link_id": "t3_rr7m8u", "parent_id": "t1_hqgfwk6", "score": "0", "subreddit": "antiwork", "subreddit_id": "t5_2y77d"}, {"author": "JaevligFaen", "body": "I agree these real estate giants are doing a lot of things that screw us over, we should boycott them. Housing and food should be affordable. But I don't think \"we\" are capable of feeding and housing any significant number of the population. This line of thinking is how we get skyrocketing rents in the most liberal parts of the US.", "created_utc": "1640816096.0", "edited": "False", "id": "hqgtn4m", "is_submitter": "False", "link_id": "t3_rr6sek", "parent_id": "t1_hqgfo9b", "score": "1", "subreddit": "antiwork", "subreddit_id": "t5_2y77d"}, {"author": "JaevligFaen", "body": "The idea that we should be \"full time students\" well into our 20s is absurd. It is unnecessary expense that goes nowhere. The only reason people do it is for a diploma that is quickly becoming worthless. If it were about education, they would take free online classes or go to the library.", "created_utc": "1640811451.0", "edited": "False", "id": "hqghohh", "is_submitter": "False", "link_id": "t3_rr2j82", "parent_id": "t1_hqfx37r", "score": "1", "subreddit": "antiwork", "subreddit_id": "t5_2y77d"}, {"author": "JaevligFaen", "body": "Ok then my colleagues and I will form a coalition to \"tax\" you at a rate of 10% your income. It won't be illegal because it will be official with documents and everything. Then we'll spend 1% of it buying you things you don't need, call it even, and enjoy the other 9% on whatever we want. Super!", "created_utc": "1640810857.0", "edited": "False", "id": "hqgg4o8", "is_submitter": "False", "link_id": "t3_rr9jod", "parent_id": "t1_hqfq7kd", "score": "1", "subreddit": "antiwork", "subreddit_id": "t5_2y77d"}, {"author": "JaevligFaen", "body": "The news and media pushing these agendas only do it because they profit from your fear. Turn off the tv and live your life. We could die from a natural disaster, asteroid impact, etc. No point in dwelling on this shit.", "created_utc": "1640810741.0", "edited": "False", "id": "hqgftso", "is_submitter": "False", "link_id": "t3_rqzp8a", "parent_id": "t1_hqfpq2o", "score": "0", "subreddit": "antiwork", "subreddit_id": "t5_2y77d"}, {"author": "JaevligFaen", "body": "Nobody in that position should be paying 15% taxes. If it weren't for the taxes it would be perfectly manageable. Not everybody lives in New York or San Francisco. Most of the world is affordable with some basic financial literacy and restraint from buying stupid shit. If the US is too expensive move to Mexico. I'm serious. Residence permits are easy and it's a beautiful country full of cool people and delicious food. Rent is below $500/mo. \n\nToo many people think they need to \"make it in the big city\" and bitch that they can't afford it on minimum wage. Yeah no shit lol", "created_utc": "1640810647.0", "edited": "False", "id": "hqgfkvj", "is_submitter": "False", "link_id": "t3_rr2j82", "parent_id": "t1_hqfpfn1", "score": "0", "subreddit": "antiwork", "subreddit_id": "t5_2y77d"}, {"author": "JaevligFaen", "body": "Who is stopping you?", "created_utc": "1640810306.0", "edited": "False", "id": "hqgeoox", "is_submitter": "False", "link_id": "t3_rra53y", "parent_id": "t3_rra53y", "score": "1", "subreddit": "antiwork", "subreddit_id": "t5_2y77d"}, {"author": "JaevligFaen", "body": "\\> We're certainly capable of feeding and housing the population\n\nFunny how when it comes to this topic, you people use the word \"we\"\n\nWhen in reality it's the CEOs and all the people you despise who actually fund these social programs.", "created_utc": "1640810106.0", "edited": "False", "id": "hqge5zl", "is_submitter": "False", "link_id": "t3_rr6sek", "parent_id": "t3_rr6sek", "score": "1", "subreddit": "antiwork", "subreddit_id": "t5_2y77d"}, {"author": "JaevligFaen", "body": "She's right though", "created_utc": "1640809459.0", "edited": "False", "id": "hqgci0h", "is_submitter": "False", "link_id": "t3_rqqi9g", "parent_id": "t3_rqqi9g", "score": "1", "subreddit": "antiwork", "subreddit_id": "t5_2y77d"}, {"author": "JaevligFaen", "body": "If you run a business, and your employee brings your company $15 per hour, would you pay him $16 per hour?", "created_utc": "1640809350.0", "edited": "False", "id": "hqgc7pk", "is_submitter": "False", "link_id": "t3_rqx6yn", "parent_id": "t3_rqx6yn", "score": "1", "subreddit": "antiwork", "subreddit_id": "t5_2y77d"}, {"author": "JaevligFaen", "body": "Floating out in the ocean and eating fruit and hanging out??\n\nOk sure lol. What happens when the fruit runs out? Who's gonna plant the fruit trees? Are you gonna pay them? Do they get a paid lunch? This has to be the dumbest and most short-sighted post I've ever seen LOL", "created_utc": "1640808196.0", "edited": "False", "id": "hqg98eg", "is_submitter": "False", "link_id": "t3_rr9raz", "parent_id": "t3_rr9raz", "score": "-11", "subreddit": "antiwork", "subreddit_id": "t5_2y77d"}, {"author": "JaevligFaen", "body": "My parents didn't know I existed before I was born and won't know I existed when they die", "created_utc": "1640801515.0", "edited": "False", "id": "hqfrx3c", "is_submitter": "False", "link_id": "t3_rqywbe", "parent_id": "t3_rqywbe", "score": "1", "subreddit": "antiwork", "subreddit_id": "t5_2y77d"}, {"author": "JaevligFaen", "body": "Higher minimum wage only makes it harder for younger people to find work. So they go to college instead and take out huge loans at a young age... Not a good cycle we're in here. Perpetuated by the idea that a \"living wage\" constitutes enough cash to support an entire family. $10/h is far more than enough for a young adult to live if they aren't spending their income on dumb bullshit.", "created_utc": "1640799586.0", "edited": "False", "id": "hqfmvll", "is_submitter": "False", "link_id": "t3_rr2j82", "parent_id": "t3_rr2j82", "score": "-5", "subreddit": "antiwork", "subreddit_id": "t5_2y77d"}, {"author": "JaevligFaen", "body": "Don't just dream. Make it happen.", "created_utc": "1640798973.0", "edited": "False", "id": "hqfla0s", "is_submitter": "False", "link_id": "t3_rr4565", "parent_id": "t3_rr4565", "score": "1", "subreddit": "antiwork", "subreddit_id": "t5_2y77d"}, {"author": "JaevligFaen", "body": "Inflation *is* an increase in the supply of money. Rising prices is a side effect of inflation.", "created_utc": "1640798906.0", "edited": "False", "id": "hqfl3oy", "is_submitter": "False", "link_id": "t3_rr7m8u", "parent_id": "t1_hqenujs", "score": "4", "subreddit": "antiwork", "subreddit_id": "t5_2y77d"}, {"author": "JaevligFaen", "body": "Sounds like pointless fear mongering", "created_utc": "1640798834.0", "edited": "False", "id": "hqfkwsv", "is_submitter": "False", "link_id": "t3_rqzp8a", "parent_id": "t3_rqzp8a", "score": "-1", "subreddit": "antiwork", "subreddit_id": "t5_2y77d"}, {"author": "JaevligFaen", "body": "Taxation is theft regardless of where it goes", "created_utc": "1640798681.0", "edited": "False", "id": "hqfkigr", "is_submitter": "False", "link_id": "t3_rr9jod", "parent_id": "t3_rr9jod", "score": "-7", "subreddit": "antiwork", "subreddit_id": "t5_2y77d"}, {"author": "JaevligFaen", "body": "The problem with relying so much on the vaccine though, it's a static solution to a dynamic problem. In other words, the virus changes on its own, while it takes months/years of research to develop vaccines. Hoping for a new vaccine to be available in time for the next vaccine-resistant mutation is simply futile. \n\nThe only thing we effectively have left that we can truly rely on is the immune system, which is dynamic like the virus. Yes, not everyone's immune system is equal, and some will be at a disadvantage, but that's the reality of life. People are disadvantaged in all kinds of ways, some people are born into parts of the world where they witness death every day. Death is an inevitable part of life, and I think in the west we've forgotten that. We want to be immortal, which is crazy because that's impossible.", "created_utc": "1638390239.0", "edited": "False", "id": "hmu982a", "is_submitter": "False", "link_id": "t3_r4isl9", "parent_id": "t1_hmiko8p", "score": "1", "subreddit": "news", "subreddit_id": "t5_2qh3l"}, {"author": "JaevligFaen", "body": "Kingdom Hearts combat is very fast-paced and cloud gaming is known to have input lag. \n\nBuy it if you want, but just be aware that it will be a VERY frustrating experience. You have been warned.", "created_utc": "1633890962.0", "edited": "False", "id": "hg4t58l", "is_submitter": "False", "link_id": "t3_q58ycw", "parent_id": "t1_hg3ul45", "score": "10", "subreddit": "KingdomHearts", "subreddit_id": "t5_2s3jo"}, {"author": "JaevligFaen", "body": "It won't even be playable with the input lag. \n\nGame streaming might be acceptable for turn-based games, but all KH games are too quick-paced for this. It will be utterly unplayable. \n\nDO NOT BUY", "created_utc": "1633890218.0", "edited": "False", "id": "hg4rc5k", "is_submitter": "False", "link_id": "t3_q58ycw", "parent_id": "t3_q58ycw", "score": "5", "subreddit": "KingdomHearts", "subreddit_id": "t5_2s3jo"}, {"author": "JaevligFaen", "body": "Having trouble understanding your comment, especially the last part. \n\nYes, tax havens have to fund their governments too. Why is it when a country makes an effort to increase tourism to improve the economy, that's all well and good, but if a country lowers it's taxes to bring in more talented people, that's considered \"evil\"?", "created_utc": "1593191876.0", "edited": "False", "id": "fw2xskt", "is_submitter": "False", "link_id": "t3_hfk7ti", "parent_id": "t1_fw131s8", "score": "1", "subreddit": "AskEurope", "subreddit_id": "t5_2uayg"}, {"author": "JaevligFaen", "body": "Are you trying to tell me that tax havens don't have roads and buses? \n\nSure they might not have subsidized healthcare and huge amounts of social benefits, but maybe these are things that some people don't want to pay for. If you want to fine, but don't force others to be a part of a system they didn't chose.", "created_utc": "1593125837.0", "edited": "False", "id": "fw06yy2", "is_submitter": "False", "link_id": "t3_hfk7ti", "parent_id": "t1_fvzb8ki", "score": "-3", "subreddit": "AskEurope", "subreddit_id": "t5_2uayg"}, {"author": "JaevligFaen", "body": "So, by the pure imposition of being born, you are locked into a contract you never agreed to, and mustn't escape it because \"that's how society works here.\" Really solid logic there.", "created_utc": "1593109742.0", "edited": "False", "id": "fvza2ux", "is_submitter": "False", "link_id": "t3_hfk7ti", "parent_id": "t1_fvyzt9p", "score": "-8", "subreddit": "AskEurope", "subreddit_id": "t5_2uayg"}, {"author": "JaevligFaen", "body": "Yeah how dare somebody keep more of their own money", "created_utc": "1593102695.0", "edited": "False", "id": "fvyvgef", "is_submitter": "False", "link_id": "t3_hfk7ti", "parent_id": "t1_fvy8tvc", "score": "-28", "subreddit": "AskEurope", "subreddit_id": "t5_2uayg"}, {"author": "JaevligFaen", "body": "Ah thank you!! Somehow I didn't see that answer on that page before!\n\nThat is great news.", "created_utc": "1593102533.0", "edited": "False", "id": "fvyv4dd", "is_submitter": "True", "link_id": "t3_hepdpy", "parent_id": "t1_fvy4s69", "score": "1", "subreddit": "TillSverige", "subreddit_id": "t5_2rwl7"}, {"author": "JaevligFaen", "body": "Thanks for the link. Darn. It seems no one is 100% certain. But I guess it's safe to assume that if I start working in Sweden, I will have to take my product offline.", "created_utc": "1593024518.0", "edited": "False", "id": "fvvna7k", "is_submitter": "True", "link_id": "t3_hepdpy", "parent_id": "t1_fvtnkd4", "score": "1", "subreddit": "TillSverige", "subreddit_id": "t5_2rwl7"}, {"author": "JaevligFaen", "body": "* Never tried GrapheneOS\n* You can use the Google Play Store\n* Camera, gallery, etc apps are included with LineageOS install\n* You will probably have slightly more storage than you do now\n* LineageOS is Android, but the version of Android you have on your phone may be closed source, meaning any malicious spyware/bloatware can be hiding in there. LineageOS is open-source. \n* Your phone number will not change, and your carrier won't change. \n\nJust be aware that it will be similar to a factory reset, you will lose anything currently on the phone. Contacts, pictures, text history, etc. So backup anything you want to save. There are apps available for backing up text history and stuff like that.", "created_utc": "1592969783.0", "edited": "False", "id": "fvted7v", "is_submitter": "False", "link_id": "t3_herppj", "parent_id": "t3_herppj", "score": "1", "subreddit": "LineageOS", "subreddit_id": "t5_3htpk"}, {"author": "JaevligFaen", "body": "Ok a swastika is one thing, but isn't a bit of a stretch to make that connection? I mean, yield signs are also upside down red triangles...", "created_utc": "1592966694.0", "edited": "False", "id": "fvt96rf", "is_submitter": "False", "link_id": "t3_hempz5", "parent_id": "t1_fvsvhus", "score": "-4", "subreddit": "insanepeoplefacebook", "subreddit_id": "t5_3acf2"}, {"author": "JaevligFaen", "body": "Maybe I'm weird but my backspace key would be through the roof", "created_utc": "1592957239.0", "edited": "False", "id": "fvssww4", "is_submitter": "False", "link_id": "t3_heeaax", "parent_id": "t3_heeaax", "score": "1", "subreddit": "interestingasfuck", "subreddit_id": "t5_2qhsa"}, {"author": "JaevligFaen", "body": "Nazi symbols? Like a swastika???? Wow...", "created_utc": "1592956436.0", "edited": "False", "id": "fvsrgy1", "is_submitter": "False", "link_id": "t3_hempz5", "parent_id": "t1_fvsnjj6", "score": "3", "subreddit": "insanepeoplefacebook", "subreddit_id": "t5_3acf2"}, {"author": "JaevligFaen", "body": "This is working against natural selection", "created_utc": "1589567219.0", "edited": "False", "id": "fqqkpw6", "is_submitter": "False", "link_id": "t3_f6jc45", "parent_id": "t3_f6jc45", "score": "1", "subreddit": "interestingasfuck", "subreddit_id": "t5_2qhsa"}, {"author": "JaevligFaen", "body": "Taxes hold far more weight than votes. \n\nIf I don't like my local/state/federal government, I will move and pay taxes somewhere else.", "created_utc": "1583363427.0", "edited": "False", "id": "fjiacl8", "is_submitter": "False", "link_id": "t3_fdf5ur", "parent_id": "t3_fdf5ur", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "JaevligFaen", "body": "Best I heard of was printing the answers on a waterbottle label", "created_utc": "1583196694.0", "edited": "False", "id": "fjbmks4", "is_submitter": "False", "link_id": "t3_fcdi6a", "parent_id": "t3_fcdi6a", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "JaevligFaen", "body": "Yes, and never download RAM over wifi", "created_utc": "1582762775.0", "edited": "False", "id": "fivlky8", "is_submitter": "False", "link_id": "t3_f9yoys", "parent_id": "t1_fiv7i30", "score": "1", "subreddit": "raspberry_pi", "subreddit_id": "t5_2syto"}, {"author": "JaevligFaen", "body": "In Norwegian, poison and married are both \"gift\"", "created_utc": "1582762223.0", "edited": "False", "id": "fivknt4", "is_submitter": "False", "link_id": "t3_f9te21", "parent_id": "t3_f9te21", "score": "1", "subreddit": "AskEurope", "subreddit_id": "t5_2uayg"}, {"author": "JaevligFaen", "body": "Himmel is the same in Norwegian", "created_utc": "1582761391.0", "edited": "False", "id": "fivj98t", "is_submitter": "False", "link_id": "t3_f9te21", "parent_id": "t1_fitzxb1", "score": "1", "subreddit": "AskEurope", "subreddit_id": "t5_2uayg"}, {"author": "JaevligFaen", "body": "Exclusives are just an excuse to force fans of a game to buy an additional gaming machine.", "created_utc": "1582760940.0", "edited": "False", "id": "fivih67", "is_submitter": "False", "link_id": "t3_f9uow4", "parent_id": "t1_fiv3s9p", "score": "2", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "JaevligFaen", "body": "Console-exclusivity is what I hate, not consoles themselves.", "created_utc": "1582758668.0", "edited": "False", "id": "five1ih", "is_submitter": "False", "link_id": "t3_f9uow4", "parent_id": "t1_fitvk03", "score": "6", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "JaevligFaen", "body": "Just wait for the name-calling reply that doesn't refute his points and gets 100 upvotes", "created_utc": "1582564583.0", "edited": "False", "id": "finjp15", "is_submitter": "False", "link_id": "t3_f8or7q", "parent_id": "t1_finh9tq", "score": "-1", "subreddit": "insanepeoplefacebook", "subreddit_id": "t5_3acf2"}, {"author": "JaevligFaen", "body": "<1min youtube videos of people doing something stupid/embarrassing/injuring themselves.", "created_utc": "1582333826.0", "edited": "False", "id": "fibzfxu", "is_submitter": "False", "link_id": "t3_f7ib73", "parent_id": "t3_f7ib73", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "JaevligFaen", "body": "Only $300 if he played nonstop without sleeping", "created_utc": "1582145575.0", "edited": "False", "id": "fi4oz8j", "is_submitter": "False", "link_id": "t3_f6bnck", "parent_id": "t1_fi3tc5t", "score": "3", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "JaevligFaen", "body": "The only correct opinion about Skyrim", "created_utc": "1582145399.0", "edited": "False", "id": "fi4onq9", "is_submitter": "False", "link_id": "t3_f6bnck", "parent_id": "t1_fi42xp7", "score": "-1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "JaevligFaen", "body": "On a federal level, you have to file but only pay on income above \\~$110k\n\nOn a state level, depends on which state you're from. California residents pay up to 13% state tax, which can really screw over Californians living abroad. But Washington, Texas, Alaska, Florida, Nevada, (among other) residents don't have to worry about paying anything on a state level.", "created_utc": "1582048924.0", "edited": "False", "id": "fi11rel", "is_submitter": "False", "link_id": "t3_ecc6j4", "parent_id": "t1_fbbly3w", "score": "1", "subreddit": "AskEurope", "subreddit_id": "t5_2uayg"}, {"author": "JaevligFaen", "body": "Education", "created_utc": "1581729753.0", "edited": "False", "id": "fhnobie", "is_submitter": "False", "link_id": "t3_f3ricx", "parent_id": "t3_f3ricx", "score": "2", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "JaevligFaen", "body": "Is there a subreddit for this kind of thing? I freaking love these types of creative innovations, like fiber optic cables that use colors as different data channels.", "created_utc": "1581644288.0", "edited": "False", "id": "fhjem98", "is_submitter": "False", "link_id": "t3_f3hcen", "parent_id": "t3_f3hcen", "score": "1", "subreddit": "interestingasfuck", "subreddit_id": "t5_2qhsa"}, {"author": "JaevligFaen", "body": "Live free or die.", "created_utc": "1581643706.0", "edited": "False", "id": "fhjdsmm", "is_submitter": "False", "link_id": "t3_f3j3oq", "parent_id": "t3_f3j3oq", "score": "1", "subreddit": "interestingasfuck", "subreddit_id": "t5_2qhsa"}, {"author": "JaevligFaen", "body": "Its more of an echo chamber. \n\nI think people are aware of this but yeah, a website with this sort of voting system inevitably becomes an echo chamber.", "created_utc": "1581642696.0", "edited": "False", "id": "fhjcdhn", "is_submitter": "False", "link_id": "t3_f3dcze", "parent_id": "t3_f3dcze", "score": "2", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "JaevligFaen", "body": "How did you find out it's Yiddish? I have a similar name, might want to find out about it.", "created_utc": "1581540907.0", "edited": "False", "id": "fhfcz4k", "is_submitter": "False", "link_id": "t3_f2pe4o", "parent_id": "t1_fheszvd", "score": "2", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "JaevligFaen", "body": "Not an extension (as far as I know) but youtube-dlg is open-source and great for downloading youtube videos.", "created_utc": "1581466216.0", "edited": "False", "id": "fhcmqqr", "is_submitter": "False", "link_id": "t3_f298x0", "parent_id": "t3_f298x0", "score": "2", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "JaevligFaen", "body": "\"The grass is always greener...\"\n\nThis phrase is stupid because it implies that every place is the same. Some places are cheaper, some are warmer/colder, some have lower taxes, some have a different culture. Wanting to move based on your preferences doesn't make you foolish at all.", "created_utc": "1580931917.0", "edited": "False", "id": "fgmttik", "is_submitter": "False", "link_id": "t3_ez0c7z", "parent_id": "t3_ez0c7z", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "JaevligFaen", "body": "But if the goal is to deceive customers (putting the price in small font and removing the currency sign), why not just remove it altogether?", "created_utc": "1580860585.0", "edited": "False", "id": "fgk9rm4", "is_submitter": "False", "link_id": "t3_eypuos", "parent_id": "t1_fgjykfc", "score": "2", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "JaevligFaen", "body": "Not only high taxes, but overly complicated filing procedures. (IE you owe us $\\_\\_\\_. Figure it out and if you get it wrong you go to jail)", "created_utc": "1580845430.0", "edited": "False", "id": "fgjjnqz", "is_submitter": "False", "link_id": "t3_eys72m", "parent_id": "t3_eys72m", "score": "2", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "JaevligFaen", "body": "Remember that it's an echo chamber and people with other opinions aren't necessarily dumber than you are.", "created_utc": "1580845001.0", "edited": "False", "id": "fgjixlt", "is_submitter": "False", "link_id": "t3_eytfzs", "parent_id": "t3_eytfzs", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "JaevligFaen", "body": "A sunday-school teacher told me it's okay to \"question\" the things they teach. As in, it's okay to think freely about whether or not there is a \"higher power\". Up until then, I had been living in fear of my own thoughts getting me in trouble. \n\nDidn't take long after that.", "created_utc": "1580844615.0", "edited": "False", "id": "fgjia6g", "is_submitter": "False", "link_id": "t3_eyp9gv", "parent_id": "t3_eyp9gv", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "JaevligFaen", "body": "Got a great job, student loans should be paid off by the end of this summer, made some great friends, found a place to live that's close enough to work that I walk, and it's close to the forest where I can go jogging. Honestly this has been the best couple months ever and I'm super optimistic about the future.", "created_utc": "1580843862.0", "edited": "False", "id": "fgjh0g1", "is_submitter": "False", "link_id": "t3_eyodfi", "parent_id": "t3_eyodfi", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "JaevligFaen", "body": "There is something really iconic about that scene", "created_utc": "1580843154.0", "edited": "False", "id": "fgjfu97", "is_submitter": "False", "link_id": "t3_eyszd2", "parent_id": "t1_fgj6sdw", "score": "24", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "JaevligFaen", "body": "Electric guitar with just the right amount of distortion is my favorite", "created_utc": "1580843061.0", "edited": "False", "id": "fgjfonu", "is_submitter": "False", "link_id": "t3_eysjz6", "parent_id": "t3_eysjz6", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "JaevligFaen", "body": "Why even keep the price on the menu?", "created_utc": "1580840992.0", "edited": "False", "id": "fgjc7b0", "is_submitter": "False", "link_id": "t3_eypuos", "parent_id": "t1_fgiquiz", "score": "-11", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "JaevligFaen", "body": "Southern California.\n\nHollywood branding has made it out to be a beach paradise, but that reality died out a few decades ago. Now it's just a crowded, expensive concrete jungle. Plenty of friendly people, but a lot of superficial/pretentious people too.", "created_utc": "1580779256.0", "edited": "False", "id": "fgh8nbd", "is_submitter": "False", "link_id": "t3_ey7at1", "parent_id": "t3_ey7at1", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "JaevligFaen", "body": "Having actual skills is a much more reliable way to make a living than having a shiny piece of paper.", "created_utc": "1580776069.0", "edited": "False", "id": "fgh3v9h", "is_submitter": "False", "link_id": "t3_ey7w1i", "parent_id": "t3_ey7w1i", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "JaevligFaen", "body": "Slapping a cop to get a free ride back into town", "created_utc": "1580500241.0", "edited": "False", "id": "fg4biu1", "is_submitter": "False", "link_id": "t3_ewpxbn", "parent_id": "t3_ewpxbn", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "JaevligFaen", "body": "I used a cheap hard drive dock that has RAID switches built in", "created_utc": "1580436516.0", "edited": "False", "id": "fg21mxt", "is_submitter": "False", "link_id": "t3_esfuur", "parent_id": "t1_ffb9ipi", "score": "2", "subreddit": "raspberry_pi", "subreddit_id": "t5_2syto"}, {"author": "JaevligFaen", "body": "Nice. I have a similar setup but with a separate HDD dock (with its own power supply) and two 3.5\" drives in RAID1. I'm using Samba to stream videos, also considering putting ps3mediaserver on there.", "created_utc": "1579740995.0", "edited": "False", "id": "ffaotrj", "is_submitter": "False", "link_id": "t3_esfuur", "parent_id": "t3_esfuur", "score": "3", "subreddit": "raspberry_pi", "subreddit_id": "t5_2syto"}, {"author": "JaevligFaen", "body": "The Expanse and Impulse\n\nEvery time I catch up to the latest episode I feel so empty because I know it will be another year before more come out. At least they are still in production.", "created_utc": "1579713516.0", "edited": "False", "id": "ff9i4w5", "is_submitter": "False", "link_id": "t3_es76uw", "parent_id": "t3_es76uw", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "JaevligFaen", "body": "(Modern Rock)\n\nThere was a band called \"White Light Riot\" that I got into around 6 or 7 years ago, still listen to their albums today. They broke up long ago, but their stuff is phenomenal.", "created_utc": "1578599980.0", "edited": "False", "id": "fdo6zkd", "is_submitter": "False", "link_id": "t3_em80cp", "parent_id": "t3_em80cp", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "JaevligFaen", "body": "\\-Shia Labeouf", "created_utc": "1578599600.0", "edited": "False", "id": "fdo67vv", "is_submitter": "False", "link_id": "t3_em7uj0", "parent_id": "t1_fdmu0mp", "score": "2", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "JaevligFaen", "body": "Veritasium did this on youtube, very interesting experiment. \n\nHe created a situation where the odds were 100x higher for the stranger to win, than lose. And still no one chose to play. Wish I could remember the video title.", "created_utc": "1578599208.0", "edited": "False", "id": "fdo5f6n", "is_submitter": "False", "link_id": "t3_em7uj0", "parent_id": "t1_fdnz0xe", "score": "3", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "JaevligFaen", "body": "Freedom", "created_utc": "1578598155.0", "edited": "False", "id": "fdo3e1q", "is_submitter": "False", "link_id": "t3_em8ht1", "parent_id": "t3_em8ht1", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "JaevligFaen", "body": "\"A vote for Johnson is a vote for Trump\" -Democrats\n\n\"A vote for Johnson is a vote for Clinton\" -Republicans", "created_utc": "1576883419.0", "edited": "False", "id": "fbhvijw", "is_submitter": "False", "link_id": "t3_edctaj", "parent_id": "t1_fbhlft3", "score": "106", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "JaevligFaen", "body": "r/politics for being an echo-chamber\n\nEven moderately right-wing ideas immediately disappear in the void of downvoted comments", "created_utc": "1576871021.0", "edited": "False", "id": "fbhdedd", "is_submitter": "False", "link_id": "t3_edb7kr", "parent_id": "t3_edb7kr", "score": "2", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "JaevligFaen", "body": "People who leave trash in their car, then act like it's not their responsibility when it tumbles out their open door.", "created_utc": "1576802760.0", "edited": "False", "id": "fbf6eyp", "is_submitter": "False", "link_id": "t3_ecytre", "parent_id": "t3_ecytre", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "JaevligFaen", "body": "I'm more sick of racebaiting idiots who make bad decisions and blame the rich for their problems.", "created_utc": "1576788888.0", "edited": "False", "id": "fbemc0q", "is_submitter": "False", "link_id": "t3_ecrfnc", "parent_id": "t1_fbelywb", "score": "0", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "JaevligFaen", "body": "Maximum transparency. We fund this thing, we should know what it's doing.", "created_utc": "1576788680.0", "edited": "False", "id": "fbem032", "is_submitter": "False", "link_id": "t3_ect6gu", "parent_id": "t3_ect6gu", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "JaevligFaen", "body": "It's frustrating when you realize a lot of these games just need to be compiled differently, but the source code is locked in a hard drive somewhere so unstable emulation becomes the only option", "created_utc": "1576788585.0", "edited": "False", "id": "fbelupm", "is_submitter": "False", "link_id": "t3_ecrfnc", "parent_id": "t1_fbekh15", "score": "3", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "JaevligFaen", "body": "Most of that wealth is tied up in shares of the company, which he's not allowed to sell. And even if he did, he would risk harming the well-being of his employees. Dumping shares like that would result in people losing their jobs, thousands of people who support thousands of other people. \n\nNet worth =/= cash in bank", "created_utc": "1576788018.0", "edited": "False", "id": "fbekz5p", "is_submitter": "False", "link_id": "t3_ecrfnc", "parent_id": "t1_fbecioz", "score": "0", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "JaevligFaen", "body": "I like the way you think. \n\nI'd go even further and bribe the publishers of all of my favorite console exclusive games to port them (properly) to PC.", "created_utc": "1576787570.0", "edited": "False", "id": "fbeka36", "is_submitter": "False", "link_id": "t3_ecrfnc", "parent_id": "t1_fbedhvo", "score": "2", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "JaevligFaen", "body": "I'd buy a small country like Tuvalu or Liechtenstein and run my own experimental transparent government that consistently rolls out small policy changes or new experimental policies, then depending on citizen feedback after a certain amount of time either rolls the changes back or keeps them and goes further.", "created_utc": "1576786213.0", "edited": "False", "id": "fbei54v", "is_submitter": "False", "link_id": "t3_ecrfnc", "parent_id": "t3_ecrfnc", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "JaevligFaen", "body": "If all A's are B's, and all B's are C's, can an A be a C?", "created_utc": "1576628157.0", "edited": "False", "id": "fb934gg", "is_submitter": "False", "link_id": "t3_ec2inn", "parent_id": "t3_ec2inn", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "JaevligFaen", "body": "Jun Senoue, the guitarist, has several albums called \"The Works\" 1, 2, and 3.\n\nDefinitely worth checking out", "created_utc": "1576606017.0", "edited": "False", "id": "fb84kwe", "is_submitter": "False", "link_id": "t3_ebu8sc", "parent_id": "t1_fb7ctp0", "score": "5", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "JaevligFaen", "body": "10am PST tomorrow", "created_utc": "1576516371.0", "edited": "False", "id": "fb4vs24", "is_submitter": "False", "link_id": "t3_ebgzbj", "parent_id": "t3_ebgzbj", "score": "1", "subreddit": "windowsphone", "subreddit_id": "t5_2r71o"}]