[{"author": "Jen2603", "body": "It definitely depends on context. I personally switch between those phrases a lot. Examples of what I would naturally say (ticks and crosses are just to show what sounds more natural from me, i’m not saying these sentences are actually incorrect)\n\n“I’ll see you at Halloween / at Christmas” ✅\n“I’ll see you on Halloween” ✅\n“I’ll see you on Christmas” ❌\n\n“Her birthday is at Halloween / Christmas” ❌\n“Her birthday is on Halloween / Christmas” ✅\n\n“I’ll come visit at Halloween” ❌\n“I’ll come visit on Halloween” ✅\n\n“I’ll come visit at Christmas” ✅\n“I’ll come visit on Christmas” ❌\n\nThose were just a handful of examples and there’s genuinely no reason why i wouldn’t say those marked with an ❌ other than the fact i just tried to say them out loud and realised…yep i’d never naturally say that. Am i British? Yes. Would every British person agree with my examples? Probably not. It’s just a personal speech habit thing :)", "created_utc": "1664971680.0", "edited": "False", "id": "ir51xwj", "is_submitter": "False", "link_id": "t3_xw8jwb", "parent_id": "t3_xw8jwb", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Jen2603", "body": "I’ve had it for a couple years now along with Lingodeer+ premium and i love it! I use it for Korean though and things like Duolingo are infamously bad for languages like Korean, Japanese etc so i found Lingodeer to be a great substitute. It’s helped me a lot and i’m still using it daily! \n\nThe main things i love about it are the lesson pre-notes which are laid out in a really clear way, and also the super clear audio. The review section is really good too with audio flashcards, vocab tests, grammar tests, short quizzes etc. Again, this is all for Korean so i don’t know how it compares with French, but i imagine it would be very similar.\n\nIt’s definitely not a resource that you can use alone with nothing else, but i think that’s the case for anything when it comes to language learning. So if you have realistic expectations of how much it can teach you then i 100% recommend :)", "created_utc": "1664365510.0", "edited": "False", "id": "iq82h06", "is_submitter": "False", "link_id": "t3_xq4ef9", "parent_id": "t3_xq4ef9", "score": "6", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Jen2603", "body": "I definitely recommend vocab apps as TTMIK is great at grammar but not so much vocab. I use Drops and i also write down a lot of vocab that i come across from native content and i put it all into Anki :)\n\nI also recommend Korean Grammar In Use. Even though TTMIK focuses on grammar sometimes it’s nice to have another resource that might explain the grammar in a slightly different way if you didn’t fully understand the first explanation.\n\nApart from that Youtube is great! Anything you’re curious about there’s bound to be plenty of videos on. I also love the fact that I’ll get recommended videos on stuff i never even considered so i learn more that way! Good luck :)", "created_utc": "1664365030.0", "edited": "False", "id": "iq81p4v", "is_submitter": "False", "link_id": "t3_xpz4w1", "parent_id": "t3_xpz4w1", "score": "3", "subreddit": "Korean", "subreddit_id": "t5_2rd8q"}, {"author": "Jen2603", "body": "Oh awesome! Thanks for the info 😁 Would it be okay to set her loose in the garage? Don’t wanna abandon her back outside seeing as she’s seeking shelter and it’s still raining, but also not totally comfortable with having her free-roam the house :(", "created_utc": "1662666624.0", "edited": "False", "id": "inmqwqf", "is_submitter": "True", "link_id": "t3_x99fuf", "parent_id": "t1_inmpyv8", "score": "1", "subreddit": "whatsthisbug", "subreddit_id": "t5_2s3bw"}, {"author": "Jen2603", "body": "Oh my goodness that was so quick!! Thank you so much!! I’m so grateful that you were able to identify despite the low quality picture 😅 Thank you again! :)", "created_utc": "1662666190.0", "edited": "False", "id": "inmprg5", "is_submitter": "True", "link_id": "t3_x99fuf", "parent_id": "t1_inmp2cf", "score": "1", "subreddit": "whatsthisbug", "subreddit_id": "t5_2s3bw"}, {"author": "Jen2603", "body": "Info is in the caption of the first picture :) I know the photos are blurry and i apologise, i was stood there for a while trying to get the camera to focus properly but he was too fast! \n\nGeographic Location: England,\nSize: Maybe 1.5cm length and 3-4mm width?,\nFound: In house", "created_utc": "1662665779.0", "edited": "1662666056.0", "id": "inmooeu", "is_submitter": "True", "link_id": "t3_x99fuf", "parent_id": "t3_x99fuf", "score": "1", "subreddit": "whatsthisbug", "subreddit_id": "t5_2s3bw"}, {"author": "Jen2603", "body": "I’d say go off how you feel. If you start feeling burnt out or start lacking in motivation then don’t ignore it and maybe try changing your routine and prioritising one of the languages. Everyone is different in what they can cope with. If you’re currently feeling comfortable with this routine and you still have motivation and you’re still progressing in all of your languages then i say keep at it :)", "created_utc": "1662544964.0", "edited": "False", "id": "infj8ja", "is_submitter": "False", "link_id": "t3_x7y6qb", "parent_id": "t3_x7y6qb", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Jen2603", "body": "When you’re at a high level i agree, but i think a lot of things (phrases etc) just take getting used to, especially for a beginner", "created_utc": "1662543258.0", "edited": "False", "id": "infh32p", "is_submitter": "False", "link_id": "t3_x7z5kl", "parent_id": "t3_x7z5kl", "score": "5", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Jen2603", "body": "That’s fine, i was only trying to make sure that incorrect advice wasn’t given to OP and that you knew that Neilmed is a 0.9% NaCl solution. That’s all :)", "created_utc": "1662471702.0", "edited": "False", "id": "inb9ngb", "is_submitter": "False", "link_id": "t3_x6k30t", "parent_id": "t1_inb979g", "score": "1", "subreddit": "PiercingAdvice", "subreddit_id": "t5_2rtn8"}, {"author": "Jen2603", "body": "Contact lens wash and wound cleansing wash are different. You’re right, contact lens solution is inappropriate to use for piercings but Neilmed is literally a wound wash. Sorry i think there was also a misunderstanding, by “pre-made” i meant by a company not by OP themselves (again, Neilmed as an example) so pre-made before OP buys it, not pre-made by them at home. I’m also recommending against OP making it themselves as this is the opposite of sterile or a proper concentration. But to reply to your other part, if the solution has additives / preservatives then it’s not 0.9% NaCl solution. Neilmed’s only ingredients are quite literally sterile water and sterile NaCl at a concentration of 0.9%. Therefore it’s a 0.9% NaCl solution. Contact lens solution has other ingredients and is not at a concentration of 0.9% (or mine isn’t at least) so i don’t think there’s any way that’s what OP was saying that they were using.\n\nAnyway, i feel like there’s a misunderstanding and that we’re actually on the same page. My original point was that i got the impression that OP was already using something like Neilmed where the only ingredients are water and NaCl at a concentration of 0.9%, and the only reason i commented was because i didn’t want them to read your comment and think they shouldn’t be using it. If they’re using something else then yes of course it should be tossed, but saying “putting NaCl solution near it will cause irritation” could cause OP to misunderstand. If you’d said “make sure your NaCl solution is sterile and ONLY contains water and NaCl at a conc of 0.9% otherwise it’ll cause irritation” then i totally agree.", "created_utc": "1662470908.0", "edited": "False", "id": "inb7xav", "is_submitter": "False", "link_id": "t3_x6k30t", "parent_id": "t1_inb5z9w", "score": "0", "subreddit": "PiercingAdvice", "subreddit_id": "t5_2rtn8"}, {"author": "Jen2603", "body": "If it’s NaCl solution then that’s the same thing as saline aftercare. Sodium Chloride is simply salt, so a salt solution aka saline. If OP is specifying that it’s 0.9% then i’m assuming it’s pre-made and sterile (e.g Neilmed) otherwise they’d have no way of knowing the concentration accurately. I definitely agree with all your other advice / questions though!", "created_utc": "1662454546.0", "edited": "False", "id": "inaicl8", "is_submitter": "False", "link_id": "t3_x6k30t", "parent_id": "t1_in7a1g2", "score": "1", "subreddit": "PiercingAdvice", "subreddit_id": "t5_2rtn8"}, {"author": "Jen2603", "body": "[https://kpop.fandom.com/wiki/Harua](https://kpop.fandom.com/wiki/Harua) In this picture especially he really looks like him to me! I think it’s their mouth shape? 😭", "created_utc": "1662102343.0", "edited": "False", "id": "imrnap4", "is_submitter": "False", "link_id": "t3_x38o8n", "parent_id": "t1_imrb31p", "score": "1", "subreddit": "AndAudition", "subreddit_id": "t5_5a7u6p"}, {"author": "Jen2603", "body": "Harua and Soobin! Soobin is my ult so i was so surprised when i saw Harua for the first time! I hope it’s not just me that thinks this aha", "created_utc": "1662061285.0", "edited": "False", "id": "imp9c98", "is_submitter": "False", "link_id": "t3_x38o8n", "parent_id": "t3_x38o8n", "score": "3", "subreddit": "AndAudition", "subreddit_id": "t5_5a7u6p"}, {"author": "Jen2603", "body": "Do you know what kind of threading it was? (external, internal or threadless) And were you ever checking the tightness? I have internally threaded earrings and i check the tightness every night as they seem to loosen over time. I’m sure if i left them without tightening them for a week+ that they’d unscrew themselves so just a thought! (I’ve also seen it in aftercare instructions that you should check the tightness of all jewellery regularly)", "created_utc": "1661688586.0", "edited": "False", "id": "im4aiv7", "is_submitter": "False", "link_id": "t3_wztejw", "parent_id": "t1_im48nju", "score": "3", "subreddit": "PiercingAdvice", "subreddit_id": "t5_2rtn8"}, {"author": "Jen2603", "body": "Oh and to reply to your other question, technically it will irritate it more but only for a bit! Directly after changing it it’ll most likely be a little sore from being messed with, but the instant relief is so worth it! When mine was changed it stung for an hour or so afterwards and was just generally sensitive, but after that hour was up i was so grateful for how much better it felt and now my helix is healing so well! I’ve never had pain or discomfort since, whereas before i used to be in pain nearly every day because of the incorrect jewellery. It’s like if you’re treating a wound, disinfecting it and wrapping a bandage around it would hurt because it doesn’t wanna be touched, but only then will it be able to start healing properly :)", "created_utc": "1661496498.0", "edited": "False", "id": "ilu8lzt", "is_submitter": "False", "link_id": "t3_wx5muc", "parent_id": "t1_ilu76ix", "score": "1", "subreddit": "PiercingAdvice", "subreddit_id": "t5_2rtn8"}, {"author": "Jen2603", "body": "It is possible but i wouldn’t recommend it! I had a similar thing with my helix (although it was incorrect jewellery shape not material) and i knew i wouldn’t be able to change it myself as A) i’d never changed it before and B) i have a low pain tolerance and i knew if it hurt too much midway through that i’d probably get stressed and give up haha, so i emailed a local piercer to explain my situation and he changed it for me the next morning for £5 (new jewellery included) and barely any fuss whatsoever! I felt more comfortable knowing it was in a sterile environment too. \n\nIn comparison, I also have a regret where i attempted to change a piercing myself when it wasn’t healing and it hurt so badly trying to change it that i had to give up and it’s now healed closed :( i wish i’d gone to a piercer for that one too as they probably would have managed it. I think the issue was that it swelled closed as soon as i removed the jewellery and the middle was still very raw and sensitive so it hurt a lot just trying to blindly stab it through a hole that wasn’t perfectly straight to begin with, whereas piercers have tools to navigate these kind of situations. I’m not sure how old your piercing is but in both of my examples mine were 6/7 months old, so even if it’s been a while i still recommend a piercer!", "created_utc": "1661496206.0", "edited": "1661496564.0", "id": "ilu88gz", "is_submitter": "False", "link_id": "t3_wx5muc", "parent_id": "t1_ilu76ix", "score": "1", "subreddit": "PiercingAdvice", "subreddit_id": "t5_2rtn8"}, {"author": "Jen2603", "body": "Yes :)", "created_utc": "1661455927.0", "edited": "False", "id": "ilrw06v", "is_submitter": "False", "link_id": "t3_wxko56", "parent_id": "t3_wxko56", "score": "1", "subreddit": "PiercingAdvice", "subreddit_id": "t5_2rtn8"}, {"author": "Jen2603", "body": "It looks like a possible allergic reaction to the metal to me, I recommend getting it switched out from surgical steel to implant-grade titanium.", "created_utc": "1661422240.0", "edited": "False", "id": "ilpq67c", "is_submitter": "False", "link_id": "t3_wx5muc", "parent_id": "t3_wx5muc", "score": "1", "subreddit": "PiercingAdvice", "subreddit_id": "t5_2rtn8"}, {"author": "Jen2603", "body": "Did you ever get it downsized?? That bar looks long for a 2 year old piercing. Excess length will move back and forth and cause irritation. I’m not sure whether industrials are a different time frame (? - someone please verify) but for a helix a downside is recommended after 4-6 weeks from when the piercing was done, when the swelling stage is over. Any longer will hinder the healing process from that non-stop irritation. \n\nAlso stop using all that stuff on your piercing, invest in a bottle of pre-mixed sterile saline (aka wound wash) from a brand like NeilMed. Ingredients should be only water and sodium chloride, at a concentration of 0.9% (again, NeilMed ticks all these boxes). Tea tree oil marketed “for piercings” is STILL tea tree oil and it shouldn’t be used. I know some people have had it work for them, but in order to give safe advice i strongly recommend against it. (And if you’re having problems while using it then it clearly isn’t working like some people claim it will). Hopefully with these changes you’ll start to notice some improvements, good luck!", "created_utc": "1661421972.0", "edited": "False", "id": "ilpptfb", "is_submitter": "False", "link_id": "t3_wx6llj", "parent_id": "t3_wx6llj", "score": "1", "subreddit": "PiercingAdvice", "subreddit_id": "t5_2rtn8"}, {"author": "Jen2603", "body": "Definitely a stud!", "created_utc": "1660591622.0", "edited": "False", "id": "ikf72pu", "is_submitter": "False", "link_id": "t3_wp870i", "parent_id": "t3_wp870i", "score": "6", "subreddit": "PiercingAdvice", "subreddit_id": "t5_2rtn8"}, {"author": "Jen2603", "body": "Also just to clarify about the the healing time - a year is usually the time frame if everything goes perfectly with your piercing and doesn’t account for any big trauma with it that would set back the healing process. For example, my helix was pierced with the wrong jewellery and was constantly banged because of it and also developed a large irritation bump. Therefore for the first 5 months of me having it, it wasn’t healing properly so i’m more expecting it to heal in a year and a half rather than a year if that makes sense.", "created_utc": "1659680583.0", "edited": "False", "id": "ij0ss8f", "is_submitter": "False", "link_id": "t3_wgmmg3", "parent_id": "t1_ij0sbi2", "score": "2", "subreddit": "PiercingAdvice", "subreddit_id": "t5_2rtn8"}, {"author": "Jen2603", "body": "Where abouts on your cartilage are you getting pierced? Just as it differs a lot between placements. I have my helix pierced and it hasn’t been too difficult! I got my second lobes at the same time and if my lobes were a 1/10 pain then my helix was about a 4 i’d say? The piercing itself was probably a 3 but then him screwing the end onto my jewellery and messing around with how it sits in my ear was more like a 5 haha, so together I’d just estimate a 4. \n\nJust care for it the same way you’d care for your lobes, the only thing i’d point out really is that for any mistakes you do make, your cartilage will punish you a lot more than your lobes would, so i’d just recommend to be more strict with it. E.g, if you slept on that side accidentally - a lobe on that side might forgive you and not be sore afterwards so you think it was fine, whereas a cartilage is a lot more likely to flare up because of it. So i’d just recommend babying it a bit more :) The healing time is a lot longer too, around a year, so be prepared for that too and don’t get impatient with it. Good luck!!", "created_utc": "1659680258.0", "edited": "False", "id": "ij0sbi2", "is_submitter": "False", "link_id": "t3_wgmmg3", "parent_id": "t3_wgmmg3", "score": "2", "subreddit": "PiercingAdvice", "subreddit_id": "t5_2rtn8"}, {"author": "Jen2603", "body": "I think it depends on your personal habits, as in how badly you’ll want to sleep on that side and how you feel about travel pillows. I personally used to sleep on my sides in about a 60/40 ratio, and ended up getting my helix pierced on the side that i used to sleep on 60% of the time. I’m also very specific with what height my head can be in order for me to sleep, so i hate travel / donut pillows. However, i found that personally i could compromise with what side i sleep on and just started sticking to the other side or my back and i have no regrets whatsoever! Yes it was a bit annoying sometimes to get up to naturally turn over and have to stop myself, but i was able to have that self control. I love my helix to bits, and i wouldn’t have liked it nearly as much if it was on the other side. In fact, i’m looking to get the majority of my piercings on that same side as i love it that much! \n\nTL;DR: Go with your gut. Only you know your sleeping habits fully. Will you have the self control to stop sleeping on that side? Would you be fine sleeping on that side still but with a travel neck pillow? Would you even like your piercing if it was on the other ear? All things to consider!", "created_utc": "1659428217.0", "edited": "False", "id": "iim9xk1", "is_submitter": "False", "link_id": "t3_wdxo8l", "parent_id": "t3_wdxo8l", "score": "3", "subreddit": "piercing", "subreddit_id": "t5_2qolb"}, {"author": "Jen2603", "body": "1) Even that surgical steel isn’t good for your piercing. Get it switched out to implant grade titanium. \n\n2) You will not get a keloid unless you are prone to them, which is very rare. Removing jewellery before healing is fine. It just means you understand that the piercing will close and you’re gonna lose it. Small lumps / scars can form after this which is just scar tissue from the trauma that area went through - perfectly normal. Either way you don’t need to remove the jewellery. If you try and fix the issues so that it starts to heal properly then you won’t need to lose the piercing :)\n\n3) Don’t use tea tree oil on your piercings. In fact, stop using ANYTHING on it other than sterile saline (apart from warm water while in the shower). And by sterile saline i mean a pre-mixed one that’s in a sterile container (NeilMed is a perfect example and is what i personally use.)\n\nAll the best and i hope your situation starts to improve! While it may seem annoying that you have multiple things to change / fix, at least you know there’s a reason for these issues and therefore a solution! You won’t be stuck with this forever and hopefully soon you can have a wonderfully healed piercing with no problems :)", "created_utc": "1659427553.0", "edited": "False", "id": "iim94rt", "is_submitter": "False", "link_id": "t3_we4mfy", "parent_id": "t3_we4mfy", "score": "3", "subreddit": "piercing", "subreddit_id": "t5_2qolb"}, {"author": "Jen2603", "body": "Second this! I was pierced with a curved barbell too and had so many issues and then as soon as i went to a different piercer and got it changed it was a lot happier. The irritation bump i was left with is still going down but it’s definitely improving", "created_utc": "1659387700.0", "edited": "False", "id": "iik3ai6", "is_submitter": "False", "link_id": "t3_wd63c8", "parent_id": "t3_wd63c8", "score": "1", "subreddit": "PiercingAdvice", "subreddit_id": "t5_2rtn8"}, {"author": "Jen2603", "body": "It should sort itself out in time, something most likely happened to it at some point (if you don’t remember banging it or snagging it then it could have been in your sleep?) If you know for sure that didn’t happen then it could be just going through a phase in its healing process where it’s flaring up. How does your bar fit right now? Is your ear swollen and the bar is now too tight, or is there some room for your piercing to breathe still? A tight bar will be very uncomfortable and would definitely be adding a lot to the pain.\n\nIn terms of aftercare, i recommend you stop mixing your own solution and purchase a sterile saline solution (i personally use NeilMed). I know you think you’re cleaning it well but there’s a lot of issues with mixing it yourself - there’s no way to make it sterile or accurately ensure that you’re mixing the right concentration. While you may not have had problems with your first, it could be irritating this new one as every piercing hole can behave differently. I speak from experience too, i got given the exact same aftercare instructions for my helix as you and i used to just pour a random amount of salt in a beaker of boiling water and use that 😭 Yes it would get the gunk off but it was definitely not helping my piercing heal properly as much as NeilMed does. I used to use so much salt at first that it would crystallise on the bottom of the beaker afterwards and then after doing my research i learnt that it’s only meant to be a 0.9% sodium chloride concentration! Definitely a big mistake on my part that i learnt a lot from haha", "created_utc": "1659244363.0", "edited": "False", "id": "iicjev8", "is_submitter": "False", "link_id": "t3_wcekxu", "parent_id": "t3_wcekxu", "score": "2", "subreddit": "piercing", "subreddit_id": "t5_2qolb"}, {"author": "Jen2603", "body": "Unfortunately it looks like it is :( From the pictures it looks like it’s through your cartilage rather than your sweet spot. I would take it out and get it repierced by a reputable piercer (aka not the same one who initially pierced you), and ideally someone who has pictures of proper septum piercings as part of their portfolio", "created_utc": "1659168011.0", "edited": "False", "id": "ii8ggy1", "is_submitter": "False", "link_id": "t3_wbodp6", "parent_id": "t3_wbodp6", "score": "3", "subreddit": "piercing", "subreddit_id": "t5_2qolb"}, {"author": "Jen2603", "body": "If it’s just red and swollen then it’s just irritated - something is making it unhappy. If you answer the rest of the bot questions then that’ll make it a lot easier to help :) Especially what material your jewellery is and what your aftercare routine is", "created_utc": "1659167724.0", "edited": "False", "id": "ii8g4ay", "is_submitter": "False", "link_id": "t3_wbjsmt", "parent_id": "t3_wbjsmt", "score": "1", "subreddit": "piercing", "subreddit_id": "t5_2qolb"}, {"author": "Jen2603", "body": "You’re right, thank you! I feel like i’m definitely overthinking it haha, i just don’t want to start finally investing in high-quality jewellery and then feel like i made a mistake! I think you’re right and that going with my gut rather than taking a risk will be better :)", "created_utc": "1659125147.0", "edited": "False", "id": "ii66gl5", "is_submitter": "True", "link_id": "t3_wb5gxy", "parent_id": "t1_ii619ac", "score": "1", "subreddit": "piercing", "subreddit_id": "t5_2qolb"}, {"author": "Jen2603", "body": "Thank you! :))", "created_utc": "1659117396.0", "edited": "False", "id": "ii5n286", "is_submitter": "True", "link_id": "t3_wb5gxy", "parent_id": "t1_ii4mfmg", "score": "1", "subreddit": "piercing", "subreddit_id": "t5_2qolb"}, {"author": "Jen2603", "body": "Thank you so much! It’s actually sterling silver, i know sterling silver isn’t the most loved or trusted material in the community but my lobes are completely healed and i’m not sensitive to any metals! I’m looking to upgrade them soon but first i need to make the tough decision of yellow vs white gold :(", "created_utc": "1659117327.0", "edited": "False", "id": "ii5mw12", "is_submitter": "True", "link_id": "t3_wb5gxy", "parent_id": "t1_ii5ff09", "score": "1", "subreddit": "piercing", "subreddit_id": "t5_2qolb"}, {"author": "Jen2603", "body": "Does your title mean that it was just pierced today? If so then i definitely think the bar is too short and won’t allow for any swelling during the healing process. In terms of changing it, I think you should go back to your piercer and ask them to change it to a larger bar. I know that changing it yourself may seem a lot more convenient, but going back to your piercer is the only way you can ensure that it’s changed in a sterile environment and will experience the least amount of trauma possible. Apologies if i misunderstood your title and this isn’t a new piercing! :)", "created_utc": "1659104167.0", "edited": "False", "id": "ii4oyiz", "is_submitter": "False", "link_id": "t3_wb5ncd", "parent_id": "t3_wb5ncd", "score": "2", "subreddit": "piercing", "subreddit_id": "t5_2qolb"}, {"author": "Jen2603", "body": "5 weeks is definitely too soon to be changing your earrings. What material were your original earrings and what material are your new earrings that you changed them to? If your old earrings were of a suitable material (i.e implant grade titanium) then I would recommend changing them back to allow the healing process to resume :) All the best!", "created_utc": "1659103844.0", "edited": "False", "id": "ii4o65s", "is_submitter": "False", "link_id": "t3_wb5d7s", "parent_id": "t3_wb5d7s", "score": "10", "subreddit": "piercing", "subreddit_id": "t5_2qolb"}, {"author": "Jen2603", "body": "I think a conch would look so pretty! Where did you get your jewellery from as well? It looks stunning!", "created_utc": "1658939378.0", "edited": "False", "id": "ihvcdoq", "is_submitter": "False", "link_id": "t3_w9fhjk", "parent_id": "t3_w9fhjk", "score": "4", "subreddit": "piercing", "subreddit_id": "t5_2qolb"}, {"author": "Jen2603", "body": "Definitely go back to your piercer and have them change it for you using a replacement titanium back instead of the steel one you bought :)", "created_utc": "1658821273.0", "edited": "False", "id": "ihos5m7", "is_submitter": "False", "link_id": "t3_w86da9", "parent_id": "t3_w86da9", "score": "2", "subreddit": "piercing", "subreddit_id": "t5_2qolb"}, {"author": "Jen2603", "body": "Agree with the comment that where the bumps are might mean angle is off unfortunately, you should book a consultation with a reputable piercer. Also, what do you mean by you were unable to clean it with saline for 3 weeks? Were you trying to clean it with something else instead or not cleaning it?", "created_utc": "1658821066.0", "edited": "False", "id": "ihorwek", "is_submitter": "False", "link_id": "t3_w86yj1", "parent_id": "t3_w86yj1", "score": "1", "subreddit": "piercing", "subreddit_id": "t5_2qolb"}, {"author": "Jen2603", "body": "thank you so much!!", "created_utc": "1658653478.0", "edited": "False", "id": "ihfffb0", "is_submitter": "False", "link_id": "t3_w6efky", "parent_id": "t1_iheg09w", "score": "2", "subreddit": "piercing", "subreddit_id": "t5_2qolb"}, {"author": "Jen2603", "body": "Congrats on healing! Also where did you get your helix jewellery from? It’s so pretty! :)", "created_utc": "1658614777.0", "edited": "False", "id": "ihdjub9", "is_submitter": "False", "link_id": "t3_w6efky", "parent_id": "t3_w6efky", "score": "19", "subreddit": "piercing", "subreddit_id": "t5_2qolb"}]