[{"author": "joyeuseamal", "body": "how to speak to my father", "created_utc": "1665638689.0", "edited": "False", "id": "is4czad", "is_submitter": "False", "link_id": "t3_y28egb", "parent_id": "t3_y28egb", "score": "0", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "joyeuseamal", "body": "NTA - Giving birth is one of the most dangerous and traumatic things a woman can go through. Having people there who you feel safe with and supported by would help a lot. I don’t see the issue with asking kindly, but make sure that she feels like she can say no. Having to take off work and travel to be with you might not be something she is able to do.", "created_utc": "1665492049.0", "edited": "False", "id": "irvsbf5", "is_submitter": "False", "link_id": "t3_y17rri", "parent_id": "t3_y17rri", "score": "7", "subreddit": "AmItheAsshole", "subreddit_id": "t5_2xhvq"}, {"author": "joyeuseamal", "body": "Is it? Is it so ridiculous to expect you to speak equally if your defense to my earlier point is that you disagree with all religions? You can’t use that as a excuse if you’re not actually doing it.", "created_utc": "1593549670.0", "edited": "False", "id": "fwiinqm", "is_submitter": "False", "link_id": "t3_hikb7l", "parent_id": "t1_fwihqs7", "score": "2", "subreddit": "pics", "subreddit_id": "t5_2qh0u"}, {"author": "joyeuseamal", "body": "I don’t see you seeking out pictures of nuns to comment on though? And I would happily discuss the oppression of women in Europe and North America. Particularly from the hyper sexualisation of the female body and the porn industry.", "created_utc": "1593549066.0", "edited": "False", "id": "fwihds7", "is_submitter": "False", "link_id": "t3_hikb7l", "parent_id": "t1_fwicm61", "score": "2", "subreddit": "pics", "subreddit_id": "t5_2qh0u"}, {"author": "joyeuseamal", "body": "Of course! 🤍", "created_utc": "1593544516.0", "edited": "False", "id": "fwi7rvk", "is_submitter": "False", "link_id": "t3_hij8dc", "parent_id": "t1_fwhx0si", "score": "2", "subreddit": "WeightLossAdvice", "subreddit_id": "t5_31a4o"}, {"author": "joyeuseamal", "body": ">I would never chastise a woman for wearing it, but I openly disagree with the fundamental reasons behind it.\n\nIf it truly has to do with you disagreeing with the fundamental reasons behind it, why don't we see you commenting similarly on pictures of nuns or Amish women or Orthodox jews? If you disagree with all women covering for religious reasons, why do you choose to focus on Muslim women? Could it be... islamaphobia?", "created_utc": "1593543243.0", "edited": "False", "id": "fwi53xq", "is_submitter": "False", "link_id": "t3_hikb7l", "parent_id": "t1_fwhav9h", "score": "0", "subreddit": "pics", "subreddit_id": "t5_2qh0u"}, {"author": "joyeuseamal", "body": "This is racist as hell. You jump immediately to the assumption that a reasonable intervention with a religious leader will lead to the parents abusing their child. Can you not fathom that, a discussion with the parents about the actual religious teachings can lead to a changed mindset? Or is growth and change only for white people?", "created_utc": "1593542621.0", "edited": "False", "id": "fwi3s78", "is_submitter": "False", "link_id": "t3_hikb7l", "parent_id": "t1_fwh51wo", "score": "0", "subreddit": "pics", "subreddit_id": "t5_2qh0u"}, {"author": "joyeuseamal", "body": "Irony is you crying about freedom of speech on reddit while not being able to fathom that she can still wear the hijab as her choice. You do as much to deny her her autonomy as ISIS did in making her wear niqab.", "created_utc": "1593542125.0", "edited": "False", "id": "fwi2pj7", "is_submitter": "False", "link_id": "t3_hikb7l", "parent_id": "t1_fwhc17s", "score": "0", "subreddit": "pics", "subreddit_id": "t5_2qh0u"}, {"author": "joyeuseamal", "body": "Seems ridiculous the men in the US have to be so covered at the beach and the woman doesn't. Doesn't seem fair. \n\nClothing and dress standards are relative to culture. You deny Muslim women the autonomy you think they lack when you cry about our manner of dress. Have you ever considered that women might not enjoy their bodies being exposed and on display?", "created_utc": "1593541528.0", "edited": "False", "id": "fwi1eg1", "is_submitter": "False", "link_id": "t3_hikb7l", "parent_id": "t1_fwgvpdb", "score": "0", "subreddit": "pics", "subreddit_id": "t5_2qh0u"}, {"author": "joyeuseamal", "body": "Yes, there's people who wear niqabs in every color imaginable. Color and style generally depend on region and interpretation of certain ahadith & ayat. The rest of the world tend to wear more bright colored niqabs than the Gulf region. The Algerian Hayek is a white, sometimes lacy veil. Malaysian and Indonesian niqabis usually wear very bright colors, some with rhinestones. Moroccan litham is often very bright too or a bright color paired with black. As an American niqabi, I wear a lot of neutrals like beige and grey but that's just my preference. I know loads of girls who love their bright pink or blue niqabs.", "created_utc": "1593540342.0", "edited": "False", "id": "fwhyu7s", "is_submitter": "False", "link_id": "t3_hikb7l", "parent_id": "t1_fwhob8y", "score": "8", "subreddit": "pics", "subreddit_id": "t5_2qh0u"}, {"author": "joyeuseamal", "body": "Yeah they sit on a little electric heater that plugs into the wall and you just fill it up and press the switch! Boils water faster than the stove, so freaking useful! They’re like $20 at walmart or target for a cheap one.", "created_utc": "1593531956.0", "edited": "False", "id": "fwhh4sb", "is_submitter": "False", "link_id": "t3_hikwm2", "parent_id": "t1_fwhg3t6", "score": "3", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "joyeuseamal", "body": "The belief (read: propaganda) that the US is the good guy underdog fighting against the big bad evil system.", "created_utc": "1593531209.0", "edited": "False", "id": "fwhfl9u", "is_submitter": "False", "link_id": "t3_hikwm2", "parent_id": "t3_hikwm2", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "joyeuseamal", "body": "Are you talking about a stovetop kettle? If so, yes everyone’s family seems to have one of those lying around. But if you’re talking about an electric kettle, those are really not a very common thing in most regions. That being said, we definitely should! My family bought a kettle for me as a gift in high school and they all used it so much that they bought me a new one when I left home. I haven’t run into any Americans who had a kettle until I married my Kurdish husband and they keep a kettle in their house. I think they are gaining steam but among the pour over coffee scene more than anything.", "created_utc": "1593530605.0", "edited": "False", "id": "fwhecgb", "is_submitter": "False", "link_id": "t3_hikwm2", "parent_id": "t1_fwhdbq3", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "joyeuseamal", "body": "As the girl who weighed regularly 20lbs above the rest of my classmates in MS & HS, you should know that your body isn’t done growing and you’re entertaining a time period with a lot of change and adjustments emotionally and physically. I know it’s not easy in this day and age to be in comfortable with yourself but I promise you that fad diets and weight loss goals that are not recommended by a medical professional are extremely harmful for individuals under the age of 18. Dieting and restriction set you up for a lifetime of a bad relationship with food and most people who diet end up gaining more weight back because of how it messes up their perception of food. You are a human being, and a young one at that. Your body needs different things than an adult’s body, particularly more. Teenagers need at least 2,200 calories a day due to the rate your body is growing and developing! \n\nIf you read all of this and truly wholly think, “I can’t do that, I am still uncomfortable with my appearance and my body,” you especially should spend a lot of time taking care of yourself emotionally and practicing self love, self respect, and self care. You are more than a body, more than looking attractive at a few angles. Losing weight seems like the answer but being kind to yourself is vastly more important. \n\nYour body, like any other human’s, will carry you through so many seasons of life. Sometimes those seasons will cause your weight to go up or down. This is entirely normal. People who are perfectly in shape their whole lives, put a *lot* of work into maintaining that aesthetic. It’s not effortless and it’s not something most people would enjoy doing forever. Speaking as an adult, most of us feel our best eating a little more greens with regular moderate exercise like walking or running or biking.\n\nBottom line, you do not need to lose weight, you need to lose the shame that you feel for having a very normal body. And in 10-15 years,  you’ll be surprised at how many high school athletes who will have swapped their six packs for beer guts. Focus on growing yourself as a person, take care of them, love them, and no matter how your body looks, you will be content with who *you* are. Take care, friend.", "created_utc": "1593518401.0", "edited": "False", "id": "fwgtlep", "is_submitter": "False", "link_id": "t3_hij8dc", "parent_id": "t3_hij8dc", "score": "2", "subreddit": "WeightLossAdvice", "subreddit_id": "t5_31a4o"}]