[{"author": "jrs1810", "body": "100%. I did a silent phase and I’m now still having a very difficult time getting out of it 1 year later because of the anxiety I’ve built up about being “not ready” to speak.", "created_utc": "1665592556.0", "edited": "False", "id": "is1fjlm", "is_submitter": "False", "link_id": "t3_y1qo5y", "parent_id": "t1_is04690", "score": "8", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "jrs1810", "body": "“You know you can get by here with just speaking English, there’s English people here and most everyone else speaks English as a second language”\n\nI get this a LOT and I don’t get how ppl would want to live somewhere and put no effort into learning the language and becoming more involved in the culture, just because they can ‘get away with’ not putting in the effort.", "created_utc": "1656861872.0", "edited": "False", "id": "iepfe04", "is_submitter": "False", "link_id": "t3_vq6276", "parent_id": "t3_vq6276", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "jrs1810", "body": "That’s exactly what it’s like for me! It’s kinda weird feeling like I’m fluently understanding the language but have a mental barrier when it comes to speaking back. We’ll get there :) Don’t give up!", "created_utc": "1656861636.0", "edited": "False", "id": "iepeui6", "is_submitter": "False", "link_id": "t3_vpgomt", "parent_id": "t1_iejwy57", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "jrs1810", "body": "Just wanted to respond to this because I really struggle with social anxiety related to my language learning too!\n\nI’m at a point where I have different comfort levels with different people (after a LOT of effort). I’m still extremely uncomfortable with speaking in my TL to my girlfriend and her friends, but I’ve found an iTalki tutor who I finally am becoming less anxious around. \n\nI also find the more impersonal situations have been helpful for me lately. It’s easier for me to greet a bus driver in my TL cuz i’ll never see the guy again so it’s easier to feel safe about it. I’d imagine for ppl who don’t live near where their TL is spoken, a good alternative would be with random strangers on discord but I haven’t tried. \n\nOnce you reach a certain level with a language it’s almost like you have to force thru the anxiety with little steps outside of your comfort zone to prove to your body that it’s an unthreatening situation.", "created_utc": "1656861512.0", "edited": "False", "id": "iepek2f", "is_submitter": "False", "link_id": "t3_vpgomt", "parent_id": "t1_ien9zk3", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "jrs1810", "body": "I also struggle with social anxiety which severely impacts my language learning journey. \n\nI did something like this method you’re describing. I did a several month input phase, and now my oral AND written comprehension are really solid.\n\nHOWEVER, the issue I am still struggling with is feeling like I’m “not ready” for certain interactions, despite my high level of comprehension and knowledge and experience with input and immersion.\n\nI can read complex texts, understand local slang & cultural references, understand 97% of what’s being said to me, and even debate on my opinions when I’m really comfortable and familiar with the person I’m speaking to… but I freeze when someone says “bonjour” to me in the grocery store because of social anxiety. Even though I know exactly what to say and how to pronounce it and I understand the grammar & syntax of each phrase that comes to my mind. \n\nEveryone is different but I would advise others with severe anxiety to be careful about this stuff! Every time I speak to ppl in my TL, I’m really anxious and it literally feels like exposure therapy lol.", "created_utc": "1656733692.0", "edited": "False", "id": "iejdhw7", "is_submitter": "False", "link_id": "t3_vp6ad8", "parent_id": "t1_iehcnbj", "score": "4", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "jrs1810", "body": "One situation that stands out is that I did not notice when I was at a party with a bunch of bilingual (fr/en) people and they were switching back and forth between English and French a lot. My girlfriend mentioned the next day that she can tell my French is improving a lot because people were switching and I wasn’t even noticing it, and responding just as quickly (in english though). She mentioned a specific conversation she witnessed me having, and I remembered the conversation and what we had talked about but I was actually surprised when she was telling me he was switching to French. I guess it was a combination of French exposure/study and alcohol that made it happen lol.\n\nAnother thing I’ve noticed recently is that I can read the French text instead of the English text without issues in most circumstances. Signs, instructions, news, social media posts, etc. I started just reading stuff in whichever language I see first. \n\nIt’s super exciting to me that my level is clearly improving, but I unfortunately feel like I’m still not very fluent since my weak area is producing speech. I recently decided that I think I can read fluently.", "created_utc": "1656733028.0", "edited": "False", "id": "iejcdd6", "is_submitter": "False", "link_id": "t3_vpgomt", "parent_id": "t3_vpgomt", "score": "63", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "jrs1810", "body": "That’s normal. You’ll get more comfortable with it over time!", "created_utc": "1656204298.0", "edited": "False", "id": "idr2czy", "is_submitter": "False", "link_id": "t3_vks3uf", "parent_id": "t1_idr1qp9", "score": "3", "subreddit": "DecidingToBeBetter", "subreddit_id": "t5_2tand"}, {"author": "jrs1810", "body": "Ma langue maternelle est l’anglais et je voudrais pratiquer mon français (sur text ou VC). J’ai 21 ans et je viens du Canada :)", "created_utc": "1656204244.0", "edited": "False", "id": "idr29fw", "is_submitter": "False", "link_id": "t3_vkl21k", "parent_id": "t3_vkl21k", "score": "1", "subreddit": "language_exchange", "subreddit_id": "t5_2tdbm"}, {"author": "jrs1810", "body": "What kind of tips are you looking for?\n\nEither way, I want to let you know that therapy can be beneficial for all kinds of areas of life, whether you’re depressed or not. I go to therapy mostly for my ADHD and overthinking related stuff too. It really does help.\n\nOn your first appointment, most therapists I’ve worked with usually just take that appointment to get to know you and your goals/what you want to work on in your sessions. Definitely mention the ones you mentioned on this post! And maybe it will be really uncomfortable at first but you should ask yourself why you feel so uncomfortable talking about your emotions, and decide if that might also be something you’d like to work on too. \n\nGood luck :)", "created_utc": "1656202883.0", "edited": "False", "id": "idqzoxh", "is_submitter": "False", "link_id": "t3_vks3uf", "parent_id": "t3_vks3uf", "score": "5", "subreddit": "DecidingToBeBetter", "subreddit_id": "t5_2tand"}, {"author": "jrs1810", "body": "Thanks so much! Around how long did it take to get to QC when you ordered? We’re flying to Newfoundland next weekend so it’s a bit of a rush gearing up😅", "created_utc": "1656185939.0", "edited": "False", "id": "idq0kg6", "is_submitter": "True", "link_id": "t3_vkli2m", "parent_id": "t1_idpwysf", "score": "1", "subreddit": "hiking", "subreddit_id": "t5_2r9om"}, {"author": "jrs1810", "body": "What advice do you have for someone who tries this type of journalling but kind of just ends up writing the same thing every time?", "created_utc": "1656086128.0", "edited": "False", "id": "idkmep6", "is_submitter": "False", "link_id": "t3_vjjlif", "parent_id": "t1_idjsg9l", "score": "2", "subreddit": "DecidingToBeBetter", "subreddit_id": "t5_2tand"}, {"author": "jrs1810", "body": "This was extremely helpful to read as someone struggling with negativity like OP. Thank you for taking the time.", "created_utc": "1656086049.0", "edited": "False", "id": "idkm75f", "is_submitter": "False", "link_id": "t3_vjjlif", "parent_id": "t1_idjhai6", "score": "2", "subreddit": "DecidingToBeBetter", "subreddit_id": "t5_2tand"}, {"author": "jrs1810", "body": "Sounds like you could be a little bit burnt out/tired. I have a lot of issues with this too. If you’re lacking motivation to do those activities you planned, maybe it’s not laziness, maybe you just need to take it easy for a little bit.\n\nDon’t give up on the goals you set for yourself. Take a second to think about why they’re important to you and remind yourself. And pick a couple of activities to do in a day, you don’t need to force yourself to do a whole bunch of stuff all the time! The world won’t end if you draw today and not tomorrow.", "created_utc": "1656084968.0", "edited": "False", "id": "idkjc71", "is_submitter": "False", "link_id": "t3_vjl7j8", "parent_id": "t3_vjl7j8", "score": "5", "subreddit": "DecidingToBeBetter", "subreddit_id": "t5_2tand"}, {"author": "jrs1810", "body": "Thank you so much for this. I actually went to get groceries today and initiated the convo in my TL (the cashier switched to english after hearing my accent lol) but you have some other really great ideas about opportunities to practice. I’m lucky too because my girlfriend is actually a native speaker! I’ve had some difficulty getting the courage to speak in front of her, it feels pretty vulnerable since she knows the language so well and i don’t.\n\nI’m starting a job in my TL in a few weeks. At what language proficiency level did you start working in the language?", "created_utc": "1654960556.0", "edited": "False", "id": "ibzccmp", "is_submitter": "False", "link_id": "t3_v1nda4", "parent_id": "t1_ibyiqkz", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "jrs1810", "body": "Do you have any advice on how to integrate output methods into this? I have a lot of difficulty taking the first step. I go to a store and they address me in my TL and I immediately say hello in English lol. I’m not making any more progress anymore, I understand everything being said to me and can read fluently but my output is Terrible lol.", "created_utc": "1654783804.0", "edited": "False", "id": "ibqeu9r", "is_submitter": "False", "link_id": "t3_v1nda4", "parent_id": "t1_ibpcrsx", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "jrs1810", "body": "No language is useless. Even if you don’t have a practical use for it, learning a language opens the door to books, movies, tv shows, music, news, etc. in a different language (& therefore from a different cultural perspective since language and culture are so intertwined)… and that’s only if you’re not counting actual communication with other people and the experiences that come with that! What’s useless is putting someone down for taking an opportunity to learn.", "created_utc": "1654400821.0", "edited": "False", "id": "ib7t14v", "is_submitter": "False", "link_id": "t3_v50btz", "parent_id": "t3_v50btz", "score": "11", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "jrs1810", "body": "That’s amazing, I wish I had the courage to do that. My anxiety has been preventing me from being able to go seek out those interactions and learning opportunities. Do you have any advice on taking that first step?", "created_utc": "1654009069.0", "edited": "False", "id": "iao3tzk", "is_submitter": "False", "link_id": "t3_v1nda4", "parent_id": "t1_ianl9p1", "score": "10", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "jrs1810", "body": "I read and watch tv like crazy and live in an area where they speak my target language and I’ve managed to get to a point where I understand someone else’s side of the conversation in that language but I struggle to respond. \n\nWhat I don’t get is how these people get their output abilities to catch up from just mainly learning from input!!", "created_utc": "1654008928.0", "edited": "False", "id": "iao3igy", "is_submitter": "False", "link_id": "t3_v1nda4", "parent_id": "t1_ianetza", "score": "20", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "jrs1810", "body": "Personally, I struggle a lot with the whole accent thing. I moved to Montréal a few years ago and I’m now learning French. Immediately as soon as someone hears my English accent, they switch to English. I really want to develop an accent that is closer to a typical québécois accent, so that I can blend in and stop getting switched on. I know that ppl are trying to be helpful by speaking to me in English but I really want to learn more about the language and culture and I feel like my accent complicates that.\n\nMy girlfriend and friends are all native french speakers from Quebec, and my accent is a huuuge insecurity when interacting with them and people in their area when I visit. \n\nMy accent makes me super self-conscious and sometimes too anxious to bring myself to speak. I’m also a huge perfectionist by nature and I feel like I should be that 1% of people who can develop a “native passing” accent, just because of my standards for myself… \n\nThank you for the more positive take on ‘sounding native’ or not. I hope one day I will also reach that level of acceptance!", "created_utc": "1652292124.0", "edited": "False", "id": "i87pcsk", "is_submitter": "False", "link_id": "t3_umoho1", "parent_id": "t3_umoho1", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "jrs1810", "body": "Like if my guilt becomes the focus in a conversation about something I did wrong. If i hurt someone and then the conversation ends with them feeling a need to reassure me (even after i did the initial wrong). I feel like that would be toxic and I don’t want to put someone thru that", "created_utc": "1648181274.0", "edited": "False", "id": "i20x3md", "is_submitter": "False", "link_id": "t3_tnd6iw", "parent_id": "t1_i20wy4k", "score": "1", "subreddit": "Advice", "subreddit_id": "t5_2qjdm"}, {"author": "jrs1810", "body": "Thank you! I haven’t done much writing because I’ve heard it all the time that written french and spoken french are really different. But it helped you out? I really should try that", "created_utc": "1645375017.0", "edited": "False", "id": "hxpx4l8", "is_submitter": "True", "link_id": "t3_svrj5x", "parent_id": "t1_hxov9bz", "score": "2", "subreddit": "learnfrench", "subreddit_id": "t5_2sucz"}, {"author": "jrs1810", "body": "I’m having the opposite problem haha. I’m an anglophone (from another province) and I’ve been living in Quebec for the past 3 years. I understand French and respond in English. \n\nI always consider going to the grocery store or a coffee shop and doing those interactions in French but as soon as I’m in the situation, English comes out. I pretty much freeze up every time and feel super anxious. \n\nMy girlfriend is from Quebec and speaks French and English and I feel too anxious to even speak to her hahahah. How did you get the courage to practice with other people?", "created_utc": "1642981057.0", "edited": "False", "id": "hty42uj", "is_submitter": "False", "link_id": "t3_s7axcy", "parent_id": "t1_ht9s6vh", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "jrs1810", "body": "yo not to be rude but isn’t she tryna get off her phone addiction? And that’s an app?", "created_utc": "1641226455.0", "edited": "False", "id": "hr34zzx", "is_submitter": "False", "link_id": "t3_rue4q7", "parent_id": "t1_hr2vi0y", "score": "2", "subreddit": "getdisciplined", "subreddit_id": "t5_2uzju"}, {"author": "jrs1810", "body": "Wow, thank you all so much!! I really appreciate all the detailed (and honest) feedback :) So many ideas to take into my next practice session. For those asking- yes the video is flipped! \n\nRegarding my technique, I definitely have a habit of using a lot of finger and not much wrist/forearm. I’m overcompensating for this in my left hand which is causing some timing issues. There were some conflicting suggestions on this, but I think I’m going to work on single strokes with more wrist + check into moeller strokes too. \n\nAnd for this particular groove, I will definitely slow it down and focus on coordination and anticipation. (And not flamming, lol). \n\nThanks guys :)", "created_utc": "1639459660.0", "edited": "False", "id": "hoh7233", "is_submitter": "True", "link_id": "t3_rfg26f", "parent_id": "t3_rfg26f", "score": "1", "subreddit": "drums", "subreddit_id": "t5_2qie5"}, {"author": "jrs1810", "body": "can i do my 3 day/wk novice program for more than 3 days per week if i’m feeling motivated and wanna do 4 or 5\n\nedit: it’s ivysaur 4-4-8 if that helps", "created_utc": "1636943954.0", "edited": "False", "id": "hko77ry", "is_submitter": "False", "link_id": "t3_qpqtq4", "parent_id": "t3_qpqtq4", "score": "1", "subreddit": "powerlifting", "subreddit_id": "t5_2s4tp"}, {"author": "jrs1810", "body": "I just got back into lifting after about 3-4 years of a break (during which I didn't exercise at all).  I'm back to square 1 currently. I'm running Ivysaur 4-4-8, and to put into perspective how weak I am, I started my 4x4 with just the bar for bench press. I'm starting the other lifts at comfortably low weights also so I can really focus in on my form and regaining the muscle memory of it.\n\nBut I'm really eager to lift. Back in the day, I would go 5 days a week, but I didn't see much progress, I think because I wasn't eating enough and sleeping enough. Now I'm super motivated to do it right, and I'm hyped for my next day of the program before I've left the gym.\n\n**My question**: Ivysaur 4-4-8 is a 3 day/wk program, but I really want to **add a 4th day of lifting to my week**. Is there any problem with following the program normally but doing 4 days at a time? Should I be more invested in recovery than another gym day as a **novice lifter**? Would it be beneficial for me to do a day of core work and cardio instead of going through the programmed weeks faster than intended?", "created_utc": "1636656376.0", "edited": "False", "id": "hk8g6dt", "is_submitter": "False", "link_id": "t3_qr6o8k", "parent_id": "t3_qr6o8k", "score": "1", "subreddit": "powerlifting", "subreddit_id": "t5_2s4tp"}, {"author": "jrs1810", "body": "broooo... respect", "created_utc": "1622497594.0", "edited": "False", "id": "h04japg", "is_submitter": "False", "link_id": "t3_np2320", "parent_id": "t3_np2320", "score": "2", "subreddit": "drums", "subreddit_id": "t5_2qie5"}, {"author": "jrs1810", "body": "What do your parents think?", "created_utc": "1622425689.0", "edited": "False", "id": "h01cqxr", "is_submitter": "False", "link_id": "t3_nopkcc", "parent_id": "t3_nopkcc", "score": "1", "subreddit": "Advice", "subreddit_id": "t5_2qjdm"}, {"author": "jrs1810", "body": "hell yeah man always find a way to get that practice in! :)", "created_utc": "1622251375.0", "edited": "False", "id": "gztqets", "is_submitter": "False", "link_id": "t3_nnatrs", "parent_id": "t3_nnatrs", "score": "3", "subreddit": "drums", "subreddit_id": "t5_2qie5"}, {"author": "jrs1810", "body": "I have a similar sort of thing with my parents where I let them know things, but can you elaborate more on why you want to let them know?", "created_utc": "1622250148.0", "edited": "False", "id": "gztob7i", "is_submitter": "False", "link_id": "t3_nnc03q", "parent_id": "t3_nnc03q", "score": "1", "subreddit": "Advice", "subreddit_id": "t5_2qjdm"}, {"author": "jrs1810", "body": "I didn’t look at them hahaha i just wanted to be told so i could have a quick look", "created_utc": "1622138571.0", "edited": "False", "id": "gznwcfg", "is_submitter": "False", "link_id": "t3_nleukt", "parent_id": "t1_gzm6tgg", "score": "1", "subreddit": "musictheory", "subreddit_id": "t5_2qrjj"}, {"author": "jrs1810", "body": "Which example are you referring to?", "created_utc": "1622029467.0", "edited": "False", "id": "gzi3uyw", "is_submitter": "False", "link_id": "t3_nleukt", "parent_id": "t3_nleukt", "score": "2", "subreddit": "musictheory", "subreddit_id": "t5_2qrjj"}, {"author": "jrs1810", "body": "down", "created_utc": "1621634568.0", "edited": "False", "id": "gyzqoi6", "is_submitter": "False", "link_id": "t3_ni3ir4", "parent_id": "t1_gyzo5rj", "score": "1", "subreddit": "musictheory", "subreddit_id": "t5_2qrjj"}, {"author": "jrs1810", "body": "When transposing from Bb to C major it would be up a whole step- the way you have asked it would be a whole step down. And I suppose the scale is D melodic minor?", "created_utc": "1621633259.0", "edited": "False", "id": "gyznzx0", "is_submitter": "False", "link_id": "t3_ni3ir4", "parent_id": "t3_ni3ir4", "score": "1", "subreddit": "musictheory", "subreddit_id": "t5_2qrjj"}, {"author": "jrs1810", "body": "Wear the damn skirt bro", "created_utc": "1621565964.0", "edited": "False", "id": "gywhecj", "is_submitter": "False", "link_id": "t3_nhi7nc", "parent_id": "t3_nhi7nc", "score": "3", "subreddit": "tifu", "subreddit_id": "t5_2to41"}, {"author": "jrs1810", "body": "Practice :)", "created_utc": "1621134514.0", "edited": "False", "id": "gyaabqs", "is_submitter": "False", "link_id": "t3_nczwzx", "parent_id": "t1_gy9cvyk", "score": "2", "subreddit": "Meditation", "subreddit_id": "t5_2qnc9"}, {"author": "jrs1810", "body": "yo phoenix is long!", "created_utc": "1620875802.0", "edited": "False", "id": "gxxr9xn", "is_submitter": "False", "link_id": "t3_nb1d6g", "parent_id": "t3_nb1d6g", "score": "3", "subreddit": "VALORANT", "subreddit_id": "t5_2dkvmc"}, {"author": "jrs1810", "body": "Wow what a cool piece! Good performance:)", "created_utc": "1620610321.0", "edited": "False", "id": "gxk6ofo", "is_submitter": "False", "link_id": "t3_n8g84a", "parent_id": "t3_n8g84a", "score": "2", "subreddit": "percussion", "subreddit_id": "t5_2rejv"}, {"author": "jrs1810", "body": "Wow, I wonder how they got so grimy in the first place... I’ve never seen anything like it!", "created_utc": "1620516541.0", "edited": "False", "id": "gxfupbs", "is_submitter": "False", "link_id": "t3_n7w9v9", "parent_id": "t3_n7w9v9", "score": "2", "subreddit": "drums", "subreddit_id": "t5_2qie5"}, {"author": "jrs1810", "body": "Can someone with a lot of knowledge about switches shoot me a message? I have a lot of questions and I’m trying to figure out which switch is right for me!", "created_utc": "1620326381.0", "edited": "False", "id": "gx6jkwi", "is_submitter": "False", "link_id": "t3_knnflb", "parent_id": "t3_knnflb", "score": "1", "subreddit": "MechanicalKeyboards", "subreddit_id": "t5_2ugo7"}, {"author": "jrs1810", "body": "I’m really glad you trusted your gut feeling on this and were cautious. I know lots of people who would brush it off to avoid the worry/unpleasant thoughts of what his intentions might’ve been. But your vigilance protected your child, and you must be so grateful to have gotten in there before anything bad happened. I can tell you really care about your child, thank you for being a good parent! Hope everyone is doing okay.", "created_utc": "1619800381.0", "edited": "False", "id": "gwfxsbc", "is_submitter": "False", "link_id": "t3_n1koty", "parent_id": "t3_n1koty", "score": "1", "subreddit": "self", "subreddit_id": "t5_2qh96"}, {"author": "jrs1810", "body": "Or they’re implying that he’s not a “real man” and that OP wouldn’t need to be a homosexual to be attracted to him... sounds to me like they’re the transphobic ones", "created_utc": "1619639533.0", "edited": "False", "id": "gw7m5s4", "is_submitter": "False", "link_id": "t3_n0hnie", "parent_id": "t1_gw6vgol", "score": "730", "subreddit": "Advice", "subreddit_id": "t5_2qjdm"}, {"author": "jrs1810", "body": "Nice!! Lots of great ideas there :) And your setup looks so cozy.", "created_utc": "1619198758.0", "edited": "False", "id": "gvl7gmh", "is_submitter": "False", "link_id": "t3_mwh531", "parent_id": "t3_mwh531", "score": "1", "subreddit": "Drumming", "subreddit_id": "t5_2qxvm"}, {"author": "jrs1810", "body": "i wish i could’ve seen this before i submitted my most recent assignment... failed 6/25 automated tests because my code was too slow and it timed out... f", "created_utc": "1619024350.0", "edited": "False", "id": "gvcd4hy", "is_submitter": "False", "link_id": "t3_mv8z4p", "parent_id": "t3_mv8z4p", "score": "1", "subreddit": "Python", "subreddit_id": "t5_2qh0y"}, {"author": "jrs1810", "body": "0:20 reminds me of a section of a Cécile Chaminade piece I studied for a final project. op. 35 no. 2 automne or something? Cool stuff", "created_utc": "1618514399.0", "edited": "False", "id": "gun0irr", "is_submitter": "False", "link_id": "t3_mrl5k6", "parent_id": "t3_mrl5k6", "score": "3", "subreddit": "classicalmusic", "subreddit_id": "t5_2qhyq"}, {"author": "jrs1810", "body": "This is reassuring to hear. I’m a newly-crowned adult myself, and just recently moved into my own apartment. Some days I buckle under the pressure of having responsibilities and feel like... wait a minute, I’m not a kid anymore? \n\nIt even happens when I’m doing well, and it’s so hard to explain! It’s so nice to hear that other people feel like a kid sometimes too", "created_utc": "1618378276.0", "edited": "False", "id": "gugheal", "is_submitter": "False", "link_id": "t3_mqeuxd", "parent_id": "t3_mqeuxd", "score": "2", "subreddit": "CasualConversation", "subreddit_id": "t5_323oy"}, {"author": "jrs1810", "body": "Where are you located? I found it in a store near me", "created_utc": "1617743945.0", "edited": "False", "id": "gtm77el", "is_submitter": "False", "link_id": "t3_kc1yoc", "parent_id": "t3_kc1yoc", "score": "1", "subreddit": "Candles", "subreddit_id": "t5_2smh3"}, {"author": "jrs1810", "body": "Does this include practice on hearing a note and singing a requested interval above or below it and then the solution? I’ve been looking for something like that for a while. I can identify intervals between two notes just fine, just can’t produce them myself quite as well!", "created_utc": "1617639958.0", "edited": "False", "id": "gtgvo4c", "is_submitter": "False", "link_id": "t3_mkh84p", "parent_id": "t3_mkh84p", "score": "7", "subreddit": "musictheory", "subreddit_id": "t5_2qrjj"}, {"author": "jrs1810", "body": "Yeah I’d much rather be complimented on my work itself rather than how I have some mystical special sauce that either got me there naturally or makes for a natural aptitude to learn music. \n\nI think people forget that anyone who is physically capable actually can play an instrument. People call it talent because they think “oh i can’t do that” or “i can’t do that as well as you”. So you MUST have some sort of natural advantage, right? Wrong. What separates people from having the physical ability to do something and real raw skill at it, is mindset and practice/experience. That’s what we should admire.", "created_utc": "1617553525.0", "edited": "False", "id": "gtcyz2b", "is_submitter": "False", "link_id": "t3_mjvo0u", "parent_id": "t3_mjvo0u", "score": "3", "subreddit": "musictheory", "subreddit_id": "t5_2qrjj"}, {"author": "jrs1810", "body": "I got my first dan years ago and I’m thinking about coming back and continuing to work toward my second dan again. Right now, COVID is what’s stopping me from joining classes in my new city. But on top of that, I’m in terrible cardiovascular shape after being basically sedentary since March 2020. \n\nI’m also nervous to return because I know I’m definitely not what I used to be... Working my way there will be tough but it’s definitely going to be about small goals! I think if you not only set achievable goals, but also little checkpoints, it will be easier to persevere through to the big ones. Best of luck!", "created_utc": "1617381402.0", "edited": "False", "id": "gt5lwxb", "is_submitter": "False", "link_id": "t3_mfz4ct", "parent_id": "t3_mfz4ct", "score": "1", "subreddit": "taekwondo", "subreddit_id": "t5_2r3yo"}, {"author": "jrs1810", "body": "They’re great. Timpano percussion in Montréal has an online store and they sell Coopermans. Freer percussion is another great one for concert sticks. Their hornwood sticks are awesome. I use those and my coopermans all the time, can’t go wrong!", "created_utc": "1616019271.0", "edited": "False", "id": "gradagh", "is_submitter": "False", "link_id": "t3_m72zwi", "parent_id": "t3_m72zwi", "score": "1", "subreddit": "percussion", "subreddit_id": "t5_2rejv"}, {"author": "jrs1810", "body": "not only did nobody ask but you’re actually incorrect", "created_utc": "1614771620.0", "edited": "False", "id": "gpivfdp", "is_submitter": "False", "link_id": "t3_lwo0n9", "parent_id": "t1_gpiip76", "score": "10", "subreddit": "Drumming", "subreddit_id": "t5_2qxvm"}, {"author": "jrs1810", "body": "good call! i rerolled and got kril instead :)", "created_utc": "1608703321.0", "edited": "False", "id": "ggrutvm", "is_submitter": "True", "link_id": "t3_khmivg", "parent_id": "t1_ggm4i6k", "score": "1", "subreddit": "runescape", "subreddit_id": "t5_2qwxl"}, {"author": "jrs1810", "body": "I needed this. I’m a music student battling a plateau in my playing. Thank you for the little reminder, this is absolutely what I need to do :)", "created_utc": "1604630469.0", "edited": "False", "id": "gbawaad", "is_submitter": "False", "link_id": "t3_jovq6w", "parent_id": "t3_jovq6w", "score": "2", "subreddit": "Advice", "subreddit_id": "t5_2qjdm"}, {"author": "jrs1810", "body": "When you lower them lower the cymbals proportionately so they Just have enough clearance so they don’t hit the toms when struck. Same reasoning. It will be easier to reach :)", "created_utc": "1604623512.0", "edited": "False", "id": "gbai22d", "is_submitter": "False", "link_id": "t3_jopgro", "parent_id": "t1_gb9rs25", "score": "4", "subreddit": "Drumming", "subreddit_id": "t5_2qxvm"}, {"author": "jrs1810", "body": "i always tap the polyrhythm while i’m waiting to load in hahahah", "created_utc": "1604522108.0", "edited": "False", "id": "gb5k4nv", "is_submitter": "False", "link_id": "t3_jo0fq5", "parent_id": "t1_gb581r9", "score": "3", "subreddit": "VALORANT", "subreddit_id": "t5_2dkvmc"}, {"author": "jrs1810", "body": "Would you be comfortable sharing more about that? I quit recently and haven’t really gotten my own reasoning together.", "created_utc": "1604255437.0", "edited": "False", "id": "gatcw1f", "is_submitter": "False", "link_id": "t3_jlzw8v", "parent_id": "t1_gat0sp8", "score": "5", "subreddit": "leaves", "subreddit_id": "t5_2s9i3"}, {"author": "jrs1810", "body": "You should encourage her to get into school band/classical percussion when that’s possible!", "created_utc": "1603395166.0", "edited": "False", "id": "g9ohm8d", "is_submitter": "False", "link_id": "t3_jg1f22", "parent_id": "t3_jg1f22", "score": "2", "subreddit": "drums", "subreddit_id": "t5_2qie5"}, {"author": "jrs1810", "body": "Yo I had this exact experience with a Reyna yesterday who told me to “do everyone a favour and ff to save time”", "created_utc": "1602946057.0", "edited": "False", "id": "g93v8l0", "is_submitter": "False", "link_id": "t3_jcp3xx", "parent_id": "t1_g93elgj", "score": "1", "subreddit": "VALORANT", "subreddit_id": "t5_2dkvmc"}, {"author": "jrs1810", "body": "If someone is mean to me, my go-to response lately has been to either apologize to them (even when i’m not doing anything wrong) or say I’m trying my best. It seems like most of them expect you to be angry or upset in response, so when you don’t give them that, it kind of makes them sometimes take a step back.", "created_utc": "1602945840.0", "edited": "False", "id": "g93uu1g", "is_submitter": "False", "link_id": "t3_jcp3xx", "parent_id": "t3_jcp3xx", "score": "1", "subreddit": "VALORANT", "subreddit_id": "t5_2dkvmc"}, {"author": "jrs1810", "body": "For sure, i feel you on that!! If it’s any encouragement, you’re going to feel a lot better and more confident in yourself after you’ve done it. It really sounds like you have your mind made up, so I think you need to go with your gut on this one. I hope things go well for you :)", "created_utc": "1602909604.0", "edited": "False", "id": "g92pp5l", "is_submitter": "False", "link_id": "t3_jconki", "parent_id": "t1_g92phv3", "score": "1", "subreddit": "Advice", "subreddit_id": "t5_2qjdm"}, {"author": "jrs1810", "body": "I went through something similar when I was around your age. I came out to my mother at 16 and it ended up going pretty terrible. I’ve been dating girls in secret the whole time including now (4 yrs later) even though I’m out to her because she doesn’t accept/want to hear about them. If you feel like you will feel relieved regardless of the outcome, you can totally tell her. Please be aware of the possibility of it going poorly and approach the situation with that in your mind because I was totally blindsided. \n\nTry to make the decision that is best for you and your mental health because at the end of the day this is something you have every right to share or not! As for how to do it, I recommend asking your mom if you can talk privately, then make sure you tell her that you’ve been feeling really nervous and stressed about it all. For a lot of people, parent-mode kicks in and they want to comfort their child. Good luck!", "created_utc": "1602909261.0", "edited": "False", "id": "g92p945", "is_submitter": "False", "link_id": "t3_jconki", "parent_id": "t3_jconki", "score": "1", "subreddit": "Advice", "subreddit_id": "t5_2qjdm"}, {"author": "jrs1810", "body": "Get a practice pad! They’re like $10-$40 and they’re quiet and they give you proper rebound unlike the pillow.", "created_utc": "1601607236.0", "edited": "False", "id": "g7d0du8", "is_submitter": "False", "link_id": "t3_j3jkzo", "parent_id": "t1_g7cv8xu", "score": "8", "subreddit": "drums", "subreddit_id": "t5_2qie5"}, {"author": "jrs1810", "body": "yes and more specifically delecluse 8 from method pour caisse claire not from douze etudes :)", "created_utc": "1601432455.0", "edited": "False", "id": "g74s7eu", "is_submitter": "False", "link_id": "t3_j15rvy", "parent_id": "t1_g71c3ef", "score": "1", "subreddit": "percussion", "subreddit_id": "t5_2rejv"}, {"author": "jrs1810", "body": "That’s from delecluse timpani method", "created_utc": "1601321448.0", "edited": "False", "id": "g6zhumk", "is_submitter": "False", "link_id": "t3_j15rvy", "parent_id": "t3_j15rvy", "score": "2", "subreddit": "percussion", "subreddit_id": "t5_2rejv"}, {"author": "jrs1810", "body": "Anne pro 2 vs custom built in terms of cost and future proofing? I’m new to the mechanical keyboard world and I’m trying to decide if i should buy a prebuilt or buy parts!", "created_utc": "1600973984.0", "edited": "False", "id": "g6gcvwy", "is_submitter": "False", "link_id": "t3_iyuf4e", "parent_id": "t3_iyuf4e", "score": "2", "subreddit": "MechanicalKeyboards", "subreddit_id": "t5_2ugo7"}, {"author": "jrs1810", "body": "That’s a good idea i think!", "created_utc": "1600655999.0", "edited": "False", "id": "g626u68", "is_submitter": "False", "link_id": "t3_iwgwiu", "parent_id": "t1_g626p0f", "score": "1", "subreddit": "VALORANT", "subreddit_id": "t5_2dkvmc"}, {"author": "jrs1810", "body": "i had climbed out of the smurfing rank range in CS a couple yrs before the trust factor update. Maybe prime/trust factor did something to help the issue after I would have been affected? Maybe a similar system could be beneficial in valorant. It would be interesting to see what might actually be possible to discourage smurfing in val.", "created_utc": "1600655833.0", "edited": "False", "id": "g626k6r", "is_submitter": "False", "link_id": "t3_iwgwiu", "parent_id": "t1_g61fyzh", "score": "1", "subreddit": "VALORANT", "subreddit_id": "t5_2dkvmc"}, {"author": "jrs1810", "body": "For sure. I find it interesting that the laborious 20 unrated games before you can play comp doesn’t stop people from smurfing. I wonder what else can be done", "created_utc": "1600635838.0", "edited": "False", "id": "g6125n9", "is_submitter": "False", "link_id": "t3_iwgwiu", "parent_id": "t1_g6027em", "score": "2", "subreddit": "VALORANT", "subreddit_id": "t5_2dkvmc"}, {"author": "jrs1810", "body": "That’s fair and everything you’re saying makes a lot of sense. I’ve never been in bronze and I don’t really know what it’s like to have a problem with smurfs in Valorant. I came from CS:GO which also had a smurfing problem at the lower levels. At that time, my higher ranked friends told me that I can still learn and improve playing against people who are better than me. Even though it’s hard and it sucks to get absolutely shit on in a game, there’s lots you can do to practice your mechanics in the range and deathmatch and your gamesense develops with time and experience. \n\nI’d like to remind you that the smurfs you play against are just people too! Unless you have a shitty setup, their main advantage is experience. Be patient and open to learning. You’ll climb!", "created_utc": "1600621426.0", "edited": "False", "id": "g5zzons", "is_submitter": "False", "link_id": "t3_iwgwiu", "parent_id": "t3_iwgwiu", "score": "2", "subreddit": "VALORANT", "subreddit_id": "t5_2dkvmc"}, {"author": "jrs1810", "body": "YTA. My parents were rightfully concerned for my future when I was a high school senior applying for music school. We had the conversation about making sure I have other options if I don’t end up being able to get a music-based career. I appreciate them for that, because you need to have that in the back of your mind when you do these things.\n\nBut I disagree with you about the value you assign to a music degree. Respectfully, I think you are entirely misled. What you don’t want is your son to be a music teacher. Guess what, a large percentage of music students do not have that as a career goal. My plan is to study music because I am passionate about it and want to learn more. I’d like to audition for professional orchestras and take the performance route (which is often at a reasonable salary), but if it doesn’t work out, I can write the LSAT or MCAT and go to law school or med school. Or, I can do something completely different altogether. And if I don’t end up in music as a job, I learned extremely valuable skills and grew as a person under the pressure in music academia. I will never regret my decision because I am doing something that is meaningful to me every day instead of enduring something else.\n\nAs for finances, there are many merit-based and  need-based scholarships available. Help your son figure out how to access these and apply. Let him audition and see what he is offered. Do not dismiss his potential as not being worth your dollar. You don’t get to choose what he does with his adult life. You only get to choose to support him.\n\nLook into Canadian universities like McGill, UofT, MUN, Western, Acadia. All have great percussion programs with a fraction of the price tag of US schools. \n\nFeel free to message me with any questions and concerns. I am a dean’s list music student at a very reputable canadian university and went through similar with my parents.", "created_utc": "1600361358.0", "edited": "False", "id": "g5lq2ru", "is_submitter": "False", "link_id": "t3_iuj4qa", "parent_id": "t3_iuj4qa", "score": "1", "subreddit": "AmItheAsshole", "subreddit_id": "t5_2xhvq"}, {"author": "jrs1810", "body": "whats on your socks?", "created_utc": "1599677651.0", "edited": "False", "id": "g4knk3m", "is_submitter": "False", "link_id": "t3_iphd1h", "parent_id": "t3_iphd1h", "score": "1", "subreddit": "skatergirls", "subreddit_id": "t5_2sjav"}, {"author": "jrs1810", "body": "True shit. I gotta get back on my board and keep trying stuff. School’s been getting in the way for me. That’s awesome that your ollies have been clicking, have you considered trying front and back 180s and shuvs before kickflip? Just curious because I’ll be working on a new trick soon too :)", "created_utc": "1599600560.0", "edited": "False", "id": "g4hdlc5", "is_submitter": "False", "link_id": "t3_iowbrl", "parent_id": "t3_iowbrl", "score": "14", "subreddit": "skatergirls", "subreddit_id": "t5_2sjav"}, {"author": "jrs1810", "body": "Hey, I’m a girl who played CS for 5 years and Valorant for the past few weeks. I’ve been told I sound fat and transgender and ugly and all that stuff. My solution is to just play as good as I can and if they want to tell me I’m “good for a girl” then I’ll let them know they’re “good for a guy”.  Solo-queueing can be rough but man did it ever thicken my skin lol. Let me know if you want to queue up sometime! My messages are always open :)", "created_utc": "1598623889.0", "edited": "False", "id": "g34w814", "is_submitter": "False", "link_id": "t3_ihrr2v", "parent_id": "t3_ihrr2v", "score": "1", "subreddit": "VALORANT", "subreddit_id": "t5_2dkvmc"}, {"author": "jrs1810", "body": "What kind of stitching is the “liquid” filled in with?", "created_utc": "1598558333.0", "edited": "False", "id": "g324div", "is_submitter": "False", "link_id": "t3_ihlo1k", "parent_id": "t3_ihlo1k", "score": "2", "subreddit": "Embroidery", "subreddit_id": "t5_2rh53"}, {"author": "jrs1810", "body": "Song?", "created_utc": "1598468989.0", "edited": "False", "id": "g2xvqmq", "is_submitter": "False", "link_id": "t3_igy3uk", "parent_id": "t3_igy3uk", "score": "2", "subreddit": "VALORANT", "subreddit_id": "t5_2dkvmc"}, {"author": "jrs1810", "body": "2 factor authentication maybe?", "created_utc": "1598414231.0", "edited": "False", "id": "g2vlo7f", "is_submitter": "True", "link_id": "t3_ib3ntp", "parent_id": "t1_g1yhy4c", "score": "1", "subreddit": "SneakersCanada", "subreddit_id": "t5_3hpvk"}, {"author": "jrs1810", "body": "Can’t wait for this day to come for me. Pure joy, man. Congrats on the new learn!", "created_utc": "1598372007.0", "edited": "False", "id": "g2tbisa", "is_submitter": "False", "link_id": "t3_ig4r97", "parent_id": "t3_ig4r97", "score": "3", "subreddit": "NewSkaters", "subreddit_id": "t5_2tqri"}, {"author": "jrs1810", "body": "My first time entering a raffle, the only raffle i’ve ever entered, and I won too! Congrats man :)", "created_utc": "1598148199.0", "edited": "False", "id": "g2jkbn4", "is_submitter": "False", "link_id": "t3_iepigk", "parent_id": "t3_iepigk", "score": "2", "subreddit": "SneakersCanada", "subreddit_id": "t5_3hpvk"}, {"author": "jrs1810", "body": "Won a pair on the adidas raffle!! Thanks for your help guys! :)", "created_utc": "1598118378.0", "edited": "False", "id": "g2hvo6n", "is_submitter": "True", "link_id": "t3_ib3ntp", "parent_id": "t3_ib3ntp", "score": "1", "subreddit": "SneakersCanada", "subreddit_id": "t5_3hpvk"}, {"author": "jrs1810", "body": "I was able to put my canadian address in fine! Not sure what the issue is", "created_utc": "1598048811.0", "edited": "False", "id": "g2dh70n", "is_submitter": "True", "link_id": "t3_ib3ntp", "parent_id": "t1_g2d2pkc", "score": "1", "subreddit": "SneakersCanada", "subreddit_id": "t5_3hpvk"}, {"author": "jrs1810", "body": "i’m not seeing it on the footlocker release thingy, i’ve been keeping an eye out for it to be put on there all month.. Where on the adidas app do I enter? I can’t find anything about these specific shoes anywhere lol", "created_utc": "1597623818.0", "edited": "False", "id": "g1sebav", "is_submitter": "True", "link_id": "t3_ib3ntp", "parent_id": "t1_g1sdr7x", "score": "5", "subreddit": "SneakersCanada", "subreddit_id": "t5_3hpvk"}, {"author": "jrs1810", "body": "where are u auditioning?", "created_utc": "1596859030.0", "edited": "False", "id": "g0r9j7v", "is_submitter": "False", "link_id": "t3_i5pmxa", "parent_id": "t3_i5pmxa", "score": "2", "subreddit": "percussion", "subreddit_id": "t5_2rejv"}, {"author": "jrs1810", "body": "I guess I don't know her personally, so I can't entirely say what she would want, but I'm a 19 year old female so I'll offer my thoughts... If my father wanted to do better for me and do something nice (like a surprise) for me, I would appreciate it being more of an experience together than a materialistic item. Especially if your fears you mentioned have made you emotionally distant. Find something fun that you both can do together and bond with. Make positive memories with her. I have way too many friends who have fathers that shower them with money and gifts because of guilt. That is no way to build a relationship and make someone feel loved. At the end of the day, if you put in the right efforts, she will remember your positive change more than your negative past. Best of luck!", "created_utc": "1596728912.0", "edited": "False", "id": "g0kncib", "is_submitter": "False", "link_id": "t3_i4j5oj", "parent_id": "t3_i4j5oj", "score": "1", "subreddit": "Advice", "subreddit_id": "t5_2qjdm"}, {"author": "jrs1810", "body": "NTA. He’s playing serious mind games with you switching up all the time acting like certain events never happened and making you seem like the problem. That’s toxic.", "created_utc": "1596411473.0", "edited": "False", "id": "g05lde3", "is_submitter": "False", "link_id": "t3_i2bnbn", "parent_id": "t3_i2bnbn", "score": "1", "subreddit": "AmItheAsshole", "subreddit_id": "t5_2xhvq"}, {"author": "jrs1810", "body": "I set timers to break my studying into intervals of like 20-45 minutes (depending on my focus that day) of fully dedicated studying with no distractions. I always put anything distracting away and put my full attention on my studying during this time. Then after my timer goes off, i set a break timer of 5-15 minutes (depending on the study interval length). By having frequent breaks of proportionate length, you allow yourself time to indulge the distractions between the time where you cant. It works for me because I’m very easily distracted. :)", "created_utc": "1596202708.0", "edited": "False", "id": "fzuz8ik", "is_submitter": "False", "link_id": "t3_i129rb", "parent_id": "t3_i129rb", "score": "2", "subreddit": "Advice", "subreddit_id": "t5_2qjdm"}, {"author": "jrs1810", "body": "what if you just got really good at skating switch lol, when you wear down your usual front foot you work on learning all your tricks switch? you could be like... ambidextrous but for skate stances", "created_utc": "1595604101.0", "edited": "False", "id": "fz3jq15", "is_submitter": "False", "link_id": "t3_hwtqlb", "parent_id": "t1_fz3hlfx", "score": "2", "subreddit": "skatergirls", "subreddit_id": "t5_2sjav"}, {"author": "jrs1810", "body": "cool leg bro!!", "created_utc": "1595597727.0", "edited": "False", "id": "fz37noa", "is_submitter": "False", "link_id": "t3_hwzk42", "parent_id": "t3_hwzk42", "score": "1", "subreddit": "aww", "subreddit_id": "t5_2qh1o"}, {"author": "jrs1810", "body": "i wish skate shoe companies sold individual replacement shoes", "created_utc": "1595592578.0", "edited": "False", "id": "fz2zttw", "is_submitter": "False", "link_id": "t3_hwtqlb", "parent_id": "t3_hwtqlb", "score": "8", "subreddit": "skatergirls", "subreddit_id": "t5_2sjav"}, {"author": "jrs1810", "body": "If you want to message me to ask anything you want about orchestral percussion I’d be happy to try my best to help!", "created_utc": "1595557072.0", "edited": "False", "id": "fz1r66l", "is_submitter": "False", "link_id": "t3_hueks0", "parent_id": "t3_hueks0", "score": "2", "subreddit": "percussion", "subreddit_id": "t5_2rejv"}, {"author": "jrs1810", "body": "That’s sick! Where are you located?", "created_utc": "1595550550.0", "edited": "False", "id": "fz1frzm", "is_submitter": "False", "link_id": "t3_hwnr4i", "parent_id": "t3_hwnr4i", "score": "2", "subreddit": "percussion", "subreddit_id": "t5_2rejv"}, {"author": "jrs1810", "body": "Cheating can be very very damaging to the person cheated on. I think you need to take your control of the situation back and either break up with her or take a break for you to reflect. Make it your decision only. It is a horrible thing to do to someone and even if she really cares about you and really feels remorseful, it was her responsibility to uphold the terms of your relationship. Would you have cheated on her under the same sort of circumstances? Her brain in that moment said that it was okay and that she could go ahead and do it. That is a huge problem. How can you trust her to not do it again? Or break your trust in another way? Ultimately up to you, but I think you need to take your time and think about the situation for what it is without the input of her emotions influencing you... And be kind to yourself. I am sure you are more than enough and you clearly care about her a lot. This wasn’t your fault.", "created_utc": "1595464975.0", "edited": "False", "id": "fyxkc1e", "is_submitter": "False", "link_id": "t3_hw2j64", "parent_id": "t3_hw2j64", "score": "1", "subreddit": "Advice", "subreddit_id": "t5_2qjdm"}, {"author": "jrs1810", "body": "Nobody- the varial flip that he did in the video had toe drag", "created_utc": "1595258689.0", "edited": "False", "id": "fynzy42", "is_submitter": "False", "link_id": "t3_hui1se", "parent_id": "t1_fynzcru", "score": "10", "subreddit": "NewSkaters", "subreddit_id": "t5_2tqri"}, {"author": "jrs1810", "body": "Is she.. you know.", "created_utc": "1595198018.0", "edited": "False", "id": "fylomab", "is_submitter": "False", "link_id": "t3_hu4hai", "parent_id": "t3_hu4hai", "score": "1", "subreddit": "skatergirls", "subreddit_id": "t5_2sjav"}, {"author": "jrs1810", "body": "homie had a little accident in your hand", "created_utc": "1594829170.0", "edited": "False", "id": "fy5mk0x", "is_submitter": "False", "link_id": "t3_hrn6tl", "parent_id": "t3_hrn6tl", "score": "2", "subreddit": "aww", "subreddit_id": "t5_2qh1o"}, {"author": "jrs1810", "body": "did you watch wbatb final", "created_utc": "1594749351.0", "edited": "False", "id": "fy24f0q", "is_submitter": "False", "link_id": "t3_hr4bnu", "parent_id": "t1_fy23hjp", "score": "2", "subreddit": "skatergirls", "subreddit_id": "t5_2sjav"}, {"author": "jrs1810", "body": "Oh and also, pick up 2 pairs of balter blues for vibes. They’re nothing incredible but they’re a decent basic vibe mallet and I’ve actually used them in setups pretty frequently. I find them to be useful to have.", "created_utc": "1594667663.0", "edited": "False", "id": "fxyizay", "is_submitter": "False", "link_id": "t3_hqlghd", "parent_id": "t3_hqlghd", "score": "3", "subreddit": "percussion", "subreddit_id": "t5_2rejv"}, {"author": "jrs1810", "body": "I recommend:\n- becker blues for xylo\n\n- cooperman 1s for snare\n\n- vic firth van sice medium (2 pairs) for a solid budget friendly marimba mallet. I ended up also receiving marimba one wave wraps as a gift and they’re awesome but expensive. I have not yet needed a graduated set of marimba mallets.\n\n- you need timpani mallets but i’m the wrong one to ask about those unfortunately. I showed up to music school with vic firth general and vic firth staccato and my teachers were never fully satisfied with either..\n\n- you will eventually need brass glock mallets for certain excerpts and pieces, but the need is less pressing than good xylo/marimba/snare mallets.\n\nYou will kind of always be adding to your collection because different pieces will call for different mallets so you should be mostly concerned with getting good quality versatile mallets at first instead of having every single hardness and material.\n\nGet a good mallet bag. I use a humes & berg galaxy grip bag and i love it. Message me if you have any questions! I’ve been there :)", "created_utc": "1594667531.0", "edited": "False", "id": "fxyip8q", "is_submitter": "False", "link_id": "t3_hqlghd", "parent_id": "t3_hqlghd", "score": "1", "subreddit": "percussion", "subreddit_id": "t5_2rejv"}, {"author": "jrs1810", "body": "damn that’s actually what i’m kinda going for!! i’m going to start wearing my helmet more often :)", "created_utc": "1594659359.0", "edited": "False", "id": "fxy1jr0", "is_submitter": "False", "link_id": "t3_hq57yi", "parent_id": "t3_hq57yi", "score": "1", "subreddit": "NewSkaters", "subreddit_id": "t5_2tqri"}, {"author": "jrs1810", "body": "you’re killing it. the concrete is waiting for you bro hahaha", "created_utc": "1594606250.0", "edited": "False", "id": "fxw1cix", "is_submitter": "False", "link_id": "t3_hq2iy1", "parent_id": "t3_hq2iy1", "score": "3", "subreddit": "NewSkaters", "subreddit_id": "t5_2tqri"}, {"author": "jrs1810", "body": "hey golden t rex", "created_utc": "1594522927.0", "edited": "False", "id": "fxsi54k", "is_submitter": "False", "link_id": "t3_hpgado", "parent_id": "t3_hpgado", "score": "2", "subreddit": "aww", "subreddit_id": "t5_2qh1o"}, {"author": "jrs1810", "body": "yeah man! i started skating every day now, i can feel the progress coming soon 🤞🏻🤞🏻", "created_utc": "1594310062.0", "edited": "False", "id": "fxfls3p", "is_submitter": "True", "link_id": "t3_hns0ko", "parent_id": "t1_fxdn8aj", "score": "1", "subreddit": "NewSkaters", "subreddit_id": "t5_2tqri"}, {"author": "jrs1810", "body": "i tried to run it out but it didn’t happen for me 😅hahahhahaha", "created_utc": "1594310003.0", "edited": "False", "id": "fxflno3", "is_submitter": "True", "link_id": "t3_hns0ko", "parent_id": "t1_fxe3sok", "score": "1", "subreddit": "NewSkaters", "subreddit_id": "t5_2tqri"}, {"author": "jrs1810", "body": "i start every skate sesh just riding around my neighbourhood, it builds confidence on the board and will definitely improve your pushing. \nthen whatever it is you want to learn, work on it for a good amount of time, don’t just do a few attempts and call it a day... things can take hundreds of tries, but don’t give up! And if you happen to get TOO frustrated, either do something on the board you find more fun, or put it down for the day. It’s all about fun after all! :) \nIf you really want to progress quickly though, you just gotta put in the hours cruising around and working on stuff. There’s no shortcut! And everyone takes different amounts of time to get their ollies for example. You got it :)", "created_utc": "1594309363.0", "edited": "False", "id": "fxfkc8g", "is_submitter": "False", "link_id": "t3_hnujt4", "parent_id": "t3_hnujt4", "score": "5", "subreddit": "skatergirls", "subreddit_id": "t5_2sjav"}, {"author": "jrs1810", "body": "for sure! u got it :)", "created_utc": "1594242257.0", "edited": "False", "id": "fxcrh5r", "is_submitter": "False", "link_id": "t3_hnetq1", "parent_id": "t1_fxcqxxs", "score": "3", "subreddit": "NewSkaters", "subreddit_id": "t5_2tqri"}, {"author": "jrs1810", "body": "if my ollies looked like yours i’d be “kind of” stoked!!! If you’re not already practicing them rolling, you’re definitely ready to.", "created_utc": "1594235058.0", "edited": "False", "id": "fxcce2y", "is_submitter": "False", "link_id": "t3_hnetq1", "parent_id": "t3_hnetq1", "score": "6", "subreddit": "NewSkaters", "subreddit_id": "t5_2tqri"}, {"author": "jrs1810", "body": "Absolutely possible to switch the audio to French. I use Canadian Netflix (I'm Canadian) to watch french and german tv and you just switch the language and subtitle preference when you load up the show. Captions and language are in the same little section.", "created_utc": "1593884764.0", "edited": "False", "id": "fwx7pae", "is_submitter": "False", "link_id": "t3_hl4iqr", "parent_id": "t1_fwx3auw", "score": "3", "subreddit": "French", "subreddit_id": "t5_2rd5t"}, {"author": "jrs1810", "body": "Yea man they’re just low and choppy really. I’ll keep at them! Thanks :)", "created_utc": "1592784504.0", "edited": "False", "id": "fvl6fs3", "is_submitter": "True", "link_id": "t3_hdfm7t", "parent_id": "t1_fvl36aj", "score": "3", "subreddit": "NewSkaters", "subreddit_id": "t5_2tqri"}, {"author": "jrs1810", "body": "And that’s what it’s all about. :)", "created_utc": "1592758415.0", "edited": "False", "id": "fvjvq6d", "is_submitter": "False", "link_id": "t3_hcz1vj", "parent_id": "t3_hcz1vj", "score": "2", "subreddit": "NewSkaters", "subreddit_id": "t5_2tqri"}, {"author": "jrs1810", "body": "Super clever idea!", "created_utc": "1592758221.0", "edited": "False", "id": "fvjvdkf", "is_submitter": "False", "link_id": "t3_hd26u5", "parent_id": "t3_hd26u5", "score": "1", "subreddit": "language_exchange", "subreddit_id": "t5_2tdbm"}, {"author": "jrs1810", "body": "Definitely agree with you about the passion/discipline situation. The reason for not both (at least not concurrently) is because school stuff and practicing (i’m a music major) takes up almost my entire day every day. If I want to make progress with either language, I’d need to allocate enough time for that.. So, that’s why i figure i need to choose!", "created_utc": "1592683015.0", "edited": "False", "id": "fvgxb47", "is_submitter": "False", "link_id": "t3_hcsbbq", "parent_id": "t1_fvgw736", "score": "0", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "jrs1810", "body": "Facts", "created_utc": "1592590571.0", "edited": "False", "id": "fvd0uex", "is_submitter": "False", "link_id": "t3_hbsnk9", "parent_id": "t1_fvatulf", "score": "2", "subreddit": "HealthAnxiety", "subreddit_id": "t5_2vmoc"}, {"author": "jrs1810", "body": "I think it’s pretty clear that he likes the attention (negative or not) based on his post history. He seemingly has no intentions of doing anything except for feeling sorry for himself and trying to get others to entertain it", "created_utc": "1592579712.0", "edited": "False", "id": "fvceyme", "is_submitter": "False", "link_id": "t3_hbsnk9", "parent_id": "t1_fvb4vjk", "score": "2", "subreddit": "HealthAnxiety", "subreddit_id": "t5_2vmoc"}, {"author": "jrs1810", "body": "Then do something about it. Stop making posts on reddit and go get help. You ignore everyone’s advice anyhow. If you want your problems to improve, you need to take the first step.", "created_utc": "1592535611.0", "edited": "False", "id": "fvatdjg", "is_submitter": "False", "link_id": "t3_hbsnk9", "parent_id": "t3_hbsnk9", "score": "3", "subreddit": "HealthAnxiety", "subreddit_id": "t5_2vmoc"}, {"author": "jrs1810", "body": "Just go with it as a happy accident! Good job. I like your style! Keep killing it :)", "created_utc": "1587730270.0", "edited": "False", "id": "fof9e54", "is_submitter": "False", "link_id": "t3_g6wiqa", "parent_id": "t3_g6wiqa", "score": "2", "subreddit": "NewSkaters", "subreddit_id": "t5_2tqri"}, {"author": "jrs1810", "body": "Thanks so much for the detailed response!! Steps like this are exactly what I was hoping for. I’m definitely glad I posted, I feel like I have a lot more information towards how to actually start playing.\n\nI’ll have to figure out what I can do towards this all during quarantine time.", "created_utc": "1585814136.0", "edited": "False", "id": "fm75n1t", "is_submitter": "True", "link_id": "t3_fr8ol9", "parent_id": "t1_flur38k", "score": "1", "subreddit": "hockeyplayers", "subreddit_id": "t5_2vs1b"}, {"author": "jrs1810", "body": "I’m located in Montreal", "created_utc": "1585813939.0", "edited": "False", "id": "fm75gch", "is_submitter": "True", "link_id": "t3_fr8ol9", "parent_id": "t1_flulfho", "score": "1", "subreddit": "hockeyplayers", "subreddit_id": "t5_2vs1b"}, {"author": "jrs1810", "body": "I’m located in Montreal! :)", "created_utc": "1585813924.0", "edited": "False", "id": "fm75ft2", "is_submitter": "True", "link_id": "t3_fr8ol9", "parent_id": "t1_flujywd", "score": "1", "subreddit": "hockeyplayers", "subreddit_id": "t5_2vs1b"}, {"author": "jrs1810", "body": "Thanks!! The junior gear is a great suggestion, I may actually be able to fit that.", "created_utc": "1585813827.0", "edited": "False", "id": "fm75ci2", "is_submitter": "True", "link_id": "t3_fr8ol9", "parent_id": "t1_flus3a3", "score": "2", "subreddit": "hockeyplayers", "subreddit_id": "t5_2vs1b"}, {"author": "jrs1810", "body": "I actually figure skated competitively when I was younger. That was the alternative my parents offered to hockey lol. I guess it’ll help me out after all hahah", "created_utc": "1585813780.0", "edited": "False", "id": "fm75ays", "is_submitter": "True", "link_id": "t3_fr8ol9", "parent_id": "t1_fm4qo9m", "score": "2", "subreddit": "hockeyplayers", "subreddit_id": "t5_2vs1b"}, {"author": "jrs1810", "body": "EST", "created_utc": "1579558480.0", "edited": "False", "id": "ff49if0", "is_submitter": "True", "link_id": "t3_emzuo3", "parent_id": "t1_fdvqc9v", "score": "1", "subreddit": "language_exchange", "subreddit_id": "t5_2tdbm"}, {"author": "jrs1810", "body": ">Ich würde dir gerne mit Deutsch helfen, jedoch kann ich kein Französisch\n\nKein Problem! Msg me.", "created_utc": "1579558449.0", "edited": "False", "id": "ff49gnv", "is_submitter": "True", "link_id": "t3_emzuo3", "parent_id": "t1_fdxrw5g", "score": "1", "subreddit": "language_exchange", "subreddit_id": "t5_2tdbm"}, {"author": "jrs1810", "body": "I’m living in a uni residence that has room inspections", "created_utc": "1579306385.0", "edited": "False", "id": "feovmy1", "is_submitter": "True", "link_id": "t3_eq7ou1", "parent_id": "t1_feou1yj", "score": "1", "subreddit": "vaporents", "subreddit_id": "t5_2upjd"}, {"author": "jrs1810", "body": "Message me! I’m native English and living in Quebec, trying to learn some French because of that.", "created_utc": "1579305342.0", "edited": "False", "id": "feotqgy", "is_submitter": "False", "link_id": "t3_eq6ub1", "parent_id": "t3_eq6ub1", "score": "3", "subreddit": "language_exchange", "subreddit_id": "t5_2tdbm"}, {"author": "jrs1810", "body": "(Without the sploof)", "created_utc": "1579300728.0", "edited": "False", "id": "feoiotx", "is_submitter": "True", "link_id": "t3_eq7ou1", "parent_id": "t1_feoih9d", "score": "1", "subreddit": "vaporents", "subreddit_id": "t5_2upjd"}, {"author": "jrs1810", "body": "Will it leave any traces on furniture/windows?", "created_utc": "1579300710.0", "edited": "False", "id": "feoin5z", "is_submitter": "True", "link_id": "t3_eq7ou1", "parent_id": "t1_feoih9d", "score": "1", "subreddit": "vaporents", "subreddit_id": "t5_2upjd"}, {"author": "jrs1810", "body": "Language Requested: French and/or German\n\n&#x200B;\n\nApproximate level: In french, beginner'ish. I've taken French classes growing up in school, but they all just aimed at verb conjugation. I now live in Montreal and I'm interested in gathering a better understanding of French, whether it is in the Quebecois dialect or not.\n\nIn German, definitely beginner.\n\n&#x200B;\n\nLanguage offered: English\n\n&#x200B;\n\nDays of the week and times available: It varies. I'm a university student studying music and exams, concerts, and rehearsals all change my availability regularly. Message me and I can sort out times.", "created_utc": "1572302079.0", "edited": "False", "id": "f5nnbzs", "is_submitter": "False", "link_id": "t3_do4x84", "parent_id": "t3_do4x84", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "jrs1810", "body": "thank you very much!!", "created_utc": "1566256831.0", "edited": "False", "id": "exg6x5w", "is_submitter": "True", "link_id": "t3_csni04", "parent_id": "t1_exfyceq", "score": "2", "subreddit": "NewSkaters", "subreddit_id": "t5_2tqri"}, {"author": "jrs1810", "body": "hyped for you!", "created_utc": "1562124328.0", "edited": "False", "id": "esn76xi", "is_submitter": "False", "link_id": "t3_c8g1l1", "parent_id": "t3_c8g1l1", "score": "2", "subreddit": "NewSkaters", "subreddit_id": "t5_2tqri"}, {"author": "jrs1810", "body": "solid, how long did it take you", "created_utc": "1562103813.0", "edited": "False", "id": "esmeikj", "is_submitter": "False", "link_id": "t3_c8ewax", "parent_id": "t3_c8ewax", "score": "4", "subreddit": "skatergirls", "subreddit_id": "t5_2sjav"}, {"author": "jrs1810", "body": "DUDE NICE", "created_utc": "1562103791.0", "edited": "False", "id": "esmeham", "is_submitter": "False", "link_id": "t3_c8ewax", "parent_id": "t3_c8ewax", "score": "7", "subreddit": "skatergirls", "subreddit_id": "t5_2sjav"}, {"author": "jrs1810", "body": "Thank you very much, this actually helped a lot. I was having a lot of trouble visualizing how I could possibly spend time on everything but reading your comment has definitely got me inspired with new ideas for a \"potential schedule\"", "created_utc": "1562018792.0", "edited": "False", "id": "esird0m", "is_submitter": "False", "link_id": "t3_c7zwgp", "parent_id": "t1_esiisso", "score": "2", "subreddit": "Advice", "subreddit_id": "t5_2qjdm"}, {"author": "jrs1810", "body": "bruuuhhh it’s okay", "created_utc": "1561911602.0", "edited": "False", "id": "esewws0", "is_submitter": "False", "link_id": "t3_c7g5lq", "parent_id": "t3_c7g5lq", "score": "3", "subreddit": "NewSkaters", "subreddit_id": "t5_2tqri"}, {"author": "jrs1810", "body": "dude that background... looks like ur in a horror movie or something", "created_utc": "1561140214.0", "edited": "False", "id": "erqcko7", "is_submitter": "False", "link_id": "t3_c323by", "parent_id": "t3_c323by", "score": "1", "subreddit": "NewSkaters", "subreddit_id": "t5_2tqri"}, {"author": "jrs1810", "body": "Fuck yeah! I’m super motivated to keep practicing. Can’t wait to see my progress :) That’s good advice too, my instinct is to think super hard about every little motion. I guess good things happen sometimes when you just send it! Thanks for the feedback man, I’ll be practicing for sure.", "created_utc": "1560699595.0", "edited": "False", "id": "erc0pam", "is_submitter": "True", "link_id": "t3_c149fn", "parent_id": "t1_erbv5g8", "score": "2", "subreddit": "NewSkaters", "subreddit_id": "t5_2tqri"}, {"author": "jrs1810", "body": "Made a note of that for next time!! Thank you very much :)", "created_utc": "1560646797.0", "edited": "False", "id": "eral0nd", "is_submitter": "True", "link_id": "t3_c149fn", "parent_id": "t1_erakrso", "score": "1", "subreddit": "NewSkaters", "subreddit_id": "t5_2tqri"}, {"author": "jrs1810", "body": "I really took your suggestions into consideration when I practiced today. The sitting down thing I think was super helpful, and the way you worded the timing also made a difference to me. Here’s my results from today:\n\n[Ollie Day 4 ](https://www.reddit.com/r/NewSkaters/comments/c149fn/does_this_count_as_an_ollie/?utm_source=share&utm_medium=ios_app) \n\nLet me know what you think :)", "created_utc": "1560646723.0", "edited": "False", "id": "erakwyw", "is_submitter": "False", "link_id": "t3_c0dfif", "parent_id": "t1_er4ernv", "score": "1", "subreddit": "NewSkaters", "subreddit_id": "t5_2tqri"}, {"author": "jrs1810", "body": "Should I be thinking jumppopslide or should i be thinking popslidejump? Or is the timing okay and I just need to jump higher?", "created_utc": "1560472797.0", "edited": "False", "id": "er3u70r", "is_submitter": "False", "link_id": "t3_c0dfif", "parent_id": "t1_er3tu55", "score": "3", "subreddit": "NewSkaters", "subreddit_id": "t5_2tqri"}, {"author": "jrs1810", "body": "Also, do I want overhang with the side of my foot off the middle of the tail?", "created_utc": "1560471673.0", "edited": "False", "id": "er3sq09", "is_submitter": "False", "link_id": "t3_c0dfif", "parent_id": "t1_er3sbm6", "score": "1", "subreddit": "NewSkaters", "subreddit_id": "t5_2tqri"}, {"author": "jrs1810", "body": "I can totally see the whole foot on the tail in the day 1 clips. in the second set of videos, or rather the 3rd and 4th clips, i feel like the back foot was looking better, did i correct it in those or is it still not quite where it should be?", "created_utc": "1560471595.0", "edited": "False", "id": "er3smd8", "is_submitter": "False", "link_id": "t3_c0dfif", "parent_id": "t1_er3sbm6", "score": "1", "subreddit": "NewSkaters", "subreddit_id": "t5_2tqri"}, {"author": "jrs1810", "body": "whats this thing called lmao i want. i’m new no h8", "created_utc": "1552923548.0", "edited": "False", "id": "eit3pmn", "is_submitter": "False", "link_id": "t3_b2a35p", "parent_id": "t3_b2a35p", "score": "1", "subreddit": "vaporents", "subreddit_id": "t5_2upjd"}, {"author": "jrs1810", "body": "Whered you order man help me out lol", "created_utc": "1552725712.0", "edited": "False", "id": "einfgjo", "is_submitter": "False", "link_id": "t3_b1m9ah", "parent_id": "t3_b1m9ah", "score": "1", "subreddit": "oilpen", "subreddit_id": "t5_3nhnf"}, {"author": "jrs1810", "body": "Thanks so much guys! I’m kinda struggling with my fitness lately and the help is very much appreciated. ", "created_utc": "1550330489.0", "edited": "False", "id": "eglmva7", "is_submitter": "False", "link_id": "t3_apea48", "parent_id": "t3_apea48", "score": "1", "subreddit": "Fitness", "subreddit_id": "t5_2qhx4"}, {"author": "jrs1810", "body": "How do I get through cardio when I’m extremely out of cardiovascular shape and I cannot breathe when I do cardio for any length of time?", "created_utc": "1549936159.0", "edited": "False", "id": "eg9wpqm", "is_submitter": "False", "link_id": "t3_apea48", "parent_id": "t3_apea48", "score": "2", "subreddit": "Fitness", "subreddit_id": "t5_2qhx4"}, {"author": "jrs1810", "body": "where’s this to? i’m from corner brook :)", "created_utc": "1546241520.0", "edited": "False", "id": "ecxki4d", "is_submitter": "False", "link_id": "t3_aayggg", "parent_id": "t3_aayggg", "score": "2", "subreddit": "weed", "subreddit_id": "t5_2qhpc"}]