[{"author": "kaeya_lilies", "body": "Read manga in Japanese, watch anime without subs and comprehend music automatically without translating them 🥹", "created_utc": "1664621208.0", "edited": "False", "id": "iqlza1y", "is_submitter": "False", "link_id": "t3_xs632q", "parent_id": "t3_xs632q", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "kaeya_lilies", "body": "People always say German and Russian sounds mean and angry but it sounds very nice to me? I know a lot of people exaggerate their own languages for comedic effects but when I hear actual German and Russian it sounds nice?\n\nI’m a native Arabic speaker and i can see how some people would perceive it as angry sounding but i’m guessing it’s because of the letters خ and غ where a lot of languages don’t have it. \n\nI’m learning Japanese and maybe i’m biased when i say this but it’s a very pretty sounding language!!", "created_utc": "1664621066.0", "edited": "False", "id": "iqlz40m", "is_submitter": "False", "link_id": "t3_xsamzv", "parent_id": "t3_xsamzv", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "kaeya_lilies", "body": "I’m a native Arabic speaker and I’ve been speaking English since I was like 3 or 5 and I’m currently learning Japanese (N4).\n\nSince I’ve been speaking English for so long, I tend to jumble up some of the word order in Arabic because of it or phrase things weirdly.\n\nI also notice that I would say things like “I feel like___” and I’d say it in Arabic too even though it’s not use, at least in my dialect  \"احس\" instead of \"اشوف\" (I see).\n\nAs for Japanese, there are a lot of instances where Japanese is used when I speak in Arabic.\n\nWhen expressing an opinion, I’ve been taught that that the sentence would end with と思います and, like the English, I would do it in Arabic and I end up speaking like Yoda 🥲", "created_utc": "1664620630.0", "edited": "1664621449.0", "id": "iqlyl55", "is_submitter": "False", "link_id": "t3_xsk77o", "parent_id": "t3_xsk77o", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "kaeya_lilies", "body": "that’s because i’m on a social media application. i’m not publishing a research paper or emailing a professor.\n\nand you’re right, i don’t know much about how universities work in japan and i’ve tried researching but i couldn’t find what i was looking for so that’s why i decided to write a post here.", "created_utc": "1663165061.0", "edited": "False", "id": "ioedw7q", "is_submitter": "False", "link_id": "t3_xdz8z9", "parent_id": "t1_ioed2qa", "score": "1", "subreddit": "TranslationStudies", "subreddit_id": "t5_2uk7r"}, {"author": "kaeya_lilies", "body": "any recommendations? because i don’t have much experience tbh.", "created_utc": "1663157718.0", "edited": "False", "id": "iodxjlm", "is_submitter": "True", "link_id": "t3_xdzmah", "parent_id": "t1_iodvjw7", "score": "1", "subreddit": "teachinginjapan", "subreddit_id": "t5_3c154"}, {"author": "kaeya_lilies", "body": "thank you so much! will definitely look into it :)", "created_utc": "1663157700.0", "edited": "False", "id": "iodxieb", "is_submitter": "True", "link_id": "t3_xdzmah", "parent_id": "t1_iodw9iw", "score": "2", "subreddit": "teachinginjapan", "subreddit_id": "t5_3c154"}, {"author": "kaeya_lilies", "body": "i would but i’m not sure what to do. i was thinking of teaching english while studying japanese to get n2 and then study translations to become a translator.", "created_utc": "1663157674.0", "edited": "False", "id": "iodxgiv", "is_submitter": "True", "link_id": "t3_xdzmah", "parent_id": "t1_iodunzm", "score": "5", "subreddit": "teachinginjapan", "subreddit_id": "t5_3c154"}, {"author": "kaeya_lilies", "body": "of course!! also, i highly recommend using [this website](https://tryjlpt.com/en/) as it has a lot of tests that are curated similarly to the actual jlpt tests.\n\nso, the vocab section of the test focuses on recognition of hiragana, katakana and kanji.\n\nthe second is grammar is mostly conjugation from what i remember (it’s been almost a year so i’m sorry 😅)\n\nlistening is difficult for me. you listen to paragraphs like:\n\n“Hello Mrs. Suzuki, I want to go to the supermarket but I don’t know how to go. Could you please tell me the directions? I’m in front of the train stations that’s in front of the cafe and the park is on my right.”\n\n“Sure, Mr. Tanaka. Go straight down the road, and turn right on the first corner. You should see the hospital on your left. It’s a small building with a lot of trees in front of it. Take a right when you see it. The supermarket should be on your left.”\n\nand then it shows you four maps and you have to choose the correct one based on the description.\n\nor maybe it’ll talk about a preparation for an exam.\n\n“Alright class. Your test is next week. Please study lessons 1-3. Please come see me if you have any questions.”\n\n“Teacher can we use a calculator for the test?”\n\n“No, you are not allowed to use a calculator. You can use a pencil. You are not allowed to use a pen.”\n\nand then the question would be based on that like what can they use on the test? out of these items below, which one is prohibited to use in the test? what were the lesson numbers the teacher mentioned?\n\nThere was also a question where someone was asking for someone else’s phone number too 🥲\n\nAlso, you’re only allowed to listen to the audio once.", "created_utc": "1662579777.0", "edited": "False", "id": "inhr1vv", "is_submitter": "True", "link_id": "t3_x82t5w", "parent_id": "t1_inhnrwf", "score": "2", "subreddit": "LearnJapanese", "subreddit_id": "t5_2qyls"}, {"author": "kaeya_lilies", "body": "you guessed correctly :)\n\nthe test wasn’t the difficult tbh. the first section of the exam is mcq that’s based on grammar and vocab. and then section two is also mcq but focuses more on comprehension. the last section is the listening and that one was difficult for me since i tend to zone out 😅", "created_utc": "1662577924.0", "edited": "False", "id": "inhlzkf", "is_submitter": "True", "link_id": "t3_x82t5w", "parent_id": "t1_inhlh2f", "score": "2", "subreddit": "LearnJapanese", "subreddit_id": "t5_2qyls"}, {"author": "kaeya_lilies", "body": "i sadly don’t do what you do 🥲\n\nmy n4 level is by studying minna no nihongo and the book kanji challenge so i don’t know that much. that’s why i want to play a game where i can understand at least half of what they’re saying.\n\nthank you for the recommendations :)", "created_utc": "1662577218.0", "edited": "False", "id": "inhk4h1", "is_submitter": "True", "link_id": "t3_x82t5w", "parent_id": "t1_ingsltd", "score": "1", "subreddit": "LearnJapanese", "subreddit_id": "t5_2qyls"}, {"author": "kaeya_lilies", "body": "thank you!", "created_utc": "1662558186.0", "edited": "False", "id": "ing7372", "is_submitter": "True", "link_id": "t3_x82t5w", "parent_id": "t1_ing6yxw", "score": "2", "subreddit": "LearnJapanese", "subreddit_id": "t5_2qyls"}, {"author": "kaeya_lilies", "body": "ohh that sounds like an interesting game! where can i find it?", "created_utc": "1662558085.0", "edited": "False", "id": "ing6ul2", "is_submitter": "True", "link_id": "t3_x82t5w", "parent_id": "t1_ing6qer", "score": "2", "subreddit": "LearnJapanese", "subreddit_id": "t5_2qyls"}, {"author": "kaeya_lilies", "body": "that’s true. i guess i might be mislead by tiktok videos.  \n\nas a muslim it could be challenging to live there since, from what i’ve heard, restaurants don’t accommodate your wishes (you can’t alter meals) so it’s a bit interesting to learn about stuff like that :)", "created_utc": "1662557992.0", "edited": "False", "id": "ing6mvu", "is_submitter": "False", "link_id": "t3_x84eq2", "parent_id": "t1_ing4tdf", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "kaeya_lilies", "body": "Although Japan is **still** very sexist and patriarchal, i’m still learning the language for many reasons. one of them is that i want to know what the feminist movement is like in japan and the content i’ve found on youtube aren’t much. i’m hoping that when i know enough, i can read books or articles about feminism in Japan.\n\nAlso, I am muslim and Japan isn’t very religious but there are a lot of muslims in Japan and I want to understand their struggles living in Japan.", "created_utc": "1662556568.0", "edited": "False", "id": "ing3fyi", "is_submitter": "False", "link_id": "t3_x84eq2", "parent_id": "t3_x84eq2", "score": "-1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "kaeya_lilies", "body": "i get it but i’m only n4 😅", "created_utc": "1662555747.0", "edited": "False", "id": "ing1og9", "is_submitter": "False", "link_id": "t3_x25sq2", "parent_id": "t1_infyjfr", "score": "4", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "kaeya_lilies", "body": "no i completely agree with you.\n\ni just asked because i wanted to see if there’s a way to make studying more fun.\n\ni watch slice of life anime for vocabulary purposes and i get so happy when i recognize words i know but i’m getting tired of anime right now so i thought maybe there are games i can play 😅", "created_utc": "1662555734.0", "edited": "False", "id": "ing1nfh", "is_submitter": "True", "link_id": "t3_x82t5w", "parent_id": "t1_ing12iq", "score": "13", "subreddit": "LearnJapanese", "subreddit_id": "t5_2qyls"}, {"author": "kaeya_lilies", "body": "i think you’re doing a bit too much.\n\nit’s best to create a schedule/make a planner that’s suitable to your level.\n\ni see people who know japanese from watching anime and jdorama and i get jealous but i know that we all have different abilities.\n\nfor me, repetition works best. i memorize, get a single sheet of paper and write down what i memorize. one or two mistake and i do it all over again until i get it right.\n\nmy friend learns better through reading. another through speaking. it honestly depends on the time you have and the energy.\n\na large quantity isn’t always a good thing.", "created_utc": "1662550722.0", "edited": "False", "id": "infrwzr", "is_submitter": "False", "link_id": "t3_x82otx", "parent_id": "t3_x82otx", "score": "-1", "subreddit": "LearnJapanese", "subreddit_id": "t5_2qyls"}, {"author": "kaeya_lilies", "body": "i always struggled between choosing to learn korean or japanese. i cant do both because i want to select one and focus on that and go above and beyond.\n\ni picked korean and i could instantly tell it isn’t for me. i’ve been exposed to the language for a very long time but when i took classes, i realized how to difficult it is for me. when i listen to audios, kdrama or kpop, all the words blur together and i couldn’t pick them apart even if i knew some of them. \n\nthe grammar was okay but i didn’t enjoy it. however i didn’t understand batchim so i felt overwhelmed and dropped korean after three months.\n\ni’ve been studying japanese for almost two years now and i’m doing much better than i did with korean. especially when i have more interest in the language itself so i can easily find source materials (i did the same with korean but i just wasn’t interested in the language itself) and i’m so glad that i switched to japanese and stuck with it.", "created_utc": "1662535855.0", "edited": "False", "id": "inf88n9", "is_submitter": "False", "link_id": "t3_x7srom", "parent_id": "t3_x7srom", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "kaeya_lilies", "body": "I create quizlet flash cards for each lesson, hit the learn option and then i click flash card option and write down the word that pops up. if i have one or more mistakes by the end, i restart the flash card and do it all over again until i have no mistakes. it sounds like a long thing to do but it really isn’t. \n\nand then, later that night or the following morning, i use the flash card feature and write down the words again and continue on with other tasks.", "created_utc": "1662211117.0", "edited": "False", "id": "imx8mof", "is_submitter": "False", "link_id": "t3_x4u6dz", "parent_id": "t3_x4u6dz", "score": "5", "subreddit": "LearnJapanese", "subreddit_id": "t5_2qyls"}, {"author": "kaeya_lilies", "body": "私のしゅみはアニメを見ることです。アニメを見て日本語がわかります。おもしろいことばを聞いたとき、先生に聞けるようにノートに書いておきます。そして、日本人のように話すようになりたいです。名探偵コナンを見るのがいちばん好きでいろいろなレベルのことばがありますから。たとえば、「爆発」をならいました。\r\rほかのしゅみもあります。かくうのものがたりを書くのが好きです。リラックスできるので書きます。たいていまほうとまほうのいきものを書いています。でも、このごろ日本語をべんきょうするのでむずかしいです。私はあまり上手ではありませんが、まだ書くのが好きです。とても楽しいですから。\r私のゆめは日本語でかくうのものがたりが書けます。それをするために、毎日日本語をべんきょうしています。", "created_utc": "1662203158.0", "edited": "False", "id": "imwvcuv", "is_submitter": "False", "link_id": "t3_x25sq2", "parent_id": "t3_x25sq2", "score": "6", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "kaeya_lilies", "body": "i don’t study the whole day tbh. i just spread out my work throughout the day so that i won’t end up hating the language, be burnt out and so that i can focus on other things as well.", "created_utc": "1661850928.0", "edited": "False", "id": "imd5kqg", "is_submitter": "False", "link_id": "t3_x0oqyk", "parent_id": "t3_x0oqyk", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}]