[{"author": "Karst_Kraver", "body": "I'm a similar comprehension level, I go for YA-aimed novels (stuff I would read in my native language anyway) and just have the novel open in Polish and English. When I come across a word/sentence I'm not sure on I can just glance at the English section. Much quicker than dictionary lookups and a nicer before-bed reading experience than reading on a computer screen (I.e. through something like LingQ). I use two Kindles side-by-side which makes it super convenient, but paper copies would probably be fine too. \nI think my main advice would be to just read something that you would read in your native language anyway and just find a way to make it comprehensible for you. Personally I tried kid's and learner-orientated books and just couldn't engage with them.", "created_utc": "1661976296.0", "edited": "False", "id": "imkeqtt", "is_submitter": "False", "link_id": "t3_x2d7am", "parent_id": "t3_x2d7am", "score": "3", "subreddit": "Polish", "subreddit_id": "t5_2rhyf"}, {"author": "Karst_Kraver", "body": "Duel-reading (chapter in NL, then re-read the chapter in 2L) has been vaguely working for me, however when the book picks up pace the 2L re-read starts to feel like a chore so I'm definitely going to give this method a go!", "created_utc": "1661505288.0", "edited": "False", "id": "iluj9ir", "is_submitter": "False", "link_id": "t3_wx157v", "parent_id": "t3_wx157v", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Karst_Kraver", "body": "Enjoying Cracow Monsters (Krakowskie Potwory) atm", "created_utc": "1648817611.0", "edited": "False", "id": "i2z745g", "is_submitter": "False", "link_id": "t3_ttp6ww", "parent_id": "t3_ttp6ww", "score": "3", "subreddit": "Polish", "subreddit_id": "t5_2rhyf"}, {"author": "Karst_Kraver", "body": "Not super visual but I can recomend the book by Lynda Girvan and Debra Paul called Agile and Business Analysis: Practical guidance for IT professionals. \n\nTo echo the other comments, you've just got to get stuck in. You can follow whatever non-Agile BA process you would normally use, you're just going to iterate through it much quicker and with a smaller set of requirements. \n\nEmbrace failing fast but consider using diagrams, wireframes and low-fidelity prototypes as much as possible to keep cost of failure low and not piss off your devs. Figma is great for UI mock ups.\nLearn how to write good User Stories (I.e. As a X User, I would like X, so that I can achieve X) and Acceptance Criteria :)", "created_utc": "1647451131.0", "edited": "False", "id": "i0woti8", "is_submitter": "False", "link_id": "t3_tf82a9", "parent_id": "t3_tf82a9", "score": "2", "subreddit": "businessanalysis", "subreddit_id": "t5_2r48q"}, {"author": "Karst_Kraver", "body": "I've been working through this Anki deck for the last few years:\n\nhttps://ankiweb.net/shared/info/3199057698 \n\nAll the verb cards have the perfective and imperfective forms together (plus other categories where relevant). You could download it, filter out the non-verbs and use it as a standalone list if you don't want to get into Anki.\nI like using the free Vocab Tracker website/Chrome extension (vocabtracker.com) when I read in Polish. It's like a free version of LingQ but it let's you save words as their lemma and then it highlights any form of that word when it comes up, which is super helpful for building grammar comprehension.", "created_utc": "1645033916.0", "edited": "False", "id": "hx77q4m", "is_submitter": "False", "link_id": "t3_stdy37", "parent_id": "t3_stdy37", "score": "3", "subreddit": "Polish", "subreddit_id": "t5_2rhyf"}, {"author": "Karst_Kraver", "body": "https://courseofpolish.com/ \nThe Interactive Noun Declension exercises are awesome for drilling.\nSpeak Polish by Justyna Bednarek is nice and succinct.\nIf you can find a copy, Hugo's Polish in 3 Months gives a good overview of all the important bits.", "created_utc": "1643824901.0", "edited": "False", "id": "hvb03zn", "is_submitter": "False", "link_id": "t3_sisvit", "parent_id": "t3_sisvit", "score": "7", "subreddit": "learnpolish", "subreddit_id": "t5_2u72v"}, {"author": "Karst_Kraver", "body": "Dawid, przyjaciel Roberta, ma ukochanego kota o imieniu Mars. Dawid znalazł kota, gdy uprawiał jogging. Pies dziewczyny zaatakował go, ale kot przyszedł na ratunek Dawidowi.", "created_utc": "1637607878.0", "edited": "False", "id": "hlo7ps9", "is_submitter": "False", "link_id": "t3_qyc7xm", "parent_id": "t3_qyc7xm", "score": "1", "subreddit": "WriteStreakPolish", "subreddit_id": "t5_5711js"}, {"author": "Karst_Kraver", "body": "First of all, nice one! That's awesome progress :) Would love to hear more specifics on how you've achieved you're progress so far! \n\nIf you're solid with the grammar then I think reaching those higher levels is mainly about expanding vocab. I think it's pretty exponential though, so whilst you might have got to B1 with 2000 words for example, it might take another 4000 words on top to get near B2.\nIt's worth bearing in mind that fluency is domain-specific. Assuming you're not in medicine, you couldn't walk into a hospital in your native country and truly understand what the medical professionals were saying to each other, but that doesn't mean you're not a native speaker... So you could start getting a head start by thinking about the hobbies, jobs and day to day activities you'll be doing in Poland and focusing on vocab around those topics, whilst starting to talk with your partner about current events to simulate general chit chat.", "created_utc": "1637092747.0", "edited": "False", "id": "hkw7nek", "is_submitter": "False", "link_id": "t3_qv7n74", "parent_id": "t3_qv7n74", "score": "3", "subreddit": "Polish", "subreddit_id": "t5_2rhyf"}, {"author": "Karst_Kraver", "body": "I've been learning Polish for about 3 years.\nI started with an App (Duolingo but any of the Apps will be probably be fine initally) and the gamification and fact that everything is read out loud (even if by a robot voice) really helped me to get over the initial hurdle. I also read some general articles on pronunciation which helped simplify it and used Forzo to hear word pronunciation if my (Native Polish) wife wasn't around to help. Once you've got your mouth around the grouped sounds (I.e. dzie, przy, sz (a hard 'sh') vs ś (a softer 'shee') etc.) and work out how you break down Polish words into syllables (usually on each vowel) and that the stress is generally on the penultimate syllable it does get easier! I look at English spellings compared with their pronunciation now and think \"wtf, this is so complicated compared to Polish!\" 😁\n\nListening to music in Polish has also helped massively and been a really fun way to practice by trying to sing along. Find out what bands your partner likes and explore Polish artists in your preferred genre. I listen to the Antyradio 'Made in Poland' station at work which is mostly Polish classics and a good place to start. I use Readlang (like a free version of LingQ) to sync song lyrics with their youtube video and then play it back slowly and sing along until I can go at full speed.\n\nI'm really jealous that you and your partner have found a way to work on your Polish together in a fun way! Tbh, I think in the long term this will count far more than dragging yourself through lessons. It's something me and my wife still haven't figured out properly yet and I'm frustratingly behind on my active skills despite living with someone I could technically have a conversation with every day! I'm sure your partner's family are just grateful that you're even trying regardless of whether you're taking formal lessons :)", "created_utc": "1637091290.0", "edited": "False", "id": "hkw3z6d", "is_submitter": "False", "link_id": "t3_qv5552", "parent_id": "t3_qv5552", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Karst_Kraver", "body": "Dziękuję!\n\"does not separate two logical sentences\" - I've not heard the use of commas described like that before, thanks for the simple explanation :)", "created_utc": "1635181823.0", "edited": "False", "id": "hi0965v", "is_submitter": "False", "link_id": "t3_qczapo", "parent_id": "t1_hhyr34z", "score": "1", "subreddit": "WriteStreakPolish", "subreddit_id": "t5_5711js"}, {"author": "Karst_Kraver", "body": "Stoję na przystanku, przed pubem. Widzę przed sobą  posterunek policji i bibliotekę. Mamy chłodny wiatr ale za to jest słonecznie.", "created_utc": "1634915301.0", "edited": "False", "id": "hhmn1ci", "is_submitter": "False", "link_id": "t3_qczapo", "parent_id": "t3_qczapo", "score": "1", "subreddit": "WriteStreakPolish", "subreddit_id": "t5_5711js"}, {"author": "Karst_Kraver", "body": "I'm interested too 🙂", "created_utc": "1628432343.0", "edited": "False", "id": "h866p4d", "is_submitter": "False", "link_id": "t3_ozurwe", "parent_id": "t3_ozurwe", "score": "1", "subreddit": "Polish", "subreddit_id": "t5_2rhyf"}, {"author": "Karst_Kraver", "body": "I have high arches and have no issues running in minimalist footwear (Skinners v2 including for trail runs) and am up to 2 hour+ happily, having transitioned about 2 years ago. I have put quite a lot of focus on form, making sure I have a clean mid foot strike, and I foam roll before every run, but I think it's just mainly that the mid foot strike and short ground contact time means high arches are a non-issue, at least in my case.\nI can't say the same for walking though. I've spent a similar amount of time working on my walking form (just normal heel-toe movement) but my forefeet still ache (metatarsalgia) after an hour or more of walking so I'm starting to consider getting some Altras or something similar just for hiking.", "created_utc": "1626971737.0", "edited": "False", "id": "h656wlj", "is_submitter": "False", "link_id": "t3_ooxf1v", "parent_id": "t3_ooxf1v", "score": "1", "subreddit": "BarefootRunning", "subreddit_id": "t5_2rp0r"}, {"author": "Karst_Kraver", "body": "Second this. RealPolish.pl seems like a great option for you as it focuses on communication and can allow you to acquire vocabulary without necessarily memorising things.\nI would be a little wary of going down the app route as many of them are quite strict on spelling so it may become frustrating, plus not all of them are conversation focused. If you do, I would spend some time trying out the different platforms available to see which app works the best for you.\nAnother suggestion to look at is PolishPod101 as you can listen to the lessons.\nAnd don't forget textbooks 😁 I really like Speak Polish by Justyna Bednarek as it's exercise based with really useful, simplified, grammar explanations and a focus on useful phrases and vocabulary. \nMy final tip would be that once you have a reasonable grounding then don't be afraid to start adding in native material in whatever media format you like the most in your NL. So if you love playing video games for example, replay your favourite in Polish, or do the same with your favourite film or TV show etc. It may be slow-going but it won't feel like studying ☺", "created_utc": "1626803185.0", "edited": "False", "id": "h5wf6vn", "is_submitter": "False", "link_id": "t3_oo0kwa", "parent_id": "t1_h5vvphz", "score": "2", "subreddit": "learnpolish", "subreddit_id": "t5_2u72v"}, {"author": "Karst_Kraver", "body": "I'm a fellow learner and what I've found is that if I don't explicitly pronounce the accents at the end of words, the Pole I'm speaking to will assume I'm making a mistake and that I don't understand the grammar rules and so will correct me (even though they don't bother...). This can get a bit annoying as there's an element of \"do what I say not as I do\" where I will get corrected for saying a sentence in the exact same way a native would because I haven't put enough emphasis on the accent to prove my understanding.\nBasically, you might sound a bit stuffy but you at least won't sound thick and won't get corrected by your 3 year old Polish nephew all the time👍", "created_utc": "1619598497.0", "edited": "False", "id": "gw5fxs7", "is_submitter": "False", "link_id": "t3_mzxpvn", "parent_id": "t3_mzxpvn", "score": "2", "subreddit": "learnpolish", "subreddit_id": "t5_2u72v"}, {"author": "Karst_Kraver", "body": "I originally started learning my TL (Polish) with just Duolingo, which helped get me over the initial hurdles but once I got through the tree I realised the actual vocabulary wasn't going to be very useful. I switched to focus on learning by word frequency using a shared Anki deck with 10,000 words and sentences derived from a film subtitle database and ordered by frequency. I have definitely felt a big leap in comprehension but agree with FrostyMamouth3469 that you won't necessarily be able to use the words unless you make an effort to practise. ClozeMaster teaches words by frequency and in context so might be a good place to start. But I think you would still want something like a traditional text book to go through at the same time otherwise you won't learn basics like numbers, or the grammar required to actually use the words properly. \n\nTLDR:\nIn summary, I think if you are a starting a new language from scratch, then first cover some basics with an app, text book, good online resource or lessons, and then start utilising word frequency lists, using spaced repetition software like Anki to ensure you retain the new vocabulary and making time to practise using the new vocabulary and reading it in context.", "created_utc": "1617396421.0", "edited": "False", "id": "gt6g03v", "is_submitter": "False", "link_id": "t3_mis9vq", "parent_id": "t3_mis9vq", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Karst_Kraver", "body": "With dictionary integration maybe there could then be an optional \"hint\" button which would give you the word in your NL? Or, even better, a setting which would allow you to choose the hint to be either the translation in your NL, or the dictionary description in your TL (without showing the actual word so you still have to pick from the drag'n'drop options or remember the vocabulary.", "created_utc": "1614285129.0", "edited": "False", "id": "goqzjlt", "is_submitter": "False", "link_id": "t3_ls1hfr", "parent_id": "t1_gopdjas", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Karst_Kraver", "body": "I have a pair of Aftershocks I use for running. I imagine the technology would work under a helmet but I don't see how they would be comfortable and they need to be in quite a precise position to work well. I've found even trying to wear a hat on top of mine too uncomfortable and detrimental to the sound level. I guess you could experiment with fitting them into the liner of the helmet but I think it would take a fair amount of trial and error to find a comfortable and optimal position.", "created_utc": "1610205507.0", "edited": "False", "id": "gint3c6", "is_submitter": "False", "link_id": "t3_kts9a1", "parent_id": "t3_kts9a1", "score": "8", "subreddit": "motorcycles", "subreddit_id": "t5_2qi6d"}]