[{"author": "KatarinaDelRey", "body": "It's only worth it if you want to learn it! Dutch is a beautiful language", "created_utc": "1664251937.0", "edited": "False", "id": "iq2cocm", "is_submitter": "False", "link_id": "t3_xoyca7", "parent_id": "t3_xoyca7", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "KatarinaDelRey", "body": "I prefer online but that's probably biased because I had horrible language classroom experiences. I'd prefer classroom only if I could frequently talk to the other students in that language but that would depend on the students", "created_utc": "1664251746.0", "edited": "False", "id": "iq2ccs8", "is_submitter": "False", "link_id": "t3_xozj3r", "parent_id": "t3_xozj3r", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "KatarinaDelRey", "body": "Everyone has different boundaries of what they’re willing to accept. Clearly, this one thing is affecting you so much that you are doubting whether you love him or not. This might not affect others that much but everyone is different. For some people, passion is extremely important, like for you, and that’s perfectly fine. But now you have to see whether he is going to be willing to take steps to change his sex drive (clearly working 12 hours is not helping. Also there are therapies for this). And If he doesn’t want to or nothing works, you have to make the decision if it’s worth it or not. Simply telling you to « deal with this » wouldn’t be the answer. I dont think any of you are in the wrong, it’s just not everyone has the same expectations", "created_utc": "1662163869.0", "edited": "False", "id": "imv6xhv", "is_submitter": "False", "link_id": "t3_x4g6pt", "parent_id": "t3_x4g6pt", "score": "1", "subreddit": "relationship_advice", "subreddit_id": "t5_2r0cn"}, {"author": "KatarinaDelRey", "body": "Im 22 now, my native language is Spanish but I started to learn English at the age of 7. I first learned Greek when I was 13, I studied it a lot for 4 years and my level was very good but then I stopped and I forgot a lot of it, going to relearn it later!\n I started to learn French from scratch when I was 20 I believe and I recently started learning Italian at 22", "created_utc": "1661988076.0", "edited": "False", "id": "iml86wc", "is_submitter": "False", "link_id": "t3_x2obim", "parent_id": "t3_x2obim", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "KatarinaDelRey", "body": "Honestly, the hard thing for me is LEARNING the language from scratch. You go through (what I like to call) a « critical period » in the beginner and early intermediate stages where you have to be very consistent about learning it, or you will forget very fast. This period might last few months, a year, or even more. I find that maintenance is much easier, as all you would have to do is consume media in your TL weekly and do language exchanges now and then. But the difficult part is learning a language and going through that critical period while having a full time job, a family, etc. It’s for that reason that I’m taking advantage of the free time I have as a college student. \n\nLike someone else said, learning 7 languages to a B2 level is VERY ambitious for someone in the position you described. Even maintaining 7 languages is not easy. A more realistic number for someone busy like that would be learning and maintaining 2 languages, anything more than that might be too much. Ultimately it depends on you and how quickly you learn also influences it. Anything is possible but after a certain point you need to make sacrifices that might not be worth making", "created_utc": "1661964242.0", "edited": "False", "id": "imjj2rz", "is_submitter": "False", "link_id": "t3_x2ex5q", "parent_id": "t3_x2ex5q", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "KatarinaDelRey", "body": "Les États-Unis offrent  (généralement)  un beau salaire et plein d'opportunités à ceux qui travaillent dur, et ici, c'est plus facile de faire prospérer un business. Mais il faut y réfléchir, est-ce que ça vaut le coup avec les fusillades qui ont lieu jour après jour, le système de santé (il faut payer 50 dollars juste pour qu'un médecin puisse te dire \"Vous êtes en forme!\"),  et le coût extrêmement élevé des universités (Je viens de payer 1k dollars pour un cours)\n\nBon c'est pas si horrible, c'est quand même possible de vivre une belle vie ici, mais tu as de la chance d'avoir vécu en France, alors si tu décides d'y retourner ce serait pas trop difficile", "created_utc": "1661919143.0", "edited": "False", "id": "imhcepe", "is_submitter": "False", "link_id": "t3_x22jdy", "parent_id": "t3_x22jdy", "score": "1", "subreddit": "france", "subreddit_id": "t5_2qhjz"}, {"author": "KatarinaDelRey", "body": "On a fait des recherches sur ce sujet et la mélatonine (pour l’insomnie chronique) marche que chez les vieux. Je te recommande d’essayer les TCCI en première intention", "created_utc": "1661915510.0", "edited": "False", "id": "imh5poh", "is_submitter": "False", "link_id": "t3_x203t9", "parent_id": "t3_x203t9", "score": "1", "subreddit": "france", "subreddit_id": "t5_2qhjz"}, {"author": "KatarinaDelRey", "body": "Really? I had no idea! I read the American ending", "created_utc": "1661869163.0", "edited": "False", "id": "ime132f", "is_submitter": "False", "link_id": "t3_x0zx9r", "parent_id": "t1_imc98y8", "score": "3", "subreddit": "books", "subreddit_id": "t5_2qh4i"}, {"author": "KatarinaDelRey", "body": "Yes exactly! I thought about these questions for so long when I first read the book although the first time I read it I didn’t like it because it was too violent for me at the time. As an adult I can appreciate it much better", "created_utc": "1661869101.0", "edited": "False", "id": "ime0xpo", "is_submitter": "False", "link_id": "t3_x0zx9r", "parent_id": "t1_imctf30", "score": "1", "subreddit": "books", "subreddit_id": "t5_2qh4i"}, {"author": "KatarinaDelRey", "body": "The book that messed me up the most was A Clockwork Orange, and not because it was just a dystopia. I'm accustomed to there being \"good guys\" in a book. The people here who are supposed to be \"not evil\" or \"against evil\" perform dreadful experiments and actually manage to make the reader feel empathy for a sadist and rapist (aka Alex, the main character)", "created_utc": "1661808346.0", "edited": "False", "id": "imb2f0f", "is_submitter": "False", "link_id": "t3_x0zx9r", "parent_id": "t3_x0zx9r", "score": "36", "subreddit": "books", "subreddit_id": "t5_2qh4i"}, {"author": "KatarinaDelRey", "body": "I definitely wouldn't think of them in a bad way, it's so insignificant and everyone is capable of messing up when they are drunk. I'm shocked that it affected you socially for even more than a month, but life goes on after college and if this is truly embarrassing, just remember that no one you meet will know about it", "created_utc": "1661807658.0", "edited": "False", "id": "imb0uc8", "is_submitter": "False", "link_id": "t3_x0zlf2", "parent_id": "t3_x0zlf2", "score": "8", "subreddit": "college", "subreddit_id": "t5_2qh3z"}, {"author": "KatarinaDelRey", "body": "And why shouldn't you hate her? Are we just supposed to love everyone just because we're related? Nah, as soon as you're old enough leave and never talk to her again", "created_utc": "1661807143.0", "edited": "False", "id": "imazolw", "is_submitter": "False", "link_id": "t3_x0zq1o", "parent_id": "t3_x0zq1o", "score": "2", "subreddit": "TrueOffMyChest", "subreddit_id": "t5_2yuqy"}, {"author": "KatarinaDelRey", "body": "What do you mean by actively learning? Does TV count, for example? I do something related to every language every day unless I'm going on a trip (whether it's reading, language exchange, watching TV or studying the grammar). I prefer not taking a day off because that would amount to 52 days of the year in total, which is a lot for me, but it could still be a great plan", "created_utc": "1661788428.0", "edited": "False", "id": "im9pvrd", "is_submitter": "False", "link_id": "t3_x0oqyk", "parent_id": "t3_x0oqyk", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "KatarinaDelRey", "body": "Your question really depends on many factors.\nFirst of all, statistically speaking, being fluent in 5 or 6 languages is very rare. Simply using and understanding 5 or 6 languages on a weekly basis (even in just an intermediate level) is already rare in many parts of the world. In some countries in Africa and in some regions of India, for example, it is pretty standard to know or speak 4 languages, but it’s almost never the standard to know more than that. (I know it’s still possible but it usually does not happen)\nHowever, does it mean it’s impossible? In the worst case scenario, you have someone who is monolingual who needs to learn 4 or 5 more languages to a fluent level to satisfy what you’re talking about. Unless language learning is your sole hobby, you most likely won’t do this. But it’s still possible If you dedicate many years of your life\nThe best case scenario is that someone has naturally learned those languages due to family or external influences. In that case, it will be very easy for them to maintain those languages since most likely they were raised speaking them \n\nIn the case of the person who originally spoke only one and wants to learn many others in adulthood, I’d say that if you have a full time job and other hobbies unrelated to language learning then you’re going to have a tough time being fluent in 5 or 6. You will have to make some sacrifices and give up other things\n\nHowever, to answer your question, of course it’s possible, but you have to take those things into account. Someone who already naturally speaks 4 and needs to only become fluent in 1 or 2 to satisfy what you’re saying is different from someone who only speaks one at the moment", "created_utc": "1661725762.0", "edited": "1661746396.0", "id": "im6nva2", "is_submitter": "False", "link_id": "t3_wzx5k4", "parent_id": "t3_wzx5k4", "score": "4", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "KatarinaDelRey", "body": "As long as it's published as one book, I consider it to be that way. For example, if a large book is composed of many short stories, I just consider that one book, regardless of the total length. If the book is short in length, yet published as a regular book, then I would also include that. In general, I'm not concerned about the length, just about how it's published. However, if the book has lots of pictures and a few words, I probably would't include it, but that's just me :)", "created_utc": "1661569392.0", "edited": "False", "id": "ilyg24m", "is_submitter": "False", "link_id": "t3_wyqori", "parent_id": "t3_wyqori", "score": "2", "subreddit": "books", "subreddit_id": "t5_2qh4i"}, {"author": "KatarinaDelRey", "body": "I’ve felt like this so many times. That feeling you just want to drop out and try another class you think might be easier. And every time I think this, I realize the class was much much easier than I thought. Once in a while, you might stumble upon a class that’s actually difficult, but most of the time it’s just the fear of failure. Don’t procrastinate, work on this class seriously every day and you should be fine :)", "created_utc": "1661469609.0", "edited": "False", "id": "ilstpgk", "is_submitter": "False", "link_id": "t3_wxsnpi", "parent_id": "t3_wxsnpi", "score": "2", "subreddit": "college", "subreddit_id": "t5_2qh3z"}, {"author": "KatarinaDelRey", "body": "Eating spicy food", "created_utc": "1661469378.0", "edited": "False", "id": "ilst6qd", "is_submitter": "False", "link_id": "t3_wxsmmv", "parent_id": "t3_wxsmmv", "score": "2", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "KatarinaDelRey", "body": "Uh…. Don’t really get your anger here? It seems like she’s being pretty respectful. Either way, it seems like she will be out of your life soon, so it’s win win", "created_utc": "1661464373.0", "edited": "False", "id": "ilshg03", "is_submitter": "False", "link_id": "t3_wxqdir", "parent_id": "t3_wxqdir", "score": "7", "subreddit": "relationship_advice", "subreddit_id": "t5_2r0cn"}, {"author": "KatarinaDelRey", "body": "I'd say it highly depends on your level and if you can maintain them by simply consuming media in your TL. At a solid B2 level, you should be able to watch shows and read most books without an issue. At that point, you can just do that a few times a week, talk with a native like once a week, and your level shouldn't get worse. It just won't improve. It might seem easy, but as you start adding languages, it starts to add up. Unless language learning is your only hobby OR you do it for a living, I personally wouldn't recommend maintaining more than 3 languages at once, especially if you don't plan on reaching the B2 level on one of them.", "created_utc": "1661463609.0", "edited": "False", "id": "ilsfk2s", "is_submitter": "False", "link_id": "t3_wxo2oc", "parent_id": "t3_wxo2oc", "score": "9", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "KatarinaDelRey", "body": "Candide de Voltaire. Même si le roman a un sens de l'humour très sombre, l'histoire est pas loin de la réalité.", "created_utc": "1661309943.0", "edited": "False", "id": "iljoc1n", "is_submitter": "False", "link_id": "t3_ww6tjw", "parent_id": "t3_ww6tjw", "score": "2", "subreddit": "france", "subreddit_id": "t5_2qhjz"}, {"author": "KatarinaDelRey", "body": "It’s extremely disrespectful of your girlfriend to be hanging out with a dude that likes her and buys her gifts at 3 am in the morning, or any time for that matter. There’s nothing for you to improve because you have every right to feel the way you do, I personally wouldn’t tolerate it. She seems to want the best of both worlds: to have a boyfriend and to keep living the single life", "created_utc": "1661142509.0", "edited": "False", "id": "ila6uw7", "is_submitter": "False", "link_id": "t3_wujrn5", "parent_id": "t3_wujrn5", "score": "7", "subreddit": "relationship_advice", "subreddit_id": "t5_2r0cn"}, {"author": "KatarinaDelRey", "body": "My advice might be strange but she might be scared of the test itself, I avoided Covid tests because they legit stick the thing all the way up your nose and it’s so painful. However, you can tell her that there are at-home tests that don’t require this and I have no idea why she’d refuse at that point. Maybe if you’re truly desperate you can purchase the test for her yourself \nEither way, make sure you are wearing a mask constantly and that so is she", "created_utc": "1661142250.0", "edited": "False", "id": "ila6fsc", "is_submitter": "False", "link_id": "t3_wuiwzd", "parent_id": "t3_wuiwzd", "score": "1", "subreddit": "college", "subreddit_id": "t5_2qh3z"}, {"author": "KatarinaDelRey", "body": "You look fine!! It depends on the woman but in college most people won’t care what you do so you should just do what you want :)", "created_utc": "1661142016.0", "edited": "False", "id": "ila61x7", "is_submitter": "False", "link_id": "t3_wujeuq", "parent_id": "t3_wujeuq", "score": "4", "subreddit": "malegrooming", "subreddit_id": "t5_2s4uu"}, {"author": "KatarinaDelRey", "body": "Who knows what will happen? Just enjoy it for what it is, if you’re truly happy", "created_utc": "1660971758.0", "edited": "False", "id": "il15ghb", "is_submitter": "False", "link_id": "t3_wsxhc7", "parent_id": "t3_wsxhc7", "score": "15", "subreddit": "relationship_advice", "subreddit_id": "t5_2r0cn"}, {"author": "KatarinaDelRey", "body": "Oh well if it isn’t the consequences of my actions!", "created_utc": "1660968664.0", "edited": "False", "id": "il10ffn", "is_submitter": "False", "link_id": "t3_wsrgnb", "parent_id": "t3_wsrgnb", "score": "1", "subreddit": "TrueOffMyChest", "subreddit_id": "t5_2yuqy"}, {"author": "KatarinaDelRey", "body": "I’ve heard French grammar is harder than Spanish grammar so it makes sense! \n\nI know what you mean though, I had to re-do my French grammar book 😢", "created_utc": "1660951325.0", "edited": "False", "id": "il00wrv", "is_submitter": "False", "link_id": "t3_wspith", "parent_id": "t1_ikzxzah", "score": "21", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "KatarinaDelRey", "body": "They’re not sad for a clump of cells, they’re sad for “what could have happened.” \nDo you get it", "created_utc": "1660948372.0", "edited": "False", "id": "ikzu5oz", "is_submitter": "False", "link_id": "t3_wsqvwx", "parent_id": "t3_wsqvwx", "score": "1", "subreddit": "relationship_advice", "subreddit_id": "t5_2r0cn"}, {"author": "KatarinaDelRey", "body": "Tu pourrais faire des exercises avec de la musique. Par exemple, choisis la mélodie d’une chanson, écoute-la dans le but de juste ressentir la musique, et puis essaie de répéter à haute voix ce que tu as retenu. \nMais il faut faire d’autres choses c’est un peu compliqué, je te donne le lien \n\nhttps://apprendre5minutes.wordpress.com/2021/01/09/comment-ameliorer-sa-memoire-auditive-rapidement-et-facilement/", "created_utc": "1660946721.0", "edited": "False", "id": "ikzqb0t", "is_submitter": "False", "link_id": "t3_wspj7m", "parent_id": "t3_wspj7m", "score": "2", "subreddit": "france", "subreddit_id": "t5_2qhjz"}, {"author": "KatarinaDelRey", "body": "Of course! They’re all Romance languages, so their grammar will be similar. Listening-wise, however, Spanish, Italian, and Portuguese sound similar while French is a bit different", "created_utc": "1660945652.0", "edited": "False", "id": "ikznriq", "is_submitter": "False", "link_id": "t3_wspith", "parent_id": "t3_wspith", "score": "462", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "KatarinaDelRey", "body": "From experience, people are usually much better at reading and listening than speaking, simply because the latter requires someone else, so it’s normal!", "created_utc": "1660945526.0", "edited": "False", "id": "ikzngfh", "is_submitter": "False", "link_id": "t3_wspkpl", "parent_id": "t3_wspkpl", "score": "16", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "KatarinaDelRey", "body": "Good luck!!!", "created_utc": "1660796501.0", "edited": "False", "id": "ikr6rib", "is_submitter": "False", "link_id": "t3_wr9f4d", "parent_id": "t1_ikr6azq", "score": "1", "subreddit": "relationship_advice", "subreddit_id": "t5_2r0cn"}, {"author": "KatarinaDelRey", "body": "Why do they need 100 calls to talk about the gym? That’s bizarre, and he wouldn’t mind you seeing his texts for a simple reason. I’ve met guys who said exceptionally sexual things to me irl but never in text to not leave any “receipts.” It’s very obvious something is going on", "created_utc": "1660795876.0", "edited": "False", "id": "ikr5ocu", "is_submitter": "False", "link_id": "t3_wr9f4d", "parent_id": "t3_wr9f4d", "score": "3", "subreddit": "relationship_advice", "subreddit_id": "t5_2r0cn"}, {"author": "KatarinaDelRey", "body": "Je crois que tout le monde connaît quelqu'un qui souffre de dépression. C'est plus facile de dire que c'est de leur faute que d'affronter VRAIMENT le problème grâce à la stigmatisation entourant le mot. De toute façon, j'espère voir la fin de ce \"tabou\" parce que c'est une injustice pour notre société. \n\nEt je suis d'accord avec pigeonvert, c'est pas probable de souffrir de dépression sans raison. Il faut trouver \"le pourquoi\" et réfléchir à la raison pour laquelle on est si seul (je te blâme pas! mais il faut aussi y réfléchir)\n\nBon courage!", "created_utc": "1660795059.0", "edited": "False", "id": "ikr46lx", "is_submitter": "False", "link_id": "t3_wr6f23", "parent_id": "t3_wr6f23", "score": "2", "subreddit": "france", "subreddit_id": "t5_2qhjz"}, {"author": "KatarinaDelRey", "body": "I'm confused. Are you currently in college? I've heard of people who excelled in high school and now have impostor syndrome because they got accepted into an extremely good university. In some orientations in ivy league schools, they ask people to raise their hand if they feel like they are not good enough to be accepted and a lot of people end up raising it. Either that or maybe you just don't want to start over?", "created_utc": "1660703811.0", "edited": "False", "id": "iklusim", "is_submitter": "False", "link_id": "t3_wqcdnw", "parent_id": "t3_wqcdnw", "score": "3", "subreddit": "college", "subreddit_id": "t5_2qh3z"}, {"author": "KatarinaDelRey", "body": "Junior year will be the most important year of your high school experience. Failing a class will affect your chances but only a bit if from here on you really try your hardest.", "created_utc": "1660689549.0", "edited": "False", "id": "ikkyn7f", "is_submitter": "False", "link_id": "t3_wq7jns", "parent_id": "t3_wq7jns", "score": "1", "subreddit": "college", "subreddit_id": "t5_2qh3z"}, {"author": "KatarinaDelRey", "body": "I agree with what the other person said, but it is only true if you plan on going to graduate school immediately after undergraduate. If you're the kind of person that got great grades yet did not do many extracurriculars, you could also try to shine in the workplace, do separate projects and apply to graduate schools years later. To answer your question, I honestly don't think anything is too late.", "created_utc": "1660689381.0", "edited": "False", "id": "ikky93m", "is_submitter": "False", "link_id": "t3_wq76no", "parent_id": "t3_wq76no", "score": "3", "subreddit": "college", "subreddit_id": "t5_2qh3z"}, {"author": "KatarinaDelRey", "body": "Exactly 😂😂 I love reading but only what I want. If I had to read a lot for school I wouldn’t be in a good place. And for CS If you’re good at logic then you won’t really have to study super hard. The reading is not required basically it’s mostly hands-on", "created_utc": "1660685325.0", "edited": "False", "id": "ikkomo1", "is_submitter": "False", "link_id": "t3_wq58p9", "parent_id": "t1_ikknc5n", "score": "1", "subreddit": "books", "subreddit_id": "t5_2qh4i"}, {"author": "KatarinaDelRey", "body": "Honestly that’s probably why. It’s so cool you’re from Iceland though", "created_utc": "1660685226.0", "edited": "False", "id": "ikkodvv", "is_submitter": "False", "link_id": "t3_wq58p9", "parent_id": "t1_ikkmv4i", "score": "2", "subreddit": "books", "subreddit_id": "t5_2qh4i"}, {"author": "KatarinaDelRey", "body": "Of course not! I'd never give up a favorite hobby, I think it is just important to plan out your day. I've been learning languages for 2 years, and a big part of it is reading, so throughout my classes during any time of the year I'll always be reading something. Maybe you have a lot of classes? Another thing is that I don't have to read many books for CS (although I do study just not read books in particular) so maybe that's why I have more free time", "created_utc": "1660684003.0", "edited": "False", "id": "ikkld3v", "is_submitter": "False", "link_id": "t3_wq58p9", "parent_id": "t3_wq58p9", "score": "1", "subreddit": "books", "subreddit_id": "t5_2qh4i"}, {"author": "KatarinaDelRey", "body": "Definitely the first one. I know that thanks to technology we can find online partners but it’s still difficult to talk every day with someone or find consistent people to talk to. Ideally I would be able to move to France or Italy for a while and talk to people there but that’s not possible for many people", "created_utc": "1660665238.0", "edited": "False", "id": "ikj82e2", "is_submitter": "False", "link_id": "t3_wpsl0b", "parent_id": "t3_wpsl0b", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "KatarinaDelRey", "body": "I read Catcher in the Rye once in high school and liked it so much I decided to read it again like a year ago. The second time around, I felt very sad for him, especially because of what happened with his brother, his intelligence yet inability to utilize it to do well in school and the fact he gets obsessed so fast. So maybe you are right and he is all of those things but I still felt very bad for him.", "created_utc": "1660626942.0", "edited": "False", "id": "ikheq0z", "is_submitter": "False", "link_id": "t3_wphw2n", "parent_id": "t3_wphw2n", "score": "11", "subreddit": "books", "subreddit_id": "t5_2qh4i"}, {"author": "KatarinaDelRey", "body": "You are definitely fluent, I can tell by the way you write! Congrats on achieving such a high level :)", "created_utc": "1660626269.0", "edited": "False", "id": "ikhdods", "is_submitter": "False", "link_id": "t3_wpayvf", "parent_id": "t3_wpayvf", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "KatarinaDelRey", "body": "Practically zero. Entering community college is a great and fresh start, when transferring you won't need to include anything from high school :)", "created_utc": "1660610433.0", "edited": "False", "id": "ikgh242", "is_submitter": "False", "link_id": "t3_wpfmvz", "parent_id": "t3_wpfmvz", "score": "6", "subreddit": "college", "subreddit_id": "t5_2qh3z"}, {"author": "KatarinaDelRey", "body": "Unless there's something I'm missing then I think it's definitely a bug!", "created_utc": "1660454984.0", "edited": "False", "id": "ik7yaz4", "is_submitter": "False", "link_id": "t3_wnxlp8", "parent_id": "t3_wnxlp8", "score": "8", "subreddit": "duolingo", "subreddit_id": "t5_2t6ze"}, {"author": "KatarinaDelRey", "body": "I bet some natives would also fail the C2 test.... I think what is most important is that you are having fun and talking with others. When it comes to language learning, when someone is a beginner, I've never thought \"they're bad at that language right now.\" I always think that it's cool they're starting a new language and going to expand their horizons. If you wanted to take the C2 in the first place it's most likely because you are advanced and made it very far. Don't rely too much on tests and just have fun!", "created_utc": "1660409538.0", "edited": "False", "id": "ik5bbtd", "is_submitter": "False", "link_id": "t3_wni3h8", "parent_id": "t3_wni3h8", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "KatarinaDelRey", "body": "I think she is helping you out a lot....", "created_utc": "1660362918.0", "edited": "False", "id": "ik36fvf", "is_submitter": "False", "link_id": "t3_wn4k86", "parent_id": "t3_wn4k86", "score": "10", "subreddit": "relationship_advice", "subreddit_id": "t5_2r0cn"}, {"author": "KatarinaDelRey", "body": "You will find amazing people in whatever college you go to. YOU need to be the one who shines, not the college. And if you do very well for 2 years, you will have a lot of transfer options", "created_utc": "1660362463.0", "edited": "False", "id": "ik35lw6", "is_submitter": "False", "link_id": "t3_wn2wt8", "parent_id": "t3_wn2wt8", "score": "5", "subreddit": "college", "subreddit_id": "t5_2qh3z"}, {"author": "KatarinaDelRey", "body": "That is normal and it's a process called language attrition. This happens to people who never reached C2 in their native language (especially those who acquired a second language when they were young and their education was mostly in that language instead of their NL). If you were monolingual into your adult years, I'm not sure if this process still happens. Every single person I have met that has been living in the US since they were kids speaks better English (just an example) than their native language because they never got the chance to develop it further so really no reason to be embarrassed. In order to fix this you can try to read in your NL to expand your vocabulary :)", "created_utc": "1660361751.0", "edited": "1660361949.0", "id": "ik34amc", "is_submitter": "False", "link_id": "t3_wn2h9t", "parent_id": "t3_wn2h9t", "score": "16", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "KatarinaDelRey", "body": "Tu la kiffes toujours même après dix ans?? C'était vraiment le coup de foudre 😳 Tu peux lui demander si elle veut traîner ou sortir quelque part?", "created_utc": "1660361381.0", "edited": "False", "id": "ik33lry", "is_submitter": "False", "link_id": "t3_wn2m91", "parent_id": "t3_wn2m91", "score": "7", "subreddit": "france", "subreddit_id": "t5_2qhjz"}, {"author": "KatarinaDelRey", "body": "It's sad and I'm not surprised at all, sometimes they just feel like dating apps..... Either way I'm glad you are able to practice more now", "created_utc": "1660346551.0", "edited": "False", "id": "ik280yt", "is_submitter": "False", "link_id": "t3_wmybqk", "parent_id": "t3_wmybqk", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "KatarinaDelRey", "body": "La réalité c'est que si quelqu'un veut avoir des enfants, il se souciera pas de l'état écologique de la planète. C'est pour ça que je suis pour l'idée d'adopter des enfants dans le besoin, mais je comprends que tout le monde va pas être d'accord.", "created_utc": "1660346204.0", "edited": "False", "id": "ik278vm", "is_submitter": "False", "link_id": "t3_wmvgka", "parent_id": "t3_wmvgka", "score": "1", "subreddit": "france", "subreddit_id": "t5_2qhjz"}, {"author": "KatarinaDelRey", "body": "Honestly I feel bad for her because I can tell she’s very nervous and insecure….. would it help if she met your friends or also tried to be friends with them? She might also be feeling excluded or lonely if she is currently friendless", "created_utc": "1660016263.0", "edited": "False", "id": "ijja41s", "is_submitter": "False", "link_id": "t3_wjst6q", "parent_id": "t3_wjst6q", "score": "2", "subreddit": "relationship_advice", "subreddit_id": "t5_2r0cn"}, {"author": "KatarinaDelRey", "body": "Probably not, please don't try to be with someone you want to change", "created_utc": "1659805964.0", "edited": "False", "id": "ij7gjsn", "is_submitter": "False", "link_id": "t3_wht6xe", "parent_id": "t3_wht6xe", "score": "7", "subreddit": "relationship_advice", "subreddit_id": "t5_2r0cn"}, {"author": "KatarinaDelRey", "body": "Non c'est dégueulasse , ces \"héros\" devraient être enfermés dans une prison à sécurité maximale", "created_utc": "1659805708.0", "edited": "False", "id": "ij7fxy3", "is_submitter": "False", "link_id": "t3_who0wd", "parent_id": "t3_who0wd", "score": "2", "subreddit": "france", "subreddit_id": "t5_2qhjz"}, {"author": "KatarinaDelRey", "body": "I took 2 years off because of serious health concerns and I’m going back strong, got an A in every class so far and raised my GPA to a 3.8 again.\nI don’t know about anyone who never went back, but trust me you most likely will when you realize how important a career is", "created_utc": "1659752901.0", "edited": "False", "id": "ij4z3q9", "is_submitter": "False", "link_id": "t3_wgsgox", "parent_id": "t3_wgsgox", "score": "2", "subreddit": "college", "subreddit_id": "t5_2qh3z"}, {"author": "KatarinaDelRey", "body": "The purpose is usually to specialize in your undergraduate studies. Although some jobs do not require anything more than a Bachelor's degree, undergraduate studies tend to be general and nonspecific. For instance, my goal is to be an iOS developer. In order to accomplish this, I do not need a Master's degree. However, I can always opt for one if in the future I decide to specialize in subjects like machine learning or artificial intelligence. Having a Master's may also boost your salary.", "created_utc": "1659749756.0", "edited": "False", "id": "ij4sptw", "is_submitter": "False", "link_id": "t3_whbcnp", "parent_id": "t3_whbcnp", "score": "3", "subreddit": "college", "subreddit_id": "t5_2qh3z"}, {"author": "KatarinaDelRey", "body": "Oh honestly I never saw that comment. If he is saying he thinks trans people have a mental illness, AND he is saying this in a derogatory way (which is implied if he used the word \"Delusional\"), then I think OP should definitely tell him to please be more respectful. Because even though he could act respectfully to their face, he is not respecting them in front of her. I think the issue here is simple. She needs to have a serious talk with him and say \"Please do not talk badly about them and respect them.\" If he continues to say aloud that they are delusional and foolish, then the main problem here is that he is not listening to her and is not respecting HER. \n\nBut that is just an issue with etiquette, NOT with different views. If my partner is religious and I'm not, I'm not going to be saying all the time \"God is not real and it's foolish to believe so.\" The problem is not my different opinion, it's the way I phrase things. I can say instead \"I don't believe in God, but I respect your beliefs.\"\n\nThe thing I didn't like with this question is that it seems OP wants to desperately change his mind or point of view, and I disagree with this. And the fact their relationship is apparently \"perfect\" yet she's willing to leave over this and he has never even done anything disrespectful to their face is a major red flag on their part.", "created_utc": "1659747281.0", "edited": "False", "id": "ij4nk3t", "is_submitter": "False", "link_id": "t3_wh6907", "parent_id": "t1_ij4iwu5", "score": "1", "subreddit": "relationship_advice", "subreddit_id": "t5_2r0cn"}, {"author": "KatarinaDelRey", "body": "Where in her question does she say that her partner says he thinks they are mentally ill? Also, you can show someone respect while still finding them mentally ill. Mentally ill people are not below anybody \n\nI agree that misgendering someone on purpose is very rude. If he does this then he lied about respecting them, but unless he does something rude on purpose then we will just have to take his word for it", "created_utc": "1659743055.0", "edited": "False", "id": "ij4en8h", "is_submitter": "False", "link_id": "t3_wh6907", "parent_id": "t1_ij4bw7x", "score": "2", "subreddit": "relationship_advice", "subreddit_id": "t5_2r0cn"}, {"author": "KatarinaDelRey", "body": "He says he will always respect these people and that's the most you can ask for. The true red flag here is that you don't respect his point of view", "created_utc": "1659733519.0", "edited": "False", "id": "ij3snas", "is_submitter": "False", "link_id": "t3_wh6907", "parent_id": "t3_wh6907", "score": "16", "subreddit": "relationship_advice", "subreddit_id": "t5_2r0cn"}, {"author": "KatarinaDelRey", "body": "I didn't experience it but it was by choice, certainly not because of the coursework. You might have to work harder than other majors but if you don't procrastinate and know how to plan then you should be fine", "created_utc": "1659733278.0", "edited": "False", "id": "ij3s232", "is_submitter": "False", "link_id": "t3_wh3nhz", "parent_id": "t3_wh3nhz", "score": "4", "subreddit": "college", "subreddit_id": "t5_2qh3z"}, {"author": "KatarinaDelRey", "body": "Literally some papers and a pen or pencil. But that’s because I bring my laptop as well", "created_utc": "1659402171.0", "edited": "False", "id": "iil1cn3", "is_submitter": "False", "link_id": "t3_wds7c8", "parent_id": "t3_wds7c8", "score": "1", "subreddit": "college", "subreddit_id": "t5_2qh3z"}, {"author": "KatarinaDelRey", "body": "I'm not sure if it's cheating necessarily but it's very sus since you mentioned that he said that the break left him feeling lonely which is why he hung out with her. That just makes it clear that he wasn't hanging out with this girl as a simple friend", "created_utc": "1659401092.0", "edited": "False", "id": "iikyxl9", "is_submitter": "False", "link_id": "t3_wdxbfa", "parent_id": "t3_wdxbfa", "score": "1", "subreddit": "relationship_advice", "subreddit_id": "t5_2r0cn"}, {"author": "KatarinaDelRey", "body": "When their pupils dilate that means run", "created_utc": "1659400398.0", "edited": "False", "id": "iikxdly", "is_submitter": "False", "link_id": "t3_wdx5f4", "parent_id": "t3_wdx5f4", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "KatarinaDelRey", "body": "Your situation was extremely similar to mine, except my problems were mostly physical. I was trying to take a break from school and decided on language learning as well. But what do you mean that your mental health issues make it hard to memorize new words? Memorizing new words or list of words might be somewhat helpful in the beginning, but there's no way to fail if you immerse yourself as much as possible. This means that even people with some memorization issues might still successfully learn a language. If for whatever reason memorizing new or isolated words is not your strong suit, then try to focus on listening to simple Japanese or reading very simple text. Either way you should be proud of yourself for attempting such a difficult language I'm sure you will get very far :) Don't forget that Japanese might be the hardest language for an English speaker", "created_utc": "1659400278.0", "edited": "False", "id": "iikx3ut", "is_submitter": "False", "link_id": "t3_wdrt2m", "parent_id": "t3_wdrt2m", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "KatarinaDelRey", "body": "You should be loyal as soon as possible if your relationship with him is flourishing. If he is showing a lot of interest in you, it would be a red flag if he just decided to see other people. Sometimes you can assume things without outright saying them.", "created_utc": "1659399854.0", "edited": "False", "id": "iikw65a", "is_submitter": "False", "link_id": "t3_wdwyuw", "parent_id": "t3_wdwyuw", "score": "4", "subreddit": "relationship_advice", "subreddit_id": "t5_2r0cn"}, {"author": "KatarinaDelRey", "body": "How old are you?", "created_utc": "1659399732.0", "edited": "False", "id": "iikvw9g", "is_submitter": "False", "link_id": "t3_wdwz84", "parent_id": "t3_wdwz84", "score": "2", "subreddit": "relationship_advice", "subreddit_id": "t5_2r0cn"}, {"author": "KatarinaDelRey", "body": "It's going to be very difficult, the only people I've known about that took more than 5 classes did not do well but I'm sure it's possible", "created_utc": "1659399651.0", "edited": "False", "id": "iikvpps", "is_submitter": "False", "link_id": "t3_wdww6z", "parent_id": "t3_wdww6z", "score": "1", "subreddit": "college", "subreddit_id": "t5_2qh3z"}, {"author": "KatarinaDelRey", "body": "I know it makes me so mad", "created_utc": "1659323175.0", "edited": "False", "id": "iigoukn", "is_submitter": "False", "link_id": "t3_wd2j9g", "parent_id": "t1_iigmoak", "score": "3", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "KatarinaDelRey", "body": "hell no because I'm watching \"the most hated man on the internet\"", "created_utc": "1659311413.0", "edited": "False", "id": "iig1cmm", "is_submitter": "False", "link_id": "t3_wd2j9g", "parent_id": "t3_wd2j9g", "score": "3", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "KatarinaDelRey", "body": "ouais en fait on a le même mot en anglais, mais je l'avais oublié. C'est vrai qu'il faut de l'équilibre, la ligne peut être très fine entre aimer son pays et être chauvin.", "created_utc": "1659134414.0", "edited": "False", "id": "ii6sgu6", "is_submitter": "False", "link_id": "t3_wart82", "parent_id": "t1_ii3s3re", "score": "1", "subreddit": "france", "subreddit_id": "t5_2qhjz"}, {"author": "KatarinaDelRey", "body": "Je suis américaine et je suis d'accord avec toi, franchement la France est incroyable. C'est vrai que j'entends toujours des commentaires du genre  \"America is the best country in the world!!!\" mais nos systèmes scolaires et de santé sont atroces, si j'étais française je serais aussi patriotique", "created_utc": "1659060217.0", "edited": "False", "id": "ii2nimu", "is_submitter": "False", "link_id": "t3_wart82", "parent_id": "t3_wart82", "score": "82", "subreddit": "france", "subreddit_id": "t5_2qhjz"}, {"author": "KatarinaDelRey", "body": "have you ever used italki? that's the only one I've ever used lol", "created_utc": "1659055151.0", "edited": "False", "id": "ii2cez8", "is_submitter": "False", "link_id": "t3_wa66vy", "parent_id": "t1_ii21u62", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "KatarinaDelRey", "body": "Depends on how many things a person has going on, if they’re a full time student then learning more than one language might be difficult. Generally if you’re taking a gap year or something then learning 2 or even 3 might not be that difficult", "created_utc": "1659037232.0", "edited": "False", "id": "ii15gkk", "is_submitter": "False", "link_id": "t3_wagei9", "parent_id": "t3_wagei9", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "KatarinaDelRey", "body": "Thanks :)", "created_utc": "1659033057.0", "edited": "False", "id": "ii0upht", "is_submitter": "False", "link_id": "t3_wa66vy", "parent_id": "t1_ii08d1l", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "KatarinaDelRey", "body": "Just curious but how did you manage to make native friends online? I talk to language exchange partners and I have found consistent people but the majority are much older than me so I wouldn’t really consider them friends lol", "created_utc": "1659023245.0", "edited": "False", "id": "ii04y5y", "is_submitter": "False", "link_id": "t3_wa66vy", "parent_id": "t1_ihzjpy9", "score": "5", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "KatarinaDelRey", "body": "Honestly because most people don’t know about this and because it would be a very drastic change. And like someone said, most Americans don’t speak Portuguese. To a language learner it isn’t an obstacle, but many people will unfortunately not bother doing that. But studying in Brazil honestly sounds amazing", "created_utc": "1658972213.0", "edited": "False", "id": "ihxnff6", "is_submitter": "False", "link_id": "t3_w9vqmg", "parent_id": "t3_w9vqmg", "score": "9", "subreddit": "college", "subreddit_id": "t5_2qh3z"}, {"author": "KatarinaDelRey", "body": "Idk how to tell you this but she’s as toxic as they get. You should’ve left the second she asked to open up the relationship. She clearly lied to you by telling you she was attracted to you. You should lose weight for your health but that’s not the point here. If a relationship is contingent on only that, then there’s no relationship left", "created_utc": "1658971931.0", "edited": "False", "id": "ihxmsdc", "is_submitter": "False", "link_id": "t3_w9w558", "parent_id": "t3_w9w558", "score": "2", "subreddit": "relationship_advice", "subreddit_id": "t5_2r0cn"}, {"author": "KatarinaDelRey", "body": "If he yells at other people so easily then he will eventually yell at you. And even if he doesn't, is his behavior still acceptable? You need to have a serious conversation with him about this.", "created_utc": "1658969847.0", "edited": "False", "id": "ihxi1jd", "is_submitter": "False", "link_id": "t3_w9vci1", "parent_id": "t3_w9vci1", "score": "5", "subreddit": "relationship_advice", "subreddit_id": "t5_2r0cn"}, {"author": "KatarinaDelRey", "body": "j'ai pas de mots c'est vraiment magnifique :)", "created_utc": "1658964647.0", "edited": "False", "id": "ihx64dk", "is_submitter": "False", "link_id": "t3_w9qmx6", "parent_id": "t3_w9qmx6", "score": "1", "subreddit": "france", "subreddit_id": "t5_2qhjz"}, {"author": "KatarinaDelRey", "body": "Okay what I'm gonna say is probably paranoid, but I think you should at least send her a text every day saying you're fine. I've watched a lot of disappearance videos and the parents always know when their son/daughter goes missing when they don't text them back (this sounds paranoid and extra but seriously sending one text isn't a big deal). The coming back every weekend thing is a bit annoying so you're going to have to talk to her about that and go back around every month? Being in college means you deserve more independence, but you are still extremely young. To me, teenagers are practically still \\*somewhat\\* children. I don't think your mom is being unreasonable", "created_utc": "1658964374.0", "edited": "False", "id": "ihx5ho3", "is_submitter": "False", "link_id": "t3_w9sf8e", "parent_id": "t3_w9sf8e", "score": "5", "subreddit": "college", "subreddit_id": "t5_2qh3z"}, {"author": "KatarinaDelRey", "body": "Really? A lot of people will probably disagree but I think it’s underrated, I think it’s a great tool when you’re 1. A beginner 2. When you combine it with other resources. If I only do a grammar book and only that, I won’t improve. If I only watch TV and literally don’t do anything else, it won’t help that much. You have to do everything. I like duolingo and finished the French tree recently, but I also watched TV, did grammar books, read books and did language exchanges. I’m not quite fluent yet but I’m personally satisfied with my progress", "created_utc": "1658935779.0", "edited": "False", "id": "ihv2veg", "is_submitter": "False", "link_id": "t3_w969vp", "parent_id": "t3_w969vp", "score": "9", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "KatarinaDelRey", "body": "Andrew tate just came to [mind.](https://mind.In) In conclusion, you should read", "created_utc": "1658803268.0", "edited": "False", "id": "ihnyxa0", "is_submitter": "False", "link_id": "t3_w87vgc", "parent_id": "t3_w87vgc", "score": "2", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "KatarinaDelRey", "body": "You should probably ask your advisor, but I highly doubt that it would fulfill an elective requirement", "created_utc": "1658803159.0", "edited": "False", "id": "ihnyov7", "is_submitter": "False", "link_id": "t3_w87u6n", "parent_id": "t3_w87u6n", "score": "4", "subreddit": "college", "subreddit_id": "t5_2qh3z"}, {"author": "KatarinaDelRey", "body": "Also, the tips before starting a lesson are different on the iOS version vs the web version, I noticed this recently lol, sometimes the tips for the same lesson are different so I just read both", "created_utc": "1658803002.0", "edited": "False", "id": "ihnyclb", "is_submitter": "False", "link_id": "t3_w8151d", "parent_id": "t3_w8151d", "score": "1", "subreddit": "duolingo", "subreddit_id": "t5_2t6ze"}, {"author": "KatarinaDelRey", "body": "Hey this question immediately caught my interest because my best friend will be doing a phd in engineering psychology, which might be a good option for you since you're very interested in both subjects :) You should research about it! Also psychology can be very good career but you will need to go to graduate school", "created_utc": "1658774259.0", "edited": "False", "id": "ihm0qxp", "is_submitter": "False", "link_id": "t3_w7reg6", "parent_id": "t3_w7reg6", "score": "4", "subreddit": "college", "subreddit_id": "t5_2qh3z"}, {"author": "KatarinaDelRey", "body": "Tbh I agree with you that it’s possible but I think under very specific circumstances", "created_utc": "1658768088.0", "edited": "False", "id": "ihlkho1", "is_submitter": "False", "link_id": "t3_w7swep", "parent_id": "t1_ihlid3x", "score": "-2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "KatarinaDelRey", "body": "“Language learning” is usually an adult hobby, unlike something like learning an instrument (although nothing wrong with doing that as an adult of course). So the majority of people learning languages for fun are adults, quitting simply because you’re over the age of 18 is a bit weird. Maybe you won’t reach C2, but anything below that is certainly possible", "created_utc": "1658766548.0", "edited": "False", "id": "ihlgf9u", "is_submitter": "False", "link_id": "t3_w7swep", "parent_id": "t3_w7swep", "score": "11", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "KatarinaDelRey", "body": "This is what you should be aware of when it comes to reading for language learning: extensive vs intensive reading. Intensive reading is when you read short texts, analyze the meaning, and try to understand every word. Extensive reading is reading long texts without a breakdown of comprehension and without needing to look up every word. The best reading method for language learning is extensive reading, because it exposes you to more of the language in a shorter amount of time. You should read at a level a bit above your current level, so that you learn new things but you're not overwhelmed. Also, definitely don't look up every word you don't understand. Try to use context clues. Basically only look up words if you can't understand an entire sentence, because if you look up every word that you don't understand, you will really slow down your learning. It is up to you if you want to write down a few words you didn't understand and review them later; I didn't do this much though. Also, if possible, try to listen to the audio as you read books. Hope this helped :)", "created_utc": "1658708070.0", "edited": "False", "id": "ihijz1y", "is_submitter": "False", "link_id": "t3_w79xej", "parent_id": "t3_w79xej", "score": "11", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "KatarinaDelRey", "body": "I'll be willing to try the magic mushrooms though ngl", "created_utc": "1658608066.0", "edited": "False", "id": "ihd4gl7", "is_submitter": "False", "link_id": "t3_w6d51x", "parent_id": "t1_ihd45eo", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "KatarinaDelRey", "body": "Yamaha is a great piano brand, but it depends. I recommend a fully weighted keyboard, that's one of the most important things", "created_utc": "1658608016.0", "edited": "False", "id": "ihd4cjl", "is_submitter": "False", "link_id": "t3_w6cxq2", "parent_id": "t3_w6cxq2", "score": "1", "subreddit": "piano", "subreddit_id": "t5_2qnw8"}, {"author": "KatarinaDelRey", "body": "the traffic and how most people can't drive lol", "created_utc": "1658607876.0", "edited": "False", "id": "ihd4104", "is_submitter": "False", "link_id": "t3_w6d6mc", "parent_id": "t3_w6d6mc", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "KatarinaDelRey", "body": "Probably not it sounds weird, it's just English", "created_utc": "1658607826.0", "edited": "False", "id": "ihd3x0r", "is_submitter": "False", "link_id": "t3_w6co8x", "parent_id": "t3_w6co8x", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "KatarinaDelRey", "body": "can't stand mushrooms", "created_utc": "1658607655.0", "edited": "False", "id": "ihd3j5f", "is_submitter": "False", "link_id": "t3_w6d51x", "parent_id": "t3_w6d51x", "score": "3", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "KatarinaDelRey", "body": "Damn that sucks :( my head legit feels so much pressure it’s so annoying, especially on my cheeks, I had to get sinus surgery 3 years ago 😭", "created_utc": "1658116573.0", "edited": "False", "id": "iglonrl", "is_submitter": "False", "link_id": "t3_w18vko", "parent_id": "t1_igki4qm", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "KatarinaDelRey", "body": "The grammar might be similar to Spanish or Italian, but French is just a hard language to understand in general. It sounds a bit strange compared to the other Romance languages (I think it’s beautiful though) and a lot of french people talk in an endless rush. I don’t know even a hint of German, but I can isolate words in sentences, but when I first started to learn French, a sentence just sounded like a huge word if that makes sense. I’ve been studying French for nearly 2 years, and I can understand almost anything but that’s because I spent around an entire hour every day listening to vlogs or TV shows. Sometimes even longer than an hour. What I would suggest if I were you is to listen for a lot more than 10 minutes a day, try an hour and you’ll see how fast you improve. Not only that, but something I feel has helped my listening a lot is reading WITH AUDIO. Not only are you improving your reading skills, but the audio component helps your prononciation and your ability to understand spoken French better. With all of this in mind I’m sure you’ll improve soon :)", "created_utc": "1658106989.0", "edited": "False", "id": "igl6h8b", "is_submitter": "False", "link_id": "t3_w1h61e", "parent_id": "t3_w1h61e", "score": "6", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "KatarinaDelRey", "body": "This is kinda random, but I happened to look at your profile and it said “permanent sinus headache,” I have a sinus infection right now so same", "created_utc": "1658082797.0", "edited": "False", "id": "igjovcw", "is_submitter": "False", "link_id": "t3_w18vko", "parent_id": "t1_igivds3", "score": "6", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "KatarinaDelRey", "body": "The SpongeBob episode \nFINLAAAAAAND!", "created_utc": "1658071537.0", "edited": "False", "id": "igiz3dt", "is_submitter": "False", "link_id": "t3_w158aw", "parent_id": "t3_w158aw", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "KatarinaDelRey", "body": "Thank you so much for this, every single thing you wrote is exactly what I think all the time. Native level is NOT perfect, I live in America and so many people here that only speak English make grammar mistakes all the time and cannot understand more advanced books for example. If natives themselves are not close to being perfect, then why should someone learning a language from scratch as an adult be expected to never make any mistakes or remember every word? It’s really bizarre, some people I talk to have such high expectations that they’ll never reach them.", "created_utc": "1658023816.0", "edited": "False", "id": "iggxiv2", "is_submitter": "False", "link_id": "t3_w0sady", "parent_id": "t3_w0sady", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "KatarinaDelRey", "body": "either laughed or ignored", "created_utc": "1657988448.0", "edited": "False", "id": "igervx4", "is_submitter": "False", "link_id": "t3_w0kafu", "parent_id": "t3_w0kafu", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "KatarinaDelRey", "body": "Is there anything else you'd like to accomplish? I've always thought it was weird to compare yourself to other influencers or celebrities. I don't mean to offend anyone but I feel like many have that much fame due to pure luck. You should do 2 things:  \n1. Stop comparing yourself, there are a lot of intelligent and talented people that are not famous  \n2. If you don't feel accomplished enough, try to figure out other goals in life that you think will boost your confidence.", "created_utc": "1657936569.0", "edited": "False", "id": "igcck9x", "is_submitter": "False", "link_id": "t3_w04v0j", "parent_id": "t3_w04v0j", "score": "3", "subreddit": "college", "subreddit_id": "t5_2qh3z"}, {"author": "KatarinaDelRey", "body": "Lol don't worry too much about it, some people are very good at managing their time to be honest. You can do both", "created_utc": "1657917901.0", "edited": "False", "id": "igb813y", "is_submitter": "False", "link_id": "t3_vzwi1r", "parent_id": "t3_vzwi1r", "score": "1", "subreddit": "college", "subreddit_id": "t5_2qh3z"}, {"author": "KatarinaDelRey", "body": "That’s cool! I wish I could live in the countries lol", "created_utc": "1657916691.0", "edited": "False", "id": "igb52r0", "is_submitter": "False", "link_id": "t3_vzr89b", "parent_id": "t1_igalkex", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "KatarinaDelRey", "body": "Young kids yes, but this person is referring to babies and how long it takes them to speak with normal sentences", "created_utc": "1657916609.0", "edited": "False", "id": "igb4v89", "is_submitter": "False", "link_id": "t3_vzr89b", "parent_id": "t1_igaeae4", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "KatarinaDelRey", "body": "Honestly I don’t know much about this, I just feel like it’s a hard job and the pay doesn’t reflect its difficulty", "created_utc": "1657916538.0", "edited": "False", "id": "igb4ooz", "is_submitter": "False", "link_id": "t3_vzsys9", "parent_id": "t3_vzsys9", "score": "17", "subreddit": "college", "subreddit_id": "t5_2qh3z"}, {"author": "KatarinaDelRey", "body": "I think it's realistic depending on your immersion and the language itself, if you are at home studying only for one hour every day, you're going to learn slower than someone going to the country and speaking every day and learning for hours. But since we are consciously learning a language (unlike babies), it is realistic to learn faster than them. Maybe this is a bad comparison but I was actually talking about this with my piano teacher. She was saying that although children learn faster, many children are usually slower at learning the piano than adult learners because they don't practice much, and adult learners usually practice every day. So it's about how quickly you learn but also about how much conscious effort is put in, which is 0 for babies. I find it completely realistic for a Spanish speaker to become fluent in Italian in one year if they have full immersion, for example.", "created_utc": "1657899638.0", "edited": "False", "id": "ig9y8yl", "is_submitter": "False", "link_id": "t3_vzr89b", "parent_id": "t3_vzr89b", "score": "67", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "KatarinaDelRey", "body": "Yeah I know they're considered dialects only for political reasons I believe or something along those lines", "created_utc": "1657899253.0", "edited": "False", "id": "ig9xa07", "is_submitter": "True", "link_id": "t3_vyzlaw", "parent_id": "t1_ig8tu5a", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "KatarinaDelRey", "body": "Actually now that I remember I did have Spanish classes throughout elementary and middle school although I’m not sure if you’d consider that a formal education", "created_utc": "1657860635.0", "edited": "False", "id": "ig85acz", "is_submitter": "True", "link_id": "t3_vyzlaw", "parent_id": "t1_ig8091b", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "KatarinaDelRey", "body": "Basically I would say it depends on the frequency of errors, I agree 100% that someone is not necessarily fluent in a language just because that was their first language though", "created_utc": "1657859309.0", "edited": "False", "id": "ig8315n", "is_submitter": "True", "link_id": "t3_vyzlaw", "parent_id": "t1_ig8091b", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "KatarinaDelRey", "body": "I get where you're coming from 100% but I would say it highly depends on the person. I never received any formal education in Spanish and my English is a level above but I'm still fluent can read any book in the language. It just really depends, I've known people who ONLY know English who make weird mistakes, like saying \"it costed 10 dollars\" instead of \"it cost.\" Does that mean English is not their native language even tho that's literally the only language they know? Some people just make less mistakes, granted I make mistakes in Spanish as well as in English, and of course someone will make more mistakes in a language they didn't receive formal education in, that doesn't necessarily mean they're not fluent tho. I've spoken to French native speakers and it's the only language they're fluent in yet I hear weird subjunctive errors happening and not knowing  how to spell some basic words like \"le grec\" (greek), basically what I'm saying is... people can make mistakes from time to time which is perfectly fine. But I understand your point.", "created_utc": "1657859127.0", "edited": "False", "id": "ig82plh", "is_submitter": "True", "link_id": "t3_vyzlaw", "parent_id": "t1_ig8091b", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "KatarinaDelRey", "body": "Thanks for discussing the window of opportunity! I had no idea it was 12, I thought you still had to be a baby. So when someone says they “grew up” with a language, does that mean it’s their native language as well? But I’m kind of confused, because for example in my case, I learned English when I was 7 so that’s before 12, but didn’t I have to subconsciously learn it through my first language?", "created_utc": "1657854485.0", "edited": "False", "id": "ig7ty96", "is_submitter": "True", "link_id": "t3_vyzlaw", "parent_id": "t1_ig58brb", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "KatarinaDelRey", "body": "Wow really? Dialects  of which language if you don’t mind me asking? For some reason I find dialects cool to learn, like for Italy they have so many!!! So you did end up learning the dialect?", "created_utc": "1657854256.0", "edited": "False", "id": "ig7thi1", "is_submitter": "True", "link_id": "t3_vyzlaw", "parent_id": "t1_ig58e3t", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "KatarinaDelRey", "body": "I thought native language and mother tongue were interchangeable? What are the languages?", "created_utc": "1657854156.0", "edited": "False", "id": "ig7ta6d", "is_submitter": "True", "link_id": "t3_vyzlaw", "parent_id": "t1_ig5wn18", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "KatarinaDelRey", "body": "Oh yeah definitely native level but not sure if that would be considered native language per say", "created_utc": "1657854084.0", "edited": "False", "id": "ig7t4y9", "is_submitter": "True", "link_id": "t3_vyzlaw", "parent_id": "t1_ig72w0q", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "KatarinaDelRey", "body": "Thank you for this. People always tell you that GPA doesn't matter at all but it really does", "created_utc": "1657814495.0", "edited": "False", "id": "ig559ho", "is_submitter": "False", "link_id": "t3_vyuwly", "parent_id": "t3_vyuwly", "score": "1", "subreddit": "college", "subreddit_id": "t5_2qh3z"}, {"author": "KatarinaDelRey", "body": "Good luck!!!!! :)", "created_utc": "1657814355.0", "edited": "False", "id": "ig54w8j", "is_submitter": "False", "link_id": "t3_vytczi", "parent_id": "t3_vytczi", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "KatarinaDelRey", "body": "DU HAST", "created_utc": "1657814238.0", "edited": "False", "id": "ig54l69", "is_submitter": "False", "link_id": "t3_vyz839", "parent_id": "t3_vyz839", "score": "3", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "KatarinaDelRey", "body": "hulu", "created_utc": "1657814185.0", "edited": "False", "id": "ig54g45", "is_submitter": "False", "link_id": "t3_vyz7ph", "parent_id": "t3_vyz7ph", "score": "2", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "KatarinaDelRey", "body": "When my reading is good enough to follow my TL subtitles, that's when I remove the English subs. When I can understand at least 75% of the show without looking at the subtitles, that's when I remove all subtitles", "created_utc": "1657751087.0", "edited": "False", "id": "ig1ve68", "is_submitter": "False", "link_id": "t3_vyaxnv", "parent_id": "t3_vyaxnv", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "KatarinaDelRey", "body": "It really depends on how you plan to study, with the correct balance of listening/speaking/reading/grammar practice. With the right balance of all these things and with one hour of study every day, C1 might take around 3.5-4 years, considering that's a very advanced level and close to native (my opinion, a lot of people will probably say less time though). It won't be very intellectually challenging though considering the fact you know another romance language, you just have to be be very consistent. Either way, that's a rough estimate because it's really hard to know an exact time lol, there are many factors at play", "created_utc": "1657749993.0", "edited": "False", "id": "ig1sslo", "is_submitter": "False", "link_id": "t3_vybhe8", "parent_id": "t3_vybhe8", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "KatarinaDelRey", "body": "Congrats :)", "created_utc": "1657749581.0", "edited": "False", "id": "ig1rso9", "is_submitter": "False", "link_id": "t3_vyf3pq", "parent_id": "t3_vyf3pq", "score": "1", "subreddit": "duolingo", "subreddit_id": "t5_2t6ze"}, {"author": "KatarinaDelRey", "body": "porque sí", "created_utc": "1657725874.0", "edited": "False", "id": "ig02yjv", "is_submitter": "False", "link_id": "t3_vy5tl8", "parent_id": "t3_vy5tl8", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "KatarinaDelRey", "body": "What about something along the lines of victims  advocate, a lawyer that helps people in need that can't afford an expensive lawyer, or maybe even criminal justice?", "created_utc": "1657725727.0", "edited": "False", "id": "ig02l6d", "is_submitter": "False", "link_id": "t3_vy5lqs", "parent_id": "t1_ig026aw", "score": "2", "subreddit": "college", "subreddit_id": "t5_2qh3z"}, {"author": "KatarinaDelRey", "body": "rode a bike, I literally always imagine kids doing this lol but prob not everyone", "created_utc": "1657725575.0", "edited": "False", "id": "ig0272f", "is_submitter": "False", "link_id": "t3_vy5okn", "parent_id": "t3_vy5okn", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "KatarinaDelRey", "body": "What about college majors that have to do with your interests, such as human services, behavioral sciences, or social worker?? Maybe this site will give you more ideas? **https://www.mymajors.com/career/activist/education/**", "created_utc": "1657725504.0", "edited": "False", "id": "ig020iv", "is_submitter": "False", "link_id": "t3_vy5lqs", "parent_id": "t3_vy5lqs", "score": "2", "subreddit": "college", "subreddit_id": "t5_2qh3z"}, {"author": "KatarinaDelRey", "body": "I've thankfully been able to have a scholarship up until now, but since it will end soon I'm going to apply for government aid", "created_utc": "1657725218.0", "edited": "False", "id": "ig01aow", "is_submitter": "False", "link_id": "t3_vy50hy", "parent_id": "t3_vy50hy", "score": "2", "subreddit": "college", "subreddit_id": "t5_2qh3z"}, {"author": "KatarinaDelRey", "body": "merci! je vais y jeter un oeil, le bouquin est sur amazon? en fait j'arrive pas à le trouver", "created_utc": "1657664097.0", "edited": "False", "id": "ifwye6i", "is_submitter": "False", "link_id": "t3_vwwiol", "parent_id": "t1_ifws5bt", "score": "1", "subreddit": "france", "subreddit_id": "t5_2qhjz"}, {"author": "KatarinaDelRey", "body": "Bob Odenkirk as Saul Goodman", "created_utc": "1657663496.0", "edited": "False", "id": "ifwwyvi", "is_submitter": "False", "link_id": "t3_vxk2bk", "parent_id": "t3_vxk2bk", "score": "11", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "KatarinaDelRey", "body": "de toute façon j'espère que tu pourras t'en débarrasser :/", "created_utc": "1657657759.0", "edited": "False", "id": "ifwiplz", "is_submitter": "False", "link_id": "t3_vwy5d2", "parent_id": "t1_iftn3bi", "score": "1", "subreddit": "france", "subreddit_id": "t5_2qhjz"}, {"author": "KatarinaDelRey", "body": "jsuis morte 😆", "created_utc": "1657654541.0", "edited": "False", "id": "ifwag9u", "is_submitter": "False", "link_id": "t3_vxjgx8", "parent_id": "t3_vxjgx8", "score": "1", "subreddit": "france", "subreddit_id": "t5_2qhjz"}, {"author": "KatarinaDelRey", "body": "The first piano recital I had, I was so nervous for months and had daily nightmares because I have terrible stage fright. However, I felt super relieved after it was over and it went well. Not sure whether I want to do that again but I'm glad I somewhat \"conquered\" a fear of mine lol", "created_utc": "1657654294.0", "edited": "False", "id": "ifw9trb", "is_submitter": "False", "link_id": "t3_vxjeia", "parent_id": "t3_vxjeia", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "KatarinaDelRey", "body": "thank you :) Whenever I tell this to people they're like \"but you're not even tall!!\" but where I live every girl is like 5'2\" haha", "created_utc": "1657649577.0", "edited": "False", "id": "ifvxutw", "is_submitter": "False", "link_id": "t3_vxhigr", "parent_id": "t1_ifvxlw6", "score": "2", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "KatarinaDelRey", "body": "Not only small children but very young people in general", "created_utc": "1657649525.0", "edited": "False", "id": "ifvxq6u", "is_submitter": "False", "link_id": "t3_vxhmg5", "parent_id": "t3_vxhmg5", "score": "6", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "KatarinaDelRey", "body": "Being tall, I'm 5'6\" and a half but where I live that was considered pretty tall and back when I was in middle school, being tall made you \"manly.\" However, I've learned to love my height and I've seen so many pretty people with my height lol", "created_utc": "1657649414.0", "edited": "False", "id": "ifvxgc0", "is_submitter": "False", "link_id": "t3_vxhigr", "parent_id": "t3_vxhigr", "score": "2", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "KatarinaDelRey", "body": "As long as there is passion, there doesn't need to be a right reason. The reason why I learn languages is vague, and when I explain it it makes no sense. First of all, I find the languages I'm learning at the moment (French and Italian) to be beautiful. But I just get this feeling that I can't explain when I think about them and I just know they are the right languages for me to learn. I also have this feeling for Greek and Korean, even though I know almost nothing about Korean culture and have no specific reason to learn it. I don't have this feeling for German so I won't learn it, for example. So it's a pure mixture of thinking the language is cool in some way and having this unexplainable feeling towards them. And of course to visit the countries, but if someone told me right now that I will never be able to visit the country, I'd still learn them. Catalan sounds like a beautiful language honestly!", "created_utc": "1657647950.0", "edited": "False", "id": "ifvu0j2", "is_submitter": "False", "link_id": "t3_vxgeci", "parent_id": "t3_vxgeci", "score": "7", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "KatarinaDelRey", "body": "Yo no conozco a Groot lol y por alguna razón, Rusia me sorprende", "created_utc": "1657647648.0", "edited": "False", "id": "ifvt8gp", "is_submitter": "False", "link_id": "t3_vxafni", "parent_id": "t3_vxafni", "score": "2", "subreddit": "spain", "subreddit_id": "t5_2qhd6"}, {"author": "KatarinaDelRey", "body": "It always seems harder than it is! I’m not saying getting a job will be easy, but if you maintain a good GPA, do an internship and potentially have some side projects (they don’t have to be that impressive) I don’t see why you wouldn’t be able to get a job. The fact you’re even getting a degree gives you an advantage since I know so many people in tech jobs without a degree or with an unrelated degree", "created_utc": "1657638717.0", "edited": "False", "id": "ifv6edq", "is_submitter": "False", "link_id": "t3_vwujsh", "parent_id": "t1_ifv5p31", "score": "1", "subreddit": "college", "subreddit_id": "t5_2qh3z"}, {"author": "KatarinaDelRey", "body": "Yeah I agree, or people can try information technology if they really don’t like math", "created_utc": "1657638452.0", "edited": "False", "id": "ifv5qg5", "is_submitter": "False", "link_id": "t3_vwujsh", "parent_id": "t1_ifv2h0b", "score": "1", "subreddit": "college", "subreddit_id": "t5_2qh3z"}, {"author": "KatarinaDelRey", "body": "I came into CS with ZERO knowledge, college is there to teach you you’re not supposed to know everything don’t worry :)", "created_utc": "1657638317.0", "edited": "False", "id": "ifv5e4f", "is_submitter": "False", "link_id": "t3_vwujsh", "parent_id": "t1_iftkrz0", "score": "2", "subreddit": "college", "subreddit_id": "t5_2qh3z"}, {"author": "KatarinaDelRey", "body": "Yeah, my highschool was notoriously difficult  so that helped a lot… I still have to try in college but it’s one of those things that if you try hard you know for sure you’ll get a good grade", "created_utc": "1657638244.0", "edited": "False", "id": "ifv57hq", "is_submitter": "False", "link_id": "t3_vwujsh", "parent_id": "t1_iftmdff", "score": "2", "subreddit": "college", "subreddit_id": "t5_2qh3z"}, {"author": "KatarinaDelRey", "body": "Ça m'arrive de temps en temps mais je peux pas les contrôler c'est agaçant, mais quelquefois je me rends compte que je suis dans un rêve", "created_utc": "1657598565.0", "edited": "False", "id": "iftdznp", "is_submitter": "False", "link_id": "t3_vwwiol", "parent_id": "t3_vwwiol", "score": "3", "subreddit": "france", "subreddit_id": "t5_2qhjz"}, {"author": "KatarinaDelRey", "body": "Mais c’est la cata chez toi 😭le médecin pourra te dire si ce sont vraiment des piqûres de moustiques ou pas, tu devrais essayer electric mosquito killers peut-être?", "created_utc": "1657597158.0", "edited": "False", "id": "iftbcsj", "is_submitter": "False", "link_id": "t3_vwy5d2", "parent_id": "t3_vwy5d2", "score": "2", "subreddit": "france", "subreddit_id": "t5_2qhjz"}, {"author": "KatarinaDelRey", "body": "I totally agree but for some people it might really be impossible to get rid of it completely", "created_utc": "1657586791.0", "edited": "False", "id": "ifsp0xr", "is_submitter": "False", "link_id": "t3_vwsvtb", "parent_id": "t1_ifso0tr", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "KatarinaDelRey", "body": "It depends on where you live and how many people you have to support. If you only need to support yourself and don't live in an expensive place in America, around 70k should honestly be enough for most people", "created_utc": "1657584522.0", "edited": "False", "id": "ifsjxrj", "is_submitter": "False", "link_id": "t3_vwx7kj", "parent_id": "t3_vwx7kj", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "KatarinaDelRey", "body": "My college experience was so much easier than high school, but that is probably because I was taking so many AP classes. Either way, I feel like in college you have more free time, more power over which classes to take and when you want to take them. In general, unless you are in a very difficult major like physics or taking way too many classes, then college shouldn't be too hard. At least undergrad", "created_utc": "1657578643.0", "edited": "False", "id": "ifs6gpz", "is_submitter": "False", "link_id": "t3_vwujsh", "parent_id": "t3_vwujsh", "score": "85", "subreddit": "college", "subreddit_id": "t5_2qh3z"}, {"author": "KatarinaDelRey", "body": "for this headache to go away !!!!", "created_utc": "1657578163.0", "edited": "False", "id": "ifs5c5m", "is_submitter": "False", "link_id": "t3_vwuxlu", "parent_id": "t3_vwuxlu", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "KatarinaDelRey", "body": "I've always thought that having an accent is more of a genetic thing, meaning some people are great at mimicking accents while others may be perfectly fluent in a language, yet have an accent. I've been living in America for 16 years, at this point my English is better than my native language (Spanish) yet I have a bit of an accent. It really depends on the person", "created_utc": "1657578135.0", "edited": "False", "id": "ifs59o6", "is_submitter": "False", "link_id": "t3_vwsvtb", "parent_id": "t3_vwsvtb", "score": "6", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "KatarinaDelRey", "body": "italki is my savior to be honest lol", "created_utc": "1657577950.0", "edited": "False", "id": "ifs4sxq", "is_submitter": "False", "link_id": "t3_vw7qkg", "parent_id": "t1_ifry99v", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "KatarinaDelRey", "body": "Yeah, italki is my only savior right now honestly!! I wish I had irl friends who spoke French lol. People underestimate how hard it is to become fluent through only language exchanges", "created_utc": "1657577906.0", "edited": "False", "id": "ifs4oz9", "is_submitter": "False", "link_id": "t3_vw7qkg", "parent_id": "t1_ifolgkq", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "KatarinaDelRey", "body": "Actually since I am not currently learning Greek my level is very static, I am going to continue to improve after I improve Italian though :) honestly I can't give you an answer because I've never gone beyond the basics. The basics have been pretty simple and the pronunciation is very similar to Spanish. But I know that studying the grammar will be very rough when I begin to study it more in depth due to the declensions, 3 genders amongst other things lol", "created_utc": "1657577848.0", "edited": "False", "id": "ifs4jux", "is_submitter": "False", "link_id": "t3_vw7qkg", "parent_id": "t1_ifp5whh", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "KatarinaDelRey", "body": "Cacophony (literally means harsh mixture of sounds)", "created_utc": "1657571581.0", "edited": "False", "id": "ifromjc", "is_submitter": "False", "link_id": "t3_vwonv0", "parent_id": "t3_vwonv0", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "KatarinaDelRey", "body": "When they talk about it nonstop or drag others down", "created_utc": "1657566265.0", "edited": "False", "id": "ifrb2hr", "is_submitter": "False", "link_id": "t3_vwq6rs", "parent_id": "t3_vwq6rs", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "KatarinaDelRey", "body": "😂😂", "created_utc": "1657566223.0", "edited": "False", "id": "ifrayqg", "is_submitter": "False", "link_id": "t3_vwq32a", "parent_id": "t1_ifrahnc", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "KatarinaDelRey", "body": "looool no they can't know the truth", "created_utc": "1657566126.0", "edited": "False", "id": "ifrapzx", "is_submitter": "False", "link_id": "t3_vwq2qr", "parent_id": "t3_vwq2qr", "score": "0", "subreddit": "ProgrammerHumor", "subreddit_id": "t5_2tex6"}, {"author": "KatarinaDelRey", "body": "ribs probably", "created_utc": "1657565705.0", "edited": "False", "id": "ifr9n5l", "is_submitter": "False", "link_id": "t3_vwpx9l", "parent_id": "t3_vwpx9l", "score": "3", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "KatarinaDelRey", "body": "That's what I'm also learning at the moment :P My study currently consists of this: A grammar book to fully grasp basic grammar and vocabulary, a book made of short stories for beginners with audio and I use Duolingo on the side as well. I also watch TV shows with Italian audio on Netflix. I'm sure if you do all of this you'll be able to reach your goals with no problems and converse when you're ready. Also, for a more intermediate read, try reading some of the Harry Potter books when you're ready as well", "created_utc": "1657507650.0", "edited": "False", "id": "ifoc0q5", "is_submitter": "False", "link_id": "t3_vw7v56", "parent_id": "t3_vw7v56", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "KatarinaDelRey", "body": "sounds cool !!", "created_utc": "1657507300.0", "edited": "False", "id": "ifobbf0", "is_submitter": "False", "link_id": "t3_vw7p84", "parent_id": "t1_ifoaycg", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "KatarinaDelRey", "body": "Honestly, for French I've only had one major hurdle, and that is difficulty in finding opportunities to speak. Ever since I started learning, my only option was to do language exchanges, and I quickly realized that many people would not show up and were not consistent, so I improved my spoken French slower than I would have wanted. In the future I plan to pay for tutors in both French and Italian \n\nIt's cool that you're learning Korean! I hope to learn it in the future :)", "created_utc": "1657507238.0", "edited": "False", "id": "ifob6w0", "is_submitter": "False", "link_id": "t3_vw7qkg", "parent_id": "t3_vw7qkg", "score": "62", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "KatarinaDelRey", "body": "Have you ever been to the Great Barrier Reef and do you want to", "created_utc": "1657506977.0", "edited": "False", "id": "ifoanxr", "is_submitter": "False", "link_id": "t3_vw7p84", "parent_id": "t3_vw7p84", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "KatarinaDelRey", "body": "I wish you luck moving forward :)", "created_utc": "1657503068.0", "edited": "False", "id": "ifo2nrl", "is_submitter": "False", "link_id": "t3_vw39g7", "parent_id": "t1_ifny9rk", "score": "3", "subreddit": "college", "subreddit_id": "t5_2qh3z"}, {"author": "KatarinaDelRey", "body": "I am so sorry this sounds awful. It seems like college itself is not the problem, it’s probably your depression that is causing you to dislike everything. Intense therapy and possibly switching medications might help you, but your mental state is really affecting you. I can understand where you are coming from because I took a 2 year break from college due to physical health (that highly impacted my mental health). Your dad is honestly right, it’s a bad thing that your scholarship will run out soon but you seem like you’re in a desperate need for a break and to rethink your future, and what you want to do. In my opinion, you first need to handle your mental problems and do everything in your power to better yourself before attempting college, your life is worth more than whatever money your classes cost \nI would tell you it’s a good idea to just finish your degree and take a break later butnit doesn’t seem you’re in a well enough mental state for this option. Maybe take a break from college and find some hobbies that genuinely make you happy, switch medication, do CBT, meditation, anything and everything to help you mentally", "created_utc": "1657500574.0", "edited": "False", "id": "ifnxjs5", "is_submitter": "False", "link_id": "t3_vw39g7", "parent_id": "t3_vw39g7", "score": "19", "subreddit": "college", "subreddit_id": "t5_2qh3z"}, {"author": "KatarinaDelRey", "body": "Did the tutors from italki help you a lot?? I'm considering doing that. Also how many classes have you had?", "created_utc": "1657481467.0", "edited": "False", "id": "ifmr2fo", "is_submitter": "False", "link_id": "t3_vvy5pf", "parent_id": "t1_ifmn6fz", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "KatarinaDelRey", "body": "THE FRY COOK GAMES", "created_utc": "1657481403.0", "edited": "False", "id": "ifmqx6r", "is_submitter": "False", "link_id": "t3_vvyzd4", "parent_id": "t3_vvyzd4", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "KatarinaDelRey", "body": "Cigarette Daydreams - Cage the Elephant", "created_utc": "1657481280.0", "edited": "False", "id": "ifmqncv", "is_submitter": "False", "link_id": "t3_vvyysf", "parent_id": "t3_vvyysf", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "KatarinaDelRey", "body": "Is this because you are a lot more advanced in your NL than English? Many people choose to master English first before moving on to other languages since it facilitates learning other languages tremendously (thanks to the ease of finding materials). Your English already sounds very good, you might be better off just getting more advanced so that you don't have to translate to your NL", "created_utc": "1657479045.0", "edited": "False", "id": "ifmljp2", "is_submitter": "False", "link_id": "t3_vvtbh0", "parent_id": "t3_vvtbh0", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "KatarinaDelRey", "body": "superpower of persuasion. I ask for the money and they hand it over! (with no casualties)", "created_utc": "1657478857.0", "edited": "False", "id": "ifml3xj", "is_submitter": "False", "link_id": "t3_vvy401", "parent_id": "t3_vvy401", "score": "3", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "KatarinaDelRey", "body": "my cats", "created_utc": "1657478743.0", "edited": "False", "id": "ifmkuoz", "is_submitter": "False", "link_id": "t3_vvy1mz", "parent_id": "t3_vvy1mz", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "KatarinaDelRey", "body": "The first one since I'm already an introvert, second one seems terrifying", "created_utc": "1657478683.0", "edited": "False", "id": "ifmkpr6", "is_submitter": "False", "link_id": "t3_vvy17l", "parent_id": "t3_vvy17l", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "KatarinaDelRey", "body": "definitely LA", "created_utc": "1657472841.0", "edited": "False", "id": "ifm75jw", "is_submitter": "False", "link_id": "t3_vvvxdf", "parent_id": "t3_vvvxdf", "score": "3", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "KatarinaDelRey", "body": "It depends on your situation and where you live! Learning Spanish is very useful in the US since there are so many Spanish speakers here, since you live in Turkey you should investigate about the most prominent or potentially useful languages for the country", "created_utc": "1657469017.0", "edited": "False", "id": "ifly7gs", "is_submitter": "False", "link_id": "t3_vvtzim", "parent_id": "t3_vvtzim", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "KatarinaDelRey", "body": "🫡", "created_utc": "1657425498.0", "edited": "False", "id": "ifk2hp0", "is_submitter": "False", "link_id": "t3_vveo0z", "parent_id": "t1_ifk16eb", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "KatarinaDelRey", "body": "yo soy la única que dijo butt :/ feelsbad", "created_utc": "1657424486.0", "edited": "False", "id": "ifk0pdc", "is_submitter": "False", "link_id": "t3_vviicg", "parent_id": "t1_ifk0gjv", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "KatarinaDelRey", "body": "yo sé pero si tuvieras que escoger", "created_utc": "1657424167.0", "edited": "False", "id": "ifk04mo", "is_submitter": "False", "link_id": "t3_vviicg", "parent_id": "t1_ifjzomf", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "KatarinaDelRey", "body": "pls butt", "created_utc": "1657423884.0", "edited": "False", "id": "ifjzlvu", "is_submitter": "False", "link_id": "t3_vviicg", "parent_id": "t3_vviicg", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "KatarinaDelRey", "body": "wha", "created_utc": "1657423653.0", "edited": "False", "id": "ifjz6ia", "is_submitter": "False", "link_id": "t3_vvi5t5", "parent_id": "t1_ifjyr2a", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "KatarinaDelRey", "body": ".", "created_utc": "1657423575.0", "edited": "False", "id": "ifjz1f1", "is_submitter": "False", "link_id": "t3_vvie06", "parent_id": "t1_ifjyxf2", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "KatarinaDelRey", "body": "touché", "created_utc": "1657423538.0", "edited": "False", "id": "ifjyz12", "is_submitter": "False", "link_id": "t3_vvibvl", "parent_id": "t1_ifjyva9", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "KatarinaDelRey", "body": "and who", "created_utc": "1657423497.0", "edited": "False", "id": "ifjywdb", "is_submitter": "False", "link_id": "t3_vvie06", "parent_id": "t3_vvie06", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "KatarinaDelRey", "body": "Really good at a few things because you can claim to be very good at something", "created_utc": "1657423349.0", "edited": "False", "id": "ifjymmw", "is_submitter": "False", "link_id": "t3_vvibvl", "parent_id": "t3_vvibvl", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "KatarinaDelRey", "body": "going to the bathroom it's so annoying to pee all the time", "created_utc": "1657422918.0", "edited": "False", "id": "ifjxtvn", "is_submitter": "False", "link_id": "t3_vvi5t5", "parent_id": "t3_vvi5t5", "score": "2", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "KatarinaDelRey", "body": "☠️☠️", "created_utc": "1657419816.0", "edited": "False", "id": "ifjrwar", "is_submitter": "False", "link_id": "t3_vvh17c", "parent_id": "t1_ifjr5fd", "score": "3", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "KatarinaDelRey", "body": "There exists surgery for this (unless you mean gender?)", "created_utc": "1657411875.0", "edited": "False", "id": "ifjcaq2", "is_submitter": "False", "link_id": "t3_vver8x", "parent_id": "t3_vver8x", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "KatarinaDelRey", "body": "I personally treat weekends just like any other day study-wise (but that is probably because I don't have a job lol)", "created_utc": "1657411689.0", "edited": "False", "id": "ifjbxds", "is_submitter": "False", "link_id": "t3_vven4t", "parent_id": "t3_vven4t", "score": "72", "subreddit": "college", "subreddit_id": "t5_2qh3z"}, {"author": "KatarinaDelRey", "body": "That mammals that live in water sleep with only half of their brain", "created_utc": "1657411516.0", "edited": "False", "id": "ifjbl0a", "is_submitter": "False", "link_id": "t3_vveoz9", "parent_id": "t3_vveoz9", "score": "3", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "KatarinaDelRey", "body": "Stalking isn't taken seriously in a lot of places", "created_utc": "1657411379.0", "edited": "False", "id": "ifjbb3b", "is_submitter": "False", "link_id": "t3_vveo0z", "parent_id": "t3_vveo0z", "score": "8", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "KatarinaDelRey", "body": "Corona", "created_utc": "1657411325.0", "edited": "False", "id": "ifjb73m", "is_submitter": "False", "link_id": "t3_vvem77", "parent_id": "t3_vvem77", "score": "2", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "KatarinaDelRey", "body": "a bacon cheeseburger that I had in the place I served jury duty in, I legit started to love jury duty after knowing the food was awesome", "created_utc": "1657411211.0", "edited": "False", "id": "ifjayko", "is_submitter": "False", "link_id": "t3_vvembe", "parent_id": "t3_vvembe", "score": "3", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "KatarinaDelRey", "body": "learn to code xD", "created_utc": "1657411072.0", "edited": "False", "id": "ifjaokk", "is_submitter": "False", "link_id": "t3_vvejp9", "parent_id": "t3_vvejp9", "score": "0", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "KatarinaDelRey", "body": "I was also recently in the same position as you, with a limited scholarship (but mines lasted 5 years). Have you looked into other potential scholarships? Also, if you are around 23/24 or older, you could also try applying to Fafsa as an independent (if you live in the US). I know a lot of people that have done that and it has helped them a lot. Also, I understand your parents have done a lot for you but you can always still ask for help. Any money they can provide now will help you tremendously for your future, and you can always pay them back of course. Something important to keep in mind is that you're a STEM student. That means that if you do end up taking loans, it won't be the end of the world since you will most likely earn the money back fast. STEM degrees have a great pay off. In general, I strongly suggest you don't do so many things at once. There are many options to consider money-wise: Looking into other scholarships, taking loans, or asking your parents for support, even if you'd rather not do that", "created_utc": "1657405599.0", "edited": "False", "id": "ifiz7k6", "is_submitter": "False", "link_id": "t3_vvaj2m", "parent_id": "t1_ifimvg2", "score": "1", "subreddit": "college", "subreddit_id": "t5_2qh3z"}, {"author": "KatarinaDelRey", "body": "My advice is going to seem pretty cliche, but graduating a bit later won't matter in the long run and the concept of catching up doesn't exist in the real world (my opinion). I took 2 years off of college due to health reasons, and I was freaking out about this, and I realized a lot of people had also done the same. Usually not for health but for different reasons, but so many people I meet in college are still way older than me (btw I'm also Comp Sci and I'm doing another BS in math)\n\nWhat I would do if I were you would be to take 4 classes and finish when I finish, because my point of view is that there's not point going into something you know there's a high chance you will not do well\n\nHowever, you have to decide this: What's more important, graduating earlier or your grades? It is technically possible to do well in your situation but I find it will be very hard", "created_utc": "1657399723.0", "edited": "False", "id": "ifimdx0", "is_submitter": "False", "link_id": "t3_vvaj2m", "parent_id": "t1_ifilg8s", "score": "4", "subreddit": "college", "subreddit_id": "t5_2qh3z"}, {"author": "KatarinaDelRey", "body": "Wow that's a lot, my question would be why are you taking so many classes in the first place? Why not 4 instead of 6 for example?", "created_utc": "1657399068.0", "edited": "False", "id": "ifikxev", "is_submitter": "False", "link_id": "t3_vvaj2m", "parent_id": "t3_vvaj2m", "score": "4", "subreddit": "college", "subreddit_id": "t5_2qh3z"}, {"author": "KatarinaDelRey", "body": "the clarinet and play it like squidward", "created_utc": "1657398948.0", "edited": "False", "id": "ifiknuh", "is_submitter": "False", "link_id": "t3_vvahn8", "parent_id": "t3_vvahn8", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "KatarinaDelRey", "body": "Yeah I agree, it's a good thing my native language is Spanish, otherwise French grammar would be a lot harder lol", "created_utc": "1657393648.0", "edited": "False", "id": "ifi8y0x", "is_submitter": "True", "link_id": "t3_vumgga", "parent_id": "t1_ifggxtb", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "KatarinaDelRey", "body": "Thanks! So essentially you recommend reading and speaking a lot?", "created_utc": "1657393469.0", "edited": "False", "id": "ifi8joh", "is_submitter": "True", "link_id": "t3_vumgga", "parent_id": "t1_ifg95jo", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "KatarinaDelRey", "body": "I want to say yes, because I have been reading almost daily for almost two years now in French. I always read in English before and I enjoy it so reading was never an issue\n\nThanks for the help, I'm redoing the grammar book and noticing I already know most of the things in that book, although I might just finish it though", "created_utc": "1657393372.0", "edited": "False", "id": "ifi8bs8", "is_submitter": "True", "link_id": "t3_vumgga", "parent_id": "t1_ifgirgz", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "KatarinaDelRey", "body": "I don't use Anki but I used to make my own flash cards when I first started using [cram.com](https://cram.com) lol\n\nHave you had a tutor before?", "created_utc": "1657393156.0", "edited": "False", "id": "ifi7uav", "is_submitter": "True", "link_id": "t3_vumgga", "parent_id": "t1_ifftdxd", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "KatarinaDelRey", "body": "Yeah that's true! It's definitely a lot less overwhelming now", "created_utc": "1657393075.0", "edited": "False", "id": "ifi7np5", "is_submitter": "True", "link_id": "t3_vumgga", "parent_id": "t1_ifew3jf", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "KatarinaDelRey", "body": "People dressing like a child for onlyfans", "created_utc": "1657387634.0", "edited": "False", "id": "ifhvgdt", "is_submitter": "False", "link_id": "t3_vv590i", "parent_id": "t3_vv590i", "score": "56", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "KatarinaDelRey", "body": "Thank you this was very helpful", "created_utc": "1657368418.0", "edited": "False", "id": "ifgr6q2", "is_submitter": "True", "link_id": "t3_vumgga", "parent_id": "t1_ifg9dmj", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "KatarinaDelRey", "body": "It depends how you define native, for me it’s one of the very first languages that you spoke when you were a baby", "created_utc": "1657368173.0", "edited": "False", "id": "ifgqsp6", "is_submitter": "False", "link_id": "t3_vuco7x", "parent_id": "t1_iffsc6y", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "KatarinaDelRey", "body": "Your English is very good :D", "created_utc": "1657341392.0", "edited": "False", "id": "iffrb4r", "is_submitter": "True", "link_id": "t3_vumgga", "parent_id": "t1_iffffcn", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "KatarinaDelRey", "body": "Thanks I’ll look into those!", "created_utc": "1657341345.0", "edited": "False", "id": "iffr8d3", "is_submitter": "True", "link_id": "t3_vumgga", "parent_id": "t1_ifex58r", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "KatarinaDelRey", "body": "Hi!! Duolingo is actually quite helpful when used with other resources :) I recommend starting with a book called “Easy French Step by Step” it really helped me get a very solid base in grammar, you should also start listening to french shows as soon as possible. You won’t understand much but watching with English subtitles will help you get used to the language fast\nThose are the things I did when starting out, but I’m sure there are other good options", "created_utc": "1657341191.0", "edited": "False", "id": "iffqz34", "is_submitter": "False", "link_id": "t3_vut6ch", "parent_id": "t3_vut6ch", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "KatarinaDelRey", "body": "A good activity you could try to do is plan out a roleplay activity with your tutor to do beforehand, study and be prepared for it :) it’s a great way to progress when there’s nothing new or interesting to talk about", "created_utc": "1657323290.0", "edited": "False", "id": "iferu57", "is_submitter": "False", "link_id": "t3_vunmye", "parent_id": "t3_vunmye", "score": "10", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "KatarinaDelRey", "body": "The book I bought is actually called French review !", "created_utc": "1657320510.0", "edited": "False", "id": "ifelsho", "is_submitter": "True", "link_id": "t3_vumgga", "parent_id": "t1_ifejx7u", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "KatarinaDelRey", "body": "Do you ever think there will be a time when a language learner should not necessarily be reviewing grammar though?", "created_utc": "1657320440.0", "edited": "False", "id": "ifelmx8", "is_submitter": "True", "link_id": "t3_vumgga", "parent_id": "t1_ifej7wv", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "KatarinaDelRey", "body": "thanks for the reply! I always forget about that lol", "created_utc": "1657320402.0", "edited": "False", "id": "ifeljwq", "is_submitter": "True", "link_id": "t3_vumgga", "parent_id": "t1_ifej7wv", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "KatarinaDelRey", "body": "The book that I bought has a LOT of written exercises, and it also has explanations of the grammar rules. But what exactly do you mean by linguistic explanations?", "created_utc": "1657320369.0", "edited": "False", "id": "ifelh9g", "is_submitter": "True", "link_id": "t3_vumgga", "parent_id": "t1_ifek93z", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "KatarinaDelRey", "body": "How to kill a mockingbird", "created_utc": "1657318217.0", "edited": "False", "id": "ifegjme", "is_submitter": "False", "link_id": "t3_vulj9v", "parent_id": "t3_vulj9v", "score": "6", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "KatarinaDelRey", "body": "LMFAO", "created_utc": "1657318097.0", "edited": "False", "id": "ifeg9zl", "is_submitter": "False", "link_id": "t3_vtzdff", "parent_id": "t1_ifed8pb", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "KatarinaDelRey", "body": "I was 7 when I moved to the US and I became fluent in English in a very short time, maybe a few months? But I understood way before, by watching a lot of SpongeBob on the TV. When you’re little you always learn fast and never purposely try to learn the language, it just sort of happens lol\n\nAnd I had no prior knowledge before going (I only spoke and understood Spanish )", "created_utc": "1657315959.0", "edited": "False", "id": "ifeb933", "is_submitter": "False", "link_id": "t3_vuco7x", "parent_id": "t3_vuco7x", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "KatarinaDelRey", "body": "a pic of merenguitos I just ate lol", "created_utc": "1657305834.0", "edited": "False", "id": "ifdmfsy", "is_submitter": "False", "link_id": "t3_vuhn62", "parent_id": "t3_vuhn62", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "KatarinaDelRey", "body": "Hi! With modern technology, there will always be a way to use the language. For listening: podcasts, Youtube or TV shows (try VPN for Netflix). For reading, any book that you like. And for speaking, you can always use a language exchange site like italki to connect with natives from the comfort of your own home! You don't need to live in the country or have an extremely specific reason to learn a language", "created_utc": "1657303851.0", "edited": "False", "id": "ifdhfwc", "is_submitter": "False", "link_id": "t3_vufksb", "parent_id": "t3_vufksb", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "KatarinaDelRey", "body": "There was a time in high school where I was procrastinating a lot, and my anxiety was extremely high and I was staying up until 4 am every day. One day, I was so tired that I spilled coffee on my laptop and that made me realize I can't do this anymore. I haven't procrastinated in anything for the years I've been in college", "created_utc": "1657303456.0", "edited": "False", "id": "ifdgg2x", "is_submitter": "False", "link_id": "t3_vugspn", "parent_id": "t3_vugspn", "score": "2", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "KatarinaDelRey", "body": "That's just extremely rude, I guess people forget they were also beginners too. I've only done one-on-one conversations with other people also learning a language, so they have also been very understanding. Although the teacher should've done something about it, it is also common sense to be polite and understand it is a beginner class", "created_utc": "1657303302.0", "edited": "False", "id": "ifdg23f", "is_submitter": "False", "link_id": "t3_vug23r", "parent_id": "t3_vug23r", "score": "42", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "KatarinaDelRey", "body": "Johnny depp tbh", "created_utc": "1657250056.0", "edited": "False", "id": "ifapnvy", "is_submitter": "False", "link_id": "t3_vu07n3", "parent_id": "t3_vu07n3", "score": "3", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "KatarinaDelRey", "body": "The invisible boatmobile", "created_utc": "1657248032.0", "edited": "False", "id": "ifalbsa", "is_submitter": "False", "link_id": "t3_vtyvfa", "parent_id": "t3_vtyvfa", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "KatarinaDelRey", "body": "It's not weird at all to live with your family in your twenties or even 30s in this economy. I feel like in the US people are obsessed with moving out, but in many other countries it's perfectly normal and acceptable to stay with your parents for way longer. I don't think age has anything to do with being a red flag, but the reason as to why someone is living with their parents. If that person makes a lot of money and still chooses to live with their parents, then it might be a bit strange. If that person is still saving and working hard to be independent, then it's not a red flag to live with your parents, regardless of your age. What is dumb is to move out because of \"social expectations\" and not because one is financially ready", "created_utc": "1657246384.0", "edited": "False", "id": "ifahpqd", "is_submitter": "False", "link_id": "t3_vtzfuy", "parent_id": "t3_vtzfuy", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "KatarinaDelRey", "body": "RINGS... I'm just so obsessed with men who wear a lot of rings", "created_utc": "1657246031.0", "edited": "False", "id": "ifagxkk", "is_submitter": "False", "link_id": "t3_vtzdff", "parent_id": "t3_vtzdff", "score": "5", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "KatarinaDelRey", "body": "It depends a lot on the person, but for most people I would say it is harder to lose weight, even with faster metabolism \nI am someone who is naturally underweight. I am nowhere near underweight now but that’s because I had to eat a lot (more than what I wanted) to get here. For me personally, it was easy, all I did was eat more. Now that I’m at a weight that I like (don’t want to gain or lose), I can understand how annoying it would be to lose weight. I’d rather be “too full” than be hungry, honestly", "created_utc": "1657229738.0", "edited": "False", "id": "if9fnun", "is_submitter": "False", "link_id": "t3_vtshvm", "parent_id": "t3_vtshvm", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "KatarinaDelRey", "body": "Thanks 😁👍 what are you doing?", "created_utc": "1657227885.0", "edited": "False", "id": "if9az69", "is_submitter": "False", "link_id": "t3_vtsasw", "parent_id": "t1_if9am3c", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "KatarinaDelRey", "body": "Ice skating !", "created_utc": "1657226976.0", "edited": "False", "id": "if98mek", "is_submitter": "False", "link_id": "t3_vtsasw", "parent_id": "t3_vtsasw", "score": "2", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "KatarinaDelRey", "body": "Really, that’s impressive considering all of the different tones, the only Asian language I am considering studying is Korean! \nSpanish is my mother tongue and I learned English when I was 7, when I was a teenager I was exposed to Greek for years (long story) although I haven’t spoken it in a while… I need to relearn it haha\nAnd right now im learning Italian with my mom, too beginner to say I speak it yet though", "created_utc": "1657226234.0", "edited": "False", "id": "if96nqg", "is_submitter": "False", "link_id": "t3_vtpa5g", "parent_id": "t1_if8rjf1", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "KatarinaDelRey", "body": "omg Mandarin, that's very difficult though! And you learned more than what you think, you might not remember much now but if you were to  start learning them again then it definitely wouldn't be from scratch :)", "created_utc": "1657219543.0", "edited": "False", "id": "if8p7wg", "is_submitter": "False", "link_id": "t3_vtpa5g", "parent_id": "t1_if8o8kk", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "KatarinaDelRey", "body": "😂😂😂", "created_utc": "1657218817.0", "edited": "False", "id": "if8nauo", "is_submitter": "False", "link_id": "t3_vtp7y5", "parent_id": "t1_if8m3om", "score": "2", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "KatarinaDelRey", "body": "At the moment I speak 4 but I'm only very fluent in 2 xD My goal for next year is to become fluent in French", "created_utc": "1657218549.0", "edited": "False", "id": "if8mljc", "is_submitter": "False", "link_id": "t3_vtpa5g", "parent_id": "t1_if8mais", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "KatarinaDelRey", "body": "NEW YORK !!! Best trip ever (I went in the winter)", "created_utc": "1657218343.0", "edited": "False", "id": "if8m25n", "is_submitter": "False", "link_id": "t3_vtpcmu", "parent_id": "t3_vtpcmu", "score": "2", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "KatarinaDelRey", "body": "language learning and I do it every day!", "created_utc": "1657218230.0", "edited": "False", "id": "if8lrmb", "is_submitter": "False", "link_id": "t3_vtpa5g", "parent_id": "t3_vtpa5g", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "KatarinaDelRey", "body": "amber heard", "created_utc": "1657218120.0", "edited": "False", "id": "if8lh71", "is_submitter": "False", "link_id": "t3_vtp7y5", "parent_id": "t3_vtp7y5", "score": "4", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "KatarinaDelRey", "body": "I don't think it's a stupid degree it's cool! I studied economics in hs and I enjoyed it\n\nAlso why are you thinking linguistics? I enjoy learning languages so I'm thinking of studying linguistics casually in my free time", "created_utc": "1657218063.0", "edited": "False", "id": "if8lbsh", "is_submitter": "False", "link_id": "t3_vtoyf0", "parent_id": "t1_if8l0oo", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "KatarinaDelRey", "body": "family business, best French comedy ever", "created_utc": "1657217832.0", "edited": "False", "id": "if8kpw2", "is_submitter": "False", "link_id": "t3_vtp4vs", "parent_id": "t3_vtp4vs", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "KatarinaDelRey", "body": "chad or karen", "created_utc": "1657217529.0", "edited": "False", "id": "if8jxbo", "is_submitter": "False", "link_id": "t3_vtp19p", "parent_id": "t3_vtp19p", "score": "2", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "KatarinaDelRey", "body": "Maybe linguistics? Right now I'm pursuing CS and math", "created_utc": "1657217439.0", "edited": "False", "id": "if8jot5", "is_submitter": "False", "link_id": "t3_vtoyf0", "parent_id": "t3_vtoyf0", "score": "2", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "KatarinaDelRey", "body": "my best friend", "created_utc": "1657217305.0", "edited": "False", "id": "if8jcdc", "is_submitter": "False", "link_id": "t3_vtox97", "parent_id": "t3_vtox97", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "KatarinaDelRey", "body": "Wait really? I didn’t even know that \nWhich servers? (And how do you find them)", "created_utc": "1657207523.0", "edited": "False", "id": "if7u3xt", "is_submitter": "False", "link_id": "t3_vt3n20", "parent_id": "t1_if6cald", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "KatarinaDelRey", "body": "squid gaaaaaame", "created_utc": "1657151211.0", "edited": "False", "id": "if52x5z", "is_submitter": "False", "link_id": "t3_vt472p", "parent_id": "t3_vt472p", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "KatarinaDelRey", "body": "omg yes, the 5 second ones haha\n\nI remember before when you couldn't skip 30 second ads and I'd legit go insane", "created_utc": "1657150346.0", "edited": "False", "id": "if50zji", "is_submitter": "False", "link_id": "t3_vt3ucg", "parent_id": "t1_if50s36", "score": "2", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "KatarinaDelRey", "body": "15 second advertisements", "created_utc": "1657150191.0", "edited": "False", "id": "if50muj", "is_submitter": "False", "link_id": "t3_vt3ucg", "parent_id": "t3_vt3ucg", "score": "4", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "KatarinaDelRey", "body": "whenever you have to do a presentation in class lol", "created_utc": "1657150150.0", "edited": "False", "id": "if50jls", "is_submitter": "False", "link_id": "t3_vt3s61", "parent_id": "t3_vt3s61", "score": "2", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "KatarinaDelRey", "body": "constantly using / looking at their phone", "created_utc": "1657150012.0", "edited": "False", "id": "if508gw", "is_submitter": "False", "link_id": "t3_vt3rom", "parent_id": "t3_vt3rom", "score": "5", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "KatarinaDelRey", "body": "Hi!! Have you tried to speak to native speakers online? I live in the US, so finding French speakers is very hard here, but I use italki (for free) :)", "created_utc": "1657149767.0", "edited": "False", "id": "if4zozt", "is_submitter": "False", "link_id": "t3_vt3n20", "parent_id": "t3_vt3n20", "score": "15", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "KatarinaDelRey", "body": "I'm not sure, I had pneumonia as a baby and needed penicillin, I'm not sure if I would have survived without it", "created_utc": "1657148461.0", "edited": "False", "id": "if4wr6f", "is_submitter": "False", "link_id": "t3_vt35g8", "parent_id": "t3_vt35g8", "score": "2", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "KatarinaDelRey", "body": "I’m not Trynna be funny you’re already a joke", "created_utc": "1657083813.0", "edited": "False", "id": "if1efou", "is_submitter": "False", "link_id": "t3_vshrfc", "parent_id": "t3_vshrfc", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "KatarinaDelRey", "body": "during jury duty...not fun...", "created_utc": "1657076355.0", "edited": "False", "id": "if116f6", "is_submitter": "False", "link_id": "t3_vsfmkf", "parent_id": "t3_vsfmkf", "score": "3", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "KatarinaDelRey", "body": "JFK", "created_utc": "1657074536.0", "edited": "False", "id": "if0xdgg", "is_submitter": "False", "link_id": "t3_vsf14f", "parent_id": "t3_vsf14f", "score": "6", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "KatarinaDelRey", "body": "sing along in a sad way and get in the moood", "created_utc": "1657074467.0", "edited": "False", "id": "if0x863", "is_submitter": "False", "link_id": "t3_vsf0gv", "parent_id": "t3_vsf0gv", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "KatarinaDelRey", "body": "Overly aggressive or \"dominant\" people.... like why are you mad all the time??", "created_utc": "1657074276.0", "edited": "False", "id": "if0wtn2", "is_submitter": "False", "link_id": "t3_vsexmy", "parent_id": "t3_vsexmy", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "KatarinaDelRey", "body": "Catcall makes you feel uncomfortable and it almost sounds degrading / mocking. Like, there's a difference between saying someone is pretty and whistling / saying sexual comments", "created_utc": "1657074145.0", "edited": "False", "id": "if0wjja", "is_submitter": "False", "link_id": "t3_vseumt", "parent_id": "t3_vseumt", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "KatarinaDelRey", "body": "Any song from ppcocaine", "created_utc": "1657073572.0", "edited": "False", "id": "if0vbf2", "is_submitter": "False", "link_id": "t3_vsepxs", "parent_id": "t3_vsepxs", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "KatarinaDelRey", "body": "Expected to have your entire life figured out", "created_utc": "1657062718.0", "edited": "False", "id": "if07y5g", "is_submitter": "False", "link_id": "t3_vsaz7c", "parent_id": "t3_vsaz7c", "score": "2", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "KatarinaDelRey", "body": "it was good", "created_utc": "1657059974.0", "edited": "False", "id": "if01och", "is_submitter": "False", "link_id": "t3_vsa02a", "parent_id": "t3_vsa02a", "score": "2", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "KatarinaDelRey", "body": "Mostly looks, intelligence and how much money they earn", "created_utc": "1657059533.0", "edited": "False", "id": "if00mxg", "is_submitter": "False", "link_id": "t3_vs9vbu", "parent_id": "t3_vs9vbu", "score": "3", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "KatarinaDelRey", "body": "when I read this question, the first that popped up was \"Are they real?\"\n\nIDK WHY", "created_utc": "1657058987.0", "edited": "False", "id": "iezzcaw", "is_submitter": "False", "link_id": "t3_vs9nf7", "parent_id": "t3_vs9nf7", "score": "2", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "KatarinaDelRey", "body": "reading other people's minds but without being able to control when", "created_utc": "1657058541.0", "edited": "False", "id": "iezyaag", "is_submitter": "False", "link_id": "t3_vs9h6t", "parent_id": "t3_vs9h6t", "score": "2", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "KatarinaDelRey", "body": "Asking someone when they are going to have kids", "created_utc": "1657058464.0", "edited": "False", "id": "iezy3nd", "is_submitter": "False", "link_id": "t3_vs9ebu", "parent_id": "t3_vs9ebu", "score": "2", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "KatarinaDelRey", "body": "TRÈS and galère lol", "created_utc": "1657057688.0", "edited": "False", "id": "iezw84u", "is_submitter": "False", "link_id": "t3_vrlh4c", "parent_id": "t3_vrlh4c", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "KatarinaDelRey", "body": "when guys are shy its sooooo cute", "created_utc": "1656563101.0", "edited": "False", "id": "iea2ilt", "is_submitter": "False", "link_id": "t3_vnzcd3", "parent_id": "t3_vnzcd3", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "KatarinaDelRey", "body": "She got over you in a week, unblocks you only to ask for a favor, talked bad about you to your best friend, AND is dating someone else?? Block her it looks like she's only gonna be a complete waste of your time and probably does not respect you whatsoever...", "created_utc": "1656562727.0", "edited": "False", "id": "iea1vxw", "is_submitter": "False", "link_id": "t3_vnz6xm", "parent_id": "t3_vnz6xm", "score": "2", "subreddit": "relationship_advice", "subreddit_id": "t5_2r0cn"}, {"author": "KatarinaDelRey", "body": "Becoming fluent in ANY language will be hard, it’s just that some languages are easier than others (for English speakers). So essentially, becoming fluent in Japanese will be SUPER hard while becoming fluent or highly proficient in an “easy” language will just be hard (lol)\nEvery language requires hard work and consistency. But like how many people have said before, the easiest language is the one you love the most and the one you’re willing to be dedicated to \nAlso idk if conjugation is easier in Japanese than Italian but that’s not that relevant to the overall difficulty", "created_utc": "1655579240.0", "edited": "False", "id": "icv1t0a", "is_submitter": "False", "link_id": "t3_vfb6b4", "parent_id": "t3_vfb6b4", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "KatarinaDelRey", "body": "Actually yeah that happens to me almost every time I do a story, and then when I do the writing prompt and I’m ready to submit it tells me that", "created_utc": "1655569374.0", "edited": "False", "id": "icuh4j5", "is_submitter": "False", "link_id": "t3_veoqvf", "parent_id": "t3_veoqvf", "score": "1", "subreddit": "duolingo", "subreddit_id": "t5_2t6ze"}, {"author": "KatarinaDelRey", "body": "Buttet", "created_utc": "1655526453.0", "edited": "False", "id": "icsr9ig", "is_submitter": "False", "link_id": "t3_veg3yh", "parent_id": "t3_veg3yh", "score": "1", "subreddit": "DramaticText", "subreddit_id": "t5_33ebbv"}, {"author": "KatarinaDelRey", "body": "Thanks so much for the input!! BTW 10 hours a day is seriously impressive, I wish I could do that haha\n\nWow I didn't know reading was so important, actually I read every day but I was probably planning to take a break because I was going to start learning another language soon, but not anymore !\n\nAlso I agree that sometimes language partners could be so stressful..\n\nDid you read more in Spanish?", "created_utc": "1655525281.0", "edited": "False", "id": "icsph8j", "is_submitter": "True", "link_id": "t3_veoylf", "parent_id": "t1_icrgz6e", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "KatarinaDelRey", "body": "I had no idea that was true. Actually I have heard of people becoming fluent in a language without talking to others, but what they said was that they basically made a lot of YouTube videos and talked in English when making the videos.\n\nI would be seriously impressed if someone reached even basic fluency and barely talked but I'm sure it's possible", "created_utc": "1655524936.0", "edited": "False", "id": "icsoxot", "is_submitter": "True", "link_id": "t3_veoylf", "parent_id": "t1_icrw5ez", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "KatarinaDelRey", "body": "Interesting! Actually I was talking to a language exchange partner and he told me that BECAUSE reading is usually much more complex than actual speech, it was not very useful (in his opinion). I've always thought that it was useful but his comment got me thinking since he said most people won't use the language from a lot of books", "created_utc": "1655524660.0", "edited": "False", "id": "icsohzv", "is_submitter": "True", "link_id": "t3_veoylf", "parent_id": "t1_icrdodz", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "KatarinaDelRey", "body": "thanks for the advice! Now I know to definitely not take a break from reading :D What I do is read a book while listening to the audio at the same time \n\nAlso this is kinda weird but whenever I see someone's native language is French I'm like...OMG...cool.. lol", "created_utc": "1655524556.0", "edited": "False", "id": "icsobxq", "is_submitter": "True", "link_id": "t3_veoylf", "parent_id": "t1_icrcv7z", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "KatarinaDelRey", "body": "Really? I had no idea that was a skill often left for last, I practice listening more since it's just easier, like watching a TV show. Also, do you recommend reading specific books? Or do you think ANY book of any genre will help equally?", "created_utc": "1655524368.0", "edited": "False", "id": "icso1ai", "is_submitter": "True", "link_id": "t3_veoylf", "parent_id": "t1_icr7hxj", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "KatarinaDelRey", "body": "thank you!! Actually I am going to start doing what you said, but what do you mean by radio plays? Do you mean like podcasts? I've never heard of that before", "created_utc": "1655524262.0", "edited": "False", "id": "icsnv2t", "is_submitter": "True", "link_id": "t3_veoylf", "parent_id": "t1_icr6sw0", "score": "4", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "KatarinaDelRey", "body": "Actually your situation is perfectly normal, and is the case for almost everyone I’ve met whose native language is different than the one they learned at school (English). Some people tell me that when I speak Spanish I have a bit of an accent and when I speak English I have a bit of a Hispanic accent lol Also, your accent doesn’t define how “bad” you are in a language…. Not everyone can control that, and some people are amazing at mimicking accents yet don’t know the language and others never make mistakes yet have an accent. Don’t be so hard on yourself!! :)", "created_utc": "1655487814.0", "edited": "False", "id": "icqlv5l", "is_submitter": "False", "link_id": "t3_vekym0", "parent_id": "t3_vekym0", "score": "13", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "KatarinaDelRey", "body": "I would say Spanish or German?? There are a lot of Spanish speakers in the US, and German because apparently it might help you earn the most money 👍 However, Spanish will be easier to learn for you so I would start with that one :) Also, if you ever want to learn another Romance language, that would give you a head start! Spanish is my mother tongue and I can understand a lot in Italian already and I haven’t started to study it seriously yet. Knowing Spanish didn’t help me understand spoken French, but it helped me tremendously with the grammar!", "created_utc": "1655444873.0", "edited": "False", "id": "icoel66", "is_submitter": "False", "link_id": "t3_ve5b0w", "parent_id": "t3_ve5b0w", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "KatarinaDelRey", "body": "Seriously?? All languages have equal value. The other day I was talking to a language exchange partner and he was telling me that he knew three African languages but that they didn't count because they were relatively unknown. He said \"it's not like knowing Spanish or Italian, for instance.\" It made me sad, honestly. Learn whatever you're passionate about and forget what people tell you, learning languages for many hobbyists isn't about what is more \"practical\" or what will get you the most money. It's about PASSION for learning new things. And it might not even be about which language you choose to learn, many people think that unless you're working 24/7 earning money, then you must be wasting your time.", "created_utc": "1655439811.0", "edited": "False", "id": "ico6kyc", "is_submitter": "False", "link_id": "t3_vdlt8t", "parent_id": "t3_vdlt8t", "score": "0", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "KatarinaDelRey", "body": "Adults can’t learn *exactly* the same way that children can…. Full immersion would be ideal but dedicating a lot of time to grammar (at FIRST) would be very useful and practical for an adult\n\nI think adults have to begin consciously learning a language (grammar drills, memorization, etc) and once they are advanced enough they can begin to learn without trying (watching TV shows, reading books and talking)", "created_utc": "1655420541.0", "edited": "False", "id": "icn3gat", "is_submitter": "False", "link_id": "t3_vdxyov", "parent_id": "t3_vdxyov", "score": "24", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "KatarinaDelRey", "body": "As of right now, college has been the best time of my life…. But I sure hope it doesn’t stay that way, especially since I want to travel !!!! During college you should also find the things you love to do, other than the career you’re going to be in. A lot of people use their time in college for just classes or partying so it would be weird if this was their “peak”", "created_utc": "1655358748.0", "edited": "False", "id": "icjupuk", "is_submitter": "False", "link_id": "t3_vddgg8", "parent_id": "t3_vddgg8", "score": "2", "subreddit": "college", "subreddit_id": "t5_2qh3z"}, {"author": "KatarinaDelRey", "body": "You won't slow down at all, the majority of French input I got was from dubbed shows..On Netflix there are not a lot of native French shows but I can practically understand the ones that I watch thanks to how much I listened to dubbed shows (without subtitles). However, you can always watch vloggers or YouTubers if your options are limited :)", "created_utc": "1655333429.0", "edited": "False", "id": "iciirkz", "is_submitter": "False", "link_id": "t3_vczhnr", "parent_id": "t3_vczhnr", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "KatarinaDelRey", "body": "Oh ok\nSo to be perfectly clear, if I was born before January 1,1999 yet I am 23, I will still be independent on the fafsa?", "created_utc": "1641181314.0", "edited": "False", "id": "hr10ymc", "is_submitter": "False", "link_id": "t3_ruqyo6", "parent_id": "t1_hr0y2mr", "score": "1", "subreddit": "FAFSA", "subreddit_id": "t5_3fas1"}, {"author": "KatarinaDelRey", "body": "Tbh being independent on the fafsa has nothing to do with taxes", "created_utc": "1641181156.0", "edited": "False", "id": "hr10lzk", "is_submitter": "False", "link_id": "t3_ruqyo6", "parent_id": "t1_hr10fl8", "score": "2", "subreddit": "FAFSA", "subreddit_id": "t5_3fas1"}, {"author": "KatarinaDelRey", "body": "But I’m confused bc being born before that date could mean someone is 23 tho", "created_utc": "1641180304.0", "edited": "False", "id": "hr0yoro", "is_submitter": "False", "link_id": "t3_ruqyo6", "parent_id": "t1_hr0y2mr", "score": "1", "subreddit": "FAFSA", "subreddit_id": "t5_3fas1"}]