[{"author": "Kesoburk", "body": "This made things so much easier ! The language is so old-timey I changed the word order around to make it more understandable, but here is my full attempt:\n\n”Thereafter, Inspector Kraak revealed, in regards to the blacksmith Petter Jäfwert, one permit of leave of absence given to the aforementioned blacksmith by Bookkeeper Efwertz, who at the time was both Mr Cavalry Master Johnston's and Mr Ironmaster Prinzell's servant/attendant, dated 1740, in which it is stated that the size of the debt is 51 Dr. 1 1/3 Smt. (*daler silvermynt*, currency in silver coins), and that this Petter Jäfwert has become indebted 11.16 silver coins to Mr Ironmaster Prinzell. Hereby it is argued, that the same blacksmith truly has been accepted into Mr Ironmaster’s service/employment, regarding which circumstance, the Inspector claimed not only that the aforementioned debt of 51.1 and 1/3 silver coins must be paid, but also, to Mr Ironmaster’s detriment, that he is to oblige according to the regulations, since he has taken \\[the blacksmith\\] unlawfully into his service. Mr Ironmaster denied wholly to having had Petter Jäfwert in his service, and claimed, that the by Inspector Kraak previously stated reason was not powerful \\[enough\\], to convince him of this.\n\nThen Inspector Kraak held, that the now summoned witnesses must be heard, namely Bookkeeper Efwertz, the wife Sara Baltzarsdaughter, and the wife Brita Eriksdaughter. Upon being asked if Mr Ironmaster Prinzell had anything to object against these witnesses, he said, that regarding Bookkeeper Efwertz, he is Mr Ironmaster’s servant/attendant and in his care. Regarding the wife Sara Baltzarsdaughter, she is the wife of the blacksmith, namely Rubbert, whose debt/guilt is now being disputed, and thus also partly a plaintiff in the case, and likewise \\[she is\\] Mr Ironmaster’s opposing party, which she will continue to show, considering the way she, before the Court, multiple times, with call and response (lit:*”with speech and answers”*), has sought to participate in the matter. And at last regarding the wife Brita Eriksdaughter, she is the mother of the wife Sara, and likewise Petter Jäfwerts wife, prompting \\[Mr Ironmaster to demand\\] that the conflict of interest \\[of these witnesses\\] be subjected to re-examination by the Berg District Court.”\n\nBeyond the great explanation by u/Shudnawz, I figured **wärkel.** is a shortened version of wärkelig/en = *verkligen,* which means \"truly\" or \"really\".", "created_utc": "1666791743.0", "edited": "1666792189.0", "id": "iturboo", "is_submitter": "False", "link_id": "t3_ydmkq9", "parent_id": "t1_ittxvly", "score": "2", "subreddit": "Svenska", "subreddit_id": "t5_2scor"}, {"author": "Kesoburk", "body": "As a Swede, I'm embarrassed it took me so long to connect the dots but in Swedish, 'undvik' means avoid. Which perfectly describes the island! Creepy, dead and desolate - avoid!", "created_utc": "1666028098.0", "edited": "False", "id": "isp4qux", "is_submitter": "False", "link_id": "t3_y66axd", "parent_id": "t1_isnnjh2", "score": "50", "subreddit": "witcher", "subreddit_id": "t5_2sebi"}, {"author": "Kesoburk", "body": "Thank you!", "created_utc": "1664921999.0", "edited": "False", "id": "ir2saz2", "is_submitter": "True", "link_id": "t3_xtn3w4", "parent_id": "t1_iqqsf8v", "score": "1", "subreddit": "turntables", "subreddit_id": "t5_2z1x0"}, {"author": "Kesoburk", "body": "Det är exakt detta vi gjort, han har inte sagt att han tycker att jag gör något särskilt konstigt men likväl ska maskinkräket vägra just när jag ska ha kaffe. Misogyna lilla as", "created_utc": "1664807286.0", "edited": "False", "id": "iqvxvij", "is_submitter": "True", "link_id": "t3_xudv97", "parent_id": "t1_iqvvfwh", "score": "5", "subreddit": "swedishproblems", "subreddit_id": "t5_2vyct"}, {"author": "Kesoburk", "body": "men jag gillar maks o det va rolit 😡", "created_utc": "1664807131.0", "edited": "1664807532.0", "id": "iqvxil4", "is_submitter": "True", "link_id": "t3_xufu3y", "parent_id": "t1_iqvrv5a", "score": "3", "subreddit": "maxhamburgare", "subreddit_id": "t5_3s40v3"}, {"author": "Kesoburk", "body": "[Såhär](https://imgur.com/a/2PQVwy4) menar du?", "created_utc": "1664795683.0", "edited": "False", "id": "iqvbhd3", "is_submitter": "True", "link_id": "t3_xudv97", "parent_id": "t1_iqvb6xv", "score": "39", "subreddit": "swedishproblems", "subreddit_id": "t5_2vyct"}, {"author": "Kesoburk", "body": "Jag har börjat formulera en teori om att det är en HAL 9000-situation där min kaffemaskin har kopplat upp sig på internet och tittat på för mycket Andrew Tate-videor och därmed kommit fram till att den ska försöka etablera dominans över mig. Har funderat på att försöka gaslighta den tillbaka genom att knäppa av huvudströmbrytaren lite då och då eller typ använda min perkulator mitt framför den i någon vecka bara för att tydligt demonstrera att jag inte behöver kapslar, men är lite rädd att maskinerna kommer börja samarbeta mot mig i så fall. Ska höra med lokala prästen om hen kan komma och skvätta lite vigvatten och läsa någon skrift så kanske det löser sig.", "created_utc": "1664795306.0", "edited": "False", "id": "iqvaxqm", "is_submitter": "True", "link_id": "t3_xudv97", "parent_id": "t1_iqva3im", "score": "25", "subreddit": "swedishproblems", "subreddit_id": "t5_2vyct"}, {"author": "Kesoburk", "body": "😳\n\nBor du på min balkong eller?", "created_utc": "1664794528.0", "edited": "False", "id": "iqv9udt", "is_submitter": "True", "link_id": "t3_xudv97", "parent_id": "t1_iqv9mi9", "score": "18", "subreddit": "swedishproblems", "subreddit_id": "t5_2vyct"}, {"author": "Kesoburk", "body": "Usch då, det låter inte lätt. Hur hittar du byxor som passar?", "created_utc": "1664794415.0", "edited": "False", "id": "iqv9owt", "is_submitter": "True", "link_id": "t3_xudv97", "parent_id": "t1_iqv9eye", "score": "12", "subreddit": "swedishproblems", "subreddit_id": "t5_2vyct"}, {"author": "Kesoburk", "body": "Ynka dödliga bävar inför denna tidlösa och uråldriga sanning", "created_utc": "1664794275.0", "edited": "False", "id": "iqv9ib4", "is_submitter": "False", "link_id": "t3_xucly1", "parent_id": "t1_iqv8cw9", "score": "8", "subreddit": "sweden", "subreddit_id": "t5_2qofe"}, {"author": "Kesoburk", "body": "Based on having 0 bitches", "created_utc": "1664793876.0", "edited": "False", "id": "iqv8z4y", "is_submitter": "True", "link_id": "t3_xudv97", "parent_id": "t1_iqv8t5n", "score": "15", "subreddit": "swedishproblems", "subreddit_id": "t5_2vyct"}, {"author": "Kesoburk", "body": "Nej han är tyvärr på semester i de norrländska skogarna där han bygger en altan med sina bara händer, tuggar småspik och dricker öl eller vad det nu är män gör", "created_utc": "1664792823.0", "edited": "False", "id": "iqv7mhe", "is_submitter": "True", "link_id": "t3_xudv97", "parent_id": "t1_iqv71gj", "score": "407", "subreddit": "swedishproblems", "subreddit_id": "t5_2vyct"}, {"author": "Kesoburk", "body": "Jag tror jag har fattat, det är alltså:\n\n* Bill Gates\n* Fysiskt och psykiskt våld\n* Etablera dominans", "created_utc": "1664792661.0", "edited": "1664793026.0", "id": "iqv7fd9", "is_submitter": "True", "link_id": "t3_xudv97", "parent_id": "t1_iqv75za", "score": "47", "subreddit": "swedishproblems", "subreddit_id": "t5_2vyct"}, {"author": "Kesoburk", "body": "Vi håller på att uppnå nivåer av meta-skämt som min kvinnohjärna inte kan begripa", "created_utc": "1664792293.0", "edited": "False", "id": "iqv6yw5", "is_submitter": "True", "link_id": "t3_xudv97", "parent_id": "t1_iqv5cdv", "score": "421", "subreddit": "swedishproblems", "subreddit_id": "t5_2vyct"}, {"author": "Kesoburk", "body": "Jag är helt mållös. Detta förklarar allt. Jag menar, det är den perfekta hämnden för alla gånger min sambo har tvingats lyfta saker och fånga insekter åt mig eftersom mina små och sköra kvinnorhänder inte klarar av den typen av fysiskt arbete. Jag som trodde att alla smörgåsar jag gjort åt honom var kompensation, men jag ser nu att jag varit dumdristig.\n\nTack för att du upplyst mig med denna djupa kunskap, skicka gärna förslag på vilka skiftnycklar du tycker funkar bäst att äta med så ska jag gottgöra min sambo till bästa förmåga. Nu ska jag ut och hämta lite stenar och testa den där tuttgrejen.", "created_utc": "1664792056.0", "edited": "False", "id": "iqv6ooy", "is_submitter": "True", "link_id": "t3_xudv97", "parent_id": "t1_iqv58yr", "score": "74", "subreddit": "swedishproblems", "subreddit_id": "t5_2vyct"}, {"author": "Kesoburk", "body": "Fan, missade honom. Ska gå och göra det direkt, hoppas detta hjälper", "created_utc": "1664790912.0", "edited": "False", "id": "iqv5c7y", "is_submitter": "True", "link_id": "t3_xudv97", "parent_id": "t1_iqv57mo", "score": "44", "subreddit": "swedishproblems", "subreddit_id": "t5_2vyct"}, {"author": "Kesoburk", "body": "Att jag inte såg det förut... Jävla Solna Båtsällskap", "created_utc": "1664790658.0", "edited": "False", "id": "iqv51tk", "is_submitter": "True", "link_id": "t3_xudv97", "parent_id": "t1_iqv4rp8", "score": "70", "subreddit": "swedishproblems", "subreddit_id": "t5_2vyct"}, {"author": "Kesoburk", "body": "Detta är gjort och utan effekt tyvärr. Det är dock jänkarskit så den kanske inte lyssnar på svenska tilltal?", "created_utc": "1664790557.0", "edited": "False", "id": "iqv4xkv", "is_submitter": "True", "link_id": "t3_xudv97", "parent_id": "t1_iqv4tkq", "score": "99", "subreddit": "swedishproblems", "subreddit_id": "t5_2vyct"}, {"author": "Kesoburk", "body": "Ska knycka min egen nacke snart", "created_utc": "1664788446.0", "edited": "False", "id": "iqv2lai", "is_submitter": "True", "link_id": "t3_xudv97", "parent_id": "t1_iqv1wrb", "score": "375", "subreddit": "swedishproblems", "subreddit_id": "t5_2vyct"}, {"author": "Kesoburk", "body": "Jag har testat att vara både lätt- och hårdhänt när jag stänger igen den men ska från och med nu vara brutal", "created_utc": "1664788383.0", "edited": "False", "id": "iqv2ipp", "is_submitter": "True", "link_id": "t3_xudv97", "parent_id": "t1_iqv24og", "score": "32", "subreddit": "swedishproblems", "subreddit_id": "t5_2vyct"}, {"author": "Kesoburk", "body": "[Här](https://www.youtube.com/watch?v=oHg5SJYRHA0) är hans redditprofil, hoppas verkligen på en lösning fort för jag klarar inte detta länge till", "created_utc": "1664787903.0", "edited": "False", "id": "iqv1zv9", "is_submitter": "True", "link_id": "t3_xudv97", "parent_id": "t1_iqv185h", "score": "318", "subreddit": "swedishproblems", "subreddit_id": "t5_2vyct"}, {"author": "Kesoburk", "body": "I have active speakers, so I gather in that case I’d need a turntable and a preamp, or a turntable with built-in preamp?", "created_utc": "1664784805.0", "edited": "False", "id": "iquymch", "is_submitter": "True", "link_id": "t3_xtn3w4", "parent_id": "t1_iqqy1hr", "score": "1", "subreddit": "turntables", "subreddit_id": "t5_2z1x0"}, {"author": "Kesoburk", "body": "Flera har tipsat om det redan men att göra saker i små steg är a och o. Har hållit på att träna bort social ångest i 10 år snart där det började med regelbundna sociala möten i trygg miljö (för mig var det kyrkan). Att bara vistas i miljöer med mycket folk kan också vara ett steg på vägen, typ plugga på ett bibliotek/café, träna utomhus osv. I mångt och mycket bryr sig ingen i alla fall, även om det inte alltid är det lättaste.\n\nFör mig funkade det att bygga på detta med miljöer som tillåter visst ”spelutrymme”, typ extrajobb i serviceyrke där ingen kommer ihåg eller dömer en som person, men man ändå får ut fördelarna av regelbunden ”oförberedd” social interaktion. Började även i teatergrupp som jag länge velat men aldrig vågat, men det var väldigt utvecklande när man kunde använda en rollfigurs identitet som ”sköld” samtidigt som jag själv fick träna mig i att stå på scen framför folk.\n\nHade aldrig kommit dit jag är nu om jag inte tagit små steg under lång tid, så för mig har nyckeln varit att alltid utmana komfortzonen, även om det betyder att man alltid är lite obekväm i sociala sammanhang. Det betyder dock också att jag kan fungera i vardagen nu jämfört med tidigare, så för mig har det varit väldigt värdefullt.", "created_utc": "1664177549.0", "edited": "False", "id": "ipy0ukc", "is_submitter": "False", "link_id": "t3_xnl1ai", "parent_id": "t3_xnl1ai", "score": "1", "subreddit": "swedishproblems", "subreddit_id": "t5_2vyct"}, {"author": "Kesoburk", "body": "Står bakom detta till 100%! Min svägerska träffade sin kille genom att de gick på samma gympass en gång i veckan. Om man börjar dyka upp på samma ställe regelbundet och är genuint trevlig så träffar man folk. Gillar du inte yoga, testa typ spinning, skivstångsklasser, cirkelfys osv. där det brukar vara mer mixat män/kvinnor. Har du tur skaffar du kanske nya vänner på köpet!", "created_utc": "1664090889.0", "edited": "False", "id": "iptbjvo", "is_submitter": "False", "link_id": "t3_xmzjcg", "parent_id": "t1_ipre8ct", "score": "6", "subreddit": "sweden", "subreddit_id": "t5_2qofe"}, {"author": "Kesoburk", "body": "Detta påminde mig om hur jag mådde under pandemin, var redan väldigt introvert med social ångest och var helt beroende av universitetet för social interaktion och struktur i livet. Corona fuckade upp exakt allt för mig, hatar distans pga har dålig självdisciplin och måste ha något som tvingar mig ut ur lägenheten, blev snabbt extremt isolerad. Orkade ingenting trots att jag aldrig gjorde något, fick sämre betyg, hatade mig själv för att jag inte bara kunde kliva ur sängen och hantera situationen. Det blev en ond spiral av skit där mitt dygn var kl 11-03, grät mycket, vågade knappt svara i telefon längre när min sociala comfort zone fort krympte, hatade mig själv ännu mer, etc.\n\nDet som hjälpte allra mest under denna tid (och kanske främst efter att samhället började öppna upp igen) var rutiner. Jag la mobilen utanför sovrummet så att jag tvingades gå upp samma tid varje dag, när jag väl var uppe var det lättare att ta sig till duschen och när jag väl duschat blev jag pigg och orkade äta frukost. Underskatta aldrig vikten av att äta riktig mat regelbundet, under pandemin blev jag extremt orkeslös och livnärde mig mest på bröd, chips och typ nudlar. Gör INTE det, om det är det enda man äter mår man skit. Satsa på storkok och matlådor om du har möjlighet, behöver inte vara svårt eller dyrt men det gör sån jävla skillnad för måendet. Sluta inte ta hand om dig själv.\n\nJag började också boka in mig i grupprum på universitetsbiblioteket för då hade jag någonstans att vara en viss tid, bokade tränings-/yogapass på gymmet bara så att jag skulle tvingas gå dit, bad sakta men säkert mina kompisar boka in fika med mig när de kunde osv. Orkade inte alltid träna men jag var åtminstone ute i dagsljuset i 10 minuter, även om det bara var att stå på balkongen. Då blev det lättare att faktiskt komma ut i friska luften, började kunna gå promenader osv. Ibland följde pojkvännen med så att jag kunde prata med honom, väldigt skönt när jag satt i liknande sits som du och inte kände att jag kunde ta detta med föräldrarna. Mådde bättre efter ett tag, orkade ta upp träningen mer, orkade börja handla ordentligt, laga mat, plugga, sov bättre, mm.\n\nDet viktigaste du kan ta med dig är att det tar tid, baby steps. Men varje litet steg är ett framsteg och även om du faller några steg tillbaka ibland så är det helheten som räknas. Allt handlar om att vara konsekvent. Det är skitjobbigt och man orkar inte varje dag, men det måste inte vara perfekt så länge man härdar ut i längden. Jag känner verkligen för dig och hoppas att du mår bättre snart, har sett väldigt många bra konkreta tips i denna tråd. Jag själv har fortfarande inte särskilt bra självkänsla och brottas fortfarande med min ångest, men jag mår så galet mycket bättre än för 2 år sedan och då känns det värt det att jag kämpade varenda dag för att komma hit.", "created_utc": "1663877811.0", "edited": "1663878173.0", "id": "ipijpnu", "is_submitter": "False", "link_id": "t3_xl0a6q", "parent_id": "t3_xl0a6q", "score": "1", "subreddit": "swedishproblems", "subreddit_id": "t5_2vyct"}, {"author": "Kesoburk", "body": "Det här känns inte riktigt lämpligt på en leksak för barn, kontakta företaget omedelbart och kräv pengarna tillbaka", "created_utc": "1663534539.0", "edited": "False", "id": "ioz7vpl", "is_submitter": "False", "link_id": "t3_xhc8qh", "parent_id": "t3_xhc8qh", "score": "3", "subreddit": "sweden", "subreddit_id": "t5_2qofe"}, {"author": "Kesoburk", "body": "Näe... Näe, jag tror faktiskt inte det", "created_utc": "1663522407.0", "edited": "False", "id": "ioyak2m", "is_submitter": "False", "link_id": "t3_xhkt4z", "parent_id": "t3_xhkt4z", "score": "2", "subreddit": "SWARJE", "subreddit_id": "t5_2w9oz"}, {"author": "Kesoburk", "body": "That's some truly *off-the-wall* stuff", "created_utc": "1663514794.0", "edited": "False", "id": "ioxqz2c", "is_submitter": "False", "link_id": "t3_xhc93c", "parent_id": "t3_xhc93c", "score": "3", "subreddit": "Finland", "subreddit_id": "t5_2qztz"}, {"author": "Kesoburk", "body": "Jobbade extra på fritids-/ungdomsgård i en stockholmsförort under gymnasiet, pissdåligt betalt 5 h/v men förväntades utöver det gå på möte 1-2 h/v utan ersättning. Chefen var på oss om engagemang men var själv loj som fan och kunde försvinna utomlands i veckor utan förvarning, verkade inte särskilt sugen på att faktiskt själv jobba. Han bråkade också med en anställd som inte fått lön på två månader så illa att hon slutade på plats. \n\nNågra besökare var helt okej men jag kände mig ofta otrygg och sexualiserad, många tjejer var konfliktsökande och såg ner på mig som vit medelklasstjej och många killar kunde fälla olämpliga kommentarer eller byta till annat språk framför mig, så helt uppenbarligen för att kommentera något om mig. Jag var då 16 och snittåldern på besökare var kanske 20. Det förekom också helt klart en del knarkhandel som ingen tycktes vilja anmäla och jag slutade efter tre månader eller så. Rekommenderar inte.", "created_utc": "1663506161.0", "edited": "1663507571.0", "id": "iox7cxd", "is_submitter": "False", "link_id": "t3_xhbpam", "parent_id": "t3_xhbpam", "score": "14", "subreddit": "sweden", "subreddit_id": "t5_2qofe"}, {"author": "Kesoburk", "body": "Är uppvuxen en bit ut på pendeltågslinjen och var inte ofta i Stockholm som liten, men gick gymnasiet utanför tullarna och fick kompisar från staden. Har bott en vända i söderort och bor nu på röda linjen för plugg. Stockholm är otroligt vackert och jag känner mig hemma här, jag vet hur allt funkar osv. men jag har aldrig känt att jag är stockholmare. Kan delvis bero på mycket nära släkt utanför staden, mamma kommer från längst ut på pendeltågslinjen och pappa från en by i Dalarna. Har även släkt i Norrbotten och Finland där jag varit väldigt mycket som barn och som jag besöker om somrarna. Min pappa har också dialekt som smittat av sig på mig vilket komiskt nog gör att jag ofta blir ifrågasatt när jag säger att jag är uppvuxen i länet (!)\n\nJag ser mig mest som pendlare eller kranskommunare, inte stadsbo. Sedan jag blev myndig och flyttade hemifrån har jag nog också insett att det heller inte är Stockholm det är fel på utan att jag bara inte gillar stora städer, även fast jag trivs okej i Stockholm är det min största mardröm att bo i innerstan, och jag får yrsel av megastäder som London och New York. Min hemort har ca 10,000 invånare och det är alltid småorterna jag faller hårdast för, så jag antar att jag mestadels identifierar mig som småstadsbo med närhet till landsbygden. Misstänker att det kanske är så jag egentligen vill leva när jag har studerat klart.", "created_utc": "1663501012.0", "edited": "1666041685.0", "id": "iowxk09", "is_submitter": "False", "link_id": "t3_xhbzkd", "parent_id": "t3_xhbzkd", "score": "9", "subreddit": "stockholm", "subreddit_id": "t5_2r7aq"}, {"author": "Kesoburk", "body": "Känn dig fri att använda den hur du vill!", "created_utc": "1663411942.0", "edited": "False", "id": "ios6fkk", "is_submitter": "False", "link_id": "t3_xgf98c", "parent_id": "t1_ios63uy", "score": "0", "subreddit": "sweden", "subreddit_id": "t5_2qofe"}, {"author": "Kesoburk", "body": "Jag visste att du påminde mig om någon! [https://imgur.com/a/gf44pXJ](https://imgur.com/a/gf44pXJ)", "created_utc": "1663411151.0", "edited": "False", "id": "ios5e7o", "is_submitter": "False", "link_id": "t3_xgf98c", "parent_id": "t3_xgf98c", "score": "8", "subreddit": "sweden", "subreddit_id": "t5_2qofe"}, {"author": "Kesoburk", "body": "*Snälla* is often taught to kids in order for them to learn to be polite, so it's very common for kids to use when they ask for something like *Mamma, kan jag få godis? Snälla?* (\"Mom, can I have some candy? Please?\"). Other than that it's only really used when pleading, and then it implies that you're thoroughly begging someone for something. It can be used in a playful manner, like:\n\n*Snälla du, kan inte jag få en kopp kaffe?* \\- The direct translation is \"Kind you, couldn't I have a cup of coffee?\", although the meaning is \"Please, darling, may I have a cup of coffee?\"\n\nBut you would only really use this with close family, never in a coffee shop as it would then be perceived as patronizing. Using *snälla* in this scenario implies that you're entitled to coffee and that it is absolutely justified of you to ask someone else to make you a cup, whereas saying *Skulle jag kunna få en kopp kaffe, tack?* (\"Could I have a cup of coffee, please?\") is a polite way of asking someone if they can make you some coffee, but that you're not being an entitled ass about it.\n\n*Snälla* can also be used to call someone out, but this is quite confrontational so I would avoid it. As with many other parts of the Swedish language it's also all about *how* you say it:\n\n*Kan du snälla sluta? Jag jobbar.* \\- \"Will you please cut it out? I'm working.\"\n\n*Men, snä-****LLA****! Skärp dig!* \\- \"This is ABSURD! Cut it the fuck out!\"\n\nLike mentioned before in the thread, I'd avoid *snälla* altogether in a professional setting, unless someone is being a prick for no good reason. It's perfectly reasonable to politely ask things like *Kan du snälla sluta trumma på skrivbordet?* (\"Could you please stop drumming on your desk?\") if somebody is in fact doing that and being a nuisance.", "created_utc": "1663408546.0", "edited": "1663408757.0", "id": "ios20dy", "is_submitter": "False", "link_id": "t3_xg8550", "parent_id": "t3_xg8550", "score": "1", "subreddit": "Svenska", "subreddit_id": "t5_2scor"}, {"author": "Kesoburk", "body": "I'm very curious as to how this sweater ended up in Belgium, and why you chose to buy it. Was it just the general vibe? Because I absolutely love it and am a little jealous I don't have one myself!", "created_utc": "1663405777.0", "edited": "False", "id": "ioryhwa", "is_submitter": "False", "link_id": "t3_xg3z4l", "parent_id": "t1_ioqww7k", "score": "5", "subreddit": "sweden", "subreddit_id": "t5_2qofe"}, {"author": "Kesoburk", "body": "You were right unfortunately, but he did find the new blue-pink training gear really cool so I got him a set. Will order the away jersey later online though!", "created_utc": "1662835135.0", "edited": "False", "id": "invysg5", "is_submitter": "True", "link_id": "t3_x9ywx3", "parent_id": "t1_inqxqzk", "score": "2", "subreddit": "Gunners", "subreddit_id": "t5_2qhqt"}, {"author": "Kesoburk", "body": "THANK YOU ALL SO MUCH!!! You’ve saved our trip and my brother’s happiness!!! The stadium tour was a huge success, even I thought it was amazing! I made sure to take him some beautiful pictures, we bought some things in the Armoury and even ran into Charlie George so my brother was chuffed!! We also went to look at the Highbury and had a lovely meal afterwards, and he told me it had been a great day. Thank you all for your tips and recommendations, I owe you all!!", "created_utc": "1662834694.0", "edited": "False", "id": "invxp3r", "is_submitter": "True", "link_id": "t3_x9ywx3", "parent_id": "t3_x9ywx3", "score": "3", "subreddit": "Gunners", "subreddit_id": "t5_2qhqt"}, {"author": "Kesoburk", "body": "Currently awaiting more information, but hopefully refunds aren't out of the question. Even if we'd just get refunded for the football tickets, that'd be enough.", "created_utc": "1662753870.0", "edited": "False", "id": "inrplvb", "is_submitter": "True", "link_id": "t3_x9ywx3", "parent_id": "t1_inrngav", "score": "1", "subreddit": "Gunners", "subreddit_id": "t5_2qhqt"}, {"author": "Kesoburk", "body": "Trösta dig med att jag också tycker synd om dig! Fy fan vilken taskig tajming", "created_utc": "1662753732.0", "edited": "False", "id": "inrp9rg", "is_submitter": "True", "link_id": "t3_x9ywx3", "parent_id": "t1_inrkcw3", "score": "3", "subreddit": "Gunners", "subreddit_id": "t5_2qhqt"}, {"author": "Kesoburk", "body": "That, I won't!", "created_utc": "1662753058.0", "edited": "False", "id": "inrnlp4", "is_submitter": "True", "link_id": "t3_x9ywx3", "parent_id": "t1_inr813p", "score": "3", "subreddit": "Gunners", "subreddit_id": "t5_2qhqt"}, {"author": "Kesoburk", "body": "Unfortunately we all have to be back in Sweden on the 13th, latest, so it isn't really an option... I think I'll take him on the stadium tour thanks to all the warm recommendations in this thread and hope it'll be a nice memory until I can take him on an actual game.", "created_utc": "1662741698.0", "edited": "1662754005.0", "id": "inqv93n", "is_submitter": "True", "link_id": "t3_x9ywx3", "parent_id": "t1_inqqnqv", "score": "89", "subreddit": "Gunners", "subreddit_id": "t5_2qhqt"}, {"author": "Kesoburk", "body": "I think this is what we'll do. He was looking for one of their new Away jerseys as well so I think maybe I'll buy it for him.", "created_utc": "1662741420.0", "edited": "False", "id": "inqujtl", "is_submitter": "True", "link_id": "t3_x9ywx3", "parent_id": "t1_inqqu7l", "score": "61", "subreddit": "Gunners", "subreddit_id": "t5_2qhqt"}, {"author": "Kesoburk", "body": "Of course we'll go again but it sucks when we're also paying for fairly central accommodation, train tickets, food, etc. This game was the whole reason for this trip, and although we'll obviously make do of the situation, it just makes you kind of deflate. It's incredibly frustrating.", "created_utc": "1662740994.0", "edited": "False", "id": "inqtguj", "is_submitter": "True", "link_id": "t3_x9ywx3", "parent_id": "t1_inqngxx", "score": "17", "subreddit": "Gunners", "subreddit_id": "t5_2qhqt"}, {"author": "Kesoburk", "body": "We have to leave on the 12th for university back home, unfortunately. We planned over the weekend specifically for everything to work out and then all this... I think we're officially the unluckiest people alive.", "created_utc": "1662740538.0", "edited": "False", "id": "inqsb1o", "is_submitter": "True", "link_id": "t3_x9ywx3", "parent_id": "t1_inqryyj", "score": "12", "subreddit": "Gunners", "subreddit_id": "t5_2qhqt"}, {"author": "Kesoburk", "body": "Will check, thank you!", "created_utc": "1662739627.0", "edited": "False", "id": "inqq01m", "is_submitter": "True", "link_id": "t3_x9ywx3", "parent_id": "t1_inqn9w5", "score": "81", "subreddit": "Gunners", "subreddit_id": "t5_2qhqt"}, {"author": "Kesoburk", "body": "Om det är något jag lärt mig av mina egna misstag är det att när man är krasslig ska man sitta still, hålla käften och dricka varmt, choklad eller honungste är mina favoriter. Om man får träningssug kan en långsam promenad vara skönt, så länge det inte blåser kallt ute. För mig som alltid fryser har det också hjälpt att bylta på sig en del inomhus så att man blir precis lite för obekvämt varm, så får man svettas lite.", "created_utc": "1662372393.0", "edited": "1662379132.0", "id": "in60yd5", "is_submitter": "False", "link_id": "t3_x6brsx", "parent_id": "t3_x6brsx", "score": "8", "subreddit": "swedishproblems", "subreddit_id": "t5_2vyct"}, {"author": "Kesoburk", "body": "Känns som peak full student-beteende", "created_utc": "1661770474.0", "edited": "False", "id": "im8osoo", "is_submitter": "False", "link_id": "t3_x0jcwt", "parent_id": "t1_im8k1kh", "score": "0", "subreddit": "sweden", "subreddit_id": "t5_2qofe"}, {"author": "Kesoburk", "body": "Fan. Nu vill jag också ha en redig jävla gubbcykel.", "created_utc": "1661723040.0", "edited": "False", "id": "im6hmd8", "is_submitter": "False", "link_id": "t3_wzxt87", "parent_id": "t3_wzxt87", "score": "7", "subreddit": "unket", "subreddit_id": "t5_3hb2y"}, {"author": "Kesoburk", "body": "Många som redan har lämnat bra tips, men vill du inte utesluta kött så ska du köpa rätt kött. Karré är ofta billigt och 1 kg blir efter 4 timmar i ugnen massvis med pulled pork, enkelt och svingott (haha). Samma trick funkar med fransyska.\n\nSvensk fläskytterfilé brukar också ofta vara på extrapris eller finnas på svinnhyllan om din matbutik har en sån, och om man grovputsar denna får man loss en fettkappa med en del kött på. Det putsade köttet kan man tillaga i ugn eller göra gryta på med valfria tillbehör, men fettkappan sparar man i en burk/glaslåda i kylen till dagen därpå. Då hackar man upp den och så följer man valfritt gulasch-recept. Kokar man denna i 1-1,5 timme smälter fettet och du får 0 svinn. Jag och min sambo gör detta varje gång ytterfilé är billigt och får då ut minst 3 portioner av den putsade filén, samt 3-4 portioner gulasch, dvs. köttet kostar typ 15kr/portion.", "created_utc": "1661703915.0", "edited": "1661704383.0", "id": "im579y9", "is_submitter": "False", "link_id": "t3_wzumkj", "parent_id": "t3_wzumkj", "score": "2", "subreddit": "sweden", "subreddit_id": "t5_2qofe"}, {"author": "Kesoburk", "body": "T-centralen_ivl", "created_utc": "1661405165.0", "edited": "False", "id": "ilp4csq", "is_submitter": "False", "link_id": "t3_wwffjx", "parent_id": "t3_wwffjx", "score": "1", "subreddit": "swedishproblems", "subreddit_id": "t5_2vyct"}, {"author": "Kesoburk", "body": "Min kusin blev elektriker efter studenten och jobbade ungefär 1 år innan han insåg att han hatade exakt allt med jobbet. Han slutade och tog lite andra ströjobb innan han hamnade i pluggtankar men var rädd att det skulle ta lång tid, att han skulle få dåliga betyg, tappa motivationen, få sämre lön på nya jobbet efter studierna, osv. Det krävdes egentligen bara att jag påminde om hur jobbet fick honom att må samt objektivt lade fram hans situation framför honom, så förstod han också att valet var ganska givet.\n\nJag misstänker att du känner att jobbet du har är en säkerhet som du gärna vill hålla fast vid, men om du inte trivs på ditt jobb - BYT! Ingen lön är värd din olycka, och du har inte ens särskilt hög lön som det är. Gör något du tycker om, plugga till något du faktiskt kan finna lycka i och sök sedan ett jobb som gör att tillvaron inte känns piss. Kör, kör, kör och stort lycka till!", "created_utc": "1661172147.0", "edited": "False", "id": "ilbbt9q", "is_submitter": "False", "link_id": "t3_wuocro", "parent_id": "t3_wuocro", "score": "1", "subreddit": "swedishproblems", "subreddit_id": "t5_2vyct"}, {"author": "Kesoburk", "body": "Arkivarie kan du lätt plugga upp, krävs endast 60 hp lästa för att få jobba som det och marknaden börjar bli balanserad efter att ha varit ganska svår. Kan t.o.m. läsas på distans!", "created_utc": "1660968186.0", "edited": "False", "id": "il0zlqb", "is_submitter": "False", "link_id": "t3_wsli78", "parent_id": "t1_ikzcgic", "score": "6", "subreddit": "swedishproblems", "subreddit_id": "t5_2vyct"}, {"author": "Kesoburk", "body": "Vilken fin och härlig fredagstråd, du fick mig att känna mig stolt över att jag jobbat idag!", "created_utc": "1660923123.0", "edited": "False", "id": "iky27gn", "is_submitter": "False", "link_id": "t3_wsd6o0", "parent_id": "t3_wsd6o0", "score": "1", "subreddit": "sweden", "subreddit_id": "t5_2qofe"}, {"author": "Kesoburk", "body": "Men Thorbjörn Fälldin då? Han var bokstavligen bara Göran Persson fast snäll, norrlänning och landsbygdsbo, aka han har +3 på GP", "created_utc": "1660922737.0", "edited": "False", "id": "iky17j7", "is_submitter": "False", "link_id": "t3_ws8xqi", "parent_id": "t1_ikx36gq", "score": "2", "subreddit": "sweden", "subreddit_id": "t5_2qofe"}, {"author": "Kesoburk", "body": "Uffe har vader av stål och är säkert spänstig pga fd gymnast, men Johan Pehrson har tidernas dad bod, är lång som fan PLUS han är rolig så vad mer kan man önska sig?", "created_utc": "1660922639.0", "edited": "False", "id": "iky0yhw", "is_submitter": "False", "link_id": "t3_ws8xqi", "parent_id": "t1_ikwvvuo", "score": "1", "subreddit": "sweden", "subreddit_id": "t5_2qofe"}, {"author": "Kesoburk", "body": "Stor eloge att du ändå orkade upp igen varje gång, pannben av stål!", "created_utc": "1660513063.0", "edited": "False", "id": "ikaysiu", "is_submitter": "False", "link_id": "t3_wogtsp", "parent_id": "t1_ikayhi1", "score": "26", "subreddit": "sweden", "subreddit_id": "t5_2qofe"}, {"author": "Kesoburk", "body": "”You okay?”\n”My dick…”\n\nDagens skratt!", "created_utc": "1660512856.0", "edited": "False", "id": "ikayb34", "is_submitter": "False", "link_id": "t3_wogtsp", "parent_id": "t3_wogtsp", "score": "130", "subreddit": "sweden", "subreddit_id": "t5_2qofe"}, {"author": "Kesoburk", "body": "Göteborg bottentext", "created_utc": "1660168665.0", "edited": "False", "id": "ijs0anm", "is_submitter": "False", "link_id": "t3_wkwyt1", "parent_id": "t3_wkwyt1", "score": "3", "subreddit": "sweden", "subreddit_id": "t5_2qofe"}, {"author": "Kesoburk", "body": "Det var det närmaste jag kunde komma på utan att använda officiell fonetik, men du har givetvis rätt. Dumt.", "created_utc": "1660168497.0", "edited": "False", "id": "ijrzvgr", "is_submitter": "False", "link_id": "t3_wl9lce", "parent_id": "t1_ijrz5gw", "score": "17", "subreddit": "Svenska", "subreddit_id": "t5_2scor"}, {"author": "Kesoburk", "body": "Skål! (skouwl)", "created_utc": "1660167733.0", "edited": "1660204606.0", "id": "ijrxxbg", "is_submitter": "False", "link_id": "t3_wl9lce", "parent_id": "t3_wl9lce", "score": "1", "subreddit": "Svenska", "subreddit_id": "t5_2scor"}, {"author": "Kesoburk", "body": "No more Denmark\n\n*Happy Swedish noise*", "created_utc": "1660154710.0", "edited": "False", "id": "ijqz96e", "is_submitter": "False", "link_id": "t3_wkyl3g", "parent_id": "t3_wkyl3g", "score": "2", "subreddit": "MapPorn", "subreddit_id": "t5_2si92"}, {"author": "Kesoburk", "body": "\"Sorts\" i detta sammanhang har ett ***s*** på slutet som signalerar genitiv, ett ägande - det är musik som tillhör en särskild sort. Tänk på det som att \"av\" (\"of\" på engelska) är inbakat i detta ***s*** i \"sort***s***\". Alltså:\n\n\"Vilken sort***s***/slag***s*** musik gillar du?\" --- \"What sort ***of*** music do you like?\"\n\nOm detta ***s*** inte används måste man lägga på \"av\" igen, annars framgår det inte att du pratar om en specifik sak av flera andra saker.\n\n\"Vilken sort/typ ***av*** musik gillar du?\" --- \"What sort/kind ***of*** music do you like?\"\n\nFörlåt om det blev väldigt tekniskt men jag hoppas att detta gör det mer logiskt!", "created_utc": "1660133191.0", "edited": "1660133468.0", "id": "ijpi6ps", "is_submitter": "False", "link_id": "t3_wk93l4", "parent_id": "t1_ijmmfqb", "score": "1", "subreddit": "Svenska", "subreddit_id": "t5_2scor"}, {"author": "Kesoburk", "body": "I don't necessarily find that being able to speak another language fluently is the \"ultimate goal\", even though it can be nice when you're on holiday and whatnot. To me, reading and understanding the language itself and its history and the history tied to the people that speak it was always the biggest appeal. I suppose it's the learning experience that I really like, it's the discovering and exploration and getting to kind of continously keep exploring other cultures and stories through studying a language that's really fulfilling to me.\n\nI'm usually pretty private, but I find that a lot of the people that I tell that I have language learning as a hobby don't seem to understand what could be fun about studying like I do when my goal isn't to become a fluent speaker. Usually I say it just kind of makes me happy, and that's good enough for most people. And I obviously don't tell my friends and family that I speak French or German because frankly I don't and I probably couldn't hold a conversation without stuttering and making a lot of errors, but my understanding of these languages is good enough at this point for me to read and translate most things for them when we're abroad or when it comes up. It's definitely earned me some funny glances (lol) but ultimately it's my time and it's something I really like doing so I'm sticking to it.", "created_utc": "1660131257.0", "edited": "False", "id": "ijpetpu", "is_submitter": "False", "link_id": "t3_wksyqt", "parent_id": "t3_wksyqt", "score": "45", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Kesoburk", "body": "Tror du menar Rålambshovsparken, väldigt populär på sommaren!", "created_utc": "1660071816.0", "edited": "False", "id": "ijm8vaf", "is_submitter": "False", "link_id": "t3_wk93l4", "parent_id": "t1_ijm2a4e", "score": "3", "subreddit": "Svenska", "subreddit_id": "t5_2scor"}, {"author": "Kesoburk", "body": "Välkommen hit! :) \nHar du någon favoritplats i Stockholm? Vad har du för hobbys?", "created_utc": "1660068948.0", "edited": "False", "id": "ijm16fz", "is_submitter": "False", "link_id": "t3_wk93l4", "parent_id": "t3_wk93l4", "score": "4", "subreddit": "Svenska", "subreddit_id": "t5_2scor"}, {"author": "Kesoburk", "body": "Carpenters would be pretty anticlimactic. Just a couple building some furniture on stage.", "created_utc": "1659999123.0", "edited": "False", "id": "iji6umi", "is_submitter": "False", "link_id": "t3_wjbb67", "parent_id": "t3_wjbb67", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "Kesoburk", "body": "Brukar inte spela jättemycket med min sambo eftersom jag helst spelar PC och han kör konsol, plus att jag spelar mycket mer och mer varierat än vad han gör. Är för tävlingsinriktad för att klara av CS/OW men honom när han knappt har spelat en shooter i sitt liv, och tvärtom om vi lirar FIFA/NHL får jag alltid stryk pga 0 intresse av sportspel. Då får vi lite samma problem där vi hamnar på för olika nivåer. För oss funkar det att byta spel, typ när Among Us var en grej spelade vi väldigt mycket med några vänner för att tröskeln var låg. \n\nTesta lite olika building games eller typ lite tetrisvarianter, pusselspel osv. Spel med låg tröskel och lågt tak helt enkelt. Det är såklart svårt om ens sambo inte har någon spelerfarenhet alls, men med kommunikation, tålamod och lite tid att lista ut vad ni faktiskt båda tycker är kul tror jag att ni ändå kan få ut något av att spela tillsammans. Sen funkar det inte så funkar det inte, man kan göra massor av andra saker tillsammans! \n\nDet viktigaste är att hon inte känner sig värdelös eller att hon ”drar ner”. När jag var yngre och spelade spel med min lillebror lärde jag mig att bara fortsätta trots att han dog hela tiden, för då undvek man liksom dålig stämning. Förutsätter ju spel där ena partens död inte är = instadeath, men vi hittade några sådana spel och det sparade oss väldigt mycket gräl i alla fall haha", "created_utc": "1659912759.0", "edited": "1659913499.0", "id": "ijdcsxk", "is_submitter": "False", "link_id": "t3_wip7g6", "parent_id": "t3_wip7g6", "score": "2", "subreddit": "sweden", "subreddit_id": "t5_2qofe"}, {"author": "Kesoburk", "body": "Det gör mig genuint ledsen att du verkar ha träffat flera kvinnor som inte förstår att detta är ett av de vanligaste osäkerhetsområdena för män i vår tid, och som medvetet eller omedvetet fick dig att må dåligt. Den tröst jag kan erbjuda är att om en kvinna på fullaste allvar tycker att håret är en dealbreaker ska du vara glad att du duckat en kula av rang. Få vill nog i längden leva med någon som dömer en för något man inte rår för, det känns i alla fall inte som någon jag är villig att spendera resten av mitt liv med. Mig veterligen finns det också många kvinnor som tycker att män i flint är sexiga, så där har vi olika bilder av hur läget ser ut.\n\nHåravfall är mänskligt, och du är långt ifrån ensam. Skadat självförtroende/självbild är också mänskligt, och liksom där är du långt ifrån ensam. Men livet blir så fruktansvärt trist om man ska skämmas för saker man inte rår för, och i min vetskap är det då man blir som mest sårbar för avskum till människor som försöker sälja på en massa skit som inte hjälper. Jag tror inte att någon är till freds med varje del av sig själva, jag vet att jag definitivt inte är det, men man får försöka se det för vad det är - mänskligt.\n\nJag skickar med dig detta: 100% av alla tunnhåriga män som jag sett och känner som valt att raka av håret klär svinbra i det. Visst, de är inte 20 och unga längre, men det är inte det som är poängen. De ser fräschare och friskare ut, och allt som oftast får de i längden också bättre självförtroende och både blir och ser lyckligare ut när de väljer att raka sig och acceptera det för vad det är. Det blir som vilken frisyr som helst, tufft, coolt, sofistikerat, you name it. Vissa kör med skägg, stubb, ingetdera, testa dig fram! Poängen är att det inte är en naturgiven sanning att du inte tycker om hur det ser ut nu, man kan lära sig att inse att man har fel och att man faktiskt ser helt okej ut. Alla ska vi bli äldre, och man kan lära sig att förstå hur man åldras med grace. Man kommer ha många riktigt jävla dyngpissiga dagar när man mår skit och så har man några ok dagar, men sen börjar man inse att man också kan ha många riktigt jävla bra dagar också.\n\nMänniskor och kroppar förändras med tiden, män som kvinnor. Man kan bli av med håret, få ärr och rynkor, man kan föda barn, tvingas göra en operation, mista kroppsdelar, allt kan hända. Det är naturligt, det är ett tecken på att vi inte är odödliga. Det är inte ditt fel och det är oftast heller inget du rår för, så varför låta det styra över ditt liv och din hälsa? Livet är verkligen så mycket mer, även om det kanske inte känns så nu. Vad som har varit har varit, du är bara 30 och vi lever generellt sett långa liv. Äg ditt utseende, även om det inte alls går vissa dagar så är det viktiga att det går i längden, och då kommer du också få den där \"är det *såhär* det känns?\"-känslan och den är väl värd att kämpa för. Är du en sund och trevlig person kommer ingen som är värd din tid låta din mängd av hår på huvudet påverka er relation, och personen kommer inte få dig att må dåligt över det heller. Du förtjänar också att må bra -  glöm inte det!", "created_utc": "1659906996.0", "edited": "1659911052.0", "id": "ijcz1z9", "is_submitter": "False", "link_id": "t3_wijdw7", "parent_id": "t3_wijdw7", "score": "9", "subreddit": "sweden", "subreddit_id": "t5_2qofe"}, {"author": "Kesoburk", "body": "Blev hård", "created_utc": "1659869280.0", "edited": "False", "id": "ijaoxh8", "is_submitter": "False", "link_id": "t3_wicjmm", "parent_id": "t3_wicjmm", "score": "29", "subreddit": "sweden", "subreddit_id": "t5_2qofe"}, {"author": "Kesoburk", "body": "Det är del av charmen, då smakar det 10 ggr godare för att man vet att man plockat själv!", "created_utc": "1659857933.0", "edited": "False", "id": "ijabave", "is_submitter": "False", "link_id": "t3_whvtmu", "parent_id": "t1_ija8ban", "score": "3", "subreddit": "sweden", "subreddit_id": "t5_2qofe"}, {"author": "Kesoburk", "body": "Men asså fatta att vi bor i ett land där det är helt okej för vilken svensson som helst att gå ut i skogen och bara plocka på sig mat? Visserligen förbjudet att plocka nötter, men man får alltså ta smultron, vildhallon, ramslök, blåbär, lingon, hjortron, svamp, osv. Vilket jävla privilegium är inte det ändå? Älskar sensommar/höst av just den anledningen, kan äntligen fylla upp frysen med bär och svamp som räcker året runt, samt äppelbitar och -mos från äppelträdet i min mammas trädgård. Leve bärplocket!", "created_utc": "1659820219.0", "edited": "False", "id": "ij8dhf2", "is_submitter": "False", "link_id": "t3_whvtmu", "parent_id": "t3_whvtmu", "score": "84", "subreddit": "sweden", "subreddit_id": "t5_2qofe"}, {"author": "Kesoburk", "body": "Har de fyra olika?? Jävla röra till land det måste vara?", "created_utc": "1659817348.0", "edited": "False", "id": "ij871hr", "is_submitter": "False", "link_id": "t3_whncvq", "parent_id": "t1_ij86tk6", "score": "2", "subreddit": "europe", "subreddit_id": "t5_2qh4j"}, {"author": "Kesoburk", "body": "I'm a notorious time pessimist and will rather be way too early than a little too late, but I think most Swedes would agree with me that you should be as punctual as possible. It kinda depends on what situation you're in, for example I think it's perfectly reasonable to be 20 minutes early to a doctor's appointment but it's kinda rude to arrive 20 minutes early to someone else's house for dinner.\n\nIn the dinner situation, I personally would say there's like a 10 minute window either way where you can be 10 minutes early or 10 minutes late and I'd consider it punctual. Then again, I don't think that limit is very harsh in Sweden and that it's more about your attitude - if you message me and tell me you'll be a little early or a little late, I'd be okay with either or.", "created_utc": "1659808719.0", "edited": "1659817037.0", "id": "ij7n569", "is_submitter": "False", "link_id": "t3_whtk2t", "parent_id": "t3_whtk2t", "score": "323", "subreddit": "AskEurope", "subreddit_id": "t5_2uayg"}, {"author": "Kesoburk", "body": "This is what I mean though, it’s obviously a big thing but maybe not the most pressing or most prioritized in these countries at this very hour, either way it’s going to take time", "created_utc": "1659807545.0", "edited": "False", "id": "ij7kcf9", "is_submitter": "False", "link_id": "t3_whncvq", "parent_id": "t1_ij7jfj9", "score": "6", "subreddit": "europe", "subreddit_id": "t5_2qh4j"}, {"author": "Kesoburk", "body": "Ryssfylla, pundhuvud och ståfräs tycker jag är skojiga ord", "created_utc": "1659807386.0", "edited": "False", "id": "ij7jyg4", "is_submitter": "False", "link_id": "t3_whp82s", "parent_id": "t3_whp82s", "score": "2", "subreddit": "sweden", "subreddit_id": "t5_2qofe"}, {"author": "Kesoburk", "body": "I can't find it in me to really blame those that haven't gotten around to deciding on it yet because of summer holidays, even if maybe I would've expected Czechia and Slovakia to be quicker, but still. I get Hungary because, well, Orban, and Erdogan is just being a massive cunt about this whole thing while cozying up to Putin like the disgusting human being that he is. But really, my biggest question is wtf is going on in Belgium?", "created_utc": "1659803500.0", "edited": "1659807437.0", "id": "ij7amim", "is_submitter": "False", "link_id": "t3_whncvq", "parent_id": "t3_whncvq", "score": "38", "subreddit": "europe", "subreddit_id": "t5_2qh4j"}, {"author": "Kesoburk", "body": "Svenskar som ponerar och diskuterar skillnaden på en fika och ett fika - tror jag just hittade den svenskaste tråden på hela reddit", "created_utc": "1659801789.0", "edited": "False", "id": "ij76jqa", "is_submitter": "False", "link_id": "t3_whpsrm", "parent_id": "t3_whpsrm", "score": "389", "subreddit": "sweden", "subreddit_id": "t5_2qofe"}, {"author": "Kesoburk", "body": "Had a total wtf moment when I was vacationing in Southern Europe once as a kid and my parents decided to teach me some German words to get around since the English comprehension of the native population at the time was pretty shit and they apparently had a lot of German tourists. I learned some simple things like colors, saying thank you, introducing myself, and other helpful stuff that was pretty similar to my native Swedish.\n\nLater, I end up getting ice cream at this little bar on the beach and the guy doesn't speak English, so I resort to German which he understands. Kid behind me in the line hears me and in German is like, \"Are you German?\" I tell him I only speak a little and he switches to English, and we proceed to hang out and like play on the beach for a bit. Then after an hour or something, his parents come over and they're like \"okay, time to go, we're going to get lunch\", except it's in *crystal clear Norwegian*. My brain completely broke and in Swedish, I just go, \"You're Norwegian?\" and he stares at me like I'm some kind of alien and goes back, \"YOU'RE SWEDISH?\" His parents just kind of laughed and probably had no idea wtf was going on, we ended up hanging out some during the rest of the week just speaking our native languages lol", "created_utc": "1659798684.0", "edited": "1666042503.0", "id": "ij6z73p", "is_submitter": "False", "link_id": "t3_whlljb", "parent_id": "t3_whlljb", "score": "85", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Kesoburk", "body": "Oh yeah I forgot! It’s like “Scurry on/wards”", "created_utc": "1659774110.0", "edited": "1659800010.0", "id": "ij5vzzt", "is_submitter": "False", "link_id": "t3_wh55e1", "parent_id": "t1_ij51a3j", "score": "2", "subreddit": "AskEurope", "subreddit_id": "t5_2uayg"}, {"author": "Kesoburk", "body": "”Stupa” = To fall or tumble down (to the ground), normally associated with dying on the battlefield.\n\n”Kasta in handduken” = Throwing in the towel, also synonymous with giving up.\n\n”Trilla av pinn” = To fall off the stick/perch\n\n”Bita i gräset” = Bite the grass\n\n”Kola vippen” (or simply ”kola”) = I literally couldn’t think of a translation for this, but after looking it up I found out ”kola” derives from the Finnish ”kuolla” (dying). ”Vippen” refers to the edge or the brink of something, so I suppose the most accurate translation would be ”dying just barely” or ”dying (by falling just over the edge)”.", "created_utc": "1659741060.0", "edited": "False", "id": "ij4abus", "is_submitter": "False", "link_id": "t3_wh55e1", "parent_id": "t3_wh55e1", "score": "23", "subreddit": "AskEurope", "subreddit_id": "t5_2uayg"}, {"author": "Kesoburk", "body": "Token Black & the Machine Gun Kellys", "created_utc": "1659739884.0", "edited": "False", "id": "ij47qqp", "is_submitter": "False", "link_id": "t3_wh2woc", "parent_id": "t3_wh2woc", "score": "1", "subreddit": "ToiletPaperUSA", "subreddit_id": "t5_3pccn"}, {"author": "Kesoburk", "body": "I agree", "created_utc": "1659725354.0", "edited": "False", "id": "ij37quy", "is_submitter": "False", "link_id": "t3_wgwj2d", "parent_id": "t1_ij33r13", "score": "2", "subreddit": "Svenska", "subreddit_id": "t5_2scor"}, {"author": "Kesoburk", "body": "Är hälften så gammal och tycker visserligen att det låter fel, men det känns som en mening hämtad direkt från talspråk. Jag tänker mig att det finns en slags paus efter \"att\" och att meningen är ämnad att läsas:\n\nMen de måste ju så småningom inse att, \"Det kan inte forsätta (såhär)\".\n\nDå låter det i alla fall för mig betydligt mer logiskt och rätt.", "created_utc": "1659714825.0", "edited": "False", "id": "ij2g946", "is_submitter": "False", "link_id": "t3_wb0675", "parent_id": "t1_ii5gj3t", "score": "2", "subreddit": "Svenska", "subreddit_id": "t5_2scor"}, {"author": "Kesoburk", "body": "I think you can definitely say \"Hur **inverkar** detta **på** ert beslut?\" because the meaning is retained (= How does this affect your decision?), but yeah, it sounds stranger to me than just using påverkar.", "created_utc": "1659713854.0", "edited": "False", "id": "ij2dq7k", "is_submitter": "False", "link_id": "t3_wgwj2d", "parent_id": "t1_ij2bcdb", "score": "1", "subreddit": "Svenska", "subreddit_id": "t5_2scor"}, {"author": "Kesoburk", "body": "Att någonting fattas är som du sa en slags passiv böjning, vilket innebär att verbet inte är knutet till objektet \"Jag\", utan till subjektet \"Dig\". Kastar man om ordningen blir det logiskt:\n\n\"Jag saknar dig\" = \"Du fattas mig\"", "created_utc": "1659713621.0", "edited": "False", "id": "ij2d4qq", "is_submitter": "False", "link_id": "t3_wfwwrl", "parent_id": "t1_ij17yh1", "score": "1", "subreddit": "Svenska", "subreddit_id": "t5_2scor"}, {"author": "Kesoburk", "body": "Som någon sa innan känns sakna som mer emotionellt inriktat medan fattas är mer funktionellt. Som huvudregel kan man kanske säga att \"fattas\" används när det finns ett syfte som ska uppnås, t.ex. \"det fattas en skruv (och utan den kan jag inte laga vad det nu är som är trasigt)\", och att \"saknas\" används för att uttrycka en känsla, t.ex. sorg, frustration för att man tappat bort något eller helt enkelt som ett anspelande på \"fattas\".\n\nDet finns ju definitivt fall där man kan säga båda, t.ex. \"Det saknas/fattas en pusselbit\", i båda fallen är pusselbiten borta. Jag har också hört frasen \"Du fattas oss\" användas i samband med när någon har avlidit, vilket då är ett uttryck för emotionell saknad, så jag vet inte om det finns någon egentlig regel.", "created_utc": "1659713199.0", "edited": "1659713512.0", "id": "ij2c1oy", "is_submitter": "False", "link_id": "t3_wfwwrl", "parent_id": "t3_wfwwrl", "score": "1", "subreddit": "Svenska", "subreddit_id": "t5_2scor"}, {"author": "Kesoburk", "body": "In my head, they are very similar and I'd be comfortable using them synonymously, both in their noun and verb forms. They both signal that X is in some way affecting Y or possibly changing the outcome of Y:\n\n\\- \"Vilken **inverkan** kommer detta att få **på** den internationella marknaden?\" *(What effect will this have on the international market?)*\n\n\\- \"Hur **påverkar** detta ert beslut?\" *(How does this affect your decision?)*\n\nLooking in a bunch of Swedish dictionaries, the definitions would lead me to believe that you can basically use them interchangeably, since *påverka/n* references *inverka/n*:\n\n\\- *Inverka* (v): to affect, change, influence\n\n\\- *Inverkan* (n): continuous effect, usually in the shape of different changes\n\n\\- *Påverka* (v): to (*inverka*)\n\n\\- *Påverkan* (n): continuous (*inverkan*)\n\nIn daily speech and in Swedish society at large, I'd say påverkan is more common - it's what I use and what I hear most of, but yeah, feel free to use both!\n\nEdit: Remember:\n\n\\- *Inverkan* (n) and *påverkan* (n) are followed by **på** since they signal an effect \"**onto**\" something (and it sounds weird otherwise) ---> *Inverkan* ***på*** *X* = Effect **onto** X\n\n\\- *Inverka* (v) must also be followed by **på** (same reason as above) ---> *Inverka på* X = Affect (**onto**) X\n\n\\- *Påverka* (v) should **not** be followed by på, the effect \"on\" something is conveyed through the word.", "created_utc": "1659711988.0", "edited": "1659712991.0", "id": "ij28yzo", "is_submitter": "False", "link_id": "t3_wgwj2d", "parent_id": "t3_wgwj2d", "score": "10", "subreddit": "Svenska", "subreddit_id": "t5_2scor"}, {"author": "Kesoburk", "body": "Is it Jonah??", "created_utc": "1659446198.0", "edited": "False", "id": "iin0uk0", "is_submitter": "False", "link_id": "t3_we8fu3", "parent_id": "t1_iimnpuy", "score": "1", "subreddit": "memes", "subreddit_id": "t5_2qjpg"}, {"author": "Kesoburk", "body": "Compact SUV eller Crossover (CUV) hade jag nog sagt", "created_utc": "1659444735.0", "edited": "False", "id": "iimxswo", "is_submitter": "False", "link_id": "t3_we4fxf", "parent_id": "t1_iimnjeb", "score": "3", "subreddit": "sweden", "subreddit_id": "t5_2qofe"}, {"author": "Kesoburk", "body": "Tyckte också det såg väldigt mycket ut som någon monterat en Saab-front (95a?) på en Volvo-kaross, och det var precis som du säger C30 jag tänkte på.", "created_utc": "1659444545.0", "edited": "1659444835.0", "id": "iimxers", "is_submitter": "False", "link_id": "t3_we4fxf", "parent_id": "t1_iimesfs", "score": "1", "subreddit": "sweden", "subreddit_id": "t5_2qofe"}, {"author": "Kesoburk", "body": "Men det är ju mitt favoritprogram!!", "created_utc": "1659442723.0", "edited": "False", "id": "iimtxdn", "is_submitter": "True", "link_id": "t3_wdit11", "parent_id": "t1_iimro1y", "score": "1", "subreddit": "swedishproblems", "subreddit_id": "t5_2vyct"}, {"author": "Kesoburk", "body": "Är kvinna och 173 cm lång så jag är typ i 90e percentilen men likväl tycker jag också alltid att jag bara ser folk som är längre än mig när jag är ute och går på stan. Majoriteten av mina vänner, kvinnor som män, är också längre än mig så jag lyckas också alltid känna mig liten på något jävla vänster. Sen är det ju motsatta idealet för kvinnor, att man ska vara liten och nätt, så de gånger jag faktiskt är bland de längsta kvinnorna i rummet känner jag mig typ sjukt klumpig och malplacerad, brukar t.o.m. märka att jag typ omedvetet sjunker ihop för att hamna närmare andras ögonhöjd och måste komma ihåg att sträcka på mig. Detta blir såklart 100 ggr värre när man blir 180 i klackar.\n\nDet bästa är väl att helt enkelt acceptera att det är som det är, det är ju svårt att bli längre och om andra lägger en värdering i att du råkar vara kortare än snittet är det ju bortom efterblivet. Eller så kan du flytta ner till Medelhavet eller till Amerikat, aldrig känt folk stirra så mycket men aldrig känt mig så lång som där.", "created_utc": "1659363224.0", "edited": "1659363576.0", "id": "iiicqm6", "is_submitter": "False", "link_id": "t3_wb9ldd", "parent_id": "t3_wb9ldd", "score": "3", "subreddit": "swedishproblems", "subreddit_id": "t5_2vyct"}, {"author": "Kesoburk", "body": "Grew up with my mum enforcing British spelling and words and naturally adopted a London/RP accent. Made friends with an Australian girl two years ago, now my brain can’t stop going Aussie mode and my mum cringes anytime I speak English.", "created_utc": "1659299502.0", "edited": "False", "id": "iifaxxa", "is_submitter": "False", "link_id": "t3_wcvdk9", "parent_id": "t1_iif0r7q", "score": "24", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Kesoburk", "body": "Very true!", "created_utc": "1657787030.0", "edited": "False", "id": "ig3q46c", "is_submitter": "False", "link_id": "t3_vy0lss", "parent_id": "t1_ig1iig1", "score": "1", "subreddit": "AskEurope", "subreddit_id": "t5_2uayg"}, {"author": "Kesoburk", "body": "Some favorites of mine: \n\n”Tunga” means either tongue or that multiple things are heavy\n\n”Munk” refers to either a religious monk or a donut\n\n”Ända” means end or signals something coming to an end, but it also means butt/ass", "created_utc": "1657740651.0", "edited": "False", "id": "ig1589v", "is_submitter": "False", "link_id": "t3_vy0lss", "parent_id": "t1_ifz8u2v", "score": "14", "subreddit": "AskEurope", "subreddit_id": "t5_2uayg"}, {"author": "Kesoburk", "body": "Haha no, we’re in the EU", "created_utc": "1657342510.0", "edited": "False", "id": "ifft52i", "is_submitter": "True", "link_id": "t3_vuefky", "parent_id": "t1_iffot4f", "score": "4", "subreddit": "Austria", "subreddit_id": "t5_2qo9i"}, {"author": "Kesoburk", "body": "Yeah exactly, I don’t think it’s too farfetched to think construction companies ignore the windows and install old “regular” windows instead of these because the standards for everything else is so high, hence it costs a lot of money to build", "created_utc": "1657311428.0", "edited": "False", "id": "ife095x", "is_submitter": "True", "link_id": "t3_vuefky", "parent_id": "t1_ifdzfzz", "score": "1", "subreddit": "Austria", "subreddit_id": "t5_2qo9i"}, {"author": "Kesoburk", "body": "<3", "created_utc": "1657310443.0", "edited": "False", "id": "ifdxu4j", "is_submitter": "True", "link_id": "t3_vuefky", "parent_id": "t1_ifd9rck", "score": "6", "subreddit": "Austria", "subreddit_id": "t5_2qo9i"}, {"author": "Kesoburk", "body": "Where did you get this footage of me", "created_utc": "1657310357.0", "edited": "False", "id": "ifdxmei", "is_submitter": "True", "link_id": "t3_vuefky", "parent_id": "t1_ifdnlbn", "score": "16", "subreddit": "Austria", "subreddit_id": "t5_2qo9i"}, {"author": "Kesoburk", "body": "I was honestly awestruck, made a post about it and then I find out everybody here thinks this is completely normal. It’s so wacky but I think it’s so fun and wonderful how some things are so different when I’m not even that far from home!", "created_utc": "1657306791.0", "edited": "False", "id": "ifdotkn", "is_submitter": "True", "link_id": "t3_vuefky", "parent_id": "t1_ifdo9pz", "score": "4", "subreddit": "Austria", "subreddit_id": "t5_2qo9i"}, {"author": "Kesoburk", "body": "I think they’re definitely not as common. It’s also entirely possible that I just never tried opening a window like this because I had no reason to believe they should be able to open like this haha", "created_utc": "1657306369.0", "edited": "False", "id": "ifdnrsr", "is_submitter": "True", "link_id": "t3_vuefky", "parent_id": "t1_ifdmnie", "score": "3", "subreddit": "Austria", "subreddit_id": "t5_2qo9i"}, {"author": "Kesoburk", "body": "The windows I’ve seen at home only open either vertically (what I would call “normal”) but some more modern windows open horizontally, which looks like the window on the picture but the bottom goes outside too. I’ve never seen a window do both though.", "created_utc": "1657306136.0", "edited": "False", "id": "ifdn6kj", "is_submitter": "True", "link_id": "t3_vuefky", "parent_id": "t1_ifddp6i", "score": "4", "subreddit": "Austria", "subreddit_id": "t5_2qo9i"}, {"author": "Kesoburk", "body": "Nej nu jävlar", "created_utc": "1657305762.0", "edited": "False", "id": "ifdm99o", "is_submitter": "True", "link_id": "t3_vuefky", "parent_id": "t1_ifdie2l", "score": "5", "subreddit": "Austria", "subreddit_id": "t5_2qo9i"}, {"author": "Kesoburk", "body": "But it is! You can pick and choose depending on the weather, and in the mode on the picture you get just enough fresh crisp air without having to deal with rain. It’s brilliant!", "created_utc": "1657302282.0", "edited": "False", "id": "ifddgui", "is_submitter": "True", "link_id": "t3_vuefky", "parent_id": "t1_ifdboq1", "score": "8", "subreddit": "Austria", "subreddit_id": "t5_2qo9i"}, {"author": "Kesoburk", "body": "Sweden!", "created_utc": "1657302131.0", "edited": "False", "id": "ifdd2sg", "is_submitter": "True", "link_id": "t3_vuefky", "parent_id": "t1_ifdbcgx", "score": "3", "subreddit": "Austria", "subreddit_id": "t5_2qo9i"}, {"author": "Kesoburk", "body": "I’m from Sweden, never seen them. I don’t know if it could be because we have high construction standards and therefore skimp on windows or what but I’ve never had or seen these. Hopefully they become more common!", "created_utc": "1657302109.0", "edited": "False", "id": "ifdd0t8", "is_submitter": "True", "link_id": "t3_vuefky", "parent_id": "t1_ifd8ui8", "score": "6", "subreddit": "Austria", "subreddit_id": "t5_2qo9i"}, {"author": "Kesoburk", "body": "It’s obviously the best one, but I never even knew these windows existed before I came to Austria. Even when I lived in a new (2018) building in Sweden, we didn’t have these windows!", "created_utc": "1657301986.0", "edited": "False", "id": "ifdcpif", "is_submitter": "True", "link_id": "t3_vuefky", "parent_id": "t1_ifd8h8a", "score": "57", "subreddit": "Austria", "subreddit_id": "t5_2qo9i"}, {"author": "Kesoburk", "body": "Somebody mentioned they had seen some in Norway, but in Sweden I’ve never seen these, not even in newer buildings", "created_utc": "1657301236.0", "edited": "False", "id": "ifdasuu", "is_submitter": "True", "link_id": "t3_vuefky", "parent_id": "t1_ifd8gfn", "score": "16", "subreddit": "Austria", "subreddit_id": "t5_2qo9i"}, {"author": "Kesoburk", "body": "Oh man, I don’t even have that ‘cause my balcony doors back home are literally from 1971 lmao", "created_utc": "1657299923.0", "edited": "False", "id": "ifd7ep1", "is_submitter": "True", "link_id": "t3_vuefky", "parent_id": "t1_ifd78hb", "score": "6", "subreddit": "Austria", "subreddit_id": "t5_2qo9i"}, {"author": "Kesoburk", "body": "Never seen it in Sweden, you pretty much have one or the other. Imagine my shock accidentally pushing the handle a little too far up and thinking I’d just broken the entire window", "created_utc": "1657299387.0", "edited": "False", "id": "ifd60p9", "is_submitter": "True", "link_id": "t3_vuefky", "parent_id": "t1_ifd5oq5", "score": "14", "subreddit": "Austria", "subreddit_id": "t5_2qo9i"}, {"author": "Kesoburk", "body": "I am completely 100% genuinely serious, I’m from Sweden and have never seen anything like it", "created_utc": "1657299186.0", "edited": "False", "id": "ifd5hqe", "is_submitter": "True", "link_id": "t3_vuefky", "parent_id": "t1_ifd4z48", "score": "30", "subreddit": "Austria", "subreddit_id": "t5_2qo9i"}, {"author": "Kesoburk", "body": "No and CLEARLY I’ve been missing out!", "created_utc": "1657299102.0", "edited": "False", "id": "ifd59u6", "is_submitter": "True", "link_id": "t3_vuefky", "parent_id": "t1_ifd52zb", "score": "6", "subreddit": "Austria", "subreddit_id": "t5_2qo9i"}, {"author": "Kesoburk", "body": "Wait, for real?", "created_utc": "1657298767.0", "edited": "False", "id": "ifd4dzv", "is_submitter": "True", "link_id": "t3_vuefky", "parent_id": "t1_ifd3zbn", "score": "78", "subreddit": "Austria", "subreddit_id": "t5_2qo9i"}, {"author": "Kesoburk", "body": "Haha thank you!", "created_utc": "1657298014.0", "edited": "False", "id": "ifd2es8", "is_submitter": "True", "link_id": "t3_vuefky", "parent_id": "t1_ifd23cy", "score": "25", "subreddit": "Austria", "subreddit_id": "t5_2qo9i"}, {"author": "Kesoburk", "body": "Never seen windows able to both open normally and tilting like this. I’m baffled", "created_utc": "1657297879.0", "edited": "False", "id": "ifd229k", "is_submitter": "True", "link_id": "t3_vuefky", "parent_id": "t1_ifd0vst", "score": "16", "subreddit": "Austria", "subreddit_id": "t5_2qo9i"}, {"author": "Kesoburk", "body": "I’ve only ever seen windows open either horizontally or vertically in Sweden, never both. I realize it sounds super silly haha, but it just really took me by surprise!", "created_utc": "1657297709.0", "edited": "False", "id": "ifd1m5d", "is_submitter": "True", "link_id": "t3_vuefky", "parent_id": "t1_ifd15e2", "score": "49", "subreddit": "Austria", "subreddit_id": "t5_2qo9i"}, {"author": "Kesoburk", "body": "I’ve never seen a window open both horizontally and vertically before! It’s genius!", "created_utc": "1657297628.0", "edited": "False", "id": "ifd1eeh", "is_submitter": "True", "link_id": "t3_vuefky", "parent_id": "t1_ifd0wjf", "score": "139", "subreddit": "Austria", "subreddit_id": "t5_2qo9i"}, {"author": "Kesoburk", "body": "Northern Europe…", "created_utc": "1657297317.0", "edited": "False", "id": "ifd0kdn", "is_submitter": "True", "link_id": "t3_vuefky", "parent_id": "t1_ifd0gpu", "score": "59", "subreddit": "Austria", "subreddit_id": "t5_2qo9i"}, {"author": "Kesoburk", "body": "Just browsing through these pictures, the moment I got to page 3 I felt like those earthy tones and the green just 100% fit you, they harmonize so well with your face and hair I think. To me you look warm and low-contrast, although the bright red is gorgeous on you I feel like you kind of drown and wash away in some of the other bright colors, especially very cool ones. I would think you're True Autumn or Soft Autumn!", "created_utc": "1657290409.0", "edited": "False", "id": "ifcivku", "is_submitter": "False", "link_id": "t3_vu1nuc", "parent_id": "t3_vu1nuc", "score": "2", "subreddit": "coloranalysis", "subreddit_id": "t5_35s40"}, {"author": "Kesoburk", "body": "How well-sung are Säkkijärven and Ievan Polkka? From what I gather those are the most recognized by young people, at least in Sweden, but I think internationally as well (albeit as a kind of niche meme).", "created_utc": "1655243722.0", "edited": "1655244005.0", "id": "icdrpea", "is_submitter": "False", "link_id": "t3_vc63zn", "parent_id": "t1_icd94fb", "score": "2", "subreddit": "AskEurope", "subreddit_id": "t5_2uayg"}, {"author": "Kesoburk", "body": "First ones that come to mind would be summer hits like [Sommaren är kort](https://youtu.be/TU3ivk-s-RM) and [Sommartider](https://youtu.be/4kVRF0hTeyQ). Although they’re usually only played in the summer, you can bet everyone knows them whether they like it or not. We also have [Sol, vind och vatten](https://youtu.be/nqjJWzqvVPs) which I think every single person in Sweden has sung or been forced to sing at least once in their life, however it is a very beautiful song.\n\n[Stad i ljus](https://youtu.be/GO9VUhn1TXk) does a great job transcending ages and is very widely known. Most under 40 will definitely have heard it play as the last song when they’re closing the bar.\n\nI think also ever since the World Cup in ’94, a strong contender would be [När vi gräver guld i USA](https://youtu.be/wOuKVk4yjW0), since these days you hear it every now and then and everyone always joins in.\n\nEdit: Adding [Hej Monika](https://youtu.be/KZUnOHcLN0k) because how could I forget?", "created_utc": "1655242315.0", "edited": "1655243450.0", "id": "icdomsw", "is_submitter": "False", "link_id": "t3_vc63zn", "parent_id": "t3_vc63zn", "score": "8", "subreddit": "AskEurope", "subreddit_id": "t5_2uayg"}, {"author": "Kesoburk", "body": "Kan inte beskriva med ord hur nostalgiskt lycklig jag blev av att se det här! Ligger på min gamla bakgård där jag hade första lägenheten. Fantastiskt hantverk!", "created_utc": "1653942365.0", "edited": "False", "id": "ial1ho5", "is_submitter": "False", "link_id": "t3_v0x657", "parent_id": "t3_v0x657", "score": "1", "subreddit": "sweden", "subreddit_id": "t5_2qofe"}, {"author": "Kesoburk", "body": "Nikolaj Coster-Waldau could pull this off on the screen", "created_utc": "1653557820.0", "edited": "False", "id": "ia1nu6r", "is_submitter": "False", "link_id": "t3_l7rxaz", "parent_id": "t3_l7rxaz", "score": "1", "subreddit": "reddeadredemption", "subreddit_id": "t5_2rn7o"}, {"author": "Kesoburk", "body": "Put the Netherlands underwater", "created_utc": "1653508941.0", "edited": "False", "id": "i9z7yv5", "is_submitter": "False", "link_id": "t3_uxnezq", "parent_id": "t3_uxnezq", "score": "2", "subreddit": "Maps", "subreddit_id": "t5_2qiwh"}, {"author": "Kesoburk", "body": "The comedic timing with the first guy is genius, he literally stomps in and openhandedly slaps the shit out of him, then proceeds to just *leave*", "created_utc": "1653407277.0", "edited": "False", "id": "i9ti84m", "is_submitter": "False", "link_id": "t3_uwdvz4", "parent_id": "t3_uwdvz4", "score": "5", "subreddit": "reddeadredemption", "subreddit_id": "t5_2rn7o"}, {"author": "Kesoburk", "body": "“I tre veckor” = For/during three weeks\n\n“Under tre veckor” has the same meaning, but “under” normally isn’t used in this context so it sounds a little odd when said.\n\n“Tre veckor” is the most natural and everyday way of saying “(I’m staying) for three weeks”, the “i” is simply omitted but the sentence has the exact same meaning.", "created_utc": "1652911408.0", "edited": "False", "id": "i94mzs6", "is_submitter": "False", "link_id": "t3_usmz1q", "parent_id": "t3_usmz1q", "score": "11", "subreddit": "Svenska", "subreddit_id": "t5_2scor"}, {"author": "Kesoburk", "body": "Var på väg hem på tunnelbanan i somras när jag råkade hamna i sittgruppen bredvid tre unga killar från Danderyd, något de poängterade med både dialekt och samtalsämne. De ojade sig nämligen över att de skulle festa hemma hos en av dem i Stocksund i helgen, men att de först behövde åka till Bolaget i Mörby och införskaffa festvirket. Problemet som gav upphov till het diskussion var sedan hur man skulle transportera fyra plattor bärs från Mörby centrum till villan ute i Stocksund, eftersom farsans bil var parkerad hemma och det var ”ett jävla liv” att gå de 30+ minutrarna dit (varför man inte kunde ta bussen framgick ej).\n\nEfter att killarna hade vänt och vridit på detta dilemma under cirka 10 minuters färd uppstod en uppgiven tystnad och någon enstaka lite halvdeppig kommentar. Till slut utbrister en av killarna, på släpig stockholmska: \n\n”FAAN killar! Varför är det alltid såhär? Ni ser ju bara problem, inga lösningar! Skärpning nu!”\n\nFick vända mig bort i skratt och gick av kort därefter, men har alltid undrat om killarna lyckades lösa detta omåttligt svåra problem. Citatet har dock hängt med och används flitigt!", "created_utc": "1652250390.0", "edited": "1652250597.0", "id": "i85jb9h", "is_submitter": "False", "link_id": "t3_umbo65", "parent_id": "t3_umbo65", "score": "2", "subreddit": "sweden", "subreddit_id": "t5_2qofe"}, {"author": "Kesoburk", "body": "Can’t believe how accurate this is, I struggle every day to put myself out there more than just going to work essentially but it always feels like walking on tacks and it kills all enjoyment that I know everyone else is getting out of it. It feels like my SA isn’t getting any easier at all no matter how much I try and I feel like I keep embarrassing myself and being a mess out.  Which, logically, just kinda makes me want to curl up at home and never leave. \n\nThank you for writing and I’m sorry to hear about your regrets, but I hope you’ll be able to find solace. Life only moves in one direction, it’s so hard to convince yourself but you can really only accept that what is done is done. You have one road behind you but thousands before you. Stay safe king", "created_utc": "1652161466.0", "edited": "False", "id": "i80o2l4", "is_submitter": "False", "link_id": "t3_um4ahw", "parent_id": "t1_i802zjy", "score": "14", "subreddit": "socialanxiety", "subreddit_id": "t5_2r22n"}, {"author": "Kesoburk", "body": "I felt a lot like this turning 20 a while back, it felt like I completely wasted my late teens not taking care of myself and not working on my self-esteem, which in turn just made my self-esteem even worse. It’s still not great, but it’s getting better, I still struggle with social anxiety but I get by. I know it sounds a lot easier than it is, but I found solace in finally deciding I was done with the looking back and the regret. I’ll just have to accept that things are what they are. But, I started making a little change by taking better care of my skin, I started playing a sport I love to make working out enjoyable and I stopped giving too much of a damn what people think of me. Life’s too short, and I’m only 22 now. You’re only 25, you have time! You’ll have bad days and good days, but the good days are gonna outweigh the bad ones by a lot.\n\nAcne scars are seen as a beauty flaw, but it doesn’t have to be unless you think so too. Balding is “ugly”, but realistically, it can look really damn good. Think of it as fact, your body changes sometimes - that’s life. It happens to everyone, one way or another. Wasting energy and feeling like shit for something you can’t change will only bring you misery when you can choose happiness instead. The road there isn’t straight or easy, but it’ll make you happier in the end. \n\nWhat I find is that people who can come to terms with these things are able to absolutely rock their “flaws”. Men who shave off their hair instead of trying to hide their baldness usually look badass bald. If you have acne scars you can of course see a dermatologist and discuss your options, but otherwise I think what you can do is accept it and love yourself no matter what. I think you should also know that it’s 100% not about looks, it’s about confidence. One of the most well-known comedians in my country has extremely prominent acne scars but nobody cares because he’s a terrific comedian, a badass and a wonderful person. I have some spots and facial scars, I have scars on my thighs and butt, I’m not conventionally beautiful, I have nerdy hobbies and although I’m healthy, I’m not very thin. My boyfriend either didn’t notice or he didn’t care, because those things didn’t matter.\n\nIt’s easy to look back on the things you didn’t do because now you’ve grown wiser, now you’ve got the cheat sheet and you think “Knowing what I know now, I should’ve done X”. But you couldn’t possibly have known back then, could you? That knowledge is part of growing older, and so is having to accept living with your choices. You can never go back, only forwards, so you might as well make the best of it. It is what it is, and that doesn’t have to be a bad thing. Stop playing by someone else’s rules and standards, life’s pretty damn wonderful when you choose to be happy.", "created_utc": "1652125980.0", "edited": "False", "id": "i7yl0a5", "is_submitter": "False", "link_id": "t3_ulke07", "parent_id": "t3_ulke07", "score": "2", "subreddit": "socialanxiety", "subreddit_id": "t5_2r22n"}, {"author": "Kesoburk", "body": "Kläm ihop godispåsen mellan skinkorna. Vad ska de göra, tvinga av dig byxorna? Tror inte det.", "created_utc": "1649675545.0", "edited": "False", "id": "i4a2w15", "is_submitter": "False", "link_id": "t3_u12fhx", "parent_id": "t3_u12fhx", "score": "1", "subreddit": "sweden", "subreddit_id": "t5_2qofe"}, {"author": "Kesoburk", "body": "Meatballs and flat furtniture", "created_utc": "1649675164.0", "edited": "False", "id": "i4a2bci", "is_submitter": "False", "link_id": "t3_u0lmdv", "parent_id": "t3_u0lmdv", "score": "1", "subreddit": "YUROP", "subreddit_id": "t5_2wivw"}, {"author": "Kesoburk", "body": "Kommer hem med första gulmedaljen på 20 år och det första som händer är att man blir roasted av sin egen son, älskar det", "created_utc": "1643794935.0", "edited": "False", "id": "hv999v5", "is_submitter": "False", "link_id": "t3_si6rb9", "parent_id": "t3_si6rb9", "score": "28", "subreddit": "sweden", "subreddit_id": "t5_2qofe"}, {"author": "Kesoburk", "body": "Add banana and something crunchy, like almonds, hazelnut, something like that. Love it!", "created_utc": "1643794569.0", "edited": "False", "id": "hv98tk2", "is_submitter": "False", "link_id": "t3_si7qcw", "parent_id": "t3_si7qcw", "score": "1", "subreddit": "MealPlanYourMacros", "subreddit_id": "t5_109mys"}, {"author": "Kesoburk", "body": "Det ska ju vara Jeff Beasås?? Hallå?", "created_utc": "1642095812.0", "edited": "False", "id": "hsih8oz", "is_submitter": "False", "link_id": "t3_s2wor6", "parent_id": "t3_s2wor6", "score": "4", "subreddit": "okpolarncp", "subreddit_id": "t5_22g5fy"}, {"author": "Kesoburk", "body": "När jag var 19 och nyinflyttad i min första lägenhet gick jag och min sambo till lokala butiken för veckohandling, tog två korgar som vi (såklart) överfyllde och jag var tvungen att ta ett paket med mjöl under armen för att få med allt. Tjoffade upp allt på bandet och betalade, min sambo packade och så gick vi hem. Insåg inte att jag hade mjölet under armen innan jag nästan tappade hela paketet när jag låste upp dörren till lägenheten igen. Fattade inte hur kassörskan inte sa åt mig och har aldrig varit mer rädd för och övertygad om att säpo skulle komma på besök", "created_utc": "1641852339.0", "edited": "False", "id": "hs4fji2", "is_submitter": "False", "link_id": "t3_s0kwgn", "parent_id": "t3_s0kwgn", "score": "3", "subreddit": "swedishproblems", "subreddit_id": "t5_2vyct"}, {"author": "Kesoburk", "body": "F22, juriststudent med bidrag och lån på 11 + 3k. \n\nHar också jobbat som brevbärare, ca 24k efter skatt. Gillade att vara aktiv hela arbetsdagen och inte bara sitta av tid, och har alltid tyckt om det nästan mekaniska i att sortera upp posten. Gillade inte stressen, belastningen på kroppen, utdelning i risigt väder och oförskämda kunder. Dock väldigt studiemotiverande!", "created_utc": "1641851632.0", "edited": "False", "id": "hs4dn0l", "is_submitter": "False", "link_id": "t3_s0ihqk", "parent_id": "t3_s0ihqk", "score": "1", "subreddit": "sweden", "subreddit_id": "t5_2qofe"}, {"author": "Kesoburk", "body": "Had no idea this picture had actual backstory, I thought it was just an [album cover](https://www.google.com/search?q=the+moth+%26+the+flame+young+%26+unafraid+&tbm=isch&ved=2ahUKEwj01_jw6Ov0AhWHtyoKHQKZCHAQ2-cCegQIABAA&oq=the+moth+%26+the+flame+young+%26+unafraid+&gs_lcp=CgNpbWcQAzIHCCMQ7wMQJ1CyBliyBmC-CGgAcAB4AIABOYgBcJIBATKYAQCgAQGqAQtnd3Mtd2l6LWltZ8ABAQ&sclient=img&ei=nAa9YfSZEYfvqgGCsqKABw&bih=676&biw=890). Big TIL, really cool!", "created_utc": "1639778144.0", "edited": "False", "id": "hoz29ty", "is_submitter": "False", "link_id": "t3_rima9j", "parent_id": "t3_rima9j", "score": "1", "subreddit": "OldSchoolCool", "subreddit_id": "t5_2tycb"}, {"author": "Kesoburk", "body": "Uppvuxen i Haninge, minns att vi hängde en del i centrum när vi var 13/14/15. Nästan 4 år sedan jag var där sist och har hört lite skräckhistorier men tänkte att så illa är det säkert inte, nedgånget var ju bara förnamnet… 2012-2013 var det typ alltid folk i hela centrum oavsett tid på dagen, helg som vardag. Definitivt smidigare att handla i Port 73 nu dock, även om parkeringen måste blivit ritad och planerad av en a-lagare…", "created_utc": "1639268484.0", "edited": "False", "id": "ho6pdxu", "is_submitter": "False", "link_id": "t3_re1rua", "parent_id": "t3_re1rua", "score": "1", "subreddit": "stockholm", "subreddit_id": "t5_2r7aq"}, {"author": "Kesoburk", "body": "”What’s so funny about Biggus Dickus?”", "created_utc": "1639266744.0", "edited": "False", "id": "ho6lotx", "is_submitter": "False", "link_id": "t3_rdxz6i", "parent_id": "t3_rdxz6i", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "Kesoburk", "body": "SWEDISH PAGANS!", "created_utc": "1635835968.0", "edited": "False", "id": "hizfs4f", "is_submitter": "False", "link_id": "t3_qkot5b", "parent_id": "t1_hixraep", "score": "8", "subreddit": "sabaton", "subreddit_id": "t5_2upwb"}, {"author": "Kesoburk", "body": "Blir en oof på den, kontakta boisen på r/swedishproblems för tips på var du kan emigrera för att undkomma skammen", "created_utc": "1634898772.0", "edited": "False", "id": "hhlqj6b", "is_submitter": "False", "link_id": "t3_qcrads", "parent_id": "t3_qcrads", "score": "7", "subreddit": "jag_ivl", "subreddit_id": "t5_3841i"}, {"author": "Kesoburk", "body": "Har råkat ut för samma sak för 5+ år sedan, har aldrig gått de gatorna igen i fall att och jag har överlevt, så mitt tips är att du lär dig lite omvägar illa kvickt så kan du åtminstone bo kvar i samhället", "created_utc": "1634220655.0", "edited": "False", "id": "hgm2su1", "is_submitter": "False", "link_id": "t3_q7vyn7", "parent_id": "t3_q7vyn7", "score": "7", "subreddit": "swedishproblems", "subreddit_id": "t5_2vyct"}, {"author": "Kesoburk", "body": "\"gör det ordengklitt\"", "created_utc": "1633355614.0", "edited": "False", "id": "hfcmpsg", "is_submitter": "True", "link_id": "t3_q158p1", "parent_id": "t1_hfcmcjw", "score": "8", "subreddit": "sweden", "subreddit_id": "t5_2qofe"}, {"author": "Kesoburk", "body": "Nog för att detta sades av någon som talar desto kraftigare stockholmska än vad jag gör, men har hört det över dialektgränserna förut. Känns mer som missuppfattning, typ som hur folk säger \"pogram\" istället för pRogram.", "created_utc": "1633355448.0", "edited": "False", "id": "hfcmdnc", "is_submitter": "True", "link_id": "t3_q158p1", "parent_id": "t1_hfckycy", "score": "3", "subreddit": "sweden", "subreddit_id": "t5_2qofe"}, {"author": "Kesoburk", "body": "\"ejenklijen\"", "created_utc": "1633355134.0", "edited": "False", "id": "hfclqim", "is_submitter": "True", "link_id": "t3_q158p1", "parent_id": "t1_hfcliqu", "score": "19", "subreddit": "sweden", "subreddit_id": "t5_2qofe"}, {"author": "Kesoburk", "body": "Okej då, men det låter vrickat iaf", "created_utc": "1633355052.0", "edited": "False", "id": "hfclkl2", "is_submitter": "True", "link_id": "t3_q158p1", "parent_id": "t1_hfcl21d", "score": "2", "subreddit": "sweden", "subreddit_id": "t5_2qofe"}, {"author": "Kesoburk", "body": "Florida man on the hunt for child's kidnappers arrested for possession of nuclear weapons", "created_utc": "1632750743.0", "edited": "False", "id": "hegzf2d", "is_submitter": "False", "link_id": "t3_pwewqd", "parent_id": "t3_pwewqd", "score": "1", "subreddit": "shitposting", "subreddit_id": "t5_2usxq"}, {"author": "Kesoburk", "body": "Har domstolen bedömt att åldersintyget som inkommit till rätten inte är förfalskat får man nog nöja sig med att det är så, det tjänar inget till att spekulera i om det är så eller inte även om hela situationen kan vara upprörande. I sådant fall är det öht inte alls konstigt att JK har valt att handla på så sätt som skett och betalat ut ersättningen. \n\nSystemet finns ju någonstans för att ersätta skador som uppkommit för felaktig domstolsbehandling eller dom, man måste kunna begära resning för att kunna tillvarata sina intressen om man t.ex. kan presentera nya omständigheter i målet. Jag kan inte se grund för att JK skulle neka ersättning för att, ”men du blev ju faktiskt dömd sååå”, eller att, ”men just detta brott är ju jättehemskt så vi tänker inte betala ut något”. Faktum kvarstår att det framstår som att det inkommit nya omständigheter som innebär att någon dömts hårdare än lagen medger, och då måste det finnas likabehandling i hur bedömning om ersättning för skada görs. Jag är nästan beredd att betta på att JK följt tidigare praxis här.\n\nÄr man upprörd, vilket är helt förståeligt, så är det snarare JK:s riktlinjer kring ersättning i den här typen av frågor som måste förändras. Hela den här populistiska smörjan om att JK ska avsättas pronto eller andra rena spekulationer i målet är dock ren skit.", "created_utc": "1629623626.0", "edited": "False", "id": "h9w39fm", "is_submitter": "False", "link_id": "t3_p8ghf5", "parent_id": "t3_p8ghf5", "score": "0", "subreddit": "sweden", "subreddit_id": "t5_2qofe"}, {"author": "Kesoburk", "body": "Håller med", "created_utc": "1628058831.0", "edited": "False", "id": "h7ne3dh", "is_submitter": "True", "link_id": "t3_oxcivn", "parent_id": "t1_h7m5gb2", "score": "3", "subreddit": "swedishproblems", "subreddit_id": "t5_2vyct"}, {"author": "Kesoburk", "body": "Fattar stressen som förälder, tycker dock det är märkligt att så små barn inte 1) redan sover eller 2) ö.h.t. blir tillsagda. Som att man ville väcka folk.", "created_utc": "1628024307.0", "edited": "False", "id": "h7lkfu9", "is_submitter": "True", "link_id": "t3_oxcivn", "parent_id": "t1_h7lk562", "score": "26", "subreddit": "swedishproblems", "subreddit_id": "t5_2vyct"}, {"author": "Kesoburk", "body": "Det var en grupp om 5+ som tjoade och skrek till varandra på ett språk som inte var svenska eller engelska, så det var min gissning att det förmodligen var utbytes", "created_utc": "1627294450.0", "edited": "False", "id": "h6kko38", "is_submitter": "True", "link_id": "t3_or76c9", "parent_id": "t1_h6i8q0s", "score": "1", "subreddit": "swedishproblems", "subreddit_id": "t5_2vyct"}, {"author": "Kesoburk", "body": "Shit vilken onödig kommentar? Visa mig vilka studenter i 20-årsåldern som kan hålla ihop ekonomin och bo i hus på landet samtidigt som de studerar.", "created_utc": "1627208908.0", "edited": "False", "id": "h6gm07h", "is_submitter": "True", "link_id": "t3_or76c9", "parent_id": "t1_h6glp27", "score": "107", "subreddit": "swedishproblems", "subreddit_id": "t5_2vyct"}, {"author": "Kesoburk", "body": "Jo så är det väl, men det hade varit så enkelt att bara visa respekt för de boende och stänga av bergsprängaren när man ändå var på väg hem från själva festen. Jag förväntar mig inte att det ska vara tyst och lugnt i studentområde, men jag tycker att lite grundläggande hyfs inte är för mycket att önska. Man kan visa åtminstone lite beaktande för de ljudregler som finns om att man ska hålla ner volymen mellan 00-06, hela den här grejen var ju bara onödig och skitdum.", "created_utc": "1627206794.0", "edited": "False", "id": "h6gjsz1", "is_submitter": "True", "link_id": "t3_or76c9", "parent_id": "t1_h6gjif7", "score": "29", "subreddit": "swedishproblems", "subreddit_id": "t5_2vyct"}, {"author": "Kesoburk", "body": "Mja, jag förväntar mig att det kan vara ljud utomhus och att man får tåla det, det är därför jag använder öronproppar. Men jag tycker att det är orimligt IQ-befriat att dra en bergsprängare genom ett bostadsområde kl 04:30, student eller ej.", "created_utc": "1627206065.0", "edited": "False", "id": "h6gj1l4", "is_submitter": "True", "link_id": "t3_or76c9", "parent_id": "t1_h6gixzo", "score": "48", "subreddit": "swedishproblems", "subreddit_id": "t5_2vyct"}, {"author": "Kesoburk", "body": "Bidra till min kickstarter", "created_utc": "1627205929.0", "edited": "False", "id": "h6giwfn", "is_submitter": "True", "link_id": "t3_or76c9", "parent_id": "t1_h6gitd6", "score": "31", "subreddit": "swedishproblems", "subreddit_id": "t5_2vyct"}, {"author": "Kesoburk", "body": "Hahaha exakt, som att ”student” inte betyder ”hjälp jag har inga pengar”", "created_utc": "1627205891.0", "edited": "False", "id": "h6giuym", "is_submitter": "True", "link_id": "t3_or76c9", "parent_id": "t1_h6gihy8", "score": "127", "subreddit": "swedishproblems", "subreddit_id": "t5_2vyct"}, {"author": "Kesoburk", "body": "Det har jag ju redan?", "created_utc": "1627205417.0", "edited": "False", "id": "h6gid38", "is_submitter": "True", "link_id": "t3_or76c9", "parent_id": "t1_h6gi286", "score": "28", "subreddit": "swedishproblems", "subreddit_id": "t5_2vyct"}, {"author": "Kesoburk", "body": "Får bli införskaffande av slangbella då", "created_utc": "1627200355.0", "edited": "False", "id": "h6gczah", "is_submitter": "True", "link_id": "t3_or76c9", "parent_id": "t1_h6gbc8z", "score": "31", "subreddit": "swedishproblems", "subreddit_id": "t5_2vyct"}, {"author": "Kesoburk", "body": "Korrekt, bor i studentområde. Att bo i studentområde kan ju dock inte betyda att det inte finns någon respekt mellan boende. Man får mer än gärna festa och ha skoj, men 04:30 tycker jag inte det är för mycket att önska att man stänger av bergsprängaren när man går hem eftersom man går igenom ett bostadsområde. Då är man dum i huvudet.", "created_utc": "1627198732.0", "edited": "False", "id": "h6gb5w8", "is_submitter": "True", "link_id": "t3_or76c9", "parent_id": "t1_h6gayrx", "score": "93", "subreddit": "swedishproblems", "subreddit_id": "t5_2vyct"}, {"author": "Kesoburk", "body": "Verb: ”Att älska” = To love\n\nEx: ”Jag älskar dig” = I love you\n\n\nNoun: ”Kärlek” = Love \n\nEx: ”Kärleken är god” = Love is kind\n\nLove is also a Swedish boys’ name, but it’s pronounced like [Loo-veh], where the e sounds more like ä. Maybe that’s what you heard?", "created_utc": "1627197011.0", "edited": "False", "id": "h6g970o", "is_submitter": "False", "link_id": "t3_or1qq4", "parent_id": "t1_h6fgy9n", "score": "9", "subreddit": "Svenska", "subreddit_id": "t5_2scor"}, {"author": "Kesoburk", "body": "Haha nej man ska väl vara trevlig, jag vet inte ens vem det är eftersom röken kommer in genom fönstren och jag bor i ett höghus där man inte ser varandras balkonger. Dags för lapp i trapphuset?", "created_utc": "1626869543.0", "edited": "False", "id": "h5zsxmt", "is_submitter": "True", "link_id": "t3_onnod9", "parent_id": "t1_h5zsip0", "score": "1", "subreddit": "swedishproblems", "subreddit_id": "t5_2vyct"}, {"author": "Kesoburk", "body": "Det är inte bara 10 min om dagen dock, personen i fråga bolmar värre än en skorsten så det är en-två ggr i timmen. Jag vet att man får tåla det men shit vad äckligt det luktar typ exakt hela tiden. Det är fan mer orimligt att jag ska springa och stänga och öppna mina fönster så ofta istället för att personen ba går ner på gården när det är 2 våningar ner med hissen.", "created_utc": "1626869017.0", "edited": "False", "id": "h5zs3b0", "is_submitter": "True", "link_id": "t3_onnod9", "parent_id": "t1_h5xty31", "score": "3", "subreddit": "swedishproblems", "subreddit_id": "t5_2vyct"}, {"author": "Kesoburk", "body": "Längtar till jobb och hus så man har pengar nog att slippa bo bland människor, bröstar hellre underhållet än allt vad det innebär att bo i lägenhet om jag ska vara ärlig.", "created_utc": "1626790906.0", "edited": "False", "id": "h5vlzi6", "is_submitter": "True", "link_id": "t3_onnod9", "parent_id": "t1_h5vje9w", "score": "2", "subreddit": "swedishproblems", "subreddit_id": "t5_2vyct"}, {"author": "Kesoburk", "body": "Allt jag säger är att det hade varit trevligt att kunna ha öppna fönster och sitta på min egen balkong utan att känna röklukt, men jag fattar ju att folk är folk. Det är dock lättare att gå ner på gården att röka än vad det är för mig att flytta min balkong, men men.", "created_utc": "1626790712.0", "edited": "False", "id": "h5vljqs", "is_submitter": "True", "link_id": "t3_onnod9", "parent_id": "t1_h5vihpg", "score": "3", "subreddit": "swedishproblems", "subreddit_id": "t5_2vyct"}, {"author": "Kesoburk", "body": "Ahhh shit nu hänger allt ihop!", "created_utc": "1626790335.0", "edited": "False", "id": "h5vkpqe", "is_submitter": "True", "link_id": "t3_onnod9", "parent_id": "t1_h5v7gr5", "score": "2", "subreddit": "swedishproblems", "subreddit_id": "t5_2vyct"}, {"author": "Kesoburk", "body": "Jag har en granne som spelar piano och sjunger lite då och då, men hon spelar så galet vackert att man bara vill ligga och lyssna, det känns så nostalgiskt och mysigt på något sätt", "created_utc": "1626781394.0", "edited": "False", "id": "h5v4ibj", "is_submitter": "True", "link_id": "t3_onnod9", "parent_id": "t1_h5uxvh7", "score": "3", "subreddit": "swedishproblems", "subreddit_id": "t5_2vyct"}, {"author": "Kesoburk", "body": "Det är rimligare att sitta på balkongen än att röka inne, ja, och eftersom det är tillåtet där jag bor så finns det ju inte så mycket jag kan göra åt det. Kan tyvärr inte påverka min boendesituation tills jag har studerat färdigt så kände behovet av att klaga", "created_utc": "1626781219.0", "edited": "False", "id": "h5v49bt", "is_submitter": "True", "link_id": "t3_onnod9", "parent_id": "t1_h5v1h9d", "score": "1", "subreddit": "swedishproblems", "subreddit_id": "t5_2vyct"}, {"author": "Kesoburk", "body": "Rimligt ändå, men är generellt en väldigt tyst och lugn granne så känner att det är lite ovälförtjänt...", "created_utc": "1626781144.0", "edited": "False", "id": "h5v45gj", "is_submitter": "True", "link_id": "t3_onnod9", "parent_id": "t1_h5uz6qv", "score": "2", "subreddit": "swedishproblems", "subreddit_id": "t5_2vyct"}, {"author": "Kesoburk", "body": "Jag förstår hur du menar, men att dricka och äta måste jag ju göra för att leva medan rökning är ett val som påverkar andra i deras hem. T.ex. om någon väljer att öppna en surströmmingsburk på balkongen så tycker jag att vederbörande också kan gå ut på gården istället för att förpesta min uteplats, och jag tycker att det är rimligt att begära av vederbörande att göra så. Varför ska rökare ha rätt att sprida röklukt så att jag inte kan sitta på MIN balkong för att det stinker?", "created_utc": "1626781006.0", "edited": "False", "id": "h5v3yew", "is_submitter": "True", "link_id": "t3_onnod9", "parent_id": "t1_h5urvq1", "score": "4", "subreddit": "swedishproblems", "subreddit_id": "t5_2vyct"}, {"author": "Kesoburk", "body": "För visso sant, fattar ju att bor man i lägenhet får man väl stå ut med människor i allmänhet. Men jag förstår inte varför vederbörande bara inte kan gå ut på gården istället, speciellt nu på sommaren när många måste vädra för att inte koka sönder i lägenheten. Kunde jag bo i hus på landet skulle jag det, f.ö.", "created_utc": "1626769882.0", "edited": "False", "id": "h5uqsf7", "is_submitter": "True", "link_id": "t3_onnod9", "parent_id": "t1_h5uqnd5", "score": "4", "subreddit": "swedishproblems", "subreddit_id": "t5_2vyct"}, {"author": "Kesoburk", "body": "Jag kan ändå tycka att i mitt eget hem får det väl vara någon måtta. Parfym och avgaser är knappast mysigt men det är knappast något du blir bombarderad med i ditt eget hem heller, förutsatt att du inte bor mitt i stan men då har man ju typ valt att få in avgaser genom fönstren.", "created_utc": "1626769358.0", "edited": "False", "id": "h5uq7dv", "is_submitter": "True", "link_id": "t3_onnod9", "parent_id": "t1_h5uq15m", "score": "3", "subreddit": "swedishproblems", "subreddit_id": "t5_2vyct"}, {"author": "Kesoburk", "body": "Men vi kan väl ändå enas om att det borde vara dödsstraff på inomhusrökning? Det är nästan ännu äckligare, förstör både för grannarna och så blir lägenheten omöjlig att leva i efteråt", "created_utc": "1626764934.0", "edited": "False", "id": "h5ul5uy", "is_submitter": "True", "link_id": "t3_onnod9", "parent_id": "t1_h5ul1xd", "score": "39", "subreddit": "swedishproblems", "subreddit_id": "t5_2vyct"}, {"author": "Kesoburk", "body": "Så fort jag är klar blir det en sån!", "created_utc": "1626761294.0", "edited": "False", "id": "h5ugq6c", "is_submitter": "True", "link_id": "t3_onnod9", "parent_id": "t1_h5ugnnc", "score": "14", "subreddit": "swedishproblems", "subreddit_id": "t5_2vyct"}, {"author": "Kesoburk", "body": "TRO MIG, om jag kunde bo i en stuga på landet I WOULD men studentpengarna räckte inte för det.", "created_utc": "1626760962.0", "edited": "False", "id": "h5ugaws", "is_submitter": "True", "link_id": "t3_onnod9", "parent_id": "t1_h5ug73t", "score": "23", "subreddit": "swedishproblems", "subreddit_id": "t5_2vyct"}, {"author": "Kesoburk", "body": "En rökares rätt att röka på balkongen kan inte vara större än min rätt att slippa bli påverkad av röklukt eftersom jag valt att inte röka. Rökare får väl röka om de vill, men då får man för fan gå ut på gården så att grannarna slipper påverkas av rökarens livsval", "created_utc": "1626760631.0", "edited": "False", "id": "h5ufvdw", "is_submitter": "True", "link_id": "t3_onnod9", "parent_id": "t1_h5teiox", "score": "23", "subreddit": "swedishproblems", "subreddit_id": "t5_2vyct"}, {"author": "Kesoburk", "body": "Nu är det dock 30 grader ute och majoriteten av folk i mitt område måste ha drag genom lägenheten för att inte dö en långsam död så ja, antingen kan man röka på balkongen som ett as eller så kan man gå utomhus på gården som en normal människa", "created_utc": "1626760303.0", "edited": "False", "id": "h5uffux", "is_submitter": "True", "link_id": "t3_onnod9", "parent_id": "t1_h5tshqs", "score": "34", "subreddit": "swedishproblems", "subreddit_id": "t5_2vyct"}, {"author": "Kesoburk", "body": "Det är min negativa frihet att slippa ciggrök i min lägenhet när jag inte är rökare, jag startar revolution snart", "created_utc": "1626730687.0", "edited": "False", "id": "h5svlrd", "is_submitter": "True", "link_id": "t3_onnod9", "parent_id": "t1_h5susz0", "score": "19", "subreddit": "swedishproblems", "subreddit_id": "t5_2vyct"}, {"author": "Kesoburk", "body": "Har jobbat extra på Postnord och kommit fram till att vissa kontor har rutin att man skickar allt man vet inte kommer gå ner i brevlådan direkt till ombudet, medan på andra kontor ska allt med ut på rutten, och då knackar man ju på och levererar (förutsatt att personen öppnar dörren). Men den här idioten verkar ju inte fatta att han får betalt för att faktiskt LEVERERA paket som han har med sig ut? I värsta fall hade han ju bara behövt fråga efter ett leg så hade båda tjänat på det? Fattar inte vad det är för människor som med flit gör så här, för det kostar bara tid, ork och pengar att ta tillbaka paket och skicka dem till ombudet dagen efter.", "created_utc": "1607626071.0", "edited": "False", "id": "gfb5t4d", "is_submitter": "False", "link_id": "t3_kadxru", "parent_id": "t3_kadxru", "score": "4", "subreddit": "swedishproblems", "subreddit_id": "t5_2vyct"}, {"author": "Kesoburk", "body": "Tar med en ryggsäck med 1-3 tygpåsar eller papperskassar från andra butiker, sen lägger jag den längst ned i vagnen eller ställer den på högkant i korgen. Ingen som arbetar på matbutikerna jag går till har tittat suspekt på mig ännu ¯\\\\\\_(ツ)\\_/¯", "created_utc": "1600842994.0", "edited": "False", "id": "g6antul", "is_submitter": "False", "link_id": "t3_ixogyd", "parent_id": "t3_ixogyd", "score": "1", "subreddit": "swedishproblems", "subreddit_id": "t5_2vyct"}, {"author": "Kesoburk", "body": "***BREAD SOUP***", "created_utc": "1599746755.0", "edited": "False", "id": "g4oj29h", "is_submitter": "False", "link_id": "t3_iq3vh4", "parent_id": "t3_iq3vh4", "score": "4", "subreddit": "videos", "subreddit_id": "t5_2qh1e"}, {"author": "Kesoburk", "body": "Been trying to figure this out for a while, huge thanks!", "created_utc": "1596825918.0", "edited": "False", "id": "g0pj76r", "is_submitter": "True", "link_id": "t3_i5jbza", "parent_id": "t1_g0pig8a", "score": "1", "subreddit": "whatsthisbug", "subreddit_id": "t5_2s3bw"}, {"author": "Kesoburk", "body": "Made my day", "created_utc": "1589822620.0", "edited": "False", "id": "fr1n6gj", "is_submitter": "True", "link_id": "t3_glk5fk", "parent_id": "t1_fqza2iv", "score": "2", "subreddit": "PoliticalCompassMemes", "subreddit_id": "t5_3ipa1"}, {"author": "Kesoburk", "body": "Ask and you shall receive the grill: [https://imgur.com/a/imFpPZi](https://imgur.com/a/imFpPZi)", "created_utc": "1589786080.0", "edited": "False", "id": "fr07ggz", "is_submitter": "True", "link_id": "t3_glk5fk", "parent_id": "t1_fqy24ce", "score": "19", "subreddit": "PoliticalCompassMemes", "subreddit_id": "t5_3ipa1"}, {"author": "Kesoburk", "body": "She's got a tiara! No rifle tho. Also, huge thanks!", "created_utc": "1589739567.0", "edited": "False", "id": "fqxy0hs", "is_submitter": "True", "link_id": "t3_glk5fk", "parent_id": "t1_fqxxli9", "score": "52", "subreddit": "PoliticalCompassMemes", "subreddit_id": "t5_3ipa1"}, {"author": "Kesoburk", "body": "*Modigt av dig att anta att jag inte också är skandinav*", "created_utc": "1589487072.0", "edited": "False", "id": "fqn1gr8", "is_submitter": "False", "link_id": "t3_gjkff9", "parent_id": "t1_fqmihsq", "score": "10", "subreddit": "HistoryMemes", "subreddit_id": "t5_2v2cd"}, {"author": "Kesoburk", "body": "Dænmark wätch öut yøu'ræ göing to get bømbårded, øh fuck he cån't hær me he häs eärpøds in øh göd öh fuck", "created_utc": "1589461431.0", "edited": "False", "id": "fqlm25h", "is_submitter": "False", "link_id": "t3_gjkff9", "parent_id": "t3_gjkff9", "score": "92", "subreddit": "HistoryMemes", "subreddit_id": "t5_2v2cd"}, {"author": "Kesoburk", "body": "Helvete, att du ens orkade. Starkt.", "created_utc": "1583338707.0", "edited": "False", "id": "fjgzv9o", "is_submitter": "True", "link_id": "t3_fczubp", "parent_id": "t1_fjgjw3z", "score": "2", "subreddit": "swedishproblems", "subreddit_id": "t5_2vyct"}, {"author": "Kesoburk", "body": "Som stampar och hoppar oavbrutet mellan 18-24 varje dag? Möjligt, visst. Föräldrarna är dock i sådana fall jubelidioter som låter småbarnen vara uppe så länge och som inte säger åt ungjävlarna att sluta bokstavligen försöka göra hål i golvet med sina fötter.", "created_utc": "1583312763.0", "edited": "False", "id": "fjg5qzh", "is_submitter": "True", "link_id": "t3_fczubp", "parent_id": "t1_fjg03wk", "score": "1", "subreddit": "swedishproblems", "subreddit_id": "t5_2vyct"}, {"author": "Kesoburk", "body": "SU", "created_utc": "1583302778.0", "edited": "False", "id": "fjfwxtq", "is_submitter": "True", "link_id": "t3_fczubp", "parent_id": "t1_fjfwxid", "score": "1", "subreddit": "swedishproblems", "subreddit_id": "t5_2vyct"}, {"author": "Kesoburk", "body": "Ok! De har inget vad jag vet, men ska undersöka. Hade varit topp att iaf få veta vad idioten håller på med där uppe", "created_utc": "1583274448.0", "edited": "False", "id": "fjemm8m", "is_submitter": "True", "link_id": "t3_fczubp", "parent_id": "t1_fjem90k", "score": "1", "subreddit": "swedishproblems", "subreddit_id": "t5_2vyct"}, {"author": "Kesoburk", "body": "Nu blev man ju lagom nyfiken", "created_utc": "1583273511.0", "edited": "False", "id": "fjekmqi", "is_submitter": "True", "link_id": "t3_fczubp", "parent_id": "t1_fjekl0w", "score": "1", "subreddit": "swedishproblems", "subreddit_id": "t5_2vyct"}, {"author": "Kesoburk", "body": "Oof, hoppas personen kryar på sig. Dock sjukt förvånad över hur typ alla har en granne på 300 kg ovanför sig. Jag är iofs den jobbiga grannen som spelar instrument men liksom aldrig på kvällstid när folk chillar, käkar middag osv. Jag fattar inte hur det hänger ihop", "created_utc": "1583273392.0", "edited": "False", "id": "fjekfep", "is_submitter": "True", "link_id": "t3_fczubp", "parent_id": "t1_fjeixd0", "score": "1", "subreddit": "swedishproblems", "subreddit_id": "t5_2vyct"}, {"author": "Kesoburk", "body": "Jamen jag fattar inte heller hur minst 2 pers ovanför någonstans kan stampa och hoppa runt som kokainhöga tjackpundare från kl 13 till kl 24 typ OAVBRUTET, har människorna speed i ådrorna? Vet de inte hur man sitter och chillar eller är de någon slags muterade supermänniskor med oändligt med energi?? Jag fattar verkligen inte, jag får inte ihop det alls", "created_utc": "1583273238.0", "edited": "False", "id": "fjek5p1", "is_submitter": "True", "link_id": "t3_fczubp", "parent_id": "t1_fjejv7p", "score": "12", "subreddit": "swedishproblems", "subreddit_id": "t5_2vyct"}, {"author": "Kesoburk", "body": "Hur menar du nu? 🤔", "created_utc": "1583273069.0", "edited": "False", "id": "fjejv22", "is_submitter": "True", "link_id": "t3_fczubp", "parent_id": "t1_fjejqzp", "score": "2", "subreddit": "swedishproblems", "subreddit_id": "t5_2vyct"}, {"author": "Kesoburk", "body": "Har snackat med honom förut dock och han är helt normal, han om någon torde ha koll på ljudnivån. Obs också att min granne 6 dörrar bort hör samma sak, så det är något som hörs långväga", "created_utc": "1583273006.0", "edited": "False", "id": "fjejr58", "is_submitter": "True", "link_id": "t3_fczubp", "parent_id": "t1_fjejjx1", "score": "3", "subreddit": "swedishproblems", "subreddit_id": "t5_2vyct"}, {"author": "Kesoburk", "body": "Stort mood på denna, jag är också på väg att få totalt psykbryt snart", "created_utc": "1583272848.0", "edited": "False", "id": "fjejh3o", "is_submitter": "True", "link_id": "t3_fczubp", "parent_id": "t1_fjejat5", "score": "9", "subreddit": "swedishproblems", "subreddit_id": "t5_2vyct"}, {"author": "Kesoburk", "body": "Inte SSSB tyvärr :/", "created_utc": "1583272755.0", "edited": "False", "id": "fjejb7e", "is_submitter": "True", "link_id": "t3_fczubp", "parent_id": "t1_fjeja25", "score": "1", "subreddit": "swedishproblems", "subreddit_id": "t5_2vyct"}, {"author": "Kesoburk", "body": "Problemet är att jag bor i ljudisolerad byggnad för att vi har nära till större väg, så går man ut i trapphuset så hörs det liksom knappt. Sen finns också 12 olika lägenheter på våningen över som ljudet skulle kunna komma från, så svårt att utreda närmare...", "created_utc": "1583272707.0", "edited": "False", "id": "fjej841", "is_submitter": "True", "link_id": "t3_fczubp", "parent_id": "t1_fjeiylg", "score": "1", "subreddit": "swedishproblems", "subreddit_id": "t5_2vyct"}, {"author": "Kesoburk", "body": "Kan ju vara väldigt aggressivt samlag, men då kan man ju fråga sig hur friska i huvudet människorna egentligen är... Mina vaknar typ kl 13 och sen är det AB Röj från dess till 24.", "created_utc": "1583272584.0", "edited": "False", "id": "fjej05j", "is_submitter": "True", "link_id": "t3_fczubp", "parent_id": "t1_fjeioho", "score": "16", "subreddit": "swedishproblems", "subreddit_id": "t5_2vyct"}, {"author": "Kesoburk", "body": "Det här är bokstavligen bara hur jag lever", "created_utc": "1583272297.0", "edited": "False", "id": "fjeihhz", "is_submitter": "True", "link_id": "t3_fczubp", "parent_id": "t1_fjeh2o4", "score": "36", "subreddit": "swedishproblems", "subreddit_id": "t5_2vyct"}, {"author": "Kesoburk", "body": "Hyresvärden har sagt att det inte finns något att göra så länge jag inte vet från vilken lägenhet det kommer från, och det vet jag ju tyvärr inte så jag är fucked", "created_utc": "1583272168.0", "edited": "False", "id": "fjei91m", "is_submitter": "True", "link_id": "t3_fczubp", "parent_id": "t1_fjehys6", "score": "2", "subreddit": "swedishproblems", "subreddit_id": "t5_2vyct"}, {"author": "Kesoburk", "body": "På hyreshusets fb, här hälsar vi inte på varandra.", "created_utc": "1583264491.0", "edited": "False", "id": "fje3g6q", "is_submitter": "True", "link_id": "t3_fczubp", "parent_id": "t1_fje3c9p", "score": "204", "subreddit": "swedishproblems", "subreddit_id": "t5_2vyct"}, {"author": "Kesoburk", "body": "🎵*Vår stormaktstid är över*🎵", "created_utc": "1578964824.0", "edited": "False", "id": "fec0d5y", "is_submitter": "False", "link_id": "t3_eo9188", "parent_id": "t3_eo9188", "score": "3", "subreddit": "HistoryMemes", "subreddit_id": "t5_2v2cd"}, {"author": "Kesoburk", "body": "r/teknisktsettsanningen", "created_utc": "1576178500.0", "edited": "False", "id": "fal504c", "is_submitter": "False", "link_id": "t3_e9pg8t", "parent_id": "t3_e9pg8t", "score": "8", "subreddit": "sweden", "subreddit_id": "t5_2qofe"}, {"author": "Kesoburk", "body": "Jopp, erkänner misstaget. Dock gjord som skämtsam \"haha-det-var-ju-lite-kul\" ritning, låste inte fast mig för mycket vid historian.", "created_utc": "1576017422.0", "edited": "False", "id": "faf9gar", "is_submitter": "True", "link_id": "t3_e8wh2f", "parent_id": "t1_faf3y24", "score": "36", "subreddit": "sweden", "subreddit_id": "t5_2qofe"}, {"author": "Kesoburk", "body": "Nu är det inte meningen att vara helt korrekt baserad på språk, släkten o.s.v. Erkänner miss med Sápmi men försökte mest vara skämtsam  ¯\\\\\\_(ツ)\\_/¯", "created_utc": "1576017124.0", "edited": "False", "id": "faf8zfx", "is_submitter": "True", "link_id": "t3_e8wh2f", "parent_id": "t1_faf6j98", "score": "11", "subreddit": "sweden", "subreddit_id": "t5_2qofe"}, {"author": "Kesoburk", "body": "Det är jag också, men ska in på min tredje blodgivning snart ändå! Be dem att inte säga till när de sticker och titta bort/blunda innan de ens tar fram nålarna. Sticket gör inte jätteont och går över fort, så ta det lugnt så gott det går så kommer allt gå skitbra 👍", "created_utc": "1575495367.0", "edited": "False", "id": "f9o2uyv", "is_submitter": "False", "link_id": "t3_e5xffp", "parent_id": "t1_f9myzrh", "score": "1", "subreddit": "sweden", "subreddit_id": "t5_2qofe"}, {"author": "Kesoburk", "body": "Närmaste blodcentral eller blodbuss! Kolla på www.geblod.nu", "created_utc": "1575495061.0", "edited": "False", "id": "f9o2bwo", "is_submitter": "False", "link_id": "t3_e5xffp", "parent_id": "t1_f9nupvg", "score": "2", "subreddit": "sweden", "subreddit_id": "t5_2qofe"}, {"author": "Kesoburk", "body": "Tack för de fina orden! Jag brukar tänka att om det var jag som var i akut brist på blod så hade jag varit oändligt tacksam att någon annan tagit 30 minuter av sin dag för att hålla mig vid liv. Fick dessutom reda på att jag är blodgrupp 0+ så jag kan ge till nästan alla som behöver! Det gör mig ändå gladare än vad nålen gör ont ☺️", "created_utc": "1575494751.0", "edited": "False", "id": "f9o1rvk", "is_submitter": "False", "link_id": "t3_e5xffp", "parent_id": "t1_f9n941y", "score": "3", "subreddit": "sweden", "subreddit_id": "t5_2qofe"}, {"author": "Kesoburk", "body": "Man får en skumgummiboll att krama innan nålen sätts in för blodkärlen i armen ska bli synligare och därmed lättare att ”träffa rätt”, så får man hålla i den tills det är klart.", "created_utc": "1575494254.0", "edited": "False", "id": "f9o0whw", "is_submitter": "False", "link_id": "t3_e5xffp", "parent_id": "t1_f9nunsd", "score": "3", "subreddit": "sweden", "subreddit_id": "t5_2qofe"}, {"author": "Kesoburk", "body": "Tråkigt att det inte var så proffsigt bemötande som man kanske önskat, hade en liknande historia inom vården där en sköterska satte in nålen fel två gånger i rad. Men på Blodcentralen har det aldrig varit problem, och då har jag ändå varit inne på två testgivningar och två riktiga blodgivningar. Blodcentralen är bäst, helt enkelt.", "created_utc": "1575494070.0", "edited": "False", "id": "f9o0ktd", "is_submitter": "False", "link_id": "t3_e5xffp", "parent_id": "t1_f9nac52", "score": "2", "subreddit": "sweden", "subreddit_id": "t5_2qofe"}, {"author": "Kesoburk", "body": "Jag har varit spruträdd hela mitt liv, men bestämde mig i år för att ändå göra en god sak och bli blodgivare. Bästa tipset jag har är att be dem att inte säga till när de sticker och att titta bort eller blunda om man tycker att det är obehagligt, det hjälper massor! Första gången var jag nära till tårar pga rädslan, men de på Blodcentralen var superproffsiga och snackade lugnt med mig så löste sig allt superbra, det gör inte så ont även om nålen kan tyckas stor. Om två veckor ska jag in och ge för tredje gången, jag tycker fortfarande att det är obehagligt men de på centralen vill förmodligen mer än du att du ska känna dig trygg och välkommen. Kan jag, kan du!", "created_utc": "1575462451.0", "edited": "False", "id": "f9mk8n2", "is_submitter": "False", "link_id": "t3_e5xffp", "parent_id": "t1_f9mispk", "score": "67", "subreddit": "sweden", "subreddit_id": "t5_2qofe"}, {"author": "Kesoburk", "body": "Eller hur! *gråter hela vägen till omregistreringen*", "created_utc": "1575131638.0", "edited": "False", "id": "f95niea", "is_submitter": "False", "link_id": "t3_e3wsac", "parent_id": "t1_f95m7ls", "score": "13", "subreddit": "unket", "subreddit_id": "t5_3hb2y"}, {"author": "Kesoburk", "body": "Jag tycker tentan är så rolig så jag brukar få göra den två gånger :)", "created_utc": "1575130799.0", "edited": "False", "id": "f95m4zj", "is_submitter": "False", "link_id": "t3_e3wsac", "parent_id": "t3_e3wsac", "score": "70", "subreddit": "unket", "subreddit_id": "t5_3hb2y"}, {"author": "Kesoburk", "body": "Inte ens svenskar förstår älvdalska", "created_utc": "1573984444.0", "edited": "False", "id": "f7rnrob", "is_submitter": "True", "link_id": "t3_dwzjjr", "parent_id": "t1_f7rilt0", "score": "2", "subreddit": "norge", "subreddit_id": "t5_2qh94"}, {"author": "Kesoburk", "body": "Danska är hopplöst på en helt annan nivå, jag tycker att även när jag fokuserar så förstår jag max en handfull ord i en mening. Har hittills levt på att jag förstår kontextet så det brukar lösa sig", "created_utc": "1573924069.0", "edited": "False", "id": "f7oahpx", "is_submitter": "True", "link_id": "t3_dwzjjr", "parent_id": "t1_f7oaca6", "score": "1", "subreddit": "norge", "subreddit_id": "t5_2qh94"}, {"author": "Kesoburk", "body": "Mållös. Låter ju östasiatiskt?", "created_utc": "1573923294.0", "edited": "False", "id": "f7o9567", "is_submitter": "True", "link_id": "t3_dwzjjr", "parent_id": "t1_f7o90qy", "score": "2", "subreddit": "norge", "subreddit_id": "t5_2qh94"}, {"author": "Kesoburk", "body": "Jag själv kan hänga med någorlunda i Bergen- och Stavanger-dialekterna, men det är skitsvårt vid snabbt, alldagligt tal. Trønder-dialekt har jag nog inte ens hört om jag är ärlig 🤔", "created_utc": "1573923083.0", "edited": "False", "id": "f7o8sox", "is_submitter": "True", "link_id": "t3_dwzjjr", "parent_id": "t1_f7o8m81", "score": "2", "subreddit": "norge", "subreddit_id": "t5_2qh94"}, {"author": "Kesoburk", "body": "Problemet är nog att den norska media som når Sverige kommer från Oslo. Till exempel dialekten från Bergen och norröver är antingen för svårt för svenskar att riktigt förstå eller så hörs de inte lika ofta som Oslomål. Det är ju Oslomål som är enklast att förstå och härma, så det är förmodligen därför det är den vedertagna dialekten som svenskar menar när de säger ”norska”.", "created_utc": "1573909697.0", "edited": "False", "id": "f7nlos8", "is_submitter": "True", "link_id": "t3_dwzjjr", "parent_id": "t1_f7nkxgl", "score": "3", "subreddit": "norge", "subreddit_id": "t5_2qh94"}, {"author": "Kesoburk", "body": "På vissa svenska dialekter kan man inte vara arg, till exempel i Värmland låter alla bara lite borta, och i Skåne kan man inte ta dem seriöst. Svenska från Österbotten låter absolut argast, men nästan alla andra dialekter tycker jag nog att det går att låta riktigt förbannad på. Har ännu inte hört arg norska som undviker att låta sådär glatt och gulligt", "created_utc": "1573907095.0", "edited": "False", "id": "f7njmwj", "is_submitter": "True", "link_id": "t3_dwzjjr", "parent_id": "t1_f7mp43h", "score": "7", "subreddit": "norge", "subreddit_id": "t5_2qh94"}, {"author": "Kesoburk", "body": "Dialekterna i Stockholm och mellersta Sverige är definitivt gnälligare än resten av landet, det tycker alla svenskar också. Tror att många svenskar faktiskt ser sig som lite bättre än alla andra, men vi har jantelagen så vi pratar inte om det...", "created_utc": "1573906644.0", "edited": "False", "id": "f7njb50", "is_submitter": "True", "link_id": "t3_dwzjjr", "parent_id": "t1_f7nhr60", "score": "10", "subreddit": "norge", "subreddit_id": "t5_2qh94"}, {"author": "Kesoburk", "body": "Svär att jag har samma hiss, men i en Stockholmsförort.", "created_utc": "1573331767.0", "edited": "False", "id": "f70rd96", "is_submitter": "False", "link_id": "t3_dttwfv", "parent_id": "t1_f6zy7og", "score": "2", "subreddit": "unket", "subreddit_id": "t5_3hb2y"}, {"author": "Kesoburk", "body": "Det här svaret får mig att tro att du inte riktigt var intresserad av någon studie till att börja med utan snarare ville försöka knäppa grabben på näsan.", "created_utc": "1572024737.0", "edited": "False", "id": "f56lltu", "is_submitter": "False", "link_id": "t3_dmt36z", "parent_id": "t1_f569bdf", "score": "1", "subreddit": "svenskpolitik", "subreddit_id": "t5_2twun"}, {"author": "Kesoburk", "body": "U-landskontroll, check", "created_utc": "1567816150.0", "edited": "False", "id": "ezb9loc", "is_submitter": "False", "link_id": "t3_d0jsgt", "parent_id": "t3_d0jsgt", "score": "1", "subreddit": "swedishproblems", "subreddit_id": "t5_2vyct"}, {"author": "Kesoburk", "body": "Some gym chains offer a day or a week's worth of training free of charge before you decide on getting a membership or not. I'm not too sure about requirements for this, but check chains like SATS, Nordic Wellness, 24/7 and the likes around Östermalm and ask them in person. You could also try getting a day pass to a public indoor swimming pool like Kronobergsbadet where they have showers, but that'll cost you around 70 kr. Hope this helps.", "created_utc": "1564088360.0", "edited": "False", "id": "euxjw5h", "is_submitter": "False", "link_id": "t3_cht6e6", "parent_id": "t3_cht6e6", "score": "4", "subreddit": "stockholm", "subreddit_id": "t5_2r7aq"}, {"author": "Kesoburk", "body": "*Mjölbypartiet would like to know your location*", "created_utc": "1562188401.0", "edited": "False", "id": "espqlqv", "is_submitter": "False", "link_id": "t3_c8mw6c", "parent_id": "t3_c8mw6c", "score": "6", "subreddit": "unket", "subreddit_id": "t5_3hb2y"}, {"author": "Kesoburk", "body": "Jag är bara 20 så har kanske inte den fulla upplevelsen än, men jag är iaf uppvuxen i Haninge. Bodde i ett ganska \"off\" område så man hade väl 15 minuter att gå till centrum där man hade någon mataffär, skola och tåg. Åkte bara in till Stockholm på skolutflykt, bio eller om någon släkting ville träffa en och göra något, då var det 35 minuter med pendeln. Annars besökte man stan väldigt lite, vi hade ca 10 minuter med tåg till Haninge Centrum där man kunde handla mat, shoppa kläder, fika med polare osv. Fick ta tåget själv till Stockholm med nån vän först runt ca 13-14 år eller så. På gymnasiet pluggade jag söder om söder och fick ta tunnelbanan, då bodde polarna lite överallt så då blev det många besök i innerstan. Har också jobbat utanför tullarna snart tre somrar men är tyvärr även beroende av universitet nuförtiden. Bor dock numera på gröna linjen söder om söder och klarar mig fullt gott med det utbud som finns, vill aldrig bo i innerstan.", "created_utc": "1560844435.0", "edited": "False", "id": "ergkwkl", "is_submitter": "False", "link_id": "t3_byjjk2", "parent_id": "t3_byjjk2", "score": "1", "subreddit": "stockholm", "subreddit_id": "t5_2r7aq"}, {"author": "Kesoburk", "body": "I assume you mean Fågelsångsvägen in Gröndal? There are a few streets with the same name in a couple of surrounding municipalities.", "created_utc": "1560842859.0", "edited": "False", "id": "ergjutj", "is_submitter": "False", "link_id": "t3_c1vir4", "parent_id": "t3_c1vir4", "score": "1", "subreddit": "stockholm", "subreddit_id": "t5_2r7aq"}, {"author": "Kesoburk", "body": "Du kan inte tvätta längre. En svensk är inkapabel till att tvätta utan en blå IKEA-påse i högsta hugg. Sorry.", "created_utc": "1559898643.0", "edited": "False", "id": "eq9bu0u", "is_submitter": "False", "link_id": "t3_bxr3pu", "parent_id": "t3_bxr3pu", "score": "6", "subreddit": "swedishproblems", "subreddit_id": "t5_2vyct"}, {"author": "Kesoburk", "body": "mAn CoMmITts tRiPLe hOmiCiDE oN dEfEnDLeSs yOuTH", "created_utc": "1556618319.0", "edited": "False", "id": "em4krvf", "is_submitter": "False", "link_id": "t3_biy7vm", "parent_id": "t3_biy7vm", "score": "2", "subreddit": "PeopleFuckingDying", "subreddit_id": "t5_3blco"}, {"author": "Kesoburk", "body": "Unfortunately the situation is pretty terrible all over the Stockholm region. I used to live a good 35 minutes out of the city with commuter train, and even there it was difficult to get an affordable leasing contract.\n\nLiving 30-45 minutes away with commuter train (or about 60-75 minutes to Norrtälje with bus) is probably your best chance though, as these areas aren't as attractive on the market. However, most rentals for the entire Stockholm area are distributed through bostad.stockholm.se, where you need a crazy amount of years queuing basically no matter what. The municipalities with their own distributing systems located around the city are just about as hopeless, but it could be worth registering at and keeping an eye on the following:\n- haningebostader.se\n- knivstabostader.se\n- vasbyhem.se\n- nynasbo.se\n- habohus.se\n- upplands-brohus.se\n- roslagsbostader.se\n\nNo matter what you'd probably be luckier looking for something further away if you check private distributors like akelius.se or a sublet rental contract, but they're very expensive. Somebody already discussed the cons with renting a sublet so I'll point you back there. \n\nThe one thing I could maybe recommend is trying your luck in Uppsala or Strängnäs, which are not part of the Stockholm system. You need to queue for years there too, but I'd imagine it'd be easier to get your hands on a cheaper sublet rental or something from a private company there (can't guarantee this though). It's a lot further to the city, but with the national railway (SJ) you can buy a monthly pass that'll take you to Stockholm Central Station just under the hour. These passes are far more expensive than the regional passes for Stockholm, but it could be worth it as an emergency solution until you find something better.", "created_utc": "1554489276.0", "edited": "False", "id": "ek70wh0", "is_submitter": "False", "link_id": "t3_b9njv9", "parent_id": "t1_ek6ymds", "score": "3", "subreddit": "stockholm", "subreddit_id": "t5_2r7aq"}, {"author": "Kesoburk", "body": "That depends on the type of contract you get. In general, you get a lease for an unlimited amount of time until you or the landlord have a reason to cancel it (if it's just a normal contract there are certain regulations about this in the law etc). However, if you get a short term lease, which isn't all that uncommon, it can depend a lot on the contract itself. If it says one (or however many years), you're essentially evicted when time runs out. If it says one year with a possibility to renew you might be able to renew every year, or you might be able to renew for just one more year, or so. It's a lot more uncertain and it's very difficult to tell beforehand what your opportunities are and what might happen that could come between you and keeping the lease, I'm afraid. ", "created_utc": "1554486997.0", "edited": "False", "id": "ek6xevp", "is_submitter": "False", "link_id": "t3_b9njv9", "parent_id": "t1_ek6r36b", "score": "1", "subreddit": "stockholm", "subreddit_id": "t5_2r7aq"}, {"author": "Kesoburk", "body": "The most likely situation (unless your company owns a shit ton of apartments and can magically give you one or let you move around) is that if you get your hands on a first-hand rental contract, you've experienced a smaller miracle. Even outside the city center, in the surrounding municipalities, the rental situation is terrible. You'd need a good couple of years in their respective queue systems to get anything. You could try your luck with some private rental owners or renting second-hand from somebody, but the sheer amount of rent that you'd end up paying every month is usually unethically high.\n\nIf you look at every person living in a rental apartment in the Stockholm area, I don't think it's strange at all to stay 3+ years in the same place, considering how bad the situation is right now. If this company can somehow get you an apartment and you'd like to stay there 3+ years while you work for them, I couldn't imagine that'd be a problem.", "created_utc": "1554446121.0", "edited": "False", "id": "ek5s9f1", "is_submitter": "False", "link_id": "t3_b9njv9", "parent_id": "t3_b9njv9", "score": "2", "subreddit": "stockholm", "subreddit_id": "t5_2r7aq"}, {"author": "Kesoburk", "body": "Har ni inte lösgodis?! Norge måste vara förjävligt...", "created_utc": "1553423001.0", "edited": "False", "id": "ej99jow", "is_submitter": "False", "link_id": "t3_b4nkpa", "parent_id": "t3_b4nkpa", "score": "2", "subreddit": "norge", "subreddit_id": "t5_2qh94"}, {"author": "Kesoburk", "body": "Det här är pur ondska, tror inget i hela världen har mer kraft att traumatisera ett barn än Mårran", "created_utc": "1549139949.0", "edited": "False", "id": "efm39ue", "is_submitter": "False", "link_id": "t3_ameuzj", "parent_id": "t3_ameuzj", "score": "2", "subreddit": "sweden", "subreddit_id": "t5_2qofe"}, {"author": "Kesoburk", "body": "VA! Nu ger du mig adressen så jag kan gå och bränna ner den bedrövlighet till restaurang som har detta vedervärdiga påhitt på menyn", "created_utc": "1549102869.0", "edited": "False", "id": "efl159d", "is_submitter": "False", "link_id": "t3_9lgawx", "parent_id": "t1_efkztt6", "score": "9", "subreddit": "food", "subreddit_id": "t5_2qh55"}, {"author": "Kesoburk", "body": "Inte så långt från sanningen om man ska vara ärlig.", "created_utc": "1546812786.0", "edited": "False", "id": "edf6hgr", "is_submitter": "True", "link_id": "t3_ad5vcz", "parent_id": "t1_edf6f7z", "score": "7", "subreddit": "norge", "subreddit_id": "t5_2qh94"}, {"author": "Kesoburk", "body": "Det kallas \"deep-fried memes\". Steppa upp ert meme game nu.", "created_utc": "1546812678.0", "edited": "False", "id": "edf6ald", "is_submitter": "True", "link_id": "t3_ad5vcz", "parent_id": "t1_edf3q2v", "score": "11", "subreddit": "norge", "subreddit_id": "t5_2qh94"}, {"author": "Kesoburk", "body": "Tack!", "created_utc": "1546787215.0", "edited": "False", "id": "eddy7ae", "is_submitter": "True", "link_id": "t3_ad66w5", "parent_id": "t1_eddx4gr", "score": "4", "subreddit": "sweden", "subreddit_id": "t5_2qofe"}, {"author": "Kesoburk", "body": "Exakt. Full med tvätt. I tvättstugan.", "created_utc": "1545949164.0", "edited": "False", "id": "ecormhl", "is_submitter": "True", "link_id": "t3_a9y3ev", "parent_id": "t1_ecoord8", "score": "2", "subreddit": "sweden", "subreddit_id": "t5_2qofe"}, {"author": "Kesoburk", "body": "Bor på 18 kvm men har en sån här hängandes på en krok i badrummet. Funkar superbra och tar inte upp onödig plats på golvet!", "created_utc": "1545944653.0", "edited": "False", "id": "ecol4zn", "is_submitter": "True", "link_id": "t3_a9y3ev", "parent_id": "t1_ecofz76", "score": "2", "subreddit": "sweden", "subreddit_id": "t5_2qofe"}, {"author": "Kesoburk", "body": "Som u/davidow1 skrev:\n> Detta var en speciellt vanligt argumentation speciellt ca 2014, men förekommer än idag. Exempel är Reinfeldts \"Utan invandrare i Sverige existerar bara barbariet\", Schymans \"det är samma kultur hos talibanerna som i Sverige (ca 2010) samt Ingrid Lomfors'\" det finns ingen inhemsk svensk kultur\".\n\n", "created_utc": "1545929257.0", "edited": "False", "id": "eco1yno", "is_submitter": "True", "link_id": "t3_a9y3ev", "parent_id": "t1_eco0yq3", "score": "2", "subreddit": "sweden", "subreddit_id": "t5_2qofe"}, {"author": "Kesoburk", "body": "Haha, vasst! Det jag framför är min generella uppfattning om ämnet, som såklart påverkats av diverse nyheter, artiklar, Twitter-feed, politiskt intresserade bekanta och dylikt. Det är tyvärr ganska svårt att ha länkar i huvudet eller googla fram det jag letar efter med generella sökord, vilket jag inte tror att jag är ensam om att tycka.\n\nAtt säga att vänstern inte tycker att Sverige har någon kultur stämmer såklart inte, och jag menar på fullaste allvar självklart inte att varje ledare på Aftonbladet säger så heller, även om Aftonbladet generellt sätt är vänster. Det här härstammar i att Aftonbladet är lite vänster och att den här typen av åsikt tenderar att komma från vänsterhållet. Det är såklart också en stereotyp, men den bekräftas lite då och då varpå jag brukar kunna lyckas använda detta för komisk effekt. \n\nI grund och botten var detta en skämtsam kommentar på en skämtsam post. Jag tar inte mig själv på speciellt stort allvar ändå. Diskuterar gärna mer ang. vad som är svensk kultur, men då tror jag att konversationen bör flyttas till r/svenskpolitik istället 😉", "created_utc": "1545926300.0", "edited": "False", "id": "ecnxtba", "is_submitter": "True", "link_id": "t3_a9y3ev", "parent_id": "t1_ecnw3b0", "score": "9", "subreddit": "sweden", "subreddit_id": "t5_2qofe"}, {"author": "Kesoburk", "body": "Visst är jag mer höger än vänster! Men att \"det står på Aftonbladets ledarsida\" använder jag som ett skämt när något är lite vänster just för att Aftonbladet är en socialdemokratisk tidning. På precis samma sätt är SvD en moderat tidning där man ibland kan läsa en hel del skojigt från riktiga högertomtar, varpå de också kan få sig en känga. Just i detta fall handlade det dock om något som i min erfarenhet oftare lyfts av vänstern, eftersom högern tenderar att vara större \"traditionalister\" som \"värnar om kulturen\". ", "created_utc": "1545925372.0", "edited": "False", "id": "ecnwdd7", "is_submitter": "True", "link_id": "t3_a9y3ev", "parent_id": "t1_ecnu5rm", "score": "2", "subreddit": "sweden", "subreddit_id": "t5_2qofe"}, {"author": "Kesoburk", "body": "Attans, försökte använda hyperbol för att vara lite komisk men du har visst synat mig. Schack matt.\n\nNejmen detta är såklart en överdrift. Hur som helst har det yttrats åtskilliga gånger, av bl.a. Mona Sahlin, Fredrik Reinfeldt och Ingrid Lomfors, att \"svensk kultur\" inte finns. För den som hänger på Twitter är det inte ett okänt fenomen att höra att \"Sveriges kultur är byggd på andra kulturer, varpå vi inte har någon egen\". Såg att någon redan gjort en kommentar om detta tidigare i den här tråden, så hänvisar dit.\n\nDet har även nyligen blossat upp angående den \"svenska julen\" efter att Åhléns postade en bild, eftersom där antydes att \"svensk jul\" inte är så svensk:  https://www.facebook.com/ahlens/posts/10157141838588338\n\nMer om \"svensk jul\": https://www.expressen.se/omtalat/livet/8-anledningar-till-att-var-jul-ar-allt-annat-an-en-svensk-tradition-/", "created_utc": "1545924677.0", "edited": "False", "id": "ecnvbtt", "is_submitter": "True", "link_id": "t3_a9y3ev", "parent_id": "t1_ecnqwmn", "score": "10", "subreddit": "sweden", "subreddit_id": "t5_2qofe"}, {"author": "Kesoburk", "body": "Blev jag just kallad alt-right?", "created_utc": "1545920056.0", "edited": "False", "id": "ecnorn7", "is_submitter": "True", "link_id": "t3_a9y3ev", "parent_id": "t1_ecnhan5", "score": "5", "subreddit": "sweden", "subreddit_id": "t5_2qofe"}, {"author": "Kesoburk", "body": "Tillsammans kan vi få hela världen att använda IKEA-påsar till tvättstugan.\n\n[https://imgur.com/a/V7t46GY](https://imgur.com/a/V7t46GY)", "created_utc": "1545920031.0", "edited": "False", "id": "ecnoqh7", "is_submitter": "True", "link_id": "t3_a9y3ev", "parent_id": "t1_ecnoec6", "score": "11", "subreddit": "sweden", "subreddit_id": "t5_2qofe"}, {"author": "Kesoburk", "body": "Populärt påstående i debatten sedan ett par år tillbaka, läs valfri politisk ledare på Aftonbladet ", "created_utc": "1545915787.0", "edited": "False", "id": "ecnk5o2", "is_submitter": "True", "link_id": "t3_a9y3ev", "parent_id": "t1_ecnj862", "score": "28", "subreddit": "sweden", "subreddit_id": "t5_2qofe"}, {"author": "Kesoburk", "body": "Jag vågar påstå att jag har förståelse för situationen. Jag hade problem med min identitet när jag var i 14-16-årsåldern eftersom jag kände att jag som kvinna identifierade mer med traditionellt manliga uttryck och beteenden. Jag var ett tag övertygad om att detta betydde att jag fötts i fel kropp och jag hade ganska allvarlig dysfori. \n\nMen vad betyder det att vara man eller kvinna? Hur \"vet\" man? Att göra kopplingen att traditionellt manliga uttryck och utseende innebär att \"jag måste vara man\" låter onekligen märkligt. Jag menar inte att *detta* enbart ligger till grund för en uppfattning av ens kön, men min erfarenhet är att jag kände att jag generellt sett förde mig, betedde mig och identifierade mer med mina manliga bekanta än mina kvinnliga bekanta. Jag \"bara visste\" när jag var 15, något som jag i nuläget - 4 år senare - bestrider grovt. Nu, 19 år gammal, har insikten slagit mig att jag är född till kvinna, rent biologiskt, men att jag kanske inte beter mig eller för mig i full enlighet med vad som är \"kvinnligt\". Och då får det vara så. Om kön ändå är en social konstruktion finns ingen anledning för mig att se ut på ett visst sätt, för det är ju de facto fejk i alla fall. Det handlar bara om beteende på individnivå, inte det ena eller det andra (manligt/kvinnligt).\n\nJag tror därmed att det även är onekligen möjligt att en inte obetydlig del av dessa *minderåriga barn* (för det är vad de är i lagens mening) inte är fullt medvetna om vad det innebär att \"bara veta\" och vad detta har för konsekvenser som kan vara omöjliga att återställa om de, liksom jag, senare gör en upptäckt om den egna identiteten som ändrar allt. \n\nSå misstolka mig rätt, jag menar inte att detta  omfattar alla minderåriga med könsdysfori. Hur som helst kommer den att omfatta människor, och att låta 15-åringar ta oåterkalleliga beslut när de samtidigt inte tillåts antingen rösta eller dömas lika hårt för brott som en vuxen är för mig mycket motstridigt. Att göra ett ingrepp som 18-årig är en sak, för då bestämmer man helt och hållet över den egna kroppen och vad man gör med den. Men till dess bör man inte peta i den här typen av bestämmelser överhuvudtaget, och *absolut* inte när föräldrarna kan vara helt omedvetna om beslutet.", "created_utc": "1544193835.0", "edited": "False", "id": "ebah176", "is_submitter": "True", "link_id": "t3_a3zzpw", "parent_id": "t1_ebaejyh", "score": "9", "subreddit": "svenskpolitik", "subreddit_id": "t5_2twun"}, {"author": "Kesoburk", "body": "Det här var äckligt smart, såg samma sak och blev lika förbannad att jag tänkte posta om det. Lösningen är helt klart planekonomi.", "created_utc": "1542904969.0", "edited": "False", "id": "ea8rowz", "is_submitter": "False", "link_id": "t3_9ze7nx", "parent_id": "t1_ea8gom4", "score": "30", "subreddit": "sweden", "subreddit_id": "t5_2qofe"}, {"author": "Kesoburk", "body": "Tack som fan! Nu ser vi till att rätt sida vinner detta.", "created_utc": "1540245570.0", "edited": "False", "id": "e89fmpc", "is_submitter": "True", "link_id": "t3_9qig96", "parent_id": "t1_e89fht8", "score": "2", "subreddit": "sweden", "subreddit_id": "t5_2qofe"}, {"author": "Kesoburk", "body": "Uppskattat initiativ! Har tänkt att något sådant här borde man ha när man står där och chansar och hamnar på helt fel sida av perrongen, men har inte varit tillräckligt tekniskt begåvad för att göra något åt saken. Tack som fan med andra ord!", "created_utc": "1537828241.0", "edited": "False", "id": "e6krfiw", "is_submitter": "False", "link_id": "t3_9ikifg", "parent_id": "t3_9ikifg", "score": "4", "subreddit": "stockholm", "subreddit_id": "t5_2r7aq"}, {"author": "Kesoburk", "body": "Beror på dina ambitioner. Alla företag/bolag/myndigheter behöver jurister och det är ett yrke som förmodligen inte kommer bli övertaget av robotar inom en snar framtid. I princip alla som går ut får jobb, men är du inte speciellt ambitiös är det mycket möjligt att du får börja på något myndighetskontor i en mindre stad. Vill du det så är det väl inget problem, dock. Alumner från Uppsala/Stockholm/Lund med höga betyg är de som har störst chans att jobba på de finare byråerna i storstäderna, och om du bara klarar dig med nöd och näppe kommer du också ha svårare att få sitta ting. Så, som sagt, det är en fråga om vad du vill och om du är redo att kämpa för det.", "created_utc": "1537689625.0", "edited": "False", "id": "e6haeyr", "is_submitter": "False", "link_id": "t3_9i384r", "parent_id": "t3_9i384r", "score": "1", "subreddit": "sweden", "subreddit_id": "t5_2qofe"}, {"author": "Kesoburk", "body": "Snyggt byggt, fräsig kärra!", "created_utc": "1537688842.0", "edited": "False", "id": "e6ha1r6", "is_submitter": "False", "link_id": "t3_9hzda9", "parent_id": "t3_9hzda9", "score": "3", "subreddit": "sweden", "subreddit_id": "t5_2qofe"}, {"author": "Kesoburk", "body": "OP ser grabb han kände i nian med en potentiell flickvän, ska hälsa. Cyklar förbi. OP har solglasögon på sig och förlorar ögonkontakten med grabben. OP säger \"very nice\". OP har i princip catcalled tjejen (av misstag).", "created_utc": "1536042039.0", "edited": "1536049682.0", "id": "e5d36mj", "is_submitter": "False", "link_id": "t3_9csgoo", "parent_id": "t1_e5d2pez", "score": "34", "subreddit": "swedishproblems", "subreddit_id": "t5_2vyct"}, {"author": "Kesoburk", "body": "Det ska vara riktig för fan. Lita inte på detta svek till Oboy, smakar som solljummen pucko som någon råkat tappa i diskhon. Gör om, gör rätt.", "created_utc": "1535846594.0", "edited": "False", "id": "e58o4t8", "is_submitter": "False", "link_id": "t3_9c5cim", "parent_id": "t3_9c5cim", "score": "3", "subreddit": "sweden", "subreddit_id": "t5_2qofe"}, {"author": "Kesoburk", "body": "Why would you say something so brave yet so controversial?", "created_utc": "1535792418.0", "edited": "False", "id": "e57cc84", "is_submitter": "False", "link_id": "t3_9c159a", "parent_id": "t3_9c159a", "score": "34", "subreddit": "sweden", "subreddit_id": "t5_2qofe"}, {"author": "Kesoburk", "body": "Kalla mig höger men vissa grejer på den här listan är snarare sorg- än glädjebesked.", "created_utc": "1535672611.0", "edited": "False", "id": "e54jjme", "is_submitter": "False", "link_id": "t3_9bok80", "parent_id": "t3_9bok80", "score": "32", "subreddit": "svenskpolitik", "subreddit_id": "t5_2twun"}, {"author": "Kesoburk", "body": "Vilken utur", "created_utc": "1534085006.0", "edited": "False", "id": "e426sq6", "is_submitter": "False", "link_id": "t3_96p76m", "parent_id": "t3_96p76m", "score": "150", "subreddit": "sweden", "subreddit_id": "t5_2qofe"}]