[{"author": "Krkboy", "body": "I really wish there were more comments like this. One big upvote for you!", "created_utc": "1666946035.0", "edited": "False", "id": "iu3k8ai", "is_submitter": "False", "link_id": "t3_yf9zfo", "parent_id": "t1_iu3gks4", "score": "1", "subreddit": "japanlife", "subreddit_id": "t5_2rg2o"}, {"author": "Krkboy", "body": "It's very much not outdated. I've also just been back to the UK after 3 years away, and I was shocked by the poor quality of supermarket food and how rich/salty/heavy/full of preservatives everything is. Never had so many Gaviscon tablets in my life. Eating out has also got incredibly expensive.", "created_utc": "1666945867.0", "edited": "False", "id": "iu3k1di", "is_submitter": "False", "link_id": "t3_yf9zfo", "parent_id": "t1_iu3fr7j", "score": "1", "subreddit": "japanlife", "subreddit_id": "t5_2rg2o"}, {"author": "Krkboy", "body": "Of course you can still be a proficient speaker! And no, it wouldn't bother me at all. Przecież nie przeszkadzałoby Ci to, gdybyś rozmawiał(a) z obcokrajowcem po polsku, prawda? ;)", "created_utc": "1666556933.0", "edited": "False", "id": "iti3xzj", "is_submitter": "False", "link_id": "t3_yadxjy", "parent_id": "t1_itdmmql", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Krkboy", "body": "I hope this doesn't sounds patronising in anyway, but one of the most important things I've found in language learning is humility. Native speakers have spent 1000s of hours not only immersed in the language but schooled in it. In the UK school is from 5-18: that's 14 years of having studying a multitude of topics and having our English corrected and re-moulded by our teachers. It's very very hard to catch up on this as an adult non-native speaker. Of course you'll be miles behind - how could it be otherwise? There are a few people who manage to cover this ground as an adult, but ask yourself, is it worth it? There are plenty of people who speak English fluently but aren't as 'good' as natives.\n\nIt's a bit like me starting the piano in my 20s and comparing myself to people who started when they were 5.. it's hardly a fair comparison. Certainly nothing to feel shameful about. \n\nI was the opposite of you in that I learnt Polish as an English native. And I'll most likely never have the same level of Polish (intuition, verbal fluency, word choices etc.) as you but it's hardly a fair comparison given that all my formative education/experiences/books/relationship were all in English. Give yourself a break :)", "created_utc": "1666457285.0", "edited": "False", "id": "itclscc", "is_submitter": "False", "link_id": "t3_yadxjy", "parent_id": "t3_yadxjy", "score": "10", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Krkboy", "body": "Although neither English nor Polish are what you might call diaglossic languages, having read books in both, I do find literary Polish to depart more from everyday spoken language than literary English. It's a lot more conservative and, well, heavy. So there's that. \n\nThere is also the tendency for many Poles to think that Polish is an intrinsically more complicated language than English. Objectively speaking this isn't true at all, but it's often the case that as L2 speakers, Poles don't know the obscure words and archaic literary styles in English. That doesn't mean they don't exist. \n\nIt may also be selection bias i.e. you may just like English more, and therefore tell yourself that it's easier, when it may just be that you want that to be true.", "created_utc": "1665165101.0", "edited": "False", "id": "irfg3f0", "is_submitter": "False", "link_id": "t3_xy1sxj", "parent_id": "t3_xy1sxj", "score": "8", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Krkboy", "body": "Fawlty towers. I'm a massive fan of this show and will always love it, but there's quite a lot of domestic violence towards Basil from his wife. He gets punched, kicked, beaten with an umbrella multiple times and we're supposed to laugh. There are references to severe beatings off camera as well. And yet, if it was him hitting her there would be an outrage.", "created_utc": "1665146291.0", "edited": "False", "id": "irec1hj", "is_submitter": "False", "link_id": "t3_xxe8lv", "parent_id": "t3_xxe8lv", "score": "0", "subreddit": "AskUK", "subreddit_id": "t5_2t4s3"}, {"author": "Krkboy", "body": "I mean, to continue progressing at advanced level you really need to be doing a lot between lessons anyway of your own volition. If she can't even make time for homework, then there really is only so much you can offer as a teacher.", "created_utc": "1665003507.0", "edited": "False", "id": "ir78cbs", "is_submitter": "False", "link_id": "t3_xwe4qg", "parent_id": "t1_ir6pqjo", "score": "7", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Krkboy", "body": "At C1/C2 level, most students can communicate without too many problems already, so you really have to hunt for areas of unknown language.\n\n* Get her to describe pictures on random topics (be really picky about vocabulary/phrasing)\n* Get her to summarise an article orally, then discuss\n* Get her to write in various formats. Most foreigners tend to be much weaker at writing than speaking\n* Get her to define words and idioms\n* Ask her do watch something in her native language (or perhaps something from her childhood) and explain it to you in English. Explaining her culture to you might work too \n* Get her to watch and comment on talk shows, with many native speakers all talking over each other", "created_utc": "1664994252.0", "edited": "False", "id": "ir6jxn2", "is_submitter": "False", "link_id": "t3_xwe4qg", "parent_id": "t3_xwe4qg", "score": "14", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Krkboy", "body": "I did the course last year. I didn't find it particularly useful or helpful, if I'm honest. But I had to complete it so I just did the end of unit test each month and didn't bother with the rest. Lots of people I know have done that too. Maybe try that?", "created_utc": "1664992132.0", "edited": "False", "id": "ir6eglq", "is_submitter": "False", "link_id": "t3_xw3302", "parent_id": "t3_xw3302", "score": "2", "subreddit": "JETProgramme", "subreddit_id": "t5_2w9xe"}, {"author": "Krkboy", "body": "I wouldn't bother with the bucket. Might burst into tears at the end though.", "created_utc": "1664389446.0", "edited": "False", "id": "iq9mfit", "is_submitter": "False", "link_id": "t3_xqcju9", "parent_id": "t1_iq96o9h", "score": "1", "subreddit": "AskUK", "subreddit_id": "t5_2t4s3"}, {"author": "Krkboy", "body": "I know that I don't really need to offer a comment here, but I think I can relate as a white long-term resident in Japan, and also knowing several people who grew up here with European parents, but who are - to all intents and purposes - Japanese.\n\n>You belong to the world and are from the world. \n\nI definitely can understand this way of thinking but I think it's fair to say that most people don't think this way. Most people identify with a specific place/country/language. And rightly or wrongly, people who look or sound different to the majority will probably be asked about their origins. It's kind of human nature. Is it always appropriate, definitely not. Will it stop any time soon, also probably not. \n\nWhat my colleagues in Japan had to do was make peace with it, and find a way to live with it. They just say \"my parents are French/American etc. but I was born and raised here\", then everyone just nods and gets on with their day. It takes 10 seconds, and then people move on. However angry it makes you, the questions aren't going to stop. Best to just accept and make peace with it for the sake of your own well-being. You can't educate everyone you come across after all.", "created_utc": "1664380705.0", "edited": "False", "id": "iq8zw2h", "is_submitter": "False", "link_id": "t3_xpu64q", "parent_id": "t1_iq8dhis", "score": "1", "subreddit": "AskUK", "subreddit_id": "t5_2t4s3"}, {"author": "Krkboy", "body": "Yeah, a compromise is probably the best way forward. English only in class, Japanese outside of class (unless a student wants to speak English of course).  Apart from English classes, your school life is 100% in Japanese so if you want to integrate then Japanese is the way forward. \n\nAs someone else said, you're living in a foreign Japanese-speaking community and you want to become part of the community. Most teachers don't understand what this feels like. Additionally, programmes like JET are all about international exchange so it seems just a reasonable to want to become part of school life in Japanese, as it is for you to teach them English. \n\nThis is how I've been teaching for 5+ years anyway.", "created_utc": "1664347530.0", "edited": "False", "id": "iq7ghzg", "is_submitter": "False", "link_id": "t3_xph9pt", "parent_id": "t1_iq66yvx", "score": "2", "subreddit": "JETProgramme", "subreddit_id": "t5_2w9xe"}, {"author": "Krkboy", "body": "Personally, I think cultural identity isn't just what you consider yourself but much more how you're viewed by others in that culture. \n\nAt 15, you probably already had a foreign accent and will have different cultural norms to someone born and raised here. So people meeting you for the first time might assume that you aren't British. \n\nBut if you're transparent and say \"I'm originally from India but I moved here as a teenager and am a British citizen\", then 99% of people will think, \"cool, nice to meet you\". And get on with their day. \n\nIf you try and act as though you were born and raised here, while sounding/acting foreign, then it might come across as a bit dishonest. I had a Polish colleague who naturalised and considered herself 100% English, and completely denied having anything to do with Poland. Even though she has a noticeable foreign accent. People found it a bit odd. She would have had a much easier time (and integrated better) saying she was originally from Poland but had naturalised and considered the UK her home. \n\nUltimately, everyone has their story and reasons for identifying as xyz but in any country there are socio-cultural norms, and it's best to find out what they are and fit in as best you can. \n\nFor me personally, I would consider you British of Indian origin. Not quite the same British as me (born and raised) but definitely a fellow citizen. I would think the average person would find your background quite interesting!", "created_utc": "1664318696.0", "edited": "False", "id": "iq5z89e", "is_submitter": "False", "link_id": "t3_xpu64q", "parent_id": "t3_xpu64q", "score": "6", "subreddit": "AskUK", "subreddit_id": "t5_2t4s3"}, {"author": "Krkboy", "body": "Obviously use English as much as possible during class but if you speak Japanese, hang out with them in Japanese outside of class/during clubs. Once you they can actually speak normally in their native language you can get a much deeper bond and this can translate back into the classroom too. \n\nIf you only chat with students who can/want to have full conversations in English then it does tend to leave out the majority of the students in many schools.", "created_utc": "1664315496.0", "edited": "False", "id": "iq5rx68", "is_submitter": "False", "link_id": "t3_xph9pt", "parent_id": "t3_xph9pt", "score": "8", "subreddit": "JETProgramme", "subreddit_id": "t5_2w9xe"}, {"author": "Krkboy", "body": ">And I've never debated that...\n\nYou kind of have. This entire comment section is about people who weren't polite about people's language attempts. The question is titled \"what are your **worst** encounters?\" Yet you, for some reason, decided to say they weren't being arseholes and it was somehow the customers fault for not being aware enough...\n\nThey definitely were being arseholes.\n\n>They can switch without being rude\n\nFinally.", "created_utc": "1663075812.0", "edited": "1663076171.0", "id": "io973lz", "is_submitter": "False", "link_id": "t3_xcp40c", "parent_id": "t1_io92v5d", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Krkboy", "body": ">That's such an American and entitled thing to say!\n\nI think someone needs to go and revise their world flags..\n\n>Why don't you ask the waiter to sing you the menu? Or a cute waitress to show you her boobs while collecting your order then?\n\nBecause, unless I go to a very *specific* establishment, those are not part of a waiter's job description. Customer satisfaction and manners are. This really isn't difficult to understand.\n\n>You can choose the language, and they're allowed to switch to get things moving along if it takes you 2 minutes to order a beer.\n\nI suggest you re-read the original post, and the comments of others. We're not talking about switching to English to speed things up. We're talking about being actively rude and ridiculing people's language attempts. That's bad manners at the best of times, but particularly in a customer service role. \n\nYou're embarrassing yourself at this point, mate.", "created_utc": "1663073641.0", "edited": "False", "id": "io923yy", "is_submitter": "False", "link_id": "t3_xcp40c", "parent_id": "t1_io90pnu", "score": "5", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Krkboy", "body": ">I’ll do the passive aggressive way and say to the person “あ、ごめん。聞こえなかった。もう一度お願いします”. They’ll usually direct they’re gaze at me from that point.\n\nThis is really good answer. I'll definitely give this one a try!", "created_utc": "1663066526.0", "edited": "False", "id": "io8pc44", "is_submitter": "False", "link_id": "t3_xd46d0", "parent_id": "t1_io8oz88", "score": "17", "subreddit": "japanlife", "subreddit_id": "t5_2rg2o"}, {"author": "Krkboy", "body": "No, a waiter is not just there to bring food, they are there to provide customer service. If  the customer is taking too long with their order, or keep changing it, can they roll their eyes and laugh because it's 'inefficient'? Not if they want to keep their job. \n\nAs the customer, I decide what language I want to use. It's a hierarchical relationship. I'm not asking for grammar explanations or tutoring. \n\nAgain, patience and good manners cost nothing.", "created_utc": "1663063042.0", "edited": "False", "id": "io8klzj", "is_submitter": "False", "link_id": "t3_xcp40c", "parent_id": "t1_io8i4ce", "score": "4", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Krkboy", "body": ">How so? It sorts of debunks the myth of \"learn one, speak all\" about Scandinavian languages. And it was about a bad interaction, not through anyone's fault or malice.\n\nBecause other people here have put effort into learning their TL, and were met with rudeness. You're not even learning Danish so your experience isn't comparable.\n\n>Oh no you don't if you inconvenience anyone else.\n\nThat's not how the service industry works; customer satisfaction is the cornerstone of any decent business. Efficiency does not come at the expense of the customer's feelings or the worker's personal inconvenience.\n\n>Isn't trying to speak a language you're clearly not that good at, and expecting others to cater to your needs just as rude?\n\nI hope you seriously don't consider speaking a language haltingly to a busy waiter to be equal to eye rolling and ridicule. What an embarrassing thing to say.\n\nArseholes are arseholes, and patience and manners cost nothing.", "created_utc": "1663059246.0", "edited": "False", "id": "io8g665", "is_submitter": "False", "link_id": "t3_xcp40c", "parent_id": "t1_io8f1tc", "score": "4", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Krkboy", "body": "Well, if you're not learning Danish then your comment to a language learning thread is, at best, irrelevant.\n\nIf you're a customer in a shop or restaurant, then the customer decides the language of transaction. Customer service certainly doesn't include rolling your eyes or laughing at a customer for their language proficiency, no matter how busy they are. It seems odd for your to seemingly be defending their rude behaviour on account of efficiency.", "created_utc": "1663057774.0", "edited": "False", "id": "io8eih0", "is_submitter": "False", "link_id": "t3_xcp40c", "parent_id": "t1_io8dakt", "score": "13", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Krkboy", "body": " *Why waste time and effort for a sloppy outcome?*\n\nBecause if you don't push yourself and get out of your comfort zone to practise, you'll never stop being sloppy.", "created_utc": "1663055976.0", "edited": "False", "id": "io8cgpn", "is_submitter": "False", "link_id": "t3_xcp40c", "parent_id": "t1_io89fj8", "score": "11", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Krkboy", "body": "This isn't true at all. Most of the JETs in my first and current placement were/are reasonably fluent in Japanese and all the teachers were extremely grateful for it. The first question they all asked was \"does the next person speak Japanese?\". If you are rural and at ES/JHS then 'all English' just isn't feasible at all with most people. \n\nThe whole point of the programme is internationalisation, and English is only one part of that. If you can't communicate with one another, you can't really teach each other about your respective cultures. \n\nTo the OP - the more Japanese you know, the better your time in Japan will be, and the better your life at school will be.", "created_utc": "1662977085.0", "edited": "False", "id": "io3s7ti", "is_submitter": "False", "link_id": "t3_xc4793", "parent_id": "t1_io390p3", "score": "7", "subreddit": "JETProgramme", "subreddit_id": "t5_2w9xe"}, {"author": "Krkboy", "body": "It's worth bearing in mind that in the whole scheme of things, N1 level Japanese isn't really that high. \n\nN1 is the minimum you need to live and work in Japan independently. For people that say N2 is fine: N2 requires 'only' 1000 kanji. That's what Japanese children learn in ES. \n\nWhen I passed N1 I decided to join my JHS kokugo class, and I was already out of my depth at 2nd grade - that's the level of a 14 year old Japanese child. \n\nI did an internship in a Japanese company in Tokyo last year (just after N1) and I could only just keep up with all the emails and meetings etc. For comparison's sake, I'm comfortable watching TV and reading novels.\n\nSo, to answer your question: N1 is really the starting line to live and work in Japan as a fully independent and competent speaker.", "created_utc": "1662948941.0", "edited": "False", "id": "io2npbh", "is_submitter": "False", "link_id": "t3_xbx5eq", "parent_id": "t3_xbx5eq", "score": "4", "subreddit": "LearnJapanese", "subreddit_id": "t5_2qyls"}, {"author": "Krkboy", "body": "For spoken English, go with what everyone else says. But personally I never write these forms, even on social media, as it looks sloppy and uneducated. Many foreigners over-use these forms (like wanna, gonna etc.) in order to sound more natural/native and it has the opposite effect.", "created_utc": "1662936859.0", "edited": "False", "id": "io1x6e8", "is_submitter": "False", "link_id": "t3_xbvja0", "parent_id": "t3_xbvja0", "score": "26", "subreddit": "EnglishLearning", "subreddit_id": "t5_2u8ap"}, {"author": "Krkboy", "body": "Yes, but it's more indirect, polite and slightly formal.", "created_utc": "1662936538.0", "edited": "False", "id": "io1weep", "is_submitter": "False", "link_id": "t3_xbkied", "parent_id": "t1_io1vw3v", "score": "4", "subreddit": "EnglishLearning", "subreddit_id": "t5_2u8ap"}, {"author": "Krkboy", "body": "A British child may watch American movies, but they'll spend most of their waking day at school where everyone speaks a form of British English. Plus their family and friends (i.e. any social interaction) will be in British English. Thus the accent sticks. Once you're in your teens, it might weaken if you move away but it'll never go away completely. I moved away from Gloucestershire when I was 6, and I still have a slight accent from there, particularly with my family or if I'm tired/pissed off/laughing.\n\nIt's the same as the critical period when learning at foreign language. Past the age of 6/7 (give or take for some people), your accent will never go away completely. It's no different with varieties of the same language. \n\nIt might not be the case any more but my teachers (particularly English teachers) and my parents used to correct any Americanism that I'd picked up from Sabrina the Teenage Witch or whatever but I can only remember this happening a few times. This had nothing to do with accent though.", "created_utc": "1662917057.0", "edited": "False", "id": "io0frmo", "is_submitter": "False", "link_id": "t3_xbju05", "parent_id": "t3_xbju05", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Krkboy", "body": "Wow, that hit me hard. But it was strangely insightful.", "created_utc": "1662909011.0", "edited": "False", "id": "inzvio6", "is_submitter": "False", "link_id": "t3_xbi6cm", "parent_id": "t1_inzrhfy", "score": "10", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Krkboy", "body": "The phrasing itself is a bit unnatural. \n\n\"My late Grandfather got married five times.\"\n\n\"My Grandfather had been married five times before he died.\"", "created_utc": "1662908699.0", "edited": "False", "id": "inzur89", "is_submitter": "False", "link_id": "t3_xbkied", "parent_id": "t3_xbkied", "score": "25", "subreddit": "EnglishLearning", "subreddit_id": "t5_2u8ap"}, {"author": "Krkboy", "body": "Reading: pretty much all of them\n\nWriting: up to grade 6(ish)", "created_utc": "1662733691.0", "edited": "False", "id": "inqb9uy", "is_submitter": "False", "link_id": "t3_x9uuah", "parent_id": "t3_x9uuah", "score": "2", "subreddit": "LearnJapanese", "subreddit_id": "t5_2qyls"}, {"author": "Krkboy", "body": "Ignore some of the preachy comments on here. I think I know what you're getting at. \n\nFor getting a good neutral dialect (pitch accent, vocab etc.) basically anywhere **between Tokyo and Nagoya** will be good. **Hokkaido** is pretty neutral as well, as it's not historically part of Japan so many people moved there from all over. \n\nIf you head west **from Hiroshima to about Kumamoto,** then you'll also be surrounded by Japanese that doesn't stray too far from standard (Tokyo) Japanese. \n\nKansai Japanese is cool, but the pitch accent is quite different and the dialect is quite distinctive. Kagoshima and the Tohoku region are quite dialect heavy as well (though less so in the cities). Most people in Okinawa speak standard Japanese, especially younger people. \n\nHaving said that, most younger people/educators/city dwellers all over Japan don't have too much of a regional accent. There are dialects in every region, but it's mostly confined to the pre-war generation or people raised by their grandparents in rural areas. Even then people tend to lose it when they move to bigger cities. Many Japanese people my age (30s) remember speaking dialect as children but now speak region-less Japanese as adults. I live in rural west Japan and even though I have picked up some dialect traits here and there, it's tiny and I can lose it if I need too (at work, formal situations). \n\nEven in Tokyo the level of English is really low. I wouldn't worry. Just be proactive and insistent on using Japanese and you'll be fine.", "created_utc": "1662708167.0", "edited": "False", "id": "inp60qu", "is_submitter": "False", "link_id": "t3_x9fr5j", "parent_id": "t3_x9fr5j", "score": "3", "subreddit": "LearnJapanese", "subreddit_id": "t5_2qyls"}, {"author": "Krkboy", "body": "Like a few other people have said, the most common thing is for you to keep you name and put it in katakana.\n\nGiving yourself a new name in a new culture is a bit of a tricky thing. I personally find it odd in Europe when people from say, Poland, introduce themselves as \"Kate\" or \"Mark\", when they're actually called \"Kasia\" or \"Marek\". And if I Japanese person introduced themselves as \"Thomas\" or \"Emma\", part of me (inside) would probably giggle. I think it comes across as a bit trying-too-hard, and inauthentic.\n\nHowever, if someone from Japan or Poland were to live in, say, the UK for many years and were fully integrated and being English was part of their identity, then why not? Becoming part of a culture takes time and effort, and I think names should reflect that.\n\nFor me personally, as non-Japanese in Japan, I would only change my surname to a Japanese one if I became Japanese through naturalisation, my first name I would just choose a kanji for. Apart from anything else, **every** Japanese person you meet will ask you why you have a Japanese name (if you're not visibly Japanese). Unless you have a quick concrete answer (e.g. my husband/wife is Japanese, I'm Japanese by nationality), you'll probably come across as someone trying too hard, and a bit of a nutter.", "created_utc": "1662469672.0", "edited": "1662470191.0", "id": "inb5b2y", "is_submitter": "False", "link_id": "t3_wye8da", "parent_id": "t3_wye8da", "score": "1", "subreddit": "ajatt", "subreddit_id": "t5_dw44m"}, {"author": "Krkboy", "body": "This is interesting. So would an able Greek high school student have a higher reading ability that university professors in the UK/Europe/USA etc.?", "created_utc": "1662300812.0", "edited": "False", "id": "in21cks", "is_submitter": "False", "link_id": "t3_x554oh", "parent_id": "t1_in11a2u", "score": "2", "subreddit": "AncientGreek", "subreddit_id": "t5_2qwux"}, {"author": "Krkboy", "body": "Those look really good; thanks for your help! Have you tried shadowing these guys, or just using them for immersion?", "created_utc": "1662124183.0", "edited": "False", "id": "imsj81q", "is_submitter": "True", "link_id": "t3_x3zgii", "parent_id": "t1_imsio46", "score": "1", "subreddit": "LearnJapanese", "subreddit_id": "t5_2qyls"}, {"author": "Krkboy", "body": "Yeah, I'd consider myself pretty fluent, I'd just like to improve my pronunciation/become more articulate really. Do you have any youtube recommendations?", "created_utc": "1662123425.0", "edited": "False", "id": "imshlou", "is_submitter": "True", "link_id": "t3_x3zgii", "parent_id": "t1_imsg7uw", "score": "2", "subreddit": "LearnJapanese", "subreddit_id": "t5_2qyls"}, {"author": "Krkboy", "body": "Yeah, that's definitely true. I've been living and working in Japanese for 5 years now and I have a Japanese partner though, so the culture/communication style aspect doesn't concern me so much. \n\n*I think Dogen is just saying a thing he happened to do, he's not passing it off as some sage advice you have to follow.*\n\nWhat I've detailed above is exactly what he recommends on his Patreon account.", "created_utc": "1662122261.0", "edited": "False", "id": "imsf6mv", "is_submitter": "True", "link_id": "t3_x3zgii", "parent_id": "t1_imse9l2", "score": "3", "subreddit": "LearnJapanese", "subreddit_id": "t5_2qyls"}, {"author": "Krkboy", "body": "So is it safe to assume that if a foreigners speaks decent Norwegian with a good accent that most Norwegians will happily speak the language in all circumstances?", "created_utc": "1662116272.0", "edited": "False", "id": "ims4j2d", "is_submitter": "False", "link_id": "t3_x0ozvg", "parent_id": "t1_ims1x2n", "score": "1", "subreddit": "norsk", "subreddit_id": "t5_2uhx1"}, {"author": "Krkboy", "body": "I'm not sure about Norwegian social norms regarding directness, but would it be permissible to say something like (in Norwegian), \"it's ok, I understand Norwegian well\", or \"it's ok, you can reply in Norwegian\", and then carry on in Norwegian?", "created_utc": "1661919577.0", "edited": "False", "id": "imhd50i", "is_submitter": "False", "link_id": "t3_x0ozvg", "parent_id": "t1_imeqe1i", "score": "2", "subreddit": "norsk", "subreddit_id": "t5_2uhx1"}, {"author": "Krkboy", "body": "What? Any native English speaker that's gone through school will have a passive understanding of those words, especially in context.", "created_utc": "1661861011.0", "edited": "False", "id": "imdjs1d", "is_submitter": "False", "link_id": "t3_x11cpo", "parent_id": "t1_imb9tnx", "score": "8", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Krkboy", "body": "How often do people switch simply because you're foreign? And how do you deal with when it happens?", "created_utc": "1661845773.0", "edited": "False", "id": "imczqh5", "is_submitter": "False", "link_id": "t3_x0ozvg", "parent_id": "t1_ima45q3", "score": "2", "subreddit": "norsk", "subreddit_id": "t5_2uhx1"}, {"author": "Krkboy", "body": "Do they really get upset and defensive about this? I would have thought they'd been glad to hear about the cultural differences..", "created_utc": "1661845487.0", "edited": "False", "id": "imczefc", "is_submitter": "False", "link_id": "t3_x0ozvg", "parent_id": "t1_imci2ks", "score": "1", "subreddit": "norsk", "subreddit_id": "t5_2uhx1"}, {"author": "Krkboy", "body": "Personally I think it makes a lot of sense. I'm in favour of learning Classical Greek with Modern Greek pronunciation anyway, so learning a form of Greek that is still spoken, that you can actually immerse yourself in, will really help you to get a feel for the language and read it fluently. \n\nGrammar and translation teaches you just that - the identify grammar patterns and to translate into English. Yet if your goal is to read fluently and comfortably, a good knowledge of Modern Greek (while, agreed, not a magic pill) will be a valuable tool in your armoury. \n\nIt's worth bearing in mind that 'Classical' Greek is not a monolith. Homer is very different to Hellenistic Greek, prose is very different to verse. Modern Greek is the current form. It's living tradition that is still alive today, one that you can join!", "created_utc": "1661778807.0", "edited": "False", "id": "im93bog", "is_submitter": "False", "link_id": "t3_x08fqy", "parent_id": "t3_x08fqy", "score": "5", "subreddit": "AncientGreek", "subreddit_id": "t5_2qwux"}, {"author": "Krkboy", "body": "Or maybe you'll finally reflect on what you've written.", "created_utc": "1661468433.0", "edited": "False", "id": "ilsr1fj", "is_submitter": "False", "link_id": "t3_wwod1g", "parent_id": "t1_ilq4913", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Krkboy", "body": "Well, perhaps history, Classical music, theatre, Orthodox spirituality, films, ethnographic research, architecture... ?? You seem embarrassingly ignorant of your own country/culture even if you're not fond of it yourself.", "created_utc": "1661422113.0", "edited": "False", "id": "ilpq07t", "is_submitter": "False", "link_id": "t3_wwod1g", "parent_id": "t1_ilpp8jf", "score": "0", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Krkboy", "body": "What an embarrassingly ignorant comment.\n\n\\- Russian is one of the working languages of the United Nations (demand for translators and interpreters)\n\n\\- Russia is also one of the BRICS countries (i.e. countries with emerging economies).\n\n\\- Russian is spoken is many other countries with developing economies (central Asia etc.).\n\n\\- The current political situation only increases the need for Russian speakers in the diplomatic sphere.\n\n\\- Some of the best literature ever written is in Russian.", "created_utc": "1661421300.0", "edited": "False", "id": "ilpoxq2", "is_submitter": "False", "link_id": "t3_wwod1g", "parent_id": "t1_ilp84s9", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Krkboy", "body": "I don't know where you're going to be in Poland, but language exchanges are your friend. \"Don't worry about grammar, just speak!\" seems to be a popular mantra these days, but that's not realistic for Polish (if indeed for any other languages). Both are equally important. Study hard every day, and practise speaking as much as possible. \n\nI was extremely stubborn in avoiding other foreigners, and refused to use English with Polish people. Looking back I was perhaps a bit of a dick, but hey, hardly any other foreigners I met ended up being able to speak Polish so.. priorities I suppose? It's worth it though, Poland is a different place if you do it all in Polish. And I'm still friends with a few locals even though I've been out of the country for years.", "created_utc": "1661132810.0", "edited": "False", "id": "il9on2d", "is_submitter": "False", "link_id": "t3_wmqosz", "parent_id": "t1_il3qtzl", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Krkboy", "body": "I spent 6 months going over the grammar while still living in the UK, then moved to Poland and did a 1 year full time course. I was pretty fluent by the end of that.", "created_utc": "1660864748.0", "edited": "False", "id": "ikv2m5d", "is_submitter": "False", "link_id": "t3_wmqosz", "parent_id": "t1_ik4tcr7", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Krkboy", "body": "That is pretty fun, I'll admit. But it doesn't happen every time to be fair  - only the other day I made a reservation on the phone, and my friend next to me was like \"your first sentence sounded weird, they could probably tell this time\".  I suppose it depends on the day!", "created_utc": "1660864660.0", "edited": "False", "id": "ikv2eog", "is_submitter": "False", "link_id": "t3_wmqosz", "parent_id": "t1_ik4d0a4", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Krkboy", "body": "I did ancient Greek at university, then realised I wanted to learn a modern language afterwards. I started learning Polish aged 24 and Japanese aged 28. I was/am able to pass for a native speaker regularly in both languages (though Japanese only on the phone!). And particularly for Polish I can understand literally 99.9 of almost anything I hear. Japanese is about 95% depending on the situation. Full literacy (both reading literature and writing formally) is a bit of a different challenge (and one that's still in progress for me) because you have **years** of education in your native language that you don't in your second one. But it's only a matter of practice and time/effort. Definitely possible.", "created_utc": "1660375496.0", "edited": "False", "id": "ik3pbjo", "is_submitter": "False", "link_id": "t3_wmqosz", "parent_id": "t3_wmqosz", "score": "6", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Krkboy", "body": "Japanese is like this, only to a much greater degree. There are whole sets of vocabulary, grammar, verb endings and phrases which are exclusively confined to the written language (of extremely formal speech). I've met many foreigners with excellent spoken Japanese by gaining active fluency in formal and written Japanese really is quite rare. \n\nOther languages with heavy diglossia that I know of are Welsh, Finnish and Tamil.", "created_utc": "1659698046.0", "edited": "False", "id": "ij1fhha", "is_submitter": "False", "link_id": "t3_wgrs4z", "parent_id": "t3_wgrs4z", "score": "24", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Krkboy", "body": "Glad to be of help. I would not have guessed Portuguese at all! I assumed you were from Hong Kong (as a former British colony) or perhaps Scandinavian. All the best with your studies :)", "created_utc": "1659677153.0", "edited": "False", "id": "ij0nri5", "is_submitter": "False", "link_id": "t3_wbag1n", "parent_id": "t1_iiyhboq", "score": "1", "subreddit": "JudgeMyAccent", "subreddit_id": "t5_2ufiq"}, {"author": "Krkboy", "body": "As others pointed out on your comment, you have a London accent when you speak. The prosody is quite natural also. However, you drop consonants and mispronounce words fairly regularly, so it's clear quite early on that English isn't your first language. I think someone else in the comments gave you a breakdown of particular words that were a bit off.  You also sound like your nose is blocked (perhaps it was?) so the whole recording has a very nasal quality. Still, it was a very good attempt.", "created_utc": "1659677037.0", "edited": "1660374936.0", "id": "ij0nlak", "is_submitter": "False", "link_id": "t3_wbag1n", "parent_id": "t1_iixm49c", "score": "1", "subreddit": "JudgeMyAccent", "subreddit_id": "t5_2ufiq"}, {"author": "Krkboy", "body": "That's a fair comment, actually. I'd imagine the British experience of this and the American experience of this are quite different.", "created_utc": "1659676630.0", "edited": "False", "id": "ij0mymj", "is_submitter": "False", "link_id": "t3_wfgah2", "parent_id": "t1_iizmvx6", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Krkboy", "body": "The difficulties in the situation you describe is quite different. Both parents spoke their native language to the child; English isn't your native language. I fully support bilingualism, so I'm sorry if I came across negatively. It's ultimately up to you; I'm only sharing my experience as a primary school teacher working abroad who has met many international families. If both parents speak their language then with determination it works, but in a situation like yours I've seen difficulties as well as benefits. I'm just sharing my perspective. \n\nI have one Russian friend who speaks English near-natively. She one of the few foreign speakers of English that I can truly relax with like I would with a native Brit. Accent, prosody, vocabulary - you name it. She lives in Russia, with her Russian husband, and had a lovely little boy three years ago. She was keen to speak English and did nothing but that for the first 6 months or so. She did all the right things (English books, media etc.). But she said she wasn't herself. English isn't **her** language. And she said she never realised just how different the two languages felt to her until she started trying to raise her own child. She now speaks Russian to him all the time. Although she does teach him English with games etc. \n\nNo matter how good you are at English, it's not the language you were raised for brought up in. You could mix a bit, like my friend. Having Spanish as the main language, and having English days, activities etc. \n\nRegardless, it's your choice at the end of the day. I'm just sharing my experiences.", "created_utc": "1659655423.0", "edited": "False", "id": "iizfce3", "is_submitter": "False", "link_id": "t3_wfzwxt", "parent_id": "t1_iix6l2g", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Krkboy", "body": "This is not always true. The language of schooling and the community is usually the one that dominates. There are also issues of identity as well. I think it's much healthier for children to have a clear mother tongue, and if they have several other languages at a decent level too, then even better.", "created_utc": "1659622070.0", "edited": "False", "id": "iix1qqa", "is_submitter": "False", "link_id": "t3_wfzwxt", "parent_id": "t1_iiwxj6n", "score": "0", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Krkboy", "body": "I would advise against speaking your non-native language regardless of proficiency. I've encountered a few families doing this (in Poland, and in Asia), and it can end up more complicated that you might realise. Children are much sharper than we think. They can work out very quickly which language you are most natural and comfortable in (in your case Spanish), and I have heard of cases where the child feels singled out (i.e. I'm a Polish child, in Poland, with Polish parents going to a Polish school, but my mum keeps speaking to me in a different language.. why am I being singled out? I just want to be like everyone else). \n\nPersonally, I think that whatever the benefits of bilingualism might be, the most important thing is having an authentic, healthy and loving relationship with your child. You're a Spanish family, living in Spain. Spanish is the natural family language. As someone else pointed out, it's also about culture and heritage. Spanish is part of your heritage, English isn't. At least, not quite in the same way. \n\nHowever, given your background in English it would be a shame not to introduce English at a really early age. Even if Spanish is your family language, you can still introduce English books/TV programmes/games etc. Or have English speaking afternoons, English-only challenges in the car etc. There are ways to integrate English without making it your primary/exclusive mother-child language. \n\nYou're a Spanish native with excellent English skills that you want to pass on to your baby. Personally it would makes the most sense to speak Spanish to your baby, but give them an excellent head start with English using your knowledge/teaching experience. Just my thoughts anyway.", "created_utc": "1659621902.0", "edited": "False", "id": "iix1cdl", "is_submitter": "False", "link_id": "t3_wfzwxt", "parent_id": "t3_wfzwxt", "score": "5", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Krkboy", "body": "I've never been, but the image I have is of a dark, wet country that until very recently was in iron clutches of the Catholic Church. I'm glad I wasn't born there. \n\nAlthough, to be fair, I did enjoy Riverdance and I'm quite partial to Enya when I'm in the right mood.", "created_utc": "1659615829.0", "edited": "False", "id": "iiwoc8d", "is_submitter": "False", "link_id": "t3_wfxgby", "parent_id": "t3_wfxgby", "score": "1", "subreddit": "AskUK", "subreddit_id": "t5_2t4s3"}, {"author": "Krkboy", "body": "To be honest, I don't particularly like it. As another person wrote in a comment, there isn't really any other language where non-natives claim equal ownership of the language. When I trained as an English teacher I often read things like \"English no longer belongs to native-speakers\", \"Deconstruction the native-speaker bias\" etc. No one would contend that Italians are the experts on Italian, or the Japanese on the Japanese language. Claiming that native English speakers are better at translating into English, or speak better English is seen as privilege and discrimination. Perhaps another case of post-colonialism/deconstruction/political correctness going a bit too far, I'm not sure. \n\nFor me personally, it almost feels like and intrusion on my cultural and linguistic heritage, as we don't seem to be allowed to own our own language anymore. I'm delighted if other people want to learn English (particularly British English), but it does still belong to us first and foremost. English is part of our history and identity. I do sometimes resent how it's just 'anyone's' now. Although, I suspect this may be a minority opinion. \n\nSometimes I think it must be nice to have a smaller language like Finnish, or Greek or Welsh, that are only spoken by people of the same culture, and then you use English with everyone else.", "created_utc": "1659615539.0", "edited": "False", "id": "iiwnsal", "is_submitter": "False", "link_id": "t3_wfgah2", "parent_id": "t3_wfgah2", "score": "6", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Krkboy", "body": "I think people underestimate just how big a role schooling plays in language formation. I don't really remember having learned English, I just acquired it as a native. But before moving to Japan to teach English I looked through all my primary school school books (my mum kept everything), and I was surprised at how much explicit learning of vocabulary, correcting of mistakes, and sentence writing I was taught in primary school. Plus, the social reinforcement of my peers. I don't think it's really the parents' job to correct and shape their children's language. That's why we have schooling. Just speaking a heritage language with your parents isn't really enough to gain full fluency.", "created_utc": "1659614493.0", "edited": "False", "id": "iiwluoc", "is_submitter": "False", "link_id": "t3_wfs5sv", "parent_id": "t3_wfs5sv", "score": "7", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Krkboy", "body": "I'll give it a go!\n\n*\"Hello, everybody\"*\n\nThis sounds fine, vowels are RP.\n\n*\"I'm a university student currently working on a joint h****o****nours degree in history, cl****a****ssics and* ***Russian****.\"*\n\nAs someone else pointed out, dropping the g sound is characteristic of SE/SW England dialects, and doesn't match your speech. The o in honours is too long which gives you away as being non-native. The vowel in classics is slightly off too, somewhere between an a and an o sound. \n\nThe other vowels are fine here, but the rising intonation on Russian doesn't really fit traditional British speech prosody. Americans tend to rise at the end of sentences, and many young Brits are doing that now too, but your general accent is RP/well spoken English so it doesn't really fit. You need to end a (non- interrogative) sentence with failing intonation. \n\n*\"And I'm also p****a****ssionate about languages s****o****, uh, (****in****) most of my* ***free time****..\"*\n\nThe vowels here are almost conservative RP. Hardly anyone your age speak this way naturally anymore, so it may come off as a little contrived/unnatural or like someone on stage. Sounds native though to be fair. 'My free time' is a grammar mistake, you need the preposition. Additionally, the stress in 'free time' is on time, not free. Again, this gives you away as being non-native. \n\n\"I usually tr**y** to l**ea**rn new langua**g**es..\"\n\nThese two vowels have a slightly SE/London quality to them. I think they're a little too long. RP is more crips and clear. You also pronounce the second g in languages as a ch as in church , when it should be a j sounds, as jug. Again, it identifies you as a foreigner. \n\n\"or try to improve m**y** specific skill in one of the languages I already speak\". \n\nAccent-wise, this was pretty good. The vowel in 'my' was too short (m'specific skills) which, again, is typical of casual/dialect speech, not RP.  Also, 'my specific skill' is oddly phrased. We tend to say: \"improve the languages I already speak\", or \"improve my languages skills in the languages I already speak.\"\n\nThis is probably enough to be getting on with, as this post is quite long already. Rather than learning the specific phonemes of each word like this, I would go back to revising English (standard UK) phonemes and then, better yet, choose someone who's voice you like and listen to them extensively. Once you've got their voice in your head, practise shadowing for 20 minutes or so everyday. \n\nIf you don't mind my asking, what's your native language?", "created_utc": "1659584684.0", "edited": "False", "id": "iivexmb", "is_submitter": "False", "link_id": "t3_wbag1n", "parent_id": "t1_iitgvrr", "score": "2", "subreddit": "JudgeMyAccent", "subreddit_id": "t5_2ufiq"}, {"author": "Krkboy", "body": "How far in your language journey are you looking to go? Becoming fluent in either Chinese or Japanese is a **massive** undertaking. I would just choose one and stick with it. 800-900 is only just the beginning really. If you're feeling burnt out already then maybe should be think about whether this is a realistic long-term project. Also, learning vocabulary out of context can feel slow. Maybe focus on a different aspect of Chinese for now, like handwriting, or grammar, or simple listening/reading?", "created_utc": "1659535124.0", "edited": "False", "id": "iis6lwa", "is_submitter": "False", "link_id": "t3_wf6e7d", "parent_id": "t3_wf6e7d", "score": "3", "subreddit": "LearnJapanese", "subreddit_id": "t5_2qyls"}, {"author": "Krkboy", "body": "It's always lovely to hear a foreigner come close to a British accent :)\n\nAs others have pointed out, it's a little inconsistent, and fairly easy to detect that you're not British after a few words/sentences. I think that might explain the tosser comment earlier: you can tell it's an effort for you to speak that way, and so comes across as slightly unnatural/put on.\n\nIn terms of specifics, the vowels are quite inconsistent. Some sounds are estuary English, other RP, others exaggerated RP, others slightly Welsh. I could suggest sticking to one. And maybe tone down the posh element of it haha. A lot of people who speak like that actually are tossers ;) I wouldn't try too hard though, listen a lot and it'll either come or it won't. There's nothing worse than a forced accent - native or non-native.", "created_utc": "1659534334.0", "edited": "False", "id": "iis4s5j", "is_submitter": "False", "link_id": "t3_wbag1n", "parent_id": "t3_wbag1n", "score": "2", "subreddit": "JudgeMyAccent", "subreddit_id": "t5_2ufiq"}, {"author": "Krkboy", "body": "After the first two words I could tell you weren't a native. You have quite a clear voice and it's easy to listen to, and you can hear the American influence. But your vowels are very nasal and your vocal placement shows interference from your native language. I would go back and work on individual phonemes again, particularly vowels. Your intonation and melody wasn't bad though. \n\nI would say you are still quite a long way away from being mistaken as a native speaker. You know this isn't really possible by now though, right? By all means keep improving, but unless you're pre-school age, you'll have to be happy with 90% native-sounding at best. At the moment I would say you're 70-5% there.", "created_utc": "1659533648.0", "edited": "False", "id": "iis37z8", "is_submitter": "False", "link_id": "t3_wbvpgo", "parent_id": "t3_wbvpgo", "score": "1", "subreddit": "JudgeMyAccent", "subreddit_id": "t5_2ufiq"}, {"author": "Krkboy", "body": "What I heard was not RP. It was heavily influenced by estuary/south-east English (pronouncing th as f, for one). The enunciation was unclear towards the end; I couldn't even understand which word you were saying.", "created_utc": "1659532953.0", "edited": "False", "id": "iis1o82", "is_submitter": "False", "link_id": "t3_wf47s1", "parent_id": "t3_wf47s1", "score": "1", "subreddit": "JudgeMyAccent", "subreddit_id": "t5_2ufiq"}, {"author": "Krkboy", "body": "Very good points; I agree with all of that. \n\nI think perhaps a better position would be that for those aiming a native-like fluency, English presents certain challenges (as I outlined in another comment) that aren't found in many other languages. At the same time, of course, there are challenges found in other languages (like tones, for instance) which aren't found in English. I wouldn't say that English harder than any other languages, either. \n\nI do think that a high-aiming learner may have unique/particular things (difficulties) to consider given it's role as a global lingua franca, however.", "created_utc": "1659528820.0", "edited": "False", "id": "iirte4w", "is_submitter": "False", "link_id": "t3_we5pet", "parent_id": "t1_iirp074", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Krkboy", "body": "As others have pointed out, it doesn't come across as professional. Even if you're applying to a recruitment agency that specialises in creative-type jobs, you still need to produce natural, concise, business-like Japanese. It sounds like all your thought processes and attitude to language are still very much English/Western. If you've been in Japan a long time, you must have read/listened to a ton of Japanese right? If you personally haven't seen something expressed a certain way in Japanese by a native, don't write it yourself, particularly in a professional context. Otherwise you're fumbling around in the dark. Do something simple and well, rather than something complicated where you'll trip up and look like a tit.", "created_utc": "1659483394.0", "edited": "False", "id": "iipogid", "is_submitter": "False", "link_id": "t3_we6qhz", "parent_id": "t1_iindvx1", "score": "13", "subreddit": "LearnJapanese", "subreddit_id": "t5_2qyls"}, {"author": "Krkboy", "body": "This is the deck: [https://tatsumoto.neocities.org/blog/basic-vocabulary.html](https://tatsumoto.neocities.org/blog/basic-vocabulary.html)\n\nApart from the software issue, it's an excellent deck!", "created_utc": "1659449579.0", "edited": "False", "id": "iin8ju3", "is_submitter": "True", "link_id": "t3_we8093", "parent_id": "t1_iin4xwj", "score": "1", "subreddit": "Anki", "subreddit_id": "t5_2s9lm"}, {"author": "Krkboy", "body": "Well, you mother only really has herself to blame, doesn't she..", "created_utc": "1659447583.0", "edited": "False", "id": "iin3w8w", "is_submitter": "False", "link_id": "t3_wdqaei", "parent_id": "t3_wdqaei", "score": "-1", "subreddit": "learnpolish", "subreddit_id": "t5_2u72v"}, {"author": "Krkboy", "body": "I obviously know nothing about you or the company you're applying for, but it's worth bearing in mind that most Japanese companies don't value standing out or putting and individual spin on things. Japanese resumés and the interview process are heavily standardised. Read some example 志望動機 online to get the idea. As foreigner they'll already be wary of you being extra work by not being able to fit into a Japanese office. Put their mind at rest by blending in and showing them how you can adapt by first adapting to the Japanese hiring norms.", "created_utc": "1659446238.0", "edited": "False", "id": "iin0xnm", "is_submitter": "False", "link_id": "t3_we6qhz", "parent_id": "t3_we6qhz", "score": "14", "subreddit": "LearnJapanese", "subreddit_id": "t5_2qyls"}, {"author": "Krkboy", "body": "I think it depends. Wales is a small country but there's lots of variation. \n\nIn North Wales it's still learned as a mother tongue and survives as a community language. It's only natural to educate those children in Welsh, as it's their first language. Those communities need support from the government, and I'm glad if they're flourishing. \n\nIn South Wales it can get a bit artificial. Even at Welsh medium schools, 95%+ of the students come from English-speaking homes. Come break-time they all speak English among themselves. And after they leave school, they'll forget it. Only today there was another reddit post about this: [https://www.reddit.com/r/languagelearning/comments/wdqdqf/realising\\_ive\\_lost\\_a\\_language\\_i\\_was\\_fluent\\_in/](https://www.reddit.com/r/languagelearning/comments/wdqdqf/realising_ive_lost_a_language_i_was_fluent_in/)\n\nBeing educated in Welsh doesn't make your a natural or fluent speaker if it's not the community language. It's sad and tragic that Welsh was lost in a lot of places in Wales, but those places are English-speaking now, and have been for several generations. It's gone. Put the money and resources towards the native Welsh-speaking communities, so that people brought up there want to stay and the communities don't disappear. \n\nMy two cents anyway.", "created_utc": "1659442001.0", "edited": "False", "id": "iimsmw7", "is_submitter": "False", "link_id": "t3_we4yg8", "parent_id": "t3_we4yg8", "score": "2", "subreddit": "AskUK", "subreddit_id": "t5_2t4s3"}, {"author": "Krkboy", "body": "Out of interest, whereabouts are you from?", "created_utc": "1659441088.0", "edited": "False", "id": "iimr1ca", "is_submitter": "False", "link_id": "t3_we4yg8", "parent_id": "t1_iim5hxu", "score": "3", "subreddit": "AskUK", "subreddit_id": "t5_2t4s3"}, {"author": "Krkboy", "body": "Hmmm it's not quite as relative as that. There's a body of words that all native speakers of say, Italian, know if they've been born raised and schooled in Italy. The same is true of British or American etc. English. There are mistakes (as opposed to slips) that native speaker don't make. There's also your accent which in 99% of cases marks you as native or foreign. Language is a social phenomenon so it's not clear cut, but if we equate mastery to that of native speaker competence, then the point of mastery certainly does exist.  \n\nRegarding variation of pronunciation - English is not completely unique perhaps, but it is more widely spoken that any other language at present. This gives in a much wider amount of variation. \n\nJapanese was a bad example to choose. There are regional differences/dialects, but the extremes of those are mostly confined to the pre-war generation. And there definitely is a standard which everyone adheres to in almost all work/education/media situations. Many people move to Tokyo as adults and completely lose any hint of their local dialect. This doesn't happen in the UK. It might soften a little but if someone moves to London as an adult, any native will be able to tell very quickly that the person is from Yorkshire, Wales, Liverpool etc. even after decades of living there. \n\nNorway might be comparable to the UK in terms of country-to-country comparison. But the point is that it's not just the UK - the English speaking world is much much bigger. Trying to sound native by picking one accent and immersing yourself in it is a challenge.", "created_utc": "1659439041.0", "edited": "False", "id": "iimnqt4", "is_submitter": "False", "link_id": "t3_we5pet", "parent_id": "t1_iimm0e3", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Krkboy", "body": "I read once that English was very accessible (easy to become communicative in), but very difficult to master like a native. I've been teaching English in abroad for 8 years and this has been my experience. \n\nReasons for this:\n\n\\- It's very difficult to immerse yourself with native speakers. Cities like London, New York etc. are full of non-native speakers, making immersion with the language and culture very difficult. \n\n\\- English is so ridiculously varied (esp. in the UK), and if you're trying to get a native accent you really can't mix them up too much. I had a Polish colleague who had almost no accent, but what gave her away was that she sounded a bit like a Londoner on some vowels, then a bit Irish on others, but with some Americanised consonants etc. \n\n\\- Most English used online (and even on Netflix etc.) is a watered down, internationalised (Americanised) version of English. Given the amount of immersion young people have with it these days, that is probably fairly easy to pick up. This is quite different from educated native usage. This diglossia doesn't really exist on most other major languages (German, Russian, Japanese etc.). \n\nI've met many fluent speakers; I can count on one hand the amount who are near-native. \n\nI'm not sure I'd say it harder than other languages, but just has unique challenges if you want to truly master it. My two cents anyway.", "created_utc": "1659437256.0", "edited": "False", "id": "iiml5k3", "is_submitter": "False", "link_id": "t3_we5pet", "parent_id": "t3_we5pet", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Krkboy", "body": "That's good to know; I'll be job hunting early next year :)", "created_utc": "1659335925.0", "edited": "False", "id": "iih8jwq", "is_submitter": "False", "link_id": "t3_wd8s7p", "parent_id": "t1_iih7onw", "score": "1", "subreddit": "japanlife", "subreddit_id": "t5_2rg2o"}, {"author": "Krkboy", "body": "How much of a difference is it between the two?", "created_utc": "1659335120.0", "edited": "False", "id": "iih7j0s", "is_submitter": "False", "link_id": "t3_wd8s7p", "parent_id": "t1_iih6cx4", "score": "1", "subreddit": "japanlife", "subreddit_id": "t5_2rg2o"}, {"author": "Krkboy", "body": "Native language. \n\nMost L2 speakers who claim fluency in English and tout it as and an 'easy language' just speak a watered down internationalised/americanised version. I've only met a handful of people that actually know English comparable to that of an educated Englishman.\n\nBeing a native (British) English speaker, was basically like winning the linguistic lottery. The amount of doors it's opened for me while working abroad is noticeably different compared to to other speakers. It's gives me the advantage in business conversations, authority over English usage, a job to fall back on in most countries (ESL teaching). You can get some of this as a L2 speaker but it's not quite the same. And I never had to put in the time/money/effort to learn it. \n\nIt hasn't stopped me gaining fluency in two other languages though. And given that I've had English from the get-go, I can learn languages that actually interest me. Possibly being raised bilingually in Welsh/Gaelic etc. would have been more enriching, but I wouldn't want to change being a native English speaker.", "created_utc": "1659303129.0", "edited": "False", "id": "iifjeq7", "is_submitter": "False", "link_id": "t3_wcpegs", "parent_id": "t3_wcpegs", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Krkboy", "body": "British accent (standard BBC accent)\n\nBits of west country when I speak with my family.", "created_utc": "1659301486.0", "edited": "False", "id": "iiffkrs", "is_submitter": "False", "link_id": "t3_wcvdk9", "parent_id": "t3_wcvdk9", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Krkboy", "body": "Bear in mind that it will literally take you five times as long to learn Korean or Japanese. If it takes you one year to get to intermediate Dutch, it will take you five years to reach a similar level in Korean or Japanese.", "created_utc": "1659274544.0", "edited": "False", "id": "iidp1ny", "is_submitter": "False", "link_id": "t3_wcnmyy", "parent_id": "t3_wcnmyy", "score": "4", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Krkboy", "body": "Get the N1 books, do the work. There're no shortcuts, buddy!", "created_utc": "1659259249.0", "edited": "False", "id": "iid2ux4", "is_submitter": "True", "link_id": "t3_wci2v3", "parent_id": "t1_iicwnyb", "score": "3", "subreddit": "LearnJapanese", "subreddit_id": "t5_2qyls"}, {"author": "Krkboy", "body": "One nice big upvote for you, my friend.", "created_utc": "1659256309.0", "edited": "False", "id": "iiczaj6", "is_submitter": "False", "link_id": "t3_wc8lf0", "parent_id": "t1_iicz2ec", "score": "1", "subreddit": "LearnJapanese", "subreddit_id": "t5_2qyls"}, {"author": "Krkboy", "body": "I really hate this too. If I'm in my own country and someone is trying to integrate, lovely. But if I've gone to their country, I'm under no obligation to offer free English practice.", "created_utc": "1659256141.0", "edited": "False", "id": "iicz3dm", "is_submitter": "False", "link_id": "t3_wc1nl4", "parent_id": "t1_iiby0bg", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Krkboy", "body": "I can relate to this. It took me **one** year of intensive studying full-time in Poland to be functionally fluent in Polish (around B2/C1). It took me **five** years of studying Japanese by myself everyday while on JET to get to that level. I'm still going though!", "created_utc": "1659255750.0", "edited": "False", "id": "iicym7b", "is_submitter": "False", "link_id": "t3_wc1nl4", "parent_id": "t1_iib3svn", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Krkboy", "body": "*(おれ.. foreigners shouldn't use this because you will not get it right 95% of the time)*\n\nWhat a sack of shit. This is by far the most common pronoun used casually. By male foreigners and Japanese alike. It's really not that complicated.", "created_utc": "1659253361.0", "edited": "False", "id": "iicvno3", "is_submitter": "False", "link_id": "t3_wc8lf0", "parent_id": "t1_iib8xdx", "score": "14", "subreddit": "LearnJapanese", "subreddit_id": "t5_2qyls"}, {"author": "Krkboy", "body": "I use 俺 when I use casual speech (with Japanese friends and my boyfriend) 俺が行く\n\nI use 僕 when I use です/ます form (with work colleagues/older fold)　僕が行きます\n\nI use 私 when I use 尊敬語 (usually with my boss or senior staff, in a work context)　私が伺います\n\nI'm a 6 foot tall, pretty outgoing 気が強い kind of guy though, so 俺 suits me I feel. I have a few friends that use 僕 all the time and they tend to be more academic/reserved. \n\nI've definitely seen kids in elementary school get teased for using 僕 past a certain age with their friends. The little ones use 僕 with each other, and most break into 俺 at around grade 3/4, except when using です/ます with teachers/senpais etc. But there's room for individual preference to a certain extent. Using 私 in casual situations is stiff though, I wouldn't do that.", "created_utc": "1659249803.0", "edited": "False", "id": "iicr4ux", "is_submitter": "False", "link_id": "t3_wc8lf0", "parent_id": "t3_wc8lf0", "score": "4", "subreddit": "LearnJapanese", "subreddit_id": "t5_2qyls"}, {"author": "Krkboy", "body": "That's not the dictionary definition my friend, Cambridge defines it as speaking from babyhood: \n\n[https://dictionary.cambridge.org/dictionary/english/native-speaker](https://dictionary.cambridge.org/dictionary/english/native-speaker) \n\nBut if we're going to get technical then the critical period is a hypothesis, with a variety of definitions. Some researchers put that age cap at 2 years, especially for phonics. Procedural memory also fades after age 5. The OP didn't move to an English-speaking country until age 8, before which they had Spanish as their dominant language. \n\nA cursory browse of even wikipedia will give you plenty of academic sources to back this up. [https://en.wikipedia.org/wiki/Critical\\_period\\_hypothesis](https://en.wikipedia.org/wiki/Critical_period_hypothesis) \n\nIf you're going to comment about technicalities and definitions, then research first and cite your sources.", "created_utc": "1659070282.0", "edited": "False", "id": "ii3788x", "is_submitter": "False", "link_id": "t3_w9xkpw", "parent_id": "t1_ihzn8gb", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Krkboy", "body": "Posed as a simple question: no. Your native language is Spanish, not English (even if your English is stronger). To say you're a native speaker is simply not true. You learnt it when you were 4+, not from birth or from your parents.\n\nAs someone else said, you could truthfully say you that you have native-level proficiency (if indeed that is the case..). Ask yourself: can other Americans tell that you're not originally from there?\n\nFor the purpose of this job however.. if you can get away with it, and think you'll do a good job as a teacher, then sure - market yourself as a native speaker.", "created_utc": "1659002754.0", "edited": "1659003839.0", "id": "ihz02sq", "is_submitter": "False", "link_id": "t3_w9xkpw", "parent_id": "t3_w9xkpw", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Krkboy", "body": "\\^ *(for one reason or another, maybe with a similar prejudice as the one you pointed out?)*\n\nThat's a bit of assumption to be fair, but perhaps I'm misreading it! Manga/anime/light novels are all great things, they're just not my cup of tea. I thought it would be better to be specific so I didn't get lots of answers that I wouldn't be interested in. I'll definitely look up your recommendations though! Cheers :)", "created_utc": "1658360152.0", "edited": "False", "id": "igzd3vz", "is_submitter": "True", "link_id": "t3_w2sogx", "parent_id": "t1_igwofi4", "score": "1", "subreddit": "LearnJapanese", "subreddit_id": "t5_2qyls"}, {"author": "Krkboy", "body": "Let's not make assumptions, shall we? One of the things I love about Tolkien and Lewis is their love of language and prose; the English they write in is very literary and well-crafted. I was looking for something similar written in good literary Japanese. I'm an old-school reader, for sure, but not a prejudiced one :)", "created_utc": "1658308042.0", "edited": "False", "id": "igw7z5c", "is_submitter": "True", "link_id": "t3_w2sogx", "parent_id": "t1_igtycx3", "score": "1", "subreddit": "LearnJapanese", "subreddit_id": "t5_2qyls"}, {"author": "Krkboy", "body": "English isn't an easy language; it just appears that way. It's the language of the economically powerful, therefore it has vastly more online presence, economic incentives, educational resources, immersion opportunities and - crucially - it's a necessity for many people. \n\nAlbanian isn't ten times harder. The necessity for Albanian is close to zero. And I'm sure the resources to learn it are scarce and outdated. That's why you notice a difference. \n\nIn 99% of cases, most English natives can spot a non-native after the first sentence too, by the way.", "created_utc": "1657709875.0", "edited": "False", "id": "ifz5l5e", "is_submitter": "False", "link_id": "t3_vxyhte", "parent_id": "t1_ifz3lxy", "score": "28", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Krkboy", "body": "Yeah, this is definitely true. As a native English speaker who has learnt both German and Polish fluently, I felt like German came a lot more naturally, even though only achieved B2 fluency (compared to C2 in Polish). It's almost like the hardwiring is different. Which of course, linguistically speaking it is. I notice it in L2 speakers as well. The prosody of Germans', Norwegians' English etc. is much closer to native speech that most Russians of Poles I've met, even if they're otherwise very fluent. Plus accent of course.", "created_utc": "1657709421.0", "edited": "False", "id": "ifz4xwp", "is_submitter": "False", "link_id": "t3_vxyhte", "parent_id": "t1_ifz3o8q", "score": "9", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Krkboy", "body": "This is definitely true. In Europe they tend to house all the international exchange students together and they all just end up speaking English. Spending a year in Germany/Italy/Norway etc. in the 1980s/1990s would have been a more linguistically enriching experience for sure.", "created_utc": "1657511692.0", "edited": "False", "id": "ifojqoj", "is_submitter": "False", "link_id": "t3_vuzid6", "parent_id": "t1_ifjg4uf", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Krkboy", "body": "Yeah, I've experienced this as well. Sometimes I think being a native English speaker puts you at a bit of a disadvantage. You have to really be at quite a good level to insist on using another language, and people often want to use you for free English practice :/ You have to have quite a determined personality to go against the flow!", "created_utc": "1657511472.0", "edited": "False", "id": "ifojcay", "is_submitter": "False", "link_id": "t3_vuzid6", "parent_id": "t1_ifle6x1", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Krkboy", "body": "This is interesting. Why did you find people didn't want to use Japanese? Were they just trying to get free English practice?", "created_utc": "1657459650.0", "edited": "False", "id": "ifldhyx", "is_submitter": "False", "link_id": "t3_vuzid6", "parent_id": "t1_ifjhb8k", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Krkboy", "body": "I'm an English native speaking living in Japan who is in a long-term relationship with a Japanese guy. We always speak in Japanese. He understands some English from school (enough to do wordle together, and sing English songs at karaoke). Do I want him to learn English? Not really. \n\n\\- I've been in Japan for so long now, that Japanese is natural with Japanese people. English feels strange.\n\n\\- The few things I can only express in my native language are things only other British people would probably get. It wouldn't solve any communication issues (not that we really have any).\n\nIf we were to get married or something then I'd like for him to be able to communicated with my family etc. in English, but our language is already Japanese. \n\nI have to admit that part of it is not wanting to be another white/Japanese couple where the white guy doesn't both with Japanese. I've put a huge amount of effort into learning Japanese and integrating here, and speaking English - particularly in public - kind of feels like a step backwards.", "created_utc": "1655801265.0", "edited": "False", "id": "id5t9xi", "is_submitter": "False", "link_id": "t3_vgnhfl", "parent_id": "t3_vgnhfl", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Krkboy", "body": "Yes, but they make different types of mistakes compared to learners", "created_utc": "1655291286.0", "edited": "False", "id": "icfwc5p", "is_submitter": "False", "link_id": "t3_vcbhl4", "parent_id": "t1_icdcu68", "score": "6", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Krkboy", "body": "To be fair, this gives non-natives away in British English too. Even very flunet Scandinavians/Dutch - there's always something a tiny bit off about the vowel sounds, particularly diphthongs.", "created_utc": "1653385455.0", "edited": "False", "id": "i9sel24", "is_submitter": "False", "link_id": "t3_ua6yyu", "parent_id": "t1_i5wny0m", "score": "1", "subreddit": "norsk", "subreddit_id": "t5_2uhx1"}, {"author": "Krkboy", "body": "\\*Also, stay away from English reddit and start using the time to immerse yourself in German! ;)", "created_utc": "1653383663.0", "edited": "False", "id": "i9scn26", "is_submitter": "False", "link_id": "t3_uw4nvw", "parent_id": "t1_i9sck9o", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Krkboy", "body": "I'd recommend an app/software developer called Migaku. I use it for Japanese but they have German programmes, too. You can download software that links directly to Anki and Kindle etc., and then adds audio, gender colour (for der/die/das) etc. and pictures and the click of a button. It saves a HUGE amount for time when making flashcards. AwesomeTTS is good for audio too. Good luck with your studies!", "created_utc": "1653383590.0", "edited": "False", "id": "i9sck9o", "is_submitter": "False", "link_id": "t3_uw4nvw", "parent_id": "t3_uw4nvw", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Krkboy", "body": "Without knowing you personally, all I can say is this:\n\nWhatever problems you have now (from an admittedly pretty shitty sounding childhood) you carry inside you, and I doubt moving to another country will change anything. BUT, you do have the choice as an adult to let it go and move towards creating the life you want. \n\nJapan and the Japanese aren't the xenophobic monsters some people paint them out to be. There is xenophobia, but that's not most people. I'm a white Englishman, born and bred, and yet I learnt the language and get treated to same as a local with almost everyone I know. You have a massive head start to me (passing for full Japanese for a start!). So if I can do it, so can you. \n\nThere is a way out. Re-forge your relationship with Japan, get some mental health support, and start making the life you want. Japan is a diverse place, with many lovely people. Accept your past and go and make a new future. Good luck!", "created_utc": "1653040215.0", "edited": "False", "id": "i9b50s9", "is_submitter": "False", "link_id": "t3_ut4588", "parent_id": "t3_ut4588", "score": "1", "subreddit": "japanlife", "subreddit_id": "t5_2rg2o"}, {"author": "Krkboy", "body": "I'm going back home for three weeks in the autumn (i.e. during class time) precisely because flights are cheaper during term time, and the beaches won't be full of families on their summer holidays shouting at their children, and I can just potter round quietly with my mum. I told my BoE after I'd already booked my flights, and it was fine. Just do it, man. What are they going to do?", "created_utc": "1652795010.0", "edited": "False", "id": "i8y188h", "is_submitter": "False", "link_id": "t3_urifd9", "parent_id": "t3_urifd9", "score": "9", "subreddit": "JETProgramme", "subreddit_id": "t5_2w9xe"}, {"author": "Krkboy", "body": "I've grown quite accustomed to living in a country that hasn't been deeply influenced by Judeo-Christian values, or by identity politics. Most Japanese seem quite content with their lives, whereas whenever I go back to the UK people seem incredibly opinionated and angry at everything. \n\nAnd love hotels. I mean, what are you supposed to do in the UK if you want some intimate time but you don't want them to know where you live? In Japan you can rent by the hour, then get on with your day. Genius!", "created_utc": "1652792411.0", "edited": "False", "id": "i8xvx37", "is_submitter": "False", "link_id": "t3_urfwv0", "parent_id": "t3_urfwv0", "score": "5", "subreddit": "japanlife", "subreddit_id": "t5_2rg2o"}, {"author": "Krkboy", "body": "In that case you probably have to reconcile yourself with the fact that Japanese will be their dominant written and spoken language, and they'll have a decent level of English but not native level. Kind of the inverse of what Nenpai was saying of Japanese raised abroad.", "created_utc": "1643622719.0", "edited": "False", "id": "huz4xh8", "is_submitter": "False", "link_id": "t3_se8d1k", "parent_id": "t1_huksnxg", "score": "1", "subreddit": "japanlife", "subreddit_id": "t5_2rg2o"}, {"author": "Krkboy", "body": "To answer your question directly: I think it depends on a the parent's affiliation with their home culture and with Japan. \n\nI'm going to assume you're talking about international marriages here (one Japanese parent, one non-Japanese parents. Take the non-Japanese parent. Sure, they might have been born and raised in another country but they live in Japan now. If you've lived in Japanese for 10+ years, speak Japanese with your partner, at work, with friends etc. then Japanese becomes your dominant language. You've assimilated into the culture. It becomes very unnatural to suddenly use your native language with a baby when everything else is in Japanese. Especially is Japan is your permanent home. \n\nNo-one doubts the benefits of bilingualism but just because someone spend their childhood/education in another language he/she isn't under any obligation to use it as an adult. Maybe they chose to come to Japan and start another life, and feel more comfortable living as a Japanese now. Some people just want to assimilate and live a regular life and that might be more important than having bilingual children.", "created_utc": "1643622422.0", "edited": "False", "id": "huz4kfz", "is_submitter": "False", "link_id": "t3_se8d1k", "parent_id": "t3_se8d1k", "score": "2", "subreddit": "japanlife", "subreddit_id": "t5_2rg2o"}, {"author": "Krkboy", "body": "As an Englishman who speaks fluent Polish and Japanese, I can say that Japanese is by far the harder language if you're aiming for full fluency as an English native speaker.", "created_utc": "1643621155.0", "edited": "False", "id": "huz3112", "is_submitter": "False", "link_id": "t3_se8d1k", "parent_id": "t1_huie72i", "score": "1", "subreddit": "japanlife", "subreddit_id": "t5_2rg2o"}, {"author": "Krkboy", "body": "Sorry for the late reply! I'm watching films on Netflix and enjoyed おくりびと and anything by 是枝裕和. Book wise I'm reading the novels versions of films by 新海誠 like 天気の子 and 君の名. Then I want to try getting into some of the classics such as books by 三島由紀夫, 安部公房 and 谷崎潤一郎. It really helps having a kindle with a Japanese dictionary installed.", "created_utc": "1643238700.0", "edited": "False", "id": "hud3797", "is_submitter": "False", "link_id": "t3_savlxj", "parent_id": "t1_htyn2m6", "score": "1", "subreddit": "jlpt", "subreddit_id": "t5_2s1e4"}, {"author": "Krkboy", "body": "If you're getting consistently low scores on the N1 the truth is that you're probably not at that level yet. If I were you I would forget about JLPT for now and spend some time immersing yourself the language. Passively and actively.\n\nPASSIVE: always have a podcast/drama on the go, and always have a book on the go. Don't worry if they're are words/grammar you don't get, just get used to the flow of Japanese. Obviously it's ok to look up words if you really have to. This way you get exposed to both written and spoken Japanese. \n\nACTIVE:  choose ONE thing to sentence mine (i.e. one book/film/drama) and hoover up vocabulary you don't know. Put it into ANKI and revise everyday. Try and vary the types of texts/audio but crucially choose something that interests you!!\n\nBoth of these are crucial because I felt a lot of N1 was testing my 'feel' for Japanese and what I intuitively knew to be right. So much of the Kanzen material doesn't come up on the test.  \n\nAfter about 6 months/a year of this maybe look into the JLPT again. I would start with N2 material to give yourself a boost and get used to the format. Then try N1. Best of luck!!", "created_utc": "1642980145.0", "edited": "False", "id": "hty1n83", "is_submitter": "False", "link_id": "t3_sb6lui", "parent_id": "t3_sb6lui", "score": "8", "subreddit": "jlpt", "subreddit_id": "t5_2s1e4"}, {"author": "Krkboy", "body": "I passed N1 115/180. I'm absolutely delighted. \n\nFrom now, I'm going to have a book/film on the go for sentence mining, and then just enjoy reading Japanese novels and watching Japanese films that I like. I like shadowing too, so I might do that. It's been a climb to N1 so now I want to enjoy Japanese as much as I can!", "created_utc": "1642951413.0", "edited": "False", "id": "htvzdtr", "is_submitter": "False", "link_id": "t3_savlxj", "parent_id": "t3_savlxj", "score": "13", "subreddit": "jlpt", "subreddit_id": "t5_2s1e4"}, {"author": "Krkboy", "body": "Absolutely not mate. But you should probably have a serious rethink of your study plans if you're not seeing progress. Maybe take a year off and do lots of reading/listening immersion. Then get the books out a few months before the exam. You'll get there! Keep going :)", "created_utc": "1642951199.0", "edited": "False", "id": "htvyvyl", "is_submitter": "False", "link_id": "t3_savlxj", "parent_id": "t1_htvy4f0", "score": "9", "subreddit": "jlpt", "subreddit_id": "t5_2s1e4"}, {"author": "Krkboy", "body": "I definitely feel this too. I'm mostly in rural elementary schools as so end up using Japanese most of the time. I felt a bit bad about his but one of my teachers said there was huge value in the children having a non-Japanese person to build a relationship with. There's still this image (especially in the countryside) the foreigners are scary/weird/only speak English and it's doing a lot for their outlook to have a non-Japanese person fully integrated into their every school life. They also don't grow up with the idea that foreigners = English only, and Japanese = Japanese only.", "created_utc": "1642742504.0", "edited": "False", "id": "htk8s23", "is_submitter": "False", "link_id": "t3_s88ad8", "parent_id": "t3_s88ad8", "score": "10", "subreddit": "JETProgramme", "subreddit_id": "t5_2w9xe"}, {"author": "Krkboy", "body": "I'm turning 34 this year too. Generally speaking, I would say the older you are, the more you get out of JET. If you come here straight from university you often have no life experience outside of university, no experience of adapting to a different culture and - crucially - don't really know much about yourself. This clearly doesn't apply to everyone, but most of the JETs I've seen in their late 20s/30s seem to be the ones who are more level headed/agreeable, disciplined with Japanese studies etc., and make the most of their experience.", "created_utc": "1642741781.0", "edited": "False", "id": "htk7exf", "is_submitter": "False", "link_id": "t3_s8xkc1", "parent_id": "t3_s8xkc1", "score": "15", "subreddit": "JETProgramme", "subreddit_id": "t5_2w9xe"}, {"author": "Krkboy", "body": "Just a quick update! My BoE was contacted yesterday by CLAIR saying that a 6th year is now possible and I re-contracted this afternoon. I'm not sure if that applies countrywide but I hope that everyone who wants to stay, can!", "created_utc": "1642510163.0", "edited": "False", "id": "ht65cif", "is_submitter": "True", "link_id": "t3_rki8wh", "parent_id": "t3_rki8wh", "score": "2", "subreddit": "JETProgramme", "subreddit_id": "t5_2w9xe"}, {"author": "Krkboy", "body": "5th year JET here. Learning Japanese was one of the major reasons I moved to Japan. \n\nI came with very basic Japanese (i.e. minna no nihongo 1) and sat the JLPT N1 this month. My Japanese isn't perfect but I'm happy with what I've achieved in that time. I can watch TV without subtitles, completed a 1-week intern in a Japanese company, read Japanese books for fun etc. Things that helped:\n\n* being placed in elementary (you can use Japanese 95% of the time)\n* I dated a lot, and almost all the guys I was with preferred Japanese\n* I love studying and used my desk warming time wisely\n* I got a tutor (italki)\n* I'm quite chatty by nature and used every opportunity to practise\n* I'm currently using the immersion method (see Matt vs Japan and Refold)\n\nI'm hoping to get a job in a Japanese speaking environment next year and to continue studying and improving. \n\nAs some people have said though, progress depends entirely on you. One ALT in my town returned home this summer after 6 years on JET and couldn't even have a basic conversation. No judgement though - different people have different goals after all :)", "created_utc": "1640831482.0", "edited": "False", "id": "hqhtpzd", "is_submitter": "False", "link_id": "t3_rqxd2e", "parent_id": "t3_rqxd2e", "score": "11", "subreddit": "JETProgramme", "subreddit_id": "t5_2w9xe"}, {"author": "Krkboy", "body": "Most of my schools are 30m to 1h15m each way by car. Granted, I'm covering two/three placements so I've take on some of the really rural schools. It's an awesome deal though. My BoE refunds the petrol (and seriously overpays) and the schools appreciate its a long drive so I arrive about 9:15am and leave around 2pm. Lovely drive along the coast/through the mountains as well. I listen to a Japanese podcast for listening practice. No complaints!", "created_utc": "1629349775.0", "edited": "False", "id": "h9hykkj", "is_submitter": "False", "link_id": "t3_p5ac9d", "parent_id": "t3_p5ac9d", "score": "1", "subreddit": "JETProgramme", "subreddit_id": "t5_2w9xe"}, {"author": "Krkboy", "body": "Over the last few years Elementary school has been the main area of expansion (now starting from 3rd grade) so if you end up working there Japanese can be a huge help. Most ES staff and students speak very little English. As for speaking Japanese to students being a 'no-no', I think this must depend on your placement. All the JETs in my prefecture who know Japanese use it with students/teachers (as well as English obviously) and their schools are very grateful. An academic high school in a major city might be different, but knowing Japanese can help you connect a lot more to your colleagues and students. JET is aware of this and I think having a certification would certainly work in your favour - especially if you sell it to them in terms of adaptability, language education experience etc. Best of luck!", "created_utc": "1629349233.0", "edited": "False", "id": "h9hxrii", "is_submitter": "False", "link_id": "t3_p71a0t", "parent_id": "t3_p71a0t", "score": "1", "subreddit": "JETProgramme", "subreddit_id": "t5_2w9xe"}, {"author": "Krkboy", "body": "Fair point. It was more in reference to this: \"They only want you speaking english in the classroom\" - were you told this at your orientation?", "created_utc": "1613998583.0", "edited": "False", "id": "goc3bwk", "is_submitter": "False", "link_id": "t3_lniy0y", "parent_id": "t1_goc2rww", "score": "1", "subreddit": "JETProgramme", "subreddit_id": "t5_2w9xe"}, {"author": "Krkboy", "body": "I'm not sure I agree with this. My CO actually request Japanese speakers the placements are almost all Elementary. And the first question almost all ES schools will ask \"do they speak Japanese\". ES lessons are 90% in Japanese . I would say the JET programme wants people raised abroad to add an international dimension. Speaking Japanese can actually make that cultural exchange a lot smoother, as well the teaching itself. Particularly in lesson urban areas, you are likely to be the only English speaker in the school.", "created_utc": "1613998114.0", "edited": "False", "id": "goc2n5h", "is_submitter": "False", "link_id": "t3_lniy0y", "parent_id": "t1_go0tau3", "score": "1", "subreddit": "JETProgramme", "subreddit_id": "t5_2w9xe"}, {"author": "Krkboy", "body": "I'm not sure I would describe LGBT topics in Japan as iffy. Particularly as a foreigner. It's all here, just very private. In my experience it's seen by most of Japanese colleagues as something personal that doesn't have anything to do with work. Personally, that suits me just fine but some people find that hard. \n\nIn regards to your question though, regardless of the culture, it doesn't seem relevant to an interview process.  After all, how does who you date/have sex with have anything to do with teaching English in schools?", "created_utc": "1613997786.0", "edited": "False", "id": "goc26aa", "is_submitter": "False", "link_id": "t3_lom3rf", "parent_id": "t3_lom3rf", "score": "5", "subreddit": "JETProgramme", "subreddit_id": "t5_2w9xe"}, {"author": "Krkboy", "body": "As many people have already said, I would just go with name+sensei. It makes things easier in my case, because a lot of students assume that Mr/Miss/Mrs is just the equivalent of 'san/sensei'. But of course it's weird if they start saying with first names like 'Mr George' or 'Miss Emma'. So sensei seems an easier option all round. Most schools won't mind which name you use (first/last). In my experience almost all students katakana-ise names whether you like it or not haha. I work in ES and I introduced myself with my Katakana name for the little ones. It's just easier.  JHS too really. Just pick what you feel comfortable with. Japanese is a wonderfully gender-less language in many ways so it easy to make it work for you!", "created_utc": "1613997378.0", "edited": "False", "id": "goc1le5", "is_submitter": "False", "link_id": "t3_lp5rlu", "parent_id": "t3_lp5rlu", "score": "2", "subreddit": "JETProgramme", "subreddit_id": "t5_2w9xe"}, {"author": "Krkboy", "body": "Thanks for such a detailed reply! Can you always tell the difference between a native speaker of Gaelic and someone who's learnt it at school/as a second language?", "created_utc": "1613721195.0", "edited": "False", "id": "gnzhlq9", "is_submitter": "True", "link_id": "t3_lkbibu", "parent_id": "t1_gnrbr1d", "score": "2", "subreddit": "gaidhlig", "subreddit_id": "t5_2tift"}, {"author": "Krkboy", "body": "Do people still use Gaelic as a community language in South Uist then, or is English still dominant?", "created_utc": "1613561709.0", "edited": "False", "id": "gnr6xi5", "is_submitter": "True", "link_id": "t3_lkbibu", "parent_id": "t1_gnqz2bn", "score": "2", "subreddit": "gaidhlig", "subreddit_id": "t5_2tift"}, {"author": "Krkboy", "body": "If you don't mind me asking, did you and your friends still speak Gaelic with your parents/grandparents? What's your Gaelic like now compared to your English?", "created_utc": "1613467384.0", "edited": "False", "id": "gnmpdd9", "is_submitter": "True", "link_id": "t3_lkbibu", "parent_id": "t1_gnl0zrj", "score": "4", "subreddit": "gaidhlig", "subreddit_id": "t5_2tift"}, {"author": "Krkboy", "body": "It's more the case that natives learn to speak fluently before learning to read and write. If the sounds are the same then people who are less educated/read less/aren't linguistically inclined will trip up occasionally. That's true of any language which isn't fully phonetic. I didn't say Polish orthography is easy, but it's certainly not as complicated as other European languages (English, French, Greek, Russian etc.).", "created_utc": "1613371159.0", "edited": "False", "id": "gnienpa", "is_submitter": "False", "link_id": "t3_ljfz8i", "parent_id": "t1_gnidg6e", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Krkboy", "body": "Most of this is economics. Germans need to use English to communicate with anyone outside of Germany (and Austria, Switzerland). English speakers rarely **need** to know German. This translates into a bigger global presence of English, more opportunities/resources/teachers to learn it, and - crucially - much more motivation. If German was the dominant global language then everyone would be absorbing that from primary school and considering it easy instead.", "created_utc": "1613362709.0", "edited": "False", "id": "gni2e2u", "is_submitter": "False", "link_id": "t3_ljfz8i", "parent_id": "t1_gneq0u7", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Krkboy", "body": "Poles often like to think their orthography is difficult given the rz/ż, ó/u, ch/h pairs you mentioned, and the devoicing of consonants at the end of words. But in reality it's a very regular writing system. Russian, for example, is much more irregular. English has got be one of the most messy orthographies of them all though; we practically have to learn each word as it comes with weekly spelling tests in primary schools. It's far more irregular (difficult?) than Polish orthography.", "created_utc": "1613362400.0", "edited": "False", "id": "gni1vlj", "is_submitter": "False", "link_id": "t3_ljfz8i", "parent_id": "t1_gndwx6u", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Krkboy", "body": "Might be a bit late to the party here but I thought I'd add my two cents. \n\nI came to JET after 1 year of evening classes so at a guess I would say I was around N5. After 2.5 years I passed N2 and now I'm looking to pass N1 at the end of my (current) fourth year. I suppose it's something of success story in progress! 4 years is probably a bit longer than you were envisaging but I would like to add that learning Japanese fluently is a very-multifaceted adventure that reaches far beyond JLPT. Here are some of my thoughts. \n\n\\- Remember that the JLPT exams only test you passive skills. Learning to actually speak and write using that grammar/vocab etc will take longer. \n\n\\- I made sure I could actively use N5-N3 grammar/vocab pretty much automatically. These are the corners stones of 90%+ of the Japanese you'll encounter everyday. \n\n\\- I think it's worth learning to read **and** write Kanji. The 'even the Japanese can't write Kanji anymore' argument is grossly exaggerated. Any university educated Japanese person (i.e. you, had you been born Japanese) will be able to write most joyo Kanji, and read way more. And every Japanese person, during their school years at least, could write them at some point. Learning how each Kanji is constructed really gets you closer to the meanings. For the record, I've just finished KanjiDamage on ANKI (about 1700 Kanji) and I can write (almost) all of them. It's been extremely handy at work as an ALT when writing on the board ;)\n\n\\- Pronunciation is something which is often overlooked, both individual phonemes and pitch accent. I took a 6 month break in my studies to complete Dogen's Japanese phonetics course on Patreon, and my pronunciation really improved. The first time you get mistaken for a local on the phone is a massive boost!\n\n\\- I work in ES and JHS and use Japanese 90% of the time. It's a fantastic way to learn. Children have no filter and will immediately tell you (laugh) if something is off. You need to develop a bit of a thick skin but once they stop laughing and start treating you just like the other teachers then you know you're onto something. \n\n\\- I would recommend the Japan Times publisher and pretty much all their textbooks. Work through them, one at a time, with a tutor. I'm currently halfway through 中級から上級への日本語 having 1-on-1 lessons at a local language school. Italki is also useful. Study for 1/2 hours every day if you can. As others have said, you won't access the higher N1/N2 material unless you actively study. It's mostly formal/literary/written Japanese at this stage. \n\n\\- Be very proactive speaking it. I date a lot here and it's been a fantastic way to improve haha. \n\n\\- READ. Read read read. Especially once you've passed N2. I'd recommend a Kindle and downloading the Japanese/English dictionary. Netflix (with Japanese subtitles initially). \n\nUltimately, for me, learning the language thoroughly is more important than simply passing N1, so I'd rather take 4/5 years and come out actually fluent, than rush through in 3 and have not really mastered the nuts and bolts of the language. Hope this helps!", "created_utc": "1607736916.0", "edited": "False", "id": "gfh3mxc", "is_submitter": "False", "link_id": "t3_k5hd95", "parent_id": "t3_k5hd95", "score": "4", "subreddit": "JETProgramme", "subreddit_id": "t5_2w9xe"}, {"author": "Krkboy", "body": "If you're already around the N2 mark and you're looking push through to N1 then regardless of the country you're living in it'll be down to how much studying you can do. Most (almost all it seems!) of the vocabulary and grammar isn't something you'll come across in everyday life. This is particularly true of writing skills - unless you go out of your way to write regularly and have it checked by a native then you won't improve.\n\nIf you're speaking is still a bit wobbly then living in Japan will be enormously beneficial. Particularly if you are able to work in an elementary school as an ALT or bag a CIR position that involves interpretation/presentations.\n\n'Near-native proficiency' is another ball-game entirely. My Japanese is N1 level and I'm nowhere near close to that of a native speaker. The difference between what I can do in English (my native language) and Japanese is vast. You'd need to be living and working (and socialising/dating/reading etc.) in Japanese, in Japan, for the best part of a decade I'd imagine.  Just think how many Japanese people you've met who are honestly close to that of a native English speaker. I've met one, possibly two. And they'd both lived in the USA for a very long time before coming back to Japan.\n\nI don't know what your PhD proposal is, but I would have thought living and working in the country concerned would only be of benefit if you used the time well. Even if it's just learning to see things from a 'Japanese prospective'. Keep that western-bias in check ;) \n\nEDIT: Just read some of your replies to other comments! That sounds like a pretty interesting research topic! For what it's worth, I've noticed a huge difference in the way Japan conceptualises/practices religion and sexuality compared to many Western countries. I would say living here with an open mind would be very beneficial. Otherwise, I'd imagine you'll just be basing it all on what Western theorists have to say about Japan which... well, I'm not sure the world needs any more of.. haha", "created_utc": "1607641785.0", "edited": "1607642029.0", "id": "gfbwrb5", "is_submitter": "False", "link_id": "t3_k9swz2", "parent_id": "t3_k9swz2", "score": "2", "subreddit": "JETProgramme", "subreddit_id": "t5_2w9xe"}, {"author": "Krkboy", "body": "Well, I think in this person's case they were quite insecure about their Japanese so they thought themselves superior because they knew loads of slang.. but you're right, that's no reason to sneer at others! I think it's worth saying that I know of/have met quite a few foreigners who speak Japanese very fluently. But it's extremely rare to meet someone who is fully literate on par with an educated native (i.e. being able to read newspapers/novels etc. with ease, write reports/essay pretty much error-free). The Japanese learn their own written language for YEARS at school practising every day. It's really hard to replicate this as an adult! But it definitely is possible :)", "created_utc": "1605870660.0", "edited": "False", "id": "gcxjfvb", "is_submitter": "False", "link_id": "t3_jvnmmt", "parent_id": "t1_gcx63l6", "score": "2", "subreddit": "LearnJapanese", "subreddit_id": "t5_2qyls"}, {"author": "Krkboy", "body": "I've seen this kind of snobbery as well. There's a kind of trend in language learning at the moment which say 'forget textbooks, forget grammar, just speak!'. This will only get you to a certain point. \n\nOne of my foreign colleagues at work watched a lot of Japanese TV and had a pretty impressive accent, and also was quite active on SNS so could text really colloquially. But he would sneer at people learning kanji and preparing for N2/N1 because it wasn't 'real Japanese' and 'Japanese have forgotten how to write'. He's now stuck working in a kindergarten now because he can't read or write properly, and so can't work in a Japanese-language environment. \n\nIf you're serious about Japanese, I agree that it's important to get a good handle on speaking and everyday Japanese. But if you want to be fluent to an advanced level AND literate there's no short-cut. This is especially true of Japanese because there are so many levels of the language you won't meet in everyday conversation.", "created_utc": "1605856470.0", "edited": "False", "id": "gcx5zo0", "is_submitter": "False", "link_id": "t3_jvnmmt", "parent_id": "t3_jvnmmt", "score": "2", "subreddit": "LearnJapanese", "subreddit_id": "t5_2qyls"}, {"author": "Krkboy", "body": "I can definitely recommend Rapid Reading Japanese - it transformed my reading skills :D", "created_utc": "1605826919.0", "edited": "False", "id": "gcvsqgo", "is_submitter": "False", "link_id": "t3_jwq128", "parent_id": "t1_gcrt6nk", "score": "2", "subreddit": "LearnJapanese", "subreddit_id": "t5_2qyls"}, {"author": "Krkboy", "body": "I'm currently working through that textbook with a tutor in a local language school. According to them the grammar and vocab is N2 and a good chunk of N1, too. If you're looking to pass JLPT N1 then the Try (N1) series seem highly recommended [https://www.amazon.co.jp/-/en/ABK-%E8%B2%A1%E5%9B%A3%E6%B3%95%E4%BA%BA-%E3%82%A2%E3%82%B8%E3%82%A2%E5%AD%A6%E7%94%9F%E6%96%87%E5%8C%96%E5%8D%94%E4%BC%9A/dp/4872179048](https://www.amazon.co.jp/-/en/ABK-%E8%B2%A1%E5%9B%A3%E6%B3%95%E4%BA%BA-%E3%82%A2%E3%82%B8%E3%82%A2%E5%AD%A6%E7%94%9F%E6%96%87%E5%8C%96%E5%8D%94%E4%BC%9A/dp/4872179048) \n\nIf you're keen to continue with textbooks then try improving your writing skills (often the weakest skill in advanced learners). I've heard good things about 大学で学ぶための日本語ライティング [https://bookclub.japantimes.co.jp/jp/book/b309580.ht**ml**](https://bookclub.japantimes.co.jp/jp/book/b309580.html)\n\nOr if you're interested in using Japanese professionally for business, then maybe ビジネス日本語 オール・イン・ワン問題集 [https://bookclub.japantimes.co.jp/en/book/b309678.html](https://bookclub.japantimes.co.jp/en/book/b309678.html)\n\nOther than that definitely start reading things you're interested in and check out Japanese netflix/amazon prime for dramas and movies. At this stage I'd challenge yourself to watch them without Japanese subtitles. \n\nDogen's Japanese phonetics course (on Patreon) is worth trying if you're keen to improve your pronunciation. And then shadowing some decent material to make it stick. \n\nBest of luck!", "created_utc": "1605826877.0", "edited": "False", "id": "gcvsn6s", "is_submitter": "False", "link_id": "t3_jwq128", "parent_id": "t3_jwq128", "score": "1", "subreddit": "LearnJapanese", "subreddit_id": "t5_2qyls"}, {"author": "Krkboy", "body": "If you want to be fluent AND literate enough in Japanese to enjoy reading books and watch TV comfortably you need to invest both time (realistically 5 years +, ideally living in Japan) and a decent amount of money in tutors/apps/textbooks/native materials. That's the reality I'm afraid. Japanese is a big mountain to climb. With hiragana and katakana you're not even in the foothills... \n\nHaving said that, it's one of the best climbs I've ever done!", "created_utc": "1605606201.0", "edited": "False", "id": "gclha1y", "is_submitter": "False", "link_id": "t3_jvm2hs", "parent_id": "t3_jvm2hs", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Krkboy", "body": "Japan. Especially if it's outside of the tourist areas. Even in Kyoto/Tokyo if you stray off the tourist route you'll be pretty stuck. Oftentimes signage is provided in several languages but actually conversing with a local is a different story. Russia was similar outside of the tourist areas but I was able to get by with Polish ;)", "created_utc": "1605605814.0", "edited": "False", "id": "gclgx23", "is_submitter": "False", "link_id": "t3_jvipff", "parent_id": "t3_jvipff", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Krkboy", "body": "I would heartily recommend listening to Japanese podcasts everyday so that you're immersing yourself in it. Try **Nihongo con Teppei** \\- there's a beginner and intermediate version available on Spotify, iTunes and Castbox (which is what I use), for free. Basically, the speaker - a Japanese guy called Teppei - choses a topic and speaks for 10/20 minutes everyday, record\bs and uploads it.\n\nContent-wise it's not majorly exciting, but it is humorous and easy to listen too. And you'll hear all the Genki grammar/vocab repeated everyday in different ways. Start with the beginner one and see how you do. After a while it sort of gets under your skin and your listening and speaking start to noticeably improve - like you I found it really hard to grasp what was being spoken around me; now I wonder how it was ever a problem! Best of luck.", "created_utc": "1604750588.0", "edited": "1604757637.0", "id": "gbg2d5i", "is_submitter": "False", "link_id": "t3_jod2gi", "parent_id": "t3_jod2gi", "score": "1", "subreddit": "japanese", "subreddit_id": "t5_2qmnp"}, {"author": "Krkboy", "body": "Try doing the listening towards the end of each chapter, once you have the vocabulary under your belt. I think there might be a transcript of the listening section somewhere at the back, too. It's worth mentioning that you don't need to understand everything you hear to get the main point. Keep going over it and your ears will catch up, and you'll soon wonder why it was ever a problem!", "created_utc": "1603374630.0", "edited": "False", "id": "g9narlg", "is_submitter": "False", "link_id": "t3_jfk560", "parent_id": "t1_g9n29po", "score": "3", "subreddit": "LearnJapanese", "subreddit_id": "t5_2qyls"}, {"author": "Krkboy", "body": "You can do all your amazon shopping in English. I think that's the same for Rakuten as well - it's very easy to do. I wouldn't worry about the language barrier; if you put in the effort things will skyrocket once you're here :)", "created_utc": "1603329824.0", "edited": "False", "id": "g9lqzfi", "is_submitter": "False", "link_id": "t3_jf2xqh", "parent_id": "t1_g9ljnc0", "score": "3", "subreddit": "JETProgramme", "subreddit_id": "t5_2w9xe"}, {"author": "Krkboy", "body": "UK size 12 (Japan 30 cm) shoe-wearer here! You can order shoes online once you get here, but it wouldn't hurt to bring a pair over to start with. **Crocs** all the way. Cool in summer, you can add thick sock in winter. You'll be on your feet a lot and they're easy to clean!", "created_utc": "1603322026.0", "edited": "False", "id": "g9ldeq8", "is_submitter": "False", "link_id": "t3_jf2xqh", "parent_id": "t3_jf2xqh", "score": "3", "subreddit": "JETProgramme", "subreddit_id": "t5_2w9xe"}, {"author": "Krkboy", "body": "Just to add another perspective: if you're struggling to find motivation to the point you're asking for advice online why not give yourself permission to just move on? You worked hard, learnt Japanese, fulfilled your dream of living in Japan, and then moved on to the next step. Maybe it doesn't have to be part of who you are any more..\n\nBefore I came to Japan I lived in Poland for 4 years - 1 year studying Polish full-time and then working for 3 years as a translator and teacher. It was great fun. Wouldn't change a thing. Similar to you, at my peak I was C1/C2 but now that I'm in Japan working towards N1 and living my life here, Polish has just faded into the background. It'll never go away completely but it's not what it was. Life is in chapters. Maybe have a think about what really peaks your interest now and go with that?", "created_utc": "1603321805.0", "edited": "False", "id": "g9ld0qn", "is_submitter": "False", "link_id": "t3_jfgapd", "parent_id": "t3_jfgapd", "score": "9", "subreddit": "LearnJapanese", "subreddit_id": "t5_2qyls"}, {"author": "Krkboy", "body": "I went straight from Genki 2 to Tobira. I really can't praise the textbook enough. It comes with separate Kanji and Grammar workbooks, ready-made downloadable anki decks (with audio from what I remember), supplementary practice sheets (downloadable), videos related to the topic and **answers to all the exercises** (which AIAIJ doesn't). I'm now at N1 level and feel that Tobira gave me a really solid foundation with Japanese. \n\nAs another poster wrote, it is a step up in terms of length but bear with it and take it slowly to begin with. In the vocabulary lists provided, the words you should be learning are highlighted in bold whereas the words you just need to get through the reading are not. That should make it more manageable. The vocabulary, kanji and grammar in this book are things I hear everyday in Japan and I found the way it was presented to be fun and engaging. One recommendation: listen to the reading audio (there's a CD and it's on the website) multiple times. This will help it stick and will also improve your intonation. Read out loud as well; this is how Japanese children learn to read (音読). \n\nI have AIAIJ as well but I wouldn't recommend it for self study. Mostly because there's no answer book. I would recommend going through it at a fast pace once you've finished Tobira for consolidation purposes. \n\nI personally didn't supplement it with anything else, but I literally did every exercise the books/website had to offer. I was/am living in Japan however. Wherever you are, I would recommend getting into the habit of reviewing everyday with Anki or similar. Best of luck! (\\^\\^)", "created_utc": "1603321224.0", "edited": "False", "id": "g9lc02l", "is_submitter": "False", "link_id": "t3_jfk560", "parent_id": "t3_jfk560", "score": "9", "subreddit": "LearnJapanese", "subreddit_id": "t5_2qyls"}, {"author": "Krkboy", "body": "Thanks for your response. This seems to be a common theme: Japanese + a marketable skill. I think it's definitely worth thinking about where my interests lie and what skill(s) I want to develop.", "created_utc": "1603090512.0", "edited": "False", "id": "g9avyhx", "is_submitter": "True", "link_id": "t3_jdebv7", "parent_id": "t1_g98q2x8", "score": "3", "subreddit": "japanlife", "subreddit_id": "t5_2rg2o"}, {"author": "Krkboy", "body": "Thank you for such a detailed response. I'm trying to take advantage of what JET has to offer (e.g. the translation and interpreting course, internships, volunteering etc.). Where would be the best place to get some professional advice regarding the job market and various sectors? Would you recommend teaming up with a recruitment firm?", "created_utc": "1603090404.0", "edited": "False", "id": "g9avup4", "is_submitter": "True", "link_id": "t3_jdebv7", "parent_id": "t1_g97wx5f", "score": "1", "subreddit": "japanlife", "subreddit_id": "t5_2rg2o"}, {"author": "Krkboy", "body": "You were definitely right to pick up on that. My main motivation is to still live in Japan but to have a job where I can use Japanese as well. I definitely think it's worth taking a step back and thinking about whether a masters would be worth it.", "created_utc": "1603090271.0", "edited": "False", "id": "g9avpy0", "is_submitter": "True", "link_id": "t3_jdebv7", "parent_id": "t1_g99g3bv", "score": "1", "subreddit": "japanlife", "subreddit_id": "t5_2rg2o"}, {"author": "Krkboy", "body": "Thank you for such a positive response :) I'll work on developing as many skills as I can while still on JET and start looking into areas I'm interested in like (PR, HR etc.) and see what's available when I'm looking.", "created_utc": "1603090148.0", "edited": "False", "id": "g9avlkk", "is_submitter": "True", "link_id": "t3_jdebv7", "parent_id": "t1_g9atdhp", "score": "1", "subreddit": "japanlife", "subreddit_id": "t5_2rg2o"}, {"author": "Krkboy", "body": "Business Japanese is exactly what I'm working on right now.", "created_utc": "1603089983.0", "edited": "False", "id": "g9avfl7", "is_submitter": "True", "link_id": "t3_jdebv7", "parent_id": "t1_g97jed5", "score": "3", "subreddit": "japanlife", "subreddit_id": "t5_2rg2o"}, {"author": "Krkboy", "body": "My main motivation to return to the UK was that it's a lot easier to get funding for studying in the UK, or at least loans. But I'll have a look through those websites! Thanks for your help.", "created_utc": "1603089938.0", "edited": "False", "id": "g9avdw8", "is_submitter": "True", "link_id": "t3_jde48h", "parent_id": "t1_g99qfvr", "score": "2", "subreddit": "JETProgramme", "subreddit_id": "t5_2w9xe"}, {"author": "Krkboy", "body": "No, I'd rather people were completely honest so that I can get a realistic picture - so thanks for that :) By networking do you mean attending JET career events and applying for internships etc?", "created_utc": "1603089846.0", "edited": "False", "id": "g9avani", "is_submitter": "True", "link_id": "t3_jde48h", "parent_id": "t1_g99uqp1", "score": "3", "subreddit": "JETProgramme", "subreddit_id": "t5_2w9xe"}, {"author": "Krkboy", "body": "Thanks for this! It seems like a very realistic assessment: pick a field that interests you, expect a drop in salary for a few years, then work your way up!", "created_utc": "1603089692.0", "edited": "False", "id": "g9av55e", "is_submitter": "True", "link_id": "t3_jde48h", "parent_id": "t1_g99xd9t", "score": "5", "subreddit": "JETProgramme", "subreddit_id": "t5_2w9xe"}, {"author": "Krkboy", "body": "We've got two American JETs set to come to our city in Yamaguchi Prefecture and are very excited! There's been so few of us since the summer :D", "created_utc": "1603017405.0", "edited": "False", "id": "g97dmm9", "is_submitter": "False", "link_id": "t3_jc1a5y", "parent_id": "t3_jc1a5y", "score": "9", "subreddit": "JETProgramme", "subreddit_id": "t5_2w9xe"}]