[{"author": "KrysiSenpai", "body": "Bro, we love you and you're our hero, but for the love of god go to sleep before we lose you", "created_utc": "1666950242.0", "edited": "False", "id": "iu3p2rk", "is_submitter": "False", "link_id": "t3_yff4ng", "parent_id": "t1_iu3lvnq", "score": "31", "subreddit": "victoria3", "subreddit_id": "t5_30k9i"}, {"author": "KrysiSenpai", "body": "Tbh, I think Vic 3 is the best paradox release title. I've played eu4, stellaris, hoi4 and ck3 on release and this is probably the most fun i ever had with a paradox game on release. Sure, it has a lot of stuff to improve, but oh god do I love watching gdp go up", "created_utc": "1666819846.0", "edited": "False", "id": "itwr6z6", "is_submitter": "False", "link_id": "t3_ye6o09", "parent_id": "t3_ye6o09", "score": "4", "subreddit": "victoria3", "subreddit_id": "t5_30k9i"}, {"author": "KrysiSenpai", "body": "R5: Passed public healthcare playing as US of A, baby. I love how this game lets me make highly unrealistic scenarios!", "created_utc": "1666815720.0", "edited": "False", "id": "itwgj27", "is_submitter": "True", "link_id": "t3_ye7vcj", "parent_id": "t3_ye7vcj", "score": "3", "subreddit": "victoria3", "subreddit_id": "t5_30k9i"}, {"author": "KrysiSenpai", "body": "Yes doctor im totally sick yes doctor ill be in bed all the time \n\nYup, called in sick as well, I've got the entire week just for Vic 3 :D", "created_utc": "1666718399.0", "edited": "False", "id": "itqw3ui", "is_submitter": "False", "link_id": "t3_yd4upe", "parent_id": "t3_yd4upe", "score": "1", "subreddit": "victoria3", "subreddit_id": "t5_30k9i"}, {"author": "KrysiSenpai", "body": "Same, called in sick for entire week! Cant wait", "created_utc": "1666707800.0", "edited": "False", "id": "itq58fx", "is_submitter": "False", "link_id": "t3_yd5vlw", "parent_id": "t1_itq4bje", "score": "5", "subreddit": "victoria3", "subreddit_id": "t5_30k9i"}, {"author": "KrysiSenpai", "body": "Błagam zabieszcie mnie stąd one są gigantyczne", "created_utc": "1666456631.0", "edited": "False", "id": "itck7u6", "is_submitter": "True", "link_id": "t3_yas1ww", "parent_id": "t1_itck1u3", "score": "26", "subreddit": "Polska_wpz", "subreddit_id": "t5_zgpel"}, {"author": "KrysiSenpai", "body": "Gotta say, i got my ps5 only last week so i haven't got a chance to play around too much. I only played control, ghostwire tokyo and the outer worlds, by man, is this controller fucking amazing. Vibrations feel so good and those triggers.. god, can't wait to play more, already one of the best things ive bought since so long", "created_utc": "1666364729.0", "edited": "False", "id": "it7nwde", "is_submitter": "False", "link_id": "t3_y9i4in", "parent_id": "t3_y9i4in", "score": "1", "subreddit": "PS5", "subreddit_id": "t5_2s887"}, {"author": "KrysiSenpai", "body": "I wish, we're still waiting for them to at least release a rdr2 patch for ps5", "created_utc": "1666068339.0", "edited": "False", "id": "isrmbz9", "is_submitter": "False", "link_id": "t3_y6om9r", "parent_id": "t1_isqc3iz", "score": "47", "subreddit": "PS5", "subreddit_id": "t5_2s887"}, {"author": "KrysiSenpai", "body": "Tak samo. Chociaż myśle czy nie zrobic na przyszłość, ale póki co mam to szczęście, że moja praca jest 7 minut drogi z buta od mieszkania", "created_utc": "1665570749.0", "edited": "False", "id": "is069to", "is_submitter": "False", "link_id": "t3_y1yzru", "parent_id": "t1_is02r6c", "score": "15", "subreddit": "Polska", "subreddit_id": "t5_2qiqo"}, {"author": "KrysiSenpai", "body": "Man, can't wait, shitty that I have a late shift at work so :( might call in sick though..", "created_utc": "1665501514.0", "edited": "False", "id": "irwdfy3", "is_submitter": "False", "link_id": "t3_y1b5df", "parent_id": "t3_y1b5df", "score": "2", "subreddit": "victoria3", "subreddit_id": "t5_30k9i"}, {"author": "KrysiSenpai", "body": "Pracuję w obsludze klienta, generalnie niektóre maile są wysyłane automatycznie na następne godziny lub dni, dlatego można coś dostać jeszcze po odsubskrybowaniu. W mailu z wypowiedzeniem subskrybcji powinna być o tym informacja, przynajmniej u nas o tym informujemy", "created_utc": "1665496672.0", "edited": "False", "id": "irw1x6s", "is_submitter": "False", "link_id": "t3_y16jmi", "parent_id": "t3_y16jmi", "score": "11", "subreddit": "Polska", "subreddit_id": "t5_2qiqo"}, {"author": "KrysiSenpai", "body": "Oh man, them paradox games really do change lives. Cheers to you bro, glad everything's working out! Funnily enough, I am working at a call center rn :D", "created_utc": "1665078661.0", "edited": "False", "id": "irb4dwq", "is_submitter": "False", "link_id": "t3_xww9e4", "parent_id": "t1_irb31n5", "score": "1", "subreddit": "victoria3", "subreddit_id": "t5_30k9i"}, {"author": "KrysiSenpai", "body": "20% inflation here, I'm spending my money like crazy coz i know it'll be worthless soon lmao\n\nAlso, speaking of, God save the turks", "created_utc": "1665075887.0", "edited": "False", "id": "irax9h1", "is_submitter": "False", "link_id": "t3_xww9e4", "parent_id": "t1_ir9e3ib", "score": "7", "subreddit": "victoria3", "subreddit_id": "t5_30k9i"}, {"author": "KrysiSenpai", "body": "Bro, I've literally just got my first time job and I spent my very first salary on vic3 grand editon the moment it appeared on my bank account. If that's not dedication, I don't know what is!", "created_utc": "1665075777.0", "edited": "False", "id": "irawzgj", "is_submitter": "False", "link_id": "t3_xww9e4", "parent_id": "t1_ir915zx", "score": "3", "subreddit": "victoria3", "subreddit_id": "t5_30k9i"}, {"author": "KrysiSenpai", "body": "Few people have already shared their opinions, but maybe I can add something from myself :)\n\nAbout Univeristies in Poland - they surely aren't that bad, some will say they're actually pretty decent. But I think there's one thing you have to be prepared to face: organisation. Polish universities tend to be an unorganised nightmare. They might be good itself, but prepare for even uni lecturers not having a clue the fucks going on sometimes. Although maybe it's different on the one you want to attend, but still, I think that's the one thing you'll surely notice very soon. \n\nSomeone shared their opinion about working in Poland as well, as in, that you'll basically be used as a low-wage slave. While some of that is true, I think it's only half the truth. It depends on the company, but if you want to have a good job, stick far from small, polish companies, those tend to be the most problematic. If you have some job experience, I think multinational corporations are a safe bet. I know, there's a lot of bad aura around them, but there's a lot of corpos that are actually pretty good and pay really well. It really depends on the company you'll get hired to, but speaking for myself, if you have any useful skill that can probably be one of the best places to work in. I'm really happy myself, I work for a German company and its honestly great, and they also pay very well.\n\nAnyway, I think overall Poland isn't like the worst place to settle in. It's got a share of its problems, most of them being that our government fucking sucks lmao. But we're working on it, so ;) I hope you'll feel welcomed here!", "created_utc": "1665073393.0", "edited": "False", "id": "iraqrht", "is_submitter": "False", "link_id": "t3_xwzkkr", "parent_id": "t3_xwzkkr", "score": "1", "subreddit": "poland", "subreddit_id": "t5_2qkmn"}, {"author": "KrysiSenpai", "body": "Got baited, already preorder yesterday, can't fucking wait", "created_utc": "1665034414.0", "edited": "False", "id": "ir8xobo", "is_submitter": "False", "link_id": "t3_xww9e4", "parent_id": "t3_xww9e4", "score": "226", "subreddit": "victoria3", "subreddit_id": "t5_30k9i"}, {"author": "KrysiSenpai", "body": "Und ich habe beide Feiertage frei weil ich im deutschen Kundenservice in Polen arbeite ;P", "created_utc": "1664828547.0", "edited": "False", "id": "iqxgoos", "is_submitter": "False", "link_id": "t3_xugeli", "parent_id": "t3_xugeli", "score": "2", "subreddit": "GeschichtsMaimais", "subreddit_id": "t5_2irffv"}, {"author": "KrysiSenpai", "body": "I think so, all other pdx games are there and I think CK3 was there on release too. Gonna be sad if its not coz no way my laptop will be going to run it ;-;", "created_utc": "1664805450.0", "edited": "False", "id": "iqvto6x", "is_submitter": "False", "link_id": "t3_xuhaxz", "parent_id": "t3_xuhaxz", "score": "5", "subreddit": "victoria3", "subreddit_id": "t5_30k9i"}, {"author": "KrysiSenpai", "body": "Oh yeah, TNO is probably my favourite mod, like, out of all paradox games, but the team said that they're not going to do one for Vic 3 since they wanna focus on hoi4, so there would have to be an another team :(", "created_utc": "1664478128.0", "edited": "False", "id": "iqeic6r", "is_submitter": "False", "link_id": "t3_xrbli4", "parent_id": "t1_iqe5thc", "score": "24", "subreddit": "victoria3", "subreddit_id": "t5_30k9i"}, {"author": "KrysiSenpai", "body": "I wonder if we'll have some mods on release, since we had a few total conversions for ck3 on release. And i can't wait for a cold war mod, it's my favourite for vic2!", "created_utc": "1664470107.0", "edited": "False", "id": "iqdxuy3", "is_submitter": "False", "link_id": "t3_xrbli4", "parent_id": "t3_xrbli4", "score": "59", "subreddit": "victoria3", "subreddit_id": "t5_30k9i"}, {"author": "KrysiSenpai", "body": "As someone who's already played Ishin I can tell you that this is one of the best and most fun Yakuza games and you can be damn right I'll buy it again. Sega and RGG studios can take all my money for this!", "created_utc": "1663179186.0", "edited": "False", "id": "iofenua", "is_submitter": "False", "link_id": "t3_xdk5fb", "parent_id": "t3_xdk5fb", "score": "1", "subreddit": "yakuzagames", "subreddit_id": "t5_2xx8w"}, {"author": "KrysiSenpai", "body": "Yeah, I think Poland morally does deserve some sort of reparations, after all our country was utterly destroyed by it, but Germany after all of that gets to be earth's fourth largest economy. But what we need is a serious discussion between both of our countries, what we need is cooperating and trying to do this together, and I can't stress it enough, we need to do this with working together in mind and with staying on good terms with each other. Unfortunately, we all know that it's not what PiS wants, all they're doing is using this topic to create hate and to get more votes in upcoming elections. As long as that's the way our government wants to get reparations, we will not get anything, and it's not Germany to blame here.", "created_utc": "1662821189.0", "edited": "False", "id": "inv0e26", "is_submitter": "False", "link_id": "t3_xacls7", "parent_id": "t3_xacls7", "score": "3", "subreddit": "poland", "subreddit_id": "t5_2qkmn"}, {"author": "KrysiSenpai", "body": "It looks great, I need more pics!!", "created_utc": "1662288766.0", "edited": "False", "id": "in1g2cr", "is_submitter": "False", "link_id": "t3_x5il19", "parent_id": "t3_x5il19", "score": "1", "subreddit": "CitiesSkylines", "subreddit_id": "t5_331rj"}, {"author": "KrysiSenpai", "body": "I feel like we've all collectively forgot ck2 death sounds. Like come on, am I the only one that misses hearing people I kill die in agony?", "created_utc": "1662288537.0", "edited": "False", "id": "in1frru", "is_submitter": "False", "link_id": "t3_x592ns", "parent_id": "t3_x592ns", "score": "23", "subreddit": "CrusaderKings", "subreddit_id": "t5_2tgic"}, {"author": "KrysiSenpai", "body": "Oj tak, też dużo słyszałem o schodzeniu z duloksetyny XD nawet jak dzień zapomnę wziąć to mam przejebane na następne 2 dni XD Ale niestety to jedyne leki które na mnie działają, przeszedłem przez ostatnie kilka lat chyba przez 10 różnych antydepresantów i nic nie działało", "created_utc": "1661545073.0", "edited": "False", "id": "ilwydha", "is_submitter": "False", "link_id": "t3_wydug9", "parent_id": "t1_ilwv81k", "score": "2", "subreddit": "Polska", "subreddit_id": "t5_2qiqo"}, {"author": "KrysiSenpai", "body": "Od ponad roku jestem na duloksetynie i lamitrin, jest o wiele lepiej. Pół życia zmagałem się z silną depresją i myślami samobójczymi, dzisiaj jest zajebiście. Chcę nawet zacząć schodzić z leków bo w sumie zaczynają mi bardziej przeszkadzać niż pomagać (głównie to, że przez duloksetyne pocę się jak świnia ;-;)", "created_utc": "1661534525.0", "edited": "False", "id": "ilw7uwn", "is_submitter": "False", "link_id": "t3_wydug9", "parent_id": "t3_wydug9", "score": "3", "subreddit": "Polska", "subreddit_id": "t5_2qiqo"}, {"author": "KrysiSenpai", "body": "Been trying to go back to civ 6 too, it's a great game, but oh god, my turns start being so long in later eras that I just can't stand it. I've been playing humankind too, since I loves endless space, and it's honestly a great base for an amazing game, but it's got some issues too. The thing that makes me play it so much is probably their turn system, I don't know how they do it, but it's so much faster than that in civ that I can actually enjoy my late game, I really hope they will try to improve and expand the game coz i really think that it might be better than civ if they do.", "created_utc": "1661439866.0", "edited": "False", "id": "ilqpsym", "is_submitter": "False", "link_id": "t3_wx9cyq", "parent_id": "t1_ilqhr4a", "score": "5", "subreddit": "victoria3", "subreddit_id": "t5_30k9i"}, {"author": "KrysiSenpai", "body": "Według mnie jeden z największych problemów dzisiejszych demokracji, nie tylko w Polsce ale właściwie w większości rozwiniętych krajów to kryzys demograficzny. Często się mówi jakie to jest obciążenie dla gospodarki i systemu emerytalnego, ale chyba nikt nie mówi o tym, jakie to stwarza problemy polityczne. Osób starszych jest po prostu o wiele więcej, więc aby realnie dostać się do polityki, to osoby starsze muszą być silnie faworyzowane i to właśnie głosy osób starszych i emerytów to te, o które trzeba najbardziej walczyć. A jak wszyscy wiemy, osoby starsze mają całkowicie inny światopogląd od osób młodych, już nie mówiąc o coraz większych obciążeniach systemu emerytalnego aby ich głosy dostać. Niestety prawda jest taka, że na młodych ludzi można mieć wyjebane, bo nie stanowią grupy elektoralnej o którą warto walczyć, już nie mówiąc o śmiesznej ilości osób głosujących wśród młodszej grupy wiekowej. No a starszych osób nie obchodzi jakiś tam nadchodzący kryzys klimatyczny czy to, że ich potomkowie będą mieli o wiele mniejsze emerytur, już nie mówiąc o coraz to bardziej rozwalonych instytucjach państwowych czy ingerencjach w nasz system demokratyczny. Najgorsze jest to, że to jest trochę sytuacja bez wyjścia, bo dopóki głosy emerytów to są te o które trzeba walczyć, to nikt z tym nic nie zrobi, a nawet jeśli, to nie widzę tutaj za bardzo dobrego rozwiązania, która nie ingerowała by jeszcze bardziej w system demokratyczny, co może otworzyć furtkę do kolejnych problemów.", "created_utc": "1661241439.0", "edited": "False", "id": "ilfh9d8", "is_submitter": "False", "link_id": "t3_wvhvl8", "parent_id": "t3_wvhvl8", "score": "88", "subreddit": "Polska", "subreddit_id": "t5_2qiqo"}, {"author": "KrysiSenpai", "body": "Let's just hope this shit is true, coz Russia has a history of allowing insurgencies to suck some money from the west. From what I know, the USSR in the 20s during purges actually assumed control of some insurgencies just to fuck with western intelligence and take their money", "created_utc": "1661161775.0", "edited": "False", "id": "ilavptd", "is_submitter": "False", "link_id": "t3_wugwq3", "parent_id": "t3_wugwq3", "score": "24", "subreddit": "NonCredibleDefense", "subreddit_id": "t5_i41xc"}, {"author": "KrysiSenpai", "body": "Jeśli to wszystko prawda, to wydaje mi się że Irlandia daje niezły przykład co może być dalej", "created_utc": "1661159780.0", "edited": "False", "id": "ilatbgx", "is_submitter": "False", "link_id": "t3_wunba2", "parent_id": "t1_ilarx59", "score": "28", "subreddit": "Polska", "subreddit_id": "t5_2qiqo"}, {"author": "KrysiSenpai", "body": "Can confirm, they mostly sell salty and caramel popcorn in polish cinemas. Lots of people seem not to like caramel popcorn for some reason, but I've gotta say, I fucking love it, I sometimes go to cinema just to eat it", "created_utc": "1660806490.0", "edited": "False", "id": "ikrl87g", "is_submitter": "False", "link_id": "t3_wqyp9m", "parent_id": "t1_ikpba16", "score": "3", "subreddit": "YUROP", "subreddit_id": "t5_2wivw"}, {"author": "KrysiSenpai", "body": "Yes.", "created_utc": "1660667338.0", "edited": "False", "id": "ikjdpem", "is_submitter": "False", "link_id": "t3_wo86cl", "parent_id": "t1_ik9hxya", "score": "29", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "KrysiSenpai", "body": "I think so too, tho it depends on where you live too! I live in Poland myself, and demand for German is HUGE here. A little bit of pity for me, coz I'm studying Japanese linguistics and there's no job for Japanese speakers here lmao, fortunately I speak German so it was easy to find something anyway. I've seen there's a lot of jobs for people speaking Asian languages in Benelux tho", "created_utc": "1660570692.0", "edited": "False", "id": "ikdqct5", "is_submitter": "False", "link_id": "t3_woptmg", "parent_id": "t1_ikdpzwa", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "KrysiSenpai", "body": "Can confirm, for people who speak English or German, Dutch sounds hilarious :p but there's something really nice in it!", "created_utc": "1660562631.0", "edited": "False", "id": "ikdbbbt", "is_submitter": "False", "link_id": "t3_woptmg", "parent_id": "t1_ikd5jpg", "score": "18", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "KrysiSenpai", "body": "As someone working in sales as well, yes, you should totally do that. There's a lot of demand for Dutch lately, and speaking Dutch pays a lot as well. I work with German and English too, and I've just started learning Dutch as well :) I wanna move to the Netherlands tho, so that's another motivation for me", "created_utc": "1660562543.0", "edited": "False", "id": "ikdb6fr", "is_submitter": "False", "link_id": "t3_woptmg", "parent_id": "t3_woptmg", "score": "6", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "KrysiSenpai", "body": "Mann, als jemand der in diesem Scheißloch leben muss, könnte ich mich für unsere Regierung mehr nicht schämen :( \n\nWir sind hier alle verärgert. Etwas ähnliches ist vor ein paar Jahren mit dem Weichsel passiert. Also, in Warschau hat es sich herausgestellt, dass der Fluss schwer verschmutzt ist. Aber weil in Warschau die Opposition regiert, also die liberale PO Partei, war die Reaktion unserer Regierung ganz anders. Obwohl Warschau sofort etwas damit tun versuchte und sofort die Bürger informierte, versuchte die Regierungspartei es ihnen schwer zu machen und vielleicht wäre es besser wenn ich nicht sage, was für Scheiss sie darüber im staatlichen Fernsehen sagten. \n\nJetzt weil das mit dem Oder in Regionen die von der Regierungspartei regiert sind passierte, ist die Reaktion der Regierung na ja ganz anders. Obwohl manche Organisationen über der Verschmutzung des Flusses schon in April sprechen begonnen haben, hat die Regierung damit nichts getan. Und obwohl die Fische schon seit eine Woche in große Menge sterben, versuchte die Regierung es eigentlich zum Schweigen bringen, deswegen denken viele Menschen, dass die Regierung damit irgendwie in Zusammenhang steht.", "created_utc": "1660414955.0", "edited": "False", "id": "ik5oglq", "is_submitter": "False", "link_id": "t3_wn9hoz", "parent_id": "t3_wn9hoz", "score": "3", "subreddit": "ich_iel", "subreddit_id": "t5_37k29"}, {"author": "KrysiSenpai", "body": "I zanim ktoś tu mi powie, że Ukraina też wprowadziła pobór, to dodam, że porównywanie Ukrainy do Polski jest całkowicie bez sensu. Ciężej dziwić się Ukrainie, ponieważ nie ma ona po swojej stronie żadnych sojuszników, a muszą walczyć z największym krajem na całej planecie, szczególnie, że wliczając Białoruś są właściwie otoczeni. Choć ta decyzja nadal jest według mnie trochę bezsensowna, to trzeba brać te fakty pod uwagę porównując te dwa kraje. Dodatkowo Ukraina zaczęła osiągać sukcesy po tym, jak zaczęli dostawać masę sprzętu z krajów NATO. Polska, w przeciwieństwie do Ukrainy, pozbawiona sojuszników nie jest i jest członkiem największego sojuszu defensywnego na świecie. Jeśli już, bardziej sensowne byłyby kursy lub akcje społeczne uczące tego co robić w wypadku wybuchu wojny, które byłyby dla wszystkich obywateli.", "created_utc": "1660373177.0", "edited": "False", "id": "ik3ma4h", "is_submitter": "True", "link_id": "t3_wmv8lu", "parent_id": "t1_ik3knig", "score": "21", "subreddit": "Polska", "subreddit_id": "t5_2qiqo"}, {"author": "KrysiSenpai", "body": "Przykład państwa o którym mówisz chyba najlepiej pokazuje, jak bardzo bez sensu jest pobór. Ludzie zapominają, w jakich czasach żyjemy, dzisiaj kluczem jest armia zawodowa oraz nowoczesny sprzęt wojskowy. Już nie mówiąc o tym, że jesteśmy członkami NATO.", "created_utc": "1660371979.0", "edited": "False", "id": "ik3knig", "is_submitter": "True", "link_id": "t3_wmv8lu", "parent_id": "t1_ik3ketc", "score": "35", "subreddit": "Polska", "subreddit_id": "t5_2qiqo"}, {"author": "KrysiSenpai", "body": "Sam screen mam z fb i nie udało mi się znaleźć źródła screena ani druku projektu, więc nie byłem pewien czy wstawiać, ale znalazłem artykuły o tym, tutaj linki:  \n[https://businessinsider.com.pl/wiadomosci/rzad-szykuje-obowiazkowa-sluzbe-wojskowa-eksperci-zwracaja-uwage-na-zapisy/gb8vefd?fbclid=IwAR1sQD07zzyjk-P4LKtMJ1StHdYI-HMvDNSv0jQTAREuf7kuwD7JlEgK2Qs](https://businessinsider.com.pl/wiadomosci/rzad-szykuje-obowiazkowa-sluzbe-wojskowa-eksperci-zwracaja-uwage-na-zapisy/gb8vefd?fbclid=IwAR1sQD07zzyjk-P4LKtMJ1StHdYI-HMvDNSv0jQTAREuf7kuwD7JlEgK2Qs)  \n\n\n[https://www.money.pl/gospodarka/pis-chce-powszechnej-sluzby-wojskowej-kolejny-krok-rzadu-6800552342657536a.html](https://www.money.pl/gospodarka/pis-chce-powszechnej-sluzby-wojskowej-kolejny-krok-rzadu-6800552342657536a.html)", "created_utc": "1660336578.0", "edited": "False", "id": "ik1kdn1", "is_submitter": "True", "link_id": "t3_wmv8lu", "parent_id": "t3_wmv8lu", "score": "12", "subreddit": "Polska", "subreddit_id": "t5_2qiqo"}, {"author": "KrysiSenpai", "body": "It's readable, and that's what's important! \n\nIt's not bad too, been studying Japanese for 3 years on uni and I still make mistakes, mostly coz I just write really fast. \n\nWhat you've got to work on are proportions, I'd advice you to get a grid notebook, it's going to make practicing characters much easier. And good luck!", "created_utc": "1660251774.0", "edited": "False", "id": "ijwqeqj", "is_submitter": "False", "link_id": "t3_wlx0f2", "parent_id": "t3_wlx0f2", "score": "2", "subreddit": "ChineseLanguage", "subreddit_id": "t5_2qyz1"}, {"author": "KrysiSenpai", "body": "If you need a look on some very old towns, check out Stockholm's old town! It's located on one of the islands and it could give you some pointers, buildings there are indeed so squeezed together that there actually is no place for any greenery, and no cars too :)", "created_utc": "1659986137.0", "edited": "False", "id": "ijhadu4", "is_submitter": "False", "link_id": "t3_wje813", "parent_id": "t1_ijh86i8", "score": "2", "subreddit": "CitiesSkylines", "subreddit_id": "t5_331rj"}, {"author": "KrysiSenpai", "body": "As people have already said, trees and parks! \n\nI totally agree with the guy saying your city would absorb lots of heat irl, living in an old European city myself, I can certainly say it's a huge problem and the city gets hold af in summer. It's often not a problem of old towns not having enough space, but city administration being dumb. \n\nThat trend is fortunately going away in many European cities, but in eastern Europe where I live, old towns are just big concrete blocks that feel like hell, and cities will often scrap green spaces to lay more concrete, my city's meme is that all our president does is just lying more concrete. I think Prague is a pretty good example of this, too. Many streets in the old town are actually big enough for trees, but the city apparently doesn't give a shit and instead of making the old town have nice and green streets for pedestrians, they made the old town as car-friendly as it's possible. All streets in old town in Prague are for cars unless it's literally impossible for them to fit, often leaving like 20 centimetres of street for pedestrians lmao\n\nHaving that said, I really like your city, you did a good job in making it look like an actual European city! :)", "created_utc": "1659984632.0", "edited": "False", "id": "ijh6eco", "is_submitter": "False", "link_id": "t3_wje813", "parent_id": "t3_wje813", "score": "3", "subreddit": "CitiesSkylines", "subreddit_id": "t5_331rj"}, {"author": "KrysiSenpai", "body": "Don't live in the US but in the EU, but personally, I think the US and the EU both should intervene, or at least make it as difficult for China by aiding Taiwan and imposing sanctions or blocking Chinese ships. Yeah, the US is far from perfect, but i still prefer the US that still is a democracy rather than an authoritarian state that China is. \n\nI just think that in a world that is become more and more authoritarian, democratic nations have to stick together so we can protect our freedom. And the Taiwanese people have the right to be free, and it's clear they don't want to lose it. \n\nI really do hope it doesn't come to that tho, coz it's going to suck for all of us, specially with how dependent we are on China.", "created_utc": "1659896271.0", "edited": "False", "id": "ijc8w82", "is_submitter": "False", "link_id": "t3_wihllx", "parent_id": "t3_wihllx", "score": "16", "subreddit": "SocialDemocracy", "subreddit_id": "t5_2sjw0"}, {"author": "KrysiSenpai", "body": "I think Hong Kong nailed the public transit thing, they own land around stations too and they make most of their money on lending it to bhssinessses, and they use that money on making tickets super cheap. But real estate prices are also super high in Hong Kong, so :l", "created_utc": "1659855872.0", "edited": "False", "id": "ija8nnl", "is_submitter": "False", "link_id": "t3_whucrh", "parent_id": "t1_ij84r6p", "score": "3", "subreddit": "SocialDemocracy", "subreddit_id": "t5_2sjw0"}, {"author": "KrysiSenpai", "body": "Yup, if you want to see what an aging population and a real estate bubble does to a country, there's no need to speculate, just look at Japan. It's been 30 years and they still can't get out of it", "created_utc": "1659813852.0", "edited": "False", "id": "ij7z53h", "is_submitter": "False", "link_id": "t3_whn6s6", "parent_id": "t1_ij72y7e", "score": "4", "subreddit": "China", "subreddit_id": "t5_2qh2v"}, {"author": "KrysiSenpai", "body": "I love how we achieved a point where instead of giving a shit about a fucking asteroid heading towards earth we discuss whether the size of it is in European or American football fields", "created_utc": "1659795932.0", "edited": "False", "id": "ij6t0ex", "is_submitter": "False", "link_id": "t3_whagcv", "parent_id": "t3_whagcv", "score": "1", "subreddit": "oddlyspecific", "subreddit_id": "t5_2wjlc"}, {"author": "KrysiSenpai", "body": "It gets even worse when you realise that the verb \"to take\" in Polish can also mean \"to fuck\" when using it with people", "created_utc": "1659773370.0", "edited": "False", "id": "ij5v3qa", "is_submitter": "False", "link_id": "t3_wh7lal", "parent_id": "t3_wh7lal", "score": "20", "subreddit": "shitduolingosays", "subreddit_id": "t5_2xfky"}, {"author": "KrysiSenpai", "body": "I must agree with China that European diplomats should make a clear statement on Taiwan, that is, recognise it as an independent nation :)", "created_utc": "1659720652.0", "edited": "False", "id": "ij2vh6y", "is_submitter": "False", "link_id": "t3_wgw6sp", "parent_id": "t3_wgw6sp", "score": "19", "subreddit": "europe", "subreddit_id": "t5_2qh4j"}, {"author": "KrysiSenpai", "body": "Just like the simulations", "created_utc": "1659703875.0", "edited": "False", "id": "ij1pz8k", "is_submitter": "False", "link_id": "t3_wgrbl9", "parent_id": "t3_wgrbl9", "score": "3", "subreddit": "civ", "subreddit_id": "t5_2rk3b"}, {"author": "KrysiSenpai", "body": "Jesus fuck how can you store such amount of water in those small ass balls", "created_utc": "1659695071.0", "edited": "False", "id": "ij1b76g", "is_submitter": "False", "link_id": "t3_wgr3s2", "parent_id": "t1_ij1ad5m", "score": "2", "subreddit": "NonCredibleDefense", "subreddit_id": "t5_i41xc"}, {"author": "KrysiSenpai", "body": "Let OP live his Chinese dream before we release 40 billion cubic meters of water into the Yangtze River", "created_utc": "1659693970.0", "edited": "False", "id": "ij19r5i", "is_submitter": "False", "link_id": "t3_wgr3s2", "parent_id": "t3_wgr3s2", "score": "6", "subreddit": "NonCredibleDefense", "subreddit_id": "t5_i41xc"}, {"author": "KrysiSenpai", "body": "I really loved anno 2070, and I liked 2205 as well, but yeah it unfortunately lacks some depth and it's more like a one time game :l \nBut I'd really love seeing an Anno game set in the future again, it feels like they've really achieved a lot with 1800 and perfected the formula, so it'd be neat to have something more similar to 1800 but set in the future again, where you could maybe colonise other planets, that'd be an amazing game to play :D", "created_utc": "1659644007.0", "edited": "False", "id": "iiyn9ir", "is_submitter": "False", "link_id": "t3_wftqb8", "parent_id": "t3_wftqb8", "score": "3", "subreddit": "anno", "subreddit_id": "t5_2sy3z"}, {"author": "KrysiSenpai", "body": "Totally, it's much different from anno, but stellaris is still a really fun game that I'd highly recommend for any people that love sci fi! \nAnother great thing is that it has official mod support and as all other paradox games, If you don't like something or you think there's not enough, the modding community probably already has what you're thinking of", "created_utc": "1659643837.0", "edited": "False", "id": "iiymte4", "is_submitter": "False", "link_id": "t3_wftqb8", "parent_id": "t1_iiw0cxj", "score": "1", "subreddit": "anno", "subreddit_id": "t5_2sy3z"}, {"author": "KrysiSenpai", "body": "I think it was 火星の人", "created_utc": "1659611438.0", "edited": "False", "id": "iiwgr33", "is_submitter": "False", "link_id": "t3_wfs9dg", "parent_id": "t1_iiwftvx", "score": "2", "subreddit": "LearnJapanese", "subreddit_id": "t5_2qyls"}, {"author": "KrysiSenpai", "body": "Yup, here's the link to Kindle edition on Japanese Amazon \nhttps://www.amazon.co.jp/dp/B09HGR4C6Y/ref=cm_sw_r_apan_7YCVD7Y6VS7Z0MJAPMQ2\n\nBut as others have already pointed out, dune is hard to read even in original, so unless you know Japanese really well, you might find it too demanding (tried myself, didn't work out too well)\nPersonally, if you want to read a sci-fi book in Japanese, I think the Martian is a little easier to read and it's a really good book too!", "created_utc": "1659610050.0", "edited": "False", "id": "iiwep3u", "is_submitter": "False", "link_id": "t3_wfs9dg", "parent_id": "t3_wfs9dg", "score": "3", "subreddit": "LearnJapanese", "subreddit_id": "t5_2qyls"}, {"author": "KrysiSenpai", "body": "Here's an actual Japanese proverb that I think you might find useful if you're considering working in a Japanese company, 出る釘は打たれる", "created_utc": "1659513275.0", "edited": "False", "id": "iir7vmi", "is_submitter": "False", "link_id": "t3_we6qhz", "parent_id": "t3_we6qhz", "score": "3", "subreddit": "LearnJapanese", "subreddit_id": "t5_2qyls"}, {"author": "KrysiSenpai", "body": "Guess a real estate bubble isn't the only thing they're taking from Japan", "created_utc": "1659427505.0", "edited": "False", "id": "iim92lk", "is_submitter": "False", "link_id": "t3_we50d5", "parent_id": "t1_iim85jl", "score": "20", "subreddit": "worldnews", "subreddit_id": "t5_2qh13"}, {"author": "KrysiSenpai", "body": "Jest takie rosyjskie powiedzenie, [ostatnie ostrzeżenie Chin ](https://en.m.wikipedia.org/wiki/China%27s_final_warning) ;)", "created_utc": "1659427339.0", "edited": "False", "id": "iim8vbl", "is_submitter": "False", "link_id": "t3_we3jqi", "parent_id": "t3_we3jqi", "score": "11", "subreddit": "Polska", "subreddit_id": "t5_2qiqo"}, {"author": "KrysiSenpai", "body": "Ostatnio widziałem artykuł o tej grze na Gry online, komentarze są okropne XDDD \nno ale to jest wiedza powszechna, że gracze są kurwa najgorsi", "created_utc": "1659263678.0", "edited": "False", "id": "iid85se", "is_submitter": "False", "link_id": "t3_wciz0r", "parent_id": "t3_wciz0r", "score": "2", "subreddit": "Polska", "subreddit_id": "t5_2qiqo"}, {"author": "KrysiSenpai", "body": "Imo autobusy elektryczne w ogóle są trochę bezsensowne porównując je z dzisiejszymi trolejbusami, wiadomo są miejsca gdzie autobus się lepiej sprawi, szczególnie małe miejscowości, ale trolejbusy są z tego co wiem o wiele tańsze od autobusów elektrycznych i mają też baterię na wypadek, gdyby gdzieś nie było trakcji. Więc w miastach o wiele bardziej chyba opłaca się poprowadzić trakcję i zainwestować w trolejbusy, które są o wiele tańsze przez co miasto może ich po prostu kupić też więcej.", "created_utc": "1659193934.0", "edited": "False", "id": "ii9kqw9", "is_submitter": "False", "link_id": "t3_wbjbhw", "parent_id": "t1_ii8gvyo", "score": "2", "subreddit": "Polska", "subreddit_id": "t5_2qiqo"}, {"author": "KrysiSenpai", "body": "The only thing I understand is that the economy is going to crash, and crash very fucking much. Well, it's going to be my first crash ever, yay! I was 8 in 2008, so don't remember a single fucking thing, lmao. \n\nI think I'm kinda lucky, since my family owns a home and my mum has a safe government job, they don't pay well, the pay is actually really fucking shitty, government jobs don't pay well in my country, Poland, unfortunately, but in times like these I'm happy that it at least is a stable job and she won't be fired, and 3 of my other family members work as teachers, sooo maybe it isn't going to be as bad for us. I'm worried about myself a little tho, I got my first job like literally fucking now :( It's customer service for an energy supplier, I only hope that maybe I'll survive coz I'm working as someone that has to make customers stay, not as someone that has to acquire new customers lmao. They pay pretty well too, and the only thing I have is renting a single room in a home owned by a family that bought themselves a new home, I'm tied to it for another year and they can't change the price, they can't kick me out too but I can stop renting anytime I want coz I've got a pretty good contract. I have a student loan tho, but I won't start paying it for a few years. \n\nIdk guys, I'm fucking scared, but also excited to experience my first economic collapse, so... Yay? I hope y'all can manage to survive this, hang in there", "created_utc": "1658997693.0", "edited": "False", "id": "ihytqsl", "is_submitter": "False", "link_id": "t3_uflzht", "parent_id": "t3_uflzht", "score": "2", "subreddit": "Superstonk", "subreddit_id": "t5_43zwn1"}, {"author": "KrysiSenpai", "body": "Great! Already own and played all of them on my PS4, but I'm happy that it might get to even more people! Might also buy myself ps plus on my Japanese account, since unfortunately you can't change the language to Japanese on PS4", "created_utc": "1658948420.0", "edited": "False", "id": "ihw0k72", "is_submitter": "False", "link_id": "t3_w9hyir", "parent_id": "t3_w9hyir", "score": "3", "subreddit": "yakuzagames", "subreddit_id": "t5_2xx8w"}, {"author": "KrysiSenpai", "body": "Most sane star wars fan", "created_utc": "1658924742.0", "edited": "False", "id": "ihude8a", "is_submitter": "False", "link_id": "t3_w8rsnv", "parent_id": "t3_w8rsnv", "score": "1", "subreddit": "shid_and_camed", "subreddit_id": "t5_3leo9n"}, {"author": "KrysiSenpai", "body": "Someone already said that reading books in Japanese is a great way and I have to agree, it's specially easy if you have an e-reader, since they come with dictionaries installed and Japanese e-books tend to be really cheap, so I'd definitely recommend this way! \n\nAs for games, I'd probably recommend playing a game that you've already played first. And playing on PC really is the best way for this imo, since you can install tools that will let you check vocab quickly and there's no regional lock with languages on Steam (for most of the games at least), so if a game has been released in Japanese, you'll most probably be able to play it in Japanese, which unfortunately isn't the case for consoles, but I understand that you might not be currently able to play games on PC, and I feel you coz I can't really too since my pc wasn't made for games :( I don't have a switch unfortunately, but I've got a PS4 and yeah unfortunately if you bought a game on a PS store outside Japan you can't play it in Japanese, you either have to buy a game on a disc from a Japanese store or set up a Japanese store account, but I've gotta say, I feel like games in Japan are more expensive and they lose their price slower. \n\nI'd definitely recommend playing Yakuza (龍が如く) If you can, I think it's also on gamepass! And the ace attorney is pretty good too! Fallout or the ender scrolls is available in Japanese too, I know Skyrim is available on switch as well so you can try, maybe you can play it in Japanese there too! \n\nAnyway i hope you can find something for yourself and I hope you'll continue learning Japanese, and being able to play games or read books in Japanese is super satisfying! :)", "created_utc": "1658774545.0", "edited": "False", "id": "ihm1hwm", "is_submitter": "False", "link_id": "t3_w7ipzb", "parent_id": "t3_w7ipzb", "score": "2", "subreddit": "LearnJapanese", "subreddit_id": "t5_2qyls"}, {"author": "KrysiSenpai", "body": "If you have a Kindle the easiest way is probably to make an account on Japanese Amazon and connect it with your Kindle, I did it myself a month ago and it's great. Lots of great books are super cheap, and you can even find Meiji era classics for free!", "created_utc": "1658609380.0", "edited": "False", "id": "ihd7fzh", "is_submitter": "False", "link_id": "t3_w65uho", "parent_id": "t3_w65uho", "score": "2", "subreddit": "LearnJapanese", "subreddit_id": "t5_2qyls"}, {"author": "KrysiSenpai", "body": "Spoko, mnie tego też nikt nie uczył, skończyłem właśnie studia, nie mam żadnego doświadczenia i miesiąc temu udało mi się znaleźć naprawdę niezłą pracę, więc da się :) \n\nU mnie networking trochę odpada, bo mało osób znam w takim zawodzie, LinkedIn też trochę głupio, bo jednak zero doświadczenia XDD po prostu zrobiłem CV, wysłałem gdzie się dało i gdzie szukali bez doświadczenia i się udało! Mam nadzieję że też coś znajdziesz, nie daj się na tym rynku pracy :)", "created_utc": "1658428311.0", "edited": "False", "id": "ih31wkd", "is_submitter": "False", "link_id": "t3_w4mtsx", "parent_id": "t3_w4mtsx", "score": "7", "subreddit": "Polska", "subreddit_id": "t5_2qiqo"}, {"author": "KrysiSenpai", "body": "Also, a lot of people say that the story isn't as emotional as it is in main Yakuza games, which is totally true, but yagami and kaito are such amazing are characteristic characters, that you grow a huge bond with them, I absolutely love them. So maybe the game itself didn't move me to tears, but God, when I ended judgment i cried during end credits when they were just having fun in the office and that amazing music was playing! I kinda like yagami more than kiryu actually, but that's probably because I'm very fond of detectives :D", "created_utc": "1658394664.0", "edited": "False", "id": "ih10ypz", "is_submitter": "False", "link_id": "t3_w49nvl", "parent_id": "t1_ih10fqr", "score": "8", "subreddit": "yakuzagames", "subreddit_id": "t5_2xx8w"}, {"author": "KrysiSenpai", "body": "Yes, lost judgement is amazing and it's definitely worth playing! I think my only problem with it is it's a little bit like Yakuza 5, as in, it's got so many side things to do that you sometimes forget what you were even doing in the main story because of how long they take lmao, but besides it it's definitely worth playing", "created_utc": "1658394236.0", "edited": "False", "id": "ih10fqr", "is_submitter": "False", "link_id": "t3_w49nvl", "parent_id": "t3_w49nvl", "score": "15", "subreddit": "yakuzagames", "subreddit_id": "t5_2xx8w"}, {"author": "KrysiSenpai", "body": "Stage two: the sign masks a basic reality. The image becomes a distortion of reality.", "created_utc": "1658146692.0", "edited": "False", "id": "igmtos6", "is_submitter": "False", "link_id": "t3_w1l2m6", "parent_id": "t1_iglf0ff", "score": "1", "subreddit": "HistoryMemes", "subreddit_id": "t5_2v2cd"}, {"author": "KrysiSenpai", "body": "When it comes to most popular languages that people learn, I think it only happens really in Chinese, Many Chinese learners will pick themselves a new name that they'll use in Chinese, sometimes one that sounds similar to the original, sometimes not. I think that even when you're a foreigner living in China you can use the name you chose officially in documents etc. But I don't think it really happens in other languages, people will just use their own name and maybe sometimes just write it in a way that is more consistent with their TL. I think it's because all countries (in the EU at least, where I live) will want you to use your real name in all the documents. And even in Japanese people mostly use their own name but just written in Katakana, heard there's people that choose themselves a new name, but I don't think it happens a lot and if you move to Japan you'll have to use your own name but written in Katakana in stuff like official documents", "created_utc": "1658140942.0", "edited": "False", "id": "igmkxvc", "is_submitter": "False", "link_id": "t3_w1vdpd", "parent_id": "t3_w1vdpd", "score": "8", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "KrysiSenpai", "body": "The worst variant, yet ;)", "created_utc": "1658084587.0", "edited": "False", "id": "igjt1bj", "is_submitter": "False", "link_id": "t3_w1dpq3", "parent_id": "t3_w1dpq3", "score": "1", "subreddit": "worldnews", "subreddit_id": "t5_2qh13"}, {"author": "KrysiSenpai", "body": "DeepL is really good, we had to translate Polish law to German on Uni, and I often used DeepL for help and just did some corrections. My teachers were impressed by the quality of those translation. It's scary how good these translators are getting, like please stop I actually want to have a job in the future", "created_utc": "1657872950.0", "edited": "False", "id": "ig8mkae", "is_submitter": "False", "link_id": "t3_vzj2le", "parent_id": "t1_ig8lk2m", "score": "24", "subreddit": "German", "subreddit_id": "t5_2qq51"}, {"author": "KrysiSenpai", "body": "勉強だよ(｡•́︿•̀｡)　僕は大学で日本語を習っているが、日本史の試験を不合格したんから勉強しなきゃ", "created_utc": "1657872214.0", "edited": "False", "id": "ig8lnzr", "is_submitter": "False", "link_id": "t3_vzaal0", "parent_id": "t3_vzaal0", "score": "1", "subreddit": "LearnJapanese", "subreddit_id": "t5_2qyls"}, {"author": "KrysiSenpai", "body": "I mean, we can already kinda see their looming democraphic problems on population pyramids, good luck paying rents to all those people born in times of a demographic boom once they retire with people born under one Child policy", "created_utc": "1657807821.0", "edited": "False", "id": "ig4o7nw", "is_submitter": "False", "link_id": "t3_vys83b", "parent_id": "t1_ig4kqal", "score": "4", "subreddit": "worldnews", "subreddit_id": "t5_2qh13"}, {"author": "KrysiSenpai", "body": "Japan: destroys its economy by creating a massive economic bubble in real estate that burst \n\nChina: I'll fucking do it again", "created_utc": "1657803103.0", "edited": "False", "id": "ig4drfk", "is_submitter": "False", "link_id": "t3_vys83b", "parent_id": "t3_vys83b", "score": "30", "subreddit": "worldnews", "subreddit_id": "t5_2qh13"}, {"author": "KrysiSenpai", "body": "Johan de Witt, polecam wyszukać :p", "created_utc": "1657797506.0", "edited": "False", "id": "ig43kkm", "is_submitter": "False", "link_id": "t3_vyppas", "parent_id": "t1_ig43hhr", "score": "2", "subreddit": "Polska", "subreddit_id": "t5_2qiqo"}, {"author": "KrysiSenpai", "body": "I mean, w Holandii kiedyś zjedli premiera, więc czemu by nie u nas..", "created_utc": "1657789103.0", "edited": "False", "id": "ig3slno", "is_submitter": "False", "link_id": "t3_vyppas", "parent_id": "t1_ig3o2sf", "score": "19", "subreddit": "Polska", "subreddit_id": "t5_2qiqo"}, {"author": "KrysiSenpai", "body": "I feel the same! Being European makes me really proud and I'm so happy that we have our little union :) I hope we will only get closer as the time goes on! Pity I live in a country that shits on the EU, but still, I love y'all friends and I try to be optimistic ^^", "created_utc": "1657717376.0", "edited": "False", "id": "ifziwnc", "is_submitter": "False", "link_id": "t3_vxvy1l", "parent_id": "t3_vxvy1l", "score": "10", "subreddit": "YUROP", "subreddit_id": "t5_2wivw"}, {"author": "KrysiSenpai", "body": "So what? NATO is a defensive alliance, and countries that join NATO are independent and it's their own damn choice to join a DEFENSIVE alliance, because, you know, they're INDEPENDENT and Russia has no right to interfere with how they govern themselves", "created_utc": "1657716977.0", "edited": "False", "id": "ifzi2tn", "is_submitter": "False", "link_id": "t3_vy01m1", "parent_id": "t1_ifzfhht", "score": "7", "subreddit": "worldnews", "subreddit_id": "t5_2qh13"}, {"author": "KrysiSenpai", "body": "I'd love a channel runned by a civil engineer that just reviews things that people put in here", "created_utc": "1657701114.0", "edited": "False", "id": "ifyuj3g", "is_submitter": "False", "link_id": "t3_vxie8o", "parent_id": "t1_ifxode3", "score": "2", "subreddit": "CitiesSkylines", "subreddit_id": "t5_331rj"}, {"author": "KrysiSenpai", "body": "While China's growth has indeed been huge in the past, their population isn't growing anymore, and due to one child policy that has been active for 20 years or so, they might soon face a population crisis that hasn't been seen anywhere else, even in Japan, when their \"boomers\" start getting into retirement age and they'll somehow have to support that huge chunk of population with a much smaller part that has been born during one child policy", "created_utc": "1657568430.0", "edited": "False", "id": "ifrgiw0", "is_submitter": "False", "link_id": "t3_vwoq2y", "parent_id": "t1_ifr8lhy", "score": "6", "subreddit": "europe", "subreddit_id": "t5_2qh4j"}, {"author": "KrysiSenpai", "body": "Oh, so solar panels just magically pop up, huh? You know how much resources you have to mine, process, and manufacture to make solar panels? And do you know how many solar panels you need to achieve energy production levels that of a nuclear plant? Oh, add to that all that batteries that would had to be also manufactured if we were to use renewable energy only, since, you know, solar panels nor wind turbines won't work for the whole year", "created_utc": "1657374202.0", "edited": "False", "id": "ifh1b57", "is_submitter": "False", "link_id": "t3_vuwyvi", "parent_id": "t1_ifgnv94", "score": "5", "subreddit": "YUROP", "subreddit_id": "t5_2wivw"}, {"author": "KrysiSenpai", "body": "Let's go bois, życzę wam wszystkim powodzenia w przeżyciu recesji XD nie dajcie się tam zwolnić", "created_utc": "1657210644.0", "edited": "False", "id": "if821kk", "is_submitter": "False", "link_id": "t3_vtj1b4", "parent_id": "t3_vtj1b4", "score": "16", "subreddit": "Polska", "subreddit_id": "t5_2qiqo"}, {"author": "KrysiSenpai", "body": "I think i did pretty well, although it was pretty hard tbh but i hope I'm gonna pass! Can't wait for the leaks so I can check my answers lmao", "created_utc": "1656872986.0", "edited": "False", "id": "ieq5lx4", "is_submitter": "False", "link_id": "t3_vqb36e", "parent_id": "t3_vqb36e", "score": "1", "subreddit": "jlpt", "subreddit_id": "t5_2s1e4"}, {"author": "KrysiSenpai", "body": "I just took my first JLPT exam ever, N3 level to be exact ^^ I think it went pretty well and I'm really proud of myself! The first part specially coz I'm generally good with kanji and vocab, and grammar and reading were much easier than I expected lmao, I don't know if any of those grammar points actually are N3 Level lmao. Listening wasn't too hard too but idk how it went coz I was already way too tired at the end and I couldn't focus, but I still think it went pretty well ^^", "created_utc": "1656866504.0", "edited": "False", "id": "iepqi4n", "is_submitter": "False", "link_id": "t3_vqd9mq", "parent_id": "t3_vqd9mq", "score": "3", "subreddit": "LearnJapanese", "subreddit_id": "t5_2qyls"}, {"author": "KrysiSenpai", "body": "True, Chinese economy relies heavily on Europe and the US, since they're the richest economies and the richest markets you can sell goods to, and Russia with its isolated economy can't possibly provide such a rich market. The problem is tho that just as much Chinese economy relies on the west, the US and the EU relies on Chinese economy as well, if China was ever to isolate I'm not so sure who'd collapse here and who'll be first to do it, although I wish that none of us had to live in a world that is about to collapse ;-;", "created_utc": "1656781044.0", "edited": "False", "id": "ielgucg", "is_submitter": "False", "link_id": "t3_vpt0up", "parent_id": "t1_iele7ev", "score": "5", "subreddit": "HongKong", "subreddit_id": "t5_2rbn0"}, {"author": "KrysiSenpai", "body": "Osobom, które chcą, aby palacze wpłacali więcej na służbę zdrowia chciałbym przypomnieć, że właściwie już to robią. \n\nDochód z akcyzy oraz VATu od papierosów to dość duża część ogólnych przychodów państwa z podatków. W 2016 państwo zarobiło na papierosach około 24mld złotych, przy czym wydatki na służbę zdrowia w 2021 wyniosły jakieś 21mld.", "created_utc": "1655988097.0", "edited": "False", "id": "idf9x46", "is_submitter": "False", "link_id": "t3_viu80u", "parent_id": "t3_viu80u", "score": "92", "subreddit": "Polska_wpz", "subreddit_id": "t5_zgpel"}, {"author": "KrysiSenpai", "body": "I'm happy to hear it! \n\nI'm taking JLPT N3 next month and have kimi no na ha in Japanese, and I want to read it before the exam to get a little boost in reading, and your story is really inspiring! ^^ \n\nAlso, do you have any podcasts in Japanese that you'd recommend?", "created_utc": "1654520152.0", "edited": "False", "id": "ibd10jx", "is_submitter": "False", "link_id": "t3_v5z4tf", "parent_id": "t3_v5z4tf", "score": "7", "subreddit": "LearnJapanese", "subreddit_id": "t5_2qyls"}, {"author": "KrysiSenpai", "body": "Well I hope you have a great day :)", "created_utc": "1653821008.0", "edited": "False", "id": "iaew5ua", "is_submitter": "False", "link_id": "t3_uzomnb", "parent_id": "t3_uzomnb", "score": "1", "subreddit": "NintendoSwitch", "subreddit_id": "t5_3h47q"}, {"author": "KrysiSenpai", "body": "Yeah, I can certainly say that this is one issue people struggle regardless of their level. I've been learning German for like 6 years and I'm studying linguists with German at Uni. My German is around B2/C1 level, but i still struggle with noun gender. \n\nIt's a little funny, since my native language has gendered nouns too and I know what gender a noun is even if it's the first time I see it. But I still tend to forget the noun gender in German even when it comes to really basic words, thus often completely declension totally wrong :( \n\nOther thing I sometimes struggle with getting correct are what cases come after certain verbs, even tho, of course, my native language also has cases, and even more of them than German! Lots of verbs have the same cases in both languages, but some of them not and I tend to forget that. \n\nI'm still improving tho and I'm lately trying to use my German more often, I've got some German friends and I now read all the books and play all the games I have in German which helps a lot ^^", "created_utc": "1653684045.0", "edited": "False", "id": "ia8jx1k", "is_submitter": "False", "link_id": "t3_uyjzp7", "parent_id": "t1_ia4ra85", "score": "1", "subreddit": "German", "subreddit_id": "t5_2qq51"}, {"author": "KrysiSenpai", "body": "Good question. I'm studying linguistics with German and Japanese and I'm graduating next month as a bachelor. \n\nHonestly i had no idea there are literally no jobs for Japanese speakers here. I mean, there are some, but they all require passing jlpt N1 with 90% lmao and there really isn't that much of them\n\nFortunately I'm happy that I took German too, which is very profitable where I live and I can get a pretty good salary with no experience and with German knowledge on B2 level, and my knowledge is between B2-C1 level.\n\nI'm still planning to make a master's degree in Japanese and study Chinese too and still want to work with Japanese in some way in the future. But I'll probably start my master's degree next year, as I want to get a job this year and gain some experience in a corpo job, hopefully move to Germany next year when I gain enough experience and do my master's degree there ^^", "created_utc": "1653384064.0", "edited": "False", "id": "i9sd2h6", "is_submitter": "False", "link_id": "t3_uwepwl", "parent_id": "t3_uwepwl", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "KrysiSenpai", "body": "the mad dog himself single handedly forcing japan into a huge recession", "created_utc": "1652901178.0", "edited": "False", "id": "i93yb8m", "is_submitter": "True", "link_id": "t3_usin9i", "parent_id": "t1_i93wqcb", "score": "3", "subreddit": "HistoryMemes", "subreddit_id": "t5_2v2cd"}, {"author": "KrysiSenpai", "body": "Korean ruling class until until 19th century:  \nHow about nah back we're not barbarians like those japan\\*se", "created_utc": "1652197551.0", "edited": "False", "id": "i82at7j", "is_submitter": "True", "link_id": "t3_umhuh8", "parent_id": "t1_i82a6ee", "score": "73", "subreddit": "linguisticshumor", "subreddit_id": "t5_2vwiq"}, {"author": "KrysiSenpai", "body": "Just use a scroll of Icarian flight dumbass", "created_utc": "1650569804.0", "edited": "False", "id": "i5nnttw", "is_submitter": "False", "link_id": "t3_u8rgm9", "parent_id": "t3_u8rgm9", "score": "11", "subreddit": "TrueSTL", "subreddit_id": "t5_2xiwq"}, {"author": "KrysiSenpai", "body": "As many people here already said, both!\n\nI think that being both depressing and fun is a big part of what makes fallout stand out and what makes fallout, well, fallout! \n\nI believe that with good writers that know how to write good and deep stories you can perfectly combine the two, make it depressing when it needs too and make it fun when you can! I think the best way is to make the main story depressing with some jokes and fun stuff thrown in somewhere where it  fits and do both in side stories. \n\nI really hope that the next fallout deeply explores the minds of people living in a post apocalyptic world and tries to portray how they feel and think, too. And I hope that the next fallout  will explore some new lore, locations, people and factions instead of using what we already have again, deep and well made lore is the way to go!", "created_utc": "1647985837.0", "edited": "False", "id": "i1ptwaa", "is_submitter": "False", "link_id": "t3_tk9ot5", "parent_id": "t3_tk9ot5", "score": "1", "subreddit": "Fallout", "subreddit_id": "t5_2qnzu"}, {"author": "KrysiSenpai", "body": "Sounds like you're having lots of fun bro! Kinda jealous, I don't have enough money for weed, but every Saturday I buy myself a few beers, talk with friends in discord, and chill while playing New Vegas. And let me tell you, I fucking love these Saturdays", "created_utc": "1647273562.0", "edited": "False", "id": "i0mp92y", "is_submitter": "False", "link_id": "t3_tdno6q", "parent_id": "t3_tdno6q", "score": "3", "subreddit": "Fallout", "subreddit_id": "t5_2qnzu"}, {"author": "KrysiSenpai", "body": "Ghost of Tsushima and crusader kings 3? I mean ck3 already has a mod that adds Japan so..", "created_utc": "1644579078.0", "edited": "False", "id": "hwhqp8l", "is_submitter": "False", "link_id": "t3_sphteu", "parent_id": "t3_sphteu", "score": "1", "subreddit": "gaming", "subreddit_id": "t5_2qh03"}, {"author": "KrysiSenpai", "body": "Jestem sumie ciekaw dlaczego w Irlandii jest taki wzrost?", "created_utc": "1642153585.0", "edited": "False", "id": "hslywf6", "is_submitter": "False", "link_id": "t3_s3nhf1", "parent_id": "t3_s3nhf1", "score": "4", "subreddit": "Polska", "subreddit_id": "t5_2qiqo"}, {"author": "KrysiSenpai", "body": "I know it's tagged as humour, but still, I think you're absolutely right. Control ending is just too dangerous imo, even if you play full paragon shep. Absolute power corrupts absolutely. \n\nIn my head modded destroy ending is cannon. It destroys only the reapers leaving the geth alive (if you choose to save them) and also deletes the child completely. I think that the crucible, built over many cycles by so many different civilisations, that uses the reaper technology against them, would be constructed to destroy them and might have a way to distinguish the reapers from other synthetics. \n\nAlthough still, that too might be too easy. After all, all the technology used by space faring species is based on reapech technology, so maybe there would be no way to distinguish other synthetics from the reapers. Who knows, really", "created_utc": "1641205270.0", "edited": "False", "id": "hr22wn4", "is_submitter": "False", "link_id": "t3_rue1l3", "parent_id": "t3_rue1l3", "score": "2", "subreddit": "masseffect", "subreddit_id": "t5_2rc19"}, {"author": "KrysiSenpai", "body": "Zootopia having different animals as newscasters in different countries must be censorship too", "created_utc": "1641129556.0", "edited": "False", "id": "hqxj8d2", "is_submitter": "False", "link_id": "t3_rtu9hi", "parent_id": "t3_rtu9hi", "score": "1", "subreddit": "yakuzagames", "subreddit_id": "t5_2xx8w"}, {"author": "KrysiSenpai", "body": "What? I have no idea what you're talking about! (Ashley can you maybe leave us for a second?)", "created_utc": "1640552701.0", "edited": "False", "id": "hq2esrm", "is_submitter": "True", "link_id": "t3_roxxgx", "parent_id": "t1_hq2e7nv", "score": "5", "subreddit": "masseffect", "subreddit_id": "t5_2rc19"}, {"author": "KrysiSenpai", "body": "They're perfectly balanced for that, after all. They're not too weak, if you'd burst into a human or a saralian you probably couldn't stop so fast. But they're not too strong too, if you'd want to use a krogan as a handbrake, I imagine it would probably be deadly for you, not the krogan.", "created_utc": "1640529328.0", "edited": "False", "id": "hq10qrq", "is_submitter": "True", "link_id": "t3_roxxgx", "parent_id": "t1_hq104h3", "score": "30", "subreddit": "masseffect", "subreddit_id": "t5_2rc19"}, {"author": "KrysiSenpai", "body": "I think a telltale like game would be a great choice for dune. Although if it were to have choices that would impact the story, I don't think it could be set in the main story of the books, unless it's very linear (or maybe it could explore what would happen if characters from the books made some other choices, that would be cool!) \nAlso as a mass effect fan I'd love to play a similar game but set in the dune universe! Although that could be a little difficult too, specially with how expensive and difficult space travel in dune is, it probably wouldn't be an open world game where you can go to any planet anywhere you want. I think the main story could be linear and the main quest would take you to another planets as you make it, but the planets itself could have an open world! So you could explore a planet and do side quests, and when you're done with it you make the main quest that takes you to an another planet. God id so wish to play a game like this. And what if it would be set in the times of the butlerian jihad?", "created_utc": "1640348853.0", "edited": "False", "id": "hpsvei1", "is_submitter": "False", "link_id": "t3_rn9piw", "parent_id": "t3_rn9piw", "score": "4", "subreddit": "dune", "subreddit_id": "t5_2rff0"}, {"author": "KrysiSenpai", "body": "I'd love to see a hanar squadmate! For some reason I love that species. Maybe because it's so distinct, and I love the way they communicate! And for some reason I find them very funny, too. I feel like hanars habe an amazing sense of humour too. A hanar would probably be a squadmate I'd take for all the missions. (like I do with garrus and javik in ME3. I absolutely love them) Just imagine all the comments a hanar could make!!", "created_utc": "1640003294.0", "edited": "False", "id": "hpaddoo", "is_submitter": "False", "link_id": "t3_rk7gci", "parent_id": "t3_rk7gci", "score": "1", "subreddit": "masseffect", "subreddit_id": "t5_2rc19"}, {"author": "KrysiSenpai", "body": "Jak już dużo osób powiedziało, jeśli lubicie ryż to najlepiej po prostu kupić rice cookera. Ja kupiłem swój za jakieś chyba 80 złotych a ryż z tego jest cudowny i to chyba jeden z najlepszych zakupów do kuchni który możecie sobie sprawić", "created_utc": "1638802783.0", "edited": "False", "id": "hngqs0q", "is_submitter": "False", "link_id": "t3_ra5xkk", "parent_id": "t3_ra5xkk", "score": "1", "subreddit": "Polska", "subreddit_id": "t5_2qiqo"}, {"author": "KrysiSenpai", "body": "Hmm maybe it depends on the font you're using? Since when I write in Japanese on my pc it does use the Japanese one, but when u write in Japanese on my phone it looks like the Chinese one", "created_utc": "1621599953.0", "edited": "False", "id": "gyxp8z2", "is_submitter": "False", "link_id": "t3_nhpefb", "parent_id": "t1_gyxjhgu", "score": "7", "subreddit": "lingodeer", "subreddit_id": "t5_3ou01"}, {"author": "KrysiSenpai", "body": "I think these Kanji look like that in Japanese too, I don't see any mistake", "created_utc": "1621594371.0", "edited": "False", "id": "gyxh8o7", "is_submitter": "False", "link_id": "t3_nhpefb", "parent_id": "t3_nhpefb", "score": "8", "subreddit": "lingodeer", "subreddit_id": "t5_3ou01"}, {"author": "KrysiSenpai", "body": "R5: I have managed to kidnap the Byzantine emperor and convert him to Islam, but then it turned into... this.", "created_utc": "1599484528.0", "edited": "False", "id": "g4bsfb3", "is_submitter": "True", "link_id": "t3_io77y6", "parent_id": "t3_io77y6", "score": "5", "subreddit": "CrusaderKings", "subreddit_id": "t5_2tgic"}, {"author": "KrysiSenpai", "body": "I loved playing as republics, so I really hope they add them soon. Also, I've just finished restoring Rome and I really wish that Byzantium is more unique. It feels like any other feudal country in Europe.", "created_utc": "1599164247.0", "edited": "False", "id": "g3way71", "is_submitter": "False", "link_id": "t3_ily6kx", "parent_id": "t3_ily6kx", "score": "1", "subreddit": "CrusaderKings", "subreddit_id": "t5_2tgic"}, {"author": "KrysiSenpai", "body": "Could be worse, in my game sweden conquered whole Portugal, parts of Italy and parts of Africa", "created_utc": "1599163881.0", "edited": "False", "id": "g3w9v8o", "is_submitter": "False", "link_id": "t3_ilypjb", "parent_id": "t1_g3vwfck", "score": "1", "subreddit": "CrusaderKings", "subreddit_id": "t5_2tgic"}, {"author": "KrysiSenpai", "body": "You can try unlocking kidnapping, kidnap some foreign rulers and make them convert for their freedom. I used it to convert eastern europeans to orthodox as Byzantium. Not everyone will agree to convert but some surely will. And also, kidnapping all european rulers is pretty fun!", "created_utc": "1599163376.0", "edited": "False", "id": "g3w8cms", "is_submitter": "False", "link_id": "t3_im0dl6", "parent_id": "t3_im0dl6", "score": "3", "subreddit": "CrusaderKings", "subreddit_id": "t5_2tgic"}, {"author": "KrysiSenpai", "body": "There are no death sounds :c", "created_utc": "1599163179.0", "edited": "False", "id": "g3w7rnl", "is_submitter": "False", "link_id": "t3_im0h9b", "parent_id": "t3_im0h9b", "score": "4", "subreddit": "CrusaderKings", "subreddit_id": "t5_2tgic"}, {"author": "KrysiSenpai", "body": "It actually says \"and so it will remain for all eternity, for surely nothing could ever topple the might of Rum\"", "created_utc": "1599124530.0", "edited": "False", "id": "g3toxkb", "is_submitter": "False", "link_id": "t3_il9ova", "parent_id": "t1_g3s8wbz", "score": "4", "subreddit": "CrusaderKings", "subreddit_id": "t5_2tgic"}, {"author": "KrysiSenpai", "body": "Wait until you see the description of Hagia Sophia Mosque upgrade.", "created_utc": "1599084160.0", "edited": "False", "id": "g3ry2bw", "is_submitter": "False", "link_id": "t3_il9ova", "parent_id": "t3_il9ova", "score": "13", "subreddit": "CrusaderKings", "subreddit_id": "t5_2tgic"}, {"author": "KrysiSenpai", "body": "I got that event after maybe 2 hours of gameplay, my first thought was \"yup, that's why I love crusader kings\"", "created_utc": "1599023595.0", "edited": "False", "id": "g3op42t", "is_submitter": "True", "link_id": "t3_ikrrqb", "parent_id": "t1_g3nww00", "score": "4", "subreddit": "CrusaderKings", "subreddit_id": "t5_2tgic"}, {"author": "KrysiSenpai", "body": "R5: I have discovered that my patriarch is fucking my daughter. I couldn't imprison him as that would be tyranny, so I tried to kill him instead. Unfortunately, he was with my daughter while the assassin tried to kill him, and my daugher died instead! The patriarch is still alive, not for long tho.", "created_utc": "1598990877.0", "edited": "False", "id": "g3mvbbn", "is_submitter": "True", "link_id": "t3_ikrrqb", "parent_id": "t3_ikrrqb", "score": "160", "subreddit": "CrusaderKings", "subreddit_id": "t5_2tgic"}, {"author": "KrysiSenpai", "body": "위대한 지도자 Andrzej Duda를 오래 사십시오!", "created_utc": "1593034084.0", "edited": "False", "id": "fvw729p", "is_submitter": "False", "link_id": "t3_hf6xp6", "parent_id": "t1_fvvoaue", "score": "61", "subreddit": "Polska", "subreddit_id": "t5_2qiqo"}, {"author": "KrysiSenpai", "body": "*Saarland", "created_utc": "1590142316.0", "edited": "False", "id": "frfoa7b", "is_submitter": "False", "link_id": "t3_goevpd", "parent_id": "t3_goevpd", "score": "70", "subreddit": "ich_iel", "subreddit_id": "t5_37k29"}, {"author": "KrysiSenpai", "body": "I live like 10 kilometers from that town and I'd never have heard about it if not for the science club on my university. It's really interesting and amazing how hard they're trying to preserve it tho!", "created_utc": "1588261847.0", "edited": "False", "id": "fp2hi8x", "is_submitter": "False", "link_id": "t3_g8b0dr", "parent_id": "t1_forvins", "score": "2", "subreddit": "linguisticshumor", "subreddit_id": "t5_2vwiq"}, {"author": "KrysiSenpai", "body": "K", "created_utc": "1588149509.0", "edited": "False", "id": "foxnak3", "is_submitter": "False", "link_id": "t3_ga2utx", "parent_id": "t1_foxn4lg", "score": "0", "subreddit": "AskOuija", "subreddit_id": "t5_3eg3f"}, {"author": "KrysiSenpai", "body": "Byzantine emperors: Hold my wine", "created_utc": "1586893255.0", "edited": "False", "id": "fneoy3r", "is_submitter": "False", "link_id": "t3_g1aq1s", "parent_id": "t3_g1aq1s", "score": "14", "subreddit": "CrusaderKings", "subreddit_id": "t5_2tgic"}, {"author": "KrysiSenpai", "body": "Same. I didn't notice it's r/conlangs at first, so I was like \"what the hell is this?\"", "created_utc": "1585844215.0", "edited": "False", "id": "fm87fjm", "is_submitter": "False", "link_id": "t3_ftjl0x", "parent_id": "t1_fm828tf", "score": "39", "subreddit": "conlangs", "subreddit_id": "t5_2red7"}, {"author": "KrysiSenpai", "body": "The scourge in the game I'm currently having conquered almost half of the galaxy and I still had troubles to even get the galactic focus into the senate session", "created_utc": "1584904565.0", "edited": "False", "id": "fl7m2xj", "is_submitter": "False", "link_id": "t3_fmz0c6", "parent_id": "t3_fmz0c6", "score": "1", "subreddit": "Stellaris", "subreddit_id": "t5_39cuc"}, {"author": "KrysiSenpai", "body": "Performance after this update is just amazing. I normally ended my games after 200 years since it was barely running by then. Now I am still on my first game after this update, the year is already 2700, I'm still fighting the end game crisis, and I'm having so much fun!", "created_utc": "1584904374.0", "edited": "False", "id": "fl7lr7y", "is_submitter": "False", "link_id": "t3_fmtojf", "parent_id": "t3_fmtojf", "score": "1", "subreddit": "Stellaris", "subreddit_id": "t5_39cuc"}, {"author": "KrysiSenpai", "body": "I feel like it's more of an Scandinavian language, because of \"fri\" and \"för\", also xöpe sounds a bit like Swedish köp (to buy)", "created_utc": "1583499072.0", "edited": "False", "id": "fjn62nu", "is_submitter": "False", "link_id": "t3_fe7rii", "parent_id": "t1_fjn016n", "score": "7", "subreddit": "conlangs", "subreddit_id": "t5_2red7"}, {"author": "KrysiSenpai", "body": "Bullshit. I have 2 teachers in my family, and I keep good contact with some of my high school teachers. They work just as many hours as any other person in other field, even if you don't see that. The amount of paperwork for teachers is just growing, and they have to work more to keep up with their responsibilities. They have to take care of your kids, and I don't think people imagine how huge of responsibility that is. Kids are stupid, one wrong move and you're fucked as well. You have to speak loudly and often scream, and thanks to that their voice and larynx is getting worse and worse with every year of work. No wonder they have long holidays, although a lot of these holidays is just paperwork anyway. I think it's one of the most responsible job in our society, they're Literally taking care of the next generation of people of any country, and yet we can't even give them a decent pay? It's just going to get worse and worse. Noone is going to want to work as a teacher, even if they feel that's something for them (me, for example, I'd love to), and someday we're gonna notice how fucked our education system is.", "created_utc": "1581401333.0", "edited": "False", "id": "fha9ifp", "is_submitter": "False", "link_id": "t3_f1vcpu", "parent_id": "t1_fh9w4fu", "score": "8", "subreddit": "europe", "subreddit_id": "t5_2qh4j"}, {"author": "KrysiSenpai", "body": "I've tested it this night, and oh my god, I don't think I've ever played any game in such a good performance on ultra. I've got to say, this is amazing, great job! Even if there's a little lag or something like that because of my internet, it's still so much better than what I'd have running it on my laptop. Running the games from steam works a little weird and I feel like there's still not enough games, but this is still so amazing!", "created_utc": "1580887916.0", "edited": "False", "id": "fglaa1o", "is_submitter": "False", "link_id": "t3_eyujut", "parent_id": "t3_eyujut", "score": "1", "subreddit": "GeForceNOW", "subreddit_id": "t5_3a2md"}, {"author": "KrysiSenpai", "body": "I know it's not gonna happen, but I hope it's one of these trailers that says \"release tomorrow lol have fun\"\nOf course, that's probably not gonna be the thing, and maybe for the better, I want them to make the best out of wastelanders!", "created_utc": "1580761544.0", "edited": "False", "id": "fgggrjs", "is_submitter": "False", "link_id": "t3_ey9q79", "parent_id": "t1_fgfxkea", "score": "20", "subreddit": "fo76", "subreddit_id": "t5_jrw25"}, {"author": "KrysiSenpai", "body": "Ich komme auch aus Polen, aus Posen. Spielst du im Survival-modus oder im Creative-modus?", "created_utc": "1575149625.0", "edited": "False", "id": "f96pyey", "is_submitter": "False", "link_id": "t3_e3yg1k", "parent_id": "t1_f96o2o5", "score": "19", "subreddit": "ich_iel", "subreddit_id": "t5_37k29"}, {"author": "KrysiSenpai", "body": "R5: Reasercher said one of them is close to a scientific breakthrough. And of course, it's all about him..", "created_utc": "1569843021.0", "edited": "False", "id": "f1zfujc", "is_submitter": "True", "link_id": "t3_dba5dm", "parent_id": "t3_dba5dm", "score": "13", "subreddit": "Imperator", "subreddit_id": "t5_gpanm"}, {"author": "KrysiSenpai", "body": "R", "created_utc": "1569307365.0", "edited": "False", "id": "f1au47v", "is_submitter": "False", "link_id": "t3_d8i6bo", "parent_id": "t1_f1au1we", "score": "40", "subreddit": "AskOuija", "subreddit_id": "t5_3eg3f"}, {"author": "KrysiSenpai", "body": "I honestly didn't expect it's gonna be released tomorrow... Well, I guess moving out can wait! Carthago delenda est!", "created_utc": "1569240730.0", "edited": "False", "id": "f17cncp", "is_submitter": "False", "link_id": "t3_d85b7c", "parent_id": "t3_d85b7c", "score": "20", "subreddit": "Imperator", "subreddit_id": "t5_gpanm"}, {"author": "KrysiSenpai", "body": "R5: Just playing ck2 when i've noticed two same countries, I guess someone just could not get along...", "created_utc": "1567697949.0", "edited": "False", "id": "ez5c5ly", "is_submitter": "True", "link_id": "t3_d02f6w", "parent_id": "t3_d02f6w", "score": "64", "subreddit": "CrusaderKings", "subreddit_id": "t5_2tgic"}, {"author": "KrysiSenpai", "body": "Right in the feelings", "created_utc": "1566601732.0", "edited": "False", "id": "exvlnwf", "is_submitter": "False", "link_id": "t3_culgmu", "parent_id": "t3_culgmu", "score": "6", "subreddit": "pan", "subreddit_id": "t5_2set6"}, {"author": "KrysiSenpai", "body": "Mów po polsku ty skurwysynu", "created_utc": "1565683164.0", "edited": "False", "id": "ewqwwzb", "is_submitter": "False", "link_id": "t3_cppxxr", "parent_id": "t1_ewqwt9z", "score": "-1", "subreddit": "ich_iel", "subreddit_id": "t5_37k29"}, {"author": "KrysiSenpai", "body": "W Amsterdamie nie miałem problemów z kartą, ale jak byłem w trochę mniejszej miejscowości (Woerden/Bodegraven) To rzeczywiście kilka razy nie przyjęli MasterCard", "created_utc": "1563290368.0", "edited": "False", "id": "etx31x4", "is_submitter": "False", "link_id": "t3_cdtiwr", "parent_id": "t1_etx2mwn", "score": "2", "subreddit": "Polska", "subreddit_id": "t5_2qiqo"}, {"author": "KrysiSenpai", "body": "The redstone for this is quite simple...", "created_utc": "1562389493.0", "edited": "False", "id": "et0zk38", "is_submitter": "False", "link_id": "t3_c9jc77", "parent_id": "t3_c9jc77", "score": "1", "subreddit": "Minecraft", "subreddit_id": "t5_2r05i"}, {"author": "KrysiSenpai", "body": "Who the hell knows, but it's an interesting question so that's pretty good", "created_utc": "1562354509.0", "edited": "False", "id": "esz3i4c", "is_submitter": "False", "link_id": "t3_c9inlg", "parent_id": "t1_esz3c6x", "score": "27", "subreddit": "history", "subreddit_id": "t5_2qh53"}, {"author": "KrysiSenpai", "body": "Wczoraj dostałem wyniki z matury, poszła mi nawet nieźle. Cała rodzina mi mówi żebym poszedł na studia na zarządzanie a potem do korpo, bo hajs musi się zgadzać. Dla mnie jednak nie liczą się tylko pieniądze, idę na germanistykę z rosyjskim ponieważ kocham uczyć się języków. Możliwe że nic po tym nie będę miał, ale nie mam zamiaru umierać w korpo :c", "created_utc": "1562307528.0", "edited": "False", "id": "esw11w8", "is_submitter": "False", "link_id": "t3_c92uje", "parent_id": "t1_ests2e8", "score": "5", "subreddit": "Polska", "subreddit_id": "t5_2qiqo"}, {"author": "KrysiSenpai", "body": "Wszyscy jesteście piękni", "created_utc": "1562171192.0", "edited": "False", "id": "esontfl", "is_submitter": "False", "link_id": "t3_c8fsem", "parent_id": "t1_esnpufm", "score": "12", "subreddit": "Polska", "subreddit_id": "t5_2qiqo"}, {"author": "KrysiSenpai", "body": "Zależy od liceum, profilu i chyba jak dobrze się uczysz. Dla mnie w liceum czas był na wagę złota, choć lubiłem liceum ponieważ miałem świetnych nauczycieli i dobrych znajomych, w życiu bym tam nie wrócił :l", "created_utc": "1561109033.0", "edited": "False", "id": "erpb4fv", "is_submitter": "False", "link_id": "t3_c363s6", "parent_id": "t1_erp6r7i", "score": "6", "subreddit": "Polska", "subreddit_id": "t5_2qiqo"}, {"author": "KrysiSenpai", "body": "Dzwonie po homokomando", "created_utc": "1559293073.0", "edited": "False", "id": "eplda6c", "is_submitter": "False", "link_id": "t3_bv4gdb", "parent_id": "t3_bv4gdb", "score": "48", "subreddit": "Polska", "subreddit_id": "t5_2qiqo"}, {"author": "KrysiSenpai", "body": "Ja, łącze sie z wszystkimi razemkami w bólu :c", "created_utc": "1558900753.0", "edited": "False", "id": "eovu7ua", "is_submitter": "False", "link_id": "t3_btbse1", "parent_id": "t1_eovpik7", "score": "4", "subreddit": "Polska", "subreddit_id": "t5_2qiqo"}, {"author": "KrysiSenpai", "body": "I really wish they set it somewhere outside the US. I'm really curious what is happening around the world!", "created_utc": "1558339602.0", "edited": "False", "id": "eo7hhrc", "is_submitter": "False", "link_id": "t3_bqk7iu", "parent_id": "t3_bqk7iu", "score": "2", "subreddit": "Fallout", "subreddit_id": "t5_2qnzu"}, {"author": "KrysiSenpai", "body": "Dziękuję żaba!!¡¡!", "created_utc": "1557322841.0", "edited": "False", "id": "emtturd", "is_submitter": "False", "link_id": "t3_bm35bx", "parent_id": "t1_emtgqko", "score": "2", "subreddit": "Polska", "subreddit_id": "t5_2qiqo"}, {"author": "KrysiSenpai", "body": "Rozszerzenie z polskiego napisane, nie było tak źle jak myślałem że będzie, mocno się rozpisałem! Moja ręka teraz tak umiera.. zobaczymy jak wyjdzie!", "created_utc": "1557151918.0", "edited": "False", "id": "emnbeor", "is_submitter": "False", "link_id": "t3_bkz67x", "parent_id": "t3_bkz67x", "score": "6", "subreddit": "Polska", "subreddit_id": "t5_2qiqo"}, {"author": "KrysiSenpai", "body": "Jeez man I feel u so much, starting my finals this Monday get I can't get myself off this game \n\nCarthago delenda est!!", "created_utc": "1556998782.0", "edited": "False", "id": "emiclum", "is_submitter": "False", "link_id": "t3_bkmd2q", "parent_id": "t1_emi4mqy", "score": "31", "subreddit": "Imperator", "subreddit_id": "t5_gpanm"}, {"author": "KrysiSenpai", "body": "I've bought fallout 76 a few weeks ago, and with 40 hours already and 30th level I can say that it is surely a fun game that I enjoy a lot, but that depends in what you like. \nWhen it comes to the quests, I have some mixed feelings. The quests itself aren't that bad really, the complete lack of NPCs isn't that much of a problem as well, tho a lot of missions would surely be much more interesting with them. \nUnfortunately, I do find myself often running aimlessly, trying to do anything to gain a higher level, as a lot of quests that I wanna do want me to go to a higher level area, which is one of the biggest pain for me, I have to grind a lot, and there aren't a lot of missions as well. \nWhat's better than the missions tho is the lore. Finding out what has been happening in Appalachia after the war (and even before!) by reading the terminals and notes is really interesting!", "created_utc": "1555109691.0", "edited": "False", "id": "ekra1c5", "is_submitter": "False", "link_id": "t3_bcizgv", "parent_id": "t1_ekr7puo", "score": "2", "subreddit": "Fallout", "subreddit_id": "t5_2qnzu"}, {"author": "KrysiSenpai", "body": "I've bought it for 10€ a week ago and I can say it's definitely worth it now, exploring and fighting is great, the community is amazing and if you have someone to play with its even better! And it's being continuously repaired and \"free\" new stuff is being added! Tho latest news of microtransactions are worrying :l", "created_utc": "1554798214.0", "edited": "False", "id": "ekgf59s", "is_submitter": "False", "link_id": "t3_bb3kx2", "parent_id": "t3_bb3kx2", "score": "4", "subreddit": "Fallout", "subreddit_id": "t5_2qnzu"}, {"author": "KrysiSenpai", "body": "I haven't played it on release, but I've bought it a week ago for like 10€ and I can say I am enjoying myself a lot! \nThere's a lot of stuff in this game that make me enjoy it less of course, lack of NPCs is a huge problem in my opinion, I've heard there are rumours they might be adding them tho! \nYou probably heard of them adding microtransactions, so that's worrying too :l \nBut yet I am really enjoying it, exploration is great and so is the community, and if you have someone to play with its even better! So it's surely worth playing now", "created_utc": "1554798064.0", "edited": "False", "id": "ekgf2dx", "is_submitter": "False", "link_id": "t3_bazhky", "parent_id": "t3_bazhky", "score": "3", "subreddit": "Fallout", "subreddit_id": "t5_2qnzu"}, {"author": "KrysiSenpai", "body": "Przepisuje się na matfiz elo ", "created_utc": "1544634993.0", "edited": "False", "id": "ebn3d0h", "is_submitter": "False", "link_id": "t3_a5hxr7", "parent_id": "t1_ebn2h1m", "score": "14", "subreddit": "masseffect", "subreddit_id": "t5_2rc19"}, {"author": "KrysiSenpai", "body": "Oh, my grand master, what a fine joke! You're joking! ...right? ", "created_utc": "1541255993.0", "edited": "False", "id": "e8z6in3", "is_submitter": "True", "link_id": "t3_9ttmiz", "parent_id": "t1_e8z4crm", "score": "75", "subreddit": "CrusaderKings", "subreddit_id": "t5_2tgic"}, {"author": "KrysiSenpai", "body": "You're an absolute madman! I've never managed to do that ;/", "created_utc": "1540801820.0", "edited": "False", "id": "e8nib2a", "is_submitter": "False", "link_id": "t3_9sam4f", "parent_id": "t3_9sam4f", "score": "9", "subreddit": "eu4", "subreddit_id": "t5_2uqat"}, {"author": "KrysiSenpai", "body": "Już za tyle rzeczy musimy panu Muskowi dziękować, a jednak on nigdy nie zwalnia i zawsze nas zaskakuje <3", "created_utc": "1540757508.0", "edited": "False", "id": "e8me9r1", "is_submitter": "False", "link_id": "t3_9s4d4o", "parent_id": "t3_9s4d4o", "score": "11", "subreddit": "Polska", "subreddit_id": "t5_2qiqo"}, {"author": "KrysiSenpai", "body": "Seriously? Never happened to me, something must have really gone shit. Guess the crusades actually worked for that one time! ", "created_utc": "1540711387.0", "edited": "False", "id": "e8lbmxe", "is_submitter": "False", "link_id": "t3_9rws2w", "parent_id": "t1_e8lbk7f", "score": "2", "subreddit": "CrusaderKings", "subreddit_id": "t5_2tgic"}, {"author": "KrysiSenpai", "body": "For some reason I never had a game in which Islam would do bad. Actually, in most of my games it is Christianity that does really horrible. Maybe it has to do with something I always start in 867 tho. Islam tends to get into Europe really well on this start day for me. ", "created_utc": "1540711141.0", "edited": "False", "id": "e8lbiqr", "is_submitter": "False", "link_id": "t3_9rws2w", "parent_id": "t3_9rws2w", "score": "4", "subreddit": "CrusaderKings", "subreddit_id": "t5_2tgic"}, {"author": "KrysiSenpai", "body": "Dziś się dowiedziałem od przewodniczącego że chciał zorganizować, ale sobie zapomniał. Aż smutno mi się zrobiło :c ", "created_utc": "1540561274.0", "edited": "False", "id": "e8hl3br", "is_submitter": "False", "link_id": "t3_9rjvqa", "parent_id": "t3_9rjvqa", "score": "5", "subreddit": "Polska", "subreddit_id": "t5_2qiqo"}, {"author": "KrysiSenpai", "body": "Well, whoever designed this, no wonder why their civilization does not exist anymore!", "created_utc": "1530346877.0", "edited": "False", "id": "e1jlgkl", "is_submitter": "False", "link_id": "t3_8uy0xg", "parent_id": "t3_8uy0xg", "score": "5", "subreddit": "Stellaris", "subreddit_id": "t5_39cuc"}, {"author": "KrysiSenpai", "body": "I always play on ironman! If I don't I end up using cheats or saving all the time even if I'm like \"I'm not gonna cheat!\". So without ironman it would just get too easy and boring ", "created_utc": "1525707267.0", "edited": "False", "id": "dyl8ij2", "is_submitter": "False", "link_id": "t3_8hnfao", "parent_id": "t3_8hnfao", "score": "6", "subreddit": "CrusaderKings", "subreddit_id": "t5_2tgic"}, {"author": "KrysiSenpai", "body": "Actually I've started at 769 as earl of Oxford! I've created the title a few days after the Aztecs come. The guy that supposed to do it died the day the Aztecs came. At least he didn't have to see England being destroyed :c ", "created_utc": "1524977849.0", "edited": "False", "id": "dy5e8cg", "is_submitter": "True", "link_id": "t3_8fmibz", "parent_id": "t1_dy563mn", "score": "3", "subreddit": "CrusaderKings", "subreddit_id": "t5_2tgic"}, {"author": "KrysiSenpai", "body": "I was thinking of swearing fealty anyway, it's kinda boring just being there alone. I'm gonna have some fun being inside the empire :D ", "created_utc": "1524949792.0", "edited": "False", "id": "dy4rczm", "is_submitter": "True", "link_id": "t3_8fmibz", "parent_id": "t1_dy4r1fv", "score": "12", "subreddit": "CrusaderKings", "subreddit_id": "t5_2tgic"}, {"author": "KrysiSenpai", "body": "I did! Might it be somehow the reason why don't they attack me? ", "created_utc": "1524948915.0", "edited": "False", "id": "dy4qk93", "is_submitter": "True", "link_id": "t3_8fmibz", "parent_id": "t1_dy4q1gx", "score": "18", "subreddit": "CrusaderKings", "subreddit_id": "t5_2tgic"}, {"author": "KrysiSenpai", "body": "I've bought SimCity at the release, and while it is still a fun game it is nowhere near the level of cities skylines! Tho I'm really bad at building cities, I can just be jealous of all those people making those great nice cities :c ", "created_utc": "1524572276.0", "edited": "False", "id": "dxvpsx6", "is_submitter": "False", "link_id": "t3_8e26xd", "parent_id": "t1_dxvmkuh", "score": "2", "subreddit": "sweden", "subreddit_id": "t5_2qofe"}, {"author": "KrysiSenpai", "body": "No nie wiem, czy to wszystko potem gdzieś tam nie leży przez jakiś czas? Niestety mam bardzo silne uczulenie na pierz :/ ", "created_utc": "1524511010.0", "edited": "False", "id": "dxuf08n", "is_submitter": "False", "link_id": "t3_8e2yft", "parent_id": "t1_dxth1na", "score": "1", "subreddit": "Polska", "subreddit_id": "t5_2qiqo"}, {"author": "KrysiSenpai", "body": "Gdyby nie uczulenie na pierz... ._.", "created_utc": "1524466020.0", "edited": "False", "id": "dxtgezk", "is_submitter": "False", "link_id": "t3_8e2yft", "parent_id": "t3_8e2yft", "score": "2", "subreddit": "Polska", "subreddit_id": "t5_2qiqo"}, {"author": "KrysiSenpai", "body": "Thank you ^•^ ", "created_utc": "1524428728.0", "edited": "False", "id": "dxsma16", "is_submitter": "False", "link_id": "t3_8e26xd", "parent_id": "t1_dxsm7vc", "score": "3", "subreddit": "sweden", "subreddit_id": "t5_2qofe"}, {"author": "KrysiSenpai", "body": "Krakow, Katowice, Warsaw and Poznan are the places you should check out too! And good luck with polish and these plans! ", "created_utc": "1524428610.0", "edited": "False", "id": "dxsm60h", "is_submitter": "False", "link_id": "t3_8e26xd", "parent_id": "t1_dxskr8e", "score": "6", "subreddit": "sweden", "subreddit_id": "t5_2qofe"}, {"author": "KrysiSenpai", "body": "Are you learning Polish? Nice! There aren't a lot of good Polish movies in my opinion, but these days some movies are dubbed into Polish, tho it might be hard to find them outside Poland, I don't really know. Netflix is producing a few Polish TV series at the moment tho so I'd keep an eye on that! ", "created_utc": "1524426705.0", "edited": "False", "id": "dxskd80", "is_submitter": "False", "link_id": "t3_8e26xd", "parent_id": "t1_dxsiz1x", "score": "4", "subreddit": "sweden", "subreddit_id": "t5_2qofe"}, {"author": "KrysiSenpai", "body": "Thank you! <3 And I love your country! Hopefully one day I can proudly be the citizen of Sweden as well ^•^ ", "created_utc": "1524424108.0", "edited": "False", "id": "dxshs1b", "is_submitter": "False", "link_id": "t3_8e26xd", "parent_id": "t1_dxsglpw", "score": "11", "subreddit": "sweden", "subreddit_id": "t5_2qofe"}, {"author": "KrysiSenpai", "body": "That's true! Well, in stellaris you just can't see how much do I suck :P", "created_utc": "1524423859.0", "edited": "False", "id": "dxshjnr", "is_submitter": "False", "link_id": "t3_8e26xd", "parent_id": "t1_dxse54d", "score": "2", "subreddit": "sweden", "subreddit_id": "t5_2qofe"}, {"author": "KrysiSenpai", "body": "Thank you! I have no time to learn Swedish lately tho because I have too much schoolwork to do but I'm trying my best! I need to find some Swedish stuff to watch coz my listening skills are horrible, I've started watching animated movies in Swedish on Netflix because they're dubbed ", "created_utc": "1524423757.0", "edited": "False", "id": "dxshg74", "is_submitter": "False", "link_id": "t3_8e26xd", "parent_id": "t1_dxs1xgb", "score": "7", "subreddit": "sweden", "subreddit_id": "t5_2qofe"}, {"author": "KrysiSenpai", "body": "Hej Hej! \nI just wanted to say hello and express my love to sweden :D I am currently learning Swedish as well, I think it is a nice language and I'm also planning to move to Sweden after I'm done with school. I always try to visit Sweden a few times a year, and part of my family already lives in Stockholm so it is not that hard! I am also trying to find a summer job in sweden. Last year I worked as a \"byggarbetare\" but everyone working there was Polish and I didn't really like it... ;-; So I am trying to find something else but without fluent Swedish it is kinda hard :c And Europride 2018 is set to be in Stockholm this year as well so I specially wanna visit it! ^^ \nAnd a needed question I guess - Which paradox game is your favourite? I think I enjoy Crusader Kings II the most :)\nLove you r/Sweden <3", "created_utc": "1524404917.0", "edited": "False", "id": "dxs0wrv", "is_submitter": "False", "link_id": "t3_8e26xd", "parent_id": "t3_8e26xd", "score": "50", "subreddit": "sweden", "subreddit_id": "t5_2qofe"}, {"author": "KrysiSenpai", "body": "Honestly, the landing was the best part in my opinion. It kinda looked like in some kind of sci-fi, and I had that \"wow, we live in the future\" kind of feeling. ", "created_utc": "1517959367.0", "edited": "False", "id": "dtujsdd", "is_submitter": "False", "link_id": "t3_7vqjsg", "parent_id": "t3_7vqjsg", "score": "6", "subreddit": "videos", "subreddit_id": "t5_2qh1e"}, {"author": "KrysiSenpai", "body": "Playing hide and seek, ran into the window ", "created_utc": "1495536003.0", "edited": "False", "id": "dhxbe7e", "is_submitter": "False", "link_id": "t3_6crvxr", "parent_id": "t3_6crvxr", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "KrysiSenpai", "body": "Widzę Niemcy w tej mapie :P Dobra robota ^^", "created_utc": "1491975887.0", "edited": "False", "id": "dg5jb39", "is_submitter": "False", "link_id": "t3_64thc2", "parent_id": "t1_dg5hjlc", "score": "2", "subreddit": "worldbuilding", "subreddit_id": "t5_2rd6n"}, {"author": "KrysiSenpai", "body": "Oh god, this is amazing! This really made me impressed! \nHow much does it actually cost now?", "created_utc": "1491716919.0", "edited": "False", "id": "dg0wl4w", "is_submitter": "False", "link_id": "t3_64ayvy", "parent_id": "t3_64ayvy", "score": "19", "subreddit": "conlangs", "subreddit_id": "t5_2red7"}, {"author": "KrysiSenpai", "body": "i5-4460, 8GB  RAM DDR3, R9 280 dual-x 3GB\nDo you think it will run well enough on high? Thanks!", "created_utc": "1488617985.0", "edited": "False", "id": "deht0xt", "is_submitter": "False", "link_id": "t3_5whgp3", "parent_id": "t3_5whgp3", "score": "2", "subreddit": "masseffect", "subreddit_id": "t5_2rc19"}, {"author": "KrysiSenpai", "body": "I had huawei p8 lite earlier, and this app was crashing like every few minutes. I couldn't make 2 lessons without this app crashing. I have no idea what the solution might be, it's working perfectly on phone I have now.", "created_utc": "1486041648.0", "edited": "False", "id": "dd8f79f", "is_submitter": "False", "link_id": "t3_5r2bbn", "parent_id": "t3_5r2bbn", "score": "1", "subreddit": "duolingo", "subreddit_id": "t5_2t6ze"}, {"author": "KrysiSenpai", "body": "Not my story, but my mom was looking for her phone, talking with someone on phone. ", "created_utc": "1483186828.0", "edited": "False", "id": "dbtxsk3", "is_submitter": "False", "link_id": "t3_5l5nul", "parent_id": "t3_5l5nul", "score": "2", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "KrysiSenpai", "body": "Sure, I'm JustMe", "created_utc": "1479033849.0", "edited": "False", "id": "d9ybg7r", "is_submitter": "False", "link_id": "t3_5coah5", "parent_id": "t1_d9yb9ib", "score": "1", "subreddit": "Esperanto", "subreddit_id": "t5_2qo5v"}, {"author": "KrysiSenpai", "body": "Messenger, LINE and I think Discord too", "created_utc": "1479028677.0", "edited": "False", "id": "d9ya21s", "is_submitter": "False", "link_id": "t3_5coah5", "parent_id": "t1_d9y9r80", "score": "1", "subreddit": "Esperanto", "subreddit_id": "t5_2qo5v"}, {"author": "KrysiSenpai", "body": "I'm MaineremPL, add me!\nAlso, don't reset your progress, coz i just lost 2000XP :P", "created_utc": "1479026385.0", "edited": "False", "id": "d9y9ecy", "is_submitter": "False", "link_id": "t3_5coah5", "parent_id": "t3_5coah5", "score": "1", "subreddit": "Esperanto", "subreddit_id": "t5_2qo5v"}]