[{"author": "LaCaspienne", "body": "Laughs in bi", "created_utc": "1666815048.0", "edited": "False", "id": "itwepwn", "is_submitter": "False", "link_id": "t3_ydvbwi", "parent_id": "t3_ydvbwi", "score": "1", "subreddit": "bisexual", "subreddit_id": "t5_2qwnx"}, {"author": "LaCaspienne", "body": "No matter what you do or don't do, you know that in the end, you got your SP (or anything else for that matter). You may still be processing stuff you need to purge, but you know that it just won't affect the process. It is done. You can think about it, you can even reach out to SP if you want to talk to them, though I wouldn't advise you to do it if you're in a sensitive moment, just for your own peace of mind. You still got this no matter what.", "created_utc": "1666698110.0", "edited": "False", "id": "itplcym", "is_submitter": "False", "link_id": "t3_yb8j6m", "parent_id": "t3_yb8j6m", "score": "6", "subreddit": "nevillegoddardsp", "subreddit_id": "t5_wipia"}, {"author": "LaCaspienne", "body": "Rest, first and foremost. Then, when you'll feel better, get back into your state like you did the first time. Revise and all, if needed. It's really that simple.  \nI'll play the role of your subconscious, this mishap is part of your bridge of events. You ARE in Barbados.", "created_utc": "1666683903.0", "edited": "False", "id": "itp3fx3", "is_submitter": "False", "link_id": "t3_ycs9a0", "parent_id": "t3_ycs9a0", "score": "7", "subreddit": "NevilleGoddard", "subreddit_id": "t5_3h5d7"}, {"author": "LaCaspienne", "body": "There's nothing nice about that imo. Or maybe I'm just too uptight on that, but it really infuriates me.", "created_utc": "1666683105.0", "edited": "False", "id": "itp2iua", "is_submitter": "False", "link_id": "t3_ybit5r", "parent_id": "t1_itnb7ho", "score": "1", "subreddit": "bisexual", "subreddit_id": "t5_2qwnx"}, {"author": "LaCaspienne", "body": "No?\n\nI had an interest in it since way before the war and it's not an evil man and some evil soldiers who will disgust me off learning Russian. If anything Russian has become so natural to write in for me that I can't imagine ever going back to my first language or English if writing fiction.  \nI also learnt Russian more for Kazakhstan than Russia.", "created_utc": "1666683048.0", "edited": "False", "id": "itp2ggv", "is_submitter": "False", "link_id": "t3_ycslcw", "parent_id": "t3_ycslcw", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "LaCaspienne", "body": "Forever? No. Until the war's over? Probably.", "created_utc": "1666682917.0", "edited": "False", "id": "itp2b2o", "is_submitter": "False", "link_id": "t3_ycslcw", "parent_id": "t1_ito7yl4", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "LaCaspienne", "body": "What the hell is this guy. Just who the hell kisses someone they are rejecting? It's just the best way to send a confusing message.", "created_utc": "1666620765.0", "edited": "False", "id": "itla7ex", "is_submitter": "False", "link_id": "t3_ybit5r", "parent_id": "t3_ybit5r", "score": "1", "subreddit": "bisexual", "subreddit_id": "t5_2qwnx"}, {"author": "LaCaspienne", "body": "I worked on my self-esteem tbh. Worked on valuing myself more and not tolerating such behaviour from others. I did a ton of CPTSD healing this summer, and this is when I started really thinking about how I was treated. \n\nTbh I knew I had some issues with that. I remember even in childhood feeling excluded more than once, but I assumed it was normal. I was replaced by a best friend at age 12, two years after my family broke, and it triggered me so hard I threatened suicide and murder (at 12 you don't know what that means for real anyway) and this was the start to my sporadic self-harm issues (just to reassure you, i haven't cut in 4 years). Had some really shitty experiences a few years ago with my group of friends (who were two sisters and their roomie) who always said I was welcome at their parties, then proceeded to let me down once saying I wasn't invited, and later on threw another one, saying that they wanted a party \"just the three of them\" but then went on to invite 4 Japanese exchange students and posting the evening on social media. Needless to say I got so upset that I hardly talked to them again, and the best thing is, they didn't get it until much later why I was suddenly gone. \n\nMore recently, around June, befriended a woman on a language app but I felt I had to \"squeeze\" my way into her life. She was the type to post a lot on instagram and having lots of friends from everywhere and I just felt like I had no place in her life, even if we had good conversations about healing emotionally. Things broke off when I told her that she deserved better than being toyed with by her long distance boyfriend, who had been breaking up with her at every argument, then finally broke up just before they were due to meet IRL, and she took it badly. It went away on its own and even if I kinda feel bad, I don't think I want to see her again. We were quite... incompatible in our tastes anyway, and I felt we had a massive intellectual gap despite the good emotional connection.\n\nBut once you start really valuing yourself more, you learn to avoid these people, as attractive as they may seem. There's a difference between being actually busy vs you having to literally squeeze in, or plainly and simply being \"the spare tire\". But tbh it's never your fault that they do that, the problem is about them. It takes a certain lack of compassion/empathy to exclude others like that. \n\n  \n\\> now that I think of it, I'm afraid they'll reject me too at one poin\n\nIt sure is scary when finally you feel included or valued. There is that fear that they'll reject you or abandon you at some point. You can't really prevent it, but you can at least try and assume the best, and rely on what your intuition really tells you. And I'm not talking, like, your anxiety taking its voice on. I'm talking, what your inner voice calmly says. Also, communicating is key. Voicing your fears is not something to be afraid of. On the contrary, it's the best way to weed out any potential issue before it comes out worse.", "created_utc": "1666546355.0", "edited": "False", "id": "ithbun6", "is_submitter": "False", "link_id": "t3_yb9k32", "parent_id": "t1_ith48hj", "score": "2", "subreddit": "CPTSD", "subreddit_id": "t5_2vvid"}, {"author": "LaCaspienne", "body": "I don't think it's so strange. We are wired to seek love and affection and it's only normal that we want to be someone's favourite, especially if we love them. It's normal, it's human. Jealousy can be a good thing in small doses, it shows that you care, even if it's like some substances, only good in a tiny dose until it gets toxic. I can judge by your post though that you're far from toxic. Tbh it sounds more like the people you associated with were assholes (especially that first best friend... kids can be real cunts to each other), or just didn't value you, and it's not because there is something wrong with you. These people just weren't the right ones. Sounds corny and lame, but true. \n\nI had this also, and I think it's a common thing for us trauma survivors, because our first attachments were not secure. We didn't feel special with our parents, so we unconsciously gravitate towards what we know, aka people who don't prioritize us. Not our fault again, it's simply how the brain works. It's wired to familiarity. \n\nYou're valuable, don't let anyone take this from you.", "created_utc": "1666512130.0", "edited": "False", "id": "itfmaur", "is_submitter": "False", "link_id": "t3_yb9k32", "parent_id": "t3_yb9k32", "score": "2", "subreddit": "CPTSD", "subreddit_id": "t5_2vvid"}, {"author": "LaCaspienne", "body": "I have this, yes. I experience it mostly when I'm already stressed in the first place (because I revert back to my old coping mechanisms) now, but it used to be my #1 way of feeling. No wonder why I tended to bottle up everything and then explode out of nowhere. It's a freeze mechanism I believe... and generally growing up in an environment where emotions apart from happiness are discouraged or ignored.", "created_utc": "1666511805.0", "edited": "False", "id": "itflwm7", "is_submitter": "False", "link_id": "t3_yb702x", "parent_id": "t3_yb702x", "score": "4", "subreddit": "CPTSD", "subreddit_id": "t5_2vvid"}, {"author": "LaCaspienne", "body": "I feel you. That's why I used to dissociate a ton. That's also why I smoke sometimes. To disappear behind the smoke for a while. I went on a solo trip recently and very much enjoyed being \"rootless\" there. It helped cement my healing a little more. It may not be for you, but another commenter has suggested backpacking, and I think physically getting away can be a really good thing.", "created_utc": "1665519105.0", "edited": "False", "id": "irxmugy", "is_submitter": "False", "link_id": "t3_y1dm7x", "parent_id": "t3_y1dm7x", "score": "3", "subreddit": "CPTSD", "subreddit_id": "t5_2vvid"}, {"author": "LaCaspienne", "body": "I think it may grow more and more due to the corporate push and all the propaganda on it, but then more and more people will get sick and go back to omnivore or even carnivore. It's bound to fail anyway. Vegans will then be back to being seen as some weird fanatics. There has never been any vegan society and there never will be.", "created_utc": "1665499521.0", "edited": "False", "id": "irw8kg6", "is_submitter": "False", "link_id": "t3_y101sf", "parent_id": "t3_y101sf", "score": "3", "subreddit": "AntiVegan", "subreddit_id": "t5_2ven0"}, {"author": "LaCaspienne", "body": "I think the bundle thing means, playing them on top of each other. Like, two subs at the same time. Might be wrong though.", "created_utc": "1665342122.0", "edited": "False", "id": "iro38m2", "is_submitter": "False", "link_id": "t3_xzt2tl", "parent_id": "t3_xzt2tl", "score": "2", "subreddit": "Subliminal", "subreddit_id": "t5_2v7bh"}, {"author": "LaCaspienne", "body": "More like, the sinking sun", "created_utc": "1665129706.0", "edited": "False", "id": "irdrtp3", "is_submitter": "False", "link_id": "t3_xxo7rz", "parent_id": "t3_xxo7rz", "score": "7", "subreddit": "submechanophobia", "subreddit_id": "t5_2xtuj"}, {"author": "LaCaspienne", "body": "A true hydrohomie here boys", "created_utc": "1665048228.0", "edited": "False", "id": "ir9e59w", "is_submitter": "False", "link_id": "t3_xwkckx", "parent_id": "t3_xwkckx", "score": "1", "subreddit": "HydroHomies", "subreddit_id": "t5_10288s"}, {"author": "LaCaspienne", "body": "I'd find my short stories, text fragments, and novel drafts and correct the hella out of them, then probably rewrite them better. (TL is Russian, and I write in Russian, not just fiction but also my diaries and such, and I intend to do the same with Kazakh when I'm ready)", "created_utc": "1664816564.0", "edited": "False", "id": "iqwl6oo", "is_submitter": "False", "link_id": "t3_xue3x9", "parent_id": "t3_xue3x9", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "LaCaspienne", "body": "Yeap, that's why I can't stand my own countrymen mostly", "created_utc": "1664808596.0", "edited": "False", "id": "iqw10r9", "is_submitter": "False", "link_id": "t3_xtzqjb", "parent_id": "t1_iqv0d9u", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "LaCaspienne", "body": "Oh the nightmare fuel", "created_utc": "1664767267.0", "edited": "False", "id": "iqua7vw", "is_submitter": "False", "link_id": "t3_xu70ca", "parent_id": "t3_xu70ca", "score": "28", "subreddit": "thalassophobia", "subreddit_id": "t5_2xfs1"}, {"author": "LaCaspienne", "body": "I didn't think a fish could look so expressive", "created_utc": "1664767116.0", "edited": "False", "id": "iqu9xfo", "is_submitter": "False", "link_id": "t3_xtykjx", "parent_id": "t3_xtykjx", "score": "6", "subreddit": "TheDepthsBelow", "subreddit_id": "t5_2xjsv"}, {"author": "LaCaspienne", "body": "Tbh I don't know. I feel that different sides of my personality come out. I don't get a new one per se but I can tell I'm grouchier and more negative in French. English is more of my neutral side, and I tend to crack a ton of jokes. In Russian I am calmer somewhat, softer. I wonder what Kazakh is going to bring out in me.\n\nI suspect those changes in personality are more tied to how I was when I started learning the language though, as in, mentally and emotionally rather than the language itself.", "created_utc": "1664766985.0", "edited": "False", "id": "iqu9ofz", "is_submitter": "False", "link_id": "t3_xtzqjb", "parent_id": "t3_xtzqjb", "score": "6", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "LaCaspienne", "body": "I think I'd have a heart attack, you're fucking brave", "created_utc": "1664703705.0", "edited": "False", "id": "iqqc0ao", "is_submitter": "False", "link_id": "t3_xt6q10", "parent_id": "t3_xt6q10", "score": "1", "subreddit": "thalassophobia", "subreddit_id": "t5_2xfs1"}, {"author": "LaCaspienne", "body": "WTF, I thought this was a 3D model or something", "created_utc": "1664561868.0", "edited": "False", "id": "iqj2lnu", "is_submitter": "False", "link_id": "t3_xrfvds", "parent_id": "t3_xrfvds", "score": "2", "subreddit": "LiminalSpace", "subreddit_id": "t5_233jor"}, {"author": "LaCaspienne", "body": "OMFG NOOOOO HAHAHAHAHAHA", "created_utc": "1664455091.0", "edited": "False", "id": "iqcymry", "is_submitter": "False", "link_id": "t3_xqzct3", "parent_id": "t1_iqcku8m", "score": "24", "subreddit": "engrish", "subreddit_id": "t5_2qmxz"}, {"author": "LaCaspienne", "body": "Yeah, I agree. I like it there, but for some reason I'm weirdly unsettled as well. I've been to Atyrau and I can definitely say Atyrau doesn't give me such a feeling. Maybe because it's pretty small, idk", "created_utc": "1664177414.0", "edited": "False", "id": "ipy0p06", "is_submitter": "True", "link_id": "t3_xo9e64", "parent_id": "t1_ipxsrof", "score": "1", "subreddit": "LiminalSpace", "subreddit_id": "t5_233jor"}, {"author": "LaCaspienne", "body": "Such a compassionate and empathetic person!", "created_utc": "1664115066.0", "edited": "False", "id": "ipuaucb", "is_submitter": "False", "link_id": "t3_xnlsd4", "parent_id": "t3_xnlsd4", "score": "17", "subreddit": "AntiVegan", "subreddit_id": "t5_2ven0"}, {"author": "LaCaspienne", "body": "covfeful", "created_utc": "1663858372.0", "edited": "False", "id": "iph4cv6", "is_submitter": "True", "link_id": "t3_xkx0l0", "parent_id": "t1_ipgogbs", "score": "3", "subreddit": "engrish", "subreddit_id": "t5_2qmxz"}, {"author": "LaCaspienne", "body": "You made my day dude", "created_utc": "1663674757.0", "edited": "False", "id": "ip6leu1", "is_submitter": "False", "link_id": "t3_xj1i8q", "parent_id": "t1_ip5z2if", "score": "7", "subreddit": "engrish", "subreddit_id": "t5_2qmxz"}, {"author": "LaCaspienne", "body": "Either I'm blind af or you really have a knack for spotting hidden cocks lol", "created_utc": "1663380972.0", "edited": "False", "id": "ioqx254", "is_submitter": "False", "link_id": "t3_xfodet", "parent_id": "t1_iop7vu0", "score": "2", "subreddit": "engrish", "subreddit_id": "t5_2qmxz"}, {"author": "LaCaspienne", "body": "The thing is, maybe to her it really was traumatic. Trauma isn't, like, something you can gatekeep or dismiss. You don't really know what it was like for her. \n\nI prefer not to assume that people are overdoing it, even if it seems to me that they use the word \"trauma\" a bit like a buzzword of sorts.", "created_utc": "1663380896.0", "edited": "False", "id": "ioqwwn8", "is_submitter": "False", "link_id": "t3_xg594m", "parent_id": "t3_xg594m", "score": "18", "subreddit": "CPTSD", "subreddit_id": "t5_2vvid"}, {"author": "LaCaspienne", "body": "Where did you see a cock and balls?", "created_utc": "1663345850.0", "edited": "False", "id": "ioon56e", "is_submitter": "False", "link_id": "t3_xfodet", "parent_id": "t1_ionwdek", "score": "5", "subreddit": "engrish", "subreddit_id": "t5_2qmxz"}, {"author": "LaCaspienne", "body": "I don't think it has any name...?\nTbh I understand, I tend to cry mainly when I'm stressed, whether it's anxiety, anger, or any other type of agitation that overcomes me. It's getting better now and I can get myself to have a good cry when I'm feeling sad, but for a long time the only times I would shed more than one tear would be in situations where I'm awfully stressed.\n\nI wasn't really allowed to cry. It was seen as manipulative or \"not listening\". Many times I was told \"stop crying, listen to me\" instead of being allowed to cry my heart out first and then listen. I don't know exactly when I internalized that crying was bad, but I remember holding back tears as young as age 4, and feeling that \"it was bad to cry\".", "created_utc": "1662981977.0", "edited": "False", "id": "io3yt0h", "is_submitter": "False", "link_id": "t3_xc43g7", "parent_id": "t3_xc43g7", "score": "2", "subreddit": "CPTSD", "subreddit_id": "t5_2vvid"}, {"author": "LaCaspienne", "body": "I can, yes, but only like, a couple times before I have to really get back to Europe. You stay 30 days in each visa free period, but after covid, you can't stay more than 90 days in a 180 day period. No idea if it's just on paper or really practiced, but I'd sure rather not risk entering illegal territory and possibly face jail/deportation/being banned from here for 5 years. \n\nBesides, if I have no money coming in and I'm just spending and spending, even little by little, I'm afraid that I'll run out of it eventually.", "created_utc": "1662976094.0", "edited": "False", "id": "io3r1nk", "is_submitter": "True", "link_id": "t3_xbhsf2", "parent_id": "t1_io3n2yl", "score": "1", "subreddit": "CPTSD", "subreddit_id": "t5_2vvid"}, {"author": "LaCaspienne", "body": "I'm in Atyrau currently but departing to Almaty tomorrow by train. I'll stay there for about ten days, then come back to Atyrau. I really love Atyrau tbh, even if there is \"nothing to see\". It's big enough not to be boring and small enough to be comfy.", "created_utc": "1662972252.0", "edited": "False", "id": "io3mqye", "is_submitter": "True", "link_id": "t3_xbhsf2", "parent_id": "t1_io3m586", "score": "1", "subreddit": "CPTSD", "subreddit_id": "t5_2vvid"}, {"author": "LaCaspienne", "body": "It's a country I very much love, culturally and historically. I have a thing for post Soviet states in general, including Russia, though I'm more of a Central Asia person.\n\nAlso, tbh, good if I don't see any Frenchman for a while. I can't say I like my countrymen very much overall.", "created_utc": "1662955464.0", "edited": "False", "id": "io30ho9", "is_submitter": "True", "link_id": "t3_xbhsf2", "parent_id": "t1_io1729h", "score": "1", "subreddit": "CPTSD", "subreddit_id": "t5_2vvid"}, {"author": "LaCaspienne", "body": "The Queen pretty much died of old age and she had to make it about veganism of course.\nThis lady is nuts.", "created_utc": "1662779812.0", "edited": "False", "id": "int9tzt", "is_submitter": "False", "link_id": "t3_xa7crp", "parent_id": "t3_xa7crp", "score": "8", "subreddit": "AntiVegan", "subreddit_id": "t5_2ven0"}, {"author": "LaCaspienne", "body": "This is a beautiful kind of scary", "created_utc": "1662779738.0", "edited": "False", "id": "int9owk", "is_submitter": "False", "link_id": "t3_xad386", "parent_id": "t3_xad386", "score": "5", "subreddit": "thalassophobia", "subreddit_id": "t5_2xfs1"}, {"author": "LaCaspienne", "body": "In a clothes shop in western Kazakhstan", "created_utc": "1662725783.0", "edited": "False", "id": "inpu5rh", "is_submitter": "True", "link_id": "t3_x9tyff", "parent_id": "t3_x9tyff", "score": "2", "subreddit": "engrish", "subreddit_id": "t5_2qmxz"}, {"author": "LaCaspienne", "body": "Uurrrgh, I understand you. It took me forever to realize that stuff was not just me being oversensitive or overinterpreting things. \n\nI was the \"oversensitive\" or \"easily offended\" child, but now I realize, I was reacting normally to very offensive stuff disguised as nice. I sometimes still experience it at the hands of my mother. I'm acting detached to her, as it's part of my healing, and once she cooked dinner after I hadn't been doing it for a while. The conversation went like this:\n\n- Oh, that looks good.\n- What should you say?\n- Hm, that looks good.\n- No, you should say thank you. Look how nice I am? \n\nThis irritated me a ton, not gonna lie. It felt like passive aggression and it probably was. I think since then I haven't cooked dinner, or rarely.\n\nAnother time, I was talking about being worried about ending up like my uncle who might've had CPTSD but very very likely a dependence/incompetence schema due to my grandmother overindulging him and always doing everything for him, he didn't work despite having a profession, did drugs, had druggie friends, and let himself die after my grandma died. He's basically what I'm afraid to become in the end, and I had tried opening up to my mother about it. She said \"oh yeah but you'll move your ass\". I hated it. It implied that I'm a lazy bum. At the time I was head deep into my freeze response and even the trip I'm going to take soon wasn't even an option emotionally. And then she wonders why I hardly speak to her, shut down whenever I want to criticize her, or when I have to open up about something and avoid interaction more and more.\n\nIn these situations you just want to say fuck you.", "created_utc": "1662483534.0", "edited": "False", "id": "inc2pa1", "is_submitter": "False", "link_id": "t3_x7ezvb", "parent_id": "t3_x7ezvb", "score": "10", "subreddit": "CPTSD", "subreddit_id": "t5_2vvid"}, {"author": "LaCaspienne", "body": "Doug Ross", "created_utc": "1662445894.0", "edited": "False", "id": "ina7vkt", "is_submitter": "False", "link_id": "t3_x6gipm", "parent_id": "t1_ina1o0b", "score": "1", "subreddit": "submechanophobia", "subreddit_id": "t5_2xtuj"}, {"author": "LaCaspienne", "body": "Oh hey, this reminds me of that ER episode where Ross saves a boy stuck inside something like that", "created_utc": "1662405422.0", "edited": "False", "id": "in7xx1m", "is_submitter": "False", "link_id": "t3_x6gipm", "parent_id": "t3_x6gipm", "score": "1", "subreddit": "submechanophobia", "subreddit_id": "t5_2xtuj"}, {"author": "LaCaspienne", "body": "I stopped watching the news a long time ago tbh, can't be arsed with their non-stop fear porn, and Ukraine is not an exception.", "created_utc": "1662315976.0", "edited": "False", "id": "in33ipf", "is_submitter": "False", "link_id": "t3_x5s8lf", "parent_id": "t3_x5s8lf", "score": "3", "subreddit": "CPTSD", "subreddit_id": "t5_2vvid"}, {"author": "LaCaspienne", "body": "Stomach, chest, throat, jaws, shoulders for me. \n\nStomach: fear of rejection, fear of standing up for myself or do something on my own, general anxiety sits there for me and can cause me to get the runs or lose my appetite and be nauseous all day\n\nChest: The pain of rejection/loss, feeling of being about to have a heart attack, the heaviness of depression, a feeling of being alone. The pain in the chest is a massive trigger for me because it reminds me of all these times I've felt despair. Even if I'm just anxious. \n\nThroat: Fear of imagining good things happening to me, fear of speaking up and expressing my love to others, for fear they will either reject it or worse, use it against me (happened unfortunately), blockages related to expression. I think that's one of my most damaged \"centers\", but I'm working at expressing myself unapologetically and being vulnerable with my feelings. \n\nJaw: probably my extinguished fight response. I clench my jaw when I'm angry or feeling angry and repressing it. An interesting thing is that I got physical trauma on my jaw when that goddamn idiot surgeon probably opened it too wide when he got my wisdom teeth taken out. Now it cracks on the left side every time I open it wide and feels sort of uneven.\n\nShoulders: general tension, being ready to flee or freeze, hypervigilance, feeling pressured to be the best, feeling like I have to pretend to stand tall. I have something physical related to shoulders/spine also. I remember being a child, 6-7, and my mother washing my hair. I'd frequently slouch because I relaxed and she'd forcefully push on my back and shoulders and force me to stand upright. Angrily. She'd say \"it's so you don't get a hunched back!!\", but all I can feel is the feeling that I'm annoying her.\n\nI also feel things in my lower legs, ankles, feet. The feeling I've been roaming and roaming endlessly and not finding a place to stay and truly feel safe and rest.", "created_utc": "1662285190.0", "edited": "False", "id": "in1bomx", "is_submitter": "False", "link_id": "t3_x5er3j", "parent_id": "t3_x5er3j", "score": "3", "subreddit": "CPTSD", "subreddit_id": "t5_2vvid"}, {"author": "LaCaspienne", "body": "I don't think I would. The decision would be irreversible, so...", "created_utc": "1662198984.0", "edited": "False", "id": "imwq4mo", "is_submitter": "False", "link_id": "t3_x4qjq6", "parent_id": "t3_x4qjq6", "score": "5", "subreddit": "CPTSD", "subreddit_id": "t5_2vvid"}, {"author": "LaCaspienne", "body": "It's going to be alright. Tbh, I find that it's always much less awful than it seems.", "created_utc": "1662143918.0", "edited": "False", "id": "imtwjmi", "is_submitter": "False", "link_id": "t3_x47exj", "parent_id": "t3_x47exj", "score": "1", "subreddit": "CPTSD", "subreddit_id": "t5_2vvid"}, {"author": "LaCaspienne", "body": "I was disorganized, but managed to get somewhat secure. I still gotta implement it, but I've made a ton of progress.", "created_utc": "1662100378.0", "edited": "False", "id": "imrks7l", "is_submitter": "False", "link_id": "t3_x3lfk2", "parent_id": "t3_x3lfk2", "score": "1", "subreddit": "CPTSD", "subreddit_id": "t5_2vvid"}, {"author": "LaCaspienne", "body": "I do the grocery shopping and generally have to go outside at least a bit every day not to go insane. I like being outside overall, but since I hate the city I live in, I just need a reason to go out.", "created_utc": "1662056659.0", "edited": "False", "id": "imoxdam", "is_submitter": "False", "link_id": "t3_x3badz", "parent_id": "t3_x3badz", "score": "3", "subreddit": "CPTSD", "subreddit_id": "t5_2vvid"}, {"author": "LaCaspienne", "body": "I saw a mother hugging her child son on the street a few days ago. It felt weird. Like, weird. I was simultaneously happy and sad. I'm happy because it's so good seeing parent being affectionate to their kids or even just treating them properly, but... I'm sad, too, because I can't relate. \n\nThe same goes when I see my cousins with their parents. They tell them about their life, they are close to them, you can feel the complicity. With my mother there is none of that. I'm not entirely cold, we laugh together, we are not insulting each other, but there is a distance that is unbridgeable. Even the sight of her is enough to sort of... give me disgust, sometimes raging disgust, and her energy feels like an aggression to me. I feel that the resentment has gone so bad from being unable to speak about it that it just killed any semblance of daughterly love I have for her. The best part is that I still feel guilty about it. I feel I'm being unfair, but when I tried to heal for the first time at 17 and confronted her, it escalated so hard it just triggered me to an unspeakable level and now I'm unable to even voice criticism anymore. I'd rather just shut up now, and I can tell how emotionally detached I have become. I'm soon going on a month long trip and I'm more sad about leaving my cats behind than leaving her behind.\n\nImagining my own mother hugging me or even touching me feels repulsive, and I don't even think she'd hug me like that on the street.", "created_utc": "1662050064.0", "edited": "False", "id": "imog55i", "is_submitter": "False", "link_id": "t3_x2yjaw", "parent_id": "t3_x2yjaw", "score": "5", "subreddit": "CPTSD", "subreddit_id": "t5_2vvid"}, {"author": "LaCaspienne", "body": "Hey... it's okay. Everything's okay.", "created_utc": "1662042408.0", "edited": "False", "id": "imnwfs1", "is_submitter": "False", "link_id": "t3_x2j20j", "parent_id": "t3_x2j20j", "score": "2", "subreddit": "CPTSD", "subreddit_id": "t5_2vvid"}, {"author": "LaCaspienne", "body": "I don't think talking to yourself is abnormal, or even a symptom of CPTSD. Maybe it's more common in trauma survivors, idk, but it doesn't really feel abnormal to me. Everyone does it.", "created_utc": "1662023652.0", "edited": "False", "id": "immye0q", "is_submitter": "False", "link_id": "t3_x2vm4s", "parent_id": "t3_x2vm4s", "score": "10", "subreddit": "CPTSD", "subreddit_id": "t5_2vvid"}, {"author": "LaCaspienne", "body": "I'm already scared of regular jellyfish, but a big one like that? I'd get a goddamn heart attack", "created_utc": "1661975037.0", "edited": "False", "id": "imkbcfe", "is_submitter": "False", "link_id": "t3_x1gz7d", "parent_id": "t3_x1gz7d", "score": "1", "subreddit": "megalophobia", "subreddit_id": "t5_31gwh"}, {"author": "LaCaspienne", "body": "Aaaahahaha I've got the heebie jeebies already...", "created_utc": "1661971654.0", "edited": "False", "id": "imk2d0c", "is_submitter": "False", "link_id": "t3_x06d85", "parent_id": "t1_imk270u", "score": "2", "subreddit": "submechanophobia", "subreddit_id": "t5_2xtuj"}, {"author": "LaCaspienne", "body": "The third pic terrifies me the most tbh...", "created_utc": "1661971525.0", "edited": "False", "id": "imk20lp", "is_submitter": "False", "link_id": "t3_x2900d", "parent_id": "t3_x2900d", "score": "7", "subreddit": "submechanophobia", "subreddit_id": "t5_2xtuj"}, {"author": "LaCaspienne", "body": "The under of about anything that floats on water is a no-no for me. Bonus point if it's a chain or a propeller.", "created_utc": "1661971306.0", "edited": "False", "id": "imk1fpg", "is_submitter": "False", "link_id": "t3_x06d85", "parent_id": "t3_x06d85", "score": "4", "subreddit": "submechanophobia", "subreddit_id": "t5_2xtuj"}, {"author": "LaCaspienne", "body": "Yes, omg, I did have so many fantasies of this growing up.\nI was hardly ever punished by my parents, but I just... desperately wishing they would beat me or just punish me harshly. I thought something was wrong with me, but now that I think of it, even negative attention is attention, and children crave it", "created_utc": "1661926070.0", "edited": "False", "id": "imhmth1", "is_submitter": "False", "link_id": "t3_x1wmpq", "parent_id": "t3_x1wmpq", "score": "3", "subreddit": "CPTSD", "subreddit_id": "t5_2vvid"}, {"author": "LaCaspienne", "body": "It sure does make a difference. I'm about halfway through my healing journey (if not a wee bit past the mid point) and I'm finally starting to really feel \"normal\". Of course, I'm still probably neurodivergent (even if just slightly), but I think a lot of my issues were in fact related to trauma and trauma resposes, and that I could actually function in society, although I'd still choose to be minimally involved because it's basically a bag of crisps. Much of it is just air. \n\nAnxiety no longer grips me like it used to and I can tell this was definitely one of the worst, if not THE worst part. It's sad that I missed out on growing up with a family, having a non-confusing childhood, and having fun in my teenage years, but I honestly like the person I have become, and I'll have other experiences in possibly even better ways than I could've had if I had a normal childhood. She's incredibly powerful and resilient, and actually takes her life into her own hands, even if one bit at a time. I may sound a bit vain but I feel admiration towards myself in a way. I think it's a good thing, defo much better than the loads of self-hate I used to experience.\n\nNow the other half of recovery is putting into practice and solidifying the healing. It's gonna be a process too. But I'm confident about it for the most part.", "created_utc": "1661866055.0", "edited": "False", "id": "imdtw77", "is_submitter": "False", "link_id": "t3_x1e2iz", "parent_id": "t3_x1e2iz", "score": "3", "subreddit": "CPTSD", "subreddit_id": "t5_2vvid"}, {"author": "LaCaspienne", "body": "You need some rest. You sound totally exhausted, and understandably so. CPTSD is a nightmare to deal with. \n\nIt's very common to feel that way when you are in the very beginning of healing. It seems so huge and impossible, and it feels like the whole world is blaming you, and anything feels like a personal attack, again understandably so, given how trauma literally fries your brain and nervous system.\n\nRest, it's okay. The very fact you are here is good. It's not much about \"fixing yourself\", it's about \"learning how to take care of yourself again\", and \"getting better\". Think of it as a physical wound. You don't fix a physical wound, you heal it. You rest. You attend to it so it doesn't get infected and potentially make you very sick or kill you. There's no \"fixing\" here, just healing.\n\nWe are with you. <3", "created_utc": "1661786919.0", "edited": "False", "id": "im9m4tt", "is_submitter": "False", "link_id": "t3_x0mo5o", "parent_id": "t3_x0mo5o", "score": "41", "subreddit": "CPTSD", "subreddit_id": "t5_2vvid"}, {"author": "LaCaspienne", "body": "Christmas just reminds me I don't have a family when I was conned to believe that \"family is the most important thing\" and \"your family are the only people who will love and accept you unconditionally\". When telling my mother about this she replied \"oh but family for you was mommy and daddy\".\n\nNice to remember this load of bullshit when my mother was emotionally unavailable and I still don't feel safe opening up to her, my father was never there and ended up leaving, my brother went to live with his father when I was 6 and then I didn't see him that much, all the extended family is scattered around the country, I hardly see them, I didn't meet them from ages 2 to 16, and they consider me basically an extension of my mother more than a full-fledged person.\n\nFuck Christmas and family oriented holidays.", "created_utc": "1661786631.0", "edited": "False", "id": "im9lf0t", "is_submitter": "False", "link_id": "t3_x0ffbb", "parent_id": "t3_x0ffbb", "score": "8", "subreddit": "CPTSD", "subreddit_id": "t5_2vvid"}, {"author": "LaCaspienne", "body": "I felt this way when I wasn't healed, but now I've come to realize, she's still there. I haven't changed that much from her, just grew up, and I may be growing into a close version of what she was supposed to be. \n\nI like to imagine that I appear to her and tell her about everything. I tell her about all the horrors she is going to experience, all the pain, the fear, but that in the end, as an adult, she will get better, and will want to inspire others to be better, as well. I think she'd be pretty scared knowing what's awaiting her, but there would also be a sense of peace that she is going to be better in the end and back to herself.\n\nShe's got a different name than me, but that's ok. She didn't like that name, either, and would probably love the one I chose.", "created_utc": "1661775712.0", "edited": "False", "id": "im8x8la", "is_submitter": "False", "link_id": "t3_x07x4b", "parent_id": "t3_x07x4b", "score": "1", "subreddit": "CPTSD", "subreddit_id": "t5_2vvid"}, {"author": "LaCaspienne", "body": "Who the fuck would put this on their bag omfg", "created_utc": "1661709955.0", "edited": "False", "id": "im5m8c2", "is_submitter": "False", "link_id": "t3_wzulee", "parent_id": "t1_im4xem6", "score": "10", "subreddit": "CPTSD", "subreddit_id": "t5_2vvid"}, {"author": "LaCaspienne", "body": "Yes, and I like to believe it's real, even though not physically real. There is just so much we don't know about the non-physical reality... After all, there's no proof that it is real, but there's also no proof that it isn't either. The person in question is oddly enough not someone I particularly admire, but something draws me to them. It's not about who they were or what they did... it's entirely something else, beyond all of this. I can't explain. It's just * them * as a spirit, so to speak. I like to consider them my spirit guide, or my guardian angel. Not that different from an imaginary friend, but I like to think those are real as well, they are simply some discarnate soulmates of yours that show up in the form you have made, so to speak. They are in disguise to help you.\n\nIn the end, if it's all in my imagination, that means I am gifted at it, and at self-soothing. I'm spiritually inclined, but I understand that it may not be for everyone. But there is absolutely nothing shameful in that. If anything, I think it can be pretty healthy if not pushed to the extreme.", "created_utc": "1661709062.0", "edited": "False", "id": "im5k0wd", "is_submitter": "False", "link_id": "t3_wzqsta", "parent_id": "t3_wzqsta", "score": "4", "subreddit": "CPTSD", "subreddit_id": "t5_2vvid"}, {"author": "LaCaspienne", "body": "I have two types.\n\nIn one of them I get a lump in the throat, burning in the chest, stomach getting upset and uh, diarrhea. I lose my appetite completely or near completely. In this case I generally don't dissociate, or not entirely, but the bigger symptom generally is the upset stomach. I've never thrown up from anxiety but I probably could if it were to get big. \n\nIn another I freeze up, straight up. I dissociate. I literally stare off into space for several minutes, kinda thinking but at the same time feeling \"absent\". It's like everything becomes flat... everything feels like it's a badly made decor around me. I think it's when even the first type is too small.\n\nIn both: intrusive thoughts, paranoid beliefs about people being about to fuck me over/reject me. An urge to run but at the same time being frozen in place. I literally daydream about running away.", "created_utc": "1661630231.0", "edited": "1661630485.0", "id": "im1jgwz", "is_submitter": "False", "link_id": "t3_wz1mbt", "parent_id": "t3_wz1mbt", "score": "2", "subreddit": "CPTSD", "subreddit_id": "t5_2vvid"}, {"author": "LaCaspienne", "body": "Oh jesus I'd be scared about ending up stuck there", "created_utc": "1661624053.0", "edited": "False", "id": "im14v4z", "is_submitter": "False", "link_id": "t3_wyx6se", "parent_id": "t3_wyx6se", "score": "8", "subreddit": "submechanophobia", "subreddit_id": "t5_2xtuj"}, {"author": "LaCaspienne", "body": "I'm proud of you! <3 This is a huge milestone for you, and you totally deserve it. Maybe college or starting businesses just wasn't for you. You did a massive one there, bud. It takes so much courage from someone who has trauma to make a point to get through something that triggers them a lot.\n\nTbh, my biggest sign is that I don't dissociate, that anxiety doesn't rule over me like it did in the past, that I'm able to notice when I have a flashback (I have a ton of mini flashbacks), that I can be optimistic for the future, and that I feel joy... even in a very \"softened\" way. \n\nI'm currently healing a lot of things and even if it's hard and exhausting, the newfound feeling of joy and power is just priceless.", "created_utc": "1661590429.0", "edited": "False", "id": "ilzb7wi", "is_submitter": "False", "link_id": "t3_wyor35", "parent_id": "t3_wyor35", "score": "1", "subreddit": "CPTSD", "subreddit_id": "t5_2vvid"}, {"author": "LaCaspienne", "body": "Just like the other commenter, I just want to say I'm proud of you. <3 It will be much, much easier to heal when you're not constantly around these people!", "created_utc": "1661589987.0", "edited": "False", "id": "ilzaok6", "is_submitter": "False", "link_id": "t3_wyw6f3", "parent_id": "t3_wyw6f3", "score": "7", "subreddit": "CPTSD", "subreddit_id": "t5_2vvid"}, {"author": "LaCaspienne", "body": "Oh yes, it is pretty common in CPTSD folks. I experienced it a lot, just like you, going into suicidal despair after being rejected or just not reciprocated, being sad all day over the crush, being consumed... I think it's something that stems from the emotional neglect we experienced in childhood.\n\nYou're not a creep, and you don't have to be ashamed for wanting to communicate with your crush. It is essential to detach from him, but you're not \"bad\" for experiencing that. Shame is a deadly poison. And don't think you are \"sick\". Limerence is a symptom, I would say, not an illness. Shame just makes it a thousand times worse to deal with. But society hates support. It loves blaming and shaming, it's so much easier.\n\nDon't worry about it. Yes, the \"cure\" (man do I hate this word in this context) is starving contact, but also getting support from other people. We are wired to seek support. I hope mine will help you a bit.", "created_utc": "1661589632.0", "edited": "False", "id": "ilza9ac", "is_submitter": "False", "link_id": "t3_wyxe94", "parent_id": "t3_wyxe94", "score": "68", "subreddit": "CPTSD", "subreddit_id": "t5_2vvid"}, {"author": "LaCaspienne", "body": "I used to, yeah. Most triggers don't ruin my whole day anymore (as I can tell those are simply triggers and don't have anything to do with the present for the most part, they're memories that flash back, or things associated to certain words, songs or images), but I have some that still could fuck me up for days. Fortunately they are the rather rare occurence lately.", "created_utc": "1661543550.0", "edited": "False", "id": "ilwul60", "is_submitter": "False", "link_id": "t3_wygdee", "parent_id": "t3_wygdee", "score": "4", "subreddit": "CPTSD", "subreddit_id": "t5_2vvid"}, {"author": "LaCaspienne", "body": "I feel quite detached from her. Like, I still live with her but... I feel like I mostly severed the connection. \n\nI feel that we are just related on a genetic level but nothing more. She's more like a roommate to me than a parent, which is... kinda sad, but probably for the better. I sometimes wish I had a mother I could tell everything to, though. I never had that. I always hid most of my life and activities away from her, and increasingly so since my teen years.\n\nI just don't feel the warm mother-daughter bond that is supposed to be there. I do have a mother on a genetic level, but I don't have a mommy, and the word \"mommy\" itself makes a lump appear in my throat and an urge to cry.", "created_utc": "1661509405.0", "edited": "False", "id": "iluoek5", "is_submitter": "False", "link_id": "t3_wxx96b", "parent_id": "t3_wxx96b", "score": "1", "subreddit": "CPTSD", "subreddit_id": "t5_2vvid"}, {"author": "LaCaspienne", "body": "I have a really good one up until I get anxiety or into a flashback, lol", "created_utc": "1661508541.0", "edited": "False", "id": "ilun9ml", "is_submitter": "False", "link_id": "t3_wxt2dz", "parent_id": "t3_wxt2dz", "score": "1", "subreddit": "CPTSD", "subreddit_id": "t5_2vvid"}, {"author": "LaCaspienne", "body": "We were penpals then friends and I caught a crush on her and we played games together. She may or may not have felt a thing towards me too, we flirted a bit with each other over voice chat while playing, but it would have been tough anyway if we dated since her country of origin is pretty conservative. I was terrified she'd leave me and replace me with someone else, or that she secretly had someone else and wouldn't tell me. This fear was a general fear of mine up until... a couple years ago? I used to be constantly afraid of being \"second best\", or being replaced with someone else, or to be cheated on if I entered a relationship of any kind. My worst fear was that she would get a bf/gf. I don't think she did at the time, but if she did, good for her I guess hahaha, I just hope they are better than the hot mess I was at 19. \n\nShe would rather frequently bail on plans even knowing I was a bit freakout prone when bailed on without explanation or being warned first. Sometimes I would assume she just had an unexpected thing come up, try to play one of her games out of curiosity, and realize she's actually there, in invisible (you can't play someone else's games when they play them). We shared our Steam libraries, and for me it was a way to, uh, still have a sense of control, even though I didn't admit it to myself at the time. Like, I realize it could make me see when she would be playing in invisible mode after telling me she wouldn't be home, or something. And it triggered me a ton because of the action/words gap, but I never said a thing to her about it, except maybe when I dropped the final wall of text and exploded out of the blue for something really minor. I was never aggressive to her until I exploded and I never even told her about the time I went as far as self-harming, because I thought that I was the problem in every situation where shit went wrong. It couldn't just have been \"she needs some time to herself\" nooo, it was necessarily, in my mind, \"I'm annoying so people avoid me\". Note that I wouldn't have reacted badly at all if she had told me she didn't feel like playing, tbh. I would've always preferred her to tell me the truth instead of... evading. But I wasn't entirely honest either... so I guess we were even?\n\nWhile triggered, I had intrusive thoughts about shooting her mother and eating her pet birds so I'd be the only one in her life (yes, it was that bad, I'm scared at my own past thoughts considering how abhorrent it seems to me now). When she asked me about a life decision I basically convinced her it was a bad idea because I was planning to go there and I was afraid I'd miss her. I didn't go there in the end lmfao. It was straight up ridiculous.\n\nedit: my post is completely messy, I apologize, it's late here and I'm still a little dysregulated", "created_utc": "1661464634.0", "edited": "1661465147.0", "id": "ilsi2ul", "is_submitter": "True", "link_id": "t3_wxit3w", "parent_id": "t1_ils6uqm", "score": "1", "subreddit": "CPTSD", "subreddit_id": "t5_2vvid"}, {"author": "LaCaspienne", "body": "I've heard of it, yeah, but I don't know if what happened to me falls under this umbrella. This person was mega unreliable and unpredictable, but was never mean to me or anything.", "created_utc": "1661449096.0", "edited": "False", "id": "ilreb69", "is_submitter": "True", "link_id": "t3_wxit3w", "parent_id": "t1_ilrd0of", "score": "3", "subreddit": "CPTSD", "subreddit_id": "t5_2vvid"}, {"author": "LaCaspienne", "body": "The trainwreck of childhood emotional neglect and invalidation, the fact the only parent I felt a strong bond to (my father) was hardly there and ended up separating from my mother definitely, the separation itself being messy af, then repeated rejection in my teenage years, which I wouldn't say sealed my fate as I'm working to heal it, but definitely was the final nail in the coffin for me and is the worst trauma for me to deal with due to how already fragile I was at the time, and how I blamed myself for all these years for being \"unlovable\", \"undateable\", \"broken\", \"crazy\", and \"unwanted\". The combo was *deadly*. I never attempted s*cide but came dangerously close a few times because of that, and each rejection was worse than the previous one, when it's supposed to \"get easier\". I also thought for a long time that it was BPD, although I don't think I meet the full criteria for it anymore. Had I been to a psych ward I would've definitely been labeled as BPD. \n\nI think rejection wouldn't have been so hard on me if I hadn't been thoroughly emotionally neglected in childhood, if my mother did her damn job and taught me about relationships rather than \"don't trust anyone\" and \"letting me make my own experiences\", if I had felt safe about opening up to her and talking about my life (which in fact is a big red flag in itself), and if I was supported rather than shamed and blamed for being \"creepy\" and \"stalking the girl\", when I had my first real teenage crush and was so dissociated from my body I had no idea why I felt the way I felt and why I felt the urge to be close to that girl.\n\nI EFT-tapped a big chunk of my rejection trauma yesterday and it left me so wiped out that I spent my day with a headache, burning eyes from the crying that resulted from freeing those emotions, being utterly exhausted, and slept 2 hours earlier than my usual bedtime. Now I'm feeling better about it, but I'm probably not out of the woods yet. I noticed that I'm not actually afraid of being rejected by the person I'm interested in, but that I get flashbacks from the previous ones, which \"taint\" the present, basically what... flashbacks are, and I wonder how I missed it for years and years. Like, I literally see them, hear their voice/see their messages, and all. They replace the current one almost. And I wonder how much trauma has literally ruined my chance in my teen years. It's already hard for a teenage lesbian to date, so for a teenage lesbian with such massive trauma...\n\nNow I can say I'm doing much better with that, but I can tell I still have work to do. I noticed I have quite a bit of trigger words (\"one-sided\", even not in the context of romance, for example), and other things that really messed with the present. I probably ruined a lot of stuff just from the trauma and totally misinterpreted situations or got myself into bad ones unknowingly. But I can't blame myself. Trauma is an invisible demon for the most part.", "created_utc": "1661438749.0", "edited": "False", "id": "ilqmxl5", "is_submitter": "False", "link_id": "t3_wxehoi", "parent_id": "t3_wxehoi", "score": "7", "subreddit": "CPTSD", "subreddit_id": "t5_2vvid"}, {"author": "LaCaspienne", "body": "Kinda, yeah. I feel everyone else has somehow cracked a code I can't decipher.\n\nMy major ones are job, finances and moving out. Relationships, well, tbh I'm not really sure I care that much about not having been with anyone at 22 anymore. I get crushes easily still but I'm quite picky about who I'd actually want to be with.", "created_utc": "1661436234.0", "edited": "False", "id": "ilqgmkb", "is_submitter": "False", "link_id": "t3_wxbthv", "parent_id": "t3_wxbthv", "score": "2", "subreddit": "CPTSD", "subreddit_id": "t5_2vvid"}, {"author": "LaCaspienne", "body": "Codependency, BPD (though I don't have it, I thought it had it for many years), bipolar, hysteria, psychosis, child education and development (as a kid I would go on these sites that are intended for mothers, now I think I know why), anxiety, addictions, delusional disorders, attachment issues.\n\nAlso uh, funeral practices, death, and those type of things", "created_utc": "1661263154.0", "edited": "False", "id": "ilggavl", "is_submitter": "False", "link_id": "t3_wvnx5j", "parent_id": "t3_wvnx5j", "score": "8", "subreddit": "CPTSD", "subreddit_id": "t5_2vvid"}, {"author": "LaCaspienne", "body": "Jesus, you dodged a nuke with this asshole.", "created_utc": "1661249628.0", "edited": "False", "id": "ilfr7vq", "is_submitter": "False", "link_id": "t3_wv3sr9", "parent_id": "t1_ildohxo", "score": "1", "subreddit": "CPTSD", "subreddit_id": "t5_2vvid"}, {"author": "LaCaspienne", "body": "Yes... I think it's a very typical thing in traumatized people. \n\nYou need attention yet getting it is shameful at best, dangerous at worst. And I don't mean superficial attention like likes on instagram. I mean, real attention. Being seen and heard, like you said. Because people can use whatever you say or do against you. I mean look at cancel culture and how some people had their life ruined because of one thing they said and some Twatter user misinterpreted. Or the artists who get bullied to a s*cide attempt because they draw a character slightly thinner than the original design. This world doesn't make you want to put yourself out there. It's hard already for normal people but for the ones with trauma, the struggle is 1000x worse.", "created_utc": "1661249260.0", "edited": "False", "id": "ilfqqp9", "is_submitter": "False", "link_id": "t3_wvhq5h", "parent_id": "t3_wvhq5h", "score": "21", "subreddit": "CPTSD", "subreddit_id": "t5_2vvid"}, {"author": "LaCaspienne", "body": "From ages 14 to 17 I was obsessed with Girls und Panzer, which is one of the rare animes I've been a fan of. I would write fanfiction of it, and the characters wouldn't necessarily be themselves, but symbolic ways for me to express myself. That gave to some oddities. I have the originals in my computer still (written in my native language then translated to English), I keep them as a memory of that period, even if they weren't too great.\n\nSometimes it was even my own characters from my own universes I obsessed about. I literally spent my teen years obsessed with shit. Either people or things...", "created_utc": "1661202732.0", "edited": "False", "id": "ildftbi", "is_submitter": "False", "link_id": "t3_wv3sr9", "parent_id": "t3_wv3sr9", "score": "6", "subreddit": "CPTSD", "subreddit_id": "t5_2vvid"}, {"author": "LaCaspienne", "body": "1. I'm 22 right now. \n\n2. It was in June of this year when a friend of mine sent me the book by Pete Walker. He likely has CPTSD as well and told me I would really benefit by reading this book. However I realized I had trauma well before, at about age 17. But when I tried to confront my mother about having never felt love in childhood, it escalated so hard I just froze again.\n\n3. More of a rollercoaster tbh... complicated mess. As I said, I had that one period at 17 when I attempted to heal, but I was put back into silence. I buried it back. It was one of the horridest, most mentally unhealthy periods in my life. I displayed BPD-like behaviour. Was diagnosed with depression, then bipolar 1 because I got twice to a point I was in so much pain I went psychotic, on the first time with delusions, and on the second with olfactory hallucinations that would hit me up to around 15 times a day. I would feel very disoriented after them (now I think maybe they were seizures?). I completely isolated from the world and hid in my room from age 18 to right now, as I'm trying to get out.\n\nIn June of this year, as I was seriously considering moving to the country I've been eyeing, getting to know, and learning the language for the last 2 years, I thought that it would be actually good to heal at least a part of my issues before I am met with \"wherever you go, there you are\" type stuff. My friend sent me the pdf of the book. I started researching CPTSD and realized it was actually this all along. Since then my recovery has been about half linear... I'm in a much better place than in June tbh, retyping out my diaries I can definitely tell the difference between June and August selves. But at times I'm hit back in the face with another flashback. Now I can feel it and let it go. I know that it's my trauma speaking, not my present, and even if it's hard and exhausting to deal with them, in the end I'm much better-equipped.\n\nRight now, I'm healing my (so far most horrible and flashback-inducing) fear of falling in love... with somebody just as scared as me (19 years old). I have a good feeling about it though. We haven't told each other clearly we like each other, but it's pretty obvious that we do, and we also acknowledge it's early yet to tell if we're a good match, but we both want to make this work. I suspect she may have CPTSD too, and I'm also healing my codependency at the same time. Unlike my previous crushes I don't have the awful obsession part and also don't want to rush into a relationship, I really want to make the pleasure of getting to know each other last for a while, although I really would love her to be my gf (we'd be each other's first relationship) and I'm crazy excited about what may be in store for us. I have pretty severe trauma related to romantic relationships (rejected over and over again, spent my whole teen years pining after girls who at best didn't feel the same, at worst hated me, felt unlovable, unwanted and undesirable, + the whole ordeal of not being straight, piling up on emotional neglect in childhood, it was awful enough to make me suicidal and psychotic, to the point I wonder how I didn't end up in a psych ward), so it's definitely a massive challenge. But I can do it. I push through. I refuse to let the past control me anymore.", "created_utc": "1661097901.0", "edited": "False", "id": "il7fz8q", "is_submitter": "False", "link_id": "t3_wtxxfn", "parent_id": "t3_wtxxfn", "score": "2", "subreddit": "CPTSD", "subreddit_id": "t5_2vvid"}, {"author": "LaCaspienne", "body": "Hey, that's a good idea! I'm going to try this out and be as sadistic to that blanket as I can hahahaa", "created_utc": "1660986912.0", "edited": "False", "id": "il1p2uj", "is_submitter": "False", "link_id": "t3_wstklq", "parent_id": "t3_wstklq", "score": "2", "subreddit": "CPTSD", "subreddit_id": "t5_2vvid"}, {"author": "LaCaspienne", "body": "No CSA, but a good amount of emotional abuse and neglect. It's not that they make me feel icky, but I'm super shy around them. \n\nA few years ago the daughter of a restaurant owner, around 7 or so years old at the time, wanted to play with me (I was about 17 and very much deep into the awful-ness). She was adorable but I just straight up froze. Couldn't even look at her. I don't know why. I regret not having played with her that day. If it was only up to me I would've chased her around the tables playfully and all. I think... I fear hurting them unintentionally? The same happened with my little sister the last time I saw her (she was about a year and half old?). I wanted to have fun with her but I froze. I could hardly do it. My stepmother doesn't like me and even took her from my arms once when I tried to comfort her after she had woken up during a nap. And stepmother was looking at me the whole time too.\n\nI just have no idea how to deal with kids. I was the youngest up until my father remarried and had my sisters (I have an age gap of 16 and 20 years with them). When I was little I hated babies and toddlers, or even younger kids, because they reminded me that I was also one, and thus powerless and not worthy of being listened to, that whatever I had to say was worthless and meaningless. I hated anything related to motherhood and even imagined myself sadistically beating the fuck out of my own kids if I were to have them. I'm just shocked that at such a young age I could imagine such awful shit when I had never been physically abused myself. As an adult I wouldn't ever do that, the thought makes me sick, but I'm still very much aware that even small stuff can fuck them up.\n\nIn a way I'm glad I didn't have younger siblings up until my teen years, despite having always craved a little brother/sister (sister esp) in my life. I would've been awful to them possibly. But when I became a big sister, I couldn't enjoy my new role at all because age gap + bad relationship with father and stepmum. Feels like a cruel trick really.", "created_utc": "1660937902.0", "edited": "1660938143.0", "id": "ikz4din", "is_submitter": "False", "link_id": "t3_wshf3e", "parent_id": "t3_wshf3e", "score": "6", "subreddit": "CPTSD", "subreddit_id": "t5_2vvid"}, {"author": "LaCaspienne", "body": "Time does heal, but not in the simplistic way they say it does. It's mostly what you do during that time that heals more than time itself. \n\nThe anger and grief are a part of the process. I still experience mine from time to time when a uncovered bit comes up, but mostly resolved them. It's hard, but you will get to a point when you can know when it's a flashback and detach from it. The important thing is to allow yourself to feel this anger and grief. If you repress them, it's guaranteed to make the whole thing harder. Don't repress them. Let them out. Write them out if you can't speak them. Draw them. Do something with them, but let them come up and release them. \n\nA therapist may help. I personally don't go to therapy and do the work by myself, but for some people it's better to do this with someone.", "created_utc": "1660923417.0", "edited": "False", "id": "iky2yqh", "is_submitter": "False", "link_id": "t3_ws74tv", "parent_id": "t3_ws74tv", "score": "6", "subreddit": "CPTSD", "subreddit_id": "t5_2vvid"}, {"author": "LaCaspienne", "body": "Thanks. It's also quite cathartic to write it out!", "created_utc": "1660811587.0", "edited": "False", "id": "ikrrkux", "is_submitter": "True", "link_id": "t3_wrchz7", "parent_id": "t1_ikro6jx", "score": "2", "subreddit": "CPTSD", "subreddit_id": "t5_2vvid"}, {"author": "LaCaspienne", "body": "Why not reschedule the movie night with just your friend? It may sound weird especially given your anxiety right now, but I think you need to communicate to him. Ask him to reschedule. He probably doesn't hate you, the anxiety makes us think things that are totally irrational (I've been like this too, now have recovered). \n\nI understand your pain. It just... yeah, makes you feel crazy. But it's the anxiety. It's not your fault. You're not crazy, you're traumatized. And it makes sense that you feel a lot more anxious at such things than the average person would.", "created_utc": "1660757159.0", "edited": "False", "id": "ikokc0v", "is_submitter": "False", "link_id": "t3_wqbpt4", "parent_id": "t3_wqbpt4", "score": "1", "subreddit": "CPTSD", "subreddit_id": "t5_2vvid"}, {"author": "LaCaspienne", "body": "You're not alone. I had the same for a very long time and still sometimes experience it when I'm stressed. I generally eat safe foods in these moments, ginger, ginger tea, ginger candies, whatever soothes my stomach, but mostly stuff containing ginger, and use peppermint oil on my wrists. In such phases I can usually eat just carbs, anything else makes me feel like utter shit for hours as if I've swallowed poison.\n\nWhen I was a teenager I would purposely wait until I felt physically sick to eat. Looking back, it was not just a crippling anxiety symptom, it was also very likely a form of self-harm. I weighed only 46 kilograms at the age of 17 or so, which is slightly underweight for my height. It was never about my weight, it was really about... food. Fear of food. And that sort of weird thought of \"absorbing\" something. \n\nIt's not a scientific theory, but I have a hunch that this can also be related to the feeling of being \"fed up\". Not wanting any more to enter. Not wanting to \"absorb\" more. You can't \"swallow it\" or \"digest it\" anymore. The body expresses symbolically what our mind cannot.", "created_utc": "1660756947.0", "edited": "False", "id": "ikojrwl", "is_submitter": "False", "link_id": "t3_wqaeye", "parent_id": "t3_wqaeye", "score": "3", "subreddit": "CPTSD", "subreddit_id": "t5_2vvid"}, {"author": "LaCaspienne", "body": "I have a crap ton of hobbies but not any career. I know many things yet feel totally worthless in terms of work, because none of these are \"desirable\" in society. Mostly creative stuff and self-taught.", "created_utc": "1660749049.0", "edited": "False", "id": "iknyzk8", "is_submitter": "False", "link_id": "t3_wqlhi0", "parent_id": "t3_wqlhi0", "score": "10", "subreddit": "CPTSD", "subreddit_id": "t5_2vvid"}, {"author": "LaCaspienne", "body": "I had this, yeah. I attended my own funeral more times than I can count. I often imagined myself dying quietly, alone, or with another nearby. I'm usually telling the other person to leave the room. Or I'm having a short bit of conversation with them, they exit, and I take this moment to calm myself and exit my body. I've never attempted suicide although I came close more than once. But I've fantasized about my own death way too many times for it to be normal.\n\nIt's also very present in my writing. If a character dies (especially by suicide), you can be almost sure it's my avatar, which isn't always the main character, and if they are, they are only indirectly so. In my current novel, my avatar (who was first supposed to kill herself) gets in a coma after a car accident, and her friends find out her secrets, such as how she ran away from her family and had a spiritual lover. In another story that I'm pondering right now, my character goes through some Divine Comedy type dream while she is dying from overheating due to having a fever during summer and isolating herself away from her family in a very hot place (on purpose or not? we'll never know). In one of my first attempts at novels, my character tried to kill herself, and another avatar was a pyromaniac who threw herself into a volcano to set herself on fire. \n\nI'm glad I'm not alone in having imagined my own death in every way possible.", "created_utc": "1660631891.0", "edited": "False", "id": "ikhlr1y", "is_submitter": "False", "link_id": "t3_wpgdih", "parent_id": "t3_wpgdih", "score": "2", "subreddit": "CPTSD", "subreddit_id": "t5_2vvid"}, {"author": "LaCaspienne", "body": "Many times, because I was hurting and hurt people hurt people, but also because I was hardly taught how to interact with people, and in my family it's good to be \"undemonstrative\". Yet my mother would scold me for being rude. For being \"haughty\" and \"contemptuous\". At 13 years old, when I was a traumatized kid also dealing with the beginning of teen hormones. Yeah. She would smile at people and then criticize them once we were home.\n\nI'm not as \"rude\" anymore. I think it has to do with the fact I'm much more relaxed now, and although it's still hard for me to smile at strangers, I'm no longer as guarded and hurt.", "created_utc": "1660631126.0", "edited": "False", "id": "ikhkqdd", "is_submitter": "False", "link_id": "t3_wp8czn", "parent_id": "t3_wp8czn", "score": "2", "subreddit": "CPTSD", "subreddit_id": "t5_2vvid"}, {"author": "LaCaspienne", "body": "Had a teacher like this in our equivalent of 4th grade or so. Asshole bullied me and a handful of other kids in the class. Thankfully it didn't affect me as much as my own parents, but still, he was a dick. He's still practicing as of 2018-19. The school's principal cares more about the reputation of her school than about the kids. How many kids did he bully? How many did he fuck up?", "created_utc": "1660555143.0", "edited": "False", "id": "ikd1a37", "is_submitter": "False", "link_id": "t3_woj5cn", "parent_id": "t1_ikb9lqg", "score": "7", "subreddit": "CPTSD", "subreddit_id": "t5_2vvid"}, {"author": "LaCaspienne", "body": "I had this one too. It's basically a way to blame you for your own sensitivity. I got \"you would be super happy and then super sad when you got disappointed\", \"you were super touchy growing up\", \"we can't tell you anything without you getting offended\", \"you don't tolerate banter\", \"you're hypersensitive\", and the worst of the worst, \"I don't know what to tell you or what to do with you\". My mother for a while would say I probably have Asperger's (which is untrue, despite having some traits, which I think are actually trauma responses), but once I got that bipolar misdiagnosis, something I regret a ton, now all of this is due to \"my illness\". \n\nIt can't possibly be because I was not attuned to growing up and that the people making jokes (my brother, his father and grandfather, who have a borderline abusive sense of humour) were completely insensitive. No. It's because of IQ, \"my illness\", and likely autism!! /s\n\nThis is just a massive cop out to avoid responsibility and blame you for your own sensitivity.", "created_utc": "1660545157.0", "edited": "False", "id": "ikcoyiz", "is_submitter": "False", "link_id": "t3_wojry2", "parent_id": "t3_wojry2", "score": "10", "subreddit": "CPTSD", "subreddit_id": "t5_2vvid"}, {"author": "LaCaspienne", "body": "I did have typical synesthesia as a child, but I guess that's what it mutated into", "created_utc": "1660544092.0", "edited": "False", "id": "ikcnixh", "is_submitter": "True", "link_id": "t3_woc7ku", "parent_id": "t1_ikb715d", "score": "2", "subreddit": "infp", "subreddit_id": "t5_2qn2o"}, {"author": "LaCaspienne", "body": "Omg, what the fuck... our world is so hung up on making everyone uniform and \"perfectly sane\" that they take away all that's special about those who have been blessed by the gift of creativity.\n\nTbh I wouldn't survive without it. I'd wither, actually go insane if I didn't have it, and most likely end my life, because to me it's like breathing air almost. Essential to survival, at least mentally and emotionally.\n\nI didn't think about Fe this way, but it makes a lot of sense.", "created_utc": "1660501326.0", "edited": "False", "id": "ika6r4n", "is_submitter": "True", "link_id": "t3_woc7ku", "parent_id": "t1_ika5aef", "score": "2", "subreddit": "infp", "subreddit_id": "t5_2qn2o"}, {"author": "LaCaspienne", "body": "Healing is tough but worth it. Think of it as a physical wound (trauma being a mental wound). It sure hurts at first and as it heals. It itches as the scar tissue forms. But it hurts even more when you let it fester and become infected, and the infection can make you really, really sick. Hence why it's important to heal your wound before it starts screwing you up badly.\n\nIt may not sound true right now, but you can do it. It's akin to climbing goddamn mount Everest, but it's ultimately what you'll have to face to get better. The only way out is through, there is no escape. Trying to escape it will only make it worse. Back to the wound analogy, if you let it fester, it will become infected and make you sick. You don't deserve this.\n\nIt's not going to smell like roses and be full of glitter. It's gonna be hard. Painful. You'll feel like you want to die sometimes, or that it's never ending. But things move in the background. I started properly healing a couple months ago and have done a thousand times more progress than with the psychologist I saw at age 15-16 and the psychiatrist who misdiagnosed me as bipolar. I'm not out of the woods yet, but I can tell a difference was made. It was atrocious at the beginning especially. The anger, the guilt, the shame. All those repressed emotions for two decades. But I had to do it, because I couldn't stand living like this anymore. Those feelings eat away at you, and eventually make your body break down, because the mind and body are connected. I didn't want to self-destruct like that because of the mistakes of the people who conceived and raised me (person, rather, even if both fucked up). I sufficiently respected and loved myself to say \"no, I don't deserve such a fate\".\n\nYou deserve it too. You deserve a good life. You deserve love, a career, and the life you want. But you need to get through the hard part first. It's normal to feel overwhelmed at first. But as you get through, you'll feel better, gradually.", "created_utc": "1660496062.0", "edited": "False", "id": "ik9tnbs", "is_submitter": "False", "link_id": "t3_wo5xft", "parent_id": "t3_wo5xft", "score": "11", "subreddit": "CPTSD", "subreddit_id": "t5_2vvid"}, {"author": "LaCaspienne", "body": "I have healed or at least healed a good portion of most of these, but the harder ones are definitely the diminishing social circle one, asking for help, and giving.\nAsking for help is just the worst especially when since childhood you were basically taught it's weak and dangerous to ask for help", "created_utc": "1660461054.0", "edited": "False", "id": "ik86lwq", "is_submitter": "False", "link_id": "t3_wnn0mu", "parent_id": "t3_wnn0mu", "score": "2", "subreddit": "Codependency", "subreddit_id": "t5_2sblj"}, {"author": "LaCaspienne", "body": "They're pretty tasty in duck grease though hahaha", "created_utc": "1660395142.0", "edited": "False", "id": "ik4fgqu", "is_submitter": "True", "link_id": "t3_wnb3z6", "parent_id": "t1_ik49v41", "score": "8", "subreddit": "CPTSD", "subreddit_id": "t5_2vvid"}, {"author": "LaCaspienne", "body": "Yes, I was misdiagnosed as bipolar because I thought I had it and got tested and most likely skewed my responses to get a diagnosis. I couldn't figure out what was wrong with me, so I figured I was likely bipolar, and \"made sure to get it official\". I feel like an impostor now. I didn't tell much to my psychiatrist because my mind would go blank every time. Had she known I had trauma, maybe the dx would've been different, though I think maybe it could've been BPD, which is just as bad, as CPTSD afaik isn't recognized in my country.\n\nI hadn't acknowledged my trauma (rather, did, but my mother shut me back down quickly so I buried it back). I didn't realize that my 'manic and mixed episodes' were in fact emotional flashbacks made worse by physical exhaustion. It didn't manifest in the typical delusions of grandeur and impossible spending and impulsivity and all: it was mostly rage, mood swings, self-destructive and aggressive urges, and it was triggered by social factors, like rejection, having bottled up my anger for so long that I exploded at whoever had treated me badly for a while, and generally hormones + lack of sleep + constant stress. I never believed I was God or whatever, never bought a 45000 euro car, or whatever else that is mostly associated with mania. I didn't go days without sleeping, although I hardly got any sleep because I desperately wanted to be alone in the house at night. Can't relate to the people who have had these manic episodes. Of course had abysmal depression as well. Went psychotic twice, but given that my sleep schedule was fucked, my diet was fucked, and I was unaware of my trauma and triggers, now I see why. Those times I went psychotic, I was so exhausted and in pain that I literally went crazy. Never attempted su*cide, but came dangerously close several times.\n\nI took lithium for 2 years but all it did was make me \"behave\", aka blunt me so hard emotionally I hardly reacted to anything. I was constantly paranoid about taking it twice and getting lithium poisoning. I stopped my treatment and stopped seeing my psychiatrist, and haven't had an \"episode\" since. I have never been psychotic again. I sleep much better, eat better, and am now aware of my triggers and actively healing. I definitely don't have bipolar disorder but... well, my family doesn't accept that. I think \"my illness\" (like my mother calls it) is a convenient excuse now and I realize getting that dx was a huge mistake. I feel so angry when I'm called disabled or \"ill\" because now I know I was never ill in the first place. I was injured.", "created_utc": "1660376268.0", "edited": "False", "id": "ik3qacg", "is_submitter": "False", "link_id": "t3_wmzvht", "parent_id": "t3_wmzvht", "score": "3", "subreddit": "CPTSD", "subreddit_id": "t5_2vvid"}, {"author": "LaCaspienne", "body": "Jesus do you need to be so aggressive about it?", "created_utc": "1660334364.0", "edited": "False", "id": "ik1er5i", "is_submitter": "False", "link_id": "t3_wltvj7", "parent_id": "t1_ik1ap23", "score": "8", "subreddit": "exvegans", "subreddit_id": "t5_109235"}, {"author": "LaCaspienne", "body": "Disorganized, but I'm actually in a much better place than I used to be. In the past I couldn't self-soothe at all and would freak the fuck out at any trigger.\n\nNow I can rise above, although I'll still feel at least a hint of anxiety, and tell myself these words (may help you as well):\n\n- It's the trauma speaking, not the present.\n- You aren't afraid of what they do, but of what they could do.\n- They're not [name of person who hurt me]. \n- It's okay to be scared. You've been traumatized, it's valid.\n- Take your mind off them for a moment, let's do something else.\n- Hey, maybe it's because you badly slept last night. It can make the anxiety a ton worse. Try and rest a bit, right?\n- You're not in danger. \n- You're okay.\n- You're healing. It's already better than the last one.\n\namong others. I'm much more secure now, but I still feel the insecurity creeping back up, except now I know that it's simply been triggered and doesn't necessarily reflect or mean anything. It just means I'm reacting like a person who has trauma with attachments.", "created_utc": "1660312417.0", "edited": "False", "id": "ijztuoc", "is_submitter": "False", "link_id": "t3_wmk9t1", "parent_id": "t3_wmk9t1", "score": "38", "subreddit": "CPTSD", "subreddit_id": "t5_2vvid"}, {"author": "LaCaspienne", "body": "When you're full of unexpressed anger it's a totally normal thing. It's a way for you to express yourself. Own your anger. Let it flow through you. Don't use it destructively (aka, harming yourself or others), but express it in a way you can. Idk, stab a pillow, write a story about anger, yell at the top of your lungs if that helps you, but express it, let it go out!\n\nYou're not an awful person, you're just massively angry right now and you can't find an outlet for this anger. Been there as well. It's tough, but once you own your anger and allow yourself to feel it, it already gets easier. Doesn't make it go away, but still easier to deal with.", "created_utc": "1660198850.0", "edited": "False", "id": "ijtqdrr", "is_submitter": "False", "link_id": "t3_wl9tfa", "parent_id": "t3_wl9tfa", "score": "3", "subreddit": "CPTSD", "subreddit_id": "t5_2vvid"}, {"author": "LaCaspienne", "body": "As a child I remember frequently waking up tired, although I had no real idea why. I always asked why we had to wake up so early and send tired kids to school. Now I think maybe I went to bed too late, or I just slept badly. My memories of this are blurry.\n\nAs a teenager my sleep cycle got totally fucked. It didn't help that my mother \"let me make my own choices\" which now sounds to me like basically bailing out of the responsibility to set limits, which are fucking crucial to a teenager. Some people will say I'm lucky but now I'm just mad at that because I desperately needed structure and never got it, not to mention the emotional neglect. \n\nI would be awake at night and sleep during the day. Got to school on 3-4 hours of sleep regularly, and then to just maybe 2 in the 11th/12th year equivalent. I ended up dropping out of school (still graduated, barely though). I just loved being awake at night too much. I felt safer alone at night. I could do everything I wanted. I loved being the only one still awake. Had many late night conversations with friends and crushes. I kept this habit until college, but the lack of sleep + trauma + being a teenager made me completely break and go crazy. I was misdiagnosed as bipolar. Dropped out of college and one day decided to shift my sleep schedule to a more normal one for health reasons. I still love the night, but... I hardly got any sunlight and hardly got out of the house at the time, and it was making shit worse. When I would go to my father's home at least there would a limit, like I could sleep until 1pm max. I still didn't feel good at his place for other reasons, but at least... he did this. \n\nI still cannot get up until my mother is gone to work. I just lay in my bed awake until I hear her going away. For some reason I cannot stand to see her in the morning. When I do I just feel angry and tense. Her presence, even when not doing anything, feels like an aggression on my senses, and the best is that even for me it's confusing considering most of the time we act neutral to each other and she finds excuses to talk to me sometimes (which irritates me considering she had 22 YEARS to fix her shit and never did for real).", "created_utc": "1660198683.0", "edited": "False", "id": "ijtq5e1", "is_submitter": "False", "link_id": "t3_wl7el6", "parent_id": "t3_wl7el6", "score": "3", "subreddit": "CPTSD", "subreddit_id": "t5_2vvid"}, {"author": "LaCaspienne", "body": "I got told \"I'm proud of you\" it but it was pretty empty. Like the tone was flat. I remember specifically my father telling me, and I can still hear how just... flat it sounds. There was hardly any emotion in his voice. I never felt like either of them was really proud of me.\n\nI remember having been told \"I love you\" by my mother very young but it stopped after I turned 6-7, aka the time when your true personality starts to form. I think she will never admit it, but she liked me better when I was very little and still an extension of her.", "created_utc": "1660197218.0", "edited": "False", "id": "ijto42h", "is_submitter": "False", "link_id": "t3_wl98a2", "parent_id": "t3_wl98a2", "score": "3", "subreddit": "CPTSD", "subreddit_id": "t5_2vvid"}, {"author": "LaCaspienne", "body": "I found a way around it: write in a foreign language. I write my journals in Russian. Not only it's great practice, but it's also a surefire way to make sure your journals remain yours.", "created_utc": "1660136552.0", "edited": "False", "id": "ijpotg8", "is_submitter": "False", "link_id": "t3_wk54tt", "parent_id": "t3_wk54tt", "score": "1", "subreddit": "CPTSD", "subreddit_id": "t5_2vvid"}, {"author": "LaCaspienne", "body": "I did. Oh god I did. In childhood I would get crushes, but they never liked me back, or straight up disliked me. I remember one crush of mine particularly, it was the last day of school and I drew her a little picture of a heart on paper, gave it to her, and later on found it on the ground in the school yard crumpled. I felt pain. Lots of it. I was 8.\n\nSpent my whole teenage years pining after girls that either didn't feel the same or straight up hated me. It was so bad I could get kinda stalkerish, especially since I wasn't taught AT ALL how to deal with crushes and all. My mother said I was \"creepy\" after she learnt about the first one at age 13 (the only reason why she learnt about it was because the girl went to the counselor's office because I scared her), and well yeah, sure I was creepy,  but how about you teach me how to deal with it instead of just blaming a 13-year-old girl who has not even a clue even how to deal with a crush, let alone with her homosexuality? With each crush, each rejection, I got worse and worse. I would sink deeper and deeper into anger, depression, hell could've become an incel if I had been a guy. I even went psychotic and harassed one of them without really intending to, at age 16, and still feel bad about it now. I didn't have her number or social media thankfully, but still, I probably traumatized her, and it traumatized me, too. I nearly attempted suicide several times over crushes. It was that bad. Kissed only one girl, who I didn't like, because I thought \"you're not going to get another shot at it, go\", but didn't date her, because she had a long-distance bf and was cheating on him with me.\n\nI thought I had BPD for a very long time due to this attachment trauma + being a teenager running on empty, but turns out, I most likely have CPTSD. I still get crushes rather easily but they're not as all-consuming as they used to be, and pretty much out of sight, out of mind. I'll never tell a few of my friends that I felt a damn crush for them at the beginning, even if I don't think of them that way now. I also can stop rather easily, once I learn they have a bf for example, or they're straight. Now it's no longer the end of the world if they are, I'm just \"hhhh okay, crap, guess I'll just move on\". I don't push like crazy anymore either like I used to.", "created_utc": "1659940280.0", "edited": "False", "id": "ijess3l", "is_submitter": "False", "link_id": "t3_wiz2v4", "parent_id": "t3_wiz2v4", "score": "3", "subreddit": "CPTSD", "subreddit_id": "t5_2vvid"}, {"author": "LaCaspienne", "body": "All the time. I was always told I was too much, too dependent, too emotional, too intense, and I do feel things stronger than most people, whether it's enthusiasm or sadness, but I don't think it's a bad thing really. I feel human when I feel strongly like that. I actually live when I have emotions. I was on lithium for 2 years for misdiagnosed bipolar and it basically blunted my emotions a ton. I definitely prefer myself now, back to having my full palette back. It helps that now I'm better at identifying what I feel, which wasn't the case in the past.", "created_utc": "1659939595.0", "edited": "False", "id": "ijerusf", "is_submitter": "False", "link_id": "t3_wiveqc", "parent_id": "t3_wiveqc", "score": "9", "subreddit": "CPTSD", "subreddit_id": "t5_2vvid"}, {"author": "LaCaspienne", "body": "Yes... definitely. I always wished for my parents to punish me harshly or beat me, because I felt unhappy, but felt that I shouldn't be unhappy. As a teenager and still now as an adult I sometimes find myself wishing that, idk, someone really hurt me, someone beat me, because that would make my trauma more visible and valid.\n\nI would beat myself as a teenager. Whip myself with cables and all, slap, punch myself, cut. I rarely do it now but still feel urges to beat myself", "created_utc": "1659939376.0", "edited": "False", "id": "ijerjzr", "is_submitter": "False", "link_id": "t3_wipp60", "parent_id": "t3_wipp60", "score": "3", "subreddit": "CPTSD", "subreddit_id": "t5_2vvid"}, {"author": "LaCaspienne", "body": "I had the exact same. I was taught to believe that the outside world was bad, that I couldn't trust anyone, that I shouldn't pay importance to \"outsiders\" (aka, those who aren't family), that only my family would be there for me and love me unconditionally... except you know what happens. Emotional neglect, and all. I feel conned and I still feel mad about it.", "created_utc": "1659858968.0", "edited": "False", "id": "ijacl5j", "is_submitter": "False", "link_id": "t3_wi0y32", "parent_id": "t1_ij9wo0s", "score": "5", "subreddit": "CPTSD", "subreddit_id": "t5_2vvid"}, {"author": "LaCaspienne", "body": "Yes, definitely. Though I'm much better at expressing my different opinions regardless now, I still have to push myself to do it at times, and it still has a twinge of anxiety attached to it. I think that's because I wasn't really allowed to think otherwise as a child. I wasn't allowed to criticize or complain about them. Otherwise that'd be responses like \"oh so I'm a bad mother\", or \"then go on, find yourself another mommy\". Basically I've been guilted into fawning if that makes sense. \n\nIt's hard to get rid of this habit.", "created_utc": "1659858766.0", "edited": "False", "id": "ijaccd7", "is_submitter": "False", "link_id": "t3_whz07w", "parent_id": "t3_whz07w", "score": "6", "subreddit": "CPTSD", "subreddit_id": "t5_2vvid"}, {"author": "LaCaspienne", "body": "tbh, I have no idea who I'd put as my emergency contact", "created_utc": "1659723240.0", "edited": "False", "id": "ij328xt", "is_submitter": "False", "link_id": "t3_wgt985", "parent_id": "t3_wgt985", "score": "3", "subreddit": "CPTSD", "subreddit_id": "t5_2vvid"}, {"author": "LaCaspienne", "body": "I think people should think honestly and thoroughly before having kids.\nI'd not be against having kids, but my lifestyle (very busy with hobbies), I think, isn't compatible with kids. I'm too focused on my art and such to really take care of another human who is dependent on me. I could have a partner, a pet, but not a child. \n\nBesides, we're already way too many on this planet. Imo it's good to slow down a bit on the birth rates.", "created_utc": "1659700390.0", "edited": "False", "id": "ij1jdj1", "is_submitter": "False", "link_id": "t3_wgmad2", "parent_id": "t3_wgmad2", "score": "2", "subreddit": "CPTSD", "subreddit_id": "t5_2vvid"}, {"author": "LaCaspienne", "body": "Definitely, for years I thought I could only die by my own hands. I even planned to take my own life at 40. But now, not so much. I made a promise not to do it, even if I am in the worst possible situation. Of course, I regret that promise when I'm in the midst of a flashback, and in a way I still kinda feel annoyed about it because I certainly don't want to live 80 years in this world, but I don't deserve to destroy myself. I don't deserve to do this. I deserve to live. \n\nOne day I won't be annoyed by this anymore.", "created_utc": "1659694271.0", "edited": "False", "id": "ij1a58d", "is_submitter": "False", "link_id": "t3_wgesf5", "parent_id": "t3_wgesf5", "score": "1", "subreddit": "CPTSD", "subreddit_id": "t5_2vvid"}, {"author": "LaCaspienne", "body": "Hey, you know, a lot of people on Reddit are assholes. Anonymity is why. People know they basically can't be identified so they often unleash as much as their inner asshole as they can. Not to mention, if they're not trauma-informed, they're even less likely to be sensitive to traumatized people.\n\nIt's not your fault. And it's not manipulative to want others to like you! It's a very human thing to seek love and connection from others. It's not weak or pathetic to want comfort from others, either. If anything I find it pretty brave to ask others for comfort when we live in a culture where it's pretty much discouraged. You're good. Those people are either ignorant, assholes, or both. \n\nYou shouldn't isolate yourself at all. You deserve good connections. You deserve to heal. Relationships with others tremendously help with healing. The idea that you should isolate yourself until you're good enough is not only bullshit, it's also very harmful. Really, don't worry about it. You're good.", "created_utc": "1659646192.0", "edited": "False", "id": "iiyso4l", "is_submitter": "False", "link_id": "t3_wgb3zb", "parent_id": "t3_wgb3zb", "score": "166", "subreddit": "CPTSD", "subreddit_id": "t5_2vvid"}, {"author": "LaCaspienne", "body": "I used to, yeah. I still kinda do sometimes, especially when I've said something more vulnerable than the superficial stuff, but much less. Being left on read is often nothing personal though, sometimes the other person is just busy or forgot to reply (this happens to me a lot especially when I'm preoccupied with 39 things at once)", "created_utc": "1659635785.0", "edited": "False", "id": "iiy1epi", "is_submitter": "False", "link_id": "t3_wg7bs5", "parent_id": "t3_wg7bs5", "score": "4", "subreddit": "CPTSD", "subreddit_id": "t5_2vvid"}, {"author": "LaCaspienne", "body": "Existing alone, or alone with another person. Living online rather than offline, \"disappearing\" into the internet, being my real self there. Adapting myself to others whenever I have a different opinion. Never complimenting nor criticizing others, because both of them either have no effect (compliments) or can backfire (both, as I've been called creepy for complimenting others at times, and if I criticized my mother, oh boy would it backfire...). If there is a disagreement, going along with the other's truth and thinking \"well, maybe I'm crazy/wrong after all\", reverting back to the child who made herself small. Being terrified of the other suddenly turning on me for no apparent reason. Avoiding any contact with society at large, laying low. Being cold to other people, snarky, hateful, or just undemonstrative, when I know my real nature to be very warm and loving. Getting infatuated awfully easily and yet avoiding vulnerability. Imagining my future and planning it but once it actually comes to doing it, freezing up and getting so anxious I dissociate and am woken up by panic attacks at night. Hating life itself. Wishing I could just zap out, not necessarily die but just zap out of existence and into another plane. Doing the same routine everyday over and over because I don't want a remark on how I am doing things differently for once.\n\nA lot of what I described here has been mostly healed, but I still have work to do. I think I may be a freeze-flight type rather than freeze-fawn though. Or maybe freeze-fawn-flight... idk.", "created_utc": "1659561409.0", "edited": "False", "id": "iiu0fd0", "is_submitter": "False", "link_id": "t3_wfgk7l", "parent_id": "t3_wfgk7l", "score": "27", "subreddit": "CPTSD", "subreddit_id": "t5_2vvid"}, {"author": "LaCaspienne", "body": "Eh-sa-ü", "created_utc": "1659549240.0", "edited": "False", "id": "iit6txb", "is_submitter": "False", "link_id": "t3_wewrke", "parent_id": "t3_wewrke", "score": "3", "subreddit": "bindingofisaac", "subreddit_id": "t5_2sxpk"}, {"author": "LaCaspienne", "body": "Yes, you totally can. In fact I find they go hand in hand with each other. Hypervigilance is exhausting and then your brain just shuts down because it can't take any more stimuli. I find that I dissociate a ton more when I'm hypervigilant because I'm just completely overstimulated and this is the only way to shield myself from more threats in these situations. Sometimes it's just weird, like, I realize I've been walking further than I wanted to or took a different direction, or I'm standing in front of a door and haven't opened it, or just feel \"out of it\" and suddenly realize I'm still in a body, while I felt as if I kinda \"zapped out\" of reality. Can get pretty scary. \n\nPartly for this reason I stopped taking lithium (which actually was a good thing to stop, as it was hardly doing anything but emotionally blunting me), I was paranoid about dissociating and taking my pills twice accidentally. I'd have OCD like behaviours of checking the calendar/pillbox several times in a row. Lithium intoxication is awful and can literally destroy your organs. I didn't want that.", "created_utc": "1659510143.0", "edited": "False", "id": "iir3t6w", "is_submitter": "False", "link_id": "t3_wen2p0", "parent_id": "t3_wen2p0", "score": "2", "subreddit": "CPTSD", "subreddit_id": "t5_2vvid"}, {"author": "LaCaspienne", "body": "That blog post explains it all", "created_utc": "1659509220.0", "edited": "False", "id": "iir2l6s", "is_submitter": "False", "link_id": "t3_wegsux", "parent_id": "t1_iiofmra", "score": "1", "subreddit": "CPTSD", "subreddit_id": "t5_2vvid"}, {"author": "LaCaspienne", "body": "Kazakhstan!", "created_utc": "1659466343.0", "edited": "False", "id": "iiogy6r", "is_submitter": "True", "link_id": "t3_we994j", "parent_id": "t1_iiogecu", "score": "2", "subreddit": "CPTSD", "subreddit_id": "t5_2vvid"}, {"author": "LaCaspienne", "body": "That happens sometimes when I am in a flashback, though less and less.\n\nI used to be like this 24/7, and then, as I healed, it started to fade. What helped me was to accept my anger and confront that yes, I had been emotionally abused and neglected, that yes, my anger was entirely valid, and yes, that I had the right to feel it. I made a choice to own my rage. Then I could release it. I mostly did, although I'm not really at the end of the tunnel.\n\nI think the reason why it's so intense is because we don't let ourselves feel it. Anger issues are pretty common in people who have been discouraged from negative emotions tbh. Your mileage may vary of course, but I started really letting it go when I started allowing myself to be angry, and especially at people I love. I grew up with that weird idea that you can't love someone and be mad at them at the same time. When I was little and my parents yelled at me, I was terrified because I felt they didn't love me anymore, and for this reason it was pretty scary to own that I was sometimes angry at people's behaviour/words than at them as a person. Now I can make the distinction, with a bit of effort still. It takes time and patience to do so.", "created_utc": "1659464520.0", "edited": "False", "id": "iioc40x", "is_submitter": "False", "link_id": "t3_wegsux", "parent_id": "t3_wegsux", "score": "9", "subreddit": "CPTSD", "subreddit_id": "t5_2vvid"}, {"author": "LaCaspienne", "body": "URGH.\nJust URGH.\n\nWhat kind of friend does that?? You deserve much better than that. \nThe others there have said everything already. That's such a dick move.", "created_utc": "1659462331.0", "edited": "False", "id": "iio69c3", "is_submitter": "False", "link_id": "t3_we3m2x", "parent_id": "t3_we3m2x", "score": "2", "subreddit": "CPTSD", "subreddit_id": "t5_2vvid"}, {"author": "LaCaspienne", "body": "Thank you! Hey, maybe all hope is not lost. Right now travel may seem impossible to you, but possibly you'll get to do it sometime later. Sometimes it's just not the right time.\n\nThose were my savings actually lol, I have a bunch of them from those years being frozen at home, and was on disability for a while, so it piled up while I hardly did anything with them. I'm a bit scared of spending them though, ngl. I really hope I'll be able to do it.", "created_utc": "1659447859.0", "edited": "1659448321.0", "id": "iin4iod", "is_submitter": "True", "link_id": "t3_we994j", "parent_id": "t1_iimvw01", "score": "2", "subreddit": "CPTSD", "subreddit_id": "t5_2vvid"}, {"author": "LaCaspienne", "body": "This is exactly why I no longer want to have a good relationship with my parents or \"repair it\", like some people would tell me to do.\n\nI've seen a comment somewhere on this sub (or was it r/emotionalneglect ?) that a parent-child relationship is not like a delicate teacup, but more like one of these rubber snakes. Those things are literally indestructible unless you really, really want to break them. They had every fucking opportunity to heal this relationship for many years. Except they didn't.", "created_utc": "1659128412.0", "edited": "False", "id": "ii6efmg", "is_submitter": "False", "link_id": "t3_wbc55m", "parent_id": "t3_wbc55m", "score": "139", "subreddit": "CPTSD", "subreddit_id": "t5_2vvid"}, {"author": "LaCaspienne", "body": "I have it too. And I feel so ashamed of myself for it.", "created_utc": "1659085657.0", "edited": "False", "id": "ii3stpm", "is_submitter": "False", "link_id": "t3_wag62x", "parent_id": "t3_wag62x", "score": "3", "subreddit": "CPTSD", "subreddit_id": "t5_2vvid"}, {"author": "LaCaspienne", "body": "I don't have any memory of that, but for some reason your post ignited something in me. I think it might have happened to me when I was very little, little enough not to remember \"scenes\", but enough to remember feelings. It's especially awful with cars for some reason. Maybe I once acted up in a car and she threatened to abandon me on the side of the road or something. I don't recall. I just know that your post... kinda ignited a flame in me. I definitely have a feeling.\n\nI do have instances that are kind of related to that sort of situation though. I was once around age 6 told after complaining \"well go on, find yourself another mommy!\", I had another instance where I was 10, argued with my mother at the checkout of a store, and started walking away, and she said \"Yeah sure, go, there's a [perverted] man waiting for you at the entrance!\" (her main way of getting me to stay close to her was to say that there was an evil man [a pedo] who would kidnap me and take me away, basically)\n\nThough the biggest one is when I was 17 and attempting to heal, and criticized her in the car, asked her crying if 17 years earlier she ever thought about aborting me because I never felt welcome, and it fucking hell escalated, she stopped the car violently, screamed in rage, and threatened to leave me there to go to school by myself. She also apparently told me to stop torturing her. Apparently this day was when she had the awful thigh nerve pain, but I don't remember. I was incredibly dissociated around that time, and I feel that if it was indeed the day she was in pain, then it's my fault for having provoked that rage, and then it makes me the abuser, not the victim, and that terrifies me to think about. I just remember how I froze and cried and panicked, I was back to a little girl, maybe no older than 3-4, who was terrified of being abandoned on the side of the road, even if I could've got to school easily, I was used to go on foot.", "created_utc": "1659085517.0", "edited": "False", "id": "ii3snic", "is_submitter": "False", "link_id": "t3_wamvee", "parent_id": "t3_wamvee", "score": "2", "subreddit": "CPTSD", "subreddit_id": "t5_2vvid"}, {"author": "LaCaspienne", "body": "I was never given household chores as a kid. Never had to keep a tidy bedroom. However, when my mother did tidy it up, it always annoyed the fuck outta me how she just threw my toys nonchalantly in the drawer under the bed and then I couldn't find them anymore. But at the same time, I was afraid of stepping in, and possibly angering her, so I'd just sit there and feel the resentment boiling under my skin, while keeping my appearance of a sweet little kid.\n\nWhen I became a teenager she would let my room become a living hell of dust and mess and clean it once in a while when I wasn't there, instead of telling me to clean my room and show me how to do it. I would spend 6 months in the same bedsheets, ew. Had a ton of clutter, especially on my desk, to the point I hardly had any room to move my arms, probably some hoarding tendencies. When I was 17/18 and got into a dorm room it was absolutely gross, became the HQ for all cockroaches in the old roachey building, because not only I was too depressed/dissociated/much of an absolute mess to really take care of myself, I also never really learnt how to clean. Fun fact, now I'm pretty much clutter-free and my room is always clean. I change my sheets at least once a week now, and I actually love cleaning. However, I can't help but notice my slight hoarding tendencies returning when I'm under stress, mostly stationery, crystals or cosmetics.\n\nI was also not taught how to care for pets (my mother would give me small pets still... and recently she said how much she hated caring for them, how much of a chore it was, wtf why didn't you just refuse?? it sounded like a guilt trip of sorts, which bothered me), but I figured it out on my own. I had two mice I was the one and only caregiver for and I made a pretty good job. They always had a clean cage, food and water, and love. I try my best to care for my cats (that I've had since I was 12) now, I noticed she lets them get fat, and I'm trying to get them to lose weight now, at least the one who isn't sick with kidney issues.\n\nI was also never taught how to cook or do the dishes, but figured it out rather easily, though probably at a later age than most. I learned to braid my hair by myself around age 16 too. I wasn't taught how to do makeup because she never wore it and when I was little, she would say \"makeup is for ugly people\". \n\nBut for me the biggest thing was not being taught how to do administrative stuff. It's massively triggering for me and while I know I'll have to figure it out, I can't help but have this avoidance mechanism, and it doesn't help that the people who are supposed to give you info and help you are generally pretty rude on the phone.\n\n\nEdit: also, table manners. Suddenly had to learn them at age 10 by my father, and I was completely taken aback because nobody had taught me how to \"properly\" be in society.", "created_utc": "1659084178.0", "edited": "False", "id": "ii3r0c3", "is_submitter": "False", "link_id": "t3_wajbya", "parent_id": "t3_wajbya", "score": "1", "subreddit": "CPTSD", "subreddit_id": "t5_2vvid"}, {"author": "LaCaspienne", "body": "I freeze when I hear them. Literally.", "created_utc": "1659023424.0", "edited": "False", "id": "ii05f3g", "is_submitter": "False", "link_id": "t3_wa6zxx", "parent_id": "t3_wa6zxx", "score": "38", "subreddit": "CPTSD", "subreddit_id": "t5_2vvid"}, {"author": "LaCaspienne", "body": "A bully.", "created_utc": "1658948568.0", "edited": "False", "id": "ihw0yf1", "is_submitter": "False", "link_id": "t3_w9l27r", "parent_id": "t3_w9l27r", "score": "32", "subreddit": "CPTSD", "subreddit_id": "t5_2vvid"}, {"author": "LaCaspienne", "body": "This is such a pretty name. <3", "created_utc": "1658948384.0", "edited": "False", "id": "ihw0gqj", "is_submitter": "False", "link_id": "t3_w9japk", "parent_id": "t1_ihvjmqu", "score": "3", "subreddit": "CPTSD", "subreddit_id": "t5_2vvid"}, {"author": "LaCaspienne", "body": "Ah, definitely. The thing is, in my country it's hard as crap to change your name. It's not like in the US where you can do it pretty much freely. You have to have a \"valid reason\" according to the law, and this isn't one... besides, you need a ton of justifications that people use your new name in real life and have been for years and years, etc, and without having any irl friends, that's impossible for me. They will see my case and laugh at it I bet. My new name sounds probably too foreign as well. It's from a whole other culture, but I picked it because it fits me for real in meaning and helps me fit in this cultural bubble I'm getting into at the same time. The issue will come when I'll look for work. I'll have to use my \"real\" name, because people won't hire someone who goes by an alias (understandably due to some shady people) and just this thought triggers the fuck out of me. My birth name just keeps me chained to the past. It's like this girl is long dead and each time her name is pronounced, it's an attempt at reviving her, even if she's just a bunch of bones.\n\nI never liked my birth name. Ever since I was little it felt strange to me, like pricks on my skin. Thinking back of my parents calling me like that, I have a very unpleasant feeling in the gut. I quite literally psychologically cannot stand being called by that name. I think that's because I was never referred to affectionately by this name, or hardly. It was mostly to call me to do something, scold me, talk to me coldly and harshly... I associate it with harshness and obligation. A clear memory I have is my mother yelling this name and I don't remember specifically why, but I just remember the way she screamed it. The three syllables hitting one after the other, and I freeze. Funny enough, I have no issues with that name other than on myself, and it could've fit me perfectly if it was done right: it's old-fashioned and peaked in 1902, and I'm a sucker for anything old-fashioned. But no. The way it was used killed its potential. It's bad enough that it feels like an insult when I hear myself being called that way, and had nightmares where my parents still called me like that and I screamed and cried that it's not my name.\n\nI used my middle name for a while (I have three given names, common thing in Europe), but... it just feels bad and empty. It's not me. It reminds me of the extremely emotionally unstable girl I was between ages 17-20 years old. My family still calls me by that name, I haven't told them about my new one and I don't ever want to. My third, I tried to use it as a pen name when I tried to like my country and to write in my native language, but it didn't last. It's empty. \n\nThe name on my passport feels like it's the person I was forced to become, the person that they wanted me to be, not who I really am. I feel no connection to either side of the family whatsoever. Grew up isolated from them because my parents were paranoid about my dad's (cluster B) mother finding out about my existence and trying to see me, and I didn't see my extended family until I was 16 and my parents had divorced, but I was no longer a cute and lovable baby, I was a monstrous angry, depressed and spiteful teenager, so I pretty much hardly have any existence in there. I ended up meeting that granny anyway, but she died rather soon after, and already acted dubious with me (giving me extra money to pay for a guitar while my cousins only got a certain amount, hrrrmmm, not very honest indeed) on the first meeting. Yeah no thanks. I don't want to be associated to strangers.   \n\nThe one that is currently just a pen name (and the one I ask to be referred to when meeting new people on the internet) is my truest identity. The unfortunate thing is that I may have to change nationalities before making it official. I just wish, you know, that it was easy. If it was, I would've already changed it a long time ago.", "created_utc": "1658948358.0", "edited": "False", "id": "ihw0e7f", "is_submitter": "False", "link_id": "t3_w9japk", "parent_id": "t3_w9japk", "score": "5", "subreddit": "CPTSD", "subreddit_id": "t5_2vvid"}, {"author": "LaCaspienne", "body": "Oh yes, I would. Totally. \n\nI'd be careful not to overextend myself, though. I know that I'm very, very prone to overdoing it when it's about helping, because I just... I just wish I could fix people's issues and all, you know. But that's not healthy, and I cannot and shouldn't fix someone else.", "created_utc": "1658942795.0", "edited": "False", "id": "ihvljtf", "is_submitter": "False", "link_id": "t3_w9ecrb", "parent_id": "t3_w9ecrb", "score": "1", "subreddit": "CPTSD", "subreddit_id": "t5_2vvid"}, {"author": "LaCaspienne", "body": "I think I was already inclined to introversion, but trauma exacerbated this tendency. \n\nAs a kid I wasn't shy, I was pretty social, but not extroverted either. I was very much ok with playing alone, although it could get lonely at times, and generally had a couple friends at school, often one other girl with whom I'd be very close + a couple other people. Then with age I became more and more introverted. I became even a recluse, a phase of which I'm getting out gradually. I also had this thing of intensely attaching to one person, a lot like BPD and their favourite person, but now I don't anymore, which definitely makes me think I don't have BPD like I thought I did for many years.\n\nAs I heal I find myself becoming this social introvert again. Not extroverted enough to be ambivert, but not excessively introverted either. I stopped doing the evil eye in the street to deter people from approaching. I enjoy the company of the few ones I feel comfy with and that's way enough for me. I'm still shy when asking for stuff in shops, but I can hold short conversations with strangers rather fine. I think I just need to get out a bit more and I'll be back to normal.", "created_utc": "1658942180.0", "edited": "False", "id": "ihvjwtx", "is_submitter": "False", "link_id": "t3_w9f5w0", "parent_id": "t3_w9f5w0", "score": "2", "subreddit": "CPTSD", "subreddit_id": "t5_2vvid"}, {"author": "LaCaspienne", "body": "Can confirm. I'm barely starting to distinguish excitement vs anxiety.", "created_utc": "1658868469.0", "edited": "False", "id": "ihriy9b", "is_submitter": "False", "link_id": "t3_w8mwzy", "parent_id": "t1_ihqjbfw", "score": "6", "subreddit": "CPTSD", "subreddit_id": "t5_2vvid"}, {"author": "LaCaspienne", "body": "It's a fawn response. Very common in traumatized people. However as you heal, you will find a better balance, because you'll be more secure in yourself. When you've got a more solid base, you don't hold on for dear life to anything that gives you good feelings anymore. \n\nI'm a freeze-fawn type kinda and used to be like this, but as I heal, I find that I'm much less trusting, while still not being overly suspicious either. In the past I would get massively attached right away, and unfortunately attract a lot of not so great people (some of them weren't necessarily bad per se, but just quite unreliable and often very traumatized themselves and unhealed, so it would make up for some pretty toxic results like it can happen when two messes meet and make an even bigger one). Got retraumatized by some of them even. But it wasn't my fault. I was simply acting out of my older program and still very enmeshed with my mother emotionally.\n\nThen I became a complete recluse and pushed away any trust. I isolated. I was suspicious of everyone's motives. Damn even on the street I would purposely look angry as to deter people from interacting with me. It worked lmfao, but it's a bit of a shame. It was my coping mechanism at the moment though, and it worked. You may get a phase like this as well where you don't want new relationships or just cannot trust people. It's part of the process imo, the pendulum has to swing a bit before finding its balance.\n\nNow, as I heal more and more, I'm much more neutral about people. I can like someone at first and say \"ok, cool, if that develops into something deeper why not, if not, then I guess I'll just find someone else\" and not obsess like crazy over them like I did in the past. I noticed very recently also that I don't avoid eye contact like I used to, and don't do the evil eye anymore. I've found friends that I can trust, also, because I matured a fuck ton and I can finally open myself to healthier things. These people are mostly trauma survivors like me, birds of a feather flock together, but I'm able to keep reasonable boundaries with them. I see where they are in the path of healing: on certain points they are further than I am, but on others, they may be less healed. I help them, but I don't let their issues affect me anymore. I'm also much, much less sensitive to rejection. In the past I would get suicidal over being rejected. But it wasn't ridiculous, again, it was just my older program acting up. \n\nI went on a bit of a tangent, I'm sorry. But I want to show you how it could turn out for you as you get better. You'll probably have the swinging back phase, then a balance, but how long it takes depends on you. No trauma journey is identical. We all have our own pace of healing and there is no right or wrong way to do it. Just, you know, do as your gut feels.", "created_utc": "1658868410.0", "edited": "False", "id": "ihrisna", "is_submitter": "False", "link_id": "t3_w8mwzy", "parent_id": "t3_w8mwzy", "score": "3", "subreddit": "CPTSD", "subreddit_id": "t5_2vvid"}, {"author": "LaCaspienne", "body": "Hey, you're human too. You can't be perfect all the time, especially when you have been given a poor example at emotional maturity. The good thing is that you know that you've got these tendencies, and that you want to improve them. That's already immensely better than someone who wouldn't even acknowledge there is a problem, or worse, be aware of it yet not want to change.", "created_utc": "1658826280.0", "edited": "False", "id": "ihoybud", "is_submitter": "False", "link_id": "t3_w7thrv", "parent_id": "t1_ihnc53e", "score": "5", "subreddit": "emotionalneglect", "subreddit_id": "t5_2zgyv"}, {"author": "LaCaspienne", "body": "I like this metaphor. It's really fitting imo...", "created_utc": "1658826109.0", "edited": "False", "id": "ihoy4fm", "is_submitter": "False", "link_id": "t3_w85ps0", "parent_id": "t1_ihomfke", "score": "5", "subreddit": "emotionalneglect", "subreddit_id": "t5_2zgyv"}, {"author": "LaCaspienne", "body": "I'm not sure. I think I'd grieve the attachment but not the person. The \"love\" I feel towards my mother is rooted in guilt and responsibility rather than an actual affection (I even feel guilty as I type this because she did so much materially for me, yet I cannot feel any bit of actual love towards her, I'm not sure when it completely disappeared but I assume it was in my teens), and while I did love my father, I'd rather never communicate with him ever again because each time it fucks me up. He doesn't know me, but at the same time if he did, he would just use anything he learns about me for his own benefit. It also reminds me that he didn't care enough about me to include me in his new family, and that he just was never there when I truly needed him.", "created_utc": "1658826093.0", "edited": "False", "id": "ihoy3ox", "is_submitter": "False", "link_id": "t3_w85ps0", "parent_id": "t3_w85ps0", "score": "9", "subreddit": "emotionalneglect", "subreddit_id": "t5_2zgyv"}, {"author": "LaCaspienne", "body": "I actually had no idea that the original meaning of the phrase was changed. Now it does make sense indeed... more sense than the altered meaning.\n\nI'm glad I'm not alone in this. Thanks for your two cents, it already means a lot to me <3", "created_utc": "1658642605.0", "edited": "False", "id": "ihf1gm4", "is_submitter": "True", "link_id": "t3_w68y0y", "parent_id": "t1_ihebr9j", "score": "1", "subreddit": "CPTSD", "subreddit_id": "t5_2vvid"}, {"author": "LaCaspienne", "body": "Ok, right, let's assume the younger generations are fucked up...\n\n\n...but the real question that no one dares ask, the proverbial elephant in the room, is: who raised these kids? who fucked them up?", "created_utc": "1658597014.0", "edited": "False", "id": "ihcf2xl", "is_submitter": "False", "link_id": "t3_w68yud", "parent_id": "t3_w68yud", "score": "235", "subreddit": "CPTSD", "subreddit_id": "t5_2vvid"}, {"author": "LaCaspienne", "body": "I do, yeah. I try to use it as an advantage though. If I don't fit in anywhere, then I can go settle down just anywhere.", "created_utc": "1658592630.0", "edited": "False", "id": "ihc4t3f", "is_submitter": "False", "link_id": "t3_w61610", "parent_id": "t3_w61610", "score": "5", "subreddit": "CPTSD", "subreddit_id": "t5_2vvid"}, {"author": "LaCaspienne", "body": "I pretty much feel like the queen of bad decisions and every time I want to try something new or even just actually put something I wanted for a while into practice, I freeze. I just remember how humiliated I felt the last time I screwed up and I just... freeze at the idea of it happening again.", "created_utc": "1658556600.0", "edited": "False", "id": "ihaip6t", "is_submitter": "False", "link_id": "t3_w5jady", "parent_id": "t3_w5jady", "score": "3", "subreddit": "CPTSD", "subreddit_id": "t5_2vvid"}, {"author": "LaCaspienne", "body": "I had some fleeting feelings about it around age 17, that something wasn't normal and that I never felt love as a child, but when I confronted my mother, she shut me down with her defensiveness that escalated so fucking hard it made me freeze, and even today I still have trouble confronting her about anything. For years then I shut down completely about this, thought that it was just \"my illness\" (was misdiagnosed as bipolar at the age of 19), but after stopping meds and realizing the real issue was not biological, but traumatic, I entered a second round. I definitely realized it... only recently. I'm 22.", "created_utc": "1658475036.0", "edited": "False", "id": "ih5thd7", "is_submitter": "False", "link_id": "t3_w50118", "parent_id": "t3_w50118", "score": "9", "subreddit": "CPTSD", "subreddit_id": "t5_2vvid"}, {"author": "LaCaspienne", "body": "Yes. The minute the parents are there I'm terrified.\nAlso, I'm scared of being sick at other people's homes. Makes it hard to eat...", "created_utc": "1658383541.0", "edited": "False", "id": "ih0mluq", "is_submitter": "False", "link_id": "t3_w3xxlm", "parent_id": "t3_w3xxlm", "score": "3", "subreddit": "CPTSD", "subreddit_id": "t5_2vvid"}, {"author": "LaCaspienne", "body": "Tbh, I'm not always sure. I don't want to tell empty compliments. I hardly give compliments to people unless I really, really like them, which I think is an issue, because I hardly find anything noticeable to compliment about, or it's so trivial it feels empty.", "created_utc": "1658383122.0", "edited": "False", "id": "ih0m07b", "is_submitter": "False", "link_id": "t3_w3rlhx", "parent_id": "t1_igyp3f9", "score": "1", "subreddit": "CPTSD", "subreddit_id": "t5_2vvid"}, {"author": "LaCaspienne", "body": "I have the same. I literally crave compliments on my artistic work, but I'm always kinda confused by compliments on me as a person. I don't feel that interesting as a person, I just churn out stuff. And I have that same thing about feeling like you're tricking them or that they're naive. It doesn't help that often, people compliment me a fuck ton in the beginning, call me amazing and all that, and then kinda... well, once the novelty wears off, we kinda lose touch. I don't know if I accidentally provoke it or if they really lose interest because of themselves, but... let's say it doesn't really help. It feels like I'm only interesting on the surface, but once you dig a bit deeper, you can see that I'm just a massive imposter. Like a macaron: expensive, sweet, but mostly air. \n\nI'm learning to take people at their word though, even if it's hard and I feel like a proper narcissist every time I enjoy a compliment. I try to remember it's because I was raised to be ashamed, not because I am bad or corrupted.", "created_utc": "1658345736.0", "edited": "False", "id": "igygig3", "is_submitter": "False", "link_id": "t3_w3rlhx", "parent_id": "t3_w3rlhx", "score": "2", "subreddit": "CPTSD", "subreddit_id": "t5_2vvid"}, {"author": "LaCaspienne", "body": "I've done this ever since I was 8-10 years old and got my own computer. (and I think it was definitely a bad idea to give a computer to such a young child, but that's a story for another day). I would just browse the web, play browser games like howrse, and I still find myself doing it, especially when I'm stuck at home for a reason or another, or if I'm stuck in my room. I'm much less computer dependent when home alone, but the minute my mother is in the home, it's like I have to escape, escape, and disappear into this world of pixels.", "created_utc": "1658297120.0", "edited": "False", "id": "igvtxgi", "is_submitter": "False", "link_id": "t3_w30veq", "parent_id": "t3_w30veq", "score": "3", "subreddit": "CPTSD", "subreddit_id": "t5_2vvid"}, {"author": "LaCaspienne", "body": "\"all vegan from birth\"\nlmfao they never tried to feed a kid veggies, clearly. Kids generally hate veggies.", "created_utc": "1658257123.0", "edited": "False", "id": "igtcmxc", "is_submitter": "False", "link_id": "t3_w1xa1z", "parent_id": "t3_w1xa1z", "score": "2", "subreddit": "exvegans", "subreddit_id": "t5_109235"}, {"author": "LaCaspienne", "body": "I like his ex-vegans interviews but that's really all. The guy is way too extreme for my taste otherwise.", "created_utc": "1658256738.0", "edited": "False", "id": "igtbm7s", "is_submitter": "False", "link_id": "t3_w1oeme", "parent_id": "t3_w1oeme", "score": "1", "subreddit": "exvegans", "subreddit_id": "t5_109235"}, {"author": "LaCaspienne", "body": "> Once the hour was up, see you in 2 weeks/a month. Fuck no.\n\nThis one hit particularly hard. It just feels like... you're just a number, an object of sorts.\nThat was also why I stopped seeing my psychiatrist: it was just for meds (lithium) that didn't solve the real shit, just made me emotionally blunted, made me paranoid about overdosing because the poisoning one is a particularly violent one, and nothing otherwise was working. I didn't trust her, so didn't tell her what I was going through. I would just forget everything when I was in her office. \n\nI realize it's probably not a psychiatrist I needed, but a psychologist.", "created_utc": "1658254337.0", "edited": "False", "id": "igt55t0", "is_submitter": "False", "link_id": "t3_w2l8xr", "parent_id": "t3_w2l8xr", "score": "2", "subreddit": "CPTSD", "subreddit_id": "t5_2vvid"}, {"author": "LaCaspienne", "body": "Less and less often since I've started actively healing, but still... a lot. Mostly hits me when I'm tired or stressed. I still know I have a lot of repressed anger to get out. But tbh, I'm getting better and better as I heal my trauma.", "created_utc": "1658254244.0", "edited": "False", "id": "igt4wu7", "is_submitter": "False", "link_id": "t3_w2wm6k", "parent_id": "t3_w2wm6k", "score": "5", "subreddit": "CPTSD", "subreddit_id": "t5_2vvid"}, {"author": "LaCaspienne", "body": "I wish there was a super upvote for this. Thank you.", "created_utc": "1658254173.0", "edited": "False", "id": "igt4q4c", "is_submitter": "False", "link_id": "t3_w2vni0", "parent_id": "t3_w2vni0", "score": "7", "subreddit": "CPTSD", "subreddit_id": "t5_2vvid"}, {"author": "LaCaspienne", "body": "As a child I extremely badly wanted to grow up because I thought people would listen to me if I was grown up. I would pretend to be older on the internet, I was 8 pretending to be 12 or 13. I was also often mistaken for older than I really was by people who saw me. Like you, mature for my age... it lasted up until I was about 18/19, people always thought I was older.\n \nNow people seem to think I'm younger. I'm 22 and I've been mistaken for a 16 year old, and it's not even in the way I dress, my fashion sense isn't at all like what you see in 16 year olds, but, idk, my face? Or my vibe?   \n\nIt's so odd.", "created_utc": "1658249219.0", "edited": "False", "id": "igsrdet", "is_submitter": "False", "link_id": "t3_w2sfnq", "parent_id": "t3_w2sfnq", "score": "7", "subreddit": "CPTSD", "subreddit_id": "t5_2vvid"}, {"author": "LaCaspienne", "body": "Yelling, snide comments, comments that may or may not be innocent but that I sense have a twinge of \"unpleasant implications\", invalidation, actions not matching words (big one), gaslighting, betrayal, invalidation, being met with indifference when I'm sharing enthusiastically (which unfortunately has happened a lot), rude people on the phone or at services, slamming doors, broken plates in the sink, lies... many things.", "created_utc": "1658211517.0", "edited": "False", "id": "igqv1kq", "is_submitter": "False", "link_id": "t3_w2fb55", "parent_id": "t3_w2fb55", "score": "18", "subreddit": "CPTSD", "subreddit_id": "t5_2vvid"}, {"author": "LaCaspienne", "body": "I was afraid of it, but tbh, I'm not sure I'll even have children. I'm not sure my goals and general way of living are very compatible with having a child. And now that I'm healing, it's easier to say \"no, I won't be like them\" because I'm self-aware and I am more and more self-aware as time passes.", "created_utc": "1658211325.0", "edited": "False", "id": "igqurvd", "is_submitter": "False", "link_id": "t3_w2c3k5", "parent_id": "t3_w2c3k5", "score": "1", "subreddit": "CPTSD", "subreddit_id": "t5_2vvid"}, {"author": "LaCaspienne", "body": "Mother: \"And you did the dishes! Wow, I like it. I like it when you participate.\"\n\n...Yeah, because I apparently never do shit? Who cooks dinner most of the time during weekdays? Who walks to the store to buy groceries? Who does laundry when the basket is full and it's a weekday? Who irons clothes afterwards? \n\nIt sounded innocent and maybe was, but for some reason this... annoyed me.", "created_utc": "1658173315.0", "edited": "False", "id": "igol0mz", "is_submitter": "False", "link_id": "t3_vzjzec", "parent_id": "t3_vzjzec", "score": "4", "subreddit": "CPTSD", "subreddit_id": "t5_2vvid"}, {"author": "LaCaspienne", "body": "Ooof, that was quite an emotional read. I empathize with you, OP. I had a similar teenage years, except as a queer woman. The inferiority, pushing people away, not dating, loneliness... I attempted to confront my mother about things but just ended up retreating again because of how horribly she reacted to it. Now that I'm on my 2nd or 3rd round of attempting to heal, I'm acting quite emotionally detached to her (I think that's called grey rocking?) and she's back to implying I'm a lazy ungrateful sociopath who \"misses her target\" (the supposed correct target being my father, not her), \"redirects her aggression on the wrong person\", and doesn't care about hurting others except my little sisters (who are very young and aren't involved with the abuse due to age gap).\n\nI cannot tell you when you'll be done with the awful, because I'm not you, and I'm also not sure you can control it. As you said, you held back a lot, and the more you held back, the more water there was in your floodgates, the worse it is when it comes out. That stuff rotted in you for almost two decades. It's only normal that it will take a long time to heal. Besides, the people who abused you typically will never admit their faults, so it can be really hard to be at peace with them. But it's not your fault still. You didn't ask for any of that, nor did you deserve it. \n\nAnd it IS tiring. It's like when you vomit out poison multiple times. Vomiting is tiring. Purging is tiring. But in the end, you have this poison taken off yourself. It's not an easy road, it may be longer than you like, but... you know, you can be proud of yourself still. You're breaking a possible cycle of abuse. Your mother may have been abused/neglected as well. Unfortunately, there is often an intergenerational pattern of abuse in families. It's a cycle that repeats until someone says \"stop\" and does the work to stop it. And you are the one to break this chain. Just for acknowledging it and wanting to do better, you're already much, much more deserving of pride than anyone who never does the work.", "created_utc": "1658168685.0", "edited": "False", "id": "igo9aru", "is_submitter": "False", "link_id": "t3_w25t3y", "parent_id": "t3_w25t3y", "score": "3", "subreddit": "CPTSD", "subreddit_id": "t5_2vvid"}, {"author": "LaCaspienne", "body": "I think it can. I think any relationship can cause trauma, whether it's family, friends, or romantic. If you have trauma in the first place it can and will definitely worsen it, because it just adds another layer. \n\nIt's still valid regardless. Trauma is trauma, regardless of who it comes from.", "created_utc": "1658167410.0", "edited": "False", "id": "igo63d0", "is_submitter": "False", "link_id": "t3_w245h1", "parent_id": "t3_w245h1", "score": "5", "subreddit": "CPTSD", "subreddit_id": "t5_2vvid"}, {"author": "LaCaspienne", "body": "You were a child. A suicidal child is straight up abnormal. It's a sign that the parents are REALLY fucking up. To take off a child's will to live is literally impossible unless you really want it, almost.\n\nYou coped in the best way you could, even if it was awful. They don't want to face their misdeeds, that's why they want you to be embarrassed. It's easier on their conscience, even if it's horrible. \n\nAnd it's totally valid for you to feel betrayal and grief. No child should ever have to go through that. Ever.", "created_utc": "1658167166.0", "edited": "False", "id": "igo5h02", "is_submitter": "False", "link_id": "t3_w24e35", "parent_id": "t3_w24e35", "score": "31", "subreddit": "CPTSD", "subreddit_id": "t5_2vvid"}, {"author": "LaCaspienne", "body": "I think I'm going to try the first you suggested. I'm not really a fan of swimming pools tbh. Thank you for the tip!", "created_utc": "1658153767.0", "edited": "False", "id": "ign8367", "is_submitter": "True", "link_id": "t3_w1zwhm", "parent_id": "t1_ign7axp", "score": "3", "subreddit": "CPTSD", "subreddit_id": "t5_2vvid"}, {"author": "LaCaspienne", "body": "> It's the attachment bit that makes a world of difference. I cannot describe the relief it brings. I feel like I have been half starved for oxygen my whole life, and she put an oxygen mask on me. Now, she's showing me how to manage my oxygen needs.\n\nDude, I just wrote a whole post about breathing, in which I mention a strange-ish obsession with breathing aids like intubation/oxygen masks/cannulas... and I see your message now. I definitely can relate to feeling like you've been oxygen-starved all your life. It's insane.", "created_utc": "1658152643.0", "edited": "False", "id": "ign5jz1", "is_submitter": "False", "link_id": "t3_w1c9dw", "parent_id": "t1_igjwdne", "score": "5", "subreddit": "CPTSD", "subreddit_id": "t5_2vvid"}, {"author": "LaCaspienne", "body": "What kind of deranged parent does that??", "created_utc": "1658150335.0", "edited": "False", "id": "ign0lk8", "is_submitter": "False", "link_id": "t3_w1srfk", "parent_id": "t3_w1srfk", "score": "2", "subreddit": "CPTSD", "subreddit_id": "t5_2vvid"}, {"author": "LaCaspienne", "body": "Right now I only have internet friends, but once I'm better and get out of my shell, I want to go back to making rl friends as well. I think I'll be better equipped to weed out the bad ones.", "created_utc": "1658075515.0", "edited": "False", "id": "igj7ztc", "is_submitter": "False", "link_id": "t3_w19vc1", "parent_id": "t3_w19vc1", "score": "12", "subreddit": "CPTSD", "subreddit_id": "t5_2vvid"}, {"author": "LaCaspienne", "body": "I'm glad it helped you as well. This book is truly a blessing. I had the exact same... the book literally read me.\n\nIt's true, I should crosspost it. Thanks for the suggestion!", "created_utc": "1658068984.0", "edited": "False", "id": "igitik5", "is_submitter": "True", "link_id": "t3_w0mrck", "parent_id": "t1_igim32w", "score": "3", "subreddit": "CPTSD", "subreddit_id": "t5_2vvid"}, {"author": "LaCaspienne", "body": "If you're not sure, don't force yourself. You may just not be ready for it. It's not, like, the Bible of CPTSD, and some other books may resonate better with you.", "created_utc": "1658060607.0", "edited": "False", "id": "igiduec", "is_submitter": "True", "link_id": "t3_w0mrck", "parent_id": "t1_igicb0r", "score": "5", "subreddit": "CPTSD", "subreddit_id": "t5_2vvid"}, {"author": "LaCaspienne", "body": "Typical gaslighting here...\nThe point of that practice is that they want to cloud your judgement and make you feel crazy so you don't trust yourself and depend on their own view, and it's unfortunately a very common thing in abusive relationships (whether with family, friends, romantic partners, any relationship). If you cannot trust your own judgement, you end up shutting down, and if you're shut down and go along with their narrative, you cannot expose the truth about them and evoke unpleasant feelings, or just make them look at their responsibility in the matter. \n\nYou're not the toxic one. No child who truly had a happy childhood (as if, secure, good relationships with parents and siblings, being listened to, being mirrored, attuned to, well taken-care of, everything that should happen in a normal and happy family) finds themselves with such issues in adulthood. They don't grow up to be toxic, or with poor self-esteem: they grow up to be happy, healthy, and positive. You're not toxic at all. You're reacting normally to something really, really abnormal. \n\nThey tell you to get over it, because they don't want to acknowledge their responsibility. Again, that's a very common thing.", "created_utc": "1658058837.0", "edited": "False", "id": "igib7id", "is_submitter": "False", "link_id": "t3_w0zv8j", "parent_id": "t3_w0zv8j", "score": "8", "subreddit": "CPTSD", "subreddit_id": "t5_2vvid"}, {"author": "LaCaspienne", "body": "I think EI and abuse nearly always, if not always, go hand in hand. No one emotionally mature would abuse someone I think.", "created_utc": "1658040693.0", "edited": "False", "id": "ighozzw", "is_submitter": "True", "link_id": "t3_w0mrck", "parent_id": "t1_igg35zq", "score": "7", "subreddit": "CPTSD", "subreddit_id": "t5_2vvid"}, {"author": "LaCaspienne", "body": "Wish I could give you a big hug...", "created_utc": "1658040665.0", "edited": "False", "id": "ighoyov", "is_submitter": "True", "link_id": "t3_w0mrck", "parent_id": "t1_igh83d5", "score": "6", "subreddit": "CPTSD", "subreddit_id": "t5_2vvid"}, {"author": "LaCaspienne", "body": "I don't think you've been harsh tbh. I'm going to let that sink in for a bit and maybe DM you later when I've got a bit more strength to reply or just ask questions. (btw, no, I'm not from the US, I'm from France)\n\nI wouldn't be going with an accredited program, it would be through Workaway. \n\nI'm planning to go on a trip there already to kinda get in the vibe, visit my friend, and just enjoy time by myself. I don't think I can properly heal being stuck at my mother's home, who is the very person that was the main reason for my trauma.", "created_utc": "1657981621.0", "edited": "False", "id": "igecbfy", "is_submitter": "True", "link_id": "t3_vzwkzq", "parent_id": "t1_ige9w4y", "score": "3", "subreddit": "CPTSD", "subreddit_id": "t5_2vvid"}, {"author": "LaCaspienne", "body": "CPTSD and BPD have a lot of overlapping symptoms tbh, I went through the same. I can clearly say I don't have BPD at all now (I don't \"split\" anymore like I did as a teenager, my sense of identity is solid, I'm much less impulsive than I used to be), but I thought I had it for a long, long time.\n\nAlso, if you are sleep-deprived, eat junk and are too stressed, it can literally make you go insane. Labile moods associated with it can easily look like BPD. Teenage hormones and angst also add to the mix. I think many young adults diagnosed with BPD are actually suffering from CPTSD.", "created_utc": "1657913768.0", "edited": "False", "id": "igaxus5", "is_submitter": "False", "link_id": "t3_vzw3gt", "parent_id": "t3_vzw3gt", "score": "7", "subreddit": "CPTSD", "subreddit_id": "t5_2vvid"}, {"author": "LaCaspienne", "body": "I feel this to my goddamn core, because of how much I can empathize, because I'm going through something very similar right now. Resisting the urge to.. you know. \n\nI don't know if this will be of any help, but I'm in awe. You are suffering through hell and you can still tell yourself that you refuse to overdose. It takes tremendous amounts of strength not to give in, especially when you're breaking down like that. It's horrifying to think the world is so awfully unwilling to help that we have to resort to harming ourselves just, literally just to say \"hey, please help me!\".\n\nYou're nowhere near an awful person. Suffering drives us mad...", "created_utc": "1657795874.0", "edited": "False", "id": "ig4169i", "is_submitter": "False", "link_id": "t3_vykeyx", "parent_id": "t3_vykeyx", "score": "9", "subreddit": "CPTSD", "subreddit_id": "t5_2vvid"}, {"author": "LaCaspienne", "body": "This resonated so much. I would talk enthusiastically about my hobbies, about my internal world, even about my horses on howrse or my sims, and my mother would half-listen to me, just go \"hm hm, ok\", and it would throw cold water on my enthusiasm. My father on the other hand reused the damn thing at every damn occasion he could. I loved a song? Sing it everywhere. I like something? Find me every single thing linked with it. Now I cannot think of ever listening to that spice girls song anymore when I used to love it as a kid. It was humiliating.\n\nSo now I just don't bother talking to them anymore and even hide everything that makes me happy, as much as I can. Makes me sick when brother says \"I'm sure mum would love to know what you're writing\" tf, no way I'm sharing that with her, ever. I write in another language anyway", "created_utc": "1657778670.0", "edited": "False", "id": "ig3ffhk", "is_submitter": "False", "link_id": "t3_vyb19q", "parent_id": "t1_ig25qg1", "score": "7", "subreddit": "CPTSD", "subreddit_id": "t5_2vvid"}, {"author": "LaCaspienne", "body": ">  its a small thing.\n\nHell no it's not a small thing. It literally ruined your spirit. This is no small thing.", "created_utc": "1657743714.0", "edited": "False", "id": "ig1d441", "is_submitter": "False", "link_id": "t3_vyb19q", "parent_id": "t3_vyb19q", "score": "103", "subreddit": "CPTSD", "subreddit_id": "t5_2vvid"}, {"author": "LaCaspienne", "body": "It makes me scared that the other person may be planning on using it against me later...", "created_utc": "1657732368.0", "edited": "False", "id": "ig0jtxj", "is_submitter": "False", "link_id": "t3_vy6ft6", "parent_id": "t3_vy6ft6", "score": "13", "subreddit": "CPTSD", "subreddit_id": "t5_2vvid"}, {"author": "LaCaspienne", "body": "I dropped out of college 4 years ago, the awful friendships I had there re-traumatized me and my sleep cycle was too fucked to really do anything academically. I wanted to find a job, but couldn't. Now I've been a neet for 4 years and despite wanting to get back out there, I'm still freezing. Being a shut-in worked for the past 4 years, but not anymore... and I want 2022 to be the year I get out. I have a feeling life isn't actually that hard, but I've been so traumatized in the past that I'm literally holding myself back, and I hate myself so bad for it.\n\nI so badly want to have a normal life, socialize again, and move out, immigrate to a new country, but I just freeze. I know I'll manage to get out at some point though. I have urges of taking a train to someplace I've never been with just a big suitcase, my instrument and maybe one of my cats, so I can move out, go NC or LC, and finally get out of that frozen state, but I'm too much of a chicken to follow through. I want to go on a trip to that country I want to immigrate to, but buying the tickets and spending so much money gives me SO MUCH anxiety. \n\nAnd I feel that when I do it, I may enter a phase where everything goes very fast. And I'm a wee bit scared of it. I won't be done with challenges and healing my trauma for sure (\"wherever you go, there you are\"), but... damn, I just am so sick of being a neet, being stuck in that rut, and not having anyone to talk to. I'm starting to really hate everything around me, and maybe the resulting anger will make the cork thing go off the champagne bottle, so to speak.\n\nOne thing is sure, once I have moved out and have a better social life, my laptop will rot in a drawer or a bag for a while, except maybe for writing, watching a movie, or listening to music. I cannot stand the idea of spending my life online anymore. I've been addicted to computers since I was 8-10 years old.", "created_utc": "1657730768.0", "edited": "False", "id": "ig0fmb5", "is_submitter": "False", "link_id": "t3_vy7euz", "parent_id": "t3_vy7euz", "score": "8", "subreddit": "CPTSD", "subreddit_id": "t5_2vvid"}, {"author": "LaCaspienne", "body": "I was too disconnected from my body to really hate it tbh... I didn't really care about it, I fed it a shit ton of sugar (like pretty much all teens do I guess), mistreated it by depriving it of sleep and food until I would feel physically weak (probably how I never got fat, I walked to school a lot too), and just thought of myself as ugly and undesirable. I walked with a very aggressive posture, shoulders forward, angry look. Now I carry myself normal, but still cannot really prevent myself from doing the evil eyes. It's either this or the thousand yard stare. Good thing is, at least it deters the annoying fuckers from catcalling me. \n\nI didn't start really thinking about my body until I was about 20-21. I found that... well, masturbating in front of a mirror really helped. It's weird as fuck but it's actually very interesting to observe yourself like that, and it helps connecting with your body. Now I quite like it and feed it what it needs (nutrients, no more junk food, and sleep), and recently stopped wearing foundation to let my skin rest. I still have issues with slowing down though, because staying busy is an escape. I find myself actually beautiful now, a discreet kind of beauty. A friend of mine told me that I have a pure heart and that it's literally visible in how I look and behave. I guess I'll take her word, even if I think she says it because I know her and feel comfortable with her, so I don't have the barriers or dissociative look.", "created_utc": "1657730373.0", "edited": "False", "id": "ig0ekuq", "is_submitter": "False", "link_id": "t3_vy6k7r", "parent_id": "t3_vy6k7r", "score": "16", "subreddit": "CPTSD", "subreddit_id": "t5_2vvid"}, {"author": "LaCaspienne", "body": "I always was, yeah. I researched the fuck out of everything as a kid and now I still kinda do. But looking at the other comment in there, it... yeah, it's indeed a coping strategy. It's a form of hoarding maybe. An escape.", "created_utc": "1657729107.0", "edited": "False", "id": "ig0ba4q", "is_submitter": "False", "link_id": "t3_vy2n1y", "parent_id": "t3_vy2n1y", "score": "3", "subreddit": "CPTSD", "subreddit_id": "t5_2vvid"}, {"author": "LaCaspienne", "body": "Thanks, I'mma check this!", "created_utc": "1657644575.0", "edited": "False", "id": "ifvlc9j", "is_submitter": "True", "link_id": "t3_vxesh8", "parent_id": "t1_ifviwcc", "score": "1", "subreddit": "CPTSD", "subreddit_id": "t5_2vvid"}, {"author": "LaCaspienne", "body": "Toxic positivity at its finest", "created_utc": "1657642223.0", "edited": "False", "id": "ifvf95x", "is_submitter": "False", "link_id": "t3_vxc0h5", "parent_id": "t3_vxc0h5", "score": "5", "subreddit": "CPTSD", "subreddit_id": "t5_2vvid"}, {"author": "LaCaspienne", "body": "I'm myopic, but it seems to improve as I get older. Started getting it at the age of 8, and I think not being much allowed to play outside + lots of screen time already for a 8 year old + stress made my eyesight suffer. I must've started around -2. I recall it was quite sudden too. Now my myopia is almost slight enough not to wear glasses anymore (left 0,50, right 0,75), and I think that if I manage to get outta here and spend more time outside, not to mention the inner healing, I could fix the issue completely.\n\nI've read somewhere that eye issues's metaphysical cause is a fear of the future, especially myopia, and that strabismus is due to an issue with one of the parent. Convergent meaning being overly focused on that parent, and divergent wanting to get away from the parent. Not sure if it was the exact thing, but I think our physical issues are quite often explained by emotional ones.", "created_utc": "1657609326.0", "edited": "False", "id": "iftu92b", "is_submitter": "False", "link_id": "t3_vx1r66", "parent_id": "t3_vx1r66", "score": "1", "subreddit": "CPTSD", "subreddit_id": "t5_2vvid"}, {"author": "LaCaspienne", "body": "I do, yes. I am sort of territorial as well, and I noticed I snap extremely easily now.\n\nI think it was last year, but I once snapped at my mother because I was cooking myself a fried egg, and she came and flipped it like she would do with hers without asking me if I was ok with it (which, I think in retrospect, was already an intrusion on boundaries), but I never cook fried eggs this way, and for some reason it made me literally **snap**, I said a loud \"NO, this is NOT how I do it!!\" or something of that sort. And then she made her typical sad face that just infuriates the fuck out of me and wouldn't reply to me when I tried to apologize, and then I felt horrid guilt, as if I was an abuser. I can't stand that face or when she cries for any reason. It just makes me insanely aggressive, maybe because I wasn't allowed to be emotional.\n\nI'm careful about blowing up like that now, even when she says or do things that make me tense up and put my hand into a fist, because I feel that each time I snap, it's extra ammo to consider me \"bipolar\" (the general view of bipolar here is closer to borderline tbh), or \"mentally ill\".", "created_utc": "1657607595.0", "edited": "1657607857.0", "id": "ifts0iv", "is_submitter": "False", "link_id": "t3_vwtc15", "parent_id": "t3_vwtc15", "score": "12", "subreddit": "CPTSD", "subreddit_id": "t5_2vvid"}, {"author": "LaCaspienne", "body": "As a kid I played with LPS a lot. Around age 8 I once got a set of two bobtail dogs, one that I named after myself, and the other after my best friend at the time. I would make up a story in which my parents had died and I had been adopted by my friend's family. Didn't realize how much of a sign it was at the time. I recall overhearing my parents talking about it but they never tried to figure out why I was doing that, or never even tried to ask me why I felt so unhappy that I basically wanted to be part of my friend's family.", "created_utc": "1657531450.0", "edited": "False", "id": "ifpasra", "is_submitter": "False", "link_id": "t3_vwavy0", "parent_id": "t3_vwavy0", "score": "2", "subreddit": "CPTSD", "subreddit_id": "t5_2vvid"}, {"author": "LaCaspienne", "body": "They can and should fucking fuck off.", "created_utc": "1657531206.0", "edited": "False", "id": "ifpaik3", "is_submitter": "False", "link_id": "t3_vwcuc0", "parent_id": "t3_vwcuc0", "score": "26", "subreddit": "CPTSD", "subreddit_id": "t5_2vvid"}, {"author": "LaCaspienne", "body": "I am one, but I want to get out. I just feel so stuck. The thing is, I hate the place I live in (been forced to live there for a decade now, tried to escape twice and it failed each time, had to move back in with my mother) and I don't want to make any connections there whatsoever. But I have no degree and no experience, and I'm afraid that, you know, it makes basic life out of reach. I barely graduated high school (could've done much better if I hadn't been depressed, sleep-deprived, and if school actually mattered), dropped out of college for the same reason, and now have been vegetating in my room for 4 years. I want to get out and immigrate to a new country... but I'm afraid I'm not good enough for that. That no one will want to hire me because I'm a worthless foreigner. Now I just learn languages on my own, write, draw, and do the housework.", "created_utc": "1657519837.0", "edited": "False", "id": "ifowj1u", "is_submitter": "False", "link_id": "t3_vwag2x", "parent_id": "t3_vwag2x", "score": "10", "subreddit": "CPTSD", "subreddit_id": "t5_2vvid"}, {"author": "LaCaspienne", "body": "Oh, thank you! It's not the kind of stuff I'd usually watch, but it made me smile when I saw the channel. I think I'm going to comfort myself a bit with these videos when I need to.", "created_utc": "1657477405.0", "edited": "False", "id": "ifmhs6x", "is_submitter": "True", "link_id": "t3_vvlhtk", "parent_id": "t1_iflye19", "score": "3", "subreddit": "CPTSD", "subreddit_id": "t5_2vvid"}, {"author": "LaCaspienne", "body": "What do you got? I don't know if it will really help, but I'm willing to at least take a look", "created_utc": "1657467921.0", "edited": "False", "id": "iflvnl5", "is_submitter": "True", "link_id": "t3_vvlhtk", "parent_id": "t1_ifln962", "score": "4", "subreddit": "CPTSD", "subreddit_id": "t5_2vvid"}, {"author": "LaCaspienne", "body": "I think it's probably related to sleep. The hotter it is, the worse you sleep, and lack of sleep can make you really insane. Plus not going outside because it's too hot, not doing much because whatever you do makes you sweat, it can really wreak havoc on the psyche.", "created_utc": "1657450534.0", "edited": "False", "id": "ifkzf09", "is_submitter": "False", "link_id": "t3_vvodp0", "parent_id": "t3_vvodp0", "score": "12", "subreddit": "CPTSD", "subreddit_id": "t5_2vvid"}, {"author": "LaCaspienne", "body": "Kind of, yeah. I feel like I am kind of culturally blank, or rather, that I developed my own inner culture. But on the plus side, it will probably make assimilation in another country easier.", "created_utc": "1657450459.0", "edited": "False", "id": "ifkzblg", "is_submitter": "False", "link_id": "t3_vvo65f", "parent_id": "t3_vvo65f", "score": "6", "subreddit": "CPTSD", "subreddit_id": "t5_2vvid"}, {"author": "LaCaspienne", "body": "It's not really about \"wanting things to fall into your lap\" for real, but more like, freezing and just reverting back to a dependent state, even when you know you can and should do better. The freeze is a nightmare", "created_utc": "1657435408.0", "edited": "False", "id": "ifkhcly", "is_submitter": "True", "link_id": "t3_vvlhtk", "parent_id": "t1_ifkh2az", "score": "16", "subreddit": "CPTSD", "subreddit_id": "t5_2vvid"}, {"author": "LaCaspienne", "body": "It IS valid. Trauma is trauma. It doesn't matter if you're drowning in 3 or 10 feet of water, you're still drowning regardless.", "created_utc": "1657396714.0", "edited": "False", "id": "ififphv", "is_submitter": "False", "link_id": "t3_vv9cn9", "parent_id": "t3_vv9cn9", "score": "5", "subreddit": "CPTSD", "subreddit_id": "t5_2vvid"}, {"author": "LaCaspienne", "body": "It's very common among us survivors to have issues with our names tbh. I have the exact same issue, picked a different one but unfortunately cannot make it official yet (don't think my reason is a \"valid\" one in my country). If you can change it officially, do it, really. If you can't, at least you can pick a different one to be referred to by.", "created_utc": "1657365400.0", "edited": "False", "id": "ifgmrdc", "is_submitter": "False", "link_id": "t3_vunk1w", "parent_id": "t3_vunk1w", "score": "3", "subreddit": "CPTSD", "subreddit_id": "t5_2vvid"}, {"author": "LaCaspienne", "body": "Yeah, I've always done it. Now I'd like to have better shaped nails, even if I won't wear them long, but I have no idea. I tend to neglect my fingernails, don't cut them until they hurt me. Bad habit. I started taking care more of them after getting fungus on a big toenail, but still... it's hard for me to really care about them. \n\nTbh the nail talk makes me think back of my father. \"Don't bite your nails!\" while slightly tapping my hand. \"Don't bite your fingers!\". Spoiler: I don't bite my nails anymore because of the concern of bacteria that are under, but I bite the cuticles and pick at them with my fingers still. \n\nOnce he showed me pictures of severely bitten nails because he wanted to make me stop, the very gross gorey stuff. I was 8. It didn't make me stop.", "created_utc": "1657358312.0", "edited": "False", "id": "ifge3mx", "is_submitter": "False", "link_id": "t3_vuru1e", "parent_id": "t3_vuru1e", "score": "1", "subreddit": "CPTSD", "subreddit_id": "t5_2vvid"}, {"author": "LaCaspienne", "body": "Hey, don't blame yourself. Many therapists aren't trauma-informed, unfortunately, and good therapists are a hard thing to find. It's not your fault. The system is fucked.", "created_utc": "1657313282.0", "edited": "False", "id": "ife4t9q", "is_submitter": "False", "link_id": "t3_vu4rno", "parent_id": "t3_vu4rno", "score": "2", "subreddit": "CPTSD", "subreddit_id": "t5_2vvid"}, {"author": "LaCaspienne", "body": "All of us here know what it's like to feel alone... in a way that's good (blergh, bad wording), because we empathize more readily and can support others, but yeah, on the other hand, it's so sad we are so many to have endured this and to feel that way. 💔\n\nDon't overextend yourself though, even if you want to help others. Remember you also have to take care of yourself.", "created_utc": "1657312884.0", "edited": "False", "id": "ife3tr7", "is_submitter": "False", "link_id": "t3_vub9so", "parent_id": "t3_vub9so", "score": "1", "subreddit": "CPTSD", "subreddit_id": "t5_2vvid"}, {"author": "LaCaspienne", "body": "My brother and I get on ok-ish, but he's unfortunately one of the people who have hurt me the most. Not sure if he's traumatized himself or just... turned out differently. At the age of 15 (I was about 6) he went to live with his father, who is overall a nice guy but sometimes real obnoxious with his loudmouth, racist/misogynist jokes, I think it's a coping mechanism he inherited from his own father, who was also that type. My brother is not a bad person, but he's just emotionally underdeveloped, lacking in empathy, invalidating, and I feel that I simultaneously love him and feel absolutely destructed by him. I have the adoration of a younger sister but cannot be myself with him, because he'll just invalidate me, he won't understand, and will blame it on my \"sensitivity\". It's torture to even just think of it. It feels toxic, and probably is. \n\nIn childhood already, when I would self-deprecate (which was NOT normal), brother would say I'm just doing it for attention, that I liked being a \"little victim\", \"stop complaining\", \"oooh, stop whining\". In my teen years, in a particularly vulnerable moment (and probably after he said something that cut me to the core again), he told me that I \"love it when people pity me\" and it hurt me so fucking hard that I didn't speak to him for years after. He apparently had no idea this could've hurt me so bad and didn't intend to hurt me. Fun fact, his ex-gf is a lot like me, possibly also has gone through trauma, and I think I know now why they split up, despite still being friends. I think he probably invalidated her a lot emotionally, they argued a ton but somehow stayed together for 6 years or so. \n\nI called him recently to speak about our childhoods and our mother's behaviour, but... he gave me the typical \"move on with your life and don't try to find answers\", \"you need to find a job and a purpose in life\", kinda response and spent more time advising me than listening to me, which broke my heart. I just wanted my brother to be a brother, you know? To him our mother, even if she had a bit of a fiery temper when younger, is a cool person, and was even \"too nice\", and \"too lenient\", and I wanted to vomit when I heard that over the phone because of how I never felt safe with her, and how I was always waiting for the other fucking shoe to drop, and just how no one fucking seems to believe me, and I questioned myself again, am I crazy, am I just mentally ill, or god forbid, am I the abuser? I felt as if he was literally calling me a spoiled kid, even if he didn't outright say it. \n\nHe also said that I was probably on the spectrum and that my father (also abused in his childhood) possibly is too, and that I \"mimicked his behaviours\" of self-deprecating and looking for attention as a toddler. Typing this I feel the rock in my chest/throat returning. I'll never speak to him about my childhood or any other issue again. I love him but... i feel that he will never be right for me. It just kills me that he will never seem to understand. I feel so alone.", "created_utc": "1657312728.0", "edited": "False", "id": "ife3fzb", "is_submitter": "False", "link_id": "t3_vugsdj", "parent_id": "t3_vugsdj", "score": "8", "subreddit": "CPTSD", "subreddit_id": "t5_2vvid"}, {"author": "LaCaspienne", "body": "It gets harder and easier at the same time.\n\nEasier because finally you get these horribly heavy weights off your shoulders and back. You know intimately that these things don't define you, don't define your worth, and most importantly are not your fault. The people who abused you were often abused themselves and unlike you, didn't make the effort to resolve their past trauma. \n\nHarder because the old programming is just... a nightmare to remove. It's like a bad virus on your PC. It comes back no matter how hard you try to remove it, and the recovery isn't linear either. You can do great for a while and then fall back for no apparent reason.. then get back up... then fall down again... it's hard to reprogram a brain that has been trained for survival when its mechanisms are no longer needed.", "created_utc": "1657297020.0", "edited": "False", "id": "ifczs0z", "is_submitter": "False", "link_id": "t3_vuanqy", "parent_id": "t3_vuanqy", "score": "10", "subreddit": "CPTSD", "subreddit_id": "t5_2vvid"}, {"author": "LaCaspienne", "body": "I have this as well. I look ok on my toddler pics, but I still cannot recognize myself as me. This tot looks like me, but doesn't feel like me at all. I even feel weirdly sad looking at them. I feel this kid in the pictures is... I can't explain, doesn't exist, or has never really existed, like one of these AI generated faces that look so real. It's like looking at something fictional almost. I feel sad for this kid because I feel she's been conned. That sweet blue-eyed toddler had no idea that 20 years later, she'd be battling with wounds that no one else sees, and that are inconvenient for her family to look at.\n\nLooking through childhood pics recently to find a specific one, I realized that on most of them after the age of 6-7, aka the moment you \"come into yourself\" and really start to be your own person, I don't look happy. I look dissatisfied and joyless on many, or have sort of a blank/deer in the headlights stare, and the only ones on which I look really happy are with an animal (whether it's a pet or a riding horse), a friend, or in some cases, my brother, even though he was part of the issue himself.", "created_utc": "1657273942.0", "edited": "False", "id": "ifbpg13", "is_submitter": "False", "link_id": "t3_vtvgok", "parent_id": "t3_vtvgok", "score": "7", "subreddit": "CPTSD", "subreddit_id": "t5_2vvid"}, {"author": "LaCaspienne", "body": "\"Nah, let her. She wants her bones to be brittle.\" \n- my mother to my father. I was 7-8 at the time, it was during dinner, and I didn't want to eat yoghurt after the main course for whatever reason, maybe I was full or just didn't feel like it. My mother prides herself on not forcing her kids to eat, but I still always somehow felt I had to eat even when not hungry or feeling off, because otherwise it would mean I'm sick or something, and I'd get the \"you don't eat?\" question that just cranks my anxiety up to eleven, like any little remark like this one. I've only recently started to not force myself anymore.\n\nI think my father argued to let me get off the table and for some reason my mother was in a bad mood maybe, and said this on a super snarky tone. It angered me and I remember I said \"no\", but I think I ate the yoghurt regardless. I don't remember. I just visually recall the green kitchen, the plates (theirs were orange, mine was pink), and her goddamn sarcastic tone that had absolutely no reason to crop up whatsoever. I realize now it was basically guilting me into eating that damn yoghurt.", "created_utc": "1657182190.0", "edited": "False", "id": "if6lt93", "is_submitter": "False", "link_id": "t3_vt42u4", "parent_id": "t3_vt42u4", "score": "2", "subreddit": "CPTSD", "subreddit_id": "t5_2vvid"}, {"author": "LaCaspienne", "body": "You have the right to feel hurt regardless of if logic gets in there or not, because there is a reason why you feel this way. It may or may not be logical, because our emotional reactions aren't necessarily logical. You're not being petty, you're hurt, and given that you have CPTSD, it's completely normal. \n\nMaybe she doesn't realize or just doesn't want to acknowledge that her behaviour screwed you up. Mine is the same. She gets defensive when I mention that she hasn't been there for me emotionally. I sometimes wonder if our parents don't want or just cannot realize intellectually/emotionally that the way they raised us wasn't right, and that we lacked in emotional support. Unfortunately, maybe they didn't know any better themselves, which complicates the deal even more. \n\nIf they haven't been demonstrated love/affection as a child or have been abused themselves (both my parents have gone through that, my mother seems to have been emotionally neglected and my father was straight up abused), they cannot pour from an empty cup, so to speak. It still doesn't excuse the fact they did not acknowledge or try to better themselves - pardon my bad wording, English isn't my native and I'm not sure how to word it correctly - by working on themselves or going to therapy before having kids, and it certainly never excuses the neglect and abuse. \n\nYou have the right to feel. It's never wrong to feel a certain way.", "created_utc": "1657180049.0", "edited": "False", "id": "if6j7ca", "is_submitter": "False", "link_id": "t3_vt9hrj", "parent_id": "t3_vt9hrj", "score": "2", "subreddit": "CPTSD", "subreddit_id": "t5_2vvid"}, {"author": "LaCaspienne", "body": "I'm not sure what to say here, apart that I feel for you, OP.", "created_utc": "1657179028.0", "edited": "False", "id": "if6hxy3", "is_submitter": "False", "link_id": "t3_vsyqpb", "parent_id": "t3_vsyqpb", "score": "1", "subreddit": "CPTSD", "subreddit_id": "t5_2vvid"}, {"author": "LaCaspienne", "body": "Well maybe I'll return to watch the news in a while, but right now if I do I straight up spiral into suicidal thoughts. I think I'd rather not touch that stuff with a ten feet pole at least for the time being.", "created_utc": "1657178526.0", "edited": "False", "id": "if6hbcr", "is_submitter": "False", "link_id": "t3_vsnpn0", "parent_id": "t1_if52k5j", "score": "1", "subreddit": "CPTSD", "subreddit_id": "t5_2vvid"}, {"author": "LaCaspienne", "body": "Even if tinder and people wouldn't have told you so, liking your own appearance doesn't make you an egomaniac lol, it's a sign of healthy or at least healthier self-esteem!", "created_utc": "1657119364.0", "edited": "False", "id": "if2xqlh", "is_submitter": "False", "link_id": "t3_vsp7vm", "parent_id": "t1_if2rvqi", "score": "30", "subreddit": "CPTSD", "subreddit_id": "t5_2vvid"}, {"author": "LaCaspienne", "body": "Avoiding the news like the plague.", "created_utc": "1657116901.0", "edited": "False", "id": "if2rsvf", "is_submitter": "False", "link_id": "t3_vsnpn0", "parent_id": "t3_vsnpn0", "score": "55", "subreddit": "CPTSD", "subreddit_id": "t5_2vvid"}, {"author": "LaCaspienne", "body": "Man, this is so heartwarming to read! ❤️", "created_utc": "1657105053.0", "edited": "False", "id": "if25o00", "is_submitter": "False", "link_id": "t3_vsj7oj", "parent_id": "t3_vsj7oj", "score": "20", "subreddit": "CPTSD", "subreddit_id": "t5_2vvid"}, {"author": "LaCaspienne", "body": "Can relate. When I was 10 I went on a school trip with my class, and all the other kids were crying because they missed their mother. I cried because I missed... my guinea pig. It became sort of a joke in the family but still has that distinctive flavour of \"abnormal\". But no one has asked about why I preferred my toys and pets over my parents. They conveniently assume I'm just \"autistic\", or \"ungrateful\". And I don't feel sad at all about leaving my mother when I move out, I just... feel I'll just horribly miss my cats. I cannot take them with me either. One is sick and the other is not good with change at all. They are 10 now and I'm heartbroken that I'll likely not be at their side when they pass away, like I wanted to when I got them at the age of 12.\n\nPets are some of the only beings that we can experience unconditional love from. Dogs are especially good at showing this. A human can say all they want that they love you, that you are the favourite kid, that you're a priority, that you're everything to them, that they want you, but their actions can show the complete opposite. A pet will never do that. A pet will let you know right away if they love you or not. They will never put on a façade or pretend, because they have no capacity to do so.\n\n> I don't know. I feel like in some weird way, it's emotionally equivalent to being told to raise someone else's child for one year, while they are fully capable of doing so, and being told that it isn't my child at all, regardless of the work I put in.\nI don't want to be disrespectful in how I worded that, I know it isn't actually equivalent but it is still heart fucking breaking, to know that I raised this dog from a little tiny puppy loaf, to the dog he is today. \n\nWhen you think about it, it is equivalent in some way, although obviously not literally. Our pets are dependent on us for care and even for survival for many of them. Children, too, are dependent on their caretakers for care and survival. It's not much different. You nurture a being that needs to be nurtured, and you become their world. I don't see this as disrespectful tbh. And it is heartbreaking to have to leave any being that you have raised and spent time with. It doesn't matter what his paper says, in his heart, you're his, and in your heart, he's yours. No legal contract or whatever stupid piece of paper or commands in a computer will ever overcome that. \n\nI just feel as heartbroken as you reading your post. Also, urgh, not letting you choose your dog and instead impose one on you... and from a breeder. Just, urgh. It's not your doggo's fault indeed, but I'd be bothered as well.", "created_utc": "1657104399.0", "edited": "False", "id": "if24rxj", "is_submitter": "False", "link_id": "t3_vseua0", "parent_id": "t3_vseua0", "score": "3", "subreddit": "CPTSD", "subreddit_id": "t5_2vvid"}, {"author": "LaCaspienne", "body": "I feel you. My mother was also often in front of the computer when I was a child (she was a housewife up until I was about 8-10), and in my teen years, she basically would imply that I'm too addicted, saying that \"my laptop is my best friend\", and once during a week-long power cut, she said with a smug smile \"after this week, you'll be detoxified\". I remember how angry I felt at that. \n\nFun thing is, her main addiction is watching movies, and she uses 2 laptops, an old one to play a movie and the other to play a game or browse Pinterest at the same time. Whereas I feel bad for using one laptop most of the day and feel like an addict when I spend my day on it, which I do 10x when she's home.", "created_utc": "1657103341.0", "edited": "False", "id": "if23dfc", "is_submitter": "False", "link_id": "t3_vshzlm", "parent_id": "t3_vshzlm", "score": "2", "subreddit": "CPTSD", "subreddit_id": "t5_2vvid"}, {"author": "LaCaspienne", "body": "Up until recently, I was planning to exit around 40. But I've made a promise to a beloved spirit guide of mine not to take my own life, and to let either nature do its job or (if unfortunately it happens) someone else do it (accident/murder/whatever I have no control over). Of course, might have just promised it to myself, but still. I have made a pact, whether it's really with that spirit or simply with myself, and I ain't a person who breaks her promises. \n\nIt's hard at times though, and I feel I may not be able to honour this commitment. I still have urges and thoughts, but... I want to keep my promise, even if I endure hell. I realized that I don't deserve to do this to myself, and that no one does. Even just for that, I just... don't want to go down that path. Worst case scenario I'll just write my author avatars, which I consider parallel versions of myself, killing themselves instead of doing it myself.", "created_utc": "1657102959.0", "edited": "False", "id": "if22vt3", "is_submitter": "False", "link_id": "t3_vsji4o", "parent_id": "t3_vsji4o", "score": "3", "subreddit": "CPTSD", "subreddit_id": "t5_2vvid"}, {"author": "LaCaspienne", "body": "Kazakhstan, although it's flawed in its own way, but it has the excuse of being a relatively young country and having \"growing pains\" so to speak, unlike a centuries-old nation that is supposedly \"superior\" or \"better\". At least post-USSR countries don't pretend to be heaven on earth. Also, damn, the love for Central Asian and post-Soviet cultures.", "created_utc": "1657098806.0", "edited": "False", "id": "if1xue0", "is_submitter": "False", "link_id": "t3_vrukmc", "parent_id": "t1_if1wab6", "score": "2", "subreddit": "CPTSD", "subreddit_id": "t5_2vvid"}, {"author": "LaCaspienne", "body": "France", "created_utc": "1657094290.0", "edited": "False", "id": "if1sjb2", "is_submitter": "False", "link_id": "t3_vrukmc", "parent_id": "t1_if1s4dm", "score": "1", "subreddit": "CPTSD", "subreddit_id": "t5_2vvid"}, {"author": "LaCaspienne", "body": "I do experience it, yeah. I was a wanted child apparently, but never felt wanted. I think my parents did want a child, just not me, or that my mother regretted having me because, idk, I wasn't what she expected? For a long time I would blame myself and say that I was probably awful or defective, but what blame would I have in just... being me, being a child? I think I was ok up until I reached age 5-6, that's where the strongest and earliest memories of abuse surface. It also coincides with the time when the kid starts to get a personality of their own. I was no longer just a reflection of her. I was myself... and I can't be anyone else, and now I don't even desire to be anyone else. \n\nI read a passage once in The Body Keeps The Score, just when Chapter 6 starts, where one of van der Kolk's patients, a young woman who raised the foster kids her mother kept, was told by her mother in her childhood that she (spoiler for TW)>!didn't belong in the family, that they were probably given the wrong baby!<. It triggered me so damn hard because that was exactly how I felt. It doesn't help that I should've had another older brother, 5 years my senior, between my brother, 9 years my senior, and I, but that he died in the womb as a 4 month fetus. For a long time, and still sometimes now, I think \"why him and not me, maybe they would've liked him better\". If he had been born, I would probably never have ever been conceived.\n\nWhen I brought this up with her a few years ago, before the escalating of arguments over that just retraumatized me, she became defensive and said that a woman who doesn't want a child doesn't take off her IUD. I guess I was more of a... regret, than anything else, then.", "created_utc": "1657058906.0", "edited": "False", "id": "iezz5jp", "is_submitter": "False", "link_id": "t3_vs83o3", "parent_id": "t3_vs83o3", "score": "8", "subreddit": "CPTSD", "subreddit_id": "t5_2vvid"}, {"author": "LaCaspienne", "body": "Hey dude, you feel that way for a reason. You said yourself that you are not able to live up to their expectations. That alone is indicative that there was an issue, and it's nowhere near your fault.\n\nPlease don't end yourself, really. You don't deserve that, no one does.", "created_utc": "1657058058.0", "edited": "False", "id": "iezx493", "is_submitter": "False", "link_id": "t3_vs648c", "parent_id": "t3_vs648c", "score": "3", "subreddit": "CPTSD", "subreddit_id": "t5_2vvid"}, {"author": "LaCaspienne", "body": "I experience this as well, and while it doesn't panic me, it sure feels weird as fuck. Especially when I catch my reflection in a mirror. I have a little moment of \"oh wait, that's right, I have a body\"...", "created_utc": "1657053937.0", "edited": "False", "id": "iezn0pt", "is_submitter": "False", "link_id": "t3_vs6y6a", "parent_id": "t3_vs6y6a", "score": "2", "subreddit": "CPTSD", "subreddit_id": "t5_2vvid"}, {"author": "LaCaspienne", "body": "No one can predict the future and certainly not an AI. This is such a garbage use of such a mindblowing and advanced technology... \n\nReally, don't let a program determine your life, or your future. It's in your hands still. It's hard to grasp and hard to implement, but ultimately it's still yours. \n\nBig virtual hug.", "created_utc": "1657052308.0", "edited": "False", "id": "iezixuk", "is_submitter": "False", "link_id": "t3_vs3a8y", "parent_id": "t3_vs3a8y", "score": "2", "subreddit": "CPTSD", "subreddit_id": "t5_2vvid"}, {"author": "LaCaspienne", "body": "Me too. I'm not from China, I'm from Europe (but then I get minimized because \"others have it worse\" and \"I should be grateful to live in the EU\"), but I've had the exact same as you. I hate everything about my country. I'd say the only thing I don't hate about it is the older literature. The language itself isn't awful, but I find it better suited for writing, and people can't fucking spell correctly anyway, there are even mistakes on food packages and signs. When I was little I already dreamed about leaving the country, never felt any connection to it, and hating it more and more with each year that passes. I just need to get out of my freeze state and finally make that leap of faith...\n\nThe worst for me is less about the country itself than being... like, having been forced to be someone I am not. Having an identity imposed on me. Not many understand unfortunately. I can't wait to be able to get out and never come back ever.", "created_utc": "1657039737.0", "edited": "False", "id": "ieynbuk", "is_submitter": "False", "link_id": "t3_vrukmc", "parent_id": "t3_vrukmc", "score": "3", "subreddit": "CPTSD", "subreddit_id": "t5_2vvid"}, {"author": "LaCaspienne", "body": "> For example, dismissing my emotions or telling me how my dissociation annoys him\n\nTwo paragraphs in and I can already safely say this guy sounds like a dick. You're not the bad guy here, he's literally invalidating you. \nThe rest of your post confirmed it for me tbh. This is abusive behaviour. \n\n> I was drinking a zero sugar beverage and he got on my case about how fake sugar is bad. I made a small comment about how it's \"everyone get on my case day\", and this escalated him.\n\nHe attacks you for no other apparent reason than being in a bad mood, then makes it about himself. \n\n> I spent a lot of time researching the Freeze and how to cope. I treated it as a project and I made myself a little guideline as well. I was really proud of myself and wanted to show him. I asked him if he was interested and he said yes. For some reason he seemed annoyed then started criticizing it. He said that if I need to take a break during an argument that is not fair to him. I said okay we do not have to do that and he got annoyed that I just have up on my project. I got really confused and then he switched the topic on how I always make everything about myself.\n\nThis part really infuriated me, because he should've supported you, not criticized you. I unfortunately can relate a lot to having done something you're proud of and the other person... just either ignoring it or tearing it down, instead of supporting you and sharing in your joy. \n\nThere he proceeded to do the exact same thing he accused you of doing. He made everything about himself. He doesn't want you to take a break during an argument because it's supposedly unfair to him, but it's also unfair to you if you are forced to endure such an extreme amount of stress. Breaks in arguments can also make you cool down a little bit and think of a way to resolve it better tbh, I don't see how it's unfair to get off it for a while and then talk it out later, when you both are in a less charged state.\n\nThis guy sounds like a jerk tbh, if he knows of your past he shouldn't be treating you like that.", "created_utc": "1657014328.0", "edited": "False", "id": "iex9thu", "is_submitter": "False", "link_id": "t3_vrs4h1", "parent_id": "t3_vrs4h1", "score": "3", "subreddit": "CPTSD", "subreddit_id": "t5_2vvid"}, {"author": "LaCaspienne", "body": "No, because I'd be afraid to fall down the same path. If I learnt that one of my friends did drugs though, I'd try my best to help them.", "created_utc": "1657013485.0", "edited": "False", "id": "iex8u3a", "is_submitter": "False", "link_id": "t3_vrqa5h", "parent_id": "t3_vrqa5h", "score": "7", "subreddit": "CPTSD", "subreddit_id": "t5_2vvid"}, {"author": "LaCaspienne", "body": "Self-harmed, but never attempted suicide, although I came dangerously close a few times and still battling with the urge to do it, going as far as hiding whatever could serve as a means to exit, or feeling uneasy when I see potential things. I haven't SH'd in 3 years now but I still have some self-destructive behaviours, which I'm trying to curb, because... even if I have to remind myself of it, I don't deserve to destroy myself like that.\n\nIt always hit me when I was angry or anxious, because I was shamed for feeling both (parents being annoyed at me when I was being anxious and frozen, making me freeze even more, and like many of us here, my anger being unacceptable), so it became so overwhelming I'd either self-harm in rage or want to off myself.", "created_utc": "1657013112.0", "edited": "False", "id": "iex8ejt", "is_submitter": "False", "link_id": "t3_vrs0zs", "parent_id": "t3_vrs0zs", "score": "3", "subreddit": "CPTSD", "subreddit_id": "t5_2vvid"}, {"author": "LaCaspienne", "body": "This is the verbal equivalent of stabbing you in the heart with a wide smile on their face.\n\nJust urgh.", "created_utc": "1657012852.0", "edited": "False", "id": "iex83s1", "is_submitter": "False", "link_id": "t3_vrm6k4", "parent_id": "t3_vrm6k4", "score": "6", "subreddit": "CPTSD", "subreddit_id": "t5_2vvid"}, {"author": "LaCaspienne", "body": "Ooof, I just have no idea. I've had so many \"younger versions of me\" that it feels impossible to really say if they were stronger or weaker than my current version. I guess that's the dissociation speaking...", "created_utc": "1656964955.0", "edited": "False", "id": "ieuw9og", "is_submitter": "False", "link_id": "t3_vr0zsf", "parent_id": "t3_vr0zsf", "score": "1", "subreddit": "CPTSD", "subreddit_id": "t5_2vvid"}, {"author": "LaCaspienne", "body": "Definitely. It's incredibly triggering.\n\nPeople who do this are especially scummy imo, being ghosted makes you run in circles with questions and just agonize over what the fuck you did to make them do that, without any, idk, justification or at least an explanation. I know it doesn't feel like that right now, but you dodged a bullet. You don't want to be friends with someone who does that. \n\nTake your time to heal. It's alright to grieve. You invested time and energy in him, it's normal that it hurts...", "created_utc": "1656945805.0", "edited": "False", "id": "ietn6fr", "is_submitter": "False", "link_id": "t3_vqy1l5", "parent_id": "t3_vqy1l5", "score": "4", "subreddit": "CPTSD", "subreddit_id": "t5_2vvid"}, {"author": "LaCaspienne", "body": "Had the same one. When I was 10 and shit started to get real messy between my parents, I was always afraid I'd die in my sleep before I would see my father again on the weekends. I craved him so bad, probably because he was the one who actually showed me the love I needed, until he basically withdrew it by not taking me with him or at least asking for custody when he separated, then divorced, from my mother. It was so bad I would put my guinea pigs' cages in my room for the night because having them nearby reassured me.", "created_utc": "1656940875.0", "edited": "False", "id": "ietcvaf", "is_submitter": "False", "link_id": "t3_vr4xn1", "parent_id": "t1_iet4tco", "score": "2", "subreddit": "CPTSD", "subreddit_id": "t5_2vvid"}, {"author": "LaCaspienne", "body": "I love fireworks aesthetically, but the sound terrifies me, and watching them is a sensory overload. It feels like the explosions resonate through me, I feel sort of faint/sick, kind of hard to breathe, and my heart beats irregularly. I don't know how I've never fainted lol\nThe only loud noise I tolerate well is thunder, AND only if it's not, like, straight above the house.", "created_utc": "1656921269.0", "edited": "False", "id": "iesm6hu", "is_submitter": "False", "link_id": "t3_vqx1wp", "parent_id": "t3_vqx1wp", "score": "1", "subreddit": "CPTSD", "subreddit_id": "t5_2vvid"}, {"author": "LaCaspienne", "body": "I never thought about it like this, but I have this thing with mirrors as well, and I don't think it's vanity or narcissism at all. As far as I can remember I would look at myself in the mirror a lot too. I like to observe myself actually... even when masturbating lol, it's weirdly interesting to see how you look like when you're doing that. I do have that disconnection thing though... kinda.\n\nIt's weird because I know the other person in the mirror is me, yet I still don't experience myself as this person. I feel like \"I\" am inside, not that \"I\" am both that consciousness and that body. It feels like my body is just a vessel of sorts and that I'm looking only at my outer shell. At times I feel odd catching my reflection in the mirror. I sometimes do this with my reflections in windows too. I just have to look at myself, my expressions... and I never thought that it could be because I feel I don't exist, but now that you said it, it makes sense. I feel more like an immaterial consciousness of sorts rather than a full-fledged person. I feel half outside my body most of the time, and sometimes like I just float above it when I'm particularly stressed or overwhelmed by sounds/lights/smells. \n\n> being able to see the entire room at a glance comforts me incredibly. I still look towards the door every few minutes but it's much better. This is why a wide mirror helps me a lot vs just a body mirror\n\nI get that. It definitely gives a sense of security to be able to see what's going on without going out of your hiding spot, lol.", "created_utc": "1656796810.0", "edited": "False", "id": "iemfn82", "is_submitter": "False", "link_id": "t3_vq0yi8", "parent_id": "t3_vq0yi8", "score": "1", "subreddit": "CPTSD", "subreddit_id": "t5_2vvid"}, {"author": "LaCaspienne", "body": "I used to deal with it and probably will deal with it again when I'll be back to social life. People can sense when you are different, and humans typically don't like difference. We are creatures of conformity for a good reason. It used to be our way to survive in the wild. Without a tribe, we'd die. As you heal it becomes easier to just brush away the hardness of this. You can't force people to like you, even if they don't really have a good reason to dislike you. It's about them, not about you. And for every person who dislikes you, there is probably also one who does like you.\n\nIt's not your fault that you are different. It's not your fault that you are wired a different way. I think most people are also not emotionally mature enough to simply acknowledge differences and move on. Our society keeps people in the mental age of a teenager, just look at any workplace and you'll find there's a lot of drama that sounds more of middle-schoolers than of grown ass adults. People would rather mock and humiliate rather than accept difference and cherish it.", "created_utc": "1656775936.0", "edited": "False", "id": "iel5895", "is_submitter": "False", "link_id": "t3_vps7ka", "parent_id": "t3_vps7ka", "score": "7", "subreddit": "CPTSD", "subreddit_id": "t5_2vvid"}, {"author": "LaCaspienne", "body": "I feel you. It's especially awful when you seek help and that the person basically tells you that.", "created_utc": "1656775334.0", "edited": "False", "id": "iel3vn8", "is_submitter": "False", "link_id": "t3_vpqwkj", "parent_id": "t3_vpqwkj", "score": "4", "subreddit": "CPTSD", "subreddit_id": "t5_2vvid"}, {"author": "LaCaspienne", "body": "I don't. \nI don't think anyone would want me that way anyway.", "created_utc": "1656773398.0", "edited": "False", "id": "iekzj0c", "is_submitter": "False", "link_id": "t3_vpjnwg", "parent_id": "t3_vpjnwg", "score": "4", "subreddit": "CPTSD", "subreddit_id": "t5_2vvid"}, {"author": "LaCaspienne", "body": "I did, yeah. That led me to do something in my teen years I realized was very abusive, toxic and wrong: I would unconsciously attempt to be the \"only one in focus\", to isolate whoever I was close at the moment, because I was so afraid that the minute I'd look away, I'd lose them, or that they'd replace me with someone \"better\", that there is \"always better out there and it's a matter of time until I'm no longer useful/good enough and get kicked to the curb\". I considered everyone else in the picture a rival to be eliminated. On one occasion I even fantasized about killing the pet bird and make it look like an accident. Yes, the fucking pet bird, it was that bad. At the age of 12 I went apeshit over my online best friend replacing me. I threatened suicide and murder (of course, probably didn't understand what it implied), self-harmed, and in the end the one who was used to replace me... was replaced herself a few years later. Lol. I was also faithful to an unhealthy degree... I would feel that going with other people was akin to betrayal or cheating, even in friendships, and that I had to commit 100% to whatever I did, because if not, then it would give ammo for someone to use against me later. To me life was about finding your \"one and only\" and that they'd forever stay with you and only you. Now I realize how fucked up that belief was.\n\nIt may be because most of my childhood was experienced between my mother and I, and that I had only one \"permanent\" caregiver to hold on to (dad often away due to army), despite that same caregiver being sort of unpredictable with her emotions and the attention she would give me, and because I was taught to only trust her, that everyone else would let me down. Also, I witnessed her trying absolutely everything to save the marriage with my dad (the \"I want to stay together for the kids\" thing), who had cheated on her more than once, and, I later understood, wasn't happy in his marriage, which makes it really understandable that he preferred to go. Both of them are codependent, and he would prefer acting like a dick to her rather than straight up confront her and say he's unhappy and try to fix things, and she'd fawn and fawn to try and keep him, going as far as suddenly changing how she acted with me for a short period of time, which I'm still kinda mad about because I had absolutely NOTHING to do with their couple issues whatsoever.\n\nBut I think it was also because I indeed constantly felt like the \"last one\", the \"last choice\", the one that is unwanted and has to \"earn\" people's love. I was secretly horribly jealous and possessive yet never admitted it until I would explode in a quite nasty way. As a kid I was apparently a priority, yet always felt like \"the last one\". I was always fighting to be the \"only one\", and I didn't understand until sort of recently (I am 22 now...) that when somebody else is in the picture, it doesn't negate the affection you feel for your person or vice versa, nor does it make them your enemy or rival. What your person cannot find in you, they can find in another, and that goes for you too, and that having more than one close person actually counter-balances things and makes you appreciate both more. Doesn't fix the fear of abandonment and betrayal completely, but it's still much better, especially when you've realized how toxic you behaved in the past.", "created_utc": "1656756866.0", "edited": "False", "id": "iek889p", "is_submitter": "False", "link_id": "t3_vpfd6g", "parent_id": "t3_vpfd6g", "score": "4", "subreddit": "CPTSD", "subreddit_id": "t5_2vvid"}, {"author": "LaCaspienne", "body": "It's both, actually. Trauma is one problem with a thousand different facets, but if you think about it, all comes down to that one single thing: trauma. Except it's like a monster with a thousand tentacles that seizes whatever it comes into contact with and holds it hostage. \n\nAlso, fuck those articles, they're so damn scummy. They should write more about how to gather confidence, how to take small steps in your recovery, and how to heal yourself or just allow yourself to fail at times just so you learn, rather than straight up saying \"welp, if you have these traits, you're basically a lost cause\". They're also complete bullshit that is powered by the bullshit beliefs of our bullshit society. Basically, toxic water to fill your stomach with.\n\nYou're not a failure, even if you may not be able to believe those words and they may feel meaningless and void to you. You're a traumatized person who tries their best to recover. And even when you feel you don't try your best, you are doing what you can, and it's already good. You don't need to be 100% all the time, it's impossible anyway. Even the littlest bit you do for yourself is a progress. And from little thing to little thing, you build something up. It takes time. It takes many awful emotions. It takes a lot of pain and purging all this gunk, but in the end... you're doing yourself a favour. You're breaking a cycle that may have been going on for generations. Isn't this a reason to consider yourself a sort of hero? :)", "created_utc": "1656691676.0", "edited": "False", "id": "iegtqb0", "is_submitter": "False", "link_id": "t3_vp1vlt", "parent_id": "t3_vp1vlt", "score": "3", "subreddit": "CPTSD", "subreddit_id": "t5_2vvid"}, {"author": "LaCaspienne", "body": "I have unfortunately been the toxic one on more than one occasion, although the other party was also displaying toxic behaviours, looking back. \n\nI cannot really forgive myself despite knowing that I was in such a survival mode state that I couldn't help but grasp with all my might and try to secure love because I was so afraid that the minute I would look away, it would disappear. But at the same time, it's not normal to be in a friendship/relationship where you feel you have to grasp at straws. I blame myself but now I realize, I might have just been reacting to triggers, and that the other person may have (intentionally or not) triggered me. We mirror each other after all.", "created_utc": "1656689019.0", "edited": "False", "id": "iegn3ta", "is_submitter": "False", "link_id": "t3_vp1rk1", "parent_id": "t3_vp1rk1", "score": "10", "subreddit": "CPTSD", "subreddit_id": "t5_2vvid"}, {"author": "LaCaspienne", "body": "I wish I could imprint this on my inner world.", "created_utc": "1656685261.0", "edited": "False", "id": "iege1g9", "is_submitter": "False", "link_id": "t3_vopgu9", "parent_id": "t3_vopgu9", "score": "4", "subreddit": "CPTSD", "subreddit_id": "t5_2vvid"}, {"author": "LaCaspienne", "body": "Yeah. Noise in the house feels like an aggression and I have no real idea why, nor when it started. When my mother is home I spend most of my time with my door closed, on the laptop, with earbuds on for this reason. I feel I have to escape from the noise and feeling of unsafety somehow. I am also very inhibited and revert back to a sort of dependent state. Unless she's sick (which is rare, but recently she had covid, I didn't get it probably because I'm always isolating anyway), for example, I have trouble doing things around the house when I have no issues with that at all when I'm home alone. It's so weird.\n\nAnd if I ever get roommates I don't delude myself and say that I won't feel that their presence is an aggression, because it probably will be, unfortunately. I'm afraid of having kids for this reason, too. I don't want to traumatize them and make them think it's their fault if I have this sensitivity. Kids blame themselves super easily and well, we all know here how much it can fuck them up.\n\nThere's also a crazy lady who harasses her ex on certain (random) evenings and who screams in the middle of my street, turns on the radio to 11 and makes all the neighbourhood have to put up with her messy breakup. I can say I low-key live in fear of her coming to bother this guy again. It's the screams. Screaming triggers me. I called the cops last time she came and even those foam bits you put in your ears didn't help.", "created_utc": "1656573755.0", "edited": "False", "id": "ieahso9", "is_submitter": "False", "link_id": "t3_vnwipn", "parent_id": "t3_vnwipn", "score": "8", "subreddit": "CPTSD", "subreddit_id": "t5_2vvid"}, {"author": "LaCaspienne", "body": "Because at least, you will have made a point to break that cycle. It may be a lifelong journey, but by at least trying, you're still doing more than all of these people who never question themselves or even try to do something about their trauma.", "created_utc": "1656535301.0", "edited": "False", "id": "ie8eg9j", "is_submitter": "False", "link_id": "t3_vn6v0u", "parent_id": "t1_ie8aofm", "score": "1", "subreddit": "CPTSD", "subreddit_id": "t5_2vvid"}, {"author": "LaCaspienne", "body": "It's not that you feel like a victim: if you've had trauma, you ARE, unfortunately, a victim. And rejecting it will hurt you even more.\n\nAccept it. Own it. Don't romanticize it, but just own it and accept it. Grieve your childhood, what could've been. You still have potential, it's just different now. I've been in this place too where I was ashamed of being a victim, because this society considers being a victim to be a bad thing. You know, the whole \"playing the victim\" and \"wanting attention\". No one says that to victims of accidents or natural catastrophes, because it's physically obvious they are victims, but the minute anything gets psychological or intangible, it's suddenly up for questioning and invalidation. Now I can see myself as a victim, but I don't wear it like a badge. It's simply a fact. I have been a victim of trauma, and now I am on the path of healing. It's long, it's painful, but it's probably going to be very rewarding in the end... much more than just stuffing it down and escaping it until I'm on my deathbed and realize, I actually never had something meaningful. \n\nIt's unfair that you were treated like that. It's unfair that they have done that to you. It's unfair that they didn't take the time to at least acknowledge their issues and start healing them, before having you. I think a traumatized parent can be a good parent, if they actually take steps to heal themselves, and explain to their child that it's not their fault, that mommy/daddy has had something happen to them that was way before the child was born, and that they are healing their wounds, just like when you fall off your bike and scrap your knees. \n\nThe plus side in all of this is that you're likely going to end up more emotionally mature than many people in this society, which loves to keep us stuck in the teenage/young adult mentality even after we should've long overgrown that. There is that silver lining... but recovering is a long, rocky, and painful path still. \n\nI send you my support, even just typing a few words on Reddit. Hopefully, that can help a bit.", "created_utc": "1656499259.0", "edited": "False", "id": "ie64lym", "is_submitter": "False", "link_id": "t3_vn6v0u", "parent_id": "t3_vn6v0u", "score": "3", "subreddit": "CPTSD", "subreddit_id": "t5_2vvid"}, {"author": "LaCaspienne", "body": "I think a lot of the \"autism\" cases diagnosed today are in fact CPTSD, especially if they are diagnosed late, ie the child was \"normal\" and didn't display symptoms of autism in early childhood prior to trauma. It's much more convenient to assume the kid is fucked up from the start rather than question one's past behaviours and how they could've affected the kid.", "created_utc": "1656432408.0", "edited": "False", "id": "ie2ivle", "is_submitter": "False", "link_id": "t3_vmh3oc", "parent_id": "t3_vmh3oc", "score": "7", "subreddit": "CPTSD", "subreddit_id": "t5_2vvid"}, {"author": "LaCaspienne", "body": "Dump this asshole. You deserve better.", "created_utc": "1656266215.0", "edited": "False", "id": "idtxqfk", "is_submitter": "False", "link_id": "t3_vl52cx", "parent_id": "t3_vl52cx", "score": "3", "subreddit": "CPTSD", "subreddit_id": "t5_2vvid"}, {"author": "LaCaspienne", "body": "I speak a lot about superficial stuff that is about me, but I never truly am vulnerable with people. I love talking about my creative work, what I do, and such, but the minute the conversations focuses on me, I start feeling exposed, too much spotlight, and like I'm monopolizing the attention. Not to mention that I still have in me that thing of \"it's incredibly dangerous to reveal your inner self\". I tend to become irritated/upset/angry/sad when I feel like the other person digs and I'm not proud to say that I've ghosted people or unconsciously found a way to end things as soon as they \"cracked me open\", even just a little bit. I almost fantasize about murdering them because I don't want them to tell anyone what they saw (irrational, ofc, it's not like I'm some criminal). I just legit cannot come back to them. I'm terrified. I've met someone I feel safe with, and even if it terrifies me to be vulnerable, I'm really pushing myself to be more open with her, because I have a sense that she won't betray me, despite what my fear is telling me. But after each time I feel like running, because trauma rears its ugly head. I need, however, to show myself at least to one person... that's how we heal.\n\nI talk about myself but I realize that I don't actually reveal what's underneath the surface. I don't like talking about myself as a person because I assume the other party will either think I'm selfish/narcissistic or will take advantage of me and use this sensitive info to screw me over later.", "created_utc": "1656265610.0", "edited": "1656265792.0", "id": "idtwcdm", "is_submitter": "False", "link_id": "t3_vkurul", "parent_id": "t3_vkurul", "score": "1", "subreddit": "CPTSD", "subreddit_id": "t5_2vvid"}, {"author": "LaCaspienne", "body": "\"You can laugh about everything, but not with everyone.\"\nThis is a goddamn simple rule. Why don't they get it?\n\nThe same people who do that are the ones to then say you're too sensitive... but there's a fine line between joking and being a dick, especially when the person in front of you needs a hug and listening, and not so-called \"humour\".", "created_utc": "1656265359.0", "edited": "False", "id": "idtvro7", "is_submitter": "False", "link_id": "t3_vl38jr", "parent_id": "t3_vl38jr", "score": "4", "subreddit": "CPTSD", "subreddit_id": "t5_2vvid"}, {"author": "LaCaspienne", "body": "The fact they are nice to you now doesn't, and will never erase, the abuse they've done to you in the past. \n\nThere's a reason why you're so terrified of them, of trusting them, of what they could do, of what they could say... and this alone is the proof that at least something wrong had happened, and that you have endured something that is absolutely not normal. Kids who had good parents don't fear their parents like that. And it's a classic thing in us survivors to feel that we made it all up. But we didn't. Why would anyone make that up anyway, when you think about it?\n\nDon't fall into this trap... because it makes it even harder to get out.", "created_utc": "1656167540.0", "edited": "False", "id": "idovxg8", "is_submitter": "False", "link_id": "t3_vkch0i", "parent_id": "t3_vkch0i", "score": "2", "subreddit": "CPTSD", "subreddit_id": "t5_2vvid"}, {"author": "LaCaspienne", "body": "Yes. Most of the stuff I do on the internet is researching stuff, and lately I have this unquenchable thirst of learning about trauma and how to recover. I remember being a kid and researching about parenting even though I hated the idea of becoming a parent myself.", "created_utc": "1656167223.0", "edited": "False", "id": "idova1w", "is_submitter": "False", "link_id": "t3_vkamni", "parent_id": "t3_vkamni", "score": "3", "subreddit": "CPTSD", "subreddit_id": "t5_2vvid"}, {"author": "LaCaspienne", "body": "What the...\nWho the fuck does that to their kid??? What the fucking hell is wrong with her??\n\nAnd it's not your responsibility either, you were a kid! Just... what the fucking hell is wrong with this woman", "created_utc": "1656105358.0", "edited": "False", "id": "idlzjb5", "is_submitter": "False", "link_id": "t3_vjtmp4", "parent_id": "t3_vjtmp4", "score": "3", "subreddit": "CPTSD", "subreddit_id": "t5_2vvid"}, {"author": "LaCaspienne", "body": "I have my own style, but I avoid wearing hats, despite loving them. There was a period where I wore a hat on nearly every occasion but it would catch too much attention and I felt like I was a histrionic of some sort, the kind that dresses just for attention, so I stopped doing it. I have a beautiful summer hat that I put a flower and a scarf on, but I cannot handle the attention from people, even compliments, so I don't often wear it unless it's hot. I love curling my hair and wearing it 1940s style (my general style is very wartime-ish anyway, though I'm now adding more cottagecore-y clothes to my wardrobe), but I haven't done it in a long time, because it's such an uncommon way to wear your hair today, and I'm scared of whoever could, idk, notice me. \n\nI don't recall if I was wearing my hair like that when it happened, but a few months ago, as I was returning from my former psychiatrist's office, men on a construction site started singing a wartime song when I passed by them, and it put me off so hard I just wanted to hide in a hole.\n\nLemme look like a ww2 housewife in peace plz", "created_utc": "1656078706.0", "edited": "False", "id": "idk3v2v", "is_submitter": "False", "link_id": "t3_vjklpv", "parent_id": "t3_vjklpv", "score": "2", "subreddit": "CPTSD", "subreddit_id": "t5_2vvid"}, {"author": "LaCaspienne", "body": "I'm unable to scream too, even when home alone. I'm just afraid someone will hear me. The repressed screams sometimes come back into my dreams. I have these nightmares where I scream so hard it's basically deafening, earrape track style. They don't happen as often, but it's often me screaming at my parents and crying.  \n\nThe last time I screamed for real was 2 years ago, when my favourite mouse died in my hands. I couldn't hold it. But... unless I really feel like I'm going to die, and I'm home alone, it's like I can't physically scream.", "created_utc": "1656078315.0", "edited": "False", "id": "idk30uf", "is_submitter": "False", "link_id": "t3_vjgk7b", "parent_id": "t3_vjgk7b", "score": "3", "subreddit": "CPTSD", "subreddit_id": "t5_2vvid"}, {"author": "LaCaspienne", "body": "Definitely. It doesn't help I was rejected by every crush in my teen years, sometimes in the worst way possible (possibly because I'm a girl who prefers girls, and who was never taught how to handle that stuff either and severely sexually repressed during her teen years, so imagine the creepy art lesbian combo) and that I went literally insane over a couple of them because the pain of repeated rejection + lack of sleep + poor diet + teenage hormones was a deadly cocktail that nearly drove me to suicide attempts. It didn't help that I didn't have supportive friends. They would treat it as like, consumer mentality, if this one doesn't like you move on and find another one, don't be sad over it, don't grieve. But it's a person, not an object I didn't \"get\". I can't just move on like that. Grief is grief, and pushing it down just makes it worse.\n\nI have no idea if I'll ever deserve a woman physically desiring me. I feel I only deserve men, to whom I'm not physically attracted to unless I'm ovulating, and that I should settle for that because that's all I deserve. I'm not ugly or fat, though. I actually like my own appearance. But I feel that I'm basically on a fool's errand. I'm not even looking for a life partner, just for experiencing at least once being physically loved. Being desired. Being wanted. By a woman. I kissed a girl once when I was 17 but I didn't even like her and she was using me to cheat on her bf anyway, but I went with it because I knew I'd likely never have another opportunity at this.\n\nWanting a woman who likes women, the dating pool is already small. A mature one I feel safe with. Oh my. The dating pool gets even smaller. Who doesn't make her sexual orientation her whole goddamn identity, and treats it like a normal preference like preferring vanilla to chocolate, rather than almost making it her whole personality. Who is overall not obsessed with politics and will not turn on me if I dare have the wrong opinion. I think I'm looking for a mythical creature of sorts at this point. I've made peace with the fact that I may spend my life without knowing what a woman's love feels like, and only experiencing being desired by men and settling for them so I at least get a bit of physical love, but... it kind of hurts knowing that I have so little to hope for.", "created_utc": "1656078051.0", "edited": "False", "id": "idk2gud", "is_submitter": "False", "link_id": "t3_vjks3h", "parent_id": "t3_vjks3h", "score": "6", "subreddit": "CPTSD", "subreddit_id": "t5_2vvid"}, {"author": "LaCaspienne", "body": "> I read online time and time again that your parents are the only ones you have left in the world, that they were the ones who changed your diaper and held your hands when you were little, but I remember absolutely almost no happy moments with my parents. I remember we went out fishing, my dad left me alone and I got a hook stuck in my hand. It could've been much worse. I remember getting slapped in the bathroom by my mom so hard that my nose started bleeding because I didn't want to eat the food she bought. I remember being ridiculed by my father for being overweight and being laughed at by my family.\n\nThis is why such clichés, \"your family is the most important thing\", \"only your parents will unconditionally accept you\", and all infuriate me so hard. Just because someone chose to give you life doesn't mean you owe them, and EVEN LESS after they have fucked you up and refused to change when they had multiple opportunities to do so. \n\nWhen you look at estranged parents forums or whatever, you'll notice it always seems to be the child who is a problem, they must have a mental illness, they must be spoiled, or whatever... but no one seems to ever ask the right question: what could've the parents done that made the kid react this way and not want to see their parents again? It's not normal that a child wants nothing to do with the people who are supposed to be their anchors in life and their safe place. It's a clear red flag. Yet they completely refuse to ever consider they probably did something wrong. \n\nIt's not bad to live without the people who have time and time again brought you down. As some others said, you'll find your own family. This is what I plan, myself, once I can finally get myself to move out and never see my family again. What keeps me in the most is... my cats. I won't be able to take them with me, because given the first's condition and treatment, and the other's terror of travel, it just would be too much stress for them. My heart breaks knowing that they will never see me again. \n\nYou deserve better than a life lived in a dark pit of loneliness, sadness, and negativity. You deserve so much better than being stuck in the past.", "created_utc": "1656059280.0", "edited": "False", "id": "idjb97f", "is_submitter": "False", "link_id": "t3_vj1rub", "parent_id": "t3_vj1rub", "score": "3", "subreddit": "CPTSD", "subreddit_id": "t5_2vvid"}, {"author": "LaCaspienne", "body": "Much, much love to you. You deserve every bit of this. <3", "created_utc": "1656058591.0", "edited": "False", "id": "idjahc3", "is_submitter": "False", "link_id": "t3_vj5mll", "parent_id": "t3_vj5mll", "score": "2", "subreddit": "CPTSD", "subreddit_id": "t5_2vvid"}, {"author": "LaCaspienne", "body": "This is why I'd rather not go to therapy and fix myself instead. But at the same time, I kind of wish I could trust someone enough to accompany me through the process, to validate me, to tell me \"yes, you're doing it right\"...", "created_utc": "1656055999.0", "edited": "False", "id": "idj7ii3", "is_submitter": "False", "link_id": "t3_vj5agl", "parent_id": "t3_vj5agl", "score": "2", "subreddit": "CPTSD", "subreddit_id": "t5_2vvid"}, {"author": "LaCaspienne", "body": "Ooof, that was quite an emotional read. I understand your sister so much. Hurt people hurt people, they say. You can have all the material comforts you want, a roof over your head, and toys to the brim, but if there is no emotional comfort and stability, it's impossible to grow up and be happy. I think that's why kids in poorer countries tend to be happier: they may not have as much material comfort as we do, but they have their families (in most cases). \n\nThat sounds like an awful family system to grow up in tbh, and the worst is that now that we are informing ourselves on trauma, we realize that it's scarily more common than we'd like to believe. I also have a thought... your dad wanted so badly your brother to partake in sports, but since he was unable to, it sounds like a karmic lesson of sorts. He badly wanted a boy, ended up getting a girl. He wanted a boy who does sports, and when his son finally came, he was unable to. This sounds like a massive spiritual lesson about expectations, but it doesn't sound like he got it...\n\nI was also a child that followed a miscarriage. I should've had another brother (around 1994), but my mother miscarried him at around 4 months of pregnancy. At times I wish he lived and I died, or that she straight up aborted me. Maybe she would've preferred to have him over me. He was a male child after all. When I think back about it I wish he lived and that I was never conceived, but it would have meant that I wouldn't be there, crafting a beautiful life of my own making. It's odd, but even when I wish I was never born, I still can remember I am not the problem, or that I am not dirty or bad. It's like a walnut that has its shell rotten, but is still good inside. I cannot really explain, it's weird. I am tied between a horrendous wave of borderline suicidal self-loathing on the outside and a knowledge that in fact, I'm good, I am beautiful, worthy listening to, and that I can make things right, on the inside. \n\nUnfortunately I have little to no support network. Got friends on the Internet but I've stopped socializing irl altogether since I dropped out of college 4 years ago. I went through emotional abuse at the hands of friends as well, and I'm just starting to get a bit more \"normal\". I'm looking to emigrate to a new country but would prefer to resolve at least a part of my trauma before doing so. Wherever you go, there you are. I'd rather not carry too much baggage with me. I know I'll make irl friends eventually, especially as I move there. It's just... not the moment.\n\nI hope you have a good day too. <3", "created_utc": "1656055948.0", "edited": "False", "id": "idj7gdh", "is_submitter": "False", "link_id": "t3_vigwm6", "parent_id": "t1_idj1ow2", "score": "2", "subreddit": "CPTSD", "subreddit_id": "t5_2vvid"}, {"author": "LaCaspienne", "body": "Yeah. With people who have a normal life and achieve milestones as well.", "created_utc": "1656006165.0", "edited": "False", "id": "idgg1t8", "is_submitter": "False", "link_id": "t3_vix5ym", "parent_id": "t3_vix5ym", "score": "2", "subreddit": "CPTSD", "subreddit_id": "t5_2vvid"}, {"author": "LaCaspienne", "body": "It was once the only way we could survive. We need to cut ourselves some slack, as... awful as it may seem. It takes a while and a lot of effort to rewire our programs, and some never manage to do so, and understandably.", "created_utc": "1656006076.0", "edited": "False", "id": "idgftwb", "is_submitter": "False", "link_id": "t3_vj23e5", "parent_id": "t3_vj23e5", "score": "75", "subreddit": "CPTSD", "subreddit_id": "t5_2vvid"}, {"author": "LaCaspienne", "body": "Nothing cringe with being you, tbh. Cringe is an invention of a culture that loves to pride itself as completely lacking in empathy and compassion. Be a scene girl at 24 if you want, no one should ever judge you for it!", "created_utc": "1656004460.0", "edited": "False", "id": "idgbtsm", "is_submitter": "False", "link_id": "t3_visp9n", "parent_id": "t1_idfpnib", "score": "32", "subreddit": "CPTSD", "subreddit_id": "t5_2vvid"}, {"author": "LaCaspienne", "body": "Man, that hits so hard...", "created_utc": "1656003274.0", "edited": "False", "id": "idg8uyy", "is_submitter": "False", "link_id": "t3_visp9n", "parent_id": "t1_idf506k", "score": "23", "subreddit": "CPTSD", "subreddit_id": "t5_2vvid"}, {"author": "LaCaspienne", "body": "Can confirm. If I could, I'd ride horses rather than take a car or even a bike for this very reason. They are incredibly good companions, mirror your vibes, if they can sense you are confident they will go forward, and if they sense insecurity with you, they will not force it. And when you speak to them while riding them, their ears listen... I would be the only one to talk to them back when I rode them as a kid/teen. The other kids in the lessons would never do so and the teacher even once told me to shut up and use my legs instead. Can't understand that most people who ride (at least in clubs) only care about competition rather than... this wonderful, wordless bond. It's just so much more rewarding than any medal, praise or trophy.", "created_utc": "1656002346.0", "edited": "False", "id": "idg6ihh", "is_submitter": "False", "link_id": "t3_visp9n", "parent_id": "t1_idg2qpw", "score": "7", "subreddit": "CPTSD", "subreddit_id": "t5_2vvid"}, {"author": "LaCaspienne", "body": "Tbh I have no idea, I actually never thought about it this way, but it sorta makes sense. She doesn't like that dogs are so demanding of attention and that you have to walk them early in the morning and late in the evening and such. I'd love it though, it would give me a reason to go outside every day that isn't just for grocery shopping. We don't see pets the same way anyway. She sees them as a constraint, fears the attachment you get to them and then being sad when they die, and I see them as nearly indispensable companionship, yes they die at some point, but that will never stop me from having them. Can't see myself living without at least a small pet for long. They're here for you when no one else is.", "created_utc": "1656002123.0", "edited": "False", "id": "idg5ydf", "is_submitter": "False", "link_id": "t3_visp9n", "parent_id": "t1_idg3twj", "score": "12", "subreddit": "CPTSD", "subreddit_id": "t5_2vvid"}, {"author": "LaCaspienne", "body": "I remember reading, I don't remember in which book, that dogs and horses were very good therapy animals for people with CPTSD. Not surprised it's the case. They're incredibly empathetic and loving.", "created_utc": "1655981131.0", "edited": "False", "id": "ideyy2a", "is_submitter": "False", "link_id": "t3_visp9n", "parent_id": "t1_idey5wv", "score": "24", "subreddit": "CPTSD", "subreddit_id": "t5_2vvid"}, {"author": "LaCaspienne", "body": "I'd love to have a dog. Always wanted a dog as a kid, but my mother doesn't like them (she says she likes them \"only at other peoples' homes\", but always says that dogs are stupid), and I could only have small pets like rabbits, guinea pigs, and all, before parents separated, because my dad is allergic to cats. But I'm more of a cat person, and while I'd love to have both a dog and a cat so I get the best of both worlds, I'm still afraid it could be too expensive for me to have both at the same time. Besides I'd prefer to have a garden if I were to get a dog.\n\nI did have a dog for a short time, like, a few weeks at most, when I was about 12. We got him from a shelter. He was a border collie/golden mix, I believe, and while I was happy to have him, my mother hated him, would treat him harshly, and my kitten was jealous. He would eat the kitten's food because he craved attention (probably was neglected himself) and I hated the way she scolded him, it just... transpired hate. I remember once in the morning, when I didn't want to go to school and felt especially depressed, and my mother was being hard on me, I said \"at least you understand me\" within her earshot and she took it super badly. I would let him sleep in my bed, I loved having him around, but he was unhappy unfortunately. He would often whimper and lick himself till there was no hairs on his paw, so he was brought back to the shelter. Mother said that he probably grew up in a household with no rules, but I'm deeply convinced he was unhappy because he could feel he wasn't welcome. Looking back we were a good match. But that didn't last. I wonder how he's doing now, he was adopted by another family shortly after. I unfortunately lost my kitten to a car accident the month or so after. \n\nI'd especially love a big flock guardian type dog. Massive, a good protector, often quite affectionate with their close circle, and no one would dare mess with you when you're walking them.", "created_utc": "1655980028.0", "edited": "1655980277.0", "id": "idexiny", "is_submitter": "False", "link_id": "t3_visp9n", "parent_id": "t3_visp9n", "score": "43", "subreddit": "CPTSD", "subreddit_id": "t5_2vvid"}, {"author": "LaCaspienne", "body": "It's insane how the human body and mind can take so much when in survival mode, right?", "created_utc": "1655972327.0", "edited": "False", "id": "ideoo51", "is_submitter": "False", "link_id": "t3_viik1v", "parent_id": "t3_viik1v", "score": "1", "subreddit": "CPTSD", "subreddit_id": "t5_2vvid"}, {"author": "LaCaspienne", "body": "I was apparently a wanted child, but I've always felt like a mistake somehow. It's weird. I think I was just... the wrong baby, idk, or that maybe my mother wanted me and then regretted it once she really realized what she was in, or that my personality is just not what she wanted. She'll never admit that like every parent, she probably had a fantasy image of me and that it was broken by who I really am. She'll never admit that all parents have favourites and that she preferred raising my brother over me. She told me that she didn't know how to raise a girl, because she isn't girly, and that she was terrified of having a girl because of how women are treated in the world, but I sometimes find myself wishing I was born a boy. I'm not even trans, I feel very much at home in the female form, but... what if I simply wasn't the way I was this time? What if something was different about me?... what if I was the right baby? Even after emotionally detaching from her the best I can, I still find myself wishing I was never born, especially when I'm not home alone for long periods of time. She is recovering from covid currently and has been home for the past week and half, and even if we hardly interact, her presence is enough to kill my creativity, make me constantly stressed, make me want to distract myself constantly and compulsively, and just feel that every sound in the house is an aggression. The movies she watches. The phone calls (the WORST), everything. It feels like an assault on my senses. I just want to be ALONE. I feel lonely when she's there, oddly enough... but hardly lonely at all when I'm actually alone.\n\nIn \"The Body Keeps the Score\", there is a story about a young woman whose mother said (verbatim, taken from the book, obvious TW) >!\"You know, I don’t think you belong in this family. I think they gave us the wrong baby.\"!< This triggered me **so. hard.** Like, **so hard.** I don't ever recall I was told that but this is exactly how I've always felt.\n\nWhen I brought it up and tried to get answers at the age of 17-18 it escalated into screaming, almost leaving me to go to school on foot on the side of the road, walls going HIGH UP, \"stop torturing me\", \"a woman who doesn't want kids doesn't take off her IUD\", \"I stopped working for 10 years to raise you\"... At this age I was really adamant on trying to get her to speak, but I think all I did anyway was retraumatize myself. Now I cannot even speak anymore every time I attempt to bring it back up. I freeze. It's especially bad when she says \"I never know who you're talking about when there is a \"they\" in the phrase\". Duh you fucking know who I'm talking about, but am too frightened to even speak up. I feel I'll never get answers.", "created_utc": "1655970790.0", "edited": "False", "id": "idemxkm", "is_submitter": "False", "link_id": "t3_vigwm6", "parent_id": "t3_vigwm6", "score": "4", "subreddit": "CPTSD", "subreddit_id": "t5_2vvid"}, {"author": "LaCaspienne", "body": "I'm more of the reverse personally. I was robbed of any kind of control for so long that now I tend to over-plan everything and cannot trust life to do things right. However, I tend to fall into that kind of detachment when I'm in learned helplessness mode and just kinda give up for a while.", "created_utc": "1655931629.0", "edited": "False", "id": "idcmwth", "is_submitter": "False", "link_id": "t3_vi9umk", "parent_id": "t3_vi9umk", "score": "3", "subreddit": "CPTSD", "subreddit_id": "t5_2vvid"}, {"author": "LaCaspienne", "body": "I wish I could upvote this more. <3\nThank you. It helps to have little reminders here and there, as small as they appear.", "created_utc": "1655894209.0", "edited": "False", "id": "idaf8hk", "is_submitter": "False", "link_id": "t3_vi105j", "parent_id": "t3_vi105j", "score": "4", "subreddit": "CPTSD", "subreddit_id": "t5_2vvid"}, {"author": "LaCaspienne", "body": "I know right. I thought I had BPD and was misdiagnosed as bipolar because of that. But I realize my \"manic episodes\" were just often intense anger that I couldn't express, so it got out in the nastiest of ways, + a couple times when lack of sleep and having overall poor relationships, extreme stress, repeated rejection and all made me into a crazy mess. Had no \"episodes\" at all ever since I stopped lithium. I'm also young (22), and a lot of my BPD-like behaviours could be chalked up to teenage turmoil mixed with lack of sleep, poor diet and trauma, and having never been taught how to deal with emotions, self-soothing, and overall life skills or how to navigate relationships with others. It's something I had to learn by myself and I'm still pissed about it because it would've been so much simpler if I had been given those damn tools like any normal kid.\n\nMy mother and brother think I'm autistic, but I am not. It's so much easier to blame it on \"an inherent mental illness\", something that \"is out of your control\" or \"biological\" rather than confront your own part in how the kid turned out, and how the way you act towards them could've potentially fucked them up badly.", "created_utc": "1655893386.0", "edited": "False", "id": "idae7j3", "is_submitter": "False", "link_id": "t3_vhvxqb", "parent_id": "t3_vhvxqb", "score": "24", "subreddit": "CPTSD", "subreddit_id": "t5_2vvid"}, {"author": "LaCaspienne", "body": "It can, I think. Some become straight up unemotional, some others have trouble distinguishing some emotions from other ones and they kinda blurs into each other. It's like someone blended all the colours on your palette and now you have to do the work of finding which colours are which and what they are used for.", "created_utc": "1655886479.0", "edited": "False", "id": "ida660i", "is_submitter": "False", "link_id": "t3_vhtlz4", "parent_id": "t3_vhtlz4", "score": "1", "subreddit": "CPTSD", "subreddit_id": "t5_2vvid"}, {"author": "LaCaspienne", "body": "Triggers me hard because of my name. I cannot change it in my country and lol, if I use my alias, it will sound like I'm hiding something, or like I'm some criminal... or just screwing with people. Which wouldn't be the case. I just legit cannot bear the sound of my birth name. It sounds so wrong, so... aggressive, so triggering. \n\nAlso, you know, sending letters and resumes and never having ANY reply back, not even a no. Makes you feel you're not even worthy of a reply. You're next to nothing.", "created_utc": "1655884996.0", "edited": "False", "id": "ida4fso", "is_submitter": "False", "link_id": "t3_vhudbu", "parent_id": "t3_vhudbu", "score": "14", "subreddit": "CPTSD", "subreddit_id": "t5_2vvid"}, {"author": "LaCaspienne", "body": "What the fuck, a 8 year old probably has no idea what pawning is...", "created_utc": "1655884861.0", "edited": "False", "id": "ida4a0n", "is_submitter": "False", "link_id": "t3_vhtd3n", "parent_id": "t1_id9yi5g", "score": "14", "subreddit": "CPTSD", "subreddit_id": "t5_2vvid"}, {"author": "LaCaspienne", "body": "My mother once got mad at me, saying that I was \"looking for a fight\", because she was putting on foundation to hide her pimples (was in her early forties at the time), and I said \"are you putting on makeup?\" because I had never seen her do this before. I still remember her getting mad, saying \"are you putting on makeup\" in a childish tone, then looking at me in an angry way. I didn't understand at all why she was mad like that and why she assumed I was being cheeky or something, I was just... idk, asking a question? \n\nLooking back I think she took it out on me because she hates putting on makeup. I'm a very \"girly\" girl on the other hand, and while she never prevented me from being one, I wonder if things would've been better had I been more \"tomboyish\" or just stayed in my room...", "created_utc": "1655884624.0", "edited": "False", "id": "ida3zup", "is_submitter": "False", "link_id": "t3_vhtd3n", "parent_id": "t3_vhtd3n", "score": "5", "subreddit": "CPTSD", "subreddit_id": "t5_2vvid"}, {"author": "LaCaspienne", "body": "I second u/sharingmyimages. You're doing a great job. <3 \nIt's not easy, but you get there in the end. It's probably a lifelong journey, but it's wonderful you actually listen to yourself and your needs. So many people never get help or never even question what happened to them and end up repeating the trauma they've been given.\n\nI don't know you, but I'm proud of you, and I mean it.", "created_utc": "1655754194.0", "edited": "False", "id": "id3gsne", "is_submitter": "False", "link_id": "t3_vgmeof", "parent_id": "t3_vgmeof", "score": "3", "subreddit": "CPTSD", "subreddit_id": "t5_2vvid"}, {"author": "LaCaspienne", "body": "I have it a lot when I'm stressed, in an emotional flashback or tired (which facilitates emotional flashbacks...) It feels like everything is \"flat\", or that I'm not even in my body. I think it's dissociation, or depersonalization/derealisation, which is dissociation anyway. You're not alone. It's a protective mechanism.", "created_utc": "1655753887.0", "edited": "False", "id": "id3g3j8", "is_submitter": "False", "link_id": "t3_vgtqko", "parent_id": "t3_vgtqko", "score": "3", "subreddit": "CPTSD", "subreddit_id": "t5_2vvid"}, {"author": "LaCaspienne", "body": "All the damn time. I have to literally force myself to think \"hey, you're reacting to something still, that means that there is something in there\". It doesn't help that my mother has mellowed out (she's 58) with age and her temper isn't as fiery as it has been in my childhood. It feels like my whole childhood was a lie, or something I made up.", "created_utc": "1655745904.0", "edited": "False", "id": "id2xqk0", "is_submitter": "False", "link_id": "t3_vgpyel", "parent_id": "t3_vgpyel", "score": "16", "subreddit": "CPTSD", "subreddit_id": "t5_2vvid"}]