[{"author": "larissaeai", "body": "I understand. I also have this problem recently. I hate it when I cannot remember words or make silly mistakes but I think it is part of life. We are humans. Sometimes we are tired or distracted. In my case I have been really distracted and stressed, so speaking worse is just a consequence.\n\nHowever, I do have some tips to help! When I was sharpest with my English, I was doing some intentional practice. For example:\n1. Training my pronunciation of specific sounds when reading out loud. \n2. Memorising short monologues and saying them out loud\n3. Recording videos of myself and watching them later to search areas to improve and track progress\n4. Warm-ups or daily sprints. \n\nI learned all this with Hadar. I don't know if you know her channel. Here's an example of sprint: https://youtu.be/8D3WCXR32NA\n\nBye! Good luck!", "created_utc": "1666453881.0", "edited": "False", "id": "itcdpqu", "is_submitter": "False", "link_id": "t3_yanr2x", "parent_id": "t3_yanr2x", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "larissaeai", "body": "Spanish is more used worldwide. This is an important thing to consider. 😊 and it is very fun. Many rich content available... the list goes on and  on 🤩", "created_utc": "1666430726.0", "edited": "False", "id": "itba3cn", "is_submitter": "False", "link_id": "t3_y9siuy", "parent_id": "t3_y9siuy", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "larissaeai", "body": "This channel is also great 😊 https://youtu.be/qTrtY3AAKaY", "created_utc": "1664916043.0", "edited": "False", "id": "ir2d6ad", "is_submitter": "False", "link_id": "t3_xs13x7", "parent_id": "t3_xs13x7", "score": "1", "subreddit": "Brazil", "subreddit_id": "t5_2qmku"}, {"author": "larissaeai", "body": "Chiclete is the most common way to say it. Like other people here also said. 😊", "created_utc": "1664731097.0", "edited": "False", "id": "iqrudzz", "is_submitter": "False", "link_id": "t3_xtrrnx", "parent_id": "t3_xtrrnx", "score": "11", "subreddit": "Portuguese", "subreddit_id": "t5_2sqn7"}, {"author": "larissaeai", "body": "Hi.\n\nSpeaking and listening:\nMany Portuguese people I know and non native Portuguese speakers say that pt-br sounds \"better\". This is because we have more open vowel sounds and because we add more musicality to our speech, so it is easier to understand pt-br. \nPortuguese people will understand your pt-br rather easily when you speak. For training your listening, I would suggest you switch from time to time between the two variants. Otherwise you will struggle with the closed pronunciation of pt-pt later. When I studied English I focused on American listening practice and when I listened to Scotish, Indians, Chinese people speaking English, I struggled. Now I listen to all accents... natives of all countries and non natives from all around the world! Nobody owns the language. It is free for everybody to learn and use to achieve his goals and dreams! Play around listening different accents! But for speaking I suggest being concise with one specific accent. 😁\n\nWriting and reading:\nNot much difference. However, some words can be different, so as long as your learn some vocab from pt-pt while studying mostly pt-br content, you will be fine. 😊\n\nI have a channel on yt where I teach some pt-br. Link below if you wanna check it out 😍\nhttps://youtube.com/channel/UC0Rhnv1flgZq-cq-yvsOQjg", "created_utc": "1664385112.0", "edited": "False", "id": "iq9b7om", "is_submitter": "False", "link_id": "t3_xqep2l", "parent_id": "t3_xqep2l", "score": "2", "subreddit": "Portuguese", "subreddit_id": "t5_2sqn7"}, {"author": "larissaeai", "body": "Curiosity is a very good excuse to start a language. 😁 Can I suggest my own youtube  channel? I hope you like it and I accept suggestions of topics you may be struggling with!\nhttps://youtube.com/channel/UC0Rhnv1flgZq-cq-yvsOQjg", "created_utc": "1663697552.0", "edited": "False", "id": "ip84c3p", "is_submitter": "False", "link_id": "t3_wq0d61", "parent_id": "t3_wq0d61", "score": "2", "subreddit": "Brazil", "subreddit_id": "t5_2qmku"}, {"author": "larissaeai", "body": "Hi! You sound excited about Portuguese! Well, at least I read it with an excited tone! 😊  All tips people gave here are good. Just dive in! But I also wanted to suggest my channel on youtube. 😁 https://youtube.com/channel/UC0Rhnv1flgZq-cq-yvsOQjg", "created_utc": "1663697331.0", "edited": "False", "id": "ip83rzk", "is_submitter": "False", "link_id": "t3_xa9ffh", "parent_id": "t3_xa9ffh", "score": "1", "subreddit": "Brazil", "subreddit_id": "t5_2qmku"}, {"author": "larissaeai", "body": "Hi. Could you please send me your channel link so I can subscribe? I am interested in ancient history and I would love to support your channel.", "created_utc": "1663586382.0", "edited": "False", "id": "ip1tloe", "is_submitter": "False", "link_id": "t3_xhjbwr", "parent_id": "t1_ip0rul1", "score": "1", "subreddit": "NewTubers", "subreddit_id": "t5_2ujnz"}, {"author": "larissaeai", "body": "Why? For each language I have one reason... English, I love it and want to become even better every day until I die. It was the first foreign language I learned. Spanish, I have lots of opportunity to practice at work and this language is fun. Dutch, I live in Dutch speaking part of Belgium. French, it is beautiful and I have always dreamed of speaking French (added bonus, I can easily go to French part of Belgium to practice).\n\nHow? I like to study the languages I have lower levels during the week for at least 30 min a day. It depends on my mood. Usually a podcast in Dutch in the morning or quick check on my book of phrases before bed, and online course of French in the evening. \nIn the weekends, I have calls in Spanish. My English is already fine but I always try to learn something about pronunciation and practice speeches from time to time.\n\nIt is a good idea to study several languages at the same time if you are passionate about them. Downside is that you will divide your time and end up learning slower than if you were focused on one. But I wanna pay the price 🤣", "created_utc": "1663180882.0", "edited": "False", "id": "iofix6e", "is_submitter": "False", "link_id": "t3_xe0ovx", "parent_id": "t3_xe0ovx", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "larissaeai", "body": "Hi. How are you? Hope you don't mind me asking. Are you learning pt br from scratch while living in Brazil?", "created_utc": "1663179950.0", "edited": "False", "id": "iofgll3", "is_submitter": "False", "link_id": "t3_xe0ovx", "parent_id": "t1_ioeolqk", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "larissaeai", "body": "Hi! If you are writing quick, short, informal texts, it is ok.\nWords with ção, for example, are easily understood if written cao (within the context). But if it is an email or a longer text it may be confusing and the person may need to read twice to understand you and it would make your text annoying. You can set you phone keyboard to switch from you native language and Portuguese and then you can use the autofill or suggestions to avoid typing accents because your phone already suggests the word with accent. In you computer, I recommend you memorise the main alt codes to help you. I am Brazilian BTW.", "created_utc": "1663099503.0", "edited": "False", "id": "ioavdt6", "is_submitter": "False", "link_id": "t3_xcnlth", "parent_id": "t3_xcnlth", "score": "1", "subreddit": "Portuguese", "subreddit_id": "t5_2sqn7"}, {"author": "larissaeai", "body": "Hi! My tip is to practice speaking from day 1. It is very useful to become comfortable with saying the words you learn. Also, listen to music and check the lyrics in PT and in your native language. It makes studying more interesting. I also suggest to learn with youtube videos. If you dont mind, I will recommend my channel. 😊\nhttps://youtube.com/channel/UC0Rhnv1flgZq-cq-yvsOQjg", "created_utc": "1663002679.0", "edited": "False", "id": "io58sgz", "is_submitter": "False", "link_id": "t3_wqn79l", "parent_id": "t3_wqn79l", "score": "1", "subreddit": "bjj", "subreddit_id": "t5_2qn02"}, {"author": "larissaeai", "body": "You can take a break and after some months check if you still feel the same. Then, resume or leave it. Good luck 🐻", "created_utc": "1662911617.0", "edited": "False", "id": "io01xpr", "is_submitter": "False", "link_id": "t3_xbhv98", "parent_id": "t3_xbhv98", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "larissaeai", "body": "Ohhh It takes me a lot of time to feel comfortable saying that! People compliment my skills and I never believe them. But recently I learned to accept compliments and believe them and use them as a motivation to keep up the good work. Practice is the key. You will never stop learning, so you can day you speak the language once you can have conversations with a simple vocabulary but in a flowy way. No need to know everything to consider you can already speak the language.", "created_utc": "1662839219.0", "edited": "False", "id": "inw936k", "is_submitter": "False", "link_id": "t3_xatsog", "parent_id": "t3_xatsog", "score": "4", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "larissaeai", "body": "Hi! First I wanna say that all you described is soooooo normal! Everybody goes through this when learning a language. \nMy tip is that you watch my videos on youtube. I have a series of videos only about conversations and another series with expressions that are very common in Brazil. I just posted a video about conversations about the weather. Please find it here: https://youtu.be/itSClgXEIaE\nMy second tip is speak by yourself when you are home alone! It can really help your mind to retrieve what you learned and also you mouth muscles to say what is in your mind. \nI have many other tips but focus on these 2 tips I gave you and if any other questions, let me know! I am glad to help! Good luck!", "created_utc": "1662838655.0", "edited": "1662878893.0", "id": "inw7nip", "is_submitter": "False", "link_id": "t3_xab25y", "parent_id": "t3_xab25y", "score": "2", "subreddit": "Portuguese", "subreddit_id": "t5_2sqn7"}, {"author": "larissaeai", "body": "Oooh! Thanks, dear! I hope it is helful! E que você tenha uma boa viagem a Portugal e Espanha! 🥰", "created_utc": "1662222021.0", "edited": "False", "id": "imxxrq9", "is_submitter": "False", "link_id": "t3_wieuxo", "parent_id": "t1_imxn0ue", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "larissaeai", "body": "Ohhh this age is perfect to learn languages because when the compound effect piles up, it makes magic! You will be a freaking awesome polyglot very early! (Maybe you already are😉). CONGRATS for making the decision to learn Portuguese. Enjoy! If you wanna learn with my channel, feel free to check it out https://youtube.com/channel/UC0Rhnv1flgZq-cq-yvsOQjg", "created_utc": "1662060191.0", "edited": "False", "id": "imp6i8z", "is_submitter": "False", "link_id": "t3_vko670", "parent_id": "t3_vko670", "score": "2", "subreddit": "Portuguese", "subreddit_id": "t5_2sqn7"}, {"author": "larissaeai", "body": "I recommend my channel 😁 https://youtube.com/channel/UC0Rhnv1flgZq-cq-yvsOQjg", "created_utc": "1662060008.0", "edited": "False", "id": "imp61jm", "is_submitter": "False", "link_id": "t3_w1j28o", "parent_id": "t3_w1j28o", "score": "1", "subreddit": "Portuguese", "subreddit_id": "t5_2sqn7"}, {"author": "larissaeai", "body": "I am learning French while continuing to learn Spanish. It is so fun and I can't get enough of both languages. Just have fun and do not beat yourself up if you mix them sometimes. I do this sometimes with unrelated languages, let alone the similar ones! 🤣 The most important thing is that you keep your goals in mind and break them into small steps. You can sometimes choose to take a break from one language and then resume if things get frustrating. Don't worry! I hope it motivates you!!\nBtw if dont mind... 😊 if you wanna check my channel out... I teach BR-PT https://youtube.com/channel/UC0Rhnv1flgZq-cq-yvsOQjg", "created_utc": "1662059861.0", "edited": "False", "id": "imp5nvl", "is_submitter": "False", "link_id": "t3_wieuxo", "parent_id": "t3_wieuxo", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "larissaeai", "body": "I think somehow learning languages keeps me sane. It is my favorite part of the day. \nReasons for studying:\n\nEnglish: I study English for a long time already and consider myself fluent, but I still like to focus on pronunciation and accent.\n\nSpanish: it is the most amazing and fun language and it sounds great. I know many native Spanish speaker so I like to talk to them in their native language.\n\nDutch: I live in a Dutch speaking country\n\nFrench: just started but it has always been my dream to speak it\n\nPortuguese: my native language but I love getting better at it. I even started a youtube channel to teach it. In case you wanna check it out: https://youtube.com/channel/UC0Rhnv1flgZq-cq-yvsOQjg\n\nFuture plans:\nJapanese: Due to many animes I have watched I feel I would love learning some Japanese, but this is a plan that I won't put into practice in the next 6 years...", "created_utc": "1661806277.0", "edited": "False", "id": "imaxpc0", "is_submitter": "False", "link_id": "t3_x0r2o2", "parent_id": "t3_x0r2o2", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "larissaeai", "body": "Thanks! I will check it out! 😊", "created_utc": "1661805267.0", "edited": "False", "id": "imavcty", "is_submitter": "True", "link_id": "t3_wzxn12", "parent_id": "t1_im4xm1w", "score": "1", "subreddit": "GetMotivatedBuddies", "subreddit_id": "t5_2st5o"}, {"author": "larissaeai", "body": "Thanks! I really would like to practice some basic stuff. I can help you with PT-BR (even though your focus is PT-PT). Send me a pv message if you are interested. 😊", "created_utc": "1661670200.0", "edited": "False", "id": "im3nj7v", "is_submitter": "False", "link_id": "t3_wyzelv", "parent_id": "t1_im01dm4", "score": "1", "subreddit": "Portuguese", "subreddit_id": "t5_2sqn7"}, {"author": "larissaeai", "body": "Hi! Good luck with your journey! I would suggest listening to music to get the sounds of the language even without knowing the lyrics. Also, find one textbook to check basic grammar from time to time and one youtube channel with basic phrases within context and with pronunciation. Something that I am applying now (to learn french) is learning with stories. Try to find a website or book with basic stories and audio version and dive into it. 😊 Let me know if I helped somehow. I am from Brazil and an enthusiast about languages.", "created_utc": "1661604846.0", "edited": "False", "id": "ilzwae3", "is_submitter": "False", "link_id": "t3_wyzelv", "parent_id": "t3_wyzelv", "score": "5", "subreddit": "Portuguese", "subreddit_id": "t5_2sqn7"}, {"author": "larissaeai", "body": "Hi, man! Very nice of you to review people's channels. I teach portuguese. Please feel free to let me know where I can improve. The first videos are not good because I didn't have a mic (solved it already). Please check the most recent ones. Thank you in advance!\nhttps://youtube.com/channel/UC0Rhnv1flgZq-cq-yvsOQjg", "created_utc": "1661108235.0", "edited": "False", "id": "il855kk", "is_submitter": "False", "link_id": "t3_wts505", "parent_id": "t3_wts505", "score": "1", "subreddit": "NewTubers", "subreddit_id": "t5_2ujnz"}, {"author": "larissaeai", "body": "Hi, all! My channel is about language learning! I am now most focused on teaching Portuguese 🇧🇷 (my native language) but little by little I plan to add content about other languages I know (English C1, Spanish B2, Dutch A2 and French A0) and study tips. \nIn the last 90 days I learned that basic vocab videos have better views and that the algorithm recommends first the longer videos, so I will try to add longer videos to my channel as well.\nLast video I posted: https://youtu.be/TgxpsG9QVLk", "created_utc": "1660566394.0", "edited": "False", "id": "ikdho05", "is_submitter": "False", "link_id": "t3_wnhva7", "parent_id": "t3_wnhva7", "score": "1", "subreddit": "NewTubers", "subreddit_id": "t5_2ujnz"}, {"author": "larissaeai", "body": "Hi! I plan to start a podcast soon! I am still maturing the idea! I accept suggestions of topics! I would start posting on youtube and later on other platforms. Please let me know what you want me to talk about! Good luck with your studies! \nMy channel: https://youtube.com/channel/UC0Rhnv1flgZq-cq-yvsOQjg", "created_utc": "1660209778.0", "edited": "False", "id": "iju40yb", "is_submitter": "False", "link_id": "t3_wl1ckg", "parent_id": "t3_wl1ckg", "score": "1", "subreddit": "Portuguese", "subreddit_id": "t5_2sqn7"}, {"author": "larissaeai", "body": "Hablas muy bien! No puedo adivinar de donde eres pero tu acento es muy estándar... Diría que mezclas México, España y Colombia. También estoy mejorando mi español cada día. Un gusto escucharte. Adiós!", "created_utc": "1660071385.0", "edited": "False", "id": "ijm7qnt", "is_submitter": "False", "link_id": "t3_wk8a7r", "parent_id": "t3_wk8a7r", "score": "2", "subreddit": "JudgeMyAccent", "subreddit_id": "t5_2ufiq"}, {"author": "larissaeai", "body": "Só tem vc nas 3 primeiras. 🧐", "created_utc": "1659934397.0", "edited": "False", "id": "ijek73t", "is_submitter": "False", "link_id": "t3_wib96c", "parent_id": "t1_ijdd0ed", "score": "1", "subreddit": "Portuguese", "subreddit_id": "t5_2sqn7"}, {"author": "larissaeai", "body": "Hahaha Concordo. Seria mais fácil falar \"o resto\". 😁 Tenho um canal, se quiser aprender mais expressões e dar uma moral. 😊 https://youtube.com/channel/UC0Rhnv1flgZq-cq-yvsOQjg", "created_utc": "1659884629.0", "edited": "False", "id": "ijbglyx", "is_submitter": "False", "link_id": "t3_wib96c", "parent_id": "t1_ijbedxf", "score": "4", "subreddit": "Portuguese", "subreddit_id": "t5_2sqn7"}, {"author": "larissaeai", "body": "Se você quiser oferecer o \"resto\" da sua comida, você pode oferecer a um amigo próximo através das seguintes frases:\n- você pode me ajudar a acabar aqui? Estou satisfeito mas não queria jogar fora. Está tão gostoso!\n- você quer um pouco do meu? Estou já satisfeito.\n- se você quiser mais, pode pegar um pouco do meu. Estou satisfeito já.\n- Não consigo comer mais mas seria um desperdício jogar isso fora. Quer? \n- Quer matar aqui o que sobrou? Não consigo comer mais. \n- Acho que botei demais (comida no meu prato). Quer mais um pouquinho? Pode pegar se quiser. \n\n😊 Espero que ajude. Mas no Brasil só fazemos isso com pessoas muito próximas, amigos e família.", "created_utc": "1659882711.0", "edited": "False", "id": "ijbc7l9", "is_submitter": "False", "link_id": "t3_wib96c", "parent_id": "t3_wib96c", "score": "8", "subreddit": "Portuguese", "subreddit_id": "t5_2sqn7"}, {"author": "larissaeai", "body": "I don't know if it is regional but I hear it from time to time.", "created_utc": "1659378213.0", "edited": "False", "id": "iijenul", "is_submitter": "False", "link_id": "t3_wda3cy", "parent_id": "t1_iiiz091", "score": "1", "subreddit": "Portuguese", "subreddit_id": "t5_2sqn7"}, {"author": "larissaeai", "body": "A similar expression in English is lip service. I always translate these expressions as equivalents. Do you agree?", "created_utc": "1659367481.0", "edited": "False", "id": "iiimuq8", "is_submitter": "False", "link_id": "t3_wda3cy", "parent_id": "t1_iihl4lm", "score": "3", "subreddit": "Portuguese", "subreddit_id": "t5_2sqn7"}, {"author": "larissaeai", "body": "Essas tres opções são muito comuns no Brasil. De nada é a mas cortês.\nhttps://youtu.be/GxmSSHb6Gfc", "created_utc": "1659254044.0", "edited": "False", "id": "iicwibl", "is_submitter": "False", "link_id": "t3_wcdvek", "parent_id": "t3_wcdvek", "score": "0", "subreddit": "Portuguese", "subreddit_id": "t5_2sqn7"}, {"author": "larissaeai", "body": "Não se preocupe e nem fique triste. Aprender uma língua pode ser frustrante porque sempre teremos errinhos lá e cá de vez em quando. Erros de conjucagao são normais e parte do processo, não importa quanto tempo esteja estudando. Sugiro q vc volte ao básico - presente simples - e pratique por um mês só isso. Faça de forma divertida e leve, uns 5 minutos por dia já tá valendo. Depois vai avançando para outros tempos verbais. Fica estudando o mesmo tempo verbal o quanto achar necessário. Vc me deu uma grande ideia. Tenho um canal no YouTube e vou criar uma série de vídeos sobre conjugação! 😊", "created_utc": "1659203347.0", "edited": "False", "id": "iia5y3v", "is_submitter": "False", "link_id": "t3_wby99u", "parent_id": "t3_wby99u", "score": "2", "subreddit": "Portuguese", "subreddit_id": "t5_2sqn7"}, {"author": "larissaeai", "body": "For studying I suggest this channel\n\nhttps://youtube.com/channel/UC0Rhnv1flgZq-cq-yvsOQjg\n\nFor practicing with music, I suggest these singers/bands:\nLulu Santos\nCidade Negra\nSkank\nLos Hermanos\nAdriana Calcanhoto\nParalamas do sucesso\nTitãs\nPitty\n\nFor listening (youtube channels)\nBBC News Brasil \nMetaforando", "created_utc": "1659026857.0", "edited": "False", "id": "ii0ehij", "is_submitter": "False", "link_id": "t3_wa0q5m", "parent_id": "t3_wa0q5m", "score": "1", "subreddit": "Portuguese", "subreddit_id": "t5_2sqn7"}, {"author": "larissaeai", "body": "I have a similar video about it 😊 Hope you like it! (Pt-Br)\nhttps://youtu.be/gm3P_yHp3Ss\nIt is more related to surprised reaction or lack of understanding but I will make a video for reactions for when someone calls your attention. Great idea! Thanks!", "created_utc": "1659008399.0", "edited": "False", "id": "ihz8eo4", "is_submitter": "False", "link_id": "t3_w9vmfl", "parent_id": "t3_w9vmfl", "score": "1", "subreddit": "Portuguese", "subreddit_id": "t5_2sqn7"}, {"author": "larissaeai", "body": "Nice! Enjoy your trip! I suggest you learn common phrases and expressions from this series of videos \nhttps://youtube.com/playlist?list=PL9_Ot1dnUiLt6NIx9xzyujNdh0O-FO1Yc", "created_utc": "1658675906.0", "edited": "False", "id": "ihggu9e", "is_submitter": "False", "link_id": "t3_w69yqw", "parent_id": "t3_w69yqw", "score": "1", "subreddit": "Portuguese", "subreddit_id": "t5_2sqn7"}, {"author": "larissaeai", "body": "Eu uso coiso de maneira informal. Coisa é mais standard. PT br", "created_utc": "1658576391.0", "edited": "False", "id": "ihb88kd", "is_submitter": "False", "link_id": "t3_w5bud9", "parent_id": "t3_w5bud9", "score": "1", "subreddit": "Portuguese", "subreddit_id": "t5_2sqn7"}, {"author": "larissaeai", "body": "Muy bueno! Me encanta tu acento. (No soy nativa del español)", "created_utc": "1658431832.0", "edited": "False", "id": "ih3b9ga", "is_submitter": "False", "link_id": "t3_w4kgrg", "parent_id": "t3_w4kgrg", "score": "1", "subreddit": "JudgeMyAccent", "subreddit_id": "t5_2ufiq"}, {"author": "larissaeai", "body": "Your English is great and clear. Congrats. If you wanna improve even more, you can work on your intonation. It sounded a bit monotone. Have you heard about Hadar Shemesh? She has nice videos about intonation and stress patterns.\nFor example https://youtu.be/m35l59tMwk8", "created_utc": "1658217377.0", "edited": "False", "id": "igr2ovo", "is_submitter": "False", "link_id": "t3_w1wuhv", "parent_id": "t1_igqlxv8", "score": "1", "subreddit": "JudgeMyAccent", "subreddit_id": "t5_2ufiq"}, {"author": "larissaeai", "body": "When a woman loses her virginity, some blood could leak the next day but it is just a little.", "created_utc": "1658173393.0", "edited": "False", "id": "igol7oc", "is_submitter": "False", "link_id": "t3_w1pioo", "parent_id": "t3_w1pioo", "score": "1", "subreddit": "Horror_stories", "subreddit_id": "t5_2z56t"}, {"author": "larissaeai", "body": "Dont worry. You are doing great. The main reason you dont understand sometimes is that we speak very different from how it is written and that we use informal words all the time. Try to learn some real life expressions and vocabulary to understand informal brazilian portuguese. This playlist may help https://youtube.com/playlist?list=PL9_Ot1dnUiLt6NIx9xzyujNdh0O-FO1Yc\n\nBy the way, which state are you at? Accents vary a lot in Brazil. Good luck! 💚💛💙", "created_utc": "1658173139.0", "edited": "False", "id": "igokkq3", "is_submitter": "False", "link_id": "t3_vwdoxw", "parent_id": "t3_vwdoxw", "score": "1", "subreddit": "Portuguese", "subreddit_id": "t5_2sqn7"}, {"author": "larissaeai", "body": "You can learn more about pronunciation of R in this video. Hope it helps.\nhttps://youtu.be/n9iY5o6xA_4", "created_utc": "1658073908.0", "edited": "False", "id": "igj4ghx", "is_submitter": "False", "link_id": "t3_uofyjk", "parent_id": "t3_uofyjk", "score": "1", "subreddit": "Brazil", "subreddit_id": "t5_2qmku"}, {"author": "larissaeai", "body": "My opinion about this is that trying to sound like a native is ok as long as you dont freak out about it. Because natives are exposed to the language since babies, they know collocations, grammar and pronunciation \"naturally\" and this is nice, valuable, enriching, culturally beautiful. And actually it could be superfun to practice all this, especially if you consume relatable, fun, cultural study materials. HOWEVER, this has nothing to do with perfection and absolutely nothing to do with minimising people with foreign  accents. Content that says that only natives speak the correct way for whatever reasons and that people with foreign accents sound less intelligent are toxic and are dangerously XENOPHOBIC. Of course we don't need to pay attention to that. We need to focus on the content that will leverage our learning, boost our motivation! I won't even say much about those clickbaits \"stop saying x, say blabla\" when there is no grammar error. I love learning synonyms and new expressions but that phrase to me sounds very passive aggressive 🤔. But these videos do have a lot of views so people keep using it to stand out in the industry.", "created_utc": "1658040701.0", "edited": "False", "id": "ighp0cy", "is_submitter": "False", "link_id": "t3_w0sady", "parent_id": "t3_w0sady", "score": "5", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "larissaeai", "body": "Sempre fico feliz em ver que tantas pessoas querem aprender a minha língua materna! Aprender português vai além de aprender somente a língua, isso significar conectar-se com a cultura, com as pessoas! Recomendo que você assista filmes, entrevistas, programas de entretenimento, busque assuntos que você gosta no idioma. Também acho válido aprender expressões comuns e que não se traduzem literalmente. Recomendo youtube também. Esse vídeo é um bom começo. [https://www.youtube.com/watch?v=h5gV5NcK4-w](https://www.youtube.com/watch?v=h5gV5NcK4-w)", "created_utc": "1657987888.0", "edited": "False", "id": "igeqkj6", "is_submitter": "False", "link_id": "t3_vzj9ro", "parent_id": "t3_vzj9ro", "score": "1", "subreddit": "Portuguese", "subreddit_id": "t5_2sqn7"}, {"author": "larissaeai", "body": "Dutch and Spanish. I am advanced in Spanish and beginner in Dutch. Sometimes I feel like studying French  but I wanted to become (upper)intermediate in Dutch first. My native language is pt and I never stop learning English of course. ❤️", "created_utc": "1657914673.0", "edited": "False", "id": "igb02vt", "is_submitter": "False", "link_id": "t3_vzhnbo", "parent_id": "t3_vzhnbo", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "larissaeai", "body": "Hi. You can send me a DM. I also have a YT https://youtu.be/HdKXU8oKE2o", "created_utc": "1657349042.0", "edited": "False", "id": "ifg2ofx", "is_submitter": "False", "link_id": "t3_v9mdno", "parent_id": "t3_v9mdno", "score": "1", "subreddit": "Portuguese", "subreddit_id": "t5_2sqn7"}, {"author": "larissaeai", "body": "Português é mamão com açúcar 😊\nExplanation of this expression here: https://youtu.be/HdKXU8oKE2o 😉", "created_utc": "1657348708.0", "edited": "False", "id": "ifg27w1", "is_submitter": "False", "link_id": "t3_vdth1s", "parent_id": "t3_vdth1s", "score": "2", "subreddit": "regards", "subreddit_id": "t5_6388jh"}, {"author": "larissaeai", "body": "Some expressions that you can learn that will surprise native speakers:\n\n\"Né?\" https://youtu.be/hGckVhB9wio\n\"Beleza?\" https://youtu.be/QyBHeTTeGUU\n\"Tá de sacanagem\" https://youtu.be/JSH7sOO5JdI\n\nBe respectful!", "created_utc": "1657348520.0", "edited": "False", "id": "ifg1yom", "is_submitter": "False", "link_id": "t3_vs9pf8", "parent_id": "t3_vs9pf8", "score": "1", "subreddit": "Tinder", "subreddit_id": "t5_2w7mz"}, {"author": "larissaeai", "body": "- Study a little bit every day, like 10 min.\n- Try to speak to yourself or record audio/video of yourself speaking portuguese \n- Learn within context and use materials from real life \n- Learn cultural things that are interesting for you\n\nI suggest my channel if you want 😉 \nhttps://youtu.be/HdKXU8oKE2o", "created_utc": "1657348170.0", "edited": "False", "id": "ifg1hlt", "is_submitter": "False", "link_id": "t3_vupqlt", "parent_id": "t3_vupqlt", "score": "4", "subreddit": "Portuguese", "subreddit_id": "t5_2sqn7"}, {"author": "larissaeai", "body": "There is a nice technique called 3,2,1. Pick a topic and without practice, speak about it for 3 minutes, then watch your video and see what can improved. You can search online the words/expressions you could not remember and also write main points in 2 or 3 bullet points. Then record yourself again for 2 minutes and try to say the same thing but in an improved way (better grammar, right expressions, fewer fillers). Then watch and improve again. Finally, record yourself for 1 minute. You will get surprised to see that 1 min is enough to communicate clearly if you are effective and well trained. Sometimes recording yourself for more than 5 min is just exhausting and not sustainable because at the long run you will get tired or won't have time to do proper analysis and work on the improvement/research part. In the end it can be really fun if you don't beat yourself up for making mistakes. Just keep improving and your brain will get better and better. Getting 1% better a day for a year is better than trying to improve 100% in a month and get frustrated. Enjoy speaking and acknowledge your small successes. Your brain is awesome. 💗 Peace.", "created_utc": "1657226603.0", "edited": "False", "id": "if97n8t", "is_submitter": "False", "link_id": "t3_vtr58u", "parent_id": "t3_vtr58u", "score": "11", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "larissaeai", "body": "Acho q as formas que explicaram no vídeo se encaixam como wtf, especialmente \"tá de sacanagem\"\n https://youtu.be/JSH7sOO5JdI", "created_utc": "1656966752.0", "edited": "False", "id": "iev0elb", "is_submitter": "False", "link_id": "t3_vrgg6w", "parent_id": "t3_vrgg6w", "score": "2", "subreddit": "Portuguese", "subreddit_id": "t5_2sqn7"}, {"author": "larissaeai", "body": "Acho q as formas que explicaram no vídeo se encaixam como wtf, especialmente \"tá de sacanagem\"\n https://youtu.be/JSH7sOO5JdI", "created_utc": "1656966737.0", "edited": "False", "id": "iev0de6", "is_submitter": "False", "link_id": "t3_vrgg6w", "parent_id": "t3_vrgg6w", "score": "1", "subreddit": "Portuguese", "subreddit_id": "t5_2sqn7"}, {"author": "larissaeai", "body": "Oi! Meu feedback: https://voca.ro/15asdyma5rLY", "created_utc": "1655747360.0", "edited": "False", "id": "id3140k", "is_submitter": "False", "link_id": "t3_tsnbvm", "parent_id": "t3_tsnbvm", "score": "1", "subreddit": "JudgeMyAccent", "subreddit_id": "t5_2ufiq"}, {"author": "larissaeai", "body": "Hi! I believe getting to understand basic pronunciation is a good start. My channel has some videos about it. You can check it here https://youtube.com/channel/UC0Rhnv1flgZq-cq-yvsOQjg", "created_utc": "1655741954.0", "edited": "False", "id": "id2ohb8", "is_submitter": "False", "link_id": "t3_uqz4mf", "parent_id": "t3_uqz4mf", "score": "1", "subreddit": "lisboa", "subreddit_id": "t5_2sein"}, {"author": "larissaeai", "body": "Hi! I teach brazilian portuguese pronunciation in my channel. I also have a series of videos to learn with short stories. https://youtube.com/channel/UC0Rhnv1flgZq-cq-yvsOQjg\nI hope it helps. 😊", "created_utc": "1655741701.0", "edited": "False", "id": "id2nvy8", "is_submitter": "False", "link_id": "t3_uyoj8n", "parent_id": "t3_uyoj8n", "score": "1", "subreddit": "Brazil", "subreddit_id": "t5_2qmku"}, {"author": "larissaeai", "body": "Hi! This is so nice of you to learn your family's language!  Good luck! I wish you all success. The tricky part can be pronunciation. I created a youtube channel recebtly. You can check the pronunciation and portuguese with stories videos. :) https://youtube.com/channel/UC0Rhnv1flgZq-cq-yvsOQjg\nMy accent is from Rio de Janeiro. Where is your family from?", "created_utc": "1655741417.0", "edited": "False", "id": "id2n88d", "is_submitter": "False", "link_id": "t3_vdfef9", "parent_id": "t3_vdfef9", "score": "1", "subreddit": "brasil", "subreddit_id": "t5_2qh9i"}, {"author": "larissaeai", "body": "This channel is nice.\nPlaylist for pronunciation https://youtube.com/playlist?list=PL9_Ot1dnUiLsgouGjz5_3tK17qzQnO_2g\n\nPlaylist to learn with short stories\n\nhttps://youtube.com/playlist?list=PL9_Ot1dnUiLuxQdbh7CgKWAvIxRlqBJQ1", "created_utc": "1655740812.0", "edited": "False", "id": "id2ltu7", "is_submitter": "False", "link_id": "t3_vc0190", "parent_id": "t3_vc0190", "score": "1", "subreddit": "portugal", "subreddit_id": "t5_2qmie"}, {"author": "larissaeai", "body": "Me deixou cabreiro. Fiquei cismado. And more formal: Me deixou intrigado. Me causou estranheza.", "created_utc": "1654889673.0", "edited": "False", "id": "ibw4q15", "is_submitter": "False", "link_id": "t3_v7a6wc", "parent_id": "t3_v7a6wc", "score": "1", "subreddit": "Portuguese", "subreddit_id": "t5_2sqn7"}, {"author": "larissaeai", "body": "Hi! I think 25 usd is not a rip off. :) It is ok but more than that is too much. You can learn Portuguese on youtube too to complement the lessons with your tutor and textbooks. I started a channel in case you wanna check out. Pronunciation can be tricky indeed but you will get it quick. Good luck! https://youtube.com/channel/UC0Rhnv1flgZq-cq-yvsOQjg", "created_utc": "1654887708.0", "edited": "1654889573.0", "id": "ibw0ale", "is_submitter": "False", "link_id": "t3_v8hdye", "parent_id": "t3_v8hdye", "score": "1", "subreddit": "Portuguese", "subreddit_id": "t5_2sqn7"}, {"author": "larissaeai", "body": "I think it is fine as long as the languages come from different families and you have different levels already. This is what I have been doing and it works. But of course you will end up progressing a bit slower if you don't have time for studying both daily. And most importantly... enjoy the process!", "created_utc": "1654887038.0", "edited": "False", "id": "ibvyro4", "is_submitter": "False", "link_id": "t3_v9cf6d", "parent_id": "t3_v9cf6d", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "larissaeai", "body": "Thank you!", "created_utc": "1581776058.0", "edited": "False", "id": "fhowe4a", "is_submitter": "True", "link_id": "t3_f3t0uk", "parent_id": "t1_fhm8w2v", "score": "1", "subreddit": "belgium", "subreddit_id": "t5_2qhe6"}]