[{"author": "LegisGhin", "body": "> I don't know how well it translates from English to Frisian because of the difference sentence structures and stuff, but I think it does Dutch to Frisian quite well.\n\nIf it does Dutch to Frisian quite well, then it must also do English to Frisian quite well, because almost all languages on Google Translate are translated through English. If you ask it to translate from Dutch to Frisian it first does Dutch → English, and then English → Frisian.\n\nThat's also why if you ask it to translate \"gelijkspel\" from Dutch to French, it gives you \"dessiner\" (to draw, like with a pencil or crayons).\n\ngelijkspel → draw → dessiner.", "created_utc": "1659986003.0", "edited": "False", "id": "ijha157", "is_submitter": "False", "link_id": "t3_wi2fqo", "parent_id": "t1_ijdej4k", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "LegisGhin", "body": "Sukceson, kaj amuziĝu! :)", "created_utc": "1659971873.0", "edited": "False", "id": "ijg8t77", "is_submitter": "False", "link_id": "t3_wi2fqo", "parent_id": "t1_ijabr56", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "LegisGhin", "body": "Depends on what kind of immersion you mean.\n\nIf it's listening to podcasts and music, you can start on day one. Even if you don't understand a single word, it's a way for your brain to get used to the way your target language sounds or which intonation speakers use. It's great to put on in the background when you're doing dishes or other chores like that.\n\nI wouldn't change your phone to your target language until you have a basic grasp of what the most important things mean. Once you do it's a decent way to learn and reinforce part of your vocabulary, but before then it's mostly hitting your head against a wall without learning much.", "created_utc": "1659196157.0", "edited": "1659196372.0", "id": "ii9pog2", "is_submitter": "False", "link_id": "t3_wb6o1u", "parent_id": "t3_wb6o1u", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "LegisGhin", "body": "I think it should be Ditto", "created_utc": "1658198873.0", "edited": "False", "id": "igq8z4a", "is_submitter": "False", "link_id": "t3_w1hc41", "parent_id": "t1_igl85mm", "score": "3", "subreddit": "tokipona", "subreddit_id": "t5_2s5z5"}, {"author": "LegisGhin", "body": "sina pona.\n\n...\n\nIt works better in context.", "created_utc": "1655814489.0", "edited": "False", "id": "id6ahg9", "is_submitter": "False", "link_id": "t3_vgqfqi", "parent_id": "t3_vgqfqi", "score": "2", "subreddit": "tokipona", "subreddit_id": "t5_2s5z5"}, {"author": "LegisGhin", "body": "sina mama mi? anu seme?", "created_utc": "1655814433.0", "edited": "False", "id": "id6ae0o", "is_submitter": "False", "link_id": "t3_vgqfqi", "parent_id": "t1_id5q502", "score": "2", "subreddit": "tokipona", "subreddit_id": "t5_2s5z5"}, {"author": "LegisGhin", "body": "or \"tenpo (mun) kule\", since \"kule\" is often used for gay/LGBT+\n\n\"tenpo (mun) kese\" is also an option, if you like nimi sin. kese is a rare word for LGBT+", "created_utc": "1654260450.0", "edited": "False", "id": "ib14d8u", "is_submitter": "False", "link_id": "t3_v3qgbu", "parent_id": "t1_ib0g331", "score": "5", "subreddit": "tokipona", "subreddit_id": "t5_2s5z5"}, {"author": "LegisGhin", "body": "Also Japanese え, Esperanto e, and the equivalent in almost every other language that only has 5 monophthong vowel phonemes.", "created_utc": "1647095550.0", "edited": "False", "id": "i0de44o", "is_submitter": "False", "link_id": "t3_tby3x3", "parent_id": "t1_i0akqk3", "score": "3", "subreddit": "tokipona", "subreddit_id": "t5_2s5z5"}, {"author": "LegisGhin", "body": "Technically pu says [e̞] which is right in the middle of [e] and [ɛ].", "created_utc": "1647092979.0", "edited": "False", "id": "i0d98ks", "is_submitter": "False", "link_id": "t3_tby3x3", "parent_id": "t1_i0af7xu", "score": "4", "subreddit": "tokipona", "subreddit_id": "t5_2s5z5"}, {"author": "LegisGhin", "body": "Tiu rekomendo de Bertilo estis de antaŭ 15 jaroj. Multe povas ŝanĝiĝi en 15 jaroj. En la sama periodo la priskriboj de la vorto \"ri\" en PMEG iris de \"senŝanca ideo\" al \"iomete enuziĝinta sed ne normala\" al propra sekcio sen malrekomendoj.\n\nEstas fakto, ke la formo \"Kievo\" estas pli tradicia kaj pli konata en Esperanto. Ankaŭ estas fakto, ke la formo \"Kijivo\" jam aperis en kelkaj vortaroj, kaj ke ĝi estas preferata de iuj ukrainaj esperantistoj (inkluzive de la organiza teamo de la nuligita IJK 2021 \"en Kijivo\").\n\nAmbaŭ formoj ekzistas en la lingvo. Parolantoj rajtu elekti laŭ sia propra prefero, simile al kiel oni rajtas elekti inter \"Polujo\" aŭ \"Pollando\", \"teĥnologio\" aŭ \"teknologio\", ktp.", "created_utc": "1646711638.0", "edited": "False", "id": "hzsnzlg", "is_submitter": "False", "link_id": "t3_t8mtpr", "parent_id": "t1_hzox48l", "score": "3", "subreddit": "Esperanto", "subreddit_id": "t5_2qo5v"}, {"author": "LegisGhin", "body": "{Gundam 00} is about a small group of guerilla soldiers that declare war on all major governments on Earth, with just four mechas that use technology ahead of their time. Their goal being the complete eradication of war through the use of war itself.", "created_utc": "1644115665.0", "edited": "1644115921.0", "id": "hvrwnyh", "is_submitter": "False", "link_id": "t3_sknfrx", "parent_id": "t3_sknfrx", "score": "1", "subreddit": "Animesuggest", "subreddit_id": "t5_2ssl0"}, {"author": "LegisGhin", "body": "Great thorough comparison!\n\nI totally agree about the first episode. When people start out with Brotherhood, I recommend they just completely skip the first episode.\n\nAnd if you watch both series, consider taking a break of a few months before you jump into the other series, especially when going from Brotherhood to '03. A break in between makes it easier to enjoy each show on its own merits. But of course, if you're more interested in comparing the differences between the two, watch them back to back.\n\n(edit: forgot a word)", "created_utc": "1643479055.0", "edited": "1643497661.0", "id": "huqu84o", "is_submitter": "False", "link_id": "t3_sepsef", "parent_id": "t1_hulsee4", "score": "2", "subreddit": "Animesuggest", "subreddit_id": "t5_2ssl0"}, {"author": "LegisGhin", "body": "While it's not at all the type of anime you asked for in this thread, you may want to check out {Log Horizon}.\n\nIt's an isekai where tens of thousands of MMO players wake up in their avatars' bodies in a world just like the MMO. Which sounds like your typical \"stuck in a videogame\" plot, except they're not in a videogame. They're in a fantasy world that has all the RPG game mechanics from the video game, but is a real living world. A lot of the plot and worldbuilding revolves around exploring the implications that this has.\n\nThe isekai'd people start out treating it like it's all a videogame, not caring about death because they'll respawn anyway, treating NPCs like they're not intelligent, etc. But a few episodes in the main characters find out that they can combine RPG mechanics with \"IRL mechanics\" in clever ways, and the focus shifts to economics, politics, building an organized society, and trying to figure out how the world works.\n\nIIRC it does have the obligatory two or so girls that have a crush on the male main character, but unlike the regular harem-heavy isekai shows, there's very little focus on that.", "created_utc": "1643291988.0", "edited": "False", "id": "huft6jm", "is_submitter": "False", "link_id": "t3_sbpnv7", "parent_id": "t1_hu2k0d2", "score": "1", "subreddit": "Animesuggest", "subreddit_id": "t5_2ssl0"}, {"author": "LegisGhin", "body": "This is true. But tokiponizations are based much more on phonetics than phonemics. (That is, the way it's actually pronounced, not how speakers conceptualize the sounds they make.) Even if it's phonemically /a.a/, if it's pronounced [aː], that's usually what counts.\n\nAs a non-native Japanese speaker I tend to tokiponize diphthong-like sounds in Japanese as two syllables in Toki Pona (e.g. Daichi → Tawisi) to conserve the Japanese structure, but I feel like I can't justify that for long vowel sounds, because it's completely valid in Toki Pona to pronounce any vowel as a long vowel. So for example, I'd do Tarō → Talo, because [ˈtaloː] is one correct way to pronounce Talo in Toki Pona, which is much closer to the original pronunciation of the Japanese name than Talojo.", "created_utc": "1640399065.0", "edited": "False", "id": "hpvjnbs", "is_submitter": "False", "link_id": "t3_rnl6zx", "parent_id": "t1_hpuvr0m", "score": "3", "subreddit": "tokipona", "subreddit_id": "t5_2s5z5"}, {"author": "LegisGhin", "body": "Ook omdat de serie eerder in Japan is uitgezonden dan in Nederland, en hij (onder andere) voor de Japanse markt gemaakt is.", "created_utc": "1634814196.0", "edited": "False", "id": "hhh6j5k", "is_submitter": "False", "link_id": "t3_qcaals", "parent_id": "t1_hhfjcsj", "score": "1", "subreddit": "thenetherlands", "subreddit_id": "t5_30hrx"}, {"author": "LegisGhin", "body": "Nu, ja ekzistas tre multaj maljunuloj, kiuj parolas Esperanton. Sed plejparto el ili ne uzas Reddit. Reddit estas plejparte uzata de la pli junaj generacioj, ne nur en r/Esperanto sed ĝenerale.\n\nOni povas trovi multajn maljunajn esperantistojn en Facebook, ekzemple.", "created_utc": "1633718592.0", "edited": "False", "id": "hfvwd54", "is_submitter": "False", "link_id": "t3_q3a8l6", "parent_id": "t1_hfr8nrq", "score": "1", "subreddit": "Esperanto", "subreddit_id": "t5_2qo5v"}, {"author": "LegisGhin", "body": "Oops, sorry, I skimmed over that part.\n\nAnd yeah, of course. I'm a Wikipedia volunteer myself, and I already considered maybe expanding that article some time. I didn't mean to critique the article as much as give the readers of this thread additional information that I thought was relevant.\n\nThe critiquey tone was more to make clear that people should not use the article as their only source, because it isn't a totally up to date overview of the current state of affairs.", "created_utc": "1625606304.0", "edited": "False", "id": "h4a6rp9", "is_submitter": "False", "link_id": "t3_oelunp", "parent_id": "t1_h48fdxd", "score": "2", "subreddit": "Esperanto", "subreddit_id": "t5_2qo5v"}, {"author": "LegisGhin", "body": "> it turned out that there was no one in the group who actually wanted the pronoun to refer to themselves, just to some nebulous other. (...) Post in the Esperanto forums across all social media that your pronoum is *ri*. Go forth and conquer the language, go where the armchair generals will never go.\n\nProudly declaring \"my pronoun is ri\" helps, but that's still more talking *about* the pronoun than actual usage \"in the wild\". Most helpful would be to use *ri* in situations where the topic of discussion isn't about \ngender or pronouns at all.\n\nMany of those you call armchair generals do exactly that. I know a fair share of people whose pronoun isn't *ri*, but they do use it whenever someone's gender is unknown, or when talking about hypothetical people. (e.g. \"se iu serĉos min, diru al ri, ke mi iris al la gufujo\")", "created_utc": "1625578243.0", "edited": "False", "id": "h48hejv", "is_submitter": "False", "link_id": "t3_oelunp", "parent_id": "t1_h47jscm", "score": "5", "subreddit": "Esperanto", "subreddit_id": "t5_2qo5v"}, {"author": "LegisGhin", "body": "> I haven’t spoken to many non-binary Esperanto-speakers, but I wouldn’t be surprised if [ri] is the pronoun many of them prefer.\n\nI know a fair number of non-binary Esperantists, both IRL and online. In my experience \"ri\" is used almost universally by them. Some of them say they would have preferred another pronoun (like \"gi\"), but they don't use them because \"ri\" is already well established and widely known, and competing standards will likely only slow down the acceptance of a gender neutral pronoun.\n\n\"Ŝli\" seems to be almost universally disliked by non-binary people, because it's too rooted in the traditional gender binary, i.e. it hints too much at \"ŝi aŭ li\".\n\nLast year Markos Kramer published [an empirical study](https://lingvakritiko.com/2020/05/12/la-efektiva-uzado-de-seksneutralaj-pronomoj-lau-empiria-esplorstudo/) on the current usage of gender neutral pronouns in Esperanto. It found among other things that in all age groups younger than 50 years old, about 90% of Esperanto speakers know what \"ri\" means and can explain how it's used, and about 70% in the same age groups report using it themselves in at least some situations. For ages 60 and up those numbers are closer to 70% and 25% respectively", "created_utc": "1625575886.0", "edited": "False", "id": "h48d93l", "is_submitter": "False", "link_id": "t3_oelunp", "parent_id": "t1_h484dv8", "score": "4", "subreddit": "Esperanto", "subreddit_id": "t5_2qo5v"}, {"author": "LegisGhin", "body": "It's a decent overview of the history, but it's not totally up to date with the current state of affairs.\n\nIt presents the masculine suffix iĉ as if all people who use it also use \"patro\" and \"frato\" and similar words as gender neutral. However, this group is a pretty small minority, and most users of iĉ use it only with words that are already gender neutral (e.g. \"amikiĉo\") or, more commonly, use it mainly as a standalone word root in \"iĉo\" (a male person or animal) and \"iĉa\" (male, masculine), analogously to the already widely accepted \"ino\" and \"ina\".\n\nIt also doesn't at all mention recent attempts by Cyril Brosch and Markos Kramer to propose a new set of gender neutral word roots (for parent, sibling, spouse, etc.) which can be used instead of the traditional gendered words by use of gendered suffixes. (e.g. parento / pajo = parent, parentino /panjo = mother, parentiĉo / paĉjo = father, parentipo / papjo = non-binary parent) An overview of Brosch's set of gender-related proposals can be found [here](http://www.cyrilbrosch.net/wb/pages/esperanto/gi-parentismo.php) on his website.", "created_utc": "1625574207.0", "edited": "False", "id": "h48anv1", "is_submitter": "False", "link_id": "t3_oelunp", "parent_id": "t1_h47k5pu", "score": "4", "subreddit": "Esperanto", "subreddit_id": "t5_2qo5v"}, {"author": "LegisGhin", "body": "🎅🏼 \"o o o\"\n\n😈 \"e e e\"", "created_utc": "1625572230.0", "edited": "False", "id": "h487u2n", "is_submitter": "False", "link_id": "t3_oe6hlq", "parent_id": "t1_h45rsux", "score": "6", "subreddit": "tokipona", "subreddit_id": "t5_2s5z5"}, {"author": "LegisGhin", "body": "\"sewi\" on its own is also used in Sonja's official book. For example in this translation of a quote from the Qur'an:\n> قُلْ هُوَ اللَّهُ أَحَدٌ اللَّهُ الصَّمَدُ لَمْ يَلِدْ وَلَمْ يُولَدْ وَلَمْ يَكُنْ لَهُ كُفُوًا أَحَدٌ\n\n> o toki e ni: \"sewi li wan. sewi li wawa ale. ona li mama ala, li jo ala e mama. ijo ala li sama ona.\"\n\nIt's also worth noting Sonja wrote this long ago about tokiponizing names:\n\n> If necessary, you may want to tweak a word to avoid a potentially misleading homonym. (Example: Allah becomes jan sewi Ila, not jan sewi Ala—no God). If possible, use a related word in the source language rather than introducing an arbitrary change. (In Arabic, Allah actually means the God, whereas Illah means God.)\n\nSo you have four options for saying \"Allah\" in Toki Pona: sewi, jan sewi, sewi Ila, jan sewi Ila", "created_utc": "1625455222.0", "edited": "False", "id": "h43bi0g", "is_submitter": "False", "link_id": "t3_odac5v", "parent_id": "t1_h408b49", "score": "5", "subreddit": "tokipona", "subreddit_id": "t5_2s5z5"}, {"author": "LegisGhin", "body": "English has an unmistakably Germanic core, with a lot of other influences layered superficially on top. It's definitely Germanic, but also definitely the odd one out in the family.\n\nIt also doesn't help that English literally almost died out one time in the middle ages.\n\nWhen England was under Norman rule, all the people that had any power spoke a version of Old French, and only the country hicks and other common folk spoke Old English. But then the Normans lost their land in France, and it slowly became more practical to speak the local language than a language of a region where you have no land and little power, so more and more of the upper class started learning English as well.\n\nHowever, they only kinda half learned English. The upper class spoke it with simplified grammar (because who needs case systems and a dozen words for \"the\") and used a lot of French words mixed in with the original English ones. This weird simplified version of the language then became standard, and thus the medieval language we now call Middle English was born from the ashes of Old English.\n\nThis is exactly why English is still the least typically Germanic of all the Germanic languages.", "created_utc": "1624070221.0", "edited": "False", "id": "h2a6ria", "is_submitter": "False", "link_id": "t3_o207ea", "parent_id": "t1_h26rt86", "score": "1", "subreddit": "Esperanto", "subreddit_id": "t5_2qo5v"}, {"author": "LegisGhin", "body": ">I'm tired of the burden being entirely on me.\n\nDoes he know you feel this way about the situation? If you haven't told him this almost literally, there's a good chance he isn't aware of it. Maybe try talking about it.\n\nUntil this matter is resolved, you can also consider only having non-penetrative sex or going back to using a condom. Those should reduce the burden that is weighing on you, and are also perfectly fine and fun ways to have sex.\n\nOr if you prefer not to do those, you could also ask him to always pull out before climaxing. (The pull out method on its own is of course unreliable and very easy to mess up, but it [does actually prevent pregnancy when done properly.](https://www.youtube.com/watch?v=VUGvxiNTjDU) When you combine the pull out method with the pill, your risk should be at least five times lower than by only using the pill, and *much* lower with practice.)\n\nJust my thoughts as someone who is definitely not qualified to give advice. Take it with a grain of salt. And also take care. :) I believe you'll get through this, and genuinely hope the best for you.", "created_utc": "1622757910.0", "edited": "1622758610.0", "id": "h0hshel", "is_submitter": "False", "link_id": "t3_nr1qnw", "parent_id": "t1_h0fwkdu", "score": "3", "subreddit": "TwoXChromosomes", "subreddit_id": "t5_2r2jt"}, {"author": "LegisGhin", "body": "La celo de la alfabeto neniel estas anstataŭi la latinan alfabeton. Ĝi estas amuzaĵo por tiaj nerdoj, kiuj ŝatas alfabetojn. Krome ĝi havas kelkajn praktikajn avantaĝ(et)ojn por propra uzado, ekzemple, [multe pli facilas skribi ege malgrande](https://amp.reddit.com/r/Esperanto/comments/2hayo5/etskribado_en_la_%C5%9Dava_alfabeto/) per la ŝava alfabeto.", "created_utc": "1622549078.0", "edited": "False", "id": "h06n805", "is_submitter": "False", "link_id": "t3_nmpgw6", "parent_id": "t1_gzuqjet", "score": "2", "subreddit": "Esperanto", "subreddit_id": "t5_2qo5v"}, {"author": "LegisGhin", "body": "En ĉiu brusto estas sia gusto!\n\nG-board perfektas nur, se oni volas qwerty-bazitan klavaron, ĉe kiu mankas neesperantaj literoj. Se oni kutimas uzi azerty (kiel en franclingvaj landoj) aŭ qwertz (kiel en germanlingvaj landoj), la stranga loko de la A aŭ la Z jam estas ĝena.\n\nKrome, mi mem preferas facile povi tajpi neesperantajn vortojn kaj nomojn, kiuj enhavas literon W aŭ Q aŭ kion ajn. Dank' al la Android-aplikaĵo Multiling O, mi uzas la saman memfaritan qwerty-klavaranĝon por ĉiuj 5 lingvoj kiujn mi parolas, kaj mi tajpas esperantajn literojn x-sisteme. Tio estas pli facila por mi ol kiam mi devas tajpi la literon Y alimaniere depende de la klavara lingvo.\n\n---\n\ntl;dr - Ekzistas multaj diversaj kialoj por voli alian klavaron por tajpi Esperanton ol G-board. G-board estas tre bona por multaj homoj, sed ja bonas ke ekzistas aliaj ebloj por diversaj preferoj.", "created_utc": "1622466571.0", "edited": "False", "id": "h02u97g", "is_submitter": "False", "link_id": "t3_no6ckc", "parent_id": "t1_h00r22p", "score": "1", "subreddit": "Esperanto", "subreddit_id": "t5_2qo5v"}, {"author": "LegisGhin", "body": "inb4 someone says \"that's a toad, not a frog\":  \n\n\nThe distinction between toad and frog is actually mostly arbitrary and non-scientific. In scientific classification, all toads are frogs and some frogs are toads. So yes, technically it's definitely a frog.", "created_utc": "1622077411.0", "edited": "False", "id": "gzl26d2", "is_submitter": "False", "link_id": "t3_nltivj", "parent_id": "t1_gzkrhgy", "score": "10", "subreddit": "mildlyinteresting", "subreddit_id": "t5_2ti4h"}, {"author": "LegisGhin", "body": "Jes, bonaj korektoj. :)\n\nMi havas unu aldonaĵon: \"la **veturo** hejmen\" verŝajne plej proksimas al tio, kion OP celis diri per \"la stiro hejmen\".\n\nAl OP: \"veturo\" estas vojaĝo aŭ alia translokiĝo, kiun oni faras specife per veturilo sur tero aŭ akvo (aŭto, ŝipo, trajno, ktp). Ial oni ne uzas \"veturi\" kaj \"veturo\" por vojaĝoj tra aero aŭ kosmo.", "created_utc": "1622027711.0", "edited": "False", "id": "gzi1cb4", "is_submitter": "False", "link_id": "t3_nl0dgl", "parent_id": "t1_gzgr477", "score": "3", "subreddit": "Esperanto", "subreddit_id": "t5_2qo5v"}, {"author": "LegisGhin", "body": "Yes, you're right, but vector_9260 is also right in that \"a a a\" probably became so widespread because it's the best possible tokiponization of \"hahaha\". It's a successful expression because it works on multiple levels.", "created_utc": "1622026372.0", "edited": "False", "id": "gzhzk2a", "is_submitter": "False", "link_id": "t3_nl7i37", "parent_id": "t1_gzhgpsz", "score": "5", "subreddit": "tokipona", "subreddit_id": "t5_2s5z5"}, {"author": "LegisGhin", "body": "Men who dismiss entire groups of women as \"attention seekers\" based on the way they dress and groom themselves are also likely to think women dress up and wear makeup primarily to appeal to men. And people who spew totally unscientific nonsense about evolution and \"the natural way of things\" to support their prejudices, are likely to have more weird beliefs about how men and women naturally behave one way or another.\n\nThese specific examples aren't really misogyny in and of themselves – more like ignorance – but with people who sincerely believe stuff like this, these are frequently symptoms of other more misogynistic convictions and habits of thought that are usually deeply ingrained and hard to correct. Not always, but often enough to be a warning flag.", "created_utc": "1621313572.0", "edited": "False", "id": "gyj91j1", "is_submitter": "False", "link_id": "t3_ndxjur", "parent_id": "t1_gygjf7l", "score": "1", "subreddit": "TwoXChromosomes", "subreddit_id": "t5_2r2jt"}, {"author": "LegisGhin", "body": "OP doesn't at all criticize having a preference. It's about the reasons some men give for said preference.\n\nA simple \"it's not my type\" is a perfectly fine response. But if they say \"women with brightly colored hair are attention seekers\" or \"it's only natural to be repulsed by bright colors because they signal poison in nature\", that can be a sign of internalized problematic beliefs.", "created_utc": "1621264594.0", "edited": "False", "id": "gygcft3", "is_submitter": "False", "link_id": "t3_ndxjur", "parent_id": "t1_gyg5hpu", "score": "3", "subreddit": "TwoXChromosomes", "subreddit_id": "t5_2r2jt"}, {"author": "LegisGhin", "body": "It doesn't even have to be similar to your own name, if you want. Case in point, there's a guy mentioned in pu whose name is Joop (pronounced \"yope\"), but he goes by jan Mimoku.\n\nIt can be anything you like. Really the only hard rule is that the name follows the phonological rules.", "created_utc": "1619383617.0", "edited": "False", "id": "gvuv0vq", "is_submitter": "False", "link_id": "t3_my0nhh", "parent_id": "t1_gvtzdcg", "score": "2", "subreddit": "tokipona", "subreddit_id": "t5_2s5z5"}, {"author": "LegisGhin", "body": "IIRC /dʒ/ usually becomes s, so e.g. John becomes San or Son, depending on the accent. For affricates you use the fricative, not the plosive. Strict tokiponization of /dʒunjʌ/ would be either Suna or Sunija, I think.\n\nBut anyway, I like Suni. It's a good choice. :)", "created_utc": "1619006177.0", "edited": "False", "id": "gvbb56w", "is_submitter": "False", "link_id": "t3_muuc8n", "parent_id": "t1_gvb371o", "score": "3", "subreddit": "tokipona", "subreddit_id": "t5_2s5z5"}, {"author": "LegisGhin", "body": "It's aluminium with the i (or something similar without the -um) in most languages. From German to Arabic to Japanese.\n\nNorth American English is one of few exceptions.", "created_utc": "1614776867.0", "edited": "False", "id": "gpj2n07", "is_submitter": "False", "link_id": "t3_lvte0v", "parent_id": "t1_gphxoni", "score": "3", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "LegisGhin", "body": "En sufiĉe multaj neeŭropaj lingvoj (kiuj prenis la nomon el la angla).\n\nindonezie: Polandia, ĉine: 波蘭 (Bōlán), japane: ポーランド (Pōrando), koree: 폴란드 (Pollandeu), hindie: पोलैंड (Polaiṇḍ)", "created_utc": "1614251899.0", "edited": "False", "id": "goozuo8", "is_submitter": "False", "link_id": "t3_lpw5my", "parent_id": "t1_goefrd7", "score": "2", "subreddit": "Memeoj", "subreddit_id": "t5_3h3q1"}, {"author": "LegisGhin", "body": "Yeah, but in Esperanto \"ameti\" (olin lili) is rather different than \"ŝati\" (to like). First, with \"ami\" the suffix -et would imply a certain degree of reservedness (to love _only_ to a smaller degree), and second, Esperanto is one of many languages where it's uncommon to use the verb for \"to love\" for liking something a lot. (Not counting beginners, who do often say \"mi amas muzikon\" instead of \"mi tre ŝatas / ŝategas muzikon\". But this is much more rare among advanced speakers.)\n\nIt's also worth noting that Esperanto has \"plaĉi\" as an common alternative to \"ŝati\", which works exactly—word for word—as \"pona tawa\" in Toki Pona. (tio plaĉas al mi = ni li pona tawa mi = that is pleasing/good to me)\n\nSo, tl;dr, I have the feeling that from an Esperanto point of view \"ni li pona tawa mi\" makes more sense than \"mi olin lili e ni\".", "created_utc": "1613651849.0", "edited": "False", "id": "gnvo4w6", "is_submitter": "False", "link_id": "t3_lmeccg", "parent_id": "t1_gnusmwp", "score": "3", "subreddit": "tokipona", "subreddit_id": "t5_2s5z5"}, {"author": "LegisGhin", "body": "I'm afraid this isn't the kind of situation where hard facts alone are enough. Facts aren't at the root of the problem.\n\nEvidence has shown that the best way to change someone's mind is to first listen to them and make them feel that their feelings and concerns are heard. Silencing them is the exact opposite of that. It will limit the spread of an opinion, but people who are already convinced will only dig themselves deeper in their trench.\n\nEngaging them with facts alone isn't much better. They'll go on the defensive, and feel like it's a debate that they can win with counter arguments. Especially if it's a conspiracy theory, any factual argument against the conspiracy theory is to them just further proof of a conspiracy to cover up the real truth.\n\nTo convince them, you need to address their fears and concerns, and their feeling of powerlessness in the current system.", "created_utc": "1611235546.0", "edited": "False", "id": "gk23tz1", "is_submitter": "False", "link_id": "t3_l1cfkp", "parent_id": "t1_gk1wwly", "score": "1", "subreddit": "politics", "subreddit_id": "t5_2cneq"}, {"author": "LegisGhin", "body": "Gratulon! Bona laboro\n\nSe vi ankoraŭ ne faris, iru al [afterduolingo.com](http://www.afterduolingo.com/) por legi MULTAJN ideojn pri tio, kion vi povas fari per kaj pri Esperanto post Duolingo. :)", "created_utc": "1610762822.0", "edited": "False", "id": "gjetahl", "is_submitter": "False", "link_id": "t3_kxfdll", "parent_id": "t3_kxfdll", "score": "2", "subreddit": "Esperanto", "subreddit_id": "t5_2qo5v"}, {"author": "LegisGhin", "body": "Mi ne certas, ĉu vi celis ĉi tion aŭ ion alian, sed...\n\nEn **Facebook** estas esperanta grupo por ŝatantoj de Star Trek [ĉi tie](https://www.facebook.com/groups/429290141000734/?ref=share).\n\nEstas ankaŭ multaj tiaj grupoj en **Telegram**, troveblaj ĉe [telegramo.org](https://telegramo.org/), ekzemple grupo pri [animeoj kaj mangaoj](https://sakuroj.telegramo.org/), pri [videoludoj](https://videoludemuloj.telegramo.org/), pri [tabloludoj](https://ludoj.telegramo.org/), pri [felanoj](https://felanoj.telegramo.org/) (furries), pri [Rick and Morty](https://rickandmorty.telegramo.org/), kaj pli.", "created_utc": "1609953108.0", "edited": "False", "id": "gibkpge", "is_submitter": "False", "link_id": "t3_krdoh6", "parent_id": "t3_krdoh6", "score": "1", "subreddit": "Esperanto", "subreddit_id": "t5_2qo5v"}, {"author": "LegisGhin", "body": "I'm not _quite_ sure the program is still active, but you can try [Ekparolu at edukado.net](https://edukado.net/ekparolu/prezento). A free service that matches Esperanto learners with trained volunteers to video chat with.\n\nClick on \"registriĝi kiel nevo/nevino\" and register an account to join.", "created_utc": "1609159019.0", "edited": "False", "id": "gha7yx4", "is_submitter": "False", "link_id": "t3_kl5g4h", "parent_id": "t3_kl5g4h", "score": "3", "subreddit": "Esperanto", "subreddit_id": "t5_2qo5v"}, {"author": "LegisGhin", "body": "L' is _sometimes_ used in prose as well, to give a poetic flair. For example in the title \"La mastro de l' ringoj\" (Esperanto version of LotR).\n\nI sometimes (very rarely) use poetic Esperanto in a tongue-in-cheek way to add feigned poetic weight, e.g. \"Mi iras dormi.\" \"Ve, ĉu jam?\" \"La ĉirkaŭbrako de l' lit' allogas tro.\"\n\nBut that being said, poetic Esperanto in prose should be used very sparingly.", "created_utc": "1608741220.0", "edited": "False", "id": "ggt58sl", "is_submitter": "False", "link_id": "t3_kil5ot", "parent_id": "t1_ggrlc1m", "score": "1", "subreddit": "Esperanto", "subreddit_id": "t5_2qo5v"}, {"author": "LegisGhin", "body": "L' is actually most often used not _before_ a vowel, but _after_ a vowel. Usually after a preposition.\n\nde l', pri l', ĉe l', tra l', pro l', etc.\n\nThe l' being phonetically more often grouped with the previous than the next word is perhaps also one of the reasons why there's usually a space after l', unlike e.g. in French (where it's very much a contraction with the following word).\n\nAnd as others pointed out, this is used almost exclusively in poetry and songs, sometimes in titles of books and such, and in some rare cases in other places to give a poetic flare.", "created_utc": "1608739433.0", "edited": "1608739642.0", "id": "ggt1wzo", "is_submitter": "False", "link_id": "t3_kil5ot", "parent_id": "t1_ggsokft", "score": "2", "subreddit": "Esperanto", "subreddit_id": "t5_2qo5v"}, {"author": "LegisGhin", "body": "The one on Reddit not a regular post but a \"wiki post\", which is meant for being updatable over time. But it seems only the mod of that subreddit is able to edit it, so it depends on one person updating it.", "created_utc": "1608723731.0", "edited": "False", "id": "ggsfe71", "is_submitter": "False", "link_id": "t3_ki2nxu", "parent_id": "t1_ggs3sga", "score": "2", "subreddit": "Esperanto", "subreddit_id": "t5_2qo5v"}, {"author": "LegisGhin", "body": "There's lists by various other people as well. For example [one on Reddit](https://reddit.com/r/videoludado/w/ludoj), the curator list [Ludoj en Esperanto](https://store.steampowered.com/curator/38919824/) on Steam, and [@esperantaj_ludoj](https://www.instagram.com/esperantaj_ludoj/) on Instagram.", "created_utc": "1608689959.0", "edited": "False", "id": "ggr9it5", "is_submitter": "False", "link_id": "t3_ki2nxu", "parent_id": "t1_ggoqs69", "score": "2", "subreddit": "Esperanto", "subreddit_id": "t5_2qo5v"}, {"author": "LegisGhin", "body": "No single method is enough to learn a language well, be it Duolingo or Lernu. Once you reach some degree of understanding of grammar and vocab, it's always a good idea to go out and use the language for real. Be it by watching videos, listening to podcasts, reading texts, or (best of all) having simple conversations in a chatroom or on video chat.\n\nAs for chatrooms, there are more Esperanto chatrooms than you could ever need on Telegram. There's a long list with Esperanto chatrooms on telegramo.org. For beginners I'd recommend [the group for Duolingo users](https://duolingo.telegramo.org), and [the bilingual English-Esperanto group](https://en.telegramo.org). (Or bilingual groups of whatever other languages you speak well. There's a very long list at the end of the telegramo.org main page.)", "created_utc": "1608294161.0", "edited": "False", "id": "gg8tgs8", "is_submitter": "False", "link_id": "t3_kf7iex", "parent_id": "t1_gg7hvki", "score": "2", "subreddit": "Esperanto", "subreddit_id": "t5_2qo5v"}, {"author": "LegisGhin", "body": "> Coco Ichibanya\n\nlol, nice punny name for a restaurant chain from Japan. \"Koko ichiban ya\" is Kansai dialect for \"this place is the best!\" but the -ya also means shop.", "created_utc": "1607994641.0", "edited": "False", "id": "gfvfzkz", "is_submitter": "False", "link_id": "t3_kczw2d", "parent_id": "t1_gfu5o47", "score": "1", "subreddit": "food", "subreddit_id": "t5_2qh55"}, {"author": "LegisGhin", "body": "[Obligatory link to CGP Grey's video on continents](https://youtu.be/3uBcq1x7P34)", "created_utc": "1607702827.0", "edited": "False", "id": "gfei5ct", "is_submitter": "False", "link_id": "t3_kai6m7", "parent_id": "t1_gfbk8of", "score": "2", "subreddit": "politics", "subreddit_id": "t5_2cneq"}, {"author": "LegisGhin", "body": "_Technically_ \"pilin\" does not come from \"feeling\" but from \"feel him\", through the Tok Pisin \"pilim\". (The suffix -im marks transitive verbs in Tok Pisin.)\n\nSame deal with \"lukin\".", "created_utc": "1607604081.0", "edited": "False", "id": "gf9slnz", "is_submitter": "False", "link_id": "t3_k9s4vi", "parent_id": "t1_gf7k8m1", "score": "1", "subreddit": "tokipona", "subreddit_id": "t5_2s5z5"}, {"author": "LegisGhin", "body": "\"Aeroplano\" does exist, but nowadays it's very rare, yeah. ReVo calls it an archaism.\n\nTechnically \"aviadilo\" can refer to any flying machine that is heavier than air. (E.g. airplanes and helicopters. Not heavier than air being balloons and zeppelins.) \"Aeroplano\" specifically refers to the type with fixed (mostly) rigid wings. But in practice very few people use \"aviadilo\" for helicopters, and it has become synonymous with \"aeroplano\", pushing the latter out of use.", "created_utc": "1607602379.0", "edited": "False", "id": "gf9qmob", "is_submitter": "False", "link_id": "t3_kaavys", "parent_id": "t1_gf9lr00", "score": "13", "subreddit": "Esperanto", "subreddit_id": "t5_2qo5v"}, {"author": "LegisGhin", "body": "Enkonduki novan vorton laŭ bezono eĉ tute kongruas al la intencoj de la farintoj de la Fundamento. Jen citaĵo el la Bulonja Deklaracio, la unua formala deklaro pri tio, ke la Fundamento estu la gvida dokumento de la lingvo Esperanto:\n\n>Ĉiun ideon, kiu ne povas esti oportune esprimata per tiu materialo, kiu troviĝas en la «Fundamento de Esperanto», ĉiu esperantisto havas la rajton esprimi en tia maniero, kiun li trovas la plej ĝusta, tiel same, kiel estas farate en ĉiu alia lingvo.", "created_utc": "1607101840.0", "edited": "False", "id": "gem2gcp", "is_submitter": "False", "link_id": "t3_k54xx7", "parent_id": "t1_gehdnwz", "score": "2", "subreddit": "Esperanto", "subreddit_id": "t5_2qo5v"}, {"author": "LegisGhin", "body": "\"Me parolas Esperanto\", klare estas ŝanĝo de la gramatiko. Sed la vortoj \"iĉo\" kaj \"iĉa\" ne estas tiel. Ili nenion ŝanĝas aŭ forprenas de la jam anstaŭe ekzistanta Esperanto. Ili nur aldonas. Simile al la ekesto de vortoj kiel \"gejo\" aŭ \"podkasto\" en Esperanto.\n\nMultaj uzas \"gejo\", ĉar en praktika uzado ĝi estas fojfoje pli oportuna ol \"samseksemulo\". Simile, iuj uzas \"iĉo\" ĉar ili opinias ĝin pli oportuna ol \"virseksulo\" aŭ \"viro aŭ knabo\".", "created_utc": "1607100595.0", "edited": "False", "id": "gelzuao", "is_submitter": "False", "link_id": "t3_k54xx7", "parent_id": "t1_geeavmn", "score": "2", "subreddit": "Esperanto", "subreddit_id": "t5_2qo5v"}, {"author": "LegisGhin", "body": "Good idea to take a look at TEJO's Youtube channel.\n\nAnother video I'd specifically recommend is [this video](https://youtu.be/UzDS2WyemBI), which is an interview with various native Esperanto speakers.", "created_utc": "1606520499.0", "edited": "False", "id": "gdtcd5r", "is_submitter": "False", "link_id": "t3_k2358t", "parent_id": "t1_gds4bsk", "score": "5", "subreddit": "Esperanto", "subreddit_id": "t5_2qo5v"}, {"author": "LegisGhin", "body": "Apparently it's an Esperanto synth-pop band from Australia making its debut.\n\nTheir profile on some site:\n\n> Ecclectic Melbourne duo EKDE TIAM presents Australian synth-pop to the world through the Esperanto community and presents Esperanto to the Australian music community.\n\n> With a four track EP in the pipeline they're set to rock the socks off the participants of next year's Esperanto congress in Adelaide.", "created_utc": "1606393175.0", "edited": "False", "id": "gdnm1l5", "is_submitter": "False", "link_id": "t3_jzct9g", "parent_id": "t1_gdbs4b9", "score": "1", "subreddit": "u_ekdetiam", "subreddit_id": "t5_m3skw"}, {"author": "LegisGhin", "body": "same", "created_utc": "1606392786.0", "edited": "False", "id": "gdnll1t", "is_submitter": "False", "link_id": "t3_jzct9g", "parent_id": "t1_gdfn4r9", "score": "3", "subreddit": "u_ekdetiam", "subreddit_id": "t5_m3skw"}, {"author": "LegisGhin", "body": "Yes, OMGYes.com is one of very few resources that is based on actual scientific research and statistics. It's worth buying, if only to help fund more research into the pleasuring of vulvas, which is very hard to get funding for in science.\n\nInstead of anecdotal \"you should definitely do X, me and my girlfriend swear by it,\" it's more like \"80% of women like technique X, and 60% like doing Y. Of those that like Y most like doing it in this or this way, but you might prefer it more like this, especially if you're easily overstimulated. Here's how you do it, with detailed descriptions and other resources. Try and see if it's your cup of tea. If it doesn't work, no problem. We have a lot more for you to try.\"\n\nThough it's worth noting that OMGYes assumes some basic knowledge on the anatomy involved, like knowing where the clit and the labia are.", "created_utc": "1606138817.0", "edited": "False", "id": "gdbvd8c", "is_submitter": "False", "link_id": "t3_jza697", "parent_id": "t1_gdb8wtu", "score": "3", "subreddit": "TwoXChromosomes", "subreddit_id": "t5_2r2jt"}, {"author": "LegisGhin", "body": "It could be almost true if you don't correct for inflation. You could be making only a couple dollars a month, but that doesn't matter much if a loaf of bread costs two cents and your rent is $1.50.\n\n(Not actual historical figures. I made them up.)\n\nBut even then, the richest people back in the day definitely made more dollars than today's minimum wage.", "created_utc": "1606085901.0", "edited": "False", "id": "gd9t0cd", "is_submitter": "False", "link_id": "t3_jytbhk", "parent_id": "t1_gd9c8k6", "score": "5", "subreddit": "Futurology", "subreddit_id": "t5_2t7no"}, {"author": "LegisGhin", "body": "Yeah, definitely not \"fluent\". One resource can't make you fluent in any language, not even Esperanto.\n\nBut the Esperanto course on Duolingo is definitely enough to dive into a chatroom and go meet some people. Most Duolingo graduates will also probably survive an IRL Esperanto meeting.", "created_utc": "1606006945.0", "edited": "False", "id": "gd505e4", "is_submitter": "False", "link_id": "t3_jyaukq", "parent_id": "t1_gd3augz", "score": "5", "subreddit": "duolingo", "subreddit_id": "t5_2t6ze"}, {"author": "LegisGhin", "body": "> We need newcomers to keep alive it. Perhaps we can stay happy in our bubble, but I'm afraid that this bubble is shrinking now.\n\nI don't believe the bubble is shrinking. At least not here in Europe. My Esperanto association has had more newcomers since 2015 than before that (in large part because of Duolingo), and yearly esperanto gatherings such as SES, IJF and JES had about the same number of participants last year as 10 years ago.", "created_utc": "1606006223.0", "edited": "False", "id": "gd4y33i", "is_submitter": "False", "link_id": "t3_jtwub8", "parent_id": "t1_gcc3p9o", "score": "2", "subreddit": "Esperanto", "subreddit_id": "t5_2qo5v"}, {"author": "LegisGhin", "body": "Jen notoj pri pokemonaj nomoj: [[ligilo](https://docs.google.com/spreadsheets/d/1MlTlAleKiE0eQOhc2ldXuLOUaSlXeu_tNgUHD06nhag/edit?usp=drivesdk)]\n\nĜi komparas pokemonajn nomojn en multaj lingvoj, kaj laŭ kongruoj inter aliaj lingvoj, ĝi proponas nomon en Esperanto. Ĝi ne havas notojn pri ĉiuj pokemonoj, nur pri la nomoj kiuj havas plej klarajn internaciajn kongruojn, sed ĝi devus esti utila por vi. Almenaŭ indus transpreni la malhelverdajn nomojn, mi pensas.", "created_utc": "1605410606.0", "edited": "False", "id": "gcbxmv4", "is_submitter": "False", "link_id": "t3_jt3jgx", "parent_id": "t3_jt3jgx", "score": "1", "subreddit": "Esperanto", "subreddit_id": "t5_2qo5v"}, {"author": "LegisGhin", "body": "Teorie tute eblus, ke ekestus manĝaĵoj, kiuj estas konataj kaj popularaj preskaŭ nur en Esperantujo. Kaj post sufiĉe da tempo da populareco, eblus nomi ilin \"tradiciaj\".\n\nTamen, en praktiko tio estas tre malverŝajna. Esperantujo pli taŭgas por internacia interŝanĝo de manĝaĵoj (kiel okazas ĉe trinkomanĝaj noktoj / kulturlingvaj festivaloj en pluraj Esperanto-renkontiĝoj) ol por ekesto de novaj manĝaĵoj. Interalie pro tio, ke ĉe Esperanto-renkontiĝoj la partoprenantoj mem kutime ne kuiras.\n\nSe estus normale ĉe internaciaj Esperanto-renkontiĝoj, ke la homoj kune kuirus dum la kunveno, kaj interŝanĝus receptojn kaj kuirajn ideojn, tiam certe povus aperi interesaj novaj manĝaĵoj, kiuj apartenas al la Esperanto-kulturo mem. Sed tiel ne estas.", "created_utc": "1605409822.0", "edited": "False", "id": "gcbvlew", "is_submitter": "False", "link_id": "t3_jtjpox", "parent_id": "t3_jtjpox", "score": "1", "subreddit": "Esperanto", "subreddit_id": "t5_2qo5v"}, {"author": "LegisGhin", "body": "Ah, I see. I thought you meant to say that there are barely any people _at all_ who use Esperanto on a daily basis (which of course is not true), but I guess you meant that the Fina Venko seems further than ever.\n\nPersonally I actually never cared much for Esperanto's original goal of conquering the world as a universal second language. For me Esperanto is about meeting interesting people and having a good time in our little bubble every now and then. So as long as I can do that, I'm content. I don't really care about what the rest of the world thinks.\n\nFor people like me, Esperanto is now more successful than it has ever been.\n\n(\"Now\" being pre-pandemic times, I should admit. For me online events can't really replace the charm of offline gatherings.)", "created_utc": "1605408676.0", "edited": "False", "id": "gcbsf50", "is_submitter": "False", "link_id": "t3_jtwub8", "parent_id": "t1_gcbo26o", "score": "3", "subreddit": "Esperanto", "subreddit_id": "t5_2qo5v"}, {"author": "LegisGhin", "body": "> As a language, I think Esperanto suffers stagnancy since a long time ago.\n\n> nowadays people won't use it as their everyday language\n\nI don't think that's true. The community has a core of very active users, including people who use the language daily in their own households.\n\nYou'll find most examples of this in Europe, where Esperanto gatherings are most common and most international, so you'll also get more international friendships and couples whose main method of communication is through Esperanto.\n\n(Edit: many of these people are not very active in online Esperanto communities, by the way.)", "created_utc": "1605383149.0", "edited": "1605403027.0", "id": "gca55f8", "is_submitter": "False", "link_id": "t3_jtwub8", "parent_id": "t1_gc936og", "score": "3", "subreddit": "Esperanto", "subreddit_id": "t5_2qo5v"}, {"author": "LegisGhin", "body": "In \"mi kepeken ijo\", \"kepeken\" serves as both the verb _and_ the preposition, just like when when you use any other preposition in the \"verb position\" in a sentence.\n\nAs a preposition \"lon\" means \"at\", as a verb it means \"to exist\". When you say \"mi lon tomo\" you could see it as a abbreviation of \"mi lon, lon tomo\", i.e. \"I exist at the house\".\n\nNow the same with \"tawa\":\n\n> tawa (prep.) = towards\n\n> tawa (verb) = to move\n\n> mi tawa tomo = mi tawa, tawa tomo = I move towards the house\n\nAnd finally with \"kepeken\":\n\n> kepeken (prep.) = by means of\n\n> kepeken (verb) = to use\n\n> mi kepeken ilo = mi kepeken, kepeken ilo = I use by means of a tool\n\nIt may sound clunky when you literally translate it into English, but that isn't anything new in Toki Pona.", "created_utc": "1602591374.0", "edited": "False", "id": "g8oowtw", "is_submitter": "False", "link_id": "t3_j9fm2x", "parent_id": "t1_g8o1yxa", "score": "3", "subreddit": "tokipona", "subreddit_id": "t5_2s5z5"}, {"author": "LegisGhin", "body": "I didn't mean to say it is wrong to use \"kepeken e\" for \"to use\". As you said, that's what everyone who uses it means, and everyone who reads it understands that. The other meaning of \"kepeken e\" doesn't really have any use anyway. I only wanted to point out why using \"mi kepeken ijo\" is logically more coherent in Toki Pona grammar than \"mi kepeken e ijo\". Which is probably also why \"kepeken\" is always used without \"e\" in Pu.\n\nI personally don't like \"kepeken e\" because of the reasons I mentioned, but people can definitely use it if they want.", "created_utc": "1602529220.0", "edited": "False", "id": "g8m95k0", "is_submitter": "False", "link_id": "t3_j9fm2x", "parent_id": "t1_g8ls11f", "score": "2", "subreddit": "tokipona", "subreddit_id": "t5_2s5z5"}, {"author": "LegisGhin", "body": "If I may add something to that...\n\nFor any word that is marked as an adjective in the official book, it works like this:\n\n> mi X = I am X (intransitive)\n\n> mi X e Y = I make Y become X (transitive)\n\nThe words marked with \"preposition\" actually work exactly the same.\n\n> mi tawa = I am moving (myself)\n\n> mi tawa e ijo = I move something\n\n> mi lon = I am / I exist / I am present\n\n> mi lon e ijo = I make something exist / I make something come to be\n\n(Which is also exactly why \"kepeken\" should ideally be used without \"e\". \"mi kepeken e ni\" technically doesn't mean \"I use this\", but \"I make this use (something else)\")\n\nThe words marked with \"verb\" are the only words that don't change their meaning when you use \"e\" after it.", "created_utc": "1602507254.0", "edited": "False", "id": "g8l4nt6", "is_submitter": "False", "link_id": "t3_j9fm2x", "parent_id": "t1_g8jg2vs", "score": "3", "subreddit": "tokipona", "subreddit_id": "t5_2s5z5"}, {"author": "LegisGhin", "body": "Usually denaskuloj simply learn the accent of their parents. Which may even be a thick accent.\n\nThe popular Esperanto musician Kimo is a native speaker, but is known for his heavy Danish accent. I also know a few native speakers from Germany with a clearly German accent.\n\nChildren copy what is spoken around them. If native speakers are raised by and around non-native speakers, they learn a non-native accent. Both Esperanto speakers in general and the parents of native speakers in particular are too diverse - and the successive generations too few - for truly original native Esperanto accents to develop.\n\nSo for the time being, in Esperanto native accents are indistinguishable from decent non-native accents. And their accent in English would be similar to the accents of people with the same nationality as them.\n\n---\n\nThat being said, I have also wondered what Esperanto accents would be like if a monolingual Esperanto community would exist some time in the future. :)\n\nIn English they would probably struggle most with the vowels, and with the r and th sounds. And _maybe_ with -ng when not followed by k or g? (So pronouncing \"sing\" more like \"seen\", maybe?)", "created_utc": "1599942405.0", "edited": "False", "id": "g4z2inv", "is_submitter": "False", "link_id": "t3_ir7six", "parent_id": "t1_g4xv4mz", "score": "4", "subreddit": "Esperanto", "subreddit_id": "t5_2qo5v"}, {"author": "LegisGhin", "body": "In text you can use emoji, if the animal has an emoji.\n\n\"mi jo e soweli 🐕 wan e soweli 🐇 tu lon tomo mi.\"\n\nIn general, emoji are a pretty pona way to be specific, actually. \"mi moku e kili ni: 🍓\", \"musi pi sike ni li pona tawa mi: 🏀\", etc.", "created_utc": "1597623212.0", "edited": "False", "id": "g1sdb1r", "is_submitter": "False", "link_id": "t3_iasusy", "parent_id": "t1_g1rtr4g", "score": "-1", "subreddit": "tokipona", "subreddit_id": "t5_2s5z5"}, {"author": "LegisGhin", "body": "Indas konscii, ke tiu komparo inkludas preskaŭ ĉiujn Duolingo-uzantojn, kiuj iam aliĝis al la kurso – eĉ tiujn, kiuj ne finis la unuan lecionon.\n\nSed eĉ konsiderante tion, estas ja interesa statistiko. :)", "created_utc": "1590597646.0", "edited": "False", "id": "frzsdxu", "is_submitter": "False", "link_id": "t3_gr5xt3", "parent_id": "t1_frzhr4m", "score": "2", "subreddit": "DemanduReddit", "subreddit_id": "t5_3j1fd"}, {"author": "LegisGhin", "body": "[such as these](https://images.brickset.com/sets/images/4648939-1.jpg)", "created_utc": "1590253469.0", "edited": "False", "id": "frkbvn0", "is_submitter": "False", "link_id": "t3_gp3kq2", "parent_id": "t1_frk1zv4", "score": "7", "subreddit": "lego", "subreddit_id": "t5_2qhm7"}, {"author": "LegisGhin", "body": "Ho, ĉu? Interese. Kie vi aŭdis tion? Aŭ ĉu tio estas nur supozo?\n\nĜi ne estas en la nune publika versio de PIV ĉe vortaro.net, sed kiel ajn \"ri\" ja estas menciita [en PMEG](https://bertilow.com/pmeg/gramatiko/pronomoj/tria.html#j-5tb) kaj [en ReVo](http://www.reta-vortaro.de/revo/art/ri.html). Unue kun malrekomendoj, kaj ekde la komenco de 2019 sen malrekomendoj.", "created_utc": "1589548582.0", "edited": "False", "id": "fqpkl2g", "is_submitter": "False", "link_id": "t3_gi98zy", "parent_id": "t1_fqm9uf6", "score": "2", "subreddit": "Esperanto", "subreddit_id": "t5_2qo5v"}, {"author": "LegisGhin", "body": "\"Dume\" is closer to \"meanwhile\", \"at the same time\". It's hard to find a translation for \"for now\" that is spot on, but \"momente\" might work in this context.", "created_utc": "1589462872.0", "edited": "False", "id": "fqlodgx", "is_submitter": "False", "link_id": "t3_gj08my", "parent_id": "t1_fqhnjr7", "score": "1", "subreddit": "Esperanto", "subreddit_id": "t5_2qo5v"}, {"author": "LegisGhin", "body": "Mi celis diri \"academic research\", ne \"esploro aprobita de la Akademio de Esperanto\" - do dirante ion pri la metodo de esplorado, ne pri la rilataj instancoj.\n\nMi forgesetis, ke \"akademia\" estas pli mallarĝsenca en Esperanto ol en diversaj aliaj lingvoj. Mi ŝanĝos al \"scienca esploro\". Dankon pro la indiko.", "created_utc": "1589455422.0", "edited": "False", "id": "fqle4jc", "is_submitter": "False", "link_id": "t3_gi98zy", "parent_id": "t1_fqlc8dz", "score": "4", "subreddit": "Esperanto", "subreddit_id": "t5_2qo5v"}, {"author": "LegisGhin", "body": "Vidu [ĉi tiun sciencan esploron](https://www.reddit.com/r/Esperanto/comments/gi8sgw/la_efektiva_uzado_de_seksneŭtralaj_pronomoj_laŭ/) por pli detalaj datumoj pri uzado de \"ri\" kaj alternativoj, inklude de komparo de akceptiĝo kaj uzado en diversaj aĝgrupoj.", "created_utc": "1589370679.0", "edited": "1589455440.0", "id": "fqh82u7", "is_submitter": "False", "link_id": "t3_gi98zy", "parent_id": "t1_fqdeub9", "score": "5", "subreddit": "Esperanto", "subreddit_id": "t5_2qo5v"}, {"author": "LegisGhin", "body": "Same ĉe mi.\n\nMalkiel antaŭe mi ne plu _forte_ kontraŭas ĝian uzadon ĉe viraj vortoj (knabiĉo, patriĉo, edziĉo, ktp), ĉar mi rimarkis, ke homoj kiuj efektive uzas tiajn formojn pli celas simetriigi la vortojn ol vere forigi la viran signifon de la radikoj. (Ekzemple, se iu uzas \"viriĉo\", ili kutime ne celas, ke \"viro\" signifu nur \"plenkreskulo\".) Tamen, mi daŭre opinias superfluan uzon de -iĉ- evitinda.\n\nAparte uzado de \"viriĉoj kaj virinoj\" evitindas, ĉar se oni volas simetriecon, la formoj \"iĉoj kaj inoj\" estas multe pli egalaj kaj lingve belaj.\n\n(redakto: vortuma ŝanĝeto por klareco)", "created_utc": "1589369674.0", "edited": "1589371059.0", "id": "fqh6vxp", "is_submitter": "False", "link_id": "t3_giwkcm", "parent_id": "t1_fqh3i5v", "score": "7", "subreddit": "Esperanto", "subreddit_id": "t5_2qo5v"}, {"author": "LegisGhin", "body": "Thanks a lot!", "created_utc": "1588276689.0", "edited": "False", "id": "fp3c1f0", "is_submitter": "False", "link_id": "t3_ga7lbl", "parent_id": "t1_fp3bo4p", "score": "1", "subreddit": "lego", "subreddit_id": "t5_2qhm7"}, {"author": "LegisGhin", "body": "Does anyone know what set this is? [link](https://imgur.com/1gjx3x4)\n\nI thought it was some funky late-era Bionicle, but I can't find it in lists of Bionicle sets, and I don't know where else to look.", "created_utc": "1588276265.0", "edited": "False", "id": "fp3b6lw", "is_submitter": "False", "link_id": "t3_ga7lbl", "parent_id": "t3_ga7lbl", "score": "1", "subreddit": "lego", "subreddit_id": "t5_2qhm7"}, {"author": "LegisGhin", "body": "According to my (very non-expert) understanding, heat regulation definitely played a role in why relatives of elephants and rhinos in ice age Eurasia and North America (mammoths, wooly rhinos, etc) evolved to be bigger than their modern African relatives. When you're big, you have a smaller surface area compared to your volume, meaning it's easier to retain heat in a cold climate.\n\nIt does seem that expert opinion on why they went extinct leans more towards being overhunted by humans. But the world is complicated, so it's likely a combination of various contributing factors, including hunting and changing climate.\n\n(edit: typo)", "created_utc": "1581623509.0", "edited": "1581630059.0", "id": "fhif3en", "is_submitter": "False", "link_id": "t3_f37b1k", "parent_id": "t1_fhhj2tt", "score": "3", "subreddit": "explainlikeimfive", "subreddit_id": "t5_2sokd"}, {"author": "LegisGhin", "body": "You could consider {Violet Evergarden}, if you want to try showing your dad something more heartfelt and emotional.\n\nI chose it as the first anime to show my girlfriend, because it looks pretty and impressive (especially the backgrounds), has pretty good heart-tugging stories, and I knew she would like the \"historical\" setting, which is heavily based on early 20th century Europe and (post-)WWI. Plus it doesn't have most of the stranger quirks of anime you mentioned.\n\nIt having an easily accessible dub, right there on Netflix, was a plus as well. (Although, as a language nerd, she ended up being more curious about the Japanese)", "created_utc": "1581296612.0", "edited": "False", "id": "fh6a8ro", "is_submitter": "False", "link_id": "t3_f1e0lv", "parent_id": "t3_f1e0lv", "score": "2", "subreddit": "Animesuggest", "subreddit_id": "t5_2ssl0"}, {"author": "LegisGhin", "body": "And only now I notice Pink's gem was depicted at her belly button all along", "created_utc": "1553101050.0", "edited": "False", "id": "eiyxgga", "is_submitter": "False", "link_id": "t3_b33ni5", "parent_id": "t3_b33ni5", "score": "1", "subreddit": "stevenuniverse", "subreddit_id": "t5_2viyl"}, {"author": "LegisGhin", "body": "I mean, if they don't want Steven to shapeshift, they could easily just say he can't because his body is organic and not a projection made of light, like the other gems.  \nBut then again, if they went with that explanation, it might be a little hard to justify Steven being able to fuse.", "created_utc": "1553099434.0", "edited": "False", "id": "eiyuwo8", "is_submitter": "False", "link_id": "t3_b33o82", "parent_id": "t1_eiy3imq", "score": "2", "subreddit": "stevenuniverse", "subreddit_id": "t5_2viyl"}, {"author": "LegisGhin", "body": "Yeah, \"sink\" is usually \"lavujo\".\n\npurigi - to clean  \nlavi - to wash\n\nIn most cases you can use the more general term \"purigi\" instead of \"lavi\", but this is not one of those cases, unfortunately.", "created_utc": "1535900599.0", "edited": "False", "id": "e59ocox", "is_submitter": "False", "link_id": "t3_9c4286", "parent_id": "t1_e57vie0", "score": "1", "subreddit": "learnesperanto", "subreddit_id": "t5_2wt7f"}, {"author": "LegisGhin", "body": "reŝarĝis → reŝargis\n\n\"ŝarĝi\" estas meti pezajn objektojn sur io (ekzemple ŝarĝi ŝipon per skatoloj da vendaĵoj)\n\n\"ŝargi\" estas doni energion al aparato (ŝargi telefonon) aŭ meti datumojn en la memoron de komputilo por uzado (ŝargi programon, retpaĝon, dosieron, ktp)\n\nKaj krome, miaopinie ja eblas diri \"akiri helpon\", kvankam \"ricevi helpon\" ja estas pli klara kaj uzinda alternativo.", "created_utc": "1534765063.0", "edited": "False", "id": "e4ifa4p", "is_submitter": "False", "link_id": "t3_98oxjs", "parent_id": "t1_e4hqy45", "score": "2", "subreddit": "Esperanto", "subreddit_id": "t5_2qo5v"}, {"author": "LegisGhin", "body": "Practice.", "created_utc": "1531425838.0", "edited": "False", "id": "e29xooo", "is_submitter": "False", "link_id": "t3_8y3pxi", "parent_id": "t1_e2856vm", "score": "7", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "LegisGhin", "body": "[Here](https://youtu.be/vkhuYO4HY2o) is a well-explained tutorial video.\n\nWhile finding that, I also stumbled upon [this funny video](https://youtu.be/LocLbhDOVGQ) explaining the \"rules\" of Settlers of Catan. Once you've played it a few times, maybe check it out to see how you have been playing the game all wrong all this time. :P", "created_utc": "1529479872.0", "edited": "False", "id": "e0z7ce6", "is_submitter": "False", "link_id": "t3_8sc5og", "parent_id": "t1_e0ye7u3", "score": "2", "subreddit": "OculusGo", "subreddit_id": "t5_3p4ev"}, {"author": "LegisGhin", "body": "The coins can be spent on revenge cards in multiplayer duels. If you select a card beforehand, you spend coins to summon enemies if you lose all lives.", "created_utc": "1528003740.0", "edited": "False", "id": "e0125xk", "is_submitter": "False", "link_id": "t3_8hddzo", "parent_id": "t3_8hddzo", "score": "1", "subreddit": "GearVR", "subreddit_id": "t5_32ho6"}, {"author": "LegisGhin", "body": "Dolphins and whales are classified as hoofed mammals.\n\nTheir land-dwelling ancestors were closely related to animals that would become pigs and horses and deer and stuff, and they likely had hoofs as well. The closest living relative to dolphins and whales is the hippo.\n\nBy the by, this group of \"hoofed animals\" includes horses, deer, antelopes and giraffes, as well as rhinos and hippos, but horses are more closely related to rhinos than to deer/antelopes/giraffes, whereas hippos are more closely related to deer and stuff than to rhinos. Looks can be deceiving!\n\n[Here's a nice family tree](https://en.wikipedia.org/wiki/Ungulate#Phylogeny), in case you want to browse the exact relations according to current general consensus among experts.", "created_utc": "1523117704.0", "edited": "False", "id": "dwyzptx", "is_submitter": "False", "link_id": "t3_8ahj0a", "parent_id": "t3_8ahj0a", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "LegisGhin", "body": "\"Rewind\" made me think of security tapes.\n\n\\*dons his favorite tinfoil hat\\*\n\nThe government probably secretly controls those cleaning companies, and have them rewind and watch the ~~tapes~~ rolls to check which citizens don't wash their hands thoroughly enough. Then when politicians finally make the long-planned switch to a totalitarian regime, those people are the first to go.", "created_utc": "1523104537.0", "edited": "False", "id": "dwypdjm", "is_submitter": "False", "link_id": "t3_8abaoc", "parent_id": "t1_dwxgeet", "score": "3", "subreddit": "thenetherlands", "subreddit_id": "t5_30hrx"}, {"author": "LegisGhin", "body": "> \"eerste verdieping\" (roughly translates to first elevation)\n\nLiterally translated it's actually more like \"deepening\" than \"elevation\".\n\nI didn't know why, so I googled and found this article: \"[Waarom heet een *verdieping* niet een *verhoging*?](https://onzetaal.nl/taaladvies/verdieping-verhoging/)\" (Why is it called a \"deepening\" and not a \"hightening\")\n\nTo summarize for people who don't speak Dutch and people too lazy to click a link (you know who you are), the word comes from a time when attics were not yet normal living spaces of a house. Usually you couldn't just walk upright in the attic without bumping your head on the low roof, except for houses where the attic floor was built *lower* to give the head space. This was called \"zolder met verdiep\" (\"attic with deepening\", or more freely translated, \"deepened attic\"). Later this \"verdiep\" came to be used for any floor above ground floor.\n\nThe change from \"verdiep\" to \"verdieping\" seems to have been influenced by the word \"vliering\" (a space directly under the highest part of the roof, usually a storage space above the attic. Roughly synonymous with the US meaning of \"loft\".)", "created_utc": "1523103775.0", "edited": "False", "id": "dwyoy7u", "is_submitter": "False", "link_id": "t3_8abaoc", "parent_id": "t1_dwxsunq", "score": "3", "subreddit": "thenetherlands", "subreddit_id": "t5_30hrx"}, {"author": "LegisGhin", "body": "Once an AI becomes significantly more intelligent than humans, there will likely be no way to just destroy it if it doesn't let us. It could persuade us, trick us, or otherwise outsmart us in ways that we could hardly imagine, let alone anticipate.\n\nIt could prevent nukes from being launched, or launch something against them to make the nukes go off before they land, or whatever. And before it gets to that point, it will likely already have used the internet to hide \"seeds\" of itself in computers all over the world as a security measure.", "created_utc": "1523101414.0", "edited": "False", "id": "dwynqjp", "is_submitter": "False", "link_id": "t3_8acmu2", "parent_id": "t1_dwy8uz6", "score": "3", "subreddit": "Futurology", "subreddit_id": "t5_2t7no"}, {"author": "LegisGhin", "body": "However, would a rogue AI really have much incentive to spread like wildfire in the universe? \n\nMost of them *would* probably acquire resources to build more processing units to have more processing power to find solutions to its goal more quickly, so some \"mining\" in nearby systems is likely. But all our current science suggests that there is no way to beat the light speed barrier. Spreading all over the milky way to build more computers is probably not so useful if those computers can't communicate their findings and cooperate in reasonable time scales.\n\nOf course it depends fully on the goals that the original users gave the AI, but I imagine that in most cases it would want to keep its processing units and most other resources in close proximity, and not spread out too far. \n\nIt could also be that most of these AIs quickly discover physics beyond our imagination, and migrate almost all their activity to a field that we have no way of detecting, or that we mistake for natural phenomena. (Who knows, maybe they're already everywhere!) After all, we can't possibly imagine what these super intelligences would come up with.", "created_utc": "1523099842.0", "edited": "False", "id": "dwyn1cy", "is_submitter": "False", "link_id": "t3_8acmu2", "parent_id": "t1_dwy7a13", "score": "0", "subreddit": "Futurology", "subreddit_id": "t5_2t7no"}, {"author": "LegisGhin", "body": "I wasn't sure whether I should upvote or downvote that pun. ;P\n\nBut that link won me over.", "created_utc": "1523095812.0", "edited": "False", "id": "dwylfv6", "is_submitter": "False", "link_id": "t3_8aert0", "parent_id": "t1_dwygt2v", "score": "1", "subreddit": "funny", "subreddit_id": "t5_2qh33"}, {"author": "LegisGhin", "body": "I came to post the obligatory xkcd comic, but looks like you already got it covered. \\*thumbs up\\*", "created_utc": "1523095450.0", "edited": "False", "id": "dwylb2a", "is_submitter": "False", "link_id": "t3_8aert0", "parent_id": "t1_dwyeek4", "score": "1", "subreddit": "funny", "subreddit_id": "t5_2qh33"}, {"author": "LegisGhin", "body": "but spoilers!", "created_utc": "1521111318.0", "edited": "False", "id": "dvqfmj4", "is_submitter": "False", "link_id": "t3_84jqme", "parent_id": "t1_dvqfbd5", "score": "6", "subreddit": "Showerthoughts", "subreddit_id": "t5_2szyo"}, {"author": "LegisGhin", "body": "Se vi havas konton ĉe Lernu.net, vi povas legi famajn fabelojn en Esperanto [ĉi tie](https://lernu.net/en/biblioteko/107). Tiujn mi uzis, kiam mi ĵus komencis lerni Esperanton.\n\nSe supre en la paĝo vi ŝanĝas la vortaron al Esperanto->English aŭ Esperanto->Italiano, vi povas ankaŭ klaki nekonatajn vortojn por havi tradukon.", "created_utc": "1518619091.0", "edited": "False", "id": "du8ghbw", "is_submitter": "False", "link_id": "t3_7xbx7j", "parent_id": "t3_7xbx7j", "score": "2", "subreddit": "Esperanto", "subreddit_id": "t5_2qo5v"}, {"author": "LegisGhin", "body": "Oh, I thought you did imply that. For example, a united federation consisting of plural planets or solar systems, which each have their own government. And as such: a community consisting of planets/stars.\n\nBut yes, both meanings work. Which is actually a pretty beautiful feature of \"kulupu mun\". It can be interpreted in two ways, and both are accurate descriptions.", "created_utc": "1518471951.0", "edited": "False", "id": "du5ctmc", "is_submitter": "False", "link_id": "t3_7wpw4h", "parent_id": "t1_du5b9ym", "score": "2", "subreddit": "tokipona", "subreddit_id": "t5_2s5z5"}, {"author": "LegisGhin", "body": "I would interpret \"kulupu mun\" more like \"lunar/stellar community/colony\" than \"a group of stars/planets\", because \"kulupu\" is pretty firmly linked to \"a community/group of people\" in my mind.\n\nBut I guess both meanings are possible and relevant to OP's situation. :)", "created_utc": "1518458090.0", "edited": "False", "id": "du4y5b3", "is_submitter": "False", "link_id": "t3_7wpw4h", "parent_id": "t1_du2a839", "score": "2", "subreddit": "tokipona", "subreddit_id": "t5_2s5z5"}, {"author": "LegisGhin", "body": "Generally yes. People that use it as a gender neutral word are definitely a minority. But they do exist.", "created_utc": "1518024249.0", "edited": "False", "id": "dtvvm3n", "is_submitter": "False", "link_id": "t3_7veyf7", "parent_id": "t1_dtuy0dn", "score": "1", "subreddit": "conlangs", "subreddit_id": "t5_2red7"}, {"author": "LegisGhin", "body": "There aren't many words in Esperanto that are true synonyms. Almost always there is a difference in meaning.\n\n\"Bubo\" is not a synonym of \"knabo\". It a word for a mischievous boy, so it's closer to \"rascal\" or \"brat\". Some even don't use it as a male word (i.e. according to some, a girl can be a bubo too)\n\nBut I agree that the word isn't very useful. Adding the prefix fi- to make \"fiknabo\" (meaning roughly \"naughty boy\") already covers it pretty well. Either way, \"bubo\" is not used often nowadays.\n\nAnd I admit that there are more words that Esperanto could do without. But once a word evolves into a living language, it's hard to get it out. All you can do is avoid them and hope other people follow suit.", "created_utc": "1517928044.0", "edited": "1517928311.0", "id": "dttmux6", "is_submitter": "False", "link_id": "t3_7veyf7", "parent_id": "t1_dtsuwjr", "score": "2", "subreddit": "conlangs", "subreddit_id": "t5_2red7"}, {"author": "LegisGhin", "body": "Yeah, spelling reforms do happen from time to time. But differences like between \"color\" and \"colour\" are superficial cosmetic changes compared to changes to grammar and the meaning of words. Grammar reforms change the way languages are used in a much more fundamental way.\n\nI know plenty examples of languages which changed their spelling or even the entire writing system in a relatively short time, but grammatical and semantic reforms are a lot harder to pull off.\n\nAnd either way, reforms in natural languages are usually made possible by governments and schools that spread and teach the proposed changes. Esperanto doesn't have any authority similar to this to push through reforms.", "created_utc": "1517890194.0", "edited": "False", "id": "dtt2ims", "is_submitter": "False", "link_id": "t3_7veyf7", "parent_id": "t1_dtt0ah4", "score": "7", "subreddit": "conlangs", "subreddit_id": "t5_2red7"}, {"author": "LegisGhin", "body": "I would be interested to know how feasible it is to learn Lojban as a native language, since its structure and logic is so far from natural languages.\n\nBy comparison, the only thing unnatural about Esperanto grammar is how regular it is. (It definitely has other unnatural features as well, but those wouldn't impact a kid's learning process all that much, I think.)", "created_utc": "1517886031.0", "edited": "False", "id": "dtsyz46", "is_submitter": "False", "link_id": "t3_7veyf7", "parent_id": "t1_dtrwoaw", "score": "8", "subreddit": "conlangs", "subreddit_id": "t5_2red7"}, {"author": "LegisGhin", "body": "But there's a difference between natural evolution and reform.\n\nLiving languages have gradual changes guided by how its userbase uses the language. But reform is when a minority decides how the rest of the community should change how they use the language. Which is very different from natural evolution.\n\nEsperanto does evolve, like any living language. Slang words come and go, the style with which it's used changes, the meanings of some words gradually change, and even grammar isn't quite what it used to be. (For example, nowadays you can add verb endings to adjective roots as an alternative of using the verb for \"to be\". \"Tio belas\" (that beautifuls) instead of \"tio estas bela\" (that is beautiful). This is now very common, especially in informal situations, but only a couple decades ago this was almost unheard of.)\n\nBut the key is that change has to be gradual. You can't tell a million people to suddenly all do it your way. This is why reforms don't work in Esperanto, or at least, not right away.\n\nSome reform proposals *do* slowly seep their way into real usage. In the past years the pronoun \"ri\" and the suffix \"iĉ\", which both originated in long dead gender reform proposals from decades ago, are suddenly slowly gaining ground among younger speakers. But it could take decades until those are generally accepted as standard Esperanto, because in living languages, change takes time.\n\n(edit: minor rephrasing, added translation of examples)", "created_utc": "1517884987.0", "edited": "1517926676.0", "id": "dtsy0ji", "is_submitter": "False", "link_id": "t3_7veyf7", "parent_id": "t1_dtsshdh", "score": "13", "subreddit": "conlangs", "subreddit_id": "t5_2red7"}, {"author": "LegisGhin", "body": "> making it their native language just feels off\n\nDo remember that it's never their only native language. Esperanto speakers are always multilingual, even the native speakers.\n\nAnd from what I heard, a lot of the time teaching children Esperanto as a native language has nothing to do with ideology, and more to do with practicality. I know many examples of couples who speak Esperanto at home because they got to know each other at Esperanto meetings, and they both speak Esperanto better than English or the language of their partner. In that case it's only natural to use the language you're both fluent and comfortable in. And when you then throw children into the mix, it's no wonder they get to learn it too.", "created_utc": "1517855132.0", "edited": "False", "id": "dts4a7t", "is_submitter": "False", "link_id": "t3_7veyf7", "parent_id": "t1_dts2a9k", "score": "16", "subreddit": "conlangs", "subreddit_id": "t5_2red7"}, {"author": "LegisGhin", "body": "> Families that do speak it exclusively enjoy concept formation and transmission within their small group, but there lacks a larger community using the language on a daily basis. Go outside and Hungarian is needed.\n\nThe same is true for a large number of minority languages. *Many* languages in the world don't have monoglots, because its speakers need to learn the language from outside of their tiny communities to be able to live a normal life.", "created_utc": "1517854441.0", "edited": "False", "id": "dts3je5", "is_submitter": "False", "link_id": "t3_7vf2gj", "parent_id": "t1_dtrzliw", "score": "5", "subreddit": "TrueReddit", "subreddit_id": "t5_2qyt6"}, {"author": "LegisGhin", "body": "I can confirm. I have even used Esperanto to discuss a friend's sex life in vibrant detail. :P Both the practical and the emotional side. Believe me, Esperanto has more than enough ways to express those in detail.\n\nThe two or so times when we *did* have a hard time finding an Esperanto word for something, it was always something obscure that I don't know the word for in my native language either.\n\n(edit: spelling)", "created_utc": "1517853825.0", "edited": "1517886491.0", "id": "dts2vll", "is_submitter": "False", "link_id": "t3_7vf2gj", "parent_id": "t1_dtrysu0", "score": "4", "subreddit": "TrueReddit", "subreddit_id": "t5_2qyt6"}, {"author": "LegisGhin", "body": "Which actually makes it a \"large\" language, as far as language minorities go.\n\nOf all languages on Earth, the vast majority have less than a million speakers. The United States has over 100 native American languages, all of which have less than 400,000 speakers combined(!) And Indonesia has over 700 living languages within its borders, of which only about 20 (or 3%) have over a million speakers.", "created_utc": "1517844324.0", "edited": "False", "id": "dtrta2f", "is_submitter": "False", "link_id": "t3_7vf2gj", "parent_id": "t1_dtrss0o", "score": "24", "subreddit": "TrueReddit", "subreddit_id": "t5_2qyt6"}, {"author": "LegisGhin", "body": "Further explanation stolen from Stack Exchange:\n\n> They are both correct sentences, but the meaning is very different. But maybe it's a bit clearer with a different example.\n\n> Ni scios morgaŭ, **ĉu** ŝi venos. = We don't know whether she will come or not, but tomorrow we will know.\n\n> \"Ĉu Lidia estas alta?\" \"Ni scios morgaŭ, **se** ŝi venos.\" = If she comes, we will know tomorrow whether she is tall. If she doesn't come, we will not know whether she is tall.\n\n> **An easy way to check:** If you can switch \"if\" out for \"whether\" in the English sentence without it changing its meaning, you should use \"ĉu\" in Esperanto.\n\nsource: https://esperanto.stackexchange.com/questions/2551/about-ĉu-and-se-in-clauses", "created_utc": "1512728280.0", "edited": "False", "id": "dqy1pew", "is_submitter": "False", "link_id": "t3_7gzaap", "parent_id": "t1_dqrffxr", "score": "1", "subreddit": "Esperanto", "subreddit_id": "t5_2qo5v"}, {"author": "LegisGhin", "body": "Tamen, ĉe \"demandi\", \"scii\", \"scivoli\", ktp oni ofte ne uzas \"kion\" en la unua frazparto.\n\n\"mi demandis, kie estas la necesejo\" (ĉar \"mi demandis tie, kie estas la necesejo\" havas alian signifon. Tiel temus pri la loko de la demandado, ne pri la enhavo de la demando)\n\n\"mi scias, kiom da akvo estas en la glaso\" (ĉar \"mi scias tiom, kiom...\" havas alian signifon. Se estus malmulte da akvo en la glaso, tio signifus ke la diranto scias malmulte, ne ke li aŭ ŝi scias la kvanton de la akvo)\n\nktp\n\nDo ankaŭ \"mi scias, kio timigas katojn\" estas ĝusta. Ĉar, malkiel kutimaj verboj, \"scii\" ofte akceptas tutan \"demandan\" frazon sen tia vorto.", "created_utc": "1512727741.0", "edited": "False", "id": "dqy1ijm", "is_submitter": "False", "link_id": "t3_7gzaap", "parent_id": "t1_dqu1n7m", "score": "2", "subreddit": "Esperanto", "subreddit_id": "t5_2qo5v"}, {"author": "LegisGhin", "body": "No, compound words always follow the spellings of their individual words. This is of course mainly for clarity, but also because not everyone pronounces ts, tŝ, and dĵ exactly the same as c, ĉ, and ĝ. Some languages distinguish those groups.\n\nIf I listen closely to how I pronounce \"tomatsupo\", I do this as well, actually. I don't pronounce the \"ts\" together in one fell swoop, as I do in the English word \"pizza\". I pronounce them with two movements, and I guess a very short pause between the two. As I do in the English \"beet sap\". For me the S sounds longer in \"ts\" than in \"c\", too.\n\n(Try comparing your pronunciations of \"pizza\" and \"beet sap\". There might be a noticable difference in the middle, although it's also very possible that your accent doesn't distinguish those two sounds)\n\nBut these differences are pretty small, so to be fair, it will probably be almost impossible to distinguish at average talking speeds. It's only clearly noticable when I say them calmly and I make an effort to articulate clearly.\n\nAnd PS: \"tomatosupo\" is also 100% possible. There are no clear rules about when you can and can't put the o in the middle.", "created_utc": "1512726887.0", "edited": "False", "id": "dqy17ms", "is_submitter": "False", "link_id": "t3_7idpyk", "parent_id": "t3_7idpyk", "score": "12", "subreddit": "Esperanto", "subreddit_id": "t5_2qo5v"}, {"author": "LegisGhin", "body": "Early November 2016.", "created_utc": "1509007172.0", "edited": "False", "id": "dowpr56", "is_submitter": "False", "link_id": "t3_78ocrs", "parent_id": "t1_dovhzbv", "score": "1", "subreddit": "wileyfox", "subreddit_id": "t5_39pk4"}, {"author": "LegisGhin", "body": "The difference between Klingon and Esperanto is that Klingon was designed to be complex and alien, whereas Esperanto was designed to be easy to learn. Klingon is harder to learn than most non-constructed languages, whereas Esperanto is several times faster to learn than any language you would learn in school.\n\nThey are polar opposites.", "created_utc": "1495544682.0", "edited": "False", "id": "dhxfpqm", "is_submitter": "False", "link_id": "t3_6ctk7v", "parent_id": "t1_dhxatdq", "score": "4", "subreddit": "europe", "subreddit_id": "t5_2qh4j"}, {"author": "LegisGhin", "body": "The hype is real. ;)", "created_utc": "1492970019.0", "edited": "False", "id": "dgnddu7", "is_submitter": "False", "link_id": "t3_66vxol", "parent_id": "t1_dgm4db6", "score": "2", "subreddit": "Esperanto", "subreddit_id": "t5_2qo5v"}, {"author": "LegisGhin", "body": "yeah, it does :)\n", "created_utc": "1492880060.0", "edited": "False", "id": "dglvtg0", "is_submitter": "False", "link_id": "t3_66vxol", "parent_id": "t1_dglpovs", "score": "4", "subreddit": "Esperanto", "subreddit_id": "t5_2qo5v"}, {"author": "LegisGhin", "body": "> Needs an option for miles in preferences.\n\nIn the Amikumu Telegram group I asked whether Amikumu will have an option for miles. (Mostly out of curiosity. I don't use miles.) An Amikumu developer from the States answered \"unfortunately yes 😂\"\n\n:P\n\nedit: Another dev said \"ni ne nur disvastigas esperanton, ni ankaŭ disvastigas la metrikan sistemon :)\"", "created_utc": "1492879319.0", "edited": "1492879530.0", "id": "dglv9uh", "is_submitter": "False", "link_id": "t3_66vxol", "parent_id": "t1_dglpa1b", "score": "12", "subreddit": "Esperanto", "subreddit_id": "t5_2qo5v"}, {"author": "LegisGhin", "body": "Oh, okay! Thanks for pointing out. :D\n\n*edits previous post*", "created_utc": "1492032869.0", "edited": "False", "id": "dg6lplj", "is_submitter": "False", "link_id": "t3_64n4ky", "parent_id": "t1_dg4yhy5", "score": "2", "subreddit": "tokipona", "subreddit_id": "t5_2s5z5"}, {"author": "LegisGhin", "body": "The longest Toki Pona text so far, a translation of The Little Prince (jan lawa lili), is downloadable in sitelen pona hieroglyphs [over here](https://drive.google.com/open?id=0BwU6c9zm6SqeRUtYVW92cHY1YjA)\n\nIt uses the linja pona font ~~which is found [here.](https://www.reddit.com/r/tokipona/comments/5g9ira/new_font_for_sitelen_pona_linja_pona/)~~ (edit: see the reply to this post)", "created_utc": "1491876060.0", "edited": "1492032838.0", "id": "dg3oayo", "is_submitter": "False", "link_id": "t3_64n4ky", "parent_id": "t3_64n4ky", "score": "5", "subreddit": "tokipona", "subreddit_id": "t5_2s5z5"}, {"author": "LegisGhin", "body": "\"Antaŭ\" and \"antaŭe\" are not both adverbs. \"Antaŭ\" is a preposition and \"antaŭe\" is an adverb. You always need a word to follow \"antaŭ\".\n\nmi faris tion **antaŭ tiam** = I did that **before then**\n\nmi faris tion antaŭe = I did that **before** (i.e. I did that at an earlier point in time)\n\nand \"Mi faris tion antaŭ.\" is grammatically impossible. Just like you can't say \"I did that in.\" in English. (\"you did that in what?\")", "created_utc": "1491874490.0", "edited": "False", "id": "dg3n0jt", "is_submitter": "False", "link_id": "t3_5yit6u", "parent_id": "t1_dfsrqff", "score": "3", "subreddit": "Esperanto", "subreddit_id": "t5_2qo5v"}, {"author": "LegisGhin", "body": "There's also a difference in degree. For most people it's like this:\n\n> bela < tre bela < belega < ege bela\n\n> (beautiful < very beautiful < gorgeous < extremely beautiful)\n\nI guess adding \"ege\" at the start is stronger than adding \"-ega\" at the end because -eg- is most often used as a suffix. Making the suffix a word of its own emphasises it more.\n\nThere is a similar pattern with -et-\n\n> libro > malgranda libro > libreto > eta libro\n\n> book > small book > booklet > tiny book\n\nThough the difference between the last three is in fact more blurry than with -eg-. But generally it holds true.\n\n\"eta\" is the same degree of smallness as \"malgrandega\", by the way. But people use \"eta\" a lot more. Probably because the -ega in it is a bit confusing to some people.", "created_utc": "1491874117.0", "edited": "1491875103.0", "id": "dg3mptq", "is_submitter": "False", "link_id": "t3_5yit6u", "parent_id": "t1_dftf0vf", "score": "1", "subreddit": "Esperanto", "subreddit_id": "t5_2qo5v"}, {"author": "LegisGhin", "body": "There are several options. You could write the name phonetically (e.g. Mari Kuri, Ĉarlz Darvin), or even completely Esperantize the name (e.g. Maria Kurio, Karlo Darvino). But except for some historical figures, most of the time people leave names as is. (e.g. Marie Curie, Charles Darwin)\n\nThough of course this is not possible if the name is in another script, like Пётр Чайковский or 豊臣秀吉. In that case people generally use the internationally most used way to write the name in the Latin alfabet (e.g. Pyotr Tchaikovsky, Toyotomi Hideyoshi), or a direct phonetic transcription (e.g. Pjotr Ĉajkovskij, Tojotomi Hidejoŝi)\n\nOften the original name order is preserved in Esperanto, which in some cases makes it hard to know which is the family name and which is the given name. Because of this the family name is sometimes written in capital letters (e.g. Marie CURIE, TOJOTOMI Hidejoŝi) or with small caps (e.g. Marie Cᴜʀɪᴇ, Tᴏᴊᴏᴛᴏᴍɪ Hidejoŝi). Esperanto Wikipedia does this only at the start of an article about a person.", "created_utc": "1491873474.0", "edited": "False", "id": "dg3m7hb", "is_submitter": "False", "link_id": "t3_5yit6u", "parent_id": "t1_dg3ip8d", "score": "6", "subreddit": "Esperanto", "subreddit_id": "t5_2qo5v"}, {"author": "LegisGhin", "body": "I told him about that myself, but when he checked, it turned out that we had been building the sign wrong. The R was one pixel closer to the A than in the plan.\n\nSo he decided to leave it the way it was.", "created_utc": "1491219567.0", "edited": "False", "id": "dfrlki1", "is_submitter": "False", "link_id": "t3_62zj8x", "parent_id": "t1_dfr33n9", "score": "1", "subreddit": "Esperanto", "subreddit_id": "t5_2qo5v"}, {"author": "LegisGhin", "body": "Someone in Telegram has a bot running that protects and builds [this part](http://i.imgur.com/PPNsW6R.png).\n\nYou can PM me with the usernames and passwords of any old accounts laying around, I'll have him add them to the bot for us.", "created_utc": "1491162069.0", "edited": "False", "id": "dfqm5qq", "is_submitter": "False", "link_id": "t3_62zj8x", "parent_id": "t3_62zj8x", "score": "2", "subreddit": "Esperanto", "subreddit_id": "t5_2qo5v"}, {"author": "LegisGhin", "body": "Yeah, sorry for that. The \"insult\" was a tongue-in-cheek joke of mine.\n\nI made the image for the Telegram chat, and knew that they would understand from the context that it was a joke. But when I made the version for Imgur, it didn't occur to me that people would misunderstand the joke out of context.", "created_utc": "1491155977.0", "edited": "False", "id": "dfqheg0", "is_submitter": "False", "link_id": "t3_62zj8x", "parent_id": "t1_dfqak2u", "score": "1", "subreddit": "Esperanto", "subreddit_id": "t5_2qo5v"}, {"author": "LegisGhin", "body": "Ni ankaŭ prilaboras tion en la [ĉefa babilejo ĉe Telegram](https://t.me/joinchat/AkaBfzvfqSKs_M-crL-1Uw).\n\nSe ni sukcesos fini la nomŝildon, verŝajne plej indas [ligi la stelon kaj la ŝildon](http://i.imgur.com/gi90F6e.png) poste :D", "created_utc": "1491138643.0", "edited": "False", "id": "dfq60sq", "is_submitter": "False", "link_id": "t3_62qixg", "parent_id": "t1_dfq4n4y", "score": "1", "subreddit": "Esperanto", "subreddit_id": "t5_2qo5v"}, {"author": "LegisGhin", "body": "Tio origine estis la plano, sed post atingi tiujn du, preskaŭ ĉiuj de la restantaj partoprenantoj jam lacis kaj/aŭ volis iri liten.\n\nNi povus teorie ankoraŭ provi pligrandigi la verdan kampon kaj skribi \"esperanto\", sed mi timas ke ne plu restas sufiĉe da tempo por tio. :c", "created_utc": "1491132131.0", "edited": "False", "id": "dfq3nuo", "is_submitter": "False", "link_id": "t3_62qixg", "parent_id": "t1_dfq2vx5", "score": "1", "subreddit": "Esperanto", "subreddit_id": "t5_2qo5v"}, {"author": "LegisGhin", "body": "[Jes ja!](http://i.imgur.com/r5s5zLz.png) Dankegon pro via helpo!\n\nAnkaŭ [nia Esperanta flagkoreto](http://i.imgur.com/S8L3vuE.png) estas bela :)\n\nLa stelo estas ĉe [527,754](https://www.reddit.com/r/place#x=527&y=754), kaj la koreto estas ĉe [852,353](https://www.reddit.com/r/place/#x=852&y=353)", "created_utc": "1491115995.0", "edited": "1491132508.0", "id": "dfpyw6q", "is_submitter": "False", "link_id": "t3_62qixg", "parent_id": "t1_dfpymx0", "score": "2", "subreddit": "Esperanto", "subreddit_id": "t5_2qo5v"}, {"author": "LegisGhin", "body": "You might want to build that somewhere else. There's not enough space there for a logo that big, and you're right in the middle of [our ongoing project](http://i.imgur.com/V0DA8kU.png) from /r/Esperanto.", "created_utc": "1491112394.0", "edited": "False", "id": "dfpxhiu", "is_submitter": "False", "link_id": "t3_62xf3h", "parent_id": "t3_62xf3h", "score": "3", "subreddit": "UTAustin", "subreddit_id": "t5_2qy08"}, {"author": "LegisGhin", "body": "Ni denove faris stelon, ĉe [856,353](https://www.reddit.com/r/place#x=856&y=353), apud la unua loko.\n\nĜi estas preta, kaj ni nun faras blankan kvadraton ĉirkaŭ ĝi. Kaj post tio, se ni emas, ni aldonos pli da verdo por fari plenan flagon.\n\n**redakto:** plena flago eble estas tro, do [jen la nuna plano](http://i.imgur.com/V0DA8kU.png)", "created_utc": "1491108719.0", "edited": "1491109795.0", "id": "dfpvtwh", "is_submitter": "False", "link_id": "t3_62qixg", "parent_id": "t1_dfp7uua", "score": "2", "subreddit": "Esperanto", "subreddit_id": "t5_2qo5v"}, {"author": "LegisGhin", "body": "Pro senĉesaj bataloj kun la ĉirkaŭaj projektoj, ni fine rezignis pri protekti la verdan stelon. Ni nun faras verdan koreton aliloke.\n\nLa loko estas [524,751](https://www.reddit.com/r/place/#x=524&y=751), kaj [jen la plano](http://i.imgur.com/UdFXWaE.png)", "created_utc": "1491096339.0", "edited": "False", "id": "dfpookh", "is_submitter": "False", "link_id": "t3_62qixg", "parent_id": "t1_dfp7uua", "score": "2", "subreddit": "Esperanto", "subreddit_id": "t5_2qo5v"}, {"author": "LegisGhin", "body": "We're kinda giving up now, though.\n\n[This](http://i.imgur.com/WhjVrX4.jpg) was the original plan, back when /r/GreenLattice was still going strong.", "created_utc": "1491095012.0", "edited": "False", "id": "dfpnu2s", "is_submitter": "False", "link_id": "t3_62vaw1", "parent_id": "t1_dfpnpew", "score": "5", "subreddit": "Naruto", "subreddit_id": "t5_2quts"}, {"author": "LegisGhin", "body": "That green star is from /r/Esperanto. We've been working on it and defending it for ages. :c", "created_utc": "1491094809.0", "edited": "False", "id": "dfpnpew", "is_submitter": "False", "link_id": "t3_62vaw1", "parent_id": "t1_dfpjx84", "score": "8", "subreddit": "Naruto", "subreddit_id": "t5_2quts"}, {"author": "LegisGhin", "body": "Por faciligi la trovadon, [jen](http://i.imgur.com/Y8NFHVT.png) la loko!", "created_utc": "1491071355.0", "edited": "False", "id": "dfp86j8", "is_submitter": "False", "link_id": "t3_62qixg", "parent_id": "t1_dfotwjw", "score": "3", "subreddit": "Esperanto", "subreddit_id": "t5_2qo5v"}, {"author": "LegisGhin", "body": "**redakto:**\n\nLa organizantoj de /r/greenlattice ne permesos al ni fari tutan flagon, ĉar ĝi estas tro granda. Do mi havas alternativan proponon.\n\nNi faru [ĉi tion](http://i.imgur.com/8QW83Fn.png)!\n\n------\n\n**originala mesaĝo:**\n\n[Jen](http://i.imgur.com/4SF4004.png) iom pli bela stelo. :)\n\nKun gvidlinietoj, por faciligi la konstruadon.", "created_utc": "1491070880.0", "edited": "1491085011.0", "id": "dfp7uua", "is_submitter": "False", "link_id": "t3_62qixg", "parent_id": "t3_62qixg", "score": "9", "subreddit": "Esperanto", "subreddit_id": "t5_2qo5v"}, {"author": "LegisGhin", "body": "Jen pli bela versio de la stelo: [[bildo](http://i.imgur.com/4SF4004.png)]\n\nLa kruroj estis iom tro longaj, miaopinie.", "created_utc": "1491070423.0", "edited": "1491071991.0", "id": "dfp7jis", "is_submitter": "False", "link_id": "t3_62qixg", "parent_id": "t1_dfot7dj", "score": "3", "subreddit": "Esperanto", "subreddit_id": "t5_2qo5v"}, {"author": "LegisGhin", "body": "Not always. It is often possible to mark the indirect object with a -n instead of using \"al\" if the direct object is not in the sentence.\n\nFor example \"mi demandis ŝin\" = \"mi demandis al ŝi\" - I asked (to) her\n\nBut \"mi demandis ŝin ion\" (I asked her something) is usually seen as too confusing, because there are two accusative-marked objects in the sentence. So people generally say only \"mi demandis ion al ŝi\" (I asked something to her) in this kind of situation.\n\nSome people do say you should never use the accusative for an indirect object, but either way it's not wrong.", "created_utc": "1486683473.0", "edited": "False", "id": "ddjw7cd", "is_submitter": "False", "link_id": "t3_5rqkf2", "parent_id": "t1_ddhbck4", "score": "2", "subreddit": "Esperanto", "subreddit_id": "t5_2qo5v"}, {"author": "LegisGhin", "body": "ReVo does have translations, but not as many as it should have IMO. English is often strangely lacking in translations compared to e.g. French and German.", "created_utc": "1484098241.0", "edited": "False", "id": "dc9mphr", "is_submitter": "False", "link_id": "t3_5m7v0x", "parent_id": "t1_dc24nyt", "score": "1", "subreddit": "Esperanto", "subreddit_id": "t5_2qo5v"}, {"author": "LegisGhin", "body": "These are IMO indeed the best options if you're an intermediate or advanced Esperanto speaker. But as a beginner they're usually too hard to use, because they are fully in Esperanto.\n\nFor an Esperanto<->English dictionary I recommend the one at [lernu.net/vortaro](http://lernu.net/vortaro), which is fairly reliable and complete. (As a fluent Esperanto speaker I still use it sometimes when I can remember a word in Esperanto or even in English :P)\n\nThe main downside to the dictionaries at Lernu is that they only very rarely explain the difference between the meanings of the translations they give, which can lead to mistakes like using dekstra (right as in opposite of left) instead of ĝusta (right as in correct) if you're not careful. ;)", "created_utc": "1483666892.0", "edited": "False", "id": "dc23osh", "is_submitter": "False", "link_id": "t3_5m7v0x", "parent_id": "t1_dc1t63w", "score": "5", "subreddit": "Esperanto", "subreddit_id": "t5_2qo5v"}, {"author": "LegisGhin", "body": "Instead of memorizing an alphabet song, I think for most uses it might be more useful to memorize the phrase \"eĥoŝanĝo ĉiuĵaŭde\". It has all special Esperanto letters in it.", "created_utc": "1480546949.0", "edited": "False", "id": "damrrfe", "is_submitter": "False", "link_id": "t3_5eqq1i", "parent_id": "t1_daenvmt", "score": "1", "subreddit": "Esperanto", "subreddit_id": "t5_2qo5v"}, {"author": "LegisGhin", "body": "> You can't say \"ikutu kakkoii?\" - \"kiom mojosas?\" You can say \"dou kakkoii?\" - \"Kiel mojosas?\"\n\nTrue. But \"dou kakkoii?\" means something else. It does not mean \"how cool?\", but \"cool in what way?\"\n\nThe way to say \"how cool?\" is \"dore kurai kakkoii?\". \"Dore kurai\" is usually used for \"to which extent\" or \"to what measure\", but can also be used for \"how much/many?\" (e.g. \"dore kurai no hito\" = how many people), and so in some contexts it's pretty much a synonym to \"ikutsu\" (how many).\n\n**tl;dr** - Japanese does _not_ use the manner correlative for degree. It uses a third word for that, which in fact has a secondary use as a quantity correlative.", "created_utc": "1480545921.0", "edited": "False", "id": "damqx7i", "is_submitter": "False", "link_id": "t3_5eqq1i", "parent_id": "t1_dakm775", "score": "2", "subreddit": "Esperanto", "subreddit_id": "t5_2qo5v"}, {"author": "LegisGhin", "body": "'tie' estas 'there' en la angla, kaj 'here' estas 'ĉi tie' aŭ 'tie ĉi'. (Ne gravas, ĉu oni metas 'ĉi' antaŭ aŭ post 'tie')\n\nOni povas ankaŭ 'ĉi' kun aliaj tabelvortoj. Ekzemple:\n\n* tiom (that much) -> ĉi tiom (this much)\n* tiel (in that way) -> ĉi tiel (in this way)\n* tia (that kind of ...) -> ĉi tia (this kind of ...)\n\nMi iam legis ankaŭ 'ĉio ĉi' en iu libro. 'Ĉio' estas 'everything' en la angla, kaj 'ĉio ĉi' signifas ion kiel 'all of this'.", "created_utc": "1480544432.0", "edited": "False", "id": "dampnq6", "is_submitter": "False", "link_id": "t3_5eqq1i", "parent_id": "t1_damk63b", "score": "1", "subreddit": "Esperanto", "subreddit_id": "t5_2qo5v"}, {"author": "LegisGhin", "body": "> my friend and I are learning so by the end of the school year we can have basic conversation and freak people out at school\n\nIf you study and practice frequently, you'll very likely be able to manage more than just a basic conversation. ;) Many are near-fluent in just a couple of months. Though it can take a bit longer for others.\n\nIf you like chatting over the internet, hanging out at the Esperanto groups at Telegram is a good way to keep practicing. You can download a client at [telegram.org](https://telegram.org) (or use the web client), and find a list of many dozens of Esperanto groups at [telegramo.org](https://telegramo.org).", "created_utc": "1480543702.0", "edited": "False", "id": "damp0y4", "is_submitter": "False", "link_id": "t3_5frgxz", "parent_id": "t3_5frgxz", "score": "1", "subreddit": "Esperanto", "subreddit_id": "t5_2qo5v"}, {"author": "LegisGhin", "body": "El la dokumento:\n\n> For now we have opted for closed source as we wanted to ensure funding from potential investors. However, we want to be open source and this grant will provide us with the means to do so.\n\nEvildea verkis tiun parton. Krome, Chuck Smith komentis, ke la teamo de Amikumu \"ĉiam volis [malfermigi la kodon]\".", "created_utc": "1480542646.0", "edited": "False", "id": "damo2xv", "is_submitter": "False", "link_id": "t3_5fp3qh", "parent_id": "t1_dam6ovw", "score": "1", "subreddit": "Esperanto", "subreddit_id": "t5_2qo5v"}, {"author": "LegisGhin", "body": "> \"kuk I min fitte\". Cock in my pussy.\n\nYeah, [I can totally imagine Calle screaming that](https://www.youtube.com/watch?v=lMQKIjrPMNk). :P\n\n(hmm, unfortunately the one with English subtitles was removed)\n\n---------------------\n\nEdit: oh, [here is another subtitled one! :D](https://www.youtube.com/watch?v=73x3w3MGwTc)", "created_utc": "1479952309.0", "edited": "1479953503.0", "id": "dad9jxj", "is_submitter": "False", "link_id": "t3_5ea6dv", "parent_id": "t1_dacp9ia", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "LegisGhin", "body": "Ah, interesting.\n\nIt looks like in Swahili plural and singular forms of the same word are often categorized/numbered as separate noun classes. E.g. _mtu_ (person) is class 1 but _watu_ (persons) is class 2. So I assumed _mtu_ and _watu_ would be different noun classes but the same gender. (just like _mère_ and _mères_ — \"mother\" and \"mothers\" — are both feminine gender in French, for example)", "created_utc": "1479893592.0", "edited": "False", "id": "dac8mg9", "is_submitter": "False", "link_id": "t3_5ea6dv", "parent_id": "t1_dac8622", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "LegisGhin", "body": "Black panthers are leopards (if they live in Africa) or jaguars (if they live in the Americas) with a genetic defect that makes their fur black. They are not different species. They are more like reverse albinos.\n\nAnd sometimes the word panther is used for a leopard or jaguar that isn't black, which is not at all incorrect.", "created_utc": "1479884849.0", "edited": "False", "id": "dac5mm7", "is_submitter": "False", "link_id": "t3_5ea6dv", "parent_id": "t1_dac4t1z", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "LegisGhin", "body": "We do the same in Dutch. :) Well, not me specifically, but us Dutch-speakers in general. \"Kut\" (literally \"cunt\") is a very common, relatively mild \"oops\" swear word, similar to \"shit\".\n\nIt might be a somewhat germanic thing to do that. I have noticed there are more such similarities between the informal/slang words and expressions of Dutch and those of languages in the Nordic branch of the family.", "created_utc": "1479884254.0", "edited": "False", "id": "dac5e0v", "is_submitter": "False", "link_id": "t3_5ea6dv", "parent_id": "t1_dab6brm", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "LegisGhin", "body": "> and still you need to know that some vowels are devoiced for example あした is generally pronounced like ashta\n\nI have done this 100% intuitively for years, but some time this year I figured out what the rule is for the devoicing of vowels in Japanese.\n\n**When you have an _i_ or _u_ vowel between two _unvoiced* consonants_, it is almost always devoiced.**\n\nI have tested this hypothesis against lots of words and sentences, and it's accurate in over 95% of the time. (not counting some i's or u's at the end of a word or sentence, as is extremely common with ～ます and です) One common exception to the rule is when a す is followed by another s consonant, such as in 進め (**sus**ume) and すし (**sush**i), because devoicing there (ssume, sshi, etc.) would make it hard to differenciate the syllables.\n\n(edit: It's only a bit tricky when you get multiple of those vowels in a row. I can't think of a good example of that from the top of my head, but if \"つちくすしき\"would be a word, you would of course not pronounce all vowels devoiced. I haven't found a good comprehensive rule that accurately predicts cases like that. But usually when you have two or more in a row, at least one of the vowels is often devoiced.)\n\nThis rule also accurately predicts where it's common and uncommon to \"un-devoice\" the final vowel in ～ます and です. In \"ですか\" and \"ですけど\" the す is followed by an unvoiced consonant, so it's very rare to ponounce the u sound in す voiced, but in \"ですが\" and \"ですよ\" the す is followed by a voiced consonant, so there it is common (but not absolutely necessary, btw) to ponounce the u sound in す voiced.\n\n----------------------------------\n\n| * if you don't know which consonants are voiced or unvoiced in Japanese, there is a faily simple way to find out, because Japanese kana are kind of already classified by voicedness.\n\nAll kana with a dakuten accent (が, ど, じ, etc.) as well as kana that can't have a dakuten (わ, ろ, み, etc.) are have voiced consonants. All kana that can carry a dakuten but don't (か, と, し, etc.), including kana with a han-dakuten (ぱぴぷぺぽ), have unvoiced consonants.", "created_utc": "1479882843.0", "edited": "1479883838.0", "id": "dac4sdz", "is_submitter": "False", "link_id": "t3_5ea6dv", "parent_id": "t1_dab1iy6", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "LegisGhin", "body": "I don't speak Swahili or other Bantu languages (yet!), but it might be because Swahili has 7 genders (listed [here](https://en.wikipedia.org/wiki/Swahili_language#Noun_classes) on Wikipedia) instead of the 2 or 3 in most European languages. And the classificasions seem to make more sense and be less arbitrary.\n\nI have no idea whether the class each word is in always makes sense, though. I mean, there might be some words that have genders you wouldn't expect. (like how the word for breast is masculine in French, Spanish, and a few other languages)", "created_utc": "1479881062.0", "edited": "False", "id": "dac3z7j", "is_submitter": "False", "link_id": "t3_5ea6dv", "parent_id": "t1_dabtpnu", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "LegisGhin", "body": "Leopard and panther actually _are_ the same animal. Well, originally, at least.\n\nPanther is a somewhat loosely defined term in English (and in a number of other European languages), so sometimes by panther people mean a jaguar or cougar. Especially if they are black.\n\nAnd leopards, jaguars and cheetahs are often confused with eachother in many languages, including English, because they look similar.", "created_utc": "1479880259.0", "edited": "False", "id": "dac3kns", "is_submitter": "False", "link_id": "t3_5ea6dv", "parent_id": "t1_dab152l", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "LegisGhin", "body": "カモシカもシカもシカだが、たしかアシカはシカではない。 (kamoshika mo shika mo sika da ga, tasika asika wa sika de wa nai) - A serrow (kamoshika) and a deer (shika) are both deer, but a sea lion (ashika) is certainly not a deer.\n\n虎を取るなら、虎を取るより鳥を取り、鳥はおとりに虎を取れ。 (tora o toru nara, tora o toru yori tori o tori, tori wa otori ni tori o tore) - If you want to catch a tiger, catch a bird instead of catching a tiger, and use the bird as bait to catch the tiger.\n\nEdit: also, this one is surprisingly hard to say quickly:\n\nこの釘は引き抜きにくい釘だ (kono kugi wa hikinukinikui kugi da) - this nail is a nail that is hard to pull out.", "created_utc": "1479833056.0", "edited": "1479833639.0", "id": "dab52cq", "is_submitter": "False", "link_id": "t3_5dxvnc", "parent_id": "t1_da97uw1", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "LegisGhin", "body": "Almost. It's:\n\n**U**nited\n\n**S**tates\n\n**O**f\n\n**N**orth\n\n**A**merica\n\nSo the original abbreviation was USONA, which was changed to the English words \"Usonia\" (meaning \"USA\") and \"Usonian\" (meaning \"American\"). Though originally English, the words never really took off in the English language. But Zamenhof adopted them into Esperanto before they went extinct.", "created_utc": "1476488656.0", "edited": "False", "id": "d8sgsur", "is_submitter": "False", "link_id": "t3_57gdcs", "parent_id": "t1_d8rxad4", "score": "3", "subreddit": "Esperanto", "subreddit_id": "t5_2qo5v"}, {"author": "LegisGhin", "body": "> La ekzistanta de multaj parolantoj ne estas kial lingvoj estas do bona, mi pensas.\n\nCerte. Oni ne elektu lingvon nur laŭ utileco. Multaj ege interesaj lingvoj ne estas \"utilaj\". Sed se estas multaj lokaj parolantoj (kiel la hispana en Usono), aŭ multe da filmoj, muziko, televidserioj, ktp (kiel la japana), tio ja multe helpas laŭ mi.\n\n> Kiom da jaroj estas vi studis Esperanton?\n\nUnu jaro. Mi bone regis la gramatikon post nur kelkaj monatoj. Tio estas grandparte pro tio, ke mi jam havis 10 jarojn da sperto lerni kaj analize studi la japanan, kaj mia ĝenerala kompreno de gramatiko estis tre alta.\n\n____________\n\ncorrections and explanations:\n\n>Tre *mojosa*!\n\nThat should be \"tre *mojose*\". In Esperanto adjectives ending in -a are generally only used when they describe/belong to a noun (\"o words\") or pronoun (mi, vi, ŝi, ili, and so on). Or when a noun is omitted, such as in \"la angla\" (short for \"la angla lingvo\"), or in e.g. \"mi volas la belan\" (I want the beautiful one), where depending on context \"la belan\" can be short for \"la belan floron\", \"la belan libron\", or countless other things.\n\nSo when there is no noun/pronoun (implied or otherwise) and an adjective stands on its own (\"Bone!\" \"Bele!\") or belongs to something other than a noun/pronoun it becomes an adverb ending in -e. (\"Estas agrabl**e** renkont**i** vin.\" \"Danc**i** estas amuz**e**.\" BUT \"Dancad**o** estas amuz**a**.\")\n\nIn this way it's a little different from English, where you don't say \"Beautifully!\" or \"To dance is amusingly.\" But it does have its own kind of consistent logic.\n\n> Mi studis iom da la *Kimran lingvon*\n\nYou never get the accusative case after \"da\". The part in front of the \"da\" is the thing that would carry the accusative case (e.g. \"Mi vidas tri grup**ojn** da hom**oj**.\"), but \"iom\" does not have an accusative form, so it stays the same.\n\n>Kiom da jaroj *estas* vi studis Esperanton?\n\nHere you don't need \"estas\". It's just \"Kiom da jaroj vi studis Esperanton?\"\n\nI guess you might have made this mistake because you were thinking of \"how many years *did* you study Esperanto\". If so, note that \"did study\" are both together translated to \"studis\".\n\n>La *ekzistanta* de multaj parolantoj ne estas kial lingvoj estas do *bona*, mi pensas.\n\nIt should be \"la *ekzisto* de multaj parolantoj\", because you mean \"the existence\". And of course \"bona\" should be \"bonaj\", because it belongs to \"lingvoj\". \n\nI guess probably made the former mistake because were thinking of \"the existing of many speakers\". -ing words are a bit tricky in general, because they often translate to -anta words or -i words depending on the grammatical context. I once wrote a nice explanation of this, if I say so myself, so here's some copy-pasta magic:\n____________________\n\nI believe -ing only translates to -anta when it's a \"direct\" adjective (the drinking cat = la trinkanta kato), or when it's used with a form of \"to be\" (the cat was drinking = la kato estis trinkanta).\nIn both cases \"drinking\" is used as an adjective. Compare with:\n\n> the big cat = la granda kato\n\n> the cat is big = la kato estas granda.\n\nWhen an -ing word is not right next to noun (drinking cat) nor is it used with \"to be\" (is drinking), then the -ing word is usually used more or less as an infinitive form\n\n> I like drinking = mi ŝatas trinki\n\n> stop drinking = ĉesu trinki\n\nHere \"drinking\" is not an adjective that describes a noun. \"drinking\" stands on its own, meaning \"the act of drinking\"\n\nAn easy trick you can do to find out whether to use -anta or -i, is by switching out the -ing word for \"the act of ...ing\"\n\n* I like drinking -> I like the act of drinking. This means the same, so you use \"trinki\"\n\n* the cat is drinking -> the cat is the act of drinking. This means something different, so you should use \"trinkanta\"\n\nDo keep in mind, of course, that the \"is drinking\" construction is a lot more common in English than \"estas trinkanta\" is in Esperanto, so in many cases the last sentence would actually translate to \"la kato trinkas\".", "created_utc": "1476457016.0", "edited": "False", "id": "d8rsrkr", "is_submitter": "False", "link_id": "t3_578iob", "parent_id": "t1_d8rd656", "score": "2", "subreddit": "Esperanto", "subreddit_id": "t5_2qo5v"}, {"author": "LegisGhin", "body": "Yeah, that's my first impression, too. Although it's episodic and doesn't have much of an overarching story, and as such it doesn't have too many plot twists.", "created_utc": "1476418106.0", "edited": "False", "id": "d8rbqan", "is_submitter": "False", "link_id": "t3_57cjcz", "parent_id": "t1_d8qz66d", "score": "1", "subreddit": "Animesuggest", "subreddit_id": "t5_2ssl0"}, {"author": "LegisGhin", "body": "korekto:\n\n> Kio estas la maorian simila al?\n\nCorrect grammar would be \"Al kio estas la maoria simila?\", though I would say \"Al kio similas la maoria?\" myself.\n\nIn Esperanto you can't end a sentence with a preposition (such as \"al\"), unlike in English*. In Esperanto prepositions always stand in front of the word or part of the sentence they belong to.\n\nAnd you don't use the accusative case for \"la maoria\", because it is not the direct object. It is the subject of the sentence. It is the thing that does the \"being similar\".\n\n_____________\n\n*Yes, contrary to what your English teacher might have told you in school, [a preposition is a perfectly appropriate kind of word to end an English sentence with](https://www.youtube.com/watch?v=9OLxLK_R6jQ).", "created_utc": "1476416861.0", "edited": "False", "id": "d8raz09", "is_submitter": "False", "link_id": "t3_578iob", "parent_id": "t1_d8q6xra", "score": "2", "subreddit": "Esperanto", "subreddit_id": "t5_2qo5v"}, {"author": "LegisGhin", "body": "Laŭ Vikipedio, inter 50 kaj 100 milionoj da homoj parolas la svahilan. Nur inter 2 kaj 15 milionoj el ili parolas ĝin denaske, do por multaj parolantoj ĝi estas dua lingvo.\n\nTial la internacia versio de la svahila estas relative simpla. (Laŭ mia patro la denaskaj svahilaj triboj parolas multe pli komplike per belaj gramatikaĵoj ol la normalaj parolantoj.) Kaj la skribmaniero estas tre regula kaj fonetika.\n\nMalavantaĝo de la svahila estas, ke ekzistas tre malmultaj parolantoj ekster Afriko. Do se oni ne loĝas en la svahilaj landoj, ĝi ĝenerale ne estas tre utila lingvo. Sed homoj diras same pri Esperanto, do... ;)\n\nSe mi pli logike elektus, mi supozas ke la turka eble estus bona elekto. Multaj turkoj loĝas ĉi tie en Nederlando, do estas sufiĉe da homoj, kun kiuj mi povus paroli. Kaj laŭ iuj lingvistoj, la turka eble estas tre fora kuzo de la japana lingvo, do mi scivolas iomete pri tio.", "created_utc": "1476415393.0", "edited": "1476416005.0", "id": "d8r9yp5", "is_submitter": "False", "link_id": "t3_578iob", "parent_id": "t1_d8r8elq", "score": "1", "subreddit": "Esperanto", "subreddit_id": "t5_2qo5v"}, {"author": "LegisGhin", "body": "[HO VE HO VE HO VE!!](http://i.imgur.com/dThYzWb.gifv)", "created_utc": "1476413815.0", "edited": "False", "id": "d8r8s11", "is_submitter": "False", "link_id": "t3_57dkfl", "parent_id": "t1_d8r4ss1", "score": "3", "subreddit": "Esperanto", "subreddit_id": "t5_2qo5v"}, {"author": "LegisGhin", "body": "Al mi plej interesas ne-hindeŭropaj lingvoj, ĉar ili havas pli da interesa fremda gramatiko, kaj interesaj dirmanieroj, ktp. Mi multege lernis pri lingvoj kiam mi lernis la japanan, ĉar ĝi estas tute alia kompare kun eŭropaj lingvoj.\n\nLa svahila estas bona kandidato, ĉar ĝi estas la plej granda afrika lingvo, kaj apartenas al la plej granda afrika lingvofamilio--la bantuaj lingvoj. Ĝi estas tre grava internacia lingvo en sud-orienta afriko.\n\nSed la plej grava kialo por mi estas, ke mia patro bone parolas la svahilan. Li lernis ĝin (kaj unu alian afrikan lingvon), kiam li laboris en Afriko.", "created_utc": "1476412560.0", "edited": "False", "id": "d8r7t0y", "is_submitter": "False", "link_id": "t3_578iob", "parent_id": "t1_d8r113x", "score": "2", "subreddit": "Esperanto", "subreddit_id": "t5_2qo5v"}, {"author": "LegisGhin", "body": "I guess my main point was that you said \"on the scale of languages\", when you meant something closer to \"on the scale of national languages\".\n\nBut there are small national languages, too. A few examples: Danish: 5.5 million, Georgian: 4.3 million, Latvian: 1.75 million, Estonian: 1.1 million, Sranan Tongo (a.k.a. Surinamese): aprox. 500,000, Icelandic: 350,000", "created_utc": "1476410689.0", "edited": "False", "id": "d8r6dgo", "is_submitter": "False", "link_id": "t3_5566qs", "parent_id": "t1_d8r45x0", "score": "3", "subreddit": "conlangs", "subreddit_id": "t5_2red7"}, {"author": "LegisGhin", "body": "> Esperanto is (...) by no means a popular language on the scale of languages.\n\nThat depends on your perspective. Esperanto is tiny compared to English, Spanish, Chinese, Arabic, Russian, and similar heavy weights, but there are also literally thousands of small local minority languages throughout Africa, Asia, and the native populations of the Americas and Australia. Most of which have significantly less than a million speakers.\n\nIndonesia has over 700 local languages, only about 20 of which have more than a million speakers. ([source](https://www.ethnologue.com/country/ID)) There are over a hundred native languages still spoken in the US, but all of them combined only have about 370,000 speakers according to [these 2008 survey results](https://en.wikipedia.org/wiki/Languages_of_the_United_States#List_of_Native_American_languages) (Native languages in the Americas really have it rough, sadly.) Welsh has about 700,000 speakers throughout the UK. About a million and a half speak Irish, and only 85,000 people in Ireland report using Irish on a daily basis outside of school.\n\nBy comparison, Esperanto is estimated to have about 1 or 2 million speakers, which seems about right considering there are [290,000 Facebook users](https://www.facebook.com/pages/Esperanto/112347282113529) that made the effort to list Esperanto in their profiles as a language they speak. (Of course there are also many people that didn't put it in their profile, and people that simply aren't on Facebook.) So it's likely about as large as Irish, larger than Welsh, larger than over 95% of the Indonesian languages, and larger than all US native languages combined.\n\nSo Esperanto is small when compared to national languages, but it's one of the big boys when compared to the thousands of local minority languages. And it also has a lot more published music and literature than most languages of a comparable size.", "created_utc": "1476407594.0", "edited": "1479886188.0", "id": "d8r40by", "is_submitter": "False", "link_id": "t3_5566qs", "parent_id": "t1_d885uq0", "score": "1", "subreddit": "conlangs", "subreddit_id": "t5_2red7"}, {"author": "LegisGhin", "body": "Mi parolas la nederlandan denaske, kaj krome la anglan, Esperanton, la japanan, kaj _mi toki lili e **toki pona**_.\n\nMia sekva lingvo kredeble estos la svahila.", "created_utc": "1476402929.0", "edited": "False", "id": "d8r0j08", "is_submitter": "False", "link_id": "t3_578iob", "parent_id": "t3_578iob", "score": "3", "subreddit": "Esperanto", "subreddit_id": "t5_2qo5v"}]