[{"author": "LeGrille90", "body": "That's reassuring. Sometimes I get put off by success stories and \"hustle porn\" about people making apps and games since they were teenagers and spend all their free time coding. Meanwhile, I like taking care of farm animals and hiking and have barely any apps on my phone, and I wonder if I'm not \"passionate\" enough about coding to succeed.", "created_utc": "1666945667.0", "edited": "False", "id": "iu3jt8d", "is_submitter": "False", "link_id": "t3_yel5e7", "parent_id": "t1_itzat84", "score": "2", "subreddit": "learnprogramming", "subreddit_id": "t5_2r7yd"}, {"author": "LeGrille90", "body": "1. I had career advisors and guidance counselors suggest that programming would be a good fit for me, but I was kept away from it by my very old-fashioned father. I started dabbling in it years later as an elective and as part of an IT degree, and found I enjoyed it, but it was too late to change degrees. \n2. Now I’m in my 30s and I’m giving it serious effort because I find it interesting and I want work which pays well and I find fulfilling. \n3. I like it, particularly web development, but I’m worried about how I can break into the field so late in the game. I live a pretty simple life and don’t have a personal network to speak of, so I don’t know how I’ll get a position when there are so many people younger than myself that have years more experience.\n4. I’d like to learn more about web design in addition to development. I’m kind of a dope in that what I find most exciting is seeing the pretty webpage I’ve made, but I’d like to know how to do that consistently and understand what clients are looking for in a webpage that they couldn’t just make themselves of Squarespace, Wix, etc.", "created_utc": "1666869569.0", "edited": "False", "id": "itz46yw", "is_submitter": "False", "link_id": "t3_yel5e7", "parent_id": "t3_yel5e7", "score": "4", "subreddit": "learnprogramming", "subreddit_id": "t5_2r7yd"}, {"author": "LeGrille90", "body": "In the same boat. I know it is supposed to be really good for building experience and looks great on a CV, but I'm terrified of that my contributions will be like how a 2-year-old \"helps\" with cooking by banging on pots and pans.", "created_utc": "1666854021.0", "edited": "False", "id": "ityl2vh", "is_submitter": "False", "link_id": "t3_yefrm2", "parent_id": "t3_yefrm2", "score": "19", "subreddit": "learnprogramming", "subreddit_id": "t5_2r7yd"}, {"author": "LeGrille90", "body": "Thank you for articulating this so well. I’m currently at 2 months into serious self-teaching, having finished CS50 and nearly through TOP Foundations. Years ago, I did an online IT degree with a few coding courses, and have frequently been frustrated at how much of the practical work is left to be solved without any examples or explanation. I see someone posting about how “you need to figure it out on your own without guidance, that’s how I did it as a kid when I was making my own MMORPG from scratch” and think they must be forgetting that not everyone learning is a child or a student on a college campus. If I’m struggling to solve a problem or make a program, it’s not just part of the learning process: it’s time wasted when maybe I should have just looked for another line of work despite my interests. It’s my partner and family wondering why I don’t have a well-paying job yet. It’s self-doubt and putdowns at what I have made since I know I’m going to be applying for jobs against younger candidates that could learn all this and more while mom and dad cook dinner and keep a roof over their head.", "created_utc": "1665214685.0", "edited": "False", "id": "irhtpj8", "is_submitter": "False", "link_id": "t3_xybyd4", "parent_id": "t3_xybyd4", "score": "2", "subreddit": "learnprogramming", "subreddit_id": "t5_2r7yd"}, {"author": "LeGrille90", "body": "I've just bookmarked it, and will definitely give it a shot tomorrow. It's a shame because the TOP unit on flex boxes was quite fun compared to the CSS practice I've done in the past.", "created_utc": "1664294877.0", "edited": "False", "id": "iq4arpm", "is_submitter": "False", "link_id": "t3_xonmdg", "parent_id": "t1_iq47hhl", "score": "2", "subreddit": "learnprogramming", "subreddit_id": "t5_2r7yd"}, {"author": "LeGrille90", "body": "Glad it's not just me as I'm in a similar boat. It's a my third time around at trying to learn web dev as I did a college elective 12 years ago and again 5 years ago, but never did much beyond HTML and CSS. I've spent the last 2 months grinding through CS50x and now TOP, but this JS portion is just exhausting.", "created_utc": "1664286804.0", "edited": "False", "id": "iq3r435", "is_submitter": "False", "link_id": "t3_xonmdg", "parent_id": "t3_xonmdg", "score": "2", "subreddit": "learnprogramming", "subreddit_id": "t5_2r7yd"}, {"author": "LeGrille90", "body": "I needed to read this today. I'm starting my final project for CS50 before I move on to Odin Project, and I feel completely paralyzed. It's as if the last month and a half didn't happen, and I'm forgetting everything about C, Python, JS, etc. Meanwhile, a quick look at the course's Discord and subreddit makes it seem like everyone has this amazing app or game that they've built from scratch.", "created_utc": "1662979576.0", "edited": "False", "id": "io3vdm9", "is_submitter": "False", "link_id": "t3_xc6y7c", "parent_id": "t3_xc6y7c", "score": "47", "subreddit": "learnprogramming", "subreddit_id": "t5_2r7yd"}, {"author": "LeGrille90", "body": "I met a German girl while backpacking and we were an item for a bit. I've kept it up because I don't want to be thought of as an ignorant monolingual American.", "created_utc": "1662711740.0", "edited": "1662717989.0", "id": "inpabdm", "is_submitter": "False", "link_id": "t3_x9j74g", "parent_id": "t3_x9j74g", "score": "4", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "LeGrille90", "body": "It's definitely been a point of contention.", "created_utc": "1661264068.0", "edited": "False", "id": "ilgiiyx", "is_submitter": "True", "link_id": "t3_wuq5mm", "parent_id": "t1_ilgc3ej", "score": "1", "subreddit": "learnprogramming", "subreddit_id": "t5_2r7yd"}, {"author": "LeGrille90", "body": "I'm bracing myself for the high likelihood of having to go back to the US to work for a bit before I am qualified enough to apply for UK positions and come back here. I actually had thought of teaching English abroad, but my partner's family is having some tough times and she cannot go away again, nor does she want us to go long-distance again. :/", "created_utc": "1661260813.0", "edited": "False", "id": "ilgauch", "is_submitter": "True", "link_id": "t3_wuq5mm", "parent_id": "t1_ilbtyl0", "score": "2", "subreddit": "learnprogramming", "subreddit_id": "t5_2r7yd"}, {"author": "LeGrille90", "body": "I have asked my partner to put me in contact with her friends but she's weirdly hesitant to do so. She says she's supportive my career change plans and focus on studying coding (especially as I can't legally work while I'm here) but also feels the work is too much time indoors. I get plenty of exercise (daily morning jogs at minimum) but she wants me to take a break every hour to take a three-hour walk the beach.", "created_utc": "1661260654.0", "edited": "False", "id": "ilgahdx", "is_submitter": "True", "link_id": "t3_wuq5mm", "parent_id": "t1_ilbwpr1", "score": "1", "subreddit": "learnprogramming", "subreddit_id": "t5_2r7yd"}, {"author": "LeGrille90", "body": ">If you don't enjoy learning a job but push yourself to learn it anyway, then that's a recipe for unhappy life. Some people do that, but you're still young at 31, you have options.\n\nThat's part of what's got me on edge: I do enjoy learning it, but I also need to push myself to learn faster and better if I'm to have any chance to make it in the field. It's so much more pressure knowing I need to be good enough at this to get a job within a year if I'm going to feed myself, pay my student loans, and stay in the UK with my partner. I'm struggling with beginner-level content but can't afford to struggle with it for very long.", "created_utc": "1661175087.0", "edited": "False", "id": "ilbhzj7", "is_submitter": "True", "link_id": "t3_wuq5mm", "parent_id": "t1_ilb86zx", "score": "1", "subreddit": "learnprogramming", "subreddit_id": "t5_2r7yd"}, {"author": "LeGrille90", "body": "Everybody online keeps talking about how to reason it out with drawing the cycles on paper, and I get that, but I just don't understand how recursion even works in this situation and how to express the solution with correct syntax :\\\\", "created_utc": "1661101562.0", "edited": "False", "id": "il7p0cg", "is_submitter": "False", "link_id": "t3_wu0ps2", "parent_id": "t1_il7ewbk", "score": "4", "subreddit": "cs50", "subreddit_id": "t5_2s3yg"}, {"author": "LeGrille90", "body": "It's ok, you aren't alone. I've been banging my head against Tideman for almost a week and have just moved on to week 4. It's bad because I'm technically not even a newcomer to coding: I had a web dev elective in college 12 years ago, and a few courses as part of an online IT degree 6 years ago. Tideman has me feeling that I'm too stupid to understand beginner-level challenges, even after seeking help here and the Discord, and will never succeed in this career switch.", "created_utc": "1661097160.0", "edited": "False", "id": "il7e5rc", "is_submitter": "False", "link_id": "t3_wu0ps2", "parent_id": "t3_wu0ps2", "score": "4", "subreddit": "cs50", "subreddit_id": "t5_2s3yg"}, {"author": "LeGrille90", "body": "I have a bachelor's in English and another in IT, with coursework in a few coding languages and a ton of student debt, so a bootcamp isn't so feasible right now. Maybe a grant will help down the road, but otherwise my only real option is free online resources to build my portfolio.", "created_utc": "1659546211.0", "edited": "False", "id": "iisz1vd", "is_submitter": "False", "link_id": "t3_wekzx4", "parent_id": "t1_iis8f04", "score": "2", "subreddit": "learnprogramming", "subreddit_id": "t5_2r7yd"}, {"author": "LeGrille90", "body": "Congratulations, and I'm incredibly envious/hopeful of your success. I'm 32 next month and planning a self-teaching route in SWE and/or web dev after two unhappy careers in elementary teaching and IT support. Hopefully it's not too late and I'm not too stupid to be where you are in a year or two.", "created_utc": "1659513176.0", "edited": "False", "id": "iir7r70", "is_submitter": "False", "link_id": "t3_wekzx4", "parent_id": "t3_wekzx4", "score": "2", "subreddit": "learnprogramming", "subreddit_id": "t5_2r7yd"}, {"author": "LeGrille90", "body": "My earliest gaming memories were of the NES, particularly SMB/Duck Hunt, Golf, RBI Baseball, Sky Shark, and The Guardian Legend!", "created_utc": "1659224693.0", "edited": "False", "id": "iibheiq", "is_submitter": "False", "link_id": "t3_wc2itp", "parent_id": "t3_wc2itp", "score": "1", "subreddit": "NintendoSwitch", "subreddit_id": "t5_3h47q"}, {"author": "LeGrille90", "body": "Kirby Super Star!", "created_utc": "1657347308.0", "edited": "False", "id": "ifg0a92", "is_submitter": "False", "link_id": "t3_vupwmw", "parent_id": "t3_vupwmw", "score": "1", "subreddit": "NintendoSwitch", "subreddit_id": "t5_3h47q"}, {"author": "LeGrille90", "body": "I've enjoyed the episodes I've watched but still feel put off by the animation. The characters having no teeth or chins, and frequently looking directly into the \"camera\" makes me uncomfortable.", "created_utc": "1647779629.0", "edited": "False", "id": "i1eac51", "is_submitter": "False", "link_id": "t3_tibdjj", "parent_id": "t1_i1d130f", "score": "2", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "LeGrille90", "body": "Fun fact: Corned beef's association with St. Patrick's Day in North America comes from the availability of beef over more traditional bacon in 19th century immigrant communities!", "created_utc": "1647013164.0", "edited": "False", "id": "i091yal", "is_submitter": "False", "link_id": "t3_tbsjy5", "parent_id": "t3_tbsjy5", "score": "18", "subreddit": "bingingwithbabish", "subreddit_id": "t5_3ialh"}, {"author": "LeGrille90", "body": "The game says it's [Mos Eisley](https://starwars.fandom.com/wiki/Ambush_at_Mos_Eisley).", "created_utc": "1645988168.0", "edited": "False", "id": "hyoee2j", "is_submitter": "False", "link_id": "t3_t2pu7h", "parent_id": "t1_hyob544", "score": "29", "subreddit": "gaming", "subreddit_id": "t5_2qh03"}, {"author": "LeGrille90", "body": "Good point. I thought about this way too much and looked for [the clip](https://www.youtube.com/watch?v=C__m6ROZijY). Moody Foodie doesn't even get the kale burger, and asks for a cheeseburger! The writers probably thought the outfit was a memorable and funny disguise, and didn't think of the various cultural implications.", "created_utc": "1645727416.0", "edited": "False", "id": "hy9urxd", "is_submitter": "False", "link_id": "t3_sypzru", "parent_id": "t1_hy9sixl", "score": "1", "subreddit": "bingingwithbabish", "subreddit_id": "t5_3ialh"}, {"author": "LeGrille90", "body": "I noticed that too. I don't recall if they mention cheese in that episode, but they did include it in the cookbook recipe Babish is using. That said, nobody in the episode ever mentions the burger not being kosher, and the Hassidic Jewish customer is actually a critic in disguise, so the writers probably just overlooked that detail.", "created_utc": "1645574152.0", "edited": "False", "id": "hy1872k", "is_submitter": "False", "link_id": "t3_sypzru", "parent_id": "t1_hy0mkyj", "score": "6", "subreddit": "bingingwithbabish", "subreddit_id": "t5_3ialh"}, {"author": "LeGrille90", "body": "Same, I wanted to play Overwatch for the cool superhero characters and worldbuilding. I stopped when it turned into \"play for hours every day, memorize the patch notes and latest meta or that number by your name will remind everyone that you're a CASUAL NOBODY when you could be a glorious OWL pro.\"", "created_utc": "1645199283.0", "edited": "False", "id": "hxghyaj", "is_submitter": "False", "link_id": "t3_svfjx9", "parent_id": "t1_hxgbo9c", "score": "8", "subreddit": "LifeProTips", "subreddit_id": "t5_2s5oq"}, {"author": "LeGrille90", "body": "I needed to see this. I can't just play a game to quietly relax and have fun anymore, not when I remember that there are people making money by streaming and posting videos of their no-death high-difficulty speedrun of newest title.", "created_utc": "1645189426.0", "edited": "False", "id": "hxfvyzf", "is_submitter": "False", "link_id": "t3_svfjx9", "parent_id": "t1_hxfp9x5", "score": "31", "subreddit": "LifeProTips", "subreddit_id": "t5_2s5oq"}, {"author": "LeGrille90", "body": "Congratulations on your progress, and stick with it! I was in a similar boat: I met a German girl while backpacking, started learning the language, and was unsure of whether to continue after the relationship fell apart. I ultimately kept going because I wanted to have a valuable skill and break out of the monolingual American stereotype. \n\nNow it's been over two years since I've started, I've met other German friends, learned more about their culture and history, and look forward to finally visiting Germany with my new partner (non-German speaker but very supportive). I can't separate my language journey from that failed relationship, but I've managed to make many more positive associations.\n\nI think you can do the same. Read about the history and sights in places where your target language is spoken, research jobs that you could do with your language skills, and find media to enjoy in that language. You can overcome this funk! :)", "created_utc": "1645126143.0", "edited": "False", "id": "hxciqm7", "is_submitter": "False", "link_id": "t3_suugu5", "parent_id": "t3_suugu5", "score": "40", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "LeGrille90", "body": "Absolutely! I grew up in rural New Hampshire and had a choice of French, Spanish, or Latin for my HS language requirement. Should I do French because we're so close to Quebec? Or should I take Spanish because of it's wide use in the US? Or maybe you are too poor to even think about leaving your white-bread state and are pressured into taking as much STEM as possible for a shot at college. I wound up taking Latin in hopes I'd have a better foundation for more practical languages down the line.\n\nNow I've had a chance to travel and despite squeezing some language learning into my adult routine, get teased for only speaking English comfortably. I must be a nationalist, racist, uncultured moron, right? /s", "created_utc": "1645019000.0", "edited": "False", "id": "hx66guj", "is_submitter": "False", "link_id": "t3_skm7m3", "parent_id": "t3_skm7m3", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "LeGrille90", "body": "Thank you for the encouragement. I’m going to try to dedicate some time each day to different resources to feel more well-rounded, though I’m worried it is hopeless learning without real conversation practice. \n\nAlso, I should specify that the German guys I met commented that my American accent made my *English* sound “dirty” compared to the accents of our Scottish and Welsh friends. I can only imagine how much they’d hate the sound of me speaking German.", "created_utc": "1644845777.0", "edited": "False", "id": "hwwnl8a", "is_submitter": "True", "link_id": "t3_srlxj8", "parent_id": "t1_hwskgjc", "score": "1", "subreddit": "German", "subreddit_id": "t5_2qq51"}, {"author": "LeGrille90", "body": "Thank you! The fact that MSM are ineligible is still a sour point, but I'm glad to see it doesn't negatively impact your support. I've sadly encountered people who are eligible but refuse to donate in protest of the Red Cross policy, which ultimately hurts those in need.", "created_utc": "1640544433.0", "edited": "False", "id": "hq1x8pm", "is_submitter": "True", "link_id": "t3_rht90q", "parent_id": "t1_hq1q2nd", "score": "1", "subreddit": "wholesomememes", "subreddit_id": "t5_3gcwj"}, {"author": "LeGrille90", "body": "I came looking for a topic like this and your advice is helpful. I only just picked up Smash again this week after not touching it since Wii U, and I'm finding myself angry and frustrated even when playing against CPUs. I don't want to keep putting myself down when I lose, or saying mean, hurtful things to opponents if I ever win.", "created_utc": "1640126697.0", "edited": "False", "id": "hphfahx", "is_submitter": "False", "link_id": "t3_qua6dm", "parent_id": "t1_hkp77at", "score": "2", "subreddit": "smashbros", "subreddit_id": "t5_2qiep"}, {"author": "LeGrille90", "body": "That's quite alright, it's a legitimate phobia, and one I hope you can overcome! If not, there's lots of ways to volunteer that don't involve getting stuck :)", "created_utc": "1639755256.0", "edited": "False", "id": "hoxfpug", "is_submitter": "True", "link_id": "t3_rht90q", "parent_id": "t1_hoxdkyx", "score": "1", "subreddit": "wholesomememes", "subreddit_id": "t5_3gcwj"}, {"author": "LeGrille90", "body": "Interesting to learn that! I'll have to read more about this: https://slate.com/news-and-politics/2006/09/does-the-red-cross-sell-blood.html", "created_utc": "1639753544.0", "edited": "False", "id": "hoxbhtx", "is_submitter": "True", "link_id": "t3_rht90q", "parent_id": "t1_hox6wxf", "score": "1", "subreddit": "wholesomememes", "subreddit_id": "t5_3gcwj"}, {"author": "LeGrille90", "body": "12 years since my first donation according to the app! What happened to the time?!?", "created_utc": "1639691288.0", "edited": "False", "id": "hou2fmq", "is_submitter": "True", "link_id": "t3_rht90q", "parent_id": "t1_hotyx5b", "score": "3", "subreddit": "wholesomememes", "subreddit_id": "t5_3gcwj"}, {"author": "LeGrille90", "body": "Hi five from another double red donor!", "created_utc": "1639683511.0", "edited": "False", "id": "hotij76", "is_submitter": "True", "link_id": "t3_rht90q", "parent_id": "t1_hotgraq", "score": "1", "subreddit": "wholesomememes", "subreddit_id": "t5_3gcwj"}, {"author": "LeGrille90", "body": "Thank you! It's always nice to get support from those that can't donate for any number of reasons, and drives are always looking for volunteers to assist in other ways that don't involve getting blood drawn.", "created_utc": "1639672957.0", "edited": "False", "id": "hosrctd", "is_submitter": "True", "link_id": "t3_rht90q", "parent_id": "t1_hosozsi", "score": "2", "subreddit": "wholesomememes", "subreddit_id": "t5_3gcwj"}, {"author": "LeGrille90", "body": "Good on you! Yesterday was my 33rd, and I still feel a little nervous beforehand, but it's always a major confidence booster.", "created_utc": "1639672622.0", "edited": "False", "id": "hosqhnp", "is_submitter": "True", "link_id": "t3_rht90q", "parent_id": "t1_hosptyt", "score": "3", "subreddit": "wholesomememes", "subreddit_id": "t5_3gcwj"}, {"author": "LeGrille90", "body": "Well done! I was doing the same for awhile and hope to do so again once my transportation to the donation center is steadier.", "created_utc": "1639670778.0", "edited": "False", "id": "hoslst7", "is_submitter": "True", "link_id": "t3_rht90q", "parent_id": "t1_hosjdm2", "score": "1", "subreddit": "wholesomememes", "subreddit_id": "t5_3gcwj"}, {"author": "LeGrille90", "body": "I needed to see this. I still don't own a Switch despite being a lifelong Nintendo fan (life challenges got in the way), and have been pretty bummed out by all the conversation about SSBU being \"finished\" with the Sora DLC, like I missed my chance to ever enjoy that game. \n\nI decided I'd get myself an OLED model, but product shortages have put that plan on hold for the foreseeable future. Even if I'm not playing Smash until months from now, the game will still have loads of content and an active community for years to come.", "created_utc": "1637086900.0", "edited": "False", "id": "hkvstnw", "is_submitter": "False", "link_id": "t3_qva0ii", "parent_id": "t3_qva0ii", "score": "3", "subreddit": "NintendoSwitch", "subreddit_id": "t5_3h47q"}, {"author": "LeGrille90", "body": "It’s okay, and as others have said on here, it’s perfectly fine to take a break if you aren’t feeling the same enjoyment. I went through the same thing a few years ago, and I think it had a lot to do with the changing culture surrounding games. Casually picking up a new game or revisiting an old one felt pointless if I knew some kid was basking in admiration and sponsorship money by streaming, speedrunning, playing competitively, etc.  \nSeparate yourself from games for a while, think about what you used to like about them, and see if you can find those same qualities in new hobbies! I was lucky enough to go backpacking, and between the challenge of the outdoors and exploring new cities, I gained a new appreciation for the open-world games and artsy platformers I used to love.  \nYou mentioned in another comment that you are starting university. What kind of courses will you take? Are there clubs that catch your eye? If you like BF1, Fallout, War Thunder, etc. consider courses about military history or historical / speculative fiction writing, or even just check out the books at your uni’s library or a local museum. There are also bound to be tabletop gaming groups if you want to try RPGs like Fallout in a different, screen-free setting. Good luck!", "created_utc": "1635159802.0", "edited": "False", "id": "hhz02pk", "is_submitter": "False", "link_id": "t3_qfa82o", "parent_id": "t3_qfa82o", "score": "1", "subreddit": "pcmasterrace", "subreddit_id": "t5_2sgp1"}, {"author": "LeGrille90", "body": "A)   Thank you for the tip about the OLED Switch, I’ll read up a bit more and reevaluate if it’s worth it!\n\nB)   That’s pretty much exactly how it went. I won my first match, and my opponent was gracious enough for a smile and a handshake. Unfortunately, my second opponent didn’t even make eye contact, had his friend sit next to him and put me down the whole time, and they just walked away after he won. Who raises their kid to act like that?\n\nC)   That’s great to hear, particularly about the single player elements being so comprehensive, and I’ve enjoyed watching the Sakurai Presents just because of how much care goes into these DLC characters. If only a veteran like Samus could get a swappable weapon like Min-Min, or Ganondorf’s moves were as accurate to his mainline appearances as Sephiroth’s! I don’t have a ton of experience with online games outside of a few PC shooters, Splatoon 1, and Mario Kart 8, so my bar is pretty low as far as performance.\n\nRegarding competitive, I suppose I’m not sure what I’m looking for either: I know I don’t have the time or reflexes to be winning tournaments and stuff like that, but I’d be happy to be involved in the community, know I was improving in a meaningful way, and get to know other people that love the series. Despite being the best-selling fighting game on a remarkably successful console, I don’t have any close friends that play it.", "created_utc": "1634641551.0", "edited": "False", "id": "hh7w9a0", "is_submitter": "True", "link_id": "t3_qaqyni", "parent_id": "t1_hh7h5z4", "score": "2", "subreddit": "smashbros", "subreddit_id": "t5_2qiep"}, {"author": "LeGrille90", "body": "Kia ora! Thank you for the invitation but sadly I’ve returned to the US. It was a friend in Wellington that shared his setup and gave me my first taste of Ultimate, and I’m glad to hear it is just as popular over there!", "created_utc": "1634639895.0", "edited": "False", "id": "hh7u449", "is_submitter": "True", "link_id": "t3_qaqyni", "parent_id": "t1_hh6awvv", "score": "1", "subreddit": "smashbros", "subreddit_id": "t5_2qiep"}, {"author": "LeGrille90", "body": "Thank you for the recommendation, I’ll check out the series! I’ve always had trouble picking a main because I’m so sentimental about characters. \n\nI’m glad there is still decently pool of lower level players this long after launch, this was my primary worry: I’d hate to buy the game, find people to play with, and discover that anything short of frame-perfect combos with a single character was completely nonviable.", "created_utc": "1634639582.0", "edited": "False", "id": "hh7tpnr", "is_submitter": "True", "link_id": "t3_qaqyni", "parent_id": "t1_hh5yabi", "score": "1", "subreddit": "smashbros", "subreddit_id": "t5_2qiep"}, {"author": "LeGrille90", "body": "That’s amazing! It’s great to hear about someone picking up a new hobby and flourishing, especially when it’s so easy to be chased off by people whom have seemingly mastered everything about it.", "created_utc": "1634638846.0", "edited": "False", "id": "hh7st2z", "is_submitter": "True", "link_id": "t3_qaqyni", "parent_id": "t1_hh5fnud", "score": "2", "subreddit": "smashbros", "subreddit_id": "t5_2qiep"}, {"author": "LeGrille90", "body": "That’s a good tip, and I now live in much better location for those sorts of places, so I’ll take a look!", "created_utc": "1634583506.0", "edited": "False", "id": "hh544us", "is_submitter": "True", "link_id": "t3_qaqyni", "parent_id": "t1_hh53dn7", "score": "5", "subreddit": "smashbros", "subreddit_id": "t5_2qiep"}, {"author": "LeGrille90", "body": "Good to hear! It looks incredible and I know it’s sold well. I don’t want to be too late if I finally pick it up 3 years after launch and start struggling to learn all the new characters.", "created_utc": "1634583043.0", "edited": "False", "id": "hh530e3", "is_submitter": "True", "link_id": "t3_qaqyni", "parent_id": "t1_hh50d62", "score": "1", "subreddit": "smashbros", "subreddit_id": "t5_2qiep"}, {"author": "LeGrille90", "body": "Yeah, it was definitely a poorly-run event.", "created_utc": "1634582630.0", "edited": "False", "id": "hh5209q", "is_submitter": "True", "link_id": "t3_qaqyni", "parent_id": "t1_hh4yba6", "score": "7", "subreddit": "smashbros", "subreddit_id": "t5_2qiep"}, {"author": "LeGrille90", "body": "Thank you for the tip! I wasn’t sure if there was any tolerance  \nfor chat in a fighting game, since I’ve only ever used it in team shooting  \ngames or cooperative Minecraft servers.   \nI’m also glad to hear about the speed of the game. Melee has a special place in my heart, but I can barely tell what’s happening on screen when I see videos  \nof high-level players.", "created_utc": "1634582521.0", "edited": "False", "id": "hh51qux", "is_submitter": "True", "link_id": "t3_qaqyni", "parent_id": "t1_hh4ue96", "score": "4", "subreddit": "smashbros", "subreddit_id": "t5_2qiep"}, {"author": "LeGrille90", "body": "That’s pretty cool that the matchmaking system works so  \nwell: most of my other online game experience either had no skill matchmaking (TF2) or bred lots of hostility (Overwatch).", "created_utc": "1634581965.0", "edited": "False", "id": "hh50djk", "is_submitter": "True", "link_id": "t3_qaqyni", "parent_id": "t1_hh4ufcm", "score": "5", "subreddit": "smashbros", "subreddit_id": "t5_2qiep"}, {"author": "LeGrille90", "body": "  \nThat’s good to hear, since the series’ main draw for me was  \nalways the crossover element: the fact that Mario can fight Sephiroth and Steve  \nstill blows my mind.   \nThank you for sharing that detail about tournaments with  \nfriendly setups. The one I went to had only one setup, so I’ll be on the  \nlookout for better ones if I go for it!", "created_utc": "1634581049.0", "edited": "False", "id": "hh4y59r", "is_submitter": "True", "link_id": "t3_qaqyni", "parent_id": "t1_hh4sibz", "score": "26", "subreddit": "smashbros", "subreddit_id": "t5_2qiep"}, {"author": "LeGrille90", "body": "I feel something similar. I played all of them except Ultimate because I still don't own a Switch. I considered getting one when Smash launched, but the reality is that I have nobody I can play with in my adult life. I still watch all the Directs, but they just make me wish for a time when my family and friends were close enough to share gaming memories.", "created_utc": "1633429599.0", "edited": "False", "id": "hfgont8", "is_submitter": "False", "link_id": "t3_q19wq0", "parent_id": "t1_hfe0v7i", "score": "1", "subreddit": "nintendo", "subreddit_id": "t5_2qhnk"}, {"author": "LeGrille90", "body": "My discipline is ok (military parent), and I’ve been able to practice at least a little bit every day, though that practice has deteriorated to little more than keeping up the DuoLingo streak, though I barely retain anything. I just wind up frustrated when some question is marked wrong for a reason that was never explained.\n\nI’ve tried listening to the GermanPod101 podcast, and I follow the EasyGerman YouTube channel, though I’m intimidated about where I should start with their many videos. I feel ashamed about watching movies or shows alone, and I don’t think anyone will want to watch “Dark” or other German-language programming with me just to be accomodating: Every time I’ve told someone I’ve been trying to learn German, their first response is “Why?” \n\nI’m glad to hear your experience learning Italian is going well, and that’s the kind of feeling I’d love to have one day. Overcoming the anxiety of learning is sometimes more difficult than the language itself.", "created_utc": "1598077109.0", "edited": "False", "id": "g2f757u", "is_submitter": "True", "link_id": "t3_ie4qoe", "parent_id": "t1_g2egwwh", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "LeGrille90", "body": "I think what I want for my skill set is to be able to switch between at least two different languages as easily as most of the international travelers I’ve met while I’ve been in NZ: people younger than myself who can arrive in a country where the mother tongue is different than their own and still make friends, tell jokes, find work, and communicate as easily as they could at home. The fact that I can meet groups of Germans, French, Dutch, etc.  in a hostel kitchen, and they can all switch to English for my sake, is impressive but leaves me feeling horribly guilty, like they are prepared to accommodate me but I can not do the same for them.", "created_utc": "1598075368.0", "edited": "False", "id": "g2f2ph3", "is_submitter": "True", "link_id": "t3_ie4qoe", "parent_id": "t1_g2e7h2z", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "LeGrille90", "body": "Thanks for the recommendation, and your situation is encouraging. I saw from your post history that you are a teacher and “want out”, same as myself. When NZ began lockdown, I was spending hours a day studying. Unfortunately, seeing the news from home and the rest of the world made the long-term goal of teaching English abroad seem increasingly distant. Some days I’m actually afraid that I’ll be forced to return to America, and the combination of travel restrictions and economic impact will prevent me from ever leaving again.\n\nI’ll look into iTalki. At the moment I have nobody with whom to speak, and I’m a bit nervous that my listening comprehension is so poor after 8 months of daily practice, short of simple “tourist” phrases.", "created_utc": "1598074413.0", "edited": "False", "id": "g2f03a9", "is_submitter": "True", "link_id": "t3_ie4qoe", "parent_id": "t1_g2dk2h7", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "LeGrille90", "body": "Interest in the culture was a major motivator at first: wanting to feel closer to the girl, and understand more about how and where she grew up. It’s encouraging to hear that you feel fulfilled learning even when there is little practical use at home, as I am in the same boat. I come from a lovely but notoriously homogeneous state, and I’m worried that my German studies would ultimately be nothing but a silly party trick.", "created_utc": "1598073426.0", "edited": "False", "id": "g2exxuj", "is_submitter": "True", "link_id": "t3_ie4qoe", "parent_id": "t1_g2eia7l", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "LeGrille90", "body": "Sometimes I’ve told myself to keep going just to challenge myself and feel some accomplishment at getting closer to bilingualism, though I’m nervous that I’d be veering into r/iamverysmart territory instead of actually having a practical skill and a way of communicating with more people.", "created_utc": "1598072635.0", "edited": "False", "id": "g2evoio", "is_submitter": "True", "link_id": "t3_ie4qoe", "parent_id": "t1_g2dijin", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "LeGrille90", "body": "I think the interest was only due to actually having a personal connection to a native speaker and learning about the culture. I could have just as easily met someone that spoke Spanish or French, and started learning with them. I’d love to travel and visit Germany/Austria/Switzerland one day, but not to any greater degree than anywhere else on my bucket list. Discipline to my routine is the overriding factor now.", "created_utc": "1598072426.0", "edited": "False", "id": "g2ev6l5", "is_submitter": "True", "link_id": "t3_ie4qoe", "parent_id": "t1_g2dbu1m", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "LeGrille90", "body": ">Agreed. I prefer content that's more curated, blocked out with planned break points, and free of distraction over many hours of free-for-all. I plan to give this new podcast a shot, but my distaste for the streaming format means I'm not likely to watch anything Pat does. \n\n&#x200B;", "created_utc": "1547041292.0", "edited": "False", "id": "edmrwgb", "is_submitter": "False", "link_id": "t3_ae438w", "parent_id": "t1_edmaz3s", "score": "0", "subreddit": "TwoBestFriendsPlay", "subreddit_id": "t5_2uzei"}, {"author": "LeGrille90", "body": "The Hobbit: Battle of the Five Armies", "created_utc": "1545013816.0", "edited": "False", "id": "ebyc5ly", "is_submitter": "False", "link_id": "t3_a6rmvy", "parent_id": "t1_eby9z7b", "score": "13", "subreddit": "TwoBestFriendsPlay", "subreddit_id": "t5_2uzei"}, {"author": "LeGrille90", "body": "Weird, worked for me. Fixed it anyway, though. Thanks!", "created_utc": "1544982689.0", "edited": "False", "id": "ebx5wy4", "is_submitter": "False", "link_id": "t3_a6ombf", "parent_id": "t1_ebx4qol", "score": "1", "subreddit": "TwoBestFriendsPlay", "subreddit_id": "t5_2uzei"}, {"author": "LeGrille90", "body": "Glad to know someone else thought of this. A little, heartwarming reveal as this chapter comes to an end.", "created_utc": "1544980669.0", "edited": "False", "id": "ebx34ke", "is_submitter": "False", "link_id": "t3_a6p00e", "parent_id": "t1_ebwthqh", "score": "27", "subreddit": "TwoBestFriendsPlay", "subreddit_id": "t5_2uzei"}, {"author": "LeGrille90", "body": "Mine is most likely Pat perfectly summarizing how he (and many others) became a weeb. [Resident Evil 2 - Part 9](https://www.youtube.com/watch?v=3VewNP_OYcc&feature=youtu.be&t=620)", "created_utc": "1544974083.0", "edited": "1544982533.0", "id": "ebwvra5", "is_submitter": "False", "link_id": "t3_a6ombf", "parent_id": "t3_a6ombf", "score": "7", "subreddit": "TwoBestFriendsPlay", "subreddit_id": "t5_2uzei"}, {"author": "LeGrille90", "body": "You've survived incredible hardship, and you're not alone in feeling some comfort from the Zaibatsu's content. I had a similar experience with homelessness around the same time, and watching Silent Hill: Downpour brought some much-needed laughter. Shitstorm 2 gave me a routine to follow after a bad break-up. Earlier this year, I was hospitalized after my suicidal thoughts became known at my workplace. The night I was let out, I fell asleep at my mom's apartment watching Binary Domain and What Happened BMX XXX on my phone. \n\n&#x200B;\n\nIf nothing else, SBFP helped people like us know companionship and support through our shared love of games, anime, and all kinds of goofy things. It'll be hard moving forward from here, but we can remember the good times and look forward to the new memories yet to be made.", "created_utc": "1544973692.0", "edited": "False", "id": "ebwvcd0", "is_submitter": "False", "link_id": "t3_a6opr6", "parent_id": "t3_a6opr6", "score": "16", "subreddit": "TwoBestFriendsPlay", "subreddit_id": "t5_2uzei"}, {"author": "LeGrille90", "body": "Kingdom Hearts, part 4.", "created_utc": "1543235678.0", "edited": "False", "id": "eahy69r", "is_submitter": "False", "link_id": "t3_a0f5ja", "parent_id": "t1_eahl9xa", "score": "2", "subreddit": "TwoBestFriendsPlay", "subreddit_id": "t5_2uzei"}, {"author": "LeGrille90", "body": "I used MS Visio to make the Ocarina of Time one, and didn't even bother with transparency or downloaded fonts. Give it a try, it's all about the spirit of the joke!", "created_utc": "1543235554.0", "edited": "False", "id": "eahy36m", "is_submitter": "False", "link_id": "t3_a0f5ja", "parent_id": "t1_eahabxh", "score": "2", "subreddit": "TwoBestFriendsPlay", "subreddit_id": "t5_2uzei"}, {"author": "LeGrille90", "body": "I'm sorry, today is my birthday too. I have been skipping the LP of Tales from the Borderlands to play it myself since it's been in my backlog for awhile, and I really enjoyed Tales of Monkey Island. ", "created_utc": "1537586856.0", "edited": "False", "id": "e6f3as6", "is_submitter": "False", "link_id": "t3_9hthiu", "parent_id": "t1_e6el8ot", "score": "3", "subreddit": "TwoBestFriendsPlay", "subreddit_id": "t5_2uzei"}, {"author": "LeGrille90", "body": "Stuff like this is cool and what got me hooked on the Overwatch universe, but I uninstalled the game months ago and am afraid to go back. The toxicity of competitive and my own anxiety made playing so stressful, even winning wasn't fun. ", "created_utc": "1534939119.0", "edited": "False", "id": "e4mkeyi", "is_submitter": "False", "link_id": "t3_99c7it", "parent_id": "t3_99c7it", "score": "12", "subreddit": "TwoBestFriendsPlay", "subreddit_id": "t5_2uzei"}, {"author": "LeGrille90", "body": "Thanks, hopefully I can make it healthy again.", "created_utc": "1529616868.0", "edited": "False", "id": "e12net8", "is_submitter": "True", "link_id": "t3_8svlco", "parent_id": "t1_e12m1pq", "score": "1", "subreddit": "whatsthisplant", "subreddit_id": "t5_2si8i"}, {"author": "LeGrille90", "body": "I lost my job of 3.5 years today. I didn't love it, but it was stable if not lucrative. I've been back in school to try to make a career change, but even near the end of my program, I'm not very good at it, nor do I have any passion for the material: it's all been a move to try to make a better living. I'm afraid that despite all my work, I have nothing to look forward to, nor anything to fall back on.", "created_utc": "1529023522.0", "edited": "False", "id": "e0owy74", "is_submitter": "False", "link_id": "t3_8r4e02", "parent_id": "t3_8r4e02", "score": "2", "subreddit": "GetMotivated", "subreddit_id": "t5_2rmfx"}, {"author": "LeGrille90", "body": " I haven’t had a date since my only girlfriend dumped me 5 years ago, and it feels like I’ll never meet anyone again. I’ve followed all the advice: I started running, lost weight, changed jobs twice, I’m back in school for a career change, and I try to volunteer a few times a year, but realistically, I won’t find anybody. Asking out a coworker is begging for trouble, I can’t approach anyone at the gym without risking looking like a creep, online courses are affordable but lonely, and I don’t earn enough money to do exciting things with the little free time I have. Online dating was just depressing after getting repeatedly ghosted over the span of two weeks. \n\nI’m very unhappy, and I’ve heard I can’t be loved until I love myself, but also that I’ll be alright once I meet someone. ", "created_utc": "1528169592.0", "edited": "False", "id": "e04qy4t", "is_submitter": "False", "link_id": "t3_8oj20r", "parent_id": "t3_8oj20r", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "LeGrille90", "body": "Same! My classmates were telling me how good Iron Man was, but I was skeptical because of how bad recent Marvel films had been (X Men 3, FF, Ghost Rider, etc). A friend lent me the DVD, and I've since seen every MCU film on opening night/weekend, except for Thor 2 due to bad circumstances.", "created_utc": "1525025087.0", "edited": "False", "id": "dy67hyb", "is_submitter": "False", "link_id": "t3_8fi27n", "parent_id": "t1_dy3uxax", "score": "3", "subreddit": "TwoBestFriendsPlay", "subreddit_id": "t5_2uzei"}, {"author": "LeGrille90", "body": "Thank you for the advice. I have considered changing to a different school district. I went into teaching as a kind of trial: I was unhappy in data-entry, and a friend recommended I try subbing while I explore my career options. Most of the kids I work with are fine but administrative problems, coworkers, poor work/life balance, and unhelpful parents make the thought of a career unpleasant.\n\n“Find your passion” is frequently thrown my way, but I’ve never been able to choose mine. I mentioned my dad shot down anything I was ever interested in, and now I’m a working adult with an exhausting, low-wage job. I don’t enjoy much of anything anymore, and the extent of finding my passion is whatever cheap class is offered at the town library at night. I was hospitalized for a suicide attempt a few months ago, but I can’t even afford therapy. It’s like I need to have money before I can buy the peace of mind to be comfortable enough with life to find a passion. I tried to skip a few steps by going for IT, hoping a vague interest could become a passion for coding over time, but I’m in over my head.\n", "created_utc": "1524605173.0", "edited": "False", "id": "dxwpop7", "is_submitter": "True", "link_id": "t3_8els89", "parent_id": "t1_dxwlxbp", "score": "1", "subreddit": "cscareerquestions", "subreddit_id": "t5_2sdpm"}, {"author": "LeGrille90", "body": "I was hoping for some guidance about making a drastic career change, especially when you still have to juggle your prior work and have no transferrable skills/experience. I’m glad you were able to succeed so spectacularly.", "created_utc": "1524604024.0", "edited": "False", "id": "dxwofl2", "is_submitter": "True", "link_id": "t3_8els89", "parent_id": "t1_dxwf7e7", "score": "1", "subreddit": "cscareerquestions", "subreddit_id": "t5_2sdpm"}, {"author": "LeGrille90", "body": "I hadn’t thought of governments/internships, though I’m a little worried about what options exist. I already work full-time, have been having trouble finding anything else, and where I live isn’t exactly bustling (Southern NH, local government is usually 1 room in an old town hall). Still, thank you for the recommendations.", "created_utc": "1524603742.0", "edited": "False", "id": "dxwo49u", "is_submitter": "True", "link_id": "t3_8els89", "parent_id": "t1_dxwd80f", "score": "1", "subreddit": "cscareerquestions", "subreddit_id": "t5_2sdpm"}, {"author": "LeGrille90", "body": "I’ve looked at technical writing, but everybody wants experience I don’t have. My skills at both English and technology are abysmal, as I’m struggling to just get out of bed most days, let alone make some high-quality product for my classes/portfolio/resume.\n\nAs I commented on the other reply, I didn’t even realize IT and CS were different. I chose my college’s IT program because it seemed like the best way to “learn computers” before committing to a specialty I knew next to nothing about. Building my PC was neat project, but I’ve lost all enthusiasm for the field. I don’t even play PC games that much anymore, which was my whole reason to build my own machine. I went into this field of study with a vague goal that I could earn more money and have a career path “click” along the way, but I’ve wound up barely scraping by with passing grades while I try not to succumb to the pressure of everything else in my life.\n", "created_utc": "1524593477.0", "edited": "False", "id": "dxwbupy", "is_submitter": "True", "link_id": "t3_8els89", "parent_id": "t1_dxw9qga", "score": "1", "subreddit": "cscareerquestions", "subreddit_id": "t5_2sdpm"}, {"author": "LeGrille90", "body": "I didn’t even realize IT and CS were different things. Shows how much I knew going in, and now I realize I’ve wasted 2.5 more years of my life with this. \nI’m down about school work, but I can fake it during interviews and stuff. The problem is I can’t get past the hurdle of “special-needs child screamed at me all day, now I’ll go home and write this design document.\n", "created_utc": "1524593038.0", "edited": "False", "id": "dxwbc88", "is_submitter": "True", "link_id": "t3_8els89", "parent_id": "t1_dxw8v2c", "score": "1", "subreddit": "cscareerquestions", "subreddit_id": "t5_2sdpm"}, {"author": "LeGrille90", "body": "For all the shade this series gets from the Zaibatsu, I still enjoyed the original GoW trilogy. I can't play this because I don't have a PS4, and I'm too down about everything to care about spoilers, but watching these guys play it is already shaping up to be a real treat.", "created_utc": "1524421201.0", "edited": "False", "id": "dxsf3rm", "is_submitter": "False", "link_id": "t3_8e00q0", "parent_id": "t3_8e00q0", "score": "2", "subreddit": "TwoBestFriendsPlay", "subreddit_id": "t5_2uzei"}, {"author": "LeGrille90", "body": "That’s the problem, though: I know the correlation is supposed to be there, but I can’t find it. I don’t get some big endorphin rush when I’m running or lifting. I finish my workout feeling like a failure, like somehow I’m too broken for the most common depression remedy in the work to fix. I can’t afford to go back to therapy or on meds, not on my income. I barely earn enough to pay my rent, car costs, and feed myself as cheaply and healthily as possible.  \nAs for the non-appearance benefits of exercise and healthy eating, I ask myself “why bother”. So I can live a longer life of solitude and near-poverty? I’m alone, too hideous to meet anyone, and will never earn enough to have an interesting life worth enjoying on its own.\n", "created_utc": "1522031739.0", "edited": "False", "id": "dwaflt9", "is_submitter": "True", "link_id": "t3_85bh3p", "parent_id": "t1_dwa7ccj", "score": "1", "subreddit": "EOOD", "subreddit_id": "t5_2zw1d"}, {"author": "LeGrille90", "body": "I can't afford to go to a doctor. My emergency room visit has pushed me further into debt. I've read articles like those before, and I've been trying for so long and gotten nowhere. \"Lose your bad habits, exercise, eat right, feel happy about your coffee and sunshine, go to a therapist\".  \nEven today, I run for 40 minutes, eat nothing but, eggs, vegetables, fruit, chicken, and a little peanut butter, study programming, and all I think is \"I'll never be happy. I was never allowed to be happy and now I don't know how\".", "created_utc": "1521682211.0", "edited": "False", "id": "dw2zpoo", "is_submitter": "True", "link_id": "t3_85bh3p", "parent_id": "t1_dw0d8rc", "score": "1", "subreddit": "EOOD", "subreddit_id": "t5_2zw1d"}, {"author": "LeGrille90", "body": "Turok Evolution. I played the original 3 games on the N64, and although I felt the first was the strongest, the sequels still had fun weapons, bosses, and art direction.  \nEvolution, though, was a trash fire of cheap deaths, tedious fights, long load times, and obnoxious glitches. I watched characters T-pose and sink into the floor in an in-engine cutscene. I never bothered with the 2008 reboot, and since it never came to PC, probably never will. I was glad to see the Night Dive remasters of 1 and 2 on Steam, though.  \nAs an aside, I didn't try Rage Wars until years later, but that barely counts in my mind. ", "created_utc": "1521606357.0", "edited": "False", "id": "dw18ojs", "is_submitter": "False", "link_id": "t3_85uctn", "parent_id": "t3_85uctn", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "LeGrille90", "body": "I wouldn’t downvote you, there is certainly legitimate correlation between mentality and physical health, as seen with the well-observed placebo effect. Unfortunately, I can’t kickstart the cycle of “exercise will help me feel better, and when I feel better, I’ll be motivated to exercise more.” I only manage to stay on a workout schedule because of some sad variation on the Monty Hall Problem: I can not exercise and know I’ll feel bad, or I can go exercise and have chance of feeling either good or bad. I always go to exercise but have yet to feel good about it.  \nAs for shame, there’s loads of it: I’m ashamed of my career, my lack of relationships, my uninteresting experiences, and especially that my efforts to improve things through exercise, schooling, and hobbies have not worked. The hardest part is replacing that shame with any pride or dignity when I absolutely don’t deserve it as a poor, single, unattractive person.\n", "created_utc": "1521496685.0", "edited": "False", "id": "dvyoojs", "is_submitter": "True", "link_id": "t3_85bh3p", "parent_id": "t1_dvxjqxd", "score": "3", "subreddit": "EOOD", "subreddit_id": "t5_2zw1d"}, {"author": "LeGrille90", "body": "Thank you for the advice. When I was in therapy, I tried cognitive behavior therapy which involved keeping a journal like that, but I could barely go a day or two before I realized there wasn’t enough variation to correlate any pattern. My days consist of working at a job I hate, exercising which never makes me feel better, then studying for a career change for which I have no passion. There isn’t much time or money to try out new things. ", "created_utc": "1521422503.0", "edited": "False", "id": "dvx41f8", "is_submitter": "True", "link_id": "t3_85bh3p", "parent_id": "t1_dvwy07k", "score": "2", "subreddit": "EOOD", "subreddit_id": "t5_2zw1d"}, {"author": "LeGrille90", "body": "Thank you for the tips. I'm sorry if my examples seemed very lazy. Like everything else, I'm a failure at getting in shape. I don't sleep well from work/school stress and hunger. I do record workouts, but the fact that I am still alone after all this time suggests I am still visually repulsive. I can go back to counting calories but all I see are people that don't bother with that kind of discipline and look amazing. ", "created_utc": "1521398577.0", "edited": "False", "id": "dvwie1u", "is_submitter": "True", "link_id": "t3_85bh3p", "parent_id": "t1_dvwhdnl", "score": "2", "subreddit": "EOOD", "subreddit_id": "t5_2zw1d"}, {"author": "LeGrille90", "body": "I’m so sorry to hear about the psych ward. It is not a pleasant experience and I hope you have been able to find meaningful help.  \n  I feel like I’m just spinning my wheels pouring in willpower and discipline toward something that gets no results. I still look disgusting, I still haven’t had a date in almost 5 years, and I still feel like I’ll never be happy with myself.  \nI’ve heard to keep going because it gets better…eventually. I’ve been working toward that “eventually” most of my life, and it seems like it’ll never come.", "created_utc": "1521396791.0", "edited": "False", "id": "dvwgrk5", "is_submitter": "True", "link_id": "t3_85bh3p", "parent_id": "t1_dvwe3hb", "score": "4", "subreddit": "EOOD", "subreddit_id": "t5_2zw1d"}, {"author": "LeGrille90", "body": "I don’t know what I’m missing, short of gutting myself like a fish and scooping the lard out of my gut. I don’t snack, I don’t skip breakfast, I drink loads of water. I’ve placed in races, and I push myself to do more crunches, push-ups, etc. every week. I’d love to look like a super hero, but I can’t even look like Bruce Banner.  ", "created_utc": "1521396542.0", "edited": "False", "id": "dvwgje4", "is_submitter": "True", "link_id": "t3_85bh3p", "parent_id": "t1_dvwfaqi", "score": "5", "subreddit": "EOOD", "subreddit_id": "t5_2zw1d"}, {"author": "LeGrille90", "body": "I already track my gym days, and I know I am a tiny bit better than when I started (i.e. I can run faster and lift more than when I started) but that is still unacceptable compared to what I know people should be capable of, like your described progress. I’ve gone on and off using a calorie tracker/food journal for all my chicken and broccoli meals, but I’ve found it discouraging when it seems like other people are partying, eating pizza and cookies, chugging beer, and still look great. \n\nYou are right that I probably need a stricter accountability system, though it feels like I’ve been pushing myself for years and haven’t gotten an ounce of positive feedback.", "created_utc": "1521391952.0", "edited": "False", "id": "dvwcb49", "is_submitter": "True", "link_id": "t3_85bh3p", "parent_id": "t1_dvwafu7", "score": "5", "subreddit": "EOOD", "subreddit_id": "t5_2zw1d"}, {"author": "LeGrille90", "body": "I'm 27. Thank you for the tip, though I am somewhat skeptical of herbal supplements. I work as a Para-educator, primarily special needs kids in grades K-2, but the job is making me miserable. I'm trying finish a second Bachelors' for IT, but I have no passion for the material: I just want to earn enough to not live in borderline poverty.", "created_utc": "1521385534.0", "edited": "False", "id": "dvw6uoj", "is_submitter": "True", "link_id": "t3_85bh3p", "parent_id": "t1_dvw5e12", "score": "4", "subreddit": "EOOD", "subreddit_id": "t5_2zw1d"}, {"author": "LeGrille90", "body": "I do plan to call and try to figure out why the bill is so high and if I can whittle it down somehow, but I'm not optimistic. It seems like death would just be a better financial move than to keep wasting money on treatments and lifestyle changes that never help.\n\nI do appreciate that my academic advisor was concerned enough to call, but I feel ashamed that I mean so little to anyone else that she'd be my only support. Also, this happened just 2 days before the shooting in Florida, so my hospitalization was unrelated to any \"current worries\" but I did come back to work on the 15th facing some insensitive comments. It really sucks being a male elementary instructor: everyone treats you as a clown, a pervert, or ticking time-bomb.", "created_utc": "1521331515.0", "edited": "False", "id": "dvvc1iv", "is_submitter": "True", "link_id": "t3_85553w", "parent_id": "t1_dvv4utg", "score": "1", "subreddit": "SuicideWatch", "subreddit_id": "t5_2qpzs"}, {"author": "LeGrille90", "body": "It might wind up being more. The billing statement reads $6700, with $2500 taken off as expected to be paid by my insurance, but my insurance already said they won't cover any of it. The hospital will probably realize this and charge me the whole amount.", "created_utc": "1521329174.0", "edited": "False", "id": "dvva3ls", "is_submitter": "True", "link_id": "t3_85553w", "parent_id": "t1_dvv7aii", "score": "2", "subreddit": "SuicideWatch", "subreddit_id": "t5_2qpzs"}, {"author": "LeGrille90", "body": "I'm sorry to hear about your mom, and I hope you can be out of that household as soon as possible. It's good that you have some people for support.", "created_utc": "1521318896.0", "edited": "False", "id": "dvv1ka6", "is_submitter": "True", "link_id": "t3_85553w", "parent_id": "t1_dvuub26", "score": "2", "subreddit": "SuicideWatch", "subreddit_id": "t5_2qpzs"}, {"author": "LeGrille90", "body": "I'm sorry.", "created_utc": "1521307454.0", "edited": "False", "id": "dvurkw2", "is_submitter": "True", "link_id": "t3_85553w", "parent_id": "t1_dvurjva", "score": "3", "subreddit": "SuicideWatch", "subreddit_id": "t5_2qpzs"}, {"author": "LeGrille90", "body": "All she does is guilt me. She says if I died it would devastate her, but she's also been open about how I was unwanted. I feel pathetic that as a grown man, the most interesting of my weekend plans involve visiting my mommy.", "created_utc": "1521307243.0", "edited": "False", "id": "dvure74", "is_submitter": "True", "link_id": "t3_85553w", "parent_id": "t1_dvur8sg", "score": "4", "subreddit": "SuicideWatch", "subreddit_id": "t5_2qpzs"}, {"author": "LeGrille90", "body": "You are an absolute cutie and your BF is a dope. Don't change a thing because you are made of all the best features of every girl I've ever crushed on: eyes, nose, freckles, hair, smile, and body, plus your glasses are the icing on the cake.", "created_utc": "1521069213.0", "edited": "False", "id": "dvpnwny", "is_submitter": "False", "link_id": "t3_84gv8x", "parent_id": "t3_84gv8x", "score": "1", "subreddit": "amiugly", "subreddit_id": "t5_2rgjh"}, {"author": "LeGrille90", "body": "To clarify, that clone, Cut Lawquane, is not those kids' biological father, since he'd only have deserted the clone army about a year before the episode. Their father is a different human that got busy with the Twi'lek mother.\nhttp://starwars.wikia.com/wiki/Jek_Lawquane#cite_note-1", "created_utc": "1520550743.0", "edited": "False", "id": "dvehuki", "is_submitter": "False", "link_id": "t3_82xm1g", "parent_id": "t3_82xm1g", "score": "2", "subreddit": "TwoBestFriendsPlay", "subreddit_id": "t5_2uzei"}, {"author": "LeGrille90", "body": "Mostly Soldier, Pyro, and Medic, like a complete scrub.", "created_utc": "1520289648.0", "edited": "False", "id": "dv8iqo6", "is_submitter": "False", "link_id": "t3_8200l9", "parent_id": "t1_dv8f0x1", "score": "2", "subreddit": "Overwatch", "subreddit_id": "t5_2u5kl"}, {"author": "LeGrille90", "body": "I don't know, I played TF2 for almost 4 years and still got annihilated nearly every game. I think I'm just too slow and stupid.", "created_utc": "1520283520.0", "edited": "False", "id": "dv8c491", "is_submitter": "False", "link_id": "t3_8200l9", "parent_id": "t1_dv82sxa", "score": "1", "subreddit": "Overwatch", "subreddit_id": "t5_2u5kl"}, {"author": "LeGrille90", "body": "I can't believe after all my years of playing FPSes and other games, I struggle to reach the rank of average. :(", "created_utc": "1520283435.0", "edited": "False", "id": "dv8c0vt", "is_submitter": "False", "link_id": "t3_8200l9", "parent_id": "t1_dv7sbgz", "score": "2", "subreddit": "Overwatch", "subreddit_id": "t5_2u5kl"}, {"author": "LeGrille90", "body": "I feel like I play even worse than when I started. I can barely aim and forget about my abilities. I don't even have a real main. Any time I've tried grouping after a decent win, I get dropped pretty quickly as the \"weakest link\".", "created_utc": "1520283325.0", "edited": "False", "id": "dv8bwdj", "is_submitter": "False", "link_id": "t3_8200l9", "parent_id": "t1_dv7amw5", "score": "1", "subreddit": "Overwatch", "subreddit_id": "t5_2u5kl"}, {"author": "LeGrille90", "body": "Congratulations, though now I'm even sadder that I can barely make it to silver despite also playing since Season 1. ", "created_utc": "1520202706.0", "edited": "False", "id": "dv6o1p5", "is_submitter": "False", "link_id": "t3_8200l9", "parent_id": "t3_8200l9", "score": "10", "subreddit": "Overwatch", "subreddit_id": "t5_2u5kl"}, {"author": "LeGrille90", "body": "\"Witnesses call glue-crushing fatality 'Krazy'\"", "created_utc": "1519781708.0", "edited": "False", "id": "duxs31n", "is_submitter": "False", "link_id": "t3_80mktm", "parent_id": "t3_80mktm", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "LeGrille90", "body": "Your best years can be whenever you'd like, 17-20 is just an arbitrary transition from high school to uni when people feel invincible. \nA few years ago, I met this cool, cute girl whom was bicycling all across the U.S. and Canada. I never would have guessed she was actually 32, older than myself. \nMy mom is 54 years old, divorced from my abusive father, moved to a new city, got a new job, and taught herself fishing and woodworking for fun. She's the happiest she's ever been.\nNo birthday is a deadline for when you can have an amazing life. I hope that helps a bit!", "created_utc": "1518911562.0", "edited": "False", "id": "duetajr", "is_submitter": "False", "link_id": "t3_7y8hox", "parent_id": "t3_7y8hox", "score": "4", "subreddit": "depression", "subreddit_id": "t5_2qqqf"}, {"author": "LeGrille90", "body": "Monster Hunter, from Marvel vs. Capcom!", "created_utc": "1518899509.0", "edited": "False", "id": "duej9b6", "is_submitter": "False", "link_id": "t3_7y3dp1", "parent_id": "t3_7y3dp1", "score": "1", "subreddit": "TwoBestFriendsPlay", "subreddit_id": "t5_2uzei"}, {"author": "LeGrille90", "body": "This is one of my absolute favorite games. Thank you for playing this, Zaibatsu! I can't wait to enjoy it once again.", "created_utc": "1518665659.0", "edited": "False", "id": "du9q6rw", "is_submitter": "False", "link_id": "t3_7xn88o", "parent_id": "t3_7xn88o", "score": "2", "subreddit": "TwoBestFriendsPlay", "subreddit_id": "t5_2uzei"}, {"author": "LeGrille90", "body": "After getting my heart broken, I've been working out 5+ days a week for the past 4 years, usually alternating cardio and weight-training. I don't drink alcohol or soda. I've cut out sugary desserts and carbs like rice, bread, and pasta. I still hate the way I look and feel like I'll die alone.\n\nListening to the Friendcast makes workouts a little more enjoyable, though.", "created_utc": "1518652989.0", "edited": "False", "id": "du9f94e", "is_submitter": "False", "link_id": "t3_7xgwlf", "parent_id": "t3_7xgwlf", "score": "1", "subreddit": "TwoBestFriendsPlay", "subreddit_id": "t5_2uzei"}, {"author": "LeGrille90", "body": "I don't own a Switch yet, and was never crazy about the portability gimmick (I don't want to have my $300 console dropped on the pavement or stolen) but this might have sold me on it. I love origami and papercraft, and I like the idea of \"building\" a part of the game and seeing the console transform into a whole new toy.", "created_utc": "1516227440.0", "edited": "False", "id": "dsu71w4", "is_submitter": "False", "link_id": "t3_7r4oyy", "parent_id": "t3_7r4oyy", "score": "1", "subreddit": "nintendo", "subreddit_id": "t5_2qhnk"}, {"author": "LeGrille90", "body": "If Hugh Hefner proved anything in his life, it's that growing older does not necessarily make it harder to find prospective partners. Maturity and independence will make it easier to go out and meet new people. I'm guessing you are either in high school or recently finished, but your social circle will expand as you move out and about. Jobs, college, trips, and friends of friends are all ways you can improve your odds. Challenge yourself physically, intellectually, emotionally, and socially, and you'll be a good-looking, smart, sensitive, and interesting person that someone will look at twice.\n\nReal relationships take time to develop, and you aren't unlikable because you haven't gone all the way. My ex and I were together for months before we did anything. Some people still wait until they are married! Remember that most completely normal people will be shy and reserved about their attraction to somebody. Someone might like you and hasn't said it yet, or you'll make friendships that develop into something else. Have patience, enjoy the many non-sexual splendors about the world.\n\nThink of all the meals you've had, or movies you're watched. Some were probably fantastic and worth raving about, but there were also some really awful ones. People will talk up the memorable times, but like many things, sex can be hit or miss. Nobody likes to talk about when they or their partner was selfish, how they felt uncomfortable with their body, or they couldn't \"perform\" because of stress. Yes, sometimes sex can be amazing, but the whole activity can't be put on a pedestal.", "created_utc": "1514172744.0", "edited": "False", "id": "drq6wz3", "is_submitter": "False", "link_id": "t3_7ly1lh", "parent_id": "t1_drq4gi3", "score": "1", "subreddit": "SuicideWatch", "subreddit_id": "t5_2qpzs"}, {"author": "LeGrille90", "body": "First, if somebody is personally pressuring you about your sex life, they do not have your best interest in mind. It's none of their business. They are a bully.\n\nMedia pushes an image of teen romance to sell products that appeal to our instincts, holdovers from when our ancestors needed to reproduce as soon as they hit puberty because every day carried the risk of death by wild animal. You (probably) won't get stepped on while hunting a woolly mammoth before you turn 19, so there is no real deadline for you to start having sex.\n\nYou are correct, virginity really isn't a big deal. It can be fun, but it can also suck sometimes. I didn't get lucky until I was almost 21, then the girl broke my heart 3 years later. I haven't been with anyone since, and I wish my first time wasn't with her. Friends of mine have been sexually active earlier, later, not at all, gay, straight, with one partner, multiple, gotten married, been abused, had kids by accident or planned. Nobody has a script for their life, and sex certainly is not the most important or memorable thing you can do. \n\nDo things you enjoy, and explore new hobbies. Maybe you'll meet people, maybe you won't, but it will be secondary to the enjoyment you make for yourself.", "created_utc": "1514162656.0", "edited": "False", "id": "drq0q35", "is_submitter": "False", "link_id": "t3_7ly1lh", "parent_id": "t3_7ly1lh", "score": "1", "subreddit": "SuicideWatch", "subreddit_id": "t5_2qpzs"}, {"author": "LeGrille90", "body": "Thanks, it’s been a rough year and the Best Friends have been a bright spot. Listening to Woolie and Pat in the latest podcast made me feel crappy though: I took up running and weight training 4 years ago after a bad break-up, but still haven’t made any noticeable improvement in my fitness or appearance. Since then I’ve also changed jobs, started therapy and medication (quit this year) am currently back in school to change career from English to IT, and have moved a few times. I even traveled for the first time: to Montreal to see Fantasia after hearing about it on the podcast! Nothing has made me happier though, since I’m still alone and haven’t had so much as a date all this time. It’s like all the exercise, education, and life experience in the world can’t make me the slightest bit loveable. Everything Woolie and Pat said about motivation and support from loved ones was painful: How can I ever feel like I’m doing OK in life without anyone around? Even watching or listening to the Zaibatsu is bittersweet, since my ex and I played “Kirby’s Epic Yarn” at the start of our relationship, and the Green Greens song opens that wound every time.\n\nSorry to vent, and I hope everyone has Happy Holidays and a bright New Year of gaming, anime, wrestling, and all the other nerd garbage we enjoy.", "created_utc": "1513737582.0", "edited": "False", "id": "dri4cly", "is_submitter": "False", "link_id": "t3_7kuqme", "parent_id": "t3_7kuqme", "score": "4", "subreddit": "TwoBestFriendsPlay", "subreddit_id": "t5_2uzei"}, {"author": "LeGrille90", "body": "That is good advice, but unfortunately I have no friends that play OW, and queuing with friendly randoms often winds up being a roulette wheel of whether or not they bail on the first loss. The game has been a lot less fun without any personal interaction.", "created_utc": "1504784643.0", "edited": "False", "id": "dmohreq", "is_submitter": "False", "link_id": "t3_6yf9ck", "parent_id": "t1_dmnrqkv", "score": "2", "subreddit": "Overwatch", "subreddit_id": "t5_2u5kl"}, {"author": "LeGrille90", "body": "Thanks, I'll add you later today.\n", "created_utc": "1504784459.0", "edited": "False", "id": "dmoho5h", "is_submitter": "False", "link_id": "t3_6yf9ck", "parent_id": "t1_dmnrk9u", "score": "1", "subreddit": "Overwatch", "subreddit_id": "t5_2u5kl"}, {"author": "LeGrille90", "body": "That's really fantastic, and I'm glad your experience has been a mostly positive one!\n\nI'm saddened, though, that I've been playing for over a year and still can't get out of silver. Even when I play every day to practice, track my stats on paper and in Excel looking for trends, and \"have a positive attitude\", I keep getting thrashed. Then I tell myself I'm a failure, weak, stupid, worthless, etc. Seeing your success just makes me wonder if I even have a chance after this much time with no progress.", "created_utc": "1504731947.0", "edited": "False", "id": "dmnmphl", "is_submitter": "False", "link_id": "t3_6yf9ck", "parent_id": "t3_6yf9ck", "score": "2", "subreddit": "Overwatch", "subreddit_id": "t5_2u5kl"}, {"author": "LeGrille90", "body": "Thank you for articulating this point so well. I’ve been in OW for over a year now, and played other FPSes on consoles and PC for the past 20 years. It already sucks enough to get a bronze rank telling you that despite your experience and time in the game, you are statistically considered one of the worst players in the world. Add to that the embarrassment of being labeled a “healer one-trick” because everyone else on your team insta-locks a DPS, and you achieve a perfect formula for “why bother with this game and its community?” attitude. \n\nI’d like to improve. I practice whenever I can, track my performance, note my shortcomings, all because I’d like to be a great player that’s respected by my teammates and opponents alike. Smurfs, along with throwers and other problem players, make good practice nearly impossible. Unbalanced teams prevent players from sharpening their skills in realistic gameplay scenarios.\n\nLast season, I wound up healing and tanking my way up to mid-silver before a string of thrown matches dragged me back down to bronze. Now, I don’t even know if I want to try Season 6, in anticipation of more disappointment and embarrassment as pick heroes that fill gaps in composition, and watch my effort go to waste as I attempt to “climb” through unbalanced matches.\n", "created_utc": "1504459382.0", "edited": "False", "id": "dmiijmt", "is_submitter": "False", "link_id": "t3_6xs3au", "parent_id": "t3_6xs3au", "score": "1", "subreddit": "Overwatch", "subreddit_id": "t5_2u5kl"}, {"author": "LeGrille90", "body": "\"I am the Angel of Death. The time of purification is at hand.\"", "created_utc": "1503760311.0", "edited": "False", "id": "dm5kf7r", "is_submitter": "True", "link_id": "t3_6vwcvk", "parent_id": "t1_dm4ytgh", "score": "1", "subreddit": "Overwatch_Memes", "subreddit_id": "t5_3el0q"}, {"author": "LeGrille90", "body": "Shield generator, armor pack, infra-sight, orb of harmony, speed boosted... this just happened to be first combination I thought of and fit the template. There are mathematically infinite permutations of Battle Mercy!", "created_utc": "1503668517.0", "edited": "False", "id": "dm3wm85", "is_submitter": "True", "link_id": "t3_6vwcvk", "parent_id": "t1_dm3wbh8", "score": "7", "subreddit": "Overwatch_Memes", "subreddit_id": "t5_3el0q"}, {"author": "LeGrille90", "body": "Thank you!", "created_utc": "1503667210.0", "edited": "False", "id": "dm3vmu7", "is_submitter": "True", "link_id": "t3_6vwcvk", "parent_id": "t1_dm3qx30", "score": "2", "subreddit": "Overwatch_Memes", "subreddit_id": "t5_3el0q"}, {"author": "LeGrille90", "body": "I can't wait for the scathing comments from every teammate who feels they deserved to be rezzed over someone else! Telltale presents Overwatch.", "created_utc": "1503604515.0", "edited": "False", "id": "dm2tbvq", "is_submitter": "False", "link_id": "t3_6vsro7", "parent_id": "t3_6vsro7", "score": "1", "subreddit": "Overwatch", "subreddit_id": "t5_2u5kl"}, {"author": "LeGrille90", "body": "Well done! I only managed to make it halfway through silver before a string of throwers dropped me nearly back down to bronze, then I got too busy with work to practice consistently. :( Maybe next season I won't feel like such a garbage player anymore.", "created_utc": "1503589183.0", "edited": "False", "id": "dm2ennn", "is_submitter": "False", "link_id": "t3_6vox1l", "parent_id": "t3_6vox1l", "score": "1", "subreddit": "Overwatch", "subreddit_id": "t5_2u5kl"}, {"author": "LeGrille90", "body": "I'm sorry, I shouldn't have been so vague. Without getting too personal, my particular situation meant I could not choose my own degree, and circumstances resulted in my job being the best I could do in my environment. I'm trying for another degree and new career path but news like this is disheartening. \n\nI mean, people work for years to figure out a career path, scrape by to get the education that qualifies their entry to the field, then claw through the job market for a chance at a livable income. Meanwhile, some brat has greater financial stability because they got \"gud\" at a game that's been out for 1 year. :(", "created_utc": "1501121951.0", "edited": "False", "id": "dkrxxcv", "is_submitter": "False", "link_id": "t3_6ppvmr", "parent_id": "t1_dkrxde4", "score": "0", "subreddit": "Overwatch", "subreddit_id": "t5_2u5kl"}, {"author": "LeGrille90", "body": "I didn't exactly choose it, but it's what my degree is qualified for.", "created_utc": "1501115986.0", "edited": "False", "id": "dkrt9u4", "is_submitter": "False", "link_id": "t3_6ppvmr", "parent_id": "t1_dkrsqn7", "score": "1", "subreddit": "Overwatch", "subreddit_id": "t5_2u5kl"}, {"author": "LeGrille90", "body": "This is the stuff that makes it hard to say \"relax, have fun, it's just a game\". I'm drowning in student loans so I can work as an elementary school instructor, and bringing home barely a quarter of that money. What's the point of struggling to make ends meet with a real job when some loudmouth little streamer will out earn you playing a game for a living?", "created_utc": "1501104059.0", "edited": "False", "id": "dkrjfgf", "is_submitter": "False", "link_id": "t3_6ppvmr", "parent_id": "t3_6ppvmr", "score": "-4", "subreddit": "Overwatch", "subreddit_id": "t5_2u5kl"}, {"author": "LeGrille90", "body": "I'm glad I could brighten your day!", "created_utc": "1499387135.0", "edited": "False", "id": "djvp9fp", "is_submitter": "True", "link_id": "t3_6lpm5i", "parent_id": "t1_djvnvmr", "score": "2", "subreddit": "splatoon", "subreddit_id": "t5_324q4"}, {"author": "LeGrille90", "body": "https://youtu.be/xECUrlnXCqk", "created_utc": "1499387004.0", "edited": "False", "id": "djvp5vm", "is_submitter": "True", "link_id": "t3_6lpm5i", "parent_id": "t1_djvoo7w", "score": "1", "subreddit": "splatoon", "subreddit_id": "t5_324q4"}, {"author": "LeGrille90", "body": "I've been trying to change it, though. Changed jobs, went back to school, taken up hobbies. The list of things I can do to be happy is nearly exhausted. ", "created_utc": "1496293286.0", "edited": "False", "id": "dib05qq", "is_submitter": "True", "link_id": "t3_6dm1yw", "parent_id": "t1_di3w5rr", "score": "1", "subreddit": "SuicideWatch", "subreddit_id": "t5_2qpzs"}, {"author": "LeGrille90", "body": "I still can't make it out of bronze :( I don't understand how I can be this bad after this many hours.", "created_utc": "1496030073.0", "edited": "False", "id": "di68vxm", "is_submitter": "False", "link_id": "t3_6dsmqn", "parent_id": "t3_6dsmqn", "score": "1", "subreddit": "Overwatch", "subreddit_id": "t5_2u5kl"}]