[{"author": "LightheartMusic", "body": "Nah it’s not an American thing. Never heard an American drop the « and » with these numbers.", "created_utc": "1664012600.0", "edited": "False", "id": "ipp7akl", "is_submitter": "False", "link_id": "t3_xm6yqc", "parent_id": "t1_ipncu5g", "score": "3", "subreddit": "linguisticshumor", "subreddit_id": "t5_2vwiq"}, {"author": "LightheartMusic", "body": "Except what I think this line of reasoning always forgets is that those people were not a majority of the population. They may have had the biggest impact on culture, but there just wasn’t enough members of the counterculture movements to really change anything. They’re still around, often with the same beliefs, but just irrelevant.", "created_utc": "1663936381.0", "edited": "False", "id": "ipl8obv", "is_submitter": "False", "link_id": "t3_xlrb6j", "parent_id": "t1_ipl5jvg", "score": "10", "subreddit": "europe", "subreddit_id": "t5_2qh4j"}, {"author": "LightheartMusic", "body": "Yeah. I always found that it failed to be the anti-Narnia that Pullman wanted it to be. But I think his attempt to make it so is part of why it’s so good.", "created_utc": "1663270308.0", "edited": "False", "id": "iokk63s", "is_submitter": "False", "link_id": "t3_xeb11c", "parent_id": "t1_iohfah9", "score": "2", "subreddit": "Fantasy", "subreddit_id": "t5_2qknd"}, {"author": "LightheartMusic", "body": "I’m from New England (CT) and I usually pronounce the L. It’s subtle, but it’s there.", "created_utc": "1663239505.0", "edited": "False", "id": "ioijooh", "is_submitter": "False", "link_id": "t3_xehiy5", "parent_id": "t1_iohhcmg", "score": "1", "subreddit": "asklinguistics", "subreddit_id": "t5_2u7nj"}, {"author": "LightheartMusic", "body": "Hmm, the ask/aks thing might just be metathesis, rather than a holdover from old English (though I don’t doubt it was ax in OE) kind of like how wasp was waps in OE.", "created_utc": "1662976506.0", "edited": "False", "id": "io3rive", "is_submitter": "False", "link_id": "t3_xbju05", "parent_id": "t1_io1z6tl", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "LightheartMusic", "body": "Well, having a strong background in Spanish and French should definitely make learning Italian easier! I’ve found I can half understand Italian now that my French is decently high. Good luck!", "created_utc": "1662536212.0", "edited": "False", "id": "inf8oa6", "is_submitter": "False", "link_id": "t3_x7srom", "parent_id": "t1_inem8s9", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "LightheartMusic", "body": "This plus shootings plus the insane amount of student drug deaths where I live is why I was homeschooled until high school. My family did NOT trust that the public school system could adequately take care of children.", "created_utc": "1662449849.0", "edited": "False", "id": "inacuzb", "is_submitter": "False", "link_id": "t3_x6tir3", "parent_id": "t1_in9chxq", "score": "5", "subreddit": "AmerExit", "subreddit_id": "t5_5b1mph"}, {"author": "LightheartMusic", "body": "“It’s like eyewash to them” thank you, this made me laugh.", "created_utc": "1662131123.0", "edited": "False", "id": "imszqx0", "is_submitter": "False", "link_id": "t3_x3wphi", "parent_id": "t1_ims18ff", "score": "3", "subreddit": "Strasbourg", "subreddit_id": "t5_2t6fw"}, {"author": "LightheartMusic", "body": "Not specifically American, but I take your point. I’m sorry for assuming your nationality. \n\nYou should still be fine. Swedish law enforcement likely has more important concerns than a 10 day visa. If you’re still worried, you could always contact the main Swedish consulate in your country and ask them directly for clarification - you could tell them that your business trip has been cut short by a few days and that you’re wondering if your visa is still valid. \n\nIf you find out one way or the other, I’d be interested to know the answer, as I may end up going through something similar later this year.\n\nWhat country are you from if you don’t mind my asking? That might help me better understand what you need.", "created_utc": "1661558700.0", "edited": "1661559102.0", "id": "ilxtz0a", "is_submitter": "False", "link_id": "t3_wyj9p1", "parent_id": "t1_ilxsl61", "score": "0", "subreddit": "visas", "subreddit_id": "t5_32edu"}, {"author": "LightheartMusic", "body": "As far as I know you do not need to apply for any visa if you are staying in the Schengen Area (of which Sweden is a part) for under 90 days within a 180 day period. You have about three months to visit Europe. If you’re only planning on being there for 10 days you have nothing to worry about. Do your few days of work if you want to, but otherwise don’t worry about it, you don’t even need a visa.", "created_utc": "1661557978.0", "edited": "False", "id": "ilxsfm4", "is_submitter": "False", "link_id": "t3_wyj9p1", "parent_id": "t1_ilxr5ek", "score": "0", "subreddit": "visas", "subreddit_id": "t5_32edu"}, {"author": "LightheartMusic", "body": "As long as you haven’t used up your 90 tourist visa in the Schengen area yet, you should be fine for those 90 days. But see if you can work more in that office, if you want to spend more time there without using up your tourist visa. Sweden likely has other laws I am not aware of that you may wish research. At a quick glance it seems you can apply for a “visitor’s residence permit” but I don’t know what the requirements are for that.", "created_utc": "1661556966.0", "edited": "1661557215.0", "id": "ilxq965", "is_submitter": "False", "link_id": "t3_wyj9p1", "parent_id": "t3_wyj9p1", "score": "0", "subreddit": "visas", "subreddit_id": "t5_32edu"}, {"author": "LightheartMusic", "body": "Hmm. That seems really close. You should always give yourself room for the problems that will crop up. I would ask the Chicago center how quickly they process the results. For me, at the NYC testing center they said it would take about three weeks, but it in reality it took closer to a month and a half. \n\nIf Chicago’s no good, your only real choices are to take it somewhere else, or to take a gap year and apply next year. In that time, you could work and save up money so you’ve got spending money in France (it can be expensive to live in a foreign country before you adapt). Don’t forget, once you’re going to France you’ll need to apply for a long-stay visa BEFORE you leave, which takes a while. For the visa you’ll need to prove that you have the financial means to support yourself so depending on your finances, that could be a point in favor of a gap year. \n\nOtherwise, you could always enroll in a language course at a university you’re interested in attending before pursuing your undergrad diploma. You’d end up graduating around the same time as your peers, since the French «license » is only three years long compared to the four years of an American bachelor’s degree. I’m sort of doing it in the opposite direction now, taking a French language course at the university of Strasbourg. This might be a good idea if you’re at B2 level, like me. And, if the program is part of the ADCUEFE network you won’t need to take the Delf/dalf as member universités (about 15 iirc) will accept the results of the class in lieu of a Delf exam. \n\nI’m sure you’re studying for the Delf, but I’ll give you a couple tips anyway. The hardest part will probably be the listening comprehension. Seriously, I thought it would be the easier part considering how much I practiced listening but no. They may very well use low-quality audio, with children speaking really quickly  (that’s what they did for mine). So practice that skill. The other thing I would recommend is to practice writing formal letters. Memorize the formatting, a stock opening, and a stock ending phrase. I found this to be the most helpful. Additionally, the B2 level is pretty focused on how well you can present your opinions. You’ll need to be able to present a point of view, a contrasting one, and your personal one if it’s different from the other two.", "created_utc": "1661551145.0", "edited": "False", "id": "ilxd5nj", "is_submitter": "False", "link_id": "t3_wxstf3", "parent_id": "t1_ilsva33", "score": "2", "subreddit": "DELF", "subreddit_id": "t5_3hopmc"}, {"author": "LightheartMusic", "body": "The only exception that might be made is if it was done out of trust money, but even then I can’t really think of what the argument would be. Debt is unenforceable via a will", "created_utc": "1661543535.0", "edited": "False", "id": "ilwujqr", "is_submitter": "False", "link_id": "t3_wygf03", "parent_id": "t1_ilwjdwb", "score": "1", "subreddit": "learnmath", "subreddit_id": "t5_2rdi4"}, {"author": "LightheartMusic", "body": "Burden", "created_utc": "1661468299.0", "edited": "False", "id": "ilsqqcb", "is_submitter": "False", "link_id": "t3_wxm9en", "parent_id": "t1_ils3zft", "score": "2", "subreddit": "writing", "subreddit_id": "t5_2qh2n"}, {"author": "LightheartMusic", "body": "Ahh I wish I’d know this earlier :( the same’s true for airline tickets as well apparently", "created_utc": "1661137427.0", "edited": "False", "id": "il9xubn", "is_submitter": "True", "link_id": "t3_we6ykr", "parent_id": "t1_ikimop0", "score": "1", "subreddit": "visas", "subreddit_id": "t5_32edu"}, {"author": "LightheartMusic", "body": "Ahh yes. Ordered top to bottom from highest English proficiency to lowest.", "created_utc": "1661137220.0", "edited": "False", "id": "il9xfz2", "is_submitter": "False", "link_id": "t3_wub96r", "parent_id": "t1_il8u030", "score": "41", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "LightheartMusic", "body": "I think it’s going to be really regional. In the northeast there is a pretty good selection of healthy foods, including breads, in most grocery stores I’ve gone to. With the exception of like Big Y or Stop & Shop or something lmao", "created_utc": "1660686383.0", "edited": "False", "id": "ikkr8eh", "is_submitter": "False", "link_id": "t3_wpport", "parent_id": "t1_ikixqwu", "score": "2", "subreddit": "AmerExit", "subreddit_id": "t5_5b1mph"}, {"author": "LightheartMusic", "body": "Of course it’s an orange cat", "created_utc": "1660245837.0", "edited": "False", "id": "ijwatua", "is_submitter": "False", "link_id": "t3_wll4dh", "parent_id": "t3_wll4dh", "score": "5", "subreddit": "likeus", "subreddit_id": "t5_2xyw0"}, {"author": "LightheartMusic", "body": "I mean I’ve definitely thought about it, but then again my mom is Canadian lol. But year, just behave responsibly, and be kind. That will speak well enough of your own character and will help the image of other American expats and emigrants.", "created_utc": "1659029011.0", "edited": "False", "id": "ii0k6ff", "is_submitter": "False", "link_id": "t3_waaqd0", "parent_id": "t1_ii0ivri", "score": "17", "subreddit": "AmerExit", "subreddit_id": "t5_5b1mph"}, {"author": "LightheartMusic", "body": "Oh now that you’ve pointed it out it doesn’t exactly make sense that the small windows on the castle are the same size as the windows on those houses in the foreground lol", "created_utc": "1658838160.0", "edited": "False", "id": "ihpflet", "is_submitter": "False", "link_id": "t3_w6uy1i", "parent_id": "t1_ihha1i2", "score": "1", "subreddit": "CityPorn", "subreddit_id": "t5_2scjs"}, {"author": "LightheartMusic", "body": "I hear you. And all of those are disgusting parts of our country. But “we” didn’t do those things. America is more than just 17th century settlers. Saying that discounts the Native American people who still live here, many of whom who enlisted in the military and died for the very country that oppressed them. It ignores the black people descended from slaves who fought/fight for civil rights, to be acknowledged as full American citizens, as people. It ignores the activists throughout American history who tried/try to make the world better. I think we need to acknowledge what’s deeply fucked about both present and past America, but not at the expense of what’s good. It’s part of why I feel so guilty about wanting to leave this country. I feel like I owe it to the other people who live here to fight against the psychos who are enacting their fascist wet-dream. I don’t want to leave my family behind in a place where you can get shot just for buying groceries or going to school. \n\nI guess I went on a rant here, sorry 😅", "created_utc": "1658776390.0", "edited": "False", "id": "ihm6az5", "is_submitter": "False", "link_id": "t3_w7p6zo", "parent_id": "t1_ihlyelu", "score": "9", "subreddit": "AmerExit", "subreddit_id": "t5_5b1mph"}, {"author": "LightheartMusic", "body": "We’ve thought about getting NRA stickers etc for much the same reason. I sometimes worry that some of people around here might come into our house and shoot us for being on the left", "created_utc": "1658772475.0", "edited": "False", "id": "ihlw3gb", "is_submitter": "False", "link_id": "t3_w7p6zo", "parent_id": "t1_ihlgqpz", "score": "5", "subreddit": "AmerExit", "subreddit_id": "t5_5b1mph"}, {"author": "LightheartMusic", "body": "I agree with you. They are not the same. I tend to vote straight democrat, but that doesn’t stop me from being angry. I think the democrats are cowards and let the right wing extremists get away with way too much. I think the democrats are disorganized and can’t work together because the movements that have banded together under the liberal flag often don’t share the same goals. It’s frustrating that the democrats are the best option we seem to have today", "created_utc": "1658772242.0", "edited": "False", "id": "ihlvhhr", "is_submitter": "False", "link_id": "t3_w7p6zo", "parent_id": "t1_ihlt7xq", "score": "18", "subreddit": "AmerExit", "subreddit_id": "t5_5b1mph"}, {"author": "LightheartMusic", "body": "I try to distinguish between patriotism and nationalism. From my point of view, patriotism means a love of your country that doesn’t require a denial of its issues. Nationalism is an ignorant, often hateful, cult mentality. I consider myself patriotic, even if I no longer want to live here because of the US’ dangerous flaws, and even though I am deeply angry at the bad behavior that drives America. Nationalists don’t have that kind of self-awareness.", "created_utc": "1658772009.0", "edited": "False", "id": "ihluvjt", "is_submitter": "False", "link_id": "t3_w7p6zo", "parent_id": "t1_ihl2d95", "score": "27", "subreddit": "AmerExit", "subreddit_id": "t5_5b1mph"}, {"author": "LightheartMusic", "body": "N’oublie pas “Irish goodbye” veut dire «filer à l’anglaise» aussi", "created_utc": "1658760763.0", "edited": "False", "id": "ihl1n56", "is_submitter": "False", "link_id": "t3_w7i3r4", "parent_id": "t1_ihkeyhr", "score": "9", "subreddit": "rance", "subreddit_id": "t5_2um6i"}, {"author": "LightheartMusic", "body": "Without know why you want to learn, I chose French. I suspect it may be easier to learn for you if you are a native English speaker", "created_utc": "1658576013.0", "edited": "False", "id": "ihb7ojj", "is_submitter": "False", "link_id": "t3_w5p5r4", "parent_id": "t3_w5p5r4", "score": "1", "subreddit": "thisorthatlanguage", "subreddit_id": "t5_4inj8f"}, {"author": "LightheartMusic", "body": "Yeah one of my sisters is Cree, I would 100% take the fluency and go visit her in Canada.", "created_utc": "1658426473.0", "edited": "False", "id": "ih2x0ia", "is_submitter": "False", "link_id": "t3_w4fzz4", "parent_id": "t1_ih24hwt", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "LightheartMusic", "body": "It may possibly depend on whether or not Dutch speakers can make the sounds in the name. I have a Chinese friend who introduces himself to native French speakers as Julien because there are sounds in his name that French speakers cannot even emulate, so he prefers just not going there at all.", "created_utc": "1658164556.0", "edited": "False", "id": "ignyv7q", "is_submitter": "False", "link_id": "t3_w1vdpd", "parent_id": "t1_ign0ld0", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "LightheartMusic", "body": "I generally agree with these sentiments, and yet I would argue that there most certainly is a range of correct and incorrect ways to speak English. If, for example, I spoke English but applied Japanese or Latin grammar and word order to it, that would no longer be English — it would be a different language. So I think that there probably has to be some kind of limit to the scope of acceptable language practices.", "created_utc": "1658068340.0", "edited": "False", "id": "igis4q3", "is_submitter": "False", "link_id": "t3_w0sady", "parent_id": "t1_ighjwq5", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "LightheartMusic", "body": "I mean what about, say, Italian and French? They have almost exactly the same grammar (bar a few differences) but no one would likely argue that they’re not different languages.", "created_utc": "1658005917.0", "edited": "False", "id": "igfwkpc", "is_submitter": "False", "link_id": "t3_w0htci", "parent_id": "t1_igetv0s", "score": "1", "subreddit": "linguistics", "subreddit_id": "t5_2qhos"}, {"author": "LightheartMusic", "body": "FR. I mean, like games too, but why make that a big deal when you literally have an entire new country to explore. I actually can’t imagine latency being that important.", "created_utc": "1657921283.0", "edited": "False", "id": "igbg3wp", "is_submitter": "False", "link_id": "t3_vz25v9", "parent_id": "t1_ig8hlww", "score": "3", "subreddit": "expats", "subreddit_id": "t5_2rhwp"}, {"author": "LightheartMusic", "body": "It may be that they have a special disdain for Québecois. I’ve known Parisians who can be really just brutal and cruel about the accent.", "created_utc": "1657829386.0", "edited": "False", "id": "ig68dll", "is_submitter": "False", "link_id": "t3_vyrj2r", "parent_id": "t1_ig413zw", "score": "0", "subreddit": "expats", "subreddit_id": "t5_2rhwp"}, {"author": "LightheartMusic", "body": "Depends on the wealth level of the New Yorker. I think poor and middle class New Yorkers are generally really kind. But where I live in the country we get a lot of really entitled city people who come for the summer and bully the locals. Not all of them obviously though", "created_utc": "1657829298.0", "edited": "False", "id": "ig685kg", "is_submitter": "False", "link_id": "t3_vyrj2r", "parent_id": "t1_ig65wbf", "score": "7", "subreddit": "expats", "subreddit_id": "t5_2rhwp"}, {"author": "LightheartMusic", "body": "I’ve seen it in stores, and it doesn’t look all that appealing either. I have a friend who loves it though, so who knows lol", "created_utc": "1657801011.0", "edited": "False", "id": "ig49jpr", "is_submitter": "False", "link_id": "t3_vyctme", "parent_id": "t1_ig47hob", "score": "1", "subreddit": "asklinguistics", "subreddit_id": "t5_2u7nj"}, {"author": "LightheartMusic", "body": "I have never heard anyone use queso to refer to cheesy salsa, so I’m not sure that it’s even that widespread in the US. The Chai thing is definitely true though", "created_utc": "1657799095.0", "edited": "False", "id": "ig465e8", "is_submitter": "False", "link_id": "t3_vyctme", "parent_id": "t1_ig3wzva", "score": "1", "subreddit": "asklinguistics", "subreddit_id": "t5_2u7nj"}, {"author": "LightheartMusic", "body": "I don’t know about Warsaw specifically, but I’d guess German would be useful considering the proximity, and German tends to be fairly useful in anything involving tourism.", "created_utc": "1657568302.0", "edited": "False", "id": "ifrg7jm", "is_submitter": "False", "link_id": "t3_vwlm4k", "parent_id": "t1_ifqyctz", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "LightheartMusic", "body": "Honestly as a native English speaker who has been to parties where pretty much everyone else spoke English as an L2 this seems like BS on the part of the British. If they didn’t know how to make allowances for differences in foreign speakers English… smh", "created_utc": "1657504139.0", "edited": "False", "id": "ifo4vhs", "is_submitter": "False", "link_id": "t3_vvimye", "parent_id": "t1_ifl9eu8", "score": "2", "subreddit": "recruitinghell", "subreddit_id": "t5_3bwcw"}, {"author": "LightheartMusic", "body": "I have family in Montreal, so I really want to go there someday and see where that half of my family came from (there and PEI). I’m a little worried I might come across as a bit rude or something because I learned Metropolitan French and not Québecois.", "created_utc": "1657482752.0", "edited": "False", "id": "ifmu0f4", "is_submitter": "False", "link_id": "t3_vv9ihn", "parent_id": "t1_ifiiugi", "score": "1", "subreddit": "learnfrench", "subreddit_id": "t5_2sucz"}, {"author": "LightheartMusic", "body": "I think that‘a supposed to be god’s plan…", "created_utc": "1657482354.0", "edited": "False", "id": "ifmt3d0", "is_submitter": "False", "link_id": "t3_vvmuj0", "parent_id": "t1_ifly2eo", "score": "4", "subreddit": "writing", "subreddit_id": "t5_2qh2n"}, {"author": "LightheartMusic", "body": "Also, it’s not true that non-humans are unable to learn magic in Harry Potter. It’s just that the ministry has outlawed the use of wands by non-humans, because they are afraid and/or racist or whatever. We’ve repeatedly seen house elves and goblins use magic in the books and movies. I don’t know if centaurs using prophecy magic counts. \n\nI was just thinking about this yesterday actually. I was wondering if, say, goblins have the equivalent of squibs. I think it’s a shame we never got to see more of the non-human side of the universe. I would have loved to know more about what different magical races got up to when the ministry wasn’t breathing down their necks.\n\nEdit:\nAlso now that I think about it, considering Hagrid, are we really sure that that the magical races aren’t actually human? At the very least, they must be about as related to us as Neanderthals.", "created_utc": "1657390559.0", "edited": "False", "id": "ifi20nz", "is_submitter": "False", "link_id": "t3_vut9u3", "parent_id": "t1_ifgtsrd", "score": "2", "subreddit": "worldbuilding", "subreddit_id": "t5_2rd6n"}, {"author": "LightheartMusic", "body": "Meh. Translating stuff isn’t why I’m learning, so it wouldn’t bother me even if computers became perfect at it (which they won’t, because it’s not even possible for humans to be perfect translators).", "created_utc": "1657379198.0", "edited": "False", "id": "ifhbyq1", "is_submitter": "False", "link_id": "t3_vuzid6", "parent_id": "t1_ifh7fjr", "score": "54", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "LightheartMusic", "body": "Omg!!! Me too. I was like “wow, Australia sure has a lot  of mountains”", "created_utc": "1657331602.0", "edited": "False", "id": "iff8xnq", "is_submitter": "False", "link_id": "t3_vu56n9", "parent_id": "t1_ifebs7a", "score": "3", "subreddit": "europe", "subreddit_id": "t5_2qh4j"}, {"author": "LightheartMusic", "body": "I’m guessing that means peanut, and with the \"¡\" is that Spanish?", "created_utc": "1656990587.0", "edited": "False", "id": "iewd5y4", "is_submitter": "False", "link_id": "t3_vrlh4c", "parent_id": "t1_iew4i4s", "score": "22", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "LightheartMusic", "body": "Why not try using transfer paper? You can probably order it on amazon, print your design from an inkjet printer, and then iron it onto the cover. That's what I'm planning on doing since I also cannot afford a cricut.", "created_utc": "1656815896.0", "edited": "False", "id": "ienhvm0", "is_submitter": "False", "link_id": "t3_vj4ek1", "parent_id": "t1_idobna2", "score": "1", "subreddit": "bookbinding", "subreddit_id": "t5_2smpy"}, {"author": "LightheartMusic", "body": "How big is your jeep?? Mine wouldn’t stick out like that lmao", "created_utc": "1656684506.0", "edited": "False", "id": "iegcao5", "is_submitter": "False", "link_id": "t3_vox5u2", "parent_id": "t1_iefuzz5", "score": "3", "subreddit": "AmerExit", "subreddit_id": "t5_5b1mph"}, {"author": "LightheartMusic", "body": "What software do you use? I’m having troubles with the pdfs that I make printing out correctly on my brother printer", "created_utc": "1656617848.0", "edited": "False", "id": "iecwym5", "is_submitter": "False", "link_id": "t3_tjm0mh", "parent_id": "t1_i1rys2b", "score": "1", "subreddit": "bookbinding", "subreddit_id": "t5_2smpy"}, {"author": "LightheartMusic", "body": "“(It was) Sad but necessary”\nThat is, the dog killing it’s owner was sad but necessary", "created_utc": "1656555625.0", "edited": "False", "id": "ie9odvf", "is_submitter": "False", "link_id": "t3_vntqvx", "parent_id": "t1_ie9midf", "score": "6", "subreddit": "latin", "subreddit_id": "t5_2qloa"}, {"author": "LightheartMusic", "body": "One of my favorite stories is about a Chinese professor who hated being asked to translate random Chinese things by his friends, such as the Classical Chinese saying on wall scrolls in restaurants.", "created_utc": "1656373899.0", "edited": "False", "id": "idzpocu", "is_submitter": "False", "link_id": "t3_vlyz1l", "parent_id": "t1_idyp75g", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "LightheartMusic", "body": "“Va t’faire enculer, va bien t’faire enculer, conard”\nJust hit ‘em with a little Thérapie Taxi.", "created_utc": "1656373799.0", "edited": "False", "id": "idzpgk4", "is_submitter": "False", "link_id": "t3_vlyz1l", "parent_id": "t1_idyhzhi", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "LightheartMusic", "body": "Yes they do. I don’t personally, but if there is a very skilled floral arranger, their work will be in high demand.", "created_utc": "1656163004.0", "edited": "False", "id": "idon41t", "is_submitter": "False", "link_id": "t3_vk9jbw", "parent_id": "t1_idol8s7", "score": "6", "subreddit": "germany", "subreddit_id": "t5_2qi4z"}, {"author": "LightheartMusic", "body": "I always say that Soviet Russia was the only axis power that really got what it wanted (or most of what it wanted anyway). The Allies never completely won the war, we’re still living in dynamics triggered by it IMO.", "created_utc": "1656154873.0", "edited": "False", "id": "idoawxa", "is_submitter": "False", "link_id": "t3_vjoz4k", "parent_id": "t1_idnb75q", "score": "5", "subreddit": "europe", "subreddit_id": "t5_2qh4j"}, {"author": "LightheartMusic", "body": "Reminds me of when I was little and thought the song in the sound of music went “ 🎶 tea, a drink with German bread “", "created_utc": "1656112658.0", "edited": "False", "id": "idmg638", "is_submitter": "False", "link_id": "t3_vjijk1", "parent_id": "t1_idj7xjf", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "LightheartMusic", "body": "I just looked that up and Jesus. I physically cringed reading his wiki", "created_utc": "1656112104.0", "edited": "False", "id": "idmez26", "is_submitter": "False", "link_id": "t3_vjijk1", "parent_id": "t1_idk31in", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "LightheartMusic", "body": "Paolo Conte", "created_utc": "1656068501.0", "edited": "False", "id": "idjm0b2", "is_submitter": "False", "link_id": "t3_vj4xl4", "parent_id": "t3_vj4xl4", "score": "2", "subreddit": "italianlearning", "subreddit_id": "t5_2tuxf"}, {"author": "LightheartMusic", "body": "Tbf, that’s a useful sentence to know in almost every language", "created_utc": "1655950727.0", "edited": "False", "id": "iddrvu4", "is_submitter": "False", "link_id": "t3_ng2xqm", "parent_id": "t1_gyrefzt", "score": "1", "subreddit": "italianlearning", "subreddit_id": "t5_2tuxf"}, {"author": "LightheartMusic", "body": "Fascists will use any tool at their disposal. They will take over or corrupt anything they think will control or motivate people. That’s why our government is fucked now. Along with news networks, etc. It’s sickening to watch it spread like an infection through the body of our country.", "created_utc": "1655863053.0", "edited": "False", "id": "id96m4i", "is_submitter": "False", "link_id": "t3_vggz1r", "parent_id": "t1_id2xzrc", "score": "3", "subreddit": "AmerExit", "subreddit_id": "t5_5b1mph"}, {"author": "LightheartMusic", "body": "My ex got angry at me for learning her native language, so at this point I’m just not going to bother in the future. Too much effort for too little reward of things go poorly and you’re not interested in the language beyond your partner.", "created_utc": "1655770357.0", "edited": "False", "id": "id4fxlb", "is_submitter": "False", "link_id": "t3_vgnhfl", "parent_id": "t3_vgnhfl", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "LightheartMusic", "body": "Eehhhh. Sort of. Human cognition is much more uniform than people generally seem to think it is in the humanities. I agree there are certainly differences between individuals (I think someone mentioned aphantasia, I might add synesthesia or autism) but overall most people perceive the world in basically the same way. Where culture really comes into play is how we interpret that information, IMO.\n\nSource: my undergrad work had a decent amount devoted to this topic.", "created_utc": "1655615425.0", "edited": "False", "id": "icwwa9u", "is_submitter": "False", "link_id": "t3_vf3f7p", "parent_id": "t1_icu1no7", "score": "7", "subreddit": "worldbuilding", "subreddit_id": "t5_2rd6n"}, {"author": "LightheartMusic", "body": "And even then, one of America’s greatest resources and largest exports are cultural productions like novels, music, movies, video games, and so on. Beyond our military industrial complex, we’re really known for our cultural output. We are the third largest country with decently high literacy rates. It would be weird if we didn’t have high culture lmao", "created_utc": "1655615204.0", "edited": "False", "id": "icwvzk8", "is_submitter": "False", "link_id": "t3_vf3f7p", "parent_id": "t1_icuw5ev", "score": "7", "subreddit": "worldbuilding", "subreddit_id": "t5_2rd6n"}, {"author": "LightheartMusic", "body": "I have seen almost the exact same kind of graffiti in French university bathroom stalls. Down to the “bon caca.” Amazing how much survives as a cultural/linguistic undercurrent", "created_utc": "1655339429.0", "edited": "False", "id": "icivh1x", "is_submitter": "False", "link_id": "t3_vcld5x", "parent_id": "t1_icfdap0", "score": "4", "subreddit": "latin", "subreddit_id": "t5_2qloa"}, {"author": "LightheartMusic", "body": "Say what you will about Americans, or more generally people in the Anglosphere, but they are often very willing to be friendly and make that first move", "created_utc": "1655338954.0", "edited": "False", "id": "iciugvx", "is_submitter": "False", "link_id": "t3_vcq6u1", "parent_id": "t1_ici5uuw", "score": "18", "subreddit": "expats", "subreddit_id": "t5_2rhwp"}, {"author": "LightheartMusic", "body": "I have never seen people eat as much food as Italians, while simultaneously managing to look great. I don’t get it lmao", "created_utc": "1655266515.0", "edited": "False", "id": "icf0szh", "is_submitter": "False", "link_id": "t3_vc1w4v", "parent_id": "t1_icd9p5t", "score": "1", "subreddit": "europe", "subreddit_id": "t5_2qh4j"}, {"author": "LightheartMusic", "body": "Non ça veut dire l’Inde", "created_utc": "1655262752.0", "edited": "False", "id": "iceu2v8", "is_submitter": "False", "link_id": "t3_vc4qps", "parent_id": "t1_icdni10", "score": "2", "subreddit": "rance", "subreddit_id": "t5_2um6i"}, {"author": "LightheartMusic", "body": "I found two resources on amazon\n\n[Comanche Dictionary and Grammar](https://www.amazon.com/Comanche-Dictionary-Grammar-Second-Armagost/dp/1556713304/ref=sr_1_1?crid=J2P4Y5Y58F3Y&keywords=comanche+grammar&qid=1655136787&sprefix=comanche+grammar%2Caps%2C522&sr=8-1#customerReviews)\n\nand\n\n[A Grammar of Comanche](https://www.amazon.com/Grammar-Comanche-Studies-Anthropology-American/dp/0803214618/ref=sr_1_3?crid=J2P4Y5Y58F3Y&keywords=comanche+grammar&qid=1655136787&sprefix=comanche+grammar%2Caps%2C522&sr=8-3#customerReviews)\n\nNeither of which is great for learning to speak.\n\nI found [this movie](https://www.reddit.com/r/movies/comments/v6xwzw/prey_will_give_viewers_the_option_to_watch_the/) dubbed in Comanche. I really don't know what the movie scene is like for the language.\n\nI found this Youtube channel[Comanche Nation Language Department](https://www.youtube.com/channel/UC56JQNCWPMrSdtv2bKJxZWg)\n\nI found [this video](https://www.youtube.com/watch?v=eVpuio4ybG4&ab_channel=IAMNDN) I don't see anything else on the channel about the language but maybe you could contact the guy? Edit 2: IDK why i said that, he has other videos. \n\nI found this with a little googling. Maybe ask around on language learning forums. You could probably request Xefjord to make a new anki pack for Comanche. You should also see if there are any universities that teach Comanche. Maybe you could get textbooks for the class, or ask the professor if you could audit the class or just ask for advice. I'm sorry I can't be of any more help.\n\nEdit: \n\nBilingual album: Na Ʉnʉ Nahai (Shape Shifter) - Apryl Allen.\n\nEdit 3:\n\n[comanchenation.com](https://comanchenation.com/departments/comanche-nation-language-department-0) has a translation service. Maybe you could request that they translate a comprehensible input text like LingQ's ministories or Jensen's *English by the Nature Method*.", "created_utc": "1655137669.0", "edited": "1655140201.0", "id": "ic7xihj", "is_submitter": "False", "link_id": "t3_vauazq", "parent_id": "t3_vauazq", "score": "5", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "LightheartMusic", "body": "I made the same mistake as OP my for my first study abroad using a similar company. I could only afford it because I was able to use a grant from my school -- and then covid happened and I wasn't allowed to finish out my exchange. I'm going back this year, and it's A LOT cheaper now that I know what I'm doing. These companies are so predatory, preying on peoples' ignorance.", "created_utc": "1654999796.0", "edited": "False", "id": "ic1j3nb", "is_submitter": "False", "link_id": "t3_ul3i6p", "parent_id": "t1_i7ugcue", "score": "1", "subreddit": "Grenoble", "subreddit_id": "t5_2skay"}, {"author": "LightheartMusic", "body": "Seriously. Physical abuse is often an indicator of emotional/psychological abuse. Take pictures, save texts and so on…", "created_utc": "1654657478.0", "edited": "False", "id": "ibke02c", "is_submitter": "False", "link_id": "t3_v77rtb", "parent_id": "t1_ibkdt3w", "score": "78", "subreddit": "TooAfraidToAsk", "subreddit_id": "t5_2ssp7"}, {"author": "LightheartMusic", "body": "And it’s bled over into the expectations of girls as well. I know my ex thought I wasn’t interested in her at first because I wasn’t being pushy. I think it was part of her fantasy that she’d get a guy who’d do anything to have her, to fight for her. Not my fantasy lol, I mainly just wanted to chill and walk in the park with her. No interest in fighting off other potential love interests.", "created_utc": "1654652320.0", "edited": "False", "id": "ibk3xut", "is_submitter": "False", "link_id": "t3_v7021a", "parent_id": "t1_ibjimw2", "score": "6", "subreddit": "TooAfraidToAsk", "subreddit_id": "t5_2ssp7"}, {"author": "LightheartMusic", "body": "A huge benefit of taking the DUEF courses specifically at the University of Strasbourg is that it is part of the ADCUEFE network, which is a group of around 40 universities that will accept a DUEF certificate in place of an exam like the DELF/DALF for those looking to apply to a degree program. Very much worth it in my opinion, if you’re planning on going to school in France.\n\nThere are cheaper options, but you’ll have to look around. Move fast, because the registration period for many places closed in May. Maybe look at the alliance française. \n\nI myself have applied to the University of Strasbourg’s French program in addition to a couple of other universities, and I’m waiting to hear back. There is no clear place on the website that indicates deadlines.", "created_utc": "1654651761.0", "edited": "1654651959.0", "id": "ibk2uqd", "is_submitter": "False", "link_id": "t3_v6zsut", "parent_id": "t1_ibjisw8", "score": "3", "subreddit": "Strasbourg", "subreddit_id": "t5_2t6fw"}, {"author": "LightheartMusic", "body": "I joined yesterday. Saw this post and thought. It’s not going to be an egg is it?", "created_utc": "1654556630.0", "edited": "False", "id": "ibf9po9", "is_submitter": "False", "link_id": "t3_v5o8qy", "parent_id": "t1_ibc2p59", "score": "1", "subreddit": "fossilid", "subreddit_id": "t5_2s711"}, {"author": "LightheartMusic", "body": "God, there is so much great information on the main Facebook group, but so difficult to find because I’m pretty sure Facebook wasn’t made for a forum experience.", "created_utc": "1654443730.0", "edited": "False", "id": "ib9ge1m", "is_submitter": "False", "link_id": "t3_ukp0ug", "parent_id": "t1_i7seqgj", "score": "5", "subreddit": "juresanguinis", "subreddit_id": "t5_2y01g"}, {"author": "LightheartMusic", "body": "Check with your military and see if they offer to pay for you to learn certain languages", "created_utc": "1654385250.0", "edited": "False", "id": "ib71u91", "is_submitter": "False", "link_id": "t3_v4tfpz", "parent_id": "t1_ib6a0a3", "score": "2", "subreddit": "thisorthatlanguage", "subreddit_id": "t5_4inj8f"}, {"author": "LightheartMusic", "body": "I get what you mean. I had Europeans argue to me that the n word wasn’t as bad in Europe because they don’t have the same history as the US when it comes to slavery and the use of that particular word. I still didn’t buy it obviously but yeah I get the mind fuck. \n\nAs for cartoons, I don’t know. I guess maybe the argument could be made they that they’re  different, depending on the cartoon and how caricatured the white characters are compared to POC characters — but I still wouldn’t go around wearing something like what you described. It just strikes me as disturbing.", "created_utc": "1654316485.0", "edited": "False", "id": "ib46bpl", "is_submitter": "False", "link_id": "t3_v4cge1", "parent_id": "t1_ib45dqa", "score": "8", "subreddit": "AmerExit", "subreddit_id": "t5_5b1mph"}, {"author": "LightheartMusic", "body": "I’m white from the northeast of the US. The open casual racism in Europe was absolutely shocking to me when I was living abroad for the first time, even directed to people who were supposedly friends. Brutal.", "created_utc": "1654304793.0", "edited": "False", "id": "ib3nlkw", "is_submitter": "False", "link_id": "t3_v4cge1", "parent_id": "t1_ib3mbw1", "score": "14", "subreddit": "AmerExit", "subreddit_id": "t5_5b1mph"}, {"author": "LightheartMusic", "body": "While there are plenty of downsides to life here in the US, there are still a lot of opportunities if you are lucky, well prepared, and hard working. There is a pretty good sized population of immigrants from wealthy countries where I live, and most of them have done very well. \n\nStill, yeah, especially when they have school aged children I really don’t get it. I know I wouldn’t put my kids into the public school in my hometown between the intense opiate problem where I live, along with all the school shootings around the country.", "created_utc": "1654140082.0", "edited": "False", "id": "iavchfs", "is_submitter": "False", "link_id": "t3_v2ycxa", "parent_id": "t3_v2ycxa", "score": "0", "subreddit": "AmerExit", "subreddit_id": "t5_5b1mph"}, {"author": "LightheartMusic", "body": "While the dude in this thread was an ass, I’m a little annoyed that people are downvoting now that he’s just asking questions. You never know what push someone might need to explore something they might like someday.", "created_utc": "1654130862.0", "edited": "False", "id": "iautykz", "is_submitter": "False", "link_id": "t3_v2rz5m", "parent_id": "t1_iaustum", "score": "4", "subreddit": "AmerExit", "subreddit_id": "t5_5b1mph"}, {"author": "LightheartMusic", "body": "But needless say don’t harass anyone using those apps.", "created_utc": "1654130633.0", "edited": "False", "id": "iauthdc", "is_submitter": "False", "link_id": "t3_v2mm4b", "parent_id": "t1_iatzge6", "score": "1", "subreddit": "AmerExit", "subreddit_id": "t5_5b1mph"}, {"author": "LightheartMusic", "body": "Oh my god, that French copy of the Charlie Brown I have where they called Lucy a bitch makes so much more sense now", "created_utc": "1653962618.0", "edited": "False", "id": "iam5p6g", "is_submitter": "False", "link_id": "t3_v0wwm9", "parent_id": "t1_iajc0vm", "score": "6", "subreddit": "French", "subreddit_id": "t5_2rd5t"}, {"author": "LightheartMusic", "body": "I think you might be severely underestimating the amount of work it takes to run a food business. I start work at 5 am. This is common. How will you find a place to open the business? Cities will be expensive and competitive, and there all kinds of problems with moving to a town such as people not wanting immigrants for example. There is also no guarantee that you’ll get any customers, especially in a town/village where you’re competing with already established business, with a customer base that won’t like you competing with their favorite restaurant.", "created_utc": "1653919656.0", "edited": "1653919878.0", "id": "iajnv4i", "is_submitter": "False", "link_id": "t3_v0v2k1", "parent_id": "t1_iajiue1", "score": "6", "subreddit": "IWantOut", "subreddit_id": "t5_2r5hw"}, {"author": "LightheartMusic", "body": "And while China is ruled by the CCP one could very easily argue that they are also capitalist.", "created_utc": "1653918094.0", "edited": "False", "id": "iajkstk", "is_submitter": "False", "link_id": "t3_v0sgvr", "parent_id": "t1_iajhke2", "score": "12", "subreddit": "AmerExit", "subreddit_id": "t5_5b1mph"}, {"author": "LightheartMusic", "body": "I second monoprix. They're everywhere.", "created_utc": "1653886398.0", "edited": "False", "id": "iaif0w4", "is_submitter": "False", "link_id": "t3_upxjpi", "parent_id": "t1_i8oyk4k", "score": "1", "subreddit": "travel", "subreddit_id": "t5_2qh41"}, {"author": "LightheartMusic", "body": "I'm so sorry to hear about this.\n\nI think part of this is just racism. When I was studying in Grenoble a Chinese member of our social group was relentlessly harassed by a Middle Eastern student. Endless comments about tiny penises, or eating dogs etc. Usual bs. And I did see that this bullying was often joined in by some of the European students as well (obviously not all). Unfortunately they didn't seem to see what was wrong with this.\n\nThis was my first encounter with European racism. I thought we were pretty racist in the USA, but clearly Europe can do just as good a job at being terrible if in the mood.\n\nWhere are you studying, btw? I know the north sometimes has a reputation of being kinda racist / rednecky.\n\n&#x200B;\n\nEdit:\n\nAaaaand I just realized this is a 7 month old post.", "created_utc": "1653886053.0", "edited": "False", "id": "iaiehvm", "is_submitter": "False", "link_id": "t3_qjw6mk", "parent_id": "t3_qjw6mk", "score": "1", "subreddit": "studyAbroad", "subreddit_id": "t5_2s8bd"}, {"author": "LightheartMusic", "body": "So Amsterdam", "created_utc": "1653881963.0", "edited": "False", "id": "iai7lai", "is_submitter": "False", "link_id": "t3_v0fyxx", "parent_id": "t1_iai70xo", "score": "13", "subreddit": "thomastheplankengine", "subreddit_id": "t5_qgmfr"}, {"author": "LightheartMusic", "body": "I like that idea. Pope can switch tile color, and thus have full access to all diagonals. Can crown knights into an extra king in a move called “holy Roman emperor”", "created_utc": "1653881775.0", "edited": "False", "id": "iai78gu", "is_submitter": "False", "link_id": "t3_v0aqfh", "parent_id": "t1_iahazn9", "score": "5", "subreddit": "thomastheplankengine", "subreddit_id": "t5_qgmfr"}, {"author": "LightheartMusic", "body": "Somebody’s never seen Star Trek smh\n\n\n\n\n/j just in case", "created_utc": "1653784342.0", "edited": "False", "id": "iadh35m", "is_submitter": "False", "link_id": "t3_uzppcy", "parent_id": "t1_iadcahz", "score": "8", "subreddit": "linguisticshumor", "subreddit_id": "t5_2vwiq"}, {"author": "LightheartMusic", "body": "I had the same thought lol! I think we just talked on r/germany about Italian stuff", "created_utc": "1653784122.0", "edited": "False", "id": "iadgotx", "is_submitter": "False", "link_id": "t3_uzvu7h", "parent_id": "t1_iadeklw", "score": "8", "subreddit": "AmerExit", "subreddit_id": "t5_5b1mph"}, {"author": "LightheartMusic", "body": "Dammmmit I now have claque-le in my head", "created_utc": "1653781503.0", "edited": "False", "id": "iadbu47", "is_submitter": "False", "link_id": "t3_uzp21s", "parent_id": "t1_iadajcn", "score": "2", "subreddit": "French", "subreddit_id": "t5_2rd5t"}, {"author": "LightheartMusic", "body": "I mean… we’ve kind of destroyed a lot of the earth, and whoever made this disgusting propaganda definitely meets my definition of a monster.", "created_utc": "1653780065.0", "edited": "False", "id": "iad943s", "is_submitter": "False", "link_id": "t3_uzg16p", "parent_id": "t1_iacgrbg", "score": "2", "subreddit": "therewasanattempt", "subreddit_id": "t5_39ne7"}, {"author": "LightheartMusic", "body": "I’m right there with you. These people are demented. They hear the words “dead children” and their first thought is of their guns. Then they try to make their repugnant message go down with a Jesus pill as if we’re morons", "created_utc": "1653779807.0", "edited": "False", "id": "iad8m48", "is_submitter": "False", "link_id": "t3_uzvu7h", "parent_id": "t1_iacuf2j", "score": "26", "subreddit": "AmerExit", "subreddit_id": "t5_5b1mph"}, {"author": "LightheartMusic", "body": "I feel literally sick. This is the most disturbing shit. The fact that half of America seems to think this way fills me with such horror and apathy", "created_utc": "1653779436.0", "edited": "False", "id": "iad7wo6", "is_submitter": "False", "link_id": "t3_uzvu7h", "parent_id": "t1_iad59sk", "score": "25", "subreddit": "AmerExit", "subreddit_id": "t5_5b1mph"}, {"author": "LightheartMusic", "body": "I think it has less to do with religiosity and more to do with being brainwashed by the NRA and GOP. If these stupid assholes ever bothered to look at the basic assumptions of the religion they claim to love so much they wouldn’t fucking …… AHHHHHHH I can’t even express how fucked up this piece of propaganda makes me feel. It’s so insane. Why do they feel the need to “own liberals” so badly??? I don’t feel the need to attack them. Why are you coming at me? Do real people actually come up with this stuff? Who thought this was okay? Did a think tank come up with this?\n\n\nSorry for the rant, I just don’t even know what to do with the fact that this exists.", "created_utc": "1653779317.0", "edited": "False", "id": "iad7op2", "is_submitter": "False", "link_id": "t3_uzvu7h", "parent_id": "t1_iacr3b7", "score": "12", "subreddit": "AmerExit", "subreddit_id": "t5_5b1mph"}, {"author": "LightheartMusic", "body": "That’s what I’m doing right now. Only problem is that since all my Italian ancestors were illiterate peasants literally nothing is spelled the same or is consistant between legal documents. Currently waiting on their birth certificates so I know what names and documents I’ll have to petition the courts to correct", "created_utc": "1653747678.0", "edited": "False", "id": "iabdbay", "is_submitter": "False", "link_id": "t3_uzfj0q", "parent_id": "t1_iab6xgw", "score": "4", "subreddit": "germany", "subreddit_id": "t5_2qi4z"}, {"author": "LightheartMusic", "body": "Si les rancophones commencent à écrire dans cette façon je serai véritablement dans la merde. C déjà compliqué quant à moi.", "created_utc": "1653605438.0", "edited": "False", "id": "ia4ihbd", "is_submitter": "False", "link_id": "t3_uygfw4", "parent_id": "t1_ia48o5y", "score": "11", "subreddit": "rance", "subreddit_id": "t5_2um6i"}, {"author": "LightheartMusic", "body": "But the Netherlands is still very beautiful! And most of the Dutch people I have met have been very nice. I was very tempted by the DAFT visa (they had fun coming up with that name I guess lol) but I'm pretty sure the last thing Europe needs is yet another bakery... besides, the back pain is really starting to get to me. \n\nBoy do I wish I could prove Luxembourgish descent, one of my fantasies is to visit there. Closest thing was a couple of German ancestors about 200 years ago, so not quite. \n\nI want to visit Eastern Europe at some point, but my ex from that region kind of turned me off of the area with the stories she told me, so I would have to know more about whatever country before committing to living there. \n\nI think your country suggestions are really well thought out. I think that's what I'm going to limit myself to when thinking about this. France and Germany would likely be my ideal destinations I guess. \n\nMy BA is kind of a mess tbh. The school I was going to actually shut down and was folded into a larger institution midway through my degree which kind of wrecked my progression. I could probably argue for a Major in Ritual Studies with a French language Minor. But its specific designation would likely just be \"Liberal Arts.\" You can see why I am dissatisfied with it despite the hard work and good scholarship I put into it. It's more useful in the US where BAs can often serve as base for other less related fields.\n\nThank you for your thorough answer!", "created_utc": "1653532246.0", "edited": "False", "id": "ia0nrgt", "is_submitter": "True", "link_id": "t3_uxvusj", "parent_id": "t1_ia0i686", "score": "1", "subreddit": "IWantOut", "subreddit_id": "t5_2r5hw"}, {"author": "LightheartMusic", "body": "Sure, but most of us look at the ounces part of the label anyway. I have no idea how many liters the typical water bottle is, but I do know how many ounces.", "created_utc": "1653376671.0", "edited": "False", "id": "i9s52vj", "is_submitter": "False", "link_id": "t3_uw5bte", "parent_id": "t1_i9rcm96", "score": "2", "subreddit": "books", "subreddit_id": "t5_2qh4i"}, {"author": "LightheartMusic", "body": "Love it", "created_utc": "1653376101.0", "edited": "False", "id": "i9s4fki", "is_submitter": "False", "link_id": "t3_uvwusv", "parent_id": "t1_i9rth13", "score": "2", "subreddit": "WritingPrompts", "subreddit_id": "t5_2s3nb"}, {"author": "LightheartMusic", "body": "Oooh that’s what was odd. I actually think OP did a pretty great job, I didn’t notice that it was in second person at all", "created_utc": "1653375604.0", "edited": "False", "id": "i9s3ulf", "is_submitter": "False", "link_id": "t3_uvwusv", "parent_id": "t1_i9roqat", "score": "3", "subreddit": "WritingPrompts", "subreddit_id": "t5_2s3nb"}, {"author": "LightheartMusic", "body": "Something unfortunate about Central and Eastern European countries, is how in some of them there is a lack of clear ethical boundaries between teachers and students. For example, my ex from Hungary told me that relationships between students and teachers were very common in her high school, and were rarely looked down upon. I imagine it gets worse in university. This is one area I think my country gets right thank god.", "created_utc": "1653356434.0", "edited": "False", "id": "i9r8okp", "is_submitter": "False", "link_id": "t3_uw97rf", "parent_id": "t1_i9qc89e", "score": "3", "subreddit": "TEFL", "subreddit_id": "t5_2qq76"}, {"author": "LightheartMusic", "body": "Whenever I try to to say “amn’t” I usually put a p in there which just sounds so ugly.", "created_utc": "1653254311.0", "edited": "False", "id": "i9ly8ae", "is_submitter": "False", "link_id": "t3_uvdhxg", "parent_id": "t1_i9kskef", "score": "29", "subreddit": "linguistics", "subreddit_id": "t5_2qhos"}, {"author": "LightheartMusic", "body": "Le basilic, non?", "created_utc": "1653186514.0", "edited": "False", "id": "i9iq9t0", "is_submitter": "False", "link_id": "t3_uuqgh4", "parent_id": "t1_i9hlhld", "score": "0", "subreddit": "rance", "subreddit_id": "t5_2um6i"}, {"author": "LightheartMusic", "body": "As someone from a literal <2,000 person village in rural USA who’s been to Amsterdam, this is such a funny thing to read. I was absolutely overwhelmed, I’m shocked I wasn’t mugged. \n\n\n\n\n\n\n\nI lost all money within about 30 minutes of being in London.", "created_utc": "1653102823.0", "edited": "False", "id": "i9erh3a", "is_submitter": "False", "link_id": "t3_uasqf3", "parent_id": "t1_i6132fd", "score": "2", "subreddit": "expats", "subreddit_id": "t5_2rhwp"}, {"author": "LightheartMusic", "body": "I went in either February or March, before noon. The temperature was decent, and there weren’t too many tourists.", "created_utc": "1653079752.0", "edited": "False", "id": "i9di0e3", "is_submitter": "False", "link_id": "t3_utb0hr", "parent_id": "t1_i98zx42", "score": "1", "subreddit": "travel", "subreddit_id": "t5_2qh41"}, {"author": "LightheartMusic", "body": "“Immaculate election”\nJesus Christ that’s such a fantastic line", "created_utc": "1653057127.0", "edited": "False", "id": "i9c0odd", "is_submitter": "False", "link_id": "t3_utglzy", "parent_id": "t1_i9alze4", "score": "1", "subreddit": "videos", "subreddit_id": "t5_2qh1e"}, {"author": "LightheartMusic", "body": "That made me grimace", "created_utc": "1652994314.0", "edited": "False", "id": "i98zp1o", "is_submitter": "False", "link_id": "t3_ut5mvk", "parent_id": "t1_i98x0jx", "score": "3", "subreddit": "linguisticshumor", "subreddit_id": "t5_2vwiq"}, {"author": "LightheartMusic", "body": "FR. Like she should at least have scars on her feet or something. Scars anywhere, pictures of stitches. Like if it happened at the intensity she's claiming, it should not be difficult to prove.", "created_utc": "1652930506.0", "edited": "False", "id": "i95ri3d", "is_submitter": "False", "link_id": "t3_uspnv1", "parent_id": "t1_i95olpp", "score": "5", "subreddit": "videos", "subreddit_id": "t5_2qh1e"}, {"author": "LightheartMusic", "body": "I remember there was some fantasy series with a premise like this set in London. Stoneheart I think?\n\n&#x200B;\n\nEdit:\n\nFrom Wikipedia:\n\n>It is a story about two children, George and Edie, as they struggle to survive a war between the animated statues of London.\n\nSo there ya go", "created_utc": "1652930210.0", "edited": "False", "id": "i95qxk5", "is_submitter": "False", "link_id": "t3_usghuh", "parent_id": "t1_i93xpd0", "score": "4", "subreddit": "thomastheplankengine", "subreddit_id": "t5_qgmfr"}, {"author": "LightheartMusic", "body": "Yeah, that's my read too. I know someone who lost a case because she lied to her lawyer, which meant he was literally unable to actually defend her because he didn't have real information he could work with.\n\n&#x200B;\n\nCurrently, someone in my family is being sued by another family member. We're all confused because it's common knowledge that everything the plaintif is claiming has either previously been shown to be false in a probate court, while everything else is just batshit hearsay that will likely be shot down when the suit begins proper. The only thing that makes sense to us is that the plaintif is lying to the lawyer, because he for sure will be liable for a lawsuit if he actually has all the information and knows this case is just harassment :/", "created_utc": "1652927499.0", "edited": "False", "id": "i95ljxz", "is_submitter": "False", "link_id": "t3_uspnv1", "parent_id": "t1_i95j7z8", "score": "22", "subreddit": "videos", "subreddit_id": "t5_2qh1e"}, {"author": "LightheartMusic", "body": "One professer at the Université de Caen told me all about how clever Napoleon was for forcing people to speak French. She seemed oddly proud of it, and went into detail about how he did it.\n\nSo yeah you're right. It's not just linguistic imperialism, it's a tool of the fairly brutal actual imperialism that France is so famous for. I really want to learn a regional language one day, but there seems to be so few resources and native speakers that I feel quite depressed by the idea. Same deal with Ainu when I discovered what had been done them by the Japanese government.", "created_utc": "1652926908.0", "edited": "False", "id": "i95kcbp", "is_submitter": "False", "link_id": "t3_usljhf", "parent_id": "t1_i95j439", "score": "9", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "LightheartMusic", "body": "Moi, je viens des États-Unis. Je me sens si nauséeux que la mort semble une bonne solution en ce moment. Les Ricains sont en solidarité avec vous contre ce crime de guerre énorme.", "created_utc": "1652926535.0", "edited": "False", "id": "i95jkd5", "is_submitter": "False", "link_id": "t3_usji0q", "parent_id": "t3_usji0q", "score": "1", "subreddit": "rance", "subreddit_id": "t5_2um6i"}, {"author": "LightheartMusic", "body": ">She's enhanced her abuse allegations to claim being beaten within an inch of her life\n\nCorrection, she's also enhanced her abuse allegations to claim that she's was raped with a liquor bottle. And somehow broken glass plays a role. But she didn't need to go the hospital apparently. I really want to be able to be neutral and unbiased and wait until there's a verdict but it's impossible when this is how she's gone about the case. She is clearly mentally ill, abusive, and needs to have some kind of intervention and treatment.   \n\nThe only thing that I've been able to take away from this is that I will be very careful in future when choosing new romantic partners.", "created_utc": "1652926174.0", "edited": "False", "id": "i95itkh", "is_submitter": "False", "link_id": "t3_uspnv1", "parent_id": "t1_i959flq", "score": "65", "subreddit": "videos", "subreddit_id": "t5_2qh1e"}, {"author": "LightheartMusic", "body": "I remember one of my French professors telling me about how when his grandmother was forced to go to school she was horribly beaten whenever she spoke in her regional language", "created_utc": "1652925476.0", "edited": "False", "id": "i95hbrs", "is_submitter": "False", "link_id": "t3_usljhf", "parent_id": "t1_i95e3et", "score": "19", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "LightheartMusic", "body": "I don’t understand that last sentence, but yeah seems like a nasty dude", "created_utc": "1652922557.0", "edited": "False", "id": "i95b0jw", "is_submitter": "False", "link_id": "t3_usljhf", "parent_id": "t1_i9571ri", "score": "6", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "LightheartMusic", "body": "Isn’t Breton… a Celtic language? And thus could in no way ever be thought of as a dialect of French, or even a romance language??", "created_utc": "1652917001.0", "edited": "False", "id": "i94z90l", "is_submitter": "False", "link_id": "t3_usljhf", "parent_id": "t1_i94qic6", "score": "95", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "LightheartMusic", "body": "Accepting reality does not mean accepting shitty behavior. Yes, OP can accept the loss and move on, and even forgive, but still should not forget that the father has proven himself untrustworthy, a thief. The father has in fact been a bad father because he has taught his child a terrible lesson “you should not work hard. You do not deserve compensation for your work. What is yours will be taken away.” \n\nFuture savings should be in cash until OP is 18 and can open a bank account.", "created_utc": "1652916773.0", "edited": "False", "id": "i94yrff", "is_submitter": "False", "link_id": "t3_usnvvu", "parent_id": "t1_i94x6z5", "score": "14", "subreddit": "Stoicism", "subreddit_id": "t5_2r4kq"}, {"author": "LightheartMusic", "body": "Who knew France was so large 🇫🇷", "created_utc": "1652903507.0", "edited": "False", "id": "i9441o2", "is_submitter": "False", "link_id": "t3_usdqd2", "parent_id": "t1_i93z0fz", "score": "5", "subreddit": "whatsthisbug", "subreddit_id": "t5_2s3bw"}, {"author": "LightheartMusic", "body": "What town? I need to know so I never go near that spider", "created_utc": "1652900954.0", "edited": "False", "id": "i93xrwu", "is_submitter": "False", "link_id": "t3_usdqd2", "parent_id": "t1_i92rzyf", "score": "2", "subreddit": "whatsthisbug", "subreddit_id": "t5_2s3bw"}, {"author": "LightheartMusic", "body": "I live in the country. Some of the towns have businesses and homes fairly close together, others are spread out over many miles only accessible by car. Maybe that’s what OP meant?", "created_utc": "1652894403.0", "edited": "False", "id": "i93hl3v", "is_submitter": "False", "link_id": "t3_usgrro", "parent_id": "t1_i93gm5x", "score": "0", "subreddit": "AmerExit", "subreddit_id": "t5_5b1mph"}, {"author": "LightheartMusic", "body": "I’ve decided I don’t want to know thank you very much", "created_utc": "1652887690.0", "edited": "False", "id": "i930zsw", "is_submitter": "False", "link_id": "t3_usada7", "parent_id": "t1_i92ut8u", "score": "11", "subreddit": "meirl", "subreddit_id": "t5_2s5ti"}, {"author": "LightheartMusic", "body": "Toki Pona is super cool go for it", "created_utc": "1652886991.0", "edited": "False", "id": "i92z9jf", "is_submitter": "False", "link_id": "t3_usbveh", "parent_id": "t1_i92nhqu", "score": "1", "subreddit": "thisorthatlanguage", "subreddit_id": "t5_4inj8f"}, {"author": "LightheartMusic", "body": "I’d imagine you’d have more luck asking over at r/askhistorians", "created_utc": "1652879086.0", "edited": "False", "id": "i92hlcv", "is_submitter": "False", "link_id": "t3_us7sqf", "parent_id": "t3_us7sqf", "score": "2", "subreddit": "linguistics", "subreddit_id": "t5_2qhos"}, {"author": "LightheartMusic", "body": "Mm, a case by case basis, if you will.", "created_utc": "1652852189.0", "edited": "False", "id": "i91id5l", "is_submitter": "False", "link_id": "t3_urwnsj", "parent_id": "t1_i90ria0", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "LightheartMusic", "body": "I’m 6’1. The top of my ex’s head came up to my nips. I did not enjoy holding hands while walking with her, it was way uncomfortable.\n\nI hope my next gf is massively tall and can bench press me, ***I*** want to feel protected and safe this time lmao", "created_utc": "1652850929.0", "edited": "False", "id": "i91glz1", "is_submitter": "False", "link_id": "t3_urrgxn", "parent_id": "t1_i90qw6o", "score": "26", "subreddit": "TooAfraidToAsk", "subreddit_id": "t5_2ssp7"}, {"author": "LightheartMusic", "body": "If the eggs are unwashed they last longer and can be unrefrigerated. Pre-washing removes the outer protective layer of the eggshell, and enables bacteria to get into the egg, which is why we now refrigerate store-bought eggs. \n\nStill, washed or not, I think I’d prefer my eggs refrigerated.", "created_utc": "1652850698.0", "edited": "False", "id": "i91gal8", "is_submitter": "False", "link_id": "t3_urrgxn", "parent_id": "t1_i91f2qj", "score": "11", "subreddit": "TooAfraidToAsk", "subreddit_id": "t5_2ssp7"}, {"author": "LightheartMusic", "body": "Added an extra “I” there buddy", "created_utc": "1652839835.0", "edited": "False", "id": "i90wtn8", "is_submitter": "False", "link_id": "t3_urvbxm", "parent_id": "t1_i90vpq2", "score": "5", "subreddit": "facepalm", "subreddit_id": "t5_2r5rp"}, {"author": "LightheartMusic", "body": "à ce moment, je crois que j'irai à l'université de Lorraine pour m'améliorer mon niveau de français afin que je puisse étudier pour mon master en France, en français. \n\nLes deux autres options disponibles sont l'université de Franche-Comté à Besançon, ou l'université de Rennes 2.", "created_utc": "1652761634.0", "edited": "False", "id": "i8wr45c", "is_submitter": "True", "link_id": "t3_uqdndr", "parent_id": "t1_i8s32jn", "score": "1", "subreddit": "French", "subreddit_id": "t5_2rd5t"}, {"author": "LightheartMusic", "body": "What does ESH mean?", "created_utc": "1652725531.0", "edited": "False", "id": "i8umgr1", "is_submitter": "False", "link_id": "t3_uqki82", "parent_id": "t1_i8sry5b", "score": "1", "subreddit": "AmItheAsshole", "subreddit_id": "t5_2xhvq"}, {"author": "LightheartMusic", "body": "I have a hard time hearing the difference between a Swiss accent and a standard French accent that you might hear in, say, idk Caen. The vowels are longer?", "created_utc": "1652505621.0", "edited": "False", "id": "i8jmqxb", "is_submitter": "False", "link_id": "t3_uoozzg", "parent_id": "t1_i8h55tc", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "LightheartMusic", "body": "I just knew it was going to be u/Xefjord from the title lol.\n\n&#x200B;\n\nAnd Miꞌkmaw probably. Either that or an ancient language like Sumerian. Also I actually have no idea about the resource quality but Basque has always looked super cool.", "created_utc": "1652243550.0", "edited": "1652243753.0", "id": "i859210", "is_submitter": "False", "link_id": "t3_un0as1", "parent_id": "t3_un0as1", "score": "58", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "LightheartMusic", "body": "Tbh I’m kind of shocked that even bothered to track down the name of the captain who preceded Pike. I guess Trekkies do have a bit of a reputation and the writers were trying to avoid starting a controversy. That went well lol", "created_utc": "1652236269.0", "edited": "False", "id": "i84utda", "is_submitter": "False", "link_id": "t3_umtdwi", "parent_id": "t1_i84io7d", "score": "1", "subreddit": "Fantasy", "subreddit_id": "t5_2qknd"}, {"author": "LightheartMusic", "body": "You know, Paris, Portugal.", "created_utc": "1652230628.0", "edited": "False", "id": "i84ifl0", "is_submitter": "False", "link_id": "t3_umhuh8", "parent_id": "t1_i84guti", "score": "41", "subreddit": "linguisticshumor", "subreddit_id": "t5_2vwiq"}, {"author": "LightheartMusic", "body": "I don’t even know who that is lol. Was the character previously played by a white actor or something? Why do people care?", "created_utc": "1652230359.0", "edited": "False", "id": "i84huoq", "is_submitter": "False", "link_id": "t3_umtdwi", "parent_id": "t1_i84gzly", "score": "2", "subreddit": "Fantasy", "subreddit_id": "t5_2qknd"}, {"author": "LightheartMusic", "body": "Lots of people are upset that the bridge crew are entirely female with the exception of Captain Pike and Spock. Others are upset over the show referencing Discovery (which I kind of get but it’s literally so easy to ignore). Others were mad about there being windmills in Montana. I did think the windmills were odd because I’d have assumed there’d be like sci-fi power sources. They seem to be upset about it being “leftist propaganda” or something. Whatever.\n\nThe only thing I didn’t really like was the Ukrainian flag being used as an alien flag in one shot. That felt mildly, uhh, tone deaf, and an easy fix to get rid of.", "created_utc": "1652229077.0", "edited": "False", "id": "i84f1dv", "is_submitter": "False", "link_id": "t3_umtdwi", "parent_id": "t1_i84cyxa", "score": "4", "subreddit": "Fantasy", "subreddit_id": "t5_2qknd"}, {"author": "LightheartMusic", "body": "What is the name of the German high fantasy? I’m always looking for new books to supplement my learning materials", "created_utc": "1651856655.0", "edited": "False", "id": "i7kr9cc", "is_submitter": "False", "link_id": "t3_ujm68g", "parent_id": "t1_i7jspwe", "score": "2", "subreddit": "books", "subreddit_id": "t5_2qh4i"}, {"author": "LightheartMusic", "body": "I know people in real life who have said that men who are falsely accused of rape etc deserve to go to prison because of the patriarchy. Absolutely batshit", "created_utc": "1651795848.0", "edited": "False", "id": "i7hsoxf", "is_submitter": "False", "link_id": "t3_uj7dua", "parent_id": "t1_i7hj1db", "score": "15", "subreddit": "therewasanattempt", "subreddit_id": "t5_39ne7"}, {"author": "LightheartMusic", "body": "It’s so true tho. The French have the worst version of Mexican food out of any country I’ve been to. And then I tried to make Mexican food myself, I couldn’t even find the appropriate ingredients lol", "created_utc": "1651278257.0", "edited": "False", "id": "i6qf0l4", "is_submitter": "False", "link_id": "t3_t9ofjv", "parent_id": "t1_i2po04q", "score": "3", "subreddit": "ispeakthelanguage", "subreddit_id": "t5_zxl1r"}, {"author": "LightheartMusic", "body": "I am native and I took me many rereads along with a hint from the comments for me to actually figure out what was going on. Definitely needs commas at least", "created_utc": "1651209356.0", "edited": "False", "id": "i6mqqmf", "is_submitter": "False", "link_id": "t3_uee64k", "parent_id": "t1_i6mq3nw", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "LightheartMusic", "body": "American here. I never judge someone’s accent. I WILL, however, get super excited and want to know where someone’s from. Have to force myself not to ask.", "created_utc": "1651006583.0", "edited": "False", "id": "i6be7du", "is_submitter": "False", "link_id": "t3_ucgg6k", "parent_id": "t1_i6a8t4l", "score": "6", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "LightheartMusic", "body": "It’s been years since I’ve read them, but I loved all the books. Except the end of the last book. I don’t remember what happened at all, but I do know it left me feeling deeply sad, and I never returned to reread the series after that.", "created_utc": "1650944308.0", "edited": "False", "id": "i6812vm", "is_submitter": "False", "link_id": "t3_ubj2pp", "parent_id": "t1_i66spzp", "score": "1", "subreddit": "books", "subreddit_id": "t5_2qh4i"}, {"author": "LightheartMusic", "body": "Are you a native English speaker? If that the case then I think that’s the reason you can tell the difference at all lol", "created_utc": "1650927908.0", "edited": "False", "id": "i6709d2", "is_submitter": "False", "link_id": "t3_ubt7kh", "parent_id": "t1_i66najh", "score": "27", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "LightheartMusic", "body": "The vast majority of native English speakers are not even from England. Why would any of us want to be represented by the English?", "created_utc": "1650768470.0", "edited": "False", "id": "i5ye973", "is_submitter": "False", "link_id": "t3_ua0ypa", "parent_id": "t1_i5x4fmc", "score": "2", "subreddit": "linguisticshumor", "subreddit_id": "t5_2vwiq"}, {"author": "LightheartMusic", "body": "I was sexually abused twice. Once in elementary school, and then later over a period of about a month when I was a freshman. Both perpetrators were women. I will always distrust claims that men make up the majority of abusers.", "created_utc": "1650719338.0", "edited": "False", "id": "i5vgwzg", "is_submitter": "False", "link_id": "t3_u9brse", "parent_id": "t1_i5t4w1u", "score": "1", "subreddit": "TooAfraidToAsk", "subreddit_id": "t5_2ssp7"}, {"author": "LightheartMusic", "body": "Except I have seen people use the word “victim” as shorthand for the word “woman” even in instances where the man is accusing the woman of inappropriate behavior. It’s exhausting trying to navigate this crap", "created_utc": "1650719078.0", "edited": "False", "id": "i5vgf6o", "is_submitter": "False", "link_id": "t3_u9brse", "parent_id": "t1_i5rz4g8", "score": "2", "subreddit": "TooAfraidToAsk", "subreddit_id": "t5_2ssp7"}, {"author": "LightheartMusic", "body": "Except if the abuser claims they’re the victim, then there’s a high chance that the actual victim is going to be brutalized by the wider world. It’s much better to act supportive while withholding judgement. Better, but harder to do.", "created_utc": "1650718969.0", "edited": "False", "id": "i5vg7li", "is_submitter": "False", "link_id": "t3_u9brse", "parent_id": "t1_i5trwt5", "score": "2", "subreddit": "TooAfraidToAsk", "subreddit_id": "t5_2ssp7"}, {"author": "LightheartMusic", "body": "Nice. The lack of an app has held me back from using glossika", "created_utc": "1650662524.0", "edited": "False", "id": "i5su53b", "is_submitter": "False", "link_id": "t3_u9i5df", "parent_id": "t3_u9i5df", "score": "1", "subreddit": "glossika", "subreddit_id": "t5_3ad01"}, {"author": "LightheartMusic", "body": "I also had trouble with These two sounds, both of which are present in my variety of English. Since you speak English, I’ll give you some examples that illustrate the difference between  /e/ and /ɛ/ , even if they’re not really exactly between the two languages.\n\nBait  /e/ vs bet /ɛ/ \nBeckon  /ɛ/ vs bacon /e/\nChest  /ɛ/  vs chaste /e/\nRaced /e/ vs rest /ɛ/ \nSet /ɛ/  vs sate /e/\n\nHope that helps!\n\nEdit: just realized that most of these /e/‘s are probably diphthongs", "created_utc": "1650580894.0", "edited": "1650581450.0", "id": "i5oe04e", "is_submitter": "False", "link_id": "t3_u8nvfe", "parent_id": "t3_u8nvfe", "score": "2", "subreddit": "learnfrench", "subreddit_id": "t5_2sucz"}, {"author": "LightheartMusic", "body": "I agree with you so much. I think people who are victims often don’t know how to respond to the terrible behavior of their abusers. I know I let a bunch of awful shit happen to me, because I literally did not understand how anyone could think the way my abuser did. I did not get that another person could actively try to harm someone. I got it intellectually, but that didn’t mean I “got” it. Hell, my abuser told me before hand that she was dangerous and I thought she was joking. \n\nPerpetrators know how to game the system, doesn’t matter the gender, etc.\n\nI agree that that women aren’t always believed, but I think culturally we’re at a point where a lot of people feel comfortable saying “always believe the woman” or “always believe the victim (subtext: the woman)” so a lot of guys have gotten really defensive about it, and go to the other extreme because they don’t feel heard, or they don’t feel like their abuse matters. I know this something that I struggle with myself, and I have to actively try not to judge a situation until I know more. \n\nTLDR: life is messy lol", "created_utc": "1650504001.0", "edited": "False", "id": "i5k5zqt", "is_submitter": "False", "link_id": "t3_u7w9hj", "parent_id": "t1_i5jeynv", "score": "7", "subreddit": "TooAfraidToAsk", "subreddit_id": "t5_2ssp7"}, {"author": "LightheartMusic", "body": "I see you have two languages under the Mexican flag. What are they? I’m assuming Spanish and maybe Nahuatl or Mayan??", "created_utc": "1650417256.0", "edited": "False", "id": "i5f8oyh", "is_submitter": "False", "link_id": "t3_u7d28g", "parent_id": "t1_i5eg7ea", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "LightheartMusic", "body": "or like a lot of beans lmao", "created_utc": "1650052528.0", "edited": "False", "id": "i4vest6", "is_submitter": "False", "link_id": "t3_tyumcm", "parent_id": "t1_i434gbu", "score": "3", "subreddit": "Nootropics", "subreddit_id": "t5_2r81c"}, {"author": "LightheartMusic", "body": "By the looks of where that books coming from, not even that", "created_utc": "1649798198.0", "edited": "False", "id": "i4hd9sw", "is_submitter": "False", "link_id": "t3_u1zi0v", "parent_id": "t1_i4g0iza", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "LightheartMusic", "body": "Yep. I bought it because the only way to really support the developers. If I’m being honest, I kind of hate doing flash cards in my phone. So much easier for me to manage everything on a desktop.", "created_utc": "1649765025.0", "edited": "False", "id": "i4f1b1n", "is_submitter": "False", "link_id": "t3_u1w1lq", "parent_id": "t1_i4euxvu", "score": "2", "subreddit": "Anki", "subreddit_id": "t5_2s9lm"}, {"author": "LightheartMusic", "body": "Dutch?", "created_utc": "1649596593.0", "edited": "False", "id": "i45rzgn", "is_submitter": "False", "link_id": "t3_u0dftp", "parent_id": "t1_i459j82", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "LightheartMusic", "body": "Oh I was just being a goof, but now I have to check out those songs I guess", "created_utc": "1649346173.0", "edited": "False", "id": "i3rwf5a", "is_submitter": "False", "link_id": "t3_txm2as", "parent_id": "t1_i3rvfgz", "score": "1", "subreddit": "Damnthatsinteresting", "subreddit_id": "t5_2xxyj"}, {"author": "LightheartMusic", "body": "I think that the two countries are likely on par. I suppose we’ll find out if the current federal investigation gets anywhere. I don’t know if it’s worth comparing who’s done worse — it’s more important to publicly acknowledge what happened, and to make reparations, whatever that means.", "created_utc": "1649305389.0", "edited": "False", "id": "i3q1fnr", "is_submitter": "False", "link_id": "t3_txm2as", "parent_id": "t1_i3pqe1y", "score": "2", "subreddit": "Damnthatsinteresting", "subreddit_id": "t5_2xxyj"}, {"author": "LightheartMusic", "body": "I honestly don’t know enough about it to really tell you. Both in Canada and here in the US, the students were forcefully relocated from their homes, and if they survived, often adopted into white families, or sent into the foster system. I know a mass grave was discovered last year in Canada with the remains of over 200 children in it. This has prompted our government to look into to what extent similar atrocities were committed here in the US. I don’t know how this breaks down between the two countries, and you’d probably be better served by googling it. I think it’s important to note that the Canadian schools were based of the American system.", "created_utc": "1649305135.0", "edited": "False", "id": "i3q0zto", "is_submitter": "False", "link_id": "t3_txm2as", "parent_id": "t1_i3ponrb", "score": "3", "subreddit": "Damnthatsinteresting", "subreddit_id": "t5_2xxyj"}, {"author": "LightheartMusic", "body": "Those are all prog rock bands right?", "created_utc": "1649297418.0", "edited": "False", "id": "i3plxop", "is_submitter": "False", "link_id": "t3_txm2as", "parent_id": "t1_i3oaxjl", "score": "1", "subreddit": "Damnthatsinteresting", "subreddit_id": "t5_2xxyj"}, {"author": "LightheartMusic", "body": "We had similar schools in the US called “American Indian Boarding Schools” but I’m not sure how they compare. Ours were intended to “re-educate” Native Americans, aka, convert them to Christianity and anglicize them as much as possible (there was definitely abuse, and death among the students). Canada had very similar thing, and it recently came out how many First Nation people died in them. Pretty fucked up. And they lied about it for years and years. Even if they people didn’t go into these schools the effects they had on indigenous communities were horrific. My Mohawk cousin from Canada deeply hates the native part of his ancestry, and I have to guess it has something to do with the legacies of the schools.", "created_utc": "1649297367.0", "edited": "False", "id": "i3pltqr", "is_submitter": "False", "link_id": "t3_txm2as", "parent_id": "t1_i3pg1tk", "score": "3", "subreddit": "Damnthatsinteresting", "subreddit_id": "t5_2xxyj"}, {"author": "LightheartMusic", "body": "I never thought I’d see the day where Romney was the brave one, seriously shocking.", "created_utc": "1649296384.0", "edited": "False", "id": "i3pjn6g", "is_submitter": "False", "link_id": "t3_txmdfy", "parent_id": "t1_i3pc8ys", "score": "3", "subreddit": "worldnews", "subreddit_id": "t5_2qh13"}, {"author": "LightheartMusic", "body": "Before they had cornmeal they used other flours!!", "created_utc": "1648785218.0", "edited": "False", "id": "i2xweez", "is_submitter": "False", "link_id": "t3_ttdo9f", "parent_id": "t1_i2xv9ta", "score": "68", "subreddit": "AskHistorians", "subreddit_id": "t5_2ssp3"}, {"author": "LightheartMusic", "body": "What I might suggest is studying some slang and more colloquial French. Not intensively or anything, but enough to make listening to conversational French easier to comprehend.", "created_utc": "1648752929.0", "edited": "False", "id": "i2vtcfy", "is_submitter": "False", "link_id": "t3_tt24rj", "parent_id": "t1_i2vfh7q", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "LightheartMusic", "body": "I must remember this phrase for future use", "created_utc": "1648743842.0", "edited": "False", "id": "i2v5gl2", "is_submitter": "False", "link_id": "t3_tt1rd3", "parent_id": "t1_i2uul5p", "score": "54", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "LightheartMusic", "body": "Location-wise, I couldn't say either. But I'm guessing it might happen because /l/ and /θ/ can be produced in almost exactly the same posture, and it's easy to transition from the vowel to /l/ to /θ/. I'm having a little bit of crisis around that word now. This is just like when I found out about the cot-caught merger. I'll get over it in like a day lol.", "created_utc": "1648660763.0", "edited": "False", "id": "i2qljhc", "is_submitter": "False", "link_id": "t3_trw7dt", "parent_id": "t1_i2qgsrn", "score": "3", "subreddit": "linguistics", "subreddit_id": "t5_2qhos"}, {"author": "LightheartMusic", "body": "I used to default to “bolth” and I’m an East-Coaster", "created_utc": "1648655225.0", "edited": "False", "id": "i2q7m54", "is_submitter": "False", "link_id": "t3_trw7dt", "parent_id": "t1_i2pi6lf", "score": "2", "subreddit": "linguistics", "subreddit_id": "t5_2qhos"}, {"author": "LightheartMusic", "body": "LingQ can do a lot, but I feel like it’s really only good for comprehension. You will not learn how to talk if all you use is LingQ Another useful app is Anki, but again is really better suited for recognition. I personally use a mix of LingQ, Anki, and I have a great tutor on iTalki.", "created_utc": "1648654734.0", "edited": "False", "id": "i2q6e1u", "is_submitter": "False", "link_id": "t3_trvn1m", "parent_id": "t3_trvn1m", "score": "1", "subreddit": "learndutch", "subreddit_id": "t5_2t6rf"}, {"author": "LightheartMusic", "body": "Which part of Switzerland? West is French, central and East speaks German, and there is one canton in the south that speaks Italian", "created_utc": "1648602493.0", "edited": "False", "id": "i2np9nz", "is_submitter": "False", "link_id": "t3_tr7ucv", "parent_id": "t1_i2mluho", "score": "4", "subreddit": "thisorthatlanguage", "subreddit_id": "t5_4inj8f"}, {"author": "LightheartMusic", "body": "I would really caution you against modifying cards you are already learning, because I suspect that might interfere with what you’ve already started memorizing. What I might propose instead, is that you suspend all unseen cards in your original deck, and then suspend all the cards you would have already encountered in the new deck, and then you can merge them together if tou really want to. \n\nThis would also probably be better directed at r/learnjapanese, as they likely have a better handle on the plugins and scripts that would be most helpful for you.", "created_utc": "1648575534.0", "edited": "False", "id": "i2la4qb", "is_submitter": "False", "link_id": "t3_tqt6p2", "parent_id": "t3_tqt6p2", "score": "2", "subreddit": "Anki", "subreddit_id": "t5_2s9lm"}, {"author": "LightheartMusic", "body": "The rats", "created_utc": "1648518808.0", "edited": "False", "id": "i2ihksv", "is_submitter": "False", "link_id": "t3_tqcdv6", "parent_id": "t1_i2gs6h8", "score": "4", "subreddit": "paris", "subreddit_id": "t5_2qkoi"}, {"author": "LightheartMusic", "body": "My aunt lives in Vancouver so Putin can have that too", "created_utc": "1648517949.0", "edited": "False", "id": "i2ifsrr", "is_submitter": "False", "link_id": "t3_tq8ekb", "parent_id": "t1_i2gpb8e", "score": "1", "subreddit": "YUROP", "subreddit_id": "t5_2wivw"}, {"author": "LightheartMusic", "body": "In this case I think OP’s issue was more thinking that the accent was a macron rather than an acute", "created_utc": "1648485139.0", "edited": "False", "id": "i2ge6cu", "is_submitter": "False", "link_id": "t3_tpuffy", "parent_id": "t1_i2ebmrr", "score": "2", "subreddit": "learnfrench", "subreddit_id": "t5_2sucz"}, {"author": "LightheartMusic", "body": "I think they were saying that “smart cookie” in English is old fashioned, not that “futé” is, although admittedly I have never heard anyone say futé so it might well be.", "created_utc": "1648485021.0", "edited": "False", "id": "i2gdvrz", "is_submitter": "False", "link_id": "t3_tpuffy", "parent_id": "t1_i2fujz3", "score": "1", "subreddit": "learnfrench", "subreddit_id": "t5_2sucz"}, {"author": "LightheartMusic", "body": "Pretty common phrase in the eastern states too. Although I think it might have a slightly sexist  connotation, but I think that really depends on the tone used.", "created_utc": "1648484946.0", "edited": "False", "id": "i2gdowz", "is_submitter": "False", "link_id": "t3_tpuffy", "parent_id": "t1_i2fm00g", "score": "1", "subreddit": "learnfrench", "subreddit_id": "t5_2sucz"}, {"author": "LightheartMusic", "body": "Nine days isn’t much, and without knowing what you’re doing it would be hard to help you. Maybe basic housekeeping? If you have overdue task like reviewing flash cards, do those so you can stay on schedule when you are no longer on vacation. How’s you’re listening comprehension? Can you listen to Russian language podcasts, for example, for like four or five hours a day for nine days? It’s not much but might still give you a boost, especially if you keep listening afterwards, even if only for a couple hours a day.", "created_utc": "1648447786.0", "edited": "False", "id": "i2eooti", "is_submitter": "False", "link_id": "t3_tq1y3n", "parent_id": "t3_tq1y3n", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "LightheartMusic", "body": "This link might be useful\n\nhttp://www.french-linguistics.co.uk/grammar/passe_surcompose.shtml", "created_utc": "1648447286.0", "edited": "False", "id": "i2eo0bb", "is_submitter": "False", "link_id": "t3_tpkybi", "parent_id": "t3_tpkybi", "score": "2", "subreddit": "learnfrench", "subreddit_id": "t5_2sucz"}, {"author": "LightheartMusic", "body": "Humans like recognizing patterns and solving puzzles. \n\nI think what these activities all share in common is this essential component of pattern recognition and implementation. It’s been a while since I’ve taken any music theory (which I was never very good at) but I do remember trying to beat into my head these different rules of thumb for composition and performance. The main thing was exposure to lots and lots of music, listening, reading, learning how other people expressed their ideas and themes musically.\n\nSound familiar?\n\nLanguage learning for operates in similar way. Yes, you can learn grammar rules abstractly but you’ll also need that massive input, you’ll need exposure to the patterns of the language in use, and then you get to implement them yourself. The biggest difference in my mind between the experience of music vs language learning, is the scale of complexity. Nothing human engineered is complex as a language.\n\nI can’t really speak for math, as it was never my best subject, but it doesn’t feel quite the same to me. But as person studying for the GREs, the most helpful thing so far has been doing lots of QC problems, and then looking how I’ve fucked it up this time, and then looking at how I can do it better next time. In other words, I’m having to learn how to recognize the patterns of good math in action, before I can implement myself (hopefully).", "created_utc": "1648445647.0", "edited": "False", "id": "i2eln8u", "is_submitter": "False", "link_id": "t3_tq1juy", "parent_id": "t3_tq1juy", "score": "35", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "LightheartMusic", "body": "I grew up in the same area as the Farrow family, and let me tell you, it was kind of an open secret in town that she was abusing her kids. The whole family’s fucked up. Personally, I don’t think there’s a way to know who did what to who, so I err on the side of staying silent generally.", "created_utc": "1648427212.0", "edited": "False", "id": "i2dn5gl", "is_submitter": "False", "link_id": "t3_tpqqix", "parent_id": "t1_i2dkaja", "score": "12", "subreddit": "Fantasy", "subreddit_id": "t5_2qknd"}, {"author": "LightheartMusic", "body": "Judas origin story", "created_utc": "1648361179.0", "edited": "False", "id": "i2a947u", "is_submitter": "False", "link_id": "t3_toz0z3", "parent_id": "t1_i28f56p", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "LightheartMusic", "body": "I do not feel well", "created_utc": "1648361071.0", "edited": "False", "id": "i2a8z7d", "is_submitter": "False", "link_id": "t3_toz0z3", "parent_id": "t1_i284qr3", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "LightheartMusic", "body": "Fr tho. This is a key piece of information my ex could have used. The number of times I had to physical stop and reset because of how quickly and severely she’d gone out of phase is kind of embarrassing…", "created_utc": "1648360670.0", "edited": "False", "id": "i2a8ghk", "is_submitter": "False", "link_id": "t3_toz0z3", "parent_id": "t1_i2a297g", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "LightheartMusic", "body": "Technically there was the apex to mark vowel length…\n\nNo yeah but obviously no writing system perfectly captures a spoken language. Not even Hangul which gets so much hype for being the worlds best writing system or something", "created_utc": "1648319509.0", "edited": "False", "id": "i27zf32", "is_submitter": "False", "link_id": "t3_tooxn8", "parent_id": "t1_i27yuoh", "score": "9", "subreddit": "linguisticshumor", "subreddit_id": "t5_2vwiq"}, {"author": "LightheartMusic", "body": "I’d ask someone if you could record them making the sound and then listen to it a lot and practice it. Maybe post it somewhere where you can get information on how to articulate it.", "created_utc": "1648319223.0", "edited": "False", "id": "i27yrq4", "is_submitter": "False", "link_id": "t3_tojwz1", "parent_id": "t1_i26fj3q", "score": "9", "subreddit": "linguistics", "subreddit_id": "t5_2qhos"}, {"author": "LightheartMusic", "body": "It’s almost as if it was meant for Latin or something", "created_utc": "1648318902.0", "edited": "False", "id": "i27y1jh", "is_submitter": "False", "link_id": "t3_tooxn8", "parent_id": "t1_i270cpf", "score": "9", "subreddit": "linguisticshumor", "subreddit_id": "t5_2vwiq"}, {"author": "LightheartMusic", "body": "It sounds like you’re more passionate about Spanish and Portuguese. Are there other considerations for you? Like work opportunities or family connections?", "created_utc": "1648229559.0", "edited": "False", "id": "i239ua1", "is_submitter": "False", "link_id": "t3_tnmh7c", "parent_id": "t3_tnmh7c", "score": "1", "subreddit": "thisorthatlanguage", "subreddit_id": "t5_4inj8f"}, {"author": "LightheartMusic", "body": "What book mentioned above??", "created_utc": "1648167608.0", "edited": "False", "id": "i203xbm", "is_submitter": "False", "link_id": "t3_tn7m2m", "parent_id": "t3_tn7m2m", "score": "2", "subreddit": "learnfrench", "subreddit_id": "t5_2sucz"}, {"author": "LightheartMusic", "body": "Sens Critque maybe. It’s like a mix of rotten tomatoes and good reads for books, movies and video games.\n\nEdit: I see you’re also looking for news. I’ll have to think.", "created_utc": "1648132638.0", "edited": "False", "id": "i1xonku", "is_submitter": "False", "link_id": "t3_tmbogi", "parent_id": "t3_tmbogi", "score": "1", "subreddit": "learnfrench", "subreddit_id": "t5_2sucz"}, {"author": "LightheartMusic", "body": "Sounds like you need to look for some slow/easy podcasts or radio shows in Dutch aimed at learners. Something equivalent to “news in slow French” or RFI’s “journal en français facile.” I would be shocked if there wasn’t something like that for learners of Dutch. If you don’t see anything like that, just read a lot in Dutch and then listen to a lot of Dutch and you’ll be fine. Practice practice practice.\n\nEdit: \nWell if you just started a week ago, do not fret lol. Just focus on developing your vocabulary, and reading things at your level.", "created_utc": "1648094808.0", "edited": "False", "id": "i1w2w1g", "is_submitter": "False", "link_id": "t3_tlwahs", "parent_id": "t3_tlwahs", "score": "6", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "LightheartMusic", "body": "The trope of linear technology in fantasy and sci-fi today feels very much like it was inspired by Civ or something.", "created_utc": "1648077467.0", "edited": "False", "id": "i1v1vpg", "is_submitter": "False", "link_id": "t3_tl8rdt", "parent_id": "t1_i1ue9ye", "score": "3", "subreddit": "worldbuilding", "subreddit_id": "t5_2rd6n"}, {"author": "LightheartMusic", "body": "u/tomatoswoop pointed out that the use of “for” comes off as very Romance language oriented. I’d like to point out that “some” also feels like it comes out of something like maybe the partitive article in French, rather than something from English. We don’t need to introduce nouns in this kind of situation (although you can). For example: “I eat burritos every week”, not “I eat some burritos every week.” I don’t know if that’s helpful.", "created_utc": "1647839438.0", "edited": "False", "id": "i1hvse8", "is_submitter": "False", "link_id": "t3_tipnt7", "parent_id": "t3_tipnt7", "score": "2", "subreddit": "grammar", "subreddit_id": "t5_2qhwy"}, {"author": "LightheartMusic", "body": "Don’t forget, octaves below what we can hear still effect the sounds we do hear, which is especially relevant if you’re programming a synth.", "created_utc": "1647584125.0", "edited": "False", "id": "i14f17l", "is_submitter": "False", "link_id": "t3_tgt6tt", "parent_id": "t1_i1465lw", "score": "31", "subreddit": "musictheory", "subreddit_id": "t5_2qrjj"}, {"author": "LightheartMusic", "body": "Always a peeve of mine when people do that", "created_utc": "1647583967.0", "edited": "False", "id": "i14etsi", "is_submitter": "False", "link_id": "t3_tglnlx", "parent_id": "t1_i13phob", "score": "8", "subreddit": "linguisticshumor", "subreddit_id": "t5_2vwiq"}, {"author": "LightheartMusic", "body": "r/thisorthatlanguage\n\nI guess I’d choose whichever complements your schoolwork best, if you want to learn all these languages equally.", "created_utc": "1647536471.0", "edited": "False", "id": "i11gfzb", "is_submitter": "False", "link_id": "t3_tgd0ig", "parent_id": "t3_tgd0ig", "score": "6", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "LightheartMusic", "body": "This is definitely a good way to think about it, and an explanation I’ve seen more than once. \n\nFor quantity words, I tend to think of them as integrated units, it’s not beaucoup, it’s beaucoup de, not trop, but trop de.", "created_utc": "1647532134.0", "edited": "False", "id": "i1153en", "is_submitter": "False", "link_id": "t3_tg95rt", "parent_id": "t1_i10jach", "score": "21", "subreddit": "learnfrench", "subreddit_id": "t5_2sucz"}, {"author": "LightheartMusic", "body": "With most words that express quantity, eg trop, beaucoup, and so on, you do not use an article, so you just use «de ». \n\n«J’ai beaucoup de temps », «il y a trop de bruit », \n\nExceptions: «la plupart », «la majorité », «la minorité »\n\n«il est triste la plupart du jour»\n\nWhen talking about the weather, food, a certain amount of some material, or uncountable nouns, it is common to use what is called the “partitive article.” These are: «du », «de l’ », «de la », and «des ». A really common structure for talking about the weather is using il y a + partitive + weather. For example: «il y a du vent », «il y a de la pluie », «il y a du verglas ».", "created_utc": "1647521150.0", "edited": "1647521464.0", "id": "i10fta6", "is_submitter": "False", "link_id": "t3_tg95rt", "parent_id": "t3_tg95rt", "score": "93", "subreddit": "learnfrench", "subreddit_id": "t5_2sucz"}, {"author": "LightheartMusic", "body": "Indeed. Cf French’s “rameau,” meaning “twig, or small branch.” I’m not sure what cognates there are in other Romance languages, but I’m sure they exist.\n\nEdit: according to wiktionary, a lot. Pretty good indicator to me that it was a common word in Latin.", "created_utc": "1647487322.0", "edited": "False", "id": "i0z34lh", "is_submitter": "False", "link_id": "t3_tfu3ng", "parent_id": "t1_i0ykvw1", "score": "5", "subreddit": "conlangs", "subreddit_id": "t5_2red7"}, {"author": "LightheartMusic", "body": "Counterpoint: more expensive clothes tend to be more durable (if you’re not just buy for the name brand) which means you have to buy fewer clothes over all. I have an expensive pair of work boots that I’ve been using for around a decade now.", "created_utc": "1647470782.0", "edited": "False", "id": "i0y2jj6", "is_submitter": "False", "link_id": "t3_tfmkvc", "parent_id": "t1_i0x28ez", "score": "3", "subreddit": "howtonotgiveafuck", "subreddit_id": "t5_2tna8"}, {"author": "LightheartMusic", "body": "I was having this feeling too, recently. It got better when I recently decided on a specific goal (to take, and score well on an exam), and when I found things in my target language that I liked beyond studying, but that I wouldn’t have had access to without knowing the language. Try engaging with books/movies/videos you like, and not because you feel the need to study. And don’t forget, you can always come back to English if you want to study it more. I took a year and a half break from French while I focused on obtaining my diploma..\n\nWhat are your personal goals? Knowing that would help us give you better advice.", "created_utc": "1647465804.0", "edited": "False", "id": "i0xq0vo", "is_submitter": "False", "link_id": "t3_tfn8gn", "parent_id": "t3_tfn8gn", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "LightheartMusic", "body": "She’s just using this as an opportunity to fuck with you. I doubt she even really cares, and just likes to control others. Get out, and make sure she doesn’t try to get revenge on you for leaving . I’ve seen some scary shit out there man.", "created_utc": "1647445560.0", "edited": "False", "id": "i0wb4b5", "is_submitter": "False", "link_id": "t3_tff7n9", "parent_id": "t3_tff7n9", "score": "2", "subreddit": "NoFap", "subreddit_id": "t5_2skrn"}, {"author": "LightheartMusic", "body": "Depending on how much money you have, you might wish to consider hiring a tutor on some platform like italki. After you get to a certain level, say a2 / b1 you might want to do language exchange. I think I’ve heard good things about hellotalk in that regard. I don’t know how feasible this would be on a smartphone however. Does the military you’re with have any language programs, or pay for language classes? I know some do.\n\nAnd don’t forget to set a clear goal!! Mine is to receive a strong B2 on the DELF this June.", "created_utc": "1647445202.0", "edited": "1647445385.0", "id": "i0wa8kh", "is_submitter": "False", "link_id": "t3_tfi01a", "parent_id": "t3_tfi01a", "score": "2", "subreddit": "learnfrench", "subreddit_id": "t5_2sucz"}, {"author": "LightheartMusic", "body": "You’d think, but if we look at how shit the rest of the Russian military is, why should we assume that their intelligence is any better??", "created_utc": "1647444974.0", "edited": "False", "id": "i0w9o30", "is_submitter": "False", "link_id": "t3_tf4076", "parent_id": "t1_i0var2r", "score": "1", "subreddit": "UkraineUnderAttack", "subreddit_id": "t5_5xyyt9"}, {"author": "LightheartMusic", "body": "Smh", "created_utc": "1647400924.0", "edited": "False", "id": "i0u9tns", "is_submitter": "False", "link_id": "t3_tf41j5", "parent_id": "t1_i0tndvs", "score": "1", "subreddit": "germany", "subreddit_id": "t5_2qi4z"}, {"author": "LightheartMusic", "body": "Hey maybe don’t post stuff like this, maybe, like, don’t tell people the movement of weaponry during a war??", "created_utc": "1647400884.0", "edited": "False", "id": "i0u9qm6", "is_submitter": "False", "link_id": "t3_tf4076", "parent_id": "t3_tf4076", "score": "5", "subreddit": "UkraineUnderAttack", "subreddit_id": "t5_5xyyt9"}, {"author": "LightheartMusic", "body": "I don’t think Marcus Aurelius was big into redlining.", "created_utc": "1647378284.0", "edited": "False", "id": "i0st3r4", "is_submitter": "False", "link_id": "t3_tevefj", "parent_id": "t3_tevefj", "score": "1", "subreddit": "Stoicism", "subreddit_id": "t5_2r4kq"}, {"author": "LightheartMusic", "body": "I use it to describe people who use other people’s tragedies as a kind of performance art.  As a way to moralize and make themselves look better, when in reality they are doing the same kinds of things they criticize other people for doing. I think genuine, thoughtful activism is extremely important. I think aggressive moralizing is not.", "created_utc": "1647378133.0", "edited": "False", "id": "i0sspo5", "is_submitter": "False", "link_id": "t3_tevefj", "parent_id": "t1_i0sbpzy", "score": "2", "subreddit": "Stoicism", "subreddit_id": "t5_2r4kq"}, {"author": "LightheartMusic", "body": "Well, if you’re mom’s learning the same language, and your grandpas from there, why not learn together?? It would be a great kind of family activity and might encourage you both to work harder", "created_utc": "1647377438.0", "edited": "False", "id": "i0sqw5j", "is_submitter": "False", "link_id": "t3_teskme", "parent_id": "t1_i0s5qyg", "score": "9", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "LightheartMusic", "body": "Minoudomme? Idk. Either way I hate it, thanks 😅\n\nÉdit:\nculinou would probably be closer. You’d probably have to check le Dictionnaire de Sade to be sure though, as it’s sort of the authority on this kind of thing.", "created_utc": "1647237966.0", "edited": "1647238178.0", "id": "i0l4xp5", "is_submitter": "False", "link_id": "t3_tdmy6s", "parent_id": "t3_tdmy6s", "score": "10", "subreddit": "French", "subreddit_id": "t5_2rd5t"}, {"author": "LightheartMusic", "body": "So! A bit more than a week has passed, and I think I have a slightly clearer picture now. It is comparable to German in difficulty, and a not insignificant amount of the vocabulary is recognizably cognate, like \"sestra\" and \"sister.\" It is more difficult than German grammar-wise however. I haven't delved too deeply into the grammar but I think its case system is similar to Latin's.\n\nI am still mixing up certain letters. I often read **б** as /v/ instead of /b/, **в** as /b/ instead of /v/, **з** as /ʒ/ instead of /z/, and most often **р** as /p/ instead of /r/. I also sometimes mix up **и** and **н;** and **п** and **л**. These errors are decreasing the more I practice reading.\n\nWithout the feedback of a teacher I'm sure there are lot's of bad habits I'm picking up in terms of pronunciation but I'm just going to focus on building vocabulary and basic grammar.\n\nOverall, I'd say the thing making it most difficult to progress is the alphabet slowing down my ability to read and recall words.\n\nI hope you found that useful!", "created_utc": "1647209368.0", "edited": "False", "id": "i0jllr4", "is_submitter": "False", "link_id": "t3_t6uz98", "parent_id": "t1_hzeob85", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "LightheartMusic", "body": "I have, more than once, changed when the new day starts in Anki settings so I can save my streak.", "created_utc": "1647144513.0", "edited": "False", "id": "i0gcuh8", "is_submitter": "False", "link_id": "t3_tcogp3", "parent_id": "t3_tcogp3", "score": "3", "subreddit": "Anki", "subreddit_id": "t5_2s9lm"}, {"author": "LightheartMusic", "body": "If you’re spending potentially almost half a year there, I would say you should either study Hungarian or if you’re really not into it, then a popular second language there. I know a lot of Hungarians know German in order to communicate with the German tourists. \n\nI love French. It’s a great language. It has some things in common with Portuguese and Spanish, so they could help you there. \n\nI’m currently trying to learn Ukrainian because I may end up going with an NGO to help with the refugee crisis (the organization, funnily enough, wants to send me to Hungary). It has surprising similarities with English and other European languages. And it’s always fun to learn a new alphabet.", "created_utc": "1647144384.0", "edited": "False", "id": "i0gcmad", "is_submitter": "False", "link_id": "t3_tcvfn1", "parent_id": "t3_tcvfn1", "score": "5", "subreddit": "thisorthatlanguage", "subreddit_id": "t5_4inj8f"}, {"author": "LightheartMusic", "body": "Referents I think might be the word you’re looking for. Words like “this,” “that,” and “it” which refer to a previous topic, but may not actually be evident.", "created_utc": "1647143937.0", "edited": "False", "id": "i0gbtog", "is_submitter": "False", "link_id": "t3_tcojli", "parent_id": "t1_i0ey5fe", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "LightheartMusic", "body": "J’habite aux Tats-Unis. Je n’ai jamais entendu cette blague sauf sur internet. Le vrai cliché c’est que tous les rançais mangent pas mal de jambe de grenouille…", "created_utc": "1647092180.0", "edited": "False", "id": "i0d7tr9", "is_submitter": "False", "link_id": "t3_tcdxzy", "parent_id": "t1_i0d34e4", "score": "12", "subreddit": "rance", "subreddit_id": "t5_2um6i"}, {"author": "LightheartMusic", "body": "Is modern that mountain in Switzerland in the canton of Wallis? I was just reading about it today", "created_utc": "1646864635.0", "edited": "False", "id": "i014nak", "is_submitter": "False", "link_id": "t3_t9rhmx", "parent_id": "t3_t9rhmx", "score": "1", "subreddit": "thomastheplankengine", "subreddit_id": "t5_qgmfr"}, {"author": "LightheartMusic", "body": "Hi Oleksandr, I’m so sorry about what is going on in your country. I hope that you and your family are safe. If you are on italki, would you be able to link me your page?", "created_utc": "1646863378.0", "edited": "False", "id": "i011g1h", "is_submitter": "False", "link_id": "t3_t69p50", "parent_id": "t1_hzhg6t4", "score": "2", "subreddit": "Ukrainian", "subreddit_id": "t5_2qum6"}, {"author": "LightheartMusic", "body": "For the Swiss flag, is that Swiss German or is it Romansh?", "created_utc": "1646858234.0", "edited": "False", "id": "i00nty0", "is_submitter": "False", "link_id": "t3_taf5w0", "parent_id": "t1_i00ifyw", "score": "5", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "LightheartMusic", "body": "No, I was saying that I have no idea how LingQ would parse written Chinese, seeing as Chinese has things in common with how Japanese is written.", "created_utc": "1646838972.0", "edited": "False", "id": "hzzas76", "is_submitter": "False", "link_id": "t3_t6uz98", "parent_id": "t1_hzxx19d", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "LightheartMusic", "body": "I don’t think that matters too much. But if you still feel insecure about your accent, you can always try shadowing a person who accent you like, and try to sound more like them.", "created_utc": "1646699528.0", "edited": "False", "id": "hzry0xi", "is_submitter": "False", "link_id": "t3_t9272o", "parent_id": "t1_hzrtpez", "score": "15", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "LightheartMusic", "body": "This could also act as motivation to face the villain. If the powers given to the MC have some terrible side effect, maybe the villain has the antidote/thing that can negate the bad effects. Now he has to defeat the villain in order to save himself, not just to help other people.", "created_utc": "1646686815.0", "edited": "False", "id": "hzr32vw", "is_submitter": "False", "link_id": "t3_t8wtfg", "parent_id": "t1_hzqpigk", "score": "1", "subreddit": "fantasywriters", "subreddit_id": "t5_2t4ad"}, {"author": "LightheartMusic", "body": "You have talked about various things that I see as being intrinsically internal issues, which is what I was responding to. I don’t really disagree with your criticisms of the US, nor do I want to smear India. I’m trying to make a point that it’s disingenuous to paint the US as some kind of monolithic monster when that’s clearly not the case. When there’s no country that’s innocent. When you can likely count on your hands the number of countries today that haven’t committed genocides. \n\nI’m not really interested in continuing this somewhat needless argument, if that’s alright.", "created_utc": "1646640639.0", "edited": "False", "id": "hzoiywv", "is_submitter": "False", "link_id": "t3_t8imu0", "parent_id": "t1_hzohlnk", "score": "1", "subreddit": "worldnews", "subreddit_id": "t5_2qh13"}, {"author": "LightheartMusic", "body": "I wasn’t the one you were replying to so I didn’t feel the need to respond to the rest. I know America isn’t innocent. I want America to do better. There is a lot to improve.  \n\nBut if you want to go down this road, okay. \n\nIndia is not so clean. Modi is one step removed from being a dictator, his open hatred of Muslims and legal discrimination against them is akin to the treatment of Jews in Nazi Germany. Thousands driven from their homes, forced to live in ghettos. And that’s not to mention the thousands that have died because he  encourages violence against Muslims. These are his subjects, the people he is supposed to take care of. \n\nNo country is innocent. We can all do better. Why not start now?", "created_utc": "1646639014.0", "edited": "1646639230.0", "id": "hzogxdk", "is_submitter": "False", "link_id": "t3_t8imu0", "parent_id": "t1_hzofgng", "score": "0", "subreddit": "worldnews", "subreddit_id": "t5_2qh13"}, {"author": "LightheartMusic", "body": "It is, of course, shameful what’s been done by the US. What’s an even greater shame, in this moment, is the unwillingness to look at human suffering and say that it’s wrong and needs to be stopped. Actually look at the bloodied bodies in the street of families fleeing. Now tell me it’s okay for Putin to threaten nuclear war so he can keep doing that.\n\nI couldn’t help my friends in Afghanistan. I’m trying my best to help the people I know in Ukraine. All we can do is our best. Please don’t use this tragedy as a way to soapbox. It’s small minded, cruel, and ultimately short-sighted. Any one of us could be next.", "created_utc": "1646638275.0", "edited": "False", "id": "hzofz7n", "is_submitter": "False", "link_id": "t3_t8imu0", "parent_id": "t1_hzofbq4", "score": "-2", "subreddit": "worldnews", "subreddit_id": "t5_2qh13"}, {"author": "LightheartMusic", "body": "I mean, say what you will but the US isn’t threatening to use nuclear weapons if other countries don’t let us murder children. That’s the, uh, key difference here.", "created_utc": "1646637614.0", "edited": "False", "id": "hzof45k", "is_submitter": "False", "link_id": "t3_t8imu0", "parent_id": "t1_hzoe7l8", "score": "0", "subreddit": "worldnews", "subreddit_id": "t5_2qh13"}, {"author": "LightheartMusic", "body": "Uhh, the US is not in charge of the Nobel Prizes. That would be Norway.", "created_utc": "1646637466.0", "edited": "False", "id": "hzoewyc", "is_submitter": "False", "link_id": "t3_t8imu0", "parent_id": "t1_hzodtl9", "score": "5", "subreddit": "worldnews", "subreddit_id": "t5_2qh13"}, {"author": "LightheartMusic", "body": "It was a French prof a couple years ago telling me the difference between beaucoup and “beau cul” that really, REALLY motivated me to learn how to separate those two sounds. I’m still not great at it, but I am much better at it.", "created_utc": "1646633780.0", "edited": "False", "id": "hzo9tjn", "is_submitter": "False", "link_id": "t3_t8gs3g", "parent_id": "t1_hzo2stq", "score": "7", "subreddit": "learnfrench", "subreddit_id": "t5_2sucz"}, {"author": "LightheartMusic", "body": "I’m pretty sure the JW’s have a huge library of foreign language bibles on their website for free. At least I think that’s who I’m thinking of.", "created_utc": "1646607097.0", "edited": "False", "id": "hzmsylq", "is_submitter": "False", "link_id": "t3_t87u3q", "parent_id": "t3_t87u3q", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "LightheartMusic", "body": "I think block in this instance refers to a block of uncut jade, although I’d have to open up my copy of the daodejing", "created_utc": "1646604274.0", "edited": "False", "id": "hzmmibi", "is_submitter": "False", "link_id": "t3_t7rvu7", "parent_id": "t1_hzmh55t", "score": "17", "subreddit": "books", "subreddit_id": "t5_2qh4i"}, {"author": "LightheartMusic", "body": "I would imagine it has something to do with the idea that most people who get married are expected to have kids. Still seems kind of fucked up to me, but I do appreciate anything that helps makes raising children easier.\n\nI was definitely happy to see that my state does not allow this practice lol", "created_utc": "1646492455.0", "edited": "False", "id": "hzgh91h", "is_submitter": "False", "link_id": "t3_t6oa1c", "parent_id": "t1_hzerc56", "score": "2", "subreddit": "Unexpected", "subreddit_id": "t5_2w67q"}, {"author": "LightheartMusic", "body": "I use PayPal through Italki, so there’s an extra layer of security.", "created_utc": "1646490500.0", "edited": "False", "id": "hzgdaxb", "is_submitter": "False", "link_id": "t3_t78z3v", "parent_id": "t3_t78z3v", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "LightheartMusic", "body": "Definitely this! Over the past few days I’ve found about 2-3 words per piece of content that don’t have definitions. I don’t know any good Ukrainian dictionaries so I just put a question mark on those ones lol.", "created_utc": "1646489196.0", "edited": "False", "id": "hzgat3z", "is_submitter": "False", "link_id": "t3_t6uz98", "parent_id": "t1_hzez7zf", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "LightheartMusic", "body": "I’ll check it out, thanks for the recommendation!", "created_utc": "1646489048.0", "edited": "False", "id": "hzgaixv", "is_submitter": "False", "link_id": "t3_t6uz98", "parent_id": "t1_hzfxqbp", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "LightheartMusic", "body": "2 out of our 4 past president have been absolute floor-scraping morons. If you don’t think there’s a stupidity problem in American governance I don’t know what to say. American people generally don’t want to be involved in foreign wars. It’s the greed and incompetence of the people at the top. I think LBJ is a great example, he actually thought the US was winning in Vietnam and that he was in the moral right. Neither was true, and they were so obviously untrue that it’s hard to believe the war went on as long as it did.\n\nObviously this doesn’t excuse our terrible behavior, but it’s kind of pathetic to act like all Americans are cartoonishly evil, and it’s disingenuous to pretend that other country don’t do the exact same things. And clearly plenty of other countries often agree with us, otherwise they wouldn’t send their troops to fight and die in the conflicts we send our troops into.  \n\nHopefully we’ll someday get our shit together, because as it is now, I’m planning to move to one of the other two countries where I have citizenship. There is something wrong going on here, and everyone knows it.", "created_utc": "1646488023.0", "edited": "1646488753.0", "id": "hzg8n74", "is_submitter": "False", "link_id": "t3_t6rdgh", "parent_id": "t1_hzfmwau", "score": "2", "subreddit": "germany", "subreddit_id": "t5_2qi4z"}, {"author": "LightheartMusic", "body": "Oof", "created_utc": "1646458900.0", "edited": "False", "id": "hzf3xqo", "is_submitter": "False", "link_id": "t3_t7246m", "parent_id": "t3_t7246m", "score": "13", "subreddit": "linguisticshumor", "subreddit_id": "t5_2vwiq"}, {"author": "LightheartMusic", "body": "This is a great idea! I was thinking of using italki to pay people and maybe give big tips through PayPal. I’m trying to figure out how to get money to people directly in addition to charities.", "created_utc": "1646456939.0", "edited": "False", "id": "hzf0iy1", "is_submitter": "False", "link_id": "t3_t69p50", "parent_id": "t3_t69p50", "score": "2", "subreddit": "Ukrainian", "subreddit_id": "t5_2qum6"}, {"author": "LightheartMusic", "body": "Doesn’t have anything to do with the 80% drop in hospitalizations or anything. /s", "created_utc": "1646456781.0", "edited": "False", "id": "hzf08mu", "is_submitter": "False", "link_id": "t3_t69p50", "parent_id": "t1_hzeku2j", "score": "1", "subreddit": "Ukrainian", "subreddit_id": "t5_2qum6"}, {"author": "LightheartMusic", "body": "Fdp", "created_utc": "1646456652.0", "edited": "False", "id": "hzezzys", "is_submitter": "False", "link_id": "t3_t69p50", "parent_id": "t1_hzeku2j", "score": "1", "subreddit": "Ukrainian", "subreddit_id": "t5_2qum6"}, {"author": "LightheartMusic", "body": "It's also got a website here: [https://www.lingq.com/](https://www.lingq.com/)\n\nAt a glance it seems to have has all the official languages in Western Europe, the primary Scandinavian languages, quite a few Eastern European languages, Arabic, Hebrew, several East Asian languages, a couple of Indian languages, and a few others. \n\nUnfortunately, I don't see any Native American languages, nor Indigenous languages of any other region.", "created_utc": "1646454008.0", "edited": "False", "id": "hzeuz2g", "is_submitter": "False", "link_id": "t3_t6uz98", "parent_id": "t1_hzeqwzv", "score": "13", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "LightheartMusic", "body": "I know people have had success using LingQ for Japanese, and since it's been I while since I used it for Japanese, and they've just revamped the site, it's definitely possible they've fixed the issues I've had with it.\n\nFor me, the thing I find most attractive about LingQ is how you can instantly get a definition for a word as you're reading, and how it automatically keeps track of what you know and what you don't know.\n\nIt's harder to do this with Japanese because of how it's written. It isn't easy for LingQ to parse sentences written in Japanese. Probably because Japanese uses logograms and lacks spaces between words, so the word boundaries are not obvious, and so LingQ sometimes thinks that two words next to each other are one word. Or sometimes it thinks that the ending of a verb is actually some other word. So when that happens, and it's no longer automatic, you have to select the words manually and choose the best definition. The joy of reading through a text relatively easily disappears, and I find it to be an exercise in frustration, as sometimes *I'm* not sure what the right word is.\n\nI think maybe it's such a bother because I know how effective and fun LingQ can be at its best, so when it fails to live up the standard that it itself has set, it seems harder than it should be, and then it makes me feel stupid for not having the same fluidity I have with, say, French.\n\nJeez, that was a lot wordage.\n\n&#x200B;\n\nEdit:\n\nI think this applies to u/Akash_Aziz 's comment as well.", "created_utc": "1646453497.0", "edited": "False", "id": "hzetz7w", "is_submitter": "False", "link_id": "t3_t6uz98", "parent_id": "t1_hzeruwg", "score": "18", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "LightheartMusic", "body": "That’s a good question!", "created_utc": "1646451689.0", "edited": "False", "id": "hzeqcft", "is_submitter": "False", "link_id": "t3_t6uz98", "parent_id": "t1_hzeo28t", "score": "6", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "LightheartMusic", "body": "Well, I’ve been trying it out for the past couple of days, so I can’t yet give an accurate review. It’s definitely harder than Italian or German, but that’s likely because I don’t know Cyrillic yet. (Like, I’ve spent two days on it with duo, so I’ve got got a vague sense of what most of the letters sound like by themselves.) \nI’ll have a better picture in a week. I can say it’s way way easier than Japanese tho lol.", "created_utc": "1646451604.0", "edited": "False", "id": "hzeq66l", "is_submitter": "False", "link_id": "t3_t6uz98", "parent_id": "t1_hzeob85", "score": "5", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "LightheartMusic", "body": "This. Getting better a math could me literally anything, and it’s so so easy to lose your determination without a clear goal to work towards.", "created_utc": "1646448887.0", "edited": "False", "id": "hzekhhz", "is_submitter": "False", "link_id": "t3_t6x3zh", "parent_id": "t1_hze82pv", "score": "3", "subreddit": "learnmath", "subreddit_id": "t5_2rdi4"}, {"author": "LightheartMusic", "body": "What I did is I picked a goal (develop my math so I could do well on the GRE) then I hired a local, professional math tutor, and we met once a week using khan academy as the guide. During the week before we would meet, I would go as far as I could through the section we were in on KA. Then once we met, we would go over what I needed help with, and then we’d focus on what he thought was most critical for me. I have noticed a huge boost in how I score on the practice tests. \n\nSo first, idk, pick a reason why, and maybe find someone to help you. Khan academy is great, but not by itself.\n\nAnd kumon is not a great choice no lol.", "created_utc": "1646448768.0", "edited": "False", "id": "hzek85n", "is_submitter": "False", "link_id": "t3_t6x3zh", "parent_id": "t3_t6x3zh", "score": "5", "subreddit": "learnmath", "subreddit_id": "t5_2rdi4"}, {"author": "LightheartMusic", "body": "Thanks for sharing this! I wanted to find someway to spread the news but I couldn’t think of an appropriate place to do so 🤪.", "created_utc": "1646448348.0", "edited": "False", "id": "hzejbjq", "is_submitter": "False", "link_id": "t3_t6uz98", "parent_id": "t3_t6uz98", "score": "4", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "LightheartMusic", "body": "It’s really good for Western European languages, like French, German, Italian etc. I find it agonizing to use with Japanese, and I have no idea what it would be like with something like Arabic or Mandarin. That said, it is one of my favorite tools.", "created_utc": "1646448254.0", "edited": "False", "id": "hzej45y", "is_submitter": "False", "link_id": "t3_t6uz98", "parent_id": "t1_hzdy8yz", "score": "15", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "LightheartMusic", "body": "I guess if people want to try it out, they can get the full experience with Ukrainian for free. Unfortunately, it is a lot harder to find reading material in Ukrainian as opposed to, say, French, so not quite the same.", "created_utc": "1646448141.0", "edited": "False", "id": "hzeiv8t", "is_submitter": "False", "link_id": "t3_t6uz98", "parent_id": "t1_hze8snm", "score": "13", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "LightheartMusic", "body": "r/thisorthatlanguage", "created_utc": "1646442696.0", "edited": "False", "id": "hze6ry5", "is_submitter": "False", "link_id": "t3_t6v7mx", "parent_id": "t3_t6v7mx", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "LightheartMusic", "body": "To be fair, a lot of that is just us not knowing what we’re doing and being kind of incompetent, not outright malice. (Not in every case obviously, viz. Nicaragua). I think we often genuinely want to help, and somehow our “help” often becomes “murder everything” instead of like, idk, “invest in their economy and raise their standard of living.”", "created_utc": "1646435353.0", "edited": "False", "id": "hzdpulc", "is_submitter": "False", "link_id": "t3_t6rdgh", "parent_id": "t1_hzdbydj", "score": "1", "subreddit": "germany", "subreddit_id": "t5_2qi4z"}, {"author": "LightheartMusic", "body": "I know it’s almost like someone is participating in a community or something", "created_utc": "1646254822.0", "edited": "False", "id": "hz3kc0q", "is_submitter": "False", "link_id": "t3_t56mup", "parent_id": "t1_hz386er", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "LightheartMusic", "body": "I’m pretty sure people thought it was adorable whenever I used “puis-je.” Like, “aw, look at that guy talking like he’s ready to buy a ticket for a steam-powered locomotive and then sit down and enjoy the latest book by Victor Hugo while he waits at the station.”", "created_utc": "1646234484.0", "edited": "False", "id": "hz23jv4", "is_submitter": "False", "link_id": "t3_t4w0yl", "parent_id": "t1_hz12t08", "score": "4", "subreddit": "learnfrench", "subreddit_id": "t5_2sucz"}, {"author": "LightheartMusic", "body": "Ikr? It’s like we’ve already done the hard work of learning what things are in our native language, why would we ever reinvent the wheel? The only things we really need to pay attention to are the differences, like savoir vs connaître vs English’s know.", "created_utc": "1646183097.0", "edited": "False", "id": "hyzl1mi", "is_submitter": "False", "link_id": "t3_t46drw", "parent_id": "t1_hyx2d25", "score": "2", "subreddit": "French", "subreddit_id": "t5_2rd5t"}, {"author": "LightheartMusic", "body": "I think it would be more efficient to just memorize temperature equivalents and then just estimate. No way am I doing that in my head.", "created_utc": "1646025319.0", "edited": "False", "id": "hyqqpst", "is_submitter": "False", "link_id": "t3_t2o7vb", "parent_id": "t1_hyolefy", "score": "2", "subreddit": "musictheory", "subreddit_id": "t5_2qrjj"}, {"author": "LightheartMusic", "body": "I mean I think it’s pretty much 50/50. Metric for government regulated things like roads, and imperial for more personal things like body size, and often in cooking. Lots of “six feet apart” signs during this pandémic.", "created_utc": "1646025186.0", "edited": "False", "id": "hyqqha8", "is_submitter": "False", "link_id": "t3_t2o7vb", "parent_id": "t1_hyoisib", "score": "1", "subreddit": "musictheory", "subreddit_id": "t5_2qrjj"}, {"author": "LightheartMusic", "body": "I’m learning so many unfortunate things about my French pronunciation today", "created_utc": "1645859804.0", "edited": "False", "id": "hyhm62v", "is_submitter": "False", "link_id": "t3_t1hoy3", "parent_id": "t1_hyg5ec2", "score": "12", "subreddit": "linguistics", "subreddit_id": "t5_2qhos"}, {"author": "LightheartMusic", "body": "Damn I guess I’m gonna have to look at French phonology soon, I’ve definitely not been pronouncing some of that stuff right", "created_utc": "1645859588.0", "edited": "False", "id": "hyhlv58", "is_submitter": "False", "link_id": "t3_t1hoy3", "parent_id": "t1_hyg9uon", "score": "3", "subreddit": "linguistics", "subreddit_id": "t5_2qhos"}, {"author": "LightheartMusic", "body": "I remember how when I was kid and tried to do anything sexual in a lucid dream I would instantly wake up. Not even kissing was allowed. Flying? Great. Transforming animals into other creatures? Fantastic. Cast magic and try access another dimension? Go for it. Instant I try to make a move on someone it was like I was suddenly rushing upwards into consciousness and there was nothing I could do to stop it. I guess it was just too unrealistic", "created_utc": "1645847261.0", "edited": "False", "id": "hyh0tr6", "is_submitter": "False", "link_id": "t3_t11tv7", "parent_id": "t1_hyfgr1a", "score": "10", "subreddit": "science", "subreddit_id": "t5_mouw"}, {"author": "LightheartMusic", "body": "Ah, ben, ma mère a toujours pensé que je suis très intelligent, tu sais.", "created_utc": "1645731644.0", "edited": "False", "id": "hya5zry", "is_submitter": "False", "link_id": "t3_t0ctrv", "parent_id": "t1_hya2gsk", "score": "3", "subreddit": "French", "subreddit_id": "t5_2rd5t"}, {"author": "LightheartMusic", "body": "Femme, je parie", "created_utc": "1645729747.0", "edited": "False", "id": "hya0xtd", "is_submitter": "False", "link_id": "t3_t0ctrv", "parent_id": "t1_hy8ybw7", "score": "4", "subreddit": "French", "subreddit_id": "t5_2rd5t"}, {"author": "LightheartMusic", "body": "It is a very good British accent. I can hear slight traces of something but only because I’m looking for it. Where are you from?", "created_utc": "1645685352.0", "edited": "False", "id": "hy7ktcu", "is_submitter": "False", "link_id": "t3_t00x82", "parent_id": "t3_t00x82", "score": "1", "subreddit": "JudgeMyAccent", "subreddit_id": "t5_2ufiq"}, {"author": "LightheartMusic", "body": "“Instant” and “what” sound off to me. Idk what accent you’re going for here but you need to add a “t” sound to the end of “instant” and for an American accent I would say “what” as /wʌt/ and I think for general British accent maybe pronounce it as /wɒt/. \n\nOn another listen through the L sound in the word “skill” sounds a little heavy as well.", "created_utc": "1645685076.0", "edited": "False", "id": "hy7kcua", "is_submitter": "False", "link_id": "t3_szvvr5", "parent_id": "t3_szvvr5", "score": "2", "subreddit": "JudgeMyAccent", "subreddit_id": "t5_2ufiq"}, {"author": "LightheartMusic", "body": "But pretty", "created_utc": "1645552830.0", "edited": "False", "id": "hxzp3rw", "is_submitter": "False", "link_id": "t3_syl867", "parent_id": "t1_hxzltkf", "score": "2", "subreddit": "worldbuilding", "subreddit_id": "t5_2rd6n"}, {"author": "LightheartMusic", "body": "While I’ve never befriended someone in order to date them, I do think a friendship is the best way to find if someone is trustworthy enough, and compatible enough, to be in a long-term relationship with. There are plenty of people I’m friends with who I could never date, and the only reason I know is because I’ve known them long enough to get a sense for who they truly are.", "created_utc": "1645513477.0", "edited": "False", "id": "hxxra0a", "is_submitter": "False", "link_id": "t3_sycyue", "parent_id": "t1_hxxjd12", "score": "1", "subreddit": "TrueOffMyChest", "subreddit_id": "t5_2yuqy"}, {"author": "LightheartMusic", "body": "If I knew my S/O didn’t respect me in the slightest and talked shit about me behind my back, I would break up in a heartbeat. There’s no saving relationships with liars or narcissists.", "created_utc": "1645500498.0", "edited": "False", "id": "hxx4yct", "is_submitter": "False", "link_id": "t3_se3mrh", "parent_id": "t1_huiphxs", "score": "1", "subreddit": "TrueOffMyChest", "subreddit_id": "t5_2yuqy"}, {"author": "LightheartMusic", "body": "Well, my French professor introduced iel to us in the introductory course, and even took some of the students to a lecture on iel and how it is/isn’t getting adopted by francophones, but iirc the non-binary students didn’t bother using it because the vast, vast majority of French speakers don’t use/know it. I personally think iel/iels is actually quite a pretty word, regardless of what anyone’s thoughts are on gender-neutral language. The fact that it’s a decent solution to ils vs elles beyond just using the rule of majority is a  major plus in my mind. \n\nBeyond iel, I would be hesitant to bring up gender neutral language because it’s just so rare. If they’re interested they’ll likely either ask you, or just look it up. \n\nHowever, if you ever get to composing letters/ emails, I would definitely show them how to write in a gender inclusive way. For example, one can write “the students” as «les étudiant.e.s».", "created_utc": "1645496561.0", "edited": "False", "id": "hxwwmzf", "is_submitter": "False", "link_id": "t3_sy29ky", "parent_id": "t3_sy29ky", "score": "5", "subreddit": "French", "subreddit_id": "t5_2rd5t"}, {"author": "LightheartMusic", "body": "Well, if we look at real life, the physical differences between ethnic and racial groups are often not very intense yet we can often still tell what groups a person may belong to. The Irish side of my family is clearly not from the same place as my Italian side for instance. It’s easy to tell apart, say, East Asians and your typical Western Europeans, and I wouldn’t say there’s any huge physical differences between them. Maybe the fox folk, for example, in your world tend to be shorter, with red hair and black beards or something. \n\nBut as you’ve said, you’ve given thought to this. \n\nThe more important point for me might be that it doesn’t really matter how their animalistic traits are expressed, what matters is how other people treat them. You could show an interaction between say, a human farmer, and a fox, uhh, detective(?) and have them treat each other like shit. Maybe the farmer calls the fox a chicken stealer, maybe foxes have some stereotype about how humans smell. Idk. Are there real world parallels like segregation, slavery, general shittiness?", "created_utc": "1645067431.0", "edited": "False", "id": "hx9g7z2", "is_submitter": "False", "link_id": "t3_sssxau", "parent_id": "t1_hx85xkh", "score": "2", "subreddit": "fantasywriters", "subreddit_id": "t5_2t4ad"}, {"author": "LightheartMusic", "body": "I don’t know why you’re getting downvoted, that’s solid advice lmao", "created_utc": "1644930785.0", "edited": "False", "id": "hx14ryt", "is_submitter": "False", "link_id": "t3_st0icx", "parent_id": "t1_hx10dz3", "score": "6", "subreddit": "ajatt", "subreddit_id": "t5_dw44m"}, {"author": "LightheartMusic", "body": "For the cat and fox races, have you considered not making it too obvious? Like maybe the cat people just have cat shaped eyes, or have whiskers, or it’s different for each person. I think what makes it too anime is when it’s just “massive furry ears and a tail” if you avoid going by that route, it should be different enough. Maybe make it more behavioral, so fox people would find mice irresistible and be fully willing to jump into the snow to pull them out and have a nice snack, but are otherwise indistinguishable from normal humans.", "created_utc": "1644905624.0", "edited": "False", "id": "hx06tz1", "is_submitter": "False", "link_id": "t3_sssxau", "parent_id": "t3_sssxau", "score": "3", "subreddit": "fantasywriters", "subreddit_id": "t5_2t4ad"}, {"author": "LightheartMusic", "body": "Bring it back. I love it", "created_utc": "1644904974.0", "edited": "False", "id": "hx05vh3", "is_submitter": "False", "link_id": "t3_sshhuo", "parent_id": "t1_hwy2hig", "score": "7", "subreddit": "linguisticshumor", "subreddit_id": "t5_2vwiq"}, {"author": "LightheartMusic", "body": "I’m sorry that I don’t have an answer for you, but have you considered that that could be a good thing? If your goal is to build the habit of using Anki every day, making it easier to actually pull that off is rarely a bad move.", "created_utc": "1644862329.0", "edited": "False", "id": "hwxp491", "is_submitter": "False", "link_id": "t3_ss5el3", "parent_id": "t3_ss5el3", "score": "1", "subreddit": "Anki", "subreddit_id": "t5_2s9lm"}, {"author": "LightheartMusic", "body": "Patriotism literally just means that you love your country. I love my country despite its massive flaws. I don’t think “all other countries are lesser.” I don’t love my government, I think it sucks. But I can still love my country and work toward it being a better place.\n\nBut yeah once someone talks about how patriotic they are and how much of a “real American” they are, it’s a red flag lmao.", "created_utc": "1644850972.0", "edited": "1644851214.0", "id": "hwwxrjo", "is_submitter": "False", "link_id": "t3_ss8b9z", "parent_id": "t1_hwwtdxh", "score": "1", "subreddit": "worldnews", "subreddit_id": "t5_2qh13"}, {"author": "LightheartMusic", "body": "Sign languages do have all the features of actual languages, so I think it would be only right.", "created_utc": "1644815319.0", "edited": "False", "id": "hwvienr", "is_submitter": "False", "link_id": "t3_srkbnf", "parent_id": "t1_hwvbvec", "score": "8", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "LightheartMusic", "body": "tf???\n\n>He dumped his Japanese girlfriend because she was, in his words, “too westernised”.\n\naka \"not submissive enough, displays too much free will, isn't a body pillow\"\n\n&#x200B;\n\nJesus.", "created_utc": "1644815081.0", "edited": "False", "id": "hwvi0tb", "is_submitter": "False", "link_id": "t3_srkbnf", "parent_id": "t1_hwsv07q", "score": "9", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "LightheartMusic", "body": "I’m sorry but that sounds insane. Way too many cards. Maybe an app that could help you summarize a book’s key points before you cloze it", "created_utc": "1644780967.0", "edited": "False", "id": "hwtcp5b", "is_submitter": "False", "link_id": "t3_sqxenp", "parent_id": "t1_hwp4f27", "score": "3", "subreddit": "Anki", "subreddit_id": "t5_2s9lm"}, {"author": "LightheartMusic", "body": "Yeah why not. I think it helps if you have a limited phonology that makes the borrowed word not instantly recognizable. Like (to use your example) if I borrowed “terra” into my conlang it would become “tala.” And then if I wanted to further separate it from its source word I’d give it a secondary meaning like “home” or something. A lot of my vocabulary is natlang borrowed or inspired.", "created_utc": "1644670636.0", "edited": "1644671414.0", "id": "hwn25ai", "is_submitter": "False", "link_id": "t3_sqhje2", "parent_id": "t3_sqhje2", "score": "2", "subreddit": "conlangs", "subreddit_id": "t5_2red7"}, {"author": "LightheartMusic", "body": "Isn’t that funny how that works? Spite can be a great motivator", "created_utc": "1644475945.0", "edited": "False", "id": "hwc6ben", "is_submitter": "False", "link_id": "t3_sovgwu", "parent_id": "t1_hwbzc14", "score": "14", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "LightheartMusic", "body": "I heard that saying a word or phrase in English in a conversation that is otherwise in Swedish is a way of indicating that what is being said is a joke.", "created_utc": "1644431085.0", "edited": "False", "id": "hw98wfa", "is_submitter": "False", "link_id": "t3_soeuh4", "parent_id": "t1_hw8xqc0", "score": "7", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "LightheartMusic", "body": "Okay cool! I guessed it was something like that, but I thought I should double check. I’m glad that declining doesn’t disable any major functionality. Thanks for the info!", "created_utc": "1644430888.0", "edited": "False", "id": "hw98d3a", "is_submitter": "False", "link_id": "t3_snyxct", "parent_id": "t1_hw8wcrx", "score": "1", "subreddit": "LearnJapanese", "subreddit_id": "t5_2qyls"}, {"author": "LightheartMusic", "body": "This got me to laugh.", "created_utc": "1644424681.0", "edited": "False", "id": "hw8rcng", "is_submitter": "False", "link_id": "t3_so6v64", "parent_id": "t1_hw7do47", "score": "6", "subreddit": "conlangs", "subreddit_id": "t5_2red7"}, {"author": "LightheartMusic", "body": "So I don't know where I should ask this, and I didn't see anyone else talking about it. Since a lot of you are tech savvy I thought I should ask here. Let me know .  \nDo I need to be concerned that right after I installed Migaku Dictionary, Anki asked to receive keystrokes even when I'm not using the application?  I don't distrust the team at Migaku but I really don't want to give potential keyloggers access to my computer.", "created_utc": "1644384792.0", "edited": "False", "id": "hw6tvbb", "is_submitter": "False", "link_id": "t3_snyxct", "parent_id": "t3_snyxct", "score": "2", "subreddit": "LearnJapanese", "subreddit_id": "t5_2qyls"}, {"author": "LightheartMusic", "body": "For the first I think it would help us to know what the consequences would be if she didn’t help him, and what will happen if they succeed. Why is she forced to help? Is the dude good or bad or what?", "created_utc": "1644380052.0", "edited": "False", "id": "hw6kkl9", "is_submitter": "False", "link_id": "t3_sny24c", "parent_id": "t1_hw67xit", "score": "2", "subreddit": "fantasywriters", "subreddit_id": "t5_2t4ad"}, {"author": "LightheartMusic", "body": "I have to wonder what rock did this person crawl out from under?? Like this would fit in pretty decently with 90s music probably idk.", "created_utc": "1644379815.0", "edited": "False", "id": "hw6k25v", "is_submitter": "False", "link_id": "t3_snpaff", "parent_id": "t1_hw5o95u", "score": "5", "subreddit": "GarageBand", "subreddit_id": "t5_2twyd"}, {"author": "LightheartMusic", "body": "For sure I’ve never liked that rule. Now I just use the rule of majority. If there are more men, I use ils, if more women, I use elles. If I don’t know I use what I feel is appropriate. Screw L’académie", "created_utc": "1644374121.0", "edited": "False", "id": "hw671dw", "is_submitter": "False", "link_id": "t3_snyacd", "parent_id": "t1_hw5zir8", "score": "-1", "subreddit": "conlangs", "subreddit_id": "t5_2red7"}, {"author": "LightheartMusic", "body": "I would be interested — given your background is it safe to assume it’s some kind of app?", "created_utc": "1644367464.0", "edited": "False", "id": "hw5rfa8", "is_submitter": "False", "link_id": "t3_snyk9w", "parent_id": "t3_snyk9w", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "LightheartMusic", "body": "Nope. Unless everyone is cool with getting rid of, like, Spanish or something I don’t think anyone could say that languages with grammatical genders / pronouns etc are “bad” without being either incredibly ignorant or massively hypocritical.", "created_utc": "1644366518.0", "edited": "False", "id": "hw5p74h", "is_submitter": "False", "link_id": "t3_snyacd", "parent_id": "t3_snyacd", "score": "11", "subreddit": "conlangs", "subreddit_id": "t5_2red7"}, {"author": "LightheartMusic", "body": "OP did say that there are also neutral pronouns, so I’m kind of leaning towards their friend being an ass. Also, who the hell talks that way to their friends, especially after that friend trusts you enough to share their art/passion/whatever?? It’s not that hard to be nice lmao", "created_utc": "1644366295.0", "edited": "False", "id": "hw5oocm", "is_submitter": "False", "link_id": "t3_snyacd", "parent_id": "t1_hw5iwjl", "score": "15", "subreddit": "conlangs", "subreddit_id": "t5_2red7"}, {"author": "LightheartMusic", "body": "I’m pretty sure that there’s a batch edit plugin for anki somewhere that could make that easier. Maybe something from migaku? I’d have to check", "created_utc": "1644349906.0", "edited": "False", "id": "hw4i6nk", "is_submitter": "False", "link_id": "t3_snc4bu", "parent_id": "t1_hw2o381", "score": "2", "subreddit": "LearnJapanese", "subreddit_id": "t5_2qyls"}, {"author": "LightheartMusic", "body": "I read a lot of British books when I was younger. I don’t ever have the “u” problem, but I definitely prefer writing “grey.” It looks way more pleasing to my eye.", "created_utc": "1644349150.0", "edited": "False", "id": "hw4g4tw", "is_submitter": "False", "link_id": "t3_sn4ovs", "parent_id": "t1_hw1al9w", "score": "2", "subreddit": "writing", "subreddit_id": "t5_2qh2n"}, {"author": "LightheartMusic", "body": "I could never get into Xiaoma because his titles make me feel dirty. Can’t work up the strength to click on a video.", "created_utc": "1644331343.0", "edited": "False", "id": "hw34fqa", "is_submitter": "False", "link_id": "t3_sn5isz", "parent_id": "t1_hw2x8oy", "score": "24", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "LightheartMusic", "body": "I just knew it was gonna be a Dogen video lmao", "created_utc": "1644331178.0", "edited": "False", "id": "hw341ys", "is_submitter": "False", "link_id": "t3_sn5isz", "parent_id": "t1_hw20mgx", "score": "8", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "LightheartMusic", "body": "Me too! I was hoping they might have Mi'kmaw, but I’m glad to that there’s any", "created_utc": "1644295859.0", "edited": "False", "id": "hw1lgrs", "is_submitter": "False", "link_id": "t3_sn6inc", "parent_id": "t1_hw1c3p3", "score": "5", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "LightheartMusic", "body": "I suppose I should have guessed if “ver” means “to bear!” \n\nWhat are you going to use Tholtic for? Just for conlanging or do you want to write something in it?", "created_utc": "1644003452.0", "edited": "False", "id": "hvloxsy", "is_submitter": "False", "link_id": "t3_sjswvx", "parent_id": "t1_hvjr9gm", "score": "2", "subreddit": "conlangs", "subreddit_id": "t5_2red7"}, {"author": "LightheartMusic", "body": "I like what I see. The conjugation table reminds me  quite a bit of Latin. The declension looks fairly unique but still clearly Indo-European. The phonology looks good - though I'm a little surprised at the lack of /f/ but it's probably a good idea to limit your inventory.", "created_utc": "1643941635.0", "edited": "False", "id": "hvib3ly", "is_submitter": "False", "link_id": "t3_sjswvx", "parent_id": "t3_sjswvx", "score": "6", "subreddit": "conlangs", "subreddit_id": "t5_2red7"}, {"author": "LightheartMusic", "body": "uh, /kʌm/, I guess\n\n&#x200B;\n\nedit:\n\nI see someone further up say we use /kʌm/ when talking about semen, and  /kum/ when we mean the preposition (inposition?). I personally have never heard anyone use  /kum/, even when using a Latin phrase like \"magna cum laude.\" Saying \"coom\" in English would sound a bit silly to me. Especially in order to *avoid* talking about semen, considering the memes haha.", "created_utc": "1643940558.0", "edited": "1643941148.0", "id": "hvi8nur", "is_submitter": "False", "link_id": "t3_sjijpy", "parent_id": "t1_hvhy0r9", "score": "7", "subreddit": "linguisticshumor", "subreddit_id": "t5_2vwiq"}, {"author": "LightheartMusic", "body": "More like “office-cum-bedroom,” or “office/bedroom.”", "created_utc": "1643911251.0", "edited": "False", "id": "hvg6j5b", "is_submitter": "False", "link_id": "t3_sjijpy", "parent_id": "t1_hvfkt39", "score": "15", "subreddit": "linguisticshumor", "subreddit_id": "t5_2vwiq"}, {"author": "LightheartMusic", "body": "I mean I’m pretty sure Americans use cum that way too. It’s just more common to say slash now.", "created_utc": "1643900688.0", "edited": "False", "id": "hvfdx25", "is_submitter": "False", "link_id": "t3_sjijpy", "parent_id": "t3_sjijpy", "score": "28", "subreddit": "linguisticshumor", "subreddit_id": "t5_2vwiq"}, {"author": "LightheartMusic", "body": "*What is Origin, the of Manaba, the’s pic?", "created_utc": "1643899508.0", "edited": "False", "id": "hvfb16x", "is_submitter": "False", "link_id": "t3_sj6m3c", "parent_id": "t1_hvf6tgv", "score": "10", "subreddit": "thomastheplankengine", "subreddit_id": "t5_qgmfr"}, {"author": "LightheartMusic", "body": "I don’t think this is entirely true. In my experience, native speakers tend to find the American accent charming. I don’t know how this differs for people with English accents, etc. As long as you’re not too far off from the standard pronunciation of your target language, having an foreign accent can actually be an attractive quality. I always think Germans speaking English sound cute for instance. Many people think the accent French is attractive. I don’t see why it shouldn’t be the same going the other way.", "created_utc": "1643676868.0", "edited": "False", "id": "hv2jih8", "is_submitter": "False", "link_id": "t3_sgr6hu", "parent_id": "t3_sgr6hu", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "LightheartMusic", "body": "I get where you’re coming from. We each have our own moral lines. For me it’s chocolate. Hard to enjoy a peanut butter cup when I am aware of the child slavery that goes into making it.", "created_utc": "1643164586.0", "edited": "False", "id": "hu8q1cd", "is_submitter": "False", "link_id": "t3_scs3sz", "parent_id": "t1_hu8ovyt", "score": "7", "subreddit": "writing", "subreddit_id": "t5_2qh2n"}, {"author": "LightheartMusic", "body": "I mean when I think of Harry Potter I don’t think of an angry, rich, British lady. I think of, like, Hagrid or something. Or of Alan Rickman and Maggie Smith. Why focus on anything else other than the love and warmth in the story? And the reason I think that most other people feel this way is because of how profitable the IP still is. They’re still making movies, books etc — they even had that holiday get together special thing recently with the actors. For all of the noise the actors might make about JKR, they certainly seem willing to make buck off of her. I don’t actually see people attacking the books/movies.", "created_utc": "1643163978.0", "edited": "False", "id": "hu8oliu", "is_submitter": "False", "link_id": "t3_scs3sz", "parent_id": "t1_hu8muue", "score": "1", "subreddit": "writing", "subreddit_id": "t5_2qh2n"}, {"author": "LightheartMusic", "body": "I’ve never met a person in real life who cares about what JKR has to say. Literally only seen people mad in twitter screenshots people share on Instagram etc. The author is separate from the book.", "created_utc": "1643163080.0", "edited": "False", "id": "hu8mh1a", "is_submitter": "False", "link_id": "t3_scs3sz", "parent_id": "t1_hu8exnm", "score": "7", "subreddit": "writing", "subreddit_id": "t5_2qh2n"}, {"author": "LightheartMusic", "body": "After reading several books, I found that the passé simple is actually pretty nice and intuitive. The real shocker for me was the imperfect subjunctive, which is used SO MUCH in the french translation of the Inheritance Cycle that I was kind of forced to get it about halfway through book one. \n\n&#x200B;\n\nI couldn't get into Ewilan, I don't know why. Maybe I should give it another shot.", "created_utc": "1643132112.0", "edited": "False", "id": "hu6fcs2", "is_submitter": "False", "link_id": "t3_sc9i0c", "parent_id": "t1_hu5aucv", "score": "5", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "LightheartMusic", "body": "I was gonna say Toki Pona for the memes but you beat me to the punch .", "created_utc": "1643131289.0", "edited": "False", "id": "hu6d3fn", "is_submitter": "False", "link_id": "t3_scakn8", "parent_id": "t1_hu5cbg5", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "LightheartMusic", "body": "Yes please !", "created_utc": "1643125011.0", "edited": "False", "id": "hu5whae", "is_submitter": "False", "link_id": "t3_scc19f", "parent_id": "t3_scc19f", "score": "1", "subreddit": "Stoicism", "subreddit_id": "t5_2r4kq"}, {"author": "LightheartMusic", "body": "Ikr??? Like you’d have to be a major dumbfuck to ask someone to mace you. Even dumber to mace someone completely randomly", "created_utc": "1642967062.0", "edited": "False", "id": "htx3fcw", "is_submitter": "False", "link_id": "t3_saqr7a", "parent_id": "t1_htwxd3u", "score": "10", "subreddit": "Whatcouldgowrong", "subreddit_id": "t5_2x2oy"}, {"author": "LightheartMusic", "body": "r/thisorthatlanguage would probably be the better sub to ask this question.\nI will say it depends upon you, and whichever one you enjoy more and have more reasons for wanting to learn.", "created_utc": "1642958268.0", "edited": "False", "id": "htwgp58", "is_submitter": "False", "link_id": "t3_sav7e9", "parent_id": "t3_sav7e9", "score": "8", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "LightheartMusic", "body": "I didn’t realize this was on r/conlangs and I decided that this was some obscure French language after a little googling 😅", "created_utc": "1642956461.0", "edited": "False", "id": "htwbzch", "is_submitter": "False", "link_id": "t3_sas1ct", "parent_id": "t3_sas1ct", "score": "2", "subreddit": "conlangs", "subreddit_id": "t5_2red7"}, {"author": "LightheartMusic", "body": "I thought of ESL speakers, along with learning disabled native speakers — that’s why I get the frustration people feel. For ESL speakers specifically, the majority of the ones I know don’t seem to struggle, though I’d have to ask. I think after a certain point in learning a language things like writing systems become much less of a challenge. I’ve studied French and Japanese, and after a good amount of study, the idiosyncrasies of how they write no longer bother me. I am, of course, aware that I am not every single language learner. \n\nThe bigger issue for me, is that I don’t think there is a truly viable alternative to what we have now. There will always be disconnects between the spoken and written forms of a language. I can’t see widespread adoption of any alternative system — mainly because you’d have to convince hundreds of millions of native speakers around the world, along with the billion or so ESL people who put a lot of time and effort into the current system, to switch to something new, unproven, and likely very politically charged. I would also hate to make the wealth of English literature etc relatively inaccessible to future generations. A lot could be mitigated via some digital automated transcription app or something, but there are plenty of resources that are not, and will not be digitized, making even that not a great solution. \n\nI think personally think that English spelling will slowly shift as the language changes, and with that there may be some kind of natural spelling reform. Idk.", "created_utc": "1642911219.0", "edited": "False", "id": "htu6sju", "is_submitter": "False", "link_id": "t3_saa6op", "parent_id": "t1_htu1mp8", "score": "4", "subreddit": "linguisticshumor", "subreddit_id": "t5_2vwiq"}, {"author": "LightheartMusic", "body": "It’s a bed bog actually", "created_utc": "1642892753.0", "edited": "False", "id": "htszf2c", "is_submitter": "False", "link_id": "t3_sab1z6", "parent_id": "t1_htsrmxv", "score": "18", "subreddit": "whatsthisbug", "subreddit_id": "t5_2s3bw"}, {"author": "LightheartMusic", "body": "Exactly. It’s elitist and fairly cruel most of the time.", "created_utc": "1642891642.0", "edited": "False", "id": "htswp3z", "is_submitter": "False", "link_id": "t3_s9t6lv", "parent_id": "t1_htra00l", "score": "4", "subreddit": "linguisticshumor", "subreddit_id": "t5_2vwiq"}, {"author": "LightheartMusic", "body": "I love English’s spelling as well. I get why it can be frustrating to some people, but I don’t get the hate. It does the job it’s supposed to do, which is the only thing writing system has to do. Most actual people I know, don’t struggle with or think about English spelling. The energy people put into this is silly.", "created_utc": "1642889962.0", "edited": "False", "id": "htssir9", "is_submitter": "False", "link_id": "t3_saa6op", "parent_id": "t1_htsfhnm", "score": "12", "subreddit": "linguisticshumor", "subreddit_id": "t5_2vwiq"}, {"author": "LightheartMusic", "body": "That really depends. I’ve heard “he or she” more than I’ve heard generic they. Though I’ve definitely hear they more often than I used to.", "created_utc": "1642749237.0", "edited": "False", "id": "htkjve1", "is_submitter": "False", "link_id": "t3_s8ek0z", "parent_id": "t1_htfxztx", "score": "1", "subreddit": "asklinguistics", "subreddit_id": "t5_2u7nj"}, {"author": "LightheartMusic", "body": "You might want to read “the storytelling animal” and see if there’s anything useful in it you can tell him. It’s a decent book on the importance of fiction.", "created_utc": "1642690570.0", "edited": "False", "id": "htgq9h9", "is_submitter": "False", "link_id": "t3_s81qex", "parent_id": "t1_htdztov", "score": "1", "subreddit": "books", "subreddit_id": "t5_2qh4i"}, {"author": "LightheartMusic", "body": "Never heard it used in the US either. No idea why they decided to use it in the infographic.", "created_utc": "1642689572.0", "edited": "False", "id": "htgnv0b", "is_submitter": "False", "link_id": "t3_s8f0z0", "parent_id": "t1_htg8a54", "score": "4", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "LightheartMusic", "body": "It means both. It has two meanings as far as I know", "created_utc": "1642450775.0", "edited": "False", "id": "ht2yqne", "is_submitter": "False", "link_id": "t3_s66q00", "parent_id": "t1_ht2w5u6", "score": "10", "subreddit": "germany", "subreddit_id": "t5_2qi4z"}, {"author": "LightheartMusic", "body": "I would be interested!", "created_utc": "1642400088.0", "edited": "False", "id": "ht0ad5o", "is_submitter": "False", "link_id": "t3_rui84r", "parent_id": "t3_rui84r", "score": "1", "subreddit": "writers", "subreddit_id": "t5_2r1ti"}, {"author": "LightheartMusic", "body": "Ehhhhh not really. If you’re thinking of the Sapir-Whorf hypothesis (the idea that language shapes thought) then no, that’s mostly been disproven. The majority of cognitive differences between native speakers of different languages are so slight that they are almost undetectable. I believe there was a study that showed Russians were able to tell the difference between different shades of blue a few milliseconds faster than English speakers. Not very impressive. I believe John McWhorter has a book about this topic called “The Language Hoax.” He even goes so far as to suggest that the idea is racist.\n\nI have a slightly different perspective on this subject, which I wrote about for my university capstone project. Note that I wasn’t able set up an experiment to make any determinations on this, and I based this work off of semi-related fields. I suggested that there is a good amount of role-play, and cultural conformity etc that goes along with language learning. I’d look at Mark C. Carnes’ book “Minds on Fire” for this kind of thing applied to teaching history. His students role-play as historical figures, and have to integrate a lot of research about this person they now have to identify with. \n\nAnecdotally, my behavior when I speak French is very different from how I act when I speak my native English. In French, I am much bolder, more willing to talk over people, more sarcastic, along with a whole host of other changes great and small. I’m guessing this may be because there are stereotypes I associate with French, there are social mores that I have to adapt to any way, and because I am not as strong in French as I am with English so I end up behaving oddly anyway.", "created_utc": "1642193950.0", "edited": "False", "id": "hsoffp0", "is_submitter": "False", "link_id": "t3_s41dmg", "parent_id": "t3_s41dmg", "score": "20", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "LightheartMusic", "body": "First thing I thought of haha", "created_utc": "1642128564.0", "edited": "False", "id": "hskslf3", "is_submitter": "False", "link_id": "t3_s3asyi", "parent_id": "t1_hsjxjv9", "score": "14", "subreddit": "germany", "subreddit_id": "t5_2qi4z"}, {"author": "LightheartMusic", "body": "Well, Gandalf didn’t really study or grow his own power. He’s basically an angel in human form. If anything he became weaker as a wizard", "created_utc": "1642122423.0", "edited": "False", "id": "hskee2u", "is_submitter": "False", "link_id": "t3_s2ud3b", "parent_id": "t1_hsi5i57", "score": "1", "subreddit": "Fantasy", "subreddit_id": "t5_2qknd"}, {"author": "LightheartMusic", "body": "I mean, more than one Native American person has either told me that they don’t care either way, or that they prefer Indian. Although personally I default to either native or indigenous American. I think some people in my sister’s tribe prefer to be called First Nation, but that might be a Canadian thing idk. But yeah, the fact that there is an actual country called India makes it impossible to use “Indian” in any formal situation where you mean “Native American,” teaching being one of them. If I’m unsure what someone prefers, I usually just ask.", "created_utc": "1642041181.0", "edited": "False", "id": "hsfom6c", "is_submitter": "False", "link_id": "t3_s2m0xa", "parent_id": "t1_hsfmgym", "score": "1", "subreddit": "videos", "subreddit_id": "t5_2qh1e"}, {"author": "LightheartMusic", "body": "Maybe they’re Irish or something idk. But yeah same here lmao, I was like, yes, I see nothing wrong with /th/", "created_utc": "1642038064.0", "edited": "1642041366.0", "id": "hsfhg2b", "is_submitter": "False", "link_id": "t3_s2hmdb", "parent_id": "t1_hsfh37h", "score": "10", "subreddit": "fauxnetics", "subreddit_id": "t5_54pkas"}, {"author": "LightheartMusic", "body": "Même en français on dit “le prof” pour dire le professeur.", "created_utc": "1641519357.0", "edited": "False", "id": "hrkquc6", "is_submitter": "False", "link_id": "t3_rxln6k", "parent_id": "t1_hrjam10", "score": "10", "subreddit": "learnfrench", "subreddit_id": "t5_2sucz"}, {"author": "LightheartMusic", "body": "Maybe it has something to do with Boxing Day??? When was this sent?", "created_utc": "1641486711.0", "edited": "False", "id": "hric0e5", "is_submitter": "False", "link_id": "t3_rxebdn", "parent_id": "t3_rxebdn", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "LightheartMusic", "body": "Sally’s and Pepe’s are the best. Makes sense, they were the same family lmao. Wooster streets is blessed  ✨", "created_utc": "1640753158.0", "edited": "False", "id": "hqdfg44", "is_submitter": "False", "link_id": "t3_rqh9fz", "parent_id": "t1_hqd292h", "score": "2", "subreddit": "todayilearned", "subreddit_id": "t5_2qqjc"}, {"author": "LightheartMusic", "body": "For me it depends on whether or not I’m using “neither.” If I I say neither I will use not. Otherwise it’s a bit of toss up between no and or", "created_utc": "1640060244.0", "edited": "False", "id": "hpdw9da", "is_submitter": "False", "link_id": "t3_rkwh3s", "parent_id": "t1_hpd9x48", "score": "5", "subreddit": "latin", "subreddit_id": "t5_2qloa"}, {"author": "LightheartMusic", "body": "*orm", "created_utc": "1640060144.0", "edited": "False", "id": "hpdw2ea", "is_submitter": "False", "link_id": "t3_rkwh3s", "parent_id": "t1_hpdhvne", "score": "17", "subreddit": "latin", "subreddit_id": "t5_2qloa"}, {"author": "LightheartMusic", "body": "I mean it would probably shift her focus from being hurt to being monumentally pissed — so great idea /s", "created_utc": "1639496882.0", "edited": "False", "id": "hoitg32", "is_submitter": "False", "link_id": "t3_rfp30m", "parent_id": "t1_hogkgns", "score": "1", "subreddit": "Stoicism", "subreddit_id": "t5_2r4kq"}, {"author": "LightheartMusic", "body": "I see! I must not have read that last entry properly haha", "created_utc": "1638589369.0", "edited": "False", "id": "hn5k3l6", "is_submitter": "False", "link_id": "t3_r7zzkl", "parent_id": "t1_hn5bqnt", "score": "1", "subreddit": "worldbuilding", "subreddit_id": "t5_2rd6n"}, {"author": "LightheartMusic", "body": "I think they look pretty cool! I could see them actually being used. I particularly like the detail of the square used to verify the glen. Perhaps in banks that could be used in conjunction with a scale? It would be important to verify both weight and volume I’m guessing.\n\nAre copper and silver worth about the same in your world? If not, whichever one is less expensive should be made larger in the case of the Kaasen in order to make up for the difference in the value of the metal. I could imagine unscrupulous people running a scam where they take advantage of the price difference somehow.", "created_utc": "1638584255.0", "edited": "False", "id": "hn59s8q", "is_submitter": "False", "link_id": "t3_r7zzkl", "parent_id": "t3_r7zzkl", "score": "3", "subreddit": "worldbuilding", "subreddit_id": "t5_2rd6n"}, {"author": "LightheartMusic", "body": "Probably historical linguistics, classicists, various specialists in literature. Any ancient language that has a large body of written work will likely have jobs that focus on that language. A lot of them will likely be university and research positions is my guess.", "created_utc": "1638392359.0", "edited": "False", "id": "hmueysh", "is_submitter": "False", "link_id": "t3_r6mi9q", "parent_id": "t3_r6mi9q", "score": "39", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "LightheartMusic", "body": "I think this would depend on what you used magic for.\nIs magic used for everything, or does it have very limited domains and/or results?\nHow easy is/was magic to use? Could anyone use it?\nWould it be easier to light a fire with a flint and steel, or would it be easier to cast a spell? WHEN did people discover magic? Was it in the Stone Age? Medieval era? Was it cultural like the wheel or printing press and was invented and or lost at different places at different times? \nIf we could have more information on how your magic works that could be helpful. \n\nIf, for example, it requires continuous casting and focus, I imagine that things like mills would have been invented for making flour etc, and that aqueducts would have been built for directing water.  Anything that takes a long time to complete in this situation would maybe already have some analog invention to fill that need.\n\nDepending on your conworld’s culture, I actually think that the printing press could be a very good invention, if there is mass literacy, and a demand for books that is suddenly not being met, that would be a very lucrative creation and there would be pressure to see who could solve the problem the fastest and get that cash.\n\nEdit:\nI see you say it’s very geologically active. Would something like a seismograph make sense?\n\nAlso, maybe it doesn’t have to be 100% non magical, but new inventions could augment the lower supply/ability of magic users.", "created_utc": "1638247165.0", "edited": "False", "id": "hmmj7f2", "is_submitter": "False", "link_id": "t3_r5dyfp", "parent_id": "t3_r5dyfp", "score": "1", "subreddit": "fantasywriters", "subreddit_id": "t5_2t4ad"}, {"author": "LightheartMusic", "body": "This is so cool!\nWhat is Nióruais? Some of the words are definitely Germanic (like luft for air) but the spelling is so reminiscent of Celtic languages.", "created_utc": "1638243287.0", "edited": "False", "id": "hmmb63a", "is_submitter": "False", "link_id": "t3_r4txhy", "parent_id": "t3_r4txhy", "score": "7", "subreddit": "conlangs", "subreddit_id": "t5_2red7"}, {"author": "LightheartMusic", "body": "While I agree that Duo isn't the be-all and end-all of language learning, it has its place. Particularly for one of the more popular languages like Spanish. If it helps someone start learning, then that's a really good thing.  \nOP, I would suggest going a decent way into Duolingo and then switching to something like LingQ, as dbrown suggested. There are plenty of good videos out there explaining how it works. Have fun!", "created_utc": "1638162219.0", "edited": "False", "id": "hmhw0yc", "is_submitter": "False", "link_id": "t3_r4kx9u", "parent_id": "t1_hmhv182", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "LightheartMusic", "body": "Wow I had completely forgotten about those books until now. Thanks for the reminder! I’m gonna have to go back and read em", "created_utc": "1638083772.0", "edited": "False", "id": "hmdio5f", "is_submitter": "False", "link_id": "t3_qjiu33", "parent_id": "t1_hiqfmw3", "score": "1", "subreddit": "Fantasy", "subreddit_id": "t5_2qknd"}, {"author": "LightheartMusic", "body": "Like… silence of the lambs style??", "created_utc": "1638073403.0", "edited": "False", "id": "hmd1qdw", "is_submitter": "False", "link_id": "t3_r3m4ce", "parent_id": "t1_hmcdu0i", "score": "2", "subreddit": "startrek", "subreddit_id": "t5_2qixm"}, {"author": "LightheartMusic", "body": "Oh no!!! I have found out that I’m a classic anglophone French student from this post :/", "created_utc": "1637894753.0", "edited": "False", "id": "hm3ysbq", "is_submitter": "False", "link_id": "t3_r21snk", "parent_id": "t1_hm35xyw", "score": "9", "subreddit": "French", "subreddit_id": "t5_2rd5t"}, {"author": "LightheartMusic", "body": "I like the sound of this world", "created_utc": "1637877697.0", "edited": "False", "id": "hm31lbc", "is_submitter": "False", "link_id": "t3_r1na89", "parent_id": "t1_hm0woei", "score": "2", "subreddit": "worldbuilding", "subreddit_id": "t5_2rd6n"}, {"author": "LightheartMusic", "body": "So looking at the other comments I’m inclined to agree with /u/Bloonfan60. I would say that French would be your best bet, as Russian is more closely related to French, and has borrowed many words from French, along with the fact that you already speak English which shares a lot of its vocabulary with French. To my mind, Chinese would be the next best bet as the grammar is fairly simple (or so I’ve heard) and you have a lot of interest in it. I would be wary about Arabic unless there is a specific variety you’d like to learn, because otherwise you’d have to learn it twice. MSA and then whichever version you’d choose in order to talk with people.", "created_utc": "1637869275.0", "edited": "False", "id": "hm2j4pl", "is_submitter": "False", "link_id": "t3_r1v8b6", "parent_id": "t1_hm24aji", "score": "2", "subreddit": "thisorthatlanguage", "subreddit_id": "t5_4inj8f"}, {"author": "LightheartMusic", "body": "What is your native language?", "created_utc": "1637859488.0", "edited": "False", "id": "hm1w0tl", "is_submitter": "False", "link_id": "t3_r1v8b6", "parent_id": "t3_r1v8b6", "score": "2", "subreddit": "thisorthatlanguage", "subreddit_id": "t5_4inj8f"}, {"author": "LightheartMusic", "body": "To have access to the full functionality of the app, ie the reader and integrated dictionaries, yes, you have to pay about $12 a month or something.\nI will say that I have gotten a lot of value out of it, compared to some other language programs/courses I’ve spent time and money on\n\nVocabtracker and lingq both basically work the same way. You have a text, the unknown words are highlighted, and as you go along you look up definitions, and mark the words you can recognize. I’ve read quite a few novels in French now, the majority of them thanks to lingq.", "created_utc": "1637632952.0", "edited": "1637633162.0", "id": "hlptmee", "is_submitter": "False", "link_id": "t3_qzppge", "parent_id": "t1_hlpl49z", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "LightheartMusic", "body": "There is a difference between telling a story and bragging. I think this falls into the first camp", "created_utc": "1637624235.0", "edited": "False", "id": "hlpb2i7", "is_submitter": "False", "link_id": "t3_qzp9z9", "parent_id": "t1_hlpaaj9", "score": "16", "subreddit": "Stoicism", "subreddit_id": "t5_2r4kq"}, {"author": "LightheartMusic", "body": "I love LingQ, and I use it everyday.\n\nFor those who won’t give it a chance because they don’t want to spend the money there are alternatives. Off the top of my head I can think of Vocabtracker, and I think there are some offshoots of LWT. I’ve never used it but I think that readlang may be in the same vein.", "created_utc": "1637623953.0", "edited": "False", "id": "hlpag0t", "is_submitter": "False", "link_id": "t3_qzppge", "parent_id": "t1_hlo4vjo", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "LightheartMusic", "body": "I’m annoyed this isn’t higher up lol", "created_utc": "1637552314.0", "edited": "False", "id": "hllians", "is_submitter": "False", "link_id": "t3_qz2e2f", "parent_id": "t1_hlk2b04", "score": "1", "subreddit": "lotrmemes", "subreddit_id": "t5_2v0i1"}, {"author": "LightheartMusic", "body": "You know I actually thought of this sub when I responded to that post lmao. \n\nI stand by my “/sk/ /sh/“ usage.", "created_utc": "1637511805.0", "edited": "False", "id": "hlivyre", "is_submitter": "False", "link_id": "t3_qysuoz", "parent_id": "t3_qysuoz", "score": "8", "subreddit": "fauxnetics", "subreddit_id": "t5_54pkas"}, {"author": "LightheartMusic", "body": ">I need a way to figure out morality so I can act accordingly.\n\nJeez. You and every other philosopher.\n\n&#x200B;\n\nI've been reading through a lot of the comments here, and I've come to some conclusions.\n\nFirst of all, I believe you're conflating two different meanings of \"discriminate.\" To discriminate can mean that you are judging and/or treating people unfairly, but it can also mean that you can make distinctions between different things. That second meaning is important for pretty much any system of morality. \n\nAs we're on a Stoicism subreddit, I'll point you toward that great Marcus Aurelius quote\n\n>\"When you wake up in the morning, tell yourself: the people I deal with today will be meddling, ungrateful, arrogant, dishonest, jealous and surly. They are like this because they can't tell good from evil. But I have seen the beauty of good, and the ugliness of evil, and have recognized that the wrongdoer has a nature related to my own - not of the same blood and birth, but the same mind, and possessing a share of the divine. And so none of them can hurt me. No one can implicate me in ugliness. Nor can I feel angry at my relative, or hate him. We were born to work together like feet, hands and eyes, like the two rows of teeth, upper and lower. To obstruct each other is unnatural. To feel anger at someone, to turn your back on him: these are unnatural.\"\n\nI think this is a key part of behaving morally. You can, and should, recognize good and bad behavior. That does not mean, however, that you need to treat the person who does something wrong unfairly. In spite of the constant meanness, and failings, etc, of other people, we still need to work together in order to live, in order to reach our highest potential. If someone does something reprehensible, and you can't forgive them, then that's the time to wipe the dust off your shoes and move on. \n\n&#x200B;\n\nSo how do we tell what's good and what's bad? Hard question that I can't answer. Leaving stoicism aside for a moment, I think that Kant might be helpful if you want to think about right and wrong. I'm not a big fan of his work, but he really helped clarify these issues for me. Maybe read some summaries of his books (they are dense and difficult), and watch some youtube videos. For me, the key takeaway from his work, is that we need to treat people as people, and not as tools that we can use. He thought that we can't treat people as means to an end (ie, being nice to this person will get me promoted/sexually satisfied/happy/delicious food/etc), but as ends in and of themselves.\n\nSo you can ask yourself when dealing with other people \"Is this for me? Or am I doing this for the other person?\" If you're doing something for yourself, the action is less likely to be good, and certainly wouldn't be moral. Don't obsess about this, however. For the most part you probably already know what's right and what's wrong.", "created_utc": "1637482879.0", "edited": "False", "id": "hlhkost", "is_submitter": "False", "link_id": "t3_qy8lse", "parent_id": "t3_qy8lse", "score": "1", "subreddit": "Stoicism", "subreddit_id": "t5_2r4kq"}, {"author": "LightheartMusic", "body": "I agree that it’s difficult to write sexuality and avoid being creepy, but it’s definitely not impossible. Romance is a HUGE genre, and the target audience is usually women. If all the dudes were creeps, few people would really want to read about them. \n\nCompare, say, how Ursula Vernon deals with sexuality vs, idk, Piers Anthony. Anthony’s men (and narrators) are almost always creepy/gross, and often violent when it comes to sexuality. The focus is on various body parts etc, and how the women are to be used — ie, treated as things instead of people. Vernon, on the other hand, writes from the perspective of the women experiencing the affections of the male love interest. This way we can empathize with them, and see first hand when a man is a creep, vs when a man is behaving correctly and being attractive.\n\nI think this is a situation where reading books by women authors would be helpful — see how they dealt with it, and take what works for you. Allowing both parties in a relationship to have a voice will go a long way.", "created_utc": "1637472825.0", "edited": "False", "id": "hlh6l1q", "is_submitter": "False", "link_id": "t3_qygieo", "parent_id": "t1_hlgnn4h", "score": "3", "subreddit": "writing", "subreddit_id": "t5_2qh2n"}, {"author": "LightheartMusic", "body": "I think it is also dialectal. Everyone I’ve heard say bruschetta where I’m from says it with the “sk” sound not the “sh” sound. \n\nI think as long as you’re not being pretentious, and as long as it’s not getting in the way of communication, you can say a word however you like. Like I’m not going to pronounce “adroit” with a French accent when speaking English because nobody would understand what I was saying.", "created_utc": "1637444292.0", "edited": "False", "id": "hlflpd8", "is_submitter": "False", "link_id": "t3_qy9hu3", "parent_id": "t1_hlej8cw", "score": "30", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "LightheartMusic", "body": "I haven’t finished the books yet, so I may be missing something here but I think that all of the characters are kind of insufferable and annoying, not just the women. Rand is such a whiner that I can barely stand him sometimes. I think Jordan had a hard time writing likable characters — if that’s something they change in the show, no complaints from me.", "created_utc": "1637427865.0", "edited": "False", "id": "hlejvbn", "is_submitter": "False", "link_id": "t3_qxorps", "parent_id": "t1_hld8g2z", "score": "3", "subreddit": "Fantasy", "subreddit_id": "t5_2qknd"}, {"author": "LightheartMusic", "body": "I’m big. Bigger than most of my friends, all of my family. I hate war, killing. I do my best not to hurt anyone. \n\nDidn’t need to accidentally kill my wife to get to that point.", "created_utc": "1637427480.0", "edited": "False", "id": "hleixqz", "is_submitter": "False", "link_id": "t3_qxorps", "parent_id": "t1_hle8leq", "score": "6", "subreddit": "Fantasy", "subreddit_id": "t5_2qknd"}, {"author": "LightheartMusic", "body": "I think this is true as long it doesn’t get in the way of the vision the author is trying to portray. There’s a reason why publishers localize books, even within the same language. There will be references/slang/grammar differences that will be misunderstood across cultures and may create very different story-worlds in the minds of different audiences. \n\nThat being said, heck yeah! Ñ is awesome, use it.", "created_utc": "1637357238.0", "edited": "False", "id": "hlb2pty", "is_submitter": "False", "link_id": "t3_qxnuuw", "parent_id": "t1_hlat7r1", "score": "5", "subreddit": "writing", "subreddit_id": "t5_2qh2n"}, {"author": "LightheartMusic", "body": "I came back to *Dune* recently, and it was that quote that made me think that Herbert might have been a Stoic", "created_utc": "1637334617.0", "edited": "False", "id": "hl9g7yu", "is_submitter": "False", "link_id": "t3_hkffx0", "parent_id": "t1_fwtv121", "score": "2", "subreddit": "Stoicism", "subreddit_id": "t5_2r4kq"}, {"author": "LightheartMusic", "body": "I want to know more about this world… 😁", "created_utc": "1637227851.0", "edited": "False", "id": "hl3oq9j", "is_submitter": "False", "link_id": "t3_qwdb7n", "parent_id": "t1_hl3h7q3", "score": "2", "subreddit": "WritingPrompts", "subreddit_id": "t5_2s3nb"}, {"author": "LightheartMusic", "body": "Without emotional—> unemotional", "created_utc": "1637193563.0", "edited": "False", "id": "hl2057k", "is_submitter": "False", "link_id": "t3_qw430f", "parent_id": "t1_hl1pnbl", "score": "9", "subreddit": "WritingPrompts", "subreddit_id": "t5_2s3nb"}, {"author": "LightheartMusic", "body": "This feels like it could be a good start to a novel", "created_utc": "1637128403.0", "edited": "False", "id": "hkyfhe4", "is_submitter": "False", "link_id": "t3_qvaijp", "parent_id": "t1_hkwzcy8", "score": "5", "subreddit": "WritingPrompts", "subreddit_id": "t5_2s3nb"}, {"author": "LightheartMusic", "body": "From castle to casserole", "created_utc": "1637128251.0", "edited": "False", "id": "hkyf8p2", "is_submitter": "False", "link_id": "t3_qvaijp", "parent_id": "t1_hkwtbdx", "score": "18", "subreddit": "WritingPrompts", "subreddit_id": "t5_2s3nb"}, {"author": "LightheartMusic", "body": "I’ve only read the first two books, but Matt is definitely one of my faves", "created_utc": "1637128094.0", "edited": "False", "id": "hkyezkz", "is_submitter": "False", "link_id": "t3_qvh6ym", "parent_id": "t1_hkx7vdp", "score": "4", "subreddit": "Fantasy", "subreddit_id": "t5_2qknd"}, {"author": "LightheartMusic", "body": "To be fair, I thought that was the joke Pratchett was going for. Though maybe I got that from the cover idk", "created_utc": "1637033457.0", "edited": "False", "id": "hkt5e9g", "is_submitter": "False", "link_id": "t3_pkwfqg", "parent_id": "t1_hc8h3x3", "score": "1", "subreddit": "menwritingwomen", "subreddit_id": "t5_3ox0h"}, {"author": "LightheartMusic", "body": "Loved that series when I was a kid lol.", "created_utc": "1637029984.0", "edited": "False", "id": "hksxq39", "is_submitter": "False", "link_id": "t3_quh6vj", "parent_id": "t1_hkr7nk6", "score": "2", "subreddit": "writing", "subreddit_id": "t5_2qh2n"}, {"author": "LightheartMusic", "body": "I think a good example of how physical appearance could be relevant would be to contrast one character with the rest of their family. This could be a way to foreshadow something like a secret/unknown adoption, or maybe some kind of tie to another family member or ancestor. But we don’t need much detail for that either. Usually just hair color or body type would suffice", "created_utc": "1637008771.0", "edited": "False", "id": "hkrjnrt", "is_submitter": "False", "link_id": "t3_quosvs", "parent_id": "t1_hkrgg0a", "score": "8", "subreddit": "writing", "subreddit_id": "t5_2qh2n"}, {"author": "LightheartMusic", "body": "I think you meant to post this to the ethically diverse prompt", "created_utc": "1637006189.0", "edited": "False", "id": "hkrd3kk", "is_submitter": "False", "link_id": "t3_qu3d9b", "parent_id": "t1_hkqfx95", "score": "1", "subreddit": "WritingPrompts", "subreddit_id": "t5_2s3nb"}, {"author": "LightheartMusic", "body": "I’m coming at this as someone who lived in an academic environment where the go to response was to say “logic and debate are western practices, therefore non-European culture don’t have logic or debate etc” which just enabled them to be kind of racist.\n\nSecularism and rationalism are not solely modern or western. You can find parallels all over the world at different times. Look at China and India. Religion, magic, atheism, secularism, rationalism and so on, are all ideas that have been toyed with for thousands of years and will continue to be toyed with as long as are people. I hate when people act like things like logic belong only to western culture or pretend that the west has gotten any less superstitious. We only think that way because of how we’re imbedded in our own culture — we cannot see our own muddy thinking.\n\nI am not against the bigger point you made however. I agree that it is important to value the world views of people victimized by colonialism, and I can see how magical realism could do that. I don’t even disagree with the idea that the world is magical. I certainly love being here, and I am still amazed by the world.", "created_utc": "1637004989.0", "edited": "False", "id": "hkra0yd", "is_submitter": "False", "link_id": "t3_quajqz", "parent_id": "t1_hkr0o0c", "score": "5", "subreddit": "writing", "subreddit_id": "t5_2qh2n"}, {"author": "LightheartMusic", "body": "I second French", "created_utc": "1637003446.0", "edited": "False", "id": "hkr65jr", "is_submitter": "False", "link_id": "t3_qubwwi", "parent_id": "t1_hkpdrog", "score": "2", "subreddit": "thisorthatlanguage", "subreddit_id": "t5_4inj8f"}, {"author": "LightheartMusic", "body": "Septimus Heap?", "created_utc": "1637003123.0", "edited": "False", "id": "hkr5c1r", "is_submitter": "False", "link_id": "t3_quh6vj", "parent_id": "t1_hkq11qf", "score": "4", "subreddit": "writing", "subreddit_id": "t5_2qh2n"}, {"author": "LightheartMusic", "body": "I’ve always picture it  as “yuins” but “you’ns” makes more sense lmao", "created_utc": "1636986363.0", "edited": "False", "id": "hkq0lpz", "is_submitter": "False", "link_id": "t3_qu8491", "parent_id": "t1_hkoxjhy", "score": "5", "subreddit": "linguisticshumor", "subreddit_id": "t5_2vwiq"}, {"author": "LightheartMusic", "body": "I thought of all three of these scripts lmao. I think that this is a sign that you have made a well-designed writing system.", "created_utc": "1636731287.0", "edited": "False", "id": "hkccfe6", "is_submitter": "False", "link_id": "t3_qr2lk5", "parent_id": "t1_hk448n6", "score": "6", "subreddit": "conlangs", "subreddit_id": "t5_2red7"}, {"author": "LightheartMusic", "body": "If this is a guessing game then… is yours a soup? With spicy, Olives, sixty somethings, smoked paprika, and possibly croutons (crust of hard bread)\n\nDoes your conlang belong to specific family? It definitely feels romantic, but certain things make me think Germanic. The way x is used reminds me of how the Spanish latinized things", "created_utc": "1636708753.0", "edited": "False", "id": "hkbb5qi", "is_submitter": "False", "link_id": "t3_qs29jq", "parent_id": "t3_qs29jq", "score": "2", "subreddit": "conlangs", "subreddit_id": "t5_2red7"}, {"author": "LightheartMusic", "body": "Yeah but their terms require vendors to match their prices across platforms so it ends up making little difference to the customer. That’s why you can’t subscribe to, say, Netflix via apple.", "created_utc": "1636571502.0", "edited": "False", "id": "hk3rh2c", "is_submitter": "False", "link_id": "t3_qqbr87", "parent_id": "t1_hk2ph8r", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "LightheartMusic", "body": "Well, I think French is weakest on the list because you neither said you liked it’s culture nor that you wanted to work there. That said, I started learning French mostly on a whim and it’s been a wonderful, life-changing journey. \n\nTurkish seems to be strongest because you both like the culture and want to work there. \n\nAll this depends on what resources you have available to you. Popular languages like French or German have a huge number of resources widely available. I also know plenty of people from the Middle-East and South Asia who have enrolled in immersion programs in Europe and were very successful. I don’t know much about Arabic or Turkish resources or study programs.\n\nWhere do you want to go next in life? Where do you want to end up ultimately? Maybe cut out everything that gets in the way of that. What can you realistically do? For me, asking those questions really helped narrow down what languages I wanted to study.\n\nGood luck", "created_utc": "1636561520.0", "edited": "False", "id": "hk31msp", "is_submitter": "False", "link_id": "t3_qqqwmr", "parent_id": "t3_qqqwmr", "score": "1", "subreddit": "thisorthatlanguage", "subreddit_id": "t5_4inj8f"}, {"author": "LightheartMusic", "body": "I think you might like Orwell’s essay [Why I Write.](https://www.orwellfoundation.com/the-orwell-foundation/orwell/essays-and-other-works/why-i-write/)\nI don’t agree with everything he says here, but I think it could be useful for thinking about this issue.", "created_utc": "1636349968.0", "edited": "False", "id": "hjrtq2t", "is_submitter": "False", "link_id": "t3_qowmjr", "parent_id": "t3_qowmjr", "score": "2", "subreddit": "writing", "subreddit_id": "t5_2qh2n"}, {"author": "LightheartMusic", "body": "There are more than one type of olive. I’ve seen black, purplish, and brown olives", "created_utc": "1636328820.0", "edited": "False", "id": "hjqnxjm", "is_submitter": "False", "link_id": "t3_qorp1k", "parent_id": "t1_hjqn0y7", "score": "12", "subreddit": "writing", "subreddit_id": "t5_2qh2n"}, {"author": "LightheartMusic", "body": "I use shit and shat. Idk how I decide which to use — maybe it’s just random", "created_utc": "1636319470.0", "edited": "False", "id": "hjq1udm", "is_submitter": "False", "link_id": "t3_qoxeql", "parent_id": "t3_qoxeql", "score": "5", "subreddit": "linguisticshumor", "subreddit_id": "t5_2vwiq"}, {"author": "LightheartMusic", "body": "Fun fact: I believe they tried to ban the use of fahren in East Germany because it’s related to führer. I wish I could remember what book I read this in. I will have to go looking", "created_utc": "1636263237.0", "edited": "False", "id": "hjn6fo8", "is_submitter": "False", "link_id": "t3_qny99m", "parent_id": "t1_hjl8gnn", "score": "2", "subreddit": "etymology", "subreddit_id": "t5_2qspe"}, {"author": "LightheartMusic", "body": "It’s a comedy set toward the end of WWI. A retreating German army rigs a town to explode and a single Scottish soldier has to disarm the bomb with the help of the local lunatic asylum. A theme developed over the course movie is how the people treated as crazy by the outside world are in many ways much more sane than anyone else — especially anyone who would  want to kill or die for a war.\n\nIt’s also in three different languages at once, French, English, & German which is kinda cool.", "created_utc": "1636245578.0", "edited": "False", "id": "hjm9ien", "is_submitter": "False", "link_id": "t3_qmig7l", "parent_id": "t1_hjl94jx", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "LightheartMusic", "body": "Literally the video I thought of when I saw the poll", "created_utc": "1636232958.0", "edited": "False", "id": "hjlhvo3", "is_submitter": "False", "link_id": "t3_qo09nj", "parent_id": "t1_hjkcxky", "score": "1", "subreddit": "thisorthatlanguage", "subreddit_id": "t5_4inj8f"}, {"author": "LightheartMusic", "body": "You know I misread seins as reins and I got a completely different picture. \n\nLike that Gainsbourg song “Je vais et viens entre tes reins”\n\nAlso while we on the subject of kings of various body parts, Le Roi de Cœur is a fantastic movie if you haven’t seen it.", "created_utc": "1636112432.0", "edited": "False", "id": "hjeitq8", "is_submitter": "False", "link_id": "t3_qmig7l", "parent_id": "t1_hjcd6sn", "score": "8", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "LightheartMusic", "body": "Aight, I might do a new one of these as Google poll in order to have more representative options. Not one of these options fit me lmao", "created_utc": "1635300647.0", "edited": "False", "id": "hi738se", "is_submitter": "False", "link_id": "t3_qfy8wv", "parent_id": "t3_qfy8wv", "score": "3", "subreddit": "latin", "subreddit_id": "t5_2qloa"}, {"author": "LightheartMusic", "body": "They might not be English — I’ve heard the “you’re/pure” merger here in the USA too. As “yer/pyer.”", "created_utc": "1635207841.0", "edited": "False", "id": "hi1yvb5", "is_submitter": "False", "link_id": "t3_qffk57", "parent_id": "t1_hi1pfsa", "score": "3", "subreddit": "French", "subreddit_id": "t5_2rd5t"}, {"author": "LightheartMusic", "body": "I mean chuuni is always terrible. Boomer really doesn't mean anything -- I guess I'd be more into John Denver or something.", "created_utc": "1634969831.0", "edited": "False", "id": "hhprged", "is_submitter": "False", "link_id": "t3_qbtj0t", "parent_id": "t3_qbtj0t", "score": "1", "subreddit": "Isekai", "subreddit_id": "t5_3hwoy"}, {"author": "LightheartMusic", "body": "Surely it would be the other way around? If you sped up time but the amount of heat produced stayed the same it would be colder because the same amount of heat would be spread out? Or maybe you could do both. It would depend on whether you could choose between manipulating the environment vs the person. That could set up interesting conflict between someone who can manipulate someone’s personal time, and someone who can change the flow of time in a region of space", "created_utc": "1634882131.0", "edited": "False", "id": "hhl6tsv", "is_submitter": "False", "link_id": "t3_qczzsb", "parent_id": "t1_hhjmn32", "score": "2", "subreddit": "Isekai", "subreddit_id": "t5_3hwoy"}, {"author": "LightheartMusic", "body": "I spent about four months in France. I went from a b1 level to about a b2+ level. So low intermediate to high intermediate. Tbf, I had the winter break in between and I didn’t spend a lot of time studying. I could have made greater strides while there. But I thought that I shouldn’t spend all my time studying and take advantage of my stay, and travel and meet new people. Very rewarding", "created_utc": "1634868135.0", "edited": "False", "id": "hhkicsq", "is_submitter": "False", "link_id": "t3_qd32w1", "parent_id": "t3_qd32w1", "score": "8", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "LightheartMusic", "body": "Baker. I have the knowledge and experience, if agriculture is efficient there then the materials are cheap, and the return is pretty high. Everyone needs to eat. Then I’d use that money to start some other businesses maybe. Use my free time studying magic or something idk, or go into teaching as someone else suggested.", "created_utc": "1634780674.0", "edited": "False", "id": "hhfuj7l", "is_submitter": "False", "link_id": "t3_qc8zjb", "parent_id": "t3_qc8zjb", "score": "1", "subreddit": "Isekai", "subreddit_id": "t5_3hwoy"}, {"author": "LightheartMusic", "body": "Great suggestions! I would say that you should be careful about how much you look up while reading, and especially how much time you spend on flashcarding apps like Anki. I would only put a few words into anki per reading session, otherwise it can get very frustrating. It’s okay not to know everything when you’re reading — I still often don’t when I read in my native language. \n\nThis all changes if you move from physical books to ebooks of course. Then you have access to e-readers like Vocabtracker or LingQ, which facilitate that whole process of looking words up and saving definitions. I don’t even really use anki anymore even though it’s such a great tool. I spend that time reading now.", "created_utc": "1634525566.0", "edited": "False", "id": "hh2c39b", "is_submitter": "False", "link_id": "t3_q9xl2e", "parent_id": "t1_hgz7mi4", "score": "9", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "LightheartMusic", "body": "Mm maybe yeah. I’m cool being both an Anglophile and a Francophile, but I’d rather be anything but a weaboo etc. It’s so derogatory it’s unreal.", "created_utc": "1634230489.0", "edited": "False", "id": "hgmqefd", "is_submitter": "False", "link_id": "t3_q7l5ie", "parent_id": "t1_hgmkynh", "score": "5", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "LightheartMusic", "body": "This was beautiful", "created_utc": "1633915025.0", "edited": "False", "id": "hg6bpwp", "is_submitter": "False", "link_id": "t3_q56fcg", "parent_id": "t1_hg4dkp4", "score": "1", "subreddit": "WritingPrompts", "subreddit_id": "t5_2s3nb"}, {"author": "LightheartMusic", "body": "This makes sense to me! I thought it might be some kind of scribal error.  Thanks for your help!", "created_utc": "1633538344.0", "edited": "False", "id": "hfmejb1", "is_submitter": "True", "link_id": "t3_pzgbt0", "parent_id": "t1_hf8b8bt", "score": "1", "subreddit": "OldEnglish", "subreddit_id": "t5_2tjrn"}, {"author": "LightheartMusic", "body": "I’m a native English speaker. I have a hard time reading Chaucer lmao", "created_utc": "1633444261.0", "edited": "False", "id": "hfhe9w2", "is_submitter": "False", "link_id": "t3_q1x14b", "parent_id": "t1_hfhcz46", "score": "124", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "LightheartMusic", "body": "I just binge-read your entire story up to now -- love it!", "created_utc": "1633049397.0", "edited": "False", "id": "hex4bv0", "is_submitter": "False", "link_id": "t3_py2rz7", "parent_id": "t3_py2rz7", "score": "2", "subreddit": "HFY", "subreddit_id": "t5_2y95n"}, {"author": "LightheartMusic", "body": "this is cool that you're doing this -- one of the things that bothered me when I started on LingQ was the lack of mini-stories for Latin. I ended up sticking to LLPSI, but I still would have liked them as supplemental reading.", "created_utc": "1631587796.0", "edited": "False", "id": "hcrvlm5", "is_submitter": "False", "link_id": "t3_pmlvaw", "parent_id": "t3_pmlvaw", "score": "2", "subreddit": "latin", "subreddit_id": "t5_2qloa"}, {"author": "LightheartMusic", "body": "it also wouldn't make sense for him to change motivations like that -- he's devoted years to being a \"support character.\" I remember being more annoyed by him not getting his way more often, more than anything", "created_utc": "1631491204.0", "edited": "False", "id": "hcmop4e", "is_submitter": "False", "link_id": "t3_pikm82", "parent_id": "t1_hbr4ufd", "score": "1", "subreddit": "YuujinCharacter", "subreddit_id": "t5_11nd32"}, {"author": "LightheartMusic", "body": "that is awful — I would tell them to shut it, or the \"friendship\" is over.", "created_utc": "1623797612.0", "edited": "False", "id": "h1wkha5", "is_submitter": "False", "link_id": "t3_o0cps4", "parent_id": "t1_h1wfck1", "score": "13", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "LightheartMusic", "body": "yeah, i've gotten weeb comments, and so on. Someone once told my mom that she would have little Japanese grandchildren running around the house. I was like \"chill, I'm not planning on f\\*cking my grammar books.\"", "created_utc": "1623797291.0", "edited": "False", "id": "h1wjuhg", "is_submitter": "False", "link_id": "t3_o0cps4", "parent_id": "t1_h1wad33", "score": "10", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "LightheartMusic", "body": "I know this was resolved but\n\nMy ex who spoke English as a second language (C1/C2 iirc) *hated* whenever I corrected her English. I was just doing it to be helpful because she was majoring in English, but it just made her feel really down, and like I was criticizing or judging her. I stopped pretty quickly.  \n\nEveryone is different.", "created_utc": "1623698820.0", "edited": "False", "id": "h1rj5rt", "is_submitter": "False", "link_id": "t3_nunqdv", "parent_id": "t1_h10gcaf", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "LightheartMusic", "body": "I second Scorpio Martianus' recordings — his content is gold, and he pays hyper attention to vowel length which a lot of teachers ignore", "created_utc": "1623698353.0", "edited": "False", "id": "h1ri532", "is_submitter": "False", "link_id": "t3_nzddm5", "parent_id": "t1_h1ozrs4", "score": "3", "subreddit": "latin", "subreddit_id": "t5_2qloa"}, {"author": "LightheartMusic", "body": "I love your handle so much", "created_utc": "1623698267.0", "edited": "False", "id": "h1rhydo", "is_submitter": "False", "link_id": "t3_nzddm5", "parent_id": "t1_h1ozbv5", "score": "2", "subreddit": "latin", "subreddit_id": "t5_2qloa"}, {"author": "LightheartMusic", "body": "it's kinda basic, but I'm a huge fan of *Stranger in a Strange Land* (the 1991 version, which has the 60,000 or so words that were originally cut)", "created_utc": "1623697762.0", "edited": "False", "id": "h1rgukk", "is_submitter": "False", "link_id": "t3_nzncox", "parent_id": "t1_h1rctke", "score": "1", "subreddit": "etymology", "subreddit_id": "t5_2qspe"}, {"author": "LightheartMusic", "body": "good point! since OP's goal is to *speak with* with 70% of the world's population, mutual intelligibility could lower the number of languages one would need to know.", "created_utc": "1623097732.0", "edited": "False", "id": "h0y9ove", "is_submitter": "False", "link_id": "t3_npx2tl", "parent_id": "t1_h0wv60w", "score": "3", "subreddit": "thisorthatlanguage", "subreddit_id": "t5_4inj8f"}, {"author": "LightheartMusic", "body": "70% of the world's population is about 5.3 billion, so with your list OP would have to know about 11 languages, discounting overlap.\n\n* English\n* Mandarin\n* Hindi\n* Spanish\n* MSA\n* Bengali\n* French\n* Russian\n* Portuguese\n* Urdu\n* Indonesian\n\nThat's a lot lol", "created_utc": "1622584837.0", "edited": "1623097800.0", "id": "h08rpoj", "is_submitter": "False", "link_id": "t3_npx2tl", "parent_id": "t1_h08gpxo", "score": "3", "subreddit": "thisorthatlanguage", "subreddit_id": "t5_4inj8f"}, {"author": "LightheartMusic", "body": "darn, i was really hoping Manx would take the lead", "created_utc": "1622584160.0", "edited": "False", "id": "h08qa15", "is_submitter": "False", "link_id": "t3_nq3sqt", "parent_id": "t3_nq3sqt", "score": "4", "subreddit": "thisorthatlanguage", "subreddit_id": "t5_4inj8f"}, {"author": "LightheartMusic", "body": "Learning Spanish directly would be faster and enable OP to communicate with a broader swath of people more quickly, which is the stated goal. I have nothing against Esperanto , but this is a bit like the people who suggest learning Mandarin will make learning Japanese easier, or Italian would make learning other romance languages (or Latin) easier. Perhaps, but there's something to be said for being direct in your language study rather than roundabout. The only exception I can think of, off the top of my head, is that people generally learn Akkadian in order to learn Sumerian — which is because we don't have the greatest resources for learning Sumerian.", "created_utc": "1622583872.0", "edited": "False", "id": "h08pnlt", "is_submitter": "False", "link_id": "t3_npx2tl", "parent_id": "t1_h08l19m", "score": "3", "subreddit": "thisorthatlanguage", "subreddit_id": "t5_4inj8f"}, {"author": "LightheartMusic", "body": "I know similar questions have been asked in the past, but is there any good way to get  subtitles/scripts in Japanese? I'm specifically looking for Lady Snowblood's (修羅雪姫) subtitles, but I'm struggling. My dvd only has them in English, unfortunately.", "created_utc": "1606360925.0", "edited": "False", "id": "gdmf9a1", "is_submitter": "False", "link_id": "t3_jz5ol3", "parent_id": "t3_jz5ol3", "score": "1", "subreddit": "LearnJapanese", "subreddit_id": "t5_2qyls"}, {"author": "LightheartMusic", "body": "Oh no lol, I guess I got a little too fixated on that importxml. Thank you, this works perfectly for what I'm doing.", "created_utc": "1606171440.0", "edited": "False", "id": "gddnw3j", "is_submitter": "True", "link_id": "t3_jz5loe", "parent_id": "t1_gdceplr", "score": "1", "subreddit": "googlesheets", "subreddit_id": "t5_366bm"}, {"author": "LightheartMusic", "body": "honestly it's so frustrating. I even tried to find a contact email to suggest this to them lmao", "created_utc": "1605235664.0", "edited": "False", "id": "gc460dq", "is_submitter": "False", "link_id": "t3_jfkogz", "parent_id": "t3_jfkogz", "score": "1", "subreddit": "vrv", "subreddit_id": "t5_3dd9n"}, {"author": "LightheartMusic", "body": "I was one hundred percent sure that this was some racist slang about italians or something. I was so confused lmao", "created_utc": "1605154373.0", "edited": "False", "id": "gc0ahp7", "is_submitter": "False", "link_id": "t3_ie1vx4", "parent_id": "t3_ie1vx4", "score": "1", "subreddit": "AllGasNoBrakesYT", "subreddit_id": "t5_2cuhor"}, {"author": "LightheartMusic", "body": "oh noooo lol", "created_utc": "1603248752.0", "edited": "False", "id": "g9i6auw", "is_submitter": "False", "link_id": "t3_jcmkwy", "parent_id": "t1_g92i1eh", "score": "2", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "LightheartMusic", "body": "Salve! Discipulus linguae latinae non sum. Pendant mon enfance oui, mais depuis lycée j'ai oublié presque tout. Maintenant, j'étudie le français.", "created_utc": "1601767573.0", "edited": "False", "id": "g7kqugb", "is_submitter": "False", "link_id": "t3_j2glil", "parent_id": "t1_g79z476", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "LightheartMusic", "body": "Congratulations to you and your fiancé for getting a kid out of it!", "created_utc": "1600955581.0", "edited": "False", "id": "g6fa3ny", "is_submitter": "False", "link_id": "t3_iykser", "parent_id": "t1_g6f0pxu", "score": "3", "subreddit": "LearnJapanese", "subreddit_id": "t5_2qyls"}, {"author": "LightheartMusic", "body": "I would be interested. Can you send me a sample?", "created_utc": "1596467602.0", "edited": "False", "id": "g07r69n", "is_submitter": "False", "link_id": "t3_i2wttq", "parent_id": "t3_i2wttq", "score": "1", "subreddit": "RecordThisForFree", "subreddit_id": "t5_3fao5"}]