[{"author": "lingua-discipuli", "body": "Sry for the late response. Tbh i don't know if i have a favorite app. I use Anki the most probably but it's so boring to me. I used memrise for like 2 months and it was rather enjoyable so I've debated going back to using it. I also liked Quizlet a lot. Quizlet doesn't have SRS implented tho, so i only used it for games + creating tests because it's great with that stuff.", "created_utc": "1666906584.0", "edited": "False", "id": "iu1kvd9", "is_submitter": "False", "link_id": "t3_yc0x4p", "parent_id": "t1_its0ct8", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "lingua-discipuli", "body": "I use primarily apps. Just bc of how much easier it is. Especially for frequency decks with thousands of words. \n\nI love physical cards tho. When i used to study Chinese for four years at a school, the teacher would make us use physical cards and it worked well for me. I've considered messing with physical cards for that reason but not sure how I'd start", "created_utc": "1666720304.0", "edited": "False", "id": "itr13g0", "is_submitter": "False", "link_id": "t3_yc0x4p", "parent_id": "t1_itpilw1", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "lingua-discipuli", "body": "In terms of what *I* put on the flashcards, it will be a quote from my book or other media. I made a card based from the book that went like \"My father says, [quote]\" to learn the words \"says\" in German.\n\nTbh its nothing special, but it's enough and feels natural to me", "created_utc": "1666664300.0", "edited": "False", "id": "ito8atp", "is_submitter": "False", "link_id": "t3_yc0x4p", "parent_id": "t1_itknwdz", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "lingua-discipuli", "body": "What language, if you don't mind me asking?", "created_utc": "1666652814.0", "edited": "False", "id": "itni8ge", "is_submitter": "False", "link_id": "t3_yc0x4p", "parent_id": "t1_itkr1mw", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "lingua-discipuli", "body": "Z lib is amazing even outside language learning. I've saved an insane amount of money of just downloading textbooks from their instead it buying textbooks from my university", "created_utc": "1666652793.0", "edited": "False", "id": "itni6v1", "is_submitter": "False", "link_id": "t3_yc0x4p", "parent_id": "t1_itkpb2g", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "lingua-discipuli", "body": "\"Jack of all trades, master of none\" \n\nI do dabble with other languages occasionally, but focus on primarily one because realistically I do not have enough time to put more than around 40 min to 1.5 hrs a day to language learning and I want to get fluent ASAP.\n\nIf i decide to study another (which is usually Russian and occasionally other ones that are interesting to me), I make sure to make it brief (maybe around 20% of my time). Altho when my German gets better, I'll most likely try to study two languages at once, but shift my focus on Russian \n\nIf i had all the time in the world, i would most definitely study more languages at once seriously tho.", "created_utc": "1666597556.0", "edited": "False", "id": "itkb6fx", "is_submitter": "False", "link_id": "t3_yc29xo", "parent_id": "t3_yc29xo", "score": "9", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "lingua-discipuli", "body": "I wish I knew early on how amazing the combination of books + audiobook are. Graded readers + audiobook geared at your level are especially useful, and the ones I have test your comprehension after each chapter (and also free through z library website).\n\nIt has the right amount of words I understand but also new words that I can learn. \n\nSame can be said for YouTube content geared towards your level, such as the channels easy languages ones where they actually organize videos according to your level.\n\nI also wished I knew back when I first started to not feel guilty in exploring resources. I know some people say that they spend too much time in searching for resources, but I think in the beginning, that's actually okay to do so for a while. Once you find sources that are really good and enjoyable, it was worth exploring different resources beforehand to find those resources you enjoy and stick with for a long term period", "created_utc": "1666594372.0", "edited": "False", "id": "itk7gmu", "is_submitter": "False", "link_id": "t3_yc0x4p", "parent_id": "t3_yc0x4p", "score": "16", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "lingua-discipuli", "body": "I occasionally do, but I don't particularly make consistent effort to do that bc I haven't noticed making much of a difference. I feel like anything Grammar related I leave to the courses I take or the textbook I occasionally use. Or if I'm speaking/writing with improper grammar, my teacher or my German friend are there to correct me and I take notes on that. It's s natural way to pick up grammar and fun. \n\nAs for the sentences I use, they're sometimes from the book I'm reading combined with a premade frequency words Anki deck that have sentences in them. I feel like if you encounter a word that's not in the premade decks, it's useful to just make your own card and gear it towards whatever vocab you encounter as well", "created_utc": "1666591988.0", "edited": "False", "id": "itk4ip3", "is_submitter": "False", "link_id": "t3_yc0x4p", "parent_id": "t1_itk0vo7", "score": "6", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "lingua-discipuli", "body": "My progress in German skyrocketted when I ditched single word flashcards and did sentence ones", "created_utc": "1666588046.0", "edited": "False", "id": "itjz549", "is_submitter": "False", "link_id": "t3_yc0x4p", "parent_id": "t1_itjrbla", "score": "25", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "lingua-discipuli", "body": "Tbh yeah from my experience, it has useful vocabulary and phrases, and encountered that basic stuff that you mentioned early on, within units 1-2 on the German course", "created_utc": "1666585361.0", "edited": "False", "id": "itjux6l", "is_submitter": "False", "link_id": "t3_ybx7mx", "parent_id": "t1_itjl9xl", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "lingua-discipuli", "body": "Without knowing your target language, it's hard to say.\n\nBut for general courses and useful language, YouTube is a good resource. Frequency lists may also be extremely useful too, albeit learning through frequency list is not organized in a theme like in the app Drops (which if you're by bothered by not learning by themes, then maybe frequency lists is not your thing)\n\nMemrise is pretty useful too for vocab and more useful phrases if you don't want to deal with Anki.\n\nMango is extremely good as a course but it's not available for free for everyone unfortunately.\n\nDW Nicos Weg course/App is extremely useful for German, and I've also used pod101 app, dalubhasa, Tagalog.com were all very useful for Tagalog, a language that doesn't have many apps/courses \n\nFor Bulgarian, bulgaro.io was extremely useful but there's way more amazing courses/apps for different languages", "created_utc": "1666581246.0", "edited": "False", "id": "itjnbvb", "is_submitter": "False", "link_id": "t3_ybx7mx", "parent_id": "t3_ybx7mx", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "lingua-discipuli", "body": "Not sure why people are downvoting you but I myself have used Mango (which is free through my library, OP you should check if it's free in yours) and it's been very good.\n\nI've used it for specially German, and I'd say it's great for vocab, reading comprehension, and speaking.\nIt has a cool feature where you can check your pronunciation and compare your recording to the native speaker's voice with ease.\n\nIt's a great and balanced app and it also uses SRS, making it quite effective. \n\nIt also color codes things in a way that makes it logical and pleasant looking.\n\nEdit: I'd like to add the vocab you learn in mango is very useful as well and not random", "created_utc": "1666579410.0", "edited": "False", "id": "itjjmya", "is_submitter": "False", "link_id": "t3_ybx7mx", "parent_id": "t1_itj3bd7", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "lingua-discipuli", "body": "How are you going about that? \nI've been considering doing that but wasn't sure how effective it would be.", "created_utc": "1666398762.0", "edited": "False", "id": "it9wseg", "is_submitter": "False", "link_id": "t3_y9siuy", "parent_id": "t1_it7e8ra", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "lingua-discipuli", "body": "Somewhat. At my school from 9th to 12th grade, they only offered Chinese and Spanish. \n\nI didn't choose Spanish because I thought it would be a waste of time since I grew up with it, so I chose Chinese and was excited.\n\nHowever, even though I liked the language at the time, I feel like it wasn't a rewarding language at all IMO. I know some basic Chinese, and even though there's a high amount of Chinese speakers here in California, I've never used it. I've needed to use my Spanish much more.\n\nI really wished schools offered more languages. I feel like if I studied any other language I would have progressed into it much faster and would be able to use it now.\n\nHad I known that the Chinese i would learn in my hs would have been useless for me, I would have probably avoided it", "created_utc": "1665960504.0", "edited": "False", "id": "islrht3", "is_submitter": "False", "link_id": "t3_y5avj8", "parent_id": "t3_y5avj8", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "lingua-discipuli", "body": "You should have no issue and it will be useful. IMO it makes such a small difference that it's not worth worrying about\n\nIts kind of like American English accents compared to other English accents (Aussie, Kiwi, British, etc). Everyone can still understand each other perfectly \n\nThe only accent in Spanish that no one can understand is Chilean /s", "created_utc": "1665801108.0", "edited": "False", "id": "isdd5tx", "is_submitter": "False", "link_id": "t3_y3pe1a", "parent_id": "t1_isbduic", "score": "2", "subreddit": "duolingo", "subreddit_id": "t5_2t6ze"}, {"author": "lingua-discipuli", "body": "Yeah ... Thats why i don't think I'll quit fully. I feel like I'd feel too guilty, more than I already do from quitting it completely. 10-15 minutes sounds reasonable and I may start doing that so i don't forget what I've learned", "created_utc": "1665371465.0", "edited": "False", "id": "irpw2bm", "is_submitter": "True", "link_id": "t3_xz26lh", "parent_id": "t1_irprm2t", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "lingua-discipuli", "body": "How do you balance both?\nI have considered just continuing Duolingo for Russian so i don't completely disengage with the language but I'm unsure if that's worth much", "created_utc": "1665267690.0", "edited": "False", "id": "irkb7vp", "is_submitter": "True", "link_id": "t3_xz26lh", "parent_id": "t1_irk757h", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "lingua-discipuli", "body": "This. People make racists jokes regardless of which dialect of Chinese they're hearing.\n\nOnly reason I can distinguish the two is because I learned mandarin from my taiwanese friends. \n\nAnd yeah i agree. Cantonese is underrated and overlooked.", "created_utc": "1664419463.0", "edited": "False", "id": "iqbk2su", "is_submitter": "False", "link_id": "t3_xqnyms", "parent_id": "t1_iqb7j8g", "score": "12", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "lingua-discipuli", "body": "Idk why you're getting downvoted OP, but I have seen a good amount of people outside this subreddit use this type of logic to not learn languages at all (albeit i think being in specific parts of the US makes it so that I encounter such people)", "created_utc": "1664393407.0", "edited": "False", "id": "iq9wpet", "is_submitter": "False", "link_id": "t3_xqkmai", "parent_id": "t3_xqkmai", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "lingua-discipuli", "body": "Community language.\nI grew up with Spanish, but was educated in English all my life and have a much bigger vocabulary in that language versus Spanish.\n\nI think I'd almost consider myself a passive bilingual because in general I tend to avoid speaking Spanish unless I have to. Although when I do speak it, my pronunciation is fine, but I do struggle nonetheless.\n\nMy conversations with my parents in Spanish tend to be repetitive versus the English that is all around me and always changing in topics. \n\nMy parents don't really care that it's the weaker language tho, as long as I still can reply to them in Spanish", "created_utc": "1663964469.0", "edited": "False", "id": "ipmxr2h", "is_submitter": "False", "link_id": "t3_xliq58", "parent_id": "t3_xliq58", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "lingua-discipuli", "body": "Yeah, I will say I do think Romance languages sound beautiful as a whole to me compared to other branches of languages, even if I was put off by that branch of language. I do want to learn a romance language *eventually* but it's really hard to decide for me. At least for other branches of languages, it was easy for me to identify which I liked most to me but perhaps one day I'll decide which romance language to learn", "created_utc": "1663435864.0", "edited": "False", "id": "iotju87", "is_submitter": "False", "link_id": "t3_xft472", "parent_id": "t1_ios8eo9", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "lingua-discipuli", "body": "I can say with confidence that being bilingual didn't deter me or make me less motivated to try to learn another language.\n\nHowever, knowing Spanish made me less interested in learning other romance languages though. \n\nI *used to* study Chinese Mandarin for 4 years, but have stopped am currently learning German and have the desire to learn Russian. All these are interesting to me, and it definitely stems from the fact that they are from different language families and \"new\" to me", "created_utc": "1663388786.0", "edited": "False", "id": "iorbi6k", "is_submitter": "False", "link_id": "t3_xft472", "parent_id": "t3_xft472", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "lingua-discipuli", "body": "I'm also in the states and have been learning German because I also want to travel to Germanic countries.\n\nI've noticed that Spanish and Chinese languages (mandarin & canto) are common languages people speak and I can't find anyone who speaks German at all", "created_utc": "1663130493.0", "edited": "False", "id": "iocthxl", "is_submitter": "False", "link_id": "t3_xdlbgh", "parent_id": "t1_iobpzi8", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "lingua-discipuli", "body": "I used to feel ashamed for chosing German over French as a Spanish speaker because French seems like an obvious choice and everyone else I know seems to favor the French language more", "created_utc": "1663104323.0", "edited": "False", "id": "iob85gd", "is_submitter": "False", "link_id": "t3_xckzlw", "parent_id": "t1_io8d560", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "lingua-discipuli", "body": "Russian, Romanian, Catalan, and Portuguese. Romanian in particular is very unique and underrated but I'm glad to see it's gotten more attention here recently.\n\nI'm thinking of learning Russian seriously after I focus on German, and want to start one of those romance languages as well eventually (not sure which one yet).", "created_utc": "1662746945.0", "edited": "False", "id": "inr8jne", "is_submitter": "False", "link_id": "t3_x9pngp", "parent_id": "t3_x9pngp", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "lingua-discipuli", "body": "This is a really good point that people don't think about. Although Anki is a safe choice, some languages have resources that already incorporate SRS and may be more convenient than Anki.\n\nI haven't used Hack Chinese, but I've used Pleco and preferred it much more than Anki.\n\nOP, not sure if you know already, but I've heard SpanishDict uses SRS as well", "created_utc": "1662667973.0", "edited": "False", "id": "inmugqf", "is_submitter": "False", "link_id": "t3_x936dv", "parent_id": "t1_inm3fwp", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "lingua-discipuli", "body": "My mother watches her! She's great", "created_utc": "1662581318.0", "edited": "False", "id": "inhvce1", "is_submitter": "False", "link_id": "t3_x8d15n", "parent_id": "t3_x8d15n", "score": "9", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "lingua-discipuli", "body": "Mandarin. I studied it for 4 years because of the fact that there was a lot of mandarin speakers around me.\n\nBut having a high amount of speakers on it's own isn't enough to motivate me. I personally didn't like the sound of the language and didn't see a point in continuing when I still wasn't making much progress and stuck around B1. \n\nI kind of regret not looking into other languages right after, instead I didn't start until 4 years later (recently) where I became motivated to learn German to hopefully do my masters there. Albeit the past years I wasn't mentally in a good place until recently which affected my motivation.\n\nI hope I can focus on Russian and Portuguese after...", "created_utc": "1662525865.0", "edited": "False", "id": "inetuuf", "is_submitter": "False", "link_id": "t3_x7srom", "parent_id": "t3_x7srom", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "lingua-discipuli", "body": "Its also broken for me and thought it was just me", "created_utc": "1661915754.0", "edited": "False", "id": "imh66pv", "is_submitter": "False", "link_id": "t3_x22bah", "parent_id": "t3_x22bah", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "lingua-discipuli", "body": "Back when I used to work 2 jobs, I would study during lunch time or a little bit before bedtime since those were the only times I would be free \n\nIf it's more convenient, break your study time in small sessions throughout the day and don't let your busy schedule demotivate you", "created_utc": "1661881915.0", "edited": "False", "id": "imexqn8", "is_submitter": "False", "link_id": "t3_x14chm", "parent_id": "t3_x14chm", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "lingua-discipuli", "body": "**Portuguese**, because as a latina, I'd love to speak to our Brazilian neighbors", "created_utc": "1661740664.0", "edited": "False", "id": "im7j7uu", "is_submitter": "False", "link_id": "t3_wzs3g0", "parent_id": "t3_wzs3g0", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "lingua-discipuli", "body": "Yes, because having noone to use the language with is something you can change.\n\nI myself don't know anyone in person who I could use German with (there are absolutely no German speakers in my location). However, I did contact native German speakers online to practice with and have strong motivation to learn the language as I want to study in Germany", "created_utc": "1661740168.0", "edited": "False", "id": "im7i8aq", "is_submitter": "False", "link_id": "t3_x003q5", "parent_id": "t3_x003q5", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "lingua-discipuli", "body": "**Tagalog** (there are large Filipino communities where I live), an **Occitan** language course (very beautiful language within France, and I wished it was more well known and more spoken), and **Nahuatl** (an Aztec language, associated with natives in Mexico)\n\nI never expect to see these on Duolingo as I understand there is no significant demand for them tho", "created_utc": "1661669741.0", "edited": "1661669973.0", "id": "im3my82", "is_submitter": "False", "link_id": "t3_wzb5q9", "parent_id": "t3_wzb5q9", "score": "3", "subreddit": "duolingo", "subreddit_id": "t5_2t6ze"}, {"author": "lingua-discipuli", "body": "I think that you should drop Spanish and focus on french. You are clearly more interested in French and need it more.\n\nI also think that the time you spent on learning Spanish won't go to waste because of the fact that French and Spanish are both romance languages and do have similarities. Having studied Spanish, it will make French much easier than if you didn't study it.\n\nI myself had to study French and being advanced in Spanish and English gave me an edge over those who only knew English or only knew Spanish. I will say, however, having knowledge of Spanish will not help you with the pronunciation and listening comprehension for French, which I think are the most difficult parts of French", "created_utc": "1661294588.0", "edited": "False", "id": "ilipc5m", "is_submitter": "False", "link_id": "t3_ww1a1y", "parent_id": "t3_ww1a1y", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "lingua-discipuli", "body": "I feel the same way about German! I always felt it sounded majestic and associate it with excitement and it's the first language I chose to learn out of personal interest \n\nMy first foreign language was Chinese due to academic reasons of which I learned some of it but never got it at an advanced level due to it feeling like a chore and lack of desire. I associate it with sadness and fear due to the racism I received from the Chinese community i was in at the time.\n\nI associate Spanish with feelings of nervousness and longing, as it is technically my \"native\" language, but I'm not comfortable speaking in Spanish as i am with English. i still feel warmth hearing it tho and it's just speaking that makes me nervous", "created_utc": "1661072764.0", "edited": "False", "id": "il68fed", "is_submitter": "False", "link_id": "t3_wte6lw", "parent_id": "t3_wte6lw", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "lingua-discipuli", "body": "Depends on what skill(s) you want to expand on since different apps may cater to specific skills", "created_utc": "1661039434.0", "edited": "False", "id": "il4otsh", "is_submitter": "False", "link_id": "t3_wtk1p6", "parent_id": "t3_wtk1p6", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "lingua-discipuli", "body": "Romanian, Catalán, and Occitan (I know there's like 3 different types but I don't have a preference).\n\nAll of these sound extremely beautiful to me. Although I want to focus on German for around 2 years and then Russian after.\n\nI am considering studying one of these since I am advanced in Spanish, so perhaps it wouldn't be too much to add one of those romance languages in my study routine", "created_utc": "1661035109.0", "edited": "False", "id": "il4fkp1", "is_submitter": "False", "link_id": "t3_wthcby", "parent_id": "t3_wthcby", "score": "7", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "lingua-discipuli", "body": "Unfortunately, only Chinese Mandarin is offered in Duolingo", "created_utc": "1660885866.0", "edited": "False", "id": "ikwab7g", "is_submitter": "False", "link_id": "t3_ws553v", "parent_id": "t3_ws553v", "score": "5", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "lingua-discipuli", "body": "It may depend on the country. I still think Russian translators will continue to be paid well in the US though I can't speak for other countries.\n\nPerhaps you can do more research that pertains to your country?\n\nAlso, I don't think the Russian language should always have negative connotations considering Russian is also widely spoken in Eastern Europe.\n\nThere are people who speak Russian who are not inherently associated with Russia's invasion", "created_utc": "1660884872.0", "edited": "False", "id": "ikw8q7t", "is_submitter": "False", "link_id": "t3_ws4rx9", "parent_id": "t3_ws4rx9", "score": "8", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "lingua-discipuli", "body": "I'm currently learning German as well and have found it much easier than Chinese (but i guess after Chinese, everything is infinitely easier).\n\nI tried learning French, but the struggle of listening comprehension of it turned me off, even though I know Spanish pretty well and would be familiar with it's grammar and vocab (with the help of both Spanish and English).\n\nI want to learn Russian as well. Although I'm focusing on German primarily, I've dabbled a bit with Russian and it doesn't seem too intimidating, but still noticeably much harder", "created_utc": "1660884264.0", "edited": "False", "id": "ikw7qg2", "is_submitter": "False", "link_id": "t3_ws1bxp", "parent_id": "t3_ws1bxp", "score": "1", "subreddit": "duolingo", "subreddit_id": "t5_2t6ze"}, {"author": "lingua-discipuli", "body": "I was wondering the same thing. Unfortunately, most people I've met know very little about European countries and languages outside of the popular Western European ones. \n\nIt is unfortunate considering how beautiful and unique of a language Romanian is", "created_utc": "1660772652.0", "edited": "False", "id": "ikppp1j", "is_submitter": "False", "link_id": "t3_wqzctl", "parent_id": "t3_wqzctl", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "lingua-discipuli", "body": "I gave up on Chinese Mandarin after about 4 years of studying it and don't regret it. I spent some money on it on some books and invested time talking to native speakers. I was doing well, but something was off.\n\nIt's a language that I found frustrating and not rewarding as well.\n\nI was learning it because there's a lot of speakers here and was excited to learn something new, but I don't like the sound of the language and I'm not particularly interested in visiting places where Mandarin is spoken. \n\nAt the moment, I've begun to study German and find it much more rewarding and fun and have given myself a timespan of about 2 years before going to Germany.  \n\nI'm still glad I went through all of that though as it made me revaluate and finetune my goals", "created_utc": "1660762490.0", "edited": "False", "id": "ikoym6p", "is_submitter": "False", "link_id": "t3_wqs04d", "parent_id": "t3_wqs04d", "score": "26", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "lingua-discipuli", "body": "I'm glad someone said it. \n\nI used it for Chinese and I had like 40 Chinese guys being all creepy to me. There was only one guy there who was like a 40 yr old legimtately trying to improve his English and correcting my pronunciation well.\n\nAlbeit, I've only experienced it with one language", "created_utc": "1659756134.0", "edited": "False", "id": "ij55fse", "is_submitter": "False", "link_id": "t3_wgu80t", "parent_id": "t3_wgu80t", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}]