[{"author": "Lokar13", "body": "耽美  \n\n\n(okay also cdramas, they are so addicting)", "created_utc": "1666636279.0", "edited": "False", "id": "itmd6y7", "is_submitter": "False", "link_id": "t3_yc3kzx", "parent_id": "t3_yc3kzx", "score": "8", "subreddit": "ChineseLanguage", "subreddit_id": "t5_2qyz1"}, {"author": "Lokar13", "body": "I gave up learning Japanese because..eh lost interest, so I can't really compare the two.   \nBut I just want to mention that holy shit loan words / foreign names are horribly difficult to learn in chinese - katakana is a way better system.", "created_utc": "1666426826.0", "edited": "False", "id": "itb5ov0", "is_submitter": "False", "link_id": "t3_yaf95v", "parent_id": "t3_yaf95v", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Lokar13", "body": "Migaku browser extension has an option to do this when watching shows on netflix / youtube with soft coded subs. It will pause the video so you can read the subtitles for each line, then when play the audio when you resume.\n\nIt's nice for intermediate stages when you need you can't process the language at native speed fast enough.\n\nSounds tedious, but everything eventually clicks and now I've reachd a point where I'll sometimes watch shows at 2x speed, rarely pausing which feels awesome. (There are more cdramas to watch than time to watch them)", "created_utc": "1666301270.0", "edited": "1666301521.0", "id": "it4gqmw", "is_submitter": "False", "link_id": "t3_y8lqtn", "parent_id": "t3_y8lqtn", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Lokar13", "body": "Do something fun like get an iqiyi account (iq.com), use dual subs ([https://chrome.google.com/webstore/detail/dualsub/gnlibmlfpencglodjpgnalbdebfhpmfp?hl=en](https://chrome.google.com/webstore/detail/dualsub/gnlibmlfpencglodjpgnalbdebfhpmfp?hl=en)) so you can look up words with zhongwen pop up dictionary and start getting into chinese dramas. Study a bit every day (Anki / textbook whatever) but the rest of the time have fun and look up words with zhongwen occasionally.\n\nBrowse my drama list to find cool stuff you want to watch. (It helps if you either like crime dramas or romance / historical / fantasy but there is lots out there)\n\nYou'll get motivation if you have fun in the language and enjoy yourself. The more you get into it, the more you'll want to \"study\" till you reach the point where it doesn't feel like studying anymore.\n\nIf all you are doing is reading through a textbook / learning apps or doing anki, you will burnout and lose interest very very quick.", "created_utc": "1666297717.0", "edited": "1666298998.0", "id": "it47qel", "is_submitter": "False", "link_id": "t3_y8q995", "parent_id": "t3_y8q995", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Lokar13", "body": "if you are learning mandarin, you can do this with chinese text analyzer", "created_utc": "1666232571.0", "edited": "False", "id": "it0retg", "is_submitter": "False", "link_id": "t3_y8kc62", "parent_id": "t3_y8kc62", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Lokar13", "body": "i tried that book and didn't care enough to finish it (but i'm focusing on simplified characters)\n\nIf you want to eventually read Journey to the West there are a ton of graded readers out there to prep you for the story. I really like the BLCUP series but it's simplified but longer and meatier than others I have found [https://www.purpleculture.net/graded-readers-for-chinese-language-learners-level-2-literary-stories-journey-to-the-west-1-p-23715/](https://www.purpleculture.net/graded-readers-for-chinese-language-learners-level-2-literary-stories-journey-to-the-west-1-p-23715/). Also read the Jeff Pepper amazon ones, which i think come in traditional! as well as the sinoligua  / pleco edition\n\nAnd Little Fox Chinese has a great Youtube channel that will help with listening practice and getting familiar with the story. [https://www.youtube.com/watch?v=zZHomlS1CrA&list=PLZ27m2K2W5n4iBIDlOzlw6ziD7dl\\_tQhj&ab\\_channel=LittleFoxChinese-Stories%26SongsforLearners](https://www.youtube.com/watch?v=zZHomlS1CrA&list=PLZ27m2K2W5n4iBIDlOzlw6ziD7dl_tQhj&ab_channel=LittleFoxChinese-Stories%26SongsforLearners) Used it as passively listening for a month, it was great! (It's for kids, but hey better than peppa the pig and comprehensible listening input is always needed)\n\nKeep reading a lot and you'll get there eventually! Learning chinese to read books is so so so worth it.", "created_utc": "1666073174.0", "edited": "False", "id": "isrt4gs", "is_submitter": "False", "link_id": "t3_y6o637", "parent_id": "t3_y6o637", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Lokar13", "body": "I randomly watched the Untamed one night about 22 months ago, I loved it so much I read the translated book over like three days.\n\nLoved the book so much I immediately decided I wanted to learn to read Chinese so I read more books like it without relying on bad / sporadic translations.\n\nIt's been 22 months and I've read 7,705,109 million characters of native books and countless cdramas. And i'm about 15% of the way through 魔道祖师 and looking to try to finish it by the end of the year.\n\nReally, learning a language to read (danmei / romance novels) is a super powerful motivator and if you join the Heavenly Path discord I'm sure you would feel right at home!", "created_utc": "1665169052.0", "edited": "1665169520.0", "id": "irfop55", "is_submitter": "False", "link_id": "t3_xxwqa3", "parent_id": "t3_xxwqa3", "score": "16", "subreddit": "ChineseLanguage", "subreddit_id": "t5_2qyz1"}, {"author": "Lokar13", "body": "Yeah it’s a face meant for crying / danmei \n\nIf you have read 2ha he is so perfect for chu wan ning that you start getting his appeal", "created_utc": "1664254058.0", "edited": "1664254269.0", "id": "iq2g3op", "is_submitter": "False", "link_id": "t3_xotkrh", "parent_id": "t1_iq0szwd", "score": "2", "subreddit": "CDrama", "subreddit_id": "t5_34fkz"}, {"author": "Lokar13", "body": "Ohh have you seen 苍兰诀？it is my favorite drama of the year I’m so obsessed \n\nAlso if you love dramas join the heavenly path discord server - I’ll talk your ear off about them", "created_utc": "1664153488.0", "edited": "False", "id": "ipww221", "is_submitter": "False", "link_id": "t3_xkwzdf", "parent_id": "t1_ipkta74", "score": "1", "subreddit": "ChineseLanguage", "subreddit_id": "t5_2qyz1"}, {"author": "Lokar13", "body": "wait dramas are boring?  \n\n\ni'm so addicted.... haha", "created_utc": "1663911467.0", "edited": "False", "id": "ipke95o", "is_submitter": "False", "link_id": "t3_xkwzdf", "parent_id": "t1_ipjfs5b", "score": "2", "subreddit": "ChineseLanguage", "subreddit_id": "t5_2qyz1"}, {"author": "Lokar13", "body": "Ohhh definitely 魔道祖师 (so far) it’s pretty difficult but after 21 months of starting to learn I finally at the point where I’m able to intensively read through it! \n\n2HA (二哈和他的白猫师尊) is tied, but it’s still too hard for me at this point and I haven’t finished it. \n\nHeavenly Path website has huge collection of other cool recommendations and my to be read list is already huge.", "created_utc": "1663862863.0", "edited": "False", "id": "iphg3ek", "is_submitter": "False", "link_id": "t3_xkj094", "parent_id": "t1_ipgb4uz", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Lokar13", "body": "Basically because it’s glorious to read? \n\nThe vast majority of Chinese webnovels aren’t translated, and they are extremely addicting and I want to read them for hours a day. (Plus reading in the original language is divine). And recently getting into audio dramas, which can’t really be appreciated without knowing the language.\n\nAlso I’d like to follow Chinese celebrity / drama news and that takes understanding Weibo / Bilibili which is a whole other level of language learning.", "created_utc": "1663836935.0", "edited": "False", "id": "ipg1uhr", "is_submitter": "False", "link_id": "t3_xkj094", "parent_id": "t3_xkj094", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Lokar13", "body": "I did this for a while as well - i think it's the boredom and frustration of the intermediate phase\n\nI picked up and dabbled with French and Japanese - at first I thought it was really cool and learning all the languages made it all easier because I was in \"polyglot mode\"\n\nAfter I got better and better with Chinese (like can enjoy native content with less struggle), I realized I had a very very long way to go to get to my goals, so I dropped everything else and went back to Chinese 100%.\n\nJust be warned, this is the \"ohh fresh new language\" feeling and your progress will slow down. I personally recommend waiting until you \"easily\" understand and enjoy native content in your TL before adding any more.\n\nBut everyone is different and the main thing is to enjoy yourself! If it motivates you to cycle and do more than one at a time, go for it!", "created_utc": "1663701112.0", "edited": "1663701658.0", "id": "ip8deyr", "is_submitter": "False", "link_id": "t3_xjdux7", "parent_id": "t3_xjdux7", "score": "11", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Lokar13", "body": "I love LingQ (i've been obsessively using it for >550 days now to learn Chinese)\n\n1. I don't use their SRS system, I do Anki on my own, but occasionally mine vocab from what I'm reading\n2. I never really used their content (or others) - I imported my own. Books are great, but use calibre to edit nonsense out / remove DRM (\\*cough z library cough\\*).\n   1. If you love reading webnovels use [https://chrome.google.com/webstore/detail/webtoepub/akiljllkbielkidmammnifcnibaigelm?hl=en](https://chrome.google.com/webstore/detail/webtoepub/akiljllkbielkidmammnifcnibaigelm?hl=en) to make it easier to pull the book from website into an epub.\n   2. If the site blocks copy use [https://chrome.google.com/webstore/detail/absolute-enable-right-cli/jdocbkpgdakpekjlhemmfcncgdjeiika?hl=en](https://chrome.google.com/webstore/detail/absolute-enable-right-cli/jdocbkpgdakpekjlhemmfcncgdjeiika?hl=en)\n   3. If you are learning Japanese, there is a way to remove furigana and convert vertical text to horizontal with calibre so you can import novels.\n3. Get a multi button mouse (I use a Logitech G600) to program macros / key bindings so it's easier to move through vocab / pages.\n4. Listening while reading is really the magic sauce: Their TTS is fantastic if you have nothing else, but I'm finding using native audiobooks is the best.\n   1. Look for audiobooks on youtube, convert it to an MP3 and you can import them in with the text and the software will sync it together. (or just if lazy just use Picture in Picture to have it in the background while reading)\n5. Don't be afraid to hit the translation button, especially in the beginning. It's not a 1:1 perfect translation, but sometimes it just you don't realize you've missed something until ten pages later and you've lost the plot. Just a glance a the translated sentence will let me go \"oh wow\". And it's so quick, you can pause / repeat the audio and keep going without breaking flow.\n   1. Try a tiny sentence version of the L/R method - hit the audio, read along with the native sentence, then hit the audio again while reading the translation (and listening to the TL audio to try to pick out words), then read TL sentence again with the audio. Sounds tedious, but perfect for when you have chosen content that's above your level. (I had no business reading 2HA 8 months after starting Mandarin from scratch...but this method works if you *really* want to read a book)\n6. When you can't actively read, have the audio of content you've previously studied on as passive listening. On the phone, it's got a nice playlist that will track the text with the audio so you can glace down and follow along but can also multi task and not get lost if you aren't 100% paying attention.\n7. Join your TL language challenge every month for at least a year or two and try to stay to the top 10 (some languages are more popular than others.) And keep your streak! \n   1. It's easier to score \"coins\" in the beginning, but you have to do a lot of reading / listening to acquire a language. So, after than initial fun beginner stage, sticking with the challenges over the long haul gives you motivation to keep reading more and more to stay in the rankings. It seems petty, but I've seen so many users shoot up, stick around for a couple months, then disappear.\n8. Repeat lessons, content if you love it, but otherwise just keep going. Your brain will absorb what it wants too, don't stress and enjoy yourself!", "created_utc": "1663038907.0", "edited": "1663040384.0", "id": "io7mq0j", "is_submitter": "False", "link_id": "t3_xcdoot", "parent_id": "t3_xcdoot", "score": "9", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Lokar13", "body": "my theory that reading / writing a lot of romance literature is a fantastic way to get good at a language\n\neveryone, please stop \"studying\" with the news, go enjoy yourself and read some fanfiction / webnovels", "created_utc": "1663035293.0", "edited": "False", "id": "io7em5m", "is_submitter": "False", "link_id": "t3_xcfxqr", "parent_id": "t1_io56f3s", "score": "16", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Lokar13", "body": "Okay yes! I got headaches most days studying my first year, but the next day I’d come crawling back for more. \n\nIf I don’t end the night with blurry vision and a melted brain, I don’t think I’ve listened & read enough.\n\nNow that I’m able to enjoy more and more native media, with government censorship / banning of beloved content (皓衣行 😢), it’s an entire world of grief I didn’t know existed within me, but I wouldn’t change languages for the world.\n\nI think that’s why the Chinese language learning community is so nice, you just want to give other learners hugs since you know what they’ve been through.", "created_utc": "1662973718.0", "edited": "1662974539.0", "id": "io3od4o", "is_submitter": "False", "link_id": "t3_xbi6cm", "parent_id": "t1_io0mf92", "score": "5", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Lokar13", "body": "Join us! \n\nLearning Chinese has been one of the most rewarding decisions I’ve made. Plus, shows 99% of the time have subtitles unlike Japanese. And if you love reading books with fantasy and / or sword fighting you’ll never run out.", "created_utc": "1662872072.0", "edited": "False", "id": "iny7stc", "is_submitter": "False", "link_id": "t3_xaxbxd", "parent_id": "t1_inxswjy", "score": "8", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Lokar13", "body": "It’s really true - the Chinese language learning community is very very friendly and helpful! Probably because it’s so difficult but enjoyable we want people to get over the initial horror of tones / hanzi, and to convince people that yes, you can eventually learn Chinese if you study long enough.\n\nI only get mad 😡 at posts that say there isn’t any good shows / movies / books in Chinese to consume  (I see this all the time on Reddit) -I feel like that’s kinda a huge disservice to the incredible amount of available content out there - and if you are learning a language you should be open to its culture and media output.", "created_utc": "1662871329.0", "edited": "1662871863.0", "id": "iny6kax", "is_submitter": "False", "link_id": "t3_xaxbxd", "parent_id": "t1_inw9yrz", "score": "8", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Lokar13", "body": "I can personally attest that reading lots of danmei has significantly improved my reading comprehension.", "created_utc": "1662483199.0", "edited": "False", "id": "inc1u6d", "is_submitter": "False", "link_id": "t3_x798ls", "parent_id": "t3_x798ls", "score": "8", "subreddit": "ChineseLanguage", "subreddit_id": "t5_2qyz1"}, {"author": "Lokar13", "body": "Oh I can’t wait to - I’m reading a lot of wuxia / xianxia and it’s full of poetic allusions. I bought “Classical Chinese for Everyone” and once I feel comfortable I’m going to start incorporating at least some poetry study, then move into classic works. \n\nThat’s the endless fun of Chinese, there is a bottomless well of literature and the more you learn, the more you realize how much there is read.", "created_utc": "1661790758.0", "edited": "False", "id": "im9vq8c", "is_submitter": "False", "link_id": "t3_x05jin", "parent_id": "t1_im855mh", "score": "4", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Lokar13", "body": "Yes, it's 100% the reason I'm learning Mandarin. There is an vast world of untranslated literature that is only accessible if you know the language, and the translations that are available are mostly garbage. \n\nBut lately I've been trying to improve my neglected listening ability since I do think it helps with the \"inner reading voice\" and because I want to listen to audiobooks when I'm actively doing stuff (chores / work). If it's not a dead language, I do recommended reading while listening to TTS or audiobooks - it'll help with comprehension and reading speed.\n\nBut yes, you don't need to worry about output and I think you have to worry a lot less about drilling the boring stuff (like grammar ugh) if you don't care about speaking.", "created_utc": "1661724230.0", "edited": "1661724466.0", "id": "im6kemw", "is_submitter": "False", "link_id": "t3_x05jin", "parent_id": "t3_x05jin", "score": "18", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Lokar13", "body": "Hilariously enough my husband (who doesn't know any Chinese) has become obsessed with everything Monkey King since I started learning the language. I think he has tried to watch every movie or show that's been released in the past twenty years and is reading the English translation of Journey to the West. It's really adorable.\n\nIf this ever comes out, he'll be so happy.\n\nI hope there is an easy difficulty mode because I suck at action games and it does look fun.\n\nAlso I wonder if Tang Seng shows up and yells at you every time you kill a boss.", "created_utc": "1661579650.0", "edited": "1661579929.0", "id": "ilyx356", "is_submitter": "False", "link_id": "t3_wxzse8", "parent_id": "t3_wxzse8", "score": "2", "subreddit": "ChineseLanguage", "subreddit_id": "t5_2qyz1"}, {"author": "Lokar13", "body": "Oh there is an entire world of webnovels which are great once you get into them. \n\nI think people dismiss them as low brow fiction, but dickens and a lot of 19th century authors etc etc all wrote serialized fiction for newspapers and magazines, so it’s almost a revitalization of that. \n\nIt’s hard to recommend specific books to random people as you have to find your niche, but I think there is stuff out there for almost every taste - a lot of trash sure, but a lot of absolute diamonds.\n\nEventually I’d like to read Classical Chinese / poetry, but that’s a massive intellectual undertaking years from now.", "created_utc": "1661524511.0", "edited": "1661525030.0", "id": "ilvi44w", "is_submitter": "False", "link_id": "t3_wxi4ve", "parent_id": "t1_ilv9e95", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Lokar13", "body": "After about 10k pages in Chinese, I rarely get reading headaches anymore and it's just way easier and faster. But yeah, 10k pages in Chinese didn't mean hitting the mythical 98% comprehension with rarely looking up words (it's getting there for some easier novels, but harder historical fantasy it's still sometimes 90-93% and I use a massive amount of SRS).\n\nI almost feel like there's a multiplier for the more difficult languages (or I have a learning disability haha), and since Class V languages take \\~3.5x longer than Class I languages (FSI estimates), I made my new goal to read 40k pages (20m characters) in Chinese novels and see where that gets me. But I've given up dreams of polyglottism and just want to get really good at my TL in the next couple of years.", "created_utc": "1661481253.0", "edited": "False", "id": "iltj92u", "is_submitter": "False", "link_id": "t3_wxi4ve", "parent_id": "t1_ilrzsal", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Lokar13", "body": "I don’t because I’m addicted to my TL’s media and it’s all I want to do. The better I get, the more stuff I discover and want to consume.\n\nSome days I don’t add new anki cards, but I’ve never skipped a day of reading, and when I’m burnt out I just watch a lot of TL TV.\n\nSince I’ve started learning I’ve had bad days (deaths in the family, sickness, driving 6+ hours and getting tattooed for 2+ hours, working 12 hour shifts in a hospital during the height of COVID) so I get it, but that’s why I think it’s important to really love the language and media you are learning so it isn’t a burden, but a joy.", "created_utc": "1661417954.0", "edited": "1661418272.0", "id": "ilpkt7k", "is_submitter": "False", "link_id": "t3_wx4ax5", "parent_id": "t3_wx4ax5", "score": "5", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Lokar13", "body": "Yeah my listening comprehension is really behind my reading comprehension, so I've been doing the audiobook + reading (with 斗罗大陆 - it's so long hahah) and i've already feel like I'm improving. I was usually mostly dramas, but the density isn't as good as audiobooks.\n\nOP - do you use Chairman's Bao? Like go through as many articles as you can stand (they have thousands) with the audio.", "created_utc": "1661204802.0", "edited": "False", "id": "ildksrn", "is_submitter": "False", "link_id": "t3_wv0ne8", "parent_id": "t1_ilct94o", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Lokar13", "body": "Check out the [Heavenly Path](https://heavenlypath.notion.site/heavenlypath/Heavenly-Path-d9be1806465b4525afeb132d1079194c) site - they have a guide section that’s geared towards learners with a lot of collected resources and I wish I would have know about it when I started.\n\nWhat’s nice about Chinese dramas is that you can always find a version to watch with subtitles. As much as I like Japanese, finding subtitles for their content is a pain in the ass most of the time.", "created_utc": "1660843768.0", "edited": "1660844104.0", "id": "iktkez1", "is_submitter": "False", "link_id": "t3_wrgi43", "parent_id": "t1_iktfmar", "score": "6", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Lokar13", "body": "It was exhausting for the first year (got mental burnout a lot from pushing myself), but now that I'm in an easier stage of Mandarin (still miss complex plot details, but I can get the gist of most things I consume with looking up words) - I can \"immerse\" all day and not get bored or tired.\n\nIf you are a huge fantasy nerd, Mandarin is an endless fountain of content, it's hard to even keep up with the release schedule / backlog of dramas I want to watch, not to mention I've found audio dramas, donghuas, manhuas and of course ridiculously long webnovels (thousands of pages is not abnormal) I want to read.\n\nI'm basically consuming media all day everyday (with some SRS), and I feel like a kid binge eating in a candy store. It's so great!\n\nI fell in love with the sound so I think it's a beautiful language, plus the chinese characters are so fascinating and like an endless puzzle with different combinations waiting to be solved.\n\nEvery time I'd get a study routine for any other language, I'd get bored within a couple of weeks and drop them (been cycling through Spanish, French, Japanese) - one day I might pick another one to stick with, or maybe not?", "created_utc": "1660840259.0", "edited": "1660841262.0", "id": "iktbefi", "is_submitter": "False", "link_id": "t3_wrgi43", "parent_id": "t3_wrgi43", "score": "16", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Lokar13", "body": "Keep going. I know, it sucks and you feel stupid, but that’s normal for most people, especially those learning a difficult language. Eventually those cards will stick. It’s a grind, and treat anki like getting up a running five miles a day, it’s really hard in the beginning, but eventually you get used to it and see the benefit. The beginner level is just horrible, but if you get past it and are able to start reading a lot, words get easier and easier to remember.\n\nEvery now and then take some days off where you don’t add new cards, but always do your reviews. You’ll figure out where you burn-out point is in terms of new cards / reviews a day and how to customize cards that’s best for you to remember (it’s not the same for everyone! I hate cloze deletions and always put audio on the front alongside hanzi & sentences)", "created_utc": "1660759733.0", "edited": "1660760080.0", "id": "ikor8bl", "is_submitter": "False", "link_id": "t3_wqv5jf", "parent_id": "t3_wqv5jf", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Lokar13", "body": "I tried that - that book is sooo boring, haha. I feel like that's why people never get in the habit of reading and stop after a book. I am learning Mandarin to read webnovels, so my tastes are probably nerdier than normal.\n\nBasically I've been picking up books based on Cdramas that I've liked. That way I'm familiar with the plot, so if I get lost, it's not a big deal to figure out the gist of what is going on. I have a high tolerance for reading pain and use LingQ, but I know that's not the case for everyone. \n\nI'm currently reading through 苍兰诀, which is not too bad for a xianxia, it doesn't have a wall of chengyus and it's really cute, so I'll probably read more of the author's works. The Cdrama has some of the coolest art direction I've seen, so I'm kinda obsessed. But if you don't like romance or fantasy, probably not suitable.\n\nI really like 斗罗大陆 as a first big book since there is a Cdrama, a donghua, an [audiobook](https://www.youtube.com/watch?v=u9QJhUhDp08&list=PLxak_2LR4viUGok1TIq1JHEtGBfBB7Ld_&ab_channel=%E5%90%AC%E4%B9%A6%E9%A2%91%E9%81%93%E6%9C%89%E5%A3%B0%E5%8A%A8%E6%BC%AB%E5%B0%8F%E8%AF%B4) and the plot is simple enough to follow and it's so ridiculously long and the vocab repeats a lot, by the time you read a lot of it, it'll get easier and easier. I saw a post the other day that someone passed HSK 6 by reading through it, and I totally believe it.\n\nPlease, please take a look at the [Heavenly Path](https://heavenlypath.notion.site/Webnovels-Books-29ee006777bd4d9fbbd0ea5eb29ec514) site, they have really good recommendations based on levels, and the books they have are way more interesting and fun. Plus they have a very active discord server full of people that are heavy readers (especially of danmei haha)", "created_utc": "1660674416.0", "edited": "1660675642.0", "id": "ikjwiyt", "is_submitter": "False", "link_id": "t3_wpa4nc", "parent_id": "t1_ikgad80", "score": "5", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Lokar13", "body": "1. Read a lot (like 10,000 pages of native content is a good intermediate goal, then move on to 100 books, but don't stop there)\n   1. (I'm at >10k native pages in Mandarin, and while it's *way easier* to read than before, it's still a far cry from native like proficiency).\n2. Read a lot while listening to audio books\n3. Read a lot of very easy material (or something you enjoy) over and over again to help reading speed\n4. Read more challenging books, but use helpers like LingQ or kindle so you can look up words easily.\n5. Read a lot of a variety of things (news, fiction, different genres, wikis, blogs etc)\n6. When watching TV / video / youtube, try to always have TL subtitles on\n7. Maybe add on SRS like Anki to help solidify less frequent vocab you come across in your readings.\n8. ***Read a lot*** *(>*1-2 hours a day for years, every day if you have time)\n   1. I know native speakers that have trouble reading, because they aren't in a reading habit.", "created_utc": "1660599093.0", "edited": "1660599723.0", "id": "ikfqmst", "is_submitter": "False", "link_id": "t3_wpa4nc", "parent_id": "t3_wpa4nc", "score": "24", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Lokar13", "body": "Yes but the mass immersion approach usually also involves a lot of Anki reps using sentence mining and pausing and rewinding content to watch over and over again. It’s not the same as what the Thai school does, it’s much more intensive. And a lot of the stories I’ve seen usually also include a lot of reading for hours a day either of manga or light novels, not just watching raw anime.", "created_utc": "1660587900.0", "edited": "False", "id": "ikexecu", "is_submitter": "False", "link_id": "t3_woxb17", "parent_id": "t1_ikef8tb", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Lokar13", "body": "Not to mention I have found for the books I want to read, 10,000 words still isn’t close enough to 98%\n\nAnki helps bridge the gap between learners materials and native content \n\nSome books I’ve stuck in Chinese text analyzer have 25-27,000 unique words. HSK 6 (graded readers stop there) cover 40% of the vocabulary \n\nMigaku (anki add on) says I know >13k words (I know more but that’s just what I have reviewed in anki) but I’m still hovering at ~93 to 96% known words in easier native books meant for teens. \n\nTo get to a comfortable reading level for native books takes a lot of vocabulary and it’s way way easier to maintain when doing a lot of reading combined with SRS.\n\nI don’t know how else to memorize thousands of idioms and chengyus in Chinese without it take a decade to be able to read books for fun without anki\n\nAnd it does work! There has been countless times where I’ve seen a word over and over again in reading and got frustrated that it didn’t stick - so I check my deck and it’s not there. Then once I make a card, then I don’t need to look it up anymore!", "created_utc": "1660509781.0", "edited": "1660511340.0", "id": "ikar16u", "is_submitter": "False", "link_id": "t3_wnxdva", "parent_id": "t1_ik9rici", "score": "6", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Lokar13", "body": "i don't really remember learning that much vocab / helpful grammar in school besides dreaded spelling tests (still can't spell great).\n\nbut i was an obsessive reader (parents taught me before school did) and always had a much richer vocabulary that whatever school was trying to teach. It wasn't till I placed out of normal school into college track courses in high school that I felt I actually was learning vocab that I hadn't encountered before (mostly science, math and technical terms).\n\nReading a lot > school (for acquiring vocab / grammar). And I've written more online / emails than I ever did for formal essays (which I have never had to do since graduation haha)", "created_utc": "1660251745.0", "edited": "1660252056.0", "id": "ijwqc1m", "is_submitter": "False", "link_id": "t3_wm045t", "parent_id": "t3_wm045t", "score": "5", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Lokar13", "body": "If this was your main goal, I’d focus on learning the first 2-3k hanzi frequency with SRS, HSK 1-4 vocab, some basic graded readers like Mandarin Companion and read through all set learning grammar wiki while watching a lot of little fox Chinese, and moving on tv? \n\nI have no idea how many hours that will take you? But that’s a good base for immersion in native content \n\nI love dramas, and I’ve watched near 1800 hours of them so far, but massive reading + SRS and looking up lots of vocab has also helped tremendously.", "created_utc": "1660111236.0", "edited": "1660111584.0", "id": "ijoochd", "is_submitter": "False", "link_id": "t3_wkkcz2", "parent_id": "t3_wkkcz2", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Lokar13", "body": "I don't have strict rewards (because how much I understand still varies wildly depending on the day / content / how I'm feeling.\n\nBut last month I hit a big milestone for reading (>10,000 native pages read), so I bought myself a lot of inexpensive calligraphy tools because I finally feel like I'm ready to really work on handwriting chinese characters - not because I think it'll help my main goal (being able to read...I can recognize the hanzi, but can't write them well), but because it's fun and relaxing and I want to dabble in it. Well, and a year of Tencent subscription so I can binge watch dramas the day they come out...\n\nI\"ll probably continue buying tea, tea sets, and writing supplies everytime as a treat everytime I hit a \"reading milestone\".\n\nMy next big one is 10million characters read in native books  (\\~20,000 pages based on some estimated math). I'll probably splurge on something fun, but I don't know what I really want yet. Honestly, it'll probably be trying to practice shadowing & speaking more, and memorize a lot of poetry...heheh", "created_utc": "1660072446.0", "edited": "1660072981.0", "id": "ijmai43", "is_submitter": "False", "link_id": "t3_wk2x43", "parent_id": "t3_wk2x43", "score": "9", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Lokar13", "body": "Now that I’m really in deep with learning Mandarin, it really doesn’t work as an international universal language. The way loan words and western names are translated are…it’s not great. Capital letters and spacing are very important for recognizing proper nouns (important for a universal language)\n\nNot to mention tones are very hard for people not used to tonal languages\n\nThe characters are really cool, and there is a place for learning universal meanings, but so much of the radicals are wrapped up in pronunciation", "created_utc": "1659908306.0", "edited": "1659908536.0", "id": "ijd2989", "is_submitter": "False", "link_id": "t3_win0v3", "parent_id": "t1_ijchcz9", "score": "5", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Lokar13", "body": "I love them so so much as well. I haven’t watched anything else except a handful of Japanese BL dramas since I randomly encountered the Untamed on fateful night.\n\nAccording to my drama list I’ve watched > 1500 episodes in about 20 months…which I justify by learning mandarin hahaha 😝", "created_utc": "1659840747.0", "edited": "False", "id": "ij9k7rw", "is_submitter": "False", "link_id": "t3_wi3z9d", "parent_id": "t3_wi3z9d", "score": "5", "subreddit": "CDrama", "subreddit_id": "t5_34fkz"}, {"author": "Lokar13", "body": "Currently doing this with the untamed 陈情令for Chinese. Using SRS to mine for vocab / sentences and listening to the compressed audio passively (migaku extension is wonders for this)\n\nIt’s great because it’s one of my favorite shows in the world and I want to understand it 100% anyway so I don’t mind watching episodes over and over again. It is slowly helping improve my listening skills (along with subtitled audio dramas)", "created_utc": "1659839690.0", "edited": "False", "id": "ij9i5r1", "is_submitter": "False", "link_id": "t3_wh4pwx", "parent_id": "t3_wh4pwx", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Lokar13", "body": "Migaku (paid) but you can make anki cards", "created_utc": "1659839369.0", "edited": "False", "id": "ij9hj80", "is_submitter": "False", "link_id": "t3_wgw9dj", "parent_id": "t3_wgw9dj", "score": "1", "subreddit": "ChineseLanguage", "subreddit_id": "t5_2qyz1"}, {"author": "Lokar13", "body": "ShareX has an ocr reader! There is a set up instructions on the heavenly path website, but it’s changed a little from the update.\n\nAnd use zhongwen pop up dictionary if the subtitles aren’t hard coded (works with Netflix or dual sub chrome extension on iqiyi / YouTube)", "created_utc": "1659832452.0", "edited": "False", "id": "ij93iy6", "is_submitter": "False", "link_id": "t3_wh9abk", "parent_id": "t1_ij6511q", "score": "2", "subreddit": "ChineseLanguage", "subreddit_id": "t5_2qyz1"}, {"author": "Lokar13", "body": "Soo in my experience is that I kinda did a version of L/R for the first couple months as a transition from graded readers to native books at the 6-7 month point of hardcore studying.\n\nWhen I was starting to do it, I already had crammed about 2k hanzi and read *a lot* of graded readers (like every single mandarin companion / chinese breeze / duchinese lesson HSK 1-4, etc etc).\n\nUnfortunately,  (and by all means play with it, I am not an expert) I think the LR system only works if you have the writing system down. I've seen some rare anecdotes that people have learned some Japanese while doing it, but Japanese has kana which can be learned in a day and isn't tonal, with a mess of similar sounding words.\n\nBut anyway, what I did was use LingQ. I imported a book I really wanted to read, then I read a a good translation of a chapter before hand. LingQ has a sentence mode where you can go line by line through, hitting the text to speech, reading through the chinese, then reading through the auto translated sentence while listening to the Chinese, then reading through the chinese again. I did this for 4+ hours a night for a couple months (some days I got burnt out and just watched cdramas), then eventually slowly transitioned from not using the text to speech and using the translations less and less. I also did about 3 hours of Anki SRS and learned about 10 hanzi everyday for the first year, (now i'm down to 2 hours haha...a lot of chengyus have be learned - you may not need to do this much, I swear I have some kind of Chinese language learning disorder)\n\nI enjoyed doing it because I really wanted to read (2HA / danmei) and not because it was efficient. If you want to learn to read faster, I'd really recommended focusing on reading through beginner texts like Mandarin Companion first.\n\nBut for your original question, try 斗罗大陆 if you like fantasy. There's a drama, donghua, and audiobook, it's been translated, plus the book is ridiculously long so if you manage to finish it, your chinese will improve.", "created_utc": "1659803614.0", "edited": "1659835765.0", "id": "ij7awfh", "is_submitter": "False", "link_id": "t3_whkdgw", "parent_id": "t3_whkdgw", "score": "3", "subreddit": "ChineseLanguage", "subreddit_id": "t5_2qyz1"}, {"author": "Lokar13", "body": "I'm kinda salty about it. Not sure what their thinking is. It's basically a form censorship, limiting what people can count as \"book\".\n\nThe problem is that I'm learning Chinese and a lot of very very popular books (thousands / millions of readers, adapted to huge budget drama productions) are written as webnovels, which apparently don't count since they don't have an ISBN, so I'm having trouble getting them added to goodreads.\n\nI don't think having to be \"officially published\" should be a standard by which one defines what a book is. It's very limiting, especially because of the explosion of webnovels and webcomics.\n\nAnd if people can't add books they are reading to a reading tracking site easily, the site becomes useless very quickly.", "created_utc": "1659562622.0", "edited": "1659562932.0", "id": "iiu38qt", "is_submitter": "False", "link_id": "t3_wez43j", "parent_id": "t1_iituc18", "score": "8", "subreddit": "goodreads", "subreddit_id": "t5_2s3cx"}, {"author": "Lokar13", "body": "Haha I just did this the other month because of the dumb policy changes around adding books.\n\nIt was totally worth it because the tags and organization is better in notion. \n\nI used Goodreads for 10+ years, I am assuming they are trying to kill their own website- that’s the only thing I can think to explain what they are doing lately.", "created_utc": "1659545876.0", "edited": "False", "id": "iisy6px", "is_submitter": "False", "link_id": "t3_wez43j", "parent_id": "t3_wez43j", "score": "12", "subreddit": "goodreads", "subreddit_id": "t5_2s3cx"}, {"author": "Lokar13", "body": "So you are dismissing the entire countries artists, writers and creators because of the government? This reasoning also means no good media was produced under the Soviet government either? You are also aware that writers write on different platforms and websites outside of govt censorship?\n\nAlso media doesn’t have to be masterpieces for people to enjoy. There is a lot of garbage on Netflix made outside of government control and people still watch it. I really disapprove of the censorship, but blanket shitting on an entire country’s media is honestly just being racist. There’s a difference between “I don’t care for this” and “it’s all bad and nobody outside China would like it”", "created_utc": "1659363005.0", "edited": "1659363567.0", "id": "iiic8wt", "is_submitter": "False", "link_id": "t3_wcr3y4", "parent_id": "t1_iii0dsd", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Lokar13", "body": "What? Mainland Chinese media is fantastic…are we watching / reading the same content?", "created_utc": "1659315651.0", "edited": "False", "id": "iiga08v", "is_submitter": "False", "link_id": "t3_wcr3y4", "parent_id": "t1_iiffkl2", "score": "4", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Lokar13", "body": "Chinese has a ton of amazing media! Tv, movies, anime, books, music. You probably just haven’t looked in the right places…\n\nWhere are you looking and what do interests you? Netflix has a very limited selection. Browse through iqiyi, tencent, youku and mydrama list to find shows. If you don’t like historical, fantasy, gaming, sports or romance, there are suspense shows like the light on series on iqyi, family dramas, slice of life or even lots of reality shows. Have you watched the bad kids? Or joy of life? \n\nGet into reading webnovels and you’ll have more stuff to read than time to read it.\n\nReset was really popular this year and since it’s time travel it repeats dialogue, and it’s based on a book so 2 for one!\n\nMy husband doesn’t understand Chinese but he is now into watching a lot of YouTube of Chinese people broadcasting “simple country living” style since it so soothing to watch. Most of those videos are subtitled.\n\nIf you like audio dramas, check out sites like 猫耳 FM (also usually subtitled).\n\nChinese media doesn’t try to appeal to an international audience, so there is a little bit of context and learning you have to do to really start to appreciate what’s going on. But if you give it a chance, I swear you’ll find rewarding material!", "created_utc": "1659315213.0", "edited": "1659320753.0", "id": "iig949x", "is_submitter": "False", "link_id": "t3_wcr3y4", "parent_id": "t3_wcr3y4", "score": "5", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Lokar13", "body": "Wait, why didn’t you mention the show? I started reading it because of the show ended on a cliffhanger and tang San played by Xiao zhan 😍", "created_utc": "1659312347.0", "edited": "False", "id": "iig3a7t", "is_submitter": "False", "link_id": "t3_wcqk1m", "parent_id": "t1_iifr3gt", "score": "1", "subreddit": "ChineseLanguage", "subreddit_id": "t5_2qyz1"}, {"author": "Lokar13", "body": "错, 错, 错!: Wrong, Wrong, Wrong! By Chinese breeze \n\nThere are a couple of more murder mystery in that series of graded readers (other are super boring)\n\nAlso try to the smiling cat series 笑猫日记 as a first read (kid books) when you get better. It’s reads like cozy mystery", "created_utc": "1659307820.0", "edited": "False", "id": "iifttd5", "is_submitter": "False", "link_id": "t3_wcgixp", "parent_id": "t3_wcgixp", "score": "2", "subreddit": "ChineseLanguage", "subreddit_id": "t5_2qyz1"}, {"author": "Lokar13", "body": "Hahah yeah that book is so ridiculously long and it’s been adapted so many times that’s it’s basically like reading the entire Harry Potter series, but 2x. (The word count on Harry Potter is 1.6million, but 斗罗大陆 is 2.9million I think?) I’m only on chapter 149 but I’m making a push to finish by the end of the year (along with my other pile of books I’m reading)", "created_utc": "1659306556.0", "edited": "False", "id": "iifr3gt", "is_submitter": "False", "link_id": "t3_wcqk1m", "parent_id": "t3_wcqk1m", "score": "4", "subreddit": "ChineseLanguage", "subreddit_id": "t5_2qyz1"}, {"author": "Lokar13", "body": "It’s very very effective to read interesting content. Krashen would approve.", "created_utc": "1659306112.0", "edited": "False", "id": "iifq4v2", "is_submitter": "False", "link_id": "t3_wcuofm", "parent_id": "t1_iifp8zi", "score": "7", "subreddit": "ChineseLanguage", "subreddit_id": "t5_2qyz1"}, {"author": "Lokar13", "body": "don't add new cards when you feel burnout but always keep up with your reviews.  SRS is super useful, so i really recommended sticking with it if you can stand it (it's near mandatory for japanese / chinese, but you might get away with not using it if you are learning a romance / german language).  i read for hours and hours a day and it's still really important for drilling in low frequency words.\n\nthink of it as a shortcut or boost to get you to the fun part of language learning - consuming and understanding native content.", "created_utc": "1659049954.0", "edited": "1659050999.0", "id": "ii21187", "is_submitter": "False", "link_id": "t3_wakvpy", "parent_id": "t1_ii1m6cp", "score": "5", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Lokar13", "body": "watch a lot of target language tv\n\nthis is why it's super important that you pick a language that you actually love consuming TL media (or learn to). everytime you get burnout, you can relax and just watch a lot of tv / videos / simple fun trashy stories. eventually, you are re-inspired to look up grammar, read intensively, practice listening, pronunciation etc.\n\ni don't know what people do if they don't enjoy their TL's media", "created_utc": "1659049769.0", "edited": "False", "id": "ii20mdc", "is_submitter": "False", "link_id": "t3_wakvpy", "parent_id": "t3_wakvpy", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Lokar13", "body": "That stage between 1 and 2 is the hubris point \"peak of mount stupid\", where you've completed a lot of textbooks / graded readers and are comfortable with beginner stuff and think you have the hang of the language. This is when a lot of people start dabbling in other languages (i did it too), because they \"get language learning\" and it's oh so fun. Then you start actually consuming real adult native content and the first *really* bad crash happens \"valley of despair\".\n\n[The Dunning–Kruger effect](https://medium.com/@mike.dudkey78/ladies-and-gentlemen-here-comes-the-dunning-kruger-effect-f31b09d52573) is so interesting, and I constantly see it in Chinese language learners around \\~HSK4. When you realize that nope, native content is actually insanely hard and you really do have to learn tens of thousands of vocab words to read / consume media easy.", "created_utc": "1658869939.0", "edited": "1658870146.0", "id": "ihrmr79", "is_submitter": "False", "link_id": "t3_w8furc", "parent_id": "t3_w8furc", "score": "6", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Lokar13", "body": "oh thank you so so much!\n\nyeah the OCR space thing seems weird, it didn't used to do that. I hoping that'll get fixed in the future. (Apparently it's a known issue because they use Microsoft's OCR engine)\n\nAt least now I don't have to fiddle with texthooker and clipboard inserter.", "created_utc": "1658291369.0", "edited": "1658291692.0", "id": "igvktqi", "is_submitter": "False", "link_id": "t3_w3bl5w", "parent_id": "t1_igvhsk0", "score": "1", "subreddit": "LearnJapanese", "subreddit_id": "t5_2qyls"}, {"author": "Lokar13", "body": "French and Spanish. I took French in high school, so I always dabble in it occasionally, because I feel like it's \"easier\" and I could get to a high reading level. But I have no interest in French books or media.  Spanish, I dabbled a bit as well because I work with about half a dozen Spanish speakers and could actually use the language in real life...but again no actual interest.\n\nNow that my Mandarin level is getting more and more solid (can understand a lot of audio dramas with subtitles now!) I'd much rather spend the time learning Japanese instead. At this point, I think the dabbling with romance languages was because the Japanese intimidated me (failed learning it a couple years ago.)\n\nI want to get really good at learning a language enough to consume native content, and that takes a LOT of time and input, so I'm fine with cutting romance languages completely out, since there isn't enough time in the day.", "created_utc": "1658077201.0", "edited": "1658077513.0", "id": "igjbwbb", "is_submitter": "False", "link_id": "t3_w18hhn", "parent_id": "t3_w18hhn", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Lokar13", "body": "same for chinese...the old HSK 6 is not close to C2. and the hours graph on the right is stupid / misleading since languages take different amounts of time depending on the category, what other languages the learner knows.\n\nWhoever made that graph had no clue what they were doing.", "created_utc": "1657053913.0", "edited": "1657054110.0", "id": "iezmyi9", "is_submitter": "False", "link_id": "t3_vs0whs", "parent_id": "t1_ieye6z1", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Lokar13", "body": "[Sustained Flow: Affective Obsession in Second Language Learning](https://www.ncbi.nlm.nih.gov/pmc/articles/PMC6987433/) is the best article I've read. Fascinating stuff, and once you realize how to get into the \"Flow\" language learning is really addicting and rewarding. It's more about detailing the states of people that are highly motivated, and not really reproducible to the 15 min a day crowd.", "created_utc": "1656826450.0", "edited": "1656827895.0", "id": "ienznut", "is_submitter": "False", "link_id": "t3_vpzv3f", "parent_id": "t3_vpzv3f", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Lokar13", "body": "That's so impressive! Especially since you did it with paperback books and no flashcards.\n\nMy goal is basically the same (except I also tracking pages / words read as well, since some books are 100 pages and some books are 2500 haha)\n\nI am with you on not reading translated books as they are \"off\", but eventually I gave into the \"read Harry Potter\" meme and it has been helping my reading speed.\n\nThis post makes me really want to learn Spanish now...(I'm saving it for later)\n\noohhh and you read 2666  / Los detectives salvajes  in it's original language... i'm super jealous", "created_utc": "1656556134.0", "edited": "1656558570.0", "id": "ie9pf79", "is_submitter": "False", "link_id": "t3_vnww9e", "parent_id": "t3_vnww9e", "score": "6", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Lokar13", "body": "I resisted it at first, since I had trouble with the loan words / foreign (western) names, but now I get why it's a language learning recommendation. Since I'm familiar with the story reading is a lot faster and I'm definitely seeing improvements as I finished the first two books. (Diagon alley chapters are still a nightmare though)", "created_utc": "1656472873.0", "edited": "1656473156.0", "id": "ie54e06", "is_submitter": "True", "link_id": "t3_vmvtj5", "parent_id": "t1_ie545sp", "score": "2", "subreddit": "ChineseLanguage", "subreddit_id": "t5_2qyz1"}, {"author": "Lokar13", "body": "a lot of people happily reading with pleco, so if you are mainly reading on your phone i'd go with that over LingQ.", "created_utc": "1656468418.0", "edited": "False", "id": "ie4vhqi", "is_submitter": "True", "link_id": "t3_vmvtj5", "parent_id": "t1_ie4tguh", "score": "1", "subreddit": "ChineseLanguage", "subreddit_id": "t5_2qyz1"}, {"author": "Lokar13", "body": "Manually pressing on every word in the kindle to look up just takes too long and gets frustrating when you are reading stuff with a lot of unknown words. I read every Mandarin Companion novel using the kindle, but then afterwards switched to reading on PC. I love using LingQ since you can arrow through words and glance at definitions without breaking the \"flow\" of reading.", "created_utc": "1656467299.0", "edited": "False", "id": "ie4t689", "is_submitter": "True", "link_id": "t3_vmvtj5", "parent_id": "t1_ie4o2xs", "score": "2", "subreddit": "ChineseLanguage", "subreddit_id": "t5_2qyz1"}, {"author": "Lokar13", "body": "I'm not sure exactly. I used Chairman's Bao / DuChinese / Mandarin Companion and Chinese Breeze (along with Anki) for my \"learning to read\" stage. The HSK level system is a pretty good at increasing difficulty from at least 1-4.", "created_utc": "1656467104.0", "edited": "False", "id": "ie4srun", "is_submitter": "True", "link_id": "t3_vmvtj5", "parent_id": "t1_ie4s4in", "score": "3", "subreddit": "ChineseLanguage", "subreddit_id": "t5_2qyz1"}, {"author": "Lokar13", "body": "So with LingQ, you can read in \"sentence mode\" where it will autogenerate speech to read it out loud to you. I read a lot of advice that Listening while Reading is super effective, so I tried to do a lot of my reading along with listening. Chairman's Bao & DuChinese has this function in their lessons, but I found it hard to find audio books that match what I wanted to read, so I went with the text to speech method.\n\nListening while reading was super helpful to me since  I wasn't using using pinyin (Chinese isn't like reading Spanish where you immediately know how to pronounce the word hahaha), so \"pulling\" an internal reading voice without it was very slow and exhausting. By the time I got to the end of the sentence, I forgot the beginning. Text to speech lets your mind grab the important bits like nouns, verbs and adjectives so you can better get a gist of what's happening. I would repeat it a couple of times to read before moving on.\n\nI don't use it much any more as my reading comprehension has increased, I've noticed that I need to flick my eyes back to the beginning or some parts take longer to process than others, so it now slows me down.", "created_utc": "1656451277.0", "edited": "1656452123.0", "id": "ie3uhlx", "is_submitter": "True", "link_id": "t3_vmvtj5", "parent_id": "t1_ie3leie", "score": "2", "subreddit": "ChineseLanguage", "subreddit_id": "t5_2qyz1"}, {"author": "Lokar13", "body": "haha this is my favorite website in the world\n\nZ-Library + LingQ is how I'm getting to read so fast lol", "created_utc": "1656443491.0", "edited": "False", "id": "ie3b0js", "is_submitter": "False", "link_id": "t3_vlsdfm", "parent_id": "t1_idxrll4", "score": "1", "subreddit": "ChineseLanguage", "subreddit_id": "t5_2qyz1"}, {"author": "Lokar13", "body": "Oh I just noticed this post!\n\nYou are so inspiring! It's so great to see focused readers getting good are reading very fast.\n\nI just went totally crazy after reading a translation of 魔道祖师 and have been going non stop for almost 18 months.\n\nI've been doing no output since all I want to do is binge read 耽美 novels haha.", "created_utc": "1656392088.0", "edited": "1656399503.0", "id": "ie0p1so", "is_submitter": "False", "link_id": "t3_vlcywg", "parent_id": "t3_vlcywg", "score": "2", "subreddit": "ChineseLanguage", "subreddit_id": "t5_2qyz1"}, {"author": "Lokar13", "body": "Thanks!\n\nThe slurring and the regional differences get me a lot, I watch a lot of Cdramas and even though the are speaking \"Standard Mandarin\" it is really surprising how different accents are and oh god the rapid speech slurring.\n\nI think I just need to be patient and do more listening / reading. (This is probably always the answer to everything haha) I understand conversational level dialogue, but getting to audio books / dramas is realistically going to take me years.", "created_utc": "1656050189.0", "edited": "False", "id": "idj07iw", "is_submitter": "True", "link_id": "t3_vj3z84", "parent_id": "t1_idizcxs", "score": "1", "subreddit": "ChineseLanguage", "subreddit_id": "t5_2qyz1"}, {"author": "Lokar13", "body": "Heavenly Path is now one of my favorite websites, you guys are so great and have such fantastic advice.\n\nI also recommend doing the pomodoro method!\n\nI am a binge reader in english, so I was used to just reading for long periods of time without needing a break, but that sort of caused burnout and headaches when trying to push myself with Chinese.\n\nInspired by Prof Alexander Arguelles's advice, I now jump between content and to make sure to take breaks, as this helps with mental concentration.\n\nI now set a timer for 25 minutes and read for that period of time, I then get up and do body weight exercises and then either go back to what I was reading or switch to something easier / more difficult (always have a variety of stuff to read, not just one book). This also helps prevent goofing off (like reading social media), and instead of stopping when you get bored or frustrated, you want to dive back in since the timer may have gone off at a juicy part!", "created_utc": "1656021207.0", "edited": "1656021585.0", "id": "idhgc9g", "is_submitter": "False", "link_id": "t3_vifola", "parent_id": "t3_vifola", "score": "2", "subreddit": "ChineseLanguage", "subreddit_id": "t5_2qyz1"}, {"author": "Lokar13", "body": "thanks\n\nyeah I think the key to language learning is try a lot of stuff and see what works and not worry too much haha", "created_utc": "1656019489.0", "edited": "False", "id": "idhcepf", "is_submitter": "True", "link_id": "t3_vj3z84", "parent_id": "t1_idh925p", "score": "2", "subreddit": "ChineseLanguage", "subreddit_id": "t5_2qyz1"}, {"author": "Lokar13", "body": "I fell madly in love with Mandarin after watching a couple of episodes of a Cdrama because of how the dubbing makes a kind of ASMR effect and my brain loved it.\n\nIt's not enough to sustain you though, you really have to love the culture / media content to get to an advanced level. I also love the sound of French, and always put it down after a couple of weeks since I don't care enough for their books or culture... I don't dislike French literature, but it's not enough to motivate me for the thousands of hours needed to \"get good.\" Chinese and Japanese, I'd crawl through broken glass every day to improve haha.", "created_utc": "1655746744.0", "edited": "False", "id": "id2zohb", "is_submitter": "False", "link_id": "t3_vgqhwm", "parent_id": "t3_vgqhwm", "score": "26", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Lokar13", "body": "Learn katakana ASAP\n\nThis blog is amazing and has a lot of resources for beginning reading:\n\n[https://dokushoclub.com/free-reading-resources/n5-free-reading-resources/](https://dokushoclub.com/free-reading-resources/n5-free-reading-resources/)", "created_utc": "1655658051.0", "edited": "False", "id": "icynag3", "is_submitter": "False", "link_id": "t3_vfy83h", "parent_id": "t3_vfy83h", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Lokar13", "body": "I've been struggling with this for a while, since I am definitely one of those that wants to learn languages just to read books and not talk to people.\n\nBut \"Time and time again, in about every skill one can learn, it has been shown that using the skill productively heavily assists in cementing the information in one's brain\" my question always is what about all the obscure vocab (>95%) that pops up a lot in native content but is rarely used in conversation? Like in Mandarin Chinese, there is a ton of vocab and hanzi that is marked \"literary use\" and doesn't seem to ever show up in conversational use since much of it is historical  (using it would be like talking like a Shakespearean actor...I think I've encountered at least twenty ways to describe dawn).\n\nLike I stuck this book I'm reading into a text analyzer and apparently it's got 27,000 unique vocab words ... how does having basic conversations help with learning all of that? (HSK 6, which is the highest level test you can pass is only 5000 words...) Massive amounts of reading has worked wonders for me, but I do occasionally wonder if I'm shorting myself by not talking. But then, I was a very shy child that rarely spoke or wrote but read a lot, and I always knew way more vocab than my peers growing up.\n\nBut I think it comes down to goals, if you want to have conversations, then drilling grammar and speaking from the start is important, but if you want to read books and watch TV, you have to read a lot of books and watch a lot of TV.", "created_utc": "1655616467.0", "edited": "1655620094.0", "id": "icwxnvn", "is_submitter": "False", "link_id": "t3_vf4z7q", "parent_id": "t1_icvsy8e", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Lokar13", "body": "It's started out as \"agonizing pain\" reading, because I didn't know at the beginning what to start reading (all native content was extremely hard). I basically did a version of the reading / listening method where I would have the text to speech read the sentence to me, then I'd look at the translation with the text to speech and then look at the Chinese sentence again. This slowly improved my comprehension and I really enjoyed myself.\n\nIt's still very difficult, but since I've spent hundreds of hours with it so far, it's much easier (unless it's a plot dump section). It still takes me about more than an hour to get through a chapter, but I don't have to use any translations or text to speech. LingQ has it about 150 ish unknown words per 2000 word section, so I think I'm finally at about 90% comprehension. I'm still a very slow reader and miss a lot, so I want to reread it again in a couple of years.\n\nI do extensive reading with easier novels and graded readers, and I probably have been reading >4 hours a day, every day since I read my first Mandarin Companion.", "created_utc": "1653643886.0", "edited": "1653644135.0", "id": "ia69vui", "is_submitter": "False", "link_id": "t3_uy70hh", "parent_id": "t1_ia66lma", "score": "2", "subreddit": "ChineseLanguage", "subreddit_id": "t5_2qyz1"}, {"author": "Lokar13", "body": "I've been loving your reading journey, it's been very inspiring since I'm learning Chinese for the basically the same reason as you (reading danmei novels).\n\nMy method has been importing in webnovels into LingQ, since I find arrowing through unknown / slightly unknown words easier than constantly fiddling with a pop up dictionary. Eventually I need to wean myself off and start reading directly from native sites, but I'm not stressing yet.\n\nI'm slightly over day 500 and have read \\~ 2.5m words so far (had to use side by side translations in the beginning, but now I don't). I'm on Ch 261 of 2HA 二哈和他的白猫师尊 which is the most hubristic material I could have started with, but who cares it's not completely translated and it's AMAZING and worth the effort. I read several books at the same time, so I kinda want to start 一时冲动，七世不祥 now just because I saw [this screenshot](https://mydramalist.com/photos/BJ4wl_3) from it's upcoming drama and that's basically the method of how I pick my books to read haha.\n\nReading romance novels for hours a day every day + SRS + subtitled dramas = guaranteed success.", "created_utc": "1653637503.0", "edited": "1653640131.0", "id": "ia62sxb", "is_submitter": "False", "link_id": "t3_uy70hh", "parent_id": "t3_uy70hh", "score": "2", "subreddit": "ChineseLanguage", "subreddit_id": "t5_2qyz1"}, {"author": "Lokar13", "body": "I'd say no. I've attempted French to various levels throughout my life and stopped even though it's one of the easiest language for a English speaker to learn, and I took four years in high school. I personally don't enjoy reading French books enough to spend the time learning and I live very far away from any native French speakers.\n\nI'm not planning on using my TL to ever travel or speak, but since I love Chinese literature, it's been 1000% worth the struggle. If you don't like talking to people or engaging in media, find a language you do love or find another hobby.", "created_utc": "1653260523.0", "edited": "False", "id": "i9maykj", "is_submitter": "False", "link_id": "t3_uvfab2", "parent_id": "t3_uvfab2", "score": "4", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Lokar13", "body": "Sparkle Love on YouTube I understood a lot of the dialogue. (Girl is basically pikachu and falls in love with a swimmer, it’s dumb but also fantastic)\n\nI’ve been trying to seek out more of the modern “youth” dramas where they are in school, as the vocab / plot / amount of characters tends to be simpler.", "created_utc": "1648920552.0", "edited": "1648921356.0", "id": "i34oswo", "is_submitter": "False", "link_id": "t3_ttqu5l", "parent_id": "t3_ttqu5l", "score": "1", "subreddit": "ChineseLanguage", "subreddit_id": "t5_2qyz1"}, {"author": "Lokar13", "body": "That's really cool! I'm impressed with your reading speed!\n\nI've just been tracking amount read (since having high reading goals has encouraged me to read more).\n\nI'm scared to count the amount of dramas I watch since that might make me question my life choices haha", "created_utc": "1648864481.0", "edited": "1648864805.0", "id": "i326h3p", "is_submitter": "False", "link_id": "t3_tu3hqk", "parent_id": "t3_tu3hqk", "score": "4", "subreddit": "ChineseLanguage", "subreddit_id": "t5_2qyz1"}, {"author": "Lokar13", "body": "I don’t think anybody can give you an exact number (my guess is however long it takes you to read 10,000 pages - this seems like a lot but webnovels are crazy long so read a bunch of them and you’ll be literate in the sense of being able to read smoothly at 98% comprehension)\n\nThe bad news is that it will probably take you longer than you think but you’ll be way faster than learners that don’t speak. I have to use text to speech a lot to get my reading speed up since I struggle with sub vocalization, and you’ll probably won’t need to do that once you get a grip on the hanzi.\n\nLearn 10 a day for a year, get some anki decks for basic sentences and then just start reading with graded readers and move to native content with pop up dictionaries / LingQ / Readibu. And watch lots of dramas with subtitles.\n\nJust start now and keep at it every day - make daily reading goals in terms of hours / pages depending on your schedule (and stick to it regardless of how frustrating it gets!) I’m so in love with Chinese books that it’s been absolutely worth the huge amount effort I’ve put in. The first year or two will be rough but eventually the magic happens.", "created_utc": "1648840078.0", "edited": "1648843614.0", "id": "i30pqqg", "is_submitter": "False", "link_id": "t3_ttp0cs", "parent_id": "t3_ttp0cs", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Lokar13", "body": "As someone learning a language because their media is heavily reliant on machine translations to English, I am absolutely not worried about this. There is so much that gets missed and I’m only at low intermediate level and I see the discrepancies. Humor / poetry / cultural references / word play get warped, not to mention the delight at understanding the language itself without an intermediary. \n\nDo you read a lot of (human) translation literature? Think of how many footnotes that get placed on a page to explain context and words that don’t have an equivalent in both languages.", "created_utc": "1648754835.0", "edited": "False", "id": "i2vy8lw", "is_submitter": "False", "link_id": "t3_tsx5fy", "parent_id": "t3_tsx5fy", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Lokar13", "body": "Oh man thanks for finding that number \n\nI’ve been trying to set reading goals and after some research/ guessing I set mine at 15 million (LingQ tracks the number) good to see I was within reason", "created_utc": "1648576004.0", "edited": "False", "id": "i2lbd9m", "is_submitter": "False", "link_id": "t3_tqxps1", "parent_id": "t1_i2jz0rb", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Lokar13", "body": "I work part time on weekends so my weekday schedule is: \n\nWake up / meditate / go to the gym / do chores \n\nDo Anki for 1-2 hours, read on my exercise bike until I hit 15k steps.\nEat dinner and watch Cdramas with my spouse (dual subtitles so he can enjoy and I can learn)\nAfter he goes to bed, I read for 4+hours until I get a headache and then I watch Cdramas. Every thirty minutes I do some body weight exercises to get my blood moving again.\n\nOn weekends, at work I listen to a mandarin podcast as much as I can get away with (earbuds are technically banned) after work I come home and read until I get a headache and then watch Cdramas.\n\nHave no idea how people learn a language only doing <1 hour a day, but maybe I have bad memory haha.\n\nI really like reading and I’m learning Chinese so I can read, so I don’t know if I would recommend this schedule to anyone other than book nerds. Occasionally I treat myself and read a book in English as a break from reading Mandarin lol", "created_utc": "1648519717.0", "edited": "1648520557.0", "id": "i2ijh7s", "is_submitter": "False", "link_id": "t3_tqitp4", "parent_id": "t3_tqitp4", "score": "4", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Lokar13", "body": "What I’m loving most is the idioms/ chengyus. I run into so many new ones everyday, and there are so many situations lately where I think “oh there is a idiom that is perfect to describe this.” Before I started learning Mandarin I was interested in how the hanzi worked and if it “limited” the way of expression (versus being able to make up new words like with an alphabet language), and it’s not the case at all. Mandarin is very very dense and it can do a lot in a little space.", "created_utc": "1648400376.0", "edited": "False", "id": "i2bzopl", "is_submitter": "False", "link_id": "t3_tpgben", "parent_id": "t1_i2bkt8x", "score": "4", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Lokar13", "body": "I’ve read over a three thousand pages of webnovels now (LingQ tracks the words read and I assume 500 words per page) and I’ve adjusted my target reading goal for Chinese from 10k to like 40k. My goal is to read comfortably and I just feel Chinese needs a massive amount of input to get there for westerners. (I also want to read wuxia novels which has its own insane vocab.) People that say mandarin is easier than they assumed have not read a book haha.\n\nAnd the reading goal is just my line where I refuse to give up because it’s too hard or frustrating haha", "created_utc": "1648345450.0", "edited": "1648346549.0", "id": "i29iuvt", "is_submitter": "False", "link_id": "t3_too54b", "parent_id": "t1_i28eqf6", "score": "6", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Lokar13", "body": "So I had the same thing happened to me a couple of months ago and it felt like I hit a wall. (I was doing 2-3 hours of Anki for > year on top of everything else)\n\nI really want to get good at reading, so I pushed through it, accepted that my brain was mushy, decreased the flash cards and watched a lot of TV with subtitles in my TL.\n\nI now feel like when you hit that point it’s a choice between burnout and a breakthrough. Almost like your brain is noticing all the things it had missed before, so you seem like you are understanding less, but it’s because you are noticing more.\n\nSo advice is to lay off the “active studying” (don’t add any more cards to anki for a while) and do a lot more fun immersion, but don’t stop interacting with the language.\n\nAlso I highly recommend watching a bunch of Steve Kaufman videos on dealing with forgetting words (basically it’s going to happen, just accept and try to not get frustrated)", "created_utc": "1647737409.0", "edited": "1647737593.0", "id": "i1ckleb", "is_submitter": "False", "link_id": "t3_ti948a", "parent_id": "t3_ti948a", "score": "19", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Lokar13", "body": "My primary motivation for learning Mandarin is basically because I instantly fell in love with the language / media after watching three episodes of a TV show, but spite and competition definitely helps during those times where the love wanes because of frustration.\n\nSpite because I live in an area that has become super racist against the Chinese these past few years - so talking about the language/ culture really really pisses off people I don’t care for. (People that were / are huge fans of a certain recent American ex president). It’s so petty but it is a part of why I’m currently enjoying myself so much.\n\nI’m not a competitive person except when it comes to reading challenges.  LingQ has these ongoing challenges that estimates how much reading / listening you do in your language and ranks you along with others. I’ve been obsessed with keeping myself at rank 1 or 2 for the past six months and it’s been insanely effective at getting my reading comprehension up. I read for hours a day, but it’s fun not only because I love reading, but I get to have my name on top of a leaderboard. Silly, but effective!", "created_utc": "1647619810.0", "edited": "False", "id": "i162z22", "is_submitter": "False", "link_id": "t3_th3fee", "parent_id": "t3_th3fee", "score": "6", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Lokar13", "body": "Previous recommendations were good : Love is Sweet & Day of Becoming You were great.\n\nI also loved Love Scenery, it's 31 episodes, but I swear it doesn't drag. There is a lot of online flirting while playing a video game together, but they filmed it live action and it's fantastic.\n\nGreat topic, because now I have more shows to add to my backlist hehe", "created_utc": "1647551433.0", "edited": "False", "id": "i12jlah", "is_submitter": "False", "link_id": "t3_tgep16", "parent_id": "t3_tgep16", "score": "8", "subreddit": "CDrama", "subreddit_id": "t5_34fkz"}, {"author": "Lokar13", "body": "Yeah I’ve done a bunch of other stuff in my language but the best decision I ever made was getting impatient and uploading a ridiculously long, way over my level web novel into LingQ six months after starting and have been reading for hours a day since then. My goal is to read 10million words (it’s mandarin so I need a lot haha) and see where that gets me. \n\nOnce you get LingQ it’s basically the greatest language learning website and I don’t get why it isn’t more popular. You have to read massive amounts to acquire an extensive vocabulary and you can skip right into whatever you want to read so you don’t need to search for that mythical 98% comprehensible input. \n\nBut I’m also learning the language so I can read in the language so of course I’m happiest when I’m doing that.", "created_utc": "1647506002.0", "edited": "False", "id": "i0zunf6", "is_submitter": "False", "link_id": "t3_tfsxae", "parent_id": "t3_tfsxae", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Lokar13", "body": "Comedy (beyond slapstick, physical comedy and exaggerated voices) can be hard to get into until your language level is more advanced. I’m learning Mandarin, so I can’t give advice on Korean, but for Chinese a lot of the humor comes from word play, idioms and cultural context that is either completely or somewhat lost in translation or at beginner levels.\n\nJust find stuff you can tolerate for now, be open minded and keep looking. Stuff you didn’t find funny now, you’ll probably find hilarious later.\n\nIf you don’t like tv shows, are there podcast and books you like? I’m always on the “read read read” side of language learning.", "created_utc": "1647462431.0", "edited": "False", "id": "i0xhcx3", "is_submitter": "False", "link_id": "t3_tfkzeo", "parent_id": "t3_tfkzeo", "score": "6", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Lokar13", "body": "Yeah I'm struggling to get through it. I'm only watching it because I'm in love with Luo Yun Xi, but if it wasn't for him i'd have totally dropped it. It's long AF but there isn't really a meta plot besides people being jealous.", "created_utc": "1647406762.0", "edited": "1647408073.0", "id": "i0ukfsn", "is_submitter": "False", "link_id": "t3_tf4bao", "parent_id": "t1_i0uich0", "score": "11", "subreddit": "CDrama", "subreddit_id": "t5_34fkz"}, {"author": "Lokar13", "body": "Oh this is 100% a thing. I’ve tried to get people that I know love Kdramas / anime / Rom Coms etc and none of them will even give Cdramas a chance even though I know they would love them. People are just close minded and spend too much time on Facebook/ news. \n\nIt also might be the reading subtitles thing, people hate reading and I didn’t realize people watch a lot of Kdramas / anime dubbed and Chinese shows are never dubbed.\n\nI started learning Mandarin because I love the media so much and it’s kinda obvious because I do a lot of flash cards / reading when there is downtime. Then one of my coworkers literally screamed at me for 20 minutes about how she was going to shoot the Chinese when they invade (wtf?) I just talked about how much I love guys in wigs and makeup and showed her multiple pictures of Luo Yun Xi… she eventually shut up.", "created_utc": "1647223723.0", "edited": "1647225782.0", "id": "i0kgkbo", "is_submitter": "False", "link_id": "t3_td5bw1", "parent_id": "t3_td5bw1", "score": "11", "subreddit": "CDrama", "subreddit_id": "t5_34fkz"}, {"author": "Lokar13", "body": "Learn via recognizing the radicals. \n\nAlso Arch Chinese (website) and Pleco (app) are really good about breaking down a character into radicals / components. Just keep going and eventually your brain will start chunking / recognizing how the hanzi work. \n\nI have a deck that’s just the hanzi and a sample word (apart from a sentence deck) that I review to grind it into my brain. Mnemonics stopped working for me after a certain point, so just a word of warning it is totally normal to get confused and forget hanzi even if you see it a number of times.", "created_utc": "1647203477.0", "edited": "1647203772.0", "id": "i0j7vki", "is_submitter": "False", "link_id": "t3_tddj8x", "parent_id": "t3_tddj8x", "score": "3", "subreddit": "Refold", "subreddit_id": "t5_3azein"}, {"author": "Lokar13", "body": "I also feel like they should add a warning that there is a stage where you realize that the method is absolutely working and you just want to go around proselytizing and yelling at people giving bad advice. I've had to block reddit occasionally and restrain myself IRL to prevent myself from being annoying or making rude replies, but I'm sure some people aren't as concerned about social niceties and that leads to a black mark on the method.", "created_utc": "1647149270.0", "edited": "False", "id": "i0gkrri", "is_submitter": "False", "link_id": "t3_tcytw2", "parent_id": "t3_tcytw2", "score": "10", "subreddit": "Refold", "subreddit_id": "t5_3azein"}, {"author": "Lokar13", "body": "This is my theory as well.\n\nI'm aghast at the terrible advice given in r/languagelearning , some examples: \"set sustainable goals like reading an hour a week\" \"studying 20 minutes a day for ten years is better than going for hours a day\" \"take days / week long breaks from your language learning so your brain can process\"\n\nBut I've mentioned immersion to several people I know IRL that are trying to learn Spanish but look at me like I'm nuts when I mention simple advice like reading a lot or watching shows with subtitles. A lot of people don't actually want to spend time with the language, they want to impress people or skip the hard part.\n\n(I'm also astounded by the number of people in that subreddit that are learning Mandarin but hate Chinese media...like how the fuck are you going to comprehend the language to an advanced level and why would you want to if you dislike it so much? It's like a stamp they want to get on their polyglot passport)", "created_utc": "1647148138.0", "edited": "1647158925.0", "id": "i0giy9i", "is_submitter": "False", "link_id": "t3_tcytw2", "parent_id": "t1_i0ggckn", "score": "10", "subreddit": "Refold", "subreddit_id": "t5_3azein"}, {"author": "Lokar13", "body": "Oh man thanks for this link! Sometimes I think I’m crazy for wanting to learn Chinese for the just for their media and I’ve been using advice from Japanese learners on how to get my comprehension up but I’ve been looking for the Chinese resources that list web novels by difficulty (since I keep reading stuff way above my level).", "created_utc": "1647135837.0", "edited": "1647137666.0", "id": "i0fwlzc", "is_submitter": "False", "link_id": "t3_tafrov", "parent_id": "t1_i01d6z3", "score": "2", "subreddit": "ChineseLanguage", "subreddit_id": "t5_2qyz1"}, {"author": "Lokar13", "body": "LingQ - you can import actual novels into it and with the text to speech and translate function you can read stuff above your level past the point of mental exhaustion for hours a day.", "created_utc": "1647129970.0", "edited": "False", "id": "i0fkzd7", "is_submitter": "False", "link_id": "t3_tcp0zx", "parent_id": "t3_tcp0zx", "score": "4", "subreddit": "ChineseLanguage", "subreddit_id": "t5_2qyz1"}, {"author": "Lokar13", "body": "this was good, but the ending was so bad the writers had to apologize on weibo, so feel free to stop a couple of episodes before the end if you lose interest", "created_utc": "1647073265.0", "edited": "False", "id": "i0cjl2g", "is_submitter": "False", "link_id": "t3_tbdchl", "parent_id": "t1_i0axscs", "score": "1", "subreddit": "CDrama", "subreddit_id": "t5_34fkz"}, {"author": "Lokar13", "body": "That was my exact impression, the lighting is very good. When they were in the car in Ep 1, they actually had the light move and it actually seemed like they were driving. Car scenes usually look so fake, so it was nice they took the trouble.", "created_utc": "1647070429.0", "edited": "False", "id": "i0cg0vn", "is_submitter": "False", "link_id": "t3_tblzig", "parent_id": "t1_i084zmz", "score": "1", "subreddit": "CDrama", "subreddit_id": "t5_34fkz"}, {"author": "Lokar13", "body": "Weirdly the modern ones make me cry more than the grand fantasy ones.\n\nOur Secret & The Day of Becoming You both had me very puffy eyed in the middle parts.\n\nAnything that hits that \"heartsick secretly in love and resigned to suffering\" chord well is what gets me.\n\nI do need to watch the Wolf and I'm only halfway through Ashes of Love, so I might change my tune lol", "created_utc": "1647069598.0", "edited": "1647069931.0", "id": "i0cey88", "is_submitter": "False", "link_id": "t3_tc5lue", "parent_id": "t3_tc5lue", "score": "4", "subreddit": "CDrama", "subreddit_id": "t5_34fkz"}, {"author": "Lokar13", "body": "The amount of idioms you have to learn is insane. Don't discount how hard mandarin is until you've read (or tried to read) a couple of native books.", "created_utc": "1646733143.0", "edited": "False", "id": "hztj4sj", "is_submitter": "False", "link_id": "t3_t8umd4", "parent_id": "t1_hzqgldv", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Lokar13", "body": "Thank for this, great advice. When I get tired, I basically have been treating myself laying off the Anki and binge watching dramas (still read, but just less), and I have felt a little guilty about it, but it's good to see it's the right decision. Then I get reinvigorated and the cycle starts again haha.", "created_utc": "1646278287.0", "edited": "False", "id": "hz4z4ro", "is_submitter": "False", "link_id": "t3_t4z5qq", "parent_id": "t1_hz3h458", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Lokar13", "body": "Love this post!\n\n\"If you don't read novels, you have no concept of just how much you don't know.\"\n\nYes! Everytime I see something about my TL having easy grammer, or it's not that bad once you get the logic of it, I want to scream. I am now highly suspect of people commenting on a language / language learning if they haven't read at least a dozen novels in their TL. (I know that's not everyone's goal, but it's mine and why listen to people that haven't reached the goal you want?)\n\nI'm really curious about the mental consolidation part, I have noticed that after I really push myself and read a lot, sometimes the next day I'm utterly wiped and I read so much slower.", "created_utc": "1646246201.0", "edited": "1646246451.0", "id": "hz2y0ag", "is_submitter": "False", "link_id": "t3_t4z5qq", "parent_id": "t3_t4z5qq", "score": "4", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Lokar13", "body": "LingQ is my favorite. Reading a lot of interesting material in your target language is basically the best way to rapidly acquire vocabulary. \n\nJust import what you want and read for hours a day.", "created_utc": "1646001746.0", "edited": "False", "id": "hypc94v", "is_submitter": "False", "link_id": "t3_t2wf9x", "parent_id": "t3_t2wf9x", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Lokar13", "body": "There is a way to sit down and study for 12 hours a day? Look at the refold / AJATT / mass immersion approach. \n\nBasically it involves flash cards and reading for hours and hours a day and using media for free flow immersion. And/Or just talk to natives all day by either moving to the country or using online language exchange.\n\nIt’s incredibly difficult (you have to do this all day every single day for months to years depending on language), and most people are going to flame out but it does work. And yes, you have to take responsibility for your own learning, unless you are very rich and can hire someone to basically follow you around and teach you like a toddler.", "created_utc": "1645989181.0", "edited": "1645991186.0", "id": "hyogys3", "is_submitter": "False", "link_id": "t3_t2ilg5", "parent_id": "t3_t2ilg5", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Lokar13", "body": "Honestly just keep beating your head against it and read as much as you can, eventually your brain will start recognizing the radicals and you’ll start getting the patterns. I spent probably an hour a day just doing flash cards of hanzi for the past year (use anki SRS way easier than making your own - front has the hanzi (with an example word) and back has the “vibe + pinyin”).\n\nA lot of hanzi have multiple meanings depending on how they connect with other words, but stick to one or two of the main ones and you’ll pick up other meanings during your reading.\n\nBe patient and keep reading.", "created_utc": "1645936129.0", "edited": "False", "id": "hylst16", "is_submitter": "False", "link_id": "t3_t231ar", "parent_id": "t3_t231ar", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Lokar13", "body": "Not to be rude but six days is nothing. Those are both tremendously difficult languages that take thousands and thousands of hours and massive commitment over years to get anywhere. If you are loosing interest over a week, reconsider.", "created_utc": "1645730629.0", "edited": "False", "id": "hya3ajl", "is_submitter": "False", "link_id": "t3_t0f17a", "parent_id": "t3_t0f17a", "score": "6", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Lokar13", "body": "High quality loose leaf teas. Granted I spend less overall than most people spend on energy drinks / coffee / wine , but I care less and less about the price, and I’ll happily dump $30 a tin without blinking, and I’ll probably start buying really expensive stuff the more my palate develops.", "created_utc": "1645162434.0", "edited": "False", "id": "hxeuhg3", "is_submitter": "False", "link_id": "t3_suqy2v", "parent_id": "t3_suqy2v", "score": "1", "subreddit": "Frugal", "subreddit_id": "t5_2qhbe"}, {"author": "Lokar13", "body": "Realize that desire is the root of human suffering, if it wasn’t language learning, we’d all be beating ourselves up by not being smarter/richer/prettier/more educated/more in shape/more enlightened/ “insert other goal” \n\nIt is what it is\n\nAlso read more trashy novels / watch trashy shows in your TL when you get stressed", "created_utc": "1645077228.0", "edited": "False", "id": "hx9x8pj", "is_submitter": "False", "link_id": "t3_sufo2l", "parent_id": "t3_sufo2l", "score": "8", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Lokar13", "body": "Not to knock this, but an multi button mouse is so much more convenient. I use a Logitech G600 left over from playing FFXIV.  It's got about 20 buttons that you can use per profile, and I have different profiles set ups / macros for watching tv / LingQ / Anki.\n\nThis might be me bringing up a PC gaming vs console gaming debate lol\n\nMy MMO habits (grinding in front of a computer for hours for tiny amounts of progress) transferred easily into language learning", "created_utc": "1644867968.0", "edited": "1644871159.0", "id": "hwy32hl", "is_submitter": "False", "link_id": "t3_sqs5q2", "parent_id": "t3_sqs5q2", "score": "3", "subreddit": "Refold", "subreddit_id": "t5_3azein"}, {"author": "Lokar13", "body": "Hahah this is what I needed to hear! I’ve been inputting in Mandarin 10 hours a day for the past year, and the farther I get the more I realize the absolute insane amount of grammer, vocab and context I still don’t have a clue on - not to mention I’ve been collecting tens of chengyus a day and that’s an endless ocean.\n\nI absolutely addicted and in crazy love with the language at this point, so there is no hope for me, but for those that think they can get anywhere with dabbling just haha lol. Or just “pick it up” like they did with a European language.\n\nI’ve watched 1300 episodes of dramas, done 200k anki reviews, read 150 graded readers, read about a million words in LingQ and my comprehension is “shitty”\n\nI’m still insanely annoyed at a coworker that told me it just takes three months to learn to speak as that’s what her missionary friend did. Yeah, tourist level maybe, but I’d like to read books and that’s going to take eye bleeding levels of effort for years.", "created_utc": "1643745030.0", "edited": "1643745532.0", "id": "hv6brml", "is_submitter": "False", "link_id": "t3_si3fs8", "parent_id": "t3_si3fs8", "score": "15", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Lokar13", "body": "Netflix doesn’t have a lot, and while YouTube has a bunch of stuff, the hard coded subs make it difficult to look stuff up with a pop up dictionary.\n\nBest advice is to get a iQiyi account and just browse through what they have.\n\nThe light on series is good for those that like thrillers if you don’t care for modern romance shows / historical / fantasy. Try the Bad Kids - simple dialogue, but very gripping. The screenwriter also wrote Our Secret (school youth romance but also really good) which is also free I think on that channel.\n\nAlso recommend watching Marcus Here! On YouTube since he recaps what’s been released lately, and  browsing through My drama list.\n\nI recommend becoming a “fan” of an actor/ actress and just watching all of their stuff. I’ve almost watch every show of Gong Jun so far and that’s over 100 hours just there.", "created_utc": "1643492013.0", "edited": "False", "id": "hurpusf", "is_submitter": "True", "link_id": "t3_s8u5zm", "parent_id": "t1_huo6mfi", "score": "2", "subreddit": "ChineseLanguage", "subreddit_id": "t5_2qyz1"}, {"author": "Lokar13", "body": "You might as well give it a go? No harm in trying but there are so many homophones in Mandarin that after you step out of very basic conversation you’ll quickly hit a wall of progress. I’ve been learning for a year (200k anki cards reviews , 1000 subtitled episodes of TV, 150 graded readers, 3.5k hanzi memorized, countless hours of passive listening) and I’m getting to the point where reading isn’t painful but I still have extreme difficulty understanding speech. I always have to use a podcast transcript to get what’s going on, even if I can read it without difficulty.\n\nI would say I’m just terrible at listening, but browsing through countless mandarin language learning forums, my situation is more common than not.\n\nBut hey, it’s a beautiful language and more listening practice is only going to help (I swear it takes months just to get your brain rewired to hear tones better) - so try it and see how it goes.", "created_utc": "1643248002.0", "edited": "1643248307.0", "id": "hudprgn", "is_submitter": "False", "link_id": "t3_sdkcuw", "parent_id": "t3_sdkcuw", "score": "4", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Lokar13", "body": "You reminded me to check out what he is doing lately\n\nLooks like he is going to be second lead in a new drama \n\n[But How Bright the Moon Thinks About Hua Nian](https://mydramalist.com/684453-nai-he-ming-yue-si-hua-nian)\n\n[Jason Xu in Costume](https://mydramalist.com/photos/RdqqE_3)", "created_utc": "1643081363.0", "edited": "False", "id": "hu3vegf", "is_submitter": "False", "link_id": "t3_sbss0p", "parent_id": "t1_hu3pl4z", "score": "2", "subreddit": "CDrama", "subreddit_id": "t5_34fkz"}, {"author": "Lokar13", "body": "Luo Yun Xi 罗云熙 sings a gorgeous theme song 缘起 for And the Winner is Love. Besides the Untamed duet, I think it's one of my favorite OST songs.\n\n[Youtube Link with Lyrics](https://www.youtube.com/watch?v=0SJEF7WSGtE&ab_channel=JONGxXxSHINe)", "created_utc": "1643076568.0", "edited": "1643076878.0", "id": "hu3kkrt", "is_submitter": "False", "link_id": "t3_sbss0p", "parent_id": "t3_sbss0p", "score": "5", "subreddit": "CDrama", "subreddit_id": "t5_34fkz"}, {"author": "Lokar13", "body": "I was only going to mess around with it (only learning mandarin so I can read webnovels, so output / native accent not a priority) but today and yesterday I did about 3 sentences x 20 min each per day. It might sound like a lot, but time just whooshed.", "created_utc": "1643055729.0", "edited": "False", "id": "hu2bw8m", "is_submitter": "False", "link_id": "t3_saudpd", "parent_id": "t1_hu1ztvt", "score": "6", "subreddit": "Refold", "subreddit_id": "t5_3azein"}, {"author": "Lokar13", "body": "Oh god thank you for this. \n\nFor those that think this would be boring, after a while it becomes a very calming - basically like a mantra meditation.\n\nMy mouth is now sore and my cat is screaming at me lol", "created_utc": "1643009983.0", "edited": "False", "id": "htzsji7", "is_submitter": "False", "link_id": "t3_saudpd", "parent_id": "t3_saudpd", "score": "9", "subreddit": "Refold", "subreddit_id": "t5_3azein"}, {"author": "Lokar13", "body": "I pulled a couple of random native speaker sentences from my Anki deck (you can spend hours looking for the \"right ones\" but fuck it, just load something up and start.\n\nI'm learning mandarin, so there is 409 syllables (?) - I might just make an list and mark off the ones as I go along.", "created_utc": "1643009555.0", "edited": "False", "id": "htzrygj", "is_submitter": "False", "link_id": "t3_saudpd", "parent_id": "t1_htwq826", "score": "3", "subreddit": "Refold", "subreddit_id": "t5_3azein"}, {"author": "Lokar13", "body": "One and Only was fantastic, I had very puffy eyes the day after I finished it.\n\n(plus there is a sequel to make you feel better if you want fluff after your angst)", "created_utc": "1642927131.0", "edited": "False", "id": "htuxtdt", "is_submitter": "False", "link_id": "t3_sa9zp6", "parent_id": "t3_sa9zp6", "score": "4", "subreddit": "CDrama", "subreddit_id": "t5_34fkz"}, {"author": "Lokar13", "body": "can anybody recommended me some C dramas *with* nude scenes / swear words? (lol they don't exist)\n\nAt this point I get excited if the ML takes his shirt off for five seconds", "created_utc": "1642926521.0", "edited": "False", "id": "htux0k4", "is_submitter": "False", "link_id": "t3_sagieu", "parent_id": "t1_htu0uzb", "score": "9", "subreddit": "CDrama", "subreddit_id": "t5_34fkz"}, {"author": "Lokar13", "body": "Maybe it's the shows / actors I follow, but I love their acting. I think it's because a lot of times they are dubbed over, they have to express emotion through micro expressions / eye movements, so if you know what to look for, it's amazing.\n\nIt's very subtle and quick, but since I'm constantly pausing and watching dramas at slow speed, it's easier to notice, but I find once you get what they are doing it's breathtaking.\n\nPlus, since popular actors do so many dramas, you can really see a range of their abilities, and what they bring to different roles. Much better than watching The Rock act as his character...The Rock.\n\nThat's for some actors / actresses though, others are absolutely terrible and shouldn't be allowed in front of a camera (looking at you 程潇).", "created_utc": "1642728003.0", "edited": "False", "id": "htjd5hg", "is_submitter": "True", "link_id": "t3_s8u5zm", "parent_id": "t1_htj3f1x", "score": "4", "subreddit": "ChineseLanguage", "subreddit_id": "t5_2qyz1"}, {"author": "Lokar13", "body": "Yeah I agree, Chinese TV is so addicting I'm constantly surprised it's not more popular. I keep recommending shows to people that are into Kdramas / anime and nobody even gives it a chance.\n\nMy first exposure was watching two episodes of the Untamed during a night shift at work when it was slow, and I fell so hard in love...well here I am.", "created_utc": "1642726533.0", "edited": "False", "id": "htj9r9l", "is_submitter": "True", "link_id": "t3_s8u5zm", "parent_id": "t1_htj11gm", "score": "2", "subreddit": "ChineseLanguage", "subreddit_id": "t5_2qyz1"}, {"author": "Lokar13", "body": "I've been slowly watching 《斗罗大陆》as I watched the entire live action drama, and since the webnovel is based on is like 3000 pages I figured by the time I've gone through it, my reading ability has got to improve. I watch an episode to get familiar with the plot, and then read the next chapter using LingQ. Since it's mostly fight scenes, getting lost occasionally is fine because it's basically \"Tang San wins fight\"", "created_utc": "1642726294.0", "edited": "False", "id": "htj97bn", "is_submitter": "True", "link_id": "t3_s8u5zm", "parent_id": "t1_htj4emq", "score": "2", "subreddit": "ChineseLanguage", "subreddit_id": "t5_2qyz1"}, {"author": "Lokar13", "body": "Plus I just realized that I shouldn't use the FSI as a benchmark for what I want to use the language for (reading books) and what the FSI is grading - outputting for diplomats and reading news. And the FSI benchmark is for B2? I think.\n\nI can see it's probably slightly easier to string together basic sentences and hold a conversation for a westerner in Mandarin than Japanese, though both are extremely difficult.", "created_utc": "1642725766.0", "edited": "False", "id": "htj7ynk", "is_submitter": "True", "link_id": "t3_s8u5zm", "parent_id": "t1_htj3s83", "score": "7", "subreddit": "ChineseLanguage", "subreddit_id": "t5_2qyz1"}, {"author": "Lokar13", "body": "Yeah, it wasn't until the 3k hanzi mark until I felt I wasn't being blasted regularly with unknown characters (not that I know all the vocab associated with every hanzi), but I still encounter unknown hanzi all the time (especially in names), I'm feeling like 4-5k is a good goal to shoot for to be literate. \n\nI read somewhere that people can start immersing with Japanese at the 2k mark, but I'm unfamiliar with Japanese .", "created_utc": "1642723340.0", "edited": "False", "id": "htj27wg", "is_submitter": "True", "link_id": "t3_s8u5zm", "parent_id": "t1_htizsky", "score": "4", "subreddit": "ChineseLanguage", "subreddit_id": "t5_2qyz1"}, {"author": "Lokar13", "body": "This is also part of why I wonder why Japanese is considered more difficult. Their literary history is so vast and deep, and I hubristically thought their fantasy genre would be considered \"young adult\" level like it is in the west.\n\nInstead its packed full of poetic references and word play, and while I am excited to eventually wade into classical Chinese, it's going to be a while (apparently Chinese elementary students memorize Tang Poetry? )", "created_utc": "1642722836.0", "edited": "False", "id": "htj107i", "is_submitter": "True", "link_id": "t3_s8u5zm", "parent_id": "t1_htixmk0", "score": "4", "subreddit": "ChineseLanguage", "subreddit_id": "t5_2qyz1"}, {"author": "Lokar13", "body": "It's probably an impossible question to answer anyway, since if you learn both, the second one is going to be much easier.\n\nIt's that stupid asterisk next to Japanese, but not Chinese that bothers me on the FSI page. They need to remove it haha.", "created_utc": "1642722517.0", "edited": "False", "id": "htj085r", "is_submitter": "True", "link_id": "t3_s8u5zm", "parent_id": "t1_htiunem", "score": "17", "subreddit": "ChineseLanguage", "subreddit_id": "t5_2qyz1"}, {"author": "Lokar13", "body": "On top of all the dialects, slang, scientific / medical terms, part of the dawning horror is my realization of my vast ignorance of Chinese culture / history / geography / food / flora and fauna.  I've been exposed to so many words for different types of flowers, trees and birds that I wasn't even aware existed.\n\nI know I need to relax and chill out, we all went to school for years to learn vocabulary and it's impossible to absorb it as quick as one wishes.", "created_utc": "1642721497.0", "edited": "False", "id": "htixrkj", "is_submitter": "True", "link_id": "t3_s8u5zm", "parent_id": "t1_htivc5w", "score": "40", "subreddit": "ChineseLanguage", "subreddit_id": "t5_2qyz1"}, {"author": "Lokar13", "body": "It's been a year, and I would rate my Mandarin as \"crappy\" which is a level I'm really pleased at.\n\nI'm mostly watching loads of subtitled dramas on youtube / iqyi. I'm not doing any output at all (I have no plans to travel and don't know any mandarin speakers IRL).\n\nI feel like I can get the \"gist\" of most modern shows (follow most basic conversations / flirting, but major plot explanations and any technical terms I need to pause and lot up a lot), but wuxia / historical shows go over my head most of the time.", "created_utc": "1642719995.0", "edited": "False", "id": "htiu3rs", "is_submitter": "True", "link_id": "t3_s8u5zm", "parent_id": "t1_htisc0c", "score": "7", "subreddit": "ChineseLanguage", "subreddit_id": "t5_2qyz1"}, {"author": "Lokar13", "body": "In a couple of years, I definitely want to dip my toes in Japanese because I'm becoming more and more curious at how they are similar and different.\n\nI'm definitely glad I'm learning Mandarin first, since apparently most westerners don't get a course on pitch accent, and I can already feel like it's more obvious to me since my brain has been immersed in tones for the past year.", "created_utc": "1642719462.0", "edited": "False", "id": "htist5v", "is_submitter": "True", "link_id": "t3_s8u5zm", "parent_id": "t1_htiq2ut", "score": "30", "subreddit": "ChineseLanguage", "subreddit_id": "t5_2qyz1"}, {"author": "Lokar13", "body": "I guess this is the answer - I see more successful Japanese learners, because there are just more people interested in their media.\n\nI absolutely adore C dramas and webnovels. I'm a female though that loves romance and fantasy and I find their media absolutely astoundingly great at stirring up emotions.  I've watched some korean dramas, anime and read lots of japanese translated novels, and while I liked them, I was never as moved.\n\nI think I cried most episodes of the Day of Becoming You, and it's just a body swap drama, haha.\n\nI guess my new question is why don't people think chinese media is good?", "created_utc": "1642718958.0", "edited": "False", "id": "htirlwl", "is_submitter": "True", "link_id": "t3_s8u5zm", "parent_id": "t1_htinhnq", "score": "35", "subreddit": "ChineseLanguage", "subreddit_id": "t5_2qyz1"}, {"author": "Lokar13", "body": "This rational life is great. I absolutely adore a slow burn romance and that show nailed it. (It does get draggy a little later in some of the office politics scenes, but that's the nature of C dramas, they are much longer than Kdramas, so don't be afraid to skip on occasion, we all do :) ).\n\nIf you like modern dramas I highly recommend checking out [iq.com](https://iq.com), (or going on mydrama list and finding stuff you like and looking for it on youtube). They have a ton of stuff and if you go down their free section I swear you'll find more stuff you'll like (Love is Sweet, Perfect and Casual, Love Scenery, Our Secrets and are my favorites modern ones I've watched so far.) \n\nNetflix has some great fantasy dramas too - Word of Honor and the Untamed are fantastic. Put your Head on my Shoulder is a good modern college one that was cute and fluffy.", "created_utc": "1640629661.0", "edited": "False", "id": "hq6b74k", "is_submitter": "False", "link_id": "t3_rps7bm", "parent_id": "t3_rps7bm", "score": "3", "subreddit": "CDrama", "subreddit_id": "t5_34fkz"}, {"author": "Lokar13", "body": "I didn't know she was in this and it was a pleasant surprise.\n\nXiao Zhan is such a cutie, I don't care about the plot or military themed shows, but I'll probably sit through this whole thing anyway haha", "created_utc": "1640597346.0", "edited": "False", "id": "hq4oki1", "is_submitter": "False", "link_id": "t3_rpe9z5", "parent_id": "t3_rpe9z5", "score": "8", "subreddit": "CDrama", "subreddit_id": "t5_34fkz"}, {"author": "Lokar13", "body": "Maybe? There is an option, but I never got it to work. - [Dualsub Extension](https://chrome.google.com/webstore/detail/dualsub/gnlibmlfpencglodjpgnalbdebfhpmfp?hl=en) There are other extensions like this, and you need a separate one for [Netflix](https://chrome.google.com/webstore/detail/language-reactor/hoombieeljmmljlkjmnheibnpciblicm), but that's the one I use. \n\n If you use a website that doesn't have hard coded subtitles (lots of youtube videos unfortunately have the subtitles embedded in, and the stupid Tencent player, most reliable one i've found so far is [iq.com](https://iq.com)), you can easily mouse over the mandarin subtitles with the Zhongwen pop up dictionary. \n\nI don't personally don't like to read with pinyin on top - I find it distracting from training my brain to quickly recognize hanzi.", "created_utc": "1639594625.0", "edited": "False", "id": "hooftbk", "is_submitter": "True", "link_id": "t3_rgjw1u", "parent_id": "t1_homcbmk", "score": "2", "subreddit": "ChineseLanguage", "subreddit_id": "t5_2qyz1"}, {"author": "Lokar13", "body": "It'll take years to understand without subtitles, but after one year of studying about 5 hours a day (reading and Anki)  and watching a lot of dual subtitled TV I can at least pick up on a lot of things that get badly or not at all translated, so it's been absolutely worth it.   \n\n\nYesterday I started watching a show yesterday that hadn't yet come out with English subs and while I missed most of the details what was going on, but I was able to get the gist of the plot reading just the mandarin subtitles. \n\nKeep at it! It's horrible and difficult in the beginning, but it does (slowly) gets easier.", "created_utc": "1639196829.0", "edited": "False", "id": "ho2ya9b", "is_submitter": "False", "link_id": "t3_rdoa3i", "parent_id": "t3_rdoa3i", "score": "3", "subreddit": "ChineseLanguage", "subreddit_id": "t5_2qyz1"}, {"author": "Lokar13", "body": "The Untamed (the show in the banner on this subreddit)\n\nIt was my first, and a year later, I'm learning Mandarin and have watched 1000 episodes of C dramas.", "created_utc": "1639119674.0", "edited": "False", "id": "hnykfyd", "is_submitter": "False", "link_id": "t3_rd2r1i", "parent_id": "t3_rd2r1i", "score": "4", "subreddit": "CDrama", "subreddit_id": "t5_34fkz"}, {"author": "Lokar13", "body": "I was just thinking about this drama today even though I watched it months ago. It made me cry so much (but in a good way).\n\nCast is amazing, and surprising the screenwriter also wrote the Bad Kids - which was also extremely emotionally touching, but way different vibe.\n\nI absolutely love it when a FL lead goes through hell / works really hard just to be with the guy she loves. (So much better than when FL refuses the ML / breaks up for stupid reasons - I start getting annoyed)\n\nI'm tempted to rewatch it but there are too many dramas getting released this month hahah.\n\nThere was a movie very similar to this (Starring Arthur Chen) [**My Best Summer**](https://mydramalist.com/33694-my-best-summer)**.**", "created_utc": "1639118975.0", "edited": "1639119277.0", "id": "hnyjdup", "is_submitter": "False", "link_id": "t3_rcrlt8", "parent_id": "t3_rcrlt8", "score": "6", "subreddit": "CDrama", "subreddit_id": "t5_34fkz"}, {"author": "Lokar13", "body": "[**Love Scenery**](https://mydramalist.com/52895-love-scenery) is exactly what you want. It has a strong FL and a younger male / older woman relationship. They fall in love playing a video game together, but it's filmed as more of James Bond action sequences than CGI cutscenes.\n\nAnd as a bonus, it's got the same male lead from Put Your Head on My Shoulder (even shows some clips of that show as an easter egg)", "created_utc": "1639041871.0", "edited": "1639042766.0", "id": "hnu0t57", "is_submitter": "False", "link_id": "t3_ra2214", "parent_id": "t1_hnj4z9d", "score": "2", "subreddit": "CDrama", "subreddit_id": "t5_34fkz"}, {"author": "Lokar13", "body": "Ashes of Love has Luo Yun Xi and that was his breakout role, so must watch (then you can watch Love is Sweet)", "created_utc": "1639025855.0", "edited": "False", "id": "hnteil5", "is_submitter": "False", "link_id": "t3_rbwpce", "parent_id": "t3_rbwpce", "score": "2", "subreddit": "CDrama", "subreddit_id": "t5_34fkz"}, {"author": "Lokar13", "body": "As a heavily tattooed person learning Chinese, I'm puzzled why would anyone do this? It's going to be phonetically spelled out using hanzi, but will look like gibberish. People that read Chinese are going to be confused, and if the person getting tattooed doesn't read Chinese anyway, why not get a cool idiom concerning filial piety instead (that way at least it means something)?\n\n百善孝为先\tof all virtues filial piety is most important (idiom)", "created_utc": "1638945494.0", "edited": "1638946122.0", "id": "hnouza0", "is_submitter": "False", "link_id": "t3_rbfx4o", "parent_id": "t3_rbfx4o", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Lokar13", "body": "I'm using it to learn Mandarin. To me it's been immensely useful, as I've only been studying it for a year, so understanding what's going on without the English would be near impossible (Input needs to be comprehensible!!! Otherwise you are wasting time) . I started learning Mandarin so I can read webnovels, but along the way I got addicted to C dramas (LuoYang is currently running and it's soooo good)\n\nI don't count it as \"active\" studying. I watch TV after reading for 5-6 hours a day and feel like my brain has melted and just want to veg out and enjoy myself stressfree. (only work weekends so I have a lot of free time haha).  (Also I have about 3.5k of Hanzi loaded into Anki, so I can recognize 99% of the hanzi, but not necessarily the actual vocab / idioms)\n\nIt's really good at \"chunking\" language bits. I do read really fast in English, but I can't understand full sentences in Mandarin at normal speed when I just watch a show without pausing, but I can kinda sort of read both and sometimes pick up and reinforce a lot of vocab / \"chunks\", not to mention a lot of listening practice. As months have gone on, I'm able to read more and more sentences and I've noticed my eyes are focusing more and more on the chinese and less on the english, but then I lose track of plot.\n\nI can't say how effective it is, according to my drama list, I've watch 900 episodes of TV this year (which seems like a lot, but C dramas are freaking long) and i'm not yet ready to turn off the english subs. But hey, it's Mandarin so I expect I need another year at least.\n\nLast point: find content that is addicting and enjoyable, I have lost sleep binge watching C dramas, and I haven't watched any non chinese media in a year. So if you need to use the dual subs so that you always chose to watch shows in your TL over watching native shows, that's the better option than using TL subs only and getting frustrated and stopping.", "created_utc": "1638936199.0", "edited": "1638938022.0", "id": "hnogpon", "is_submitter": "False", "link_id": "t3_rbfmz7", "parent_id": "t3_rbfmz7", "score": "7", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Lokar13", "body": "LingQ is great for this, although I know there is Readlang, but i've never used it.", "created_utc": "1631002850.0", "edited": "False", "id": "hbwq8jh", "is_submitter": "False", "link_id": "t3_pjim81", "parent_id": "t3_pjim81", "score": "5", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Lokar13", "body": "Agree - this relationship and the mom actually makes sense in the plot - it’s really a “cares too much and shows it poorly” dynamic \n\nI cried at a bunch of scenes with her later", "created_utc": "1630797488.0", "edited": "False", "id": "hbmizne", "is_submitter": "False", "link_id": "t3_phtk2x", "parent_id": "t1_hbku5to", "score": "7", "subreddit": "CDrama", "subreddit_id": "t5_34fkz"}, {"author": "Lokar13", "body": "Tokyo March 1st\n\nThe latest I can read says they are only asking for runners from China voluntarily not participate and about an average of 1800 have signed up.", "created_utc": "1581765421.0", "edited": "False", "id": "fhomwha", "is_submitter": "False", "link_id": "t3_f47veo", "parent_id": "t1_fhommbx", "score": "11", "subreddit": "China_Flu", "subreddit_id": "t5_2dar36"}, {"author": "Lokar13", "body": "They should cancel the 30,000 person marathon that’s happening in two weeks.", "created_utc": "1581764147.0", "edited": "False", "id": "fhom31h", "is_submitter": "False", "link_id": "t3_f47veo", "parent_id": "t3_f47veo", "score": "24", "subreddit": "China_Flu", "subreddit_id": "t5_2dar36"}, {"author": "Lokar13", "body": "\nNimona (comic book)\n\nPrince of Thorns trilogy by Mark Lawrence (Jorge is...uhhhh...let’s just go with horrible)\n\nPerfume is one of my favorite books, insanely great ending", "created_utc": "1580105920.0", "edited": "False", "id": "ffpu8tl", "is_submitter": "False", "link_id": "t3_euj2fi", "parent_id": "t3_euj2fi", "score": "2", "subreddit": "booksuggestions", "subreddit_id": "t5_2ryqe"}]