[{"author": "LoliLion", "body": "After a while of staying in Germany I completely forgot about coperto, but they're a bit different as one can be seen as a gift and the other as a tax.\nTipping is usually a little extra for a particularly good service that goes directly in the pockets of the staff and almost always over the counter, while coperto isn't and to my knowledge is mostly intended to cover some sort of costs the owner is bearing (bread and water that are usually served, washing napkins and tablecloth, etc.).", "created_utc": "1662195556.0", "edited": "False", "id": "imwm4bz", "is_submitter": "False", "link_id": "t3_x4dqq7", "parent_id": "t1_imwliwq", "score": "2", "subreddit": "AskAGerman", "subreddit_id": "t5_2y3st"}, {"author": "LoliLion", "body": "It absolutely isn't. Tipping in Italy is a bit unusual, and adding the tip to the bill is even less common.", "created_utc": "1662194995.0", "edited": "False", "id": "imwlh2z", "is_submitter": "False", "link_id": "t3_x4dqq7", "parent_id": "t1_imuq6te", "score": "2", "subreddit": "AskAGerman", "subreddit_id": "t5_2y3st"}, {"author": "LoliLion", "body": "For what I've seen, rankings are based on multiple factors, and in some even the number of international students counts towards reaching a specific position, but I was mostly interested in the quality of education especially through personal experiences, and perhaps discovering a little more out of the discussion.\nNeither rankings or people's anecdotes on their own can build a clear picture and I'm fully aware of it, but still that wasn't a good enough reason not to ask.", "created_utc": "1662138821.0", "edited": "False", "id": "imtjmb2", "is_submitter": "True", "link_id": "t3_x45c5u", "parent_id": "t1_imth9hw", "score": "0", "subreddit": "germany", "subreddit_id": "t5_2qi4z"}, {"author": "LoliLion", "body": "I should've specified that I was asking not because I'm interested in studying in Germany, but only in gaining insider knowledge on what is commonly said about unis in general and which are considered the best in each field. The wiki is pointing out that most universities are more or less on the same level and that rankings are not that useful (reason why I was asking), but I was curious on which ones are generally perceived as worthier or if there is any kind of competition/rivalry in some fields!", "created_utc": "1662137810.0", "edited": "False", "id": "imth0ww", "is_submitter": "True", "link_id": "t3_x45c5u", "parent_id": "t1_imtf2ua", "score": "0", "subreddit": "germany", "subreddit_id": "t5_2qi4z"}, {"author": "LoliLion", "body": "Mario Rossi (m) and Maria (f) Rossi in Italian! But funny enough, we almost never use Maria with a surname, and we just call her Ms. Maria.\nTiny edit: while telling tales, anecdotes or making up scenes, we use Tizio, Caio and Sempronio. You can only use Caio if Tizio was already introduced in the narrative, and the same goes with Sempronio, e.g.: \n\"Let's suppose Tizio is wearing blue\"\n\"Let's suppose Tizio is having dinner with Caio\"\n\"Let's suppose Tizio is with his friend Caio and they run into Sempronio\"", "created_utc": "1661966481.0", "edited": "1661966891.0", "id": "imjox7d", "is_submitter": "False", "link_id": "t3_x22bki", "parent_id": "t3_x22bki", "score": "4", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "LoliLion", "body": "Looks like an animated sketch, I love it!", "created_utc": "1661455326.0", "edited": "False", "id": "ilrugbx", "is_submitter": "False", "link_id": "t3_wxgrku", "parent_id": "t3_wxgrku", "score": "2", "subreddit": "PixelArt", "subreddit_id": "t5_2ql09"}, {"author": "LoliLion", "body": "I completely relate to the \"WHAAAAAAAAAAAT\" part, though!\nSince I am basically A0 German I like to watch content and TV shows in my target language so that I can improve oral comprehension. For that reason, a while ago I started watching Unorthodox in German with my GF (who speaks the language) on Netflix. It was only after she pointed out that for a great part of the series the actors were speaking Yiddish that I discovered how the two languages are so similar to each other. Until that point, I just tought that for some reason they were speaking with a very thick accent, and for large parts I assumed there were just a lot of things that I wasn't catching because I'm at beginner level 🤦‍♀️", "created_utc": "1660910475.0", "edited": "False", "id": "ikx8qag", "is_submitter": "False", "link_id": "t3_ws1ocp", "parent_id": "t1_ikwshh9", "score": "18", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "LoliLion", "body": "Sono un po' in disaccordo con la n.3 e parzialmente la n.4.\n\nn.3: Dove le fai queste copie del biglietto vincente? Sicuramente se non le fai in casa e in segreto, qualcuno si fa un paio di domande. E anche facessi diventare il tuo appartamento una copisteria abusiva, a questo punto si porrebbe il problema di evitare che queste copie vengano scoperte e finiscano in mano ad altri, quindi hai lo stress di badare bene a non perdere il biglietto originale moltiplicato per 1+n copie che farai.\nn.4: Andare sotto scorta fino a Roma rischia solo di attirare molto di più l'attenzione (il Barbra Straisand Effect insegna molto). Chi ti scorterebbe? Degli amici ai quali dovresti dare comunque spiegazioni? Un estraneo reperito non si sa come? \n\nPer me la soluzione migliore è tacere tutto. Nel momento stesso in cui lo scopri, acquisti un biglietto del treno di andata per Roma e ti mescoli alla folla. Sei un tizio qualunque che va a trovare la fidanzata nel weekend, un trasfertista, un fuorisede non frequentante che va a dare l'esame, boh, uno di cui ci si dimentica facilmente. Agli altri non interessa un granché chi sei fino a quando tu stesso non dai loro un motivo per interessarsene. \nIl pericolo peggiore in questo scenario è l'essere borseggiati, ma tu sei furbo e da futuro ricco stravagante quale sei ti sei fatto fare un paio di mutande con le tasche.", "created_utc": "1658609662.0", "edited": "False", "id": "ihd82gm", "is_submitter": "False", "link_id": "t3_w64azn", "parent_id": "t1_ihblwwy", "score": "11", "subreddit": "ItaliaPersonalFinance", "subreddit_id": "t5_3isqn"}, {"author": "LoliLion", "body": "I... I'm speechless. This is on a whole other level.", "created_utc": "1657021912.0", "edited": "False", "id": "iexk2vd", "is_submitter": "False", "link_id": "t3_vrvq6m", "parent_id": "t1_iexjjjt", "score": "2", "subreddit": "German", "subreddit_id": "t5_2qq51"}, {"author": "LoliLion", "body": "Basically I was able to study abroad due to a special agreement between my University and the French one. I'm sorry if I worded it oddly, but since it wasn't exactly an exchange *year* but rather a few months, I thought it would have been an intelligible definition for those who may not be aware of what Erasmus+ programs are.", "created_utc": "1657008130.0", "edited": "False", "id": "iex2nhs", "is_submitter": "False", "link_id": "t3_vr7n78", "parent_id": "t1_ievq0r5", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "LoliLion", "body": "Oh, yeah, right. \n\nDuring an exchange period, my professors and classmates absolutely refused to speak any language apart from French. Little did it matter to them that we were enrolled in a Master's degree with English as the language of teaching, and even less that I could barely get by. They've been s*o helpful* /s", "created_utc": "1656971482.0", "edited": "False", "id": "ievbamj", "is_submitter": "False", "link_id": "t3_vr7n78", "parent_id": "t1_ietrhji", "score": "8", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "LoliLion", "body": ">ha senso guidare qualcosa sotto la tua possibilità per 20 anni?\n\nNo, meglio usare i mezzi pubblici (/s non troppo/s)", "created_utc": "1656970771.0", "edited": "False", "id": "iev9olc", "is_submitter": "False", "link_id": "t3_vrh6wu", "parent_id": "t3_vrh6wu", "score": "1", "subreddit": "ItaliaPersonalFinance", "subreddit_id": "t5_3isqn"}, {"author": "LoliLion", "body": ">also use both\n\nLol this is a beginner's nightmare\n\n>How would you do it in Italian?\n\nThis is really hard to answer. I'd say that unfortunately there is no common agreement on which one is the best practice to address non-binary people.\r  \nItalian only has masculine and feminine, and since they permeate the whole language (pronouns, adjectives and even verb conjugation) there is almost no way around those (periphrasis aren't suited for every life situation), therefore the need for a third and \"neutral\" gender is quite felt. Altough, there is still a debate going on about which should be the right form. Some introduced the possibility to use the symbol \"ə\" instead of gender markers, so instead of pronouns *lui* or *lei* you'd have *l****ə****i*, instead of the adjectives *bell****o*** (m) or *bell****a*** (f) you'd have *bell****ə***, instead of the gendered past participle of \"andare\" *andat****o*** or *andat****a*** you'd have *andat****ə***. This is still being discussed, since the sound *ə* isn't a distinctive sound to the standard language (even though it might appear in regional dialects which are waaaaaay different) and therefore has a very unnatural feeling. On the other side, in written language it's quite easy to use a more inclusive language by putting an asterisc or any other symbol where the gender marker should be (bell@, bell\\*, bell3, etc.), even though there is criticism pointing out how it could lead to diminishing accessibility for disabled people using technological supports such as text-to-voice functions.\r  \nDespite everything, I think that we're still ages apart from developing a sensitivity to the matter, considering that many people are still fuming when certain feminine nouns (such as those used to describe professions and trades) are being introduced.", "created_utc": "1656970422.0", "edited": "False", "id": "iev8w19", "is_submitter": "False", "link_id": "t3_vr9vi2", "parent_id": "t1_ietz8j7", "score": "2", "subreddit": "German", "subreddit_id": "t5_2qq51"}, {"author": "LoliLion", "body": "That's so interesting!   \nWhile learning English, we're taught that \"it\" can only be used to refer to animals or things. Still, since I have never encountered such a thing when learning German pronouns, I thought non-binary folks would automatically choose neuter pronouns to address themselves.\n\n&#x200B;\n\n>Some people just don't use pronouns and ask to be referred to only by name. Others prefer you use both pronouns all the time like saying \"er/sie heißt Noah. Er/sie ist 19 und nicht binär.\"\n\nHow do/should you behave around adjectives in such situations?", "created_utc": "1656949858.0", "edited": "False", "id": "ietwmfi", "is_submitter": "False", "link_id": "t3_vr9vi2", "parent_id": "t1_iettpbu", "score": "6", "subreddit": "German", "subreddit_id": "t5_2qq51"}, {"author": "LoliLion", "body": ">better say \"Cappuccini\"\n\nThanks, will do! Are words with a plural form that follows the original language's one very frequent? German plural forms are quite hard to memorize, and I thought I was good by applying a textbook rule saying you should add -s to form the plural form of many (even though not all of) foreign words, but I had no idea I was making someone cringe!\n\n> This is less relevant with cappuccino, but think of Spaghetti.\n\nI always think of spaghetti. \n\nJokes aside, I get your point and I will keep it in mind for sure, but right now I am struggling to understand the purpose of \"mal\" when paired with uncountable nouns (cappuccino, coffee, milk, water, etc.) or inseparable ones (pizza, kebap, etc.)", "created_utc": "1656675502.0", "edited": "False", "id": "iefuou0", "is_submitter": "True", "link_id": "t3_voy46y", "parent_id": "t1_iefszol", "score": "2", "subreddit": "German", "subreddit_id": "t5_2qq51"}, {"author": "LoliLion", "body": "Thank you! I've never had to specify \"two times Pizza\" or \"five times coffee\" when ordering in other languages, so it weirds me out a bit. I am looking forward to your wife's explanation", "created_utc": "1656674688.0", "edited": "False", "id": "iefters", "is_submitter": "True", "link_id": "t3_voy46y", "parent_id": "t1_iefscv1", "score": "1", "subreddit": "German", "subreddit_id": "t5_2qq51"}, {"author": "LoliLion", "body": ">alle persone che poi vogliono usare come spie\n\nwhat", "created_utc": "1656673574.0", "edited": "False", "id": "iefrr6k", "is_submitter": "False", "link_id": "t3_vouf91", "parent_id": "t1_ieflhh2", "score": "10", "subreddit": "ItaliaPersonalFinance", "subreddit_id": "t5_3isqn"}, {"author": "LoliLion", "body": "I didn't see Mediaset Play mentioned in that list, which is just as popular as Rai. It should be free, although I am not sure if it's geo-blocked.", "created_utc": "1656508737.0", "edited": "False", "id": "ie6kkh4", "is_submitter": "False", "link_id": "t3_vms3l7", "parent_id": "t1_ie3iwpr", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "LoliLion", "body": "Thank you very much!\n\n>The first rule disagrees with itself: it says that there's an \"und\", but doesn't have the \"und\" in the example.\n\nLol if only I was able to read properly.\n\n>I'd say 101 letters could be expressed in accusative as \"hunderteins Briefe\", or more elegantly \"hundertundeinen Brief\".\n\nNow I'm curious: is there any specific reason behind finding it more elegant? Or is it just personal taste?", "created_utc": "1655919291.0", "edited": "False", "id": "idbupd5", "is_submitter": "True", "link_id": "t3_via5t9", "parent_id": "t1_idbsy6j", "score": "1", "subreddit": "German", "subreddit_id": "t5_2qq51"}, {"author": "LoliLion", "body": "After a while I got tired of its approach and switched to a grammar book and other free platforms to learn new vocabs. It just felt like I was spending an insane amount of time just to get past the greetings section of Rosetta.\n\nIt throws at you a bunch of pictures and audios asking you to assign the correct one to each other, but leaves you wondering about translations, grammar rules and so on. If you're supposed to learn through examples and flashcards I guess that you'll eventually do, but I personally prefer an explanation first and only then exercises to apply what I learnt, otherwise it doesn't really feel like studying but more like guessing.", "created_utc": "1655887550.0", "edited": "False", "id": "ida7ea1", "is_submitter": "False", "link_id": "t3_vh9ap8", "parent_id": "t1_id63hdu", "score": "1", "subreddit": "German", "subreddit_id": "t5_2qq51"}, {"author": "LoliLion", "body": "Correct me if I'm wrong, but isn't grammar only explained starting from B1 CEFR level? \nMy Uni provided us students with a licence to learn wichever language they had available on their platform, but while I was able to benefit from examples and various kinds of exercices in my B1 French course, A1 German was more similar to a flashcard platform like Babbel/Memrise and overwhelmingly less helpful than those.", "created_utc": "1655808920.0", "edited": "False", "id": "id625b0", "is_submitter": "False", "link_id": "t3_vh9ap8", "parent_id": "t1_id5wuke", "score": "2", "subreddit": "German", "subreddit_id": "t5_2qq51"}, {"author": "LoliLion", "body": ">per vivere in maniera discreta\n\nDipende tantissimo da cosa significa \"discreta\" per te e da quali compromessi si è disposti a raggiungere. Qualunque stima sarebbe campata per aria senza sapere prima queste cose:\n\n* Vuoi vivere da solo o avere dei coinquilini?\n   * Se vuoi vivere da solo, vuoi vivere in un monolocale/bilocale/trilocale/ecc.?\n   * Se vuoi condividere l'appartamento, vuoi vivere in una stanza singola o condivisa?\n* Vicino o lontano dal centro?\n* Prendi i mezzi o l'automobile?\n* Qual è il tuo stile di vita e quali sono i tuoi passatempi? Esci spesso?\n* Ti interessa mettere da parte dei risparmi o va bene spendere tutte le entrate?", "created_utc": "1655457750.0", "edited": "False", "id": "icou9y3", "is_submitter": "False", "link_id": "t3_vduvub", "parent_id": "t3_vduvub", "score": "1", "subreddit": "ItaliaPersonalFinance", "subreddit_id": "t5_3isqn"}, {"author": "LoliLion", "body": "I feel like I can retain simple expressions and vocabulary a bit better thanks to TV Shows and movies. I mostly rely on online streaming services that provide both german dub and my native tongue subtitles. It's a nice way to stay productive even when you're feeling a bit lazier since you'll eventually pick up new words you hear over and over or you'll get to recognize those you already know.", "created_utc": "1655210153.0", "edited": "False", "id": "icblup7", "is_submitter": "False", "link_id": "t3_vc10zo", "parent_id": "t3_vc10zo", "score": "1", "subreddit": "German", "subreddit_id": "t5_2qq51"}, {"author": "LoliLion", "body": "I think I get it now, thank you! I guess I had doubts because it just sounded a bit unusual of a question.", "created_utc": "1655209439.0", "edited": "False", "id": "icbklx9", "is_submitter": "True", "link_id": "t3_vc01kj", "parent_id": "t1_icbb884", "score": "1", "subreddit": "German", "subreddit_id": "t5_2qq51"}, {"author": "LoliLion", "body": " Thanks! I think I won't be using this sentence very often, if this is the case 😂", "created_utc": "1655209294.0", "edited": "False", "id": "icbkdak", "is_submitter": "True", "link_id": "t3_vc01kj", "parent_id": "t1_icba512", "score": "1", "subreddit": "German", "subreddit_id": "t5_2qq51"}, {"author": "LoliLion", "body": "I wasn't aware of those archaic forms. Either way, it's good to know! Thank you.", "created_utc": "1655208812.0", "edited": "False", "id": "icbjk1l", "is_submitter": "True", "link_id": "t3_vc01kj", "parent_id": "t1_icb9451", "score": "2", "subreddit": "German", "subreddit_id": "t5_2qq51"}, {"author": "LoliLion", "body": "I am using [Leo](https://www.leo.org/tedesco-italiano/) to learn German from Italian! \n\nIt works both as an online dictionary and an excellent vocabulary trainer. You can either choose to train on random words picked by Leo or to train and revise the words you looked up and saved to your account while searching for a translation, and the last function is IMO most useful when a certain word has multiple shades of meaning.", "created_utc": "1654853915.0", "edited": "False", "id": "ibu4uz2", "is_submitter": "False", "link_id": "t3_v8js0m", "parent_id": "t3_v8js0m", "score": "1", "subreddit": "italianlearning", "subreddit_id": "t5_2tuxf"}, {"author": "LoliLion", "body": "Lol yes there is even a common saying that goes as follows: \"*Veneziani gran signori; Padovani gran dottori; Vicentini mangiagatti; Veronesi tutti matti*\" \n\n(Roughly translated: People from Venezia are true gentlemen, people from Padova are great doctors, people from Vicenza are cat eaters and people from Verona are all crazy)", "created_utc": "1654694383.0", "edited": "False", "id": "ibltcbb", "is_submitter": "False", "link_id": "t3_v6muek", "parent_id": "t1_ibgqhrp", "score": "2", "subreddit": "italianlearning", "subreddit_id": "t5_2tuxf"}, {"author": "LoliLion", "body": "I completely agree! Learning new words and simple structures will help you understand what's going on around you to a certain extent, but definitely won't put you in the condition to develop the fluency necessary to effectively participate in a conversation.\n\nThere is also an [interesting article](https://www.forbes.com/sites/susanadams/2019/07/16/game-of-tongues-how-duolingo-built-a-700-million-business-with-its-addictive-language-learning-app/?sh=21e5a9433463) Forbes published on the topic of language learning apps, if you're interested:\n\n>*Bob Meese, Duolingo’s 42-year-old chief revenue officer, has been studying Duolingo Spanish for more than six months. In response to the question, “¿Hablas español?” he freezes, then says, “Could you repeat that?”*", "created_utc": "1654693924.0", "edited": "False", "id": "iblsfss", "is_submitter": "False", "link_id": "t3_v7i2yg", "parent_id": "t1_iblk9bs", "score": "6", "subreddit": "italianlearning", "subreddit_id": "t5_2tuxf"}, {"author": "LoliLion", "body": "Thank you!", "created_utc": "1654344153.0", "edited": "False", "id": "ib50fqo", "is_submitter": "True", "link_id": "t3_v4n2y7", "parent_id": "t1_ib4zkho", "score": "2", "subreddit": "German", "subreddit_id": "t5_2qq51"}, {"author": "LoliLion", "body": "Same in Italian! \"Spawnare\" for spawning, \"Farmare\" for farming and a lot of others are pretty common. My guess is that it happens almost everywhere there is a gaming community of non-native English speakers, at this point.", "created_utc": "1653323994.0", "edited": "False", "id": "i9p8z9a", "is_submitter": "False", "link_id": "t3_uvvzcr", "parent_id": "t1_i9nxxcy", "score": "8", "subreddit": "German", "subreddit_id": "t5_2qq51"}, {"author": "LoliLion", "body": "Cambiare paese per imparare una lingua credo sia più proficuo quando hai già un livello intermedio (B1/B2). Se vuoi apprendere le basi di una lingua da perfetto principiante, allora seguire dei corsi in Italia va benissimo.\n\nSe l'italiano è la tua lingua madre, io ti consiglio lo spagnolo. Con due ore al giorno tutti i giorni penso tu possa raggiungere un livello intermedio senza però incontrare troppi scogli che a lungo andare potrebbero demolire la tua motivazione. L'istituto Cervantes è l'autorità in merito, e offre anche diversi corsi online nel caso tu non abbia la possibilità di presenziare in sede. \n\nSe invece preferisci essere autodidatta, il web è pieno di risorse. Ti consiglio app come Duolingo e Memrise per imparare le basi di ogni lingua, anche se questi strumenti vanno assolutamente integrati con un libro di grammatica! Ogni tanto anche su Youtube si trovano dei corsi di lingua fatti molto bene, e tutto quello che devi fare è cercare quello che meglio si adatta al tuo stile di apprendimento. Se senti la mancanza di contatto coi madrelingua, esistono piattaforme come iTalki che mettono in contatto studenti di lingua con madrelingua, istruttori certificati, ecc. Per imparare alla velocità della luce, anche guardare coi sottotitoli film e serie TV in lingua (che siano in lingua originale oppure doppiati poco importa) è molto utile.\n\nNaturalmente questi consigli sono validi qualunque lingua tu decida di studiare!", "created_utc": "1652897438.0", "edited": "False", "id": "i93p5g0", "is_submitter": "False", "link_id": "t3_usbxia", "parent_id": "t1_i92sfiw", "score": "3", "subreddit": "italy", "subreddit_id": "t5_2qkhk"}, {"author": "LoliLion", "body": "Credo che il concetto espresso da \"rude\" sia molto simile a quello inglese di \"rough\". Non implica necessariamente l'essere maleducati o sgarbati, ma l'essere un po' bruschi nei modi e negli atteggiamenti. Di solito lo si usa per descrivere una persona un po' grezza, infatti.", "created_utc": "1652866574.0", "edited": "False", "id": "i91yx5r", "is_submitter": "False", "link_id": "t3_unieau", "parent_id": "t3_unieau", "score": "1", "subreddit": "italianlearning", "subreddit_id": "t5_2tuxf"}, {"author": "LoliLion", "body": "Se può aiutare a fare un po' di chiarezza, [repubblicadeglistagisti.it](https://repubblicadeglistagisti.it) ha caricato una guida che indica anche quali siano i minimi previsti a seconda della regione di riferimento.\n\nedit: eliminato refuso", "created_utc": "1651225230.0", "edited": "1651225508.0", "id": "i6na7s0", "is_submitter": "False", "link_id": "t3_udwjr4", "parent_id": "t1_i6jvf03", "score": "2", "subreddit": "ItaliaPersonalFinance", "subreddit_id": "t5_3isqn"}, {"author": "LoliLion", "body": "Infatti lo si sta già facendo.\n\nL'alfabetizzazione finanziaria è scarsa per motivi diversi in ciascuna fascia demografica considerata, ed è proprio per questo che si devono elaborare soluzioni personalizzate. Sono infinite le statistiche che mostrano come il genere influisca su una miriade di campi come quello dell'istruzione, dell'occupazione nei diversi settori, delle retribuzioni e dell'aspettativa di vita, per citarne solo alcuni.\n\nSono d'accordo che le competenze finanziare siano da migliorare, ma a ciascuno dovrebbe spettare l'educazione più adatta a seconda delle esigenze specifiche. Non si può pretendere di fare un minestrone e generalizzare: i problemi di un ventenne che si affaccia al mondo del lavoro non sono di certo quelli di un neopensionato, così come (normalmente) quelli di uomini e donne sono diversi.", "created_utc": "1651091250.0", "edited": "False", "id": "i6g3jsh", "is_submitter": "False", "link_id": "t3_ud8vjb", "parent_id": "t1_i6fga8f", "score": "2", "subreddit": "ItaliaPersonalFinance", "subreddit_id": "t5_3isqn"}, {"author": "LoliLion", "body": "Ciao! \r  \nSe fossi in te mi segnerei un paio di aziende per le quali ti interesserebbe lavorare e farei un controllo incrociato usando Glassdoor (per conoscere le retribuzioni relative al ruolo che ti interessa) e Linkedin (per capire il livello di esperienza di chi ricopre attualmente la posizione, le offerte disponibili presso l'azienda target, requisiti dei candidati ideali e cose così). \r  \nNon ti garantisco sia affidabile al 100%, ma almeno potresti costruirti un benchmark dal quale partire per capire come ti piazzi e dove valga la pena candidarsi.", "created_utc": "1650448603.0", "edited": "False", "id": "i5gn61r", "is_submitter": "False", "link_id": "t3_u7s4jt", "parent_id": "t3_u7s4jt", "score": "3", "subreddit": "ItaliaPersonalFinance", "subreddit_id": "t5_3isqn"}, {"author": "LoliLion", "body": "Ehi, ciao, non è che sapresti darmi due consigli su come ereditare un immobile? Anche su come venire da una famiglia poco sopra la media, se ti va :) /s", "created_utc": "1649442843.0", "edited": "False", "id": "i3xnl3n", "is_submitter": "False", "link_id": "t3_tz27r7", "parent_id": "t1_i3wm3st", "score": "10", "subreddit": "ItaliaPersonalFinance", "subreddit_id": "t5_3isqn"}, {"author": "LoliLion", "body": "1984\n\n*mic drop*", "created_utc": "1648717610.0", "edited": "False", "id": "i2tr32j", "is_submitter": "False", "link_id": "t3_ts2jcz", "parent_id": "t3_ts2jcz", "score": "4", "subreddit": "italy", "subreddit_id": "t5_2qkhk"}, {"author": "LoliLion", "body": "I am quite glad he didn't. The movie is amazing, but it set my expectations so high I was kind of disappointed when I read the book and found out it was a completely different thing.", "created_utc": "1644586105.0", "edited": "False", "id": "hwi2dht", "is_submitter": "False", "link_id": "t3_spuci7", "parent_id": "t1_hwhkx6q", "score": "2", "subreddit": "movies", "subreddit_id": "t5_2qh3s"}, {"author": "LoliLion", "body": "Tipo", "created_utc": "1644351249.0", "edited": "False", "id": "hw4ls2z", "is_submitter": "False", "link_id": "t3_snkfco", "parent_id": "t1_hw4h6yy", "score": "7", "subreddit": "italy", "subreddit_id": "t5_2qkhk"}, {"author": "LoliLion", "body": "Mah, no.\n\nSarà che stando assieme a una ragazza non ci sia quasi mai qualcuno con cui parlarne senza aspettarsi di intravedere un velo di malizia o uno sguardo che somiglia a quello di chi osserva animali esotici allo zoo, sarà che facendolo mi sembrerebbe di esporre chi non sta partecipando alla conversazione e potrebbe non sentire il bisogno di condividere certi aspetti della sua vita sessuale con terzi, ma mi infastidisce parecchio l'idea di condividere qualcosa che riguarda una sfera così privata.", "created_utc": "1644095832.0", "edited": "False", "id": "hvqpcw8", "is_submitter": "False", "link_id": "t3_slfb3j", "parent_id": "t3_slfb3j", "score": "8", "subreddit": "xxitaly", "subreddit_id": "t5_12qd6m"}, {"author": "LoliLion", "body": "A onor del vero, solitamente le Poste avvisano che il saldo potrebbe non essere sufficiente. Ho ricevuto due sms da parte delle Poste: il primo qualche tempo prima del rinnovo della PPE mi invitava a controllarne il saldo, mentre il secondo mi informava che i fondi (ma quali? Lol) presenti sulla carta non erano sufficienti per consentire il rinnovo del canone. Purtroppo, però, al momento non saprei dire se questo mi abbia portata ad un saldo negativo! 😕", "created_utc": "1644095024.0", "edited": "False", "id": "hvqnmkk", "is_submitter": "False", "link_id": "t3_slacj6", "parent_id": "t1_hvq7wxx", "score": "2", "subreddit": "ItaliaPersonalFinance", "subreddit_id": "t5_3isqn"}, {"author": "LoliLion", "body": "La verità è che dipende da comune a comune. Normalmente, quando si fa richiesta di residenza si può domandare al comune di essere accorpati allo stato di famiglia di chi vi abitava già (e aveva ovviamente la residenza), quindi possono esservi due o più nuclei familiari sotto lo stesso tetto (es: Milano). \nCi sono altri comuni in cui invece si è automaticamente inseriti nello stato di famiglia dei residenti se sussiste un certo grado di parentela (es: comune in cui vivono i miei).", "created_utc": "1643980717.0", "edited": "False", "id": "hvk2tg2", "is_submitter": "False", "link_id": "t3_sg8yst", "parent_id": "t1_huwsyeo", "score": "1", "subreddit": "ItaliaPersonalFinance", "subreddit_id": "t5_3isqn"}, {"author": "LoliLion", "body": "Hollow Knight's Steel Heart achievement. It's either that or my sanity.", "created_utc": "1642851040.0", "edited": "False", "id": "htqd04d", "is_submitter": "False", "link_id": "t3_s9g8qo", "parent_id": "t3_s9g8qo", "score": "1", "subreddit": "gaming", "subreddit_id": "t5_2qh03"}, {"author": "LoliLion", "body": "Unrelated, but that's quite an absolute unit of a Pikachu! Good choice 👌🏻", "created_utc": "1642793749.0", "edited": "False", "id": "htn0qqk", "is_submitter": "False", "link_id": "t3_s9apmf", "parent_id": "t3_s9apmf", "score": "1", "subreddit": "ResinCasting", "subreddit_id": "t5_2yqob"}, {"author": "LoliLion", "body": "Il mio percorso è stato molto simile a quello che descrivi. All'inizio del percorso mi ero prefissata di terminare in tempo, ma all'alba del terzo anno ho cominciato a patire molto d'ansia. Il rischio di finire fuori corso mi portava a pianti frequenti e irritabilità, l'incertezza per il futuro mi causava insonnia, e in tutto questo la mancanza di motivazione mi logorava. Sono arrivata a circa cinque esami dalla triennale a chiedermi se valesse la pena continuare o se sarebbe stato meglio mollare tutto e cominciare qualcosa di diverso. Ero arrivata a dubitare di aver scelto il corso giusto per me e mi ripetevo che sarei stata più felice facendo qualsiasi altra cosa. \r  \n\r  \nSe potessi tornare indietro mi rivolgerei a uno psicologo, ma all'epoca non mi era nemmeno passato per la testa.\r  \n\r  \nParadossalmente invece, quello che mi ha aiutata di più in assoluto è stato cercare un lavoro. Ho cominciato il servizio civile l'anno esatto in cui sono finita fuoricorso, e l'idea che la mia vita non ruotasse più attorno all'università mi ha permesso di prendere gli esami molto più alla leggera e di concludere la triennale, seppur in ritardo di quasi due anni. E' stata come una liberazione. \r  \n\r  \nOra ho cominciato la magistrale nella speranza che possa aiutarmi a migliorare le prospettive di lavoro future, ma non la vivo più come un tempo. Ho imparato a tenermi occupata con progetti più o meno alternativi (lavoretti, erasmus, hobby) per rompere la monotonia e ricordarmi che non esistono solo i libri. Spero di riuscire a terminare gli studi in tempo a questo giro, ma se non dovesse essere così non penso ne farò una tragedia.\r  \n\r  \nIl mio consiglio è quello di dedicarti ad altro, anche solo temporaneamente, prima di prendere una decisione definitiva. Può darsi che questo ti aiuti con più chiarezza a valutare quali siano le tue opzioni e magari aprirti nuove porte, ma in ogni caso potrebbe essere un'occasione per scoprire nuovi modi in cui potresti mettere a frutto le tue competenze.\r  \n\r  \nPer finire il pippone, ti lascio qui due siti in cui puoi trovare corsi di formazione gratuiti e a distanza nel caso tu volessi esplorare qualcosa di diverso senza dover prima abbandonare gli studi.\r  \n\r  \nhttps://www.abeaform.it/corsi/\r  \nhttps://www.fastwebdigital.academy/\r  \n\r\r  \nUn abbraccio e in bocca al lupo.", "created_utc": "1642783029.0", "edited": "False", "id": "htm7m0w", "is_submitter": "False", "link_id": "t3_s6dczu", "parent_id": "t3_s6dczu", "score": "5", "subreddit": "Universitaly", "subreddit_id": "t5_2w7ww8"}, {"author": "LoliLion", "body": "2. Non è così vero, visto che esistono anche le prestazioni occasionali per le quali non è necessario aprire partita IVA se ricorrono determinate condizioni.", "created_utc": "1642778793.0", "edited": "False", "id": "htlwf0u", "is_submitter": "False", "link_id": "t3_s96y2o", "parent_id": "t1_htl44r0", "score": "1", "subreddit": "commercialisti", "subreddit_id": "t5_3kebk"}, {"author": "LoliLion", "body": "Proprio per questo penso che per loro sarà più dura. Se nelle altre città il marchio può funzionare perché è unico nel suo genere (o quantomeno può suscitare ancora un certo interesse), a Milano i locali Starbucks non solo devono competere tra loro per lo stesso target, ma anche con altre catene e bar indipendenti in una città che è satura di punti ristoro.", "created_utc": "1642776036.0", "edited": "False", "id": "htlpgyf", "is_submitter": "False", "link_id": "t3_s98h13", "parent_id": "t1_htlhw85", "score": "2", "subreddit": "italy", "subreddit_id": "t5_2qkhk"}, {"author": "LoliLion", "body": "Sono d'accordo, ma quello che intendevo dire è che pur non avendo prezzi stellari restano pur sempre piuttosto alti per dei ragazzini, quindi ho l'impressione che per loro possa essere perlopiù un locale dove andare occasionalmente e non \"tanto per\".", "created_utc": "1642775309.0", "edited": "False", "id": "htlnr8u", "is_submitter": "False", "link_id": "t3_s98h13", "parent_id": "t1_htliguz", "score": "2", "subreddit": "italy", "subreddit_id": "t5_2qkhk"}, {"author": "LoliLion", "body": "Considerazioni ovvie a parte, penso che i punti nel milanese se la passeranno peggio rispetto a quelli situati nel resto d'Italia.\r  \nCon la pandemia il target principale di Starbucks ha disertato Milano, lasciando uno sterminio di locali a ripartirsi un bacino d'utenza che andrebbe bene per forse uno o due al massimo.\r  \nNelle altre città, magari, suscita ancora interesse perché è la bestia rara dello zoo, ma Milano è satura di catene e anche fra queste il turnover è allucinante. \r  \nIn una situazione come questa, è più facile che i consumatori decidano di sostenere il piccolo bar di quartiere piuttosto che l'ennesimo colosso.", "created_utc": "1642772012.0", "edited": "False", "id": "htlghfn", "is_submitter": "False", "link_id": "t3_s98h13", "parent_id": "t3_s98h13", "score": "7", "subreddit": "italy", "subreddit_id": "t5_2qkhk"}, {"author": "LoliLion", "body": "I prezzi sono tutto fuorché in linea con le tasche di pubescenti in cerca di un posto dove bighellonare, però :/", "created_utc": "1642769173.0", "edited": "False", "id": "htlb3pr", "is_submitter": "False", "link_id": "t3_s98h13", "parent_id": "t1_htl4c59", "score": "91", "subreddit": "italy", "subreddit_id": "t5_2qkhk"}, {"author": "LoliLion", "body": "Questo mese sono uscita finalmente dal covo di ignoranza in cui mi trovavo e ho cominciato a guardare The Office con la mia fidanzata (grz bb)", "created_utc": "1642428135.0", "edited": "False", "id": "ht1e5x1", "is_submitter": "False", "link_id": "t3_rq9jd0", "parent_id": "t3_rq9jd0", "score": "1", "subreddit": "xxitaly", "subreddit_id": "t5_12qd6m"}, {"author": "LoliLion", "body": "Ciao! In Lombardia ci sono un sacco di farmacie convenzionate con l'ASL che prevedono la possibilità di fare un tampone rapido per terminare il periodo d'isolamento.  In questi casi è proprio la farmacia a doversi occupare delle eventuali comunicazioni all'ASL. In ogni caso, ti suggerisco di telefonare per informarti ed evitare brutte sorprese. [Qui](https://www.farmacia-aperta.eu/) trovi un elenco delle farmacie che effettuano tamponi rapidi a seconda dell'area di tuo interesse. In bocca al lupo!", "created_utc": "1642419682.0", "edited": "False", "id": "ht10n3e", "is_submitter": "False", "link_id": "t3_s5xng0", "parent_id": "t1_ht0rt67", "score": "3", "subreddit": "xxitaly", "subreddit_id": "t5_12qd6m"}, {"author": "LoliLion", "body": "Sono d'accordo con te! \n\nOltretutto, anche se non potessi permetterti un certo accessorio, nulla ti impedirebbe di averlo ricevuto come regalo da parte di partner/genitori/parenti durante un'occasione speciale. In fin dei conti, non sei tenuta a dare spiegazioni a nessuno sul tuo stile di vita 🙂\n\nPoi, se si escludono i modelli più classici e conosciuti, trovo sia piuttosto raro che ci siano persone in grado di distinguere ad occhio nudo e con un certo grado di sicurezza una rep da una gen (e perfino da modelli fantasy, in tanti casi), quindi non preoccuparti troppo e goditi il tuo shopping!", "created_utc": "1641765085.0", "edited": "False", "id": "hrz008n", "is_submitter": "False", "link_id": "t3_rzyb3l", "parent_id": "t1_hrys727", "score": "2", "subreddit": "FashionRepsIT", "subreddit_id": "t5_qhvso"}, {"author": "LoliLion", "body": "Dipende. E' una Costa Crociere?", "created_utc": "1641763558.0", "edited": "False", "id": "hryvow0", "is_submitter": "False", "link_id": "t3_rzcems", "parent_id": "t1_hryrvgp", "score": "5", "subreddit": "ItaliaPersonalFinance", "subreddit_id": "t5_3isqn"}, {"author": "LoliLion", "body": "Ciao! Capisco benissimo il timore, ma come qualcuno ha già menzionato sotto a questo post la possibilità di essere beccati aumenti esponenzialmente quando si acquistano rep che non sono in linea col proprio stile di vita (ed è per questo stesso motivo che probabilmente non potrò mai sfoggiare con orgoglio una Birkin 💔). \n\nCredo che essere scoperti o meno dipenda in larga parte dai circoli che si frequentano. Inoltre, ho l'impressione che sia proprio chi spesso acquista rep ad avere l'occhio più allenato nel riconoscere dei falsi, mentre chi fa shopping in una boutique non batte ciglio di fronte ad una borsa dalla cucitura lievemente storta o davanti alla fodera interna di un colore leggermente diverso. \n\nNon preoccuparti troppo, anche perché se sei in giro è difficile che qualcuno abbia tempo a sufficienza per poter fare una radiografia alla borsa e stabilire se sia legit. E se qualcuno ti chiedesse di poterla ispezionare per poi cominciare a frugarci dentro alla ricerca di possibili indizi sull'originalità, il problema principale starebbe in simili frequentazioni 😂\n\nOnestamente non mi sono mai trovata nella situazione di essere \"calloutata\" per delle rep, anzi, ma nel caso succedesse penso cercherei di stringere i denti, avere la faccia di bronzo e direi con la massima pacatezza ed educazione possibile qualcosa come \"non saprei, è un regalo\" o \"l'ho acquistata di seconda mano ed ero a conoscenza del rischio, ma mi piace lo stesso\".", "created_utc": "1641761595.0", "edited": "False", "id": "hryq827", "is_submitter": "False", "link_id": "t3_rzyb3l", "parent_id": "t3_rzyb3l", "score": "9", "subreddit": "FashionRepsIT", "subreddit_id": "t5_qhvso"}, {"author": "LoliLion", "body": "I think the answer mostly depends on what you're interested in studying", "created_utc": "1641730250.0", "edited": "False", "id": "hrwlrrn", "is_submitter": "True", "link_id": "t3_rzefi5", "parent_id": "t1_hruussn", "score": "2", "subreddit": "povertyfinance", "subreddit_id": "t5_hcycg"}, {"author": "LoliLion", "body": "Hi! Thank you for taking the time to comment.\nWhat you're saying made me realize that I probably should have explained myself better.\n\nI never meant to imply that university is completely free, only that's significantly cheaper depending on both the country of your choice and the institution. \nI am Italian and I study in Italy, and tuition fees are between 100€~5,000€ per year depending on your financial situation, and scholarships are available to students coming from low-income households to help them finance their education.\nWhile browsing for a master's degree program I might have been interested in, I learnt that some German universities charge students 600€ per semester and unlimited public transportation use is included in those, regardless of their financial situation. Adding to that, there is plenty of scholarships available to students in Germany too.\nWhen I mentioned this to my French classmates while studying abroad, they thought it was actually quite expensive since they got to pay only 300€ a year, regardless of their financial situation and still got access to various kinds of financial aid. \n\n\nI didn't feel confident enough in giving an overlook of job opportunities after graduation because there are quite some variables to take into consideration, such as the chosen degree and career path, the field you might be interested in workin in, an overall different labor market situation in each country within the EU, and whether or not you are willing to go back to the States once you're finished with your studies.\nEven though being able to speak English is an excellent starting point to move to another country, I agree that learning at least the very foundations of the local language might be of great help.\nAs a general rule, though, English held degree courses in the EU are meant for students who aim to work in an international environment in which English is the mainly spoken language and/or work abroad, and being competitive is not only a matter of how many languages you are able to speak. \n\nIf your goal is to work during your studies, there are some opportunities put into place by universities (e.g. temporary positions at the faculty library, assisting teachers with online platforms and many others) in order to allow students to gain a little extra something, regardless if they have a working visa (these aren't legally and formally considered as jobs). There are also some paid volounteership programmes such as the Service Civique in France (or Servizio Civile Universale in Italy) that do not require you to have a working visa. That said, I realize these might not be as helpful if you wish to gain valuable experience in some fields, but they are quite flexible and they usually don't require more than 25h of commitment per week.\n\nI agree that asking for a visa might take a long time, but some bigger institutions offer international students a lot of administrative support for free in getting through the paperwork process. And as a personal preference, I might want to wait up to 1 year if it means in most cases I will be able to pay for an excellent education just a small fraction (in my case, lower than 5%) of what in the US would be a 100k for a 4 years tuition.", "created_utc": "1641730098.0", "edited": "1641936794.0", "id": "hrwlk7p", "is_submitter": "True", "link_id": "t3_rzefi5", "parent_id": "t1_hruxfyo", "score": "3", "subreddit": "povertyfinance", "subreddit_id": "t5_hcycg"}, {"author": "LoliLion", "body": "\\- Dare una chance ai prodotti di informatica usati e ricondizionati. Ci sono altri siti validi oltre ad Amazon ed E-price dove acquistare (es. Simpaticotech)\n\n\\- Consultare i gruppi FB locali (cerco/vendo/scambio/regalo) per un sacco di offerte interessanti.\n\n\\- Ridurre all'osso gli acquisti fatti sulla base di trend passeggeri.\n\n\\- L'ultimo minuto dei saldi è quello in cui si trovano le offerte migliori, ed è il momento più giusto per assecondare qualche capriccetto.\n\n\\- Non snobbare i discount. Un pacco di biscotti non è poi così diverso da un altro.\n\n\\- Diffidare degli sconti su un ammontare minimo di spesa: spesso si finisce con l'acquistare cose inutili solo per poter usufruire dello sconto.\n\n\\- L'iscrizione in biblioteca può comportare alcuni vantaggi oltre ai classici prestiti, tra cui la possibilità di scaricare numerosi e-book.\n\n\\- Un brand rinomato non è sempre sinonimo di qualità.\n\n\\- Tenere sempre un promemoria sul telefono da aggiornare via via con tutte le idee regalo per amici e parenti in vista di occasioni particolari. Tirare fuori suddetto promemoria in periodo di saldi e mettere da parte gli acquisti fino a momento debito.\n\n\\- Se l'appartamento in cui si vive è provvisto di frigorifero e fornelli, meglio disinstallare l'eterna tentazione data dall'app di Just-Eat. E quella di Deliveroo. E di Uber Eats.\n\n\\- Se si vuole uscire a cena, dare prima un'occhiata agli sconti su The Fork e ai coupon su piattaforme come Groupon per sapere se c'è qualcosa che può interessare.\n\n\\- Parlare di finanza personale col proprio partner. Non è di certo la cosa più elegante da fare, ma specie se non si è sposati aiuta tanto anche a capire se le abitudini siano le stesse e se ci siano le premesse per costruire qualcosa di durevole al riparo da drammi vari ed eventuali.", "created_utc": "1641423030.0", "edited": "False", "id": "hrf0p8j", "is_submitter": "False", "link_id": "t3_rv169m", "parent_id": "t3_rv169m", "score": "1", "subreddit": "ItaliaPersonalFinance", "subreddit_id": "t5_3isqn"}, {"author": "LoliLion", "body": "Fast fashion non è sempre sinonimo di cattiva qualità. Ho alcuni maglioni acquistati da Zara quando avevo 13 anni usati fino allo sfinimento che sono ancora perfetti, non si sono infeltriti né consumati, solo lievemente scoloriti. Certe cose hanno solo bisogno di essere trattate con un po' più di delicatezza.", "created_utc": "1641419351.0", "edited": "False", "id": "hrer2im", "is_submitter": "False", "link_id": "t3_rv169m", "parent_id": "t1_hr4vl5l", "score": "1", "subreddit": "ItaliaPersonalFinance", "subreddit_id": "t5_3isqn"}, {"author": "LoliLion", "body": "Ooops, apologies for not getting the joke on the spot!\n\nBy the way, I agree with you! I just couldn't refrain from pointing out once more how cool gender representation is in Arcane.", "created_utc": "1640123053.0", "edited": "1641290293.0", "id": "hph6jua", "is_submitter": "False", "link_id": "t3_rksrsg", "parent_id": "t1_hph12fs", "score": "1", "subreddit": "arcane", "subreddit_id": "t5_2re2c"}, {"author": "LoliLion", "body": "I'm not sure about that! A bit of an OT, but something that I really loved about Arcane is that the society doesn't feel like a patriarchy at all! That's just my opinion, but power is mainly in women's hands and handed down to female descendants from what I could grasp from a few scenes.\n\nA few examples: Medarda's clan feels mostly women-run, Caitlyn's mother is the head of the family as she sits in the council and Jayce's one is the one who got to speak for her son.\n\nThere are many more valid examples and theories, but I'm afraid they aren't completely spoiler-free :/", "created_utc": "1640118935.0", "edited": "False", "id": "hpgwecw", "is_submitter": "False", "link_id": "t3_rksrsg", "parent_id": "t1_hpdifdf", "score": "1", "subreddit": "arcane", "subreddit_id": "t5_2re2c"}, {"author": "LoliLion", "body": "I can hear Vi really making an effort to restrain drool from spilling, yes.", "created_utc": "1640117390.0", "edited": "False", "id": "hpgsioq", "is_submitter": "False", "link_id": "t3_rksrsg", "parent_id": "t1_hpf35e5", "score": "2", "subreddit": "arcane", "subreddit_id": "t5_2re2c"}, {"author": "LoliLion", "body": "Totally agree! I feel like \"pasticcino\" feels much closer to \"sweetie pie\" rather than \"cupcake\". \n\nDon't know about you, but to me it sounds just like something only your partner with attachment issues and your grandma could call you.", "created_utc": "1640117194.0", "edited": "False", "id": "hpgs0s8", "is_submitter": "False", "link_id": "t3_rksrsg", "parent_id": "t1_hpcp7qr", "score": "1", "subreddit": "arcane", "subreddit_id": "t5_2re2c"}, {"author": "LoliLion", "body": "Plot twist: he doesn't have any children.", "created_utc": "1636854093.0", "edited": "False", "id": "hkj4e3d", "is_submitter": "False", "link_id": "t3_qru2bp", "parent_id": "t3_qru2bp", "score": "1", "subreddit": "antiwork", "subreddit_id": "t5_2y77d"}, {"author": "LoliLion", "body": "Hey!\n\nI suggest checking this Ryanair link out: [https://www.ryanair.com/ie/en/cheap-flights/?out-from-date=2021-10-17&out-to-date=2022-10-17&budget=150](https://www.ryanair.com/ie/en/cheap-flights/?out-from-date=2021-10-17&out-to-date=2022-10-17&budget=150)\n\nYou just have to set your departure airport and let it do the magic for you. This will allow you to check which are the cheapest flights and destinations for the upcoming months.\n\nJust make sure you set \"Anywhere\" as the destination, \"anytime\" as fly out date and \"one way\" as flight back if you want to get the most convenient tickets! Most destinations are in Europe, but there are some more exotic ones that are worth checking, in my opinion.\n\nI used this tool a couple of times for short trips and I keep recommending it since then. Hope this helps :)", "created_utc": "1635708351.0", "edited": "False", "id": "hisrz6j", "is_submitter": "False", "link_id": "t3_qis9uf", "parent_id": "t3_qis9uf", "score": "1", "subreddit": "Shoestring", "subreddit_id": "t5_2vv1j"}, {"author": "LoliLion", "body": "I agree on the unwrapping and on the quantity! \n\nI still remember that on my 7th birthday my parents made clear that they couldn't afford to buy a present, but they decided anyways to wrap a dozen or so objects that they found around the house and have me find them. \n\nIt has been unconventional and fun, and there was always a little bit of excitement in having absolutely zero clues on what I could find next.\n\nOne of those presents was a tiny wooden safe box in which they encouraged me to keep my savings later on :)", "created_utc": "1635355289.0", "edited": "False", "id": "hi9r4nm", "is_submitter": "False", "link_id": "t3_qgxmjr", "parent_id": "t1_hi92jyr", "score": "11", "subreddit": "povertyfinance", "subreddit_id": "t5_hcycg"}, {"author": "LoliLion", "body": "Hey! I'm very sorry to hear this and I hope you'll soon be able to figure this out. Here are a few tips:\n\nInvite someone over for dinner (family, friends, coworkers, doesn't really matter) for an informal gathering, and agree that everyone will bring something different (first course, second course, beverages, dessert, appetizers, etc.).  I can't really tell for other countries, but it often happens in Italy to throw parties in which the host is usually left with leftovers at the end of the night, and people almost always end up overestimating other guests' appetite.  It would allow you to have a decent meal, and if everything goes as planned you can go on for a few days more.\n\n\rAsk your neighbors for basic and inexpensive items, like flour, eggs, milk, rice. If you feel uncomfortable you can always tell them you ran out of one of those things in the middle of making a recipe and that you'll give them back as soon as you go grocery shopping.\n\n\rAlso, try to find new openings in your city. Bar/cafes/restaurants will often serve something from their menus for free in order to promote their business. Check your local news regularly to find such opportunities.\n\nSome bakeries throw away what they weren't able to sell during the day. Go visit some of them right before they close and ask if you can get something that otherwise would go wasted.\n\n\rAsk in Facebook groups for unused grocery coupons. Some people just collect them and never use them, but will have no problem in handing them over to someone who's interested in them.\n\nI hope this can be helpful. Good luck!", "created_utc": "1633112340.0", "edited": "False", "id": "hf04y0t", "is_submitter": "False", "link_id": "t3_pyp69v", "parent_id": "t3_pyp69v", "score": "2", "subreddit": "povertyfinance", "subreddit_id": "t5_hcycg"}, {"author": "LoliLion", "body": "He doesn't have any mood other than pissed, i'm starting to believe.", "created_utc": "1610290430.0", "edited": "False", "id": "girlq35", "is_submitter": "False", "link_id": "t3_ktvjzs", "parent_id": "t1_gir9zj4", "score": "4", "subreddit": "Catswhoyell", "subreddit_id": "t5_jzp47"}, {"author": "LoliLion", "body": "So sorry about that! But i can guarantee that the royal baby is totally fine, and was just contemplating out loud the idea of firing his staff.", "created_utc": "1610290344.0", "edited": "False", "id": "girllvx", "is_submitter": "False", "link_id": "t3_ktvjzs", "parent_id": "t1_giq93cl", "score": "3", "subreddit": "Catswhoyell", "subreddit_id": "t5_jzp47"}, {"author": "LoliLion", "body": "Italian culture at its finest.", "created_utc": "1610290151.0", "edited": "False", "id": "girldsf", "is_submitter": "False", "link_id": "t3_ktvjzs", "parent_id": "t1_gir3um8", "score": "2", "subreddit": "Catswhoyell", "subreddit_id": "t5_jzp47"}, {"author": "LoliLion", "body": "Unfortunately, there isn't :(", "created_utc": "1610289837.0", "edited": "False", "id": "girkyab", "is_submitter": "False", "link_id": "t3_ktvjzs", "parent_id": "t1_gipzv3g", "score": "2", "subreddit": "Catswhoyell", "subreddit_id": "t5_jzp47"}, {"author": "LoliLion", "body": "\\- *Miaoooooo*\n\n*Che c’è?*\n\n\\- *Miiaaaaaaaaaoooaoooo*\n\n*Dimmi! Non capisco!*\n\n\\- *Miaooooo Miaooooo*\n\n*Cosa c’è? Cosa? Che ti manca?* \n\n\\- *Miaooo*\n\n*Non ti manca niente, sei un viziato! Che vuoi fare?* \n\n\\- *Miiiiiiaaaaaaoooo*\n\n*Vuoi uscire?* \n\n*(dad, in the distance) Il gatto parla!*\n\n\\- *Miaoooooo*\n\n*Vuoi uscire? Non vuoi uscire.* \n\n\\- *Miaooo*\n\n*Che si fa? Dimmi?* \n\n\\- *Miaaaaaaaaaaaaaaaaaooo*\n\n*Eh no, questi insulti no!* \n\n*Ti sei deciso? Forse.* \n\n*Bravo!* \n\n*Finalmente…*", "created_utc": "1610289461.0", "edited": "False", "id": "girkdj2", "is_submitter": "False", "link_id": "t3_ktvjzs", "parent_id": "t1_giqhp73", "score": "7", "subreddit": "Catswhoyell", "subreddit_id": "t5_jzp47"}, {"author": "LoliLion", "body": "And so was i.", "created_utc": "1610288928.0", "edited": "False", "id": "girjl1d", "is_submitter": "False", "link_id": "t3_ktvjzs", "parent_id": "t1_giqtsx9", "score": "7", "subreddit": "Catswhoyell", "subreddit_id": "t5_jzp47"}, {"author": "LoliLion", "body": "Fun fact: the dialects spoken in this Italian region (Liguria) sound very much like Portuguese to me.", "created_utc": "1610288631.0", "edited": "False", "id": "girj5ao", "is_submitter": "False", "link_id": "t3_ktvjzs", "parent_id": "t1_giq38cc", "score": "2", "subreddit": "Catswhoyell", "subreddit_id": "t5_jzp47"}, {"author": "LoliLion", "body": " Since i already answered this question once, i hope you won't mind if i just copy-paste that one!\n\n>Hey, I'm OP's GF :)  \n>  \n>There's no need to be too worried, he has learnt how to open it! My parents built it that way because there are quite a lot of stray cats around our neighborhood and they have already made a mess a few times when they got their way in.", "created_utc": "1610288462.0", "edited": "False", "id": "giriwcq", "is_submitter": "False", "link_id": "t3_ktvjzs", "parent_id": "t1_gipojf1", "score": "1", "subreddit": "Catswhoyell", "subreddit_id": "t5_jzp47"}, {"author": "LoliLion", "body": "Mica tanto... A momenti non riesce a passare dalla gattaiola!", "created_utc": "1610236809.0", "edited": "False", "id": "gipjhs8", "is_submitter": "False", "link_id": "t3_ktvjzs", "parent_id": "t1_gipfo3k", "score": "3", "subreddit": "Catswhoyell", "subreddit_id": "t5_jzp47"}, {"author": "LoliLion", "body": "It's just for the camera, i promise. I was the one who had to put everything on pause and check what he needed because he wouldn't stop screaming at me.", "created_utc": "1610232929.0", "edited": "1610241339.0", "id": "gipc1mp", "is_submitter": "False", "link_id": "t3_ktvjzs", "parent_id": "t1_gip73g3", "score": "8", "subreddit": "Catswhoyell", "subreddit_id": "t5_jzp47"}, {"author": "LoliLion", "body": "for *who*?", "created_utc": "1610232704.0", "edited": "False", "id": "gipblso", "is_submitter": "False", "link_id": "t3_ktvjzs", "parent_id": "t1_giotpb1", "score": "6", "subreddit": "Catswhoyell", "subreddit_id": "t5_jzp47"}, {"author": "LoliLion", "body": "Italian, but i might be a little bit biased", "created_utc": "1610230745.0", "edited": "False", "id": "gip7oap", "is_submitter": "False", "link_id": "t3_ktvjzs", "parent_id": "t1_gip3kkc", "score": "40", "subreddit": "Catswhoyell", "subreddit_id": "t5_jzp47"}, {"author": "LoliLion", "body": "Actually no, he will come in by himself. But he might turn it on early in the morning to let you know that it is time to feed him and go to work, so you can make money to keep feeding him.", "created_utc": "1610230693.0", "edited": "False", "id": "gip7kfw", "is_submitter": "False", "link_id": "t3_ktvjzs", "parent_id": "t1_gip4fqn", "score": "53", "subreddit": "Catswhoyell", "subreddit_id": "t5_jzp47"}, {"author": "LoliLion", "body": "I'm sure he's still wondering why we can't understand him. I mean... He made the effort to learn italian *for us* but we aren't even trying to get him!!!", "created_utc": "1610230312.0", "edited": "False", "id": "gip6sij", "is_submitter": "False", "link_id": "t3_ktvjzs", "parent_id": "t1_gip3ygz", "score": "4", "subreddit": "Catswhoyell", "subreddit_id": "t5_jzp47"}, {"author": "LoliLion", "body": "Thank you very much! I guess the accent is from Lombardia and/or Liguria. I have moved a few times between the two regions, so i'm not really sure.", "created_utc": "1610230029.0", "edited": "False", "id": "gip67np", "is_submitter": "False", "link_id": "t3_ktvjzs", "parent_id": "t1_gip0426", "score": "73", "subreddit": "Catswhoyell", "subreddit_id": "t5_jzp47"}, {"author": "LoliLion", "body": "I haven't noticed until you pointed it out! Thanks, it made me smile!", "created_utc": "1610229652.0", "edited": "False", "id": "gip5g4x", "is_submitter": "False", "link_id": "t3_ktvjzs", "parent_id": "t1_giolhtg", "score": "128", "subreddit": "Catswhoyell", "subreddit_id": "t5_jzp47"}, {"author": "LoliLion", "body": "There's no escaping from him.", "created_utc": "1610229598.0", "edited": "False", "id": "gip5c9m", "is_submitter": "False", "link_id": "t3_ktvjzs", "parent_id": "t1_gioy18u", "score": "23", "subreddit": "Catswhoyell", "subreddit_id": "t5_jzp47"}, {"author": "LoliLion", "body": "\"Bravo\" is the masculine and singular form, while \"Bravi\" is its plural form. \n\n\"Brava\" is the feminine singular, and \"Brave\" is the plural!\n\nGood luck with your learning journey!", "created_utc": "1610224367.0", "edited": "False", "id": "gioulo8", "is_submitter": "False", "link_id": "t3_ktvjzs", "parent_id": "t1_giotwm3", "score": "30", "subreddit": "Catswhoyell", "subreddit_id": "t5_jzp47"}, {"author": "LoliLion", "body": "Popovich, anche se in famiglia preferiscono chiamarlo solo \"gatto\", \"micio\", \"amore\", \"piccino\" o altri vezzeggiativi! Ogni tanto anche \"ciccione\".", "created_utc": "1610224176.0", "edited": "False", "id": "giou7qq", "is_submitter": "False", "link_id": "t3_ktvjzs", "parent_id": "t1_giot5ru", "score": "20", "subreddit": "Catswhoyell", "subreddit_id": "t5_jzp47"}, {"author": "LoliLion", "body": "Probably you didn't recognize the language because they were talking to \\*people\\* (and weren't drowning in frustration trying to understand some being whose only explanation for their behavior was \"MEOOOOOOOOWWWYAAAAOOWWW\")", "created_utc": "1610223954.0", "edited": "False", "id": "giotr9y", "is_submitter": "False", "link_id": "t3_ktvjzs", "parent_id": "t1_gior1om", "score": "52", "subreddit": "Catswhoyell", "subreddit_id": "t5_jzp47"}, {"author": "LoliLion", "body": "He is NOT the victim! I repeat: he is NOT the victim! In fact, i am.\n\nBelieve me, i really tried to pet him before filming this, but he just wanted to be an indipendent guy.", "created_utc": "1610223678.0", "edited": "False", "id": "giot7lj", "is_submitter": "False", "link_id": "t3_ktvjzs", "parent_id": "t1_gioqya1", "score": "50", "subreddit": "Catswhoyell", "subreddit_id": "t5_jzp47"}, {"author": "LoliLion", "body": "With him it is more often than not an extremely tired \"what's wrong?\", as he bullies us multiple times a day (i'm the one who was unsuccessfully asking him \"che c'è?\" in the video)", "created_utc": "1610223353.0", "edited": "False", "id": "giosiky", "is_submitter": "False", "link_id": "t3_ktvjzs", "parent_id": "t1_gioplyh", "score": "219", "subreddit": "Catswhoyell", "subreddit_id": "t5_jzp47"}, {"author": "LoliLion", "body": "Nei manuali in dotazione lo si trova anche alla voce \"cicciottone\", ma gli esperti sono concordi nel dire che è un comunissimo esemplare di cosino carino.", "created_utc": "1610222971.0", "edited": "False", "id": "giorp86", "is_submitter": "False", "link_id": "t3_ktvjzs", "parent_id": "t1_gioqueb", "score": "29", "subreddit": "Catswhoyell", "subreddit_id": "t5_jzp47"}, {"author": "LoliLion", "body": "Yeah, that was the case, but he is not so picky with reasons for yelling: always screams at me whenever he needs to go to the bathroom, wants cuddles, runs out of food or just has too much food in his bowl. And he's definitely our great master.\n\n(OP's GF here!)", "created_utc": "1610222678.0", "edited": "False", "id": "gior3vw", "is_submitter": "False", "link_id": "t3_ktvjzs", "parent_id": "t1_giop0qw", "score": "52", "subreddit": "Catswhoyell", "subreddit_id": "t5_jzp47"}, {"author": "LoliLion", "body": "Thank you for letting me know, didn't know about this! Unfortunately, the tiny hatch is built on a bigger sliding door which purpose is to let vehicles as big as a truck in, so i'm afraid that it is not a viable option since the plants could obstruct the way.", "created_utc": "1610222091.0", "edited": "False", "id": "giopwu8", "is_submitter": "False", "link_id": "t3_ktvjzs", "parent_id": "t1_giooh2t", "score": "132", "subreddit": "Catswhoyell", "subreddit_id": "t5_jzp47"}, {"author": "LoliLion", "body": "Hey, I'm OP's GF :) \n\nThere's no need to be too worried, he has learnt how to open it! My parents built it that way because there are quite a lot of stray cats around our neighborhood and they have already made a mess a few times when they got their way in.", "created_utc": "1610220613.0", "edited": "False", "id": "giomuea", "is_submitter": "False", "link_id": "t3_ktvjzs", "parent_id": "t1_giolv7c", "score": "70", "subreddit": "Catswhoyell", "subreddit_id": "t5_jzp47"}, {"author": "LoliLion", "body": "Thanks for the advice! Would you recommend any in particular?", "created_utc": "1605546738.0", "edited": "False", "id": "gcig5fw", "is_submitter": "True", "link_id": "t3_jv656g", "parent_id": "t1_gcias7n", "score": "1", "subreddit": "ResinCasting", "subreddit_id": "t5_2yqob"}]