[{"author": "LordArkana", "body": "I tried it yesterday, but for some reason I'm not receiving invites in game when I join a fireteam. If I create a fireteam, I can invite people without issue. I set everything to public and yet, no invites.", "created_utc": "1666965447.0", "edited": "False", "id": "iu4eyqw", "is_submitter": "False", "link_id": "t3_y7s18d", "parent_id": "t3_y7s18d", "score": "2", "subreddit": "DestinyTheGame", "subreddit_id": "t5_2vq0w"}, {"author": "LordArkana", "body": "There's a setting included with the DLC to turn off traumatic births, so hopefully you can get to enjoy it without fear of such events happening :)", "created_utc": "1666710911.0", "edited": "False", "id": "itqcy4i", "is_submitter": "False", "link_id": "t3_yd3ksz", "parent_id": "t1_itqbqz0", "score": "121", "subreddit": "RimWorld", "subreddit_id": "t5_2yjxo"}, {"author": "LordArkana", "body": "Oh man, the amount of times I've had to stumble through French and English words to explain something to my father, a Spanish speaking immigrant who never mastered either of the other 2 languages...\nAnd my Spanish is intermediate at best, so that makes for fun conversations.", "created_utc": "1664319915.0", "edited": "False", "id": "iq61vxq", "is_submitter": "False", "link_id": "t3_xozvcd", "parent_id": "t3_xozvcd", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "LordArkana", "body": "I think I found it on NexusMods here: https://www.nexusmods.com/planetcrafter/mods/23?tab=description  \n\n\n Altough I have no idea how it works. The description isn't very clear for me, there's a .dll file but I'm not sure where I'm supposed to put it?", "created_utc": "1663857143.0", "edited": "False", "id": "iph17vw", "is_submitter": "True", "link_id": "t3_xe69hs", "parent_id": "t1_iog3hpg", "score": "1", "subreddit": "theplanetcrafter", "subreddit_id": "t5_4qoj4j"}, {"author": "LordArkana", "body": "Colombia arrives with the best party music you've ever danced to, but everyone just keeps asking them where the coke is. And I dont mean the drink.", "created_utc": "1662299891.0", "edited": "False", "id": "in1z7ct", "is_submitter": "False", "link_id": "t3_x5jrqi", "parent_id": "t3_x5jrqi", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "LordArkana", "body": "Saved by Icaromus, thank you!", "created_utc": "1661785835.0", "edited": "False", "id": "im9jgz6", "is_submitter": "True", "link_id": "t3_x0qaf9", "parent_id": "t3_x0qaf9", "score": "1", "subreddit": "RaftRescues", "subreddit_id": "t5_2k62md"}, {"author": "LordArkana", "body": "I expected no less from Lil Nas X, and I'm glad he's as great a person as I thought he was. What a great birthday gift!", "created_utc": "1661784751.0", "edited": "False", "id": "im9gv4m", "is_submitter": "False", "link_id": "t3_x0eikg", "parent_id": "t3_x0eikg", "score": "26", "subreddit": "offmychest", "subreddit_id": "t5_2ranw"}, {"author": "LordArkana", "body": "Ah, and here I was so happy I finally knew the answer to one of these, hah. BYOND was amazing, I also used toplay those DBZ games and other fun RPGs.", "created_utc": "1661376089.0", "edited": "False", "id": "ilncyax", "is_submitter": "False", "link_id": "t3_wwqfx8", "parent_id": "t3_wwqfx8", "score": "1", "subreddit": "tipofmyjoystick", "subreddit_id": "t5_2vkzr"}, {"author": "LordArkana", "body": "Yes, I managed to make everything up and running without the 1650! I think it might have been the Resize BAR all along. Once again, your help has been invaluable.", "created_utc": "1654567663.0", "edited": "False", "id": "ibfvjdt", "is_submitter": "True", "link_id": "t3_v5f9c5", "parent_id": "t1_ibdp9le", "score": "1", "subreddit": "buildapc", "subreddit_id": "t5_2rnve"}, {"author": "LordArkana", "body": "This feels really ridiculous, but I disabled the resize bar thing and suddenly it all works! The RTX 3060 is finally displaying! Turning on the Above 4g alone didn't fix it, I had to disable the resize bar...\nThank you so much for your help, now I'll have to remove the old GPU and restart and hope everything will still work!", "created_utc": "1654469767.0", "edited": "False", "id": "ibayk35", "is_submitter": "True", "link_id": "t3_v5f9c5", "parent_id": "t1_ibavnj1", "score": "1", "subreddit": "buildapc", "subreddit_id": "t5_2rnve"}, {"author": "LordArkana", "body": "Alright, I'll try enabling that. While I'm in the BIOS, there's also PCI Latency Timer set to 32 bus clocks, does that uave an incidence? It goes up to 248.\nPEG0 is set to Auto and Re-size BAR support is enabled.", "created_utc": "1654467556.0", "edited": "False", "id": "ibau73i", "is_submitter": "True", "link_id": "t3_v5f9c5", "parent_id": "t1_ibasz46", "score": "1", "subreddit": "buildapc", "subreddit_id": "t5_2rnve"}, {"author": "LordArkana", "body": "Yup, it shows up along with my 1650, and the drivers are installed and up to date. Although, I get a message saying the device can't find enough free resources: [Image](https://postimg.cc/PPqjsNdk)\n\nSo the good news is it works and is recognized, now I need to find out how to make it display...", "created_utc": "1654464722.0", "edited": "False", "id": "ibaog4v", "is_submitter": "True", "link_id": "t3_v5f9c5", "parent_id": "t1_iba4wx4", "score": "1", "subreddit": "buildapc", "subreddit_id": "t5_2rnve"}, {"author": "LordArkana", "body": "Ok, so I tried putting both graphics cards at once and plugging them both to my monitor in order to access thr BIOS and see what happens. The board explorer shows both cards as being present[Board explorer](https://postimg.cc/gallery/m1dkDRk)\n\nSlot E1 is the 1650, slot E4 is the 3060. The VGA debug light on the motherboard is off, as are the rest of the lights.\nDoes it mean the card is ok? It still won't work if I try switching the signal on my monitor.", "created_utc": "1654447898.0", "edited": "False", "id": "ib9p5ri", "is_submitter": "True", "link_id": "t3_v5f9c5", "parent_id": "t3_v5f9c5", "score": "1", "subreddit": "buildapc", "subreddit_id": "t5_2rnve"}, {"author": "LordArkana", "body": "The VGA/HDMI adapter is one I found laying around, I'm using it just to test. I actually ordered a HDMI to DVI cable which I will use until I can afford a new monitor.\n\nI don't know how to reset the CMOS, I'll look it up in the manual but I'm not sure it will be there.\n\nI checked the troubleshoot LED, and indeed, the VGA white light is on, but the GPU seems functional with all its lights and fans on. What does it mean? What should I do with that information?", "created_utc": "1654445845.0", "edited": "False", "id": "ib9ktbf", "is_submitter": "True", "link_id": "t3_v5f9c5", "parent_id": "t1_ib9ho2d", "score": "1", "subreddit": "buildapc", "subreddit_id": "t5_2rnve"}, {"author": "LordArkana", "body": "My BIOS mode had both Legacy+UEFI enabled, I think it should be able to work both ways like this? Just in case, I switched to UEFI only. Unfortunately it didn't work.  \nHow would I update a Windows installation to UEFI without reinstalling?", "created_utc": "1654445674.0", "edited": "False", "id": "ib9kglj", "is_submitter": "True", "link_id": "t3_v5f9c5", "parent_id": "t1_ib9h19z", "score": "1", "subreddit": "buildapc", "subreddit_id": "t5_2rnve"}, {"author": "LordArkana", "body": "Oh yeah, this happened to me on a throwaway account, which I understand, but isn't the point of the throwaway to be anonymous?! It defeats the purpose if my post can't get through.\nAlso I decided to post with my main, and it did go through in this sub... but my post had 0 interaction. Absolutely nothing. Meanwhile, some posts with almost no content get 1k upvotes and 200 comments for some reason. It sucks when you're looking for support and you get buried under random crap.", "created_utc": "1649853618.0", "edited": "False", "id": "i4k3kdi", "is_submitter": "False", "link_id": "t3_u2nl9x", "parent_id": "t3_u2nl9x", "score": "8", "subreddit": "offmychest", "subreddit_id": "t5_2ranw"}, {"author": "LordArkana", "body": "Medical technologist. They'd have to acknowledge we exist and there's not just nurses and doctors in a hospital...", "created_utc": "1648641991.0", "edited": "False", "id": "i2pe0gm", "is_submitter": "False", "link_id": "t3_tr52ew", "parent_id": "t3_tr52ew", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "LordArkana", "body": "I assume this is the reply to my post, so I'll answer here. My partner was already on estrogen when we started dating, I really didn't mind. What matters to me is the language change, the new pronouns, how people refer to them and how our relationship looks. It doesn't feel right for me to be with a woman, and I don't have a definite answer as to why, I know I need therapy for this. I'm non-binary as well, but appear male to people, so they'll just see a straight couple, which we are not.\nI'm also very sad and upset because as most trans women do, my partner hates their voice. But I find it beautiful, soothing and familiar. If they do voice therapy, I'll lose a large part of the familiarity and features that I love about them. My partner also has a lot of dysphoria, and whenever they talk to me about the specifics of it, it's always about things I love about them, so it's hard to say the right thing and keep a straight face. \nAs for the back pain, I found a kind of therapy that could work, but it's only in the private sector so I can't afford it. I might look for trials though, thanks for the idea.", "created_utc": "1647041373.0", "edited": "False", "id": "i0b0419", "is_submitter": "False", "link_id": "t3_tbsii9", "parent_id": "t1_i09thec", "score": "1", "subreddit": "SuicideWatch", "subreddit_id": "t5_2qpzs"}, {"author": "LordArkana", "body": "This is awfully nice of you, thank you.  \n\n\nI posted on r/offmychest already, and my post got buried with absolutely no interaction. I hate how this algorithm works, I didn't get any help at all and it would feel desperate to comment to bring it back up.  \n\n\nI have a wonderful partner I fell in love with 10 years ago, but we didn't start dating until 3 years ago because we both were in relationships. It's been great, but they since came out as a trans woman; I'm exclusively attracted to men and non-binary people, not women, unfortunately. They used to be non-binary and already discarded the idea of being a woman at the time we started dating, but this changed a few months ago, and I feel hurt and betrayed. I know it's not about me, but I don't want to lose the love of my life because of their gender; I just can't see myself with a woman, it doesn't feel right. They're going to change everything I love about them and I can't stand it. They were perfect to me and now, so many things are different and I don't like the changes... but I can't tell them that, I don't know what to do. We're engaged and I still love them very much, I wish they could just be non-binary again...  \n\n\nAlso, I have had chronic back pain for 4 years, and I'm off work since 7 months for it. Xrays and MRI revealed nothing, it seems muscular, but physiotherapy didn't help except making me more flexible; the pain is still there, and sometimes worse. It's been really bad for the past 4-5 days. I tried many types of painkillers, none of them work. I wish I had the ability to go back to work and stop feeling like a useless lump, but it hurts so much and no treatment seems possible. I'm worried my job will stop paying me because it's been too long and there's no obvious diagnostic.   \n\n\nThat on top of everything else, and I've been having passive s\\*\\*dal thoughts since yesterday. I've never wanted to actively hurt myself, but I'm starting to think none of my problems are gonna get fixed. My partner isn't going to not be a woman, and my back pain will never go away. I just don't see why I'd stick around in this condition, life is just... not enjoyable right now.", "created_utc": "1647023150.0", "edited": "False", "id": "i09ru5n", "is_submitter": "False", "link_id": "t3_tbsii9", "parent_id": "t3_tbsii9", "score": "3", "subreddit": "SuicideWatch", "subreddit_id": "t5_2qpzs"}, {"author": "LordArkana", "body": "Hi OP, without more information it's difficult to judge the situation correctly, but I'm glad you decided to reach out for help here. You say your times in a bathhouse were bad because of your appearance, did anyone explicitly tell you that or made you feel that way, or you believe that's why it didn't go well? There are so many people out there, into all the different kinds of bodies, and I know it's difficult to accept ourselves when we don't fit the norm, because I'm the same way. I love sex, but I hate my body and I feel I can't submit it to a poor innocent stranger. Yet I know many people who are into me, and I do have a partner; those intrusive thoughts are hard to get rid of, but I promise you you're not ugly.  \nYou mention your IQ is low, but I honestly believe that's not the case. IQ is based on sketchy data, and there are many people talented in some areas who aren't in others. Also, if you are depressed and possibly suffering from something else, it's perfectly normal that you can't focus on work and have memory issues. It's not your fault and definitely doesn't mean you're not smart; being preoccupied with these heavy thoughts will take a toll on your brain. I don't know if you already have a therapist, but they're here to help you, so if/when you decide to talk to one, approach the subject in the way that makes you comfortable; they are trained professionals, the important thing is for you to feel safe talking about this. I wish you the best, OP.", "created_utc": "1647022574.0", "edited": "False", "id": "i09qa1x", "is_submitter": "False", "link_id": "t3_tbtf44", "parent_id": "t3_tbtf44", "score": "2", "subreddit": "SuicideWatch", "subreddit_id": "t5_2qpzs"}, {"author": "LordArkana", "body": "I played Panic on Funkotron so much as a child, and I still find it incredibly fun. Somehow I never got into the other installments.", "created_utc": "1646491925.0", "edited": "False", "id": "hzgg56o", "is_submitter": "False", "link_id": "t3_t6sb9j", "parent_id": "t1_hzdere0", "score": "2", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "LordArkana", "body": "Hey OP, I've been debating making a similar post to yours because I'm in a very similar situation. I don't want to take over by sharing part of my story, but I thought it could make you feel better knowing you're not alone.\nI had a crush on a guy since college, over 10 years ago. We were both in relationships at the time, but 3 years ago they ended things and so did I, and we started dating. Before we did, they came out as non-binary. Now I'd been exclusively attracted to men, but after many conversations I realized it didnt matter that my partner was not a man and I adapted. Everything worked out.\nThen my partner started medical transition with estrogen, and I had to adjust but I was still fine. They also told me a few times about thinking they were a trans woman a few years ago, but dismissed that idea. I unlearned many things and also learned more about my own attractions.\nSometimes in 2021, my partner made the reveal that their gender was probably female after all, that they were a woman, and would probably change their pronouns as well. I... haven't been taking it well. \nIn our case, there was no repressing or lying, I was aware from day 1, but I really, really did not expect my partner to be a woman after all the years they had to reflect on it, all the comments they made about it... it feels like a betrayal to me. They could have been any gender, I would have been fine with it, just not woman. It feels like a cruel joke. I wish I was just pansexual and could deal with it. Worst part is, I'm also trans myself, so I get it, I do. But it hurts and I don't know what to do.\n\nAnyways, once again sorry for venting here, but I wanted to say I get it and I empathize. Feel free to reach out if you need to.", "created_utc": "1645467258.0", "edited": "False", "id": "hxuywjh", "is_submitter": "False", "link_id": "t3_sxw5rz", "parent_id": "t3_sxw5rz", "score": "6", "subreddit": "offmychest", "subreddit_id": "t5_2ranw"}, {"author": "LordArkana", "body": "Oh lord, if a 2080 Ti is weighing you down, I'd gladly take it from you... I'm running with a borrowed 1650 LP right now, upgraded from a 1050 Ti :')", "created_utc": "1644640896.0", "edited": "False", "id": "hwlsgcd", "is_submitter": "False", "link_id": "t3_sq7k08", "parent_id": "t1_hwkymip", "score": "3", "subreddit": "bapcsalescanada", "subreddit_id": "t5_2tesr"}, {"author": "LordArkana", "body": "I selected the Separate all input jacks option in the Audio console, but in the Sound control panel, in the Recording tab, I have many options (Mic in at rear panel (pink), Microphone, Line in, Line in at front panel (green), etc.) but none of them are available, it all says Not plugged in. Is there something else I can do?", "created_utc": "1643999611.0", "edited": "False", "id": "hvleon5", "is_submitter": "False", "link_id": "t3_sig2ea", "parent_id": "t1_hvl6twk", "score": "1", "subreddit": "pcgaming", "subreddit_id": "t5_2qhfg"}, {"author": "LordArkana", "body": "My headset microphone isn't working with my new setup. I recently bought a new case, this one: [https://lian-li.com/product/lancool-ii/](https://lian-li.com/product/lancool-ii/)   \nAnd on the front of the case, there's a single plug for connecting both headphones and a mic, there are two little icons representing these things, so I assume it does both. When I plug my headset, which is a single connection as well, it works for the sound just fine, but the microphone doesn't seem to be recognized at all. \n\nWhat could be the problem? I followed all instructions to connect the cables to the motherboard properly, and since the sound works it should be fine. The mic worked perfectly on any other device I use it for (PS4, Xbox, laptop).  \n\n\nMy headset is a cheap Kotioneach G2000.", "created_utc": "1643988990.0", "edited": "False", "id": "hvkltgl", "is_submitter": "False", "link_id": "t3_sig2ea", "parent_id": "t3_sig2ea", "score": "1", "subreddit": "pcgaming", "subreddit_id": "t5_2qhfg"}, {"author": "LordArkana", "body": "Thanks for this, and the very same to you. You also deserve to be respected and loved. I hope you have a great day.", "created_utc": "1643755644.0", "edited": "False", "id": "hv746hy", "is_submitter": "False", "link_id": "t3_si6h0g", "parent_id": "t3_si6h0g", "score": "4", "subreddit": "offmychest", "subreddit_id": "t5_2ranw"}, {"author": "LordArkana", "body": "I speak French, but I'm from Quebec, Canada so it took me a looong time to realize \"I slap my balls on it\" was \"Je m'en bats les couilles\", a popular expression in France but definitely not here. In Quebec, we use church words as verbs, such as \"Je m'en calisse\" to say we don't give a fuck.", "created_utc": "1641307282.0", "edited": "False", "id": "hr7ud4s", "is_submitter": "False", "link_id": "t3_rv3yiv", "parent_id": "t3_rv3yiv", "score": "1", "subreddit": "WhitePeopleTwitter", "subreddit_id": "t5_35n7t"}, {"author": "LordArkana", "body": "Oh hell, that was actually it!! I got the lyrics wrong, but as soon as the melody started playing, all the memories came back! Thank you so much, you've finally put my mind at rest!\n\nSolved!", "created_utc": "1637859713.0", "edited": "1637859898.0", "id": "hm1wk0l", "is_submitter": "True", "link_id": "t3_5pfzrq", "parent_id": "t1_hlsqv2u", "score": "2", "subreddit": "tipofmytongue", "subreddit_id": "t5_2r4oc"}, {"author": "LordArkana", "body": "I did that coupled with restarting the PC, it worked! Thanks.", "created_utc": "1636226188.0", "edited": "False", "id": "hjl2jwv", "is_submitter": "True", "link_id": "t3_qo5oxb", "parent_id": "t1_hjl176z", "score": "1", "subreddit": "pcbuildingsimulator", "subreddit_id": "t5_3g8g2"}, {"author": "LordArkana", "body": "Aha, the good old turning it off and on again. Restarting the PC did the trick, I knew it was something ridiculous like that! Thanks.", "created_utc": "1636226165.0", "edited": "False", "id": "hjl2i0p", "is_submitter": "True", "link_id": "t3_qo5oxb", "parent_id": "t1_hjkxyi7", "score": "2", "subreddit": "pcbuildingsimulator", "subreddit_id": "t5_3g8g2"}, {"author": "LordArkana", "body": "I'm a native French speaker, I also wonder the same thing. The one mistake that infuriates me the most is the use of \"of\" instead of \"have\". For the longest time I couldn't understand how people could ever think \"would of\" made sense in a phrase (I learned 90% of English by reading only) then I realized... would've sounds a hell of a lot like would of depending on the accents and how fast people speak. So I get it now, but it still annoys me.", "created_utc": "1628033873.0", "edited": "False", "id": "h7m5ipx", "is_submitter": "False", "link_id": "t3_ox1iei", "parent_id": "t3_ox1iei", "score": "0", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "LordArkana", "body": "Sorry it took me so long to get back to you, but yes! It was Alma Sebosa! Thank you so much!\nSolved!", "created_utc": "1593221523.0", "edited": "False", "id": "fw4i6ia", "is_submitter": "True", "link_id": "t3_fxde2o", "parent_id": "t1_fuq6pfd", "score": "2", "subreddit": "tipofmytongue", "subreddit_id": "t5_2r4oc"}, {"author": "LordArkana", "body": "Yes!\n\"1.21 gigawatts?\" Back to the future", "created_utc": "1587335105.0", "edited": "False", "id": "fnxb6go", "is_submitter": "False", "link_id": "t3_g4gkpz", "parent_id": "t3_g4gkpz", "score": "1", "subreddit": "acturnips", "subreddit_id": "t5_2vpf3"}, {"author": "LordArkana", "body": "Hi!\n1.21 Gigawatts? -Back to the future", "created_utc": "1587334994.0", "edited": "False", "id": "fnxazm6", "is_submitter": "False", "link_id": "t3_g4gkpz", "parent_id": "t3_g4gkpz", "score": "1", "subreddit": "acturnips", "subreddit_id": "t5_2vpf3"}, {"author": "LordArkana", "body": "Me! \n\"1,21 gigawatts!\" Back to the future", "created_utc": "1587334862.0", "edited": "False", "id": "fnxarad", "is_submitter": "False", "link_id": "t3_g4gkpz", "parent_id": "t3_g4gkpz", "score": "1", "subreddit": "acturnips", "subreddit_id": "t5_2vpf3"}, {"author": "LordArkana", "body": "Victoria", "created_utc": "1587333701.0", "edited": "False", "id": "fnx8pu4", "is_submitter": "False", "link_id": "t3_g4fba8", "parent_id": "t3_g4fba8", "score": "1", "subreddit": "acturnips", "subreddit_id": "t5_2vpf3"}, {"author": "LordArkana", "body": "Hi! Victoria/Aranna :)", "created_utc": "1587333188.0", "edited": "False", "id": "fnx7tkx", "is_submitter": "False", "link_id": "t3_g4f8ck", "parent_id": "t3_g4f8ck", "score": "1", "subreddit": "acturnips", "subreddit_id": "t5_2vpf3"}, {"author": "LordArkana", "body": "While we're at it, I would not mind knowing what every song is during that scene, they were all good. Thanks!", "created_utc": "1586375325.0", "edited": "False", "id": "fmtmlla", "is_submitter": "True", "link_id": "t3_fxde2o", "parent_id": "t3_fxde2o", "score": "1", "subreddit": "tipofmytongue", "subreddit_id": "t5_2r4oc"}, {"author": "LordArkana", "body": "Could it be Aventura? ", "created_utc": "1552152796.0", "edited": "False", "id": "ei5gfev", "is_submitter": "False", "link_id": "t3_az53cp", "parent_id": "t3_az53cp", "score": "1", "subreddit": "tipofmytongue", "subreddit_id": "t5_2r4oc"}, {"author": "LordArkana", "body": "Okay but I love this so much", "created_utc": "1540914495.0", "edited": "False", "id": "e8qbxzf", "is_submitter": "False", "link_id": "t3_9si1ru", "parent_id": "t3_9si1ru", "score": "2", "subreddit": "FierceFlow", "subreddit_id": "t5_30hqx"}, {"author": "LordArkana", "body": "Honestly, if I ever had a kid, I would use them as a research assistant for my labwork. That's it. A tiny lab assistant that I have to feed and take care of. I wouldn't be much of a parent at all.", "created_utc": "1535818915.0", "edited": "False", "id": "e57vff4", "is_submitter": "False", "link_id": "t3_9c2rpw", "parent_id": "t3_9c2rpw", "score": "3", "subreddit": "childfree", "subreddit_id": "t5_2qtwb"}, {"author": "LordArkana", "body": "If anyone asks me, I am definitely using this one.", "created_utc": "1535147520.0", "edited": "False", "id": "e4s0xcg", "is_submitter": "False", "link_id": "t3_99y7k1", "parent_id": "t1_e4rdnl5", "score": "0", "subreddit": "childfree", "subreddit_id": "t5_2qtwb"}, {"author": "LordArkana", "body": "Mine was delivered by FedEx on August 1st, and the computer upgrade notice came a bit later. I find it strange that for 2 weeks it's been delivered but not received by the lab, but I see I'm not the only one. I also wish they'd be honest about that Labcorp issue and tell us exactly what's going on, I'm not sure who to contact at this point.", "created_utc": "1534268860.0", "edited": "False", "id": "e46obpc", "is_submitter": "False", "link_id": "t3_96ythv", "parent_id": "t3_96ythv", "score": "4", "subreddit": "23andme", "subreddit_id": "t5_2scn9"}, {"author": "LordArkana", "body": "I can't decide what he means by plump lower lip, and I refuse to consider all the options", "created_utc": "1533416013.0", "edited": "False", "id": "e3m1nvq", "is_submitter": "False", "link_id": "t3_94liim", "parent_id": "t3_94liim", "score": "5", "subreddit": "creepyasterisks", "subreddit_id": "t5_3hmzi"}, {"author": "LordArkana", "body": "Basically anything Stephen King writes, I can't put down. I once stayed up nearly all night finishing the 11/22/63 novel, and before that the Mr. Mercedes trilogy, and before even that Under the Dome and It, even if that was a massive 1000 page book.", "created_utc": "1533415791.0", "edited": "False", "id": "e3m1gg8", "is_submitter": "False", "link_id": "t3_94i67o", "parent_id": "t3_94i67o", "score": "4", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "LordArkana", "body": "Your boss is great, I wish more figures of authority would understand. I lost my 9 year old cat on the day I had a Greek class, which I normally would never miss for the world, but I had to and the teacher understood completely.  \nWhat is your PhD if you don't mind me asking?", "created_utc": "1533414190.0", "edited": "False", "id": "e3lzxms", "is_submitter": "False", "link_id": "t3_94kmij", "parent_id": "t1_e3ly7bw", "score": "15", "subreddit": "childfree", "subreddit_id": "t5_2qtwb"}, {"author": "LordArkana", "body": "I'm a transman, and the very idea of pregnancy before I transitioned traumatized me. I find it horrifying. Just knowing that my parents, and everyone else, would expect me to have grandkids the natural way, which meant me bearing it... I already knew, even before I knew I was trans, that this would never happen. If I wanted kids, I would adopt them, because the natural way is gross and awful. But I knew anyway, I didn,t like being around kids, and I'm bad at taking care of people. Then I had an hysterectomy, and I had the perfect excuse to have it: I am not a woman, I do not need this uterus, take it and burn it, whatever. I was kinda lucky when I think about it, I don't ever have to worry about surprise pregnancy!", "created_utc": "1531766313.0", "edited": "False", "id": "e2hv7ki", "is_submitter": "False", "link_id": "t3_8z7iml", "parent_id": "t3_8z7iml", "score": "2", "subreddit": "childfree", "subreddit_id": "t5_2qtwb"}, {"author": "LordArkana", "body": "I've always thought that the only successful interaction is one where I can plan the other person's reactions. It has never happened. Basically, I'd be fine interacting with an AI programmed to answer a certain  way to my words, but humans are way too unpredictable and scary!", "created_utc": "1530547565.0", "edited": "False", "id": "e1nv6qq", "is_submitter": "False", "link_id": "t3_8ve99m", "parent_id": "t3_8ve99m", "score": "3", "subreddit": "socialanxiety", "subreddit_id": "t5_2r22n"}, {"author": "LordArkana", "body": "I've been watching BB and BCS religiously and I'm a huge fan, but I never heard anything about Kim or Saul being actually childfree... is it ever mentioned? Did I miss it somewhere? ", "created_utc": "1530479579.0", "edited": "False", "id": "e1mex3z", "is_submitter": "False", "link_id": "t3_8e0apr", "parent_id": "t1_dxrruul", "score": "1", "subreddit": "childfree", "subreddit_id": "t5_2qtwb"}, {"author": "LordArkana", "body": "As a gay man, the topic of children rarely come up in conversations, especially since I'm single now. Even with my ex, whom I was with 8 years, we were both childfree and nobody ever asked us about potential children. Gay men have a  lot less pressure, and when people DO ask, I can think of 1000 reasons why I wouldn't have kids before having to say I'm childfree, like the cost of adoption and how difficult it is to adopt, not being able to carry and having to find a surrogate, etc. so I find myself pretty lucky. Only problem is my mother wanting grandchildren, but she knows it's not gonna happen...", "created_utc": "1528756523.0", "edited": "False", "id": "e0id3qt", "is_submitter": "False", "link_id": "t3_8q9im8", "parent_id": "t3_8q9im8", "score": "4", "subreddit": "childfree", "subreddit_id": "t5_2qtwb"}, {"author": "LordArkana", "body": "They could at least get it right. Master of all 4 CHelements.", "created_utc": "1528153625.0", "edited": "False", "id": "e04bj9v", "is_submitter": "False", "link_id": "t3_8o9gg7", "parent_id": "t3_8o9gg7", "score": "1", "subreddit": "4PanelCringe", "subreddit_id": "t5_2w7us"}, {"author": "LordArkana", "body": "I also live in Montreal. We're supposed to have spring tomorrow. I'm still wearing my winter boots and cursing every second I step foot outside.", "created_utc": "1521591315.0", "edited": "False", "id": "dw0va0y", "is_submitter": "False", "link_id": "t3_85pu1o", "parent_id": "t1_dw00eh9", "score": "1", "subreddit": "childfree", "subreddit_id": "t5_2qtwb"}, {"author": "LordArkana", "body": "Je cherche à céder mon bail pour le 1er avril, un 3 et demi sur St-Michel dans le quartier Rosemont.  Je ne sais pas si c'est permis d'afficher ici?", "created_utc": "1521588674.0", "edited": "False", "id": "dw0sq8n", "is_submitter": "False", "link_id": "t3_80rqce", "parent_id": "t3_80rqce", "score": "3", "subreddit": "montreal", "subreddit_id": "t5_2qnmr"}, {"author": "LordArkana", "body": "I don,t want a dog because I know I'd be often too lazy to take it out for a walk everyday, so I can't even imagine what it's like taking care of a child. But also all the other good reasons, like children and babies just seriously annoy me and they cost too much.", "created_utc": "1520271240.0", "edited": "False", "id": "dv7yx1s", "is_submitter": "False", "link_id": "t3_8208lk", "parent_id": "t3_8208lk", "score": "2", "subreddit": "childfree", "subreddit_id": "t5_2qtwb"}, {"author": "LordArkana", "body": "You're both so handsome!", "created_utc": "1520226882.0", "edited": "False", "id": "dv77mb1", "is_submitter": "False", "link_id": "t3_81mpvj", "parent_id": "t3_81mpvj", "score": "3", "subreddit": "FierceFlow", "subreddit_id": "t5_30hqx"}, {"author": "LordArkana", "body": "Oh my god his name is Matthew\nAnd he's so orange\nI'm in love!", "created_utc": "1519792586.0", "edited": "False", "id": "duy219c", "is_submitter": "False", "link_id": "t3_80p75r", "parent_id": "t3_80p75r", "score": "1", "subreddit": "childfree", "subreddit_id": "t5_2qtwb"}, {"author": "LordArkana", "body": "Could it be Super Solvers?\nhttps://kotaku.com/this-math-game-scared-me-as-kid-and-i-still-hate-it-1819812496", "created_utc": "1519452521.0", "edited": "False", "id": "duqx39t", "is_submitter": "False", "link_id": "t3_7zu3ny", "parent_id": "t3_7zu3ny", "score": "2", "subreddit": "tipofmytongue", "subreddit_id": "t5_2r4oc"}, {"author": "LordArkana", "body": "I had a cat who would lick my hairy legs after I took a shower, to get the water from them. Weirdest most adorable cat ever.", "created_utc": "1518099920.0", "edited": "False", "id": "dtxim2m", "is_submitter": "False", "link_id": "t3_7w0ed6", "parent_id": "t1_dtwq1tm", "score": "5", "subreddit": "childfree", "subreddit_id": "t5_2qtwb"}, {"author": "LordArkana", "body": "Tuna cans are a lifesaver as well. I use them in pasta, salads, anything really.", "created_utc": "1518099751.0", "edited": "False", "id": "dtxigrm", "is_submitter": "False", "link_id": "t3_7w3ujo", "parent_id": "t3_7w3ujo", "score": "9", "subreddit": "LifeProTips", "subreddit_id": "t5_2s5oq"}, {"author": "LordArkana", "body": "Damn. I lived with someone with BPD for 8 years and this actually makes a lot of sense, though I'd let people actually living with it answer that.", "created_utc": "1517420293.0", "edited": "False", "id": "dtj0kne", "is_submitter": "False", "link_id": "t3_7u3n75", "parent_id": "t3_7u3n75", "score": "2", "subreddit": "BoJackHorseman", "subreddit_id": "t5_2zzfr"}, {"author": "LordArkana", "body": "I recognized Fur Elise immediately, I meant the songs Elise play in one of the endings later in the game but didn't want to create spoilers.\nThe list you provided is exactly what I was looking for, thank you!", "created_utc": "1516208304.0", "edited": "False", "id": "dstmsx6", "is_submitter": "False", "link_id": "t3_7qd14c", "parent_id": "t1_dstmik1", "score": "2", "subreddit": "visualnovels", "subreddit_id": "t5_2r5yf"}, {"author": "LordArkana", "body": "In the VN An octave higher, I've been looking for the list of all the classical music played in the game, but I can't seem to find it anywhere. I listened to all the soundtrack of the game and it wasn't in there. Specifically, I'm looking for the pieces Elise play. Anyone know where to find them?", "created_utc": "1516204440.0", "edited": "False", "id": "dstirj8", "is_submitter": "False", "link_id": "t3_7qd14c", "parent_id": "t3_7qd14c", "score": "2", "subreddit": "visualnovels", "subreddit_id": "t5_2r5yf"}, {"author": "LordArkana", "body": "My condolences OP. Your story reminded me so much of what happened to my own cat a few years ago. \nHe had to be rehomed because my mother couldn't keep him, and I couldn't have more than one cat, so my friend offered to care for him. The thing is, my mom thought he was sick before he left. He didn't eat much and lost a lot of weight. My friend took care of him as best he could, but eventually my cat died, at the age of only 9. And my greatest regret was that I wasn't there for him when it happened. He was found on the floor in the morning, my friend was sleeping and was not aware of what was happening. I went to his place and we spent all day crying, petting him, and I told him how sorry I was that I abandoned him. I still feel guilty about it.\nIt's a difficult process, because our pets are family. They love us as much as another human could, if not more. Your kitty knew she was loved and I'm glad she felt no pain. Sending you hugs.", "created_utc": "1515086322.0", "edited": "False", "id": "ds6ounk", "is_submitter": "False", "link_id": "t3_7nzyg7", "parent_id": "t3_7nzyg7", "score": "1", "subreddit": "childfree", "subreddit_id": "t5_2qtwb"}, {"author": "LordArkana", "body": "The truck says, \"After 7 it's time to take out your trash\". It's probably after 7, and he took it literally.", "created_utc": "1514999107.0", "edited": "False", "id": "ds4uvak", "is_submitter": "False", "link_id": "t3_7ntk7u", "parent_id": "t3_7ntk7u", "score": "2", "subreddit": "trashy", "subreddit_id": "t5_2uao3"}, {"author": "LordArkana", "body": "I scanned the text looking for that mispelled \"your\". Surprise, it delivered. Every time.", "created_utc": "1514998897.0", "edited": "False", "id": "ds4uo4m", "is_submitter": "False", "link_id": "t3_7nv2km", "parent_id": "t3_7nv2km", "score": "15", "subreddit": "trashy", "subreddit_id": "t5_2uao3"}, {"author": "LordArkana", "body": "As a native French speaker, I have no idea what this is.\nWhen do you say 'reed' and when do you say 'red'? ", "created_utc": "1513634314.0", "edited": "False", "id": "drfxgkq", "is_submitter": "False", "link_id": "t3_7kl58u", "parent_id": "t3_7kl58u", "score": "1", "subreddit": "BlackPeopleTwitter", "subreddit_id": "t5_33x33"}, {"author": "LordArkana", "body": "Looks like he's watching Trump on a friday night. There lies the real sad cringe.", "created_utc": "1512795157.0", "edited": "False", "id": "dqzhcs7", "is_submitter": "False", "link_id": "t3_7ikpp7", "parent_id": "t3_7ikpp7", "score": "12", "subreddit": "sadcringe", "subreddit_id": "t5_2wsc9"}, {"author": "LordArkana", "body": "With the way she writes, it makes me believe she's like, 14... looks like a Myspace biography.", "created_utc": "1512795073.0", "edited": "False", "id": "dqzhaqq", "is_submitter": "False", "link_id": "t3_7iisss", "parent_id": "t3_7iisss", "score": "17", "subreddit": "sadcringe", "subreddit_id": "t5_2wsc9"}, {"author": "LordArkana", "body": "My mother told me that when she was younger, she used to see a really nice crossing guard who'd give candies to children. (Obviously back then it was fine, it was the 60's after all.) The poor man got killed  by a car that didn't want to stop when he held the sign. It hurts me and I wasn't even there.", "created_utc": "1512747109.0", "edited": "False", "id": "dqycjy3", "is_submitter": "False", "link_id": "t3_7ia5n5", "parent_id": "t3_7ia5n5", "score": "2", "subreddit": "AdviceAnimals", "subreddit_id": "t5_2s7tt"}, {"author": "LordArkana", "body": "I love all teas, but have a preference for oolong. I have a green in particular I like, Huiming. It's pretty gentle, maybe you'd like it?", "created_utc": "1509154253.0", "edited": "False", "id": "dozqx3s", "is_submitter": "False", "link_id": "t3_78w571", "parent_id": "t1_dox555n", "score": "1", "subreddit": "childfree", "subreddit_id": "t5_2qtwb"}, {"author": "LordArkana", "body": "Kittens and mass effect, is there a better combo? \nI'm into drinking tea while playing mass effect and stroking cats, personally.", "created_utc": "1509031891.0", "edited": "False", "id": "dox4v6l", "is_submitter": "False", "link_id": "t3_78w571", "parent_id": "t1_dox3bo6", "score": "9", "subreddit": "childfree", "subreddit_id": "t5_2qtwb"}, {"author": "LordArkana", "body": "I have a phobia of amputation, and any loss of limb. No idea what it's called. Just imagining being in this woman's place, I think I'd rather be dead than lose four limbs at once.\nI'm pretty mad at this hospital's staff though. They could have prevented this, this is bullshit. Poor woman.", "created_utc": "1508641537.0", "edited": "False", "id": "dophpdk", "is_submitter": "False", "link_id": "t3_77goxg", "parent_id": "t3_77goxg", "score": "5", "subreddit": "childfree", "subreddit_id": "t5_2qtwb"}, {"author": "LordArkana", "body": "Are you okay?", "created_utc": "1507661211.0", "edited": "False", "id": "do6k1yk", "is_submitter": "False", "link_id": "t3_75io7y", "parent_id": "t3_75io7y", "score": "1", "subreddit": "socialanxiety", "subreddit_id": "t5_2r22n"}, {"author": "LordArkana", "body": "I'm 100% childfree, and somewhat antinatalist myself, as in... I feel dread and sadness, sometimes anger when people announce their pregnancy. I don't understand why people still want children, after all we know today. It's no longer a survival question, people just want to pass on their genes, but it's destroying the earth. \nI'd be more interested in population control, but this could quickly become a dystopian future if not done correctly. I just stick to saying I'm childfree, it's easier. :p", "created_utc": "1507649795.0", "edited": "False", "id": "do68nha", "is_submitter": "False", "link_id": "t3_754tnc", "parent_id": "t1_do5jwx4", "score": "2", "subreddit": "childfree", "subreddit_id": "t5_2qtwb"}, {"author": "LordArkana", "body": "People either believe we're a bunch of party animals who never want to settle down, or the couples who want kids can't adopt because it's expensive, difficult, etc. so they think we just don't want any. Although, as a gay male, nobody ever asks me if I want children. It's ingrained in their mind that I can't accidentally make one so they don't bother asking. Lesbians on the other hand, I think they have more pressure since they can get IVF. ", "created_utc": "1507566597.0", "edited": "False", "id": "do4k9wt", "is_submitter": "False", "link_id": "t3_754x4r", "parent_id": "t3_754x4r", "score": "3", "subreddit": "childfree", "subreddit_id": "t5_2qtwb"}, {"author": "LordArkana", "body": "May I suggest you check out r/antinatalism? Sounds like your mindset is exactly in sync with that sub. It's like being childfree, but a step further. You may be more at home there. Not everyone who is childfree is antinatalist, but I believe every antinatalist is childfree.", "created_utc": "1507566369.0", "edited": "False", "id": "do4k1s6", "is_submitter": "False", "link_id": "t3_754tnc", "parent_id": "t1_do3u7jm", "score": "4", "subreddit": "childfree", "subreddit_id": "t5_2qtwb"}, {"author": "LordArkana", "body": "Really? Wow, I may be too young but I've never seen or heard anything about how us Quebecers need to reproduce, except for opinionated people in some medias.\nHonestly though, the problem is racism. They want more babies, but -white, pure- babies, not immigrant ones. It's ridiculous.\nI've lived in Montreal all my life and I'm only 26, but lately, especially since Trump's election, I've seen my fair share of white supremacists and, yes, nazis surfacing. It's sickening.", "created_utc": "1504326478.0", "edited": "False", "id": "dmggdy3", "is_submitter": "False", "link_id": "t3_6xf1it", "parent_id": "t3_6xf1it", "score": "1", "subreddit": "childfree", "subreddit_id": "t5_2qtwb"}, {"author": "LordArkana", "body": "It's a weird coincidence that the exact same thing happened recently to some guys from my job. They were trying to fill high shelves with hospital patient folders. They started from the top, shelves were unbolted. Gravity did its job and now they're on the floor.\nHey, that kinda sounds like a rap song.", "created_utc": "1502894971.0", "edited": "False", "id": "dlpd8ak", "is_submitter": "False", "link_id": "t3_6tzyrq", "parent_id": "t3_6tzyrq", "score": "1", "subreddit": "WTF", "subreddit_id": "t5_2qh61"}, {"author": "LordArkana", "body": "Sounds like someone is trying their hand at gold!", "created_utc": "1502775564.0", "edited": "False", "id": "dln4chp", "is_submitter": "False", "link_id": "t3_6tpkty", "parent_id": "t1_dln1kft", "score": "8", "subreddit": "childfree", "subreddit_id": "t5_2qtwb"}, {"author": "LordArkana", "body": "I live in Montreal, and I've seen a young dude in a McLaren once. A goddamn McLaren! Aren't those worth millions?\n\nEDIT: So it turns out they're hundreds of thousands, not millions. Someone lied to me!", "created_utc": "1502558622.0", "edited": "1502559042.0", "id": "dliy7eq", "is_submitter": "False", "link_id": "t3_6t6vs4", "parent_id": "t1_dlifpco", "score": "1", "subreddit": "childfree", "subreddit_id": "t5_2qtwb"}, {"author": "LordArkana", "body": "I felt the same way with Cell. Great story all the way through, and the end just felt like... I was left hanging.", "created_utc": "1502003209.0", "edited": "False", "id": "dl8dovp", "is_submitter": "False", "link_id": "t3_6rv1sg", "parent_id": "t1_dl89lhp", "score": "3", "subreddit": "todayilearned", "subreddit_id": "t5_2qqjc"}, {"author": "LordArkana", "body": "Sounds like an absolute nightmare. I'm sorry. I have a brother with two kids, but he's the opposite - he acts as if he never had them and doesn't take care of them...\nOn an unrelated subject, hello, fellow Montrealer!", "created_utc": "1501689792.0", "edited": "False", "id": "dl2cvbn", "is_submitter": "False", "link_id": "t3_6r4bvm", "parent_id": "t3_6r4bvm", "score": "7", "subreddit": "childfree", "subreddit_id": "t5_2qtwb"}, {"author": "LordArkana", "body": "I bought Guild Wars 2 Heart of Thorns for much less than the original price there. It's amazing.", "created_utc": "1500501330.0", "edited": "False", "id": "dkg5pst", "is_submitter": "False", "link_id": "t3_6mz3uo", "parent_id": "t3_6mz3uo", "score": "1", "subreddit": "IsItBullshit", "subreddit_id": "t5_2yhlm"}, {"author": "LordArkana", "body": "As a transman, my experience and reasons will be very different from cis women who have hysterectomies, but I'll weigh in anyway.\n\nI knew since I started my period that I had to get this damn thing out of me, which was at the unfortunate age of 9. Yeah, I got lucky.\n\nI'm in Canada, I don't know about you, but the surgery is covered here when you have the approval of a therapist and your doctor. Me being a trans guy, it was pretty damn obvious I needed the surgery.\n\nAs for you, maybe you can see a therapist about your gender identity, and make them understand that you feel more male, and the uterus is causing you dysphoria - even if that's not the case, it can help you get the surgery approved more easily. I know many trans/non conforming people who said they identified as male to get necessary surgeries they wouldn't get otherwise.\n\nI wish you the best of luck!", "created_utc": "1500501098.0", "edited": "False", "id": "dkg5igi", "is_submitter": "False", "link_id": "t3_6oan6m", "parent_id": "t3_6oan6m", "score": "6", "subreddit": "childfree", "subreddit_id": "t5_2qtwb"}, {"author": "LordArkana", "body": "I agree with the common sentiment here about gender reveal parties. As a trans guy, I can tell you this: The gender reveal party isn't telling us if your baby is a boy or a girl. It's telling us what kind of genitals it has. An information I don't care to know. Why make such a fuss and fill the place with stereotypical boy/girl things that most kids will not even enjoy growing up?\n\nI mean, how many girls do you see today who grew up and decided to keep dressing in all pink, cute skirts and dresses every day? \nFor me that's the cringiest thing; boys get all sorts of colorful clothes, except of course the 'girly' colors. Girls only get pink and shades of pink. It's like their parents want to scream to the world that they have a girl. ", "created_utc": "1499614222.0", "edited": "False", "id": "djzk9qz", "is_submitter": "False", "link_id": "t3_6m64ug", "parent_id": "t3_6m64ug", "score": "33", "subreddit": "childfree", "subreddit_id": "t5_2qtwb"}, {"author": "LordArkana", "body": "I think the same way you do, aI just cannot comprehend how a happy couple, who may have just bought a house, got a promotion, dream careers, etc. would ruin it all with a child.\nI mean, why don't you enjoy your time together before you throw everything away?  Enjoy the new house, enjoy your work, why would you want a year off a job you just got to breed? And how about all the fun alone time with your SO? You can kiss that goodbye too, along with going anywhere unplanned, like a random dinner date after work. \n\nI will never understand.", "created_utc": "1499393930.0", "edited": "False", "id": "djvujlt", "is_submitter": "False", "link_id": "t3_6l71fk", "parent_id": "t3_6l71fk", "score": "1", "subreddit": "childfree", "subreddit_id": "t5_2qtwb"}, {"author": "LordArkana", "body": "Honestly, I quite like the Bioderma Foaming Gel, I feel like it does its job. My face doesn't feel too tight, it feels clean and better. I think my problem might be with the moisturizer, or not using a BHA. I'm looking into trying that as well.", "created_utc": "1499271078.0", "edited": "False", "id": "djta5m1", "is_submitter": "False", "link_id": "t3_6kxp8f", "parent_id": "t1_djt9qu8", "score": "1", "subreddit": "SkincareAddiction", "subreddit_id": "t5_2tbbg"}, {"author": "LordArkana", "body": "Are you talking about the Bioderma I use now? I used it because it was recommended to me by the lady at the pharmacy I bought it from (I'm from Canada). Also, while reading the ScA routine, I saw that foaming cleansers were better for oily skin. Should I use a different one?\n\nEDIT: A word", "created_utc": "1499270394.0", "edited": "1499270750.0", "id": "djt9iw8", "is_submitter": "False", "link_id": "t3_6kxp8f", "parent_id": "t1_djt9dm2", "score": "1", "subreddit": "SkincareAddiction", "subreddit_id": "t5_2tbbg"}, {"author": "LordArkana", "body": "I currently Use Bioderma Sébium Foaming Gel for my skin. I have very oily skin, with big open pores. I recently switched to Neostrata Pore Minimizing Anti-Shine Hydrating Gel as a moisturizer afterwards, and I do that in the AM and evening.\n\nI wanted to try a new routine, because I feel like those products aren't enough; my skin gets oily again during the day, and I find myself anxiously waiting to wash my face again.\n\nI heard good things of CeRave Foaming Cleanser, and the PM Facial Moisturizing Lotion. I was thinking of switching to those. Is it worth it, or should I stick to my current products or make minor changes?", "created_utc": "1499269951.0", "edited": "False", "id": "djt93la", "is_submitter": "False", "link_id": "t3_6kxp8f", "parent_id": "t3_6kxp8f", "score": "1", "subreddit": "SkincareAddiction", "subreddit_id": "t5_2tbbg"}, {"author": "LordArkana", "body": "Sounds like my workplace. We have to change passwords every 2 months or so, andit can't be the same. You have no idea how many papers I have taped on my office box with endless variations of the same passwords. Eventually I'll run out of planet names...", "created_utc": "1497912417.0", "edited": "False", "id": "dj4lisc", "is_submitter": "False", "link_id": "t3_6i5zy1", "parent_id": "t3_6i5zy1", "score": "2", "subreddit": "AdviceAnimals", "subreddit_id": "t5_2s7tt"}, {"author": "LordArkana", "body": "I'm 26 and I look younger than her! Must be the single mom thing...", "created_utc": "1496071754.0", "edited": "False", "id": "di6rf9d", "is_submitter": "False", "link_id": "t3_6dxbkq", "parent_id": "t1_di6g6ng", "score": "2", "subreddit": "Tinder", "subreddit_id": "t5_2w7mz"}, {"author": "LordArkana", "body": "I briefly worked for Cutco when I was 19, not knowing anything at all about pyramid schemes. It seemed too good to be true, and went exactly the same way you described. If I had known all that info today,I probably would have done something too. I actually bought the kit and still use the knives and the scissors, though... they're pretty damn good.", "created_utc": "1495738949.0", "edited": "False", "id": "di1dizm", "is_submitter": "False", "link_id": "t3_62kfbh", "parent_id": "t3_62kfbh", "score": "2", "subreddit": "ProRevenge", "subreddit_id": "t5_2vjvl"}, {"author": "LordArkana", "body": "Changing Bob Odenkirk in Better Call Saul. This man is perfect in every way, and I cannot think of anybody else to embody Saul Goodman.", "created_utc": "1495478279.0", "edited": "False", "id": "dhwag78", "is_submitter": "False", "link_id": "t3_6coyow", "parent_id": "t3_6coyow", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "LordArkana", "body": "Both my parents would have loved for me to have children.My mother wanted to be a grandmother, and my dad already has grandchildren thanks to my half siblings, so there's that.\n\nMy mother, thankfully, understands very well and never pesters me about it. My father recently made a joke about me adopting kids in the future, and we laughed about it, knowing very well I'd rather spend that money on alcohol and tea, and my free time playing video games!", "created_utc": "1495474045.0", "edited": "False", "id": "dhw6q4c", "is_submitter": "False", "link_id": "t3_6cil3f", "parent_id": "t3_6cil3f", "score": "1", "subreddit": "childfree", "subreddit_id": "t5_2qtwb"}, {"author": "LordArkana", "body": "Montreal syndrome. You pride yourself on being one of the most advanced in technology, but can't even fix potholes in the road.", "created_utc": "1493590663.0", "edited": "False", "id": "dgyngwx", "is_submitter": "False", "link_id": "t3_68f79g", "parent_id": "t3_68f79g", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "LordArkana", "body": "That was the cringiest stuff I have ever read. And the hashtags everywhere. Jesus.", "created_utc": "1492998289.0", "edited": "False", "id": "dgnzs4x", "is_submitter": "False", "link_id": "t3_6734po", "parent_id": "t3_6734po", "score": "2", "subreddit": "childfree", "subreddit_id": "t5_2qtwb"}, {"author": "LordArkana", "body": "This morning, I've been drinking Huiming from China, a soft, floral green tea that I've been looking for. My usual tea shop was supposed to have run out of it. I went to check anyway, and they had some left, so I'm pretty happy!", "created_utc": "1492997402.0", "edited": "False", "id": "dgnz4ol", "is_submitter": "False", "link_id": "t3_671v9n", "parent_id": "t3_671v9n", "score": "1", "subreddit": "tea", "subreddit_id": "t5_2qq5e"}, {"author": "LordArkana", "body": "First image is how I felt applying to college this year. I've always wanted to be a biomedical lab technician, but could never get in for administrative reasons. 9 years and many classes that led to nothing later, I'm finally starting this year. This image made me feel better!", "created_utc": "1492122134.0", "edited": "False", "id": "dg8btmu", "is_submitter": "False", "link_id": "t3_655mgl", "parent_id": "t3_655mgl", "score": "1", "subreddit": "GetMotivated", "subreddit_id": "t5_2rmfx"}, {"author": "LordArkana", "body": "That's Chris (simpsons artist). He can be found on facebook, he's amazing!", "created_utc": "1491370563.0", "edited": "False", "id": "dfuo3j7", "is_submitter": "False", "link_id": "t3_63id5f", "parent_id": "t3_63id5f", "score": "7", "subreddit": "childfree", "subreddit_id": "t5_2qtwb"}, {"author": "LordArkana", "body": "Can confirm Alfid. They're a group with several units all over the city,so they couldn't give a crap about you, they usually send their janitors to do the job, and in my unit they didn't even speak French or English properly. Also, the electricity was awful, they used old bulbs that had to be replaced, which was dangerous; I couldn't even use my AC with my TV at the same time.", "created_utc": "1491320276.0", "edited": "False", "id": "dfthxmh", "is_submitter": "False", "link_id": "t3_5wsip7", "parent_id": "t1_dfdafy5", "score": "3", "subreddit": "montreal", "subreddit_id": "t5_2qnmr"}, {"author": "LordArkana", "body": "Bonjour! Je me suis trouvé un super 3 et demi à Montréal, près de la promenade Masson pour 650$. J'en suis très heureux, mais il me reste à trouver un déménageur. Je faisais affaire avec Uhaul et des amis pour conduire et m'aider, mais c'est un bordel total et je veux maintenant des déménageurs, par contre la plupart ont des coûts exorbitants. Quelqu'un a des idées pour quelquechose de pas cher mais efficace et propre? De plus, je pars de Longueuil!", "created_utc": "1491320131.0", "edited": "False", "id": "dfthsxz", "is_submitter": "False", "link_id": "t3_5wsip7", "parent_id": "t3_5wsip7", "score": "3", "subreddit": "montreal", "subreddit_id": "t5_2qnmr"}, {"author": "LordArkana", "body": "I tried doing this, but all the damn coupons give you a free meal on your birthday only on the exact day, and only if you have a group reservation of 6-8 people or more.\nFuck you Montreal :(", "created_utc": "1491234130.0", "edited": "1491234450.0", "id": "dfrvkb5", "is_submitter": "False", "link_id": "t3_634ksn", "parent_id": "t3_634ksn", "score": "1", "subreddit": "LifeProTips", "subreddit_id": "t5_2s5oq"}, {"author": "LordArkana", "body": "I'm on day 4 of keto, and I can't help but feel like I'm doing something wrong. I always go over 25g of carbs everyday, even though I do everything I can, it seems everything, even low carb options have too many carbs. I madea poutine with turnip fries and apparently that was 12g, plus the sauce... and I still feel hunger pangs.\nMaybe I'm not eating enough fat, I'm pretty new so I'll give it a try longer and not give up!", "created_utc": "1490378207.0", "edited": "False", "id": "dfcyr8i", "is_submitter": "False", "link_id": "t3_6163rn", "parent_id": "t3_6163rn", "score": "2", "subreddit": "keto", "subreddit_id": "t5_2rske"}, {"author": "LordArkana", "body": "My dad. In Columbia, he badly beat up some guy when he got drunk and the guy wanted to fight him because my dad was the leader of a street gang. After beating the guy up, my dad bailed. Years later, some lady tells him the guy died. Nobody knows if it's because of his injuries or unrelated.\n\nAnother similar story... again in Columbia, my dad and his friend took something to eat from a deep fried food stand. The owner chased after them angrily with the box of oil. My dad, in order to protect his friend, threw a brick at the owner and sent the burning oil box on his chest.\nThe guy died a while later, once again nobody knows the actual causes.\nI'm surprised after all these years, nobody came looking for my dad...", "created_utc": "1488438615.0", "edited": "False", "id": "deel5tk", "is_submitter": "False", "link_id": "t3_5wycv9", "parent_id": "t3_5wycv9", "score": "24", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "LordArkana", "body": "It would be empty. She's dead.", "created_utc": "1488437892.0", "edited": "False", "id": "deekui8", "is_submitter": "False", "link_id": "t3_5wyhjh", "parent_id": "t3_5wyhjh", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "LordArkana", "body": "I was already crying from a cat post and now I'm crying again. I don't know what's with me today. If I didn't have three already, I'd take these precious kitties in a heartbeat. I have no respect for people who abandon animals for babies.", "created_utc": "1488223972.0", "edited": "False", "id": "deadjgg", "is_submitter": "False", "link_id": "t3_5we3xg", "parent_id": "t3_5we3xg", "score": "1", "subreddit": "childfree", "subreddit_id": "t5_2qtwb"}, {"author": "LordArkana", "body": "Just reading your post and everyone's replies is making me cry. I have three cats, and I lost my oldest one a little over a year ago. He lived with my mother and she gave him to me in his last moments, because she was too sick to take care of him. Unfortunately, when he died I was at school and he had nobody to take care of him. It happened very suddenly, one moment he was fine, then he's gone. \nI keep feeling like I betrayed him and it will haunt me all my life.\n\nThe grief is very real, pet or human, those feelings are perfectly justified. I'm sorry for your kitty and wish you the best.", "created_utc": "1488223807.0", "edited": "False", "id": "deaddxe", "is_submitter": "False", "link_id": "t3_5wejyo", "parent_id": "t3_5wejyo", "score": "2", "subreddit": "childfree", "subreddit_id": "t5_2qtwb"}, {"author": "LordArkana", "body": "We all need a Cindy in our lives!", "created_utc": "1488058213.0", "edited": "False", "id": "de7mrea", "is_submitter": "False", "link_id": "t3_5w4jtb", "parent_id": "t3_5w4jtb", "score": "1", "subreddit": "childfree", "subreddit_id": "t5_2qtwb"}, {"author": "LordArkana", "body": "Well there is a subreddit called Waifuism, and people there are extremely serious about their anime partners. So I definitely believe it!", "created_utc": "1487864269.0", "edited": "False", "id": "de43njo", "is_submitter": "False", "link_id": "t3_5vcz87", "parent_id": "t3_5vcz87", "score": "3", "subreddit": "sadcringe", "subreddit_id": "t5_2wsc9"}, {"author": "LordArkana", "body": "As someone who has social anxiety and self esteem issues, trusting someone is not easy. I'm of a nature where I want to identify with the person I'm talking to, and if that person doesn't open up at all, it may be harder for me to speak about myself.\n\nA lot of your clients must have similar issues, where they need constant reassurance and repeating the same thing over and over. I know I needed to hear stuff several times before I processed it. I'm considering becoming a psychologist one day, but because of my nature I'm not sure it's a good idea.\nIn your case, you seem to love your job, but it's very important to make your clients trust you, even if it seems daunting to repeat the same thing all the time. ", "created_utc": "1487695747.0", "edited": "False", "id": "de0xn0d", "is_submitter": "False", "link_id": "t3_5v9u40", "parent_id": "t3_5v9u40", "score": "3", "subreddit": "childfree", "subreddit_id": "t5_2qtwb"}, {"author": "LordArkana", "body": "That man was less of a human than you'll ever be. You've already done great things, you're going to do even more, and you seem to be a great person with an awesome personality. I'm sorry people are assholes. I'm sorry there's still unjustified racism in this world. You don't deserve it, but you do deserve a great life and to fulfill all your dreams. Keep on being you, and being awesome!", "created_utc": "1487261811.0", "edited": "False", "id": "ddtnhi2", "is_submitter": "False", "link_id": "t3_5uct7j", "parent_id": "t3_5uct7j", "score": "3", "subreddit": "offmychest", "subreddit_id": "t5_2ranw"}, {"author": "LordArkana", "body": "Sounds like a real winner here. Poor you, how will you ever get over him??", "created_utc": "1487187787.0", "edited": "False", "id": "ddsd2oo", "is_submitter": "False", "link_id": "t3_5u8eod", "parent_id": "t3_5u8eod", "score": "3", "subreddit": "niceguys", "subreddit_id": "t5_2rvxp"}, {"author": "LordArkana", "body": "I just want to say you're not alone. When I lived with my mother, I was alright, I could go make food and everything else, I didn't feel awkward or anxious around her. But then I moved out, and I lived with a friend for one year. We weren't really close. I could not bring myself to wash my clothes, take a shower, or cook anything if she was around the house. I had to wait for her to leave to do all these things and I rushed to do them. And if she got back before I was done, my heart would pound and I'd start shaking and doing things mechanically, as if my every move was being judged.\n\nI think you should indeed talk to your family about how you feel and why you're doing this. It should help. ", "created_utc": "1487176493.0", "edited": "False", "id": "dds2x01", "is_submitter": "False", "link_id": "t3_5u6fba", "parent_id": "t3_5u6fba", "score": "2", "subreddit": "socialanxiety", "subreddit_id": "t5_2r22n"}, {"author": "LordArkana", "body": "I told him several times that I thought this may not be a good idea. I asked him if he understood that we could stop at any moment if it became unbearable for either of us. I never do anything just for me. I want to make this as easy as possible for him, but he needs me. I'm not making this up or trying to justify myself, he tells me over and over how he needs me to get through this. And I'm very willing to end this if I see the first sign that it's not working, but so far, everyday he's getting better. This is his way of healing, I'm not forcing him on anything. In fact, I was always the one having to do what he says, how could I suddenly switch roles like that? ", "created_utc": "1487175281.0", "edited": "False", "id": "dds1urf", "is_submitter": "True", "link_id": "t3_5u13yq", "parent_id": "t1_ddrng3f", "score": "1", "subreddit": "BPDlovedones", "subreddit_id": "t5_33dd6"}, {"author": "LordArkana", "body": "I guess I worded things wrong. I'm not the only one who wants this. He does as well, and we've both been very clear. If there's one thing I always worry about, it's consent and understanding. This is very recent as well, so I'm a mess of feelings and I may not express things as well as I think I do. This isn't all me. I wanted to give him space, but he feels better if I stay, because our relationship wasn't purely romantic from the start. We're close and we can remain close, just not as lovers. All I want is his peace of mind, not my own selfish needs. I'm sorry if it came out that way. I have social anxiety and I worry a lot about the things I say in case people might misunderstand, like right now...", "created_utc": "1487091952.0", "edited": "False", "id": "ddqk7mh", "is_submitter": "True", "link_id": "t3_5u13yq", "parent_id": "t1_ddqj66v", "score": "1", "subreddit": "BPDlovedones", "subreddit_id": "t5_33dd6"}, {"author": "LordArkana", "body": "I spent the whole day yesterday trying to explain to him how I felt.  I truly do not feel romantic love towards him. But I've known him for a long time, and before we started a relationship, we were best friends and trusted each other with important things. He was my first at everything, and he has many qualities when the BPD isn't taking hold of him. But he wasn't even my type to start with. I like older men, especially teacher-geek types, with similar interests to mine. He's younger, doesn't even have a high school diploma, and more of a manual person. I also don't like the way he sees the world and the way he speaks, though that may be part of BPD. He's incredibly generous, affectionnate, but can go from one extreme to another. He wouldn't warn me when he changed his mind about something, and I had to wait and go ask if I wanted to know what was up. Despite all this, we're still very close and we are perfectly able to talk like adults and mutually agree on the boundaries. As long as we're clear about it, I don't think there will be issues. ", "created_utc": "1487091781.0", "edited": "False", "id": "ddqk2b9", "is_submitter": "True", "link_id": "t3_5u13yq", "parent_id": "t1_ddqi6hx", "score": "1", "subreddit": "BPDlovedones", "subreddit_id": "t5_33dd6"}, {"author": "LordArkana", "body": "Can confirm. I know an Eli who goes to University in physics and he's pretty damn cool.", "created_utc": "1486744620.0", "edited": "False", "id": "ddkuf19", "is_submitter": "False", "link_id": "t3_5t49m3", "parent_id": "t1_ddk8srk", "score": "1", "subreddit": "ftm", "subreddit_id": "t5_2t9mw"}, {"author": "LordArkana", "body": "Ah, I see what you mean. Applying that rule literally would effectively lead to a slow extinction of the human race, since it's impossible to conceive a child that can consent to its existence. \n\nI wonder about the implications when it comes to abortion. I'm pro-choice of course, but conservatives keep using the argument that the fetus is alive, and has every right to be born, despite what the mother wants. So once it's conceived, it still cannot consent to being born, as it does not have a conscience yet. ", "created_utc": "1486668804.0", "edited": "False", "id": "ddjjxjs", "is_submitter": "False", "link_id": "t3_5sz9ms", "parent_id": "t1_ddjjgtb", "score": "1", "subreddit": "antinatalism", "subreddit_id": "t5_2ro3i"}, {"author": "LordArkana", "body": "I'm not certain what you're trying to say here. I never said it was ok to have sex with someone who has not given consent. That's rape, even if the person hasn't said no. What I meant to say is children who aren't born cannot give the consent to be born, as they do not exist yet. The decision to have sex relies on two people who are both very much alive and, usually, able to consent to the act. Having a child requires those same two people to consent to the sexual act producing offspring.\nBut, said offspring cannot agree with the parents' decision because it does not exist. ", "created_utc": "1486667879.0", "edited": "False", "id": "ddjj43z", "is_submitter": "False", "link_id": "t3_5sz9ms", "parent_id": "t1_ddjie7g", "score": "2", "subreddit": "antinatalism", "subreddit_id": "t5_2ro3i"}, {"author": "LordArkana", "body": "I understand why you feel this way. I had to see a therapist to get reference letters, and she was the most understanding, open person I have ever talked to. I trusted her a lot. While  I've never really talked about being childfree and antinatalist (it was irrelevant), she knew children were not an option for me. And now I recently found out she was pregnant and about to take a maternity leave...\n\nWhile I don't feel betrayed, I feel like it's a disservice to her customers, as she specializes in a very specific clientele and she's one of the cheapest and nicest therapists. For several months, many people like me will not be able to see her. I've always thought one's job, especially as important as therapist, doctor, or any other caregiver, should be the priority over breeding.", "created_utc": "1486655920.0", "edited": "False", "id": "ddj8l3q", "is_submitter": "False", "link_id": "t3_5swsei", "parent_id": "t3_5swsei", "score": "2", "subreddit": "antinatalism", "subreddit_id": "t5_2ro3i"}, {"author": "LordArkana", "body": "I don't think OP meant that at all. They were just making a comparison that we do talk about consent when it comes to sexuality, but not in terms of childbirth. It just happens those two occurences have something in common.\n\nAs for the post, I'd say it's because it's impossible for someone that does not yet exist to give consent. That's the biggest problem we have. Since we have no idea what kind of person a baby will turn out to be, we don't know if their life will be worth living or not, or if they wanted to be born. There is no feasible way to find out if a child want to be alive until it's already too late.", "created_utc": "1486655663.0", "edited": "False", "id": "ddj8d7o", "is_submitter": "False", "link_id": "t3_5sz9ms", "parent_id": "t1_ddj7vtt", "score": "13", "subreddit": "antinatalism", "subreddit_id": "t5_2ro3i"}, {"author": "LordArkana", "body": "Hey, I might know the goth girl who owns a shop. Small world.\nAnd you just met a neckbeard with an actual waifu. Amazing!", "created_utc": "1486581172.0", "edited": "False", "id": "ddhy4t6", "is_submitter": "False", "link_id": "t3_5srbab", "parent_id": "t3_5srbab", "score": "8", "subreddit": "neckbeardstories", "subreddit_id": "t5_2waxs"}, {"author": "LordArkana", "body": "This is a great tip, I wish it would apply to me but alas... I only drink water and tea and I'm still fat. \nIt doesn't help that I'm hungry every 3 hours.", "created_utc": "1486579515.0", "edited": "False", "id": "ddhwm1t", "is_submitter": "False", "link_id": "t3_5sselv", "parent_id": "t3_5sselv", "score": "1", "subreddit": "AdviceAnimals", "subreddit_id": "t5_2s7tt"}, {"author": "LordArkana", "body": "I get irrationnally angry when people leave their pets behind for babies. Animals are not goddamn decorations that can be taken away at your leisure! My heart breaks at the amount of cats that get given up and the amount that will never get adopted. I have three cats, and that's all I can take care of and afford right now. But every single day I see people asking for kittens or older cats to be rehomed urgently, usually for good reasons, and it kills me that I can't do anything to help them. Too many abandoned cats, not enough loving homes...", "created_utc": "1486446014.0", "edited": "False", "id": "ddfl05p", "is_submitter": "False", "link_id": "t3_5shzak", "parent_id": "t3_5shzak", "score": "3", "subreddit": "childfree", "subreddit_id": "t5_2qtwb"}, {"author": "LordArkana", "body": "Honestly, I think that if you don't like an activity and force yourself to do it, it will make you even more anxious. Theater, improv, singing, those are all good activities for getting out there, but if you don't like it, you won't get benefits. I'd say it's better to go with your interests, even if it doesn't seem social at first - let's say chess: you still need to talk to people in order to play chess, and you can meet others with a common interest. ", "created_utc": "1486224553.0", "edited": "False", "id": "ddbopka", "is_submitter": "False", "link_id": "t3_5rw6n1", "parent_id": "t3_5rw6n1", "score": "1", "subreddit": "socialanxiety", "subreddit_id": "t5_2r22n"}, {"author": "LordArkana", "body": "Posting on Reddit is one of the things making me very anxious. I feel like Redditors have this kind of posting etiquette, you know how so many threads have these long jokes made by several people, and they all know exactly what to say to make it better... I just read these and think, I'd never be able to do that, I'd ruin a joke. Or even making my own thread, I feel like people will judge me for it.\n\nActually it happened once, in the rant subreddit. I made a rant about those annoying Facebook images that ask you to like and share if you're really my friend, 97% will not repost this, etc. and how my mother kept buying into these things and thinking noone liked her because they didn't share her image. I was downvoted for said rant and someone told to me to just ignore the images.\n\nIt was a rant, I know it wasn't a big deal, that's why I posted in rant and not offmychest or something... I thought I was doing it right, so that whole thing made me super anxious because I feel like my post was worthless and I was stupid for feeling this way, like I broke some kind of rule by posting this. I just don't know what's okay to post or not anymore.", "created_utc": "1486224199.0", "edited": "False", "id": "ddboh1a", "is_submitter": "False", "link_id": "t3_5rxvki", "parent_id": "t3_5rxvki", "score": "8", "subreddit": "socialanxiety", "subreddit_id": "t5_2r22n"}, {"author": "LordArkana", "body": "I actually respect people who foster and adopt children a lot more than those who make them. Those kids are already alive, and need a family, and are just as loved if not more than biological children because they were WANTED. You can't accidentally adopt a kid.\nYour friend is very awesome and I wish I had her guts if I heard stuff like that!", "created_utc": "1486190118.0", "edited": "False", "id": "ddbbavo", "is_submitter": "False", "link_id": "t3_5rwrvj", "parent_id": "t3_5rwrvj", "score": "48", "subreddit": "childfree", "subreddit_id": "t5_2qtwb"}, {"author": "LordArkana", "body": "> More like Ted Cruz!\n\nYou mean Zodiac Killer!", "created_utc": "1486189087.0", "edited": "False", "id": "ddbaucy", "is_submitter": "False", "link_id": "t3_5rrmnr", "parent_id": "t1_ddarz0g", "score": "1", "subreddit": "The_Gaben", "subreddit_id": "t5_3ii9a"}, {"author": "LordArkana", "body": "Thanks! The picture looks better than I do, I just have a lot of trouble finding the right light and angles to show what it's really like. \nWhat's a BHA?", "created_utc": "1486189024.0", "edited": "False", "id": "ddbatbi", "is_submitter": "False", "link_id": "t3_5qyioy", "parent_id": "t1_ddba4pv", "score": "1", "subreddit": "SkincareAddiction", "subreddit_id": "t5_2tbbg"}, {"author": "LordArkana", "body": "I'm glad she's so open about the childfree lifestyle, but also about gender as a social construct. I'd definitely sign up for her class!", "created_utc": "1486150480.0", "edited": "False", "id": "ddajp0n", "is_submitter": "False", "link_id": "t3_5rvkvu", "parent_id": "t3_5rvkvu", "score": "38", "subreddit": "childfree", "subreddit_id": "t5_2qtwb"}, {"author": "LordArkana", "body": "Hi everyone, I'm new here. I've always had large pores and slightly reddish skin and it makes me feel really self-conscious.\n\nMy skin type is oily, there's no inbetween, it's like that all over. Perhaps less on my chin, since I have a beard, but it's very bad all over my face.\n\nIn the morning, I used Bioderma's Sébium Purifying cleansing foam gel for combination-oily skin. It's paraben free and hypoallergenic.\nAfter that, I put on Bioderma's Pore Refiner cream - Corrective care for enlarged pores.\n\nI've been using these two products together for at least 2 years now, and while the cream does help preventing the oil from getting bad on my skin after wash, I feel it doesn't help tightening my pores, as I will show in a picture. I don't really wash my face in the evening, I only use the products once a day and I do nothing else to my face.\nHere is a picture: http://i.imgur.com/v2TunAy.jpg\nI live in the province of Quebec, Canada. Thanks!", "created_utc": "1486144899.0", "edited": "False", "id": "ddaems5", "is_submitter": "False", "link_id": "t3_5qyioy", "parent_id": "t3_5qyioy", "score": "1", "subreddit": "SkincareAddiction", "subreddit_id": "t5_2tbbg"}, {"author": "LordArkana", "body": "He looks like an older Justin Trudeau!", "created_utc": "1486097721.0", "edited": "False", "id": "dd9onr7", "is_submitter": "False", "link_id": "t3_5rrmnr", "parent_id": "t3_5rrmnr", "score": "20", "subreddit": "The_Gaben", "subreddit_id": "t5_3ii9a"}, {"author": "LordArkana", "body": "Holy shit, I thought that was a young Mama June there. Cannot unsee.", "created_utc": "1485932827.0", "edited": "False", "id": "dd6jfjf", "is_submitter": "False", "link_id": "t3_5rcfcy", "parent_id": "t3_5rcfcy", "score": "0", "subreddit": "funny", "subreddit_id": "t5_2qh33"}, {"author": "LordArkana", "body": "I really think that's it. I work evenings, from 4 PM to midnight. When I get home, it's like my evening for people with normal shifts, so that's when I play games, browse the internet, etc. and I know if I go to bed, when I wake up I'll have to get ready for another work day. At least, right now, I don't have to worry about that. I don't think it's an anxiety thing though, I just enjoy being alone with my things.", "created_utc": "1485412516.0", "edited": "False", "id": "dcx9fay", "is_submitter": "False", "link_id": "t3_5q6fmy", "parent_id": "t3_5q6fmy", "score": "5", "subreddit": "socialanxiety", "subreddit_id": "t5_2r22n"}, {"author": "LordArkana", "body": "Hey, those recipes sound amazing and it's a great idea as budget is one of the reasons I couldn't get into keto yet. I just have one remark, though... the bacon cheeseburger casserole... the amount of sodium and cholesterol seem very high for only one meal, is that alright? I'm completely new to this and wanted to know if it was healthy to get to such high levels. Thanks!", "created_utc": "1485411984.0", "edited": "False", "id": "dcx95l4", "is_submitter": "False", "link_id": "t3_5q3r4s", "parent_id": "t3_5q3r4s", "score": "-1", "subreddit": "keto", "subreddit_id": "t5_2rske"}, {"author": "LordArkana", "body": "I've said the same thing to some people, but I have you telling me I am indeed antinatalist, and NONONATAL telling me I'm not one at all. This causes some confusion. Perhaps everyone has different views and reasons and it's not a common consensus. Basically, my core concept is that bringing more people in the world is ridiculous, as we have far too many already and most of the world suffers; why make it worse by adding more potential sufferers?", "created_utc": "1485324595.0", "edited": "False", "id": "dcvl2km", "is_submitter": "True", "link_id": "t3_5pxx4d", "parent_id": "t1_dcuvdlt", "score": "4", "subreddit": "antinatalism", "subreddit_id": "t5_2ro3i"}, {"author": "LordArkana", "body": "That's one huge part why I'm childfree and feel everyone else should be: bringing someone to life is a gamble. It's playing the lottery. You don't know what you'll end up with, and I hate doing things with such a huge risk factor. Even if you birth a perfectly healthy child, it doesn't guarantee their happiness. You have absolutely no way to know what that child will want in life. They may never get it, never be happy, no matter their upbringing. And that's if you get a well-balanced child, with no illnesses or disorders of any kind. I won't make that gambler, ever, and nobody else should. Things were different in the past; but now more than ever, we are in a world where living is just not worth it, unless you're extremely privileged.", "created_utc": "1485324417.0", "edited": "False", "id": "dcvkz3c", "is_submitter": "True", "link_id": "t3_5pxx4d", "parent_id": "t1_dcv2ne1", "score": "6", "subreddit": "antinatalism", "subreddit_id": "t5_2ro3i"}, {"author": "LordArkana", "body": "So it seems we think exactly the same. It's reassuring to see I'm not alone!", "created_utc": "1485324237.0", "edited": "False", "id": "dcvkvlh", "is_submitter": "True", "link_id": "t3_5pxx4d", "parent_id": "t1_dcv22gb", "score": "3", "subreddit": "antinatalism", "subreddit_id": "t5_2ro3i"}, {"author": "LordArkana", "body": "You are one of the people who tell me that there are different 'kinds' of antinatalist, and you don't have to adhere to the strict rules to be considered one. And I have others tell me that you must have certain characteristics or you aren't one at all. It's a bit confusing, I'll admit. I agree with you on the environment, this is a huge reason why I don't want humans to breed more. If we were a respectful specie that thinks beyond their own immediate needs, perhaps I, too, would reconsider my stance. \n\nAnd I've always thought that adopting children was far more humane. They are already born; might as well give them a hope at life, and hopefully make them better humans for the time they are on earth. I'd still leave that job to someone else, though. :)", "created_utc": "1485324148.0", "edited": "False", "id": "dcvktvb", "is_submitter": "True", "link_id": "t3_5pxx4d", "parent_id": "t1_dcvcs44", "score": "3", "subreddit": "antinatalism", "subreddit_id": "t5_2ro3i"}, {"author": "LordArkana", "body": "It's interesting because I've had very different answers from other commenters here: some do feel they are a bit AN, or share a few characteristics, but they don't see it as either you are or you aren't. Would you say those people do not belong here either? I'm not looking to argue, just understand. And I mentioned I was childfree because I genuinely do not want to care for children, ever, and while I'm not a fan of them I don't hate them. In fact this is where I felt I was in the middle, as I'm not only childfree but also don't think people should bring new life into the world, not only because of the overpopulation and environment problems, but because we tend to fuck up everything we do. A very small minority of humans are happy, and that's because they exploit the vast majority, who live in misery. That's why I want us to go extinct one day. Isn't that one of the many arguments I have seen AN make? I should have clarified my first post, but I didn't want to make it too long. I agree with the core belief that non-existence is better because you could never know suffering, but you could never know pleasure either. While we do spend most of our lives suffering instead of enjoying ourselves, which is why I agree with antinatalism, I'm more of the belief that while I'm here, I may as well make my passage worth it for some people and for myself, instead of doing nothing. And I don't mean that nobody here does that, just that this is what I want to use my life for. Sorry if I come across as disrespectful, english isn't my first language and I try to word things in the best way I can. You and everyone else helped me understand better.", "created_utc": "1485323789.0", "edited": "False", "id": "dcvkmvi", "is_submitter": "True", "link_id": "t3_5pxx4d", "parent_id": "t1_dcv5h55", "score": "3", "subreddit": "antinatalism", "subreddit_id": "t5_2ro3i"}, {"author": "LordArkana", "body": "I edited my post, I didn't mean to word it as if I felt uncomfortable here. This place owes me nothing and I just wanted to clarify what being AN actually was to different people. I've had mixed responses, some feel strongly about it and others less, and I think it's interesting. I agree that safe spaces are important and I just wanted to make sure I belonged here, basically. I'm just awkward with words sometimes.", "created_utc": "1485323267.0", "edited": "False", "id": "dcvkcmu", "is_submitter": "True", "link_id": "t3_5pxx4d", "parent_id": "t1_dcv3w74", "score": "1", "subreddit": "antinatalism", "subreddit_id": "t5_2ro3i"}, {"author": "LordArkana", "body": "I would never be unkind to suicidal people, or feed them the same narrative as everyone else to convince them to stay alive when they are clearly unhappy. I do think it's cruel to force someone to stay alive just to make ourselves feel good. I actually browse the SanctionedSuicide subreddit occasionally, because I'm genuinely curious, but never comment because it is not my place and I respect that. There have been times in my life where I wish I could just disappear, but I've never felt truly suicidal; I'm a very passive person in almost everything. You're right though, I will never say never, but I'll keep on living as long as I can.", "created_utc": "1485323082.0", "edited": "False", "id": "dcvk8zk", "is_submitter": "True", "link_id": "t3_5pxx4d", "parent_id": "t1_dcuuo0g", "score": "7", "subreddit": "antinatalism", "subreddit_id": "t5_2ro3i"}, {"author": "LordArkana", "body": "Perfectly normal, dude. I myself had a GIANT crush on my physics and astronomy teacher. He was basically everything I could hope for in a potential partner. I like older men, have a thing for teachers, and he was amazingly charming and sarcastic, as well as brilliant. Man of my dreams. Of course he has a girlfriend. And I'm a guy. I don't know if I'll ever find someone like that one day, but I let it go. Good luck.", "created_utc": "1485282904.0", "edited": "False", "id": "dcunivt", "is_submitter": "False", "link_id": "t3_5pw8qw", "parent_id": "t3_5pw8qw", "score": "2", "subreddit": "confession", "subreddit_id": "t5_2qo2a"}, {"author": "LordArkana", "body": "This is what I wish I could do. I know paying off the minimum everytime is not enough, but unfortunately, I have an outstanding debt on my credit card and I must keep using it for certain things. I've started working full time again a month ago, but it takes a while with rent, bills, food, and other debts to rake up enough money for my credit card. I have to pay rent on my own some months, because my roommate doesn't always have work. Saving up is incredibly difficult. I hope I can start doing this soon.", "created_utc": "1485280204.0", "edited": "False", "id": "dcul21z", "is_submitter": "False", "link_id": "t3_5prf9l", "parent_id": "t3_5prf9l", "score": "1", "subreddit": "personalfinance", "subreddit_id": "t5_2qstm"}, {"author": "LordArkana", "body": "I sometimes get the same speech, that I'm so smart, my kids would be great people and geniuses. That's when I remind people that having kids is like the lottery: I might have a better chance of spreading good genetics, but the personality is literally a roulette; I could get a smart drug addict, an heavily handicapped kid, well the possibilities are endless and I'm just not gonna risk it.", "created_utc": "1485154621.0", "edited": "False", "id": "dcsdcbx", "is_submitter": "False", "link_id": "t3_5pmf4j", "parent_id": "t3_5pmf4j", "score": "9", "subreddit": "childfree", "subreddit_id": "t5_2qtwb"}, {"author": "LordArkana", "body": "That was very enlightening, and made me realize I am affected by this mindset as well. An old man dying of cancer is very sad, as he was probably loved by many people, but it's a logical step in life. A young girl of 16, about to graduate, dying of the same is even more tragic in people's eyes because of that phenomenon: she was about to enter adulthood, and about to finish an important milestone, and all that was taken away from her. I work in an hospital and see many death certificates, most of them of people over 70. But occasionally I see a person in their 20's and I just get super sad. ", "created_utc": "1484930472.0", "edited": "False", "id": "dcody6o", "is_submitter": "False", "link_id": "t3_5p452n", "parent_id": "t1_dco99f3", "score": "27", "subreddit": "childfree", "subreddit_id": "t5_2qtwb"}, {"author": "LordArkana", "body": "Same here. Whenever I hear the wheels of a stroller getting in a bus, I just sigh and it takes everything not to roll my eyes and show my annoyance. Childcare is super expensive, and if you know you're going to take your baby everywhere you go, shouldn't you think about that before...? I know it's not a popular opinion, because not everyone can afford a car but that's the thing... cars are far less expensive than kids!", "created_utc": "1484930077.0", "edited": "False", "id": "dcodlt8", "is_submitter": "True", "link_id": "t3_5or9rs", "parent_id": "t1_dcocmvh", "score": "2", "subreddit": "childfree", "subreddit_id": "t5_2qtwb"}, {"author": "LordArkana", "body": "Being disabled isn't a choice, and I know it's hard to get on a bus when using a wheelchair or other means. But every single time a disabled person came in, they never made any fuss and took the ramp in the back door of the bus, because that's where it's easier to get off, but sometimes they take the front. Still, it's usually well known in advance and everyone can get ready to let them off safely.\nWhy is it so hard for people with strollers to get ready? The mother acts as if it's a complete surprise whenever she arrives near her stop. Probably because she's too busy cooing at her kids and playing with the various toys on the stroller.\n", "created_utc": "1484767619.0", "edited": "False", "id": "dclgh9e", "is_submitter": "True", "link_id": "t3_5or9rs", "parent_id": "t1_dclfr0t", "score": "38", "subreddit": "childfree", "subreddit_id": "t5_2qtwb"}, {"author": "LordArkana", "body": "Well hey, I actually got over my social anxiety and phoned Altima to change my plan. I had 10 MB, unlimited, for 45$ taxes included. Now I'll have 15 MB for the exact same price. Only thing is they charge a 25$ fee for changing speeds... is that legit?", "created_utc": "1484680520.0", "edited": "False", "id": "dcjv38z", "is_submitter": "False", "link_id": "t3_5ofw51", "parent_id": "t3_5ofw51", "score": "2", "subreddit": "montreal", "subreddit_id": "t5_2qnmr"}, {"author": "LordArkana", "body": "Holy shit. I have no idea what voodoo magic this is (I'm seriously unknowledgeable in plumbing) but when I took it off, water came right out. Both hot and cold. Played with the valves again to make sure, and yeah, it works. I rinsed the aerator, then put it back, and now water flows normally. What happened then? Could it have just been clogged?\n\nAnyways, thank you very much. I'm glad this was an easy fix and I won't have to pay for a plumber.", "created_utc": "1484590709.0", "edited": "False", "id": "dci7q2z", "is_submitter": "True", "link_id": "t3_5oc4sr", "parent_id": "t1_dci719e", "score": "2", "subreddit": "Plumbing", "subreddit_id": "t5_2slqb"}, {"author": "LordArkana", "body": "I live in a big city, so I suppose it's municipal water. Oh, and I should add that every other plumbing system in the apartment works just fine: the tub, the toilet, and everything else. It's just the sink in the bathroom.", "created_utc": "1484588463.0", "edited": "False", "id": "dci5t8i", "is_submitter": "True", "link_id": "t3_5oc4sr", "parent_id": "t1_dci5p61", "score": "1", "subreddit": "Plumbing", "subreddit_id": "t5_2slqb"}, {"author": "LordArkana", "body": "I actually know a lot of people with the opposite. My friend, a girl, comes from a family of 6 girls. Her sister had a girl. No boys anywhere. Thankfully, her parents are actually decent people and know how to take care of children and don't care about their genitals.", "created_utc": "1484420677.0", "edited": "False", "id": "dcfbx8c", "is_submitter": "False", "link_id": "t3_5nwcf3", "parent_id": "t1_dcf9087", "score": "6", "subreddit": "childfree", "subreddit_id": "t5_2qtwb"}, {"author": "LordArkana", "body": "Only every single day of my life. Everything I do, I feel judged. I make a mistake, it's the end of the world. I feel like a complete moron at everything.", "created_utc": "1484333062.0", "edited": "False", "id": "dcdx53p", "is_submitter": "False", "link_id": "t3_5nqaus", "parent_id": "t3_5nqaus", "score": "26", "subreddit": "socialanxiety", "subreddit_id": "t5_2r22n"}, {"author": "LordArkana", "body": "It was that way for me too. Everytime I made a mention of leaving, or being tired of trying a relationship that would never work, my pwBPD would be much nicer, patient, clean more, try their hardest and things would be better for a few days... until it all went back down again. So I have to make threats of leaving if I want a decent couple of days. It's exhausting.", "created_utc": "1484029243.0", "edited": "False", "id": "dc8e8ta", "is_submitter": "False", "link_id": "t3_5myqck", "parent_id": "t1_dc7hooc", "score": "3", "subreddit": "BPDlovedones", "subreddit_id": "t5_33dd6"}, {"author": "LordArkana", "body": "Oh my god, I needed to read this today. I came to slowly realize this after years of a relationship with a BPD person. To them I'm saving their life, I help so much, I'm wonderful, etc. but everytime they say they're getting better and need me to get through it, shortly after it's back to the same depressive thoughts, they're worthless, can't do this or that, nothing ever works, etc.\n\nThis is helping me make my decision to leave easier. Some people need to help themselves.", "created_utc": "1483981920.0", "edited": "False", "id": "dc7c32q", "is_submitter": "False", "link_id": "t3_5myqck", "parent_id": "t3_5myqck", "score": "10", "subreddit": "BPDlovedones", "subreddit_id": "t5_33dd6"}, {"author": "LordArkana", "body": "I applied a few days ago and got a call back today. The lady told me they do offer training, but it's not on how to file a basic tax return; they expect their volunteers to know the basic how-to, and only train us in the specifics of the new year's changes and a few other things. Maybe the other provinces have more resources allocated for training... the lady kept my name anyways and submitted my number to organisms that could take me, so we'll see.", "created_utc": "1483721672.0", "edited": "False", "id": "dc2xyo0", "is_submitter": "True", "link_id": "t3_5k15sb", "parent_id": "t1_dbknwz9", "score": "1", "subreddit": "PersonalFinanceCanada", "subreddit_id": "t5_2tasy"}, {"author": "LordArkana", "body": "Never tried any of the sets, but these look amazing! I wish David's tea would bring back the spring white pearls I bought many years ago...", "created_utc": "1483555553.0", "edited": "False", "id": "dbzwer0", "is_submitter": "False", "link_id": "t3_5lyo73", "parent_id": "t3_5lyo73", "score": "3", "subreddit": "tea", "subreddit_id": "t5_2qq5e"}, {"author": "LordArkana", "body": "I feel this harder and harder every day. I've been employed at an hospital for 4 years, and the job I'm doing is the most unrewarding, soul-crushing, boring job I've ever had. It pays VERY well for something requiring nothing but a high school diploma. It's the only way I can even begin to consider repaying my huge credit card and student loan debts. Oh, also I've got social anxiety, so any job requiring me to talk to strangers is out of the question until I pull myself together somehow... someday. I've got a plan for the future, going back to school, saving up, slowly paying my debt... but right now, this is an awful way to live. I feel like most of my quite decent paycheck gets eaten away by bills and rent. \nI would love to be a writer, spend my free time playing music, playing games, watching shows, getting back in shape, without dreading having to go back to work. I'm still hopeful, I have ambitions. But it's bloody hard right now. I do wish sometimes my parents didn't have me. They are unable to provide me with any financial help, except my father sometimes, and most of the time I'm the one who has to help my mother. I have no cushion to fall back on, nowhere to go to if I lose my job or apartment. I can only hope that my plans for the future work out.", "created_utc": "1483547804.0", "edited": "False", "id": "dbzpp9f", "is_submitter": "False", "link_id": "t3_5lvu5e", "parent_id": "t3_5lvu5e", "score": "7", "subreddit": "antinatalism", "subreddit_id": "t5_2ro3i"}, {"author": "LordArkana", "body": "\"you'r knight and shining armour\"\nOne would think a gentlesir capable of spelling your and using the right word!", "created_utc": "1483546888.0", "edited": "False", "id": "dbzoxpt", "is_submitter": "False", "link_id": "t3_5ltgc4", "parent_id": "t3_5ltgc4", "score": "98", "subreddit": "creepyasterisks", "subreddit_id": "t5_3hmzi"}, {"author": "LordArkana", "body": "I was going to suggest that, the author is Patrick Sénécal but I'm not familiar with the specifics of the story.", "created_utc": "1483546649.0", "edited": "False", "id": "dbzoqr2", "is_submitter": "False", "link_id": "t3_5lxrwb", "parent_id": "t1_dbzcrsj", "score": "2", "subreddit": "tipofmytongue", "subreddit_id": "t5_2r4oc"}, {"author": "LordArkana", "body": "A choice to be on FB, or a choice to participate in the shared images? My mother tends to take very small things personally, so in a way, I kinda don't have a choice. If I don't share her friendship renewal thing, she might think I don't love her anymore. Anyway, I just needed to say this to make me feel better, I don't have to justify anything...", "created_utc": "1482560821.0", "edited": "False", "id": "dbko3ot", "is_submitter": "True", "link_id": "t3_5k1qvs", "parent_id": "t1_dbknyfy", "score": "0", "subreddit": "rant", "subreddit_id": "t5_2qn2b"}, {"author": "LordArkana", "body": "That's the problem, actually: people tend to deviate to extremes far too easily. I have quite a few friends who belong in the SJW category. I'm trans myself, gay, and mixed race, so I sit kinda low on the privilege thing. Nevertheless, I actually find myself rolling my eyes at most of the things these SJW friends say. I found a post where a very accepting, open minded, sweet lady claimed something could be considered a genderqueer identity; these two transmen tore into her and made her seem like the bad person. They actually argue about semantics, throwing every SJW buzzword to attack people who don't agree with their extremely narrow views and, of course, privilege. What happened to debating thing without resorting to personal attacks and blocking? I feel like these people are delusional and have gone too far. As a trans man, I just want to live my life like anyone else can. Cis people have privilege over me. Do I make everyone feel like shit for it? No. When even trans people attack other trans people, you know something's wrong.", "created_utc": "1482560583.0", "edited": "False", "id": "dbko05p", "is_submitter": "False", "link_id": "t3_5juogu", "parent_id": "t3_5juogu", "score": "2", "subreddit": "rant", "subreddit_id": "t5_2qn2b"}, {"author": "LordArkana", "body": "Sure, except I use it to talk to a lot of people with whom I could never speak to otherwise. And I'm part of some work related groups, and other things. This is a place to rant, so I did. I'm ok with FB in general; I just hate those cringy posts and wanted to get it off my chest.", "created_utc": "1482560076.0", "edited": "False", "id": "dbkns1z", "is_submitter": "True", "link_id": "t3_5k1qvs", "parent_id": "t1_dbknp4a", "score": "0", "subreddit": "rant", "subreddit_id": "t5_2qn2b"}, {"author": "LordArkana", "body": "Crippling social anxiety, leading to the fear of being the center of attention in public if I act out, which could lead to a panic attack. :)", "created_utc": "1481987493.0", "edited": "False", "id": "dbb3lwm", "is_submitter": "False", "link_id": "t3_5iua2w", "parent_id": "t3_5iua2w", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "LordArkana", "body": "Congratulations! As someone who one day aspires to pilot helicopters, I'm thrilled for you.", "created_utc": "1481657463.0", "edited": "False", "id": "db5j56d", "is_submitter": "False", "link_id": "t3_5i3392", "parent_id": "t3_5i3392", "score": "1", "subreddit": "AdviceAnimals", "subreddit_id": "t5_2s7tt"}, {"author": "LordArkana", "body": "Sometimes, yes, but only when I compare myself to people who are the exact opposite. You know, the loudmouths, the know-it-alls, the ones who speak loudly no matter where they are or how close is the person they're talking to, the ones who interrupt a conversation to butt in... and the ones who say innapropriate things at the wrong time. These people attract attention, and a lot of time, it's bad attention. I know, I have a few colleagues like that. And I'm thinking... as someone with SA, I may think too much about what I'm about to say, but at least I -think-. I don't interrupt people. I'm polite. I do my best to be nice because I hate conflict. And none of these are bad; what's bad is that I take it to the extreme because of my disorder. I want so badly to be loved by everyone, even complete strangers, that the though of displeasing even one person is paralyzing and panic inducing.\nBut I'm pretty sure most people like me because I'm quiet and speak when I know I should speak. It's like.. pros and cons. I wish I didn't have it, I don't think I would become the opposite extreme, but I prefer it that way if I had to choose.", "created_utc": "1481608786.0", "edited": "False", "id": "db4rdjr", "is_submitter": "False", "link_id": "t3_5i0gi9", "parent_id": "t3_5i0gi9", "score": "2", "subreddit": "socialanxiety", "subreddit_id": "t5_2r22n"}, {"author": "LordArkana", "body": "How can he possibly think this is gonna sound attractive to anyone?", "created_utc": "1481310732.0", "edited": "False", "id": "dazt04d", "is_submitter": "False", "link_id": "t3_5gptmk", "parent_id": "t3_5gptmk", "score": "70", "subreddit": "creepyasterisks", "subreddit_id": "t5_3hmzi"}, {"author": "LordArkana", "body": "I got 10 times the cat litter. Awww yisss", "created_utc": "1481303635.0", "edited": "False", "id": "dazmv4p", "is_submitter": "False", "link_id": "t3_5hdps6", "parent_id": "t3_5hdps6", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "LordArkana", "body": "Aah, the joys of office work. I fortunately do not have baby crazy colleagues - most of them are too old or already have adult kids, the others are gay men. I do have to endure that one guy who whistles all the damn time and laughs loudly when listening to his radio show...\n", "created_utc": "1481138413.0", "edited": "False", "id": "dawqabx", "is_submitter": "False", "link_id": "t3_5gzzf7", "parent_id": "t3_5gzzf7", "score": "3", "subreddit": "childfree", "subreddit_id": "t5_2qtwb"}, {"author": "LordArkana", "body": "I'm from Canada so my experience may be different, but I started uni in biochemistry because that's what I wanted to do. I realized I sucked at chemistry after a year and was kicked out of the program. I decided to stay one year longer as a free student, not majoring in anything, just taking any classes that seemed fun. I took Greek that year, along with some genetics and biology classes. While I definitely don't regret taking Greek in school, I did raise my debt up 3200$ and have nothing to show for it. It's better to have a plan, really.", "created_utc": "1481089130.0", "edited": "False", "id": "davz9y7", "is_submitter": "False", "link_id": "t3_5gq1do", "parent_id": "t1_dauznte", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "LordArkana", "body": "This is actually one of my favorite subreddits.", "created_utc": "1480912632.0", "edited": "False", "id": "dasv6p0", "is_submitter": "False", "link_id": "t3_5ghuvk", "parent_id": "t1_dasdbsg", "score": "18", "subreddit": "childfree", "subreddit_id": "t5_2qtwb"}, {"author": "LordArkana", "body": "I've seen a lot of people suggest babysitting, which is a great idea, but may I take it a step further and suggest fostering kids? You get to raise them, they live with you, but they're not yours. They will eventually get adopted or, when old enough, go out and live their life, but they may keep a link with you. At least that's my understanding of the system, I might be wrong. Also, fostering doesn't mean you can't have your own kids if you decide that's what you want after all. I think it would be the best option to see if you could take care of a child for years, every single day.", "created_utc": "1480886976.0", "edited": "False", "id": "dasc0ms", "is_submitter": "False", "link_id": "t3_5gh8lp", "parent_id": "t3_5gh8lp", "score": "2", "subreddit": "childfree", "subreddit_id": "t5_2qtwb"}, {"author": "LordArkana", "body": "As a gamer and a cat lover, this picture makes me very happy.", "created_utc": "1480886548.0", "edited": "False", "id": "dasbp03", "is_submitter": "False", "link_id": "t3_5ghmey", "parent_id": "t3_5ghmey", "score": "21", "subreddit": "childfree", "subreddit_id": "t5_2qtwb"}, {"author": "LordArkana", "body": "Even before I heard this quote, I have always given this reason for not having kids.You have lots of money, a great career, a house, a loving SO, and you're gonna... ruin it all by breeding? You might end up with a drug addict. You might end up with a murderer, a thief, an ungrateful, lazy bastard that doesn't want to work... or you could end up with the next Nobel prize winner, but it's like the lottery: you have far more chances of getting the former. I'm not ready to risk that. Everything I work for, I have control over. Everything I do is for a reason. A kid would collapse the whole damn thing.", "created_utc": "1480884986.0", "edited": "False", "id": "dasafel", "is_submitter": "False", "link_id": "t3_5gfs83", "parent_id": "t3_5gfs83", "score": "21", "subreddit": "childfree", "subreddit_id": "t5_2qtwb"}, {"author": "LordArkana", "body": "I think I met my first neckbeard at my driving classes a few weeks ago. The guy was overweight, wore a too tight t-shirt and cheap jeans you can find at generic stores. When we were in class, he was sitting in front of me, and with his feet on the chair next to him.Whenever the instructor made a joke, he'd laugh loudly, and turn around to look at me. Why me? Because I was the closest? Because he thought we were kin? Regardless, this went on until the end of the class. I stayed after to ask a question, and he stayed as well to gather his things. On his desk were a bunch of university assignments, like a huge pile. He started talking to me about his studies and how he had the best scores, how he loved debating in his classes, he had the highest possible GPA, etc. and when we left he actually followed me outside. We were going in the same direction. He asked me why I was taking driving lessons, told him I was sick of waiting for buses and the metro that never came on time and taking 1 hour to get to work when it can take 15 minutes. When I asked him the same question, he said...\n\"I'm tired of taking the bus with plebs. I overhear so many stupid conversations, people in this city are so stupid. It's hard not to rage when surrounded by plebs.\" He reached his destination and we said goodbye.\n\nI don't think I want to meet another neckbeard now.", "created_utc": "1480792336.0", "edited": "False", "id": "daqtktr", "is_submitter": "False", "link_id": "t3_5g49gt", "parent_id": "t3_5g49gt", "score": "3", "subreddit": "justneckbeardthings", "subreddit_id": "t5_2xp02"}, {"author": "LordArkana", "body": "Try Mago de Oz, I think technically they're more folk rock than folk metal but they're pretty amazing.", "created_utc": "1480361048.0", "edited": "False", "id": "dajdqmb", "is_submitter": "False", "link_id": "t3_5f8fgn", "parent_id": "t1_daiynh0", "score": "1", "subreddit": "duolingo", "subreddit_id": "t5_2t6ze"}, {"author": "LordArkana", "body": "I feel like next year will be the right one. Every single time before, I hesitated, I tried to find excuses. Now I'm just biding my time, saving money, trying to make sure all loose ends are tied and everything taken care of. It's a few months, I can handle it.", "created_utc": "1480313743.0", "edited": "False", "id": "daiot1v", "is_submitter": "True", "link_id": "t3_5erd3l", "parent_id": "t1_daikn2t", "score": "1", "subreddit": "BPDlovedones", "subreddit_id": "t5_33dd6"}, {"author": "LordArkana", "body": "Old ladies buying lottery tickets take some of your time at worst, and are just completing a transaction. Smokers make you smell like hell for hours, on top of polluting you. Not exactly a good comparison there", "created_utc": "1480266409.0", "edited": "False", "id": "dahqdyn", "is_submitter": "False", "link_id": "t3_5f12zx", "parent_id": "t1_dahjqh0", "score": "5", "subreddit": "montreal", "subreddit_id": "t5_2qnmr"}, {"author": "LordArkana", "body": "I think it's fucking stupid and awful. I'm worried right now, because I know a couple who have three cats and some rats. They absolutely LOVE cats, especially the girl, who adores three things in life: cats, wine, and books. Seriously, it's her life. But then she went and got pregnant. And it seems she always has to bring it up on every FB post, even if it's irrelevant. I'm very worried she'll decide to get rid of her cats and rats when that baby comes. If she does, I think I'll lose my shit...", "created_utc": "1480226838.0", "edited": "False", "id": "daharen", "is_submitter": "False", "link_id": "t3_5f2vjz", "parent_id": "t3_5f2vjz", "score": "2", "subreddit": "childfree", "subreddit_id": "t5_2qtwb"}, {"author": "LordArkana", "body": "I think it's pretty easy to judge someone based on a few lines of text. Through what I have said, you couldn't possibly know every detail, everything that made this relationship worth it. I wouldn't have lasted this long if I hadn't been happy at one point. Sure, there was a time when I made excuses, but now I finally recognize that nothing will ever change and after giving out so many chances, I'm ready to go. I'm just waiting for the right moment.", "created_utc": "1480226345.0", "edited": "False", "id": "dahaimp", "is_submitter": "True", "link_id": "t3_5erd3l", "parent_id": "t1_dah8yvr", "score": "2", "subreddit": "BPDlovedones", "subreddit_id": "t5_33dd6"}, {"author": "LordArkana", "body": "Perhaps I should have mentioned, I am a man. :) Thanks for the support.", "created_utc": "1480179469.0", "edited": "False", "id": "dagfida", "is_submitter": "True", "link_id": "t3_5erd3l", "parent_id": "t1_dage59p", "score": "1", "subreddit": "BPDlovedones", "subreddit_id": "t5_33dd6"}, {"author": "LordArkana", "body": "This is exactly my problem, as well. I don't want him to suffer because I'm leaving, ultimately nobody deserves to be homeless and in trouble but I can't help him on my own. Let me know when things get better for you.", "created_utc": "1480178176.0", "edited": "False", "id": "dagen1y", "is_submitter": "True", "link_id": "t3_5erd3l", "parent_id": "t1_dafeh0o", "score": "1", "subreddit": "BPDlovedones", "subreddit_id": "t5_33dd6"}, {"author": "LordArkana", "body": "I may have been.. unkind in my description of him. I know his illness isn't all he is. He has qualities. He's generous even when he has little, does all kinds of little things for me to show he cares... but the BPD part of him takes over too often that I've stopped caring about the little things. He's not an awful or evil person, but I cannot be with him anymore. I'm probably too nice. I hate conflict, I avoid them like the plague. I try to deescalate situations and be as neutral as possible. As such, I will always seek the most peaceful solution...", "created_utc": "1480177886.0", "edited": "False", "id": "dageg45", "is_submitter": "True", "link_id": "t3_5erd3l", "parent_id": "t1_dafislo", "score": "1", "subreddit": "BPDlovedones", "subreddit_id": "t5_33dd6"}, {"author": "LordArkana", "body": "Oh, I see! It makes a lot of sense, actually. Thank you!", "created_utc": "1480177752.0", "edited": "False", "id": "dagecyf", "is_submitter": "False", "link_id": "t3_5emevo", "parent_id": "t1_dag7yzv", "score": "3", "subreddit": "childfree", "subreddit_id": "t5_2qtwb"}, {"author": "LordArkana", "body": "English isn't my first language, so sorry for ruining the joke but - isn't the absence of something, and absent somethings, the same thing?", "created_utc": "1480097468.0", "edited": "False", "id": "dafaqc9", "is_submitter": "False", "link_id": "t3_5emevo", "parent_id": "t1_dadtftz", "score": "2", "subreddit": "childfree", "subreddit_id": "t5_2qtwb"}, {"author": "LordArkana", "body": "I understand, but I have also known him long enough to know he hates being this way and doesn't intentionally do it. When I met him, we were just friends, then best friends. He had a bad home life and childhood, was bulied, etc. so I understand why he ended up that way. He knows it too and he tries hard, as I said he apologizes and keeps telling me how I don't deserve this and he hates when this happens.\n\nThe thing is, no matter how much I may want to believe him, I know that, intentionally or not, he's gonna keep doing it. And kicking him out or changing the locks is the worst thing I could do to him. I'd prefer to warn him in advance, give him time to find a place or someone to help, and go my own way without telling him where. \n", "created_utc": "1480089512.0", "edited": "False", "id": "daf5g25", "is_submitter": "True", "link_id": "t3_5erd3l", "parent_id": "t1_daexvli", "score": "1", "subreddit": "BPDlovedones", "subreddit_id": "t5_33dd6"}, {"author": "LordArkana", "body": "I'd quit my job and find a new, more fulfilling one. In a field that I like, that I feel comfortable in, and where I can make a difference without being scared of talking to people and sounding stupid or weird. Then I'd subscribe to a gym and go everyday, and message some friends to know how they're doing.", "created_utc": "1479836770.0", "edited": "False", "id": "dab84kv", "is_submitter": "False", "link_id": "t3_5eb622", "parent_id": "t3_5eb622", "score": "3", "subreddit": "socialanxiety", "subreddit_id": "t5_2r22n"}, {"author": "LordArkana", "body": "Breathing. From childhood asthma to allergies to dust, smoke, pet hair, and various trees and molds, I can safely say breathing is a hassle every single day.", "created_utc": "1479832954.0", "edited": "False", "id": "dab4zcg", "is_submitter": "False", "link_id": "t3_5ea4vq", "parent_id": "t3_5ea4vq", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "LordArkana", "body": "Hi, sure! You can PM me so we can work out the details about how to communicate.", "created_utc": "1479744029.0", "edited": "False", "id": "da9m8gj", "is_submitter": "True", "link_id": "t3_5d0cd6", "parent_id": "t1_da9gimy", "score": "1", "subreddit": "LanguageBuds", "subreddit_id": "t5_2yta9"}, {"author": "LordArkana", "body": "That's beautiful! In this picture you look like a stock photo model as well! I could see your face in ads.", "created_utc": "1479659036.0", "edited": "False", "id": "da89nwg", "is_submitter": "False", "link_id": "t3_5dx2pm", "parent_id": "t3_5dx2pm", "score": "6", "subreddit": "FierceFlow", "subreddit_id": "t5_30hqx"}, {"author": "LordArkana", "body": "Hahah oh man, I applaud you sir. I wish I had the guts to do this kind of thing when in a restaurant, but social anxiety and all...", "created_utc": "1479422398.0", "edited": "False", "id": "da4uvto", "is_submitter": "False", "link_id": "t3_5ditus", "parent_id": "t3_5ditus", "score": "14", "subreddit": "childfree", "subreddit_id": "t5_2qtwb"}, {"author": "LordArkana", "body": "Yeah, we could definitely help each other out! How would you like to communicate? I've got Facebook, email, and I could use Skype.", "created_utc": "1479274156.0", "edited": "False", "id": "da2edqz", "is_submitter": "True", "link_id": "t3_5d0cd6", "parent_id": "t1_da1s5yn", "score": "1", "subreddit": "LanguageBuds", "subreddit_id": "t5_2yta9"}, {"author": "LordArkana", "body": "Wow. First time a bot ever corrects me. I feel pretty special right now! I learned me a thing!", "created_utc": "1479147256.0", "edited": "False", "id": "da033wx", "is_submitter": "False", "link_id": "t3_5cuguz", "parent_id": "t1_d9zpx37", "score": "2", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "LordArkana", "body": "I live in Canada, and we're very, very multicultural. My father is from Columbia so I kinda had to learn it. And yes, it's very helpful, because I can shop in those little latino stores where they sell amazing food and actually speak with people there, I can listen to conversations of people speaking on the bus, etc. but jokes aside, it's a very useful language to know because it's just so common where I live.", "created_utc": "1479127143.0", "edited": "False", "id": "d9zpx36", "is_submitter": "False", "link_id": "t3_5cuguz", "parent_id": "t3_5cuguz", "score": "1", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "LordArkana", "body": "Hi there, I'm from Quebec, Canada. French is my native tongue and I would be happy to help you!", "created_utc": "1479092203.0", "edited": "False", "id": "d9zbbyz", "is_submitter": "False", "link_id": "t3_5co31i", "parent_id": "t3_5co31i", "score": "1", "subreddit": "LanguageBuds", "subreddit_id": "t5_2yta9"}, {"author": "LordArkana", "body": "Reading this, I wish my grandfather had been alive when I came out. He died when I was 12 and he never knew me as I really was, because I transitioned at 16. I think he would have supported me as well. I'm really happy for you man :)", "created_utc": "1478636287.0", "edited": "False", "id": "d9rki27", "is_submitter": "False", "link_id": "t3_5bute7", "parent_id": "t3_5bute7", "score": "15", "subreddit": "ftm", "subreddit_id": "t5_2t9mw"}, {"author": "LordArkana", "body": "Of course! I was just going to use my free time to summon a demon, thanks for reminding me!", "created_utc": "1478635041.0", "edited": "False", "id": "d9rjfa6", "is_submitter": "False", "link_id": "t3_5btg60", "parent_id": "t1_d9rin0o", "score": "6", "subreddit": "childfree", "subreddit_id": "t5_2qtwb"}, {"author": "LordArkana", "body": "I'm 26 and I still feel sad, angry, betrayed, just any negative emotion whenever someone announces they're pregnant, wether it's a complete stranger or a close friend. The only thing that goes through my mind is that their life as they know it is over, and I should be glad? How?", "created_utc": "1478633979.0", "edited": "False", "id": "d9rii0b", "is_submitter": "False", "link_id": "t3_5btg60", "parent_id": "t3_5btg60", "score": "6", "subreddit": "childfree", "subreddit_id": "t5_2qtwb"}, {"author": "LordArkana", "body": "This is how I've seen it spelled by English speakers, so I assumed it was the correct way to say it! Unless you're kidding... are you? I'm not good with these things.", "created_utc": "1478364712.0", "edited": "False", "id": "d9n0k1o", "is_submitter": "False", "link_id": "t3_5b5986", "parent_id": "t1_d9mlay1", "score": "1", "subreddit": "IAmA", "subreddit_id": "t5_2qzb6"}, {"author": "LordArkana", "body": "As a Quebecer I am stupidly proud of this.", "created_utc": "1478289301.0", "edited": "False", "id": "d9lylln", "is_submitter": "False", "link_id": "t3_5b5986", "parent_id": "t1_d9lwps3", "score": "31", "subreddit": "IAmA", "subreddit_id": "t5_2qzb6"}, {"author": "LordArkana", "body": "I decided to take care of a few things that I've been meaning to do for a while: take driving lessons, do physio for my ankle injury (that I had for 4 years!), and work more to save up for college next year and not be stressed. All things I couldn't do if I had to shell every single penny for a child. I'm pretty damn indebted, but I know I can pay it all by working more next year!", "created_utc": "1478215468.0", "edited": "False", "id": "d9kq0jk", "is_submitter": "False", "link_id": "t3_5a4pkx", "parent_id": "t3_5a4pkx", "score": "2", "subreddit": "childfree", "subreddit_id": "t5_2qtwb"}, {"author": "LordArkana", "body": "I'm reading these stories here... like a bunch of you had horrifying experiences with these things but seemed to react relatively well and were able to deal with it. \nI see one of those fuckers even 10 meters from me, I scream my lungs out and run. If one were to run up me or touch me in anyway... I think my heart would just stop and that'd be the end of me. Arachnophobia, ho! ", "created_utc": "1478187404.0", "edited": "False", "id": "d9k2kd4", "is_submitter": "False", "link_id": "t3_5avpuf", "parent_id": "t3_5avpuf", "score": "1", "subreddit": "WTF", "subreddit_id": "t5_2qh61"}, {"author": "LordArkana", "body": "I haven't actually, but I was looking for new books to read, thanks for the idea!", "created_utc": "1477837628.0", "edited": "False", "id": "d9dy57l", "is_submitter": "False", "link_id": "t3_5a4jbv", "parent_id": "t1_d9dojhk", "score": "1", "subreddit": "childfree", "subreddit_id": "t5_2qtwb"}, {"author": "LordArkana", "body": "And that's why I never watch movies based on books (except Harry Potter, those were pretty good.) I love every single of Dan Brown's books; I own them all. I love how there seems to be a message in most of them. And Inferno was my favorite for this reason, the fact it adresses overpopulation, and a scientist actually finds a humane way of dealing with it, without killing anybody. When I read it years ago, I thought to myself, when I become a scientist, I want to do exactly the same thing. I want to create a mutagen that renders people infertile and solve the damn problem once and for all. Of course, it was too extreme an idea to share with anyone, which is why I'm glad I found this sub; I am not alone in thinking this. \nTo see the plot ruined like that... it infuriates me. I'm not a fan of movies for that reason. It always has to be about the american hero, even if it makes no sense.", "created_utc": "1477806442.0", "edited": "False", "id": "d9doczt", "is_submitter": "False", "link_id": "t3_5a4jbv", "parent_id": "t3_5a4jbv", "score": "18", "subreddit": "childfree", "subreddit_id": "t5_2qtwb"}, {"author": "LordArkana", "body": "It's supposed to come out tomorrow, isn't it? I will also be eagerly waiting!", "created_utc": "1477763445.0", "edited": "False", "id": "d9cyq4h", "is_submitter": "False", "link_id": "t3_5a1c6e", "parent_id": "t3_5a1c6e", "score": "1", "subreddit": "duolingo", "subreddit_id": "t5_2t6ze"}, {"author": "LordArkana", "body": "Hi people, I'm not part of the sub but I'm curious about something.\n\nForgive me if the question has been asked before, but I've looked and did not see it asked, so here goes.\n\nHas it ever happened that two people had the same waifu? If so, what happens? Is there some kind of rule, like whoever had her first has priority? \n\nThanks!", "created_utc": "1477703431.0", "edited": "False", "id": "d9c8hho", "is_submitter": "False", "link_id": "t3_4y96vj", "parent_id": "t3_4y96vj", "score": "2", "subreddit": "waifuism", "subreddit_id": "t5_32aef"}, {"author": "LordArkana", "body": "The Sims 3. This game isn't played to win. You play until you're tired of creating new sims and making work the same jobs and going through all your custom content; he'd get tired before me and I'd win by default!", "created_utc": "1477702762.0", "edited": "False", "id": "d9c82ny", "is_submitter": "False", "link_id": "t3_59u8yh", "parent_id": "t3_59u8yh", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "LordArkana", "body": "Dungeon Siege II. It was my first DS game, and everything in it was just perfect. It had something I had never seen before in other games: the ability to build your character's class by choosing the weapon you would use, and in Broken World, creating combos of classes that could use different weapons. When DS III came out, I bought it expecting the same, if not better, and I was pretty disappointed when I found out it was just another dungeon crawler.", "created_utc": "1477358221.0", "edited": "False", "id": "d96fnp0", "is_submitter": "False", "link_id": "t3_594kzl", "parent_id": "t3_594kzl", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "LordArkana", "body": "Trans guy here. I can tell you there's nothing worse than not being acknowledged for the gender you are, and I'm pretty sure this girl already had her fair share of insults and misgendering. If you like her for who she is, that's wonderful. You're not gay; she's a woman! Unfortunately, in the gay community, the transphobia seems even worse, from my own experience as well. Screw what other people think, in the end they are not living your life and they're onl contributing to that awful stereotype of ­the \"guy who accidentally kissed a tranny and everyone calls him gay\". You're better than that and so is she.", "created_utc": "1476635360.0", "edited": "False", "id": "d8ufvdx", "is_submitter": "False", "link_id": "t3_57pyis", "parent_id": "t3_57pyis", "score": "3", "subreddit": "offmychest", "subreddit_id": "t5_2ranw"}, {"author": "LordArkana", "body": "I'm sorry about your experience, dude. I have fucked up royally in much the same way as you because I worry way too much about what people can see me or hear me doing. I feel like, no matter what, I don't act like a normal human in social situations, and end up looking ike a fool, even though I'm sure most people couldn't give two craps about me. Even with my close group of friends, if I end up arriving late to a party and everyone is already talking, drinking, etc. I just don't know what to do with myself and I feel out of place. It sucks.", "created_utc": "1476631635.0", "edited": "False", "id": "d8udhtp", "is_submitter": "False", "link_id": "t3_57por7", "parent_id": "t3_57por7", "score": "3", "subreddit": "socialanxiety", "subreddit_id": "t5_2r22n"}, {"author": "LordArkana", "body": "Me gustan las palabras de legumbres como zanahorias, hongos, etc. porque es tan complicado, no como en ingles o frances!", "created_utc": "1475689245.0", "edited": "False", "id": "d8fa67r", "is_submitter": "False", "link_id": "t3_4km8z8", "parent_id": "t3_4km8z8", "score": "1", "subreddit": "DuoConverse", "subreddit_id": "t5_3db5s"}, {"author": "LordArkana", "body": "Bonjour! Je vais bien, je ne travaille pas de toute la semaine, seulement la fin de semaine. Je bois du thé et je regarde reddit. ", "created_utc": "1475689089.0", "edited": "False", "id": "d8fa1jt", "is_submitter": "False", "link_id": "t3_54h346", "parent_id": "t3_54h346", "score": "1", "subreddit": "DuoConverse", "subreddit_id": "t5_3db5s"}, {"author": "LordArkana", "body": "Your situations sounds similar to my SO's. He's been fixed at 21 because he knew he'd never have kids (and he's gay anyways), and he has an older brother who is autistic and pretty much spends his life in front of a computer, either playing or building a new one. Their mother would love grandkids (she even has a family daycare at home) but at least she understands it's not gonna happen due to her sons' situations. \n\nAs for me, both my parents wish to be grandparents through me. My dad's lucky, he had two kids before me and they both had their kids. My mom only has me and I'm also fixed and CF. :l While I do feel bad for her, at least she reassures me that it's fine, it's better not to have kids and be a grandmother than to raise kids in an environment where they are not wanted by their parents.\n\nI'm pretty safe in that department really.", "created_utc": "1475595211.0", "edited": "False", "id": "d8dmtfi", "is_submitter": "False", "link_id": "t3_55s6jj", "parent_id": "t3_55s6jj", "score": "3", "subreddit": "childfree", "subreddit_id": "t5_2qtwb"}, {"author": "LordArkana", "body": "I really don't like babies because all they ever do is cry. That is all they can do to communicate - and smile and coo occasionally, sure. Children... they can actually speak. Sometimes they just choose not to. But toddlers... toddlers are evil incarnate! This meme describes it perfectly. Take the worst out of baby and teenager and put it into one wailing monster.\nNope.", "created_utc": "1475593795.0", "edited": "False", "id": "d8dlq4x", "is_submitter": "False", "link_id": "t3_55rv8f", "parent_id": "t3_55rv8f", "score": "14", "subreddit": "childfree", "subreddit_id": "t5_2qtwb"}, {"author": "LordArkana", "body": "Sounds like you would be living the absolute dream. Sims life would be perfect for me as well; I'd love a cheat code that gives me 50k, allows me to build a house anywhere, anyway I want, and live in it with my trillion cats and snakes. I'd have a room for gaming and one for a home gym. Ain't no kids gonna ruin that for me.", "created_utc": "1475330715.0", "edited": "False", "id": "d89k2ix", "is_submitter": "False", "link_id": "t3_55cn92", "parent_id": "t3_55cn92", "score": "2", "subreddit": "childfree", "subreddit_id": "t5_2qtwb"}, {"author": "LordArkana", "body": "Haha no, I'm afraid the tiny hands are all we have in common. I don't have that sun kissed orange skin, blond beach dream hair, and the magnificent ideas of the man. ^thankfully", "created_utc": "1475330463.0", "edited": "False", "id": "d89jy86", "is_submitter": "False", "link_id": "t3_557izo", "parent_id": "t1_d88ta1c", "score": "3", "subreddit": "childfree", "subreddit_id": "t5_2qtwb"}, {"author": "LordArkana", "body": "I want to give your mother the best high five my tiny hands can produce.", "created_utc": "1475262409.0", "edited": "False", "id": "d88nyb9", "is_submitter": "False", "link_id": "t3_557izo", "parent_id": "t3_557izo", "score": "2", "subreddit": "childfree", "subreddit_id": "t5_2qtwb"}, {"author": "LordArkana", "body": "I knew I would cry, and I read it anyway. Godamnit.\nThat was a beautiful story and I'm glad Chandler went the way he did, peacefully and loved.", "created_utc": "1475083758.0", "edited": "False", "id": "d85r41g", "is_submitter": "False", "link_id": "t3_54txlm", "parent_id": "t3_54txlm", "score": "3", "subreddit": "childfree", "subreddit_id": "t5_2qtwb"}, {"author": "LordArkana", "body": "Shit, I'm sorry. I hate living in apartments for this reason: crap neighbors who only think about themselves. Did you talk to the landlord about it? Maybe even get child protective services, it sounds like a bad situation for them as well and it could fix the problem in the long run.", "created_utc": "1474561609.0", "edited": "False", "id": "d7xmhvy", "is_submitter": "False", "link_id": "t3_53c637", "parent_id": "t1_d7wm3ow", "score": "1", "subreddit": "childfree", "subreddit_id": "t5_2qtwb"}, {"author": "LordArkana", "body": "Haha oh man, i will totally do that if someone tells me I'll change my mind. Wanna bet? I won't tell them I'm pretty much sterile, that'll ruin the fun. Woops.", "created_utc": "1474305623.0", "edited": "False", "id": "d7tdmfa", "is_submitter": "False", "link_id": "t3_53hmpy", "parent_id": "t3_53hmpy", "score": "6", "subreddit": "childfree", "subreddit_id": "t5_2qtwb"}, {"author": "LordArkana", "body": "True. I have a friend who has many issues, and one of her main reasons to live is actually getting to play video games she hasn't yet had the chance to play. If she dies, she might miss on amazing games to be released in the future, and leave behind the ones she hasn't finished. It seems meaningless and stupid to some people, but if it helps her get through her days, is it really stupid?", "created_utc": "1473911552.0", "edited": "False", "id": "d7neeg4", "is_submitter": "False", "link_id": "t3_52stb7", "parent_id": "t1_d7na6ag", "score": "57", "subreddit": "childfree", "subreddit_id": "t5_2qtwb"}, {"author": "LordArkana", "body": "I had the exact same thoughts. I have one pregnant friend currently, and several mothers... nooooot a good idea.", "created_utc": "1473786891.0", "edited": "False", "id": "d7l8176", "is_submitter": "False", "link_id": "t3_52kars", "parent_id": "t1_d7l60uv", "score": "7", "subreddit": "childfree", "subreddit_id": "t5_2qtwb"}, {"author": "LordArkana", "body": "Je suis de Montréal, mais je réside présentement à Longueuil. ", "created_utc": "1473461904.0", "edited": "False", "id": "d7gapcw", "is_submitter": "False", "link_id": "t3_518gpc", "parent_id": "t1_d7g6thc", "score": "1", "subreddit": "childfree", "subreddit_id": "t5_2qtwb"}, {"author": "LordArkana", "body": "Well for what it's worth, you seem like a really interesting person, and I happen to be transgender as well - just focusing on my life, hobbies, it's not a huge part of my life. It used to be when I started, but I'm pretty far in my transition and I don't want to make it a big deal. If you want we could talk here for a while and see if things work, I'd love a new friend :)", "created_utc": "1473433092.0", "edited": "False", "id": "d7fp055", "is_submitter": "False", "link_id": "t3_51tscv", "parent_id": "t3_51tscv", "score": "3", "subreddit": "montreal", "subreddit_id": "t5_2qnmr"}, {"author": "LordArkana", "body": "IMA FIRIN MAH LAZOR", "created_utc": "1473432204.0", "edited": "False", "id": "d7foc6w", "is_submitter": "False", "link_id": "t3_51uy2d", "parent_id": "t3_51uy2d", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "LordArkana", "body": "Hi there, 25 year old male, from Quebec as well! I didn't expect to find other French Canadians around here. Where in Quebec are you?", "created_utc": "1473431694.0", "edited": "False", "id": "d7fnyl3", "is_submitter": "False", "link_id": "t3_518gpc", "parent_id": "t1_d7a7c79", "score": "3", "subreddit": "childfree", "subreddit_id": "t5_2qtwb"}, {"author": "LordArkana", "body": "Holy shit, I'm sorry this happened to you and your mom. My mother has fibromyalgia as well, and it's not a visible illness. She walks with a cane, so at least people can tell she's not perfectly healthy and able to stand, but I guess your mother doesn't and that's why people were judging her... it makes me so fucking mad when people assume one is healthy because they don't 'look sick'. Congrats to your sister for what she did, I also have social anxiety and if someone were to do the same thing to my mom, I don't know if I'd be able to reply, but I know my mom has plenty of rhetoric in case someone pisses her off!", "created_utc": "1473431445.0", "edited": "False", "id": "d7fns5r", "is_submitter": "False", "link_id": "t3_51xmfw", "parent_id": "t3_51xmfw", "score": "12", "subreddit": "childfree", "subreddit_id": "t5_2qtwb"}, {"author": "LordArkana", "body": "Thanks for your concern. Maybe I sounded a bit dramatic in there, but most of the time I got my shit together. I'm dealing with different issues and social anxiety on top of that, which I have consulted for, and it helped. I don't feel any fulfillment from my job but for the salary I have, I know I will not get better unless I get a degree. I'm at least 2 years away from getting one. I might think about seeing my therapist again...", "created_utc": "1472926383.0", "edited": "False", "id": "d787y1f", "is_submitter": "True", "link_id": "t3_50zu95", "parent_id": "t1_d787q1c", "score": "31", "subreddit": "childfree", "subreddit_id": "t5_2qtwb"}, {"author": "LordArkana", "body": "Hey, I needed to hear this. I bought an ergometer/rowing machine a month ago and I'm still unsure wether or not I'm doing it right, because I don't feel my muscles working all that much. Cardio does, though. I just keep going, and I think my resting heart rate has diminished, which is wonderful!", "created_utc": "1472743706.0", "edited": "False", "id": "d75hfg5", "is_submitter": "False", "link_id": "t3_50jmph", "parent_id": "t3_50jmph", "score": "1", "subreddit": "LifeProTips", "subreddit_id": "t5_2s5oq"}, {"author": "LordArkana", "body": "Scratching my ass/any sensitive part that REALLY needs scratching. I'm itchy now, it cannot wait!\n\nOh, and wearing outfits from another era or looking like a fictional character without having one's sanity questioned.\n\nScratching my ass while wearing a wizard outfit would be an utopia.", "created_utc": "1472742628.0", "edited": "False", "id": "d75gldf", "is_submitter": "False", "link_id": "t3_50mc89", "parent_id": "t3_50mc89", "score": "2", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "LordArkana", "body": "Yes, and in front of your SO's parents, just to make it better!", "created_utc": "1472653674.0", "edited": "False", "id": "d740en3", "is_submitter": "False", "link_id": "t3_5077cb", "parent_id": "t1_d72wmh6", "score": "2", "subreddit": "childfree", "subreddit_id": "t5_2qtwb"}, {"author": "LordArkana", "body": "I can slowly build up my BDSM collection. And eventually, a dungeon.  ( ͡° ͜ʖ ͡° )  Try to explain all the accessories to a curious child... or wake up one day to find them wearing a latex suit and handcuffs...among other horrific scenarios.", "created_utc": "1472580420.0", "edited": "False", "id": "d72w52v", "is_submitter": "False", "link_id": "t3_5077cb", "parent_id": "t3_5077cb", "score": "2", "subreddit": "childfree", "subreddit_id": "t5_2qtwb"}, {"author": "LordArkana", "body": "I'm a native French speaker (don't mind the flair, I don't know how to add that to Duolingo, so I'm doing all the tests I can to skip through...) and I'd love to help!", "created_utc": "1472578219.0", "edited": "False", "id": "d72uenq", "is_submitter": "False", "link_id": "t3_4zhau4", "parent_id": "t3_4zhau4", "score": "1", "subreddit": "duolingo", "subreddit_id": "t5_2t6ze"}, {"author": "LordArkana", "body": "Reproduce.", "created_utc": "1472428846.0", "edited": "False", "id": "d70kk25", "is_submitter": "False", "link_id": "t3_501qfp", "parent_id": "t3_501qfp", "score": "0", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "LordArkana", "body": "Someone said Donald Trump already, so I'm gonna go with Ted Cruz. That level of awkwardness cannot be human.", "created_utc": "1472428712.0", "edited": "False", "id": "d70kh03", "is_submitter": "False", "link_id": "t3_500w5z", "parent_id": "t3_500w5z", "score": "2", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "LordArkana", "body": "I once went to Chinatown with some friends. They decided not to pay for their bubble teas, and the lounge is so damn busy they don't even know if you paid or not. We just left. One waiter asked us if we paid as we left, and we just all said yes with assurance. He let us go.", "created_utc": "1472428351.0", "edited": "False", "id": "d70k8vn", "is_submitter": "False", "link_id": "t3_501p1a", "parent_id": "t3_501p1a", "score": "2", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "LordArkana", "body": "One night only. But there was only one season at the time...", "created_utc": "1472428130.0", "edited": "False", "id": "d70k3st", "is_submitter": "False", "link_id": "t3_4zzt61", "parent_id": "t3_4zzt61", "score": "0", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "LordArkana", "body": "I get drunk with wine or porto, play GTA and go fucking apeshit. I drive like total shit and wreck cars, run people over, destroy streetlights, etc.\n\nFun fact: I'm currently taking driving lessons.", "created_utc": "1472428038.0", "edited": "False", "id": "d70k1ru", "is_submitter": "False", "link_id": "t3_4zzvib", "parent_id": "t3_4zzvib", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "LordArkana", "body": "\"Why did my pet stop moving\"", "created_utc": "1472427948.0", "edited": "False", "id": "d70jzoa", "is_submitter": "False", "link_id": "t3_4zzxjz", "parent_id": "t3_4zzxjz", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "LordArkana", "body": "I'd have about three fiddy. Can't buy freedom with three fiddy!", "created_utc": "1472427748.0", "edited": "False", "id": "d70juvf", "is_submitter": "False", "link_id": "t3_4zzwdh", "parent_id": "t3_4zzwdh", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "LordArkana", "body": "He came out, eh? Is he available?( ͡° ͜ʖ ͡°)", "created_utc": "1472341752.0", "edited": "False", "id": "d6zdai9", "is_submitter": "False", "link_id": "t3_4zs222", "parent_id": "t1_d6yd5i9", "score": "2", "subreddit": "childfree", "subreddit_id": "t5_2qtwb"}, {"author": "LordArkana", "body": "I agree, actually. Many of my friends are under 25 and having kids, and one in particular really surprised me. She's already married (to be fair, her and her SO have been together at least 5 years) and now she's pregnant... and it was planned... but she's in university, what is she gonna do? Drop out? She has so much talent... I'm confused and sad.", "created_utc": "1472341351.0", "edited": "False", "id": "d6zd23f", "is_submitter": "False", "link_id": "t3_4zv83i", "parent_id": "t3_4zv83i", "score": "3", "subreddit": "childfree", "subreddit_id": "t5_2qtwb"}, {"author": "LordArkana", "body": "`-tips fedora-", "created_utc": "1472235279.0", "edited": "False", "id": "d6xtem7", "is_submitter": "False", "link_id": "t3_4znt6r", "parent_id": "t1_d6xsipz", "score": "17", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "LordArkana", "body": "It's strange, because I was never really exposed to kids. I'm my mother's only child, and I have two much older half siblings; I only saw my nephew when he was a baby briefly, then we kinda lost contact as he grew up, and now he's 18 and we are like brothers. \n\nBut that's the thing: my brother, my nephew's father, is a terrible dad. He never took care of his son, left him with his mother, and kept sleeping around with other women. So my nephew's mother had to raise him alone, and she did a mighty fine job; but my brother went and had another kid with another woman... and he recently tried to contact my nephew's mother to.. watch this... get his birth certificate to prove he was old enough so he wouldn't pay child support anymore. That's it. \n\nWhen I see this kind of crap, it makes me realize just how many kids are unwanted and have terrible parents, and I don't want to contribute to this. I'm just glad my nephew has an awesome mother who truly loves him.", "created_utc": "1472231923.0", "edited": "False", "id": "d6xqso3", "is_submitter": "False", "link_id": "t3_4zp2kp", "parent_id": "t3_4zp2kp", "score": "8", "subreddit": "childfree", "subreddit_id": "t5_2qtwb"}, {"author": "LordArkana", "body": "Thanks a lot for the kind words, and for the encouragement. The worst will be to find a decent place to live as I'm quite picky, and actually making the move... without him, and I know he's gonna do everything in his power to make me feel guilty, saying I'll put him in the streets, that I'm an horrible person, that he'll kill himself, etc. I've heard it all. I don't want that to happen to him, but he's incredibly bad at trying to get better. If things don't go his way the first time, he gives up and blames everyone else but himself. I don't want to be doing the work for him, but I don't want him stuck either. I just want to leave. I'll try to figure things out, I have several months to do so.", "created_utc": "1471900283.0", "edited": "False", "id": "d6sdrkd", "is_submitter": "True", "link_id": "t3_4yw3av", "parent_id": "t1_d6rf9yi", "score": "1", "subreddit": "offmychest", "subreddit_id": "t5_2ranw"}, {"author": "LordArkana", "body": "The post was maddening enough. But the I read the comments. \nAs an absolute cat lover, I know I will always have cats in my life, and even if some of them are little shits, I will always love and take care of them. I have heard many stories of parents giving away or abadoning pets because their new baby is allergic, or other reasons - but that one was most popular. And it makes me so angry! The cat, dog, whatever was there FIRST. They trust you to take care of them, then you bring a kid in the picture... and the pet must go? That's just wrong!", "created_utc": "1471662847.0", "edited": "False", "id": "d6oytaz", "is_submitter": "False", "link_id": "t3_4yla6c", "parent_id": "t3_4yla6c", "score": "3", "subreddit": "childfree", "subreddit_id": "t5_2qtwb"}, {"author": "LordArkana", "body": "Goddamn people are entitled jerks. Sorry this happened to you. If you want, there are some childfree dating sites, I've seen people post the link somewhere...", "created_utc": "1471543008.0", "edited": "False", "id": "d6mwbdl", "is_submitter": "False", "link_id": "t3_4ydnjf", "parent_id": "t3_4ydnjf", "score": "11", "subreddit": "childfree", "subreddit_id": "t5_2qtwb"}, {"author": "LordArkana", "body": "\"Here, let me leave my kids loose to hurt and annoy your dog and destroy everything in the vicinity, because my crotch product is more important than your dog's wellbeing. And they're KIDS! They can't possibly hurt ANYONE! Unless I decide they did.\"\n\nSudden uncontrollable rage rising...", "created_utc": "1471542502.0", "edited": "False", "id": "d6mvvse", "is_submitter": "False", "link_id": "t3_4ydjnk", "parent_id": "t3_4ydjnk", "score": "41", "subreddit": "childfree", "subreddit_id": "t5_2qtwb"}, {"author": "LordArkana", "body": "Damn, I never thought of that. Whenever I go to a restaurant I take whichever table they offer me, even if it's next to kids. I'll ask next time!", "created_utc": "1471235915.0", "edited": "False", "id": "d6hxzal", "is_submitter": "True", "link_id": "t3_4xowsq", "parent_id": "t1_d6hdhih", "score": "2", "subreddit": "childfree", "subreddit_id": "t5_2qtwb"}, {"author": "LordArkana", "body": "Oh heck, I'm the exact same way. If I find a good spot before the subway arrives, and a stroller stops next to me, I will actually move away to get to the next wagon. I kinda feel like a dick for doing it but my sanity is more important. And sometimes you just can't avoid them, like when they get on the same wagon as you when you're already inside...", "created_utc": "1471198879.0", "edited": "False", "id": "d6hb9he", "is_submitter": "True", "link_id": "t3_4xowsq", "parent_id": "t1_d6hb09j", "score": "13", "subreddit": "childfree", "subreddit_id": "t5_2qtwb"}, {"author": "LordArkana", "body": "I find myself thinking exactly the same thing. It is baffling that people keep breeding when they could spend that extra time, energy ad money on genuinely useful, fun things... why?!", "created_utc": "1471194836.0", "edited": "False", "id": "d6h8l7y", "is_submitter": "False", "link_id": "t3_4xoek9", "parent_id": "t1_d6h442o", "score": "1", "subreddit": "childfree", "subreddit_id": "t5_2qtwb"}, {"author": "LordArkana", "body": "I just cannot believe healthcare professionnals who push the baby narrative on people. I'm sorry that happened. And welcome to the sub!", "created_utc": "1471016551.0", "edited": "False", "id": "d6enk9c", "is_submitter": "False", "link_id": "t3_4xe0sk", "parent_id": "t3_4xe0sk", "score": "56", "subreddit": "childfree", "subreddit_id": "t5_2qtwb"}, {"author": "LordArkana", "body": "I just want to say, there are many ways to be transgender. Simply not identifying 100% as the sex assigned at birth alreadu qualifies you, and it's possible to be bigender, genderqueer, agender, etc. it's not just from male to female or female to male. I know many people who are non binary or a little of both. What's important is being comfortable with your own identity.\n\nI made it clear to my parents that I didn't want kids, and even though they pushed a little at first, they eventually stopped and respect my decisions. Also, I transitioned very early: I was 16. As a young man, I don't ever, or very rarely, get asked questions about wether or not I want kids.", "created_utc": "1471015701.0", "edited": "False", "id": "d6emw9i", "is_submitter": "False", "link_id": "t3_4x8po8", "parent_id": "t1_d6dmrbs", "score": "1", "subreddit": "childfree", "subreddit_id": "t5_2qtwb"}, {"author": "LordArkana", "body": "I think my bladder remained the same, but it's hard to say because I'm an avid tea drinker, and tea is a diuretic; before the hysto, I went to the bathroom a lot because of my tea cosumption. 8 years after the hysto, I still go a lot... because I still drink tea like a madman. But I think that's normal. On days when I don't drink too much, I don't go that often. I had never heard of problems with the bladder from other transmen either, as far as I know.", "created_utc": "1471015520.0", "edited": "False", "id": "d6emra0", "is_submitter": "False", "link_id": "t3_4x8po8", "parent_id": "t1_d6e0np5", "score": "1", "subreddit": "childfree", "subreddit_id": "t5_2qtwb"}, {"author": "LordArkana", "body": "The decision was super easy for me. FIrst of all, I'm a transgender man who has had hysterectomy, hormones, everything; I am completely sterile. And couldn't be happier about it. Even before I went through with the procedures, I knew I still wouldn't have kids,because of an obvious reason: money. I grew up alone with my mother, and we were poor, very poor. She has been a great mother and everything she did, she did for me, going as far as sacrificing food-sleep-time- etc. just so I'd have what I need. And I don't want to give thatlife to someone else. Like it or not, money is needed to have a child. And I'd like my hard earned money to go towards my dreams, desires, helping my mother, not some... not yet born clump of cells. It seemed like a waste to me.", "created_utc": "1470935029.0", "edited": "False", "id": "d6dg6hj", "is_submitter": "False", "link_id": "t3_4x8po8", "parent_id": "t3_4x8po8", "score": "8", "subreddit": "childfree", "subreddit_id": "t5_2qtwb"}, {"author": "LordArkana", "body": "Well that's the thing, I know these places exist, but they all have one thing in common: they are dreadfully expensive. I'm a student drowning in debt who can barely pay his bills. So if I can, for once, treat myself to a slightly better venue than Burger King, I'd like it to be quiet. I will definitely go to the Casino one day, though.", "created_utc": "1470848928.0", "edited": "False", "id": "d6c14f8", "is_submitter": "True", "link_id": "t3_4x2wnc", "parent_id": "t1_d6bz2ht", "score": "5", "subreddit": "childfree", "subreddit_id": "t5_2qtwb"}, {"author": "LordArkana", "body": "Eh, no. I actually only eat poultry and fish-seafood, but that's personal taste. I realized I went far over the boundaries with my comment after the distasteful replies I have had, so I shall from now on enjoy greentexts in silence.", "created_utc": "1470076311.0", "edited": "False", "id": "d5zx7wo", "is_submitter": "False", "link_id": "t3_4qgngr", "parent_id": "t1_d5ntpny", "score": "1", "subreddit": "greentext", "subreddit_id": "t5_2srr9"}, {"author": "LordArkana", "body": "Je viens de déménager à Longueuil pour des raisons financières, mais je travaille et vais à l'école à Montréal, et j'ai 25 ans. Je perds bientôt mon privilège étudiant à cause de mon âge pour la carte OPUS. À quand une réforme de ce système?! On ne devient pas riche à 25 ans quand on est encore étudiant!", "created_utc": "1469207309.0", "edited": "False", "id": "d5mkahn", "is_submitter": "False", "link_id": "t3_4u22m8", "parent_id": "t3_4u22m8", "score": "2", "subreddit": "montreal", "subreddit_id": "t5_2qnmr"}, {"author": "LordArkana", "body": "Well there goes my reason to live", "created_utc": "1469206155.0", "edited": "False", "id": "d5mjdjz", "is_submitter": "False", "link_id": "t3_4u1a9e", "parent_id": "t3_4u1a9e", "score": "1", "subreddit": "worldnews", "subreddit_id": "t5_2qh13"}, {"author": "LordArkana", "body": "Holy fuck, if there's one greentext in the world I'm hoping is fake, it certainly is this one. I cannot stand animal abuse, especially if it results in death of an innocent animal.", "created_utc": "1467243487.0", "edited": "False", "id": "d4takuv", "is_submitter": "False", "link_id": "t3_4qgngr", "parent_id": "t3_4qgngr", "score": "6", "subreddit": "greentext", "subreddit_id": "t5_2srr9"}, {"author": "LordArkana", "body": "Checking my bank account and not finding a few million dollars.", "created_utc": "1465574687.0", "edited": "False", "id": "d43rshk", "is_submitter": "False", "link_id": "t3_4nf0cp", "parent_id": "t3_4nf0cp", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "LordArkana", "body": "Hail Hydra.", "created_utc": "1465574436.0", "edited": "False", "id": "d43rly5", "is_submitter": "False", "link_id": "t3_4ngaj7", "parent_id": "t3_4ngaj7", "score": "3", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "LordArkana", "body": "Not really cringey, kinda... I'm naive as fuck and I paid the price. I just started a new job at an hospital, working night shift. This happened about two weeks after I started. Since it's a hospital, anybody can just walk in at any time, be it 3 PM or 3 AM. I work in an upstairs area where non-employees aren't supposed to go in, but at around 2 AM some guy came upstairs and started walking around, looking lost. He had a backpack on his shoulder. Thinking he was an employee here to fix the machines or something (I am VERY naive) I said hi to him, shyly. He didn't reply and kept walking, until my boss asked, \"Can I help you?\" only then did the guy stutter he was looking for the emergency room. My boss directed him to the ER, and the guy left promptly. When morning came, I went to get my backpack, which I left at the entrance of the stairs, like I always do (terrible fucking idea by the way). I looked and looked and it was not there. I thought another employee might have left with it. It's only when I left work, that I realized, that dude with the backpack on his shoulder... it was MY backpack. None of my colleagues knew because I hadn't been there that long. I didn't know because I didn't see it well enough. So that guy left with my backpack, containing 300$ in cash that was NOT mine, my nintendo 3DS with 3 other game cartdriges, my sony mp3 player and sony headphones, and the most recent Game of Thrones book I had just started reading and actually pre-ordered a year before. I cried like a little bitch.\n\nThankfully, I made enough money at this job to buy back everything I lost and repay my friend, but I felt like a complete piece of shit. Needless to say I never left my backpack at the stairs anymore.", "created_utc": "1465574211.0", "edited": "False", "id": "d43rg4z", "is_submitter": "False", "link_id": "t3_4nf3my", "parent_id": "t3_4nf3my", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "LordArkana", "body": "I'm from Montreal, Quebec, and we are so culturally diverse here, I've honestly never met anyone who made fun of somebody for not speaking French. As long as you're trying, you're usually welcome. Then again, we do have this weird complex with our language, as English is gaining ground more and more. It's a difficult situation.", "created_utc": "1464756834.0", "edited": "False", "id": "d3rdh82", "is_submitter": "False", "link_id": "t3_4imijb", "parent_id": "t1_d2zi99v", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "LordArkana", "body": "Right now, I'm paying two rents at once because I can't move out from my current apartment yet and the other had to be taken now. I just gave my check to the landlord after paying my other rent and I don't even have half the money required for the rent. If he cashes in before thursday, I'm doomed. Plus all the credit card debt that I obviously cannot pay...", "created_utc": "1462235010.0", "edited": "False", "id": "d2qdrlc", "is_submitter": "False", "link_id": "t3_4hjbhg", "parent_id": "t3_4hjbhg", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "LordArkana", "body": "I adore Huiming. It's so soft, so delicate, and I tend to oversteep so it's never too bitter for me, even though I love bitter teas as well. I need to explore more green teas, though.", "created_utc": "1461534030.0", "edited": "False", "id": "d2fsjnf", "is_submitter": "False", "link_id": "t3_4g8var", "parent_id": "t3_4g8var", "score": "2", "subreddit": "tea", "subreddit_id": "t5_2qq5e"}, {"author": "LordArkana", "body": "I love BDSM. Mostly bondage, though, not that much into pain. I used to play with my dad as a kid, pretending to be kidnapped (it was innocent I swear!) and I enjoyed pretending to be tied up. Discovered much, much later why I enjoyed it so much and that I wasn't a freak. (I think.)", "created_utc": "1461533768.0", "edited": "False", "id": "d2fsddp", "is_submitter": "False", "link_id": "t3_4g7x97", "parent_id": "t3_4g7x97", "score": "3", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "LordArkana", "body": "He looks so plain and boring, I spent more time trying to figure out what was written in the top left corner than trying to roast him.", "created_utc": "1461000511.0", "edited": "False", "id": "d27qt4h", "is_submitter": "False", "link_id": "t3_4fcn9e", "parent_id": "t3_4fcn9e", "score": "7", "subreddit": "RoastMe", "subreddit_id": "t5_37xo2"}, {"author": "LordArkana", "body": "You look like the stage 2 of How to make a neckbeard.", "created_utc": "1460337945.0", "edited": "False", "id": "d1xxzmd", "is_submitter": "False", "link_id": "t3_4e5c7g", "parent_id": "t3_4e5c7g", "score": "2", "subreddit": "RoastMe", "subreddit_id": "t5_37xo2"}, {"author": "LordArkana", "body": "I'm sure you're growing your beard this long so you can hide tiny vodka bottles in it.", "created_utc": "1460337671.0", "edited": "False", "id": "d1xxtfb", "is_submitter": "False", "link_id": "t3_4e54l0", "parent_id": "t3_4e54l0", "score": "1", "subreddit": "RoastMe", "subreddit_id": "t5_37xo2"}, {"author": "LordArkana", "body": "Thank you! I had the first part, but I didn't know the adjective for wet.\nHere are a few more phrases I tried writing:\nΔεν μπορώ άλλο να περιμένω που τελειώσει το χείμονα! - I can't wait anymore for winter to end!\n\nΔεν μας μένει πολύς καιρός πριν το τέλος  τους περιόδους στο σχολείο. - There isn't much time left until the end of the semester of school.\n\nΝομίζω οτί τελικά βρήκα αυτό που θέλω να κάνω για να δουλέψω. - I think I finally found what I want to do as a job.\n\nΚάνω ό,τι να μπορώ για να σπουδάσω πολύ, μην δώσω της εργασίες μου αργά, και δώσω καλή ποιότητα εργασίες. - I'm doing everything I can to study a lot, not give assignments late, and give exercices of good quality.", "created_utc": "1460243614.0", "edited": "1460244411.0", "id": "d1wo7b9", "is_submitter": "True", "link_id": "t3_4dstln", "parent_id": "t1_d1u0dm0", "score": "1", "subreddit": "GREEK", "subreddit_id": "t5_2qpo8"}, {"author": "LordArkana", "body": "Well that's wonderful. As someone who drinks the equivalent of 5-6 cups a day of tea, I'm not sure how I should feel - and by cup, I mean a 6 inch tall cup.", "created_utc": "1459614773.0", "edited": "False", "id": "d1n3dsq", "is_submitter": "False", "link_id": "t3_4d1x1d", "parent_id": "t3_4d1x1d", "score": "9", "subreddit": "tea", "subreddit_id": "t5_2qq5e"}, {"author": "LordArkana", "body": "Hi! This is great, think you can add modern Greek to it?", "created_utc": "1458082570.0", "edited": "False", "id": "d118cl2", "is_submitter": "False", "link_id": "t3_4aipls", "parent_id": "t1_d10ogrm", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "LordArkana", "body": "I don't know, maybe the healthcare workers are, but the office and hygiene people are lovely - those I work with, anyways. It's like we understand each other, so we're being extra nice to compensate. As for me, well, the job pays -super- well for a student. It's nearly 19$ an hour, and even with all the crap the government takes off our paycheck, it's pretty good money. The job itself is easy, I'm good at it, and since I have social anxiety, it helps that I don't have to talk to anyone, just deal with my papers. It'd be extremely difficult to find another job in Montreal that pays as well as this one and where I don't have to talk to strangers. I'll stick around as long as they'll keep me, or until I finish my degree, which is years from now.", "created_utc": "1452905130.0", "edited": "False", "id": "cyzw452", "is_submitter": "False", "link_id": "t3_40xwmf", "parent_id": "t1_cyyfced", "score": "2", "subreddit": "montreal", "subreddit_id": "t5_2qnmr"}, {"author": "LordArkana", "body": "I'm not surprised. And I highly doubt they're exaggerating. I actually work for the CHUM, at Notre-Dame hospital, and it's fucking ridiculous. We have to call to announce our arrival and departures when there are no bosses present (evening, night and weekend shifts); if we forget to call or arrive even a minute or two late, our pay will be adjusted based on when we actually called. Yes, even for a minute; they'll take it off your paycheck. For vacations, if you took one week, they can move your off days according to when they want you to work, by example making you work the weekend of your vacation week but giving you monday and friday of another week off. Ah, and what else.. our equipment is extremely outdated and I think we have scanners laying around that have stopped working for years; every single week, there's a new problem with the computers. There's more, too, that's just for my department. Oh yes, we also aren't allowed to boil water for tea or coffee during work hours. It's an office job. ", "created_utc": "1452804389.0", "edited": "False", "id": "cyycnc1", "is_submitter": "False", "link_id": "t3_40xwmf", "parent_id": "t3_40xwmf", "score": "8", "subreddit": "montreal", "subreddit_id": "t5_2qnmr"}, {"author": "LordArkana", "body": "Ah yes, the m'eat should help nurse him back to health, in the m'anliest of ways!", "created_utc": "1452135477.0", "edited": "False", "id": "cyow1ow", "is_submitter": "False", "link_id": "t3_3zimiy", "parent_id": "t3_3zimiy", "score": "4", "subreddit": "neckbeardstories", "subreddit_id": "t5_2waxs"}, {"author": "LordArkana", "body": "And here I was looking at the window, thinking I had seen someone mooning. Nope.", "created_utc": "1446745686.0", "edited": "False", "id": "cwply75", "is_submitter": "False", "link_id": "t3_3rmdgb", "parent_id": "t3_3rmdgb", "score": "1", "subreddit": "montreal", "subreddit_id": "t5_2qnmr"}, {"author": "LordArkana", "body": "It's funny though, my mom had me at 36 and my dad, 48. They were old to have a kid. Yet here I am, free of any defects... except mild social anxiety. I've been lucky, I'd be worried as heck if I were to have a kid past 35.", "created_utc": "1444059641.0", "edited": "False", "id": "cvozpxl", "is_submitter": "False", "link_id": "t3_3nkl38", "parent_id": "t1_cvoy1tq", "score": "1", "subreddit": "todayilearned", "subreddit_id": "t5_2qqjc"}, {"author": "LordArkana", "body": "Holy shit, I was like that too as a child! I'm so glad I'm not alone! I used to pretend to be kidnapped by somebody and my dad had to rescue me, and I enjoyed pretending to be tied up. As I grew older, I finally realized why I enjoyed it so much...", "created_utc": "1435872841.0", "edited": "False", "id": "csqbsf1", "is_submitter": "False", "link_id": "t3_3bvq4w", "parent_id": "t1_csq4mmz", "score": "8", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "LordArkana", "body": "Hey, gay trans man here. I suppose it's as common as it is for cis males, although I have personally noticed many trans women tend to be lesbians; I have rarely met a straight trans woman... might be just my personal knowledge though.\n\nThing is, recently I've come to accept I might not be a hundred percent gay. Why I do love all men, including trans, a very, very small amount of women may be attractive to me. In my whole life, I've liked 3 girls as opposed to many guys. I can't really say I'm bi though; I'm extremely selective when it comes to girls, I don't even know what I like myself! It just happens.", "created_utc": "1435341572.0", "edited": "False", "id": "csjnc0v", "is_submitter": "False", "link_id": "t3_3b7fls", "parent_id": "t3_3b7fls", "score": "2", "subreddit": "ftm", "subreddit_id": "t5_2t9mw"}, {"author": "LordArkana", "body": "I once was sitting on my bed, when I was 7, doing nothing. Then suddenly, I started flying around my room with my arms wide open, Peter Pan style, around the ceiling fan. I was so happy I tried to escape my room and go fly outside.\nI have trouble dismissing this as a dream, because I don't remember waking up from this. At all.", "created_utc": "1434639890.0", "edited": "False", "id": "csaqwc9", "is_submitter": "False", "link_id": "t3_3aa615", "parent_id": "t3_3aa615", "score": "5", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "LordArkana", "body": "That explains why I can only get high when I drink alcohol. Wow.", "created_utc": "1432775671.0", "edited": "False", "id": "crn5iap", "is_submitter": "False", "link_id": "t3_37h0a1", "parent_id": "t3_37h0a1", "score": "1", "subreddit": "science", "subreddit_id": "t5_mouw"}, {"author": "LordArkana", "body": "You mean the funeral they held in honor of House? Well, considering House had run into Cuddy's house with a car, I think it's safe to assume it was the last straw for her, and decided to leave House completely out of her life for good - and that would include not going to his funeral.", "created_utc": "1432616313.0", "edited": "False", "id": "crl1ny9", "is_submitter": "False", "link_id": "t3_37ajc9", "parent_id": "t3_37ajc9", "score": "1", "subreddit": "HouseMD", "subreddit_id": "t5_2rc0x"}, {"author": "LordArkana", "body": "It's thermodynamics, and also kinetics, rate of reactions, that sort of stuff.", "created_utc": "1432604385.0", "edited": "False", "id": "crkvez5", "is_submitter": "True", "link_id": "t3_373pop", "parent_id": "t1_crjhneu", "score": "2", "subreddit": "chemistry", "subreddit_id": "t5_2qhf9"}, {"author": "LordArkana", "body": "How much water did you put?\nI tend to add almost as much water as I put into a regular cup of tea (and my cups are freaking huge) so all the foam disappears. I just feel like I'm wasting my matcha if I only put enough water for 3 sips...", "created_utc": "1430501717.0", "edited": "False", "id": "cqv7j33", "is_submitter": "False", "link_id": "t3_34itbn", "parent_id": "t3_34itbn", "score": "2", "subreddit": "tea", "subreddit_id": "t5_2qq5e"}, {"author": "LordArkana", "body": "I fucking hate my country these days.", "created_utc": "1426606646.0", "edited": "False", "id": "cphqeub", "is_submitter": "False", "link_id": "t3_2zbceb", "parent_id": "t3_2zbceb", "score": "0", "subreddit": "worldnews", "subreddit_id": "t5_2qh13"}, {"author": "LordArkana", "body": "You never said in which language. I could find many items that start with V in some language or another!\n", "created_utc": "1425628134.0", "edited": "False", "id": "cp62w2n", "is_submitter": "False", "link_id": "t3_2y1pwj", "parent_id": "t3_2y1pwj", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "LordArkana", "body": "Definitely Breaking Bad. Can't say an episode in particular, the whole damn thing was wild from start to finish...", "created_utc": "1424807197.0", "edited": "False", "id": "covut5u", "is_submitter": "False", "link_id": "t3_2wzn8y", "parent_id": "t3_2wzn8y", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "LordArkana", "body": "I used to think I had a problem consuming 3-4 cups of tea a day - and my cups are pretty large. Now I'm relieved, I'm nowhere near that consumption!", "created_utc": "1423595094.0", "edited": "False", "id": "cohab53", "is_submitter": "False", "link_id": "t3_2vf1vy", "parent_id": "t3_2vf1vy", "score": "2", "subreddit": "tea", "subreddit_id": "t5_2qq5e"}, {"author": "LordArkana", "body": "When you see someone coming towards you from quite far away, and it's someone you know, so you don't know when to wave and say hi and you just walk towards them awkardly until you deem it's time to say hi...\nugh.", "created_utc": "1423448669.0", "edited": "False", "id": "cofkqdl", "is_submitter": "False", "link_id": "t3_2v7jrv", "parent_id": "t3_2v7jrv", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "LordArkana", "body": "I don't know how to interpret these electrophoresis results!!!\n\nYeaah.. not too sexy. ", "created_utc": "1423447626.0", "edited": "False", "id": "cofk66n", "is_submitter": "False", "link_id": "t3_2v7b0m", "parent_id": "t3_2v7b0m", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "LordArkana", "body": "I definitely will, just gotta work up the courage to wait hours and hours and find a day where I can afford to do so...\n\nActually, that's the thing... I drink a -lot-. My top three beverages are water, tea, and alcohol, in that order. I drink two cups of tea a day, and alcohol once every few weeks, I don't drink that much. I've stopped drinking sodas many years ago. So basically just water and tea, and I drink much more water than tea. My urine is usually pretty clear as well.\n\nThank you for your advice!", "created_utc": "1422812734.0", "edited": "False", "id": "co7umg0", "is_submitter": "True", "link_id": "t3_2uf5d3", "parent_id": "t1_co7uftf", "score": "1", "subreddit": "AskDoctorSmeeee", "subreddit_id": "t5_33d9u"}, {"author": "LordArkana", "body": "Yep, I once made a whole post about this episode because it was so goddamn disturbing. Did the writers smoke meth that day?", "created_utc": "1422811842.0", "edited": "False", "id": "co7u5th", "is_submitter": "False", "link_id": "t3_2ua53s", "parent_id": "t1_co6supg", "score": "1", "subreddit": "KingOfTheHill", "subreddit_id": "t5_2s6dm"}, {"author": "LordArkana", "body": "How weird, I saw this episode just today.\nI have mixed feelings about it, though. On one hand, I do believe that this exterminator would have been the perfect girlfriend for Dale, since they have so much in common and they get along so well, like best friends. However, Dale adores Nancy,despite her opinion of his job. They do go well together in a sense- heck, look at Hank and Peggy, sometimes it looks like they don't fit... but they do. What I would have liked in this episode is for Dale to cheat on Nancy with the exterminator just once, then have John Redcorn meet her afterwards, and they fall in love. That would have been interesting to see.", "created_utc": "1399932684.0", "edited": "False", "id": "chgbenc", "is_submitter": "False", "link_id": "t3_25e1lr", "parent_id": "t3_25e1lr", "score": "5", "subreddit": "KingOfTheHill", "subreddit_id": "t5_2s6dm"}, {"author": "LordArkana", "body": "All I know is that I'm getting the hell out of Canada as soon as I can to move there.\nOther than that, you guys have a lot of sheep.", "created_utc": "1397927224.0", "edited": "False", "id": "cgwmgba", "is_submitter": "False", "link_id": "t3_23falw", "parent_id": "t3_23falw", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "LordArkana", "body": "From now on, I want to use this phrase to explain transition to people. It's just perfect.", "created_utc": "1396453349.0", "edited": "False", "id": "cgi75ij", "is_submitter": "False", "link_id": "t3_220884", "parent_id": "t1_cgi3soc", "score": "2", "subreddit": "pics", "subreddit_id": "t5_2qh0u"}, {"author": "LordArkana", "body": "Dan Brown's Inferno.\nMostly because of the genetic engineering used in the story to control world overpopulation. It may sound to most people like the work of a madman, and bioterrorism, but it made a lot of sense to me to use this drastic solution, and if it were in my power, I'd do it. I mean, it doesn't kill anyone, just alter their fertility, which will reduce births, then reducing overall population... it just seemed so genial to me.\nThen again, I may be a madman...", "created_utc": "1393872655.0", "edited": "False", "id": "cfte3lh", "is_submitter": "False", "link_id": "t3_1zfgll", "parent_id": "t3_1zfgll", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "LordArkana", "body": "\"You wouldn't be mad if what I said wasn't true\". \nGod how this pisses me off. The phrase itself pisses me off because it's entirely false, but whoever said it thinks I'm mad because what they said is supposedly true. I'm not mad because it's true, I'm mad because you won't listen to my arguments!", "created_utc": "1392226291.0", "edited": "False", "id": "cfdk594", "is_submitter": "False", "link_id": "t3_1xp749", "parent_id": "t3_1xp749", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "LordArkana", "body": "Probably. I'm the kind of guy that tries to shape himself to other people's personalities, and I'm very careful to avoid conflict - even if it means having to swallow my opinion about a subject I feel strongly about. We'd never fight, but we might resent each other about unspoken feelings...", "created_utc": "1392225635.0", "edited": "False", "id": "cfdjti9", "is_submitter": "False", "link_id": "t3_1xp1sr", "parent_id": "t3_1xp1sr", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "LordArkana", "body": "Personally that's what I thought as well. It didn't seem like something the writers would normally do. It just seemed to... come out of nowhere. Like when did Luanne even get a job in the first place? And the whole pig farm thing... uuggh.", "created_utc": "1391013301.0", "edited": "False", "id": "cf1vg2y", "is_submitter": "True", "link_id": "t3_1wgzal", "parent_id": "t1_cf1vdpo", "score": "1", "subreddit": "KingOfTheHill", "subreddit_id": "t5_2s6dm"}, {"author": "LordArkana", "body": "Oh god, it's THAT popular? I once worked for them, but I am the worst salesman ever. I'm an introvert nerd with social anxiety. It didn't work out, obviously. On the other hand, their knives are pretty amazing, that's no lie.", "created_utc": "1390923608.0", "edited": "False", "id": "cf0ydw7", "is_submitter": "False", "link_id": "t3_1wbq2c", "parent_id": "t3_1wbq2c", "score": "1", "subreddit": "AdviceAnimals", "subreddit_id": "t5_2s7tt"}, {"author": "LordArkana", "body": "OH GOD THE EYES.\n", "created_utc": "1390778860.0", "edited": "False", "id": "cezlizv", "is_submitter": "False", "link_id": "t3_1w7n5v", "parent_id": "t3_1w7n5v", "score": "7", "subreddit": "AdviceAnimals", "subreddit_id": "t5_2s7tt"}, {"author": "LordArkana", "body": "I don't have an actual question, but I also work at an hospital where I've done several different jobs. One of them involved inventory for the hygiene team; I deliver supplies for cleaning all over the hospital, along with various other tasks. And those guys do an amazing job, they're some of the best people I've worked with, and the job isn't easy, yet they always stay happy and cheerful. So I salute you for what you do! Keep it up!", "created_utc": "1389895497.0", "edited": "False", "id": "cer67g9", "is_submitter": "False", "link_id": "t3_1vcvwy", "parent_id": "t3_1vcvwy", "score": "1", "subreddit": "IAmA", "subreddit_id": "t5_2qzb6"}, {"author": "LordArkana", "body": "Damn, and here in Quebec we're above 0. This is fucked up.", "created_utc": "1389717234.0", "edited": "False", "id": "cepcmx1", "is_submitter": "False", "link_id": "t3_1ugykl", "parent_id": "t3_1ugykl", "score": "2", "subreddit": "FML", "subreddit_id": "t5_2qsqi"}, {"author": "LordArkana", "body": "Don't be alarmed when going to the bathroom; it's missing a dick. Feel free to correct this problem while I'm gone. (FtM)", "created_utc": "1389388219.0", "edited": "False", "id": "cemfcs6", "is_submitter": "False", "link_id": "t3_1uw0aa", "parent_id": "t3_1uw0aa", "score": "18", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "LordArkana", "body": "Sometimes I get itchy in the butt area.Or the front as well. And I need to scratch it really badly. But of course I can't just reach in my pants and scratch, because that's not courteous in public, so I must endure the itch until I get to a bathroom... and let's talk about how bathrooms are actually extremely hard to find!\nIn most places, unless it's a public mall with public bathrooms or any public building, you have to be a customer to go to a bathroom. Sometimes there's no public area. Sometimes you have no money to pay for food/drinks just so you can use the bathroom. So what do you do then?!\nI think there should be public bathrooms at every few street corners, everywhere. \nIt'd also help to find a place to scratch the itches in certain areas easier, without being stared at because it's \"gross\".", "created_utc": "1388706103.0", "edited": "False", "id": "cefuyi8", "is_submitter": "False", "link_id": "t3_1u8axw", "parent_id": "t3_1u8axw", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "LordArkana", "body": "Mine is Dungeon Siege II and Baldur's gate, I've never been able to just play these games once. It doesn't feel like a chore to go through the whole game again - I find every moment enjoyable, unlike certain other games, where I only play once, then I can't find any more fun in it.", "created_utc": "1388623348.0", "edited": "False", "id": "cef3knt", "is_submitter": "False", "link_id": "t3_1u59p4", "parent_id": "t3_1u59p4", "score": "2", "subreddit": "gaming", "subreddit_id": "t5_2qh03"}, {"author": "LordArkana", "body": "When I was younger, like 12, I had a friend with a slight mental disorder. She wanted me to hang out with her and her friends. We started walking when this older, taller guy starts following us. He never said a word, he just followed behind. He started creeping me out, but when I saw that my friend didn't react, I didn't think much of it because of her problem - maybe she didn't notice it was creepy? So I tried getting rid of him somehow, and I thought, my friend lives nearby - I could pretend I want to visit him with my friend and tell the guy to wait outside. So I did. And then my friend asked me why I left him behind, I said he kept following us and he was creepy, and it's only then she mentioned to me he was also a friend of hers. \nI felt so goddamn awkward, it all happened in front of my other friend's father too, the one whose house I've been to to hide from the guy. I played it off like nothing happened afterwards and it worked...", "created_utc": "1388457710.0", "edited": "False", "id": "ceds512", "is_submitter": "False", "link_id": "t3_1u0wwy", "parent_id": "t3_1u0wwy", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "LordArkana", "body": "The 3D is just a nice feature, but it's like watching a 3D movie: it can look and feel amazing without it, but it's an added experience. I don't often use it except for animated cut-scenes.", "created_utc": "1387669605.0", "edited": "False", "id": "ce7co8w", "is_submitter": "False", "link_id": "t3_1tfcto", "parent_id": "t3_1tfcto", "score": "4", "subreddit": "gaming", "subreddit_id": "t5_2qh03"}, {"author": "LordArkana", "body": "http://orteil.dashnet.org/cookieclicker/\nYup.", "created_utc": "1387669401.0", "edited": "False", "id": "ce7cloa", "is_submitter": "False", "link_id": "t3_1teyiq", "parent_id": "t3_1teyiq", "score": "1", "subreddit": "gaming", "subreddit_id": "t5_2qh03"}, {"author": "LordArkana", "body": "That was me, on and off today, wondering if I should make that extra effort for the last exam of the year...", "created_utc": "1387249644.0", "edited": "False", "id": "ce3k5ob", "is_submitter": "False", "link_id": "t3_1t1nxv", "parent_id": "t3_1t1nxv", "score": "1", "subreddit": "funny", "subreddit_id": "t5_2qh33"}, {"author": "LordArkana", "body": "\"Some people are immune to good advice.\" - Saul Goodman\nIt's actually my wallpaper!", "created_utc": "1384393126.0", "edited": "False", "id": "cddtqxb", "is_submitter": "False", "link_id": "t3_1qcz0o", "parent_id": "t3_1qcz0o", "score": "2", "subreddit": "breakingbad", "subreddit_id": "t5_2rlw4"}, {"author": "LordArkana", "body": "My father used to work for the Columbian mafia back in the 60's. He nearly got killed several times when in this line of work... of course I wasn't there to witness it, but I have family that can corroborate the story. It's pretty amazing.", "created_utc": "1384308316.0", "edited": "False", "id": "cdd0swq", "is_submitter": "False", "link_id": "t3_1qi5jn", "parent_id": "t3_1qi5jn", "score": "3", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "LordArkana", "body": "If my memory is correct, the 96% was for the batch Jesse just cooked before we see him and Todd talking. The 92% is his average, I believe.", "created_utc": "1380077456.0", "edited": "False", "id": "ccevq3p", "is_submitter": "False", "link_id": "t3_1n2s23", "parent_id": "t3_1n2s23", "score": "3", "subreddit": "breakingbad", "subreddit_id": "t5_2rlw4"}, {"author": "LordArkana", "body": "I actually think that, if Walter really does go after the nazis, and he discovers Jesse alive, he'll just finish the job himself and kill him. Pretty sure. I mean, that's what he wanted, right? And with the double bitch-slap he's been dealt from Junior and Grey Matter, what reason would he have to be nice? \nBut oh god Andrea", "created_utc": "1379903142.0", "edited": "False", "id": "ccdk19j", "is_submitter": "False", "link_id": "t3_1mxlbq", "parent_id": "t3_1mxlbq", "score": "2", "subreddit": "breakingbad", "subreddit_id": "t5_2rlw4"}, {"author": "LordArkana", "body": "Am I the only one that noticed Walt had his glasses back?!", "created_utc": "1379299584.0", "edited": "False", "id": "cc96fyr", "is_submitter": "False", "link_id": "t3_1mgv1c", "parent_id": "t3_1mgv1c", "score": "2", "subreddit": "breakingbad", "subreddit_id": "t5_2rlw4"}, {"author": "LordArkana", "body": "I'm thinking that was intentional. I mean, during her pregnancy, Walter was too busy with his business and dealing with problems that he even missed the birth. And he wasn't much more present afterwards. I think it was like the whole thing passed by, because he was so busy with meth cooking and staying out of trouble that family passed second for him during that period, in a sense, which would explain why it'd seem that Skyler's pregnancy wasn't such a big deal. Just my opinion..", "created_utc": "1378866692.0", "edited": "False", "id": "cc5xel0", "is_submitter": "False", "link_id": "t3_1m3mwe", "parent_id": "t1_cc5sabx", "score": "1", "subreddit": "breakingbad", "subreddit_id": "t5_2rlw4"}, {"author": "LordArkana", "body": "He's a blowfish.", "created_utc": "1378693245.0", "edited": "False", "id": "cc4jcrm", "is_submitter": "False", "link_id": "t3_1m05wj", "parent_id": "t1_cc4hy8t", "score": "1", "subreddit": "breakingbad", "subreddit_id": "t5_2rlw4"}, {"author": "LordArkana", "body": "I just can't\nI have never been so pumped up in my life then it just\nNo\nFuck you AMC", "created_utc": "1378692770.0", "edited": "False", "id": "cc4j5xm", "is_submitter": "False", "link_id": "t3_1m05wj", "parent_id": "t3_1m05wj", "score": "3", "subreddit": "breakingbad", "subreddit_id": "t5_2rlw4"}, {"author": "LordArkana", "body": "That's right Hank. Now you know who you're dealing with!", "created_utc": "1376273282.0", "edited": "False", "id": "cbluow2", "is_submitter": "False", "link_id": "t3_1k67ux", "parent_id": "t3_1k67ux", "score": "0", "subreddit": "breakingbad", "subreddit_id": "t5_2rlw4"}, {"author": "LordArkana", "body": "I was convinced it aired at 11AM EST. I was so disappointed! I have to work early tomorrow! ", "created_utc": "1376239787.0", "edited": "False", "id": "cblju70", "is_submitter": "False", "link_id": "t3_1k4s9b", "parent_id": "t3_1k4s9b", "score": "1", "subreddit": "breakingbad", "subreddit_id": "t5_2rlw4"}, {"author": "LordArkana", "body": "Jesus Marie,they're fungi, not mushrooms!", "created_utc": "1352997477.0", "edited": "False", "id": "c71su6s", "is_submitter": "False", "link_id": "t3_137pjo", "parent_id": "t3_137pjo", "score": "4", "subreddit": "breakingbad", "subreddit_id": "t5_2rlw4"}, {"author": "LordArkana", "body": "Honestly, I think Walt did it because he was so arrogant and prideful that he believed, if he was able to trick Hank and his team so far, he could still do it again. Also, as mentioned before, Hank isn't much of a poetry reader, so he'd never think he would reach for that book. Maybe the part where he did the bug inside Hank's picture in his office is when he decided he could make the man believe anything and so Walt stopped trying to hide so much. But then again, it IS unclear when and how the book ended up in the bathroom. Too many theories, too long a wait!", "created_utc": "1352946649.0", "edited": "False", "id": "c71k3qe", "is_submitter": "False", "link_id": "t3_13584d", "parent_id": "t3_13584d", "score": "1", "subreddit": "breakingbad", "subreddit_id": "t5_2rlw4"}]