[{"author": "Loud_County", "body": "> by 2 sororities", "created_utc": "1665547772.0", "edited": "False", "id": "irzd85t", "is_submitter": "False", "link_id": "t3_y1qtzn", "parent_id": "t1_irzd4o2", "score": "18", "subreddit": "college", "subreddit_id": "t5_2qh3z"}, {"author": "Loud_County", "body": "Lol, I actually have a friend who is learning Chinese as well. He shared [this video](https://www.youtube.com/watch?v=MwwTfcYFhLI&t=) with me when I said I might want to give Mandarin a shot. He said she provided a bunch of good resources for his Mandarin studies. /r/ChineseLanguage is also supposedly pretty good.\n\nI've got nothing for Russian, unfortunately. Maybe there's some good stuff on the /r/russian subreddit?", "created_utc": "1665273168.0", "edited": "False", "id": "irkmheh", "is_submitter": "False", "link_id": "t3_xyepdw", "parent_id": "t1_irkg6fg", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Loud_County", "body": "Yes, I learned hiragana and katana first. To learn kanji, I've been using an Anki deck to cover Heisig's Remembering the Kanji (~25 cards a day here, too). Kanji on the front, keyword associated with the Kanji on the back.\n\nMy Anki vocab decks are all taken from [here](http://www.ankigen.com/). I pump out one deck at a time for each Genki chapter as I work through it. Japanese on the front, English on the back.\n\n> I'm making a set for Japanese next week and want to ensure I do it properly and don't have to modify/add a bunch of stuff later on\n\nI'm a complete beginner, so take my advice with a mountain of salt, but I'd actually recommend against creating any vocab decks for Japanese (or at least, not until you've covered several thousand words). There are already so many high-quality resources for Japanese floating around. For example, I've heard amazing things about the Tango sentence card/vocab decks, [like this vocab/sentence card deck](https://ankiweb.net/shared/info/1679429599). \n Also, [this site](https://learnjapanese.moe/resources/) has an incredible collection of resources for basically everything you could possibly need for the first year or so.", "created_utc": "1665266818.0", "edited": "False", "id": "irk9edn", "is_submitter": "False", "link_id": "t3_xyepdw", "parent_id": "t1_irk6zoq", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Loud_County", "body": "Well, I'm learning Japanese right now, and so far I'm doing pretty much the same thing I did for Spanish. I'm working through a beginner textbook (Genki) while learning ~25 new words a day and throwing the grammar points in Anki. \n\nWith languages that aren't very similar to English, it's just gonna take a lot longer to shed the textbooks and be able to semi-comfortably immerse. While it took me a few months of grinding to tackle native-level Spanish content, it'll probably take me at least 9-12 months to do the same in Japanese. (And even then, I'll probably struggle a lot more than I did when I dove into Spanish stuff.)\n\nI think I've got a decent language-learning process going. Textbook + vocab as fast as possible to build a foundation -> immerse a bunch-> speak/produce.", "created_utc": "1665259457.0", "edited": "1665259757.0", "id": "irjtftu", "is_submitter": "False", "link_id": "t3_xyepdw", "parent_id": "t1_irjkpor", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Loud_County", "body": "It was only possible because Spanish has so many cognates. (Oh no! What could *adaptar* possibly mean?!)\n\n10 new words a day sounds good for something like Mandarin. I'm doing Japanese right now, and I'm stuck at 20-25 max. (And this is while I'm doing more Anki than most people would find enjoyable and abusing the shit out of mnemonics.) Any more than that and my retention rate starts to get uncomfortably low.", "created_utc": "1665258496.0", "edited": "False", "id": "irjrgdh", "is_submitter": "False", "link_id": "t3_xyepdw", "parent_id": "t1_irifd8a", "score": "6", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Loud_County", "body": "It's C1 across everything. If you get a huge amount of input, production comes really naturally after maybe ~fifty hours of work getting the ball rolling on the output side. If you read and listen to a lot of varied content, you'll eventually have the knowledge of how to naturally express almost everything you'd want to say stored somewhere in your head. It just takes a little while to move things over to the active side of your brain from the passive/comprehension side.\n\nI don't really think the time I did it in is anything crazy. At minimum, I had at least around 1100 hours of active studying only. That doesn't include hundreds of hours of passive listening to podcasts at the gym or while running errands, mindlessly scrolling social media in Spanish, listening to Spanish music while working, etc.", "created_utc": "1665227331.0", "edited": "False", "id": "iri6ij5", "is_submitter": "False", "link_id": "t3_xyepdw", "parent_id": "t1_iri2sc8", "score": "7", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Loud_County", "body": "The book I used to build my foundation from zero was ***Complete Spanish Step-by-Step*** by Barbara Bregstein. YouTube was also an amazing resource for me. If things ever got unclear, I'd just type the grammar point in YT and get like 10 different phenomenal explanations.\n\nToward the end of my active studying of Spanish, I used ***Gramática de uso del español: Teoría y práctica C1-C2*** to revise everything and learn some of the nuances I wasn't picking up from exposure. It's entirely in Spanish, so it's kind of inaccessible to anyone besides advanced learners, but it's probably the best grammar resource I've come across. It has succinct and lucid explanations, great example sentences that are perfect to shove into Anki, and good exercises.", "created_utc": "1665209571.0", "edited": "False", "id": "irho0ka", "is_submitter": "False", "link_id": "t3_xyepdw", "parent_id": "t1_irhn33h", "score": "26", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Loud_County", "body": "On the front of my cards, I'd have an example sentence with the specific piece of grammar the card was targeting bolded within the sentence.\n\nOn the back, there would be an explanation of the grammar point and a translation of the sentence into English.\n\nIt was more of a recognition thing rather than literally producing the grammar, but I found that as long as I initially did some textbook exercises that involved production to make sure I had a workable understanding of the grammar point, seeing the patterns over and over in Anki and immersion really cemented the rules and my intuition for what \"sounds right\" in my mind.", "created_utc": "1665208541.0", "edited": "False", "id": "irhmuan", "is_submitter": "False", "link_id": "t3_xyepdw", "parent_id": "t1_irhlblv", "score": "17", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Loud_County", "body": "Not really, no. Thankfully, Spanish is extremely consistent when it comes to the way things are pronounced, so once I had the rules down, I knew exactly how a word was supposed to sound.\n\nI don't think my experience with this topic is super valuable, though. Pronunciation is definitely one area where I had/have a big advantage due to my background. I grew up in a packed household with four languages being spoken. While none of the languages were very related to Spanish (well, other than English), I was exposed to and produced such a wide range of sounds from a really early age, and I think that's what has made Spanish pronunciation, with its relatively small inventory of sounds, a lot less challenging for me.", "created_utc": "1665206316.0", "edited": "1665206511.0", "id": "irhk6fw", "is_submitter": "False", "link_id": "t3_xyepdw", "parent_id": "t1_irhhtpf", "score": "28", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Loud_County", "body": "Vocab cards for the beginner stages. Cards with just the TL word on the front, English definition and *maybe* an example sentence in the TL on the back.\n\nLater on, I made sentence cards that had a sentence in the TL on the front with just *one* word or expression I didn't understand, and on the back I'd have the English translation for that word/expression. I much prefer sentence cards, although you're kinda forced to wait until the intermediate stage to start using them because when you're still a beginner, pretty much every sentence has *more* than one thing you don't understand in it.", "created_utc": "1665202313.0", "edited": "False", "id": "irhex4p", "is_submitter": "False", "link_id": "t3_xyepdw", "parent_id": "t1_irhdadu", "score": "7", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Loud_County", "body": "**TL;DR**: It was usually three-ish hours, but if I had nothing going on, I could get all the way up to five hours if I was feeling it. This is counting grammar study + Anki + active reading/listening.\n\nThe first few months were comprised of learning grammar through a textbook and grinding out vocabulary from a \"5000 most frequent Spanish words\" deck on Anki, doing 50 new cards a day.\n\nAfter that, since I had the core grammar down and the vast majority of words I'd encounter memorized, I switched basically all the media I consumed over to Spanish. News articles in Spanish. YouTube content all in Spanish. Netflix only in Spanish. New Twitter/Insta/TikTok where I only followed accounts posting Spanish content. Music in Spanish. Etc. I did this for 8-9 months.\n\nWhen reading, I added pretty much every new word I didn't know to Anki. I know this would make some people want to kill themselves, but IDK, I guess I just can't let things go haha.", "created_utc": "1665201805.0", "edited": "1665202522.0", "id": "irhe73f", "is_submitter": "False", "link_id": "t3_xyepdw", "parent_id": "t1_irh6sgj", "score": "74", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Loud_County", "body": "Provided you stick with it and do your reviews every day, it's absolutely worth it.", "created_utc": "1665196682.0", "edited": "False", "id": "irh63zv", "is_submitter": "False", "link_id": "t3_xyepdw", "parent_id": "t1_irh4wpp", "score": "6", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Loud_County", "body": "Not familiar with quizlet at all, sorry. \n\nAnki just has everything you could want IMO. It's got hundreds of useful add-ons (like the heatmap OP posted screenshots of); extremely customizable cards and settings; tons of high-quality, community-made decks; and lots of great tutorials on YT covering every nook and cranny of Anki.", "created_utc": "1665196245.0", "edited": "False", "id": "irh5dq2", "is_submitter": "False", "link_id": "t3_xyepdw", "parent_id": "t1_irh42oe", "score": "13", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Loud_County", "body": "Also not the OP, but I've been using Anki for about a year (the time it took me to reach C1 in Spanish from zero).\n\nHonestly, I think it's a damn cheat code. It pretty much guarantees you won't forget anything you stuff in it as long as you're actively trying to remember things (and your cards aren't garbage!). I've used it for grammar points and vocab, and it has been nothing short of amazing. To *really* reap the rewards, if you combine Anki with a boatload of immersion (once you reach an intermediate-advanced level), you're going to make progress so much faster than people who are just immersing.\n\nI sound like such a shill, but seriously, it's just insane how much easier it makes memorizing things. Definitely give it a shot.\n\nI should add, however, that if Anki makes you hate your life, you should probably stop using it. Quitting language learning altogether because you're dreading your Anki sessions would be infinitely worse than settling with the progress you'll make without using an SRS.", "created_utc": "1665192594.0", "edited": "1665211087.0", "id": "irgyz5m", "is_submitter": "False", "link_id": "t3_xyepdw", "parent_id": "t1_irgwt3k", "score": "181", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Loud_County", "body": "He speaks legit Mandarin; there isn't really any doubt about it. \n\nHowever, he's posted videos like, \"How I learned Fluent Spanish in 20 Days,\" but if you know Spanish and watch some of his videos where he speaks Spanish, you'll see that his Spanish is.... not anywhere close to what most people would consider fluent. \n\nFrom what I can see from his Spanish stuff and the comments I've read on his videos featuring languages other than Mandarin, he's going around butchering languages while claiming fluency in his titles.", "created_utc": "1665004709.0", "edited": "1665005151.0", "id": "ir7bbkc", "is_submitter": "False", "link_id": "t3_xwi0vp", "parent_id": "t1_ir79mc8", "score": "118", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Loud_County", "body": "Damn this is a banger. Thanks for sharing this.", "created_utc": "1663170427.0", "edited": "False", "id": "ioerskc", "is_submitter": "False", "link_id": "t3_xdmjul", "parent_id": "t3_xdmjul", "score": "2", "subreddit": "shoegaze", "subreddit_id": "t5_2qhhx"}, {"author": "Loud_County", "body": "Hahaha no that guy thinks \"crushing an egg is difficult\". But I am a redditor and I have an IQ (self-tested) of 200 so I know better. You know, because this is clearly not common knowledge! An egg easy to crush? Yep, you would not have known that, so I will upvote all other high-IQ people who are like me well-informed about this obscure fact. And I will downvote anyone who claims the guy in the Video made a joke.", "created_utc": "1654472308.0", "edited": "False", "id": "ibb3f7g", "is_submitter": "False", "link_id": "t3_v5htb9", "parent_id": "t1_ibanzk3", "score": "115", "subreddit": "facepalm", "subreddit_id": "t5_2r5rp"}, {"author": "Loud_County", "body": "> My calorie count didn't change much at all.\n\nThis is simply not true. That's now how the weight-loss process works. At all. \n\nI've lost more than triple the amount you have and \"eating bullshit\" has never affected my weight loss. Calories In - Calories Out is all that matters for weight loss. You 100% have not been tracking your calories correctly.", "created_utc": "1654465376.0", "edited": "1654465574.0", "id": "ibapt50", "is_submitter": "False", "link_id": "t3_v5daqg", "parent_id": "t1_ibajkcj", "score": "0", "subreddit": "TooAfraidToAsk", "subreddit_id": "t5_2ssp7"}, {"author": "Loud_County", "body": "As long as you flair up/give people a heads up & you actually answer questions, I think nobody really cares.\n\nJust maybe don't answer questions like, \"Men of Reddit, what's the best way to jack off?\" :-)", "created_utc": "1654457673.0", "edited": "False", "id": "iba9u6d", "is_submitter": "False", "link_id": "t3_v5hy3v", "parent_id": "t1_ib9wrcp", "score": "94", "subreddit": "AskMen", "subreddit_id": "t5_2s30g"}, {"author": "Loud_County", "body": "If we're doing the credential drop to qualify our comments: Someone who lost ~160 pounds here.\n\nKeeping your diet in check is a million times more important. \n\nIt's laughably easy to consume an additional 700 calories. It's extremely difficult to burn an additional 700 calories through exercise.\n\n> Only doing on of the two will be difficult.\n\nFor people who aren't tiny or already basically at a normal weight, it is not difficult to lose weight through diet only.", "created_utc": "1654447673.0", "edited": "1654448629.0", "id": "ib9oosu", "is_submitter": "False", "link_id": "t3_v5daqg", "parent_id": "t1_ib9jm1r", "score": "4", "subreddit": "TooAfraidToAsk", "subreddit_id": "t5_2ssp7"}, {"author": "Loud_County", "body": "Yes, but it doesn't make as big of a difference as a lot of people think. Each pound of muscle = an additional ~6 calories burned per day. \n\nDiet is almost all that matters for weight loss. Cardio is nice for general health, and strength training will help you avoid being left with just a skinny-fat look when you're done.", "created_utc": "1654446255.0", "edited": "False", "id": "ib9loul", "is_submitter": "False", "link_id": "t3_v5daqg", "parent_id": "t1_ib9grnz", "score": "3", "subreddit": "TooAfraidToAsk", "subreddit_id": "t5_2ssp7"}, {"author": "Loud_County", "body": "It's interesting that you don't consider crying to be losing control of your emotions. From personal experience and conversations with the dudes in my circle, it seems like most relationships are doomed if the guy cries over something that isn't as serious as like, the death of their mother or something.", "created_utc": "1654201093.0", "edited": "1654212783.0", "id": "iayc2kt", "is_submitter": "False", "link_id": "t3_v3d4sz", "parent_id": "t1_iay7j13", "score": "24", "subreddit": "AskMen", "subreddit_id": "t5_2s30g"}, {"author": "Loud_County", "body": "I'd say it would only feel like starving to death for people who are overweight/obese ***and*** steadily gaining weight. If you're eating 500 calories above maintenance regularly, for example, then yeah, switching to a 200-300 calorie deficit is gonna feel pretty shitty. It's a total difference of 700-800 calories. This isn't most people, though: most folks aren't putting on 30-50lbs a year.\n\nI agree with your other points. Too many people think cardio = you can eat whatever you want, and the rampant calorie guesstimating instead of pulling out the food scale from time to time is just mind-boggling.", "created_utc": "1654199023.0", "edited": "False", "id": "iay7ari", "is_submitter": "False", "link_id": "t3_v34oar", "parent_id": "t1_iay4duq", "score": "1", "subreddit": "AskMen", "subreddit_id": "t5_2s30g"}, {"author": "Loud_County", "body": "But what I'm saying is the process itself really isn't that difficult. People just don't know shit about the whole calorie-counting thing. \"EaTiNg HeAlThY\" to the average person is forcing yourself to eat salads and chicken breast every day of your life.\n\nA 200-300 calorie deficit doesn't need to feel *bad*. You can still eat a lot of the same things you were eating to maintain your original weight since the deficit is so small. It's just a matter of making those things fit into your daily caloric limit--something that can easily be done if you're going for a small, sustainable deficit.", "created_utc": "1654197627.0", "edited": "False", "id": "iay42lr", "is_submitter": "False", "link_id": "t3_v34oar", "parent_id": "t1_iay26c0", "score": "1", "subreddit": "AskMen", "subreddit_id": "t5_2s30g"}, {"author": "Loud_County", "body": "The average person will struggle to lose weight because they have no knowledge whatsoever about the calorie-counting process. That's why fad diets that are impossible to stick to are so popular. \n\nReally, for a 250lber who isn't emotionally dependent on food, losing weight by maintaining a 200-300 calorie deficit is not very difficult.", "created_utc": "1654196452.0", "edited": "False", "id": "iay1d7d", "is_submitter": "False", "link_id": "t3_v34oar", "parent_id": "t1_iaxpvra", "score": "3", "subreddit": "AskMen", "subreddit_id": "t5_2s30g"}, {"author": "Loud_County", "body": "I definitely wasn't doing that, but you don't seem to have any reading or writing skills whatsoever (how do you confuse commas with periods?!), so I can understand why the content of my comments went above your head.\n\nHmm... I wouldn't say I'm backed into a corner. I'd say I'm just gobsmacked that somebody like you, a person who reads and writes like they've just graduated from junior high, thinks they're the arbiter of which comments belong and which do not.\n\nI won't waste any more of my time with you. Have a good one, and don't forget to hit the books :-)", "created_utc": "1653343569.0", "edited": "False", "id": "i9qi9pd", "is_submitter": "False", "link_id": "t3_uvsz4u", "parent_id": "t1_i9qe9da", "score": "2", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "Loud_County", "body": "> Where did I say anything about self-worth??\n\nEarlier, you were encouraging commenting on a hypothetical fat person's weight because:\n\n> I think this question would make the person more self-conscious.\n\nYou encouraged making someone feel self-conscious by bringing up their weight, which of course, would only happen if their self-worth is at least loosely tied to their weight (and it is for many, many people who've struggled with their weight). \n\nI was originally pointing out that not everyone's self-worth is tethered to what others say about them. A lot of people have lost weight anyway just to be healthier. You come off as someone who has an unhealthy relationship with what others say about them. \n\n> If something isn't going right with my health, I would want others to point it out\n\nDo you normally need others to point out things that are extremely obvious? Please tell me you aren't this helpless of a human being. Every fat person knows they're fat, and aside from the tiny percentage that has locked themselves away in online echo chambers, they all know it isn't healthy, too.", "created_utc": "1653340599.0", "edited": "False", "id": "i9qbsfk", "is_submitter": "False", "link_id": "t3_uvsz4u", "parent_id": "t1_i9q7zta", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "Loud_County", "body": "I'm not debating whether or not the comment is appropriate. I was reminding the original person I responded to that comments from others are not the motivation behind every fat person's weight-loss efforts.\n\n*there, by the way.", "created_utc": "1653339606.0", "edited": "1653340810.0", "id": "i9q9kwn", "is_submitter": "False", "link_id": "t3_uvsz4u", "parent_id": "t1_i9q5bsn", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "Loud_County", "body": "It might seem like a foreign concept to you, but when your self-worth is largely divorced from what others say to you, those \"things\" will neither help nor impede efforts to lose weight.", "created_utc": "1653336124.0", "edited": "False", "id": "i9q1kk5", "is_submitter": "False", "link_id": "t3_uvsz4u", "parent_id": "t1_i9pxco2", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "Loud_County", "body": "> but if you keep saying \"no, it's fine, it's not your fault\" or other similar things, they will never want to change.\n\nBelieve it or not, not everyone is obsessed with the approval of others. A lot of people choose to lose weight simply to be healthier.", "created_utc": "1653321500.0", "edited": "False", "id": "i9p30r6", "is_submitter": "False", "link_id": "t3_uvsz4u", "parent_id": "t1_i9oxeez", "score": "9", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "Loud_County", "body": ">!22 women!<", "created_utc": "1652582921.0", "edited": "False", "id": "i8nhj7b", "is_submitter": "False", "link_id": "t3_upw4qc", "parent_id": "t1_i8nh0gw", "score": "102", "subreddit": "nfl", "subreddit_id": "t5_2qmg3"}, {"author": "Loud_County", "body": "> Something about how they think kids should be required to contribute by paying rent if they're living at home and working.\n\nI agree with you on contributing, but making your kids pay hundreds or thousands in rent just seems kinda vile (provided you're comfortable enough financially to afford your kid staying at home).\n\nLike, they can pick up the groceries sometimes and do other household errands that require them to use their own money, and they can still contribute via normal chores around the house, too. You're not teaching them anything special that can't be taught by giving them non-bank-account-breaking household responsibilities.", "created_utc": "1651787321.0", "edited": "1651790110.0", "id": "i7ha2oy", "is_submitter": "False", "link_id": "t3_uiv3a8", "parent_id": "t1_i7h215f", "score": "6", "subreddit": "2meirl4meirl", "subreddit_id": "t5_3ee85"}, {"author": "Loud_County", "body": "> All I did this year was switch from four bottles of coke a day to four diet mountain dews and I lost 20 pounds. My decisions don’t really seem to factor into it at all.\n\nI don't get what you're trying to say here at all. It was a decision--a good one--and you lost weight because you axed ~800 calories from your daily intake. If you start counting from around the start of this year, you've consumed ~90,000 fewer calories than you would've had you continued drinking regular Coke. That's ~25 pounds right there.\n\n> I’ve seen people eat healthy, home cooked shit and exercise and still be fat.\n\nThere are all kinds of \"healthy\" foods that are still *very* calorically dense and should generally be kept to a minimum for people trying to lose weight--e.g., nuts, rice, dried fruit, olive oil, and whole-grain bread. For example, it'd be pretty easy to accidentally get an extra 1000 calories per day from some mindless grazing on almonds, cooking with a generous amount of healthy oils, and having a few pieces of toast & a couple handfuls of raisins.\n\nThe [Calories In - Calories Out] equation doesn't care that all of your calories are coming from \"healthy\" foods. You still won't lose weight if you aren't burning more calories than you're consuming each day.", "created_utc": "1650418651.0", "edited": "1650419669.0", "id": "i5fbz8t", "is_submitter": "False", "link_id": "t3_u77f15", "parent_id": "t1_i5eyul1", "score": "10", "subreddit": "TooAfraidToAsk", "subreddit_id": "t5_2ssp7"}, {"author": "Loud_County", "body": "haha I am also a fellow lover of large-breasted latina women lol", "created_utc": "1650306839.0", "edited": "False", "id": "i58nxhj", "is_submitter": "False", "link_id": "t3_u6ibue", "parent_id": "t1_i58n3n9", "score": "23", "subreddit": "ValorantCompetitive", "subreddit_id": "t5_2g5ach"}, {"author": "Loud_County", "body": "W", "created_utc": "1644981787.0", "edited": "False", "id": "hx4kwbr", "is_submitter": "False", "link_id": "t3_stggq7", "parent_id": "t1_hx42s7x", "score": "14", "subreddit": "college", "subreddit_id": "t5_2qh3z"}, {"author": "Loud_County", "body": "Wake up", "created_utc": "1643746298.0", "edited": "False", "id": "hv6f534", "is_submitter": "False", "link_id": "t3_si2sz0", "parent_id": "t3_si2sz0", "score": "13", "subreddit": "eden", "subreddit_id": "t5_2s5fb"}, {"author": "Loud_County", "body": "!RemindMe 2 years", "created_utc": "1643653698.0", "edited": "False", "id": "hv0wyni", "is_submitter": "False", "link_id": "t3_sh37vd", "parent_id": "t3_sh37vd", "score": "2", "subreddit": "csMajors", "subreddit_id": "t5_33vsv"}, {"author": "Loud_County", "body": "Lmfao what in the world bro???", "created_utc": "1641924980.0", "edited": "False", "id": "hs8ki2x", "is_submitter": "False", "link_id": "t3_s0ynml", "parent_id": "t1_hs8jhvo", "score": "3", "subreddit": "csMajors", "subreddit_id": "t5_33vsv"}, {"author": "Loud_County", "body": "Nothing like thinking you're gonna unwind with a lil medium then getting fucked for an hour and checking the discuss section in tears.", "created_utc": "1641364926.0", "edited": "False", "id": "hrbntil", "is_submitter": "False", "link_id": "t3_rw2xbi", "parent_id": "t1_hrbkaew", "score": "30", "subreddit": "csMajors", "subreddit_id": "t5_33vsv"}, {"author": "Loud_County", "body": "Some of these responses are fucking bananas. I had to double-check to make sure I wasn't on some fringe lunatic sub.", "created_utc": "1640469376.0", "edited": "False", "id": "hpyhm9d", "is_submitter": "False", "link_id": "t3_roesvb", "parent_id": "t1_hpyg15w", "score": "12", "subreddit": "HolUp", "subreddit_id": "t5_qir9n"}, {"author": "Loud_County", "body": "AHHHHHHHHHHHHHHHHHHHHHHHHH", "created_utc": "1640462422.0", "edited": "False", "id": "hpy43ba", "is_submitter": "False", "link_id": "t3_robdhk", "parent_id": "t1_hpxn31w", "score": "3", "subreddit": "AskMen", "subreddit_id": "t5_2s30g"}, {"author": "Loud_County", "body": "Alright spill it buddy. What did you do", "created_utc": "1640374186.0", "edited": "False", "id": "hpu9c05", "is_submitter": "False", "link_id": "t3_rnnh93", "parent_id": "t1_hpu8ajm", "score": "31", "subreddit": "nfl", "subreddit_id": "t5_2qmg3"}, {"author": "Loud_County", "body": "#**HE'D GIVE YOU BLING IF YOU WEREN'T SOME RANDO-INCOGNITO**", "created_utc": "1639784692.0", "edited": "False", "id": "hozhnbu", "is_submitter": "False", "link_id": "t3_rilp5u", "parent_id": "t1_hozdbgw", "score": "6", "subreddit": "perfectlycutscreams", "subreddit_id": "t5_3n7fs"}, {"author": "Loud_County", "body": "My friend", "created_utc": "1639430306.0", "edited": "False", "id": "hofflxk", "is_submitter": "False", "link_id": "t3_rfeebn", "parent_id": "t1_hoesegn", "score": "3", "subreddit": "perfectlycutscreams", "subreddit_id": "t5_3n7fs"}, {"author": "Loud_County", "body": "Sir??", "created_utc": "1639054875.0", "edited": "False", "id": "hnui02q", "is_submitter": "False", "link_id": "t3_rcde34", "parent_id": "t1_hnudrxx", "score": "5", "subreddit": "wholesomememes", "subreddit_id": "t5_3gcwj"}, {"author": "Loud_County", "body": "Meh. Curtis Painter wasn't *that* good.", "created_utc": "1637082993.0", "edited": "False", "id": "hkvioe3", "is_submitter": "False", "link_id": "t3_qva245", "parent_id": "t1_hkvi0th", "score": "20", "subreddit": "nfl", "subreddit_id": "t5_2qmg3"}, {"author": "Loud_County", "body": "I agree with everything except\n\n> get a good book and start learning the theory of computation.\n\nI really can't think of a better way to get a beginner to quit than having them go through a book on the theory of computation. This is someone with no programming experience whatsoever. They need to learn a fuckton of other things (variables, conditionals, etc -> basic data structures & algs) before even going near the theory of computation.", "created_utc": "1637079174.0", "edited": "False", "id": "hkv8zng", "is_submitter": "False", "link_id": "t3_qv7bsk", "parent_id": "t1_hkuvpfo", "score": "40", "subreddit": "csMajors", "subreddit_id": "t5_33vsv"}, {"author": "Loud_County", "body": "i dont think a Harvard person would use t15 to describe it lol", "created_utc": "1636902286.0", "edited": "False", "id": "hkleo1v", "is_submitter": "False", "link_id": "t3_qtivrj", "parent_id": "t1_hkl8euh", "score": "3", "subreddit": "csMajors", "subreddit_id": "t5_33vsv"}, {"author": "Loud_County", "body": "This is definitely a sane response.\n\nI was honestly confused as to why someone would feel so victimized by my posts, so I took a glance at your post history to see what was up. You’re clearly going through it right now, so I have nothing left to say but good luck and I wish you the best. See ya.", "created_utc": "1633485274.0", "edited": "False", "id": "hfjytqg", "is_submitter": "False", "link_id": "t3_q23d3d", "parent_id": "t1_hfjwwnm", "score": "29", "subreddit": "loseit", "subreddit_id": "t5_2rz8w"}, {"author": "Loud_County", "body": "That part of my comment is talking about others possibly finding it jarring and gross, which again, is pretty obvious if you read that entire part of the comment.\n\nYou've got the \"new\" flair, so I take it you aren't intimately familiar with the loose skin of someone who has been morbidly obese. Let me tell you, as someone down 165 lbs, flaps of loose skin can actually get pretty gross after a long, hot day! Yep, it can get real sweaty and stinky. Crazy, I know. Not ideal, but such is life after weight loss for some. Pretend it doesn't happen and that nobody will find it gross if it helps you sleep at night.\n\nAnd still, I haven't called fat people gross or people who are now thin gross. No point in working yourself up over things I never said.", "created_utc": "1633482850.0", "edited": "False", "id": "hfjuhil", "is_submitter": "False", "link_id": "t3_q23d3d", "parent_id": "t1_hfjsa34", "score": "37", "subreddit": "loseit", "subreddit_id": "t5_2rz8w"}, {"author": "Loud_County", "body": "Lol, what in the fuck are you talking about?\n\nThat part of my comment is talking about finding someone who doesn't care about excess skin. It's pretty obvious in the context of the comment.\n\nTake your victim complex somewhere else, friend.", "created_utc": "1633481104.0", "edited": "False", "id": "hfjqw9h", "is_submitter": "False", "link_id": "t3_q23d3d", "parent_id": "t1_hfjo9ws", "score": "44", "subreddit": "loseit", "subreddit_id": "t5_2rz8w"}, {"author": "Loud_County", "body": "just pray you have good genetics :-)\n\nSeriously though, if u wind up having a lot of loose skin and you're younger, you should be ready to experience at least a few rejections after the clothes come off (not necessarily in the moment, but in the days following).\n\ni can't really blame the people who rejected me for it--loose skin (to the degree of a former morbidly obese person's) can be jarring and gross, especially on someone who's pretty young. Even if you give them a heads up, it's not really something many people have seen up close before.\n\nDefinitely don't give up on losing weight. Life is so much better in so many other aspects post-weight loss. You're treated with more respect overall, physical activities are a million times easier, clothes shopping is easy and actually fun.... it's the best. Also, there's always surgery if you have the means for it.\n\nAnd who knows, maybe you'll get lucky and find someone who truly does not give a fuck :-)", "created_utc": "1633472394.0", "edited": "1653335634.0", "id": "hfj8pet", "is_submitter": "False", "link_id": "t3_q23d3d", "parent_id": "t1_hfj3vrf", "score": "65", "subreddit": "loseit", "subreddit_id": "t5_2rz8w"}, {"author": "Loud_County", "body": "im gonna sound like a shill, but getting an ipad for notetaking changed everything for me. i can't imagine going back to pen and paper.\n\nbeing able to search for specific words/titles in your notes quickly (godsend for open book tests); copy/pasting & resizing in the blink of an eye instead of fumbling around with an eraser; the ease of drawing neat, colorful graphs/diagrams; no more dealing with 20 notebooks; the pros are endless.\n\ni have a 2017 pro. the size is a little unwieldy if you're using it for entertainment, but I got one for dirt cheap for the sole purpose of taking notes, and it's the best size for that imo. i feel like it's not a great idea to go down to screen sizes smaller than a normal sheet of paper, but to each their own.\n\napp i use is Goodnotes btw", "created_utc": "1633439293.0", "edited": "1633445144.0", "id": "hfh3nww", "is_submitter": "False", "link_id": "t3_q1vhfg", "parent_id": "t3_q1vhfg", "score": "2", "subreddit": "college", "subreddit_id": "t5_2qh3z"}, {"author": "Loud_County", "body": "If you aren't learning data structures & algorithms on the side, mediums are gonna be nearly impossible for you. The easies generally can be brute-forced or only require things like basic iteration. The medium category is where your fundamental knowledge of data structures, traversals, etc., is actually tested.\nYour friends who can do mediums/hards definitely have prior exposure to algos/ds. \n\nIf you're in a rush to get good, there are a ton of resources for algos online. Otherwise, wait until you're through with your algorithms class, then reassess.", "created_utc": "1628902576.0", "edited": "False", "id": "h8utcf1", "is_submitter": "False", "link_id": "t3_p3xfis", "parent_id": "t3_p3xfis", "score": "3", "subreddit": "csMajors", "subreddit_id": "t5_33vsv"}, {"author": "Loud_County", "body": "Right. There are other ways to learn DSA. Personally, I did the bulk of my learning for LC through a free class on Coursera and YT videos.\n\nHe mentioned he's a student in his senior year, though, so I brought it up because, by this point, he has definitely been exposed to the course in one way or another.", "created_utc": "1628698176.0", "edited": "1628698439.0", "id": "h8jrl3b", "is_submitter": "False", "link_id": "t3_p2eoxi", "parent_id": "t1_h8jmr2h", "score": "2", "subreddit": "cscareerquestions", "subreddit_id": "t5_2sdpm"}, {"author": "Loud_County", "body": "It's pretty important. A lot of companies (but definitely not all) ask those questions nowadays. The range of difficulty differs--i.e., generic company X will probably ask things closer to the easy level, while companies around the FAANG tier will make you work through mediums and a hard.\n\n> I can't solve even the easy problems without doing at least a little bit of research/googling.\n\nTry to pinpoint why this is happening. If you haven't take your school's data structures/algorithms course (or researched the subject on your own time), then that's the reason you can't do LC. You acquire most of the tools for LC in that class. (There are a lot of quality, free resources online for data structures and algorithms if you haven't taken it yet and you want to get started on LC asap.)\n\nIf you have already taken it or already know your stuff, then you probably just need to do a quick refresher and get to grinding. Learn as much as you can from the most-voted solutions after attempting the questions for at least 30-40mins. Eventually, you'll begin to recognize which pattern/tool applies to a given question, and you'll be set from there.\n\nEdit: Clarification.", "created_utc": "1628695725.0", "edited": "1628700144.0", "id": "h8jlpnd", "is_submitter": "False", "link_id": "t3_p2eoxi", "parent_id": "t3_p2eoxi", "score": "5", "subreddit": "cscareerquestions", "subreddit_id": "t5_2sdpm"}, {"author": "Loud_County", "body": "I didn't really use anything beyond the General Study Strategy and Programming Interview Study Guide sections. Those sections are still very useful (besides his advice about listening to CS podcasts). Within the last year, I went from being unable able to solve most easies to solving 80% of mediums I encounter in 30-40 mins (definitely still have room to improve, ofc) by following his general roadmap/study guide. \n\nReally, the Princeton courses he mentioned and the Skeina book are basically the full DSA treatment you get in a lot of CS programs. When you're most of the way through those, you're definitely ready for Leetcode. At that point, it's just about decoding the Leetcode specific tricks (plenty of guides for that online).", "created_utc": "1628562792.0", "edited": "False", "id": "h8d4w9w", "is_submitter": "False", "link_id": "t3_p0lwu7", "parent_id": "t1_h8czxqb", "score": "1", "subreddit": "cscareerquestions", "subreddit_id": "t5_2sdpm"}, {"author": "Loud_County", "body": "Haha no problem man. But yeah, as he outlines in his \"high-level roadmap,\" taking most of pt1 and pt2 of the Princeton class and really understanding how and why those DSAs do what they do is the fundamental knowledge that will make 80% of mediums and all easies approachable.\n\nThere are some relatively advanced techniques like dynamic programming and backtracking which aren't covered in the class (don't worry about them at all right now), and the textbook he suggests to supplement your learning, *The Algorithm Design Manual*, does a fantastic job explaining those topics. It definitely isn't a required purchase, though; I have the book and it's amazing, but I could have discovered those topics by finding out about them in the solutions discussion of some problem I was unable to solve, then hitting up google/youtube.\n\n\nBuying *Cracking the Coding Interview* afterward like he suggests would be great if you want a more structured approach to tackling interview questions, but when you're mostly done learning your DSAs, you could instead just read posts online that [expose Leetcode patterns](https://hackernoon.com/14-patterns-to-ace-any-coding-interview-question-c5bb3357f6ed), then solve problems off of top lists for interview prep on Leetcode like the famous [Blind 75](https://www.teamblind.com/post/New-Year-Gift---Curated-List-of-Top-75-LeetCode-Questions-to-Save-Your-Time-OaM1orEU), which will expose you to common themes among interview questions.\n\nJust make sure you don't tap out when you're learning your DSAs. It will definitely be tough at times--I remember being bent over by recursion when I was learning about sorting algorithms and trees--but it's 100% doable and worth it.", "created_utc": "1628544009.0", "edited": "1628545116.0", "id": "h8c1crl", "is_submitter": "False", "link_id": "t3_p0lwu7", "parent_id": "t1_h8bkh87", "score": "1", "subreddit": "cscareerquestions", "subreddit_id": "t5_2sdpm"}, {"author": "Loud_County", "body": "If easies are that difficult for you, it just means your knowledge of fundamental data structures and algorithms is lacking. \n\nI had the same problem when I first tried to do Leetcode with only a bit of knowledge about basic data structures, loops, and conditionals. I didn't know anything about trees, graphs, sorting/selection algos, etc. My toolbox just wasn't big enough to tackle Leetcode efficiently yet.\n\n\nhttps://haseebq.com/how-to-break-into-tech-job-hunting-and-interviews/#part1 - Scroll down to the part titled \"Programming Interview Study Guide\" in that link. It is hands-down the best roadmap for being prepared to do Leetcode. \n\nIf you watch the lectures in the Princeton course he mentions and implement all of the data structures/algorithms that are listed in that portion of the blog from scratch (they'll cover most of them), you will probably never encounter an easy/medium that you have *zero* idea how to approach. \n\nAlso, look up William Fiset or Abdul Bari if you need a different explanation of an algorithm or data structure. Both of them are incredible. \n\nGood luck with the LC grind!", "created_utc": "1628532004.0", "edited": "1628534819.0", "id": "h8b9447", "is_submitter": "False", "link_id": "t3_p0lwu7", "parent_id": "t3_p0lwu7", "score": "1", "subreddit": "cscareerquestions", "subreddit_id": "t5_2sdpm"}, {"author": "Loud_County", "body": "He said he wrote icarus in a day after tour. From his [vertigo AMA](https://www.reddit.com/r/eden/comments/7sp77b/i_am_eden_and_my_debut_album_vertigo_is_out_now/dt6fdhk/):\n\n> i wrote icarus in one day - the first day i got home from tour. i think everyone goes through phases of placing their worth in other things or in goals, and eventually it will fail to fulfil you. whatever music success, or things in my personal life that i had pined for and then gotten, didnt make me feel better about myself. \n\nHe went into more detail about how he was feeling used after shows in 365x: 22. \n\nThe part you quoted seems like it's about fans just wanting a performance and not caring about how the person behind EDEN is doing.", "created_utc": "1609900311.0", "edited": "1609941931.0", "id": "gi9biud", "is_submitter": "False", "link_id": "t3_kr87sm", "parent_id": "t1_gi9826g", "score": "8", "subreddit": "eden", "subreddit_id": "t5_2s5fb"}, {"author": "Loud_County", "body": "As neat as the new gunsmith combos are, I feel like pick 10 was peak balance. The new system has everyone running around like supersoldiers with all their favorite perks, attachments, and grenades on every class.\n\nImagining everyone with C4, emps, M8 with five attachments, B23R with attachments, and Ghost/Toughness/Dexterity scares me.", "created_utc": "1607531676.0", "edited": "False", "id": "gf6j9zj", "is_submitter": "False", "link_id": "t3_k9saf1", "parent_id": "t1_gf6ieai", "score": "31", "subreddit": "CallOfDuty", "subreddit_id": "t5_2rcq2"}, {"author": "Loud_County", "body": "And if you're only out to satisfy the post-meal sweet craving and don't need much food, mini ice cream sandwiches are like 90 calories. There's no need to do this to yourself lol.", "created_utc": "1607369965.0", "edited": "False", "id": "gez51a5", "is_submitter": "False", "link_id": "t3_k8mha0", "parent_id": "t1_gez00bb", "score": "474", "subreddit": "1200isplenty", "subreddit_id": "t5_2xk5e"}, {"author": "Loud_County", "body": "> Because not everyone likes the smaller faster simpler cut off lines of sight\n\nI see this get brought up a lot by the people who dislike BO2 (not saying you do), and I think it's BS. BO2 had plenty of maps that weren't simply three-lane maps with short sightlines. Counting just launch maps, there's Turbine, Meltdown, Drone, Cargo, Carrier, and Aftermath.\n\nThe likely reason you think that's all BO2 was is because the maps that are always mentioned from BO2 (aka the best ones) *are* the three-lane small/medium-sized maps. Slums, Standoff, Raid, Hijacked, Nuketown, Studio (I know it's a BO1 map), etc.\n\n\nThe small/medium-sized 3-lane maps are almost always the fan-favorite maps in COD games. People love them. Hijacked, Firing Range, Nuketown, Raid, Summit, Terminal, Highrise, Scrapyard, Dome, Freight, Sovereign, Combine, Hardhat, etc.\n\nThe bigger maps and/or maps without a clearly-defined layout are typically widely disliked. Derail, Aftermath, Estate, Crisis, Turbine, Array, Siege, Stonehaven, Downturn, Drone, etc.\n\nI disagree about BO1 being better or more skillful (although I loved BO1 a lot), but I don't feel like turning this post into a 10-page dissertation so I'll leave it there lol.", "created_utc": "1607365333.0", "edited": "1607366479.0", "id": "geyt6yr", "is_submitter": "False", "link_id": "t3_k8gwsp", "parent_id": "t1_geypix1", "score": "17", "subreddit": "CallOfDuty", "subreddit_id": "t5_2rcq2"}, {"author": "Loud_County", "body": "I'm pretty sure everyone at 3arc is aware of this based on feedback, player retention even after Ghosts and AW came out, etc. \n\nIt makes the decision to stray so far from what BO2 was so confusing. They're trying to reinvent the wheel when BO2 laid the groundwork for a near-perfect COD experience.", "created_utc": "1607360675.0", "edited": "False", "id": "geyhbjc", "is_submitter": "False", "link_id": "t3_k8gwsp", "parent_id": "t1_geyc1xe", "score": "39", "subreddit": "CallOfDuty", "subreddit_id": "t5_2rcq2"}, {"author": "Loud_County", "body": "> he’s said multiple times that he’s only gonna make music he wants to make\n\nThis is what basically every artist in the world says, even though there's zero doubt all of them are influenced by the reviews/streams to some extent.\n\nIn July, he [tweeted](https://twitter.com/iameden/status/1287084390376505351) \"what a relief it is to like making music again.\" I'd wager that situation likely had something to do with no future not meeting his expectations. He mentioned he was disappointed with its reception in an AMA, too.\n\nHis releases since the style shift post-909 haven't done well. It's not crazy to think the fans' lack of love for his new sound could've killed his desire to produce more no future-type tracks, so he decided to scrap the project.", "created_utc": "1606240502.0", "edited": "False", "id": "gdgrkum", "is_submitter": "False", "link_id": "t3_k098lw", "parent_id": "t1_gdgp0wh", "score": "21", "subreddit": "eden", "subreddit_id": "t5_2s5fb"}, {"author": "Loud_County", "body": "Maybe he got sick of his new experimental sound since his recent music hasn't been doing that well, and he's going back to a vertigo/end credits-type sound. That would be a major W.", "created_utc": "1606239264.0", "edited": "1606241325.0", "id": "gdgou6m", "is_submitter": "False", "link_id": "t3_k098lw", "parent_id": "t3_k098lw", "score": "9", "subreddit": "eden", "subreddit_id": "t5_2s5fb"}, {"author": "Loud_County", "body": "This dude is smoking something. It's not bad by any means, but the KRIG, AK, and FFAR absolutely smoke it.", "created_utc": "1605580198.0", "edited": "False", "id": "gckipr5", "is_submitter": "False", "link_id": "t3_jvjzhc", "parent_id": "t1_gckegl7", "score": "70", "subreddit": "blackopscoldwar", "subreddit_id": "t5_2abod4"}, {"author": "Loud_County", "body": "should i take a shower after reading this", "created_utc": "1605556841.0", "edited": "False", "id": "gcj2l3x", "is_submitter": "False", "link_id": "t3_jv9srl", "parent_id": "t1_gcj0nbn", "score": "4", "subreddit": "nextfuckinglevel", "subreddit_id": "t5_m0bnr"}, {"author": "Loud_County", "body": "Damn, you missed out. BO2 DLC maps were absolutely godlike. That's probably why people love the game so much. There are like 15 actual *good* maps in the game, a few meh, and a few awful. I can't name more than a couple of good maps in the recent games.", "created_utc": "1604266482.0", "edited": "1604266716.0", "id": "gatzu3f", "is_submitter": "False", "link_id": "t3_jm4yn8", "parent_id": "t1_gaty7bm", "score": "11", "subreddit": "blackopscoldwar", "subreddit_id": "t5_2abod4"}, {"author": "Loud_County", "body": "I seriously don't get why we can't have the prestige system and the season system at the same time. Where's the problem with implementing an overall rank that spans your entire time playing the game (aka the old prestige system), and a temporary rank you level up each season that unlocks season-specific rewards/challenges?", "created_utc": "1603507235.0", "edited": "False", "id": "g9uakp8", "is_submitter": "False", "link_id": "t3_jh0wtg", "parent_id": "t3_jh0wtg", "score": "35", "subreddit": "blackopscoldwar", "subreddit_id": "t5_2abod4"}, {"author": "Loud_County", "body": "> Most weapons are viable in most maps\n\nYou can say this about any COD game ever. In a typical public match, you can always use almost anything and do decently well if you're a solid player.\n\nThe MP5 and M4 have dominated the game since launch.\n\nThe 725 and claymores ruined the game for a month after launch. There was the whole snakeshot debacle. RPG's/explosives are still ez free kills. Dead Silence is a crutch field order against people with a pair of headphones because of how loud footsteps are. Ghost works even when you aren't moving.\n\nYeah, the balancing isn't good.", "created_utc": "1599339544.0", "edited": "1599340418.0", "id": "g45y9og", "is_submitter": "False", "link_id": "t3_in6m5n", "parent_id": "t1_g45wjms", "score": "2", "subreddit": "blackopscoldwar", "subreddit_id": "t5_2abod4"}, {"author": "Loud_County", "body": "Dude, who cares if the bajillion attachments cause balancing issues, or the maps are giant with a million angles or corners for people to sit in as they pinpoint your elephant footsteps, or that spawns are still busted 10 months after launch in modes like HP--it has a shared narrative and cool skins :D!11!!!1!!\n\nSarcasm aside, I think the animations department, art team, sound design team, etc.,--basically every department besides the ones that had a say in how the game is balanced or the maps are designed--deserve a massive round of applause. Such a shame that the core game itself is just... not it.", "created_utc": "1599336610.0", "edited": "1599336835.0", "id": "g45s3fi", "is_submitter": "False", "link_id": "t3_in6m5n", "parent_id": "t1_g45mehx", "score": "2", "subreddit": "blackopscoldwar", "subreddit_id": "t5_2abod4"}, {"author": "Loud_County", "body": "> Warning to activision:\n\nLMFAO", "created_utc": "1598415564.0", "edited": "False", "id": "g2vnp10", "is_submitter": "False", "link_id": "t3_igr4bg", "parent_id": "t3_igr4bg", "score": "480", "subreddit": "blackopscoldwar", "subreddit_id": "t5_2abod4"}, {"author": "Loud_County", "body": "Whenever school lunches are mentioned with people from other places, I always hear complaining about how shit it was and how it's comparable to prison food and I'm just like ... damn, I guess we had it made. Chicken tendies, spicy chicken sandwiches, ravioli, nachos, garlic pizza bread, cheese sticks... there was almost always something good to eat.", "created_utc": "1598322357.0", "edited": "False", "id": "g2rdp15", "is_submitter": "False", "link_id": "t3_ig38rv", "parent_id": "t3_ig38rv", "score": "24", "subreddit": "nova", "subreddit_id": "t5_2riyy"}, {"author": "Loud_County", "body": "> If MW was really that successful\n\nThere's no doubt MW is a big hit for them. They have the most players online in franchise history (BR being free helps), and their in-game content revenue was double what Black Ops 4 earned during the same time period. MW sales also grew by double-digit percentages compared to BO4. It has the highest average hours per player on any Call of Duty this generation.\n\n> they wouldn't release another CoD this year and just save the money on advertising for a cycle.\n\nRegardless of how successful MW is, they know they can make more on sales of a Black Ops reboot + in-game purchases vs in-game purchases on the current title.", "created_utc": "1597882252.0", "edited": "False", "id": "g25swri", "is_submitter": "False", "link_id": "t3_icw1me", "parent_id": "t1_g25q6y8", "score": "6", "subreddit": "blackopscoldwar", "subreddit_id": "t5_2abod4"}, {"author": "Loud_County", "body": "I'd give almost anything to get lost in a game again like I did from MW2-BO2. Those games consumed me and I wouldn't trade it for a thing.", "created_utc": "1597302078.0", "edited": "False", "id": "g1ays71", "is_submitter": "False", "link_id": "t3_i8torp", "parent_id": "t3_i8torp", "score": "561", "subreddit": "CallOfDuty", "subreddit_id": "t5_2rcq2"}, {"author": "Loud_County", "body": "I loved BO but BO2 had something for everybody. Comp players, pubstompers, snipers, trickshotters, knifers... almost everyone was satisfied. What a game.", "created_utc": "1596867855.0", "edited": "False", "id": "g0rlc4r", "is_submitter": "False", "link_id": "t3_i5peao", "parent_id": "t1_g0r7loe", "score": "36", "subreddit": "CallOfDuty", "subreddit_id": "t5_2rcq2"}, {"author": "Loud_County", "body": "Yeah, I've got no issue with the utility characters and adding some more wouldn't be an issue.\n\nThe free-info characters and the ones who can lock down entire portions of the map, even if they're not overpowered, are just annoying as fuck.", "created_utc": "1595896437.0", "edited": "False", "id": "fzgp3iu", "is_submitter": "False", "link_id": "t3_hz3ccd", "parent_id": "t1_fzgogd4", "score": "71", "subreddit": "VALORANT", "subreddit_id": "t5_2dkvmc"}, {"author": "Loud_County", "body": "It's only gonna get worse when they start running out of ideas if they stick to six agents per year.", "created_utc": "1595895689.0", "edited": "False", "id": "fzgnrt6", "is_submitter": "False", "link_id": "t3_hz3ccd", "parent_id": "t1_fzgjnts", "score": "903", "subreddit": "VALORANT", "subreddit_id": "t5_2dkvmc"}, {"author": "Loud_County", "body": "    Damage given: 92 in 1", "created_utc": "1586622521.0", "edited": "False", "id": "fn3kf4w", "is_submitter": "False", "link_id": "t3_fz7kwp", "parent_id": "t1_fn3j5oh", "score": "267", "subreddit": "VALORANT", "subreddit_id": "t5_2dkvmc"}, {"author": "Loud_County", "body": "It took Valorant for the Krieg to finally get nerfed LUL", "created_utc": "1586558152.0", "edited": "False", "id": "fn1ap40", "is_submitter": "False", "link_id": "t3_fyqi16", "parent_id": "t3_fyqi16", "score": "105", "subreddit": "GlobalOffensive", "subreddit_id": "t5_2sqho"}, {"author": "Loud_County", "body": "> and i also agree that jon did less actual singing, which wouldn't be as bad if it weren't juxtaposed with songs that do have great vocals.\n\nThis is my biggest gripe with his recent work. This is a guy who clearly has immense vocal talent (as showcased in songs like Wake Up, Good Morning, and Gravity), but he doesn't seem to enjoy using his range as much anymore.  He's doing a little too much of the talking-style thing. I still like some of his songs that feature it like 909 and projector, but it's a serious shame that he hides his voice so often.", "created_utc": "1582351849.0", "edited": "False", "id": "ficm6n7", "is_submitter": "False", "link_id": "t3_f7m53b", "parent_id": "t1_fic7frm", "score": "58", "subreddit": "eden", "subreddit_id": "t5_2s5fb"}, {"author": "Loud_County", "body": "> **Overkill**: Switched places with Killchain and will now be in Perk 2\n\nAbout fucking time.", "created_utc": "1581449334.0", "edited": "False", "id": "fhbt58k", "is_submitter": "False", "link_id": "t3_f2dg3x", "parent_id": "t3_f2dg3x", "score": "614", "subreddit": "modernwarfare", "subreddit_id": "t5_2r8qf"}, {"author": "Loud_County", "body": "This isn't noteworthy news. Even [Infinite Warfare](https://venturebeat.com/2017/01/19/2016-npd-call-of-duty-no-1-battlefield-no-2-on-2016s-list-of-best-selling-games/) was the best selling game (according to NPD) during the year it released. The Call of Duty name will keep the franchise at or near the top of sales for years to come no matter what.", "created_utc": "1576197372.0", "edited": "False", "id": "fam7ezp", "is_submitter": "False", "link_id": "t3_e9w8jd", "parent_id": "t3_e9w8jd", "score": "4", "subreddit": "modernwarfare", "subreddit_id": "t5_2r8qf"}, {"author": "Loud_County", "body": "> Look at Shoot House.\n\nShoot House seems like it's smaller than Nuketown. Of course it isn't gonna be *as* campy as the other maps. (I still manage to find people who try to post up in the top building with claymores and shotguns, unfortunately.)\n\nLook at Hackney Yard & Gun Runner. Both of them are standard small/medium three-lane COD maps, and they still turn into campfests half the time.  There are a few different reasons this game is so campy, but the TTK is obviously a huge contributor if even maps with a traditional COD design play out like that. \n\nIt's the same situation as Ghosts, where even smallish three-lane maps like Freight, Warhawk, Soverign, etc., were still plagued with campers, and that game even had Dead Silenec as a perk. This TTK is no good for the pace of the game.", "created_utc": "1574032502.0", "edited": "False", "id": "f7wef36", "is_submitter": "False", "link_id": "t3_dxneyg", "parent_id": "t1_f7w8k43", "score": "3", "subreddit": "modernwarfare", "subreddit_id": "t5_2r8qf"}, {"author": "Loud_County", "body": "I can't say I find the constant camping fun. I wouldn't mind the TTK if the game weren't infested with people sitting in buildings all game. I don't want Black Ops 4's atrocious time to kill, but something similar to BO2's or BO3's would be great for this game with how campy it's playing right now.", "created_utc": "1574030595.0", "edited": "False", "id": "f7w7bnq", "is_submitter": "False", "link_id": "t3_dxneyg", "parent_id": "t1_f7w120k", "score": "16", "subreddit": "modernwarfare", "subreddit_id": "t5_2r8qf"}, {"author": "Loud_County", "body": "> Most annoying thing about it is actually at its core it has the potential to be a great game.\n\nThe changes don't even seem like they'd be that hard to implement aside from the maps, which honestly seem like a lost cause.\n\nA throwback playlist with only remastered maps, shotguns and explosives nerf, loosening of SBMM brackets so we can actually party up with friends of all skill ranges, *slight* TTK increase so people aren't scared to touch their left stick, and minimap back to normal would make this game fun to play.", "created_utc": "1574025773.0", "edited": "False", "id": "f7vp49t", "is_submitter": "False", "link_id": "t3_dxneyg", "parent_id": "t1_f7unqb8", "score": "28", "subreddit": "modernwarfare", "subreddit_id": "t5_2r8qf"}, {"author": "Loud_County", "body": "It really feels like they're set out to make their own \"vision\" of this game, regardless of how the community feels.\n\nPeople complained about campers constantly in the beta (I didn't have a big problem with them then), then they went and *slowed* movement speed (and ADS speed too I think but I'm not certain). It's kind of mind-blowing.", "created_utc": "1572416690.0", "edited": "False", "id": "f5s8mo7", "is_submitter": "False", "link_id": "t3_dp22bx", "parent_id": "t1_f5s42om", "score": "6", "subreddit": "modernwarfare", "subreddit_id": "t5_2r8qf"}, {"author": "Loud_County", "body": "> I dont want an ac130 to go to someone that didnt earn it.\n\nThe fuck? They earned it by getting 1250 score in a single life. You can only cap so many flags or HQs in a single life. It's not like people would be farming the OBJ to get ez streaks. It would still take a long kill streak to get them. \n\n> Scorestreaks are for the pogs and kill streaks are for the grunts\n\nCan someone translate this pls", "created_utc": "1572299371.0", "edited": "False", "id": "f5nesxj", "is_submitter": "False", "link_id": "t3_dof3bd", "parent_id": "t1_f5ndu5v", "score": "12", "subreddit": "modernwarfare", "subreddit_id": "t5_2r8qf"}, {"author": "Loud_County", "body": "Imagine trying to reward objective play so DOM games don't wind up playing like extended-length TDM matches. So dumb lol. \n\n\n^/s", "created_utc": "1572298889.0", "edited": "False", "id": "f5ncvwf", "is_submitter": "False", "link_id": "t3_dof3bd", "parent_id": "t1_f5nb1tb", "score": "18", "subreddit": "modernwarfare", "subreddit_id": "t5_2r8qf"}, {"author": "Loud_County", "body": "I would throw Hackney Yard in there as it seems to be a somewhat standard three lane map too.\n\nIn Ghosts, the only maps that weren't consistently shit on for being trash/a big, disorganized mess were Warhawk, Soverign, Strikezone, Octane, and Freight. You guessed it--they were just about the only small/medium-sized three lane maps.\n\nThey've strayed from the proven formula present in the all-time favorite COD maps far too much, and the backlash MW & Ghosts have gotten regarding maps is the price they're paying.", "created_utc": "1572242881.0", "edited": "1572243362.0", "id": "f5jvkng", "is_submitter": "False", "link_id": "t3_do46vc", "parent_id": "t1_f5ju9o3", "score": "28", "subreddit": "modernwarfare", "subreddit_id": "t5_2r8qf"}, {"author": "Loud_County", "body": "Please let this be true for the *entire* life cycle of the game.", "created_utc": "1571002854.0", "edited": "False", "id": "f3nve85", "is_submitter": "False", "link_id": "t3_dhgvfa", "parent_id": "t3_dhgvfa", "score": "6600", "subreddit": "modernwarfare", "subreddit_id": "t5_2r8qf"}]