[{"author": "lrc1391", "body": "I’m definitely the same way. Today I tried to tell my Spanish teacher a story, and I couldn’t think of the word in Spanish. But I also couldn’t think of the words in English either haha", "created_utc": "1664245225.0", "edited": "False", "id": "iq1zbok", "is_submitter": "True", "link_id": "t3_xoslru", "parent_id": "t1_iq1z4hz", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "lrc1391", "body": "Yeah same. Sometimes I try to think of a word in Spanish, but I honestly can’t even think of the word in English either 🤣", "created_utc": "1664245050.0", "edited": "False", "id": "iq1yxsb", "is_submitter": "True", "link_id": "t3_xoslru", "parent_id": "t1_iq1b0sb", "score": "4", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "lrc1391", "body": "Hi! I really love traveling, and have already been to a lot of different countries, but I wanted to visit more Spanish speaking countries for immersion. I went this past July. I went to El Salvador, Nicaragua and Costa Rica. I stayed in hostels, Airbnbs, and stayed with friends too. All three are pretty affordable counties, but Costa Rica is definitely the most expensive. I definitely could have done the trip for cheaper, but some of the places I stayed at were more “upscale” and I did a lot of activities too. You could definitely get a bed in a dorm for like $10 a night in Nicaragua though if you want to do the trip on a budget. Food is pretty cheap too. Overall, it was a wonderful experience, and I’d highly recommend it! The Spanish varied a bit in each country too. The accent in Nicaragua was the most challenging for me, while the accent in Costa Rica was more neutral. I think my Spanish definitely improved because you’re forced to use it. Nobody in Nicaragua or El Salvador spoke English, but in the more touristy parts of Costa Rica, everyone knew English, but I still insisted on speaking Spanish. I’m hoping to do South America next summer. Message me if you have anymore questions!", "created_utc": "1664244846.0", "edited": "False", "id": "iq1yhi2", "is_submitter": "True", "link_id": "t3_xoslru", "parent_id": "t1_iq1xcxv", "score": "5", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "lrc1391", "body": "You’re right!", "created_utc": "1664225447.0", "edited": "False", "id": "iq0q5mx", "is_submitter": "True", "link_id": "t3_xoslru", "parent_id": "t1_iq0om87", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "lrc1391", "body": "Sometimes I can’t even think in my native language, so I feel this too", "created_utc": "1664224802.0", "edited": "False", "id": "iq0og5i", "is_submitter": "True", "link_id": "t3_xoslru", "parent_id": "t1_iq0burf", "score": "17", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "lrc1391", "body": "Well I’m glad I’m not the only one! I’m sure it’s pretty common, but I have no idea why it happens sometimes", "created_utc": "1664224755.0", "edited": "False", "id": "iq0oblw", "is_submitter": "True", "link_id": "t3_xoslru", "parent_id": "t1_iq0m20x", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "lrc1391", "body": "Yeah sure, but for vocabulary I’d need a translator", "created_utc": "1663864975.0", "edited": "False", "id": "iphlpud", "is_submitter": "True", "link_id": "t3_xl3khe", "parent_id": "t1_iphk4b8", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "lrc1391", "body": "I mean from day 1 she wanted to use only Portuguese so I don’t think she expected anything of me. Also, the approach you explained seems a lot more reasonable", "created_utc": "1663863111.0", "edited": "False", "id": "iphgqij", "is_submitter": "True", "link_id": "t3_xl3khe", "parent_id": "t1_iph88wp", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "lrc1391", "body": "Prague without a doubt", "created_utc": "1662665624.0", "edited": "False", "id": "inmo9r6", "is_submitter": "False", "link_id": "t3_x8wiw2", "parent_id": "t3_x8wiw2", "score": "2", "subreddit": "travel", "subreddit_id": "t5_2qh41"}, {"author": "lrc1391", "body": "Probably, but I don’t don’t really drink", "created_utc": "1655300039.0", "edited": "False", "id": "icgbpvd", "is_submitter": "True", "link_id": "t3_vce333", "parent_id": "t1_icfo0ai", "score": "1", "subreddit": "friendship", "subreddit_id": "t5_2qsto"}, {"author": "lrc1391", "body": "I asked him if he meant as gifts or was he going to pay me back, and he told me I was very disrespectful to offer him a gift and then ask for payment. Like I meant a $20 gift, not a $500 bow 🤣", "created_utc": "1655057194.0", "edited": "False", "id": "ic41tf9", "is_submitter": "True", "link_id": "t3_vaoha6", "parent_id": "t1_ic41e37", "score": "2", "subreddit": "couchsurfing", "subreddit_id": "t5_2qs85"}, {"author": "lrc1391", "body": "No, actually it’s the other way around. He asked me to join him. I prefer to travel alone, but thought I’d give it a shot. So wanting to do my own thing maybe like 15% of the trip is self centered? I didn’t tell him I’m going to ditch him, I just told him I am going to need some alone time to do my own thing occasionally. I need my space sometimes, and two weeks with anyone is a lot. I just don’t want someone glued to my hip all the time. We also have some different interests. For example, he doesn’t like dancing but I do, so I’ll go out dancing by myself one night, and he can do his own thing. He also wants to do this 2 hour tour that’s $150. I’m not super interested, so while he goes and does that, I’ll meet my friend. Not seeing how any of this is an issue. It’s a lot of money for something I am not interested in. I wouldn’t expect him to fork over that much money to do an activity I want to do, but he doesn’t. I’d just go myself. We’re staying in the same Airbnb, just got different rooms, so we’re going to be together a lot. I didn’t say he’s going to ruin my vacation, but while planning, I just realized we are very different travelers. He also kind of made it seem like he’s an experienced traveler and knows what he’s doing to impress me, but I think he kind of embellished that a bit… I’m just trying to be mature and talk about our feelings and expectations ahead of time to avoid conflicts. I don’t see the problem with that 🤷🏼‍♀️", "created_utc": "1654963335.0", "edited": "False", "id": "ibzide4", "is_submitter": "True", "link_id": "t3_v9c0l3", "parent_id": "t1_ibzgduc", "score": "1", "subreddit": "travel", "subreddit_id": "t5_2qh41"}, {"author": "lrc1391", "body": "Why’s that?", "created_utc": "1654962262.0", "edited": "False", "id": "ibzg2ks", "is_submitter": "True", "link_id": "t3_v9c0l3", "parent_id": "t1_ibzfp0u", "score": "1", "subreddit": "travel", "subreddit_id": "t5_2qh41"}, {"author": "lrc1391", "body": "No, I get it. Well he’s been to 2 of these countries before, so he acted like he could show me around, but when we started planning, it became evident that he really didn’t know much about traveling. He also kind of makes things up to impress me, so I think he kind of lied to me about the extent of his travels to sound “cool” or whatever. He just traveled around with his then girlfriend the entire time. Anyway, I’m willing to compromise, but this particular tour he wants to go on is a $150 zip lining tour. I’m terrified of heights, and I think that’s a lot of money to spend for something I don’t want to do. If it was some $20 walking tour or whatever, I’d yo no problem, but that’s a lot of money for a college student for a 2 hour activity. Everyone is saying make sure it’s a good trip for him, but what about me? I’m spending all this money too!", "created_utc": "1654941911.0", "edited": "False", "id": "ibyjad3", "is_submitter": "True", "link_id": "t3_v9c0l3", "parent_id": "t1_iby6pr0", "score": "2", "subreddit": "travel", "subreddit_id": "t5_2qh41"}, {"author": "lrc1391", "body": "Lots of great suggestions! Thank you so much!", "created_utc": "1654919306.0", "edited": "False", "id": "ibxrpfr", "is_submitter": "True", "link_id": "t3_v9c0l3", "parent_id": "t1_ibxl9ev", "score": "1", "subreddit": "travel", "subreddit_id": "t5_2qh41"}, {"author": "lrc1391", "body": "You’re right, and made very good points. I’ll say all this to him. Thank you", "created_utc": "1654890315.0", "edited": "False", "id": "ibw66gz", "is_submitter": "True", "link_id": "t3_v9c0l3", "parent_id": "t1_ibw5qzx", "score": "2", "subreddit": "travel", "subreddit_id": "t5_2qh41"}, {"author": "lrc1391", "body": "You’re just like me 🤣", "created_utc": "1654889570.0", "edited": "False", "id": "ibw4hos", "is_submitter": "True", "link_id": "t3_v9c0l3", "parent_id": "t1_ibw4dmc", "score": "3", "subreddit": "travel", "subreddit_id": "t5_2qh41"}, {"author": "lrc1391", "body": "That’s a good way to look at it! Thank you! :)", "created_utc": "1654889406.0", "edited": "False", "id": "ibw4497", "is_submitter": "True", "link_id": "t3_v9c0l3", "parent_id": "t1_ibw3xsl", "score": "2", "subreddit": "travel", "subreddit_id": "t5_2qh41"}, {"author": "lrc1391", "body": "Kind of my thoughts too. I’m going to try and keep an open mind, but two weeks with him is really going to be a lot…", "created_utc": "1654889213.0", "edited": "False", "id": "ibw3okj", "is_submitter": "True", "link_id": "t3_v9c0l3", "parent_id": "t1_ibw3ki5", "score": "1", "subreddit": "travel", "subreddit_id": "t5_2qh41"}, {"author": "lrc1391", "body": "You’re right. I am going to try and be more open minded. I was also thinking when we goes and does the tour, I could meet with some local friends as well, but once I said I wasn’t interested in it, he suddenly changed his mind. I just want him to be his own person and make his decisions, not rely on me for everything. We will hangout a lot, but I need my space too. I’m fine with compromising, but the tour he wants to do is like $150, which is kind of a lot for something I don’t want to do. If it was like $20, sure I’d suck it up and go, but it’s a lot for something I have no interest in doing.", "created_utc": "1654889180.0", "edited": "False", "id": "ibw3lyr", "is_submitter": "True", "link_id": "t3_v9c0l3", "parent_id": "t1_ibw2k8l", "score": "2", "subreddit": "travel", "subreddit_id": "t5_2qh41"}, {"author": "lrc1391", "body": "He honestly hasn’t really spoken up about anything at all… and honestly I feel like I’m already compromising a lot. For example, I almost always stay with local friends, and I had several invitations but declined so he’s not alone. Usually I don’t stay at hotels, but I’m doing it so he’s not alone. If I was by myself I’d be speaking Spanish 24/7, but I’m going to be speaking English a lot for him. I’d say that’s making compromises.", "created_utc": "1654887689.0", "edited": "False", "id": "ibw092x", "is_submitter": "True", "link_id": "t3_v9c0l3", "parent_id": "t1_ibvx3wp", "score": "-6", "subreddit": "travel", "subreddit_id": "t5_2qh41"}]