[{"author": "luellababalola", "body": "Are your oma and meme my moeke?", "created_utc": "1666467800.0", "edited": "False", "id": "itdb6n8", "is_submitter": "False", "link_id": "t3_yatzu4", "parent_id": "t1_itd9n7d", "score": "7", "subreddit": "belgium", "subreddit_id": "t5_2qhe6"}, {"author": "luellababalola", "body": "I teach French which I am still learning myself, but is my primary language. \n\nI mostly focus on grammar because that's what I am most comfortable with, and also the highest demand of my students. However, I also make them read, translate, speak, and write. \n\nMy students are young and learn the language because of their studies, so we mostly focus on what they *have to learn* in order to do well in their classes, however, I also like to include information about how a native speaker would say it just in case they'd ever be in such a situation. \n\nWhat you're saying *ir a* or the future tense is also something I've personally been thinking about. I also mostly use the future tense, unless I feel like *ir a* would sound better in the situation. I'd use both of them in my native language, so I don't completely cut *ir a* out.", "created_utc": "1666430513.0", "edited": "False", "id": "itb9ufe", "is_submitter": "False", "link_id": "t3_yacvqb", "parent_id": "t3_yacvqb", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "luellababalola", "body": "I had a friend ask me this question yesterday, although it was slightly different. **You're literally bilingua**l. If you were raised speaking English only, but living in Mexico and therefore speaking Spanish more often than English, Spanish would be considered your **primary language** = the language you use most/on a daily basis.", "created_utc": "1666382374.0", "edited": "False", "id": "it8vzg3", "is_submitter": "False", "link_id": "t3_y9yd55", "parent_id": "t3_y9yd55", "score": "8", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "luellababalola", "body": "I drove too slowly, so I went overtime, but it was no problem in the end. \n\nWhen parking, correct yourself. Don't get out of the parking lot because I made that mistake, which made me fail that certain manoeuvre. I also forgot to turn off the car, which resulted in the car not closing when I got out. You'll do 2 manoeuvres in total!\n\nLook in your mirrors at all costs, and all the time. I overdid it all the time, and it helps. \n\nYou get around 45 minutes.\n\nGood luck!", "created_utc": "1666124174.0", "edited": "False", "id": "isuj4t6", "is_submitter": "False", "link_id": "t3_y74yig", "parent_id": "t3_y74yig", "score": "1", "subreddit": "belgium", "subreddit_id": "t5_2qhe6"}, {"author": "luellababalola", "body": "Both tutors of mine are from that particular state (one lives in Veracruz, the other in Xalapa). It's $6 or $7. I could send you the link to their information in case you'd be interested. It's not free, but it helps me more than my language exchange partners :)", "created_utc": "1666123641.0", "edited": "False", "id": "isuhqbe", "is_submitter": "False", "link_id": "t3_y6ly2g", "parent_id": "t1_ist3gt0", "score": "1", "subreddit": "language_exchange", "subreddit_id": "t5_2tdbm"}, {"author": "luellababalola", "body": "It sounds like he has some serious issues, and he's trying to hide them by being mean to the people who love him. It's very unfortunate for him, and please, don't let him get away with it. His judgement is not correct. If strangers compliment you, you better be sure they're more objective than friends who often want to cheer you up. Please reconsider this friendship, and see what it does to you. If you'd decide to cut him out, you might start to feel more confident. \n\nWorking on your self esteem is quite hard, especially as it's vague. Make concrete plans to which you can stick, and try things out. I hope it'll all work out in the end <3", "created_utc": "1666123028.0", "edited": "False", "id": "isug3oa", "is_submitter": "False", "link_id": "t3_y5eenj", "parent_id": "t1_isln1s6", "score": "1", "subreddit": "askwomenadvice", "subreddit_id": "t5_30m5u"}, {"author": "luellababalola", "body": "I honestly think this friend of yours has an even lower self-esteem than you do. And the fact that he's been involved with you sexually also makes me raise my eyebrows, almost as if he'd be upset if someone would actually show interest in you. Anyway, as 9 people have commented before me, I'll focus on something else than this VERY problematic friend of yours; your low self-esteem.\n\nYou say you feel like you look above average (please leave out the fat - fat people are definitely beautiful too despite society saying otherwise). This means you probably are. \n\nWhat I find very difficult, and you mentioned deleting pictures from Instagram, is all the pretty girls and women you see on there. And not just Insta, but also TikTok, YouTube... you name it. I personally find it very difficult to not compare myself to them, and they do make me feel insecure too. Please remember that they do use filters and photoshop, and don't always look like that in real life. \n\nSecond thing to remember is that we're usually (I say usually because of your \"friend\") our own worst critics. We notice things about ourselves which others don't. You might think about your low self-esteem a lot of the time, but other's mightn't think twice about your body type or what you look like.\n\nI wish I could give you some actual advice, but I've been struggling with my self-esteem too, in a different way, and therefore don't really know. Just, please for your own sake, cut that friend of yours out because he's doing nothing but harm you even more.\n\nTake care, lots of love", "created_utc": "1665952868.0", "edited": "False", "id": "isl9hpq", "is_submitter": "False", "link_id": "t3_y5eenj", "parent_id": "t3_y5eenj", "score": "4", "subreddit": "askwomenadvice", "subreddit_id": "t5_30m5u"}, {"author": "luellababalola", "body": "Hi, I've got the same problem for not only native Spanish speakers, but basically all other nationalities besides my own. I just teach them how to say it correctly, and if they continue to say my name wrong, I just let it slide. It personally doesn't matter to me :)", "created_utc": "1665087128.0", "edited": "False", "id": "irbower", "is_submitter": "False", "link_id": "t3_xx9kc2", "parent_id": "t3_xx9kc2", "score": "3", "subreddit": "learnspanish", "subreddit_id": "t5_2rd6d"}, {"author": "luellababalola", "body": "Honey, you're not happy. I understand how difficult it will be if you have to break up with him, you've been together for 7 years, and have known each other for 14. I think it's important to understand that he's currently holding you back from living your life. You want to travel, eat delicious food, etc. On top of that, you lack attraction towards him. It won't take long before he notices. \n\nYou can, and are allowed, to break up with someone even though they're a good person. 24 - 7 is young, you've grown, he mightn't have or he might've, and people change. You want different things, or might've different goals, and those are valid reasons to let him go.\n\nDon't be afraid to be single. I will soon turn 22, so we're almost the same age, and have been single since I was 16. Just because no one you actively know isn't single, doesn't mean there aren't people out there where you live who are. \n\nIF you decide to let him go, it will probably be hard on you at first. But once you realize he's the reason you're holding back, you'll feel free. Choose YOU, whatever that's supposed to mean for you. Please think about that specific thing. \n\nGood luck!", "created_utc": "1664744886.0", "edited": "False", "id": "iqsvwze", "is_submitter": "False", "link_id": "t3_xtz4li", "parent_id": "t3_xtz4li", "score": "19", "subreddit": "askwomenadvice", "subreddit_id": "t5_30m5u"}, {"author": "luellababalola", "body": "Being friends with native speakers honestly. They encourage me to continue, and they are there whenever I have a question. It's personally quite difficult for me to learn a language without having friends who speak it.", "created_utc": "1664743199.0", "edited": "False", "id": "iqsriiw", "is_submitter": "False", "link_id": "t3_xtwkmi", "parent_id": "t3_xtwkmi", "score": "4", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "luellababalola", "body": "I'm so sorry you went through this. Sending all my love <3", "created_utc": "1664697734.0", "edited": "False", "id": "iqq4im6", "is_submitter": "False", "link_id": "t3_xtdz83", "parent_id": "t3_xtdz83", "score": "2", "subreddit": "belgium", "subreddit_id": "t5_2qhe6"}, {"author": "luellababalola", "body": "I'm in the same boat, and used to worry about it a lot after a Reddit post I saw in the vegan sub, but was originally posted on this one (or a similar one). However, I honestly don't mind it too much anymore. If people don't want to date me because of my dietary choices, it probably wouldn't have worked out in the long run anyway. That being said; I am always very surprised when people react well to it, talking about new friendships. It has never gone wrong tbh (and I know I'm lucky). It could also happen in a date-setting. So, keep doing you.", "created_utc": "1664115014.0", "edited": "False", "id": "ipuaqdq", "is_submitter": "False", "link_id": "t3_xnjryz", "parent_id": "t3_xnjryz", "score": "2", "subreddit": "dating_advice", "subreddit_id": "t5_2s4kl"}, {"author": "luellababalola", "body": "I'll give you my opinion on this, but it's just what works best for me.\n\nWhen I started learning Spanish at uni, we were also almost fully immersed. The professors would sometimes say something in French, but not so much. This personally didn't help me at all. I attended the classes to then go home and process everything we've seen on my own with the help of the internet.\n\nNow that I'm at a better level, and you will probably improve too, I can handle classes which are 100% taught in Spanish. But it is a no-go at the beginning for me personally.\n\nIf English is your native language, I wouldn't learn Portuguese through English, but through Spanish. \n\nGood luck :)", "created_utc": "1663926581.0", "edited": "False", "id": "ipkv2ye", "is_submitter": "False", "link_id": "t3_xl3khe", "parent_id": "t3_xl3khe", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "luellababalola", "body": "Yeah, exactly. *Ach* is more like *eh.*\n\nI think (in Flemish - important because our pause words sound French) we often say:\n\n* euhm (it's uhm)\n* allé.e.r\n* hmm\n* voilà\n* en ja\n* wel \n* bon", "created_utc": "1663604748.0", "edited": "False", "id": "ip2y6sm", "is_submitter": "False", "link_id": "t3_xhv42d", "parent_id": "t3_xhv42d", "score": "4", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "luellababalola", "body": "I study 4 languages at a time;\n\n* French is my \"native\" language at university, even though I'm not a native speaker.\n* I study English and German as part of my Master's.\n* I used to study Spanish during my Bachelor's and believe it'd be a pity to give up on this language now that I no longer need it. \n\nThere is absolutely no routine in my language learning journey. I use all of them daily. I guess I'm lucky to obligatory use 3 languages every single day, and I try to squish Spanish somewhere in between. \n\nFurthermore, I've made many schedules in the past; I'll focus on this language for 2 hours, I'll then move to this language for an hour, etc. You can try different approaches to language learning and see what helps best for you. I'm still trying to figure this out myself. Good luck :)", "created_utc": "1663175633.0", "edited": "False", "id": "iof5ih3", "is_submitter": "False", "link_id": "t3_xe0ovx", "parent_id": "t3_xe0ovx", "score": "8", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "luellababalola", "body": "I know for a fact this is at Bruxelles Central, hahaha.", "created_utc": "1662618369.0", "edited": "False", "id": "ink2g7s", "is_submitter": "False", "link_id": "t3_x7yakg", "parent_id": "t3_x7yakg", "score": "1", "subreddit": "belgium", "subreddit_id": "t5_2qhe6"}, {"author": "luellababalola", "body": "I read the responses to your question, and will give my two cents as well.\n\n1. Spanish probably is the cheapest language on italki due to, as some have said, the living cost being lower in Latin American countries compared to the States (or Europe, where I live). It's still legit, though.\n2. There are people who leave bad reviews, but there aren't many. \n3. I usually book a 30 minutes class before committing to a teacher. I teach on italki myself, and I don't mind people not coming back after a trial lesson. We sometimes don't vibe. A package consists of 5 lessons which isn't a lot anyway. This makes it easy to switch tutors. \n4. I'm also thight on money as I'm a student, and italki is my only income. My tutors cost less than 7 USD/hr, and I'm very happy with them.\n\nYou could also take a look at *Preply.* One of my tutors teaches on that platform too.", "created_utc": "1662368552.0", "edited": "False", "id": "in5wgn5", "is_submitter": "False", "link_id": "t3_x5uca1", "parent_id": "t3_x5uca1", "score": "3", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "luellababalola", "body": "You summed up the exact 3 things I struggle with most, too. Glad to read I'm not the only one!", "created_utc": "1662364446.0", "edited": "False", "id": "in5rko9", "is_submitter": "False", "link_id": "t3_x5gd22", "parent_id": "t1_in18phh", "score": "2", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "luellababalola", "body": "The subjuntivo is the one I'm currently struggling with the most. I understand its usuage because of French, but the main difficulty is the rules being different in both languages. I guess I just need to practice a bit more :)", "created_utc": "1662282280.0", "edited": "False", "id": "in188mv", "is_submitter": "False", "link_id": "t3_x5gd22", "parent_id": "t3_x5gd22", "score": "6", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "luellababalola", "body": "Passing an exam isn't the same as actually speaking the language in a native environment. \n\nI did my internship in a mostly French environment (bilingual city), and I had previously lived in France for 7 months to go to uni there. \n\nThe beginning is definitely the hardest, but it gets better quite fast! What helped me most was observing how people speak, and when it came to my internship; I prepared some vocabulary beforehand, even though that didn't really work. \n\nThe biggest challenge is not being able to talk about specific things related to the job. But then again, it gets better the longer you're there. \n\nB2-C1 level is definitely enough to work in a French speaking environment, no need to worry about that. Good luck!", "created_utc": "1662281130.0", "edited": "False", "id": "in16vr2", "is_submitter": "False", "link_id": "t3_x5gc6w", "parent_id": "t3_x5gc6w", "score": "7", "subreddit": "French", "subreddit_id": "t5_2rd5t"}, {"author": "luellababalola", "body": "It was the first time my friend mentioned it, so didn't sound very important, indeed. Thank you! :)", "created_utc": "1661854997.0", "edited": "False", "id": "imdaiz0", "is_submitter": "True", "link_id": "t3_wzwp5e", "parent_id": "t1_im8biz9", "score": "1", "subreddit": "German", "subreddit_id": "t5_2qq51"}, {"author": "luellababalola", "body": "Thank you very much! Yes, I am aware of the Dativ und Akkusativ pronouns, but I completely forgot about the Wechselpräpositionen. Thank you :)", "created_utc": "1661854955.0", "edited": "False", "id": "imdagzd", "is_submitter": "True", "link_id": "t3_wzwp5e", "parent_id": "t1_im5xj0y", "score": "2", "subreddit": "German", "subreddit_id": "t5_2qq51"}, {"author": "luellababalola", "body": "It does help, indeed. Wow, thank you for having taken the time to explain this to me :)", "created_utc": "1661854887.0", "edited": "False", "id": "imdadsd", "is_submitter": "True", "link_id": "t3_wzwp5e", "parent_id": "t1_im74w3f", "score": "1", "subreddit": "German", "subreddit_id": "t5_2qq51"}, {"author": "luellababalola", "body": "Wow, thank you. I completely forgot about those! I should revise some more grammar again as we no longer do so in uni. Thank you so much! :)", "created_utc": "1661854841.0", "edited": "False", "id": "imdabpw", "is_submitter": "True", "link_id": "t3_wzwp5e", "parent_id": "t1_im4qouh", "score": "1", "subreddit": "German", "subreddit_id": "t5_2qq51"}, {"author": "luellababalola", "body": "I wondered the same thing because it's normal to speak your native language at the B2+ level, of course.", "created_utc": "1661854715.0", "edited": "False", "id": "imda5p2", "is_submitter": "False", "link_id": "t3_wzur8k", "parent_id": "t1_im9wppk", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "luellababalola", "body": "I learnt all of them at school (and later in uni), and just put a lot of effort into them besides uni. It helps being a language student in a country which has 3 official languages :)", "created_utc": "1661696861.0", "edited": "False", "id": "im4qc81", "is_submitter": "False", "link_id": "t3_wzur8k", "parent_id": "t3_wzur8k", "score": "41", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "luellababalola", "body": "Idk if there are many Belgians in this thread, but Spanish isn't that common to teach in my country. It's mostly an option for those who study languages at high school or at uni as English, French, German, and Dutch are deemed more important.\n\nI had to choose another language to learn in my 3rd year of uni, and decided to study Spanish. I then made some friends irl and online, and they motivate me to keep going. So that's basically it :)", "created_utc": "1661449916.0", "edited": "False", "id": "ilrgh0c", "is_submitter": "False", "link_id": "t3_wxfsck", "parent_id": "t3_wxfsck", "score": "1", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "luellababalola", "body": "Hi hun, I've been in your exact same situation about 3 years ago.\n\nHad been vegan for almost 2 years at the time, but struggled so badly, and was so unhealthily, that I needed to get this treatment at the ED treatment clinic. I stayed there for 4 months, no more, and went vegetarian during that period. Once I got home, I slowly cut out animal products again.\n\nIt took me a long, long time to get to a minimum healthy weight, but I made it, and it feels so good. I am definitely much stronger, and being vegan helped me a lot. \n\nI don't really have any advice besides doing what's best for you. For me that meant eating animal products for about 4 months again. I felt guilty, but I wouldn't be alive right now if I hadn't done so.\n\nFeel free to dm me if you want to talk about it :)", "created_utc": "1660566017.0", "edited": "False", "id": "ikdgz6l", "is_submitter": "False", "link_id": "t3_wo74j2", "parent_id": "t3_wo74j2", "score": "2", "subreddit": "vegan", "subreddit_id": "t5_2qhpm"}, {"author": "luellababalola", "body": "I lived it, and it's not as great as you think it is. Sure, my skills improved immensly as I've got some extra motivation as I was the one who spoke his language. But I didn't speak well, so communication was difficult at the beginning. I know it'd be better now because I've improved a lot living there and will move back, but still. It also happened a 2nd time with another language, and again, I improved a lot because I was motivated. However, I don't think it's different from speaking the same language tbh\n\nOn the contrary, I do tutor a lot of people whose SO is someone who speaks my first language, and it's cute that they're putting in the effort. But that's everything haha", "created_utc": "1660565471.0", "edited": "False", "id": "ikdg05t", "is_submitter": "False", "link_id": "t3_woorw0", "parent_id": "t3_woorw0", "score": "4", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "luellababalola", "body": "Spanish because it's the only language I speak that I'm not fluent in yet. I guess it isn't too difficult to become fluent as so many people speak it and/or have learned it, but it'd be great.", "created_utc": "1660383601.0", "edited": "False", "id": "ik3z2k3", "is_submitter": "False", "link_id": "t3_wmtstf", "parent_id": "t3_wmtstf", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "luellababalola", "body": "Yes, go for it! I'm at the A2 level myself, and I feel like I've improved faster thanks to my tutors who help me a lot :)", "created_utc": "1660382805.0", "edited": "False", "id": "ik3y52l", "is_submitter": "False", "link_id": "t3_wmo80f", "parent_id": "t3_wmo80f", "score": "2", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "luellababalola", "body": "Same, even though I still struggle with this. I usually don't tell people unless we go out and food is involved", "created_utc": "1660381420.0", "edited": "False", "id": "ik3wi7k", "is_submitter": "False", "link_id": "t3_wmtnxo", "parent_id": "t3_wmtnxo", "score": "1", "subreddit": "vegan", "subreddit_id": "t5_2qhpm"}, {"author": "luellababalola", "body": "Example: Het is *maar* een paar minuten lopen. --> this means it only takes you a few minutes to walk to wherever you're going.\n\nI also personally use it when saying *volg mij maar* or *bel me maar.* It doesn't add any value, and I cannot translate it, but it just sounds a bit more friendly imo.", "created_utc": "1660312081.0", "edited": "False", "id": "ijzt2fz", "is_submitter": "False", "link_id": "t3_wml4xh", "parent_id": "t3_wml4xh", "score": "9", "subreddit": "learndutch", "subreddit_id": "t5_2t6rf"}, {"author": "luellababalola", "body": "Like the others said; money is the main reason people get student jobs. My parents give me some money every first day of the month, but as I need to pay everything myself, it definitely isn't enough. \n\nAs for your CV; it's not too important. I put mine on there just so it doesn't look empty (I've done one internship until now), but once I've done the last 2, I'll remove them. Most employers find jobs interesting if you've done them for over 3 months, so a one month job at a store doesn't add much value to your qualities.", "created_utc": "1660311714.0", "edited": "False", "id": "ijzs85g", "is_submitter": "False", "link_id": "t3_wmjnse", "parent_id": "t3_wmjnse", "score": "2", "subreddit": "belgium", "subreddit_id": "t5_2qhe6"}, {"author": "luellababalola", "body": "I agree. I've been dealing with some emotional distress and insomnia lately, and I have found conjugating verbs, or applying other rules, to be a great distraction too. It's something positive when something negative happens, even though it shouldn't lead to ignoring our issues, imo.", "created_utc": "1660311231.0", "edited": "False", "id": "ijzr4gn", "is_submitter": "False", "link_id": "t3_wmkwtr", "parent_id": "t3_wmkwtr", "score": "11", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "luellababalola", "body": "And they're quite cheap too because there's a lot of competition!", "created_utc": "1660250671.0", "edited": "False", "id": "ijwnjwr", "is_submitter": "False", "link_id": "t3_wm0ao2", "parent_id": "t1_ijwgygi", "score": "3", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "luellababalola", "body": "You tell both of them, especially the girl who's unaware your childhood friend came back into your life. She'll be crushed and hurt, but she deserves someone who'll choose HER for the full 100%, which you aren't doing. \n\nYou might lose both, but you don't want to lead anyone on. I bet you wouldn't like to be in either of their places.\n\nThis recently happened to me, and trust me, it's better to tell them. The sooner the better. \n\nI don't mean to come across as mean, but this is very important. I hope you make the right decision :)", "created_utc": "1660244529.0", "edited": "False", "id": "ijw7cwv", "is_submitter": "False", "link_id": "t3_wlfxax", "parent_id": "t3_wlfxax", "score": "1", "subreddit": "dating", "subreddit_id": "t5_2qhb1"}, {"author": "luellababalola", "body": "I have been learning French for 13 years, English for 10, German for 7, and Spanish for 1.\n\nI speak French, English and German comfortably (by which I mean I can talk about any topic).\n\nI am, even though it's slow.\n\nThough question as it depends on my level. I don't actively practise English, atm. I teach my native language in English, so I mostly practise it like that nowadays. Furthermore, I study in France, so I learn the language both passively and actively. Regarding German and Spanish, I like a mixture of all skills. I'll usually listen to a PodCast for around 30 minutes, then go to reading, followed by some grammar, followed by a lesson in a book I've got which combines grammar and vocab, writing, and speaking at last. This takes me around 2 hours for each language, which is okay as it's still summer.\n\nI can communicate with people from different cultures, and feel closer to them as I speak their language. However, I often study, and as I teach Dutch and French too, I am known as *that girl who speaks 5 languages.* It's okay, until people I don't know very well think of it as if it's my whole identity.", "created_utc": "1660233121.0", "edited": "False", "id": "ijvd2r3", "is_submitter": "False", "link_id": "t3_wler24", "parent_id": "t3_wler24", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "luellababalola", "body": "Personally, I prefer to text for a few days before we jump into a call (did this with my French language exchange partner who I've met irl twice ever since meeting online). This allows both of us to see if there's some kind of connection through text messages.  \nI am a tutor myself, and when I feel like the conversation is dying, I always have some interesting questions ready. I downloaded some from the internet, and they make it easier to keep the conversation going (especially as I talk to one of my students 6 hours a week).  \nA language exchange might be a big step, and I totally feel humiliated when talking to my tutors and language exchange partners. But I also know that I need to put myself out there and make mistakes to expand my current skills.\n\nI hope this was somewhat helpful. Good luck!", "created_utc": "1660232625.0", "edited": "False", "id": "ijvbrlv", "is_submitter": "False", "link_id": "t3_wlmli6", "parent_id": "t3_wlmli6", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "luellababalola", "body": "I unfortunately don't have any tips, but I'm in the same boat (will be 22 in November if it counts). I've had people tell me it's not normal to be inexperienced (also dating, partying...), but I have my reasons. I am just hoping some day a guy will like me for the person I am and won't be bothered by my inexperience.", "created_utc": "1660084163.0", "edited": "False", "id": "ijn4hz4", "is_submitter": "False", "link_id": "t3_wjshvc", "parent_id": "t3_wjshvc", "score": "1", "subreddit": "askwomenadvice", "subreddit_id": "t5_30m5u"}, {"author": "luellababalola", "body": "I couldn't agree more!", "created_utc": "1660083939.0", "edited": "False", "id": "ijn3yl3", "is_submitter": "False", "link_id": "t3_wkbjv7", "parent_id": "t1_ijn3f4r", "score": "2", "subreddit": "French", "subreddit_id": "t5_2rd5t"}, {"author": "luellababalola", "body": "Hello girlie, you probably won't get any answers to the questions you ask yourself. And if you do, they mightn't be true. Some people aren't who you thought they are, and that's okay. Stay true to yourself, stay away from him for some time (or forever if you feel like that's best).   \nThere's not just one person who's right for you, there are some more, and you'll meet them sometime in your life.   \nRemember that his comments and the way he looks at you now don't define your worth. Focus on healing first, your appearance is okay, and it's also okay for him to have preferences.   \nTake care.", "created_utc": "1660083582.0", "edited": "False", "id": "ijn33cy", "is_submitter": "False", "link_id": "t3_wjnsoj", "parent_id": "t3_wjnsoj", "score": "1", "subreddit": "askwomenadvice", "subreddit_id": "t5_30m5u"}, {"author": "luellababalola", "body": "I second this. They're there for you to correct you and take their time to explain any question you have. \n\nI have quite a few language exchange partners too, but once we become too close (friends), I find it to be hard too. \n\nSo yes, getting a tutor is definitely worth it imo!", "created_utc": "1660082597.0", "edited": "False", "id": "ijn0ow0", "is_submitter": "False", "link_id": "t3_wigagj", "parent_id": "t1_ijc49d8", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "luellababalola", "body": "Hello! I'm also at an A2 level (for Spanish), and have had 11 free talk sessions so far with one of my tutors. It's not that easy, but we usually ask each other how our weeks have been, and come up with a lot of things to talk about.\n\nMy other Spanish tutor asks me at the beginning of each session what I want to talk about, so I give him the topic, and we talk about that. I like to prepare something with a PowerPoint or something like that so I can complement my speaking by showing pictures.\n\nI'm also an italki teacher myself, and I ask my students if there's anything they want to talk about. Some (mostly Latin Americans) are really bubbly and fill the hour without me having to do anything. Some are more reserved, so I always have a few interesting questions written down.\n\nI suggest you tell your teacher what you'd like to talk about. I suppose there's a lot to learn about Mandarin, China, common interests... My German teacher and I don't get along that well (I found out after purchasing a package). We often read texts so I can practise my pronunciation, and we have something to talk about.", "created_utc": "1660082162.0", "edited": "False", "id": "ijmzmdk", "is_submitter": "False", "link_id": "t3_wjgplt", "parent_id": "t3_wjgplt", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "luellababalola", "body": "I find a B2 level to be fluent enough to start another language. I'd say to give it a try. You can stop learning German or Japanese if you feel like it's too hard. \n\nBtw, it takes quite long before you reach the C2 level in any language, so don't hold back on learning other languages just because you feel like you should be fluent. Give it a go, good luck :)", "created_utc": "1660081753.0", "edited": "False", "id": "ijmylk0", "is_submitter": "False", "link_id": "t3_wjmgms", "parent_id": "t3_wjmgms", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "luellababalola", "body": "Not a native French speaker, I am fluent though, and started learning Spanish at a French university if that counts. It didn't sound alike to me, and after having improved my Spanish, I still stand by my opinion as Spanish is pronounced exactly how you read it, and French isn't. However, they have a lot of words in common, and grammar rules are also alike. You just don't hear it imo", "created_utc": "1660081022.0", "edited": "False", "id": "ijmwrir", "is_submitter": "False", "link_id": "t3_wkbjv7", "parent_id": "t3_wkbjv7", "score": "17", "subreddit": "French", "subreddit_id": "t5_2rd5t"}, {"author": "luellababalola", "body": "I read all comments before commenting myself as I have been in the same situation.\n\nI started learning Spanish at university, which didn't go well at all. So, I reached out to native speakers because I thought they'd help me (they did, but not really). What they did do, is tell me a lot about their culture, the way they live, send me memes in Spanish. Them being my friends is my main source of motivation. Your partner could tell you all about Portugal/Brazil, and who knows if you'd actually enjoy learning the language too.\n\nDutch is my first language and I personally don't think it's important for my future partner to learn it even though my dad doesn't speak any other languages besides that one. Portuguese is a bigger language, and your partner told you it's important to him, so I'd try to give it another shot.\n\nNow, I'll tell you a bit more about my journey after being motivated to learn Spanish. \n\nFirst things first; I don't like learning a new language. It takes a lot of effort and time to understand the basics. But once I passed that, I started enjoying it. Here are some things I did after all the basics:\n\n* Get myself a book where I can continue to learn. The classes are short (take me around 30 - 45 minutes).\n* Follow Spanish teachers on Instagram. This allows me to practise Spanish at least a tiny bit in case I didn't find time throughout the day.\n* I got myself a tutor to practise my conversational skills (started at A1 level). I know you have the possibility to do this with your partner, I could do this with my friends too, but I feel more safe working with someone who actually takes the time to help me out, especially prononciation wise.\n* I also started listening to PodCasts, mostly about topics that I find interesting. You could also watch videos in case they're available.\n\nI overall now really enjoy learning a language that I disliked back in January. You'll have to get through those basics before starting some more \"fun\" things, even though language learning often remains frustrating. \n\nIf your Dutch is at a higher level (let's say B2 or so), it's also completely safe to start Portuguese. I really hope you find some motivation to dive into the language. Good luck en ook veel succes met Nederlands!", "created_utc": "1659452789.0", "edited": "1659453226.0", "id": "iingknt", "is_submitter": "False", "link_id": "t3_we41mc", "parent_id": "t3_we41mc", "score": "6", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "luellababalola", "body": "Honestly, no. I wouldn't mind if it were for some kind of project. I can only speak from personal experience, but I guess the majority of women are in this situation; we already get approached a lot, which, up until now, has always made me feel uncomfortable. I prefer to be left alone, which is why I have my earphones in all the time.\n\nHowever, if you find a girl staring at you, you could go up to her and flirt a bit, but still **don't ask these questions**. Ask her number and see where the conversation leads to.", "created_utc": "1659452213.0", "edited": "False", "id": "iinf3uq", "is_submitter": "False", "link_id": "t3_weayeb", "parent_id": "t3_weayeb", "score": "2", "subreddit": "dating", "subreddit_id": "t5_2qhb1"}, {"author": "luellababalola", "body": "Like some other commenters have said; if you feel like this friendship is worth saving, I'd sit her down and call her out (in a friendly way) about her behaviour. I did this with a friend of mine, it didn't go well, and decided it was enough. I'll tell you a bit more about that situation;\n\nShe was friends with my best friend, and I had just joined their class. The girl was never happy when I achieved something, made me feel ashamed of not having any experience when it comes to relationships and blamed it on me, being 1 hour late every time we'd hang out.... I called her out, but she made it sound as if I were the problem. I should support her choosing to excessively use Tinder instead of working on herself. The friendship slowly died because I wasn't reaching out to her any more. She was head over heals about a boy who used her for sex and wouldn't date her. I recently found out she's seeing him again. Anyway, enough was enough.\n\nI've basically evaluated all \"friendships\" of mine and concluded that half of them didn't make me happy. I distanced myself, stopped reaching out, and found out they didn't try to reach out to me either. I've never felt better.\n\nDo whatever makes you think is the best option based on what we've said. Good luck :)", "created_utc": "1659451893.0", "edited": "False", "id": "iineaiy", "is_submitter": "False", "link_id": "t3_we43a5", "parent_id": "t3_we43a5", "score": "1", "subreddit": "askwomenadvice", "subreddit_id": "t5_30m5u"}, {"author": "luellababalola", "body": "Hello! I recently put my phone to Spanish. All it did was introducing some new words to me that I happen to remember because I use them all the time. \n\nPodCasts are a great idea! I listen to one when getting ready in the morning and when going to sleep. Idk what level you're at, but I listen to PodCasts made for non-natives so they talk a bit slower and introduce some synonyms. I've mostly been listening to Spanish with Antonio even though I am not learning the Andalucian accent.\n\nListening has definitely increased my speaking skills too because I choose the same structures. \n\nI don't read any books, but I do read short stories as I am not proficient enough to read actual books. Hope this helps :)", "created_utc": "1659451117.0", "edited": "False", "id": "iincbcn", "is_submitter": "False", "link_id": "t3_wduvzb", "parent_id": "t3_wduvzb", "score": "2", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "luellababalola", "body": "I personally feel like putting less mins a day, but multiple times throughout the week, helps me best achieve my goals. I study German and Spanish every single day (1 hour German, 2 hours Spanish). It doesn't take too much effort, and I'm not burnt out. \n\nFurthermore, I guess *fluency* means something else to every individual, but it has always taken me some months before I was able to have a spontaneous conversation in my TL. However, I've noticed that, the earlier you include speaking, the faster you improve. \n\nMy uni gave me a B2 certificate in French before moving to France when I was 20. I started learning French at 9. Even though I tried my best, I still struggled a lot conversing with natives. My Spanish level is A2, and my conversational skills are the same as last year when I had just moved to France despite my level being worse. Hope this helps :)", "created_utc": "1659347037.0", "edited": "False", "id": "iihlqjt", "is_submitter": "False", "link_id": "t3_wd3jqa", "parent_id": "t3_wd3jqa", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "luellababalola", "body": "Hi there! My parents (non-vegans) take this one: [https://www.amazon.com/Testa-Omega-3-plant-Healthier-capsules/dp/B01NBIEPZQ](https://www.amazon.com/Testa-Omega-3-plant-Healthier-capsules/dp/B01NBIEPZQ). They're vegan, I used to take them myself, but stopped as I didn't need them. I just read it could be a good idea to take them. \n\nThese just contain Omega 3 though. I hope it's helpful anyway.", "created_utc": "1659194120.0", "edited": "False", "id": "ii9l5kp", "is_submitter": "False", "link_id": "t3_wbx932", "parent_id": "t3_wbx932", "score": "3", "subreddit": "vegan", "subreddit_id": "t5_2qhpm"}, {"author": "luellababalola", "body": "My story is similar to yours. I'm a language student, study Spanish on the side. I take language classes during summer, and also teach online and irl. Almost everything I do is related to language learning, and I talk to my family and friends about it pretty often. I'm glad you pointed out it being one of your identities because I feel like it's the same with me. \n\nGood luck in case you want to learn any others!", "created_utc": "1659192325.0", "edited": "False", "id": "ii9h699", "is_submitter": "False", "link_id": "t3_wbdmzl", "parent_id": "t3_wbdmzl", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "luellababalola", "body": "I used to take it until I got my blood taken and my levels were way too high. It's been perfect ever since I stopped.", "created_utc": "1659034196.0", "edited": "False", "id": "ii0xn70", "is_submitter": "False", "link_id": "t3_waeaas", "parent_id": "t3_waeaas", "score": "5", "subreddit": "vegan", "subreddit_id": "t5_2qhpm"}, {"author": "luellababalola", "body": "Vielen Dank für die Korrektur! :)", "created_utc": "1658749797.0", "edited": "False", "id": "ihkenyl", "is_submitter": "True", "link_id": "t3_w4leob", "parent_id": "t1_ihatfwt", "score": "1", "subreddit": "WriteStreakGerman", "subreddit_id": "t5_364k6p"}, {"author": "luellababalola", "body": "Vielen Dank für die Korrektur! :)\n\n&#x200B;\n\nDer Vater hat seiner neue Frau und ihre Tochter rausgeworfen, und ich denke, er war glücklich mit seiner Entscheidung! :)", "created_utc": "1658749765.0", "edited": "False", "id": "ihkelxj", "is_submitter": "True", "link_id": "t3_w5hhga", "parent_id": "t1_ihjf0gy", "score": "2", "subreddit": "WriteStreakGerman", "subreddit_id": "t5_364k6p"}, {"author": "luellababalola", "body": "Ja, stimmt. Mit dem Boot! Vielen Dank für die Korrektur! :)", "created_utc": "1658345952.0", "edited": "False", "id": "igyh0wk", "is_submitter": "True", "link_id": "t3_w3kho3", "parent_id": "t1_igy2cyh", "score": "1", "subreddit": "WriteStreakGerman", "subreddit_id": "t5_364k6p"}, {"author": "luellababalola", "body": "Vielen Dank für die Korrektur und Feedback! Alles klar! :)", "created_utc": "1658345908.0", "edited": "False", "id": "igygx76", "is_submitter": "True", "link_id": "t3_w2saq4", "parent_id": "t1_igxufqi", "score": "1", "subreddit": "WriteStreakGerman", "subreddit_id": "t5_364k6p"}, {"author": "luellababalola", "body": "I changed my phone to French back in 2020. It helped me as the vocab was part of my exams. Anyway, this post motivated me to change it to another language that I speak less well, so thanks :)", "created_utc": "1657789467.0", "edited": "False", "id": "ig3t1f9", "is_submitter": "False", "link_id": "t3_vyhtjx", "parent_id": "t3_vyhtjx", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "luellababalola", "body": "Happens to me too! I've been feeling ashamed because so many people have learnt multiple languages, and don't seem to have this problem. I'm \"glad\" we're not alone. Trouwens, mijn moedertaal is ook Nederlands, dus dat maakt het beter, haha.", "created_utc": "1657789131.0", "edited": "False", "id": "ig3smtf", "is_submitter": "False", "link_id": "t3_vyogz4", "parent_id": "t3_vyogz4", "score": "6", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "luellababalola", "body": "First of all, I love that you closed the distance :).\n\nYou're definitely right. I will discuss your very interesting points with him, my family, and his family. We're planning a videochat with all of us so my parents are reassured I'll be safe, and they can get to know me too. \n\nThank you so much, this was really helpful! :)", "created_utc": "1657568588.0", "edited": "False", "id": "ifrgxjy", "is_submitter": "False", "link_id": "t3_vwnpjq", "parent_id": "t1_ifqyhgk", "score": "1", "subreddit": "LongDistance", "subreddit_id": "t5_2s6ky"}, {"author": "luellababalola", "body": "This warms my heart, he seems so happy 🥺", "created_utc": "1655888623.0", "edited": "False", "id": "ida8man", "is_submitter": "False", "link_id": "t3_vhtj9i", "parent_id": "t3_vhtj9i", "score": "4", "subreddit": "vegan", "subreddit_id": "t5_2qhpm"}, {"author": "luellababalola", "body": "If I wouldn’t learn any of the languages I speak for over 2 years, I’d hit a plateau too. I most probably wouldn’t notice any improvements. \n\nI’d personally rotate between the different languages as much as possible. You learn a language by practising, and by using them constantly (every single day if possible). If possible, try to incorporate your 3 TLs into your daily routine. It can be really small, but every investment, no matter the size of it, will help you improve.\n\nThis is just a suggestion! Good luck!", "created_utc": "1655813726.0", "edited": "False", "id": "id696yx", "is_submitter": "False", "link_id": "t3_vhb1f5", "parent_id": "t3_vhb1f5", "score": "11", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "luellababalola", "body": "I am currently learning Spanish from all languages I know, besides my first. Most resources I’ve found are English - Spanish, but I find French - Spanish easier + I prefer the exercises on French websites. To include German, I translate whatever word I learn to German too. You could try what works best for you. You shouldn’t stick with one language to German just because you started learning it that way. Good luck!", "created_utc": "1655810502.0", "edited": "1655810693.0", "id": "id649ze", "is_submitter": "False", "link_id": "t3_vh9jdz", "parent_id": "t3_vh9jdz", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "luellababalola", "body": "Native Dutch speaker from Belgium here, so there are a few differences between the Netherlands Dutch, and Belgian Dutch. However, I’ve never had real struggles with German, besides some false friends (geil for instance haha). \n\nMy French friend speaks Dutch at B1 level, and struggles a bit with German as he mixes both languages. Idk how well you speak Dutch, but I’d say to be aware of that. Anyway, I think you should be just fine :)", "created_utc": "1655585711.0", "edited": "False", "id": "icvf7ry", "is_submitter": "False", "link_id": "t3_vesxsa", "parent_id": "t3_vesxsa", "score": "2", "subreddit": "German", "subreddit_id": "t5_2qq51"}, {"author": "luellababalola", "body": "Okay, so for Spanish, I follow:\n• charlemos.in.spanish\n• spanishccae\n• learnspanishwithmarta\n• spanishwithantonio_\n• laproflluvia\n\nFor French I follow:\n• frenchschooltv (I have been taking their conversation classes since April too)\n• the_frenchalien\n• lafrenchtribe\n\nFor German, I follow:\n• deutsch_eins\n• deutsch.training\n• fisnik.deutsch\n\nI don’t follow any accounts that specify in learning English, but I do enjoy content which occasionally appears on my feed and tackles mistakes natives make. It’s very interesting", "created_utc": "1655410005.0", "edited": "False", "id": "icmfgug", "is_submitter": "False", "link_id": "t3_vdmp85", "parent_id": "t1_icmbe8j", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "luellababalola", "body": "I find it helps. The accounts I follow for the languages I speak at a higher level post daily quizzes on vocab, and grammar. I get to practise like this every day.\n\nFor Spanish, however, I find it really interesting as people tend to speak a bit slower than natives, so I practise listening (and sometimes reading) when mindlessly scrolling through my feed/stories. \n\nI guess it’s just a good thing to add to your routine, but I don’t think you can actually learn a language through them. Just some rules + practising listening/reading.", "created_utc": "1655407861.0", "edited": "False", "id": "icmb338", "is_submitter": "False", "link_id": "t3_vdmp85", "parent_id": "t3_vdmp85", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "luellababalola", "body": "Hello, I’ve been in the same boat (but in French). I felt the insecurities too, especially as I had never had real conversations in the language outside of uni. Also, I tried to translate things I thought were funny literally, and they made no sense. Or I had to skip subjects because I didn’t know how to talk about them. This might be relatable to you. \n\nIt takes practise, and you get to practise with him. I’ve also noticed that my French got better way more quickly because I was motivated to have more meaningful conversations where I wouldn’t have to think too much about the grammar. \n\nGive yourself some time to become better at Spanish, and the insecurities will vanish over time :)", "created_utc": "1655239853.0", "edited": "False", "id": "icdj1qp", "is_submitter": "False", "link_id": "t3_vcbd7g", "parent_id": "t3_vcbd7g", "score": "9", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "luellababalola", "body": "Not sure if you’ll read this, but I also send 1 to 2 texts a week to a native Spanish woman I met on the streets in my village. I am in my early twenties, so it’s different as I’m a legal adult, but I told my parents, and all parties (my parents + her husband) think it’s fine. I cannot see what could possibly wrong with that. The girl just wants to learn Spanish", "created_utc": "1655126704.0", "edited": "False", "id": "ic794dy", "is_submitter": "False", "link_id": "t3_vb9sx0", "parent_id": "t3_vb9sx0", "score": "1", "subreddit": "relationship_advice", "subreddit_id": "t5_2r0cn"}, {"author": "luellababalola", "body": "Thanks for the tip! I’ve been listening to/watching DreamingSpanish for around 15-20 minutes a day. Mostly because I am for from ready for native content. I will follow an intensive course during summer though, so that’ll definitely help too!", "created_utc": "1654877053.0", "edited": "False", "id": "ibvbafj", "is_submitter": "False", "link_id": "t3_v8w7xn", "parent_id": "t1_ibv31zj", "score": "1", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "luellababalola", "body": "I’d personally love at least 2h a week, especially as I still need to learn a lot. But, I have quite a busy schedule working at my internship (for which I need to travel 4h a day), and other responsibilities. So, I’m happy with my 1h a week. It’s better than nothing :)", "created_utc": "1654873244.0", "edited": "False", "id": "ibv282u", "is_submitter": "False", "link_id": "t3_v8w7xn", "parent_id": "t1_ibv1hin", "score": "2", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "luellababalola", "body": "This might sound stupid as my level in Spanish is really, really low. But talking 1h/week with my italki teacher has done wonders to my comprehension, but also speaking. She corrects me all the time, and I see a much faster progress than if I’d just work with my workbooks all the time.", "created_utc": "1654860364.0", "edited": "False", "id": "ibud2jf", "is_submitter": "False", "link_id": "t3_v8w7xn", "parent_id": "t1_ibtb8hv", "score": "5", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "luellababalola", "body": "Hey, I went vegan at 17 too (we’re the same age, though my vegan anniversary is in winter). It’s sad they reacted like that. But, you’re doing great, and I’m proud of you.", "created_utc": "1654632921.0", "edited": "False", "id": "ibj0tes", "is_submitter": "False", "link_id": "t3_v6ehr2", "parent_id": "t3_v6ehr2", "score": "1", "subreddit": "vegan", "subreddit_id": "t5_2qhpm"}, {"author": "luellababalola", "body": "Not a love story, but I just got back from staying at a friend of mine who I met on Reddit back in January. This was the second time (I met him when visiting his city 3 weeks after we got to know each other), and this weekend in the city he’s currently studying in. He’ll visit me in August :)\n\nFunny thing is that he at first thought I was an old man, whereas I’m actually just one year older than him (and a girl, in case it matters).", "created_utc": "1654544038.0", "edited": "False", "id": "ibehyt9", "is_submitter": "False", "link_id": "t3_v5vj8l", "parent_id": "t3_v5vj8l", "score": "1", "subreddit": "wemetonline", "subreddit_id": "t5_2svz3"}, {"author": "luellababalola", "body": "I learnt English (at 13), French (at 9) and German (at 15) at school. I started Spanish around 1 year ago, as I had to choose another language at university. However, just continuing learning them at school really wasn’t enough motivation-wise. \n\nFrench: I will most likely continue my studies in France (will get the uni’s answer in a week!), so I need it academically, but also professionally as I am currently doing an internship in a French speaking environment, and there’s a chance it’ll be the language spoken at my future job as well. \n\nGerman: for my studies. I also just really like the language, and it’s close to my first one. Also, one of my closest friends is a native speaker.\n\nSpanish: I’d like to work in the humanitarian field, so Spanish would be a great asset. And I unexpectedly fell for a guy who’s first language is Spanish, so there’s that too.", "created_utc": "1654075720.0", "edited": "False", "id": "iarmu3j", "is_submitter": "False", "link_id": "t3_v1u6m6", "parent_id": "t3_v1u6m6", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "luellababalola", "body": "Yeah, exactly! One of my closest friends went vegan at the same time as I did. She’s been with her boyfriend for almost 2 years, and he decided to go vegan 1.5 months ago :)", "created_utc": "1654007288.0", "edited": "False", "id": "ianzufa", "is_submitter": "False", "link_id": "t3_v1kc03", "parent_id": "t1_ianyzva", "score": "8", "subreddit": "vegan", "subreddit_id": "t5_2qhpm"}, {"author": "luellababalola", "body": "My sister studies criminology, and she said it’s because more cases are being brought to light. Sweden (or Finland, I forgot) is considered to be the country with the highest criminality rate, but it’s really just because people go to the police and press charges.", "created_utc": "1653652745.0", "edited": "False", "id": "ia6lpcu", "is_submitter": "False", "link_id": "t3_uyv73a", "parent_id": "t3_uyv73a", "score": "10", "subreddit": "belgium", "subreddit_id": "t5_2qhe6"}, {"author": "luellababalola", "body": "Hello! I studied in France with my B2 certificate, so I know what you’re talking about.\n\nFollowing classes is passive learning. In order to improve your German, you’ll have to actively spend time doing so. To me, it meant going through all grammar rules, so I could practise them again, and make less mistakes afterwards. But also reading in French, watching videos in French (for German I love Easy German on YouTube)… University stuff is more difficult as the words they use are often words you don’t know at all. \n\nI made a lot of French friends. I wouldn’t consider them partners I practise with, which I did of course, but they wouldn’t correct me. That’s why I’ve got one close internet friend who would answer all of my (stupid) questions.\n\nAlso, might sound stupid, but is very effective: stop comparing your German level to your levels of English and Spanish. It indeed would be easier, but you’re studying in German now, so there’s no way to avoid that. Try to accept that it’s difficult, and will be more difficult to you than it is for Germans, and that’s okay. It’s only been 3 weeks, my first few months were hell, until I stopped feeling sorry for myself. My French has gotten a LOT better ever since. \n\nSpanish is a very popular language in Germany. You might want to find another student at uni (maybe another chemical engineering student) who could help you, and you could help them with Spanish. It’s just an idea.\n\nGood luck, don’t give up. You’ll get there!", "created_utc": "1653392864.0", "edited": "False", "id": "i9so9vd", "is_submitter": "False", "link_id": "t3_uw4nvw", "parent_id": "t3_uw4nvw", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "luellababalola", "body": "Add « salut » and « ça va » to the list to make it complete", "created_utc": "1653248362.0", "edited": "False", "id": "i9lla22", "is_submitter": "False", "link_id": "t3_uvb5s3", "parent_id": "t1_i9ktrlh", "score": "3", "subreddit": "learndutch", "subreddit_id": "t5_2t6rf"}, {"author": "luellababalola", "body": "This thread is fun, haha. Let me add another one;\n\nWalking = wandelen (BE), lopen (NL)\nRunning = lopen (BE), rennen (NL)\n\nNot sure though, but I think in the Netherlands, people talk about « een bakje koffie » whereas in Belgium, we say « een tasje koffie » when referring to « a cup of coffee »", "created_utc": "1653248311.0", "edited": "False", "id": "i9ll62j", "is_submitter": "False", "link_id": "t3_uvb5s3", "parent_id": "t3_uvb5s3", "score": "2", "subreddit": "learndutch", "subreddit_id": "t5_2t6rf"}, {"author": "luellababalola", "body": "Keep going! I’ve often been unmotivated because of bad grades too. Practise whatever went wrong on your test, and you’ll soon get its structure.\n\nAlso, assuming you’re in Germany when looking at your post history, I can tell you that the structure of sentences in Dutch and German aren’t alike. It might take some time, but don’t give up yet. You can do this!", "created_utc": "1652858288.0", "edited": "False", "id": "i91pybn", "is_submitter": "False", "link_id": "t3_us6a7k", "parent_id": "t3_us6a7k", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "luellababalola", "body": "As you’re learning French; I moved to France for my studies in September, am doing my internship in a French environment, and am preselected for another French University. I also teach French, and am at the C1 level. It’s safe to say that I use French more than any other language. However, I still make mistakes, mostly when using words that’re less common. It’s frustrating, and it makes me doubt myself. But it’s normal. I make the same mistakes in German (also C1). None of my friends mind the mistakes I make, and you shouldn’t be too hard on yourself either :)\n\nEdit: grammar", "created_utc": "1652816152.0", "edited": "False", "id": "i8zgdk5", "is_submitter": "False", "link_id": "t3_urgklu", "parent_id": "t1_i8y5nc5", "score": "4", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "luellababalola", "body": "Came here to learn, so thanks Taalnazi. :)", "created_utc": "1652677033.0", "edited": "False", "id": "i8s9mf3", "is_submitter": "False", "link_id": "t3_uq6yeh", "parent_id": "t1_i8r3k23", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "luellababalola", "body": "I do, I get my point across, but it just doesn’t sound very native-like. Anyway, don’t let it hold you back to speak. That’s how you learn best :)", "created_utc": "1652653475.0", "edited": "False", "id": "i8qza5h", "is_submitter": "False", "link_id": "t3_uq7yt1", "parent_id": "t3_uq7yt1", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "luellababalola", "body": "Another Dutch speaker here. Do you say someone “has a talenknobbel” or do you say “is a talenknobbel”? I’ve personally never used the first, so I’m curious.", "created_utc": "1652653222.0", "edited": "False", "id": "i8qyq9l", "is_submitter": "False", "link_id": "t3_uq6yeh", "parent_id": "t1_i8q9r9i", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "luellababalola", "body": "I tell them I speak Dutch, but they “correct” me and say I speak Flemish. People think these two are different languages, haha. They also always think we speak French only", "created_utc": "1652642152.0", "edited": "False", "id": "i8q9jmh", "is_submitter": "False", "link_id": "t3_uq1gta", "parent_id": "t3_uq1gta", "score": "2", "subreddit": "belgium", "subreddit_id": "t5_2qhe6"}, {"author": "luellababalola", "body": "This is insanely beautiful, well done!", "created_utc": "1652123378.0", "edited": "False", "id": "i7yem1q", "is_submitter": "False", "link_id": "t3_ulwnt3", "parent_id": "t3_ulwnt3", "score": "4", "subreddit": "oilpainting", "subreddit_id": "t5_2swg6"}, {"author": "luellababalola", "body": "Hoi hoi, ik zou een studentenbegeleider contacteren. Zij weten hier het meeste over. \n\nAls het lang geleden is, zou het kunnen dat je inderdaad een schakelprogramma moet volgen. En waarschijnlijk ook in het geval dat je bachelor niets te maken heeft met de master die je wil doen.\n\nVeel succes!", "created_utc": "1652108654.0", "edited": "False", "id": "i7xe1xh", "is_submitter": "False", "link_id": "t3_ulq90m", "parent_id": "t3_ulq90m", "score": "6", "subreddit": "belgium", "subreddit_id": "t5_2qhe6"}, {"author": "luellababalola", "body": "I tell my friends “hou van u” or “zie u graag” all the time. However, I believe you can find love in the small things:\n• wees voorzichtig\n• bel me wanneer je thuis bent\n• giving a hug\n• I also just tell them how grateful I am or how much I appreciate them\n\nThe list goes on, and on, and on.", "created_utc": "1652108459.0", "edited": "False", "id": "i7xdktp", "is_submitter": "False", "link_id": "t3_ulpymt", "parent_id": "t3_ulpymt", "score": "1", "subreddit": "belgium", "subreddit_id": "t5_2qhe6"}, {"author": "luellababalola", "body": "It’s been approximately one year since I started learning Spanish, but I’ve never been very motivated until I met native speakers. \n\nBoth in real life and online natives have shared so much about their culture, and countries, the music they listen to, the food they eat,… It’s really impressive (especially as I live in a country where there’s almost no culture at all). Their hospitality is incredible, and out of all languages I’ve learnt, I find Spanish speakers to be the kindest. They don’t mind mistakes too much (and I make a lot of them), are ready to help, and have an overall positive vibe. \n\nI also love that it’s closely related to French. I know the rules of that language well, and it makes learning new grammar fun (because I love French). I enjoy comparing the languages to each other to find similarities. \n\nI might look back at this question once I reach a bit of fluency.", "created_utc": "1652097158.0", "edited": "False", "id": "i7wq6io", "is_submitter": "False", "link_id": "t3_ulm40d", "parent_id": "t3_ulm40d", "score": "10", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "luellababalola", "body": "My story definitely isn’t as extreme as majority of these, but when I was 18, I was seeing yet another therapist because of my severe eating disorder combined with severe depression. My therapist cried because, after knowing everything I’ve been through, she felt as if I couldn’t be helped. My body was close to completely giving up, and it still doesn’t function as it should due to the unhealthily weight I was at for years. Anyway, I’m doing alright these days, that’s what counts :)", "created_utc": "1651781309.0", "edited": "False", "id": "i7gvis4", "is_submitter": "False", "link_id": "t3_uirrii", "parent_id": "t3_uirrii", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "luellababalola", "body": "You definitely aren't stupid! It's normal. I personally feel like it's easier to get better at speaking a language in the beginning because you learn a lot of \"easier\" things. Once you're at a higher level like yourself, it takes more time. \n\nIf moving to an anglophone country would be an option, you could definitely do that. I had a friend who spoke no English, but went to Canada before Covid started. He's in Mexico now, has travelled from Canada, to the US, to Mexico, and he's slowly loosing his Dutch. My French got much better living in France.\n\nHowever, I do know it's not possible for everyone. Don't be too hard on yourself. You'll get there. Continue to immerse yourself as much as possible.\n\n\\----\n\nThank you for explaining how you're learning Russian. I know absolutely nothing about the language. Anyway, good luck with both of them. I believe in you, don't lose hope in yourself, too. You got this :)", "created_utc": "1651734809.0", "edited": "False", "id": "i7ecvw9", "is_submitter": "False", "link_id": "t3_udpyni", "parent_id": "t1_i6iovlp", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "luellababalola", "body": "I like to think it helps when they correct my mistakes, but I understand why it might help less than I think. How's it going for you? Do you feel like it helps you? Or are you still debating whether you'll find some?", "created_utc": "1651734467.0", "edited": "False", "id": "i7echbr", "is_submitter": "False", "link_id": "t3_ug0lm7", "parent_id": "t1_i7dqmxl", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "luellababalola", "body": "Hello!\n\nI’m studying a double degree, and can tell you the differences between Belgium and France. I read you’re in Scotland, I have no idea how it works there. Anyways, in Belgium, I studied English - French - German, and all classes of mine were in my TL. In France, where I studied English - German - Spanish, they talk 80% in the TL, 20% in French to clarify. \n\nIt is very organised, however, I’ve learnt more studying on myself than I did at Uni.", "created_utc": "1651650771.0", "edited": "False", "id": "i79mg5j", "is_submitter": "False", "link_id": "t3_uhcbq9", "parent_id": "t3_uhcbq9", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "luellababalola", "body": "I learn one hour a day. When I’m on the train, I basically listen for 20 minutes, and do grammar & vocab for about 40 minutes. When I’m at home, I do the same, but I read the questions aloud, and if I find some extra time, I send a voice message to my language exchange partner. I just try to combine as many skills as I can, and it’s been working well so far", "created_utc": "1651596908.0", "edited": "False", "id": "i76j0gj", "is_submitter": "False", "link_id": "t3_uhegiw", "parent_id": "t3_uhegiw", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "luellababalola", "body": "Some people already suggested it, but paying for a tutor is a really good idea. I do this to practice my German as I cannot find any Germans (or those who speak it as their first language) who’re willing to participate in a conversation, or don’t ghost me after a few days.", "created_utc": "1651458079.0", "edited": "False", "id": "i6zbkby", "is_submitter": "False", "link_id": "t3_ugbt7r", "parent_id": "t3_ugbt7r", "score": "4", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "luellababalola", "body": "It does (still doing so), and they’ve all become friends.\n\nI’ve got one who I help with Dutch, he helps me with French in return. This probably is the best exchange I’ve got considering my level of the language, and him being at A2-B1.\nI’ve got another one who reached out to me for French. I don’t help him with anything, but we talk daily, and have called multiple times. I can feel my French getting better.\nI’ve also got, let’s say, one partner who helps me with Spanish, and I help him with English. However, his level of English is great, and my Spanish isn’t really. \n\nBut, because they’ve become friends, they don’t really correct me whenever I make a mistake. The one who speaks Spanish does, but the French don’t. They understand what I mean, it just doesn’t sound very French, so that’s a pity, really.", "created_utc": "1651456285.0", "edited": "False", "id": "i6z83x1", "is_submitter": "False", "link_id": "t3_ug0lm7", "parent_id": "t3_ug0lm7", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "luellababalola", "body": "Thanks, this is some really good advice. Don't give up, you're doing well. Wish you all the best :)", "created_utc": "1651252480.0", "edited": "False", "id": "i6ot63o", "is_submitter": "False", "link_id": "t3_ueo7yx", "parent_id": "t3_ueo7yx", "score": "6", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "luellababalola", "body": "Yes, B2 is a really high level (imo). That's why finding content that interests you might increase your English knowledge. It'll be more difficult when learning words related to something that doesn't interest you (your example about cooking). I've done the same in French; I needed to learn about certain things about which I couldn't care less. I still remember the words, but it's harder, yet doable. \n\nDifferent things will be helpful to different people. OP, you'll need to try different methods and see what works for you.", "created_utc": "1651139883.0", "edited": "False", "id": "i6ijudh", "is_submitter": "False", "link_id": "t3_udpyni", "parent_id": "t1_i6igfbu", "score": "6", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "luellababalola", "body": "Hello there, this is extremely long, so thank you for reading all this if you do.\n\nFirst of all, I am a native Dutch speaker who's learning English, French, German, and Spanish. I recently received a C1 certificate for the first three, and am still at A1 for Spanish. French has been the language I use in a professional context ever since this year, and will be the language for two more years. I need English and German for my studies. Learning Spanish has become a hobby.\n\nI'll start with English. There isn't much to say. It's easy to be exposed to the language online, so I feel like the combination of English classes + my online presence made it almost effortless to learn the language.\n\nThe struggle with French was real. I would've given up on the language if I wouldn't have chosen to study languages at uni. What motivated me is the degree I am doing. I needed to get to a higher level in order to study in France, and started to implement small changes into my days. However, this didn't change much grammatically speaking. It's when I moved to France in September 2021, and being immersed because of living with a native, and being surrounded by natives, that I started to pay attention to their ways of speaking. I noticed quite quickly what remained difficult, and started to actively work on that in January. 80% of the people at my internship are native French speakers, so I practise every day, including with my internet, and in real life friends. About 5 weeks ago, I started teaching the language, and I must say that I absolutely love French right now.\n\nGerman was quite easy to learn. Its grammar is consistent (not like in English or in French), and it's closely related to Dutch. The only thing I struggle with is speaking, for which I lost motivation, but have now booked classes on italki with a native. There's a lot of content out there, and I personally still love *Easy German* on YouTube because you hear natives use expressions they don't teach you in school, and it allows me to use their expressions to talk about the topics they tackle in the videos. This is something you can do for every language.\n\nMy journey with Spanish isn't very long, but it has been hard. It's also the one I remember best as I started only started learningin July 2021. I bought a 3 month subscription on Babbel, which taught me the basics, and was very useful at the beginning. However, I hated knowing how to say *you're friends are really tall,* but the site/app never provided the word for short. When I started taking classes at uni, I was demotivated because it was more difficult than Babbel made it seem. I followed extra classes at uni, which didn't help, but I at least got some sense of immersion.In January, I was really demotivated (again) because I felt like all I could do was talk about myself, and I wanted my level to be at least as good as my German, preferably the other languages, too. It's basically thanks to my two Mexican language exchange partners who have motivated me to learn Spanish by telling me about their culture, but also because I'm in awe when they speak Spanish, and one of them doesn't feel comfortable speaking English.\n\n&#x200B;\n\nWhat basically helps me most is writing down **why I want to learn a certain language and reminding myself what I'm doing it for**. For me it's the following (could give you ideas):\n\n* English: to communicate freely with people from all around the world, and make connections I wouldn't be able to make by speaking Dutch.\n* French: for professional and personal development. I'll do my Master's in French, and therefore really need to speak it at a good level. Also, majority of Dutch speaking people don't like French because it's so difficult, and I like to teach.\n* German: mostly professional. However, one of my closest friends is a native German speaker, and I'd love to be able to communicate with her and her boyfriend in the future. I'd also love to live in Vienna for a few years.\n* Spanish: it's is the 2nd most learnt language in the world, and is spoken in 23 countries. I'd love to work in the humanitarian field, and speaking the language would open many doors for me. Also, so many people have learnt how to speak the language. If they can do it, so can I.\n\n&#x200B;\n\nI'm sorry this is so long, but language learning goes with ups and downs. There is no right way to do it. You will loose motivation, but you'll also find it again for whatever reason. It's important to keep your goals in mind.\n\n&#x200B;\n\nAlso, another tip; don't set the goal *I want to reach B2 in 6 months.* No, you should make it *I want to reach B2 in six months and I'll do this, this, this, and this in order to achieve it.* This is way more effective.\n\n&#x200B;\n\nGood luck and have fun! :)", "created_utc": "1651139384.0", "edited": "False", "id": "i6ija5e", "is_submitter": "False", "link_id": "t3_udqmun", "parent_id": "t3_udqmun", "score": "58", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "luellababalola", "body": "Hi there,\n\nI know what you're talking about as I used to have the same problems. \n\nWhat helped me most is combining the different learning methods. This means; **get rid of vocab lists, grammar books,** etc, as it doesn't really focus on using the language. \n\nWhat I like to do for German, for instance, is watching a video on a certain topic (it's best to choose one that interests you). I repeat sentences to practise my prononciation, I write a text about it that I used to publish on Reddit, but now send to a close friend of mine for corrections, and I also send her a message talking about the topic. This allows you to **1) practise listening, 2) learn new vocabulary, 3) practise writing, 4) practise speaking.** \n\nMy French is more advanced, so I just send a voice message to my language exchange partners to practise speaking. Or we call, which is more direct, and gives me less time to think, which is a great exercise. \n\nThere probably are too many resources to learn English, so there's a lot to choose from. **Try to find something that interests you.** You can do the same for Russian, too. A2 already is a good level. \n\nGood luck! :)", "created_utc": "1651136108.0", "edited": "False", "id": "i6ifqe6", "is_submitter": "False", "link_id": "t3_udpyni", "parent_id": "t3_udpyni", "score": "24", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "luellababalola", "body": "Hi, native Dutch speaker here (for context: learning English, French, German, and Spanish). \n\nI don't think you should exclude one of the languages in order to be fluent in at least two of them. I've been learning other languages since I was 9, but I only really started learning when I was 18 (I am 21 now) because I decided to study languages at uni. \n\nThis week, when applying for Masters, and being in need of certificates to prove my level, my three professors all gave me C1 certificates (EN - FR - GR). I didn't expect it, and I know C1 doesn't equal C2, but it's a good start, right?\n\nIt will take a lot of time, and effort. + creating an environment where you can immerse yourself will be crucial.", "created_utc": "1651135051.0", "edited": "False", "id": "i6ielc1", "is_submitter": "False", "link_id": "t3_udi3iv", "parent_id": "t3_udi3iv", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "luellababalola", "body": "Danke schön! :)", "created_utc": "1649445967.0", "edited": "False", "id": "i3xvjyu", "is_submitter": "True", "link_id": "t3_turax3", "parent_id": "t1_i3iv8qc", "score": "1", "subreddit": "WriteStreakGerman", "subreddit_id": "t5_364k6p"}, {"author": "luellababalola", "body": "Ok, super! Vielen Dank für die Korrektur und die Information :)", "created_utc": "1649445954.0", "edited": "False", "id": "i3xviti", "is_submitter": "True", "link_id": "t3_tu1avs", "parent_id": "t1_i3czv8y", "score": "1", "subreddit": "WriteStreakGerman", "subreddit_id": "t5_364k6p"}, {"author": "luellababalola", "body": "Alright, thank you so much for answering my questions! I've learnt a lot, and all this information is super useful, and will therefore definitely make use out of it :)", "created_utc": "1649020004.0", "edited": "False", "id": "i39qy55", "is_submitter": "False", "link_id": "t3_tuajub", "parent_id": "t1_i374dit", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "luellababalola", "body": "This is really interesting! What level are your students at? I don't think it matters much, I am sure I can find news for kids, too, that will make it more accessible. \n\nI will look into some books, or maybe even pdfs. Thank you for your suggestions! :)", "created_utc": "1648927520.0", "edited": "False", "id": "i353nvh", "is_submitter": "False", "link_id": "t3_tuajub", "parent_id": "t1_i3423tz", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "luellababalola", "body": "This is a very interesting aspect of tutoring that you've mentioned. Her mom has sent me precisely what she thinks her daughter needs help with. In case she'd tell me she wants her to do those dry grammar exercises, it might be worth it to do a mixture of both. The girl still needs to pass her exam... In case I'd help her broaden her vocabulary, but which isn't useful for the exam in June, it would be a waste of money. \n\nDefinitely food for thought, thank you so much!", "created_utc": "1648927408.0", "edited": "False", "id": "i353g45", "is_submitter": "False", "link_id": "t3_tuajub", "parent_id": "t1_i32zr8v", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "luellababalola", "body": "Thank you so much for your feedback! :) \n\nWe decided to spend the first 30 minutes getting to know each other before starting the test. This will allow me to base grammar and vocab on those specific things she likes. \n\nYou mentioned other interesting things, too, like how familiar she is with grammar. And not just grammar, the whole language in itself, maybe. Thank you :)", "created_utc": "1648927198.0", "edited": "False", "id": "i3531dl", "is_submitter": "False", "link_id": "t3_tuajub", "parent_id": "t1_i32x7my", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "luellababalola", "body": "Thank you so much for sharing all this information with me. I definitely thought about the first thing that came to your mind, but I didn't think about the others. All of this will definitely help me tomorrow, and I will bring the things you mentioned up. Thank you so much! :)", "created_utc": "1648926938.0", "edited": "False", "id": "i352j62", "is_submitter": "False", "link_id": "t3_tuajub", "parent_id": "t1_i32tot4", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "luellababalola", "body": "Schönes Wochenende! Wir sollten uns warm anziehen, haha. Vielen Dank für die Korrektur! :)", "created_utc": "1648844968.0", "edited": "False", "id": "i311hq1", "is_submitter": "True", "link_id": "t3_tt6pde", "parent_id": "t1_i2ysekt", "score": "2", "subreddit": "WriteStreakGerman", "subreddit_id": "t5_364k6p"}, {"author": "luellababalola", "body": "Danke schön :)!", "created_utc": "1648751407.0", "edited": "False", "id": "i2vpeko", "is_submitter": "True", "link_id": "t3_tsiftq", "parent_id": "t1_i2tztvv", "score": "2", "subreddit": "WriteStreakGerman", "subreddit_id": "t5_364k6p"}, {"author": "luellababalola", "body": "Ahhh, super! Vielen Dank <3", "created_utc": "1648751395.0", "edited": "False", "id": "i2vpdh0", "is_submitter": "True", "link_id": "t3_trgsvt", "parent_id": "t1_i2rexi2", "score": "2", "subreddit": "WriteStreakGerman", "subreddit_id": "t5_364k6p"}, {"author": "luellababalola", "body": "1. Nein, ich kann gut fahren, aber ich vermeide es lieber :)\n2. Nein, kein \"I am writing\" aber eher \"everything and anything\" \n\nAhh, das ist gut! Für dich, die Umwelt, und deine Zeit! :)\nDanke schön!!", "created_utc": "1648671925.0", "edited": "False", "id": "i2rdzze", "is_submitter": "True", "link_id": "t3_trgsvt", "parent_id": "t1_i2pzb2x", "score": "2", "subreddit": "WriteStreakGerman", "subreddit_id": "t5_364k6p"}, {"author": "luellababalola", "body": "Vielen Dank für die Korrektur! Ok, Frangipane, habe ich notiert :)", "created_utc": "1648671760.0", "edited": "False", "id": "i2rdkzi", "is_submitter": "True", "link_id": "t3_toyfg6", "parent_id": "t1_i2p2wzh", "score": "2", "subreddit": "WriteStreakGerman", "subreddit_id": "t5_364k6p"}, {"author": "luellababalola", "body": "Stimmt, hehe. Vielen Dank für die Korrektur :)", "created_utc": "1648671728.0", "edited": "False", "id": "i2rdi0g", "is_submitter": "True", "link_id": "t3_tnxna5", "parent_id": "t1_i2obh6i", "score": "2", "subreddit": "WriteStreakGerman", "subreddit_id": "t5_364k6p"}, {"author": "luellababalola", "body": "We're in the same boat :)\n\nClothes-wise: I just scroll through sites, and focus on what the models who have my features (I'm white and blonde) are wearing. & Other Stories is a great source, as they've got models from various ethnicities. I find thrifting (at thrift stores) really hard, and therefore do mine online (whenever I need something). Let's hope you'll have better luck.\n\nMake-up: I have no clue at all. I prefer to keep it simple and light. Idk what colour your eyes are, mine are blue, which goes well together with peach/apricot colours. I don't know where you live, but I've been buying the little make-up I wear at the same store/brand for years. Idk much about stores in general, but I find that the staff (in general) takes the time to help you find whatever fits your skin colour/preferences.\n\nAlso, you might want to look into what undertone your skin colour is (blue or red) because it'll tell you what clothes and make-up will look good on you :)", "created_utc": "1648583212.0", "edited": "False", "id": "i2lucre", "is_submitter": "False", "link_id": "t3_tqyjkz", "parent_id": "t3_tqyjkz", "score": "1", "subreddit": "askwomenadvice", "subreddit_id": "t5_30m5u"}, {"author": "luellababalola", "body": "It's a yay for me. My roommate thought I was speaking fluently to myself, little did she know I had no clue about the majority of the pronunciation. But it helps, also, to stay focused. I'd feel embarrassed doing so when a native speaker would be listening, though. Anyway, I guess it's the best way to learn how to pronounce words correctly, after immitating accents, of course", "created_utc": "1648582532.0", "edited": "False", "id": "i2lslhq", "is_submitter": "False", "link_id": "t3_tqvxkl", "parent_id": "t3_tqvxkl", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "luellababalola", "body": "I don't know any songs, I just hope you're alright :)", "created_utc": "1648582117.0", "edited": "False", "id": "i2lriuz", "is_submitter": "False", "link_id": "t3_trcuca", "parent_id": "t3_trcuca", "score": "5", "subreddit": "German", "subreddit_id": "t5_2qq51"}, {"author": "luellababalola", "body": "Hi! Even though I cannot relate due to being in my early twenties, I can tell you about my parents. They met when my mom was 31, and my dad's 4 years older. They got married exactly one year after meeting, and I was born 9 months after their marriage. \n\nI know it might be a silly example, but I just hope it kind of helps. You're not alone :)", "created_utc": "1648582057.0", "edited": "False", "id": "i2lrdat", "is_submitter": "False", "link_id": "t3_trbkao", "parent_id": "t3_trbkao", "score": "2", "subreddit": "dating_advice", "subreddit_id": "t5_2s4kl"}, {"author": "luellababalola", "body": "Haha ja, oft schreibe ich mehr :) danke schön! :)", "created_utc": "1648580309.0", "edited": "False", "id": "i2lmugl", "is_submitter": "True", "link_id": "t3_tpojmb", "parent_id": "t1_i2jwh6u", "score": "2", "subreddit": "WriteStreakGerman", "subreddit_id": "t5_364k6p"}, {"author": "luellababalola", "body": "Ich auch nicht! Ich dachte, jeder hat Symptome, aber stimmt doch nicht... Vielen Dank für die Korrektur :)", "created_utc": "1648580176.0", "edited": "False", "id": "i2lmi8t", "is_submitter": "True", "link_id": "t3_tmzc56", "parent_id": "t1_i2groko", "score": "2", "subreddit": "WriteStreakGerman", "subreddit_id": "t5_364k6p"}, {"author": "luellababalola", "body": "Und du auch, natürlich! Vielen Dank für die Korrektur :)", "created_utc": "1648580135.0", "edited": "False", "id": "i2lmecq", "is_submitter": "True", "link_id": "t3_tqb19l", "parent_id": "t1_i2g2jc1", "score": "2", "subreddit": "WriteStreakGerman", "subreddit_id": "t5_364k6p"}, {"author": "luellababalola", "body": "I keep track of new words and sentences in an Excel sheet, and mark them \"formal\" \"informal\" or \"l'argot\". Here are a few I added recently:\n\n* Je m'en bats les couilles - I don't give a fuck\n* avoir mauvaise mine / avoir une sale tête - look dreadful\n* aboyer - barking\n* renifler - sniffing\n* lècher - licking\n* ça y est - done\n\nI learnt those three verbs through an instagram post about animals, haha.", "created_utc": "1648316280.0", "edited": "False", "id": "i27ruct", "is_submitter": "False", "link_id": "t3_tomkm9", "parent_id": "t3_tomkm9", "score": "3", "subreddit": "French", "subreddit_id": "t5_2rd5t"}, {"author": "luellababalola", "body": "Learnt it at school, and just continued because I was quite good at it.", "created_utc": "1648315933.0", "edited": "False", "id": "i27r0g0", "is_submitter": "False", "link_id": "t3_torvbh", "parent_id": "t3_torvbh", "score": "1", "subreddit": "German", "subreddit_id": "t5_2qq51"}, {"author": "luellababalola", "body": "Ahhh, vielen Dank für die Korrektur und der Link zu Duden. Es ist sehr hilfreich :)", "created_utc": "1648291929.0", "edited": "False", "id": "i26ggoe", "is_submitter": "True", "link_id": "t3_tlbru1", "parent_id": "t1_i26800k", "score": "2", "subreddit": "WriteStreakGerman", "subreddit_id": "t5_364k6p"}, {"author": "luellababalola", "body": "One of the scariest things about love is that loving people as strongly and as healthily and as passionately as you can, doesn't automatically mean they'll love you in the same way or with the same energy. The reciprocation of your love is completely out of your control, and the reality of this can be so scary. The situation you're in is so scary. You deserve someone who will show up for you the same way you'll show up for them. Let that sink in before deciding if you actually want to spend the rest of your life with this person. Sending love", "created_utc": "1648151498.0", "edited": "False", "id": "i1z0z02", "is_submitter": "False", "link_id": "t3_tmk697", "parent_id": "t3_tmk697", "score": "4", "subreddit": "askwomenadvice", "subreddit_id": "t5_30m5u"}, {"author": "luellababalola", "body": "Ja, stimmt! In der Vergangheit habe ich es oft gemacht, aber jetzt sorgt es für interessantere Gespräche. Ich habe schon viel gelernt, hihi. Vielen dank für die Korrektur! :)", "created_utc": "1648138787.0", "edited": "False", "id": "i1y4b54", "is_submitter": "True", "link_id": "t3_tjj8ui", "parent_id": "t1_i1y2khj", "score": "2", "subreddit": "WriteStreakGerman", "subreddit_id": "t5_364k6p"}, {"author": "luellababalola", "body": "The only reason I'm typing this out is to get some clarity for myself because I don't know if anyone will read this.\n\nMy parents were always very present, though never showed any emotions. Whenever I showed mine, they got angry, and my dad locked me outside so I could calm down. This made me extremely anxious, feel like a burden, and I don't show any negative emotions, ever.\n\nI'm currently going through a rough time, and due to not trusting people, I tell them I am either busy, or need some time to work on myself. I've recently made a new internet friend and he's told me a lot about his relationship to his best friend. She's always been there for him, he's always been there for her, too. I try my best to be there for others, though I don't know if they actually find my presence helpful. On the contrary: I don't know how to accept others being there for me. And so it happens that, whenever I need to be supported the most, I am on my own.\n\nSo, long story short; I don't really share a lot about my life with others, to protect myself from getting hurt or them using my information against me. And the moment I am not feeling well, I shut everyone out, and disappear. This makes me feel safe, and again, neither I - or someone else - can get hurt.Also, I am scared of overestimating my position in someone else's life, and I just don't want to bother anyone with the burden I carry. It's funny, because I do believe it's better to carry a burden together, as it makes it less heavy.", "created_utc": "1648129755.0", "edited": "False", "id": "i1xhr7i", "is_submitter": "False", "link_id": "t3_tltg0y", "parent_id": "t3_tltg0y", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "luellababalola", "body": "YES, YES, AND YES. My two Mexican language exchange partners correct me whenever I write in Spanish, so do two of my French language exchange partners. Both the French girl and guy tell me how to say the exact same thing in a formal and informal situation.\n\nI've got a lot of friends who don't correct me (my German friend, and a lot of French friends) because they know what I mean, but that's not my goal. I want to **sound, speak and write** like a native.\n\nI must admit that I don't like correcting people myself for the exact same reason I've given above; I understand what they mean. However, I still correct them, because that's what I want them to do, too.", "created_utc": "1648128691.0", "edited": "False", "id": "i1xfd57", "is_submitter": "False", "link_id": "t3_tln9p1", "parent_id": "t3_tln9p1", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "luellababalola", "body": "In case you move to Flanders and have kids, send them to an OKAN school. It'll allow them to learn Dutch in one year, which will make it easier to enter a \"normal\" school the following year. The teachers also help with all administrative stuff.\n\nTry to find a buddy of some sort (you can definitely find someone on Facebook, idk if there's an actual app) to help you explain all administrative stuff because there's a lot (and I was confused when moving to France). Just someone you can fall back on when having questions.\n\nGood luck, and enjoy your stay :)", "created_utc": "1648067158.0", "edited": "False", "id": "i1uc3hf", "is_submitter": "False", "link_id": "t3_tkyyud", "parent_id": "t3_tkyyud", "score": "4", "subreddit": "belgium", "subreddit_id": "t5_2qhe6"}, {"author": "luellababalola", "body": "This thread is very helpful, thanks everyone. I wish I could give helpful advice, but I'm just an intern suffering the same problems you're facing. The important difference is that you have a real job, and I don't.\n\nHang in there. You're still learning. It takes some time to adapt and get used to your new job. It probably doesn't mean a lot considering I'm a stranger, but I believe in you and, am rooting for you :)", "created_utc": "1648066769.0", "edited": "False", "id": "i1ub3gc", "is_submitter": "False", "link_id": "t3_tkwwvc", "parent_id": "t3_tkwwvc", "score": "6", "subreddit": "askwomenadvice", "subreddit_id": "t5_30m5u"}, {"author": "luellababalola", "body": "Ok, danke sehr für die Korrektur! Und 1. das wusste ich nicht :) \nOh super, wir machen es gut :)", "created_utc": "1648065312.0", "edited": "False", "id": "i1u78yu", "is_submitter": "True", "link_id": "t3_tkbxy9", "parent_id": "t1_i1t3cz9", "score": "2", "subreddit": "WriteStreakGerman", "subreddit_id": "t5_364k6p"}, {"author": "luellababalola", "body": "Und noch ein Mahl; danke :))", "created_utc": "1647980058.0", "edited": "False", "id": "i1pfa28", "is_submitter": "True", "link_id": "t3_ti4ikc", "parent_id": "t1_i1ntaft", "score": "2", "subreddit": "WriteStreakGerman", "subreddit_id": "t5_364k6p"}, {"author": "luellababalola", "body": "Vielen Dank für die Korrektur! :)", "created_utc": "1647980043.0", "edited": "False", "id": "i1pf8mt", "is_submitter": "True", "link_id": "t3_tihopm", "parent_id": "t1_i1npvi0", "score": "2", "subreddit": "WriteStreakGerman", "subreddit_id": "t5_364k6p"}, {"author": "luellababalola", "body": "Staffel, das ist ein interessantes Wort! Vielen Dank für die ganze Korrektur :)", "created_utc": "1647980025.0", "edited": "False", "id": "i1pf6xk", "is_submitter": "True", "link_id": "t3_tgw6x2", "parent_id": "t1_i1mlvz8", "score": "2", "subreddit": "WriteStreakGerman", "subreddit_id": "t5_364k6p"}, {"author": "luellababalola", "body": "In de 18de eeuw begint het proza ***~~om~~*** een steeds belangrijkere rol te spelen. Terwijl de roman in de 17de eeuw als iets simpels wordt beschouwd, krijgt dit genre in de volgende eeuw meer gewicht. Onderwerpen zoals moreel en deugd karakteriseren nu de roman. De briefromans “Pamela” en “Clarissa” van de Engelse auteur Richardson hebben een eerste sterke invloed op de Europese literatuur. In Nederland verschijnt wat later de beroemde briefroman “Sara Burgerhart” van Betje Wolff.\r  \n\r  \nHet theater wordt door het classicisme gekarakteriseerd. Strengere en regelmatigere regels zijn nu in toneelstukken te vinden; die namelijk de drie Aristotelische eenheden (actie, tijd en plaats) moeten respecteren. Het Franse theater speelt natuurlijk een belangrijke rol dankzij toneelschrijvers zoals Molière, Racine en Corneille.\r  \n\r  \nTen slotte komt er een nieuw genre tevoorschijn: het Spectatoriale tijdschrift. Cafés zijn nu ***een*** gezellige plek voor de burgerij waar men gesprek***k***en kan voeren over literatuur of politiek. In het jaar 1731 wordt het tijdschrift “De Hollandsche Spectator” voor het eerst gepubliceerd. Het spreekt ***~~vanzelf~~***  ***voor zich*** dat de naam een duidelijke verwijzing naar het Eng***e***lse tijdschrift “The Spectator” is.\n\n&#x200B;\n\n*Heel goed en duidelijk geschreven. Erg interessant ook. Bedankt voor de informatie! :)*", "created_utc": "1647897240.0", "edited": "False", "id": "i1kwtud", "is_submitter": "False", "link_id": "t3_tjj9v4", "parent_id": "t3_tjj9v4", "score": "2", "subreddit": "WriteStreakNL", "subreddit_id": "t5_3g5eo9"}, {"author": "luellababalola", "body": "That must be the reason why I struggle with word order in other languages, haha.", "created_utc": "1647868786.0", "edited": "False", "id": "i1iz7uh", "is_submitter": "False", "link_id": "t3_tjar2k", "parent_id": "t1_i1ivio6", "score": "21", "subreddit": "learndutch", "subreddit_id": "t5_2t6rf"}, {"author": "luellababalola", "body": "Oui, bien sûr! Je t'ai envoyé un message <3", "created_utc": "1647789268.0", "edited": "False", "id": "i1etg9d", "is_submitter": "False", "link_id": "t3_tii51f", "parent_id": "t1_i1eokpj", "score": "1", "subreddit": "language_exchange", "subreddit_id": "t5_2tdbm"}, {"author": "luellababalola", "body": "Vandaag heb ik even gewandeld. Het weer was heel lekker en dus perfect voor een rustige wandeling. Ik heb op een pad langs de oever van een rivier gewandeld. Het voelt altijd aangenaam aan om te wandelen terwijl je het vloeiende gerucht ***(1)*** van het water en de vogels hoort.\n\n&#x200B;\n\n***(1)*** *Ik hoorde nooit eerder over \"het vloeiende gerucht van het water\". Ik zou hier eerder schrijven \"het stromende water\" of \"het geruis van het water\", al ruist water niet echt.* \n\n*Goed geschreven! :)*", "created_utc": "1647768954.0", "edited": "False", "id": "i1dwi2u", "is_submitter": "False", "link_id": "t3_ti08xa", "parent_id": "t3_ti08xa", "score": "2", "subreddit": "WriteStreakNL", "subreddit_id": "t5_3g5eo9"}, {"author": "luellababalola", "body": "Vanavond begint het nieuwe seizoen van De Mol. Ik heb er zoveel zin in! Dit jaar vertrekken de spelers naar de Canarische Eilanden. Kortom, het zijn 10 spelers die aan allerlei spelletjes mee***doen***. Elk keer dat ze een spelletje slagen ***(1)***, verdienen ze als team wat geld. Tussen he***n*** zit er wel een mol, iemand die zijn best zal doen om alles te verpesten. Terwijl ze proberen geld binnen te halen, moeten ze erachter komen wie de mol is. Na elk spel, via een quiz, worden hun vermoedens getest. Wie helemaal fout bezig is valt af. De mol gaat natuurlijk in ieder geval door ***(2)***.\n\n***(1)*** *Het werkwoord is \"slagen voor iets\", maar \"voor een spelletje slagen\" klinkt een beetje raar. Daarom stel ik voor eerder iets te schrijven als \"Elke keer dat ze een spelletje tot een goed eind brengen,...\".*\n\n***(2)*** *In ieder geval gaat de mol door OF De mol gaat natuurlijk door. \"In ieder geval\" en \"natuurlijk\" passen hier niet goed in dezelfde zin.*\n\n&#x200B;\n\n*Ik ga morgen uitgesteld kijken, geen spoilers graag ;). Geniet ervan! :)*", "created_utc": "1647768824.0", "edited": "False", "id": "i1dwcl9", "is_submitter": "False", "link_id": "t3_tig1ed", "parent_id": "t3_tig1ed", "score": "3", "subreddit": "WriteStreakNL", "subreddit_id": "t5_3g5eo9"}, {"author": "luellababalola", "body": "Vielen Dank für die Korrektur! :) es macht Spaß, das Programm. Es lohnt sich, wenn du viel lachen willst ;)", "created_utc": "1647701966.0", "edited": "False", "id": "i1aby1y", "is_submitter": "True", "link_id": "t3_tgcxo4", "parent_id": "t1_i193fsc", "score": "1", "subreddit": "WriteStreakGerman", "subreddit_id": "t5_364k6p"}, {"author": "luellababalola", "body": "Ja, ich finde es eigentlich auch interessant!\n\nEs ist besser, nicht online zu bestellen (und nichts rückzusenden). Du machst es also gut. Vielen Dank für die Korrektur! :)", "created_utc": "1647529868.0", "edited": "False", "id": "i10zcop", "is_submitter": "True", "link_id": "t3_tfeh6y", "parent_id": "t1_i10k3g5", "score": "2", "subreddit": "WriteStreakGerman", "subreddit_id": "t5_364k6p"}, {"author": "luellababalola", "body": "Hahaha, ich musste lachen ;) du hast Recht! Danke schön :))", "created_utc": "1647502058.0", "edited": "False", "id": "i0zq26r", "is_submitter": "True", "link_id": "t3_tdqj6z", "parent_id": "t1_i0wf11p", "score": "2", "subreddit": "WriteStreakGerman", "subreddit_id": "t5_364k6p"}, {"author": "luellababalola", "body": "Foutloos! :D\n\nZelf zou ik eerder schrijven: *Ze behoorden tot de middenklasse* ***~~toe~~***. Maar, Je hebt gelijk dat het werkwoord \"toebehoren\" is. Dat is de enige opmerking. Goed gedaan :)", "created_utc": "1647445483.0", "edited": "False", "id": "i0waxdp", "is_submitter": "False", "link_id": "t3_te5aeq", "parent_id": "t3_te5aeq", "score": "2", "subreddit": "WriteStreakNL", "subreddit_id": "t5_3g5eo9"}, {"author": "luellababalola", "body": "Vielen Dank für die Korrektur! :)", "created_utc": "1647438098.0", "edited": "False", "id": "i0vtat3", "is_submitter": "True", "link_id": "t3_tehxeo", "parent_id": "t1_i0vhadx", "score": "2", "subreddit": "WriteStreakGerman", "subreddit_id": "t5_364k6p"}, {"author": "luellababalola", "body": "Haha, danke! Und auch für die Korrektur :)", "created_utc": "1647426325.0", "edited": "False", "id": "i0v98sk", "is_submitter": "True", "link_id": "t3_td1tmo", "parent_id": "t1_i0v8s27", "score": "1", "subreddit": "WriteStreakGerman", "subreddit_id": "t5_364k6p"}, {"author": "luellababalola", "body": "Vieln Dank für die Korrektur! :)\n\nJa, ich bin gut angekommen, danke! :)", "created_utc": "1647423849.0", "edited": "False", "id": "i0v64zi", "is_submitter": "True", "link_id": "t3_tcq3nw", "parent_id": "t1_i0sjb8u", "score": "1", "subreddit": "WriteStreakGerman", "subreddit_id": "t5_364k6p"}, {"author": "luellababalola", "body": "Vielen Dank für die Korrektur! :)\n\nAhh, ja! Die Blumen sind super schön! :)", "created_utc": "1647156791.0", "edited": "False", "id": "i0gvbpk", "is_submitter": "True", "link_id": "t3_tbk0m8", "parent_id": "t1_i0gnphf", "score": "2", "subreddit": "WriteStreakGerman", "subreddit_id": "t5_364k6p"}, {"author": "luellababalola", "body": "Je hebt groot gelijk, dat deed ik bij mijn eerste streak ook :)", "created_utc": "1647118749.0", "edited": "False", "id": "i0ewqn9", "is_submitter": "False", "link_id": "t3_tbmdpm", "parent_id": "t1_i0evwjn", "score": "2", "subreddit": "WriteStreakNL", "subreddit_id": "t5_3g5eo9"}, {"author": "luellababalola", "body": "Het begrip “rampjaar” wordt gebruikt om het jaar 1672 te beschrijven. Toen werd de Republiek door Frankrijk en Engeland (met een zeeoorlog) aangevallen. Als reactie daarop werd de stadhouder Willem III benoemd, wat een ***(1)*** einde ***van*** het eerste stadhouderloze tijdperk (1650-1672) maakte***/beter : betekende***.\r  \n\r  \nIn elk geval werd een aanzienlijk groot deel van het land door vijandelijke troepen bezet. Nederland maakte een periode van crisis en verval mee die de nationale economie beschadigde. Zo kwam er een einde aan de zogenoemde “Gouden Eeuw”.\n\n&#x200B;\n\n***(1)*** *Omdat ik niet zoveel over geschiedenis weet, heb ik het niet verbeterd, maar ik zou hier eerder kiezen voor* ***het*** *in plaats van* ***een****.* \n\n&#x200B;\n\n*Je hebt bijna geen correcties meer nodig, haha ;)*", "created_utc": "1647117833.0", "edited": "False", "id": "i0euptv", "is_submitter": "False", "link_id": "t3_tckm2f", "parent_id": "t3_tckm2f", "score": "2", "subreddit": "WriteStreakNL", "subreddit_id": "t5_3g5eo9"}, {"author": "luellababalola", "body": "Het Nederlands is een pluricentrische taal. Dat wil zeggen, dat het Nederlands ***een*** enige taal is die drie natiolecten heeft, dat betekent drie nationale gestandaardiseerde variaties van dezelfde taal.\r  \n\r  \nEr bestaan namelijk Nederlands Nederlands, Belgisch Nederlands en Surinaams Nederlands.\r  \n\r  \n(Vandaag korte tekst omdat ik het wat druk heb)\n\n&#x200B;\n\n*Geen probleem voor de korte tekst! Door je teksten leer ik zelf nieuwe woorden (en concepten) bij zoals \"pluricentrische talen\" en \"natiolecten\". Heel cool!*", "created_utc": "1647117623.0", "edited": "False", "id": "i0eu90g", "is_submitter": "False", "link_id": "t3_tbmdpm", "parent_id": "t3_tbmdpm", "score": "2", "subreddit": "WriteStreakNL", "subreddit_id": "t5_3g5eo9"}, {"author": "luellababalola", "body": "Welkom! \n\nPools is voor Nederlandstaligen een hele uitdaging, dus ik kan me voorstellen dat het ook voor jou moeilijk is. Veel succes :)", "created_utc": "1647117401.0", "edited": "False", "id": "i0etrj6", "is_submitter": "False", "link_id": "t3_tbudgh", "parent_id": "t3_tbudgh", "score": "3", "subreddit": "WriteStreakNL", "subreddit_id": "t5_3g5eo9"}, {"author": "luellababalola", "body": "Hi there,\n\nI feel you. The experience you described is me in France, though I am lucky there are no dialects, just a lot of both formal and informal words that were (and still are) new to me.\n\nI'd tell you to give yourself time to adapt, and to become more fluent, but I know how hard it is to wait, because I am also really annoyed with myself for having to nod and not participate once I end up in a group. A week ago, I had a friend ask me if I understand better than I speak; yes, I do. I probably understand 90 - 95% of what they're saying, depends on what we're talking about. In uni, I sometimes barely understand 30%, which is annoying. Anyway, it just doesn't show when speaking, haha.\n\nDon't be too hard on yourself. I am still actively learning French so I get a better grasp of the grammar, and a broader range of vocabulary. What I've found helpful for German, is finding YouTube videos where people speak in your local dialect. I don't live in Germany, but my professor showed us a video of people who were from Hamburg, which I found difficult to understand. So, I have watched (and listened) quite a few videos that were filmed there. I feel like it helps.\n\nGood luck, you're not alone xx", "created_utc": "1646992615.0", "edited": "1646993010.0", "id": "i081wbo", "is_submitter": "False", "link_id": "t3_tbfpxu", "parent_id": "t3_tbfpxu", "score": "1", "subreddit": "German", "subreddit_id": "t5_2qq51"}, {"author": "luellababalola", "body": "Onder het begrip “tussentaal” wordt een informele variëteit van het Belgische Standaardnederlands verstaan die tussen de Vlaamse standaardtaal en de Vlaamse dialecten ligt. Het is dus een omgangstaal. De zogenoemde tussentaal verscheen eerst in de jaren tachtig en hij begon in de jaren negentig zich te standaardiseren.\r  \n\r  \nAan de ene kant is de tussentaal een manier om afstand te kunnen nemen van het gebruik van dialecten. Of omdat dialecten in elk geval nog steeds minder gesproken worden. Aan de andere kant heeft de tussentaal zijn wortels ook in het feit dat het Belgisch Nederlands sterk werd beïnvloed door het Nederlandse Nederlands. Een niet goede kennis van de standaardtaal, (komma) of een negatieve houding daartegen, (komma) kunnen bijvoorbeeld de uitbreiding van de zogenoemde tussentaal aanwijzen.\r  \n\r  \nDat kun je bemerken dankzij een paar karakteristieken van de tussentaal. Een streven naar de vermijding van dialectklanken is te bemerken. Toch zijn verschillende kenmerken van dialecten gebleven (het gebruik van “gij/ge”, de dubbele negatie, de doelzin met “voor” in plaats van “te”, het vormen van verkleinwoorden enzovoort). Daarom kun je zeggen dat de tussentaal namelijk tussen de Vlaamse standaardtaal en de dialecten ligt.\r  \n\r  \nEr is toch wat kritiek ontstaan ***~~aan~~*** ***over*** dit begrip. “Tussentaal”, “Soapvlaams” (de radio en de TV hebben overigens een belangrijke rol gespeeld wat het uitkomen van de tussentaal betreft) of “Verkavelingsvlaams” kunnen beledigend klinken doordat ze pejoratief bedoeld zijn. Neutralere begrippen zijn bijvoorbeeld: “Schoon Vlaams” of “algemeen Vlaams”.\n\n&#x200B;\n\n*Eigenlijk was deze tekst perfect, net één klein foutje (kritiek ontstaan over).*\n\n*In het algemeen Nederlands zeggen we : \"dat/die tekst heb je goed geschreven\".*  \n*In tussentaal, wat ik met vrienden en familie spreek, zou ik eerder zeggen : \"da/diejen tekst hebde goe geschreven\". Ik dacht, ik geef je wat tussentaal mee ;)*", "created_utc": "1646980945.0", "edited": "False", "id": "i07n5sa", "is_submitter": "False", "link_id": "t3_tb5tc5", "parent_id": "t3_tb5tc5", "score": "2", "subreddit": "WriteStreakNL", "subreddit_id": "t5_3g5eo9"}, {"author": "luellababalola", "body": "Danke! :)", "created_utc": "1646980475.0", "edited": "False", "id": "i07mhc0", "is_submitter": "True", "link_id": "t3_t9p3fs", "parent_id": "t1_i04opu7", "score": "2", "subreddit": "WriteStreakGerman", "subreddit_id": "t5_364k6p"}, {"author": "luellababalola", "body": "Hahaha, die Deutschen sind scheinbar auch zurückhaltend ;) \n\nVielen Dank für die Korrektur! :)", "created_utc": "1646931440.0", "edited": "False", "id": "i04kjdb", "is_submitter": "True", "link_id": "t3_t8jca9", "parent_id": "t1_i04bubv", "score": "2", "subreddit": "WriteStreakGerman", "subreddit_id": "t5_364k6p"}, {"author": "luellababalola", "body": "Und nochmal danke. Du hast mir viel geholfen heute <3\nUnd es freut mich, dass du sich einigt auf meiner Meinung (kann ich es so sagen?)", "created_utc": "1646931375.0", "edited": "False", "id": "i04kdar", "is_submitter": "True", "link_id": "t3_t9p3fs", "parent_id": "t1_i0457qn", "score": "2", "subreddit": "WriteStreakGerman", "subreddit_id": "t5_364k6p"}, {"author": "luellababalola", "body": "Wir sollten uns mehr Freizeit gönnen :)\n\nDanke schön! :D", "created_utc": "1646931307.0", "edited": "False", "id": "i04k70r", "is_submitter": "True", "link_id": "t3_ta2yak", "parent_id": "t1_i03fvef", "score": "2", "subreddit": "WriteStreakGerman", "subreddit_id": "t5_364k6p"}, {"author": "luellababalola", "body": "1. Vielen Dank für die Informationen! Ich wusste es nicht, aber jetzt kann ich es richtig nützen. \nUnd auch im Allgemeinen, danke schön! \n\nAha, du hast viele Bücher bekommen, das ist schön :)", "created_utc": "1646911926.0", "edited": "False", "id": "i03flo3", "is_submitter": "True", "link_id": "t3_targvt", "parent_id": "t1_i032i98", "score": "2", "subreddit": "WriteStreakGerman", "subreddit_id": "t5_364k6p"}, {"author": "luellababalola", "body": "De Eglantier was een Amsterdamse rederijkerskamer die tussen 1517 en 1518 werd opgericht. Het geldt nog ***als*** één van de belangrijkste rederijkerskamers. Hooft en Coster waren bijvoorbeeld leden van deze kamer ***~~geweest~~******~~,~~*** voordat ze de Nederduytsche Academie oprichtten samen met Bredero.\r  \n\r  \nMet de Eglantier begon de commercialisering van het theater (maar de kwaliteit en de belangstelling van de toneelstukken bleven in elk geval aanzienlijk goed) en het publiek werd steeds groter. Het theater werd dus iets ***professioneels***, een echte baan. In het jaar 1638 werd de Eglantier gefuseerd met de Nederduytsche Academie. Zo ontstond de Amsterdamsche Kamer, wiens eerst toneelstuk in ***het*** nieuw theater Schouwburg werd gespeeld.\n\n*Goed geschreven!*", "created_utc": "1646813097.0", "edited": "False", "id": "hzy6b78", "is_submitter": "False", "link_id": "t3_ta266w", "parent_id": "t3_ta266w", "score": "2", "subreddit": "WriteStreakNL", "subreddit_id": "t5_3g5eo9"}, {"author": "luellababalola", "body": "Hehe danke! Und auch vielen Dank für die Korrektur! :D", "created_utc": "1646768495.0", "edited": "False", "id": "hzvmeyg", "is_submitter": "True", "link_id": "t3_t7wy7c", "parent_id": "t1_hzubr1s", "score": "2", "subreddit": "WriteStreakGerman", "subreddit_id": "t5_364k6p"}, {"author": "luellababalola", "body": "Yes, indeed! \"de\" are either masc or fem, \"het\" is neuter. And indeed, we do so in Flemish, not really in Dutch that's spoken in the Netherlands :)", "created_utc": "1646768471.0", "edited": "False", "id": "hzvmcp9", "is_submitter": "False", "link_id": "t3_t8rdg0", "parent_id": "t1_hztj5p3", "score": "1", "subreddit": "German", "subreddit_id": "t5_2qq51"}, {"author": "luellababalola", "body": "Until July, I used to live with my parents 24/7 who eat meat every single day. It didn't really bother me, it's their choice, and, in the 4+ years of being vegan, I have learnt that they do not agree with me, which I have accepted.\n\nAnyway, I lived on my own in August, and moved in with my roommate in September. My roommate is flexitarian, yet rarely eats meat (or fish) at home, 2 or 3 times a month, at most. Two days ago, she made chicken teriyaki, and I had to flee the apartment because of the smell and her comments on cutting the chicken's breast. \n\nMoving home in a few days, and very happy that I'll get home one hour after dinner so that I won't be confronted with the smell and the look of the meat, or the fish.", "created_utc": "1646731254.0", "edited": "False", "id": "hztgxol", "is_submitter": "False", "link_id": "t3_t915dv", "parent_id": "t3_t915dv", "score": "1", "subreddit": "vegan", "subreddit_id": "t5_2qhpm"}, {"author": "luellababalola", "body": "Exactly, it doesn't! We also don't use Männlich, Weiblich and Neutrum. They exist, but majority doesn't know the gender of the words, which sometimes makes it a bit difficult. \n\nHahaha, I like the idea of my language being halfway between those two :)", "created_utc": "1646730540.0", "edited": "False", "id": "hztg3eu", "is_submitter": "False", "link_id": "t3_t8rdg0", "parent_id": "t1_hzt84vg", "score": "2", "subreddit": "German", "subreddit_id": "t5_2qq51"}, {"author": "luellababalola", "body": "I'm a native Dutch speaker, so I know German is most likely easier for me than for people who have another first language. Though I struggle because I tend to translate too literally (which is very much possible for almost every word/sentence). However, the structure of the sentences are mostly the same. There are a lot of false friends, so I have put more effort into them. And I am slowly, but surely, mastering the differences between Nominativ - Akkusativ and Dativ without having to think too much about them.\n\nB2 Grammatik is currently a bit of a challenge and I have troubles understanding dialects.", "created_utc": "1646688509.0", "edited": "False", "id": "hzr7l72", "is_submitter": "False", "link_id": "t3_t8rdg0", "parent_id": "t3_t8rdg0", "score": "10", "subreddit": "German", "subreddit_id": "t5_2qq51"}, {"author": "luellababalola", "body": "Same! But more like *do I use Akkusativ or Dativ after this specific Präposition?*", "created_utc": "1646688218.0", "edited": "False", "id": "hzr6tih", "is_submitter": "False", "link_id": "t3_t8rdg0", "parent_id": "t1_hzr3bkv", "score": "2", "subreddit": "German", "subreddit_id": "t5_2qq51"}, {"author": "luellababalola", "body": "Hehe, danke schön für die Korrektur! :)", "created_utc": "1646687658.0", "edited": "False", "id": "hzr5b4n", "is_submitter": "True", "link_id": "t3_t6fg9b", "parent_id": "t1_hzp57hi", "score": "1", "subreddit": "WriteStreakGerman", "subreddit_id": "t5_364k6p"}, {"author": "luellababalola", "body": "In Brussel kan je kiezen of je naar een Nederlandstalige of Franstalige school gaat. Wanneer je naar een Franstalige school gaat, kies je één vreemde taal: Engels, Nederlands, of Duits. 35% kiest voor het Nederlands, Duits is niet enorm populair en de overgrote meerderheid kiest voor het Engels. En dat is vaak jammer, voornamelijk in Brussel, waar de kennis van het Nederlands vaak belangrijker is dan de kennis van het Engels.", "created_utc": "1646687628.0", "edited": "False", "id": "hzr5884", "is_submitter": "False", "link_id": "t3_t8bmd8", "parent_id": "t1_hzq3z2l", "score": "1", "subreddit": "WriteStreakNL", "subreddit_id": "t5_3g5eo9"}, {"author": "luellababalola", "body": "Oh wauw, super! Vanaf volgende week loop ik stage in Brussel. Moest ik interessante informatie te weten komen, laat ik het je weten. \nNederlands oefenen gaat inderdaad moeilijk zijn; slechts 20% van de Brusselaars spreekt Nederlands (en zowat iedereen Frans). \n\nOok ik hoop dat je een mooie dag zal hebben! :)", "created_utc": "1646651001.0", "edited": "False", "id": "hzovclx", "is_submitter": "False", "link_id": "t3_t8bmd8", "parent_id": "t1_hzog49z", "score": "3", "subreddit": "WriteStreakNL", "subreddit_id": "t5_3g5eo9"}, {"author": "luellababalola", "body": "Hoi! Ik heb nog nooit hier geschreven. *(punt)* **D**it is mijn vierde maand van het leren :)\r  \n\r  \nIk denk dat mijn niveau misschien nog een beetje te laag is. Mijn vocabulaire is nog klein, maar hopelijk zal die verbeteren met ***de*** tijd.\r  \n\r  \nIk plan om naar België te r***ei***sen, maar ik startte ***eerder*** met Nederlands leren ***~~eerder~~*** dan ik de trip geboekt had, dus ik wil het blijven leren :)\r  \n\r  \nIk kom uit Engeland maar ***(1)*** ik ben heel geïnteresseerd in talen leren en de cultuur van de Benelux landen!\r  \n\r  \nDankjewel *(geen komma)* en tot morgen!\n\n&#x200B;\n\n***(1)*** *Eigenlijk hoef je hier geen \"maar\" te gebruiken, maar mag je \"en\" gebruiken. Maar \"maar\" past ook in de context.* \n\n*Welkom! Je schrijft heel goed voor slechts vier maanden geleden te zijn begonnen. En maak je geen zorgen; we helpen je wel met vocabulaire.* \n\n*Waar in België ga je reizen (ik ben Belg, hihi)?*", "created_utc": "1646635924.0", "edited": "False", "id": "hzocv3r", "is_submitter": "False", "link_id": "t3_t8bmd8", "parent_id": "t3_t8bmd8", "score": "3", "subreddit": "WriteStreakNL", "subreddit_id": "t5_3g5eo9"}, {"author": "luellababalola", "body": "Rederijkerskamers of kamers van retorica waren verenigingen van geleerde burgers die letterlijke kunsten wilden beoefenen zoals poëzie en theater.\n\nZe verschenen eerst in de 15de eeuw en ze bereikten hun hoogste punt twee eeuwen later (in de 17de eeuw) met het theater. Rederijkerskamers begonnen met het commercialiseren van het theater voor de menigte. Er werd ***op***gemerkt ***(1)*** ***/ Men merkte op*** dat het theater heel winstgevend was; vervolgens werd de baan van de toneelregisseur een echt professioneel beroep.\n\nToneelstukken behielden echter moraal of politieklessen en goede kwaliteit. Veel werkstukken spiegelden de werkelijkheid en de actualiteit.\n\nDe meeste rederijkerskamers werden door Vlaminge ***(1)*** migranten opgezet na de val van Antwerpen.\n\nHier zijn de belangrijkste rederijkerskamers: de Egelantier, Het ***W***it ***W***avendel en de Nederduytsche Academie.\n\n&#x200B;\n\n***(1)*** *Iets merken is letterlijk een \"merk\" of een \"label\" aangeven, zoals bijvoorbeeld een* [*koe*](https://nl.dreamstime.com/een-gelabelde-koe-die-vijver-van-water-drinkt-gemerkte-watervijver-image207849941)*.*\n\n***(2)*** *Ik moet eerlijk toegeven dat ik niet weet of dit een oud-Nederlands woord is, of dat je een vrouwelijke Vlaming bedoelt. Normaal gezien zou ik hier \"Vlaamse\" plaatsen omdat dat het \"juiste\"  woord is.*\n\n*Weer heel goed geschreven!*", "created_utc": "1646589210.0", "edited": "False", "id": "hzlml6d", "is_submitter": "False", "link_id": "t3_t831av", "parent_id": "t3_t831av", "score": "2", "subreddit": "WriteStreakNL", "subreddit_id": "t5_3g5eo9"}, {"author": "luellababalola", "body": "Ja, in Frankreich isst man Quiches! Hast du schon gehört über die Quiche Lorraine? Es ist eine sehr bekannte Quiche. \n\nWow, ich finde es toll, dass du mir die Gedanken von Abi mitgeteilt hast. Auf diese Weise kann ich verstehen, wie man Australien auswählt.\nHast du selbst eine Reise gemacht?\n\nVielen Dank für die Korrektur und die Informationen! :)", "created_utc": "1646566744.0", "edited": "False", "id": "hzkebii", "is_submitter": "True", "link_id": "t3_t7g8wc", "parent_id": "t1_hzhphz3", "score": "1", "subreddit": "WriteStreakGerman", "subreddit_id": "t5_364k6p"}, {"author": "luellababalola", "body": "Op die manier is het correct :)", "created_utc": "1646508371.0", "edited": "False", "id": "hzhi5ad", "is_submitter": "False", "link_id": "t3_t7favz", "parent_id": "t1_hzhhnoy", "score": "2", "subreddit": "WriteStreakNL", "subreddit_id": "t5_3g5eo9"}, {"author": "luellababalola", "body": "I feel you on this one! My friends talk like that, and I am out there saying the whole sentence, *with* a foreign accent. So, I'll get back to this question later and see if anyone has given you any tips. Just wanted to let you know: you're not the only one who's having this problem :)", "created_utc": "1646508338.0", "edited": "False", "id": "hzhi2ji", "is_submitter": "False", "link_id": "t3_t7e9fk", "parent_id": "t3_t7e9fk", "score": "3", "subreddit": "French", "subreddit_id": "t5_2rd5t"}, {"author": "luellababalola", "body": "Hier zijn de belangrijkste genres van de Nederlandse literatuur die de 17de eeuw hebben gekarakteriseerd.\r  \n\r  \nEen redelijk populair genre was de roman (meestal schelmenromans), die toen geen goede reputatie had. Het proza was volgens de algemene mening iets simpels en commercieels. De roman zal eerst in de 18de eeuw tot bloei komen.\r  \n\r  \nLiederen waren heel populair. Ze werden ***ook*** gebruikt ***~~ook~~*** als propagandamiddelen. We zouden ***(1)*** niet vergeten dat Nederland tijdens de 17de eeuw ***~~was~~*** gekarakteriseerd ***was*** door verschillende politieke tegenstellingen en ruzies. Het was best makkelijk om liederen om te zetten ***(2)***: je kon de bekendste melodieën simpelweg hergebruiken en je hoefde alleen maar de liedtekst te veranderen. Zo konden liederen een propagandamiddel worden.\r  \n\r  \nHet pamflet was een ander genre dat tot propagandamiddel diende. Pamfletten waren best kort en goedkoop. Daarom was het heel makkelijk om ze te verspreiden.\r  \n\r  \nHet genre van de emblematiek was een nieuwigheid die pas in de 16de eeuw in Italië was ontstaan. Het embleem bestond uit de combinatie van tekst en afbeelding. Een embleem had normaliter een moralistisch bedoel. Eén van de beroemdste Nederlandse auteurs, die emblemen schreef, was Jacob Cats.\n\n&#x200B;\n\n***(1)*** *Meerdere mogelijkheden:*\n\n* *We zouden niet mogen vergeten...*\n* *We mochten niet vergeten...*\n\n***(2)*** *Wat bedoel je met \"liederen omzetten\"?*\n\n*Ook in deze tekst is je woordkeuze opvallend. Het valt op dat je Nederlands aan de universiteit studeert, haha. Goed geschreven!*", "created_utc": "1646507433.0", "edited": "False", "id": "hzhfx61", "is_submitter": "False", "link_id": "t3_t7favz", "parent_id": "t3_t7favz", "score": "2", "subreddit": "WriteStreakNL", "subreddit_id": "t5_3g5eo9"}, {"author": "luellababalola", "body": "Onder het begrip “regiolect” wordt een regionale standaardtaal verstaan. Het regiolect ligt dus tussen het dialect en de nationale standaardtaal. Het begrip “streektaal” is dus een synoniem voor dit begrip, hoewel in een regiolect meerdere *(komma)* lokale verschillen en variëteiten worden geaccepteerd, terwijl een streektaal op zijn b***e***urt een standaardtaal is (in werkelijkheid impliceert het begrip “streektaal” in de Europese context geen gestandaardiseerde taal). ***(1)***\r  \n\r  \nIn Nederland worden sinds 1998 (het jaar waarin het Europees Handvest voor regionale talen of talen van minderheden in werking trad. ***(2)*** Het werd oorspronkelijk door Nederland in het jaar 1996 geratificeerd) de volgende streektalen erkend: Fries, Limburgs en Nedersaksisch. Sinds 2013 is het Fries (samen met het Nederlands) de officiële taal van de regio Friesland.\n\n&#x200B;\n\n***(1)*** *In principe hoef je dit niet tussen haakjes te zetten.* \n\n***(2)*** *Dit zou ik anders verwoorden, aangezien je zin nogal abrupt stopt : \"In Nederland worden sinds 1998, het jaar waarin het Europees Handvest voor regionale talen of talen van minderheden in werking trad en oorspronkelijk door Nederland in (het jaar) 1996 geratificeerd werd, de volgende streektalen erkend : ...\". Maar dan is je zin enorm lang. Dit is oké in geschreven teksten, maar in spreektaal zou je de luisteraar verliezen.* \n\n*Heel goed geschreven, heel veel moeilijke woordenschat. Hoedje af :)*", "created_utc": "1646507188.0", "edited": "False", "id": "hzhfcuz", "is_submitter": "False", "link_id": "t3_t6luao", "parent_id": "t3_t6luao", "score": "2", "subreddit": "WriteStreakNL", "subreddit_id": "t5_3g5eo9"}, {"author": "luellababalola", "body": "Wow, thank you for taking the time to write all of that down, and for correcting the mistakes I wrote in my notes. This is so, so, so helpful! \n\nI was aware it might be different \"in real life\" to how it's taught in school, but that's okay. It's interesting to have a professional's view as well, as it's very likely I'll once need it in my life.\n\nI had some doubts about the Referenzen that I didn't mention, but you told me a bit more about it, so that's also clear now. Without having to ask for it. \n\nAlso, you explained it very clearly, so I don't have any further questions.  \n\nHave a nice weekend! :)", "created_utc": "1646496950.0", "edited": "False", "id": "hzgr8i4", "is_submitter": "True", "link_id": "t3_t745zv", "parent_id": "t1_hzffsa7", "score": "2", "subreddit": "German", "subreddit_id": "t5_2qq51"}, {"author": "luellababalola", "body": "I second this! There's a difference of 5% between Belgian Dutch and \"Dutch\" Dutch (according to some site), which isn't that much.", "created_utc": "1646400095.0", "edited": "False", "id": "hzbab3e", "is_submitter": "False", "link_id": "t3_t6i0pm", "parent_id": "t1_hzb88gz", "score": "13", "subreddit": "learndutch", "subreddit_id": "t5_2t6rf"}, {"author": "luellababalola", "body": "Wow, vielen Dank für die Korrektur und alle extra Informationen! Es ist sehr hilfreich und ich werde in der Zukunft darauf achten :) !", "created_utc": "1646394438.0", "edited": "False", "id": "hzb0r79", "is_submitter": "True", "link_id": "t3_t5mrz6", "parent_id": "t1_hzavco8", "score": "1", "subreddit": "WriteStreakGerman", "subreddit_id": "t5_364k6p"}, {"author": "luellababalola", "body": "Will Tura used to live in my grandma's studentflat (she owned the flat). He's a few years younger than her, and she now suffers from dementia, but my godfather runs into him every now and then, and he apparently is the sweetest. Always asking about my grandma, and he used to call her on her birthday. :)", "created_utc": "1646380768.0", "edited": "False", "id": "hzajr1m", "is_submitter": "False", "link_id": "t3_t5t3fs", "parent_id": "t3_t5t3fs", "score": "5", "subreddit": "belgium", "subreddit_id": "t5_2qhe6"}, {"author": "luellababalola", "body": "Other than Pieter Loridon running over me, I haven't really met any celebs EXCEPT for Bart De Pauw, who was nice at the time, made me pay €1 for a picture though, but I hope I'll never see him again.", "created_utc": "1646380248.0", "edited": "False", "id": "hzaj2di", "is_submitter": "False", "link_id": "t3_t5t3fs", "parent_id": "t3_t5t3fs", "score": "2", "subreddit": "belgium", "subreddit_id": "t5_2qhe6"}, {"author": "luellababalola", "body": "I love how some people come into our lives and, subconsciously, inspire us to change (it) for the better.   \nMay both of you heal from whatever's going on in your lives, become the person you want to be, and feel comfortable being. Once you're there, I hope both of you meet someone you're compatible with. Whether that's you meeting again, as friends or more, or with someone else.", "created_utc": "1646337011.0", "edited": "False", "id": "hz82jdk", "is_submitter": "False", "link_id": "t3_t5vxez", "parent_id": "t3_t5vxez", "score": "3", "subreddit": "spirituality", "subreddit_id": "t5_2qhc5"}, {"author": "luellababalola", "body": "Native : Dutch\n\nLearning : French, English, German and Spanish\n\nFuture : idk, I kind of promised two friends of mine that I'll learn Russian, so we'll see if I ever will, lol\n\nDon't you want to learn Italian since your name's Frank Sinatra? ;)", "created_utc": "1646333661.0", "edited": "False", "id": "hz7tzot", "is_submitter": "False", "link_id": "t3_t5x07t", "parent_id": "t3_t5x07t", "score": "11", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "luellababalola", "body": "Exactly! It might even be possible to find Spanish people wanting to learn English. An in real life (or online, because why not) tandem could also help them. We have lots of ideas!", "created_utc": "1646322021.0", "edited": "False", "id": "hz6zq07", "is_submitter": "False", "link_id": "t3_t5o3mo", "parent_id": "t1_hz6yyfc", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "luellababalola", "body": "Those are great tips! :)\n\nI might want to add something because I feel like it'll be the same for any language. \n\nI'm currently living in France, and the French I learnt in uni is much more formal than how I should speak to my friends. So, them correcting me or giving alternatives to not sounding too formal has helped me, too. That's how I'm avoiding to translate too literally, or to sound mean without noticing. Don't be scared to ask if you said something correctly or not. :)", "created_utc": "1646321248.0", "edited": "False", "id": "hz6xsvg", "is_submitter": "False", "link_id": "t3_t5o3mo", "parent_id": "t1_hz5zcgu", "score": "5", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "luellababalola", "body": "You can also do this whilst being A2. I tried it with Spanish, and even though I cannot hold any conversation, I have less difficulties reading in, and understanding the language. Idk if it could be similar with Russian as the alphabet it different. I don't think you should wait until you reach x level in your TL :)", "created_utc": "1646320876.0", "edited": "False", "id": "hz6wuxp", "is_submitter": "False", "link_id": "t3_t5o3mo", "parent_id": "t1_hz6tld7", "score": "4", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "luellababalola", "body": "Vielen Dank für die Korrektur und die extra Information. Es ist immer schwer Verbindungswörter richtig zu verwenden :/. Danke! :)", "created_utc": "1646251283.0", "edited": "False", "id": "hz3babc", "is_submitter": "True", "link_id": "t3_t4y7wl", "parent_id": "t1_hz1l6f1", "score": "2", "subreddit": "WriteStreakGerman", "subreddit_id": "t5_364k6p"}, {"author": "luellababalola", "body": "Oh und, vielen Dank für die Korrektur! :)", "created_utc": "1646160277.0", "edited": "False", "id": "hyy05yz", "is_submitter": "True", "link_id": "t3_t471tw", "parent_id": "t1_hyy04wp", "score": "1", "subreddit": "WriteStreakGerman", "subreddit_id": "t5_364k6p"}, {"author": "luellababalola", "body": "Es freut mich, es geht Menschen wie mich auf den Internet. Und es freut mich, dass du einige Online-Freunde und Freunde vor Ort hast. Freunde machen das Leben schöner  :)", "created_utc": "1646160266.0", "edited": "False", "id": "hyy04wp", "is_submitter": "True", "link_id": "t3_t471tw", "parent_id": "t1_hyx6qw9", "score": "1", "subreddit": "WriteStreakGerman", "subreddit_id": "t5_364k6p"}, {"author": "luellababalola", "body": "Oh und! Vielen Dank für die Korrektur!", "created_utc": "1646057261.0", "edited": "False", "id": "hys1tmu", "is_submitter": "True", "link_id": "t3_t3dp9r", "parent_id": "t1_hys1seu", "score": "2", "subreddit": "WriteStreakGerman", "subreddit_id": "t5_364k6p"}, {"author": "luellababalola", "body": "Also, meine wortwörtliche Übersetzung ist nicht falsch? :)\n\nAhh, viel Glück einen guten Job nach deinem Abschluss zu finden. Alles wird gut :)", "created_utc": "1646057245.0", "edited": "False", "id": "hys1seu", "is_submitter": "True", "link_id": "t3_t3dp9r", "parent_id": "t1_hyrnu80", "score": "2", "subreddit": "WriteStreakGerman", "subreddit_id": "t5_364k6p"}, {"author": "luellababalola", "body": "Ja stimmt! In dem Video dachten die Deutschen, es heißt \"Ecke\", aber nein. Winkel heißt Laden. :)", "created_utc": "1646057037.0", "edited": "False", "id": "hys1d5f", "is_submitter": "True", "link_id": "t3_t2p34w", "parent_id": "t1_hyrnp6v", "score": "1", "subreddit": "WriteStreakGerman", "subreddit_id": "t5_364k6p"}, {"author": "luellababalola", "body": "Februari is vrijwel voorbij, niet te geloven! Het is wel de kortste maand van het jaar, maar deze keer is de tijd echt snel ge***~~f~~******v***logen *-> gevlogen*.\r  \n\r  \nDeze februari is misschien geen mooie maand geweest voor de rest van de wereld, maar wat mij betreft, kan ik zeggen dat deze maand heel aangenaam ***~~is~~*** geweest ***is***. Aangezien ik voor al mijn examens ***~~heb~~*** geslaagd ***ben***, heb ik van een pauze genoten die vier weken heeft geduurd. Vier vrije weken! Daarom heb ik eindelijk op mijn hobby's kunnen ***~~letten~~*** ***focussen***.\r  \n\r  \nIk heb bijvoorbeeld een aanzienlijke aantal boeken gelezen, ik heb naar een paar filmpjes gekeken, ik heb talen geleerd (wat ik altijd leuk vind), ik ***~~ben~~***  ***heb*** gewandeld enzovoort. Vaarwel februari!\n\n&#x200B;\n\n*Klinkt leuk! Hopelijk kan je het tijdens je semester nog verderzetten. Veel succes! :)*", "created_utc": "1646048966.0", "edited": "False", "id": "hyrnccb", "is_submitter": "False", "link_id": "t3_t39g1f", "parent_id": "t3_t39g1f", "score": "2", "subreddit": "WriteStreakNL", "subreddit_id": "t5_3g5eo9"}, {"author": "luellababalola", "body": "Vandaag heb ik geen inspiratie om een tekst te schrijven, maar het is pas de tweede dag van mijn streak en ik wil het niet breken. Het is niet dat ik niets wil schrijv***~~r~~***en. Ik kan gewoon niets interessants vinden om over te schrijven.\r  \n\r  \nVandaag was een erg saai***e*** dag. De enige keren dat ***i***k het huis verliet, ***(komma)*** ***~~waren~~*** ***was*** om met mijn hond rond te lopen. Behalve dat heb ik alleen voetbal gekeken, ***~~ons~~*** maaltijden gekookt, en het huis een beetje opgeruimd. Er gebeurde niets interessants genoeg om over te schrijven.\r  \n\r  \nDus ik schreef uiteindelijk over niks.\n\n&#x200B;\n\n*Om mijn Duits te oefenen, kijk ik video's van Easy German. Er bestaat ook zoiets als Easy Dutch op YouTube. Je hoeft de video's niet te bekijken als je niet wil, maar de titels kunnen je ideeën geven voor toekomstige onderwerpen indien je niets interessants te vertellen hebt. Komt wel goed, geloof in jezelf! :)*", "created_utc": "1646048847.0", "edited": "False", "id": "hyrn69e", "is_submitter": "False", "link_id": "t3_t35y7j", "parent_id": "t3_t35y7j", "score": "1", "subreddit": "WriteStreakNL", "subreddit_id": "t5_3g5eo9"}, {"author": "luellababalola", "body": "Du hast es sehr gut gemacht! Die zwei Sätze sind korrekt, und die 2. ist, ähm, \"Fahren wir mit dem Fahrrad oder gehen wir zu Fuß zum Laden?\"\n\nVielen Dank für die Korrektur! :D", "created_utc": "1646047900.0", "edited": "False", "id": "hyrlujn", "is_submitter": "True", "link_id": "t3_t2p34w", "parent_id": "t1_hyrcnf3", "score": "1", "subreddit": "WriteStreakGerman", "subreddit_id": "t5_364k6p"}, {"author": "luellababalola", "body": "Morgen begint het zomersemester. Vandaag is dus mijn laatste vrije dag. Het is wat jammer dat deze pauze al voorbij is, maar alles bij elkaar genomen heb ik van deze maand heel veel geprofiteerd. Ik heb me ontspannen en op mijn hobby's gelet. Zoals het lezen, het leren van talen of het schrijven.\r  \n\r  \nOverigens, ***ben*** ik ***~~ben~~*** benieuwd naar een paar cursussen die interessant lijken. Hopelijk zal dit semester niet te moeilijk zijn!\n\n*Komt goed, je bent een goede student. Geloof in jezelf :)*", "created_utc": "1645983334.0", "edited": "False", "id": "hyo1rna", "is_submitter": "False", "link_id": "t3_t2kbtw", "parent_id": "t3_t2kbtw", "score": "2", "subreddit": "WriteStreakNL", "subreddit_id": "t5_3g5eo9"}, {"author": "luellababalola", "body": "Welkom, veel succes! :)\n\nGeen zorgen, desnoods zoek je een aantal onderwerpen op. Er bestaan lijsten op het internet en zo.", "created_utc": "1645983262.0", "edited": "False", "id": "hyo1kxr", "is_submitter": "False", "link_id": "t3_t207yc", "parent_id": "t3_t207yc", "score": "2", "subreddit": "WriteStreakNL", "subreddit_id": "t5_3g5eo9"}, {"author": "luellababalola", "body": "Wir lernen so viele Sprachen in der Schule, aber wenn wir es nicht unterhalten, vergessen wir es wieder... Danke schön für die Korrektur! :)", "created_utc": "1645970036.0", "edited": "False", "id": "hyn6k3y", "is_submitter": "True", "link_id": "t3_t23ob2", "parent_id": "t1_hymzvcu", "score": "2", "subreddit": "WriteStreakGerman", "subreddit_id": "t5_364k6p"}, {"author": "luellababalola", "body": "Hahaha, ja, ich habe auf diese Subreddit gelesen, dass wer längere Texte schreibt, schneller lernt 😅", "created_utc": "1645880412.0", "edited": "False", "id": "hyiczg0", "is_submitter": "True", "link_id": "t3_t15veq", "parent_id": "t1_hyi9aw3", "score": "1", "subreddit": "WriteStreakGerman", "subreddit_id": "t5_364k6p"}, {"author": "luellababalola", "body": "Na een aanzienlijk lange pauze ben ik weer begonnen **~~om~~** ***met*** Anki te gebruiken **(1)**. Ik heb een bijzondere verhouding met dit programma. Aan de ene kant vind ik het handig om de woordenschat te herinneren en oefenen, maar aan de andere kant raak ik soms verveeld doordat Anki wel wat te veel van hetzelfde kan zijn.\r  \n\r  \nDe laatste tijd heb ik gemerkt dat ik heel wat nieuwe woorden en uitdrukkingen heb ontdekt en daarom heb ik besloten om Anki opnieuw te installeren. Het zou jammer zijn als ik deze nuttige woorden vergeet.\r  \n\r  \nDeze keer zal ik letten op de hoeveelheid kaartjes die ik elke dag toevoeg. Vroeger voegde ik vaak woorden toe die in werkelijkheid niet echt nuttig waren. Ik zal prioriteit geven aan de belangrijkste woorden. Trouwens, ik zal ook proberen om een kleiner**~~e~~** aantal kaarten per dag ***te*** herhalen. Hopelijk gaat het goed!\n\n**(1)** *deze zin is passief (ben begonnen) en maakt het, met de verbetering inclusief, nog steeds een beetje lastig. Om het jezelf makkelijker te maken, zou je kunnen zeggen : \"Na een aanzienlijk lange pauze gebruik ik Anki weer\".* \n\n*Klinkt erg interessant! Misschien kan ik het programma ook eens gebruiken. Goed geschreven, bijna geen foutjes :)*", "created_utc": "1645871897.0", "edited": "False", "id": "hyi1nen", "is_submitter": "False", "link_id": "t3_t1tpxu", "parent_id": "t3_t1tpxu", "score": "2", "subreddit": "WriteStreakNL", "subreddit_id": "t5_3g5eo9"}, {"author": "luellababalola", "body": "Een nieuwe Subreddit van de WS-familie **~~wordt~~**  ***werd*** pas geopend: r/readStreak! Het concept lijkt wel op dat van WriteStreak doordat je **~~in elk geval~~** **(1)** een tekst moet voorbereiden. Maar op readStreak moet je vooral op het lezen letten.\r  \n\r  \nJe schrijft elke dag een samenvatting van de pagina's van een boek dat je hebt gelezen **(2)**. Het boek is natuurlijk in een taal die je aan het leren bent, net zoals de tekst die je daarna moet voorbereiden. Trouwens, ik denk dat je op deze manier een soort \"portfolio\" kunt voorbereiden van alle boeken die je hebt gelezen **(2)**.\r  \n\r  \nHet mooiste **~~ervan~~** ***eraan*** is dat alle talen **~~zijn~~** geldig ***zijn***. Dat lijkt me een heel geweldig project! Ik vind het ook nuttig om het lezen te oefenen.\r  \n\r  \nIk zou er graag aan willen meedoen omdat ik dagelijks lees, maar ik ben al bezig met WriteStreak en met andere dingen. Hopelijk zal ik vroeger of later wel wat tijd vinden om iets op readStreak te schrijven. Tot nu toe zijn er teksten gepubliceerd in het Frans, Duits, Chinees, Engels en Spaans. Ik zou graag de eerste tekst in het Nederlands willen toevoegen!\n\n***(1)*** *dit is eigenlijk overbodig hier.*  \n***(2)*** *gelezen hebt klinkt natuurlijker, maar er is niets mis met \"hebt gelezen\".*\n\n*Goed geschreven en veel succes indien je er binnenkort mee zou beginnen! :)*", "created_utc": "1645871690.0", "edited": "False", "id": "hyi1ei4", "is_submitter": "False", "link_id": "t3_t05i27", "parent_id": "t3_t05i27", "score": "2", "subreddit": "WriteStreakNL", "subreddit_id": "t5_3g5eo9"}, {"author": "luellababalola", "body": "Hi both of you, I think I can help you out. I'm a Dutch native speaker from Belgium. My French is actually not too bad (being careful here because some might argue differently) due to studying in France, but that might make it easier for you to understand certain topics.", "created_utc": "1645864008.0", "edited": "False", "id": "hyhrv4g", "is_submitter": "False", "link_id": "t3_t1b8ba", "parent_id": "t1_hygcdtc", "score": "3", "subreddit": "learndutch", "subreddit_id": "t5_2t6rf"}, {"author": "luellababalola", "body": "Oh là là, viele Fehler. Zum Glück hast du verstanden, worüber? ich spreche ;).\nIch hoffe, du kannst der Pudding noch im Laden finden. Er klingt lecker, haha. Danke schön! :D", "created_utc": "1645862242.0", "edited": "False", "id": "hyhpj5s", "is_submitter": "True", "link_id": "t3_t15veq", "parent_id": "t1_hye2rbm", "score": "1", "subreddit": "WriteStreakGerman", "subreddit_id": "t5_364k6p"}, {"author": "luellababalola", "body": "Vielen Dank für die Korrektur! Am Ende wollte ich \"ihr\" benutzen, aber ich zweifelte. Schade! \n\nHoffentlich kannst du am Wochenende deinen Schlaf einholen/nachholen :)", "created_utc": "1645788957.0", "edited": "False", "id": "hydakj4", "is_submitter": "True", "link_id": "t3_t0jff5", "parent_id": "t1_hyd381e", "score": "1", "subreddit": "WriteStreakGerman", "subreddit_id": "t5_364k6p"}, {"author": "luellababalola", "body": "And thanks to you for your beautiful comment!\n\nI absolutely agree with you. Recovery isn't linear. On some days, we'll feel well. On others, we'll want to give up. It also isn't black and white; feeling emotions is hard, and allowing yourself to feel them is scary, too. What you're describing is basically becoming *human* again whereas we were literally surviving at first.", "created_utc": "1645729397.0", "edited": "False", "id": "hya00k7", "is_submitter": "True", "link_id": "t3_t0adgw", "parent_id": "t1_hy8y2ms", "score": "2", "subreddit": "fuckeatingdisorders", "subreddit_id": "t5_34jzi"}, {"author": "luellababalola", "body": "Looking forward to learn more about your reasons! :)", "created_utc": "1645729199.0", "edited": "False", "id": "hy9zhgx", "is_submitter": "True", "link_id": "t3_t0adgw", "parent_id": "t1_hy8s3q0", "score": "2", "subreddit": "fuckeatingdisorders", "subreddit_id": "t5_34jzi"}, {"author": "luellababalola", "body": "Thank you for sharing your reasons for recovery. They sound very important, thus I hope you'll keep them in mind whenever you want to give up.\n\nYou were unhappy and unwell before and chose to focus on food (and perhaps other things too) to gain control. I hope you'll find other methods on how to deal with your problems (I shifted focusing on food to focusing on uni, but also yoga and going for a short walk). It takes time, and it obviously doesn't solve my problems right away, but it is better than your life being controlled by food.\n\nWeight gain made me very anxious, and I thought I could never be happy once I'd gain x amount of weight. Little did I know that it feels much better having a stronger body that can take you places. You deserve to go back to college and to experience life without having to worry. \n\nHope you have an awesome day too x", "created_utc": "1645729175.0", "edited": "False", "id": "hy9zf5l", "is_submitter": "True", "link_id": "t3_t0adgw", "parent_id": "t1_hy8lz0a", "score": "3", "subreddit": "fuckeatingdisorders", "subreddit_id": "t5_34jzi"}, {"author": "luellababalola", "body": "This reminds me of the meme where one checks the ingredient list of a broccoli and it has milk powder in it, haha.", "created_utc": "1645575569.0", "edited": "False", "id": "hy1bfnt", "is_submitter": "False", "link_id": "t3_sywrsk", "parent_id": "t3_sywrsk", "score": "9", "subreddit": "vegan", "subreddit_id": "t5_2qhpm"}, {"author": "luellababalola", "body": "Previous comments have stated that you haven't given enough information for us to provide advice. However, I experienced something similar, so I'll give you some background information, and how I fixed it. I tried my best not to assume anything regarding your relationship to your sister. I'm sorry this is long, I just hope it'll be helpful.\n\nMy sister's 19, I'm 21. The age gap isn't as big as yours, but I'm the eldest, just like you. My *story* takes place 3 years ago, which makes my sister your sister's age.\n\nAt the time, I also felt like my sister had all the things I didn't have. She's incredibly intelligent (IQ = 119), gets the best grades, used to be popular in middle/high school, had and still has a lot of good quality friends, she's extraverted, not socially awkward at all, an incredible dancer (though she quit due to breaking her foot). The list is endless.\n\nI, on the other hand, wasn't any of that. I felt like she did everything better than I did. So, I despised her and I thought she didn't notice. One day, when I wasn't home, she broke down in front of my parents, asking them what on earth she'd done wrong for me to criticize and hate her like that. My mom told me afterwards, and that's when I realized it was way more serious than I thought it was.\n\nMy sister didn't do anything wrong. She was just being herself. And I, struggling with a combination of mental health issues, didn't accept myself enough to accept that. **The problem lay within me.**\n\nI had a real, and honest conversation with myself. **What was it that made me feel less worthy than her? Why did I think she deserved to have a sister who's that jealous? Do I have a reason to hate her?**\n\nI therefore **made a list** of all things I was jealous of and started to admire her for those things instead of despising. I was proud of her whenever she accomplished something, but I didn't show it. So, I changed that too, and **told her** how proud I am of her. These small changes and small acts improved our relationship significantly.\n\nAfter having taken a look at your previous posts, I have noticed that you're not doing too well, just like I was at the time. Having lunch together with your sister, who might not deal with issues related to food, will most likely be difficult. It was to me, anyway. She thoroughly enjoyed her meals, whereas I was stressed and didn't enjoy them in the slightest. She knew of my eating disorder, it was visible, and really difficult, and she always reassured me it was okay to eat. I don't know if yours knows about it, but that might be helpful to you too.\n\nOne must admit its mistakes, and that's why it's been 1.5 years that I had this conversation with my sister, 1.5 years after I changed (for the better). The conversation did wonders.\n\nMy sister and I are on the best terms we've ever been. She knows more about me than my parents, and vice versa. We're a team. We don't speak very often due to me living in a foreign country, but when we do, it's as if I'm talking to a long-lost friend, which she was for some time. **You deserve to heal your relationship, too.**\n\nI hope my story was somehow relatable, and I hope I didn't assume anything. The questions I asked myself (and put in bold) may help you, too.\n\n**You're not a bad person for hating your sister.** Neither is your sister a bad person, unless she's done you dirty. However, I believe people deserve more chances to prove their hearts are in the right places. If she hasn't done *anything* wrong, I'd say to work on your inner-self. The issue might lay within yourself (I hope that doesn't come off as rude, I'm not trying to be mean.)\n\nGood luck to you. I hope you feel safe enough to discuss the bad experience you've had with her. If you'd like to discuss your specific situation with me, feel free to DM me.", "created_utc": "1645536462.0", "edited": "False", "id": "hxym0rt", "is_submitter": "False", "link_id": "t3_sxqykg", "parent_id": "t3_sxqykg", "score": "1", "subreddit": "askwomenadvice", "subreddit_id": "t5_30m5u"}, {"author": "luellababalola", "body": "C'est clair pour moi, bien expliqué en plus, alors je n'ai plus de questions. Merci de tout coeur! :)", "created_utc": "1645525144.0", "edited": "False", "id": "hxy5ll2", "is_submitter": "True", "link_id": "t3_sygf02", "parent_id": "t1_hxxpgyj", "score": "5", "subreddit": "French", "subreddit_id": "t5_2rd5t"}, {"author": "luellababalola", "body": "Try to sort your thoughts and feelings before you do. Your initial post was a bit all over the place, so I assume it's similar in your head. Wait for the right moment; e.g. don't tell her when she's having a rough day.\n\nOnce you've come to terms with what you'd like to tell her, you have to try to be open to make sure that she understands how you feel and what intentions you have.Tell her what's on your mind as clearly as you can. Be respectful of her feelings throughout the process. Here's a moment where you need to be strong and honest even when it feels difficult. Open communication is a good base for your friendship, but also in case she would actually like you back.\n\nYou might want to write down what you want to tell her before actually telling her. You could even post it on Reddit to get some feedback, lol. Or feel free to DM me, I might be able to help you, too.\n\nGive her some time to think once you've confessed your feelings to her. She might need some space and time to take in what you've said to her. She might want to process things and take some time to explore her feelings. It's possible that she might like you, too, but will need time to open up to these new possibilities that have been presented.\n\nI suggest you have this conversation in real life, or at least over the phone. And, be prepared for her not liking you back. It will be a harsh blow to take, but it won't be the end of the world. You might be able to continue your friendship from there.\n\nGood luck!", "created_utc": "1645386463.0", "edited": "False", "id": "hxqp5rf", "is_submitter": "False", "link_id": "t3_swjbi2", "parent_id": "t1_hxqlj5k", "score": "1", "subreddit": "askwomenadvice", "subreddit_id": "t5_30m5u"}, {"author": "luellababalola", "body": "Serieus - serieuzer - meest serieus \n\nSimpel - simpeler - simpelst\n\nHope this helped :)", "created_utc": "1645380911.0", "edited": "False", "id": "hxqbp8n", "is_submitter": "False", "link_id": "t3_sx7984", "parent_id": "t3_sx7984", "score": "2", "subreddit": "learndutch", "subreddit_id": "t5_2t6rf"}, {"author": "luellababalola", "body": "Hi pal, you probably won't like the advice I'll be giving you, but I believe you might need to hear it.\n\nThis girl, who's your best friend, broke up with her ex, and got into a new relationship, right? It's hard because you would like to be with her. You can't, however, because she doesn't feel any romantic feelings towards you.\n\nShe was single for a while, right? If she wanted to be with you, she would've. By telling her how much you like her might fuck up the whole friendship, as there's this 0.05% chance that she'll like you back. It will probably become awkward, not only for her, but for you and the other guy, too.\n\nYou said being *just* friends will be difficult. This is where you'll have to make a choice:\n\n1. Tell her you like her, and possibly losing her as a friend,\n2. Tell her nothing, accept that she's not into you, and continue your friendship.\n\nIn case you don't feel like doing any of what I mentioned above, I suggest you take a step back. You can tell her why, or give another reason, so you can focus on yourself, and what you like. This space between you and herself will be necessary once you've accepted that you won't be more than friends and want to continue the friendship. Meet new people. She may be wonderful, but so are others.\n\nTo answer your question regarding toxicity; I don't know what you did that hurt her, so I cannot judge, but being friends with someone you cherish and have romantic feelings for doesn't necessarily mean you're toxic.", "created_utc": "1645380411.0", "edited": "1645381064.0", "id": "hxqagy9", "is_submitter": "False", "link_id": "t3_swjbi2", "parent_id": "t3_swjbi2", "score": "1", "subreddit": "askwomenadvice", "subreddit_id": "t5_30m5u"}, {"author": "luellababalola", "body": "I find it hard learning 4 languages at a time. There’s none I feel very comfortable in because I cannot spend enough time doing so if I also want to do things besides learning languages (I am a slow learner).\n\nI like to read. Books, for instance, but you could also read an article online or something like that. Listening to music also helps, but not really when wanting to improve my knowledge. I know a lot of people who like watching shows and YouTube videos, but I find them rather time consuming. When I do so, I make sure the audio’s in a language I feel less comfortable with, the subtitles in a language I feel more comfortable with. \n\nWhat’s most important, is trying to incorporate the four different disciplines into your routine: reading, writing, listening and speaking. When reading, you can do so aloud (this is what I did when reading a  Spanish book) or listening (I read & listened when reading poetry in French). You could, when reading an article, try to summarise it. This would mean you combine reading + writing or reading + speaking. When watching a video, you can imitate the accents, tell yourself what it was about, or write a summary. I find trying to incorporate  the different disciplines into one activity to help me progress faster. \n\nI hope this might somehow help you at least a bit", "created_utc": "1645309756.0", "edited": "False", "id": "hxms10p", "is_submitter": "False", "link_id": "t3_swk13w", "parent_id": "t3_swk13w", "score": "13", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "luellababalola", "body": "Yes, you can ask « ik ben dom, niet? » which would be a question you ask someone else :)", "created_utc": "1645299254.0", "edited": "1645303053.0", "id": "hxm3vb2", "is_submitter": "False", "link_id": "t3_swgome", "parent_id": "t1_hxm1a7c", "score": "2", "subreddit": "learndutch", "subreddit_id": "t5_2t6rf"}, {"author": "luellababalola", "body": "You could say « Ik ben geen dom persoon ». « Ik ben geen dom » is an unfinished sentence.", "created_utc": "1645299204.0", "edited": "False", "id": "hxm3qzw", "is_submitter": "False", "link_id": "t3_swgome", "parent_id": "t1_hxm12wi", "score": "1", "subreddit": "learndutch", "subreddit_id": "t5_2t6rf"}, {"author": "luellababalola", "body": "I'd like to add something to u/MsStormyTrump's comment, which is totally correct, but I'd like to give some more information that might be helpful.\n\n**Niet** is used to negate the saying of a sentence or a whole sentence.\n\n* Ze draagt ***niet*** graag oorbellen -> She doesn't like to wear earrings. (***niet*** denies liking to wear earrings)\n* Aarzel ***niet*** een zinvolle bijdrage te leveren -> Don't hesitate to make a meaningful contribution. (***niet*** denies hesitatation to make a meaningful contribution)\n* Ik ben ***niet*** dom -> I'm not stupid. (***niet*** denies being stupid)\n\n**Geen** is used to negate an indefinite noun.\n\n* Ik wil ***geen*** hond -> I don't want a dog. (***geen*** denies not wanting a dog)\n* Ik heb ***geen*** geld -> I have no money. (***geen*** denies having money)\n* Ze draagt ***geen*** oorbellen -> She is not wearing earrings. (***geen*** denies wearing earrings)\r\n\nIn some cases, both **niet** and **geen** are possible, because the negation can apply to the noun as well as to the proverb or the whole sentence.\n\n* Waarom zou je ***geen*** tweedehandswagen kopen? -> Why not buy a second-hand car? (***geen*** goes with second-hand car)\n* Waarom zou je ***niet*** een tweedehandswagen kopen? -> Why shouldn't you buy a second-hand car? (***niet*** goes with second-hand car)\n\n&#x200B;\n\nI hope this made it a bit more clear :)", "created_utc": "1645296751.0", "edited": "False", "id": "hxlxo6m", "is_submitter": "False", "link_id": "t3_swgome", "parent_id": "t3_swgome", "score": "28", "subreddit": "learndutch", "subreddit_id": "t5_2t6rf"}, {"author": "luellababalola", "body": "I prefer entirely plant-based meals where the source of protein are beans, lentils, chickpeas, etc. Or tofu / tempeh. I never liked the taste of actual meat, hence why I never buy anything that is supposed to taste like it.\n\nI do, however, like falafels and lentil burgers which I make myself :)", "created_utc": "1645296028.0", "edited": "False", "id": "hxlvwsh", "is_submitter": "False", "link_id": "t3_swdd0k", "parent_id": "t3_swdd0k", "score": "2", "subreddit": "vegan", "subreddit_id": "t5_2qhpm"}, {"author": "luellababalola", "body": "Hi, if you live in (or near) Antwerp, you could check out [Linguapolis](https://www.uantwerpen.be/nl/centra/linguapolis/taalcursussen/aanbod-talen/nederlands/). They offer a broad range of language courses, including Dutch for non-natives. I've heard a lot of good things about them, and am thinking about following their Spanish summer class. \n\nGood luck! :)", "created_utc": "1645295191.0", "edited": "False", "id": "hxltvvk", "is_submitter": "False", "link_id": "t3_sw8467", "parent_id": "t3_sw8467", "score": "1", "subreddit": "learndutch", "subreddit_id": "t5_2t6rf"}, {"author": "luellababalola", "body": "Tussen 17 en 18 februari werd Nederland – samen met andere Europese landen – ***g***etroffen door de zogenoemde storm Eunice.\n\nDe storm is nu vrijwel voorbij: in alleen ***(1)*** maar zes provincies geldt tegenwoordig nog code geel. Maar nu moet Nederland met schade omgaan.\n\nVerschillende bomen zijn ontworteld door de wind en vier mensen zijn daardoor om het leven gekomen.\n\nVerschillende huizen en gebouwen zijn ook ***(2)*** door de windkracht beschadigd geraakt. Meestal daken en zonnepanelen. Veel mensen hebben hun huizen ook moeten verlaten.\n\nMet windstoten van ongeveer 140 kilometer per uur geldt Eunice als één van de hardste sto***r***men ter laatste ***(3)*** 100 jaar.\n\n&#x200B;\n\n***(1)*** *in slechts\" klinkt vlotter. \"in maar\" gaat ook. De alleen is niet verkeerd, maar kan je voor vlotheid best weglaten.*  \n***(2)*** *Je kan \"ook\" beter vooraan in je zin plaatsen (iets wat in het Frans niet gedaan wordt). In principe is de plaats van \"ook\" niet verkeerd, maar aangezien je zo goed schrijft, geef ik je graag enkele mogelijkheden om het \"nog\" beter te doen.*  \n***(3)*** *Dit klinkt enorm oud. Je kan best schrijven/zeggen: van de laatste 100 jaar.*\n\n&#x200B;\n\n*Moeilijk onderwerp en heel goed geschreven. Proficiat :)*", "created_utc": "1645294519.0", "edited": "1645294905.0", "id": "hxls8vy", "is_submitter": "False", "link_id": "t3_sw614p", "parent_id": "t3_sw614p", "score": "2", "subreddit": "WriteStreakNL", "subreddit_id": "t5_3g5eo9"}, {"author": "luellababalola", "body": "Een typfout, dat is wat ik ook dacht :)", "created_utc": "1645178469.0", "edited": "False", "id": "hxfgati", "is_submitter": "False", "link_id": "t3_sunomm", "parent_id": "t1_hxctnhw", "score": "2", "subreddit": "WriteStreakNL", "subreddit_id": "t5_3g5eo9"}, {"author": "luellababalola", "body": "Draag ik een polshorloge? Ja. Vroeger droeg ik het nooit. Ik rekende op mijn mobieltje o***f*** op het wandhorloge toen ik op school was.\r  \n\r  \nSinds ik naar de universiteit ga, vind ik het vrijwel nodig om een polshorloge te dragen. Ik moet op de verschillende lessen letten, maar ook op de dienstregeling van de bussen enzovoort. Een polshorloge is handiger dan een mobieltje: je kunt het sneller controleren en bij elke gelegenheid gebruiken (terwijl je het mobieltje niet altijd gebruiken mag, bijvoorbeeld tijdens een examen of een les).\n\n&#x200B;\n\n*En weer volledig, buiten de \"or\", in orde. Goed gedaan! :)*", "created_utc": "1645122603.0", "edited": "False", "id": "hxc9864", "is_submitter": "False", "link_id": "t3_sunomm", "parent_id": "t3_sunomm", "score": "2", "subreddit": "WriteStreakNL", "subreddit_id": "t5_3g5eo9"}, {"author": "luellababalola", "body": "Vanochtend heb ik besloten om een lijst voor te bereiden van alle ongelezen boeken die in mijn boekenkasten staan.\r  \n\r  \nIn totaal heb ik 35 ongelezen boeken nageteld. Dat zijn redelijk ***veel boeken (1)***! Maar eerlijk gezegd ***(komma)*** vind ik dit cijfer beter dan mijn oorspronkelijke verwachting!\r  \n\r  \nNu weet ik welke boeken ik eerst wil lezen. Mijn doel is best simpel: ik wil dit cijfer dag aan dag verminderen. Trouwens, ik weet dat er reeds vanavond 34 ongelezen boeken zullen zijn! En morgen 33, hopelijk ***(2)***!\n\n&#x200B;\n\n***(1)*** *Om herhaling te vermijden:* ***Dat zijn er redelijk veel!***   \n***(2)*** *Hier zou je \"hopelijk\" beter midden in je zin schrijven:* ***En morgen hopelijk 33!***\n\n*Goed geschreven alweer! :)*", "created_utc": "1644888109.0", "edited": "False", "id": "hwz9esg", "is_submitter": "False", "link_id": "t3_ss6ksx", "parent_id": "t3_ss6ksx", "score": "2", "subreddit": "WriteStreakNL", "subreddit_id": "t5_3g5eo9"}, {"author": "luellababalola", "body": "Dit is een onderwerp dat ik op WS-German heb gelezen. Als een bezoeker jullie huis binnengaat, moet hij zijn schoenen uitdoen? Of mag hij ze aanhouden?\r  \n\r  \nBij mij moet een bezoeker zijn schoenen bijna altijd uitdoen. Hij mag ze aanhouden als hij er een poosje blijft of als hij alleen maar de begane grond bezoekt. Daarna wordt de vloer natuurlijk schoongemaakt.\r  \n\r  \nJa, bij mij is **de schoonheid** heel belangrijk!\n\n&#x200B;\n\n*We spreken over schoonheid wanneer we het echt kunnen zien (bijvoorbeeld natuur, personen, enz). In jouw context kan je beter* ***netheid*** *of* ***properheid*** *gebruiken. Maar schoonheid is ook heel goed te begrijpen.* \n\n*Goed geschreven, geen fouten! :)*", "created_utc": "1644871181.0", "edited": "False", "id": "hwyayzl", "is_submitter": "False", "link_id": "t3_sqpv4c", "parent_id": "t3_sqpv4c", "score": "2", "subreddit": "WriteStreakNL", "subreddit_id": "t5_3g5eo9"}, {"author": "luellababalola", "body": "It's funny how I'm learning the languages you're learning too + your first language (I clicked on your profile because I was curious). Good luck learning all of them! :)", "created_utc": "1644651707.0", "edited": "False", "id": "hwmaaoh", "is_submitter": "False", "link_id": "t3_sqgq2n", "parent_id": "t1_hwlt7ly", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "luellababalola", "body": "Hoegaarden is 1) een dorp in België waar men 2) bier brouwt dat gekend is in de hele wereld!\n\n*Edit : nu brouwen ze het niet langer daar, vermoed ik. Het maakt onderdeel uit van AbInbev.*", "created_utc": "1644482020.0", "edited": "False", "id": "hwceoqn", "is_submitter": "False", "link_id": "t3_sovgwu", "parent_id": "t1_hwbrmft", "score": "7", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "luellababalola", "body": "Hi! I really like your idea.\n\nAs a non-native French speaker who lives in France, and speaks German too, I can confirm that people switch more easily to English in Germany than they do in France. Actual natives will be more helpful than I am, but I think you'll be able to practise everywhere. \n\nSo, if I were you, I'd choose places that you'd really like to see/visit. This is just a thought, I have no prove whatsoever, but places which are on the *route the soleil* might speak English more fluently due to the large amount of tourists that take the route to travel to the south. \n\nGood luck! :)", "created_utc": "1644432869.0", "edited": "False", "id": "hw9dqtu", "is_submitter": "False", "link_id": "t3_sokpc4", "parent_id": "t3_sokpc4", "score": "7", "subreddit": "French", "subreddit_id": "t5_2rd5t"}, {"author": "luellababalola", "body": "Ok, vielen Dank für die Korrektur und die Hilfe! :)", "created_utc": "1643883069.0", "edited": "False", "id": "hvei6ng", "is_submitter": "True", "link_id": "t3_sg03w1", "parent_id": "t1_hvbd6x0", "score": "1", "subreddit": "WriteStreakGerman", "subreddit_id": "t5_364k6p"}, {"author": "luellababalola", "body": "Vielen Dank für die Korrektur! :)", "created_utc": "1643783182.0", "edited": "False", "id": "hv8tlau", "is_submitter": "True", "link_id": "t3_sfbqv6", "parent_id": "t1_hv8o9nl", "score": "2", "subreddit": "WriteStreakGerman", "subreddit_id": "t5_364k6p"}, {"author": "luellababalola", "body": "Vielen Dank für die Korrektur und der Wunsch! :)", "created_utc": "1643692149.0", "edited": "False", "id": "hv3gnio", "is_submitter": "True", "link_id": "t3_sehvbe", "parent_id": "t1_huyhxtg", "score": "2", "subreddit": "WriteStreakGerman", "subreddit_id": "t5_364k6p"}, {"author": "luellababalola", "body": "Danke schön! :)", "created_utc": "1643490907.0", "edited": "False", "id": "hurn7yn", "is_submitter": "True", "link_id": "t3_sc6w7a", "parent_id": "t1_hup5g5i", "score": "2", "subreddit": "WriteStreakGerman", "subreddit_id": "t5_364k6p"}, {"author": "luellababalola", "body": "Danke schön! :)\n\nAhh, ja, das verstehe ich! + dieser Ausdruck ist sehr toll, ich werde ihn erinnere :)", "created_utc": "1643287166.0", "edited": "False", "id": "hufjljf", "is_submitter": "True", "link_id": "t3_sdsorp", "parent_id": "t1_huf1w5z", "score": "2", "subreddit": "WriteStreakGerman", "subreddit_id": "t5_364k6p"}, {"author": "luellababalola", "body": "Oh ja, die heb ik ook gebruikt! Laten we hopen dat de eczeem toch snel weg gaat :)", "created_utc": "1643267929.0", "edited": "False", "id": "huetm00", "is_submitter": "False", "link_id": "t3_sby88f", "parent_id": "t1_huchvgn", "score": "1", "subreddit": "WriteStreakNL", "subreddit_id": "t5_3g5eo9"}, {"author": "luellababalola", "body": "Es mag nicht ganz klar sein, über welches Land ich spreche ;).\n\nVielen Dank für die Korrektur! :) ich komme aus Belgien. Das hast du gut geratetn vermutet? Ich wusste nicht, dass es vieles Bier in Tschechien gibt!", "created_utc": "1643221114.0", "edited": "False", "id": "hubqna7", "is_submitter": "True", "link_id": "t3_scyt33", "parent_id": "t1_hub8fye", "score": "1", "subreddit": "WriteStreakGerman", "subreddit_id": "t5_364k6p"}, {"author": "luellababalola", "body": "Nein, ich wollte sagen, dass Amerikaner nur mehr touristische Länder besuchen! :)\n\nUnd ja, stimmt! Ich komme aus Belgien!", "created_utc": "1643220921.0", "edited": "False", "id": "hubq455", "is_submitter": "True", "link_id": "t3_scyt33", "parent_id": "t1_hub0mgp", "score": "1", "subreddit": "WriteStreakGerman", "subreddit_id": "t5_364k6p"}, {"author": "luellababalola", "body": "Zo leerde ik ook over \"wilde\" en \"wou\" (meer courant in België). Het zit 'm in de kleine verschillen :)", "created_utc": "1643176209.0", "edited": "False", "id": "hu9e3wy", "is_submitter": "False", "link_id": "t3_saph9g", "parent_id": "t1_hu56ffh", "score": "1", "subreddit": "WriteStreakNL", "subreddit_id": "t5_3g5eo9"}, {"author": "luellababalola", "body": "Je zou het goed doen ;)", "created_utc": "1643176153.0", "edited": "False", "id": "hu9e0ct", "is_submitter": "False", "link_id": "t3_sax6jb", "parent_id": "t1_hu6iu6k", "score": "1", "subreddit": "WriteStreakNL", "subreddit_id": "t5_3g5eo9"}, {"author": "luellababalola", "body": "Hallo iedereen!\r  \n\r  \nVandaag heb ik veel geleerd over frettenpoep. Fretten zijn heel schattig, slim en actief, maar ze hebben een nadeel: de poep en de geur ervan. Om dat te voorkomen is het belan***g***rijk om hun nest dagelijks te verversen. Want als je het nest opruimt, vinden ze nieuwe geheime plekjes om te poepen. En het kan onmogelijk zijn om ze te vinden. Ik heb ook geleerd dat je de fret niet vaak hoeft te wassen. *(punt in plaats van komma).* ***J***e k***an*** zel***f***s 3-4 maanden wachten. Fretten hebben ook zeer gevoeli***~~n~~***ge longen. *(punt in plaats van komma).* ***D***aarom is het belangrijk om geen deodorant te gebruiken. Ik heb geen fretten, maar overweeg ***~~gewoon~~*** ***er (te kopen/adopteren/nemen)*** voor de toekomst :)", "created_utc": "1643110027.0", "edited": "False", "id": "hu52tho", "is_submitter": "False", "link_id": "t3_s9nmfp", "parent_id": "t3_s9nmfp", "score": "1", "subreddit": "WriteStreakNL", "subreddit_id": "t5_3g5eo9"}, {"author": "luellababalola", "body": "Vandaag werd ik wakker met een klein stukje eczeem op een vinger ***~~in~~*** ***van*** mijn linkerhand. Ik denk dat het ***~~was~~*** misschien ***een paar dagen geleden*** veroorz***a***akt ***was*** bij fietsen in de koud***e*** zonder handschoenen ***~~een paar dagen geleden~~*** (Ik liep uit ***~~t~~***huis en ***~~ben~~*** ***was*** ze vergeten). Het is ***een*** extrem***e*** kriebeling! Helemaal niet leuk. Ik heb wat cr***è***me en hopelijk ***dat*** kan ***dat*** het genez***en***. Dit is de het onderwerp ***waaraan*** ik ***vanavond*** dacht ***~~vanavond~~*** omdat het ***~~is~~*** onmogelijk ***is*** om er niet aan t***~~h~~***e denken. *(punt in plaats van komma)* ***H***et is echt vervelend! Voor***~~dat~~*** de pandemie ***kreeg*** ik bijna nooit ***~~kreeg~~*** eczeem, maar nu is het helaas vaker. ***Ik ben n***iet zeker waarom... Ik heb sowieso altijd veel mijn handen gewassen.\n\n&#x200B;\n\n*Het zou misschien kunnen komen door de alcoholische gel. Deze droogt je handen uit. Ik gebruik* [deze](https://www.newpharma.nl/bioderma/161585/bioderma-atoderm-herstellende-handcreme-droge-en-beschadigde-handen-tube-50ml-nieuwe-formule.html)*handcrème, die helpt m'n handen enorm goed. Welke gebruik jij?*", "created_utc": "1643109901.0", "edited": "False", "id": "hu52n6n", "is_submitter": "False", "link_id": "t3_sby88f", "parent_id": "t3_sby88f", "score": "3", "subreddit": "WriteStreakNL", "subreddit_id": "t5_3g5eo9"}, {"author": "luellababalola", "body": "Gisteren he***b*** ik voor het eerst een kaassnijder gebruikt. Het verhaal begon toen ik bij de Albert Heijn was. Ik zag dat een heel blok ka***a***s kopen goedkoper was dan plakken. Toen zag ik de uitgelezen kans om gebruik te maken van de kaas***s***nijder waar mijn vorige huurders achter leven ***(1)***. Ik denk dat dit een unieke Nederlandse stijl is, maar misschien heb ik het mis, en je kunt deze manier van ka***a***s snijden in andere landen vinden. Ik herinne***r*** me dat ik in mijn eerste jaar van de Master in Nederland mijn collega's de kaas zag snijden met de kaassnijder voor ***een*** maaltijd. Toen ik het gisteren gebruikte, dacht ik dat het een speciaal moment was :)\n\n***(1)*** *bedoel je hier de Engelse uitdrukking \"to swear by\"? Of wat bedoel je juist?*\n\n*In België vind je ook kaassnijders. Waarschijnlijk ook nog wel in andere landen zoals bijvoorbeeld Frankrijk of Zwitserland wat ook kaaslanden zijn.*", "created_utc": "1643109530.0", "edited": "False", "id": "hu5252t", "is_submitter": "False", "link_id": "t3_sbxhwr", "parent_id": "t3_sbxhwr", "score": "1", "subreddit": "WriteStreakNL", "subreddit_id": "t5_3g5eo9"}, {"author": "luellababalola", "body": "Vandaag nam ik een tijdschrift van Albert Heijn ***(1)***. Mijn idee was om inspiratie uit de foto's te halen om te koken. Toen begon ik het te lezen en realiseerde ik me dat dit ook een prima oefening was om Nederlands te oefenen. In dit m***a***gazine vind je veel recepten, maar ook wat verhalen of meningen van mensen die bij ***~~de~~*** Albert Heijn werken *(****2)***. Vroeger las ik alleen kinderboek***en*** *(geen komma)* en dit is ingewikkelder. Toch denk ik dat het een geweldige manier is om nieuwe woorden te leren. Ik vind het leuk om nieuwe manieren te vinden om Nederlands te oefenen. (punt) **I**k integreer dit liever in mijn dagelijkse routine dan dat ik uit een tekstboek studeer. Maar ik ben me ervan bewust dat ik dat nodig zal hebben om mijn grammatica te verbeteren. Tot morgen :)\n\n***(1)*** *Het idee is duidelijk, maar het is niet juist geformuleerd. Hier zijn twee mogelijkheden:*\n\n* *Vandaag nam ik een tijdschrift van AH mee.*\n* Vandaag kocht ik een tijdschrift bij AH.\n\n***(2)*** *\"die bij Albert Heijn werken\" of \"die bij de AH werken\"*\n\n&#x200B;\n\n*Ik ben het helemaal met je eens! Heb je al wat recepten geprobeerd, trouwens? :)*", "created_utc": "1643109356.0", "edited": "False", "id": "hu51wvh", "is_submitter": "False", "link_id": "t3_sb3umg", "parent_id": "t3_sb3umg", "score": "1", "subreddit": "WriteStreakNL", "subreddit_id": "t5_3g5eo9"}, {"author": "luellababalola", "body": "Er zijn veel verschillende manieren om koffie te maken. Mijn favoriete manier***~~s~~*** ***~~zijn~~*** ***is ge***filter***de*** koffie en espresso. Voor ***ge***filter***de*** koffie gebruik ik een Chemex met papieren filters. Ik heb ***het*** ook ***m***et metalen gaas geprobeerd, maar ik heb liever het papier. Voor espresso heb ik een handlei***d***ing ***\"E***spresso maker genaamd the \"flair\". Het is goedkoper dan een norma***~~a~~***l***e (normale)*** machine *(geen komma)* en het kan geweldige espresso maken. Ik maal de koffie het lief***s***t***~~s~~*** ***(liefst)*** met een handmolen.\r  \n\r\r  \nAls ik tijd heb, zet i***k*** graag een kopje koffie voordat ik naar mijn werk ga. Helaas is dit zelden het geval *(geen komma)* omdat ik ook graag slaap. Dus haal ik het grootste deel van mijn koffie uit de machine op mijn werk.\r  \n\r  \n\rDank je voor het lezen, ik wens je een goede dag!\n\n*Goed geschreven! Voor jou ook een fijne dag! :)*", "created_utc": "1643109195.0", "edited": "False", "id": "hu51p3t", "is_submitter": "False", "link_id": "t3_sb3jb5", "parent_id": "t3_sb3jb5", "score": "1", "subreddit": "WriteStreakNL", "subreddit_id": "t5_3g5eo9"}, {"author": "luellababalola", "body": "Hoi allemaal,\r  \n\r  \nVandaag was de Topper *(geen komma)* een voetbalwedstrijd tussen PSV en Ajax ***~~bij~~***  ***in*** het Philips Stadion. Voor de wedstrijd stond PSV op eerste plaats in de Eredivisie met een voorsprong van één punt op Ajax.\r  \n\r  \nIk heb de wedstijd in het Nederlands bekeken en begreep ongeveer zeventig procent van ***~~het~~*** ***de*** commentaar. Het was een heel spannende wedstrijd ondanks het feit dat er door de coronamaatregelen geen supporters in het stadion waren.\r  \n\r  \nBrian Brobbey, onlangs teruggekeerd van RB Leipzig, maakte in de 34ste minuut het eerste doelpunt met zijn hoofd. De gelijkmaker voor PSV kwam van Mario Götze toen hij toesloeg op een foutje van de Ajax-defensie.\r  \n\r  \nDe beslissende treffer kwam van Noussair Mazraoui *(komma vervangen door een dubbelpunt : )* een schitterende uithaal van buiten de zestien in de 74ste minuut. Dit doelpunt zorgde voor veel ophef bij de VAR of de bal wel of niet over de zijlijn eerder in de actie ging.  ***Over h***et goedkeuren van het doelpunt zal nog lang worden nagepraat.\r  \n\r  \n***~~Het~~***  ***De*** wedstrijd eindigde als een 2-1 nipte overwinning en als support***er*** van Ajax ***~~daar~~*** ben ik ***daar*** blij mee. Ajax neemt nu ***de*** koppositie over van PSV met een voorsprong van twee punten.\r  \n\r  \nBedankt zoals altijd voor het lezen en tot morgen!\n\n&#x200B;\n\n*Heel goed geschreven! Net een echte sportjournalist ;)*", "created_utc": "1643109002.0", "edited": "False", "id": "hu51fq3", "is_submitter": "False", "link_id": "t3_sax6jb", "parent_id": "t3_sax6jb", "score": "2", "subreddit": "WriteStreakNL", "subreddit_id": "t5_3g5eo9"}, {"author": "luellababalola", "body": "WordReference is misschien één van de beroemdste online en gratis woordenboeken die je kan vinden. Het is ook het eerste online woordenboek dat ik ooit heb gebruikt toen ik ***nog*** Engels ***~~nog~~*** aan het leren was. Daarom heb ik een soort goede en lange \"verhouding\" ***(1)*** met dit woordenboek.\r  \n\r  \nIk heb pas ontdekt dat je verschillende WR-woordenboeken mag combineren! Op deze manier kan ik eindelijk een Nederlands-Frans woordenboek gebruiken om beide talen te oefenen. Of een NL-IT woordenboek zodat ik over een directe vertaling naar mijn moedertaal kan beschikken.\r  \n\r  \nhttps://www.wordreference.com/virtual\\_dictionaries.html hier k***a***n ***(2)*** je interessante combinaties kiezen. Net zoals de webpagina zegt, zijn de vertalingen niet altijd precies. Tot nu toe heb ik goede en correcte vertalingen gekregen, maar je krijgt nauwelijks voorbeeldzinnen. In elk geval k***a***n ***(2)*** je eraan bijdragen als je beide talen goed kent.\n\n***(1)*** *Verhouding klopt in deze context! In principe moet je het dus niet tussen haakjes plaatsen.*\n\n***(2)*** *\"Hier kun je...\" is eerder spreektaal.*", "created_utc": "1643108835.0", "edited": "False", "id": "hu517r0", "is_submitter": "False", "link_id": "t3_saph9g", "parent_id": "t3_saph9g", "score": "2", "subreddit": "WriteStreakNL", "subreddit_id": "t5_3g5eo9"}, {"author": "luellababalola", "body": "Een van de ontdekkingen toen ik in Nederland aankwam was de roti. Het was een gerecht dat ik nog niet eerder heb geprobeerd. In het gebied waar ik nu woon heb ik hele goede opties. Maar het kan verslavend worden *(geen komma)* want als ik op straat ben en ik plotseling roti ruik, kan het heel moeilijk zijn om weerstand te ***~~beiden~~*** ***bieden***. Maar van tijd tot tijd is het een van mijn f***a***voriete avondeten ***(1)***. Ook de plek waar ik roti koop *(geen komma)* ***~~ze~~*** kennen  ***ze*** me al, dus ze weten altijd wat ik ga vragen. Als ik op een dag Nederland verlaat, weet ik dat ik ***veel*** roti ***veel*** zal missen *(geen komma)* en natuurlijk ook andere dingen! Tot morgen!\n\n***(1)*** *Gerechten klinkt beter, maar het is in principe niet verkeerd.*\n\n*In principe is roti een Indiase/Pakistaanse specialiteit, als ik het niet fout heb. Ik vermoed dat je het overal zal kunnen krijgen. :)*", "created_utc": "1643108709.0", "edited": "False", "id": "hu511qm", "is_submitter": "False", "link_id": "t3_saequd", "parent_id": "t3_saequd", "score": "1", "subreddit": "WriteStreakNL", "subreddit_id": "t5_3g5eo9"}, {"author": "luellababalola", "body": "Vandaag probeer ik om lampen te maken. Ik ging naar GAMMA een kocht verschillende stukken om te ***~~experimenten~~*** ***experimenteren***. Ik heb een taffel lampen transformeren zodat het hoeft niet langer in de muur te worden gestoken ***(1)***. Ik heb ook een T8 LED buis dat ik wil gebruiken om een lichtbox voor kruiden en microgreens te ***~~maken~~*** ***kweken (2)***. Ik vond een paar heel mooi verhuisfittingen dat ik zal gebruiken om gem***~~m~~***ak***k***elijk lampen te maken. Ik heb ook wat dimbare gloeilampen gekocht omdat ik ***~~een~~*** licht wil maken dat 's ochtends langzaam aan gaat. Ik had niet gerealiseerd dat het circuit om de lichten te dimmen ingewikkeld ***~~is~~*** ***zou zijn (3)***.\n\n***(1)*** *Dit komt waarschijnlijk door mijn onwetendheid, maar ik kon het niet online vinden; wat zijn taffel lampen? De zin schrijf je het best zo:* ***Ik heb taffel lampen getransformeerd zodat het niet langer in de muur gestoken zou moeten worden.***\n\n***(2)*** *Het woord maken kan je met veel gebruiken, maar je kweekt (of zaait wanneer het over zaden gaat) de microgreens.*\n\n***(3)*** *Met \"is\" op het einde zou je ook kunnen zeggen: \"Ik realiseerde me niet dat ... ingewikkeld is.\"*", "created_utc": "1643108543.0", "edited": "False", "id": "hu50tx7", "is_submitter": "False", "link_id": "t3_sae4cw", "parent_id": "t3_sae4cw", "score": "1", "subreddit": "WriteStreakNL", "subreddit_id": "t5_3g5eo9"}, {"author": "luellababalola", "body": "Waarvoor zijn jullie allergisch? Ik ben allergisch voor stof. Wat allergieën betreft, kan het altijd tegenvallen. Gelukkig is mijn allergie voor stof niet ernstig. Maar als er te veel stof ligt, moet ik ***~~dan~~*** vaak niezen en dat wordt op den duur irritant, voornamelijk als ik moet werken. Ik heb veel zakdoeken nodig als er veel stof in de lucht is.\n\n&#x200B;\n\n*Eén klein foutje, voor de rest alles in orde. Een allergie voor stof lijkt me irritant...*", "created_utc": "1643108256.0", "edited": "False", "id": "hu50gmo", "is_submitter": "False", "link_id": "t3_s9zcro", "parent_id": "t3_s9zcro", "score": "2", "subreddit": "WriteStreakNL", "subreddit_id": "t5_3g5eo9"}, {"author": "luellababalola", "body": "Vielen Dank für die Korrektur :)!", "created_utc": "1643091001.0", "edited": "False", "id": "hu4djyj", "is_submitter": "True", "link_id": "t3_saoovn", "parent_id": "t1_hu4asdj", "score": "2", "subreddit": "WriteStreakGerman", "subreddit_id": "t5_364k6p"}, {"author": "luellababalola", "body": "1. Vielen Dank! Ich finde es immer schwierig, die richtige Präpositionen zu benutzen.\n\n2. Ich habe der Text heute Morgen geschrieben, als ich noch nicht so gut wach war... Ich wollte Singular schreiben :)\n\n3 und 4. Ok, habe ich verstanden und werde ich notieren!\n\nVielen Dank für die Korrektur! :)", "created_utc": "1643025683.0", "edited": "False", "id": "hu0ch4i", "is_submitter": "True", "link_id": "t3_sbein5", "parent_id": "t1_htzq690", "score": "2", "subreddit": "WriteStreakGerman", "subreddit_id": "t5_364k6p"}, {"author": "luellababalola", "body": "Das freut mich! Hast du die andere Bücher auch schon gelesen? :) \n\nDanke schön für die Korrektur!", "created_utc": "1643025455.0", "edited": "False", "id": "hu0c5bs", "is_submitter": "True", "link_id": "t3_sbein5", "parent_id": "t1_htzow1n", "score": "1", "subreddit": "WriteStreakGerman", "subreddit_id": "t5_364k6p"}, {"author": "luellababalola", "body": "Danke schön für die Korrektur! Es ist immer schwer, die Reihenfolge zu respektieren. Vielleicht ist es eine gute Idee, darüber ein bisschen mehr zu lernen. Danke :)", "created_utc": "1642925195.0", "edited": "False", "id": "htuv8iv", "is_submitter": "True", "link_id": "t3_sa89qf", "parent_id": "t1_htujxfs", "score": "2", "subreddit": "WriteStreakGerman", "subreddit_id": "t5_364k6p"}, {"author": "luellababalola", "body": "Ahh, das ist sehr interessant! Ich habe bemerkt, ich benutze oft Wörter, die nicht gut im Satz passen. Ich werde alles notieren, damit ich diese Fehler hoffentlich nicht mehr machen soll.\n\nDanke sehr :)", "created_utc": "1642782485.0", "edited": "False", "id": "htm65d9", "is_submitter": "True", "link_id": "t3_s98rqo", "parent_id": "t1_htm1fd0", "score": "2", "subreddit": "WriteStreakGerman", "subreddit_id": "t5_364k6p"}, {"author": "luellababalola", "body": "Ik ben blij voor je. Je doet het echt goed! :)", "created_utc": "1642766922.0", "edited": "False", "id": "htl7e5a", "is_submitter": "False", "link_id": "t3_s7zhic", "parent_id": "t1_htl5ac9", "score": "2", "subreddit": "WriteStreakNL", "subreddit_id": "t5_3g5eo9"}, {"author": "luellababalola", "body": "Ongeveer een jaar geleden begon Nederlands te studeren. Maar waarom heb ik besloten om dit te doen?\r  \n\r  \nIk woon al 7 jaar in Nederland en ik heb ook een Nederlandse vrouw, maar ik had nooit de zin om de taal te leren. Ik werk bij een Amerikaans bedrijf en hoef geen Nederlands te leren voor mijn werk. Mijn ***~~heel~~*** ***hele*** leven was nog steeds in het Engels. Zes jaar lang wilde ik geen Nederlands leren.\r  \n\r  \nOngeveer een jaar geleden begon mijn dochter in twee talen te spreken. Ik realiseerde ***me*** dat ik Nederlands moet leren zodat ik mijn dochter altijd kan begrijpen. Nu heb ik een goede motivatie; om altijd iets vloeiender te zijn dan mijn dochter!\n\n&#x200B;\n\n*Heel goed geschreven! Ik merk dat je veel vooruitgang boekt. :)*", "created_utc": "1642765327.0", "edited": "False", "id": "htl4zww", "is_submitter": "False", "link_id": "t3_s7zhic", "parent_id": "t3_s7zhic", "score": "1", "subreddit": "WriteStreakNL", "subreddit_id": "t5_3g5eo9"}, {"author": "luellababalola", "body": "Ik beantwoord de eerste schrijfaanzet. Ik vind het moeilijk om een lievelingsdier te kiezen. Toen ik een kind was *(komma)* hield ik zeer van dieren en ik vond elke maand een nieuw lievelingsdier.\r  \n\r  \nWat huisdieren betreft, ben ik gek op katten. Ik zal gauw een katje krijgen! Tot nu toe heb ik vaak met de katten van mijn tante gespeeld en dus weet ik hoe je katten moet behandelen (min***~~der~~*** of meer).\r  \n\r  \nWat wilde dieren betreft, heb ik altijd tropische dieren leuk gevonden zoals tijgers of papagaaien. Ik denk dat de toekan mijn wild lievelingsdier **(1)** is. Deze vogel heeft prachtige kleuren en hij ziet er grappig uit dankzij zijn lange oranje snavel.\n\n**(1)** *Ik denk dat je dit best schrijft als volgt: wild-lievelingsdier of wilde lievelingsdier. Het is in ieder geval heel duidelijk.* \n\n*Fijn dat je binnenkort een katje zal hebben en goed geschreven! :)*", "created_utc": "1642765214.0", "edited": "False", "id": "htl4u29", "is_submitter": "False", "link_id": "t3_s8hmwn", "parent_id": "t3_s8hmwn", "score": "2", "subreddit": "WriteStreakNL", "subreddit_id": "t5_3g5eo9"}, {"author": "luellababalola", "body": "Mijn mechanisch toetsenbord is een van mijn beste aankopen ooit geweest. Het voelt echt goed om erover te schrijven. En het maakt het moeilijke moment ***v***an schrijven leuker **(1)**. Voordat ik dit toetsenbord kocht, begon ik wat onderzoek te doen op ***Y***ou***T***ube. Ik was verbaasd over hoe mensen hun eigen mechanisch toetsenbord ontwerpen. U kunt het ontwerp, de kleuren, de grootte, het geluid kiezen, er komt geen einde aan! Toen begreep ik dat het toetsenbord je ervaring volledig kan veranderen. Daarom heb ik besloten om in een goede te investeren :)\n\n*Goed geschreven! Eigenlijk geen fouten.*\n\n*Wel opgelet: je gebruikt zowel \"u\" als \"je\" in je tekst. Kies één van de twee en je tekst is volledig in orde! :)*\n\n**(1)** *Het \"****moeilijke moment*** *van schrijven\" zou je kunnen vervangen door \"lastig, onaangenaam\". Dat wordt eerder geassocieerd met schrijven.*", "created_utc": "1642765068.0", "edited": "False", "id": "htl4mfy", "is_submitter": "False", "link_id": "t3_s8vdty", "parent_id": "t3_s8vdty", "score": "1", "subreddit": "WriteStreakNL", "subreddit_id": "t5_3g5eo9"}, {"author": "luellababalola", "body": "Vanochtend heb ik in het Nederlands gedroomd! Dit is wel niet de eerste keer dat ik in het Nederlands droom, maar dit is de droom waarin ik het langst heb gepraat in deze taal.\r  \n\r  \nIk heb gedroomd van een soort culturele uitwissel***ing*** (ik was dus nog op school) met Nederlandse scholieren. Ik herinner me niet of ik in Nederland was of de Nederlandse scholieren in mijn school waren aangekomen.\r  \n\r  \nIk zat an een tafel met twee Nederlanders om een gesprek te voeren en om kennis met elkaar te maken. We hebben lang gepraat over het leren van talen, onze scholen enzovoort. Ik heb hen veel vragen gesteld. En alles in het Nederlands!\r  \n\r  \nDit was een mooie manier om de dag te beginnen!\n\n&#x200B;\n\n*Je maakte maar één foutje, knap! Fijn dat je in je droom in het Nederlands aan het praten was :)*", "created_utc": "1642764907.0", "edited": "False", "id": "htl4e5d", "is_submitter": "False", "link_id": "t3_s96zf5", "parent_id": "t3_s96zf5", "score": "2", "subreddit": "WriteStreakNL", "subreddit_id": "t5_3g5eo9"}, {"author": "luellababalola", "body": "Das habe ich gemacht, weil ich nicht sicher war ob das Wort stimmt, hihi. Vielen Dank <3", "created_utc": "1642688644.0", "edited": "False", "id": "htglq11", "is_submitter": "True", "link_id": "t3_s8ftdc", "parent_id": "t1_htgkjlt", "score": "2", "subreddit": "WriteStreakGerman", "subreddit_id": "t5_364k6p"}, {"author": "luellababalola", "body": "Ich erkenne ein Muster in den Fehlern, die ich mache. Jetzt, wo ich eine Woche lang geschrieben habe, kann ich alle meine Fehler vergleichen mit Dank an dir. Vielen Dank :)!", "created_utc": "1642688113.0", "edited": "False", "id": "htgkjd8", "is_submitter": "True", "link_id": "t3_s7oq4x", "parent_id": "t1_htgezjm", "score": "2", "subreddit": "WriteStreakGerman", "subreddit_id": "t5_364k6p"}, {"author": "luellababalola", "body": "Vielen Dank für die Korrektur ! :)\n\n1. Ich weiẞ nicht ob es in Deutschland besteht, aber das nennt man bei uns \"Diktion\". Das müssen Fernseh- und Radiomoderatoren üben, damit sie schön Niederländisch sprechen können und ich habe es auch gemacht.\n\n2. Ok, danke! Das wusste ich nicht :)", "created_utc": "1642688010.0", "edited": "False", "id": "htgkb1j", "is_submitter": "True", "link_id": "t3_s8ftdc", "parent_id": "t1_htg0ofn", "score": "2", "subreddit": "WriteStreakGerman", "subreddit_id": "t5_364k6p"}, {"author": "luellababalola", "body": "Pareil pour mon cavalier King Charles. Il souffre d’une vraie dépression depuis j’habite en France, le pauvre.", "created_utc": "1642671699.0", "edited": "False", "id": "htfueuw", "is_submitter": "False", "link_id": "t3_s7twne", "parent_id": "t1_htdgooo", "score": "2", "subreddit": "france", "subreddit_id": "t5_2qhjz"}, {"author": "luellababalola", "body": "Vielen Dank für die Korrektur und die Namen der Serien. Vielleicht kann ich davon eine schauen(?). :)", "created_utc": "1642634673.0", "edited": "False", "id": "htdwtqk", "is_submitter": "True", "link_id": "t3_s6whb5", "parent_id": "t1_htdaz6f", "score": "2", "subreddit": "WriteStreakGerman", "subreddit_id": "t5_364k6p"}, {"author": "luellababalola", "body": "❤️tofu", "created_utc": "1642442757.0", "edited": "False", "id": "ht2dkle", "is_submitter": "False", "link_id": "t3_s673hs", "parent_id": "t3_s673hs", "score": "1", "subreddit": "vegan", "subreddit_id": "t5_2qhpm"}, {"author": "luellababalola", "body": "Hehe, vielen Dank für alles; die Korrektur und das einiges Wort das stimmt. :)", "created_utc": "1642426661.0", "edited": "False", "id": "ht1bdbl", "is_submitter": "True", "link_id": "t3_s5wei4", "parent_id": "t1_ht0qlvn", "score": "2", "subreddit": "WriteStreakGerman", "subreddit_id": "t5_364k6p"}, {"author": "luellababalola", "body": "Haha, inderdaad. Goedemorgen! :) & graag gedaan, hopelijk voel je je vandaag iets beter!", "created_utc": "1642408863.0", "edited": "False", "id": "ht0n0vw", "is_submitter": "False", "link_id": "t3_s5dkir", "parent_id": "t1_ht0mxwl", "score": "2", "subreddit": "WriteStreakNL", "subreddit_id": "t5_3g5eo9"}, {"author": "luellababalola", "body": "Na in Nederland gewoond te hebben, (komma) ***~~het~~*** zou ***het*** moeilijk voor me zijn om ergens ***~~heen~~*** te gaan wonen zonder een goede fietsinfrastructuur. Het is geweldig om elke morgen naar het werk te kunnen fietsen. Het is ook geweldig dat dit het mil***i***eu een beetje helpt *(geen komma)* en het is goed voor mijn gezondheid. Helaas zal het moeilijk zijn om andere plaatsen zoals deze te vinden *(geen komma)* omdat Nederland hier het beste in is.\n\n*Daar heb je gelijk in. Nederland is een echt fietsland. Ben je ooit in Denemarken geweest? Ook daar kan je goed fietsen, moest je graag fietsen tijdens een vakantie of zo. Goed geschreven. :)*", "created_utc": "1642398386.0", "edited": "False", "id": "ht07hxa", "is_submitter": "False", "link_id": "t3_s5iskn", "parent_id": "t3_s5iskn", "score": "1", "subreddit": "WriteStreakNL", "subreddit_id": "t5_3g5eo9"}, {"author": "luellababalola", "body": "Ondanks dat ik op deze dagen veel leren moet, ben ik vandaag naar de berg gegaan tijdens de namiddag om een pauzetje te nemen. Gelukkig woon ik dichtbij de berg **(1)**.\r  \n\r  \nIk vind dat de natuur altijd nuttig is als ik uit mijn hum ben of als ik in de stress raak. Een wandeling is het beste geneesmiddel *(geen komma)* volgens mij.\r  \n\r  \nHet was best koud! Kouder dan gewoon. Mijn nieuwe jas was er gelukkig voor geschikt en kwam juist van pas. Ik kon er tot de schemering blijven. Het uitzicht zag er schitterend uit hoewel de lucht een beetje mistig was.\n\n**(1)** *Om herhaling te vermijden zou je het volgende kunnen zeggen; \"gelukkig woon ik* *dichtbij.\" of \"gelukkig woon ik er niet ver van af.\" Vergelijk het met het Frans, wanneer je \"les montagnes\" zou vervangen door \"les\", of \"ils\", hangt ervan af hoe je je zin zou opstellen uiteraard. Of wanneer je simpelweg \"je n'habite pas loin\" zou gebruiken.* \n\n*Klinkt als een fijne wandeling. Hopelijk verminderde je stress een beetje. Goed geschreven! :)*", "created_utc": "1642398277.0", "edited": "False", "id": "ht07b7m", "is_submitter": "False", "link_id": "t3_s5mdbf", "parent_id": "t3_s5mdbf", "score": "2", "subreddit": "WriteStreakNL", "subreddit_id": "t5_3g5eo9"}, {"author": "luellababalola", "body": "Heel goed geschreven! :) \n\nIk kan maar één ding toevoegen: \n\n*\"Ze komen elke week thuis met allerlei verschillende ziektes en ik vang ook alles van hen* ***op****.\"*", "created_utc": "1642397865.0", "edited": "False", "id": "ht06l0m", "is_submitter": "False", "link_id": "t3_s5dkir", "parent_id": "t3_s5dkir", "score": "2", "subreddit": "WriteStreakNL", "subreddit_id": "t5_3g5eo9"}, {"author": "luellababalola", "body": "Er is niet echt een regel. Het klinkt gewoon vlotter. Wanneer men schrijft, voegt men dit meestal toe in het midden van een zin. Wanneer men spreekt, staat het wel vaker achteraan. Je zou het ook kunnen splitsen zodat je een hoofd- en bijzin krijgt:\n\n***\"Pete fietste naar uni, zoals hij elke dag doet.\"***\n\nDat klinkt nog iets vlotter omdat het dan een bijzin is waarin ook nog een onderwerp staat. Ik weet niet of dit helpend is. Indien niet, probeer ik het beter uit te leggen.", "created_utc": "1642397410.0", "edited": "False", "id": "ht05s7o", "is_submitter": "False", "link_id": "t3_s2hn7z", "parent_id": "t1_hsx5s7z", "score": "1", "subreddit": "WriteStreakNL", "subreddit_id": "t5_3g5eo9"}, {"author": "luellababalola", "body": "Je kan zeggen « rechts naast mij liggen… », « aan m’n rechterkant liggen… ». Ik zou zelf ook zeggen « rechts van mij », maar dat weet ik niet of het 100% goed Nederlands is. \n\nHopelijk helpt dat een beetje!", "created_utc": "1642347772.0", "edited": "False", "id": "hswskbj", "is_submitter": "False", "link_id": "t3_s4wjsa", "parent_id": "t1_hswrvtx", "score": "2", "subreddit": "WriteStreakNL", "subreddit_id": "t5_3g5eo9"}, {"author": "luellababalola", "body": "***Ik ga je zinnen iets korter maken omdat het anders lang wordt. Je hebt wel heel goed geschreven, goed gedaan!***\n\n&#x200B;\n\nEn plotseling verdween de zon... De mist was dicht. **H**et was onmogelijk om random je te zien. Pete fietste naar uni, zoals elke dag **(1)**. Maar deze keer moest hij een andere route nemen, vanwege enkele bouwwerkzaamheden. Hij ging door het bos *(geen komma)* en dit was een nieuwe route. **G**een mensen in de buurt, geen licht, alle**e**n stilte. Er was iets mis in dat bos... Pete besloot te gaan lopen, toen hij plotseling bloed zag! Hij liet zijn fiets achter en rende. **H**ij vond waar het bloed vandaan kwa**m**. Het was een kleine eekhoorn *(geen komma)* die gewond was. Hij zorgde voor de eekhoorn en belde een dierenambulance. Uiteindelijk vervolgde hij zijn weg naar de klas.\n\n**(1)** *Optioneel om vlotheid te creëren:* ***Pete fietste zoals elke dag naar de universiteit.***", "created_utc": "1642344070.0", "edited": "1642344324.0", "id": "hswk8wa", "is_submitter": "False", "link_id": "t3_s2hn7z", "parent_id": "t3_s2hn7z", "score": "2", "subreddit": "WriteStreakNL", "subreddit_id": "t5_3g5eo9"}, {"author": "luellababalola", "body": "Het is eindelijk weekend. Nu kan ik genieten van twee dagen zonder stress of afspraken. Tegenwoordig hoef ik niet zoveel in het weekend te doen. Ik moet de wekelijkse boodschappen doen en natuurlijk moet ik voor mijn kinderen zorgen, maar in het algemeen mag ik een beetje uitrusten. Vanwege de pandemie is er eigenlijk niet veel om te doen. Dat vind ik heerlijk.\r  \n\r  \nVroeger waren mijn weekends soms drukker dan mijn werkdagen! Voor de pandemie moest ik bijna elk weekend naar een kinderfeestje of naar een café om met vrienden t**e** ontmoeten. Hopelijk ***~~dit jaa~~***r is de pandemie ***dit jaar*** voorbij, maar ik zal mijn rustige weekends waarschijnlijk hard missen.\n\n&#x200B;\n\n*Enorm goed geschreven! Bijna zoals een moedertaalspreker. Bravo! :)*", "created_utc": "1642343863.0", "edited": "False", "id": "hswjtmg", "is_submitter": "False", "link_id": "t3_s3zl6k", "parent_id": "t3_s3zl6k", "score": "2", "subreddit": "WriteStreakNL", "subreddit_id": "t5_3g5eo9"}, {"author": "luellababalola", "body": "Fijne avond iedereen. Ik hoop dat jullie een fijn wekend hebben!\r  \n\r  \nIk zal vandaag mijn directe omgeving beschrijven. Ik zit nu op een grijze bank *(geen komma)* en er zijn een paar kussen links van mij. Een van deze kussen is wit met veel gekleurde cirkels. Naar mijn recht zitten er drie boeken **(1)**: een gaat over koken en twee over planten. Er ***~~zit~~*** **(2)** ook een sjaal die ik begon **te** breien**,** maar ***~~is~~*** nog niet voltooid ***is***. Er is een witte muur achter me. Voor mij is er een televisiescherm**,** maar ***~~ik~~*** ***die*** gebruik ik als een computerscherm.\r  \n\r  \nAc***h***ter de scherm staat er een grote passievruchtplant. Het wordt momenteel verlicht door een lamp uit een fotografiekit *(geen komma)* omdat ik ***~~heb~~*** ge**ë**xperimenteerd ***heb*** met lichten. Naast de plant staat een orchidee *(geen komma)* en de bloem begint te bloeien. Ik zal ***~~probeer~~*** vanavond ***proberen*** om een timelapse van de bloem open***en*** te maken. Ik kan ook mijn boekenkast zien. Er is een \"elephant's foot\" plant erboven ***~~met~~******.*** ***Z***ijn bladeren vallen als een kleine waterval *aan de kant* **(3)**.\n\n**(1)** *Bedoel je hier dat deze boeken naast je liggen? Dan zeg je best: \"****Naast mij liggen er drie boeken****\".*\n\n**(2)** *Een sjaal zit niet. Een sjaal kan ergens* ***liggen*** *-> er* ***ligt*** *ook een sjaal, of* ***hangen*** *-> er* ***hangt*** *ook een sjaal.*\n\n**(3)** *Beter: \"Zijn bladeren vallen ...* ***naar één kant****\".*\n\nIn het algemeen; geen komma voor het woord \"en\" of \"omdat\". Wel een komma voor het woord \"maar\".\n\n*Goed geschreven! :)*", "created_utc": "1642343785.0", "edited": "False", "id": "hswjnu2", "is_submitter": "False", "link_id": "t3_s4wjsa", "parent_id": "t3_s4wjsa", "score": "2", "subreddit": "WriteStreakNL", "subreddit_id": "t5_3g5eo9"}, {"author": "luellababalola", "body": "Ahh, das freut mich! :)\n\nVielen Dank!", "created_utc": "1642337619.0", "edited": "False", "id": "hsw8oyz", "is_submitter": "True", "link_id": "t3_s59xbu", "parent_id": "t1_hsw745g", "score": "2", "subreddit": "WriteStreakGerman", "subreddit_id": "t5_364k6p"}, {"author": "luellababalola", "body": "You must’ve been a painter in another life! This is amazing and so so beautiful 🥺", "created_utc": "1642337557.0", "edited": "False", "id": "hsw8lir", "is_submitter": "False", "link_id": "t3_s545o7", "parent_id": "t3_s545o7", "score": "1", "subreddit": "oilpainting", "subreddit_id": "t5_2swg6"}, {"author": "luellababalola", "body": "Vielen Dank für die Korrektur! :)", "created_utc": "1642263264.0", "edited": "False", "id": "hss2ovo", "is_submitter": "True", "link_id": "t3_s4fuwb", "parent_id": "t1_hss0ht7", "score": "2", "subreddit": "WriteStreakGerman", "subreddit_id": "t5_364k6p"}, {"author": "luellababalola", "body": "Hoe schattig! :)", "created_utc": "1642211859.0", "edited": "False", "id": "hsplsnq", "is_submitter": "False", "link_id": "t3_s3x73s", "parent_id": "t3_s3x73s", "score": "3", "subreddit": "WriteStreakNL", "subreddit_id": "t5_3g5eo9"}, {"author": "luellababalola", "body": "Vielen Dank, auch für die Korrektur! Ich darf nicht zu wörtlich übersetzen :)", "created_utc": "1642155980.0", "edited": "False", "id": "hsm1yp0", "is_submitter": "True", "link_id": "t3_s3mlrt", "parent_id": "t1_hsm1nbz", "score": "3", "subreddit": "WriteStreakGerman", "subreddit_id": "t5_364k6p"}, {"author": "luellababalola", "body": "Danke, ich wünsche dir auch viel Glück! :)", "created_utc": "1642149169.0", "edited": "False", "id": "hslt6bn", "is_submitter": "True", "link_id": "t3_s3mlrt", "parent_id": "t1_hslrbuq", "score": "1", "subreddit": "WriteStreakGerman", "subreddit_id": "t5_364k6p"}, {"author": "luellababalola", "body": "Voor jou ook!", "created_utc": "1642145775.0", "edited": "False", "id": "hslojgm", "is_submitter": "False", "link_id": "t3_s392u8", "parent_id": "t1_hslmyzz", "score": "1", "subreddit": "WriteStreakNL", "subreddit_id": "t5_3g5eo9"}, {"author": "luellababalola", "body": "Geen probleem! Oefening baart kunst en ik merk al vooruitgang na 7 dagen ;).", "created_utc": "1642144574.0", "edited": "False", "id": "hslmt6h", "is_submitter": "False", "link_id": "t3_s392u8", "parent_id": "t1_hsllo3l", "score": "2", "subreddit": "WriteStreakNL", "subreddit_id": "t5_3g5eo9"}, {"author": "luellababalola", "body": "Wat is mijn lievelingsdier? Dit is een heel makkelijke vraag! Mijn lievelingsdier is de salamander. Salamanders hebben veel mooie eigenschapen. Ik hou van het gevoel van hun huid. Zij kunnen ***~~ademen~~*** ***~~beide~~***  ***zowel*** onder ***~~en~~***  ***als*** boven water ***ademen***.\n\n>Soms kunnen ***ze*** zelfs door hun huid ademen (vo***o***ra***~~a~~***l de longloss salamanders).  \n>  \n>*Sommigen kunnen zelfs door hun huid ademen (vooral de longloss salamanders).*  \n>  \n>*->  ik vermoed dat je eerder de tweede zin bedoelde, maar ik weet het niet zo goed.*\n\nDe 'Bolitoglossa' of 'paddestoele***n*** tong salamanders' zijn mijn favoriete soort. Zij kunnen bomen beklimmen\\*\\*\\*~~,~~\\*\\*\\* en hun tong is ***~~het~~***  ***de*** snelste\\*\\*\\*,\\*\\*\\* bekende spier. Nyctanolis pernix is heel erg mooi. Er zijn nog veel meer geweldige salamanders! Helaas is er momenteel een schimmel (Batrachochytrium salamandrivorans) in Nederland die ***de*** salamander populaties vernietig***t*** :(.\n\n&#x200B;\n\n*Goed geschreven en heel erg interessant! Het zijn inderdaad mooie dieren, ik heb je favoriete soorten even opgezocht. Hopelijk wordt het schimmelprobleem gauw opgelost!*", "created_utc": "1642144464.0", "edited": "False", "id": "hslmncw", "is_submitter": "False", "link_id": "t3_s3bzc9", "parent_id": "t3_s3bzc9", "score": "2", "subreddit": "WriteStreakNL", "subreddit_id": "t5_3g5eo9"}, {"author": "luellababalola", "body": "Vandaag had ik het met mijn collega's over Harry Potter, wat een geweldige films! Ik heb Harry Potter j**a**ren geleden ontdekt dankzij mijn zus en mijn vader, die grote fans zijn. Ik heb mooie herinneringen aan dat moment. Ik heb deze films vaak met mijn zus gezien, we hielden van de personages, de verhalen, de muziek... En het was zo spannend om op de nieuwe film te wachten~~,~~ en er maanden over te discussi**ë**ren. We hadden ook een traditie**:** elke keer als we Harry Potter zagen **(1),** maakten we ook een lekker broodje klaar om nog meer van de avond te genieten. Op dat moment dachten we er zelfs over om ons eigen broodjesbedrijf te openen omdat ze zo lekker w**a**ren... **M**isschien iets dat we in de toekomst zouden kunnen doen **(2)**. Fijne avond!\n\n*Goed geschreven! Fijn dat jullie een traditie hebben/hadden. Ik ben benieuwd naar de broodjesplannen ;).*\n\n**(1)** *In principe zeg je beter \"elke keer als we Harry Potter* ***keken****\" . Dit komt van \"een film kijken\".*\n\n**(2)** *Dit is eigenlijk perfect als spreektaal of wanneer je gewoon naar vrienden/familie een berichtje stuurt. Wanneer je \"professioneel\" schrijft, voeg je beter nog iets toe: \"Misschien is dat iets* [*dat/wat*](https://onzetaal.nl/taaladvies/iets-wat-iets-dat) *we in de toekomst kunnen doen.\"*\n\n*Link voor extra info :).*", "created_utc": "1642143918.0", "edited": "False", "id": "hsllu53", "is_submitter": "False", "link_id": "t3_s382na", "parent_id": "t3_s382na", "score": "2", "subreddit": "WriteStreakNL", "subreddit_id": "t5_3g5eo9"}, {"author": "luellababalola", "body": "Wauw, dit is erg goed geschreven, bravo! Ik drink ook graag thee, ook groene. :)\n\nIk heb alleen een klein puntje over de komma's (geen zorgen, dat is niet erg. Je komt er wel!):\n\n* *Vroeger, voordat ik naar Nederland kwam, dronk ik....* Is dat in het Engels ook niet op die manier? \n* *Maar toen ik naar Nederland verhuisde, kon ik nergens....*\n\nOptioneel: *Ik drink graag vele verschillende soorten thee, maar* ***het liefst drink ik*** *groene (thee).* Dat klinkt iets vlotter, maar het is niet nodig om het op die manier te schrijven.", "created_utc": "1642143492.0", "edited": "False", "id": "hsll6tr", "is_submitter": "False", "link_id": "t3_s392u8", "parent_id": "t3_s392u8", "score": "2", "subreddit": "WriteStreakNL", "subreddit_id": "t5_3g5eo9"}, {"author": "luellababalola", "body": "Yeah, I think you can translate it like that!", "created_utc": "1642007840.0", "edited": "False", "id": "hsddai3", "is_submitter": "False", "link_id": "t3_s22grq", "parent_id": "t1_hsd2rhv", "score": "1", "subreddit": "learndutch", "subreddit_id": "t5_2t6rf"}, {"author": "luellababalola", "body": "Store-bought. Tried making homemade once, didn’t taste that good. Do you have a recipe?", "created_utc": "1642007821.0", "edited": "False", "id": "hsdd8nd", "is_submitter": "False", "link_id": "t3_s1j55k", "parent_id": "t1_hsd65jg", "score": "1", "subreddit": "vegan", "subreddit_id": "t5_2qhpm"}, {"author": "luellababalola", "body": "Yes! \n\nLong story short: we were teenagers and he cheated on me with five other girls. He wanted the fifth one to be his new girlfriend, hence why he broke up with me in 2017.\n\nIn 2019, when I was at my lowest point, he apologised. However, I wasn’t in the right mental headspace to have the conversation, so I just told him it was ok. But it wasn’t, I still held grudges against him.\n\nWe talk twice a year; on our birthdays. Just a “happy birthday” and some small talk. On my birthday last November, I asked him if we could reopen the conversation we had in 2019. We had an amazing talk and we both got the closure we needed.", "created_utc": "1642007363.0", "edited": "False", "id": "hsdc0rc", "is_submitter": "False", "link_id": "t3_s1uelw", "parent_id": "t3_s1uelw", "score": "3", "subreddit": "relationship_advice", "subreddit_id": "t5_2r0cn"}, {"author": "luellababalola", "body": "No prob <3", "created_utc": "1642001993.0", "edited": "False", "id": "hscxxhj", "is_submitter": "False", "link_id": "t3_s22grq", "parent_id": "t1_hscol5g", "score": "2", "subreddit": "learndutch", "subreddit_id": "t5_2t6rf"}, {"author": "luellababalola", "body": "Am currently reading his bundle in French and really loving it. Thank you for sharing this translated one :)", "created_utc": "1641993464.0", "edited": "False", "id": "hscen6b", "is_submitter": "False", "link_id": "t3_s234pt", "parent_id": "t3_s234pt", "score": "2", "subreddit": "Poetry", "subreddit_id": "t5_2qhhu"}, {"author": "luellababalola", "body": "I’ve eaten too much hummus and avocados in my life to the point that I do not like them anymore, especially avocados.", "created_utc": "1641993288.0", "edited": "False", "id": "hsceb2y", "is_submitter": "False", "link_id": "t3_s1j55k", "parent_id": "t3_s1j55k", "score": "4", "subreddit": "vegan", "subreddit_id": "t5_2qhpm"}, {"author": "luellababalola", "body": "Also, good luck! You'll do great taking your history in Germanic languages into account. Let us know if there's anything we can do to help you :)", "created_utc": "1641980976.0", "edited": "False", "id": "hsbwp3s", "is_submitter": "False", "link_id": "t3_s22grq", "parent_id": "t1_hsbwnk1", "score": "5", "subreddit": "learndutch", "subreddit_id": "t5_2t6rf"}, {"author": "luellababalola", "body": "When I say *straks* and it's 11am, I refer to some time later in the day (example 5pm). When I say *zo meteen/zometeen (both are ok),* I personally mean that I'll do it, indeed, in a little while/a bit earlier. \n\nWhen my mom asks me to bring her coffee, I'll say \"*I'll bring it zo meteen/zometeen\"* so I can finish whatever I'm doing. \n\nWhen you say \"*tot straks*\" it's like saying \"*see you in a few hours*\". When I text someone \"*tot zo meteen/zometeen*\", it means I'll be there in *5 - 10 minutes.*\n\nI don't know if any of this is more clear to you now?", "created_utc": "1641980940.0", "edited": "False", "id": "hsbwnk1", "is_submitter": "False", "link_id": "t3_s22grq", "parent_id": "t3_s22grq", "score": "13", "subreddit": "learndutch", "subreddit_id": "t5_2t6rf"}, {"author": "luellababalola", "body": "Dat is heel graag gedaan! :)", "created_utc": "1641937069.0", "edited": "False", "id": "hs9hlvc", "is_submitter": "False", "link_id": "t3_s0vk0d", "parent_id": "t1_hs9h2vj", "score": "1", "subreddit": "WriteStreakNL", "subreddit_id": "t5_3g5eo9"}, {"author": "luellababalola", "body": "Dat zou je inderdaad kunnen zeggen, maar het blijft dan nog wel een beetje onduidelijk. Maar het is niet fout :)", "created_utc": "1641930760.0", "edited": "False", "id": "hs90bjy", "is_submitter": "False", "link_id": "t3_s0wwnu", "parent_id": "t1_hs8rh3k", "score": "2", "subreddit": "WriteStreakNL", "subreddit_id": "t5_3g5eo9"}, {"author": "luellababalola", "body": "Hey neen, je doet het enorm goed! Je hoeft je excuses zeker niet aan te bieden!\n\nIn een passieve zin heb je een werkwoord en een hulpwerkwoord -> \"*4rcher69* ***wordt*** *door een taxi naar huis* ***gebracht***.\"  \nDe actieve variant -> \"*4rcher69* ***neemt*** *de taxi naar huis.\"*\n\nEr zijn wel meerdere websites waar je informatie kan vinden. Hier is er eentje : [https://www.vlaanderen.be/taaladvies/actief-passief](https://www.vlaanderen.be/taaladvies/actief-passief)", "created_utc": "1641925934.0", "edited": "False", "id": "hs8n5dk", "is_submitter": "False", "link_id": "t3_s0t4bo", "parent_id": "t1_hs733za", "score": "2", "subreddit": "WriteStreakNL", "subreddit_id": "t5_3g5eo9"}, {"author": "luellababalola", "body": "Avatar is een van mijn favoriete tv-programma's die ik ooit gezien heb **(1)**. Ik weet dat het een beetje kinderachtig is, maar ik vind het heel leuk om ernaar te kijken. Het verhaal voelt compleet\\~\\~,\\~\\~ en de karakter ontwikkeling is echt geweldig.\n\nMaar, het grappigste\\*\\*/grappige (2)\\*\\* is dat ik het nooit in het Engels heb gezien. Ik gebruikte de series om mijn Nederlands te verbeteren. Ik heb de volledige series twee keer gekeken in het Nederlands\\~\\~,\\~\\~ en nu ***~~heb~~***  ***ben*** ik ***~~er~~*** begonnen om in het Frans te kijken.\n\nOoit wil ik ernaar in het Engels kijken als ik ***~~ooit~~*** genoeg tijd ***~~zal hebben~~*** ***heb***. **(3)**\n\n&#x200B;\n\n*Heel goed geschreven, bravo! :)*\n\n**(1)** *Je kan die tijd gebruiken, maar luchtiger (actief) is \"****Die ik ooit zag****\".*\n\n**(2)** *In principe is een superlatief hier niet nodig en heb je genoeg aan een comparatief. Maar het gaat wel, natuurlijk.*\n\n**(3)** *Er is niet echt iets mis met die zin, maar hij is nogal zwaar (omdat deze passief is). Ik maakte er een actieve zin van.*", "created_utc": "1641896893.0", "edited": "False", "id": "hs6vsr0", "is_submitter": "False", "link_id": "t3_s0t4bo", "parent_id": "t3_s0t4bo", "score": "1", "subreddit": "WriteStreakNL", "subreddit_id": "t5_3g5eo9"}, {"author": "luellababalola", "body": "Hallo iedereen.\r  \nIk zit voor mijn televisie wat thee te drinken. Het is een erg lekkere thee uit **D**enmarken dat ik kreeg ***~~tijdens~~*** ***voor*** **(1)** **K**erstmis. Het bevat rood zoethout, appelstukjes, pepermunt en citroengras. Het is nog een beetje te warm naar mijn smaak.\r  \nMijn nieuwe zaden zijn vandaag aangekomen en ik heb ze in kokosvezels ***gedaan*** **(2)**. Ik hoop dat ze zullen groeien tot sterke en gezonde planten. Ze zitten **(3)** nu tussen mij en mijn thee.\r  \nFijne avond!\n\n&#x200B;\n\n**(1)** *Tijdens gebruik je wanneer je spreekt over een periode. Je zou kunnen zeggen \"Ik kreeg de thee tijdens de kerstperiode.\" Kerstmis is één dag, dus je kreeg het* ***voor*** *Kerstmis (****for*** *Christmas/****pour*** *Noël).*\n\n**(2)** *Dit proces ken ik niet, maar heb je je zaden gepland? Indien ja, dan is het beter om te zeggen: \"...ik heb ze in kokosvezels* ***gepland****.\"*\n\n**(3)** *In principe zitten ze niet tussen jou en je thee. Hier kan je beter zeggen \"Ze* ***bevinden*** *zich nu tussen...\". Mensen gaan je in ieder geval wel begrijpen, daarom heb ik het niet doorstreept.*\n\n&#x200B;\n\n*Goed geschreven! :)*", "created_utc": "1641896595.0", "edited": "False", "id": "hs6vfdc", "is_submitter": "False", "link_id": "t3_s0wwnu", "parent_id": "t3_s0wwnu", "score": "3", "subreddit": "WriteStreakNL", "subreddit_id": "t5_3g5eo9"}, {"author": "luellababalola", "body": "Ik kreeg voor Kerstmis een nieuwe agenda. **~~Maar~~** **(1) H**et is heel interessant omdat het verdeeld is in 3 secties: tijd, aandacht en energie. Gewone agenda**'**s helpen u om op uw tijd ***~~te denken~~*** ***in te delen***. Maar met **deze** agenda kun je ***~~begrijpen~~*** ***erop attent worden*** **(2)** dat aandacht en energie ook belangrijk zijn. Dat is waarom ik ***meer*** probeer ***~~om~~*** ***~~meer~~*** te slapen. Als ***~~slaap~~*** ik 7-8 uur***~~s~~***  ***slaap,*** kan ik meer doen. Het is altijd interessant om een gewoonte te veranderen ***en*** om te zien wat het resultaat zal zijn. Ik ben benieuwd ***~~over~~***  ***naar*** de resultaten van hier elke dag schrijven. Tot morgen!\n\n&#x200B;\n\n*Hoi! Hopelijk kan je je nieuwe gewoontes aanhouden. Hoe gaat het daarmee, nu we 11 dagen in het nieuwe jaar zijn? :)*\n\n**(1)** *Ik verbeterde net nog een andere tekst van je. Waarom zet je \"maar\" aan het begin van een zin? In principe gaat dit wel, maar in zowel deze als de andere is het woord overbodig.* \n\n**(2)** *Wat wil je hier juist zeggen? Ik heb het aangepast naar erop attent worden (dit betekent hetzelfde als bewust worden). Je zou dus ook kunnen zeggen \"****Met deze agenda kan je bewust worden dat..****.\"*", "created_utc": "1641896304.0", "edited": "False", "id": "hs6v27d", "is_submitter": "False", "link_id": "t3_rxlsb6", "parent_id": "t3_rxlsb6", "score": "1", "subreddit": "WriteStreakNL", "subreddit_id": "t5_3g5eo9"}, {"author": "luellababalola", "body": "Vorige maand was ***het*** mijn papa's verjaardag. **~~Maar~~** **H**et was een heel speciale verjaardag **(1)**! Dit jaar hebben mijn familie en ik besloten om iets nieuws te maken. **~~Schreven we~~** ***We schreven in*** een k**l**ein boek voor hem **(2)**. In dit boek schreven we verhalen over hem. Het was makkelijk om het boek te vullen~~,~~ want we hebben allemaal veel avonturen met hem ***beleefd***. Toen het boek klaar was, g**a**ven **(3)** we hem het boek. We l**a**zen **(3)** samen alle korte hoofdstukken~~,~~ **(4)** en we hebben veel genoten! Het was een heel speciaal moment en ik was blij dat ik bij hen was. Dank je wel voor het lezen :)\n\n*Wat een fijn verjaardagscadeau! Het klinkt inderdaad alsof jullie een fijne tijd gehad hebben. Gelukkige verjaardag aan je papa! :)*\n\n**(1)** *Om herhaling te vermijden zou ik zeggen; \"****Het was een heel speciale dag****.\"*\n\n**(2)** *Hier zeg je bijna 2x hetzelfde. Daarom zou ik eerder iets zeggen in de aard van \"****Dit jaar hebben mijn familie en ik besloten om verhalen over hem te schrijven in een boe****k.\" Op die manier wordt je zin langer, maar je hebt meteen 3 zinnen gecombineerd.*\n\n**(3)** *Hier bedoel je dat het al gebeurd is, toch? Dan wordt lezen -> lazen, geven -> gaven.* \n\n**(4)** *Geen komma na \"en\" en \"want\". Een komma hoor je sowieso te schrijven voor maar -> \"Ik zou graag naar zee gaan, maar de zon schijnt niet.\" en tussen twee werkwoorden -> \"Toen ik in het boek schreef, dacht ik aan de leuke momenten met hem.\"*", "created_utc": "1641895894.0", "edited": "False", "id": "hs6uk31", "is_submitter": "False", "link_id": "t3_s0vk0d", "parent_id": "t3_s0vk0d", "score": "2", "subreddit": "WriteStreakNL", "subreddit_id": "t5_3g5eo9"}, {"author": "luellababalola", "body": "Never heard of it, but makes sense taking the Bretzel in your name into account. I’m sorry, I don’t know how to help you but I wish you the best of luck <3", "created_utc": "1641845807.0", "edited": "False", "id": "hs3xtn3", "is_submitter": "False", "link_id": "t3_s0jc0s", "parent_id": "t1_hs3cogy", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "luellababalola", "body": "This is super sweet! \n\nAre you talking about Frisian as in the language spoken in Friesland (the Netherlands)?", "created_utc": "1641835719.0", "edited": "False", "id": "hs36203", "is_submitter": "False", "link_id": "t3_s0jc0s", "parent_id": "t3_s0jc0s", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "luellababalola", "body": "Does it help a lot? I often feel like it doesn't, but I think it does (I know it sounds contradictory) as you can hear how natives formulate their sentences?", "created_utc": "1641756632.0", "edited": "False", "id": "hryc4xn", "is_submitter": "False", "link_id": "t3_rzeagv", "parent_id": "t1_hrybdjj", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "luellababalola", "body": "Finally a question I can answer!\n\nTo give you some background information:\n\n* My first language is Dutch.\n* My studies are in French.\n* I study English (C1), German (B1 -> B2) and Spanish (A0-A1)\n\nI don't do anything for English, besides what's necessary for university. The world is so focused on the language, that you see, hear and read it everywhere. I have around 10h of English a week, sometimes 13, it depends.\n\nGerman is a bit... harder. I do not emerge myself in the language at all. I am just lucky that the overal sentences can be translated directly from Dutch, hence why *\"I'm so good at it.\"*I sometimes listen to German music, but I do not like it very much. I will, however, start r/WriteStreakGerman again, so then I'll have to think about topics or maybe watch some videos that I can rewrite. I have 8h German a week, if I remember it correctly.\n\nAs for Spanish... I attend a 1h (soon 1h30) class and a 1h not-obligated class. Which means 2h of Spanish contact hours a week. I think I spend around 3h/week studying for Spanish. This means revising my classes and looking up new grammar/vocabulary.\n\nAs for French: my classes are in French. The teachers explain a lot during the language classes (in French), but I also have other classes solely in French. I talk to natives and send messages back and forth, and I read poetry. I also listen to music, but I haven't found any artists I like very much. I also revise the grammar and try to broaden my vocabulary. So, I'd say I spend most of my days learning French.\n\n&#x200B;\n\nWhat about you? What's your routine, if you have one?", "created_utc": "1641751615.0", "edited": "1645121873.0", "id": "hrxxu5n", "is_submitter": "False", "link_id": "t3_rzeagv", "parent_id": "t3_rzeagv", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "luellababalola", "body": "Bonjour, j’espère que vous allez bien aussi. Je vous préviens que le français n’est pas ma langue maternelle, mais j’essaierai. J’habite en France, donc j’ai le droit de répondre à cette question aussi ;).\n\nMon but le plus proche, c’est d’avoir des bonnes notes pour mes partiels. Elles sont énormément importantes parce que je compte poursuivre mes études en France. Après en mars, j’effectuerai mon stage (que je n’ai pas encore trouvé) et je présenterai le DALF C1. Ce dernier est nécessaire pour d’être accepté aux universités qui m’intéressent. J’envisage d’obtenir mes deux diplômes de licences (vu que je fais un double diplôme entre la France et la Belgique) en juin. Après, je voudrais présenter le CAE C2 en anglais. \n\nDans l’été, je compte travailler dans une école pour des réfugiés ou immigrants à Bruxelles. Au cas où la présentation de DALF C1 serait bien passée, je peux enseigner le français, et bien aussi ma langue maternelle ; le néerlandais. \n\nJ’espère que l’université qui m’intéresse le plus m’acceptera de sorte que je puisse réfléchir à ce que je veux faire dans ma vie. En 2023, mais c’est encore loin, je voudrais présenter le certificat de Goethe-Institut C1 en allemand. Mais on verra. C’est tout 😊.", "created_utc": "1641737545.0", "edited": "False", "id": "hrwylag", "is_submitter": "False", "link_id": "t3_rzozdn", "parent_id": "t3_rzozdn", "score": "10", "subreddit": "france", "subreddit_id": "t5_2qhjz"}, {"author": "luellababalola", "body": "Congratulations on passing the DALF C1, you did a fantastic job, and I am proud of you!\n\nThank you for taking the time to write down all of the above. It indeed is very helpful, and I will start doing my research right now. I've only heard about the r/france, and I've noticed that it's not always easy to understand what they write, as they use words *hors mon vocabulaire.*\n\nI will definitely check out French with Manon, I love that there are courses specifically addressed to C1 learners.\n\nFurthermore, I think I am the most scared for the speaking part, in which you did really well.\n\nI don't know what else to say, I am just genuinely thankful for your help, and I am sure it'll help me in the long run. And thank you for reassuring me that my timespan isn't too small, haha. :)", "created_utc": "1641716231.0", "edited": "False", "id": "hrw38d8", "is_submitter": "True", "link_id": "t3_rvvltv", "parent_id": "t1_hrvt7gy", "score": "1", "subreddit": "French", "subreddit_id": "t5_2rd5t"}, {"author": "luellababalola", "body": "\"***Wij***\" en \"***we***\" zijn synoniemen, maar je gebruikt [***wij***](https://onzetaal.nl/taaladvies/wij-we) wanneer je de **nadruk** op iets wil leggen. Aangezien het van in het begin van je tekst duidelijk was dat het om jezelf en een vriendin ging, is dat niet nodig.\n\nOh ja, ik zie het. Ik had je zin verkeerd begrepen. Op zich kan je deze zo laten:\n\n>*Natuurlijk waren de winkels en horeca gesloten (vanwege de coronamaatregelen), maar we dachten dat er ondanks dit meer dan* ***~~alleen~~*** *10-20 toeristen* ***e****n Amsterdam****m****ers zouden zijn.*\n\n\"[Only](https://www.wordhippo.com/what-is/the/dutch-word-for-only.html)\" kan je best direct vertalen door \"slechts\", dat gaat bijna altijd goed zijn. Je zou het ook kunnen vertalen door \"amper\". In ieder geval zou ik deze niet combineren met \"meer dan\". Ik vervorm de zin even, maar die krijgt dan wel een andere betekenis:\n\n>*Natuurlijk waren de winkels en horeca gesloten (vanwege de coronamaatregelen). Zo viel ons op dat er* ***slechts/amper/maar*** *10-20 toeristen* ***e****n Amsterdam****m****ers waren.*\n\nHopelijk helpt dit en is het een beetje duidelijker? :)", "created_utc": "1641715496.0", "edited": "False", "id": "hrw27g4", "is_submitter": "False", "link_id": "t3_ryyb4z", "parent_id": "t1_hrtqwv5", "score": "1", "subreddit": "WriteStreakNL", "subreddit_id": "t5_3g5eo9"}, {"author": "luellababalola", "body": "Super lief! Dat is heel graag gedaan :)!", "created_utc": "1641714804.0", "edited": "False", "id": "hrw188w", "is_submitter": "False", "link_id": "t3_rz1m2y", "parent_id": "t1_hrtsb6f", "score": "1", "subreddit": "WriteStreakNL", "subreddit_id": "t5_3g5eo9"}, {"author": "luellababalola", "body": "Vandaag\\*\\*,\\*\\* erg vroeg in de ochtend\\*\\*,\\*\\* is een vriendin van mij uit het buitenland in Schiphol **a**angekomen en ik heb haar daar opgehaald. Daarna zijn we samen naar Amsterdam **gegaan** met de trein om wat **~~rom~~**  **rond** te wandelen\\*\\*.\\*\\* **~~en~~** **W**ij **(1)** waren verrast omdat bijna alle straten leeg ~~stonden~~ **(2).** Natuurlijk waren de winkel**s** en horeca gesloten (vanwege de coronamaatregelen)**,** maar we dachten dat er ondanks dit meer dan ~~alleen~~ 10-20 toeristen **i**n Amsterdam**~~ers~~** zouden zijn. In ieder geval was het een leuke ervaring omdat we **~~konden~~** zonder stress en te veel geluid de stad bekijken en genieten **(3)**.\n\n**(1)** *Hier zou ik kiezen voor \"we\".*\n\n**(2)** *Straten staan niet leeg. Winkelpanden bijvoorbeeld wel. Straten zijn leeg -> \"... omdat bijna alle straten leeg* ***waren***\\*.\"\\*\n\n**(3)** *Er is hier nood aan het woord konden, maar ik ga je zin hervormen -> \"In ieder geval was het een leuke ervaring omdat we zonder stress en te veel geluid de stad konden bekijken en ervan konden genieten.\"*\n\n*Fijn dat je vriendin gekomen is en dat jullie de stad introkken. Veel plezier nog! :)*", "created_utc": "1641675288.0", "edited": "False", "id": "hrto433", "is_submitter": "False", "link_id": "t3_ryyb4z", "parent_id": "t3_ryyb4z", "score": "1", "subreddit": "WriteStreakNL", "subreddit_id": "t5_3g5eo9"}, {"author": "luellababalola", "body": "Voor 2022 heb ik mezelf beloofd dat ik minder suiker en chocolade zal eten. Ik eet veel te veel voedsel met suiker en ik ben een beetje verslaafd aan chocolade **(1)**. Daarom besloot ik om **ermee** te stoppen.\n\nIn het algemeen eet ik redelijk gezond. Ik ben vegetarisch, maar ik probeer elke dag om genoeg eiwit te eten. Dit is soms best moeilijk want **~~het~~** vlees is een prima bron **~~voor~~** **van** eiwit. Hoewel\\~\\~, eet ik\\~\\~ **ik** veel eieren, melk producten, noten en bonen **eet**. Ik probeer **ook** elke dag genoeg fruit en groenten **~~ook~~** te consumeren.\n\nIk wou trouwens dat ik meer zou sporten **(2)**. Misschien is dat een goed**~~e~~** onderwerp voor mijn volgende poging om te schrijven.\n\n*Mijn excuses moest je al een melding gekregen hebben. Ik had per ongeluk al op \"comment\" gedrukt.*\n\n**(1)** *Om herhaling te vermijden zou je kunnen schrijven: \"Ik eet veel te veel voedsel met suiker en ik ben* ***er*** *een beetje verslaafd aan.\"*\n\n**(2)** *Deze zin klinkt wat zwaar. Ik zou opteren voor \"Ik zou trouwens meer willen sporten\" of \"Ik wil meer sporten\". Maar grammaticaal is deze wel correct.*\n\n*Goed gedaan en goede voornemens! :)*", "created_utc": "1641674859.0", "edited": "1641675491.0", "id": "hrtn20z", "is_submitter": "False", "link_id": "t3_rz1m2y", "parent_id": "t3_rz1m2y", "score": "2", "subreddit": "WriteStreakNL", "subreddit_id": "t5_3g5eo9"}, {"author": "luellababalola", "body": "Er is inderdaad een verschil in kommagebruik. Zelf maak ik er in het Engels wel eens fouten tegen. \n\nGeen probleem! Fijne avond! :)", "created_utc": "1641596084.0", "edited": "False", "id": "hrpayxl", "is_submitter": "False", "link_id": "t3_ryist0", "parent_id": "t1_hrp6gza", "score": "3", "subreddit": "WriteStreakNL", "subreddit_id": "t5_3g5eo9"}, {"author": "luellababalola", "body": "Zodra de pandemie voorbij is, wil ik een treintje **(1)** nemen naar Polen. Of misschien Slowakije, ~~of~~ Hongarije\\~\\~,\\~\\~ of Roemenië. Een land in ~~het~~ **O**ost-**E**uropa in ieder geval **(2)**. Ik weet al dat reizen met de trein naar die landen heel lang duurt, maar ik wil graag mijn ‘carbon footprint’ *~~even~~* verminderen. Reizen met **e**en vliegtuig is ***~~v~~****~~eel~~* sneller en duurt *~~veel~~* minder ***lang***, maar het is ook een gedoe en heeft veel meer invloed op het klimaat.\n\n**(1)** *Zelf zou ik niet voor een verkleinwoord kiezen en gewoon het zelfstandig naamwoord \"trein\" gebruiken.*\n\n**(2)** *Je zin klinkt vlotter indien je deze omdraait: \"In ieder geval een land in Oost-Europa\". Of wanneer je het woord \"het\" graag gebruikt: \"In ieder geval een land in het oosten van Europa.\"*\n\n*Goed geschreven! Ik ben benieuwd naar je reisplannen. :)*", "created_utc": "1641593375.0", "edited": "False", "id": "hrp3zzd", "is_submitter": "False", "link_id": "t3_rygex4", "parent_id": "t3_rygex4", "score": "2", "subreddit": "WriteStreakNL", "subreddit_id": "t5_3g5eo9"}, {"author": "luellababalola", "body": "Momenteel heb ik een beetje te veel spanning in mijn leven. Ik heb spanning vanwege te veel drukte op mijn werk, ook omdat ik kleine kinderen heb\\~\\~,\\~\\~ en ik heb dezelfde spanning **(1)** als iedereen vanwege *weer nog* **(2)** een lockdown. Daarom\\~\\~,\\~\\~ probeer ik een beetje uit te rusten door een paar verschillende hobby's **(3)**.\n\nTen eerste speel ik ukelele. Dat vind ik heerlijk\\~\\~,\\~\\~ want tijdens spelen kan ik alle gedachten loslaten\\~\\~,\\~\\~ en focussen op iets moois te creëren. De ukelele is redelijk gemakkelijk om te leren, dus ~~gaat dat~~ **dat gaat** best snel en ~~kan ik~~  **ik kan** al veel liedjes spelen.\n\nTen tweede leer ik op dit moment twee talen\\~\\~,\\~\\~**:** Nederlands en Frans. Ik ben al een jaar bezig met Nederlands te leren, maar ~~kan ik~~ **ik kan** de taal veel beter verstaan dan gebruiken. Daarom ben ik begonnen om schrijven te proberen **(4)**. Ik heb net begonnen met Frans te leren, dus focus ik alleen op nieuwe woorden te leren, e**~~e~~**n de taal te lezen/begrijpen als ik ernaar luisteren.\n\nDoor mijn hobby's krijg ik wat ontspanning, e**~~e~~**n hopelijk straks kunnen we allemaal weer onze vrienden en familie zien.\n\n&#x200B;\n\n*Hoi, welkom! Naar mijn mening schrijf je best goed. Is je moedertaal toevallig Engels? Je komma-gebruik heeft er wat van weg. Over het algemeen plaatsen we een komma voor de woorden \"maar\" en \"dus\" en tussen twee werkwoorden.*\n\n*Veel succes met je streak en met het leren van Frans. Ik hoop dat de lockdown niet te zwaar weegt en dat je snel je familie en vrienden weer kan zien.*\n\n**(1)** *Indien je herhaling wil vermijden, kan je volgende woorden als synoniem gebruiken: stress, onrust, druk, \"ik ben zenuwachtig omdat...\". Het zijn maar enkele suggesties.*\n\n**(2)** *Je \"weer nog\" klinkt niet zo goed in m'n oren. Vandaar stel ik voor dat je je zin als volgt verwoord: \"Net zoals iedereen heb/ervaar ik spanning vanwege een nieuwe lockdown.\" Of \"Ik heb spanning omdat er weer een lockdown is\". In principe kan je je idee op ontelbaar vele manieren neerschrijven, ook met het woord \"nog\". Maar \"weer nog\" klinkt wat gek.*\n\n**(3)** *Deze zin is gemakkelijk te begrijpen. Indien je deze graag naar een hoger level zou tillen, stel ik je voor het werkwoord \"uitoefenen/beoefenen\" toe te voegen. Je krijgt dan \"Daarom probeer ik een beetje uit te rusten door verschillende hobby's te beoefenen.\"*\n\n**(4)** *Het is heel duidelijk wat je wil zeggen, maar de zin is niet vlot en klopt hierdoor niet. Daarom stel ik voor dat je het verwoord als \"Daarom ben ik begonnen met schrijven.\" of \"Daarom probeer ik te schrijven.\" of nog beter, maar moeilijker: \"Daarom probeer ik mijn schrijfvaardigheden te verbeteren\".*", "created_utc": "1641592927.0", "edited": "False", "id": "hrp2tnh", "is_submitter": "False", "link_id": "t3_ryist0", "parent_id": "t3_ryist0", "score": "4", "subreddit": "WriteStreakNL", "subreddit_id": "t5_3g5eo9"}, {"author": "luellababalola", "body": "Salut! Ce serait hyper cool. Le néerlandais est ma langue maternelle et j’étudie en France, alors si tu veux, on peut s’entraider :)", "created_utc": "1641545605.0", "edited": "False", "id": "hrm502f", "is_submitter": "False", "link_id": "t3_rtimgj", "parent_id": "t3_rtimgj", "score": "1", "subreddit": "learndutch", "subreddit_id": "t5_2t6rf"}, {"author": "luellababalola", "body": "I am amazed that Google Translate translated “schatje patootje”.\n\nHere are some options: \n- liefje\n- lieveke\n- lieverd\n- schat\n- schatteke\n- oogappeltje (it’s like you’re the apple of my eye”\n- zoet\n- zoetje\n- prinsje (for a male), prinsesje (for a female)\n- engeltje 👼 \n\nYou just add “(t)je” or “ke” and it becomes affectionate! \n\nYou can also do it with their names. My dog’s name is Lou. We call him Lou’tje or Lou’ke to be more affectionate. Same with my sister’s and my name!", "created_utc": "1641471230.0", "edited": "False", "id": "hrhd5hi", "is_submitter": "False", "link_id": "t3_rxcp5w", "parent_id": "t3_rxcp5w", "score": "10", "subreddit": "learndutch", "subreddit_id": "t5_2t6rf"}, {"author": "luellababalola", "body": "I understand this might be confusing taking the English variant *\"what's your name\"* into account. In Dutch, you could also ask **\"*****Wat is jouw naam*****?\"**. However, that's not the variant we're talking about right now.\n\n*\"****Hoe*** ***heet jij?****\"* is asking about the person's name, just like \"***Hoe oud ben je***\\*\"\\* or \"***Wat is je leeftijd?***\" refers to their age. It's a fixed expression.\n\nThe English word ***how*** is also used as ***hoe***, some examples:\n\n* ***Hoe*** *gaat het? \\[How are you?\\]*\n* ***Hoe*** *heb je dat gedaan? \\[How did you do that?\\]*\n* ***Hoe*** *kan ik je helpen? \\[How can I help you?\\]*\n* ***Hoe*** *vaak rook je per dag? \\[How many times a day do you smoke?\\]*\n* ***Hoe*** *gaan we dit probleem oplossen? \\[How will we fix this problem?\\]*\n\nThere are also questions you can ask which would require a \"***what***\" in English:\n\n* ***Hoe*** *laat is het?  \\[What time is it?\\]*\n* ***Hoe*** *ziet je toekomst eruit? \\[What does your future look like?\\]*\n\nThe difference between ***hoe heet jij*** and ***hoe heten jullie*** is simple; the former refers to one person. The latter to multiple. Both are translated to ***you*** in English and can be used in unformal situations.\n\nI don't know if you speak any other languages, but it's like \"***tu***\\*\"\\* and \"***vous***\" in French or \"***du***\" and \"***ihr***\" in German or \"***tu***\" and \\*\"\\****vosotros, vosotras***\" in Spanish.  \n\"***Hoe heet u***\" is formal (***Sie*** in German, ***Usted/Ustedes*** in Spanish).\n\n&#x200B;\n\n*Please, fellow Dutch-speaking friends, add more information because I kind of fail to explain why it is like this. Or if anyone has any tips on how non-natives can do it right.*", "created_utc": "1641455071.0", "edited": "False", "id": "hrgr8tc", "is_submitter": "False", "link_id": "t3_rx8k2u", "parent_id": "t3_rx8k2u", "score": "17", "subreddit": "learndutch", "subreddit_id": "t5_2t6rf"}, {"author": "luellababalola", "body": "Je suis vraiment reconnaissante pour toutes informations, waouh. Je vais t’envoyer un message privé où je répondrai à tout ce que tu as écrit, vu que c’est plus facile. Merci de tout cœur, tu es formidable ! <3", "created_utc": "1641384843.0", "edited": "False", "id": "hrcfcks", "is_submitter": "True", "link_id": "t3_rvvltv", "parent_id": "t1_hrc7ia4", "score": "1", "subreddit": "French", "subreddit_id": "t5_2rd5t"}, {"author": "luellababalola", "body": "I’d give you an award if I had any, you made me laugh out loud 😂 \n\nYou’re right, though. I’ve noticed that most learners think Dutch Dutch is easier to understand, and it could be true. In Belgium, we often leave out say « lope » instead of « lopen », « koke » instead of « koken » and that’s just one example.", "created_utc": "1641335783.0", "edited": "False", "id": "hr9vb5e", "is_submitter": "False", "link_id": "t3_rvzf6r", "parent_id": "t1_hr9up4b", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "luellababalola", "body": "Correct! The first one is spoken in « de Kempen », the other one is the dialect of Antwerp (the city). Well done!", "created_utc": "1641334920.0", "edited": "False", "id": "hr9t3bi", "is_submitter": "False", "link_id": "t3_rvzf6r", "parent_id": "t1_hr9sveq", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "luellababalola", "body": "Hoi, welkom! Veel succes :)", "created_utc": "1641333242.0", "edited": "False", "id": "hr9osqq", "is_submitter": "False", "link_id": "t3_rw1qnp", "parent_id": "t3_rw1qnp", "score": "2", "subreddit": "WriteStreakNL", "subreddit_id": "t5_3g5eo9"}, {"author": "luellababalola", "body": "That's also what I found out, but I don't feel like I could possibly pass the C2 exam. It should reflect the knowledge of a native, and, being surrounded by French-speaking people, I can confirm (and so will them) that I am not qualified enough. You said your knowledge reflects C1, which means you've practised more than I did, so it definitely makes sense!\n\nThank you for your advice. I have found a tutor online who I believe can help me, so I'll definitely do that. \n\nGood luck on your C2! :)", "created_utc": "1641331070.0", "edited": "False", "id": "hr9j3b2", "is_submitter": "True", "link_id": "t3_rvvltv", "parent_id": "t1_hr9gp7b", "score": "1", "subreddit": "French", "subreddit_id": "t5_2rd5t"}, {"author": "luellababalola", "body": "I'll write two sentences in dialect because my native language is too easy to guess.  \nBoth my parents are from (kind of) different regions, so here we go.\n\n* *Merrege e chocolatte menneke in menne schoofzak. Plezaant!*\n* *Da fiêshe goh ni deur*", "created_utc": "1641330583.0", "edited": "False", "id": "hr9ht6m", "is_submitter": "False", "link_id": "t3_rvzf6r", "parent_id": "t3_rvzf6r", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "luellababalola", "body": "There's a *Centre de Langues* at my University and I'll go there tomorrow to ask them on advice, books, and courses. It seemed all books are lend out, so I'll probably go to a store tomorrow. Thank you for your advice! :)", "created_utc": "1641321419.0", "edited": "False", "id": "hr8tu2w", "is_submitter": "True", "link_id": "t3_rvvltv", "parent_id": "t1_hr8pphy", "score": "1", "subreddit": "French", "subreddit_id": "t5_2rd5t"}, {"author": "luellababalola", "body": "Welkom! Veel succes :)", "created_utc": "1641321298.0", "edited": "False", "id": "hr8tilx", "is_submitter": "False", "link_id": "t3_rvxyz2", "parent_id": "t3_rvxyz2", "score": "3", "subreddit": "WriteStreakNL", "subreddit_id": "t5_3g5eo9"}, {"author": "luellababalola", "body": "Yes, it makes sense! I'm currently trying to find a teacher, thank you :)", "created_utc": "1641316797.0", "edited": "False", "id": "hr8htsa", "is_submitter": "True", "link_id": "t3_rvvltv", "parent_id": "t1_hr8fvzi", "score": "1", "subreddit": "French", "subreddit_id": "t5_2rd5t"}, {"author": "luellababalola", "body": "D'accord, so, practising the types of exercises should be enough. Thank you very much for sharing your experience!", "created_utc": "1641316758.0", "edited": "False", "id": "hr8hq1n", "is_submitter": "True", "link_id": "t3_rvvltv", "parent_id": "t1_hr8gbo1", "score": "1", "subreddit": "French", "subreddit_id": "t5_2rd5t"}, {"author": "luellababalola", "body": "This advice is very helpful, thank you so much. I've never heard of Italki, but I'll get a teacher as soon as possible, and ask them all things you've mentioned. \n\nI never had to take the B2 exam. My university provided it as I study languages, and it was basically the level I hit last June. \n\nThank you! :)", "created_utc": "1641315590.0", "edited": "False", "id": "hr8er44", "is_submitter": "True", "link_id": "t3_rvvltv", "parent_id": "t1_hr8e0qu", "score": "3", "subreddit": "French", "subreddit_id": "t5_2rd5t"}, {"author": "luellababalola", "body": "How did it go? Was it hard?   \nThank you for your opinion and advice. I was thinking it might be better to buy something, which would reassure me better, but I've found a lot of tests online. You did it that way, I think I should be able to do it too then!", "created_utc": "1641315328.0", "edited": "False", "id": "hr8e2z3", "is_submitter": "True", "link_id": "t3_rvvltv", "parent_id": "t1_hr8cjbx", "score": "2", "subreddit": "French", "subreddit_id": "t5_2rd5t"}, {"author": "luellababalola", "body": "It’d be English, French, German and Dutch as those are the four languages I can somewhat speak fluently", "created_utc": "1641238537.0", "edited": "False", "id": "hr41hqm", "is_submitter": "False", "link_id": "t3_rv5dlm", "parent_id": "t3_rv5dlm", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "luellababalola", "body": "I think I might want to start doing this too. I am quite shy and I prefer to not take up too much space. But whenever someone asks me this question, all attention is on me, and I can tell they’re ready to judge me. You just helped a stranger out, thank you :)", "created_utc": "1641122766.0", "edited": "False", "id": "hqxa4cm", "is_submitter": "False", "link_id": "t3_rtpik1", "parent_id": "t1_hqvizpo", "score": "2", "subreddit": "vegan", "subreddit_id": "t5_2qhpm"}, {"author": "luellababalola", "body": "I second this. I’m also recovering from an eating disorder and having people compliment me on anything unrelated to physical appearance is so wholesome. \n\nI don’t know anything about your symptoms, but I’ve gained a good amount of weight thanks to recovery, though I’m very uncomfortable in my current body (wouldn’t trade it for the old one though). I know how hard it can be to accept anything weight/appearance related, so just letting you know that I’m here for you and that I’m proud. \n\nEating disorders ruin not only your life, but also the ones around you and I am just happy to know there’s one friend of yours who’s (still) around <3", "created_utc": "1641082840.0", "edited": "False", "id": "hqvdp6p", "is_submitter": "False", "link_id": "t3_rtngc0", "parent_id": "t1_hqu6ydd", "score": "10", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "luellababalola", "body": "Cool! Two foreigners in the same country! \n\nThat's because Bruges is more touristic! I like both equally, though Bruges is more authentic and small. There are no students, whereas Ghent is highly ranked, which means there are a lot of young people. \n\nIf you ever need any advice or tips, don't hesitate to DM me. :)", "created_utc": "1641076384.0", "edited": "False", "id": "hquynnx", "is_submitter": "False", "link_id": "t3_rtpyh1", "parent_id": "t1_hqux52a", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "luellababalola", "body": "Both popular and less popular languages have their advantages, disadvantages and utility. It mostly depends on what you want to do with them in the future, though.\n\nI cannot speak for the less popular ones, as I only *speak* bigger ones (Dutch will be the smallest with around 23 million speakers, though there are many languages out there with far less native speakers). \n\nEvery spoken language can be a plus, it just depends where you end up working/living. And you're also right about the commitment, however, I will abandon Spanish once I no longer need it. And that's okay. If you try any of these out and they end up not being your cup of tea, treat it as an experience rather than having failed. Same goes for relationships. \n\nAnd, I just saw your edit on your previous reaction: as far as I understand your situation regarding languages, you have knowledge and understand all three of them. To add to that, you do not need to read philosophy, history related books, watch videos you like etc. in the native language. I do understand where you're coming from, I too read in the native language of the writer, but it is not necessary.\n\nI read the other comments on your post too; you have the opportunity to learn all three at your uni. As you've got time (your words) you might want to attend one or two classes and decide which one you'll choose.", "created_utc": "1641076141.0", "edited": "False", "id": "hquy3h4", "is_submitter": "False", "link_id": "t3_rtqzmo", "parent_id": "t1_hquvheb", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "luellababalola", "body": "You're also Belgian and/or living in France? Join the club! :)\n\nI'm very glad you enjoyed it! I suggest the next city would be Ghent, as that one's also very cool!", "created_utc": "1641075086.0", "edited": "False", "id": "hquvnh2", "is_submitter": "False", "link_id": "t3_rtpyh1", "parent_id": "t1_hquvcbf", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "luellababalola", "body": "I am not a parent, nor do I have any knowledge on parenting. There was a girl in my class, however, who was in the same situation as your son.\n\nContext: her first language is Dutch, and her dad spoke French to her, from time to time. So, when I had lunch at theirs, she'd ask *peux-tu me passer le beurre, s'il te plaît.* Even though her dad tried to learn her the language, he kind of failed. Take into account that his French wasn't perfect. She nowadays never uses French anymore (because she doesn't need it). \n\nI therefore suggest that, if you consider yourself multilingual, you could do that despite not having an English accent. But if you don't, I don't necessarily think it's a good idea. But again, I'm not a parent and others might help you better. I just felt like sharing what I observed whilst in elementary school.", "created_utc": "1641074682.0", "edited": "False", "id": "hquup03", "is_submitter": "False", "link_id": "t3_rts743", "parent_id": "t3_rts743", "score": "6", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "luellababalola", "body": "I was talking about Belgium, though I am currently living in France :)", "created_utc": "1641074279.0", "edited": "False", "id": "hqutqw1", "is_submitter": "False", "link_id": "t3_rtpyh1", "parent_id": "t1_hqut3v4", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "luellababalola", "body": "Thank you for addressing the specific situations. Do you plan on travelling to Italy again? There's nothing wrong, at least IMO, to only study it when travelling. It seems to me that, even for a short period of time, you managed to become fluent despite losing motivation after your trips. If learning the language for special occasions like that satisfies you, I wouldn't feel too bad about not learning it long term.\n\nYou don't like Spanish that much as of right now, but once you dive into it, you might actually really enjoy it? I don't know how long it's been since you studied it at school, but people change and so do interests, which leaves room for enjoyment.\n\nIt's not a waste of time if you have time ;). And it's even better when your method might work. And remember; vocabulary gives you opportunities to discuss specific topics, but you will always need grammar to make correct sentences. It therefore is everything but a waste of time.", "created_utc": "1641074142.0", "edited": "False", "id": "hqutf5a", "is_submitter": "False", "link_id": "t3_rtqzmo", "parent_id": "t1_hqur8yu", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "luellababalola", "body": "Having learned those languages might help you study new languages as you know what your strengths and weaknesses are. That's a good thing! \n\nI am also studying German, so if you'd like to practise some time in the future, don't hesitate to send me a DM. \n\nGood luck!", "created_utc": "1641071123.0", "edited": "False", "id": "hqum60b", "is_submitter": "False", "link_id": "t3_rtpyh1", "parent_id": "t1_hqulex6", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "luellababalola", "body": "I will give my honest opinion, I’m sorry if it’s not what you want to hear.\n\nTo me, it seems like the only language you ever enjoyed learning was German. However, that’s no longer the case. If you dislike the language and the culture, what’s the point in learning a language just because you live close to the country?\n\nLanguage learning should be enjoyable, and from reading your post, I am not sure if you’ll actually enjoy learning any of the languages you presented to us.\n\nAs for **grammar**, I have the same problems regarding every language I have learned (including English, so bear with me). It’s the most difficult part, and I will dedicate more time to it in 2022. If you really aren’t motivated to dive into Italian or Spanish grammar, I wouldn’t learn either one of them. However, if you are not in a rush, you will have enough time to find resources, penpals and to practice your target language.\n\nLong story short: none of the languages you're asking advice on sound like you’re motivated enough to continue learning them in the long run. What happens once your Spanish project’s over or when you lose motivation for Italian again? Reconsider if necessary.\n\nAnd to answer your question, I can think of two things that might help:\n\n* instead of considering a language to be “hard”, consider it a **challenge**. Every challenge is difficult at the beginning; wanting to run 5km, sticking to a routine, going on a diet… But, once you stick to whatever challenge you chose, it will get easier. You will run farther, your routine will become a normal part of your day, and you will no longer miss “unhealthy” foods. The more you practise, the easier it’ll get.\n* all languages have **difficult**, and more **easy** aspects to it. Spanish \\[A2\\] is difficult for me, as I nearly don’t understand any vocabulary. However, the grammar I’ve seen this far, is quite consistent (ex. endings in -o for masculine, -a for feminine). These more easy aspects to the language might motivate you to learn the more difficult ones too.\n\nGood luck!", "created_utc": "1641070685.0", "edited": "False", "id": "hqul3cv", "is_submitter": "False", "link_id": "t3_rtqzmo", "parent_id": "t3_rtqzmo", "score": "4", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "luellababalola", "body": "I personally wouldn't do it. There's a reason that, in my country, we study a language for years and pass onto the next one after being somewhat comfortable speaking and reading.\n\nExample : \n\n* Age 9 : French\n* Age 12 : English\n* Age 16 : German and/or Spanish\n\nI have never studied Norwegian, so I have no idea how difficult it is, but I do know from experience that it takes quite some time before being able to communicate well in German without making too many mistakes. \n\nI think, however, that you could learn both this year (if that'd be a goal of yours). Just... don't confuse yourself too much. \n\nHave you ever learned any other languages? How did that go?", "created_utc": "1641069062.0", "edited": "False", "id": "hquh5m8", "is_submitter": "False", "link_id": "t3_rtpyh1", "parent_id": "t3_rtpyh1", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "luellababalola", "body": "I've never personally used Duolingo (I used Babbel and was very happy about my results, though it's payable). The people I know use it very rarely, so they don't progress really.\n\nI think it should be doable, but only if you put enough effort into it.", "created_utc": "1641068738.0", "edited": "False", "id": "hqugdcg", "is_submitter": "False", "link_id": "t3_rtnco0", "parent_id": "t3_rtnco0", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "luellababalola", "body": "You are right! Thank you for putting things into perspective :)", "created_utc": "1640936212.0", "edited": "False", "id": "hqnoegf", "is_submitter": "True", "link_id": "t3_rs0lhi", "parent_id": "t1_hql8h4t", "score": "2", "subreddit": "French", "subreddit_id": "t5_2rd5t"}, {"author": "luellababalola", "body": "Thank you for the description of what you had to do for your tef, it's really interesting. Even though you weren't that satisfied with the things you had to do, it does seem like you did a great job. And you have every right to still be proud of yourself, even though you believe you could've done better <3", "created_utc": "1640936163.0", "edited": "False", "id": "hqnoc22", "is_submitter": "True", "link_id": "t3_rs0lhi", "parent_id": "t1_hql3nk4", "score": "1", "subreddit": "French", "subreddit_id": "t5_2rd5t"}, {"author": "luellababalola", "body": "I second this. There are a lot of sites out there where you can meet people:\n\n* [https://www.hellotalk.com/](https://www.hellotalk.com/)\n* [https://www.tandem.net/](https://www.tandem.net/)\n* [https://www.mylanguageexchange.com/](https://www.mylanguageexchange.com/)\n* [https://www.conversationexchange.com/index.php?lg=fr](https://www.conversationexchange.com/index.php?lg=fr)\n* [https://www.seagull-tandem.eu/](https://www.seagull-tandem.eu/)\n* [https://polyglotclub.com/index/translate-french](https://polyglotclub.com/index/translate-french)\n\nYou can also try and find *language cafés* where you meet people and talk in whatever language you want to talk. \n\nWhen I was 17 and still in school, I read [this book](https://www.amazon.fr/Terrienne-Jean-Claude-Mourlevat/dp/2070654990). I don't like fantasy, nor do I think the book is really good literature, but it did help me improve my French. And I did enjoy it. Don't know if it was the storyline or the fact that I understood everything though, haha.", "created_utc": "1640891137.0", "edited": "False", "id": "hqkxk67", "is_submitter": "False", "link_id": "t3_rs40nr", "parent_id": "t1_hqkv05f", "score": "2", "subreddit": "French", "subreddit_id": "t5_2rd5t"}, {"author": "luellababalola", "body": "J'aimerais croire que les langues de l'amour sont vraies, mais qu'est-ce qui se passe quand un individu en a plusieurs ? Et est-ce qu'on peut coller des étiquettes à soi-même ?  Une étiquette n'est pas forcement une mauvaise chose, comprends-tu ce que je veux dire? :)", "created_utc": "1640890695.0", "edited": "False", "id": "hqkwepv", "is_submitter": "False", "link_id": "t3_rs45yu", "parent_id": "t3_rs45yu", "score": "3", "subreddit": "WriteStreak", "subreddit_id": "t5_2dm6a0"}, {"author": "luellababalola", "body": "I see where you're coming from! I've had people being charmed by my accent and I've had people being annoyed by it. I think that, when learning a language, we should try our best to sound as native as possible, as you're saying. I'll try the suggestion about the politicians, thanks!", "created_utc": "1640889615.0", "edited": "False", "id": "hqktkpb", "is_submitter": "True", "link_id": "t3_rs0lhi", "parent_id": "t1_hqks2l2", "score": "1", "subreddit": "French", "subreddit_id": "t5_2rd5t"}, {"author": "luellababalola", "body": "It makes me happy knowing that B2 allows room for mistakes, hesitations and imprecisions. It's nowhere near C2, and as you said, it can take yours before getting to C1, and I honestly wouldn't feel ready taking the C1 exams. How did it go?\n\nThe second paragraph makes a lot of sense. I usually don't write them down, unless it's something that reoccurs often. I'll note everything you said down so I can take a look at it whenever I feel the need to.", "created_utc": "1640889489.0", "edited": "False", "id": "hqkt8s0", "is_submitter": "True", "link_id": "t3_rs0lhi", "parent_id": "t1_hqkqkt0", "score": "3", "subreddit": "French", "subreddit_id": "t5_2rd5t"}, {"author": "luellababalola", "body": "Those are a lot of wise words, for which I thank you. This is kinda funny, but my sink is also clogged, what a coincidence. \n\nYou are right, studying can definitely feel like a chore! I attend Spanish classes that are taught in small groups, and it's always fun because there's not the \"we'll make an exercise on this now\". However, interacting with people who share the same interests or who can learn you something about their passions is even more interesting.\n\nThere are a lot of resources out there for us to improve our knowledge, so I'll get there, and your listening skills will improve too.\n\nThank you for your input. I appreciate it very much! :)", "created_utc": "1640888929.0", "edited": "False", "id": "hqkrrom", "is_submitter": "True", "link_id": "t3_rs0lhi", "parent_id": "t1_hqkpgez", "score": "3", "subreddit": "French", "subreddit_id": "t5_2rd5t"}, {"author": "luellababalola", "body": "Yes, indeed! What you're describing is exactly what happens! It doesn't happen when I create sentences in my head, but whenever I'm having a conversation, I'll have to think things through which is very annoying. So, it happens to you to, doesn't it?\n\nExactly! I find myself to switch quite quickly between Germanic languages. French is another handful and therefore even more difficult as a lot of words are in reversed order \\[think  ressources humaines, etc.\\]. \n\nThank you for your input. I'll try to think about it as you put it. :)", "created_utc": "1640888421.0", "edited": "False", "id": "hqkqfco", "is_submitter": "True", "link_id": "t3_rs0lhi", "parent_id": "t1_hqkp92s", "score": "1", "subreddit": "French", "subreddit_id": "t5_2rd5t"}, {"author": "luellababalola", "body": "This is very helpful. I'll definitely get back into it and use the topics. Thank you! :)", "created_utc": "1640887611.0", "edited": "False", "id": "hqkoajp", "is_submitter": "True", "link_id": "t3_rs0lhi", "parent_id": "t1_hqknahz", "score": "1", "subreddit": "French", "subreddit_id": "t5_2rd5t"}, {"author": "luellababalola", "body": "Thank you for your suggestions! I've tried WriteStreak but gave up after one week as I really didn't know what to write about. I might want to try it again.\n\nThe TV shows, or maybe even films idk, are also a good idea. I'll try to do that! \nOne friend of mine is muslim and so we ended up talking about religions. I lack vocabulary to do so and I just felt so dumb. So I'll definitely try to record and speak to myself talking about topics I struggle with. :)", "created_utc": "1640886616.0", "edited": "False", "id": "hqklnb8", "is_submitter": "True", "link_id": "t3_rs0lhi", "parent_id": "t1_hqk8u5p", "score": "1", "subreddit": "French", "subreddit_id": "t5_2rd5t"}, {"author": "luellababalola", "body": "I had this rule back in November to spend one hour revising grammar / vocab outside of class. I quickly gave up, but I'll incorporate it again once my exams are over. Thank you! :)", "created_utc": "1640886462.0", "edited": "False", "id": "hqkl8p7", "is_submitter": "True", "link_id": "t3_rs0lhi", "parent_id": "t1_hqk6tox", "score": "2", "subreddit": "French", "subreddit_id": "t5_2rd5t"}, {"author": "luellababalola", "body": "Haha, alors, je ne suis pas la seule personne qui oublie des mots ;). Et c'est ce que plusieurs personnes m'ont dit aussi. Il y a suffisamment de choix à mon avis. \n\nMerci pour votre aide! :)", "created_utc": "1640886407.0", "edited": "False", "id": "hqkl3jg", "is_submitter": "True", "link_id": "t3_rs0lhi", "parent_id": "t1_hqk6d9b", "score": "2", "subreddit": "French", "subreddit_id": "t5_2rd5t"}, {"author": "luellababalola", "body": "You've mentioned some very interesting and easy suggestions. I'll try all that. I know that my accent isn't very French as I struggle to do the \"R-français\". My throat gets soar whenever I try. This leads to people asking \"you're not from France, are you\". I'll try to work on it though.\n\nThank you for your time and effort! :)", "created_utc": "1640886219.0", "edited": "False", "id": "hqkklnc", "is_submitter": "True", "link_id": "t3_rs0lhi", "parent_id": "t1_hqk64sn", "score": "1", "subreddit": "French", "subreddit_id": "t5_2rd5t"}, {"author": "luellababalola", "body": "Haha, I love your suggestion! I'll try it, thank you! :)", "created_utc": "1640886093.0", "edited": "False", "id": "hqkk9n2", "is_submitter": "True", "link_id": "t3_rs0lhi", "parent_id": "t1_hqk2n0w", "score": "1", "subreddit": "French", "subreddit_id": "t5_2rd5t"}, {"author": "luellababalola", "body": "This was actually very helpful and it's nice to hear about someone else's experience. Three years to go from B2 to C1? Makes sense. I feel like the requirements for B2 are already quite high, so let alone C1. Well done! :)\n\nMaking mistakes is so normal, yet we do feel bad about it. I am just happy they do not laugh whenever I make one. That would make me feel bad, haha. I also look things up but tend to forget them. Do you write them down? Or how do you remember everything? \n\nThank you for taking the time to write your comment, I appreciate it very much :)", "created_utc": "1640886008.0", "edited": "False", "id": "hqkk1kg", "is_submitter": "True", "link_id": "t3_rs0lhi", "parent_id": "t1_hqkgkca", "score": "3", "subreddit": "French", "subreddit_id": "t5_2rd5t"}, {"author": "luellababalola", "body": "Vous avez sans aucun doute raison. A cause des partiels, j'oublie beaucoup de mots simples (comme *le bras* hier) parce que je suis fatiguée. C'est probablement normal, pourtant ça me dérange.\n\nMerci d'avoir partagé ce duo d'humoristes. Leurs vidéos ne durent pas longtemps, elles sont donc parfaites de regarder pendant une pause.\n\nSi les gens devraient me corriger tout le temps... Ils feraient probablement que me corriger, haha. ;)\n\nD'ailleurs, j'ai vu sur votre page que vous êtes végan.e, comme moi. J'ai l'impression que c'est plutôt rare en France.", "created_utc": "1640878745.0", "edited": "False", "id": "hqk1g9c", "is_submitter": "True", "link_id": "t3_rs0lhi", "parent_id": "t1_hqjxwl8", "score": "3", "subreddit": "French", "subreddit_id": "t5_2rd5t"}, {"author": "luellababalola", "body": "What you're saying sounds very logical. My professors, who're not French, have been living here for over 10 years. Of course their skills are great, they've been using it on a daily basis for many, many years. They said the same as you; it took them years before they got there.\n\nThank you for sharing your story, it is really inspirational. Perhaps I'll get there too. They often say *patience is key,* and I feel like it also applies in this situation. :)", "created_utc": "1640878004.0", "edited": "False", "id": "hqjzp8o", "is_submitter": "True", "link_id": "t3_rs0lhi", "parent_id": "t1_hqjxyrz", "score": "13", "subreddit": "French", "subreddit_id": "t5_2rd5t"}, {"author": "luellababalola", "body": "You're also *stuck* at B2 in French? That'd mean we're in the same boat, haha.\n\nI think you're right. It's the new words, the right usage of the subjonctif, etc. that are improving. It might be recognizable? \n\nYou're right, my classes are more or less passive learning. The topics are difficult, but I just learn them by hard tbh.   \nI haven't thought about  a tutor. I know there's this initiative at my uni where you can exchange languages. However, my first language isn't part of the initiative and I do not feel comfortable enough helping the French with their English. I'll look more into it. \n\nThank you for your time and advice! :)", "created_utc": "1640877729.0", "edited": "False", "id": "hqjz2fp", "is_submitter": "True", "link_id": "t3_rs0lhi", "parent_id": "t1_hqjxr5q", "score": "6", "subreddit": "French", "subreddit_id": "t5_2rd5t"}, {"author": "luellababalola", "body": "That's a good point! I also continue to improve my native language. Language learning is a life-long thing.\n\nGood luck to you too! :)", "created_utc": "1640873856.0", "edited": "False", "id": "hqjqkxm", "is_submitter": "True", "link_id": "t3_rs0lhi", "parent_id": "t1_hqjo9ff", "score": "3", "subreddit": "French", "subreddit_id": "t5_2rd5t"}, {"author": "luellababalola", "body": "I love the perspective you're giving, because that's right. Also, I know a lot of people in my home country who're kids of migrants and speak the parents' language at home. Their vocab and grammar isn't 100% what it should be, but everyone understands what they mean, and I like to help.\n\nI'd like to continue studying here, so I'll have to apply for a Master's. It might be important that I speak better than I do now. I, however, still have time to improve. \n\nThank you for your input, I really appreciate it. :)", "created_utc": "1640872424.0", "edited": "False", "id": "hqjnph6", "is_submitter": "True", "link_id": "t3_rs0lhi", "parent_id": "t1_hqjftvv", "score": "6", "subreddit": "French", "subreddit_id": "t5_2rd5t"}, {"author": "luellababalola", "body": "Thank you for taking the time to write all of that, I highly appreciate the effort. \n\nI couldn't agree more with what you're saying, everything is spot on. What you did when learning English > living the language, is something I should start doing too. I will take note of everything you said, so I can look back at it when I'm feeling insecure about my knowledge again. \n\nWhat you're saying about communication being harder when you're tired is also very relatable. It's not that bad when you're speaking (or even thinking) in your first language. \n\nI think that, if I keep thinking *I am not improving* I actually won't improve. I therefore will listen more attentively to those around me too. It's more tiring, mais cela vaudra la peine. \n\nThank you for your wise words. \n\nBy the way, if you wouldn't have mentioned the English certificate, I'd think your first language would be English. Good luck with French, you got this! :)", "created_utc": "1640871894.0", "edited": "False", "id": "hqjmox1", "is_submitter": "True", "link_id": "t3_rs0lhi", "parent_id": "t1_hqjhgk2", "score": "5", "subreddit": "French", "subreddit_id": "t5_2rd5t"}, {"author": "luellababalola", "body": "Voor jou ook prettige kerstdagen! :)", "created_utc": "1640451726.0", "edited": "False", "id": "hpxjjka", "is_submitter": "False", "link_id": "t3_ro55qm", "parent_id": "t3_ro55qm", "score": "2", "subreddit": "WriteStreakNL", "subreddit_id": "t5_3g5eo9"}, {"author": "luellababalola", "body": "Merci d'avoir corrigé mon texte! :)", "created_utc": "1640101693.0", "edited": "False", "id": "hpfp1k7", "is_submitter": "True", "link_id": "t3_r5tz1h", "parent_id": "t1_hpep19c", "score": "1", "subreddit": "WriteStreak", "subreddit_id": "t5_2dm6a0"}, {"author": "luellababalola", "body": "Wow, das ist echt Wahnsinn! Ich hoffe, er geht besser und nimmt keine Drogen mehr :o", "created_utc": "1639555873.0", "edited": "False", "id": "home0tw", "is_submitter": "False", "link_id": "t3_rgmx28", "parent_id": "t3_rgmx28", "score": "2", "subreddit": "WriteStreakGerman", "subreddit_id": "t5_364k6p"}, {"author": "luellababalola", "body": "I don't know if it is an option at all \\[for the police and for you emotionally\\]. But maybe you could write everything down and they could read it? I don't know how it works, but they will probably ask further questions that you will have to answer but in this way, you do not need to tell the whole story orally?", "created_utc": "1639552285.0", "edited": "False", "id": "hom9c1s", "is_submitter": "False", "link_id": "t3_rgiaaa", "parent_id": "t1_hol9aib", "score": "6", "subreddit": "askwomenadvice", "subreddit_id": "t5_30m5u"}, {"author": "luellababalola", "body": "Ahh! Je visiterai Paris en janvier. Vous pensez que ça vaut la peine de les visiter?   \nEt en effet! Là où j'habite, il y a une grève tous les samedis 😂. C'est horrible!", "created_utc": "1639549062.0", "edited": "False", "id": "hom4ndh", "is_submitter": "False", "link_id": "t3_rgkks3", "parent_id": "t3_rgkks3", "score": "3", "subreddit": "WriteStreak", "subreddit_id": "t5_2dm6a0"}, {"author": "luellababalola", "body": "C'est génial! Mes félicitations! Vous avez commencé le 14 janvier 2020, c'est ça? :)", "created_utc": "1639511240.0", "edited": "False", "id": "hoju6hl", "is_submitter": "False", "link_id": "t3_rge7m7", "parent_id": "t3_rge7m7", "score": "6", "subreddit": "WriteStreak", "subreddit_id": "t5_2dm6a0"}, {"author": "luellababalola", "body": "De nieuwe Form**ule**\\-1 wereldkampioen is **een** Nederlander! Gefeliciteerd Nederland!\r  \n\r  \nMax Verstappen heeft de laatste race in Abu Dhabi gewonnen. Helaas heb ik de race niet kunnen zien omdat ik bezig was/omdat ik het druk had.\r  \n\r  \nIn ieder geval kan ik zeggen dat **dit** Form**ule**\\-1 seizoen erg interessant was. Ik heb een paar rac**es** gezien: de wedstrijd tussen Hamilton en Verstappen was spannend.\n\n*Als je ooit in je professionele leven je derde zin gaat gebruiken, is het beter om te zeggen dat je het druk had i.p.v. dat je bezig was. ;)*", "created_utc": "1639485664.0", "edited": "False", "id": "hoi64uh", "is_submitter": "False", "link_id": "t3_rg1ts3", "parent_id": "t3_rg1ts3", "score": "3", "subreddit": "WriteStreakNL", "subreddit_id": "t5_3g5eo9"}, {"author": "luellababalola", "body": "Vielen Dank für die Korrektur! Schöner Sonntag! :)", "created_utc": "1639294782.0", "edited": "False", "id": "ho81n02", "is_submitter": "True", "link_id": "t3_rddowk", "parent_id": "t1_ho7xb8e", "score": "1", "subreddit": "WriteStreakGerman", "subreddit_id": "t5_364k6p"}, {"author": "luellababalola", "body": "Haha, das verstehe ich! Das hatte ich früher auch :)", "created_utc": "1639248943.0", "edited": "False", "id": "ho5hmjq", "is_submitter": "True", "link_id": "t3_rcof8v", "parent_id": "t1_ho5c5gi", "score": "1", "subreddit": "WriteStreakGerman", "subreddit_id": "t5_364k6p"}, {"author": "luellababalola", "body": "Oh en, je maakt echt weinig fouten! De fouten die je maakt zijn ook erg klein, dus echt chapeau! :)", "created_utc": "1639244089.0", "edited": "False", "id": "ho55zz6", "is_submitter": "False", "link_id": "t3_rdvkcy", "parent_id": "t1_ho55w84", "score": "2", "subreddit": "WriteStreakNL", "subreddit_id": "t5_3g5eo9"}, {"author": "luellababalola", "body": "De “Reddit Recap” is hier! Onder “recap” wordt een jaaroverzicht verstaan. Je kunt zien hoeveel tijd je heb doorgebracht op Reddit, of je succesvolste berichten.\r  \n\r  \nIn mijn geval heb ik 87 uren doorgebracht op WriteStreakNL. Dat is de tweede Subreddit wat doorgebrachte uren betreft. De eerste is WriteStreakGerman (109 uren).\r  \n\r  \nMijn beste bericht heeft iets te maken met het Nederlands: https://www.reddit.com/r/WriteStreak/comments/ndj4jo/streak\\_23\\_parlez\\_vous\\_n%C3%A9erlandais\\_writestreaknl\\_a/\r  \n\r  \nToen werd WriteStreakNL zojuist geopend, als ik **>> het <<** me goed herinner. De Subreddit had correctoren en gebruikers nodig en ik wilde de Subreddit ondersteunen. Ik had nooit kunnen denken dat dat bericht zo succesvol zou kunnen zijn. Ik heb 2 prijzen en 12 “upvotes” gekregen. En ik was zelfs bang dat ~~die~~ **dit** soort “publiciteit” niet toegestaan was, hoewel de Subreddit deel **(1)** van de WriteStreak gemeenschap is. Dat viel gelukkig mee!  \n\n\n**(1)** *deel* ***uitmaken*** *van iets is het correcte werkwoord. Deel* ***zijn*** *van iets wordt af en toe wel eens gebruikt is spreektaal.* ***Uitmaken*** *betekent hier in ieder geval hetzelfde als* ***zijn.***  \n\n\n*Dat zijn veel doorgebrachte uren! Gefeliciteerd (ook voor de \"beste\" post)! :)*", "created_utc": "1639244045.0", "edited": "False", "id": "ho55w84", "is_submitter": "False", "link_id": "t3_rdvkcy", "parent_id": "t3_rdvkcy", "score": "2", "subreddit": "WriteStreakNL", "subreddit_id": "t5_3g5eo9"}, {"author": "luellababalola", "body": "Vielen Dank für die Korrektur! :)\n\nHast du Lieblingsbands?", "created_utc": "1639243606.0", "edited": "False", "id": "ho54ub6", "is_submitter": "True", "link_id": "t3_rcof8v", "parent_id": "t1_ho4wre7", "score": "1", "subreddit": "WriteStreakGerman", "subreddit_id": "t5_364k6p"}, {"author": "luellababalola", "body": "Vielen Dank für die Korrektur! Dann wünsche ich dir ein schönes Wochenende! :)", "created_utc": "1639157084.0", "edited": "False", "id": "ho0cxdn", "is_submitter": "True", "link_id": "t3_rbych3", "parent_id": "t1_hnzleo6", "score": "2", "subreddit": "WriteStreakGerman", "subreddit_id": "t5_364k6p"}, {"author": "luellababalola", "body": "Merci de tout coeur pour la correction! :)", "created_utc": "1639075397.0", "edited": "False", "id": "hnvu81c", "is_submitter": "True", "link_id": "t3_r8st6u", "parent_id": "t1_hnvpyob", "score": "2", "subreddit": "WriteStreak", "subreddit_id": "t5_2dm6a0"}, {"author": "luellababalola", "body": "Vielen Dank für die Korrektur! :)\nDeutschland ist so groß und kompliziert mit allen verschiedenen Systeme in den Bundesländern 😅", "created_utc": "1638998291.0", "edited": "False", "id": "hnrooxc", "is_submitter": "True", "link_id": "t3_rb250t", "parent_id": "t1_hnrgwez", "score": "1", "subreddit": "WriteStreakGerman", "subreddit_id": "t5_364k6p"}, {"author": "luellababalola", "body": "Tu as complétement raison! Et la comparaison avec l'anglais est très clair aussi. En fait, je pense que c'est comme ça en toutes les langues (au moins celles que je parle). Je te remercie pour ta contribution. :)", "created_utc": "1638838781.0", "edited": "False", "id": "hnj7oeh", "is_submitter": "True", "link_id": "t3_rafrqd", "parent_id": "t1_hniic0q", "score": "4", "subreddit": "WriteStreak", "subreddit_id": "t5_2dm6a0"}, {"author": "luellababalola", "body": "Vielen Dank für die Korrektur! :)\nAh, ich vergesse immer, dass es kein Leerzeichen vor ein Doppelpunkt gibt.😅", "created_utc": "1638818248.0", "edited": "False", "id": "hnhtjcf", "is_submitter": "True", "link_id": "t3_ra8dpt", "parent_id": "t1_hnh9bz0", "score": "2", "subreddit": "WriteStreakGerman", "subreddit_id": "t5_364k6p"}, {"author": "luellababalola", "body": "Ich gebe dir völlig Recht! Das sind sehr gute Maßnahmen! Gibt es die Möglichkeit für Bürger, um eigene Maßnahmen vorzuschlagen?\n\nVielen Dank für die Korrektur :)", "created_utc": "1638818142.0", "edited": "False", "id": "hnht9m2", "is_submitter": "True", "link_id": "t3_r9hyrl", "parent_id": "t1_hnhhwul", "score": "2", "subreddit": "WriteStreakGerman", "subreddit_id": "t5_364k6p"}, {"author": "luellababalola", "body": "Goede vraag eigenlijk. Zelf wist ik er niet meteen het antwoord op, maar hier heb je hem :\n\n\"De verledentijdsvorm van willen is wilde of wou. Wou wordt vaker in België dan in Nederland gebruikt. In Nederland wordt wou aangevoeld als informelere variant van het neutrale wilde.\" [https://taaladvies.net/willen-wilde-of-wou-wilden-of-wouden/]. In principe klopt het dus. \n\nMijn excuses voor de verwarring. Het Nederlands dat jij leert is ongetwijfeld vanuit Nederland, correct? Dan is het waarschijnlijk beter dat je door Nederlands gecorrigeerd wordt 😅.", "created_utc": "1638800823.0", "edited": "False", "id": "hngmhbm", "is_submitter": "False", "link_id": "t3_r9mn8k", "parent_id": "t1_hngi13a", "score": "2", "subreddit": "WriteStreakNL", "subreddit_id": "t5_3g5eo9"}, {"author": "luellababalola", "body": "In het stadsbestuur was er een *tegenstelling* **(1)** tussen twee oplossingen voor de aanwezigheid van illegale huizen en krotten langs de Amsterdamse grachten. Aan de ene kant **wou** een deel van het stadsbestuur een snelle oplossing: d**e** gronden onteigenen door terugbetaling. Aan de andere kant **wou** een deel de illegale gebouwen laten staan, *>>komma<<*  tenzij hun respectieve eigenaars een belasting betaalden voor melioratie en herwaardering van de grond.\n\nVolgens het eerste deel hield de melioratie van al aanwezige huizen speculatie in. Dat nam niet weg dat sommige mensen hun grond illegaal *hadden gekregen* **(2)**.\n\nEen commissie zou die gebouwen onderzoeken, maar er werd niets gedaan. Zelfs burgemeester Oetgens kon namelijk ongestoord speculeren.\n\nBovendien was er een andere praktijk: huisbouwers, die daar huizen bouwden, verkochten ze aan de hoogste bieders. Op deze manier verrijkten ze zich.\n\nOndanks corruptie en andere problemen lukte **(3)** het plan voor de uitbreiding van Amsterdam. De stad bleef groeien en bereikte een bevolking van 200 000 mensen in 1670 (zestig jaar na het begin van de grachtengordel).\n\n&#x200B;\n\n**(1)** *een tegenstelling is iets anders (bv koud en warm, licht en donker). Woorden dat hier beter passen : onenigheid, discussie,... Onenigheid is, naar mijn mening, de beste.*  \n**(2)** *in principe is hier niets fout mee, maar een actieve zin maakt het luchter om te lezen ;* ***kregen***.  \n**(3)** *gewoon een synoniem ; slaagde. Lukte is ook volledig correct!*\n\n&#x200B;\n\n*Heel goed geschreven! :)*", "created_utc": "1638795990.0", "edited": "False", "id": "hngd5g4", "is_submitter": "False", "link_id": "t3_r9mn8k", "parent_id": "t3_r9mn8k", "score": "2", "subreddit": "WriteStreakNL", "subreddit_id": "t5_3g5eo9"}, {"author": "luellababalola", "body": "J'aime l'enthousiasme dans ta réponse! :) \nC'est bien que ta famille apprécie également les jeux de société! \nQuels jeux sont tes favoris? :)", "created_utc": "1638795503.0", "edited": "False", "id": "hngcb9s", "is_submitter": "True", "link_id": "t3_r9libu", "parent_id": "t1_hnf0j7o", "score": "1", "subreddit": "WriteStreak", "subreddit_id": "t5_2dm6a0"}, {"author": "luellababalola", "body": "Ok, vielen Dank! :)", "created_utc": "1638795394.0", "edited": "False", "id": "hngc4pt", "is_submitter": "False", "link_id": "t3_r9ji3x", "parent_id": "t1_hnfk0vc", "score": "2", "subreddit": "WriteStreakGerman", "subreddit_id": "t5_364k6p"}, {"author": "luellababalola", "body": "Weiß du wo ich diese Film finden kann? Die Weihnachtsfilme die man im Fernsehen sehen kann, mag ich nicht gerne und vielleicht werde ich diese schätzen. :)", "created_utc": "1638728216.0", "edited": "False", "id": "hncn5wd", "is_submitter": "False", "link_id": "t3_r9ji3x", "parent_id": "t3_r9ji3x", "score": "2", "subreddit": "WriteStreakGerman", "subreddit_id": "t5_364k6p"}, {"author": "luellababalola", "body": "Eigentlich ist es interessant! Wir lernen über die Migration in Deutschland, das Bildungssystem, die Gesundheitspolitik, Gewerkschaften, die Industrie, die Rentenpolitik, die Energiewende, die Wiedervereinigung Deutschlands, über Frauen in der Arbeitswelt. Aber, ich kann mich vorstellen, es klingt nicht super interessant, haha.\n\nVielen Dank für die Korrektur! :))", "created_utc": "1638699622.0", "edited": "False", "id": "hnb5rre", "is_submitter": "True", "link_id": "t3_r8sg8u", "parent_id": "t1_hnaax9a", "score": "1", "subreddit": "WriteStreakGerman", "subreddit_id": "t5_364k6p"}, {"author": "luellababalola", "body": "Pourvu que tu sois contente avec ta décision, tout va bien. Comme tout le monde, je connais plusieurs personnes qui regrettent leurs décisions et c'est dommage. Des fois, on ne sait pas vraiment ce qu'elles sont, nos passions. Je soupçonne c'est pourquoi une grande partie recommence à étudier.\n\nJe suivrai tes conseils, merci beaucoup et bonne journée/bon week-end! :)", "created_utc": "1638634452.0", "edited": "False", "id": "hn7hquv", "is_submitter": "True", "link_id": "t3_r871r8", "parent_id": "t1_hn7g5mn", "score": "2", "subreddit": "WriteStreak", "subreddit_id": "t5_2dm6a0"}, {"author": "luellababalola", "body": "Oof, alors, il faut que tu réfléchisses beaucoup avant de prendre une décision... Qu'est-ce qu'as-tu choisi? :)  \nJ'hésite entre le domaine humanitaire et les affaires/relations internationales. Il y a un lien entre les deux, mais c'est quand même difficile à choisir 😅\n\nMerci pour le bon conseil! :)", "created_utc": "1638633081.0", "edited": "False", "id": "hn7ephr", "is_submitter": "True", "link_id": "t3_r871r8", "parent_id": "t1_hn7apq3", "score": "2", "subreddit": "WriteStreak", "subreddit_id": "t5_2dm6a0"}, {"author": "luellababalola", "body": "Vielen Dank für die Korrektur und die extra Information! :)\nIn diesen Text habe ich \"es gibt\" nicht oft verwendet, aber normalerweise wähle ich immer davor. Ist es störend, wenn Menschen es zu viel verwenden?", "created_utc": "1638628092.0", "edited": "False", "id": "hn74ew0", "is_submitter": "True", "link_id": "t3_r85tt8", "parent_id": "t1_hn6s4c2", "score": "2", "subreddit": "WriteStreakGerman", "subreddit_id": "t5_364k6p"}, {"author": "luellababalola", "body": "Vielen Dank für die Korrektur! :)\nEigentlich ist alles logisch, aber es ist immer ein bisschen schwierig 😅.", "created_utc": "1638627976.0", "edited": "False", "id": "hn746p5", "is_submitter": "True", "link_id": "t3_r6e4qf", "parent_id": "t1_hn6dc2v", "score": "1", "subreddit": "WriteStreakGerman", "subreddit_id": "t5_364k6p"}, {"author": "luellababalola", "body": "De bevolking van Amsterdam groeide aanzienlijk dankzij de grote toestroom van vluchtelingen uit Vlaanderen. Maar ook dankzij de aankomst van Joodse vluchtelingen uit Portugal, die ook aan de culturele en de economische ontwikkeling van de stad bijdroegen.\r  \n\r  \nIn 1585 telde Amsterdam ongeveer 30 000 inwoners. Minder dan veertig jaar later – in 1622 – telde de stad meer dan 100 000 inwoners. Dat betekent dat de stadsbevolking in korte tijd verdrievoudigde.\r  \n\r  \n*Het ligt voor de hand* **(1)** dat zo’n grote groei een opmerkelijk gewicht had op de structuur van de stad. Een plan was nodig voor een *verbreiding* **(2)** van Amsterdam.  \n\n\n**(1)** *dit moest ik opzoeken ; in België gebruiken we voornamelijk \"het is vanzelfsprekend\" of \"het is voor de hand liggend\" maar in het Nederlandse Nederlands is het volledig correct! Dankzij jou heb ik iets bijgeleerd.*  \n**(2)** ***uitbreiding*** *past beter in deze context. Verbreiden gebruik je eerder in de zin van \"het nieuws verbreidt zich snel\" al zou ik persoonlijk in die context eerder kiezen voor ver****sp****reiden.* \n\n*Dat wil zeggen dat je maar één foutje maakte! Heel goed gedaan! Ik hoop dat al mijn extra info bij je streaks toch een beetje interessant of helpend zijn. Bedankt voor de interessante info!*", "created_utc": "1638561413.0", "edited": "False", "id": "hn3w3hq", "is_submitter": "False", "link_id": "t3_r846c1", "parent_id": "t3_r846c1", "score": "3", "subreddit": "WriteStreakNL", "subreddit_id": "t5_3g5eo9"}, {"author": "luellababalola", "body": "Dan was het helemaal correct, super! :)\n\nDat begrijp ik. Cultuur en geschiedenis zijn belangrijk wanneer je een taal studeert.", "created_utc": "1638513153.0", "edited": "False", "id": "hn1emwg", "is_submitter": "False", "link_id": "t3_r7c1qb", "parent_id": "t1_hmyn9nk", "score": "2", "subreddit": "WriteStreakNL", "subreddit_id": "t5_3g5eo9"}, {"author": "luellababalola", "body": "Wow! Das wusste ich nicht! Vielen Dank für die Korrektur und für die extra Informationen. Ich habe es notiert und werde es nicht mehr vergessen! :)", "created_utc": "1638512990.0", "edited": "False", "id": "hn1edy0", "is_submitter": "True", "link_id": "t3_r7cm71", "parent_id": "t1_hmz9h31", "score": "2", "subreddit": "WriteStreakGerman", "subreddit_id": "t5_364k6p"}, {"author": "luellababalola", "body": "Ik ben een boek aan het lezen dat over de Nederlandse geschiedenis gaat. Ik moet een hoofdstuk over de 17de eeuw leren voor een tentamen aan de universiteit. Ik profiteer hiervan om mijn geschreven**~~e~~** Nederlands te oefenen terwijl ik wat geschiedenis doorneem. Het hoofdstuk begint met een beschrijving van de groei van Amsterdam.\r  \n\r  \nHet staat **erom** bekend dat de 17de eeuw een periode van economische groei voorstelde in *Holland* **(1)**. Vooral in Amsterdam. Deze groei was niet *alleen* **(2)** te danken aan de handel. **(Ook) b**uitenlanders speelden een belangrijke rol in de vooruitgang van Amsterdam.\r  \n\r  \nBuitenlanders uit Brabant en Vlaanderen droegen veel bij tot de groei van Amsterdam doordat veel vreemdelingen al rijke handelaars of ambachtslieden waren. Dat had te maken met het beleg van Antwerpen (1584-1585), toen koopmannen toevlucht zochten in Amsterdam, dat al aan het groeien was.\r  \n\r  \nDe rijke kooplieden leerden Amsterdammers hun economische en culturele gewoontes. Zo werden Amsterdammers handiger – wat handel betrof – en “verfijnder”.\r  \n\r  \nSamenvattend valt te zeggen dat buitenlanders een nieuwe vorm gaven aan de Amsterdamse sfeer.\n\n**(1)** *dit kun je bijna onmogelijk weten, maar Nederland bestaat uit 12 provincies waaronder Zuid- en Noord-Holland. Wanneer je \"Holland\" gebruikt, refereer je naar één van beide of zelfs alle twee. Wanneer je \"Nederland\" gebruikt, refereer je naar het hele land. Amsterdam ligt in Noord-Holland, dus wanneer je spreekt over dat deeltje is het volledig correct. Maar geen zorgen! Er zijn heel wat mensen, voornamelijk Belgen (zoals ik) die hier fouten tegen maken.*  \n**(2)** *suggestie : enkel, maar alleen klopt ook!*\n\n*Studeer je geschiedenis?*\n\n*Tot slot een compliment : je hebt de dt-regel ook volledig door. Voor heel wat natives is dit enorm moeilijk, maar je hebt daar, sinds ik begon met verbeteren, nog nooit een fout tegen gemaakt. Chapeau!*", "created_utc": "1638467329.0", "edited": "False", "id": "hmyhg8s", "is_submitter": "False", "link_id": "t3_r7c1qb", "parent_id": "t3_r7c1qb", "score": "2", "subreddit": "WriteStreakNL", "subreddit_id": "t5_3g5eo9"}, {"author": "luellababalola", "body": "Ahh, vielen Dank für die Korrektur! :) \nEs ist immer schwierig, über die Vergangenheit zu schreiben, aber diese Korrektur wird mir helfen!", "created_utc": "1638439615.0", "edited": "False", "id": "hmwyqdw", "is_submitter": "True", "link_id": "t3_r5kt2c", "parent_id": "t1_hmuzaof", "score": "1", "subreddit": "WriteStreakGerman", "subreddit_id": "t5_364k6p"}, {"author": "luellababalola", "body": "Gefeliciteerd! :)", "created_utc": "1638362262.0", "edited": "False", "id": "hmsf4r1", "is_submitter": "False", "link_id": "t3_r6c3ei", "parent_id": "t3_r6c3ei", "score": "3", "subreddit": "WriteStreakNL", "subreddit_id": "t5_3g5eo9"}, {"author": "luellababalola", "body": "De Adventskalender is een hulpmiddel om zich voor te bereiden op Kerstmis. Adventskalenders zijn heel populair in Duitsland en Oostenrijk. In mijn land zijn ze ook redelijk populair: ze worden altijd ~~op~~ **in** supermarkten en andere winkels verkocht.\r  \n\r  \nEen adventskalender bestaat uit 23 of 24 (meestal 24) deurtjes net zoals de dagen van **de** Advent (de periode voor Kerstmis). Je moet elke dag één deurtje opendoen, waar je snoep (meestal chocolade) of *een speelgoed* **(1)** kan vinden. Op 1 december zal ik alleen het deurtje met het cijfer 1 opendoen **/ openen**. **De** ~~V~~**v**olgende dag zal ik het deurtje 2 mogen opendoen **/ openen**. Enzovoort.\r  \n\r  \nZijn adventskalender ook in Nederland en België populair?\n\n**(1)** ***een*** *speelgoed****je*** *of* ***speelgoed*** *(zonder lidwoord)* \n\n*Over het algemeen alweer heel goed geschreven! Ja hoor, ook in Nederland en België zijn deze populair. Zelf woon ik in Frankrijk en ook daar zijn ze populair. Misschien wel in heel Europa?*   \n*Morgen is je 200ste dag, je bent al enorm ver gekomen! :)*", "created_utc": "1638301242.0", "edited": "False", "id": "hmp90fj", "is_submitter": "False", "link_id": "t3_r5hpcp", "parent_id": "t3_r5hpcp", "score": "2", "subreddit": "WriteStreakNL", "subreddit_id": "t5_3g5eo9"}, {"author": "luellababalola", "body": "Il y a longtemps que j'ai vu ce film! As-tu l'apprécié? C'est bien à entendre que ce soit intéressant et que tu as appris encore plus sur les croissants! :)", "created_utc": "1638300806.0", "edited": "False", "id": "hmp7x3w", "is_submitter": "True", "link_id": "t3_r5tz1h", "parent_id": "t1_hmp6t7n", "score": "3", "subreddit": "WriteStreak", "subreddit_id": "t5_2dm6a0"}, {"author": "luellababalola", "body": "Je suis tout à fait d'accord avec toi! De plus, je préfère que ce soit intéressant / informatif à lire. Ou bien, que ceux qui lisent le texte, deviennent faim ;). \nMoi, j'aime bien les croissants avec la confiture, je n'ai jamais essayé de les accompagner avec quelque chose de salé. Qu'est-ce que tu peux me recommander? :)", "created_utc": "1638300694.0", "edited": "False", "id": "hmp7n4y", "is_submitter": "True", "link_id": "t3_r5tz1h", "parent_id": "t1_hmp5yi2", "score": "3", "subreddit": "WriteStreak", "subreddit_id": "t5_2dm6a0"}, {"author": "luellababalola", "body": "Whoah! Merci de tout coeur! Votre améliorations/corrections m'aideront sans aucun doute. Je mettrai un coup d'oeil à votre chaîne YouTube. :)", "created_utc": "1638267682.0", "edited": "1638268374.0", "id": "hmnbem0", "is_submitter": "True", "link_id": "t3_r4zaim", "parent_id": "t1_hmlfcfy", "score": "3", "subreddit": "WriteStreak", "subreddit_id": "t5_2dm6a0"}, {"author": "luellababalola", "body": "Bonjour, merci beaucoup! Merci d'avoir partagé l'événement, je mettrai un coup d'oeil :)", "created_utc": "1638217668.0", "edited": "False", "id": "hmkoa3h", "is_submitter": "True", "link_id": "t3_r4zaim", "parent_id": "t1_hmk0n8k", "score": "2", "subreddit": "WriteStreak", "subreddit_id": "t5_2dm6a0"}, {"author": "luellababalola", "body": "Bonjour! :)", "created_utc": "1638217623.0", "edited": "False", "id": "hmko64g", "is_submitter": "True", "link_id": "t3_r4zaim", "parent_id": "t1_hmk0e06", "score": "2", "subreddit": "WriteStreak", "subreddit_id": "t5_2dm6a0"}, {"author": "luellababalola", "body": "Merci beaucoup! :)", "created_utc": "1638217612.0", "edited": "False", "id": "hmko54b", "is_submitter": "True", "link_id": "t3_r4zaim", "parent_id": "t1_hmjr08o", "score": "2", "subreddit": "WriteStreak", "subreddit_id": "t5_2dm6a0"}, {"author": "luellababalola", "body": "Vielen Dank für die Korrektur! :)\n\nJa, ich denke auch, eine Steigerung wird gut sein!", "created_utc": "1638217595.0", "edited": "False", "id": "hmko3o9", "is_submitter": "True", "link_id": "t3_r4u8kf", "parent_id": "t1_hmjr04t", "score": "2", "subreddit": "WriteStreakGerman", "subreddit_id": "t5_364k6p"}, {"author": "luellababalola", "body": "Pons is een online woordenboek dat ik bijna dagelijks gebruik. Pons-Verlag is een Duitse uitgeverij die zich op het leren van vreemde talen concentreert. Pons biedt een groot aantal online woordenboeken, waaronder een NL-DE/DE-NL woordenboek.\n\nHet woordenboek is erg simpel en praktisch: ~~hij~~  **het (1)** toont de vertaling (of de vertalingen) direct aan. Er staat ook informatie over het geslacht en het meervoud van een woord. Ik vind het best snel en daarom gebruik ik het als ik ~~het~~ haast heb. Helaas krijg je nauwelijks verklaringen of uitdrukkingen *ten opzichte van* **(3)** een woord. Dat is een nadeel van dit woordenboek.\n\nVroeger gebruikte ik het iets vaker, toen ik het Nederlands was **aangebroken (2)**. Aangezien ik al Duits kon, gebruikte ik dit woordenboek om Nederlands beter te begrijpen. Ik ~~wilde~~  **wou** alle verschillen en gelijkenissen identificeren. Ik concentreerde me eerst op soortgelijke woorden. Nu gebruik ik meestal Van Dale.\n\nHier is de link van het woordenboek: [https://de.pons.com/%C3%BCbersetzung/niederl%C3%A4ndisch-deutsch](https://de.pons.com/%C3%BCbersetzung/niederl%C3%A4ndisch-deutsch)\n\n**(1)** *wanneer een woord onzijdig is, gebruik je het lidwoord 'het'. Is het woord mannelijk of vrouwelijk, dan combineer je het met 'de'.*  \n**(2)** *wat bedoel je met aangebroken zijn in het Nederlands? Wanneer je startte?*  \n**(3)** *eerlijk gezegd ben ik niet zeker of je dit zo kan zeggen. Ik zou iets zeggen in de zin van:* \"*Helaas biedt het woordenboek nauwelijks verklaringen of uitdrukkingen.\"*  \n*Met krijgen gaat het ook, maar dat wordt moeilijker:* \"*Helaas krijg je nauwelijks een verklaring of uitdrukking van een woord* ***te zien***.\" *bijvoorbeeld. Maar die tweede zin vind ik zelf minder correct.*", "created_utc": "1638186066.0", "edited": "False", "id": "hmirm41", "is_submitter": "False", "link_id": "t3_r4syee", "parent_id": "t3_r4syee", "score": "2", "subreddit": "WriteStreakNL", "subreddit_id": "t5_3g5eo9"}, {"author": "luellababalola", "body": "Vielen Dank für die Korrektur! :)\n\nEs ist sehr interessant, dass es Unterschiede zwischen Umgangssprache und Schriftliche Sprache gibt. Ich würde darauf achten.\n\nDu hast Recht, beiden haben Vor- und Nachteile. :)", "created_utc": "1638185541.0", "edited": "False", "id": "hmiqx7z", "is_submitter": "True", "link_id": "t3_r46bqp", "parent_id": "t1_hmhzf9q", "score": "1", "subreddit": "WriteStreakGerman", "subreddit_id": "t5_364k6p"}, {"author": "luellababalola", "body": "Vielen Dank für die Korrektur! :)\n\nDeiner Meinung nach der Südlink ist sehr interessant und wahrscheinlich die beste Lösung!", "created_utc": "1638185407.0", "edited": "False", "id": "hmiqr0x", "is_submitter": "True", "link_id": "t3_r46bqp", "parent_id": "t1_hmhygoe", "score": "2", "subreddit": "WriteStreakGerman", "subreddit_id": "t5_364k6p"}, {"author": "luellababalola", "body": "**Op** een Nederlandse wijze. Dat is heel erg normaal, zeker als je nog geen jaar bezig bent. Chapeau! :)", "created_utc": "1638127823.0", "edited": "False", "id": "hmfpckl", "is_submitter": "False", "link_id": "t3_r392pq", "parent_id": "t1_hmeyusb", "score": "2", "subreddit": "WriteStreakNL", "subreddit_id": "t5_3g5eo9"}, {"author": "luellababalola", "body": "Als ik onder stress sta,**(1)** probeer ik altijd om mijn werk te verminderen. Onder stress kan je in ieder geval niet goed werken,**(2)** je prestatie staat onder druk.\n\nIk richt me op mezelf: ik besteed wat tijd aan het relaxen of aan mijn hobby's. Ik luister naar muziek, ik lees, ik schrijf, ik ga even kort wandelen of ik hou**d** me bezig met het leren van talen, **w**at ik bijna nooit vermoeiend vind.\n\n**(1)** *in het Nederlands plaats je tussen 2 werkwoorden een komma (,).*   \n**(2)** *dit is niet fout, maar het is beter om de komma (,) te verplaatsen door \"want\".*\n\n*Weer heel goed geschreven! Hoe lang studeer je al Nederlands?*", "created_utc": "1638112039.0", "edited": "False", "id": "hmeniig", "is_submitter": "False", "link_id": "t3_r43pa1", "parent_id": "t3_r43pa1", "score": "2", "subreddit": "WriteStreakNL", "subreddit_id": "t5_3g5eo9"}, {"author": "luellababalola", "body": "Ik volg een cursus economische geschiedenis aan de universiteit, sinds oktober **(1)**. De naam van het vak is vanzelfsprekend: er wordt de geschiedenis van de economie gestudeerd\\*\\*. J\\*\\*e leert wel een paar zaken en concepten van de economie, maar je leert meestal geschiedenis (mensen, gemeenschap, politiek, oorzaken...) ten opzichte van de belangrijkste economische gebeurtenissen.\n\nDe cursus gaat over hedendaagse geschiedenis (vanaf 1800)**. E**r wordt bijvoorbeeld op de eerste en de tweede economische revoluties en op de rollen van Groot-Brittannië en de Verenigde Staten gelet. De twee wereldoorlogen zijn ook belangrijke thema's, net zoals de crisis van 1929, die ik aan het leren ben.\n\nIk vind dat deze cursus erg nuttig en interessant is om de wereld en onze geschiedenis beter te begrijpen.\n\n*Eerlijk gezegd is je Nederlands echt erg goed! Het leest gemakkelijker wanneer je je zinnen minder lang maakt, vandaar dat ik enkele leestekens veranderd heb om nieuwe zinnen te starten. Verder stel ik volgende aanpassing voor :*\n\n**(1) Sinds oktober, volg ik** een cursus economische geschiedenis aan de universiteit.*=> deze zin leest ook vlotter en zo zullen we eerder spreken.*\n\n*Mijn excuses, één ding krijg ik niet in het vet, vandaar de \\*\\*.*", "created_utc": "1638111804.0", "edited": "False", "id": "hmen0xm", "is_submitter": "False", "link_id": "t3_r392pq", "parent_id": "t3_r392pq", "score": "2", "subreddit": "WriteStreakNL", "subreddit_id": "t5_3g5eo9"}, {"author": "luellababalola", "body": "Die Korrektur und der Kontext sind sehr interessant, vielen Dank! Auf diese Weise kann ich mich immer verbesseren. :)", "created_utc": "1638085569.0", "edited": "False", "id": "hmdl9hs", "is_submitter": "True", "link_id": "t3_r3hcvw", "parent_id": "t1_hmdgygs", "score": "1", "subreddit": "WriteStreakGerman", "subreddit_id": "t5_364k6p"}, {"author": "luellababalola", "body": "Ahh, vielen Dank! Das möchte mir im Zukunft sicherlich weiterhelfen. :)", "created_utc": "1638085438.0", "edited": "False", "id": "hmdl2s5", "is_submitter": "True", "link_id": "t3_r2u295", "parent_id": "t1_hmdjkky", "score": "2", "subreddit": "WriteStreakGerman", "subreddit_id": "t5_364k6p"}, {"author": "luellababalola", "body": "Vielen Dank! :)", "created_utc": "1637953217.0", "edited": "False", "id": "hm6nn5o", "is_submitter": "True", "link_id": "t3_r29vy7", "parent_id": "t1_hm6ca2r", "score": "2", "subreddit": "WriteStreakGerman", "subreddit_id": "t5_364k6p"}, {"author": "luellababalola", "body": "Vielen Dank für die Korrektur! :)\n\nAlso, meine Muttersprache ist Niederländisch und ich studiere auf Französisch in Frankreich. Wenn ich im März bewerben würde für einen Master, werde ich auf Deutsch in Deutschland und auf Französisch in Frankreich studieren. Das war warscheinlich nicht ganz klar, weil mein Deutsch nicht so gut ist.\n\nWenn du Fragen hast über ein Studium in Frankreich, kannst du mir immer einen Bericht schicken! Vielleicht kann ich helfen (auch mit der Verbesserung deines Französischs). Ich hoffe, das Schreiben auf diese Subreddit möchte mir helfen. Vielleicht kann es dir auch helfen auf die Französische Subreddit zu schreiben. :)", "created_utc": "1637953203.0", "edited": "False", "id": "hm6nm3u", "is_submitter": "True", "link_id": "t3_r29vy7", "parent_id": "t1_hm5eywr", "score": "2", "subreddit": "WriteStreakGerman", "subreddit_id": "t5_364k6p"}]