[{"author": "LynxGlad", "body": "A case (rus. «падеж») is basically a situation where a noun or a pronoun changes its form to show some semantic meaning, for example, an object being used in a specific way.\n\nIf a language has cases, they are often rather strictly defined with various verbs demanding which case is to be used for the object.\n\nConsider Russian, for example, since you already speak it. We have 6 cases (as natives learn in school, even though in fact there are extra ones). The meaning of the verb signifies which case is supposed to be used. In order to figure out the necessary case, we are taught to ask the questions “who?” and “what?” and see in which case we instinctively put it.\n\nFor example, let’s take the word «стол» (table) and use it with various verbs.\n\nНаходиться (to be located): находится кто?/что? - стол. This is the nominative case (именительный падеж), where «стол» is a subject.\n\nСделать из (to make of): сделать из кого?/чего? - стола. This is the genitive case (родительный падеж), in Russian we use to it to show that something is not present («нет стола») or the starting point of something (“сделано из стола», «убрать со стола»)\n\nПомогать (to help): помогать кому?/чему? - столу. This is dative case (дательный падеж), which we use to show that the action expressed by the verb is done towards this object. In Russian, we also use it to refer to the person who perceives the situation: «мне нравится» (‘I like’), “мне кажется» (‘it seems to me’)\n\nВидеть (to see): видеть кого?/что? - стол. This is the accusative case (винительный падеж), which we use with the direct object of a transitive verb. \n\nКидаться (to throw): кидаться кем?/чем? - столом. This is the instrumental case (творительный падеж), which signifies that the object is used as an instrument or a means to do something, just as the name says.\n\nLastly, думать о (to think about): думать о ком?/о чем? - о столе. This is the prepositional case (предложный падеж), which was initially used to signify locations («на чем? в чем? при чем?») and now includes some other prepositions.\n\nAs you can see from this example, cases in a language usually have different meanings, and various verbs demand various cases depending on what you are trying to express. Some languages have less cases then Russian, some have more. English and Spanish do not have cases, but the traces of cases can be found in pronoun changes (I-me-my/mine, similar stuff in Spanish).\n\nTo figure out the cases in your target language, you have to dive into them, understand what they mean and how you are supposed to use them. There is no general rule for all languages, each one has its own stuff.", "created_utc": "1668259004.0", "edited": "False", "id": "iw2had2", "is_submitter": "False", "link_id": "t3_yt5kjw", "parent_id": "t3_yt5kjw", "score": "4", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "LynxGlad", "body": "To Igor\n\nOn his 16th birthday\n\nFrom uncle Alik / 1977", "created_utc": "1667939891.0", "edited": "False", "id": "ivlen3c", "is_submitter": "False", "link_id": "t3_ypxowb", "parent_id": "t3_ypxowb", "score": "77", "subreddit": "russian", "subreddit_id": "t5_2qlc6"}, {"author": "LynxGlad", "body": "German. \n\nI had to pick it as my second foreign language after I changed schools, since my original second foreign language was not an option there. I did try, but it just made zero sense, especially in terms of matching nouns with gendered articles. Some of the cases matched with my NL in meanings, but the verbs often required a different case than in my NL, so I also couldn’t wrap my head around it. Eventually I just gave up and cheated until I was finally allowed to drop it. \n\nTbh, I think if I had any motivation aside from doing well in classes, I would have powered through. But I didn’t and I eventually came to dislike the language itself, so dropping it was the obvious choice.", "created_utc": "1667744991.0", "edited": "False", "id": "ivaaevp", "is_submitter": "False", "link_id": "t3_ynpfyj", "parent_id": "t3_ynpfyj", "score": "11", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "LynxGlad", "body": "Disclaimer: not a native.\n\nFirst things first: ‘pain’ is a noun, ‘ache’ can be a verb or a noun, ‘sore’ is an adjective, ‘hurt’ is a verb or a participle. This is necessary to understand when you’re figuring out how to use them correctly. I haven’t ever seen or used ‘paining’, and almost all examples of its usage seem to be a misspelling of ‘painting’. ‘Ache’ has a derivative adjective ‘achy’, but it’s not very common.\n\n\nMeanings:\n\n• Pain - any type of physical discomfort/suffering in a body part;\n\n• Hurt - the verb describes a process of something bringing you pain (“my hand hurts”); the participle is used to say that a body part or a person received physical or emotional pain (“My hand was hurt in a fight”, “I was hurt by his words”);\n\n• Sore, soreness - pain after something was used or touched (“I worked out yesterday and now my muscles are sore”);\n\n• Ache, achy - continuous dull pain (“I have a headache”).\n\n\nNow onto the examples.\n\n1 - ‘ache’ is used incorrectly here, you need an adjective, so it’s either ‘achy’ or ‘sore’. It’s better to use ‘sore’ here, since it is a more common word and describes pain received after using his back in his sleep.\n\n2 - Perfectly fine!\n\n3 - I would probably go with ‘hurts’ here, ‘hurting’ is usually reserved for emotional pain. If your body part is in pain, it’s fine to say ‘hurts’.\n\n4 - Again, fine and probably a good example to illustrate the meaning of ‘sore’. A pain from some activity.\n\n5 - as pointed out earlier, ‘paining’ is not a good choice, people don’t really use this word. You can either say “you are in pain” or “you are hurting”.\n\nAnswering the last question: if you are in pain regularly, usually because of an illness, you can say “chronic pain”. If you stabbed your toe, you should probably go with “my toe hurts”.\n\n(edit: fixed paragraphs)", "created_utc": "1667652912.0", "edited": "1667653282.0", "id": "iv5ce6a", "is_submitter": "False", "link_id": "t3_yms2kb", "parent_id": "t3_yms2kb", "score": "3", "subreddit": "EnglishLearning", "subreddit_id": "t5_2u8ap"}, {"author": "LynxGlad", "body": "Ohhh, French and Korean seems to be a rather similar combination to mine in terms of linguistic difference, thank you for reassuring me. It honestly seems like the language learning zone is exactly what I need to be able to learn, especially on my bad days (I have no idea how I managed to learn English in the first place :P)\n\nI have been in an on-and-off relationship with Spanish for over a decade now and I think I can get back to A2 if I give myself some time and put in effort, so I’ll definitely be trying this. Good luck to you in your studies too :)", "created_utc": "1667593279.0", "edited": "False", "id": "iv2lg63", "is_submitter": "False", "link_id": "t3_yl6uup", "parent_id": "t1_iv28q3a", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "LynxGlad", "body": "Not OP, but in a similar situation. If you don’t mind me asking, are you learning two languages from the same family? It seems like an easier choice since they may be rather similar, but also easier to mix up.\n\nI’ve been trying to bully myself into consistently studying Japanese and your comment made me consider picking up Spanish for like the 5th time, but I’m a bit worried they are too different and I’ll end up giving up on both once again.", "created_utc": "1667586226.0", "edited": "False", "id": "iv23s3f", "is_submitter": "False", "link_id": "t3_yl6uup", "parent_id": "t1_iuwuo7t", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "LynxGlad", "body": "Haven’t seen any of those, but TBH if I was involved into celeb finance/management and I knew about them exploiting loopholes/doing financial machinations/doing awful stuff like SA/grooming, I would be torn between job obligations and wanting to expose them at least in some way. This probably means I’m not going to go far in my career field too lmao", "created_utc": "1642885739.0", "edited": "False", "id": "htsi460", "is_submitter": "True", "link_id": "t3_sa71fz", "parent_id": "t1_htsc3no", "score": "-4", "subreddit": "Deuxmoi", "subreddit_id": "t5_2rqcm8"}, {"author": "LynxGlad", "body": "I have next to no knowledge on internet privacy and stuff, so I’d love to hear an opinion of someone knowledgeable on how protected Deuxmoi anonymous submission form might be. I feel like some data on IP adress and type of device might be saved when submitting? Timezone maybe? Idk idk, really want someone to give an input on this.", "created_utc": "1642884998.0", "edited": "False", "id": "htsgahb", "is_submitter": "True", "link_id": "t3_sa71fz", "parent_id": "t1_htsax40", "score": "2", "subreddit": "Deuxmoi", "subreddit_id": "t5_2rqcm8"}, {"author": "LynxGlad", "body": "Oh, I didn’t know that! This makes a lot of sense, actually, but I’ve never thought about this before because DM doesn’t really care about less famous people like influencers and I usually skip such gossip on other pages bc I never know who these people are.", "created_utc": "1642882156.0", "edited": "False", "id": "hts9cm8", "is_submitter": "True", "link_id": "t3_sa71fz", "parent_id": "t1_hts7nay", "score": "2", "subreddit": "Deuxmoi", "subreddit_id": "t5_2rqcm8"}, {"author": "LynxGlad", "body": "If you don’t mind me asking, what’s LSA? 🙇🏼‍♀️", "created_utc": "1642804355.0", "edited": "False", "id": "htntzmz", "is_submitter": "False", "link_id": "t3_s8iqkk", "parent_id": "t1_hthoog1", "score": "2", "subreddit": "Deuxmoi", "subreddit_id": "t5_2rqcm8"}, {"author": "LynxGlad", "body": "mostly thinking about my thesis problems tbh. there is also the fact that i receive a lot of emails from my uni staff about jobs/career stuff (like, 90% of my inbox), while i feel like my current descent back into depressed state has a lot to do with my last job and a necessity to find a new one.", "created_utc": "1637462700.0", "edited": "False", "id": "hlgomsf", "is_submitter": "True", "link_id": "t3_qykvp5", "parent_id": "t1_hlgnjeq", "score": "2", "subreddit": "depression", "subreddit_id": "t5_2qqqf"}, {"author": "LynxGlad", "body": "pretty sure this is not news, i remember it being discussed on tumblr\n\nETA: just looked it up there to refresh my memory, and the opinions are mostly like this\n\n1. DWD is bad, but Florence is okay/good/really good\n2. A lot of people who went to the screenings are biased stans of H who don’t like his latest relationship and therefore hate on the movie for no reason, so the movie is good / we can’t say the movie is definitely that bad\n3. A lot of people who went to the screenings are fans of H, so if they do say the movie is bad, that means it really is bad\n4. Rare good opinions", "created_utc": "1637452292.0", "edited": "1637453147.0", "id": "hlg37pt", "is_submitter": "False", "link_id": "t3_qyhqv9", "parent_id": "t1_hlg2hee", "score": "39", "subreddit": "Deuxmoi", "subreddit_id": "t5_2rqcm8"}, {"author": "LynxGlad", "body": "the wording is questionable, but it probably means it was off 01.09-15.09. also, Gaby facetimed her parents on 25.08.\n\nedit: confused “means” and “believed”", "created_utc": "1632171117.0", "edited": "1632171390.0", "id": "hdmyn1m", "is_submitter": "False", "link_id": "t3_ps0dcg", "parent_id": "t1_hdmyeix", "score": "3", "subreddit": "GabbyPetito", "subreddit_id": "t5_51bf5n"}, {"author": "LynxGlad", "body": "if a person has murderous tendencies, they might be interested in reading something like that. reading something like that does not imply a person has murderous tendencies. this link only goes one way.", "created_utc": "1632167076.0", "edited": "False", "id": "hdmot8t", "is_submitter": "False", "link_id": "t3_ps0dcg", "parent_id": "t1_hdmo7qr", "score": "3", "subreddit": "GabbyPetito", "subreddit_id": "t5_51bf5n"}, {"author": "LynxGlad", "body": "1. It is said around that he went to move stuff from a storage unit with his father. Also speculated that GP and BL might have had a fight and separated for that reason.\n2. In the van. He went to a hotel.\n3. LE released a statement saying they are not. People speculate they are wrong or could be covering up the truth for investigation purposes.\n4. I don’t know, sorry.", "created_utc": "1632166005.0", "edited": "False", "id": "hdmm6i8", "is_submitter": "False", "link_id": "t3_ps0dcg", "parent_id": "t1_hdmlleh", "score": "2", "subreddit": "GabbyPetito", "subreddit_id": "t5_51bf5n"}, {"author": "LynxGlad", "body": "could you please post a screenshot or the article text? not from the us, the link doesn’t work for me.", "created_utc": "1632164042.0", "edited": "False", "id": "hdmhe18", "is_submitter": "False", "link_id": "t3_ps0dcg", "parent_id": "t1_hdmh0xx", "score": "1", "subreddit": "GabbyPetito", "subreddit_id": "t5_51bf5n"}, {"author": "LynxGlad", "body": "neighbours have reported him going for bike rides with his mom, walking around and cleaning the van.", "created_utc": "1632162175.0", "edited": "False", "id": "hdmcu9n", "is_submitter": "False", "link_id": "t3_prwrdd", "parent_id": "t1_hdmcmrl", "score": "4", "subreddit": "GabbyPetito", "subreddit_id": "t5_51bf5n"}, {"author": "LynxGlad", "body": "good to know. thank you!", "created_utc": "1632158133.0", "edited": "False", "id": "hdm2zty", "is_submitter": "False", "link_id": "t3_prwrdd", "parent_id": "t1_hdm2p7f", "score": "3", "subreddit": "GabbyPetito", "subreddit_id": "t5_51bf5n"}, {"author": "LynxGlad", "body": "He could access Spotify from a different phone or a laptop. This is pure speculation, I’m simply interested in the privacy policy in a situation like this.", "created_utc": "1632158074.0", "edited": "False", "id": "hdm2uob", "is_submitter": "False", "link_id": "t3_prwrdd", "parent_id": "t1_hdm2ifc", "score": "3", "subreddit": "GabbyPetito", "subreddit_id": "t5_51bf5n"}, {"author": "LynxGlad", "body": "Quick q: if their playlist / account was edited by him and not Spotify, could Spotify have any information about last locations the account was accessed from? Could they make it public or send to the LE or would that be a breach of privacy?", "created_utc": "1632157730.0", "edited": "False", "id": "hdm20k5", "is_submitter": "False", "link_id": "t3_prwrdd", "parent_id": "t3_prwrdd", "score": "8", "subreddit": "GabbyPetito", "subreddit_id": "t5_51bf5n"}]