[{"author": "madam-mamamama", "body": "idk why i take it so serious😔", "created_utc": "1665955099.0", "edited": "False", "id": "isleys2", "is_submitter": "True", "link_id": "t3_y5rwcw", "parent_id": "t1_isldge3", "score": "1", "subreddit": "teenagers", "subreddit_id": "t5_2rjli"}, {"author": "madam-mamamama", "body": "sometimes i get too lazy and tired to sit and study a bit but on the days when i find energy for it afterwards i feel so mentally relieved i regret i dont do this daily. its usually not a lot of work but its still enough to shift focus and so relax a little bit. \n\np.s. good luck on your studies OP, 頑張ってください", "created_utc": "1663626467.0", "edited": "False", "id": "ip4fijw", "is_submitter": "False", "link_id": "t3_xiiugr", "parent_id": "t1_ip4anm6", "score": "3", "subreddit": "LearnJapanese", "subreddit_id": "t5_2qyls"}, {"author": "madam-mamamama", "body": "don’t know actually, unless \"i just like the process of studying\" count.\nat first i got interested in japanese cause i wanted to start watching anime. i havent watched a lot of it (2 honestly) and i dont think ill become a huge fan, only planning now to try and buy manga to practice. that i would like to do a lot, but it feels like itll take years for me to finally be able to read ones that i want.\nneither do i plan to live or work here, it seems to me that you need to be really hardworking and serious to get a good job there, im too stupid and lazy for that, i also dont think ill fit in there.\nwould like to visit japan tho, stay but not for too long and like settle there.\n\nin general i still keep studying cause it honestly relaxes me a lot. handwriting kanji, flashcards, a bit of reading. i feel the process and small improvement too, quite satisfying. it could be any other language but it turned out to be japanese so i keep going cause i know eventually ill find use for it and it 100% wont be a waste of time", "created_utc": "1663613559.0", "edited": "False", "id": "ip3kyp1", "is_submitter": "False", "link_id": "t3_xiiugr", "parent_id": "t3_xiiugr", "score": "3", "subreddit": "LearnJapanese", "subreddit_id": "t5_2qyls"}, {"author": "madam-mamamama", "body": "i dont know actually, i have a pretty big wish list and it differs from time to time which one of the languages i think id like to pick up next. all those languages are the ones that ive already been studying at some point previously though. \n\nspanish - id like to pick it up again because i love how it sounds, i love the music, cultures of spanish speaking countries, id wanted to study it all my life but somehow i got to the point where id prioritize japanese (my current TL)\n\ngerman - i started learning german in school 5 years ago but im really bad at it. imma be back to school literally in a few days and ill still have german classes and ill need to get grades somehow. whatnot i have love-hate relationships with german though, but id really like to study it because i want to visit german speaking countries (germany, austria, switzerland) and maybe stay there for some time in the future \n\nukrainian - i started dabbling in ukrainian when the lockdown started. my bestest of friends is ukraininan and she tends to speak to me sometimes in ukrainian, send me videos/tiktok and other content in ukrainian so i kind of get a lot of exposure to the language from her. i cant think of the specific goal why id learn ukrainian but at least ill be able to communicate with my friend, its a legit goal right?\n\nchinese - id like to study chinese mostly because of the tv dramas games and content ngl. i also have a chinese friend, i plan to go and visit her someday\n\nchoosing the next language will be really hard for me and its a really important decision but ill guess in the end ill just use a fortune wheel in google to choose lmao", "created_utc": "1661710065.0", "edited": "False", "id": "im5mhy1", "is_submitter": "False", "link_id": "t3_wzs3g0", "parent_id": "t3_wzs3g0", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "madam-mamamama", "body": "a so kirgys it is. imho sounds cool thi\nthank you, my fellow xiao pfp owner", "created_utc": "1660747092.0", "edited": "False", "id": "iknu027", "is_submitter": "False", "link_id": "t3_wpusbm", "parent_id": "t1_ikmnnkr", "score": "2", "subreddit": "teenagers", "subreddit_id": "t5_2rjli"}, {"author": "madam-mamamama", "body": "i tried to google kotok and it found me a firm making cat toys lol. \nthough i had an idea that it might be tatar or bashkir or something like that, ig had to google better next timе", "created_utc": "1660678513.0", "edited": "1660682363.0", "id": "ikk7cgf", "is_submitter": "False", "link_id": "t3_wpusbm", "parent_id": "t1_ikk6kz6", "score": "3", "subreddit": "teenagers", "subreddit_id": "t5_2rjli"}, {"author": "madam-mamamama", "body": "i can understand the piska and hui ones, but what is kotok and chochok tho? what language is that?", "created_utc": "1660677903.0", "edited": "False", "id": "ikk5r7g", "is_submitter": "False", "link_id": "t3_wpusbm", "parent_id": "t1_ikiw69t", "score": "4", "subreddit": "teenagers", "subreddit_id": "t5_2rjli"}, {"author": "madam-mamamama", "body": "im not in america but ive also noticed that stigma regarding japanese and korean, for korean it is kpop in particular. imho those are still valid reasons to learn jp or kor but i hate that they have quite bad reputation if i can put it like that. i dont talk to a lot of people but i think some still view asian languages and culture as at least something strange. maybe thats becuase of weird local stereotypes that i dont know why exist. as someone mentioned in replies below, it indeed seems as some sort of love-hate tho, cause ‘well anime and manga is for total weirdos but we love sushi’ (idk the first example that popped up in my head)\n\nim not sure if i could get the idea clear,my reply  seems all messed up", "created_utc": "1656843132.0", "edited": "False", "id": "ieojof0", "is_submitter": "False", "link_id": "t3_vq6276", "parent_id": "t1_ienz73k", "score": "6", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "madam-mamamama", "body": "i dont usually tell anyone that im studying japanese cause the ultimate responses of almost everyone from where i am would be ‘oh thats because of anime?’, ‘damn/etc anime fans’, or just treating it as something weird and even making fun of it (brother im referring to you right now). i do watch anime sometimes but damn thats not the only reason why i want to learn japanese. my close friends who know about this are anime and manga fans so they understand. \n\nthe one’s who are not even close to all that and know about me learning japanese are my mom and one of my teammates. during a somewhat of a discussion about my coming high school she suggested me to learn chinese then i said that chinese is cool but im currently working on japanese and she said something like ‘japanese? thats cool too’. i didnt expect any sharp reactions from her but i still was quite surprised and relieved. my teammate whom ive also told about it is a heritage romanian speaker and studied it for some time so she doesnt treat learning languages other than english as something strange (yes there are such people), i think she understands me. we were at the subway when i mentioned that and later on she would tell me some random easy sentences that i coukd translate in japanese and she then translated them in romanian. she even bought me a self-study book for japanese as a present for my birthday! i really appreciate her, she is a really good friend\n\nit seems that i shouldnt treat learning japanese as some secret though. i cant say anything in particular about english on this topic cause speaking it is treated as something cool by default imho", "created_utc": "1656823718.0", "edited": "False", "id": "ienvl1f", "is_submitter": "False", "link_id": "t3_vq6276", "parent_id": "t3_vq6276", "score": "13", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "madam-mamamama", "body": "i dont even know you but im happy for you, this must be an extremely good feeling reaching this milestone and seeing how your skills have improved! even though ive been learning english for some years already i havent had any decent irl conversation so i kind of envy you( i wish i could use languages that i learn on daily basis but theres sometimes just no opportunity for it and im quite anxious to look for exchange partners but i guess thats only my problem\n\nanyways, i wish you to keep the spirits and efforts up, youll definitely get better at it!", "created_utc": "1655382612.0", "edited": "False", "id": "ickp3ky", "is_submitter": "False", "link_id": "t3_vdd6nv", "parent_id": "t3_vdd6nv", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "madam-mamamama", "body": "i’m learning English and Japanese but i’m mostly focused on Japanese cause i think i’m at that level of English when i mostly need to use the language itself so i don’t spend too much time drilling vocab or grammar, i just watch something or chat with friends.\n\nso about Japanese, in past month i was able to spend nearly less than 30 mins a day cause of exams and trainings but due to the end of the school year i try to spend at least an hour in the evening. i usually study some grammar points and revise or learn new vocab, sometimes i practice writing kanji. i don’t do listening now cause my level is still pretty low but i’m aiming to spend a good amount of time on listening in the near future too. i also read some grammar or other related articles or do flashcards with vocab during the breaks between school classes, so it adds averagely 20 mins a day", "created_utc": "1652466439.0", "edited": "False", "id": "i8hek46", "is_submitter": "False", "link_id": "t3_uoqg38", "parent_id": "t3_uoqg38", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "madam-mamamama", "body": "oh seems i now completely got the idea, thanks! but in that case i think that this concept of learning that the OP brought up would be pretty difficult at first", "created_utc": "1652051201.0", "edited": "False", "id": "i7urqff", "is_submitter": "False", "link_id": "t3_uj46fi", "parent_id": "t1_i7hkgz2", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "madam-mamamama", "body": "im not sure if i got your point right, but i sometimes read random english articles about some grammar points or vocabulary usage differences and nuances in russian language, which is my native, and sometimes i find put about things that i never knew were actually a thing lol. is that a bit like what you meant? if so, then it might be a pretty interesting experience though", "created_utc": "1651779534.0", "edited": "False", "id": "i7gr2xu", "is_submitter": "False", "link_id": "t3_uj46fi", "parent_id": "t3_uj46fi", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "madam-mamamama", "body": "yep you’re right it’s in Karelia, tho it’s actually on an island as far as i know not in a city", "created_utc": "1633731970.0", "edited": "False", "id": "hfws8h7", "is_submitter": "False", "link_id": "t3_q47jwg", "parent_id": "t1_hfwnkdk", "score": "1", "subreddit": "teenagers", "subreddit_id": "t5_2rjli"}, {"author": "madam-mamamama", "body": "kizhi pogost", "created_utc": "1633729745.0", "edited": "False", "id": "hfwn58b", "is_submitter": "False", "link_id": "t3_q47jwg", "parent_id": "t3_q47jwg", "score": "1", "subreddit": "teenagers", "subreddit_id": "t5_2rjli"}, {"author": "madam-mamamama", "body": "that’s great, keep it up you can do this!", "created_utc": "1630702337.0", "edited": "False", "id": "hbhqabv", "is_submitter": "False", "link_id": "t3_phdax9", "parent_id": "t3_phdax9", "score": "3", "subreddit": "teenagers", "subreddit_id": "t5_2rjli"}, {"author": "madam-mamamama", "body": "yo hi ive been thinking for a minute how to start a conversation well what’s up", "created_utc": "1630699333.0", "edited": "False", "id": "hbhjj75", "is_submitter": "False", "link_id": "t3_phcial", "parent_id": "t3_phcial", "score": "1", "subreddit": "teenagers", "subreddit_id": "t5_2rjli"}, {"author": "madam-mamamama", "body": "пиздец (pizdets) mostly used as an exclamation to describe something that went totally wrong.\n\nalso — полный пиздец (polniy pizdets) a bigger type of pizdets\n\nit actually can have a lot of meanings in different contexts you better google it yourself if you want", "created_utc": "1630697825.0", "edited": "False", "id": "hbhg513", "is_submitter": "False", "link_id": "t3_ph7kow", "parent_id": "t3_ph7kow", "score": "2", "subreddit": "teenagers", "subreddit_id": "t5_2rjli"}, {"author": "madam-mamamama", "body": "Ukraine?", "created_utc": "1630689319.0", "edited": "False", "id": "hbgwf1y", "is_submitter": "False", "link_id": "t3_ph2p9o", "parent_id": "t1_hbft8jv", "score": "3", "subreddit": "teenagers", "subreddit_id": "t5_2rjli"}, {"author": "madam-mamamama", "body": "havent had dinner yet but for lucnh i had something like a buckwheat porridge with meat, some pasta and a bit of chocolate bar", "created_utc": "1630670520.0", "edited": "False", "id": "hbfq3ho", "is_submitter": "False", "link_id": "t3_ph17p7", "parent_id": "t3_ph17p7", "score": "2", "subreddit": "teenagers", "subreddit_id": "t5_2rjli"}, {"author": "madam-mamamama", "body": "I learned when to write н or нн in maybe 6th grade, and at some period of time I could use that rule and could define the correct spelling. Now I’ve totally forgotten everything and write as it sounds better to me in my opinion, also for some cases I remember the correct spelling. Typical struggles.", "created_utc": "1618952991.0", "edited": "False", "id": "gv901qb", "is_submitter": "False", "link_id": "t3_mupfbe", "parent_id": "t1_gv7q8l6", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "madam-mamamama", "body": "don’t learn Russian, we conjugate everything.\n(except for adverbs, prepositions, conjunctions, particles and interjections, but this doesn’t make it fucking easier)\n\nalso it will be really hard to understand Russian speech because we use a lot of obscenities and parasitic words. There are a lot of words that don’t have exact translations so idk how are you going to understand them.\n\nand grammar. I’m eye-bleeding while trying to figure out when to write н or нн in participles. Even most of the natives don’t understand grammar.", "created_utc": "1618932505.0", "edited": "False", "id": "gv7mkuc", "is_submitter": "False", "link_id": "t3_mupfbe", "parent_id": "t3_mupfbe", "score": "167", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "madam-mamamama", "body": "Russian: привет\n\nUkrainian: привiт/здоров\n\nEnglish: hello/hi\n\nGerman: hallo\n\nSpanish: hola\n\nJapanese: こんにらは (actually took me 7 minutes to write, I’m not familiar with kana lol)/ konnichiwa \n\nFrench: bonjour (idk is this right? I only know how to pronounce it)\n\nItalian: ciao", "created_utc": "1617299466.0", "edited": "1617304550.0", "id": "gt1zs0e", "is_submitter": "False", "link_id": "t3_mhiuv5", "parent_id": "t3_mhiuv5", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "madam-mamamama", "body": "congrats, that must be a lot of work! I’m 14 too and speak only Russian and intermediate English, it’s cool that in your age you’re able to do such impressive things.\n\nby the way, do you study calligraphy? Those handwritten words you posted here look really cool!", "created_utc": "1617176034.0", "edited": "False", "id": "gsw5vbt", "is_submitter": "False", "link_id": "t3_mgygkr", "parent_id": "t3_mgygkr", "score": "4", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "madam-mamamama", "body": "about the job, I’m sure you will definitely find the one that comforts and suits you, that you really like. Choosing a job seems really complex to me, I think you shouldn’t be afraid of trying something new or giving something up you don’t like, finding your \"real place in this life\" is a kinda long process. No doubts sometimes it might be hard to choose, just need to know that you can find help and support if you need; as I said before, it will take some time, and I’m sure you already know that this also requires persistence and some more stuff like that. It’s not that easy, but I’m sure you’ll get through this, keep going,\nit’s going to be alright!\n\nP.S.: thanks for complementing my English, that is what I rarely hear.\nI know I might have confused and complicated what I wanted to say up here, but those simple words that say to never give up kinda can describe all that thing.\n\nwish you good luck!", "created_utc": "1617132636.0", "edited": "False", "id": "gsu26a2", "is_submitter": "False", "link_id": "t3_mgavs9", "parent_id": "t1_gstm3k3", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "madam-mamamama", "body": "hi! thanks for sharing your plans, honestly I also have a lot of thoughts of ways about emigrating and your post here kinda helped me to start trying to define my future plans.\n\nI’m from Russia and actually a middle/high school student, so I have time to think about this. \n\nI’m a basketball player and going to be a professional, so I guess I will be traveling around the world a lot or I even will be able to play somewhere in another country! So I can say in some possible ways I don’t know where I’m going to live in the near future. After ending a career I’m planning to study sociology or linguistics to work with people. I technically don’t know what type of job this will be, but I guess I’d like to try working in some kind of social support center or so, this way I can communicate really a lot with people and also I’d like to help others.\n\nFor about 2 years I’ve been thinking of moving to Canada because it has pretty similar climate to Russia, it has nice nature and it seems to me to be very sweet place, I just can’t describe. Recently I started thinking of Japan, too. The only things that scare me are earthquakes and tsunamis, but I hope if I’m there I will get used to it and nothing terrible will happen. I’ve heard and read about life in both Canada and Japan (not a lot, but enough in my opinion), and I’m really excited about it, for most of the time I just feel like that something is drawing me like a magnet.\n\nI don’t know what is waiting for me in future even in 1 year so I don’t make huge plans. I hope I will be able to travel at least if not emigrating.\n\nThe main reason for me to emigrate is to try other people’s mindset and everyday life.\nI think due to lack of life experience and so I might take these things easier than they really are and don’t understand the difficulty of grownup life, especially while emigrating, but I try to figure everything out as much in details as possible.\n\nP.S.: I’m bad at explaining something, especially in English that is not my native language, but I hope that turned out to be readable and understandable.", "created_utc": "1617122972.0", "edited": "False", "id": "gstgo9n", "is_submitter": "False", "link_id": "t3_mgavs9", "parent_id": "t3_mgavs9", "score": "4", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "madam-mamamama", "body": "\"ноги в руки в вперёд\" in Russian literally means \"put your legs in your arms and go forward\", but it actually means something like \"hurry up\" or \"to start doing something\". lmao I sometimes say \"руки в ноги\" (\"put your arms in your legs\")\n\nanother ones I know:\n\n\"отбросить коньки\", literally \"to throw the skates away\". We say this when we mean someone’s dead or going to be dead\n\n\"когда рак на горе свиснет\", literally \"when a lobster whistles on a mountain\". A very elegant way to say \"never\"\n\n\"мне по барабану\", I’d translate this as \"it’s on a drum to me\". A way to say \"I don’t care\"", "created_utc": "1614968935.0", "edited": "False", "id": "gpsueef", "is_submitter": "False", "link_id": "t3_lydmej", "parent_id": "t3_lydmej", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "madam-mamamama", "body": "I always get kind of scared and anxious of open doors and feel uncomfortable even if it’s light in there; well I think it might be a common thing for some other people, but I also feel like it is not supposed to be like that, idk honestly\nI think there’s not lots of things that in exception doesn’t scare me, I’m very fearful, the only one I can remember right now is that as far as I know a lot of people (in my entourage) are scared of being totally alone while I personally don’t care despite that I consider myself kind of sociable person", "created_utc": "1614845445.0", "edited": "False", "id": "gpmsedl", "is_submitter": "False", "link_id": "t3_lxf5e5", "parent_id": "t3_lxf5e5", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "madam-mamamama", "body": "accountant and everything similar", "created_utc": "1614799400.0", "edited": "False", "id": "gpkfxmn", "is_submitter": "False", "link_id": "t3_lx1yrs", "parent_id": "t3_lx1yrs", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "madam-mamamama", "body": "The Sharpest Lives - My Chemical Romance", "created_utc": "1614715693.0", "edited": "False", "id": "gpgb9hz", "is_submitter": "False", "link_id": "t3_lwb6a4", "parent_id": "t3_lwb6a4", "score": "5", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "madam-mamamama", "body": "аоаоа\n\ni always type like ‘aoaoao’ when i have nothing else to add\nso i guess imma just shout", "created_utc": "1614714952.0", "edited": "False", "id": "gpg9jhe", "is_submitter": "False", "link_id": "t3_lw3n7x", "parent_id": "t3_lw3n7x", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "madam-mamamama", "body": " vodka and balalaika probably\n\nbut without joking, the nature here and landscapes indeed can be awesome, tourism is well-developed itself\n\nimho we also have kinda good public transport system, (underground, trains, buses, etc)", "created_utc": "1614584706.0", "edited": "False", "id": "gpa1hhe", "is_submitter": "False", "link_id": "t3_luog17", "parent_id": "t3_luog17", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "madam-mamamama", "body": "maybe i can do this here, i’m looking for ‘apple’, when i accidentally went out of the server you were pink with ninja bandage. Code LOVSBF, North America server, if you’re watching this, apple, it’s cucumber \nI hope everyone who has lost their friends can find them. Unfortunately i think there’s no other way to find them all (", "created_utc": "1605395034.0", "edited": "False", "id": "gcatqux", "is_submitter": "False", "link_id": "t3_irjrtm", "parent_id": "t3_irjrtm", "score": "1", "subreddit": "AmongUs", "subreddit_id": "t5_yknuq"}, {"author": "madam-mamamama", "body": "really agree. I have lots of small cracks around the screen. They doesn’t disturb or distract while using the phone, but still add charm. Also for me they give me the feeling of kinda safety, for example it seems to me that for most of people the cracks on screens look repulsive so I feel more safely and care less about the fact that someone can steal my phone", "created_utc": "1601973894.0", "edited": "False", "id": "g7vmmqs", "is_submitter": "False", "link_id": "t3_j5vj07", "parent_id": "t3_j5vj07", "score": "1", "subreddit": "unpopularopinion", "subreddit_id": "t5_2tk0s"}]