[{"author": "madgirl_15", "body": " Ahh got it. The temporary ones.", "created_utc": "1666060525.0", "edited": "False", "id": "isr7to6", "is_submitter": "False", "link_id": "t3_xz20qo", "parent_id": "t1_isr7e4o", "score": "1", "subreddit": "skzcollection", "subreddit_id": "t5_524piq"}, {"author": "madgirl_15", "body": "Ahh ok. But do you know which online store was the group order from? Thanks so much for the quick response and help. 💕", "created_utc": "1666060252.0", "edited": "False", "id": "isr79p9", "is_submitter": "False", "link_id": "t3_xz20qo", "parent_id": "t1_isr7241", "score": "2", "subreddit": "skzcollection", "subreddit_id": "t5_524piq"}, {"author": "madgirl_15", "body": "Ahh I understand. I thought it included the photobook too. My bad.", "created_utc": "1666051878.0", "edited": "False", "id": "isqpm1e", "is_submitter": "False", "link_id": "t3_y2773b", "parent_id": "t1_isqmfgc", "score": "1", "subreddit": "skzcollection", "subreddit_id": "t5_524piq"}, {"author": "madgirl_15", "body": "Wow. Love this whole thread. I’m actually in the minority with: \n\nMy Pace > God’s Menu > Case 143 > Miroh > Side Effects > Back Door > Thunderous > Hellevator > All In > Maniac…", "created_utc": "1666051767.0", "edited": "False", "id": "isqpdre", "is_submitter": "False", "link_id": "t3_y2wv8v", "parent_id": "t1_isoymgm", "score": "3", "subreddit": "straykids", "subreddit_id": "t5_3ozlw"}, {"author": "madgirl_15", "body": "I think it would be too expensive for me. From the UK to the US it’s probably $30 at the very least. But thanks!", "created_utc": "1666050190.0", "edited": "False", "id": "isqm6ep", "is_submitter": "False", "link_id": "t3_y2773b", "parent_id": "t1_isqlsub", "score": "1", "subreddit": "skzcollection", "subreddit_id": "t5_524piq"}, {"author": "madgirl_15", "body": "Where did you get these from? Is that the STAY bag? Where?? I’m kinda new. Sorry.", "created_utc": "1666050055.0", "edited": "False", "id": "isqlwdl", "is_submitter": "False", "link_id": "t3_xz20qo", "parent_id": "t3_xz20qo", "score": "2", "subreddit": "skzcollection", "subreddit_id": "t5_524piq"}, {"author": "madgirl_15", "body": "MusicArt is cheap but the shipping is $50 usd!", "created_utc": "1666049990.0", "edited": "False", "id": "isqlrm2", "is_submitter": "False", "link_id": "t3_xzm1eu", "parent_id": "t3_xzm1eu", "score": "1", "subreddit": "skzcollection", "subreddit_id": "t5_524piq"}, {"author": "madgirl_15", "body": "I have a question about trading. I don’t see any posts about that in this entire sub-Reddit and I just got the new Maxident album (Go version) and I wanna trade. Is the trading just not active this comeback or does it usually happen elsewhere? I’m kinda new. My first post.", "created_utc": "1666049923.0", "edited": "False", "id": "isqlmof", "is_submitter": "False", "link_id": "t3_y268lp", "parent_id": "t3_y268lp", "score": "1", "subreddit": "skzcollection", "subreddit_id": "t5_524piq"}, {"author": "madgirl_15", "body": "If only you were in the US… 😭", "created_utc": "1666049780.0", "edited": "False", "id": "isqlc3o", "is_submitter": "False", "link_id": "t3_y2773b", "parent_id": "t3_y2773b", "score": "1", "subreddit": "skzcollection", "subreddit_id": "t5_524piq"}, {"author": "madgirl_15", "body": "Help… I can’t watch the video. Han’s tummy is in the way. 🥺", "created_utc": "1665426889.0", "edited": "False", "id": "irsjply", "is_submitter": "False", "link_id": "t3_xyqovt", "parent_id": "t3_xyqovt", "score": "3", "subreddit": "straykids", "subreddit_id": "t5_3ozlw"}, {"author": "madgirl_15", "body": "I agree with what you said. I just wanna expand on I.N, Seungmin and Hyunjin… give a bit of my take:\n\nI.N has been told in the past 4 years that he’s cute… of course he knows and so now he owns it and just shares lots of pics. \n\nI think though Hyunjin on stage and Hyunjin on interviews are two personas. He’s so much more extroverted and flirty when he dances or when you see clips of him in concerts. \n\nSeungmin is so reserved and humble, he won’t ever admit to being hot. Btw, being savage is not the same as reserved. He is both.", "created_utc": "1665423941.0", "edited": "False", "id": "irsccu5", "is_submitter": "False", "link_id": "t3_y0guhb", "parent_id": "t3_y0guhb", "score": "57", "subreddit": "straykids", "subreddit_id": "t5_3ozlw"}, {"author": "madgirl_15", "body": "Poor Hyunjin. He just wants to dance and perform, not do TikTok.", "created_utc": "1665029786.0", "edited": "False", "id": "ir8qmks", "is_submitter": "False", "link_id": "t3_xwdljo", "parent_id": "t3_xwdljo", "score": "2", "subreddit": "straykids", "subreddit_id": "t5_3ozlw"}, {"author": "madgirl_15", "body": "I have a feeling he doesn’t want to learn English or just not interested. It doesn’t take years to become conversational. The others have improved so much, especially with Changbin you can see the difference.", "created_utc": "1664886025.0", "edited": "False", "id": "ir09q34", "is_submitter": "False", "link_id": "t3_xuoc3z", "parent_id": "t1_iqxum2x", "score": "6", "subreddit": "straykids", "subreddit_id": "t5_3ozlw"}, {"author": "madgirl_15", "body": "The Puppy interview?", "created_utc": "1664885779.0", "edited": "False", "id": "ir09a1l", "is_submitter": "False", "link_id": "t3_xuoc3z", "parent_id": "t1_iqwy848", "score": "1", "subreddit": "straykids", "subreddit_id": "t5_3ozlw"}, {"author": "madgirl_15", "body": "Korean - tons of Korean dramas (usually 16 episodes), K-pop music, millions of YouTube content, webtoons, there’s also a decent amount of high-quality movies (Parasite being a famous one), etc. I’ve started learning it without having to pay for anything due to the sheer amount of free content out there. \n\nI got into learning Korean because of a group called Stray Kids but throughout the years I’ve caught lots of random vocabulary from Korean dramas and films. They’re on Netflix and Hulu. You can find a few web dramas on YouTube. There’s Viki. There’s tons of free educational content. Duolingo, Drops, and plenty of apps that gamify learning. \n\nChinese (Mandarin) would also be a close second for me but the writing system is just insane to me. \n\nI learned Italian in college but I’m not sure if there’s as many films and shows freely or easily available. I could be wrong. Looking for recommendations.", "created_utc": "1664733634.0", "edited": "1664745066.0", "id": "iqs1eld", "is_submitter": "False", "link_id": "t3_xtu4eo", "parent_id": "t3_xtu4eo", "score": "23", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "madgirl_15", "body": "Maybe he doesn’t look like he’s being forced because he’s with his singer… Seungmin! 💕", "created_utc": "1664728627.0", "edited": "False", "id": "iqro0my", "is_submitter": "False", "link_id": "t3_xs800d", "parent_id": "t3_xs800d", "score": "4", "subreddit": "straykids", "subreddit_id": "t5_3ozlw"}, {"author": "madgirl_15", "body": "Lovely art work. You captured Berry. 💕", "created_utc": "1664728465.0", "edited": "False", "id": "iqrnl2y", "is_submitter": "False", "link_id": "t3_xts8a4", "parent_id": "t3_xts8a4", "score": "2", "subreddit": "straykids", "subreddit_id": "t5_3ozlw"}, {"author": "madgirl_15", "body": "This is beautiful. If you sold stickers with your art, I’d buy it. So many details. 💕", "created_utc": "1664728299.0", "edited": "False", "id": "iqrn5xd", "is_submitter": "False", "link_id": "t3_xtqdi7", "parent_id": "t3_xtqdi7", "score": "3", "subreddit": "straykids", "subreddit_id": "t5_3ozlw"}, {"author": "madgirl_15", "body": "Well glad you found it", "created_utc": "1664593436.0", "edited": "False", "id": "iqkz1hj", "is_submitter": "False", "link_id": "t3_xmqidq", "parent_id": "t1_iqky8d9", "score": "1", "subreddit": "disguisedtoast", "subreddit_id": "t5_5dguht"}, {"author": "madgirl_15", "body": "Can you give more details?", "created_utc": "1664582893.0", "edited": "False", "id": "iqkenp1", "is_submitter": "False", "link_id": "t3_xmqidq", "parent_id": "t3_xmqidq", "score": "1", "subreddit": "disguisedtoast", "subreddit_id": "t5_5dguht"}, {"author": "madgirl_15", "body": "Thanks for posting. OP’s link isn’t working though.", "created_utc": "1662801806.0", "edited": "False", "id": "inu4a3i", "is_submitter": "False", "link_id": "t3_xakbzx", "parent_id": "t1_inu21iz", "score": "28", "subreddit": "straykids", "subreddit_id": "t5_3ozlw"}, {"author": "madgirl_15", "body": "Hehe! I actually don’t watch a lot of reaction stuff but my friend got me to watch a few people reacting to Stray Kids, like a singer called Katrina or something, and she’s shared other videos with me like editors reacting to their music videos. She was the one who introduced me to them about a month ago and she’s watched lots of those. If you share the link to the video, I’ll watch it too. I’ll watch almost anything related to Stray Kids. Been doing so for the last two months and loving it. Also downloaded V live and Bubble recently. I’m truly into them.", "created_utc": "1659531271.0", "edited": "False", "id": "iiry4s0", "is_submitter": "False", "link_id": "t3_wdvy4e", "parent_id": "t1_iiqivph", "score": "2", "subreddit": "straykids", "subreddit_id": "t5_3ozlw"}, {"author": "madgirl_15", "body": "Oh it’s absolutely bomb. The vibe is on point with their style. I’m sad it’s not longer but I’m glad to see some visuals at least. I’ve listened to it a couple of times just now and I think the song is about they’re in a hurry to produce, to rap, to sing, and hustle. Yet by the end, they realize that they need to go slow and steady. It’s more fun that way anyway and they’ll win. Like in the fable.", "created_utc": "1659496903.0", "edited": "False", "id": "iiqigi5", "is_submitter": "False", "link_id": "t3_wdvy4e", "parent_id": "t1_iiqcvut", "score": "2", "subreddit": "straykids", "subreddit_id": "t5_3ozlw"}, {"author": "madgirl_15", "body": " Side Effects - amazing showcase of voices, intense chorus, relatable lyrics. it’s about something not being right or well-balanced in your mind given the circumstances. \n\nThe Tortoise and the hare - sick experimental song. the raps are perfection. smart juxtaposition of slow and fast beats. \n\nCHEESE - best diss song. confidence. who the f cares about what others say. we do what we do. everything else is cheese. \n\nEasy - bad boy vibes. confidence, again. it makes my body vibe.", "created_utc": "1659496153.0", "edited": "False", "id": "iiqgxr2", "is_submitter": "False", "link_id": "t3_wdvy4e", "parent_id": "t3_wdvy4e", "score": "2", "subreddit": "straykids", "subreddit_id": "t5_3ozlw"}, {"author": "madgirl_15", "body": "Can you link the video? I don’t think I’ve seen it. It’s also one of my favorites. I like how experimental it is. I hope they continue on like this.", "created_utc": "1659493946.0", "edited": "False", "id": "iiqc8rd", "is_submitter": "False", "link_id": "t3_wdvy4e", "parent_id": "t1_iilfxrh", "score": "1", "subreddit": "straykids", "subreddit_id": "t5_3ozlw"}, {"author": "madgirl_15", "body": "I started listening late June 2022 and by now (July 23rd 2022) I’ve become a STAY. \n\nA friend came over to my house and wanted to share some K-pop songs with me. She had been listening to a lot of K-pop recently and wanted me to watch some songs from Monsta X, BTS, and others. I had only heard a few BTS songs and a couple of EXO songs I bumped into on YouTube and added to my Spotify. I’m not really into K-pop and I don’t really watch music videos. I do have a few Korean songs from K-dramas, since I do watch those a lot. \n\nThe first music video of Stray Kids she played for me was God’s Menu and she kept showing me different videos from them, like Maniac, Venom, Circus, and Thunderous. I was definitely intrigued. \n\nBy now, I’ve listened to their entire discography, although I do this with most of my favorite artists. What I don’t do is see their videos on their YouTube channel, along with all their music videos, many concert performances, and dance practices. Even cried a little during [one video interview](https://youtu.be/NxryzznrhEw), which is very rare for me. I also think liking the same group as my best friends helps us share a bond via the stories, music, and videos we share. \n\nIn general, I’m drawn to them because they’re so unique. I’m not sure if this is something common in K-pop but I see their genuine artistry via their songs and dances. They seem honest and real in interviews, even when they’re silly. Their lyrics are relatable and their beats are so innovative. They’re so confident on stage and very talented in dancing, rapping, singing, and composing. I haven’t carefully read the lyrics in English to some of their songs, but I still love most of their entire discography. \n\nBias: Seungmin & Hyunjin \n\n(The former because of his voice, his reserved nature, and physical attractiveness; he was the first I noticed when watching the videos & the latter because of his aura when dancing and performing; very magnetic, striking, and out of the ordinary. Although, I admire all of them and love several things about each of them.) \n\nFavorite songs: Easy, CHEESE, The Tortoise and The Hare", "created_utc": "1658604621.0", "edited": "False", "id": "ihcwmdc", "is_submitter": "False", "link_id": "t3_w2uq3v", "parent_id": "t3_w2uq3v", "score": "1", "subreddit": "straykids", "subreddit_id": "t5_3ozlw"}, {"author": "madgirl_15", "body": "This is great. Giving me ideas for a Bujo theme too!", "created_utc": "1658600120.0", "edited": "False", "id": "ihcmd4p", "is_submitter": "False", "link_id": "t3_w407l8", "parent_id": "t3_w407l8", "score": "1", "subreddit": "straykids", "subreddit_id": "t5_3ozlw"}, {"author": "madgirl_15", "body": "Fun fact: Sykkuno recently referenced this in one of his streams when playing Codenames.", "created_utc": "1657614999.0", "edited": "False", "id": "ifu11ln", "is_submitter": "False", "link_id": "t3_vjpauw", "parent_id": "t3_vjpauw", "score": "1", "subreddit": "disguisedtoast", "subreddit_id": "t5_5dguht"}, {"author": "madgirl_15", "body": "That was so cute.", "created_utc": "1657614923.0", "edited": "False", "id": "ifu0yf9", "is_submitter": "False", "link_id": "t3_vnn7ed", "parent_id": "t3_vnn7ed", "score": "1", "subreddit": "disguisedtoast", "subreddit_id": "t5_5dguht"}, {"author": "madgirl_15", "body": "Thanks. I guess the translation is kinda funky but I absolutely found it snarky as if she was commenting on my memory issues rather than my dental condition. I know I don’t remember stuff a lot. I’m a teacher. I literally write everything down, I have dozens of worksheets for tracking stuff in the classroom. I keep records of all my appointments and daily life (from events, habits, memories, etc) in a bullet journal. I remember my appointments by writing them down and logging them on my phone’s calendar. If I knew I had to explain to her my entire dental health history, I would’ve taken notes but when I’m in a dentist chair I didn’t really have time to write stuff down and I guess I assumed the dentist just wanted some sort of analysis about my teeth from the ortho. Given this situation, I’m gonna start writing logs after my appointments. I guess I was sensitive and shouldn’t have called her an asshole via her secretary but I don’t even know how I could’ve acted differently when I was just crying about this. I may need to evaluate psychologically why I reacted this way and find more assertive ways to respond in the future. But thanks for your perspective.", "created_utc": "1657613444.0", "edited": "False", "id": "iftz8nb", "is_submitter": "False", "link_id": "t3_vx35iq", "parent_id": "t1_ifttbfb", "score": "0", "subreddit": "AmItheAsshole", "subreddit_id": "t5_2xhvq"}, {"author": "madgirl_15", "body": "I don’t think it’s very odd. I asked my friend who is a nurse and she said it is very common for patients to not understand a lot of things doctors say since not all are the greatest communicators. I gave her all the details I knew about my teeth but I don’t want to invest money in something that is not covered by insurance and my teeth are not that aesthetically ugly at all. I don’t see how I pay hundreds every month for my health and would have to pay more hundreds because many healthcare companies don’t cover orthodontics.\n\nAbout the note, I think it was unnecessary for her to comment on my memory and it bothered me. It made me cry and upset me. Should I have done nothing then? Or waited for another hour for her to have time to talk again? \n\nI left a negative review on her page and if she wants to address it, she will, if not then it will stay there. \n\nAgain, if the dentist had written the info about my teeth, this wouldn’t even be an issue. If I was supposed to know which exact tooth had a cavity and give this info to the orthodontist, then I would’ve written it down.", "created_utc": "1657612725.0", "edited": "False", "id": "iftyeau", "is_submitter": "False", "link_id": "t3_vx35iq", "parent_id": "t1_iftve0s", "score": "0", "subreddit": "AmItheAsshole", "subreddit_id": "t5_2xhvq"}, {"author": "madgirl_15", "body": "Well I’ve already left her a bad review on her website. I guess I am a black Karen. Oh well. \n\nWhat if it was the dentist that didn’t explain things to me?", "created_utc": "1657607370.0", "edited": "False", "id": "iftrps6", "is_submitter": "False", "link_id": "t3_vx35iq", "parent_id": "t1_iftqsdd", "score": "-2", "subreddit": "AmItheAsshole", "subreddit_id": "t5_2xhvq"}, {"author": "madgirl_15", "body": "Well that’s not nice of you either. I guess I don’t care for her opinion on my memory since she’s not a neurologist or psychiatrist/psychologist.", "created_utc": "1657607287.0", "edited": "False", "id": "iftrlwk", "is_submitter": "False", "link_id": "t3_vx35iq", "parent_id": "t1_iftqxnd", "score": "-2", "subreddit": "AmItheAsshole", "subreddit_id": "t5_2xhvq"}, {"author": "madgirl_15", "body": "Does my dentist really need to know that I wasn’t remembering things? Isn’t the issue here that perhaps he himself didn’t tell me or clearly wrote something in the referral. I told the orthodontist many things because I wasn’t sure why I was referred since the referral didn’t contain any info. How is pointing out that I have trouble remembering things helping in the evaluation of whether or not I need braces? Is she a neurologist or psychologist to comment on my memory issues? \n\nI can go to another ortho, but I don’t want braces since given this first visit I don’t see the benefit of spending thousands of dollars on straightening my teeth when there’s other options that insurance can cover like root canals, crowns and other restorative measures. \n\nAll I told the secretary was that her boss was an asshole. You think that action is disrespectful but not the ortho’s note?", "created_utc": "1657607165.0", "edited": "False", "id": "iftrfy4", "is_submitter": "False", "link_id": "t3_vx35iq", "parent_id": "t1_iftp294", "score": "0", "subreddit": "AmItheAsshole", "subreddit_id": "t5_2xhvq"}, {"author": "madgirl_15", "body": "True but I don’t think this makes her an asshole. Did she also show up late or cancel on you? Or was she a no-show and didn’t even excuse herself? It could be much worse. I think you need to communicate with her and at least listen to what she has to say. If she’s just not the type of person to give thoughtful gifts, then don’t reciprocate on her birthday with an expensive gift.", "created_utc": "1657604238.0", "edited": "False", "id": "iftnbgb", "is_submitter": "False", "link_id": "t3_vx34e3", "parent_id": "t1_iftm9vx", "score": "1", "subreddit": "AmItheAsshole", "subreddit_id": "t5_2xhvq"}, {"author": "madgirl_15", "body": "Facts.", "created_utc": "1657603485.0", "edited": "False", "id": "iftm6uf", "is_submitter": "False", "link_id": "t3_vx34e3", "parent_id": "t1_iftm10q", "score": "1", "subreddit": "AmItheAsshole", "subreddit_id": "t5_2xhvq"}, {"author": "madgirl_15", "body": "NAH: at first I was thinking maybe you should just be grateful for whatever you got, since it’s the thought that counts but I guess I understand where you’re coming from. I think though that you shouldn’t expect much from people in general. Just because you give $700 gifts, you can’t expect others to do the same. Why not make your birthday about sharing and having a good time instead of gifts? Again, I understand your perspective and I don’t think you or anyone here is an asshole. You just have unrealistic expectations.", "created_utc": "1657603374.0", "edited": "False", "id": "iftm0v1", "is_submitter": "False", "link_id": "t3_vx34e3", "parent_id": "t3_vx34e3", "score": "1", "subreddit": "AmItheAsshole", "subreddit_id": "t5_2xhvq"}, {"author": "madgirl_15", "body": "What are the last two pink pens in the second photo? I'm kinda new to FPs.", "created_utc": "1656749415.0", "edited": "False", "id": "iejzhko", "is_submitter": "False", "link_id": "t3_voybr0", "parent_id": "t3_voybr0", "score": "2", "subreddit": "fountainpens", "subreddit_id": "t5_2s0ew"}, {"author": "madgirl_15", "body": "How old is this pen? Did you ever change the nib? Perhaps overtighten it? I think like everyone else is saying, just contact TWSBI and show them this video.", "created_utc": "1656747390.0", "edited": "False", "id": "iejx0uq", "is_submitter": "False", "link_id": "t3_vp5xo6", "parent_id": "t3_vp5xo6", "score": "2", "subreddit": "fountainpens", "subreddit_id": "t5_2s0ew"}, {"author": "madgirl_15", "body": "What nib size did you get?   \n\n\nThe only scratchy pen I've ever had was an extra fine in a Pilot Penmanship. It's like 0.3mm so it's really tiny. In my short experience, the smaller the nib the bigger the scratchiness. Or maybe it's just the brand? I've never owned a Kaweco but I'm thinking of getting a Perkeo.", "created_utc": "1656746226.0", "edited": "False", "id": "iejvlmu", "is_submitter": "False", "link_id": "t3_vpkn3j", "parent_id": "t1_iejocet", "score": "1", "subreddit": "fountainpens", "subreddit_id": "t5_2s0ew"}, {"author": "madgirl_15", "body": "Thanks for including the names. Nice collection.", "created_utc": "1653450413.0", "edited": "False", "id": "i9w7b3k", "is_submitter": "False", "link_id": "t3_ux4o8b", "parent_id": "t1_i9vh8zf", "score": "2", "subreddit": "fountainpens", "subreddit_id": "t5_2s0ew"}, {"author": "madgirl_15", "body": "Yes! I just saw the episode and I noticed that pen. I’m only a fountain pen newbie but I recognized it and googled this thing to confirm it. Thanks fountain pen Reddit! You guys rock!", "created_utc": "1650593503.0", "edited": "False", "id": "i5p5cie", "is_submitter": "False", "link_id": "t3_u7rlu3", "parent_id": "t3_u7rlu3", "score": "2", "subreddit": "fountainpens", "subreddit_id": "t5_2s0ew"}, {"author": "madgirl_15", "body": "Yes! It was!", "created_utc": "1650592871.0", "edited": "False", "id": "i5p3y2g", "is_submitter": "False", "link_id": "t3_u7y05g", "parent_id": "t3_u7y05g", "score": "1", "subreddit": "fountainpens", "subreddit_id": "t5_2s0ew"}, {"author": "madgirl_15", "body": "I understand. Good luck then!", "created_utc": "1648307957.0", "edited": "False", "id": "i278lcj", "is_submitter": "False", "link_id": "t3_tof20m", "parent_id": "t1_i2764sz", "score": "1", "subreddit": "penpals", "subreddit_id": "t5_2r076"}, {"author": "madgirl_15", "body": "Why aren’t you interested in Snail Mail? I’d like to write to you but I don’t want to spend more time on my phone but off of it.", "created_utc": "1648306620.0", "edited": "False", "id": "i275lg2", "is_submitter": "False", "link_id": "t3_tof20m", "parent_id": "t3_tof20m", "score": "1", "subreddit": "penpals", "subreddit_id": "t5_2r076"}, {"author": "madgirl_15", "body": "As others mentioned: Rent a car, don’t rely on Uber unless you’re staying only in the metro area.   Even if I was going to stay in the metro area, I would rent a car since it’s just the best way to get around anywhere in PR. \n\nUber does not work outside the metro area in PR and if a driver does agree to take you to Arecibo and Ceiba, I’m no sure how you would get back. You could try hitchhiking if you’re feeling adventurous.\n\nI would also say that your schedule seems pretty packed. There’s lots to do and see just in San Juan and I feel you’re going to be spending a lot of time on the road just getting to the places rather than spending time in the attractions. \n\nEl Yunque is a huge rainforest and should take you a whole day or at the very least 4 hours to explore (unless you only plan to spend like 1 hr there and not hike up any of the trails). I also suggest you get the ferry tickets to Vieques in advance or get to the ferry terminal in Ceiba early, since their schedule changes often due to breakdowns, holidays, weather, etc. \n\nEither way, I do hope you enjoy the island and have a great time!", "created_utc": "1574602448.0", "edited": "1574602686.0", "id": "f8jnorh", "is_submitter": "False", "link_id": "t3_dzlmo0", "parent_id": "t3_dzlmo0", "score": "2", "subreddit": "PuertoRicoTravel", "subreddit_id": "t5_2wql0"}, {"author": "madgirl_15", "body": "I joined because I wanted to be this. 😭", "created_utc": "1566598753.0", "edited": "False", "id": "exvfhvh", "is_submitter": "False", "link_id": "t3_cuhpyx", "parent_id": "t3_cuhpyx", "score": "1", "subreddit": "YoTroublemakers", "subreddit_id": "t5_147fep"}, {"author": "madgirl_15", "body": "GG time hack? What?", "created_utc": "1473297766.0", "edited": "False", "id": "d7dm9zg", "is_submitter": "True", "link_id": "t3_51ao65", "parent_id": "t1_d7bfmp7", "score": "1", "subreddit": "TWDRoadToSurvival", "subreddit_id": "t5_39qiz"}, {"author": "madgirl_15", "body": "Isn't it always on weekends though? Individual raids tend to be whenever but I thought faction ones were just during the weekends.", "created_utc": "1473102709.0", "edited": "False", "id": "d7akdjk", "is_submitter": "True", "link_id": "t3_51ao65", "parent_id": "t3_51ao65", "score": "1", "subreddit": "TWDRoadToSurvival", "subreddit_id": "t5_39qiz"}, {"author": "madgirl_15", "body": "OTK? Power creep? What? Could you please explain these terminologies?\n\nYeah it is strong, but any type of team can be beaten. I think that's good. ", "created_utc": "1471745908.0", "edited": "1471746113.0", "id": "d6q4hm1", "is_submitter": "False", "link_id": "t3_4x9qaj", "parent_id": "t1_d6jt10d", "score": "1", "subreddit": "TWDRoadToSurvival", "subreddit_id": "t5_39qiz"}, {"author": "madgirl_15", "body": "How is this broken? How could it be better? Why is her rush not good?", "created_utc": "1471324787.0", "edited": "False", "id": "d6jcicv", "is_submitter": "False", "link_id": "t3_4x9qaj", "parent_id": "t1_d6g5hju", "score": "1", "subreddit": "TWDRoadToSurvival", "subreddit_id": "t5_39qiz"}, {"author": "madgirl_15", "body": "@Newattack, tell us your region. The region I'm in has like 5 factions with sister factions.", "created_utc": "1471323808.0", "edited": "False", "id": "d6jc1xv", "is_submitter": "False", "link_id": "t3_4xsehs", "parent_id": "t1_d6j471m", "score": "1", "subreddit": "TWDRoadToSurvival", "subreddit_id": "t5_39qiz"}, {"author": "madgirl_15", "body": "I am glad you outed them. Same thing happens in our region. ", "created_utc": "1471322524.0", "edited": "False", "id": "d6jbfcr", "is_submitter": "False", "link_id": "t3_4xor55", "parent_id": "t3_4xor55", "score": "1", "subreddit": "TWDRoadToSurvival", "subreddit_id": "t5_39qiz"}, {"author": "madgirl_15", "body": "No. ", "created_utc": "1471322430.0", "edited": "False", "id": "d6jbdm1", "is_submitter": "False", "link_id": "t3_4xor55", "parent_id": "t1_d6hsdiw", "score": "1", "subreddit": "TWDRoadToSurvival", "subreddit_id": "t5_39qiz"}, {"author": "madgirl_15", "body": "Take advantage of Michonne's shield when you're up against red and blue teams. I'm lucky to have shield Lee and I used him and Michonne to beat this level. The rest of my team was 5 star green Michonne (leader), 3 star green Michonne, 4 star yellow Siddiq, and 3 star red Rick. \n\nI would use tear and nerve gas vials. If you have people in your team that can give you defense buffs, then try to use hollow points or grindstone to improve your attack. If you have people in your team that can give you attack buffs, use boosters. I equipped an elegant incense but I didn't need it; if you don't have that I suggest smelling salts. \n\nIf you have players that give you area attacks (attacks that target multiple players), try to use the rushes only when you use an attack buff or hollow points/grindstone. That way your area attacks are stronger and can potentially wipe out all 4 or 5 human enemies. \n\nGood luck and hope this helps!", "created_utc": "1470875258.0", "edited": "False", "id": "d6claag", "is_submitter": "False", "link_id": "t3_4x06s5", "parent_id": "t3_4x06s5", "score": "1", "subreddit": "TWDRoadToSurvival", "subreddit_id": "t5_39qiz"}, {"author": "madgirl_15", "body": "Thanks for the responses everyone! I guess it's not a thing yet nor is it gonna be anytime soon. Poop.", "created_utc": "1470872785.0", "edited": "False", "id": "d6cjm3k", "is_submitter": "True", "link_id": "t3_4x1syi", "parent_id": "t3_4x1syi", "score": "1", "subreddit": "TWDRoadToSurvival", "subreddit_id": "t5_39qiz"}, {"author": "madgirl_15", "body": "Word.", "created_utc": "1470872702.0", "edited": "False", "id": "d6cjk09", "is_submitter": "True", "link_id": "t3_4x1syi", "parent_id": "t1_d6brxfg", "score": "1", "subreddit": "TWDRoadToSurvival", "subreddit_id": "t5_39qiz"}, {"author": "madgirl_15", "body": "With all those 5 stars I'm amazed you get killed by zombies. You must have other good characters for zombies. Occasionally I've had a character take damage with my A or A+ zombie team on fast mode but it's been a while since I actually was defeated.", "created_utc": "1470381305.0", "edited": "False", "id": "d652wlf", "is_submitter": "False", "link_id": "t3_4v4pcc", "parent_id": "t1_d5xrkz7", "score": "1", "subreddit": "TWDRoadToSurvival", "subreddit_id": "t5_39qiz"}, {"author": "madgirl_15", "body": "You added Basil? Why? He has no adrenaline rush. Is that working well for you now then? Are all your characters 5 stars, is that why you got rid of Amy?\n\nI mean I have several teams aside from the scavenger mission ones. I have two zombie teams (melee and ranged), a stronghold/defense team, my regular raid team, and a special events team that is a composite of all those teams.", "created_utc": "1469859451.0", "edited": "False", "id": "d5wwxkh", "is_submitter": "False", "link_id": "t3_4v4pcc", "parent_id": "t1_d5wjd0u", "score": "1", "subreddit": "TWDRoadToSurvival", "subreddit_id": "t5_39qiz"}, {"author": "madgirl_15", "body": "I think it depends on the stage you're going for. If you are talking about farming world map and the stage has barricades, having an all Melee team (or even just 1 ranged and the rest melee) is not going to be great for killing zombies. For instance, I'd use that melee team for 7.1 but probably not for 13.3 that has obstacles. \n\nI would suggest keeping Annie as leader for her medium drop bonus (which is great) and Green Michonne too for the camo, but the rest should be ranged (or melees) with an AR that is good for zombies (I'd say drop Lester and/or Wilkins). \n\nFor instance, use Annie as leader, Michonne (green camo), 4* Rick, and two other characters with rushes that are good against zombies (critical bonus, headshot, stun, or even area attacks with like 300% damage are good for zombies). I don't know your rooster, so I can't make suggestions about how to replace Lester or Wilkins. But what I'm sensing is that the regular rushes that your melee characters have are good against humans but are limiting your zombie team. I'd really add in characters that have headshots as a rush.\n\nFor instance, my regular zombie team is much weaker, with Amy (4 star alert with small drop bonus and headshot rush), Timothy (3 star with headshot rush), Sandy (3 star with 220% damage to 3 enemies rush), Carl (4 star tough with stun rush) and the new 3 star alert Michonne with a rush that gives +35 crit and camo to 3 teammates (and she is only on tier 2). I put it on auto on 13.3, 12.1 or any other world map stage and don't die; don't even get a scratch. They all have their critical weapons with appropriate bonuses but I think those two headshot rushes really do help and I do have that green Michonne with camo but I opted to drop her in favor of that new alert Michonne. I sometimes saw green Michonne doing nothing other than being blocked by obstacles and the camo wasn't really helping that much since it was activating randomly and not when the team most needed it. \n\nAnyway, my point is that it perhaps depends on the stage you're going for and the difficulty (obstacles and such are bad for a mostly melee team) and the rushes of the characters you are using are limiting you. \n", "created_utc": "1469810511.0", "edited": "False", "id": "d5w2qv2", "is_submitter": "False", "link_id": "t3_4v4pcc", "parent_id": "t3_4v4pcc", "score": "1", "subreddit": "TWDRoadToSurvival", "subreddit_id": "t5_39qiz"}, {"author": "madgirl_15", "body": "Thanks for the advice! I'm waiting on another level-up tournament to level most of these characters. I did pretty good last time when I leveled Michonne, so that's what I'm hoping to do with Lee.\n\nMy only grip with using both Glenn and Siddiq is that their rushes are just healing and weak at that (20% I think). So I'm not crazy about using both Glenn and Siddiq at the same time but thanks for the suggestion. ", "created_utc": "1469806190.0", "edited": "False", "id": "d5vzd5m", "is_submitter": "True", "link_id": "t3_4uz8e9", "parent_id": "t1_d5uunhd", "score": "1", "subreddit": "TWDRoadToSurvival", "subreddit_id": "t5_39qiz"}, {"author": "madgirl_15", "body": "Thanks, man! I appreciate the advice!", "created_utc": "1469805989.0", "edited": "False", "id": "d5vz7hn", "is_submitter": "True", "link_id": "t3_4uz8e9", "parent_id": "t1_d5u6hx9", "score": "2", "subreddit": "TWDRoadToSurvival", "subreddit_id": "t5_39qiz"}, {"author": "madgirl_15", "body": "First, with a mostly 3-star team back a few weeks ago, Mitchell Jr is still one of my best for raiding and I want a Chuck to replace him since he is the most comparable to him. Don't hate on Mitchell. \n\nThat being said, I'm slowly transitioning into S1 but I do like this line-up you suggested. I'd probably like to use Bo in there too so that I can take advantage of Michonne's leader skill so maybe replace him with Mark and I'll test out to see how each team works best. Thanks for the advice.", "created_utc": "1469805945.0", "edited": "False", "id": "d5vz6a6", "is_submitter": "True", "link_id": "t3_4uz8e9", "parent_id": "t1_d5uk7o1", "score": "1", "subreddit": "TWDRoadToSurvival", "subreddit_id": "t5_39qiz"}, {"author": "madgirl_15", "body": "I understand that but don't all teams have a weakness? I always hunt for teams with all fast and have actually beaten teams quite higher than my grade because they're all fast. Plus, lots of people tend to have Glenn, Siddiq and/or Denise. \n\nDo you have more specific advice on what you think would improve my team?", "created_utc": "1469690562.0", "edited": "False", "id": "d5u5vik", "is_submitter": "True", "link_id": "t3_4uz8e9", "parent_id": "t1_d5u5jkc", "score": "1", "subreddit": "TWDRoadToSurvival", "subreddit_id": "t5_39qiz"}, {"author": "madgirl_15", "body": "That's a no go on the Governor thing. Maybe in like 2 or 3 months or however much time it takes to get 25k prestige points. That prestige thing is such bullcrap.\n\nI haven't used Glenn as leader because his rush is so-so and he is at a lower level than my Siddiq. I also tend to kill him first and pretty easily when I'm raiding. But I will test out that team idea with Bo (when I have him maxed) instead of the Governor (which I think might happen first than getting to level 8 prestige). Thanks for the suggestion!", "created_utc": "1469687825.0", "edited": "False", "id": "d5u4w5x", "is_submitter": "True", "link_id": "t3_4uz8e9", "parent_id": "t1_d5u4l01", "score": "1", "subreddit": "TWDRoadToSurvival", "subreddit_id": "t5_39qiz"}, {"author": "madgirl_15", "body": "Haha! In fact, my faction members have gotten multiple Chucks. I already feel the pain.", "created_utc": "1469687392.0", "edited": "False", "id": "d5u4q0j", "is_submitter": "True", "link_id": "t3_4uz8e9", "parent_id": "t1_d5u4mwm", "score": "1", "subreddit": "TWDRoadToSurvival", "subreddit_id": "t5_39qiz"}, {"author": "madgirl_15", "body": "I was hoping to get that Chuck (4 star strong) on the last level up tourney, but alas, I got Clementine (4 star fast). Your team sounds sweet with that Chuck, he's the only one that will get me to replace Mitchell Jr I think.\n\nI could keep Carl in there and perhaps after I've leveled up Bo and Mark, add those two to replace all the 3 stars (although Mark's rush is a bit slow) and have 3 strong and 2 toughs.\n\nThanks for sharing your team, sunshine.", "created_utc": "1469686591.0", "edited": "1469686776.0", "id": "d5u4e43", "is_submitter": "True", "link_id": "t3_4uz8e9", "parent_id": "t1_d5u4951", "score": "1", "subreddit": "TWDRoadToSurvival", "subreddit_id": "t5_39qiz"}, {"author": "madgirl_15", "body": "Here is an image with the rest of my characters:\n\nhttp://imgur.com/a/MrDQ9", "created_utc": "1469686299.0", "edited": "False", "id": "d5u49rx", "is_submitter": "True", "link_id": "t3_4uz8e9", "parent_id": "t3_4uz8e9", "score": "1", "subreddit": "TWDRoadToSurvival", "subreddit_id": "t5_39qiz"}, {"author": "madgirl_15", "body": "Damn! 6,000 US dollars? WOW! I will never get there. Why would the developers add a feature with a goal that is impossible to attain, particularly those who don't pay or only pay the 30-day pass?", "created_utc": "1469682747.0", "edited": "False", "id": "d5u2p2m", "is_submitter": "False", "link_id": "t3_4trmrw", "parent_id": "t1_d5obsrv", "score": "1", "subreddit": "TWDRoadToSurvival", "subreddit_id": "t5_39qiz"}, {"author": "madgirl_15", "body": "So how much did you spend and how long have you played to get to level 12?", "created_utc": "1469257546.0", "edited": "False", "id": "d5neo8y", "is_submitter": "False", "link_id": "t3_4trmrw", "parent_id": "t1_d5m06qn", "score": "1", "subreddit": "TWDRoadToSurvival", "subreddit_id": "t5_39qiz"}, {"author": "madgirl_15", "body": "He probably made a 40 pull... or several. I've been playing since May and did a 10 pull and it's impossible to have that many without $$$.", "created_utc": "1467869057.0", "edited": "False", "id": "d52gw93", "is_submitter": "False", "link_id": "t3_4rm48m", "parent_id": "t1_d52cuk5", "score": "1", "subreddit": "TWDRoadToSurvival", "subreddit_id": "t5_39qiz"}, {"author": "madgirl_15", "body": "Same here. I thought as an A+ I would also have a chance at getting another 5 star and improving my team but no go too. A shame they make it so hard.", "created_utc": "1467788807.0", "edited": "False", "id": "d513v4d", "is_submitter": "False", "link_id": "t3_4quyu2", "parent_id": "t1_d504y55", "score": "1", "subreddit": "TWDRoadToSurvival", "subreddit_id": "t5_39qiz"}, {"author": "madgirl_15", "body": "Did you pass the stage?", "created_utc": "1467715140.0", "edited": "False", "id": "d4zu39u", "is_submitter": "False", "link_id": "t3_4quyu2", "parent_id": "t3_4quyu2", "score": "1", "subreddit": "TWDRoadToSurvival", "subreddit_id": "t5_39qiz"}, {"author": "madgirl_15", "body": "Mmm, interesting idea. I'm just about to get Special training at level 11. Thanks!", "created_utc": "1465532486.0", "edited": "False", "id": "d439jzp", "is_submitter": "True", "link_id": "t3_4nb70x", "parent_id": "t1_d42yf38", "score": "1", "subreddit": "TWDRoadToSurvival", "subreddit_id": "t5_39qiz"}, {"author": "madgirl_15", "body": "I have upgraded them. Now I have a little bit more spare food but I wasn't able to get into top 250 in the level up event because of lack of food. I've never been maxed out. I'm at level 11 town hall.", "created_utc": "1465532220.0", "edited": "False", "id": "d439f6k", "is_submitter": "True", "link_id": "t3_4nb70x", "parent_id": "t1_d42mz4a", "score": "1", "subreddit": "TWDRoadToSurvival", "subreddit_id": "t5_39qiz"}, {"author": "madgirl_15", "body": "Gunpowder sells for 500 or so but, again, thanks for the advice. I will check up on that definitely.\n\nEdit: I think you meant refined gunpoweder. Saw it now.\n\nWhat is that used for anyway?", "created_utc": "1465490169.0", "edited": "False", "id": "d42gur2", "is_submitter": "True", "link_id": "t3_4nb70x", "parent_id": "t1_d42eo4n", "score": "1", "subreddit": "TWDRoadToSurvival", "subreddit_id": "t5_39qiz"}, {"author": "madgirl_15", "body": "Damn. Thanks for that advice. \n\nCan't sell those (compass and ammo belts) yet since I don't have many of those and I actually need them for upgrades. I've been trying to get ammo belts for over a week to upgrade my Michonne and I've only gotten one. Will try 13.6 and see how it goes.\n\nThanks again. Any more advice is welcome.", "created_utc": "1465485664.0", "edited": "False", "id": "d42ddba", "is_submitter": "True", "link_id": "t3_4nb70x", "parent_id": "t1_d42d3qh", "score": "1", "subreddit": "TWDRoadToSurvival", "subreddit_id": "t5_39qiz"}, {"author": "madgirl_15", "body": "A friend in my faction was also saying the same thing about defense teams being exactly the same as the camp. Same characters, same weapons. But he mentioned they could be cheating. This should be looked into. ", "created_utc": "1465162018.0", "edited": "False", "id": "d3x9m7p", "is_submitter": "False", "link_id": "t3_4mp4tx", "parent_id": "t3_4mp4tx", "score": "3", "subreddit": "TWDRoadToSurvival", "subreddit_id": "t5_39qiz"}, {"author": "madgirl_15", "body": "Like the other poster said, you haven't provided much information about your credit to really know what's going on. But I read here that having a 0% utilization is bad:\n\nhttp://money.stackexchange.com/questions/10288/is-0-credit-card-utilization-worse-than-1-20-credit-card-utilization-for-any-r\n\nDo you have any other credit cards, loans, or lines of credit opened? I've never had my credit score lowered unless I suddenly made a huge charge on my credit card and carried a really big balance on it.", "created_utc": "1436541498.0", "edited": "False", "id": "csyn3nv", "is_submitter": "False", "link_id": "t3_3csohy", "parent_id": "t3_3csohy", "score": "1", "subreddit": "personalfinance", "subreddit_id": "t5_2qstm"}, {"author": "madgirl_15", "body": "I think the idea of going to Europe is being considered by the OP because programs there are less expensive than the US. How have you guys dealt with tuition fees and other expenses when getting into this field?", "created_utc": "1432007001.0", "edited": "False", "id": "crdprt7", "is_submitter": "False", "link_id": "t3_36c1e2", "parent_id": "t1_crdixeu", "score": "1", "subreddit": "compling", "subreddit_id": "t5_2qs1s"}, {"author": "madgirl_15", "body": "I missed. What happened during this event? I saw the hall on Spumcraft but it's still under construction.", "created_utc": "1417940691.0", "edited": "False", "id": "cmnnv8r", "is_submitter": "False", "link_id": "t3_2o40vp", "parent_id": "t3_2o40vp", "score": "1", "subreddit": "spumwack", "subreddit_id": "t5_2z3b2"}]