[{"author": "Makqa", "body": "imao they first were speaking German, and then started to speaking russian after the slap", "created_utc": "1666868953.0", "edited": "False", "id": "itz39dp", "is_submitter": "False", "link_id": "t3_yel2a6", "parent_id": "t3_yel2a6", "score": "1", "subreddit": "therewasanattempt", "subreddit_id": "t5_39ne7"}, {"author": "Makqa", "body": "Of course this post wouldn't get as many upvotes as two hot chicks posing in military uniform", "created_utc": "1666769168.0", "edited": "False", "id": "ittufpj", "is_submitter": "False", "link_id": "t3_ydhleg", "parent_id": "t3_ydhleg", "score": "1", "subreddit": "ukraine", "subreddit_id": "t5_2qqcn"}, {"author": "Makqa", "body": "So you brought up your ex with him and also said how much he loved you and how you miss him? Ok. \n\nAnd you also said specifically he's your \"friend\", not bf, so what do you complain about? Worst case scenario he just told you a very dry humor joke and you didn't understand it. \n\nBut if he's your bf or a little more than just a \" friend\" he just roasted you.", "created_utc": "1666191878.0", "edited": "False", "id": "isy01h3", "is_submitter": "False", "link_id": "t3_y808xm", "parent_id": "t3_y808xm", "score": "1", "subreddit": "intj", "subreddit_id": "t5_2qowo"}, {"author": "Makqa", "body": "Ass", "created_utc": "1666095940.0", "edited": "False", "id": "issm9t2", "is_submitter": "False", "link_id": "t3_y70th6", "parent_id": "t3_y70th6", "score": "1", "subreddit": "Funnymemes", "subreddit_id": "t5_2xqtc"}, {"author": "Makqa", "body": "Here you go, mate: ငါ့မှာကွမ်းသီးအကြီးကြီးရှိတယ်", "created_utc": "1666029426.0", "edited": "False", "id": "isp83k5", "is_submitter": "False", "link_id": "t3_y68ud7", "parent_id": "t3_y68ud7", "score": "12", "subreddit": "languagelearningjerk", "subreddit_id": "t5_37rt5"}, {"author": "Makqa", "body": "Damn, AI got style", "created_utc": "1665952776.0", "edited": "False", "id": "isl99jt", "is_submitter": "False", "link_id": "t3_y5oiuc", "parent_id": "t3_y5oiuc", "score": "7", "subreddit": "elonmusk", "subreddit_id": "t5_2tr91"}, {"author": "Makqa", "body": "I feel like I'm naturally inclined to Taoism", "created_utc": "1665941299.0", "edited": "False", "id": "isker1p", "is_submitter": "False", "link_id": "t3_y5hiuj", "parent_id": "t3_y5hiuj", "score": "2", "subreddit": "intj", "subreddit_id": "t5_2qowo"}, {"author": "Makqa", "body": "Remind me why we can't just shoot those people on the spot", "created_utc": "1665773289.0", "edited": "False", "id": "isbmk3d", "is_submitter": "False", "link_id": "t3_y3qhx4", "parent_id": "t3_y3qhx4", "score": "0", "subreddit": "worldnews", "subreddit_id": "t5_2qh13"}, {"author": "Makqa", "body": "I mean some people believe in bible, some believe genders don't exist.", "created_utc": "1665506819.0", "edited": "False", "id": "irwqpt8", "is_submitter": "False", "link_id": "t3_y0quez", "parent_id": "t3_y0quez", "score": "1", "subreddit": "lgbt", "subreddit_id": "t5_2qhh7"}, {"author": "Makqa", "body": "If a random psychology test on the internet is 70-80% accurate, it's fairly good, I agree", "created_utc": "1665486447.0", "edited": "False", "id": "irvj4zt", "is_submitter": "False", "link_id": "t3_y0rghq", "parent_id": "t3_y0rghq", "score": "2", "subreddit": "mbti", "subreddit_id": "t5_2s90r"}, {"author": "Makqa", "body": " \nYou didn't do anything wrong, you aced reading and UoE, plus almost aced listening. You see, if you have such a high score in comprehension your potential is much higher to be able speak and write even greater than if your, say, speaking and writing were higher than comprehension. I know some people sometimes manage to max speaking but do poorly in reading, but, imao, the latter is worse because your ceiling is lower. \n\nYour active skills will always take longer to develop but eventually they will catch up. \n\nRegarding writing, though, if you really want to focus on this aspect, there are books that help you work on your writing competence. Writing usually involves more than just proficiency, you need to know how to lay out your text and DO EXACTLY WHAT YOU ARE ASKED TO DO in the task, which can be tricky.", "created_utc": "1665407733.0", "edited": "False", "id": "irr9ync", "is_submitter": "False", "link_id": "t3_y0beqs", "parent_id": "t1_irr4yj5", "score": "5", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Makqa", "body": "Writing tends to be a low-scorer. I personally got 180 in writing when I was taking CAE while getting 208 for reading with the average of 194, and 205 when I took CPE with 230 in use of English averaging 217.\n\nSo it's normal, most people neglect writing. \n\nBy the way, what's your speaking score?", "created_utc": "1665404040.0", "edited": "False", "id": "irr38lv", "is_submitter": "False", "link_id": "t3_y0beqs", "parent_id": "t3_y0beqs", "score": "7", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Makqa", "body": "Wow, we are fucked", "created_utc": "1665304711.0", "edited": "False", "id": "irm36al", "is_submitter": "False", "link_id": "t3_xz47mo", "parent_id": "t3_xz47mo", "score": "-4", "subreddit": "mbti", "subreddit_id": "t5_2s90r"}, {"author": "Makqa", "body": "Imo, the plot is actually very superficial and basic. You could predict what would happen through the whole game including the ending from the very beginning.\n\nGameplay gets repetitive as fuck, the game is unduly drawn out.", "created_utc": "1665068795.0", "edited": "1665069027.0", "id": "iraf3cl", "is_submitter": "False", "link_id": "t3_xwybfr", "parent_id": "t3_xwybfr", "score": "2", "subreddit": "playstation", "subreddit_id": "t5_2qh6b"}, {"author": "Makqa", "body": "Nothing", "created_utc": "1664976961.0", "edited": "False", "id": "ir5cjld", "is_submitter": "False", "link_id": "t3_xw7k2t", "parent_id": "t3_xw7k2t", "score": "1", "subreddit": "mbti", "subreddit_id": "t5_2s90r"}, {"author": "Makqa", "body": "C2?", "created_utc": "1664733055.0", "edited": "False", "id": "iqrzsbn", "is_submitter": "False", "link_id": "t3_xtdftl", "parent_id": "t3_xtdftl", "score": "2", "subreddit": "French", "subreddit_id": "t5_2rd5t"}, {"author": "Makqa", "body": "They should take you back then. \n\nYou literally just insult the whole nation, showing utter racism (oh, the irony), and are derogating me personally in the most scenic way possible. I don't care about that, but then you call my reaction idiotic because I called you a retard since you couldn't reasonably understand my points and immediately resorted to extrapolating off of your half - baked interpretation. \n\nAn absolutely baseless assumption after assumption... \n\nListen, tumor, if you really want to hide behind the social justice wall by implying that YOU ARE AUTOMATICALLY BETTER than all Russians combined because you write a few pathetic condolescent comments about ukrainians on reddit (since your insufficient brain can hardly commit to anything more substantial) and how they suffer, which they undoubtedly do. If you just think that writing a few lines of cliched text about sympathy and compassion in the most obvious situation imaginable gives you any credit, then I have bad news for you. You are no better than an average \"orc\" who supports Putin as your sole intention to speak about the current events is to give yourself a reason to be mean to people. \n\nYour words are cheap and they help no one. Neither Ukrainians nor the situation in general. So stop acting like you are doing anyone a service and thus deserve \" a place in the rest of the world\". Let alone the fact that you are sowing even more hatred by using a highly offensive language with respect to a group of people. \n\nThat's what the wokism does to your brain apparently. \n\nP.S. My initial comment was about the post itself and the premise of the idea expressed in the tweet. Of course it's ok for any country to set a policy that they like. But that doesn't mean no one could point out any inconsistencies  and lack of sound judgement in their reasoning. But apparently russians now can't express their opinion on anything without being assumed to be victimising themselves and being called orcs unless they explicitly come out and proclaim themselves to be below every other nation.", "created_utc": "1663957352.0", "edited": "False", "id": "ipmhtu3", "is_submitter": "False", "link_id": "t3_xlfrpj", "parent_id": "t1_ipm9e1x", "score": "-1", "subreddit": "RussiaUkraineWar2022", "subreddit_id": "t5_5wptpp"}, {"author": "Makqa", "body": "Maybe if you learnt the difference between \"affect\" and \"effect\" you could criticise me. \n\n\n\nBut the level of toxicity that's coming from you is beyond explanation.", "created_utc": "1663956765.0", "edited": "1663957853.0", "id": "ipmgh6t", "is_submitter": "False", "link_id": "t3_xlfrpj", "parent_id": "t1_ipmavnv", "score": "0", "subreddit": "RussiaUkraineWar2022", "subreddit_id": "t5_5wptpp"}, {"author": "Makqa", "body": " What a fucking retard, learn to read first, then maybe finish school. \n\nAnd of course such kind of language would only be used by a tolerant wokist", "created_utc": "1663951126.0", "edited": "False", "id": "ipm3lrc", "is_submitter": "False", "link_id": "t3_xlfrpj", "parent_id": "t1_ipm1n4w", "score": "-1", "subreddit": "RussiaUkraineWar2022", "subreddit_id": "t5_5wptpp"}, {"author": "Makqa", "body": "I partially mean it as a joke, but who knows what could come next", "created_utc": "1663913167.0", "edited": "False", "id": "ipkgeom", "is_submitter": "False", "link_id": "t3_xl9exm", "parent_id": "t1_ipkegd0", "score": "30", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Makqa", "body": "Big talk, clown 🤡\n\n\nHalf of your message was copied from your other comments and is almost irrelevant to what I argued, so consult the first line. \n\nI haven't been attacking anyone for a few decades and I don't threaten nukes.  If you put the identity of my country above my individual identity, it's up to you and I'm not going to argue, but then  consult the first line. \n\nAnd where did I show entitlement in my comment or were asking anyone for anything? I expressed my general opinion. If you interpret it the way you do because i'm Russian, so it automatically means i'm victimizing myself as it's so trendy to believe right now, then consult the first line... There is one simple answer to this whole let-over-border thing - introduce SELECTIVE admission. Yes, you could also be highly selective. I also wouldn't want any fucktard to come any time into my country for no reason and then support the thing they were running from. But there's no need for extremes... If you want to uphold a principle that is. \n\nOn a side note, I've looked through some of your other comments and posts and it's very clear you have a very scornful and prejudiced attitude towards Russian people in general, so consult the first line. \n\nBesides, not all ukraininas just stood and fought, many fled as well, both in 2014 as well as in the current war.", "created_utc": "1663912878.0", "edited": "1663935582.0", "id": "ipkg1lr", "is_submitter": "False", "link_id": "t3_xlfrpj", "parent_id": "t1_ipkdnev", "score": "-2", "subreddit": "RussiaUkraineWar2022", "subreddit_id": "t5_5wptpp"}, {"author": "Makqa", "body": "I'm 22 years old now. When putin came to power I was 0 years old. When putin had been in power for 13 years ( medvedev included), I was 13 years old. I was 15 years old when putin had already been for 15 years in power. When I was 18 years old I only acquired the right to vote ( let alone any tangible understanding of the political situation), while Putin had already been in power for 18 years... More than a year ago I was 20 years old. I didn't go to vote as a sign of protest. Where did I mess up my responsibility? \n\nNot hating, just saying. Why is it such a big problem to simply introduce selective admission? 50 year olds could be rejected. But young people could be admitted especially if they speak English or other European languages. Most of those who support putin couldn't string together a coherent sentence in their native language, let alone in English. Guess what.. this is how you could tell a putin pig from a decent individual. Just saying... \n\nAnd what if they are educated? Like... There are so many fucking different ways to check one's credibility. Instead you just throw woke populism around  screaming one extreme after another. Ffs...", "created_utc": "1663907123.0", "edited": "1663951278.0", "id": "ipk86vg", "is_submitter": "False", "link_id": "t3_xlfrpj", "parent_id": "t3_xlfrpj", "score": "5", "subreddit": "RussiaUkraineWar2022", "subreddit_id": "t5_5wptpp"}, {"author": "Makqa", "body": "I'll tell you how to do it when we meet there in person", "created_utc": "1663905590.0", "edited": "False", "id": "ipk5ugf", "is_submitter": "False", "link_id": "t3_xl9exm", "parent_id": "t3_xl9exm", "score": "238", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Makqa", "body": "Read books, study, pick up hobbies", "created_utc": "1663842217.0", "edited": "False", "id": "ipg87dh", "is_submitter": "False", "link_id": "t3_xkv0nj", "parent_id": "t3_xkv0nj", "score": "1", "subreddit": "intj", "subreddit_id": "t5_2qowo"}, {"author": "Makqa", "body": "For now only those are called up who have formerly served in the military and have military specialisation . Some regions could have martial law put in place", "created_utc": "1663741990.0", "edited": "False", "id": "ipasmlz", "is_submitter": "False", "link_id": "t3_xjwsqm", "parent_id": "t3_xjwsqm", "score": "1", "subreddit": "worldnews", "subreddit_id": "t5_2qh13"}, {"author": "Makqa", "body": "Pff, how didnt I think about that", "created_utc": "1663703886.0", "edited": "False", "id": "ip8kp19", "is_submitter": "False", "link_id": "t3_xjf4rk", "parent_id": "t1_ip8k1pq", "score": "6", "subreddit": "worldnews", "subreddit_id": "t5_2qh13"}, {"author": "Makqa", "body": "As a Russian studying at uni right now, If I got mobilised all of a sudden, the only option  for me would be taking to the streets... Along with everyone else. Many people in Russia are blind and support this shit show, but I just don't see how indiscriminate mobilisation wouldn't be the end for Putin", "created_utc": "1663703596.0", "edited": "False", "id": "ip8jxqc", "is_submitter": "False", "link_id": "t3_xjf4rk", "parent_id": "t3_xjf4rk", "score": "5", "subreddit": "worldnews", "subreddit_id": "t5_2qh13"}, {"author": "Makqa", "body": "Life gems become op at some point", "created_utc": "1663694995.0", "edited": "False", "id": "ip7xl07", "is_submitter": "False", "link_id": "t3_xj880j", "parent_id": "t3_xj880j", "score": "1", "subreddit": "DarkSouls2", "subreddit_id": "t5_2vqni"}, {"author": "Makqa", "body": "Funny woman comedian, unbelievable", "created_utc": "1663694896.0", "edited": "False", "id": "ip7xbjy", "is_submitter": "False", "link_id": "t3_xj5p4g", "parent_id": "t3_xj5p4g", "score": "3", "subreddit": "funny", "subreddit_id": "t5_2qh33"}, {"author": "Makqa", "body": "I don't know, I learn Spanish", "created_utc": "1663607934.0", "edited": "False", "id": "ip36gq7", "is_submitter": "False", "link_id": "t3_xicqkt", "parent_id": "t3_xicqkt", "score": "6", "subreddit": "languagelearningjerk", "subreddit_id": "t5_37rt5"}, {"author": "Makqa", "body": "I don't use reddit for self-improvement, come on..", "created_utc": "1663441007.0", "edited": "False", "id": "iotw7bp", "is_submitter": "False", "link_id": "t3_xgkjnu", "parent_id": "t3_xgkjnu", "score": "5", "subreddit": "intj", "subreddit_id": "t5_2qowo"}, {"author": "Makqa", "body": "There's correlation between CEFR levels and native speakers' skills, but not total correlation. \n\nA native adult speaker would definitely be C2 on all four skills if both a non native and a native have comparable educational backgrounds. \n\nMost natives would probably find it a little bit challenging to do grammar-oriented exercises. Also, they may have some difficulty in the reading part as and writing because you would need some secondary skills as well. But listening and speaking would be a breeze\n\nI personally know examples when English native speakers did CPE (C2), got 230/230 on speaking, listening and writing, but got 205/230 on reading.", "created_utc": "1663066878.0", "edited": "False", "id": "io8pv9o", "is_submitter": "False", "link_id": "t3_xcfxqr", "parent_id": "t3_xcfxqr", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Makqa", "body": "I'm pretty sure people will continue to learn foreign languages because of sentimental value. \n\nIf you are into listening to songs in a foreign language mere translation wouldn't cut it. Some would want to read literature in the original language. Also, if you had a girlfriend who is from a different country and speaks a different language, wouldnt you want to learn their language? \n\nBesides, the whole thing about languages being useless  is exaggerated, in my opinion. By the time we really don't need to learn any language at all, all the other skills will have already been automated, as it's one of the most  complex systems", "created_utc": "1662919434.0", "edited": "False", "id": "io0mgc7", "is_submitter": "False", "link_id": "t3_xb2li9", "parent_id": "t3_xb2li9", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Makqa", "body": "Aghh, i'm sorry to be that guy, but I noticed that your profile pic contains a woman... smoking... \n\n\nI understand that's most likely not you, but you are looking for close-to-perfect/perfect people, yet your standards towards your own gender are so eggregiously flawed... \n\nBesides, I refuse to believe that today a woman is out of options. I bet there are many guys around you who have those good qualities, but are overlooked because they aren't good-looking enough.  \n\nSo\n1) Your standards are probably high (which I don't criticise, but you need to be aware of that and critical of yourself) \n\n2) Those who do meet your standards don't see you as a high-value long-term option (I've just noted one of the reasons) \n\nAnyway, no ill feelings here. As long as we can see our flaws, get aware of them and improve ourselves, it's ok.\n\nOn a side note though. Our age is indeed full of pussies, so i'm sure it shows and truly masculine men are becoming more rare.", "created_utc": "1662907865.0", "edited": "False", "id": "inzsm0r", "is_submitter": "False", "link_id": "t3_xbebng", "parent_id": "t3_xbebng", "score": "0", "subreddit": "intj", "subreddit_id": "t5_2qowo"}, {"author": "Makqa", "body": "Post rock", "created_utc": "1662900842.0", "edited": "False", "id": "inzc5m3", "is_submitter": "False", "link_id": "t3_xb0p4w", "parent_id": "t3_xb0p4w", "score": "3", "subreddit": "Chillintj", "subreddit_id": "t5_3wx6e4"}, {"author": "Makqa", "body": "I all in all support him. I don't 100% agree with everything he says. To my taste, he sometimes gets carried away too much in his formulations or makes a little bit too broad assumptions. Particularly, I think his view of women and emphasis on material wealth is somewhat exaggerated because of his success and the fact that he only gets to talk to the dumbest and most basic hoes. The evidence for that is the type of girls who he usually has on his podcasts... (i mean, just look at them, you obviously shouldn't expect anything of value and depth there). It seems to me he deliberately doesn't want to put in a little bit of effort to seek out a great partner, a soul mate (and not just casual sex) which, i am convinced, there are many of among women, although definitely a  minority. \n\nBut I intrinsically despise wokism and to a large degree \"the blue pill\" that holds sway in the modern world. And his message that men should come to terms with the reality, however unfair as it may be, soldier up and grind through building up their value is just on the mark. In my view, people these days are way too used to pouring out their emotions everywhere and exhibiting their weakness left and right as a virtue, and he encourages people, particularly men, to be tougher. As an intj, his words appeal to me. \n\nBut that's just my take. \n\nP.S. The fact he got \"cancelled\" speaks for itself.", "created_utc": "1662890411.0", "edited": "1662890669.0", "id": "inyw1ek", "is_submitter": "False", "link_id": "t3_xb32iy", "parent_id": "t3_xb32iy", "score": "2", "subreddit": "intj", "subreddit_id": "t5_2qowo"}, {"author": "Makqa", "body": "Looks like a woman", "created_utc": "1662693709.0", "edited": "False", "id": "inojakt", "is_submitter": "False", "link_id": "t3_x98hd7", "parent_id": "t3_x98hd7", "score": "1", "subreddit": "duolingo", "subreddit_id": "t5_2t6ze"}, {"author": "Makqa", "body": "I don't know guys, ds 2 was my first souls game and it was fantastic. Then I played ds 1 and ds 3 I did enjoy it less. \n\nImo, slower pace fits dark Souls better. I also like the overall aesthetics of the game a little bit more. It's less flashy. For me ds2 is the best. \n\nP.S. Majula rocks. Way better than the other home locations.", "created_utc": "1662391231.0", "edited": "False", "id": "in6yu8p", "is_submitter": "False", "link_id": "t3_x6h352", "parent_id": "t3_x6h352", "score": "1", "subreddit": "DarkSouls2", "subreddit_id": "t5_2vqni"}, {"author": "Makqa", "body": "It's Russian", "created_utc": "1661674764.0", "edited": "False", "id": "im3t48r", "is_submitter": "False", "link_id": "t3_wzpa8i", "parent_id": "t3_wzpa8i", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Makqa", "body": "Тут люди говорят, что это альтернативная вселенная, поэтому претензии Мохова не обоснованы. Но я думаю, что даже если бы это и вправду про СССР, то что? Пусть потребитель рублём решает, что покупать и во  что играть. \n\nЦензура должна быть минимальной ( если совсем откровенно, я считаю её вообще не должно быть, что бы ни было представлено), тем более такой однобокой и тупой.", "created_utc": "1661591706.0", "edited": "False", "id": "ilzcu4w", "is_submitter": "False", "link_id": "t3_wytwz6", "parent_id": "t3_wytwz6", "score": "1", "subreddit": "Pikabu", "subreddit_id": "t5_2tzr0"}, {"author": "Makqa", "body": "I get it you are all pissed, but this selection is way too biased to take it seriously", "created_utc": "1661542110.0", "edited": "False", "id": "ilwqzau", "is_submitter": "False", "link_id": "t3_wygbrt", "parent_id": "t3_wygbrt", "score": "-4", "subreddit": "RussiaUkraineWar2022", "subreddit_id": "t5_5wptpp"}, {"author": "Makqa", "body": "beach vs bitch \n\nsheet vs shit \n\nI aways try to make sure I soften the vowel", "created_utc": "1661367431.0", "edited": "False", "id": "ilmq1sq", "is_submitter": "False", "link_id": "t3_wwnxiq", "parent_id": "t3_wwnxiq", "score": "8", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Makqa", "body": "Yes, probably, but in terms of authenticity the fact that it's produced by the French themselves is really noticable. The whole setting of the game is elegant and looks like France and stuff.", "created_utc": "1661355135.0", "edited": "False", "id": "illteth", "is_submitter": "False", "link_id": "t3_wovffz", "parent_id": "t1_illrvf2", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Makqa", "body": "Lil Sheet", "created_utc": "1661276459.0", "edited": "False", "id": "ilhenfv", "is_submitter": "False", "link_id": "t3_wvkttr", "parent_id": "t3_wvkttr", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "Makqa", "body": "Рот закрой, бл", "created_utc": "1661161836.0", "edited": "False", "id": "ilavsiz", "is_submitter": "False", "link_id": "t3_wukelp", "parent_id": "t3_wukelp", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Makqa", "body": "That's what happens when you get equal rights", "created_utc": "1661032834.0", "edited": "False", "id": "il4al1e", "is_submitter": "False", "link_id": "t3_wtcv91", "parent_id": "t3_wtcv91", "score": "-2", "subreddit": "dontputyourdickinthat", "subreddit_id": "t5_3h9ul"}, {"author": "Makqa", "body": "I'm a nazi these days", "created_utc": "1661014235.0", "edited": "False", "id": "il33kt0", "is_submitter": "False", "link_id": "t3_wt1roc", "parent_id": "t3_wt1roc", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "Makqa", "body": "I don't know bro, many people sold quickly seems more likely imao", "created_utc": "1660831522.0", "edited": "False", "id": "ikspgac", "is_submitter": "False", "link_id": "t3_wrkatf", "parent_id": "t1_iksp3lg", "score": "1", "subreddit": "wallstreetbets", "subreddit_id": "t5_2th52"}, {"author": "Makqa", "body": "These lines don't mean shit, people either want to buy or they don't", "created_utc": "1660831280.0", "edited": "False", "id": "iksov5z", "is_submitter": "False", "link_id": "t3_wrkatf", "parent_id": "t3_wrkatf", "score": "9", "subreddit": "wallstreetbets", "subreddit_id": "t5_2th52"}, {"author": "Makqa", "body": "\n1. Fail to be good enough to be admitted into an art school \n\n2. Start a political party\n\n3. Kill millions of people worldwide\n\n4. Suicide to avoid just punishment \n\n5. Wait 80 years till they start to romanticise you\n\n6.Profit \n\nDamn, the man was smart...", "created_utc": "1660830622.0", "edited": "False", "id": "iksn9k9", "is_submitter": "False", "link_id": "t3_wreakj", "parent_id": "t3_wreakj", "score": "34", "subreddit": "HistoryMemes", "subreddit_id": "t5_2v2cd"}, {"author": "Makqa", "body": "Imo they are all kind of obnoxious", "created_utc": "1660663449.0", "edited": "False", "id": "ikj38ne", "is_submitter": "False", "link_id": "t3_wpdobr", "parent_id": "t3_wpdobr", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "Makqa", "body": "It definitely helps to expand your vocabulary and learn the language overall. \n\nBut it really depends on the game. And also depends on how you are planning to play it. Do you expect to actually enjoy it? \n\nI would say, if you take a random AAA game where there is a decent amount of dialogue and text (skyrim, the last of us, dishonored, uncharted and such) the minimum would be B1 if you want to really just get the gist of a message and are not planning to stop and look in dictionary every time you come across a new word. But the question then would be, what exactly are you learning? Because then you would  be simply ignoring a large portion of text that you don't understand. And since you wouldn't want to parse it all (otherwise you would be moving through it very slowly and eventually get exhausted not enjoying the process) there would be little benefit learning-wise. \n\nBesides, you definitely don't know all the grammar at this level, so you, again, would be skipping a lot, and it would be much more difficult to pick up grammar rules on the go. So your choice is either ignoring a good 40-60% of the input and just playing the game, or trying to comprehend everything and not really enjoying the game as such. \n\nAnd let me tell you that you are going to see just as many complicated aspects of the language mixed along with the simpler rules that you would have learnt up to b1. To us, language learners, rules and words, register and in general the \"kind\" of language used, are graded and we tend to deduce the scarcity or frequency of a given nuance based on this level scale. \nNatives, however, for whom the product, such as a video game, is designed/interpreted, would by default not distinguish between the difficulty or complexity of a certain utterance. For them, unless they are specifically analysing it, it would be the same\"language flow\" and they can perceive with the same ease the more difficult, and rarer, (C2) nuances along with the simple (B1)aspects of the language that you have already learned (and not even mastered). So, in my view,  you will be out of your depth most of the time. \n\nI played skyrim in English a long time ago(2013-2014) , when I was somewhere around B1, I can say it wasn't the easiest experience I didn't know words like \"miscellaneous\". \"Conjuration\" and \"restoration\" were weird to me as well, you know. Then many years later I played it again after having learnt 🇫🇷 to B1. And yes, I could get by (not lastly because of the fact that skyrim allows you to play dialogue lines many times over), but just couldn't quite immerse myself fully in the world as the language barrier was still quite tangible. Reading one book would take me a long time and I would have to double check if I understood some lines correctly. \n\nThen when I got my French to C1 I played dishonored and  did quite well, but still every now and then there would be words I didn't fully understand. Sometimes there would be some area-specific vocabulary and very colloquial language, swear words etc. Admittedly, though, Dishonored is more difficult in terms of language, at least in my view. \n\n\nI play horizon zero dawn now in German . And with C2 everything is really smooth, I do come across a few new words once in a while, but they stick much easier and sometimes I can even skip translating them because their meaning is deductible. I feel like I do derive great value for my German playing it, since it exposes me to new contexts and scenarios in which the language plays out. You will consolidate grammar, vocabulary and also fill in the remaining gaps in your knowledge, therefore at advanced levels video games really come in handy\n\nSo, learning a language through videogames, in my opinion, is a nice romantic idea. But it's potential for proper learning opens up towards C1 and higher when you already know most of the language. They are great for enriching your vocab and revising everything because of all sorts numerous contexts and situations they put you in\n\nMeanwhile,  I think playing at lower than B1 would be a torture for most games", "created_utc": "1660569311.0", "edited": "1660569612.0", "id": "ikdndy8", "is_submitter": "False", "link_id": "t3_wovffz", "parent_id": "t3_wovffz", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Makqa", "body": "I'm sorry to break it to Zelensky, but this war is by far not the biggest conflict over the last two hundred years. I totally share the anti-war sentiment, but statements such as this are just populistic. Should everything bad committed by a country be extended as far as to call every citizen of this country a criminal? Then, why no one is talking about Germany, Italy, Japan, the US and a bunch of other countries? \n\nJust recently China has literally killed millions of people due to corona virus around the globe. NOT JUST IN THE UKRAINE, BUT IN MOST COUNTRIES, the global economy suffered from it much more than right now, the ensuing lockdown negatively affected the lives of people worldwide for several years, which easily qualifies as international crime. Yet, nothing has been undertaken to punish China and now they have another virus going.... \n\nYet, everyone here is blaming the most vulnerable part of population in Russia for not being able to suddenly \"change the world\"and \"erase the despicable dictatorship\" because it's vulnerable and has no power, literally. \n\nHow easy is this for an average American to go protest against FBI intruding into Trump's house? It's literally a political repression, totally orchestrated by the left to impede Trump. Why won't you go and coup Biden for the left's incompetent handling of national and international affairs????\n\nAh, of course, it's not so easy you see. And it's totally different... Yes. \n\nBut the \"STUPID ENSLAVED RUSSIANS\" are all without exception criminals. Because they are the most vulnerable target and you can throw words around and masturbate to each other's \"witty\" comments on Reddit, upvoting the most primitive general lines. \n\nYou don't want to look at problems fundamentally, you are just as subject to propaganda like everyone else. Yes, Russian propaganda is tough and makes many Russians lose their basic logic and clinically insane. This characterises unfortunately  the entirety of the Russian history, it's a tragedy in fact. But you are just as idle in your pursuit of the truth, only catching big superficial titles and headlines that the news push to you. And you are buying the populist narrative of not so smart incompetent politicians just as well, who who fail to make the right political decisions, but want to relieve the burden of responsibility off of themselves.Had you been born in the USSR and lived under this much prpaganda from your birth most of you would  get trapped in it as well.  \n\nAnd yes, if Russia is a terrorist state than you are all buying gas and oil from a terrorist state. Doesn't that make you \"COMPLICIT\" in these crime? Ah, no, it's different, of course. \n\nMaybe you should just go and protest then against your government buying oil and gas from Putin? Ah, no, you can't of course, because...reasons. \n\n\"Beauce how are we supposed to stay in our comfortable houses with electricity and heating and drive our cars if we don't use the Russian oil and gas??? Are we supposed to abandon that and live a worse life??!!!Of course, we can't do that, why would we, it's totally different\". Why won't you coup your government then??? It must definitely be much easier in liberal democratic regimes then it is in Russia, so why won't just go and do it? Don't you want to help Zelensky, don't you want to help Ukraine? \n\nBut the Russians are fucking stupid slavish pigs for not willing to sacrifice their lives and get beaten by the police and special forces. \n\nImpotent hypocrites. Only good for writing comments on Reddit.", "created_utc": "1660558740.0", "edited": "1660559152.0", "id": "ikd5sww", "is_submitter": "False", "link_id": "t3_wojmr5", "parent_id": "t3_wojmr5", "score": "4", "subreddit": "worldnews", "subreddit_id": "t5_2qh13"}, {"author": "Makqa", "body": "Часы стоят столько же, сколько машина, круто", "created_utc": "1660511686.0", "edited": "False", "id": "ikavkbs", "is_submitter": "False", "link_id": "t3_wnz90p", "parent_id": "t3_wnz90p", "score": "1", "subreddit": "Popular_Science_Ru", "subreddit_id": "t5_12653g"}, {"author": "Makqa", "body": "You are not alone in the struggle \n\nI took DALF C2 around half a year ago (French), and passed the speaking and listening part (25/50) and failed the reading and writing part (20.5/50). The total of at least 50/100 is needed. So I got really close but failed by a little. \n \nAnyway,  i've put my French on the backburner now and am studying it moderately by enjoying the things I can, which by this point are literally anything (even stand up comedy is not such big a problem, you know what I mean) \n\nSo you know, it's just a matter of time before we hit our goals! And not a long time at that", "created_utc": "1660424133.0", "edited": "False", "id": "ik69h09", "is_submitter": "False", "link_id": "t3_wni3h8", "parent_id": "t3_wni3h8", "score": "6", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Makqa", "body": "Didn't know Armenia had pharaohs", "created_utc": "1660335116.0", "edited": "False", "id": "ik1go3x", "is_submitter": "False", "link_id": "t3_wminbn", "parent_id": "t3_wminbn", "score": "2", "subreddit": "HistoryMemes", "subreddit_id": "t5_2v2cd"}, {"author": "Makqa", "body": "No, only Japanese", "created_utc": "1660334442.0", "edited": "False", "id": "ik1eykq", "is_submitter": "False", "link_id": "t3_wmj25e", "parent_id": "t3_wmj25e", "score": "2", "subreddit": "languagelearningjerk", "subreddit_id": "t5_37rt5"}, {"author": "Makqa", "body": "Most of you commenting here are morons", "created_utc": "1660209016.0", "edited": "False", "id": "iju33zk", "is_submitter": "False", "link_id": "t3_wkydsv", "parent_id": "t3_wkydsv", "score": "-1", "subreddit": "RussiaUkraineWar2022", "subreddit_id": "t5_5wptpp"}, {"author": "Makqa", "body": "This guy is funny", "created_utc": "1660055467.0", "edited": "False", "id": "ijl1eaj", "is_submitter": "False", "link_id": "t3_wjy127", "parent_id": "t3_wjy127", "score": "1", "subreddit": "facepalm", "subreddit_id": "t5_2r5rp"}, {"author": "Makqa", "body": "Причём тут геи, умник. Если, человек гей, то это комбинация генов. Природой, значит, так человеку дано, и я ничего против них не имею. \"Повестка\" начинается тогда, когда из этого делают политическое движение. А ЛГБТ это сродни BLM и прочим левым вещам. И вот одним из конкретных проявлений являются фильмы. Когда людям лишь бы увидеть на экране чернокожего, там где изначально он таковым не был, чтобы нахвататься толерантности. Отрицаются логика и здравый смысл. \n\nИ что значит мифических\"? Ты хочешь сказать этого нет? На США и на Западе эта идеология не то что просто есть, она там ярко выражена. \n\nВ конце концов, этот пост чему посвящён?!! В этом же инциденте с фильмом и есть левачество чистой воды", "created_utc": "1660039490.0", "edited": "False", "id": "ijk7aib", "is_submitter": "False", "link_id": "t3_wjsmn1", "parent_id": "t1_ijk5d3d", "score": "1", "subreddit": "Pikabu", "subreddit_id": "t5_2tzr0"}, {"author": "Makqa", "body": "Ебаные леваки, хули. У них нет никакого желания заниматься творчеством, видеть идеи и смыслы произведение и стараться с душой воплотить их. \n\nОдни политические повестки на уме, везде главное засунуть уродливого иммигранта, чтобы поставить галочку на поле \"толерантен\" и \"политические корректен\". \n\nЭти уëбки портят всё, к чему прикасаются. \nЯ помню как Еннифер в ведьмаке сыграла какая-то неандерталька. Та была, конечно, чуть покрасивей вот этой вот, но тоже далеко не производила впечатление необычайной красавицы как в книгах и в играх.\n\nВообщем, тьфу на них", "created_utc": "1660035999.0", "edited": "False", "id": "ijk2yi0", "is_submitter": "False", "link_id": "t3_wjsmn1", "parent_id": "t3_wjsmn1", "score": "-6", "subreddit": "Pikabu", "subreddit_id": "t5_2tzr0"}, {"author": "Makqa", "body": "If you are looking for a short general answer, I would say that only when you are way over C2+ will you stop translating completely.But before then you need to come to terms with that feeling. \n\nFrom my experience, even if I don't  try to translate something on purpose, unless my level is high enough to form a sentence right off the bat without having to question myself after the fact  (which is again not so common until you are at least C1), I will then immediately go down a gear trying to say it going off of my dominant language. \n\nNow consider how many possible situations and scenarios there are in a language, which you are supposed to handle without translation,  all of this will eventually add up to C2+.\n\nThe thing is that, in order not to translate, you should either have a very high proficiency or be able to parapharase stuff, which naturally involves having a good grasp on grammar and having a rich vocabulary, which is again kind of \"C\" territory and you would still be aiming for C2+ and not just C1 as you would wish to polish off many nuances and remaining gaps, which would, again, lead you to question yourself and, thus use translation one way or another. \n\nSo... I guess you could only properly have a peace of mind when you are C2+ . Also... ask yourself if you really understand everything that you hear in this language very well, because \"clear\" listening is a good indicator of your ability to \"process\" the language. If you don't easily grasp the meaning of sentences, you will stumble here and there as well while speaking. So it's tough. \n\nThat said, it also depends on the language. For example, if you know French well enough and are learning Spanish, you will need to translate less. \nYou will sort of speak a language \"through another language\"", "created_utc": "1659911988.0", "edited": "False", "id": "ijdb1nj", "is_submitter": "False", "link_id": "t3_wirdry", "parent_id": "t3_wirdry", "score": "4", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Makqa", "body": "Probably some niche languages that sound really cool or maybe have some attractive features. For instance, Gaelic that looks and sounds like it's spoken by elves", "created_utc": "1659858983.0", "edited": "False", "id": "ijaclsb", "is_submitter": "False", "link_id": "t3_wi6us0", "parent_id": "t3_wi6us0", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Makqa", "body": " Когда нашёл новый биом в майнкрафте", "created_utc": "1659648330.0", "edited": "False", "id": "iiyy6nf", "is_submitter": "False", "link_id": "t3_wfsm0o", "parent_id": "t3_wfsm0o", "score": "1", "subreddit": "Popular_Science_Ru", "subreddit_id": "t5_12653g"}, {"author": "Makqa", "body": "Uzbek", "created_utc": "1659647529.0", "edited": "False", "id": "iiyw4ol", "is_submitter": "False", "link_id": "t3_wg6mob", "parent_id": "t3_wg6mob", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Makqa", "body": "Bro, I thought it was Skyrim for a moment", "created_utc": "1659391507.0", "edited": "False", "id": "iikcz19", "is_submitter": "False", "link_id": "t3_wdpjsv", "parent_id": "t3_wdpjsv", "score": "2", "subreddit": "UkraineWarVideoReport", "subreddit_id": "t5_5wjmo8"}, {"author": "Makqa", "body": " Not a powerlifter, but I do callisthenics at quite an advanced level (planches, muscle-ups, levers etc.), so it's quite serious. \n\nFor me personally, calisthenics ties in great with my studying routine. \n\nAfter studying for multiple hours and getting mental exertion, my body naturally aches for physical activity and so I go do callisthenics. I usually train hard and leave the sports ground with sore muscles and when I come back, I can do another studying session. \n\nI feel like the best treat to avoid burning out is not a lack of activity, but an alternation thereof. Do different things and your brain will look forward to more stuff and will be excited. At least this is how it works for me. \n\nDefinitely, don't give up exercise under the pretext that you will then \"have more energy\" for other activities. That sounds like over the top to me. \nBesides, how long do you study? I mean, if it's within 2-3 hours, even longer, you are totally fine. It's not like human beings cannot combine mental improvement with physical improvement. And also the more you study the more you will be drawn to change things up.", "created_utc": "1659373224.0", "edited": "False", "id": "iij1mex", "is_submitter": "False", "link_id": "t3_wdkev0", "parent_id": "t3_wdkev0", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Makqa", "body": "\"get rekt, scrub\" \n\n-Dark souls", "created_utc": "1659295980.0", "edited": "False", "id": "iif2s44", "is_submitter": "False", "link_id": "t3_wcr6j4", "parent_id": "t3_wcr6j4", "score": "13", "subreddit": "DarkSouls2", "subreddit_id": "t5_2vqni"}, {"author": "Makqa", "body": "\"Peacock \" maybe as well", "created_utc": "1659295765.0", "edited": "False", "id": "iif2a4l", "is_submitter": "False", "link_id": "t3_wcecx3", "parent_id": "t3_wcecx3", "score": "1", "subreddit": "EnglishLearning", "subreddit_id": "t5_2u8ap"}, {"author": "Makqa", "body": "I can relate to that in the sense that when  you're learning a new language, you are sort of solving a puzzle and a new language gradually comes together out of nowhere piece by piece. So it feels like unraveling a mystery a little bit. And yes, if you stick with it for a while your brain and your eyes get used to it and it loses its novelty....\n\nBesides, if you've been studying a certain language intensely and suddenly start to lose interest, maybe it's a burn-out", "created_utc": "1659294968.0", "edited": "False", "id": "iif0fs9", "is_submitter": "False", "link_id": "t3_wcvutl", "parent_id": "t3_wcvutl", "score": "19", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Makqa", "body": "My British friend from London told me I have an American accent. Must be because of the fact that I mostly consume American English media. \n\nSome arabs say though I have a perfect London accent 🤣", "created_utc": "1659293499.0", "edited": "1659293698.0", "id": "iiewz6w", "is_submitter": "False", "link_id": "t3_wcvdk9", "parent_id": "t3_wcvdk9", "score": "28", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Makqa", "body": "You will learn to speak very well only when you can listen very well. And writing will naturally follow speaking.", "created_utc": "1659292949.0", "edited": "False", "id": "iievnvc", "is_submitter": "False", "link_id": "t3_wcrx70", "parent_id": "t3_wcrx70", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Makqa", "body": "Repeating the same vocab everyday doesn't help that much. You need more contexts and not separate repitions. Maybe you should just come back to anki once every week or so for a few minutes.", "created_utc": "1659292841.0", "edited": "False", "id": "iievebu", "is_submitter": "False", "link_id": "t3_wcv5n9", "parent_id": "t3_wcv5n9", "score": "-9", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Makqa", "body": "Hmm, interesting idea.. I feel like I would still not swap my native language for English\n\nFor both some practical and sentimental reasons... \n\nThe practical one is that English is still by far not the most difficult language to learn. Even though reaching native-like proficiency seems like an impossible task, I personally get to surround myself sooo much with English media on an everyday basis that I could even go so far as to say that English is my default language at this point. And the thing about English is that once you can consistently understand it in listening and reading at some level it will be very easy to continue to develop your overal proficiency to the incredibly high level. It literally just clings to you: there are news, games, books, articles, mfs arguing with each other, etc. And there are so many studying resources available. \n\nConversely, it would be more difficult to do the same thing with German and French and other languages, because you need to specifically look for content and it doesn't pop up as naturally as English does. So, yes, although, English is not my native language and it took a while to learn it, I think I've still easily made up for that over time that at this point my english proficiency is sometimes barely distinguishable from my native language. \n\nMeanwhile, learning Russian to the same level would be much more difficult. And the sentimental part is that after years of learning foreign languages I got to realise and cherish the fact that I can speak such a difficult and culturally rich language as a native language.", "created_utc": "1659291940.0", "edited": "False", "id": "iiet89r", "is_submitter": "False", "link_id": "t3_wcpegs", "parent_id": "t3_wcpegs", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Makqa", "body": "Japanese", "created_utc": "1659220946.0", "edited": "False", "id": "iib9klk", "is_submitter": "False", "link_id": "t3_wc77ak", "parent_id": "t3_wc77ak", "score": "0", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Makqa", "body": "The only useful language learning app is a fucking dictionary", "created_utc": "1659210254.0", "edited": "False", "id": "iialvzw", "is_submitter": "False", "link_id": "t3_wc1nl4", "parent_id": "t3_wc1nl4", "score": "33", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Makqa", "body": "Узбек", "created_utc": "1659183264.0", "edited": "False", "id": "ii9000t", "is_submitter": "False", "link_id": "t3_wbhb4r", "parent_id": "t3_wbhb4r", "score": "5", "subreddit": "languagelearningjerk", "subreddit_id": "t5_37rt5"}, {"author": "Makqa", "body": "Yes, it's a weird but pleasant feeling when you realise your YouTube feed is filled with videos in numerous languages and you navigate them and watch them without even noticing that those are actually different languages", "created_utc": "1659128997.0", "edited": "False", "id": "ii6fu8b", "is_submitter": "False", "link_id": "t3_wbdmzl", "parent_id": "t3_wbdmzl", "score": "66", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Makqa", "body": "I like his weapon, looks sleek", "created_utc": "1659125254.0", "edited": "False", "id": "ii66q3i", "is_submitter": "False", "link_id": "t3_wba9fv", "parent_id": "t3_wba9fv", "score": "2", "subreddit": "forhonor", "subreddit_id": "t5_38p4n"}, {"author": "Makqa", "body": "It does depend on the difficulty of each language and what language(s) you already know. \nI'd say two languages from 1 to 4 group in terms of difficulty (according to FSI) are fine for most people.  You could study, say, Italian and Turkish and do decent progress withing a reasonable amount of time in both of them (1-1.5 years). Russian + Finnish would already be quite a challenge, but still doable for most. If you are native French with a good knowledge of English, Italian and Spanish would be a walk in the park for you\n\n\nOn the other hand, if that's Chinese and Arabic at the same time, than you would be getting into the \"grind\"  territory and that could be really tiresome. You either would have to spend an hour everyday on each of them and to expect to only get reasonably good after a long period of time of 3 years + . Or you'd have to put 2+ hours every day into each of them and so you could get to a decent level within 1.5 - 2 years, but that would require strong commitment, so you must really be kind of a nerd in language learning in that case. 🤪 \n\nAnd yes, you could add a third or even a fourth language on top of that but that would take up most of your time, and would definitely make you a \"niche guy\" at that point as you would need to spend 6+ hours of your time each day.  Let alone if your language set is \"Japanese, Chinese, Korean, Arabic\" (which would definitely force you to put 8+ hours everyday if you expect good progress within say 1.5-2 years) \n\nMore than four seems to be unrealistic to me. Not because \"you would confuse the languages\" - no. Just because you would physically be running out of time to study all of them properly. Otherwise you would barely be studying, at least some of them, at all.", "created_utc": "1659037387.0", "edited": "False", "id": "ii15v8t", "is_submitter": "False", "link_id": "t3_wagei9", "parent_id": "t3_wagei9", "score": "6", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Makqa", "body": "I don't know, seems like generic shit to me. And cringe", "created_utc": "1658771122.0", "edited": "False", "id": "ihlsizx", "is_submitter": "False", "link_id": "t3_w7ofbe", "parent_id": "t3_w7ofbe", "score": "-1", "subreddit": "wholesomememes", "subreddit_id": "t5_3gcwj"}, {"author": "Makqa", "body": "With all due respect, but I doubt DuoLingo will be able to get anywhere close to the already organised entities such the Cambridge Assessment, Goethe Institute, Alliance Francaise and the respective entities in other countries. How are the results going to be verified? Are we talking about all skills? \n\nAlso, judging by the op's post it looks like it will just be a placement test, of which there are already many. The Cambridge site has a small test in place already to roughly determine your level (so it is already accessible and cheap, basically free, if that's what you are looking for), and it would definitely not be enough to claim B2, for example, and use it as proof, even if it tells you could potentially be B2. And that's Cambridge. Let alone some random third-party app. \n\nBut forget about all those sites for a moment. How about you just download a mock paper and do it and see for yourself what level you are...? It's cheap and accessible. \n\nBesides... Like what \"fluency\" are they going to assess? A2? \n\nMy take is that they are just going to tap into this whole learning-app trend to convince already too much hopeful beginners that they are even more \"legit\" now with their fancy scale...\n\nAt best it will be a solid copy-paste of the already existing placement tests.", "created_utc": "1658348550.0", "edited": "1658348796.0", "id": "igyn9cp", "is_submitter": "False", "link_id": "t3_w3olvt", "parent_id": "t3_w3olvt", "score": "4", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Makqa", "body": "No problem, putin just needs to catch Elon Musk and then pay", "created_utc": "1657009858.0", "edited": "1663907899.0", "id": "iex4nw4", "is_submitter": "False", "link_id": "t3_vre8mn", "parent_id": "t3_vre8mn", "score": "1", "subreddit": "worldnews", "subreddit_id": "t5_2qh13"}, {"author": "Makqa", "body": "Haha, this guy is funny", "created_utc": "1656492905.0", "edited": "False", "id": "ie5wwzj", "is_submitter": "False", "link_id": "t3_vn89g2", "parent_id": "t3_vn89g2", "score": "1", "subreddit": "worldnews", "subreddit_id": "t5_2qh13"}, {"author": "Makqa", "body": "because I want to be an alpha polyglot gigachad.", "created_utc": "1656076054.0", "edited": "False", "id": "idjye6r", "is_submitter": "False", "link_id": "t3_vjijk1", "parent_id": "t3_vjijk1", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Makqa", "body": "« Опять » is more colloquial and expresses a certain degree of annoyance/ is stronger overall. So if you are just a beginner just keep in mind that this word exists but don’t use it left and right or it may throw people off", "created_utc": "1655625962.0", "edited": "False", "id": "icx9191", "is_submitter": "False", "link_id": "t3_vfq2to", "parent_id": "t3_vfq2to", "score": "12", "subreddit": "russian", "subreddit_id": "t5_2qlc6"}, {"author": "Makqa", "body": "Git gud", "created_utc": "1654513967.0", "edited": "False", "id": "ibcrl15", "is_submitter": "False", "link_id": "t3_v5wj50", "parent_id": "t3_v5wj50", "score": "2", "subreddit": "ForHonorRants", "subreddit_id": "t5_3jk0e"}, {"author": "Makqa", "body": "Those who downvote maybe care to elaborate? \n\nLike I’m literally russian and know both what „грозный“ means, what connotation it has in Russian and how it sounds, as well as the word „terrible“ in English. And it has always sounded right to me translated as „terrible“.\n\nReddit is ridiculous at times", "created_utc": "1654449156.0", "edited": "1654449665.0", "id": "ib9rtss", "is_submitter": "False", "link_id": "t3_v5am1c", "parent_id": "t1_ib8vgzw", "score": "1", "subreddit": "russian", "subreddit_id": "t5_2qlc6"}, {"author": "Makqa", "body": "Was it really? may not know all the history, but as far as I remember people who lived under him already viewed him negatively. \n\nMany people new about “oprichnina” at that time and that it was of the Tsar’s doing.", "created_utc": "1654438067.0", "edited": "False", "id": "ib957z1", "is_submitter": "False", "link_id": "t3_v5am1c", "parent_id": "t1_ib940ub", "score": "2", "subreddit": "russian", "subreddit_id": "t5_2qlc6"}, {"author": "Makqa", "body": "We don’t usually add the title ´terrible’ to monarchs‘ names to designate that they were terrible. That’s besides the point. \n\nPeople give them such titles because in their eyes this name of this or that monarch seems special. So Russians did the same thing with the name Грозный. That half of the monarchs who ever ruled would have been just as terrible has nothing to do with that. He was called “terrible” not because that’s how historians usually call rulers who do terrible things, but because the addition „грозный“ to his name carries some symbolic value for the people of the country.", "created_utc": "1654437801.0", "edited": "1654449228.0", "id": "ib94q42", "is_submitter": "False", "link_id": "t3_v5am1c", "parent_id": "t1_ib8zg4y", "score": "-3", "subreddit": "russian", "subreddit_id": "t5_2qlc6"}, {"author": "Makqa", "body": "„Ivan the Terror“ it should  probably be", "created_utc": "1654435167.0", "edited": "False", "id": "ib902wv", "is_submitter": "False", "link_id": "t3_v5am1c", "parent_id": "t3_v5am1c", "score": "3", "subreddit": "russian", "subreddit_id": "t5_2qlc6"}, {"author": "Makqa", "body": "Why can’t it though? Ivan the Terrible did terrible things. \n\nIn translation you have two approaches, you either translate the word itself or the meaning. Here the latter is done quite appropriately", "created_utc": "1654432253.0", "edited": "False", "id": "ib8vgzw", "is_submitter": "False", "link_id": "t3_v5am1c", "parent_id": "t3_v5am1c", "score": "0", "subreddit": "russian", "subreddit_id": "t5_2qlc6"}, {"author": "Makqa", "body": "Damn. Hogwarts has changed, ain‘t  it?", "created_utc": "1654281184.0", "edited": "False", "id": "ib2eeq4", "is_submitter": "False", "link_id": "t3_v3t06c", "parent_id": "t3_v3t06c", "score": "1", "subreddit": "nextfuckinglevel", "subreddit_id": "t5_m0bnr"}, {"author": "Makqa", "body": "Jeez, how many companies  and businesses have you actually run to justify yourself making claims like” the my way approach” or “highway approcah” are not suited to a leader.  What are the criteria I wonder. He is literally running several  multi-hundred- billion businesses at the same time. In my book, requiring discipline from your employees is totally alright. Besides, he said in the article himself that he can consider remote work for someone under exceptional circumstance, which is fair. \n\nBut at the end of the day, he can have all opinion he wants. That’s what freedom ultimately means. Making decisions and bearing the consequences of your decisions. If someone among his employees doesn’t like the working “climate”, ethics, working conditions or if they don’t “respect him as a leader”, they literally have just as much freedom to resign, which Elon has also explicitly indicated. And It also doesn’t matter if they like him or not because of his lack of empathy. You just do the work that you must do.\n\nHe and his companies have goals and they must be met. It’s all that matters to him and he is right to demand it. It’s his company, his property, his money, his stock, his business etc.", "created_utc": "1654092726.0", "edited": "False", "id": "iase402", "is_submitter": "False", "link_id": "t3_v2ekzv", "parent_id": "t1_iasbp5i", "score": "-2", "subreddit": "technology", "subreddit_id": "t5_2qh16"}, {"author": "Makqa", "body": "Then I have just expressed mine and think you are stupid (you are free to call me whatever you want too) and disagree with you and all the people who think this way. Deal with it. \n\nBtw, him being a billionaire has nothing to do with me defending his rights. I’m defending the rights of a hard working capitalist who has contributed a lot. So you apparently have imagined an argument and got mad it. Oopsie-woopsie...", "created_utc": "1654091076.0", "edited": "False", "id": "iasakdm", "is_submitter": "False", "link_id": "t3_v2ekzv", "parent_id": "t1_ias9rbe", "score": "-2", "subreddit": "technology", "subreddit_id": "t5_2qh16"}, {"author": "Makqa", "body": "People on comments here are retarded and delusional\n\nIt’s his company, his money, his stock, his business. If he says they must work on the place so it will be. So many pussy-minded assholes these days just fail to see how important serious hard work actually is and take everything around them for granted. If someone doesn’t want to work for Tesla they are always free to leave. No outsider should force him to do anything if he doesn’t himself see it fit and beneficial for his company, products and goals. This is how capitalism works, bitches. \n\nIf all of a sudden everyone in his company left, then yes, then he would have reasons to think about it for a while. But even then it would be up to him to make a decision whether to change something or do something else. \n\nThis would be the same thing as telling the owner of a house that they shouldn’t keep a fucking orangutan in the house because ostensibly it contradicts some of other people’s beliefs. None of your business.", "created_utc": "1654089818.0", "edited": "1660435848.0", "id": "ias7zlv", "is_submitter": "False", "link_id": "t3_v2ekzv", "parent_id": "t3_v2ekzv", "score": "-10", "subreddit": "technology", "subreddit_id": "t5_2qh16"}, {"author": "Makqa", "body": "imao, people on here are so bitter. The dude just wanted to throw rocks off", "created_utc": "1653052139.0", "edited": "False", "id": "i9bp0s5", "is_submitter": "False", "link_id": "t3_utes3n", "parent_id": "t3_utes3n", "score": "1", "subreddit": "technology", "subreddit_id": "t5_2qh16"}, {"author": "Makqa", "body": "Those who complain about not having fiat. Have you ever tried maybe like... having a job or something?", "created_utc": "1652164949.0", "edited": "False", "id": "i80ssee", "is_submitter": "False", "link_id": "t3_ulvokw", "parent_id": "t3_ulvokw", "score": "1", "subreddit": "CryptoCurrency", "subreddit_id": "t5_2wlj3"}, {"author": "Makqa", "body": "Skyrim is one the best vibeful games", "created_utc": "1651915428.0", "edited": "False", "id": "i7nqjk4", "is_submitter": "False", "link_id": "t3_ujn2ow", "parent_id": "t3_ujn2ow", "score": "1", "subreddit": "PS4", "subreddit_id": "t5_2rrlp"}, {"author": "Makqa", "body": "Imao, for me the rule of thumb is, if you can’t get rich in crypto don’t even poke your head into nfts", "created_utc": "1651727540.0", "edited": "False", "id": "i7e359n", "is_submitter": "False", "link_id": "t3_uikifj", "parent_id": "t3_uikifj", "score": "1", "subreddit": "memes", "subreddit_id": "t5_2qjpg"}, {"author": "Makqa", "body": "I mean they could buy themselves lambos and houses everywhere and never work again. Or they could give this money to you to feed the LP. Pfff", "created_utc": "1651725402.0", "edited": "False", "id": "i7dzt6h", "is_submitter": "False", "link_id": "t3_ui7wcb", "parent_id": "t3_ui7wcb", "score": "2", "subreddit": "SafeMoon", "subreddit_id": "t5_42kuwz"}, {"author": "Makqa", "body": "Or maybe just putin could die already and leave everyone alone", "created_utc": "1651121023.0", "edited": "False", "id": "i6hwlr1", "is_submitter": "False", "link_id": "t3_udfpgc", "parent_id": "t3_udfpgc", "score": "2", "subreddit": "worldnews", "subreddit_id": "t5_2qh13"}, {"author": "Makqa", "body": "Blank, stupid faces", "created_utc": "1650943944.0", "edited": "False", "id": "i680db3", "is_submitter": "False", "link_id": "t3_ubs63w", "parent_id": "t3_ubs63w", "score": "1", "subreddit": "ukraine", "subreddit_id": "t5_2qqcn"}, {"author": "Makqa", "body": "хуйня", "created_utc": "1649841466.0", "edited": "False", "id": "i4jlgot", "is_submitter": "False", "link_id": "t3_u1zi0v", "parent_id": "t3_u1zi0v", "score": "0", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Makqa", "body": "Enjoy, bro", "created_utc": "1648632732.0", "edited": "False", "id": "i2p117c", "is_submitter": "False", "link_id": "t3_trzqo1", "parent_id": "t3_trzqo1", "score": "1", "subreddit": "DarkSouls2", "subreddit_id": "t5_2vqni"}, {"author": "Makqa", "body": "I mean, his exact wording is not at all like in the title. \n\nThis is the extract from the article itself:\n\n“He said that Russia \"wants to go further. Against eastern members of NATO. The Baltic states. Poland for sure.\"\n\nBut he added: \"NATO has yet to show what the Alliance can do to save people. To show that this is a truly powerful defense alliance in the world. The world is waiting.\"\n\nYou could argue that the implicit message is still the same, but it’s still not as caustic as “... failed to show it can save people.”", "created_utc": "1648132092.0", "edited": "False", "id": "i1xnaxz", "is_submitter": "False", "link_id": "t3_tm4rbp", "parent_id": "t3_tm4rbp", "score": "1", "subreddit": "worldnews", "subreddit_id": "t5_2qh13"}, {"author": "Makqa", "body": "Let’s talk about how the incompetence of the Chinese communist regime lead to a world pandemic taking the lives of millions around the world. China, for its international crime, should have been sanctioned and isolated to hell just as much as Russia, but it didn’t happen. Yes, let’s talk about that too, China...", "created_utc": "1647683007.0", "edited": "False", "id": "i19i02l", "is_submitter": "False", "link_id": "t3_thoxlb", "parent_id": "t3_thoxlb", "score": "1", "subreddit": "worldnews", "subreddit_id": "t5_2qh13"}, {"author": "Makqa", "body": "The Russian population is so fucking polarised. There are genuinely good Russians as well as these scumbags who deserve being fucked over and over by Putin.", "created_utc": "1647000693.0", "edited": "False", "id": "i08ccbt", "is_submitter": "False", "link_id": "t3_tafkm7", "parent_id": "t3_tafkm7", "score": "1", "subreddit": "interestingasfuck", "subreddit_id": "t5_2qhsa"}, {"author": "Makqa", "body": "Sorry guys, I’m not in the know. What does the letter Z mean in this context? \n\nThanks", "created_utc": "1646654693.0", "edited": "False", "id": "hzp0czf", "is_submitter": "False", "link_id": "t3_t8l79r", "parent_id": "t3_t8l79r", "score": "1", "subreddit": "worldnews", "subreddit_id": "t5_2qh13"}, {"author": "Makqa", "body": "This is good news. Less cancer", "created_utc": "1646631948.0", "edited": "False", "id": "hzo73er", "is_submitter": "False", "link_id": "t3_t85f9b", "parent_id": "t3_t85f9b", "score": "1", "subreddit": "worldnews", "subreddit_id": "t5_2qh13"}, {"author": "Makqa", "body": "Of course cnn is going to talk about racism", "created_utc": "1646125387.0", "edited": "False", "id": "hyw4awn", "is_submitter": "False", "link_id": "t3_t3z20w", "parent_id": "t3_t3z20w", "score": "1", "subreddit": "worldnews", "subreddit_id": "t5_2qh13"}, {"author": "Makqa", "body": "Well, I think if Ukrainians know they are speaking to a russian they would prefer to say it in Russian. After all, the margin for misunderstanding increases when you are listening because it’s a more difficult skill. \n\nRecently, there was a video where a woman dresses down a russian soldier, saying how he would need sunflower seeds when he dies. She starts in Ukrainian but then switches to Russian, I guess that would be typical in many other circumstances. In Russia itself it’s not common to learn Ukrainian on purpose, but most Ukrainians do know Russian. \n\nI think, technically, if two people were speaking in their respective languages, it would be possible for them to understand each other, as long as their message doesn’t need to be understood in all nuances.", "created_utc": "1645940802.0", "edited": "False", "id": "hym16iy", "is_submitter": "False", "link_id": "t3_t1ller", "parent_id": "t1_hyjywku", "score": "5", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Makqa", "body": "Oh, so you mean perfective vs imperfective? Yes, technically I should have written «понял», that would be more accurate. English must have mixed things up a little bit", "created_utc": "1645891781.0", "edited": "False", "id": "hyizyqz", "is_submitter": "False", "link_id": "t3_t1ller", "parent_id": "t1_hyiy0pt", "score": "6", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Makqa", "body": "I’ve never learned Ukrainian really. I just see and hear some stuff in Ukrainian once in a while, so, yeah, I assumed it’s «вразумити» because I figured it would be the same root as «уразуметь» in russian. I thought there was always a «в»\n\nI can assure you a Russian native speaker would scratch their head at your questions", "created_utc": "1645887244.0", "edited": "False", "id": "hyipp3c", "is_submitter": "False", "link_id": "t3_t1ller", "parent_id": "t1_hyimxqz", "score": "7", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Makqa", "body": "Yes, the point is I can’t say I know Ukrainian in the general sense, but it all sounds and looks familiar when I listen or read, so, eventually, I understand the message quite well. Doesn’t mean, though, that I could speak or write it properly, because these are simply active skills that require systematic learning", "created_utc": "1645883471.0", "edited": "1645883695.0", "id": "hyii8hs", "is_submitter": "False", "link_id": "t3_t1ller", "parent_id": "t1_hyi9p9i", "score": "15", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Makqa", "body": "ur mom", "created_utc": "1645878894.0", "edited": "False", "id": "hyiamp2", "is_submitter": "False", "link_id": "t3_t1i79f", "parent_id": "t3_t1i79f", "score": "1", "subreddit": "bloodborne", "subreddit_id": "t5_31k9i"}, {"author": "Makqa", "body": "As a native Russian, I can tell you they are quite mutually intelligible both in oral and written speech. On average I understand around 70-80% of what I hear or see.\n\nYesterday I read an article about some military stuff which was in Ukrainian, again, I understood most of it except for a few words. \n\nSo to answer your question if Russian is going to be of help. Definitely, yes. By the time you learn Russian you’ll have acquired a massive entry to Ukrainian and will be able to branch out into it a bit further no problem if you wish to do so. \n\nFirst of all, Russian and Ukrainian vocabulary are very similar. Admittedly, Ukrainian has its own words here and there but if you know Russian, those will be easily learnable because they will always ring a bell with the russian ones in terms of associations that you’ve built through learning Russian. In terms of grammar, it’s structurally the same, it’s just that some concrete letters that denote a certain tense or grammar structure may change. \n\nFor example: «понимал»(understood) is going to be «вразумив» in Ukrainian. The grammar change is in the last letters, but even they are easily deductible when you have already internalised the pace, rhythm and paradigmatics and syntagmatics of Russian - everything still sounds more or less the same.\n\nI’d say it’s worth learning russian first and then if you are really keen on Ukrainian, you could very quickly mug up on the main grammar differences that manifest itself in Ukrainian, as well as learn a few hundred  most common words in Ukrainian that are different from Russian ones. Again, that wouldn’t be the same as learning another language since you would only need to spend a few hours learning the differences. Thus, you will pick up the language very quickly.\n\nGood luck!", "created_utc": "1645862645.0", "edited": "1645862933.0", "id": "hyhq2ud", "is_submitter": "False", "link_id": "t3_t1ller", "parent_id": "t3_t1ller", "score": "174", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Makqa", "body": "I did and the article said nothing. Just „no,no,no. So immoral, Elon Musk, how can you“. False, pretentious benevolence and nothing else. \nI bet, of all people criticising him, Musk knows much more about history than most of them. \n\nI‘m not trying to defend him( and he wouldn’t need it anyway), but it’s clear that some people are ready to pounce on any slightly visible reason to bash him, totally overlooking all of his other merits. \n\nI agree with a good portion of criticism regarding Tesla, but this post goes beyond just that.  This post ending up in this sub simply shows the mean-spirited nature of some of the folks on here and it has almost nothing to do with the company and Elon musk running it. \n\nAt worst this was a dark humour", "created_utc": "1645271589.0", "edited": "False", "id": "hxkgs2q", "is_submitter": "False", "link_id": "t3_svg6kf", "parent_id": "t1_hxke6a1", "score": "2", "subreddit": "RealTesla", "subreddit_id": "t5_3mgxy"}, {"author": "Makqa", "body": "You all guys seem to be looking for a pretext to thrash Elon one more time...", "created_utc": "1645257318.0", "edited": "False", "id": "hxjzfvo", "is_submitter": "False", "link_id": "t3_svg6kf", "parent_id": "t3_svg6kf", "score": "2", "subreddit": "RealTesla", "subreddit_id": "t5_3mgxy"}, {"author": "Makqa", "body": "Do we really not realise this may be a joke?", "created_utc": "1644393467.0", "edited": "False", "id": "hw77ai4", "is_submitter": "False", "link_id": "t3_snqsl4", "parent_id": "t3_snqsl4", "score": "2", "subreddit": "facepalm", "subreddit_id": "t5_2r5rp"}, {"author": "Makqa", "body": "imao, have no idea what the coins mentioned here by many even are", "created_utc": "1643872964.0", "edited": "False", "id": "hve4sff", "is_submitter": "False", "link_id": "t3_sj16yr", "parent_id": "t3_sj16yr", "score": "1", "subreddit": "CryptoCurrency", "subreddit_id": "t5_2wlj3"}, {"author": "Makqa", "body": "Are the new hsk out already?!", "created_utc": "1643271065.0", "edited": "False", "id": "huexwct", "is_submitter": "False", "link_id": "t3_sdimlf", "parent_id": "t1_hudqf4a", "score": "5", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Makqa", "body": "Sell it", "created_utc": "1643143028.0", "edited": "False", "id": "hu78o4r", "is_submitter": "False", "link_id": "t3_scafss", "parent_id": "t3_scafss", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "Makqa", "body": "の", "created_utc": "1643142499.0", "edited": "False", "id": "hu7790j", "is_submitter": "False", "link_id": "t3_saz8ax", "parent_id": "t3_saz8ax", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Makqa", "body": "Honestly grammar has recently become more fascinating to me, but more from the linguistic aspect, since uncovering all the nuances of a language is similar to putting together a puzzle. I guess if you’re generally into that sort of things it’s really fun - seeing a language as a mechanism. It’s especially interesting when you know multiple languages to compare grammar across. \n\nThat said, learning grammar is quite troublesome and tedious if your primary goal is to learn a language for communication purposes because it presents a considerable learning curve. \n\nBut, in general, it’s natural not to enjoy something and have to grind through it in the beginning and then get a hang of it as you approach mastery.", "created_utc": "1643142057.0", "edited": "1643142361.0", "id": "hu762m5", "is_submitter": "False", "link_id": "t3_schtyd", "parent_id": "t3_schtyd", "score": "11", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Makqa", "body": "\n\nThere’s no such thing as ‘unacceptable’ in these exams. Several mistakes do not invalidate the entirety of his speech. It’s all about the degree of clarity in his message.  And he wrote a lot so you also need to consider the density of his mistakes.\n\nI personally found his post to be very well-written", "created_utc": "1642675887.0", "edited": "False", "id": "htfzpde", "is_submitter": "False", "link_id": "t3_s7rrv2", "parent_id": "t1_htfxq8i", "score": "8", "subreddit": "languagelearningjerk", "subreddit_id": "t5_37rt5"}, {"author": "Makqa", "body": "His English is definitely C2 judging by his writing", "created_utc": "1642673016.0", "edited": "False", "id": "htfw1p5", "is_submitter": "False", "link_id": "t3_s7rrv2", "parent_id": "t1_htcib7u", "score": "2", "subreddit": "languagelearningjerk", "subreddit_id": "t5_37rt5"}, {"author": "Makqa", "body": "Thanks, also one more question. In Yoroi my staking pool’s Ada share is already 65.6m, but when I open additional info, it says it’s 97% saturation, so not fully saturated yet, but it shows a smaller rewards amount. Why this discrepancy in numbers? Is it just a delay in updating the info?", "created_utc": "1642663342.0", "edited": "False", "id": "htfjj3a", "is_submitter": "True", "link_id": "t3_s8cjj6", "parent_id": "t1_htfid3z", "score": "2", "subreddit": "cardano", "subreddit_id": "t5_3jns3"}, {"author": "Makqa", "body": "That would be a good idea. I too get downvoted once in a while", "created_utc": "1642604198.0", "edited": "False", "id": "htboct0", "is_submitter": "False", "link_id": "t3_s7kasy", "parent_id": "t1_htbc7me", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Makqa", "body": "Personally my biggest issue is that they hardly ever prove their proficiency in all their languages. They mostly have one or two languages that they are able to speak decently and even then we don’t know for sure to what point their proficiency extends. They simply either talk to strangers on the street where the vocabulary is predictable, talk about themselves ( how old they are, where they live), or they talk about the language itself and how they have learnt it, which is also a limited display of their ability. The other languages kind of trail behind and we can barely evaluate their skills", "created_utc": "1642399581.0", "edited": "False", "id": "ht09ixs", "is_submitter": "True", "link_id": "t3_s5i91t", "parent_id": "t1_hszrvpo", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Makqa", "body": "Yeah, and MATIC’s market cap was  around 140m and not 2.5b, genius. I don’t know what has to happen for safemoon to reach 300b in market cap in the current state and overshadow Ada, Sol and get close to ETH. \n\nWith the value that those coins provide do you really believe Safemoon can compare? \n\nThat said, it doesn’t mean the whole crypto market couldn’t triple in value and make 50-100b market cap look average", "created_utc": "1641120545.0", "edited": "False", "id": "hqx7g46", "is_submitter": "False", "link_id": "t3_ru1udc", "parent_id": "t3_ru1udc", "score": "6", "subreddit": "SafeMoon", "subreddit_id": "t5_42kuwz"}, {"author": "Makqa", "body": "Hmm, es könnte ja echt sein :)", "created_utc": "1640959873.0", "edited": "False", "id": "hqol8a1", "is_submitter": "True", "link_id": "t3_ro4jnv", "parent_id": "t1_hqnzuk9", "score": "1", "subreddit": "GermanAdvanced", "subreddit_id": "t5_5fxy8r"}, {"author": "Makqa", "body": "Shadowing habe ich nie benutzt, und funktioniert es bei dir? Ich weiß nicht, ob es wirklich für die Fortgeschrittenen geeignet ist", "created_utc": "1640498267.0", "edited": "False", "id": "hpzycgj", "is_submitter": "True", "link_id": "t3_ro4jnv", "parent_id": "t1_hpztl9h", "score": "2", "subreddit": "GermanAdvanced", "subreddit_id": "t5_5fxy8r"}, {"author": "Makqa", "body": "Hängt von deinem Niveau ab. Alles was du gern magst und was du mehr oder weniger verstehen kannst. \n\nAber ich bin persönlich kein Fan vom Lernen durch Lieder, Serien usw. ( Es heißt nicht, dass ich die nie zum Lernen benutzt habe, aber sie sind nie der Hauptteil meines Lernvorgangs gewesen, und ich machte es vor allem  nur für Spaß) Man kann sich in den meisten Fällen keine seinem Niveau entsprechenden Lernstoffe verschaffen. Gewöhnlich ist das ein Durcheinander von zufälligen Informationen. Manchmal ist was auch zu leicht, oder schwierig oder einfach nicht genüg oder kann man sich auf das Lernen gar nicht konzentrieren, weil es kein System gibt.\n\nIch empfehle dir aus diesem Grund sich ein Niveau-Lehrwerk zu beschaffen. Es wird dann seriös und systematisch. \n\nAber Spaß beim Lernen ist auch wichtig!", "created_utc": "1640458630.0", "edited": "False", "id": "hpxwjjg", "is_submitter": "True", "link_id": "t3_ro4jnv", "parent_id": "t1_hpxnkx9", "score": "6", "subreddit": "GermanAdvanced", "subreddit_id": "t5_5fxy8r"}, {"author": "Makqa", "body": "In allen Übungen in den Lehrwerken, wo ich sprechen musste, sprach ich so viel wie möglich. Und obwohl ich gar keinen Gesprächspartner hatte, versuchte ich immer die beiden Standpunkte ausführlich zu vertreten. Wenn es ein Monolog war, grief ich immer allerlei Aspekte des Problems auf und beschrieb sie in kleinsten Details. Gewöhnlich musste ich immer einige neue Wörter nachschlagen, auf diese Weise hat sich auch mein Wortschatz ausgeweitet.\n\nIch habe auch nie in Deutschland gewohnt. Ich bin damit einverstanden,  dass man etwas verlieren könnte über zu viel Zeit, aber letztendlich handelt es sich beim Sprechen nicht um das Sprechen an sich, sondern vielmehr um das Hören. Du wirst ja nie alle möglichen Kontexte besprechen können, also ein Großteil des Sprechens geht einfach auf das Hören und Lesen, also auf die passive Wahrnehmung, zurück. Und die sind leicht verfügbar. Aber natürlich muss man zumindest von Zeit zu Zeit mit sich selbst sprechen. ;)", "created_utc": "1640457168.0", "edited": "False", "id": "hpxtpsc", "is_submitter": "True", "link_id": "t3_ro4jnv", "parent_id": "t1_hpxi1b0", "score": "3", "subreddit": "GermanAdvanced", "subreddit_id": "t5_5fxy8r"}, {"author": "Makqa", "body": "Tatsächlich hatte ich alle deutschen Prüfungen bestanden vor C2, also A1 bis zu C1. C1 habe ich im Oktober 2019 abgelegt. Wegen der Pandemie konnte ich im Frühling keine Prüfung ablegen. Infolgedessen konnte ich es nur wieder im Herbst 2020 machen. Also, ein Jahr insgesamt für C2. Näturlich war C2 schwerer aber ich hatte mich vor der C2-Prüfung besser gefühlt als vor C1, weil ich mich länger vorbereitet hatte. (Von B2 zu C1 habe ich ziemlich schnell - nach einem halben Jahr- überschritten und hatte dann Schwierigkeiten mit Hören). \n\nIch habe, ehrlich gesagt, nie gedacht, dass ich irgendwelches Plateau erreichte. Gerade nach dem Ablegen von C1 habe ich begonnen, mich auf C2 vorzubereiten mithilfe der Lehrwerke, nämlich „Erkundungen C2“ und „Endstation C2“. Ich habe die beiden voll abgeschlossen und war zur Prüfung bereit. \n\nJa, ich glaube C2 hat mein Selbstbewusstsein wesentlich gesteigert in Hinsicht auf meine Sprachbeherrschung. Es gibt aber immer noch die Sachen, wo ich meine Kenntnisse weiterhin verbessern wollte. \n\nIn Russland werden leider diese Prüfungen innerhalb staatlicher Einrichtungen nicht berücksichtigt, weil sie im Standard nicht einbeschlossen sind. Und die meisten, also die Lehrer und die Studierenden, achten auch nicht auf sie. C2 ist einfach für die Menschen, die davon wissen, ein Prestigeerfolg. \n\nIch habe nie Telc-Prüfungen abgelegt. Also bin mir nicht sicher über den Unterschied ;)  Aber meiner Meinung nach würde das Format keine große Rolle spielen.\n\nDie letzte Frage ist echt interessant. Aus meiner Erfahrung ist es fast unmöglich eine Sprache zu vergessen. Ich meine, theoretisch könnte es mal passieren dass man seine Sprachfähigkeit verliert, aber das wäre ein Extremfall. Wenn man C2 erreicht, ist es nicht schwer sich etwas auf YouTube anzuhören oder ein Buch zu lesen. Ich habe persönlich zwar im letzten Jahr Deutsch intensiv nicht gelernt, aber dank den Sendungen, Videospielen, Liedern und Büchern hat sich mein Sprachniveau nur verbessert.", "created_utc": "1640422493.0", "edited": "1640450017.0", "id": "hpwftu8", "is_submitter": "True", "link_id": "t3_ro4jnv", "parent_id": "t1_hpwakoy", "score": "12", "subreddit": "GermanAdvanced", "subreddit_id": "t5_5fxy8r"}, {"author": "Makqa", "body": "Damn, you are right, guys. Thanks", "created_utc": "1639488226.0", "edited": "False", "id": "hoiaq9t", "is_submitter": "False", "link_id": "t3_rg79gq", "parent_id": "t3_rg79gq", "score": "2", "subreddit": "SafeMoon", "subreddit_id": "t5_42kuwz"}, {"author": "Makqa", "body": "New Lexus ES 250", "created_utc": "1639071046.0", "edited": "False", "id": "hnvj505", "is_submitter": "False", "link_id": "t3_rc4lq7", "parent_id": "t3_rc4lq7", "score": "1", "subreddit": "cars", "subreddit_id": "t5_2qhl2"}, {"author": "Makqa", "body": "Don’t guess, just take the exam. If you pass, then you are B2", "created_utc": "1634923706.0", "edited": "False", "id": "hhn7sdg", "is_submitter": "False", "link_id": "t3_qdg9ho", "parent_id": "t3_qdg9ho", "score": "4", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Makqa", "body": "Yes, I agree music is difficult to define like this and this is why I was referring in the previous comment to Hozier‘s „Take me to Church“ and „Better love“. This music I would say is a solid C1.\n\nAnd I totally agree with you on the language learning cycle thing and maintenance. It’s also funny that many people speak of maintenance when they are not even close to C2.  Well, as long as you are not C2, reaching C2 should be your goal", "created_utc": "1633641233.0", "edited": "1633641735.0", "id": "hfrzwve", "is_submitter": "False", "link_id": "t3_q2qubq", "parent_id": "t1_hfrx4ux", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Makqa", "body": "Absolutely!!! Such a plain truth which, nevertheless, is seemingly overlooked by 98% of people who ever go about learning a language", "created_utc": "1633638019.0", "edited": "False", "id": "hfrsc21", "is_submitter": "False", "link_id": "t3_q2qubq", "parent_id": "t1_hfrqzkj", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Makqa", "body": "The C2 french exam doesn’t have a separate reading part, lol. ( Les parties sont fusionnées). So I am wondering where your C2 comes from. But even if you do have C2 I wholeheartedly congratulate you, achieving C2 is nothing short of remarkable. \n\nAnyway, the point of this argument was initially not who speaks more languages, but where the „fun“ part starts in languages.  But since you asked, I can tell you my french is already C2, I say it 100% certainty because in May I sat the official exam and failed only by 9.5 points. After having studied for around a year and a half. I got 40.5/100 where as you need 50/100 to pass. Since May i‘ve been studying french extensively and am 100% sure I‘ve already covered this 9.5 difference.  And I‘m taking the C2 exam again in December to confirm it. \n\nNow that aside, regarding the post itself. The OP clearly asks when the grind part stops and where the enjoyable part begins. \nListen, if you‘ve been studying some languages through A1 to C, which as far as I can see by your flair you have, you should be familiar with what language ability looks like at each level. A1, A2 and B1 are by ANY DEFINITION nowhere near the point where you can easily immerse yourself in native content and have no difficulty. Even at B1 your ability is still very limited - you only can communicate in a simple way about basic things and interests. \n\nOk, by your logic what would any fun activity be when you are, say, A2 like the OP assumes to be? Counting to ten on fingers? Talking about the weather? Listening to two friends talking about their day in school? Writing post cards? Reading post cards? Probably not. And then if not, you need to face the fact that until you reach C1 or even better C2, you will still not be able to enjoy the language IN THE WAYS THAT YOU INITIALLY IMAGINED when you set out to learn this language ( which includes music, films, video games, books, meaningful conversations etc. ) So now you have the tough reality where you have to grind through B1 and B2 where you have to learn a shit load of words and grammar...\n\nAnd then finally getting close to C1 you‘ll start to see the light at the end of the tunnel. Don’t get me wrong: getting from c1 to c2 also requires learning a lot of words and stuff, but the most defining chunk of the language is already past you and you can enjoy it.\n\nOk, you can’t see what’s it’s like to read „le rouge et le noir“ while you are b1. Go and find something else „fun“ to do in Japanese. B1 in Japanese is decent but the best you can do is listen to simple songs still missing many things at times or read occasional comments on YouTube.  It also seems you‘re new to Chinese so go and try to do something fun in Chinese then. \n\nAgain, it doesn’t mean you can’t enjoy the process of learning itself, but the OP asks for an answer to the question: „when does learning a language become more like a pleasant walk in the park rather than slogging your ass off mining coal“. The answer is C1 or at least a solid B2, but, then...  when you reach C2 once in any language  you‘ll realise that anything lower is a joke.", "created_utc": "1633625339.0", "edited": "False", "id": "hfqxlmi", "is_submitter": "False", "link_id": "t3_q2qubq", "parent_id": "t1_hfqlh89", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Makqa", "body": "Yeah, looks like a rifle, exactly what 刀 is, right?", "created_utc": "1633617309.0", "edited": "False", "id": "hfqe8pf", "is_submitter": "False", "link_id": "t3_q2zf8e", "parent_id": "t1_hfonosq", "score": "8", "subreddit": "LearnJapanese", "subreddit_id": "t5_2qyls"}, {"author": "Makqa", "body": "I‘ve passed C2 in German so I can help. Regarding the textbooks, literally all the words you need are in these textbooks.  Say, if you are a2 at the moment, then you go and pick up a b1 textbook.  It‘s going to have all the content necessary for reaching b1, vocabulary, grammar etc. Work through every exercise in the book (reading, writing, listening and speaking) then go and take a B1 exam. If you pass, which you certainly will if you’ve worked through every exercise, you can move on to b2 and pick up a b2 textbook. The same way until C2. I personally used „Sicher!“ textbooks for going from B1 to C1. If you need a1 and a2 textbooks  then you can use „Schritte“. For C2 you could use „Erkundungen“ and „EndStation“", "created_utc": "1633616115.0", "edited": "False", "id": "hfqbjwj", "is_submitter": "False", "link_id": "t3_q2qubq", "parent_id": "t1_hfqae4w", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Makqa", "body": "I personally just work through the textbooks in my target language from A1 gradually to C2. What language are you learning?", "created_utc": "1633615434.0", "edited": "False", "id": "hfqa34j", "is_submitter": "False", "link_id": "t3_q2qubq", "parent_id": "t1_hfq9ite", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Makqa", "body": "Taking exams in order to understand how different levels correlate to real life activities has nothing to do with us judging what is fun or not fun. \n\nI said explicitly c1 or c2 because i‘ve taken plenty of these exams from A1 to C2 and know how „it feels“ to be at each particular level.  Whether they have fun or not is up to them. But I just said „c1 or c2“ and people downvoted me somehow while I gave quite an objective evaluation of which levels correspond to what most people consider „fun“ in a language. That includes films, video games, anime, music, reading books etc. \n\n(Yeah I didn’t mention music and literature specifically, but you would need at least a solid B2 close to C1 to start to understand, to at least some degree, the nuances of more complex songs in terms of lyrics like  Hovier’s „Take me to church“ or „Better Love“, for example. The lyrics of these songs are charged with metaphorical sense and advanced vocabulary, you just wouldn’t understand it if you had a lower level.  \n\nSpeaking of literature, try reading „Le Rouge er le Noir“ in the original being anywhere lower than a solid C1, that wouldn’t be fun at all. So you see my point.)\n\nSo if people have fun each in their own way at A2, so be it. That’s good people can find enjoyment in a language even if they are not very proficient at it, because it motivates them eventually, but if someone objects to me (in this case downvotes) saying that C1 and C2 are where the most fun is, then they clearly don’t understand what each level involves", "created_utc": "1633603200.0", "edited": "1633603609.0", "id": "hfpoug7", "is_submitter": "False", "link_id": "t3_q2qubq", "parent_id": "t1_hfplpnz", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Makqa", "body": "They probably haven’t really taken any exams so they can’t judge properly. As you said B2 is  a bare minimum and even then it’s a long way before you get to enjoy a lot of native content. I mean I tried playing Skyrim when I was b1 in french. And i had to look up so many words I got tired of it pretty quickly. I don’t know what people mean by „having fun“ if they are not at least B2. \n\nWatching movies in the original? Well, may depend on the movie, but generally at least C1 and even then you’ll have to read subtitles a lot and \nlook up new vocabulary.\n\nPlaying videogames? Again depends on the game, but no one is going to make a game easier to understand for language-learners. At c1 in french I used to play „dishonoured“ and there were many words I didn’t know. Honestly, sometimes I felt like there were too many. \n\nWatching anime? Good luck doing that at b1 or even b2, especially in Japanese or Chinese where the non-knowledge of a character translates into a bigger lack of understanding than not knowing a word, say, in German. Stil, too much learning curve. \n\nAnd you should forget about listening to native tv news or shows or programmes until you are at least C1. People are talking way too fast using  rich vocabulary and all the grammar you could possibly find in the grammar book. I remember as C1 in German I could understand the news and and news programmes in general but still struggled considerably\n\nSo yeah, I don’t know what fun there is until you are C1 or at a bare minimum solid B2. Doesn’t mean you won’t get to enjoy the learning process as such even at A1 or A2, but that’s a different thing.", "created_utc": "1633594023.0", "edited": "False", "id": "hfpez5u", "is_submitter": "False", "link_id": "t3_q2qubq", "parent_id": "t1_hfom1z9", "score": "6", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Makqa", "body": "At c1, but better c2", "created_utc": "1633558136.0", "edited": "False", "id": "hfnp19p", "is_submitter": "False", "link_id": "t3_q2qubq", "parent_id": "t3_q2qubq", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Makqa", "body": "Just invest in cardano and chill", "created_utc": "1632482678.0", "edited": "False", "id": "he2u13z", "is_submitter": "False", "link_id": "t3_puget7", "parent_id": "t3_puget7", "score": "2", "subreddit": "CryptoCurrency", "subreddit_id": "t5_2wlj3"}, {"author": "Makqa", "body": "Yeah, I agree", "created_utc": "1631338608.0", "edited": "False", "id": "hcekn2b", "is_submitter": "False", "link_id": "t3_plk3o3", "parent_id": "t1_hce62j4", "score": "4", "subreddit": "SafeMoon", "subreddit_id": "t5_42kuwz"}, {"author": "Makqa", "body": "I love how he is so ostentatiously positioning the fact that „My DeFi journey does not end here, it is just beginning“. Ummm....\n\nSorry, but your journey has come to an end. Good for him that he‘s made millions and is now walking away, but i‘m not investing in anything associated with him from this point onward. \n\n„my name is Jack Haines the CEO of“... Yeah, yeah, what a peacock. Seriously, looks like nowadays any kid wants to call themselves a CEO of something.", "created_utc": "1631281321.0", "edited": "False", "id": "hcb78lr", "is_submitter": "False", "link_id": "t3_plk3o3", "parent_id": "t3_plk3o3", "score": "224", "subreddit": "SafeMoon", "subreddit_id": "t5_42kuwz"}, {"author": "Makqa", "body": "What annoys me is that Wallace has got his profile ticked on Twitter and Tony, aka JRNY Crypto, hasn‘t. Wallace offers no value whatsoever.", "created_utc": "1631277997.0", "edited": "False", "id": "hcb0f0t", "is_submitter": "False", "link_id": "t3_pkynne", "parent_id": "t3_pkynne", "score": "1", "subreddit": "SafeMoon", "subreddit_id": "t5_42kuwz"}, {"author": "Makqa", "body": "Thank you for such a thorough response!  Absolutely, if it’s a different language there will always be a learning curve especially if we are talking about speaking. Especially in a language like Korean with its own outlandish writing system. \n\nBut it does encourage me much more if there are even some similarities. I remember how difficult it was to get into Chinese where there are absolutely no reference points with the languages I knew before that. And when I started to learn Japanese, although it’s still a very difficult language, I realised how much of a help it was to me that I could recognise a good deal of Japanese characters, and even if I didn’t know the characters as such, the strokes in characters are still the same and repeat themselves, which means that I have to make much less effort to memorise a certain character. Besides, although far from being mutually intelligible, the Chinese pronunciation does help to learn the Japanese pronounciation a little bit, even if the similarities are rather vague. There’s still some sort of  ‘direction’ in your memory that aligns those two languages for you. \n\nChinese is overwhelming as hell in my opinion. Japanese is overwhelming as hell as well. And Korean would be overwhelming as hell. But when you know you’ve already done some part of the way it’s eases your mind and gives you confidence!\n\nGood luck with your Japanese exam!", "created_utc": "1631032523.0", "edited": "False", "id": "hby65de", "is_submitter": "True", "link_id": "t3_phqqsb", "parent_id": "t1_hbskyh8", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Makqa", "body": "That’s good to hear, your words encourage me!", "created_utc": "1630761822.0", "edited": "False", "id": "hbkdtko", "is_submitter": "True", "link_id": "t3_phqqsb", "parent_id": "t1_hbkdh5t", "score": "7", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Makqa", "body": "Thanks! I guess there’s only one way to find out how similar they are - studying it", "created_utc": "1630760912.0", "edited": "False", "id": "hbkc59x", "is_submitter": "True", "link_id": "t3_phqqsb", "parent_id": "t1_hbkb1yp", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Makqa", "body": "Thanks for a reply! I do hope Korean to Chinese and Japanese together will be like French to Italian, because I’d want Korean to be a relatively easy language for me. Its writing system looks so enchanting and alien-like that i‘d want to understand how these characters function in a language!", "created_utc": "1630760596.0", "edited": "False", "id": "hbkblha", "is_submitter": "True", "link_id": "t3_phqqsb", "parent_id": "t1_hbkads0", "score": "5", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Makqa", "body": "I mean in theory you could  study 4 of them at the same time. But then it would take you around 10 hours minimum per day to make good progress. 2.5 hours per each language. I think you will burn out very quickly. As others have suggested, I do think it’s reasonable to drop Czech because if you know Russian well its knowledge will translate into Czech for you. Unless you need to be like proficient in them both, which is probably not the case.", "created_utc": "1630759368.0", "edited": "False", "id": "hbk9iqv", "is_submitter": "False", "link_id": "t3_phdhbu", "parent_id": "t3_phdhbu", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Makqa", "body": "coz it do be like that", "created_utc": "1630758963.0", "edited": "False", "id": "hbk8vlw", "is_submitter": "False", "link_id": "t3_phpxkl", "parent_id": "t3_phpxkl", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Makqa", "body": "Moscow 👀", "created_utc": "1630169890.0", "edited": "False", "id": "hap9f78", "is_submitter": "False", "link_id": "t3_pd9q27", "parent_id": "t3_pd9q27", "score": "1", "subreddit": "SafeMoon", "subreddit_id": "t5_42kuwz"}, {"author": "Makqa", "body": "You can use the textbook „Discover China“, it has four books which lead you from A1 to B2, each for a level respectively. I personally self-studied through all the four books.", "created_utc": "1629639457.0", "edited": "False", "id": "h9wovhh", "is_submitter": "False", "link_id": "t3_p8txnt", "parent_id": "t3_p8txnt", "score": "1", "subreddit": "ChineseLanguage", "subreddit_id": "t5_2qyz1"}, {"author": "Makqa", "body": "Thanks for a reply! I see", "created_utc": "1629637232.0", "edited": "False", "id": "h9wku8w", "is_submitter": "False", "link_id": "t3_p6zie3", "parent_id": "t1_h9ouyth", "score": "1", "subreddit": "whatcarshouldIbuy", "subreddit_id": "t5_2ys2t"}, {"author": "Makqa", "body": "Yeah, yoke is a joke. They should have at least made an attachable top bar so you can choose between a round wheel and a yoke.", "created_utc": "1629398152.0", "edited": "False", "id": "h9kbs0o", "is_submitter": "False", "link_id": "t3_p6zie3", "parent_id": "t1_h9k9cr0", "score": "1", "subreddit": "whatcarshouldIbuy", "subreddit_id": "t5_2ys2t"}, {"author": "Makqa", "body": "I see, so you drive a Tesla. What do you think about the seats, I’ve heard somewhere they are the most comfortable ever, is it true?", "created_utc": "1629354321.0", "edited": "False", "id": "h9i4sqr", "is_submitter": "False", "link_id": "t3_p6zie3", "parent_id": "t1_h9gu7ao", "score": "1", "subreddit": "whatcarshouldIbuy", "subreddit_id": "t5_2ys2t"}, {"author": "Makqa", "body": "Yeah, recently I’ve really been bent on rather buying a Lexus. Especially because I live in Russia and in Russia charging stations don’t work properly half of the times, plus the autopilot can’t be used here because of the policies. And also the standard range plus model shouldn’t be used in strong colds, so you are literally forced to buy a model 3 for 60k", "created_utc": "1629323271.0", "edited": "False", "id": "h9ghrk1", "is_submitter": "False", "link_id": "t3_p6zie3", "parent_id": "t1_h9ggrmb", "score": "1", "subreddit": "whatcarshouldIbuy", "subreddit_id": "t5_2ys2t"}, {"author": "Makqa", "body": "Haha", "created_utc": "1629322711.0", "edited": "False", "id": "h9ggk5q", "is_submitter": "False", "link_id": "t3_p6zie3", "parent_id": "t1_h9gg3nh", "score": "1", "subreddit": "whatcarshouldIbuy", "subreddit_id": "t5_2ys2t"}, {"author": "Makqa", "body": "This is why for me the ‘ electric vehicle’ is associated with ‘tesla’.  But recently I started questioning the ev as such", "created_utc": "1629320429.0", "edited": "False", "id": "h9gbm6h", "is_submitter": "False", "link_id": "t3_p6zie3", "parent_id": "t1_h9gaxc6", "score": "2", "subreddit": "whatcarshouldIbuy", "subreddit_id": "t5_2ys2t"}, {"author": "Makqa", "body": "I thought Tesla is the best in electric cars market", "created_utc": "1629318844.0", "edited": "False", "id": "h9g82tt", "is_submitter": "False", "link_id": "t3_p6zie3", "parent_id": "t1_h9g7mfp", "score": "1", "subreddit": "whatcarshouldIbuy", "subreddit_id": "t5_2ys2t"}, {"author": "Makqa", "body": "I do blab on I know, sorry", "created_utc": "1629318776.0", "edited": "False", "id": "h9g7xe0", "is_submitter": "False", "link_id": "t3_p6zie3", "parent_id": "t1_h9g7o64", "score": "3", "subreddit": "whatcarshouldIbuy", "subreddit_id": "t5_2ys2t"}, {"author": "Makqa", "body": "Will the AMA take place on Twitch as usual?", "created_utc": "1628424955.0", "edited": "False", "id": "h85u8ff", "is_submitter": "False", "link_id": "t3_p036l4", "parent_id": "t3_p036l4", "score": "2", "subreddit": "SafeMoon", "subreddit_id": "t5_42kuwz"}, {"author": "Makqa", "body": "Thank you for such a thorough reply!", "created_utc": "1628414150.0", "edited": "False", "id": "h85hhf1", "is_submitter": "False", "link_id": "t3_p0aek4", "parent_id": "t1_h85ftt9", "score": "2", "subreddit": "CryptoCurrency", "subreddit_id": "t5_2wlj3"}, {"author": "Makqa", "body": "I first read it in the white paper a while ago and couldn’t  quite understand it, now it’s more clear. Thanks a bunch!", "created_utc": "1628409738.0", "edited": "False", "id": "h85clvx", "is_submitter": "False", "link_id": "t3_p0aek4", "parent_id": "t1_h85cdaz", "score": "1", "subreddit": "CryptoCurrency", "subreddit_id": "t5_2wlj3"}, {"author": "Makqa", "body": "Thanks for the link! I will check it out", "created_utc": "1628409354.0", "edited": "False", "id": "h85c5y0", "is_submitter": "False", "link_id": "t3_p0aek4", "parent_id": "t1_h85bdnx", "score": "2", "subreddit": "CryptoCurrency", "subreddit_id": "t5_2wlj3"}, {"author": "Makqa", "body": "Yeah, I knew that. Apparently I missed the supply part. So basically any coin could be valued the same as Bitcoin if it had 12million coins in total, it’s just that people wouldn’t start to buy a copy of Bitcoin for no reason while Bitcoin has already built hype and people continue to buy?", "created_utc": "1628409231.0", "edited": "False", "id": "h85c0rf", "is_submitter": "False", "link_id": "t3_p0aek4", "parent_id": "t1_h85bgge", "score": "2", "subreddit": "CryptoCurrency", "subreddit_id": "t5_2wlj3"}, {"author": "Makqa", "body": "I know I know but I’m more in on ada", "created_utc": "1628408580.0", "edited": "False", "id": "h85b9e3", "is_submitter": "False", "link_id": "t3_p0aek4", "parent_id": "t1_h85azgm", "score": "2", "subreddit": "CryptoCurrency", "subreddit_id": "t5_2wlj3"}, {"author": "Makqa", "body": "Oh, so like each Bitcoin bought would move the price by more dollars?", "created_utc": "1628408499.0", "edited": "False", "id": "h85b5uu", "is_submitter": "False", "link_id": "t3_p0aek4", "parent_id": "t1_h85b1m1", "score": "2", "subreddit": "CryptoCurrency", "subreddit_id": "t5_2wlj3"}, {"author": "Makqa", "body": "Pretty self-explanatory  xD", "created_utc": "1628408394.0", "edited": "False", "id": "h85b1hz", "is_submitter": "False", "link_id": "t3_p0aek4", "parent_id": "t1_h85av6k", "score": "0", "subreddit": "CryptoCurrency", "subreddit_id": "t5_2wlj3"}, {"author": "Makqa", "body": "„...кто просто любит жизнь...“", "created_utc": "1627929041.0", "edited": "False", "id": "h7gi10h", "is_submitter": "False", "link_id": "t3_ovmi75", "parent_id": "t1_h7d1jlz", "score": "2", "subreddit": "Pikabu", "subreddit_id": "t5_2tzr0"}, {"author": "Makqa", "body": "«Этот парень был из тех...»\n\nКхм... ну, вы поняли", "created_utc": "1627816630.0", "edited": "False", "id": "h7awd8l", "is_submitter": "False", "link_id": "t3_ovmi75", "parent_id": "t3_ovmi75", "score": "1", "subreddit": "Pikabu", "subreddit_id": "t5_2tzr0"}, {"author": "Makqa", "body": "Yeah, I agree", "created_utc": "1627747669.0", "edited": "False", "id": "h77qo3w", "is_submitter": "False", "link_id": "t3_ov3yzj", "parent_id": "t1_h77q2zz", "score": "1", "subreddit": "SafeMoon", "subreddit_id": "t5_42kuwz"}, {"author": "Makqa", "body": "They don’t realise that just because you wrote “that’s suspicious”, you are not gonna panic sell or spit venom. Apparently they are not familiar with the idea of weighing your decision in numerous aspects, reevaluating it when new info appears and being cautious. I personally invested around 2k and am now down to around 750$. I still do have faith in the project, although there are a million and one things I don’t like about it right now.  And so I do treat that 2k as a write-off, and am waiting calmly for the important things to happen, if they do happen that is. If not, well... it’s only a fraction of what I can afford to lose, but if the potential is to make that 2k at least into 20k, or as some people think it might reach one cent, than I guess it’s be dumber for me not to take a bet like this than to lose 2k.", "created_utc": "1627746909.0", "edited": "False", "id": "h77p3dy", "is_submitter": "False", "link_id": "t3_ov3yzj", "parent_id": "t1_h77mxo2", "score": "2", "subreddit": "SafeMoon", "subreddit_id": "t5_42kuwz"}, {"author": "Makqa", "body": "Jeez, you simply wrote “that’s suspicious”, which is an absolutely normal statement in a situation like that, with no direct hate or fud towards the project, and you still get downvoted heavily. This community is pathetic, they literally have no brain.", "created_utc": "1627745475.0", "edited": "False", "id": "h77m5tw", "is_submitter": "False", "link_id": "t3_ov3yzj", "parent_id": "t1_h76qziz", "score": "-1", "subreddit": "SafeMoon", "subreddit_id": "t5_42kuwz"}, {"author": "Makqa", "body": "YouTube sounds neutral as well as Facebook. I know there’s no accounting for taste, but the name safemoon in the context of the current crypto space is connotative of “a shitcoin”. This is the issue I at least have with safemoon", "created_utc": "1627661278.0", "edited": "False", "id": "h73iivr", "is_submitter": "False", "link_id": "t3_oukhhs", "parent_id": "t1_h73c1bt", "score": "1", "subreddit": "SafeMoon", "subreddit_id": "t5_42kuwz"}, {"author": "Makqa", "body": "What I like about safemoon is the colours and the logo. The design of the wallet, based on what has been shown so far, is great as well, simple and tasteful. I also appreciate the AMA intros.\n\nBut the name sucks. If safemoon had been the first crypto ever I wouldn’t complain because no one was supposed to know what kind of bog the crypto space would become. But now that it has become a bog with thousands of shitcoins going off the same narrative and using the same cliches and advertisement tricks for adoption, this name starts to smell and I don’t like it. \n\nDo we even all realise that half the FUD directed at SafeMoon is incentivised by a poorly chosen name? The moment you hear or see the name safemoon for the first time, it doesn’t look like a serious business and gets labeled as scam. \n\nAs I said in the post: of course, the real things will decide the fate of the coin, not the words, but taking a more suitable mature name for a coin such as safemoon would produce significantly more credibility and wouldn’t cost a big effort.", "created_utc": "1627661036.0", "edited": "False", "id": "h73hyip", "is_submitter": "False", "link_id": "t3_oukhhs", "parent_id": "t1_h73d09y", "score": "2", "subreddit": "SafeMoon", "subreddit_id": "t5_42kuwz"}, {"author": "Makqa", "body": "Actually... aesthetics are important too!", "created_utc": "1627657600.0", "edited": "1627657889.0", "id": "h739jhp", "is_submitter": "False", "link_id": "t3_oukhhs", "parent_id": "t1_h738p4q", "score": "1", "subreddit": "SafeMoon", "subreddit_id": "t5_42kuwz"}, {"author": "Makqa", "body": "A part of me hopes it will get me money, but yeah... \n\nIf you think your idea is solid then you should also give it a solid name. Imagine if Tesla was called “Sexy Cars” from the start.", "created_utc": "1627656718.0", "edited": "False", "id": "h737jy7", "is_submitter": "False", "link_id": "t3_oukhhs", "parent_id": "t1_h735nhr", "score": "1", "subreddit": "SafeMoon", "subreddit_id": "t5_42kuwz"}, {"author": "Makqa", "body": "All these three sound neutral and didn’t try to create big expectations with a few loud words. They did it with their actions. \n\n“The name google comes from the word googol which means a number equal to 10 to the 100th power, or more colloquially an unfathomable number”.  So you see the name represents in a neutral elegant way its mission to make available “a seemingly infinite amount of information on the web”\n\nSafemoon comes off as flashy and attention-seeking", "created_utc": "1627655536.0", "edited": "False", "id": "h734wni", "is_submitter": "False", "link_id": "t3_oukhhs", "parent_id": "t1_h732xpx", "score": "1", "subreddit": "SafeMoon", "subreddit_id": "t5_42kuwz"}, {"author": "Makqa", "body": "Yes, i also thought it was a scam first, let’s hope it won’t be", "created_utc": "1627654594.0", "edited": "False", "id": "h732uht", "is_submitter": "False", "link_id": "t3_oukhhs", "parent_id": "t1_h732bmy", "score": "2", "subreddit": "SafeMoon", "subreddit_id": "t5_42kuwz"}, {"author": "Makqa", "body": "I agree if everything goes as promised it’ll be a good thing for everyone, but the sentiment that the name initially gives off is not that of a solid project. They could call their coin “ Evolutrix” or something like that. \nThe name safemoon by itself suggests that people should expect to get to the “moon” quickly. Yes, if you do your research you’ll learn about what it is - reflections and “freedom of the unbanked” etc, but unless you do so, the name will always sound like a get-rich-quick scheme.", "created_utc": "1627654251.0", "edited": "False", "id": "h73240f", "is_submitter": "False", "link_id": "t3_oukhhs", "parent_id": "t1_h7317xx", "score": "2", "subreddit": "SafeMoon", "subreddit_id": "t5_42kuwz"}, {"author": "Makqa", "body": "But unlike the companies you mentioned, with its name safemoon tries to tap into the trend of making a quick buck, which cheapens it", "created_utc": "1627653660.0", "edited": "False", "id": "h730uzl", "is_submitter": "False", "link_id": "t3_oukhhs", "parent_id": "t1_h72yu41", "score": "1", "subreddit": "SafeMoon", "subreddit_id": "t5_42kuwz"}, {"author": "Makqa", "body": "But both Cardano and Ada sound neutral. And you wouldn’t be able to avoid saying “Safemoon” forever", "created_utc": "1627653415.0", "edited": "False", "id": "h730cb8", "is_submitter": "False", "link_id": "t3_oukhhs", "parent_id": "t1_h72yful", "score": "3", "subreddit": "SafeMoon", "subreddit_id": "t5_42kuwz"}, {"author": "Makqa", "body": "Safemoon doesn’t sound better than doge or shiba to me.  And you only think of the fact that it moons? Any solid project will moon eventually. You don’t need to name it something childish", "created_utc": "1627653178.0", "edited": "False", "id": "h72zu3r", "is_submitter": "False", "link_id": "t3_oukhhs", "parent_id": "t1_h72yyfd", "score": "0", "subreddit": "SafeMoon", "subreddit_id": "t5_42kuwz"}, {"author": "Makqa", "body": "They had a vision to be a big company so why not. Besides you could be a network of books so it’s also fine", "created_utc": "1627652855.0", "edited": "False", "id": "h72z5n8", "is_submitter": "False", "link_id": "t3_oukhhs", "parent_id": "t1_h72yl3d", "score": "1", "subreddit": "SafeMoon", "subreddit_id": "t5_42kuwz"}, {"author": "Makqa", "body": "Surely now one would ever question your wisdom", "created_utc": "1627652649.0", "edited": "1627657278.0", "id": "h72yq3u", "is_submitter": "False", "link_id": "t3_oukhhs", "parent_id": "t1_h72xwj5", "score": "0", "subreddit": "SafeMoon", "subreddit_id": "t5_42kuwz"}, {"author": "Makqa", "body": "Amazon makes some sense. It sounds neutral and refers to the length of the river that this network of delivery is supposed to resemble", "created_utc": "1627652354.0", "edited": "False", "id": "h72y4c4", "is_submitter": "False", "link_id": "t3_oukhhs", "parent_id": "t1_h72x2fw", "score": "1", "subreddit": "SafeMoon", "subreddit_id": "t5_42kuwz"}, {"author": "Makqa", "body": "And I’d say you are wrong \n\nRegards.\n\n\n\n(Those people who downvoted this comment, don’t you see I mirrored this guy’s messages on purpose?)", "created_utc": "1627652081.0", "edited": "1627657827.0", "id": "h72xkdc", "is_submitter": "False", "link_id": "t3_oukhhs", "parent_id": "t1_h72xfuj", "score": "-2", "subreddit": "SafeMoon", "subreddit_id": "t5_42kuwz"}, {"author": "Makqa", "body": "Wouldn’t you like a crypto to sound more legitimate in the long run?", "created_utc": "1627652004.0", "edited": "False", "id": "h72xeo4", "is_submitter": "False", "link_id": "t3_oukhhs", "parent_id": "t1_h72wrmf", "score": "4", "subreddit": "SafeMoon", "subreddit_id": "t5_42kuwz"}, {"author": "Makqa", "body": "No it doesn’t", "created_utc": "1627651957.0", "edited": "False", "id": "h72xbat", "is_submitter": "False", "link_id": "t3_oukhhs", "parent_id": "t1_h72x5og", "score": "3", "subreddit": "SafeMoon", "subreddit_id": "t5_42kuwz"}, {"author": "Makqa", "body": "Машина зверь, ради неё только и держу сэйфмун🔥🔥🔥", "created_utc": "1622839254.0", "edited": "False", "id": "h0m0enu", "is_submitter": "False", "link_id": "t3_ns7wey", "parent_id": "t3_ns7wey", "score": "1", "subreddit": "SafeMoon", "subreddit_id": "t5_42kuwz"}, {"author": "Makqa", "body": "They won’t listen", "created_utc": "1622787856.0", "edited": "False", "id": "h0jdhrp", "is_submitter": "False", "link_id": "t3_nrn6dt", "parent_id": "t1_h0iq9z5", "score": "5", "subreddit": "SafeMoon", "subreddit_id": "t5_42kuwz"}, {"author": "Makqa", "body": "Bunch of idiots, you can’t tell one fact from the other, or what? Investing is not difficult. I started when I had around 3k more than a year ago. I put it all in Tesla and it got quadrupled. Now I have around 12k in Ada and 2k in safemoon. Tell me please what‘s so difficult about getting  into a stock or a coin? You just put your money in and .... wait. If you’re not too stupid to sell at the slightest downturn you will win regardless. \n\nSecond, you are telling me that working to get enough money to invest is so difficult. How much do you need to invest? I mean in crypto you can even start with 100 bucks. If you work i assume you are talking about a few thousand dollars at least for your initial budget, but even so tell me please, how is earning that much money „blood, sweat and tears“? You can work for a few months and then go to crypto with this money. It’s enough already. Then, if you start making money in investing then it no longer makes sense for you to „blood, sweat and tears“ because the portion of the money you make through working will be insignificant, considering that you also have to work 8/5 for it, in relation to what you will earn off investing. \n\nYou say some people are rich and you are not, but that’s less than 1% of people. Most people around you have the same work situation and get tired just as much, but they don’t know about investing opportunities. And you do, so you are already much better off than these people. So yeah, you may work to get some money to invest, but it’s nothing extraordinary, and when you do invest it doesn’t take a big brain to see which asset to pick. \n\nDon‘t overdramatise your life and investing in particular.", "created_utc": "1622787491.0", "edited": "False", "id": "h0jczzj", "is_submitter": "False", "link_id": "t3_nrn6dt", "parent_id": "t1_h0ialk9", "score": "2", "subreddit": "SafeMoon", "subreddit_id": "t5_42kuwz"}, {"author": "Makqa", "body": "Ok, but investing itself is not difficult", "created_utc": "1622754321.0", "edited": "False", "id": "h0hju1z", "is_submitter": "False", "link_id": "t3_nrn6dt", "parent_id": "t1_h0hj0ps", "score": "-7", "subreddit": "SafeMoon", "subreddit_id": "t5_42kuwz"}, {"author": "Makqa", "body": "I wouldn’t say investing in crypto is blood and sweat, but ok", "created_utc": "1622753826.0", "edited": "False", "id": "h0hiq14", "is_submitter": "False", "link_id": "t3_nrn6dt", "parent_id": "t3_nrn6dt", "score": "-4", "subreddit": "SafeMoon", "subreddit_id": "t5_42kuwz"}, {"author": "Makqa", "body": "Btw, who do you main?", "created_utc": "1622107772.0", "edited": "False", "id": "gzm94jz", "is_submitter": "False", "link_id": "t3_nm1gnx", "parent_id": "t1_gzm8npc", "score": "1", "subreddit": "ForHonorRants", "subreddit_id": "t5_3jk0e"}, {"author": "Makqa", "body": "It rarely works like this. You can interrupt orochi with lights but kensei can get away due to his diverse moveset", "created_utc": "1622107714.0", "edited": "False", "id": "gzm92fl", "is_submitter": "False", "link_id": "t3_nm1gnx", "parent_id": "t1_gzm8npc", "score": "1", "subreddit": "ForHonorRants", "subreddit_id": "t5_3jk0e"}, {"author": "Makqa", "body": "I don’t know what issues outside you are talking about. I’ve consistently lost to almost every kensei, while not experiencing many problems against every other character except for gryphon maybe and sometimes highlander.", "created_utc": "1622107140.0", "edited": "False", "id": "gzm8h5j", "is_submitter": "False", "link_id": "t3_nm1gnx", "parent_id": "t1_gzm1etc", "score": "1", "subreddit": "ForHonorRants", "subreddit_id": "t5_3jk0e"}, {"author": "Makqa", "body": "@kensei main", "created_utc": "1622100326.0", "edited": "False", "id": "gzm1cpr", "is_submitter": "False", "link_id": "t3_nm1gnx", "parent_id": "t1_gzm18sg", "score": "1", "subreddit": "ForHonorRants", "subreddit_id": "t5_3jk0e"}, {"author": "Makqa", "body": "Binance", "created_utc": "1621669968.0", "edited": "False", "id": "gz1abjz", "is_submitter": "False", "link_id": "t3_ni2yc7", "parent_id": "t1_gz19uyx", "score": "1", "subreddit": "CryptoMarkets", "subreddit_id": "t5_2z2wm"}, {"author": "Makqa", "body": "Best feeling ever", "created_utc": "1621669948.0", "edited": "False", "id": "gz1aav6", "is_submitter": "False", "link_id": "t3_ni2yc7", "parent_id": "t1_gz16pbx", "score": "2", "subreddit": "CryptoMarkets", "subreddit_id": "t5_2z2wm"}, {"author": "Makqa", "body": "Why no green colour? Green would look slick imao", "created_utc": "1621199319.0", "edited": "False", "id": "gyd96zk", "is_submitter": "False", "link_id": "t3_ndwpl7", "parent_id": "t3_ndwpl7", "score": "1", "subreddit": "SafeMoon", "subreddit_id": "t5_42kuwz"}, {"author": "Makqa", "body": "Gosh, some really dumb people out there thinking Elon wanted to shaft everyone", "created_utc": "1621198611.0", "edited": "False", "id": "gyd7mfv", "is_submitter": "False", "link_id": "t3_ndh93e", "parent_id": "t3_ndh93e", "score": "1", "subreddit": "binance", "subreddit_id": "t5_3mdot"}, {"author": "Makqa", "body": "I agree it’s good you don’t play anything else", "created_utc": "1621192979.0", "edited": "False", "id": "gycv4fy", "is_submitter": "True", "link_id": "t3_ndtcdy", "parent_id": "t1_gycukdb", "score": "3", "subreddit": "ForHonorRants", "subreddit_id": "t5_3jk0e"}, {"author": "Makqa", "body": "Wow, wow, look at this man.  He’s finally grown to make choices in his life, “fuck everyone else, I PAID 20 BUCKS FOR THIS GAME, IMMA PLAY HOW I WANT” . So tough. \n\n...\n\nBut seriously, in a team game, guess what? ... you play as a TEAM. You don’t like gangs, go play 1v1...  \n\nI wonder if you played Overwatch would you also use the same argument? “ I PAID 20 BUCKS FOR THE GAME, IMMA GO SOLO DAMAGE, I cHooSe HoW tO PlaY”", "created_utc": "1621192661.0", "edited": "False", "id": "gycufd8", "is_submitter": "True", "link_id": "t3_ndtcdy", "parent_id": "t1_gycozp9", "score": "3", "subreddit": "ForHonorRants", "subreddit_id": "t5_3jk0e"}, {"author": "Makqa", "body": "Merci!", "created_utc": "1620497671.0", "edited": "False", "id": "gxetmq2", "is_submitter": "True", "link_id": "t3_n7us2s", "parent_id": "t1_gxet876", "score": "3", "subreddit": "French", "subreddit_id": "t5_2rd5t"}, {"author": "Makqa", "body": "Ça m’a expliqué beaucoup, merci!", "created_utc": "1620497487.0", "edited": "False", "id": "gxet9d3", "is_submitter": "True", "link_id": "t3_n7us2s", "parent_id": "t1_gxet0sk", "score": "4", "subreddit": "French", "subreddit_id": "t5_2rd5t"}, {"author": "Makqa", "body": "Merci!", "created_utc": "1620497385.0", "edited": "False", "id": "gxet1u3", "is_submitter": "True", "link_id": "t3_n7us2s", "parent_id": "t1_gxesmjz", "score": "7", "subreddit": "French", "subreddit_id": "t5_2rd5t"}, {"author": "Makqa", "body": "Mouth is not the only hole you’ve got, lol", "created_utc": "1620218864.0", "edited": "False", "id": "gx0qjcr", "is_submitter": "False", "link_id": "t3_n5bv2d", "parent_id": "t1_gx0gawd", "score": "15", "subreddit": "SafeMoon", "subreddit_id": "t5_42kuwz"}, {"author": "Makqa", "body": "Hey, there is a book called B2 “competences” comprehension orale. Its cover is green you’ll recognise it right away. I’m pretty sure if you work through it completely it will boost your listening. There’s also a B1 book which you can do if you want even more practice", "created_utc": "1619963249.0", "edited": "False", "id": "gwntlgj", "is_submitter": "False", "link_id": "t3_n2xfnn", "parent_id": "t3_n2xfnn", "score": "2", "subreddit": "French", "subreddit_id": "t5_2rd5t"}, {"author": "Makqa", "body": "Thanks!", "created_utc": "1619692352.0", "edited": "False", "id": "gwa47r9", "is_submitter": "False", "link_id": "t3_n10s2f", "parent_id": "t1_gwa10un", "score": "1", "subreddit": "CryptoCurrency", "subreddit_id": "t5_2wlj3"}, {"author": "Makqa", "body": "Thanks for a detailed reply!", "created_utc": "1619690558.0", "edited": "False", "id": "gwa25yt", "is_submitter": "False", "link_id": "t3_n10s2f", "parent_id": "t1_gwa1xub", "score": "2", "subreddit": "CryptoCurrency", "subreddit_id": "t5_2wlj3"}, {"author": "Makqa", "body": "But why? No chance people will continue to buy?", "created_utc": "1619689581.0", "edited": "False", "id": "gwa13ku", "is_submitter": "False", "link_id": "t3_n10s2f", "parent_id": "t1_gwa0kk9", "score": "1", "subreddit": "CryptoCurrency", "subreddit_id": "t5_2wlj3"}, {"author": "Makqa", "body": ";)", "created_utc": "1619689550.0", "edited": "False", "id": "gwa12ea", "is_submitter": "False", "link_id": "t3_n10s2f", "parent_id": "t1_gwa0zsp", "score": "-1", "subreddit": "CryptoCurrency", "subreddit_id": "t5_2wlj3"}, {"author": "Makqa", "body": "Thanks!", "created_utc": "1619689325.0", "edited": "False", "id": "gwa0tux", "is_submitter": "False", "link_id": "t3_n10s2f", "parent_id": "t1_gwa0i94", "score": "1", "subreddit": "CryptoCurrency", "subreddit_id": "t5_2wlj3"}, {"author": "Makqa", "body": "Thanks! I’ll check it out", "created_utc": "1619689306.0", "edited": "False", "id": "gwa0t43", "is_submitter": "False", "link_id": "t3_n10s2f", "parent_id": "t1_gwa0fu1", "score": "1", "subreddit": "CryptoCurrency", "subreddit_id": "t5_2wlj3"}, {"author": "Makqa", "body": "Aight, I do invest then", "created_utc": "1615831083.0", "edited": "False", "id": "gr1c434", "is_submitter": "False", "link_id": "t3_m5peae", "parent_id": "t1_gr18oxw", "score": "2", "subreddit": "binance", "subreddit_id": "t5_3mdot"}, {"author": "Makqa", "body": "Classical German literature?", "created_utc": "1614500278.0", "edited": "False", "id": "gp5a7zm", "is_submitter": "False", "link_id": "t3_lu1s0v", "parent_id": "t3_lu1s0v", "score": "2", "subreddit": "German", "subreddit_id": "t5_2qq51"}, {"author": "Makqa", "body": "Now that you've described your feelings about the subject I've realised that I have a compulsion like that with Japanese. Japanese is my sixth language and I find it absolutely magical. Maybe because of the influence of anime but maybe also because of its distinct pronounciation. For me, weird as it may sound , the Japanese language is associated with freedom and a freshness of sorts. Or maybe because Japan itself is an alien country. \n\nAnyway, whatever the reason, Japanese feels like it is some magical world with different people and who wouldn't want to experience radical novelty in their life? In my case Japanese is very inveigling exactly because it gives you the chance to experience your new self (and watch anime ;)", "created_utc": "1613897186.0", "edited": "False", "id": "go7l4cb", "is_submitter": "False", "link_id": "t3_lok3s7", "parent_id": "t3_lok3s7", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Makqa", "body": "の", "created_utc": "1613229300.0", "edited": "False", "id": "gn84xoj", "is_submitter": "False", "link_id": "t3_li86zs", "parent_id": "t3_li86zs", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Makqa", "body": "Ok, if you think I'm taking it out of context then tell me what's fundamentally wrong with the idea of punishing people for being assholes. Some games have this feature for a good reason, why shouldn't for honor?", "created_utc": "1612875808.0", "edited": "False", "id": "gmoykas", "is_submitter": "False", "link_id": "t3_lg14a9", "parent_id": "t1_gmovh1n", "score": "0", "subreddit": "forhonor", "subreddit_id": "t5_38p4n"}, {"author": "Makqa", "body": "It solves only a part of the problem, I wouldn't want to interrupt the entire communication with my opponent", "created_utc": "1612874394.0", "edited": "False", "id": "gmowilx", "is_submitter": "False", "link_id": "t3_lg14a9", "parent_id": "t1_gmow40x", "score": "2", "subreddit": "forhonor", "subreddit_id": "t5_38p4n"}, {"author": "Makqa", "body": "Maybe I've overlooked something", "created_utc": "1612874141.0", "edited": "False", "id": "gmow66c", "is_submitter": "False", "link_id": "t3_lg14a9", "parent_id": "t1_gmovj11", "score": "2", "subreddit": "forhonor", "subreddit_id": "t5_38p4n"}, {"author": "Makqa", "body": "That would be a great idea, but sometimes you would want to compliment your opponent on a good move or something, so..", "created_utc": "1612874066.0", "edited": "False", "id": "gmow2ka", "is_submitter": "False", "link_id": "t3_lg14a9", "parent_id": "t1_gmovhr1", "score": "2", "subreddit": "forhonor", "subreddit_id": "t5_38p4n"}, {"author": "Makqa", "body": "First make a coherent sentence, then talk", "created_utc": "1612873992.0", "edited": "False", "id": "gmovyyy", "is_submitter": "False", "link_id": "t3_lg14a9", "parent_id": "t1_gmovf0x", "score": "2", "subreddit": "forhonor", "subreddit_id": "t5_38p4n"}, {"author": "Makqa", "body": "Really? That would be so nice of you!", "created_utc": "1612697142.0", "edited": "False", "id": "gmeosf3", "is_submitter": "False", "link_id": "t3_leka22", "parent_id": "t1_gmeoiu3", "score": "1", "subreddit": "forhonor", "subreddit_id": "t5_38p4n"}, {"author": "Makqa", "body": "I've only played duels so far, so ok maybe i'll grow to like him later", "created_utc": "1612696997.0", "edited": "False", "id": "gmeobgz", "is_submitter": "False", "link_id": "t3_leka22", "parent_id": "t1_gmen6ev", "score": "1", "subreddit": "forhonor", "subreddit_id": "t5_38p4n"}, {"author": "Makqa", "body": "の", "created_utc": "1612448628.0", "edited": "False", "id": "glzmzw2", "is_submitter": "False", "link_id": "t3_lcest4", "parent_id": "t3_lcest4", "score": "14", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Makqa", "body": "Ah, so this is how it works. Thanks for clearing it up for me! ;)", "created_utc": "1612438357.0", "edited": "False", "id": "glz6q63", "is_submitter": "True", "link_id": "t3_la1gqx", "parent_id": "t1_glnqwy0", "score": "1", "subreddit": "forhonor", "subreddit_id": "t5_38p4n"}, {"author": "Makqa", "body": "Hey, it's fine\n \nHmm, actually that's an interesting question. Come to think of it it might actually have been upper B1. But honestly I didn't pay attention to that at that time. I thought the plus next to \"B1\" was more of an indication that the textbook lays a good foundation for moving on to B2 and further. \n\nI remember I picked up sicher B1+ three months later after I'd passed A2 so I simply started working through the textbook without any transition.   I remember it was quite heavy-going at first, but I think it's always like this at this level.  The most important thing, as I wrote in the comment, is that after completing each exercise in Sicher B1+! I passed B1 with a solid score, so I wouldn't worry about that if I were you", "created_utc": "1612438221.0", "edited": "False", "id": "glz6k6e", "is_submitter": "True", "link_id": "t3_kx22wr", "parent_id": "t1_glyplgd", "score": "1", "subreddit": "German", "subreddit_id": "t5_2qq51"}, {"author": "Makqa", "body": "No, btw, it just happened again against a vampire", "created_utc": "1612180883.0", "edited": "False", "id": "gll8lvy", "is_submitter": "True", "link_id": "t3_la1gqx", "parent_id": "t1_gll8egl", "score": "1", "subreddit": "forhonor", "subreddit_id": "t5_38p4n"}, {"author": "Makqa", "body": "Thanks!", "created_utc": "1612001168.0", "edited": "False", "id": "glcs543", "is_submitter": "True", "link_id": "t3_l81t2a", "parent_id": "t1_glcqije", "score": "1", "subreddit": "LearnJapanese", "subreddit_id": "t5_2qyls"}, {"author": "Makqa", "body": "Thanks!", "created_utc": "1611989113.0", "edited": "False", "id": "glceu2i", "is_submitter": "True", "link_id": "t3_l81t2a", "parent_id": "t1_glcesiu", "score": "2", "subreddit": "LearnJapanese", "subreddit_id": "t5_2qyls"}, {"author": "Makqa", "body": "I hope I'll be able to read this by the time I reach N1 😂", "created_utc": "1611989081.0", "edited": "False", "id": "glcesiu", "is_submitter": "True", "link_id": "t3_l81t2a", "parent_id": "t1_glbtgsd", "score": "3", "subreddit": "LearnJapanese", "subreddit_id": "t5_2qyls"}, {"author": "Makqa", "body": "I see, thanks!", "created_utc": "1611955728.0", "edited": "False", "id": "glal0f6", "is_submitter": "True", "link_id": "t3_l81t2a", "parent_id": "t1_glaidx3", "score": "2", "subreddit": "LearnJapanese", "subreddit_id": "t5_2qyls"}, {"author": "Makqa", "body": "Thank you!", "created_utc": "1611954612.0", "edited": "False", "id": "glai12v", "is_submitter": "True", "link_id": "t3_l81t2a", "parent_id": "t1_glac67c", "score": "1", "subreddit": "LearnJapanese", "subreddit_id": "t5_2qyls"}, {"author": "Makqa", "body": "That's the whole point of the exams, I guess.  To indicate where you are in terms of progress. B2 is what it is. Thanks for the reply!", "created_utc": "1611954376.0", "edited": "False", "id": "glahdfd", "is_submitter": "True", "link_id": "t3_l81t2a", "parent_id": "t1_glabqfx", "score": "3", "subreddit": "LearnJapanese", "subreddit_id": "t5_2qyls"}, {"author": "Makqa", "body": "I'm glad you mention it's closer to C1 since I'd rather the benchmark was higher so as  to be more encouraging.  Thanks!", "created_utc": "1611954214.0", "edited": "False", "id": "glagwls", "is_submitter": "True", "link_id": "t3_l81t2a", "parent_id": "t1_gla7v5n", "score": "1", "subreddit": "LearnJapanese", "subreddit_id": "t5_2qyls"}, {"author": "Makqa", "body": "I'm going to take C2 soon, and so far I've been using textbooks to get to this level. 'Tendances' is a good textbook, you can buy both 'Tendances A1' and 'Tendances A2'. Just complete the exercises in those textbooks from start to finish and you'll have the level you want", "created_utc": "1610962110.0", "edited": "False", "id": "gjpfc7z", "is_submitter": "False", "link_id": "t3_kzbosi", "parent_id": "t1_gjpez55", "score": "2", "subreddit": "French", "subreddit_id": "t5_2rd5t"}, {"author": "Makqa", "body": " if you start from zero and proceed at the pace you've described. (1*5+ 2*2=9) so 9 hours a week, you would get around 216 hours in 6 months. That could even be the entry level B1. B1 takes from 200 to 400 hours. But you would certainly reach A2 at this pace", "created_utc": "1610955624.0", "edited": "False", "id": "gjp8fux", "is_submitter": "False", "link_id": "t3_kzbosi", "parent_id": "t1_gjotldf", "score": "2", "subreddit": "French", "subreddit_id": "t5_2rd5t"}, {"author": "Makqa", "body": "Bro, where do you find friends like that?", "created_utc": "1610786951.0", "edited": "False", "id": "gjfqw4i", "is_submitter": "False", "link_id": "t3_ky3yz2", "parent_id": "t3_ky3yz2", "score": "1", "subreddit": "bloodborne", "subreddit_id": "t5_31k9i"}, {"author": "Makqa", "body": "XD", "created_utc": "1610690140.0", "edited": "False", "id": "gjbfvgd", "is_submitter": "True", "link_id": "t3_kx22wr", "parent_id": "t1_gjaooph", "score": "1", "subreddit": "German", "subreddit_id": "t5_2qq51"}, {"author": "Makqa", "body": "I mainly used 'Sicher!' textbooks to get from b1 to C1", "created_utc": "1610655587.0", "edited": "False", "id": "gj9kh1x", "is_submitter": "True", "link_id": "t3_kx22wr", "parent_id": "t1_gj9errr", "score": "5", "subreddit": "German", "subreddit_id": "t5_2qq51"}, {"author": "Makqa", "body": "Спасибо :)\n\nHonestly, I chose the textbook that I liked the most by the cover and I didn't use any other textbook for B1 to C1. Only Erkundungen and EndStation for C2 because sicher only goes up to C1. \n\nI've used a lot of other textbooks in other languages though and I can say I enjoyed Sicher overall. I'm sure all the other textbooks are just as great ;)", "created_utc": "1610651049.0", "edited": "False", "id": "gj9ajvm", "is_submitter": "True", "link_id": "t3_kx22wr", "parent_id": "t1_gj99acw", "score": "2", "subreddit": "German", "subreddit_id": "t5_2qq51"}, {"author": "Makqa", "body": "Thanks!", "created_utc": "1610650780.0", "edited": "False", "id": "gj99ynf", "is_submitter": "True", "link_id": "t3_kx22wr", "parent_id": "t1_gj987iy", "score": "1", "subreddit": "German", "subreddit_id": "t5_2qq51"}, {"author": "Makqa", "body": "Yeah, I can relate. I feel like it's almost useless to think there's some vague element that you need to improve. We just need to improve our language skills overall, I mean I got 69 for writing on C2, I'm sure that  even if I had practiced writing no more ,but had improved listening and reading to over 90, my writing would have improved as well", "created_utc": "1610650664.0", "edited": "False", "id": "gj99pcx", "is_submitter": "True", "link_id": "t3_kx22wr", "parent_id": "t1_gj9825w", "score": "2", "subreddit": "German", "subreddit_id": "t5_2qq51"}, {"author": "Makqa", "body": "I was using Sicher B2 to prepare for B2 so by the time I was sitting the exam I'd practiced a lot and written on the topics in the textbook exercises.  Just do all the exercises you get for writing and you'll be fine ;)\n\nIn your case in particular maybe you went slightly off topic?", "created_utc": "1610649660.0", "edited": "False", "id": "gj97gvw", "is_submitter": "True", "link_id": "t3_kx22wr", "parent_id": "t1_gj96tbg", "score": "3", "subreddit": "German", "subreddit_id": "t5_2qq51"}, {"author": "Makqa", "body": "Spasibo!", "created_utc": "1610649299.0", "edited": "False", "id": "gj96o5q", "is_submitter": "True", "link_id": "t3_kx22wr", "parent_id": "t1_gj903wr", "score": "1", "subreddit": "German", "subreddit_id": "t5_2qq51"}, {"author": "Makqa", "body": "Does it work now?", "created_utc": "1610649231.0", "edited": "False", "id": "gj96ip1", "is_submitter": "True", "link_id": "t3_kx22wr", "parent_id": "t1_gj8wsg1", "score": "1", "subreddit": "German", "subreddit_id": "t5_2qq51"}, {"author": "Makqa", "body": "I was 16 in the 10th grade, as far as I remember.\nThanks;)", "created_utc": "1610649056.0", "edited": "False", "id": "gj964od", "is_submitter": "True", "link_id": "t3_kx22wr", "parent_id": "t1_gj91h6a", "score": "1", "subreddit": "German", "subreddit_id": "t5_2qq51"}, {"author": "Makqa", "body": "Hm, works fine on my phone, I dunno", "created_utc": "1610648640.0", "edited": "False", "id": "gj957h0", "is_submitter": "True", "link_id": "t3_kx22wr", "parent_id": "t1_gj91k3c", "score": "1", "subreddit": "German", "subreddit_id": "t5_2qq51"}, {"author": "Makqa", "body": "I see, good luck with C1!", "created_utc": "1610644601.0", "edited": "False", "id": "gj8w2qf", "is_submitter": "True", "link_id": "t3_kx22wr", "parent_id": "t1_gj8m2te", "score": "2", "subreddit": "German", "subreddit_id": "t5_2qq51"}, {"author": "Makqa", "body": "Thanks!", "created_utc": "1610638448.0", "edited": "False", "id": "gj8ie93", "is_submitter": "True", "link_id": "t3_kx22wr", "parent_id": "t1_gj8i7ni", "score": "1", "subreddit": "German", "subreddit_id": "t5_2qq51"}, {"author": "Makqa", "body": "I used the series of textbook 'Sicher!' . It takes you from b1 to C1. For C2 - Erkundungen C2 and EndStation C2. Just do all the exercises ;)\n\nYes, to my surprise the score on speaking is high, but I literally just spoke to myself. Whenever there was an exercise for speaking or for writing I would just try to speak on the topic in as much detail as possible", "created_utc": "1610638343.0", "edited": "False", "id": "gj8i63g", "is_submitter": "True", "link_id": "t3_kx22wr", "parent_id": "t1_gj8h26u", "score": "3", "subreddit": "German", "subreddit_id": "t5_2qq51"}, {"author": "Makqa", "body": "Yes, if you sum up only the time when I was actually learning, because, again, as said in my comment below, I also took considerable breaks every time I passed the exam, so eventually C2 got drawn out to slightly less than 2 years (B1 in November 2018, C2 in October 2020).   \n\nTo be more precise:\n\nB1 >B2  = 3 months \nB2> C1. =3 months \nC1> more or less solid C2 = 5 months.", "created_utc": "1610638025.0", "edited": "False", "id": "gj8hhvj", "is_submitter": "True", "link_id": "t3_kx22wr", "parent_id": "t1_gj8fviu", "score": "4", "subreddit": "German", "subreddit_id": "t5_2qq51"}, {"author": "Makqa", "body": "I used 'Sicher C1' to go from B2 to C1, and then I passed the exam after completing this book. You can also use a book called ' C1 Deutsch üben. Hören und Sprechen.' to sharpen your listening skills. But you should use Sicher C1 as your primary book", "created_utc": "1610637350.0", "edited": "False", "id": "gj8g20l", "is_submitter": "True", "link_id": "t3_kx22wr", "parent_id": "t1_gj8dcxj", "score": "3", "subreddit": "German", "subreddit_id": "t5_2qq51"}, {"author": "Makqa", "body": "Danke!", "created_utc": "1610637156.0", "edited": "False", "id": "gj8fn35", "is_submitter": "True", "link_id": "t3_kx22wr", "parent_id": "t1_gj82pda", "score": "2", "subreddit": "German", "subreddit_id": "t5_2qq51"}, {"author": "Makqa", "body": "I think I'll most likely go to Germany to do a master's, but apart from that I'm just curious to see how far one can go with studying several languages. C2 is a good benchmark :)", "created_utc": "1610636979.0", "edited": "1610637402.0", "id": "gj8f9t4", "is_submitter": "True", "link_id": "t3_kx22wr", "parent_id": "t1_gj8769u", "score": "6", "subreddit": "German", "subreddit_id": "t5_2qq51"}, {"author": "Makqa", "body": "Hi! Yes the certificates are given for the successful completion of an exam (60% is the threshold for passing). The exams are an independent entity, so anyone can take one if they want to, it's just that most people prefer to go to courses and then, on the completion, take the exam.  You can sign up for one on the Internet. For the German language, the provider of the international exams are Goethe Institut, you can read all the information about the exams on their site.", "created_utc": "1610627309.0", "edited": "False", "id": "gj7zad9", "is_submitter": "True", "link_id": "t3_kx22wr", "parent_id": "t1_gj7y1y2", "score": "4", "subreddit": "German", "subreddit_id": "t5_2qq51"}, {"author": "Makqa", "body": "Понимаю) терпение и труд, как говорится ( и правильные учебники) XD", "created_utc": "1610622704.0", "edited": "False", "id": "gj7u5wd", "is_submitter": "True", "link_id": "t3_kx22wr", "parent_id": "t1_gj7twu9", "score": "3", "subreddit": "German", "subreddit_id": "t5_2qq51"}, {"author": "Makqa", "body": "Бля, приятно услышать(увидеть)  родную речь", "created_utc": "1610621632.0", "edited": "False", "id": "gj7t2ll", "is_submitter": "True", "link_id": "t3_kx22wr", "parent_id": "t1_gj7sv8n", "score": "6", "subreddit": "German", "subreddit_id": "t5_2qq51"}, {"author": "Makqa", "body": "Thanks!", "created_utc": "1610619816.0", "edited": "False", "id": "gj7r9j8", "is_submitter": "True", "link_id": "t3_kx22wr", "parent_id": "t1_gj7r05t", "score": "0", "subreddit": "German", "subreddit_id": "t5_2qq51"}, {"author": "Makqa", "body": "Just uploaded the link", "created_utc": "1610619549.0", "edited": "False", "id": "gj7r08j", "is_submitter": "True", "link_id": "t3_kx22wr", "parent_id": "t1_gj7qk4m", "score": "2", "subreddit": "German", "subreddit_id": "t5_2qq51"}, {"author": "Makqa", "body": "Sure, I've just registered on Imgur and I need to figure out how to attach a link from there. But I'll do it shortly", "created_utc": "1610619370.0", "edited": "False", "id": "gj7qu0k", "is_submitter": "True", "link_id": "t3_kx22wr", "parent_id": "t1_gj7qk4m", "score": "3", "subreddit": "German", "subreddit_id": "t5_2qq51"}, {"author": "Makqa", "body": "Forgot to mention how long it took me to work through C2 textbooks. 3 months for each textbook. \n\nAnd also... If I had studied German from scratch the way I was studying for B1 and higher it would have taken me much less time. I m sure around 2 or 3 months to get from zero to A2. So you could  say the lessons  at school were slow since I only got to A2 after two years of school. But better than nothing! And I'm grateful to my teacher who insisted that  we should take those exams!", "created_utc": "1610618537.0", "edited": "1610627573.0", "id": "gj7q1fh", "is_submitter": "True", "link_id": "t3_kx22wr", "parent_id": "t1_gj7pr74", "score": "13", "subreddit": "German", "subreddit_id": "t5_2qq51"}, {"author": "Makqa", "body": "I've just added a comment to this post :)", "created_utc": "1610618286.0", "edited": "False", "id": "gj7pst0", "is_submitter": "True", "link_id": "t3_kx22wr", "parent_id": "t1_gj7o57v", "score": "1", "subreddit": "German", "subreddit_id": "t5_2qq51"}, {"author": "Makqa", "body": "I started with German when I was in the 10 th grade of school. And the classes up until the end of the eleventh grade took me to A2. \n\nYou may think here then 'Well, it's not self-studying really , you already got good basics', but truth be said when I started  learnjng German completely on my own  I passed the B1 exam after studying for around two months and a half. I was on my first year at university. I remember  I started at the end of August and the exam was in November and then I passed it with the following marks ( Lesen:90, Hören 90, Schreiben 90, Sprechen 82). \n\nThen I took a brake from studying and started on B2 in the middle of January. It took me around 3 months to get to B2 after which I passed the exam again. ( Lesen 88, Hören 80, Schreiben 93, Sprechen 89).\n\nThen again a few months of break and I started to prepare for C1. I started in the middle of June and finished in the middle of September. Again around 3 months. In November I took the exam again ( the results( Lesen 17.5/25, Hören 14.5/25, Schreiben 21/25, sprechen 23/25). \n...\nAnd then I started to prepare for C2... Initially I intended to pass it in May but because of the Coronavirus the exam was cancelled and I took the exam in October. So basically a year after passing C1. \n\nFor all the levels that I got through I always used textbooks. I used the series of textbooks' Sicher!', they have textbooks from B1 to C1 and although they are designed for group work I could easily get around that by talking to myself.  And for C2, which was by far the longest preparation period I used Erkundungen C2 and EndStation C2.  Whenever I bought a new textbook I simply followed all the exercises in them until the book was completed.\n\nI studied for around 3 hours everyday.\n\nHope it helps ;)", "created_utc": "1610618239.0", "edited": "1610626942.0", "id": "gj7pr74", "is_submitter": "True", "link_id": "t3_kx22wr", "parent_id": "t3_kx22wr", "score": "39", "subreddit": "German", "subreddit_id": "t5_2qq51"}, {"author": "Makqa", "body": "Bro, I believe in you you can do that. \n\nIn fact it's very doable. I've personally passed the C2 exam already by simply working through textbooks. \n\nIn your case, you need to take two textbooks. 'Sicher!B2' and 'Sicher! C1'. They both consist of the textbook itself, a workbook and a teacher's book.\n\nJust work through these textbooks from the start to finish and if you spend around 3 hours everyday studying you should be able to achieve C1", "created_utc": "1610614148.0", "edited": "False", "id": "gj7lr45", "is_submitter": "False", "link_id": "t3_kwfutq", "parent_id": "t3_kwfutq", "score": "1", "subreddit": "German", "subreddit_id": "t5_2qq51"}, {"author": "Makqa", "body": "Thanks for the reply! \n\nI'll probably take HSK 4 then", "created_utc": "1602782525.0", "edited": "False", "id": "g8x1atr", "is_submitter": "True", "link_id": "t3_jbmo92", "parent_id": "t1_g8wvfmz", "score": "1", "subreddit": "ChineseLanguage", "subreddit_id": "t5_2qyz1"}, {"author": "Makqa", "body": "Thanks, but that community is too small ;) Can't see why we can't discuss it here", "created_utc": "1598851624.0", "edited": "False", "id": "g3fsqkj", "is_submitter": "False", "link_id": "t3_ijfupp", "parent_id": "t1_g3dwny9", "score": "1", "subreddit": "German", "subreddit_id": "t5_2qq51"}, {"author": "Makqa", "body": "Pencil pusher or something like that", "created_utc": "1598851423.0", "edited": "False", "id": "g3fshwd", "is_submitter": "False", "link_id": "t3_ijfupp", "parent_id": "t1_g3dt20x", "score": "2", "subreddit": "German", "subreddit_id": "t5_2qq51"}, {"author": "Makqa", "body": "Maybe, but I play how it plays. Not sure how to focus specifically on shadowing or pressuring. You have to grasp it naturally as you play, however when I see I'm missing a rebound because of shaky mechanics it makes me want spend more time practicing aerials. And every other aspect of the game improves when you get better mechanically.", "created_utc": "1598445963.0", "edited": "False", "id": "g2wkxsh", "is_submitter": "False", "link_id": "t3_igxvvq", "parent_id": "t1_g2wkgxs", "score": "1", "subreddit": "RocketLeague", "subreddit_id": "t5_30cz1"}, {"author": "Makqa", "body": "I set myself a goal of becoming GC in 1s before going into any other play mode. Wonder how long it will take 😂☺️☺️", "created_utc": "1598445676.0", "edited": "False", "id": "g2wkiba", "is_submitter": "False", "link_id": "t3_igxvvq", "parent_id": "t1_g2wk7d4", "score": "2", "subreddit": "RocketLeague", "subreddit_id": "t5_30cz1"}, {"author": "Makqa", "body": "The thing is... I'm 1v1 main xD. I only play 1v1 since, how you also explained, it's the best way to get better at rocket League. It does feel too harsh at times", "created_utc": "1598445477.0", "edited": "False", "id": "g2wk7xe", "is_submitter": "False", "link_id": "t3_igxvvq", "parent_id": "t1_g2wjsmw", "score": "1", "subreddit": "RocketLeague", "subreddit_id": "t5_30cz1"}, {"author": "Makqa", "body": "Danke für einen Hinweis!", "created_utc": "1597501406.0", "edited": "False", "id": "g1le2ny", "is_submitter": "True", "link_id": "t3_ia6yv4", "parent_id": "t1_g1ld73o", "score": "1", "subreddit": "German", "subreddit_id": "t5_2qq51"}, {"author": "Makqa", "body": "Danke schön!", "created_utc": "1597500146.0", "edited": "False", "id": "g1lb6ai", "is_submitter": "True", "link_id": "t3_ia6yv4", "parent_id": "t1_g1l8h4i", "score": "2", "subreddit": "German", "subreddit_id": "t5_2qq51"}, {"author": "Makqa", "body": "Aha, Danke schön! :) \n\nIch habe die Wörter  in Duden nie vorher nachgeschlagen war mal zu schwierig. Danke für die Empfehlung!", "created_utc": "1597497342.0", "edited": "False", "id": "g1l3cv6", "is_submitter": "True", "link_id": "t3_ia6yv4", "parent_id": "t1_g1l1m87", "score": "1", "subreddit": "German", "subreddit_id": "t5_2qq51"}, {"author": "Makqa", "body": "Thank you a lot for the link to the summary of the differences! Now I really do feel like ordering the second volume of the second edition. \n\nIt just crossed my mind that the differences would even be less influential in the second volume because you will know some Japanese and so will be able to navigate the book more easily. \n\nThat's also nice to hear the second edition has app audio. Since I've been using their app for the third edition it's been very convenient.", "created_utc": "1595847263.0", "edited": "False", "id": "fze4xtz", "is_submitter": "True", "link_id": "t3_hyno70", "parent_id": "t1_fzdxq3q", "score": "2", "subreddit": "LearnJapanese", "subreddit_id": "t5_2qyls"}, {"author": "Makqa", "body": "I see, thanks ;)", "created_utc": "1595844368.0", "edited": "False", "id": "fze21ws", "is_submitter": "True", "link_id": "t3_hyno70", "parent_id": "t1_fze1vcb", "score": "1", "subreddit": "LearnJapanese", "subreddit_id": "t5_2qyls"}, {"author": "Makqa", "body": "Ah, thanks, did you preorder it from their official site?", "created_utc": "1595843262.0", "edited": "False", "id": "fze0zig", "is_submitter": "True", "link_id": "t3_hyno70", "parent_id": "t1_fzdvsvq", "score": "1", "subreddit": "LearnJapanese", "subreddit_id": "t5_2qyls"}, {"author": "Makqa", "body": "Exactly, I totally understand the way you feel.\n\nAnd my personal reason is more about just being able to enjoy multiple languages because I'm the only one who plays ps at home ;) But playing a game in a different language is one of the most major ways to enjoy a language nowadays. And this opportunity is taken away so unnecessarily. Just annoying.", "created_utc": "1594898770.0", "edited": "False", "id": "fy8quhq", "is_submitter": "False", "link_id": "t3_hs72wk", "parent_id": "t1_fy8pb4n", "score": "1", "subreddit": "PS4", "subreddit_id": "t5_2rrlp"}, {"author": "Makqa", "body": "I'm not sure how they work exactly since I'm not a specialist. I just know that accutane is for very severe cases when you're starting to lose hope. Acutane is very potent up to the degree that it may start to cause some bone weakness or stuff like that. \n\nAnd on the other hand you have B5 which is, going by many accounts, myself included, totally innocuous since  it is a vitamin. For me the only side effect has been a small spot of redness on my face which went away in a day and didn't cause any pain or distress. It may have been not B5 at all, since I used to get some redness long before taking b5 and long before getting acne. \n\nSo it's highly recommended to try b5 first before doing anything else, especially hardcore stuff like acutane. \n\nI also take B-complex (in a yellow green bottle), one pill per day before breakfast. I also drink cod liver fish oil. A tablesponfull a day. \n\nThen I also take lysine, since i've watched many people praising it. One pill per day before breakfast. But i think you should try without lysine first to see how the b supplements work on you by themselves.", "created_utc": "1591900886.0", "edited": "False", "id": "ftq13dq", "is_submitter": "False", "link_id": "t3_h0y9qc", "parent_id": "t1_ftpys4s", "score": "2", "subreddit": "acne", "subreddit_id": "t5_2qse3"}, {"author": "Makqa", "body": "It's certainly worth trying. You can never know for sure whether it will help or not but in my case it has been a huge improvement. I take 12 pills every day 3 per meal. I had bad breakouts now there's significantly less pimples. If you are considering popping on acutane first try b5, there's not a bad chance it will even help on the second or the third day!", "created_utc": "1591898951.0", "edited": "False", "id": "ftpx175", "is_submitter": "False", "link_id": "t3_h0y9qc", "parent_id": "t3_h0y9qc", "score": "1", "subreddit": "acne", "subreddit_id": "t5_2qse3"}, {"author": "Makqa", "body": "Thanks for the advice!  I also thought about taking something more suitable as a face wash and also get thermal water since I would still need something to moisturize my skin with because it just gets uncomfortable to go with a very oily skin. \n\nYes, it contains Biotin 30 mcg 100%. I probably will increase the dosage for a while but after I try a new face wash. So far I haven't noticed any side effects from b5.\n\nTo be honest I've completely lost trust in dermatologists, at least in my city. I've tried two already, both very qualified and it did no good. Sure they will take care of your skin during one session and pop the pimples but it will reappear in a week or so. I mean if they had at least told me about B5 that would have already been a huge step forward, since right now it's due to it and the b-complex that 90% percent of my acne is gone. But I guess they probably have even no idea what it is. And they have never tried offering me a more permanent solution :(\n\nAnyway, appreciate your response :)", "created_utc": "1591898256.0", "edited": "False", "id": "ftpvlnq", "is_submitter": "False", "link_id": "t3_h0x3yh", "parent_id": "t1_ftpg8vu", "score": "1", "subreddit": "acne", "subreddit_id": "t5_2qse3"}, {"author": "Makqa", "body": "Japanese...\n\n1.Anime\n2.Manga\n3 Anime", "created_utc": "1591001512.0", "edited": "False", "id": "fsicti5", "is_submitter": "False", "link_id": "t3_gtqfr7", "parent_id": "t3_gtqfr7", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Makqa", "body": "Haha, I get it, thanks ;)", "created_utc": "1590861211.0", "edited": "False", "id": "fsbu6t4", "is_submitter": "True", "link_id": "t3_gthgqe", "parent_id": "t1_fsbsj6v", "score": "2", "subreddit": "German", "subreddit_id": "t5_2qq51"}, {"author": "Makqa", "body": "'Auf Verluste' betont dann 'ohne Rücksicht' und ist eine Redewendung?", "created_utc": "1590858380.0", "edited": "False", "id": "fsbmcds", "is_submitter": "True", "link_id": "t3_gthgqe", "parent_id": "t1_fsblzf7", "score": "4", "subreddit": "German", "subreddit_id": "t5_2qq51"}, {"author": "Makqa", "body": "The 'Tendances' series. They have textbooks from A1 to C2 if you want a systematic approach", "created_utc": "1590405997.0", "edited": "False", "id": "frrcilq", "is_submitter": "False", "link_id": "t3_gq0ce8", "parent_id": "t3_gq0ce8", "score": "1", "subreddit": "French", "subreddit_id": "t5_2rd5t"}, {"author": "Makqa", "body": "Btw, a certain IELTS score will always be the same score range on the exams like CAE. So there's no way of getting a specific score more easily. They will always translate from one another", "created_utc": "1590085062.0", "edited": "False", "id": "frd7lqq", "is_submitter": "False", "link_id": "t3_gnzlmt", "parent_id": "t1_frd6f99", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Makqa", "body": "I suppose if it's a requirement they are probably asking for IELTS. TOEFL is the same as IELTS but is mainly required in the USA. CAE is for universal purposes when you're learning English in general, but it's just as valid as IELTS the difference being that IELTS is for the immediate need since your score will no longer be valid after two years which might be your case.", "created_utc": "1590084462.0", "edited": "False", "id": "frd6f99", "is_submitter": "False", "link_id": "t3_gnzlmt", "parent_id": "t3_gnzlmt", "score": "4", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Makqa", "body": "Thanks!!!", "created_utc": "1589821393.0", "edited": "False", "id": "fr1kowo", "is_submitter": "False", "link_id": "t3_gm55tp", "parent_id": "t1_fr1kj2t", "score": "1", "subreddit": "DarkSouls2", "subreddit_id": "t5_2vqni"}, {"author": "Makqa", "body": "The ring is actually a very good idea for me. Thanks for the hint, mate! I totally forgot about that", "created_utc": "1589821269.0", "edited": "False", "id": "fr1kfyw", "is_submitter": "False", "link_id": "t3_gm55tp", "parent_id": "t1_fr1jk9n", "score": "2", "subreddit": "DarkSouls2", "subreddit_id": "t5_2vqni"}, {"author": "Makqa", "body": "Yeah, I've noticed that but I think around 10 heavy hits is still too fast", "created_utc": "1589821060.0", "edited": "False", "id": "fr1k0om", "is_submitter": "False", "link_id": "t3_gm55tp", "parent_id": "t1_fr1jq2c", "score": "2", "subreddit": "DarkSouls2", "subreddit_id": "t5_2vqni"}, {"author": "Makqa", "body": "That's annoying!", "created_utc": "1589217570.0", "edited": "False", "id": "fqae867", "is_submitter": "False", "link_id": "t3_ghiytm", "parent_id": "t1_fqaa8gf", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Makqa", "body": "Gosh, I was so blind. There actually are the French and German localisations for witcher 3. I'm so happy now :))", "created_utc": "1589214664.0", "edited": "False", "id": "fqa8fud", "is_submitter": "False", "link_id": "t3_ghiytm", "parent_id": "t1_fqa7pa5", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Makqa", "body": "I totally agree, especially when you're playing a game like Witcher 3 where there are so many dialogues and things the character say. It can certainly boost your vocabulary and flexibility.", "created_utc": "1589213960.0", "edited": "False", "id": "fqa71zp", "is_submitter": "False", "link_id": "t3_ghiytm", "parent_id": "t1_fqa1d5u", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Makqa", "body": "Hmm, maybe with regard to Witcher 3 i should look more carefully. \n\nAs far as voiceovers are concerned I totally understand they can't possibly make a localisation for every language. I'm saying that if they've already done a localisation for a language but don't make it available for everyone it just doesn't make much sense, that's the problem :(", "created_utc": "1589213762.0", "edited": "False", "id": "fqa6non", "is_submitter": "False", "link_id": "t3_ghiytm", "parent_id": "t1_fq9y31p", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Makqa", "body": "Never been a fun of final fantasy, but I suppose if i ever get let to learn Japanese, anime is the way to go , haha. \n\n I never thought choosing a game so that it has a certain set of languages would ever be a consideration for me ;)", "created_utc": "1589204713.0", "edited": "False", "id": "fq9q651", "is_submitter": "False", "link_id": "t3_ghiytm", "parent_id": "t1_fq9nk2p", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Makqa", "body": "You're welcome ;)", "created_utc": "1589200418.0", "edited": "False", "id": "fq9jyiz", "is_submitter": "False", "link_id": "t3_ghgn3z", "parent_id": "t1_fq9jx6z", "score": "2", "subreddit": "German", "subreddit_id": "t5_2qq51"}, {"author": "Makqa", "body": "Sicher C1", "created_utc": "1589200337.0", "edited": "False", "id": "fq9juvw", "is_submitter": "False", "link_id": "t3_ghgn3z", "parent_id": "t1_fq9e8te", "score": "2", "subreddit": "German", "subreddit_id": "t5_2qq51"}, {"author": "Makqa", "body": "Yeah, I was thinking there might be some way around this. But for the reasons mentioned already, wouldn't it be impossible because then you could switch back and forth between the stores and buy all the best offers. But I'm not sure where Sony stands on it. But I'd be more than happy to give it a try and find that it really works the way you described Thanks, mate! ;)", "created_utc": "1589196808.0", "edited": "False", "id": "fq9fqav", "is_submitter": "False", "link_id": "t3_ghiytm", "parent_id": "t1_fq9eivu", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Makqa", "body": "Good point, it could be part of the reason. However, I still think that it's not a big deal from the technical  point of view to just put all the languages in one package and put it out on ps store. They could still limit my access to other countries' ps store, I wouldn't mind that. \n\nBesides, some games still let you play in many voiceovers like Skyrim for instance. But sometimes, you just come across a game with voiceovers in \"\"attention\"\"\": Russian, English, Polish and subtitles in \"\"attention\"\"\": Russian, English, Polish and ... drumming... NORVEGIAN. Why would they put NORVEGIAN in the Russian package I have no idea xD. So there's certainly some weird allocation going on", "created_utc": "1589188103.0", "edited": "False", "id": "fq978l8", "is_submitter": "False", "link_id": "t3_ghiytm", "parent_id": "t1_fq969il", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Makqa", "body": "Thanks, I'll try that ;)", "created_utc": "1588704930.0", "edited": "False", "id": "fpl1xee", "is_submitter": "True", "link_id": "t3_gdzyeg", "parent_id": "t1_fpkk2gl", "score": "2", "subreddit": "darksouls", "subreddit_id": "t5_2sazo"}, {"author": "Makqa", "body": "I'm afraid  we can't coop since I'm on ps4", "created_utc": "1588704677.0", "edited": "False", "id": "fpl1ew0", "is_submitter": "True", "link_id": "t3_gdzyeg", "parent_id": "t1_fpkoqs6", "score": "1", "subreddit": "darksouls", "subreddit_id": "t5_2sazo"}, {"author": "Makqa", "body": "Did I just activate something weird? lol", "created_utc": "1588695318.0", "edited": "False", "id": "fpkijda", "is_submitter": "True", "link_id": "t3_gdzyeg", "parent_id": "t1_fpki5p4", "score": "1", "subreddit": "darksouls", "subreddit_id": "t5_2sazo"}, {"author": "Makqa", "body": "Weirdly, the four  kings were easy for me, I killed them on my third try, but Manus has already killed me probably around 12 times. Most of the time I don't even take away a quarter of his health bar. (I'm bad, I know @_@. )", "created_utc": "1588695104.0", "edited": "False", "id": "fpki49k", "is_submitter": "True", "link_id": "t3_gdzyeg", "parent_id": "t1_fpkgrbh", "score": "1", "subreddit": "darksouls", "subreddit_id": "t5_2sazo"}, {"author": "Makqa", "body": "Manus: hits you one time\n\nYou: see nothing, the health bar is more than half full\n\nManus: hahahahah (jumps violently)\n\nYou: still nothing... What's going on???\n\nYou one second later : healthbar 0\n\nThe end", "created_utc": "1588693409.0", "edited": "False", "id": "fpkev3l", "is_submitter": "True", "link_id": "t3_gdzyeg", "parent_id": "t1_fpked8d", "score": "4", "subreddit": "darksouls", "subreddit_id": "t5_2sazo"}, {"author": "Makqa", "body": "And that stupid witch-bitch on the approach!!!", "created_utc": "1588693165.0", "edited": "False", "id": "fpkee9n", "is_submitter": "True", "link_id": "t3_gdzyeg", "parent_id": "t3_gdzyeg", "score": "6", "subreddit": "darksouls", "subreddit_id": "t5_2sazo"}, {"author": "Makqa", "body": "I mean developers. They probably didn't decide themselves what languages they want in what version.", "created_utc": "1588597770.0", "edited": "False", "id": "fpg9ez3", "is_submitter": "False", "link_id": "t3_gdagrx", "parent_id": "t1_fpg9abe", "score": "1", "subreddit": "PS4", "subreddit_id": "t5_2rrlp"}, {"author": "Makqa", "body": "Sorry, it doesn't work this way, I wish it did. I know how to change the language of the system. I'm talking specifically about the in-game audio. So far only Skyrim has adapted the language", "created_utc": "1588594735.0", "edited": "False", "id": "fpg5eal", "is_submitter": "False", "link_id": "t3_gdagrx", "parent_id": "t1_fpg53nv", "score": "0", "subreddit": "PS4", "subreddit_id": "t5_2rrlp"}, {"author": "Makqa", "body": "Ich bin kein Deutscher, haha ;).                                              I totally understand that it's hard to afford to spend a lot of time on something that is not your main priority.", "created_utc": "1587922314.0", "edited": "False", "id": "fonmgzw", "is_submitter": "False", "link_id": "t3_g8a7ix", "parent_id": "t1_fonlsp8", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Makqa", "body": "Well, in my comment specifically I didn't promote anything. From my experience I can say for sure you can go from one level to another within a fairly short time, even in not-so-familiar languages, if you study hard. Besides, that practice that is presumably needed to develop speaking and vocabulary can be obtained through a longer exposure within a short time period as well. If you (and I don't mean you here specifically) were to put in not just 3 hours a week during classes but at least 17 hours a week by studying 2-3 hours every day you would make progress very quickly. \n\nAnd I don't want to detract from the difficulty of learning a foreign language, but there's always a number that shows how many hours you approximately need to achieve, say, C2 (Somewhere around 1000-1200). And you could either drag it on for three or more years or you could compress those 1000 hours or so into a year. \n\nÜbrigens, ich hasse auch die Klügscheißer die einem ihre nutzlose Webinare  aufzwingen.", "created_utc": "1587920030.0", "edited": "False", "id": "foniaqf", "is_submitter": "False", "link_id": "t3_g8a7ix", "parent_id": "t1_fonf6w4", "score": "-1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Makqa", "body": "Honestly, you can go from total zero to b1 within 4 to 6 months if you study harder than average : 3-4 hours every day. It's really not a big deal. You just need to find three good textbooks and workbooks. One (a student book and a workbook)  which will take you from zero to A1, the second one from A1 to A2 and the third one from A2 to B1. \n\nBy keeping the above mentioned pace you should reach A1 in under a month, same for A2, maybe a bit more than a month, and then B1 will take you a while longer resulting in have to study for about two months plus or minus a couple of weeks when you feel you don't want to study", "created_utc": "1587910984.0", "edited": "False", "id": "fon2wyx", "is_submitter": "False", "link_id": "t3_g8a7ix", "parent_id": "t3_g8a7ix", "score": "-4", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Makqa", "body": "Großer Dank für eine ausführliche Erklärung!", "created_utc": "1587404495.0", "edited": "False", "id": "fo01mdo", "is_submitter": "True", "link_id": "t3_g4wvkq", "parent_id": "t1_fo015ye", "score": "2", "subreddit": "German", "subreddit_id": "t5_2qq51"}, {"author": "Makqa", "body": "Ahh, genau, habe mich versehen, danke schön ;)", "created_utc": "1587404332.0", "edited": "False", "id": "fo01amp", "is_submitter": "True", "link_id": "t3_g4wvkq", "parent_id": "t1_fo00kd8", "score": "1", "subreddit": "German", "subreddit_id": "t5_2qq51"}, {"author": "Makqa", "body": "Ich verstehe, deshalb habe ich eigentlich hier gefragt. Ich habe es in einem Lehrwerk gefunden . Soll vertrauenswürdig sein ;)", "created_utc": "1586795802.0", "edited": "False", "id": "fnadwu9", "is_submitter": "False", "link_id": "t3_g0fv55", "parent_id": "t1_fnab11f", "score": "2", "subreddit": "German", "subreddit_id": "t5_2qq51"}, {"author": "Makqa", "body": "Danke schön für die Antworten!", "created_utc": "1586772270.0", "edited": "False", "id": "fn9gnyu", "is_submitter": "False", "link_id": "t3_g0fv55", "parent_id": "t3_g0fv55", "score": "3", "subreddit": "German", "subreddit_id": "t5_2qq51"}, {"author": "Makqa", "body": "I see, thanks!", "created_utc": "1586715704.0", "edited": "False", "id": "fn794em", "is_submitter": "True", "link_id": "t3_fzdz5v", "parent_id": "t1_fn77nif", "score": "1", "subreddit": "darksouls", "subreddit_id": "t5_2sazo"}, {"author": "Makqa", "body": "Will keep in mind, thanks ;)", "created_utc": "1586712862.0", "edited": "False", "id": "fn740pa", "is_submitter": "True", "link_id": "t3_fzdz5v", "parent_id": "t1_fn71kmb", "score": "2", "subreddit": "darksouls", "subreddit_id": "t5_2sazo"}, {"author": "Makqa", "body": "Thanks:)))", "created_utc": "1586708677.0", "edited": "False", "id": "fn6wfhy", "is_submitter": "True", "link_id": "t3_fzdz5v", "parent_id": "t1_fn6v0by", "score": "1", "subreddit": "darksouls", "subreddit_id": "t5_2sazo"}, {"author": "Makqa", "body": "Ps4", "created_utc": "1586703318.0", "edited": "False", "id": "fn6n8um", "is_submitter": "True", "link_id": "t3_fzdz5v", "parent_id": "t1_fn6gaz6", "score": "2", "subreddit": "darksouls", "subreddit_id": "t5_2sazo"}, {"author": "Makqa", "body": "Yeah, my dex was 30, strength 13 i guess I also didn't have much balance since every arrow they shot into my shield I would fly off like a rag. But I don't know anyway", "created_utc": "1586687471.0", "edited": "False", "id": "fn64u5r", "is_submitter": "True", "link_id": "t3_fzdz5v", "parent_id": "t1_fn5t6ze", "score": "2", "subreddit": "darksouls", "subreddit_id": "t5_2sazo"}, {"author": "Makqa", "body": "I guess just as it always happens in Dark Souls you just adapt. In my case I started to wildly roll back and forth trying to dodge the arrows from behind as well. Thrashed around like a half-dead monkey for some time after getting hit from behind then the dude just fell off by himself. Yep", "created_utc": "1586686617.0", "edited": "False", "id": "fn642vk", "is_submitter": "True", "link_id": "t3_fzdz5v", "parent_id": "t1_fn61qxu", "score": "2", "subreddit": "darksouls", "subreddit_id": "t5_2sazo"}, {"author": "Makqa", "body": "Well, I got wrecked about 15-20 times there", "created_utc": "1586679376.0", "edited": "False", "id": "fn5xgtu", "is_submitter": "True", "link_id": "t3_fzdz5v", "parent_id": "t1_fn5wt9m", "score": "2", "subreddit": "darksouls", "subreddit_id": "t5_2sazo"}, {"author": "Makqa", "body": "Oh, so this is what that tower is about??!  (If I understand correctly that gap in front of a giant putting big balls in the hole?).  Fuck, when I was checking out that hole I thought it was too wide to jumper over so i didn't *facepalm*. Thanks , mate ;)", "created_utc": "1586679239.0", "edited": "False", "id": "fn5xc8m", "is_submitter": "True", "link_id": "t3_fzdz5v", "parent_id": "t1_fn5vt0c", "score": "3", "subreddit": "darksouls", "subreddit_id": "t5_2sazo"}, {"author": "Makqa", "body": "Fair enough, haha", "created_utc": "1586678954.0", "edited": "False", "id": "fn5x2bw", "is_submitter": "True", "link_id": "t3_fzdz5v", "parent_id": "t1_fn5vl2m", "score": "1", "subreddit": "darksouls", "subreddit_id": "t5_2sazo"}, {"author": "Makqa", "body": "No, thanks, already got through that place ')", "created_utc": "1586678762.0", "edited": "False", "id": "fn5wvlm", "is_submitter": "True", "link_id": "t3_fzdz5v", "parent_id": "t1_fn5qaoy", "score": "1", "subreddit": "darksouls", "subreddit_id": "t5_2sazo"}, {"author": "Makqa", "body": "I'm kind of lost here when you mention the key and the cage. It''s(obviously ) my first playthrough, so I feel like I could have missed something. Thanks anyway, though :)", "created_utc": "1586669983.0", "edited": "False", "id": "fn5nov5", "is_submitter": "True", "link_id": "t3_fzdz5v", "parent_id": "t1_fn5jboz", "score": "2", "subreddit": "darksouls", "subreddit_id": "t5_2sazo"}, {"author": "Makqa", "body": "Should have bought them", "created_utc": "1586666114.0", "edited": "False", "id": "fn5ixwk", "is_submitter": "True", "link_id": "t3_fzdz5v", "parent_id": "t1_fn5dqdb", "score": "2", "subreddit": "darksouls", "subreddit_id": "t5_2sazo"}, {"author": "Makqa", "body": "Well, imps are a headache, especially the one giving a farewell back strike with a  lightning spear when you've already swept past them", "created_utc": "1586665971.0", "edited": "False", "id": "fn5ir4v", "is_submitter": "True", "link_id": "t3_fzdz5v", "parent_id": "t1_fn5fle5", "score": "2", "subreddit": "darksouls", "subreddit_id": "t5_2sazo"}, {"author": "Makqa", "body": "I don't think I have that ring ;)", "created_utc": "1586665795.0", "edited": "False", "id": "fn5ij22", "is_submitter": "True", "link_id": "t3_fzdz5v", "parent_id": "t1_fn4l2oq", "score": "1", "subreddit": "darksouls", "subreddit_id": "t5_2sazo"}, {"author": "Makqa", "body": "Stock up*", "created_utc": "1586665544.0", "edited": "False", "id": "fn5i7f3", "is_submitter": "True", "link_id": "t3_fzdz5v", "parent_id": "t1_fn5i6hm", "score": "1", "subreddit": "darksouls", "subreddit_id": "t5_2sazo"}, {"author": "Makqa", "body": "I guess you always need to stick up on arrows wherever there's a need or not. Because when I finally got to them I had none, haha", "created_utc": "1586665524.0", "edited": "False", "id": "fn5i6hm", "is_submitter": "True", "link_id": "t3_fzdz5v", "parent_id": "t1_fn4xs4q", "score": "2", "subreddit": "darksouls", "subreddit_id": "t5_2sazo"}, {"author": "Makqa", "body": "Well, going to the tomb is in my opinion far easier, it's basically where the skeletons are just a bit below your home bonfire", "created_utc": "1586665334.0", "edited": "False", "id": "fn5hxms", "is_submitter": "True", "link_id": "t3_fzdz5v", "parent_id": "t1_fn52o82", "score": "1", "subreddit": "darksouls", "subreddit_id": "t5_2sazo"}, {"author": "Makqa", "body": "I guess you need to know how to sprint, because every time I tried that he would send me down, but I guess it's also because I was using a shield(goddam habit) and was a bit turned to the right.", "created_utc": "1586665115.0", "edited": "False", "id": "fn5hn72", "is_submitter": "True", "link_id": "t3_fzdz5v", "parent_id": "t1_fn4sk8f", "score": "1", "subreddit": "darksouls", "subreddit_id": "t5_2sazo"}, {"author": "Makqa", "body": "Haha, yeah, they beat the shit out of me when I needed to get our of the tomb of giants cause i'd gone too deep", "created_utc": "1586664881.0", "edited": "False", "id": "fn5hc8w", "is_submitter": "True", "link_id": "t3_fzdz5v", "parent_id": "t1_fn4im8c", "score": "1", "subreddit": "darksouls", "subreddit_id": "t5_2sazo"}, {"author": "Makqa", "body": "Yeah, I understand. Poison arrows rock, but I didn't buy them since you can't teleport at first", "created_utc": "1586664773.0", "edited": "False", "id": "fn5h71n", "is_submitter": "True", "link_id": "t3_fzdz5v", "parent_id": "t1_fn44yqo", "score": "2", "subreddit": "darksouls", "subreddit_id": "t5_2sazo"}, {"author": "Makqa", "body": "I did exactly that, but like before you figure that out you die 15 times , well, in my case.", "created_utc": "1586664639.0", "edited": "False", "id": "fn5h0sb", "is_submitter": "True", "link_id": "t3_fzdz5v", "parent_id": "t1_fn4l4rx", "score": "1", "subreddit": "darksouls", "subreddit_id": "t5_2sazo"}, {"author": "Makqa", "body": "Can't argue with that", "created_utc": "1586664291.0", "edited": "False", "id": "fn5gk09", "is_submitter": "True", "link_id": "t3_fzdz5v", "parent_id": "t1_fn506vl", "score": "38", "subreddit": "darksouls", "subreddit_id": "t5_2sazo"}, {"author": "Makqa", "body": "Definitely worth the money", "created_utc": "1586638919.0", "edited": "False", "id": "fn4d4jd", "is_submitter": "True", "link_id": "t3_fzdz5v", "parent_id": "t1_fn41h9w", "score": "165", "subreddit": "darksouls", "subreddit_id": "t5_2sazo"}, {"author": "Makqa", "body": "Thanks God I finally got through that ass barrage. Thanks any way, though :)", "created_utc": "1586638264.0", "edited": "False", "id": "fn4c0es", "is_submitter": "True", "link_id": "t3_fzdz5v", "parent_id": "t1_fn4bg9v", "score": "26", "subreddit": "darksouls", "subreddit_id": "t5_2sazo"}, {"author": "Makqa", "body": "Lmao", "created_utc": "1586634724.0", "edited": "False", "id": "fn45y2y", "is_submitter": "True", "link_id": "t3_fzdz5v", "parent_id": "t1_fn44yw1", "score": "7", "subreddit": "darksouls", "subreddit_id": "t5_2sazo"}, {"author": "Makqa", "body": "Haha, I get it, thanks ;)", "created_utc": "1586632812.0", "edited": "False", "id": "fn42n0b", "is_submitter": "True", "link_id": "t3_fzdz5v", "parent_id": "t1_fn4234p", "score": "19", "subreddit": "darksouls", "subreddit_id": "t5_2sazo"}, {"author": "Makqa", "body": "Now, this is the funniest thing. Finally got to the bonfire and here's this sun dude chilling. 'Oh, ThErE yOu ArE. Lmao", "created_utc": "1586632139.0", "edited": "False", "id": "fn41h9w", "is_submitter": "True", "link_id": "t3_fzdz5v", "parent_id": "t3_fzdz5v", "score": "336", "subreddit": "darksouls", "subreddit_id": "t5_2sazo"}, {"author": "Makqa", "body": "feel you", "created_utc": "1586631908.0", "edited": "False", "id": "fn4132l", "is_submitter": "True", "link_id": "t3_fzdz5v", "parent_id": "t1_fn410kp", "score": "5", "subreddit": "darksouls", "subreddit_id": "t5_2sazo"}, {"author": "Makqa", "body": "Yeah, I've also figured you can bait him into coming after you and if there's an angle he will just scriptedly fall down. Did it one time and then the mimic ate me *facepalm*", "created_utc": "1586631632.0", "edited": "False", "id": "fn40lvg", "is_submitter": "True", "link_id": "t3_fzdz5v", "parent_id": "t1_fn3zxsn", "score": "5", "subreddit": "darksouls", "subreddit_id": "t5_2sazo"}, {"author": "Makqa", "body": "yeah, the salt is real", "created_utc": "1586631419.0", "edited": "False", "id": "fn408hk", "is_submitter": "True", "link_id": "t3_fzdz5v", "parent_id": "t1_fn3zxl4", "score": "34", "subreddit": "darksouls", "subreddit_id": "t5_2sazo"}, {"author": "Makqa", "body": "Yeah, I like that ;) Never knew though that putting many signs down at the same boss affects your gameplay", "created_utc": "1586435937.0", "edited": "False", "id": "fmvznsf", "is_submitter": "True", "link_id": "t3_fxq2oc", "parent_id": "t1_fmvyz6d", "score": "2", "subreddit": "DarkSouls2", "subreddit_id": "t5_2vqni"}, {"author": "Makqa", "body": "It's cool, thanks ;)", "created_utc": "1586406109.0", "edited": "False", "id": "fmv4th2", "is_submitter": "False", "link_id": "t3_fxbgfz", "parent_id": "t1_fmtv3xg", "score": "1", "subreddit": "DarkSouls2", "subreddit_id": "t5_2vqni"}, {"author": "Makqa", "body": "Yeah, i see, thanks", "created_utc": "1586369315.0", "edited": "False", "id": "fmta4se", "is_submitter": "False", "link_id": "t3_fxb9ox", "parent_id": "t1_fmt95ft", "score": "1", "subreddit": "darksouls", "subreddit_id": "t5_2sazo"}, {"author": "Makqa", "body": "Ah, thanks, I'm new here, so I'm a bit confused :)", "created_utc": "1586368798.0", "edited": "False", "id": "fmt90yq", "is_submitter": "False", "link_id": "t3_fxb9ox", "parent_id": "t1_fmt8xke", "score": "1", "subreddit": "darksouls", "subreddit_id": "t5_2sazo"}]