[{"author": "MassiveNwah", "body": "South Yorkshire, in England.\n\nNo clue how widespread it is, may just be my speech, but most /o/ vowels, particularly before an \"r\" or spelt as \"oo\" become /u:ə/.\n\n This happens inconsistently, and extends to words like \"before\" /bɪˈfu:ə/, and \"goat\" /ˈguːət/. Door, floor, more, sore, poor, Moor, chore, etc. \n\nA similar thing happens with front vowels, and is characteristic of the local dialect. \"Here\" and \"there\" /hiə/ and /ðiə/\nMeat, head, leaf, read, etc all show the same vowel.\n\nInterestingly, I never mix up there, their, and they're, because they aren't homophones to me. /ðiə/, /ðɛ:/, and /ðeːə/ respectively.", "created_utc": "1665872033.0", "edited": "False", "id": "isgx44v", "is_submitter": "False", "link_id": "t3_y4qfeq", "parent_id": "t3_y4qfeq", "score": "13", "subreddit": "linguistics", "subreddit_id": "t5_2qhos"}, {"author": "MassiveNwah", "body": "Yep, it would feel wrong for them to be lower than that.", "created_utc": "1664923008.0", "edited": "False", "id": "ir2ulqs", "is_submitter": "False", "link_id": "t3_xvhw8y", "parent_id": "t1_ir2jslx", "score": "2", "subreddit": "HomeImprovement", "subreddit_id": "t5_2ql97"}, {"author": "MassiveNwah", "body": "That's odd, I very rarely see light switches below 4' 6\" myself, usually higher.\n\nIn my house, they are all about 5'. Any lower just seems inconvenient, as you then have to look for the switch instead of it being at a ready height.\n\nI may have a normalcy bias, whereby this is what I was brought up with.\n\nIt's a council house though so cost-cutting could well be a reason.", "created_utc": "1664909972.0", "edited": "False", "id": "ir1wo9l", "is_submitter": "False", "link_id": "t3_xvhw8y", "parent_id": "t3_xvhw8y", "score": "2", "subreddit": "HomeImprovement", "subreddit_id": "t5_2ql97"}, {"author": "MassiveNwah", "body": "Red Hot poker is a common name for Kniphofia, a common garden plant.", "created_utc": "1664404647.0", "edited": "False", "id": "iqans12", "is_submitter": "False", "link_id": "t3_xqfxpn", "parent_id": "t1_iq9gy6c", "score": "1", "subreddit": "worldbuilding", "subreddit_id": "t5_2rd6n"}, {"author": "MassiveNwah", "body": "What really worked for me was interlinear texts, especially ones that translate word by word rather than idiomatically as that way you can just look down on a word you don't know and carry on reading, but the word-for-word translation hinders the temptation to just read in English.\n\nFor beginner-level interlinear texts, if you are willing to put money in, the \"Hyplearn\" books on amazon are quite cheap (£2.15 for \\~100 of content on kindle app). These do seem a bit mass-produced and may have a few typos, but they get the job done.\n\nDepending on the language there are also free online interlinear texts, but I spend about three times as long looking for materials than using them, so paying acts as incentive **to** use them.", "created_utc": "1663017964.0", "edited": "False", "id": "io6apzu", "is_submitter": "False", "link_id": "t3_xbzmds", "parent_id": "t3_xbzmds", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "MassiveNwah", "body": "Soy is a legume, like a bean or pea, and is very high in protein (for a plant). Soy eating is still herbivorous.", "created_utc": "1662505027.0", "edited": "False", "id": "indlogs", "is_submitter": "False", "link_id": "t3_x66xdx", "parent_id": "t1_in9un8v", "score": "1", "subreddit": "NatureofPredators", "subreddit_id": "t5_6sz7xl"}, {"author": "MassiveNwah", "body": "Looking at the rest of your channel, I have subscribed, my kind of music definitely.\n\nYour original music is quite nice as well.", "created_utc": "1662372669.0", "edited": "False", "id": "in619yb", "is_submitter": "False", "link_id": "t3_x6a9zu", "parent_id": "t1_in612ph", "score": "3", "subreddit": "mandolin", "subreddit_id": "t5_2rsc7"}, {"author": "MassiveNwah", "body": "I absolutely love this song. I never thought that  someone would make a tab for it.\n\nThank you so much, it captures the feel of the original really well even with just the mandolin.\n\nMy only suggestion would be to add timing. Even just an indication of half, quarter, and eighth notes. Would make it much easier to read and play without having heard the song.", "created_utc": "1662372497.0", "edited": "1662372865.0", "id": "in612ph", "is_submitter": "False", "link_id": "t3_x6a9zu", "parent_id": "t3_x6a9zu", "score": "3", "subreddit": "mandolin", "subreddit_id": "t5_2rsc7"}, {"author": "MassiveNwah", "body": "The ending \"-er\" means someone who does something. \n\nSo a \"meter\" would be someone who \"metes \" and a \"scepter\" would be someone who \"scepts\"\n\nIt is just because these words come from French and that is how they spelt it. Imagine saying metre with an over the top French accent, really strong r and no schwa and you'll see why the r comes first.\n\nIf it isn't a person, then \"re\" is more likely usually.", "created_utc": "1662371388.0", "edited": "False", "id": "in5zrnt", "is_submitter": "False", "link_id": "t3_x5tisp", "parent_id": "t1_in5vfce", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "MassiveNwah", "body": "At least in British English (I AM biased), it is a verb which has had \"-er\" put on it. Traveler just seems a bit bare, so you double that final l. Same for \"-ING\". Level, leveller, levelling. Allot, allotter, allotting.\n\nThe unfortunate part is that we only do this for some verbs, but as a rule verbs ending in l double.", "created_utc": "1662331955.0", "edited": "False", "id": "in44irp", "is_submitter": "False", "link_id": "t3_x5tisp", "parent_id": "t1_in3tmvc", "score": "5", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "MassiveNwah", "body": "That's an acceptable pronunciation for \"clothes\" as well. Very common, and regional variations on the vowels exist also: my own \"clooas\", \"claes\", \"clos\". As long as it starts with CL, has a back vowel, and ends with s it should be good.", "created_utc": "1662331548.0", "edited": "False", "id": "in43nqr", "is_submitter": "False", "link_id": "t3_x5tisp", "parent_id": "t1_in3tv40", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "MassiveNwah", "body": "As good a source as any (better than most tbh)", "created_utc": "1661893595.0", "edited": "False", "id": "imfs8m4", "is_submitter": "False", "link_id": "t3_x0n1wk", "parent_id": "t1_imf27pw", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "MassiveNwah", "body": "Obligatory mention that thou and thee are still in use in dialect, mostly in the north of England, and to a lesser extent the traditional West Country.\n\nAlthough where I am thou has shifted to /ða:/, and thy to /ðɪ/. Neither of these cause any confusion though, so your point still stands.", "created_utc": "1661883139.0", "edited": "False", "id": "imf0wan", "is_submitter": "False", "link_id": "t3_x12vlh", "parent_id": "t1_imdr4si", "score": "4", "subreddit": "linguistics", "subreddit_id": "t5_2qhos"}, {"author": "MassiveNwah", "body": "A colliery is a coal mine, \"pit\" is the more common word colloquially around here.\n\nAs in \"Ahr Judd's gooin' dahn't pit.\" If you're under 20 or female, then more standard pronunciation is likely: \"Our Judd's going down't pit. \"\n\nLignite is a grade of coal, but a really poor one that's only good for power plants, I think it's what they use those mad max looking machines in Germany for because you need a lot of it to get what you would out of decent coal.", "created_utc": "1661880907.0", "edited": "False", "id": "imev3fq", "is_submitter": "False", "link_id": "t3_x0n1wk", "parent_id": "t1_imcr4g7", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "MassiveNwah", "body": "I'm learning a few hundred plant names in my TL (I'm a gardener, and it has a garden center). But I have no idea what the word for station or other forms of transport beyond car or train is. Different folk have different needs.", "created_utc": "1661815751.0", "edited": "False", "id": "imbip2v", "is_submitter": "False", "link_id": "t3_x0n1wk", "parent_id": "t1_im9jk2m", "score": "0", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "MassiveNwah", "body": "Not even collieries? Or lignite etc?\n\nTbf very few need these words, I only know them because I come from the big coal belt of England, on top of the Barnsley seam.", "created_utc": "1661815415.0", "edited": "False", "id": "imbhzhg", "is_submitter": "False", "link_id": "t3_x0n1wk", "parent_id": "t1_ima0dm6", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "MassiveNwah", "body": "True, it is probably just that I'm farther removed from it, being up north and in a not quite so well off area, makes it seem less important and prevalent than it really is.", "created_utc": "1661189733.0", "edited": "False", "id": "ilcitcl", "is_submitter": "False", "link_id": "t3_wuafdz", "parent_id": "t1_ilb65no", "score": "1", "subreddit": "linguistics", "subreddit_id": "t5_2qhos"}, {"author": "MassiveNwah", "body": "From Barnsley, not Birmingham, but interesting to see a shared connection via Yorkshire. No th-fronting here, I did pick it up from TV when I was a child but have grown out of it years since.", "created_utc": "1661189391.0", "edited": "False", "id": "ilchwzf", "is_submitter": "False", "link_id": "t3_wuafdz", "parent_id": "t1_ilb264e", "score": "1", "subreddit": "linguistics", "subreddit_id": "t5_2qhos"}, {"author": "MassiveNwah", "body": "I can't speak for RP, as very few speak that and I'm not one of them, but this is what it would be for me.\n\nAt least with the speech in my area, /ð/ doesn't get assimilated, in fact it is usually the /n/ that gets lost in rapid speech (although this is extremely uncommon unless you're drunk, we are far more likely **not** to assimilate /nð/). For example, \"in there\" -> /ɪn ði:ə/ -> /ɪ ðiə/. \n\nAn example in a sentence might be \"put a key in there\" -> /pʊɹə ki ɪ ði:ə/.", "created_utc": "1661163562.0", "edited": "False", "id": "ilaxyk6", "is_submitter": "False", "link_id": "t3_wuafdz", "parent_id": "t3_wuafdz", "score": "1", "subreddit": "linguistics", "subreddit_id": "t5_2qhos"}, {"author": "MassiveNwah", "body": "Something this strong usually hits us at least once every few months, and isn't anything to worry over really. For reference, [spaceweather.com](https://spaceweather.com) is the best place to find out about  geomagnetic storms (over the past few months I've seen it average one a week, sometimes two). This is the strongest in a while, but the scale they are measured on is logarithmic which says volumes.\n\nInterestingly, this storm is made up of two CMEs, but the second one may catch up to first and \"cannibalise\" it.", "created_utc": "1660866477.0", "edited": "False", "id": "ikv6mcx", "is_submitter": "False", "link_id": "t3_wrqpiu", "parent_id": "t3_wrqpiu", "score": "8", "subreddit": "thelongdark", "subreddit_id": "t5_2ygr3"}, {"author": "MassiveNwah", "body": "It's not that bad.\n\nJust seems like normal life to me, which is the point I suppose.\n\nProbably helps I am from Barnsley, though.", "created_utc": "1660001036.0", "edited": "False", "id": "ijibdmo", "is_submitter": "False", "link_id": "t3_wjji41", "parent_id": "t1_ijhwk0f", "score": "3", "subreddit": "AskUK", "subreddit_id": "t5_2t4s3"}, {"author": "MassiveNwah", "body": "Scabious and cornflowers can go into September time if it isn't unusually cold.", "created_utc": "1659862405.0", "edited": "False", "id": "ijagrsr", "is_submitter": "False", "link_id": "t3_wi1928", "parent_id": "t3_wi1928", "score": "2", "subreddit": "GardeningUK", "subreddit_id": "t5_31s8w"}, {"author": "MassiveNwah", "body": "YORKSHIRE\n\nWHITE ROSE\n\nStill use thee and Thou lol.", "created_utc": "1659338988.0", "edited": "False", "id": "iihcb4e", "is_submitter": "False", "link_id": "t3_wcvdk9", "parent_id": "t3_wcvdk9", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "MassiveNwah", "body": "No problem", "created_utc": "1659133702.0", "edited": "False", "id": "ii6qv3q", "is_submitter": "False", "link_id": "t3_wb5coj", "parent_id": "t1_ii6mvpz", "score": "2", "subreddit": "gardening", "subreddit_id": "t5_2qhkh"}, {"author": "MassiveNwah", "body": "Unfortunately where I live it's the opposite. Rich folk live in the country and drive the plebs into towns. An American suburbia style house, like you see in the movies, outside a town centre would run over half a million pounds. In the country probably over a million.", "created_utc": "1659133672.0", "edited": "False", "id": "ii6qsmb", "is_submitter": "False", "link_id": "t3_wb5coj", "parent_id": "t1_ii6ozkh", "score": "1", "subreddit": "gardening", "subreddit_id": "t5_2qhkh"}, {"author": "MassiveNwah", "body": "What sort of oak are they? I'm unfamiliar with (I assume) American oak species.\n\nAnd you must have done well to get a property that size! One can dream, but I hope you're living it.\n\nSo I imagine there's not much you can do beyond live with the heat? The plants must love it at least.", "created_utc": "1659130108.0", "edited": "False", "id": "ii6ih5p", "is_submitter": "False", "link_id": "t3_wb5coj", "parent_id": "t1_ii6dcqv", "score": "2", "subreddit": "gardening", "subreddit_id": "t5_2qhkh"}, {"author": "MassiveNwah", "body": "There's always the fact that since we are just doing a shift to get many hundreds pinched out we are a bit more aggressive with it. We know how much a plant can take, and we simply pinch back to a few inches of the pot rim in small sizes (for trailers like bacopa). Repeat this many times over a month or two as you put them out for sale and you're golden. Given that bedding and hanging basket plants are only really grown to be sold in small three inch pots or to be made up into pre-planted baskets we don't have to worry about when they are big.\n\nBut if you just take a few flowers off a day, or pinch back any fresh stems with more than a few nodes then the plant will be compact and floriferous.\n\nPlants grown from seed, especially at home, will always be leggier because they are given more space than nurseries which cram as many as possible in a tray, or use plug sockets. These germinate and are shipped off to small garden centre nurseries to grow on individually.\n\nRemember taking less off now is taking more away from you a fortnight from now, bedding plants **need** to be a little stressed from the pinching out to start making flowers en masse. Then you just deadhead and take off a few inner flowerbuds to encourage more.\n\nFeed with tomato fertiliser, you want to encourage flowers not leaf.\n\nWater deeply and infrequently, it will make for a stockier but healthier plant.\n\nAnd respect spacing, say you've got a few viola plugs: In my experience these will get to a foot wide and a similar size tall, at least before they succumbed to mildew :(  So you must give them a foot spacing to get plants which haven't crowded each other out, and can be a feature in their own right. It might look sparce now but you must allot them a fair bit of space to grow. For example, I would use no more than three or four bedding plugs (alyssum, bacopa, viola, pansies, calibrachoa etc.) for an 18in pot. Three would fill the edges and then get a centrepiece dahlia or something similar. My favourite pot combo has always been a white/yellow dahlia with purplish ageratum around it, in the largest pot width you can find.", "created_utc": "1659129826.0", "edited": "False", "id": "ii6ht76", "is_submitter": "False", "link_id": "t3_wb5coj", "parent_id": "t1_ii6etuh", "score": "17", "subreddit": "gardening", "subreddit_id": "t5_2qhkh"}, {"author": "MassiveNwah", "body": "That's wonderful! Spring is definitely best, far more colour than summer in my experience. Autumn leaf-clearing is quite meditative, once I got past the fact we're using builder's ton bags to move the leaves about.\n\nPumpkins already?! Mine haven't even set yet. Lucky!\n\nNo clue what crape myrtles are, but being in different climates that's hardly a surprise.\n\nHave you got plenty of shade at least?", "created_utc": "1659126348.0", "edited": "False", "id": "ii69eue", "is_submitter": "False", "link_id": "t3_wb5coj", "parent_id": "t1_ii68kgr", "score": "2", "subreddit": "gardening", "subreddit_id": "t5_2qhkh"}, {"author": "MassiveNwah", "body": "I can't quite remember, but I think it was somewhere between 15 and 20 Celsius.\n\nThat's 59-68 in Fahrenheit, and I thought that was hot!\n\nJesus things must get hot where you live! \n\nIts the peak of summer here \"in't North 'n England\", and 80 is a fair bit hotter than what we've been getting since that big heatwave last week.", "created_utc": "1659125743.0", "edited": "False", "id": "ii67x9f", "is_submitter": "False", "link_id": "t3_wb5coj", "parent_id": "t1_ii659sa", "score": "2", "subreddit": "gardening", "subreddit_id": "t5_2qhkh"}, {"author": "MassiveNwah", "body": "Been an apprentice at a Historic Garden/ Garden centre for a year now. Weeding was restricted to after the bulbs finished in late spring and before the perennials fleshed out three weeks after. Lots o' weeding. Paths as well, I hate them.\n\nAs a hobby, gardening is always fun, but working in it, you learn to call it satisfying, and fun on occasion. Watching a massive sycamore get felled and standing chatting to tree surgeons for three days is fun, dealing with the new tree parts is not so much.\n\nI rarely weed my own garden, as those hundred hours in May take up all the fun.\n\nOn the brightside, I now know that the \"swoe\" is the best hoe shape if you use a pull-stroke. \n\n&#x200B;\n\nWeeding gravel will never not be enjoyable, but is only fun for the first few hours lol.", "created_utc": "1659123184.0", "edited": "False", "id": "ii61lne", "is_submitter": "False", "link_id": "t3_wb5coj", "parent_id": "t1_ii5vsbx", "score": "3", "subreddit": "gardening", "subreddit_id": "t5_2qhkh"}, {"author": "MassiveNwah", "body": "As an apprentice at a historic garden: How much walking would be involved. \n\nJUST what my phone's pedometer has recorded is 1,112.63 miles so far this year, or 2.5 million steps.\n\nAnd I'm not the one who does most of the mowing lol.\n\nAlso:\n\n* Try to drown your plants once a month then ignore them until next month, they'll do better.\n* Mulch is a panacea, apply it to any bare soil, every winter.\n* Spring is the most colourful month, not summer. Snowdrops and bluebells in their thousands.\n* More laburnum trees are urgently needed in your area.\n* Don't bother with weeding everything all the time, just grow enough to cover it up, and hoe while they grow.\n* Old-fashioned perennial borders *need* to come back in style. Highlights here are hemerocallis, crocosmia, astilbe, astrantia, hosta, gunnera, caltha, helleborus, dicentra, geranium (proper ones, not pelargonium)  etc.\n* Bulbs are my favourites. Recommendations include, snowdrops, bluebells, fritillaria imperialis, fritillaria meleagris, daffodils, crocus, winter aconite, anemone, eucomis, gladiolus, iris reticulata, normal iris, bearded iris, flag iris, agapanthus, hyacinth, muscari armeniacum etc.\n* LATIN NAMES ARE YOUR FRIEND. If you do not use proper latin names, or know them, you are intentionally making life harder for yourself. In many, many ways. This may impact you less if you don't have to deal with dozens of geranium and pelargonium varieties, or twenty different maple species, and the public's ignorance towards them.\n* Ponds are amazing, but if you don't have one keep it that way. Any more than one of those half-barrels is far more effort than its worth.\n* Trees have more leaves than you think. It is JULY and I have cleared \\~15 cubic yards of **condensed** leaves from the recent heatwave. It doesn't help that our biggest trees are also quite elderly.\n* I live in England, if you do too, congratulations! You can just plant something and forget about it. It will grow. That is, if you planted nettles and pineappleweed.\n*  Dog roses and blackberries are indestructable and you will never get rid of them. Learn to love them instead, and leave them in the countryside and allotments where they belong.", "created_utc": "1659122571.0", "edited": "False", "id": "ii602da", "is_submitter": "False", "link_id": "t3_wb5coj", "parent_id": "t3_wb5coj", "score": "10", "subreddit": "gardening", "subreddit_id": "t5_2qhkh"}, {"author": "MassiveNwah", "body": "It is nice, until you've got sixteen acres of public gardens to weed, by hand and hoe, eight hours a day for all of May. Needless to say, I used to like weeding, but now it gives me literal shivers to look at a dandelion.", "created_utc": "1659120679.0", "edited": "False", "id": "ii5vbuv", "is_submitter": "False", "link_id": "t3_wb5coj", "parent_id": "t1_ii4wy64", "score": "3", "subreddit": "gardening", "subreddit_id": "t5_2qhkh"}, {"author": "MassiveNwah", "body": "Alternatively, gardening can take a lot more of your time, and make you money!\n\nSource: I work as a gardener (actually an apprentice, but I still make something from it)", "created_utc": "1659119859.0", "edited": "False", "id": "ii5t9ca", "is_submitter": "False", "link_id": "t3_wb5coj", "parent_id": "t1_ii4qdna", "score": "3", "subreddit": "gardening", "subreddit_id": "t5_2qhkh"}, {"author": "MassiveNwah", "body": "I work at a garden centre/ historic garden, with its own nursery, and can say the amount of fertiliser used isn't excessive.  We just use an old plastic cup with a line marked on it an a washing machine powder thingamajig, so I can't give exact measurements.\n\nIf its a plant that isn't going to be eaten, we use half a mug full (roughly) of pellet fertiliser and roughly two water bottle lid fulls of granular insecticide. For a 75 litre bag of compost.\n\nThe trick is that the fertiliser is made to last up to 5 or 6 months, which keeps the plants well fed while growing on and being on the shelf. Keeping in mind that most folk don't really feed their plants and that is one of the reasons that nursery bought plants seem to do so well: They are just not being starved or overfed.\n\nThat and premium professional compost is a much better medium than anything you or I can just buy.", "created_utc": "1659119593.0", "edited": "False", "id": "ii5sld7", "is_submitter": "False", "link_id": "t3_wb5coj", "parent_id": "t1_ii5mb2s", "score": "83", "subreddit": "gardening", "subreddit_id": "t5_2qhkh"}, {"author": "MassiveNwah", "body": "I am aware that muffin is the more common term for them, but in my area they usually get called buns. The only other things we might refer to as a bun are certain hairstyles and burger bread.\n\nA small loaf of bread usually gets called a \"teacake\" here.\n\nTechnically speaking, there is no \"correct\" terms, especially with food. Merely what people use. But in all fairness, where I come from we still use \"thou\" and \"thee\" (although they have evolved to \"tha\" and \"thi\") so I probably can't say much!\n\nThe \"round multi holed pan\" sounds like a Yorkshire pudding tin to me! \n\nWHITE ROSE! /s", "created_utc": "1658403800.0", "edited": "False", "id": "ih1dvaf", "is_submitter": "False", "link_id": "t3_vecxoz", "parent_id": "t1_ih05cgu", "score": "2", "subreddit": "Sexyspacebabes", "subreddit_id": "t5_3so9zk"}, {"author": "MassiveNwah", "body": "There's no better way!\n\n (that's honourable at least)", "created_utc": "1658349468.0", "edited": "False", "id": "igypfws", "is_submitter": "False", "link_id": "t3_vecxoz", "parent_id": "t1_igwwdac", "score": "2", "subreddit": "Sexyspacebabes", "subreddit_id": "t5_3so9zk"}, {"author": "MassiveNwah", "body": "Indeed, it would seem they have much to learn regarding how to treat *human* food lol.\n\n This is an amazing story by the way, having now read through the lot so far, it never failed to get a laugh in each chapter. You have a talent for the comedic. Keep on the good work!", "created_utc": "1658307748.0", "edited": "False", "id": "igw7m8s", "is_submitter": "False", "link_id": "t3_vecxoz", "parent_id": "t1_iguhmmz", "score": "2", "subreddit": "Sexyspacebabes", "subreddit_id": "t5_3so9zk"}, {"author": "MassiveNwah", "body": "While having not played Elden Ring, I do wonder at the context in which the 2p.informal \"thou\" and \"thee\" (/ðaː/ and /ðɪ/, in my own speech, as these pronouns *are* still in use in my part of northern England. /ðai/ when a vowel follows *tha*). \n\nWhile I am unsure if the writers thought about it, having not played the game, different people using *tha* and *thi* give off very different nuances. If they just blanket implemented \"thou\" then this would be a missed opportunity. \n\nFrom my own perspective of the word, an enemy boss using \"thou\" would come across as condescending or insulting. This is because \"thou\" is used with close friends and family, and your social inferiors (as well as your equals, but that use has died off a bit). It would be like saying they view you as lesser than them. Like the old saying, \"*Dunt tha thee them as thees thee,\"* meaning that you shouldn't use the informal form towards those who are your betters (or equals in slightly later usage, this is much laxer in the present though).\n\nIn contrast, a trader or friendly character using *tha* come across as being friendly and familiar, emphasising that you are both on a similar footing in society, or are close friends. You probably wouldn't want to use *tha* back to a trader though as they would be above a mere traveller or what-ever-you-play-as.\n\nIt is extremely similar (indeed it is a form of the T-V distinction) to the usage of *tu* and *vous* in French*,* or *ty* and *pan/panie* in Polish.", "created_utc": "1658307560.0", "edited": "False", "id": "igw7dtm", "is_submitter": "False", "link_id": "t3_w2x68e", "parent_id": "t3_w2x68e", "score": "1", "subreddit": "linguistics", "subreddit_id": "t5_2qhos"}, {"author": "MassiveNwah", "body": "In all fairness to Phin, what sort of weirdo puts \\*muffins\\* (such an odd word, I've always called them buns) in the fridge.\n\nPut them in a cupboard like a civilised person.", "created_utc": "1658235650.0", "edited": "False", "id": "igrtopb", "is_submitter": "False", "link_id": "t3_vecxoz", "parent_id": "t3_vecxoz", "score": "2", "subreddit": "Sexyspacebabes", "subreddit_id": "t5_3so9zk"}, {"author": "MassiveNwah", "body": "For me, I just never wore it except on holiday or heatwaves like this one we've just had.\n\nI get away without burns (for the most part, I did have a tender neck in May) because my job is 100% outside so I don't have the problem of sudden exposure, I always have at least eight hours of sunshine, unless it isn't shining or is winter.\n\nI do feel an idiot when it's like this though, because I never made it a habit I have been like the living dead this past week. Wearing suncream can't hurt, sunburn certainly does.", "created_utc": "1656019744.0", "edited": "False", "id": "idhczp0", "is_submitter": "False", "link_id": "t3_viwj42", "parent_id": "t3_viwj42", "score": "1", "subreddit": "AskUK", "subreddit_id": "t5_2t4s3"}, {"author": "MassiveNwah", "body": "My solution was to shorten the \"grass season\" to late spring/early summer onwards by using bulbs. A few foot wide strip around a lawn (or even one edge) adds up to a lot of space on your big American lawns, and on little 30ft by 20ft gardens like mine take up a good quarter of the lawn space with bluebells and daffodils each spring.\n\nDrifts of bulbs, or perennials that come up in spring and go back down in late summer ( some campanulas, digitalis etc. just cut them down once they've flowered, annuals and biennials are best for this) so you can reseed for winter is the way to go.\n\nThe only cost is a few extra hours at most of cutting and bagging long grass after the actual planting dies down.\n\nA well-thought-out \"border\" of snowdrops, crocus, daffodils, scilla, bluebells etc. will keep it virtually maintenance free (on the regular that is, you will likely have to lift, divide, and space yearly or so) and once it starts flowering it won't stop for a good while. Once the foliage dies back it just gets mown back like the rest of my lawn.\n\nNot for everyone obviously, but I do like incorporating short-showing plants into my lawn to vary it over the year.", "created_utc": "1656017058.0", "edited": "False", "id": "idh6ned", "is_submitter": "False", "link_id": "t3_viwyq7", "parent_id": "t3_viwyq7", "score": "2", "subreddit": "lawncare", "subreddit_id": "t5_2rzrk"}, {"author": "MassiveNwah", "body": "Waited roughly three months to receive part of my order. Still waiting on the last plant (Acca sellowiana). Admittedly, the bulbs and other plant I received were in decent condition, although the potted plant seemed to have some chlorosis. I plan on planting it next week to deal with that. \n\nOverall, would not recommend for reliability's sake, but towards autumn an order of only bulbs may be worth it.", "created_utc": "1654905219.0", "edited": "False", "id": "ibx1c1b", "is_submitter": "False", "link_id": "t3_v9epwl", "parent_id": "t3_v9epwl", "score": "1", "subreddit": "GardeningUK", "subreddit_id": "t5_31s8w"}, {"author": "MassiveNwah", "body": "I can understand where you're coming from, but at least for me, it is still just memorising a word, and an extra letter or syllable causes me very little trouble overall. \n\nThe difference between memorising \"la grenouille\" or just \"grenouille\" is very little. Memorisation is just rote recalling. This scales extraordinarily well.  I understand that some people do have difficulty with memorisation in general though.\n\nThe learning of **two or three** agreement systems (declensions, demonstratives etc.) however is a much trickier task in my opinion.\n\nI imagine this is - at least in part - a simple difference in what we each find difficult, as well as what we each *perceive* to be difficult.", "created_utc": "1654294907.0", "edited": "False", "id": "ib36569", "is_submitter": "False", "link_id": "t3_v3wyso", "parent_id": "t1_ib2y5ez", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "MassiveNwah", "body": "I agree that gendered nouns aren't the easiest thing, I was merely trying to address *why* they are there in the first place: Once you knew them they made communication easier. \n\nHowever, I think that just memorising the article with the noun, or a quick m., f., or n. is no harder than learning the noun regardless. It's the agreement that trips people up, because we're not used to having to consider it or factor it in. \n\nI completely agree that it can be difficult for many people (and one of the many reasons I don't want to learn a romance language) but personally I view it as a fairly simple and straightforward feature to learn, even if it is a bit superfluous as you say.", "created_utc": "1654289221.0", "edited": "False", "id": "ib2v71q", "is_submitter": "False", "link_id": "t3_v3wyso", "parent_id": "t1_ib2qo39", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "MassiveNwah", "body": "I understand relatively little about how it came to arise, beyond the feminine deriving from a group of animate nouns that took a suffix used to create abstract nouns. This group eventually started to require agreement on adjectives etc.\n\nThe main function, and the most useful for the speaker, is reference tracking. If you have two people and one is male and the other female, you can very easily keep track of who is being referred to with which word or phrase. This can and was extended to all nouns. The same thing happens with number and person agreement with verbs, where it helps you to keep track of who is doing what, or which bug is blue etc.\n\nFor the learner, it does boil down to simply learning them along with the word itself, but that is little extra effort. Many languages have thematic or phonetic patterns for gender, such as most Polish nouns ending in a consonant being masculine. Once you internalise it as another form of agreement it isn't complicated. No more so than learning the 3rd person singular in English *walk****s,*** not *walk.* It is helpful and allows a far freer word order than would be possible if syntax alone decided meaning.", "created_utc": "1654285939.0", "edited": "False", "id": "ib2ohk9", "is_submitter": "False", "link_id": "t3_v3wyso", "parent_id": "t1_ib2g2w7", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "MassiveNwah", "body": "It's an arbitrary way of classifying nouns, and the only reason they are thought of as masculine and feminine is because of their association with groups of words like \"mother\" or \"father.\"\n\nThe Indo-European gender system developed out of an animate-inanimate distinction (still technically a \"gender\" system as the word was synonymous with \"genre\" and still sort-of is in linguistics). There are many different noun-class-systems around the world, we just use one. \n\nThe animate group split into masculine and feminine, grouped by morphology in  a similar way to today though likely more transparent. The inanimate became the neuter. \n\nLatin lost the neuter as it evolved in all but Romanian, I think. English's gender system has almost entirely collapsed, outside of pronouns and some other nouns (think \"hen\" and \"cock\", or \"bull\" and \"cow\"). \n\nSome of the actual uses of such systems - although no feature needs justification: They simply are - is that it adds a layer of redundancy, and can make a language simply sound nicer to the ear, what with rhyming and alliteration and the like. This is not a factor to be underestimated. How many times have you heard folk un-ironically use the word \"moist\" recently? \n\nIt also allows far easier poetry, which considering how important it was before writing developed must have been quite an agreeable development.", "created_utc": "1654280197.0", "edited": "False", "id": "ib2c9yq", "is_submitter": "False", "link_id": "t3_v3wyso", "parent_id": "t1_ib1cca9", "score": "6", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "MassiveNwah", "body": "Thinking further, I imagine a fair  part of it is from them picking up parents' foreign accents, or speaking English as a second language themselves. They end up retaining that foreign-ness, even over a generation or two. That may be why they are **so** easily distinguished.", "created_utc": "1652725188.0", "edited": "False", "id": "i8ullpj", "is_submitter": "False", "link_id": "t3_uqosrd", "parent_id": "t1_i8uh41u", "score": "1", "subreddit": "linguistics", "subreddit_id": "t5_2qhos"}, {"author": "MassiveNwah", "body": "A good example for the intonation is \"Big Zuu\". Here's a video that shows what I mean:[An interview between him and KSI](https://www.youtube.com/watch?v=DJrNeo1YYQU), doesn't really matter the content just the voice.", "created_utc": "1652716215.0", "edited": "False", "id": "i8tz1o4", "is_submitter": "False", "link_id": "t3_uqosrd", "parent_id": "t1_i8tygoi", "score": "1", "subreddit": "linguistics", "subreddit_id": "t5_2qhos"}, {"author": "MassiveNwah", "body": "I honestly can't word my thoughts towards those first two points.\n\nHowever, the last point is simple to answer: It is not dialectal in the sense of the words they use (although these are a common distinguishing factor), but there is a very clear \"accent\" as well as intonations and mannerisms that the majority of black people in media and in person (in my experience) have. You can just tell  from the way they speak.", "created_utc": "1652715978.0", "edited": "False", "id": "i8tygoi", "is_submitter": "False", "link_id": "t3_uqosrd", "parent_id": "t1_i8sukof", "score": "1", "subreddit": "linguistics", "subreddit_id": "t5_2qhos"}, {"author": "MassiveNwah", "body": "That's because amongst the young, it is considered to be \"cool\".  That's it, you're cool if you speak like one of da mandem.  I would go as far as to say it is considered \"cool\" specifically **because it is associated with non-whites.**\n\n&#x200B;\n\n Speaking English the way their community has for centuries has very little appeal in the age of rap and all things black. It doesn't help that there is almost nothing targeting young people to teach them about their own culture (and a hell of a lot of fawning over others), and very few young people search these things out themselves. Thus they get inundated with media, especially music and TV, both of which have extreme overrepresentation of black people.\n\n&#x200B;\n\nBlack people in Britain, unless they have been either raised or taught otherwise, will generally sound different to most natives. They have distinct enough voices to be able to tell someone on the radio is black.\n\n&#x200B;\n\nThat is not to say the way black people speak is bad or anything, but it is definitely caught up in race, at least outside of plurality-ethnic cities like London.", "created_utc": "1652692602.0", "edited": "False", "id": "i8sswts", "is_submitter": "False", "link_id": "t3_uqosrd", "parent_id": "t1_i8srban", "score": "11", "subreddit": "linguistics", "subreddit_id": "t5_2qhos"}, {"author": "MassiveNwah", "body": "I've only ever seen stagecoach buses in Barnsley. \n\nAll the rest seem to be those that go to and from other parts of South Yorkshire or are coaches.\n\nNever seen a FirstBus bus.", "created_utc": "1652652534.0", "edited": "False", "id": "i8qx7ju", "is_submitter": "False", "link_id": "t3_uq91fq", "parent_id": "t1_i8qhm6k", "score": "2", "subreddit": "yorkshire", "subreddit_id": "t5_2rz9n"}, {"author": "MassiveNwah", "body": "I would say focus on a specific \"domain,\" (cooking, animals, plants, games, fantasy, scifi,  mythology and fairy tales, etc. -- The important part is that they all have domain-specific vocabulary) ideally one that interests you, and get extensive input from it, until you feel very comfortable with it.\n\nThen pick another, repeat.\n\nThis will help you become comfortable in more aspects of the language, and greatly extend your vocabulary. Eventually, you could try reading more advanced things like English Literature and poetry etc. \n\nSomething I personally would recommend (as a native speaker, I am probably a bit skewed in my opinion here, but oh well) is take a good, long book with an interesting storyline and relatively \"basic\" vocabulary, but that is still decidedly high B2, if not C1. You will thus understand enough to get through the book, but still learn a lot of vocabulary, much of which a native would think of as \"basic\", if uncommon. \n\nIf you are wiling to pay a bit, I would recommend reading Ken Follett's Kingsbridge Trilogy. Decidedly \"basic\" vocab most of the time, but much of it uncommon. The story revolves around a fictional town called Kingsbridge, in Southwest England.\n\nAny book of decent length however will teach you a lot, and so the cheapest and easiest way to bridge the gap from intermediate to advanced is probably just reading free classics on the internet. [The Gutenburg Project](https://www.gutenberg.org/) is well-known and well-stocked.", "created_utc": "1651148312.0", "edited": "False", "id": "i6iw8zi", "is_submitter": "False", "link_id": "t3_udpyni", "parent_id": "t3_udpyni", "score": "5", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "MassiveNwah", "body": "That's good! keeping them staked and allowing some root run will give you healthier plants that will grow straighter.\n\nThe instructions are mere guidelines based on a UK average, so shouldn't be treat as gospel - you're far better off looking at the forecast often and applying common sense.", "created_utc": "1650995420.0", "edited": "False", "id": "i6aljcz", "is_submitter": "False", "link_id": "t3_uc9wb4", "parent_id": "t1_i69mzvu", "score": "1", "subreddit": "GardeningUK", "subreddit_id": "t5_31s8w"}, {"author": "MassiveNwah", "body": "An ounce of prevention is better than a pound of cure!\n\nGive them encouragement to grow straight, and don't put too much hope into rescuing wonky seedlings as they tend to be weaker and less vigorous anyway.", "created_utc": "1650981082.0", "edited": "False", "id": "i69ksr8", "is_submitter": "False", "link_id": "t3_uc9wb4", "parent_id": "t1_i69chxe", "score": "1", "subreddit": "GardeningUK", "subreddit_id": "t5_31s8w"}, {"author": "MassiveNwah", "body": "Sunflower seedlings should be supported as early as possible to keep them growing straight, if only tying them to a thin stick.\n\nFor already wonky seedlings, the only option I would consider worthwhile is to just gently straighten and bury the bare stem when you repot them or put them in the ground.\n\nThis will not harm them much unless you snap the stem, and will give them more sturdiness. Tomatoes, squashes, pumpkins etc. can also have their bare stems buried to produce a stockier and more stable plant.\n\nIf this doesn't work, they are generally less productive than straighter growing seedlings anyway, and disposing of them won't lose you much - especially with 72 of the things.", "created_utc": "1650975713.0", "edited": "False", "id": "i699d1k", "is_submitter": "False", "link_id": "t3_uc9wb4", "parent_id": "t3_uc9wb4", "score": "2", "subreddit": "GardeningUK", "subreddit_id": "t5_31s8w"}, {"author": "MassiveNwah", "body": "Sorry, I'm an English native speaker, but I think the main reason why most of the comments below are saying they don't like English (the language, not country) accents is the number of vowels.\n\nDepending on the dialect, English has as many as twenty-odd vowels (when including diphthongs), and to map that onto a language with five - or God forbid - three vowels, is a recipe for disaster.\n\nIt is possible, especially in isolated words, to approximate TL vowels, but as soon as extended speech starts happening it loosens back to what we're used to without extensive practice.\n\nFor reference, my own vowels are like [this chart](https://www.uv.es/anglotic/accents_of_english/01/yorkshire_english.html), **when trying to speak standard English, or to non-locals.**\n\nIn normal speech, my vowels are more non-standard, as this chart, and the audio examples on the website is from a woman, who are typically far, far less dialectal.", "created_utc": "1650965526.0", "edited": "False", "id": "i68u7fs", "is_submitter": "False", "link_id": "t3_ubt7kh", "parent_id": "t3_ubt7kh", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "MassiveNwah", "body": "Personally I've just chucked it over seedlings before going to bed, and held it down with a few bricks.\n\n\nJust pick it back up in the morning, and repeat til the frosts are gone.", "created_utc": "1649831980.0", "edited": "False", "id": "i4ja5v5", "is_submitter": "False", "link_id": "t3_u28qyw", "parent_id": "t1_i4higm3", "score": "1", "subreddit": "GardeningUK", "subreddit_id": "t5_31s8w"}, {"author": "MassiveNwah", "body": "If all else fails, just invest in a sheet or two of horticultural fleece. \nI put dozens of seeds out at the start of march, and it was definitely the best buy I've made this year.\n\nYou can get a pack of two 1m by 1.5m fleeces from b&q for a few quid, and they will keep the frost off them.", "created_utc": "1649796849.0", "edited": "False", "id": "i4h9p0f", "is_submitter": "False", "link_id": "t3_u28qyw", "parent_id": "t3_u28qyw", "score": "5", "subreddit": "GardeningUK", "subreddit_id": "t5_31s8w"}, {"author": "MassiveNwah", "body": "In England, at least for me, there are fairly few *ethnic* slurs you can get away with, outside of a joke-y context. People just don't use them enough to be considered, except for a few like \"paki\" or \"chink\", although the second is often used without ill intent.\n\nAnother example, I grew up using \"half-caste\" to refer to mixed-race people, it being neutral in my mind. I've even heard teachers say it when I was in school a few years ago. I only found out it was apparently offensive a few months ago when talking to a southern colleague. It doesn't help that the number of mixed-race people or couples I have seen before 2021 equals the number I saw today, so I didn't have the exposure required to learn that.\n\nAmerican culture has its sway, and \"the n-word\" is taboo, but no more so than other swear-words if a black person isn't present, and the youth will just use it to be edgy, so it doesn't carry the same weight. If a black person is present, you either avoid it for self-preservation, or it **is** used as banter although the latter is very rare. (I should mention, outside big cities like London and Birmingham, both of which have a lot more BAME people, blacks make up around 3% of the population, so are not often even thought of anyway).\n\n&#x200B;\n\nIn reference to black people in particular, \"monkey\" and other animalistic slurs are considered worst.", "created_utc": "1648505954.0", "edited": "False", "id": "i2hrqo6", "is_submitter": "False", "link_id": "t3_tq4mly", "parent_id": "t3_tq4mly", "score": "5", "subreddit": "linguistics", "subreddit_id": "t5_2qhos"}, {"author": "MassiveNwah", "body": "J.R.R. Tolkien wrote a lot of good, lengthy poetry that uses a lot of vocabulary that you might not encounter often - if at all - as a learner, although it often strikes me as a little simple, likely because it makes use of mostly Germanic terms. Many of his books can be bought fairly cheaply (if you live in an English-speaking country: I have no clue on their availability outside England, but I reckon the internet is probably your friend in that case). Good examples are [The Lay of Sigurd and Gudrun](https://www.amazon.co.uk/Legend-Sigurd-Gudr%C3%BAn-J-Tolkien/dp/0007317255), or [Beren and Luthien](https://www.amazon.co.uk/Beren-L%C3%BAthien-J-R-Tolkien/dp/0008214190/ref=pd_lpo_3?pd_rd_i=0008214190&psc=1).\n\nThe first of these is written using an Old Norse metre, which focusses on Alliteration, for example the first two stanzas are:\n\n>Of old was an age  \n>  \n>when was emptiness,  \n>  \n>there was sand nor sea  \n>  \n>nor surging waves;  \n>  \n>unwrought was Earth,  \n>  \n>unroofed was Heaven -  \n>  \n>an abyss yawning,   \n>  \n>and no blade of grass. //  \n>  \n>The Great Gods then  \n>  \n>began their toil,  \n>  \n>the wondrous world   \n>  \n>they well builded.   \n>  \n>From the South the Sun  \n>  \n>from seas rising  \n>  \n>gleamed down on grass   \n>  \n>green at morning.\n\nThere are also other works (if you wish for something poetic) that may be more taxing on your vocabulary like English translations of the Iliad. I have [this version](https://www.waterstones.com/book/the-iliad/homer/stephen-mitchell/9780753827772), I got it when I was twelve and am still not finished with it. \n\n&#x200B;\n\nAn alternative to poetry is simply to read classic novels, and pop culture icons:\n\n* \"Jurassic Park\" was a book by Michael Crichton before becoming a movie (\"Congo\" by the same author is even better)\n* \"Metro 2033\" and its sequels were a book series by Dmitry Glukhovsky and the translations are quite full-bodied.\n* The Kingsbridge series of novels by Ken Follett are far and away my favourite read since 2019, I sat and read the first (\\~1000 pages) in three days, as a testament to its quality.\n* **Any of Terry Pratchett's books,** indeed if you haven't read any, do it, now.\n* Although I don't like them personally, The Game of Thrones by George Martin are very popular and to read them all would take stupidly long, if the audiobook lengths are to go by (apparently around \\~200 hours).\n* The list goes on, visit a bookstore, or browse[Penguin Classics](https://www.penguin.co.uk/brands/PenguinClassicsCompleteList.html?redirect=false&sort=classicsYearPublish&classicsSeries=Penguin+Classics&classicsEra=1800-1899&classicsEra=1600-1799&classicsEra=Ancient) or amazon.", "created_utc": "1648416328.0", "edited": "False", "id": "i2d0npg", "is_submitter": "False", "link_id": "t3_tomjbp", "parent_id": "t1_i2b8r0h", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "MassiveNwah", "body": "Obligatory mention that \"thou\" has not died out and is in fairly common use among older speakers (when I say older, I mean before 2000, and - like me - a little after). It is also *very* widely recognised in Northern England, although this is a little anecdotal: In Barnsley, West Riding of Yorkshire, you would be hard-pressed to find a native out of school, that doesn't recognise it and treat it as normal, even if we do pronounce \"thee and thou\" !/ði:/ or/ðɪ/\"  and \"/ða:/\"", "created_utc": "1647982899.0", "edited": "False", "id": "i1pmjx6", "is_submitter": "False", "link_id": "t3_tk6vho", "parent_id": "t3_tk6vho", "score": "5", "subreddit": "linguistics", "subreddit_id": "t5_2qhos"}, {"author": "MassiveNwah", "body": "Regarding inhales vs exhales, I often hear it as an inhale then \"toe\" (/'to/). \n\nIn proper, careful speech, it would certainly be an exhale.", "created_utc": "1646577140.0", "edited": "False", "id": "hzkulj0", "is_submitter": "False", "link_id": "t3_t7ou7n", "parent_id": "t1_hzki2tt", "score": "1", "subreddit": "Ukrainian", "subreddit_id": "t5_2qum6"}, {"author": "MassiveNwah", "body": "It's not \"correct\" but it is understandable, though keep in mind I'm native English with a less than A1 level in Ukrainian. The only reason I say this is because the phonology is the most familiar part of the language to me, being that I listened to close to 600 hours of Ukrainian music every two or three months.\n\nPersonally, I find the sounds close enough to be recognisable, which is the aim. It helps that /ç/ is an allophone (similar sound used in certain situations, like in \"hue\") of /x/.\n\nSomeone more experienced would be able to give an answer on whether it is \"correct,\" but I think most Ukrainians would understand it.\n\nI think it is in a similar vein to using a rolled r (/r/) to speak French: Understood, if not now correct. Although, /r/ is the historical French pronunciation and persists in some places.\n\nLooking at Wikipedia's phonology page I only see /x/ and /ɦ/ mentioned. /ɦ/ is г, but is very similar to /x/, they form a voiced - voiceless distinction very roughly.\n\nOverall, I would say that you should aspire to /x/ - but remember it doesn't need to be extreme or even harsh at all - and that /ç/ is \"good enough\" to get your point across. It may even be good enough to just use, but as a non-native I can't say.\n\n[There is an audio clip of how /ç/ sounds](https://en.wikipedia.org/wiki/Voiceless_palatal_fricative), and I know I hear it in Ukrainian music (I no longer study it) fairly often.", "created_utc": "1646577006.0", "edited": "1646577860.0", "id": "hzkuc1q", "is_submitter": "False", "link_id": "t3_t7ou7n", "parent_id": "t1_hzki2tt", "score": "1", "subreddit": "Ukrainian", "subreddit_id": "t5_2qum6"}, {"author": "MassiveNwah", "body": "Try using the same sound as in \"hue\"\nIf you can read IPA, that's /ç/, so /ç'to/.\nI' m aware it is meant to be /x/, but it always sounds like /ç/ to me, or a sharp inhale.", "created_utc": "1646555398.0", "edited": "False", "id": "hzk0iuy", "is_submitter": "False", "link_id": "t3_t7ou7n", "parent_id": "t3_t7ou7n", "score": "3", "subreddit": "Ukrainian", "subreddit_id": "t5_2qum6"}, {"author": "MassiveNwah", "body": "Nominative determinism is fascinating! \n\nI wonder how many people it actually affects though?\n\nMy last name is Parker and I am an horticultural apprentice: checks out.\n\nMy gran's maiden name is Taylor, she used to work at a sewing factory and is an avid knitter.\n\nThe Royal Horticultural Society's current President is Keith Weed.\n\nMaybe there is more stock in this theory than it would at first seem?", "created_utc": "1646385861.0", "edited": "False", "id": "hzaq1ay", "is_submitter": "False", "link_id": "t3_t6cppb", "parent_id": "t1_hzalcpx", "score": "5", "subreddit": "AskUK", "subreddit_id": "t5_2t4s3"}, {"author": "MassiveNwah", "body": "Honestly, I'd never heard of people dying mulch. \n\n&#x200B;\n\nI've always just used a layer of compost or woodchip, looks far better than dyed mulch and is actually effective at providing nutrients and retaining moisture. Basic is best.", "created_utc": "1645958891.0", "edited": "False", "id": "hymq6ot", "is_submitter": "False", "link_id": "t3_t2axpr", "parent_id": "t3_t2axpr", "score": "1", "subreddit": "landscaping", "subreddit_id": "t5_2qndi"}, {"author": "MassiveNwah", "body": "I'm not exactly the most able to give opinions on orthographies, but I will try regardless.\n\nHonestly the vowels presented look okay, at least in isolation, especially how little English gives us to work with letterwise anyway.\n\nI will say that I think \"a\" is an unintuitive way of spelling /ə/, but you'd have to resort to digraphs, accents, or other trickery to fix it.\n\n\"ah/uh\" feels more likely to induce /ə/ to me, being already used in dialect script.\n\nYou could probably try playing around with the environmental and stress changes English has, think long vowels before a CV, the magic E, short vowels before CCV etc.\n\nEnglish spelling uses far more than just digraphs to communicate its vowels.\n\n&#x200B;\n\nIn regards to it looking silly, a single word in isolation gives little to judge by, but it seems fairly standard for an English type orthography used for a novel future English.\n\nYou might get better mileage looking into dialect texts and spellings, though they probably aren't as deviant as [they are in England proper](http://yorkshirefolksong.net/song.cfm?songID=69). You may simply need to revert to actual current American accents, it would be more familiar and less likely to fall flat. The only trap here is that it is very easy to look lazy this way without being a native (as I am with the link above), or doing your research.The important bit here is that less is more, and *tha wants to give a flavour wi'aht really forcing it down a reader's throat*, or failing that *guh full fooas an' mek i' as reyt proper lahk.* The middle ground is hard to reach.\n\n&#x200B;\n\nAs regards /i/ in words like \"happy\", you might be glad to know that /ɪ/ is a fairly common way of saying it today. In my area, you either use /ɪ/, or *tha's won o' them off-comed-uns 'as sez it /ɪi/ an' prob'ly 'as a mansion in Kent.*  I joke of course, but the very strongly stressed (to my ears)     /ɪi/ or /i/ is very much a sign of class or wealth here.\n\nI suggest using y like present English, and passing it off as a convention, perhaps with remarks to its weakness etc. Or perhaps distinguish strong \"ai\" with long \"ee\" and short \"i\".\n\nThere's no perfect answer, but what you've got seems suitable.", "created_utc": "1644194655.0", "edited": "1644194868.0", "id": "hvvsko5", "is_submitter": "False", "link_id": "t3_smbauk", "parent_id": "t3_smbauk", "score": "5", "subreddit": "conlangs", "subreddit_id": "t5_2red7"}, {"author": "MassiveNwah", "body": "All have audio and lyrics, though quality varies, and there are short descriptions of context and writers etc. This should appeal to this sub.", "created_utc": "1642930481.0", "edited": "False", "id": "htv23fx", "is_submitter": "True", "link_id": "t3_sapy5h", "parent_id": "t3_sapy5h", "score": "3", "subreddit": "DialectsOfEnglish", "subreddit_id": "t5_4uljlu"}, {"author": "MassiveNwah", "body": "Cheers!\n\nI'll have a gander at that Vocaroo, anything to help improve on **that** I just forced out me gullet.", "created_utc": "1641811886.0", "edited": "False", "id": "hs1qljm", "is_submitter": "True", "link_id": "t3_p03zdh", "parent_id": "t1_hs1q9xv", "score": "2", "subreddit": "conlangs", "subreddit_id": "t5_2red7"}, {"author": "MassiveNwah", "body": "First take, so definitely bad, but this is the full thing (sort of).\n\nI wish I hadn't made such an awkward phonology back then - just because you can pronounce a phoneme in isolation *does not* mean you can pronounce it fluently in words.\n\n[https://www.dropbox.com/s/2la5bz8iapekir0/Full%20song%20take%20one.m4a?dl=0](https://www.dropbox.com/s/2la5bz8iapekir0/Full%20song%20take%20one.m4a?dl=0)\n\nTurn speed to 1.5 though because the actual speed is glacial.", "created_utc": "1641810466.0", "edited": "False", "id": "hs1op9x", "is_submitter": "True", "link_id": "t3_p03zdh", "parent_id": "t1_hs1nxqr", "score": "1", "subreddit": "conlangs", "subreddit_id": "t5_2red7"}, {"author": "MassiveNwah", "body": "Sorry it took so long!\n\nFinding an opportunity to record it, was the main problem. Also, this is probably the first time I've tried recording my voice, especially not in English. \n\nI definitely messed it up a fair bit, particularly the stress, but this is my best take so far: https://www.dropbox.com/s/h5srnsjygxab7sq/First%20verse.m4a?dl=0", "created_utc": "1641809899.0", "edited": "False", "id": "hs1nxqr", "is_submitter": "True", "link_id": "t3_p03zdh", "parent_id": "t1_hpptpf6", "score": "1", "subreddit": "conlangs", "subreddit_id": "t5_2red7"}, {"author": "MassiveNwah", "body": "Vowel length is indeed indicated by the acute accent.\n\nConsonants often geminate, and I represented that with a lengthening symbol.\n\nIf I knew how to create such an audio sample and post it to reddit, i would, but this *is* one of my older langs so my pronunciation would be rusty at best also!\n\nI don't even think I can pronounce /ʎ/, and I strugglw a bit with /q/, usually creating some sort of ejective. \n\nIn other words, it would probably be far from accurate, but I'll see what I can do over next few days.", "created_utc": "1640246147.0", "edited": "False", "id": "hpnrg9l", "is_submitter": "True", "link_id": "t3_p03zdh", "parent_id": "t1_hpn8qdr", "score": "2", "subreddit": "conlangs", "subreddit_id": "t5_2red7"}, {"author": "MassiveNwah", "body": "As I can see!\n\nThe diaresis makes a lot more sense now, though I thought it aesthetic as there was no indication of silent letters, so adding it to \"ósë\" confused me a little. It makes sense now, but my brain completely skipped the syllable break. \n\nYou're definitely right in the syntax creating a different sound, but I think the prosody (probably using that wrong, but oh well) was different also. The underlying melody in the words sounded completely foreign, which is quite good. It reminded me of Hungarian, [in a way](https://www.youtube.com/watch?v=YsNY8eQ5-iY).\n\nYou're much better at the song-writing aspects than I am, though. I struggle to think of shorter ways of saying something, not having much of a poetic mind. (For example, [I basically just prose translated the last song I did](https://www.reddit.com/r/conlangs/comments/p03zdh/a_folk_song_in_e%C5%9Bte/), since agglutination definitely doesn't lend itself to brevity).\n\nThe phonology itself definitely seems to allow for more flexibility in word choice, and the grammar in Terréän seems complex enough to handle shortening, yet simple enough to not get in the way. \n\nIn any case, well done: This is a work of art unto itsen!", "created_utc": "1640215763.0", "edited": "False", "id": "hpmb49r", "is_submitter": "False", "link_id": "t3_rm0y72", "parent_id": "t1_hplp36b", "score": "2", "subreddit": "conlangs", "subreddit_id": "t5_2red7"}, {"author": "MassiveNwah", "body": "Wonderful singing!\n\nThe orthography is quite clear and well-thought out, and you did a brilliant job with translating the original. Though is the diaresis aesthetic? I can't see a distinction\n\n&#x200B;\n\nIt has a very different feel to the English, with a very consistent style in its translation. Is this perhaps representative of the way your conlang/ -people write songs - or carols specifically?\n\nWhether it is or not, this creates a sense of a song-writing tradition ( I can't remember the right word) in that it is different and easily extendable.\n\n&#x200B;\n\nI'm sure there is a word for it, but essentially I'm trying to ask whether it is part of a wider pattern, like how English folk music sounds generally similar, yet totally distinct to Ukrainian folk, as a part of their tradition/language.", "created_utc": "1640205103.0", "edited": "False", "id": "hpllx1q", "is_submitter": "False", "link_id": "t3_rm0y72", "parent_id": "t3_rm0y72", "score": "5", "subreddit": "conlangs", "subreddit_id": "t5_2red7"}, {"author": "MassiveNwah", "body": "Cheers!\n\nThis chart is one of the most useful vocabulary prompts I have seen so far.\n\nI reckon i'll learn plenty from it, and the conlangs you've linked to also.\n\nThank you for taking the time to reply!", "created_utc": "1640072992.0", "edited": "False", "id": "hpeg7ds", "is_submitter": "False", "link_id": "t3_rkjvnu", "parent_id": "t1_hpd2a8r", "score": "2", "subreddit": "conlangs", "subreddit_id": "t5_2red7"}, {"author": "MassiveNwah", "body": "Cheers for this! It's quite helpful.\n\nI am using different pronoun forms, and obj. markers etc. to form distinctions, or as inherent parts of an adposition, as shown above. \n\nI'll have to think about verbal usage, as I think a little bit mixed in would be perfect.\n\nI'll have a gander at this podcast, adn you've given me loads to think about.\n\nThank you!", "created_utc": "1640072591.0", "edited": "False", "id": "hpefoqk", "is_submitter": "False", "link_id": "t3_rkjvnu", "parent_id": "t1_hpd5pi6", "score": "2", "subreddit": "conlangs", "subreddit_id": "t5_2red7"}, {"author": "MassiveNwah", "body": "Cheers! I have actually started with this, in a way, by having subject, object, reflexive, and clitic forms for pronouns, derived from \"relational\" words.\nI have chosen to do it using subclauses. So for example,\n\n\nI catch the fish today. (This uses base subject form for \"we\")\n\nWe lú'au im, si íne tú'an ru.\n\n/Wɛ 'luʔau im, si 'inɛ 'tuʔan ɾu/\n\nIn*-this-day, 1p.s.pro.-fish-catch.fish-1p.s.clitic.\n\n*We meaning within a timeframe, used for expressing today, yesterday, this week etc.\n\n\nBut, for \"íte\" instrumental with, you use the object form:\n\nThey catch salmon with spears.\n\nÍte kalíwe'e níe, ló'o úmo'o tá'un láu.\n\n/'itɛ ka'liweʔe 'ni.ɛ, 'loʔo ˈumoʔo ˈtuʔan 'la.u/\n\nWith-spear.pl.-obj., 3p.pl.m.-catch.-salmon.pl-3p.pl.clitic\n\nThank you!", "created_utc": "1640072209.0", "edited": "1640073607.0", "id": "hpef7iu", "is_submitter": "False", "link_id": "t3_rkjvnu", "parent_id": "t1_hpdiico", "score": "1", "subreddit": "conlangs", "subreddit_id": "t5_2red7"}, {"author": "MassiveNwah", "body": "Thanks! \n\nI'm glad someone could read through my half-asleep gibberish!\n\nI suppose I could have just said, in my area it is fairly common, and widely recognised. Top down (and south-eastern) influence has eroded it fairly strongly however.\n\nI were just a bit incensed that someone couldn't believe it was still said.", "created_utc": "1640041253.0", "edited": "False", "id": "hpcr2zd", "is_submitter": "False", "link_id": "t3_qwjtbe", "parent_id": "t1_hp8rj31", "score": "2", "subreddit": "LinguisticMaps", "subreddit_id": "t5_3iaah"}, {"author": "MassiveNwah", "body": "Hello! I have a few questions that bug me every time I start on a conlang, and think having explanations - or seeing examples - if anyone wants to share them, would be helpful:\n\nHow might I create realistic distinctions in adpositions, without simply copying English, or making unnatural distinctions? \n\nHow have you dealt with adpositions in your conlang? \n\nWhat alternatives to adpositions exist?\n\nFor reference, I am going for phonaesthetically polynesian, but with a simple grammar and highly \"inflected\" word order, that I can then evolve grammatically, in whichever way happens, though it's likely to be agglutinative or analytic in the short term.\n\nCheers to anyone that takes the time to help me.", "created_utc": "1640040214.0", "edited": "False", "id": "hpcoo2h", "is_submitter": "False", "link_id": "t3_rkjvnu", "parent_id": "t3_rkjvnu", "score": "5", "subreddit": "conlangs", "subreddit_id": "t5_2red7"}, {"author": "MassiveNwah", "body": "It's not common amongst young people, but where I live and work in Barnsley and Rotherham, I hear it fairly often.\n\nIt's considered improper, among most adults and most folk under 25 are trying their hardest to sound like they're from Jamaica, or sound straight of suburban London. From what I saw in my last years in school, the youngest think it's \"cool\" to speak in southeastern ways .\n\nI'm only 17, and I grew up using it, but my mam hates regionalisms, and school wasn't much better for it.\n\nOverall, I'd say all bar the most \"middle class\" young teenagers within Barnsley (and the West Riding as a whole) would recognise it and think it normal.\n\nAbout half will use it in set phrases, and a tenth to a fifth somewhat regularly use tha and thi.", "created_utc": "1639694673.0", "edited": "False", "id": "houaocu", "is_submitter": "False", "link_id": "t3_qwjtbe", "parent_id": "t3_qwjtbe", "score": "3", "subreddit": "LinguisticMaps", "subreddit_id": "t5_3iaah"}, {"author": "MassiveNwah", "body": "Lots of mismangement (first campaign, remember) and the fact that this all got me into crippling debt and inflation left me with a lot to spend. I also had to buy down war exhaustion to let my economy run at the pace of loans. I think I had about forty by the time the french declared.", "created_utc": "1631482228.0", "edited": "False", "id": "hcm4as1", "is_submitter": "True", "link_id": "t3_pmjuf7", "parent_id": "t1_hck35bj", "score": "1", "subreddit": "eu4", "subreddit_id": "t5_2uqat"}, {"author": "MassiveNwah", "body": "Aye, it's a shame as well because I managed to conquer all of central America and a good quarter of the north, but I now realise that there were a lot of things I could have done to stop this. It's been quite a learning experience; after all, you never see anyone else's bad campaigns, so I didn't know just how evil the AI was :)", "created_utc": "1631437426.0", "edited": "False", "id": "hcjjuli", "is_submitter": "True", "link_id": "t3_pmjuf7", "parent_id": "t1_hcimzhu", "score": "1", "subreddit": "eu4", "subreddit_id": "t5_2uqat"}, {"author": "MassiveNwah", "body": "I guess so, honestly I think this save is scuffed, but the info that eeryone here has given me, and the experience I now have, should led to a much better next game.", "created_utc": "1631437219.0", "edited": "False", "id": "hcjjlrb", "is_submitter": "True", "link_id": "t3_pmjuf7", "parent_id": "t1_hciq43u", "score": "1", "subreddit": "eu4", "subreddit_id": "t5_2uqat"}, {"author": "MassiveNwah", "body": "I had nothing to compare it to, and the opportunity for very rapid expansion in 1440's Mexico helped pass the time. I piggybacked off the Portuguese 40 years in after conquering the Caribbean from them, I am still only at 8-8-11 in tech, but was the fourth largest in provinces,\n\nThe year all this is happening is 1630-40.", "created_utc": "1631413968.0", "edited": "False", "id": "hcij2zs", "is_submitter": "True", "link_id": "t3_pmjuf7", "parent_id": "t1_hciin55", "score": "2", "subreddit": "eu4", "subreddit_id": "t5_2uqat"}, {"author": "MassiveNwah", "body": "I found it quite fun, and just challenging enough to not annoy me, up until just now, 34 hours in...", "created_utc": "1631413693.0", "edited": "False", "id": "hciii92", "is_submitter": "True", "link_id": "t3_pmjuf7", "parent_id": "t1_hcii7g7", "score": "1", "subreddit": "eu4", "subreddit_id": "t5_2uqat"}, {"author": "MassiveNwah", "body": "I found it strange as well they stopped after I wrote this post, but they crept up on me as I progressively believed more in a (vengeful) god.\n\nI don't know if they *really were* chest \"convulsions\" as for other people they register as hiccups, but I do feel the heart **thump** and then carry on. They are a sign of extreme annoyance, which is why I pulled myself off of it.", "created_utc": "1631413618.0", "edited": "False", "id": "hciicj2", "is_submitter": "True", "link_id": "t3_pmjuf7", "parent_id": "t1_hcihmyk", "score": "1", "subreddit": "eu4", "subreddit_id": "t5_2uqat"}, {"author": "MassiveNwah", "body": "I had killed Portugal and Spain's first ventures into the New World but this was my first campaign and after having Spain attack me the first time round I decided not to poke the the sleeping bear... that didn't pan out as well as I'd hoped :(\n\nI didn't know it wouldn't call the overlord, but thanks for mentioning that, my next run will be much less painful.", "created_utc": "1631413337.0", "edited": "False", "id": "hcihr2g", "is_submitter": "True", "link_id": "t3_pmjuf7", "parent_id": "t1_hcig9it", "score": "1", "subreddit": "eu4", "subreddit_id": "t5_2uqat"}, {"author": "MassiveNwah", "body": "So it would seem, I had missed out the smaller, opportunistic wars that were declared as well. The problem was that while I could have taken Spain, and maybe also that coalition, having the others declare was the nail in the coffin. \n\nEspecially since my own army is now at 12k (started at 55k).", "created_utc": "1631412615.0", "edited": "False", "id": "hcig87x", "is_submitter": "True", "link_id": "t3_pmjuf7", "parent_id": "t1_hcif115", "score": "1", "subreddit": "eu4", "subreddit_id": "t5_2uqat"}, {"author": "MassiveNwah", "body": "My biggest point that I slowly came to realise is that I need to be able to hear and speak to people in that tongue, or I can't commit to caring, sin as it's unlikely I'll ever live more than ten mile from where I live now. That first bit might help you or others\n\n.  \nDepends where you are I suppose, at work I hear more Polish and \"Muslim\" languages spoken than I do English, but otherwise I don't even hear my native dialect anymore.\n\n  \nFor me, I went with something that I would hear around me and recognise....Or thought I would, it turns out Ukrainian is barely spoken in my part of Britain.", "created_utc": "1630710288.0", "edited": "False", "id": "hbi76yb", "is_submitter": "False", "link_id": "t3_ph78h4", "parent_id": "t3_ph78h4", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "MassiveNwah", "body": "# Eśte\n\nThis snippet is the first couplet from the translated song I did a Month or two back:\n\n**Ğokóxál dúx bejejd zanassam eviźí dóganned kóssam góveĺeź bejn óñtúvessam dávuzúr,**\r  \n\r  \n**Bejejd óñkoxxa tegán óñdúmox' ejda gúr bej tejvexa búzár led vejruzúr.**", "created_utc": "1630400745.0", "edited": "False", "id": "hb1b8qf", "is_submitter": "False", "link_id": "t3_pcjrcb", "parent_id": "t3_pcjrcb", "score": "1", "subreddit": "conlangs", "subreddit_id": "t5_2red7"}, {"author": "MassiveNwah", "body": "Thanks for suggesting \"Under-Reddit\", I don't know why I hadn't thought of that mesen....\n\nAnyway, I'm glad it was of some note to someone!\n\nI reckon the truth that at least a third of the words given come from Old Norse likely helps that along.", "created_utc": "1629372236.0", "edited": "False", "id": "h9iqhqg", "is_submitter": "True", "link_id": "t3_p71zin", "parent_id": "t1_h9ilcu7", "score": "4", "subreddit": "anglish", "subreddit_id": "t5_2sne7"}, {"author": "MassiveNwah", "body": "# Eśte\n\n**Bi óñeğássam Mári evón.**\n\nCond.par. past.impf.-prepare.-3p.an.s. Mary dough\n\n/bi o:ŋe'ʁa:s:am 'ma:ri e'vo:n/\n\nMary would have prepared dough.", "created_utc": "1628759382.0", "edited": "False", "id": "h8mucl0", "is_submitter": "False", "link_id": "t3_p1uyh0", "parent_id": "t3_p1uyh0", "score": "2", "subreddit": "conlangs", "subreddit_id": "t5_2red7"}, {"author": "MassiveNwah", "body": "Note that due to it being quite late here, I may be long in replying even though I endeavour to do so.\n\nEDIT I am free to respond now.", "created_utc": "1628379716.0", "edited": "1628411848.0", "id": "h8419pq", "is_submitter": "True", "link_id": "t3_p03zdh", "parent_id": "t3_p03zdh", "score": "3", "subreddit": "conlangs", "subreddit_id": "t5_2red7"}, {"author": "MassiveNwah", "body": "Eśte \n\nğomevğai eviźí ğolevğai puńigúr suino.\n\naor.-allow.-2p.for.s. not aor.-allow.-2p.for.s. berry.-pl. [black.blue](https://black.blue).\n\n/ʀo'mevʀai evi'ʑi: ʀo'levʀai puɲi'gu:r 'suino/\n\nlit. generally-allow-you generally-wash-you berries blue.\n\nYou aren't allowed to wash blueberries.", "created_utc": "1628319888.0", "edited": "False", "id": "h814q0z", "is_submitter": "False", "link_id": "t3_oyxfjv", "parent_id": "t3_oyxfjv", "score": "3", "subreddit": "conlangs", "subreddit_id": "t5_2red7"}, {"author": "MassiveNwah", "body": "It's common here in Yorkshire, Englabnd...but we have a whole set of secondary contractions.", "created_utc": "1627904785.0", "edited": "False", "id": "h7f3b7w", "is_submitter": "False", "link_id": "t3_ou1fuq", "parent_id": "t1_h747sya", "score": "1", "subreddit": "conlangs", "subreddit_id": "t5_2red7"}, {"author": "MassiveNwah", "body": "I honestly hadn't noticed <ǵ> when I put this together, nor <ł> - I knew they existed, but was too tired to trawl around to copy and paste them.\n\nI think that <ǵ> is the best way I've heard of representing \\[ɟ\\]; so thank you!\n\nI think that this will certainly be featured in the revised orthography next time I think of something worth posting.", "created_utc": "1627545719.0", "edited": "False", "id": "h6xl2gh", "is_submitter": "True", "link_id": "t3_osyj0y", "parent_id": "t1_h6wbfe3", "score": "1", "subreddit": "conlangs", "subreddit_id": "t5_2red7"}, {"author": "MassiveNwah", "body": "If you think this is good, have a gander at some of the (vastly better) ones on here, like tsevhu. \n\nI am but a novice.\n\nIf you want to make more than a relex, search for Biblaridion on Youtube to see what you'd be getting yourself into; and then look into various features on Wikipedia.\n\nThere's also [Zompist.com](https://Zompist.com)'s Language Construction Kit.\n\nYou'll pick it up quickly!", "created_utc": "1627508130.0", "edited": "False", "id": "h6vq8g1", "is_submitter": "True", "link_id": "t3_osyj0y", "parent_id": "t1_h6vo435", "score": "2", "subreddit": "conlangs", "subreddit_id": "t5_2red7"}, {"author": "MassiveNwah", "body": "These are great suggestions! I usually just use IPA, so I had to improvise this on the spot, late at night, from Zompist's SCA character list - hence it's messiness.\n\n**ʁ** is **ğ,** simply because it is not a rhotic consonant, and I took it from Kazakh. Your suggestion to use **ř** would be a bit off the mark.\n\nj is difficult for me to recognise as /ɟ/, but that is the best solution I've heard yet.\n\nYour suggestion for the nasals, and palatal \\~ is something I shall take on board.\n\nIn essence, this is very useful (I'm inexperienced in creating orthographies) and thank you mightily for thinking of it all!", "created_utc": "1627503972.0", "edited": "False", "id": "h6vggr2", "is_submitter": "True", "link_id": "t3_osyj0y", "parent_id": "t1_h6uyaxr", "score": "2", "subreddit": "conlangs", "subreddit_id": "t5_2red7"}, {"author": "MassiveNwah", "body": "Thanks! It felt a bit bare with just the other few tenses, and the alternative I considered was to have general statements be past perfective...but this is better!", "created_utc": "1627475311.0", "edited": "False", "id": "h6tmou0", "is_submitter": "True", "link_id": "t3_osyj0y", "parent_id": "t1_h6tl52c", "score": "2", "subreddit": "conlangs", "subreddit_id": "t5_2red7"}, {"author": "MassiveNwah", "body": "If it helps, here is the full list of sound changes I used, though some words have elided a little more than others, and the \"assimilation\" is essentially just a way to pass it off without writing each individual one down . Most of the new sounds come from palatalisation. I probably did this wrong, but oh well.\n\n1. Unvoiced consonants are voiced between vowels.\n2. Short /i/ causes palatalisation in the preceding consonant -> Auxx. fuse w/ main verb.\n3. Final short /i/ disappears if unstressed.\n4. /i/ lost after a palatal, unless a consonant proceeds it.\n5. short /a/ is lost before a long vowel or at the end of a word.\n6. \"assimilation\" to clean up clusters.\n7. Stress shifts to rule above.\n8. Intervocalic /q/ or /qq/ becomes /x/.\n9. /ŋ/ before a back vowel becomes /ɴ/.\n10. /ɴ/ before a front vowel becomes /ŋ/.\n11. /pf/ becomes /ff/ and /ts/ becomes /ss/.\n\nAt this point I decided to flesh it out, and this is the result.\n\nI admit that many of these aren't yet phonemic, merely predictable, but I can't figure out how to make them so.", "created_utc": "1627462873.0", "edited": "False", "id": "h6t6d21", "is_submitter": "True", "link_id": "t3_osyj0y", "parent_id": "t1_h6t3vp0", "score": "1", "subreddit": "conlangs", "subreddit_id": "t5_2red7"}, {"author": "MassiveNwah", "body": "I evolved it from a small ( to me) \"proto-lang\" inventory. For full transparency, it had the sam e vowels, and the following consonants: p t k q m n ŋ ɴ f s ɕ pf ts r l j w ʁ.\n\nNow that you've mentioned it, I can see what you mean, but it never crossed my mind this was big (I used to very much limit inventories in past attempts at diachronics, but that just resulted in Maori's ugly third cousin).\n\nI tried to give myself room to manoeuvre without having three phonemes total. I suppose this is what I get from exploring Slavic and Mongolic languages - my sense of scale is off.\n\nThanks for mentioning this, it has made me see it in a new light, though now I'm curious what sort of conlangs you make to consider this big!", "created_utc": "1627460626.0", "edited": "False", "id": "h6t3vp0", "is_submitter": "True", "link_id": "t3_osyj0y", "parent_id": "t1_h6smri8", "score": "1", "subreddit": "conlangs", "subreddit_id": "t5_2red7"}, {"author": "MassiveNwah", "body": "*енергія, Typo", "created_utc": "1626882326.0", "edited": "False", "id": "h60jmq9", "is_submitter": "True", "link_id": "t3_ommpid", "parent_id": "t1_h60ji64", "score": "1", "subreddit": "Ukrainian", "subreddit_id": "t5_2qum6"}, {"author": "MassiveNwah", "body": "\"Енергіа\" for electricity, I believe; I don't know for profit.\n\nThat illustrates my point: I need plenty of input and exposure, which is why I asked for sources of it.", "created_utc": "1626882272.0", "edited": "False", "id": "h60ji64", "is_submitter": "True", "link_id": "t3_ommpid", "parent_id": "t1_h5zhxfb", "score": "1", "subreddit": "Ukrainian", "subreddit_id": "t5_2qum6"}, {"author": "MassiveNwah", "body": "I listen extensively to Ukrainian music, and a few Ukrainian streamers, and the like; so I feel that reading is my weak point at the moment. In other words, I listen and read the lyrics, etc. but I feel I will benefit from some more basic reading materials as I'm lacking input mostly, and I need it from less poetic sources than song, and less advanced than native content. \n\nEssentially, I'm trying to cover all my bases. \n\n\nI hadn't actually thought about shadowing (though I do singalong), thanks for bringing that to my attention, and sorry for rambling!", "created_utc": "1626706129.0", "edited": "False", "id": "h5rancw", "is_submitter": "True", "link_id": "t3_ommpid", "parent_id": "t1_h5quqmq", "score": "1", "subreddit": "Ukrainian", "subreddit_id": "t5_2qum6"}, {"author": "MassiveNwah", "body": "Thanks for showing me this, it should be quite useful!", "created_utc": "1626705774.0", "edited": "False", "id": "h5r9upy", "is_submitter": "True", "link_id": "t3_ommpid", "parent_id": "t1_h5q6r58", "score": "1", "subreddit": "Ukrainian", "subreddit_id": "t5_2qum6"}, {"author": "MassiveNwah", "body": "I'll take a look. Thanks!", "created_utc": "1626649087.0", "edited": "False", "id": "h5ortlh", "is_submitter": "True", "link_id": "t3_ommpid", "parent_id": "t1_h5opwwa", "score": "1", "subreddit": "Ukrainian", "subreddit_id": "t5_2qum6"}, {"author": "MassiveNwah", "body": "Thanks! I'll make sure to have a look at these.", "created_utc": "1626631754.0", "edited": "False", "id": "h5np21g", "is_submitter": "True", "link_id": "t3_ommpid", "parent_id": "t1_h5m23x6", "score": "1", "subreddit": "Ukrainian", "subreddit_id": "t5_2qum6"}, {"author": "MassiveNwah", "body": "Funnily enough, I don't actually have a textbook (none are available near me, and I can't get them online yet). I've just used online sources, but most of these are too complex for my level.\n\nI have been building my vocab, but it's still quite limited (400 - 500 words).\n\nI shall start looking for one a bit more seriously though. Thanks!", "created_utc": "1626631720.0", "edited": "False", "id": "h5noz7g", "is_submitter": "True", "link_id": "t3_ommpid", "parent_id": "t1_h5m4hzy", "score": "1", "subreddit": "Ukrainian", "subreddit_id": "t5_2qum6"}, {"author": "MassiveNwah", "body": "I'll have a look at that then. Thanks!", "created_utc": "1626631438.0", "edited": "False", "id": "h5nobbv", "is_submitter": "True", "link_id": "t3_ommpid", "parent_id": "t1_h5mti3t", "score": "1", "subreddit": "Ukrainian", "subreddit_id": "t5_2qum6"}, {"author": "MassiveNwah", "body": "The only things that I have had need of from Maths so far are just basic arithmetic, ratios, percentages, algebra  and basic geometry. The only things I find myself wishing I could remember is the geometry", "created_utc": "1624811661.0", "edited": "False", "id": "h3852c8", "is_submitter": "False", "link_id": "t3_o8rvxb", "parent_id": "t3_o8rvxb", "score": "1", "subreddit": "TheFlyingTree", "subreddit_id": "t5_37516x"}, {"author": "MassiveNwah", "body": "Thanks! I'd tried searching through reddit and the like for it, but to no avail.\n\nI'll be sure to do that next time.", "created_utc": "1624811265.0", "edited": "False", "id": "h3849vo", "is_submitter": "True", "link_id": "t3_o8s1xd", "parent_id": "t1_h3803ue", "score": "1", "subreddit": "TheFlyingTree", "subreddit_id": "t5_37516x"}, {"author": "MassiveNwah", "body": "That's cool! I've never seen any of Nova Scotia afore.", "created_utc": "1624806106.0", "edited": "False", "id": "h37u8kr", "is_submitter": "False", "link_id": "t3_o8afzo", "parent_id": "t1_h37cw0u", "score": "2", "subreddit": "TheFlyingTree", "subreddit_id": "t5_37516x"}, {"author": "MassiveNwah", "body": "Indeed it is there.\n\nI wish it was my picture, but I can 't figure out how to get them onto Reddit, so this is a *similar* photo to many that I have taken.\n\nIt isn't the best angle but the Dearne near Cudworth and Grimethorpe is always nice to look at.", "created_utc": "1624786148.0", "edited": "False", "id": "h372sew", "is_submitter": "True", "link_id": "t3_o8s1xd", "parent_id": "t1_h370dee", "score": "2", "subreddit": "TheFlyingTree", "subreddit_id": "t5_37516x"}, {"author": "MassiveNwah", "body": "I would just like to mention that while I did take a photo very similar to this, I have no clue how to get it onto reddit. Therefore, I have found this very similar image\n (which can be found here: https://www.geograph.org.uk/gridref/SE4006 ).\n\nI would not have done this, if I knew how to use my own photos, but this place is too good not to be shared!", "created_utc": "1624778269.0", "edited": "False", "id": "h36ul3x", "is_submitter": "True", "link_id": "t3_o8s1xd", "parent_id": "t3_o8s1xd", "score": "2", "subreddit": "TheFlyingTree", "subreddit_id": "t5_37516x"}, {"author": "MassiveNwah", "body": "Nice, but is it the River Dearne? I bet not.\n\nIn all seriousness, this is a fair photo, which river is it?\n\nAlso, that tree on the left is torturing me, I can't tell if it is an hawthorn, a birch, or dome weird foreign tree. Perhaps an American maple species?", "created_utc": "1624776850.0", "edited": "False", "id": "h36t0i2", "is_submitter": "False", "link_id": "t3_o8afzo", "parent_id": "t3_o8afzo", "score": "2", "subreddit": "TheFlyingTree", "subreddit_id": "t5_37516x"}, {"author": "MassiveNwah", "body": "Slavic tongues, with Ukrainian pulling first place: It is nicer than Russian (and it'd godawful stress system), and is still quite fluent, unlike the South Slavic languages.\n\nRealistically though, they are all incredibly melodic and nice to listen to. \n\nHonourable mentions are Hungarian, Chechen, Romanian (the only good romance language), Vietnamese, and - most certainly not biased at all - Yorkshire English, specifically.\n\nEDIT: Tuvan as well, just listen to мен тыва мен.", "created_utc": "1624735681.0", "edited": "False", "id": "h34x32x", "is_submitter": "False", "link_id": "t3_o7kr33", "parent_id": "t3_o7kr33", "score": "1", "subreddit": "conlangs", "subreddit_id": "t5_2red7"}, {"author": "MassiveNwah", "body": "Uvaś\n\nKorud'àbèf'maskèlo levèn ùvodà jakùb' mukpèśb'ivàllo mogàvodà.\n\n/koˌɾudʲɔbɛfʲˈmaskɛˌlo ˈlevɛn ʊˈvodɔ ˈjakʊbʲ ˌmukpɛˈʃbʲivaˌlːo ˌmogɔˈvodɔ/\n\nKorud'a-bè-f'maskè-lo levèn ùvodà jakùb' muk-pè-śb'ivàl-lo mogàvodà\n\nPerf.fut.-cond.-be.full.-3p.masc. - small. - river. - if. - impf.ind.-cond.-flow.-3p.masc. - large.river.\n\nThe small river will be full if the big river flows.\n.\n\n\n.\nKorud'àbèlem'ìblo levèn ùvodà jakùb' korud'àbètomèzhlo ràm'ilhontù rowà mogàvodà.  \n\n/koˌɾudʲɔˌbɛˈlemʲɪbˌlo ˈlevɛn ʊˈvodɔ 'jakʊbʲ koˌɾudʲɔˌbɛˈtomɛʒˌlo ɾɔˈmʲiʎontʊ ˈɾowɔ ˌmogɔˈvodɔ/\n\nKorud'à-bè-lem'ìb-lo levèn ùvodà jakùb' korud'à-bè-tomèzh-lo ràm'ilhon-tù rowà mogàvodà.\n\nPerf.fut.-cond.-run.dry-3p.masc. - small. - river. - if. - perf.fut.-cond.-exists.-3p.masc. -water.-lack. - in. - large.river.\n\nThe small river will run dry if there is no water in the big river.", "created_utc": "1624466458.0", "edited": "False", "id": "h2s9kgo", "is_submitter": "False", "link_id": "t3_o5vazn", "parent_id": "t3_o5vazn", "score": "2", "subreddit": "conlangs", "subreddit_id": "t5_2red7"}, {"author": "MassiveNwah", "body": "That is quite a unique way of looking at time, and I've never heard of dialectal difference in *concepts* like this, it's enlightening!\n\nThat has a lot of potential for daughter language s separating very far conceptually, even if still relatively close in form and lexicon. \n\nHave you thought about doing anything like that?", "created_utc": "1624395430.0", "edited": "False", "id": "h2p0xnw", "is_submitter": "False", "link_id": "t3_o5o1s6", "parent_id": "t1_h2o3jqn", "score": "3", "subreddit": "conlangs", "subreddit_id": "t5_2red7"}, {"author": "MassiveNwah", "body": "I second that, English's system of \"intent-driven\" verbs like look versus see, makes sense (being a native speaker, I am biased, but still). It is easy to differentiate between them, whilst in most Slavic languages you have to memorise two verbs for the same word!\n\n I still for the life of me hate the fact that  працювати becomes попрацювати in the perfective, and doesn't lose the ва. The vast majority must simply be memorised, to me, for now because the patterns are so esoteric.", "created_utc": "1624179522.0", "edited": "False", "id": "h2etczc", "is_submitter": "False", "link_id": "t3_o3lwna", "parent_id": "t1_h2dorft", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "MassiveNwah", "body": "The vast array of verb forms in Ukrainian, and other Slavic languages, shocked me. It's one thing knowing about them, and another trying to figure out how грати becomes заграєм, грай, and грали in three verses of a listing song! These are basic examples, yes, but verbs are by far my biggest blind spot so far.", "created_utc": "1624139365.0", "edited": "False", "id": "h2d69pm", "is_submitter": "False", "link_id": "t3_o3lwna", "parent_id": "t3_o3lwna", "score": "7", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "MassiveNwah", "body": "Levetsí\n\nKɾaśaja ríjen, tjat evíbim.\n\n/'kraʃaja 'Ri:jɛn, tjat ɛ'vi:bɪm/\n\nKraśaja ríje-n, tja-t e-víbim.\n\nBetter - frog-pl., 2p.acc. 2p.s.intrans. - assume\n\nRíje is onomatopaeic, from a frog's croaking, and is thus a stressed /R/.\n\nVíbim is a verb meaning to judge, measure, estimate, or assume, and is primarily used for measurements, but as here can be used for folks' opinions.", "created_utc": "1620543884.0", "edited": "False", "id": "gxh3gu1", "is_submitter": "False", "link_id": "t3_n7vsat", "parent_id": "t3_n7vsat", "score": "3", "subreddit": "conlangs", "subreddit_id": "t5_2red7"}, {"author": "MassiveNwah", "body": "Levetsí \n\nLevetsí has separate transitive and intransitive conjugations for verb tense, as well as for a few aspectual affixes, which also decline.\n\n For example, the class two verb \"sevaś\" in the 1p.s. either has the form \"ísevaś\" for intrans. or \"vísevaś\" for trans.\n\n It's corresponding optative forms are \"ísekívaś\" and \"víseknívaś\" respectively.", "created_utc": "1620542448.0", "edited": "False", "id": "gxh1swq", "is_submitter": "False", "link_id": "t3_n7uoi4", "parent_id": "t3_n7uoi4", "score": "2", "subreddit": "conlangs", "subreddit_id": "t5_2red7"}, {"author": "MassiveNwah", "body": "\"Leś batkó j néba-t vaja\"  1p.pl.gen.- Father- in- heaven.-acc-3p.n.s.present.trans. Is\n\nLit. \"Our father in the heavens be\"\n\n\n \"Tjaś labó-t savaupésavdí ja-vaske vaja.\" 2p.gen.- Name- acc.- hallowed- 3p.n.s.present.trans.- must- 3p.n.s.present.trans.is.\n\nLit. \"Your name hallowed must be\"\n\n\n \"Tjaś levenrég-ét ja-vaske vaja\" 2p.gen.-kingdom- acc.- 3p.n.s.present.trans.-  must-3p.n.s.present.trans. is  \n\nLit. \"Your folk-rule must be\"\n\n\n\"Tjaś ké-kí ja-vaske vaja, éj óg Atla old Néba.\" 2p.gen.- Will- 3p.n.s.present.trans.-  must-3p.n.s.present.trans. is- on- the.nom- world- as- heaven.\n\nLit. \"Your will must be, as on Earth as Heaven\"\n\n\n \"Let elí-ja-vekív leś keśkam-nas\" 1p.pl.acc.- 3p.s.non.past.Hab.-3p.n.s.present.trans- give- 1p.pl.gen.- Bread.- Instr.pl.\n\nLit. \"Us you habitually give our bread\"\n\n\n\"U let ja-kníba leś kkaśnal-nas, old lé savaupodóto lev-net-gwí les,\" and- 1p.pl.acc.- 3p.n.s.present.trans- 1p.pl.gen.- Sin.- instr.pl.- Equivalence - 1p.pl.nom.- Indebted -folk- acc.pl- dativity.affix.- 1p.pl.instr.\n\nLit. \"And us forgive our evildoings, as we indebted folk to us\"\n\n\n \"U let ja-sekal-kwa temtaś-śa-s,\" and- 1p.pl.acc.- 3p.n.s.present.trans- drag- not- temptation- towards- instr.\n\nLit. \"And us do not drag towards temptation.\"\n\n\n\"Evre let kaśna-seó-s ja-se-ki-ségan.\" But- 1p.pl.acc.- Evil- from.-instr.-3p.n.s.present.trans- opt.- Save.\n\nLit. \"But us from evil save\"", "created_utc": "1619688861.0", "edited": "1619691065.0", "id": "gwa0c0u", "is_submitter": "True", "link_id": "t3_n10fem", "parent_id": "t3_n10fem", "score": "1", "subreddit": "conlangs", "subreddit_id": "t5_2red7"}, {"author": "MassiveNwah", "body": "Cheers for the advice. My best save so far was as bohemia under the the HRE", "created_utc": "1618256913.0", "edited": "False", "id": "guahnwm", "is_submitter": "True", "link_id": "t3_mpb0hj", "parent_id": "t1_gua299d", "score": "1", "subreddit": "crusaderkings2", "subreddit_id": "t5_2ui6p"}, {"author": "MassiveNwah", "body": "I honestly forgot I could choose not to lead armies myself, thanks for that!", "created_utc": "1618256788.0", "edited": "False", "id": "guahdrz", "is_submitter": "True", "link_id": "t3_mpb0hj", "parent_id": "t1_gu8t6yh", "score": "2", "subreddit": "crusaderkings2", "subreddit_id": "t5_2ui6p"}, {"author": "MassiveNwah", "body": "I think Ill try that then. Thanks!", "created_utc": "1618227299.0", "edited": "False", "id": "gu8s106", "is_submitter": "True", "link_id": "t3_mpb0hj", "parent_id": "t1_gu8rxfd", "score": "5", "subreddit": "crusaderkings2", "subreddit_id": "t5_2ui6p"}, {"author": "MassiveNwah", "body": "No Dlc, unfortunately. And Ive started as various leaders in England (dukes, kings etc), a nation in the ukraine, norway, poland, ireland, navarra, galicia, bohemia, and croatia. Only bohemia lasted longer than  2 years, but fell into a long decline.", "created_utc": "1618226544.0", "edited": "False", "id": "gu8r1w0", "is_submitter": "True", "link_id": "t3_mpb0hj", "parent_id": "t1_gu8q9n2", "score": "10", "subreddit": "crusaderkings2", "subreddit_id": "t5_2ui6p"}, {"author": "MassiveNwah", "body": "There are much worse things than polyglots, though only by a few degrees of magnitude. My personal hatred is for doors opening (or  worse yet, being opened) when you've shut them. \n\nAll in all though, yt polyglots are a bit like politicians: They love being heard, and folk hate hearing them, so it is quite rational I suppose.", "created_utc": "1617396851.0", "edited": "False", "id": "gt6gu40", "is_submitter": "False", "link_id": "t3_miousp", "parent_id": "t1_gt5s7jp", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "MassiveNwah", "body": "Thanks for replying in such great detail! Wakefield is more than close enough, I regularly \"cross the border\" into Wakefield Council territory on foot. \n\nYesterday, following off others I sowed six beetroot in mini-pots inside, and thoroughly forked over a bed (I didn't get a chance in winter). I plan on sowing some beetroot and radish in that a fortnight since, and some parsnips a fortnight after that.I\n\n Containers for potatoes, in a week or two.\n\nThank you for your comment, it is very helpful, have a nice day.", "created_utc": "1616306552.0", "edited": "False", "id": "grobldf", "is_submitter": "True", "link_id": "t3_m8bi5l", "parent_id": "t1_grkmr51", "score": "1", "subreddit": "GardeningUK", "subreddit_id": "t5_31s8w"}, {"author": "MassiveNwah", "body": "That's true, in any case I intend to do just that. Good night to you!", "created_utc": "1616192044.0", "edited": "False", "id": "grj3jbx", "is_submitter": "True", "link_id": "t3_m8bi5l", "parent_id": "t1_grj2hkg", "score": "1", "subreddit": "GardeningUK", "subreddit_id": "t5_31s8w"}, {"author": "MassiveNwah", "body": "I have actually been using that for what to do, but it's my main source of confusion on timings because it says that I should be doing everything in may whilst folk are doing everything *now*.", "created_utc": "1616186716.0", "edited": "False", "id": "grisxcs", "is_submitter": "True", "link_id": "t3_m8bi5l", "parent_id": "t1_grijvkx", "score": "1", "subreddit": "GardeningUK", "subreddit_id": "t5_31s8w"}, {"author": "MassiveNwah", "body": "Yes, your suggestion has been the general consensus amongst these comments, so I'll probably do just that this afternoon. By the way, have you any experience with frosts in the Barnsley area, because that, 's the main thing I'm worried about. I'm a person who finds it hard to take initiative so seeing that others like you are already doing this helpd a lot. Thanks for taking the time to comment, and have a nice day.", "created_utc": "1616160125.0", "edited": "False", "id": "grh6q0p", "is_submitter": "True", "link_id": "t3_m8bi5l", "parent_id": "t1_grgxyho", "score": "1", "subreddit": "GardeningUK", "subreddit_id": "t5_31s8w"}, {"author": "MassiveNwah", "body": "I suppose I'll do the same then, if it fails it is still early on in the season :)\nThanks for the comment, and have a nice day.", "created_utc": "1616159890.0", "edited": "False", "id": "grh6azr", "is_submitter": "True", "link_id": "t3_m8bi5l", "parent_id": "t1_grgh1ls", "score": "3", "subreddit": "GardeningUK", "subreddit_id": "t5_31s8w"}, {"author": "MassiveNwah", "body": "I have but its very variable since I'm planting mainly in soil since i haven't enough pots, and I'm one of those who doubts almost every action before I take it. I did just check them again and I have decided to just sow some seed now. Even if it fails, all I've got are veg that can be succession sowed anyway. Cheers for the comment, this was mostly to relieve any doubts about going ahead.", "created_utc": "1616159821.0", "edited": "False", "id": "grh66hw", "is_submitter": "True", "link_id": "t3_m8bi5l", "parent_id": "t1_grgtfgv", "score": "2", "subreddit": "GardeningUK", "subreddit_id": "t5_31s8w"}, {"author": "MassiveNwah", "body": "I know that my grandad still uses it, and when I was littler (about 10 yo) I still regularly used it. It was exposure to media and posh people that stopped it for me. I'm currently trying to revive it in my own speech though, but the point is quite a few people do use it.", "created_utc": "1615962334.0", "edited": "False", "id": "gr7mzfq", "is_submitter": "False", "link_id": "t3_m6d2aj", "parent_id": "t1_gr6jgyb", "score": "3", "subreddit": "anglish", "subreddit_id": "t5_2sne7"}, {"author": "MassiveNwah", "body": "Levetsi\n\nSé ísevaś arul, taśe kirén aśott arel, Kaisar duvuśu ulanśóbót udókónót saśkníśemail; u gé óg dók Kíkeraśíbít kónat saśsegrípa uvuśun méndíns, émbassí uvu u amít dósaśvumba uvuśu bośos, evre Kaisar amít saśvom u uvu ót kónat saśserípa, u tagí kónaśóbót pén saśvup wíjaś uvu savéretés. Aśott, uvu amít saśsenab óg dókkó u saśvob: \"Saupevaś dókan, séś os, saupevaś dókan u orsagśob ké-semora.\"\n\n /se isɛvaʃ aRul taʃɛ kɪRen aʃɒtt aRel kaisaR duvuʃu ulanʃobot udokonot saʃkniʃɛmail u ge og dok KikɛRaʃibit konat saʃsɛgRipa uvuʃun mendins embassi uvu u amit dosaʃvumba uvuʃu bɒʃɒs evRe KaisaR amit saʃvɒm u uvu ót konat saʃsɛRipa u tagi konaʃobot pén saʃvup wijaʃ uvu saveRɛtes aʃɒtt uvu amit saʃsɛnab og dokko u saʃvɒb saupevaʃ dokan séʃ ɒs saupevaʃ dokan u oRsagʃob ke-sɛmoRa/\n\nI-1sg.trans.present.-learn-that-many-day.pl.-after-this-Caesar-one.of.his-daughter.*.acc.-son.pl.acc.-3.c.sg.past.trans.-pay.visit.to.-and-since-the.nom.-boy-Cicero-*.acc.-book.acc.--3.c.sg.past.trans.-hold-his.pl.-hand.pl.instr.-flayed-he-and-it.acc.3.s.opt.3.c.sg.past.trans.-hide-his-loose.garment.instr.-but-Caesar-it.acc.-3.c.sg.past.trans.-see-and-he-the.acc.-book.acc.-3.c.sg.past.trans.-take-and-large-book.*.acc.-passage-3.c.sg.past.trans.-read-whilst-he-3.c.sg.past.intrans.-stand-after-he-it.acc.--3.c.sg.past.trans.-return-the.nom.-boy.dat.affix-and-3.c.sg.past.trans.-say--3.n.sg.past.intrans.-learn-man-my-child-3.n.sg.past.intrans.-learn-man-and-country*.-nom.affix.-love.\n\nLit. I learn that, many days above** this, Caesar one of his daughter's sons visited;and since the boy Cicero's book had using his hands, flayed he and it  hopefully hid using his clothes, but Caesar it saw and he the book took, and large book's  passage read whilst he stood. Above, he it returned to the boy and said: \"Learned man, my child, learned man and country's lover.\"\n\n **A more formal possessive construction, equating roughly to x of y.\n*** \"Aśott\" means above, aboon, but this language's concept of time is that it layers up like leaves on the forest floor so an event above x is after it.\n\nI apologise for the poor gloss and lit. translation, it took two hours from finding this post to get to this word (the \"perks\" of using a touch screen).", "created_utc": "1615804314.0", "edited": "False", "id": "gqzz7so", "is_submitter": "False", "link_id": "t3_m5edpc", "parent_id": "t3_m5edpc", "score": "3", "subreddit": "conlangs", "subreddit_id": "t5_2red7"}, {"author": "MassiveNwah", "body": "There's a pub in Cudworth -Barnsley - called The Pinfold Hotel with a field next to it and all. Didn't think there'd be so many others!", "created_utc": "1615666368.0", "edited": "False", "id": "gqtwt0s", "is_submitter": "False", "link_id": "t3_m4cjnz", "parent_id": "t3_m4cjnz", "score": "3", "subreddit": "yorkshire", "subreddit_id": "t5_2rz9n"}, {"author": "MassiveNwah", "body": "Sé óvom arul Tanaka knagri uvuśu maśat dísaśsemar óbs aggans mém, gós uvu reś dóvavur vavégsi.\n\n\n/se ovɒm aRul tanaka knagRɪ uvuʃu maʃat disaʃsɛmaR obs aggans mem gos uvu Rɛʃ dovavuR vavegsɪ/\n\n\nI-1p.s.present.intrans.-see-that-Tanaka-Mr-his-house.acc.-pot.3p.s.past.trans.-leave-two.inst.-hours.inst-since-therefore-he-here-pot.3p.s.present.trans.-shall-3p.s.present.trans.-stand.\n\nI hear that Mr Tanaka left his house two hours ago, so he may be here soon.", "created_utc": "1615540479.0", "edited": "False", "id": "gqo9ab8", "is_submitter": "False", "link_id": "t3_m35ey6", "parent_id": "t3_m35ey6", "score": "3", "subreddit": "conlangs", "subreddit_id": "t5_2red7"}, {"author": "MassiveNwah", "body": "Íg késem  amíś lasíkirés gabtusut jasesek.\n\n/ig kesɛm amiʃ lasikɪRes gabtusut jasɛsɛk/\n\nThe.nom.s.-cake-its.n.pl.-leaf.day.inst.-bee.fire.acc.-3p.n.s.pres.-lack.\n\nThe cake its (using) leaf-day bee-fire lacks.\n\nThe birthday candles are missing from the cake.", "created_utc": "1615458862.0", "edited": "False", "id": "gqk4j8o", "is_submitter": "False", "link_id": "t3_m1jv5c", "parent_id": "t3_m1jv5c", "score": "2", "subreddit": "conlangs", "subreddit_id": "t5_2red7"}, {"author": "MassiveNwah", "body": "Levetsi\n\nArel lev uvuśu osot saśvastíkwe.\n\n/aRel lev uvuʃu ɒsɒt saʃvastikʷe/\n\nArel lev uvuśu os-ot saś-vastí-kwe.\n\nThis-person-3p.c.gen.s.pro.-child-acc.s.-3p.s.past.trans.-recall-neg.\n\nLit. This person his child recalled-not.\n\nThis person did not know his child at all.", "created_utc": "1612505479.0", "edited": "1612505915.0", "id": "gm35zwb", "is_submitter": "False", "link_id": "t3_lcr0l3", "parent_id": "t3_lcr0l3", "score": "2", "subreddit": "conlangs", "subreddit_id": "t5_2red7"}, {"author": "MassiveNwah", "body": "Óg turav u uvuśu sauli amte jóvasul, sigaretnas ulóśjóvumar.\nÓg-turav-u-uvuśu-sauli-amte-jó-vasul,-sigaret-nas-ulóś-jó-vumar.\n/og tuRav u uvuʃu saulɪ amte jovasul, sɪgaRetnas uloʃjovumaR/\nThe.nom.s.-trader-and-3p.gen.s.pro.-wife-reflexive.non1p.-3p.c.pl.pres.ind.intrans.-kill- cigarette.inst.pl.-hab.3.nonpast.pl.-3p.c.pl.pres.ind.trans.-smoke.\nThe trader and his wife are killing themselves, constantly smoking cigarettes.", "created_utc": "1612464223.0", "edited": "False", "id": "gm0po0y", "is_submitter": "False", "link_id": "t3_lb6p91", "parent_id": "t3_lb6p91", "score": "2", "subreddit": "conlangs", "subreddit_id": "t5_2red7"}, {"author": "MassiveNwah", "body": "True, I'd also recommend hazel myself, or any coppicewood, they usually form straightish wands.", "created_utc": "1612448574.0", "edited": "False", "id": "glzmvzn", "is_submitter": "False", "link_id": "t3_lc5f8i", "parent_id": "t1_glzkezq", "score": "1", "subreddit": "PrimitiveTechnology", "subreddit_id": "t5_38sn2"}, {"author": "MassiveNwah", "body": "I don't know how useful this'll be since I'm in England, but here we get dogwood absolutely everywhere - even if hawthorn is more common. So if tha looks about tha'll find some.", "created_utc": "1612447257.0", "edited": "False", "id": "glzk9tg", "is_submitter": "False", "link_id": "t3_lc5f8i", "parent_id": "t1_glzb6ow", "score": "1", "subreddit": "PrimitiveTechnology", "subreddit_id": "t5_38sn2"}, {"author": "MassiveNwah", "body": "True, but it gives off that feeling in the lyrics. It is certainly a nice song, but the lyrics' meaning hangs over it like a silver cloud. I'm just personally more of a comedic music person myself, songs like \"The Sucking Pig\" or \"The Two Magicians.\"", "created_utc": "1611963224.0", "edited": "False", "id": "glb2asc", "is_submitter": "False", "link_id": "t3_l74lfj", "parent_id": "t1_glag76c", "score": "1", "subreddit": "hungarian", "subreddit_id": "t5_2xeuq"}, {"author": "MassiveNwah", "body": "I would have used -stead as rather than -house, myself. \n\nIt may have been better to use \"in the morning\" and \"at night for am and pm, although I understand not writing it out in full.\n\n\"Boroughs\" just seems off to me, I know it is germanic but perhaps \"hundreds\" would've wrought better: It's kinder on the ear, even if Dutch divisions aren't technically hundreds.\n\nOverall, I like this. It's simply good, and there's no higher praise. It's kind to the ear.", "created_utc": "1611876444.0", "edited": "False", "id": "gl5vtfo", "is_submitter": "False", "link_id": "t3_l61xyt", "parent_id": "t3_l61xyt", "score": "1", "subreddit": "anglish", "subreddit_id": "t5_2sne7"}, {"author": "MassiveNwah", "body": "I can't help with the translation, but there's a song that this always reminds me of. I don't know the proper name but Holdviola has it as just \"Erdő\". It's a song I prefer since it's clearer (and not a love song), just thought to recommend it. Good luck with thy learning.", "created_utc": "1611875093.0", "edited": "False", "id": "gl5soks", "is_submitter": "False", "link_id": "t3_l74lfj", "parent_id": "t3_l74lfj", "score": "1", "subreddit": "hungarian", "subreddit_id": "t5_2xeuq"}, {"author": "MassiveNwah", "body": "Flamborough head, next to the lighthouse.", "created_utc": "1607887731.0", "edited": "False", "id": "gfqc2j8", "is_submitter": "False", "link_id": "t3_kcbfi0", "parent_id": "t3_kcbfi0", "score": "3", "subreddit": "yorkshire", "subreddit_id": "t5_2rz9n"}, {"author": "MassiveNwah", "body": "I noticed this as well, and I'm glad that Hinterland put out fixes like this so quickly, good on 'em. Have a nice day!", "created_utc": "1607778034.0", "edited": "False", "id": "gfiqvm2", "is_submitter": "False", "link_id": "t3_kbgffy", "parent_id": "t3_kbgffy", "score": "1", "subreddit": "thelongdark", "subreddit_id": "t5_2ygr3"}, {"author": "MassiveNwah", "body": "I do find it interesting! I'd not heard of this, thank you!", "created_utc": "1607618652.0", "edited": "False", "id": "gfaq4qf", "is_submitter": "True", "link_id": "t3_kahu04", "parent_id": "t1_gfalbe7", "score": "1", "subreddit": "AskUK", "subreddit_id": "t5_2t4s3"}, {"author": "MassiveNwah", "body": "Thanks for replying!\n\nI reckon my writing has become somewhat americanised as well (I say \"tidbits\", and probably ended up with a missed typo, although I'd not thought about the \"Murica\" side of it, thank you). I know precious little about Southwestern speech, but I gather it's distinct from SE speech. I don't encounter much variance in consonants beyond \"drownded\" and \"demond\", so I hadn't thought of that. This is quite interesting!", "created_utc": "1607618581.0", "edited": "False", "id": "gfapx7u", "is_submitter": "True", "link_id": "t3_kahu04", "parent_id": "t1_gfanm5q", "score": "1", "subreddit": "AskUK", "subreddit_id": "t5_2t4s3"}, {"author": "MassiveNwah", "body": "It's a shame, isn't it? You could look into regionalisms from Merseyside, and try to reconnect with it. Doing that for me helped make me more happy and confident in speaking, and more connected to others around me and the land I live in, though admittedly I still live where I was born so it's a bit more accessible, for lack of a better term. Thanks for replying, hope you'll be well!", "created_utc": "1607618074.0", "edited": "False", "id": "gfaogkk", "is_submitter": "True", "link_id": "t3_kahu04", "parent_id": "t1_gfam5xd", "score": "3", "subreddit": "AskUK", "subreddit_id": "t5_2t4s3"}, {"author": "MassiveNwah", "body": "Has anyone else had their feats, and badges reset?", "created_utc": "1607451917.0", "edited": "False", "id": "gf2teei", "is_submitter": "False", "link_id": "t3_k8losx", "parent_id": "t3_k8losx", "score": "1", "subreddit": "thelongdark", "subreddit_id": "t5_2ygr3"}, {"author": "MassiveNwah", "body": " South Yorkshire\nGrimethorpe -> Grimey\nShafton-Two-Gates -> Shaft(s)", "created_utc": "1606660463.0", "edited": "False", "id": "ge1bqr3", "is_submitter": "False", "link_id": "t3_k37plz", "parent_id": "t3_k37plz", "score": "4", "subreddit": "yorkshire", "subreddit_id": "t5_2rz9n"}, {"author": "MassiveNwah", "body": "Even meat gravy?! This is only the second person I've ever heard of not liking gravy, are you sure he's human?", "created_utc": "1606495256.0", "edited": "False", "id": "gds05v0", "is_submitter": "False", "link_id": "t3_k1jkjp", "parent_id": "t1_gdryddh", "score": "1", "subreddit": "conlangs", "subreddit_id": "t5_2red7"}, {"author": "MassiveNwah", "body": "Sorry if this is irrelevant, but what kind of gravy? Bisto gravy granules are the best liquid for food possible btw.", "created_utc": "1606490400.0", "edited": "False", "id": "gdrrfbq", "is_submitter": "False", "link_id": "t3_k1jkjp", "parent_id": "t3_k1jkjp", "score": "1", "subreddit": "conlangs", "subreddit_id": "t5_2red7"}, {"author": "MassiveNwah", "body": "If it needs to be cultivated, then use a rotovator if you've got one.\n\n If not dig the planting area to a depth of 1ft and mix the soil about, especially between different parts of the planting area. Focus on bringing a little bit of subsoil up as well. \nRemove any large (thumb sized+) stones you find, as well as breaking up clods with a fork or rake. \nBackfill the hole and rake level. Tread on the heels to firm it down and rake level again. Use the straight back of the rake to do the precision levelling.\n This all creates well drained fine tilth for seed to grow in. \n\nKeep in mind this might not be the right option for your land however.", "created_utc": "1606443542.0", "edited": "False", "id": "gdq5ptl", "is_submitter": "False", "link_id": "t3_k1fshb", "parent_id": "t3_k1fshb", "score": "1", "subreddit": "homestead", "subreddit_id": "t5_2s8lc"}, {"author": "MassiveNwah", "body": "Thanks for taking the time to reply, I can tell you've put a lot of effort into this, it really shows!", "created_utc": "1605577287.0", "edited": "False", "id": "gckd9jp", "is_submitter": "False", "link_id": "t3_juyqhx", "parent_id": "t1_gcjbsw8", "score": "1", "subreddit": "conlangs", "subreddit_id": "t5_2red7"}, {"author": "MassiveNwah", "body": "May I ask how you constructed this? Imagined languages of this sort, for lack of a better term, fascinate me to no end.", "created_utc": "1605550681.0", "edited": "False", "id": "gcioitu", "is_submitter": "False", "link_id": "t3_juyqhx", "parent_id": "t3_juyqhx", "score": "1", "subreddit": "conlangs", "subreddit_id": "t5_2red7"}, {"author": "MassiveNwah", "body": "No, in Cudworth, it's gone now though.", "created_utc": "1604953817.0", "edited": "False", "id": "gbr62l5", "is_submitter": "False", "link_id": "t3_jqhyh6", "parent_id": "t1_gbp0g6g", "score": "1", "subreddit": "yorkshire", "subreddit_id": "t5_2rz9n"}, {"author": "MassiveNwah", "body": "Only started disappearing earlier today here, in Barnsley it's been here half a week.", "created_utc": "1604881668.0", "edited": "False", "id": "gbo55mm", "is_submitter": "False", "link_id": "t3_jqhyh6", "parent_id": "t3_jqhyh6", "score": "2", "subreddit": "yorkshire", "subreddit_id": "t5_2rz9n"}, {"author": "MassiveNwah", "body": "Thanks.", "created_utc": "1604579833.0", "edited": "False", "id": "gb7zzxh", "is_submitter": "False", "link_id": "t3_jnlk5f", "parent_id": "t1_gb7xtt8", "score": "1", "subreddit": "homestead", "subreddit_id": "t5_2s8lc"}, {"author": "MassiveNwah", "body": "Thanks for replying. I've been reading up on debit, and apparently paying bills and payments etc. on time does that though? I'd say debit should be used for most things while credit is just for building it, only just started to look into financial info, however so I could be off the mark.", "created_utc": "1604524563.0", "edited": "False", "id": "gb5pc1i", "is_submitter": "False", "link_id": "t3_jnlk5f", "parent_id": "t1_gb5mjxb", "score": "1", "subreddit": "homestead", "subreddit_id": "t5_2s8lc"}, {"author": "MassiveNwah", "body": "Would a debit card be any better? Correct me if I'm wrong, but doesn't debit just involve storing your own money with the bank to withdraw as opposed to taking the bank's money?", "created_utc": "1604517951.0", "edited": "False", "id": "gb5b8jb", "is_submitter": "False", "link_id": "t3_jnlk5f", "parent_id": "t1_gb4ev7t", "score": "1", "subreddit": "homestead", "subreddit_id": "t5_2s8lc"}, {"author": "MassiveNwah", "body": "I'd say you should look into what you're wanting for your garden. I myself lik e shrubs such as dogwood (cornus) and so you look into the conditions they like and the conditions of your garden. The RHS website is very useful, as well. I'd say the most common mistake I've made is ignoring a plant's favoured conditions and leaving a shade loving plant in full sun, or a desert plant outside ( I'm in England, it's rainy). Remember, it's far easier to overwater than  underwater your plants. There's also dedicated gardening subreddits.", "created_utc": "1604323702.0", "edited": "False", "id": "gaw6mch", "is_submitter": "False", "link_id": "t3_jmkpn3", "parent_id": "t3_jmkpn3", "score": "2", "subreddit": "homestead", "subreddit_id": "t5_2s8lc"}, {"author": "MassiveNwah", "body": "Maybe show a break in the trees? Think about streams you've seen in real life they tend to have a lack of overhead cover if they're wide enough.", "created_utc": "1603459355.0", "edited": "False", "id": "g9r85ej", "is_submitter": "False", "link_id": "t3_jg5tm0", "parent_id": "t1_g9qm9l5", "score": "2", "subreddit": "mapmaking", "subreddit_id": "t5_2sfsa"}, {"author": "MassiveNwah", "body": "The main thing with phonotactics is syllable structure, which boils down to what sounds can coexist. You might have [k] become [c] before a front vowel, as English does (my dialect at least), so you end up with [ci:n] for example. Look at what real languages do, and look into things like phonology and phonotactics articles on Wikipedia - they're good enough after all. Hope this helps.", "created_utc": "1603430470.0", "edited": "False", "id": "g9qd1n0", "is_submitter": "False", "link_id": "t3_jgeysb", "parent_id": "t1_g9q5z6b", "score": "5", "subreddit": "conlangs", "subreddit_id": "t5_2red7"}, {"author": "MassiveNwah", "body": "You should look into the phonotactics of Icelandic and make words using something similar to it. Or not similar to German's, if that's what you don't want.", "created_utc": "1603424955.0", "edited": "False", "id": "g9q5ep0", "is_submitter": "False", "link_id": "t3_jgeysb", "parent_id": "t3_jgeysb", "score": "12", "subreddit": "conlangs", "subreddit_id": "t5_2red7"}, {"author": "MassiveNwah", "body": "Then perhaps adding slope (if you can, I know I can't :)) in the forest or extending that stream back with a break would help break it up. The main \"problem\" I see here is it's too big and flat.", "created_utc": "1603423137.0", "edited": "False", "id": "g9q288d", "is_submitter": "False", "link_id": "t3_jg5tm0", "parent_id": "t1_g9ptye8", "score": "2", "subreddit": "mapmaking", "subreddit_id": "t5_2sfsa"}, {"author": "MassiveNwah", "body": "Perhaps having more piecemeal woodland, with fields and hedgerows could work better? It would fit with the mill as well. It is looking quite good though.", "created_utc": "1603413644.0", "edited": "False", "id": "g9pjf7z", "is_submitter": "False", "link_id": "t3_jg5tm0", "parent_id": "t3_jg5tm0", "score": "1", "subreddit": "mapmaking", "subreddit_id": "t5_2sfsa"}, {"author": "MassiveNwah", "body": "Thanks for this.", "created_utc": "1602094447.0", "edited": "False", "id": "g80yl44", "is_submitter": "False", "link_id": "t3_j5f2n0", "parent_id": "t1_g7ykbsw", "score": "1", "subreddit": "conlangs", "subreddit_id": "t5_2red7"}, {"author": "MassiveNwah", "body": "What are some negation strategies used in languages that are SOV or have an animacy heirarchy? I'm particularly interested in how negation works in athabascan and inuit languages.", "created_utc": "1602023211.0", "edited": "False", "id": "g7y0sqs", "is_submitter": "False", "link_id": "t3_j5f2n0", "parent_id": "t3_j5f2n0", "score": "2", "subreddit": "conlangs", "subreddit_id": "t5_2red7"}, {"author": "MassiveNwah", "body": "Pasnan\n \nHe hit the banana with a hammer and spoilt it.\n\nHammer use-impf.3.in.s. he the.in. banana sö*-hit-impf.3.an.s and.therefore he it zö-ruin-impf.3p.in.s.\n\n/kulme weʃus naʒim tiɲø banan søisøgum ɲel naʒim naʒam zøpwegys/\n\nKulme wešus nažim tiňö banan söisögum ňel nažim nažam zöpwegus.\n\nSö- and zö- are prefixes used to determine the subject of a clause because Pasnan uses an animacy hierarchy and has no other way to convey this.", "created_utc": "1600515690.0", "edited": "False", "id": "g5szh2q", "is_submitter": "False", "link_id": "t3_iul8kh", "parent_id": "t3_iul8kh", "score": "3", "subreddit": "conlangs", "subreddit_id": "t5_2red7"}, {"author": "MassiveNwah", "body": "How does negation work in Navajo ( and other Athabascan languages)?           \nAnd subclauses as well, if they or an equivalent are present?", "created_utc": "1599348788.0", "edited": "False", "id": "g46hemn", "is_submitter": "False", "link_id": "t3_ijxlim", "parent_id": "t3_ijxlim", "score": "1", "subreddit": "linguistics", "subreddit_id": "t5_2qhos"}, {"author": "MassiveNwah", "body": "This is amazing, the only fault I can see is that the holderness coast area is far too indented.", "created_utc": "1589619828.0", "edited": "False", "id": "fqsv0kt", "is_submitter": "False", "link_id": "t3_fyg377", "parent_id": "t3_fyg377", "score": "2", "subreddit": "mapmaking", "subreddit_id": "t5_2sfsa"}]