[{"author": "Master-of-Ceremony", "body": "It’s already been said but can’t be reiterated enough - time management! Even at elite universities, there are only two types of people who go on to be near the top of their class. Those are the complete geniuses (which really just means they put the work in before university), and the freakishly organised people. If you don’t have the luxury of being in the former group, aim to be that person other people admire for their organisation.", "created_utc": "1666774722.0", "edited": "False", "id": "itu0o6s", "is_submitter": "False", "link_id": "t3_ycexmf", "parent_id": "t3_ycexmf", "score": "1", "subreddit": "UniUK", "subreddit_id": "t5_3cw2d"}, {"author": "Master-of-Ceremony", "body": "Not quite", "created_utc": "1666767718.0", "edited": "False", "id": "ittsqlm", "is_submitter": "True", "link_id": "t3_ydj56j", "parent_id": "t1_itstllc", "score": "1", "subreddit": "chess", "subreddit_id": "t5_2qhr7"}, {"author": "Master-of-Ceremony", "body": "I cba replying to everything, fortunately for me the internet/chess is not all that I value in life, but on the first point, try to play 10 openings against the engine in standard chess, and then in 960, and see which one goes better by move 10 (or 15 or whatever) each time. My point is I suspect you’d do much worse in 960 (assuming you’re at a chess level where you can comfortably play 10 moves of prep against/with e4, d4, c4). Then I believe that the following can be deduced from this: because white will get the choice of which opening to play, and therefore will know the correct setup  (1 of potentially thousands of reasonable early opening setups) from the engine, and could memorise the plans/tactical themes/lines which their opponent wouldn’t know, because they couldn’t know in advance which lines their opponent has studied (and it would be a much bigger task to deal with as black imo), they would have a much bigger advantage. \n\nPlease correct me if I’m wrong, (and this is the opinion of none other than Magnus Carlsen I believe) good opening preparation was more effective at the elite level before extensive computer preparation - Kasparov often blew his opponents off the board with prep for example. Why? Because he knew the plans better than his opponents/he knew more moves etc. And this is Kasparov vs humans, I’m talking about SF vs humans.  \n\nAlso you clearly don’t understand what I’ve said, openings aren’t more important due to less prep, they’re more important due to the increased volatility of the evaluations during the opening/importance of understanding plans in positions. So small amounts of sharp prep that your opponent cannot prepare for at all (whereas they usually will be studied in standard) will, I believe, be more lethal. White, imo, will have this prep generally speaking, and black will not, because of the advantage of choice.\n\nLast but not least, if you find a titled player that suspects almost all supergms don’t have at least 10,000 lines studies then I’ll grant you the last point, but otherwise, that is a *conservative* estimate, which I will take to be useful for rough calculations.\n\nEdit: also ofc black scores fine in current 960 **no one is doing prep for 960 atm**", "created_utc": "1666740824.0", "edited": "False", "id": "itsg6qm", "is_submitter": "True", "link_id": "t3_yddds5", "parent_id": "t1_itsan9z", "score": "1", "subreddit": "chess", "subreddit_id": "t5_2qhr7"}, {"author": "Master-of-Ceremony", "body": "“The opening is more critical than usual” - in standard chess we take the opening for granted due to theory, but it is actually a tremendously complicated (I’ve seen a quote, but idk where from, saying the most complicated) part of the game, where our opponents may set up potentially game ending traps (look at Magnus’ 1. … g5 against Naka today).\n\nOn the “unsourced” nature of my claim, most GM Chessable lifetime courses on a single opening have well over 1,000 lines that they are WILLING to release. I mean there are NM courses as white with 1200 lines for heavens sake. And as a simple (conservative in my opinion) numerical estimate, suppose you learn 10 lines a day, 200 days per year, allowing the rest of them for review/rest, for 20 years. Then you have learn 20,000 lines. 960*100 (and many positions will transpose) is 96,000, i.e. the SAME order of magnitude. \n\nChoose a 960 position, there are maybe 2-6 reasonable first moved as white, probably in the order of 100 reasonable 2/3 first moves as white, so for black to prepare against a 960 position where white dictates the position would probably require significantly more effort.\n\nTry not to come across as such a dick btw chief", "created_utc": "1666736523.0", "edited": "False", "id": "its6mav", "is_submitter": "True", "link_id": "t3_yddds5", "parent_id": "t1_its4hoo", "score": "2", "subreddit": "chess", "subreddit_id": "t5_2qhr7"}, {"author": "Master-of-Ceremony", "body": "If the scenario presented in the first paragraph is taken then experienced players will have been playing mostly 960 for 20 years", "created_utc": "1666735768.0", "edited": "False", "id": "its4wkw", "is_submitter": "True", "link_id": "t3_yddds5", "parent_id": "t1_its4etq", "score": "3", "subreddit": "chess", "subreddit_id": "t5_2qhr7"}, {"author": "Master-of-Ceremony", "body": "Ah okay, so it’s kind of like “could have” and “could of” in English - sure “could of” isn’t correct, but large groups of native speakers use it I’m everyday speech to the point where it doesn’t matter which one you say. Cheers!", "created_utc": "1666664111.0", "edited": "False", "id": "ito7vvs", "is_submitter": "True", "link_id": "t3_ybj4h6", "parent_id": "t1_itiea48", "score": "1", "subreddit": "learnspanish", "subreddit_id": "t5_2rd6d"}, {"author": "Master-of-Ceremony", "body": "Thank you", "created_utc": "1666536707.0", "edited": "False", "id": "itgog0x", "is_submitter": "True", "link_id": "t3_ybj4h6", "parent_id": "t1_itgmjli", "score": "2", "subreddit": "learnspanish", "subreddit_id": "t5_2rd6d"}, {"author": "Master-of-Ceremony", "body": "92% drawn according to the lichess db, so actually twice as like to be decisive", "created_utc": "1666461768.0", "edited": "False", "id": "itcws2q", "is_submitter": "True", "link_id": "t3_y56h38", "parent_id": "t1_itcaogn", "score": "1", "subreddit": "chess", "subreddit_id": "t5_2qhr7"}, {"author": "Master-of-Ceremony", "body": "The guy that won was losing otb and held his opponent's queen in his hand as a fiddle (perhaps maliciously). For some reason (ridiculous at such a high level tournament) they didn't have spare queens around for the players, so the other guy lost. Very controversial. Iirc he put a rook upside down for a queen (common in chess clubs where pieces are of short supply) but this was illegal for an official tournament and so he lost. (My memory is not great of this, but there is a video out there so you can check if I've spouted a load of rubbish for yourself)", "created_utc": "1666056945.0", "edited": "False", "id": "isr0br9", "is_submitter": "False", "link_id": "t3_y6qp5n", "parent_id": "t1_isqxbpy", "score": "13", "subreddit": "chess", "subreddit_id": "t5_2qhr7"}, {"author": "Master-of-Ceremony", "body": "Ah, how do you know?", "created_utc": "1665891384.0", "edited": "False", "id": "isi24qp", "is_submitter": "True", "link_id": "t3_y56h38", "parent_id": "t1_isi1ixa", "score": "3", "subreddit": "chess", "subreddit_id": "t5_2qhr7"}, {"author": "Master-of-Ceremony", "body": "I confess I’m only a beginner in the language learning process, but I imagine one thing that makes a big difference is listening in a VERY focussed way. Think about how you focus when you are learning to read/write English - now apply that to listening and you’ll start to get somewhere. I notice even at my low level of Spanish really trying to pick out words makes a difference as opposed to passive listening.\n\nFor some loose justification, pretend you are a baby, and your native tongue is essentially foreign to you at this point, you speak no language at all fluently! In this case, would you not put every neuron in your brain to work trying to understand the speech around you? And children do that for years before understanding language! Expect the same difficulties for yourself - it’s fantastically hard but you’ll get there!", "created_utc": "1665623103.0", "edited": "False", "id": "is3iya0", "is_submitter": "False", "link_id": "t3_y2cyhv", "parent_id": "t3_y2cyhv", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Master-of-Ceremony", "body": "I didn’t know this - maybe I’ll try one and if it’s useful invest in a more complete course to really sure up my knowledge. Thanksb", "created_utc": "1665622796.0", "edited": "False", "id": "is3i8el", "is_submitter": "True", "link_id": "t3_y23ze2", "parent_id": "t1_is0t74m", "score": "1", "subreddit": "chess", "subreddit_id": "t5_2qhr7"}, {"author": "Master-of-Ceremony", "body": "Oh my, I’d heard of descriptive notation without knowing what it actually is and ohmygod that looks disgusting - has no one bother to translate some of the classics into modern notation!?", "created_utc": "1665622580.0", "edited": "False", "id": "is3hqbk", "is_submitter": "True", "link_id": "t3_y23ze2", "parent_id": "t1_is1fvjs", "score": "1", "subreddit": "chess", "subreddit_id": "t5_2qhr7"}, {"author": "Master-of-Ceremony", "body": "Yeah I’m not falling for trying a book Carlsen decided was too complicated to be worth his time", "created_utc": "1665582484.0", "edited": "False", "id": "is0r01j", "is_submitter": "True", "link_id": "t3_y23ze2", "parent_id": "t1_is0p6ly", "score": "1", "subreddit": "chess", "subreddit_id": "t5_2qhr7"}, {"author": "Master-of-Ceremony", "body": "Vettel is the most overrated champion of all time and shouldn’t be in the conversation with the other greats of his era", "created_utc": "1664903475.0", "edited": "False", "id": "ir1fg5k", "is_submitter": "False", "link_id": "t3_xvhwrq", "parent_id": "t3_xvhwrq", "score": "1", "subreddit": "formuladank", "subreddit_id": "t5_3ndbi"}, {"author": "Master-of-Ceremony", "body": "He mentioned he’s going to continue after he finishes his current speed run, which should be a couple of weeks max", "created_utc": "1664903370.0", "edited": "False", "id": "ir1f6hh", "is_submitter": "True", "link_id": "t3_uatpc0", "parent_id": "t1_inhsu3v", "score": "2", "subreddit": "chess", "subreddit_id": "t5_2qhr7"}, {"author": "Master-of-Ceremony", "body": "If you went unguided, did you find it was easy to get accommodation going without a guide like the person in the link?", "created_utc": "1661127985.0", "edited": "False", "id": "il9emy0", "is_submitter": "True", "link_id": "t3_wtgom4", "parent_id": "t1_il5a7lc", "score": "1", "subreddit": "hiking", "subreddit_id": "t5_2r9om"}, {"author": "Master-of-Ceremony", "body": "I'm a native English speaker, and I even enjoy a little bit of etymology and linguistics, but honestly the people who speak English as a second language have a more \"rigorous\" understanding of English grammar than I do. Seriously, it takes me a solid 10 second so recall what an adjective is, and as soon as you go past nouns, verbs and adjectives, I don't know what people are talking about, because in school I didn't see the point - I already spoke English, and I knew where the words were supposed to go, but some people learning the language can benefit from this more systematic structure.\n\nLearning Spanish these days, I think I can see why - the other day I got caught out (and I'm still slightly perplexed by) saying \"estamos turistas\" instead of \"somos turistas\". Both mean \"We are tourists\", but in my self taught view, the first one implied a temporary state, and so would be correct, whereas the second one implied a permanent state of being a tourist. The second one however is correct, and I was able to figure out why with the help of the internet, but I mentioned it to a Spanish friend I have, and they couldn't quite explain why it was that way, just that they knew \"somos\" was correct, and \"estamos\" was wrong. Point is, grammar is tough, even for natives, and it wouldn't surprise me if C2 non-native speakers understand grammatical structure of a language better than the natives generally (even if a native will almost never make a mistake)", "created_utc": "1660566747.0", "edited": "False", "id": "ikdibid", "is_submitter": "False", "link_id": "t3_wobse3", "parent_id": "t3_wobse3", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Master-of-Ceremony", "body": "Ah didn’t know he had a site dedicated to it too, cheers!", "created_utc": "1660426404.0", "edited": "False", "id": "ik6ejmf", "is_submitter": "True", "link_id": "t3_wniljg", "parent_id": "t1_ik5ddma", "score": "2", "subreddit": "alpinism", "subreddit_id": "t5_2rjam"}, {"author": "Master-of-Ceremony", "body": "Yeah don’t put yourself down - I have a 22yo friend who hikes with 2 trekking poles and knee compression pads! Hiking should be about making it as fun as possible for you, and true hikers will take that to heart and remember that there should be no ego in the mountains!", "created_utc": "1660344327.0", "edited": "False", "id": "ik22xil", "is_submitter": "False", "link_id": "t3_wmnsqf", "parent_id": "t3_wmnsqf", "score": "1", "subreddit": "hiking", "subreddit_id": "t5_2r9om"}, {"author": "Master-of-Ceremony", "body": "Ah I see - imho the format I suggested is better as it's less chance based than a WC  format (4 WC style chances to qualify, then a candidates style double round robin at the end to decide the champion), but still should allow drama to unfold. It means players having an exceptional year (e.g. Fabi and Shak in 2018) will almost definitely have a real shot at the title, and should decrease at least a bit the importance of prep.", "created_utc": "1658423210.0", "edited": "False", "id": "ih2o8am", "is_submitter": "False", "link_id": "t3_w3jcu7", "parent_id": "t1_ih2kxgy", "score": "2", "subreddit": "chess", "subreddit_id": "t5_2qhr7"}, {"author": "Master-of-Ceremony", "body": "there've been lots of rumours going around, hard to say what's true and what isnt", "created_utc": "1658414790.0", "edited": "False", "id": "ih21r2g", "is_submitter": "False", "link_id": "t3_w3jcu7", "parent_id": "t1_ih066v5", "score": "1", "subreddit": "chess", "subreddit_id": "t5_2qhr7"}, {"author": "Master-of-Ceremony", "body": "Personally, I've always though the chess world cup was a far more interesting format. If people feel that it's too luck based, have 4 world cup like tournaments through the year, say March, May, July, September, with the 8 finalists competing in a double round robin in November/December to decide who the best player in the world is that year. If you're claiming to be the best in the world, you better be able to make it to the final at least once out of 4 events.\n\nEdit: For those unfamiliar, the world cup is a knockout format where players are seeded and each matchup comprises of two classical games, after which the winner progresses to the next round and if it's tied two rapid games, etc.", "created_utc": "1658363290.0", "edited": "False", "id": "igzjs1b", "is_submitter": "False", "link_id": "t3_w3jcu7", "parent_id": "t3_w3jcu7", "score": "6", "subreddit": "chess", "subreddit_id": "t5_2qhr7"}, {"author": "Master-of-Ceremony", "body": "The line in the game was (spoiler) Qc6 Qf3 Qxc4 Qg4 Qc6 Qf3 Qxc2 Rec1 Qxc1+ Rxc1 Bxf3", "created_utc": "1658363084.0", "edited": "False", "id": "igzjc54", "is_submitter": "True", "link_id": "t3_w4232o", "parent_id": "t3_w4232o", "score": "2", "subreddit": "chess", "subreddit_id": "t5_2qhr7"}, {"author": "Master-of-Ceremony", "body": "He said he might, but don't count on it", "created_utc": "1658350976.0", "edited": "False", "id": "igyt0wc", "is_submitter": "False", "link_id": "t3_w3jcu7", "parent_id": "t1_igyrwzk", "score": "5", "subreddit": "chess", "subreddit_id": "t5_2qhr7"}, {"author": "Master-of-Ceremony", "body": "Haha, yeah, that's what inspired me to start poking around in it again - I stumbled across the Kramnik variation when looking for responses to the e6 Sicilian 6 months or so ago, but I was very busy with uni then so tucked it away for summer, and then the video by hpy reminded me.", "created_utc": "1658092456.0", "edited": "False", "id": "igkbdqm", "is_submitter": "True", "link_id": "t3_vz1nyu", "parent_id": "t1_ig7gt3y", "score": "2", "subreddit": "chess", "subreddit_id": "t5_2qhr7"}, {"author": "Master-of-Ceremony", "body": "Yes! I missed that 4. d4 is not the mainline, and 4. Nc3 is more common. 4. ... Nd4 in response seems to be black's best try, though I think practically speaking that might be because it's uncommon - following a few games and engine lines the positions afterwards are still interesting and promising, although holy hell is the light square bishop bad in these lines. Fortunately, black's dark square bishop looks equally as bad.", "created_utc": "1657833800.0", "edited": "False", "id": "ig6jqs1", "is_submitter": "True", "link_id": "t3_vz1nyu", "parent_id": "t1_ig5sl4d", "score": "1", "subreddit": "chess", "subreddit_id": "t5_2qhr7"}, {"author": "Master-of-Ceremony", "body": "Yes I agree making the d5 push easier is bad, but black actually scores even better in the dxc6 endgames remarkably enough.", "created_utc": "1657832754.0", "edited": "False", "id": "ig6h383", "is_submitter": "True", "link_id": "t3_vz1nyu", "parent_id": "t1_ig6df5d", "score": "1", "subreddit": "chess", "subreddit_id": "t5_2qhr7"}, {"author": "Master-of-Ceremony", "body": "Ah, I completely missed that d4 on move 4 is not the most common move - Be2 seems so passive, but gives better development long term I guess", "created_utc": "1657832685.0", "edited": "1657832995.0", "id": "ig6gwz8", "is_submitter": "True", "link_id": "t3_vz1nyu", "parent_id": "t1_ig5wph6", "score": "2", "subreddit": "chess", "subreddit_id": "t5_2qhr7"}, {"author": "Master-of-Ceremony", "body": "Interesting idea, I assume you're referring to the mainlines with 1. e5 c5 2. Nf3 e6 3. d4 cxd4 4. Nxd4 Nc6 5. Nb5 - which does look quite good. It's tricky to meet 4. ... Nf6 with these with a c4 structure here, but I guess you can't get everything every time.", "created_utc": "1657823723.0", "edited": "False", "id": "ig5tkzf", "is_submitter": "True", "link_id": "t3_vz1nyu", "parent_id": "t1_ig5rb3h", "score": "1", "subreddit": "chess", "subreddit_id": "t5_2qhr7"}, {"author": "Master-of-Ceremony", "body": "Hahaha oops, that's an embarrassing mistake given the content of the post.\n\nI do usually add in something saying \"a native speaker would understand exactly what you meant, but it's more natural to say ...\". I'll probably try to be a bit less pedantic, unless I'm correcting people on advanced exercises.\n\nI think my philosophy has always been that if you aren't getting corrected/making mistakes sometimes, then you aren't really learning as much as you could, so that's why I want to point out even the smallest or errors, though I appreciate that might not be shared and could be discouraging.", "created_utc": "1657819330.0", "edited": "False", "id": "ig5i41s", "is_submitter": "True", "link_id": "t3_vybsab", "parent_id": "t1_ig26txz", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Master-of-Ceremony", "body": "Sure but he was lost in almost half of the games he drew I swear", "created_utc": "1650320191.0", "edited": "False", "id": "i59jw0i", "is_submitter": "False", "link_id": "t3_u4jykx", "parent_id": "t1_i50p4em", "score": "1", "subreddit": "chess", "subreddit_id": "t5_2qhr7"}, {"author": "Master-of-Ceremony", "body": "He didn't regain his 2800 strength IMO, even though he was winning, his games just seemed quite messy even when he was winning (for both him and his opponent, Naka sometimes has that effect) and I think against Fabi, Ding (and maybe Firo), they'll punish the messy play much more than the people at the Grand Prix.", "created_utc": "1650150126.0", "edited": "False", "id": "i50jquj", "is_submitter": "False", "link_id": "t3_u4jykx", "parent_id": "t1_i4z1aan", "score": "0", "subreddit": "chess", "subreddit_id": "t5_2qhr7"}, {"author": "Master-of-Ceremony", "body": "I saw odds on sports.bwin which are, in order:\n\n* Fabi - 2/1\n* Any other player not listed (i.e. Ding) - 2/1\n* Firouzja - 5/2\n* Naka - 12/1\n* Nepo - 16/1\n* Duda - 20/1\n* Rapport - 25/1\n* Radjabov - 33/1\n\nI think I generally agree with this, though I think they've fallen for the Naka hype, and seriously underestimated Rapport, so I'd swap the odds for those two. Other than that, seems reasonable. This list also is pretty close to what the ChessDojo folks (GM Kraii, IM Pruess and IM Kavutskiy) think, so I'd say it's solid.\n\nPersonally, I think Firo is by far the biggest wildcard - he could wipe the floor with the field with some 2950 performance, or come squarely in the middle of the field and be a bit underwhelming. His top level experience is so unknown and we don't know if he was just in some good form recently, or if he's actually even better than his 2800 rating would suggest. (I hope it's the latter, would be incredible to see a 2850 Firo vs 2850 Magnus for the title.\n\nEdit: As an aside, I think any WCC match that isn't Magnus vs. Fabi, Ding, or Firo is basically not worth watching (maybe Rapport if he continue to step us his level). Magnus is literally 100 points stronger than the rest of the field, you just don't win over 14 games with that difference.", "created_utc": "1650149886.0", "edited": "False", "id": "i50j7pv", "is_submitter": "False", "link_id": "t3_u4jykx", "parent_id": "t3_u4jykx", "score": "1", "subreddit": "chess", "subreddit_id": "t5_2qhr7"}, {"author": "Master-of-Ceremony", "body": "Thanks, I’ll look to grab a copy to read over my summer break!", "created_utc": "1648733104.0", "edited": "False", "id": "i2uezla", "is_submitter": "True", "link_id": "t3_tslqpy", "parent_id": "t1_i2tm3gd", "score": "1", "subreddit": "chess", "subreddit_id": "t5_2qhr7"}, {"author": "Master-of-Ceremony", "body": "They’re probably more common than you think! At least when I start noticing tactical themes I see them all the time, until I get a bit stronger and my opponents don’t fall for those as frequently, and I have to learn new ones.", "created_utc": "1648733040.0", "edited": "False", "id": "i2ueumj", "is_submitter": "True", "link_id": "t3_tslljw", "parent_id": "t1_i2tydch", "score": "1", "subreddit": "chess", "subreddit_id": "t5_2qhr7"}, {"author": "Master-of-Ceremony", "body": "Probably just experience, I’ve seen Eric Rosen and ChessNetwork pull off loads of them, but that was when I was a few hundred points weaker that I was regularly watching them, so I think it’s just the eventuality of playing enough chess", "created_utc": "1648732923.0", "edited": "False", "id": "i2ueln2", "is_submitter": "True", "link_id": "t3_tslljw", "parent_id": "t1_i2sjuv6", "score": "1", "subreddit": "chess", "subreddit_id": "t5_2qhr7"}, {"author": "Master-of-Ceremony", "body": "Personally, despite Naka having beat both of them in the first Berlin leg, I think Rapport it playing better chess than Naka. I also think if we don't get to enjoy Shak in the candidates then we at least ought to get someone as interesting as Rapport", "created_utc": "1647224824.0", "edited": "False", "id": "i0kirjy", "is_submitter": "False", "link_id": "t3_t9zut5", "parent_id": "t1_i0khpek", "score": "11", "subreddit": "chess", "subreddit_id": "t5_2qhr7"}, {"author": "Master-of-Ceremony", "body": "Quick youtube search will do you well here", "created_utc": "1647224796.0", "edited": "False", "id": "i0kipl1", "is_submitter": "False", "link_id": "t3_t9zut5", "parent_id": "t1_i0khiqd", "score": "0", "subreddit": "chess", "subreddit_id": "t5_2qhr7"}, {"author": "Master-of-Ceremony", "body": "Source?\n\nNot doubting you, but I have a science background and I'd like to read the paper", "created_utc": "1646955745.0", "edited": "False", "id": "i069n8t", "is_submitter": "True", "link_id": "t3_t9tx2l", "parent_id": "t1_i020xmu", "score": "1", "subreddit": "chess", "subreddit_id": "t5_2qhr7"}, {"author": "Master-of-Ceremony", "body": "Personally I think Firouzja is the best bet, if not this cycle then at the next. He’s playing some of the best classical in the world at the moment, he can just about hang with Magnus in faster time controls, and he’s young enough to still have potential to improve significantly, which no one else in the top 10 does. It’s far from hard to imagine Firouzja getting to 2850 at some point, and that would really put some pressure on Carlson. Plus, Magnus is at the age where he’ll start to decline, although his interest in classical chess has recently picked up again according to interviews, so he might see a small short term improvement", "created_utc": "1646842204.0", "edited": "False", "id": "hzzisao", "is_submitter": "False", "link_id": "t3_t9zjcv", "parent_id": "t3_t9zjcv", "score": "8", "subreddit": "chess", "subreddit_id": "t5_2qhr7"}, {"author": "Master-of-Ceremony", "body": "I think it depends massively on which 1200 you're playing - some are much better at playing up material than others", "created_utc": "1646789426.0", "edited": "False", "id": "hzwzpse", "is_submitter": "True", "link_id": "t3_t9tx2l", "parent_id": "t1_hzwv8ut", "score": "91", "subreddit": "chess", "subreddit_id": "t5_2qhr7"}, {"author": "Master-of-Ceremony", "body": "I love the confidence of club players to think that they can find a move in two seconds when even Naka wasn't going for it immediately.", "created_utc": "1646785560.0", "edited": "False", "id": "hzwr84r", "is_submitter": "True", "link_id": "t3_t9tx2l", "parent_id": "t1_hzwqb5h", "score": "42", "subreddit": "chess", "subreddit_id": "t5_2qhr7"}, {"author": "Master-of-Ceremony", "body": "Hello, thanks for your advice. I was wondering if I could probe your expertise on some of the things you have mentioned.\n\nI have decided to still make as many lines as I was but not memorise most of them until I am much stronger (assuming that happens), which I think should just help me be familiar with the ideas, which I think makes sense. As for depth, most of the lines I make go around 12-15 moves deep or further if they are very forcing, and I try to cover most of the common deviations in masters' databases before move 9ish, depending on the opening. The effort I put into writing ideas down varies on my tiredness, but in general I try to write something like this for each line (this is for one line as white in the Caro, where the deviation occurs for black on 8. ... Bh7)\n\nPGN: 1.e4 c6 2.d4 d5 3.e5 Bf5 4.Nf3 e6 5.Be2 Ne7 6.O-O h6 7.Nbd2 Nd7 8.Nb3 Bh7 9.a4 Ng6 10.a5 Be7 11.c4\n\nComments:  8. ... Bh7  - prepares Ng6 (or Nf5). If Ng6 is played first can allow white to grab space on the kingside á la tempo with h3, Ne1, g4 plans. We continue as usual in these lines grabbing queenside space.\n\n11. c4 - This is our response to most of black's moves after a5. A simple plan here that is often effective involves cxd5, and places the bishops on d3 and d2 (or e3 in some cases), allowing Re1 to support e5 in the event of f6. Given the space advantage (f4 may also be useful at some point) on all sides of the board, we generally want to improve our pieces rather than trading them, as they have greater potential than black's, with the exception of the light-square bishops.\n\nThe comments come from a combination of looking at GM games and what Stockfish suggests. I think this should be worthwhile studying since it will help me think about what ideas are good in these positions, even if I know it is exceedingly unlikely people at my level (including myself) remember all of the moves. What do you think?\n\nI have noticed a marked improvement in the areas where I have studied lines, notably against the french, the caro-kann, the bird (I had it in two consecutive rapid games as black and it was annoying me :P), and in the hyperaccelerated dragon, so I think that it is starting to work.", "created_utc": "1646785425.0", "edited": "False", "id": "hzwqxbi", "is_submitter": "True", "link_id": "t3_spln0d", "parent_id": "t1_hwh2z03", "score": "1", "subreddit": "chess", "subreddit_id": "t5_2qhr7"}, {"author": "Master-of-Ceremony", "body": "Hahaha oops\n\nYeah. I did fuck up tho, but that's a whole other story", "created_utc": "1646784834.0", "edited": "False", "id": "hzwpltr", "is_submitter": "True", "link_id": "t3_t9tx2l", "parent_id": "t1_hzwnq1e", "score": "89", "subreddit": "chess", "subreddit_id": "t5_2qhr7"}, {"author": "Master-of-Ceremony", "body": "Yeah I know that, but that's usually when the king is closer, and a lot of the time it tends to be a bishop rather than a rook trapping the knight. But my point is that I think a lot of GMs would miss that idea - certainly Hikaru was about to go for the wrong capture, but he was able to intuitively realise, despite the knight being on the opposite side of the board, that in this particular case he could herd it towards the side whilst having enough tempi to bring the king in.", "created_utc": "1646783938.0", "edited": "False", "id": "hzwnmch", "is_submitter": "True", "link_id": "t3_t9tx2l", "parent_id": "t1_hzwmmh2", "score": "8", "subreddit": "chess", "subreddit_id": "t5_2qhr7"}, {"author": "Master-of-Ceremony", "body": "Thanks, appreciate it - I thought about (and sometimes do) building it around the lichess db where I filter out so it's only players who are 2200+ and at least rapid time control - it lets me see where my opponents are likely to make mistakes since I'm not going to be playing very many 2400+ players. \n\nSo as a rough guideline, I guess I probably want:\n\n* \\~100 lines each in french, caro-kann\n* 200-300 lines in the sicilian (unless I choose the alapin I guess), and the same for e4 e5\n* \\~100 lines total on the scandi, pirc, alekhine\n* \\~100 lines on weird choices from black i.e. dubious gambits, hedgehog/hippo setups etc.", "created_utc": "1644552143.0", "edited": "False", "id": "hwgnl8f", "is_submitter": "True", "link_id": "t3_spln0d", "parent_id": "t1_hwg653x", "score": "1", "subreddit": "chess", "subreddit_id": "t5_2qhr7"}, {"author": "Master-of-Ceremony", "body": "I have at no point claimed to understand it. In fact I have made quite the opposite assertion in this thread - that I have a philosophically young and naive mind.\nI’m a grad student in physics completing research and trying to learn, working ungodly hours, with a tangential interest in philosophy. I do not have the time nor energy to read for hours on end, when I have spent the day trying to digest concepts that challenge even world experts, the ability of which I can only aspire to.\nBut you on the other hand, simply attack me for my supposedly ill-placed assumptions, rather than explain why they are misunderstood and opaque. In that facet, it is you that perhaps should learn some intellectual humility, for teaching the earnestly curious is what intellectual humility is all about, is it not? Indeed, isn’t part of the purpose of r/askphilosophy to enable laypeople like me to ask those more educated, and save me the effort of trying to understand it fully?\n\nYou see I am at heart a physicist, it is exceedingly obvious to me (or at least intuitive) that the world is deterministic, or in light of quantum mechanics, I might use the term ‘pseudo-deterministic’. And so in a such a world, I do not possibly see how one can have a choice, determinism, from a physics perspective, gives a single path, so clearly there is no choice, and hence free will. Quantum mechanics, as we currently understand, does not improve the standing of free will, though it does complicate the concept of determinism. And so I listened to someone talk about compatibilism, at the end of a long day of work, and the only thing that stuck was some brief comment about changing what is considered free will. Which to me, seemed like a rather cheap cop out? So, perhaps you will reconsider your comments, and given the air of knowledge your comment proclaims, educate me?", "created_utc": "1632094260.0", "edited": "False", "id": "hdiz7l2", "is_submitter": "True", "link_id": "t3_pqczvt", "parent_id": "t1_hdf12cm", "score": "1", "subreddit": "askphilosophy", "subreddit_id": "t5_2sc5r"}, {"author": "Master-of-Ceremony", "body": "I’ve done some reading (or rather podcast listening ) seems like this is mostly a definition debate on what actually constitutes free will I think", "created_utc": "1632015427.0", "edited": "False", "id": "hdep468", "is_submitter": "True", "link_id": "t3_pqczvt", "parent_id": "t1_hdbnany", "score": "-2", "subreddit": "askphilosophy", "subreddit_id": "t5_2sc5r"}, {"author": "Master-of-Ceremony", "body": "I assumed that something an undergrad philosophy student agrees with will likely be something that most professional philosophers can come to terms with, and also that the a deterministic universe is so clearly at arms with free will that any philosopher not believing in a soul or some other non physical power would come to this conclusion (but this all comes from a very philosophically naive mind so I appreciate I know very little)", "created_utc": "1631964269.0", "edited": "False", "id": "hdbirsz", "is_submitter": "True", "link_id": "t3_pqczvt", "parent_id": "t1_hdaasap", "score": "0", "subreddit": "askphilosophy", "subreddit_id": "t5_2sc5r"}, {"author": "Master-of-Ceremony", "body": "I’m at oxford, entering the masters year, there is no research at all included in the course before this point, unless you are to include a “mini-project” in the third year, which is really just a write up of a reasonably complicated experiment. It certainly didn’t seem much like research, probably mainly because it was done online due to covid so it was actually just a case of here’s the data, go analyse it and write it up in the style of a paper\n\nI did do an internship where I essentially did a literature review on technologies used for a very physics related purpose, so there’s that, which perhaps makes up for the lack of a summer project?\nThere was also a finance internship the year prior, but that seems unrelated so I don’t plan to include that", "created_utc": "1631024129.0", "edited": "1631025135.0", "id": "hbxm3a7", "is_submitter": "True", "link_id": "t3_pjd4rz", "parent_id": "t1_hbx55lm", "score": "2", "subreddit": "PhD", "subreddit_id": "t5_2qiyl"}, {"author": "Master-of-Ceremony", "body": "My department sometimes offers research to undergrads during the summer, but otherwise no. Last year they were cancelled due to CoVID. There were a few offered this year, though not as many as usual.\n\nIn the UK the last year of most programs is usually a masters project (it’s included with the Bachelors as an integrated degree) which I would say is where the majority of students first get to properly interact with research. It probably accounts for about half of the work a student does that year or more, and is a lot closer to research level than most summer projects.", "created_utc": "1631005514.0", "edited": "False", "id": "hbwt7du", "is_submitter": "True", "link_id": "t3_pjd4rz", "parent_id": "t1_hbvx1v6", "score": "2", "subreddit": "PhD", "subreddit_id": "t5_2qiyl"}, {"author": "Master-of-Ceremony", "body": "Perhaps the OP is also interested in animal studies? This isn't remotely my area, so I wouldn't know where to begin looking, but it'd be interesting if there was some significant difference", "created_utc": "1630712361.0", "edited": "False", "id": "hbibcq7", "is_submitter": "False", "link_id": "t3_phex49", "parent_id": "t1_hbi8c15", "score": "1", "subreddit": "askscience", "subreddit_id": "t5_2qm4e"}, {"author": "Master-of-Ceremony", "body": "I can't speak for being in the states, but in the UK (or if you're interesting in doing a PhD in the UK) then I would just reach out to relevant professors to see if they are interested in pursuing a PhD with you. Any experimental techniques are usually taught \"on the job\", so to speak.", "created_utc": "1630712226.0", "edited": "False", "id": "hbib366", "is_submitter": "False", "link_id": "t3_phenta", "parent_id": "t3_phenta", "score": "1", "subreddit": "AskPhysics", "subreddit_id": "t5_2sumo"}, {"author": "Master-of-Ceremony", "body": "Perhaps this is easiest to understand with conservation of momentum (this is applying a classical principle to a quantum process, but it's just to give you some intution)\n\nPhotos have energy, E = hf, but special relativity tells us for photon E = pc, so we can actually get a momentum for a photon. Then when the photon is absorbed by an atom, the photon disappears, so it's momentum has to go somewhere. It has only interacted with the atom, so the only logical thing is that the atom gains some momentum, which leads to a small increase in kinetic energy.", "created_utc": "1602095869.0", "edited": "False", "id": "g811izc", "is_submitter": "False", "link_id": "t3_j6uv2i", "parent_id": "t3_j6uv2i", "score": "4", "subreddit": "askscience", "subreddit_id": "t5_2qm4e"}, {"author": "Master-of-Ceremony", "body": "Wrong by the look of it", "created_utc": "1591575098.0", "edited": "False", "id": "ftbiim3", "is_submitter": "False", "link_id": "t3_gynst1", "parent_id": "t3_gynst1", "score": "3", "subreddit": "Physics", "subreddit_id": "t5_2qhi6"}]