[{"author": "MayorOfShampootown", "body": "No, the figure is around 5-6 million speakers of Mongolian, including in China. If you count speakers of Mongolian-related languages such as Buryat, the figure does come to around 10 million.", "created_utc": "1667089333.0", "edited": "False", "id": "iub9jd0", "is_submitter": "False", "link_id": "t3_ygmp3q", "parent_id": "t1_iub7xs5", "score": "2", "subreddit": "duolingo", "subreddit_id": "t5_2t6ze"}, {"author": "MayorOfShampootown", "body": "Want to pop in and say that Mongolian is nowhere close to extinct, with over 5 million speakers - more than the population of countries like Croatia (3.8 million), Georgia (3.7 million), and Lithuania (2.8 million).", "created_utc": "1667061676.0", "edited": "False", "id": "iu9ivjc", "is_submitter": "False", "link_id": "t3_ygmp3q", "parent_id": "t3_ygmp3q", "score": "37", "subreddit": "duolingo", "subreddit_id": "t5_2t6ze"}, {"author": "MayorOfShampootown", "body": "That could certainly be true - but even for the languages that I know (including my native one) I sometimes have to consult a dictionary. Grammar and sentence construction are far more difficult to master than vocabulary, and online translators usually don't do a good job of it. As a result, I think it's reasonable to compliment his writing ability.", "created_utc": "1666702183.0", "edited": "False", "id": "itpsrzh", "is_submitter": "False", "link_id": "t3_ycjnoo", "parent_id": "t1_itpfyhb", "score": "7", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "MayorOfShampootown", "body": "As an English teacher, I agree with u/reign_day - I wouldn’t be able to tell that you’re not a native speaker based on the paragraphs you wrote if you didn’t say so yourself.\n\nI think all language students, not just students of English, can feel inadequate from time to time. I always tell my students that communication is key, and that slight grammar and spelling mistakes usually don’t hurt comprehension in the slightest. My advice - don’t be so hard on yourself, be proud of your progress, and remember that there is always more to learn, even for us native speakers.", "created_utc": "1666643235.0", "edited": "False", "id": "itmv90s", "is_submitter": "False", "link_id": "t3_ycjnoo", "parent_id": "t1_itmnxax", "score": "24", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "MayorOfShampootown", "body": "Foreign guy with Dutch GF, nationality had nothing to do with it, we just get along.", "created_utc": "1664391241.0", "edited": "False", "id": "iq9r6vn", "is_submitter": "False", "link_id": "t3_xqim0q", "parent_id": "t3_xqim0q", "score": "1", "subreddit": "Netherlands", "subreddit_id": "t5_2r0ol"}, {"author": "MayorOfShampootown", "body": "Unless I lived in those countries, I don’t think I would since I currently don’t have a social, academic, or professional need to know those languages.", "created_utc": "1664128578.0", "edited": "False", "id": "ipv7hc5", "is_submitter": "False", "link_id": "t3_xnty9k", "parent_id": "t1_ipv7bkx", "score": "18", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "MayorOfShampootown", "body": "I went to high school on the East Coast of the US - there, I took French and German. As to why those two languages were available, I’m not sure. However, my school also offered Spanish, Italian, Latin, Mandarin Chinese, and American Sign Language. Like most people, I didn’t progress past A2/B1 after 4 years of instruction and promptly forgot it all within a year of starting college.", "created_utc": "1664128412.0", "edited": "False", "id": "ipv715w", "is_submitter": "False", "link_id": "t3_xnty9k", "parent_id": "t3_xnty9k", "score": "144", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}]