[{"author": "meiguoxuesheng", "body": "money", "created_utc": "1666456243.0", "edited": "False", "id": "itcjaet", "is_submitter": "False", "link_id": "t3_ya3h37", "parent_id": "t3_ya3h37", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "meiguoxuesheng", "body": "I think (but not 100% sure) that the vast majority of Chinese learners in Taiwan use either of the two you've mentioned, and I have used several volumes of both. Both are good and differ only slightly in terms of their respective advantages/disadvantages. I remember PAVC books had example sentences for every chapter's list of new vocabulary words, which was helpful. 當代 doesn't, but puts more vocabulary in each lesson which I appreciate. I did think PAVC was a little more simple than it needed to be at times, but it's hard to say because I used PAVC when I was more of a beginner and 當代 when I was at a more intermediate stage. 當代 does have weird passages that are in English for some reason, but they're very ignorable. Also, 當代's audio files are much easier to access since you can download them for free, while the PAVC ones come on a CD.\n\nMy real advice here would be to get a tutor for yourself, even if you only see them once a week. There will be a book they are more familiar with and they will be able to give you advice on this. Regardless, either choice is good.", "created_utc": "1650312620.0", "edited": "False", "id": "i59286b", "is_submitter": "False", "link_id": "t3_u63utb", "parent_id": "t3_u63utb", "score": "1", "subreddit": "taiwan", "subreddit_id": "t5_2qhrg"}, {"author": "meiguoxuesheng", "body": "I just think life will be a lot more interesting and easier for you in a city. As other commenters have mentioned, Pingtung is really the sticks and in Taiwan it's never hard to do a weekend getaway to nature if you want to. I went to NTU which I can vouch for as a solid program, but no the 25k a month wouldn't have been enough for me. I wouldn't say I spent a lot of money on my lifestyle but I wasn't watching every penny either. You can do it, I just don't think you'll live very comfortably, especially in Taipei.\n\n&#x200B;\n\nAs a side note, the scholarship isn't dispersed immediately once you start studying, so you'll have to use your own money for a bit while you wait for it (one month iirc but I can't really remember). A student I knew didn't account for this and life was pretty rough for them budget-wise (they were also living off only the scholarship).", "created_utc": "1649360775.0", "edited": "False", "id": "i3sy9xj", "is_submitter": "False", "link_id": "t3_txnpg3", "parent_id": "t1_i3on961", "score": "1", "subreddit": "taiwan", "subreddit_id": "t5_2qhrg"}, {"author": "meiguoxuesheng", "body": "Assuming this is the Huayu Enrichment Scholarship you're talking about, I'd say go with either 6 or 9 months. After that, your language ability won't increase much from in-class teaching (that being said, you won't be fluent either, it really depends on where you start from, I don't know what \"beginner level 2\" means). I'd also say chose a bigger city over a small place like Pingtung unless you really know what you're doing. Pretty much any city apart from Taipei will have cheap enough housing, although I would expect to not count on just the scholarship for survival, feel free to ask more questions hopefully I can answer.", "created_utc": "1649275310.0", "edited": "False", "id": "i3o5qjf", "is_submitter": "False", "link_id": "t3_txnpg3", "parent_id": "t3_txnpg3", "score": "1", "subreddit": "taiwan", "subreddit_id": "t5_2qhrg"}, {"author": "meiguoxuesheng", "body": "follow me on insta I hate to wear clothes lily\\_sevencoop ;) ;)", "created_utc": "1641828281.0", "edited": "False", "id": "hs2m01q", "is_submitter": "False", "link_id": "t3_s0i882", "parent_id": "t1_hs2l7r3", "score": "-18", "subreddit": "taiwan", "subreddit_id": "t5_2qhrg"}, {"author": "meiguoxuesheng", "body": "yes", "created_utc": "1639678190.0", "edited": "False", "id": "hot4zll", "is_submitter": "False", "link_id": "t3_rh9hqm", "parent_id": "t3_rh9hqm", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "meiguoxuesheng", "body": "cat james corden", "created_utc": "1628349180.0", "edited": "False", "id": "h82a6lm", "is_submitter": "False", "link_id": "t3_oziaez", "parent_id": "t3_oziaez", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "meiguoxuesheng", "body": "This is a good point. On one hand I don't think military shipments couldn't be sent by plane and I don't think China would be willing to shoot one down. Also, if they know the military stuff is getting through anyway they might not comb through each ship's contents, especially if it would affect Taiwanese' livelihoods.\n\nBut I wonder if they would try to impose a sea quarantine anyway. If they do, the US' reason for breaking it would only have to do with FoN; it wouldn't be a problem of getting the military supplies through. This might make the US reluctant to act militarily.\n\nSo now i'm wondering, might Beijing still do a quarantine to achieve greater sovereignty over Taiwan? Would it be viewed as such by the rest of the world? On one hand they would have lined the island with military ships that can decide what comes in or out (at least by sea). On the other hand, they would publicly fail at stopping military equipment from getting into the island, their supposed reason for needing to impose a quarantine in the first place. I feel like a lot here depends on public perception, within China and out, on the the degree to which such a situation can really be described as a victory in asserting sovereignty.", "created_utc": "1622302353.0", "edited": "False", "id": "gzvo68e", "is_submitter": "True", "link_id": "t3_nn3i8l", "parent_id": "t1_gzurult", "score": "1", "subreddit": "neoliberal", "subreddit_id": "t5_2sfn3"}, {"author": "meiguoxuesheng", "body": "Not a study, a policy report [here](https://www.cfr.org/report/united-states-china-and-taiwan-strategy-prevent-war) it is, I referenced p35.\n\nI think the US should break a quarantine if one is imposed but I think that the capacity to do so needs to be credible, at least to China. I don't know how easily this can be achieved, but without it the strategic ambiguity/clarity argument is unnecessary; China won't base their decision to invade Taiwan on the possibility of American intervention if they think any such intervention might not even stand in their way regardless. On the other hand, if this capacity can be built up or if the capacity already exists and can be demonstrated, China will become less likely to try something like a blockade.", "created_utc": "1622301177.0", "edited": "False", "id": "gzvly0w", "is_submitter": "True", "link_id": "t3_nn3i8l", "parent_id": "t1_gztnzng", "score": "2", "subreddit": "neoliberal", "subreddit_id": "t5_2sfn3"}, {"author": "meiguoxuesheng", "body": "The paper I referenced does suggest the possibility of China choosing to invade Taiwan's periphery, but I don't think it's in their interest. Taiwan doesn't realistically have an ability to defend those islands (especially Quemoy, and Quemoy would probably be first) and they know it. If China were to invade, they would take control of landmass that strategically speaking doesn't get them closer to taking control of Formosa and its 20+ million people. Meanwhile, they would still receive all the international condemnation that would come with such a move.", "created_utc": "1622225863.0", "edited": "False", "id": "gzsca0i", "is_submitter": "True", "link_id": "t3_nn3i8l", "parent_id": "t1_gzsay7z", "score": "13", "subreddit": "neoliberal", "subreddit_id": "t5_2sfn3"}, {"author": "meiguoxuesheng", "body": " Yes feel free to pm with questions.\n\nI looked into myroomabroad too, but eventually decided against it because they take your deposit payment in advance and I didn't want to pay in advance for a place I hadn't seen in person in a country I'm not in. Most people I knew here took a week or two in an Airbnb to find a place.\n\nNever been to Kaosiung (regretfully) but I hear nice things about it from everyone except Taiwanese Kaosiungers who've moved to Taipei and think it's too boring lol. Otherwise, people say it's cheaper, more relaxed (although I think Taipei is already a very chill city), the weather is better, and other perks. The air quality is worse than Taipei but we're all wearing masks anyways I suppose. \n\nIf you're worried about learning Chinese in Kaosiung I don't think running into too many people who only speak Taiwanese will be your problem. Chinese skills are much more necessary down there than in Taipei where most people speak decent English, so I think your skills might actually develop faster out of necessity. On the other hand, I don't know anything at all about the quality of Mandarin training programs in Kaosiung, but my guess is they're not too different from Taipei. \n\nHES 1-year recipients can choose to change their school, but I remember there is a limited amount of time they have to change, so look into that if you think you might change. Here's what the policy was when I applied:\n\n\"(4) After the first semester (quarter), ONLY the recipients of **twelve-month** **scholarship** can request a one time transfer to another Mandarin Language Center with permission of the original Mandarin Language Center. Recipients of the 2, 3, 6 or 9-month scholarship are not allowed to apply for a transfer.\"\n\nPersonally, I wouldn't want to move and doing so will incur some expenses, like needing to sign a shorter, more expensive housing contract.\n\nAgain, feel free to ask away with any questions you have. Best of luck", "created_utc": "1613823753.0", "edited": "False", "id": "go43ja3", "is_submitter": "False", "link_id": "t3_lnb252", "parent_id": "t1_go3vsdt", "score": "2", "subreddit": "taiwan", "subreddit_id": "t5_2qhrg"}, {"author": "meiguoxuesheng", "body": "I hate to disappoint but 25K is really not enough for Taipei in my opinion, especially after tuition, although I haven't lived in other Taiwanese cities. I did an HES at taida (which to be fair is more expensive than shida) and I didn't know many people there who were just surviving on their HES, and those I did know seemed to really be struggling. \n\nThe biggest cost living here is rent. When I first got here I found a small room in an apartment with 5 housemates for 9500 nt per month. If you spend more time looking you might be able to find something better, especially if you live in New Taipei, but be prepared to spend a good amount of the 25k on a place that isn't great. [This](https://www.facebook.com/groups/Taiwanapartmentsandroommates) facebook group should give you an idea of what's available. Most foreigners I know here found their place through that group. \n\nThe other major marketplace for renters in [591.com.tw](https://591.com.tw) but it's all in chinese, rentals are all 1 year minimum, and the placements worth looking at are 15k+nt. Other commenters have mentioned Taofangs, but in my opinion those are more expensive for less; they feel very much like long-term hotels (i.e 1 bedroom no kitchen) and really are only good for people who value living alone over anything else.\n\nAs far as other things go, I don't really imagine that Taipei would be much more expensive than other cities, but I would still recommend coming here expecting to use some of your own savings to get by. I can give you details on specific costs of living here, but generally I spend around 35-40,000 nt per month before tuition.\n\nThat being said, Taipei is a really great city with great people and learning chinese is very fun and exciting, definitely worth the extra few thousand you I think you'll need per month. Plus, I might be wrong and 25k is doable for you. If you do choose Taipei or have any questions, let me know :)", "created_utc": "1613744550.0", "edited": "False", "id": "go0ayg1", "is_submitter": "False", "link_id": "t3_lnb252", "parent_id": "t3_lnb252", "score": "4", "subreddit": "taiwan", "subreddit_id": "t5_2qhrg"}, {"author": "meiguoxuesheng", "body": "Thanks for the input, I was just wondering.", "created_utc": "1610467667.0", "edited": "False", "id": "gj0ekpe", "is_submitter": "True", "link_id": "t3_kvu0fz", "parent_id": "t1_gj0bqlr", "score": "5", "subreddit": "personalfinance", "subreddit_id": "t5_2qstm"}, {"author": "meiguoxuesheng", "body": "I studied in Taiwan for a few semesters and would be glad to recommend the program I did, which helped me a lot when I started from scratch. Feel free to dm if you want some more advice on learning/studying, although my chinese is far from perfect.", "created_utc": "1607875808.0", "edited": "False", "id": "gfpizod", "is_submitter": "False", "link_id": "t3_kcbtb4", "parent_id": "t3_kcbtb4", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "meiguoxuesheng", "body": "If you don't know people then no; Taipei is almost entirely closed down the 2-3 days surrounding Lunar New Year's eve, and for most of that week people are back in their home cities/towns. On the other hand, in late february the pingxi lantern festival is unmissable, and lanterns will be lit in Taipei too.", "created_utc": "1606645017.0", "edited": "False", "id": "ge0dui1", "is_submitter": "False", "link_id": "t3_k35uhm", "parent_id": "t3_k35uhm", "score": "2", "subreddit": "taiwan", "subreddit_id": "t5_2qhrg"}, {"author": "meiguoxuesheng", "body": "Then I guess it's just a matter of seeing what taxes I would pay after using the foreign tax credit and/or FIFE (if that's even allowed?) and comparing that to the expected benefits of setting up a Roth IRA.\n\nEither way it looks like I have more research to do.", "created_utc": "1606407752.0", "edited": "False", "id": "gdoazol", "is_submitter": "True", "link_id": "t3_k1gp9n", "parent_id": "t1_gdo68um", "score": "1", "subreddit": "personalfinance", "subreddit_id": "t5_2qstm"}, {"author": "meiguoxuesheng", "body": "Next April will be my first time declaring income earned abroad so no I have not used it before.\n\nI assume that if I do not exclude my salary I can fund a Roth IRA, and that it doesn't matter where the money 'comes from'. Is this correct?", "created_utc": "1606405108.0", "edited": "False", "id": "gdo61b4", "is_submitter": "True", "link_id": "t3_k1gp9n", "parent_id": "t1_gdo2gvz", "score": "1", "subreddit": "personalfinance", "subreddit_id": "t5_2qstm"}, {"author": "meiguoxuesheng", "body": "實用視聽華語第四本，我正在學弟13課哈哈。你在台大學了嗎？多久？", "created_utc": "1599659364.0", "edited": "False", "id": "g4jnoha", "is_submitter": "False", "link_id": "t3_ipb7da", "parent_id": "t3_ipb7da", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "meiguoxuesheng", "body": "Pilot Penmanship Eyedropper", "created_utc": "1585621954.0", "edited": "False", "id": "flzerl8", "is_submitter": "True", "link_id": "t3_fs4pcl", "parent_id": "t3_fs4pcl", "score": "0", "subreddit": "fountainpens", "subreddit_id": "t5_2s0ew"}, {"author": "meiguoxuesheng", "body": "I would assume that as long as there are flights to the States you have to get on one before your visa is up, and that if by the time your visa runs out there aren't any, you can stay until there are", "created_utc": "1584672507.0", "edited": "False", "id": "fkzjjky", "is_submitter": "True", "link_id": "t3_fkppo1", "parent_id": "t1_fky8cyh", "score": "1", "subreddit": "taiwan", "subreddit_id": "t5_2qhrg"}, {"author": "meiguoxuesheng", "body": "the government has addressed this and it is not considered force majeure unless your country is under lockdown (I think germany is since the EU is?)\n\n[https://focustaiwan.tw/society/202003180020](https://focustaiwan.tw/society/202003180020)", "created_utc": "1584538884.0", "edited": "False", "id": "fktzn8b", "is_submitter": "False", "link_id": "t3_fivwph", "parent_id": "t1_fkrea63", "score": "2", "subreddit": "taiwan", "subreddit_id": "t5_2qhrg"}, {"author": "meiguoxuesheng", "body": "I study in NTU CLD with a lot of foreign students and today they asked everyone to fill out information with their visa status, but it was unclear why (language barrier and the people handing out the forms were in such a rush we couldn't really stop to ask them). Hope this doesn't mean they're going to make people leave.", "created_utc": "1584535292.0", "edited": "False", "id": "fktuw69", "is_submitter": "False", "link_id": "t3_fkimtw", "parent_id": "t1_fkt1pdg", "score": "2", "subreddit": "taiwan", "subreddit_id": "t5_2qhrg"}, {"author": "meiguoxuesheng", "body": "你不過在美國學了中文嗎？大概看我寫的字你就可以知道在哪裡我學中文。我看不懂有的你寫的字，可能我需要在中國學。你呢？動不動我寫的？我不過學了六個月了", "created_utc": "1583461574.0", "edited": "False", "id": "fjm4qkl", "is_submitter": "False", "link_id": "t3_fdz9z7", "parent_id": "t1_fjlx41y", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "meiguoxuesheng", "body": "joe mama", "created_utc": "1574667510.0", "edited": "False", "id": "f8o8j03", "is_submitter": "False", "link_id": "t3_dyvyng", "parent_id": "t3_dyvyng", "score": "2", "subreddit": "copypasta", "subreddit_id": "t5_2r6z7"}, {"author": "meiguoxuesheng", "body": "so nice can you give an address? Heping road which number?", "created_utc": "1573893454.0", "edited": "False", "id": "f7nb9ke", "is_submitter": "False", "link_id": "t3_dx47ce", "parent_id": "t3_dx47ce", "score": "4", "subreddit": "taiwan", "subreddit_id": "t5_2qhrg"}, {"author": "meiguoxuesheng", "body": "HES scholarship taiwan, pm for info", "created_utc": "1571669598.0", "edited": "False", "id": "f4loew3", "is_submitter": "True", "link_id": "t3_dkl4xf", "parent_id": "t1_f4hv1lv", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "meiguoxuesheng", "body": "Huayu Enrichment Scholarship, feel free to pm me for more details", "created_utc": "1571669536.0", "edited": "False", "id": "f4lo8nf", "is_submitter": "True", "link_id": "t3_dkl4xf", "parent_id": "t1_f4huw21", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "meiguoxuesheng", "body": "the Taiwanese government runs a scholarship for people who want to go there and study chinese; it's awarding is based mostly on how many people apply to each consulate's office, but I was lucky", "created_utc": "1571591060.0", "edited": "False", "id": "f4hfsy2", "is_submitter": "True", "link_id": "t3_dkl4xf", "parent_id": "t1_f4hdudx", "score": "56", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "meiguoxuesheng", "body": "ok I see thanks for the help :)", "created_utc": "1571590957.0", "edited": "False", "id": "f4hfifj", "is_submitter": "True", "link_id": "t3_dkl4xf", "parent_id": "t1_f4hecun", "score": "12", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "meiguoxuesheng", "body": "I'm studying it full time so luckily I can make it my primary focus, feels really nice to be able to treat it as a main goal rather than a side hobby", "created_utc": "1571590429.0", "edited": "False", "id": "f4hddcw", "is_submitter": "True", "link_id": "t3_dkl4xf", "parent_id": "t1_f4hbc0d", "score": "47", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "meiguoxuesheng", "body": "Thanks! with 我常還累 I was trying to say \"I am often still tired\" but the grammar might be more difficult than I thought lol\n\nAlso I think trad. characters are kind of easier to learn than simplified; they look more distinct from each other which makes memorization easier imo", "created_utc": "1571590312.0", "edited": "False", "id": "f4hd197", "is_submitter": "True", "link_id": "t3_dkl4xf", "parent_id": "t1_f4haxca", "score": "44", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "meiguoxuesheng", "body": "thanks :) and yeah I know I do struggle to make the radicals compact as they should be, planning on staying until June", "created_utc": "1571587036.0", "edited": "False", "id": "f4h123n", "is_submitter": "True", "link_id": "t3_dkl4xf", "parent_id": "t1_f4h0mn6", "score": "96", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "meiguoxuesheng", "body": "What quality do you feel your Chinese is now? Would you say you were a good student?\n\nIf you feel that MTC was only ok, would you have a different language center to recommend? Taipei looks really nice but learning is really the priority for me.\n\n&#x200B;\n\nSome questions about the application:\n\n\\-It asks for my highest diploma. I am about to graduate college, but would they still want my high school diploma instead of the college one? Probably best to ask them but if you have any insight I appreciate it.\n\n\\-Do you need to already have been accepted to a language center before applying, or do you simply include a copy of your application (to MTC, for instance) in your scholarship application?\n\n&#x200B;\n\nThanks", "created_utc": "1552500504.0", "edited": "False", "id": "eig3loi", "is_submitter": "True", "link_id": "t3_b0h1ei", "parent_id": "t1_eif28xf", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}]