[{"author": "mid83", "body": "So I don’t need to bother with the Weis/Hickman stuff after Summer Flame?", "created_utc": "1661377022.0", "edited": "False", "id": "ilnfea6", "is_submitter": "True", "link_id": "t3_wwrfd1", "parent_id": "t1_ilmqogj", "score": "2", "subreddit": "dragonlance", "subreddit_id": "t5_2tegr"}, {"author": "mid83", "body": "I initially tried to learn every bit of a chapter in a textbook before moving on and soon learned that is a quick path to burnout. \n\nFor me, I still am going through an intro textbook but I’m being more casual about it. I’m exposing myself to the vocabulary and grammar concepts, I’ll do the exercises and I move on. I’d rather come back and revise a chapter in a month. I’ll also add that exposing yourself to more content helps solidify all of these vocabulary words and grammar concepts as well. \n\nAlso, given that you are native in French, you might want to look at Assimil. If you liked the initial Assimil course, you could pick up the advanced Assimil Spanish course afterwards since it’s written in French.", "created_utc": "1661138508.0", "edited": "False", "id": "il9zv34", "is_submitter": "False", "link_id": "t3_wu8u9l", "parent_id": "t3_wu8u9l", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "mid83", "body": "Like others said, Spanish has a huge influence on the United States, especially in states with large hispanic populations like Texas, California, Arizona, Florida, New Mexico and so on. I live in Texas and there is hardly a day that goes by where I don't hear a Spanish conversation in passing at work or wherever I'm going in public (the store, the movie theatre, the zoo, a sporting event). I also believe the US has the 2nd most Spanish speakers in the world behind Mexico.\n\nI don't think there is any sort of agenda or conspiracy that pushes Spanish in regards to foreign language acquisition, it just makes the most sense in many parts of the US.", "created_utc": "1660797278.0", "edited": "False", "id": "ikr82g0", "is_submitter": "False", "link_id": "t3_wr8fpm", "parent_id": "t3_wr8fpm", "score": "26", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "mid83", "body": "You plan thus far seems great. Ten words a day is definitely doable in many cases, but of course all that matters is how it is working for you. \n\nAnother person mentioned this, but I wanted to reiterate that you want to give yourself a couple weeks before you start making adjustments to the number of new words count. The reason is because after a couple weeks, you will get an idea of about how many reviews a day you will need to do. It can be tempting to just increase to 15 words a day a few days into things if it seems like 10 is working fine, and maybe even 20 soon after that, but you might find yourself overwhelmed with reviews after a couple weeks of doing that. \n\nSo I'd keep it at 10, do a couple weeks and see how you feel about both learning that many new cards a day and how many reviews you are doing a day. If you think you can bump it to 15, then do so and reassess after a couple weeks again. If it gets overwhelming, then drop back down.", "created_utc": "1660790563.0", "edited": "False", "id": "ikqv7b3", "is_submitter": "False", "link_id": "t3_wr6vkn", "parent_id": "t3_wr6vkn", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "mid83", "body": "I just started incorporating some comprehensible output into my learning and I can already tell how useful it is. Most of my work thus far has been via apps like Duolingo and using formal course textbooks. I'm finding reading and listening really helps iron out those grammar concepts that I've gotten exposure to and also is helping make some of the vocabulary I've tried to just memorize via Anki stick. \n\nI think it works excellent alongside going through a textbook and I highly recommend it for people looking for a way to improve listening and reading comprehension skills. \n\nI'll also note that I think it works well for me thus far because I don't study my textbook as intensive as others do. I will read through it and do most of the exercises but I don't worry about having to memorize all the new vocab and grammar structures. I just move on. Coming across these structures and vocab in the wild is so helpful in not only helping solidify the grammar or vocab in my mind but also making reading seem less overwhelming.", "created_utc": "1660789635.0", "edited": "False", "id": "ikqt7nm", "is_submitter": "False", "link_id": "t3_wr5pl3", "parent_id": "t1_ikqqjy9", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "mid83", "body": "No problem! I hope it can provide some help. \n\nOn the Italki thing, if you click on a tutor there is a contact teacher button. \n\nI would think about what you want to get out of lessons (ie. focusing on speaking or maybe more structured lessons along with speaking practice) and then express those wishes to a prospective instructor. I also found that when you search for instructors you can search for keywords like \"textbook\" or \"structured lessons\" which I believe is based on whatever info the tutor puts in on their bio page. Using that could help your find tutors that will hopefully meet your goals. I'd be pretty specific too. Let them know if you want \"homework\" in between sessions. Another idea can be having the tutor send you some material to discuss in the next session so you have some time to review and prepare which can help when you are speaking about a topic. \n\nIf the tutor doesn't contact you or does but isn't very responsive to your needs, then I'd look elsewhere. \n\nI would imagine if you can find a tutor that fits what you are looking for and is willing to structure sessions around your wishes and goals, you will start feeling yourself making progress.", "created_utc": "1660789083.0", "edited": "False", "id": "ikqs0b7", "is_submitter": "False", "link_id": "t3_wr5pl3", "parent_id": "t1_ikqo4n8", "score": "6", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "mid83", "body": "First and foremost I think the most important thing is that you don't need to beat yourself up. Language learning is a very long and difficult process with many highs and lows. I can understand the frustration given that I've been attempting to learn Spanish off and on for years now and I'm just now progressing out of beginner level content. It's easy to beat yourself up (I've done it plenty of times too) but it doesn't really serve us any good in the long run. You have nothing to be ashamed of! Anybody who claims language learning is easy is lying.\n\nIt might be a good idea to sit down and think about a few things. First, why do you want to learn Spanish? Keeping in in mind why you started this journey could help spur a little motivation and positive thinking. \n\nSecond, what do you enjoy doing on a day to day basic in your native language? Do you enjoy reading, listening to music or podcasts, watching TV series or movies? If you have a specific preference in one area then maybe look into adding something into your language learning plan that takes advantage of that interest. If it's reading, then look into something like Lingq or similar tools that focus on reading (they can also help with listening as well). If it's TV/movies, there are add ons for you can use that provide tools to help you learn via content on Netflix and other streaming services. These things don't need to be the only way you learn, but after doing more \"boring\" stuff some reading or watching can be much more fun and motivating to keep you going.\n\nThird, what are your goals with Spanish? Do you want to focus on being about read or watch TV/movies in Spanish? Do you want to be able to speak with Spanish speakers? Do you want to visit or live in a Spanish speaking country? These goals can also help you tailor what you need to do to get to a place with Spanish that you want. From your comment it sounds like you put a strong focus on speaking. If that's the case, then you may want to look into iTalki again but instead focus in on finding a tutor that will work with you on your speaking skills. I would email tutors you are interested in and let them know how you are feeling, what your goals are (ie. improving your speaking) and letting them know this is what you want to focus on. \n\nAt the end of the day, keep it up. Have don't have any reason to be ashamed or angry with yourself. Language learning is hard and keeping going despite the struggles are something you should be proud of, not ashamed of. Keep your head up. You will get there!", "created_utc": "1660786900.0", "edited": "False", "id": "ikqn4ba", "is_submitter": "False", "link_id": "t3_wr5pl3", "parent_id": "t3_wr5pl3", "score": "11", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "mid83", "body": "I think people get far too hung up on trying to find out which method is the best. The simple fact is that there is no perfect method. If you speak to 10 successful learners of a foreign langauge you will likely find 10 different methods that were used to achieve fluency. The only thing that I think is universal across the board is time spent with the langauge. How you spend that time is a combination of personal interests and what your goals are with the langauge (reading vs speaking etc...). So the best method is really doing something that is interesting and enjoyable enough to keep engaged and putting in enough time with the langauge.", "created_utc": "1660785000.0", "edited": "1660790625.0", "id": "ikqirln", "is_submitter": "False", "link_id": "t3_wr082k", "parent_id": "t3_wr082k", "score": "9", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "mid83", "body": "To be honest it's pretty much unusable for free. I think you get 20 Lingqs, which means 20 words you don't know before you have to pay. I also don't believe they offer a trial trial.\n\nIt sounds like the best option is to just sign up for a month and see how you like it. You can then opt for a longer sub at that time if you like. It seems like fans of Lingq really get a ton of use out of it so it's probably worth a look if extensive reading is helping you a lot.", "created_utc": "1660709135.0", "edited": "False", "id": "ikm59bf", "is_submitter": "False", "link_id": "t3_wq8zuo", "parent_id": "t1_ikm4e7m", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "mid83", "body": "It sounds like Lingq is a good option in this case. I've been looking into it myself and it seems like once you work through some content (and use their system for marking words as known or marking them as \"lingqs\"), it becomes pretty easy to find stuff that fits into the comprehensible input idea of finding content just is just slightly difficult for you. The app will tell you what percent of words are new in a specific text, and per some videos I watched, it sounds like the goal is to find content with less than 20% new words. There is a lot of content in their library rating as Beginner 1, Beginner 2, Intermediate 1 etc... so it shouldn't be too difficult to find content at your level once you get going for a bit. Plus, you can also work on listening since I believe a lot of their library content allows you to listen alongside reading. \n\nYou can also upload all sorts of things (books, articles, podcasts + transcripts etc..) to read via their software. Do keep in mind that Lingq is somewhat controversial in that it's not super cheap and apparently canceling is a pain since they require you to remove all the content you uploaded. I haven't personally used it yet but I'm eyeing it once I get through the current A1 materials I'm working through. \n\nLike others said, if speaking and writing are important you will need to find a way to practice those as well. Tutors are probably a good option here, especially for speaking.", "created_utc": "1660707499.0", "edited": "False", "id": "ikm2911", "is_submitter": "False", "link_id": "t3_wq8zuo", "parent_id": "t3_wq8zuo", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "mid83", "body": "I absolutely agree. The way that learning a new language opens up an entire culture to you is what has kept my interest in language learning. There are aspects of a culture that just are not the same via translation or via another language like English.", "created_utc": "1660706202.0", "edited": "False", "id": "iklzp1m", "is_submitter": "False", "link_id": "t3_wqct19", "parent_id": "t3_wqct19", "score": "8", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "mid83", "body": "My mom didn't start learning English until her early 30s when she started taking English classes at a language school in Spain. She has now been fluent in both Spanish and English for over 40 years. \n\nNo reason to expect you can't learn a language after 25, if so, then i'm screwed because I'm nearly 40 and working on Spanish now.", "created_utc": "1660364886.0", "edited": "False", "id": "ik39vbu", "is_submitter": "False", "link_id": "t3_wmqosz", "parent_id": "t3_wmqosz", "score": "4", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "mid83", "body": "I’m referring more to accent. I’ve always wanted to learn vosotros no matter what, but I don’t intend to use it intentionally other than with my mom and my family in Spain (I have cousins studying Spanish and we want to start doing langauge exchanges over WhatsApp).", "created_utc": "1660315288.0", "edited": "False", "id": "ik00ujw", "is_submitter": "True", "link_id": "t3_wmh1me", "parent_id": "t1_ijzxy6g", "score": "2", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "mid83", "body": "I’ve seen it mentioned before on this subreddit regarding the Castilian accent. \n\nI also have a Spanish speaking friend who said they have some extended family members in Central America who despise the Castilian accent and consider it arrogant and elitist.", "created_utc": "1660315011.0", "edited": "False", "id": "ik005uf", "is_submitter": "True", "link_id": "t3_wmh1me", "parent_id": "t1_ijzqpgf", "score": "2", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "mid83", "body": "I’ve seen it mentioned before on this subreddit regarding the Castilian accent. \n\nI also have a Spanish speaking friend who said they have some extended family members in Central America who despise the Castilian accent and consider it arrogant and elitist.", "created_utc": "1660314998.0", "edited": "False", "id": "ik004qc", "is_submitter": "True", "link_id": "t3_wmh1me", "parent_id": "t1_ijzxems", "score": "9", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "mid83", "body": "I was doing some testing out that morning and I noticed at one point the option was gone. It’s still on my iPad for now. I don’t have pro, but I use a classroom to get rid of the hearts limit. I tried with and without a classroom and nothing changed. I deleted and reinstalled the app. The same. \n\nI wonder if this is an A/B testing thing.", "created_utc": "1660238253.0", "edited": "False", "id": "ijvqree", "is_submitter": "True", "link_id": "t3_wgok8i", "parent_id": "t1_ijsa6v9", "score": "1", "subreddit": "duolingo", "subreddit_id": "t5_2t6ze"}, {"author": "mid83", "body": "I think we should always be cautious about promises that sound too good to be true. While I think immersion, especially at later stages in the learning process, is a great tool, too many people seem to have somehow taken away that immersion alone with minimal active studying will lead to fluency. I also think it's important to be cautious about any language learning method or tool that promises the world while casting stones at other methods and learning materials.\n\nLike others have said here, everybody is different and it likely takes a mixture of tools and methods to get to a \"fluent\" level in your language. Also, no matter what you choose to use, it's going to take work. It's not going to be as easy as just watching TV all day in your target language or doing Duolingo for 15 minutes a day.", "created_utc": "1660105409.0", "edited": "False", "id": "ijoetxr", "is_submitter": "False", "link_id": "t3_wkfu92", "parent_id": "t3_wkfu92", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "mid83", "body": "Like others have said, the Practice Makes Perfect series is more of a series of grammar books vs a full textbook would should have audio (if it's a good textbook in my opinion). \n\nIf you are interested in textbooks, there are basically two variations, bilingual textbooks, and monolingual textbooks.\n\nBilingual textbooks are ones that teach you the language in English or whatever your native language is. Some good series that teach various languages in English include Teach Yourself, Colloquial, and Assimil (this is actually a French company so the majority of their books are French based but they have around a dozen of so languages that they teach from English). These books have audio as part of the course and teach the language in a systematic way. The downside is that none of these books really go over material above around an intermediate level. \n\nMonolingual textbooks are ones that are written in the language that is being taught, so French textbooks are written in French, Spanish textbooks are written in Spanish and so on. In the case of French, you will find numerous French publishers that publish these textbooks. Monolingual textbooks are often used in language schools. The advantage is many of these courses are CEFR based and are part of a full program that teaches you material from A1 up to anywhere from B2 to C2. You can find textbooks that teach more advanced material than what you find with Teach Yourself or similar style bilingual courses. If you prefer a more structured curriculum in your language learning, monolingual textbooks can be excellent for that. \n\nThe disadvantage is that these books are typically written for classroom use, so some books are not great for self studying as the textbooks themselves might not provide as much information as you would expect since you are intended to get additional information/explanations from an instructor. Also, many activities in these textbooks are intended for groups or the entire class, which again  can be a negative for self study. The other disadvantage is the fact that since these books are monolingual, it can be tough for beginners. It's not impossible to learn from these at the beginning, you just need some extra time to use a dictionary or translator to help with instructions and grammar explanations. The other option would be to use something like Teach Yourself first, and then maybe jump into a monolingual series. \n\nIf you do look for a monolingual series, I would ask for French specific recs here on Reddit. There may be a series or two that is highly regarded. If not, you can look at a store like [Europeanbookshop.com](https://Europeanbookshop.com), sort by French, and they should have a wide range of courses to look into. I would look a the publisher's website, and you should be able to download a sample of the book's material (I would avoid any text that doesn't offer a free sample) and ensure that the book has enough material that can you self study with. Also these books often have supplementary exercise manuals with solutions in the back, which are very valuable for self learners. Try to avoid books that are too vague or have a huge amount of group content vs individual material. Also, ensure the audio is available via online download or CD with a copy of the book. If you pick a series with 4-6 textbooks, you could use the same series to learn material all the way up to B2-C2 depending on the series. That's why i think monolingual textbooks are worth a look if you prefer textbooks.\n\nFinally, even if you choose a textbook as a way to structure your curriculum, be sure you are incorporating a lot of native content along with your textbook studying, and finding a way to get speaking practice in (via meetups, italki lessons, language exchanges etc..)", "created_utc": "1659670868.0", "edited": "False", "id": "ij0d0xr", "is_submitter": "False", "link_id": "t3_wg7841", "parent_id": "t3_wg7841", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "mid83", "body": "I’m a native English speaker with two college degrees and I am a frequent reader. I regularly come across words I have never seen before. So I’d argue that langauge learning, even your own native language, is a lifelong pursuit.", "created_utc": "1659588140.0", "edited": "False", "id": "iivl5ir", "is_submitter": "False", "link_id": "t3_wf9gj6", "parent_id": "t3_wf9gj6", "score": "4", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "mid83", "body": "I imagine RB and even Merc through Williams would jump at the chance to get Piastri if they could. WCW potential drivers don't come around often, and given he's basically a free agent right now (assuming that Alpine doesn't win a court battle to force him to drive for Alpine in 2023 or a Mclaren official announcement is imminent), most teams are going to take a look. I wouldn't even rule out Ferrari trying making a move via Haas, but that seems the most unlikely to me. \n\nUntil something official and iron clad is released regarding Piastri's 2023 seat, anything is possible.", "created_utc": "1659504856.0", "edited": "False", "id": "iiqwfe4", "is_submitter": "False", "link_id": "t3_weukje", "parent_id": "t3_weukje", "score": "1", "subreddit": "formula1", "subreddit_id": "t5_2qimj"}, {"author": "mid83", "body": "I think they should have canned Ocon and given Piastri his seat this year and just ran him and Alonso until he's ready to retire. Of course it sounds like Alpine practically requires a French driver to make leadership happy, so I guess that wasn't an option.  They put themselves into this position the moment they signed a former champion like Alonso while also committing to Ocon long term.", "created_utc": "1659503198.0", "edited": "False", "id": "iiqtuvw", "is_submitter": "False", "link_id": "t3_weuqwu", "parent_id": "t1_iiqt1b2", "score": "8", "subreddit": "formula1", "subreddit_id": "t5_2qimj"}, {"author": "mid83", "body": "I mean it’s gotta be tough to manage given how limited F1 seats are overall. \n\nLike others said, ideally Alpine gets another team to stick promising youth drivers in but that seems pretty much impossible right now.", "created_utc": "1659495038.0", "edited": "False", "id": "iiqelgq", "is_submitter": "False", "link_id": "t3_weuqwu", "parent_id": "t3_weuqwu", "score": "111", "subreddit": "formula1", "subreddit_id": "t5_2qimj"}, {"author": "mid83", "body": "I honestly agree that Duolingo is about 75-80% ineffective. One thing that does help is using the website and forcing yourself to type sentences without being able to pick from a selection of words. \n\nI also find that it works better way to drill and review stuff I already have seen vs learning new stuff as I also tend to zone out with lower level exercises. \n\nI have to say the Spanish course is nice and long but it probably takes way too long to finish. It’s far too inefficient as a primary resource outside of just starting out in my opinion.", "created_utc": "1659494570.0", "edited": "False", "id": "iiqdlae", "is_submitter": "False", "link_id": "t3_wetfq5", "parent_id": "t3_wetfq5", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "mid83", "body": "With Mclaren seemingly on the receiving end of both drivers (not confirmed yet with Piastri of course).", "created_utc": "1659488764.0", "edited": "False", "id": "iiq0opd", "is_submitter": "False", "link_id": "t3_weskxq", "parent_id": "t1_iiq0g6i", "score": "1", "subreddit": "formula1", "subreddit_id": "t5_2qimj"}, {"author": "mid83", "body": "I'd have to imagine he already has a plan in place to go scorched earth like that. Mclaren seems like the obvious choice, but who knows. \n\nEither that, or he has a crew of idiots advising him.", "created_utc": "1659484345.0", "edited": "False", "id": "iipqn9a", "is_submitter": "False", "link_id": "t3_weiili", "parent_id": "t1_iipqb9z", "score": "1", "subreddit": "formula1", "subreddit_id": "t5_2qimj"}, {"author": "mid83", "body": "I'm probably older than the average here (39) but I see it both ways. On one hand, I understand the issue people have with Piastri burning his bridges with Alpine, especially given that he's never even driven in F1 yet. It's a pretty ballsy move in a sport where seats are very hard to come. by, especially if you aren't a pay driver. I see how it paints Piastri in a bad light.\n\nAt the same time, I can also understand why Piastri said what he said. Apparently Alpine released this statement without any sort of confirmation on his end (I bet it's likely Piastri told them he was going elsewhere and they released it anyways). Very similar to the Palou Indycar situation where CGR (Palou's current team) apparently made up a quote from Palou regarding driving for CGR in 2023 in their official announcement that Palou challenged.  I remember seeing it mentioned in the aftermath of the Palou situation that this sort of thing isn't unheard of for racing teams (ie. making up quotes etc..), and if that is true, I can understand where drivers want to push back.", "created_utc": "1659484079.0", "edited": "False", "id": "iipq10z", "is_submitter": "False", "link_id": "t3_weiili", "parent_id": "t1_iiphcts", "score": "1", "subreddit": "formula1", "subreddit_id": "t5_2qimj"}, {"author": "mid83", "body": "I'll be honest, I don't know why Alpine didn't just plan to drop Ocon and sit Piastri next to Alonso for a couple years.", "created_utc": "1659483506.0", "edited": "False", "id": "iipopqu", "is_submitter": "False", "link_id": "t3_weiili", "parent_id": "t3_weiili", "score": "3", "subreddit": "formula1", "subreddit_id": "t5_2qimj"}, {"author": "mid83", "body": "I've seen some people saying they think Lewis is retiring and Piastri is going to Mercedes.", "created_utc": "1659466926.0", "edited": "False", "id": "iioifma", "is_submitter": "False", "link_id": "t3_weiili", "parent_id": "t1_iioh8k8", "score": "2", "subreddit": "formula1", "subreddit_id": "t5_2qimj"}, {"author": "mid83", "body": "For all we know Piastri might have told them he was signing with Mclaren and Alpine responded with this announcement to either strong arm him or just getting the legal process rolling.", "created_utc": "1659465500.0", "edited": "False", "id": "iioer1s", "is_submitter": "False", "link_id": "t3_weiili", "parent_id": "t1_iiod703", "score": "8", "subreddit": "formula1", "subreddit_id": "t5_2qimj"}, {"author": "mid83", "body": "This is pretty much exactly how the Alex Palou situation went down recently in Indycar between Chip Ganassi Racing and Mclaren. CGR has since filed a lawsuit and continue to say Palou is contracted to them in 2023. \n\nI imagine we will see something very similar from Alpine regarding Piastri in the coming days and weeks. For all we know they may be looking to emulate how PCR has handled this given they are seemingly in the exact same situation, with Mclaren being the opposing party in both cases.\n\nSo I don't necessarily think this is a \"blunder\" for Alpine. A horrible look for them of course, but it could be a strategy given they feel that legally, Piastri is their driver.", "created_utc": "1659465258.0", "edited": "False", "id": "iioe3md", "is_submitter": "False", "link_id": "t3_weiili", "parent_id": "t1_iioavqh", "score": "52", "subreddit": "formula1", "subreddit_id": "t5_2qimj"}, {"author": "mid83", "body": "You have to wonder if he was prepared for this by Mclaren after seeing how the Alex Palou situation went down.", "created_utc": "1659464424.0", "edited": "False", "id": "iiobujx", "is_submitter": "False", "link_id": "t3_weiili", "parent_id": "t1_iiobj0m", "score": "2", "subreddit": "formula1", "subreddit_id": "t5_2qimj"}, {"author": "mid83", "body": "I'd have to assume a deal with Mclaren is done for him to do that.", "created_utc": "1659464270.0", "edited": "False", "id": "iiobfpr", "is_submitter": "False", "link_id": "t3_weiili", "parent_id": "t1_iiob978", "score": "1", "subreddit": "formula1", "subreddit_id": "t5_2qimj"}, {"author": "mid83", "body": "That Piastri tweet sure makes both cases seem pretty much identical. Crazy times.", "created_utc": "1659464198.0", "edited": "False", "id": "iiob8qt", "is_submitter": "False", "link_id": "t3_weft3g", "parent_id": "t1_iioa17i", "score": "2", "subreddit": "formula1", "subreddit_id": "t5_2qimj"}, {"author": "mid83", "body": "I know, that's why I find so fascinating about this.", "created_utc": "1659464152.0", "edited": "False", "id": "iiob4ax", "is_submitter": "False", "link_id": "t3_weiili", "parent_id": "t1_iioal2d", "score": "4", "subreddit": "formula1", "subreddit_id": "t5_2qimj"}, {"author": "mid83", "body": "Holy crap, this is just like the Alex Palou situation in Indycar.\n\nThis is going to be fun!", "created_utc": "1659463741.0", "edited": "False", "id": "iioa10l", "is_submitter": "False", "link_id": "t3_weiili", "parent_id": "t3_weiili", "score": "14", "subreddit": "formula1", "subreddit_id": "t5_2qimj"}, {"author": "mid83", "body": "I wonder if this is going to turn into something like the Alex Palou situation in Indycar. \n\nJust some quick background, Palou, who was the 2021 Indycar champion, was in talks with joining Mclaren in 2023 (they have an Indycar team as well). His current team, Chip Ganassi Racing then announced that Palou would be driving for them in 2023 along with a quote from him. Palou disputed the report and the quote (basically said CGR made it up), and also said he had already informed CGR he was leaving. McLaren then announced Palou would be joining in 2023. Palou's current team has filed a lawsuit against him over the situation.\n\nThe fact that Piastri has been silent does make you wonder. It's also interesting that Mclaren is involved in both of these situations.", "created_utc": "1659463242.0", "edited": "False", "id": "iio8oxi", "is_submitter": "False", "link_id": "t3_weft3g", "parent_id": "t3_weft3g", "score": "3", "subreddit": "formula1", "subreddit_id": "t5_2qimj"}, {"author": "mid83", "body": "Congrats! I admire the dedication and it really makes me realize how much further I have to go (I am not even done with Unit 3 in Spanish). \n\nI'm curious, how would you rate your German now that you have completed the entire course?", "created_utc": "1659186285.0", "edited": "False", "id": "ii956zf", "is_submitter": "False", "link_id": "t3_wbekei", "parent_id": "t3_wbekei", "score": "1", "subreddit": "duolingo", "subreddit_id": "t5_2t6ze"}, {"author": "mid83", "body": "My primary goal is to get Spanish to a fluent level. For starters, my entire reason for starting to study Spanish is to open up the opportunity to get to communicate better with Spanish speaking only family. My secondary goal is to prove to myself I can actually do after several failed attempts to learn Spanish over the past 5-6 years. Of course Spanish will be a lifelong journey for me (just like any other foreign language would be).\n\nIn a perfect world, I would also like to learn German, French, and Italian. If I ever decided to tackle a language far different than English, it would likely be Japanese, but I'd honestly be surprised if I ever take on that challenge. \n\nMore realistically, just getting Spanish to a C1 level would make me feel accomplished and happy. Any other language would just be a bonus.", "created_utc": "1659145228.0", "edited": "False", "id": "ii7fj0p", "is_submitter": "False", "link_id": "t3_wbj8lz", "parent_id": "t3_wbj8lz", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "mid83", "body": "Thanks for the recommendation! This looks to come from the frequency dictionary I bought a while ago with the intention of making my own deck. Of course that didn't happen!\n\nI am going to check this one out. How many new words a day do you do?", "created_utc": "1658949667.0", "edited": "False", "id": "ihw3v12", "is_submitter": "True", "link_id": "t3_w96avo", "parent_id": "t1_ihw1ll2", "score": "2", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "mid83", "body": "Passionate without question. Language learning is a years long, if not life long, journey. It’s a slow marathon filled with road blocks that can frustrate you. You are going to have to spend thousands of hours with the language to achieve an advanced level. A language having daily utility isn’t going to be enough to help get your through those hurdles. Being passionate about a language can. \n\nI’ve had about 3-4 false starts with Spanish. I’ve had to restart each time, relearning basics and it’s a hit to your confidence to try and fail like that. Being passionate about Spanish, which is directly related to both my own heritage and my wife’s background as a native Spanish speaker, is what keeps me coming back to try again. If I was only learning Spanish for it’s utility (I live in a majority Hispanic state and work around Spanish only speakers quite often..so a lot of utility for me), I would have quit a long time ago for good.", "created_utc": "1658901326.0", "edited": "False", "id": "ihth1aw", "is_submitter": "False", "link_id": "t3_w8y0tx", "parent_id": "t3_w8y0tx", "score": "6", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "mid83", "body": "I don’t disagree about Duolingo. I keep it installed for those times I have a few minutes to waste but don’t have time to sit down and study. \n\nI’m curious, what changes did you make to your study plan once you moved away from Duolingo and how have you progressed?", "created_utc": "1658900401.0", "edited": "False", "id": "ihtfnws", "is_submitter": "False", "link_id": "t3_w969vp", "parent_id": "t3_w969vp", "score": "12", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "mid83", "body": "Most of it mindset to be perfectly honest. In the past I got sucked into the idea of finding a shortcut or optimal learning method, which means I was constantly switching from resource to resource and making no progress. I'd get frustrated and quit.\n\nI finally realized that there is no perfect method. We are all different learners and you have to find what works for you. For me, I tend to prefer more traditional learning resources like textbooks, and this time around, I'm focusing on making slow but steady progress. Right now I'm working through Teach Yourself Complete Spanish and at some point soon I'm going to start Assimil as well. I listen to a couple learners podcasts in the car (mostly Coffee Break Spanish) for reinforcement. I use Anki a little bit, but I not to the extent of many here. \n\nThat's my plan and I'm focusing on working through those resources. I don't worry if somebody else says another book is better or textbooks are a waste of time or whatever else. I just chip away each and every day and I'm already seeing more progress than ever before. I try for an hour a day. Some days are more, some are just 15 minutes, but I try to do at least a little bit each day.\n\nI also am setting small goals for myself. I started the Teach Yourself book initially several years ago. My first goal was to get past where I made to the first time, which I recently achieved and it was a great feeling. Now I'm focusing on slowly but surely working through the rest of the book.", "created_utc": "1658808342.0", "edited": "False", "id": "iho90zs", "is_submitter": "False", "link_id": "t3_w821wt", "parent_id": "t1_iho6hob", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "mid83", "body": "Congrats! How far are you progressing in each skill?", "created_utc": "1658802793.0", "edited": "False", "id": "ihnxw9l", "is_submitter": "False", "link_id": "t3_w7zhyu", "parent_id": "t3_w7zhyu", "score": "2", "subreddit": "duolingo", "subreddit_id": "t5_2t6ze"}, {"author": "mid83", "body": "I've had at least 3 false starts with Spanish over the past five years. I count those because I completely quit for anywhere from 6 months to over 2 years each time. A couple of those were due to life getting pretty chaotic and unfortunately language learning wasn't enough of a habit for me to keep it going. I also think I was unsuccessful due to not really knowing how to study in a way that works for me and instead spending most of my time worried about finding the \"best\" way. I would end up getting frustrated because I'd be switching resources often, redoing the same basics over and over, and I would finally just quit.\n\nThis time, I've come into Spanish with a completely new mindset. I'm almost 40 and I think back on how advanced I could be at this point if I had stuck with it when I initially started around 34. There is no sense in worrying about the past, and instead I don't want another 5-6 years to pass with the same thoughts. Also, I have a toddler that my wife and I want to raise bilingual, and that is a big motivator for me. My wife is a native Spanish speaker but I know how hard it is to raise a bilingual child when only one parent can speak the language (that was my situation growing up and I never learned Spanish as a result). So I'm here with a different mindset and confidence in my study plan. I've never progressed as much as I have had this time around.", "created_utc": "1658799552.0", "edited": "False", "id": "ihnqnj4", "is_submitter": "False", "link_id": "t3_w821wt", "parent_id": "t3_w821wt", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "mid83", "body": "There is no hard and fast rule for how much you can do in a day, but the general idea that at some point, you are going to see diminishing returns from intensive study within a short period of time. Of course everybody is different, but it seems like most people, 2-3 hours a day is the limit before your brain starts to turn to mush with intensive study. \n\nThere are a few things you can do in my opinion. For starters, I'm a fan of using multiple resources if you have more time to study each day. Let's say you have 2 hours of time to study each day. Rather than study one resource (Duolingo, a textbook, etc..) for those 2 hours, you can study two resources for an hour each or maybe even 3 resources for 40 minutes. Using multiple resources keeps me more engaged and it's less likely I'll get bored since I'm changing things up, even if the content is similar. Plus, each resource will teach things a little differently and likely in a bit of a different order, so that can help ingrain grammar or vocab. One resource may teach a concept better than another and vice versa. One big caveat is that you don't want to use too many resources or you are never going to progress from beginner concepts. For me, the sweet spot is 2-3 resources. Some people prefer just using one resource at a time, but I find it easier to study multiple hours a day if I'm changing things up.\n\nI'll also mention that you have to figure how much time you can study before you hit that point where you aren't retaining anything anymore. That that should be your limit on how much intense studying you do a day. Now I imagine you can probably increase that with time, especially if you haven't been in a school or studied for a long time (that's what happened with me...I haven't had a college course in 10 years so it took some time to get up to speed with studying). One thing that could help is splitting those productive hours up. If you have two hours to study but you find yourself getting exhausted after one hour, then maybe try to do an hour of study, give yourself a break, and then do another hour later in the day. Also, be sure you are taking breaks even if you can go for 2-3 hours in one sitting. A solid 10-15 minute break can really do wonders for your focus and concentration.\n\nFinally, just because your productive hours are used up doesn't mean you can't continue to engage with the language. This is the fun part and where immersion comes in. If you are watching a TV show or movie, try to watch something in your target language (or turn on the dub for that language if it's an English show/movie). At first I think it's fine to use English subtitles but try to switch over to subtitles in your target language as soon as possible. It's easy to just focus on the subtitles in English and ignore the language, especially since you aren't really doing intensive study at this point. Listen to music in your target language. Some people recommend switching your video games to your target language if you are a gamer. Change your phone's language to your target language. That stuff won't seem to help much at first but it will pay dividends over time.", "created_utc": "1658798103.0", "edited": "1658798325.0", "id": "ihnneb1", "is_submitter": "False", "link_id": "t3_w83tjr", "parent_id": "t3_w83tjr", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "mid83", "body": "I personally find Babbel to be the best app for me, but it's not for everybody. It does a much better job of explaining grammar than Duolingo, but some find Babbel to be quite boring. I've heard people describe it as a digital textbook, which I think is a good description. Given that I don't mind using textbooks, Babbel works for me, but somebody who hates textbooks may not care for it.\n\nI also like the in app SRS system that is built in. In my opinion it's the best in app SRS system I've come across compared to other apps like Busuu. If you hate making your own Anki cards, like I do, but want to get the benefit of SRS with the content you pick up in Babbel, it works well.\n\nI will note it does cost money, but you should be able to try out the first lesson of the various courses in the app so you can see if it works for you. There isn't a lot of variety in the lessons so the trial lessons you do will be a good indicator of how the entire course is. \n\nOne final note, it looks like you didn't mention the language you are learning. Babbel doesn't have a huge list of languages it supports so definitely check the list of languages the app supports.", "created_utc": "1658797059.0", "edited": "False", "id": "ihnl1n6", "is_submitter": "False", "link_id": "t3_w855y9", "parent_id": "t3_w855y9", "score": "5", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "mid83", "body": "I just wanted to jump on here and tell you good luck with your journey. Also, you aren't alone!\n\nMy mom is from Spain but stopped speaking Spanish to me around the time I was 3 or 4 since nobody on my dad's side of the family, including him, spoke Spanish, and she was tired of translating everything I was saying (I apparently understood English but often replied in Spanish).\n\nI'm now 39 and attempting to learn Spanish myself. I want to have a deeper connection with my heritage and be able to communicate with my family in Spain now that things like Facebook/WhatsApp make communication so easy. Plus, I married a native Spanish speaker and her family is mostly Spanish speaking only, so learning Spanish will allow me to connect with my wife's family in a way that isn't possible right now.\n\nKeep your head up and try to do a little bit each day. There are so many great resources out there and communities like this one to look for for help and motivation.\n\nGood luck!", "created_utc": "1658795538.0", "edited": "False", "id": "ihnhnrf", "is_submitter": "False", "link_id": "t3_w44t0d", "parent_id": "t3_w44t0d", "score": "1", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "mid83", "body": "Congrats on your progress! Awesome job!\n\nDo you mind giving some details on how you progressed so quickly? What resources and/or methods did you use?", "created_utc": "1658792180.0", "edited": "False", "id": "ihna32z", "is_submitter": "True", "link_id": "t3_w7ajfv", "parent_id": "t1_ihn3y4a", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "mid83", "body": "Thank you for the detail. I think I'm going to take the plunge and start trying to read in Spanish. It seems like an excellent method and I love reading. I've long thought about it (and assumed I needed to be at more of an intermediate level to start reading) but hearing your story is really motivating in terms of starting to read.\n\nWhile you seemed to be pretty sick of them by the end, what level were you at when you started the Ollie Richards books? I found his two Spanish books and they say they are targeted at A2-B1, which seems a bit above my level. I'm going to search Amazon for some A1 level short story books in Spanish and start incorporating those books into my day. It will be a nice change of pace from the course/app heavy schedule I have right now.", "created_utc": "1658771291.0", "edited": "False", "id": "ihlsz16", "is_submitter": "True", "link_id": "t3_w7ajfv", "parent_id": "t1_ihlou1b", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "mid83", "body": "Thank you!", "created_utc": "1658767094.0", "edited": "False", "id": "ihlhv3x", "is_submitter": "True", "link_id": "t3_w7ajfv", "parent_id": "t1_ihlg61z", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "mid83", "body": "I just recently learned about the unsubscribe process (having to delete everything you added). It does make it seem somewhat pointless to subscribe to the site, which is unfortunate because it does seem like it could be really helpful.", "created_utc": "1658767073.0", "edited": "False", "id": "ihlht45", "is_submitter": "True", "link_id": "t3_w7ajfv", "parent_id": "t1_ihlgru9", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "mid83", "body": "Congrats on your success so far!\n\nIf you don't mind me asking, how are you learning Spanish? It seems like you've made great progress!", "created_utc": "1658766769.0", "edited": "False", "id": "ihlh036", "is_submitter": "True", "link_id": "t3_w7ajfv", "parent_id": "t1_ihlab4l", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "mid83", "body": "Thank you so much!", "created_utc": "1658766725.0", "edited": "False", "id": "ihlgvtc", "is_submitter": "True", "link_id": "t3_w7ajfv", "parent_id": "t1_ihl6u2y", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "mid83", "body": "This person is monolingual of course.\n\nThank you for helping me think about the progress I have made vs worrying about what I don't know yet. It does really change your perspective to think that way.", "created_utc": "1658766720.0", "edited": "False", "id": "ihlgvda", "is_submitter": "True", "link_id": "t3_w7ajfv", "parent_id": "t1_ihkxmv1", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "mid83", "body": "Congrats on your success! \n\nCould you share some details what you've done in the past 6 months to make so much progress? I'm currently using more traditional methods (Teach Yourself course and Assimil), which seems to be going ok, but I'm also starting to force myself to consume some native content, in small doses right now.\n\nReading is my favorite hobby, so I imagine if I could utilize that to learn Spanish, I would be able to make good progress.\n\nOh and thanks for the Language Transfer recommendation. I actually recently started listening, and while I know most of what they are teaching so far, it definitely is a confidence builder. It's also helped me with some basic sentence construction as well.", "created_utc": "1658766605.0", "edited": "False", "id": "ihlgkmj", "is_submitter": "True", "link_id": "t3_w7ajfv", "parent_id": "t1_ihkx7tv", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "mid83", "body": "I agree with your point on social media. Unfortunately that idea (that you can't do anything after 35) seems to run rampant on a lot of subreddits. \n\nYou bring up a good point on the downside of multiple languages. I'll also say that I can already see how much learning languages changes your life. Just the small amount of Spanish I know has allowed me to connect with members of my wife's family, who are Spanish speaking only, in a way not possible when we were limited by a language barrier. I can only imagine how much that will continue to change as I learn more. \n\nPlus I've already gotten just a small taste of an entire culture that you simply don't have full access to without knowing the language. Google translate or English translations simply does not provide the same experience as being able to understand the speak the language. \n\nI know that language learning is going to enrich my life in countless ways and that is exciting.", "created_utc": "1658766353.0", "edited": "False", "id": "ihlfwu0", "is_submitter": "True", "link_id": "t3_w7ajfv", "parent_id": "t1_ihkx7j0", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "mid83", "body": "Thank you! I definitely stay away from influencer type videos in general, especially in regards to language learning. Unfortunately it seems like there is quite a bit of deception and that really is unfortunate.", "created_utc": "1658765881.0", "edited": "False", "id": "ihleo1h", "is_submitter": "True", "link_id": "t3_w7ajfv", "parent_id": "t1_ihjmjc6", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "mid83", "body": "Thank you for the detail. \n\nI'm pretty focused on a more traditional approach right now (I'm doing a couple beginner-intermediate coursebooks) while trying to dip my toes into native materials, mostly with the Dreaming Spanish Youtube channel. My goal is to slowly increase my time with native materials, because I know that's where the real fun begins. I love reading and watching tv shows/movies/sports, and I can't wait to be able to enjoy these activities in Spanish. \n\nI will say that I also struggle with Anki. I've mostly tried to do NL -> TL cards since I assume I might as well take the more challenging approach but it really gets frustrating at times. My approach lately has been to only put vocabulary words and phrases into my deck that I think are more necessary or important vs just dumping an entire vocabulary list in. I don't really think it's necessary to train myself to learn how to say 30 types of fruit in Spanish. I'll just choose ones that I actually encounter on a regular basis and figure that in the future, if I need to learn something new I can at that time. Maybe this is a poor approach, but having a massive Anki deck to review is only going to frustrate me to be honest.", "created_utc": "1658765711.0", "edited": "False", "id": "ihle7zg", "is_submitter": "True", "link_id": "t3_w7ajfv", "parent_id": "t1_ihkndzh", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "mid83", "body": "Thank you for that perspective! It's been so helpful to read all these positive comments.", "created_utc": "1658765216.0", "edited": "False", "id": "ihlcxv6", "is_submitter": "True", "link_id": "t3_w7ajfv", "parent_id": "t1_ihjh2eb", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "mid83", "body": "Thank you! My wife and I actually have a dream of spending time in Europe in retirement. It really would be amazing to be able to communicate and actually enjoy in the culture on those trips.\n\nThank you for the motivation!", "created_utc": "1658765190.0", "edited": "False", "id": "ihlcvgk", "is_submitter": "True", "link_id": "t3_w7ajfv", "parent_id": "t1_ihjfjzo", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "mid83", "body": "That really is a great piece of advice. I recently was thinking about all the false starts I have had in Spanish, which spanned the majority of my 30s. I don't want to end up having the same thoughts when I'm 49 and wonder why I let another decade go without achieving my goals. \n\nThanks for providing this perspective!", "created_utc": "1658765113.0", "edited": "False", "id": "ihlco9l", "is_submitter": "True", "link_id": "t3_w7ajfv", "parent_id": "t1_ihjrt7y", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "mid83", "body": "Congrats on your language learning success!", "created_utc": "1658764929.0", "edited": "False", "id": "ihlc719", "is_submitter": "True", "link_id": "t3_w7ajfv", "parent_id": "t1_ihjtrka", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "mid83", "body": "That's awesome! I love hearing stories like this.", "created_utc": "1658764900.0", "edited": "False", "id": "ihlc4fu", "is_submitter": "True", "link_id": "t3_w7ajfv", "parent_id": "t1_ihjy6d5", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "mid83", "body": "Thank you so much!", "created_utc": "1658764840.0", "edited": "False", "id": "ihlbyt5", "is_submitter": "True", "link_id": "t3_w7ajfv", "parent_id": "t1_ihk07oe", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "mid83", "body": "Congrats on your success with Korean. I'm always so impressed by native English speakers (or really anybody that uses the Latin/Roman alphabet) who are able to pick up languages like Korean or others with completely different writing systems and I imagine little to no similarities to English. Keep up the good work!\n\nI will say that learning Spanish has probably helped me ease into language learning. It's still daunting but the numerous similarities with English and Spanish do make it easier.\n\nI'll also say that I'm without a doubt more efficient at learning now at nearly 40 than I was at 30 (and even more so than when I was 20 in college).", "created_utc": "1658764828.0", "edited": "False", "id": "ihlbxoy", "is_submitter": "True", "link_id": "t3_w7ajfv", "parent_id": "t1_ihk1sev", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "mid83", "body": "Congrats on your success! Keep it up!", "created_utc": "1658759190.0", "edited": "False", "id": "ihkxu2w", "is_submitter": "True", "link_id": "t3_w7ajfv", "parent_id": "t1_ihk1tqt", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "mid83", "body": "Very cool! It's amazing how much you can pick up with immersion and shows that this occurs no matter what age.", "created_utc": "1658759021.0", "edited": "False", "id": "ihkxfm0", "is_submitter": "True", "link_id": "t3_w7ajfv", "parent_id": "t1_ihk799z", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "mid83", "body": "Yup, I have! There have been a couple really good videos of him posted on this thread that do a great job of easing the concerns I've had that made me create this post.\n\nThank you!", "created_utc": "1658758984.0", "edited": "False", "id": "ihkxcdw", "is_submitter": "True", "link_id": "t3_w7ajfv", "parent_id": "t1_ihkak4e", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "mid83", "body": "Thank you for some additional motivation! I love hearing about people like this, it really helps provide inspiration.", "created_utc": "1658758932.0", "edited": "False", "id": "ihkx7yw", "is_submitter": "True", "link_id": "t3_w7ajfv", "parent_id": "t1_ihkaogm", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "mid83", "body": "You are absolutely correct on both counts. I would never tell somebody close to me something to demotivate them from a goal of theirs and it's upsetting that it happened to me, but that is life. \n\nAlso you are right about regret. I just mentioned above, I dabbled in language learning for much of my 30s and have little to show for it. I know a lack of consistency, along with about 3+ breaks of a year or more of not studying Spanish at all, means I've been trapped in this false beginner phase for a while. I've relearned the basics about 4 times now. \n\nAll of that said, I don't want to be thinking the same thing at 49 and go, wow, I went another full decade and still didn't progress in Spanish, just like my 30s. I would instead like to think back to days like today when I'm 49 and say \"wow, look at the progress I made since I was 39 and thinking I could never accomplish this goal.\" Hopefully I will be fluent in Spanish at that time and even better, maybe on my way to learning a 2nd language as well.\n\nThank you for the feedback!", "created_utc": "1658724320.0", "edited": "False", "id": "ihjg6gq", "is_submitter": "True", "link_id": "t3_w7ajfv", "parent_id": "t1_ihjde7d", "score": "9", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "mid83", "body": "Thank you for providing some perspective. You are right that tomorrow is never promised so we need to take advantage of the time we do have. I wasted most of my 30s with little to no progress on Spanish and I don't want to look back to my 40s and think the same.", "created_utc": "1658724062.0", "edited": "False", "id": "ihjfr3d", "is_submitter": "True", "link_id": "t3_w7ajfv", "parent_id": "t1_ihjaytt", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "mid83", "body": "Thank you! This is exactly the sort of thing I needed to hear tonight.", "created_utc": "1658723999.0", "edited": "False", "id": "ihjfnaz", "is_submitter": "True", "link_id": "t3_w7ajfv", "parent_id": "t1_ihjalsp", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "mid83", "body": "Thank you for the positive feedback!", "created_utc": "1658723975.0", "edited": "False", "id": "ihjflwy", "is_submitter": "True", "link_id": "t3_w7ajfv", "parent_id": "t1_ihj7ww5", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "mid83", "body": "Congrats on getting started as a language learner! I've been dabbling for years now and I have barely progressed largely due to inconsistency (especially because I've had 1-2 year gaps with no language learning at all). It's never too late to continue to progress!", "created_utc": "1658723957.0", "edited": "False", "id": "ihjfkum", "is_submitter": "True", "link_id": "t3_w7ajfv", "parent_id": "t1_ihixgk8", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "mid83", "body": "Thank you so much for your comment and congrats on your success! Hearing about other's language learning success is very motivating!", "created_utc": "1658723885.0", "edited": "False", "id": "ihjfgi2", "is_submitter": "True", "link_id": "t3_w7ajfv", "parent_id": "t1_ihiwhld", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "mid83", "body": "I appreciate all the comments and links to Steve Kaufmann's videos. I love the message and congrats on your own language journey.\n\nThe one non European language I have a desire to learn is Japanese, so maybe in the future I can tackle that once I am successful in Spanish and have that confidence that I am actually capable of picking up a second language.\n\nI have looked at Lingq before. It seemed a bit disjointed and confusing, but from what i've read, it seems like a cool idea. I've always seen some negative feedback about the site, especially regarding canceling subscriptions. I have seen Readlang as an alternative.\n\nIf you don't mind me asking what sort of system do you use? Do you use another app/service like Readlang or just do it on your own? I'm currently just doing a couple courses, but I'm thinking about maybe starting to expose myself to native materials as well. Mostly with Dreaming Spanish videos as a start but I'd like to have some system like LIngq to start reading, which is a big passion of mine and i know that being able to read in Spanish would be a spectacular achievement (and likely allow me to continue to progress).", "created_utc": "1658723834.0", "edited": "False", "id": "ihjfdi9", "is_submitter": "True", "link_id": "t3_w7ajfv", "parent_id": "t1_ihisl6i", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "mid83", "body": "Just commented above about Steve Kaufmann's video that was linked by another post, but this was an awesome video as well. I've sort of avoided engaging too much with polygot/influencer videos on youtube regarding language learning, but I really like his message in these videos. It's such a great counter to all the stuff we hear about how adults can't learn languages.", "created_utc": "1658723501.0", "edited": "False", "id": "ihjet7f", "is_submitter": "True", "link_id": "t3_w7ajfv", "parent_id": "t1_ihirubp", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "mid83", "body": "What an awesome video. Thanks so much! I'm come across his videos before and that is really inspiring. He's nearly 40 years older than me and to see the passion and encouragement he has is really awesome. I needed that message tonight.", "created_utc": "1658723406.0", "edited": "False", "id": "ihjenh5", "is_submitter": "True", "link_id": "t3_w7ajfv", "parent_id": "t1_ihir2nh", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "mid83", "body": "Thank you!", "created_utc": "1658723246.0", "edited": "False", "id": "ihjedvn", "is_submitter": "True", "link_id": "t3_w7ajfv", "parent_id": "t1_ihiqq9z", "score": "6", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "mid83", "body": "Thank you so much! Thinking back on my life after reading your comment makes me realize how right you are. There probably hasn't been a better time in my life to actually be successful in my language journey. I didn't have the focus when I was younger to sit down and learn something for fun, yet in recent years I've found that I enjoy learning for fun.", "created_utc": "1658723236.0", "edited": "False", "id": "ihjed8w", "is_submitter": "True", "link_id": "t3_w7ajfv", "parent_id": "t1_ihiossd", "score": "30", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "mid83", "body": "Thanks for that feedback. I’m sort of in an interesting spot when it comes to Spain vs Latin American Spanish. On one hand my mom is from Spain (and I have family in Spain) and so I want to learn the Spain dialect both because of my heritage and to communicate with my mom (who uses vosotros etc..) and my family in Spain. I also find that I have a tendency to pronounce the Spain “th” for ce/ci/z without thinking, likely from always hearing my mom use that growing up (no I didn’t learn Spanish as a kid but did hear it a lot). At the same time my wife is a bilingual native speaker of both English and Spanish and her family is from Latin America. Plus, her family is mostly Spanish speaking only so I also want to learn the vocabulary and such to communicate with her family and the local Spanish speakers here. \n\nI’m assuming my accent will end being Latin American because I feel like I’ll come off like sort of a jackass speaking with a Spain accent with my wife’s family even though a big part of me wants to learn the Spain accent due to family history. \n\nAnyways sorry for the long response but I guess right now I’m trying to get exposure to both Spain and Latin American vocabulary and pronunciation. I’m kind of winging it and trying not to overthink it. Just learning for now. I’m sure accent will work itself out later.", "created_utc": "1658588132.0", "edited": "False", "id": "ihbuffv", "is_submitter": "True", "link_id": "t3_w62tmz", "parent_id": "t1_ihbpa6p", "score": "4", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "mid83", "body": "Right now I’m doing at least 30 mins-1 hr of Teach Yourself Spanish/Colloquial Spanish. I spend about 10-20 mins of adding new words to Anki and doing reviews. The rest is probably a total of 30 mins of Duolingo/Babbel when I have some time to kill but not enough to sit down in front of my course books. In the car or I’m busy around the house I have been listening to the Spanishpod101 beginner content. It’s not a perfect resource, and I personally wouldn’t pay for their premium subs, but it gives me extra learning time. Probably 30-45 mins a day. \n\nI’m thinking about dropping duo and starting to watch the absolute beginner playlist on the Dreaming Spanish. I don’t find Duo all that useful and would rather just use Babbel when I’m studying Spanish on mobile. \n\nFor me it’s about trying to maximize my time. I’m pretty busy with a job, family (and an active toddler running around all day). I don’t have tons of time to study at the table but apps and learning podcasts help me get some addition study time whenever possible.", "created_utc": "1658112030.0", "edited": "False", "id": "iglglt0", "is_submitter": "False", "link_id": "t3_w1d9u8", "parent_id": "t3_w1d9u8", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "mid83", "body": "I’d love to check out some templates. I use notion for basic note taking and completing exercises. Nothing special.", "created_utc": "1658073863.0", "edited": "False", "id": "igj4cpm", "is_submitter": "False", "link_id": "t3_w18u2s", "parent_id": "t3_w18u2s", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "mid83", "body": "To be honest I don’t really follow the language learning community on YouTube because so much of it seems fake to me. I know there are some genuine polyglots/language learners but so much of that community is people being somewhat dishonest (or just outright lying) about their skill level, or lying about how long it took them to get to a certain skill level (ie. saying they became fluent in a month when in reality they have years of experience in a language). Of course plenty of people are just trying to push a course or product, which is fine, but the incentive to promise unrealistic gains is too big for a lot of people to ignore. \n\nAt the end of the day, I just think a lot of YouTubers set up language learners with unrealistic expectations which leads to burnout and in many cases making learners feel like they are a failure rather than the fact that the YouTuber is promising something unrealistic like becoming fluent in a month. \n\nSo I do agree that the polyglot YouTube community plays a big role in unrealistic expectations. I do think this community is a far healthier community for language learners both in terms of realistic expectations and plenty of motivation and support for those of us who newer on this journey.", "created_utc": "1658017254.0", "edited": "False", "id": "iggkm4z", "is_submitter": "False", "link_id": "t3_w0sady", "parent_id": "t1_iggh9v3", "score": "18", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "mid83", "body": "This is a really good post. \n\nLearning the basics over and over has been most of my learning in Spanish thus far because I've quit and restarted studying Spanish numerous times over the past few years. I never even got past present tense until my most recent study attempt. I know the basics really damn well but that's it, and my total hours studied should be at a lower intermediate level at least by now. \n\nAlso great point on heritage speakers. My wife is a heritage Spanish speaker and she has said I already understand grammar much better (at least on the topics I've studied) than she does and she says she struggles with more advanced topics in Spanish despite having spoken Spanish since being a toddler.", "created_utc": "1658014909.0", "edited": "False", "id": "iggfw8b", "is_submitter": "False", "link_id": "t3_vzr89b", "parent_id": "t1_igb18zg", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "mid83", "body": "I absolutely believe that language learning is more about time/hours of quality study spent (and doing so consistently) vs just the length of time of study as others have pointed out in this thread. \n\nI'll just use myself as an example. I consider myself A1 in Spanish yet I took 2 years of Spanish in high school 20+ years ago, and have been flirting with self studying for several years now. In terms of length of time, and even raw hours spent, I should be pretty far along, yet I'm still a beginner. That is because lots of my study time has been wasted trying so many different resources thinking that one of them was \"the best\". In addition, I've quit after losing that beginners excitement, meaning that everytime I start Spanish again, I have to relearn the material I already learned 6-12 months prior. I've learned a lot of the beginner vocab/grammar several times now instead of progressing. \n\nFor around the last month I've been studying constantly and I've learned more in these four weeks than all the other time I've spent prior to this, including those 2 years of Spanish class in high school so many years ago. It's all about constancy and putting in the time. There is no shortcut.\n\nThe overall point is that I believe people can get themselves to a solid intermediate level relatively quickly if they are putting in quality hours and studying consistently on a daily or near daily basis. Getting the same results doing 15-30 minutes a day is going to take much longer.", "created_utc": "1658014628.0", "edited": "False", "id": "iggfbaf", "is_submitter": "False", "link_id": "t3_vzr89b", "parent_id": "t3_vzr89b", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "mid83", "body": "I think people need to come to the realization that language learning is a lifelong pursuit. As a native English speaker, I come across words I don't know all the time in books or magazine/newspaper articles, especially if it's something somewhat technical or specific. Also, given that English is so inconsistent when it comes to spelling and pronunciation, there are plenty of words that can trip me up if it's something I don't use or come across very often.  That doesn't mean I'm not a fluent English speaker or there is something wrong with me.  \n\nI bring this point up because I've seen Youtube videos from language learners who seem to get anxiety about the fact that they come across words they don't know when they read in their target language despite being advanced in those languages. I personally think that is the wrong way to approach things and a good example of what you are talking about.\n\nI think it's important to embrace the lifelong journey that language learning provides, which is awesome given that any language you learn opens up an entire culture for you to learn about and experience.", "created_utc": "1658014095.0", "edited": "False", "id": "igge6t4", "is_submitter": "False", "link_id": "t3_w0sady", "parent_id": "t3_w0sady", "score": "194", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "mid83", "body": "Obviously watching native materials (along with reading, listening to radio/music, speaking with natives) in your target language is how you progress past the A2/B1 you usually end up stuck at after completing beginner resources. Plus, it's fun I imagine (I wouldn't know...I'm still a Spanish beginner due to a lack of focused or consistant study). \n\nDo you mean watching shows as a complete beginner? The question would make more sense in that case. I've seen some people who recommend that watching native materials as a beginner because it gets you used to the sounds of the language. I've seen others say it's pointless as a beginner other than serving as motivation to understand the content one day. As a Spanish beginner, I will say it's pretty awesome when I turn on Spanish radio, TV, or movies, and I begin to pick out words and phrases.", "created_utc": "1658013007.0", "edited": "False", "id": "iggbwq2", "is_submitter": "False", "link_id": "t3_w0sb65", "parent_id": "t3_w0sb65", "score": "4", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "mid83", "body": "I work in health care as well and that’s one of the biggest reasons I can’t commit to classes myself for language learning. I work nights and my work days vary every week. There is just no way I could be off every every on certain days to attend classes.", "created_utc": "1657978377.0", "edited": "False", "id": "ige5lnd", "is_submitter": "False", "link_id": "t3_w0440o", "parent_id": "t1_igdiyf1", "score": "4", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "mid83", "body": "It could very well just be frustration on my end of not fully understanding every bit of the dialogue and the grammar, which is by design I imagine. \n\nI believe it's the most recent iteration published sometime in the 2010s. I think there is a newer version but I don't think the content has changed much.", "created_utc": "1657923458.0", "edited": "False", "id": "igbl35l", "is_submitter": "True", "link_id": "t3_vzu4wm", "parent_id": "t1_igb38pe", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "mid83", "body": "I absolutely love this show. It is a bit of a slow burn but I think the premise is very cool. Plus they really do a good job of making you care about the characters.", "created_utc": "1655083038.0", "edited": "False", "id": "ic5io8d", "is_submitter": "False", "link_id": "t3_v99o67", "parent_id": "t1_ic4qxq9", "score": "2", "subreddit": "television", "subreddit_id": "t5_2qh6e"}, {"author": "mid83", "body": "100% agree. It reminds me of when a big MMO like WoW had an expansion or big content update that increases the max level and people were upset when they finished the new content in a week or two. \n\nIt's unrealistic to expect games to have infinite content. My solution is adding games to my rotation until I'm satisfied with my gaming time without it becoming too much and feeling like work (then I start dropping games).", "created_utc": "1654924632.0", "edited": "False", "id": "ibxzmzh", "is_submitter": "False", "link_id": "t3_v9jf0g", "parent_id": "t1_ibxrpz1", "score": "5", "subreddit": "Dislyte", "subreddit_id": "t5_436za6"}, {"author": "mid83", "body": "I've been playing Counterside along with Dislyte and I've really enjoyed it. Some games that seem to have a lot of positive feedback include Epic Seven, Arknights, Alchemy Stars, and Punishing: Grey Raven (commonly referred to as PGR).", "created_utc": "1654923345.0", "edited": "False", "id": "ibxxuuh", "is_submitter": "False", "link_id": "t3_v9jf0g", "parent_id": "t1_ibxkbva", "score": "2", "subreddit": "Dislyte", "subreddit_id": "t5_436za6"}, {"author": "mid83", "body": "This is why I play multiple games. It keeps me from burning through content.", "created_utc": "1654907964.0", "edited": "False", "id": "ibx6fck", "is_submitter": "False", "link_id": "t3_v9jf0g", "parent_id": "t3_v9jf0g", "score": "61", "subreddit": "Dislyte", "subreddit_id": "t5_436za6"}, {"author": "mid83", "body": "Quick question regarding alts.  Are you referring to auto battling using multiple accounts at once or playing multiple characters daily on the same account?", "created_utc": "1654706890.0", "edited": "False", "id": "ibmlqu8", "is_submitter": "True", "link_id": "t3_v79imy", "parent_id": "t1_ibm11zy", "score": "1", "subreddit": "MapleStoryM", "subreddit_id": "t5_3ao8h"}, {"author": "mid83", "body": "I figured a guide was useless unless it was created in the past few months knowing how often games like this are updated. \n\nIs there is a specific character type I should focus on or one that might make my progress a little easier?", "created_utc": "1654644991.0", "edited": "False", "id": "ibjpnbt", "is_submitter": "True", "link_id": "t3_v79imy", "parent_id": "t1_ibjll20", "score": "1", "subreddit": "MapleStoryM", "subreddit_id": "t5_3ao8h"}, {"author": "mid83", "body": "Thanks! Are there any recommended beginner guides to help ensure I don't waste valuable resources?", "created_utc": "1654642216.0", "edited": "False", "id": "ibjk63i", "is_submitter": "True", "link_id": "t3_v79imy", "parent_id": "t1_ibjjmks", "score": "0", "subreddit": "MapleStoryM", "subreddit_id": "t5_3ao8h"}, {"author": "mid83", "body": "I had that issue with my iPad this morning but the game has worked on on my iPhone so far. \n\nUnless it’s an iPad specific issue the only other difference I can think of is that my iPhone was just updated to the latest version of iOS.  Maybe that’s it’s.", "created_utc": "1654112661.0", "edited": "False", "id": "iatp9zu", "is_submitter": "False", "link_id": "t3_v2p9ma", "parent_id": "t3_v2p9ma", "score": "1", "subreddit": "DiabloImmortal", "subreddit_id": "t5_qq4iz"}, {"author": "mid83", "body": "I honestly hate seeing open wheel racing on ovals. It’s dangerous as hell.", "created_utc": "1653400543.0", "edited": "False", "id": "i9t2kxq", "is_submitter": "False", "link_id": "t3_uwfc99", "parent_id": "t3_uwfc99", "score": "-2", "subreddit": "formula1", "subreddit_id": "t5_2qimj"}, {"author": "mid83", "body": "Thank you so much for this! I needed to hear this today. It's been a busy year so far and I have made little to no progress on my language goals. This really helps me regain that motivation I need to progress further!", "created_utc": "1649994097.0", "edited": "False", "id": "i4sh35r", "is_submitter": "False", "link_id": "t3_u3f87j", "parent_id": "t3_u3f87j", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "mid83", "body": "I imagine Apple Arcade coming out around the same time didn't do them very many favors.", "created_utc": "1648353089.0", "edited": "False", "id": "i29x2u8", "is_submitter": "True", "link_id": "t3_tp55hj", "parent_id": "t1_i29sbvs", "score": "3", "subreddit": "iosgaming", "subreddit_id": "t5_2sc2s"}, {"author": "mid83", "body": "That's a good point. I've been reading the March issues of Analog and Asimov's to gauge if it's worth subscribing to either magazine, and I've already seen the advantage that the digital outlets have in this regard. I like to look up the author of a story I enjoy to see if there are any novels or other short fiction to check out. Many of the authors I've looked up have a long list of past short fiction, but it seems like the majority of those stories were published in Asimov's/Analog as well, and therefore aren't accessible unless I buy back issues or the story happens also be published in an anthology. \n\nIt's unfortunate because based on my experience so far, there are some excellent stories being published in these print magazines that are likely not getting the attention they deserve.", "created_utc": "1646980820.0", "edited": "False", "id": "i07mzd2", "is_submitter": "False", "link_id": "t3_tahiya", "parent_id": "t1_i07aemj", "score": "3", "subreddit": "printSF", "subreddit_id": "t5_2rzjk"}, {"author": "mid83", "body": "As somebody who is just getting into short fiction, why don’t you see anything from Asimov’s or Analog given their history? Is there a quality issue there?", "created_utc": "1646969148.0", "edited": "False", "id": "i072u2q", "is_submitter": "False", "link_id": "t3_tahiya", "parent_id": "t3_tahiya", "score": "2", "subreddit": "printSF", "subreddit_id": "t5_2rzjk"}, {"author": "mid83", "body": "Umm wow, I just want to say what an amazing post (and collection) this is. I have recently gotten back into fantasy and I'm very behind on my new releases. This is going to be an excellent way to start building a reading list of new releases, especially going back to June it looks like. Thanks!!!!", "created_utc": "1646026516.0", "edited": "False", "id": "hyqsstk", "is_submitter": "False", "link_id": "t3_t305e0", "parent_id": "t3_t305e0", "score": "1", "subreddit": "Fantasy", "subreddit_id": "t5_2qknd"}, {"author": "mid83", "body": "Do you just load a blank grid and use tokens for combat?", "created_utc": "1645490282.0", "edited": "False", "id": "hxwj38e", "is_submitter": "False", "link_id": "t3_sy50ea", "parent_id": "t1_hxwfc4l", "score": "3", "subreddit": "Solo_Roleplaying", "subreddit_id": "t5_iicpz"}, {"author": "mid83", "body": "So you skip the cardio portion of LIIFT4? That sounds like a good plan. How long are the strength portions of the program? I’m just trying to gauge how long my workout would be total. \n\nThanks!", "created_utc": "1643212420.0", "edited": "False", "id": "hub2a69", "is_submitter": "True", "link_id": "t3_scy5wf", "parent_id": "t1_hu9qvxm", "score": "1", "subreddit": "pelotoncycle", "subreddit_id": "t5_39us7"}, {"author": "mid83", "body": "Did you go from a beginner to C1 in less than a year? If so how many hours a day did you study and what was your method? Amazing job!", "created_utc": "1641100625.0", "edited": "False", "id": "hqwfw90", "is_submitter": "False", "link_id": "t3_rt2qbn", "parent_id": "t1_hqvhrh5", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "mid83", "body": "I'd say 2021 was a success because it's the first year in several where I finally sat down with a plan to really tackle Spanish. I closed out the year on a strong note and that's really made me excited that this is the year I finally make real progress in regards to language learning. \n\nFor 2022, my overall goal is to finish the year around a B1 level in Spanish. Given I'm still down in early to mid A1, my initial focus is going to be on Pimsleur and Babbel. I'm set to finish Pimsleur in April, assuming I don't miss too many days. I'm assuming that finishing the main Babbel course by this summer is realistic as well. I also complete Duolingo lessons but more just as a way to practice the grammar and vocabulary I'm picking up. Given how huge the Spanish tree is now, I don't have any expectations about finishing it.\n\nIn addition, I'm also working on native content. Right now the bulk of my studies are in the courses above but I have started watching some videos in Spanish (right now mostly stuff on channels like Dreaming Spanish). As I get further in my courses, my plan to start replacing \"course\" time with native content time. Once I finish Pimsleur and Babbel I plan to dive head first into native content almost exclusively.", "created_utc": "1641068360.0", "edited": "False", "id": "hqufg14", "is_submitter": "False", "link_id": "t3_rt2qbn", "parent_id": "t3_rt2qbn", "score": "7", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "mid83", "body": "Awesome job! No sweat on the hate regarding Duolingo. I actually have been using it so far and enjoy it. One of the beautiful things about language learning these days is that there is literally a resource for every type of learner. For me, I'm focusing on Babbel as I enjoy their lessons personally (like Duolingo I know lots of people dislike Babbel as well), especially the details they provide for grammar. I then use Duolingo as a way to drill the concepts. I don't really think of Duolingo as any different than doing exercises in a textbook, and that's really my use case for it. I then add a Pimsleur lesson a day for speaking practice.\n\nOne more question on Duolingo for you. Did you actually finish the tree? I feel like it would take me years to finish at the pace I'm at. \n\nAgain congrats on your progress. I've been stopping and starting Spanish for years and I'm probably still at a low to mid A1. Hopefully I'll be able to be at a B1 by New Years 2023.", "created_utc": "1641067292.0", "edited": "False", "id": "hqucuxf", "is_submitter": "False", "link_id": "t3_rt2qbn", "parent_id": "t1_hqtscle", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "mid83", "body": "Awesome job! What did you use to get to B1?", "created_utc": "1641049985.0", "edited": "False", "id": "hqt8g2h", "is_submitter": "False", "link_id": "t3_rt2qbn", "parent_id": "t1_hqrrlu8", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "mid83", "body": "Thanks for the detailed answers!\n\nI forgot to ask, assuming the viper wallet comes to the US in the future, is there a way to switch my erc20 coins for native coins? \n\nI guess the alternative would be to sell the erc20 coins and use the proceeds to buy native coins. That of course that adds in gas fees/transaction fees and taxes on gains, so maybe there is another way to do it (but I figure the tax issue won’t go away either way since the IRS considers coin swaps to be taxable events).", "created_utc": "1636299900.0", "edited": "False", "id": "hjonz2z", "is_submitter": "True", "link_id": "t3_qojr5n", "parent_id": "t1_hjnii1m", "score": "1", "subreddit": "cotinetwork", "subreddit_id": "t5_3p1jg"}, {"author": "mid83", "body": "What do you use to stake?", "created_utc": "1636167321.0", "edited": "False", "id": "hji5zmb", "is_submitter": "True", "link_id": "t3_qnr4xb", "parent_id": "t1_hji5pks", "score": "1", "subreddit": "CryptoCurrency", "subreddit_id": "t5_2wlj3"}, {"author": "mid83", "body": "I definitely plan to not sell what I have, but I’m wondering if I shouldn’t DCA in things like SOL/DOT while they are at ATH.", "created_utc": "1636167311.0", "edited": "False", "id": "hji5ywh", "is_submitter": "True", "link_id": "t3_qnr4xb", "parent_id": "t1_hji5d30", "score": "1", "subreddit": "CryptoCurrency", "subreddit_id": "t5_2wlj3"}, {"author": "mid83", "body": "I definitely plan to not sell what I have, but I’m wondering if I shouldn’t DCA in things like SOL/DOT while they are at ATH.", "created_utc": "1636167303.0", "edited": "False", "id": "hji5yad", "is_submitter": "True", "link_id": "t3_qnr4xb", "parent_id": "t1_hji5qml", "score": "1", "subreddit": "CryptoCurrency", "subreddit_id": "t5_2wlj3"}, {"author": "mid83", "body": "I think RH is playing it safe because they have spent the last year in the SEC’s crosshairs for several issues, including the GameStop fiasco. Now that they are a public they are going to be careful (they have to be really).", "created_utc": "1635815713.0", "edited": "False", "id": "hiyhbv0", "is_submitter": "False", "link_id": "t3_qkmc0d", "parent_id": "t3_qkmc0d", "score": "2", "subreddit": "SHIBArmy", "subreddit_id": "t5_2y15qk"}, {"author": "mid83", "body": "Are there any ways for those of us who aren’t experts in programming to be able to analyze these smart contracts?", "created_utc": "1635785950.0", "edited": "False", "id": "hiwita5", "is_submitter": "True", "link_id": "t3_qkhzo8", "parent_id": "t1_hiwhyy7", "score": "1", "subreddit": "CryptoCurrency", "subreddit_id": "t5_2wlj3"}, {"author": "mid83", "body": "This is why you have to do research. Apparently the white paper was full of typos, the website was just recently registered among other things. All red flags.\n\nAlso, gotta be careful with all these “innovative” features like anti whale mesures in the smart contract.", "created_utc": "1635785571.0", "edited": "False", "id": "hiwhwcg", "is_submitter": "False", "link_id": "t3_qkhx1k", "parent_id": "t3_qkhx1k", "score": "8", "subreddit": "SHIBArmy", "subreddit_id": "t5_2y15qk"}, {"author": "mid83", "body": "DCA'ing is such an important strategy. Find a project (or projects) you believe in and just DCA each week/month (or whatever timeframe works for you). Pouring over charts will drive you insane and no matter what you do, you can't time things perfectly. Timing the market is nothing but luck. This of course only applies for projects you actually believe in and want to hold long term.\n\nIf you are trying to find the next 10000x gainer, I don't know what to tell you.", "created_utc": "1635673263.0", "edited": "False", "id": "hiqwmsx", "is_submitter": "False", "link_id": "t3_qjjuhe", "parent_id": "t3_qjjuhe", "score": "1", "subreddit": "CryptoCurrency", "subreddit_id": "t5_2wlj3"}, {"author": "mid83", "body": "One thing I find amazing is that when you start to dive into Defi, you realize how much better this system is for the average person. Rather than put your money in the bank (where you don’t really have control over it), and earn no interest (or fractions of pennies), you can lend out your crypto and earn that interest yourself. \n\nIf you want to move your crypto, you can. I switched banks years ago and it took forever to transfer my emergency fund because of all the red tape. It made me realize you really have no control of your money. \n\nUnfortunately the media and politicians have done a great job of demonizing crypto and convincing people that federal regulators should have control over what’s going on in Defi right now. It’s a shame.", "created_utc": "1635664685.0", "edited": "False", "id": "hiqmn6r", "is_submitter": "False", "link_id": "t3_qjhrsf", "parent_id": "t3_qjhrsf", "score": "1", "subreddit": "CryptoCurrency", "subreddit_id": "t5_2wlj3"}, {"author": "mid83", "body": "Or the rare earth minerals used in EV batteries.", "created_utc": "1635664198.0", "edited": "False", "id": "hiqm1zf", "is_submitter": "False", "link_id": "t3_qjhrsf", "parent_id": "t1_hiqe0x5", "score": "1", "subreddit": "CryptoCurrency", "subreddit_id": "t5_2wlj3"}, {"author": "mid83", "body": "This x 1000. \n\nFinancial literacy is a huge problem in this country (the US).", "created_utc": "1635664042.0", "edited": "False", "id": "hiqlvad", "is_submitter": "False", "link_id": "t3_qjhrsf", "parent_id": "t1_hiqigpj", "score": "7", "subreddit": "CryptoCurrency", "subreddit_id": "t5_2wlj3"}, {"author": "mid83", "body": "I’ve had plenty of people look at me like I’m crazy when they find out I invest in crypto. I don’t broadcast it but I also don’t lie if it comes up. \n\nI get responses about crypto destroying the planet or it’s only for used by criminals. I’ve tried to explain how it works and eyes glaze over so I don’t bother anymore. If people want to know, they will take it upon themselves to learn. If not they won’t.", "created_utc": "1635663940.0", "edited": "False", "id": "hiqlqrf", "is_submitter": "False", "link_id": "t3_qjhrsf", "parent_id": "t3_qjhrsf", "score": "1", "subreddit": "CryptoCurrency", "subreddit_id": "t5_2wlj3"}, {"author": "mid83", "body": "Yeah, it's not necessarily healthy long term for ADA to just shoot up 1000% in a short period of time. Then you get into pump and dump territory when people just start taking profits and you can see just as quick of a crash. \n\nI actually think it's a positive that despite all the trash talking about ADA I see pretty much everywhere (Twitter, other crypto subreddits, Youtube etc..), the price remains fairly stable. That means that despite all the negativity, people aren't selling in mass. Holders seem to believe in the project, and to be fair, if you do your research, it's quite obvious why I think this is a excellent long term investment opportunity. You can buy ADA, set up a weekly/biweekly/monthly DCA, transfer to to your staking wallet, stake (and with pretty much no risk on your end) and just forget about it. Just let your investment grow as the project continues on.", "created_utc": "1635660425.0", "edited": "False", "id": "hiqhk38", "is_submitter": "False", "link_id": "t3_qjg5w8", "parent_id": "t1_hiq95n4", "score": "1", "subreddit": "cardano", "subreddit_id": "t5_3jns3"}, {"author": "mid83", "body": "On the price action, I think Cardano is more akin to an investment in a riskier technology stock vs a typical crypto coin/token. This isn't a project that is just built up on hype and pump and dumps like so many others in this space. I like that Cardano takes their time to build their blockchain right, waiting for the research and peer review process to play out before making updates. One of the effects of this approach is that you are going to have time periods where not much is changing, and therefore people are going have their attention focused on whatever new shiny object is out there in the crypto space.\n\nThere is no guarantee, but outside of BTC/ETH, there are only a handful of projects that I'm confident will likely be around in 5-10 years (and surviving at least 1-2 bear markets). Cardano is one of them because they have a plan, process, plenty of funding, and a huge community. Again, no guarantee, but I feel confident that if I DCA into ADA, regularly transfer to my Yoroi wallet, and just let it grow for 5-10 years, I will have a nice pile of money waiting for me. Unfortunately this set up isn't sexy enough for many who think everything coin/token needs to go up 1000% in a week or it's a bad project.", "created_utc": "1635659996.0", "edited": "False", "id": "hiqh0h2", "is_submitter": "False", "link_id": "t3_qjg5w8", "parent_id": "t3_qjg5w8", "score": "1", "subreddit": "cardano", "subreddit_id": "t5_3jns3"}, {"author": "mid83", "body": "I think that is pretty obvious at this point.", "created_utc": "1635658585.0", "edited": "False", "id": "hiqf7d7", "is_submitter": "False", "link_id": "t3_qjhl0v", "parent_id": "t1_hiqbsof", "score": "3", "subreddit": "Astros", "subreddit_id": "t5_2s6y7"}, {"author": "mid83", "body": "This situation makes me think much it hurt that we let Springer walk. That guy was the heart and soul of this team. As much as I love Altuve, I don't think he's the type of guy to rally the team and help get them in the right mindset. He seems too soft spoken for that, which is totally fine. With that said, I don't know who that leader is on this roster. Maybe Correa, but he's probably got one foot out the door. Bregman looks completely lost.", "created_utc": "1635658488.0", "edited": "False", "id": "hiqf2ip", "is_submitter": "False", "link_id": "t3_qjhl0v", "parent_id": "t1_hiqeegd", "score": "6", "subreddit": "Astros", "subreddit_id": "t5_2s6y7"}, {"author": "mid83", "body": "Bregman hasn't looked right since 2019.\n\nNow, he just looks completely out of it. I remember watching him talking to the post-game crew on Fox after they clinched the ALCS and he just looked shell shocked. I don't know if it's injuries or him just being out of it mentally, but the organization needs to figure out what the hell is going on with him and hopefully get it fixed given we are still paying him big $$ for the next few seasons.\n\nI hope Dusty drops him to at least 7th in the lineup (or better yet just bench him and start Diaz).", "created_utc": "1635658270.0", "edited": "False", "id": "hiqes40", "is_submitter": "False", "link_id": "t3_qjhl0v", "parent_id": "t3_qjhl0v", "score": "9", "subreddit": "Astros", "subreddit_id": "t5_2s6y7"}, {"author": "mid83", "body": "He told me the app works in Texas. The exchange website doesn’t.", "created_utc": "1635529499.0", "edited": "False", "id": "hijfptu", "is_submitter": "False", "link_id": "t3_qgs1y1", "parent_id": "t1_hig62bq", "score": "1", "subreddit": "cardano", "subreddit_id": "t5_3jns3"}, {"author": "mid83", "body": "Honestly, I'm setting and forgetting (and staking) my ADA. This is a long term hold and short term price action doesn't matter other than providing buying opportunities. If you are a long term holder it's always a good idea to attempt to ignore the noise. Keep up with the project, looking for extra buying opportunities, DCA into your Cardana position, and just ignore all the short term doom and gloom. It's the same in the stock market. \n\nThere is too much happening in the Cardano ecosystem for me to worry about short term losses (or sideways prices while competitors are increasing in price). I truly believe blockchain is just getting started and there will be plenty of opportunity for ADA, along with competitors like SOL, ETH 2.0 and others to coexist in the coming years.  Plus you can always hold positions in multiple projects to hedge your bets. There is plenty of room for everybody to grow their wealth in this space.", "created_utc": "1635518551.0", "edited": "False", "id": "hiinugk", "is_submitter": "False", "link_id": "t3_qi5ltb", "parent_id": "t1_hiii5k0", "score": "1", "subreddit": "cardano", "subreddit_id": "t5_3jns3"}, {"author": "mid83", "body": "There are a number of crypto tax filing services that will sync with many exchanges and wallets to pull in your transactions. Some of those services will provide you with tax paperwork and some have even partnered with Turbotax. \n\nI highly recommend trying some and seeing which easily pull in your transactions. Once it's set up, just login and sync occasionally and add new exchanges/wallets when you use something new. It's well worth the money for the tax services (usually the syncing of transactions are free....the tax paperwork etc costs money), especially if you are a high frequency trader.", "created_utc": "1635518065.0", "edited": "False", "id": "hiimnww", "is_submitter": "False", "link_id": "t3_qi5hec", "parent_id": "t3_qi5hec", "score": "1", "subreddit": "CryptoCurrency", "subreddit_id": "t5_2wlj3"}, {"author": "mid83", "body": "What issues? I know my friend uses them often. I can ask if he's had those same issues as we both live in TX.", "created_utc": "1635457757.0", "edited": "False", "id": "hifp64h", "is_submitter": "False", "link_id": "t3_qgs1y1", "parent_id": "t1_hifikto", "score": "2", "subreddit": "cardano", "subreddit_id": "t5_3jns3"}, {"author": "mid83", "body": "Speaking for the US, trading from one token to another in is a taxable event. It’s the same concept as taking gains in a stock and using those returns to buy another stock. You get taxed on the capital gains of that trade in the stock market. The same applies to crypto even if you never convert to fiat. For example if you swap BTC to ADA, and the amount BTC you owned and swapped increased in value by $1000 from the day you bought that BTC, you would owe taxes on that $1000 capital gain, even though that went directly to ADA. Do keep that mind especially whenever you trade so you don’t get suprised when you do your taxes. \n\nI also recommend trying one of the many crypto tax tools out there. Many have the ability to load in data from exchanges and wallets so you can keep up with what your tax picture looks like for the year.", "created_utc": "1635439488.0", "edited": "False", "id": "hief94f", "is_submitter": "False", "link_id": "t3_qhq9uo", "parent_id": "t3_qhq9uo", "score": "7", "subreddit": "cardano", "subreddit_id": "t5_3jns3"}, {"author": "mid83", "body": "This is just my opinion and not financial advice but I wanted to mention a few things.\n\n1.) Don't focus on the price of the coin, focus on the market cap. A higher market cap means those massive 100x gains people want as less likely. It doesn't matter if the coin is $1000 or $.01. Yes, Cardano looks cheap in comparison to other competitors (SOL, DOT etc..), but it has a higher market cap so that means it's harder to see big gains in comparison to smaller cap projects (same reason why it's much easier for a start up company's stock to go 100x vs Apple). \n\n2.) I think a project like Cardano only makes sense as a long term hold if you believe the project has staying power and utility years from now. Sure, you might get a 2x or 3x in the short term but the real value is in what happens in 5-10 years. \n\nMy ADA goes straight to Yoroi and is therefore staked. Set it and forget it for the next decade. If I want big gains in the short term I'm looking at much smaller projects.", "created_utc": "1635380574.0", "edited": "False", "id": "hibhmf6", "is_submitter": "False", "link_id": "t3_qh8lgl", "parent_id": "t1_hibczdv", "score": "1", "subreddit": "cardano", "subreddit_id": "t5_3jns3"}, {"author": "mid83", "body": "I’m bullish on ADA but $200 isn’t realistic at least in the short term. \n\nADA will match Bitcoin’s market cap at around $40. $200 would make the market cap around $5 trillion. Maybe one day but not anytime soon unless there is a massive burn mechanism.", "created_utc": "1635375900.0", "edited": "False", "id": "hib77h6", "is_submitter": "False", "link_id": "t3_qh8lgl", "parent_id": "t1_hib5zot", "score": "2", "subreddit": "cardano", "subreddit_id": "t5_3jns3"}, {"author": "mid83", "body": "I spent a lot of time reading through the Cardano website and read through the parts of the docs that I can understand without having a technical background. \n\nI have also read CH’s whiteboard video that was really helpful.\n\nI also read a lot of the posts on the CardanoELI5 subreddit.", "created_utc": "1635371081.0", "edited": "False", "id": "hiavwzc", "is_submitter": "True", "link_id": "t3_qg16fa", "parent_id": "t1_hi936et", "score": "1", "subreddit": "cardano", "subreddit_id": "t5_3jns3"}, {"author": "mid83", "body": "I’m in Texas and I’ve mostly been using Coinbase Pro. It cuts the fees down a lot. I haven’t used it but I have friends who use crypto.com as well", "created_utc": "1635340369.0", "edited": "False", "id": "hi8rjbt", "is_submitter": "False", "link_id": "t3_qgs1y1", "parent_id": "t1_hi89m7w", "score": "2", "subreddit": "cardano", "subreddit_id": "t5_3jns3"}, {"author": "mid83", "body": "I don't know why these posts don't get much attention, but I just want you to know how awesome this collection of links is. Not only am I learning a ton from reading the various links you provide, it's also giving me a number of good Twitter follows. Thank you!", "created_utc": "1635296357.0", "edited": "False", "id": "hi6tsqt", "is_submitter": "False", "link_id": "t3_qfzz2t", "parent_id": "t3_qfzz2t", "score": "2", "subreddit": "cardano", "subreddit_id": "t5_3jns3"}, {"author": "mid83", "body": "I'll have to check out ACH. Thanks for the recommendation", "created_utc": "1635294262.0", "edited": "False", "id": "hi6p750", "is_submitter": "True", "link_id": "t3_qg16fa", "parent_id": "t1_hi430ea", "score": "1", "subreddit": "cardano", "subreddit_id": "t5_3jns3"}, {"author": "mid83", "body": "Absolutely. It's like the wild west out here and seeing a professional project with a team that is open and transparent was a big selling point for me.", "created_utc": "1635294235.0", "edited": "False", "id": "hi6p536", "is_submitter": "True", "link_id": "t3_qg16fa", "parent_id": "t1_hi3wdz8", "score": "1", "subreddit": "cardano", "subreddit_id": "t5_3jns3"}, {"author": "mid83", "body": "Yes, this community is excellent. I haven't necessarily seen the same with some other crypto communities, and it's a big reason I have really grown fond of Cardano. Seeing how engaged and enthusiastic the community is and how much the team behind Cardano engages with the community really made a positive impression on me.", "created_utc": "1635294181.0", "edited": "False", "id": "hi6p0xc", "is_submitter": "True", "link_id": "t3_qg16fa", "parent_id": "t1_hi3t47k", "score": "1", "subreddit": "cardano", "subreddit_id": "t5_3jns3"}, {"author": "mid83", "body": "That's the plan! This is a long term hold and I plan to DCA and stake along the way. Should be fun to see where things stand in 5-10 years.", "created_utc": "1635294094.0", "edited": "False", "id": "hi6ou3w", "is_submitter": "True", "link_id": "t3_qg16fa", "parent_id": "t1_hi3s2sj", "score": "1", "subreddit": "cardano", "subreddit_id": "t5_3jns3"}, {"author": "mid83", "body": "In some ways I feel like I'm late to the crypto party overall, but then again crypto has barely any adoption with the general population so hopefully this is just the beginning. The coins I'm buying from now on are long term holds, so hopefully in 5-10 years my ADA plus staking rewards will have grown substantially.", "created_utc": "1635294023.0", "edited": "False", "id": "hi6ooii", "is_submitter": "True", "link_id": "t3_qg16fa", "parent_id": "t1_hi3gp43", "score": "8", "subreddit": "cardano", "subreddit_id": "t5_3jns3"}, {"author": "mid83", "body": "I completely agree!", "created_utc": "1635292269.0", "edited": "False", "id": "hi6kskk", "is_submitter": "True", "link_id": "t3_qg16fa", "parent_id": "t1_hi3miwh", "score": "1", "subreddit": "cardano", "subreddit_id": "t5_3jns3"}, {"author": "mid83", "body": "Keep in mind I’m new to crypto so I’m still learning and feel like I have just scratched the surface. \n\nMy favorite aspect (aspects really…can’t just pick one) of Cardano is their  overall academic and methodical approach to developing and releasing their blockchain. I also love the transparency and focus on community. Finally I love the focus on decentralizarion. I’ll also note that the Maladex white paper seems to point out several distinct advantages regarding Cardano’s blockchain design vs competitors like ETH/SOL (I’m just scratching the surface on understanding Defi). \n\nThe thing that worries me is that Cardano taking that slow methodical approach will end up hurting them in terms of adoption. SOL is gaining a lot of traction and ETH 2.0 will be here at some point. While I believe all three blockchains (and other players as well like DOT) can coexist in the long run, slow adoption is a risk for Cardano.", "created_utc": "1635285694.0", "edited": "False", "id": "hi662bw", "is_submitter": "True", "link_id": "t3_qg16fa", "parent_id": "t1_hi4tpby", "score": "3", "subreddit": "cardano", "subreddit_id": "t5_3jns3"}, {"author": "mid83", "body": "This 100%.", "created_utc": "1635249925.0", "edited": "False", "id": "hi3rsjt", "is_submitter": "True", "link_id": "t3_qg16fa", "parent_id": "t1_hi3r7o9", "score": "12", "subreddit": "cardano", "subreddit_id": "t5_3jns3"}, {"author": "mid83", "body": "Thank you! I will be looking into this.", "created_utc": "1635245642.0", "edited": "False", "id": "hi3l9cj", "is_submitter": "True", "link_id": "t3_qg16fa", "parent_id": "t1_hi3g0dz", "score": "9", "subreddit": "cardano", "subreddit_id": "t5_3jns3"}, {"author": "mid83", "body": "Personally I’m not worried about short term gains. I’ll take them if I get them, but I have always invested with the long term in mind and it really helps deal with volatility. \n\nI have to agree that this project sure seems like something special. I’m not opposed to looking into additional projects but Cardano is by far my favorite project I have looked into even despite the negativity I’ve seen about it in other communities. \n\nThis is all about the long game.", "created_utc": "1635245627.0", "edited": "False", "id": "hi3l8n9", "is_submitter": "True", "link_id": "t3_qg16fa", "parent_id": "t1_hi398sb", "score": "17", "subreddit": "cardano", "subreddit_id": "t5_3jns3"}, {"author": "mid83", "body": "Thanks for the resources. I had initially looked at some BSC tokens prior to diving into Cardano and it really is a world of difference here. I’ve actually been going through the Maladex white paper (as much as I can understand) and it really seems like the potential with Defi on Cardano is groundbreaking. \n\nI’ll be bookmarking these pages and looking into some additional projects as well.", "created_utc": "1635245445.0", "edited": "False", "id": "hi3kzpg", "is_submitter": "True", "link_id": "t3_qg16fa", "parent_id": "t1_hi3juk8", "score": "3", "subreddit": "cardano", "subreddit_id": "t5_3jns3"}, {"author": "mid83", "body": "I hear ya. I'm new to crypto and have been in the stock market for a long time. It's nice having 10q and 10k filings, quarterly earnings (earnings call transcripts, company PowerPoints etc..), and a lot of the other various events public companies attend that are more often being posted on the company's IR website.  Really an abundance of information.\n\nFor crypto it's been a big shift given that every project does things completely different. Some have details documentation (like Cardano), and others maybe have a white paper that could be outdated.", "created_utc": "1635214069.0", "edited": "False", "id": "hi2ce8e", "is_submitter": "False", "link_id": "t3_qf9v8n", "parent_id": "t1_hi0xxun", "score": "1", "subreddit": "cardano", "subreddit_id": "t5_3jns3"}, {"author": "mid83", "body": "I think it depends on what you mean by worth. I'll answer it in a few ways.\n\n**1.) Will Cardano reach the current market cap of ETH (around $500 million) or BTC (a little under $1.2 trillion) one day?**\n\nI think this is very possible, especially the current ETH market cap of near $500 billion, if Cardano's long term plan works out and they become one of the 3rd gen blockchains of choice for developers. I don't think they need to beat or replace ETH or others like SOL to get there either. This is a big enough market for multiple players. \n\n**2.) Will Cardano \"surpass\" ETH (or even BTC) in market cap one day?**\n\nThis is a bit tougher, especially BTC, because I think BTC has a bright future as a store of value, especially if it eventually becomes a reserve currency for some counties (a possibility). \n\nIn regards to ETH, it depends on if they can make their platform the go to for Dapps/Defi once Cardano is fully on board. This is a tougher thing especially given competition from others like SOL and the eventual ETH 2.0 upgrade, along with all the support that ETH already has from developers (and SOL is quickly getting). \n\nA more realistic option in my opinion is that these platforms coexist but ETH maybe holds it's lead over Cardano currently.  \n\n**3.) Will Cardano ever reach the current prices of ETH (around $4220 a coin) or BTC ($62,800)?**\n\nCurrently, no. If ADA was around ETH's current price of $4220, the market cap would be around $137 trillion. As a comparison, global GDP is under $90 trillion. I don't even feel like doing the math for BTC's current price. They'd have to start burning coins like crazy to even reach those prices.\n\nRemember (for anybody wondering about the coin/token price), always look at market cap. Prices themselves don't matter really, you should focus on market cap. If ADA eventually reaches ETH's market cap, that means you will 7x your money at current prices. If it reaches BTC, that means you will 16x your money. That's a very good return in either case.", "created_utc": "1635213603.0", "edited": "False", "id": "hi2beu8", "is_submitter": "False", "link_id": "t3_qf9v8n", "parent_id": "t1_hi1t587", "score": "1", "subreddit": "cardano", "subreddit_id": "t5_3jns3"}, {"author": "mid83", "body": "While Cramer isn't somebody I listen to on practically anything, it's even more important to ignore people who obviously don't understand the technology. \n\nI can speak for myself as somebody who is new to crypto, even just taking time to gain a surface level understanding of cypto/blockchain, the differences between PoW and PoS, the possible use cases for BTC (which is brilliantly explained in The Bitcoin Standard), and other things that can be picked by a non technical person as myself, makes a huge difference in how you perceive crypto overall.", "created_utc": "1635212385.0", "edited": "False", "id": "hi28shk", "is_submitter": "False", "link_id": "t3_qf66he", "parent_id": "t3_qf66he", "score": "1", "subreddit": "CryptoCurrency", "subreddit_id": "t5_2wlj3"}, {"author": "mid83", "body": "Is there a crypto game that doesn't require you to buy an NFT (or multiple NFTs) or invest in a coin/token before playing? I don't want to have to spend dozens or hundreds of dollars on an unproven token or some random NFTs before I can even attempt to see if the game would be worth the investment.", "created_utc": "1635177522.0", "edited": "False", "id": "hhzyp3b", "is_submitter": "False", "link_id": "t3_qewsjb", "parent_id": "t3_qewsjb", "score": "2", "subreddit": "CryptoCurrency", "subreddit_id": "t5_2wlj3"}, {"author": "mid83", "body": "Why not just diversify into both (or add some ETH as well)? I can’t pretend to time the market so I just DCA into whatever projects I’m bullish on. I’m not just picking one.", "created_utc": "1635038647.0", "edited": "False", "id": "hht57if", "is_submitter": "False", "link_id": "t3_qdwbjw", "parent_id": "t3_qdwbjw", "score": "2", "subreddit": "cardano", "subreddit_id": "t5_3jns3"}, {"author": "mid83", "body": "Thanks! I will check out those resources", "created_utc": "1634613779.0", "edited": "False", "id": "hh6wq0n", "is_submitter": "True", "link_id": "t3_qb2nvq", "parent_id": "t1_hh6w79d", "score": "1", "subreddit": "CryptoCurrency", "subreddit_id": "t5_2wlj3"}, {"author": "mid83", "body": "It seems to me that white papers are much more relevant and useful if you are looking at new small cap tokens that are just getting started. I imagine the usefulness of the white paper becomes less and less relevant the longer the token has been on the market unless it's been updated (which it sounds like most projects don't). As the OP states, the actual documentation (when it is there) is usually far more comprehensive and informative.", "created_utc": "1634613470.0", "edited": "False", "id": "hh6w4dd", "is_submitter": "False", "link_id": "t3_qb2j0p", "parent_id": "t3_qb2j0p", "score": "15", "subreddit": "CryptoCurrency", "subreddit_id": "t5_2wlj3"}, {"author": "mid83", "body": "So I’m thinking about getting the 14” MBP. I have a 13” MBP from 2016 that is slow with a bad battery so it’s time for an upgrade. The majority of my use is general stuff that would lead me to get a M1 Air, but I’m also learning programming   (would like to eventually develop for iOS at least). I also really want the new display, additional ports, and mag safe. \n\nAll of that said I’m trying to configure my order and I’m trying to decide between 16 gb and 32 gb of memory for the 10 core cpu/14 core gpu. I’d like to have this last at least 5 years and avoid how slow my current MBP is before my next update. Any advice?", "created_utc": "1634601349.0", "edited": "False", "id": "hh67df0", "is_submitter": "False", "link_id": "t3_qajk1r", "parent_id": "t3_qajk1r", "score": "2", "subreddit": "apple", "subreddit_id": "t5_2qh1f"}, {"author": "mid83", "body": "All things held equal, burning should be a net positive for token holders. It’s better than increasing supply.", "created_utc": "1634426554.0", "edited": "False", "id": "hgx3my3", "is_submitter": "False", "link_id": "t3_q9m3dk", "parent_id": "t3_q9m3dk", "score": "2", "subreddit": "SHIBArmy", "subreddit_id": "t5_2y15qk"}, {"author": "mid83", "body": "I'm pumped as hell about the new MacBook Pros. I had just gotten to the point where I feel like I need to replace my current laptop and was prepared to wait until 2022 sometime if needed.\n\nHopefully shipping times aren't horrible given all the supply chain issues right now.", "created_utc": "1634177233.0", "edited": "False", "id": "hgk9bvp", "is_submitter": "False", "link_id": "t3_q7ht5b", "parent_id": "t3_q7ht5b", "score": "13", "subreddit": "apple", "subreddit_id": "t5_2qh1f"}, {"author": "mid83", "body": "Are there any good gacha games that are more about building up a single character vs the typical team building aspect? In other words, a game where you are farming gear/skills vs new team members. I imagine Diablo Immortal will scratch that itch whenever it eventually comes out, but I'd like something in the meantime. \n\nMy main requirement is that it's a game that doesn't completely block progression if you are f2p (in other words you leveling past a certain point becomes nearly impossible without paying). I don't care about competing in PVP or being competitive with other players ranking wise. I just like seeing my character slowly \nprogress with bigger and better gear and skills.", "created_utc": "1633329141.0", "edited": "False", "id": "hfbndv4", "is_submitter": "False", "link_id": "t3_pzz0mu", "parent_id": "t3_pzz0mu", "score": "1", "subreddit": "gachagaming", "subreddit_id": "t5_3l98x"}, {"author": "mid83", "body": "I understand the concerns and share many of them as well. It's the biggest reason I'm looking at options with my subscription expiring soon.\n\nWith that said, I'll still take Surfshark right now over others like Nord (with known breaches and various other scandals) and the fact that Express is owned by Kape (not to mention the long running rumor that Express was actually Hong Kong based).\n\nI think Surfshark is probably fine for general use, streaming and so on. In regards to torrents and other \"activities\" I'd probably find a more privacy based service.", "created_utc": "1632441941.0", "edited": "False", "id": "he12s7s", "is_submitter": "False", "link_id": "t3_ptyqzp", "parent_id": "t3_ptyqzp", "score": "7", "subreddit": "surfshark", "subreddit_id": "t5_kpmej"}, {"author": "mid83", "body": "Is rerolling necessary to progress and enjoy the game?", "created_utc": "1632020647.0", "edited": "False", "id": "hdf0yr6", "is_submitter": "False", "link_id": "t3_pqj03l", "parent_id": "t3_pqj03l", "score": "0", "subreddit": "Genshin_Impact", "subreddit_id": "t5_12p4l2"}, {"author": "mid83", "body": "It looks like studies are showing that protection from infection starts to drop off after around 6-7 months, hence why they are saying boosters are recommended at 8 months. I saw some epidemiologists saying that the booster should give you a large increase in protection in comparison to being fully vaccinated with 2 doses, so hopefully after the booster, protection lasts longer than 8 months. \n\nDo keep in mind that it looks like protection from severe disease remains very high up to the point (which is the most important aspect in my opinion).", "created_utc": "1630083841.0", "edited": "False", "id": "haku11l", "is_submitter": "True", "link_id": "t3_pchlvl", "parent_id": "t1_hakmsmq", "score": "3", "subreddit": "COVID19positive", "subreddit_id": "t5_2hnraa"}, {"author": "mid83", "body": "Delta is no joke in terms of how transmittable it is. I have a couple groups of family that were likely exposed at family/friend get togethers, and entire homes ended up testing positive no matter vaccination status. The constant thing is that vaccinated people I know have done overwhelming better than unvaccinated. It's also something we are seeing in the hospital as well (over 90% of hospitalized patients, even higher in the ICU, are unvaccinated). \n\nHopefully the boosters will help in terms of actually preventing infection.", "created_utc": "1630080052.0", "edited": "False", "id": "hakkg87", "is_submitter": "True", "link_id": "t3_pchlvl", "parent_id": "t1_hak8g6x", "score": "3", "subreddit": "COVID19positive", "subreddit_id": "t5_2hnraa"}, {"author": "mid83", "body": "I'm assuming sometime in the prior week. I work in healthcare so it could very much have been a work exposure. Then again, I live in the south so delta is running rampant down here. It could have been anywhere.", "created_utc": "1630079850.0", "edited": "False", "id": "hakjxiu", "is_submitter": "True", "link_id": "t3_pchlvl", "parent_id": "t1_hak7z1r", "score": "6", "subreddit": "COVID19positive", "subreddit_id": "t5_2hnraa"}, {"author": "mid83", "body": "Keep your head up! I know it's tough. I work in healthcare and have seen COVID rear it's ugly head up close. I was pretty nervous when I first tested positive knowing how things turn out in severe cases, but I had to remind myself that the overwhelming majority of cases do not turn out to be severe (even pre vaccine). That helped me keep a level head and positive mindset. \n\nThanks for the advice on exercise. I have been planning on doing something light this weekend to see how I feel but maybe I'll hold off for a bit longer. It's frustrating because I had just gotten into a good routine of diet and exercise prior to getting COVID, but a couple weeks isn't that big of a deal to ensure all is well.", "created_utc": "1630079766.0", "edited": "False", "id": "hakjppo", "is_submitter": "True", "link_id": "t3_pchlvl", "parent_id": "t1_haj3633", "score": "1", "subreddit": "COVID19positive", "subreddit_id": "t5_2hnraa"}, {"author": "mid83", "body": "I received my 2nd dose of the Pfizer vaccine in February. So it's been around 6.5 months since I've been fully vaccinated.", "created_utc": "1630079420.0", "edited": "False", "id": "hakitg9", "is_submitter": "True", "link_id": "t3_pchlvl", "parent_id": "t1_haj0fa5", "score": "2", "subreddit": "COVID19positive", "subreddit_id": "t5_2hnraa"}, {"author": "mid83", "body": "I haven't really done much exercise since I tested positive. I plan on trying to do a workout this weekend to see how I feel.", "created_utc": "1630079341.0", "edited": "False", "id": "hakim5u", "is_submitter": "True", "link_id": "t3_pchlvl", "parent_id": "t1_haj3ovw", "score": "2", "subreddit": "COVID19positive", "subreddit_id": "t5_2hnraa"}, {"author": "mid83", "body": "I forgot that I also was taking 12 hour Sudafed. That completely cleared up my congestion in a couple days.", "created_utc": "1630079193.0", "edited": "False", "id": "haki8r1", "is_submitter": "True", "link_id": "t3_pchlvl", "parent_id": "t1_haj3wmg", "score": "2", "subreddit": "COVID19positive", "subreddit_id": "t5_2hnraa"}, {"author": "mid83", "body": "Stating what the latest model runs are showing isn’t fear porn.", "created_utc": "1629911431.0", "edited": "False", "id": "habcf03", "is_submitter": "False", "link_id": "t3_pba42c", "parent_id": "t1_hab9sg9", "score": "-2", "subreddit": "houston", "subreddit_id": "t5_2qj1l"}, {"author": "mid83", "body": "I feel just I did last year days out from Laura’s landfall when the models started to center in on TX/LA. \n\nIt seems like this is going to be a nailbiter and by the time we get a clearer idea of what will happen, we could be a couple days away from landfall.", "created_utc": "1629909380.0", "edited": "False", "id": "hab79cl", "is_submitter": "False", "link_id": "t3_pba42c", "parent_id": "t3_pba42c", "score": "19", "subreddit": "houston", "subreddit_id": "t5_2qj1l"}, {"author": "mid83", "body": "What a hell of a year. My god", "created_utc": "1600443407.0", "edited": "False", "id": "g5pluj7", "is_submitter": "False", "link_id": "t3_iv66qh", "parent_id": "t3_iv66qh", "score": "0", "subreddit": "houston", "subreddit_id": "t5_2qj1l"}, {"author": "mid83", "body": "My god this season is pathetic. That episode tonight and the events of the past few days really seal the deal. \n\nDay and Bay are awful players. Day can’t keep her mouth shut and Bay is quick to take everything personal and act condescending to people like Kaysar who were actually looking out for her. Of course their competition performance, especially in the veto, was pathetic. Yet, despite this, they want to act as if racism is why they were nominated? Get the fuck outta here, and the same goes for all the lunatics on here and Twitter pushing this narrative that either Day and Bay are only going home over their race. \n\nTyler and Nicole are pathetic as well. Giving up that $5k and Tyler’s whole back door attempt screamed that both are worried about their social media presence as a result of the show. \n\nPathetic all around.", "created_utc": "1599714932.0", "edited": "False", "id": "g4mkiol", "is_submitter": "False", "link_id": "t3_ipt90l", "parent_id": "t3_ipt90l", "score": "1", "subreddit": "BigBrother", "subreddit_id": "t5_2r4zz"}, {"author": "mid83", "body": "Nicole is awful. What a whiny coward.", "created_utc": "1598580364.0", "edited": "False", "id": "g33b9uc", "is_submitter": "False", "link_id": "t3_ihxhqi", "parent_id": "t3_ihxhqi", "score": "38", "subreddit": "BigBrother", "subreddit_id": "t5_2r4zz"}, {"author": "mid83", "body": "Basically the operational run of a model is one without any changes to the initial data they dump into the model. It's also higher resolution. Ensembles are lower resolution runs where they make slight changes to the initial data, hence why they tend to be more spread out. Ideally, the average of the ensembles and the operational models should be coming into agreement by now, which hasn't really happened with Laura unfortunately, hence the concern about where she will eventually go.", "created_utc": "1598381082.0", "edited": "False", "id": "g2tv5p2", "is_submitter": "False", "link_id": "t3_idyj9o", "parent_id": "t1_g2tizuh", "score": "3", "subreddit": "houston", "subreddit_id": "t5_2qj1l"}, {"author": "mid83", "body": "I left a day in a half after Ike to stay with family for a week. It shouldn’t be a big deal depending on where you live due to road closures etc. Of course you could be trapped for a bit hence why it’s important to have food and water to last you a week at least.", "created_utc": "1598371701.0", "edited": "False", "id": "g2tasgy", "is_submitter": "False", "link_id": "t3_idyj9o", "parent_id": "t1_g2t9dp4", "score": "7", "subreddit": "houston", "subreddit_id": "t5_2qj1l"}, {"author": "mid83", "body": "For a while now it’s been a battle between the operational models and ensemble models runs. The operational models point closer to the TX/LA border except the EURO (arguably the best global model despite not being as accurate this year). The EURO and the ensembles (which are more of a spread of various modeled scenario) point to a more of a Western landfall putting Houston more at risk. \n\nIt seems like the NHC is sticking with the operation models more for whatever reason. Some more conspiratorial minded people think it is intentional to avoid outright pandemonium in Houston. For anybody that remembers the Rita evacuation, it was a complete shitshow. Dozens died as a result of the evacuation alone and thousands were stranded on the freeways when Rita hit. Thank god Rita made an eastern turn and avoided a direct Houston hit because there is no telling how many deaths would have resulted from the people stuck on the road. So in any case, it’s not out of the realm of possibility that not panicking 7 million people 36 hours out might play a role in the forecast.", "created_utc": "1598371009.0", "edited": "False", "id": "g2t90z6", "is_submitter": "False", "link_id": "t3_idyj9o", "parent_id": "t1_g2t6zk6", "score": "20", "subreddit": "houston", "subreddit_id": "t5_2qj1l"}, {"author": "mid83", "body": "The storm is moving pretty fast, which means stronger winds will be felt inland compared to a slower moving storm.", "created_utc": "1598368173.0", "edited": "False", "id": "g2t291u", "is_submitter": "False", "link_id": "t3_idyj9o", "parent_id": "t1_g2t1qim", "score": "5", "subreddit": "houston", "subreddit_id": "t5_2qj1l"}, {"author": "mid83", "body": "Recent model runs include the UKMET, EURO, and HMON hitting anywhere from west of Freeport to basically Galveston Island as a category 3 minimum. There are some that also hit SW Louisiana but yeah, if anybody in the Houston area isn’t taking this serious, it’s time.", "created_utc": "1598272188.0", "edited": "False", "id": "g2oo5jk", "is_submitter": "False", "link_id": "t3_idyj9o", "parent_id": "t1_g2onrjm", "score": "16", "subreddit": "houston", "subreddit_id": "t5_2qj1l"}, {"author": "mid83", "body": "I think it was based on the Euro and CMC showing central/eastern Louisiana landfall and the NHC tried to split the difference. Given both models shifted west, especially the Euro (with a huge shift from eastern LA to the TX/LA border), I imagine the track will be moved west at the next advisory at 4 am our time. Also, I think the UKMET shifted pretty far west to between Matagorda and Freeport. \n\nI have a feeling this storm is going to hit between Freeport and SW Louisiana. Houston is very much in play right now.", "created_utc": "1598253329.0", "edited": "False", "id": "g2o4aui", "is_submitter": "False", "link_id": "t3_idyj9o", "parent_id": "t1_g2nzby2", "score": "2", "subreddit": "houston", "subreddit_id": "t5_2qj1l"}, {"author": "mid83", "body": "Unless something unexpected happens over the next day or so, it does seem more and more likely that we are very much in the mix for seeing effects from this storm. \n\nI recommend everybody take today to ensure you are prepared, the earlier the better. Even though there is a lot of uncertainty still, we are only days from potential landfall (Thursday/Friday). That means that watches/warnings will start being issued sooner rather than later (maybe even tomorrow) and evacuations will need to start to ensure everybody in evacuation zones can get out safely. Once that stuff starts, it's going to get very chaotic very fast. \n\nGet what you need, especially essentials like medications, today if at all possible. Get your materials to board up or tie down loose objects outside and try to get that done if you can. Be sure you have an evacuation plan if you are in an evacuation zone. \n\nDoing all of this today before panic sets in with the wider population (thus stores are packed and chaotic) will be far less stressful, and it will make a huge difference in your mental, emotional, and physical health as the storm approaches this week.  Worrying about an incoming  hurricane is stressful enough. The last thing you want to is to be driving around town trying to get essentials among everybody else who is just as stressed and scared.\n\nWe will get through this everybody!", "created_utc": "1598194237.0", "edited": "False", "id": "g2l73p8", "is_submitter": "False", "link_id": "t3_idyj9o", "parent_id": "t3_idyj9o", "score": "24", "subreddit": "houston", "subreddit_id": "t5_2qj1l"}, {"author": "mid83", "body": "It sounds like the potential is there for a strong storm from what I’ve seen from some professional meteorologists. Apparently conditions will be ripe for strengthening once it hits the Gulf.  \n\nSpecific to your question, given how hard it is for models for predict intensity, the specific numbers aren’t as important as the trends. I think one of the many things that is making people nervous is that if the Euro and GFS are showing a major hurricane, then that is something to pay attention to since they often don’t project storms to be as strong. \n\nI don’t think we can count out anything at this point. Hopefully Laura doesn’t end up being as strong but the models are currently lining up behind the idea that it will be.\n\nEdit: Also keep in mind things are fluid and maybe (hopefully) future model runs will dial down the intensity and move it away from us.", "created_utc": "1598172340.0", "edited": "False", "id": "g2keaca", "is_submitter": "False", "link_id": "t3_idyj9o", "parent_id": "t1_g2kc7l7", "score": "8", "subreddit": "houston", "subreddit_id": "t5_2qj1l"}, {"author": "mid83", "body": "Looks like the latest runs of the EURO, UKMET, and GFS all show landfall around the Houston area. I also believe all three project a major hurricane (at least a Cat 3). This is also significant given the EURO and GFS tend to under estimate intensity. \n\nIt is just one model run so I don’t expect us to be in the bullseye of the NHC track just yet, but I do imagine we will see a western shift on the next advisory at 4 am, including Houston in the cone again. I also wouldn’t be suprised if the NHC increases the intensity forecast at 4 am.", "created_utc": "1598165776.0", "edited": "False", "id": "g2k7xh5", "is_submitter": "False", "link_id": "t3_idyj9o", "parent_id": "t3_idyj9o", "score": "28", "subreddit": "houston", "subreddit_id": "t5_2qj1l"}, {"author": "mid83", "body": "Yeah the 0z models pretty much have SE Texas in the bullseye. UKMET, GFS, and EURO all have a major hurricane hitting around the Houston metro.", "created_utc": "1598165309.0", "edited": "False", "id": "g2k7frs", "is_submitter": "False", "link_id": "t3_idx4fv", "parent_id": "t1_g2k45mt", "score": "11", "subreddit": "TropicalWeather", "subreddit_id": "t5_2sue1"}, {"author": "mid83", "body": "I know it’s just one set of models, but wow these 0z runs are downright scary for those of us here in SE Texas.", "created_utc": "1598159836.0", "edited": "False", "id": "g2k1ajn", "is_submitter": "False", "link_id": "t3_idx4fv", "parent_id": "t3_idx4fv", "score": "21", "subreddit": "TropicalWeather", "subreddit_id": "t5_2sue1"}, {"author": "mid83", "body": "The models that come out now won’t be incorporated in the NHC forecast until the 5 am advisory. \n\nI wouldn’t be surprised if the NHC track moves slightly west at 5 am and includes Houston in the cone again.", "created_utc": "1598159305.0", "edited": "False", "id": "g2k0n6r", "is_submitter": "False", "link_id": "t3_idyj9o", "parent_id": "t1_g2jxj9w", "score": "5", "subreddit": "houston", "subreddit_id": "t5_2qj1l"}, {"author": "mid83", "body": "I don’t think we should write anything off given how crazy the models have been for these systems. \n\nWith that said, it does seem like the models are in agreement that Marco will go east of us, but there are some model runs that have it making a last minute turn and going due west off the LA coast. Thankfully it shouldn’t be very strong and thus far, we aren’t hearing anything regarding stalls or Harvey/Imelda type rain totals. \n\nIn terms of Laura, it’s up in the air. There has been talk tonight of the center of circulation possibly being more south than expected, which would lead to a more western track (check out Space City Weather’s latest post for details. Also, the latest GFS model run shows a pretty big western shift to Bolivar/Chambers County. Of course these model runs will likely continue to bounce back and worth. I don’t think we will start to see a clear picture of where Laura goes until she clears the islands in the next couple days. \n\nSo please, stay aware.", "created_utc": "1598156067.0", "edited": "False", "id": "g2jwg3f", "is_submitter": "False", "link_id": "t3_idyj9o", "parent_id": "t1_g2jillq", "score": "4", "subreddit": "houston", "subreddit_id": "t5_2qj1l"}, {"author": "mid83", "body": "I don’t understand the people who always like to mock people who are prepared. Those same people are likely the ones who are desperate for help when a storm does end up hitting. \n\nIn any case, it’s way too early for gloating. Forecasting these two storms has been extremely difficult. In the past 24-36 hours we have seen Laura’s track shift far to the west. Even this afternoon lots of Euro ensembles show a Texas landfall. It’s likely we will continue to see the track shift more. There is lots of uncertainty until we figure out how Laura interacts with the islands, which will have big implications for the eventual track in the GOM. Right now, models are just guessing if Laura goes north/south or directly over the islands. \n\nMarco also saw a major shift today to the east. With that said, some model runs are still showing Marco riding the LA coast west into SE Tx. Thankfully the expectation is that Marco won’t be a strong storm, but of course there is a flooding threat. \n\nAnyways, the point is this is still a very fluid situation. Lots of things can change and as we have seen in the past day in a half, the track for both of these storms can have huge shifts in a rather short about of time.", "created_utc": "1598141436.0", "edited": "False", "id": "g2j8tet", "is_submitter": "False", "link_id": "t3_idyj9o", "parent_id": "t3_idyj9o", "score": "43", "subreddit": "houston", "subreddit_id": "t5_2qj1l"}, {"author": "mid83", "body": "Please stay vigilant. We are not out of the woods with Laura. There is a long way to go and things can and likely will continue to change as we see how Laura navigates Hispanola/Cuba.", "created_utc": "1598134288.0", "edited": "False", "id": "g2iw7uw", "is_submitter": "False", "link_id": "t3_idyj9o", "parent_id": "t3_idyj9o", "score": "28", "subreddit": "houston", "subreddit_id": "t5_2qj1l"}, {"author": "mid83", "body": "You can see the models at tropicaltidbits.com", "created_utc": "1598113938.0", "edited": "False", "id": "g2hlugi", "is_submitter": "False", "link_id": "t3_idyj9o", "parent_id": "t1_g2hl4iq", "score": "1", "subreddit": "houston", "subreddit_id": "t5_2qj1l"}, {"author": "mid83", "body": "The flip flopping continues. The GFS that just ran had a large shift to the east with both storms hitting central/eastern Louisiana. The Euro overnight also showed a pretty drastic eastern shift for Marco into LA and had Laura come in with a similar landfall location a few days later as well. \n\nI don't envy the NHC and other professional meteorologists along with government officials and business leaders who are trying to make sense of all this. \n\nKeep on your toes everyone.", "created_utc": "1598112451.0", "edited": "1598112661.0", "id": "g2hhzss", "is_submitter": "False", "link_id": "t3_idyj9o", "parent_id": "t3_idyj9o", "score": "15", "subreddit": "houston", "subreddit_id": "t5_2qj1l"}, {"author": "mid83", "body": "To be honest it's the flooding that is making my wife and I want to leave. I've been here since 2005 and the flooding has gotten exponentially worse since 2015. Seeing street flooding for the first time in my neighborhood from Imelda despite never seeing that during Harvey (we have a TON of construction going on around us...which likely is the main cause) has me convinced it's only a matter of time until we flood.", "created_utc": "1598078224.0", "edited": "False", "id": "g2f9tz1", "is_submitter": "False", "link_id": "t3_idyj9o", "parent_id": "t1_g2ev2s8", "score": "14", "subreddit": "houston", "subreddit_id": "t5_2qj1l"}, {"author": "mid83", "body": "Latest HCOM model run has a Category 3 hitting Galveston.", "created_utc": "1598076219.0", "edited": "False", "id": "g2f4y7n", "is_submitter": "False", "link_id": "t3_idyj9o", "parent_id": "t3_idyj9o", "score": "19", "subreddit": "houston", "subreddit_id": "t5_2qj1l"}, {"author": "mid83", "body": "Latest GFS model run shows Laura hitting the Beaumont area as a possible major hurricane.", "created_utc": "1598069728.0", "edited": "False", "id": "g2ep4b2", "is_submitter": "False", "link_id": "t3_idyj9o", "parent_id": "t3_idyj9o", "score": "11", "subreddit": "houston", "subreddit_id": "t5_2qj1l"}, {"author": "mid83", "body": "Recent model runs show Laura getting up to Cat 2/3. Most recent GFS has it as a Cat 2/3 hitting around Lake Charles. Another model had it near LA as a cat 4/5 (granted apparently the model is known for overdoing intensity). Who knows what happens, but I think people need to pay attention to Laura.", "created_utc": "1598050979.0", "edited": "False", "id": "g2dl4bm", "is_submitter": "False", "link_id": "t3_idyj9o", "parent_id": "t1_g2djdxz", "score": "13", "subreddit": "houston", "subreddit_id": "t5_2qj1l"}, {"author": "mid83", "body": "Apparently the 18z GFS has Laura hitting SW LA as a possible Cat 3.", "created_utc": "1598049568.0", "edited": "False", "id": "g2dikpx", "is_submitter": "False", "link_id": "t3_idyj9o", "parent_id": "t3_idyj9o", "score": "2", "subreddit": "houston", "subreddit_id": "t5_2qj1l"}, {"author": "mid83", "body": "Seems like Laura’s model runs are pulling it more westward with LA in the crosshairs. For some reason Laura is giving me more anxiety than TD14.", "created_utc": "1598040383.0", "edited": "False", "id": "g2d0u2t", "is_submitter": "False", "link_id": "t3_idyj9o", "parent_id": "t3_idyj9o", "score": "9", "subreddit": "houston", "subreddit_id": "t5_2qj1l"}, {"author": "mid83", "body": "Any recommendations for specific textbooks to look at? I've seen Dunne's text recommended but I 'm wondering if there are others I should look at as well.", "created_utc": "1597285915.0", "edited": "False", "id": "g1abpdp", "is_submitter": "True", "link_id": "t3_i85jhl", "parent_id": "t1_g1abj1z", "score": "1", "subreddit": "IRstudies", "subreddit_id": "t5_2s8z8"}, {"author": "mid83", "body": "How do you keep up with academic papers of interest? I've found some super interesting papers primarily through the footnotes of books I've read. Are there any journals you specifically keep up with? My local library has a pretty good selection of full text academic journals given they are at least a year old.", "created_utc": "1597248008.0", "edited": "False", "id": "g184bg4", "is_submitter": "True", "link_id": "t3_i85iji", "parent_id": "t1_g180mva", "score": "1", "subreddit": "geopolitics", "subreddit_id": "t5_2qhnn"}, {"author": "mid83", "body": "Couple things \n\n1.) All the areas you list are having much worse outbreaks vs Texas. New Orleans at one point was probably the worse hit area per capita outside NYC (not sure if this is still the case). It’s not an apples to apples comparison. \n\n2.) States and even local jurisdictions aren’t reporting things the same way, which makes broad assumptions and comparisons like you are trying to do difficult. Yes, Texas has low testing per capita but hospitals are far from being overrun. Deaths are hard to hide and there is no evidence that Texas is having a spike in deaths they are covering up by coding them with some other death reason. \n\n3.) A doctor I follow on social media provides lots of info daily on covid and he says that Texas numbers are starting to include antibody testing results, which means we will be seeing spikes in case numbers for recovered cases since people who were not tested for covid who do show antibodies would count as a covid case but be listed as recovered. I assume other states are or will do the same at some point. \n\nTo summarize, there is no evidence of some sort of conspiracy or attempt to hide the true number of serious cases in TX. Hospital data doesn’t show that at all and you are comparing to areas with far worse outbreaks than TX.", "created_utc": "1588047104.0", "edited": "False", "id": "fot8hzc", "is_submitter": "False", "link_id": "t3_g9g18k", "parent_id": "t3_g9g18k", "score": "8", "subreddit": "CoronaVirusTX", "subreddit_id": "t5_2gqqnp"}, {"author": "mid83", "body": "Not even close. Many hospitals have a low census right now which is a mix of the stopping of elective procedures (which most hospitals are going to start slowly phasing back in soon), less people going to the ER due to fear of exposure, and a lack of a surge in Texas. \n\nIn fact many nurses and other medical professionals are furloughed right now due to the lack of elective procedures for those people who work in those areas. Even for hospital staff, lots of staff are losing hours due to hospital staffing being reduced due to a low number of patients currently in hospitals. \n\nSo while there are many people who have or had COVID-19 who haven’t been tested, there currently isn’t a flood is severe cases here in Texas.", "created_utc": "1588045837.0", "edited": "False", "id": "fot6muf", "is_submitter": "False", "link_id": "t3_g98w1u", "parent_id": "t1_fot5p7e", "score": "13", "subreddit": "CoronaVirusTX", "subreddit_id": "t5_2gqqnp"}, {"author": "mid83", "body": "Just curious, how long do people want businesses closed? Until a vaccine is ready in 12-18 months (which is the ultimate best case scenario...could be much longer if ever completed)? \n\nI understand the fear and concern but we also can’t keep things shut down for months on end. It’s not feasible. \n\nI know I’ll likely get downvoted quickly but I’m hopeful for some honest answers before my comment is hidden.", "created_utc": "1588018599.0", "edited": "False", "id": "foru8ew", "is_submitter": "False", "link_id": "t3_g97l5j", "parent_id": "t3_g97l5j", "score": "7", "subreddit": "CoronaVirusTX", "subreddit_id": "t5_2gqqnp"}, {"author": "mid83", "body": "How's the HDR/Dolby Vision look?\n\nI'm driving myself nuts trying to choose, but the more I think about it, I always seem to come back to the 950G with the HDR/blooming improvements from the 900F and the inclusion of Dolby Vision vs any Samsung TV (plus Samsung models seem to be priced higher for equivalent models). Finally, the upscaling is necessary for me since I'm a big sports fan and we still use cable (especially my wife). \n\nAs long as the wide viewing angle stuff on the 75\" doesn't destroy picture quality, it seems like the best option for the size I want.", "created_utc": "1576426590.0", "edited": "False", "id": "fb0jf3k", "is_submitter": "True", "link_id": "t3_eazprk", "parent_id": "t1_fb0gypt", "score": "2", "subreddit": "bravia", "subreddit_id": "t5_3bqx2"}, {"author": "mid83", "body": "This is why I am very selective about what I do in my personal life outside of work. I have plenty of “normal” hobbies, like being a huge sports fan, which makes it easy to socialize with coworkers, but I keep my “nerdy” side to myself. It makes life much easier.", "created_utc": "1554804001.0", "edited": "False", "id": "ekgibqm", "is_submitter": "False", "link_id": "t3_b3651z", "parent_id": "t3_b3651z", "score": "1", "subreddit": "learnmath", "subreddit_id": "t5_2rdi4"}, {"author": "mid83", "body": "To be honest I'm not sure I want to pay for another degree that I'd likely not use given I already have two bachelors degrees in unrelated fields and work in health care (I don't expect to leave that industry anytime soon).\n\nI don't mind paying for books and while I wouldn't mind having structured lectures to follow, I'm not sure I can justify all the extra fees and tuition in that case. It's not a bad idea since you would actually get some sort of official proof of what you have studied, but it doesn't come cheap unfortunately.   ", "created_utc": "1554571711.0", "edited": "False", "id": "ek9cire", "is_submitter": "True", "link_id": "t3_ba00a4", "parent_id": "t1_ek9b4g5", "score": "1", "subreddit": "learnmath", "subreddit_id": "t5_2rdi4"}, {"author": "mid83", "body": "Thanks for the advice! I didn't think about that but that is a good idea. I'm going to base my textbooks on what's being used at various universities I look up, so I'll make sure to use a book with a syllabus that gives me some direction on what topics to study in what order. \n ", "created_utc": "1554556087.0", "edited": "False", "id": "ek8to4p", "is_submitter": "True", "link_id": "t3_ba00a4", "parent_id": "t1_ek8rl22", "score": "3", "subreddit": "learnmath", "subreddit_id": "t5_2rdi4"}, {"author": "mid83", "body": "I appreciate the advice! I absolutely intend to work on practice problems. It's the part of math I've always enjoyed, even back in my undergrad years even though I only took finite math and business math with some basic calculus thrown in. \n\nWhile reading and listening to lectures is goos, the real fun for me is tackling the problems and working through them. ", "created_utc": "1554555887.0", "edited": "False", "id": "ek8thwj", "is_submitter": "True", "link_id": "t3_ba00a4", "parent_id": "t1_ek88o9v", "score": "1", "subreddit": "learnmath", "subreddit_id": "t5_2rdi4"}, {"author": "mid83", "body": "Ban user immediately ", "created_utc": "1553992325.0", "edited": "False", "id": "ejruz4i", "is_submitter": "False", "link_id": "t3_b79o6d", "parent_id": "t1_ejrut8z", "score": "6", "subreddit": "Astros", "subreddit_id": "t5_2s6y7"}, {"author": "mid83", "body": "Thanks! Any recommendations on what journals to look into? I didn’t see any listed in the recommendations here. ", "created_utc": "1547790981.0", "edited": "False", "id": "eec1tvc", "is_submitter": "True", "link_id": "t3_agt29i", "parent_id": "t1_ee8uap4", "score": "1", "subreddit": "AskHistorians", "subreddit_id": "t5_2ssp3"}, {"author": "mid83", "body": "Thanks! Any recommendations on what journals to look into? I didn’t see any listed in the recommendations here or on AskHistorians. ", "created_utc": "1547790641.0", "edited": "False", "id": "eec1iaq", "is_submitter": "True", "link_id": "t3_agt2kg", "parent_id": "t1_ee9r2is", "score": "1", "subreddit": "history", "subreddit_id": "t5_2qh53"}, {"author": "mid83", "body": "Thanks! Any recommendations on what journals to look into? I didn’t see any listed in the recommendations here or on AskHistorians. ", "created_utc": "1547790632.0", "edited": "False", "id": "eec1hxy", "is_submitter": "True", "link_id": "t3_agt2kg", "parent_id": "t1_eebnk0j", "score": "1", "subreddit": "history", "subreddit_id": "t5_2qh53"}, {"author": "mid83", "body": "Brett for AFP!!", "created_utc": "1534473874.0", "edited": "False", "id": "e4byqut", "is_submitter": "False", "link_id": "t3_97yclr", "parent_id": "t3_97yclr", "score": "24", "subreddit": "BigBrother", "subreddit_id": "t5_2r4zz"}, {"author": "mid83", "body": "Did you do anything in between to improve your skills that helped the second time?", "created_utc": "1511096650.0", "edited": "False", "id": "dq1k86e", "is_submitter": "True", "link_id": "t3_7dzjq5", "parent_id": "t1_dq1jkom", "score": "1", "subreddit": "cs50", "subreddit_id": "t5_2s3yg"}, {"author": "mid83", "body": "To be honest my biggest concern is the physical effects of years of bedside nursing. I work ICU, and while I enjoy taking care of extremely sick and complicated patients, ICU nursing includes lots of heavy moving and lifting. It can't think of a coworker in the ICU i work in with more than 5-10 years experience that isn't suffering from sort of physical ailment, mostly bad backs or joints (knees/shoulders). \n\nFinancially, this move may be a net negative for me at first because nurses in Houston get paid pretty well, plus the opportunity for overtime pay, but like I said, the physical effects are a huge concern. I'm not sure I'd be happy with any of the non-bedside options (case management, nursing management etc...). Even informatics seems pretty limiting, and from the informatics nurses I've spoken to, lots of them aren't doing a lot of actual tech work (mostly helping design EMR nursing workflows and training nurses on EMR changes). \n\nI don't think I'd care for being a midlevel provider either (CRNA or nurse practitioner). ", "created_utc": "1510416243.0", "edited": "False", "id": "dpo29yv", "is_submitter": "True", "link_id": "t3_7bt1j8", "parent_id": "t1_dpl581a", "score": "1", "subreddit": "OSUOnlineCS", "subreddit_id": "t5_34oss"}]