[{"author": "MinimumCompetition85", "body": "Of course they would get hung up on his exaxct words...fact is, we all know what he meant and there is clear data out as to how much property damage was done because of these \"mostly peaceful protests\"..so they are saying it didn't happen or that it didn't matter? And there is no group known as Antifa? what planet are they living on?", "created_utc": "1666957523.0", "edited": "False", "id": "iu3z918", "is_submitter": "False", "link_id": "t3_yfav3r", "parent_id": "t3_yfav3r", "score": "1", "subreddit": "Conservative", "subreddit_id": "t5_2qh6p"}, {"author": "MinimumCompetition85", "body": "Thanks! I will definitely leave the company. Another colleague just left recenlty, it's like leaving the sinking ship here...", "created_utc": "1666956493.0", "edited": "False", "id": "iu3xkwk", "is_submitter": "True", "link_id": "t3_wrl79l", "parent_id": "t1_itmwgm3", "score": "1", "subreddit": "hatemyjob", "subreddit_id": "t5_2t80c"}, {"author": "MinimumCompetition85", "body": "Many years ago, I said to myself that I am a \"quality over quantity\" kind of guy, meaning that I'd rather speak a small number of languages very well, instead of butchering a large number of languages...well and then I discovered the infamous internet polyglots and I got hooked! Fast forward a few months and I had like 12 languages on my list, that I wanted to learn. Mind you, I was still convinced that, given enough time, I could still go for quality and become fully fluent in all of them...but then I realized, that there is more to life than learning a bunch of languages I have no cultural ties to nor would I ever need to know them...so I started scratching off those languages I have felt wouldn't be worth the time and effort....soooo...long story short, now I pretty much ended up witht the same 4 foreign languages I wanted to master initially..and mastering these 4 languages seems to be a far more realistic goal for me, especially since I have particular reasons as to why I want to learn each one of them.\n\nI realized that the beauty of a language really lies in the most advanced stuff, when you pick up certain cultural references, understand and can use idioms and understand things that can't even be translated back into your native language...that's far better than being able to say \"hi my name is\" in many languages. But that's just my opinion\n\nTL;DR: fell into the \"polyglot trap\" but got out of it and focus on quality instead", "created_utc": "1666950524.0", "edited": "False", "id": "iu3pf3x", "is_submitter": "False", "link_id": "t3_yevri8", "parent_id": "t3_yevri8", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "MinimumCompetition85", "body": "Okay", "created_utc": "1665068898.0", "edited": "False", "id": "irafcmc", "is_submitter": "False", "link_id": "t3_xx58jo", "parent_id": "t3_xx58jo", "score": "3", "subreddit": "pornfree", "subreddit_id": "t5_2rglh"}, {"author": "MinimumCompetition85", "body": "Sometimes I feel the same way about liberals but I am trying my hardest to not become  like them in that regard. Democracy needs variety in opinions and open dialog", "created_utc": "1664973583.0", "edited": "False", "id": "ir55h42", "is_submitter": "False", "link_id": "t3_xw7rzn", "parent_id": "t3_xw7rzn", "score": "2", "subreddit": "LouderWithCrowder", "subreddit_id": "t5_3evgn"}, {"author": "MinimumCompetition85", "body": "Whenever I had streaks when I not watched, I felt like a normal human being again lol I wanted to do stuff with friends I was way more socially outgoing instead of hiding in my room looking at a screen all day. It felt good to actually fill your day with activities that you enjoy. You engage in your life instead of wasting it away. Plus, you have a clear conscience, because you don't do anything that you would need to hide from someone.", "created_utc": "1664875464.0", "edited": "False", "id": "iqzum7k", "is_submitter": "False", "link_id": "t3_xuz671", "parent_id": "t3_xuz671", "score": "12", "subreddit": "pornfree", "subreddit_id": "t5_2rglh"}, {"author": "MinimumCompetition85", "body": "You are absolutely right, I will keep that in mind!", "created_utc": "1664377189.0", "edited": "False", "id": "iq8r19x", "is_submitter": "True", "link_id": "t3_xo1a6d", "parent_id": "t1_iq68bk2", "score": "1", "subreddit": "pornfree", "subreddit_id": "t5_2rglh"}, {"author": "MinimumCompetition85", "body": "Removed all the photos from my phone but have a huge file on my laptop which I, 10 months after the breakup, still cannot and don't want to delete. I don't look at them, but I also don't delete them. I just can't. The love we shared was such a big part of me, I just can't delete that chapter of my life just like that. She is in a new relationship now and I am still alone...maybe one day I will find someone who can make me forget all that and then it's time to delete it. but until then...I just can't", "created_utc": "1664374370.0", "edited": "False", "id": "iq8k6oz", "is_submitter": "False", "link_id": "t3_xq9hhk", "parent_id": "t3_xq9hhk", "score": "6", "subreddit": "BreakUps", "subreddit_id": "t5_2ra79"}, {"author": "MinimumCompetition85", "body": "Thanks", "created_utc": "1664316525.0", "edited": "False", "id": "iq5uckv", "is_submitter": "False", "link_id": "t3_xprad0", "parent_id": "t1_iq5s2nr", "score": "1", "subreddit": "pornID", "subreddit_id": "t5_2s90n"}, {"author": "MinimumCompetition85", "body": "Thanks for your reply, it definitely makes sense and I agree with you on that one actually. So then the question should be, how do I not turn my relapses, or slips or whatever you want to call it into binges? And also the relapse/slip itself, if I watch porn and quickly masturbate to it within say 20 minutes that's a lot better than watching for a few hours and really flooding the brain with dopamine during that time, but once in the state of \"using\" it's hard to cut your losses so to say and be over with it quickly, because, as you said, you are out of that recovery mindset. At least, that is my experience. So in any case, how can I get longer and longer streaks or periods of abstinence before the next slip or relapse? Also if you only count the total number of days being sober, it might be too easy to say \"omg I already did over a 100 days without it this year, there won't be any harm if I watch it for a few days\" I hope you get my point. Resetting a streak can be discouraging, but only counting days might also not be the right way to look at it.", "created_utc": "1664289829.0", "edited": "False", "id": "iq3y66f", "is_submitter": "True", "link_id": "t3_xo1a6d", "parent_id": "t1_ipx2gum", "score": "1", "subreddit": "pornfree", "subreddit_id": "t5_2rglh"}, {"author": "MinimumCompetition85", "body": "Getting rejected by girls? Dude who cares. One time I was out with a few friends at a bar, we were all hammered, I spend quite some time flirting with a girl only to go to the bathroom and see her making out with a friend of mine when I came back. I just laughed my ass off and approached two other girls to come join us. The point being, not all girls will like you and that's totally fine. The sooner you know that the better, to cut your loses so to say. Getting rejected is normal, don't overthink it. See it as sorting those out who are not matching with you and try to focus on the ones who do.", "created_utc": "1664205704.0", "edited": "False", "id": "ipzaxto", "is_submitter": "False", "link_id": "t3_xo1h1w", "parent_id": "t3_xo1h1w", "score": "1", "subreddit": "seduction", "subreddit_id": "t5_2qhrv"}, {"author": "MinimumCompetition85", "body": "I think most of Eastern Europe would fall under this category", "created_utc": "1664145500.0", "edited": "False", "id": "ipwersc", "is_submitter": "False", "link_id": "t3_xn7z3v", "parent_id": "t3_xn7z3v", "score": "1", "subreddit": "JordanPeterson", "subreddit_id": "t5_32jqy"}, {"author": "MinimumCompetition85", "body": "I am from Germany and we had to learn English starting in 5th grade. In 4th grade it was already offered but voluntarily, so I started learning English in 4th grade. In 7th grade a second foreign language was offered and you could choose between Spanish and French. But again you could opt out and do something else instead, which I did this time around. Now I regret  it having picked up Spanish in 7th grade but I had to learn it later in 11th and 12th grade. Now 10 years later I am trying to learn Spanish on my own haha but these language classes could have given me a very solid foundation", "created_utc": "1664145123.0", "edited": "False", "id": "ipwdx7a", "is_submitter": "False", "link_id": "t3_xnty9k", "parent_id": "t3_xnty9k", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "MinimumCompetition85", "body": "I am starting today! Today is day 1💪", "created_utc": "1663826524.0", "edited": "False", "id": "ipfp6yo", "is_submitter": "False", "link_id": "t3_xkf993", "parent_id": "t3_xkf993", "score": "1", "subreddit": "NoFapChristians", "subreddit_id": "t5_2ysnf"}, {"author": "MinimumCompetition85", "body": "I don't. I despise it. I hate what it does to my brain, I hate how much time I have wasted staring into a screen. There is nothing likeable about porn.", "created_utc": "1663254733.0", "edited": "False", "id": "iojg20k", "is_submitter": "False", "link_id": "t3_xe4zw6", "parent_id": "t3_xe4zw6", "score": "1", "subreddit": "pornfree", "subreddit_id": "t5_2rglh"}, {"author": "MinimumCompetition85", "body": "Apparently, acquiring an authentic American accent. No matter how well you speak, people can instantly tell that you are not a native speaker and I have no clue what I need to do differently in order to improve my pronunciation.", "created_utc": "1662364409.0", "edited": "False", "id": "in5rj0n", "is_submitter": "False", "link_id": "t3_x5tisp", "parent_id": "t3_x5tisp", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "MinimumCompetition85", "body": "For me Bulgarian: my parents moved there two years ago and sometimes I feel like it would be really cool to talk to the locals in their language. However they live in a rather touristy area and most people, especially younger ones, understand English so there is not a real necessity for me to learn the language. Plus I only visit them once a year or so haha it's just one of those things that would be cool but is just not worth the effort", "created_utc": "1661322614.0", "edited": "False", "id": "ilk9f5b", "is_submitter": "False", "link_id": "t3_wthcby", "parent_id": "t3_wthcby", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "MinimumCompetition85", "body": "It really looks like they just had enough! Good for them!", "created_utc": "1659528595.0", "edited": "False", "id": "iirszja", "is_submitter": "False", "link_id": "t3_werohm", "parent_id": "t3_werohm", "score": "2", "subreddit": "LouderWithCrowder", "subreddit_id": "t5_3evgn"}, {"author": "MinimumCompetition85", "body": "I would have never thought about classifying a language as mainstream or not mainstream. I learn Spanish, because I like the language and I think it will be useful for my future. Sure it has a lot of native speakers and is therefore \"mainstream\" but so what? I like it and probably need it, so I am going to learn it. \n\nAt the end of the day, everyone can learn the language they are interested in and that's totally fine.", "created_utc": "1659441110.0", "edited": "False", "id": "iimr2pl", "is_submitter": "False", "link_id": "t3_wdpkcp", "parent_id": "t3_wdpkcp", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "MinimumCompetition85", "body": "Saying \"Mahlzeit\" around noon to all your colleagues...it's hard to translate, the word itself means \"meal\" and the greeting so to say means \"enjoy your meal\"", "created_utc": "1659420816.0", "edited": "False", "id": "iim0hzf", "is_submitter": "False", "link_id": "t3_wdg2uz", "parent_id": "t3_wdg2uz", "score": "2", "subreddit": "AskAGerman", "subreddit_id": "t5_2y3st"}, {"author": "MinimumCompetition85", "body": "Yeah the same applies in Germany. The federal states are in charge of their respective educational systems and that's why the holidays aren't all at the same time throughout the country. Bavaria and some other states have a few extra catholic holidays which the rest doesn't have", "created_utc": "1659382303.0", "edited": "False", "id": "iijp58c", "is_submitter": "True", "link_id": "t3_wdhp64", "parent_id": "t1_iije1ma", "score": "1", "subreddit": "AskAnAmerican", "subreddit_id": "t5_2uah7"}, {"author": "MinimumCompetition85", "body": "Quality over quantity - for whatever reason \"becoming a polyglot\" seems to be all the rage these days, which I don't really understand. If you look beneath the surface, most polyglots have a rather superficial understanding of their target languages, which means they are missing out so much, which you can only really appreciate once you reach a high level of proficiency. And reaching a high level in several languages is an extremely time consuming endeavor, so might not be the most realistic goal.", "created_utc": "1659271305.0", "edited": "False", "id": "iidj39r", "is_submitter": "False", "link_id": "t3_wc1nl4", "parent_id": "t3_wc1nl4", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "MinimumCompetition85", "body": " Well and me and my friends agree that we should be able to protect ourselves, that's not the issue here. Where I live, you have to be very careful around certain areas, especially at night, rape has also gone up etc. so I think we should make the gun laws less restrictive to give victims of violent crime a chance. Doesn't need to be handguns but at least something.", "created_utc": "1658922903.0", "edited": "False", "id": "ihua1p7", "is_submitter": "False", "link_id": "t3_w8j9km", "parent_id": "t1_ihu7zzp", "score": "1", "subreddit": "LouderWithCrowder", "subreddit_id": "t5_3evgn"}, {"author": "MinimumCompetition85", "body": "I don't know if I am following you here, what almost never happens to people without guns? I am from Germany and our gun laws are beyond ridiclulous. And of course people are scared of getting mugged, especially around certain areas like central stations. It has become more and more dangeours in recent years due to all the criminal illegal immigrants, and that makes you wonder what options there are to defend yourself. If you get mugged, there is basically nothing you can do. Thugs here use knifes more often than guns, but owning and carrying a knife is illegal as well, so the same principle applies. If you ban guns you only disarm law-obiding citizens who can't defend themselves anymore, a thug will always be armed, no matter the gun laws. And yes ofc, I agree with you, that reducing crime will make the biggest impact, but that's a whole different topic entirely. And reducing it, doesn't mean there won't be any crimes. So again, what options do citizens have if they don't want to get raped or mugged? If it's too restrictive, you don't leave them a chance in these situations.", "created_utc": "1658921614.0", "edited": "False", "id": "ihu7vk0", "is_submitter": "False", "link_id": "t3_w8j9km", "parent_id": "t1_ihu3ue8", "score": "1", "subreddit": "LouderWithCrowder", "subreddit_id": "t5_3evgn"}, {"author": "MinimumCompetition85", "body": "Not everyone can afford to live \"in a place that's simply safer\", because they are usually more expensive. It's about what you can do IF you would have to defend yourself and/or your belongings. If the government makes it almost impossible for you to defend yourself against an armed mugger, then I would say there needs to be something done about those laws. These regulations esentially make you defenseless.,hence becoming an even easier target to mug in the first place.", "created_utc": "1658918743.0", "edited": "False", "id": "ihu3how", "is_submitter": "False", "link_id": "t3_w8j9km", "parent_id": "t1_ihtsw4o", "score": "1", "subreddit": "LouderWithCrowder", "subreddit_id": "t5_3evgn"}, {"author": "MinimumCompetition85", "body": "Hey! \n\nI totally understand your situation! I think I am in the same boat. About 10 years ago when I was about 19, I used to work in a supermarket, just stocking the shelves, ordering goods etc. and I really liked it. I had fun colleagues, I was good at it, I had fun talking to customers etc. but it was just meant as a stepping stone to qualify for college, so I went on to study business administration and I didn't do as well as I thought I would, after all I worked at a supermarket for an entire year and hadn't seen a classroom from the inside since lol\n\nlong story short, my grade wasn't so good, so I decided to make up for it and get a master's and against all odds had a somewhat decent grade and decided i wanted to make big money, have a high-end career etc. and now I work in consulting and don't really like it.\n\nI mean there are the ridicilous work hours (I worked 9am-1am the last three days in a row) and all the traveling. Plus sometimes I feel overwhelmed with the work, thinking I am not smart enough for it... I feel like my life only consists of work now and I miss out on so much. My roomate is a car mechanic and when he posts pics of him enjoying the sunny weather at 5pm at the river with some friends and beer, I can't help but feel jealous. Maybe blue-collar workers are happier than I am? what even is a 'career' and is it worth it sacrificing so much of your life? Sometimes I feel like quitting and going back to the supermarket lol but then again, I know that I am way better off financially and in times as these rn I think that is not a bad thing.\n\nI thought about owning a store one day, thinking back about my old boss he probably made more money and worked less running that supermarket than I do pulling these all nighters in consulting...I have the business knowledge so I really consider it...\n\n&#x200B;\n\nAt the end of the day we have to listen to our hearts and do what makes us happy, but we should also consider that passion alone doesn't pay the bills. Hopefully we will be able to find a job that we can live off and that doesn't make us miserable.", "created_utc": "1658412800.0", "edited": "False", "id": "ih1wqhi", "is_submitter": "False", "link_id": "t3_w4ggmk", "parent_id": "t3_w4ggmk", "score": "6", "subreddit": "careerchange", "subreddit_id": "t5_2y32k"}, {"author": "MinimumCompetition85", "body": "Yeah it sure is", "created_utc": "1658394010.0", "edited": "False", "id": "ih105sl", "is_submitter": "True", "link_id": "t3_vyu2mm", "parent_id": "t1_ih0xudc", "score": "1", "subreddit": "hatemyjob", "subreddit_id": "t5_2t80c"}, {"author": "MinimumCompetition85", "body": "Well that's not how it works here. Companies expect the reference letter from your previous employer as part of your application documents such as cv and transcripts. It's basically the grade your previous company gave you. Sure you could just not put it on there but that looks a bit fishy and they might ask what you have to hide. On the other hand you don't want to show them your bad \"grade\" so yeah I have to be careful about that", "created_utc": "1658390009.0", "edited": "False", "id": "ih0v7sb", "is_submitter": "True", "link_id": "t3_vyu2mm", "parent_id": "t1_igyzzch", "score": "2", "subreddit": "hatemyjob", "subreddit_id": "t5_2t80c"}, {"author": "MinimumCompetition85", "body": "Because I don't want them to write a bad reference letter that's all lol I don't care that much about them", "created_utc": "1658333865.0", "edited": "False", "id": "igxmows", "is_submitter": "True", "link_id": "t3_vyu2mm", "parent_id": "t1_igxisz0", "score": "2", "subreddit": "hatemyjob", "subreddit_id": "t5_2t80c"}, {"author": "MinimumCompetition85", "body": "It's hard to say no if that would mean being the only person out of ten who says no. Nobody would like me anymore in that firm I guess lol \n\nBut I would start saying no if these requests would start to become more and more frequent. At the end of the day, I am always going back and forth between wanting to quit and wanting to stay in this field but idk maybe thats just sunk cost fallacy.", "created_utc": "1657878115.0", "edited": "False", "id": "ig8sqd0", "is_submitter": "True", "link_id": "t3_vyu2mm", "parent_id": "t1_ig6bh2d", "score": "2", "subreddit": "hatemyjob", "subreddit_id": "t5_2t80c"}, {"author": "MinimumCompetition85", "body": "No I have a fixed salary. It's stated in my contract that any overtime is already compensated by the salary, so essentially they don't pay anything more than my salary for any overtime. So I get paid for 40h, I might as well only work 40h, but I know that's impossible in consulting, so I am going to leave. How can you pay people a fixed salary, which is specified in the contract and then let them work way more than the hours specified in the contract? That's a mismatch", "created_utc": "1657787147.0", "edited": "False", "id": "ig3q9ch", "is_submitter": "True", "link_id": "t3_vy3vb9", "parent_id": "t1_ig06ohh", "score": "2", "subreddit": "antiwork", "subreddit_id": "t5_2y77d"}, {"author": "MinimumCompetition85", "body": "Thanks for your reply, I appreciate it! Yeah I don't know how many hours they bill to the client tbh, could be 40, could be more...I only put \"worked for client A 100% of my time on day x\" in my timesheet, so I don't know what they make of this. They don't keep track at all of our time, so nobody knows how much we actually work. I just think it's unfair to pay me 40h and let me work anything more than that basically for free. I can't even compensate by taking more time off.", "created_utc": "1657723213.0", "edited": "False", "id": "ifzw812", "is_submitter": "True", "link_id": "t3_vy3vb9", "parent_id": "t1_ifzu4fc", "score": "1", "subreddit": "antiwork", "subreddit_id": "t5_2y77d"}, {"author": "MinimumCompetition85", "body": "Yeah I heard the same but it seems like labor laws don't apply to consulting companies somehow, because everyone is doing so much overtime, without any extra compensation. That's why I raised the question whether that's an illegal practice...I for one am not that passionate about this work to be willing to put up with this. That's why I will leave this industry", "created_utc": "1657270927.0", "edited": "False", "id": "ifblqtq", "is_submitter": "True", "link_id": "t3_vtf10o", "parent_id": "t1_ifbjr9i", "score": "1", "subreddit": "consulting", "subreddit_id": "t5_2r121"}, {"author": "MinimumCompetition85", "body": "Of course I'll get a different job. The thing is I have these long working hours but I work for a no name company lol so I guess I don't get as much out of it in terms of exit opportunities as you do.", "created_utc": "1657220401.0", "edited": "False", "id": "if8rfro", "is_submitter": "True", "link_id": "t3_vtf10o", "parent_id": "t1_if8pp7w", "score": "2", "subreddit": "consulting", "subreddit_id": "t5_2r121"}, {"author": "MinimumCompetition85", "body": "Well I can't squeeze all my other social activities and hobbies into the weekend, there just isn't enough time. That's why I also want to relax and do some of that stuff after work. But sometimes it seems like there is no after work. Especially tough when you are not even at home but in some hotel room....idk I feel like this career takes too much out of my life.  I was working 3 days in a row until 2am and looking at Insta pics of my friends chilling when it finally clicked with me that I didn't want this job", "created_utc": "1657218748.0", "edited": "False", "id": "if8n4c7", "is_submitter": "True", "link_id": "t3_vtf10o", "parent_id": "t1_if8lwyv", "score": "2", "subreddit": "consulting", "subreddit_id": "t5_2r121"}, {"author": "MinimumCompetition85", "body": "Yeah those are total hours, but what about the circumstances that you are supposed to be always on call? It's like you finish your work on time and leave for the day, go out with friends and all of a sudden at 9pm you're asked to do something. Honestly I'd like to say \"no sorry, I have plans for tonight\" because I need at least a minimum of predictability. Or the other day when I was having breakfast on Saturday and got a text asking for my help. I'm like \"dude what if I was not at home?\" I don't think it's okay to expect someone to have absolutely nothing else to do in their life and be ready to do some work at all times, night and day, work week or weekend...", "created_utc": "1657202355.0", "edited": "False", "id": "if7hoqo", "is_submitter": "True", "link_id": "t3_vtf10o", "parent_id": "t1_if7eons", "score": "3", "subreddit": "consulting", "subreddit_id": "t5_2r121"}, {"author": "MinimumCompetition85", "body": "Well I had two internships at consulting companies before and they weren't as bad. Even for the full time consultants. And why wouldn't I be surprised by an employers expectation to work countless hours basically for free lol yeah I guess you are right, a more structured environment will be better suited for me. When I am done for the day, I want to be done for the day and not sit at home \"on hold\" as some work might still come up. I have other areas of my life besides work that need my attention as well", "created_utc": "1657200674.0", "edited": "False", "id": "if7dyuv", "is_submitter": "True", "link_id": "t3_vtf10o", "parent_id": "t1_if7d3l5", "score": "7", "subreddit": "consulting", "subreddit_id": "t5_2r121"}, {"author": "MinimumCompetition85", "body": "Yeah I guess I have to do this. Unfortunately he also has my private phone number because we have a group chat we set up when we were on a business vacation together...guess not responding is not an option but I could say I am away for the weekend and don't have my laptop with me or something. And I guess I simply won't respond to the manager at 10pm at all, if the situation ever arises", "created_utc": "1657197121.0", "edited": "False", "id": "if76sjn", "is_submitter": "True", "link_id": "t3_vtf10o", "parent_id": "t1_if74roz", "score": "3", "subreddit": "consulting", "subreddit_id": "t5_2r121"}, {"author": "MinimumCompetition85", "body": "Yes exactly thats what I think too. If I recalculate my salary considering overtime I am not that far from minimum wage which is simply not worth it. I'd rather make less in total but have more free time in return", "created_utc": "1657194364.0", "edited": "False", "id": "if71xjh", "is_submitter": "True", "link_id": "t3_vtfqjz", "parent_id": "t1_if70vf8", "score": "1", "subreddit": "jobs", "subreddit_id": "t5_2qhnd"}, {"author": "MinimumCompetition85", "body": "Thanks for your reply! Yeah I guess I will not apply to other consulting companies and rather look for an in-house position. It's also the travel I can't stand anymore. I see my friends meeting up after work and I am always missing out because I am sitting in some hotel room in the middle of nowhere. I'd take a pay cut if I can get the other aspects of my life in order. I am not willing to sacrifice everything else for a \"career\" that makes me miserable. So yes, I guess it's \"out\" for me :)", "created_utc": "1657192596.0", "edited": "False", "id": "if6z52t", "is_submitter": "True", "link_id": "t3_vtfqjz", "parent_id": "t1_if6ylrt", "score": "1", "subreddit": "jobs", "subreddit_id": "t5_2qhnd"}, {"author": "MinimumCompetition85", "body": "Well I didn't want to leave him high and dry since it was literally one day before the deadline, but I would definitely say no to that manager who comes up wit these 10:30pm requests in the middle of a project...I just don't want to risk anything until I have a new offer. But seriously is this work culture just toxic or is it normal in consulting?", "created_utc": "1657191944.0", "edited": "False", "id": "if6y6eh", "is_submitter": "True", "link_id": "t3_vtf10o", "parent_id": "t1_if6x9ur", "score": "5", "subreddit": "consulting", "subreddit_id": "t5_2r121"}, {"author": "MinimumCompetition85", "body": "The contract only states that i have to work 40h per week and that any overtime is compensated by the salary already. It does not state the number of hours to be expected or anything like that. I know this invalid but I know that there are also some exceptions to this rule. I don't want to sue them or anything like that, just curious if this is actually legal or not. I have a feeling they are burning out lots of people, just recently a senior consultant left because he just had enough. I will do the same.", "created_utc": "1657191780.0", "edited": "False", "id": "if6xxme", "is_submitter": "True", "link_id": "t3_vtf10o", "parent_id": "t1_if6xhqv", "score": "4", "subreddit": "consulting", "subreddit_id": "t5_2r121"}, {"author": "MinimumCompetition85", "body": "I know I am late but I am in a similar situation, check out my latest post about me trying to find better wlb lol\n\nI am also pretty untrained and feel like being pushed into the deep end, swim or sink so to say. The other day I had to do a task I hadn't done before and I ran into some problems with the excel tool and had to re-do a few things. The partners wanted to take a look at it, but I wasn't finished by the time I initially thought I'd be finished. So one of them got angry and said \"dammit so when are you going to be finished with this?\" I was still in the middle of fixing my excel problems and was like 'how the hell am I supposed to know how long something is going to take that I have never done before?' that partner in particular gets really angry when things don't work out perfectly the very first time you do them...I have already quit internally and I am also lookingt for an inhouse marketing type of role with less money but more free time. I am not willing to put up with all this unpaid overtime until midnight anymore...you want me to stay late? pay me!\n\nConsulting in general really has some of the worst and most toxic cultures there are. Hope you will find something better!", "created_utc": "1656663617.0", "edited": "False", "id": "ieff6x4", "is_submitter": "False", "link_id": "t3_tm3fiv", "parent_id": "t3_tm3fiv", "score": "1", "subreddit": "consulting", "subreddit_id": "t5_2r121"}, {"author": "MinimumCompetition85", "body": "Thanks for your reply! How complex is marketing analytics? I assumed that it would take a real data analyst to deal with all that. Is it all done in Excel or do I need some programming skills like sql for such a job? I mean in the end, I thought I might learn sql regardless, but I couldn't use it confidently on my first day at a new job, so hopefully excel would suffice for a start.", "created_utc": "1656660765.0", "edited": "False", "id": "iefbpet", "is_submitter": "True", "link_id": "t3_vobpsw", "parent_id": "t1_ieeej17", "score": "1", "subreddit": "marketing", "subreddit_id": "t5_2qhmg"}, {"author": "MinimumCompetition85", "body": "Thanks! You are right, I am really starting to hate consulting, I don't understand how people can cope with this, but maybe it's also the toxic culture at my company, who knows, but I don't want to take the risk to apply at other consultancies in hopes it might be better, only to find out that it's not. \n\nI was thinking about an inhouse marketing role at a company, no agency. So you think that would check the boxes of what I am looking for?", "created_utc": "1656619883.0", "edited": "False", "id": "ied275w", "is_submitter": "True", "link_id": "t3_vobpsw", "parent_id": "t1_iecm8au", "score": "1", "subreddit": "marketing", "subreddit_id": "t5_2qhmg"}, {"author": "MinimumCompetition85", "body": "Let me guess, we have to praise them for being brave?", "created_utc": "1656598381.0", "edited": "False", "id": "iebjte7", "is_submitter": "False", "link_id": "t3_vnoenc", "parent_id": "t3_vnoenc", "score": "2", "subreddit": "LouderWithCrowder", "subreddit_id": "t5_3evgn"}, {"author": "MinimumCompetition85", "body": "Sorry for the late reply, is there a specific reason why you don't date American born men? Just curious", "created_utc": "1654247860.0", "edited": "False", "id": "ib0n1ss", "is_submitter": "True", "link_id": "t3_u2olr2", "parent_id": "t1_i4k5f0c", "score": "1", "subreddit": "AskAnAmerican", "subreddit_id": "t5_2uah7"}, {"author": "MinimumCompetition85", "body": "Absolutely! I loved it the first time I played it, I also played mgs3 online which was kinda fun, but later I got the ps3 remake with the new camera and it was so much better you are right! I will never forget how I stood up and saluted when I first beat the game and the credits started 😂", "created_utc": "1653943164.0", "edited": "False", "id": "ial36ji", "is_submitter": "False", "link_id": "t3_v154vf", "parent_id": "t1_ial2x1h", "score": "2", "subreddit": "gaming", "subreddit_id": "t5_2qh03"}, {"author": "MinimumCompetition85", "body": "Ikr? It's incredible how good it looked for the time, and even today...it's just beautiful. It was my introduction to the mgs franchise back then and I just love it!", "created_utc": "1653941928.0", "edited": "False", "id": "ial0kfq", "is_submitter": "False", "link_id": "t3_v154vf", "parent_id": "t1_ial0avn", "score": "1", "subreddit": "gaming", "subreddit_id": "t5_2qh03"}, {"author": "MinimumCompetition85", "body": "Metal Gear Solid 3", "created_utc": "1653933505.0", "edited": "False", "id": "iakiflm", "is_submitter": "False", "link_id": "t3_v154vf", "parent_id": "t3_v154vf", "score": "20", "subreddit": "gaming", "subreddit_id": "t5_2qh03"}, {"author": "MinimumCompetition85", "body": "move on yourself. Date again, make out, hook up whatever open your mind to the fact that there are other women out there, even potentially better women. She moved on so you should do the same. At first it's hard because you can't imagine anyone else in her place but with time it will be possible and the moment you realize that you are looking forward to meeting someone else instead of your ex, you will feel a hundred times better", "created_utc": "1652797965.0", "edited": "False", "id": "i8y7w87", "is_submitter": "False", "link_id": "t3_ur11ik", "parent_id": "t3_ur11ik", "score": "1", "subreddit": "BreakUps", "subreddit_id": "t5_2ra79"}, {"author": "MinimumCompetition85", "body": "During the breakup, after she explained all her reasons to me\nme: \"..but don't you love me anymore?\"\nHer, with tears in her eyes: \"no\"\nThat was the moment my heart broke...\n\nNot cruel per se bit damn I guess I will remember that moment for a very long time... the love I was so sure about...gone...just like that...I felt like suffocating", "created_utc": "1652431040.0", "edited": "False", "id": "i8ffv49", "is_submitter": "False", "link_id": "t3_uoeb4d", "parent_id": "t3_uoeb4d", "score": "3", "subreddit": "BreakUps", "subreddit_id": "t5_2ra79"}, {"author": "MinimumCompetition85", "body": "You're right, I miss the little angel I thought she was. Turns out she's a hoe", "created_utc": "1652195125.0", "edited": "False", "id": "i824n4m", "is_submitter": "False", "link_id": "t3_um7s1t", "parent_id": "t3_um7s1t", "score": "5", "subreddit": "BreakUps", "subreddit_id": "t5_2ra79"}, {"author": "MinimumCompetition85", "body": "You're welcome:)", "created_utc": "1651661783.0", "edited": "False", "id": "i79ze21", "is_submitter": "False", "link_id": "t3_uhf2tn", "parent_id": "t1_i79z9os", "score": "1", "subreddit": "BreakUps", "subreddit_id": "t5_2ra79"}, {"author": "MinimumCompetition85", "body": "I know that feeling but in the end our happiness shouldn't depend on their understanding. Even if she doesn't realize it, YOU have to move on. It feels good to be appreciated in that sense, that someone realized your worth but don't look for this with your ex. She left you already. Look for appreciation with your next partner. One who wouldn't leave you and who is happy your ex left you so they can be with you, you know:) \nSome people are just too blind to ever realize what they lost. And even if they realize it, I doubt they would tell us", "created_utc": "1651661318.0", "edited": "False", "id": "i79yqtm", "is_submitter": "False", "link_id": "t3_uhf2tn", "parent_id": "t1_i79yfyh", "score": "2", "subreddit": "BreakUps", "subreddit_id": "t5_2ra79"}, {"author": "MinimumCompetition85", "body": "I really hope your breakup has just been recently, it seems like your feelings are still strong for your ex. Hear me out, you can't spend the rest of your life loving someone who doesn't love you back. This isn't Hollywood, she won't suddenly show up at your door on a rainy day, telling you she has made a mistake or so. You have to let her go, meet new people and move on. You have to reach the point where you don't care about what she thinks anymore. Love someone who actually deserves to be loved by you and who doesn't leave your side! I hope that was helpful :)", "created_utc": "1651657094.0", "edited": "False", "id": "i79tkcy", "is_submitter": "False", "link_id": "t3_uhf2tn", "parent_id": "t1_i79sx0n", "score": "1", "subreddit": "BreakUps", "subreddit_id": "t5_2ra79"}, {"author": "MinimumCompetition85", "body": "100%\nShe threw away a very good relationship for basically no reason. Most of our friends agree that she has lost something/someone she probably will never find again because she is not very good at picking the right men, well except for me obviously. I really tried my best to get us both on the right track but I am just tired. A mutual female friend told me the other day \"you are one of the best men ever and she just doesn't see it...she doesn't see it what you could have given her...\" idk if she will ever realize what she lost but if she does that will not be a happy day for her...I wish her well but I have a feeling it will not end well for her...meanwhile I am hoping to find someone who is actually worth fighting for.", "created_utc": "1651653372.0", "edited": "False", "id": "i79pfc9", "is_submitter": "False", "link_id": "t3_uhf2tn", "parent_id": "t3_uhf2tn", "score": "3", "subreddit": "BreakUps", "subreddit_id": "t5_2ra79"}, {"author": "MinimumCompetition85", "body": "I believe in somewhat right person turning into a hoe", "created_utc": "1651504783.0", "edited": "False", "id": "i71ceue", "is_submitter": "False", "link_id": "t3_uget8g", "parent_id": "t3_uget8g", "score": "1", "subreddit": "BreakUps", "subreddit_id": "t5_2ra79"}, {"author": "MinimumCompetition85", "body": "The moment you stop loving that person, you are okay with it. But my situation is different, I see her all the time due to a mutual friends circle", "created_utc": "1651232132.0", "edited": "False", "id": "i6njkja", "is_submitter": "False", "link_id": "t3_ue05zy", "parent_id": "t3_ue05zy", "score": "2", "subreddit": "BreakUps", "subreddit_id": "t5_2ra79"}, {"author": "MinimumCompetition85", "body": "I really hope she does. I gave her everything and loved her with all my heart and she just threw that away. Recently a female friend told me how she just doesn't understand why she broke up with me and that I am such a great guy. And how she thinks my ex is stupid for not seeing it, for not realizing what she threw away. That was nice hearing:)\nBut in the end my happiness doesn't depend on her regretting it or not. I have moved on and if she regrets it some day it'll be too late anyway", "created_utc": "1651041847.0", "edited": "False", "id": "i6ddrm1", "is_submitter": "False", "link_id": "t3_ucq0x9", "parent_id": "t3_ucq0x9", "score": "3", "subreddit": "BreakUps", "subreddit_id": "t5_2ra79"}, {"author": "MinimumCompetition85", "body": "I agree! Communication is everything!", "created_utc": "1650530781.0", "edited": "False", "id": "i5le45s", "is_submitter": "False", "link_id": "t3_u6guq3", "parent_id": "t1_i5lbpzc", "score": "1", "subreddit": "BreakUps", "subreddit_id": "t5_2ra79"}, {"author": "MinimumCompetition85", "body": "And how is he going to give birth? Squeeze it out of his dick or shit it out? Wtf is that?", "created_utc": "1650483008.0", "edited": "False", "id": "i5irnms", "is_submitter": "False", "link_id": "t3_u7f5r6", "parent_id": "t3_u7f5r6", "score": "1", "subreddit": "LouderWithCrowder", "subreddit_id": "t5_3evgn"}, {"author": "MinimumCompetition85", "body": "Yes. But after 5 months I now feel comfortable not being with her anymore. She was such a big part of my life it still hurts that \"we\" are no more. But she broke up with me. She didn't want me anymore. I will always have fond memories of our time together and I think she will too but now it is time to move on. It's sad but two people have to be willing to fight for the relationship and not only one.", "created_utc": "1650443936.0", "edited": "False", "id": "i5ghpnu", "is_submitter": "False", "link_id": "t3_u7a4zo", "parent_id": "t3_u7a4zo", "score": "2", "subreddit": "BreakUps", "subreddit_id": "t5_2ra79"}, {"author": "MinimumCompetition85", "body": "Maybe that's just me but I try to work through a couple of textbooks to get the basics down and do some Duolingo and Busuu on the side. At times when I am very busy and I can't find the time to work with my textbooks, I only use Duolingo and Busuu which also helps", "created_utc": "1650403728.0", "edited": "False", "id": "i5eclck", "is_submitter": "False", "link_id": "t3_u7fv57", "parent_id": "t3_u7fv57", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "MinimumCompetition85", "body": "As long as realizations come, it's all good", "created_utc": "1650395092.0", "edited": "False", "id": "i5dpd9w", "is_submitter": "False", "link_id": "t3_u6guq3", "parent_id": "t1_i5dotyo", "score": "1", "subreddit": "BreakUps", "subreddit_id": "t5_2ra79"}, {"author": "MinimumCompetition85", "body": "I was exaggerating a bit to make a point but sometimes all of these \"they will regret it\" \"will they regret it?\" posts leave that impression.", "created_utc": "1650394699.0", "edited": "False", "id": "i5doc1m", "is_submitter": "False", "link_id": "t3_u6guq3", "parent_id": "t1_i5djuc2", "score": "0", "subreddit": "BreakUps", "subreddit_id": "t5_2ra79"}, {"author": "MinimumCompetition85", "body": "So there is not a single racist among refugees? Interesting...", "created_utc": "1650382980.0", "edited": "False", "id": "i5ctbtn", "is_submitter": "False", "link_id": "t3_u6po24", "parent_id": "t3_u6po24", "score": "1", "subreddit": "LouderWithCrowder", "subreddit_id": "t5_3evgn"}, {"author": "MinimumCompetition85", "body": "Yes that's true, it can also go the other way around. I was like that at the beginning but now realize how many flaws she has actually had. What's left for me to work on are actual mistakes I made, and I know it is not my fault she broke up. So yeah I guess we agree on that! I hope you are doing better now and are healing from the breakup :)", "created_utc": "1650382871.0", "edited": "False", "id": "i5ct1n6", "is_submitter": "False", "link_id": "t3_u6guq3", "parent_id": "t1_i5cr1cz", "score": "1", "subreddit": "BreakUps", "subreddit_id": "t5_2ra79"}, {"author": "MinimumCompetition85", "body": "I am wondering if dumpees are reflecting. It's easy to just say \"ha! They will regret this one day, I am so much better than anyone else, they won't find someone like me again\" blablabla and that could be an unhealthy mindset, even if that might be the truth. Healing means to simply not care anymore what the person who hurt you so much thinks. If they regret it, fine. If not, who cares? I for one know that I have made some mistakes that I want to avoid in my next relationship, like taking her for granted at times etc. Does that justify her shitty behavior? Absolutely not, but I know what went wrong from my end so I want to improve on that.\nMaybe this is a little off topic though, I actually agree with your post about how we have been wrong about them etc. :)", "created_utc": "1650380268.0", "edited": "False", "id": "i5cm964", "is_submitter": "False", "link_id": "t3_u6guq3", "parent_id": "t1_i5cl2bu", "score": "1", "subreddit": "BreakUps", "subreddit_id": "t5_2ra79"}, {"author": "MinimumCompetition85", "body": "I just see this pattern in a lot of posts here so I thought I should bring this up. I get it though, but my breakup was almost 5 months ago and I have started to see things a little differently. I remember how hurt I was and how unfair I thought I was treated. And looking at all these \"will they come back?\" \"They will regret it\" \"find someone who appreciates you\" etc posts I was wondering if people here are able to also reflect on their own behavior. Again not to say it is our own fault but just to give some fruit for thought", "created_utc": "1650379668.0", "edited": "False", "id": "i5ckpw8", "is_submitter": "False", "link_id": "t3_u6guq3", "parent_id": "t1_i5ck2k6", "score": "0", "subreddit": "BreakUps", "subreddit_id": "t5_2ra79"}, {"author": "MinimumCompetition85", "body": "Is it normal that every dumpee thinks they are an angel sent from heaven who just wasn't appreciated for the perfect being he or she is? \nI get it, if someone breaks up with you out of the blue it can seem unfair but please for the love of God, think deeply about your own flaws and know that there's always two people involved. If the other person wasnt unhappy they wouldn't have broken up. Maybe you have made some mistakes yourself? Improve on that so it won't be an issue in your new relationship. I am not saying we are automatically at fault for the breakup but we should be realistic and take responsibility for our own mistakes. All the posts here seem to suggest that dumpees never do anything wrong and I just had to get it out there. I get it, you are the one who is hurt and I don't wish heartbreak onto anybody but we should be realistic. Nobody is perfect, not them and not us. All we can do is strive to be the best versions of ourselves and find a partner who does the same. If two people are willing to make it work, it should work.", "created_utc": "1650356025.0", "edited": "False", "id": "i5bfzp2", "is_submitter": "False", "link_id": "t3_u6guq3", "parent_id": "t3_u6guq3", "score": "-2", "subreddit": "BreakUps", "subreddit_id": "t5_2ra79"}, {"author": "MinimumCompetition85", "body": "Well  if that's true then she is going to regret it. But idk she is so stupid I don't think she would even realize what she has lost haha \nBut even if she regretted it, what do I care now? That would be nice to know but what she thinks or doesn't think doesn't concern me anymore", "created_utc": "1650035391.0", "edited": "False", "id": "i4u93u9", "is_submitter": "False", "link_id": "t3_u44src", "parent_id": "t3_u44src", "score": "1", "subreddit": "BreakUps", "subreddit_id": "t5_2ra79"}, {"author": "MinimumCompetition85", "body": "Lost on you by LP", "created_utc": "1650008289.0", "edited": "False", "id": "i4t1jdc", "is_submitter": "False", "link_id": "t3_u3li4o", "parent_id": "t3_u3li4o", "score": "1", "subreddit": "BreakUps", "subreddit_id": "t5_2ra79"}, {"author": "MinimumCompetition85", "body": "Perfect!😊", "created_utc": "1649918564.0", "edited": "False", "id": "i4o5n1i", "is_submitter": "True", "link_id": "t3_u2olr2", "parent_id": "t1_i4n79ci", "score": "2", "subreddit": "AskAnAmerican", "subreddit_id": "t5_2uah7"}, {"author": "MinimumCompetition85", "body": "Excuse me? Wrong body parts? What does that mean?😂", "created_utc": "1649918367.0", "edited": "False", "id": "i4o5dwr", "is_submitter": "True", "link_id": "t3_u2olr2", "parent_id": "t1_i4mxmqr", "score": "1", "subreddit": "AskAnAmerican", "subreddit_id": "t5_2uah7"}, {"author": "MinimumCompetition85", "body": "If I ever make it to the US, I'd want to stay long term yes", "created_utc": "1649918330.0", "edited": "False", "id": "i4o5c77", "is_submitter": "True", "link_id": "t3_u2olr2", "parent_id": "t1_i4mwh2r", "score": "1", "subreddit": "AskAnAmerican", "subreddit_id": "t5_2uah7"}, {"author": "MinimumCompetition85", "body": "Well I wouldn't complain about that 😁", "created_utc": "1649884090.0", "edited": "False", "id": "i4m7o95", "is_submitter": "True", "link_id": "t3_u2olr2", "parent_id": "t1_i4m7c1l", "score": "1", "subreddit": "AskAnAmerican", "subreddit_id": "t5_2uah7"}, {"author": "MinimumCompetition85", "body": "Wow alcoholic milkshakes? Count me in! All the things you just described sound super fun! I hope I will make it to America one day so I can experience all that!", "created_utc": "1649884047.0", "edited": "False", "id": "i4m7kcj", "is_submitter": "True", "link_id": "t3_u2olr2", "parent_id": "t1_i4m5qi9", "score": "2", "subreddit": "AskAnAmerican", "subreddit_id": "t5_2uah7"}, {"author": "MinimumCompetition85", "body": "THIS! I was heartbroken (and probably still am to a degree) and cried a lot because it felt like I had lost the love of my life. Everything I believed to be certain just suddenly crumbled, it was like waking up from a perfect dream...that was 5 months ago and only recently have I reached the point where I don't give a fuck at all anymore...we have the same circle of friends so we saw each other pretty often and guess what, that actually helped. Instead of idolizing her I could see her for who she really was, or who she became and I can honestly say that I don't want to be with that person anymore. It's bad that it all had to end this way but if she didn't want to fight for what was a near perfect relationship that's too bad. I have a feeling she is going to regret it some day but honestly I don't care. I don't actively try to stay in touch anymore, if we see each other it's all cool, but nothing more. She broke up. That means she doesn't want me in her life anymore. She said she doesn't want to lose me as a friend but that's not how it works sweetheart. We will separate for good and you know it. And you know it was you who initiated it. So yeah I wish her well and I know she wishes me well too. Life goes on and I am willing to find someone new :)", "created_utc": "1649883778.0", "edited": "False", "id": "i4m6umf", "is_submitter": "False", "link_id": "t3_u2er1f", "parent_id": "t3_u2er1f", "score": "2", "subreddit": "BreakUps", "subreddit_id": "t5_2ra79"}, {"author": "MinimumCompetition85", "body": "Thank you, that was the first thing that came to my mind and I was hoping someone would say it haha", "created_utc": "1649883149.0", "edited": "False", "id": "i4m57jb", "is_submitter": "False", "link_id": "t3_u2mpm6", "parent_id": "t1_i4kh0c0", "score": "3", "subreddit": "AskAnAmerican", "subreddit_id": "t5_2uah7"}, {"author": "MinimumCompetition85", "body": "Absolutely", "created_utc": "1649881618.0", "edited": "False", "id": "i4m1bv7", "is_submitter": "True", "link_id": "t3_u2olr2", "parent_id": "t1_i4m16xn", "score": "2", "subreddit": "AskAnAmerican", "subreddit_id": "t5_2uah7"}, {"author": "MinimumCompetition85", "body": "Haha sure thing, I am not Bavarian 😂", "created_utc": "1649877267.0", "edited": "False", "id": "i4lqsc1", "is_submitter": "True", "link_id": "t3_u2olr2", "parent_id": "t1_i4lmz4j", "score": "2", "subreddit": "AskAnAmerican", "subreddit_id": "t5_2uah7"}, {"author": "MinimumCompetition85", "body": "Good luck to you two! :)", "created_utc": "1649877208.0", "edited": "False", "id": "i4lqmyg", "is_submitter": "True", "link_id": "t3_u2olr2", "parent_id": "t1_i4lombx", "score": "1", "subreddit": "AskAnAmerican", "subreddit_id": "t5_2uah7"}, {"author": "MinimumCompetition85", "body": "Wow that sounds fantastic! I hope I'll make it to America soon haha", "created_utc": "1649875116.0", "edited": "False", "id": "i4ll8nb", "is_submitter": "True", "link_id": "t3_u2olr2", "parent_id": "t1_i4ljz9f", "score": "2", "subreddit": "AskAnAmerican", "subreddit_id": "t5_2uah7"}, {"author": "MinimumCompetition85", "body": "Yeah I don't mind hot weather but I guess I need to check it out first", "created_utc": "1649875018.0", "edited": "False", "id": "i4lkzhz", "is_submitter": "True", "link_id": "t3_u2olr2", "parent_id": "t1_i4ljq5i", "score": "1", "subreddit": "AskAnAmerican", "subreddit_id": "t5_2uah7"}, {"author": "MinimumCompetition85", "body": "Hopefully 😄", "created_utc": "1649874984.0", "edited": "False", "id": "i4lkwc7", "is_submitter": "True", "link_id": "t3_u2olr2", "parent_id": "t1_i4ljovr", "score": "1", "subreddit": "AskAnAmerican", "subreddit_id": "t5_2uah7"}, {"author": "MinimumCompetition85", "body": "Oh man sorry to hear that! Yeah on the one hand I want to assimilate and be seen as another American, on the other hand I guess it can be quite exciting to date someone from another country. As long I don't have to act more \"German\" than I feel comfortable with I am fine with that haha", "created_utc": "1649874316.0", "edited": "False", "id": "i4lj4hz", "is_submitter": "True", "link_id": "t3_u2olr2", "parent_id": "t1_i4lipae", "score": "2", "subreddit": "AskAnAmerican", "subreddit_id": "t5_2uah7"}, {"author": "MinimumCompetition85", "body": "Well I think it is quite fluent. I did my whole master's degree entirely im English, including the thesis. I guess I am between a c1 and c2, so I guess that wouldn't be an issue. Yeah I watch lots of American shows and movies so I also have a pretty good grasp of slang etc and I am trying to learn as much as I can about cultural differences:)", "created_utc": "1649874128.0", "edited": "False", "id": "i4limx6", "is_submitter": "True", "link_id": "t3_u2olr2", "parent_id": "t1_i4ldwsu", "score": "1", "subreddit": "AskAnAmerican", "subreddit_id": "t5_2uah7"}, {"author": "MinimumCompetition85", "body": "Yeah I hope my English is good enough haha\nBtw happy cake day!", "created_utc": "1649873866.0", "edited": "False", "id": "i4lhy37", "is_submitter": "True", "link_id": "t3_u2olr2", "parent_id": "t1_i4lbt1a", "score": "2", "subreddit": "AskAnAmerican", "subreddit_id": "t5_2uah7"}, {"author": "MinimumCompetition85", "body": "Wow I had no idea! I will check those places out!", "created_utc": "1649870733.0", "edited": "False", "id": "i4l9oqn", "is_submitter": "True", "link_id": "t3_u2olr2", "parent_id": "t1_i4l835i", "score": "2", "subreddit": "AskAnAmerican", "subreddit_id": "t5_2uah7"}, {"author": "MinimumCompetition85", "body": "Yeah I know her! She also won the green card lottery! I don't know the dating video though so I might check it out. Thanks!", "created_utc": "1649870635.0", "edited": "False", "id": "i4l9fa1", "is_submitter": "True", "link_id": "t3_u2olr2", "parent_id": "t1_i4l52ju", "score": "2", "subreddit": "AskAnAmerican", "subreddit_id": "t5_2uah7"}, {"author": "MinimumCompetition85", "body": "Will do!😄", "created_utc": "1649870511.0", "edited": "False", "id": "i4l93p3", "is_submitter": "True", "link_id": "t3_u2olr2", "parent_id": "t1_i4l47wr", "score": "3", "subreddit": "AskAnAmerican", "subreddit_id": "t5_2uah7"}, {"author": "MinimumCompetition85", "body": "Thanks for your reply! I will definitely check out a few places but so far it seems like Dallas might be a good fit", "created_utc": "1649870494.0", "edited": "False", "id": "i4l924w", "is_submitter": "True", "link_id": "t3_u2olr2", "parent_id": "t1_i4l40tj", "score": "2", "subreddit": "AskAnAmerican", "subreddit_id": "t5_2uah7"}, {"author": "MinimumCompetition85", "body": "That sounds good! Tbh I don't want to hang out with other Germans all the time as I feel that would deprive me of the real American experience you know? Like immigrants just sticking to their own? I don't like that. I hope I would make lots of American friends as well, but yeah would also be fun to know people from Germany. A good mix would be best :D", "created_utc": "1649867972.0", "edited": "False", "id": "i4l2eyr", "is_submitter": "True", "link_id": "t3_u2olr2", "parent_id": "t1_i4l1v9y", "score": "2", "subreddit": "AskAnAmerican", "subreddit_id": "t5_2uah7"}, {"author": "MinimumCompetition85", "body": "Considering that there is even a dialect called Texas German I think there are a few but I guess they live more on the rural areas. Yeah I heard about Cincinnati having lots of German heritage, I'd like to check it out one day!", "created_utc": "1649867822.0", "edited": "False", "id": "i4l20oz", "is_submitter": "True", "link_id": "t3_u2olr2", "parent_id": "t1_i4l1fkb", "score": "1", "subreddit": "AskAnAmerican", "subreddit_id": "t5_2uah7"}, {"author": "MinimumCompetition85", "body": "Thanks for sharing this!\nWhat it came down to was weather, job opportunities, culture, politics and cost of living. So all these things combined and it just seems like Dallas would be a good fit for me. I have only spend a few weeks in Ithaca, NY during my abroad semester at Cornell back in 2020. I had to cut it short due to the pandemic but it was back then when I decided I wanted to move to the US. And it was also the pandemic that made me research on my own and that's how I came up with Dallas", "created_utc": "1649867732.0", "edited": "False", "id": "i4l1s5o", "is_submitter": "True", "link_id": "t3_u2olr2", "parent_id": "t1_i4l0uzh", "score": "1", "subreddit": "AskAnAmerican", "subreddit_id": "t5_2uah7"}, {"author": "MinimumCompetition85", "body": "If Austin really is like Berlin I would stay away from it as far as I possibly could 😂 I lived in Frankfurt for a while so that gives me a picture of what Houston must be like. I just heard that Houston is way more humid than Dallas plus there is the threat of floods so I guess I would prefer Dallas. Dating wise it seems to be a good choice too from what you have said :)", "created_utc": "1649867547.0", "edited": "False", "id": "i4l1ah3", "is_submitter": "True", "link_id": "t3_u2olr2", "parent_id": "t1_i4kzz81", "score": "1", "subreddit": "AskAnAmerican", "subreddit_id": "t5_2uah7"}, {"author": "MinimumCompetition85", "body": "That's the answer I was hoping for haha thanks!", "created_utc": "1649867355.0", "edited": "False", "id": "i4l0rxq", "is_submitter": "True", "link_id": "t3_u2olr2", "parent_id": "t1_i4kzeci", "score": "2", "subreddit": "AskAnAmerican", "subreddit_id": "t5_2uah7"}, {"author": "MinimumCompetition85", "body": "Thanks for sharing that!", "created_utc": "1649867315.0", "edited": "False", "id": "i4l0o6d", "is_submitter": "True", "link_id": "t3_u2olr2", "parent_id": "t1_i4kxi3c", "score": "2", "subreddit": "AskAnAmerican", "subreddit_id": "t5_2uah7"}, {"author": "MinimumCompetition85", "body": "Okay well I didn't know that about Australian men. I guess it also depends on the person, you can run into bad people everywhere", "created_utc": "1649867278.0", "edited": "False", "id": "i4l0kma", "is_submitter": "True", "link_id": "t3_u2olr2", "parent_id": "t1_i4kusa6", "score": "2", "subreddit": "AskAnAmerican", "subreddit_id": "t5_2uah7"}, {"author": "MinimumCompetition85", "body": "Okay I misused that term then, thanks for clarifying that!\nOh perfect, how would you describe the dating scene in Dallas? Someone else mentioned that people are more looking for something casual in such a big city, what's your take on this?", "created_utc": "1649864944.0", "edited": "False", "id": "i4kuh3a", "is_submitter": "True", "link_id": "t3_u2olr2", "parent_id": "t1_i4kt4vq", "score": "1", "subreddit": "AskAnAmerican", "subreddit_id": "t5_2uah7"}, {"author": "MinimumCompetition85", "body": "She crosses my mind every now and then but I don't care about her at all", "created_utc": "1649864773.0", "edited": "False", "id": "i4ku10p", "is_submitter": "False", "link_id": "t3_u2ck4w", "parent_id": "t3_u2ck4w", "score": "1", "subreddit": "BreakUps", "subreddit_id": "t5_2ra79"}, {"author": "MinimumCompetition85", "body": "Wow really? Can you explain why? Just because \"foreign\" = exotic? 😅", "created_utc": "1649864718.0", "edited": "False", "id": "i4ktvyf", "is_submitter": "True", "link_id": "t3_u2olr2", "parent_id": "t1_i4kqbil", "score": "1", "subreddit": "AskAnAmerican", "subreddit_id": "t5_2uah7"}, {"author": "MinimumCompetition85", "body": "I am working on that 😁", "created_utc": "1649862731.0", "edited": "False", "id": "i4kormv", "is_submitter": "True", "link_id": "t3_u2olr2", "parent_id": "t1_i4koaws", "score": "2", "subreddit": "AskAnAmerican", "subreddit_id": "t5_2uah7"}, {"author": "MinimumCompetition85", "body": "Thanks man!", "created_utc": "1649862704.0", "edited": "False", "id": "i4kop1m", "is_submitter": "True", "link_id": "t3_u2olr2", "parent_id": "t1_i4knsit", "score": "2", "subreddit": "AskAnAmerican", "subreddit_id": "t5_2uah7"}, {"author": "MinimumCompetition85", "body": "Okay thanks for the heads up!", "created_utc": "1649862643.0", "edited": "False", "id": "i4kojn6", "is_submitter": "True", "link_id": "t3_u2olr2", "parent_id": "t1_i4kn4zd", "score": "1", "subreddit": "AskAnAmerican", "subreddit_id": "t5_2uah7"}, {"author": "MinimumCompetition85", "body": "Okay I hope you're right. Oh did I do that? Haha need to be careful", "created_utc": "1649862582.0", "edited": "False", "id": "i4koe74", "is_submitter": "True", "link_id": "t3_u2olr2", "parent_id": "t1_i4kmil1", "score": "6", "subreddit": "AskAnAmerican", "subreddit_id": "t5_2uah7"}, {"author": "MinimumCompetition85", "body": "Mmm well that doesn't sound too bad at all! I was referring to the DFW metroplex more than Dallas proper so yeah Fort Worth could be an option too! Thanks:)", "created_utc": "1649862558.0", "edited": "False", "id": "i4koc2r", "is_submitter": "True", "link_id": "t3_u2olr2", "parent_id": "t1_i4kn10l", "score": "1", "subreddit": "AskAnAmerican", "subreddit_id": "t5_2uah7"}, {"author": "MinimumCompetition85", "body": "I would never do that, but thanks for the heads up 😂👍", "created_utc": "1649861176.0", "edited": "False", "id": "i4kku5v", "is_submitter": "True", "link_id": "t3_u2olr2", "parent_id": "t1_i4kkfrg", "score": "24", "subreddit": "AskAnAmerican", "subreddit_id": "t5_2uah7"}, {"author": "MinimumCompetition85", "body": "Can you elaborate a bit? I am curious to know why you think it's better", "created_utc": "1649861127.0", "edited": "False", "id": "i4kkpk0", "is_submitter": "True", "link_id": "t3_u2olr2", "parent_id": "t1_i4kk5yc", "score": "1", "subreddit": "AskAnAmerican", "subreddit_id": "t5_2uah7"}, {"author": "MinimumCompetition85", "body": "Yeah I'm 5'10 so idk about that haha", "created_utc": "1649861098.0", "edited": "False", "id": "i4kkmyd", "is_submitter": "True", "link_id": "t3_u2olr2", "parent_id": "t1_i4kji66", "score": "5", "subreddit": "AskAnAmerican", "subreddit_id": "t5_2uah7"}, {"author": "MinimumCompetition85", "body": "Yeah I know I was more referring to someone actually being very new to the country as I don't have the \"time\" not to date for a few years haha", "created_utc": "1649861015.0", "edited": "False", "id": "i4kkf7g", "is_submitter": "True", "link_id": "t3_u2olr2", "parent_id": "t1_i4kivdq", "score": "2", "subreddit": "AskAnAmerican", "subreddit_id": "t5_2uah7"}, {"author": "MinimumCompetition85", "body": "If the guy just drinks the content of random bottles in bins, you're probably not the first whose pee he drank haha wtf who does that", "created_utc": "1649859432.0", "edited": "1649861049.0", "id": "i4kgglt", "is_submitter": "False", "link_id": "t3_u2qn2r", "parent_id": "t3_u2qn2r", "score": "16", "subreddit": "tifu", "subreddit_id": "t5_2to41"}, {"author": "MinimumCompetition85", "body": "Hopefully I can tell a similar story some day!", "created_utc": "1649858797.0", "edited": "False", "id": "i4kex4i", "is_submitter": "True", "link_id": "t3_u2olr2", "parent_id": "t1_i4kdbsl", "score": "1", "subreddit": "AskAnAmerican", "subreddit_id": "t5_2uah7"}, {"author": "MinimumCompetition85", "body": "Oh I would say I  am a generous tipper. When I was in the US for my semester abroad two years ago, I made sure to tip no less than 20 %\nBut even by German standards I tip more than most, so hopefully that won't stand in my way 😄", "created_utc": "1649858771.0", "edited": "False", "id": "i4kev06", "is_submitter": "True", "link_id": "t3_u2olr2", "parent_id": "t1_i4kd5mf", "score": "3", "subreddit": "AskAnAmerican", "subreddit_id": "t5_2uah7"}, {"author": "MinimumCompetition85", "body": "It's BECAUSE you do things differently that I want to live in the US. haha if I were happy with the way Germans do things, I wouldn't want to leave", "created_utc": "1649858673.0", "edited": "False", "id": "i4kemo5", "is_submitter": "True", "link_id": "t3_u2olr2", "parent_id": "t1_i4kcty0", "score": "2", "subreddit": "AskAnAmerican", "subreddit_id": "t5_2uah7"}, {"author": "MinimumCompetition85", "body": "That's a nice analogy! Yeah from all the responses here it seems like I should worry too much about it", "created_utc": "1649858598.0", "edited": "False", "id": "i4kegb8", "is_submitter": "True", "link_id": "t3_u2olr2", "parent_id": "t1_i4kcih7", "score": "1", "subreddit": "AskAnAmerican", "subreddit_id": "t5_2uah7"}, {"author": "MinimumCompetition85", "body": "Haha sounds good! I recently had a girl from Florida tell me I sound too American, maybe I need to use the accent a little more to my advantage haha", "created_utc": "1649858508.0", "edited": "False", "id": "i4ke8p3", "is_submitter": "True", "link_id": "t3_u2olr2", "parent_id": "t1_i4kcd0b", "score": "4", "subreddit": "AskAnAmerican", "subreddit_id": "t5_2uah7"}, {"author": "MinimumCompetition85", "body": "Sure someone else asked me the same already. Well when I first participated in the Green Card lottery the pandemic started and nobody could travel. And I was like \"okay what if I win now? I'd have to decide where to go without having the opportunity to explore a few places\". So I was thinking about all the things I value and where I would probably feel most comfortable and somehow narrowed it down to Dallas. Did lots of research and so far it seems like a nice place to live in. And now that idea just stuck in my head lol I hope I'll be able to check it out myself soon to get a better picture of what it's like. Maybe it will prove my points, maybe it'll make me reconsider who knows haha", "created_utc": "1649858248.0", "edited": "False", "id": "i4kdmh7", "is_submitter": "True", "link_id": "t3_u2olr2", "parent_id": "t1_i4kbg1l", "score": "7", "subreddit": "AskAnAmerican", "subreddit_id": "t5_2uah7"}, {"author": "MinimumCompetition85", "body": "Well right now I guess I would move to Dallas. Here in Germany I am a management consultant. Unfortunately not for any big American company but a smaller German one. Hopefully I could find a job as a consultant in the US too", "created_utc": "1649857698.0", "edited": "False", "id": "i4kcc40", "is_submitter": "True", "link_id": "t3_u2olr2", "parent_id": "t1_i4ka3ch", "score": "2", "subreddit": "AskAnAmerican", "subreddit_id": "t5_2uah7"}, {"author": "MinimumCompetition85", "body": "That sounds awesome 😄", "created_utc": "1649857551.0", "edited": "False", "id": "i4kbztc", "is_submitter": "True", "link_id": "t3_u2olr2", "parent_id": "t1_i4ka30b", "score": "3", "subreddit": "AskAnAmerican", "subreddit_id": "t5_2uah7"}, {"author": "MinimumCompetition85", "body": "I sure hope it does! The pandemic has made it super hard for people to get their interviews scheduled in time because the embassies are just overworked. Lots of people who won couldn't schedule their interview and their win expired, there are so many lawsuits going on right now. I really hope everything would work out fine if I win", "created_utc": "1649857198.0", "edited": "False", "id": "i4kb6yc", "is_submitter": "True", "link_id": "t3_u2olr2", "parent_id": "t1_i4kagdv", "score": "2", "subreddit": "AskAnAmerican", "subreddit_id": "t5_2uah7"}, {"author": "MinimumCompetition85", "body": "Wow I didn't know that!", "created_utc": "1649856661.0", "edited": "False", "id": "i4ka04t", "is_submitter": "True", "link_id": "t3_u2olr2", "parent_id": "t1_i4k6bzf", "score": "2", "subreddit": "AskAnAmerican", "subreddit_id": "t5_2uah7"}, {"author": "MinimumCompetition85", "body": "That's good to know haha", "created_utc": "1649856629.0", "edited": "False", "id": "i4k9xmd", "is_submitter": "True", "link_id": "t3_u2olr2", "parent_id": "t1_i4k3ys3", "score": "17", "subreddit": "AskAnAmerican", "subreddit_id": "t5_2uah7"}, {"author": "MinimumCompetition85", "body": "I guess there are plenty of good BBQ places to check out, I love barbecue!😋", "created_utc": "1649856613.0", "edited": "False", "id": "i4k9wc6", "is_submitter": "True", "link_id": "t3_u2olr2", "parent_id": "t1_i4k8mqg", "score": "2", "subreddit": "AskAnAmerican", "subreddit_id": "t5_2uah7"}, {"author": "MinimumCompetition85", "body": "Well the official name is diversity immigrant visa program. It issues about 50,000 - 55,000 green cards every year to immigrants who have historically low immigration rates. \nYou must fill out a simple form and then you get chosen randomly out of all the (millions of) participants. Hence why it's called a lottery. If you get chosen you have the opportunity to apply for a green card at your local embassy, fill out lots of forms, hand in the necessary documents, go to the interview yadayadayada and if it all goes well they will grant you a green card and once you have it, you have to move to the US within a year, or let's say can't stay outside the US for more than one consecutive year.\nI hope I could explain it well 😅\nIt's a great opportunity for someone who doesn't have any close family in the US or doesn't work for an American company, but work visas are a pain in the ass anyway lol So yeah, it could speed up the process to citizenship significantly as you become a permanent resident and don't just have a work visa", "created_utc": "1649856535.0", "edited": "False", "id": "i4k9q97", "is_submitter": "True", "link_id": "t3_u2olr2", "parent_id": "t1_i4k8ovn", "score": "4", "subreddit": "AskAnAmerican", "subreddit_id": "t5_2uah7"}, {"author": "MinimumCompetition85", "body": "Yeah all the things you just named are things that draw me to Dallas. And yes I like hot weather, all in all I hope I'll make it and that it's as good as it sounds haha", "created_utc": "1649855877.0", "edited": "False", "id": "i4k8a7x", "is_submitter": "True", "link_id": "t3_u2olr2", "parent_id": "t1_i4k6t24", "score": "6", "subreddit": "AskAnAmerican", "subreddit_id": "t5_2uah7"}, {"author": "MinimumCompetition85", "body": "Thanks I appreciate the insight! I just started a new job so idk if and when I'll be able to travel, if not this year then definitely next year!", "created_utc": "1649855291.0", "edited": "False", "id": "i4k70rj", "is_submitter": "True", "link_id": "t3_u2olr2", "parent_id": "t1_i4k6n83", "score": "6", "subreddit": "AskAnAmerican", "subreddit_id": "t5_2uah7"}, {"author": "MinimumCompetition85", "body": "Wow what a strange topic to talk about during sexy time haha\nWell for me it would be the other way around, I am just fascinated by America and would be super happy just to be there. You wouldn't hear me talk bad about it at all probably lol", "created_utc": "1649855091.0", "edited": "False", "id": "i4k6lgc", "is_submitter": "True", "link_id": "t3_u2olr2", "parent_id": "t1_i4k3v3n", "score": "7", "subreddit": "AskAnAmerican", "subreddit_id": "t5_2uah7"}, {"author": "MinimumCompetition85", "body": "The first time I participated in the lottery the pandemic started so I was like \"well what would I do if I win? I can't just travel around and check places out, I'd need to know where to go\" so I had to do a lot of research on my own and considering all the things I value I somehow narrowed it down to Dallas and that idea just stuck in my head. I want to check it out myself soon anyway (I've only been to the airport thus far lol) but so far it seems to be a nice place to live in", "created_utc": "1649854866.0", "edited": "False", "id": "i4k64kl", "is_submitter": "True", "link_id": "t3_u2olr2", "parent_id": "t1_i4k4d4e", "score": "9", "subreddit": "AskAnAmerican", "subreddit_id": "t5_2uah7"}, {"author": "MinimumCompetition85", "body": "I am not moving away to keep \"the old ways\" haha trust me assimilating would be no issue at all for me", "created_utc": "1649853884.0", "edited": "False", "id": "i4k43jn", "is_submitter": "True", "link_id": "t3_u2olr2", "parent_id": "t1_i4k332w", "score": "3", "subreddit": "AskAnAmerican", "subreddit_id": "t5_2uah7"}, {"author": "MinimumCompetition85", "body": "Yeah I guess the US and Germany, being both western countries, should be very similar in that regard.", "created_utc": "1649853812.0", "edited": "False", "id": "i4k3ycf", "is_submitter": "True", "link_id": "t3_u2olr2", "parent_id": "t1_i4k2eha", "score": "3", "subreddit": "AskAnAmerican", "subreddit_id": "t5_2uah7"}, {"author": "MinimumCompetition85", "body": "Thanks, that's good advice! I see you are from Dallas yourself, can you tell me a little more about the dating culture there?", "created_utc": "1649853720.0", "edited": "False", "id": "i4k3rnh", "is_submitter": "True", "link_id": "t3_u2olr2", "parent_id": "t1_i4k15ns", "score": "17", "subreddit": "AskAnAmerican", "subreddit_id": "t5_2uah7"}, {"author": "MinimumCompetition85", "body": "That's interesting! But I don't know if that would be the right place for someone looking for nicer weather haha", "created_utc": "1649853656.0", "edited": "False", "id": "i4k3n1s", "is_submitter": "True", "link_id": "t3_u2olr2", "parent_id": "t1_i4jznio", "score": "8", "subreddit": "AskAnAmerican", "subreddit_id": "t5_2uah7"}, {"author": "MinimumCompetition85", "body": "I am glad to hear that as I don't think there would be any language barrier for the most part :)", "created_utc": "1649852808.0", "edited": "False", "id": "i4k1zl0", "is_submitter": "True", "link_id": "t3_u2olr2", "parent_id": "t1_i4jz8um", "score": "76", "subreddit": "AskAnAmerican", "subreddit_id": "t5_2uah7"}, {"author": "MinimumCompetition85", "body": "Oh wow what a cool story! I am glad for you guys! Well in my case there is no real language barrier as I speak English fluently (did my masters, including the thesis, entirely in English) and I try to improve on it every day", "created_utc": "1649852101.0", "edited": "False", "id": "i4k0nlx", "is_submitter": "True", "link_id": "t3_u2olr2", "parent_id": "t1_i4k0ck2", "score": "24", "subreddit": "AskAnAmerican", "subreddit_id": "t5_2uah7"}, {"author": "MinimumCompetition85", "body": "Sure as long as there are no language barriers", "created_utc": "1649851233.0", "edited": "False", "id": "i4jz2yf", "is_submitter": "True", "link_id": "t3_u2olr2", "parent_id": "t1_i4jyv8f", "score": "53", "subreddit": "AskAnAmerican", "subreddit_id": "t5_2uah7"}, {"author": "MinimumCompetition85", "body": "For mine it actually overlapped, she even cheated on me. Good thing he fucked and dumped her haha\nNow we're both single but she is living out her \"hoe phase\". Last time at a party I told her that she is going to land flat on her face if she continues going down that road. I said I am just worried but you know what? Now I don't give a single fuck anymore. It's none of my business anymore. I tried to lead her to a better life for 5 years, I am done with this.\nSo your ex is dating someone new? If you ever loved her you should wish her well and stop thinking about her. You will find someone a hundred times better. Would it make you any happier if she was alone? I hope not. \nYou both have to move on. Her life is none of your business anymore and you should get out, meet new people, sleep around if that's what you like and then you'll see you will find someone new too and all this anger and sadness will be forgotten.", "created_utc": "1649783401.0", "edited": "False", "id": "i4g9tyz", "is_submitter": "False", "link_id": "t3_u1co6z", "parent_id": "t3_u1co6z", "score": "2", "subreddit": "BreakUps", "subreddit_id": "t5_2ra79"}, {"author": "MinimumCompetition85", "body": "What do you mean by little progress? Even if its just a little, the fact alone that there is some sort of progress to speak of should be a good sign for you that whatever you are doing works. Try to see the big picture. If you make just a little progress a day, how far will you be after one year? Consistency is key", "created_utc": "1649712868.0", "edited": "False", "id": "i4cglx2", "is_submitter": "False", "link_id": "t3_u15mki", "parent_id": "t1_i4cg2ul", "score": "1", "subreddit": "selfimprovement", "subreddit_id": "t5_2qmbm"}, {"author": "MinimumCompetition85", "body": "When you plan to do something, you have to stick to it. If for example you were to go on a diet and you fail you will feel miserable. But if you stick to it, you will be proud of yourself. That's also being honest to yourself. To know that when you say you do something you actually do it and that you can trust yourself in that regard is the best confidence boost there is.", "created_utc": "1649712063.0", "edited": "False", "id": "i4cek7k", "is_submitter": "False", "link_id": "t3_u15mki", "parent_id": "t3_u15mki", "score": "1", "subreddit": "selfimprovement", "subreddit_id": "t5_2qmbm"}, {"author": "MinimumCompetition85", "body": "I don't care at all. There is nothing she could come back to. She managed to kill all the feelings I had for her", "created_utc": "1649512965.0", "edited": "False", "id": "i41a26f", "is_submitter": "False", "link_id": "t3_tza18r", "parent_id": "t3_tza18r", "score": "1", "subreddit": "BreakUps", "subreddit_id": "t5_2ra79"}, {"author": "MinimumCompetition85", "body": "Perfect! Feels strange that we've been together once. F*ck her, I'll find better. Life goes on :)", "created_utc": "1649407137.0", "edited": "False", "id": "i3vju7t", "is_submitter": "False", "link_id": "t3_tycenf", "parent_id": "t3_tycenf", "score": "1", "subreddit": "BreakUps", "subreddit_id": "t5_2ra79"}, {"author": "MinimumCompetition85", "body": "I guess my ex gf will regret it someday too. Hopefully she would tell me and I can tell her that I have met someone new who actually appreciates me and who deserves to be loved by me. I wasn't good enough for you? Good luck finding someone better", "created_utc": "1649335678.0", "edited": "False", "id": "i3r8ipk", "is_submitter": "False", "link_id": "t3_ty2k4u", "parent_id": "t3_ty2k4u", "score": "2", "subreddit": "BreakUps", "subreddit_id": "t5_2ra79"}, {"author": "MinimumCompetition85", "body": "Why don't you tell her you'd slap the (whatever color she is) out of her? I'd tell her to shut the fck up next time she says something like that. I mean who does she think she is that she can get away with that?", "created_utc": "1649168034.0", "edited": "1649168375.0", "id": "i3hqlta", "is_submitter": "False", "link_id": "t3_twexcw", "parent_id": "t3_twexcw", "score": "1", "subreddit": "benshapiro", "subreddit_id": "t5_3779u"}, {"author": "MinimumCompetition85", "body": "Yes I did. If I wouldn't want her to be happy, I don't think I ever loved her. But I did, more than anything. I forgave her, not to excuse what she has done, but to not let her behavior destroy my soul. Now she cheated and broke up immediately afterwards, in fact she wanted to break up prior to that, so yeah I can forgive that. I would never however forgive an affair or something that went on for longer. People who lie to their partners and f*ck with others without breaking up are just despicable. Also I did some things I am not proud of during our relationship, I didn't actually cheat on her but yeah...we all make mistakes. Being angry and hurt and feeling sorry for yourself doesn't help you at all. Just let go of it and move on.", "created_utc": "1649167428.0", "edited": "False", "id": "i3hp4z5", "is_submitter": "False", "link_id": "t3_twnas4", "parent_id": "t3_twnas4", "score": "3", "subreddit": "BreakUps", "subreddit_id": "t5_2ra79"}, {"author": "MinimumCompetition85", "body": "About 4 months ago. We've been together for almost 5 years. I now realize that it was better to break up. I tried to help her, but she is not willing to work on herself and has totally different priorities. There is no future for us. She is selfish and I want someone who I can form a team with. She broke up with me because she wasn't willing to work on our relationship. Too bad for her, she has a habit to choose poorly when it comes to men, I was the only one who treated her well. I bet she will regret her decision some day but that's not my concern anymore.", "created_utc": "1649152250.0", "edited": "False", "id": "i3gyb9w", "is_submitter": "False", "link_id": "t3_twabsd", "parent_id": "t3_twabsd", "score": "1", "subreddit": "BreakUps", "subreddit_id": "t5_2ra79"}, {"author": "MinimumCompetition85", "body": "Don't. Be the better person. Hurting someone won't take the pain away nor will it make you feel any better.", "created_utc": "1648829991.0", "edited": "False", "id": "i300dmn", "is_submitter": "False", "link_id": "t3_tt5oba", "parent_id": "t3_tt5oba", "score": "2", "subreddit": "BreakUps", "subreddit_id": "t5_2ra79"}, {"author": "MinimumCompetition85", "body": "Thank you!", "created_utc": "1648675707.0", "edited": "False", "id": "i2rne6i", "is_submitter": "True", "link_id": "t3_tsi6hq", "parent_id": "t1_i2rmuxj", "score": "2", "subreddit": "BreakUps", "subreddit_id": "t5_2ra79"}, {"author": "MinimumCompetition85", "body": "Yeah I feel that. I am 28, about to 29 and it sucks to date again at my age. In hindsight I see how she wasn't perfect for me, but what's perfect anyway? If two people are ready to work on themselves and the relationship, that's good enough I would say, granted that there is a solid base of mutual values etc. Guess she is looking for something else now, so it was better to break up. But finding someone new? Now that's the challenge I am facing, but I am positive I will find someone!", "created_utc": "1648458662.0", "edited": "False", "id": "i2f1l8t", "is_submitter": "False", "link_id": "t3_tkgt77", "parent_id": "t1_i24wv4t", "score": "1", "subreddit": "BreakUps", "subreddit_id": "t5_2ra79"}, {"author": "MinimumCompetition85", "body": "Always happy to help :)", "created_utc": "1648135335.0", "edited": "False", "id": "i1xvf8s", "is_submitter": "False", "link_id": "t3_tktesf", "parent_id": "t1_i1xh66v", "score": "2", "subreddit": "BreakUps", "subreddit_id": "t5_2ra79"}, {"author": "MinimumCompetition85", "body": "At first you don't understand how someone can just stop loving you and you hold on to what you had. But then slowly you begin to realize that your feelings are starting to wane too and at first you don't want to allow yourself to feel less towards that person you wanted to spend your life with, it feels like a betrayal almost. But once you give in to that, you realize how the other person feels and that is the beginning of moving on. Just letting go of your feelings, the past, the future you had planned. Just letting go of everything and being thankful for the great time you've had even though it didn't last forever. Life is hard and it will sucker punch you when you least expect it. Accept this reality and try to make the best out of it. What doesn't kill you can only make you stronger!", "created_utc": "1648116274.0", "edited": "False", "id": "i1wuoq2", "is_submitter": "False", "link_id": "t3_tktesf", "parent_id": "t3_tktesf", "score": "2", "subreddit": "BreakUps", "subreddit_id": "t5_2ra79"}, {"author": "MinimumCompetition85", "body": "Same here, I thought I had found the one. We had incredible chemistry but then she left me and told me a bunch of bullshit excuses. I think what it really came down to is that she is still young (recentky turned 23yo) and just isn't ready for a real commitment. We were about to move in together so I guess she got cold feet and now she is living her \"Hoe phase\"\nHonestly? You can have good chemistry but bad timing and I think that is what happened to both of us.\nWill they regret leaving us when they are ready for something serious? Probably, because they will realize that they won't find someone as good as us so easily if ever...but what do I care if she regrets it or not. We have to move on :)", "created_utc": "1648051331.0", "edited": "False", "id": "i1t61sk", "is_submitter": "False", "link_id": "t3_tkgt77", "parent_id": "t3_tkgt77", "score": "3", "subreddit": "BreakUps", "subreddit_id": "t5_2ra79"}, {"author": "MinimumCompetition85", "body": "I can't listen to \"lost on you\" by LP without starting to cry \n\n\"Just that you could cut me loose, after everything I've lost on you...is that lost on you?\" \n\nBoy does that hit different now", "created_utc": "1648020571.0", "edited": "False", "id": "i1rnvpu", "is_submitter": "True", "link_id": "t3_tk8n88", "parent_id": "t3_tk8n88", "score": "1", "subreddit": "BreakUps", "subreddit_id": "t5_2ra79"}, {"author": "MinimumCompetition85", "body": "Okay I see. Manuals can give you most of your gains anyway so just stick to it and be consistent! That way you can at least be sure that inconsistency wasn't a problem", "created_utc": "1647988231.0", "edited": "False", "id": "i1pzrmk", "is_submitter": "True", "link_id": "t3_tke74l", "parent_id": "t1_i1pz0bt", "score": "3", "subreddit": "AJelqForYou", "subreddit_id": "t5_3nmia"}, {"author": "MinimumCompetition85", "body": "Mmm idk I mean it got a little bigger at the time I was clamping so I think gains are possible. Is it just lack of consistency or did I use the wrong routine? \nWbu? Gains? Routine?", "created_utc": "1647987389.0", "edited": "False", "id": "i1pxq4t", "is_submitter": "True", "link_id": "t3_tke74l", "parent_id": "t1_i1px2qr", "score": "0", "subreddit": "AJelqForYou", "subreddit_id": "t5_3nmia"}, {"author": "MinimumCompetition85", "body": "Are you sure? Why would thousands of guys gather in online forums only to fuck with people? There are before and after pics after all aren't there?", "created_utc": "1647986850.0", "edited": "False", "id": "i1pwevj", "is_submitter": "True", "link_id": "t3_tke74l", "parent_id": "t1_i1pw3tw", "score": "4", "subreddit": "AJelqForYou", "subreddit_id": "t5_3nmia"}, {"author": "MinimumCompetition85", "body": "Absolutely \nAll of a sudden those lyrics describe you perfectly and it hurts", "created_utc": "1647986096.0", "edited": "False", "id": "i1pujdg", "is_submitter": "True", "link_id": "t3_tk8n88", "parent_id": "t1_i1pgtfo", "score": "4", "subreddit": "BreakUps", "subreddit_id": "t5_2ra79"}, {"author": "MinimumCompetition85", "body": "Hope you're okay though!", "created_utc": "1647976616.0", "edited": "False", "id": "i1p6d23", "is_submitter": "True", "link_id": "t3_tk8n88", "parent_id": "t1_i1p2dy4", "score": "2", "subreddit": "BreakUps", "subreddit_id": "t5_2ra79"}, {"author": "MinimumCompetition85", "body": "Dude Idk whats going on. Me and my ex get along so well it's scary, maybe a little too well haha. I am starting to think she's better as an ex than a gf. Now I look back at our relationship and it's so strange, feels like we were two totally different people. Crazy to think how close we've once been. I have healed, we can even make jokes about everything. She is not ready to commit to a serious relationship so it was better to break up. Spending time as friends together makes me realize how different we actually are. Life is good :)", "created_utc": "1647854844.0", "edited": "False", "id": "i1ieelx", "is_submitter": "False", "link_id": "t3_tikths", "parent_id": "t3_tikths", "score": "2", "subreddit": "BreakUps", "subreddit_id": "t5_2ra79"}, {"author": "MinimumCompetition85", "body": "Honestly, who cares? What's the point of asking such questions? To feel bad about yourself? Self pity won't help us. You know what the best response to that is? 'I love you too!' \nGo find someone who says that and appreciates you for who you are and get over your ex who apparently didn't see or care how much love you can give. Stay strong!", "created_utc": "1647597581.0", "edited": "False", "id": "i14uxzw", "is_submitter": "False", "link_id": "t3_tg8i0h", "parent_id": "t3_tg8i0h", "score": "1", "subreddit": "BreakUps", "subreddit_id": "t5_2ra79"}, {"author": "MinimumCompetition85", "body": "Same here. We were super in love and all of a sudden she breaks up with me. And on top of that met a guy she apparently fell in love with and cheated on me with him two days before the breakup. I will never be able to understand that", "created_utc": "1647363079.0", "edited": "False", "id": "i0rpoxr", "is_submitter": "False", "link_id": "t3_temhv2", "parent_id": "t3_temhv2", "score": "3", "subreddit": "BreakUps", "subreddit_id": "t5_2ra79"}, {"author": "MinimumCompetition85", "body": "No", "created_utc": "1647249013.0", "edited": "False", "id": "i0li55d", "is_submitter": "False", "link_id": "t3_tdempz", "parent_id": "t3_tdempz", "score": "1", "subreddit": "BreakUps", "subreddit_id": "t5_2ra79"}, {"author": "MinimumCompetition85", "body": "No, because she fell in love with someone else and cheated on me two days before the breakup. The guy fucked her and dumped her. Something similar happened to her before we were together. If you are still that stupid after five years of being in a happy relationship with me, you haven't learned anything! Keep falling for these douchebags and then go cry about it. You've had your chance with a decent man and blew it.", "created_utc": "1647247927.0", "edited": "False", "id": "i0lgw3r", "is_submitter": "False", "link_id": "t3_tdgzv8", "parent_id": "t3_tdgzv8", "score": "1", "subreddit": "BreakUps", "subreddit_id": "t5_2ra79"}, {"author": "MinimumCompetition85", "body": "Thank you for the encouraging words! I appreciate it :)", "created_utc": "1646666995.0", "edited": "False", "id": "hzpo808", "is_submitter": "True", "link_id": "t3_t8mo65", "parent_id": "t1_hzpnk25", "score": "1", "subreddit": "BreakUps", "subreddit_id": "t5_2ra79"}, {"author": "MinimumCompetition85", "body": "Going back and forth between being alright and being sad and thinking too much about the past", "created_utc": "1646654642.0", "edited": "False", "id": "hzp0a95", "is_submitter": "False", "link_id": "t3_t8ilmq", "parent_id": "t3_t8ilmq", "score": "2", "subreddit": "BreakUps", "subreddit_id": "t5_2ra79"}, {"author": "MinimumCompetition85", "body": "Huh?", "created_utc": "1646649709.0", "edited": "False", "id": "hzots33", "is_submitter": "False", "link_id": "t3_t82xfz", "parent_id": "t3_t82xfz", "score": "1", "subreddit": "LouderWithCrowder", "subreddit_id": "t5_3evgn"}, {"author": "MinimumCompetition85", "body": "There will be good days and bad days but overall it will get easier with time. You also have to accept that it's over and actively try to move on though. You will be alright :)", "created_utc": "1646583964.0", "edited": "False", "id": "hzl9n8x", "is_submitter": "False", "link_id": "t3_t7mcqm", "parent_id": "t3_t7mcqm", "score": "1", "subreddit": "BreakUps", "subreddit_id": "t5_2ra79"}, {"author": "MinimumCompetition85", "body": "Yes it gets easier. Evey day it gets a little easier. You will be fine!", "created_utc": "1646583813.0", "edited": "False", "id": "hzl9a4z", "is_submitter": "False", "link_id": "t3_t7mcqm", "parent_id": "t3_t7mcqm", "score": "1", "subreddit": "BreakUps", "subreddit_id": "t5_2ra79"}, {"author": "MinimumCompetition85", "body": " I hope so too, but you will see, it gets easier with time:)", "created_utc": "1646575611.0", "edited": "False", "id": "hzkro7q", "is_submitter": "False", "link_id": "t3_t7oh2t", "parent_id": "t1_hzkl7gz", "score": "2", "subreddit": "BreakUps", "subreddit_id": "t5_2ra79"}, {"author": "MinimumCompetition85", "body": "It's been 3 months now and I am slowly beginning to realize that we were not perfect for each other. Sure we had amazing and happy 5 years together and I would have loved to marry her. But in the end she wants different things in life, or doesn't know what she wants. It's hard to accept that she was not willing to work on the relationship but in the end, if what we want in life are two different things, it's better to break up. We are still close friends though which actually helps because now I see her for who she really is. If we wouldn't be in contact I would make up this perfect person in my mind and only remember the good things. But in spending time with her I can see her flaws and that even though we have so much in common there are important things in which we are very different. I see that now and I hope she will find someone she can be happy with long term, if that's what she wants and I am sure I will find someone too. Life goes on.", "created_utc": "1646558759.0", "edited": "False", "id": "hzk4psf", "is_submitter": "False", "link_id": "t3_t7oh2t", "parent_id": "t3_t7oh2t", "score": "7", "subreddit": "BreakUps", "subreddit_id": "t5_2ra79"}, {"author": "MinimumCompetition85", "body": "No never. We had a super great time for the last five years that I don't want to miss. I learned so much from this, no matter how bad it ended. I will always look back at this time with a smile on my face. Why would I want to forget that? Even if things don't last forever we can still appreciate the great times we had. Now life has opened a new exciting chapter for me and I am looking forward to it!", "created_utc": "1646389936.0", "edited": "False", "id": "hzaux4q", "is_submitter": "False", "link_id": "t3_t5rz7u", "parent_id": "t3_t5rz7u", "score": "1", "subreddit": "BreakUps", "subreddit_id": "t5_2ra79"}, {"author": "MinimumCompetition85", "body": "I learned that no matter what you plan, life can be unpredictable. It's important to understand that things won't always turn out the way we want them to. We have to accept this fact and be able to adapt and make the best out of every situation.", "created_utc": "1646039226.0", "edited": "False", "id": "hyrayrj", "is_submitter": "False", "link_id": "t3_t2v71u", "parent_id": "t3_t2v71u", "score": "3", "subreddit": "BreakUps", "subreddit_id": "t5_2ra79"}, {"author": "MinimumCompetition85", "body": "Could you elaborate how I could set boundaries? I am still new and don't want to risk my probation period", "created_utc": "1642453005.0", "edited": "False", "id": "ht34htw", "is_submitter": "False", "link_id": "t3_s68nnj", "parent_id": "t1_ht32pev", "score": "2", "subreddit": "consulting", "subreddit_id": "t5_2r121"}, {"author": "MinimumCompetition85", "body": "Porn addiction", "created_utc": "1641815715.0", "edited": "False", "id": "hs1w2wq", "is_submitter": "False", "link_id": "t3_rzyn80", "parent_id": "t3_rzyn80", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "MinimumCompetition85", "body": "Hey I know not everything was good between us and it's funny that I am the one bringing it up and not you but I really hope that this year will be a good year for you. Don't let anyone play with you, you don't deserve this, live and don't be too impatient and you will see one day you will meet the right one and I will find the right one for me. We were both already very close but in the end it wasn't enough and it's a pity but it's also okay. But we should really have a talk about it all before start this \"let's just be friends\" thing. See you :)\n\nIt's not something I would have said I actually texted this to her and she agrees with me. We will talk soon", "created_utc": "1641057512.0", "edited": "False", "id": "hqtoyqi", "is_submitter": "False", "link_id": "t3_rt78q1", "parent_id": "t3_rt78q1", "score": "1", "subreddit": "BreakUps", "subreddit_id": "t5_2ra79"}, {"author": "MinimumCompetition85", "body": "If she is okay with you masturbating to her photos or even encourages you, it's okay. Just don't do it behind her back. Cut out porn entirely and don't masturbate too often and you will see it will get better with time", "created_utc": "1640944603.0", "edited": "False", "id": "hqnz6wk", "is_submitter": "False", "link_id": "t3_rso0kk", "parent_id": "t3_rso0kk", "score": "1", "subreddit": "pornfree", "subreddit_id": "t5_2rglh"}, {"author": "MinimumCompetition85", "body": "I am pretty conservative so I dislike this whole hookup culture as well. Sex is something that should be shared between two people who love each other. I thought I could get over my ex by visiting a hooker and it didn't make it better one bit. In fact now that I know what sex is like with a partner you love, sex without that just doesn't hold a candle to it anymore. It is so much more than just being horny. So I don't want any fuck buddies or one night stands. I want a relationship with someone and that someone will receive all my sexual attention:) hooking up just makes people forget they are alone for a while, but at the end of the day, what I truly want is a partner. Not someone I can have fun with.", "created_utc": "1640902804.0", "edited": "False", "id": "hqlra0z", "is_submitter": "False", "link_id": "t3_rs669t", "parent_id": "t3_rs669t", "score": "2", "subreddit": "BreakUps", "subreddit_id": "t5_2ra79"}, {"author": "MinimumCompetition85", "body": "Boy that escalated quickly", "created_utc": "1640887470.0", "edited": "False", "id": "hqknx8p", "is_submitter": "False", "link_id": "t3_rrvjld", "parent_id": "t3_rrvjld", "score": "3", "subreddit": "niceguys", "subreddit_id": "t5_2rvxp"}, {"author": "MinimumCompetition85", "body": "Using anything as a coping mechanism is never the way to go. It will relieve the pain temporarily but deep down it will keep you away from the things you truly want. Porn doesn't make anyone happy. It only numbs the pain.", "created_utc": "1640797790.0", "edited": "False", "id": "hqfi6hp", "is_submitter": "False", "link_id": "t3_rqrv4n", "parent_id": "t3_rqrv4n", "score": "1", "subreddit": "pornfree", "subreddit_id": "t5_2rglh"}, {"author": "MinimumCompetition85", "body": "Have some dignity and turn her down. Why does she want you back? Because you are a save haven? What if it worked out with the guy? Would she have come back? Seems like you are only her backup plan. Let her suffer the consequences of her decisions. If she truly understands you were the better guy she will regret losing you. Hopefully she won't make the same mistake twice. Nobody can tell why she texts you back now, but it's too early anyway", "created_utc": "1640797605.0", "edited": "False", "id": "hqfhpe6", "is_submitter": "False", "link_id": "t3_rqpk93", "parent_id": "t3_rqpk93", "score": "1", "subreddit": "BreakUps", "subreddit_id": "t5_2ra79"}, {"author": "MinimumCompetition85", "body": "Aw thank you :) yeah she knows I am a good guy and that I would have never done that to her. We could have had a really nice and loving relationship but in the end she is not who I thought she was. It's like she is a totally different person. I hope if she EVER finds a good guy like me again (among all the assholes of which there are plenty) she will appreciate it and not do it again.", "created_utc": "1640642300.0", "edited": "False", "id": "hq75xuc", "is_submitter": "True", "link_id": "t3_rpp50w", "parent_id": "t1_hq71dye", "score": "2", "subreddit": "BreakUps", "subreddit_id": "t5_2ra79"}, {"author": "MinimumCompetition85", "body": "Yes I guess you are right. It just hurts like hell and I feel like I will never be able to truly love and trust again.", "created_utc": "1640623820.0", "edited": "False", "id": "hq5wt02", "is_submitter": "True", "link_id": "t3_rpp50w", "parent_id": "t1_hq5m1t9", "score": "7", "subreddit": "BreakUps", "subreddit_id": "t5_2ra79"}, {"author": "MinimumCompetition85", "body": "Yeah she did. I jut hope she understands she destroyed the only good relationship we both ever had and that she broke the heart of the only person who was always on her side. You can't just jump into another happy relationship after that.", "created_utc": "1640623774.0", "edited": "False", "id": "hq5wov3", "is_submitter": "True", "link_id": "t3_rpp50w", "parent_id": "t1_hq5kgg6", "score": "6", "subreddit": "BreakUps", "subreddit_id": "t5_2ra79"}, {"author": "MinimumCompetition85", "body": "I am so sorry to hear that! Trust me, don't take her back as hard as it sounds. Once a cheater always a cheater! You will never be able to trust her again the way you have so the relationship you had with her is gone. It would never be the same. I know you wish back the good old times, but they will never come back because there is no coming back from cheating. As hard as it sounds but it's over. Do yourself a favor and don't take her back. \nFor what it's worth I had something similar happen to me, my gf of almost 5 years cheated on me two days before she broke up. Two days ago we saw each other for the first time again after the breakup. And her biggest concern was how she could get the guy she fell in love with and cheated on me with. Apparently he fucked her and ghosted her. Karma is a bitch", "created_utc": "1640616323.0", "edited": "False", "id": "hq5fuwu", "is_submitter": "False", "link_id": "t3_rpi3ke", "parent_id": "t3_rpi3ke", "score": "4", "subreddit": "BreakUps", "subreddit_id": "t5_2ra79"}, {"author": "MinimumCompetition85", "body": "My gf was completely blonde and went brunette like 3 weeks after the breakup. She was the dumper.", "created_utc": "1640615742.0", "edited": "False", "id": "hq5epeh", "is_submitter": "False", "link_id": "t3_rpfxhy", "parent_id": "t3_rpfxhy", "score": "1", "subreddit": "BreakUps", "subreddit_id": "t5_2ra79"}, {"author": "MinimumCompetition85", "body": "Hey I am not telling you how to live your life, if you want to watch it despite all the negative effects it has go ahead and do what you want. But the evidence cannot be denied.", "created_utc": "1640454832.0", "edited": "False", "id": "hpxprqp", "is_submitter": "True", "link_id": "t3_qzip6x", "parent_id": "t1_hpxoq2g", "score": "1", "subreddit": "PrematureEjaculation", "subreddit_id": "t5_2tjvf"}, {"author": "MinimumCompetition85", "body": "Wait a second, did I read this right? He comes and flirts with ME, ignoring my gf? Haha well I'd be flattered but would tell him that I am into girls", "created_utc": "1640260580.0", "edited": "False", "id": "hpo9drr", "is_submitter": "False", "link_id": "t3_rl77dx", "parent_id": "t3_rl77dx", "score": "1", "subreddit": "seduction", "subreddit_id": "t5_2qhrv"}, {"author": "MinimumCompetition85", "body": "I am sorry to say that, but it sounds like you are making excuses for watching porn. I don't know if such a study on premature ejaculation exists, so I can only go by anecdotal evidence. I have myself experienced that I could last longer if I stayed away from porn. My own unscientific explanation for this is that it might have something to do with the Coolidge effect, but like I said that is only my own theory. That being said, there is overwhelming evidence on the negative effects pornography has on the brain, which is also what YBOP focused on. So regardless of premature ejaculation we are better off to simply stay away from it. Premature ejaculation can be caused by bad masturbation habits which one is more likely to develop when it is in conjunction with porn.", "created_utc": "1640255760.0", "edited": "False", "id": "hpo37ap", "is_submitter": "True", "link_id": "t3_qzip6x", "parent_id": "t1_hpkep0x", "score": "1", "subreddit": "PrematureEjaculation", "subreddit_id": "t5_2tjvf"}, {"author": "MinimumCompetition85", "body": "American: $50,000.00\n\nGerman: 50.000,00 €", "created_utc": "1640082118.0", "edited": "False", "id": "hper4ge", "is_submitter": "False", "link_id": "t3_rkwj6f", "parent_id": "t3_rkwj6f", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "MinimumCompetition85", "body": "I was thinking about it, but I am going back and forth from forgiving her to hating her so idk what to do. Maybe wait if she would text me or not and then decide on Christmas day or even the 26th. I know she also wants to talk to me so either of us will break NC soon, a part of me wants it to be her haha", "created_utc": "1640081866.0", "edited": "False", "id": "hpeqtmi", "is_submitter": "False", "link_id": "t3_rl8d8q", "parent_id": "t3_rl8d8q", "score": "1", "subreddit": "BreakUps", "subreddit_id": "t5_2ra79"}, {"author": "MinimumCompetition85", "body": "Stay strong man, you got this!💪", "created_utc": "1640017638.0", "edited": "False", "id": "hpb66ki", "is_submitter": "False", "link_id": "t3_rkl00s", "parent_id": "t1_hpb4pb2", "score": "1", "subreddit": "BreakUps", "subreddit_id": "t5_2ra79"}, {"author": "MinimumCompetition85", "body": "Wow that sounds like alcoholism. 2 bottles of wine 4 days a week? Wow and here I thought I drink a lot haha \n\nIt's better not to drink. I don't plan to start drinking now because of this shit. Becoming an alcoholic because my gf dumped me is the last thing I want.", "created_utc": "1640016641.0", "edited": "False", "id": "hpb3t2b", "is_submitter": "False", "link_id": "t3_rkl00s", "parent_id": "t1_hpb2xig", "score": "1", "subreddit": "BreakUps", "subreddit_id": "t5_2ra79"}, {"author": "MinimumCompetition85", "body": "I had my \"post breakup binge drinking until I get sick\" night last week so I will pass on that haha but yeah it is strange to be all alone. I'll probably Skype with my parents or something", "created_utc": "1640015863.0", "edited": "False", "id": "hpb1zs2", "is_submitter": "False", "link_id": "t3_rkl00s", "parent_id": "t1_hpb0bjx", "score": "1", "subreddit": "BreakUps", "subreddit_id": "t5_2ra79"}, {"author": "MinimumCompetition85", "body": "Yes and I will in fact be alone. My parents are in Bulgaria, I don't have any friends I could spend the holidays with and my gf broke up with me. Usually we would spend the holidays together but this year will be the first Christmas I will be completely alone", "created_utc": "1640014702.0", "edited": "False", "id": "hpazbcx", "is_submitter": "False", "link_id": "t3_rkl00s", "parent_id": "t3_rkl00s", "score": "1", "subreddit": "BreakUps", "subreddit_id": "t5_2ra79"}, {"author": "MinimumCompetition85", "body": "Dumper of course. You start having doubts, you are not happy anymore, you think about pros and cons you think a lot about breaking up before the actual breakup happens. That gives you a headstart. You can go through your sad phase and realize its over way faster than the dumpee. \nI got dumped by my gf and it fucking hurt. I came back to my hometown, thinking we would finally move in together and everything was alright. And then she just dumped me. 3 weeks later and I am still not over it. A dumpee will always be surprised whereas the dumper has thought about it for a long time already.", "created_utc": "1640014550.0", "edited": "False", "id": "hpayywo", "is_submitter": "False", "link_id": "t3_rkmz8r", "parent_id": "t3_rkmz8r", "score": "10", "subreddit": "BreakUps", "subreddit_id": "t5_2ra79"}, {"author": "MinimumCompetition85", "body": "I know what you are going through man, no worries. I had an emotional rollercoaster the last three weeks, it's normal after a breakup. But it will get better with time! Just try to be the best version of yourself and you will start to feel better :) pick up a new or old hobby, surround yourself with people who want the best for you and don't let the negative emotions take over. Staying positive, which entails forgiving, will make you feel much better. Or do you want to be the sorry guy who couldn't get over his ex and takes every chance to shit on her? You are better than this! :)", "created_utc": "1639997236.0", "edited": "False", "id": "hpa5fop", "is_submitter": "False", "link_id": "t3_ri8a2a", "parent_id": "t1_hpa53ah", "score": "2", "subreddit": "BreakUps", "subreddit_id": "t5_2ra79"}, {"author": "MinimumCompetition85", "body": "Well I don't think you are in any position to call her a snake , you don't know either of us. I know you just want to help, but that's uncalled for. I loved this girl for almost 5 years, and I know she loved me. We didn't even break up on bad terms but yeah apparently she is not the good angel I thought she was. Probably nobody is, we all make mistakes. And sometimes we hurt the ones we love the most. That doesn't make us bad people. True forgiveness begins when you realize that nobody is perfect. I hope one day we will all find the one for us and be happy again :)", "created_utc": "1639996368.0", "edited": "False", "id": "hpa4f0i", "is_submitter": "False", "link_id": "t3_ri8a2a", "parent_id": "t1_hpa3z0c", "score": "1", "subreddit": "BreakUps", "subreddit_id": "t5_2ra79"}, {"author": "MinimumCompetition85", "body": "Yes man I know what you mean. I don't think she wants to talk to get me back though. It's just the way it all ended was not very nice for both of us. I think we both want closure. At least I know why I want to talk to her, to better understand what happened etc. But honestly I don't know why she wants to talk to me. To tell me she's sorry? I don't know. Let's see what happens. This talk won't happen tomorrow anyway. Maybe in a few weeks when we both had some time for ourselves. We are NC right now for almost three weeks now.", "created_utc": "1639995707.0", "edited": "False", "id": "hpa3mzy", "is_submitter": "False", "link_id": "t3_ri8a2a", "parent_id": "t1_hpa3a0i", "score": "2", "subreddit": "BreakUps", "subreddit_id": "t5_2ra79"}, {"author": "MinimumCompetition85", "body": "Exactly and that's what a new partner has to accept. That we are heartbroken and traumatized by that experience. We can love them enough but we will not go crazy again, unless...well...maybe she will be the one who can open our hearts again who knows. And if there will ever be someone who can do that, she will be the one, definitely. \n\nA mutual friend of ours told me that my ex wants to talk to me, which is good because I want to talk to her to. I think this will be good to just talk it all out and have some closure. After the talk I will also know if there is a future for us or not, so that would erase all the \"what ifs\" I have in my head now.", "created_utc": "1639994707.0", "edited": "False", "id": "hpa2gj2", "is_submitter": "False", "link_id": "t3_ri8a2a", "parent_id": "t1_hpa22e8", "score": "1", "subreddit": "BreakUps", "subreddit_id": "t5_2ra79"}, {"author": "MinimumCompetition85", "body": "I already know that consulting is nothing for me for the long run. I might do if for a year or two, maybe three but that's it. \nAll this traveling? Man I am 28, how the fuck am I supposed to find a honey and have a family if I am always on the road? It's not for me, and I don't think a career is the most meaningful thing I could spend my time on. I want a decent job, but at the end of the day I want to come home to my wife and kids and actually have a home. I don't think the consulting lifestyle is compatible with this.", "created_utc": "1639994464.0", "edited": "False", "id": "hpa2685", "is_submitter": "False", "link_id": "t3_rk9bxv", "parent_id": "t3_rk9bxv", "score": "3", "subreddit": "consulting", "subreddit_id": "t5_2r121"}, {"author": "MinimumCompetition85", "body": "Sure but I thought she was the perfect match for me. And she actually was for so long, we were so happy. I just can't imagine her finding someone she shares so many things with the way she did with me. \nAnd what if I find someone new and feel like she is the one? I will be reminded that I already felt that about my ex, so what would be different that time? I have no clue if I can ever love and trust wholeheartedly again the way I have. It feels really shitty to realize that, but that's something my new partner would have to live with I guess. On the other hand, I am not the good guy either, I also did some bad things during the relationship, no cheating but still bad. Maybe no matter how good a person is, we all make bad decisions. Maybe the only way to come to peace is forgiveness, both for ourselves and for the ones who wronged us.", "created_utc": "1639993814.0", "edited": "False", "id": "hpa1f9o", "is_submitter": "False", "link_id": "t3_ri8a2a", "parent_id": "t1_hpa0z00", "score": "2", "subreddit": "BreakUps", "subreddit_id": "t5_2ra79"}, {"author": "MinimumCompetition85", "body": "I feel you man, I got cheated on by the only girl I thought had too pure a soul to actually do that. My trust in women in general is shattered. But that wouldn't make it right to hurt women, I will treat others the way I want to be treated.", "created_utc": "1639989895.0", "edited": "False", "id": "hp9wskw", "is_submitter": "False", "link_id": "t3_ri8a2a", "parent_id": "t1_hp9s0r6", "score": "2", "subreddit": "BreakUps", "subreddit_id": "t5_2ra79"}, {"author": "MinimumCompetition85", "body": "Well someone told me that at smaller game dev studios the producers are also the project managers. But maybe I should seek out opportunities at bigger studios or even publishers. \nYeah I thought so, it's actually also helpful for consulting, so nothing I wouldn't have done anyway", "created_utc": "1639988270.0", "edited": "False", "id": "hp9utl0", "is_submitter": "False", "link_id": "t3_rk93gx", "parent_id": "t1_hp9rvrg", "score": "1", "subreddit": "careerchange", "subreddit_id": "t5_2y32k"}, {"author": "MinimumCompetition85", "body": "That's interesting! What do product managers or game producers travel for? I thought they would be sitting at the office, working closely with the devs teams. I mean I don't need 0% travel, but 4 days a week every week is just too much for me.\nLike I said, game producer/product manager is what I am aiming for. \nConsulting gives me analytical and problem solving as well as presentation skills, so should I just learn about the gaming industryl and product management in general? Also they analyze a lot of data so I guess python, r, sql, Tableau etc would also be necessary?", "created_utc": "1639984323.0", "edited": "False", "id": "hp9ptjf", "is_submitter": "False", "link_id": "t3_rk93gx", "parent_id": "t1_hp9pagp", "score": "1", "subreddit": "careerchange", "subreddit_id": "t5_2y32k"}, {"author": "MinimumCompetition85", "body": "What skills should I develop if I want to make the leap?", "created_utc": "1639983623.0", "edited": "False", "id": "hp9ovh1", "is_submitter": "False", "link_id": "t3_rk93gx", "parent_id": "t1_hp9nsmr", "score": "1", "subreddit": "careerchange", "subreddit_id": "t5_2y32k"}, {"author": "MinimumCompetition85", "body": "Yeah maybe I should do that, thanks for your advise!", "created_utc": "1639982927.0", "edited": "False", "id": "hp9nx2k", "is_submitter": "False", "link_id": "t3_rk93gx", "parent_id": "t1_hp9nsmr", "score": "1", "subreddit": "careerchange", "subreddit_id": "t5_2y32k"}, {"author": "MinimumCompetition85", "body": "It just fascinates me to be part of the team who develops a product the customers enjoy. It's entertainment and since there is no shortage of bad games out there, I hope to give gamers what they would love to play. If a game succeeds and has a good score, it would make me proud. It's also a good combination of analytical and creative work. Plus less traveling", "created_utc": "1639980973.0", "edited": "False", "id": "hp9l4ao", "is_submitter": "False", "link_id": "t3_rk93gx", "parent_id": "t1_hp97ujt", "score": "1", "subreddit": "careerchange", "subreddit_id": "t5_2y32k"}, {"author": "MinimumCompetition85", "body": "Hey thanks for the help man, I will check it out!", "created_utc": "1639921590.0", "edited": "False", "id": "hp60skq", "is_submitter": "True", "link_id": "t3_rji3m1", "parent_id": "t1_hp5dltk", "score": "1", "subreddit": "gamedev", "subreddit_id": "t5_2qi0a"}, {"author": "MinimumCompetition85", "body": "I have but I don't have the skills to be a producer now. Doesn't a producer also need to know the basics of game design, coding etc? How could I acquire the right skills on the side to be considered for such a position? Because I don't have the time to go to an academy or university full time", "created_utc": "1639901941.0", "edited": "False", "id": "hp5bube", "is_submitter": "False", "link_id": "t3_rjbsje", "parent_id": "t1_hp3ldg2", "score": "1", "subreddit": "ProductManagement", "subreddit_id": "t5_2r8ul"}, {"author": "MinimumCompetition85", "body": "Yeah you are right, I picked it because I like what we do. We are focused on turnaround management and Restructuring. I like to he involved in saving a company from going bankrupt. \nMaybe I will get used to it, idk. I am in in bad place mentally right now, so maybe that's why everything sucks to me (gf broke up and some other problems). Maybe after a while I will get used to it or it won't bother me any more", "created_utc": "1639901649.0", "edited": "False", "id": "hp5bhth", "is_submitter": "False", "link_id": "t3_rjddhc", "parent_id": "t1_hp3twgu", "score": "1", "subreddit": "consulting", "subreddit_id": "t5_2r121"}, {"author": "MinimumCompetition85", "body": "Compare yourself to who you were yesterday, not to who someone else is today\n- Jordan Peterson", "created_utc": "1639862972.0", "edited": "False", "id": "hp3d8mp", "is_submitter": "False", "link_id": "t3_rje54b", "parent_id": "t3_rje54b", "score": "4", "subreddit": "pornfree", "subreddit_id": "t5_2rglh"}, {"author": "MinimumCompetition85", "body": "There is no way I would bring this up during my probation period haha \nIsn't it our job to question everything and look for things to improve on? Hey if traveling four days a week is absolutely necessary to do our best, I guess there is nothing we can do about that. \nAnyway, let's see what the next weeks and months bring", "created_utc": "1639858874.0", "edited": "False", "id": "hp34gln", "is_submitter": "False", "link_id": "t3_rjddhc", "parent_id": "t1_hp325te", "score": "-4", "subreddit": "consulting", "subreddit_id": "t5_2r121"}, {"author": "MinimumCompetition85", "body": "Alright, that's good to know!", "created_utc": "1639857399.0", "edited": "False", "id": "hp317td", "is_submitter": "False", "link_id": "t3_rjddhc", "parent_id": "t1_hp30gp6", "score": "2", "subreddit": "consulting", "subreddit_id": "t5_2r121"}, {"author": "MinimumCompetition85", "body": "I didn't make up my mind yet, and to be clear I don't want to leave the company, but since we are very small and we are planning to grow, I am thinking about how we should go about this? Travel all the time or maybe look at what similar companies do who don't travel as much? There are things that should be done in person with the client, but there are also things that can be done remotely. Now that I think about it, maybe it is necessary for me to show up a little more often now because I am new and the client needs to get to know me. I know other colleagues work on this project as well and they didn't come with us, so. It's too early to say if the travel will stay at this level or not. Just some thoughts. I thought many people have gotten used to remote work and don't travel as much anymore.", "created_utc": "1639857250.0", "edited": "False", "id": "hp30vpv", "is_submitter": "False", "link_id": "t3_rjddhc", "parent_id": "t1_hp304he", "score": "2", "subreddit": "consulting", "subreddit_id": "t5_2r121"}, {"author": "MinimumCompetition85", "body": "I really like the work that we do. Before I started here I did an internship with a similar consulting company, they have the same specialization but don't travel nearly as often, so it is possible. Idk maybe it was just a coincidence I had to travel twice in that short timespan, but it just makes me think, what would be the optimal solution?", "created_utc": "1639856917.0", "edited": "False", "id": "hp305d1", "is_submitter": "False", "link_id": "t3_rjddhc", "parent_id": "t1_hp2zhjw", "score": "-8", "subreddit": "consulting", "subreddit_id": "t5_2r121"}, {"author": "MinimumCompetition85", "body": "Exactly, it is this shift that I don't really see at my company, and I don't want us to be too old school in that regard to attract new talent. Now of course if the client wants it, we should be there. But I don't know if the client is the driving force behind it or the partner. I mean there has to be some benefit, otherwise why invest all the commute time and money for trains and hotels? I just didn't see why I had to hop on a train for an interview, that's all", "created_utc": "1639856598.0", "edited": "False", "id": "hp2zgg1", "is_submitter": "False", "link_id": "t3_rjddhc", "parent_id": "t1_hp2rprc", "score": "-2", "subreddit": "consulting", "subreddit_id": "t5_2r121"}, {"author": "MinimumCompetition85", "body": "Don't do it man. Don't corrupt your soul with this. You have to be the better person. If you do that, does that make you a good person? No, you are angry because you got hurt, but willfully hurting others just for revenge is pure evil. Don't do it!", "created_utc": "1639765211.0", "edited": "False", "id": "hoy5spr", "is_submitter": "False", "link_id": "t3_ri8a2a", "parent_id": "t1_howj8sa", "score": "1", "subreddit": "BreakUps", "subreddit_id": "t5_2ra79"}, {"author": "MinimumCompetition85", "body": "Congrats man, good for you! Wish someone had a crush on me haha I feel like nobody loves me and the one who did...well...there is a whole post about that", "created_utc": "1639764770.0", "edited": "False", "id": "hoy4mz7", "is_submitter": "False", "link_id": "t3_rige96", "parent_id": "t3_rige96", "score": "2", "subreddit": "BreakUps", "subreddit_id": "t5_2ra79"}, {"author": "MinimumCompetition85", "body": "\"Funny how we could still be that close if you hadn't broken it up\"", "created_utc": "1639764641.0", "edited": "False", "id": "hoy4awp", "is_submitter": "False", "link_id": "t3_rim3cy", "parent_id": "t3_rim3cy", "score": "62", "subreddit": "BreakUps", "subreddit_id": "t5_2ra79"}, {"author": "MinimumCompetition85", "body": "If you can hear it you are probably too close to her", "created_utc": "1639763980.0", "edited": "False", "id": "hoy2jxy", "is_submitter": "False", "link_id": "t3_ri27w8", "parent_id": "t3_ri27w8", "score": "1", "subreddit": "BreakUps", "subreddit_id": "t5_2ra79"}, {"author": "MinimumCompetition85", "body": "It was close to 5 years. So does 4 years, 10 months and 11 days count? \nYes of course it hurts, it hurts like hell to see the future I envisioned for us disappear before my inner eye. A future I would have enjoyed. Now I am looking into a black void. How is my future going to look like? Will I ever be able to trust and love again? I have no clue...", "created_utc": "1639763138.0", "edited": "False", "id": "hoy0c2w", "is_submitter": "False", "link_id": "t3_rig0wb", "parent_id": "t3_rig0wb", "score": "6", "subreddit": "BreakUps", "subreddit_id": "t5_2ra79"}, {"author": "MinimumCompetition85", "body": "It's not pleasant. But that made me realize even more that I made myself totally dependent on my girlfriend. Now that she is gone, I have almost nobody. No wonder she lost attraction. Looking back at it, I am sure I could have done a lot of things way better and we would probably still be happily together. The only thing I can do now is to work towards a better future, with or without her.", "created_utc": "1639560667.0", "edited": "False", "id": "homjrs5", "is_submitter": "False", "link_id": "t3_rgdh3d", "parent_id": "t3_rgdh3d", "score": "1", "subreddit": "BreakUps", "subreddit_id": "t5_2ra79"}, {"author": "MinimumCompetition85", "body": "All the best to you two! I am glad I could help :)", "created_utc": "1638996251.0", "edited": "False", "id": "hnrjbds", "is_submitter": "False", "link_id": "t3_rbwp5b", "parent_id": "t1_hnrj1qt", "score": "2", "subreddit": "pornfree", "subreddit_id": "t5_2rglh"}, {"author": "MinimumCompetition85", "body": "Please for the love of God, stop interacting sexually with real human beings in any way immediately!!!! Porn is one thing, because in the end, you are by yourself, you should stop that too but at least it's not cheating. But sexting or even Omegle etc. is wrong, it is so wrong! Stop it now if you don't want to happen to you what happened to me. Trust me, nobody gets away with anything ever! You will regret it for the rest of your life! And for what? An orgasm? It is not worth it! Be better than this! Be the man your girl can rely on! Honest, trustworthy, and with a clear conscience!", "created_utc": "1638995719.0", "edited": "False", "id": "hnrhw70", "is_submitter": "False", "link_id": "t3_rbwp5b", "parent_id": "t1_hnrh4eo", "score": "3", "subreddit": "pornfree", "subreddit_id": "t5_2rglh"}, {"author": "MinimumCompetition85", "body": "I was the same. I was sexting with random girls anonymously. I had a bad conscience and confessed to my gf. She didn't seem too upset but she didn't like it either. Fast forward a year or so and last week she cheated on me IRL and broke up with me. I can't help but think this is Karma, even though the reasons mentioned for the breakup where completely different. I should have never done that. It hit me like a wall of bricks, I logged on again and thought \"what the hell, she cheated on me and now I am single so it's okay\" Oooooh so NOW it's okay? Meaning it wasn't okay before? That made me realize I actually cheated on her and now I feel like I deserve what happened to me.", "created_utc": "1638995235.0", "edited": "False", "id": "hnrgm98", "is_submitter": "False", "link_id": "t3_rbwp5b", "parent_id": "t1_hnqwg5i", "score": "2", "subreddit": "pornfree", "subreddit_id": "t5_2rglh"}, {"author": "MinimumCompetition85", "body": "Oh that sounds so sad! I just wanna give you a hug! Everything will.be fine though, time heals all the wounds :)", "created_utc": "1638943658.0", "edited": "False", "id": "hnoskdg", "is_submitter": "True", "link_id": "t3_rbc3ck", "parent_id": "t1_hnnki3i", "score": "1", "subreddit": "BreakUps", "subreddit_id": "t5_2ra79"}, {"author": "MinimumCompetition85", "body": "Yes", "created_utc": "1638914603.0", "edited": "False", "id": "hnn8d6t", "is_submitter": "False", "link_id": "t3_rb38wk", "parent_id": "t3_rb38wk", "score": "1", "subreddit": "pornfree", "subreddit_id": "t5_2rglh"}, {"author": "MinimumCompetition85", "body": "I also think that forgiveness is key, but idk if I can ever truly forgive her cheating on me. Part of me is angry and hates her, part of me puts the blame on me, part of me wants her back because I miss the good times we had and also a part of me wants to be good friends....it's really confusing haha", "created_utc": "1638914455.0", "edited": "False", "id": "hnn80vx", "is_submitter": "False", "link_id": "t3_rb7w7w", "parent_id": "t3_rb7w7w", "score": "22", "subreddit": "BreakUps", "subreddit_id": "t5_2ra79"}, {"author": "MinimumCompetition85", "body": "Yes my mistake was I depended on her for my happiness. I lost many friends and she was basically the only person left for me, she was my life. I have to be happy without a girl and a girl would just be the cherry on top. I think that would make me more attractive as a partner and maybe that's a reason for why she left me, consciously or not", "created_utc": "1638914043.0", "edited": "False", "id": "hnn72f5", "is_submitter": "False", "link_id": "t3_razsnm", "parent_id": "t3_razsnm", "score": "2", "subreddit": "BreakUps", "subreddit_id": "t5_2ra79"}, {"author": "MinimumCompetition85", "body": "Hard to quantify, idk maybe 10%, it was just a few days ago", "created_utc": "1638785127.0", "edited": "False", "id": "hnfydfb", "is_submitter": "False", "link_id": "t3_r9i7a8", "parent_id": "t3_r9i7a8", "score": "1", "subreddit": "BreakUps", "subreddit_id": "t5_2ra79"}, {"author": "MinimumCompetition85", "body": "Those are all the questions I have as well. We both told each other countless times how much we loved each other and that we wanted to spend the rest of our lives together. And now I am the only one who still feels this way, she doesn't love me anymore.\nI can't wrap my head around it, why did she stop loving me? I hope that she will regret it and come back into my arms bit I just talked to one of her friends today and she told me that my gf is over me, she already has gone through the sad phase...wow....but it helped for a bit. I need to get my life in order and work on myself. I still hope that one day we can be friends and be happy for one another when we meet someone. It's almost as if she was my beinaheleidenschaftsgegendstand even though I thought she was my lebenslangerschicksalsschatz. And that is hard to get over", "created_utc": "1638737168.0", "edited": "False", "id": "hndccbo", "is_submitter": "False", "link_id": "t3_r92hwf", "parent_id": "t3_r92hwf", "score": "1", "subreddit": "BreakUps", "subreddit_id": "t5_2ra79"}, {"author": "MinimumCompetition85", "body": "Thanks I might give it a try", "created_utc": "1638713037.0", "edited": "False", "id": "hnbobki", "is_submitter": "True", "link_id": "t3_r9bo3m", "parent_id": "t1_hnbo7xn", "score": "2", "subreddit": "BreakUps", "subreddit_id": "t5_2ra79"}, {"author": "MinimumCompetition85", "body": "Yeah me too, it's really tough", "created_utc": "1638699328.0", "edited": "False", "id": "hnb5ff6", "is_submitter": "True", "link_id": "t3_r9bo3m", "parent_id": "t1_hnb5cqk", "score": "7", "subreddit": "BreakUps", "subreddit_id": "t5_2ra79"}, {"author": "MinimumCompetition85", "body": "Be careful though. I am in a similar position, but that only stems from the idea tha my gf will actually regret leaving me and want me back. Ofc that would be satisfactory for me and there would be a chance for us to be happy again, which is exactly what I am craving right now. \n\nSo, what if he doesn't regret it regardless of your growth? How would that make you feel? Don't do it for him to regret it, do it to become better for yourself!", "created_utc": "1638658526.0", "edited": "False", "id": "hn92wgc", "is_submitter": "False", "link_id": "t3_r8y45w", "parent_id": "t1_hn8klo9", "score": "3", "subreddit": "BreakUps", "subreddit_id": "t5_2ra79"}, {"author": "MinimumCompetition85", "body": "I am really happy for you!!!", "created_utc": "1638653900.0", "edited": "False", "id": "hn8s2gn", "is_submitter": "False", "link_id": "t3_r8uyfe", "parent_id": "t3_r8uyfe", "score": "2", "subreddit": "BreakUps", "subreddit_id": "t5_2ra79"}, {"author": "MinimumCompetition85", "body": "Exactly my thoughts! I've been with my girl for almost 5 years (for anyone interested in the story, I have posted it [here](https://www.reddit.com/r/BreakUps/comments/r6n0vb/gf_of_almost_five_years_broke_up_with_me_and/).) We were the definition of a dream couple, everyone said that. And now I am feeling totally lost, on one hand I hate what she did to me, on the other hand if she would regret it and apologize today I would take her back in a heartbeat. I look at our WhatsApp chat and just two weeks ago we were talking about moving in together and now....I just feel so lonely and can't shake the feeling off that it was something wrong that I did in the past and now Karma sucker punched me in the face and knocked me out :((", "created_utc": "1638653796.0", "edited": "False", "id": "hn8rtv6", "is_submitter": "False", "link_id": "t3_r8uspr", "parent_id": "t3_r8uspr", "score": "2", "subreddit": "BreakUps", "subreddit_id": "t5_2ra79"}, {"author": "MinimumCompetition85", "body": "Broken", "created_utc": "1638653521.0", "edited": "False", "id": "hn8r6p8", "is_submitter": "False", "link_id": "t3_r8pjmy", "parent_id": "t3_r8pjmy", "score": "1", "subreddit": "BreakUps", "subreddit_id": "t5_2ra79"}, {"author": "MinimumCompetition85", "body": "Yeah I still have our whole chat history on my phone, from the day we met until the last message I sent to her. Just reading what we said to each other two years ago or even a few months ago, we were both so crazy in love and wanted to be together forever...how can such strong feelings disappear within a matter of weeks? I don't get it. She was my first real girlfriend and first and only big love (only had  two \"relationships\" as a teen that only lasted a couple of weeks before) and now the life I envisioned for us POOF gone...I don't know what to do... how can feelings change so quickly? How can people change so quickly? :(", "created_utc": "1638575266.0", "edited": "False", "id": "hn4r586", "is_submitter": "True", "link_id": "t3_r6n0vb", "parent_id": "t1_hn4q598", "score": "1", "subreddit": "BreakUps", "subreddit_id": "t5_2ra79"}, {"author": "MinimumCompetition85", "body": "Yes exactly. I mean part of me still wishes that her rebound relationship doesn't work and that she'll regret everything and come back to me, but on the other hand I should be able to move on if that doesn't happen. Hope is really dangerous", "created_utc": "1638513611.0", "edited": "False", "id": "hn1fbmd", "is_submitter": "True", "link_id": "t3_r6n0vb", "parent_id": "t1_hn0p5qr", "score": "1", "subreddit": "BreakUps", "subreddit_id": "t5_2ra79"}, {"author": "MinimumCompetition85", "body": "Thanks so much man! I told my mom (who is in Bulgaria rn) everything on the phone yesterday and cried like crazy. But afterwards I felt better. Today driving back from work I was super angry at my ex gf. It's like going through the 5 stages of grief all at once lol but it feels good to let the emotions go. Today I wrote her a long text message with everything I needed to say that I coulnd't say during the breakup. She read it and didn't respond but it felt good to get it all out.", "created_utc": "1638480689.0", "edited": "False", "id": "hmzgb97", "is_submitter": "True", "link_id": "t3_r6n0vb", "parent_id": "t1_hmugyv8", "score": "1", "subreddit": "BreakUps", "subreddit_id": "t5_2ra79"}, {"author": "MinimumCompetition85", "body": "Thanks so much for your encouraging words, I told my mom (who is in Bulgaria rn) everything on the phone yesterday and cried like crazy. But afterwards I felt better. Today driving back from work I was super angry at my ex gf. It's like going through the 5 stages of grief all at once lol but it feels good to let the emotions go. Today I wrote her a long text message with everything I needed to say that I coulnd't say during the breakup. She read it and didn't respond but it felt good to get it all out.", "created_utc": "1638480573.0", "edited": "False", "id": "hmzfzwa", "is_submitter": "True", "link_id": "t3_r6n1m2", "parent_id": "t1_hmvr789", "score": "1", "subreddit": "heartbreak", "subreddit_id": "t5_2rcye"}, {"author": "MinimumCompetition85", "body": "Thank you! I have to remind myself that the person I loved would have never done that to me, so she changed into another person and that person I once loved simply does not exist anymore in that sense. You are right, I really need to focus on my job now!", "created_utc": "1638394208.0", "edited": "False", "id": "hmujuzm", "is_submitter": "True", "link_id": "t3_r6n1m2", "parent_id": "t1_hmua7bj", "score": "1", "subreddit": "heartbreak", "subreddit_id": "t5_2rcye"}, {"author": "MinimumCompetition85", "body": "Thank you so much for your kind words! I have a folder with all our videos and pictures that accumulated over the last 5 years (even from before we were together). I wanted to delete them and then quickly restored them. What do you think I should do? Delete everything? I feel if I keep them and any kind of hope in me, it would destroy me. If it were only the long-distance relationship, but the cheating told me that there is no way back. She is no longer the person I loved, as the person I loved would have never done that", "created_utc": "1638393170.0", "edited": "False", "id": "hmuh4ap", "is_submitter": "True", "link_id": "t3_r6n1m2", "parent_id": "t1_hmug1sn", "score": "2", "subreddit": "heartbreak", "subreddit_id": "t5_2rcye"}, {"author": "MinimumCompetition85", "body": "Thank you so much to take the time to respond! I appreciate your words! I just called my mom on the phone and cried again, I just had to let it all out. I feel like I am getting better. I wanted to delete the folder in which I kept all our photos and videos and deleted them, only to restore them again from the recycling bin, I just can't do it, even though I know I have to. If she would want me back now, I think I would be stupid enough to say yes, it is so hard to let go of the person I once loved, even though she probably is not that person anymore anyway.", "created_utc": "1638392153.0", "edited": "False", "id": "hmueejs", "is_submitter": "True", "link_id": "t3_r6n0vb", "parent_id": "t1_hmu9pnc", "score": "1", "subreddit": "BreakUps", "subreddit_id": "t5_2ra79"}, {"author": "MinimumCompetition85", "body": "I would say I want to move to Florida, but to enter the US I would have to get vaxxed anyway lol", "created_utc": "1637846974.0", "edited": "False", "id": "hm15s6z", "is_submitter": "False", "link_id": "t3_r1l4qd", "parent_id": "t3_r1l4qd", "score": "1", "subreddit": "Conservative", "subreddit_id": "t5_2qh6p"}, {"author": "MinimumCompetition85", "body": "Yes, now tell us what you are going to do about it!", "created_utc": "1637846522.0", "edited": "False", "id": "hm1519c", "is_submitter": "False", "link_id": "t3_r1kktn", "parent_id": "t3_r1kktn", "score": "1", "subreddit": "LouderWithCrowder", "subreddit_id": "t5_3evgn"}, {"author": "MinimumCompetition85", "body": "Keep up the fight, we're all in this together!", "created_utc": "1637760672.0", "edited": "False", "id": "hlwchop", "is_submitter": "False", "link_id": "t3_r0x918", "parent_id": "t3_r0x918", "score": "1", "subreddit": "pornfree", "subreddit_id": "t5_2rglh"}, {"author": "MinimumCompetition85", "body": "Yeah I agree. Even calling it an addiction makes it seem harder to quit because, well addictions are hard to quit as opposed to let's say a bad habit. The porn depleted brain will use this as justification to get its hit \"see? You're an addict, you can't quit just like that\" haha it's it's real fight no matter what you call it, that's for sure", "created_utc": "1637760398.0", "edited": "False", "id": "hlwbzkr", "is_submitter": "False", "link_id": "t3_r0vdl4", "parent_id": "t1_hlw2wa5", "score": "5", "subreddit": "pornfree", "subreddit_id": "t5_2rglh"}, {"author": "MinimumCompetition85", "body": "Well sex toys are for masturbation and since this is not nofap, masturbation is okay. I would cut out the audio PORN however, since porn is porn. Regardless of the medium (pics, videos, audios etc.)", "created_utc": "1637750418.0", "edited": "False", "id": "hlvx8bx", "is_submitter": "False", "link_id": "t3_r0qqu7", "parent_id": "t3_r0qqu7", "score": "2", "subreddit": "pornfree", "subreddit_id": "t5_2rglh"}, {"author": "MinimumCompetition85", "body": "Thanks for the suggestions! I will have a look at them.", "created_utc": "1637749950.0", "edited": "False", "id": "hlvwndo", "is_submitter": "True", "link_id": "t3_qztzz7", "parent_id": "t1_hlpgurg", "score": "1", "subreddit": "Accounting", "subreddit_id": "t5_2qw2b"}, {"author": "MinimumCompetition85", "body": "Here is a good start: [https://www.yourbrainonporn.com/research/](https://www.yourbrainonporn.com/research/) . I have the book and all the studies cited are included in the end, obviously I can't name them all here, since there are too many. But the link above is a good start to get familiar with the negative effects of porn as well as the research on the subject.", "created_utc": "1637682875.0", "edited": "False", "id": "hls35io", "is_submitter": "True", "link_id": "t3_qzip6x", "parent_id": "t1_hls0oo6", "score": "1", "subreddit": "PrematureEjaculation", "subreddit_id": "t5_2tjvf"}, {"author": "MinimumCompetition85", "body": "Well the origin of pornography, or let's say of the type of pornography that causes these adverse effects on people's brains and bodies is Internet pornography. Many studies suggest that it is linked to the rise of erectile dysfunction cases in young men and it is also linked to PE. So obviously I want to get rid of it and use it as an excuse to heal my PE. However I will try to do more reverse kegels since I do have a tense pelvic floor that might causes me these issues. Thanks!", "created_utc": "1637657438.0", "edited": "False", "id": "hlqxyeb", "is_submitter": "True", "link_id": "t3_qzip6x", "parent_id": "t1_hlp5pr6", "score": "1", "subreddit": "PrematureEjaculation", "subreddit_id": "t5_2tjvf"}, {"author": "MinimumCompetition85", "body": "No but you only count as 'cured' for up to 6 months after infection.", "created_utc": "1637618991.0", "edited": "False", "id": "hloz4s4", "is_submitter": "False", "link_id": "t3_qzowfk", "parent_id": "t1_hlouhk8", "score": "1", "subreddit": "LouderWithCrowder", "subreddit_id": "t5_3evgn"}, {"author": "MinimumCompetition85", "body": "Ikr? Especially considering that like 93.5% of the country still didn't have covid", "created_utc": "1637618770.0", "edited": "False", "id": "hloym6f", "is_submitter": "False", "link_id": "t3_qzowfk", "parent_id": "t1_hlocgpw", "score": "2", "subreddit": "LouderWithCrowder", "subreddit_id": "t5_3evgn"}, {"author": "MinimumCompetition85", "body": "Well as a recovering porn addict, that is out of question for me. I think men could cure their PE before porn was invented, which was not too long ago so there must be something else I should focus on. I think it is precicely porn why I have PE in the first place, due to bad masturbation habits and therefore a tense pelvic floor. I want to work on that (reverse kegels?) so that I can control myself better. I thought maybe there are some guidelines out there to help me out", "created_utc": "1637608632.0", "edited": "False", "id": "hlo9lc7", "is_submitter": "True", "link_id": "t3_qzip6x", "parent_id": "t1_hlnll2f", "score": "2", "subreddit": "PrematureEjaculation", "subreddit_id": "t5_2tjvf"}, {"author": "MinimumCompetition85", "body": "Thanks I want to keep that in mind! I was hoping for a solution that does not include any meds, but maybe if nothing else works, I could try that out!", "created_utc": "1637596353.0", "edited": "False", "id": "hlnevxj", "is_submitter": "True", "link_id": "t3_qzip6x", "parent_id": "t1_hln5ag7", "score": "1", "subreddit": "PrematureEjaculation", "subreddit_id": "t5_2tjvf"}, {"author": "MinimumCompetition85", "body": "Thanks for your reply! I thought PE meant cumming quicker than you want. Idk if it is real PE or not, it makes sex less pleasureable for me and my partner because I can't go fast or hard, have to stop constantly and it really impacts the overall experience in a negative way. \n\nso what would you suggest? Edge to porn and try to last longer and longer?", "created_utc": "1637596296.0", "edited": "False", "id": "hlner01", "is_submitter": "True", "link_id": "t3_qzip6x", "parent_id": "t1_hlnanqd", "score": "1", "subreddit": "PrematureEjaculation", "subreddit_id": "t5_2tjvf"}, {"author": "MinimumCompetition85", "body": "12 Rules for Life", "created_utc": "1637523816.0", "edited": "False", "id": "hljq0lg", "is_submitter": "False", "link_id": "t3_qyo3yb", "parent_id": "t3_qyo3yb", "score": "1", "subreddit": "selfimprovement", "subreddit_id": "t5_2qmbm"}, {"author": "MinimumCompetition85", "body": "Way to go man, congratulations!", "created_utc": "1637517891.0", "edited": "False", "id": "hljaspr", "is_submitter": "False", "link_id": "t3_qyv7ak", "parent_id": "t3_qyv7ak", "score": "4", "subreddit": "pornfree", "subreddit_id": "t5_2rglh"}, {"author": "MinimumCompetition85", "body": "Wow 6 years is incredible after so many years of porn use! Congratulations!!! I am 28 now and desperately want to quit, I have been watching porn ever since I was like 14 or something so I am in the same boat. Hopefully by the time I am 32, I can look back at 4 consecutive years without any kind of porn!", "created_utc": "1637406092.0", "edited": "False", "id": "hldgeul", "is_submitter": "False", "link_id": "t3_qxehkf", "parent_id": "t3_qxehkf", "score": "2", "subreddit": "pornfree", "subreddit_id": "t5_2rglh"}, {"author": "MinimumCompetition85", "body": "Yes it is incredible to see how normal racism is in porn. There are tons of videos or studios doing just that. All this anti-white porn is disgusting and as you said it doesn't do black people any favor either. Everyone loses. It is a really sad thing and nobody should watch it.", "created_utc": "1637399699.0", "edited": "False", "id": "hld9466", "is_submitter": "False", "link_id": "t3_qxwaz0", "parent_id": "t3_qxwaz0", "score": "17", "subreddit": "pornfree", "subreddit_id": "t5_2rglh"}, {"author": "MinimumCompetition85", "body": "I know that, I do the same when I had a rough day. But remember that it does not solve your problems, you are just hiding from them. And depending on what's going on, porn can make it all much worse. One thing is for sure though, porn can never help you with anything, it will only lead to more suffering. When you have a bad day, try to meditate a bit, calm down, set up a routine for such situations to ease the stress and you will see that you don't need porn at all! You got this!", "created_utc": "1637108762.0", "edited": "False", "id": "hkxankj", "is_submitter": "False", "link_id": "t3_qv9o3b", "parent_id": "t3_qv9o3b", "score": "1", "subreddit": "pornfree", "subreddit_id": "t5_2rglh"}, {"author": "MinimumCompetition85", "body": "Congratulations, well done! I want to reach one year too! Today is Day 1 lol", "created_utc": "1637108601.0", "edited": "False", "id": "hkxaahc", "is_submitter": "False", "link_id": "t3_qusium", "parent_id": "t3_qusium", "score": "2", "subreddit": "pornfree", "subreddit_id": "t5_2rglh"}, {"author": "MinimumCompetition85", "body": "Oh I see what you mean! Yeah I am actually doing that, I know that it's about leading an overall better life. Haven't heard about this app though, I will check it out! Thanks man!", "created_utc": "1637104714.0", "edited": "False", "id": "hkx1d8z", "is_submitter": "True", "link_id": "t3_qvgcz2", "parent_id": "t1_hkx0f8j", "score": "2", "subreddit": "pornfree", "subreddit_id": "t5_2rglh"}, {"author": "MinimumCompetition85", "body": "Damn from the title I thought it was about someone who cured his ED\n\nSeriously though, just try to fill your day with fun activities so that you don't even think about porn. Just sitting in front of your computer wouldn't work", "created_utc": "1637098598.0", "edited": "False", "id": "hkwmjfd", "is_submitter": "False", "link_id": "t3_qvc2qc", "parent_id": "t3_qvc2qc", "score": "1", "subreddit": "pornfree", "subreddit_id": "t5_2rglh"}, {"author": "MinimumCompetition85", "body": "How do I recover aside from staying away from porn?", "created_utc": "1637098528.0", "edited": "False", "id": "hkwmd0y", "is_submitter": "True", "link_id": "t3_qvgcz2", "parent_id": "t1_hkwjl3l", "score": "1", "subreddit": "pornfree", "subreddit_id": "t5_2rglh"}, {"author": "MinimumCompetition85", "body": "Sounds like I would have taken #4 as well. Being able to reflect on your mistakes is something not only candidates should be able to do. They sound like they would actually listen to good advice!", "created_utc": "1637018017.0", "edited": "False", "id": "hks6omt", "is_submitter": "False", "link_id": "t3_qtzecb", "parent_id": "t1_hks65h7", "score": "2", "subreddit": "recruitinghell", "subreddit_id": "t5_3bwcw"}, {"author": "MinimumCompetition85", "body": "I remember when I was younger, like 19 at the time, I worked part time at a supermarket and the owner sold it to another guy. The new boss wanted to get to know all the employees so he had a little talk with everyone. So we sat down to talk and all of a sudden he asked me about my strengths and weaknesses and some shit, I was like \"wtf you bought the place with all employees, you already hired us, what is the point of this? And besides I am stocking shelves here, earning some money for college.... what do you care about my weaknesses?\" I just made a joke about not being prepared for such a question and quit the job a few weeks after that. Some people really want to feel important...", "created_utc": "1636998533.0", "edited": "False", "id": "hkqtp35", "is_submitter": "False", "link_id": "t3_qtzecb", "parent_id": "t3_qtzecb", "score": "1", "subreddit": "recruitinghell", "subreddit_id": "t5_3bwcw"}, {"author": "MinimumCompetition85", "body": "\"It's the joker, how about another joke (interviewer name)?\"", "created_utc": "1636998015.0", "edited": "False", "id": "hkqsdx9", "is_submitter": "False", "link_id": "t3_qtzecb", "parent_id": "t1_hkpcmzh", "score": "1", "subreddit": "recruitinghell", "subreddit_id": "t5_3bwcw"}, {"author": "MinimumCompetition85", "body": "What did they say? Did you get the job?", "created_utc": "1636997965.0", "edited": "False", "id": "hkqs990", "is_submitter": "False", "link_id": "t3_qtzecb", "parent_id": "t1_hkphz5o", "score": "1", "subreddit": "recruitinghell", "subreddit_id": "t5_3bwcw"}, {"author": "MinimumCompetition85", "body": "I knew these idiots would give people a hard time because of the pandemic...at first I thought well maybe at least that is something we all can relate to since we all had to go through these tough times...but I guess I forgot about recruiters", "created_utc": "1636997876.0", "edited": "False", "id": "hkqs0z5", "is_submitter": "False", "link_id": "t3_qtzecb", "parent_id": "t1_hkpjwq9", "score": "2", "subreddit": "recruitinghell", "subreddit_id": "t5_3bwcw"}, {"author": "MinimumCompetition85", "body": "Not a question but I recently had a guy ask me about my high school diploma even though I have a masters degree by now. It's like yeah I don't really know how a 9 year old report is going to help you with your decision but okay... it's like dude, did I apply 9 years ago or is there a much more mature and grown person sitting in front of you now? That's why I don't include it anymore in my applications, I feel like the most recent degree should be the most important one", "created_utc": "1636994347.0", "edited": "False", "id": "hkqj550", "is_submitter": "False", "link_id": "t3_qtzecb", "parent_id": "t3_qtzecb", "score": "1", "subreddit": "recruitinghell", "subreddit_id": "t5_3bwcw"}, {"author": "MinimumCompetition85", "body": "Thank you! Finally someone said it! I hate the idea of \"learning a language can never be a waste of time\" as if somehow there are no opportunity costs as long as you learn a language and like it. Of course there are! Learning a language instead of studying for an exam? Bad idea! And I could give thousands of examples... every hour you spend learning a language you will never need nor use is gone and you can't get it back much less use it more productively. \nSo choose wisely folks, sometimes we fool ourselves thinking we do something productively (especially since we are studying something, which is work, right?) but in the end we don't accomplish anything. I have once fallen into this polyglot trap, trying to learn like 12 languages, what a huge waste of time. Now I have narrowed it down to 4 (including my native language) which I actually need. And that's a better way to spend my time.", "created_utc": "1636880578.0", "edited": "False", "id": "hkkg5qa", "is_submitter": "False", "link_id": "t3_qt19p1", "parent_id": "t3_qt19p1", "score": "6", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "MinimumCompetition85", "body": "The tenses: There's only past, present and future. I think that is a lot easier compared to the other languages I speak/learn like German, English and Spanish", "created_utc": "1636794932.0", "edited": "False", "id": "hkfumst", "is_submitter": "False", "link_id": "t3_qshsyu", "parent_id": "t3_qshsyu", "score": "1", "subreddit": "russian", "subreddit_id": "t5_2qlc6"}, {"author": "MinimumCompetition85", "body": "Thank you!", "created_utc": "1636752134.0", "edited": "False", "id": "hkdqkk4", "is_submitter": "True", "link_id": "t3_qsjdll", "parent_id": "t1_hkdfigt", "score": "3", "subreddit": "Bankruptcy", "subreddit_id": "t5_2qt29"}, {"author": "MinimumCompetition85", "body": "I started to learn Russian when I was like 12 years old because my family came from Russia to Germany. I didn't grow up speaking it because my parents had been living in Germany for a very long time already by the time I was born, so we didn't speak it at home. But other relatives would speak more Russian or there was the occasional visit from family or friends from Russia and I didn't like not understanding anything so I decided to teach myself.", "created_utc": "1636716455.0", "edited": "False", "id": "hkbk8lb", "is_submitter": "False", "link_id": "t3_qroiac", "parent_id": "t3_qroiac", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "MinimumCompetition85", "body": "No soup for you!", "created_utc": "1636497497.0", "edited": "False", "id": "hjztlwn", "is_submitter": "False", "link_id": "t3_qq1fnz", "parent_id": "t3_qq1fnz", "score": "0", "subreddit": "texas", "subreddit_id": "t5_2qho4"}, {"author": "MinimumCompetition85", "body": "How is that legal? She paid for the ticket and they let her in, so how can they kick her our afterwards for wearing that? It seems arbitrary. Anyway, LET'S GO BRANDON!", "created_utc": "1636403015.0", "edited": "False", "id": "hjuhty2", "is_submitter": "False", "link_id": "t3_qpeiak", "parent_id": "t3_qpeiak", "score": "1", "subreddit": "LouderWithCrowder", "subreddit_id": "t5_3evgn"}, {"author": "MinimumCompetition85", "body": "You could try consuming media in that language and see how well that goes. If you still have trouble understanding,  look out for more resources. There should be textbooks available covering intermediate content (roughly B1-C1) depending on the language. Another option: there are books containing short stories for learners, sometimes they are written for specific levels (according to CEFR) They could also be worth checking out. But nonetheless try to use the language more often and use native media more frequently", "created_utc": "1636391529.0", "edited": "False", "id": "hjtpa7m", "is_submitter": "False", "link_id": "t3_qovzc2", "parent_id": "t3_qovzc2", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "MinimumCompetition85", "body": " Watching porn = relapse \nNot watching porn  = no relapse", "created_utc": "1636363157.0", "edited": "False", "id": "hjs9ysy", "is_submitter": "False", "link_id": "t3_qox7r6", "parent_id": "t3_qox7r6", "score": "2", "subreddit": "pornfree", "subreddit_id": "t5_2rglh"}, {"author": "MinimumCompetition85", "body": "\"keeps me AND OTHERS healthy\"... when will they ever understand that the vaccine does not prevent infections nor spreading the virus? It's simply to protect yourself.", "created_utc": "1636360242.0", "edited": "False", "id": "hjs6u1v", "is_submitter": "False", "link_id": "t3_qomffl", "parent_id": "t3_qomffl", "score": "1", "subreddit": "LouderWithCrowder", "subreddit_id": "t5_3evgn"}, {"author": "MinimumCompetition85", "body": "Kamala Harris' response to this: HAHAHAHAHA", "created_utc": "1636359992.0", "edited": "False", "id": "hjs6k6g", "is_submitter": "False", "link_id": "t3_qp09xa", "parent_id": "t3_qp09xa", "score": "5", "subreddit": "benshapiro", "subreddit_id": "t5_3779u"}, {"author": "MinimumCompetition85", "body": "Got it! We are taught from the very first English lessons that Handy is actually a German word which does not exist in that sense in English. But nowadays it's more and more common to say smartphone instead of Handy anyway.", "created_utc": "1636359749.0", "edited": "False", "id": "hjs6ahl", "is_submitter": "False", "link_id": "t3_qjbg4a", "parent_id": "t1_hjrcltw", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "MinimumCompetition85", "body": "Oh really? I didn't know it had a sexual meaning as well. I always thought handyman referred to someone building or repairing stuff around the house lol good to know!", "created_utc": "1636281010.0", "edited": "False", "id": "hjnqa28", "is_submitter": "False", "link_id": "t3_qjbg4a", "parent_id": "t1_hirocs4", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "MinimumCompetition85", "body": "Idk I speak German (native) and English fluently, intermediate in Russian and beginner in Spanish. I also have some knowledge of Italian (A2 maybe) but I don't plan on studying it any more. Does that count?", "created_utc": "1636199601.0", "edited": "False", "id": "hjjggp9", "is_submitter": "False", "link_id": "t3_qnqq8h", "parent_id": "t3_qnqq8h", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "MinimumCompetition85", "body": "Of course not, you didn't watch anything. Sometimes it's hard to control our thoughts but that will get better with time. As long as you don't actually WATCH or fantasize about it, you're fine!", "created_utc": "1636150233.0", "edited": "False", "id": "hjh3ak1", "is_submitter": "False", "link_id": "t3_qn96pt", "parent_id": "t3_qn96pt", "score": "2", "subreddit": "pornfree", "subreddit_id": "t5_2rglh"}, {"author": "MinimumCompetition85", "body": "Yes and also a huge part for me: boredom! Whenever I feel bored and don't know what to do, I watch porn to pass the time... I need to find more things to do", "created_utc": "1636149120.0", "edited": "False", "id": "hjh0i1w", "is_submitter": "True", "link_id": "t3_qnkkzi", "parent_id": "t1_hjgzad4", "score": "7", "subreddit": "pornfree", "subreddit_id": "t5_2rglh"}, {"author": "MinimumCompetition85", "body": "300 something days", "created_utc": "1636145631.0", "edited": "False", "id": "hjgrg4a", "is_submitter": "False", "link_id": "t3_qndyg5", "parent_id": "t3_qndyg5", "score": "2", "subreddit": "duolingo", "subreddit_id": "t5_2t6ze"}, {"author": "MinimumCompetition85", "body": "Anybody?", "created_utc": "1636105623.0", "edited": "False", "id": "hje9p7e", "is_submitter": "False", "link_id": "t3_qm6z0z", "parent_id": "t3_qm6z0z", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "MinimumCompetition85", "body": "I think I learned the most from Mad Men, because the characters tend to express themselves very well. I just had to make sure not to pick up any outdated words that are not used anymore lol \nBut I guess any show or movie can teach us something.", "created_utc": "1635931470.0", "edited": "False", "id": "hj4lm3r", "is_submitter": "False", "link_id": "t3_ql0keh", "parent_id": "t1_hj4le8y", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "MinimumCompetition85", "body": "I haven't learned English from Netflix, but I have learned a ton of new words form watching American movies and TV shows. Whenever I came a across a word I didn't know, I wrote it down and looked it up. That way I learned a lot about colloquial speech and idioms which made my English sound richer and more natural.", "created_utc": "1635931239.0", "edited": "False", "id": "hj4lcn4", "is_submitter": "False", "link_id": "t3_ql0keh", "parent_id": "t3_ql0keh", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "MinimumCompetition85", "body": "you could give software like 'covenanteyes' a try. basically what it does is it tracks your browsing history and would send an email to a specified email account (maybe a family member, spouse, friend, accountabily partner etc.) whenever you watch porn or visit certain sites. \n\nThe potential embarrassment should keep one from going to these sites. It's not free though", "created_utc": "1635878157.0", "edited": "False", "id": "hj1kjtu", "is_submitter": "False", "link_id": "t3_ql1i5i", "parent_id": "t1_hj015za", "score": "1", "subreddit": "pornfree", "subreddit_id": "t5_2rglh"}, {"author": "MinimumCompetition85", "body": "Yes there are plenty of English words that are used in Germany, especially among younger people. For exmaple: creepy, strange, weird, cute and probably a gazillion more...there is even a word for using many English words in your speech which is \"Denglish\". A mix of German (Deutsch) and English, as if it's its own language. Plus there are many English words that Germans use in a different way like home office or handy for example", "created_utc": "1635670751.0", "edited": "False", "id": "hiqtsfr", "is_submitter": "False", "link_id": "t3_qjbg4a", "parent_id": "t3_qjbg4a", "score": "6", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "MinimumCompetition85", "body": "Thanks for your reply, which textbook would you recommend?", "created_utc": "1635113985.0", "edited": "False", "id": "hhx0pws", "is_submitter": "True", "link_id": "t3_qf1xz4", "parent_id": "t1_hhx0861", "score": "1", "subreddit": "LawSchool", "subreddit_id": "t5_2rb9g"}, {"author": "MinimumCompetition85", "body": "I don't get it, so where does her husband work then?", "created_utc": "1635003201.0", "edited": "False", "id": "hhqzsni", "is_submitter": "False", "link_id": "t3_qdno3g", "parent_id": "t3_qdno3g", "score": "1", "subreddit": "LinkedInLunatics", "subreddit_id": "t5_25tcjz"}, {"author": "MinimumCompetition85", "body": "Exactly! Even though I would like to be able to say something like \"oh porn? I haven't watched that in over a year now\" one day, I still celebrate the little successes. I only started counting my days and relapses from May onwards, but so far I have had 123 porn-free days over a 173-day period, which means I was clean roughly 71% of the time. I like to think this is not bad even though my longest streak was 38 days.", "created_utc": "1635002098.0", "edited": "False", "id": "hhqy152", "is_submitter": "False", "link_id": "t3_qdnryc", "parent_id": "t3_qdnryc", "score": "2", "subreddit": "pornfree", "subreddit_id": "t5_2rglh"}, {"author": "MinimumCompetition85", "body": "I am rewatching the show right now and it seems to me like they were fighting from the beginning on. There wasn't much of a honeymoon phase tbh. Don's birthday party, the woman in the elevator, that whole thing with the sherbet.... it's like every episode they are in, there is some major fight or tension between the two. They seemed to be a good match when they were in California together but as soon as they got married? It went downhill way faster than I had remembered...", "created_utc": "1634407988.0", "edited": "False", "id": "hgvxjsf", "is_submitter": "False", "link_id": "t3_j5f4pa", "parent_id": "t3_j5f4pa", "score": "3", "subreddit": "madmen", "subreddit_id": "t5_2r7l7"}, {"author": "MinimumCompetition85", "body": "Just starting college, thinking I could easily pass every exam with minimum effort. It goes without saying that was not a good strategy and I had to repeat many exams and fell behind my peers, took me forever to get my degree. Looking back at it, I would tell my 19yo self to work harder and party less!", "created_utc": "1634115282.0", "edited": "False", "id": "hggn83u", "is_submitter": "False", "link_id": "t3_q6hyne", "parent_id": "t3_q6hyne", "score": "1", "subreddit": "selfimprovement", "subreddit_id": "t5_2qmbm"}, {"author": "MinimumCompetition85", "body": "CRT is highly controversial and many people oppose it. They shouldn't do that. If someone is interested in it, they can read about it by themselves", "created_utc": "1633853666.0", "edited": "False", "id": "hg2y2jw", "is_submitter": "False", "link_id": "t3_q4x9op", "parent_id": "t3_q4x9op", "score": "0", "subreddit": "LouderWithCrowder", "subreddit_id": "t5_3evgn"}, {"author": "MinimumCompetition85", "body": "First of all, you don't need to get so rude, I would like to have a discussion without the immature insults. Second of all: you don't seem to understand what's going on here,  people who are vaccinated don't need to get tested so they might carry it unknowingly and could potentially infect others, but they are allowed in. Whereas a person who is not vaccinated has to get tested. But now some have decided to keep them out, even when they show a negative test result. Now if someone is tested negatively, how big are the chances that it is a false-negative compared to the chances of someone unknowingly carrying the virus? There has already been an event in Wurzburg where they only allowed vaccinated and recovered people in and it turned out to be a superspreader event because someone had covid. That would probably not have happened if they had to have a negative test to get in. It is absolutely obvious that the government wants to incentivize people to get vaccinated, so they would have less restrictions.", "created_utc": "1633594793.0", "edited": "False", "id": "hfpfrdu", "is_submitter": "False", "link_id": "t3_q2kr5b", "parent_id": "t1_hfpeyd7", "score": "1", "subreddit": "benshapiro", "subreddit_id": "t5_3779u"}, {"author": "MinimumCompetition85", "body": "Haven't you heard? Vaccinated people can get the virus and spread it just as much as unvaccinated people. And if someone shows a NEGATIVE test they DO NOT have covid, so how exactly are they going to spread a virus then?", "created_utc": "1633583855.0", "edited": "False", "id": "hfp2smv", "is_submitter": "False", "link_id": "t3_q2kr5b", "parent_id": "t1_hforr3i", "score": "1", "subreddit": "benshapiro", "subreddit_id": "t5_3779u"}, {"author": "MinimumCompetition85", "body": "For anyone wondering, I live in Germany and yes people here really are that stupid. The government even generously decided to offer restaurants and bars the choice to either allow only vaccinated, tested or recovered people in, but with restrictions (masks, lower capacity etc.) OR to exclude people who are tested negatively and only allow recovered and vaccinated people in, but without restrictions.\n\nSomehow they see no discrimination in this at all even though it makes not sense whatsoever and is just a sort of \"incentive\" to get people vaccinated.", "created_utc": "1633554914.0", "edited": "False", "id": "hfnhut5", "is_submitter": "False", "link_id": "t3_q2kr5b", "parent_id": "t3_q2kr5b", "score": "1", "subreddit": "benshapiro", "subreddit_id": "t5_3779u"}, {"author": "MinimumCompetition85", "body": "Actually bruh, writing such tweets about triggers is one of my triggers bruh, I feel traumatized bruh and now I am tweeting about you bruh and now you're trending bruh and now your life is ruined bruh and now you're fired bruh", "created_utc": "1633554592.0", "edited": "False", "id": "hfnh4n3", "is_submitter": "False", "link_id": "t3_q2k7ll", "parent_id": "t3_q2k7ll", "score": "1", "subreddit": "LouderWithCrowder", "subreddit_id": "t5_3evgn"}, {"author": "MinimumCompetition85", "body": "I see, that's a good point! I am a perfectionist, which is why I only progress slowly on my tree. On any way, I think it's always a good idea to use a variety of resources", "created_utc": "1633334309.0", "edited": "False", "id": "hfbtb76", "is_submitter": "False", "link_id": "t3_q0ldyv", "parent_id": "t1_hfbt2l1", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "MinimumCompetition85", "body": "That's true but you also repeat A LOT which is why it would take forever to cover the first few chapters of a beginner's textbook with Duolingo alone, content wise. You are right in that it's a nice supplement though.", "created_utc": "1633333571.0", "edited": "False", "id": "hfbsii4", "is_submitter": "False", "link_id": "t3_q0ldyv", "parent_id": "t1_hfbsegw", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "MinimumCompetition85", "body": "\"Lord don't move my mountain\nBut give me the strength to climb\"", "created_utc": "1633329068.0", "edited": "False", "id": "hfbnanm", "is_submitter": "False", "link_id": "t3_q0r7c2", "parent_id": "t3_q0r7c2", "score": "1", "subreddit": "pornfree", "subreddit_id": "t5_2rglh"}, {"author": "MinimumCompetition85", "body": "9 days! Haha getting closer to the 100. \nCongratulations!!!", "created_utc": "1633328978.0", "edited": "False", "id": "hfbn6qg", "is_submitter": "False", "link_id": "t3_q0q2cv", "parent_id": "t3_q0q2cv", "score": "2", "subreddit": "pornfree", "subreddit_id": "t5_2rglh"}, {"author": "MinimumCompetition85", "body": "Like I said, I understand how that could be helpful, it's just not for me. But I could watch Spongebob in any language, it's the best kids show out there! Well the first 3 seasons that is 😄", "created_utc": "1633328296.0", "edited": "False", "id": "hfbmcbw", "is_submitter": "False", "link_id": "t3_q0ldyv", "parent_id": "t1_hfblxw3", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "MinimumCompetition85", "body": "I see what you mean, I just remember how I learned lots of English when I was young by looking up rap lyrics and translating them, taught me a lot of new words. I tried this whole 'watch a kid's show' approach but never really got into it, because, well they are for kids, so not very entertaining to watch as an adult. But I could see how someone could pick up new words from that too. Also there are books with short stories, specifically made for learners (A1,A2,B1 etc.) they might also be useful.", "created_utc": "1633327426.0", "edited": "False", "id": "hfbl8g2", "is_submitter": "False", "link_id": "t3_q0ldyv", "parent_id": "t1_hfati7x", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "MinimumCompetition85", "body": "Thank you very much for this comprehensive answer! I will look out for these things during the next game", "created_utc": "1633293823.0", "edited": "False", "id": "hf9r7rh", "is_submitter": "True", "link_id": "t3_q0pabf", "parent_id": "t1_hf9qsz8", "score": "6", "subreddit": "NFLNoobs", "subreddit_id": "t5_326ue"}, {"author": "MinimumCompetition85", "body": "The useful thing about music is, that you are not overwhelmed with a lot of text. You can listen to the song, then look up the lyrics and translate if bit by bit to understand it. Watching TV as a beginner probably wouldn't be very enjoyable. I think TV is more useful at the advanced stages. But then again, I think a solid textbook should be the basis and all native media is secondary at this point.", "created_utc": "1633293635.0", "edited": "False", "id": "hf9qr76", "is_submitter": "False", "link_id": "t3_q0ldyv", "parent_id": "t1_hf9qbj8", "score": "18", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "MinimumCompetition85", "body": "I hope you will get your car back! This is terrible!", "created_utc": "1633292413.0", "edited": "False", "id": "hf9nrk8", "is_submitter": "False", "link_id": "t3_q0oc21", "parent_id": "t3_q0oc21", "score": "5", "subreddit": "Dallas", "subreddit_id": "t5_2qnkr"}, {"author": "MinimumCompetition85", "body": "Yes great game! Hope they can continue the streak!", "created_utc": "1633291995.0", "edited": "False", "id": "hf9mpkb", "is_submitter": "True", "link_id": "t3_q0pabf", "parent_id": "t1_hf9mjs5", "score": "2", "subreddit": "NFLNoobs", "subreddit_id": "t5_326ue"}, {"author": "MinimumCompetition85", "body": "Thank you!", "created_utc": "1633291850.0", "edited": "False", "id": "hf9mcv7", "is_submitter": "True", "link_id": "t3_q0pabf", "parent_id": "t1_hf9lx3b", "score": "2", "subreddit": "NFLNoobs", "subreddit_id": "t5_326ue"}, {"author": "MinimumCompetition85", "body": "I am just inexperienced what to look out for and would like to appreciate the defense more :D", "created_utc": "1633291429.0", "edited": "False", "id": "hf9lbv0", "is_submitter": "True", "link_id": "t3_q0pabf", "parent_id": "t1_hf9l7jz", "score": "5", "subreddit": "NFLNoobs", "subreddit_id": "t5_326ue"}, {"author": "MinimumCompetition85", "body": "Dallas Cowboys", "created_utc": "1633291346.0", "edited": "False", "id": "hf9l44w", "is_submitter": "True", "link_id": "t3_q0pabf", "parent_id": "t1_hf9l1we", "score": "2", "subreddit": "NFLNoobs", "subreddit_id": "t5_326ue"}, {"author": "MinimumCompetition85", "body": "Yes please do, never give up! I know you can do it!", "created_utc": "1633290336.0", "edited": "False", "id": "hf9ij34", "is_submitter": "False", "link_id": "t3_q0fx9k", "parent_id": "t1_hf9h62c", "score": "5", "subreddit": "pornfree", "subreddit_id": "t5_2rglh"}, {"author": "MinimumCompetition85", "body": "Guess you beat me to it! I was wondering if someone had already put out a post about her:)\nIt's an awesome resource! She also has a podcast on Spotify", "created_utc": "1633286581.0", "edited": "1633327613.0", "id": "hf9937o", "is_submitter": "False", "link_id": "t3_q0boj2", "parent_id": "t3_q0boj2", "score": "2", "subreddit": "pornfree", "subreddit_id": "t5_2rglh"}, {"author": "MinimumCompetition85", "body": "You know exactly what I meant, you never heard that pov before, because it's not what I said.", "created_utc": "1633283966.0", "edited": "False", "id": "hf92n7j", "is_submitter": "False", "link_id": "t3_q04il5", "parent_id": "t1_hf921sq", "score": "-1", "subreddit": "Dallas", "subreddit_id": "t5_2qnkr"}, {"author": "MinimumCompetition85", "body": "First, get a solid textbook to get the basic grammar and vocabulary down. To achieve that with Duolingo etc. would take forever. Then make sure to incorporate the language as much as possible into your daily life. Listen to music, look up the lyrics, use your favorite apps everyday etc. \nDaily exposure and constant reviewing is important if you want to make the most of it in that timeframe", "created_utc": "1633283609.0", "edited": "False", "id": "hf91rif", "is_submitter": "False", "link_id": "t3_q0ldyv", "parent_id": "t3_q0ldyv", "score": "54", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "MinimumCompetition85", "body": "Thank you! I was already thinking twice about moving to Texas after reading the posts in this sub...", "created_utc": "1633283186.0", "edited": "False", "id": "hf90p0f", "is_submitter": "False", "link_id": "t3_q0kdos", "parent_id": "t3_q0kdos", "score": "0", "subreddit": "texas", "subreddit_id": "t5_2qho4"}, {"author": "MinimumCompetition85", "body": "Of course the heart has something to do with personhood. If a baby develops its own organs and has its own heartbeat, it is definitely a person.", "created_utc": "1633282649.0", "edited": "False", "id": "hf8zcm0", "is_submitter": "False", "link_id": "t3_q04il5", "parent_id": "t1_hf8wd85", "score": "-4", "subreddit": "Dallas", "subreddit_id": "t5_2qnkr"}, {"author": "MinimumCompetition85", "body": "What are you even talking about? What does covid have to do with any of this? \nAnyway, a new human life can only begin once sperm enters the egg, therefore it is not murder to masturbate, because there cannot grow another human being from sperm alone.\n \nDon't you think it would be a little boring if we all just stayed in our echo chambers? I think it's more exciting to hear different viewpoints and have an open discussion about it. We might agree one some points and disagree on others, but we should always be able to have a conversation, don't you think?", "created_utc": "1633280106.0", "edited": "False", "id": "hf8t2o4", "is_submitter": "False", "link_id": "t3_q04il5", "parent_id": "t1_hf8mr3e", "score": "1", "subreddit": "Dallas", "subreddit_id": "t5_2qnkr"}, {"author": "MinimumCompetition85", "body": "Why are you insulting me? Can't we have a discussion like two adults here? I care about them being aborted because I see it as morally wrong to murder an unborn child and not let it have a chance at life. And nobody is forcing the mother to raise the child either. There are institutions that take care of these kids. What's the difference about killing them before or after? Well, if you put it that way, there is no difference, it's both murder. I would hope that people took birth control more seriously, so there wouldn't be that many unwanted pregnancies. Why do you refuse to answer my question? I want to understand your moral standpoint. When is it too late to have an abortion, in your opinion? This is not about women, this is about protecting the unborn life.", "created_utc": "1633279728.0", "edited": "False", "id": "hf8s6yf", "is_submitter": "False", "link_id": "t3_q04il5", "parent_id": "t1_hf8p4vu", "score": "1", "subreddit": "Dallas", "subreddit_id": "t5_2qnkr"}, {"author": "MinimumCompetition85", "body": "See, that's incorrect. It is not a 'clump of cells' as you put it. For instance a baby's heartbeat can be detected after only 3-4 weeks after conception. At what point would you consider this 'clump of cells' a human being then? Humans have heartbeats right? Or up to which point would you say an abortion would be okay then?", "created_utc": "1633278137.0", "edited": "False", "id": "hf8ojdn", "is_submitter": "False", "link_id": "t3_q04il5", "parent_id": "t1_hf8nfuk", "score": "-15", "subreddit": "Dallas", "subreddit_id": "t5_2qnkr"}, {"author": "MinimumCompetition85", "body": "A sperm itself can not grow to become another human. It seems more like you don't care about (unborn) children who never got a chance at life because they got aborted. So if a woman gets an abortion when she's nine months pregnant for example, you wouldn't see an issue with that?", "created_utc": "1633277574.0", "edited": "False", "id": "hf8n7r8", "is_submitter": "False", "link_id": "t3_q04il5", "parent_id": "t1_hf8mr3e", "score": "5", "subreddit": "Dallas", "subreddit_id": "t5_2qnkr"}, {"author": "MinimumCompetition85", "body": "A sperm cell alone is not new life. Up to which point in pregnancy do you think it's okay to have an abortion?", "created_utc": "1633276560.0", "edited": "False", "id": "hf8kvlm", "is_submitter": "False", "link_id": "t3_q04il5", "parent_id": "t1_hf8j7l3", "score": "5", "subreddit": "Dallas", "subreddit_id": "t5_2qnkr"}, {"author": "MinimumCompetition85", "body": "Don't you think murdering an unborn child is awful?", "created_utc": "1633275777.0", "edited": "False", "id": "hf8j4wp", "is_submitter": "False", "link_id": "t3_q04il5", "parent_id": "t1_hf8ihmu", "score": "-14", "subreddit": "Dallas", "subreddit_id": "t5_2qnkr"}, {"author": "MinimumCompetition85", "body": "That's racist! I am pretty sure he will be canceled for such hate speech right...RIGHT?", "created_utc": "1633249055.0", "edited": "False", "id": "hf7advn", "is_submitter": "False", "link_id": "t3_q090gv", "parent_id": "t3_q090gv", "score": "2", "subreddit": "LouderWithCrowder", "subreddit_id": "t5_3evgn"}, {"author": "MinimumCompetition85", "body": "Apparently common sense gets downvoted and supporting murder gets upvoted...crazy times we're living in", "created_utc": "1633248508.0", "edited": "False", "id": "hf79o0p", "is_submitter": "False", "link_id": "t3_q04il5", "parent_id": "t1_hf6ookz", "score": "-43", "subreddit": "Dallas", "subreddit_id": "t5_2qnkr"}, {"author": "MinimumCompetition85", "body": "Don't worry, it's just the so-called flatline period. It is indeed your brain rewiring and it will pass. I mean do you really think you need porn to feel sexual? I wonder what people did before there was internet porn ;)\nYour natural libido will come back and everything will be okay, just keep going and DON'T go back to porn! You got this!", "created_utc": "1633247735.0", "edited": "False", "id": "hf78nwz", "is_submitter": "False", "link_id": "t3_q00bg5", "parent_id": "t3_q00bg5", "score": "3", "subreddit": "pornfree", "subreddit_id": "t5_2rglh"}, {"author": "MinimumCompetition85", "body": "Stop masturbating and focus on the task", "created_utc": "1633247505.0", "edited": "False", "id": "hf78dn0", "is_submitter": "False", "link_id": "t3_q032ip", "parent_id": "t3_q032ip", "score": "11", "subreddit": "selfimprovement", "subreddit_id": "t5_2qmbm"}, {"author": "MinimumCompetition85", "body": "I have found it's always helpful to be aware of the detrimental effects porn has on your brain. So in your first days of recovery, instead of watching porn, read a book about how bad porn is. Some suggestions:\n- your brain on porn\n- the porn myth\n- the porn trap\n\nAlso check out Trisha Leigh on YouTube, she is a doctor and uploads videos about porn addiction/ recovery/ how not to relapse etc. frequently. She even has live q&a sessions every now and then. You might ask her something and get some valuable advice from someone who is an expert in this field. She also has a podcast on Spotify.\n\nAlso, fill your day with other activities to avoid boredom. Not doing anything is a recipe for failure so pick up a new habit, read a book, meet friends, work out, whatever it is but don't sit in front of your computer screen all by yourself. \n\nYou got this! And you can always ask questions here and people will be glad to help you :)", "created_utc": "1633245438.0", "edited": "False", "id": "hf75qb6", "is_submitter": "False", "link_id": "t3_pzxnya", "parent_id": "t3_pzxnya", "score": "2", "subreddit": "pornfree", "subreddit_id": "t5_2rglh"}, {"author": "MinimumCompetition85", "body": "Reading, learning Spanish, cooking, watching sports...things like that", "created_utc": "1633203519.0", "edited": "False", "id": "hf4ufe1", "is_submitter": "False", "link_id": "t3_pzlzaf", "parent_id": "t3_pzlzaf", "score": "1", "subreddit": "pornfree", "subreddit_id": "t5_2rglh"}, {"author": "MinimumCompetition85", "body": "Okay calm down, take a deep breath, accept the relapse for what it is....I don't know for how long you have been clean before but trust me, your progress does not vanish just because of a relapse. You feel bad about yourself now, which is understandable. Just think about the time before the relapse, you felt much better right? Don't you want to feel good again instead of feeling like you do right now? Use that as motivation to get back on track! You know you could do it once, so what's stopping you now? Get up and get back in the race, you got this!", "created_utc": "1633203399.0", "edited": "False", "id": "hf4u5o6", "is_submitter": "False", "link_id": "t3_pzputs", "parent_id": "t3_pzputs", "score": "2", "subreddit": "pornfree", "subreddit_id": "t5_2rglh"}, {"author": "MinimumCompetition85", "body": "Sign me up!", "created_utc": "1633202763.0", "edited": "False", "id": "hf4sowy", "is_submitter": "False", "link_id": "t3_pz7cie", "parent_id": "t3_pz7cie", "score": "2", "subreddit": "pornfree", "subreddit_id": "t5_2rglh"}, {"author": "MinimumCompetition85", "body": "Exactly! Every day we stay clean, we get one day closer to becoming the best versions of ourselves. Beating an addiction and fighting through urges just makes you proud! One day at a time, folks, we got this!", "created_utc": "1633032993.0", "edited": "False", "id": "hew59j1", "is_submitter": "False", "link_id": "t3_pyizfm", "parent_id": "t3_pyizfm", "score": "1", "subreddit": "pornfree", "subreddit_id": "t5_2rglh"}, {"author": "MinimumCompetition85", "body": "This! 100%!\n\nBut I think OP is looking for a plan or strategy,  just saying \"stop it\" is not enough.", "created_utc": "1632608507.0", "edited": "False", "id": "he9vaso", "is_submitter": "False", "link_id": "t3_pvbtzo", "parent_id": "t1_he9t4nm", "score": "1", "subreddit": "pornfree", "subreddit_id": "t5_2rglh"}, {"author": "MinimumCompetition85", "body": "Day 5, Relapsed. But still, I am proud of the achievement. It has been a while since I was able to go for 5 days. Now I will try to go for one day more!", "created_utc": "1631387018.0", "edited": "False", "id": "hcgu8up", "is_submitter": "True", "link_id": "t3_pijy0x", "parent_id": "t3_pijy0x", "score": "1", "subreddit": "pornfree", "subreddit_id": "t5_2rglh"}, {"author": "MinimumCompetition85", "body": "Yesterday I had some urges, but did not give in to them and watched some Netflix instead. After a few minutes the urges were gone. Makes me feel good about myself. So now I am three full days clean.", "created_utc": "1631176324.0", "edited": "False", "id": "hc5rnwn", "is_submitter": "True", "link_id": "t3_pijy0x", "parent_id": "t3_pijy0x", "score": "1", "subreddit": "pornfree", "subreddit_id": "t5_2rglh"}, {"author": "MinimumCompetition85", "body": "What? the vaccines are safe? well sure, apparently the side effects don't happen too often but they still happen. Besides there is no way of telling that there won't be any big side effects ten years down the road. Usually it takes 10 years for a vaccine to go through all the stages of clinical studies before they get approved and not just a mere couple of months. He's right that many questions regarding its safety remained unanswered while the vaccine was already given to the public... she should educate herself a bit on the topic, before asking such questions", "created_utc": "1630765829.0", "edited": "False", "id": "hbklva5", "is_submitter": "False", "link_id": "t3_phnk7r", "parent_id": "t3_phnk7r", "score": "2", "subreddit": "LouderWithCrowder", "subreddit_id": "t5_3evgn"}, {"author": "MinimumCompetition85", "body": "You are lucky you found this at such a young age. I wish I knew about the detrimental effects of porn when I was 13. Instead I kept watching and fapping for years to come...now being 28 I am really struggling to quit. All the best to you! Life is so much better without that filth!", "created_utc": "1630764285.0", "edited": "False", "id": "hbkimsd", "is_submitter": "False", "link_id": "t3_phjd1z", "parent_id": "t3_phjd1z", "score": "3", "subreddit": "pornfree", "subreddit_id": "t5_2rglh"}, {"author": "MinimumCompetition85", "body": "I would love to see for myself,  as soon as the travel ban is lifted. I think I will visit next spring or summer", "created_utc": "1630739553.0", "edited": "False", "id": "hbjl87c", "is_submitter": "True", "link_id": "t3_p3u5w8", "parent_id": "t1_hbja87m", "score": "2", "subreddit": "askdfw", "subreddit_id": "t5_3e2l8"}, {"author": "MinimumCompetition85", "body": "Damn, relapsed! See you next month", "created_utc": "1630616771.0", "edited": "False", "id": "hbd6f7e", "is_submitter": "False", "link_id": "t3_pft8ho", "parent_id": "t3_pft8ho", "score": "2", "subreddit": "pornfree", "subreddit_id": "t5_2rglh"}, {"author": "MinimumCompetition85", "body": "And what program do you suggest? What kind of program should I use?", "created_utc": "1630501679.0", "edited": "False", "id": "hb6lc4i", "is_submitter": "True", "link_id": "t3_pffyz7", "parent_id": "t1_hb6hs8m", "score": "1", "subreddit": "pornfree", "subreddit_id": "t5_2rglh"}, {"author": "MinimumCompetition85", "body": "I don't follow a certain program, I am just trying to quit. Well idk about accountable but my girlfriend knows that I am battling this addiction and that I am trying to quit. Motivating for me is that I don't want to waste my time anymore, hours and hours that could have been spent more productively. Also I feel like porn makes me a worse lover, which is also motivating to quit. I guess the biggest difference is my environment. I moved to another city for work and it can get stressful at times, plus I didn't bring my TV or PlayStation to entertain myself after work which makes it harder. It's one of those excuses like \"c'mon you got nothing else to do\" etc. Maybe I need to find a way to relieve stress without PMO", "created_utc": "1630479463.0", "edited": "False", "id": "hb5qyh4", "is_submitter": "True", "link_id": "t3_pffyz7", "parent_id": "t1_hb4am0w", "score": "1", "subreddit": "pornfree", "subreddit_id": "t5_2rglh"}, {"author": "MinimumCompetition85", "body": "sign me up!", "created_utc": "1630447520.0", "edited": "False", "id": "hb425ma", "is_submitter": "False", "link_id": "t3_pf5raa", "parent_id": "t3_pf5raa", "score": "2", "subreddit": "pornfree", "subreddit_id": "t5_2rglh"}, {"author": "MinimumCompetition85", "body": "Anybody??", "created_utc": "1630312782.0", "edited": "False", "id": "hawnrzt", "is_submitter": "True", "link_id": "t3_p9ail6", "parent_id": "t1_hah6b01", "score": "1", "subreddit": "ImmigrationCanada", "subreddit_id": "t5_2w94s"}, {"author": "MinimumCompetition85", "body": "Thanks everybody! I recalculated the score and got 498 (493 if I'll be 32)\n\nthese were my assumptions:\n\n\\- married\n\n\\- 31 years old\n\n\\- Master's degree for me, bachelor's for wife (both not Canadian)\n\n\\- IELTS (S: 7.5-9.0,L: 8.5-9.0,R: 8.0-9.0, W:7.5-9.0 for me and S: 7.0, L: 8.0, R: 7.0-7.5, W: 7.0)\n\n\\- Work experience: 3 years or more, none in Canada\n\n\\- no certificate of qualification from a Canadian province, territory or federal body\n\n\\- no valid job offer\n\n\\- no nomination certificate from a province or territory\n\n\\- no relatives that are canadian citizens\n\n&#x200B;\n\n&#x200B;\n\nWhat would you say our chances are?", "created_utc": "1630013417.0", "edited": "False", "id": "hah6b01", "is_submitter": "True", "link_id": "t3_p9ail6", "parent_id": "t3_p9ail6", "score": "2", "subreddit": "ImmigrationCanada", "subreddit_id": "t5_2w94s"}, {"author": "MinimumCompetition85", "body": "I like working from the office, so I wouldn't mind going back to normal.", "created_utc": "1629904615.0", "edited": "False", "id": "haavgoe", "is_submitter": "False", "link_id": "t3_pbayt2", "parent_id": "t3_pbayt2", "score": "2", "subreddit": "consulting", "subreddit_id": "t5_2r121"}, {"author": "MinimumCompetition85", "body": "Thanks for your reply! Actually our initial plan was to move to the US, but since there is no straightforward process there like for Canada, we thought why not live in Canada for a few years in the meantime. An English speaking environment, which is also a neighboring country would be a good idea, and who knows which opportunities might arise from this. We will participate in this year's DV lottery and see how that goes. Results will be out next spring. Should we not get selected, I will look closer into our options about moving to Canada.", "created_utc": "1629668167.0", "edited": "False", "id": "h9yhqbv", "is_submitter": "True", "link_id": "t3_p9ail6", "parent_id": "t1_h9y897p", "score": "2", "subreddit": "ImmigrationCanada", "subreddit_id": "t5_2w94s"}, {"author": "MinimumCompetition85", "body": "Try listening to this urge surfing track next time", "created_utc": "1629665285.0", "edited": "False", "id": "h9ybba1", "is_submitter": "False", "link_id": "t3_p9ejlt", "parent_id": "t3_p9ejlt", "score": "1", "subreddit": "pornfree", "subreddit_id": "t5_2rglh"}, {"author": "MinimumCompetition85", "body": "That's probably it. I was very lazy during my undergrad and it took me very long to finish it. Thus I have less work experience than I should have at 28", "created_utc": "1629662909.0", "edited": "False", "id": "h9y5yta", "is_submitter": "True", "link_id": "t3_p9ail6", "parent_id": "t1_h9y5hf2", "score": "2", "subreddit": "ImmigrationCanada", "subreddit_id": "t5_2w94s"}, {"author": "MinimumCompetition85", "body": "Thank you very much for the detailed reply! So if we both want to go, one has to be the lead and the other one basically the secondary person in the application? And that lead would be me, because that way we would get more points? Does that mean that the points we get count for both of us together? Or do we need a certain minimum individually? Does married, common-law male a difference here?\nAnd yes, I am not going to learn French, since I know zero French right now. I'd rather try to get the highest score possible in IELTS, and would encourage her to do the same. I thought if she'd brush up her high school French that could help us, but apparently that is not the case. \nAnd also, say we get 470, would that be enough at all?", "created_utc": "1629653642.0", "edited": "False", "id": "h9xkp7q", "is_submitter": "True", "link_id": "t3_p9ail6", "parent_id": "t1_h9wwy1v", "score": "1", "subreddit": "ImmigrationCanada", "subreddit_id": "t5_2w94s"}, {"author": "MinimumCompetition85", "body": "I might take FDA approved Novavax. Whenever that's gonna be", "created_utc": "1629649843.0", "edited": "False", "id": "h9xbrsq", "is_submitter": "False", "link_id": "t3_p9aysn", "parent_id": "t3_p9aysn", "score": "1", "subreddit": "benshapiro", "subreddit_id": "t5_3779u"}, {"author": "MinimumCompetition85", "body": "See my answer above regarding my/our language abilities. Yes I typed in 30, because I don't think we will leave earlier than that. She'll be 24 by then. \n\nFor whom does it make sense to learn French? Is it necessary in our case? I might get to an advanced-beginner, lower-intermediate level in that time. Would it be worth it?", "created_utc": "1629641514.0", "edited": "False", "id": "h9wszrz", "is_submitter": "True", "link_id": "t3_p9ail6", "parent_id": "t1_h9wsjh7", "score": "3", "subreddit": "ImmigrationCanada", "subreddit_id": "t5_2w94s"}, {"author": "MinimumCompetition85", "body": "Mmm that's strange. Maybe wait and try again later. If it persists...actually idk who we could contact then...maybe some other more experiences user have an idea? :D", "created_utc": "1629641303.0", "edited": "False", "id": "h9wska8", "is_submitter": "False", "link_id": "t3_p9bm97", "parent_id": "t1_h9wr58z", "score": "3", "subreddit": "pornfree", "subreddit_id": "t5_2rglh"}, {"author": "MinimumCompetition85", "body": "On the right sidebar, you see \"Manage your badge\" in which you type in the clean date. It might take a while, if it doesn't work, try \"Reset your badge\" and enter the same day again. I had issues as well, but now it is working.\n\nAnd also, welcome aboard! This is a great place more mutual support. You can beat this addiction, and I can too! We got this!", "created_utc": "1629640299.0", "edited": "False", "id": "h9wqj36", "is_submitter": "False", "link_id": "t3_p9bm97", "parent_id": "t1_h9wp6wq", "score": "3", "subreddit": "pornfree", "subreddit_id": "t5_2rglh"}, {"author": "MinimumCompetition85", "body": "Thanks, I was very bold and assumed the highest IELTS scores for me lol \nThree years ago I had 107 points in the TOEFL, before starting my master's, which was completely in English  including the thesis. So I think I should manage. I'll also prepare thoroughly for it.\nFor my girlfriend I assumed the second highest scores in each category. She had French in school years ago. Could she squeeze out a few points with an A2 level of French? I don't know if it would make sense for me to start learning French from zero now.", "created_utc": "1629638683.0", "edited": "1629645763.0", "id": "h9wnewx", "is_submitter": "True", "link_id": "t3_p9ail6", "parent_id": "t1_h9wmuy5", "score": "1", "subreddit": "ImmigrationCanada", "subreddit_id": "t5_2w94s"}, {"author": "MinimumCompetition85", "body": "yes maybe one aspect might be \"better\" or more convenient, but you will also live with all the other aspects that are worse. It's about the full picture. Anyway, I have made my decision, I just need answes as to HOW I could make it :D\n\nBest of luck to you too!", "created_utc": "1629637193.0", "edited": "False", "id": "h9wkrsj", "is_submitter": "True", "link_id": "t3_p9ail6", "parent_id": "t1_h9wjzxh", "score": "2", "subreddit": "ImmigrationCanada", "subreddit_id": "t5_2w94s"}, {"author": "MinimumCompetition85", "body": "Thanks for your reply. We are not married yet. Apparently, married couples get fewer points, so maybe we should not get married before applying? But since we want to marry for sure within the next few years, I don't know how that would impact our chances to go to Canada. What do you mean by Common-Law?", "created_utc": "1629636661.0", "edited": "False", "id": "h9wjw8h", "is_submitter": "True", "link_id": "t3_p9ail6", "parent_id": "t1_h9wbjha", "score": "0", "subreddit": "ImmigrationCanada", "subreddit_id": "t5_2w94s"}, {"author": "MinimumCompetition85", "body": "Well, neither do I have PNP nor do I have any Canadian experience. Hopefully they will reopen express entry in the near future. That seems to be the only option for us.\n\nRegarding your question: I don't know. Since I am not homeless, that does not concern me.", "created_utc": "1629636391.0", "edited": "False", "id": "h9wjfz6", "is_submitter": "True", "link_id": "t3_p9ail6", "parent_id": "t1_h9wiqau", "score": "2", "subreddit": "ImmigrationCanada", "subreddit_id": "t5_2w94s"}, {"author": "MinimumCompetition85", "body": "What free healthcare? I pay 130 Euros per month for mine. And many services are not included. So that  is not a good enough argument for me to stay here and pay 50%+ in taxes. Also, as I said, there is the cultural aspect. I know many people who love Germany, I am just not one of them. \n\nWhat do you mean closed? They don't do it anymore? I would want to leave in 2-3 years from now.", "created_utc": "1629635811.0", "edited": "False", "id": "h9wij2s", "is_submitter": "True", "link_id": "t3_p9ail6", "parent_id": "t1_h9whr94", "score": "2", "subreddit": "ImmigrationCanada", "subreddit_id": "t5_2w94s"}, {"author": "MinimumCompetition85", "body": "Idk I can only tell you what the calculator said. Maybe because it is a foreign master's or because I am 28 already, who knows.\n\nWell, I just don't really feel at home here. I like Canadian or American culture way better, that is why I want to move to either of those countries. Also, taxes are astronomical in Germany. For someone who is working hard and tries to make a good living, it is not the best place to be.", "created_utc": "1629635206.0", "edited": "False", "id": "h9whlv1", "is_submitter": "True", "link_id": "t3_p9ail6", "parent_id": "t1_h9wgl3z", "score": "2", "subreddit": "ImmigrationCanada", "subreddit_id": "t5_2w94s"}, {"author": "MinimumCompetition85", "body": "Don't overthink it, it is definitely not a relapse. You don't have full control over your dreams, so don't worry. Actually it could be a good sign, that your brain has started to rewire. Keep it up!", "created_utc": "1629575222.0", "edited": "False", "id": "h9tp1hh", "is_submitter": "False", "link_id": "t3_p8q672", "parent_id": "t3_p8q672", "score": "4", "subreddit": "pornfree", "subreddit_id": "t5_2rglh"}, {"author": "MinimumCompetition85", "body": "Yes, unfortunately I don't know much about US contract or labor law, but afaik this only applies to the US offices. As you said it would be hard to enforce this in other jurisdictions. But which US laws could they refer to that would support it? I think it's not that easy", "created_utc": "1629378762.0", "edited": "False", "id": "h9j1vat", "is_submitter": "False", "link_id": "t3_p6u1al", "parent_id": "t1_h9j0mef", "score": "1", "subreddit": "consulting", "subreddit_id": "t5_2r121"}, {"author": "MinimumCompetition85", "body": "Exactly, maybe some lawyers can shed some light on this. I doubt anything like that could be found in the employee's contracts", "created_utc": "1629377769.0", "edited": "False", "id": "h9izwby", "is_submitter": "False", "link_id": "t3_p6u1al", "parent_id": "t1_h9iw7ek", "score": "1", "subreddit": "consulting", "subreddit_id": "t5_2r121"}, {"author": "MinimumCompetition85", "body": "Is an employer allowed to demand this? What does the law say?", "created_utc": "1629365883.0", "edited": "False", "id": "h9iibvn", "is_submitter": "False", "link_id": "t3_p6u1al", "parent_id": "t3_p6u1al", "score": "1", "subreddit": "consulting", "subreddit_id": "t5_2r121"}, {"author": "MinimumCompetition85", "body": "Got ya! 😂", "created_utc": "1628975396.0", "edited": "False", "id": "h8yewss", "is_submitter": "True", "link_id": "t3_p3u5w8", "parent_id": "t1_h8yelzt", "score": "2", "subreddit": "askdfw", "subreddit_id": "t5_3e2l8"}, {"author": "MinimumCompetition85", "body": "Can you bear two more residents? We won't bother anyone, promise 🙏🏻", "created_utc": "1628975186.0", "edited": "False", "id": "h8yegit", "is_submitter": "True", "link_id": "t3_p3u5w8", "parent_id": "t1_h8yafx2", "score": "2", "subreddit": "askdfw", "subreddit_id": "t5_3e2l8"}, {"author": "MinimumCompetition85", "body": "Oh that doesn't sound very exciting. Would you say it's still nice to live in Dallas? Are there maybe some plans to revive the city center?", "created_utc": "1628959779.0", "edited": "False", "id": "h8xfy9o", "is_submitter": "True", "link_id": "t3_p3u5w8", "parent_id": "t1_h8x53g6", "score": "1", "subreddit": "askdfw", "subreddit_id": "t5_3e2l8"}, {"author": "MinimumCompetition85", "body": "But why is that? One would think that the city center would be the most crowded", "created_utc": "1628927378.0", "edited": "False", "id": "h8vyjwo", "is_submitter": "True", "link_id": "t3_p3u5w8", "parent_id": "t1_h8u40u5", "score": "1", "subreddit": "askdfw", "subreddit_id": "t5_3e2l8"}, {"author": "MinimumCompetition85", "body": "Good to know, thanks!", "created_utc": "1628927318.0", "edited": "False", "id": "h8vyh89", "is_submitter": "True", "link_id": "t3_p3u5w8", "parent_id": "t1_h8uehjr", "score": "1", "subreddit": "askdfw", "subreddit_id": "t5_3e2l8"}, {"author": "MinimumCompetition85", "body": "I'd say most pictures were taking during winter. No leafs on the trees. How hot does it get on a typical summer day in DFW?", "created_utc": "1628927292.0", "edited": "False", "id": "h8vyg4v", "is_submitter": "True", "link_id": "t3_p3u5w8", "parent_id": "t1_h8u2r2u", "score": "2", "subreddit": "askdfw", "subreddit_id": "t5_3e2l8"}, {"author": "MinimumCompetition85", "body": "Haha yes but most pictures where probably taking during the winter judging from the trees, that's why I was wondering", "created_utc": "1628927236.0", "edited": "False", "id": "h8vydpm", "is_submitter": "True", "link_id": "t3_p3u5w8", "parent_id": "t1_h8ulke8", "score": "1", "subreddit": "askdfw", "subreddit_id": "t5_3e2l8"}, {"author": "MinimumCompetition85", "body": "Which areas are for hanging out and entertainment? Are they more packed?", "created_utc": "1628927165.0", "edited": "False", "id": "h8vyair", "is_submitter": "True", "link_id": "t3_p3u5w8", "parent_id": "t1_h8uf240", "score": "1", "subreddit": "askdfw", "subreddit_id": "t5_3e2l8"}, {"author": "MinimumCompetition85", "body": "I don't think so. They just blur the faces afaik. It's not like there isn't a single person visible so I don't think people get edited out", "created_utc": "1628927125.0", "edited": "False", "id": "h8vy8ra", "is_submitter": "True", "link_id": "t3_p3u5w8", "parent_id": "t1_h8vbx4s", "score": "3", "subreddit": "askdfw", "subreddit_id": "t5_3e2l8"}, {"author": "MinimumCompetition85", "body": "Omg isn't anyone doing something about the homeless? Sounds like a nightmare to walk around downtown", "created_utc": "1628927045.0", "edited": "False", "id": "h8vy58v", "is_submitter": "True", "link_id": "t3_p3u5w8", "parent_id": "t1_h8uefkh", "score": "0", "subreddit": "askdfw", "subreddit_id": "t5_3e2l8"}, {"author": "MinimumCompetition85", "body": "I feel exactly the same about \"my\" country, Germany. Born in the wrong country sums it up perfectly", "created_utc": "1628273999.0", "edited": "False", "id": "h7ypxnc", "is_submitter": "False", "link_id": "t3_oz4f94", "parent_id": "t1_h7y0vqs", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "MinimumCompetition85", "body": "Of course I would take it. Accent training is part of my language learning routine and it takes time and dedication, just like studying grammar or learning new vocabulary. Since I want to move to the US one day, it would make sense for me to sound as close to a native speaker as possible in English. Maybe there is a fourth category? Those who keep working on their accent and never stop trying? :D", "created_utc": "1628273665.0", "edited": "False", "id": "h7yp5uc", "is_submitter": "False", "link_id": "t3_oz4f94", "parent_id": "t3_oz4f94", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "MinimumCompetition85", "body": "Yes, as I am rewatching it now, I can really tell how he is getting more and more insecure. First, Kenny gets published and nobody likes his play, then Don flies to California instead of him, then Peggy gets her own office, then the Penn Station guys did not want him on their account anymore, Ken and Pete become head of accounts etc. everyone is moving forward and he seems to be stagnating, starting to fear for his job, especially during/after the merger.", "created_utc": "1627825623.0", "edited": "False", "id": "h7b9zv0", "is_submitter": "True", "link_id": "t3_ovbdam", "parent_id": "t1_h7b5rus", "score": "2", "subreddit": "madmen", "subreddit_id": "t5_2r7l7"}, {"author": "MinimumCompetition85", "body": "Absolutely! I get what you mean, it has to do with his character and how he wants to be seen as intelligent. In German that would be people using complex or uncommon synonyms instead of easier language to sound more sophisticated.", "created_utc": "1627813142.0", "edited": "False", "id": "h7asbz0", "is_submitter": "True", "link_id": "t3_ovbdam", "parent_id": "t1_h7as3d1", "score": "2", "subreddit": "madmen", "subreddit_id": "t5_2r7l7"}, {"author": "MinimumCompetition85", "body": "Wow thanks for the detailed reply! Yes I thought it was Paul being pretentious. They immediately told him not to talk during the meeting after he said that.", "created_utc": "1627811477.0", "edited": "False", "id": "h7aqhiz", "is_submitter": "True", "link_id": "t3_ovbdam", "parent_id": "t1_h7aq5lo", "score": "3", "subreddit": "madmen", "subreddit_id": "t5_2r7l7"}, {"author": "MinimumCompetition85", "body": "\\- conduct unbefitting is what Roger called Freddy's \"accident\"\n\n\\- tempest in a teapot is Gene's response when everyone was worried after his stroke (we use the same expression in German)\n\n\\- to be a good egg is from Duck Philips, can't remember when he used it\n\n\\- stickey wicket is also from Duck, after Peter told him about the loss of the Clearasil account\n\n\\- behoove is something Paul once said in a meeting, can't remember the context\n\n\\- in the lavender haze is what Anna said to Don after he told her about Betty for the first time\n\n\\- hear from the horse's mouth is also from Duck\n\n\\- yellow-bellied is what Ken called Paul after he did not want to sneak into Bert's office with them to look at the painting\n\nand there are many others, I just picked a few that I thought could be a little old-fashioned. Since I speak/learn American English I don't try to learn new words from Lane. Is it possible, that Duck has picked up a few British words from his time at PPL?", "created_utc": "1627799028.0", "edited": "False", "id": "h7acb7e", "is_submitter": "True", "link_id": "t3_ovbdam", "parent_id": "t1_h791z4t", "score": "1", "subreddit": "madmen", "subreddit_id": "t5_2r7l7"}, {"author": "MinimumCompetition85", "body": "I was just kidding", "created_utc": "1627764295.0", "edited": "False", "id": "h78orft", "is_submitter": "True", "link_id": "t3_ovbdam", "parent_id": "t1_h78nvt6", "score": "2", "subreddit": "madmen", "subreddit_id": "t5_2r7l7"}, {"author": "MinimumCompetition85", "body": "CNN is such a joke lmao", "created_utc": "1627763739.0", "edited": "False", "id": "h78noa7", "is_submitter": "False", "link_id": "t3_ov9qto", "parent_id": "t3_ov9qto", "score": "5", "subreddit": "TheTrumpZone", "subreddit_id": "t5_3ad1fs"}, {"author": "MinimumCompetition85", "body": "Alright got it!", "created_utc": "1627763683.0", "edited": "False", "id": "h78nkcb", "is_submitter": "True", "link_id": "t3_ovbdam", "parent_id": "t1_h78neeu", "score": "3", "subreddit": "madmen", "subreddit_id": "t5_2r7l7"}, {"author": "MinimumCompetition85", "body": "Thanks for the suggestions, I'll check it out!", "created_utc": "1627763384.0", "edited": "False", "id": "h78mz3b", "is_submitter": "True", "link_id": "t3_ovbdam", "parent_id": "t1_h7890oy", "score": "1", "subreddit": "madmen", "subreddit_id": "t5_2r7l7"}, {"author": "MinimumCompetition85", "body": "Like hell's bells for example? :D", "created_utc": "1627763012.0", "edited": "False", "id": "h78m8v9", "is_submitter": "True", "link_id": "t3_ovbdam", "parent_id": "t1_h78dthb", "score": "1", "subreddit": "madmen", "subreddit_id": "t5_2r7l7"}, {"author": "MinimumCompetition85", "body": "I know about them, that's obvious. I was talking about idioms that might not be used anymore and would sound \"old\" if used today. Apparently I don't need to worry that much about it according to most people here though", "created_utc": "1627762581.0", "edited": "False", "id": "h78le8o", "is_submitter": "True", "link_id": "t3_ovbdam", "parent_id": "t1_h78jn19", "score": "3", "subreddit": "madmen", "subreddit_id": "t5_2r7l7"}, {"author": "MinimumCompetition85", "body": "Thanks! Do you know a modern word I could use instead?", "created_utc": "1627762031.0", "edited": "False", "id": "h78kavx", "is_submitter": "True", "link_id": "t3_ovbdam", "parent_id": "t1_h78desn", "score": "1", "subreddit": "madmen", "subreddit_id": "t5_2r7l7"}, {"author": "MinimumCompetition85", "body": "That's good to know! Merriam Webster says \"being a good egg\" is somewhat old-fashioned, that's what made me think about this topic to begin with. I am glad that most of the words used are not outdated. I really learn A LOT of new stuff from this show.", "created_utc": "1627761831.0", "edited": "False", "id": "h78jwd9", "is_submitter": "True", "link_id": "t3_ovbdam", "parent_id": "t1_h78e46i", "score": "1", "subreddit": "madmen", "subreddit_id": "t5_2r7l7"}, {"author": "MinimumCompetition85", "body": "Just know that you are not giving up anything. There is not a single positive thing to porn. You are freeing yourself from a crippling addiction! So instead of being scared you should be happy that you can live life without the need to watch porn :)\n\nKeep it up!", "created_utc": "1625822734.0", "edited": "False", "id": "h4knl7i", "is_submitter": "True", "link_id": "t3_ogdl1q", "parent_id": "t1_h4jh2ni", "score": "4", "subreddit": "pornfree", "subreddit_id": "t5_2rglh"}, {"author": "MinimumCompetition85", "body": "In my point of view it comes down to opportunity costs. If you devote a lot of time to learning a skill that is essentially \"useless\" to you, since you'd never use it, you could ask yourself the question what other useful things you could have done or learned instead in that time. But if you learn languages \"for fun\", it's better to treat it as you would any other hobby. Meaning that it should not take focus away from other more important things, but can still be a nice thing to spend your time on.", "created_utc": "1625495783.0", "edited": "False", "id": "h44rmvm", "is_submitter": "False", "link_id": "t3_lx9zyv", "parent_id": "t3_lx9zyv", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "MinimumCompetition85", "body": "I am glad you found it helpful! Keep it up! :)", "created_utc": "1625305168.0", "edited": "False", "id": "h3wll44", "is_submitter": "False", "link_id": "t3_obzegt", "parent_id": "t1_h3vc5xt", "score": "2", "subreddit": "pornfree", "subreddit_id": "t5_2rglh"}, {"author": "MinimumCompetition85", "body": "Wow, first of all, I think it is really great and takes a lot of courage to share these intimate experiences with us here! \n\nNow that you are aware of the bad effects porn had on you, remember to always go back to this thread and reread that whenever you are about to relapse or feel an urge to watch porn. Hopefully it will make it seem not worth it at all. You know the shame, you know the pain and how it feels like to be disappointed with yourself. I know you do not want that anymore, and I know you can change for the better! Just imagine a future-self, a better version of yourself, free of guilt, anxiety and PIED. That is the future you want for yourself and all the porn-dopamine in the world cannot make you as happy as you could become if you quit it once and for all. I am not an expert on this, so I will refer you to three books I have read that really helped me. I think knowledge is power in that regard and the five question above also stem from one of the books. You can read, in no particular order:\n\n1. Your Brain on Porn by Gary Wilson\n2. The Porn Trap by Wendy & Larry Waltz (the 5 questions plus many more)\n3. The Porn Myth by Matt Fradd\n\nI feel like reading helps a lot, especially during the first few days/weeks, because you learn so much about the negative effects of porn. You will see how your personal experiences line up with the scientific data and other anecdotal evidence from countless other addicts. As you have seen in this thread, you are not alone! We are all in this together, and we will all make it! You got this!", "created_utc": "1625233733.0", "edited": "False", "id": "h3symz8", "is_submitter": "False", "link_id": "t3_obzegt", "parent_id": "t1_h3suay8", "score": "5", "subreddit": "pornfree", "subreddit_id": "t5_2rglh"}, {"author": "MinimumCompetition85", "body": "I find it funny how many people in here just say \"stop watching porn\" as if you haven't tried that already for a year now. What you need to do is to find out, why you even ended up in the place you are right now. You can start by answering the following questions for yourself:\n\n1. what problems has porn caused me in the past?\n2. what problems am I experiencing today because of my porn use?\n3. How has porn changed me in ways I do not like?\n4. How does my porn use hurt my intimate partner or others?\n5. What problems could occur in the future if I continue to use porn?\n\nYou should not just shallowly think about the answers but actually write them down. A few paragraphs per question minimum. Go deep inside you, you don't need to share that with anyone but yourself.\n\nIn addition to the above questions, try to think back to when it all started. What did you feel back then? What made you go back to porn? Did you already notice some triggers that make you want to watch porn? Maybe whenever you are stressed or sad? Also you always have to be in the \"I am quitting this\" stage. That means, even after a relapse, you need to get back on track immediately and try your hardest to prevent further relapses. If you answer the first five questions, you can go back to them and read them, whenever you have urges. That should make the relapse seem much less attractive, because you are consciously thinking about the problems it causes you.\n\nThe first step always has to be to assess your situation thoroughly. If you have tried unsuccessfully for a year now, maybe it's time to approach this differently. Feel free to contact me if you have any questions! \n\nBest of luck! I know you can do it!", "created_utc": "1625221886.0", "edited": "False", "id": "h3sfj04", "is_submitter": "False", "link_id": "t3_obzegt", "parent_id": "t3_obzegt", "score": "8", "subreddit": "pornfree", "subreddit_id": "t5_2rglh"}, {"author": "MinimumCompetition85", "body": "As a German, I would say \"natürlich\" is very common, but \"wunderbar\" isn't. I almost never use \"wunderbar\" as a single expression. Only in sentencnes like \"das hat wunderbar geklappt\" or something like that. And that also applies to almost everyone I know. \"Natürlich\" on the other hand is more frequently used.", "created_utc": "1625221193.0", "edited": "False", "id": "h3seofl", "is_submitter": "False", "link_id": "t3_lgi805", "parent_id": "t3_lgi805", "score": "1", "subreddit": "German", "subreddit_id": "t5_2qq51"}, {"author": "MinimumCompetition85", "body": "Thank you for your advice! The goal for tomorrow will be to stay clean! Day 1 again...", "created_utc": "1624565029.0", "edited": "False", "id": "h2x8zxc", "is_submitter": "True", "link_id": "t3_o777sn", "parent_id": "t1_h2x0n84", "score": "1", "subreddit": "pornfree", "subreddit_id": "t5_2rglh"}, {"author": "MinimumCompetition85", "body": "Exactly! Also I was very aware of what I was doing and my thinking patterns were different. Hard to describe but I sure knew that something in my mindset had definitely changed. I want to see that streak go up again!", "created_utc": "1624564996.0", "edited": "False", "id": "h2x8xep", "is_submitter": "True", "link_id": "t3_o777sn", "parent_id": "t1_h2x5dlx", "score": "1", "subreddit": "pornfree", "subreddit_id": "t5_2rglh"}, {"author": "MinimumCompetition85", "body": "Yes that's a good idea! I mostly watch Russian Progress. He is making lots of vlog style videos with subtitles, all completely in Russian. Helps a lot to improve listening skills and to learn new vocabulary.", "created_utc": "1624547163.0", "edited": "False", "id": "h2w4p94", "is_submitter": "True", "link_id": "t3_o6ckx9", "parent_id": "t1_h2w1qby", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "MinimumCompetition85", "body": "She should go see a doctor. But the chuckling tells me that even she knows how stupid that sounds.", "created_utc": "1624532873.0", "edited": "False", "id": "h2vfacv", "is_submitter": "False", "link_id": "t3_o6qfum", "parent_id": "t3_o6qfum", "score": "1", "subreddit": "JordanPeterson", "subreddit_id": "t5_32jqy"}, {"author": "MinimumCompetition85", "body": "I understand what you mean. But I think 1 hour per language is quite a lot tbh. 30 minutes would also be enough daily pracitce, which would be 2h in total. Maintenance however does not require a lot of time, but that is only possible as soon as you have a rather high level. I think that is also what you were saying. I don't do much for my Russian for example, I read a bit and watch some Youtube, but I feel it is getting better again, after having abandonded it for quite some time. The learning stage is really the one that requires the most time and effort. And since Spanish will be much more important to be, I am inclined to continue with Spanish, to get it to an intermediate level. I just want to make sure not to lose my progress with Italian in the meantime.", "created_utc": "1624532688.0", "edited": "False", "id": "h2vf278", "is_submitter": "True", "link_id": "t3_o6ckx9", "parent_id": "t1_h2vbeyh", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "MinimumCompetition85", "body": "Thanks for your reply! Right now, I am thinking about moving to Dallas, TX so I guess Spanish would definitely be a big plus there. I am also going to work on my accent in English, since I am working in consulting. Being a good communicator is a must in that industry and I don't want people to think I am not as capable because of some accent.", "created_utc": "1624515895.0", "edited": "False", "id": "h2uwz34", "is_submitter": "True", "link_id": "t3_o6ckx9", "parent_id": "t1_h2rowb3", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "MinimumCompetition85", "body": "Thanks for your reply! It is in fact my goal to move to the US, so I want my English to be as good as possible. That's why it is way more important to me than the other languages. For the rest I would be okay with a B1-B2 level honestly. So you are suggesting, that I should continue with Spanish? My wish to move to the US is actually the reason why I wanted to learn it in the first place, since it might come in handy later on. So in terms of importance/relevance it is definitely top 2, right after English. I just don't want to lose my progress in Italian, maybe a little maintenance work would do?", "created_utc": "1624456188.0", "edited": "False", "id": "h2rn557", "is_submitter": "True", "link_id": "t3_o6ckx9", "parent_id": "t1_h2rleao", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "MinimumCompetition85", "body": "I hope that is true! Otherwise NYC is finished....", "created_utc": "1624449396.0", "edited": "False", "id": "h2rbfdn", "is_submitter": "False", "link_id": "t3_o64xvy", "parent_id": "t1_h2r2oww", "score": "3", "subreddit": "Conservative", "subreddit_id": "t5_2qh6p"}, {"author": "MinimumCompetition85", "body": "Awesome! I believe in you! Go one day at a time, always wake up like \"today I am NOT going to watch porn!\" You got this!", "created_utc": "1624449252.0", "edited": "False", "id": "h2rb87d", "is_submitter": "False", "link_id": "t3_o68z0g", "parent_id": "t3_o68z0g", "score": "3", "subreddit": "pornfree", "subreddit_id": "t5_2rglh"}, {"author": "MinimumCompetition85", "body": "Exactly my thoughts! Even though I do not have a heavy German accent, I know that I still have to work on it. Especially in a professional environment. It always sounds nice to say \"don't worry, it's alright etc.\" but I am not going to sell hot dogs on the streets somewhere, I am in management consulting. So obviously my speech has to represent a certain standard of professionalism and a foreign accent might be hurtful. Thanks for your advice!", "created_utc": "1624440667.0", "edited": "False", "id": "h2r14a4", "is_submitter": "True", "link_id": "t3_o5l8ng", "parent_id": "t1_h2plzhl", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "MinimumCompetition85", "body": "Exactly! I was about 40 days clean today and out of nowhere I had these extreme urges that lead to a relapse. Looking back at it, I began to pay more attention to girls bodies in YouTube videos lately, checking them out etc. These subtle things made me dream about porn a few days ago and now I had to reset my day counter. So be careful guys! No matter how far you have come, never let your guard down", "created_utc": "1624393454.0", "edited": "False", "id": "h2owl01", "is_submitter": "False", "link_id": "t3_o5pr3l", "parent_id": "t3_o5pr3l", "score": "1", "subreddit": "pornfree", "subreddit_id": "t5_2rglh"}, {"author": "MinimumCompetition85", "body": "Sure, but it is not the only study out there. I understand what you are saying, but I feel like my career (consulting) might be one of those where it could matter, since it is a client facing job. I will work on my accent anyway, just to eliminate any risks there. I just wanted to know if speaking other languages (with other accents ofc) could hinder my progress in that regard. A few others have suggested that studying other languages as well might even be beneficial for me, so that makes me hopeful :)", "created_utc": "1624388007.0", "edited": "False", "id": "h2okc3t", "is_submitter": "True", "link_id": "t3_o5l8ng", "parent_id": "t1_h2oi0um", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "MinimumCompetition85", "body": "I don't know if that's true. Some studies suggest otherwise:\n\nhttps://www.psychologicalscience.org/news/minds-business/can-having-a-foreign-accent-hurt-your-career.html", "created_utc": "1624386538.0", "edited": "False", "id": "h2oh23u", "is_submitter": "True", "link_id": "t3_o5l8ng", "parent_id": "t1_h2ognpl", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "MinimumCompetition85", "body": "Congratulations! Keep it up, you can do it! ;)", "created_utc": "1624364276.0", "edited": "False", "id": "h2n6nuf", "is_submitter": "False", "link_id": "t3_o5cxj6", "parent_id": "t3_o5cxj6", "score": "2", "subreddit": "pornfree", "subreddit_id": "t5_2rglh"}, {"author": "MinimumCompetition85", "body": "Exactly! I am also about 20 days clean now and it's awesome! We can all do it!", "created_utc": "1622722415.0", "edited": "False", "id": "h0fi0zt", "is_submitter": "False", "link_id": "t3_nr93xx", "parent_id": "t3_nr93xx", "score": "2", "subreddit": "pornfree", "subreddit_id": "t5_2rglh"}, {"author": "MinimumCompetition85", "body": "Yeah it seems like Tech guys have it easier than management guys haha \nI will be with a consulting company that is specialized in restructuring and turnaround soon but they don't have any offices outside of Germany. And the big American companies that work in this field usually want to see a few years of experience, so I guess I could try it in like 2 years from now if I don't get lucky with the DV lottery in the meantime", "created_utc": "1621369811.0", "edited": "False", "id": "gym3nty", "is_submitter": "True", "link_id": "t3_nfda7n", "parent_id": "t1_gym383i", "score": "1", "subreddit": "immigration", "subreddit_id": "t5_2qvj0"}, {"author": "MinimumCompetition85", "body": "Thank you! I will try that!", "created_utc": "1621359099.0", "edited": "False", "id": "gyld6b1", "is_submitter": "True", "link_id": "t3_nfda7n", "parent_id": "t1_gylbe15", "score": "1", "subreddit": "immigration", "subreddit_id": "t5_2qvj0"}, {"author": "MinimumCompetition85", "body": "Yeah so it's just about probability? I know that there's a limited number of visas per year, I thought maybe you were referring to some other problem that makes it difficult. I guess I can only hope to be lucky enough to get one.", "created_utc": "1621357859.0", "edited": "False", "id": "gyla3ix", "is_submitter": "True", "link_id": "t3_nfda7n", "parent_id": "t1_gyl33d6", "score": "1", "subreddit": "immigration", "subreddit_id": "t5_2qvj0"}, {"author": "MinimumCompetition85", "body": "What makes it difficult? There are plenty of foreign nationals working for big US consulting firms so there must be a way to do it. I think if I work hard enough and prove my worth, there should be a company willing to employ me, right?", "created_utc": "1621354828.0", "edited": "False", "id": "gyl2n94", "is_submitter": "True", "link_id": "t3_nfda7n", "parent_id": "t1_gykvydn", "score": "1", "subreddit": "immigration", "subreddit_id": "t5_2qvj0"}, {"author": "MinimumCompetition85", "body": "Wow, thanks for the quick response!\n\n>American companies often sponsor people who are currently working for them, and have shown themselves to be a valuable employee. These individuals are often people who have some sort of work visa (Canadian/Mexicans have easier access to work visas, as well as US university graduates who get a 3 year work permit). The only work visa you'd be eligible for is likely the H-1B, which is subject to the lottery.\n\nSo, I should try to get a H-1B visa, work for an American company, prove that I am a valuable employee and then the company might sponsor the green card? Seems like the best way to do it, would be an internal transfer, as you have said.\n\nAlso, when you say Canadians, do you mean Canadian citizens or does it also apply to permanent residents of Canada? (which seems to be easier to obtain and might be an intermediate step for me, before I could get to the US)", "created_utc": "1621352429.0", "edited": "False", "id": "gykwtej", "is_submitter": "True", "link_id": "t3_nfda7n", "parent_id": "t1_gyku7ru", "score": "1", "subreddit": "immigration", "subreddit_id": "t5_2qvj0"}, {"author": "MinimumCompetition85", "body": "What on earth does BIPOC stand for?", "created_utc": "1621066286.0", "edited": "False", "id": "gy70n79", "is_submitter": "False", "link_id": "t3_nckrxn", "parent_id": "t3_nckrxn", "score": "1", "subreddit": "JordanPeterson", "subreddit_id": "t5_32jqy"}, {"author": "MinimumCompetition85", "body": "Thank you! It's good to know I am not the only one feeling that way. I guess this is all part of the collateral damage the lockdowns have caused. There are probably many more people who feel that way. We must remind ourselves that it's not as bad everywhere. And thank you I will try my best to get the green card eventually! :)", "created_utc": "1621066139.0", "edited": "False", "id": "gy70htb", "is_submitter": "True", "link_id": "t3_na91kh", "parent_id": "t1_gxxao5e", "score": "1", "subreddit": "selfimprovement", "subreddit_id": "t5_2qmbm"}, {"author": "MinimumCompetition85", "body": "Way to go! May the 4th be with you :D", "created_utc": "1620895681.0", "edited": "False", "id": "gxygzy2", "is_submitter": "False", "link_id": "t3_nb9anz", "parent_id": "t3_nb9anz", "score": "2", "subreddit": "pornfree", "subreddit_id": "t5_2rglh"}, {"author": "MinimumCompetition85", "body": "In my book, every pornfree day makes you stronger. It's like saying, an alcoholic is weak because he does not go to a bar to drink water. Why risk a relapse? It's all about progress!", "created_utc": "1620833565.0", "edited": "False", "id": "gxv4297", "is_submitter": "False", "link_id": "t3_nan8ok", "parent_id": "t1_gxv06nb", "score": "2", "subreddit": "pornfree", "subreddit_id": "t5_2rglh"}, {"author": "MinimumCompetition85", "body": "In order to fight urges, it is important to distance yourself from potential triggers. Don't sit alone in front of a computer would be a good first step. And also, focus on something else. Take a walk, exercise, call a friend, whatever it is...try to ban any thoughts about porn from your mind and the urges will go away!", "created_utc": "1620822733.0", "edited": "False", "id": "gxugnjv", "is_submitter": "False", "link_id": "t3_nan8ok", "parent_id": "t3_nan8ok", "score": "2", "subreddit": "pornfree", "subreddit_id": "t5_2rglh"}, {"author": "MinimumCompetition85", "body": "Absolutely! When I was younger I had this ridiculous idea of becoming a multi-millionaire, living in a mansion, partying, enjoying life etc. \"living the dream\" so to say. What a meaningless life that would have been... (besides that I have no idea how to get that rich anyway)\n\nNow, a few days before my 28th birthday, my goals have changed dramatically and I am searching for more meaning in my life. What good is a huge mansion if you're living in it alone? As you said, all superficial crap that does not bring happiness. After I have met my girlfriend, I have realized what I really want in life. I want to have a happy marriage, kids, a fulfilling job, a house in the suburbs...you know, what others might consider boring. But I think there is a time for partying and that time is over. I need to take responsibility for myself and for my family. Raising a family, and providing a happy life for my wife and kids is so much more meaningful than any luxury items. I still want to make a good living, but I am not willing to sacrifice my health and relationships for that anymore. It is all about balance and I think I have found what truly makes me happy. Being a good husband and father, an honest human being with values that go beyond superficial cravings for luxury. Wow, this is what growing up feels like right? haha", "created_utc": "1620818007.0", "edited": "False", "id": "gxu9ar0", "is_submitter": "False", "link_id": "t3_nalloi", "parent_id": "t3_nalloi", "score": "46", "subreddit": "selfimprovement", "subreddit_id": "t5_2qmbm"}, {"author": "MinimumCompetition85", "body": "It is mainly for recovery from porn. If you want to stop masturbating, check out r/NoFap", "created_utc": "1620811890.0", "edited": "1620815676.0", "id": "gxu2430", "is_submitter": "False", "link_id": "t3_naj42y", "parent_id": "t3_naj42y", "score": "1", "subreddit": "pornfree", "subreddit_id": "t5_2rglh"}, {"author": "MinimumCompetition85", "body": "Will do!", "created_utc": "1620810310.0", "edited": "False", "id": "gxu0hy5", "is_submitter": "False", "link_id": "t3_najwnk", "parent_id": "t3_najwnk", "score": "2", "subreddit": "selfimprovement", "subreddit_id": "t5_2qmbm"}, {"author": "MinimumCompetition85", "body": "Welcome and congratulations on your decision! It is definitely the right one!", "created_utc": "1620803533.0", "edited": "False", "id": "gxttb6f", "is_submitter": "False", "link_id": "t3_nag2x6", "parent_id": "t3_nag2x6", "score": "1", "subreddit": "pornfree", "subreddit_id": "t5_2rglh"}, {"author": "MinimumCompetition85", "body": "I am also suffering from PE and what I can tell you is this: the longer you stay away from porn the better it will become. PE is caused when we train ourselves to reach orgasm as fast as possible. When I would watch porn I would be edging and bring myself close to the point of no return multiple times. That is a bad habit. It also trains your pelvic floor in a very bad way, which leads to imbalance. So my advice:\n1. Stop watching porn entirely (Duh!)\n2. When you jack off, try to simulate sex as best as you can, using lube or a toy and try to not cum too quickly. \n3. Don't sweat it! You will see that if you are relaxed you will have a better time with the girl ;)\n\nIf you do this you will condition your body to real sex and learn how to prolong the phase before arousal spikes and leads to the PONR. Oh and I would say only jack off if you are really horny and want to take the time for it. Not just out of boredom to quickly rub one out. We want to change our habits and let go of bad habits.", "created_utc": "1620803280.0", "edited": "False", "id": "gxtt0zt", "is_submitter": "False", "link_id": "t3_nafhod", "parent_id": "t3_nafhod", "score": "4", "subreddit": "pornfree", "subreddit_id": "t5_2rglh"}, {"author": "MinimumCompetition85", "body": "Awesome! Can't stop this shit early enough. Makes me feel hopeful for the youth haha I wish more you people would dump porn.\n\nRemember that for most guys doing nofap at the same time as porn free can be tricky. All in all porn is the evil and jacking off without it can be a good way to release some sexual tension.", "created_utc": "1620802733.0", "edited": "False", "id": "gxtsec2", "is_submitter": "False", "link_id": "t3_nabvdf", "parent_id": "t3_nabvdf", "score": "2", "subreddit": "pornfree", "subreddit_id": "t5_2rglh"}, {"author": "MinimumCompetition85", "body": "One question, when you say not jacking off what do you mean? Are you doing nofap or porn free? Keep in mind that for most people on here, porn is the evil and not jacking off. Anyways, congratulations to you even though you did not quite reach the four days. Keep going!", "created_utc": "1620802540.0", "edited": "False", "id": "gxts694", "is_submitter": "False", "link_id": "t3_nah8hz", "parent_id": "t3_nah8hz", "score": "2", "subreddit": "pornfree", "subreddit_id": "t5_2rglh"}, {"author": "MinimumCompetition85", "body": "Don't think that a relapse eradicates your progress because it doesn't. Instead of focusing on the streak, focus on the total porn free days! You have already made great progress! Know that if you can go four weeks without porn once, you can do it again!", "created_utc": "1620801907.0", "edited": "False", "id": "gxtrfg8", "is_submitter": "False", "link_id": "t3_nafzij", "parent_id": "t3_nafzij", "score": "9", "subreddit": "pornfree", "subreddit_id": "t5_2rglh"}, {"author": "MinimumCompetition85", "body": "Thanks for your reply! Yeah, I know that I do not have one of the most popular professions. The way I see it, I should be eligible for an EB-2 visa right? \n\nSo, get a job in Germany at a bigger company with offices in the US and then see if I can get transfered internally to get a green card? If that's what I have to do, so be it!", "created_utc": "1620769277.0", "edited": "False", "id": "gxs4e6l", "is_submitter": "True", "link_id": "t3_na5sfx", "parent_id": "t1_gxru8x7", "score": "2", "subreddit": "IWantOut", "subreddit_id": "t5_2r5hw"}, {"author": "MinimumCompetition85", "body": "Thank you, it seems to have worked!", "created_utc": "1620671255.0", "edited": "False", "id": "gxmyfz9", "is_submitter": "True", "link_id": "t3_n98gta", "parent_id": "t1_gxmv37b", "score": "1", "subreddit": "pornfree", "subreddit_id": "t5_2rglh"}, {"author": "MinimumCompetition85", "body": "Awesome! Now go for another day tomorrow!", "created_utc": "1620661980.0", "edited": "False", "id": "gxmcdjp", "is_submitter": "False", "link_id": "t3_n93bly", "parent_id": "t3_n93bly", "score": "25", "subreddit": "pornfree", "subreddit_id": "t5_2rglh"}, {"author": "MinimumCompetition85", "body": "Think about some accountability software such as covenanteyes. It will send a report via email containing all your visited websites once per week or so. Specify an email address of one of your friends or family members. Do you want them to see what kind of porn you are looking at? Maybe the possibility of embarrassing yourself in front of others would help you stay away from porn.", "created_utc": "1620593807.0", "edited": "False", "id": "gxjc4ut", "is_submitter": "False", "link_id": "t3_n8j3x2", "parent_id": "t3_n8j3x2", "score": "1", "subreddit": "pornfree", "subreddit_id": "t5_2rglh"}, {"author": "MinimumCompetition85", "body": "Yes, it is the same principle for productivity methods, such as the pomodoro technique, in which you want to make a task seem less intimidating. However, in the end, the whole task has to be completed, or in our case the goal is to quit porn for good. Like I said, I agree that the \"one day at a time\" approach can be very helpful. But I don't think that little \"challenges\" that go on forever, would be the right approach. It can be very helpful in the beginning stages, but at one point \"not watching\" porn should be your new normal and at a certain point, counting days and doing challenges should stop. I quit cigarettes years ago and in the beginning I was proud of the days/months being clean. But after several years, I don't even think about it anymore at all. I hope I made clear that I do partly agree with you :D", "created_utc": "1620579479.0", "edited": "False", "id": "gxiij5z", "is_submitter": "False", "link_id": "t3_n864yj", "parent_id": "t1_gxifen9", "score": "2", "subreddit": "pornfree", "subreddit_id": "t5_2rglh"}, {"author": "MinimumCompetition85", "body": "It is part of the process and I know it sucks, but you know that if you stick with it, you will be better off in the end. You are fighting your brain, that is trying EVERYTHING to make it look okay for you to watch porn again. How many people \"check\" if their dick is still working during flatline and then relapse and have to start all over again? Don't give in to these urges, I know you can do it!", "created_utc": "1620575356.0", "edited": "False", "id": "gxia6nb", "is_submitter": "False", "link_id": "t3_n897i1", "parent_id": "t1_gxhx4l1", "score": "1", "subreddit": "pornfree", "subreddit_id": "t5_2rglh"}, {"author": "MinimumCompetition85", "body": "Well, the goal in both cases is to quit porn entirely. It is just a slightly different way to look at it. The word \"quit\" implies, that there will be no more porn. If you just go for a certain number of days, you are merely taking a break. I agree that going one day at a time can be motivational, because you can celebrate small successes. The \"taking a break\" mindset however, will definitely lead to a relapse, because you are essentially allowing yourself to use it again at one point.", "created_utc": "1620575066.0", "edited": "False", "id": "gxi9lut", "is_submitter": "False", "link_id": "t3_n864yj", "parent_id": "t1_gxhxdqk", "score": "2", "subreddit": "pornfree", "subreddit_id": "t5_2rglh"}, {"author": "MinimumCompetition85", "body": "Porn won't make you feel any better. Keep going!", "created_utc": "1620568529.0", "edited": "False", "id": "gxhx07g", "is_submitter": "False", "link_id": "t3_n897i1", "parent_id": "t3_n897i1", "score": "1", "subreddit": "pornfree", "subreddit_id": "t5_2rglh"}, {"author": "MinimumCompetition85", "body": "Yes, because it is artificial sexual stimulation. Anything that is supposed to arouse you and that you can jerk off to, can be considered \"porn\".", "created_utc": "1620568459.0", "edited": "False", "id": "gxhwwbj", "is_submitter": "False", "link_id": "t3_n89n2n", "parent_id": "t3_n89n2n", "score": "7", "subreddit": "pornfree", "subreddit_id": "t5_2rglh"}, {"author": "MinimumCompetition85", "body": "I kinda disagree. It's like saying \"I won't smoke for 4 days\" or \"I won't smoke for a month\" What's the point in setting these timelines? Is it okay to watch porn after the four days are up? You have to make the decision to NEVER watch it again. Your brain will expect some kind of reward after those four days, which is just a recipe for relapses. Only trying to stay away from something you are addicted to for X days, is not how getting clean works.", "created_utc": "1620567511.0", "edited": "1620567756.0", "id": "gxhvdzq", "is_submitter": "False", "link_id": "t3_n864yj", "parent_id": "t1_gxhn5ui", "score": "2", "subreddit": "pornfree", "subreddit_id": "t5_2rglh"}, {"author": "MinimumCompetition85", "body": "What happens after the 4th day?", "created_utc": "1620548841.0", "edited": "False", "id": "gxh8tk4", "is_submitter": "False", "link_id": "t3_n864yj", "parent_id": "t3_n864yj", "score": "5", "subreddit": "pornfree", "subreddit_id": "t5_2rglh"}, {"author": "MinimumCompetition85", "body": "Way to go! Glad I could help!", "created_utc": "1620498734.0", "edited": "False", "id": "gxevuzz", "is_submitter": "False", "link_id": "t3_n6mjko", "parent_id": "t1_gxev9es", "score": "1", "subreddit": "pornfree", "subreddit_id": "t5_2rglh"}, {"author": "MinimumCompetition85", "body": "He even has a video where he gives an answer to someone who asked him how to quit porn", "created_utc": "1620488930.0", "edited": "False", "id": "gxebpu7", "is_submitter": "False", "link_id": "t3_n75vf6", "parent_id": "t1_gxbhejb", "score": "2", "subreddit": "pornfree", "subreddit_id": "t5_2rglh"}, {"author": "MinimumCompetition85", "body": "You want to say that burning cities down is not doing anything good? That's racist!!!\n\nDid I do it right?", "created_utc": "1620466667.0", "edited": "False", "id": "gxdeexj", "is_submitter": "False", "link_id": "t3_n75xqk", "parent_id": "t3_n75xqk", "score": "1", "subreddit": "Conservative", "subreddit_id": "t5_2qh6p"}, {"author": "MinimumCompetition85", "body": "Congratulations! Keep up the fight! I am also convinced that if you can beat something as horrible as porn addiction, beating all other small bad habits would be a piece of cake in comparison", "created_utc": "1620417855.0", "edited": "False", "id": "gxb986s", "is_submitter": "False", "link_id": "t3_n6ryl8", "parent_id": "t3_n6ryl8", "score": "1", "subreddit": "pornfree", "subreddit_id": "t5_2rglh"}, {"author": "MinimumCompetition85", "body": "Technology can be helpful but it cannot replace willpower, which is key to success. I can't tell you how many times I have installed porn blocking extensions to my browser only to deactivate them whenever I had urges. I think the only real option for you might be accountability software like covenanteyes which would send a report about the visited sites to an email address you specify (preferably from a friend or family member). The potential embarrassment of them seeing which sites you have visited, could help you stay away from them. And don't say 'until then'. You have to make the conscious decision to never watch porn again, otherwise you will ultimately set yourself up for failure.", "created_utc": "1620417571.0", "edited": "False", "id": "gxb8mej", "is_submitter": "False", "link_id": "t3_n6mjko", "parent_id": "t3_n6mjko", "score": "1", "subreddit": "pornfree", "subreddit_id": "t5_2rglh"}, {"author": "MinimumCompetition85", "body": "Good luck! Maybe plan ahead how you want to spend your time. Do something useful and also reward yourself with things that are good for you! You got this!", "created_utc": "1620404817.0", "edited": "False", "id": "gxag2by", "is_submitter": "False", "link_id": "t3_n6vifc", "parent_id": "t3_n6vifc", "score": "2", "subreddit": "pornfree", "subreddit_id": "t5_2rglh"}, {"author": "MinimumCompetition85", "body": "thanks for the heads-up! But that's a novel isn't it? I am more interested in his non-fiction books, maybe I should have clarified that!", "created_utc": "1620404677.0", "edited": "False", "id": "gxafq1n", "is_submitter": "True", "link_id": "t3_n70h9j", "parent_id": "t1_gxa5ace", "score": "1", "subreddit": "benshapiro", "subreddit_id": "t5_3779u"}, {"author": "MinimumCompetition85", "body": "I would say, you should ask yourself what kind of life you want to live. And also what people you want to surround yourself with. Aren't there many girls nowadays that like to game as well? Maybe you just need to find someone with similar interests.\n\nOne thing, that might have contributed to what you have experienced is, that if all you do is game and \"play\" and you don't take responsibility and don't get anywhere in life, that is what women find unattractive and what they might associate with \"passionate gamers\". In the end, no one wants to be with an immature guy that acts as if he's still in his teens. There is a time and place for everything in life and if you have your act together and game bit here and there, it will not affect you negatively. However, if it keeps you from pursuing your life goals, it might be time to focus on other things. Think about what it is you want to do in life. It is very easy to say \"gaming is my passion\" and use this as an excuse to game, since you are \"following your passion\". But maybe there is something more to life than that for you?", "created_utc": "1620403121.0", "edited": "False", "id": "gxac160", "is_submitter": "False", "link_id": "t3_n6zbb5", "parent_id": "t3_n6zbb5", "score": "2", "subreddit": "selfimprovement", "subreddit_id": "t5_2qmbm"}, {"author": "MinimumCompetition85", "body": "That seems mildly inappropriate for a political discussion", "created_utc": "1620400026.0", "edited": "False", "id": "gxa4s26", "is_submitter": "False", "link_id": "t3_n6ug54", "parent_id": "t3_n6ug54", "score": "1", "subreddit": "benshapiro", "subreddit_id": "t5_3779u"}, {"author": "MinimumCompetition85", "body": "I don't know how to answer the question. Will I pre-order it? Probably not. Will I read it later on? Most likely, yes :)", "created_utc": "1620399943.0", "edited": "False", "id": "gxa4l8z", "is_submitter": "False", "link_id": "t3_n6lu7j", "parent_id": "t3_n6lu7j", "score": "1", "subreddit": "benshapiro", "subreddit_id": "t5_3779u"}, {"author": "MinimumCompetition85", "body": "Whenever you look at something pornographic you are activating the same pathways in your brain and your dopamine receptors will respond to it. Is it a full relapse? Maybe, maybe not. In any way it could easily lead to a full-blown relapse because you allow yourself to do something that you actually wanted to stop doing. Let's say you tripped but didn't fall. Pay attention to your triggers and stay away from anything related to porn! You got this!", "created_utc": "1620374497.0", "edited": "False", "id": "gx91387", "is_submitter": "False", "link_id": "t3_n6mmj2", "parent_id": "t3_n6mmj2", "score": "1", "subreddit": "pornfree", "subreddit_id": "t5_2rglh"}, {"author": "MinimumCompetition85", "body": "Thank you! I relapsed yesterday but I am not giving up! :)", "created_utc": "1620371086.0", "edited": "False", "id": "gx8xaxs", "is_submitter": "False", "link_id": "t3_n6oew5", "parent_id": "t3_n6oew5", "score": "2", "subreddit": "pornfree", "subreddit_id": "t5_2rglh"}, {"author": "MinimumCompetition85", "body": "Absolutely!", "created_utc": "1620370935.0", "edited": "False", "id": "gx8x4ee", "is_submitter": "False", "link_id": "t3_n6p8i3", "parent_id": "t3_n6p8i3", "score": "3", "subreddit": "pornfree", "subreddit_id": "t5_2rglh"}, {"author": "MinimumCompetition85", "body": "Right! Enough is enough! The sooner I quit the longer I will be clean!", "created_utc": "1620339208.0", "edited": "False", "id": "gx7e6m6", "is_submitter": "False", "link_id": "t3_n6iol9", "parent_id": "t3_n6iol9", "score": "3", "subreddit": "pornfree", "subreddit_id": "t5_2rglh"}, {"author": "MinimumCompetition85", "body": "Check: About → Manage your Badge →Get a Badge", "created_utc": "1620338742.0", "edited": "False", "id": "gx7d5xa", "is_submitter": "True", "link_id": "t3_n6h6d8", "parent_id": "t1_gx7cvrq", "score": "1", "subreddit": "pornfree", "subreddit_id": "t5_2rglh"}, {"author": "MinimumCompetition85", "body": "My girlfriend is the same. She does not watch porn at all and we only watched it together maybe two or three times. A few days ago I told her about all the damage porn does to the brain, told her about dopamine etc. Well, the basics. And I told her that I really want to quit. Since she did not see it as an issue she was rather indifferent about it too. \n\nBut actually I think this is a good sign. It is a relief to know that I have not done that kind of damage to her. I see it as a self-improvement thing and honestly there were one or two times when I couldn't get it up, but she didn't know it was because of porn. I don't want it to get so bad that it would negatively impact our sex life to the point where she'd start complaining. \nThis is a battle I am fighting against myself and the damage it has done to my brain is enough motivation. I asked her that I wanted her to be supportive and now that she knows I am trying to quit I am happy that I can openly talk about it to her.\n \nDon't blame your girl for any kind of relapse. Don't think \"well she doesn't care so why should I?\" No! Wrong! You know exactly why you are quitting regardless of her being aware of the issue or not. Don't let your brain play tricks on you! You got this!", "created_utc": "1620337976.0", "edited": "False", "id": "gx7bfa6", "is_submitter": "False", "link_id": "t3_n6f17h", "parent_id": "t3_n6f17h", "score": "3", "subreddit": "pornfree", "subreddit_id": "t5_2rglh"}, {"author": "MinimumCompetition85", "body": "The most important part for me is to not beat myself up over a relapse. It is part of the process. If you fall, stand back up and keep going, down even look back. Try to identify your triggers better next time. Think about the relapse and what exactly caused the relapse. Try to be aware of these things and immediately change course the next time you experience something similar. I am back to Day 1 again too, so I feel that!", "created_utc": "1620334463.0", "edited": "False", "id": "gx736ox", "is_submitter": "False", "link_id": "t3_n6am1p", "parent_id": "t3_n6am1p", "score": "1", "subreddit": "pornfree", "subreddit_id": "t5_2rglh"}]