[{"author": "MinuteLibrarian", "body": "This is why I loved the little changes made to Georgiana’s personality in the 2005 version because her behavior implied that she had realized her brother must be in love with Lizzy because of how much he was talking about her.", "created_utc": "1665065427.0", "edited": "False", "id": "ira6wm9", "is_submitter": "False", "link_id": "t3_xwrmha", "parent_id": "t1_ir84a9u", "score": "21", "subreddit": "janeausten", "subreddit_id": "t5_2tgww"}, {"author": "MinuteLibrarian", "body": "It may not be outright illegal but isn’t it possible it’s against their specific employee code of conduct? The last place I worked specifically had a rule about managers in relationships with subordinates.", "created_utc": "1664417011.0", "edited": "False", "id": "iqbeydn", "is_submitter": "False", "link_id": "t3_xqd98n", "parent_id": "t1_iq9bjbi", "score": "2", "subreddit": "TheTryGuys", "subreddit_id": "t5_m1ld2"}, {"author": "MinuteLibrarian", "body": "I’m not saying that there’s definitely GOING to be a lawsuit, I’m only saying that any lawyer worth their salt would tell them to brace for POSSIBILITY of lawsuit. \n\nThe danger is not Ned suing. Ned suing is extremely unlikely. The danger is Alex or one of the other employees. This is why there are rules in the workplace about who is or is not allowed to date. Ned pursued a relationship with a subordinate. ANY superior/subordinate relationship is an abuse of power and a huge conflict of interest. It’s why managers are not allowed to date their employees, because if it goes sour it invites the possibility of all kinds of abuse of power/sexual harassment/hostile workplace environment lawsuits. \n\nNow I’m not saying that’s what’s going to happen. What I’m saying is that their company lawyers will have advised them to cover all bases in case that does happen. Because if it does, anything they’ve said online would go in as evidence. Even if a subordinate employee consents to a relationship or actively participates in a relationship with a superior, they STILL have grounds to sue and would have the upper hand if they did decide to sue. At that point the company might have to prove that no abuse of power occurred, and that at no point did Alex feel like she was coerced to enter or stay in the relationship because she feared for her job security. It’s just all very sticky. It’s a hot hot mess and the mere POSSIBILITY of it getting litigious puts the company in danger. I don’t think anyone can confidently say yes they’re going to court over this. I’m only saying that they’re being very careful JUST IN CASE because if they do go to court and they haven’t taken precautions, it can get really ugly for them really fast. \n\nThis is also why Ned would likely have no ground to stand on in terms of suing the other guys for kicking him out. His behavior has risked the company and the brand. Standard contracts for companies like this usually include a clause that would say something like unethical behavior that puts the company at risk is grounds for an owner to forfeit their share.", "created_utc": "1664397273.0", "edited": "1664398113.0", "id": "iqa6ije", "is_submitter": "False", "link_id": "t3_xqgqrp", "parent_id": "t1_iq9xyd6", "score": "1", "subreddit": "TheTryGuys", "subreddit_id": "t5_m1ld2"}, {"author": "MinuteLibrarian", "body": "I think if we do get any details about the situation it’ll be a long time from now. I’m also just hoping for the best for the people involved :/", "created_utc": "1664387873.0", "edited": "False", "id": "iq9ie14", "is_submitter": "False", "link_id": "t3_xqhoho", "parent_id": "t1_iq9h9bp", "score": "3", "subreddit": "TheTryGuys", "subreddit_id": "t5_m1ld2"}, {"author": "MinuteLibrarian", "body": "They will not be addressing anything except to rehash what they said in their original statement. The reason for this is because their company is bracing for the possibility of a lawsuit. There are probably lawyers involved because Ned having a relationship with a subordinate puts the company in hot water. It’s a huge legal risk. So the guys have to be very careful what they say online. If they do address it, it’ll be a rehash of their Instagram statement.", "created_utc": "1664387074.0", "edited": "False", "id": "iq9gc62", "is_submitter": "False", "link_id": "t3_xqgfqp", "parent_id": "t3_xqgfqp", "score": "2", "subreddit": "TheTryGuys", "subreddit_id": "t5_m1ld2"}, {"author": "MinuteLibrarian", "body": "There’s no way they’re recording something about this situation. I doubt they’ll mention anything at all about it going forward. There is a possibility their company will be involved in a lawsuit. As long as that remains a possibility, they have to be very careful about what they put online regarding this situation. \n\nIf I had to make bets, I would say we’re not getting any more details for a long time.\n\nThere are lawyers involved here guys. It’s not just Internet cheating drama. Ned’s behavior has put the entire company in hot water.", "created_utc": "1664386879.0", "edited": "False", "id": "iq9ftoc", "is_submitter": "False", "link_id": "t3_xqgqrp", "parent_id": "t3_xqgqrp", "score": "5", "subreddit": "TheTryGuys", "subreddit_id": "t5_m1ld2"}, {"author": "MinuteLibrarian", "body": "I hope for nothing but healing and happiness for Ariel and the kids. \n\nAs far as Ned’s statement, I’m literally not reading into it in any way. I’m almost certain he had to draft that statement with the help of lawyers so everything he says is going to be vetted and censored before it’s put in public.", "created_utc": "1664386742.0", "edited": "False", "id": "iq9fg2u", "is_submitter": "False", "link_id": "t3_xqhoho", "parent_id": "t1_iq9f3r4", "score": "3", "subreddit": "TheTryGuys", "subreddit_id": "t5_m1ld2"}, {"author": "MinuteLibrarian", "body": "Ned’s statement was almost certainly drafted by lawyers. This situation is VERY sticky legal-wise. Even if he wanted to release a gushing tell-all apology he could not.\n\nThe harm he’s caused his company and his employees are precisely why he can’t release any statement that isn’t cut and dry. If this gets litigious, anything he’s said online goes to court with them. \n\nThe harm he’s caused his family he will have to make amends for in private. As upset as we all are about Ned’s behavior, we are not entitled to know details about how their family is dealing with this.", "created_utc": "1664386324.0", "edited": "False", "id": "iq9edcw", "is_submitter": "False", "link_id": "t3_xqhoho", "parent_id": "t1_iq9d2am", "score": "8", "subreddit": "TheTryGuys", "subreddit_id": "t5_m1ld2"}, {"author": "MinuteLibrarian", "body": "Whether or not this is true, I would NOT read into Ned’s Instagram statement. I would bet real money that statement was drafted by lawyers. It’s not meant to be an apology that proves to his fans how sorry he is. It’s a statement that doesn’t say too much or too little just in case this gets litigious and that statement is taken to court along with anything else officially released by the try guys. \n\nWe’re not gonna get any details about the situation or ned’s remorse (or lack of) for a long time. Their company is still bracing for possibility of lawsuit.", "created_utc": "1664386173.0", "edited": "False", "id": "iq9dzk6", "is_submitter": "False", "link_id": "t3_xqhoho", "parent_id": "t3_xqhoho", "score": "20", "subreddit": "TheTryGuys", "subreddit_id": "t5_m1ld2"}, {"author": "MinuteLibrarian", "body": "I think he’s also independently wealthy, like I’m pretty sure his family is rich.", "created_utc": "1664385630.0", "edited": "False", "id": "iq9ckbi", "is_submitter": "False", "link_id": "t3_xqd98n", "parent_id": "t1_iq95usa", "score": "5", "subreddit": "TheTryGuys", "subreddit_id": "t5_m1ld2"}, {"author": "MinuteLibrarian", "body": "That’s possible but idk that I would bet on that. They left buzzfeed to form this company, they all worked in entertainment before that, they had a huge following when they left, and at least one of the members (Ned) is independently wealthy. These are all factors that tell me it’s likely they were careful about the legal stuff from the beginning.", "created_utc": "1664385134.0", "edited": "False", "id": "iq9b9rt", "is_submitter": "False", "link_id": "t3_xqd98n", "parent_id": "t1_iq968be", "score": "3", "subreddit": "TheTryGuys", "subreddit_id": "t5_m1ld2"}, {"author": "MinuteLibrarian", "body": "EXACTLY yes!! I’m seeing a lot of “isn’t it his personal business” or “why didn’t they fire her for the same thing” \n\nIt’s not the cheating, it’s the abuse of power that is a fireable offense.", "created_utc": "1664377527.0", "edited": "False", "id": "iq8rvr8", "is_submitter": "False", "link_id": "t3_xqd98n", "parent_id": "t1_iq8rmjx", "score": "17", "subreddit": "TheTryGuys", "subreddit_id": "t5_m1ld2"}, {"author": "MinuteLibrarian", "body": "No I highly doubt this. I don’t think people realize how huge this is. His behavior has put the entire company at risk. It’s more than just cheating on a spouse. Engaging in a relationship with a subordinate could potentially open the company up to an employee lawsuit. \n\nThe way the try guys’ and ned’s statements are worded tells me there are almost certainly lawyers involved. That’s why we won’t be hearing any more official statements for a while. They’re literally braced for the possibility of a lawsuit. This is also why they can’t fire/unfollow Alex because any sign of retaliation on their part could be used against them if this goes to court. This is also why I think Ned’s statement specifically mentions a “consensual relationship”. If an employee decides to sue for abuse of some kind, this statement will be part of evidence. There’s no way Ned wrote that statement, at least not alone. Their lawyers would have helped him draft that because if they go to court this is all evidence. \n\nThis is really serious guys. Ned wasn’t fired just for cheating on his wife. As part-owner, the way he’s conducted himself has the potential to destroy the entire try guys brand. There is absolutely no way he’ll still be involved. Most likely their contract included a clause for owners that would state something like an owner engaging in unethical behavior/behavior that puts the brand or company at risk would forfeit their share.\n\nEdit: even if their contract wouldn’t require Ned to forfeit his share, it’s likely he’ll cooperate in terms of redistributing company ownership because I’m pretty sure he’s gonna try to cover his ass. If he doesn’t cooperate it’s gonna be a really bad look for him so idk that he wants to take more hits to public image and further risk his relationship with his family by being a dick.\n\nEdit edit: I’m not lawyer or an expert, this is just info I’ve picked up from other people talking about this situation who know more about workplace procedures. But it’s pretty clear to me this whole thing is covered in lawyers.", "created_utc": "1664375585.0", "edited": "1664377311.0", "id": "iq8n3na", "is_submitter": "False", "link_id": "t3_xqd98n", "parent_id": "t3_xqd98n", "score": "94", "subreddit": "TheTryGuys", "subreddit_id": "t5_m1ld2"}, {"author": "MinuteLibrarian", "body": "This isn’t necessarily true. It’s possible their contract includes a clause that any partial owner engaging in unethical behavior/behavior that puts the company at risk would forfeit their share. \n\nI don’t think people realize how big this is. There are most likely ALREADY lawyers involved. Ned’s behavior toward a subordinate can open them up to lawsuits. Their statement about an “internal review” and Ned’s statement pointedly mentioning a “CONSENSUAL” relationship tells me there are lawyers involved.", "created_utc": "1664374966.0", "edited": "False", "id": "iq8lm4s", "is_submitter": "False", "link_id": "t3_xqd98n", "parent_id": "t1_iq8jr4v", "score": "19", "subreddit": "TheTryGuys", "subreddit_id": "t5_m1ld2"}, {"author": "MinuteLibrarian", "body": "I’m sure others may disagree (and I’m fine with the idea of containing it in a thread if that is the case!!) but honestly I personally don’t see how filming news could really be considered spoilers??", "created_utc": "1664040973.0", "edited": "False", "id": "ipqnop9", "is_submitter": "False", "link_id": "t3_xmy70o", "parent_id": "t3_xmy70o", "score": "8", "subreddit": "OurFlagMeansDeath", "subreddit_id": "t5_4xhkam"}, {"author": "MinuteLibrarian", "body": "As far as I know the theory that it’s best to use complete immersion has been debunked. It’s absolutely helpful, especially in the beginning, to lean on a language you already know. It helps your brain process things.", "created_utc": "1663858775.0", "edited": "False", "id": "iph5e8m", "is_submitter": "False", "link_id": "t3_xl3khe", "parent_id": "t3_xl3khe", "score": "93", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "MinuteLibrarian", "body": "On ao3, filter blackbeard/izzy in relationships and look in additional tags for daddy kink and GUARANTEED they’ll be there", "created_utc": "1663711024.0", "edited": "False", "id": "ip92rs8", "is_submitter": "False", "link_id": "t3_xjhvl7", "parent_id": "t3_xjhvl7", "score": "26", "subreddit": "OurFlagMeansDeath", "subreddit_id": "t5_4xhkam"}, {"author": "MinuteLibrarian", "body": "When reading JA and especially with books like P&P and Northanger Abbey my biggest advice is to remember that these books have a significant satirical tone. Because the language used feels outdated, it’s easy to miss the way these books are LOADED with humor and sarcasm. My advice would be to stick it out for a little while to get used to the way she writes because it’ll take some adjusting. After all, we don’t really talk like that anymore. While you’re doing this I urge you to actively look for the humor in what she’s writing. Her narrative voice makes a lot of snide, sarcastic, and clever commentary as she tells the story and once you catch on the books are way more fun to read. \n\nWhat also might help is watching an adaptation just to get an idea of what happens in the story so you know what to pay attention to as you read. Otherwise it might feel like an overwhelming amount of info and detail and you’re not sure what to follow or what’s going on.", "created_utc": "1663190247.0", "edited": "False", "id": "iog5w20", "is_submitter": "False", "link_id": "t3_xeb62n", "parent_id": "t3_xeb62n", "score": "8", "subreddit": "janeausten", "subreddit_id": "t5_2tgww"}, {"author": "MinuteLibrarian", "body": "I think OP meant 5 days every week, not just 5 days total.", "created_utc": "1662796326.0", "edited": "False", "id": "intxwod", "is_submitter": "False", "link_id": "t3_xaj5hx", "parent_id": "t1_intxh8t", "score": "10", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "MinuteLibrarian", "body": "English has SO many words, much more than most languages. I am a native English speaker and studied English in university and I still learn new words. It’s very very normal. \n\nLike for example, the word you learned “inundate” is a word I didn’t start using until fairly recently and it’s not necessarily a commonly used word. I also didn’t know the word mattock and I doubt most people do. English is so rich with words that any English speaker, native or otherwise, will likely be learning English words their whole lives.", "created_utc": "1661453910.0", "edited": "False", "id": "ilrqtzl", "is_submitter": "False", "link_id": "t3_wxl9zx", "parent_id": "t3_wxl9zx", "score": "8", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "MinuteLibrarian", "body": "“Injurious courtesy” is giving the vibe of “backhanded compliment” \n\nDoes that seem right? That’s how I’m understanding it 😅", "created_utc": "1661033674.0", "edited": "False", "id": "il4cg2d", "is_submitter": "False", "link_id": "t3_wtdhfz", "parent_id": "t1_il3w6qm", "score": "7", "subreddit": "janeausten", "subreddit_id": "t5_2tgww"}, {"author": "MinuteLibrarian", "body": "Love the 1995 movie but the 2008 adaptation is also excellent. I would recommend both, they do the book justice in different ways.", "created_utc": "1660290809.0", "edited": "False", "id": "ijyvfqz", "is_submitter": "False", "link_id": "t3_wmai4j", "parent_id": "t3_wmai4j", "score": "8", "subreddit": "janeausten", "subreddit_id": "t5_2tgww"}, {"author": "MinuteLibrarian", "body": "“Miss Bingley was left to all the satisfaction of having forced him to say what gave no one any pain but herself.” \n\nSuch a satisfying moment as a reader!!!", "created_utc": "1660067338.0", "edited": "False", "id": "ijlwucx", "is_submitter": "False", "link_id": "t3_wk4to1", "parent_id": "t1_ijlna92", "score": "32", "subreddit": "janeausten", "subreddit_id": "t5_2tgww"}, {"author": "MinuteLibrarian", "body": "Classic narcissist. Jane Austen understood people WAY too well 😂", "created_utc": "1660067189.0", "edited": "False", "id": "ijlwfzk", "is_submitter": "False", "link_id": "t3_wk4to1", "parent_id": "t1_ijle94k", "score": "13", "subreddit": "janeausten", "subreddit_id": "t5_2tgww"}, {"author": "MinuteLibrarian", "body": "I love love love both versions!! I watch the 1995 when I want something that feels exactly like the book. 2005 is what I grew up with so I do have some nostalgia but I also love how it captures the *vibe* of pride and prejudice while still taking some liberties as an adaptation. One of my favorite things about it is all the extra chaos they add to the Bennet family like the listening at doors, the bickering and bargains (between ALL the siblings, not just Kitty and Lydia) or the scene where Bingley shows up unexpectedly and they have to clean up the drawing room in record time and everyone picks up sewing and books like “ah yes this is what we always do at home I swear”. \n\nI also appreciate some of the different perspectives on the characters. Like the 2005 Mr. Collins and the 1995 Mr. Collins are pretty different but wow are they both excellent pictures of Mr. Collins. Likewise with Darcy!! I think Firth is still probably the more accurate Darcy, but I just LOVE how uncomfortable MacFayden looks in every single scene. It really adds some credit to Darcy’s claim of not being socially adept. It’s also just a beautiful film, and the way it’s made adds a lot to the tension of growing romance between Darcy and Elizabeth. It’s a great adaptation I think and honestly I also get a little frustrated with people who say 1995 is the only one worth watching because I think it’s unfair. 1995 is certainly more accurate to the book, but 2005 does an excellent job at interpreting and adapting the source material.", "created_utc": "1659551756.0", "edited": "False", "id": "iitd4bs", "is_submitter": "False", "link_id": "t3_wfdlq9", "parent_id": "t3_wfdlq9", "score": "20", "subreddit": "janeausten", "subreddit_id": "t5_2tgww"}, {"author": "MinuteLibrarian", "body": "What about the fact that they’re both just weird??? Each of their crews think they’re both insane. And they are both weird af extremely unorthodox people. Stede is the first person who doesn’t question Ed’s quirks because he is also weird!!! And vice versa! Everyone thinks Stede’s collection on the ship is bizarre and they ridicule him for it. But Ed is just fascinated because he thinks Stede is unique. They’re kindred spirits in that regard. “Wanna do something weird??” Yes, at all times they would both like to do something weird, no questions asked.", "created_utc": "1659539797.0", "edited": "False", "id": "iisi934", "is_submitter": "False", "link_id": "t3_weyodz", "parent_id": "t3_weyodz", "score": "16", "subreddit": "OurFlagMeansDeath", "subreddit_id": "t5_4xhkam"}, {"author": "MinuteLibrarian", "body": "I’ll be honest lmao I don’t even know the names of the grammar tenses in English which is my native language and also what I majored in 😂 so I don’t think I’m gonna bother learning them in Spanish unless I have to. It’s all about context for me.", "created_utc": "1659250923.0", "edited": "False", "id": "iicskrd", "is_submitter": "False", "link_id": "t3_wchjby", "parent_id": "t3_wchjby", "score": "12", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "MinuteLibrarian", "body": "I’ve also gotten halfway through Emma twice and haven’t finished yet 😅 I can’t tell if it’s the more satirical tone of Emma that’s putting me off. I think I enjoy the more earnest Austen novels. I’m sure I’ll finish it eventually and will surely love it but I doubt it’ll end up my favorite one.", "created_utc": "1658992276.0", "edited": "False", "id": "ihymwm4", "is_submitter": "False", "link_id": "t3_wa1v9x", "parent_id": "t3_wa1v9x", "score": "7", "subreddit": "janeausten", "subreddit_id": "t5_2tgww"}, {"author": "MinuteLibrarian", "body": "I think that one is 2007, which honestly is a pretty good adaptation IMO. I watched that one for years before ever seeing the 1995 version.", "created_utc": "1658930733.0", "edited": "False", "id": "ihuq9ts", "is_submitter": "False", "link_id": "t3_w93u3j", "parent_id": "t3_w93u3j", "score": "9", "subreddit": "janeausten", "subreddit_id": "t5_2tgww"}, {"author": "MinuteLibrarian", "body": "Grew up speaking Armenian and around age 3 starting picking up English. Genuinely never really thought about the differences in language structure until I started learning Spanish in school at age 13/14", "created_utc": "1658259063.0", "edited": "False", "id": "igthr3g", "is_submitter": "False", "link_id": "t3_w2ukfi", "parent_id": "t3_w2ukfi", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "MinuteLibrarian", "body": "If you don’t really want to study a language, the odds of you mastering it are low. Language learning is hard and you will likely quit if you’re not enjoying what you’re learning. IMO, the utility of a language is usually not a good enough motivator. Spanish being theoretically useful to you in the future is not gonna help you much in learning it. And unless you’re planning on moving to a Spanish-speaking country you can do without it. I would recommend you stick with what you actually want to learn :)", "created_utc": "1657955146.0", "edited": "False", "id": "igd8bdj", "is_submitter": "False", "link_id": "t3_w04wlr", "parent_id": "t3_w04wlr", "score": "6", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "MinuteLibrarian", "body": "The reason I think focusing on accent is important is because it improves your listening besides improving your speaking. A large part of the reason many people have an accent and cannot pronounce certain sounds in their target language correctly is because they’re literally not hearing the sounds correctly. If you’re not used to a sound in a word your brain will literally filter it through whatever similar sound you are used to hearing and capable of making. Spending time parsing through those sounds in a language will improve your skill. \n\nThat said, I agree that trying to make your accent perfect is unnecessary. But to ignore accent entirely is also a mistake. You should do it as well as you can and try to improve but it’s fine if you know you’ll never sound like a native speaker despite your skill in a language.", "created_utc": "1657949280.0", "edited": "False", "id": "igczs8r", "is_submitter": "False", "link_id": "t3_w02tzh", "parent_id": "t3_w02tzh", "score": "9", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "MinuteLibrarian", "body": "Indeed, which is very 💅🏻 of him if you ask me", "created_utc": "1657766374.0", "edited": "False", "id": "ig2trm0", "is_submitter": "False", "link_id": "t3_vyhx00", "parent_id": "t1_ig2o8si", "score": "30", "subreddit": "OurFlagMeansDeath", "subreddit_id": "t5_4xhkam"}, {"author": "MinuteLibrarian", "body": "Bingo", "created_utc": "1657762656.0", "edited": "False", "id": "ig2lq8y", "is_submitter": "False", "link_id": "t3_vyhx00", "parent_id": "t1_ig2edr5", "score": "11", "subreddit": "OurFlagMeansDeath", "subreddit_id": "t5_4xhkam"}, {"author": "MinuteLibrarian", "body": "The fact that Izzy goes absolutely raving batshit anytime someone else calls Blackbeard “Ed” or “Edward” but he virtually never calls him Blackbeard to his face and almost always calls him “Edward”. Lot to unpack there methinks 👀👀👀", "created_utc": "1657757586.0", "edited": "1657762674.0", "id": "ig2abgd", "is_submitter": "False", "link_id": "t3_vyhx00", "parent_id": "t3_vyhx00", "score": "102", "subreddit": "OurFlagMeansDeath", "subreddit_id": "t5_4xhkam"}, {"author": "MinuteLibrarian", "body": "We used it until she was probably 8 months or so?? Maybe longer. When we first got her, I got the shortest height pen because I also wasn’t sure how long we’d need it. She figured out how to climb over it in a matter of weeks. I just got the tallest one after that 😅", "created_utc": "1657720719.0", "edited": "False", "id": "ifzq94b", "is_submitter": "False", "link_id": "t3_vxtz61", "parent_id": "t3_vxtz61", "score": "2", "subreddit": "puppy101", "subreddit_id": "t5_2rw7o"}, {"author": "MinuteLibrarian", "body": "The biggest harm GATE did to me was teaching me that accomplishment mattered above all things. When I reached middle school and my head start began to run out, I had never learned how to study, how to deal with bad grades, how to get over mistakes, how to actually learn something little by little and get better at it. Accomplishment was expected of me. Now in my 20s is when I’m just starting to learn what it is to learn little by little and celebrate mistakes as opportunities to learn. I’m just learning that just because I could push myself to the limit to produce accomplished work, that this was severely unhealthy for me. I’ve had to slow down a lot over the years. \n\nCelebrate her effort and her learning way more often than her accomplishment. As she grows up, make sure she knows accomplishment is not tied to her self worth, and that she knows how to stop when she needs a break. My parents only praised me when I was performing at top levels in school. It would’ve been way more beneficial to me if they had instead taken an interest in my hobbies, cultivated my confidence in trying new things, and guided me through hardships when I was struggling keeping up with homework because it was just impossible to do sometimes. \n\nIt’s very likely she’ll need more rest and more recharge time than other kids. If this need isn’t respected, she’ll be burned out by the time she’s in high school. Her recharge time, habits, self-worth, and interest in learning should far far FAR outweigh her accomplishments, her grades, her test scores. Don’t be concerned with her “living up to her potential.” she’ll decide what her potential is when she’s old enough.", "created_utc": "1657672205.0", "edited": "False", "id": "ifxgzos", "is_submitter": "False", "link_id": "t3_vxfq0s", "parent_id": "t3_vxfq0s", "score": "2", "subreddit": "ADHD", "subreddit_id": "t5_2qnwb"}, {"author": "MinuteLibrarian", "body": "She won’t watch any TV unless it’s BTS. she likes Jin.", "created_utc": "1657561719.0", "edited": "False", "id": "ifqzhxl", "is_submitter": "False", "link_id": "t3_vwdj1o", "parent_id": "t3_vwdj1o", "score": "1", "subreddit": "puppy101", "subreddit_id": "t5_2rw7o"}, {"author": "MinuteLibrarian", "body": "Gay pirate brain rot is terminal I’m afraid", "created_utc": "1657561548.0", "edited": "False", "id": "ifqz284", "is_submitter": "False", "link_id": "t3_vwl0kp", "parent_id": "t3_vwl0kp", "score": "12", "subreddit": "OurFlagMeansDeath", "subreddit_id": "t5_4xhkam"}, {"author": "MinuteLibrarian", "body": "Puppy will most likely be totally fine!!! Vets recommend the 16 weeks to be completely safe, but if you speak to socialization experts they say the opposite that the risk of waiting till 16 weeks to socialize your dog outweighs the risk of illness. I did end up waiting the 16 weeks myself, but if I could do it again I would definitely start taking my puppy out earlier. They have a lot of immunity even after only the 2nd round of shots. I think you’ll be okay :)", "created_utc": "1657523159.0", "edited": "False", "id": "ifp0y7l", "is_submitter": "False", "link_id": "t3_vw8g3x", "parent_id": "t3_vw8g3x", "score": "4", "subreddit": "puppy101", "subreddit_id": "t5_2rw7o"}, {"author": "MinuteLibrarian", "body": "Honestly, I’m not too worried about the resolution of their relationship. Years of being queerbaited and watching horrible shit happen to queer couples on tv has literally traumatized me and I had to remind myself that this show is a COMEDY where almost nothing bad happens. Plenty of bad things THREATEN to happen and then they’re resolved easily and quickly. The show is actually really low-stakes when you think about it. \n\nThe other thing is that David Jenkins and the crew are determined to creat something positive for queer rep. So I really think it’ll be okay.", "created_utc": "1657471467.0", "edited": "False", "id": "ifm3x0r", "is_submitter": "False", "link_id": "t3_vvnpn1", "parent_id": "t3_vvnpn1", "score": "15", "subreddit": "OurFlagMeansDeath", "subreddit_id": "t5_4xhkam"}, {"author": "MinuteLibrarian", "body": "Yes yes yes this is EXACTLY how it was with my GSD. There was a point where I did two different private training classes with her and both trainers remarked that she was an ANGEL they were like “wow she’s a dream to work with you have the perfect dog she’s amazing” \n\nIf I hadn’t witnessed her good behavior myself during those sessions I would’ve accused them of lying to me for a buck. I couldn’t believe it considering what a nightmare she was with me when no trainers were present. For everyone else, she was the most beautiful, the most friendly, the most trainable dog and to me she was possessed by demons. \n\nIt really does get so much better after one year. Mine is 2 now and she’s such a chill and manageable dog, if I didn’t have vivid trauma memories of her nightmare days as a puppy it would be hard for even me to believe that she’s the same dog. Hang in there!! The payoff with GSDs is unbelievable. These days, mine is happy to just lounge around the house all day and cuddle on the couch 😂", "created_utc": "1657465706.0", "edited": "False", "id": "iflqkmf", "is_submitter": "False", "link_id": "t3_vvgbe4", "parent_id": "t1_ifl66n7", "score": "5", "subreddit": "puppy101", "subreddit_id": "t5_2rw7o"}, {"author": "MinuteLibrarian", "body": "We did tether training, but since she was a TERRIBLE biter I couldn’t tether her to me with a leash so I tethered her nearby to a beam or table leg or something. Worked wonders for the potty training, the biting, and the housebreaking.", "created_utc": "1657434714.0", "edited": "False", "id": "ifkgfxb", "is_submitter": "False", "link_id": "t3_vvas4v", "parent_id": "t3_vvas4v", "score": "1", "subreddit": "puppy101", "subreddit_id": "t5_2rw7o"}, {"author": "MinuteLibrarian", "body": "Oh my god this was literally me!! After a couple of weeks I made her sleep in the living room just to get away from her. It gets better I swear 😅😅", "created_utc": "1657420328.0", "edited": "False", "id": "ifjsven", "is_submitter": "False", "link_id": "t3_vvgbe4", "parent_id": "t1_ifjq7zq", "score": "15", "subreddit": "puppy101", "subreddit_id": "t5_2rw7o"}, {"author": "MinuteLibrarian", "body": "It gets SO abruptly better around the one year mark. Believe me when I say I thought I would never get there it really felt like my puppy was sent by the devil himself to test me. Hang in there 😂😂", "created_utc": "1657420277.0", "edited": "False", "id": "ifjsrva", "is_submitter": "False", "link_id": "t3_vvgbe4", "parent_id": "t1_ifjrfeh", "score": "24", "subreddit": "puppy101", "subreddit_id": "t5_2rw7o"}, {"author": "MinuteLibrarian", "body": "I would never admit this to anyone IRL but I swear I didn’t really love my dog until she was like a year old. She was just such a demon 😂", "created_utc": "1657417789.0", "edited": "False", "id": "ifjny6t", "is_submitter": "False", "link_id": "t3_vvgbe4", "parent_id": "t3_vvgbe4", "score": "111", "subreddit": "puppy101", "subreddit_id": "t5_2rw7o"}, {"author": "MinuteLibrarian", "body": "This is so so normal!! Puppies are akin to infants and have no understanding whatsoever and an extremely low tolerance for frustration. Much like a baby’s first instinct is to scream if they are frustrated, a puppy’s first instinct will be to bite. \n\nMy puppy growled and lunged and bit SO often that I was also concerned she might have an aggression problem. In hindsight, this fear seems ridiculous to me now. Puppies are very very very rarely innately aggressive. Dogs who grow up to be aggressive usually suffered serious issues as puppies. \n\nSo to answer your question, no I don’t think there’s anything special you have to do! Be patient with your pup and you’ll start to notice when she’s over her frustration threshold. As she gets older, she’ll understand biting hurts you and it’ll no longer be the first thing she turns to when she’s frustrated. I don’t think you have anything to worry about :)", "created_utc": "1657398337.0", "edited": "False", "id": "ifijayg", "is_submitter": "False", "link_id": "t3_vv8wn6", "parent_id": "t3_vv8wn6", "score": "1", "subreddit": "puppy101", "subreddit_id": "t5_2rw7o"}, {"author": "MinuteLibrarian", "body": "I feel this sometimes and I swear I think it’s my brain screaming for dopamine. I usually make myself do an activity just to prove to myself that I can still move. Yesterday I just did some quick art because I knew when I was finished I’d feel accomplished and that’s a source of dopamine.", "created_utc": "1657397717.0", "edited": "False", "id": "ifihwt7", "is_submitter": "False", "link_id": "t3_vv9ur9", "parent_id": "t3_vv9ur9", "score": "4", "subreddit": "ADHD", "subreddit_id": "t5_2qnwb"}, {"author": "MinuteLibrarian", "body": "This is something I used to say all the time back when I suspected I was bisexual but didn’t feel the need to label myself", "created_utc": "1657390474.0", "edited": "False", "id": "ifi1tta", "is_submitter": "False", "link_id": "t3_vur5jc", "parent_id": "t3_vur5jc", "score": "9", "subreddit": "OurFlagMeansDeath", "subreddit_id": "t5_4xhkam"}, {"author": "MinuteLibrarian", "body": "I’m crying lmao I’ve been thinking about his Leo placements a lot with his recent comments 😂😂", "created_utc": "1657390278.0", "edited": "False", "id": "ifi1e7i", "is_submitter": "False", "link_id": "t3_vur5jc", "parent_id": "t1_ifhpa9n", "score": "4", "subreddit": "OurFlagMeansDeath", "subreddit_id": "t5_4xhkam"}, {"author": "MinuteLibrarian", "body": "I bag every time, we reuse produce bags from the grocery store", "created_utc": "1657318662.0", "edited": "False", "id": "ifehk07", "is_submitter": "False", "link_id": "t3_vuc4n7", "parent_id": "t3_vuc4n7", "score": "1", "subreddit": "puppy101", "subreddit_id": "t5_2rw7o"}, {"author": "MinuteLibrarian", "body": "Hit me at 5 months and lasted till she was like 1.5. But she mellowed out a little around the 1 year mark and now at 2 is such a chill and manageable dog. I honestly wouldn’t have believed it in her puppyhood. She seemed possessed by demons and sent by the devil himself to kill me. Literally never thought I’d be free of the horrors of puppyhood. Hang in there and remember no one knows your dog better than you!!", "created_utc": "1657305323.0", "edited": "False", "id": "ifdl5fn", "is_submitter": "False", "link_id": "t3_vue94k", "parent_id": "t3_vue94k", "score": "5", "subreddit": "puppy101", "subreddit_id": "t5_2rw7o"}, {"author": "MinuteLibrarian", "body": "Surprised at all the no’s. It’s a yes from me.", "created_utc": "1657300406.0", "edited": "False", "id": "ifd8nlp", "is_submitter": "False", "link_id": "t3_vu7nft", "parent_id": "t3_vu7nft", "score": "3", "subreddit": "OurFlagMeansDeath", "subreddit_id": "t5_4xhkam"}, {"author": "MinuteLibrarian", "body": "It’s actually hilarious to me because like we know Taika actively forgets what characters he himself has played in movies so of course he would forget Natalie was Padme 😂😂😂", "created_utc": "1657264659.0", "edited": "False", "id": "ifbdyxr", "is_submitter": "False", "link_id": "t3_vu3dlm", "parent_id": "t3_vu3dlm", "score": "30", "subreddit": "OurFlagMeansDeath", "subreddit_id": "t5_4xhkam"}, {"author": "MinuteLibrarian", "body": "YES EXACTLY!! Stede shows Ed a way to be his authentic self without having to channel his energy into horrible shit. God I love them.", "created_utc": "1657031171.0", "edited": "False", "id": "iey24p2", "is_submitter": "False", "link_id": "t3_vrastx", "parent_id": "t1_iexwy2c", "score": "3", "subreddit": "OurFlagMeansDeath", "subreddit_id": "t5_4xhkam"}, {"author": "MinuteLibrarian", "body": "Definitely the space to be vulnerable but I think what first attracts Ed to Stede is the fact that he’s bizarre and surprising. They share a love language of “hey wanna do something weird”. Stede is the only person who matches Ed’s chaotic energy without ever questioning anything. Everyone else just thinks they’re both insane.", "created_utc": "1656956186.0", "edited": "False", "id": "ieubvua", "is_submitter": "False", "link_id": "t3_vrastx", "parent_id": "t3_vrastx", "score": "33", "subreddit": "OurFlagMeansDeath", "subreddit_id": "t5_4xhkam"}, {"author": "MinuteLibrarian", "body": "That is so so cool!! I wish you luck. I’m so glad I stumbled on this post :)", "created_utc": "1656872459.0", "edited": "False", "id": "ieq4ek5", "is_submitter": "False", "link_id": "t3_vqgct8", "parent_id": "t1_ieq3ngk", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "MinuteLibrarian", "body": "It is genuinely so cool that your grandpa learned Armenian just because he thought it was interesting. Do you know if he spoke western or eastern? If you’re thinking about moving to or visiting Armenia, I would recommend studying eastern since that’s what’s spoken in Armenia itself. Western and Eastern Armenian are mutually intelligible to native speakers, but they have some different vocabulary and grammar structure so for someone who is learning, I think it’s best to focus on one of them. \n\nI’m so so glad you asked about learning Armenian. I guess I don’t know the context of whoever said people who speak the language may not want others to learn but I’m happy to tell you I can VERY confidently say this is not at all the case for Armenians. I have never in my life met an Armenian who was anything but WILDLY impressed that a foreigner would want to learn about the language or culture. Actually Armenians find it very flattering when people take an interest in our culture and very impressive when people try to learn the language. I can’t tell you how often YouTube videos or interviews of foreigners speaking Armenian are circulated among the Armenian community with comments like “look how amazing this is this person can speak Armenian????” \n\nHonestly, since Armenian culture was once at threat of being wiped out, Armenians are obsessed with preservation of our culture so that’s why we’re so flattered when other people take an interest. We’re not used to people caring. \n\nSo yeah definitely I think it’s awesome for people to try to learn Armenian. Since it is an uncommon language, I’ve often thought about how that means there are fewer resources to learn it. This has been frustrating for me too because while I am a native speaker, I was born and educated in the US so my English is much stronger than my Armenian. I’ve been wanting to improve my Armenian for a while, so it’s easy to notice how few resources there are especially for people who have no background in the language. With more people taking an interest in Armenian, more resources will become available and that to me is amazing!", "created_utc": "1656871398.0", "edited": "False", "id": "ieq1z3w", "is_submitter": "False", "link_id": "t3_vqgct8", "parent_id": "t1_iepytl2", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "MinuteLibrarian", "body": "When I do sugar free, it’s usually drinks (Coke Zero and the like) I cant say I’ve noticed a tie to increased appetite, and it’s not as if I don’t still have full sugar things either. The reason I drink diet at all is because I just like having something to sip on, especially as I’m working because it helps keep me focused. I think this is probably tied to adhd or something because it’s like a stim almost. But that’s the reason I keep diet things around because otherwise I’d be consuming a lot of sugar.", "created_utc": "1656870207.0", "edited": "False", "id": "iepz81j", "is_submitter": "False", "link_id": "t3_vpyfuc", "parent_id": "t3_vpyfuc", "score": "2", "subreddit": "BingeEatingDisorder", "subreddit_id": "t5_33q99"}, {"author": "MinuteLibrarian", "body": "Sounds like BED or something related, because this cycle of restricting/bingeing is an issue. If you have an unhealthy relationship with food and eating, waiting it out may not be helpful. You can speak to your doctor about it, but keep in mind most doctors are actually not super educated on nutrition or the psychology of issues with food and their advice may not always be helpful. I would recommend trying to connect with a dietician or a therapist or both. Note: NOT a nutritionist. Nutritionists won’t be very helpful regarding disordered eating. a dietician is the way to go. What might help if you can’t connect to a professional is trying to find dieticians online (many great dieticians are on tiktok) and learning about the intuitive eating process to see if it could be helpful. \n\nI still struggle with BED myself, but it’s made a world of difference trying to change my attitude about food and understanding that my behavior around food is tied to disordered habits and emotional trauma (this is very common for people with BED). It’s helped remove a lot of the guilt because I know it isn’t my fault, it’s literally a coping mechanism I developed to survive. It’s possible you struggle with something similar, or maybe your situation is different but either way I encourage you to be patient and understanding with yourself as you seek out resources.", "created_utc": "1656870024.0", "edited": "False", "id": "iepyslw", "is_submitter": "False", "link_id": "t3_vqkjeo", "parent_id": "t3_vqkjeo", "score": "2", "subreddit": "BingeEatingDisorder", "subreddit_id": "t5_33q99"}, {"author": "MinuteLibrarian", "body": "Hey that’s so awesome!!! It’s so cool that the language is a part of your heritage. I wish you luck! Honestly I can’t think of a better reason to learn a language than the reasons you’ve listed. Maybe it’s a calling.", "created_utc": "1656869290.0", "edited": "False", "id": "iepx379", "is_submitter": "False", "link_id": "t3_vqgct8", "parent_id": "t1_iepobm0", "score": "5", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "MinuteLibrarian", "body": "You know people go on and on about learning languages solely for utility but in my opinion this is actually not a good enough reason. That is, (barring situations like having to move to a new country for work, learning a language to communicate with your partner’s family, etc) language learning is too difficult for utility to be a good motivator. If you’re not genuinely interested in the language you’re learning, how useful the language will be to you is not encouraging enough for you to continue learning it. I genuinely believe that a deep interest in a language and its culture is WAY better motivation than utility. When you’re past the exciting beginning parts and it starts getting hard, what’s going to get you through is how interested you are and how much you care about what you’re learning. Thinking “ah well this language has 500 million global speakers it’ll be really useful to me when I learn it” just isn’t going to get you through the parts of language learning that are an absolute slog. I know this isn’t true for everyone of course, but this is how I’ve always felt about it.\n\nAmended to add: as a native speaker of a language that has only about 7 million global speakers, I can say its actually really cool being able to speak a “rare” language.", "created_utc": "1656864265.0", "edited": "False", "id": "iepl1al", "is_submitter": "False", "link_id": "t3_vqgct8", "parent_id": "t3_vqgct8", "score": "7", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "MinuteLibrarian", "body": "It’s giving monolingual", "created_utc": "1655140883.0", "edited": "False", "id": "ic84t4i", "is_submitter": "False", "link_id": "t3_vap9xo", "parent_id": "t3_vap9xo", "score": "1", "subreddit": "antiwork", "subreddit_id": "t5_2y77d"}, {"author": "MinuteLibrarian", "body": "Sounds like disassociation. This can happen when you want to protect yourself from shameful or painful memories, like binge eating can induce. It’s similar to what I experience, and learning about emotional trauma recovery has really helped me.", "created_utc": "1653880173.0", "edited": "False", "id": "iai425y", "is_submitter": "False", "link_id": "t3_v0hx0l", "parent_id": "t3_v0hx0l", "score": "9", "subreddit": "BingeEatingDisorder", "subreddit_id": "t5_33q99"}, {"author": "MinuteLibrarian", "body": "The post was more of a PSA tangentially related to the work we do. I don’t actually think she’s broken any rules, it just feels underhanded to me to ask for something I made and not tell me this is what she planned to do with it.", "created_utc": "1652114732.0", "edited": "False", "id": "i7xt83q", "is_submitter": "False", "link_id": "t3_uluzuv", "parent_id": "t1_i7xr3wq", "score": "2", "subreddit": "work", "subreddit_id": "t5_2qhne"}, {"author": "MinuteLibrarian", "body": "I thought this too, but a friend of mine who works in marketing said it would be different if it was a company account, but since it was her personal account. \n\nHonestly, I never planned on doing anything about it. I feel like she’s violated more of a social rule by not even asking about it. Like she hasn’t technically done anything wrong on paper but it does feel mildly disrespectful.", "created_utc": "1652114678.0", "edited": "False", "id": "i7xt33h", "is_submitter": "False", "link_id": "t3_uluzuv", "parent_id": "t1_i7xqinc", "score": "1", "subreddit": "work", "subreddit_id": "t5_2qhne"}, {"author": "MinuteLibrarian", "body": "I’ve definitely had this thought before too, even knowing that statistically anorexia is the deadliest mental illness out there", "created_utc": "1648314772.0", "edited": "False", "id": "i27o7te", "is_submitter": "False", "link_id": "t3_tnrgjl", "parent_id": "t3_tnrgjl", "score": "1", "subreddit": "BingeEatingDisorder", "subreddit_id": "t5_33q99"}, {"author": "MinuteLibrarian", "body": "I feel like US drivers are used to longer drives bc the US is much bigger than the UK and things are spread further out 😅\n\n3 miles here is nothing it’s a short trip to the mall. Even 6-8 miles can be pretty short depending on traffic. Not that bad. But you’re right about the base pay being shit. We do rely on tips and that sucks.", "created_utc": "1645324386.0", "edited": "False", "id": "hxnmo8e", "is_submitter": "False", "link_id": "t3_swd1yi", "parent_id": "t3_swd1yi", "score": "0", "subreddit": "UberEATS", "subreddit_id": "t5_38qlm"}, {"author": "MinuteLibrarian", "body": "No but you might save a driver’s night lmao \nEvery time a customer boosts a tip i literally can’t tell you the relief and happiness it brings me. At least once a week I cry from how terrible this job is and every time a tip is boosted it gives me some hope that maybe I can keep doing this while I’m waiting for a better job. So thanks on behalf of all those you’ve tipped well", "created_utc": "1645324224.0", "edited": "False", "id": "hxnmckk", "is_submitter": "False", "link_id": "t3_swjuv0", "parent_id": "t3_swjuv0", "score": "13", "subreddit": "UberEATS", "subreddit_id": "t5_38qlm"}, {"author": "MinuteLibrarian", "body": "Lmfao no they just send you an email saying “you’re a superhero” And sometimes they’ll send it twice, which just makes me full of twice the amount of rage.", "created_utc": "1645238474.0", "edited": "False", "id": "hxj4m7v", "is_submitter": "False", "link_id": "t3_svd3ri", "parent_id": "t3_svd3ri", "score": "2", "subreddit": "UberEATS", "subreddit_id": "t5_38qlm"}, {"author": "MinuteLibrarian", "body": "As a rule of thumb, almost nothing you pay to Uber will go to the driver except the tip. We get a ridiculously small percentage of everything else and only the tip goes to the driver in its entirety.", "created_utc": "1645238412.0", "edited": "False", "id": "hxj4hjs", "is_submitter": "False", "link_id": "t3_svl7nk", "parent_id": "t3_svl7nk", "score": "1", "subreddit": "UberEATS", "subreddit_id": "t5_38qlm"}, {"author": "MinuteLibrarian", "body": "This isn’t the driver’s choice, Uber put your order in a multiple batch and sent them all to the driver.", "created_utc": "1645238325.0", "edited": "False", "id": "hxj4b5k", "is_submitter": "False", "link_id": "t3_svqnqp", "parent_id": "t3_svqnqp", "score": "3", "subreddit": "UberEATS", "subreddit_id": "t5_38qlm"}, {"author": "MinuteLibrarian", "body": "Same here I deliver in SF valley and it’s all blue and yet SUPER slow. For a Friday it’s unbelievable.", "created_utc": "1645238096.0", "edited": "False", "id": "hxj3u01", "is_submitter": "False", "link_id": "t3_svw1ds", "parent_id": "t3_svw1ds", "score": "2", "subreddit": "UberEATS", "subreddit_id": "t5_38qlm"}, {"author": "MinuteLibrarian", "body": "I work dinner and I’ve had only two pings in the last hour, and both I had to decline bc they were no good. It’s weirdly slow for my alleged “surge” zone", "created_utc": "1645237782.0", "edited": "False", "id": "hxj36qd", "is_submitter": "False", "link_id": "t3_svw2c9", "parent_id": "t3_svw2c9", "score": "3", "subreddit": "UberEATS", "subreddit_id": "t5_38qlm"}, {"author": "MinuteLibrarian", "body": "Eh usually 1-2 an hour. 3 if I get one double order and I don’t have to go too far, but it’s less common. I’m usually online for 3-4 hours but my active driving time only ends up being like 1-2 hours maybe.", "created_utc": "1644680433.0", "edited": "False", "id": "hwnmup5", "is_submitter": "False", "link_id": "t3_snugob", "parent_id": "t1_hwf9vwu", "score": "1", "subreddit": "UberEATS", "subreddit_id": "t5_38qlm"}, {"author": "MinuteLibrarian", "body": "Just got mine! Looks like they’re in the process of sending them out right now.", "created_utc": "1644385522.0", "edited": "False", "id": "hw6v5hs", "is_submitter": "False", "link_id": "t3_so0eyf", "parent_id": "t3_so0eyf", "score": "1", "subreddit": "UberEATS", "subreddit_id": "t5_38qlm"}, {"author": "MinuteLibrarian", "body": "Prop 22 guarantees that Uber or similar companies have to pay you 120% of the minimum wage wherever you work in california and also 30 cents per every active mile you drive. If their base pay (not including tips) doesn’t add up to this amount, they pay you the difference every 2 weeks. So it’s not really extra money, it’s money they owe you anyway.", "created_utc": "1644382878.0", "edited": "False", "id": "hw6qc5u", "is_submitter": "False", "link_id": "t3_so0eyf", "parent_id": "t1_hw6oocp", "score": "3", "subreddit": "UberEATS", "subreddit_id": "t5_38qlm"}, {"author": "MinuteLibrarian", "body": "“There’s a lot of drivers” they really tried to say that like we’re in a Soviet bread line 😂 this is a billion dollar company they can definitely afford to send out everyone’s prop 22 payments on time", "created_utc": "1644380064.0", "edited": "False", "id": "hw6klhx", "is_submitter": "False", "link_id": "t3_so0eyf", "parent_id": "t1_hw6di4h", "score": "8", "subreddit": "UberEATS", "subreddit_id": "t5_38qlm"}, {"author": "MinuteLibrarian", "body": "California Prop 22. It’s sort of a minimum wage guarantee for gig workers. More complex than that, but that’s the basics.", "created_utc": "1644379955.0", "edited": "False", "id": "hw6kcze", "is_submitter": "False", "link_id": "t3_so0eyf", "parent_id": "t1_hw6j9w5", "score": "3", "subreddit": "UberEATS", "subreddit_id": "t5_38qlm"}, {"author": "MinuteLibrarian", "body": "Nope nothing yet. It’s definitely never taken this long before.", "created_utc": "1644379924.0", "edited": "False", "id": "hw6kaln", "is_submitter": "False", "link_id": "t3_so0eyf", "parent_id": "t1_hw6jmbt", "score": "3", "subreddit": "UberEATS", "subreddit_id": "t5_38qlm"}, {"author": "MinuteLibrarian", "body": "8pm and still nothing. It’s never taken this long I usually get it around 6 or 7. I’ve got a bad feeling about it idk.", "created_utc": "1644379901.0", "edited": "False", "id": "hw6k8v3", "is_submitter": "False", "link_id": "t3_so0eyf", "parent_id": "t1_hw6izm3", "score": "2", "subreddit": "UberEATS", "subreddit_id": "t5_38qlm"}, {"author": "MinuteLibrarian", "body": "7:30pm here and still waiting. I’m gonna be really pissed off if I don’t get it till Friday.", "created_utc": "1644377536.0", "edited": "False", "id": "hw6f0zc", "is_submitter": "False", "link_id": "t3_so0eyf", "parent_id": "t3_so0eyf", "score": "9", "subreddit": "UberEATS", "subreddit_id": "t5_38qlm"}, {"author": "MinuteLibrarian", "body": "Looks like the base pay was 7.53 and the customer tipped about 50 cents. The tips don’t show up until more than an hour after the delivery is complete.", "created_utc": "1644377416.0", "edited": "False", "id": "hw6er5t", "is_submitter": "False", "link_id": "t3_so3cds", "parent_id": "t3_so3cds", "score": "4", "subreddit": "UberEATS", "subreddit_id": "t5_38qlm"}, {"author": "MinuteLibrarian", "body": "Right, but has it posted to your app yet? They add it to the earnings every other Tuesday.", "created_utc": "1644377314.0", "edited": "False", "id": "hw6eill", "is_submitter": "False", "link_id": "t3_snoqrl", "parent_id": "t1_hw6e0t5", "score": "1", "subreddit": "UberEATS", "subreddit_id": "t5_38qlm"}, {"author": "MinuteLibrarian", "body": "Did you get your payment yet OP? It’s about 7:30 pm where I’m located and haven’t gotten mine yet.", "created_utc": "1644377016.0", "edited": "False", "id": "hw6due9", "is_submitter": "False", "link_id": "t3_snoqrl", "parent_id": "t3_snoqrl", "score": "1", "subreddit": "UberEATS", "subreddit_id": "t5_38qlm"}, {"author": "MinuteLibrarian", "body": "Yeah it’s looking like one of those days for me. And I haven’t gotten my prop 22 payout yet for today either. 😩Uber really makes me feel violent sometimes.", "created_utc": "1644376341.0", "edited": "False", "id": "hw6caln", "is_submitter": "False", "link_id": "t3_snzy47", "parent_id": "t1_hw6a3jm", "score": "3", "subreddit": "UberEATS", "subreddit_id": "t5_38qlm"}, {"author": "MinuteLibrarian", "body": "That’s mostly tips. The average Uber pay for me is about 13-15 per ACTIVE hour. They only count the hours you spend actively picking up and delivering food as working hours. If you’re sitting in your car waiting for orders, that time doesn’t count. And since that’s what you’re doing most of the time it’s so misleading for them to say anyone makes 20 an hour. If I go out for a 4 hour shift, I’ll usually only be active maybe 2 or 3 of those hours and I’ll make like 40-70 dollars maybe. 40 is what I usually make in a 4 hour shift. 70 is a really good day. Today, I’ve been waiting an hour already and haven’t had a single order so it’s been bad. It’s really hit or miss depending on the day.", "created_utc": "1644375243.0", "edited": "False", "id": "hw69qe6", "is_submitter": "False", "link_id": "t3_snugob", "parent_id": "t3_snugob", "score": "1", "subreddit": "UberEATS", "subreddit_id": "t5_38qlm"}, {"author": "MinuteLibrarian", "body": "No serious glitches, but I’ve had only one ping the whole time I’ve been online today and I’m allegedly in a busy zone. Usually I’ll get 2-4 pings an hour at least. Tuesdays aren’t even that slow for me. Any time this happens I blame it on the app having issues bc otherwise I’ll start getting really anxious and angry 😂", "created_utc": "1644375005.0", "edited": "False", "id": "hw695n6", "is_submitter": "False", "link_id": "t3_snzy47", "parent_id": "t3_snzy47", "score": "3", "subreddit": "UberEATS", "subreddit_id": "t5_38qlm"}, {"author": "MinuteLibrarian", "body": "Having a hard time here too. Not a single ping and I’m allegedly in a boost + surge zone. Usually I’d at least get a few shitty pings if nothing else.", "created_utc": "1644374166.0", "edited": "False", "id": "hw675b7", "is_submitter": "False", "link_id": "t3_snx1jg", "parent_id": "t3_snx1jg", "score": "1", "subreddit": "UberEATS", "subreddit_id": "t5_38qlm"}, {"author": "MinuteLibrarian", "body": "Absolutely yes 100%. I assumed I wanted children my whole life. I never really questioned whether I really wanted kids I just knew at some point I would have them and be a mother. \n\nThen I got my GSD and within a few weeks I decided I didn’t want them anymore. She’s not even a puppy anymore—she’ll be 2 in March. But I still don’t want children. 😅The emotional upheaval I went through I simply can’t do again. The idea of being responsible for a child’s daily care and well being for years at a time with hardly any breaks....no thank you. Getting a dog taught me I simply don’t have the stamina necessary to raise a child the way I think a child deserves to be raised. Ergo, I’m not the person for the job.", "created_utc": "1644372635.0", "edited": "False", "id": "hw63i1w", "is_submitter": "False", "link_id": "t3_snwuzk", "parent_id": "t3_snwuzk", "score": "8", "subreddit": "puppy101", "subreddit_id": "t5_2rw7o"}, {"author": "MinuteLibrarian", "body": "Usually I drive around too but I got sick of wasting gas and getting no opportunities so I decided to switch to parking in a good place with a lot of restaurants. Way better IMO. I had a fairly decent set of orders last night, but they definitely sent me out of my typical zone. I had one order send me from the Glendale/Burbank border to East Hollywood. Very annoying, but after the week I had I was taking anything above 8 dollars 😂", "created_utc": "1643488686.0", "edited": "False", "id": "hurhxmm", "is_submitter": "False", "link_id": "t3_sdegr3", "parent_id": "t1_hupgakv", "score": "2", "subreddit": "UberEATS", "subreddit_id": "t5_38qlm"}, {"author": "MinuteLibrarian", "body": "I’m still parsing my experience of gender, but this is something I’ve heard is common among autistic people!! Just feeling a general indifference to your own gender. You are definitely not alone in feeling that way!", "created_utc": "1643396584.0", "edited": "False", "id": "humb284", "is_submitter": "False", "link_id": "t3_setnok", "parent_id": "t3_setnok", "score": "12", "subreddit": "autism", "subreddit_id": "t5_2qhs6"}, {"author": "MinuteLibrarian", "body": "God now that you mention it, it really would’ve been SO much better to have Powder think she had killed Vi in the explosion too. The scene where Vi “abandons” her is the scene that felt the most forced to me.", "created_utc": "1643385972.0", "edited": "False", "id": "hulick2", "is_submitter": "False", "link_id": "t3_r7bi7k", "parent_id": "t1_ho3gnjr", "score": "1", "subreddit": "arcane", "subreddit_id": "t5_2re2c"}, {"author": "MinuteLibrarian", "body": "Totally 100% agree that it felt contrived. I was so disappointed with the show after everyone told me how much they loved it because I couldn’t shake the feeling that the writing was trying to manipulate me. Way too much use of the misunderstanding/sudden inconvenience trope. It felt inauthentic as hell. There are too many moments where, conveniently for the writers, the worst possible thing happens!! Like you said. Uh oh!! Vi is kidnapped! Uh oh!! Silco finds Powder immediately!!! Uh oh!!! Jinx thinks Vi is choosing Caitlyn over her!! Honestly I’m a little surprised more people don’t feel this way about it because it’s such an obvious flaw. Maybe I just REALLY hate the misunderstanding trope.", "created_utc": "1643385823.0", "edited": "False", "id": "hulhygo", "is_submitter": "False", "link_id": "t3_r7bi7k", "parent_id": "t3_r7bi7k", "score": "2", "subreddit": "arcane", "subreddit_id": "t5_2re2c"}, {"author": "MinuteLibrarian", "body": "Prop 22 really does so little for us when online hours don’t count 😩", "created_utc": "1643339938.0", "edited": "False", "id": "huj8foy", "is_submitter": "False", "link_id": "t3_seghkc", "parent_id": "t3_seghkc", "score": "1", "subreddit": "UberEATS", "subreddit_id": "t5_38qlm"}, {"author": "MinuteLibrarian", "body": "You can’t really immediately stop the things listed above. Your pup will grow out of them with time and training. I get your pain honestly. My dog was such a pain and raising her was really the hardest thing I have ever done. We also nearly gave her back around when she was 12 weeks. We kept her in the end, but for several months I was at home all day with her and my family was able to help out because they were working from home. \n\nMy advice would be to seriously consider giving the puppy back to the breeder (if reputable) or to a rescue. They’ll find a new home for a puppy immediately. It’s not gonna get much easier for a while honestly. Puppies are really hard for 6-12 months. If you can afford a one-on-one trainer, it’ll really help make things easier much faster. Don’t feel bad for feeling like you hate your puppy sometimes. For the first year of my dog’s life I hated her more often than I liked her. She was SUCH a pain in the ass. Sometimes the responsible thing to do is really to give the dog back if you’re in over your head. I wish you luck, and if you keep her, a lot of patience and a easier puppyhood 😅", "created_utc": "1643339736.0", "edited": "False", "id": "huj7zcw", "is_submitter": "False", "link_id": "t3_sedbpa", "parent_id": "t3_sedbpa", "score": "2", "subreddit": "dogs", "subreddit_id": "t5_2qhhk"}, {"author": "MinuteLibrarian", "body": "Same problem in LA tbh. It’s not just slow or low payout orders. Sometimes it’s nothing at all. Uber is having issues and I think they have less people ordering in January in general and more people delivering than ever.", "created_utc": "1643334629.0", "edited": "False", "id": "huiw9jj", "is_submitter": "False", "link_id": "t3_sedkl9", "parent_id": "t3_sedkl9", "score": "5", "subreddit": "UberEATS", "subreddit_id": "t5_38qlm"}, {"author": "MinuteLibrarian", "body": "This might be a dumb question but...does this mean 9 items or 9 separate deliveries??", "created_utc": "1643330002.0", "edited": "False", "id": "huilage", "is_submitter": "False", "link_id": "t3_sed2sh", "parent_id": "t3_sed2sh", "score": "2", "subreddit": "UberEATS", "subreddit_id": "t5_38qlm"}, {"author": "MinuteLibrarian", "body": "Slow everywhere I think. I deliver in the valley and it’s been terrible. I think it’ll pick up a little in February. January is always bad for retail and food service. Last year everyone had supplemental money from the government and this year everyone quit their jobs and they’re broke. Plus Uber sucks and their app has been glitching for days.", "created_utc": "1643320642.0", "edited": "False", "id": "huhxyp8", "is_submitter": "False", "link_id": "t3_se53mu", "parent_id": "t3_se53mu", "score": "3", "subreddit": "UberEATS", "subreddit_id": "t5_38qlm"}, {"author": "MinuteLibrarian", "body": "Delivered to a hella upscale gated community the other day. House that ordered was at the very top of the hill and I had to go through a security checkpoint. This is exactly what it felt like 😂", "created_utc": "1643320477.0", "edited": "False", "id": "huhxj38", "is_submitter": "False", "link_id": "t3_se8cs8", "parent_id": "t3_se8cs8", "score": "17", "subreddit": "UberEATS", "subreddit_id": "t5_38qlm"}, {"author": "MinuteLibrarian", "body": "I wish I still had the privilege of declining Walmart orders. I don’t even get them anymore 😩", "created_utc": "1643262024.0", "edited": "False", "id": "huek834", "is_submitter": "False", "link_id": "t3_sdh3tk", "parent_id": "t1_hueitq5", "score": "2", "subreddit": "UberEATS", "subreddit_id": "t5_38qlm"}, {"author": "MinuteLibrarian", "body": "I deliver in the valley and it’s been absolute trash these last few days. I’ll spend hours sitting in my car with no pings at all and the occasional order that does come through is for 3/4 dollars. It’s been so bad I’ve been wondering whether I’d have more luck in Hollywood. Guess not 😭😭😭", "created_utc": "1643251033.0", "edited": "False", "id": "hudx2ap", "is_submitter": "False", "link_id": "t3_sdegr3", "parent_id": "t3_sdegr3", "score": "2", "subreddit": "UberEATS", "subreddit_id": "t5_38qlm"}, {"author": "MinuteLibrarian", "body": "Same thing happened to me last week. 3 hours and no orders for more than 4 dollars. And now I’ve literally been sitting in my car for over an hour at this point and haven’t gotten a single ping for anything 😭", "created_utc": "1643250632.0", "edited": "False", "id": "hudw3hp", "is_submitter": "False", "link_id": "t3_sdh3tk", "parent_id": "t3_sdh3tk", "score": "3", "subreddit": "UberEATS", "subreddit_id": "t5_38qlm"}, {"author": "MinuteLibrarian", "body": "I’m in SF valley and I swear I’m getting maybe one ping an hour at most and usually for hardly any money. I’ve been active nearly an hour now and nothing. It’s literally infuriating. Yesterday was the same. Nothing at all for hours and most things I did get were 3/4/5 dollar orders.", "created_utc": "1643250319.0", "edited": "False", "id": "hudvcd7", "is_submitter": "False", "link_id": "t3_sdmx0p", "parent_id": "t3_sdmx0p", "score": "3", "subreddit": "UberEATS", "subreddit_id": "t5_38qlm"}, {"author": "MinuteLibrarian", "body": "Oooo totally feel this. Before, binges were my only vice. Now I plan a binge around getting high. I usually don’t binge unless I’m high, but I’m high a lot so that doesn’t really mean anything. If anything I think the problem is worse because being high + bingeing is really sheer bliss, way better than either one alone. \nSo if anything the addiction has escalated. For me it’s the other way around I think. As in, weed escalates my bingeing problem and I get high in order to have a binge. It’s pretty yikes.", "created_utc": "1643220185.0", "edited": "False", "id": "hubo1p0", "is_submitter": "False", "link_id": "t3_sd641a", "parent_id": "t3_sd641a", "score": "5", "subreddit": "BingeEatingDisorder", "subreddit_id": "t5_33q99"}, {"author": "MinuteLibrarian", "body": "Oh good to know!! I fully thought it was some kind of penalty for my low order acceptance rate.", "created_utc": "1636520871.0", "edited": "False", "id": "hk17pyh", "is_submitter": "True", "link_id": "t3_qqm2gb", "parent_id": "t1_hk145nx", "score": "1", "subreddit": "UberEATS", "subreddit_id": "t5_38qlm"}, {"author": "MinuteLibrarian", "body": "Sadly this wouldn’t be all that easy. Our backyard is mostly cement (an unfortunate design decision on the part of my parents) so there’s a very limited area to turn into potty spot :/", "created_utc": "1635516442.0", "edited": "False", "id": "hiiirrp", "is_submitter": "False", "link_id": "t3_qi803s", "parent_id": "t1_hihr9va", "score": "0", "subreddit": "dogs", "subreddit_id": "t5_2qhhk"}, {"author": "MinuteLibrarian", "body": "Yes! Our command is “go potty” but she typically ignores this command if she’s uncomfortable. On walks I will give her the command if I sense she needs to go so she knows it’s okay, but she usually doesn’t listen. \n\nI’m gonna start trying out some high value treats near the potty spot and see if that counter-conditioning will help a little. Lately she will not follow me to the potty spot if she is on a lead. Like she’ll pull back on the lead. If she does follow me she stops a few steps before the potty spot and gives me a sad little high pitched bark if I give her the potty command. It’s truly pitiful to witness 😅😅", "created_utc": "1635499597.0", "edited": "False", "id": "hihqg8l", "is_submitter": "False", "link_id": "t3_qi803s", "parent_id": "t1_hiho3wv", "score": "0", "subreddit": "dogs", "subreddit_id": "t5_2qhhk"}, {"author": "MinuteLibrarian", "body": "Thanks for your reply! How long would you say until the prep was fully through?", "created_utc": "1629592448.0", "edited": "False", "id": "h9up2ba", "is_submitter": "False", "link_id": "t3_p92g6f", "parent_id": "t1_h9unu6v", "score": "1", "subreddit": "ibs", "subreddit_id": "t5_2s3g1"}, {"author": "MinuteLibrarian", "body": "Yes exactly!! I knew there was something off immediately I was like “is it because I tipped too little? Or she hasn’t seen the tip??” It all clicked way too late 😭", "created_utc": "1627411425.0", "edited": "False", "id": "h6qkc4f", "is_submitter": "True", "link_id": "t3_oss56a", "parent_id": "t1_h6qjz4y", "score": "1", "subreddit": "autism", "subreddit_id": "t5_2qhs6"}, {"author": "MinuteLibrarian", "body": "I can provide the rest!\n\n**Absolute Neut Count\t6.17**\n\n**Absolute Lymphocyte Count\t2.43**\n\n**Absolute Mono Count\t0.47**\n\n**Absolute Eos Count\t0.17**\n\n**Absolute Baso Count\t0.04**\n\nmy symptoms are nausea, stomach pain, diarrhea/constipation, and rectal bleeding (though this may be from hemorrhoids bc my doc confirmed today that I'd at least had them in the past). I'm gonna see a GI specialist sometime next week probably, I'm just nervous that I have something horrible going on.\n\nAlso, I'm not sure if this would make a difference to blood work but about 3 weeks ago I had a toenail removed bc of trauma so I had to go through a whole healing process for that.", "created_utc": "1626913786.0", "edited": "False", "id": "h62jbb7", "is_submitter": "False", "link_id": "t3_op1nsc", "parent_id": "t1_h62dx8h", "score": "1", "subreddit": "AskDocs", "subreddit_id": "t5_2xtuc"}, {"author": "MinuteLibrarian", "body": "Yes same!! The headspace is EVERYTHING. I try and eat with intention now and no matter how much I eat it feels wildly different from a binge.", "created_utc": "1626732992.0", "edited": "False", "id": "h5t0nge", "is_submitter": "True", "link_id": "t3_onl1ze", "parent_id": "t1_h5sta2q", "score": "8", "subreddit": "BingeEatingDisorder", "subreddit_id": "t5_33q99"}, {"author": "MinuteLibrarian", "body": "I SOOOO get what you mean about the hit of dopamine. I have no idea what to do about my shit dopamine levels if I’m not using food 😅", "created_utc": "1624396219.0", "edited": "False", "id": "h2p2mkw", "is_submitter": "False", "link_id": "t3_o5rkkb", "parent_id": "t3_o5rkkb", "score": "2", "subreddit": "BingeEatingDisorder", "subreddit_id": "t5_33q99"}, {"author": "MinuteLibrarian", "body": "These were my thoughts exactly! Unfortunately I'm living with my parents right now and my options for where to put her at night are limited since they have much more strict rules for the dog than I do. My mom hates pens and refuses to have one in her living room and since the dog isn't allowed on the couches I can't give her free roam at night. I'm going to see if I can get a cooling mat and a fan for her crate to keep her cooler at night. We switched out her regular cover for a sheet which only covers about half of the crate so there's still plenty of air flow throughout.", "created_utc": "1623517209.0", "edited": "False", "id": "h1j642j", "is_submitter": "False", "link_id": "t3_ny0sx3", "parent_id": "t1_h1ix1rk", "score": "2", "subreddit": "puppy101", "subreddit_id": "t5_2rw7o"}, {"author": "MinuteLibrarian", "body": "Regrettably I don't think leaving her out of the crate is an option. I am living with my parents right now and they don't allow her on the couches and unfortunately she still digs in the plants when she thinks no one is looking. I'm going to look for some things which might help keep her crate cooler at night.", "created_utc": "1623517045.0", "edited": "False", "id": "h1j5s3j", "is_submitter": "False", "link_id": "t3_ny0sx3", "parent_id": "t1_h1ighrq", "score": "2", "subreddit": "puppy101", "subreddit_id": "t5_2rw7o"}, {"author": "MinuteLibrarian", "body": "I will definitely try collecting a pee sample! That might be the only thing that'll work after all this lol", "created_utc": "1620600035.0", "edited": "False", "id": "gxjodss", "is_submitter": "False", "link_id": "t3_n8h65l", "parent_id": "t1_gxidirc", "score": "1", "subreddit": "dogs", "subreddit_id": "t5_2qhhk"}, {"author": "MinuteLibrarian", "body": "Yes, I mentioned in the post that I have a potty command for her. She understands the command because I use it at home but unfortunately when I use it while we're out she just seems confused and ignores me. I'm waiting for the opportunity to shower her with praise if she ever potties on a walk haha so she knows it's a good thing. It has yet to happen, she's literally never peed on a walk in her life. She's pooped a couple of times but that was months ago when she was still a puppy and hasn't happened since.", "created_utc": "1620584949.0", "edited": "False", "id": "gxitpag", "is_submitter": "False", "link_id": "t3_n8h65l", "parent_id": "t1_gxis6e2", "score": "1", "subreddit": "dogs", "subreddit_id": "t5_2qhhk"}, {"author": "MinuteLibrarian", "body": "Unfortunately it never matters how long the walk is. We could be out for hours and she still won't go, even if I know she has to and I'm giving her the command.", "created_utc": "1620584809.0", "edited": "False", "id": "gxitez1", "is_submitter": "False", "link_id": "t3_n8h65l", "parent_id": "t1_gxip201", "score": "1", "subreddit": "dogs", "subreddit_id": "t5_2qhhk"}, {"author": "MinuteLibrarian", "body": "It should! Until then, I would recommend paying attention to your energy levels to figure out how much food is right for your body and make sure you're eating enough. After a while you'll get them back and it'll be easier to figure out a good relationship with food. It might be worth noting that hunger may feel different for you now than it did while binge eating. I've noticed that about myself.", "created_utc": "1620264310.0", "edited": "False", "id": "gx3lehh", "is_submitter": "False", "link_id": "t3_n5j970", "parent_id": "t1_gx39j8o", "score": "2", "subreddit": "BingeEatingDisorder", "subreddit_id": "t5_33q99"}, {"author": "MinuteLibrarian", "body": "This happens to me! On days I don't binge I often don't feel hungry. It's 4pm where I am and I've been awake since 6:30am and I JUST ate a banana because I realized I hadn't eaten all day. This is pretty normal actually. From what I've learned it has to do with the fact that your body knows you don't respond to hunger signals normally so sometimes it doesn't bother with them. The body has an awareness of its own that you're not necessarily in control of. Your body is used to binges, so it knows it doesn't have to give you a hunger cue to get food. If you are diligent with feeding yourself in a healthy way during recovery, your hunger cues will bounce back and will work a little better.", "created_utc": "1620256829.0", "edited": "False", "id": "gx362jb", "is_submitter": "False", "link_id": "t3_n5j970", "parent_id": "t3_n5j970", "score": "1", "subreddit": "BingeEatingDisorder", "subreddit_id": "t5_33q99"}, {"author": "MinuteLibrarian", "body": "I have not personally considered it, and I would definitely urge you to take into account the experiences of people who have had BED and surgery, BUT one thing I wanted to mention is that having weight loss surgery may treat the physical symptoms of BED, but the true cause of BED is mental/emotional and cannot be treated this way. I say this because I have heard of cases where people had gastric bypass and were still unable to stop bingeing despite the physical pain of stretching your stomach further than it can go, which of course is really, really dangerous. Feeling full on less food may not kill your urge to binge. Whatever you decide, your relationship with food will still need its own work.", "created_utc": "1620255987.0", "edited": "False", "id": "gx349fn", "is_submitter": "False", "link_id": "t3_n5ojqr", "parent_id": "t3_n5ojqr", "score": "4", "subreddit": "BingeEatingDisorder", "subreddit_id": "t5_33q99"}, {"author": "MinuteLibrarian", "body": "Definitely feels like self-harm to me. The concept of self-harm is complicated. It includes things, like food, that don't necessarily feel like harm the way something obvious like cutting yourself does. But it's still something you know is hurting you.", "created_utc": "1620195772.0", "edited": "False", "id": "gwzxx8n", "is_submitter": "False", "link_id": "t3_n585uk", "parent_id": "t3_n585uk", "score": "24", "subreddit": "BingeEatingDisorder", "subreddit_id": "t5_33q99"}, {"author": "MinuteLibrarian", "body": "Thank you for sharing this! I had a similar experience with my pup! The blues would not get better after months and I was sinking deeper into despair while everyone else seemed to be having spiritual bonding experiences with their dogs. It was horrible. Three separate times I considered rehoming her and after contacting a rescue and crying for several days straight I realized I just couldn't do it. She's a year old now and we're finally starting to bond the way I always hoped. My mental health plummeted so severely that getting this far with my puppy is the hardest thing I've ever done but I think I can finally say that after months of misery and uncertainty and borderline insanity, it feels like it was worth it.", "created_utc": "1620111690.0", "edited": "False", "id": "gwvoyne", "is_submitter": "False", "link_id": "t3_n46snd", "parent_id": "t3_n46snd", "score": "2", "subreddit": "puppy101", "subreddit_id": "t5_2rw7o"}, {"author": "MinuteLibrarian", "body": "Same for me, I don't know what to do now that I've figured out it's not restriction. Intuitive eating is so tricky for me because anything that's NOT a binge often feels like restriction", "created_utc": "1620086976.0", "edited": "False", "id": "gwujb7s", "is_submitter": "True", "link_id": "t3_n3xtrt", "parent_id": "t1_gwtikmo", "score": "3", "subreddit": "BingeEatingDisorder", "subreddit_id": "t5_33q99"}, {"author": "MinuteLibrarian", "body": "I suspect mine is related to ADHD too, but I've been unable to get a diagnosis unfortunately.", "created_utc": "1620086871.0", "edited": "False", "id": "gwuj3fc", "is_submitter": "True", "link_id": "t3_n3xtrt", "parent_id": "t1_gwui8vh", "score": "2", "subreddit": "BingeEatingDisorder", "subreddit_id": "t5_33q99"}, {"author": "MinuteLibrarian", "body": "If the walks would work I would feel a little better about it, but as I mentioned our dog never poops on walks. She will only go in the yard.  \n\nSounds like we have the same problem. My pup also totally ignores me if I call her after a poop. Two days ago I tried distracting her with treats and used every command I could think of and she ignored everything even though she's wildly food-motivated. I actually couldn't believe the offer of treats didn't work because she usually never passes it up. She just tried to gobble up as much of the poo as she could before I got close enough to pick it up. It was terrible to witness honestly. I know she's been doing it for weeks but it's really extra traumatizing when it happens in front of you and you can't do anything to stop it.", "created_utc": "1613872210.0", "edited": "False", "id": "go6k4rp", "is_submitter": "True", "link_id": "t3_lh9ltw", "parent_id": "t1_go6igc8", "score": "1", "subreddit": "puppy101", "subreddit_id": "t5_2rw7o"}, {"author": "MinuteLibrarian", "body": "Do we have the same dog??? My puppy did exactly the same thing this morning. It was FREEZING and super windy and even raining a little and she peed and refused to poop. I KNEW she had to so I kept taking her out but she just kept tugging the leash and eating leaves and wanting to chase the birds. She did the same thing on her walk all morning, much to my embarrassment. Definitely don't feel guilty about needing some days off!! I've taken my dog to daycare three or four days in a row when she was being a terror and I just couldn't handle her anymore hahaha", "created_utc": "1613153934.0", "edited": "False", "id": "gn31yg7", "is_submitter": "False", "link_id": "t3_libhxn", "parent_id": "t3_libhxn", "score": "3", "subreddit": "puppy101", "subreddit_id": "t5_2rw7o"}, {"author": "MinuteLibrarian", "body": "What a beautiful pup she is! I'm so sorry it's time for her to go but you're right, she'll be having a blast in doggie heaven!! I totally agree with what others have said, just think of all the foods she's stared at while you were eating them and just give her everything. I bet she'd love to have a ton of bacon since it's so fatty and savory.", "created_utc": "1613149831.0", "edited": "False", "id": "gn2sbrf", "is_submitter": "False", "link_id": "t3_lidl7a", "parent_id": "t3_lidl7a", "score": "3", "subreddit": "dogs", "subreddit_id": "t5_2qhhk"}, {"author": "MinuteLibrarian", "body": "Oh 100% absolutely totally same here. My parents thought a puppy would help me and actually it exacerbated my depression and anxiety to never-before-seen limits. I never knew it was possible to feel so bad.", "created_utc": "1613103881.0", "edited": "False", "id": "gn0vx1q", "is_submitter": "False", "link_id": "t3_lhsksc", "parent_id": "t3_lhsksc", "score": "1", "subreddit": "puppy101", "subreddit_id": "t5_2rw7o"}, {"author": "MinuteLibrarian", "body": "oh god yup, exactly!! I felt so alone in those months when EVERYONE'S puppy seemed to have stopped biting at like 3-6 months and I was still getting chewed up and attacked when she was excited and we were well past her teething. I saw everyone saying things about cuddling with their puppy and being able to let them roam the house. I couldn't do any of those things because it was a landshark war zone. When I say she only JUST stopped I mean like in the last two weeks. This time last month she was still biting my hands in excitement every time I tried to put her leash on for a walk. She turns 11 months in 5 days. Nearly one full year of being bitten by the creature who is allegedly my best friend.\n\nHang in there. It will stop. They get it eventually, because it's very baby behavior and they grow out of it. What made me feel better was knowing that in really excitable dogs, it's not uncommon for them to still bite in play even when they're older. It just takes a little while. I definitely felt desperate for a minute there though. There were times when I thought she would never get it.", "created_utc": "1613065261.0", "edited": "False", "id": "gmym8h1", "is_submitter": "False", "link_id": "t3_lh98qo", "parent_id": "t1_gmyl9bd", "score": "1", "subreddit": "puppy101", "subreddit_id": "t5_2rw7o"}, {"author": "MinuteLibrarian", "body": "That was my fear too! I ended up attaching a pen to her crate and left the crate door open so she could enter and exit as she pleased. I didn't care if she ended up hating the pen because it was a temporary set up. It actually worked better this way. We slowly transitioned her out of using the x-pen and now she has no qualms about her crate. Now that she's older, I actually can completely ignore crate crying because the crate has been so well reinforced it would be hard to make her hate it at this point. Good luck to you!!", "created_utc": "1613064628.0", "edited": "False", "id": "gmykowr", "is_submitter": "False", "link_id": "t3_lh98qo", "parent_id": "t1_gmy70ws", "score": "2", "subreddit": "puppy101", "subreddit_id": "t5_2rw7o"}, {"author": "MinuteLibrarian", "body": "Oh my goodness. This sounds like I could've written it. When my pup was about 12 weeks old I hit a low point like none other. I'd had puppy blues for months and instead of going away, like everyone promised they would, it was just getting worse. I'd never experienced anxiety and depression to that degree and I had a medical history of both of those conditions.\n\nWhen I felt I couldn't take it anymore, I made arrangements to give her to a breed-specific rescue that already had a dozen homes vetted and ready to go for puppies. They even told me they would let me know where they settled her and how she was doing. The decision had been made, but I was so deeply unsure. I had a horribly nasty feeling that no matter what choice I made, it would feel like the wrong one. I knew that I would feel like I had made a mistake no matter what I did. The day before I was supposed to confirm with the rescue, I decided not to do it. I kept her and decided to ride it out.\n\nWhat followed was some of the worst mental health lows I've ever experienced. Things would get slightly better and then drastically worse again. (I should mention that I had my entire family helping with my pup. If I had been alone, I don't think there was any way I could have handled that.) My puppy is ten months now. Due to a litter disaster, I've had her since she was 5 weeks old. While I am doing a little better now, I still struggle with it at times and when especially since my pup now has a chronic health condition. It's genuinely been the hardest thing I've ever done and for a long time I was convinced I'd made a terrible mistake. \n\nI'm not telling you this to make you feel like you should have kept your puppy. I think you made the right choice. I know because, had I decided to give away my pup that day, I think by now, months later, I would have felt like it was the right choice too. It sounds like you're going through something difficult and what you need right now might just be some peace and stability. Raising a puppy requires a total sacrifice of any kind of stability. It's very possible that it might have only gotten harder, and you would've ended up wishing you'd rehomed your pup earlier before you bonded with him even more.  I think that, just like I felt months ago, whatever choice you made was going to end up feeling like the wrong one. Your pup will be just fine with the wonderful family you found him, and in time, you will be fine too. When you'e ready, you can always give it another shot with a different puppy.", "created_utc": "1613064224.0", "edited": "1613064772.0", "id": "gmyjpg7", "is_submitter": "False", "link_id": "t3_lhl1cg", "parent_id": "t3_lhl1cg", "score": "2", "subreddit": "puppy101", "subreddit_id": "t5_2rw7o"}, {"author": "MinuteLibrarian", "body": "Small progress of any kind is really encouraging!! For my pup, I eventually had to enforce her naps. I would set a naptime and put her in her crate/pen and just wait for her to fall asleep. Sometimes it worked, sometimes she screamed bloody murder for an hour. Eventually though she got the idea. It ended up being much better than waiting for her to settle on her own which by 12/13 weeks she would never have done. She was like a zooming ball of teeth and vengeance at that age.", "created_utc": "1613058411.0", "edited": "False", "id": "gmy5sbd", "is_submitter": "False", "link_id": "t3_lh98qo", "parent_id": "t1_gmwy3rz", "score": "1", "subreddit": "puppy101", "subreddit_id": "t5_2rw7o"}, {"author": "MinuteLibrarian", "body": "Yeah I used to cry every day too. It was really bad. But slowly it goes away. I hope at least that the leash thing subsides. My pup does that too. I also read the advice about \"don't tug back\" like?? I don't have to if she tugs then it's a tug game unless I should let go of the leash and have her take off", "created_utc": "1613020386.0", "edited": "False", "id": "gmwnxpl", "is_submitter": "False", "link_id": "t3_lh98qo", "parent_id": "t1_gmwl51a", "score": "5", "subreddit": "puppy101", "subreddit_id": "t5_2rw7o"}, {"author": "MinuteLibrarian", "body": "Oh god nope you're not alone it was a rough time for us. Since she only slept one hour at a time and was up for like two hours in between I hardly ever got a break. It nearly drove me crazy. On top of that, ZERO bite inhibition training worked with her. NOTHING worked, not the walking away, not the redirecting, not ending playtime, not providing dozens and dozens of chew toys, not the clapping or the shushing thing, NOTHING. We just had to wait it out. Now at last I know that something must have clicked with the bite inhibition at some point because she still nibbles when she's playful but she's very gentle with it. I actually can't believe she learned that it hurts because I never got the feeling that she was able to tell it was hurting me in those very, very long months of bite training.\n\nEdit to say she eventually got much better at sleeping around 5 months or so. She would finally get tuckered out after her morning walks and spend 3-5 hours napping. Blissful relief.", "created_utc": "1613017422.0", "edited": "False", "id": "gmwj3up", "is_submitter": "False", "link_id": "t3_lh98qo", "parent_id": "t1_gmwhyb3", "score": "10", "subreddit": "puppy101", "subreddit_id": "t5_2rw7o"}, {"author": "MinuteLibrarian", "body": "I can only hope growing up works with my dog. I know they pick up an array of strange habits when they're young that they eventually grow out of. \n\nI laughed out loud at smorgasbord of choices. Dogs are so ridiculous sometimes. I read that the reason they love cat poop is because cat food has more concentrated protein so it makes the poop extra tasty to them. Yikes.", "created_utc": "1613017092.0", "edited": "False", "id": "gmwijpx", "is_submitter": "True", "link_id": "t3_lh9ltw", "parent_id": "t1_gmwhsmr", "score": "2", "subreddit": "puppy101", "subreddit_id": "t5_2rw7o"}, {"author": "MinuteLibrarian", "body": "Easy to socialize here too, our dog was so quick to adjust to new experiences and wouldn't let scary things deter her from exploring...but for 4 months she only slept one hour at a time and spent the entire day whining and biting and screaming to be let out of her pen. She only JUST stopped biting and she's ten months old.", "created_utc": "1613016384.0", "edited": "False", "id": "gmwhbc2", "is_submitter": "False", "link_id": "t3_lh98qo", "parent_id": "t1_gmwbd7q", "score": "23", "subreddit": "puppy101", "subreddit_id": "t5_2rw7o"}, {"author": "MinuteLibrarian", "body": "Same experience here....I had the worst puppy blues ever and they kept coming and going...every time I thought I was over it, it would come back around. She's ten months old now and I'm just starting to really see the light at the end of the tunnel. She's a teenage brat but sometimes I catch a glimmer of the dog she'll grow up to be and in those moments it really does feel worth it.", "created_utc": "1613016205.0", "edited": "False", "id": "gmwgzs8", "is_submitter": "False", "link_id": "t3_lh98qo", "parent_id": "t1_gmw4izf", "score": "8", "subreddit": "puppy101", "subreddit_id": "t5_2rw7o"}, {"author": "MinuteLibrarian", "body": "Oh my god I'm so sorry you had to deal with poop vomit!!! Luckily my dog has never thrown up her poo snacks but she has gotten terrible diarrhea. Nothing like having to power-wash diarrhea off of artificial turf.\n\nHow did your dog eventually stop? Did one of the deterrents work or did she just stop on her own?", "created_utc": "1613016031.0", "edited": "False", "id": "gmwgocg", "is_submitter": "True", "link_id": "t3_lh9ltw", "parent_id": "t1_gmwgbct", "score": "2", "subreddit": "puppy101", "subreddit_id": "t5_2rw7o"}, {"author": "MinuteLibrarian", "body": "(A note for other commenters: going off about the puppy being too young to leave the litter isn't going to help OP. The puppy has already been removed. What is going to help is giving any guidance about intervention for puppies who have left litter too early. Fear-mongering is not helpful.)\n\nYes it is normal. Puppies will bite and sniff everything for many months. And the genitals thing isn't that weird either. Your pup left mom too early, but you can still teach bite inhibition to your puppy anyway. Look up bite inhibition techniques and be very patient. Some of these techniques won't work, and that's okay. Sometimes people don't see a change in their puppy's biting behavior until their adult teeth come in (5-6 months). \n\nAlso, please make sure your puppy is getting a lot of socialization to make up for the lost time with her litter! Make sure you're socializing her with lots of sounds and sights and dogs and people whenever possible. She doesn't have all her vaccinations yet so be careful taking her outside and only introduce her to dogs you know are vaccinated. You can look up socializatoin techniques online too. It's especially important to keep up with it for puppies who did leave te litter too early. I highly recommend puppy classes for this. She will learn so much in puppy classes that will fill a lot of the gap that might be left by being removed too early.\n\nShe sounds a lot like my puppy (we got her at 5 weeks bc mom rejected the litter). She was a terrible biter and bite training took a long time with her but she's fine now, and well-socialized because of puppy school. She used to be very timid and after a couple of months of puppy school is now very curious and friendly instead of scared. Also, scolding won't work, especially on a puppy this young. She is very likely to think it's just exciting and fun, or just get scared. She's literally a baby right now and has a lot to learn so she needs a lot of patience. Older dogs will understand \"scolding\" commands like \"no\" and \"stop it\" but I've rarely seen this work on young puppies.", "created_utc": "1612853553.0", "edited": "False", "id": "gmo9jfd", "is_submitter": "False", "link_id": "t3_lftywl", "parent_id": "t3_lftywl", "score": "6", "subreddit": "dogs", "subreddit_id": "t5_2qhhk"}, {"author": "MinuteLibrarian", "body": "this exactly!!! I have no idea how to implement new habits in any meaningful way because as far as I can tell i've never had a single habit, good or bad. They just come and go in waves I've never done ANYTHING every single day for any extended period of time.", "created_utc": "1612852762.0", "edited": "False", "id": "gmo8kzr", "is_submitter": "False", "link_id": "t3_lfks55", "parent_id": "t1_gmmbxsx", "score": "3", "subreddit": "ADHD", "subreddit_id": "t5_2qnwb"}, {"author": "MinuteLibrarian", "body": "My puppy has had digestive issues since she was 4 months old (she's 10 months now and also large breed) and is currently on a special \"adult\" diet that is safe for puppies. She is on Royal Canin hydrolyzed diet which is the ONLY thing that has helped.\n\nOne thing about pet food: there is more misleading information out there about dog food than there is correct information. I would trust your vet above any internet advice about food. You can always get a second opinion from a different vet. There are a lot of ingredients in dog food that are totally fine that have been \"flagged\" as unhealthy by dog enthusiasts and people looking to sell boutique food. The result is that many people have begun mistrusting vet-recommended diets.\n\nRegardless, if you're concerned about the Purina diet, I would recommend asking about Royal Canin's special diets instead. The ingredients are still \"weird\" but my dog is healthier than she has ever been and her poop is finally normal.\n\n(This may not be immediately relevant, but if you want to learn more about which dog food brands have been proven safe for dogs long-term please look at [this link](http://dcmdogfood.com/taurine-dcm-faq/) and scroll down to the section about food selection. It's primarily about DCM in dogs but I think the info about long-term dog food testing is important for a lot of conditions dogs may have)", "created_utc": "1612852496.0", "edited": "False", "id": "gmo8975", "is_submitter": "False", "link_id": "t3_lftqnw", "parent_id": "t3_lftqnw", "score": "2", "subreddit": "puppy101", "subreddit_id": "t5_2rw7o"}, {"author": "MinuteLibrarian", "body": "Mine is 10 months and can never cuddle unless she's EXHAUSTED. She's still too rambunctious to have full access to the house but even if I go and sit near her to cuddle she will get up and shove her butt in my face before she picks out a toy to play tug with", "created_utc": "1612542870.0", "edited": "False", "id": "gm4qu2v", "is_submitter": "False", "link_id": "t3_ld6ukv", "parent_id": "t1_gm4dn5k", "score": "3", "subreddit": "puppy101", "subreddit_id": "t5_2rw7o"}, {"author": "MinuteLibrarian", "body": "My pup does this too, just not in the mornings. It's the eye contact that makes me laugh. Her ears are flat against her head and she's staring at me like \"butt scritches please mom\"", "created_utc": "1612542775.0", "edited": "False", "id": "gm4qm4l", "is_submitter": "False", "link_id": "t3_ld6ukv", "parent_id": "t1_gm4bdzo", "score": "15", "subreddit": "puppy101", "subreddit_id": "t5_2rw7o"}, {"author": "MinuteLibrarian", "body": "At ten months she doesn't want to get out of the crate when I wake her up lmao. But eventually she's out of the crate and knocks up against my legs like a cat.  Actually my fave is her morning stretch because when she stretches her hind legs she points her toes like a ballerina", "created_utc": "1612542594.0", "edited": "False", "id": "gm4q6qd", "is_submitter": "False", "link_id": "t3_ld6ukv", "parent_id": "t3_ld6ukv", "score": "5", "subreddit": "puppy101", "subreddit_id": "t5_2rw7o"}, {"author": "MinuteLibrarian", "body": "I saw Winternight and immediately clicked to recommend Uprooted and Spinning Silver but I see you've already read Uprooted so Spinning Silver is probably already on your radar 😅\n\nYou could try Rosamund Hodge! Her style isn't for everyone, but personally I loved Cruel Beauty. Another one I recommend is The Winnter's Trilogy. It is fantasy, but there isn't a whole lot of magic involved. However, the female lead is very intelligent and cunning so definitely a strong character.", "created_utc": "1612486608.0", "edited": "False", "id": "gm2685u", "is_submitter": "False", "link_id": "t3_lc8rxg", "parent_id": "t3_lc8rxg", "score": "1", "subreddit": "booksuggestions", "subreddit_id": "t5_2ryqe"}, {"author": "MinuteLibrarian", "body": "If you like tongue-in-cheek humor similar to things like Monty Python or Princess Bride I highly recommend The Phantom Tollbooth.", "created_utc": "1612486200.0", "edited": "False", "id": "gm25dnk", "is_submitter": "False", "link_id": "t3_lcdnw4", "parent_id": "t3_lcdnw4", "score": "1", "subreddit": "booksuggestions", "subreddit_id": "t5_2ryqe"}, {"author": "MinuteLibrarian", "body": "Research stuff because of hyperfixation. I KNOW for a fact that if I need to learn or find something out, if the information is available anywhere then I WILL find it.  I've had a much easier time digging up information than my neurotypical peers because of the need to find out how things work.", "created_utc": "1612457421.0", "edited": "False", "id": "gm084xr", "is_submitter": "False", "link_id": "t3_lcejjy", "parent_id": "t3_lcejjy", "score": "8", "subreddit": "ADHD", "subreddit_id": "t5_2qnwb"}, {"author": "MinuteLibrarian", "body": "I have the same problem with Armenian!! I couldn't speak English until I was like 3 or 4 years old but I was speaking Armenian that whole time. And yet, my English is WAY better than my Armenian. I could write books in English and with Armenian sometimes it's hard for me to uphold a conversation. I would probably suggest reading more books in your native language. Thinking back on it, part of the reason I excelled at English so quickly as a child is because all the books I read were in English.", "created_utc": "1612457008.0", "edited": "False", "id": "gm071jp", "is_submitter": "False", "link_id": "t3_lcixlp", "parent_id": "t3_lcixlp", "score": "34", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "MinuteLibrarian", "body": "No I never reopened the claim. When I called they just pushed the weeks through. \n\nGood luck!! You may end up waiting longer than they say, so just be prepared for that.", "created_utc": "1612454343.0", "edited": "False", "id": "gm006pm", "is_submitter": "False", "link_id": "t3_l2oqc7", "parent_id": "t1_glzzrzd", "score": "2", "subreddit": "Unemployment", "subreddit_id": "t5_2qvh2"}, {"author": "MinuteLibrarian", "body": "Yes I did, but I ended up calling them. I had to call twice, once to have them free up my weeks to certify and another to get them to push my payments through from pending. I was paid this morning.\n\nCall 1-833-978-2511 and follow the options. It might take a couple of tries to get into the hold queue. I would recommend calling either first thing in the morning or after 5 pm. I ended up waiting about 40 minutes each time but once I got through to someone they fixed it immediately.", "created_utc": "1612454034.0", "edited": "False", "id": "glzzeaz", "is_submitter": "False", "link_id": "t3_l2oqc7", "parent_id": "t1_glzof9e", "score": "2", "subreddit": "Unemployment", "subreddit_id": "t5_2qvh2"}, {"author": "MinuteLibrarian", "body": "pick one number and keep calling it as long as you have patience. eventually you'll be put in the hold queue. If it doesn't work now try again after 5pm", "created_utc": "1612390300.0", "edited": "False", "id": "glwzsi3", "is_submitter": "False", "link_id": "t3_lbsrc0", "parent_id": "t1_glww20b", "score": "2", "subreddit": "Unemployment", "subreddit_id": "t5_2qvh2"}, {"author": "MinuteLibrarian", "body": "yeah I wish they'd just say they were booked on calls before they play the long message. Just keep calling until you get through to a hold.", "created_utc": "1612377608.0", "edited": "False", "id": "glw4th2", "is_submitter": "False", "link_id": "t3_lbsrc0", "parent_id": "t1_glw4mfs", "score": "6", "subreddit": "Unemployment", "subreddit_id": "t5_2qvh2"}, {"author": "MinuteLibrarian", "body": "You're right about Russian in the old SSRs. My parents grew up in Soviet Armenia and they all learned three languages--their native Armenian, required Russian, and then a third language they could pick (my dad picked French and my mom picked English). \n\nArmenia gained independence from the USSR in 1991 but Russian is still very prevalent there. I think everyone still learns it in school, while learning English is totally optional and, if one did choose to learn it, would probably be learned alongside Russian and not as a replacement. Living or working in Armenia would be difficult without some knowledge of Russian, despite the fact that Armenians are very proud of their native language. I visited Armenia with my parents two years ago and definitely felt a little lost at times because I know only tidbits of Russian vocab and everyone there is basically a native speaker.", "created_utc": "1612369876.0", "edited": "False", "id": "glvlb2e", "is_submitter": "False", "link_id": "t3_lb8jvt", "parent_id": "t3_lb8jvt", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "MinuteLibrarian", "body": "Common issue. Same thing happened to me. I finally called on 1/28 and had them open up a bunch of weeks to certify and I certified that night. Normally, like you said, the money is transferred overnight but it's been days. I'm calling again this morning to see if they can push it through.", "created_utc": "1612368807.0", "edited": "False", "id": "glvior9", "is_submitter": "False", "link_id": "t3_lbpp6o", "parent_id": "t3_lbpp6o", "score": "1", "subreddit": "Unemployment", "subreddit_id": "t5_2qvh2"}, {"author": "MinuteLibrarian", "body": "Yes, they have gone away!", "created_utc": "1612126301.0", "edited": "False", "id": "glioksx", "is_submitter": "True", "link_id": "t3_kn80oj", "parent_id": "t1_glapch9", "score": "1", "subreddit": "COVID19positive", "subreddit_id": "t5_2hnraa"}, {"author": "MinuteLibrarian", "body": "They said they were willing to drive anywhere in the US to drop her off!", "created_utc": "1611935174.0", "edited": "False", "id": "gl8ymdv", "is_submitter": "False", "link_id": "t3_l7m3ye", "parent_id": "t1_gl8tqjo", "score": "3", "subreddit": "dogs", "subreddit_id": "t5_2qhhk"}, {"author": "MinuteLibrarian", "body": "Were you able to get your payments or are they still pending?", "created_utc": "1611889842.0", "edited": "False", "id": "gl6prh9", "is_submitter": "False", "link_id": "t3_l7f2wc", "parent_id": "t1_gl6jrcl", "score": "1", "subreddit": "Unemployment", "subreddit_id": "t5_2qvh2"}, {"author": "MinuteLibrarian", "body": "I felt the exact same way and thought there was no point in putting myself through the headache of calling. But I also read this horrible article that basically crunched the numbers on how long it'll take EDD to manually clear every issue with every claim at the rate they've set themselves (half an hour per issue) and the estimated time it would take for them to finish it was.....342 years. THREE HUNDRED YEARS. I have this nasty fear that this will drag on for weeks and weeks and then they'll announce they can't pay out because of the money lost to fraud.", "created_utc": "1611885828.0", "edited": "False", "id": "gl6gzhc", "is_submitter": "False", "link_id": "t3_l7f2wc", "parent_id": "t1_gl6g8fr", "score": "4", "subreddit": "Unemployment", "subreddit_id": "t5_2qvh2"}, {"author": "MinuteLibrarian", "body": "Yeah, some level of system failure is understandable. Not a single part of our infrastructure was prepared for COVID. But the issues the audit found are absolutely shocking, and a lot of them can't be blamed solely on the pandemic. And just as you said we're the ones being screwed royally. If they'd asked me to verify my ID I would at least have SOME feeling that my account was even being looked at. But they haven't even asked me for that.", "created_utc": "1611885663.0", "edited": "False", "id": "gl6gmiz", "is_submitter": "False", "link_id": "t3_l7f2wc", "parent_id": "t1_gl6g92q", "score": "3", "subreddit": "Unemployment", "subreddit_id": "t5_2qvh2"}, {"author": "MinuteLibrarian", "body": "What irritates me is they kept announcing deadlines and missing them and then acting like the problem is minimal when it actually affects a large majority of claimants. I can't believe the level of corruption that must exist in that department.", "created_utc": "1611885078.0", "edited": "False", "id": "gl6fbzo", "is_submitter": "False", "link_id": "t3_l7f2wc", "parent_id": "t1_gl6f2aj", "score": "8", "subreddit": "Unemployment", "subreddit_id": "t5_2qvh2"}, {"author": "MinuteLibrarian", "body": "Exactly! It feels like it's never going to change! Every time I log in I just get so angry all over again.", "created_utc": "1611884579.0", "edited": "False", "id": "gl6e8ee", "is_submitter": "False", "link_id": "t3_l7c6i2", "parent_id": "t1_gl6e4iu", "score": "2", "subreddit": "Unemployment", "subreddit_id": "t5_2qvh2"}, {"author": "MinuteLibrarian", "body": "I still have it. I'm on fed-ed and had a claim balance. They didn't ask me for any verification and I've been staring at the reopen claim button for weeks.", "created_utc": "1611883481.0", "edited": "False", "id": "gl6brxj", "is_submitter": "False", "link_id": "t3_l7c6i2", "parent_id": "t3_l7c6i2", "score": "2", "subreddit": "Unemployment", "subreddit_id": "t5_2qvh2"}, {"author": "MinuteLibrarian", "body": "Hang in there, hope your pup is doing okay! My dog is a german shepherd and 10 months old and does not distinguish between food, trash, or toxic substances as she thinks that all of those things belong in her mouth. If I go after her she'll think it's the best game in the world and swallow whatever she's been hiding. She pooped out a series of rocks once. The poop was more rock than it was poop. I have lived in fear of her ingesting something that's going to put in her surgery. It hasn't happened so far. I'm aware of the danger, but she's also proved that puppies are resilient little assholes. They eat a lot of dangerous stuff and most of the time will pass it without any problems.", "created_utc": "1611873437.0", "edited": "False", "id": "gl5oq57", "is_submitter": "False", "link_id": "t3_l757tn", "parent_id": "t3_l757tn", "score": "2", "subreddit": "dogs", "subreddit_id": "t5_2qhhk"}, {"author": "MinuteLibrarian", "body": "Not sure what else we can do. I hate the idea of spending hours on the phone making hundreds of calls just to get through to someone who tells me to wait. As if I'm not angry enough.", "created_utc": "1611808366.0", "edited": "False", "id": "gl1s3ix", "is_submitter": "False", "link_id": "t3_l69z3q", "parent_id": "t1_gkzcj15", "score": "1", "subreddit": "Unemployment", "subreddit_id": "t5_2qvh2"}, {"author": "MinuteLibrarian", "body": "Omg where do I @ Royal Canin for my check??? My dog eats nothing but Royal Canin hydrolyzed because of her digestive issues. Initially I considered a boutique food in case her problems were from common dog food allergies but I am SO glad I decided against it. If they're not going to cut me a check can I at least have a coupon or something for her $100/bag kibble?? Everyone who finds out she's on Royal Canin side eyes me like I'm feeding her processed cardboard or something.", "created_utc": "1611807542.0", "edited": "1611817563.0", "id": "gl1qkoh", "is_submitter": "False", "link_id": "t3_l6bosw", "parent_id": "t1_gl08mwc", "score": "8", "subreddit": "dogs", "subreddit_id": "t5_2qhhk"}, {"author": "MinuteLibrarian", "body": "Nah, they're still hanging up on me. I might try again tomorrow in the morning.", "created_utc": "1611775388.0", "edited": "False", "id": "gkzl9d0", "is_submitter": "False", "link_id": "t3_l69z3q", "parent_id": "t1_gkz543i", "score": "2", "subreddit": "Unemployment", "subreddit_id": "t5_2qvh2"}, {"author": "MinuteLibrarian", "body": "I'm just not sure how to navigate that because I lost one of my jobs in March but still work part-time at my second one and there's no way to specify that through the re-open claim question prompts. I thought I'd save myself the confusion and just wait.", "created_utc": "1611770109.0", "edited": "False", "id": "gkz7ioy", "is_submitter": "False", "link_id": "t3_l5y60i", "parent_id": "t1_gkz5iow", "score": "1", "subreddit": "Unemployment", "subreddit_id": "t5_2qvh2"}, {"author": "MinuteLibrarian", "body": "What do you suppose I should say if I still have a claim balance but am stuck on re-open claim?", "created_utc": "1611769740.0", "edited": "False", "id": "gkz6dui", "is_submitter": "False", "link_id": "t3_l5vnf9", "parent_id": "t3_l5vnf9", "score": "1", "subreddit": "Unemployment", "subreddit_id": "t5_2qvh2"}, {"author": "MinuteLibrarian", "body": "I'm on extension, still have a claim balance and haven't been paid since mid-December. Account still says reopen claim. At this point I have no clue what the updates are doing. They're hanging up on me. I have no idea what to do besides wait.\n\nHonestly I think they're trying to stall this as long as possible before making the announcement that they can't pay out because of all the fraud and too bad California. They froze accounts to \"control\" fraud and review them manually but one estimate said that to get through the millions of accounts that need review, it would take them over 300 years at this current pace. And they're still answering only a minuscule percentage of calls they receive. I don't know why they think this is in any way sustainable. They need to admit they don't know what the fuck they're doing so someone can step in and make decisions for them.", "created_utc": "1611767655.0", "edited": "False", "id": "gkyzwam", "is_submitter": "False", "link_id": "t3_l5y60i", "parent_id": "t3_l5y60i", "score": "1", "subreddit": "Unemployment", "subreddit_id": "t5_2qvh2"}, {"author": "MinuteLibrarian", "body": "God this makes me fume. What a load of bureaucratic bullshit. I hope they get dragged because of this.", "created_utc": "1611766652.0", "edited": "False", "id": "gkywwrn", "is_submitter": "False", "link_id": "t3_l5xxrv", "parent_id": "t1_gkyvnhn", "score": "3", "subreddit": "Unemployment", "subreddit_id": "t5_2qvh2"}, {"author": "MinuteLibrarian", "body": "Is that allowed?? How can they collect all that money back if people were given the impression that they were eligible for that money? I can't imagine this will end without a huge lawsuit. Does anyone suppose the only reason they're gonna hit people with these overpayment notices is to try and make up for all the money they lost for fraud?", "created_utc": "1611765189.0", "edited": "False", "id": "gkysk15", "is_submitter": "False", "link_id": "t3_l5xxrv", "parent_id": "t1_gkx8t7t", "score": "5", "subreddit": "Unemployment", "subreddit_id": "t5_2qvh2"}, {"author": "MinuteLibrarian", "body": "Do you mind if I ask what questions or prompts were given to you when you reopened your claim? I really don't want to have to dig up pay stubs again", "created_utc": "1611678841.0", "edited": "False", "id": "gku75r0", "is_submitter": "False", "link_id": "t3_l4s423", "parent_id": "t1_gkrsmxj", "score": "1", "subreddit": "Unemployment", "subreddit_id": "t5_2qvh2"}, {"author": "MinuteLibrarian", "body": "Gaslighting is really the word for it. Like sure let's just act like nothing is happening. No one has been paid in weeks but one look at the EDD twitter account just makes it look like it's because people \"don't know\" how to use IDme", "created_utc": "1611594515.0", "edited": "False", "id": "gkq5fel", "is_submitter": "False", "link_id": "t3_l4iufg", "parent_id": "t1_gkovvtf", "score": "1", "subreddit": "Unemployment", "subreddit_id": "t5_2qvh2"}, {"author": "MinuteLibrarian", "body": "My account has a balance and definitely hasn't been looked at yet :( I think we would all feel so much better if SOMEONE from the dept would explain what's going on in detail so we don't have to scavenge reddit for clues to put together the world's shittiest puzzle", "created_utc": "1611594435.0", "edited": "False", "id": "gkq58t6", "is_submitter": "False", "link_id": "t3_l4iufg", "parent_id": "t1_gkotmoq", "score": "1", "subreddit": "Unemployment", "subreddit_id": "t5_2qvh2"}, {"author": "MinuteLibrarian", "body": "Same here. Still have a remaining balance, fed-ed extension, haven't been able to certify since 12/26.  Reopen claim button still there, I never touched it. I never got a fraud alert or notice of account suspension or any ID me link.", "created_utc": "1611594362.0", "edited": "False", "id": "gkq52uk", "is_submitter": "False", "link_id": "t3_l4iufg", "parent_id": "t3_l4iufg", "score": "1", "subreddit": "Unemployment", "subreddit_id": "t5_2qvh2"}, {"author": "MinuteLibrarian", "body": "Can't be sure, but I don't see how reporting your income would make any difference. I started reporting income a few months ago when I went back to part-time but it didn't cause any delays. I thought the way they deduct income from your weekly payment was automatic. More likely your issue with the pending certification just has to do with the larger problem they haven't fixed yet.\n\nIdk about doing ID me voluntarily. they always said to wait for a link.", "created_utc": "1611594003.0", "edited": "False", "id": "gkq49p3", "is_submitter": "False", "link_id": "t3_l4rtuk", "parent_id": "t3_l4rtuk", "score": "5", "subreddit": "Unemployment", "subreddit_id": "t5_2qvh2"}, {"author": "MinuteLibrarian", "body": "I am fine and pretty much fully recovered! Exercise is a little more tiring than usual but it's been getting better every day and I'm almost back at 100%. [I posted a full timeline here](https://www.reddit.com/r/COVID19positive/comments/kojjc9/my_detailed_covid_timeline_overweight_pcos_25f/)", "created_utc": "1611591832.0", "edited": "False", "id": "gkpz69o", "is_submitter": "True", "link_id": "t3_klat8u", "parent_id": "t1_gkpxue3", "score": "1", "subreddit": "COVID19positive", "subreddit_id": "t5_2hnraa"}, {"author": "MinuteLibrarian", "body": "I'm still stuck on reopen claim with a 2020 claim year. Nothing has changed for me since December. Haven't been paid since December 17th. I don't know what to do at this point it's so frustrating that no one higher up in government is really talking about it.", "created_utc": "1611589922.0", "edited": "False", "id": "gkpuioj", "is_submitter": "False", "link_id": "t3_l4lfk3", "parent_id": "t3_l4lfk3", "score": "5", "subreddit": "Unemployment", "subreddit_id": "t5_2qvh2"}, {"author": "MinuteLibrarian", "body": "Looks like they just updated it to say maintenance is still going on until 2pm. I'm so tired lmao", "created_utc": "1611431502.0", "edited": "False", "id": "gkfny0q", "is_submitter": "False", "link_id": "t3_l3hxzk", "parent_id": "t3_l3hxzk", "score": "3", "subreddit": "Unemployment", "subreddit_id": "t5_2qvh2"}, {"author": "MinuteLibrarian", "body": "Is there anyone else who wasn't asked to verify anything but still doesn't have their claim updated?? They never hit me with a fraud notice or ID verification but my claim is still stuck on the reopen glitch.", "created_utc": "1611334532.0", "edited": "False", "id": "gk7abkg", "is_submitter": "False", "link_id": "t3_l2oqc7", "parent_id": "t3_l2oqc7", "score": "2", "subreddit": "Unemployment", "subreddit_id": "t5_2qvh2"}, {"author": "MinuteLibrarian", "body": "Is there anyone else who wasn't asked to verify anything but still doesn't have their claim updated?? They never hit me with a fraud notice or ID verification but my claim is still stuck on the reopen glitch.", "created_utc": "1611334465.0", "edited": "False", "id": "gk7a2yg", "is_submitter": "False", "link_id": "t3_l2j8lj", "parent_id": "t3_l2j8lj", "score": "4", "subreddit": "Unemployment", "subreddit_id": "t5_2qvh2"}, {"author": "MinuteLibrarian", "body": "I saw the one with the golden and it didn't seem super concerning. The golden bared his teeth every time his owner clipped a nail but didn't snarl or anything and went right back to a puppy face immediately afterward.", "created_utc": "1611161190.0", "edited": "False", "id": "gjykdvq", "is_submitter": "False", "link_id": "t3_l12w5y", "parent_id": "t1_gjybw9g", "score": "2", "subreddit": "dogs", "subreddit_id": "t5_2qhhk"}, {"author": "MinuteLibrarian", "body": "Thanks for sharing!! I hope it goes through for you! This gives me some comfort that they're still fixing this glitch. I'm been avoiding calling because I know I'll get so frustrated that I'll start crying.", "created_utc": "1611160509.0", "edited": "False", "id": "gjyiv1e", "is_submitter": "False", "link_id": "t3_l1abbj", "parent_id": "t1_gjygrhe", "score": "4", "subreddit": "Unemployment", "subreddit_id": "t5_2qvh2"}, {"author": "MinuteLibrarian", "body": "So I'm assuming I need to start saving up for that since that money will still be owed in taxes? Although I'm not sure how I'm supposed to save up for it considering the current situation.", "created_utc": "1611159451.0", "edited": "False", "id": "gjygkau", "is_submitter": "False", "link_id": "t3_l1c8gq", "parent_id": "t1_gjyg8ek", "score": "1", "subreddit": "Unemployment", "subreddit_id": "t5_2qvh2"}, {"author": "MinuteLibrarian", "body": "Still stuck on the reopen claim glitch here. I'm on fed-ed extension, no new date, still have a balance, and have received nothing about verifying my identity.", "created_utc": "1611158796.0", "edited": "False", "id": "gjyf62y", "is_submitter": "False", "link_id": "t3_l16ucz", "parent_id": "t3_l16ucz", "score": "3", "subreddit": "Unemployment", "subreddit_id": "t5_2qvh2"}, {"author": "MinuteLibrarian", "body": "Not even pending and nothing has changed with my account. They never asked me to verify or anything, I'm on fed-ed extension and still stuck on \"reopen claim.\" they haven't even updated the benefit year.", "created_utc": "1611158271.0", "edited": "False", "id": "gjye2ob", "is_submitter": "False", "link_id": "t3_l1abbj", "parent_id": "t3_l1abbj", "score": "3", "subreddit": "Unemployment", "subreddit_id": "t5_2qvh2"}, {"author": "MinuteLibrarian", "body": "Still stuck here! They haven't even changed the claim year to 2021. I've exhausted PEUC and I'm on fed-ed extension so I'm getting nervous that that makes a difference with how long it takes. My brother's was updated a few days ago but he wasn't on fed-ed.", "created_utc": "1610895400.0", "edited": "False", "id": "gjlez1w", "is_submitter": "False", "link_id": "t3_kyxvns", "parent_id": "t3_kyxvns", "score": "1", "subreddit": "Unemployment", "subreddit_id": "t5_2qvh2"}, {"author": "MinuteLibrarian", "body": "Thank you for the suggestion! This is definitely on the list to try next, I just haven't had the energy or the patience to attempt it yet. It's definitely a long-haul solution.", "created_utc": "1610867104.0", "edited": "False", "id": "gjjyy73", "is_submitter": "True", "link_id": "t3_kyg7l1", "parent_id": "t1_gjgtbal", "score": "2", "subreddit": "puppy101", "subreddit_id": "t5_2rw7o"}, {"author": "MinuteLibrarian", "body": "It is definitely super frustrating! If anything works for you, please let me know as well. I know people whose dogs get up between like 9-11am and I'm just so very jealous!\n\nI'll try pushing back her breakfast a little later so she doesn't associate waking up with immediately being fed.", "created_utc": "1610867051.0", "edited": "False", "id": "gjjyvw6", "is_submitter": "True", "link_id": "t3_kyg7l1", "parent_id": "t1_gjgq4zq", "score": "2", "subreddit": "puppy101", "subreddit_id": "t5_2rw7o"}, {"author": "MinuteLibrarian", "body": "This usually stops as they get older! For a 3-4 month dog it's pretty normal. If it persists past an age where they're normally supposed to be able to hold it at night then some schedule intervention might be necessary. My pup can defo hold it for a pretty long time, but it's just weird that I haven't been able to shift her bowel schedule at all from that early in the morning.", "created_utc": "1610866871.0", "edited": "False", "id": "gjjynxt", "is_submitter": "True", "link_id": "t3_kyg7l1", "parent_id": "t1_gjfvchs", "score": "2", "subreddit": "puppy101", "subreddit_id": "t5_2rw7o"}, {"author": "MinuteLibrarian", "body": "She gets two meals per day, one in the morning at around 7 and another in the evening at around 5. I feed her the same amount both times but I can try giving her less in the evening and see what happens!", "created_utc": "1610866725.0", "edited": "False", "id": "gjjyhgj", "is_submitter": "True", "link_id": "t3_kyg7l1", "parent_id": "t1_gjfyuxp", "score": "2", "subreddit": "puppy101", "subreddit_id": "t5_2rw7o"}, {"author": "MinuteLibrarian", "body": "It doesn't rain very much where I live, but on rainy days we bring her inside. She doesn't poop inside and since she's gotten used to spending some time alone outside she doesn't mind being left alone inside anymore.", "created_utc": "1610866664.0", "edited": "False", "id": "gjjyeqk", "is_submitter": "False", "link_id": "t3_kye5kg", "parent_id": "t1_gjiquy3", "score": "1", "subreddit": "Dogtraining", "subreddit_id": "t5_2r067"}, {"author": "MinuteLibrarian", "body": "It's possible it could be separation anxiety! Not all dogs will cry or make a commotion when left alone, many just have a pooping or peeing problem and total silence otherwise. Since your pup is so young, it's likely it's not set in stone and he's just uncomfortable with being left alone since he's so little. I'd try some basic separation anxiety training methods and see if it helps.\n\nIf not, don't feel bad about having to leave the puppy outside for a few hours. I would just gate off an area and puppy-proof it (no rocks or escape routes, etc) and give the pup some shelter and toys and some activities if possible. Make leaving and coming back a normal, quiet event and try giving your pup a really good treat right before you leave just to condition him to look forward to it.\n\nOur puppy was very uncomfortable with being left alone at that age. She never had a pooping problem, but she would scream bloody murder if I left the house without her. The whining was absolutely horrible. We started leaving her outside for a couple hours at a time and she actually does much better outside. She has a little enclosure with some of her favorite toys and chews and has stopped complaining when we leave the house. She'll watch us go and then takes a nap on her lawn chair or chews on a toy or watches people go by. Your puppy is so young that my best recommendation is to try different things and see what works best.\n\nAlso: edit to say if you haven't already, try crossposting to r/puppy101 where there are plenty of people who have had this same issue and have tips to give out!", "created_utc": "1610791641.0", "edited": "False", "id": "gjfvc3p", "is_submitter": "False", "link_id": "t3_kye5kg", "parent_id": "t3_kye5kg", "score": "3", "subreddit": "Dogtraining", "subreddit_id": "t5_2r067"}, {"author": "MinuteLibrarian", "body": "if it helps at all, a growing number of psychologists don't believe laziness is really a thing. Laziness is more likely to be the effect of untreated SOMETHING, whether that thing is depression or ADHD or something else. You're right for seeking an answer for things you struggle with. It's not particularly normal to be chronically unmotivated.", "created_utc": "1610639441.0", "edited": "False", "id": "gj8kj26", "is_submitter": "False", "link_id": "t3_kx5ej0", "parent_id": "t3_kx5ej0", "score": "88", "subreddit": "ADHD", "subreddit_id": "t5_2qnwb"}, {"author": "MinuteLibrarian", "body": "oh my goodness yes this is exactly how I feel!! Word for word!! When I got my assessment it was a total bummer because I was so desperate for an answer to these issues I've had my whole life. I thought I'd sit with it too and see how I felt. It's been a few months now and the more time goes by the less confident I feel about my psychologist's assessment.\n\nJust like you said, I am also nervous about completely dismissing the diagnosis of a professional in favor of visceral feelings I have, but I already know that adult ADHD is hard to diagnose ANYWAY and women are misdiagnosed so often! I just don't think my performance on the test is any good indicator of the YEARS of attention issues I have behind me. I have always been good at tests and I love puzzles besides. In high school the only thing that saved my grades from tanking was the tests since I did none of the work. AND it's exactly as you said, a clinical setting for testing with no distractions, and it's a short-term task with CLEAR parameters. Meanwhile at home I can't start any of the tasks I set for myself and if I do start them I leave them unfinished. Long-term tasks with multiple goals are impossible. I completely understand that chronic depression can have effects on cognition and attention but my depression comes in episodes and even when I am feeling okay, I STILL have no executive function to speak of. It's so frustrating. I just can't help but feel like something is missing. \n\nI definitely will be seeking a second opinion as soon as I'm able. In the meantime I'm going to ask a psychiatrist about depression medication that's also used off-label to treat ADHD. if it helps my executive function at least that'll be some evidence to present at the next assessment I can take.", "created_utc": "1610520264.0", "edited": "False", "id": "gj38e9j", "is_submitter": "True", "link_id": "t3_kr8eix", "parent_id": "t1_gj24n90", "score": "1", "subreddit": "ADHD", "subreddit_id": "t5_2qnwb"}, {"author": "MinuteLibrarian", "body": "I'm on fed-ed extension and still waiting. I have a balance still and claim year is still 2020. Hoping it updates soon.", "created_utc": "1610439972.0", "edited": "False", "id": "gizd3uc", "is_submitter": "False", "link_id": "t3_kvlszp", "parent_id": "t3_kvlszp", "score": "0", "subreddit": "Unemployment", "subreddit_id": "t5_2qvh2"}, {"author": "MinuteLibrarian", "body": "I'm on PEUC, but I still had a claim balance and wasn't even paid for the weeks of 12/19 and 12/26. Account still says not paid for those weeks and has an option to reopen the claim. I think I'm just gonna wait a few more days and hope it gets fixed. It's just weird that it's been two site updates so far and neither of them fixed anything lol", "created_utc": "1610383232.0", "edited": "False", "id": "giwcy4s", "is_submitter": "False", "link_id": "t3_kv4805", "parent_id": "t3_kv4805", "score": "2", "subreddit": "Unemployment", "subreddit_id": "t5_2qvh2"}, {"author": "MinuteLibrarian", "body": "Same, mine still says not paid for those weeks. Account still says \"re-open your claim\" too but I think i'm gonna sit tight until they fix it on their end", "created_utc": "1610350117.0", "edited": "False", "id": "giupn0f", "is_submitter": "False", "link_id": "t3_kuw7vk", "parent_id": "t1_giunngz", "score": "5", "subreddit": "Unemployment", "subreddit_id": "t5_2qvh2"}, {"author": "MinuteLibrarian", "body": "Yes thank you for saying this!!! Twice now I've had unleashed dogs run up to my puppy during a walk. She's way more like the dalmatian in your story: excited to play and will totally ignore recall and may not understand other dogs being reactive. I would never keep her off-leash because her attention is totally scattered and she would never listen to my recall over the chance to play with a dog, even if that dog posed a danger to her. She's been lucky to have very few bad experiences with dogs but thanks to this she assumes all dogs are friendly and can't read when another dog is telling her not to get near or that they don't want to play. Until I can get her recall up to par, she can't have outings off leash. It's too dangerous. Luckily both dogs that came up to her WERE friendly, but I'm afraid for the day that may not be the case.", "created_utc": "1610310466.0", "edited": "False", "id": "gisnjiw", "is_submitter": "False", "link_id": "t3_ku9bsk", "parent_id": "t3_ku9bsk", "score": "3", "subreddit": "Dogtraining", "subreddit_id": "t5_2r067"}, {"author": "MinuteLibrarian", "body": "oh my goodness haha my girl is way smaller. she's maybe just over 50 pounds. apartment-sized lol", "created_utc": "1610182201.0", "edited": "False", "id": "gin1uwq", "is_submitter": "False", "link_id": "t3_kssq9j", "parent_id": "t1_gijog72", "score": "1", "subreddit": "germanshepherds", "subreddit_id": "t5_2s83q"}, {"author": "MinuteLibrarian", "body": "My GSD looks EXACTLY like yours, down to the size and the eye color and the white patch on the chest!", "created_utc": "1610117738.0", "edited": "False", "id": "gijngir", "is_submitter": "False", "link_id": "t3_kssq9j", "parent_id": "t3_kssq9j", "score": "1", "subreddit": "germanshepherds", "subreddit_id": "t5_2s83q"}, {"author": "MinuteLibrarian", "body": "Does anyone know if I'll receive backpay for the weeks of 12/19 and 12/26 if they were never paid out? I have the maximum benefits paid notice like everyone else but I still have a claim balance and was on PUA", "created_utc": "1610116927.0", "edited": "False", "id": "gijlx61", "is_submitter": "False", "link_id": "t3_ko7nyt", "parent_id": "t3_ko7nyt", "score": "1", "subreddit": "Edd", "subreddit_id": "t5_2qn3d"}, {"author": "MinuteLibrarian", "body": "What if I never even got paid for the weeks of 12/19 and 12/26", "created_utc": "1610116498.0", "edited": "False", "id": "gijl4jl", "is_submitter": "False", "link_id": "t3_ko7nyt", "parent_id": "t1_gijht54", "score": "1", "subreddit": "Edd", "subreddit_id": "t5_2qn3d"}, {"author": "MinuteLibrarian", "body": "Thank you! I will try and look into this. I'm not sure if the clinic I went to specialized in adult ADHD. \n\nI had a similar problem with my psych. When I was young school was very easy for me but once I got to an age where I had to actually study and learn on my own my performance dropped significantly and school became a source of anxiety for me. I was still passing though and I think my psych took that to mean that it was fine. But I don't see how failing school would be the only indicator of ADHD. School was previously a breeze for me because I was ahead of my peers and then when I got older suddenly became difficult as soon as it required more focus from me. Seemed like a red flag to me.\n\nLike in high school for instance I didn't turn in over half the homework I was assigned because I just couldn't get myself to do it.", "created_utc": "1609892178.0", "edited": "False", "id": "gi8v4tp", "is_submitter": "True", "link_id": "t3_kr8eix", "parent_id": "t1_gi8nakt", "score": "2", "subreddit": "ADHD", "subreddit_id": "t5_2qnwb"}, {"author": "MinuteLibrarian", "body": "This cough just will not quit. All my other symptoms are gone. Has anyone had their cough improve after a while?", "created_utc": "1609640362.0", "edited": "False", "id": "ghw1p6p", "is_submitter": "False", "link_id": "t3_knngqk", "parent_id": "t3_knngqk", "score": "1", "subreddit": "COVID19positive", "subreddit_id": "t5_2hnraa"}, {"author": "MinuteLibrarian", "body": "Oh I'm glad I could help at all! Hang in there!! I hope you have an easy and speedy recovery.", "created_utc": "1609572834.0", "edited": "False", "id": "ght4l79", "is_submitter": "True", "link_id": "t3_kojjc9", "parent_id": "t1_ghseycz", "score": "1", "subreddit": "COVID19positive", "subreddit_id": "t5_2hnraa"}, {"author": "MinuteLibrarian", "body": "Yes, I thought that too. So it is possible that I really did have an incubation period of 2 weeks or even a little longer. While this isn't common, it does happen. It's also possible that I was not infected from my brother directly but from a surface he touched or ate on or something. We do live in the same house after all so surface contamination seems possible. Plus to a certain extent, the air in the house is recycled and we were still using the same hallways and the same kitchen even if I was never in a room with him at the same time.", "created_utc": "1609544798.0", "edited": "False", "id": "ghrv3fj", "is_submitter": "True", "link_id": "t3_kojjc9", "parent_id": "t1_ghrt3ue", "score": "1", "subreddit": "COVID19positive", "subreddit_id": "t5_2hnraa"}, {"author": "MinuteLibrarian", "body": "I am feeling much, much better! I'll be making an update post in a few days with a complete timeline :)", "created_utc": "1609426966.0", "edited": "False", "id": "ghlze7x", "is_submitter": "True", "link_id": "t3_klat8u", "parent_id": "t1_ghlfc68", "score": "1", "subreddit": "COVID19positive", "subreddit_id": "t5_2hnraa"}, {"author": "MinuteLibrarian", "body": "HELL YEAH!! I also heated up some leftover pizza and could smell and taste it too!! I could cry from happiness", "created_utc": "1609426265.0", "edited": "False", "id": "ghly88r", "is_submitter": "False", "link_id": "t3_knp6ve", "parent_id": "t3_knp6ve", "score": "10", "subreddit": "COVID19positive", "subreddit_id": "t5_2hnraa"}, {"author": "MinuteLibrarian", "body": "Yes that's exactly it! Advil has helped I'm just so confused as to why this symptom would newly show up after the rest have gotten better.", "created_utc": "1609355770.0", "edited": "False", "id": "ghiywib", "is_submitter": "False", "link_id": "t3_kmzmhm", "parent_id": "t1_ghiwm7b", "score": "2", "subreddit": "COVID19positive", "subreddit_id": "t5_2hnraa"}, {"author": "MinuteLibrarian", "body": "Day 8 and almost all symptoms are gone, I'm feeling better overall but this is the second morning I've woken up with a horrible headache. It's like this terrible pressure behind my eyes I can't even look up or around. Has anyone else had this?", "created_utc": "1609353491.0", "edited": "False", "id": "ghiu9j2", "is_submitter": "False", "link_id": "t3_kmzmhm", "parent_id": "t3_kmzmhm", "score": "3", "subreddit": "COVID19positive", "subreddit_id": "t5_2hnraa"}, {"author": "MinuteLibrarian", "body": "I'm on day 7 of symptoms so far and I've had the runs for 3 or 4 days at least. It's not as bad as it was on the first day and I'm not getting up in the middle of the night with it or anything but it's been the most persistent symptom so far.", "created_utc": "1609308988.0", "edited": "False", "id": "ghh536y", "is_submitter": "False", "link_id": "t3_kmbnsj", "parent_id": "t1_ghgxnhr", "score": "2", "subreddit": "COVID19positive", "subreddit_id": "t5_2hnraa"}, {"author": "MinuteLibrarian", "body": "Not necessarily, but there isn't much of a way to know how it will progress. Plenty of people get through without major symptoms or loss of taste, so it doesn't necessarily mean you'll get worse.", "created_utc": "1609308901.0", "edited": "False", "id": "ghh4z54", "is_submitter": "False", "link_id": "t3_kmbnsj", "parent_id": "t1_ghfpph8", "score": "1", "subreddit": "COVID19positive", "subreddit_id": "t5_2hnraa"}, {"author": "MinuteLibrarian", "body": "Mine have stayed 98-100. If it dips lower than 95 it's best to keep an eye out and call a doctor. Lower than 92 is probably ER time", "created_utc": "1609308771.0", "edited": "False", "id": "ghh4syx", "is_submitter": "False", "link_id": "t3_kmbnsj", "parent_id": "t1_ghe8ree", "score": "1", "subreddit": "COVID19positive", "subreddit_id": "t5_2hnraa"}, {"author": "MinuteLibrarian", "body": "oh congrats!!! I'm sure it'll be a matter of time until it all comes back. I'm getting so impatient. I know I've been lucky to have such a mild case but I'm just so tired of being sick. I just want things to go back to normal.", "created_utc": "1609308291.0", "edited": "False", "id": "ghh45va", "is_submitter": "True", "link_id": "t3_kmrkjw", "parent_id": "t1_ghh3ke6", "score": "3", "subreddit": "COVID19positive", "subreddit_id": "t5_2hnraa"}, {"author": "MinuteLibrarian", "body": "Some people get it over it quickly with minimal symptoms, it doesn't necessarily mean there's a drop off where you get worse. If you get a PCR test it can come back positive for up to 3 months even if you've recovered. CDC is now saying that you are no longer contagious 10 days after symptoms AND if you've gone 24 hours fever-free. Sometimes the rapid antigen test will come back negative after that point since symptoms aren't as severe. \n\nHonestly I still tell people the 14 days is probably safer than 10 regardless. I didn't have symptoms until 15 days after my brother tested positive and I had a negative test at that time too.", "created_utc": "1609301130.0", "edited": "False", "id": "ghgt4tz", "is_submitter": "False", "link_id": "t3_kmtico", "parent_id": "t3_kmtico", "score": "1", "subreddit": "COVID19positive", "subreddit_id": "t5_2hnraa"}, {"author": "MinuteLibrarian", "body": "haha yes same! My family and friends keep offering to get me good food and I'm like?? forget it. it's just depressing if i can barely taste anything lol just give me nutritionally dense soup better eat as much health shit as I can while it all tastes the same", "created_utc": "1609300552.0", "edited": "False", "id": "ghgs4yn", "is_submitter": "False", "link_id": "t3_kmhy14", "parent_id": "t1_ghfryl9", "score": "2", "subreddit": "COVID19positive", "subreddit_id": "t5_2hnraa"}, {"author": "MinuteLibrarian", "body": "Yesss congratulations! I'm on day 8 and some smell came back today (!!!!!) and things definitely taste more varied than they did yesterday so I'm sure that's improvement!", "created_utc": "1609299787.0", "edited": "False", "id": "ghgqtfl", "is_submitter": "False", "link_id": "t3_kmhy14", "parent_id": "t3_kmhy14", "score": "1", "subreddit": "COVID19positive", "subreddit_id": "t5_2hnraa"}, {"author": "MinuteLibrarian", "body": "I'm so angry all the time lately. I'm on day 7 of symptoms. I think it's just a bunch of things I was otherwise irritated about have snowballed.\n\nthings like: terrible how people are ignoring social distancing rules and putting others in danger, how the US government is handling the pandemic, how my family put me at risk because of their own inaction and ignorance, the fact that no one in the world should be sick with this virus, etc etc. It's just a building frustration for me at how unfair things are and nothing makes me angrier than that. The smallest thing will set me off, just like you said.", "created_utc": "1609294603.0", "edited": "False", "id": "ghghfcc", "is_submitter": "False", "link_id": "t3_kmmhsh", "parent_id": "t3_kmmhsh", "score": "6", "subreddit": "COVID19positive", "subreddit_id": "t5_2hnraa"}, {"author": "MinuteLibrarian", "body": "This has not happened to me personally but I know other people it has happened to!! It's called parosmia, you're definitely not alone in it. It does go away it can just take a little while.", "created_utc": "1609293904.0", "edited": "False", "id": "ghgg3zy", "is_submitter": "True", "link_id": "t3_kmrkjw", "parent_id": "t1_ghgf3dk", "score": "3", "subreddit": "COVID19positive", "subreddit_id": "t5_2hnraa"}, {"author": "MinuteLibrarian", "body": "Oximeter has arrived and my levels are at 99. Needless to say, anxiety has dissipated. I'm so relieved. Thank you so much for your reply!", "created_utc": "1609292756.0", "edited": "False", "id": "ghgdywy", "is_submitter": "True", "link_id": "t3_km72w0", "parent_id": "t1_ghdhlf0", "score": "3", "subreddit": "COVID19positive", "subreddit_id": "t5_2hnraa"}, {"author": "MinuteLibrarian", "body": "Yes I heard that too but I feel like so many people are still having symptoms 10 days in. Couldn't you still be contagious if you're still coughing or sneezing at that point?", "created_utc": "1609250189.0", "edited": "False", "id": "ghe4dpg", "is_submitter": "False", "link_id": "t3_klraau", "parent_id": "t1_ghdj7g5", "score": "2", "subreddit": "COVID19positive", "subreddit_id": "t5_2hnraa"}, {"author": "MinuteLibrarian", "body": "From what I remember, my oxygen levels hover around 99-100 when I am feeling healthy. I'm hoping this bodes well for when I'm sick. So far chest issues haven't been bad enough to cause real alarm. I also have anxiety (clearly) and huge issues with catastrophic thinking. My anxiety often gives me breathing issues so I doubt that's helping. I'm hoping the oximeter arrives early in the mail tomorrow. The line between calm and panic is very very thin right now.", "created_utc": "1609226863.0", "edited": "False", "id": "ghdga3q", "is_submitter": "True", "link_id": "t3_km72w0", "parent_id": "t1_ghdegij", "score": "3", "subreddit": "COVID19positive", "subreddit_id": "t5_2hnraa"}, {"author": "MinuteLibrarian", "body": "Thank you for this <3 I can't think too hard about it taking that long to get better. I'm just really hoping this goes away soon. I did order a pulse oximeter, it should arrive in the mail tomorrow. Just in time too. I've been taking a multivitamin that's full of D3 and an additional one with Vit C and Zinc. I've taken melatonin before for mild insomnia I'll start taking it again. The fatigue hasn't hit me as hard, I've had trouble sleeping if anything.\n\nI've been alternating watching calming youtube vlogs and british bake-off and having a lot of soup and plenty of tea. Just hoping I kick it soon. Thanks again for sharing.", "created_utc": "1609222798.0", "edited": "False", "id": "ghdbkh7", "is_submitter": "True", "link_id": "t3_km72w0", "parent_id": "t1_ghd5kfq", "score": "4", "subreddit": "COVID19positive", "subreddit_id": "t5_2hnraa"}, {"author": "MinuteLibrarian", "body": "My fever was never really high either, it hit 100.9 the first night and then hovered at around a 99 for a couple days. Today I had no fever at all, but this afternoon is when the shortness of breath and pressure started.", "created_utc": "1609222590.0", "edited": "False", "id": "ghdbbd6", "is_submitter": "True", "link_id": "t3_km72w0", "parent_id": "t1_ghd5fz1", "score": "2", "subreddit": "COVID19positive", "subreddit_id": "t5_2hnraa"}, {"author": "MinuteLibrarian", "body": "Thank you for this!! I'm on day 6 and have been combing this subreddit for some hope :(", "created_utc": "1609217392.0", "edited": "False", "id": "ghd425f", "is_submitter": "False", "link_id": "t3_km498v", "parent_id": "t3_km498v", "score": "1", "subreddit": "COVID19positive", "subreddit_id": "t5_2hnraa"}, {"author": "MinuteLibrarian", "body": "I didn't have symptoms until 15 days after exposure. I'd wait a full 2 weeks to see if symptoms develop. Getting tested that early may not be accurate. I tested negative about ten days ago but am sick with COVID right now. I had another test come back positive two days ago.", "created_utc": "1609217303.0", "edited": "False", "id": "ghd3x5s", "is_submitter": "False", "link_id": "t3_km4lhh", "parent_id": "t1_ghco7ip", "score": "2", "subreddit": "COVID19positive", "subreddit_id": "t5_2hnraa"}, {"author": "MinuteLibrarian", "body": "I've been taking it for three days. It's helped my symptoms, I'm not sure there's any evidence saying it'll make things worse", "created_utc": "1609216755.0", "edited": "False", "id": "ghd329u", "is_submitter": "False", "link_id": "t3_km69sa", "parent_id": "t3_km69sa", "score": "1", "subreddit": "COVID19positive", "subreddit_id": "t5_2hnraa"}, {"author": "MinuteLibrarian", "body": "Me!! I'm livid!! I live with my parents and younger brother and after months of watching my parents do nothing about curbing my brother's socializing (he was going out every day) and ignoring social distancing rules themselves, my brother got covid and infected me. My brother was recovered after three days, he was mostly asymptomatic. I've been in bed for three days with fever and shortness of breath. I can't stop thinking about long-term damage. I'm so so angry. I never would have gotten sick if anyone had taken this seriously.", "created_utc": "1609215953.0", "edited": "False", "id": "ghd1rzg", "is_submitter": "False", "link_id": "t3_km4bf0", "parent_id": "t3_km4bf0", "score": "20", "subreddit": "COVID19positive", "subreddit_id": "t5_2hnraa"}, {"author": "MinuteLibrarian", "body": "Same experience here :( Terrible anxiety and depression about myself and my future dreams and goals. I'm only on day 6 of symptoms and I've been terrified the virus will have some permanent effect on me and prevent me from living the life I want. I know it's so unlikely that'll happen, but anxiety doesn't exactly function on rationality lol. Sometimes the only thing that helps me is zoning out by using a million distractions. I'll put on a familiar movie or tv show and then play a game or something at the same time. Keeps my subconscious nice and busy so it has less time to torment me lol", "created_utc": "1609198668.0", "edited": "False", "id": "ghc6cqg", "is_submitter": "False", "link_id": "t3_klqrix", "parent_id": "t3_klqrix", "score": "1", "subreddit": "COVID19positive", "subreddit_id": "t5_2hnraa"}, {"author": "MinuteLibrarian", "body": "An antigen test might come back negative once you've recovered from symptoms, but the more reliable PCR test could come back positive for up to three months after infection even though you stop being contagious WAY earlier than that. Is your work requiring a negative test? You wouldn't be contagious anymore if it's been 10 days since you recovered.", "created_utc": "1609198277.0", "edited": "False", "id": "ghc5mr1", "is_submitter": "False", "link_id": "t3_klraau", "parent_id": "t3_klraau", "score": "2", "subreddit": "COVID19positive", "subreddit_id": "t5_2hnraa"}, {"author": "MinuteLibrarian", "body": "If you have recovered but your family is ill, I think you could still be a carrier. I know it's hard and sucks but it's best to wait until you're all better.", "created_utc": "1609197390.0", "edited": "False", "id": "ghc3z1u", "is_submitter": "False", "link_id": "t3_klzh4x", "parent_id": "t3_klzh4x", "score": "2", "subreddit": "COVID19positive", "subreddit_id": "t5_2hnraa"}, {"author": "MinuteLibrarian", "body": "I'm afraid not. Isolation means you cannot leave your house. Risk is not minimal, you are highly contagious. Use instacart or have someone shop for you.", "created_utc": "1609197178.0", "edited": "False", "id": "ghc3kt2", "is_submitter": "False", "link_id": "t3_km0i1y", "parent_id": "t3_km0i1y", "score": "5", "subreddit": "COVID19positive", "subreddit_id": "t5_2hnraa"}, {"author": "MinuteLibrarian", "body": "i inexplicably got a rash several days ago and tested positive a few days later. started with congestion as well. My rash was on my outer thighs. it's better now, but i have other symptoms instead lmao", "created_utc": "1609197026.0", "edited": "False", "id": "ghc3arx", "is_submitter": "False", "link_id": "t3_km0j0u", "parent_id": "t3_km0j0u", "score": "1", "subreddit": "COVID19positive", "subreddit_id": "t5_2hnraa"}, {"author": "MinuteLibrarian", "body": "I would wait just in case. I didn't test positive until 15 days after my brother tested positive. the two weeks is the safer option.", "created_utc": "1609186365.0", "edited": "False", "id": "ghbj3dj", "is_submitter": "False", "link_id": "t3_klwr0q", "parent_id": "t3_klwr0q", "score": "3", "subreddit": "COVID19positive", "subreddit_id": "t5_2hnraa"}, {"author": "MinuteLibrarian", "body": "Don't be too hard on yourself. If you were being careful, the people guilt-tripping you are likely doing it out of fear. Unfortunately it's true that covid is really making rounds. Especially if you're in America or the UK it kind of feels like it's just a matter of time until everyone has been exposed. It's hard enough dealing with being ill while everyone around you is fine. \n\nI also have a rough time with anxiety and being in the house makes it a million times worse. having covid and anxiety feels like the worst combo in modern history. The best thing I've really been able to do (besides taking cbd edibles) is having a lot of distractions going at once so I have less idle time to think about the fact that I have covid. All day yesterday I had netflix and youtube going on a loop while I alternated playing mariokart and toy blast. Really keeps my doom-and-gloom subconscious busy so it has less time to torment me lol", "created_utc": "1609185719.0", "edited": "False", "id": "ghbhs5a", "is_submitter": "False", "link_id": "t3_klwub3", "parent_id": "t3_klwub3", "score": "1", "subreddit": "COVID19positive", "subreddit_id": "t5_2hnraa"}, {"author": "MinuteLibrarian", "body": "Pretty low chances honestly. Majority of covid infection is passed on from being too near to people while they breathe or talk or cough and aren't wearing masks. Most people get infected in their homes from family or roommates bc of the proximity. If no one was near you maskless it's probably fine.", "created_utc": "1609185390.0", "edited": "False", "id": "ghbh4yr", "is_submitter": "False", "link_id": "t3_klx5qk", "parent_id": "t3_klx5qk", "score": "3", "subreddit": "COVID19positive", "subreddit_id": "t5_2hnraa"}, {"author": "MinuteLibrarian", "body": "Actually getting reinfected may not be that rare, it's just that REPORTS of reinfection are fairly rare just because the virus is still quite new. I think others are right about inflated rarity. When this shit started there were about 2 strains of covid going around and now there are up to 8 different ones. The longer this goes on, the more people will get reinfected. 6 weeks does seem like quite a short time though. It's true that a PCR test (not the rapid one) would still come back positive for you for up to three months from the last time you were infected with covid, whether or not you've been reinfected. \n\nI would isolate/quarantine and monitor yourself and your son. If anything concerning happens, speak to a doctor. It might be best to assume you have covid again and take care of yourself and your son accordingly. You might just have gotten the flu or something instead, but better safe than sorry.", "created_utc": "1609184440.0", "edited": "False", "id": "ghbfa7f", "is_submitter": "False", "link_id": "t3_klv325", "parent_id": "t3_klv325", "score": "3", "subreddit": "COVID19positive", "subreddit_id": "t5_2hnraa"}, {"author": "MinuteLibrarian", "body": "I lost it yesterday, day 5 for me. Mine feels like a sinus infection too, my whole face feels congested as hell. Yesterday my head felt like a balloon and today there's this awful pressure behind my eyes.\n\nFor taste and smell, I don't think it's either a good or bad sign, just a common one. It happens a lot to people, especially with mild cases. While I'm sure it feels like you've had covid a long time, day 16 is still pretty early in recovery. I think a lot of people only start feeling better around the 2 week mark and certain symptoms like fatigue can linger for longer. Recovering taste and smell can take a while too. Covid puts the body through a lot and it can take a lot of rest to recover from the fight your immune system has to put up. I'm glad your case was mild, I hope you get a lot of rest and recover quickly from whatever symptoms you're still having.", "created_utc": "1609184027.0", "edited": "False", "id": "ghbeh48", "is_submitter": "False", "link_id": "t3_klv3ar", "parent_id": "t3_klv3ar", "score": "3", "subreddit": "COVID19positive", "subreddit_id": "t5_2hnraa"}, {"author": "MinuteLibrarian", "body": "What you are describing is called parosmia and has happened to a lot of people who regained taste and smell after covid. It can take a little while to go away. I saw a girl on tiktok who said the exact same thing about soda tasting like motor oil and the comments were filled with people describing the same experience.", "created_utc": "1609183548.0", "edited": "False", "id": "ghbdikj", "is_submitter": "False", "link_id": "t3_klvjuo", "parent_id": "t3_klvjuo", "score": "2", "subreddit": "COVID19positive", "subreddit_id": "t5_2hnraa"}, {"author": "MinuteLibrarian", "body": "Yes they are completely different. One thing to keep in mind is that just like with covid tests false negatives are really a thing with antibodies tests. Also, antibodies naturally fade over time and even if you had covid earlier this year, it doesn't mean you are no longer susceptible.", "created_utc": "1609183368.0", "edited": "False", "id": "ghbd5mo", "is_submitter": "False", "link_id": "t3_klvo7n", "parent_id": "t3_klvo7n", "score": "1", "subreddit": "COVID19positive", "subreddit_id": "t5_2hnraa"}, {"author": "MinuteLibrarian", "body": "I've tried inositol but never for long enough to see real improvement. I might have to give it a go again. Thank you for sharing!", "created_utc": "1609182775.0", "edited": "False", "id": "ghbbyn2", "is_submitter": "True", "link_id": "t3_klat8u", "parent_id": "t1_ghb9m5j", "score": "1", "subreddit": "COVID19positive", "subreddit_id": "t5_2hnraa"}, {"author": "MinuteLibrarian", "body": "I have severe depression and anxiety and pretty significant hypochondria, which as you can imagine isn't helped by KNOWING I have tested positive for a potentially dangerous disease. Yesterday I took a ton of CBD just to calm my nervous system. The thing I've really been trying to do if I'm not asleep is to just have a lot of distractions going at once. Like I'll put on a movie and ALSO play switch or games on my phone just so there's enough distractions and constant background noise going to prevent idle thoughts about covid from escaping through and giving me panic attacks.\n\nIf it offers any comfort, please know that the majority of people do just fine. Others have advised me to keep an eye out after about 7-10 days of symptoms. Sometimes it's common to start feeling better and then have the respiratory symptoms set in a little later. It can be scary if you don't know to expect it. Around day 14 is when people start genuinely getting over it. Rest as much as possible. If you're concerned about shortness of breath, speak to a doctor. Most cases don't require medical assistance even with shortness of breath. \n\nAs someone with anxiety, I'm sure you've been offered this advice before, but try breathing exercises, because it might help with the respiratory symptoms as well. (My anxiety gives me shortness of breath so I've been trying to control it as much as possible so I don't confuse anxiety symptoms with covid. i hate it here.) I also recently downloaded the app loona which has these immersive sleepscapes and other calming activities and it's helped a lot with settling down to sleep. My anxiety has been so bad I've been unable to sleep even with the fatigue. Otherwise, if you can get on a call with a friend and play some online games it might help the isolation and loneliness. There's an online version of cards against humanity and other board games are available online too for free if you google it. \n\nSending you strength and love. I know it's so hard and scary but we will both get through this. I hope it's as quick and as painless as possible.", "created_utc": "1609182716.0", "edited": "False", "id": "ghbbua1", "is_submitter": "False", "link_id": "t3_klw61z", "parent_id": "t3_klw61z", "score": "5", "subreddit": "COVID19positive", "subreddit_id": "t5_2hnraa"}, {"author": "MinuteLibrarian", "body": "From what I've read on this subreddit, it's fairly common to start feeling better and then have a little downturn after about 10 days or so. The respiratory symptoms take longer to set in I think. Others who have had this experience say it's quite scary when it comes out of nowhere. I hope it's reassuring to know it's not just you. I'm only on day 6 right now but today I feel a little better and I'm afraid I'll take a turn as well. See how you feel after about 15 days of symptoms. I ordered an oximeter specifically to monitor my O2 in case my respiratory symptoms also get worse. My cousin works in a covid ICU and has said there's no need to freak out unless you're having shortness of breath while resting. While moving around it's probably to be expected. People start getting over the respiratory symptoms closer to 14-15 days after diagnosis and possibly a few days beyond that. If you're really worried, just take your doctor's advice about the urgent care. Better safe than sorry, and they'd definitely be able to tell you if your O2 levels are okay.\n\nSending you lots of strength,  I hope we both get over this quickly.", "created_utc": "1609182070.0", "edited": "False", "id": "ghbajj9", "is_submitter": "False", "link_id": "t3_klw7vz", "parent_id": "t3_klw7vz", "score": "1", "subreddit": "COVID19positive", "subreddit_id": "t5_2hnraa"}, {"author": "MinuteLibrarian", "body": "All kinds of guidelines are being tossed around and it's so hard to know. I tested positive two days ago. My cousin works as a doctor at a covid ICU and she advised me to isolate for 14 days (AND until you go 24 hours fever-free without the aid of medicine) and then quarantine an additional 10 days afterwards. Unfortunately I think people stay contagious longer than they think they will. I didn't test positive until nearly three weeks after my brother had symptoms.\n\nYou could always speak to your doctor or a nearby urgent care and let them know your specific situation. Sometimes depending on severity of symptoms, isolation time can vary. Sending you strength, and hoping this passes quickly for the both of us!", "created_utc": "1609181563.0", "edited": "False", "id": "ghb9i9k", "is_submitter": "False", "link_id": "t3_klw83z", "parent_id": "t3_klw83z", "score": "1", "subreddit": "COVID19positive", "subreddit_id": "t5_2hnraa"}, {"author": "MinuteLibrarian", "body": "I would spend the extra day in quarantine. I didn't develop symptoms until more than 15 days after exposure to my brother who had it first, and it was a few days after his quarantine had ended. So it's best to be safe in case you're still contagious.", "created_utc": "1609143071.0", "edited": "False", "id": "gh9svlx", "is_submitter": "False", "link_id": "t3_klkr0z", "parent_id": "t3_klkr0z", "score": "1", "subreddit": "COVID19positive", "subreddit_id": "t5_2hnraa"}, {"author": "MinuteLibrarian", "body": "I'm on day 5, my anxiety is just terrible. It's pretty bad just regularly but the sudden onset illness has not helped at all. I took some CBD (normally what I take for anxiety) which helped tremendously because I was really on the verge of panicking about loss of smell/taste and the fear that my symptoms will get worse. I have almost no fatigue which is so weird since it's supposed to be common. When I do try to sleep I can't get my brain to turn off. I've been sleeping a few hours at night with the help of nyquil and making up a little more time in the morning or daytime. I've tried meditating as well, which helps a little but it's still so hard to get decent sleep or not get frustrated about not being able to fall asleep.\n\nI know it's easier said than done but try not to freak out about not being able to fall asleep. The truth is that even if you don't fall asleep, resting by lying down is much MUCH better than getting up and doing things. Your body can still get plenty done even if you're only physically relaxing and not actually asleep. A little bit is better than nothing, and much better than nothing PLUS anxiety about it.", "created_utc": "1609142974.0", "edited": "False", "id": "gh9ssc1", "is_submitter": "False", "link_id": "t3_klll8h", "parent_id": "t3_klll8h", "score": "1", "subreddit": "COVID19positive", "subreddit_id": "t5_2hnraa"}, {"author": "MinuteLibrarian", "body": "Lost my smell and taste today as well and am very scared about how long it'll take to come back :( I think most people get it back pretty quickly and permanent loss is relatively rare. Still scares me though :( I did just read plenty of posts/comments from people saying it started to come back once other symptoms started to resolve, around the 12-14 day mark. Hoping it's quick for us both. Wishing you a speed recovery!", "created_utc": "1609142474.0", "edited": "False", "id": "gh9saw8", "is_submitter": "False", "link_id": "t3_klijsl", "parent_id": "t3_klijsl", "score": "1", "subreddit": "COVID19positive", "subreddit_id": "t5_2hnraa"}, {"author": "MinuteLibrarian", "body": "I think you might be able to relax a little! Symptoms are supposed to peak around 7-10 days and most mild cases start feeling better around the 12-14 day mark. I'm on day 5 right now. A lack of fever (without medication to control it) is usually a pretty good sign. Lingering fatigue or elevated heart rate are pretty normal I think and might take longer to go away. I definitely understand the nervousness, I've been pretty terrified I'll take a bad turn. I'd say that the odds are pretty well in your favor though :)", "created_utc": "1609142332.0", "edited": "False", "id": "gh9s5sl", "is_submitter": "False", "link_id": "t3_klil5m", "parent_id": "t3_klil5m", "score": "4", "subreddit": "COVID19positive", "subreddit_id": "t5_2hnraa"}, {"author": "MinuteLibrarian", "body": "Do you feel like you have a fever? Like the shivering/sweating, etc? It might be worth getting another thermometer in case. I have two, one that is no contact and the other kind that you put in your armpit. The no-contact one was definitely giving me a lot of false readings and wouldn't reset properly, so I was glad to have the second one to confirm. I think the ones that go in your mouth or armpit might read more accurately. In the meantime you could take a mild fever reducer like tylenol (might be more effective for fever than advil) and speak to your doctor about what to do if fever spikes too high.", "created_utc": "1609142146.0", "edited": "False", "id": "gh9rz8g", "is_submitter": "False", "link_id": "t3_klinik", "parent_id": "t3_klinik", "score": "1", "subreddit": "COVID19positive", "subreddit_id": "t5_2hnraa"}, {"author": "MinuteLibrarian", "body": "Lost my taste and smell this morning, and I'm on day 4 or 5 as well. Early this morning I could still smell really distinctive things, like alcohol, citrus, or bath and body works soap (good marketing for them? idk). By noon my smell and most taste was totally gone and now I can only taste basic profiles. I get no flavor, but I can tell when things are salty or sweet or spicy. I'm really upset about it and just hoping it doesn't last long because it's such a depressing thing to have to deal with on top of all the mental and physical attacks covid lays on you.\n\nIt's only been a day, but so far I think it'll be easier to deal with by focusing on texture or combining taste profiles. Like something that is spicy AND salty or sour AND sweet will be more interesting to eat than food that is just one thing or another. I had some dark chocolate pretzels and the combo of bitter/sweet/salty almost gave it a real flavor lol. Wishing you a speedy recovery, I hope we both make it through quickly.\n\nEdit to say it's worth mentioning I have severe congestion and a stuffy/runny nose which would cause loss of smell and taste even if I just had a regular cold. We'll see how long things take to resolve.", "created_utc": "1609141776.0", "edited": "False", "id": "gh9rm2s", "is_submitter": "False", "link_id": "t3_klipgq", "parent_id": "t3_klipgq", "score": "0", "subreddit": "COVID19positive", "subreddit_id": "t5_2hnraa"}, {"author": "MinuteLibrarian", "body": "Some distortion of taste or smell happens to people when it starts coming back. As far as I've been able to research, it takes some time to go away but people do tend to recover. the loss of smell is called ansomnia if you want to google some background for it, while the distortion (could explain the strange taste in your mouth, since most flavor comes from smell) is called parosmia. I'm sorry this is happening to you,  I lost my smell and taste today after testing positive yesterday. I don't have any weird lingering tastes in my mouth, but I can't smell anything and can only \"taste\" basic profiles like I can tell if something is salty or sweet or bitter or spicy but that's really about it. Hoping we both make it through, stay strong.", "created_utc": "1609141386.0", "edited": "False", "id": "gh9r80m", "is_submitter": "False", "link_id": "t3_kliumn", "parent_id": "t3_kliumn", "score": "1", "subreddit": "COVID19positive", "subreddit_id": "t5_2hnraa"}, {"author": "MinuteLibrarian", "body": "Thank you so much for sharing this. I'm on day 5 and lost smell and taste today and it's the newest of several symptoms. I've had all the symptoms you describe with a very mild fever (mild on an objective medical level, it felt terrible to me personally lol) so I'm glad to hear you're recovering quickly. I haven't been able to stop myself reading all those horrible articles about permanent loss of taste or smell.", "created_utc": "1609141048.0", "edited": "False", "id": "gh9qvmn", "is_submitter": "False", "link_id": "t3_kljk30", "parent_id": "t3_kljk30", "score": "2", "subreddit": "COVID19positive", "subreddit_id": "t5_2hnraa"}, {"author": "MinuteLibrarian", "body": "I'm so sorry to hear about your family. I also tested positive yesterday and am very afraid. I just wanted to let you know you're not alone, and to remember that a majority of people make a decent recovery, even if they have other conditions. I have severe anxiety and chronic depression and I'm trying my very hardest not to let it get the best of me since this whole situation is a breeding ground for feeling the shittiest I've ever felt in my life. There are plenty of people in my life who have been at the same age as your parents, with concerning conditions, and they are doing just fine now. Sending strength your way, I'm hoping both our families get through this quickly and as painlessly as possible <3", "created_utc": "1609140905.0", "edited": "False", "id": "gh9qq8t", "is_submitter": "False", "link_id": "t3_kljmk5", "parent_id": "t3_kljmk5", "score": "2", "subreddit": "COVID19positive", "subreddit_id": "t5_2hnraa"}, {"author": "MinuteLibrarian", "body": "This is almost the exact timeline of infection I had. My brother tested positive almost three weeks ago and I tested negative several days after exposure to him and didn't have symptoms until past the two weeks mark. Started having throat itchiness evening of 12/23 and wrote it off as allergies also until I came down with a fever 12/26 and tested positive that day. This morning, I could still smell a little but couldn't taste much. Now, all smell and most taste is gone. I also hope it comes back soon. I'm trying not to freak out because I doubt that stress and anxiety is good for recovery but my two major fears right now are \n\n1. worsening symptoms around the 7-10 mark, which is when symptoms are supposed to peak\n2. i know this is rare, but some people never recover their smell or taste, or it takes months to come back and honestly idk how I would deal if that happened to me\n\nWishing a speedy recovery for us both, without major incidence, and the quick return of smell and taste. Such a bummer to lose it on top of already feeling like shit.", "created_utc": "1609140425.0", "edited": "False", "id": "gh9q8i4", "is_submitter": "False", "link_id": "t3_kljz7o", "parent_id": "t3_kljz7o", "score": "2", "subreddit": "COVID19positive", "subreddit_id": "t5_2hnraa"}, {"author": "MinuteLibrarian", "body": "Tested positive yesterday and I'm on my 4th or 5th day of symptoms. I have pretty significant diarrhea, but so far my case is objectively mild. I feel like shit, but nothing serious is going on. I am a little afraid of it getting worse because I know symptoms tend to peak or take a more serious turn (if they're going to) at around 7-10 days so I can keep you updated if that happens. \n\nAs a whole, I would take studies/articles about correlations like that with a grain of salt. (I say this to myself as well to ease my significant health anxiety) because the truth is we know too little about this virus and why it affects people so differently in order to make definitive broad judgements like that. This may be a correlation, but without significant research I doubt it says much about how LIKELY it is someone will become severely ill just because they had diarrhea as an initial symptom. \n\nAlso, I have yet to hear of any babies or children becoming severely ill with COVID so I think your baby will likely be just fine. As others have said, make sure you're all staying hydrated with not just water but something with electrolytes, like pedialyte or gatorade. I'm not sure what's acceptable for babies as young as yours but your doctor will definitely know. Dehydration might be more threatening to your baby than covid. Otherwise, I recommend you all get tested and quarantine just in case, even if tests come back negative (I tested negative two weeks ago but am positive now)\n\nAnother thing: I deeply empathize with your anger about being exposed due to no fault of your own. It's so unacceptable that someone else would put you and your family in harm's way like that. My parents haven't been able to curb my brother's socializing and he infected us all, despite the fact that I was being very careful. I have to avoid thinking about it because otherwise I get so angry.", "created_utc": "1609139487.0", "edited": "False", "id": "gh9p8t7", "is_submitter": "False", "link_id": "t3_klkdv7", "parent_id": "t3_klkdv7", "score": "5", "subreddit": "COVID19positive", "subreddit_id": "t5_2hnraa"}, {"author": "MinuteLibrarian", "body": "Thank you so much for your story! I'm sorry it happened to you too. I can't believe how unfair it is that one family member can put everyone at such risk ESPECIALLY when the most careful end up with the worst symptoms. None of my family had it as bad as I do now. I feel like my head is a balloon. Wishing the best for both of us, I hope you beat it soon and make a full recovery, taste and all! And also sending strength to deal with family, it's extra hard at times like this.", "created_utc": "1609131927.0", "edited": "False", "id": "gh9fmlv", "is_submitter": "True", "link_id": "t3_klat8u", "parent_id": "t1_gh8sw1q", "score": "2", "subreddit": "COVID19positive", "subreddit_id": "t5_2hnraa"}, {"author": "MinuteLibrarian", "body": "Thank you!! I hope this passes without any serious incidence for both of us. Since writing the post, I'm not having shortness of breath but I do feel some chest discomfort/minor aches which I'm nervous about. I'm just hoping it doesn't get worse. I ordered an oximeter to monitor my O2 just for my own peace of mind. I have severe health anxiety and this is not good for my already serious hypochondria lol", "created_utc": "1609113017.0", "edited": "False", "id": "gh8happ", "is_submitter": "True", "link_id": "t3_klat8u", "parent_id": "t1_gh8fc1c", "score": "4", "subreddit": "COVID19positive", "subreddit_id": "t5_2hnraa"}, {"author": "MinuteLibrarian", "body": "I was, about a year or two ago, but the side effects were too severe and difficult to deal with. I was put on birth control at the same time, but I have diagnosed chronic depression and the birth control was making it dangerously worse so I had to quit. I'm hoping to start pursuing a more naturopathic approach bc I can't take metformin anymore.", "created_utc": "1609112900.0", "edited": "False", "id": "gh8h2gk", "is_submitter": "True", "link_id": "t3_klat8u", "parent_id": "t1_gh865kb", "score": "1", "subreddit": "COVID19positive", "subreddit_id": "t5_2hnraa"}, {"author": "MinuteLibrarian", "body": "Oh man that sounds amazing! I wish my pup cared lol she would never work that hard for her kibble hahahaha", "created_utc": "1602600770.0", "edited": "False", "id": "g8p3ugv", "is_submitter": "False", "link_id": "t3_ja4sfm", "parent_id": "t3_ja4sfm", "score": "3", "subreddit": "puppy101", "subreddit_id": "t5_2rw7o"}, {"author": "MinuteLibrarian", "body": "Every single resource I sought out said it was a bad idea to leave out puppy pads for your dog if you're trying to train them to go outside and also you're a terrible puppy owner if you do it. But the lack of sleep was making me so insane I literally wasn't able to take care of her during the day. So I said heck the rules and left out pads at night because I wanted her to sleep alone and also I didn't want to feel like walking into traffic. She's 6 months now and hasn't needed the pads in months. Totally potty-trained and as an added bonus doesn't mind sleeping alone at all.", "created_utc": "1601821006.0", "edited": "False", "id": "g7okccw", "is_submitter": "False", "link_id": "t3_j4r3p7", "parent_id": "t3_j4r3p7", "score": "7", "subreddit": "puppy101", "subreddit_id": "t5_2rw7o"}, {"author": "MinuteLibrarian", "body": "wow hahaha he really is brand new!! You'll learn a lot about each other in the coming days. In the beginning with my pup I was so terrified of making mistakes and ruining everything. But honestly, it's pretty difficult to make an irreversible mistake with a pup. It's just a bunch of trial and error. Some things will work, some things won't, and in the end everything will be fine.", "created_utc": "1601501970.0", "edited": "False", "id": "g7819t5", "is_submitter": "False", "link_id": "t3_j2819u", "parent_id": "t1_g761dcs", "score": "1", "subreddit": "puppy101", "subreddit_id": "t5_2rw7o"}, {"author": "MinuteLibrarian", "body": "Could 100% just be the effects of him getting a little older. His puppy socialization window is closing and now that he's headed toward adolescence he's bound to be a little more cautious and fearful. I think it's totally normal. As long as you keep socializing him like you've been doing, he should be just fine :)", "created_utc": "1601501833.0", "edited": "False", "id": "g78107m", "is_submitter": "False", "link_id": "t3_j2hb39", "parent_id": "t1_g76qapg", "score": "1", "subreddit": "puppy101", "subreddit_id": "t5_2rw7o"}, {"author": "MinuteLibrarian", "body": "Yeah, his adult teeth will look different. You might have noticed right now that his baby teeth look too small for his mouth and he looks a little bit like a shark with all those gaps between his sharp little teeth. When his adult teeth come in they'll be noticeably bigger and very bright white, since they're brand new.\n\nYES absolutely when he bites it will hurt less. His teeth will be much duller, most pain from adult dog bites comes from pressure. Puppy teeth are like little knives", "created_utc": "1601501688.0", "edited": "False", "id": "g780prb", "is_submitter": "False", "link_id": "t3_j24yhz", "parent_id": "t1_g77e4s1", "score": "3", "subreddit": "puppy101", "subreddit_id": "t5_2rw7o"}, {"author": "MinuteLibrarian", "body": "oh my god this is the single most comforting thing anyone has said to me. Thank you so much. Every time I see her drag herself up using her front legs I have a heart attack. I'm watching her thinking there's no WAY it isn't hip dysplasia like why else would she do that???\n\nDefinitely want to get the xrays done just in case. It's a small price to pay for peace of mind, I've been slowly going insane over the past week.", "created_utc": "1601501544.0", "edited": "False", "id": "g780f9h", "is_submitter": "True", "link_id": "t3_j2ecp1", "parent_id": "t1_g77rq5m", "score": "2", "subreddit": "dogs", "subreddit_id": "t5_2qhhk"}, {"author": "MinuteLibrarian", "body": "thank you for sharing your experience!", "created_utc": "1601501418.0", "edited": "False", "id": "g78049n", "is_submitter": "True", "link_id": "t3_j2ecp1", "parent_id": "t1_g75nx29", "score": "1", "subreddit": "dogs", "subreddit_id": "t5_2qhhk"}, {"author": "MinuteLibrarian", "body": "You'll probably have ups and downs with the crate. Our pup would alternate weeks lol. One week she didn't mind being put in her pen at all. Following week we were back to throwing tantrums.\n\nI was going to say that the 1 hour awake/2 hours asleep rule might not work for all pups. It NEVER worked for ours and I mean NEVER. For the first three or four months of her life she never napped longer than an hour but was often awake for longer than that. By the time she was 16 weeks I could count on one hand the number of naps she'd taken that were longer than an hour. However, you did mention that you start enforcing naps once he gets overstimulated and bitey, and this is generally a good rule of thumb. It's what I had to do to get my pup to sleep. \n\nI tried treat training, where I would wait for her to be quiet, even for a second, and then silently drop a small treat next to her. Often she kept crying again after and I would just wait for another small break in the whining to give her another treat. I just kept doing this until she realized quiet=treat and it became kind of a game. Sometimes though, this didn't work and made things worse so I had to go back to ignoring her entirely. It's worth noting that sometimes neither of these things worked and she had a tantrum for a full hour before I decided she wasn't going to sleep after all. Your pup's behavior will fluctuate, so hang in there.", "created_utc": "1601459502.0", "edited": "False", "id": "g75onxu", "is_submitter": "False", "link_id": "t3_j1zgz0", "parent_id": "t3_j1zgz0", "score": "1", "subreddit": "puppy101", "subreddit_id": "t5_2rw7o"}, {"author": "MinuteLibrarian", "body": "Yes absolutely. Any dog you're sure is fully vaccinated should be safe for her to meet.", "created_utc": "1601458888.0", "edited": "False", "id": "g75o5ez", "is_submitter": "False", "link_id": "t3_j2237a", "parent_id": "t3_j2237a", "score": "1", "subreddit": "puppy101", "subreddit_id": "t5_2rw7o"}, {"author": "MinuteLibrarian", "body": "We have a GSD too and really nothing has worked except waiting it out. GSD owners tend to have more rough biting months sadly. Lots of lunging and grabbing on and biting VERY sensitive body parts. Our pup is 6 months and still directs her zoomies at me, though I've noticed her getting a little better. \n\nDon't push your pup, he probably interprets that as playtime. Our puppy definitely does. I would just get up and walk away so he understands you don't like it. It'll take time for him to catch onto this. He's probably due to start losing his teeth soon so it's rough.  Wait till his adult teeth come in and compare his progress after.", "created_utc": "1601458635.0", "edited": "False", "id": "g75nxqx", "is_submitter": "False", "link_id": "t3_j24yhz", "parent_id": "t3_j24yhz", "score": "3", "subreddit": "puppy101", "subreddit_id": "t5_2rw7o"}, {"author": "MinuteLibrarian", "body": "Same problem here. our pup is OBSESSED with other dogs. She'll forget I'm there, literally nothing matters except her new friend. The dog could be growling and snapping and spitting at her from feet away and her tail is still wagging like mad. She'll even be excited to see neighborhood dogs that have been actively mean to her in the past. She's nuts. I will cross the street or pull her aside when I see other dogs. It's so annoying, but I think I prefer it to her being afraid.", "created_utc": "1601458270.0", "edited": "False", "id": "g75nmxf", "is_submitter": "False", "link_id": "t3_j2548z", "parent_id": "t3_j2548z", "score": "3", "subreddit": "puppy101", "subreddit_id": "t5_2rw7o"}, {"author": "MinuteLibrarian", "body": "Are there specific times she doesn't eat? Some dogs just get picky. When I was feeding my pup three meals a day she would often skip one whole meal entirely, only eat half of the second, and barely finish the third. We switched to two meals. She still picks at her breakfast and pretty much only eats dinner. (I've seen a lot of people have this issue with their dogs not wanting breakfast). \n\nAs long as your pup seems normal, still playful, and will eat treats and other things she loves, she's probably fine.", "created_utc": "1601458060.0", "edited": "False", "id": "g75ngrg", "is_submitter": "False", "link_id": "t3_j26zz6", "parent_id": "t3_j26zz6", "score": "1", "subreddit": "puppy101", "subreddit_id": "t5_2rw7o"}, {"author": "MinuteLibrarian", "body": "Daycare has been a LIFESAVER for us. Our pup loves it. She starts wagging her tail as soon as I turn the street corner. It helped immensely with socialization and confidence for her. She now loves all dogs (maybe a little too much lol). The first couple of times I took her it was only for a few hours because I was nervous as hell leaving her there and trusting strangers and strange dogs. I would watch their doggy cams like a hawk.\n\nBUT by the third or fourth time I took her she was practically yanking me down the street and into the lobby, her tail wagging so hard it was going in a circle. She couldn't wait to get away from me. After that point I let loose. She was CLEARLY fine if she loved it that much. I hardly even check their doggy cams anymore. When I do check, she's having the time of her life there.", "created_utc": "1601457769.0", "edited": "False", "id": "g75n84o", "is_submitter": "False", "link_id": "t3_j2789y", "parent_id": "t3_j2789y", "score": "1", "subreddit": "puppy101", "subreddit_id": "t5_2rw7o"}, {"author": "MinuteLibrarian", "body": "In the beginning, I would also just wait for my pup to fall asleep before I moved her into her crate. You can keep doing this until he seems a little more comfortable at home, but slowly start enforcing naps if you want to be on a schedule.\n\nI wouldn't be TOO afraid of freaking him out if you let him cry it out. Use your best judgement. Our pup was terrible at self-settling by the time she was around 10 weeks and would get overstimulated and start biting like a maniac. I literally developed a sixth sense for knowing when it was time to enforce a nap. It was when I started seeing that demonic glint in her eye. I'd put her in her playpen when I knew she was tired and let her cry it out. She would eventually go to sleep. Sometimes she didn't and wouldn't stop whining so I knew it wasn't going to work. Sometimes giving her treats for being quiet was the best option to get her to stop crying and understand that quiet=treats. Sometimes this was counterproductive and ignoring her was the best option. It's a lot of trial and error, but don't be too afraid of messing up. They're just babies and will complain for any number of reasons, it's not necessarily crate anxiety. As long as you're associating the crate with positive things (rest and treats and the like), he should be fine even if he complains about it.", "created_utc": "1601457138.0", "edited": "False", "id": "g75mpvw", "is_submitter": "False", "link_id": "t3_j2819u", "parent_id": "t3_j2819u", "score": "3", "subreddit": "puppy101", "subreddit_id": "t5_2rw7o"}, {"author": "MinuteLibrarian", "body": "Sounds exactly like my pup. I'm mad at her all the time lol. Chews neurotically, swallows rocks, licks the floor constantly, will pick up anything off the ground and eat it, sometimes pretends she needs to potty just so she can find twigs to chew on or crickets to hunt, loves eating leaves, leaves, leaves, leaves, and also leaves. She's nuts. \n\nBut it IS going to be okay. I am sorry about your friend. Puppy stuff is hard enough to deal with on its own. Your pup will get better and so will you.", "created_utc": "1601456688.0", "edited": "False", "id": "g75mcu3", "is_submitter": "False", "link_id": "t3_j29g95", "parent_id": "t3_j29g95", "score": "1", "subreddit": "puppy101", "subreddit_id": "t5_2rw7o"}, {"author": "MinuteLibrarian", "body": "I'd go with option 2. Thinking about my own puppy at 8 weeks, traveling with her would've been an absolute nightmare. Not just because she was really hard at that age, but also because my post-puppy anxiety had set in. I couldn't have enjoyed any vacation under that kind of stress. \n\nYour pup should be okay missing out on a week of socialization. this happens to pups all the time anyway for plenty of other reasons. (sometimes they have worms or other issues and have to be kept isolated from other dogs for instance) there were times our pup had to go a few weeks at once without socialization because I didn't know many dogs that could come over, she was too young to take to the dog park, and most puppy kindergartens were still closed from covid. She turned out perfectly fine, she's 6 months now and LOVES dogs lol. Socialization is an ongoing thing anyway and should be continued for months even after your pup's critical period closes. She should be perfectly fine :)", "created_utc": "1601456334.0", "edited": "False", "id": "g75m2dy", "is_submitter": "False", "link_id": "t3_j29271", "parent_id": "t3_j29271", "score": "1", "subreddit": "puppy101", "subreddit_id": "t5_2rw7o"}, {"author": "MinuteLibrarian", "body": "Our puppy started losing hers around 5 months. I remember they all fell out pretty quickly and also grew in pretty quickly. she would lose several at once and then only a few days later I'd notice her adult teeth had erupted. The time varies though, teeth can take a while to bed down properly after they've erupted. Don't be surprised if you don't even notice your pup losing teeth. She might be halfway through by the time you notice she's missing a few or that her teeth look different.\n\nOne thing to keep in mind though: don't be alarmed if her gums bleed a little. this is normal. I'm glad I found this out because I would've freaked out if I saw blood in my puppy's mouth and didn't know it could happen from teething.", "created_utc": "1601455924.0", "edited": "False", "id": "g75lqbw", "is_submitter": "False", "link_id": "t3_j2abm4", "parent_id": "t3_j2abm4", "score": "2", "subreddit": "puppy101", "subreddit_id": "t5_2rw7o"}, {"author": "MinuteLibrarian", "body": "I'm not sure how short is too short but I remember my cousins had a dog that they unfortunately neglected taking to the groomer's too often and yet that dog never needed her nails trimmed. they seemed to file down on their own from wear. I don't think they ever had an issue.\n\nIf you're concerned that they're too short you might want to ask your vet about it. It might be nothing or there might be something else going on.", "created_utc": "1601455600.0", "edited": "False", "id": "g75lgqw", "is_submitter": "False", "link_id": "t3_j2al37", "parent_id": "t3_j2al37", "score": "1", "subreddit": "puppy101", "subreddit_id": "t5_2rw7o"}, {"author": "MinuteLibrarian", "body": "He's part retriever, you might just be in for the long haul with biting behaviors. We have a herder breed, and we all get the short end of the stick for biting. They're mouthier than other dogs.\n\nAlso, if he's teething you're at the peak of horrible biting behaviors. He's probably experiencing serious discomfort with his teeth and gums. Our pup got better after she got her adult teeth but she still bites (6 months). Literally no bite inhibition training has worked properly on her. I now have to move away every time she bites. Maybe she'll get it by her first birthday. Your pup will get there eventually! Ignore all those reddit stories about people saying their puppy stopped biting at 10 weeks or 3 months or whatever. I can't believe pups like that exist lol.\n\nTry giving her cold things to chew on. Our pup loved ice cubes and would calm down a little when I gave her a few while she was teething.", "created_utc": "1601455426.0", "edited": "False", "id": "g75lblx", "is_submitter": "False", "link_id": "t3_j2as1l", "parent_id": "t3_j2as1l", "score": "1", "subreddit": "puppy101", "subreddit_id": "t5_2rw7o"}, {"author": "MinuteLibrarian", "body": "Ours was like this too. She loved chewing on rocks and would constantly swallow them and poop them out. As you might imagine, this was not good for my anxiety levels. After a while I learned to calm down. Puppies are resilient little creatures. Keep your pup away from wires or anything seriously dangerous, but he should probably be fine otherwise. I'll tell you a story my friend loves to tell me about a dog she used to have in childhood. She recounted this story every time I mentioned I was afraid of my dog's neurotic chewing behaviors. My dog will eat ANYTHING. Literally ANYTHING.\n\nhere's the story: my friend had a german shepherd dog, notoriously mouthy breed, just like retrievers. in his early puppy months this dog chewed through all their backyard light fixtures, two pool covers, ugg boots, a pair of retainers, and a whole lot of other plastic. He was perfectly fine.", "created_utc": "1601455009.0", "edited": "False", "id": "g75kzbw", "is_submitter": "False", "link_id": "t3_j2d5uo", "parent_id": "t3_j2d5uo", "score": "1", "subreddit": "puppy101", "subreddit_id": "t5_2rw7o"}, {"author": "MinuteLibrarian", "body": "It'll slowly start getting better. My pup also sleeps through the night fine but barely tolerates her crate/pen in the daytime. She's also a whiner. I've tried so hard not to encourage this behavior but she's a vocal dog and insists on letting me know how she feels. I still slip into bad days every now and then. Honestly, when I was 4 weeks in with my pup I was still struggling. We turned a corner when she was about 4.5 months old. She doesn't throw as many crate tantrums anymore now that she's 6 months.", "created_utc": "1601454678.0", "edited": "False", "id": "g75kpiw", "is_submitter": "False", "link_id": "t3_j2ek7o", "parent_id": "t3_j2ek7o", "score": "1", "subreddit": "puppy101", "subreddit_id": "t5_2rw7o"}, {"author": "MinuteLibrarian", "body": "I am hardly an expert on canine behavior so I can only offer my own experience. \n\nMight just be a puppy thing?? Around 4 months, my pup was still pretty skittish of bigger dogs even though she clearly wanted to play. It's possible that these dogs' play style is something your pup wasn't used to and it spooked him. Every dog is an individual and has their own quirks and unique energy. You said you've been socializing him diligently (which is great!!), but he is still pretty young after all and hasn't really had enough time to build up a whole lot of socialization experience. He'll most likely just grow out of it as long as he keeps having positive experiences and meeting a variety of dogs and getting used to different play styles.\n\nI was so anxious all the time when my pup was younger because she was so nervous around certain dogs. When I knew it was safe, I kind of had to let myself to throw her in the deep end a little. She was skittish, but quickly learned there was nothing to be afraid of and now at 6 months she loves dogs a little too much lol", "created_utc": "1601453942.0", "edited": "False", "id": "g75k3z9", "is_submitter": "False", "link_id": "t3_j2hb39", "parent_id": "t3_j2hb39", "score": "1", "subreddit": "puppy101", "subreddit_id": "t5_2rw7o"}, {"author": "MinuteLibrarian", "body": "Sounds pretty normal to me! Our pup was still having the occasional accident at this age. I was even going against basic protocol. Waking up at night was making me insane so I would leave out puppy pads for her. I highly doubt you're doing anything wrong. There are lots of ways to potty-train and they catch on eventually. Some pups take longer than others and that's fine. I totally understand the worry though, I thought I was the worst ever at potty-training. Everyone else's puppies seemed like perfect little potty-trained angels (heads up: this is a lie. all puppies are demons) \n\nI told myself I'd wait until my pup got to 6 months before I started really worrying about potty training. She's 6 months now and we haven't had an accident in ages. She even stopped using the puppy pads on her own. I can't even remember the last time she had an accident.", "created_utc": "1601453386.0", "edited": "False", "id": "g75jnmb", "is_submitter": "False", "link_id": "t3_j2gst8", "parent_id": "t3_j2gst8", "score": "2", "subreddit": "puppy101", "subreddit_id": "t5_2rw7o"}, {"author": "MinuteLibrarian", "body": "Literally seeing all those posts made me feel insane. My puppy (GSD) has been a demon since the day she came home. I'm seeing people say pups hit a grace period around 5-6 months before adolescence sets in -- we never got this. She's had a few good days since 4 months but for the most part, she's definitely still got satan himself possessing her. She's 6 months now and still bites and I already know adolescence has hit. I think I'm gonna go nuts before I can get her to her first birthday.", "created_utc": "1601453040.0", "edited": "False", "id": "g75jdcw", "is_submitter": "False", "link_id": "t3_j1xs9t", "parent_id": "t3_j1xs9t", "score": "2", "subreddit": "puppy101", "subreddit_id": "t5_2rw7o"}, {"author": "MinuteLibrarian", "body": "Thank you so much. I'm really really hoping she's just a quirky, awkward pup. I think I'd be able to scrape together the money for TPO or DPO I'm just really hoping I'd be able to convince my parents it's the right thing to do. They seem to think if dogs have genetic illnesses they should just live with them. It's nuts.", "created_utc": "1601451902.0", "edited": "False", "id": "g75iel6", "is_submitter": "True", "link_id": "t3_j2ecp1", "parent_id": "t1_g75i1uk", "score": "1", "subreddit": "dogs", "subreddit_id": "t5_2qhhk"}, {"author": "MinuteLibrarian", "body": "These were my thoughts too. I'm going to speak to my vet to see if she ever noticed concerning signs while examining my pup. The thing about the swaying gait is that honestly virtually every single dog I've seen walks with their butt going side-to-side. I can't tell if it's something different in her or not. The most concerning thing to me is the dragging. I have no idea why she would be doing that. I don't mind paying for the x-rays, I'm mostly concerned about what I'm going to do if she actually does have it. I live with my parents and they don't think it would be necessary to treat her which is absolutely bonkers to me.", "created_utc": "1601449623.0", "edited": "False", "id": "g75gccf", "is_submitter": "True", "link_id": "t3_j2ecp1", "parent_id": "t1_g75d9l1", "score": "1", "subreddit": "dogs", "subreddit_id": "t5_2qhhk"}, {"author": "MinuteLibrarian", "body": "Literally as SOON as I read husky puppy I was like “oh so they really don’t know ANYTHING about puppies at all”", "created_utc": "1600636964.0", "edited": "False", "id": "g615bu2", "is_submitter": "False", "link_id": "t3_ivr7iv", "parent_id": "t1_g5tcjle", "score": "1", "subreddit": "AmItheAsshole", "subreddit_id": "t5_2xhvq"}, {"author": "MinuteLibrarian", "body": "NTA. One thing I’d like to add (Idk if it’s already been mentioned) but it is NOT your fault that you could not love and take care of this puppy. Puppies are HARD. they’re hard to take care of and often hard to love. I fully wanted a puppy and have always loved dogs and still find it hard to love my puppy when she’s being difficult. I also had to consider rehoming her when it was getting to be too much. You are not terrible for not being able to take care of this dog. I think you made a responsible and caring choice in giving the puppy away to a home with experienced owners that had other dogs. \n\npuppies are NOT therapy. Quite the opposite. I’m not on the spectrum but am also definitely not neurotypical and I can tell you that raising my puppy is the hardest thing I have EVER done. I am literally currently in the process of contacting therapists to help me with the severe anxiety that puppy-raising has caused me. The idea that any therapist would suggest a puppy AS therapy makes me want to laugh.", "created_utc": "1600636871.0", "edited": "False", "id": "g61516n", "is_submitter": "False", "link_id": "t3_ivr7iv", "parent_id": "t3_ivr7iv", "score": "1", "subreddit": "AmItheAsshole", "subreddit_id": "t5_2xhvq"}, {"author": "MinuteLibrarian", "body": "poor puppy! oh goodness this happens in my house all the time. anyone raises their voice and she gets visibly concerned and starts barking. no one takes me seriously when I say it's not great to spook dogs like that. I'm already concerned about my dog's anxiety issues and the yelling doesn't help lol", "created_utc": "1600354170.0", "edited": "False", "id": "g5l8u85", "is_submitter": "False", "link_id": "t3_iuksr5", "parent_id": "t3_iuksr5", "score": "2", "subreddit": "dogs", "subreddit_id": "t5_2qhhk"}, {"author": "MinuteLibrarian", "body": "Oh my god thank you for sharing this! I get so concerned that I made a terrible mistake. I love my dog, but I'm mad at her constantly and I'm just really looking forward to the days where she's a source of contentment rather than  frustration and anxiety.", "created_utc": "1599953787.0", "edited": "False", "id": "g500twp", "is_submitter": "True", "link_id": "t3_ir4lxj", "parent_id": "t1_g4x5n7n", "score": "3", "subreddit": "dogs", "subreddit_id": "t5_2qhhk"}, {"author": "MinuteLibrarian", "body": "Thank you for this advice! I never considered this. I figured a 6 month old german shepherd is hardly equal to a 6 month old Pomeranian in terms of exercise needs but I’ve found very little info on whether walk needs might differ between breeds for young puppies", "created_utc": "1599925612.0", "edited": "False", "id": "g4xu3px", "is_submitter": "True", "link_id": "t3_ir4lxj", "parent_id": "t1_g4xndje", "score": "1", "subreddit": "dogs", "subreddit_id": "t5_2qhhk"}, {"author": "MinuteLibrarian", "body": "Thank you for your kind response! I think I need to make the 1 year mark my new milestone to look forward to. \n\nI definitely try and give her plenty of alone time too. She is actually very prone to getting overstimulated and unmanageable if she doesn’t get enough sleep so even though she’s an older pup I’m still enforcing crate naps for her. A family dog of ours suffered very seriously from separation anxiety and that’s been one of the things I’ve been terrified to see develop in my puppy so I’ve been trying to reinforce positive alone time whenever I can. \n\nAs far as playtime—I DO play with her but it’s mostly things like fetch or find the treat or tug. it’s actually difficult to initiate the kind of rough and tumble playtime you describe with her because she gets so mouthy when she gets excited. She’s very used to playing with other dogs and I don’t think it’s quite clicked with her that she can’t be so rough and nippy with people the way she is with dogs 😅 it’s the same with cuddling. She’s only interested when she’s very sleepy and doesn’t feel like playing which is actually fine with me lol she’s so sweet when she’s sleepy 😅", "created_utc": "1599923377.0", "edited": "False", "id": "g4xp1dw", "is_submitter": "True", "link_id": "t3_ir4lxj", "parent_id": "t1_g4wt40t", "score": "2", "subreddit": "dogs", "subreddit_id": "t5_2qhhk"}, {"author": "MinuteLibrarian", "body": "Thank you! Other GSD owners have also told me this is typical for the breed. I am glad to know that all this work will pay off at SOME point", "created_utc": "1599922709.0", "edited": "False", "id": "g4xnphf", "is_submitter": "True", "link_id": "t3_ir4lxj", "parent_id": "t1_g4x4h9j", "score": "2", "subreddit": "dogs", "subreddit_id": "t5_2qhhk"}, {"author": "MinuteLibrarian", "body": "I was always told she’s too young to be doing that much exercise. They always say an excess of exercise can cause damage to the joints before her growth plates close and she’s only 6 months old", "created_utc": "1599922177.0", "edited": "False", "id": "g4xmnk4", "is_submitter": "True", "link_id": "t3_ir4lxj", "parent_id": "t1_g4wyoj9", "score": "1", "subreddit": "dogs", "subreddit_id": "t5_2qhhk"}, {"author": "MinuteLibrarian", "body": "Another very good point! It's actually so easy to forget 5 months isn't REALLY that long. It's been such a struggle raising her it feels like it's been years on my end. Just the first week I had her felt like months on its own.", "created_utc": "1599891819.0", "edited": "False", "id": "g4woaqj", "is_submitter": "True", "link_id": "t3_ir4lxj", "parent_id": "t1_g4wo1ir", "score": "4", "subreddit": "dogs", "subreddit_id": "t5_2qhhk"}, {"author": "MinuteLibrarian", "body": "This does make sense. I often wonder if my frustration with her only makes her frustration worse. She is a german shepherd mix. I have no idea what she's mixed with but people who have met her have posited other breeds like dutch shepherd, belgian shepherd, or belgian malinois. She's definitely very intelligent and high-energy just as german shepherds are said to be.", "created_utc": "1599891453.0", "edited": "False", "id": "g4wnwsv", "is_submitter": "True", "link_id": "t3_ir4lxj", "parent_id": "t1_g4wlyqg", "score": "3", "subreddit": "dogs", "subreddit_id": "t5_2qhhk"}, {"author": "MinuteLibrarian", "body": "This is a very good point! I understand the fact that she is an animal which means it would be kind of a mistake to project complex human feelings onto her. I suppose for me the biggest thing that would make me feel like we have a connection would be her trust. I don't feel like she DISTRUSTS me, but I don't feel that sense of trust that I guess I assumed I would have by now. She's selective about commands she follows and in social situations rarely takes cues from me. I suppose it's not that concerning considering how young she is and I might just have to adjust my expectations with her and just wait for the day where she decides I'm definitely her human.", "created_utc": "1599891191.0", "edited": "False", "id": "g4wnmwk", "is_submitter": "True", "link_id": "t3_ir4lxj", "parent_id": "t1_g4wk81h", "score": "3", "subreddit": "dogs", "subreddit_id": "t5_2qhhk"}, {"author": "MinuteLibrarian", "body": "Thank you for sharing! It's reassuring to hear it took long for others as well. I suppose I'm just constantly bombarded with people who claim to love their dogs every minute of every day and I'm sitting there thinking \"your dog is 12 weeks old...and you're not frustrated at all????\" But it helps to hear that regardless of how difficult it is right now it doesn't necessarily mean it won't improve down the line.", "created_utc": "1599890854.0", "edited": "False", "id": "g4wn9v0", "is_submitter": "True", "link_id": "t3_ir4lxj", "parent_id": "t1_g4wm22u", "score": "3", "subreddit": "dogs", "subreddit_id": "t5_2qhhk"}, {"author": "MinuteLibrarian", "body": "Thank you for sharing this! It's so valuable for me to know that there is very likely a bright future ahead when she grows up. I still live with my parents and I have no way of moving out in the foreseeable future but when I DO go I will have to take my pup with me and it's likely that for the majority of her life it'll just be the two of us. So it understandably makes me nervous that I'm not bonding with her. I do get some time away from her now and thn and when I do, I genuinely miss her but that affectionate feeling doesn't last very long.", "created_utc": "1599884006.0", "edited": "False", "id": "g4wer8e", "is_submitter": "True", "link_id": "t3_ir4lxj", "parent_id": "t1_g4w9nie", "score": "2", "subreddit": "dogs", "subreddit_id": "t5_2qhhk"}, {"author": "MinuteLibrarian", "body": "Yes exactly!!! I see so many people talk about their heart dog or their soul dog and people talk about how connected they feel to their tiny little puppies and I just...don't get it. I just don't! She is my first dog where I'm the main caretaker so I guess I just never factored how much the day-to-day frustrations of raising an animal might hinder affection you feel for them.", "created_utc": "1599883788.0", "edited": "False", "id": "g4wefwz", "is_submitter": "True", "link_id": "t3_ir4lxj", "parent_id": "t1_g4wdjso", "score": "9", "subreddit": "dogs", "subreddit_id": "t5_2qhhk"}, {"author": "MinuteLibrarian", "body": "Oh wow that's a really uplifting thought! I certainly hope that's the case haha she's really put me through the ringer. thank you for sharing your experience! I hope things get easier with your pup too. Honestly seems like we both ended up with dogs too smart and active for their own good.", "created_utc": "1599879965.0", "edited": "False", "id": "g4w8fij", "is_submitter": "True", "link_id": "t3_ir4mwz", "parent_id": "t1_g4w83pl", "score": "2", "subreddit": "puppy101", "subreddit_id": "t5_2rw7o"}, {"author": "MinuteLibrarian", "body": "Thank you so much for sharing this!! Sometimes it really feels like I'm the only one still frustrated with my dog after such a long time. Especially because everyone else who meets her absolutely loves her. It's actually so disheartening to hear other people say how great your dog is but it just feels like she's so awful at home. It helps to hear they grow out of things naturally. I genuinely feel like some of my friends who visit my pup are more bonded to her than I am. She certainly acts like it.", "created_utc": "1599879451.0", "edited": "False", "id": "g4w7mnj", "is_submitter": "True", "link_id": "t3_ir4mwz", "parent_id": "t1_g4w78x5", "score": "4", "subreddit": "puppy101", "subreddit_id": "t5_2rw7o"}, {"author": "MinuteLibrarian", "body": "Sounds like my pup. She could just be particularly mouthy, which is common in shepherd breeds (we have a gsd mix). Our pup also snarled at us when we would pick her up, handle her, do things she didn't like, etc. but she also was super friendly with others and had no resource guarding issues. I even posted an aggression question myself on this sub when my pup was 9 weeks old lol. She's 6 months now and definitely not aggressive. She's mouthy and a complete brat, but not aggressive. \n\nit is HIGHLY unlikely that your puppy is aggressive. Dogs who are aggressive tend to develop it later in life and the vast vast VAST majority of puppies are not being aggressive when they behave this way, no matter how terrifying it sounds when they growl at you. It's far more likely that she is reacting because of frustration. Some pups (mine included) have a very low frustration tolerance and biting is a natural way for them to react when they are frustrated. So of course, if she has discomfort from worms that would make it worse. If she hates being handled, that would make it worse.\n\nBite inhibition is difficult for some puppies and it might take her weeks to catch on. Right now she might be way too young to understand, but continue what you're doing. it takes a lot of consistent reinforcement with pups. I would also look up frustration tolerance in puppies and focus on ways to calm her down and positively condition certain things that make her react this way. It might not always be successful (our dog still hates being picked up) but I can tell you with almost complete certainty that your puppy doesn't have aggression issues and unless you have a lot of money to throw around, I highly doubt it's necessary to hire a professional at this point. 10 week old puppies are like babies in that they have hardly any brains. Hang in there, teething will only get worse before it gets better but take comfort in the fact that your pup's behavior is very very normal. She is mentally going to grow so much in the coming weeks and it'll become apparent much later what she might actually struggle with training-wise. Right now it's way too early to tell.", "created_utc": "1599877238.0", "edited": "False", "id": "g4w40yb", "is_submitter": "False", "link_id": "t3_ir0udh", "parent_id": "t3_ir0udh", "score": "3", "subreddit": "puppy101", "subreddit_id": "t5_2rw7o"}, {"author": "MinuteLibrarian", "body": "Oh man haha it’s so true! When I’m not feeling like socializing it’s kind of a hassle but otherwise it’s SUCH a fun time. I get stopped EVERY DAY by people asking how old she is, what kind of dog she is, exclaiming “LOOK AT THOSE EARS” (she’s a german shepherd mix and has yet to grow into her big ears) it’s truly adorable.", "created_utc": "1598228268.0", "edited": "False", "id": "g2n3gei", "is_submitter": "False", "link_id": "t3_if59s9", "parent_id": "t3_if59s9", "score": "2", "subreddit": "puppy101", "subreddit_id": "t5_2rw7o"}, {"author": "MinuteLibrarian", "body": "HIGHLY recommend puppy classes. they work wonders. Even if she's not fully vaccinated yet, puppy kindergarten should be safe for her as long as the facility you pick has vaccine requirements for their dogs. The other puppies who attend your class will all be between 8-16 weeks old. A few supervised classes with puppies her age will teach her very quickly.", "created_utc": "1598051589.0", "edited": "False", "id": "g2dm7yv", "is_submitter": "False", "link_id": "t3_idn59r", "parent_id": "t1_g2b0rt1", "score": "1", "subreddit": "puppy101", "subreddit_id": "t5_2rw7o"}, {"author": "MinuteLibrarian", "body": "Yes I think that makes sense. when I let her off the tether and sit on the couch she usually wants to sit next to me or play fetch.\n\nThank you so much for your opinion! Intellectually I know it's really no different from crating her or putting her in the kitchen with a baby gate but I think i've had it burned in my head that being tied up is no life for a dog. But it's not like she's alone or has nothing to do and we do take her places very frequently.", "created_utc": "1598051266.0", "edited": "False", "id": "g2dlmyh", "is_submitter": "False", "link_id": "t3_idpd1m", "parent_id": "t1_g2czxft", "score": "1", "subreddit": "puppy101", "subreddit_id": "t5_2rw7o"}, {"author": "MinuteLibrarian", "body": "Oh wow thank you! Yeah, she seems perfectly fine tethered. She’ll chew on the leash sometimes but it’s the same way she chews on everything near her mouth, it’s never seemed like an escape attempt to me. \n\nFor some reason however, she doesn’t like being tethered while people are sitting on the couches away from her. She’s okay if I’m in the kitchen which doesn’t make sense to me because she doesn’t have access to the kitchen either so I have no idea why she would prefer it over the couches. This seemed like an attention seeking thing to me because she does it even if she’s just been walked and is definitely tired. But otherwise, she seems quite comfortable. She plays with her toys and chews and never really gets tangled either.", "created_utc": "1598028026.0", "edited": "False", "id": "g2caemc", "is_submitter": "False", "link_id": "t3_idpd1m", "parent_id": "t1_g2b5bes", "score": "2", "subreddit": "puppy101", "subreddit_id": "t5_2rw7o"}, {"author": "MinuteLibrarian", "body": "Yeah our puppy’s biting was at its worst during that time. Any attempt to cuddle with her was risking getting my fingers bitten off. Once she was closer to 4-5 months old it got MUCH better. See how she is after she starts getting some of her big girl teeth", "created_utc": "1598026180.0", "edited": "False", "id": "g2c62jh", "is_submitter": "False", "link_id": "t3_idmuqb", "parent_id": "t1_g2bv5o7", "score": "1", "subreddit": "puppy101", "subreddit_id": "t5_2rw7o"}, {"author": "MinuteLibrarian", "body": "this exact same thing happened to me. Our pup started getting picky with her food around this time too and coincidentally was also taking amoxicillin. try mixing some wet food or low sodium chicken broth in with her kibble. I wouldn't give her a whole lot of human food because you might never recover from it and she'll start expecting it. If you're putting the pill in her food, stop doing that. I tried that with our pup and it worked in the beginning because she loved her food but the pill might have been what made her nervous. I started putting the pill in greenies pill pockets after her meals and she always ate them no problem. it took a little while for her to warm up to her kibble afterwards. Puppies can get picky just like children and it can happen pretty suddenly sometimes. Once our pup realized there was nothing special about her kibble since she was getting it every day she was so much less excited about it. it's possible the medication is killing her appetite too. HOWEVER, I think you should call your vet and ask for some advice about feeding her and her appetite just in case they have more suitable advice for you.\n\nas far as the sleeping, that's pretty normal for growing pups. make sure she's getting enough water since dehydration can cause lethargy. but especially for large breed pups, constant growth spurts are very normal and usually pups need a little extra sleep because of it. our pup is 5 months and has been sleeping rather a lot and i asked my vet about it literally today and she said large breed dogs grow so fast they literally get growing pains and just need the extra rest. you can ask your vet about this too but as long she seems active and playful while she's awake it's probably nothing. If you're still worried after speaking to your vet, don't be afraid to call a different vet and get a second opinion.", "created_utc": "1597989391.0", "edited": "False", "id": "g2at99h", "is_submitter": "False", "link_id": "t3_idkhky", "parent_id": "t3_idkhky", "score": "1", "subreddit": "puppy101", "subreddit_id": "t5_2rw7o"}, {"author": "MinuteLibrarian", "body": "Worms are pretty common in puppies. Take her to see a vet ASAP. Do a walk-in. Deworming is fast and quite cheap. Don't delay, worms can be harmful to puppies and tapeworms especially can be transferred easily to your other dogs. It is possible to transfer to humans too, I just wouldn't let your pup lick your face. Your puppy probably has to be dewormed twice, once for the worms already there and again for the eggs that will hatch later. Definitely take her to a vet to be checked no matter what your breeder offers.", "created_utc": "1597988316.0", "edited": "False", "id": "g2aryte", "is_submitter": "False", "link_id": "t3_idl5zb", "parent_id": "t3_idl5zb", "score": "2", "subreddit": "puppy101", "subreddit_id": "t5_2rw7o"}, {"author": "MinuteLibrarian", "body": "oh man. it's like I wrote this. I answer you from the other side. I am so sorry for the long response, but when I was going through it, I would've appreciated every detail.\n\nSo it sounds like you may have also gotten your puppy a little too early. (I got mine at 5 weeks, and they say puppies shouldn't be separated from litter before 8 weeks.) the anxiety of this was alone was enough to eat me alive. (For the record, despite the fear-mongering you read online, these puppies can still be fine. Just make sure your pup meets a lot of people, and enroll in puppy class as early as you are able and be consistent with going. As long as your pup is socialized with people, dogs, and different places early and consistently, you should be fine.) \n\nDon't be afraid to look up different things that might help. Crating, tethering, x-pens, etc. Don't be afraid to try things that might make life easier for you. (For instance, everyone says you have to take your pup out at night for potty training. The lack of sleep made my anxiety so bad I couldn't do anything anymore. So I got our pup an x-pen attachment for her crate and left pee pads overnight, fully knowing I might be extending our potty training ordeal. But I NEEDED to sleep so I went against people's advice because it didn't seem like something that would be too terrible. I was right. She peed on the pads and not in her crate and the added upside was that she learned to be alone overnight while she's sleeping. She's 5 months now and doesn't pee in the house, even at night)\n\nSo around 13 weeks is when my puppy was at her WORST. The biting was terrible and I was at my wit's end even though she was sleeping through the night at that point. I say this because it would've been helpful for me to know when the bad behavior was going to peak. (3 month mark, for me and for a lot of others). Keep trying. Try puppy school, tether training (this was really helpful for us), x-pen playtime, and bully sticks to keep your pup busy and away from body parts he wants to chew. (bully sticks are the LONGEST lasting chews i've found and they are safe for puppies as long as he's supervised and has plenty of water.) I also recommend kong toys to keep your pup busy. \n\nBy 13 weeks my blues were so bad I actually contacted a rescue who had homes lined up for puppies. I was convinced I couldn't keep her, I had never felt so terrible and anxious in my life and it had been WEEKS by that point. I thought I couldn't take it. The day I was supposed to confirm with the rescue, I knew I couldn't go through with it. Anything I was going through taking care of her was nothing compared to letting her go. I know how bad that pain is, so I could never judge anyone who feels like they can't keep their puppy. It's SO so hard. But I did end up keeping mine. and I'm so glad I did because by 16 weeks EVERYTHING WAS SO MUCH BETTER. The potty training, the biting, the anxiety. Just SO MUCH BETTER. I was finally able to appreciate my pup more than I worried about her or was frustrated about her. Now at 5 months, I finally feel like I have a life again. She goes to daycare and puppy school and is so much better around the house. It DOES get better. It might not feel like it, it might feel like you're going backwards, things are getting worse, everything is going wrong but I promise it's just slow improvement and one day soon (probably around the 16 week mark) you're gonna realize the worst days are behind you.", "created_utc": "1597988075.0", "edited": "False", "id": "g2aro6u", "is_submitter": "False", "link_id": "t3_idlaff", "parent_id": "t3_idlaff", "score": "2", "subreddit": "puppy101", "subreddit_id": "t5_2rw7o"}, {"author": "MinuteLibrarian", "body": "our biggest lifesaver was tethering our dog. She was an absolute LANDSHARK. We started tethering her somewhere near us so she could still reach us but not close enough to nip. We tethered her with her harness on and with toys and treats so she still had stuff to do. 13 weeks is when she was at her absolute WORST. the nipping was terrible, she'd drawn blood and left a scar, and my blues were so bad I was completely hopeless. It got so much better around the 16 week/4 month mark. honestly, bite inhibition just takes a long time to work.\n\nI would try tethering your pup nearby. Try to start really close so she might not even notice she's tied up if she has something to do. Make it fun, take it slow and hopefully she'll get use to it and won't have free roam of the house to come up and bite whenever she wants. You can move away from her if she bites and she can't come after you. It's possible the loud voice just makes her think you're playing and escalates the situation. this was the case with my puppy. yelping doesn't work for all puppies, my puppy never responded to noises of pain from me or anything. I moved to just saying \"no\" very normally and getting up and walking away.", "created_utc": "1597985351.0", "edited": "False", "id": "g2ao3o8", "is_submitter": "False", "link_id": "t3_idlfkp", "parent_id": "t3_idlfkp", "score": "2", "subreddit": "puppy101", "subreddit_id": "t5_2rw7o"}, {"author": "MinuteLibrarian", "body": "It might be fine honestly, especially if you're already enforcing crate time and he still doesn't nap. My pup also had an issue with getting overly nippy when she was tired, so I would enforce nap time. Sometimes she would cry but honestly I waited it out and sometimes she would eventually just fall asleep. Their nap schedules can fluctuate as they get older. When our puppy was younger, around 8-10 weeks, I couldn't get her to nap longer than one hour. the guideline is 1 hour awake 2 hours asleep and we were doing 2 hours awake 1 hour asleep. Her napping habits changed as she got older. Sometimes she would sleep for longer or shorter. She's 5 months now and since she was about 16 weeks she's been napping like 4 hours in the morning.", "created_utc": "1597984950.0", "edited": "False", "id": "g2anjry", "is_submitter": "False", "link_id": "t3_idlttl", "parent_id": "t3_idlttl", "score": "1", "subreddit": "puppy101", "subreddit_id": "t5_2rw7o"}, {"author": "MinuteLibrarian", "body": "How old is she?? Our pup is 5 months old and is literally JUST starting to understand cuddling. Once her adult teeth started coming in it was so much better. She actually licks me when I pet her now. She used to try eating my face off.", "created_utc": "1597984501.0", "edited": "False", "id": "g2amwxq", "is_submitter": "False", "link_id": "t3_idmuqb", "parent_id": "t3_idmuqb", "score": "2", "subreddit": "puppy101", "subreddit_id": "t5_2rw7o"}, {"author": "MinuteLibrarian", "body": "I honestly think there's still hope. He's still young enough to improve with enough reinforcement. I would highly recommend a puppy class/puppy playtime with other older puppies. The benefit of these classes is there will often be other big dogs like yours and the smaller puppies are older so they feel okay with bigger dogs PLUS there is the added benefit of having a handler or a trainer who can help with correcting your dog's behavior. It might be slow going but it IS possible. People act like there's no hope for dogs over 16 weeks and it's just not true. Even older puppies learn a LOT from continuous socialization and 6 months is still pretty young, especially for a newfie. \n\nI got my GSD puppy at 5 weeks and was TERRIFIED at the prospect of her being badly socialized because she was separated from her litter too early. She has learned a lot from puppy class and puppy socials with other dogs her age and size. She's doing great now. We take her to Zoom Room which has training classes for dogs of all ages and a bunch of different locations. They have supervised puppy playtime for older puppies aged 4 - 8 months. Last puppy playtime I took her to, there was a newfie AND a great dane. If there's a zoom room near you i HIGHLY recommend it. If not, plenty of training centers have a puppy kindergarten for younger and older puppies. It's a great way to have supervised socialization for your dog and you might meet other people with big dogs like yours, which may make learning for your dog a little easier.", "created_utc": "1597984102.0", "edited": "False", "id": "g2amc3g", "is_submitter": "False", "link_id": "t3_idn59r", "parent_id": "t3_idn59r", "score": "1", "subreddit": "puppy101", "subreddit_id": "t5_2rw7o"}, {"author": "MinuteLibrarian", "body": "Unfortunately the truth is she's too young to get it. You seem to be doing great bite inhibition training, and while it does work quickly for some puppies, the vast majority need months of consistency before they stop biting. My best advice is to continue what you're doing and don't be discouraged if it sometimes seems like your pup is actually getting worse. ESPECIALLY because she's a retriever breed and they're on the list of breeds for whom the biting months are a particular nightmare. Ours is on the same list (german shepherd mix) and it was months of ankle nipping and finger chewing before she finally started to understand. You might read some incredible bite inhibition success stories from others. For retriever and herder owners, it's a slog through the teething months.\n\nI don't want to freak you out, but it might not completely stop until all her adult teeth are in (around 6 months). Our puppy is 5 months old now and it's just in the last few weeks I've started to notice her getting better. She bites less and is much gentler when she does decide to chew on me. Her worst biting stage was between 11 and 16 weeks and it nearly drove me crazy. After this, her adult teeth started to come in and I finally noticed a difference. Continue what you're doing, and as she gets older and inevitably more excitable, keep a close eye on her interactions with the kids. If at any point she seems too excited, jumping up and zooming around, etc, I would separate her from the children until she's calm or had a nap. Zoomies have led to some nasty bites in my household which hurt like hell even for adults. \n\nBest advice I can give besides what you're already doing:\n\n1. Enroll her in puppy school as early as possible. Just one or two sets of shots should make this perfectly safe for her. We've been going to Zoom Room and I have loved the experiences she has there. She's learned so much from the trainers and other dogs. They have locations around the country and are very affordable compared to private training. Wherever you choose, just make sure they roll with positive reinforcement training, have supervised puppy social time, and have current vaccine requirements for all their dogs.\n2. From 8 weeks, our puppy had a serious issue with self-settling that was related to her biting. Once I noticed she was getting NIGHTMARE nippy and couldn't calm down I enforced naptime in her crate/x-pen. She would cry a little and then go to sleep and was much better when she woke up.\n\nHang in there!! Our puppy's biting was such a nightmare that for a long while I wasn't sure if we were the right home for her. But if you stick it through, I promise your retriever is going to be a loving and faithful companion for your family for years to come.", "created_utc": "1597420997.0", "edited": "False", "id": "g1gcrqo", "is_submitter": "False", "link_id": "t3_i9lx3w", "parent_id": "t3_i9lx3w", "score": "2", "subreddit": "puppy101", "subreddit_id": "t5_2rw7o"}, {"author": "MinuteLibrarian", "body": "Okay some people have some really deep answers and I just came here to say I really fucking miss 3D Doritos. They were so good.", "created_utc": "1595597310.0", "edited": "False", "id": "fz36ypv", "is_submitter": "False", "link_id": "t3_hww1qp", "parent_id": "t3_hww1qp", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "MinuteLibrarian", "body": "My grandfather died very suddenly about thirteen years ago after a brain cancer diagnosis. He went from being the picture of health to just completely vanishing in the span of three months. He was the kind of person everyone loved and it was honestly horrific to witness for our whole family. I was only 11 years old and absolutely shattered about it. My grandparents had practically raised me. The days following his death, when everyone was frequenting my grandparents’ house to aid our mourning, I was doing everything possible to stay out of the house. At one point I went down into the garage of the apartment complex, which was a place I’d spent so much of my childhood playing. On the wall was a chalk drawing my grandfather had done. In their parking spot was the 1994 Camry that he had loved driving. It was covered in dust since no one had driven it since his diagnosis. I was so overwhelmed in the moment that for some strange reason I wrote in the dust on his car “we miss you.” I knew it wouldn’t reach him, I did it more for me. \n\nLater on our way home my mom started crying saying that someone had left a kind message on my grandpa’s car. I don’t know that it occurred to her that someone in the family may have done it. She took it as a sign that my grandfather had been so widely loved, some completely unrelated person, totally random, might have left that message. (Honestly, given how infectious my grandpa’s happiness had been, it isn’t that implausible) I think the idea gave her some comfort at the time. She still tells the story sometimes when she’s feeling sentimental. I never told her it was me. I didn’t want to take the magic out of it.", "created_utc": "1595596814.0", "edited": "False", "id": "fz3651m", "is_submitter": "False", "link_id": "t3_htuyh5", "parent_id": "t3_htuyh5", "score": "5", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "MinuteLibrarian", "body": "I don't think it's really that it CAN'T be done but rather that it's going to be so much more difficult than you might imagine. I see there are people saying it's possible and it IS except that it might be one of the hardest things you ever do. We got a pup a couple months ago (she's 4 months now) and honestly there is no way I would have managed taking care of her if my entire family wasn't home because of COVID. I don't know if you've ever had puppies before where you were the main caretaker, but honestly I wouldn't recommend a puppy to anyone unless they know they love raising puppies. Puppies are kind of awful lol especially if you don't have all hands on deck. Just the sleep loss alone would've made me crazy if I was still working while taking care of her. I KNEW it would be super hard to raise a pup and I was still blindsided by how difficult it really is. They really are like babies and babies need pretty constant supervision. You don't have a life anymore while they're still really small.\n\nLike others, my best recommendation is really to get an older dog. If you REALLY want a pup, the absolute youngest I would recommend is 4 months. By this age they're mostly sleeping through the night without needing potty breaks, they have all their shots so they can go walking, and they're old enough to consider spay/neuter so they could go to daycare. Before 4 months, your options for puppy care are severely limited and would likely be very expensive. I know this seems like really harsh advice but I wish someone had told me in the beginning the details of how hard it is.", "created_utc": "1594910168.0", "edited": "False", "id": "fy98ge5", "is_submitter": "False", "link_id": "t3_hs6zrw", "parent_id": "t3_hs6zrw", "score": "5", "subreddit": "puppy101", "subreddit_id": "t5_2rw7o"}, {"author": "MinuteLibrarian", "body": "thank you, this is reassuring to hear. I'm glad your puppy is okay.\n\nMy main concern is my family won't listen to me and will continue putting me in situations where my pup has to interact with Roxy. They fully ridiculed me for being upset and thought the interaction went well when really nothing could be further from the truth.", "created_utc": "1592768242.0", "edited": "False", "id": "fvkdyvg", "is_submitter": "False", "link_id": "t3_hdbk47", "parent_id": "t1_fvkankb", "score": "2", "subreddit": "puppy101", "subreddit_id": "t5_2rw7o"}, {"author": "MinuteLibrarian", "body": "Thank you so much for this response. It's incredibly helpful. My family is in support of giving her away. They don't feel they can handle her and I certainly can't without their support.\n\nThe issue is that it's hard now and I don't know that the future will be easier. I know she will get easier as she grows, but since my life is so in flux I can't help but think it's just going to be a series of issues that will need solutions and I don't know that I will be able to adequately provide them. If it was only one or two things I was concerned about, it might be easier, but it's a combination of factors that seems to be making this exceptionally difficult. If I had even one thing about this situation that I knew was stable I would at least have something to lean on. If I do go back to school I have no idea how much time I would have for her and she would probably have to be in an apartment. I can train her for these things of course, and ask for help, or hire a dog walker. There are options for any situation. But I find the combination of concerns just make this overwhelming for me and I know there must be a family out there who will be able to give her the kind of space and care that I may never be able to provide.\n\nOf course on the other hand, she's my dog and I love her to death even when she's biting wounds into my hands. It's just so hard to think of giving her away.", "created_utc": "1592186918.0", "edited": "False", "id": "fuuzlci", "is_submitter": "True", "link_id": "t3_h92fjr", "parent_id": "t1_fuuey7l", "score": "2", "subreddit": "puppy101", "subreddit_id": "t5_2rw7o"}, {"author": "MinuteLibrarian", "body": "This sudden fatigue happened to me as well with almost no other symptoms. Vet said she was dehydrated and needed a puppy electrolyte solution and regular water wouldn’t cut it. he recommended chicken broth or adding a little salt to their regular water. You can look up a good ratio for puppies :)", "created_utc": "1592173738.0", "edited": "False", "id": "fuucsta", "is_submitter": "False", "link_id": "t3_h91xe1", "parent_id": "t3_h91xe1", "score": "1", "subreddit": "puppy101", "subreddit_id": "t5_2rw7o"}, {"author": "MinuteLibrarian", "body": "Thank you for the reply! I've thought about using a leash but she absolutely HATES it. she will do everything she can to wriggle out of her harness and she is successful 9 times out of 10. To get her used to being comfortable on a leash and harness I will take her outside after putting it on to the front yard where she is normally never allowed (because it's not fenced off and she's not yet old enough to go for walks). This is the only time she's okay being harnessed and doesn't try to escape because she's interested in her new surroundings.\n\nOnce she's used to having it on and being led around on a leash I'll try to use it more often. She learns fast and isn't excessively fussy, she can just be so temperamental sometimes.", "created_utc": "1589994835.0", "edited": "False", "id": "fr9bhkm", "is_submitter": "False", "link_id": "t3_gnee32", "parent_id": "t1_fr9agkw", "score": "1", "subreddit": "puppy101", "subreddit_id": "t5_2rw7o"}]