[{"author": "MissXHD", "body": "English 99% of the time - I sometimes catch myself having to translate English thoughts to my native language whenever I have to speak in it. \n\nI dream in English as well, but I had a dream in Korean recently! I can clearly recall myself speaking in Korean in my dream. I wish I could have only understood what I was saying…", "created_utc": "1663167152.0", "edited": "False", "id": "ioej99l", "is_submitter": "False", "link_id": "t3_xdszfu", "parent_id": "t3_xdszfu", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "MissXHD", "body": "감사합니다!", "created_utc": "1662785923.0", "edited": "False", "id": "intk8ud", "is_submitter": "True", "link_id": "t3_x9n96q", "parent_id": "t1_inry8vi", "score": "2", "subreddit": "WriteStreakKorean", "subreddit_id": "t5_3ij1p6"}, {"author": "MissXHD", "body": "감사합니다! \n\n사실 우리는 이미 6월에 그 프로젝트를 시작하셨어요...", "created_utc": "1662785693.0", "edited": "False", "id": "intjwcv", "is_submitter": "True", "link_id": "t3_x9n96q", "parent_id": "t1_inp5p8n", "score": "2", "subreddit": "WriteStreakKorean", "subreddit_id": "t5_3ij1p6"}, {"author": "MissXHD", "body": "My pleasure. It took me some time to find a system that works for me. I hope it will help you with your studying as well.", "created_utc": "1662782909.0", "edited": "False", "id": "intfdre", "is_submitter": "False", "link_id": "t3_xa1hp8", "parent_id": "t1_inryqwt", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "MissXHD", "body": "Messing up and making the same mistakes - it's normal and it will happen. The more you use a word/grammar the fewer mistakes you'll be making.\n\nI usually post the same thing in 2-3 different places and tend to get different corrections from different natives. I guess there are 10 different ways of saying the same thing in any language.\n\nI analyze the corrections, try to understand the reason on my own and - if possible - ask the native speaker why they made the correction.\n\n**Wrong grammar -** I add a comment in my notes with the corrected version and the grammar rule info  (I use Notion for that). Sometimes I'm grammatically correct, but it just doesn't sound natural.\n\n**Wrong word -** same as above - check/ask why, google \"word A\" vs \"word B\" to understand the difference. Check how it is used in a different context.\n\nFor both grammar and vocab, I find 2-3 new sentences and add them to my flashcards for a quick review. I don't try to memorise them all word for word. They are just a reminder and a way to see the word/grammar in context. I go through the flashcards several times a week for like 5-10 min and add new sentences almost daily.\n\nSomething that is very important - I make sure to use the corrected grammar / word in the next couple of posts to solidify what I've learned. Sometimes I will just scan the list and see which ones I haven't used in a while or don't remember well and make sure to include them in the next post. It works for me so far. Repetition is the key.", "created_utc": "1662754737.0", "edited": "False", "id": "inrrpt1", "is_submitter": "False", "link_id": "t3_xa1hp8", "parent_id": "t3_xa1hp8", "score": "6", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "MissXHD", "body": "Thank you for the suggestion!", "created_utc": "1662702598.0", "edited": "False", "id": "inoyhyn", "is_submitter": "True", "link_id": "t3_x8srfo", "parent_id": "t1_inowh8h", "score": "1", "subreddit": "WriteStreakKorean", "subreddit_id": "t5_3ij1p6"}, {"author": "MissXHD", "body": "감사합니다!", "created_utc": "1662651465.0", "edited": "False", "id": "inln7hk", "is_submitter": "True", "link_id": "t3_x7wwn7", "parent_id": "t1_injqhxy", "score": "1", "subreddit": "WriteStreakKorean", "subreddit_id": "t5_3ij1p6"}, {"author": "MissXHD", "body": "설명해 주셔서 감사합니다", "created_utc": "1662651451.0", "edited": "False", "id": "inln66r", "is_submitter": "True", "link_id": "t3_x7wwn7", "parent_id": "t1_ink3psn", "score": "1", "subreddit": "WriteStreakKorean", "subreddit_id": "t5_3ij1p6"}, {"author": "MissXHD", "body": "How learning languages changed my thinking? Hmm..\n\nIt helps me keep my inner perfectionist at bay and changed the way I approach receiving and giving feedback. \n\nIt sharpens my logical and analytical thinking.\n\nWhen the phone rings, I’m sometimes confused in which language should I say hello. \n\nI’ve noticed recently that while typing in EN I sometimes use t/k/p instead of d/g/b as the first letter of a word - it’s my brain’s cute attempt at remembering (and applying) Korean sound changes. Good try, wrong language.\n\nIt scrambled my native vocabulary. When I go back to Poland, for the first days I tend to randomly use the wrong words for things. Instead of “thank you”, I’d say “ good night” and so on. It gives my family a good laugh each time.\n\nIt widened the ocean of empathy I have for anyone who struggles with expressing themselves with words.", "created_utc": "1662567568.0", "edited": "False", "id": "inguhr1", "is_submitter": "False", "link_id": "t3_x7m8tj", "parent_id": "t3_x7m8tj", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "MissXHD", "body": "고맙습니다!", "created_utc": "1662526628.0", "edited": "False", "id": "inev55c", "is_submitter": "True", "link_id": "t3_x7217k", "parent_id": "t1_inab4m5", "score": "1", "subreddit": "WriteStreakKorean", "subreddit_id": "t5_3ij1p6"}, {"author": "MissXHD", "body": "I think I’m more social and bubbly when using English. I don’t speak Korean well enough to have a personality. \n\nMy voice changes, though. I have the highest pitch in Polish, then much lower in English and Korean is just slightly above my English pitch. It might actually change the way I’m perceived by others.", "created_utc": "1662454890.0", "edited": "False", "id": "inaiqz0", "is_submitter": "False", "link_id": "t3_x6ktsr", "parent_id": "t3_x6ktsr", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "MissXHD", "body": "The 500 verb endings that can change the feel of a sentence and the intention of a speaker. Plus the slight nuances between words. “They mean the same, but…” is the most common answer I get.", "created_utc": "1662397600.0", "edited": "False", "id": "in7epzq", "is_submitter": "False", "link_id": "t3_x55f23", "parent_id": "t3_x55f23", "score": "2", "subreddit": "Korean", "subreddit_id": "t5_2rd8q"}, {"author": "MissXHD", "body": "What others said - once you reach a certain level, you just don’t forget it completely. \n\nI reached upper-intermediate level of German as a teen, but I haven’t used it in the last 18+ years. I decided to give it a go again last week. I’m spooked by the amount of German I can understand passively. \n\nNo reviews or grammar studying, I went straight for upper-beginner short stories. I can easily read through them with nearly 98% comprehension. I watched Last Kingdom on Netflix over the weekend and I was able to follow without subtitles for like 80% of the time. \n\nSpeaking is a completely different story, but I guess it will come back with time.", "created_utc": "1662395734.0", "edited": "False", "id": "in7a0jc", "is_submitter": "False", "link_id": "t3_x6iy9i", "parent_id": "t3_x6iy9i", "score": "27", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "MissXHD", "body": "I changed my morning routine completely and dedicated it to studying Korean. I'm too exhausted after 8-9 hours of work to do any serious studying in the afternoon. \n\nI wake up at 5:40, quick shower and first coffee. I usually start studying around 6am for \\~1.5h (1 TTMIK grammar lesson, reading, review of previous day, journaling) and then go for a walk with my dog (the same TTMIK lesson on Spotfiy). After that I try to sneak some Korean in during the day, but it's mostly passive studying and more for pleasure. I'll watch some K-drama, listen to a podcast or audiobook or chat with a friend in Korean. I have k-pop/indie playing all day long. \n\nOn most days, I'll do a quick Quizlet/flashcards before I go to bed (someone already mentioned it - getting enough sleep is the key to having a fresh mind ready for learning things. 7-8h a night is a sweet spot for me. I had to start going to bed much earlier, but it was worth it)\n\nI keep the same schedule on the weekends as well. I just increase the passive input.", "created_utc": "1662376261.0", "edited": "False", "id": "in65rfg", "is_submitter": "False", "link_id": "t3_x5pc6r", "parent_id": "t3_x5pc6r", "score": "2", "subreddit": "Korean", "subreddit_id": "t5_2rd8q"}, {"author": "MissXHD", "body": "고맙습니다 쌤!", "created_utc": "1662374884.0", "edited": "False", "id": "in63zo1", "is_submitter": "True", "link_id": "t3_x5f5se", "parent_id": "t1_in5q1v5", "score": "1", "subreddit": "WriteStreakKorean", "subreddit_id": "t5_3ij1p6"}, {"author": "MissXHD", "body": "You don’t need native speakers to practice, just find someone who knows English much better than you and is willing to talk with you in it.\n\nIf you can, get a job that requires you to use English on a regular basis (I know it might not be possible for everyone). I’ve been working for the last couple of years for a company that uses English as their official language (in a non-English speaking country). There’s just a couple of natives in a 400+ people company, but we have hundreds of fluent/near-native speakers from all over the world. My English skyrocketed after just a couple of months.", "created_utc": "1662374401.0", "edited": "False", "id": "in63dny", "is_submitter": "False", "link_id": "t3_x6a27k", "parent_id": "t3_x6a27k", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "MissXHD", "body": "고맙습니다! 폴란드에서도 우유맛아이스크림과 같은 아이스\b크림이 있는 것 같아요. 정말 좋아요.", "created_utc": "1662303955.0", "edited": "False", "id": "in292vo", "is_submitter": "True", "link_id": "t3_x5f5se", "parent_id": "t1_in1vt9p", "score": "1", "subreddit": "WriteStreakKorean", "subreddit_id": "t5_3ij1p6"}, {"author": "MissXHD", "body": "True that. We can't forget about the goal set on the horizon, even if we have to crawl our way towards it through small talk and other scary things.", "created_utc": "1662231517.0", "edited": "False", "id": "imykz82", "is_submitter": "False", "link_id": "t3_x42n5q", "parent_id": "t1_imygtal", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "MissXHD", "body": "Me too! Sadly, for most of the mentioned topics you need to get to an (upper)intermediate level first before you are able to express yourself well. We are doomed for years of solitude and learning until then (not that I mind it). With my basic Korean and German, I can barely manage to keep up with small talk. Boring as hell!", "created_utc": "1662229024.0", "edited": "False", "id": "imyezpc", "is_submitter": "False", "link_id": "t3_x42n5q", "parent_id": "t1_imydnwv", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "MissXHD", "body": "Introvert with social anxiety and dislike for small talk here! Add being an overthinking perfectionist to the mix and you have a recipe for a disaster of a language learner… I still love learning languages, I just prefer the written form of communication. \n\nThe only reason I speak English fluently is that I needed it for work and, after becoming a manager, I have to go through 15-20h of meetings a week and explain abstract concepts to people. Thank gods they don’t expect me to do any public speaking!", "created_utc": "1662224073.0", "edited": "False", "id": "imy2wn0", "is_submitter": "False", "link_id": "t3_x42n5q", "parent_id": "t3_x42n5q", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "MissXHD", "body": "Oh! I’m not alone! Introverts unite (separately in your own homes).", "created_utc": "1662223064.0", "edited": "False", "id": "imy0dbu", "is_submitter": "False", "link_id": "t3_x42n5q", "parent_id": "t1_imvbdpe", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "MissXHD", "body": "상세한 설명에 고맙습니다!  저는 아직 초보자라서 배워야 할 것이 많아요.", "created_utc": "1662218709.0", "edited": "False", "id": "imxpke1", "is_submitter": "True", "link_id": "t3_x4tkrl", "parent_id": "t1_imxjus3", "score": "2", "subreddit": "WriteStreakKorean", "subreddit_id": "t5_3ij1p6"}, {"author": "MissXHD", "body": "I use a combination of digital and analog notes. Anki is my go-to tool for vocabulary, I have 2 separate decks - one pre-made deck (How to Study Korean) that I customized with extra notes/examples and one for words/phrases I pick up from reading / watching videos / song lyrics.\n\nI refer to Darakwon's grammar book whenever I want to check some rules. I used to have a separate notebook just for grammar, but it felt redundant and I don't use it any more. I have a separate Anki deck for grammar - it's mostly cloze cards with some grammar notes here and there.\n\nSo far I went through several \"dirty\" notebooks for writing practice - it's my favorite playground where I don't really care about the aesthetics and allow myself to be super messy. It helps me keep my inner perfectionist at bay - I love beautiful notes and calligraphy, but they just take a lot of time that I'd rather use for practice. I use iOS Notes/Pages for my daily short stories/journal entries (the first few drafts are always in my dirty notebook, though, as I really enjoy writing in Hangul by hand).\n\nMy secret weapon are post-its - I have a bunch of them all over the place at any given time. I use them as temporary condensed grammar rules reminders, to add extra comments / observations / examples in the grammar book or to note down new words I encountered that day. The latter usually end up in my dirty notebook (plus in my Anki deck as new cards). Whenever I have a difficulty with remembering a specific word or a phrase, I put it on a post-it somewhere where I'll see it often.", "created_utc": "1637402083.0", "edited": "1637402517.0", "id": "hldbspf", "is_submitter": "False", "link_id": "t3_qxyo3z", "parent_id": "t3_qxyo3z", "score": "5", "subreddit": "Korean", "subreddit_id": "t5_2rd8q"}, {"author": "MissXHD", "body": "I do the same - it really helps me memorize more words. I sometimes mix English with other languages I know if they sound similar or have a similar spelling. The funnier or more abstract, the better. Some of my favorites so far:\n\n**피곤하다** = a bunch of **tired** *pigeons* sitting on my sofa = to be tired\n\n**맞다** = *Matka* (PL: Mother) is always **right** = to be correct\n\n**건너다** = *Konno da* rade (PL: by horse it is possible) **to** **cross** the street = to cross\n\nThe connections were very prominent at first, but now it's just a fraction of a second or just a glimpse of an image without any real words attached to it (like a bunch of tired pigeons sitting on my sofa). Sometimes my funny little sentences pop into my head after I say/hear the word first, so I guess they'll turn into a subconscious thing at some point.", "created_utc": "1636757409.0", "edited": "False", "id": "hke2e3h", "is_submitter": "False", "link_id": "t3_qsk14p", "parent_id": "t3_qsk14p", "score": "2", "subreddit": "Korean", "subreddit_id": "t5_2rd8q"}, {"author": "MissXHD", "body": "I'm pretty chaotic when it comes to expressing my thoughts while speaking. I'm just an overthinker who wants to express thoughts clearly and precisely, but is super bad at improvisation. My perfectionism was holding me back a lot here, so I simply gave up at some point and shifted my focus to communication.\n\nI work for a German company that operates fully in English, so I use it predominantly with non-native English speakers from all over the world.  We all are on different levels and make a bunch mistakes, but also learn from each other (and have a lot of laugh while doing that). It doesn't change the fact that my inner overthinker takes over sometimes and makes me worried that everyone will talk for weeks about the grammar or spelling mistakes I did in a PowerPoint presentation...\n\nI know that sometimes I speak English following Polish grammar rules and can sound like an illiterate person in my own native language, especially after not using it for weeks. When I'm tired my accent gets much heavier and I sound like a Russian mobster. I just make fun of it - it does take the pressure off.", "created_utc": "1636742474.0", "edited": "1636743284.0", "id": "hkd3y1l", "is_submitter": "False", "link_id": "t3_qs85yo", "parent_id": "t3_qs85yo", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "MissXHD", "body": "Yes. I currently use my L2 (English) to learn both Korean (L4) and refresh my German (L3). Learning the grammar of these 2 languages in English is easier as well, as my native one is just plain crazy (Polish). The interesting thing is that I've learnt some new English words along the way. Additionally, there's just abundance of resources in English, especially for Korean. \n\nSometimes I will use some Polish or German for my Korean flashcards or when I'm using the mnemonic technique to remember things better. As in \"Matka is always right\" = \"mother is always right\" = \\[matta\\] which means \"to be correct\". Whenever I feel over-confident, I will watch series in Korean with German subtitles and vice versa, but that's more for fun and not necessarily a very productive use of my time.", "created_utc": "1636701487.0", "edited": "False", "id": "hkb2h25", "is_submitter": "False", "link_id": "t3_qs24ib", "parent_id": "t3_qs24ib", "score": "8", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "MissXHD", "body": "If you have the time and can do it without any harm to yourself, your relationships and life in general, go for it! I completely get your perfectionist approach to learning languages. I have it with all my hobbies - do it at 110% or don't waste your time.\n\nI really enjoy learning new things/skills in general and I will get \"slightly\" obsessed with perfecting them, to the point I start neglecting everything else. When I decided to learn how to knit, it didn't end on a simple hat or a pair of socks. I just \"had\" to learn how to do the most intricate lace, how to dye and spin my own yarn, not to mention learning the history and different knitting styles of half of the world! I could easily have 12h knitting sessions over the weekends and use all the free time I had during the week on it (crazy, I know).\n\nI discovered that turning language learning into a controlled daily habit helps me a lot with making a steady progress while not getting totally obsessed and consumed by it. If I didn't do that, I'd most likely binge-learn all day long - with harm to my work and private life. I spend around 1h, sometimes 2h a day on active learning (beginner Korean + refreshing German) and then I add a bunch of passive activities during the day - music, Netflix, youtube, audiobooks, radio, some reading here and there. I'd do this in my native language or English anyway, so no harm here.  I will occasionally note a word or grammar thingy down to check it later, but that's it. I take that 1h/day pretty seriously, everything else is optional and varies from day to day.\n\nAdditionally, I draw the line at my family & friends getting sick of me trying to explain to them how awesome some grammatical construction is or other random thing about the language that fascinated me that day. It's a clear sign I should dial down a bit.", "created_utc": "1636613920.0", "edited": "False", "id": "hk6c3pb", "is_submitter": "False", "link_id": "t3_qr0bpp", "parent_id": "t3_qr0bpp", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "MissXHD", "body": "No grammatical gender and noun/adjective/every-single-thing declension! Korean grammar is much easier and more logical than my native one (Polish, duh!) and I find some aspects of it easier than the English one as well.\n\nI like how you can change the entire tone of a sentence just by changing the verb ending and how one word can describe a feeling or an experience that you'd need a full sentence for in other languages.\n\nI start to appreciate the honorific forms more and more, too - in English, you practically don't have any. In Polish we have just one that feels super awkward to use towards people you know well but still want to speak politely to (your friend's grandma who asked you to drop the Mrs.). I could definitely use something in between formal and informal here.\n\nPlus, I will love Korean forever for the word 불꽃 - when you put 불 (fire) and 꽃 (flower) together, you get a \"fire flower\" (불꽃) and one of its meanings is fireworks. Isn’t it beautiful? Just imagine a dark sky full of beautiful fire flowers... I'm going to call fireworks fire flowers for the rest of my days.", "created_utc": "1636542803.0", "edited": "False", "id": "hk1zrab", "is_submitter": "False", "link_id": "t3_qnd9x0", "parent_id": "t3_qnd9x0", "score": "2", "subreddit": "Korean", "subreddit_id": "t5_2rd8q"}, {"author": "MissXHD", "body": "Have you heard of the 10,000 hour rule? You have to put roughly that much of time to master any skill, and speaking a language is definitely a skill. If you dedicate only 2h/week to a language, it's gonna take you roughly 96 years to reach that threshold. I don't know about you, but I ain't got time or patience to wait that long.\n\nA fixed schedule is what keeps me both motivated and consistent. I made it my priority to wake up at 6am and spend 1h on studying Korean before work. Do I like waking up so early? Nope. Am I in a mood to study every day? Nope. We have to do a lot of things we don't feel like doing if we want to see results, though.\n\nHow I use my mandatory 1h: flashcards, reading/writing or YouTube for grammar - whatever I feel like doing that day. On top of that I listen to Korean music while I work, Korean audiobooks when I walk the dog, clean the house or when I go to sleep. I watch Korean movies/series or at least have Korean subtitles on when I watch something in English. If you count all of the above, I have at least 10h of exposure to Korean every day. Most of it is passive or semi-active (noting down words or grammar I want to check later). I'm really surprised how much I can understand just 2 months after learning \"Hello\" and the alphabet.\n\nThe good news - the immersion approach does work! I could barely speak English after 4 years of weekly classes in high school and I haven't touched a textbook/grammar book since - I owe everything to surrounding myself with English. Same story with German. I haven't used it in over a decade, though, so it's time for full immersion. K-dramas with German subtitles? I do like a good challenge! Some days I don't even use my native language for more than 10 min. I was laughing the other day that I should probably schedule some time to practice it.", "created_utc": "1635694648.0", "edited": "False", "id": "hirvp1p", "is_submitter": "False", "link_id": "t3_qj76ra", "parent_id": "t3_qj76ra", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "MissXHD", "body": "I've read somewhere that kids usually have over 10-12,000 hours of exposure to a language before they reach the age of 5. No wonder they can speak it without putting any \"serious\" work in it.", "created_utc": "1635690051.0", "edited": "False", "id": "hirln11", "is_submitter": "False", "link_id": "t3_qj76ra", "parent_id": "t1_hir5fe3", "score": "4", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "MissXHD", "body": "Well, we have the infamous noun/adjective/verb declension... multiply that by 3 genders, plural/singular, add all the wonderful z ż ź dz dzi dź dż and you just got yourself a recipe for a very difficult language (even for natives). Mastering the proper pronunciation will be a huge challenge for you... Grzegorz Brzęczyszczykiewicz, for example.\n\nI grew up speaking Polish, but I still have to call my mom from time to time to ask if what I wrote is grammatically correct. I'm currently learning Korean and its grammar seems less complicated and more logical to me than my native one.\n\nSince you already know some German and Russian, plus survived Greek, I guess you'll have a slightly easier time learning Polish. There are some similarities with Russian, but they could easily hinder your progress. You will encounter some words similar to Greek as well (a small part of our vocabulary has its roots in Greek/Latin), and if you dive slightly into Polish dialects, you'll notice that we have a lot of German/Russian loanwords (in Poznań you'll hear \"bana\" which comes from German \"bahn\" = train).\n\nIt's true that if you know Polish and you talk with someone who speaks another Slavic language, you can understand the general meaning of the conversation and some words may be similar here and there, but I'd still compare it to Spanish and Italian people trying to communicate with each other in their native languages. You have to be very focused and run through a list of synonyms in your head constantly to hold a semi-intelligible conversation with other Slavic speakers. I, for example, find it easier to understand Czech and Slovakian than Russian.", "created_utc": "1635688047.0", "edited": "1635695133.0", "id": "hirhngu", "is_submitter": "False", "link_id": "t3_qjh0mp", "parent_id": "t3_qjh0mp", "score": "4", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}]