[{"author": "modernvelma420", "body": "Hope it works!! Not sure how proficient Google translate is with Japanese. Back when I was learning Chinese it wasn't great.. (but that was 10 years ago)", "created_utc": "1662109797.0", "edited": "False", "id": "imrw1lb", "is_submitter": "True", "link_id": "t3_x399a7", "parent_id": "t1_imqw1q2", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "modernvelma420", "body": "I don't mind when it's only one or two words on a page, but when we get into full sentences territory I sometimes just want the plot to move along faster", "created_utc": "1662109763.0", "edited": "False", "id": "imrw05g", "is_submitter": "True", "link_id": "t3_x399a7", "parent_id": "t1_imqxg9t", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "modernvelma420", "body": "Nothing to add just thay I will be moving to glasgow later this month and pumped by all the suggestions on this thread!", "created_utc": "1651244046.0", "edited": "False", "id": "i6o8c6k", "is_submitter": "False", "link_id": "t3_udy5uz", "parent_id": "t3_udy5uz", "score": "3", "subreddit": "glasgow", "subreddit_id": "t5_2rgo2"}, {"author": "modernvelma420", "body": "Mandarin for me. I learnt it for 10 years in school. I associate it with feelings of shame since I was always the bottom of the class :'( Still have nightmares about sitting mandarin exams and not recognizing any of the words, or being asked to read something out loud in front of the class and having no idea how to pronounce anything. \n\nWhile I'm incredibly rusty now, I still know enough to be able to keep a conversation going. I'm always in conflict with myself about whether I should give it another go as an adult, without all the pressure from school, because it feels like it's just lying there dormant and unused! And mandarin is such a useful language.", "created_utc": "1649411659.0", "edited": "False", "id": "i3vpiin", "is_submitter": "False", "link_id": "t3_ty9n9v", "parent_id": "t3_ty9n9v", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "modernvelma420", "body": "Playing \" Le Mot \" is a humbling experience ! Far too many repeating vowels", "created_utc": "1644577751.0", "edited": "False", "id": "hwhoy38", "is_submitter": "False", "link_id": "t3_spc8ec", "parent_id": "t3_spc8ec", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "modernvelma420", "body": "Thank you so much for your response! I’ll look into the book. I do a bit of Kwiziq on the side but I’m not very disciplined about things when I’m on my computer, I find it easier to study out of a book in that way :)", "created_utc": "1643318157.0", "edited": "False", "id": "huhra1b", "is_submitter": "True", "link_id": "t3_sdvz3v", "parent_id": "t1_hufdy42", "score": "2", "subreddit": "learnfrench", "subreddit_id": "t5_2sucz"}, {"author": "modernvelma420", "body": "You are amazing, thank you so much for the detailed response. You’ve sold all of these options very well, I’m enthusiastic about them all!", "created_utc": "1643318022.0", "edited": "False", "id": "huhqwwl", "is_submitter": "True", "link_id": "t3_sdvz3v", "parent_id": "t1_hugrds7", "score": "3", "subreddit": "learnfrench", "subreddit_id": "t5_2sucz"}, {"author": "modernvelma420", "body": "I didn’t know that there was a prequel coming- how exciting!", "created_utc": "1643231865.0", "edited": "False", "id": "huckx0h", "is_submitter": "False", "link_id": "t3_scw916", "parent_id": "t1_hu9397x", "score": "5", "subreddit": "Fantasy", "subreddit_id": "t5_2qknd"}, {"author": "modernvelma420", "body": "Thank you! This articulated so well one of my big gripes with HP being uniformly recommended across the board for language learners. It is a book that has a cult like grip on the popular imagination and its dominance - while being deeply steeped in a particular cultural context that is itself also dominant around the world - is never critically scrutinised. I feel this has been to the detriment of discovering diverse, and equally meaningful, authors and stories.\n\nI understand the point the series being well-suited to learners because of its increasingly complex style, but could that effect could just as easily be achieved on your own, by selecting books that get progressively more difficult? There's no need for us to be spoonfed, with a little bit of research, it's entirely possible to achieve this on your own. It's nothing compared to the challenge of learning a language, at any rate.", "created_utc": "1643187612.0", "edited": "False", "id": "hu9u5tj", "is_submitter": "True", "link_id": "t3_sc9i0c", "parent_id": "t1_hu9q1lv", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "modernvelma420", "body": "Oof I need to ready myself for that. Ewilan is alright, some of the characters i feel are a litttle bit stereotypical but the story is relatively fast paced (compared to how long it's taken me to read it, at least! it's only my 3rd \"proper\" book I've tackled in French). The series called *La Passe-miroir* series looks interesting, I think I will try to tackle that at some point this year.", "created_utc": "1643136816.0", "edited": "False", "id": "hu6s45q", "is_submitter": "True", "link_id": "t3_sc9i0c", "parent_id": "t1_hu6fcs2", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "modernvelma420", "body": "Oooh excellent shout, and I'm sure I missed half the references as a kid!  \n\n*When the Dark comes rising six shall turn it back;*\r  \n*Three from the circle, three from the track*...", "created_utc": "1643136208.0", "edited": "False", "id": "hu6qh66", "is_submitter": "True", "link_id": "t3_sc9i0c", "parent_id": "t1_hu6mp1r", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "modernvelma420", "body": "Thank you! I'm reading the Ewilan series right now actually (I think based on someones previous reddit recommendation), it is the perfect level for me at the moment, though just need to become more habituated with the passé simple...", "created_utc": "1643115180.0", "edited": "False", "id": "hu5aucv", "is_submitter": "True", "link_id": "t3_sc9i0c", "parent_id": "t1_hu58qu4", "score": "7", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "modernvelma420", "body": "Yes , that's what I was trying to elicit through my thread : examples of books in your native language that are not as popular (to use your term, \"mass market\") but would be a useful resource for learners of that language. Feel free to make a suggestion.", "created_utc": "1643110260.0", "edited": "False", "id": "hu5350t", "is_submitter": "True", "link_id": "t3_sc9i0c", "parent_id": "t1_hu52k94", "score": "21", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "modernvelma420", "body": "I'm still a learner, as are many others on this sub. Classical literature at this stage is going to be largely inaccessible and not an effective way to learn how the language is used in a contemporary context. Besides I don't consider popular fiction vs classical literature to be mutually exclusive. It's possible to appreciate the merits of both without putting either down as a 'waste of time'. Exposure to all types of work is what is going to give you a true appreciation for the diversity of language and the diversity of human experience, rather than locking yourself away in an ivory tower.", "created_utc": "1643109654.0", "edited": "False", "id": "hu52b30", "is_submitter": "True", "link_id": "t3_sc9i0c", "parent_id": "t1_hu51fd2", "score": "22", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "modernvelma420", "body": "I signed up to this website \"LangCorrect\" a couple of weeks ago. It's free, and the idea is people correct you in your TL, while you feed back to the community by correcting posts in your NL. The website is for people of all levels and I've received some really helpful feedback on my posts.\n\nPrior to signing up I hadn't done much writing, and I realized part of the reason why was that I just didn't really feel that it was worthwhile if I wasn't receiving corrections. However the public / communal aspect of the website has been really helpful for motivating me to start outputting! There is even a section with writing prompts if you're stumped on subjects.\n\nSometimes when I'm stuck for a subject I read a news article in my TL, then write a short summary of it, and try to express my own opinion on it. I find it quite helpful for reinforcing some of the passive vocab from the news story and also giving you a 'base' from which to start building your own post", "created_utc": "1642692335.0", "edited": "False", "id": "htguojn", "is_submitter": "False", "link_id": "t3_s8h0tu", "parent_id": "t3_s8h0tu", "score": "12", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "modernvelma420", "body": "That's helpful, thank you! I'm the same in that I tend not to enjoy 'written production' and have to force myself to write a bit every week, probably quite common amongst learners :)", "created_utc": "1638294067.0", "edited": "False", "id": "hmoqwq2", "is_submitter": "False", "link_id": "t3_r55dk5", "parent_id": "t1_hmnoz4h", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "modernvelma420", "body": "Congrats! I've been studying French for about 8 months now, I never set the goal of passing any exam but I'm now coming round to it and might try for B1 sometime next year.... The only thing is I feel kind of reluctant to do \"exam\" studying. I wanted to ask whether it's possible to pass the exam without doing specific study (going through past papers and things like that), and just relying on general knowledge gained from input techniques?", "created_utc": "1638269416.0", "edited": "False", "id": "hmndehu", "is_submitter": "False", "link_id": "t3_r55dk5", "parent_id": "t3_r55dk5", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "modernvelma420", "body": "Over the moon with this. Thank you!", "created_utc": "1637662729.0", "edited": "False", "id": "hlr3vlm", "is_submitter": "False", "link_id": "t3_r08bnx", "parent_id": "t3_r08bnx", "score": "4", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "modernvelma420", "body": "Very cool idea. Must be satisfying to see yourself progressing quickly in a short time, and also the $$ savings. How did you feel after the week going back to your regular routine? I would be interested in trying something similar but worry about getting tired out from something so intense and losing motivation afterward.", "created_utc": "1633285433.0", "edited": "False", "id": "hf96be7", "is_submitter": "False", "link_id": "t3_q02q4f", "parent_id": "t3_q02q4f", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "modernvelma420", "body": "Im a beginner and I love this show called Mouk (it’s for kids but it’s quite gentle, not one of those super load chaotic ones ). Youtube has auto generated subtitles which are not 100% accurate but are good enough", "created_utc": "1631643384.0", "edited": "False", "id": "hculpld", "is_submitter": "False", "link_id": "t3_po7z80", "parent_id": "t3_po7z80", "score": "4", "subreddit": "French", "subreddit_id": "t5_2rd5t"}, {"author": "modernvelma420", "body": "Could u share a recipe? These look so good..", "created_utc": "1611586047.0", "edited": "False", "id": "gkpm3rb", "is_submitter": "False", "link_id": "t3_l4dxbc", "parent_id": "t3_l4dxbc", "score": "1", "subreddit": "drunkencookery", "subreddit_id": "t5_2shky"}]