[{"author": "monstersandlanguages", "body": "And it's crazy because it's not like surgeons are a low-paid, low-visibility group. But I guess some people want to be on TV or politics for anything...hard to wrap your head around still.\n\n\nI could *almost* understand--not condone, understand--if he'd gone from shit-tier, barely-getting-by retail to this. Almost anyone could empathize with wanting to get out of that in any way possible. \n\n\nBut a freaking surgeon?! A *cardiac* surgeon, if memory serves? As in, job where you have some of the best pay in the entire country? Oh, and job security pretty much anywhere? Usually pretty respected, too?\n\n\nWhat a waste.", "created_utc": "1666371766.0", "edited": "False", "id": "it85jqv", "is_submitter": "False", "link_id": "t3_y98msk", "parent_id": "t1_it78ku3", "score": "3", "subreddit": "antiMLM", "subreddit_id": "t5_2swge"}, {"author": "monstersandlanguages", "body": "I'm not sure I would call OOP the devil but they'd be in a better position now if they had been direct instead of passive aggressive. (If they're being honest about the dad, then he should have at least said something about the bacon running low.)\n\n\nAlso, OOP's diet is definitely making them hangry. Not everybody can do intermittent fasting and not be grumpy.", "created_utc": "1665883625.0", "edited": "False", "id": "ishm7kn", "is_submitter": "False", "link_id": "t3_y53qgg", "parent_id": "t3_y53qgg", "score": "27", "subreddit": "AmITheDevil", "subreddit_id": "t5_27t6v0"}, {"author": "monstersandlanguages", "body": "I'm going to guess it's at least anxiety about death and death-related stuff. Very common--she handled it poorly and should maybe talk to someone about it so she can come to terms with it. Not like it's going to go away.\n\n\nIt could also be superstition. Some people believe that urns can be like an \"anchor\" for ghosts and if that's the case, maybe don't piss off the recently-deceased wife by hurting her husband's feelings.\n\n\nETA: she could also just be self-centered and thinks an urn and grieving person will \"harsh the mellow\" or whatever. Super hoping it was mainly anxiety, as anxiety is a bit easier to deal with than a self-centered jackass.", "created_utc": "1665266759.0", "edited": "False", "id": "irk99su", "is_submitter": "False", "link_id": "t3_xyu4a2", "parent_id": "t1_irivkrk", "score": "27", "subreddit": "AmITheDevil", "subreddit_id": "t5_27t6v0"}, {"author": "monstersandlanguages", "body": "I'm hoping OP let her anxiety get the best of her here instead of the alternative, which is she's a self-centered jerk. Also, maybe she should consider talking to someone about it since she's only going to have more of these experiences as she and the people around her age...\n\n\nWhen we brought grandpa's ashes home, the first couple of days were definitely a bit spooky. After that, though, it became more sad. You realize that urn holds what was once a vibrant human being, nothing more.", "created_utc": "1665266580.0", "edited": "False", "id": "irk8vwk", "is_submitter": "False", "link_id": "t3_xyu4a2", "parent_id": "t1_irjn887", "score": "15", "subreddit": "AmITheDevil", "subreddit_id": "t5_27t6v0"}, {"author": "monstersandlanguages", "body": "If Rampages were Follower Quests in single player, I think people would play that mode a lot more. I found playing Rampages solo to be chaotic in a way that wasn't fun as opposed to, say, multiple monsters in the arena.\n\n\n*shudders at the thought of Afflicted Apex Zinogre*", "created_utc": "1664469299.0", "edited": "False", "id": "iqdvsx1", "is_submitter": "False", "link_id": "t3_xrafbi", "parent_id": "t3_xrafbi", "score": "6", "subreddit": "MHRise", "subreddit_id": "t5_34tust"}, {"author": "monstersandlanguages", "body": "I think OOP is a dude and is *definitely* hanging on by a thread. His late BF's family is homophobic, apparently. May that family step on Legos every day. OOP needs therapy (and the nephew might need it now, too).\n\n\nAnd I understand why getting a mosaic or some other thing made out of the pieces of the vase didn't seem to be an option to him.\n\n\nBut hoooooly fuck, an 8 year old? Kids do stupid shit and go places they aren't supposed to. That's why you keep an eye on the little buggers. OOP bears some responsibility for the fate of that vase and that (consciously or not) contributed to his reaction. \n\n\nJust a sad and awful post all around. OOP needs major help.", "created_utc": "1664217934.0", "edited": "False", "id": "iq06inh", "is_submitter": "False", "link_id": "t3_xopjzg", "parent_id": "t1_ipzyaej", "score": "116", "subreddit": "AmITheDevil", "subreddit_id": "t5_27t6v0"}, {"author": "monstersandlanguages", "body": "Some people really do need their early 20s to straighten the hell up and mature. I've met people who were absolute immature dicks until about 24/25 (and I was one of them). Compare them now with who they were then, and you wonder if they were replaced with a very nice clone or something.\n\n\nNot that this excuses something as gross as trying to steal someone's husband/SO and sexually harassing SO in the process. That's early high school-level shit. Unacceptable in every sense of the word.\n\n\nOOP's sis is gonna have a bumpy ride into actual adulthood if said sis doesn't get her head out of her ass.", "created_utc": "1662829751.0", "edited": "False", "id": "invld3e", "is_submitter": "False", "link_id": "t3_xanuo4", "parent_id": "t1_inv2ikz", "score": "4", "subreddit": "BestofRedditorUpdates", "subreddit_id": "t5_2ea6kj"}, {"author": "monstersandlanguages", "body": "Topple + swaxe spam is how I got mine but it still took quite a few hunts. Thunderbug + blast toad + Palico w/Kittenator (ETA: not all at once, of course...spread it out a bit over the fight). With x3 Partbreaker you *should* get the break if you do consistent DPS. Best place is sorta closer to the tail. The swaxe swing will let you get in there a bit. Not a 100% guarantee.\n\n\nMR Valstrax's rare drop is what's killing me. Drop the damn orb, already!", "created_utc": "1662519958.0", "edited": "False", "id": "ineirzq", "is_submitter": "False", "link_id": "t3_x7lnzh", "parent_id": "t1_indlkjf", "score": "8", "subreddit": "monsterhunterrage", "subreddit_id": "t5_3a2f0"}, {"author": "monstersandlanguages", "body": "On the one hand, I can understand why OOP was frustrated. On the other hand, he could have talked it out! Ex:\n\n\n\"Honey, I love you to bits and want to have a special day/thing outside of our anniversary to celebrate that. Can you tell me what you'd be comfortable with?\"\n\n\nMaybe later he could reflect on *why* he felt like he was living in Late Husband's shadow and gone to therapy or had a calm convo with his wife about something they could both do that didn't push Late Husband out of the picture, but let OOP feel like he was \"the one\" for his wife, too.\n\n\nIt's sad because at least from the outside this looks like it was very, very fixable had OOP even a shred of emotional intelligence. After the ring incident, I wouldn't go anywhere near him without several witnesses present.\n\n\nBest of luck to the (hopefully now-divorced) widow and, uh, well, hope OOP found some sense *somewhere*.", "created_utc": "1662519013.0", "edited": "False", "id": "inegs52", "is_submitter": "False", "link_id": "t3_x7kije", "parent_id": "t1_incxvc4", "score": "1", "subreddit": "BestofRedditorUpdates", "subreddit_id": "t5_2ea6kj"}, {"author": "monstersandlanguages", "body": "The stupid end game grind is why I quit playing Stories, despite quite liking the rest of the game. The genes RNG is on par with Rise's Anomaly RNG. \n\n\nThe monsters in the SR dens are incredibly unfair. They hit super hard no matter what level you're at, or what armor you're wearing. They also have attacks that can decimate all of the players on the field at once. Nope. Nooooo thank you.\n\n\nMain story was pretty good, though, and made it worth the price of the game. Super, super disappointed by the end game.", "created_utc": "1662431741.0", "edited": "False", "id": "in9k60r", "is_submitter": "False", "link_id": "t3_x6rsb6", "parent_id": "t3_x6rsb6", "score": "5", "subreddit": "monsterhunterrage", "subreddit_id": "t5_3a2f0"}, {"author": "monstersandlanguages", "body": "Probably, but not 100%. Some of these kids get bullied/abused elsewhere and try to take out the feelings of rage on someone they think can't or won't fight back.\n\n\nMy guesses for this kid:\n\n\nA. A spoilt little prince, maybe spending too much screaming obscenities on video games but not necessarily. If that's the case, he's gonna get his ass beat for real one day, and that day is coming soon. He looks to be getting too old to be throwing foul-mouthed tantrums. I'm guessing he doesn't have the personality, looks, or smarts to get away with being a little prima donna, either. Life ain't a CoD lobby, to use an old cliche.\n\n\nB. Struggling in some way. ODD, sometimes ADHD (surprisingly), abuse, drugs, etc.\n\n\nC. A combination of the above.\n\n\nKid needs heavy duty therapy. Maybe more supervision, too. Kids like this often grow up to be terrors...until things go sideways. From there it's either prison, hospital, or grave.", "created_utc": "1662431324.0", "edited": "False", "id": "in9jatk", "is_submitter": "False", "link_id": "t3_x6nx0w", "parent_id": "t1_in94vw9", "score": "10", "subreddit": "CrazyFuckingVideos", "subreddit_id": "t5_45hae8"}, {"author": "monstersandlanguages", "body": "Same. :( Iirc, however, once an auto fire gets to this extent, it's too hot to get close and you need a lot more than, say, a fire extinguisher to help you out.\n\n\nFrom the video and the news report, it does sound like people tried to help.\n\n\nThe driver was probably pinned at least at the feet, if not higher up. Poor guy. What an awful way to go. :( May he RIP.", "created_utc": "1662338554.0", "edited": "False", "id": "in4igkq", "is_submitter": "False", "link_id": "t3_x5xm9z", "parent_id": "t1_in3z0bz", "score": "23", "subreddit": "NSFL__", "subreddit_id": "t5_3lcigy"}, {"author": "monstersandlanguages", "body": "OOP's wife was(?) in HR. Literally her *job* to be able to access those materials. Why is it always IT's fault when other members of the company get sticky-fingered?", "created_utc": "1662337511.0", "edited": "False", "id": "in4g8gb", "is_submitter": "False", "link_id": "t3_x5zaaq", "parent_id": "t1_in4brio", "score": "13", "subreddit": "BestofRedditorUpdates", "subreddit_id": "t5_2ea6kj"}, {"author": "monstersandlanguages", "body": "It's taken about the entire two months since I've made this post. Having an MRI on my brain seemed to accelerate recovery. No idea why it worked, but now I can drive and walk around without too much worry.\n\n\nNighttime is usually OK with very mild symptoms, but some nights still cause trouble. Ex: last night I nearly fell over because I turned my head too fast and the entire world just turned into a jittering smear. Being dehydrated at night almost guarantees the symptoms will be worse, so...glug glug.", "created_utc": "1662326304.0", "edited": "False", "id": "in3rwz9", "is_submitter": "True", "link_id": "t3_vort44", "parent_id": "t1_in2aqhm", "score": "1", "subreddit": "SSRIs", "subreddit_id": "t5_2yhc1"}, {"author": "monstersandlanguages", "body": "Mixed feelings that others are experiencing this. :( These meds are way more powerful than doctors like to let on.\n\n\nI guess I'm lucky that mine has mostly faded away. It still acts up at night or if I'm dehydrated, and is probably a side effect of my other med, Wellbutrin. A brain MRI found nothing strange, blood work was normal, no other symptoms to indicate another issue...", "created_utc": "1662240701.0", "edited": "False", "id": "imz6w2k", "is_submitter": "True", "link_id": "t3_vort44", "parent_id": "t1_imxtvvg", "score": "1", "subreddit": "SSRIs", "subreddit_id": "t5_2yhc1"}, {"author": "monstersandlanguages", "body": "I would have thought a quest like the OP with such a short time limit wouldn't be possible to complete, but no, some amazing players here can handle it...damn, call me jealous!", "created_utc": "1662132979.0", "edited": "False", "id": "imt4ia2", "is_submitter": "False", "link_id": "t3_x3o5hy", "parent_id": "t1_imrgvzw", "score": "4", "subreddit": "MHRise", "subreddit_id": "t5_34tust"}, {"author": "monstersandlanguages", "body": "Between your comment and the other person's, I now understand completely. Thanks for your help!", "created_utc": "1661894531.0", "edited": "False", "id": "imfume2", "is_submitter": "True", "link_id": "t3_x1q9cv", "parent_id": "t1_imf540q", "score": "2", "subreddit": "German", "subreddit_id": "t5_2qq51"}, {"author": "monstersandlanguages", "body": "I admit I haven't used that verb often or seen it used (which is a bit strange). On the Leo dictionary site, I can definitely see *mit etwas* is the sense I was going for. Thanks!", "created_utc": "1661894410.0", "edited": "False", "id": "imfub1g", "is_submitter": "True", "link_id": "t3_x1q9cv", "parent_id": "t1_imf63z4", "score": "2", "subreddit": "German", "subreddit_id": "t5_2qq51"}, {"author": "monstersandlanguages", "body": "Furious Rajang. Someone told me the tuft on his head/neck and his little tail make him look a bit like a puppy, and I've liked him since, however: STOP MOVING GODDAMMIT.\n\n\nGoss Harag. Badass-lookin' monster but just feels tedious to fight.\n\n\nETA: Just remembered Jyuratodus! Love the prehistoric fish theme but Capcom did almost nothing with it. It's just a boring wiggle fish.", "created_utc": "1661728091.0", "edited": "1661728338.0", "id": "im6t0f3", "is_submitter": "False", "link_id": "t3_wzwbae", "parent_id": "t3_wzwbae", "score": "1", "subreddit": "MonsterHunter", "subreddit_id": "t5_2rron"}, {"author": "monstersandlanguages", "body": "Iirc, she still has the tell for that attack, it's just now it moves x1000 faster and your camera has to be on Narwa at all times while you're doing a bunch of other things....Evade Extender x2 is the only thing that saved my ass, and I was able to avoid eating carts by some miracle. Capcom didn't need to do so much to soup Allmother Narwa up to MR. She was already a pretty tough challenge. Tougher than Gaismagorm, imo.\n\n\nAlso, I noticed there's a lot of what seems to be aim-botting in MR: Nargacuga (including Lucent), Almudron (both variants, also found in HR), Narwa, Ibushi, Zinogre, pretty sure Rathian, and there's probably more. If it's not aim-botting--it's definitely aim-botting in Almudron--then it's ridiculous hit boxes.", "created_utc": "1661652253.0", "edited": "False", "id": "im2uigp", "is_submitter": "False", "link_id": "t3_wzigrv", "parent_id": "t3_wzigrv", "score": "25", "subreddit": "monsterhunterrage", "subreddit_id": "t5_3a2f0"}, {"author": "monstersandlanguages", "body": "100% some remorse would have taken OOP far.\n\n\nIf OOP had demonstrated real remorse, I'd even have an amoeba-sized bit of empathy for her. A lot of people will give you a benefit of a doubt when it comes to childhood indiscretions (ETA: actually, \"indiscretions\" is a huge understatement for this OOP but the general concept still applies)...if you've grown up since then.\n\n\nOOP hadn't grown up when she sent in that letter. Wonder if reality set in.", "created_utc": "1661647405.0", "edited": "1661647642.0", "id": "im2kul1", "is_submitter": "False", "link_id": "t3_wz8kun", "parent_id": "t1_im14amz", "score": "6", "subreddit": "BestofRedditorUpdates", "subreddit_id": "t5_2ea6kj"}, {"author": "monstersandlanguages", "body": "I mean, you've got a point. Speaking of points, if you have Kamura points, the Argosy often has Kelbi horns. Too bad they're not as useful as they have been in the past. I don't know what the team behind MH Rise was thinking.", "created_utc": "1661467975.0", "edited": "False", "id": "ilspzpx", "is_submitter": "False", "link_id": "t3_wxku6r", "parent_id": "t1_ilsi38s", "score": "6", "subreddit": "monsterhunterrage", "subreddit_id": "t5_3a2f0"}, {"author": "monstersandlanguages", "body": "99% of the people who hate Spiribirds wouldn't care about them if Ancient Potions still maxed you out. Like damn, give people the option to farm for Kelbi horns and immunizers instead of swinging around the map. \n\n\nNow that I think about it, Ancient Potions are almost pointless in MH Rise. Your stamina refills quite quickly, so there's no need to slowly chug a potion when you could just have a mega potion or even one of the base camp potions.", "created_utc": "1661462484.0", "edited": "False", "id": "ilscrvl", "is_submitter": "False", "link_id": "t3_wxku6r", "parent_id": "t1_ilrk1q0", "score": "45", "subreddit": "monsterhunterrage", "subreddit_id": "t5_3a2f0"}, {"author": "monstersandlanguages", "body": "Evade Extender made him irrelevant.\n\n\nNow MR All Mother Narwa...Actually I'm kind of traumatized into liking that fight but GOD what an obnoxious giant seahorse dragon. Capcom also made her \"blow everything tf up\" move faster so that if you're not right on the cannon the moment she ascends, you're gonna get wrecked. So I just started Farcasting away for about ten seconds. Screw that, lol.", "created_utc": "1661356496.0", "edited": "False", "id": "illwxfe", "is_submitter": "False", "link_id": "t3_wwcp9d", "parent_id": "t3_wwcp9d", "score": "1", "subreddit": "monsterhunterrage", "subreddit_id": "t5_3a2f0"}, {"author": "monstersandlanguages", "body": "I know this'll get buried, but any of the lances. They feel so bulky and awkward to me with hard-to-execute skills--even hammer feels more mobile. With the lance I just poke-poke-poke and occasionally do something cool on accident.\n\n\nI really envy the people who've gotten the damn things to work. A well-executed lance trick is amazing to watch.", "created_utc": "1661353118.0", "edited": "False", "id": "illoany", "is_submitter": "False", "link_id": "t3_wwdx1t", "parent_id": "t3_wwdx1t", "score": "2", "subreddit": "MonsterHunter", "subreddit_id": "t5_2rron"}, {"author": "monstersandlanguages", "body": "I've noticed that the gem/mantle/whatever is much quicker to drop from elder dragons than a lot of regular monsters. Within 5 - 6 hunts, typically, in my experience. And I wonder if that's a little tweak Capcom made for them. Or maybe this is the one time RNGesus loves me.", "created_utc": "1661179940.0", "edited": "False", "id": "ilbtjpz", "is_submitter": "False", "link_id": "t3_wumatg", "parent_id": "t3_wumatg", "score": "1", "subreddit": "monsterhunterrage", "subreddit_id": "t5_3a2f0"}, {"author": "monstersandlanguages", "body": "I imagine this case is why spelunkers now vastly prefer to wriggle through tight spaces feet-first. If John had been right side up, his chances probably would have been better. Not great, but better.", "created_utc": "1661095481.0", "edited": "False", "id": "il7a5g5", "is_submitter": "False", "link_id": "t3_wttqel", "parent_id": "t1_il6c1ev", "score": "10", "subreddit": "TerrifyingAsFuck", "subreddit_id": "t5_31d92"}, {"author": "monstersandlanguages", "body": "Huh, the judges are usually a bit less fucking stupid about domestic violence than the cops are.\n\n\nI once had a cop tell me it was my fault my mom's ex put a gun to her head. :| The judge tore her ex several new holes and, since it was a small town, apparently had something to say to the cop. My mom got an apology from said cop. (Yes, he apologized to *her*, not me. Oh well. It probably hurt his big boy ego to apologize, so good enough.)\n\n\nETA: Glad to read you're safe now!", "created_utc": "1660959579.0", "edited": "False", "id": "il0iqt4", "is_submitter": "False", "link_id": "t3_wsrydn", "parent_id": "t1_il07o81", "score": "35", "subreddit": "BestofRedditorUpdates", "subreddit_id": "t5_2ea6kj"}, {"author": "monstersandlanguages", "body": "What gets me is they went for euthanasia for this poor walrus first. As an animal that large, she *could* have been a danger especially since people were getting up close for selfies, to throw shit at her, swimming with her, etc. But you're right--let Freya demonstrate why you don't fuck with a 1300 pound mammal!\n\n\n(And tell the people who'd inevitably whine Dumbfuck Billy/Jane got mauled about the concept of natural selection, because fucking around with a walrus is a good way to learn about it.)\n\n\nBut really? Too difficult to relocate her because she might drown during the process (she'd have to be sedated)? Ffs then that would have solved your problem either way, eh?\n\n\nCrowd control? Fining the fuck out of anyone bothering her? Naaaah.\n\n\nHell, finding some way to monetize it with guided tours or some shit (ties in with crowd control)? We'd rather just make this quick.\n\n\nUsing some sort of temporary repellent (ex: loud noise)? That would scare away the other animals? Okay, NOW they care about animals?\n\n\nThere are so many questions here but it's almost certain poor Freya made the fatal mistake of going to a rich person's beach in a country that's still working on its approach to animal rights. :( RIP, Freya. May you find many welcoming beaches in heaven.", "created_utc": "1660920069.0", "edited": "False", "id": "ikxucwa", "is_submitter": "False", "link_id": "t3_ws8fw5", "parent_id": "t1_ikxep22", "score": "31", "subreddit": "TerrifyingAsFuck", "subreddit_id": "t5_31d92"}, {"author": "monstersandlanguages", "body": "The downvotes and criticism you've gotten over *multiple* posts and comments should tell you everything you need to know about your \"intelligent discussions\" and the quality of \"thought\" you've put into them. \n\n\nYou absolutely have the ability to be insightful because I've seen it more than once, but you choose to be disruptive with your low-effort content more often than not. In most communities, this is considered trolling.", "created_utc": "1660851779.0", "edited": "False", "id": "iku567j", "is_submitter": "False", "link_id": "t3_wrp59z", "parent_id": "t1_iku42oz", "score": "6", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "monstersandlanguages", "body": "I am begging everyone who sees LI's low-effort posts and comments to report them. This post (ETA: referring to LI's, not the above commentor's) actually breaks the rules because it's low effort and disruptive to the community (how many people are annoyed or downright frustrated with LI's low-effort posts and comments knowing that s/he can and has come up with insightful commentary before?)", "created_utc": "1660850797.0", "edited": "False", "id": "iku2lp0", "is_submitter": "False", "link_id": "t3_wrp59z", "parent_id": "t1_iktjf6r", "score": "13", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "monstersandlanguages", "body": "Tried something similar and just ended up ignoring the little notes, lol. From personal experience, using flashcards to learn the vocab, and then talking to yourself like a kid is most effective to learn super common stuff like household items/tasks.\n\n\nEx. (Said while sweeping.) \"Der Boden ist braun.\" (Said when opening the cutlery drawer.) \"Ich brauche einen Löffel.\" (Said when boiling water for ramen.) \"Ich koch das Wasser mit dem Topf.\"", "created_utc": "1660751105.0", "edited": "False", "id": "iko4bjm", "is_submitter": "False", "link_id": "t3_wqq9k4", "parent_id": "t3_wqq9k4", "score": "14", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "monstersandlanguages", "body": "Over the past two months, I've put in a little more than 37 hours of reading, mostly Kruschel (a kid's newspaper aimed at ages 9 - 11), but also sometimes graded readers since they're useful despite being a bit dull some times.\n\n\nI ultimately stuck with Kruschel because the articles are small, simple but not *too* simple, and are topical (ex: articles about the gas shortage in Germany). Since it's aimed at younger kids, the grammar is just the right amount of complex and \"big kid\" words are usually defined in a simpler way. Sometimes my technique varies, but in the end, I almost always skim the article twice and read it carefully two or three times. I also usually will type it into a Word document. That's been even more helpful for putting together sentences that are just a wee bit more natural.\n\n\n\nIt's only been 37 hours so...understanding comes and goes but more and more I have these little breakthroughs where I just understand for three or four sentences. No mental translation required. Sometimes I even understand unknown words from context. When I write to my penpal (not enough, admittedly), he's been surprised at some of what I've sent him.\n\n\nMaybe after 100 hours of all this work, something amazing will happen. :)", "created_utc": "1660712627.0", "edited": "False", "id": "ikmb2ux", "is_submitter": "False", "link_id": "t3_wq8zuo", "parent_id": "t3_wq8zuo", "score": "4", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "monstersandlanguages", "body": "Sometimes she sounds a bit like Betty DeVille from the Rugrats, too, compounding the absolute annoying weirdness of the entire experience.", "created_utc": "1660556240.0", "edited": "False", "id": "ikd2mqw", "is_submitter": "False", "link_id": "t3_woq2s9", "parent_id": "t1_ikcgu3d", "score": "8", "subreddit": "monsterhunterrage", "subreddit_id": "t5_3a2f0"}, {"author": "monstersandlanguages", "body": "Ahaha, that's a war I'm losing.\n\n\n(Before anyone asks, yes, I'm on meds, have been through both CBT and DBT, multiple rounds of talk therapy, etc. This is how I am *after* all that. It's awful.)\n\n\nOne teeny-tiny thing I've latched onto and am trying to work with is the fact that my particular brand of anxiety is largely based around inhibition. If you can get Monstersandlanguages past the, \"c'mon, just try it!\" stage, you'll reach the, \"wait, don't you have anxiety?\" stage, or even the, \"something's wrong with you, and it isn't anxiety\" stage.\n\n\nOnce that threshold is passed, I don't care half as much. *Kein Schamgefühl*, as the Germans might say. Triply-so if I've paid you.\n\n\nGood luck getting *that* donkey over the threshold, though. I've had this tutor's iTalki page open for three days now and no amount of pleading, promising, berating, moralizing, or cajoling has worked.  Gosh, if I sign up, would I even go to the classes? It's really hard to say from this angle.", "created_utc": "1660517614.0", "edited": "False", "id": "ikb97be", "is_submitter": "False", "link_id": "t3_wog1au", "parent_id": "t3_wog1au", "score": "6", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "monstersandlanguages", "body": "I know what I went through, lmao. If your patient is screaming, your fucking anesthesia (local or not) hasn't worked and pinning them down with your fucking knee is not only grossly unprofessional, but abusive as well. Also, local anesthesia can affect breathing, especially in kids.", "created_utc": "1660494184.0", "edited": "False", "id": "ik9p3od", "is_submitter": "False", "link_id": "t3_wncowo", "parent_id": "t1_ik9kin9", "score": "1", "subreddit": "eyeblech", "subreddit_id": "t5_3fhf0"}, {"author": "monstersandlanguages", "body": "Lol, I wish!. I was conscious the whole time because I remember struggling (and screaming until he did the knee bit). What kind of psychopath puts their knee on a person's chest, inhibiting their breathing? That would be an especially egregious move if I *had* been anesthetized, because anesthesia already affects your breathing.", "created_utc": "1660491760.0", "edited": "False", "id": "ik9j82u", "is_submitter": "False", "link_id": "t3_wncowo", "parent_id": "t1_ik85oea", "score": "1", "subreddit": "eyeblech", "subreddit_id": "t5_3fhf0"}, {"author": "monstersandlanguages", "body": "Agreed. Iirc, general anesthesia is too dangerous for kids, so doctors are loathe to use it if they can help it. But there's milder types of anesthetic! There's options other than strap the poor kid down and ignore (how?!) their screams.", "created_utc": "1660430015.0", "edited": "False", "id": "ik6mdjf", "is_submitter": "False", "link_id": "t3_wncowo", "parent_id": "t1_ik6kry2", "score": "8", "subreddit": "eyeblech", "subreddit_id": "t5_3fhf0"}, {"author": "monstersandlanguages", "body": "I am no longer going to complain about the dentist who pinned me with his knee on my chest so he could pull a tooth. (Guess who has an unrelenting fear of dentists to this day? I was four, btw.) \n\n\nHoly mother of fucking GOD that was hard to watch. Dementia or not, that dentist should have been tossed in a dumpster within five seconds of that video. It's a mystery how the person recording got as far as they did and they better get the poor kid help when this traumatic experience evolves into a real phobia of dentists.", "created_utc": "1660413304.0", "edited": "False", "id": "ik5km34", "is_submitter": "False", "link_id": "t3_wncowo", "parent_id": "t1_ik498sc", "score": "100", "subreddit": "eyeblech", "subreddit_id": "t5_3fhf0"}, {"author": "monstersandlanguages", "body": "Oh man, I *want* to like MR Kushala Daora if only because Kushala is pretty badass for a regular black dragon. \n\n\nAnd on the contrary, I like MR Chameleos (and Teostra, for that matter). Haha, this game has something for everyone.", "created_utc": "1660406471.0", "edited": "False", "id": "ik53z2r", "is_submitter": "True", "link_id": "t3_wn3pim", "parent_id": "t1_ik427f1", "score": "4", "subreddit": "monsterhunterrage", "subreddit_id": "t5_3a2f0"}, {"author": "monstersandlanguages", "body": "I have in the past and found that between the way the monster moves and the way I move, the camera would jerk around and I'd get motion sickness. :( Having a fast camera rotate (after getting used to *that*) is the only solution I've found thus far.", "created_utc": "1660406348.0", "edited": "False", "id": "ik53obu", "is_submitter": "True", "link_id": "t3_wn3pim", "parent_id": "t1_ik4dkmb", "score": "2", "subreddit": "monsterhunterrage", "subreddit_id": "t5_3a2f0"}, {"author": "monstersandlanguages", "body": "Ugh. That's when having the Teostra armor might come in handy, haha. Capcom bullshits us so hard sometimes.", "created_utc": "1660362875.0", "edited": "False", "id": "ik36d2b", "is_submitter": "True", "link_id": "t3_wn3pim", "parent_id": "t1_ik33rn9", "score": "1", "subreddit": "monsterhunterrage", "subreddit_id": "t5_3a2f0"}, {"author": "monstersandlanguages", "body": "I've heard MR Teostra described as either a normal elder dragon or a complete menace. That's why I started with Kushala--get the full armor set and at least negate Teostra's heat ability. (ETA: Just fought Teostra. He's everything Kushala could have been. A challenge, but not coked-up or downright unfair.)\n\n\nIf Capcom fucked up MR Chameleos like they did Kushala, I'll probably shit myself.", "created_utc": "1660361396.0", "edited": "1660372893.0", "id": "ik33mqd", "is_submitter": "True", "link_id": "t3_wn3pim", "parent_id": "t1_ik33aug", "score": "3", "subreddit": "monsterhunterrage", "subreddit_id": "t5_3a2f0"}, {"author": "monstersandlanguages", "body": "I AM AN ANGRY COMPUTER TOUCHER TODAY.\n\n\nI'M BEING FORCED TO DUPLICATE CODE THAT'S ALSO GOING TO TURN INTO TECH DEBT IN ABOUT FIVE SECONDS WHEN OUR CONTRACT CHANGES THEIR FUCKING MINDS YET AGAIN.\n\n\nI'VE BEEN YEETED ONTO A CHALLENGE USING A TECHNOLOGY I HAVEN'T TOUCHED IN TWO YEARS, AND I HAD NO IDEA IT WAS COMING UNTIL FIVE MINUTES AGO. WORST PART? THERE'S NO FUCKING WAY I CAN DO IT. PRODUCT PLAN? KANBAN BOARD? AN IMPLEMENTATION PLAN STRATEGY? DO I LOOK LIKE A FUCKING PRINCIPLE DEVELOPER TO YOU? I JUST MADE IT TO SENIOR WHAT THE FUCKING FUCK.\n\n\nI JUST READ THE REST OF IT. YO WHAT THE FUCK. IF YOU HAVE AN APP YOU WANT PEOPLE TO FUCKING WORK ON, BRING THEM ONTO YOUR TEAM. DON'T ASK THEM TO CRAM AN ENTIRE GODDAMN APP COMPLETE WITH DOCUMENTATION FOR DEVS AND STAKEHOLDERS IN JUST A WEEK.\n\n\nGUESS IT'S TIME TO START UPDATING MY RESUME. THIS WAS A GREAT JOB, TOO. \n\n\nMY COWORKER IS RAGING WITH ME BECAUSE THIS PULLS ME OFF WORK THAT I WAS HELPING HIM WITH AND IT'S COMPLETE BULLSHIT. COMPLETELY FUCKING UNFAIR.", "created_utc": "1660336510.0", "edited": "False", "id": "ik1k7fe", "is_submitter": "False", "link_id": "t3_wmekad", "parent_id": "t3_wmekad", "score": "1", "subreddit": "cscareerquestions", "subreddit_id": "t5_2sdpm"}, {"author": "monstersandlanguages", "body": "Woo, long one.\n\n\nI was involved in the adoptables community. It's part of the online digital art community where people make characters called \"adoptables\". These characters can be anything from a few cents to multiple hundreds (or even low thousands) of dollars. They can be cute anime boys, dogs, dragons, or things called \"closed species\". It's just pixels. You almost never get anything you can touch with your hands.\n\n\nThe community is cliquey and the popular people tend to either be self-absorbed or unwilling to engage outside of their circle for a multitude of reasons. People can get unbelievably hostile if you own an adopt they want, or they think you own too many from a specific artist, etc.\n\n\nSome of the artists themselves can be very nice, but in the end they just want as much money as they can fleece out of you. Once that invoice clears? You might as well be invisible. They 100% do not care about you in any way, shape, or form as a human being.\n\n\nThe whiteknights for these artists tend to be insane. Very \"pick me!\" behavior. Many of them will ignore everything from scams to pedophilia.\n\n\nI'm not saying there aren't normal, friendly people in the community. What I *am* saying is they're drowned out by the people willing to throw hundreds to thousands of dollars for pixels from popular artists, as if that, by extension, makes them popular, too. They're drowned out by people who want to beat you down for having something they want, or for daring to speak out against the practices that have turned the community into a cesspit.\n\n\nIt started out as an okay community, but in the past two years it's become disgusting with how manipulative and destructive the artists tend to be (and some of the regular community members). You're so afraid to say anything that it's like being in an abusive relationship. \n\n\nPeople will spend large chunks of their paychecks for an adoptable that they often later have to resell, at a loss, or that they'll immediately trade for something else. Some of the worst artists come up with terrible stories about being kicked out, not being able to afford insulin, etc., in an attempt to get their work sold faster and for a higher price.\n\n\nShopping addiction is a very well known phenomenon in the entire community. Nobody likes to address it, because then it becomes, \"oh, so you don't want artists to make a living?!\" And then the whiteknights descend upon you with hammers.\n\n\nJust...not a great community, especially the \"closed species\" sub-community, where the prices are often the highest, the rules on what you can do with your purchases are often quite stringent, and regular community members range from normal to \"worships the ground the owner walks on\".\n\n\nNow that I'm out of it, I see it's a bizarre, toxic, and expensive community and hobby. Not worth even looking at if you have a spending problem. You'll get yourself into deep shit, like this poor soul who spent over 20 THOUSAND dollars on something called a Grem2: https://www.reddit.com/r/HobbyDrama/comments/i4oqe7/adoptablesclosed_species_the_furry_that_sold_for/.", "created_utc": "1660197557.0", "edited": "False", "id": "ijtol7t", "is_submitter": "False", "link_id": "t3_wjqfld", "parent_id": "t1_ijti8jb", "score": "2", "subreddit": "shoppingaddiction", "subreddit_id": "t5_33bb0"}, {"author": "monstersandlanguages", "body": "Interesting. Admittedly I don't watch much anime but the sentences I'm getting don't have that feel to it. 🤔 You sound like you're on the fence, so it might be a good idea to just use the free version for awhile longer before making a decision to buy or find something else. Maybe only use it for one or two languages?", "created_utc": "1660078808.0", "edited": "False", "id": "ijmr5gj", "is_submitter": "False", "link_id": "t3_wkasq9", "parent_id": "t1_ijmgtod", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "monstersandlanguages", "body": "tl;dr If you're advanced beginner and up, learning a more common European language, then imo yes, it's worth it.\n\n\nWhat language and how good are you at it? If it's any of the common European languages like German, Italian, etc., it's a good value, imo. Anything else is suspect (I'll explain why in a moment).\n\n\nI love Clozemaster (for German), but I would say it's a late beginner/early intermediate tool. It just...throws a lot at you with little to no context. I started using it around month 6-ish of German. I like the grammar challenges a lot, too.\n\n\nYou need to know juuuust enough of the language to be able to tell if a sentence is weird, needs a specific context, etc. The sentences come from Tatoeba, which is a crowd-sourced collection of sentences in different languages. Quality and accuracy can vary BUT more common European languages (ex: Spanish, Italian, German, etc) tend to have a higher level of accuracy just by virtue of there being more speakers...which is why I trust Clozemaster for German.\n\n\n(PS: Duolingo sourced at least some of their sentences from Tatoeba, too, so this isn't a unique thing to Clozemaster.)\n\n\nI've heard the east Asian entries (ex: Korean) in Tatoeba can suffer anything from a bit to a lot from inaccuracies, rude constructs, etc., so if you're studying one of those languages, go elsewhere.\n\n\nClozemaster does seem to periodically correct sentences that people have reported. I've seen sentences with comments that have the incorrect version of the sentence, but the one Clozemaster presents to you is correct.", "created_utc": "1660073638.0", "edited": "False", "id": "ijmdnel", "is_submitter": "False", "link_id": "t3_wkasq9", "parent_id": "t3_wkasq9", "score": "5", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "monstersandlanguages", "body": "Omg, some of these hitboxes.\n\n\nNargacuga is a major offender. Let's say you're up on a ledge, well above even the height Nargacuga can jump. If he does that spinning attack right under you (yes, the tail passes through the environment *sigh*), you'll be knocked on your ass with a hair of chip damage. If he does that tail slam, you'd better be well out of the way of the end of that tail because it'll knock you around.\n\n\nNow, I kinda understand the tail slam. For sure that'd create shock waves, but shock waves should be chip damage, not \"fling you into oblivion\" damage. Ffs, a hunter can leap from the highest point in the map to the lowest without ruining a single knee. I think a little shock wave isn't going to be an issue.\n\n\nThe weapon hitboxes were why I quit playing Greatsword even though it's a cool weapon. By MH logic, the GS hitbox should be about the size of a small Volvidon. You'd think it was the thinnest sheet of steel, ffs. Not even chip damage, either! The weapon is so awkward and slow that it's kind of unfair that you have to be right on the money to do damage when monsters like Nargacuga can hit you when you're high up on a ledge.\n\n\nA lot of the Rise monsters have hitbox jank, with the noodly bois being an exception. It's hard to mess up a noodle, after all. (Though where there's a will, there's Capcom.)", "created_utc": "1660056140.0", "edited": "False", "id": "ijl330e", "is_submitter": "False", "link_id": "t3_wk3zh5", "parent_id": "t3_wk3zh5", "score": "17", "subreddit": "monsterhunterrage", "subreddit_id": "t5_3a2f0"}, {"author": "monstersandlanguages", "body": "For me, it was a big mix of things, but three things stick out.\n\n\n1. I got tired of the community surrounding my addiction. They treated me like shit the moment the invoice cleared and just acted like children in general. I don't have the patience for these kinds of people. They're so transparent and borderline abusive! But it's tolerated because they're popular on the internet.\n\n\n2. I switched positions at my job. The change involves me taking classes, trying lots of new things, etc. It pivoted my desire to shop into a desire to learn and work. I dunno, I guess I need a lot of \"mental stimulation\" and something goal-oriented.\n\n\n3. I recently had a health scare. It's still ongoing to a degree, because no one knows what's up. It made me realize that I've stuck my head deep in my shopping sites and missed the little things, like how the trees change with the seasons. It all seems so mundane, but when you stop to ponder it, you realize how much you missed it.\n\n\n\nTook about, I dunno, six or seven months. The temptation to spend is still there, but now I can satisfy it by buying a nice art print, pin, etc. every few weeks. It's also nice not to have to worry about money anymore.", "created_utc": "1660024254.0", "edited": "False", "id": "ijjnvep", "is_submitter": "False", "link_id": "t3_wjqfld", "parent_id": "t3_wjqfld", "score": "25", "subreddit": "shoppingaddiction", "subreddit_id": "t5_33bb0"}, {"author": "monstersandlanguages", "body": "This has been my experience.\n\n\nThat's not to say a PIP is 100% \"you're getting fired\". Sometimes it means, \"I think you can improve, but you're on thin ice and I wanna be able to dump you fast if it comes to that.\"\n\n\nIn the case of OOP, I'd start looking for a new job. Telling off your boss isn't *always* a trip to the unemployment line, but doing that and then not falling all over yourself with apologies pretty much *is*. Not to mention OOP isn't performing up to the company's standards (which may or may not be reasonable--you can't tell from these posts). A high performer who has one outburst then apologizes right away gets more leeway than a lower performer who doesn't apologize.", "created_utc": "1659981229.0", "edited": "False", "id": "ijgxe0z", "is_submitter": "False", "link_id": "t3_wj1ifv", "parent_id": "t1_ijfsggt", "score": "3", "subreddit": "BestofRedditorUpdates", "subreddit_id": "t5_2ea6kj"}, {"author": "monstersandlanguages", "body": "Oh, yup. That, too. Even if she didn't make money, there's 100% some psycho out there jackin'/weed whackin' it to this vid. :(", "created_utc": "1659919547.0", "edited": "False", "id": "ijdrf9u", "is_submitter": "False", "link_id": "t3_wie1ag", "parent_id": "t1_ijdogti", "score": "10", "subreddit": "eyeblech", "subreddit_id": "t5_3fhf0"}, {"author": "monstersandlanguages", "body": "Huh, maybe I'll try replacing the slots with some defense instead since I like to tank. 🤔 I only have a little MHGU experience and nothing else from before MH Rise so I don't miss the loss of the iframes.", "created_utc": "1659912049.0", "edited": "False", "id": "ijdb6ql", "is_submitter": "False", "link_id": "t3_whyisn", "parent_id": "t1_ijd88my", "score": "1", "subreddit": "monsterhunterrage", "subreddit_id": "t5_3a2f0"}, {"author": "monstersandlanguages", "body": "As a mental exercise out of pure morbid curiosity, I try to put myself in the shoes of people like this lady. *WHY* would you want to do something this fucked up? What's driving you?\n\n\nThe best I can come up with is frustration (with the kids or something else) overflows and the vulnerable who can't fight back become an attractive target. Animals are the usual targets, but now and then you have a real floater come cruisin' down shit river.\n\n\nNext thing I can come up with is this: a baby's cry trips a hard-wired circuit in human brains, and some people get irrationally angry. Now, most people get that you can't take your anger out on a *baby* and find other, healthier ways to deal. Other psychos think slapping the crap out of their kid solves the problem. So psycho and also stupid, a potent combo.\n\n\nThis kind of aggression reminds me of \"predatory drift\" in dogs where the cries of another dog can trigger the pack to descend on it like wolves on an elk. The lady's lucky the vigilantes didn't go full wolf pack on her. That video messed me right the fuck up. I feel like I need a shower.", "created_utc": "1659911796.0", "edited": "False", "id": "ijdaloz", "is_submitter": "False", "link_id": "t3_wie1ag", "parent_id": "t1_ijaw06s", "score": "33", "subreddit": "eyeblech", "subreddit_id": "t5_3fhf0"}, {"author": "monstersandlanguages", "body": "0_0 Seriously? It performs pretty well for me. I might be too early in MR, though (just got past Malzeno--I like to take things slow, lol.)", "created_utc": "1659907721.0", "edited": "False", "id": "ijd0u9l", "is_submitter": "False", "link_id": "t3_whyisn", "parent_id": "t1_ijam0h5", "score": "1", "subreddit": "monsterhunterrage", "subreddit_id": "t5_3a2f0"}, {"author": "monstersandlanguages", "body": "I think MR changed things up a bit. It's less forgiving compared to even the end game of base Rise unless you play it a certain way. I've definitely seen people with specific builds beat the shit out of monsters without needing Spiribirds or anything like that. You wanna play a different build? Make it work or suffer.\n\n\nI also pack Evade Extender (2 only) and full Evade Window. But still get those birds 'cause it's relaxing and I fight like a maniac and tank *a lot* of attacks. 😂 You ain't tanking Malzeno's tail stabs without extra HP, I'll tell you that much.", "created_utc": "1659854475.0", "edited": "False", "id": "ija6sj0", "is_submitter": "False", "link_id": "t3_whyisn", "parent_id": "t1_ija1q21", "score": "8", "subreddit": "monsterhunterrage", "subreddit_id": "t5_3a2f0"}, {"author": "monstersandlanguages", "body": "The ridiculous AOE attacks in this game are what made me quit before finishing the endgame material. Main story was quite good, though. Better than the the first minus the gimmick at the end with Ratha and the MC.", "created_utc": "1659846197.0", "edited": "False", "id": "ij9uaq4", "is_submitter": "False", "link_id": "t3_whihef", "parent_id": "t3_whihef", "score": "3", "subreddit": "monsterhunterrage", "subreddit_id": "t5_3a2f0"}, {"author": "monstersandlanguages", "body": "The Spiribirds feel like a difficulty slider + warm up to get into a hunt. The warm up, I can get. Personally, I like the warm up because I'm a filthy newb degenerate. And since Spiribirds are a difficulty slider, you can skip the birds.\n\n\nUntil MR. MR is where they fucked it up. Right about after Garangolm.\n\n\nOmfg, so many of these monsters hit so fucking hard. Tigrex, Espinas, Gore Magala, Malzeno, etc. Now you have to collect at least some birds or eat shit. The solution would be pretty easy. After HR, or maybe after Garangolm, just put the Rainbow Bird near the camp. You can choose to take it, or not.\n\n\nThe only alternative that's worked for me is to drink those mega armorskin potions + dash and eat for higher defense. Then just nab what Spiribirds you can on your way to the monster. I also use Evade Extender x2 + Evade Window x5 so that helps. The hunt takes way longer, though, because you have to stay conservative. Ex: 15 min Gore fight turned into 25. :\\ About half the fun.", "created_utc": "1659845956.0", "edited": "False", "id": "ij9tvk9", "is_submitter": "False", "link_id": "t3_whyisn", "parent_id": "t1_ij8wmbm", "score": "25", "subreddit": "monsterhunterrage", "subreddit_id": "t5_3a2f0"}, {"author": "monstersandlanguages", "body": "Hm, well, you've gotta be at least 20 for the Chameleos weapon. Apex monsters are sort of of end-game in base Rise so definitely get closer to that end game before fighting Apex.", "created_utc": "1659744524.0", "edited": "False", "id": "ij4hrrp", "is_submitter": "False", "link_id": "t3_wgj70l", "parent_id": "t1_ij48c14", "score": "1", "subreddit": "monsterhunterrage", "subreddit_id": "t5_3a2f0"}, {"author": "monstersandlanguages", "body": "Rathalos armor is way too weak, imo. Iirc, I went in with a full set of Valstrax armor and some Evade Extender. Valstrax set might be more than you need unless you like to unga-bunga like I do, in which case you're gonna want that set, lol.\n\n\nDoes the Chameleos weapon have any element associated with it? I don't think it does so you're cheating yourself out of DPS. Ice element is the best, but you can use dragon or water as well. If you bring Palicos or Palamutes with you, make sure you have them upgraded.\n\n\nETA: Also take advantage of those trip bugs. They can save your ass in a pinch.", "created_utc": "1659726613.0", "edited": "1659726899.0", "id": "ij3b0g9", "is_submitter": "False", "link_id": "t3_wgj70l", "parent_id": "t1_ij1905q", "score": "2", "subreddit": "monsterhunterrage", "subreddit_id": "t5_3a2f0"}, {"author": "monstersandlanguages", "body": "Epilepsy...damn. Just imagine: you're already a little confused and groggy from the fit. You feel like shit as it is. Now you've had over half your body burned and may or may not yet understand wtf just happened. \n\n\nWish onlookers had tipped the pot sooner. Probably would have given the guy a better chance.", "created_utc": "1659643691.0", "edited": "False", "id": "iiymf9n", "is_submitter": "False", "link_id": "t3_wg1yp8", "parent_id": "t1_iixjdp5", "score": "9", "subreddit": "NSFL__", "subreddit_id": "t5_3lcigy"}, {"author": "monstersandlanguages", "body": "I'm not 100% convinced it's *just* the effects, because I've never had a framerate drop on Gore Magala (and I've fought Gore so many times).\n\n\nMy framerate nemesis? MASTER RANK TIGREX. Specifically when the bastard is doing that new tail attack. And *only* in the Citadel...but not every time. Nothing severe, but enough where I've thought, \"wow, they should probably fix that.\"\n\n\nI don't have a friends list. I've never even been online in this game. So it's not *that*, either. So frustrating and weird.", "created_utc": "1659536872.0", "edited": "False", "id": "iisaubg", "is_submitter": "False", "link_id": "t3_wf3fmm", "parent_id": "t3_wf3fmm", "score": "3", "subreddit": "monsterhunterrage", "subreddit_id": "t5_3a2f0"}, {"author": "monstersandlanguages", "body": "Same. This video, any video with kids, and any video with animals are hard for me to watch. :( Kids and animals are obvious, but this fire...the screaming, the chaos, the preventable deaths, the people desperately trying to help those jammed in the doorway...it hits you right in the gut.\n\n\nIirc, the guy who owned the club was remorseful, which doesn't make it better, but at least isn't even more salt in the wound.", "created_utc": "1659370881.0", "edited": "False", "id": "iiivgzz", "is_submitter": "False", "link_id": "t3_wd719a", "parent_id": "t1_iigsbcs", "score": "23", "subreddit": "NSFL__", "subreddit_id": "t5_3lcigy"}, {"author": "monstersandlanguages", "body": "I wouldn't put it above some of these people to try it. :\\ You'd be hard-pressed for something from a year ago, of course, but up to six months? Possibly. Maybe other banks are different, but I bank at WF and opened up a dispute last week. No proof required. Shit, what proof would I have? My card was legitimately fraudulently charged.\n\n\nAnyone willing to steal from artists at this scale will have few compunctions about not committing fraud. They do not care about anyone else but themselves and I hope their bank rips them a new asshole and they step on a Lego every day.", "created_utc": "1659159701.0", "edited": "False", "id": "ii85l7g", "is_submitter": "False", "link_id": "t3_wbe2lh", "parent_id": "t1_ii82x6v", "score": "10", "subreddit": "VRchat", "subreddit_id": "t5_32s02"}, {"author": "monstersandlanguages", "body": "People have started going straight to their banks. 😔 You still have a chance to win a dispute like that--especially if the buyer has purchased from you before--but now you're fighting with the goddamned bank.\n\n\nETA: Also, people who chargeback artists for a commission they're happy with are scum. Hope their bank/Paypal eats their fingers.", "created_utc": "1659137641.0", "edited": "1659137982.0", "id": "ii6zkzt", "is_submitter": "False", "link_id": "t3_wbe2lh", "parent_id": "t1_ii6xab3", "score": "27", "subreddit": "VRchat", "subreddit_id": "t5_32s02"}, {"author": "monstersandlanguages", "body": "Tbh, he seemed slower to me in Generations and definitely wasn't airborne as much. (Or maybe the AI had mercy on me, dunno.) His colors were also more vibrant so those red markings stood out instead of looking like mud.\n\n\nI have fully-slotted invincibility and two of that roll distance (can't remember the exact name rn) and even then this little fucker's divebomb still gets me sometimes. My camera set up from Apex Diablos is a dream here, though. If you set the camera up to move quickly, you can swing it around in time to have a *chance* to avoid the divebombs.\n\n\nThen, when he finally decides to land, he does that kick thing that can also obliterate you. \n\n\n\nI thought Lunagaron didn't stop moving. No, Steve is the one racing around on some high-tier meth. Good gravy, just STOP MOVING FOR ONE SECOND.", "created_utc": "1658940872.0", "edited": "False", "id": "ihvgff3", "is_submitter": "False", "link_id": "t3_w92knv", "parent_id": "t3_w92knv", "score": "4", "subreddit": "monsterhunterrage", "subreddit_id": "t5_3a2f0"}, {"author": "monstersandlanguages", "body": "Oh, that makes sense. Thanks! :)", "created_utc": "1658623304.0", "edited": "False", "id": "ihe1y4d", "is_submitter": "True", "link_id": "t3_w6igfx", "parent_id": "t1_ihe1iau", "score": "1", "subreddit": "German", "subreddit_id": "t5_2qq51"}, {"author": "monstersandlanguages", "body": "Maybe this explains why I kept reading \"Arabic\" incorrectly this week.\n\n\nInstead of, \"air-uh-bic\", I kept reading it as \"ah-rah-bic\" to the point I thought I was having a stroke.", "created_utc": "1658510604.0", "edited": "False", "id": "ih7pyfb", "is_submitter": "False", "link_id": "t3_w52a9a", "parent_id": "t1_ih6164s", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "monstersandlanguages", "body": "How long ago did you start and how often is \"once in a while\"?\n\n\nIf you started fairly recently (last 2 or 3 months) and \"once in a while\" is more than once every few weeks, you should talk to your doc.\n\n\nFrom what I've read, Lexapro hits some people too hard with the neuro side effects. Hell, I got OFF of Lexapro and it may be fucking with my eyes after a very thorough titration. I actually have to get an MRI on my head to check for MS, tumors, etc. 😭😬", "created_utc": "1658194852.0", "edited": "False", "id": "igq02bb", "is_submitter": "False", "link_id": "t3_w26cb6", "parent_id": "t1_igpdvb4", "score": "7", "subreddit": "BestofRedditorUpdates", "subreddit_id": "t5_2ea6kj"}, {"author": "monstersandlanguages", "body": "How many languages have you learned by now by avoiding the \"incorrect\" mainstream advice?\n\n\nOr if you're still on language the first, what kinds of tasks can you accomplish in it? For example, can you read a newspaper? Order food? What can you do? How long have you known this language?\n\n\nYou come here  to dispense these bits of \"wisdom\". But your \"wisdom\" goes against the prevailing theories that have worked for *thousands* and thousands of people. I had some sympathy for you at first, but you know what? I don't even think you're a troll. I think you're someone on the brink of throwing a blue-in-the-face tantrum because you don't like the answers on how to learn a language. All of this is cope on your part.\n\n\nWhat are your credentials? What are your publications? What are your accolades?", "created_utc": "1658172348.0", "edited": "False", "id": "igoil1s", "is_submitter": "False", "link_id": "t3_w1o15x", "parent_id": "t1_igmxula", "score": "4", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "monstersandlanguages", "body": "If you play Switch, you'll see a lot of Spanish, German, Japanese, and Korean available. 🤔 \n\n\nMonster Hunter is super fun to play in German, although it's definitely not A2 material, lmao.", "created_utc": "1658074629.0", "edited": "False", "id": "igj60hj", "is_submitter": "False", "link_id": "t3_w12qha", "parent_id": "t3_w12qha", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "monstersandlanguages", "body": "I've found it a helpful supplement to drills and then reading/listening to lots and lots (and lots) of native input. When I tried just doing grammar on its own, I learned pretty much nothing and couldn't recognize the grammar structures out in the wild. There's gotta be that element of consuming native content like books and TV shows.\n\n\nOne thing I still do that's been super helpful is I'll read a short article/story/whatever, note 3 - 5 verbs, and then practice conjugating them. (I use a dictionary to make sure I'm correct, lol.) It's a little time-consuming but after about five months I even have a good \"feel\" for when a verb is likely to be irregular.\n\n\nSame thing with adjective declensions, btw.", "created_utc": "1658074446.0", "edited": "False", "id": "igj5o9d", "is_submitter": "False", "link_id": "t3_w16rrj", "parent_id": "t3_w16rrj", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "monstersandlanguages", "body": "(Psssst, Deepl's better for the languages it supports which, to be fair, is far fewer than Google Translate's.)\n\n\nI don't think there will ever be a perfect translator because some things just don't translate well. For example, take the German word, *ja*. Now, as a word on its own, it just means, \"yes\". And translators are of course very good at picking up on that!\n\n\nBut *ja* has other meanings. For example, *er ist ja ein Arzt*. Deepl translates that as, \"he is, after all, a doctor.\" GT translates it as, \"he's a doctor\". Neither are completely correct, though Deepl comes super close. In this case, *ja* is a modal particle that indicates a bit of info that's already known.\n\n\nOr take, *das ist ja schön*. Both Deepl and GT translate that as, \"that's nice\". But in this case, *ja* functions as a sort of intensifier. A closer translation would be, \"that's *very* nice\".\n\n\nWhile I think machine translators have their place and are useful, they aren't a replacement for learning the language. You're going to miss out on little things that are unreasonable to expect a machine to understand. Because of that, you'll never be able to make a deep connection with another person. Your relationship will lack the little nuances that bring people together.", "created_utc": "1658002886.0", "edited": "False", "id": "igfpnau", "is_submitter": "False", "link_id": "t3_w0o5si", "parent_id": "t3_w0o5si", "score": "8", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "monstersandlanguages", "body": "Formal? Sort of. It's always going to come off as a bit...direct, though.\n\n\n\"That's a strange thing to say. Are you feeling alright?\"\n\n\n\"Let's talk before you go forward with your decisions here. I have some concerns.\"", "created_utc": "1657899957.0", "edited": "False", "id": "ig9z2f9", "is_submitter": "False", "link_id": "t3_vzl8rw", "parent_id": "t1_ig9qnkg", "score": "3", "subreddit": "German", "subreddit_id": "t5_2qq51"}, {"author": "monstersandlanguages", "body": "I've used them from the start. They haven't helped my listening skills at all, lol, but boy have they accelerated reading and writing to the point where my Verhandlung-level pen pal is even surprised. \n\n\nWhat's helped so far is to pick a grammatical topic for the week and drill it 30 minutes daily. For example, you might pick adjectives and, say, three different declensions.\n\n\nNext week might be different mood tenses in verbs.\n\n\nJust bounce around to whatever topic is giving you the most grief lately.\n\n\nDo you use Anki? You might search for Anki grammar decks. I found one for German and while it's no substitute for actual practice and immersion, it's a nice add-on!\n\n\nBut if it's speaking you're having issues with, maybe you need a tutor/group you can meet with a couple times a week?", "created_utc": "1657342666.0", "edited": "False", "id": "ifftdxd", "is_submitter": "False", "link_id": "t3_vumgga", "parent_id": "t3_vumgga", "score": "12", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "monstersandlanguages", "body": "It's a *great* supplement because the exposure to different grammatical constructs is so useful. You need to be doing other stuff on the side, though, like maybe Seedlang (if you're doing German like I am), along with listening to stuff like Easy Languages, reading books, etc.\n\n\nSometimes the sentences Clozemaster throws at you really need more context, though.", "created_utc": "1656686173.0", "edited": "False", "id": "iegg74x", "is_submitter": "False", "link_id": "t3_vp0pm4", "parent_id": "t3_vp0pm4", "score": "12", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "monstersandlanguages", "body": "Not great news, but I appreciate your honesty immensely. Hopefully it's just some a bad inner ear infection or something.", "created_utc": "1656683373.0", "edited": "False", "id": "ieg9qbc", "is_submitter": "True", "link_id": "t3_vort44", "parent_id": "t1_iefsmyo", "score": "1", "subreddit": "SSRIs", "subreddit_id": "t5_2yhc1"}, {"author": "monstersandlanguages", "body": "Agreed as long as it's not something like, \"oh, but X culture ladies/men are so Stereotype!\" See it a lot with dudes and Japanese women.\n\n\nIt's a fun fantasy if you can look past stereotypes and it doesn't interfere with actual study.", "created_utc": "1656601525.0", "edited": "False", "id": "iebrhh9", "is_submitter": "False", "link_id": "t3_vnwumd", "parent_id": "t1_ie9snku", "score": "11", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "monstersandlanguages", "body": "I'm about 220 hours into -A2 German with some -B1 material close to comprehensible (dunno how many hours I put in for A0 - A1, I just know that I have a learning disability and take 3x longer to learn things).\n\n\nIt got less fatiguing around hour 50. As you improve, your excitement and endurance increases. The trick is not to use them all up in one day if you can help it. Always leave yourself feeling revved up for another half hour of study.\n\n\nYou can also dodge burnout by giving yourself permission for a day once or twice a month where you just half-ass your lessons so you're not buried in review material. Sometimes your brain just needs a break to rearrange the new info its taken in. Also, don't push yourself too hard if you're super tired, stressed, sick, etc. Just do enough so that you won't have an avalanche of review materials the next day.\n\n\nAnother way is to spread out small amounts of time over various areas of language learning. For example, here's the minutes I studied on the 28th, when I was tired:\n\n\n1. 30 writing (copy)\n2. 30 reading\n3. 30 vocabulary\n4. 10 Seedlang/Clozemaster\n\n\nBut the 25th was much better:\n\n\n1. 30 writing (copy)\n2. 30 Seedlang\n3. 30 Clozemaster\n4. 30 listening\n5. 30 grammar (adj)\n6. 30 reading", "created_utc": "1656444466.0", "edited": "False", "id": "ie3dgty", "is_submitter": "False", "link_id": "t3_vmsoox", "parent_id": "t3_vmsoox", "score": "4", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "monstersandlanguages", "body": "Looks like the bullet sliced into the...carotid artery? The moment the faucet turned on, he probably knew he was toast.\n\n\nGuess that's what happens sometimes when you play this particular game. I'm glad it seems that no one else was seriously injured.", "created_utc": "1656218143.0", "edited": "False", "id": "idrrbz5", "is_submitter": "False", "link_id": "t3_vkss3q", "parent_id": "t1_idr4nzp", "score": "377", "subreddit": "NSFL__", "subreddit_id": "t5_3lcigy"}, {"author": "monstersandlanguages", "body": "While I know it *shouldn't*, Leetcode has destroyed my confidence. I've *never* been good at it, but coming back after four or five years of none of it makes me wonder if the problems are really that tricky, or if I have a brain tumor.\n\n\nI can't knock it tf off with \"okay, but...\" For example, the \"Buddy Strings\" problem. \"ab\" != \"ab\" \"Okay, but they're literally the same string.\" *That's not the point of the exercise.* \"Okay, but why not make use of the goal string...?\" *Not. The point. Of the exercise.*\n\n\nOf course, we all know that not everyone is good at these brain teasers, you've got to practice, read CtCI, brush up on DS&A, etc. That doesn't help when your entire life is invested in having some degree of intelligence.\n\n\nThen *double* of course, you've psyched yourself out now, so problems are even trickier, and you go back to work on Monday, stare at the screen, and wonder how you ever got a job in the first place. \n\n\nIt's such a ridiculous thing to get hung up on that I've got to drop a rant here. Comp sci/programming is an amazing field but my God, the brainteasers. Maybe I should focus on DS&A, design patterns, etc., and building new projects and just forget the brainteasers because at this rate I'm going to end up in the nuthouse.", "created_utc": "1656194952.0", "edited": "False", "id": "idqjoy5", "is_submitter": "False", "link_id": "t3_vk98hv", "parent_id": "t3_vk98hv", "score": "1", "subreddit": "cscareerquestions", "subreddit_id": "t5_2sdpm"}, {"author": "monstersandlanguages", "body": "It's not as grueling or terrible as some people make it out to be if you have the passion. But it's easy to burn out.\n\n\n\nThat said, I also don't think the daughter should have lied. If you take money with an understanding you're going to do X with it, you might get yelled at for doing Y. OP and daughter need to sit down and find some sort of middle ground here. If he can afford it, perhaps he can agree to pay half the tuition and daughter foots the rest? Maybe his daughter can show him a career plan and the portfolio she must be building for future jobs?\n\n\nDepending on what sort of illustration OP's kid is going into, her prospects are OK. Hell, if she moonlights as a furry artist, she might make decent money within a year or two. 😂 Often, illustration has a distinct lack of stability in the earlier years, but if she's willing to take that risk...\n\n\nIt's also so sad OP didn't have any room to be proud of that display. :( Not everyone gets into those.", "created_utc": "1655940367.0", "edited": "False", "id": "idd6d6x", "is_submitter": "False", "link_id": "t3_vibxd6", "parent_id": "t1_idcq2n5", "score": "1", "subreddit": "AmItheAsshole", "subreddit_id": "t5_2xhvq"}, {"author": "monstersandlanguages", "body": "Jaguar is better. They bite you in the back of the skull so it's quicker.", "created_utc": "1655662078.0", "edited": "False", "id": "icyvyde", "is_submitter": "False", "link_id": "t3_vfemj0", "parent_id": "t1_icw0le2", "score": "1", "subreddit": "NSFL__", "subreddit_id": "t5_3lcigy"}, {"author": "monstersandlanguages", "body": "So, I can't relate to this too much from the language learning perspective, as I'm nowhere *near* your level. When I read the thread title, however, it brought to mind my profession: software engineering.\n\n\nA lot of us in engineering deal with Imposter Syndrome. We've done the work, our evals are good, maybe we're far enough along that we help mentor juniors, but we feel so incompetent. A new thing to learn comes along and we feel like total losers for not being able to pick it up on the fly. We make a mistake (simple or otherwise) and feel like losers just a few steps from being fired. There's so much to learn as it is--it gets overwhelming.\n\n\nThe people who take this feeling and use it to constantly better themselves often become amazing software engineers. Even those who don't become amazing do better because they don't stagnate. So if you distill this feeling into a drive to constantly improve and learn, you will be lightyears ahead of people who treat this awful feeling a different way...\n\n\nBy finding their comfort zone and never leaving it. You will find engineers in this field whose skills have practically ossified because they never try anything new. If a job demands it of them, they leave. So they can barely use AWS, they're stuck with a specific IDE, they \"can't\" learn new programming languages. Some of them end up pushed out of the field because their \"thing\" is obsolete.\n\n\nWhat I'm getting at is your feelings are perfectly normal and now you're at a fork in the road. Do you keep pushing yourself, or do you find your \"niche\" and hang on for dear life? The decision is yours. This thread already has lots of good advice if you decide to forge onward.\n\n\nGood luck!", "created_utc": "1655659961.0", "edited": "False", "id": "icyrdqv", "is_submitter": "False", "link_id": "t3_vfuc7z", "parent_id": "t3_vfuc7z", "score": "8", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "monstersandlanguages", "body": "I'm sorry, you *do* need to find another hobby. There's no rule saying you can't come back to this one later! If it makes you feel better, I came back to language learning after a 10-year hiatus, learned German to barely A2, and then came back *again* eight months later. Still going strong and starting to understand some early B1 material. Sometimes you need the mental and emotional space from something.\n\n\nNo way are you becoming a polyglot--or even bilingual--if you're this indifferent. I don't even need a B1 to be able to tell you this. Language learning has its rough spots like anything else. Some days you're sledding down the hill, other times you're climbing a nearly-vertical cliff face. If you don't have any passion other than, \"I want to be at the finish line *now*\", how are you going to get through the bad parts?\n\n\nThe people who \"nail down\" their languages fast are the people who love learning them, or who have to learn them fast for work or something.\n\n\n*Why* do you want to be a polyglot? It's obviously not for love of language, because you wouldn't still be wrestling with these questions after months and months. You need to be honest with yourself.", "created_utc": "1655659074.0", "edited": "False", "id": "icyphfh", "is_submitter": "False", "link_id": "t3_vfb6b4", "parent_id": "t1_icy914o", "score": "4", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "monstersandlanguages", "body": "I'm well aware of LI. I'm not 100% convinced he's a troll. More like one of those people who wants to learn a language so much, but won't put in the work, and can't accept that learning a language takes time and yes, a lot of aspects are difficult. When that boils over, he comes here to throw a little fit.", "created_utc": "1655579010.0", "edited": "False", "id": "icv1bxc", "is_submitter": "False", "link_id": "t3_vfb6b4", "parent_id": "t1_icv1389", "score": "6", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "monstersandlanguages", "body": "Well...you don't have to learn everything at once... (Or most people don't, anyway).\n\n\nLearning present, the simple (or most-used) form of past, and the simplest (or most-used) form of future for verbs will take you a long way if you're in a hurry to get started.\n\n\nFind a language you absolutely adore and keep hacking at it. But I feel you. I've been putting in 90 - 120 minutes for several months now and it feels like my skill level is just creeping along, but it's measurable. You've gotta work at it every day, but one day you'll understand a bit more of that video, or you'll be able to read two or three articles in a half hour instead of just one.\n\n\nOh, and grammar is absolutely diabolical no matter what natural language you learn. Ever took a look at an English grammar book? Read one and you'll realize it's a miracle we can get anything done in English at all. Or in German. Or in Japanese, Italian, Spanish--there's always a bunch of exceptions or slang or some other thing that pitches you right out the window. The human brain is pretty amazing at handling it, somehow.", "created_utc": "1655578734.0", "edited": "False", "id": "icv0rf2", "is_submitter": "False", "link_id": "t3_vfb6b4", "parent_id": "t3_vfb6b4", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "monstersandlanguages", "body": "Fellow German learner! Hallo! (ETA: Sorry for the long post. I've been very chatty lately.)\n\n\nAnki + reading. Anki takes just 10 minutes a day if you set the number of new cards to a low number like 5. Reading has become a powerful tool (at the expense of other skills). My method:\n\n\n1. Find something fairly low-level to read. Kruschel is a kid's newspaper that's a good candidate.\n2. Read the thing once.\n3. Go through and look up the definition for *every* word you don't know. Even if you're almost sure you know, look it up and write it down in a Word doc or whatever. The Leo dictionary seems to be the best online German -> English dictionary. Reverso is good, too. Deepl is a good machine translator you can use for spot-checking phrases. (Do *not* use Google Translate--their MT isn't as good.)\n4. Read the thing again.\n\n\nVery fun, but laborious at first. This is also an opportunity for grammar practice. :)\n\n\nI'm not sure writing is the best way? Unless you're copying something you're reading. As you can tell from my flair, I'm not exactly an expert here. But my theory is you're better off learning vocab through reading because you're getting your vocab in a native context surrounded by native grammar. You can also consume more written works in a short amount of time than produce your own, giving you broader exposure.\n\n\nIt. Is. SLOOOOOOOW. You might want to at least consider supplementing with ten minutes of Anki a day, otherwise the first time you read something more complicated than a graded reader, you're going to be buried. Or at least that was my experience with Tagesschau before taking a *big* step down.", "created_utc": "1655528083.0", "edited": "False", "id": "icstmfh", "is_submitter": "False", "link_id": "t3_vew25f", "parent_id": "t3_vew25f", "score": "6", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "monstersandlanguages", "body": "Sometimes there's an element of, \"if you can learn like a child, it's easy!\" Except it's not. Most children don't get *good* at their language until 6 - 8. Of course, you have to take into account brain development and the bajillion other things kids have to learn, but overall, \"learning like a child\" isn't the easy way to do things.\n\n\nWhat's the easy way to do things? If I knew, I'd have a monetized polyglot Youtube channel by now along with a bunch of publications.", "created_utc": "1655434596.0", "edited": "False", "id": "icnwe6v", "is_submitter": "False", "link_id": "t3_vdxyov", "parent_id": "t1_icn2d0f", "score": "6", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "monstersandlanguages", "body": "No, it looks like there was a typo in the article! :) Wow, that threw me off good, too.\n\nThanks!", "created_utc": "1655081194.0", "edited": "False", "id": "ic5f900", "is_submitter": "True", "link_id": "t3_vazi7e", "parent_id": "t1_ic5eb98", "score": "3", "subreddit": "German", "subreddit_id": "t5_2qq51"}, {"author": "monstersandlanguages", "body": "He didn't seem to be a strong swimmer, but if my understanding is correct, he swam right smack into the middle of the eddy. Another word for eddy is \"whirlpool\". It could drag down even a strong swimmer.", "created_utc": "1654809443.0", "edited": "False", "id": "ibs2rqk", "is_submitter": "False", "link_id": "t3_v8676q", "parent_id": "t1_ibs1nd2", "score": "6", "subreddit": "UnchainedMelancholy", "subreddit_id": "t5_4prkpu"}, {"author": "monstersandlanguages", "body": "Thanks! I always like new stuff to read about how to put German sentences together. (I'll figure it out one of these days.)", "created_utc": "1654755581.0", "edited": "False", "id": "ibpc3m5", "is_submitter": "True", "link_id": "t3_v88mka", "parent_id": "t1_ibp7m5w", "score": "3", "subreddit": "German", "subreddit_id": "t5_2qq51"}, {"author": "monstersandlanguages", "body": "Wow, thanks for taking all the time to type this out. This is super neat. The more I learn about German, the more I like it. :)", "created_utc": "1654755553.0", "edited": "False", "id": "ibpc2eu", "is_submitter": "True", "link_id": "t3_v88mka", "parent_id": "t1_ibp9hst", "score": "42", "subreddit": "German", "subreddit_id": "t5_2qq51"}, {"author": "monstersandlanguages", "body": "I asked the other commenter this: \n\n\nIs there a preference for either? Are there situations where one is more appropriate to use than the other?", "created_utc": "1654749651.0", "edited": "False", "id": "ibp3wgg", "is_submitter": "True", "link_id": "t3_v88mka", "parent_id": "t1_ibp3hd7", "score": "6", "subreddit": "German", "subreddit_id": "t5_2qq51"}, {"author": "monstersandlanguages", "body": "That is so cool! Is there a preference for either? Are there situations where one is more appropriate to use than the other?", "created_utc": "1654749627.0", "edited": "False", "id": "ibp3v4m", "is_submitter": "True", "link_id": "t3_v88mka", "parent_id": "t1_ibp3kns", "score": "4", "subreddit": "German", "subreddit_id": "t5_2qq51"}, {"author": "monstersandlanguages", "body": "Super sad. :( Especially since I recognized the signs of an active drowning in the video. It was so quick! It was like one second he was fine. The next, actively drowning. The next, gone. ETA: The way the guy pulled his friend underwater--textbook drowning. So sad, so preventable.\n\n\nIt's so easy to underestimate water. We bathe in it, wash our clothes/dishes with it, drink it, swim in it...drown in it. It's terrifying how quickly water can kill you, and how even a calm-looking spot of water can be a danger.\n\n\nHopefully they'll at least take the ladder away and repaint the sign after this. You would think the railing would be an indication to be careful, but some people learn the hard way--or pay with their life to be an example to others. RIP, you two.", "created_utc": "1654743489.0", "edited": "1654751787.0", "id": "ibot72r", "is_submitter": "False", "link_id": "t3_v8676q", "parent_id": "t3_v8676q", "score": "50", "subreddit": "UnchainedMelancholy", "subreddit_id": "t5_4prkpu"}, {"author": "monstersandlanguages", "body": "I like it a lot, but it's not enough on its own. :) You'll want to at least find a good site/book on grammar so you can slowly learn all the different grammatical constructs that are going to be thrown at you.", "created_utc": "1654722083.0", "edited": "False", "id": "ibnlheu", "is_submitter": "False", "link_id": "t3_v7w9gw", "parent_id": "t1_ibncvuo", "score": "5", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "monstersandlanguages", "body": "Not 100% familiar with Lingvist, but what features are you looking for? The spaced repetition flashcards? Try Anki.\n\n\nVarious sentences to expose you to lots of different sentence structures in your target language? Clozemaster (there's a freemium version). Buy a grammar book (or find a good site) to supplement.", "created_utc": "1654715037.0", "edited": "False", "id": "ibn543l", "is_submitter": "False", "link_id": "t3_v7w9gw", "parent_id": "t3_v7w9gw", "score": "6", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "monstersandlanguages", "body": "I think the minimum is one hour? I stg I saw that on this subreddit somewhere. Elsewhere, I've read that more than 2 or 3 hours is about where the point of diminishing returns is for most people, but I'm on my second language, not third or fourth, so can't speak beyond that.\n\n\nAnyway, it's 90 - 120 minutes daily for me. At least 30 with some app (supposed to be swapped with grammar study for a week or two every other month or so), 30 reading, 30 active listening, 15 - 30 with vocabulary.\n\n\nHow long it takes depends on the language. You can supposedly get pretty good in German, if you're diligent, in about a year and a half. Something like Chinese takes considerably longer.", "created_utc": "1654442656.0", "edited": "False", "id": "ib9e641", "is_submitter": "False", "link_id": "t3_v59b1y", "parent_id": "t3_v59b1y", "score": "6", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "monstersandlanguages", "body": "So then you want to *have learned* a language, not learn one at this point in time. (Which is fine. I want to *have learned* to draw well, but like you, I find myself wondering, \"why am I doing this?\" when I sit down to do it.)\n\n\nNobody can convince you a language is worth learning, or that becoming multilingual is worth it, because that has to come from within you. You have to have some intrinsic reason to learn, even if it's just, \"hey, this is pretty fun\".\n\n\nWhat language are you learning? Have you considered that maybe, just maybe, that's not the language you want to learn? That is, maybe you *say* you want to learn X language, but the moment you start, your attention drifts off. \n\n\nSounds like you've got some soul-searching to do. We can't help you with that--it's something you have to do on your own.", "created_utc": "1654368744.0", "edited": "False", "id": "ib674w1", "is_submitter": "False", "link_id": "t3_v41g3j", "parent_id": "t1_ib62d4w", "score": "8", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "monstersandlanguages", "body": "The point that you have a much better chance of learning a high number of languages if you start young? What is there to refute here? More (well-spent) time = better learning for virtually anything.\n\n\nHonest question, why do you come here and make posts like these, and then become belligerent when the community has a negative reaction? Further, why do you continue to make posts like these knowing the community has a negative reaction that makes you become belligerent? I've seen you post thoughtful things here before. Why not do that more often?\n\n\nOr, better yet, why not calculate how much time you have left and start learning every language you love to as high a level as you can?\n\n\nAnyway, off to Easy German for me.", "created_utc": "1654363526.0", "edited": "False", "id": "ib5xd1z", "is_submitter": "False", "link_id": "t3_v41g3j", "parent_id": "t1_ib5mbuv", "score": "5", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "monstersandlanguages", "body": "> If you’re only going to see a word once in you’re lifetime, why spend so much time studying it? You wouldn’t do that for rare words in your native language.\n\n\nThis. You'd look up the word in a dictionary and move on unless you're a \"collector\" of rare words.", "created_utc": "1654292851.0", "edited": "False", "id": "ib32ahz", "is_submitter": "False", "link_id": "t3_v49mi5", "parent_id": "t1_ib31yg5", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "monstersandlanguages", "body": "I'm gonna save this and come back to it when I can understand it better. 😂 Can you tell who's fallen behind on grammatical concepts? \n\n\nThank you for taking the time to explain, because these things pop up more and more as reading/listening gets easier. \n\n\nTime to crack open that grammar book for some more drills. :)", "created_utc": "1654290628.0", "edited": "False", "id": "ib2xzaz", "is_submitter": "True", "link_id": "t3_v45v0b", "parent_id": "t1_ib2uk7t", "score": "3", "subreddit": "German", "subreddit_id": "t5_2qq51"}, {"author": "monstersandlanguages", "body": "I meant the *an der Reihe* part but *dran* got me good, too, I'll admit.\n\n\nThe key difference is *you're* has an apostrophe letting you know it's shortened. If it was *d'ran*, that'd be easier for a native English speaker to catch onto. Heck, I didn't even realize *was* could be a contraction for *etwas*. If German did contractions English-style, it would be *'was*.", "created_utc": "1654287922.0", "edited": "False", "id": "ib2skfb", "is_submitter": "True", "link_id": "t3_v45v0b", "parent_id": "t1_ib2s9wk", "score": "2", "subreddit": "German", "subreddit_id": "t5_2qq51"}, {"author": "monstersandlanguages", "body": "Too true! Back when I just started, I was always happy to tell people how to learn a language. Now at a mere -A2 (it's never gonna be -B1, let's be real here), it's, \"I don't know my arse from a hole in the ground. Here's a link to a good subreddit and a list of things I use. Godspeed.\"\n\n\nSometimes I think people are too quick to downvote LI here, but someone in a \"polyglot mindset\" would have figured out their approach does not appear to be working, neh? Or that if you're going to pontificate, you need some actual credentials and reputation to back you up....", "created_utc": "1654285705.0", "edited": "False", "id": "ib2nzv1", "is_submitter": "False", "link_id": "t3_v41g3j", "parent_id": "t1_ib23avp", "score": "5", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "monstersandlanguages", "body": "Here's the full context of that sentence if you're interested: https://kruschel-kinder.de/nachrichten/Viele_haben_dasselbe_Problem_25548039.htm.\n\n\nObviously I'm just an A2, but what I got out of it is some US credit card software stopped working in places and so you've got to take cash out of the bank until the situation is resolved.", "created_utc": "1654285090.0", "edited": "False", "id": "ib2mopv", "is_submitter": "True", "link_id": "t3_v45v0b", "parent_id": "t1_ib2jayb", "score": "2", "subreddit": "German", "subreddit_id": "t5_2qq51"}, {"author": "monstersandlanguages", "body": "That's super cool. The way German shortens, morphs, and combines words is confounding, but also very interesting. No wonder this language is so difficult to learn. ;)", "created_utc": "1654284929.0", "edited": "False", "id": "ib2mci2", "is_submitter": "True", "link_id": "t3_v45v0b", "parent_id": "t1_ib2llq4", "score": "3", "subreddit": "German", "subreddit_id": "t5_2qq51"}, {"author": "monstersandlanguages", "body": "In the circles I run in (art/adoptables-related), we call that hoarding and foddering. You're not interested in having the art. You're interested in the dopamine you get buying it, so you resell to get more funds for the next rush or, if you want to make people hate you, you require full/partial resale + some other valuable thing.\n\n\nNever thought of it in terms of like an eating disorder. It does feel similar sometimes now that you mention it.", "created_utc": "1654282325.0", "edited": "False", "id": "ib2gujq", "is_submitter": "False", "link_id": "t3_v45ljr", "parent_id": "t3_v45ljr", "score": "21", "subreddit": "shoppingaddiction", "subreddit_id": "t5_33bb0"}, {"author": "monstersandlanguages", "body": "Ohhhhhh, I thought it was *dran* like *Ich bin dran*. Adverbs are not my strong point. Thank you for clearing that up!", "created_utc": "1654282147.0", "edited": "False", "id": "ib2ggsk", "is_submitter": "True", "link_id": "t3_v45v0b", "parent_id": "t1_ib2f97a", "score": "4", "subreddit": "German", "subreddit_id": "t5_2qq51"}, {"author": "monstersandlanguages", "body": "Seedlang is actually super duper close to my \"perfect\" app (but I also use apps as a supplement, not as my primary method of learning).\n\n1. Each \"deck\" starts with a small grammatical review relevant to the upcoming lesson.\n2. Short videos spoken by native speakers about a certain topic. They're entertaining and often funny, so keep you engaged.\n3. Has voice exercises: you speak the sentence back to the app and you get graded. Not perfect, but better than nothing.\n4. No pushy gamification. No hearts, no league notifications, no pressure to build up XP, etc. \n5. Provides a few extra goodies if you subscribe to the Patreon.\n\n\nI use Seedlang with Clozemaster, which has been super useful for seeing lots of different words in lots of different grammatical structures. I use Seedlang one day, Clozemaster the next. 30 - 60 minutes. Reading, active listening, and vocab exercises take up the other 60 - 90 minutes of daily study.\n\n\nBoth apps have been a great supplement to Easy German/Wansee/Hellscythe/Schaui/etc and Kruschel. I've been learning Konjunctiv I and II without even realizing it, for example.", "created_utc": "1654235329.0", "edited": "False", "id": "ib08ovv", "is_submitter": "False", "link_id": "t3_v3oyxw", "parent_id": "t3_v3oyxw", "score": "5", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "monstersandlanguages", "body": "Ugh, it's so painful, especially when you've been reading fairly smoothly up until that point.", "created_utc": "1654189733.0", "edited": "False", "id": "iaxlfgm", "is_submitter": "False", "link_id": "t3_v2wugd", "parent_id": "t1_iaxi3ck", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "monstersandlanguages", "body": "It's 100% possible that's your mental block. So now you have to start trying stuff. Set a timer for fifteen minutes. For fifteen minutes, no matter how itchy that shopping finger gets, try that new thing. Do this a couple times a day to help get your brain out of your rut.\n\n\nIt also helps to try different things you might not have considered otherwise. For example, I never would have considered language learning until, out of desperation, I tried it. So if you want to try origami, or run a marathon--go for it! Sampling is what life's all about. :)", "created_utc": "1654178481.0", "edited": "False", "id": "iawvjk5", "is_submitter": "False", "link_id": "t3_v2ppx5", "parent_id": "t1_iawakpl", "score": "3", "subreddit": "shoppingaddiction", "subreddit_id": "t5_33bb0"}, {"author": "monstersandlanguages", "body": "I try to do both, though I feel like I might have difficulty doing that with the other verb tenses, so I'll write some notes up on them and review them daily. With any luck, they'll start showing up further down this A2 - B1 Easy German playlist.\n\n\nMy method is to read something short, then go through it again, looking up every word I didn't understand. If it's a verb, then I conjugate it in present, Präteritum, Perfekt, and Futur I. Irregular verbs were hell at first with Präteritum and Perfekt, but now I can \"feel out\" a lot of them. No idea about the rules (which I never found helpful anyway), just the feel of the word.", "created_utc": "1654178276.0", "edited": "False", "id": "iawv40x", "is_submitter": "True", "link_id": "t3_v30gdf", "parent_id": "t1_iawryed", "score": "1", "subreddit": "German", "subreddit_id": "t5_2qq51"}, {"author": "monstersandlanguages", "body": "Ohhhh, I see. Being able to use mood sounds pretty fun. Something for an A2 to look forward to using. :)", "created_utc": "1654146511.0", "edited": "False", "id": "iavmznf", "is_submitter": "True", "link_id": "t3_v30gdf", "parent_id": "t1_iavmo7k", "score": "1", "subreddit": "German", "subreddit_id": "t5_2qq51"}, {"author": "monstersandlanguages", "body": "Isn't there Plusquamperfekt, Futur II, Subjuntiv I, and Subjunctiv II? Or are you saying I only need one more for reading and writing? If that's true, that's *awesome*. All this studying is paying off in bits and pieces.", "created_utc": "1654146193.0", "edited": "False", "id": "iavmit7", "is_submitter": "True", "link_id": "t3_v30gdf", "parent_id": "t1_iavm76d", "score": "2", "subreddit": "German", "subreddit_id": "t5_2qq51"}, {"author": "monstersandlanguages", "body": "Ah yes, the part of this addiction where it transforms you into a zombie that's just looking for the next deal. :( \n\n\nAre you sure you want *something*? Is it possible you want something *to do*? As in, something that feels fulfilling and productive to you? For example, I've been learning German. I had to take a two-week break for reasons beyond my control and had a major relapse because I just felt SO useless.\n\n\nWishing you the best. This is a tough addiction to fight.", "created_utc": "1654145997.0", "edited": "False", "id": "iavm7nz", "is_submitter": "False", "link_id": "t3_v2ppx5", "parent_id": "t3_v2ppx5", "score": "15", "subreddit": "shoppingaddiction", "subreddit_id": "t5_33bb0"}, {"author": "monstersandlanguages", "body": "Sorry I wasn't clear.\n\nSimple (Past) = Präteritum \n\n(Present) Perfect = Perfekt\n\n\nI'll start with Plusquamperfekt for sure! It looks fun. :) Thanks!", "created_utc": "1654144831.0", "edited": "False", "id": "iavkgdx", "is_submitter": "True", "link_id": "t3_v30gdf", "parent_id": "t1_iavjr7k", "score": "2", "subreddit": "German", "subreddit_id": "t5_2qq51"}, {"author": "monstersandlanguages", "body": "Me: *reading Kruschel*\n\n\"Wow, I'm really beginning to understand German!\"\n\n*two sentences later*\n\n\"Never mind.\"", "created_utc": "1654139925.0", "edited": "False", "id": "iavc6ml", "is_submitter": "False", "link_id": "t3_v2wugd", "parent_id": "t3_v2wugd", "score": "40", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "monstersandlanguages", "body": "Omgosh, I had no idea. Tbh, this kind of thing is one of the reasons German is so charming. Frustrating at hell, though!", "created_utc": "1653087800.0", "edited": "False", "id": "i9dz0bb", "is_submitter": "True", "link_id": "t3_uu42ja", "parent_id": "t1_i9dduel", "score": "3", "subreddit": "German", "subreddit_id": "t5_2qq51"}, {"author": "monstersandlanguages", "body": "Yep. I now get the concept of inserting the a 'zu' or whatever between a verb and its prefix. Now it's interpreting exactly what the word means.", "created_utc": "1653087736.0", "edited": "False", "id": "i9dyvq4", "is_submitter": "True", "link_id": "t3_uu42ja", "parent_id": "t1_i9dh6ac", "score": "2", "subreddit": "German", "subreddit_id": "t5_2qq51"}, {"author": "monstersandlanguages", "body": "Absolutely fascinating and maddening. That's gonna take some time to be able to read smoothly, but I get what you're talking about. Here's an example I saw, btw:\n\n*Die PreisträgerInnen verpflichten sich bei der Abschluss-Matinée aufzutreten.*\n\n\nWhich makes much more sense now.\n\n\nThanks!", "created_utc": "1653072430.0", "edited": "False", "id": "i9d1xp8", "is_submitter": "True", "link_id": "t3_uu42ja", "parent_id": "t1_i9cz88t", "score": "5", "subreddit": "German", "subreddit_id": "t5_2qq51"}, {"author": "monstersandlanguages", "body": "I get them almost daily! :) But in order to not burn myself out, I limit my studies to 2hrs max. By the end, I'm still gunning to learn more, which carries over into the next day.\n\n\nI also force a \"no-German Fridays\" for another break and usually notice a very small improvement somewhere the next day (ex: in remembering the gender of certain words). By the end of the day, I'm practically itching to at least open up Anki! But noooope. You rest, silly brain.", "created_utc": "1652546144.0", "edited": "False", "id": "i8lci4a", "is_submitter": "False", "link_id": "t3_upfidn", "parent_id": "t3_upfidn", "score": "6", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "monstersandlanguages", "body": "Now I crave junk food AND healthy food. 😂", "created_utc": "1652400481.0", "edited": "False", "id": "i8dz8bf", "is_submitter": "False", "link_id": "t3_uo6i3s", "parent_id": "t1_i8ckrpb", "score": "8", "subreddit": "loseit", "subreddit_id": "t5_2rz8w"}, {"author": "monstersandlanguages", "body": "I always take the long way around outside of them after quickly finding out that going through them = death, lol.", "created_utc": "1652399950.0", "edited": "False", "id": "i8dy3mc", "is_submitter": "False", "link_id": "t3_uo0sbs", "parent_id": "t1_i8bbvub", "score": "1", "subreddit": "monsterhunterrage", "subreddit_id": "t5_3a2f0"}, {"author": "monstersandlanguages", "body": "The archaic definition of *sensible* is along the lines of, \"perceived\", \"appreciable\" which could, at a stretch, be termed *sensitive*. No idea if English got its version of *sensible* from German, though. Or, should I said, got its sensibilities? ;)", "created_utc": "1652393066.0", "edited": "False", "id": "i8divoj", "is_submitter": "True", "link_id": "t3_uobe4c", "parent_id": "t1_i8dczal", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "monstersandlanguages", "body": "That's a wonderful literal translation. :) Chinese gets super creative with them.", "created_utc": "1652392933.0", "edited": "False", "id": "i8dikn5", "is_submitter": "True", "link_id": "t3_uobe4c", "parent_id": "t1_i8dcusa", "score": "4", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "monstersandlanguages", "body": "Lol, unless you like collecting pixels, you wouldn't be into it anyway. But don't worry, I'm not telling anyone about anything I might be interested in buying. 😂 Would kind of defeat the purpose of the sub!\n\n\nAnd thank you so much.", "created_utc": "1652389479.0", "edited": "1652399887.0", "id": "i8da9e0", "is_submitter": "True", "link_id": "t3_unr77s", "parent_id": "t1_i8cn9se", "score": "2", "subreddit": "shoppingaddiction", "subreddit_id": "t5_33bb0"}, {"author": "monstersandlanguages", "body": "Waking up *knowing* that money was still safely in a savings account was a real morning boost. <3", "created_utc": "1652389415.0", "edited": "False", "id": "i8da3ss", "is_submitter": "True", "link_id": "t3_unr77s", "parent_id": "t1_i8ci2ew", "score": "4", "subreddit": "shoppingaddiction", "subreddit_id": "t5_33bb0"}, {"author": "monstersandlanguages", "body": "It's valuable because yes, lots of other people want it, and they'll trade a mint for it. But I'm trying to get out of that scene, so no buying in this neighborhood! :)", "created_utc": "1652389378.0", "edited": "False", "id": "i8da0p9", "is_submitter": "True", "link_id": "t3_unr77s", "parent_id": "t1_i8b06or", "score": "2", "subreddit": "shoppingaddiction", "subreddit_id": "t5_33bb0"}, {"author": "monstersandlanguages", "body": "Yup, this is the part of German that keeps throwing me out the window. I love you German, but please stop throwing me out of my office window. Glass is expensive and the rocks hurt.", "created_utc": "1652219776.0", "edited": "False", "id": "i83u554", "is_submitter": "False", "link_id": "t3_umk6yw", "parent_id": "t1_i828z2s", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "monstersandlanguages", "body": "Flag + estimated level, which is the level I *think* I should be at minus double that. Which is why I'm a -A2.\n\n\nIch werde nie Deutsch lernen. 😭 But it's fun, so I persist.", "created_utc": "1652105102.0", "edited": "False", "id": "i7x5mci", "is_submitter": "False", "link_id": "t3_ulp0dp", "parent_id": "t3_ulp0dp", "score": "8", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "monstersandlanguages", "body": "It seems like it can help the most IF it's material you've already interacted with: https://www.scientificamerican.com/article/learn-a-new-lingo-while-doing-something-else/ (Old article but intriguing nonetheless!)\n\n\n> There's something about our brains that makes it possible to take advantage of the things you've already paid attention to and to keep paying attention to them\n\n\nIn other words, do your studies, then put some of them on in the background if you need to fill the air with some noise. It's not gonna make you fluent on its own, but shoot. Take any little bit of advantage you can.\n\n\nOtherwise, if you're only partially paying attention to *novel* input, everyone says you're not gonna learn much. You have to get pretty high up in skill before \"just listening\" will help you any. Passive listening, for me, has improved my sense of pronunciation and how German flows. Helpful, but not without a loooooot of other stuff to go with it.\n\n\nIf you let novel input become background noise, then it doesn't do much good other than keep you company. That has value as well, just not for learning a language. ;)", "created_utc": "1652049340.0", "edited": "False", "id": "i7unwok", "is_submitter": "False", "link_id": "t3_ul4ize", "parent_id": "t3_ul4ize", "score": "6", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "monstersandlanguages", "body": "That's a feeling a lot of us can relate to. :( Sorry you've found yourself in this mess.\n\n\nAcknowledging your problem by tracking your spending is the first step. A lot of people never get here, so that's one big hurdle you've cleared!\n\n\nA good next step would be to evaluate *why* you want to spend. Keep relentlessly digging into your reasons. It usually comes down to some emotional thing you're trying to cover up, but stuff like OCD or even ADHD can be the issue, too.\n\n\nWhen you figure out the *why*, you can figure out the *how*. For example, if you're bored with your life, shopping fills that void. So you look for other things to fill it. Nature walks, learning to draw, picking up a new language, etc are all good alternatives to spending. (Just be careful not to fall into a hobby-related spending pit!)", "created_utc": "1651981907.0", "edited": "False", "id": "i7rbbvw", "is_submitter": "False", "link_id": "t3_ukq9uj", "parent_id": "t3_ukq9uj", "score": "25", "subreddit": "shoppingaddiction", "subreddit_id": "t5_33bb0"}, {"author": "monstersandlanguages", "body": "That was quite fun. :) I was afraid I was screwing up my English with so much focus on German, but so far it looks okay! (Well, as okay as you can guess from a generalized internet test.)", "created_utc": "1651959328.0", "edited": "False", "id": "i7q3isx", "is_submitter": "False", "link_id": "t3_ukhlni", "parent_id": "t1_i7peh0s", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "monstersandlanguages", "body": "This would be a fun project for advanced learners (starting with a strong B1, maybe). The advanced learner gets to delve into a topic, which helps improve their language skills while helping other people. If the incoming learners do the same, it becomes the embodiment of \"pass it on\".\n\n\nYou could create materials for every-day life things, or if you have a specific hobby, you could talk about that. Ex: enjoy Monster Hunter and speak, I dunno, excellent Swahili? Maybe write up some stuff in simple Swahili about the different weapons. :)\n\n\nThe challenge would be to get a native or at least a C1 to look the material over. Perhaps an iTalki tutor would be willing to do that for their normal hourly fee (or perhaps a little more, depending)?\n\n\nThe Easy Languages series has sort of done this. For example, there's an Easy German video that walks you through a kitchen, naming many objects, and describing some basic tasks one might perform in a kitchen.", "created_utc": "1651847357.0", "edited": "False", "id": "i7k44sa", "is_submitter": "False", "link_id": "t3_ujlx47", "parent_id": "t1_i7jo9y8", "score": "9", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "monstersandlanguages", "body": "At some point, you hit an asymptote with daily study. For example, two hours of a *mix* of immersion types (mainly watching Easy German and reading Kruschel rn) and I'm done. Can't absorb anymore.\n\n\nIt seems that a language, like any other skill, comes at its own pace. Certain techniques and putting in enough time will speed it up somewhat, but you can't force it to go any faster than that. Further, there are plateaus that can take forever to break through. Or, as with other skills, you can have a sudden, sharp dip in ability for a couple weeks, then keep climbing.\n\n\nI guess what I'm saying is this process isn't linear, has a ceiling to how fast it can go (but no floor to how slow it can go, of course *sigh*), and can be frustrating as hell. Which is why everyone always says you've gotta have a reason to learn and derive some enjoyment from it. Otherwise you're just banging your head against a wall.", "created_utc": "1651687277.0", "edited": "False", "id": "i7bk143", "is_submitter": "False", "link_id": "t3_ui2wwh", "parent_id": "t1_i7b44j7", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "monstersandlanguages", "body": "I actually keep track of this.\n\n\nBack in March, an average of 35ish words per half hour session of reading. All the way back to January it's closer to 50, but I was reading material *way* too high for my level. In April, 30ish.\n\n\nIt's gotten easier because, the more vocabulary I learn and the more I get acquainted with grammatical structures, the more I can figure out other words from context. I'm hoping by end-of-year to average 5 - 10 per half hour. By next summer, <5 per half hour.\n\n\nSometimes I don't feel like I'm learning anything, either, and then I'll read a sentence that's completely comprehensible and not the rhymey-dimey stuff you see in A1 and early A2. Learning a language is just slow as shit for a lot of people. Nothing wrong with that other than it sucks to keep spinning your wheels 'til you get out of the mud.", "created_utc": "1651680534.0", "edited": "False", "id": "i7b2tnm", "is_submitter": "False", "link_id": "t3_ui2wwh", "parent_id": "t3_ui2wwh", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "monstersandlanguages", "body": "The crowned Apex quest isn't *too* bad to solo. If you're having that much bad luck with randos, might be best to do it yourself. That quest almost seems designed to make you cart twice, though.  It leaves very little room for sloppy play but at least it's pretty fun. Except for Zinogre. Cool reskin, he just moves like he's on bath salts and hits like a bullet train.", "created_utc": "1651614559.0", "edited": "False", "id": "i77pujd", "is_submitter": "False", "link_id": "t3_uhlcss", "parent_id": "t3_uhlcss", "score": "3", "subreddit": "monsterhunterrage", "subreddit_id": "t5_3a2f0"}, {"author": "monstersandlanguages", "body": "Consider starting with Easy German on Youtube and Seedlang (and app) and go from there. Easy German has quite a few videos for people at various levels. Seedlang and Easy German are a team, basically, so Seedlang has native audio and funny videos to help concepts stick!\n\n\nDo you like to read? Start with something like kruschel-kinder.de. It's news for kids, but not so simplistic that it's dull. The articles are just the right length for A0 - A2, imo, but if you play catch up and end up further along than that, you might enjoy Kurier more.\n\n\nNetflix and Amazon Prime have plenty of shows dubbed into German for you to watch. If you like the news, Heute has the clearest speakers, imo. Many video games have German as a localization option.\n\n\nYou could also book some lessons on iTalki if having someone to talk to and help teach you is motivating for you.", "created_utc": "1651586565.0", "edited": "False", "id": "i75suct", "is_submitter": "False", "link_id": "t3_uheh7u", "parent_id": "t3_uheh7u", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "monstersandlanguages", "body": "I've wondered about Tatoeba, too. I imagine it's fairly reliable for languages like English, Spanish, German, French, maybe Portuguese, but you start moving east from there and you have to be careful.\n\n\nI've heard, in particular, when it comes to languages like Japanese, Chinese, and Thai, that translations can be dicey. The translation is either wildly wrong or is \"technically\" correct, but isn't what the user of that sentence would mean. And/or it uses incorrect characters. Or it would sound rude/overly-familiar to a native speaker.\n\n\nThis is probably one of those instances where paying for something like Pimsleur, an in-person class, or at least a few iTalki sessions is absolutely worth it for at least the first few months.", "created_utc": "1651275497.0", "edited": "False", "id": "i6q984l", "is_submitter": "False", "link_id": "t3_ueqlqb", "parent_id": "t1_i6pleqf", "score": "6", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "monstersandlanguages", "body": "(ETA: Sorry this is so long. It's kinda tough to condense it to just a few lines.)\n\nOh, hi! Similar situation here, except I've added a listening component. Talking with people in your native language can be nerve-wracking as it is, right? :) No sense in missing out on what a foreign language has to offer as long as you're realistic about what you can do given the choices you've made.\n\n\nThe process honestly seems to be the same as learning a language as if you were going to speak it, you just...leave out any speaking exercises.\n\n\nMost people will say you should build some listening skills so you read and write materials in the \"correct\" accent. You'd think it wouldn't matter but it does. It helps *immensely* with spelling and reading. Start with simple stuff aimed at beginners and go from there.\n\n\nPick up an Anki deck (or some other SRS-based flashcard app) so you can start building vocabulary. There are a huge number of apps ranging from free to are-you-kidding-me you can use to help you along.\n\n\nRead. A lot. Most people start with graded readers, but anything made for your level is just fine. I started with graded readers until I hit late A1, then started reading stuff like Tagesschau and Kurier because it was either that or quit from boredom (graded readers can be very dry in the first couple levels). Those sites are too tough for my level, but the hours are adding up and making all the difference.\n\n\nDepending on your language, there are some write streak subs, like WriteStreakGerman for German. Those subs are lower pressure since you can take as long as you want to compose a message. You write something and someone might come by to grade your work (occasionally I've noticed stuff slipping through the cracks.) As you get better at writing, you can join Discords or other chat rooms and chat with people in real time. \n\n\nI have a feeling people like us need to lean on vocabulary and grammar harder than people who prefer to mainly speak and listen. But I have no proof. Something to consider on your journey, though.", "created_utc": "1651269455.0", "edited": "False", "id": "i6pwf4w", "is_submitter": "False", "link_id": "t3_uer5pa", "parent_id": "t3_uer5pa", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "monstersandlanguages", "body": "Japanese.\n\n\nI went back to it for awhile during my break from German and found, with my new understanding about how to actually learn a language...I don't like Japanese.\n\n\nThe thought of learning hundreds or even thousands of pictographs to read a book *sucks*. (Hiragana and katakana were fine, it's the kanji that's the issue.) I don't like the sound of the language, and from personal experience, I don't gel with the more conservative aspects of the culture. Hell, I'm not even that enamored with a lot of the media such as manga.\n\n\nPeople who do manage to learn Japanese are still cool as hell. Picking up all those kanji (which also have a stroke order)? Mastering keigo? Grappling with the cultural differences? Takes a lot.", "created_utc": "1651251939.0", "edited": "1651286374.0", "id": "i6ortqi", "is_submitter": "False", "link_id": "t3_uemsn1", "parent_id": "t3_uemsn1", "score": "5", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "monstersandlanguages", "body": "That is normal. If you study every day, you'll make improvements.", "created_utc": "1651069985.0", "edited": "False", "id": "i6ele9q", "is_submitter": "False", "link_id": "t3_ud3anx", "parent_id": "t1_i6ekq37", "score": "5", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "monstersandlanguages", "body": "Your English grammar is still very German. :) (That's OK--my German grammar is still very English! ;))\n\n\nYou need to read a lot more. I suggest https://newsforkids.net/ or https://www.sciencejournalforkids.org/ because these websites use simpler English that still sounds natural. You can Google any topic with \"for kids\" and probably find a good site. \n\n\nIf those websites are a little too difficult, look for \"graded readers\". Pearson English Graded Readers are very good. Start at Level 1 and Level 2.", "created_utc": "1651069588.0", "edited": "False", "id": "i6ekf87", "is_submitter": "False", "link_id": "t3_ud3anx", "parent_id": "t3_ud3anx", "score": "17", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "monstersandlanguages", "body": "I'm only on my second language, but so far I love to hear about a different culture's views on things in their own language. Things get lost in translation!\n\n\nOh, and there's so much great native content in German. You could spend 24/7/365 and get through maybe a tenth of it before you got old and gray.\n\n\nGetting acclimated to the sounds, too. Honestly, German overall excites me. (Levels A0 through A1 sucked sooooo bad, though.)", "created_utc": "1651030997.0", "edited": "False", "id": "i6cwwbo", "is_submitter": "False", "link_id": "t3_ucs3f4", "parent_id": "t3_ucs3f4", "score": "8", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "monstersandlanguages", "body": "> Max size Valstrax\n\n\n> Valstrax wing stab attack\n\n\n> Someone in Kamura gets knocked on their ass", "created_utc": "1650897823.0", "edited": "False", "id": "i64wd4k", "is_submitter": "False", "link_id": "t3_ubi608", "parent_id": "t1_i64dvj7", "score": "17", "subreddit": "monsterhunterrage", "subreddit_id": "t5_3a2f0"}, {"author": "monstersandlanguages", "body": "Hm, really? I used the web version. I should see if I can get the desktop version. That would be more convenient during study time. Thanks for the heads up!\n\n\nThe article does provide context. It's about how feeding dogs vegetarian or vegan diets is possibly healthier than a carnivorous or omnivorous diet. So it kind of talks about dogs as a whole.", "created_utc": "1650895946.0", "edited": "False", "id": "i64rsdv", "is_submitter": "False", "link_id": "t3_ubcz1v", "parent_id": "t1_i64f7sk", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "monstersandlanguages", "body": "I've noticed! I only use GT as a spot-checker (ie: if I translate a sentence and GT is wildly different from my translation, I start looking at vocab, grammar, etc more closely). DeepL seems much better. Here's a sentence in German GT had trouble with:\n\n\n*Kann man dem als Fleisch- oder Allesfresser geltenden Hund zumuten, sich vegetarisch oder gar vegan zu ernähren?*\n\n\n**My translation**: Can you expect a dog, which is an omnivore or carnivore, to eat vegetarian or vegan?\n\n\n**GT**: Can you expect dogs that are considered meat or omnivores to eat vegetarian or even vegan?\n\n\n**DeepL**: Can the dog, which is considered a carnivore or omnivore, be expected to eat a vegetarian or even vegan diet?\n\n\nThe only downside of DeepL to me is it requires a subscription, which isn't useful to me at this point of my journey. *Maybe* in the distant future. I could see it being useful as a spot check for a B2 or a strong B1 and up.", "created_utc": "1650864718.0", "edited": "False", "id": "i63gz31", "is_submitter": "False", "link_id": "t3_ubcz1v", "parent_id": "t3_ubcz1v", "score": "5", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "monstersandlanguages", "body": "Nargacuga in MH Rise is terrible like this, too.\n\n\nBest place to see for yourself is the Ruins. Get up on a ledge in the same area Nargacuga is in. I like to use the one in front of the gate. Narga will do some tail spins and knock you on your ass.\n\n\nI also had an incident where he hit me with a tail slam while I was behind the fence near the water areas in the Ruins. Tail didn't even get near me. Haven't been able to repro that one, so it might have just been a glitch.\n\n\nIt's so bizarre that the newer MH games are hit-or-miss (pun intended) with the hitboxes. Some are pretty damn good. Others? Uhhhhhh........", "created_utc": "1650781495.0", "edited": "False", "id": "i5yznau", "is_submitter": "False", "link_id": "t3_uaczu4", "parent_id": "t3_uaczu4", "score": "2", "subreddit": "monsterhunterrage", "subreddit_id": "t5_3a2f0"}, {"author": "monstersandlanguages", "body": "Molten Tigrex from MHST2 brought me here.\n\n\nIn Rise? Volvidon. I'd rather do the emergency Apex Zinogre quest over and over than fight this red roll of dog shit.\n\n\nIf the MH world was real, I would hunt Volvidon to extinction. What, that hurts the environment? This is bad for Kamura? Then the fucker shouldn't have boing-boing-farted so much.", "created_utc": "1650729599.0", "edited": "False", "id": "i5w2q4q", "is_submitter": "False", "link_id": "t3_ua5uce", "parent_id": "t3_ua5uce", "score": "11", "subreddit": "monsterhunterrage", "subreddit_id": "t5_3a2f0"}, {"author": "monstersandlanguages", "body": "What finally got through to me was realizing that I was having FOMO on everything and was using it as justification to spend. \"What if I need it?\" (\"Do I *really* need it? Do I have something that does The Thing and I need to learn to enjoy what I already have? Do I need to spend more time thinking about what my aesthetics are so I don't keep buying stuff I don't like? Is there anyone I can borrow The Thing from so I can get a feel if it's for me or not?\") \n\n\n\"What if I can use it to trade up for something better?\" (Is buying in *hopes* of a trade healthy for me? Is this triggering my obsessive nature?)\n\n\n\"What if I don't see something this nice again?\" (\"But...I've asked myself this a million times. There's *always* going to be something nice.\")\n\n\nThe only thing that's working for me is an extended no-buy on my problem products. I did slip up and spend $50, but for nineteen days and a severe urge to shop...not too bad. During this time, I'm learning to direct my attention to other activities while being careful not to activate the OCD/ADHD portion of my brain too much. The trick seems to be to have a handful of productive activities that require little or no money. \n\n\nEx: learning a language can easily be done for free or for a nominal price if you can avoid buying ALL THE SUBSCRIPTIONS.\n\n\nIt's such a freakin' trap. It's like your brain doesn't even care about the thing, or FOMO, or anything else. It wants its next hit and will lie, cajole, plead, and cry for that sweet, sweet dopamine. So you gotta find somewhere else to get the dopamine without finding another money sink or getting on drugs or something.", "created_utc": "1650693266.0", "edited": "False", "id": "i5uikfh", "is_submitter": "False", "link_id": "t3_u9xqfm", "parent_id": "t3_u9xqfm", "score": "26", "subreddit": "shoppingaddiction", "subreddit_id": "t5_33bb0"}, {"author": "monstersandlanguages", "body": "Wow, taking the \"osmose language knowledge while you sleep\" grift one step further.", "created_utc": "1650657258.0", "edited": "False", "id": "i5shns0", "is_submitter": "True", "link_id": "t3_u9kmgw", "parent_id": "t1_i5sh1av", "score": "10", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "monstersandlanguages", "body": "I'd put Arabic, Japanese, and Chinese at the forefront in terms of difficulty, but English isn't exactly a cakewalk! \n\n\nMost languages have some sort of \"gotcha\" or another that ups the difficulty (which is also what's fun about learning them). If the language you want to learn is closely related to the language you currently know, then it's easier (I think this is true of a lot of northern European languages but don't quote me on that one).", "created_utc": "1650657101.0", "edited": "False", "id": "i5sh9er", "is_submitter": "False", "link_id": "t3_u9jeqs", "parent_id": "t1_i5s4oen", "score": "10", "subreddit": "quityourbullshit", "subreddit_id": "t5_2y8xf"}, {"author": "monstersandlanguages", "body": "The last part made me laugh. Glad you found a passion that helped you so much, though!", "created_utc": "1650656452.0", "edited": "False", "id": "i5sfnid", "is_submitter": "True", "link_id": "t3_u9kmgw", "parent_id": "t1_i5sfbt2", "score": "45", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "monstersandlanguages", "body": "I bet if you'd kept that up with other study methods, it would have eventually helped. It'd feel like 10 million hours, but it'd help.", "created_utc": "1650652598.0", "edited": "False", "id": "i5s66fm", "is_submitter": "True", "link_id": "t3_u9kmgw", "parent_id": "t1_i5s30eg", "score": "12", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "monstersandlanguages", "body": "This could legit be part of a language learning program for those who love to cook. :) And with the rise of the internet, there's plenty of places to get recipes in a variety of languages.\n\n\nLive on the edge: cook in a language you don't 100% know. >:)", "created_utc": "1650652549.0", "edited": "False", "id": "i5s623n", "is_submitter": "True", "link_id": "t3_u9kmgw", "parent_id": "t1_i5s56cq", "score": "52", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "monstersandlanguages", "body": "Oh no, lol! Bet you had plenty of facepalm moments when you relearned it.", "created_utc": "1650652452.0", "edited": "False", "id": "i5s5tf9", "is_submitter": "True", "link_id": "t3_u9kmgw", "parent_id": "t1_i5s5kcl", "score": "22", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "monstersandlanguages", "body": "German's dative case is simple in concept, but application, hoooo, is there a lot.", "created_utc": "1650649904.0", "edited": "False", "id": "i5rzdts", "is_submitter": "False", "link_id": "t3_u9ghwd", "parent_id": "t3_u9ghwd", "score": "11", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "monstersandlanguages", "body": "Similar problem, different products. :s What's been helping so far is acknowledging when I feel the urge to shop, trying to figure out why (boredom, stressed, etc), and then consciously choosing another activity that's more productive. Ex: a quick 5-minute walk, 10 minutes of German study, a 30-minute nap, etc.\n\n\nSome days the impulse is super hard to resist. Your brain has kinda been trained to do this shopping thing, almost like pulling the lever on a slot machine. So you have to train your brain that there are *other* things you can do. It's tough out there.", "created_utc": "1650637587.0", "edited": "False", "id": "i5r3uqf", "is_submitter": "False", "link_id": "t3_u96b1n", "parent_id": "t3_u96b1n", "score": "7", "subreddit": "shoppingaddiction", "subreddit_id": "t5_33bb0"}, {"author": "monstersandlanguages", "body": "Same, haha. The looks some people will give you for it, too.\n\n\nI also pronounce \"English\" with a soft E now. In some parts of the US, people do that, so no biggie. Had to stop myself from saying \"ah\"nxious/\"ah\"ngst. That'd garner some weird looks.", "created_utc": "1650635380.0", "edited": "False", "id": "i5qyngn", "is_submitter": "False", "link_id": "t3_u8waxd", "parent_id": "t1_i5oalz9", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "monstersandlanguages", "body": "Had no idea *der* could get that kinda mileage in a sentence. Neat! Thanks for responding. :)", "created_utc": "1650635114.0", "edited": "False", "id": "i5qy1js", "is_submitter": "True", "link_id": "t3_u946pw", "parent_id": "t1_i5pqik6", "score": "2", "subreddit": "German", "subreddit_id": "t5_2qq51"}, {"author": "monstersandlanguages", "body": "Gotcha, thanks! Oddly enough, I haven't run into \"indefinite\" pronouns a lot during my studies yet, so this was pretty new to me.", "created_utc": "1650635066.0", "edited": "False", "id": "i5qxxjv", "is_submitter": "True", "link_id": "t3_u946pw", "parent_id": "t1_i5pvybo", "score": "1", "subreddit": "German", "subreddit_id": "t5_2qq51"}, {"author": "monstersandlanguages", "body": "Ohhhhhh, okay, yeah, that makes sense! Thanks for clearing that up. :) German is really fascinating.", "created_utc": "1650634996.0", "edited": "False", "id": "i5qxrtz", "is_submitter": "True", "link_id": "t3_u946pw", "parent_id": "t1_i5qg2d3", "score": "1", "subreddit": "German", "subreddit_id": "t5_2qq51"}, {"author": "monstersandlanguages", "body": "Ah, that makes sense, thanks! Why *einer* here, though, as opposed to *ein*? Just a sound thing or?", "created_utc": "1650599448.0", "edited": "False", "id": "i5phby8", "is_submitter": "True", "link_id": "t3_u946pw", "parent_id": "t1_i5pddob", "score": "1", "subreddit": "German", "subreddit_id": "t5_2qq51"}, {"author": "monstersandlanguages", "body": "Your best bet is lean proteins like chicken. Eggs and beans are great, too. (Start slowly with beans if you don't eat a lot of them now, lol.)\n\n\nIf you still have problems getting enough protein in, consider a protein shake! Barring an allergy or intolerance to the ingredients, whey/casein-based or pea-based seem to be the best. Toss in some fruit or veg (whatever you like the most) to bulk it out a bit and it's quite filling. You should be able to get 22 - 27g of protein this way. It can be a little expensive, though, depending on the brand and type.", "created_utc": "1650472049.0", "edited": "False", "id": "i5hz8yn", "is_submitter": "False", "link_id": "t3_u7z1bv", "parent_id": "t3_u7z1bv", "score": "1", "subreddit": "loseit", "subreddit_id": "t5_2rz8w"}, {"author": "monstersandlanguages", "body": "Also studying German and also have the same fear.\n\n\nKeep studying with materials good for your level and be consistent (ie: don't be like me--A2 after eight months because of long gaps in between studies). It's definitely a \"have faith\" process because there are stretches where it feels like *nothing* is happening. You want to give up. You feel fatigued. So you take a few days off, come back, and wow, you actually have progressed more than you thought.\n\n\nMaybe you remember some words you never thought you'd remember. Or that audio is more comprehensible. Or you start to get the \"feel\" for certain grammatical constructs. It comes slowly, and in pieces.\n\n\nMaddening, but if you put your mind to it, you can certainly reach your goal. Viel Glück!", "created_utc": "1650470167.0", "edited": "False", "id": "i5hud6u", "is_submitter": "False", "link_id": "t3_u7ylqp", "parent_id": "t3_u7ylqp", "score": "8", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "monstersandlanguages", "body": "Same! It's helped a lot to check in with my body.\n\n\nFeel somewhat full? Stomach not feeling a bit empty or grumbly? \n\n\nOnly sweets (my weakness) sound good versus, say, some baby carrots?\n\n\nYou ain't hungry, brain. Drink some water and do something productive.\n\n\n(\"But. . .but. . . it's just one cookie! It won't hurt to go over your calorie count a little...\" Brain. Buddy, pal. Water, productivity, *now*. Or maybe a nap if it's the weekend. Nap is good, too.)", "created_utc": "1650429102.0", "edited": "False", "id": "i5fxoai", "is_submitter": "False", "link_id": "t3_u7jazl", "parent_id": "t1_i5f9gxt", "score": "24", "subreddit": "loseit", "subreddit_id": "t5_2rz8w"}, {"author": "monstersandlanguages", "body": "Yup, over-ate as well. I'm so mad 'cuz I had 132 on my scale this morning after literal months of nothing budging and I know it's gonna go right back up to where it was. It's just water weight but damn if it doesn't sting. (ETA: 132.8, not as bad as I feared but still, :'))\n\n\nBest thing to do is just pick up where you left off. *sigh* Food is so gosh darn tasty, whether it's salted steamed broccoli or a big ol' slice of ham or a delicious cheesecake cupcake. It's all too good, lol.", "created_utc": "1650257538.0", "edited": "1650291269.0", "id": "i568u6f", "is_submitter": "False", "link_id": "t3_u60k56", "parent_id": "t3_u60k56", "score": "1", "subreddit": "loseit", "subreddit_id": "t5_2rz8w"}, {"author": "monstersandlanguages", "body": "I've been doing this with Monster Hunter! I'm an A2 so not \"extremely basic\", more like \"mostly basic\". I've also tried a couple other games, but Monster Hunter is the one I've stuck with.\n\n\nIn the case of Monster Hunter, every quest has a short (maybe five sentences max) description written in a fun way. There's enough A2-level vocab to keep the game from being incomprehensible, but not so much there's no challenge. If you want more, there's plenty of characters with dialog for you to analyze, not to mention all the monster and item descriptions. Plus, you get to fight a monster after you're done studying. :)\n\n\nJust three weeks of this has produced better reading of simple stuff on places like Tagesschau. Note that this also includes other study activities, though, not just game play. ;) If only, right?\n\n\nThis is kind of a meandering method and the vocab is frequently specific to whatever you're playing. So anyone needing to learn in a hurry won't find much use here. For those of us who are able to stop and smell the roses, playing a fave game in your TL is a lovely experience. Keep at it, OP!", "created_utc": "1650243456.0", "edited": "False", "id": "i55hqhi", "is_submitter": "False", "link_id": "t3_u5u9sn", "parent_id": "t3_u5u9sn", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "monstersandlanguages", "body": "Have you heard this saying? \"Tell someone there's a million stars in the sky and they'll believe you. Tell them the paint on the wall is still wet and they'll have to check.\"\n\n\nAs humans are inveterate language-speakers (as opposed to star-travelers), it almost seems natural that another language would come to you fairly quickly. Until you've *been there*, even if \"there\" is only A1, you may not get it. It seems stupid easy to learn a language at a glance: learn some vocab, some grammar, listen to a few videos, boom. It's not easy, but it *is* difficult for some of us to let that sink in until we get into the thick of it and say, \"okay, yeah, Lemons was right.\"", "created_utc": "1650130250.0", "edited": "False", "id": "i4zbcgn", "is_submitter": "False", "link_id": "t3_u4t6tn", "parent_id": "t1_i4y0pd7", "score": "5", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "monstersandlanguages", "body": "Are you also in need of the Almudron Orb? Stg, that bastard is never gonna drop one.\n\n\nETA: I FINALLY GOT ONE. THE DESIRE SENSOR GOT TIRED OF MY WHINING. WOOOOO.", "created_utc": "1650126573.0", "edited": "1650158020.0", "id": "i4z2pye", "is_submitter": "False", "link_id": "t3_u5069v", "parent_id": "t3_u5069v", "score": "8", "subreddit": "MemeHunter", "subreddit_id": "t5_3pd0d"}, {"author": "monstersandlanguages", "body": "Emergency Apex Zinogre is a tough one for sure (the non-emergency version is easier, though not \"easy\"). Apex Diablos isn't so bad except when he gets you pressed up against a wall and wombo-combos you.\n\n\nAre you talking about the souped-up event Valstrax? That one had me sweating, haha. At least Valstrax fucking just...stops moving once in awhile.", "created_utc": "1649890765.0", "edited": "False", "id": "i4mnvt3", "is_submitter": "False", "link_id": "t3_u2783e", "parent_id": "t1_i4m63z8", "score": "1", "subreddit": "monsterhunterrage", "subreddit_id": "t5_3a2f0"}, {"author": "monstersandlanguages", "body": "Yeah, that's true. Those damn orbs are a pain in the ass to get so any increased chance of Magna dropping one is welcome.", "created_utc": "1649873865.0", "edited": "False", "id": "i4lhxy7", "is_submitter": "False", "link_id": "t3_u2783e", "parent_id": "t1_i4lg4fb", "score": "1", "subreddit": "monsterhunterrage", "subreddit_id": "t5_3a2f0"}, {"author": "monstersandlanguages", "body": "Full Teostra set. No poison/venom to worry about. I slot in a lot of Evade Window and two Evade Extenders, so pretty much just fly out of the way. Decimates your health with just one hit, though. Like damn.\n\n\nThe emergency quest that got me was the fucking Apex Zinogre. Sonofabitch wouldn't stand still. That newer HR Magnamalo quest might as well have been called an emergency quest as well for how hard he hit you.", "created_utc": "1649864902.0", "edited": "False", "id": "i4kud16", "is_submitter": "False", "link_id": "t3_u2783e", "parent_id": "t3_u2783e", "score": "2", "subreddit": "monsterhunterrage", "subreddit_id": "t5_3a2f0"}, {"author": "monstersandlanguages", "body": "That makes a lot of sense. Thanks for your help!", "created_utc": "1649863736.0", "edited": "False", "id": "i4krcl2", "is_submitter": "True", "link_id": "t3_u2h5l4", "parent_id": "t1_i4ivsxk", "score": "1", "subreddit": "German", "subreddit_id": "t5_2qq51"}, {"author": "monstersandlanguages", "body": "Okay, that definitely helps a lot. Thanks!", "created_utc": "1649863646.0", "edited": "False", "id": "i4kr4c8", "is_submitter": "True", "link_id": "t3_u2h5l4", "parent_id": "t1_i4j06ka", "score": "1", "subreddit": "German", "subreddit_id": "t5_2qq51"}, {"author": "monstersandlanguages", "body": "Thank you! 😭💕", "created_utc": "1649733837.0", "edited": "False", "id": "i4dsj86", "is_submitter": "True", "link_id": "t3_u1hra2", "parent_id": "t1_i4dktkv", "score": "4", "subreddit": "shoppingaddiction", "subreddit_id": "t5_33bb0"}, {"author": "monstersandlanguages", "body": "Omg. I didn't even think of withdrawal because shopping addiction's not a drug or something. You're right. 😭 And there's not much to do but wait it out and try to stay sane.\n\n\nI've been pulling out all the stops for different activities. Longer dog walks, language learning, reading, journaling, playing Monster Hunter, art (which has become a trigger so no more of that for now), watching B-horror movies, trying out free stuff on Coursera. I'm just exhausted.", "created_utc": "1649713348.0", "edited": "False", "id": "i4cht5y", "is_submitter": "True", "link_id": "t3_u1hra2", "parent_id": "t1_i4cekdo", "score": "10", "subreddit": "shoppingaddiction", "subreddit_id": "t5_33bb0"}, {"author": "monstersandlanguages", "body": "Capcom did nerf some of the monsters a bit and gave us hunters a huge buff in terms of movement. So, if you're a veteran to the series, well, you're going to have an easier time of it. I was still fairly green when I came to Rise (had some MHGU experience). I barely--just *barely*--beat Allmother Narwa at about 250 hours. It took me forty minutes. 600 hours in and...well, the only hunt that gave me problems in recent memory was Emergency Apex Zinogre. Allmother has become a fart in the wind. Game's still fun, though, 'cause a lot of the monsters are cool.\n\n\nI dunno what to do about veteran hunters. I guess Capcom could put in some adaptive AI, but I don't know how it'd work or if it's even plausible for MH.\n\n\nSome people aren't happy about wirebugging. You don't have to use Wirefall. Take the punishment. Likewise, you don't have to use the Wirebug moves. You also don't need to use Wirebugs in most battles (they're pretty much a requirement for getting around anywhere in the map, ofc).\n\n\nDon't get the Spiribirds (including the Prism Spiribird). Don't drink any potions. Take the strength/defense amulets and claws out of your inventory. Capcom has given us a lot in terms of difficulty sliders and I think the temptation to use them all is hard to resist. Or maybe that's just me. ;)\n\n\nTbh, a \"hardcore\" run sounds kind of fun. No buffs, no amulets/claws, no wirebug anything during battle unless there's literally no other choice. No restocking potions--if they're gone, you either get more materials or suffer without. No Hunting Helpers. You could push it even further, like one cart = quest fail. Time greater than 30 min (or even 20) = quest fail. If you usually main one weapon, main your weakest only.", "created_utc": "1649627205.0", "edited": "False", "id": "i47sjq3", "is_submitter": "False", "link_id": "t3_u0lcr2", "parent_id": "t1_i46phkp", "score": "3", "subreddit": "monsterhunterrage", "subreddit_id": "t5_3a2f0"}, {"author": "monstersandlanguages", "body": "Sometimes I just take a break for a day or two if I'm frustrated. Most of the time, I acknowledge that this listening session was a bad one, so next time let's go for something easier, even if that means stepping back a level for a bit.\n\n\nYou do improve if you're consistent about it. I mean, I started off unable to parse anything by Tagesschau or Heute and now I can at least tell where words/sentences end and begin if nothing else, but that took a lot of time. It just takes time for the brain to decide that yes, this thing you're listening to is meaningful. It is not gibberish. It is connected to this vocabulary here and that grammar knowledge there.\n\n\nTime-boxing your sessions will help a lot. You can tell yourself, *okay, I'm miserable right now, but it's just another couple of minutes. I can last another couple of minutes.*", "created_utc": "1649604288.0", "edited": "False", "id": "i468qp0", "is_submitter": "False", "link_id": "t3_tzud28", "parent_id": "t1_i45r19m", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "monstersandlanguages", "body": "My kingdom to be able to pick up every language I'm interested in.  I'd have nine or ten under my belt! Another kingdom to be able to study more than one language at a time like you. You must have great focus. \n\n\nMost of these languages just kinda...knocked on the door and invited themselves in (especially Hindi, Bengali, and Thai). It's so weird how learning one language kinda just makes you gravitate toward others.", "created_utc": "1649553149.0", "edited": "False", "id": "i43v2am", "is_submitter": "False", "link_id": "t3_u06k11", "parent_id": "t3_u06k11", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "monstersandlanguages", "body": "Only A2 in German here, so take my thoughts with a grain of salt. Sounds like speaking is your forte. Maybe you aren't as great at audio processing as others, which is not all that unusual (I'm in the same boat). Here's what I've been doing. Again, only an A2, so not saying it's a perfected method.\n\n\n*Active listening*: 5 - 10 minute sessions 3 - 5 times daily. More sessions, or longer sessions, or more advanced content if it becomes easy. The idea is to intensely focus on what's being said. If you're a little worn out at the end, you're doing it right. If you're exhausted, though, dial it back.\n\n\n*Semi-passive listening*: This is more of a meditative exercise. It's easy to rack up an hour or two here. The idea is to pick an activity that doesn't require 100% of your attention. Ex: most chores, web-surfing, etc. Play your favorite content (audiobook, let's plays, whatever) and just listen. Don't try to understand or parse what you're hearing. Absorb the sounds, the tempo, where words and sentences start and end, etc. Stuff you recognize pops out a lot during this exercise. Almost like a stab to the eardrums, tbh.\n\n\nDoing both has helped a lot, though I can only understand moderately-paced German like you hear on news stations and some Dokus.", "created_utc": "1649528089.0", "edited": "False", "id": "i42azui", "is_submitter": "False", "link_id": "t3_tzud28", "parent_id": "t3_tzud28", "score": "7", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "monstersandlanguages", "body": "I wanted to learn until my Japanese grandma laughed and said, \"why? You aren't Japanese.\"\n\n\nAmazing how quickly motivation and interest can evaporate. Neat culture, cool art (not just the anime stuff), beautiful countryside. Language? Meh. Also, I'm not sure how I feel about pictographic languages. Stuff like Cyrillic and Devanagari seems to be as far as I'm willing to go.", "created_utc": "1649519152.0", "edited": "False", "id": "i41oszy", "is_submitter": "False", "link_id": "t3_tzi6q7", "parent_id": "t1_i3zlcxf", "score": "6", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "monstersandlanguages", "body": "As someone who loves German: aw :(\n\n\nIn all seriousness, the prevailing wisdom seems to be this: don't learn a language in hopes of attracting/impressing/dating/whatever someone. (It's different when you're in a committed relationship, of course.) I wonder how many of us had to learn that lesson the hard way, lol.", "created_utc": "1649518956.0", "edited": "False", "id": "i41obh6", "is_submitter": "False", "link_id": "t3_tzi6q7", "parent_id": "t1_i40dovm", "score": "8", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "monstersandlanguages", "body": "Somnacanth and Rathian did this to me today during their event quest.\n\n\nSomnacanth put me to sleep, Rathian trampled me, then Somnacanth's stupid aim-botted body slam took a huge chunk of health, and finally Rathian finished me off with another trample.", "created_utc": "1649483669.0", "edited": "False", "id": "i403bch", "is_submitter": "False", "link_id": "t3_tzhjak", "parent_id": "t3_tzhjak", "score": "3", "subreddit": "MemeHunter", "subreddit_id": "t5_3pd0d"}, {"author": "monstersandlanguages", "body": "As someone who just spent 45 minutes trying to wrap my head around the two Konjutivs...this summary has made all the previous reading make total sense. Reddit is truly a magical place of learning. And sometimes horror. But also learning.", "created_utc": "1649483107.0", "edited": "False", "id": "i402i5w", "is_submitter": "False", "link_id": "t3_tzdqlq", "parent_id": "t1_i3yn1ly", "score": "8", "subreddit": "German", "subreddit_id": "t5_2qq51"}, {"author": "monstersandlanguages", "body": "This is a huge problem for me with me and the expensive \"adopts\" I buy from artists (five days so far without a single purchase...that's a record). It's even worse because those adopt designs are one-of-a-kind. There might be designs that are similar, but there will never again be *THAT* design. So I think, what if I'm going to \"need\" this? There's zero logic in that statement because you don't need pixels in the shape of a dog, or cute anime boy, or whatever. Then, once I have it, I'm \"safe\", and the thought of the next purchase comes up.\n\n\nAt worst, I was almost 8K in. 😭 It's awful.", "created_utc": "1649452800.0", "edited": "False", "id": "i3ycql1", "is_submitter": "False", "link_id": "t3_tz9p0q", "parent_id": "t3_tz9p0q", "score": "4", "subreddit": "shoppingaddiction", "subreddit_id": "t5_33bb0"}, {"author": "monstersandlanguages", "body": "Here's a super-interesting article: https://www.ncbi.nlm.nih.gov/pmc/articles/PMC5061757/\n\n\nYou only need to read the short abstract. Basically, excited delirium can raise your body temperature, tank your blood pressure, etc. If you've got unlucky genes, maybe your dopamine transporters don't work right, which, to say the least, doesn't help at all.\n\n\nFascinating and terrifying. I guess if you're going to do stimulant drugs, only do one at a time? And maybe don't do them if you have mental health problems. (I don't know if this guy had any, and I know it's easier said than done to stay off drugs, depending on the problem.)", "created_utc": "1649430007.0", "edited": "False", "id": "i3wpqjk", "is_submitter": "False", "link_id": "t3_tykc21", "parent_id": "t1_i3tg4x1", "score": "13", "subreddit": "NSFL__", "subreddit_id": "t5_3lcigy"}, {"author": "monstersandlanguages", "body": "Gotcha. Thanks for answering! :)", "created_utc": "1649372710.0", "edited": "False", "id": "i3trsus", "is_submitter": "True", "link_id": "t3_tyn9r6", "parent_id": "t1_i3tlkdh", "score": "1", "subreddit": "German", "subreddit_id": "t5_2qq51"}, {"author": "monstersandlanguages", "body": "I'm glad I asked because I absolutely would have started using that phrase as a casual way to say \"you're welcome\". 😂 Thanks for adding more details!", "created_utc": "1649372690.0", "edited": "False", "id": "i3trr7g", "is_submitter": "True", "link_id": "t3_tyn9r6", "parent_id": "t1_i3tftd0", "score": "2", "subreddit": "German", "subreddit_id": "t5_2qq51"}, {"author": "monstersandlanguages", "body": "Interesting, thanks!", "created_utc": "1649372615.0", "edited": "False", "id": "i3trktc", "is_submitter": "True", "link_id": "t3_tyn9r6", "parent_id": "t1_i3teuyb", "score": "1", "subreddit": "German", "subreddit_id": "t5_2qq51"}, {"author": "monstersandlanguages", "body": "That's fantastic! Sounds like you're making amazing progress. You're empathetic, too, thinking about the delivery folks like that. Wishing you continued success! :)", "created_utc": "1649274450.0", "edited": "False", "id": "i3o3cj6", "is_submitter": "False", "link_id": "t3_txd58o", "parent_id": "t3_txd58o", "score": "4", "subreddit": "shoppingaddiction", "subreddit_id": "t5_33bb0"}, {"author": "monstersandlanguages", "body": "Two ways to handle it.\n\n\n1. Wait for the explosion under Narwa to finish. Then you can dodge through the Dragonators under her and get some free hits in. Make sure you get enough damage in during the second phase of that massive attack after the Dragonators disappear. (You'll know it when you see it.) I think the second part is roughly the equivalent of Escaton Judgement without the elemental part (don't hit me if I get this wrong, never played World). You just need the damage output.\n\n\n2. Use a Farcaster. Wait about 15 - 20 seconds, then wirebug back in.", "created_utc": "1649110343.0", "edited": "False", "id": "i3etevk", "is_submitter": "False", "link_id": "t3_twdqbh", "parent_id": "t3_twdqbh", "score": "7", "subreddit": "monsterhunterrage", "subreddit_id": "t5_3a2f0"}, {"author": "monstersandlanguages", "body": "Yeah, most adopts have work put into them. It's always sad, though, when a popular artist just starts selling on-base exclusively and people still lap it up for hundreds. :(\n\n\nThe general rule is, anyone with \"maws\" in the name is probably going to screw up bad at some point. Recently it was Mawbyte being a douche about people not doing marketing for him via retweets.\n\n\nI always double check I'm not getting a closed species adopt after that 20K thing. What boiled my blood is the guy who scammed this other guy of so much money was *silent* and wouldn't work with him at all. Then some Youtuber came out with a video, and that scam artist all of a sudden had \"proof\". Obviously cherry-picked to death and also featuring the CS community being a douche to this mentally-ill dude.\n\n\nYou're not alone. The pretty pixels are super easy to get addicted to. :(", "created_utc": "1649102889.0", "edited": "False", "id": "i3ea6wj", "is_submitter": "True", "link_id": "t3_tuz15f", "parent_id": "t1_i3b6ist", "score": "1", "subreddit": "shoppingaddiction", "subreddit_id": "t5_33bb0"}, {"author": "monstersandlanguages", "body": "I'm leaning toward fail, too, because of what you said about connecting the meaning of the word. \n\n\nMy deck will have a German word on the front with a sentence, in German, below it. If I can't remember the word itself, I can usually get it from context because the sentences are simple.", "created_utc": "1649047927.0", "edited": "False", "id": "i3bdpjv", "is_submitter": "True", "link_id": "t3_tvry0z", "parent_id": "t1_i3bc0g4", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "monstersandlanguages", "body": "I'll see the word in German (that's the language I'm studying) and won't remember it until I see the sentence. Since the sentences are simple, I can get enough context to remember the meaning of the word.", "created_utc": "1649047861.0", "edited": "False", "id": "i3bdlun", "is_submitter": "True", "link_id": "t3_tvry0z", "parent_id": "t1_i3bafzi", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "monstersandlanguages", "body": "Two months? Holy shit, Rathalos has gone extinct! Congrats--those orbs and rubies are brutal to get sometimes. (Still no Almudron Orb here...)", "created_utc": "1649039325.0", "edited": "False", "id": "i3axi5d", "is_submitter": "False", "link_id": "t3_tvperf", "parent_id": "t3_tvperf", "score": "4", "subreddit": "monsterhunterrage", "subreddit_id": "t5_3a2f0"}, {"author": "monstersandlanguages", "body": "A fellow adopts sufferer! God, you are so right that these things are NFT-lite. At least you're putting money in a working artist's pocket and not using enough electricity to run a small apartment complex.\n\n\nI've had adopts from Malaikat, Oncha/Mazamuno, Maws (before Maws was outed as being unprofessional), and ToyServal, as well as from rising stars like Velow. Oh, and SO many Citykings/Ghostshunt designs. Vani, too. Everyone loved me while I had a certain Maza design, lol. One of the reasons why I got rid of it. Didn't like THAT kind of attention. (If you're familiar with the adopts scene, you know what kind of people I'm talking about, lol.)\n\n\nThe one thing I'll say I never got into was closed species. Those things are mega-priced. One poor guy apparently had some sort of mental episode due to meds mismanagement. It drove him to spend like 20K or so on one adopt. As he came down from the episode, he realized what happened and the artist wouldn't even give him a partial refund or auction off the adopt again.\n\n\nI've been trying the \"psh, I can do better\" thing, too! Or thinking, \"I should save up and get a fancy adopt from Popular Artist of the Month\" helps, too, sometimes.", "created_utc": "1649031924.0", "edited": "False", "id": "i3ahhcw", "is_submitter": "True", "link_id": "t3_tuz15f", "parent_id": "t1_i3afqyk", "score": "3", "subreddit": "shoppingaddiction", "subreddit_id": "t5_33bb0"}, {"author": "monstersandlanguages", "body": "Unfortunately, Vyvanse looks to be a stimulant. My heart beats too fast when I take stimulants, so they're off the table. Hypotension looks to be a risk, too, and I'm already borderline there...Bupropion and atomoxetine are the only options thus far for folks with ADHD who can't take stimulants.\n\n\nOddly enough, my escitalopram gave me way more mania than bupropion has (although yes, I *have* noticed episodes of, erm, elevated mood now that you mention it. Mine just makes me run around like a little kid, fantasizing about curing diseases, building intelligent robots, etc. As long as I'm not hurting myself or anyone else, or going into psychosis, eh, daydream away.)", "created_utc": "1649016236.0", "edited": "False", "id": "i39i1jx", "is_submitter": "True", "link_id": "t3_tuz15f", "parent_id": "t1_i38p9e3", "score": "1", "subreddit": "shoppingaddiction", "subreddit_id": "t5_33bb0"}, {"author": "monstersandlanguages", "body": "Horrorstör looks to be right up my alley.\n\n\nI've already read a huge portion of Vonnegut's work. Such a talented writer. Slaughterhouse Five, Bluebeard, Cat's Cradle, Player Piano, and The Sirens of Titan are some of his best, imo. Oh, and Deadeye Dick was super good, too.", "created_utc": "1649015971.0", "edited": "False", "id": "i39herh", "is_submitter": "True", "link_id": "t3_tvdd6g", "parent_id": "t1_i38se3t", "score": "1", "subreddit": "suggestmeabook", "subreddit_id": "t5_31t41"}, {"author": "monstersandlanguages", "body": "Already read it. Loved it. Grapes of Wrath and Eden were good, too.", "created_utc": "1649015849.0", "edited": "False", "id": "i39h49n", "is_submitter": "True", "link_id": "t3_tvdd6g", "parent_id": "t1_i38smgl", "score": "2", "subreddit": "suggestmeabook", "subreddit_id": "t5_31t41"}, {"author": "monstersandlanguages", "body": "Oddly enough, I don't think I've read a lot of Pratchet's work. Time to fix that. Thanks!", "created_utc": "1649015815.0", "edited": "False", "id": "i39h1em", "is_submitter": "True", "link_id": "t3_tvdd6g", "parent_id": "t1_i38xi41", "score": "3", "subreddit": "suggestmeabook", "subreddit_id": "t5_31t41"}, {"author": "monstersandlanguages", "body": "Nope, but it's free at the library. I'll give it a try, thanks!", "created_utc": "1649015783.0", "edited": "False", "id": "i39gyih", "is_submitter": "True", "link_id": "t3_tvdd6g", "parent_id": "t1_i38y0x2", "score": "1", "subreddit": "suggestmeabook", "subreddit_id": "t5_31t41"}, {"author": "monstersandlanguages", "body": "Already read that one. Loved it. Excellent story and writing.", "created_utc": "1649015728.0", "edited": "False", "id": "i39gtqk", "is_submitter": "True", "link_id": "t3_tvdd6g", "parent_id": "t1_i39142a", "score": "1", "subreddit": "suggestmeabook", "subreddit_id": "t5_31t41"}, {"author": "monstersandlanguages", "body": "Neuromancer and The Fisherman were SO good. The other two will be read just as soon as I can get them from the library. Thanks!", "created_utc": "1649015709.0", "edited": "False", "id": "i39gs0n", "is_submitter": "True", "link_id": "t3_tvdd6g", "parent_id": "t1_i395yw7", "score": "3", "subreddit": "suggestmeabook", "subreddit_id": "t5_31t41"}, {"author": "monstersandlanguages", "body": "Oh wow, I've never heard of that one before! Definitely going on the list for the library. Thanks!", "created_utc": "1649015661.0", "edited": "False", "id": "i39gnr5", "is_submitter": "True", "link_id": "t3_tvdd6g", "parent_id": "t1_i397f1z", "score": "1", "subreddit": "suggestmeabook", "subreddit_id": "t5_31t41"}, {"author": "monstersandlanguages", "body": "Yup, I've got ADHD. That's what my bupropion is for. The stimulant meds aren't an option because I've got tachycardia. 100% it's helped a lot, it just hasn't solved the problem. (If only, right?)", "created_utc": "1649003587.0", "edited": "False", "id": "i38n95d", "is_submitter": "True", "link_id": "t3_tuz15f", "parent_id": "t1_i38lj84", "score": "2", "subreddit": "shoppingaddiction", "subreddit_id": "t5_33bb0"}, {"author": "monstersandlanguages", "body": "I think it's become a displacement for doing real art. I realized this morning that I spend so much time working, doing chores, baby-sitting dogs, and dealing with family members I don't like that I...just don't have the energy. But at the same time I'm wired. It's almost like shopping hits all the right buttons at the same time without requiring any energy investment.", "created_utc": "1649003538.0", "edited": "False", "id": "i38n4t8", "is_submitter": "True", "link_id": "t3_tuz15f", "parent_id": "t1_i37ywhp", "score": "5", "subreddit": "shoppingaddiction", "subreddit_id": "t5_33bb0"}, {"author": "monstersandlanguages", "body": "I have ADHD, so the bupropion is helping more than hurting. So maybe it does the opposite of what it would do to other people? 🤔 The brain is impossibly convoluted.\n\n\nI've considered therapy. The problem is just so damn embarrassing. I don't even know how to begin to explain it in a way that would enable a therapist to help.", "created_utc": "1649003442.0", "edited": "False", "id": "i38mwl2", "is_submitter": "True", "link_id": "t3_tuz15f", "parent_id": "t1_i37214e", "score": "1", "subreddit": "shoppingaddiction", "subreddit_id": "t5_33bb0"}, {"author": "monstersandlanguages", "body": "Ah heck, why not give it another shot. There's a bajillion shows out there, and libraries are virtually free. I'm going to look at that sub you suggested since I did like to read at one point. Thanks!", "created_utc": "1648963261.0", "edited": "False", "id": "i36v7oy", "is_submitter": "True", "link_id": "t3_tuz15f", "parent_id": "t1_i36ufph", "score": "3", "subreddit": "shoppingaddiction", "subreddit_id": "t5_33bb0"}, {"author": "monstersandlanguages", "body": "I'll keep trying. (No other option, right?). Books and TV shows don't interest me, nor does music for that matter. Every time I draw I end up opening my \"shopping sites\" again, so that's a no-go. Rn I'm trying video games that *do not* have a lot of in-app purchases. It's...sort of helping? Getting enough exercise helps a bit, too. And yet, I just dodged a $75 purchase and, despite yelling at myself, dropped $500 yesterday.\n\n\nI've also tried dog sports, various other art forms (ex: origami, fiber crafts, scrapbooking, etc), language learning, running, learning higher math, writing code on the side for fun, and learning an instrument. It's almost like I'm simultaneously wired and exhausted to the point where shopping is the only thing I can do. A frustrating mystery.", "created_utc": "1648958651.0", "edited": "False", "id": "i36nkxt", "is_submitter": "True", "link_id": "t3_tuz15f", "parent_id": "t1_i36lun6", "score": "3", "subreddit": "shoppingaddiction", "subreddit_id": "t5_33bb0"}, {"author": "monstersandlanguages", "body": "Yeah, just keep going. You'll build up your strength and stamina bit by bit. You can worry about hitting your target heart rate afterward.", "created_utc": "1648848616.0", "edited": "False", "id": "i319y9g", "is_submitter": "False", "link_id": "t3_ttznld", "parent_id": "t1_i319fdt", "score": "7", "subreddit": "loseit", "subreddit_id": "t5_2rz8w"}, {"author": "monstersandlanguages", "body": "Perhaps consider buying a treadmill or stationary bike if that's within budget? The bikes are around $200 for a cheap one that should last a couple years. Treadmills start at $150 but might wear out a wee bit quicker depending on how you walk on them.", "created_utc": "1648847854.0", "edited": "False", "id": "i3187xl", "is_submitter": "False", "link_id": "t3_ttznld", "parent_id": "t1_i30z9lq", "score": "3", "subreddit": "loseit", "subreddit_id": "t5_2rz8w"}, {"author": "monstersandlanguages", "body": "I'm sorry such a great field has been essentially ruined for you. :( How unfair. Even worse that you feel it important to steer someone else away from it.\n\n\nI've been in software engineering (US, Midwest) for almost ten years and have never encountered anything egregious. The minor problems have dwindled to almost nothing since going full-time remote. Have you tried remote work?\n\n\nWhat sort of companies did you work for? It's always the \"tech culture\" and \"conservative\" companies that I hear the most complaints about. \n\n\nAnyway, all you can do is warn and hope that anyone who comes after you doesn't experience the same. In any case, it's good to be prepared for what might happen and make a decision as to whether or not you're willing to deal with it.", "created_utc": "1648838836.0", "edited": "False", "id": "i30mq1q", "is_submitter": "False", "link_id": "t3_ttsaxj", "parent_id": "t1_i3092g9", "score": "22", "subreddit": "AmItheAsshole", "subreddit_id": "t5_2xhvq"}, {"author": "monstersandlanguages", "body": "Same! I still pay a visit to my best friend, cookie dough ice cream, twice a week to this very day, lol. Too bad it's so caloric. Would be great to be able to eat the fancy ice creams every day.", "created_utc": "1648673757.0", "edited": "False", "id": "i2rima0", "is_submitter": "False", "link_id": "t3_tsba9w", "parent_id": "t1_i2rg7d1", "score": "2", "subreddit": "loseit", "subreddit_id": "t5_2rz8w"}, {"author": "monstersandlanguages", "body": "It's not usually the ice cream itself. Vanilla ice cream is about 160 calories per 1/2 cup serving and chocolate is about 180 last I checked. It's what we tend to add to it.\n\n\nFudge swirls, cookie dough, cookie crumbles, cheesecake, etc. And of course milkshakes up the calories, too, since there's usually several servings worth of ice cream in them. (So good, so unhealthy.)", "created_utc": "1648670648.0", "edited": "False", "id": "i2rar0p", "is_submitter": "False", "link_id": "t3_tsba9w", "parent_id": "t1_i2qyjgr", "score": "7", "subreddit": "loseit", "subreddit_id": "t5_2rz8w"}, {"author": "monstersandlanguages", "body": "I have the same problem, but with Triscuits. The cheese ones are sooooo good. But you quickly move into calorie-bomb territory if you eat more than six...I have to count out the Triscuits, put them on a plate, then make a point to place the box back in the pantry otherwise it's tempting to say, \"oh, just a couple extra crackers won't hurt.\"", "created_utc": "1648670247.0", "edited": "False", "id": "i2r9pt0", "is_submitter": "False", "link_id": "t3_tsba9w", "parent_id": "t1_i2ql280", "score": "30", "subreddit": "loseit", "subreddit_id": "t5_2rz8w"}, {"author": "monstersandlanguages", "body": "Huh, that never occurred to me. The physical activity *is* fun...the lack of weight loss isn't.", "created_utc": "1648587941.0", "edited": "False", "id": "i2m6wmw", "is_submitter": "True", "link_id": "t3_tr0j81", "parent_id": "t1_i2m0tl2", "score": "1", "subreddit": "loseit", "subreddit_id": "t5_2rz8w"}, {"author": "monstersandlanguages", "body": "I didn't realize eggs had so few grams of protein. Hmmm. You're the second person to bring up the peanut butter, so I'll reduce that to one tbsp max per day and try some of your guys' other suggestions. Thanks!", "created_utc": "1648572164.0", "edited": "False", "id": "i2l17y8", "is_submitter": "True", "link_id": "t3_tr0j81", "parent_id": "t1_i2l098w", "score": "2", "subreddit": "loseit", "subreddit_id": "t5_2rz8w"}, {"author": "monstersandlanguages", "body": "That sounds like a good idea! Gotta change something, 'cause obviously this current setup isn't working. Thanks. :) I think I'll look up a recipe for a diet-friendly bean soup.", "created_utc": "1648572026.0", "edited": "False", "id": "i2l0uln", "is_submitter": "True", "link_id": "t3_tr0j81", "parent_id": "t1_i2l0d6j", "score": "1", "subreddit": "loseit", "subreddit_id": "t5_2rz8w"}, {"author": "monstersandlanguages", "body": "Quite a bit of peanut butter (2 - 4tbsp per day), an egg or two for protein. The rest is carrots, leafy greens, an apple, low-fat Greek yogurt. I often supplement with a bit of cheese. Sometimes salmon, beans, etc get thrown in the mix. Depends on what I've got around and how I've plotted my calories for the day.\n\nFor measuring, I take the, \"when in doubt, it's too much\" approach. Ex: a small spoon with peanut butter, flattened = 1tbsp. I use measuring cups for everything possible. The only exception is leafy greens, since I've never been able to eat more than two cups at a time, lol.", "created_utc": "1648571225.0", "edited": "False", "id": "i2kyq2z", "is_submitter": "True", "link_id": "t3_tr0j81", "parent_id": "t1_i2kwt1c", "score": "2", "subreddit": "loseit", "subreddit_id": "t5_2rz8w"}, {"author": "monstersandlanguages", "body": "Mine is for agoraphobia. Without it, I'm stuck inside, so the pros are definitely higher than the cons. If I miss a dose, though? Whew. Sweating, panic, nausea, night terrors, etc.\n\n\nPeople should try everything they can before going to benzos but, I mean, if you need 'em, you need 'em.", "created_utc": "1648570948.0", "edited": "False", "id": "i2kxzu8", "is_submitter": "False", "link_id": "t3_tqxli2", "parent_id": "t1_i2kxoq5", "score": "1", "subreddit": "sadcringe", "subreddit_id": "t5_2wsc9"}, {"author": "monstersandlanguages", "body": "I can try sticking to 1300. It just leaves me so damn hungry. I could add another egg or maybe some chicken to my routine.", "created_utc": "1648569803.0", "edited": "False", "id": "i2kuzm7", "is_submitter": "True", "link_id": "t3_tr0j81", "parent_id": "t1_i2kt6vx", "score": "1", "subreddit": "loseit", "subreddit_id": "t5_2rz8w"}, {"author": "monstersandlanguages", "body": "Didn't he detox some time ago? I read somewhere that he did it too fast or whatever and it wrecked him.\n\n\nBenzos are fucking awful. I take a tiny bit of clonazepam and live in mortal fear of missing a dose.", "created_utc": "1648568367.0", "edited": "False", "id": "i2kr9j9", "is_submitter": "False", "link_id": "t3_tqxli2", "parent_id": "t1_i2kh0ko", "score": "11", "subreddit": "sadcringe", "subreddit_id": "t5_2wsc9"}, {"author": "monstersandlanguages", "body": "100% recommend the monster roulette on Expeditions. So low risk with high reward.\n\n\nSpiribirds should be easy to gather in Shrine Ruins and Frost Islands. They take a bit more effort in Sandy Plains and Flooded Forest, and are a pain in the ass in the Lava Caverns. I don't have time to look right now, but you should be able to Google \"MH Rise Spiribird paths\" or something like that and find maps.", "created_utc": "1648483410.0", "edited": "False", "id": "i2g9u04", "is_submitter": "False", "link_id": "t3_tpoovh", "parent_id": "t1_i2e9qt8", "score": "2", "subreddit": "monsterhunterrage", "subreddit_id": "t5_3a2f0"}, {"author": "monstersandlanguages", "body": "When I first started playing MH (came from MHGU -> Rise), I had the same problem. It's hard to identify *exactly* what I did to improve and when things started to click, but I definitely agree that you shouldn't be predicting a monster's moves unless the monster is giving a tell or you know a pattern is about to occur. \n\n\nConsider spending five minutes to max Spiribirds for monsters that give you the most trouble. There's no shame in it. It's not like you have to do it every time once you feel you've got the hang of that particular monster.\n\n\n100hrs might be too little if you're not getting into the flow with Rise. You're probably not as bad as you think if you've made it to the Allmother quest, though!\n\n\nWhen I was struggling, I played tons of LR, and later HR, expedition quests. Expedition quests are an excellent choice here. You can play for as long as you want, you can eat as many carts as you want, you can gather more materials for potions, and you can expose yourself to a small roster of monsters. You can also get a nice chunk of monster parts for new weapons, armor, and talisman fodder. :) If you're really lucky, you might get a plate or orb or two.", "created_utc": "1648416720.0", "edited": "False", "id": "i2d1h05", "is_submitter": "False", "link_id": "t3_tpoovh", "parent_id": "t3_tpoovh", "score": "6", "subreddit": "monsterhunterrage", "subreddit_id": "t5_3a2f0"}, {"author": "monstersandlanguages", "body": "Same here. Looks like he held on pretty well until the end, but the human body has its limits and there's no denying physics. It'd be too much for anybody. RIP. I hope family and friends find peace.", "created_utc": "1648273924.0", "edited": "False", "id": "i25vk5i", "is_submitter": "False", "link_id": "t3_to0esn", "parent_id": "t1_i25m8a5", "score": "7", "subreddit": "NSFL__", "subreddit_id": "t5_3lcigy"}, {"author": "monstersandlanguages", "body": "In my case, I think I'm getting hit by some withdrawal symptoms as well, since 7 days is apparently pretty short to wean off escitalopram.\n\n\nHope things go better for you and your husband soon!", "created_utc": "1648089429.0", "edited": "False", "id": "i1vsl51", "is_submitter": "False", "link_id": "t3_tlc1yj", "parent_id": "t1_i1vomf7", "score": "1", "subreddit": "bupropion", "subreddit_id": "t5_xuccg"}, {"author": "monstersandlanguages", "body": "Day 14 on bupropion and the vertigo is so bad since I weaned off my escitalopram 7 days ago. If I move my head, it's like my eyes don't move fast enough with it. Inactivity and dehydration definitely makes it worse, as does lack of sleep (getting at least 8 hours helps but by 4PM, it's definitely way noticeable).\n\n\nFingers crossed this mostly goes away soon...This stuff has been a miracle, but on bad days, I'm almost afraid to drive.\n\n\nAnd my god, the irritability and intolerance for shenanigans caught me by surprise.\n\n\nETA: My doctor had me go back on 5mg of escitalopram after my symptoms rapidly progressed. It was getting to the point where it was hard to walk, my head hurt, and I was constantly nauseated.\n\n\nThe doc, \"Jake\", who told me to hop off the meds at day 7 isn't my normal doc, \"Mike\". As it turns out, day 7 is *really* quick to jump off any antidepressant. Mike tore a strip off of Jake based on what the front office staff told me.\n\n\nAnyway, if withdrawal is super bad for you, talk to your doctor about weaning off way more slowly, or if there are other options to at least make the withdrawal more bearable.", "created_utc": "1648083485.0", "edited": "1648232835.0", "id": "i1vfkf8", "is_submitter": "False", "link_id": "t3_tlc1yj", "parent_id": "t3_tlc1yj", "score": "4", "subreddit": "bupropion", "subreddit_id": "t5_xuccg"}, {"author": "monstersandlanguages", "body": "The Emergency Quests overall are so weirdly balanced. Some of them are just slightly more difficult. Other times, you get ripped in half with one blow.", "created_utc": "1647960261.0", "edited": "False", "id": "i1o086y", "is_submitter": "False", "link_id": "t3_tk2w2l", "parent_id": "t3_tk2w2l", "score": "31", "subreddit": "monsterhunterrage", "subreddit_id": "t5_3a2f0"}, {"author": "monstersandlanguages", "body": "Oh man, this would be breakup territory for me. It would be one thing if he sincerely apologized in the morning since sudden wake-ups at any time can suck, but you had to ask? And he's mad you woke him up because you were having an attack? Dang, that's some callous behavior right there.\n\n\nYou're NTA, OP. When you wake up with asthma in the middle of the night, you've already not had enough air. You're panicked, probably a little disoriented. It's fine for an SO not being happy about being woken up, but being a dickhead about a genuine medical issue is not on.\n\n\nIn the future, put your emergency inhaler in the same place every night. Preferably (a) some place where it's going to be harder to knock down in the event you're lunging for it in a panic and (b) level with your bed so you can just reach over and grab it. This is especially important if you decide to stay with your current SO.", "created_utc": "1647890243.0", "edited": "False", "id": "i1kfq7p", "is_submitter": "False", "link_id": "t3_tj7cue", "parent_id": "t1_i1ieil4", "score": "11", "subreddit": "AmItheAsshole", "subreddit_id": "t5_2xhvq"}, {"author": "monstersandlanguages", "body": "I'm running full Valstrax (I know, I know) with swaxe. Full Evade Window, x2 Evade Extender, x4 Defense Boost, x2 Partbreaker. I eat for Medic Hi, Slugger, and Dango Feet/Marksman. Add in full Spiribird + Demondrug/Armorskin for the emergency quest. Use the trap bugs to stagger the fat-headed bastard.\n\n\nYour immortal build sounds damn fun. I'm gonna have to put one together.", "created_utc": "1647796808.0", "edited": "False", "id": "i1fc2i8", "is_submitter": "True", "link_id": "t3_tiebap", "parent_id": "t1_i1epm1g", "score": "2", "subreddit": "monsterhunterrage", "subreddit_id": "t5_3a2f0"}, {"author": "monstersandlanguages", "body": "You had me so damn worried about the emergency quest that I maxed my Spiribirds and took some Demondrug and Armorskin.\n\n\nIt took thirty minutes and was actually easier than the singles I've been running because of the boosts. Whenever the two Apexes got in the same area, I let them beat each other up a bit, then threw a flash pod. After the pod wore off, one of them would always split.\n\n\nGetting in between two Apex Diablos is probably a death wish. I can't even imagine how ungodly this quest would be as a group.", "created_utc": "1647796618.0", "edited": "False", "id": "i1fbled", "is_submitter": "True", "link_id": "t3_tiebap", "parent_id": "t1_i1ebdmg", "score": "2", "subreddit": "monsterhunterrage", "subreddit_id": "t5_3a2f0"}, {"author": "monstersandlanguages", "body": "The RNG in Rise baffles me sometimes. It seems like you either get at least doubles of Orbs, etc (and Plates are practically common at end game), or you get to suffer without (ex: I am never getting Almudron's Golden Orb it's been FIFTY HUNTS).\n\n\nWhat kind of buddies you running with? If it's a matter of not being able to break parts, I've heard two Palamutes or two Bombadier/Fighter Palicos can help. If it's just RNGesus frowning upon you, sometimes two Gatherer Palicos work. Sometimes.", "created_utc": "1647216289.0", "edited": "False", "id": "i0k13zf", "is_submitter": "False", "link_id": "t3_tdc3lu", "parent_id": "t3_tdc3lu", "score": "4", "subreddit": "monsterhunterrage", "subreddit_id": "t5_3a2f0"}, {"author": "monstersandlanguages", "body": "That's...certainly a unique way to go.\n\n\nI feel bad for him if dementia really was a concern. :( That's some scary shit. You can't blame someone for wanting to take their destiny into their own hands while their mind is still mostly intact.\n\n\nStill, that's, er, a very unique way to take your destiny into your own hands. I hope it wasn't too painful after the initial impact. Guessing and hoping that he would have been unconscious pretty much right away. RIP old guy.", "created_utc": "1647205736.0", "edited": "False", "id": "i0jd3f0", "is_submitter": "False", "link_id": "t3_tdg7yc", "parent_id": "t3_tdg7yc", "score": "230", "subreddit": "eyeblech", "subreddit_id": "t5_3fhf0"}, {"author": "monstersandlanguages", "body": "Hm, you've got a point. Maybe the other roomies panicked? If Simon is this irresponsible with his health, it's possible he never explained his condition properly. Just, \"no eat = I die immediately\".\n\n\nIf I were OP, I'd have to bite my tongue not to ask probing questions about the situation. And the only reason I'd bite my tongue is so the living situation doesn't get even more tense.", "created_utc": "1647191883.0", "edited": "False", "id": "i0ighgw", "is_submitter": "False", "link_id": "t3_td59k7", "parent_id": "t1_i0hpvqe", "score": "7", "subreddit": "AmItheAsshole", "subreddit_id": "t5_2xhvq"}, {"author": "monstersandlanguages", "body": "I've had non-diabetic hypoglycemia since childhood and my GOD, Simon must have hella willpower (or maybe some mental health issues?) to just *sit there and let the hypo progress*. The symptoms are different for everyone but in general, it hurts, is extremely uncomfortable, or both. I get rib pain, cramping across my entire abdomen, and unsteady on my feet. I progress to near-fainting pretty quickly. The only time I \"enjoyed\" the feeling was when I had an eating disorder. Makes me wonder about Simon.\n\n\nThis problem is super easy to manage with regular, somewhat healthy meals. Heck, I've staved off hypo with leftover broccoli before (though it took a bit longer to feel better since broccoli digests more slowly). In a pinch, I use Red Bird soft peppermints. They're mostly sugar with a hint of peppermint. They dissolve fast, too.", "created_utc": "1647191397.0", "edited": "False", "id": "i0ifbnu", "is_submitter": "False", "link_id": "t3_td59k7", "parent_id": "t1_i0htugr", "score": "11", "subreddit": "AmItheAsshole", "subreddit_id": "t5_2xhvq"}, {"author": "monstersandlanguages", "body": "This is one of those situations where the, \"oh shit, do something now!\" part of your brain reacts before the, \"uh, don't do that, moron\" part does. We all find ourselves in such a situation on rare occasion.\n\n\nIt looks like the guy figured out he fucked up quickly, and then panicked. That must be a tough situation to get out of, especially when you have to make a rapid decision. He might have been able to dodge to the side at the expense of his legs. Alternately, if he'd dived a few feet before the trailer, the truck might have enough clearance for him to survive as long as he didn't end up under a wheel. But again, that's one helluva situation to have to make a snap judgement on.", "created_utc": "1647023320.0", "edited": "False", "id": "i09s9w8", "is_submitter": "False", "link_id": "t3_tbscg1", "parent_id": "t1_i098k0u", "score": "26", "subreddit": "NSFL__", "subreddit_id": "t5_3lcigy"}, {"author": "monstersandlanguages", "body": "I feel sorry for the lady, but I wonder if she was hoping a sleepover would distract the kid with autism so she could have a break. Or that maybe spending lots of time with \"normal\" kids would make her kid \"normal\", too.\n\n\nThis lady needs therapy or at least some supportive services if there are any available (I understand that often there are none). Without being there to read tone and such, I just get, \"I'm super tired and fed up and I need someone to step in for me\" vibes.\n\n\nNot cool putting that on OP, though. OP is NTA 100%.", "created_utc": "1646756166.0", "edited": "False", "id": "hzuovfn", "is_submitter": "False", "link_id": "t3_t9d35y", "parent_id": "t1_hztw8pv", "score": "1", "subreddit": "AmItheAsshole", "subreddit_id": "t5_2xhvq"}, {"author": "monstersandlanguages", "body": "I haven't the foggiest idea. All my emergencies have been nuts (minus Arzuros because...it's a reskinned Arzuros). Still fun as heck.", "created_utc": "1646672945.0", "edited": "False", "id": "hzq300t", "is_submitter": "False", "link_id": "t3_t81vvq", "parent_id": "t1_hzptz55", "score": "1", "subreddit": "monsterhunterrage", "subreddit_id": "t5_3a2f0"}, {"author": "monstersandlanguages", "body": "Apex Rathian idled for you? She was moving around so much for me that I got quite a few knockdowns (and smacked by that tail). It's weird how fussy the AI in this game can be.\n\n\nApex Zinogre is cooler than regular Zinogre in a lot of ways, it's just I can't ever seem to not be in the way when he does his KO move. He's a quick lil bugger whenever I fight him.\n\n\nInteresting about Infernal Springs. For me, Infernal Springs is basically just the Arena. But god, do I roll a lot during those quests, lol. Oh, and curse. So much cursing.", "created_utc": "1646663627.0", "edited": "False", "id": "hzpgknj", "is_submitter": "False", "link_id": "t3_t81vvq", "parent_id": "t1_hzojhvp", "score": "2", "subreddit": "monsterhunterrage", "subreddit_id": "t5_3a2f0"}, {"author": "monstersandlanguages", "body": "I'm 50/50 on them. Some of them are sort of boring (like emergency Apex Arzuros) and some of them are just...insane (anything with Apex Zinogre).\n\n\nBut Apex Rathian? Wow--that's actually a fun fight if you're geared up for it. Nice moveset that doesn't feel coked up, yet is challenging. Cool roar, neat reskin. It is a HUGE shame you scarcely get anything for beating her. \n\n\nLove, love, *loved* the Zinogre-Khezu arena quest. Easy, but somehow very fun. The two monsters have a decent synergy. Oh, and that one Zinogre arena quest where you get the Megaman(?) layered armor. What a little guy you got to beat to death.", "created_utc": "1646634164.0", "edited": "False", "id": "hzoadnw", "is_submitter": "False", "link_id": "t3_t81vvq", "parent_id": "t3_t81vvq", "score": "5", "subreddit": "monsterhunterrage", "subreddit_id": "t5_3a2f0"}, {"author": "monstersandlanguages", "body": "It's the end game that pisses me the hell off.\n\n\nEx: You're farming for Gold Rathian eggs in one of the special dens using one of your precious, pain-in-the-ass SR tickets. Your monster has the ideal gene setup, you have the ideal weapon/armor setup, and you're partnered with Reverto. You get jumped by Gold Rathian.\n\n\nYou get wiped. Why? Because this stupid Rathian deals *massive* one-shot damage AND gets double attacks that can hit the entire team. If you're good, you can dodge a couple of these attacks. If you're lucky, you can dodge a couple more. But you *are* going to spend most of the fight playing healer to your stupid teammates because you can't afford to have less than max hearts when you can be one-shot like that.\n\n\nTo add insult to injury, you have to go through a tedious process to get to these strong monsters again whether you win or not because, duh, genes if nothing else. Nargacuga helps a lot, but it's still boring as shit.\n\n\nLeveling up more doesn't help, either. The monsters level with you (which iirc is actually a change from the first Stories game).\n\n\nAnyway, these one-shot wipe monsters make more sense in the mainline MH games, where you at least have a chance to dodge. All you can do in Stories is wait for annihilation. And GOD, annihilation can take for-fucking-ever. My record is 45 turns. 30 minutes. Even with the animations sped up x3. I shit you not. Most of that time was spent chugging potions.\n\n\nThe base game was decent. Some plot holes, a little annoying to gene-hunt, but eh, overall pretty fun. The end game pissed me off so bad that I don't know if I want to pick up Stories 3 in the event one comes out.\n\n\nOh, Ratha pisses me off, too. Ratha should have been the strongest monster in the game. Not right out of the gate, of course. He should have grown stronger after a series of quests because he's *goddamn Razewing Ratha of legend*. But he's just a generic Rathalos that's outclassed by almost every other monster. You can't even kick him from your team until the end of the game.\n\n\nI haven't played any of the new Pokemon games and won't (those were games I played with my grandpa, who's no longer here. If I can't play with him, I don't want to play at all.) Arceus looks hella fun compared to MHST2, ngl. Arceus graphics are a step down from MHST2, though.", "created_utc": "1646588300.0", "edited": "False", "id": "hzlkcd7", "is_submitter": "False", "link_id": "t3_t7ztz4", "parent_id": "t1_hzl7zu6", "score": "19", "subreddit": "MonsterHunter", "subreddit_id": "t5_2rron"}, {"author": "monstersandlanguages", "body": "Oh GOD, I hate the farting piece of shit known as Volvidon. I've already ranted about him elsewhere, so I won't go any further than that.\n\n\nI swaxe him to death in a hurry in quests where slaying him is required. Invincible Gambit + at least one Evade Extender means he can't do much to you. Just gotta avoid that yellow puke.\n\n\nThe idea behind his appearance is kinda cool, as is his color palette. Everything else about him needs to be put in the shredder and reconsidered. Or don't let him roll and bounce so much. *Something*.", "created_utc": "1646459060.0", "edited": "False", "id": "hzf4779", "is_submitter": "False", "link_id": "t3_t6z1ca", "parent_id": "t1_hzek019", "score": "35", "subreddit": "MonsterHunter", "subreddit_id": "t5_2rron"}, {"author": "monstersandlanguages", "body": "All I can think of is how satisfying it would be to sever that tail, lol.", "created_utc": "1646255501.0", "edited": "False", "id": "hz3m0ju", "is_submitter": "False", "link_id": "t3_t4xrb8", "parent_id": "t1_hz1by93", "score": "3", "subreddit": "MonsterHunter", "subreddit_id": "t5_2rron"}, {"author": "monstersandlanguages", "body": "> you’re most likely fatigued if you get that mad so take a break\n\n\nYes! The dragon will still be there if you take a 15 minute break. Go scream, pet the dog, have a snack, or read up on tips to beat the dragon. \n\n\nHell, you might be *better* if you just step away for a bit so your brain can digest the ass-whoopin' you just got, lol. You can't think straight if you're in a rage, anyway.", "created_utc": "1646158064.0", "edited": "False", "id": "hyxudjc", "is_submitter": "False", "link_id": "t3_t4c4wt", "parent_id": "t1_hyxhzpw", "score": "6", "subreddit": "MonsterHunter", "subreddit_id": "t5_2rron"}, {"author": "monstersandlanguages", "body": "That was a fun quest, tho.\n\n\nBut what is *up* with Palicos and Palamutes? It's like there's something baked into each individual that makes them more or less likely to help you out. My two current Palicos are badass. I'd say one of them will knock me out of stun...75% of the time? (The Palicos in my previous save didn't give a damn, lmao.)\n\n\nBut all my stupid Palamutes just *bark*.", "created_utc": "1646156544.0", "edited": "False", "id": "hyxqfda", "is_submitter": "False", "link_id": "t3_t45cea", "parent_id": "t3_t45cea", "score": "10", "subreddit": "MemeHunter", "subreddit_id": "t5_3pd0d"}, {"author": "monstersandlanguages", "body": "How have you gotten good damage output and status infliction from your palamute? I've always run an assist and fighter palico and it seems to work better than palamute + palico. (Not to mention the gathered/plundered materials can be clutch.) I *really* miss the mobility. And the Okami layered armor, lol.\n\n\nMy palamute just barks half the time. My Palicos do things like attack the monster, knock me out of stun (which is apparently fairly rare, lol), use Healing Bubble, throw out Shock Trippers, set up Poison Purr-isons, improve my stamina stat, and improve my attack stat.", "created_utc": "1645750856.0", "edited": "False", "id": "hybiw4n", "is_submitter": "False", "link_id": "t3_t0mpts", "parent_id": "t1_hyavcqw", "score": "2", "subreddit": "MonsterHunter", "subreddit_id": "t5_2rron"}, {"author": "monstersandlanguages", "body": "The garbage incident sounded like it could be resource guarding. This dog has been allowed to have and do whatever they've wanted. No structure has let them develop one helluva Napoleon Complex.\n\n\nSince dogs are individuals like people, not all dogs are good for all households. Sounds like this dog would be better with a household that can provide more consistent training and structure. OP's household sounds like a better fit for a laidback, mellow personality. Their current dog sounds very sharp and demanding.", "created_utc": "1645750245.0", "edited": "1645764645.0", "id": "hybhiij", "is_submitter": "False", "link_id": "t3_t0m3rc", "parent_id": "t1_hyb427c", "score": "2", "subreddit": "AmItheAsshole", "subreddit_id": "t5_2xhvq"}, {"author": "monstersandlanguages", "body": "Fastest way to rank up to HR 100 is supposed to be the Apex Rampages, esp w/Apex Zinogre.\n\n\nOtherwise, try Narwa/Allmother Narwa and other HR quests, though it'll be a lot slower. If you still have decos or talismans you wanna try to farm, this is a decent route to start with. You can always switch to Rampages.", "created_utc": "1645660303.0", "edited": "False", "id": "hy64g64", "is_submitter": "False", "link_id": "t3_szvkrd", "parent_id": "t3_szvkrd", "score": "5", "subreddit": "MonsterHunter", "subreddit_id": "t5_2rron"}, {"author": "monstersandlanguages", "body": "Why the hell you wouldn't wear a parachute for a stunt like that is beyond me. It's not any less brave if you have a life-saving device to help you in the event things go south. Sounds like he did some cool stunts but cut his life short, maybe with hubris. Maybe with carelessness. Insult to injury, the narrator didn't even have much to say at the end. I guess Jim's career wasn't long and storied enough.", "created_utc": "1645494524.0", "edited": "False", "id": "hxws809", "is_submitter": "False", "link_id": "t3_sxcl0t", "parent_id": "t1_hxvbq39", "score": "4", "subreddit": "NSFL__", "subreddit_id": "t5_3lcigy"}, {"author": "monstersandlanguages", "body": "Ugh, that moment where you think, *YES, amazing damage!*. Then it turns out to be some little monster. Wroggies, Rhenoplos, and Kestodons are the worst for this shit.", "created_utc": "1645460791.0", "edited": "False", "id": "hxuif77", "is_submitter": "False", "link_id": "t3_sxc9de", "parent_id": "t3_sxc9de", "score": "1", "subreddit": "MonsterHunter", "subreddit_id": "t5_2rron"}, {"author": "monstersandlanguages", "body": "Omg, yes, the stab. You learn to either have Evade Window maxed and roll through it all, or just lie there for a second if you get hit. I don't mind the wirefall mechanic too much. What I wish was in place was more monsters/moves that punished you for it.\n\n\nWirefall too soon/late? Punish. Wirefall the wrong direction? Punish. Etc.\n\n\nThere seem to only be a handful of monsters that punish you and those are some of the most fun. And infuriating. But also fun.", "created_utc": "1645460106.0", "edited": "False", "id": "hxugq2s", "is_submitter": "False", "link_id": "t3_sxl6vu", "parent_id": "t1_hxu3mlf", "score": "3", "subreddit": "MonsterHunter", "subreddit_id": "t5_2rron"}, {"author": "monstersandlanguages", "body": "So, so freaking close. Ugh. The whole stunt looked fun riiiight up until that moment. :( Guessing the guy went quick after hitting the bridge. Small mercies, I guess.\n\n\nFor some reason, this video reminds me of the stuntman who was riding on some sort of metal contraption under a plane. He slipped, was able to hold on for maybe a couple seconds, then whoosh. Gone. I think you could hear a hoarse scream of regret and that's it.", "created_utc": "1645459057.0", "edited": "False", "id": "hxue6ri", "is_submitter": "False", "link_id": "t3_sxcl0t", "parent_id": "t1_hxrlnye", "score": "6", "subreddit": "NSFL__", "subreddit_id": "t5_3lcigy"}, {"author": "monstersandlanguages", "body": "Once you're familiar with the map, it takes maybe 5 min to mostly fill out your gages. Pointless for easier monsters, but for the emergency apexes (or anything someone has a lot of trouble against, tbh)? Worth the time.\n\n\nThe only map where maxing out sucks is Lava Caverns. Sandy Plains is a bit annoying, too.", "created_utc": "1645307266.0", "edited": "False", "id": "hxmmgpt", "is_submitter": "False", "link_id": "t3_swedyw", "parent_id": "t1_hxlj6c2", "score": "7", "subreddit": "monsterhunterrage", "subreddit_id": "t5_3a2f0"}, {"author": "monstersandlanguages", "body": "I just find Khezu to be super adorable and fun to beat to death, lol. Capcom nerfed him *hard* in Rise and yet Khezu is still fun to beat to death because now I can fight him without having to think too much. Relaxing, yanno?\n\n\nWouldn't say no to Gigginox replacing Khezu in one or two games, though. 👀 Capcom, plz.", "created_utc": "1645032223.0", "edited": "False", "id": "hx73cen", "is_submitter": "False", "link_id": "t3_su1381", "parent_id": "t3_su1381", "score": "25", "subreddit": "monsterhunterrage", "subreddit_id": "t5_3a2f0"}, {"author": "monstersandlanguages", "body": "It could also be that experienced MH people are saying Rise is so easy, so you have people coming in a bit sloppy to learn the hard way. Barroth is rather unforgiving of sloppy play. And by \"rather unforgiving\", I mean he'll trap you in mud and then play choo-choo train right up your ass for a good chunk of your health. Then, if you're unlucky, you'll be stunned while Barroth gears up to wreck you again while your Palico swigs a potion and your palamute fucking barks.", "created_utc": "1644854961.0", "edited": "False", "id": "hwx734a", "is_submitter": "False", "link_id": "t3_ssb1ui", "parent_id": "t1_hwwpnci", "score": "7", "subreddit": "monsterhunterrage", "subreddit_id": "t5_3a2f0"}, {"author": "monstersandlanguages", "body": "I had to quit reading about halfway through because this person sounds *exactly* like I did about two years ago. It's a deep hole, you have to want out of it, and you have to have a plan for how you'll do it, as well as professional help in some cases. :\\ It's hard to climb out because you're a mix of resentment, depression, apathy, anxiety, self-hatred, and a cocktail of other negative emotions. You know above you is a circle of light. You want it so badly, but at the same time, it's much easier to stay in the muck of your own negativity because it offers a degree of *certainty*. \n\n\nThe light at the end could very well be a train, and it's so far away. Much easier to just stay where you are, hoping someone can save you.\n\n\nYou don't necessarily want to take people down with you...more like you want them to lift you up out of the hole. You lack insight, so some random is unlikely to get to you. Maybe someone trained can help you out, sure. You still have to do the lion's share of the work.\n\n\nIt's such a miserable experience that I hope this is actually just a troll just trying to ruin someone's groove.", "created_utc": "1644735392.0", "edited": "False", "id": "hwr0o3b", "is_submitter": "False", "link_id": "t3_sr94oj", "parent_id": "t1_hwqhu42", "score": "608", "subreddit": "sadcringe", "subreddit_id": "t5_2wsc9"}, {"author": "monstersandlanguages", "body": "Can't win for losing. Loads of people want to cap just to get the quest over with ASAP, and lots of other people want to hunt until they can carve a battered carcass. Flip a coin as to which group you're with at any one point.\n\n\nThey probably assumed no response defaults to kill...while for other people it defaults to cap. Again, you can't win for losing.\n\n\nI played multiplayer a couple times, then went back to solo. It's a lot more fun that way, imo, unless you can arrange it so you can organize play over Discord, and then join a room or whatever together.", "created_utc": "1644710794.0", "edited": "False", "id": "hwpolxf", "is_submitter": "False", "link_id": "t3_sr4xns", "parent_id": "t3_sr4xns", "score": "12", "subreddit": "monsterhunterrage", "subreddit_id": "t5_3a2f0"}, {"author": "monstersandlanguages", "body": "If you don't have a swing-y switch skill that allows you to keep attacking without being knocked down (for most attacks, anyway), and your weapon can't reach Mr. Thunder Dog's head, then you just have to take your time and wait for the openings. Or you can do some fancy wirebug moves to get to the head.\n\n\nHunting Helpers can make the battle less painful if you aren't opposed to using them. They only last for about 10 - 15 seconds, but you can do a lot in that time, especially if you load up on the right ones.\n\n\nI abuse the hell out of Evasion Window with Zinogre, lol. A single Evade Extender slot can help, too. No more than one, though, otherwise you'll end up ten miles from him every time you roll. (Now if you're fighting Almudron or Mizutsune...)", "created_utc": "1644645641.0", "edited": "False", "id": "hwm0qaa", "is_submitter": "False", "link_id": "t3_sqdz0b", "parent_id": "t3_sqdz0b", "score": "3", "subreddit": "monsterhunterrage", "subreddit_id": "t5_3a2f0"}, {"author": "monstersandlanguages", "body": "I like the idea, buuuuut...do I want to associate my new language with blood, poop, and tits?", "created_utc": "1644433505.0", "edited": "False", "id": "hw9fg46", "is_submitter": "False", "link_id": "t3_soji0x", "parent_id": "t3_soji0x", "score": "6", "subreddit": "German", "subreddit_id": "t5_2qq51"}, {"author": "monstersandlanguages", "body": "I wonder if it's in part because, at least in the US, food scarcity isn't as visible a problem as you'd see elsewhere. Food is everywhere--just go buy some more! Why are you rocking the boat? What do you mean you're on a fixed income...? What do you mean you know I'll fire you if you don't get these reports done today, and therefore you can't keep going out AND delivery is expensive...?", "created_utc": "1644428245.0", "edited": "False", "id": "hw913tf", "is_submitter": "False", "link_id": "t3_socrlh", "parent_id": "t1_hw8p8kn", "score": "1", "subreddit": "AmItheAsshole", "subreddit_id": "t5_2xhvq"}, {"author": "monstersandlanguages", "body": "It's weird, 'cause I had the opposite experience with Apex Mizu. Regular Mizu slips-n-slides around like a pissed-off anaconda in a bubblebath. Apex Mizu doesn't bubble and slide around so much because he's too busy using his entire fucking ass to smash you to the thickness of notebook paper. Those Apex bubbles sure hurt a lot if they hit you, though.", "created_utc": "1644350763.0", "edited": "False", "id": "hw4kham", "is_submitter": "False", "link_id": "t3_snpmbh", "parent_id": "t1_hw3zba7", "score": "3", "subreddit": "monsterhunterrage", "subreddit_id": "t5_3a2f0"}, {"author": "monstersandlanguages", "body": "I love Khezu! He's such an adorable monster. :) You made all his cutest features shine here AND drew a wicked cool sword. Great stuff.", "created_utc": "1642710691.0", "edited": "False", "id": "hti794d", "is_submitter": "False", "link_id": "t3_s87oja", "parent_id": "t3_s87oja", "score": "3", "subreddit": "MonsterHunter", "subreddit_id": "t5_2rron"}, {"author": "monstersandlanguages", "body": "Switch Axe in Rise has a Wirebug skill that gives zero fucks about that roar as long as you start the skill in time. Of course, you then end up right in Tigrex's face...\n\n\nI use it on Tigrex all the time and then often end up yeeted across the area, but it's so *fun*. See also: Khezu, Barioth, and Nargacuga. 😂\n\n\nSMACK, SMACK, SMACK, WHEEEE.", "created_utc": "1642547802.0", "edited": "False", "id": "ht8t46h", "is_submitter": "False", "link_id": "t3_s76zxq", "parent_id": "t3_s76zxq", "score": "2", "subreddit": "MemeHunter", "subreddit_id": "t5_3pd0d"}, {"author": "monstersandlanguages", "body": "I am fucking *buried* in plates. I need orbs. How many Almudron, Mizutsune, and Magnamalo do I gotta hunt? Like damn, lol. I'm so desperate, I have two gathering Palicos and switch between slay/capture. JUST GIVE ORBS, GAME, THX.\n\n\nOh, and Rathalos rubies. Plates as far as the eye can see. Not a single frickin' ruby.", "created_utc": "1642437707.0", "edited": "False", "id": "ht20ah4", "is_submitter": "False", "link_id": "t3_s63pjs", "parent_id": "t3_s63pjs", "score": "5", "subreddit": "MemeHunter", "subreddit_id": "t5_3pd0d"}, {"author": "monstersandlanguages", "body": "Maybe. I had to do that for the Ibushi Rampage and I'm glad I did. The first time I did the Ibushi Rampage (on my first save, I mean), it was a stressful nightmare that I won only because I beat the timer. The second time, after warming up with a couple other Rampages, I kicked Ibushi's ass. (There should NOT be that many waves in that particular quest, though.)\n\n\nIn between every Rampage quest, I probably do dozens and dozens of hunts. It's easy to get out of practice.\n\n\nApex Rathian I did two Rampages first, which was overkill--one would have been enough. Apex Arzuros was just one. In any case, needing to grind/warm up isn't all that strange, ig, it just feels way out of place since I don't, f'ex, need to warm up to hunt Narwa or anything.\n\n\nThose Rampage tickets can be dumped into the talisman thingies, too, which I like.", "created_utc": "1642435399.0", "edited": "False", "id": "ht1ue6h", "is_submitter": "False", "link_id": "t3_s5wdsr", "parent_id": "t1_ht1fi4t", "score": "1", "subreddit": "monsterhunterrage", "subreddit_id": "t5_3a2f0"}, {"author": "monstersandlanguages", "body": "My complaint about Rampages is that they are *so* different from MH base game play. So different in fact, that in order to do well at them, you have to farm them, which is the equivalent of rubbing your ass on a cactus. If you don't, you never get the feel for Rampages. Unless you like pleasuring yourself with a cactus, you obviously want to get better.\n\n\nWhich leads to doing stupid shit like this:\n\n\n\"Okay, I need to do the X Rampage. Hurray....\"\n\n\nStep 1: Do a village Rampage\n\n\nStep 2: Do a low-rank Hub Rampage (sometimes I just jump right to HR)\n\n\nStep 3: Do an Apex Rampage (sometimes I just do a regular HR Rampage)\n\n\nStep 4: Do the actual fucking X Rampage.\n\n\nRepeat every time you have to do a Rampage.\n\n\n---------\n\n\nIf I feel fairly confident, then I might skip the Hub LR. If I got diced in the village, though, I feel like I *have* to do the LR in the Hub.\n\n\nWhat I've found doing this is Rampage. . . isn't . . . terrible? It feels 100% out of place in a goddamn Monster *HUNTER* game, but there's a certain flow to it. Ex: place your manned installations near gates, knock down the fucking flying things first if you can, guard if in doubt, use the right ammo at the right time, complete Rampage quests, have good Palicos, focus on the gate crashers as much as possible, etc.", "created_utc": "1642401117.0", "edited": "False", "id": "ht0bzxj", "is_submitter": "False", "link_id": "t3_s5wdsr", "parent_id": "t3_s5wdsr", "score": "8", "subreddit": "monsterhunterrage", "subreddit_id": "t5_3a2f0"}, {"author": "monstersandlanguages", "body": "Agreed. This one scared me shitless but also kind of broke my heart despite the offensive memes. This is one of those situations where you're sort of relieved the nominee was awarded, because the alternative is much, much worse. \n\n\nNot only would it be painful and terrifying to be in Buck's situation, there would also be long, long periods of existential boredom and loneliness, because you're trapped, you can scarcely speak, and everyone around you is so eager for things to \"be okay again\" that they can't consciously register that something very fucked up is happening before their very eyes.\n\n\nAll Buck had to do was get a few shots and this probably wouldn't have happened. Might he have caught Covid and ended up a long hauler? Yeah, sure. Would he have been paralyzed and, now, dead? Probably not.", "created_utc": "1642134833.0", "edited": "False", "id": "hsl618i", "is_submitter": "False", "link_id": "t3_s3f5lu", "parent_id": "t1_hskm9jt", "score": "138", "subreddit": "HermanCainAward", "subreddit_id": "t5_35e6ns"}, {"author": "monstersandlanguages", "body": "Gronkh is awesome! I also like Schauerland a lot.", "created_utc": "1642097703.0", "edited": "False", "id": "hsimffq", "is_submitter": "False", "link_id": "t3_s30b0i", "parent_id": "t1_hshm73z", "score": "3", "subreddit": "German", "subreddit_id": "t5_2qq51"}, {"author": "monstersandlanguages", "body": "Wow, I've been reading it as \"lag-in-apple\".\n\n\nI also recently realized that \"Escuregot\" is a pun off of \"escargot\" and therefore should NOT be pronounced \"es-koo-reh-goht\". 🤦", "created_utc": "1642089463.0", "edited": "False", "id": "hsi05ka", "is_submitter": "False", "link_id": "t3_s316zv", "parent_id": "t3_s316zv", "score": "40", "subreddit": "MonsterHunter", "subreddit_id": "t5_2rron"}, {"author": "monstersandlanguages", "body": "I'm always so impressed by people who can pull off these moves. I just don't have the dexterity and sense of timing, lol. So I just use swag axe like a hammer until I can activate sword mode.\n\n\nAlso, Goss rocks! Love the pacing of his fight and watching people beat the crap out of him. ;)", "created_utc": "1641920816.0", "edited": "False", "id": "hs890ay", "is_submitter": "False", "link_id": "t3_s1dbkf", "parent_id": "t3_s1dbkf", "score": "3", "subreddit": "MonsterHunter", "subreddit_id": "t5_2rron"}, {"author": "monstersandlanguages", "body": "It's a psychological defense. \"Oh, I wasn't an idiot. This was my DESTINY. I'm IMPORTANT.\" She can have a little of this defense (as a treat!) if she doesn't spew any more HCA-worthy bullshit.", "created_utc": "1641861956.0", "edited": "False", "id": "hs531bx", "is_submitter": "False", "link_id": "t3_s0mlem", "parent_id": "t1_hs3ndt7", "score": "26", "subreddit": "HermanCainAward", "subreddit_id": "t5_35e6ns"}, {"author": "monstersandlanguages", "body": "Yes! I've tried to explain this to several people, but they seem to think that the immune system works in a finger snap. I wish more people would understand that it doesn't, that it takes time to build immunity.\n\n\nI also wish more of these anti-vaxxers understood that you can have a great immune system--impervious to lots of stuff that seems to knock everyone else down--, but if something it has no idea how to handle comes in, it's going to scramble and struggle. It's the difference between knowing the alien invasion is coming and preparing vs having to rally the troops, then rebuild a destroyed society.", "created_utc": "1641828770.0", "edited": "False", "id": "hs2n8dk", "is_submitter": "False", "link_id": "t3_s0k9jb", "parent_id": "t1_hs2ml3f", "score": "12", "subreddit": "HermanCainAward", "subreddit_id": "t5_35e6ns"}, {"author": "monstersandlanguages", "body": "Alas, I doubt they think that far. If they did, there'd only be a handful of posts to this sub per week.", "created_utc": "1641828570.0", "edited": "False", "id": "hs2mq80", "is_submitter": "False", "link_id": "t3_s0k9jb", "parent_id": "t1_hs2m967", "score": "23", "subreddit": "HermanCainAward", "subreddit_id": "t5_35e6ns"}, {"author": "monstersandlanguages", "body": "The \"I have an immune system!\" thing annoys me more and more because these people have never considered things like, \"what if my immune system conks out on me?\", or, \"what if it's not sufficient for this virus?\" Or even, \"what does 'I have an immune system' entail? Am I going to be puking like the Exorcist or pissing blood or?\"\n\n\n\"Do I want to feel like extra shit while my immune system is trying to do its thing?\" Anybody who's experienced an immune system that malfunctioned or needed extra help to win a fight knows how bad the process *sucks*. *Any*thing that can help you out before it gets to that point is very much welcome.\n\n\nI mean, I understood the people who held off a couple months when the vaxx first came out. It's not a super new technology, but not ubiquitous. It wasn't 100% unreasonable to watch what happened to the braver people. \n\n\nIn retrospect, I can almost understand anti-masking the first couple months into the pandemic. Know that meme showing the different masks like for paint, radiation, etc, and then the cloth/surgical mask? It does make you think, and your thoughts should have lead you to do a little more Googling about masks. (And yes, I know N95 masks are the gold standard, not others. I'm going off the meme.) From there, you see the data. Maybe it's not as perfect as you'd like, but it's there and every bit helps.", "created_utc": "1641827623.0", "edited": "False", "id": "hs2kce6", "is_submitter": "False", "link_id": "t3_s0k9jb", "parent_id": "t1_hs27syg", "score": "214", "subreddit": "HermanCainAward", "subreddit_id": "t5_35e6ns"}, {"author": "monstersandlanguages", "body": "Yep, Viagra is only a supportive therapy and the big wig med folk still aren't sure about it. Here's a link I think will be interesting to our more medically-inclined folks: https://pubmed.ncbi.nlm.nih.gov/34980198/. I'm not expert at reading through these studies, but it looks like Viagra might be a reasonable thing to drop into a doctor's toolbox. Not a miracle drug, just something that might be helpful.\n\n\nThen you have Mr I-May-Have-Started-Out-Well-Meaning-Like-A-Big-Puppy-But-I-Am-Just-Really-Fucking-Stupid reporting like this is some big thing discovery. As far as I can tell, there is a SINGLE report of Viagra working miracles. ONE. Come back when it's at least a few thousand.", "created_utc": "1641692047.0", "edited": "False", "id": "hrusr1i", "is_submitter": "False", "link_id": "t3_rzb5kn", "parent_id": "t1_hru69t1", "score": "8", "subreddit": "HermanCainAward", "subreddit_id": "t5_35e6ns"}, {"author": "monstersandlanguages", "body": "For me, there's so many!\n\n\nKhezu -- super cute monster that's fun to beat to death, lol. I will say they nerfed him *hard* from MHGU.\n\n\nAlmudron -- I know I'm in the minority, but let me slap on an anti-muck deco or two and I'm in love. Big Al keeps you moving and responding constantly. His tail sever is, hands down, probably THE MOST satisfying sever in the game.\n\n\nMizutsune -- I spend half the time trying to hit him, but he's so darn fun to watch! Love his roar and music, too.\n\n\nChameleos -- Super satisfying breaks and topples. Slot in full poison/venom resistance and you've basically neutered him, tho.\n\n\nZinogre -- Love smacking his face when he's gathering fulgurbugs. His moveset is freaking schweet, too. (I could live without his Apex version unless Capcom gives us some Apex-specific armor. In which case...BRING IT ON.)\n\n\nRathalos -- they really improved the pacing of Rathalos's fight in Rise. Sometimes you get unlucky and get AI that stays in the air way too much. That sucks butt.\n\n\nHonorable mentions:\n\n\nThe \"gimme\" monsters like Arzuros, Great Izuchi, Great Baggi, etc. -- Sometimes I just wanna break something's face without much thought or effort. These guys are perfect for it. Just zone out, swing, maybe gulp a potion here and there. Good stuff.", "created_utc": "1641687013.0", "edited": "False", "id": "hrugr6f", "is_submitter": "False", "link_id": "t3_rz61s2", "parent_id": "t3_rz61s2", "score": "4", "subreddit": "MonsterHunter", "subreddit_id": "t5_2rron"}, {"author": "monstersandlanguages", "body": "I've been trying to figure out exactly *how* I feel about this sort of thing. While I don't feel terrible for most HCA nominees/winners, I don't feel *satisfaction* from their fates, either. (There are a couple of exceptions, like the nasty FROG dude. There are some kinds of people we need less of in the world.)\n\n\nIt's more like the intersection of intense frustration (\"you're screwing us all over!\") and bitter defeat (\"I'm not sure what you expected at this point\") and maybe even some kind of sadness (\"hey, you know you left a lot of people behind who cared about you...\"). \n\n\nIt's not, \"haha, you're dead, moron!\" No, it's, \"*sigh* alright, let's tag 'em and slab 'em quick. More are coming. All this for lack of a couple of pokes....\"\n\n\nIt's a deadpan, dispassionate feeling, like looking down at a massive garbage dump, wishing you could do something before all that trash poisons the water table, and knowing you're powerless.\n\n\nAs an aside to all anti-vaxxers wringing their hands over \"cruel comments\", you of all people should know this is the internet. That's how things work here. If you're an anti who doesn't want \"cruel comments\" (ie: legitimate criticism of your unwise choices), then it's best to stay off social media, hope you don't catch Covid, and, if you do, please pass away quietly and peacefully at home surrounded by your horse paste and boiled citrus peels.", "created_utc": "1641588286.0", "edited": "False", "id": "hroqgyl", "is_submitter": "False", "link_id": "t3_ryct6l", "parent_id": "t1_hro62vb", "score": "167", "subreddit": "HermanCainAward", "subreddit_id": "t5_35e6ns"}, {"author": "monstersandlanguages", "body": "I never hated it, but had mixed feelings when I began to learn it. It sounded discordant with weird rules.\n\n\nNow that it's not completely foreign to my ears, German sounds so romantic! A little short on the English-styled expressiveness I'm used to, but still a very nimble, useful language. (And Zangen(?)deutsch is funny. Fight me!) Children's stories in German are somehow more charming than in English, too. The dokus are usually better as well. I honestly wouldn't mind living in a place like Germany if I had something more to offer a new country. :)\n\n\nGerman grammar is as orderly and sane as you can get with a natural language. Wish all you German folks would drop the genitive tense already. ;) Dative is painful enough, lol! I know, I know, it's not going anywhere.", "created_utc": "1641514986.0", "edited": "False", "id": "hrkg681", "is_submitter": "False", "link_id": "t3_rxnd87", "parent_id": "t3_rxnd87", "score": "15", "subreddit": "German", "subreddit_id": "t5_2qq51"}, {"author": "monstersandlanguages", "body": "Oh no. :( Best wishes for your sister. I unfortunately have nothing else I can offer her.\n\n\nI wouldn't mind \"Covid sanatoriums\". But then the hard questions come in. Who's going to work at these places? How are you going to measure patient outcomes when you're essentially sending people to hospice? How are you going to fight the appearance of \"unfairness\" or being a \"c0mmie\"?\n\n\nThere's no easy answers. :( They all suck, some just suck more than others.", "created_utc": "1641506616.0", "edited": "False", "id": "hrjue3l", "is_submitter": "False", "link_id": "t3_rxizzt", "parent_id": "t1_hrjq4uk", "score": "26", "subreddit": "Coronavirus", "subreddit_id": "t5_2x4yx"}, {"author": "monstersandlanguages", "body": "I probably could. Seeing how rarely I need a neb treatment, it would be something of a waste financially. Then again, in the age of Covid-clogged medical facilities, it might be good investment in other senses.", "created_utc": "1641506430.0", "edited": "False", "id": "hrjtvef", "is_submitter": "False", "link_id": "t3_rxizzt", "parent_id": "t1_hrjpwh7", "score": "16", "subreddit": "Coronavirus", "subreddit_id": "t5_2x4yx"}, {"author": "monstersandlanguages", "body": "And doctor's appointments, and UC clinic space, and....\n\n\nI had an asthma flare-up on Monday. It took *four tries* to find a UC that could treat me (my pulmonologist was out and no other doc could squeeze me in). So I almost ended up in the ER. I'd already tried to wait it out a day and my sats were 5% lower than normal at 90%. Borderline emergency for an asthmatic.\n\n\nThe first place I went to had a 3-hour wait time. The parking lot was jam-packed. Many of the cars had a slip of paper with the phrase C-19 visible from the windshield--all of these people had symptoms or needed tests.\n\n\nThe next two UCs told me they were simply overwhelmed and recommended the ER.\n\n\nThe last place almost didn't take me until I mentioned trouble breathing and asthma. They squeezed me in last-minute, gave me a neb treatment + some corticos. Still feeling a bit crappy, but a follow-up with the pulmo shows improved sats and airflow. \n\n\nI told my pulmo that my goal was to stay out of the hospital for all of 2022. She got real serious and told me to stay on top of my asthma and to call the office if I feel even a little crummy. Apparently, she's had more than a couple asthma patients go to the ER and not come back...some vaccinated, some not. :(\n\n\nBecause people can't be fucked to take a couple shots, the rest of us suffer. Mine was a minor case. What about the poor bastards who need \"elective\" surgery for their cancer or whatever? Or the diabetics who need amputations/special wound treatment? What happens if you have a severe asthma attack?", "created_utc": "1641494898.0", "edited": "False", "id": "hriyet0", "is_submitter": "False", "link_id": "t3_rxizzt", "parent_id": "t1_hrigge5", "score": "571", "subreddit": "Coronavirus", "subreddit_id": "t5_2x4yx"}, {"author": "monstersandlanguages", "body": "Have asthma, can confirm.\n\n\nIt's not just the air hunger, either. It's the achy chest, the creeping brain fog, the famished-but-no-appetite feeling, the sense of impending doom, the noise as your airways tighten...there's that primal part of you that knows you're in a trouble and hopes there's a way out.\n\n\nETA: You don't get any breaks from it, either, until it's treated. Good luck sleeping, or relaxing on the couch, or curling up with a good book, or...", "created_utc": "1641489237.0", "edited": "False", "id": "hriivj6", "is_submitter": "False", "link_id": "t3_rx7cwe", "parent_id": "t1_hrhkxt3", "score": "39", "subreddit": "HermanCainAward", "subreddit_id": "t5_35e6ns"}, {"author": "monstersandlanguages", "body": "That's my attitude, too! You want a comfort cure on top of your vaccines and masks? Have at it. Pray, drink ginger tea, rub garlic on your asshole--who cares? And hey, maybe, depending on what you use, you get a teeny-tiny boost on top of what you get from vaccines and your masks.", "created_utc": "1641485505.0", "edited": "False", "id": "hri8rnc", "is_submitter": "False", "link_id": "t3_rxgngy", "parent_id": "t1_hri3ola", "score": "17", "subreddit": "HermanCainAward", "subreddit_id": "t5_35e6ns"}, {"author": "monstersandlanguages", "body": "I feel like a lot of people have forgotten what a god (or gods?) really is and that drives some of this inane, dishonest behavior. A lot of people see gods (or, let's be clear here, God in the Christian sense) as a miracle-dispensing sky fairy instead of a primordial, mysterious power that can be described in a multitude of ways. Not only that, said being is not anthropocentric--to a god, humans are just one part of the equation of the entire universe.\n\n\nIt's kinda why I like the idea of polytheism a lot and would be a polytheist if I ever decided to go the \"spiritual\" route. Most polytheists are pretty honest: \"yeah, I worship this god and love them for XYZ reasons, but sometimes they're a total dick and we have the stories to prove it.\" We can debate over whether or not it's worth worshipping something/one that can be described as a \"total dick\", but it's intellectually *honest*.\n\n\nYou also hear, in polytheist circles, a lot of people pointing out that their gods have other shit to do than listen to a bunch of prayer warriors and dispense favors like a vending machine. If the gods' big plans include a tidal wave to recalibrate the lifestream or whatever, you just better fucking hope you're not in the wrong place at the right time or woop. There you go.\n\n\nSome will also point out that god/s is like a sysadmin with a bunch of other priorities. If you're a good sysadmin, you're going to write programs that can catch errors and deal with unusual states as much as possible so you're not constantly baby-sitting everything. So, yanno, we get doctors and vaccines, or mechanics, or any number of other specialities.\n\n\nSpeaking of sysadmins, a god/s of choice is limited by the \"system\" they've created. They've got root powers, but that doesn't mean they can do something that's beyond the system. So once you get rolled into the ER with Covid-shredded wheat lungs, wtf do you expect to happen? Maybe a self-correcting program can help you, or maybe you go to the celestial bit bucket.", "created_utc": "1641443862.0", "edited": "False", "id": "hrg841a", "is_submitter": "False", "link_id": "t3_rwyqcv", "parent_id": "t1_hrezdlm", "score": "6", "subreddit": "HermanCainAward", "subreddit_id": "t5_35e6ns"}, {"author": "monstersandlanguages", "body": "In the past few years I've noticed devs doing more \"devops-y\" work via a platform like AWS. Everything's on the cloud and the division between \"regular devs\" and \"ops/sysadmin\" (sysadmin only to a degree) has become a lot less clear. \n\n\nNot only that, I've also noticed that \"backend engineer\" has come to encompass...a lot. Yeah, I've done backend Java, Python, and Scala, but I've also adminned NoSQL DBs, configured proxies between client and server, been the front-runner for Docker/K8s, written \"infrastructure as code\" (ie: Terraform), and more I'm not remembering in just the past four years.\n\n\nJust sign up on AWS and do a few tutorials so you can at least claim to know the basics. The details can be a huge pain in the ass, but you should be able to pick up the basics on a whole bunch of things in just a couple hours. The AWS site itself also has a bunch of fairly watchable study videos you should look at.", "created_utc": "1641429978.0", "edited": "False", "id": "hrfifsf", "is_submitter": "False", "link_id": "t3_rww7ai", "parent_id": "t3_rww7ai", "score": "16", "subreddit": "ExperiencedDevs", "subreddit_id": "t5_e0gez"}, {"author": "monstersandlanguages", "body": "I see a pulmonologist regularly. She's got me on allergy drops. It's been two or three years and the difference is immense. It hasn't \"cured\" me, though. :( I have a huge amount of allergies and sensitivities. Super unfortunate, but them's the breaks. You do your best and hope that stacks the deck more in your favor.\n\n\nAnd yup, everyone in my life knows there are exactly five places where my emergency inhaler might be (in order of likelihood): pocket, purse/backpack, on work desk, nightstand next to bed, table next to couch. I live in mortal fear of \"the big one\", so I'm attached to that little red inhaler, lol.", "created_utc": "1641339767.0", "edited": "False", "id": "hra5c16", "is_submitter": "False", "link_id": "t3_rvksz0", "parent_id": "t1_hr9wr8u", "score": "5", "subreddit": "HermanCainAward", "subreddit_id": "t5_35e6ns"}, {"author": "monstersandlanguages", "body": "This does give me some hope! I definitely follow my doctor's instructions, avoid triggers as much as possible, and wear a mask outside when there's a lot of pollen or other triggers.\n\n\nIt sounds like your dad was able to do a lot despite his asthma. That's so wonderful. :)", "created_utc": "1641308307.0", "edited": "False", "id": "hr7wp1j", "is_submitter": "False", "link_id": "t3_rvksz0", "parent_id": "t1_hr7sp1o", "score": "23", "subreddit": "HermanCainAward", "subreddit_id": "t5_35e6ns"}, {"author": "monstersandlanguages", "body": "Major denial. Give it a long, long, loooooong time to set in. This is pretty normal when you develop chronic health issues. For example, when I developed asthma at 18, it took me almost two years to accept that yes, this is my life now, the meds basically control it, but I'm still probably gonna die early from damage to my airway.\n\n\nCan't even imagine what it's like when your chronic conditions may have been caused by being a numbnut.", "created_utc": "1641302914.0", "edited": "False", "id": "hr7l8sp", "is_submitter": "False", "link_id": "t3_rvksz0", "parent_id": "t1_hr6uru1", "score": "46", "subreddit": "HermanCainAward", "subreddit_id": "t5_35e6ns"}, {"author": "monstersandlanguages", "body": "Terminal lucidity (ie: the \"rallying cry\"). A few hours to a few days before death, some people have a HUGE improvement in their mental and physical state. You may even think they're going to be fine! The prayers/ivermectin/experimental treatments/etc are working!\n\n\nAnd then death comes.\n\n\nAnd later, when you learn about \"terminal lucidity\", you realize you threw away the last chance you had to say goodbye.\n\n\nI guess, in a way, it's fortunate that these loons will never have that moment of clarity and so will never feel that stab of regret.", "created_utc": "1641258647.0", "edited": "False", "id": "hr5gbdz", "is_submitter": "False", "link_id": "t3_rvf1ah", "parent_id": "t1_hr51ifh", "score": "11", "subreddit": "HermanCainAward", "subreddit_id": "t5_35e6ns"}, {"author": "monstersandlanguages", "body": "What a terrible day to be literate.", "created_utc": "1641004300.0", "edited": "False", "id": "hqre46a", "is_submitter": "True", "link_id": "t3_rt8ld5", "parent_id": "t1_hqrc6fl", "score": "30", "subreddit": "monsterhunterrage", "subreddit_id": "t5_3a2f0"}, {"author": "monstersandlanguages", "body": "I had terrible side effects from all three shots that knocked me out for about a day/day and a half and I agree that the actual disease is worse if you face it without the vaccine. (I had a breakthrough case and *THAT* was like having \"just the flu\"...so it sucked, but even with my asthma I was able to just rest at home.) The more you read about what Covid does to the entire body, the more you want to protect yourself however you can.\n\n\nPfizer as well for all three shots. The side effects suuuuuck, but so does respiratory failure, pneumonia, intubation, etc.\n\n\nIt's weird how the body responds to the vaccines in the short term. Some people are just a bit sore. Other people think to themselves, \"I hope to god this is the last one, because I do not want to go through this shit again.\" Virtually everyone will have the same reaction in the long-term: antibodies against Covid that will help you if you catch the real thing.", "created_utc": "1641004212.0", "edited": "False", "id": "hqrdxrj", "is_submitter": "False", "link_id": "t3_rt5u13", "parent_id": "t1_hqr0j9j", "score": "9", "subreddit": "HermanCainAward", "subreddit_id": "t5_35e6ns"}, {"author": "monstersandlanguages", "body": "Something like: \"your rights end where my rights begin.\" You have a right not to wear a mask, ig, but we have a right not to want to be around you when there's an active pandemic.\n\n\nImagine having your tantrum recorded on bodycam and enshrined on the internet for eternity, lol. The rules are pretty fucking clear. Wear the mask or gtfo. Fair enough if you wanna gtfo, but maybe do that *before* you end up with a criminal record.\n\n\nAnd was this lady complaining about wait times? How much you wanna bet at least half the wait time was fighting with idiots like her? Yeesh.", "created_utc": "1640997796.0", "edited": "False", "id": "hqr0ig0", "is_submitter": "False", "link_id": "t3_rt0uhx", "parent_id": "t1_hqq5eqz", "score": "1", "subreddit": "iamatotalpieceofshit", "subreddit_id": "t5_3jj03"}, {"author": "monstersandlanguages", "body": "GEAR, YES. OMG. Especially for Apex monsters, but at this point, I'll take just about anything other than stickers, skins, and gestures for event quest rewards. Can we at least have a powerful talisman? That takes zero effort to code in, ffs.\n\n\nI'll agree to Molten and Lucent if I can have Seregios and Gore Magala. ;) (Oh, if only I had control of decisions at Capcom....)", "created_utc": "1640907271.0", "edited": "False", "id": "hqm29i6", "is_submitter": "False", "link_id": "t3_rsc356", "parent_id": "t1_hqljb50", "score": "7", "subreddit": "monsterhunterrage", "subreddit_id": "t5_3a2f0"}, {"author": "monstersandlanguages", "body": "The only reason I had Ratha in my team by the time I fought Oltura is because you weren't actually allowed to remove him from your team until post-game!\n\n\nMy Stygian Zinogre and Ivory Lagiacrus waffle-stomped Oltura.\n\n\nI'm still so salty about how they handled Ratha! Ratha should be the strongest monster you can get in the game, unlocked in stages, with the Oltura fight being close to fully unlocked. Afterwards, you should be able to complete other quests, unlock Ratha's full power, then kick the shit out of Fatalis.", "created_utc": "1640892929.0", "edited": "False", "id": "hql282y", "is_submitter": "False", "link_id": "t3_rs33nl", "parent_id": "t3_rs33nl", "score": "13", "subreddit": "MemeHunter", "subreddit_id": "t5_3pd0d"}, {"author": "monstersandlanguages", "body": "Ew, anti-vaxxer", "created_utc": "1640800753.0", "edited": "False", "id": "hqfpxm8", "is_submitter": "False", "link_id": "t3_rr89bo", "parent_id": "t1_hqfodey", "score": "14", "subreddit": "Coronavirus", "subreddit_id": "t5_2x4yx"}, {"author": "monstersandlanguages", "body": "Same here. :( I've even heard some mutterings that we have yet another booster coming 'round the bend just based on what some other countries are doing.\n\n\nEvery time I taken the vax, I always have a miserable day and a half: chills, muscle aches, skin aches, headache, neck ache, nausea, fatigue...I screwed up yesterday's booster and ended up with legs that hurt so bad I couldn't even sleep.\n\n\nI mean, if there's another booster, I'll get it, but I'm not required to like it, lol. Just so tired of feeling like shit and then listening to my anti-vax mother tell me that means the vax isn't working. (Just be glad she's retired--she was a nurse.)\n\n\nFingers crossed for 2022! This is honestly getting ridiculous (and really painful)--in more than one sense.", "created_utc": "1640799033.0", "edited": "False", "id": "hqflfnx", "is_submitter": "False", "link_id": "t3_rr89bo", "parent_id": "t1_hqepie1", "score": "15", "subreddit": "Coronavirus", "subreddit_id": "t5_2x4yx"}, {"author": "monstersandlanguages", "body": "Mine's been fucked for years now. You get used to the dissociation. Set timers, write yourself some notes, and try to introduce some structure into your life so you don't wake up, eat breakfast, and then all of a sudden it's time to go to bed again.", "created_utc": "1640491964.0", "edited": "False", "id": "hpzogbq", "is_submitter": "False", "link_id": "t3_rofys2", "parent_id": "t1_hpy47x0", "score": "8", "subreddit": "Coronavirus", "subreddit_id": "t5_2x4yx"}, {"author": "monstersandlanguages", "body": "This is SO GOOD. Love the pixel shading and all the little animation details.\n\n\nHave you done Seregios before?", "created_utc": "1639861250.0", "edited": "False", "id": "hp39m6k", "is_submitter": "False", "link_id": "t3_rixf6a", "parent_id": "t3_rixf6a", "score": "1", "subreddit": "MonsterHunter", "subreddit_id": "t5_2rron"}, {"author": "monstersandlanguages", "body": "Sending you well wishes!\n\n\nI caught a breakthrough case about three weeks after my second vax. Woke up with what felt like a red, raw lump in my throat, and quickly got a low-grade fever with body aches. The second day, I got tested. When the results came back, yup, it was Covid.\n\n\nSpent about a week like that. Nearly ended up with chest congestion (very dangerous for an asthmatic). So I took cough syrup 3x a day for about a week and that solved it. Can't let that shit build up in your lungs or you're in for a bad time.\n\n\nAfter getting the flu shot (which laid me out for a day and a half with nausea, arm pain, chills, and body aches), I can say the Covid was more mild, lol. The vaccine ain't perfect, but boy does it stack the deck in your favor.", "created_utc": "1639669331.0", "edited": "False", "id": "hosi5ou", "is_submitter": "False", "link_id": "t3_rgoeq4", "parent_id": "t1_holr2hg", "score": "1", "subreddit": "HermanCainAward", "subreddit_id": "t5_35e6ns"}, {"author": "monstersandlanguages", "body": "This is what frustrates me about Apexes the most. I'm hoping Sunbreak will come out with some armor or *something* for fighting these things. I've enjoyed fighting most of them (not you, Zinogre), but really wish my time and effort was rewarded a bit more, lol.\n\n\nThe Apexes aren't a *terrible* idea. What they are is terribly executed. I would love for Apex Mizu/Zino armor. Or even if the event quests/Apex Rampages gave out \"Apex Vouchers\" which you can use to power up your weapons or add some sort of effect for your armor (ex: Flinch Free for the multiplayers, or maybe an extra boost to Fire Attack, or whatever). Surely *that* couldn't be an excessive amount of effort to program in, Capcom? Since we already have Ramp Up?\n\n\nCapcom: lmao, here's a sticker. Good job, hunter!", "created_utc": "1639666918.0", "edited": "False", "id": "hoscan0", "is_submitter": "False", "link_id": "t3_rhs1rl", "parent_id": "t3_rhs1rl", "score": "16", "subreddit": "monsterhunterrage", "subreddit_id": "t5_3a2f0"}, {"author": "monstersandlanguages", "body": "Unless OP is in really, really bad shape, they're unlikely to get disability for just autism anyway.\n\n\nThat said, I hope OP gets an official diagnosis and maybe some professional support to help them learn coping skills to navigate this super noisy, at-times-overwhelming world. \n\n\nOP sounds suited for office work. Maybe nightshift work at a chill shop. Something slower-paced with fewer lights, noises, smells, etc. There are plenty of jobs like that out there. Sometimes they even pay well (quite a few pay well if you get training/education).", "created_utc": "1638989777.0", "edited": "False", "id": "hnr2b9a", "is_submitter": "False", "link_id": "t3_rbl945", "parent_id": "t1_hnoxc6l", "score": "28", "subreddit": "AmItheAsshole", "subreddit_id": "t5_2xhvq"}, {"author": "monstersandlanguages", "body": "Aw, darn. I'm just getting started, so I can wait 'til the next update (or downgrade Anki when the time comes). Thanks for your help!", "created_utc": "1638819688.0", "edited": "False", "id": "hnhx7e7", "is_submitter": "False", "link_id": "t3_r9t7jm", "parent_id": "t1_hnhrx8u", "score": "1", "subreddit": "LearnJapanese", "subreddit_id": "t5_2qyls"}, {"author": "monstersandlanguages", "body": "Anyone else having problems installing the Migaku Japanese add-on to Anki on Mac Catalina? I get this error:\n\n\n*278530045: Invalid code, or add-on not available for your version of Anki.*\n\n\nThe code is directly from the Migaku page. My Anki version is  ⁨2.1.49. My understanding is anything 2.1+ should work.", "created_utc": "1638817343.0", "edited": "False", "id": "hnhr960", "is_submitter": "False", "link_id": "t3_r9t7jm", "parent_id": "t3_r9t7jm", "score": "1", "subreddit": "LearnJapanese", "subreddit_id": "t5_2qyls"}, {"author": "monstersandlanguages", "body": "This is one of those posts where you're ready to give OP a little slack since he was posting to a vent sub and the situation sounds frustrating (if very typical). \n\n\nBut by the third paragraph, holy shit. The dude just...I mean...there are so many words to use here, none of them nice. Dude needs to be single for a LONG time while he works his shit out. Maybe single permanently. I want to say maybe he should find a childfree woman, but I can't imagine this guy is a winner in general, so maybe single is best.", "created_utc": "1638816541.0", "edited": "False", "id": "hnhp739", "is_submitter": "False", "link_id": "t3_ra76rs", "parent_id": "t1_hnh685z", "score": "181", "subreddit": "NoahGetTheBoat", "subreddit_id": "t5_117wt6"}, {"author": "monstersandlanguages", "body": "Capcom tried to make Stories feel like World, Rise, etc., and yeah, that doesn't work in an RPG format. At the very least, they need to scale back the HP on some of the high-rank monsters *a lot* and reduce either the accuracy or damage of stuff like Goldie's venom tail, Soulsucker's Foxflame, etc to around 50% or something.\n\n\nI can confirm that leveling up only helps a tiny bit, which is also odd from an RPG perspective. Some RPGs *do* limit how much you can level (PS4's Dragon Age comes to mind) but the enemies are appropriately scaled. I would not call anything past rank 7 appropriately scaled in MHST, lol.", "created_utc": "1638802562.0", "edited": "False", "id": "hngqahi", "is_submitter": "True", "link_id": "t3_r9yhto", "parent_id": "t1_hnfxmsn", "score": "2", "subreddit": "monsterhunterrage", "subreddit_id": "t5_3a2f0"}, {"author": "monstersandlanguages", "body": "That's how I feel, too. And it's so agonizingly slow. In the mainline games, that fifteen minutes feels like five because you're so damn busy. In the RPG, it feels more like thirty.", "created_utc": "1638802143.0", "edited": "False", "id": "hngpc0c", "is_submitter": "True", "link_id": "t3_r9yhto", "parent_id": "t1_hnga2yg", "score": "6", "subreddit": "monsterhunterrage", "subreddit_id": "t5_3a2f0"}, {"author": "monstersandlanguages", "body": "Hallo, fellow German learner!\n\n\nI do it quite a bit, though try to limit it to stuff I'm fairly confident is somewhat correct.\n\n\nMostly, I do it to practice certain phrases/phrase patterns and to drill difficult vocab. It's helped so much with vocab that I will continue doing this when I learn my third language. :) Didn't get as much mileage out of phrase/phrase patterns (except memorizing them), but I *have* noticed some improvements in accusative and dative case since I often end up thinking about which to use and then Googling it to make sure, lol.", "created_utc": "1638286718.0", "edited": "False", "id": "hmo8abk", "is_submitter": "False", "link_id": "t3_r5pa0q", "parent_id": "t3_r5pa0q", "score": "4", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "monstersandlanguages", "body": "Oh, I fucking hate that bastard. That little fuck has KO'd me more than many ELDER DRAGONS HAVE. I'd rather fight fucking Molten Tigrex at this point. \n\n\nYou end up idling during the Soulsucking fight with your monstie, Reverto, and a prayer. Oh, and five bajillion healing items. Dust of Life the moment these dumb fucks are even a little injured. One heart lost? Immediate Ancient Potion or Vital Essence for you.\n\n\nSo basically you don't fight much during Soulsucking Mizutsune. Although if you get lucky enough and time it right, you can knock him down before he launches FoxFlame + Blue Moon and then get another round before you have to tank that shit.", "created_utc": "1638148146.0", "edited": "False", "id": "hmh24x8", "is_submitter": "False", "link_id": "t3_r49z1m", "parent_id": "t3_r49z1m", "score": "3", "subreddit": "monsterhunterrage", "subreddit_id": "t5_3a2f0"}, {"author": "monstersandlanguages", "body": "I had one person who'd \"been there since the first release\" who said I'm not an \"actual fan\" of MH because I haven't played anything before MHGU and kinda prefer the Stories side franchise a little more. (Nothing against the main line games. I just really like RPGs.)\n\n\nI've also met quite a few who've given me tips, offered to team up with me, etc. It's such a crapshoot out there sometimes. It's the nature of online gaming, probably. Some people seem to create their entire personality around their game of choice and develop a superiority complex from there.", "created_utc": "1637949619.0", "edited": "False", "id": "hm6fp29", "is_submitter": "False", "link_id": "t3_r2s91t", "parent_id": "t3_r2s91t", "score": "10", "subreddit": "monsterhunterrage", "subreddit_id": "t5_3a2f0"}, {"author": "monstersandlanguages", "body": "That's a good point. I do seem to remember seeing Fläche somewhere in one of my more recent Anki reviews, actually. I've got the Goethe word lists for A1 and A2 on top of my own deck.", "created_utc": "1637735303.0", "edited": "False", "id": "hlvdq4x", "is_submitter": "True", "link_id": "t3_r0vf6y", "parent_id": "t1_hlvdiv9", "score": "2", "subreddit": "German", "subreddit_id": "t5_2qq51"}, {"author": "monstersandlanguages", "body": "Makes sense. So far, my approach has been to pick anything with a 4+ score because the ultimate goal is to be able to read and listen to a wide variety of texts, shows, etc. \n\n\nIf I don't find a way to weed words out, I'll have at least 150 words to add to Anki, and that's being conservative. (I bit off more than I can chew with my current \"project\".)", "created_utc": "1637734644.0", "edited": "False", "id": "hlvco9n", "is_submitter": "True", "link_id": "t3_r0vf6y", "parent_id": "t1_hlvc2r9", "score": "2", "subreddit": "German", "subreddit_id": "t5_2qq51"}, {"author": "monstersandlanguages", "body": "I've noticed the Heute Journal channel on YT often has markings where one report ends and another begins. I might take advantage of that as well as a channel someone else recommended here. :) Thanks!", "created_utc": "1637554610.0", "edited": "False", "id": "hllmuci", "is_submitter": "True", "link_id": "t3_qz4gd3", "parent_id": "t1_hlli1q4", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "monstersandlanguages", "body": "Oh, that makes sense. :) Vielen dank!", "created_utc": "1637528199.0", "edited": "False", "id": "hlk0wss", "is_submitter": "True", "link_id": "t3_qz296t", "parent_id": "t1_hljv2s1", "score": "3", "subreddit": "German", "subreddit_id": "t5_2qq51"}, {"author": "monstersandlanguages", "body": "NTA. If this is how your friend reacts to critique, she was unlikely to make it to publication anyway. Most publishers won't bother with something that isn't pretty much ready for press (though this does vary a lot). Editors don't molly-coddle unless you're gonna make them tons of bucks. Tbh, some of them can kind of be dicks because they have zero time for bullshit, haha.\n\n\n>she's decided to give up writing because I was too harsh.\n\n\nShe didn't decide to give up because you were too harsh. She decided to give up because she realized that writing is actual work.\n\n\nIn the unlikely event she *did* make it to a publisher, and in the likely event some poor soul *did* make less-than-gushing comments on her work, it would then be your fault for not warning her. People like this boil my blood. You cannot win with this kind of person. The only winning move is not to play.\n\n\nWhat does this person add to your life? You should honestly ask yourself that. Then, you should ask if that makes it worth having to walk on eggshells around her.\n\n\nYour friend needs a therapist, not publication.", "created_utc": "1637514302.0", "edited": "False", "id": "hlj21cd", "is_submitter": "False", "link_id": "t3_qyw3wm", "parent_id": "t3_qyw3wm", "score": "4", "subreddit": "AmItheAsshole", "subreddit_id": "t5_2xhvq"}, {"author": "monstersandlanguages", "body": "Jarring to read this story because this is basically how my grandpa died. He had spinal cancer (IN HIS SPINAL CORD, you're welcome in advance for the nightmares) that we think ate through the vertebrae and into the esophagus over an extended period of time. \n\n\nVery early one morning in the hospital, my mom said it was like the exorcist, but with blood. Mom and grandma cleaned him up best as they could before I came, but I could still see some blood on the floor and on the railings of the bed. :( \n\n\nHe passed fairly several hours later. I want to say 100% peacefully, but he was confused, in pain, and probably scared until I asked for morphine. The nurses offered to do a transfusion, but grandpa was already so weak, his mental state was deteriorating, he could barely move his arms and legs, and he was in constant pain. Oh, and he was cold. Stone cold. \n\n\nEveryone said their goodbyes, then I remember numbly asking the nurses if grandpa could have some morphine for his pain. Then I walked down the hospital hallway, and then somehow I ended up at work because I didn't know what else to do. Part of me wishes I'd stayed until the final breath. Part of me knows grandpa would have told me to leave. Man, fuck cancer.\n\n\nI keep thinking about asking for the morphine, how it was the last gift I could give. It was the equivalent of euthanasia and it was both devastating and sort of a relief to be able to put grandpa out of pain like that. I wish we could have caught the cancer earlier. It would have given us more options for care. \n\n\nHe was a good man. He raised me when my shit-tier father walked out on my mom. He tried to get interested in things I was, and we were constant companions until the day he passed. We liked to go on car rides together. Grandpa was a never-ending well of (mostly) good advice, good sense, and good camaraderie. He liked to tell stories. It was always the same stories, but grandpa had them so well-rehearsed it was worth listening again.\n\n\nAnd since it bears repeating: fuck cancer.", "created_utc": "1637260977.0", "edited": "False", "id": "hl5il2o", "is_submitter": "False", "link_id": "t3_qwfer2", "parent_id": "t1_hl2jv6h", "score": "17", "subreddit": "eyeblech", "subreddit_id": "t5_3fhf0"}, {"author": "monstersandlanguages", "body": "For some bizarre, inexplicable reason, when I started learning German, I began mixing up the word lotion with yogurt. And no, \"yogurt\" is not the word for \"lotion\" in German, lol.\n\n\nAlso, sometimes I accidentally say, \"make fun\" (as in: to have fun) because of \"mache spaß\".", "created_utc": "1637042434.0", "edited": "False", "id": "hktlz0v", "is_submitter": "False", "link_id": "t3_qv0dei", "parent_id": "t3_qv0dei", "score": "28", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "monstersandlanguages", "body": "Oooo, super helpful. I've got a lot to learn! Thanks for these phrases. They'll be among the phrases to make it into my Anki deck. :)", "created_utc": "1637041154.0", "edited": "False", "id": "hktjwtg", "is_submitter": "True", "link_id": "t3_quy6vw", "parent_id": "t1_hkthqvj", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "monstersandlanguages", "body": "It does help a lot, especially for words like gar, where knowing the exact definition has turned out to be less than helpful! I'll suspend gar for awhile and then change it so it's spread out over a few cards that are mainly phrases. :) Thanks!", "created_utc": "1637041104.0", "edited": "False", "id": "hktjtwi", "is_submitter": "True", "link_id": "t3_quy6vw", "parent_id": "t1_hktj2gn", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "monstersandlanguages", "body": "I read \"gar keine Ahnung\" as \"no idea at all\" or maybe, at a stretch, \"absolutely no idea\". The rest of them are a mystery.", "created_utc": "1637039209.0", "edited": "False", "id": "hktgluz", "is_submitter": "True", "link_id": "t3_quy6vw", "parent_id": "t1_hktey33", "score": "6", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "monstersandlanguages", "body": "Every one of my cards has at least one example sentence along with word/definition. Even with the sentence as a \"hint\", though, I still make mistakes and cannot even determine what the word means in the context of a sentence most of the time. \n\n\nI can't speak for vorkommen or schließlich, but I know gar is one of those words that hit German learners hard. I'm only A2, so maybe there are a few vocab words a little out of reach? Someone taught me how to suspend cards. Perhaps a little absence will make the heart grow fonder (and the brain, sharper).", "created_utc": "1637036988.0", "edited": "False", "id": "hktcku9", "is_submitter": "True", "link_id": "t3_quy6vw", "parent_id": "t1_hktb6h8", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "monstersandlanguages", "body": "Ah, you've saved my bacon! Thanks. :)", "created_utc": "1637036777.0", "edited": "False", "id": "hktc6m6", "is_submitter": "True", "link_id": "t3_quy6vw", "parent_id": "t1_hktawlk", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "monstersandlanguages", "body": "By suspend, do you mean delete from Anki? I don't think I see a suspend option.", "created_utc": "1637035554.0", "edited": "False", "id": "hkt9sq0", "is_submitter": "True", "link_id": "t3_quy6vw", "parent_id": "t1_hkt7ssj", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "monstersandlanguages", "body": "Gosh, I hope so. It's getting a little embarrassing at this point!", "created_utc": "1637035530.0", "edited": "False", "id": "hkt9qyb", "is_submitter": "True", "link_id": "t3_quy6vw", "parent_id": "t1_hkt869l", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "monstersandlanguages", "body": "That's what stuck out to me, too. Most of us here do want some sort of return on our investments of time, effort, and often, money. That might be a job as a translator, or being able to travel outside of touristy areas, or just for the joy of consuming media in the target language.", "created_utc": "1636830954.0", "edited": "False", "id": "hkhmupb", "is_submitter": "False", "link_id": "t3_qt19p1", "parent_id": "t1_hkhic1w", "score": "16", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "monstersandlanguages", "body": "Lesson most certainly learned. :( The next language will be 100% motivated by personal interests.", "created_utc": "1636820367.0", "edited": "False", "id": "hkgy5q3", "is_submitter": "True", "link_id": "t3_qsu3sw", "parent_id": "t1_hkfyizf", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "monstersandlanguages", "body": "More and more I'm leaning toward Japanese due to previous, multiple exposures to many aspects of the language and culture. The amount of native content in this house alone is staggering.\n\n\nCurrently, I'm pulling, on average, 1.5 - 2hrs four or five times a week of active learning: grammar drills, reading, vocab review, watching the news/listening to creepypasta, etc. I tend to keep a rotating list of stuff playing in the background for passive listening. Mainly news and animal dokus.\n\n\nI'm feeling ambivalent about German because I started learning it to talk with a friend. We had a nasty split and now I almost want to drop German because it feels \"dirty\". That's unfair and makes no sense, and I do like the language for other reasons.\n\n\nMaybe I need a light at the end of the tunnel, so to speak. While I don't want to give up on German, it would kind of be nice to \"get rid of the baggage\" of it sometimes. So I thought, maybe if I work hard throughout 2022, I can shift focus to another language and work on German on the side. It feels like a waste to throw away all the work done to learn some of a perfectly good language on behalf of a breakup!", "created_utc": "1636784647.0", "edited": "False", "id": "hkfi635", "is_submitter": "True", "link_id": "t3_qsu3sw", "parent_id": "t1_hkfh3np", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "monstersandlanguages", "body": "The plan is, for sure, not to introduce a new language until the end of 2022. Maybe December '22. I'm at A2, though weakly since the vocab from Goethe's A1 Wortliste keeps slipping and genitive is a little weasel to learn. It's been six months of self-study on and off.\n\n\nA solid B1 has *got* to be in reach even with limited study time. Heck, maybe if life stops being so unrelenting, a weak B2 is in the cards.\n\n\nI might actually go for Japanese since I have a decent amount of exposure to the language, the grammar, the culture, and the \"easy\" kana.\n\n\nThanks!", "created_utc": "1636784129.0", "edited": "False", "id": "hkfhg26", "is_submitter": "True", "link_id": "t3_qsu3sw", "parent_id": "t1_hkfe7st", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "monstersandlanguages", "body": "I haven't found any that seemed good. I started with Duolingo for about two months (until the obsession with the numbers interfered with actual learning) to kind of get a feel for the very basics of the language.\n\n\nNow I've been listening to creepypastas, news, and German-dubbed movies; reading children's books; practicing vocab on AnkiDroid; and doing \"grammar sweeps\" where I'll spend all my listening/reading time doing grammar drills for two or three days at a time.\n\n\nIs it effective? Not sure. I'm just A2 after off-and-on self-study for six months. I can say that, as long as I have enough vocab for it, reading is pretty clutch. Listening is a huge weakspot--if I can playback slowly, I can sometimes assemble the gist of what's being said (as opposed to most reading, where I can tell you the gist + some extra details). As for output, I can write simple sentences (no more than two clauses, present, preterite, perfect, and future tense only, no genitive). . . on occasion spontaneously.\n\n\nNot sure what the better way is, but maybe that will give you a good place to start. Happy learning! You've picked a fun, if maddening, language.", "created_utc": "1636779481.0", "edited": "False", "id": "hkfaa0c", "is_submitter": "False", "link_id": "t3_qsotp9", "parent_id": "t3_qsotp9", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "monstersandlanguages", "body": "The whole time I was wondering what Jess will do when--and as the dog ages, it will most likely be *when*--a large vet bill is dropped in her lap. $100 is dirt cheap for vet care. These days, it's not unusual to get something in the realm of $300 - $7K, depending on a large number of variables.\n\n\nIt's one thing to adopt a dog from a high-kill shelter and say, \"okay, I can do ABC, but if XYZ happens, this dog will either have to recover with what I can provide or I'll send them over the Rainbow Bridge\". In a lot of cases, it is absolutely better to just get the poor animal out of the shelter to give them the best life possible. \n\n\nBut if you are so hand-to-mouth you can't drop $100 here or there for your dog, then it's time to reconsider pet ownership at this juncture of your life. :\\ Not just for the dog's sake, but for your own. Not a fun choice, to be sure, but you gotta think of everyone involved, especially the dependents.", "created_utc": "1636778110.0", "edited": "False", "id": "hkf7zij", "is_submitter": "False", "link_id": "t3_qsgfe1", "parent_id": "t1_hkcv52m", "score": "49", "subreddit": "AmItheAsshole", "subreddit_id": "t5_2xhvq"}, {"author": "monstersandlanguages", "body": "Ä doesn't sound like the \"e\" in \"elephant\" to me. 🤔 Maybe somewhere in between that and a long \"a\" sound, though. German is fun, but so difficult at times, lol.", "created_utc": "1636739546.0", "edited": "False", "id": "hkcwv5n", "is_submitter": "False", "link_id": "t3_qroiac", "parent_id": "t1_hkcwdy2", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "monstersandlanguages", "body": "\"Ch\" becomes a little easier when you basically hiss it. Ö was concocted by an angry misanthrope. You get a passable Ä if you pronounce it like a long \"a\" (think: table, maple, etc), but I'm told that from a native's perspective, it sounds heavily-accented that way, so that tip is only good for a starting point.\n\n\nItalian is supposed to be a lot easier pronunciation-wise! Or at least all the Italian I've heard sounds less...arcane, lol.", "created_utc": "1636738564.0", "edited": "False", "id": "hkcueyj", "is_submitter": "False", "link_id": "t3_qroiac", "parent_id": "t1_hkbjeif", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "monstersandlanguages", "body": "It's nothing like English, at least! 😭😂\n\n\nAnyway, I've found that, the more I read, the more the exceptions make sense...most of the time. There's a lot I run across where I just say, \"no idea where that one came from and maybe it's better not to know\".\n\n\nThe orderly, functional aspect of German is largely a feeling. *Sprachgefühl* might be the word for it. You listen to it and get it. Then you read some of the grammar rules and marvel (and die inside a little).", "created_utc": "1636685193.0", "edited": "False", "id": "hka9j9j", "is_submitter": "False", "link_id": "t3_qroiac", "parent_id": "t1_hk9vqmd", "score": "7", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "monstersandlanguages", "body": "Hello, fellow German learner! German definitely doesn't live up to the harsh/angry stereotype. Maybe an \"orderly and functional\" stereotype would be more accurate. Or even \"stern\".", "created_utc": "1636676148.0", "edited": "False", "id": "hk9q3zv", "is_submitter": "False", "link_id": "t3_qroiac", "parent_id": "t1_hk8hyz8", "score": "9", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "monstersandlanguages", "body": "I picked mine based on what a (now former) friend spoke fluently and sort of regret it. :\\ German is still a great language and a reasonably good intro to language learning in general. It sounds so nice, too. Somewhat orderly and predictable, nothing too discordant or mushy.\n\n\nMy decision to learn Russian next was also based off said friend, so now I'm reevaluating that and am not sure what I'll pick up at the end of 2022. At least there's plenty of time to decide. :)", "created_utc": "1636675998.0", "edited": "False", "id": "hk9ps67", "is_submitter": "False", "link_id": "t3_qroiac", "parent_id": "t3_qroiac", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "monstersandlanguages", "body": "You've got one side that thinks pitties are the absolute devil. Irredeemable breed. Wipe them out.\n\n\nYou have another side that thinks pitties can do no wrong, it's all nuture with no nature, nanny dog, etc.\n\n\nI've seen both sides get defensive, but the pittie lovers tend to be more vocal on most of Reddit (can't say for anywhere else). I've also seen GSD and rottie owners go on the defensive, too.\n\n\nPitties are great dogs, but most have a disposition toward dog aggression. They're also predisposed to bite *hard*, harder than some other breeds, then hang on. They're rough and tumble dogs with a lot of personality. When their tenacity and drive is put toward a less destructive task, it makes you really appreciate the positive attributes of this breed. When you realize how people-friendly many pitties are, it makes you appreciate them more.\n\n\nWe accept that herding dogs will herd because of their nature. Retrievers will retrieve. Watchdogs will bark. Dogs originally bred to fight bulls (and then, sadly, each other) will fight. \n\n\nNo, not *all* herding dogs will herd, not all retrievers will retrieve, and some watchdogs are silent. Likewise, not all dogs with fighting (or guarding) in their genes will be aggressive toward other dogs. Because of the tendency to fight and the tenacity with which these dogs tend to fight, however, it's irresponsible not to be realistic about them. Some of them would never harm another animal for any reason. Some will attack whatever gets too close. As long as they're not attacking people, the latter is fine. Train them well. Keep them leashed. Avoid areas where you're likely to be packed in with other animals.\n\n\nAnd I have to reiterate, since the pittie enthusiasts always want to say, \"what about..?\", this goes for any dog, big or small, with dog aggression. It's okay to say, \"lol, yeah, my dog is an asshole to other dogs\". They're probably your best friend! Love them, accept them for who they are, keep them away from other dogs. Oh, and pick up their poop, too, please.", "created_utc": "1636421278.0", "edited": "False", "id": "hjvoosg", "is_submitter": "False", "link_id": "t3_qpj1t9", "parent_id": "t1_hjvk3cf", "score": "11", "subreddit": "eyeblech", "subreddit_id": "t5_3fhf0"}, {"author": "monstersandlanguages", "body": "Bless everyone who works in dog rescue. <3 Sounds like you've had some tough dogs in your time and didn't give up on them. Chow and chow mixes can be extra tough, because they tend to get attached to one person and are ambivalent about anyone else.\n\n\nI wish more people would realize that being responsible also means being realistic and educated about the kind of dog they have. :\\ It's okay to have a dog-hating asshole as long as you manage said asshole just as it's okay to have a yippy \"rat dog\" as long as you don't let them go feral on whatever they want. \n\n\nTo reiterate, owners with small, aggressive dogs should hold themselves to the same standards as owners with large dogs. I hate seeing my fellow \"rat dog\" owners staring at their phones while their dogs cause havoc. If the dog isn't friendly to other dogs, said dog should always be on a leash when out in public. Doesn't matter if it's a 2-lb chihuahua or a 60-lb pittie.", "created_utc": "1636414939.0", "edited": "False", "id": "hjvasz8", "is_submitter": "False", "link_id": "t3_qpj1t9", "parent_id": "t1_hjv857r", "score": "4", "subreddit": "eyeblech", "subreddit_id": "t5_3fhf0"}, {"author": "monstersandlanguages", "body": "I've had to do it multiple times myself and if you're not ready, that big dog will totally knock your ass over or grab your dog. You gotta watch your dog's legs and hindquarters--that's usually where the other dog will try to grab. :\\ \n\n\nI always try to keep my back to a tree or fence without cornering myself. A lot of these dogs like people *a lot*, so when you yell at them to back off, or tell them nicely to sit, they calm down a bit. \n\n\nSome people just don't get it. There are a couple of people in my neighborhood who own GSDs. Wonderful dogs...with people. But one of them has already almost killed a pug (\"they were rough-housing\"--sure, Kyle) and the other lunges at any dog she sees. Both owners still think their dogs are friendly.\n\n\nThen you have the owner of the most beautiful pittie in the world. No, seriously: shiny white coat, athletic build, confident gait, square head without much jowl, a lyrical howl. He attacked my dog. It took me kicking and the owner hitting him with a stick to get him to back off. Now this dog is always on a leash, has a new fence around his yard with some sort of roll-y things at the top, and his owner is always careful around other dogs.\n\n\nThe two above examples are what I was getting at in terms of responsibility and using your brain around these dogs, but people don't like to hear it.", "created_utc": "1636409599.0", "edited": "False", "id": "hjuyas4", "is_submitter": "False", "link_id": "t3_qpj1t9", "parent_id": "t1_hjuvz6z", "score": "20", "subreddit": "eyeblech", "subreddit_id": "t5_3fhf0"}, {"author": "monstersandlanguages", "body": "Same. Soulseer Mizutsune has me seething. That Foxflame + Blue Moon combo is. . . well, *bullshit* is the best way to put it. At least crank down the accuracy on them!\n\n\n\nTo add insult to injury, when you finally get Soulseer's egg, he's nothing to write home about. And only dash as a rider action? He should be able to swim.", "created_utc": "1636407946.0", "edited": "False", "id": "hjuu7e3", "is_submitter": "True", "link_id": "t3_qp2mu3", "parent_id": "t1_hjusu9p", "score": "1", "subreddit": "monsterhunterrage", "subreddit_id": "t5_3a2f0"}, {"author": "monstersandlanguages", "body": "Sorry, this is a pet topic of mine.\n\n\nEvery time pitties are mentioned, some people get so defensive. I understand why to a degree--pitties are great dogs with goofy smiles if you know what you're doing and give a fuck about controlling a powerful, playful, and sometimes clumsy doofus. But we gotta be honest with ourselves for the sake of these animals.\n\n\n*Any* large dog can do this to a toy breed. Dogs with a tendency toward dog aggression (which includes pitties, sorry) are a higher risk. It can take you by surprise, too, since your dog might love other small animals and just despise other dogs. That's not a failing on the dog's part. This is just what happens when you have an intelligent animal with a unique personality. As an owner, you always have to know your dog. It just happens to be even more important when you have a strong, willful, intelligent breed that can do a lot of damage.\n\n\nSmall dog owners need to be aware, too. Your little dog shouldn't be running up to a bigger dog without the owner's permission (the number of unleashed small dogs vs big dogs I see is incredible). If your little off-leash dog picks a fight with an unleashed dog, pittie or not, that's on you. When we're talking about breeds with a tendency toward dog aggression, it's not fair to put them face-to-face with something they hate and be surprised if bloodshed results. As my aunt used to say, \"we ain't livin' in a Disney World.\"\n\n\nAll dog owners should learn the basics of canine body language. There's always some unpredictability with live animals, but if you understand the basics, you can defuse a lot of situations.\n\n\nFor you small dog owners: there is absolutely no shame in picking up your dog if you aren't sure. If *any* dog owner--not just those with big dogs--gets on your ass about it, then rest assured you've done the right thing because that person is a dumbfuck.", "created_utc": "1636405629.0", "edited": "False", "id": "hjuodf9", "is_submitter": "False", "link_id": "t3_qpj1t9", "parent_id": "t3_qpj1t9", "score": "106", "subreddit": "eyeblech", "subreddit_id": "t5_3fhf0"}, {"author": "monstersandlanguages", "body": "Wish you didn't need deviant armor and weapons...for the deviants den! I dunno, that feels backwards to me, or maybe I need to level more. I've got recommended builds.\n\n\nOddly enough, I haven't died in the elder den yet...used a lot of healing items, yes. Died, no.\n\n\nETA: Got some nice new weapons. >:) Time for some payback on those monsters!", "created_utc": "1636336468.0", "edited": "1636338837.0", "id": "hjr4g1t", "is_submitter": "True", "link_id": "t3_qp2mu3", "parent_id": "t1_hjr1pjh", "score": "5", "subreddit": "monsterhunterrage", "subreddit_id": "t5_3a2f0"}, {"author": "monstersandlanguages", "body": "This is throwing me, because \"...of a sound mind\" would cover using your common sense, right? Trusting experts (ie: people who know more than you)? Trusting that God maybe put some really smart people down here to help others out?\n\n\nCould we at least be consistent here? (I know the answer to that one.)", "created_utc": "1636223596.0", "edited": "False", "id": "hjkwmuq", "is_submitter": "False", "link_id": "t3_qo32o2", "parent_id": "t1_hjkfqp8", "score": "10", "subreddit": "CovIdiots", "subreddit_id": "t5_2hzjsw"}, {"author": "monstersandlanguages", "body": "That's true...if you don't have the context of the first game, I could see Cheval coming off as an asshole instead of a hardass, which would be off-putting.", "created_utc": "1636222847.0", "edited": "False", "id": "hjkux68", "is_submitter": "False", "link_id": "t3_qnzms4", "parent_id": "t1_hjkowcq", "score": "7", "subreddit": "MonsterHunter", "subreddit_id": "t5_2rron"}, {"author": "monstersandlanguages", "body": "A little surprised to see Cheval so far down the list. Imo he's second best to Reverto. Reverto has amazing damage output but I like how Cheval has a solid balance between support and (admittedly lower) damage. His attitude compared to Reverto's does grate on the nerves.\n\n\nReverto: hell yeah, we beat the shit outta that monster!\n\n\nCheval: pffft, baby stuff\n\n\nShut the fuck up and use that Dust of Life, Cheval. ;)", "created_utc": "1636217533.0", "edited": "False", "id": "hjkieb0", "is_submitter": "False", "link_id": "t3_qnzms4", "parent_id": "t3_qnzms4", "score": "36", "subreddit": "MonsterHunter", "subreddit_id": "t5_2rron"}, {"author": "monstersandlanguages", "body": "I would forgive the DLC if there was just. . . more in base Rise. Don't get me wrong, I *do* like Rise. It's not as good as MHGU, but it's a half-decent game.\n\n\nCompared to MHGU and, actually, MHST 2 (which I've been playing endlessly for weeks now), Rise doesn't have as much variety and charm. After playing Stories so much, Rise kinda feels like one of those \"freemium\" games where you pay a pittance for the base game, and then all the other stuff you might like is paywalled.", "created_utc": "1636062810.0", "edited": "False", "id": "hjc6no0", "is_submitter": "False", "link_id": "t3_qmux1l", "parent_id": "t3_qmux1l", "score": "6", "subreddit": "monsterhunterrage", "subreddit_id": "t5_3a2f0"}, {"author": "monstersandlanguages", "body": "There are way too many people out there who don't, or won't, understand that dogs have memory, intelligence, and an inner emotional life. Zuzu in this video here had the double wallop of losing the friendship of another animal, and then losing what turned out to be a worthless family. And yet Zuzu still wanted to go back home with them.\n\n\nMaybe it's just me, but if I decided to get another dog right after giving my grieving dog up to the shelter, I'd at least have the decency to go somewhere else. Don't make the \"old dog\" see. That was the bare minimum these people could have done. They couldn't be bothered to do that.", "created_utc": "1636035070.0", "edited": "False", "id": "hja83fk", "is_submitter": "False", "link_id": "t3_qmdhig", "parent_id": "t1_hj9g0j2", "score": "8", "subreddit": "NoahGetTheBoat", "subreddit_id": "t5_117wt6"}, {"author": "monstersandlanguages", "body": "I clicked this post thinking, \"eh, bet I've seen worse on these medi-gore subs.\"\n\nWelp, what a day to have eyes.", "created_utc": "1635877541.0", "edited": "False", "id": "hj1ixud", "is_submitter": "False", "link_id": "t3_qky4y1", "parent_id": "t1_hizj7cy", "score": "22", "subreddit": "eyeblech", "subreddit_id": "t5_3fhf0"}, {"author": "monstersandlanguages", "body": "You could honestly just put all of Lava Caverns for me. It's a pain in the ass to navigate and super annoying to fight in. My least fave part of LC is Area 13. The long strip where you can fall off either side and get pummeled into the lava so you can get burned as well as have the shit kicked out of you. (Same area where you wirebug up a cliff to farm for Kamura points or sometimes ore.) Yeah, hate that one.", "created_utc": "1635697590.0", "edited": "False", "id": "his2h1j", "is_submitter": "False", "link_id": "t3_qjm4my", "parent_id": "t3_qjm4my", "score": "5", "subreddit": "monsterhunterrage", "subreddit_id": "t5_3a2f0"}, {"author": "monstersandlanguages", "body": "We had a conversation last night. Mom still got mad at my reasonable request for Sundays off. In my eyes, I did make a promise, it just turned out to be a lot, so I need to scale back.\n\n\nAnyway, mom swung by this morning, snarking that she was going to have to spend $75 every time she wanted to go out (so $75 x 4) because I'm \"not allowed\" to watch Sandy anymore. She wouldn't even let me pet Sandy when she came to say hi.\n\n\nI looked mom in the eyes and said, \"that's not the punishment you think it is.\"\n\n\nAnyway, I don't think we'll be talking to or seeing each other for awhile. It's for the best.", "created_utc": "1635612592.0", "edited": "False", "id": "hintksg", "is_submitter": "True", "link_id": "t3_qionco", "parent_id": "t1_hime20i", "score": "1", "subreddit": "AmItheAsshole", "subreddit_id": "t5_2xhvq"}, {"author": "monstersandlanguages", "body": "Machine translators like Google Translate are, imo, only good for spot-checking a sentence you've come up with in your target language eg: German. If the translation sounds whacky, then pull out a dictionary to look up the weird parts of the translation. (If you desperately need to communicate NOW, then you have to work with what's available, of course.)\n\n\nYou're better off spending some of your free time with an Anki vocabulary deck and practicing some grammar drills to get a feel for how the language is put together. I would also recommend listening to podcasts in German and reading any available transcripts so you can see your vocab and grammar in action.\n\n\nGerman can be a tough language, but there's a great deal of sense to be found in (most) aspects of semi-formal and formal German. (But god, do I hate those irregular verb stems.)", "created_utc": "1635610167.0", "edited": "False", "id": "hinns2t", "is_submitter": "False", "link_id": "t3_qj0jxa", "parent_id": "t3_qj0jxa", "score": "4", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "monstersandlanguages", "body": "You're so right. I feel guilty, but mom has got to find some alternate accommodations. :(", "created_utc": "1635551598.0", "edited": "False", "id": "hikx36f", "is_submitter": "True", "link_id": "t3_qionco", "parent_id": "t1_hikssvy", "score": "2", "subreddit": "AmItheAsshole", "subreddit_id": "t5_2xhvq"}, {"author": "monstersandlanguages", "body": "Sometimes she's at a doctor's appointment or something, but usually she's out with friends.", "created_utc": "1635551529.0", "edited": "False", "id": "hikwy0p", "is_submitter": "True", "link_id": "t3_qionco", "parent_id": "t1_hikt1ah", "score": "1", "subreddit": "AmItheAsshole", "subreddit_id": "t5_2xhvq"}, {"author": "monstersandlanguages", "body": "The shared custody remark made me laugh!\n\n\nLuckily, no matter what, my mom will make sure Sandy is cared for. She *adores* Sandy. Pretty sure mom would starve if it meant Sandy ate like a queen. My mom can be...a little clueless, if that makes sense. Since she loves Sandy and all of Sandy's antics, of course everyone else does. (We don't, though we don't fault Sandy for being a dog.)\n\n\nSandy is just being a puppy. And puppies are a little overwhelming, to say the least! Perhaps when she's older, I could go back to dog-sitting more often, since I could at least relax.", "created_utc": "1635551442.0", "edited": "False", "id": "hikwrga", "is_submitter": "True", "link_id": "t3_qionco", "parent_id": "t1_hiks2u5", "score": "3", "subreddit": "AmItheAsshole", "subreddit_id": "t5_2xhvq"}, {"author": "monstersandlanguages", "body": "Aknosom is such a great birdy. :) Fun fight, if super easy.\n\n\nLove your rendition. Sort of abstract in the background but very colorful in the foreground.", "created_utc": "1634768434.0", "edited": "False", "id": "hhf3s8b", "is_submitter": "False", "link_id": "t3_qc8hs2", "parent_id": "t3_qc8hs2", "score": "3", "subreddit": "MonsterHunter", "subreddit_id": "t5_2rron"}, {"author": "monstersandlanguages", "body": "I was nearly bullied to suicide and knew many other people who were in the same boat (shitty schools that were close to each other--we losers stuck together when we could).\n\n\nThese kinds of bullies don't feel *any* shame. \"We didn't mean it!\" \"It was just a little fun!\" \"X is such a pussy anyway!\" \"X asked for it!\"\n\n\nAnd when they grow up: \"I don't remember it happening that way...\", \"We were just having a little fun.\", \"Kids will be kids, what's your problem?\", \"What do you mean we weren't best friends?\", \"X deserved it!\"\n\n\nIf anything, bullies of this caliber celebrate and show off. Some bullies are just total sociopaths. \n\n\nWith a lot (not all!) of these sociopaths...there's nothing wrong with their home life. They aren't one day from the streets. They aren't being sex trafficked, starved, or otherwise abused. There's nothing in their life that could be used to justify why they are the way they are.\n\n\nThe chances of these girls *ever* growing up to feel guilty is astronomically low based off my own experiences and the experiences of other losers like me. Worst part is, they'll go on to have kids who are allowed to be little terroristic bullies if they lean that way because their mums don't see the problem.", "created_utc": "1634653015.0", "edited": "False", "id": "hh8gz55", "is_submitter": "False", "link_id": "t3_qb9b9x", "parent_id": "t1_hh89xjm", "score": "7", "subreddit": "NoahGetTheBoat", "subreddit_id": "t5_117wt6"}, {"author": "monstersandlanguages", "body": "Ugh, yes. And MH is so bad about this. You'd think they'd figure something out by now!\n\n\nSo far, their solution is: \"we'll have bullfango/rhenoplos launch your ass across the screen so the camera can readjust.\"", "created_utc": "1634652386.0", "edited": "False", "id": "hh8flmv", "is_submitter": "False", "link_id": "t3_qawzed", "parent_id": "t1_hh83mzb", "score": "4", "subreddit": "monsterhunterrage", "subreddit_id": "t5_3a2f0"}, {"author": "monstersandlanguages", "body": "Yeah, the farming is pretty easy if you have Nargacuga (easiest) or Ivory Lagiacrus (or any monstie that roars, tbf). It's just so. Damn. Draining. Because it's the video game equivalent of watching paint dry.\n\n\nGiven how many monstie parts you can collect, an exchange system like that would be *awesome*. It might also encourage you to go fight monsties you wouldn't normally bother with, depending on how the system is set up.", "created_utc": "1634652310.0", "edited": "False", "id": "hh8ffmh", "is_submitter": "True", "link_id": "t3_qb1j5t", "parent_id": "t1_hh7ei3i", "score": "1", "subreddit": "monsterhunterrage", "subreddit_id": "t5_3a2f0"}, {"author": "monstersandlanguages", "body": "I feel like a lot of the issues with Najarala would be less painful if he didn't take up 99% of the screen whenever he gets within sneezing distance of you. How many times have I eaten shit because Naja's done that coil thing and I couldn't see? Oh, I have eaten SO MUCH SHIT thanks to this camera-hogging bastard.\n\n\nIf you can *see* what the monster is doing, at least you have a chance to counter it.", "created_utc": "1634609351.0", "edited": "False", "id": "hh6o0m1", "is_submitter": "False", "link_id": "t3_qawzed", "parent_id": "t3_qawzed", "score": "13", "subreddit": "monsterhunterrage", "subreddit_id": "t5_3a2f0"}, {"author": "monstersandlanguages", "body": "I wish they'd done better work on the Palamutes, 'cause yeah...I only use a Palamute now when I wanna drift around an expedition map or when I'm fighting Almudron. :( The Palamute idea isn't a bad one. It's more on the under-developed side. Par for the course for the MH series, but still.", "created_utc": "1634323045.0", "edited": "False", "id": "hgrqqip", "is_submitter": "False", "link_id": "t3_q8plcg", "parent_id": "t1_hgqsqot", "score": "5", "subreddit": "monsterhunterrage", "subreddit_id": "t5_3a2f0"}, {"author": "monstersandlanguages", "body": "It's so, so heart-breaking. :( This pup had a happy ending, but what about all the other good dogs who don't? It's almost too much to bear.\n\n\nWhat made me crack was when the pup was trying to get back in the car. Anyone familiar with a dog recognizes the anxiety and the message the dog is trying to send: \"hello, friend! You forgot someone! My door isn't open, please let me in. You can't leave your best pal behind, right? Friend?\"\n\n...\n\n\"Friend?\"", "created_utc": "1634055801.0", "edited": "False", "id": "hgdcn77", "is_submitter": "False", "link_id": "t3_q6ggdo", "parent_id": "t1_hgc3zam", "score": "52", "subreddit": "MadeMeCry", "subreddit_id": "t5_2x88b"}, {"author": "monstersandlanguages", "body": "Languages are often divided into the following levels: A1, A2, B1, B2, C1, C2. Each level represents increasing fluency in the language. I would encourage you to give this link a look-see: https://www.coe.int/en/web/common-european-framework-reference-languages/table-1-cefr-3.3-common-reference-levels-global-scale\n\n\nThat said, I usually see people recommending B2 before starting a new language. I suppose it depends on a number of variables, such as the languages themselves, the time you have to devote to each daily, etc.", "created_utc": "1633489453.0", "edited": "False", "id": "hfk7cd5", "is_submitter": "False", "link_id": "t3_q2ahm6", "parent_id": "t1_hfk48zn", "score": "9", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "monstersandlanguages", "body": "Find yourself a good French grammar book. (I use Schaum's for German and I believe they have something for French, too.) For thirty minutes every day, study from that book. Do the exercises. Take notes if those are helpful to you.\n\n\nIf you recognize a grammatical construct from your input somewhere, it's worth it to make a note of at least a few sentences or whatever. Hell, crack open a book/start a video where you think you've seen that construct and track it down. What's the worst that could happen? You look at your input a little more deeply? ;)\n\n\nDo more focused practice on stuff that gives you trouble. Future tense verb conjugation got you down? Well, now you're going to practice future tense conjugation on 3 - 5 verbs daily. Again, see if you can find the troublesome concepts in your input. See how it's done there.\n\n\nDon't be afraid to skip something that seems way above your current level. You can come back later instead of pulling out your hair!\n\n\nOnce you've gotten through the book, just review it every few weeks until the concepts have become natural for you. How you review depends on your learning style. Some people benefit from looking up more exercises in books or on the web. Other people just need to re-read (having done the exercises the first time around) and they're good. Experiment to find out what's best for you.", "created_utc": "1633489048.0", "edited": "False", "id": "hfk6jih", "is_submitter": "False", "link_id": "t3_q249r8", "parent_id": "t3_q249r8", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "monstersandlanguages", "body": "It's not worth trying to counter unless you're amazing at countering. The attacks are too fast, too strong, and, in the case of the mudball almost certainly aim-botted if you aren't moving perpendicular to the attack. (The mudball attack behaves similarly to Magnamalo's tail blast. So either get way out of the way or roll perpendicular to the tail once or twice.) Watch out for the huge waves of mud or bubbling mud/water near you. That stupid attack where Almudron twists himself up is the one I always have trouble reading in time. Tbh, if you're up his arse when he winds up for that attack, you're gonna eat it.\n\n\nBest weapons I've used on Almudron are swag axe, long sword, and bow. Bow makes it *easy*. Carry at least anti-muck and partbreaker. For dango, water res and the stun one. Third is wildcard.\n\n\nA lot of Almudron's fight seems to be positioning yourself (and that stupid camera), being aware of changes in the environment, and managing space around you, Almudron, and the environment. He's not a monster you run in on to deliver a beating.\n\n\nPeople want that tail because they want the Golden Orb (3% chance if you break the tail). There's two breaks you can get and then a sever. Best tail openings in no particular order:\n\n\n1. When Almudron is stunned or down.\n2. When he dives and pokes head and tail above the mud. Just don't get too close to the tail when he's slamming it down. That hitbox sucks and the tail is longer than you think.\n3. When Almudron is behind those giant boulder things he makes\n\n\n\nThere's also a brief moment where you can get a hit or two after Almudron makes a tail attack or gathers the mudball. The important thing is to not over-commit and get the hell out of the way. Makes the tail sever so, so, sooooo satisfying.\n\n\nGood luck with your future Almudron hunts!", "created_utc": "1633475204.0", "edited": "False", "id": "hfjepse", "is_submitter": "False", "link_id": "t3_q1ubbw", "parent_id": "t1_hfjapj9", "score": "1", "subreddit": "monsterhunterrage", "subreddit_id": "t5_3a2f0"}, {"author": "monstersandlanguages", "body": "This has a lovely paper-cutout feel! Very serene.", "created_utc": "1633467007.0", "edited": "False", "id": "hfiwl18", "is_submitter": "False", "link_id": "t3_q2046x", "parent_id": "t3_q2046x", "score": "1", "subreddit": "MonsterHunter", "subreddit_id": "t5_2rron"}, {"author": "monstersandlanguages", "body": "Yeah, I've noticed Almudron requires you to be a little more mobile during the fight than some people might be used to or like? I just love the design and fight. Before my membership lapsed, I helped with quite a few Almudron co-ops.", "created_utc": "1633461660.0", "edited": "False", "id": "hfijtkt", "is_submitter": "False", "link_id": "t3_q1ubbw", "parent_id": "t1_hfhvhs0", "score": "2", "subreddit": "monsterhunterrage", "subreddit_id": "t5_3a2f0"}, {"author": "monstersandlanguages", "body": "This is the reason why I've been obliterated repeatedly by Apex Zinogre. Nope, not that huge thunder attack. STUN. \n\n\nSo yeah, I finally used my brains and slotted anti-stun in. Apex Zinogre went down like a paper tent in a flood.\n\n\nSo yeah, fuck Apex Zinogre. And this STUPID PALICO that never helps their meowster.", "created_utc": "1633450993.0", "edited": "False", "id": "hfhu7f5", "is_submitter": "False", "link_id": "t3_q1v750", "parent_id": "t3_q1v750", "score": "5", "subreddit": "MemeHunter", "subreddit_id": "t5_3pd0d"}, {"author": "monstersandlanguages", "body": "It's taken them uncountable \"hey hun!\" cold calls, but they're finally starting to learn Marketing 100. Soon, they'll be invincible!", "created_utc": "1633448394.0", "edited": "False", "id": "hfhntsw", "is_submitter": "False", "link_id": "t3_q1x159", "parent_id": "t3_q1x159", "score": "15", "subreddit": "antiMLM", "subreddit_id": "t5_2swge"}, {"author": "monstersandlanguages", "body": "Yes, agreed! Such an interesting monster and moveset. My favorite part is when Almudron creates those huge boulder things and you have to skirt around them to get your hits in. :)", "created_utc": "1633443244.0", "edited": "False", "id": "hfhbzto", "is_submitter": "False", "link_id": "t3_q1ubbw", "parent_id": "t1_hfhbtcc", "score": "2", "subreddit": "monsterhunterrage", "subreddit_id": "t5_3a2f0"}, {"author": "monstersandlanguages", "body": "Same here! It surprises me that so many people seem to hate the fight and Almudron's overall design (he looks like a hilarious catfish dragon and I love it). With anti-muck slotted into your armor/talisman, the mud is a minor issue. Tons of openings (eta: on the head and legs anyway, lol). Tail is a super fun sever.\n\n\nMy only complaint is that mudball-tail attack is almost certainly bot-aimed to any players who stop moving or aren't far enough from Almudron. (Somnacanth has one, too.) Aim-botted moves are cheap.", "created_utc": "1633442995.0", "edited": "1633480675.0", "id": "hfhbg7h", "is_submitter": "False", "link_id": "t3_q1ubbw", "parent_id": "t1_hfgv7hm", "score": "6", "subreddit": "monsterhunterrage", "subreddit_id": "t5_3a2f0"}, {"author": "monstersandlanguages", "body": "Does panicking about not finishing one single thing count as doing one single thing?\n\n(Pretty please?)", "created_utc": "1633405552.0", "edited": "False", "id": "hffv8m6", "is_submitter": "False", "link_id": "t3_q1ikpm", "parent_id": "t3_q1ikpm", "score": "1", "subreddit": "2meirl4meirl", "subreddit_id": "t5_3ee85"}, {"author": "monstersandlanguages", "body": "I regret paying for Duolingo. The way points are calculated, scoreboards, etc tripped a circuit in my brain that slowly, but surely, made me pay less attention to the language and more attention to climbing the leaderboards. Duolingo did teach quite a bit of vocab, and I may even use it on desktop again, but pay for it? Absolutely not. Duo is not for people who like to watch the pretty numbers grow and bump them up a list of people who are also watching the pretty numbers grow.\n\n\nBabbel, while my sub was active, wasn't a bad app. A little slower-paced, with considerably less pressure to score points. Hopefully that hasn't changed!", "created_utc": "1633404262.0", "edited": "False", "id": "hffsvu3", "is_submitter": "False", "link_id": "t3_q133np", "parent_id": "t3_q133np", "score": "5", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}]