[{"author": "mrseitz", "body": "When I was a young man (pre-Army), I broke my femur in a car wreck, and after the surgery, I was barely able to bend my knee, maybe about half way to a 45 degree angle. My rehab was to sit in a chair and have the physical therapist push my foot backwards to regain the function. It hurt a lot. I involuntarily laughed the creepiest laugh every single time she would push. I’ve never encountered it again, but I’ve don’t think I’ve had to just sit there and take that kind of pain again either.", "created_utc": "1667052133.0", "edited": "False", "id": "iu8xd48", "is_submitter": "False", "link_id": "t3_yg4b0z", "parent_id": "t1_iu77rog", "score": "5", "subreddit": "army", "subreddit_id": "t5_2qtr8"}, {"author": "mrseitz", "body": "I know, right? Thanks, Canada! I did consider doing the eastern most point (Lubec, ME) on the same trip, which is much more scenic with the ocean views and lighthouse. However, it was going to be about a three hour detour, and we decided to use our detour time to go to Quebec City instead.", "created_utc": "1664020756.0", "edited": "1664024882.0", "id": "ipphp48", "is_submitter": "True", "link_id": "t3_xmdgfr", "parent_id": "t1_ipowpkr", "score": "1", "subreddit": "royalenfield", "subreddit_id": "t5_2tlx7"}, {"author": "mrseitz", "body": "Thanks! The saddlebags are Viking Bags Medium Cafe Racer Bags. They look nice and were pretty cheap, but I ended up modifying them a bit. I had a hard time keeping them off the pipes with the mounting stuff provided so I ended up building a little mounting system with stuff from the hardware store. The tail bag is the Reax Poseidon Dry Bag, and I can’t say enough good things about that. I wouldn’t want to put it on there everyday, but it’s exactly what I needed for a longer trip.", "created_utc": "1663988591.0", "edited": "False", "id": "ipob4m1", "is_submitter": "True", "link_id": "t3_xmdgfr", "parent_id": "t1_ipo9us8", "score": "2", "subreddit": "royalenfield", "subreddit_id": "t5_2tlx7"}, {"author": "mrseitz", "body": "It’s a Corbin “Gunfighter & Lady” seat in Scout Brown with a custom request for the diamond pattern. It came out gorgeous but it cost an arm and a leg.", "created_utc": "1663985172.0", "edited": "False", "id": "ipo4t9g", "is_submitter": "True", "link_id": "t3_xmdgfr", "parent_id": "t1_ipnwouk", "score": "2", "subreddit": "royalenfield", "subreddit_id": "t5_2tlx7"}, {"author": "mrseitz", "body": "My friend and I are trying to do one corner a year because neither of us have the time to do it all four as one trip. I’m from Connecticut but he is from Florida and is making his way back down as we speak.", "created_utc": "1663985035.0", "edited": "False", "id": "ipo4k19", "is_submitter": "True", "link_id": "t3_xmdgfr", "parent_id": "t1_ipnz70n", "score": "3", "subreddit": "royalenfield", "subreddit_id": "t5_2tlx7"}, {"author": "mrseitz", "body": "I’m from Connecticut, but I’m doing this Four Corners adventure with an old army buddy who came up from the Tampa area on his Bonneville! I think we decided his whole journey was around 3800 miles.", "created_utc": "1663984921.0", "edited": "False", "id": "ipo4caq", "is_submitter": "True", "link_id": "t3_xmdgfr", "parent_id": "t1_ipnv6ne", "score": "5", "subreddit": "royalenfield", "subreddit_id": "t5_2tlx7"}, {"author": "mrseitz", "body": "We rode through two days off rain to get there, but  the second of the four corners is done! I did the last corner (Key West) on my friend’s Classic 500. This was my first long highway trip (about 1200 miles) on the Interceptor. I do think I will need to go up a tooth or two on the front sprocket to get the highway RPMs down. It wasn’t unpleasant to ride, but my gas mileage was really bad compared to my normal around town mileage. I usually get about 150 miles to a tank, and I actually ran out at one point at 106 because I thought I could go substantially longer, so I wasn’t paying attention.", "created_utc": "1663978269.0", "edited": "False", "id": "ipnrbee", "is_submitter": "True", "link_id": "t3_xmdgfr", "parent_id": "t3_xmdgfr", "score": "7", "subreddit": "royalenfield", "subreddit_id": "t5_2tlx7"}, {"author": "mrseitz", "body": "Hahaha, I was definitely reading this and saying to myself “if they’re B1 in English, I have to stop saying I’m B1 in French”.", "created_utc": "1660236860.0", "edited": "False", "id": "ijvn2wp", "is_submitter": "False", "link_id": "t3_wltgyx", "parent_id": "t1_ijv6bp4", "score": "196", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "mrseitz", "body": "I agree, when I used it for Arabic, I couldn’t keep up with the amount of messages I would get. I haven’t successfully found a single language partner even once for French or Spanish. However, Arabic was much easier to find partners for on italki as well. I’m sure there’s a supply and demand thing going on here.", "created_utc": "1659710710.0", "edited": "False", "id": "ij25q9w", "is_submitter": "False", "link_id": "t3_wgu80t", "parent_id": "t1_ij1vk2e", "score": "76", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "mrseitz", "body": "I was in the brigade formerly known as 4-4 IBCT at Fort Carson from 2011-2013. For my first six months, the barracks shared a parking lot with the company area. Then they moved to a new facility, which was 5.9 miles away (only a 1 hr 55 min walk, per google maps). At PT time, you’d have to give yourself a half hour to make the commute in the car. There was no plan to rectify this, as far as I knew. We cleared the barracks for deployment in 2012, and when we got back, we got put into a building one block closer. It did save a whole half mile. I never saw this issue handled above platoon level. You just had to figure out a ride if you didn’t have a car.", "created_utc": "1658845142.0", "edited": "1658846562.0", "id": "ihpuh7b", "is_submitter": "False", "link_id": "t3_w8j6c0", "parent_id": "t1_ihplnjm", "score": "15", "subreddit": "army", "subreddit_id": "t5_2qtr8"}, {"author": "mrseitz", "body": "I'm pretty sure mine came off while I was riding too, but I didn't notice it until I stopped. But the rear suspension didn't seem to be doing a ton, I only looked because I was going to mess with the preload. I took the grab handle off at least two months ago, didn't realize it acted as a washer.\n\nDid you get yours back together? My rubber grommet has some damage and I don't think I can get the metal piece back in either way.", "created_utc": "1658507082.0", "edited": "False", "id": "ih7gqre", "is_submitter": "True", "link_id": "t3_w5c6v8", "parent_id": "t1_ih7fl2z", "score": "1", "subreddit": "royalenfield", "subreddit_id": "t5_2tlx7"}, {"author": "mrseitz", "body": "Thank you, I obviously didn’t consider this when I removed it. Whooooops. Live and learn, I suppose!", "created_utc": "1658503477.0", "edited": "False", "id": "ih77dew", "is_submitter": "False", "link_id": "t3_w5d0fg", "parent_id": "t3_w5d0fg", "score": "3", "subreddit": "royalenfield", "subreddit_id": "t5_2tlx7"}, {"author": "mrseitz", "body": "I have one on the other side, so I think this is my fault. I took off the side handle because it wouldn’t let my soft bags sit flat. Maybe I misplaced the washer.", "created_utc": "1658502731.0", "edited": "False", "id": "ih75gfx", "is_submitter": "True", "link_id": "t3_w5c6v8", "parent_id": "t1_ih72v10", "score": "5", "subreddit": "royalenfield", "subreddit_id": "t5_2tlx7"}, {"author": "mrseitz", "body": "I can always look to Reddit to keep me honest. I took it off a while back, so this is almost definitely my fault. Maybe I lost the washer in the process. There is one on the other side.", "created_utc": "1658502599.0", "edited": "False", "id": "ih754d3", "is_submitter": "True", "link_id": "t3_w5c6v8", "parent_id": "t1_ih73osv", "score": "7", "subreddit": "royalenfield", "subreddit_id": "t5_2tlx7"}, {"author": "mrseitz", "body": "Interesting! I was just watching a video on replacing the suspension and on that bike, there is a washer that is larger than the head of the bolt, which I obviously don't have.", "created_utc": "1658502048.0", "edited": "False", "id": "ih73qu0", "is_submitter": "True", "link_id": "t3_w5c6v8", "parent_id": "t1_ih72v10", "score": "2", "subreddit": "royalenfield", "subreddit_id": "t5_2tlx7"}, {"author": "mrseitz", "body": "EDIT - ISSUE SOLVED: I took off the side handle without realizing it acted as a washer for the suspension. Totally my fault. Thanks to those who helped me figure it out. \n\n2019 Interceptor 650. I took it for a ride this morning, and I felt like the bumps were really beating me up today. So I said “You know what, I’m gonna adjust the preload when I get home. Given my weight, I probably should have done that forever ago.” And then I found the left side like this.", "created_utc": "1658500732.0", "edited": "1658504742.0", "id": "ih70ey6", "is_submitter": "True", "link_id": "t3_w5c6v8", "parent_id": "t3_w5c6v8", "score": "16", "subreddit": "royalenfield", "subreddit_id": "t5_2tlx7"}, {"author": "mrseitz", "body": "It’s a Corbin. It cost a small fortune, but I’m heavy and wanted to make sure I got something with enough support. It looks real nice though!", "created_utc": "1656195450.0", "edited": "False", "id": "idqkpvw", "is_submitter": "True", "link_id": "t3_vjfers", "parent_id": "t1_idqb54d", "score": "2", "subreddit": "royalenfield", "subreddit_id": "t5_2tlx7"}, {"author": "mrseitz", "body": "I argued with myself about it a lot, but in the end I decided that I would be really angry at myself if I tried something cheap, didn't like it, and ended up going with the Corbin anyway. I was also quite happy to be able to choose the colors and what not. Do try to see some examples of completed seats in the color you want if you do go down that path, I almost ordered the Indian Brown until I saw a complete one and realized that color was basically tan. I went for Scout Brown in the end, which looked dark on the website but it turned out perfect. I sometimes muse about getting a backrest, but it too expensive for me to justify when I very rarely have a pillion.", "created_utc": "1652404418.0", "edited": "False", "id": "i8e7r6p", "is_submitter": "True", "link_id": "t3_umx96s", "parent_id": "t1_i8e6kbh", "score": "2", "subreddit": "royalenfield", "subreddit_id": "t5_2tlx7"}, {"author": "mrseitz", "body": "It's a Corbin seat. It was very expensive, but certainly an upgrade over stock. Part of me wonders if I should have tried a cheaper Indian seat, since the price would be like 3-5 times less, but I'm happy with the Corbin.", "created_utc": "1652400582.0", "edited": "False", "id": "i8dzfsr", "is_submitter": "True", "link_id": "t3_umx96s", "parent_id": "t1_i8dyvfn", "score": "1", "subreddit": "royalenfield", "subreddit_id": "t5_2tlx7"}, {"author": "mrseitz", "body": "Weird, if I’m not mistaken, there used to be several options on the Shorty Tail Kit page, like length, license plate location, and if you want a seat. You might be able to contact them about it, it could just be a website glitch. However, I still believe you had to cut the frame for the XL, because the stock frame is longer than the seat and also there is a little bit of metal inside the housing to support the tail light.", "created_utc": "1652014219.0", "edited": "False", "id": "i7sieg3", "is_submitter": "False", "link_id": "t3_tm5hx9", "parent_id": "t1_i7rb8n5", "score": "2", "subreddit": "royalenfield", "subreddit_id": "t5_2tlx7"}, {"author": "mrseitz", "body": "I have no personal experience to base this off. This is just research from the picture, because I was interested. But I went down the rabbit hole on the patch. I found a [picture of the patch](https://www.worthpoint.com/worthopedia/iraq-army-scorpion-forces-troops-119052183) that he's wearing, and it says \"Scorpion Force\" in the Arabic text. A quick google search brought up [this wiki article](https://en.wikipedia.org/wiki/Scorpions_(Iraq)). Based off this, the theory that it's SF with local Iraqi rank sounds reasonable to me.", "created_utc": "1650418363.0", "edited": "False", "id": "i5fbaq8", "is_submitter": "False", "link_id": "t3_u7izsy", "parent_id": "t1_i5f4n1h", "score": "73", "subreddit": "army", "subreddit_id": "t5_2qtr8"}, {"author": "mrseitz", "body": "Yeah, I was really disappointed to hear it was reflagged. Then a couple years ago, they also got rid of my company with the restructuring for the Stryker switchover.", "created_utc": "1649800150.0", "edited": "False", "id": "i4hia96", "is_submitter": "False", "link_id": "t3_u21ipw", "parent_id": "t1_i4gi22w", "score": "2", "subreddit": "army", "subreddit_id": "t5_2qtr8"}, {"author": "mrseitz", "body": "I refuse to acknowledge that it’s not 4th BDE anymore. But definitely the tank trails out there. It was Magrath almost every day before we made the move though. Sure was fun to switch my walk across the parking lot from the barracks to a genuine commute and organizing car pools for those without cars.", "created_utc": "1649785852.0", "edited": "False", "id": "i4gggjb", "is_submitter": "False", "link_id": "t3_u21ipw", "parent_id": "t1_i4g82c1", "score": "6", "subreddit": "army", "subreddit_id": "t5_2qtr8"}, {"author": "mrseitz", "body": "It’s a shame it didn’t fit right, especially for the price, but the final product looks great!", "created_utc": "1649764251.0", "edited": "False", "id": "i4ezwtq", "is_submitter": "False", "link_id": "t3_u1ceu8", "parent_id": "t1_i4dyuph", "score": "2", "subreddit": "royalenfield", "subreddit_id": "t5_2tlx7"}, {"author": "mrseitz", "body": "That seat cowl looks awesome! Is that custom?", "created_utc": "1649733583.0", "edited": "False", "id": "i4ds0yj", "is_submitter": "False", "link_id": "t3_u1ceu8", "parent_id": "t3_u1ceu8", "score": "3", "subreddit": "royalenfield", "subreddit_id": "t5_2tlx7"}, {"author": "mrseitz", "body": "First off, sorry if that was confusing, I didn’t look at it too hard and thought I was responding to the OP haha. \n\nYeah, I was considering the TEC parts but I just didn’t think it would be enough adjustment. This is four full inches forward. Indimotard makes the same ones, and I was waiting for them to come back in stock when I found omega racer. Be aware, they ship from Thailand, so they take a few weeks. Also, the shipping is cheaper on Etsy  than it is on their website. It doesn’t come with any instructions either, but it wasn’t rocket science and you can find install videos for the Indimotard version on YouTube.\n\nOverall, I’m pretty happy with them. Only got 40 miles or so since switching them but they definitely feel better. It basically makes my thighs parallel with the ground and my knees at a 90 degree bend. The tank cutout doesn’t feel quite as good as it did with the new position but I think it’s worth it anyway.", "created_utc": "1648427032.0", "edited": "False", "id": "i2dmrpa", "is_submitter": "False", "link_id": "t3_tly9xf", "parent_id": "t1_i2dec63", "score": "2", "subreddit": "royalenfield", "subreddit_id": "t5_2tlx7"}, {"author": "mrseitz", "body": "I would guess the Harley would definitely be more comfortable for your for serious long distance. I’ve never ridden a big Harley or touring bike myself, the biggest thing I’ve ridden is a Triumph Bonneville T120. But my dad was a Harley tourer and talked a lot about how nice it was to cruise on the highway with the RPMs nice and low because the engine was so large. My Interceptor will run around 4k on the highway. It’s a little higher than I’d like for a highway tourer, but not terrible and you don’t feel it too much. My buddy’s T120 still runs in the 3-3.5k range on the highway, it’s not as big of a difference as you might think despite being almost double the engine size. His T120 definitely has more power (obviously), but the Interceptor still has enough pep for my purposes, and it’s noticeable more nimble. It’s also not a terrible shaker or anything. I did an 800 mile trip on a single cylinder RE Classic 500 and I had a hard time soaking up the miles on that thing, it was always at the top of the rev range and shook like mad. I felt very happy to come home to my Interceptor. You can definitely make some changes to make it a little more comfortable. I did a Corbin seat, handlebar risers, and some foot pegs that moved them forward about 4 inches. Definitely more comfortable for my size (6’1”, 260 lbs). The stock seat gave me some numbness, so I ordered the Corbin seat, but I noticed before the Corbin arrived that I was getting more comfortable on the stock one anyway. \n\n[TEC Bike Parts](https://www.tecbikepartsusa.com/TEC_Alloy_CNC_Adjustable_Rider_Foot_Pegs_p/re-adjfp-b.htm) makes adjustable foot pegs, and you can also get a replacement shifter and brake pedal that’s supposed to help with the adjustability as well.\n\nI bought [these foot pegs](https://www.etsy.com/listing/1113296528/royal-enfield-interceptor-touring?gbraid=0AAAAADtcfRJ0FQESTiDCfBzu7lxWRI59i&gpla=1&gao=1&&utm_source=google&utm_medium=cpc&utm_campaign=shopping_us_-electronics_and_accessories&utm_custom1=_k_CjwKCAjwloCSBhAeEiwA3hVo_cQ6D5hGCHrjd7akAcyPWHzeu0CczOLvxxjbvcCIhbmcBLSKS6cY5xoCnwYQAvD_BwE_k_&utm_content=go_12665398257_121762925993_511610210343_aud-1408996296175:pla-315906365651_m__1113296528_12768591&utm_custom2=12665398257&gbraid=0AAAAADtcfRJ0FQESTiDCfBzu7lxWRI59i&gclid=CjwKCAjwloCSBhAeEiwA3hVo_cQ6D5hGCHrjd7akAcyPWHzeu0CczOLvxxjbvcCIhbmcBLSKS6cY5xoCnwYQAvD_BwE) because I liked the greater adjustment and the moved shifter and brake pedal. The position doesn’t feel crazy different but it’s nicer on my knees, which usually complain on the longer rides.", "created_utc": "1648403461.0", "edited": "False", "id": "i2c752h", "is_submitter": "False", "link_id": "t3_tly9xf", "parent_id": "t1_i2aymlh", "score": "1", "subreddit": "royalenfield", "subreddit_id": "t5_2tlx7"}, {"author": "mrseitz", "body": "Back makes such a gorgeous product but it is soooo expensive. It's a bit more of a mod since you have to cut the frame, but I think the MK Designs shorty kit (or shorty xl if you want to keep the stock seat length) is a really nice looking kit.\n\nhttps://mkdesignsindia.com/product/shorty-tail-kit/", "created_utc": "1648175933.0", "edited": "False", "id": "i20mcjh", "is_submitter": "False", "link_id": "t3_tm5hx9", "parent_id": "t3_tm5hx9", "score": "1", "subreddit": "royalenfield", "subreddit_id": "t5_2tlx7"}, {"author": "mrseitz", "body": "If you intend on doing long trips, definitely get the Interceptor over the Himalayan. My Interceptor does pretty well for me. I haven't done any massive trips on but I can eat up a couple hundred miles on it pretty easily. I'm sure that you would be more comfortable on an expensive touring bike, but the Interceptor is definitely capable and you can't beat the price.\n\nAre you from Connecticut?", "created_utc": "1648175299.0", "edited": "False", "id": "i20kz6t", "is_submitter": "False", "link_id": "t3_tly9xf", "parent_id": "t1_i209y77", "score": "1", "subreddit": "royalenfield", "subreddit_id": "t5_2tlx7"}, {"author": "mrseitz", "body": "If it makes you feel any better, I had a 96 and degree at 25 when I went in, and they didn’t give me the job I wanted. They told me if I waited a few months, the training for the next fiscal year would be out and I could most likely get what I wanted. I had already been waiting six months to get approved to join because of prior injuries, was really pumped to be finally through the medical, and said “fuck it, I’m ready now” and signed for 11B. Not my brightest moment. Sadly, not my least either. \n\nFor the purpose of the thread question, guaranteed job was the main reason to choose Army. I momentarily entertained the Marines despite the lack of guaranteed job. 15 minutes with a Marine recruiter fixed that. Honestly never considered Navy or AF for a second.", "created_utc": "1646929372.0", "edited": "False", "id": "i04f656", "is_submitter": "False", "link_id": "t3_tap66z", "parent_id": "t1_i02dcbd", "score": "1", "subreddit": "army", "subreddit_id": "t5_2qtr8"}, {"author": "mrseitz", "body": "Yuuuuup. My SSG held my ERB for exactly two seconds before bestowing me with that honor.", "created_utc": "1646314545.0", "edited": "False", "id": "hz6ii4t", "is_submitter": "False", "link_id": "t3_t5o66b", "parent_id": "t1_hz627o8", "score": "7", "subreddit": "army", "subreddit_id": "t5_2qtr8"}, {"author": "mrseitz", "body": "My take is that if I got a cookie cutter EOT, PCS, or ETS award that everyone else got and mine just happened to slip through the cracks, I would say “weird”, put it in a drawer, and never think about it again.\n\nNow, if it was an honest award that was genuinely recognizing something that I did that was above and beyond, I think I would actually really appreciate it. \n\nI got my ETS ARCOM in the mail several months after I was out. Not salty about it, just said “ok, cool” and threw it in a drawer. I will say, when I put my ASU junk in a shadow box about five years later, I did order an oak leaf cluster to represent that award, so I guess it does mean at least enough to me that I wanted to represent it in the display.", "created_utc": "1640872794.0", "edited": "False", "id": "hqjofk6", "is_submitter": "False", "link_id": "t3_rro8dp", "parent_id": "t3_rro8dp", "score": "1", "subreddit": "army", "subreddit_id": "t5_2qtr8"}, {"author": "mrseitz", "body": "That’s good to know, I appreciate the information! I will definitely look into it before we do another tour on it!", "created_utc": "1636873560.0", "edited": "False", "id": "hkk6ee4", "is_submitter": "True", "link_id": "t3_qt20os", "parent_id": "t1_hkjjbq3", "score": "1", "subreddit": "royalenfield", "subreddit_id": "t5_2tlx7"}, {"author": "mrseitz", "body": "I have a black Interceptor as well, and I opted for a brown leather seat. But I still have the silver fenders and wheels. Yours looks incredible with the black fenders and wheels! Did you paint them or replace them? The fenders are cheap enough but the wheels are pricey to replace with the black!", "created_utc": "1636849981.0", "edited": "False", "id": "hkivbwu", "is_submitter": "False", "link_id": "t3_qt4ibs", "parent_id": "t3_qt4ibs", "score": "2", "subreddit": "royalenfield", "subreddit_id": "t5_2tlx7"}, {"author": "mrseitz", "body": "My friend actually just moved from Philadelphia and hasn’t changed over his plates yet. We started from the Tampa suburbs, so it was 813 miles round trip. We tried to stick to the backroads but we did the last hour and a half on the highway. No mechanical issues from the RE, though it was a little brutal on the vibrations for the long stretches. However, it hasn’t been ridden a ton as my buddy usually rides the T120. It’s a 2015 and we cracked 2k miles on the RE on this trip. I also have a Interceptor at home in Connecticut. I feel pretty confident about the 650 now but I did have one rough breakdown at 150 miles. The oil cooler broke and leaked, which was a huge mess and ruined a pair of riding pants. It was fixed under warranty but it took a while for the dealer to acquire parts so it was out of commission for three weeks. So that kind of issue would be terrible on a long trip. However, (assuming the maintenance supervisor at my dealer wasn’t just blowing smoke), he told me that mine was his second warranty repair out of all of the 650s that they had sold, and the other was a faulty fuel gauge. Since I got it back, it’s been good and reliable. I don’t really have any tips other than make sure you do all of your regular maintenance checks and give yourself time to take care of problems if you find them. We had to leave late because we discovered the rear brake pads on the T120 were spent and getting the pads required some searching.", "created_utc": "1636834189.0", "edited": "False", "id": "hkhug4o", "is_submitter": "True", "link_id": "t3_qt20os", "parent_id": "t1_hkhhbhy", "score": "3", "subreddit": "royalenfield", "subreddit_id": "t5_2tlx7"}, {"author": "mrseitz", "body": "I visited a friend in Tampa, FL and we took his Classic 500 and Triumph T120 to Key West. We’re hoping to do the four corners of the Continental U.S. over the next few years. Hopefully I’ll get to bring my Interceptor on the next one!", "created_utc": "1636812805.0", "edited": "False", "id": "hkgiecz", "is_submitter": "True", "link_id": "t3_qt20os", "parent_id": "t3_qt20os", "score": "6", "subreddit": "royalenfield", "subreddit_id": "t5_2tlx7"}, {"author": "mrseitz", "body": "16 year ago, I got hit head on in my compact car by an SUV that crossed the center line while we were both driving between 45 and 55 mph. I remember seeing it cross and thinking about evasive maneuvers, and it’s like I blinked and woke up in the wreckage. That’s exactly what I remembered the day of and I haven’t remembered a thing in the years since. Sometimes I remember weird details from the aftermath, but nothing from the actual accident.", "created_utc": "1632062522.0", "edited": "False", "id": "hdgug0t", "is_submitter": "False", "link_id": "t3_pqymo7", "parent_id": "t3_pqymo7", "score": "2", "subreddit": "motorcycles", "subreddit_id": "t5_2qi6d"}, {"author": "mrseitz", "body": "Looking good! That shorty kit with the single seat looks amazing, I’m super jealous. I’m not sure if it would look as good on the interceptor but I’m tempted to try haha.", "created_utc": "1629305256.0", "edited": "False", "id": "h9fdki2", "is_submitter": "False", "link_id": "t3_p6sjyn", "parent_id": "t3_p6sjyn", "score": "3", "subreddit": "royalenfield", "subreddit_id": "t5_2tlx7"}, {"author": "mrseitz", "body": "The proper answer is having the Classic AND the Himalayan haha. I got an Interceptor instead of a Classic for the increased highway capability, but I still shop around for Classics (despite not having the money hahaha). I learned to ride on a friend’s Classic and it will always have a special place in my heart.", "created_utc": "1629210836.0", "edited": "False", "id": "h9am2hu", "is_submitter": "False", "link_id": "t3_p62ieu", "parent_id": "t3_p62ieu", "score": "11", "subreddit": "royalenfield", "subreddit_id": "t5_2tlx7"}, {"author": "mrseitz", "body": "While there are certainly some asshole drivers out there, I think a large part of the problem is really just reduced visibility rather than actual malicious intent or a lack of respect. \n\nThis video talks about a lot of the issues with invisibility regarding motorcycles: https://youtu.be/x94PGgYKHQ0\n\nFortunately, I haven’t yet had any serious close calls or accidents on the motorcycle, but I have experienced this phenomenon both as a car driver and a cyclist.\n\nWhen I was the car driver, I don’t think the biker was doing himself any favors by tailgating the turning car in front of him, but with that said it was my responsibility to make sure the road was clear to go and it would have 100% been my fault if it had caused an accident. It was since I had been riding and I always try to be extra cognizant of bikers as I’m aware of the problem. I head checked three times before I decided to go, and I’m guessing he was just perfectly hidden (or at least his headlight was) behind the turning car, but I started to pull out and saw him for the first time when he swerved to avoid me. He got right around me without an incident and just kept on riding, but I was so upset that I had to pull over and I honestly thought I was going to vomit. Like I said, it would have 100% been my fault if an accident had occurred, but there was no intent to do anything shitty, I just straight up didn’t see him until it was too late, despite me trying to be extra careful at a dangerous intersection. It’s definitely a situation that I’m going to be more careful about in the future. \n\nWhen I was the bicyclist, a car passed me super close and then dead stopped to take a left hand turn. However, they did that weird thing where they swung right to prepare for the left hand turn, so they completely closed my travel lane. I was going down hill fast on skinny road tires and just didn’t have the traction to stop that fast, so I bailed into a driveway, wiped out when I hit the grass, and skidded long enough to cross another driveway and come to a stop in the next yard. I looked up after stopping, visibly injured (though not seriously) and with a visibly unrideable bicycle, and I was past the car still waiting to take a left, and she had no clue that I was there or that anything had happened. I was obviously angry, but I don’t think any of it was intentional. After she passed me, I was old news and she was no longer considering me in her driving. And she was so focused on making her turn safely that she didn’t even see my wiping out past her, well within her field of view. \n\nAnyway, I guess my point is that it is certainly more dangerous to be on a smaller, less visible vehicle without the safety of a metal cage, seat belts, and airbags. And it is certainly infuriating when someone compromises your safety, regardless of intent, but I do think that much of the issue is more related to visibility/invisibility of a smaller vehicle than it is related to a lack of respect for smaller vehicles or even incompetence/inattentiveness.", "created_utc": "1629037316.0", "edited": "False", "id": "h917oog", "is_submitter": "False", "link_id": "t3_p4sdpu", "parent_id": "t3_p4sdpu", "score": "2", "subreddit": "motorcycles", "subreddit_id": "t5_2qi6d"}, {"author": "mrseitz", "body": "Have you looked at Alpha Cars? I half considered driving up from CT and checking out their shop in Spencer because they seemed to have more in stock inventory than the Enfield shop. \n\nhttps://www.alphacars.com/inventory?comment5=M&dealer_id%5B0%5D=8906&dealer_id%5B1%5D=8329&dealer_id%5B2%5D=8171&dealer_id%5B3%5D=8330&make=Royal+Enfield", "created_utc": "1628555710.0", "edited": "False", "id": "h8cqbsp", "is_submitter": "False", "link_id": "t3_p1br45", "parent_id": "t1_h8c9nwn", "score": "1", "subreddit": "royalenfield", "subreddit_id": "t5_2tlx7"}, {"author": "mrseitz", "body": "Whereabouts in CT? I’m in Ellington, just picked up my INT650 from the Enfield shop in June.", "created_utc": "1628555481.0", "edited": "False", "id": "h8cpuhh", "is_submitter": "False", "link_id": "t3_p1br45", "parent_id": "t3_p1br45", "score": "3", "subreddit": "royalenfield", "subreddit_id": "t5_2tlx7"}, {"author": "mrseitz", "body": "Plenty of good advice here already, and I would tend to agree that it’s probably from gripping too tight and/or putting too much weight on your hands. I’m a fairly new rider as well, and I’ve definitely had problems with numb hands as well. I watched a Motojitsu video where he talked about keep your grip loose, and said that you should be able to “play the piano”. So I try to make sure I intentionally loosen up and wiggle my fingers some, and it seems to help. I also try to make sure I keep some bend in my arms, because locking out straight seems to affect it as well, though it might just make me more likely to grip too tight.", "created_utc": "1628274522.0", "edited": "False", "id": "h7yr5le", "is_submitter": "False", "link_id": "t3_oz6dww", "parent_id": "t3_oz6dww", "score": "1", "subreddit": "motorcycles", "subreddit_id": "t5_2qi6d"}, {"author": "mrseitz", "body": "I will let you know! I had a good experience buying it and everyone has been pleasant but they definitely have serious staffing shortages that make it tough to deal with them. They told me that they reserve spots for customers so they can get their services done and do warranty claims, but they said that they’re scheduling like a month and a half out for service if you didn’t buy it there. But I dropped it off on Tuesday and haven’t heard anything yet. They also said that if it needs a new cooler, it’s not in stock and will need to be shipped from TX. I’m going to call for an update today, but I’m hoping that they’ve at least checked on that and ordered a replacement so it isn’t out of service for an extra week because they didn’t get the parts ordered. Mark told me that I’m only his second warranty claim and the first genuine break down on all the 650s that they’ve sold, so hopefully this is just a random fluke and it’ll be a good bike for me when it’s corrected. \n\nHow was doing the valve check? I can manage the oil changes myself but I would be learning by doing with a service manual on the valve check, which just makes me nervous on a brand new bike.", "created_utc": "1625231531.0", "edited": "False", "id": "h3su77w", "is_submitter": "True", "link_id": "t3_obo6fo", "parent_id": "t1_h3ss66i", "score": "2", "subreddit": "royalenfield", "subreddit_id": "t5_2tlx7"}, {"author": "mrseitz", "body": "If you’re talking about Mark’s Motorsports, then this is the bike! Haha. It was the only one left when I bought it. Like I said, I would have had a hard time passing up a Baker Express if there was one in stock. I love the paint job and the blacked out wheels and fenders on that one. I actually considered going to the nearest dealer in Massachusetts that had one in stock, but I figured I could save some money and not have to go to the DMV haha.", "created_utc": "1625229550.0", "edited": "False", "id": "h3sqkbv", "is_submitter": "True", "link_id": "t3_obo6fo", "parent_id": "t1_h3spndp", "score": "1", "subreddit": "royalenfield", "subreddit_id": "t5_2tlx7"}, {"author": "mrseitz", "body": "They were offering 200 off MSRP, I countered with 500 and they gave it to me. Mine is black, it seems like they have a harder time moving those. I think if they had a Baker Express in stock I would have been very tempted to pay the extra since it probably wouldn’t make much difference payment-wise. I did say if I was going to pay full MSRP that I would go find a 2021 instead.", "created_utc": "1625203142.0", "edited": "False", "id": "h3rsdnx", "is_submitter": "True", "link_id": "t3_obo6fo", "parent_id": "t1_h3rcwr0", "score": "2", "subreddit": "royalenfield", "subreddit_id": "t5_2tlx7"}, {"author": "mrseitz", "body": "Thanks for the info! Still haven't heard back from the dealership (I dropped it off on Tuesday), so I'm just feeling antsy about it. I'm sure it should be covered and taken care of, so hopefully I'll be back on the road shortly!", "created_utc": "1625184942.0", "edited": "False", "id": "h3qw0zb", "is_submitter": "True", "link_id": "t3_obo6fo", "parent_id": "t1_h3qupd9", "score": "2", "subreddit": "royalenfield", "subreddit_id": "t5_2tlx7"}, {"author": "mrseitz", "body": "Yeah, I searched around and didn't find anyone else talking about it as an issue, so I was kind of figuring it was just my crummy luck haha.\n\nDo you mean the connections to the hoses on the bottom? Or something internal? I was hoping it was a loose hose connection at the bottom so I could just tighten it up and replace the lost oil, but then I noticed it was leaking right out the side of the cooler.", "created_utc": "1625183212.0", "edited": "False", "id": "h3qspih", "is_submitter": "True", "link_id": "t3_obo6fo", "parent_id": "t1_h3p2y6p", "score": "2", "subreddit": "royalenfield", "subreddit_id": "t5_2tlx7"}, {"author": "mrseitz", "body": "It's a leftover 2019, bought new a week ago and I've only put 156 miles on it. Started while I was cruising along at about 40 mph. It painted my left leg with oil before I noticed and pulled over. I've searched around a little bit and haven't found any mention of anyone with a similar problem. I dropped it at the dealer, and barring some sort of road damage I can't see, it should be fixed under warranty. I'm just a little taken aback as I bought the new motorcycle for the sake of reliability after my old 250 junker left me stranded three hours from home. At least it only stranded me a hour from home this time.", "created_utc": "1625153666.0", "edited": "1625154350.0", "id": "h3oy9am", "is_submitter": "True", "link_id": "t3_obo6fo", "parent_id": "t3_obo6fo", "score": "4", "subreddit": "royalenfield", "subreddit_id": "t5_2tlx7"}, {"author": "mrseitz", "body": "Definitely study Spanish! I can comment on this from the other side, because I have studied both, but Spanish is the utility language here in the U.S., and French was the one that had the foreign mystique that I was looking for haha. I ended up studying both, but I always lose motivation on Spanish because I’m not doing it because I love it.\n\nAlso, I tried studying both when I was in college, and it was quite messy. I think it’s good advice regardless, but especially with closely related languages, I would plan to learn one or the other to a decent level before learning the other.", "created_utc": "1621683867.0", "edited": "False", "id": "gz1otan", "is_submitter": "False", "link_id": "t3_ni7fkv", "parent_id": "t3_ni7fkv", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "mrseitz", "body": "I would recommend shopping around until you find someone you like. I always just use tutoring for speaking practice with no actual lesson, but I usually have to try a handful until I find someone I feel comfortable chatting with. If it’s not a good fit, it’s not going to help you progress. I think you should just move on and try another tutor.", "created_utc": "1620407035.0", "edited": "False", "id": "gxal9z9", "is_submitter": "False", "link_id": "t3_n6xsmz", "parent_id": "t3_n6xsmz", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "mrseitz", "body": "Most importantly, I would second that you should learn the one that you are most passionate about or is most interesting to you. I have tried to learn Spanish three separate times because it is the most practical second language to speak in the U.S., but I’m really just not that into it and thus I never get rolling with it. \n\nI did put in my vote for Russian, but I figured I would explain more and give you the order of precedence in my opinion. \n\n1 - Russian: I think this is the obvious choice, as Russia is a world power, and also more of an adversarial relationship that is a common concern in U.S. foreign policy. It is also an official language of the U.N. and is probably the most widespread both in number of speakers and number of places it could be useful in, due to second language speakers in the former Soviet sphere of influence. \n\n2 - Turkish: A regional power involved in much of the happenings in the MENA region, and more of a niche than Russian. If you are interested in the region specifically, that could be a reason to elevate this to your number 1. \n\n3 - Hungarian: Not comparatively important for U.S. foreign policy issues, but definitely an interesting niche language. \n\n4 - Greek: Maybe slightly more important foreign policy-wise, but I rated it lower because there are A LOT of second language speakers of Greek in the U.S., so that takes some of the points away for the niche concept. \n\n5 - German: I considered rating this 3rd, as Germany is obviously an important nation in E.U. affairs, but I knocked it down because it’s likely the most commonly studied language by Americans on your list, the easiest to learn on your list, and I would guess that it’s one of the most competitive postings (at least compared to the countries that speak the other languages on your list). Though if the ease of learning/availability of resources is a concern for you, that could be a reason to bump this up on your list. \n\nJust my thoughts! I’m sure there are lots of different opinions floating around.", "created_utc": "1619410933.0", "edited": "False", "id": "gvw8qon", "is_submitter": "False", "link_id": "t3_mynpca", "parent_id": "t3_mynpca", "score": "17", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "mrseitz", "body": "The alif has a different diacritic called a Wasla. https://en.m.wikipedia.org/wiki/Wasla", "created_utc": "1612981924.0", "edited": "False", "id": "gmufi5p", "is_submitter": "False", "link_id": "t3_lgyesk", "parent_id": "t3_lgyesk", "score": "3", "subreddit": "learn_arabic", "subreddit_id": "t5_2v4vi"}]