[{"author": "MusParvum", "body": "For science, I like La Hiperactina, Quantum Fracture, Size Matters, and DotCSV (although that last one is more computers/tech/AI, but still good). Edited to add: Oh! and La gata de Schrödinger also.", "created_utc": "1666795876.0", "edited": "1666797283.0", "id": "itv13rq", "is_submitter": "False", "link_id": "t3_ydx3py", "parent_id": "t3_ydx3py", "score": "3", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "MusParvum", "body": "You might want to consider starting with YouTube channels... Dreaming Spanish, Español con Juan, and Español con Guada are great channels for beginners. Series and movies tend to be pretty fast and complicated. YouTubers - especially ones geared towards learners like the above channels - ease you into listening with a slower rate of speech, clearer enunciation, and less slang and crosstalk.", "created_utc": "1666475783.0", "edited": "False", "id": "itdu4dw", "is_submitter": "False", "link_id": "t3_yapdyv", "parent_id": "t3_yapdyv", "score": "7", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "MusParvum", "body": "It depends a lot on context... who are you talking to, and where are you? Random person at a party? Someone in your group on a guided tour? Person in line with you at a store?\n\nI personally like asking questions, because that takes some of the pressure off me to speak and think of what to say. So you can ask the person something related to the situation you're in (party, tour, etc). Or ask them if they have any recommendations of local things to do (restaurants, sites to see, etc).\n\nJust think of some of the most likely situations you think you'll be in, and brainstorm a few possible questions for each. Then, when you put them to use, listen to what the person actually says, and come up with more questions based on their reply.", "created_utc": "1666470594.0", "edited": "False", "id": "itdi35l", "is_submitter": "False", "link_id": "t3_yajevm", "parent_id": "t3_yajevm", "score": "1", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "MusParvum", "body": "Were they aware of your current level of Spanish when they hired you? If so, I'd say go for it. You can definitely improve a good bit in 6 months if you're starting from a good base, but it's still probably going to be pretty rough at first. As long as there's no expectation that you already have a good level, IMO it will still be an amazing experience, if you go into it knowing it's going to be hard. Find a language exchange partner on HelloTalk or Tandem or r/language_exchange and/or get a tutor on iTalki or Preply. Talk multiple times per week. Watch as many Spanish language YouTube videos as possible every day, at least a few hours, to bolster your listening comprehension. Then go, and give it your best shot. The worst that will happen is you'll fail and find something else to do. But it seems like the potential upside of it could be amazing.", "created_utc": "1666229635.0", "edited": "False", "id": "it0kuun", "is_submitter": "False", "link_id": "t3_y8j325", "parent_id": "t3_y8j325", "score": "5", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "MusParvum", "body": "Considering that there's a flair dedicated to this type of post, and there's actually only been about 9 of them total in the past month and a half, it seems like it'd be kinda weird to restrict them.", "created_utc": "1666207620.0", "edited": "False", "id": "isz4eks", "is_submitter": "False", "link_id": "t3_y89e85", "parent_id": "t1_isz1iu6", "score": "29", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "MusParvum", "body": "Seconding Vetusta Morla!", "created_utc": "1666187930.0", "edited": "False", "id": "isxqp8a", "is_submitter": "False", "link_id": "t3_y80mli", "parent_id": "t1_isxf41a", "score": "8", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "MusParvum", "body": "For ruthless repetition, try [conjuguemos.com](https://conjuguemos.com) ... [https://conjuguemos.com/activities/french/verb/1](https://conjuguemos.com/activities/french/verb/1)", "created_utc": "1666018124.0", "edited": "False", "id": "isohjbw", "is_submitter": "False", "link_id": "t3_y67ga3", "parent_id": "t3_y67ga3", "score": "4", "subreddit": "French", "subreddit_id": "t5_2rd5t"}, {"author": "MusParvum", "body": "We get better at the things we practice, so... speak more. As often as you can. Even better if you can regularly speak with a native speaker who's willing to correct your mistakes (an online tutor, for example, or a language exchange partner).", "created_utc": "1665771099.0", "edited": "False", "id": "isbh41l", "is_submitter": "False", "link_id": "t3_y3zrtk", "parent_id": "t3_y3zrtk", "score": "3", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "MusParvum", "body": "I don't think an online test you can take on your lunch break counts as \"official\". If you just want a general idea of what level you are, you might as well look at the CEFR self-assessment chart and get an idea from there: [https://rm.coe.int/CoERMPublicCommonSearchServices/DisplayDCTMContent?documentId=090000168045bb52](https://rm.coe.int/CoERMPublicCommonSearchServices/DisplayDCTMContent?documentId=090000168045bb52)\n\nBut, as others have mentioned, the test is probably looking at the \"correctness\" of your answers, not whether someone can figure out what you're trying to say. So, if you're interested improving on that test, the best thing would probably be to re-take it when you have more time, look at what you got wrong, then study those areas.\n\nThat being said, it's very cool that you can communicate and make yourself understood. That's an accomplishment in and of itself.", "created_utc": "1665770098.0", "edited": "False", "id": "isbemgn", "is_submitter": "False", "link_id": "t3_y3y2f0", "parent_id": "t3_y3y2f0", "score": "8", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "MusParvum", "body": "No funciona el enlace de Instagram. (Y, por cierto, que mapa tan bonito!)", "created_utc": "1665670213.0", "edited": "False", "id": "is5nqfk", "is_submitter": "False", "link_id": "t3_y2u5rx", "parent_id": "t1_is4uw06", "score": "2", "subreddit": "spain", "subreddit_id": "t5_2qhd6"}, {"author": "MusParvum", "body": "\"Me entiendes?\" and \"Sabes?\" are two that I've heard.", "created_utc": "1665603056.0", "edited": "False", "id": "is26i4t", "is_submitter": "False", "link_id": "t3_y2cpqc", "parent_id": "t3_y2cpqc", "score": "34", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "MusParvum", "body": "Ha pasado en una manera parecida aquí en los EEUU. Parece que la derecha ha apropriado la bandera de EEUU. Pero no voy a dejar que la tienen unicamente. También es mi pais y mi bandera, así que aunque no estoy para nada de acuerdo con la derecha, pongo la bandera delante de mi casa. No lo sé, sí es posible que la situación allí es bastante diferente, pero aquí me siento así.", "created_utc": "1665583057.0", "edited": "False", "id": "is0satm", "is_submitter": "False", "link_id": "t3_y1u1t7", "parent_id": "t1_is08pwz", "score": "0", "subreddit": "spain", "subreddit_id": "t5_2qhd6"}, {"author": "MusParvum", "body": "View it as the perfect opportunity to improve. You are not where you want to be, but you are surrounded by people who ARE where you want to be, people who you can listen to and learn from. Pick something different to work on and improve each week, and take advantage of the fact that the people around you can serve as inspiration and guides. This is a gift - if you pay attention, identify specific weaknesses you have, and consistently work on them, you will come out better than before.\n\n(And don't be put off by the fact that many of them are younger than you - once you realize that you can learn something valuable from people of literally any age, it stops your pride from getting in the way. You are not \"inferior\", you just have different strengths and weaknesses.)", "created_utc": "1665423675.0", "edited": "False", "id": "irsbp1b", "is_submitter": "False", "link_id": "t3_y0jcgx", "parent_id": "t3_y0jcgx", "score": "12", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "MusParvum", "body": "A few science channels:\n\nLa Hiperactina\n\nQuantum Fracture\n\nDotCSV (more tech and AI than science, but still good)", "created_utc": "1665408957.0", "edited": "False", "id": "irrceg1", "is_submitter": "False", "link_id": "t3_y0e09u", "parent_id": "t3_y0e09u", "score": "3", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "MusParvum", "body": ">I think part of the issue is I don't see they're/their as the same as a ser and hacer. Really, they're the same obviously. But in my learning mind, I just hadn't connected it.\n\nI totally get this! It's something I've noticed happening a few times while learning Spanish - some phrase or structure in Spanish seems really odd or makes no sense to me, and then I suddenly realize that we have something similar in English, but I just took it for granted and never really thought about it, simply because it's my native language.\n\nI think realizing what the issue is is the first step (which you've done), and then it's just a matter of being alert for it until you get enough practice with it that it doesn't trip you up. At least, that's the kind of thing I keep telling myself when I run into problems. :)", "created_utc": "1665257693.0", "edited": "False", "id": "irjpv40", "is_submitter": "False", "link_id": "t3_xyxrw6", "parent_id": "t1_irjfq7o", "score": "22", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "MusParvum", "body": ">I thought.. The fuck? I ain't no hole\n\nI think you figured it out already... context. The same way if someone says to you \"Are you new here?\" you know they're not saying \"Are you knew here?\" or if they say \"We're going to build a shed\" you know they're not saying \"We're going to billed a shed\".", "created_utc": "1665248847.0", "edited": "False", "id": "irj7ko3", "is_submitter": "False", "link_id": "t3_xyxrw6", "parent_id": "t3_xyxrw6", "score": "294", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "MusParvum", "body": "La he buscada. 82 km. Ostras! Al menos hay paisajes preciosos mientras se matan los corredores.", "created_utc": "1665155118.0", "edited": "False", "id": "iretubq", "is_submitter": "False", "link_id": "t3_xx5p6g", "parent_id": "t1_iredz2x", "score": "2", "subreddit": "spain", "subreddit_id": "t5_2qhd6"}, {"author": "MusParvum", "body": "Grammar is pretty important. By B1 I think you should start having a pretty good grasp on a lot of the basics, but if you feel shaky, then yeah, I'd say do some grammar study alongside the other stuff (a tutor on iTalki can be helpful with that, too, especially if you get a professional on instead of just a community one). You could pick it up by listening, but it'd probably take longer than 6 months.\n\nAs for conjugations: Go to [conjuguemos.com](https://conjuguemos.com) and do their conjugation quiz. You can customize it to ask only certain tenses, so start with the ones you know. Then for the ones you don't know yet, pick one, review it ahead of time, then add it to your quiz. When you feel you're getting a handle on it, review and add another, and keep going until you've added them all and are regularly scoring well.", "created_utc": "1665111410.0", "edited": "False", "id": "ird2egq", "is_submitter": "False", "link_id": "t3_xxf9pm", "parent_id": "t1_irbu6re", "score": "3", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "MusParvum", "body": "Definitely possible to be from somewhat conversational to quite conversational. You need as much practice as possible listening and speaking.\n\n1. Listen to a ton of YouTube, especially YouTubers from the country you'll be going to. Every day. The more, the better.\n2. Either find some Spanish speaking friends online to talk with, or hire a tutor on iTalki. Or both. Talk with someone at least once a week, more if possible.", "created_utc": "1665088723.0", "edited": "False", "id": "irbso0r", "is_submitter": "False", "link_id": "t3_xxf9pm", "parent_id": "t3_xxf9pm", "score": "2", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "MusParvum", "body": "Qué impresionante! ¿Las banderitas naranjas marcan un sendero?", "created_utc": "1665076569.0", "edited": "False", "id": "irayzxr", "is_submitter": "False", "link_id": "t3_xx5p6g", "parent_id": "t3_xx5p6g", "score": "8", "subreddit": "spain", "subreddit_id": "t5_2qhd6"}, {"author": "MusParvum", "body": ">repeats himself a ton\n\nI really really wish people in real life repeated themselves as much as he does. :) It gives you a second chance to understand, and also some extra time to absorb the message before he moves on to the next thought. It's a pretty brilliant technique for teaching the language.", "created_utc": "1664850094.0", "edited": "False", "id": "iqytpd5", "is_submitter": "False", "link_id": "t3_xuyraw", "parent_id": "t1_iqyp04c", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "MusParvum", "body": "I can relate to this so much. Way too many times I can tell generally what someone's talking about, but have to guess at exactly what they're saying about it. Sometimes I'm right, sometimes I'm wrong. Definitely frustrating.", "created_utc": "1664849850.0", "edited": "False", "id": "iqyt624", "is_submitter": "False", "link_id": "t3_xuyraw", "parent_id": "t1_iqycb90", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "MusParvum", "body": "How many hours per day have you been studying, and what does studying consist of, for you? Generally, it's not about the length of time on the calendar, but the total number of hours. So, for example, someone who puts in an average of 2 hours per day for 6 months will often outperform someone who's put in an average of a half hour per day for a year.", "created_utc": "1664817787.0", "edited": "False", "id": "iqwocr7", "is_submitter": "False", "link_id": "t3_xuor63", "parent_id": "t3_xuor63", "score": "38", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "MusParvum", "body": "The \"como\" translation is understanding the word \"like\" in the sense of \"similar to\". In other words, it's translating the sentence as if it meant \"The people in the city (who are) similar to him\" not \"The people in the city (feel affection towards) him\".", "created_utc": "1664461523.0", "edited": "False", "id": "iqdcmk0", "is_submitter": "False", "link_id": "t3_xr6e8r", "parent_id": "t1_iqcxskn", "score": "7", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "MusParvum", "body": "This makes sense. Although, since the exchange rate really only affects you (it's unfortunate, but it's not really the teacher's problem), you might consider also pointing out how the teacher benefits - she gets a guaranteed chunk of money up front (assuming you'll be paying for the three months ahead of time).", "created_utc": "1664420106.0", "edited": "False", "id": "iqblcv1", "is_submitter": "False", "link_id": "t3_xqverp", "parent_id": "t1_iqbhovc", "score": "8", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "MusParvum", "body": "Don't think that your thoughts are stupid or that you're dumb! Having curiosity, realizing you don't know something, and trying to find answers is how you learn. It's a good thing! :)", "created_utc": "1664417332.0", "edited": "False", "id": "iqbfmsr", "is_submitter": "False", "link_id": "t3_xqu5n3", "parent_id": "t3_xqu5n3", "score": "3", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "MusParvum", "body": "Have fun, take your time, expect to mess up and blank out a lot (but realize that this is part of the learning process, so it's a good thing).", "created_utc": "1664305173.0", "edited": "False", "id": "iq51gh1", "is_submitter": "False", "link_id": "t3_xpo8v9", "parent_id": "t3_xpo8v9", "score": "15", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "MusParvum", "body": "Great, glad I could help!", "created_utc": "1663875449.0", "edited": "False", "id": "ipidksj", "is_submitter": "False", "link_id": "t3_xj1zdq", "parent_id": "t1_ipfnlkc", "score": "1", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "MusParvum", "body": "Try some other beginner-level material such as the Nivel 1 playlist on Español con Juan or even rewatch some of the harder or more interesting beginner-level Dreaming Spanish videos. Then try an intermediate video every couple of days. They'll get easier, you just need to clock more hours at/around your current level and keep trying them regularly.", "created_utc": "1663696318.0", "edited": "False", "id": "ip814g4", "is_submitter": "False", "link_id": "t3_xj1zdq", "parent_id": "t3_xj1zdq", "score": "4", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "MusParvum", "body": "Toc Toc on Netflix.", "created_utc": "1663520265.0", "edited": "False", "id": "ioy4twp", "is_submitter": "False", "link_id": "t3_xh5hwe", "parent_id": "t3_xh5hwe", "score": "1", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "MusParvum", "body": "Quién intenta capturar a quién aquí??? 🤔", "created_utc": "1663432945.0", "edited": "False", "id": "iotcnw8", "is_submitter": "False", "link_id": "t3_xgleh3", "parent_id": "t3_xgleh3", "score": "3", "subreddit": "spain", "subreddit_id": "t5_2qhd6"}, {"author": "MusParvum", "body": "I think it makes total sense to still have a tutor. But it would be good to also regularly try to speak to random people. If it's difficult to make yourself do it, maybe ask your tutor to give you homework, something along the lines of \"Ask a store clerk for directions this week and tell me how it went in our next class.\" That little bit of accountability with a specific goal might help.", "created_utc": "1663341535.0", "edited": "False", "id": "ioobxdn", "is_submitter": "False", "link_id": "t3_xfqn8i", "parent_id": "t3_xfqn8i", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "MusParvum", "body": "This is the way. Start with the Superbeginner playlist on the Dreaming Spanish YouTube channel, and work your way up and branch out from there. Once you're reliably understanding much of the learner-oriented YouTube channels, start looking for YouTube channels and podcasts intended for a native Spanish-speaking audience. Movies are notoriously difficult to understand for various reasons, and YouTube and podcasts will be a good (and possibly lengthy) stepping stone as you work your way up to them.", "created_utc": "1663266455.0", "edited": "False", "id": "iokacyk", "is_submitter": "False", "link_id": "t3_xemf0l", "parent_id": "t1_iohqlcm", "score": "4", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "MusParvum", "body": "Dale a la Lengua: https://speakinspanish.co.uk/podcast-dale-a-la-lengua/", "created_utc": "1663251846.0", "edited": "False", "id": "ioj8r2b", "is_submitter": "False", "link_id": "t3_xev7ak", "parent_id": "t3_xev7ak", "score": "1", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "MusParvum", "body": "I've heard there are plenty of options in Spain, but I don't know about seasonality or child care. Another option in the meantime is to self-immerse by watching/listening to a ton of Spanish-language YouTube videos and podcasts, and do online language exchanges or iTalki sessions a couple times per week.", "created_utc": "1663167141.0", "edited": "False", "id": "ioej85y", "is_submitter": "False", "link_id": "t3_xe0n6x", "parent_id": "t3_xe0n6x", "score": "1", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "MusParvum", "body": "Playing video games, watching movies and series, collecting stamps, playing basketball, hiking, gardening, reading, deep sea diving, and many other hobbies will probably never be useful or get you a job, but people almost never question if they're a waste of time. If you enjoy it and it isn't hurting anyone, it's worth it, and you're not wasting your time!", "created_utc": "1663122334.0", "edited": "False", "id": "iocdil5", "is_submitter": "False", "link_id": "t3_xdnyfl", "parent_id": "t3_xdnyfl", "score": "7", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "MusParvum", "body": "The numbering off when you're on defense isn't for stack position, it's for deciding who you'll be covering on the other team when doing a person-to-person defense. 1 is the person on the far left, and 7 is the person on the far right (0 is just what's said to begin the process). So if you want to cover the 4th person, you wait until someone calls \"3\" then you call \"4\". (Edited to add: Then you stick with that person throughout your defense, no matter where they are in their stack.)\n\nAs for position in the vert stack, in my experience (pick up and league) position isn't usually specified. At most, sometimes someone may be designated to \"set the stack\" - that's the person in the front, closest to the handler, and someone may  be designated as \"first cut\" and they'll be at the back of the stack. But other than that, you just kinda fill in wherever and it changes as the point progresses.", "created_utc": "1663118305.0", "edited": "False", "id": "ioc4gwt", "is_submitter": "False", "link_id": "t3_xdnuif", "parent_id": "t3_xdnuif", "score": "32", "subreddit": "ultimate", "subreddit_id": "t5_2qnym"}, {"author": "MusParvum", "body": "Are you sure he wasn't talking about \"mucho más mejor\"? I used to say this sometimes, much to the annoyance of my Spanish tutor. :)", "created_utc": "1663089645.0", "edited": "False", "id": "ioa7jiy", "is_submitter": "False", "link_id": "t3_xdc0p9", "parent_id": "t3_xdc0p9", "score": "10", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "MusParvum", "body": "Exactly. When people say stuff like \"most native speakers are only B2\" or whatever, I think what they're usually trying to say is something like \"most native speakers regularly only use a 6th grade vocabulary\" or something like that. But even if that's true (sounds reasonable, but I have no idea) it's an entirely different thing.", "created_utc": "1662997955.0", "edited": "False", "id": "io4wr5h", "is_submitter": "False", "link_id": "t3_xcfxqr", "parent_id": "t3_xcfxqr", "score": "81", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "MusParvum", "body": ">I can understand everything being said, all the time, without hyper-focusing on it\n\nIs this the case only with your teacher, or with any random Spanish speaker? For example, can you go to any random Spanish-language YouTube video and more than likely understand most of what they're saying?\n\nAs for the speaking aspect, IMO it's probably fine to still make mistakes, as long as they aren't so frequent or major that they stop you from being understood, or make the listener struggle to understand you.", "created_utc": "1662833213.0", "edited": "False", "id": "invtwdd", "is_submitter": "False", "link_id": "t3_xatsog", "parent_id": "t3_xatsog", "score": "34", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "MusParvum", "body": "With French, TBH it's only at the very baby stages right now. I'm focusing more on Spanish, so I only spend a small portion of my time on French. I can sometimes pick out a few words or short phrases in simpler YouTube videos, but that's about it. My Spanish listening is much better - I've been at it for about 2 years now, averaging maybe an hour a day? But even so I can still find plenty that's hard to understand. It all depends on accent, speed, enunciation, subject matter, and whether I've had my coffee yet.", "created_utc": "1662751447.0", "edited": "False", "id": "inrjnwv", "is_submitter": "False", "link_id": "t3_x54kaa", "parent_id": "t1_inrbt5n", "score": "2", "subreddit": "French", "subreddit_id": "t5_2rd5t"}, {"author": "MusParvum", "body": "Thanks for the reply - that's good context to know. I definitely feel like I need to up my listening game even more now. :)", "created_utc": "1662740981.0", "edited": "False", "id": "inqtfos", "is_submitter": "False", "link_id": "t3_x54kaa", "parent_id": "t1_inqm6vs", "score": "1", "subreddit": "French", "subreddit_id": "t5_2rd5t"}, {"author": "MusParvum", "body": "Very impressive! Is French the first foreign language you've learned, or do you speak any others?", "created_utc": "1662737942.0", "edited": "False", "id": "inqlquc", "is_submitter": "False", "link_id": "t3_x54kaa", "parent_id": "t3_x54kaa", "score": "1", "subreddit": "French", "subreddit_id": "t5_2rd5t"}, {"author": "MusParvum", "body": "Some people want to play video games. Why? They're fun. Some people like to read about history. Why? It's interesting to them. Etc. If you actually enjoy learning it, that's reason enough to do it as a hobby. There doesn't have to be a deep reason to it if it adds joy to your life and isn't hurting anyone.", "created_utc": "1662433405.0", "edited": "False", "id": "in9nj3w", "is_submitter": "False", "link_id": "t3_x6xiyw", "parent_id": "t1_in9k1ea", "score": "1", "subreddit": "LearnJapanese", "subreddit_id": "t5_2qyls"}, {"author": "MusParvum", "body": "Don't be discouraged. Do recalibrate your expectations.\n\nYour progress won't be determined by a given length of time on the calendar, but by the total number of hours you put in. In other words, to get conversationally fluent within 6 months (starting from zero) you're going to have to put in more than 1 or 2 hours per day.\n\nFor comparison: I probably averaged between 1 and 2 hours a day with Spanish (mainly some combination of Busuu, watching videos, texting with native speakers, and later on iTalki and conversation exchanges)... it took me about a year before I felt like I could haltingly hold up one end of a conversation if the other person was extremely patient with me. Now, almost 2 years in, I can definitely speak a little more fluidly (but not yet \"fluently\" to my mind), but still have to pause and think regularly, still make plenty of mistakes, and need a fairly patient conversational partner. But I can usually get my point across and understand much (not all!) of what's being said to me.\n\nSo definitely don't give up. But if you want \"conversational fluency\" in a shorter time period, you're going to have to engage with the language (listening, reading, writing, and speaking) for a decent chunk of each and every day.", "created_utc": "1662050223.0", "edited": "False", "id": "imogk5l", "is_submitter": "False", "link_id": "t3_x3bj3q", "parent_id": "t3_x3bj3q", "score": "4", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "MusParvum", "body": "If you're willing to help your new friend learn your native language, try asking on r/language_exchange too!", "created_utc": "1661604796.0", "edited": "False", "id": "ilzw713", "is_submitter": "False", "link_id": "t3_wz0fea", "parent_id": "t3_wz0fea", "score": "1", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "MusParvum", "body": "Si lo crees, es tu realidad.", "created_utc": "1661554423.0", "edited": "False", "id": "ilxkpzf", "is_submitter": "False", "link_id": "t3_wy43hc", "parent_id": "t3_wy43hc", "score": "1", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "MusParvum", "body": "Alex Tienda... Mexican, not exactly slow, but he's not super fast and he enunciates well.\n\nEl Jardín de Martín (and his other channel Martin Acquires a Language) ...I believe he's Peruvian. But he speaks at a reasonable pace and I've found him (relatively) easy to understand.", "created_utc": "1661544999.0", "edited": "False", "id": "ilwy6v7", "is_submitter": "False", "link_id": "t3_wycqf8", "parent_id": "t3_wycqf8", "score": "5", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "MusParvum", "body": "For travel:\n\nLuisito Comunica\n\nAlex Tienda\n\nJorge De León (more \"hiking\" than \"travel\" (from the vids I've watched) but he hikes in a lot of different cool locations)", "created_utc": "1661119932.0", "edited": "False", "id": "il8x0hq", "is_submitter": "False", "link_id": "t3_wub629", "parent_id": "t3_wub629", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "MusParvum", "body": "Slightly off topic, sorry: I'm amazed at the number of threads there seem to be where a native Spanish speaker says something to someone on multiple occasions, but refuses to explain what it means. I'm not complaining at all - I don't mind the threads. It just seems strange to me that it's such a common occurrence.", "created_utc": "1661025339.0", "edited": "False", "id": "il3tmjs", "is_submitter": "False", "link_id": "t3_wtcijl", "parent_id": "t3_wtcijl", "score": "17", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "MusParvum", "body": "Pavos! :)", "created_utc": "1660931172.0", "edited": "False", "id": "ikyn62j", "is_submitter": "False", "link_id": "t3_ws7bt4", "parent_id": "t1_ikwxy42", "score": "4", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "MusParvum", "body": "El Alquimista. La historia y la gramática son bastante sencillas, y la mayoría de las palabras inusuales se repiten a menudo.", "created_utc": "1660612787.0", "edited": "False", "id": "ikgmfy4", "is_submitter": "False", "link_id": "t3_wpfnr6", "parent_id": "t3_wpfnr6", "score": "1", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "MusParvum", "body": "They cover a variety of topics in a variety of ways, so hopefully you'll enjoy some of them. But it's probably also boring watching something where you only understand a couple words here and there, as you've been doing. Sometimes, at some point, you just have to slog through a little bit of discomfort to make some progress and get to the good stuff. Personally, I let myself find excitement and enjoyment in the simple fact that I'm understanding more and more, even if the actual content isn't 100% what I would normally want to watch.\n\nAs for my username, yes! And if it's wrong, it's wrong because it's been decades since I took Latin in school and I don't really remember how it works. :)", "created_utc": "1660600346.0", "edited": "False", "id": "ikftqq1", "is_submitter": "False", "link_id": "t3_wp83gj", "parent_id": "t1_ikfosol", "score": "1", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "MusParvum", "body": "Go find the Dreaming Spanish YouTube channel. Start with the Super Beginner playlist. When you can reliably understand most of what they're saying, move on to the Beginner playlist, etc.\n\nDon't use subtitles except to check them occasionally to identify a word or two. (For instance if you hear a word repeated a few times in the video, and it's important to understand the vid, and you can't figure it out from context.)\n\nAlso: Listening, speaking, reading, and writing all reinforce one another. If you know how to form your own phrases and sentences, that helps you guess what might come next and narrow down possibilities when you're listening to something.", "created_utc": "1660596559.0", "edited": "False", "id": "ikfk3xo", "is_submitter": "False", "link_id": "t3_wp83gj", "parent_id": "t3_wp83gj", "score": "3", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "MusParvum", "body": "Instead of watching TV (TV and movies are really hard), watch the SuperBeginner and Beginner playlists on the Dreaming Spanish YouTube channel.\n\nOther channels for learners to take a look at:\n\nWhy Not Spanish?\n\nHola Spanish", "created_utc": "1660572024.0", "edited": "False", "id": "ikdtdfg", "is_submitter": "False", "link_id": "t3_woq3ie", "parent_id": "t3_woq3ie", "score": "1", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "MusParvum", "body": "If you find Duo fun and useful, keep doing it. Duo and immersion will reinforce each other.", "created_utc": "1660481312.0", "edited": "False", "id": "ik8x7sn", "is_submitter": "False", "link_id": "t3_wo32ln", "parent_id": "t3_wo32ln", "score": "66", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "MusParvum", "body": "According to a few places on the internet, it comes from a Portuguese saying that used the word \"achar\" which makes better literal sense in Portuguese:\n\n[https://en.wiktionary.org/wiki/echar\\_de\\_menos](https://en.wiktionary.org/wiki/echar_de_menos)\n\nNo idea if this is true.", "created_utc": "1660431594.0", "edited": "False", "id": "ik6ppcn", "is_submitter": "False", "link_id": "t3_wnqjne", "parent_id": "t3_wnqjne", "score": "7", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "MusParvum", "body": "A conversational tutor on iTalki could definitely help. A good one can give you role playing situations specifically for that kind of thing.", "created_utc": "1660402448.0", "edited": "False", "id": "ik4ui8s", "is_submitter": "False", "link_id": "t3_wnfr4e", "parent_id": "t1_ik4tx30", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "MusParvum", "body": "You're not \"underperforming\". You are where you are, and the test is just a guide or indication of this moment in time. Maybe you are not B1 - yet. But A2 or \"very shaky B1\" or whatever is still a huge accomplishment, and it proves that you can learn and improve, and you will reach a solid B1 (and beyond) if you keep going.\n\nI would say find some German YouTubers that catch your interest, and watch as much of them as possible as a part of your study routine. Not German YouTubers that are teaching German (though that's fine too), but ones that are making videos for German-speaking natives, about subjects you are interested in - video games, travel, whatever. You will not understand everything at first, but at A2/Almost B1 you should be able to understand the gist of some of them if you can find ones with a little more relaxed style or who enunciate a little more clearly. And over time you will understand more and more.", "created_utc": "1660228288.0", "edited": "False", "id": "ijv0qdg", "is_submitter": "False", "link_id": "t3_wlmtra", "parent_id": "t1_iju7wl0", "score": "7", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "MusParvum", "body": "I think a lot of people (myself included) are just making an estimate of their level - they haven't necessarily taken an official test. For example, I used the CEFR self-assessment grid to \"determine\" that I'm B1-ish in Spanish:\n\n[https://rm.coe.int/CoERMPublicCommonSearchServices/DisplayDCTMContent?documentId=090000168045bb52](https://rm.coe.int/CoERMPublicCommonSearchServices/DisplayDCTMContent?documentId=090000168045bb52)\n\nAm I really B1? Not officially, but on average it seems like a decent approximation of my abilities. So one option would be to take your best guess at your level based on the stated criteria for the various levels.", "created_utc": "1660075501.0", "edited": "False", "id": "ijmilir", "is_submitter": "False", "link_id": "t3_wkcje0", "parent_id": "t3_wkcje0", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "MusParvum", "body": "Yep. If you're enjoying it, I'd say stick with it, but definitely add some other resources. Good luck to you too!", "created_utc": "1659726029.0", "edited": "False", "id": "ij39i6t", "is_submitter": "False", "link_id": "t3_wh1o8o", "parent_id": "t1_ij354bv", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "MusParvum", "body": "There's nothing wrong with simple, straightforward language, even in a professional context. Sure, you probably want to avoid most slang, but you don't need a lot of fancy vocabulary IMO.\n\nThat said, I know at least for my target language I've seen iTalki tutors who offer classes geared towards business and professional contexts. I'm sure there are similar tutors for English, so it might be worth taking a few hours of lessons from one of them so you can get some specific tips and suggestions geared towards where you are.", "created_utc": "1659724309.0", "edited": "False", "id": "ij3510d", "is_submitter": "False", "link_id": "t3_wh19tx", "parent_id": "t1_ij2w5f7", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "MusParvum", "body": "I finished their Spanish course, and definitely feel like it was worth it. It didn't make me fluent or get me where I'd like to be eventually, but it gave me a good base of familiarity with a decent amount of grammar and vocabulary.", "created_utc": "1659724008.0", "edited": "False", "id": "ij348r3", "is_submitter": "False", "link_id": "t3_wh1o8o", "parent_id": "t3_wh1o8o", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "MusParvum", "body": "Listening: Watch a ton of Spanish-language YouTube. Find a mix of channels targeted towards learners, and also channels targeted at native Spanish speakers that cover subjects you would normally be interested in in your native language. Watch as much as you have time for, every single day.\n\nSpeaking: Get a tutor on iTalki, and talk to them once per week. Also find a language exchange partner (a native Spanish speaker who is interested in learning/practicing your native language... there's a language exchange subreddit that's helpful for finding people) and talk to that person once per week (half in Spanish, half in your native language).", "created_utc": "1659723763.0", "edited": "False", "id": "ij33m2d", "is_submitter": "False", "link_id": "t3_wh1btq", "parent_id": "t3_wh1btq", "score": "4", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "MusParvum", "body": "You got good overall feedback from others... I just came to say that you probably want \"goombah\" not \"goomah\". Don't get discouraged - keep practicing and I'm sure you'll improve!", "created_utc": "1658940025.0", "edited": "False", "id": "ihve4eo", "is_submitter": "False", "link_id": "t3_w9cr6j", "parent_id": "t3_w9cr6j", "score": "4", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "MusParvum", "body": "Listen to as much as possible, preferably to easier material at first. Take a look at the Dreaming Spanish YouTube channel. They have playlists divided up by difficulty. Find the level where you can understand most of what they're saying - but not everything - and start there.", "created_utc": "1658851829.0", "edited": "False", "id": "ihqba98", "is_submitter": "False", "link_id": "t3_w81c6e", "parent_id": "t3_w81c6e", "score": "2", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "MusParvum", "body": "Yep. I don’t think it’s fatigue, just an ebb and flow sort of thing. I get a few days in a row where I feel like I can understand everything, then it transitions to a few days where I’m barely getting the gist of the harder stuff. Then back the other way. Sometimes I’ll just skew towards listening more to slightly easier stuff for a little while until it cycles the other way again. But I think it’s normal to have good and bad stretches.", "created_utc": "1658271967.0", "edited": "False", "id": "iguewg5", "is_submitter": "False", "link_id": "t3_w32sc6", "parent_id": "t3_w32sc6", "score": "5", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "MusParvum", "body": "I think I take a similar approach to yours. For instance I would have given the same feedback on that example sentence - point out that it's correct, but a more natural way would be X. I usually try to make a Critique Sandwich - something positive/encouraging, then the thing that could be improved, then something positive/encouraging.\n\n(Edited to add: But yeah, sometimes it's fine and it's just like \"Good job!\")", "created_utc": "1657746316.0", "edited": "False", "id": "ig1jr16", "is_submitter": "False", "link_id": "t3_vybsab", "parent_id": "t3_vybsab", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "MusParvum", "body": "Join a club, volunteer for something, and maybe take a skill-based class (art, pottery, musical instrument, etc). These kinds of activities would regularly put you in contact with people with a shared interest or goal, giving you a reason and opportunity to communicate.", "created_utc": "1657731550.0", "edited": "False", "id": "ig0hp2a", "is_submitter": "False", "link_id": "t3_vy5wjk", "parent_id": "t3_vy5wjk", "score": "2", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "MusParvum", "body": "Sorry if it came off as sarcastic- it was a genuine question. I didn’t think you had just tried one or two movies, but sometimes people do underestimate how much listening it takes. Plus my understanding is that it can take even more if the material isn’t already 80-90 percent comprehensible. I was just trying to help you get a more useful/accurate answer. Truly sorry if I offended you.", "created_utc": "1657714489.0", "edited": "False", "id": "ifzd774", "is_submitter": "False", "link_id": "t3_vxr9mo", "parent_id": "t1_ify0xvq", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "MusParvum", "body": ">there is no noticable improvement in my english listening skills\n\nAfter trying for how many hours?", "created_utc": "1657678305.0", "edited": "False", "id": "ifxufc0", "is_submitter": "False", "link_id": "t3_vxr9mo", "parent_id": "t3_vxr9mo", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "MusParvum", "body": "I'm sure you're right about that being the reason, buddy, but it's a pretty poor reason for downvoting. The OP had the awareness and the sense to realize that a word-for-word translation didn't seem to be the right path in this case, and was seeking out a better alternative. It's not like they were advocating that word-for-word translations were the way to go, or anything. Not sure why people would want to discourage someone from honestly seeking information on how to translate something correctly.\n\nAlso, thank you for letting me know that there are people on r/Spanish who are in fact from Spain.", "created_utc": "1657558821.0", "edited": "False", "id": "ifqs0lp", "is_submitter": "False", "link_id": "t3_vw4la9", "parent_id": "t1_ifowu82", "score": "1", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "MusParvum", "body": "Can you really not say it? What if you were telling someone to watch a movie? Wouldn't that be \"Vela\"?", "created_utc": "1657502991.0", "edited": "False", "id": "ifo2i1k", "is_submitter": "False", "link_id": "t3_vw66x9", "parent_id": "t3_vw66x9", "score": "2", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "MusParvum", "body": ">Not sure why I was downvoted for this post\n\nThey're probably jealous that you are in Spain and they are not. ;)", "created_utc": "1657498792.0", "edited": "False", "id": "ifntv1t", "is_submitter": "False", "link_id": "t3_vw4la9", "parent_id": "t1_ifnrwy8", "score": "3", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "MusParvum", "body": "In this case I think \"gracias\" is a phrase, not a noun. But either way, \"esto\" here is referring not to \"gracias\" (the thankfulness) but to the thing that was explained. Since the thing that was explained is not specified in the sentence, we don't know if it's masculine or feminine, so the neutral form is used.", "created_utc": "1657498600.0", "edited": "False", "id": "ifntgpx", "is_submitter": "False", "link_id": "t3_vw4qs3", "parent_id": "t3_vw4qs3", "score": "9", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "MusParvum", "body": "Listen to as much as possible every day, with a focus on listening to as much as possible from that specific comedian to become more comfortable and familiar with his way of speaking. Do some regular intensive listening where you pause and look up words/phrases/slang that you don't understand - he probably uses a similar range of vocabulary in many of his shows. Maybe even focus on listening primarily or only to people with his particular accent.\n\nThat being said, comedy is one of the hardest things to understand. Assume that after three months of practice you still may not understand much at the show, and plan on enjoying the evening just for the atmosphere and the listening practice. And if you do understand anything, that's just a bonus! :)", "created_utc": "1657396480.0", "edited": "False", "id": "ifif7dq", "is_submitter": "False", "link_id": "t3_vv62e7", "parent_id": "t3_vv62e7", "score": "8", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "MusParvum", "body": "Dreaming Spanish\n\nEspañol con Juan\n\nWhy not Spanish?\n\nErre que ELE\n\nNo Hay Tos\n\nEspañol con Guada\n\nTake it Spanish\n\nHow to Spanish\n\nSpanish with Vicente\n\nMaría Español\n\nSpanish After Hours\n\nHola Spanish", "created_utc": "1657395291.0", "edited": "False", "id": "ificlg7", "is_submitter": "False", "link_id": "t3_vv5r4l", "parent_id": "t3_vv5r4l", "score": "13", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "MusParvum", "body": "Take a look at the Superbeginner level videos on the Dreaming Spanish YouTube channel, and try to replicate that approach (but in English of course) - simple stories in very simple language, repetition, lots of drawing.\n\nI also agree with u/edelay's idea to incorporate topics that he's interested in. And also with what the others said about the possibility of other issues at play here beyond just language learning.", "created_utc": "1657380391.0", "edited": "False", "id": "ifheqi9", "is_submitter": "False", "link_id": "t3_vv20dz", "parent_id": "t3_vv20dz", "score": "5", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "MusParvum", "body": "This is how I've been thinking about it lately, too. We're definitely in a golden age, but in the not-too-distant future, that golden age will be irrelevant from a purely practical perspective. It'll still be golden in the sense that we'll have a ton of resources and opportunities. But it'll be irrelevant in a practical sense in that within 10-20 years we're going to have what essentially amounts to \"subtitles for reality\". Everyone can speak their own language, and everyone else will automatically have it translated and displayed in their augmented-reality glasses. Cool and exciting... but also kinda sad.", "created_utc": "1657378891.0", "edited": "False", "id": "ifhb97x", "is_submitter": "False", "link_id": "t3_vuzid6", "parent_id": "t1_ifh66l9", "score": "6", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "MusParvum", "body": "The first time I couldn't understand much of it. But when I rewound it to try again, it started just before the 1:54 mark where he says \"música\". That one additional word gave me the context I needed to understand almost all of it on the second play through. (Listening a second time in and of itself probably helped a little, but I've had other situations where just a little extra context seems to make everything more understandable.)", "created_utc": "1657132507.0", "edited": "False", "id": "if3uwc8", "is_submitter": "False", "link_id": "t3_vstdu6", "parent_id": "t3_vstdu6", "score": "5", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "MusParvum", "body": "For me, I get inspired to do something when I see someone else doing it well. So in this case, you might find inspiration by watching YouTube channels of other people sharing their own process and journey of learning Spanish. This way you get exposure to people who are excited about learning the language. If that sounds like something that might help reinvigorate your interest, here are a couple of possible channels to take a look at:\n\n[https://www.youtube.com/c/emigrace](https://www.youtube.com/c/emigrace)\n\n[https://www.youtube.com/c/ShaneGodliman](https://www.youtube.com/c/ShaneGodliman)\n\nGood luck!", "created_utc": "1656962299.0", "edited": "False", "id": "ieuq5df", "is_submitter": "False", "link_id": "t3_vr8go2", "parent_id": "t3_vr8go2", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "MusParvum", "body": "I think it improves with time. I used to have to translate everything in my head, but now there are chunks that I automatically understand without translating. I still do end up translating a lot, but I'm assuming that the trend will continue and over time I'll have to do it less and less.", "created_utc": "1656959144.0", "edited": "False", "id": "ieuisba", "is_submitter": "False", "link_id": "t3_vr3ifv", "parent_id": "t1_ieu626i", "score": "9", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "MusParvum", "body": "For listening comprehension, it's probably not as efficient (and definitely not as inexpensive) as watching a ton of YouTube in your target language (especially if you can find material that's more targeted towards learners and a bit slower/easier). But for speaking, it's great. You have the attention of someone who's job is to get you to talk and to correct your mistakes. It's super helpful. Just make sure to try several teachers until you find one who you click with.\n\nAs far as lessons/methods and quality, it totally varies from teacher to teacher, which is why it's important to try several and find one that works best for you.", "created_utc": "1656893957.0", "edited": "False", "id": "iereut2", "is_submitter": "False", "link_id": "t3_vqudu7", "parent_id": "t3_vqudu7", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "MusParvum", "body": "It's possible that some people may have age-related issues that make it harder. Everyone is different. But it's not a foregone conclusion. I'm 50. I started learning Spanish last year, and I've made \\*way\\* more progress much faster than when I tried to learn Spanish when I was in my 20s. So it's not a given that age will be an issue.\n\nYou've waved away every mention of the fact that you're learning 3 languages at the same time, but I would strongly suggest you give that a little extra thought. Sure, two of them may be similar to your native language, but it's still extra effort, time, and attention.\n\nWhy not try an experiment? Temporarily drop the other two languages and focus on Spanish. Give it at least an hour or two of study a day, every day (or nearly every day). Find a couple good resources that you like and consistently work your way through them. See where you are in a few months. My guess is you will make much more progress than you have while trying to divide your attention between 3 languages.", "created_utc": "1656878855.0", "edited": "False", "id": "ieqiuj8", "is_submitter": "False", "link_id": "t3_vqnrcm", "parent_id": "t3_vqnrcm", "score": "9", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "MusParvum", "body": "For writing, download HelloTalk or a similar app and exchange text messages with a ton of people (most conversations will end up being just a few awkward exchanges, but if you talk to enough people, you'll eventually get a few good conversations going).\n\nFor speaking, once or twice a day narrate what you're doing at that moment out loud in Spanish. If you're thinking about something or trying to work something out in your head, occasionally make yourself think about it or work it out in Spanish, out loud.\n\nGet the iTalki tutor. Start with half hour lessons, at least once a week, and try a bunch of different tutors until you find one you click with. It will be super hard at first, you will stumble, blank out, and feel like your brain is catching on fire. But if you push through and keep going, it'll get better.\n\nHave fun and good luck!", "created_utc": "1656685750.0", "edited": "False", "id": "iegf6k7", "is_submitter": "False", "link_id": "t3_voovew", "parent_id": "t3_voovew", "score": "3", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "MusParvum", "body": "Just to add to the confusion, at first I thought you were saying \"Vino is also he/she/it eats\".", "created_utc": "1656647310.0", "edited": "False", "id": "ieer4dd", "is_submitter": "False", "link_id": "t3_vonrub", "parent_id": "t1_ieeeu03", "score": "2", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "MusParvum", "body": "Excellent - thanks!", "created_utc": "1656603529.0", "edited": "False", "id": "iebwhf9", "is_submitter": "False", "link_id": "t3_vnww9e", "parent_id": "t1_ieb9jff", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "MusParvum", "body": "Since you mentioned that you tried to read at your level, I'd love to know which books you started with, aka, which were the \"easiest\". (Assuming you didn't list them in chronological order... but maybe you did?)", "created_utc": "1656559679.0", "edited": "False", "id": "ie9wdq6", "is_submitter": "False", "link_id": "t3_vnww9e", "parent_id": "t3_vnww9e", "score": "19", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "MusParvum", "body": "Two years is definitely enough time to learn a decent amount, as long as you are very consistent about it - studying/practicing every day (or very nearly every day) for those two years.\n\nI know it's hard, but try not to let the rude people get to you. They're jerks, and that reflects poorly on them, not you. You are learning, and you WILL make mistakes - lots of them. It's part of the process, so don't try to avoid it for fear of being laughed at. \n\nRegarding speech impediments, I assume there are French people with speech impediments, and I'm sure they get by. So yeah, it might make things a little harder for you, but I think you can work around it.", "created_utc": "1656517313.0", "edited": "False", "id": "ie74n73", "is_submitter": "False", "link_id": "t3_vniai8", "parent_id": "t3_vniai8", "score": "12", "subreddit": "French", "subreddit_id": "t5_2rd5t"}, {"author": "MusParvum", "body": "I'm pretty sure Kurzgesagt has a Spanish version of their channel. A few other science- and tech-related channels:\n\nQuantum Fracture (Physics and space)\n\nDotCSV (AI and computers)\n\nLaHiperactina (medical and biological sciences)\n\nSize Matters (nano science and nanotechnology)", "created_utc": "1656512721.0", "edited": "False", "id": "ie6td0d", "is_submitter": "False", "link_id": "t3_vn7b5x", "parent_id": "t3_vn7b5x", "score": "1", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "MusParvum", "body": "I have a premium Busuu subscription and have gone through their entire Spanish course. I found it very helpful - it taught a good bit of useful vocabulary and grammar, and most importantly, I felt like I clicked with their overall style of lessons. I think that's important, because if you are enjoying the style of teaching, you'll be more likely to do it regularly and to completion, both of which are very important for progress IMO.\n\nI would definitely pair it with other methods - comprehensible input via YouTube or whatever, outside reading whether through books or articles/social media on the web, etc. And as someone else mentioned, don't put too much stock in their certification - the certification tests are interesting as general estimated checkpoints, but I don't know how accurate or thorough they are.", "created_utc": "1656427611.0", "edited": "False", "id": "ie26yrn", "is_submitter": "False", "link_id": "t3_vmnj9f", "parent_id": "t3_vmnj9f", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "MusParvum", "body": "Awesome, I'm glad to hear it! :)", "created_utc": "1656110531.0", "edited": "False", "id": "idmbhtx", "is_submitter": "False", "link_id": "t3_vh0feq", "parent_id": "t1_idmalbv", "score": "1", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "MusParvum", "body": "Don't try to learn it all at once. Focus on one tense/column in one mood. Study it (just look it over for a few minutes, or write it out, or say it out loud - whatever). Then go on [conjuguemos.com](https://conjuguemos.com) and quiz yourself on just that one tense. When you are consistently scoring well (90% or higher?) study the next column, and add that tense when you quiz yourself.\n\nWrite/speak as much as you can to practice actually using them as you learn them.\n\nMake sure you're also reading/listening to as much Spanish as you can, at a level that's mostly understandable by you.", "created_utc": "1655824897.0", "edited": "False", "id": "id6w7r6", "is_submitter": "False", "link_id": "t3_vh0feq", "parent_id": "t3_vh0feq", "score": "1", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "MusParvum", "body": "I'm only at the intermediate level, so this happens to me a lot. Lately, rather than continue to try to think of the exact word or expression I want to say, I've been trying to remember to try to rephrase thought in a different way, just to keep the conversation flowing. Sometimes it's not always possible for me to think of a synonym or another way to phrase something, and sometimes the alternative I think of isn't exactly right, but I think it's still useful practice for thinking on my feet and working towards more fluent speaking.", "created_utc": "1655758952.0", "edited": "False", "id": "id3rphf", "is_submitter": "False", "link_id": "t3_vge4vw", "parent_id": "t3_vge4vw", "score": "1", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "MusParvum", "body": "Get a tutor on iTalki or somewhere similar for 1 on 1 conversation practice. It's less pressure, because it's literally their job to listen to you mess up and wait patiently while you figure out what to say. :) Some consistent practice in a more low-pressure environment like that should hopefully help.", "created_utc": "1655156427.0", "edited": "False", "id": "ic95g5b", "is_submitter": "False", "link_id": "t3_vbd5mq", "parent_id": "t3_vbd5mq", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "MusParvum", "body": "Reading a little to each other seems like a good idea... it at least removes the stress of having to think of what to say. Maybe you could also agree to ease into speaking a little at a time... for instance a few times a day he could ask you very simple \"yes\" or \"no\" questions that you can answer \"oui\" or \"non\". Then the next week, maybe questions that have dead simple one word answers... \"what color is that car?\" \"which way do we turn here?\". Work your way up from there.", "created_utc": "1655070577.0", "edited": "False", "id": "ic4uj6i", "is_submitter": "False", "link_id": "t3_vavmnm", "parent_id": "t1_ic4tm9h", "score": "10", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "MusParvum", "body": "\"Knowing what this was all about I tried to get the most out of it...\"\n\nWhat was it all about? I don't think I'm familiar with this...", "created_utc": "1654636912.0", "edited": "False", "id": "ibj9gw8", "is_submitter": "False", "link_id": "t3_v753h5", "parent_id": "t3_v753h5", "score": "20", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "MusParvum", "body": "How to Spanish Podcast (Mexican): https://www.youtube.com/c/HowtoSpanishLessons\n\nPlaneta Juan (Colombian): https://www.youtube.com/c/PlanetaJuan\n\nEl Jardín de Martin (Peruvian): https://www.youtube.com/c/ElJard%C3%ADndeMart%C3%ADn\n\nNo Hay Tos (Mexican): https://www.youtube.com/channel/UCY08wLn8NUT8KEdFAV83JWw\n\nLuisito Comunica (Mexican): https://www.youtube.com/c/luisitocomunica\n\nEs Con Acento (Mexican): https://www.youtube.com/c/esconacento\n\nAlex Tienda (Mexican): [https://www.youtube.com/c/AlexTienda](https://www.youtube.com/c/AlexTienda)\n\nPatoneando (Colombian): https://www.youtube.com/c/Patoneando", "created_utc": "1653499597.0", "edited": "False", "id": "i9yke5m", "is_submitter": "False", "link_id": "t3_uxg83k", "parent_id": "t3_uxg83k", "score": "5", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "MusParvum", "body": "On How to Spanish, they generally talk slowly and enunciate clearly. On Estirando el Chicle, they're talking at a faster more conversational speed, in a more casual manner, and frequently talking over each other. Those factors are at least part of the issue.", "created_utc": "1653495010.0", "edited": "False", "id": "i9y8km7", "is_submitter": "False", "link_id": "t3_uxju42", "parent_id": "t3_uxju42", "score": "3", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "MusParvum", "body": "Planeta Juan, from Colombia: https://www.youtube.com/c/PlanetaJuan", "created_utc": "1653317349.0", "edited": "False", "id": "i9otdas", "is_submitter": "False", "link_id": "t3_uw0qug", "parent_id": "t3_uw0qug", "score": "2", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "MusParvum", "body": "Awesome, I'm glad it was helpful! As you mentioned in your original post, just be sure to incorporate other methods, especially ones that will improve your listening ability (the Dreaming Spanish YouTube channel is a good place to start) and your written and spoken output (I found HelloTalk and iTalki helpful with those areas). Good luck and have fun!", "created_utc": "1653228536.0", "edited": "False", "id": "i9kc9rc", "is_submitter": "False", "link_id": "t3_uujz3c", "parent_id": "t1_i9jaz4t", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "MusParvum", "body": "I think it's roughly accurate for how long it'll take to finish the course (edited to add: IF you stick to whatever estimation you made in the beginning about how much and how often you would use it), but you won't actually be fluent by the end of it.\n\nFor example, I used it for Spanish, and I think the estimation more or less tracked with how long it took me to finish to their \"B2\" level. But at the end I was definitely not B2... I would say I was somewhere around B1 more or less, based on the guidelines I've read for the various levels.\n\nBUT... I totally think it was worthwhile as a part of learning Spanish. I feel like it gave me a pretty good base of knowledge and familiarity with grammar. Just combine it with other methods and keep some realistic expectations.", "created_utc": "1653174150.0", "edited": "False", "id": "i9i3ik3", "is_submitter": "False", "link_id": "t3_uujz3c", "parent_id": "t3_uujz3c", "score": "5", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "MusParvum", "body": "It depends. In many cases yes... like in the examples you gave it would probably be obvious from context. In some cases, maybe not, like if you said \"cadena\" instead of \"cadera\" (like I did one time). But don't let it worry you too much... you won't learn and improve if you aren't willing to make (lots of) mistakes.", "created_utc": "1653073281.0", "edited": "False", "id": "i9d3qe8", "is_submitter": "False", "link_id": "t3_uu4u3k", "parent_id": "t3_uu4u3k", "score": "35", "subreddit": "learnspanish", "subreddit_id": "t5_2rd6d"}, {"author": "MusParvum", "body": "There is a ton of native Spanish content on YouTube that starts being (more or less) accessible around B1. Do a search on YouTube for topics you are interested in, but search using Spanish terms instead of terms in your native language (for example search for \"cocinar\" instead of \"cooking\"). Some of the results will be too difficult (too fast, or more difficult accents), but you should find at least a few that you can understand a good chunk of.", "created_utc": "1653072962.0", "edited": "False", "id": "i9d328r", "is_submitter": "False", "link_id": "t3_uu4bt0", "parent_id": "t3_uu4bt0", "score": "2", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "MusParvum", "body": ">Sé que ''ME parece que'' requiere el subjuntivo\n\nYo creía que \"me parece que\" lleva el indicativo... no?", "created_utc": "1652556688.0", "edited": "False", "id": "i8lziuk", "is_submitter": "False", "link_id": "t3_upi0bp", "parent_id": "t3_upi0bp", "score": "8", "subreddit": "learnspanish", "subreddit_id": "t5_2rd6d"}, {"author": "MusParvum", "body": "I think this is a big part of the answer. I didn't change any of my settings, but I've watched a TON of videos in my TL and now I get a decent number of TL ads during videos in that language.", "created_utc": "1652499671.0", "edited": "False", "id": "i8jd6a4", "is_submitter": "False", "link_id": "t3_up6zm5", "parent_id": "t1_i8j6q67", "score": "6", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "MusParvum", "body": "Dale a la Lengua: https://speakinspanish.co.uk/podcast-dale-a-la-lengua/", "created_utc": "1652108013.0", "edited": "False", "id": "i7xchhl", "is_submitter": "False", "link_id": "t3_ullk21", "parent_id": "t3_ullk21", "score": "1", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "MusParvum", "body": ">I found results by getting as close as possible on defense (you can get no closer than one disc length)\n\nSome taller players will simply step past you in this situation and be able to throw uncontested... so if you see that happening often, re-evaluate. I definitely agree with the idea of not stressing about blocks. Just try to hold the force as best you can - even if they get off a throw to the side you're forcing, you did your job.", "created_utc": "1651948787.0", "edited": "False", "id": "i7pgd0b", "is_submitter": "False", "link_id": "t3_ukh2po", "parent_id": "t1_i7p944y", "score": "6", "subreddit": "ultimate", "subreddit_id": "t5_2qnym"}, {"author": "MusParvum", "body": "Take a look at Dreaming Spanish on YouTube: [https://www.youtube.com/c/DreamingSpanish](https://www.youtube.com/c/DreamingSpanish)\n\n...start with their SuperBeginner playlist. Keep the subtitles turned off, and just focus on understanding the gist of what's being said at first. The SuperBeginner playlist uses much simpler language and relies heavily on drawings to get the point across, so you and your son will start picking things up pretty quickly.\n\nLanguage Transfer also has an interesting and accessible method of teaching beginners: [https://www.languagetransfer.org](https://www.languagetransfer.org)", "created_utc": "1651673382.0", "edited": "False", "id": "i7alcyu", "is_submitter": "False", "link_id": "t3_ui6fo6", "parent_id": "t3_ui6fo6", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "MusParvum", "body": "Es Con Acento: [https://www.youtube.com/c/esconacento](https://www.youtube.com/c/esconacento)\n\nLa Capital: [https://www.youtube.com/c/lacapitalcocina](https://www.youtube.com/c/lacapitalcocina)", "created_utc": "1651454328.0", "edited": "False", "id": "i6z49c4", "is_submitter": "False", "link_id": "t3_ugbus2", "parent_id": "t3_ugbus2", "score": "3", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "MusParvum", "body": ">Now, if you did that with Italian Subs\n\nMmmmmm... Italian subs.....", "created_utc": "1651377826.0", "edited": "False", "id": "i6valvr", "is_submitter": "False", "link_id": "t3_ufcxc6", "parent_id": "t1_i6tf25r", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "MusParvum", "body": "Try the YouTube channel called Dreaming Spanish. They have a ton of videos at all different levels about lots of different topics. Also, search YouTube for topics you're interested in, but type your search in Spanish so you get Spanish-language videos in the results.\n\nYouTube videos tend to be a little easier to understand than native-level TV and movies, IMO.\n\n(Also, I think you mean it makes you sound \"picky\", not \"pick me\"? Which is fine... you won't learn as much if you don't enjoy what you're watching! :) )", "created_utc": "1651003644.0", "edited": "False", "id": "i6b6uyi", "is_submitter": "False", "link_id": "t3_uc31v2", "parent_id": "t3_uc31v2", "score": "6", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "MusParvum", "body": "You'll get less trashy with more practice. As for the introverted part: Try a bunch of different tutors until you find one that's really good at keeping the conversation moving. That will remove a lot of the pressure and worry about awkward silences or having to come up with things to say.", "created_utc": "1650986515.0", "edited": "False", "id": "i69yep6", "is_submitter": "False", "link_id": "t3_uc7gcc", "parent_id": "t1_i69orxm", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "MusParvum", "body": "I've heard some people estimate that going up one more level takes roughly an amount of time equal to the total time you put in to get to your current level. So to go from B1 to B2 would take about the same amount of time it took you to get from 0 to B1.\n\nSeems plausible, but I don't know if it's actually true or not.", "created_utc": "1650912727.0", "edited": "False", "id": "i65yt0j", "is_submitter": "False", "link_id": "t3_ubq76h", "parent_id": "t3_ubq76h", "score": "3", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "MusParvum", "body": "I use [conjuguemos.com](https://conjuguemos.com) and do their 5 minute conjugation practice (almost) every morning. You can customize which tenses and moods it asks, so I started with the ones I knew pretty well, and gradually added new ones, usually studying the new one on a conjugation chart for a few minutes beforehand for the first few times.", "created_utc": "1650750696.0", "edited": "False", "id": "i5xdq26", "is_submitter": "False", "link_id": "t3_uaeuoe", "parent_id": "t3_uaeuoe", "score": "6", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "MusParvum", "body": "Spanish: Gimme the grammar... I'll happily work on my pronunciation.\n\nFrench: Pronunciation. PLEASE.", "created_utc": "1649528307.0", "edited": "False", "id": "i42bizt", "is_submitter": "False", "link_id": "t3_tzvr1k", "parent_id": "t3_tzvr1k", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "MusParvum", "body": "El Alquimista. It was originally written in Portuguese but there's a Spanish translation. It's short, the grammar and sentence structures are pretty straightforward, and most of the new/unusual words get repeated a lot.", "created_utc": "1648824024.0", "edited": "False", "id": "i2zlihj", "is_submitter": "False", "link_id": "t3_ttrhe9", "parent_id": "t3_ttrhe9", "score": "12", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "MusParvum", "body": "Hobbies don't have to be useful or earn you any money. If you enjoy it, it's worth it!", "created_utc": "1648773877.0", "edited": "False", "id": "i2x8hmn", "is_submitter": "False", "link_id": "t3_ttdrv1", "parent_id": "t3_ttdrv1", "score": "320", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "MusParvum", "body": "Canalsur en YouTube puede ser un buen sitio para buscar: https://www.youtube.com/user/canalsur/featured", "created_utc": "1648764901.0", "edited": "False", "id": "i2wo303", "is_submitter": "False", "link_id": "t3_tt98iq", "parent_id": "t3_tt98iq", "score": "3", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "MusParvum", "body": "I would suggest trying several different tutors. It's all about finding one that you click with, and all of them are very different. It's normal to be nervous at first, so you just need to be patient and find someone who's better at helping you through that part of it. Good luck!", "created_utc": "1648249071.0", "edited": "False", "id": "i24kymq", "is_submitter": "False", "link_id": "t3_to4cdu", "parent_id": "t3_to4cdu", "score": "2", "subreddit": "learnspanish", "subreddit_id": "t5_2rd6d"}, {"author": "MusParvum", "body": "Generally speaking I've found YouTubers to be way easier to understand than actual movies and TV series.\n\nIf you want something targeted at learners, the YouTube channel \"Dreaming Spanish\" is great - they have playlists according to difficulty. There are other similar channels for Spanish learners such as Español con Juan, Spanish After Hours, Spanish with Alma, etc.\n\nIf you want something that's targeted at native speakers instead of learners, search YouTube for the Spanish-language \"version\" of whatever type of videos you would normally watch on YouTube in your native language... there's a ton of Spanish language channels out there... science, travel, hiking, sailing, cooking, fashion, books, etc etc.", "created_utc": "1648214475.0", "edited": "False", "id": "i228es7", "is_submitter": "False", "link_id": "t3_tni96o", "parent_id": "t3_tni96o", "score": "49", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "MusParvum", "body": "It's usually best not to compare languages directly, but this is one case where it's helpful to compare it to English. In English, you only conjugate the first verb in the clause: \"I want to be...\" the \"I want\" is conjugated, the \"to be\" is in the infinitive.\n\nSame with Spanish. If you conjugated the second verb also (estoy instead of estar) that would be like saying \"I want I am...\" in English.", "created_utc": "1648154784.0", "edited": "False", "id": "i1z9ddi", "is_submitter": "False", "link_id": "t3_tmsucc", "parent_id": "t3_tmsucc", "score": "37", "subreddit": "learnspanish", "subreddit_id": "t5_2rd6d"}, {"author": "MusParvum", "body": "Interesting... it didn't seem focused on Lat Am Spanish at all to me, but maybe it was more balanced between the two than I remember.", "created_utc": "1647364121.0", "edited": "False", "id": "i0rseae", "is_submitter": "False", "link_id": "t3_teghm9", "parent_id": "t1_i0rquee", "score": "2", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "MusParvum", "body": "I believe Busuu focuses mainly on European Spanish. They include some Latin American terms here and there, but will highlight them as such.", "created_utc": "1647356072.0", "edited": "False", "id": "i0r7uve", "is_submitter": "False", "link_id": "t3_teghm9", "parent_id": "t3_teghm9", "score": "1", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "MusParvum", "body": "Sure, I'm familiar with the idea of things not translating literally word for word. And I have no problem with the idea that \"mejor de lo que\" means \"better than\" as a unit. (Edited to add: I saw your n-grams thread back when it was first posted and thought it was excellent.)\n\nI think I'm just misunderstanding RK1700's comment at the top of this group of comments where they said the OP's second sentence \"is grammatically incorrect. \"que\" and \"lo que\" mean completely different things in this situation.\"\n\n...I took that to mean that \"mejor que\" (like in the second sentence) was grammatically incorrect, but I think I just misunderstood and now we're all talking past each other.", "created_utc": "1647268127.0", "edited": "1647269164.0", "id": "i0mcdhu", "is_submitter": "False", "link_id": "t3_tdo6l2", "parent_id": "t1_i0ma7gm", "score": "2", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "MusParvum", "body": "I could have sworn that I've seen \"mejor que\" used to mean \"better than\" in situations like this. Maybe I'm misremembering, or maybe I misunderstood...?", "created_utc": "1647265022.0", "edited": "False", "id": "i0m5p20", "is_submitter": "False", "link_id": "t3_tdo6l2", "parent_id": "t1_i0lpvxr", "score": "1", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "MusParvum", "body": ">But I always get this anyway, mostly if we go off topic, which isn't really off topic to me because I would like to get to know them.\n\nThis part makes me wonder if you might be getting a little too personal for their liking. Different tutors will have different boundaries and some may not want to get too far into their personal lives. So the issue might not be \"getting off topic\" but instead \"getting too personal\". You might need to steer the conversation in a slightly different direction, or keep looking for a tutor who doesn't mind going more in depth about their life.", "created_utc": "1647015484.0", "edited": "False", "id": "i097t2g", "is_submitter": "False", "link_id": "t3_tbo7iv", "parent_id": "t1_i08l236", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "MusParvum", "body": "I'm introverted and a big part of my conversation style is to ask questions to keep the conversation going. But you have to actually pay attention to the answers you get so you can ask decent follow up questions and keep things going.\n\nAnother idea is to make a list of possible things to talk about before the conversation starts. For instance, I might write a list of two or three things I've done, seen, or read recently to use as conversation prompts when things lag.\n\nWith an ongoing language partner, one possibility is to pick a specific topic to discuss ahead of time, such as an article or a short YouTube video.\n\nAnd of course you can always hire a tutor on iTalki or a similar platform... they're getting paid to keep the conversation flowing, so that should take a lot of the pressure off of you.\n\nFinally, keep in mind that you won't click with everyone, and that's ok. Just move on, and you'll eventually find people who you can have good conversations with. But it takes some time and persistence.", "created_utc": "1646968412.0", "edited": "False", "id": "i071cgu", "is_submitter": "False", "link_id": "t3_tbfl79", "parent_id": "t3_tbfl79", "score": "8", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "MusParvum", "body": "I'm in the same basic situation with Spanish (closing in on 1.5 years), except I've been doing speaking sessions for about 10 months. I still have tons of mistakes, many repeat mistakes, the fluidity comes and goes from minute to minute and session to session. I think it's pretty normal. As long as you're improving little by little over the long term, it's ok.\n\nOne thing you might want to consider is to try an hour-long session instead of half-hours. That might give you more opportunity to stay in the French-speaking frame of mind for longer and to have some extra time to work on some of those mistakes while they're fresh in your mind. With my (hour-long) sessions, I feel like things are just getting good at the half hour mark.", "created_utc": "1646754700.0", "edited": "False", "id": "hzul55c", "is_submitter": "False", "link_id": "t3_t9fs8k", "parent_id": "t3_t9fs8k", "score": "1", "subreddit": "French", "subreddit_id": "t5_2rd5t"}, {"author": "MusParvum", "body": "This sounds really interesting! I have a few questions, if you don't mind:\n\n\\- Were you expected to answer in a complete sentence, or with just a couple of words (if a brief answer was possible)?\n\n\\- If you had a mistake, would your teacher simply give you a correction and you move on, or would he re-ask the question and let you give the correct answer before moving on?\n\n\\- What happens if you don't understand a question for whatever reason? Would you ask the teacher to repeat, or clarify, or move on to the next one, or something else?\n\n\\- Were the questions completely different each and every time you did this? Or did you repeat questions from class to class to reinforce them?", "created_utc": "1646514186.0", "edited": "False", "id": "hzhv62h", "is_submitter": "False", "link_id": "t3_t70vw9", "parent_id": "t1_hzeyjul", "score": "3", "subreddit": "learnspanish", "subreddit_id": "t5_2rd6d"}, {"author": "MusParvum", "body": "El Alquimista is perfect for B1, IMO. Very straightforward story, relatively simple vocabulary and grammar, new or unusual words get repeated a lot.", "created_utc": "1646421366.0", "edited": "False", "id": "hzcptdc", "is_submitter": "False", "link_id": "t3_t6olv6", "parent_id": "t3_t6olv6", "score": "5", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "MusParvum", "body": "In addition to what others have said, think of it in terms of \"phrases\" not \"sentences\". The second example contains two separate \"phrases\" with different subjects that each get their own conjugated verbs.", "created_utc": "1645575923.0", "edited": "False", "id": "hy1c8bq", "is_submitter": "False", "link_id": "t3_sz1zj9", "parent_id": "t3_sz1zj9", "score": "11", "subreddit": "learnspanish", "subreddit_id": "t5_2rd6d"}, {"author": "MusParvum", "body": "I agree with this... El Alquimista is perfect for a first intermediate book.", "created_utc": "1645545588.0", "edited": "False", "id": "hxz6bs7", "is_submitter": "False", "link_id": "t3_syhn23", "parent_id": "t1_hxxybz9", "score": "2", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "MusParvum", "body": "I'm glad to hear I'm not the only one. I'm also learning Spanish, and I've found that it's really easy to get bogged down and lose my way when telling a story or relating something that happened to me. Your potential reasons make a lot of sense, I would only add that - for me at least - I think part of the trouble is the extra mental load involved in structuring the story, that is, figuring out what the important bits are, what context is needed, trying to make it at least a little interesting/entertaining, etc. It seems much less straightforward than offering an opinion or talking about a more abstract idea.", "created_utc": "1645328910.0", "edited": "False", "id": "hxnvhrt", "is_submitter": "False", "link_id": "t3_swrgdx", "parent_id": "t3_swrgdx", "score": "13", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "MusParvum", "body": "Get a conversational tutor on iTalki. The idea that you're literally paying this person to listen to you mangle the language relieves a lot of the stress, at least for me. Plus, they're usually better at keeping the conversation going and helping you past trouble spots than regular people (though you might need to try a few different tutors to find one that you click with).\n\nAside from that... embrace the awkwardness as best you can. Realize that you will not improve until you mess up a lot. But the more you do it, the better you'll become.", "created_utc": "1645218397.0", "edited": "False", "id": "hxhv952", "is_submitter": "False", "link_id": "t3_svr52p", "parent_id": "t3_svr52p", "score": "10", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "MusParvum", "body": ">Languages are not designed by committees\n\nThe RAE would like a word with you.\n\n;)", "created_utc": "1645130322.0", "edited": "False", "id": "hxctpy3", "is_submitter": "False", "link_id": "t3_suid7q", "parent_id": "t1_hxcob5e", "score": "3", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "MusParvum", "body": "Si puedes usar canales de YouTube:\n\n[https://www.youtube.com/c/Lahiperactina](https://www.youtube.com/c/Lahiperactina)\n\n[https://www.youtube.com/c/LagatadeSchrödinger](https://www.youtube.com/c/LagatadeSchrödinger)\n\n[https://www.youtube.com/c/SizeMatters](https://www.youtube.com/c/SizeMatters)\n\n[https://www.youtube.com/user/QuantumFracture](https://www.youtube.com/user/QuantumFracture)", "created_utc": "1645128361.0", "edited": "False", "id": "hxcon09", "is_submitter": "False", "link_id": "t3_suvta0", "parent_id": "t3_suvta0", "score": "5", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "MusParvum", "body": "Give [https://conjuguemos.com](https://conjuguemos.com) a try... I've found their conjugation drill pretty helpful.", "created_utc": "1645051876.0", "edited": "False", "id": "hx8h27z", "is_submitter": "False", "link_id": "t3_su8hgk", "parent_id": "t3_su8hgk", "score": "5", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "MusParvum", "body": "After finishing the Busuu Spanish course I've been watching a ton of Spanish language YouTube (both learner-targeted and native-targeted channels), speaking practice a couple times a week (once with an iTalki tutor, and 1 or 2 times with online friends), texting with Spanish speaking friends a couple times a week, and doing the tense/conjugation practice on Conjuguemos several times per week. I also follow several Spanish speakers on Twitter and read the occasional book or article in Spanish. In my mind, at this point it's less studying, and more seeking out opportunities to use it.", "created_utc": "1645025762.0", "edited": "False", "id": "hx6mbgd", "is_submitter": "False", "link_id": "t3_stxic9", "parent_id": "t3_stxic9", "score": "4", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "MusParvum", "body": "30 minutes a day is better, IMO, because it's consistently every day. If you do \"a few times a week\" and then miss a day, that's a big gap, which makes it easier to miss yet another day, and before you know it it's been a week since you last did anything.\n\nAs for 30 minutes being too short, think of it as a minimum. Some days you will feel like doing more, or adding in a second session later in the day.", "created_utc": "1644979683.0", "edited": "False", "id": "hx4gbd2", "is_submitter": "False", "link_id": "t3_stksoa", "parent_id": "t3_stksoa", "score": "55", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "MusParvum", "body": "There's this scene from The 13th Warrior:\n\n[https://www.youtube.com/watch?v=lnnREr8BV24](https://www.youtube.com/watch?v=lnnREr8BV24)\n\n...not much to it, but the way they executed it is pretty interesting.", "created_utc": "1644967339.0", "edited": "False", "id": "hx3okd4", "is_submitter": "False", "link_id": "t3_stg4ir", "parent_id": "t3_stg4ir", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "MusParvum", "body": "Yes, I'm the Duolingo zealot who recommended three non-Duolingo options before conceding that Duolingo may be the way to go if the OP \\*must\\* use a free option, then subsequently recommended two additional non-Duolingo alternatives. Such a zealot.\n\nMaybe try helping out by recommending some free Duolingo alternatives of your own?", "created_utc": "1644896258.0", "edited": "False", "id": "hwzqdx8", "is_submitter": "False", "link_id": "t3_ssqmza", "parent_id": "t1_hwzps9u", "score": "11", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "MusParvum", "body": "Two things: \n\n1. You've probably heard plenty of non-native English speakers speaking English with very non-native accents and been thoroughly impressed simply because they were able to speak more than one language. Why force a higher standard on yourself? The point of learning a language is to communicate, and you can do that even with a non-native accent.\n\n2. Accent etc is like anything else - it just takes practice, consistency, and dedication. If it's important to you, it will come with time. But it won't ever come if you don't learn the language. Get going, refine it as you go.\n\n(And no, you're not too old. I didn't start seriously learning Spanish until a year and a half ago, and I'm well over 40. Steve Kaufmann is like in his 70s and still learning new languages.)", "created_utc": "1644892606.0", "edited": "False", "id": "hwzisnw", "is_submitter": "False", "link_id": "t3_ssqmza", "parent_id": "t1_hwzhvlt", "score": "15", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "MusParvum", "body": "Yeah, I hear you. Normally I would say use whatever course you enjoy the most, but not being able to pay anything does limit your options a bit. A couple of other possibilities:\n\n\\- Busuu does have a free tier, it just doesn't let you do all of the lessons. You could try that.\n\n\\- Your local public library might have some courses to choose from, either as books, or maybe on CDs/DVDs or something. Take a look there and talk to a librarian to see what they have.\n\nI can't say for sure, but I feel that watching the Dreaming Spanish channel (and other beginner-level Spanish YouTube vids) alongside Duolingo or some other course might help you to remember what you're learning in the course, because then you're putting it to use and it's not just confined to that one app/area.\n\nAt any rate, you're not broken or outdated. You might need a little more time to succeed than you would like, but that's ok - everyone goes at their own pace. Just be as consistent as possible, and incorporate it into as many different areas of your life as possible. Good luck.", "created_utc": "1644891879.0", "edited": "False", "id": "hwzh996", "is_submitter": "False", "link_id": "t3_ssqmza", "parent_id": "t1_hwzfzm0", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "MusParvum", "body": "I would recommend three things (these will be from the standpoint of Spanish, which IMO is easier than French for a native English speaker):\n\n1. Pick some course and do a little bit of it every day, no matter what, until the course is complete. If you had a little money to spend, I would recommend Busuu (it worked well for me) or Pimsleur or Assimil (I've heard they've worked well for other people). BUT if you don't have any money for this, then go with Duolingo and do the entire tree until it's done, no matter what.\n\n2. Look up the Dreaming Spanish channel on YouTube. Start watching their Superbeginner playlist. Watch a few videos every day, no mater what. When you can understand almost all of what they're saying, move on to the Beginner playlist. (Once you start doing this, other Spanish language vids from other channels will probably start showing up in your feed - watch whatever sounds interesting or useful.)\n\n3. After you've been watching the Dreaming Spanish Beginner playlist for awhile, download HelloTalk or Tandem and start exchanging text messages with native Spanish speakers. Lots of them. Make lots of mistakes and let them correct you.\n\nThe important thing is to do this stuff every day, no matter what. Obviously, the more time you can put towards it per day, the more you will progress. But the important thing is to do at least a little each day.", "created_utc": "1644890809.0", "edited": "False", "id": "hwzf0h9", "is_submitter": "False", "link_id": "t3_ssqmza", "parent_id": "t3_ssqmza", "score": "6", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "MusParvum", "body": "Don't feel bad about your girlfriend having a stronger ability than you. Some people just communicate better naturally. It's the same situation with my wife and I, not just with foreign languages, but also in English (our native language) - she's just naturally much better at understanding what people are saying, for whatever reason. All this means is that you'll need more study and practice than her, but if you give it time and don't let yourself be upset about it, it will come.\n\n6 months is really not that long. You'll get there. Just be sure to listen and speak as much as possible, even if it's awkward and frustrating. Consider getting a conversational tutor (on iTalki, for example) ... it can relieve some of the pressure to know that it's the tutor's job to put up with your language difficulties. :)", "created_utc": "1644880843.0", "edited": "False", "id": "hwyud16", "is_submitter": "False", "link_id": "t3_ssnfcu", "parent_id": "t3_ssnfcu", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "MusParvum", "body": "Spanish After Hours often adds subtitles to her videos. \n\nHowever, almost all videos will have auto-generated subtitles, which are usually close enough (use the \"cc\" button and the gear button in the lower right of the vid to toggle them on and off and configure the language).\n\nAnd Spanish subtitles are better. If you're a native English speaker using English subtitles, your brain will try to just read the subtitles and ignore the spoken dialog.", "created_utc": "1644604812.0", "edited": "False", "id": "hwje4sf", "is_submitter": "False", "link_id": "t3_sq5avb", "parent_id": "t3_sq5avb", "score": "3", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "MusParvum", "body": "Las Chicas del Cable\n\nLa Casa de Papel\n\nClub de Cuervos", "created_utc": "1644456472.0", "edited": "False", "id": "hwb26r5", "is_submitter": "False", "link_id": "t3_sot94l", "parent_id": "t3_sot94l", "score": "41", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "MusParvum", "body": "I've tried 7 tutors, and ended up sticking with the second one I had tried. After our first lesson together I was pretty sure I was going to stick with her, but wanted to try at least a few more to be sure. Now she's the only one I use.", "created_utc": "1644379393.0", "edited": "False", "id": "hw6j57l", "is_submitter": "False", "link_id": "t3_smdpkc", "parent_id": "t1_hw6gyt5", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "MusParvum", "body": "A couple from Spain:\n\nContratiempo was a really good suspenseful mystery/thriller (though Mario Casas can be really hard to understand sometimes). \n\nDurante la Tormenta was a pretty good sci-fi-ish thriller (and has Álvaro Morte, if you happen to be a fan of La Casa de Papel, though he plays a smaller role and a very different character here).", "created_utc": "1644285768.0", "edited": "False", "id": "hw0zjo3", "is_submitter": "False", "link_id": "t3_sn62ov", "parent_id": "t3_sn62ov", "score": "3", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "MusParvum", "body": "It depends on the teacher, but often they will ask a bit about you, possibly including why you're learning the language. In my experience (with Spanish tutors on iTalki) they guide the conversation and keep it moving, asking questions or providing prompts - they don't simply tell you to come up with something to say out of nowhere. :) Sometimes they might teach a little grammar. Sometimes my tutor will let me know ahead of time what we'll be talking about, whether it's a topic, or a video of some sort that I can watch ahead of time. I've found it super helpful, and would definitely recommend it. Try several tutors to find one that you click with, who is interesting to talk to and keeps the conversation moving well.", "created_utc": "1644198151.0", "edited": "False", "id": "hvw06jn", "is_submitter": "False", "link_id": "t3_smdpkc", "parent_id": "t3_smdpkc", "score": "5", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "MusParvum", "body": ">You can't say \"Necesita beber agua\"\n\nYou can, if it's clear from the context of the conversation who it's referring to. But yes - if it isn't clear for whatever reason, using the pronoun would help avoid confusion.", "created_utc": "1644197756.0", "edited": "False", "id": "hvvzch6", "is_submitter": "False", "link_id": "t3_smbk1i", "parent_id": "t1_hvvy9j9", "score": "12", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "MusParvum", "body": ">I don't know to possibly practice this, turn on a podcast and then blast music in the background??\n\nActually... Why not? Start with some low volume background music (or possibly a completely different podcast, to simulate other background conversations?) and increase the volume over time as you adapt to it. Seems like it might be a valid way to improve this specific listening skill.", "created_utc": "1644163747.0", "edited": "False", "id": "hvtp8pv", "is_submitter": "False", "link_id": "t3_slpfu6", "parent_id": "t1_hvtlz55", "score": "3", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "MusParvum", "body": "If you have a little money you can put towards it, this is the way to go, in my opinion. The idea that I am literally paying this person to listen to me mangle the language helps immensely. It will still be difficult at first, but at least it removes a lot of the stress about whether or not you're annoying the other person - you are paying them to endure the annoyance. It's their job! :)\n\nIf you go this route, I think it's important to try a few different tutors and find one that you connect with, who keeps the conversation moving in interesting directions, and finds plenty of ways to get you talking.", "created_utc": "1644162989.0", "edited": "False", "id": "hvtndwe", "is_submitter": "False", "link_id": "t3_sluynh", "parent_id": "t1_hvszpst", "score": "9", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "MusParvum", "body": ">c'est la vie\n\nI think I see the problem.... ;)", "created_utc": "1643998354.0", "edited": "False", "id": "hvlbal5", "is_submitter": "False", "link_id": "t3_skfv0g", "parent_id": "t1_hvknrke", "score": "85", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "MusParvum", "body": "4. Posts complaining about other posts\n\n;)", "created_utc": "1643998125.0", "edited": "False", "id": "hvlao93", "is_submitter": "False", "link_id": "t3_skdzfo", "parent_id": "t3_skdzfo", "score": "52", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "MusParvum", "body": "You need something that's just a little bit above your level... something that's challenging but you can still understand a good bit of it. Try to find YouTube channels that are targeted at learners, using simple, slower French. A search for \"French comprehensible input\" should give you a few possibilities.\n\nThis is one example: [https://www.youtube.com/c/FrenchComprehensibleInput](https://www.youtube.com/c/FrenchComprehensibleInput)", "created_utc": "1643854010.0", "edited": "False", "id": "hvd3bfi", "is_submitter": "False", "link_id": "t3_sj5u1n", "parent_id": "t3_sj5u1n", "score": "4", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "MusParvum", "body": "Try to give corrections to English speakers who are learning your language and then add them as friends. Add as many English-native friends as possible, then make sure you send your exercises to those friends instead of to the community. That should help bump up the number of corrections you receive a little bit. (though probably not into the hundreds... that's just... weird...)", "created_utc": "1643820561.0", "edited": "False", "id": "hvao5c9", "is_submitter": "False", "link_id": "t3_sisf2u", "parent_id": "t3_sisf2u", "score": "5", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "MusParvum", "body": "Weekly conversation practice with community tutors on iTalki. There are plenty with very reasonable prices, at least for Spanish.", "created_utc": "1643592483.0", "edited": "False", "id": "huxmvn7", "is_submitter": "False", "link_id": "t3_sgkz1e", "parent_id": "t3_sgkz1e", "score": "3", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "MusParvum", "body": "I'm wondering where the original sentence came from... is it from an online translator, or somewhere else?", "created_utc": "1643321188.0", "edited": "False", "id": "huhzf47", "is_submitter": "False", "link_id": "t3_se9end", "parent_id": "t1_huhye2l", "score": "1", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "MusParvum", "body": "Is that sentence the result of an online translator, or is it something from natively-written material?", "created_utc": "1643320996.0", "edited": "False", "id": "huhywu0", "is_submitter": "False", "link_id": "t3_se9end", "parent_id": "t3_se9end", "score": "1", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "MusParvum", "body": "A2 in 9 months seems reasonable to me? And B2 in a year seems super ambitious, considering that progress generally slows down as you get into the intermediate stages. More important than the number of months you've spent: Over that many months, how many hours each day have you been studying and practicing?", "created_utc": "1643228984.0", "edited": "False", "id": "huccs9o", "is_submitter": "False", "link_id": "t3_sdfbvv", "parent_id": "t3_sdfbvv", "score": "39", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "MusParvum", "body": "Maybe I'm completely misunderstanding what's going on here... I'm reading these as \"I frightened her\" and \"It (the lightning) frightened her\" respectively. If that's correct (maybe it's not?) then why would it make a difference \\*who\\* is doing the frightening? To me it seems like it should be \"La asusté\" and \"La asustó\".\n\n(Edited to add: And obviously, I know I must be wrong, since I'm just a learner. I just don't understand why I'm wrong. :) )", "created_utc": "1643125111.0", "edited": "False", "id": "hu5wqkp", "is_submitter": "False", "link_id": "t3_scbnru", "parent_id": "t1_hu5qvgl", "score": "1", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "MusParvum", "body": "Uffff.... I was nodding along with understanding to the first tweet there, but got totally lost on the second and third tweets. :( For instance, why is it \"La asusté\" but \"Le asustó\"?", "created_utc": "1643120255.0", "edited": "False", "id": "hu5l1h0", "is_submitter": "False", "link_id": "t3_scbnru", "parent_id": "t1_hu5hr2b", "score": "1", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "MusParvum", "body": "Here are a few possibilities... not sure if any fit the bill exactly, but they might be worth a look:\n\n[https://www.youtube.com/c/YaizaLillo](https://www.youtube.com/c/YaizaLillo)\n\n[https://www.youtube.com/channel/UCAdfkRD-N8zG0zeivnMUYuw](https://www.youtube.com/channel/UCAdfkRD-N8zG0zeivnMUYuw)\n\n[https://www.youtube.com/c/ClaraCarmona](https://www.youtube.com/c/ClaraCarmona)", "created_utc": "1643048813.0", "edited": "False", "id": "hu1tkv9", "is_submitter": "False", "link_id": "t3_sbez5f", "parent_id": "t3_sbez5f", "score": "3", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "MusParvum", "body": "It depends on what your interests are. Basically, find the Spanish language equivalent of whatever English language YouTube channels you might normally watch. Some of my personal favorites (I lean towards travel and cooking):\n\n[https://www.youtube.com/c/PlanetaJuan](https://www.youtube.com/c/PlanetaJuan)\n\n[https://www.youtube.com/c/ElJard%C3%ADndeMart%C3%ADn](https://www.youtube.com/c/ElJard%C3%ADndeMart%C3%ADn)\n\n[https://www.youtube.com/c/EnloszapatosdeMónica](https://www.youtube.com/c/EnloszapatosdeMónica)\n\n[https://www.youtube.com/user/charlysinewan](https://www.youtube.com/user/charlysinewan)\n\n[https://www.youtube.com/c/esconacento](https://www.youtube.com/c/esconacento)\n\nAnd these are a couple good channels targeted at people learning Spanish:\n\n[https://www.youtube.com/c/DreamingSpanish](https://www.youtube.com/c/DreamingSpanish)\n\n[https://www.youtube.com/channel/UCfG2VhlQgy5bHGmkpeKcjVA](https://www.youtube.com/channel/UCfG2VhlQgy5bHGmkpeKcjVA)", "created_utc": "1642827277.0", "edited": "False", "id": "htpcfwt", "is_submitter": "False", "link_id": "t3_s9tm71", "parent_id": "t1_htpbhev", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "MusParvum", "body": "If you watch with English subtitles your brain will try to just read the words and you won't really pick up much Spanish that way. If you aren't understanding much of the show with no subtitles or with Spanish subtitles (which is normal - native TV shows and movies are hard, apparently!) you might want to try watching some Spanish language YouTube channels. They're usually way more understandable than tv shows and movies, since they're usually just one or two people talking directly to the camera.", "created_utc": "1642826708.0", "edited": "False", "id": "htpbbju", "is_submitter": "False", "link_id": "t3_s9tm71", "parent_id": "t3_s9tm71", "score": "5", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "MusParvum", "body": "I just scored a C2 on this one, which is... not right. :)", "created_utc": "1642795362.0", "edited": "False", "id": "htn57yw", "is_submitter": "False", "link_id": "t3_s9dxo2", "parent_id": "t1_htm9w5m", "score": "6", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "MusParvum", "body": "I mean... do you want to learn how to spell correctly or not? It's not like you get a bad grade or anything, you just have to redo the question correctly. (Not trying to be snarky or anything, that's just my opinion on it. It's frustrating, sure, but makes sense for what it is.)", "created_utc": "1642277730.0", "edited": "False", "id": "hst3vlf", "is_submitter": "False", "link_id": "t3_s4if0t", "parent_id": "t3_s4if0t", "score": "5", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "MusParvum", "body": "The SuperBeginner playlist on the Dreaming Spanish YouTube channel.", "created_utc": "1642175996.0", "edited": "False", "id": "hsn4qne", "is_submitter": "False", "link_id": "t3_s3uyd7", "parent_id": "t3_s3uyd7", "score": "3", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "MusParvum", "body": "Busuu is actually pretty decent in my experience, at least for Spanish. I went through their whole course, and it teaches a good bit of grammar and vocab, and the exercise corrections from native speakers are helpful. I do agree though that it should be supplemented with lots of input from beginner-oriented YouTube and podcasts once you have at least a few weeks under your belt.", "created_utc": "1642041136.0", "edited": "False", "id": "hsfoiht", "is_submitter": "False", "link_id": "t3_s2lt4b", "parent_id": "t1_hsfnpyq", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "MusParvum", "body": "Glad to hear it. Good luck with everything!", "created_utc": "1642040778.0", "edited": "False", "id": "hsfnokm", "is_submitter": "False", "link_id": "t3_s2lt4b", "parent_id": "t1_hsfmvam", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "MusParvum", "body": "Pick the app/platform you like the best, pay for it (if it's a paid platform) and stick with it through the end of the course. (Not Duolingo... Duolingo is probably good as a fun supplemental, but I'm talking about one of the courses like Busuu or Pimsleur or whatever.) But sticking with it and finishing it is important... don't keep jumping around looking for the \"right\" way.", "created_utc": "1642036539.0", "edited": "False", "id": "hsfe0dv", "is_submitter": "False", "link_id": "t3_s2lt4b", "parent_id": "t3_s2lt4b", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "MusParvum", "body": "I would think it could definitely slow it down... it's regular consistent exposure. More would be better of course, but if you're at a high enough level I'm guessing it shouldn't be too hard. Subscribe to a German podcast or two and a couple of YouTube channels, about subjects that interest you. Read a few articles each week. Instead of treating it as a separate thing (\"German\") treat it as a couple of sources of news/entertainment that you enjoy regularly that just happen to be in German.", "created_utc": "1641928678.0", "edited": "False", "id": "hs8unfz", "is_submitter": "False", "link_id": "t3_s1i9j4", "parent_id": "t1_hs8hjgc", "score": "5", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "MusParvum", "body": "Maybe try tying Swedish practice to something that you already do tend to do consistently. For instance, while you eat breakfast, work through one DuoLingo lesson (or Busuu, or whatever other app/platform seems appropriate to you). Then while you eat lunch, watch one (preferably simple/easy) native Swedish video on YouTube. That way it's not something you have to remember to do entirely separately and on its own, but instead it hopefully becomes tied to those other tasks for you.", "created_utc": "1641911212.0", "edited": "False", "id": "hs7k0ij", "is_submitter": "False", "link_id": "t3_s19en2", "parent_id": "t3_s19en2", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "MusParvum", "body": "Great video, and it's cool to see you posting here - I recently subscribed to your channel after seeing you on Dreaming Spanish! Right now I can only understand your Spanish videos (and English of course), but one of my goals this year is to learn some French, so hopefully I'll be able to watch your French vids before too long. ¡Qué tengas éxito con tus metas!", "created_utc": "1641765063.0", "edited": "False", "id": "hryzy0k", "is_submitter": "False", "link_id": "t3_rzyj19", "parent_id": "t3_rzyj19", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "MusParvum", "body": "iTalki has a ton of reasonably-priced Spanish tutors, especially if you're mainly looking for conversational practice rather than formal instruction. I'd be surprised if an in-person tutor would be any more inexpensive.", "created_utc": "1641763965.0", "edited": "False", "id": "hrywtey", "is_submitter": "False", "link_id": "t3_s0145c", "parent_id": "t3_s0145c", "score": "4", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "MusParvum", "body": "Busuu worked well for me. You'll need to pay to access all the lessons, but IMO they do a good job teaching grammar and guiding you to an intermediate level.\n\nOnce you have a few weeks under your belt, start watching the SuperBeginner playlist on the Dreaming Spanish YouTube channel.", "created_utc": "1641751211.0", "edited": "False", "id": "hrxwq50", "is_submitter": "False", "link_id": "t3_rzswf5", "parent_id": "t3_rzswf5", "score": "4", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "MusParvum", "body": "\"...as long as they understand me...\"\n\nWell, that's the catch. If you're butchering the grammar, there's no guarantee they'll understand you. For instance, does \"Tu quiero bebes la agua?\" mean that you want to drink the water? Or you want to know if they want to drink the water? Or maybe you want them to drink the water? Or maybe you were trying to ask permission to drink their water? Maybe context will make it clear sometimes, but when it doesn't, they're going to have to guess at which part of the grammar you were messing up (and in what way) in order to figure out your intent.\n\nNone of that is to say there's anything wrong with making mistakes, only that IMO maybe you're doing yourself (and the people you're speaking to) a disservice by not at least trying to get it right.", "created_utc": "1641698687.0", "edited": "False", "id": "hrv7yr7", "is_submitter": "False", "link_id": "t3_rzh89l", "parent_id": "t3_rzh89l", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "MusParvum", "body": "\"Passive\" in the sense of putting something on in the background while you do a different task probably won't work well at this point - if you're a beginner you need to pay attention in order to understand or learn anything.\n\nGo find the channel \"Dreaming Spanish\" on YouTube and start watching their SuperBeginner playlist. That might be a little more interesting than DuoLingo (but make sure you're actively watching it - don't just passively have it on in the background while you're doing something else!)", "created_utc": "1641672497.0", "edited": "False", "id": "hrth63b", "is_submitter": "False", "link_id": "t3_rz88hc", "parent_id": "t3_rz88hc", "score": "3", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "MusParvum", "body": "tú = you\n\ntu = your", "created_utc": "1641658118.0", "edited": "False", "id": "hrsgnwk", "is_submitter": "False", "link_id": "t3_rz2jrr", "parent_id": "t1_hrseqat", "score": "15", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "MusParvum", "body": "El Alquimista. It's not a graded reader, but it's got fairly simple language and many of the new/unfamiliar words get repeated a lot throughout the book.", "created_utc": "1641607338.0", "edited": "False", "id": "hrq1vr6", "is_submitter": "False", "link_id": "t3_rynswo", "parent_id": "t3_rynswo", "score": "2", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "MusParvum", "body": "Me encanta Skeleton Crew. Es una colección de historias cortas. Tiene tantas historias buenas!", "created_utc": "1641592752.0", "edited": "False", "id": "hrp2d9r", "is_submitter": "False", "link_id": "t3_fvscgv", "parent_id": "t3_fvscgv", "score": "1", "subreddit": "SpanishBookClub", "subreddit_id": "t5_3ok37"}, {"author": "MusParvum", "body": "I would say try not to worry about it either way. At first, it's hard not to translate, because you haven't really \"internalized\" most of your Spanish vocabulary yet. Most of the Spanish words don't really have meaning to you yet apart from their English translations. But as you read more this will change on its own - you'll internalize the meaning (as opposed to the translation) of the Spanish words, and you'll find you're immediately understanding more, and translating less.\n\nAt least, that's been my experience. I still translate a good bit as I read, but I've found there are often longer and longer stretches/passages where I'm just reading and not translating, so I expect that will continue.", "created_utc": "1641587065.0", "edited": "False", "id": "hron77q", "is_submitter": "False", "link_id": "t3_rygn1e", "parent_id": "t3_rygn1e", "score": "8", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "MusParvum", "body": "Tal vez DotCSV para computer science (especialmente IA etc): [https://www.youtube.com/c/DotCSV](https://www.youtube.com/c/DotCSV)\n\n\"Díganme si hay cualquier error en mi ortografía\" ...solamente porque nos has preguntado: \"me ha gustado\" en vez de \"me a gustado\" :)", "created_utc": "1641435099.0", "edited": "False", "id": "hrfs5mc", "is_submitter": "False", "link_id": "t3_rx2ehh", "parent_id": "t3_rx2ehh", "score": "3", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "MusParvum", "body": "Maybe find a local club or group that does something you are interested in (a casual sport, boardgames or card games, knitting, whatever) and join. Your interest in the activity will keep you engaged in an environment where the language is used, and that might be enough to help you make some progress.", "created_utc": "1641422222.0", "edited": "False", "id": "hreyink", "is_submitter": "False", "link_id": "t3_rwygd5", "parent_id": "t3_rwygd5", "score": "10", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "MusParvum", "body": "If you play poker: Ante is the money that gets put in before the cards are dealt.", "created_utc": "1641413741.0", "edited": "False", "id": "hrediet", "is_submitter": "False", "link_id": "t3_rwuz7v", "parent_id": "t3_rwuz7v", "score": "3", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "MusParvum", "body": "\"I don’t see this in American culture. Over here everyone sounds the same.\"\n\nThere are a ton of different American accents. New England, New York, Joisey, Philly, multiple varieties of southern, midwestern....", "created_utc": "1641089501.0", "edited": "False", "id": "hqvsp6w", "is_submitter": "False", "link_id": "t3_rtx4l9", "parent_id": "t3_rtx4l9", "score": "6", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "MusParvum", "body": "My understanding is that the present perfect is used when the time period spoken of is in the past, but has a connection to the present. For example:\n\nHoy he comprado un coche. (Even though you bought the car earlier today, it's still today, so the present perfect is used.)\n\nEsta semana hemos visitado a muchas personas. (It's still \"this\" week, so even if you visited them several days ago, the present perfect is used. If it was \"last\" week that you did the visiting, then you'd use the preterite.)\n\nEste mes Pablo ha empezado un nuevo trabajo. (Again, it's still \"this\" month, so even if he began the job a few weeks ago, the \"this\" part of \"this month\" gives it a connection to the present, so the present perfect is used.)\n\n(Please note, I'm not a native speaker, so corrections are welcomed if I've misrepresented anything.)", "created_utc": "1640901640.0", "edited": "False", "id": "hqloe61", "is_submitter": "False", "link_id": "t3_rs9iq6", "parent_id": "t3_rs9iq6", "score": "4", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "MusParvum", "body": "I believe AndyGM en Berlín is originally from Madrid: https://www.youtube.com/user/AndyGMes", "created_utc": "1640900520.0", "edited": "False", "id": "hqlljpp", "is_submitter": "False", "link_id": "t3_rs6bxd", "parent_id": "t3_rs6bxd", "score": "2", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "MusParvum", "body": "This is the important question. For instance, if you were going to watch YouTube in your native language, what kinds of channels would you watch? Go find the Spanish-language equivalents of those kinds of channels. There's a ton of great content out there.", "created_utc": "1640147154.0", "edited": "False", "id": "hpinu5l", "is_submitter": "False", "link_id": "t3_rlri0c", "parent_id": "t1_hphouel", "score": "1", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "MusParvum", "body": "You might be interested in this Discord server: [https://discord.gg/Wnu9SEaUJj](https://discord.gg/Wnu9SEaUJj)\n\nWe have a good mix of native Spanish and native English speakers (and a few people with other native languages), all learning either Spanish or English, and several of us try to practice speaking once a week in one of the voice channels.", "created_utc": "1640021704.0", "edited": "False", "id": "hpbg2d3", "is_submitter": "False", "link_id": "t3_rkpwom", "parent_id": "t3_rkpwom", "score": "1", "subreddit": "language_exchange", "subreddit_id": "t5_2tdbm"}, {"author": "MusParvum", "body": "El Alquimista is a good first book. The writing is pretty straightforward, and many of the newer / more unusual words get repeated fairly often.\n\nIMO looking up everything is a drag. When reading or watching something, my personal method is to generally only look up a word if I totally can't understand what's going on without knowing that word, or if I recognize that I've seen a word a few times in the past and don't remember what it means. I don't know if that's the best method, but it's one that helps me stay interested in what I'm reading or watching instead of feeling like it's a chore.", "created_utc": "1639710253.0", "edited": "False", "id": "hov9mjv", "is_submitter": "False", "link_id": "t3_ri73u0", "parent_id": "t3_ri73u0", "score": "4", "subreddit": "learnspanish", "subreddit_id": "t5_2rd6d"}, {"author": "MusParvum", "body": "Sure, I pretty much agree with that. I guess my point is that there can be (and are) interesting materials for learners - \"simple\" does not \\*have\\* to mean \"boring\". And if there is more interesting material, there's nothing wrong with preferring that over material that's not interesting.\n\nYou're absolutely right that good story writing is a specific skill that not many people have. If there are language educators who want to go that route, I would love to see them either work on and refine that skill first (it's like anything else - it's a skill that can be learned) or possibly even partner with an actual writer who is good at that skill.", "created_utc": "1639697530.0", "edited": "False", "id": "houhat2", "is_submitter": "False", "link_id": "t3_rhjxqd", "parent_id": "t1_houebfl", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "MusParvum", "body": ">I am no position to ask for a Lord of the Ring narrative with engaging characters and tear-jerking plot twists.\n\nBut my point is that a story can be engaging without being a Lord of the Rings narrative. \"Interesting and engaging\" does not equal \"novel length work of literature\". You can have a story that's about turtles befriending birds and dogs, and that story could be either well written and engaging OR it could be plodding and boring.\n\nGo to the picture book section of your local bookstore and read a dozen books there. All of them will be simple and accessible. Some of them will be well written and engaging. Some of them will be plodding and boring.", "created_utc": "1639677449.0", "edited": "False", "id": "hot33di", "is_submitter": "False", "link_id": "t3_rhjxqd", "parent_id": "t1_hot20u4", "score": "6", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "MusParvum", "body": "I haven't read any of Olly's stories, but \"entry level, easy to follow and accessible\" and \"a genuinely good story that's interesting\" are two completely different things. For example there are tons of picture books for young kids that are engaging with a fun story and characters you actually care about, while still totally being easy to follow and accessible. (I'm talking about regular English language picture books here, not material designed for learning a second language). The point being that the craft of good story writing is a separate thing from the accessibility and reading level of the same story.", "created_utc": "1639668084.0", "edited": "False", "id": "hosf38p", "is_submitter": "False", "link_id": "t3_rhjxqd", "parent_id": "t1_hos9ws7", "score": "10", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "MusParvum", "body": "For what it's worth, as far as written English goes: If this post is a representative sample of your writing, you have absolutely nothing to worry about. It's on par with native writing, better than a lot of natives write, and if it was about any subject other than you questioning your abilities as an English learner, I'm pretty sure I would have just assumed you were a native English speaker.", "created_utc": "1639583706.0", "edited": "False", "id": "honnpyv", "is_submitter": "False", "link_id": "t3_rgybcy", "parent_id": "t3_rgybcy", "score": "30", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "MusParvum", "body": "I believe it's because in the first case it's a direct object, and in the second case it's an indirect object.\n\nLa había llamado = She had called her ...\"La\" is the direct object of the call\n\nLe había dicho = She had told (something) (to) her ...in this case the thing being told (the \"something\") is the direct object and \"her\" (le) is the indirect object", "created_utc": "1639533536.0", "edited": "False", "id": "hola913", "is_submitter": "False", "link_id": "t3_rgmsnr", "parent_id": "t3_rgmsnr", "score": "43", "subreddit": "learnspanish", "subreddit_id": "t5_2rd6d"}, {"author": "MusParvum", "body": "Rephrase the sentence and use contratiempo, maybe?", "created_utc": "1639352729.0", "edited": "False", "id": "hob9ndp", "is_submitter": "False", "link_id": "t3_rf11lz", "parent_id": "t3_rf11lz", "score": "1", "subreddit": "learnspanish", "subreddit_id": "t5_2rd6d"}, {"author": "MusParvum", "body": "Not free, but iTalki gives you a set number of \"trial lessons\" (3 I think?) that give you a reduced price for a lesson from whatever tutor you select. So you can try a few different tutors for less than the normal price. But you can always pay on a per-lesson basis (you don't have to buy a package or anything), so there's no big up front commitment. I'm not sure how other platforms handle it.", "created_utc": "1639256496.0", "edited": "False", "id": "ho5ywf5", "is_submitter": "False", "link_id": "t3_re88w0", "parent_id": "t1_ho5xz7j", "score": "13", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "MusParvum", "body": "If you can afford it, get a conversational tutor on iTalki or somewhere similar, and practice with them a couple times a week. That way you have the full attention of someone who's invested in helping you correct mistakes and not making fun of you.", "created_utc": "1639255717.0", "edited": "False", "id": "ho5x51y", "is_submitter": "False", "link_id": "t3_re88w0", "parent_id": "t3_re88w0", "score": "85", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "MusParvum", "body": "Yeah, it sounds like it'll work, but there's something he's not quite happy with. In that situation, I'd usually ask something like \"How can I improve it?\" or \"Is there something specific you'd like to see done differently?\"\n\nI'm not sure what kind of work you do, but in many fields this isn't necessarily a big deal - revisions and changes are expected, and it can take a few tries to hit on the right solution. If that's the case here, the key is to not take it personally, try to understand where you're missing the mark, and be willing to make changes.", "created_utc": "1639084033.0", "edited": "False", "id": "hnwftps", "is_submitter": "False", "link_id": "t3_rcqypa", "parent_id": "t3_rcqypa", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "MusParvum", "body": "Instead of simply trying to learn the alphabet as some detached \"thing\" maybe try to relate it and tie it in to something fun and interesting. For instance, get one of your Arabic-speaking friends to set up some kind of scavenger hunt around town where you'll need to read/decipher shop signs and street signs in order to follow the clues. Something where there's more of a fun, immediate, concrete purpose than simply \"gotta learn this stuff\".", "created_utc": "1638973926.0", "edited": "False", "id": "hnpyggq", "is_submitter": "False", "link_id": "t3_rbpo4m", "parent_id": "t3_rbpo4m", "score": "5", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "MusParvum", "body": "\"I don't have as much passion for Spanish\"\n\n...I think this is the answer to your question. Especially if you love Italian. If you're enjoying the language, and enjoying learning the language, you should keep at it. There are a lot of worthwhile hobbies that aren't \"useful\".", "created_utc": "1638913166.0", "edited": "False", "id": "hnn4ylp", "is_submitter": "False", "link_id": "t3_rba4tu", "parent_id": "t3_rba4tu", "score": "7", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "MusParvum", "body": "Awesome! Thank you so much!", "created_utc": "1638397533.0", "edited": "False", "id": "hmusgv3", "is_submitter": "False", "link_id": "t3_r6knml", "parent_id": "t1_hmu3sy6", "score": "1", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "MusParvum", "body": "I would love to see how El Principito and El Alquimista fit in here, as those are my first two books. (I have physical copies though, so no ebook link...)", "created_utc": "1638386888.0", "edited": "False", "id": "hmu0i3o", "is_submitter": "False", "link_id": "t3_r6knml", "parent_id": "t3_r6knml", "score": "2", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "MusParvum", "body": "What game is this?", "created_utc": "1637679538.0", "edited": "False", "id": "hlrv80m", "is_submitter": "False", "link_id": "t3_r0ekan", "parent_id": "t3_r0ekan", "score": "5", "subreddit": "learnspanish", "subreddit_id": "t5_2rd6d"}, {"author": "MusParvum", "body": "True! That's a very good point.", "created_utc": "1637265370.0", "edited": "False", "id": "hl5tp0a", "is_submitter": "False", "link_id": "t3_qwwmm6", "parent_id": "t1_hl5srxd", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "MusParvum", "body": "Oh no! Sorry! 😬", "created_utc": "1637264236.0", "edited": "False", "id": "hl5qsx6", "is_submitter": "False", "link_id": "t3_qwwmm6", "parent_id": "t1_hl5pv9v", "score": "9", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "MusParvum", "body": "I've wondered this myself... although my fear is that I might be training my brain to ignore the language as \"background noise\".", "created_utc": "1637263138.0", "edited": "False", "id": "hl5o0w7", "is_submitter": "False", "link_id": "t3_qwwmm6", "parent_id": "t3_qwwmm6", "score": "43", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "MusParvum", "body": "Yo también. No puedo entender todo de lo que dice (tengo solo un nivel intermedio), pero me gustan sus aventuras y su actitud.", "created_utc": "1637256049.0", "edited": "False", "id": "hl55xuw", "is_submitter": "False", "link_id": "t3_qwtbwt", "parent_id": "t1_hl54ynm", "score": "2", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "MusParvum", "body": "Creo que Charly Sinewan es de Madrid: https://www.youtube.com/user/charlysinewan", "created_utc": "1637253762.0", "edited": "False", "id": "hl503pm", "is_submitter": "False", "link_id": "t3_qwtbwt", "parent_id": "t3_qwtbwt", "score": "2", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "MusParvum", "body": "https://apps.apple.com/app/id1519599004", "created_utc": "1637180757.0", "edited": "False", "id": "hl15rub", "is_submitter": "False", "link_id": "t3_qw81fb", "parent_id": "t1_hl15l2r", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "MusParvum", "body": "Language Transfer has their own app in the app store. Or, at least they did a year ago...", "created_utc": "1637180684.0", "edited": "False", "id": "hl15l2r", "is_submitter": "False", "link_id": "t3_qw81fb", "parent_id": "t3_qw81fb", "score": "5", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "MusParvum", "body": "I think you're fine. I mean, I feel similar, but I think I'm just impatient. :)\n\nI started with Spanish around September 2020, and after a combination of Duolingo (only for about the first month), Busuu (a lot at first, less more recently), a ton of watching Spanish-language YouTube (guessing maybe 300-400 hours by this point?), chatting on HelloTalk, and doing once a week conversation practice on iTalki since the spring, I'd say I'm also around a B1 somewhere.\n\nWhich is... fine, IMO. Sure, I'd rather be B2, but I feel like B1 is pretty solid progress for a year, and indicates that if I just keep doing what I'm doing, B2 can't be too far away (I'm guessing one more year?).\n\nYou have a year and a half, but you also took 2 months off. Reading an actual book seems like great progress even if there are chunks you aren't understanding. Keep going, and trust the process. That's what I tell myself :)", "created_utc": "1636751000.0", "edited": "False", "id": "hkdnxtc", "is_submitter": "False", "link_id": "t3_qskdhm", "parent_id": "t3_qskdhm", "score": "4", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "MusParvum", "body": "Busuu teaches vocab and grammar and has worked well for me. You have to pay to access all the lessons, but you can make a free account and try some of them first to see if it's a good fit for you. Also, watch lots of Spanish YouTube content, starting with something targeted at beginners like Dreaming Spanish's super beginner playlist.", "created_utc": "1636739240.0", "edited": "False", "id": "hkcw3n1", "is_submitter": "False", "link_id": "t3_qsgam8", "parent_id": "t3_qsgam8", "score": "3", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "MusParvum", "body": "Estudias is for you singular (informal). You plural would be either estudiáis (Spain informal) or estudian (Latin America, or Spain formal). In other words, the ellos/ellas/ustedes conjugations are identical.", "created_utc": "1636569260.0", "edited": "1636569478.0", "id": "hk3lntv", "is_submitter": "False", "link_id": "t3_qqzs0g", "parent_id": "t3_qqzs0g", "score": "19", "subreddit": "learnspanish", "subreddit_id": "t5_2rd6d"}, {"author": "MusParvum", "body": ">no no no no no\n\nja ja ja ja ja", "created_utc": "1636477102.0", "edited": "False", "id": "hjyefk0", "is_submitter": "False", "link_id": "t3_qq5vii", "parent_id": "t3_qq5vii", "score": "9", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "MusParvum", "body": "I think slow speech will prepare you to listen to slightly faster speech, which will prepare you to listen to faster speech, which will prepare you to listen to fast speech.", "created_utc": "1636418133.0", "edited": "False", "id": "hjvhuvf", "is_submitter": "False", "link_id": "t3_qpqvcw", "parent_id": "t1_hjvfsm5", "score": "49", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "MusParvum", "body": "The last one is probably \"acertado\" or some conjugation of \"acertar\"... to guess correctly.\n\nI believe acabar + de + infinitive is used to say someone just did something... for example \"acabo de decirte\" = I just told you.", "created_utc": "1636403300.0", "edited": "False", "id": "hjuijej", "is_submitter": "False", "link_id": "t3_qpm1ps", "parent_id": "t3_qpm1ps", "score": "9", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "MusParvum", "body": "I would love to hear some of your thoughts about this, in addition to the numbers. Did multiple lessons per week help enough to be worth the extra expense? Was there anything specific that your tutors did that you found particularly helpful (or unhelpful)? Were these lessons primarily conversational practice, or actual instruction?", "created_utc": "1636400558.0", "edited": "False", "id": "hjubqvl", "is_submitter": "False", "link_id": "t3_qpl3wb", "parent_id": "t3_qpl3wb", "score": "29", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "MusParvum", "body": "When I got my pizza stone I baked it alone in the oven for awhile with no food to let it give off any possible gasses, odors, or weirdness before I used it for actual baking.", "created_utc": "1636332617.0", "edited": "False", "id": "hjqwc2t", "is_submitter": "False", "link_id": "t3_qoujdz", "parent_id": "t3_qoujdz", "score": "1", "subreddit": "foodsafety", "subreddit_id": "t5_2t75v"}, {"author": "MusParvum", "body": "Right now your long-term goal is \"get good at Spanish\". Focusing on that long-term goal is what's tripping you up, because it's out of your immediate control. You have to forget about that goal entirely.\n\nInstead, focus completely on a short term goal that's 100% in your control. \"I will watch 1 hour of immersive videos and complete 1 lesson per day.\" That's your one and only goal. It doesn't matter how well you do or how good you are - that's irrelevant to your goal. Your goal is merely to complete that daily task.", "created_utc": "1635984985.0", "edited": "False", "id": "hj7ykv6", "is_submitter": "False", "link_id": "t3_qm7hpc", "parent_id": "t3_qm7hpc", "score": "12", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "MusParvum", "body": "Embrace the idea of messing up and making mistakes. The only way to learn and improve at this sort of thing is to do it and do it badly until you get better at it. So go into it with the idea of \\*wanting\\* to mess up and wanting to make tons of mistakes, as much and as often as possible, because that's how you will get good at it.", "created_utc": "1635875592.0", "edited": "False", "id": "hj1dz0b", "is_submitter": "False", "link_id": "t3_ql9nf0", "parent_id": "t3_ql9nf0", "score": "3", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "MusParvum", "body": "The person I've seen use it is from Spain (Barcelona, specifically). I personally don't know where else it might be used.", "created_utc": "1635437617.0", "edited": "False", "id": "hieag8m", "is_submitter": "False", "link_id": "t3_qhpijj", "parent_id": "t1_hie9vna", "score": "5", "subreddit": "learnspanish", "subreddit_id": "t5_2rd6d"}, {"author": "MusParvum", "body": "I've seen \"a que sí?\" used like this. (Edited to add: And \"verdad?\" as another person mentioned.)", "created_utc": "1635435786.0", "edited": "False", "id": "hie5tbu", "is_submitter": "False", "link_id": "t3_qhpijj", "parent_id": "t3_qhpijj", "score": "10", "subreddit": "learnspanish", "subreddit_id": "t5_2rd6d"}, {"author": "MusParvum", "body": "Try [https://conjuguemos.com/activities/spanish/verb/1](https://conjuguemos.com/activities/spanish/verb/1) ...pick one tense at a time. Review your conjugation chart first, then do one of their drills. Do it multiple times per day. When you start getting them mostly right, add another tense (but keep doing the previous ones too). Multiple times per day. It's not glamorous or exciting, but it'll probably help you learn the stuff in time to improve your grade a bit.", "created_utc": "1635376887.0", "edited": "False", "id": "hib9dub", "is_submitter": "False", "link_id": "t3_qh94a1", "parent_id": "t3_qh94a1", "score": "4", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "MusParvum", "body": "I'm truly sorry to hear about those experiences you've had - that's terrible, and I don't want to minimize that in any way. It's understandable that you might feel more hesitant because of it. I guess I've just seen a few examples recently of people automatically discounting what someone might have to say or offer simply because they're older, so this was on my mind. But you're right... the internet can be kinda nasty, so it's good to be on your guard!", "created_utc": "1635268949.0", "edited": "False", "id": "hi4zhut", "is_submitter": "False", "link_id": "t3_qg7app", "parent_id": "t1_hi4xqpq", "score": "8", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "MusParvum", "body": ">I remember talking to Spanish with this guy and I found out he was 47, which made me very uncomfortable.\n\nOoof... I appreciate the honesty here, but as someone who's not too far from that age, that makes me kinda sad. I've been in Discord chats with people on language learning servers, and when they found out how old I was, they were completely astounded, as if they couldn't imagine how I figured out how to use a computer, or I was gonna keel over any second. And yet, we had plenty of things to talk about, learning about each other's countries and such. But now I'm wondering if I should start lying about my age, and avoiding video calls...", "created_utc": "1635267980.0", "edited": "False", "id": "hi4x1it", "is_submitter": "False", "link_id": "t3_qg7app", "parent_id": "t1_hi4hj8u", "score": "29", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "MusParvum", "body": "Yeah, I get what you're saying. The soup in the crockpot got well over 180 F for at least 6 hours. So, assuming the onions were even from the contaminated batch, I feel like they were probably ok by that point. But yeah, if we hadn't already put the soup together before we heard the news, we definitely would have just chucked them.\n\nRegarding the knives... again, by the time we heard about the recall, we had already chopped up the onions. It was too late. Short of throwing away our cutlery, there isn't too much I could do. I washed them twice in the sink with lots of soapy water, scrubbing very vigorously. Hopefully that's enough (and/or hopefully the onions weren't from the contaminated batch...)", "created_utc": "1635206696.0", "edited": "False", "id": "hi1wexb", "is_submitter": "True", "link_id": "t3_qctx6f", "parent_id": "t1_hi1n1ov", "score": "1", "subreddit": "foodsafety", "subreddit_id": "t5_2t75v"}, {"author": "MusParvum", "body": "Why not, if they're already in the soup? Does cooking above 165F not actually kill salmonella?", "created_utc": "1635178507.0", "edited": "False", "id": "hi013u4", "is_submitter": "True", "link_id": "t3_qctx6f", "parent_id": "t1_hhzvb1h", "score": "1", "subreddit": "foodsafety", "subreddit_id": "t5_2t75v"}, {"author": "MusParvum", "body": "I've heard good things about Mar de Plástico. I watched the first episode and it was pretty good.", "created_utc": "1635091317.0", "edited": "False", "id": "hhvhjed", "is_submitter": "False", "link_id": "t3_qeu9be", "parent_id": "t3_qeu9be", "score": "6", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "MusParvum", "body": "Here in North Carolina one of our local high schools offers Spanish, French, and Japanese. (Japanese is kinda unusual to find at most schools though.)\n\nSpanish will probably be the most common language offered at various schools, followed by French. Latin might be available depending on the school. Many times it's also possible to take online courses (offered and taught by the school system) to fulfill your language requirement, and that might expand the possible languages that are available.", "created_utc": "1634930107.0", "edited": "False", "id": "hhnniub", "is_submitter": "False", "link_id": "t3_qdmo47", "parent_id": "t3_qdmo47", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "MusParvum", "body": "It's almost dinner time.... I'm gonna eat it...", "created_utc": "1634850437.0", "edited": "False", "id": "hhjfyis", "is_submitter": "True", "link_id": "t3_qctx6f", "parent_id": "t3_qctx6f", "score": "1", "subreddit": "foodsafety", "subreddit_id": "t5_2t75v"}, {"author": "MusParvum", "body": "From Mexico, a moderate amount of content, and fairly bubbly: https://www.youtube.com/c/esconacento", "created_utc": "1634835267.0", "edited": "False", "id": "hhiecn6", "is_submitter": "False", "link_id": "t3_qcv4hn", "parent_id": "t3_qcv4hn", "score": "2", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "MusParvum", "body": "Don't think of it as leaving it behind. Just think of it as having gotten your Russian up to an acceptable level for now, and then putting it in maintenance mode. Continue to talk with your friends on HelloTalk and watch an occasional Russian YouTube video so it doesn't get too rusty. But devote the bulk of your language learning time to a language you're more interested in.", "created_utc": "1634519419.0", "edited": "False", "id": "hh201af", "is_submitter": "False", "link_id": "t3_qabqsv", "parent_id": "t3_qabqsv", "score": "58", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "MusParvum", "body": ">not to mention the ubiquity of english, which really renders moot the necessity of learning other languages.\n\nI feel this way sometimes, but then I have to remind myself that right now most of the people I talk to in my target language are also interested in language learning. So of course they're learning English. But they aren't necessarily representative of the population at large.", "created_utc": "1634482291.0", "edited": "False", "id": "hgznhau", "is_submitter": "False", "link_id": "t3_q9zqvw", "parent_id": "t3_q9zqvw", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "MusParvum", "body": "Yep, that makes sense now! I just wasn't sure if it was more like a conversation, with both people talking to each other, or more like a speech, where one person presents to the other person. But it sounds like a conversation, which is perfect. Thank you!", "created_utc": "1634337398.0", "edited": "False", "id": "hgsn54g", "is_submitter": "False", "link_id": "t3_q8w0u1", "parent_id": "t1_hgsbgts", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "MusParvum", "body": "This is a neat idea! So in the 1-on-1 sessions, are both people speaking to each other? Or is one speaking and the other listening?", "created_utc": "1634330782.0", "edited": "False", "id": "hgs8yjk", "is_submitter": "False", "link_id": "t3_q8w0u1", "parent_id": "t3_q8w0u1", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "MusParvum", "body": "Thank you for the extremely helpful advice that takes into account precisely \\*one\\* aspect of my situation, goals, and process!", "created_utc": "1634128217.0", "edited": "False", "id": "hgh4fvu", "is_submitter": "False", "link_id": "t3_q708rf", "parent_id": "t1_hggdynt", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "MusParvum", "body": "I've heard this suggested before, and seen a couple of people say they've done it, so it's not a completely bonkers idea. I'm considering trying it myself - I'm a native English speaker who's been learning Spanish for about a year, and this week I decided to try Duolingo's French course for Spanish speakers. The first lesson hurt my brain pretty badly, but it felt a little more natural during the second lesson. That's as far as I've gotten for now though.", "created_utc": "1634087931.0", "edited": "False", "id": "hgfg1ac", "is_submitter": "False", "link_id": "t3_q708rf", "parent_id": "t3_q708rf", "score": "8", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "MusParvum", "body": "My guess is that it's better not to force specific techniques if you aren't enjoying them. Find things you enjoy, and do them in Korean, like the HaeGeum. Maybe take up a brand new instrument (learning from a Korean-speaking instructor) or find a few Korean-speaking musicians to play music with.\n\nI sincerely hope you're able to navigate all this, especially your depression. Best of luck to you.", "created_utc": "1633663245.0", "edited": "False", "id": "hft9lj3", "is_submitter": "False", "link_id": "t3_q3nqmz", "parent_id": "t3_q3nqmz", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "MusParvum", "body": "But isn't \"una perspectiva\" the direct object, rather than the subject? It's the thing that is being offered...", "created_utc": "1633646109.0", "edited": "False", "id": "hfsapbx", "is_submitter": "False", "link_id": "t3_q3j959", "parent_id": "t1_hfs5hxw", "score": "6", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "MusParvum", "body": "I believe that you need \"bien\" on the end if you're saying you're good at the thing:\n\nSe me da bien bailar.\n\nYou can use mal or fatal if you're not good at the thing:\n\nSe me da mal/fatal bailar.\n\nEdited to add:\n\nOther people can also be good at the thing:\n\nSe te da bien bailar. (YOU are good at dancing.)\n\nAnd if the thing is plural you have to conjugate \"da\" as \"dan\":\n\nLas matemáticas se me dan fatal.", "created_utc": "1633568950.0", "edited": "1633569199.0", "id": "hfobnio", "is_submitter": "False", "link_id": "t3_q2xjps", "parent_id": "t3_q2xjps", "score": "2", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "MusParvum", "body": "I'll second this... Dreaming Spanish on YouTube is great. Other similar channels with a similar approach to Spain-focused Spanish:\n\nSpanish After Hours: [https://www.youtube.com/channel/UCfG2VhlQgy5bHGmkpeKcjVA](https://www.youtube.com/channel/UCfG2VhlQgy5bHGmkpeKcjVA)\n\nSpanish With Alma: [https://www.youtube.com/c/SpanishwithAlma](https://www.youtube.com/c/SpanishwithAlma)\n\nChannels like those, along with [busuu.com](https://busuu.com) have worked very well for me.", "created_utc": "1633401027.0", "edited": "False", "id": "hffmpsj", "is_submitter": "False", "link_id": "t3_q1jgup", "parent_id": "t1_hffk8ct", "score": "5", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "MusParvum", "body": "Ehhh... I'm no expert, but it sounds pretty smart to me.", "created_utc": "1633136829.0", "edited": "False", "id": "hf1l1lq", "is_submitter": "False", "link_id": "t3_pzl65t", "parent_id": "t3_pzl65t", "score": "7", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "MusParvum", "body": ">Nah, suena horrible\n\nInteresante! Creía que había visto esta estructura antes, pero es posible que estoy equivocado. Gracias!", "created_utc": "1633107704.0", "edited": "False", "id": "hezua5q", "is_submitter": "False", "link_id": "t3_pza5uz", "parent_id": "t1_hezsm5u", "score": "1", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "MusParvum", "body": "Si quieres quitar toda sensación de duda, ¿podrías decir \"Creo que no \\[+ indicativo\\]\"?", "created_utc": "1633104789.0", "edited": "False", "id": "heznf14", "is_submitter": "False", "link_id": "t3_pza5uz", "parent_id": "t3_pza5uz", "score": "9", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "MusParvum", "body": "También en ingles usamos esa frase - \"good catch\" - cuando alguien encuentre un error en algo. Por ejemplo si estés escribiendo un informe o la tarea o lo que sea y te muestro que usaste una palabra equivocada en una frase, puedes decirme \"good catch\". Se puede usar \"buena atrapada\" como eso?", "created_utc": "1633049206.0", "edited": "False", "id": "hex3xvp", "is_submitter": "False", "link_id": "t3_pywdu5", "parent_id": "t1_hex0pl9", "score": "6", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "MusParvum", "body": "\"Por otro lado\" means \"on the other hand\". But maybe there are other ways to say it that sound closer to este lado?", "created_utc": "1633036138.0", "edited": "False", "id": "hewce4s", "is_submitter": "False", "link_id": "t3_pysse2", "parent_id": "t3_pysse2", "score": "8", "subreddit": "learnspanish", "subreddit_id": "t5_2rd6d"}, {"author": "MusParvum", "body": "jajajaja.... I'm not the OP, but yeah, \"han enseñaban\" had me reconsidering my already sketchy conjugation abilities.... :)", "created_utc": "1632942632.0", "edited": "False", "id": "herazbc", "is_submitter": "False", "link_id": "t3_py1z4s", "parent_id": "t1_her9kx9", "score": "1", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "MusParvum", "body": "Yes. 100%. I keep telling myself that it's going to vary from day to day, and the important thing is whether I'm making progress over the long term... as long as I don't quit it'll get more consistently easy over time. I don't know if that's all true, but that's what I tell myself. :)", "created_utc": "1632934430.0", "edited": "False", "id": "heqqzqb", "is_submitter": "False", "link_id": "t3_pxyhel", "parent_id": "t3_pxyhel", "score": "27", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "MusParvum", "body": "That's really interesting to hear, and something I've been thinking about a lot recently. I have a question: Does this hold true even if the speaking speed of the student is... very ......... slow. With.... lots of ......pauses. Between words? I really wonder about this, because when I try to speak precisely and get all the conjugations right, and use good sentence structure, I feel like I'm going so slow that it must be really hard to follow what I'm saying.", "created_utc": "1632934219.0", "edited": "False", "id": "heqqg7f", "is_submitter": "False", "link_id": "t3_pxyzwh", "parent_id": "t3_pxyzwh", "score": "22", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "MusParvum", "body": "Look up the YouTube channel called Dreaming Spanish. Start with their Superbeginner playlist. When you can reliably understand (nearly) everything that they're saying in those videos, move up to the Beginner playlist, and so on.", "created_utc": "1632624828.0", "edited": "False", "id": "heat5cd", "is_submitter": "False", "link_id": "t3_pv111e", "parent_id": "t3_pv111e", "score": "3", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "MusParvum", "body": "Yup. That still always makes me hesitate a bit when deciding which one to use. :)", "created_utc": "1632438690.0", "edited": "False", "id": "he0vwto", "is_submitter": "False", "link_id": "t3_pt7qv5", "parent_id": "t1_hdxc0lc", "score": "2", "subreddit": "learnspanish", "subreddit_id": "t5_2rd6d"}, {"author": "MusParvum", "body": "Yes, if the process of learning the language is enjoyable and makes you happy. Plenty of people have hobbies that they practice solo, without needing to share the process or the results with others - drawing, woodworking, hiking, watching movies, reading, etc. If it's interesting and brings you joy, it's worthwhile on its own terms.", "created_utc": "1632430069.0", "edited": "False", "id": "he0cirb", "is_submitter": "False", "link_id": "t3_pu434l", "parent_id": "t3_pu434l", "score": "12", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "MusParvum", "body": "They're different so they can match the gender of the word being referred to:\n\nFor feminine words such as \"silla\": Esta silla. Esa silla. (This chair. That chair.)\n\nFor masculine words such as \"lápiz\": Este lápiz. Ese lápiz. (This pencil. That pencil.)\n\nThere's also a gender neutral version for when you're referring to something for which you don't know the gender.\n\n¿Qué es esto? ¿Qué es eso? (What is this? What is that?)", "created_utc": "1632324506.0", "edited": "False", "id": "hdurx1y", "is_submitter": "False", "link_id": "t3_pt7qv5", "parent_id": "t3_pt7qv5", "score": "11", "subreddit": "learnspanish", "subreddit_id": "t5_2rd6d"}, {"author": "MusParvum", "body": "I think it depends on what kind of tutor you're looking for. I've been using Busuu to learn Spanish, and I waited until I was between A2/B1 before I started using iTalki tutors. I feel like that was pretty much the right time to start...conversation was \\*really\\* hard at first (it's still hard! :) ), and I think any earlier would have been mostly useless for me.\n\nBUT, I think there's an important consideration here: I have only used tutors for conversational practice. They teach some vocabulary and grammar points here and there, but the main focus is specifically on practicing speaking. I think if you want a tutor who is actually guiding you through lessons and teaching you the language in a more thorough way, then it's probably fine/good to start much earlier than I did. Just make sure you're getting a tutor that's giving you lessons, and not just conversational practice.", "created_utc": "1632185539.0", "edited": "False", "id": "hdnu6n5", "is_submitter": "False", "link_id": "t3_ps1863", "parent_id": "t3_ps1863", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "MusParvum", "body": "Use the textbooks from your class. Devour them as if mastering Spanish grammar was your new hobby.", "created_utc": "1632156802.0", "edited": "False", "id": "hdlzpxt", "is_submitter": "False", "link_id": "t3_prpg9b", "parent_id": "t1_hdkdajx", "score": "4", "subreddit": "learnspanish", "subreddit_id": "t5_2rd6d"}, {"author": "MusParvum", "body": "Oh wow...that's great! I'd been looking for a good travel vlog from someone from Spain. I just wish it didn't have the English subtitles baked in. It's \\*so hard\\* not to read them...", "created_utc": "1631907310.0", "edited": "False", "id": "hd8tkpe", "is_submitter": "False", "link_id": "t3_pq5kuu", "parent_id": "t3_pq5kuu", "score": "5", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "MusParvum", "body": "My tutor will often send me a link to an article or video a few days before our lesson, and then we'll discuss it during the lesson. I've also suggested a topic based on an activity I had done recently.", "created_utc": "1631839102.0", "edited": "False", "id": "hd5dlmy", "is_submitter": "False", "link_id": "t3_ppp61w", "parent_id": "t3_ppp61w", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "MusParvum", "body": "Go on iTalki and book some conversational lessons with a community tutor. A bit of practice will help a lot.", "created_utc": "1631222564.0", "edited": "False", "id": "hc8c27l", "is_submitter": "False", "link_id": "t3_pl6r4w", "parent_id": "t3_pl6r4w", "score": "5", "subreddit": "learnspanish", "subreddit_id": "t5_2rd6d"}, {"author": "MusParvum", "body": "Yeah, llevar, but I'm not sure you just replace \"estudiado\" with llevado. \"He llevado español\" seems weird to me. I think it's used more like \"Llevo dos años estudiando español.\"", "created_utc": "1631215394.0", "edited": "False", "id": "hc7uhbc", "is_submitter": "False", "link_id": "t3_pl1p1h", "parent_id": "t1_hc7934z", "score": "2", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "MusParvum", "body": "As long as you are regularly studying outside of your practice sessions with her, I would say keep your sessions with her shorter for now (maybe only 1/2 hour - 45 minutes) and then try longer sessions in a few months. \n\nI had a similar experience... after about 6 months of studying on my own, I started conversational practice on iTalki, and 45 minutes was exhausting... my brain was fried by the end of the lesson. But after a few more months, the sessions were still challenging, but I was still ready for more at the end of the lesson (I recently bumped my lessons up to an hour in length and have enjoyed it so far).\n\nSo, keep going - it's great that your grandma is willing to help you! But consider scaling it back just a little to push your current abilities without getting burned out or discouraged.", "created_utc": "1631024792.0", "edited": "False", "id": "hbxnl6o", "is_submitter": "False", "link_id": "t3_pjgpaf", "parent_id": "t3_pjgpaf", "score": "1", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "MusParvum", "body": "Pretty sure it's the first one: He said that he told his team. The \"le\" is an indirect object, referring to su equipo. He told \"it\" (direct object) to \"his team\" (indirect object).\n\nA similar structure would be \"me dijiste que\" ... \"you told me (indirect object) that...\"", "created_utc": "1630779580.0", "edited": "False", "id": "hblgko6", "is_submitter": "False", "link_id": "t3_phwkse", "parent_id": "t3_phwkse", "score": "1", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "MusParvum", "body": "I've used Busuu (paid account, along with lots of Spanish YouTube watching) to go from A0 to around B1. I think it's great. I will say that so far Busuu's B2 unit seems a little... phoned in. But I loved their A1-B1 material. However, ultimately it comes down to whatever \\*you\\* find most enjoyable and helpful.", "created_utc": "1630610718.0", "edited": "False", "id": "hbcr5ir", "is_submitter": "False", "link_id": "t3_pgadwm", "parent_id": "t3_pgadwm", "score": "1", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "MusParvum", "body": "I've probably averaged 1-2 hours of inefficient study per day, and I'm around B1 after one year. But as others have pointed out, YMMV.", "created_utc": "1630184370.0", "edited": "False", "id": "haq6n7i", "is_submitter": "False", "link_id": "t3_pdcw5r", "parent_id": "t3_pdcw5r", "score": "5", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "MusParvum", "body": "I'll second this... the Superbeginner playlist on Dreaming Spanish is an excellent place to start. IMO it's also helpful to have at least a little bit of very basic vocabulary and grammar... just a few weeks on Duolingo or Busuu or whatever works best for you will at least give you a base so that your initial immersion isn't a 100% complete blur.", "created_utc": "1629821779.0", "edited": "False", "id": "ha6e086", "is_submitter": "False", "link_id": "t3_pac4k6", "parent_id": "t1_ha4e1k4", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "MusParvum", "body": "Great post, and thanks for all the tips! Regarding conjugation practice, is there anything else you did, or mainly just conjuegemos each day? Because I'm at the point where I feel like that's one of the biggest things holding back my speaking.\n\nAlso, it's cool to hear you using a Spanish accent! I'm totally torn by which way to go. Since I'm in the US, it makes more sense to focus on Mexican/Latin American Spanish, but the main people I talk to right now are actually Spanish (my iTalki tutor, who I think is awesome and super helpful, and a friend I met on HelloTalk). Plus I've been to Spain once and really want to return some day. So right now I'm kinda learning mostly Spain Spanish while resisting a full-on Spanish accent, which I admit, is probably kinda weird.", "created_utc": "1629420193.0", "edited": "False", "id": "h9lqzj6", "is_submitter": "False", "link_id": "t3_p7m3wb", "parent_id": "t3_p7m3wb", "score": "2", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "MusParvum", "body": "I believe it's because it's a direct object - \"lo\" and \"la\" are the third person singular direct object pronouns. If it were an indirect object, then it would be \"le\".", "created_utc": "1629345092.0", "edited": "False", "id": "h9hr0z6", "is_submitter": "False", "link_id": "t3_p76wts", "parent_id": "t3_p76wts", "score": "20", "subreddit": "learnspanish", "subreddit_id": "t5_2rd6d"}, {"author": "MusParvum", "body": "In my opinion it's better to start with something much simpler that's designed for beginners, like the superbeginner videos on the Dreaming Spanish You Tube channel. As you learn more and get more familiar with the language, you can move on to harder stuff, and eventually movies and series. But if you understand basically nothing, it's not going to do you much good to watch it.", "created_utc": "1628547882.0", "edited": "False", "id": "h8c9z5p", "is_submitter": "False", "link_id": "t3_p0yxay", "parent_id": "t3_p0yxay", "score": "10", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "MusParvum", "body": "Unless there's some reason why you need to learn Italian (your job, travel, whatever), it doesn't seem like there's any point to forcing it. If Spanish makes you the most happy, I would say choose happiness and stick with Spanish. You can always go back to learning Italian later in life if your motivation for it increases.", "created_utc": "1628547476.0", "edited": "False", "id": "h8c936g", "is_submitter": "False", "link_id": "t3_p1bkkj", "parent_id": "t3_p1bkkj", "score": "5", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "MusParvum", "body": "Congrats! It's a great feeling when something finally just clicks.", "created_utc": "1628369626.0", "edited": "False", "id": "h83hb84", "is_submitter": "False", "link_id": "t3_p0104j", "parent_id": "t3_p0104j", "score": "35", "subreddit": "learnspanish", "subreddit_id": "t5_2rd6d"}, {"author": "MusParvum", "body": "Yeah I tried No Hay Tos on the slower speed once and couldn't handle the distortion. It's definitely more of an intermediate level channel, even though I see it get recommended to beginners. But what I would suggest is to leave it for now and come back to it later. Several months ago I couldn't understand much of what they said, but I listened to a couple of episodes this week and understood much more than I had before.", "created_utc": "1628361754.0", "edited": "False", "id": "h8314dm", "is_submitter": "False", "link_id": "t3_ozxeyf", "parent_id": "t1_h830fpl", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "MusParvum", "body": "What's good for one person might not work for another. What's a glorified game for one person might keep up another person's motivation. You have to try a few and see what works for you.\n\nFor me personally, Busuu's Spanish course has been excellent. Other people hate it. Spend two weeks trying a bunch of different ones, then stick with whatever you like the best.", "created_utc": "1628361358.0", "edited": "False", "id": "h830afr", "is_submitter": "False", "link_id": "t3_ozynf8", "parent_id": "t3_ozynf8", "score": "9", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "MusParvum", "body": "Oh! I think Spanish Playground has more of a Mexican Spanish focus as well: [https://www.youtube.com/channel/UCv-dWUixyWPVcmXB250ULRQ](https://www.youtube.com/channel/UCv-dWUixyWPVcmXB250ULRQ)", "created_utc": "1628360191.0", "edited": "False", "id": "h82xsnz", "is_submitter": "False", "link_id": "t3_ozxeyf", "parent_id": "t1_h82x7iv", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "MusParvum", "body": "Uffff.... yeah, I don't really know of anything quite the same from Mexico. The closest I can think of might be:\n\nHow to Spanish Podcast: [https://www.youtube.com/channel/UCB48D9vFzR2OKW53uI4q5Aw/featured](https://www.youtube.com/channel/UCB48D9vFzR2OKW53uI4q5Aw/featured)\n\nNo Hay Tos: [https://www.youtube.com/channel/UCY08wLn8NUT8KEdFAV83JWw](https://www.youtube.com/channel/UCY08wLn8NUT8KEdFAV83JWw)", "created_utc": "1628359919.0", "edited": "False", "id": "h82x7iv", "is_submitter": "False", "link_id": "t3_ozxeyf", "parent_id": "t1_h82w3hg", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "MusParvum", "body": "Español con Juan: [https://www.youtube.com/channel/UCoHJ7PkM6T92LwgJgrnDhWA](https://www.youtube.com/channel/UCoHJ7PkM6T92LwgJgrnDhWA)\n\nSpanish After Hours: [https://www.youtube.com/channel/UCfG2VhlQgy5bHGmkpeKcjVA](https://www.youtube.com/channel/UCfG2VhlQgy5bHGmkpeKcjVA)\n\nBoth are excellent and use a similar approach.", "created_utc": "1628358323.0", "edited": "False", "id": "h82tq9p", "is_submitter": "False", "link_id": "t3_ozxeyf", "parent_id": "t3_ozxeyf", "score": "6", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "MusParvum", "body": "I was thinking the exact same thing. Dunno if it's correct or not, but it seems to match the way it's being explained.", "created_utc": "1628181873.0", "edited": "False", "id": "h7trsxv", "is_submitter": "False", "link_id": "t3_oyeb9v", "parent_id": "t1_h7t7bc5", "score": "2", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "MusParvum", "body": "I was told by a Spanish native that conseguir can be used with an infinitive, for example: ¿Conseguiste ver la pelicula? ...Did you get to watch the movie?\n\nI'd love to hear from another native if I understood this correctly. And if so, is the difference that using it with an infinitive works similar to English, but using it with an adjective doesn't work the same?", "created_utc": "1628181530.0", "edited": "False", "id": "h7tqytm", "is_submitter": "False", "link_id": "t3_oyfygw", "parent_id": "t1_h7spz9t", "score": "2", "subreddit": "learnspanish", "subreddit_id": "t5_2rd6d"}, {"author": "MusParvum", "body": "As an alternative to a textbook (or in addition to?) my suggestion would be to try a few online programs (Busuu, LingQ, Baselang, etc) and see which one \"clicks\" with you. Then pay for that one and follow its entire Spanish course.", "created_utc": "1628097011.0", "edited": "False", "id": "h7p6hp4", "is_submitter": "False", "link_id": "t3_oxl03q", "parent_id": "t3_oxl03q", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "MusParvum", "body": "I've used the paid version for Spanish and in general I think it's great. If you enjoyed it and felt like it was helping you make progress, I would suggest paying for the premium version. There are tons of resources out there, but it's important to find and use the ones that you click with, IMO.", "created_utc": "1627597222.0", "edited": "False", "id": "h70fq39", "is_submitter": "False", "link_id": "t3_ou3857", "parent_id": "t3_ou3857", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "MusParvum", "body": "Personally I've found a combination of Busuu and lots of comprehensible Spanish YouTube to be pretty effective at getting me to an intermediate level of reading, writing, listening (más o menos) and to a lesser degree, speaking.", "created_utc": "1627517907.0", "edited": "False", "id": "h6wb0o3", "is_submitter": "False", "link_id": "t3_otf2jd", "parent_id": "t3_otf2jd", "score": "2", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "MusParvum", "body": "I'll second Hello Talk. You'll go through a bunch of short conversations that go nowhere, but if you stick with it, you'll find at least a couple of interesting, helpful people to chat with. And you'll get very good at introducing yourself. ;)", "created_utc": "1627420068.0", "edited": "False", "id": "h6r3uv8", "is_submitter": "False", "link_id": "t3_osua9g", "parent_id": "t1_h6qy175", "score": "2", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "MusParvum", "body": "Maybe \"Chaco\" is the name of the guy who puts the beans on the plate?", "created_utc": "1625883412.0", "edited": "False", "id": "h4nrjsc", "is_submitter": "False", "link_id": "t3_oh5ecc", "parent_id": "t3_oh5ecc", "score": "3", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "MusParvum", "body": "Wow. I was somewhat familiar with the passive se, but the ethical dative and accidental se are new to me. Thanks for the explanation, and for the link (which I think I need to read a few more times)!", "created_utc": "1625696114.0", "edited": "False", "id": "h4en0ir", "is_submitter": "True", "link_id": "t3_oft2j5", "parent_id": "t1_h4elg0a", "score": "3", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "MusParvum", "body": "I love Busuu, but I do remember there being a couple times early on when I felt the need to repeat a lesson. Going through it a second time helped it to sink in better. So if you feel like a lesson was too tough, just repeat it (or even the last couple of lessons if they're related).", "created_utc": "1625610697.0", "edited": "False", "id": "h4aft1d", "is_submitter": "False", "link_id": "t3_of343p", "parent_id": "t3_of343p", "score": "3", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "MusParvum", "body": "I've heard native speakers say that Meg Entre Fronteras sounds very close to native: https://www.youtube.com/c/MEGrisolano", "created_utc": "1625610356.0", "edited": "False", "id": "h4af42d", "is_submitter": "False", "link_id": "t3_oerlv8", "parent_id": "t3_oerlv8", "score": "1", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "MusParvum", "body": "Look up a language exchange technique called \"crosstalk\". The basic idea is that you each speak in your native language, using drawings or gestures to aid comprehension. Over time you will start to pick up and understand words and phrases in the other person's language.", "created_utc": "1625369711.0", "edited": "False", "id": "h3zl2v2", "is_submitter": "False", "link_id": "t3_odaazq", "parent_id": "t3_odaazq", "score": "8", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "MusParvum", "body": "Yeah, I've used Duolingo too. It's fine, but personally I feel like the Busuu lessons are structured better, in a way that moves you along at a good pace and gives you a slighter deeper understanding and feel for how the language works. But the best one is probably whichever one you enjoy the most and will stick with over the medium to long term.", "created_utc": "1625266231.0", "edited": "False", "id": "h3v1arf", "is_submitter": "False", "link_id": "t3_ociq1v", "parent_id": "t1_h3v0o69", "score": "1", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "MusParvum", "body": "I'm just shy of B1 in Spanish on Busuu, and I feel like it's definitely been worth it. It's probably not sufficient by itself, but it seems to give you a pretty solid base.", "created_utc": "1625265712.0", "edited": "False", "id": "h3v09q5", "is_submitter": "False", "link_id": "t3_ociq1v", "parent_id": "t3_ociq1v", "score": "1", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "MusParvum", "body": "Ah! Ok. That sounds familiar actually....", "created_utc": "1624650428.0", "edited": "False", "id": "h314r93", "is_submitter": "False", "link_id": "t3_o7uaq5", "parent_id": "t1_h313unr", "score": "1", "subreddit": "learnspanish", "subreddit_id": "t5_2rd6d"}, {"author": "MusParvum", "body": "Why is the \"a\" there in these examples? Why would it not be simply \"Necesito mis gatos\" or \"Necesito los gatos\" (like in the first example in the screenshot - \"Necesito el libro...\")?", "created_utc": "1624649170.0", "edited": "False", "id": "h312226", "is_submitter": "False", "link_id": "t3_o7uaq5", "parent_id": "t1_h310etl", "score": "2", "subreddit": "learnspanish", "subreddit_id": "t5_2rd6d"}, {"author": "MusParvum", "body": "I truly apologize. I was trying to be silly, but didn't consider how it might make you feel, and that was wrong. Don't let thoughtless people (myself included!) demotivate you or stop you from doing what you're interested in. Your post shows that you are tuned in to what's going on around you, and that curiosity will take you far if you let it!", "created_utc": "1624501710.0", "edited": "False", "id": "h2ub5h5", "is_submitter": "False", "link_id": "t3_o6q7xo", "parent_id": "t1_h2uaaz5", "score": "11", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "MusParvum", "body": "It's ok, no need to apologize! And I'm sorry if I sounded harsh - I just thought it was kind of funny that a question never showed up. :)", "created_utc": "1624500580.0", "edited": "False", "id": "h2u908g", "is_submitter": "False", "link_id": "t3_o6q7xo", "parent_id": "t1_h2u8mbi", "score": "5", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "MusParvum", "body": "Dude?\n\nhttps://www.youtube.com/watch?v=77v\\_Q0mhbZU", "created_utc": "1623557605.0", "edited": "False", "id": "h1l6nez", "is_submitter": "False", "link_id": "t3_ny1voh", "parent_id": "t3_ny1voh", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "MusParvum", "body": "Dreaming Spanish has a handful of horror-related videos: https://www.dreamingspanish.com/?topic=horror", "created_utc": "1623161334.0", "edited": "False", "id": "h113f1i", "is_submitter": "False", "link_id": "t3_nuyux0", "parent_id": "t3_nuyux0", "score": "4", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "MusParvum", "body": ">just permute all the rules from the above five \"axioms\"\n\nI feel like this phrase is doing a lot of heavy lifting here... :)", "created_utc": "1623105562.0", "edited": "False", "id": "h0yr5fx", "is_submitter": "False", "link_id": "t3_nu9hsg", "parent_id": "t3_nu9hsg", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "MusParvum", "body": "It does, thank you!", "created_utc": "1622655108.0", "edited": "False", "id": "h0c5u76", "is_submitter": "False", "link_id": "t3_nqovnx", "parent_id": "t1_h0c2gnt", "score": "7", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "MusParvum", "body": "Great post, and congrats on your progress! A couple of questions:\n\n\\- On average, how much YouTube did you watch per day?\n\n\\- At what point were you able to stop using subtitles to assist your viewing/listening?", "created_utc": "1622651514.0", "edited": "False", "id": "h0bwne4", "is_submitter": "False", "link_id": "t3_nqovnx", "parent_id": "t3_nqovnx", "score": "15", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "MusParvum", "body": "I've been told (by a Spanish person) that teens and young adults in Spain say \"holi\".", "created_utc": "1622580992.0", "edited": "False", "id": "h08jgde", "is_submitter": "False", "link_id": "t3_nq0pd8", "parent_id": "t3_nq0pd8", "score": "4", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "MusParvum", "body": "Bliss is a noun, blissful is an adjective. So technically, it should probably be \"May every day remain blissful\" (and yeah, every day should probably be two words... \"everyday\" means \"something used or done daily or normally\", but \"every day\" means \"each day\").\n\nSo... it's understandable and not terrible, but probably not grammatically correct.", "created_utc": "1622079160.0", "edited": "False", "id": "gzl5oxz", "is_submitter": "False", "link_id": "t3_nlwf05", "parent_id": "t3_nlwf05", "score": "20", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "MusParvum", "body": "Incidentally, this first page was so cute I just went and ordered the book.", "created_utc": "1622059226.0", "edited": "False", "id": "gzjz83u", "is_submitter": "False", "link_id": "t3_nlkx49", "parent_id": "t1_gzj4nd4", "score": "3", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "MusParvum", "body": "The first three paragraphs aren't a conversation... they're the narrator telling the story to the reader. Then the fourth paragraph tells what the narrator asked older people, and tells how they responded. So that part is a conversation between the narrator and some older people.", "created_utc": "1622046517.0", "edited": "False", "id": "gzj4nd4", "is_submitter": "False", "link_id": "t3_nlkx49", "parent_id": "t3_nlkx49", "score": "7", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "MusParvum", "body": "The first three paragraphs aren't a conversation... they're the narrator telling the story to the reader. Then the fourth paragraph tells what the narrator asked older people, and tells how they responded. So that part is a conversation between the narrator and some older people.", "created_utc": "1622046246.0", "edited": "False", "id": "gzj3zq6", "is_submitter": "False", "link_id": "t3_nlkpdp", "parent_id": "t3_nlkpdp", "score": "1", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "MusParvum", "body": "Did you just write the endings for the basic regular -ar, -er, -ir, or did you write out conjugations charts for specific verbs in their entirety? If it was for specific verbs, which ones did you do - every verb you learned, or a selected subset of verbs? (I'm not the OP, but I'm also trying to improve my conjugation abilities, and your approach doesn't sound like a bad one to me!)", "created_utc": "1621992827.0", "edited": "False", "id": "gzgnxf7", "is_submitter": "False", "link_id": "t3_nl0ecf", "parent_id": "t1_gzfwuga", "score": "1", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "MusParvum", "body": "I agree with everything MissMags said about Busuu. I'm also using it for Spanish, and it's been a fun and engaging way to learn, and I feel like it's given me a pretty solid base so far (I'm right around B1).\n\n(Edited to add: I'm also using the premium version)", "created_utc": "1621902288.0", "edited": "False", "id": "gzc3ui9", "is_submitter": "False", "link_id": "t3_nkb68l", "parent_id": "t1_gzbz3ax", "score": "5", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "MusParvum", "body": "If you're willing to spend a small amount of money, take a look at iTalki or Preply... you should be able to find a native speaker there who could talk with you about a variety of topics.", "created_utc": "1621894934.0", "edited": "False", "id": "gzbpjsu", "is_submitter": "False", "link_id": "t3_nk9v0z", "parent_id": "t3_nk9v0z", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "MusParvum", "body": "Keep going and talking with new people, and eventually you'll click with a few of them. Ask them for recommendations of what to do and see if you ever visit their city/country. Ask them about hobbies. If they have countries they've travelled to listed in their profile, ask them what their favorite was and what they would recommend there.\n\nI just scrolled through my Hello Talk conversation list, and I have about 120 separate conversations in there. Fewer than 20 of them are probably decent conversations, and only around 10 of those were really interesting and engaging.", "created_utc": "1621893403.0", "edited": "False", "id": "gzbmf5j", "is_submitter": "False", "link_id": "t3_njqsoa", "parent_id": "t3_njqsoa", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "MusParvum", "body": ">Well, in this case the gender is different: la mañana is \"morning\", el mañana (or no gender when used as adverb), is \"tomorrow\".\n\nSomehow, I had never realized this... 🤯", "created_utc": "1621887406.0", "edited": "False", "id": "gzb9ihy", "is_submitter": "False", "link_id": "t3_nk3qi7", "parent_id": "t1_gzb6pnr", "score": "10", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "MusParvum", "body": ">Well, you won't be able to look things up on the test.\n\nGood point. :)", "created_utc": "1621817470.0", "edited": "False", "id": "gz81ebf", "is_submitter": "False", "link_id": "t3_njaqcf", "parent_id": "t1_gz74trt", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "MusParvum", "body": "I wonder if all the items on the list are intended to be completely unsupported? For example, if I can do all the items on the writing checklist, but need to look up a few words and verify a few conjugations using an online dictionary, am I really B1 in writing? If not, would I be considered B1 if I took a guess at those unknown words/conjugations and got them wrong, but my writing was still mostly understandable?", "created_utc": "1621793431.0", "edited": "False", "id": "gz6p9e8", "is_submitter": "False", "link_id": "t3_njaqcf", "parent_id": "t3_njaqcf", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "MusParvum", "body": ">Should I add in videos from the Dreaming in Spanish YouTube channel? (Work my way through all the videos in his super beginner playlist and see how far I can get?)\n\nAbsolutely! It's such a great resource. In fact, IMO, you might want to consider substituting Dreaming Spanish for the 1-2 hours of subtitled media you were planning on watching - at least at first.\n\nGood luck! This is very ambitious, and I'd love to hear how it goes!", "created_utc": "1621734268.0", "edited": "False", "id": "gz49fwo", "is_submitter": "False", "link_id": "t3_nix3zv", "parent_id": "t3_nix3zv", "score": "6", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "MusParvum", "body": ">Also, some verbs always take the indirect object like dar. So I always tell myself, if I use dar, I always have to use \"le\" or \"les\"\n\nOr \"me\" or \"te\", right? (Just want to make sure that \\*I\\* have it right.)", "created_utc": "1621641654.0", "edited": "False", "id": "gz045ye", "is_submitter": "False", "link_id": "t3_ni35bn", "parent_id": "t1_gyzxy0b", "score": "26", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "MusParvum", "body": "Instead of framing it as your father disrespecting the languages, maybe it would be worth pointing out to him that he's disrespecting \\*you\\*. This is an activity that is important to you and you want to succeed at it. He's mocking something that's meaningful to you. He's belittling your goals and your hopes. It's not about having a sense of humor - it's about the fact that a family should support each other, and right now he's not doing that. Maybe coming at it from that angle would encourage him to begin rethinking his behavior.", "created_utc": "1621611384.0", "edited": "False", "id": "gyyck2z", "is_submitter": "False", "link_id": "t3_nhu87h", "parent_id": "t3_nhu87h", "score": "256", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "MusParvum", "body": "I'll second Busuu... it's relatively interesting and engaging and I feel like it's given me a pretty good base to work from. I would recommend supplementing it with listening to a lot of beginner level Spanish YouTube videos (Dreaming Spanish super beginner and beginner playlists for example).", "created_utc": "1621367734.0", "edited": "False", "id": "gylyiuc", "is_submitter": "False", "link_id": "t3_nfik7c", "parent_id": "t1_gylp6qk", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "MusParvum", "body": "There's Tuti Furlán from Guatemala: [https://www.youtube.com/channel/UC5aHdUuSsRfRWER7c9WpqMA](https://www.youtube.com/channel/UC5aHdUuSsRfRWER7c9WpqMA)\n\n..and Santi Escobar from Mexico: [https://www.youtube.com/channel/UCAdfkRD-N8zG0zeivnMUYuw](https://www.youtube.com/channel/UCAdfkRD-N8zG0zeivnMUYuw)", "created_utc": "1621359818.0", "edited": "False", "id": "gyleyls", "is_submitter": "False", "link_id": "t3_nffdo3", "parent_id": "t3_nffdo3", "score": "2", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "MusParvum", "body": "There are many inexpensive Spanish tutors on iTalki or Preply who offer conversational Spanish classes... you basically just talk with them about whatever for a half hour or an hour. If I were in your situation, I'd sign up there and do a couple of those per week for a month or two, just to get some intensive practice.", "created_utc": "1621359608.0", "edited": "False", "id": "gyleg37", "is_submitter": "False", "link_id": "t3_nfg4ik", "parent_id": "t3_nfg4ik", "score": "35", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "MusParvum", "body": "I can relate to this - whenever I try to speak my target language off the cuff, I seem to forget conjugations, vocab, etc...it totally feels like going blank. How long did it take for you to feel like you were making some progress with this?", "created_utc": "1621304083.0", "edited": "False", "id": "gyisiac", "is_submitter": "False", "link_id": "t3_nel0ca", "parent_id": "t1_gygu2vt", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "MusParvum", "body": "I can't roll mine that well yet, but if I were in your situation, I would continue practicing with your head tilted back, but tilt it one degree farther forward every couple of days. Within a month, you should be rolling them with your head at a normal angle!", "created_utc": "1620787079.0", "edited": "False", "id": "gxt4qjb", "is_submitter": "False", "link_id": "t3_nadbvx", "parent_id": "t3_nadbvx", "score": "4", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "MusParvum", "body": "Thanks for the How To Spanish recommendation - that looks interesting!\n\nI'm definitely doing a ton of listening on YouTube, but I feel like real-time conversational listening practice might be important also. Of course I don't want to just sit there and listen to a tutor talk at me, but a back and forth exchange where I have to understand what's being said to me in order to respond seems valuable.\n\nRight now I feel like the speaking bottleneck is being able to put into practice everything I've learned, on the fly, without taking several minutes to think about things. When writing, that's no big deal. When speaking, it means I end up sitting there with a blank look on my face while I try to think of the appropriate word, and then see if I know the appropriate conjugation, all while getting stressed out that I'm taking too long or have talked myself into a conversational hole that I don't have enough knowledge to talk myself out of. :)", "created_utc": "1620759803.0", "edited": "False", "id": "gxrhozd", "is_submitter": "True", "link_id": "t3_n9m2vu", "parent_id": "t1_gxreac3", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "MusParvum", "body": "Good points, and I like your goals!", "created_utc": "1620759280.0", "edited": "False", "id": "gxrgels", "is_submitter": "True", "link_id": "t3_n9m2vu", "parent_id": "t1_gxqvrl8", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "MusParvum", "body": "Ooooh... those all sound like good suggestions. Thank you!", "created_utc": "1620759094.0", "edited": "False", "id": "gxrfxu1", "is_submitter": "True", "link_id": "t3_n9m2vu", "parent_id": "t1_gxp8hip", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "MusParvum", "body": "For the moment I've mostly looked at community tutors instead of professional ones. But that's a good suggestion to keep in mind. Thanks!", "created_utc": "1620759058.0", "edited": "False", "id": "gxrfuja", "is_submitter": "True", "link_id": "t3_n9m2vu", "parent_id": "t1_gxpsa7p", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "MusParvum", "body": "Thank you!", "created_utc": "1620759021.0", "edited": "False", "id": "gxrfr8o", "is_submitter": "True", "link_id": "t3_n9m2vu", "parent_id": "t1_gxoypqb", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "MusParvum", "body": "Thanks for the recommendations!", "created_utc": "1620758935.0", "edited": "False", "id": "gxrfjjr", "is_submitter": "True", "link_id": "t3_n9m2vu", "parent_id": "t1_gxowyqc", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "MusParvum", "body": "That's a good point. For me, I'd like it for traveling, but also for general conversation. I just like the idea of \"being able to speak another language\" and think it's a worthwhile goal. Some some degree of \"general conversational ability\" is important to me.", "created_utc": "1620758874.0", "edited": "False", "id": "gxrfe6b", "is_submitter": "True", "link_id": "t3_n9m2vu", "parent_id": "t1_gxopke1", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "MusParvum", "body": "These are good suggestions and great points to keep in mind. Thank you!", "created_utc": "1620758722.0", "edited": "False", "id": "gxrf0ps", "is_submitter": "True", "link_id": "t3_n9m2vu", "parent_id": "t1_gxoq0k9", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "MusParvum", "body": "I'm a native English speaker from the US, and I think this is great. I see two minor errors:\n\n\"People purchasing decisions\" should be \"People's purchasing decisions\".\n\n\"presented on the photographs\" should be \"presented in the photographs\".\n\nBut these are extremely minor errors, and overall this is on par with (or better than) the writing of many native English speakers. You're doing awesome, and anyone who tells you otherwise is probably trying to sell you something. :)", "created_utc": "1620606918.0", "edited": "False", "id": "gxk0qqk", "is_submitter": "False", "link_id": "t3_n8hrll", "parent_id": "t3_n8hrll", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "MusParvum", "body": "If it was wired wrong, is it possible for the wrong wiring to spontaneously resolve itself? Genuinely curious about this - I'm not above thinking we did something wrong, it just seems odd that the breaker would suddenly go back to working normally if we did something wrong. But, I don't know.", "created_utc": "1620599138.0", "edited": "False", "id": "gxjmp8d", "is_submitter": "True", "link_id": "t3_n8ogwr", "parent_id": "t1_gxjl1yy", "score": "5", "subreddit": "askanelectrician", "subreddit_id": "t5_2v2f4"}, {"author": "MusParvum", "body": "If there was a dead short, why would the breaker turn back on after a couple of tries? Did the dead short somehow un-short? Is that possible?", "created_utc": "1620598913.0", "edited": "False", "id": "gxjm9zv", "is_submitter": "True", "link_id": "t3_n8ogwr", "parent_id": "t1_gxjlvyh", "score": "1", "subreddit": "askanelectrician", "subreddit_id": "t5_2v2f4"}, {"author": "MusParvum", "body": "I've had some success using HelloTalk for Spanish, and have found plenty of friendly and helpful people to chat with. I have heard people say they have occasional problems with being hit on, but unfortunately there's probably going to be some of that on any free app. I don't know whether the problem would be better or worse than on Unbordered though.", "created_utc": "1620434005.0", "edited": "False", "id": "gxc5f7d", "is_submitter": "False", "link_id": "t3_n7csb1", "parent_id": "t3_n7csb1", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "MusParvum", "body": "Try the Dreaming Spanish YouTube channel: [https://www.youtube.com/channel/UCouyFdE9-Lrjo3M\\_2idKq1A](https://www.youtube.com/channel/UCouyFdE9-Lrjo3M_2idKq1A)\n\nStart with the SuperBeginner playlist... once you can reliably understand them, move on to the Beginner playlist, then Intermediate, etc... Don't use the subtitles. Good luck!", "created_utc": "1620093737.0", "edited": "False", "id": "gwux82h", "is_submitter": "False", "link_id": "t3_n3m0v0", "parent_id": "t3_n3m0v0", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "MusParvum", "body": "Spanish After Hours is a good one: [https://www.instagram.com/spanishafterhours/](https://www.instagram.com/spanishafterhours/)", "created_utc": "1619460756.0", "edited": "False", "id": "gvygz19", "is_submitter": "False", "link_id": "t3_mz2b3t", "parent_id": "t3_mz2b3t", "score": "2", "subreddit": "learnspanish", "subreddit_id": "t5_2rd6d"}, {"author": "MusParvum", "body": ">Nor pictionary\n\nYou're forgetting about the word \"bed\".", "created_utc": "1619134502.0", "edited": "False", "id": "gvi8b6i", "is_submitter": "False", "link_id": "t3_mw4oo3", "parent_id": "t1_gvgzurj", "score": "4", "subreddit": "tumblr", "subreddit_id": "t5_2r7hk"}, {"author": "MusParvum", "body": "I sometimes feel like I experience this, but then I think to myself: If I don't actually know most of the words they said, word-by-word, how do I know that I'm actually correct? Maybe I think I know what they're talking about, but I'm completely (or mostly) wrong.", "created_utc": "1618188486.0", "edited": "False", "id": "gu7d8p3", "is_submitter": "False", "link_id": "t3_mp05vz", "parent_id": "t3_mp05vz", "score": "10", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "MusParvum", "body": "I just gave this a try in Firefox on Mac OS X. Pretty awesome! Nice work, and thanks for sharing!", "created_utc": "1618068783.0", "edited": "False", "id": "gu1v4ow", "is_submitter": "False", "link_id": "t3_mo0j1l", "parent_id": "t3_mo0j1l", "score": "2", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "MusParvum", "body": ">They wanted \"somos\" for some reason\n\nI wonder if their thinking is that it's \"esta clase\" instead of \"esa clase\"? But even if that's the case, it still seems like a pretty thin justification for saying somos is the \"right\" answer.", "created_utc": "1617976633.0", "edited": "False", "id": "gtxizh1", "is_submitter": "False", "link_id": "t3_mn97nw", "parent_id": "t1_gtwsskk", "score": "3", "subreddit": "learnspanish", "subreddit_id": "t5_2rd6d"}, {"author": "MusParvum", "body": "Incorporarse: [https://www.spanishdict.com/translate/incorporarse](https://www.spanishdict.com/translate/incorporarse) ...seems right?", "created_utc": "1617840319.0", "edited": "False", "id": "gtr1r3p", "is_submitter": "False", "link_id": "t3_mmezni", "parent_id": "t3_mmezni", "score": "1", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "MusParvum", "body": "I have the same problem with the literal translation thing, but I feel like I'm getting slightly better about it. One thing that seems to help me is that when I come across a sentence in Spanish that has a more \"non-English\" sort of structure, I try to literally translate that structure to English to get a better feel for how Spanish sentences are put together. It helps me think of how I need to put my thoughts together to make them work better in Spanish. Or at least I feel like that's what's going on.\n\nAs for the \"hearing separate words when listening\" thing... most people seem to say that the best way to get better is to listen to \\*a lot\\* of spoken Spanish, and eventually it'll click.", "created_utc": "1617748910.0", "edited": "False", "id": "gtmhdtt", "is_submitter": "False", "link_id": "t3_mljxdc", "parent_id": "t3_mljxdc", "score": "6", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "MusParvum", "body": "In English it would probably be better said as \"I showed you to them\" (but in this case it would be even more clear to say \"I showed a picture of you to them\" or \"I showed them a picture of you\".\n\nMy understanding of the grammar is that you don't have two indirect objects here... \"you\" (or more precisely, the picture of \"you\") is a direct object.", "created_utc": "1617550556.0", "edited": "False", "id": "gtct7ev", "is_submitter": "False", "link_id": "t3_mjy661", "parent_id": "t3_mjy661", "score": "5", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "MusParvum", "body": "I think it's the negative imperative here, right?", "created_utc": "1617546636.0", "edited": "False", "id": "gtclw3d", "is_submitter": "False", "link_id": "t3_mjwr3d", "parent_id": "t1_gtck5po", "score": "6", "subreddit": "learnspanish", "subreddit_id": "t5_2rd6d"}, {"author": "MusParvum", "body": ">What is also unique about it that literally no other language app/website has is it wants you to talk about you personally\n\nThat's a great point! It totally makes many of the exercises feel more relevant and useful.", "created_utc": "1617457707.0", "edited": "False", "id": "gt8tnbx", "is_submitter": "False", "link_id": "t3_miz5z8", "parent_id": "t1_gt852i3", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "MusParvum", "body": "I had a similar problem when I started with Spanish in the fall - there are so many ways to go about it, that it was hard to decide where to begin. I think part of it comes down to what sort of learner you are. For me, I know that I benefit from some structure. So my approach was to try out a few different online sites/courses (Busuu, Duolingo, Linq, etc) for a week or two, and then just pick the one that seemed the most useful/interesting to me and run with it. Once I had a bit of a base from the structured course, I started adding in some immersion in the form of Spanish-language YouTube videos.\n\nI think the important thing is to just pick \\*something\\* and go with it. You can always switch later if it's not working. Remember that the goal is to learn Spanish, not to learn about how to learn Spanish. :)", "created_utc": "1617421583.0", "edited": "False", "id": "gt7o294", "is_submitter": "False", "link_id": "t3_mj0kz5", "parent_id": "t3_mj0kz5", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "MusParvum", "body": "I've been using Busuu to learn Spanish, and I think it's been pretty helpful. I feel like it's way more thorough and useful than Duolingo, and the interaction with native speakers is a great feature.\n\nI started from 0 in the fall and a month or so ago I reached halfway between A2 and B1, according to Busuu's progress indicator. I did stall out a bit at that point - I feel like the individual lessons are a little longer on average at this level, and it's a little harder to sit down for the required chunk of time, plus I've shifted my balance a little more towards watching Spanish YouTube content and chatting on HelloTalk. But I feel like Busuu was a big part of the progress I've made so far.", "created_utc": "1617420045.0", "edited": "False", "id": "gt7lmz9", "is_submitter": "False", "link_id": "t3_miz5z8", "parent_id": "t3_miz5z8", "score": "5", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "MusParvum", "body": "Would \"rollo\" be appropriate here? Something like \"Siempre es un rollo esta conversación\"?", "created_utc": "1617375152.0", "edited": "False", "id": "gt59de8", "is_submitter": "False", "link_id": "t3_mijdxb", "parent_id": "t3_mijdxb", "score": "10", "subreddit": "learnspanish", "subreddit_id": "t5_2rd6d"}, {"author": "MusParvum", "body": "Dreaming Spanish on YouTube has playlists grouped by level, starting all the way from \"Super Beginner\": [https://www.youtube.com/channel/UCouyFdE9-Lrjo3M\\_2idKq1A](https://www.youtube.com/channel/UCouyFdE9-Lrjo3M_2idKq1A)", "created_utc": "1617044832.0", "edited": "False", "id": "gspvuzv", "is_submitter": "False", "link_id": "t3_mfpkrj", "parent_id": "t3_mfpkrj", "score": "3", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "MusParvum", "body": "I am by no means an expert, so take this with a huge grain of salt. But even though many people will say that intensive and extensive listening is really helpful (and I agree with that!), I wonder if in this case it would be more useful to cram in as much vocabulary as you can. Because the trip itself is going to give you all that useful listening practice/experience. So by learning as much vocab as you can ahead of time, you might increase your chances of picking out words and meaning from all the speaking going on around you. (Edited to add: and also, congrats on the upcoming trip - that's really awesome!)", "created_utc": "1616946864.0", "edited": "False", "id": "gsl7nxh", "is_submitter": "False", "link_id": "t3_mf2k8l", "parent_id": "t3_mf2k8l", "score": "1", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "MusParvum", "body": "This might be of interest to you: [https://www.youtube.com/watch?v=khCa44mYsKY](https://www.youtube.com/watch?v=khCa44mYsKY)\n\nThe channel itself isn't what you're looking for, but the topic for this particular video might be, and I found it interesting and well done.", "created_utc": "1616945452.0", "edited": "False", "id": "gsl4pid", "is_submitter": "False", "link_id": "t3_mf1lg3", "parent_id": "t3_mf1lg3", "score": "1", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "MusParvum", "body": "My understanding of the second example is that the part about the party (\"La fiesta era divertida\") is background info for the story being told. The party is ongoing/in-progress \\*when it is interrupted\\* by another action (ending earlier than expected), therefore, it uses the imperfect.", "created_utc": "1616768575.0", "edited": "False", "id": "gsalwgs", "is_submitter": "False", "link_id": "t3_mdicaw", "parent_id": "t1_gsaiiha", "score": "6", "subreddit": "learnspanish", "subreddit_id": "t5_2rd6d"}, {"author": "MusParvum", "body": "\\-8 and dropping... Ouch. I thought that was an interesting aspect of the two languages, that there was a phrase that meant almost literally what the OP was asking that nonetheless wasn't used that way. Guess it wasn't as interesting as I thought... 😬", "created_utc": "1615174718.0", "edited": "False", "id": "gq69zhs", "is_submitter": "False", "link_id": "t3_m02b22", "parent_id": "t1_gq5j8nl", "score": "4", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "MusParvum", "body": "Yes, that's my point - it literally means \"I feel it\" but I've only ever heard of it being used in the context of apologizing. :)", "created_utc": "1615161620.0", "edited": "False", "id": "gq5mh2c", "is_submitter": "False", "link_id": "t3_m02b22", "parent_id": "t1_gq5kxz0", "score": "4", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "MusParvum", "body": "\"Lo siento\" kind of literally means this I think. But I don't know if it's ever used that way.", "created_utc": "1615159869.0", "edited": "False", "id": "gq5j8nl", "is_submitter": "False", "link_id": "t3_m02b22", "parent_id": "t3_m02b22", "score": "-7", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "MusParvum", "body": "I'm a beginner - around A2 somewhere maybe - and I started using it about two weeks ago. I feel like it's been helpful simply by giving me lots of practice with writing in Spanish. Many of the corrections I've gotten from people are still sinking in, to be sure, and I'm still looking up tons of words and phrases. But I feel like my whole writing process is getting a little smoother, and my Spanish writing sounds less like a madman pulling words out of a hat. At least, I hope that's the case.\n\nI've only used the audio messages a few times, but even those few times has helped me not to 100% seize up when trying to speak. I'm only like 89% seized up now.", "created_utc": "1615159263.0", "edited": "False", "id": "gq5i4bg", "is_submitter": "False", "link_id": "t3_m00qq8", "parent_id": "t3_m00qq8", "score": "4", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "MusParvum", "body": "Los cocos pones encima de un pescado a veces.\n\nIt may not be slang, but it should be.\n\n(Incidentally, I feel like I wrote this wrong, but I don't know how to fix it. How do you distinguish between \"The coconuts you put on a fish sometimes\" and \"You put the coconuts on a fish sometimes\"?)", "created_utc": "1615157291.0", "edited": "1615158465.0", "id": "gq5eey5", "is_submitter": "False", "link_id": "t3_lzuoxe", "parent_id": "t1_gq56nwg", "score": "1", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "MusParvum", "body": "You might want to take a look at Busuu. They have an app and a website, and their Spanish course goes all the way up to B2. It’s a nice combination of reading and audio, with true/false, multiple choice, and fill in the blank exercises, along with writing prompts that get critiqued by native speakers who are learning other languages on the site. It is paid, but some of the content and lessons are available with a free account.", "created_utc": "1614536494.0", "edited": "False", "id": "gp7ab1j", "is_submitter": "False", "link_id": "t3_luf773", "parent_id": "t3_luf773", "score": "1", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "MusParvum", "body": "Thanks! Yeah, maybe it was more about the context around it, or just assumptions that some of the people were making about what I meant to say. Spanish would be so much easier if everyone already knew what I meant! :)", "created_utc": "1613831484.0", "edited": "False", "id": "go4ecce", "is_submitter": "True", "link_id": "t3_lnslty", "parent_id": "t1_go3k6h8", "score": "1", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "MusParvum", "body": "And now to preserve family harmony, OP must find a way to never write \"voy a ir a...\" ever again. :)", "created_utc": "1613794986.0", "edited": "False", "id": "go35gd9", "is_submitter": "False", "link_id": "t3_ln48qr", "parent_id": "t3_ln48qr", "score": "1", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "MusParvum", "body": "I think you're talking about \"encantado/a\" instead of \"enchantado/a\".\n\nIf so, my understanding is that you always match \\*your\\* gender. So no matter who you're meeting, you would say \"Encantada\". The reason is that you're telling them that \\*you\\* are enchanted to meet them.", "created_utc": "1613794261.0", "edited": "False", "id": "go3477w", "is_submitter": "False", "link_id": "t3_lnxnkr", "parent_id": "t3_lnxnkr", "score": "5", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "MusParvum", "body": "Yes! As I was writing it, I was trying very hard to avoid just doing a word-for-word translation - I know those often end up sounding wrong. But I kinda got the feeling that what I ended up with probably still wasn't going to sound \"natural\". :)", "created_utc": "1613790445.0", "edited": "False", "id": "go2x90d", "is_submitter": "True", "link_id": "t3_lnslty", "parent_id": "t1_go2w78e", "score": "1", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "MusParvum", "body": "Thanks! Yes, there was one person on the site who seemed to get my meaning, and she suggested that exact same correction. \"Sea\" would be the subjunctive, right? That might be part of my problem, is that I don't have much experience with the subjunctive yet, so I don't take advantage of it when I should. Something for me to improve upon!", "created_utc": "1613790163.0", "edited": "False", "id": "go2wqcs", "is_submitter": "True", "link_id": "t3_lnslty", "parent_id": "t1_go2np5l", "score": "2", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "MusParvum", "body": "Thank you! At least one person on the original site seemed to get my meaning, so maybe it wasn't too far off.", "created_utc": "1613789995.0", "edited": "False", "id": "go2wf0j", "is_submitter": "True", "link_id": "t3_lnslty", "parent_id": "t1_go2dsib", "score": "2", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "MusParvum", "body": "I'm not sure which videos you're watching, but maybe try something really basic, like the Superbeginner playlist on the Dreaming Spanish YouTube channel. The vocab is more basic, so there may not be as many words you feel like you need to look up.\n\nAs for stressing about forgetting words you've looked up - I find that if a word is important, I'll come across it again in the future. I often do forget what it meant, and just look it up again. After that happens a couple of times, it usually sinks in. So for me, I just accept that I will forget, but I'll learn it eventually through repeated exposure/lookup cycles. (I also won't usually bother even looking up a word unless I hear it repeated two or three times in the same video - that's how I avoid getting overwhelmed with 30 new words at a time :) )", "created_utc": "1613591174.0", "edited": "False", "id": "gnstg9z", "is_submitter": "False", "link_id": "t3_lm2eak", "parent_id": "t3_lm2eak", "score": "5", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "MusParvum", "body": "I hadn't come across Luisto Comunica yet - looks like a fun channel! Congrats on your progress!", "created_utc": "1613534217.0", "edited": "False", "id": "gnq7igq", "is_submitter": "False", "link_id": "t3_llkut5", "parent_id": "t3_llkut5", "score": "3", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "MusParvum", "body": "Pretty sure the answer is \"neither\". :) \"Hace unos años\" would mean \"several years ago\", but \"vivo\" is present tense - so you're kinda mixing the tenses.\n\nI think you want either:\n\nViví en Colombia hace unos años. - \"I lived in Colombia several years ago\"\n\nor\n\nVivo en Colombia desde hace unos años. \"I've lived in Colombia for several years\"\n\nNote: I'm a beginner, so take this with a grain of sal until someone more experienced chimes in. :)", "created_utc": "1613509567.0", "edited": "False", "id": "gnou9dr", "is_submitter": "False", "link_id": "t3_lldb1o", "parent_id": "t3_lldb1o", "score": "1", "subreddit": "learnspanish", "subreddit_id": "t5_2rd6d"}, {"author": "MusParvum", "body": "I've heard that the idiom \"Dar la vuelta a la tortilla\" can be used that way. Not sure what regions it's used in though.", "created_utc": "1613505345.0", "edited": "False", "id": "gnokr1l", "is_submitter": "False", "link_id": "t3_ll1szp", "parent_id": "t3_ll1szp", "score": "1", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "MusParvum", "body": "Spanish After Hours did an Among Us video: [https://www.youtube.com/watch?v=cyA3R1WvGcE](https://www.youtube.com/watch?v=cyA3R1WvGcE) ...I'm not sure if it'll directly answer number 3, but it's fun to watch, anyway. :)", "created_utc": "1613503978.0", "edited": "False", "id": "gnohotl", "is_submitter": "False", "link_id": "t3_ll3xg5", "parent_id": "t3_ll3xg5", "score": "2", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "MusParvum", "body": "jajaja... ¿Cómo se usa? \"Devolver\" solo, o como un parte de una frase... por ejemplo \"devolví mi almuerzo\"?", "created_utc": "1613502118.0", "edited": "False", "id": "gnodmcd", "is_submitter": "False", "link_id": "t3_lkwa77", "parent_id": "t1_gnmrwkg", "score": "2", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "MusParvum", "body": "Here's a Spanish-specific one: [https://www.reddit.com/r/WriteStreakES/](https://www.reddit.com/r/WriteStreakES/)", "created_utc": "1612544814.0", "edited": "False", "id": "gm4vjl3", "is_submitter": "False", "link_id": "t3_ld14g1", "parent_id": "t3_ld14g1", "score": "4", "subreddit": "learnspanish", "subreddit_id": "t5_2rd6d"}, {"author": "MusParvum", "body": "She's one of my favorites! Very clever and funny, with some very creative ideas for videos. She's on Instagram, also.", "created_utc": "1612498143.0", "edited": "False", "id": "gm2tynw", "is_submitter": "False", "link_id": "t3_lctfce", "parent_id": "t3_lctfce", "score": "2", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "MusParvum", "body": "I just tried saying the two phrases repeatedly, and I feel like there's a difference, but it's super subtle. I feel like \"bottled water\" comes out more like \"bottle dwater\"... so the difference (for me) feels like it's more at the beginning of \"water\" than at the end of \"bottle(d)\".", "created_utc": "1611944568.0", "edited": "False", "id": "gl9oxpg", "is_submitter": "False", "link_id": "t3_l7s1cz", "parent_id": "t1_gl8gmiy", "score": "11", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "MusParvum", "body": "Except I think the idea is that in the second two examples they're not going to work (van a trabajar), they're already at work. The pictures show the difference - in the first two, the people are commuting, in the second two, they're already there.", "created_utc": "1611873945.0", "edited": "False", "id": "gl5py3x", "is_submitter": "False", "link_id": "t3_l6lpze", "parent_id": "t1_gl49e5a", "score": "2", "subreddit": "learnspanish", "subreddit_id": "t5_2rd6d"}, {"author": "MusParvum", "body": "That is helpful, and seems to fit the different uses everyone has mentioned.", "created_utc": "1607909236.0", "edited": "False", "id": "gfrkrzz", "is_submitter": "True", "link_id": "t3_kccdd8", "parent_id": "t1_gfqtt6z", "score": "1", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "MusParvum", "body": "Thanks for the explanation - that's good to know! I'm still a beginner, and trying to teach myself with a variety of sources, so it might be my own fault I haven't learned that distinction yet.", "created_utc": "1607140928.0", "edited": "False", "id": "geo2ysq", "is_submitter": "False", "link_id": "t3_k6qys6", "parent_id": "t1_genrgf0", "score": "2", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "MusParvum", "body": "This is something I've been having trouble understanding (not just in this example, but in other sentences I've seen). I thought reflexive verbs were when the action is performed on ones own self. So why \"se llevó\" in this case - doesn't that make it sound like the thief is carrying himself away, instead of the wallet?", "created_utc": "1607133061.0", "edited": "False", "id": "genqf5w", "is_submitter": "False", "link_id": "t3_k6qys6", "parent_id": "t1_gemu3bk", "score": "2", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "MusParvum", "body": "I'd be interested in checking it out, though I'm definitely on the beginner end of the spectrum, so I don't know how useful I'd be.", "created_utc": "1606436893.0", "edited": "False", "id": "gdpvkmb", "is_submitter": "False", "link_id": "t3_k18qoz", "parent_id": "t3_k18qoz", "score": "2", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "MusParvum", "body": "No te preocupes, tu inglés es muy bueno!", "created_utc": "1606415238.0", "edited": "False", "id": "gdoq7aj", "is_submitter": "False", "link_id": "t3_k1ikxn", "parent_id": "t1_gdoiumd", "score": "13", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "MusParvum", "body": "Children's books seem like a good idea. I follow a few Twitter accounts that post in Spanish so I'm getting regular reading input, but something like children's books might give me some simpler sentence structure to work my way up from. Thanks!", "created_utc": "1606407590.0", "edited": "False", "id": "gdoap1m", "is_submitter": "True", "link_id": "t3_k0z2ms", "parent_id": "t1_gdo50g6", "score": "1", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "MusParvum", "body": "Thanks, that's good to hear. I'll keep listening to whatever I can find, and I'll try not to rush it or stress over it.", "created_utc": "1606366094.0", "edited": "False", "id": "gdmn1y2", "is_submitter": "True", "link_id": "t3_k0z2ms", "parent_id": "t1_gdlekhy", "score": "1", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "MusParvum", "body": "Easy Spanish on YouTube has many segments that use an interview format, where they ask a bunch of random people what they think about various topics. So it seems like a good way to hear everyday people speaking casually about lots of things. I think it's more Spain-focused, but I believe they do have some segments from other countries.", "created_utc": "1606332183.0", "edited": "False", "id": "gdkzt1i", "is_submitter": "False", "link_id": "t3_k0w165", "parent_id": "t3_k0w165", "score": "1", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "MusParvum", "body": "Yes! Dreaming Spanish is excellent - it's one of my favorite ways to study because it doesn't even feel like studying. Another thing I've found helpful is to follow a handful of Spanish-language Twitter accounts... not accounts that are geared towards teaching/learning Spanish, but accounts that post about interesting topics that also happen to be in Spanish. Muy Interesante and Álex Riveiro are two that I follow.", "created_utc": "1606191188.0", "edited": "False", "id": "gdeoltt", "is_submitter": "False", "link_id": "t3_jzfnnl", "parent_id": "t1_gdbmtek", "score": "3", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "MusParvum", "body": "Seems like giving it a try might be a great way to make a connection with them. Just let them know you're rusty, and I'm sure they'll appreciate the effort.", "created_utc": "1606189679.0", "edited": "False", "id": "gdem0xq", "is_submitter": "False", "link_id": "t3_jzqq1q", "parent_id": "t3_jzqq1q", "score": "1", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}]