[{"author": "NaJaEgal", "body": "By that logic \"advanced plateau\" should be even more flat. But I don't see people talking about the \"dreaded advanced plateau\", its always intermediate.", "created_utc": "1664151473.0", "edited": "False", "id": "ipwrpjp", "is_submitter": "False", "link_id": "t3_xnupx1", "parent_id": "t1_ipwq2i8", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "NaJaEgal", "body": ">It doesn't happen to every learner, but it happens to many, especially if they're *first-time learners* and thus don't have the *perspective* of having gone through the entire cycle once before.\n\nThat's what I needed to hear, thanks.", "created_utc": "1664147360.0", "edited": "False", "id": "ipwiytn", "is_submitter": "False", "link_id": "t3_xnupx1", "parent_id": "t1_ipwex5h", "score": "7", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "NaJaEgal", "body": "So it's \"Learning a language takes more time than I expected, and I just realised that\" then.\n\nIt took me 10 years at school + 2 years of intensive self-study with a textbook + 3-5 years of reading classic books in English to get to a point where I thought: \"It's okay if I stop challenging myself and just maintain my English skills from now on, but I know what to do if I need to improve further\".\n\nSo, if anything, it felt miraculously fast to be able to listen to university lectures on German Civil Code and read Goethe after only five years of learning German.\n\nBut then I read posts like: \"I've been learning language X for 6 months now, I think I'm plateauing, help\". I don't even.", "created_utc": "1664146667.0", "edited": "False", "id": "ipwheor", "is_submitter": "False", "link_id": "t3_xnupx1", "parent_id": "t1_ipw9ja3", "score": "6", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "NaJaEgal", "body": "Can anybody explain me what intermediate plateau is? Is it really a thing, or just a buzzword for either 1) \"I leveled up and need to change the methods I'm using\" or 2) \"Learning a language takes more time than I expected, and I just realised that\"?\n\nIt's an honest question, because when I first joined this sub and read about \"intermediate plateau\", I thought to myself: \"hm, interesting concept, let's see how it works out with the first language I learn independently all the way through\". I braced myself for this boring neverending slog of\n\n>the dreaded Intermediate Plateau\n\nbut'm still waiting for it to happen, working my way up to C1.\n\nEdit:\n\nOkay, after reading all the answers (and other comments in this thread) I came to a conclusion that:\n\n1. \"Intermediate plateau\" means roughly: \"I felt a lot of progress with my beginner resources, but I don't know what to do next\". If you have experience studying something independently (not necessarily a language), you *do* know what to do next and you'll likely not run out of interesting and challenging things to do. It might take \"a long fucking time\", but never feels like a \"plateau\". So it's more of a learning methodology thing, than objective unavoidable endless mire of dread every learner is bound to trudge through at an intermediate level (sorry, that's the impression I got from this sub a few years ago, and I was waiting for it to happen with horror).\n2. People talk specifically about \"*intermediate* plateau\", because similar beginner problems usually sound like \"I don't know where to start\" instead. And relatively few people who get to advanced levels have probably made peace with the fact that learning  a language takes a lot of time and figured out what works for them by that time. Hence no \"*advanced plateau*\", although it takes even longer and the progress is even less perceptible.\n3. Textbooks (in this context intermediate and advanced textbooks) are severely underrated. Textbooks team, go!\n\nThanks everyone, your answers have clarified the matter to me, more or less.\n\nEdit 2:\n\nIt just occurred to me that it might be a matter of framing as well: if you concentrate on the things you *can do*, then going from understanding 99% to understanding 99.5% of any given text might feel like a negligible improvement and be demotivating. It doesn't *feel* that much different subjectively.\n\nIf you concentrate on your *goal* instead, and on the things that you still *can't do*, you just keep going like, for example: \"I want to be able to read YA books, understanding 99.9% of it. Can I do that? No? Working towards that goal.\" You just keep expanding your vocabulary until it's 1 lookup/5 pages, and it takes as long as it takes. If you learn 5 (10, 20, 30...) words a day every day you'll inevitably be there eventually.\n\nSo, I guess, first time learners lack that trust in the process of learning. That's where that feeling comes from.", "created_utc": "1664141543.0", "edited": "1664158523.0", "id": "ipw5n6y", "is_submitter": "False", "link_id": "t3_xnupx1", "parent_id": "t3_xnupx1", "score": "16", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "NaJaEgal", "body": "\"Die Chroniken von Amber\" von Roger Zelazny\n\nEs ist mir ein Rätsel, warum Zelazny heutzutage in \"best of\" Fantasy-Listen fast nie auftaucht. Als ich noch in der Schule war (vor ungefähr 20 Jahren), haben ihn alle Bücherwürmer aus meinem Bekanntenkreis gekannt und geliebt. Tja, ist wohl aus der Mode gekommen.", "created_utc": "1663965912.0", "edited": "False", "id": "ipn123u", "is_submitter": "False", "link_id": "t3_xm3gkq", "parent_id": "t3_xm3gkq", "score": "2", "subreddit": "buecher", "subreddit_id": "t5_2sroz"}, {"author": "NaJaEgal", "body": "Ich bin keine Muttersprachlerin, daher könnte ich was falsch verstanden haben, aber als ich versucht habe dieses Buch zu lesen, bin ich relativ früh auf  \"Es brennt alsdann in mir <...>  eine rasende Lust <...> ein kleines Mädchen zu verführen\" gestolpert. \n\nDieser Satz hat mein schwer zu erklärendes mulmiges Gefühl, das ich bisher von diesem Buch  gehabt hatte, gekrönt, mir wurde übel und ich habe aufgehört zu lesen.\n\nIch hätte dem Author (und dem Charakter) einen Vertrauensbonus geben können, hätte ich ihn inzwischen nicht völlig für Böll ausgegeben.", "created_utc": "1663035099.0", "edited": "False", "id": "io7e6cl", "is_submitter": "False", "link_id": "t3_xcng2g", "parent_id": "t3_xcng2g", "score": "5", "subreddit": "buecher", "subreddit_id": "t5_2sroz"}, {"author": "NaJaEgal", "body": "I started reading German translation of Game of Thrones pretty early on (B1-ish?). Once you learn to passively recognise, like, 15 different words used to denote a horse and a few other things like keep, embrasure and joust, it's pretty tame.", "created_utc": "1659578400.0", "edited": "False", "id": "iiv2cut", "is_submitter": "False", "link_id": "t3_wf466j", "parent_id": "t1_iis9hzg", "score": "4", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "NaJaEgal", "body": "[Internet Archive](https://archive.org/details/booksbylanguage_german)", "created_utc": "1659404847.0", "edited": "False", "id": "iil7cm4", "is_submitter": "False", "link_id": "t3_wdwfm2", "parent_id": "t3_wdwfm2", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "NaJaEgal", "body": "I'm not a polyglot, but I guess I can share my experiences with reading books in foreign languages.\n\n>Do you have a preference?\n\nI use both alternatively for different kinds of content: extensive reading for books that are at or slightly above my level, intensive reading for books that are significantly above my level.\n\n>Why?\n\nExtensive reading 1) helps me incorporate and reinforce the knowledge I already have 2) is the only way I can read tens of thousands of pages in my TL 3) feels really relaxing after having read something challenging intensively.\n\nIntensive reading 1) allows me to read higher level content 2) is my main source of vocabulary 3) helps me concentrate and make sure I really understood the text I'm reading, because tolerance for ambiguity needed to read extensively is a double-edged sword.\n\n>For extensive reading, how do you build vocabulary and comprehension?\n\nI figure out a lot of words from the context. I look up some of the words in a dictionary if I stumble upon them and they prevent my comprehension. The general advice is to read a couple of books (or a series) of the same author in a row, so that the words are being repeated naturally.\n\n>For intensive reading, how do you enjoy it?\n\nSometimes I don't. Seriously, though, in pre-internet era, as I learned English, I just had to make do with what I had. The very first book I read in English was \"Alices Adventures in Wonderland & Through the Looking Glass\" (first extensively, then intensively), and I enjoyed every second of it. The second one was \"A Man of the Property\", a book that a friend of a friend of my mom borrowed from a library, and it was the most tedious and boring experience ever, barring \"Bleak House\", perhaps. But I didn't have much of a choice if I wanted to learn English, so I powered through it.\n\nNow that I can allow myself to be picky and spoiled, I choose books that I'm eager to read, but are too difficult to read them extensively yet, for my intensive reading. If a book turns out to be shit, I drop it and pick something else.\n\n>How do you maintain concentration looking so much up in a dictionary or making annotations?\n\nIt's easier for me to maintain concentration while reading intensively, tbh, because I just *have* to concentrate in order to make sense of the text in front of me. And I usually read until I have written down my daily norm — around 20-25 new words — then I just stop and call it a day. I know that extensive reading covers my back in terms of the amount of books read.\n\nAfter more than ten thousand pages of German books read (≈500-600 of them intensively), my current reading comprehension level is as follows: I'm reading a book by Wolfgang Hohlbein (German equivalent of Stephen King) comfortably, it doesn't feel like work at all, and if I choose to write down unknown words, it's about 0,3-0,5 words/page.", "created_utc": "1656667611.0", "edited": "False", "id": "iefjzit", "is_submitter": "False", "link_id": "t3_voqd2z", "parent_id": "t3_voqd2z", "score": "15", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "NaJaEgal", "body": "I did 20-25 new words/day. Every session including reviews (strict typing) took me about an hour ±20min. It was a very reasonable pace: with that amount I felt constant progress, and anything more than 25 new words/day made my head feel like it's cracking at the seams.\n\nI don't know what \"suggested session\" means, but I haven't used Memrise for a year now and I finished official courses three years ago , maybe they had a couple of updates since then.", "created_utc": "1656297416.0", "edited": "False", "id": "idvsvv7", "is_submitter": "False", "link_id": "t3_vlc9er", "parent_id": "t3_vlc9er", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "NaJaEgal", "body": "Finally! Someone with a problem similar to mine. I even considered writing a post on r/books some time ago, but after reading a few posts there I realized that I'd be downvoted to hell if I did.\n\nYes, I was an avid reader as a kid (and quite omnivorous one at that), and yes, as soon as I grew up the passion has vanished. And no, it has nothing to do with my attention span, as I'm perfectly capable of spending 8+ hours in a row with a textbook. It's just that fiction has become incredibly boring to me and I feel like I've read that all a thousand times before. In my case it does also include most of the movies and series, though.\n\nAt first, it was at least *somewhat* interesting to read books in English, because my brain was busy decoding the language. As soon as it started to become effortless, i.e. when I just started scraping C1, it became as boring as reading books in Russian. Because I mostly don't care about the plot, don't care about the characters, the author is either a moron or a fool and doesn't know what he's writing about, and the book is full of clichés. Yeah, I know how it sounds, I just needed to finally vent.\n\nI don't have a ready solution for you, as I'm still struggling with it myself. But some things that did work for me were:\n\n1. Reading non-fiction. \"The Structure of Scientific Revolutions\" by Thomas Kuhn, \"A Way With Words\" by Michael Drout, \"Life on the Mississippi\" by Mark Twain or \"Porcelain: A Memoir\" by Moby were among the books that I virtually swallowed. Pros: The authors usually know what they're talking about. Cons: 1. It's a hit or miss, I could only endure 3 pages of Benjamin Franklin's autobiography, for example — such a pompous prick. 2. Some books are genuinely hard. If you need to eventually have read tens of thousands of pages in your TL, reading five pages of \"Theoretical English Grammar\" and taking a few days to ponder about them is of little help towards *that* goal.\n2. Listening to audiobooks while playing games like \"three in a row\", going for a walk or riding a bus. Pros: 1. If the narrator is invested in the story, their intonations can help liven up the experience for you. 2. You train your listening comprehension at the same time. Cons: 1. It still does't help if you can't stand the author (might work for things that are just bland and boring, though). 2. You don't train your \"reading muscle\", i.e. the ability to turn written symbols into a movie in your head.\n3. Reading books that are above your level. Pros: The plot might be just as bland and full of clichés if you strip it down, but at least your brain has all that shiny new vocabulary and tricky grammar to play with. Cons: 1. It's slower and you get overloaded with information pretty quickly.\n\nAs other people have suggested, being able to drop a book you don't enjoy at any stage of reading increases your chances of finding a book you'd enjoy. In hindsight, there might have been a better use of my time and effort than powering though a couple of really emotionally draining books.\n\nPorn, that was also mentioned here, has its place, but it should be treated with caution. You might end up sounding inappropriate without realizing it. Besides, I find it fairly useless B2 upwards (but what a way to build up a reading muscle on a horny A2-B1 trip, haha).", "created_utc": "1650146052.0", "edited": "False", "id": "i50anla", "is_submitter": "False", "link_id": "t3_u5129i", "parent_id": "t3_u5129i", "score": "4", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "NaJaEgal", "body": "idk, I've never heard her speak Russian.", "created_utc": "1646269512.0", "edited": "False", "id": "hz4h0y0", "is_submitter": "False", "link_id": "t3_t49yg9", "parent_id": "t1_hz4g3zl", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "NaJaEgal", "body": "You might find [this video](https://www.youtube.com/watch?v=mMLXYXOEHk0) interesting.", "created_utc": "1646239033.0", "edited": "False", "id": "hz2f501", "is_submitter": "False", "link_id": "t3_t49yg9", "parent_id": "t3_t49yg9", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "NaJaEgal", "body": "Try [Reverso Context](https://context.reverso.net/%C3%BCbersetzung/)", "created_utc": "1644709011.0", "edited": "False", "id": "hwpki5w", "is_submitter": "False", "link_id": "t3_sqxm57", "parent_id": "t3_sqxm57", "score": "2", "subreddit": "German", "subreddit_id": "t5_2qq51"}, {"author": "NaJaEgal", "body": "I've tried reading the translation of Sophokles into modern German. \n\nI already read Kafka, Remarque and Böll with >99% lexical coverage, though I still lack stamina to read them more than 10-20 pages in one sitting. I have no problem reading 50-80 pages of modern authors like Wolfgang Hohlbein or Friedrich Ani a day. I score 85-95/100 in reading and listening sections of \"Endstation\" (a C2 exam preparation book, passing grade is 60/100).\n\nBut Sophokles is something else. I decided to wait at least a couple of years before trying again. \n\nAnd yes,\n\n>There is, of course, no need to understand this type of material.", "created_utc": "1644073719.0", "edited": "False", "id": "hvpdt52", "is_submitter": "False", "link_id": "t3_sl72s9", "parent_id": "t3_sl72s9", "score": "8", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "NaJaEgal", "body": "When I tried to learn Irish I was excited to catch an occasional \"agus\" in the wild. It means \"and\".", "created_utc": "1643726563.0", "edited": "False", "id": "hv4yg1c", "is_submitter": "False", "link_id": "t3_shri1b", "parent_id": "t1_hv4jakq", "score": "20", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "NaJaEgal", "body": "\"Les Ripoux\" (Die Bestechlichen) hatte in Sowjetunion eine andere Ende. René kommt aus dem Knast, sieht niemanden, uuuund... Rolltitel.", "created_utc": "1643175890.0", "edited": "False", "id": "hu9dk9i", "is_submitter": "False", "link_id": "t3_scc6e3", "parent_id": "t3_scc6e3", "score": "1", "subreddit": "de", "subreddit_id": "t5_22i0"}, {"author": "NaJaEgal", "body": "I'm Russian, and in my social circle nobody cares if you're gay, bi, ace or whatever. It's hard to   say what people outside of my bubble think, but I guess you should be okay.", "created_utc": "1643011026.0", "edited": "False", "id": "htztxbk", "is_submitter": "False", "link_id": "t3_sbfq4j", "parent_id": "t3_sbfq4j", "score": "47", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "NaJaEgal", "body": "М**ой** любим**ый** дедушка — мужского рода. Возможно, вы что-то перепутали.", "created_utc": "1642821492.0", "edited": "False", "id": "htozzff", "is_submitter": "False", "link_id": "t3_s9jugx", "parent_id": "t1_htoxzut", "score": "15", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "NaJaEgal", "body": ">Grampa in Russian is feminine.\n\nNo, he's not.", "created_utc": "1642819757.0", "edited": "False", "id": "htovw94", "is_submitter": "False", "link_id": "t3_s9jugx", "parent_id": "t1_htoqu34", "score": "15", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "NaJaEgal", "body": ">If you used \"du\" with a police officer\n\ndann entschuldigst du dich sofort und korrigierst dich zu \"*Sie* Wichser\".\n\n...I'll see myself out.", "created_utc": "1641738576.0", "edited": "False", "id": "hrx0pcl", "is_submitter": "False", "link_id": "t3_ryqs9v", "parent_id": "t1_hrvcz9i", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "NaJaEgal", "body": ">what have you used/taken to learn a new language?\n\nWhere are self-study books, coursebooks, grammar textbooks, graded readers, fiction books, non-fiction books, audiobooks, cartoons, movies, series, podcasts, news articles, wikipedia articles, youtube videos, social media, online games, personal interaction with native speakers...?\n\n&#x200B;\n\n>What level have you reached in the language you are learning?\n\nPeople here are having heated discussions about CEFR levels even though there are clear definitions of competences required for each level. I doubt that you'll be able to collect any meaningful data with an arbitrary scale grading from \"not proficient\" (what is that even supposed to mean?) to \"fluent\". Just try searching this subreddit and you'll find opinions on what to call \"fluent\" varying from B1 to C1 or even C2. That means that you'll have some overconfident people at the B1 level calling themselves \"fluent\", i.e. \"5\" on your scale and some perfectionist people at the C2 level choosing 4, because \"you can never be really perfect\" and \"I used the wrong preposition the last week and searched for the right word for a full 5 seconds yesterday\".\n\nSome people learn more than one foreign language. If that's not relevant for your survey, it's still better to rephrase the question to \"What is the highest level that you have reached in the languages you are learning?\"\n\n&#x200B;\n\n>What do you find difficult when trying to master a new language?\n\nPossible other options:\n\nLack of resources (cheap/free resources, high quality resources, interesting resources), writing system is difficult, grammar is difficult, the amount of vocabulary is overwhelming, the amount of time needed to master the language was severely underestimated, there are many local dialects so it's hard to choose which one to learn (looking at you, Irish), cultural prejudices of the immediate family towards the target language (there was a post in this subreddit once from a teenage girl whose parents mocked her for learning Chinese), natives of that language speak near-perfect English and switch to it all the time making it difficult to speak target language with them. For all of these answers you'd want to know the native language-target language pair to be able to meaningfully interpret your results.\n\nAlso: no experience in self studying anything prior to language learning, not knowing where to start, not knowing how to deal with an \"intermediate plateau\", not knowing how to improve your language once you've reached an advanced level, myths surrounding language learning (aka: \"I'm 21, am I too old to learn a new language?\" seriously, I'm not exaggerating here, such posts exist), dyslexia, burn out, ADHD, bad sight/hearing, other health conditions.\n\n&#x200B;\n\n>How important is being able to speak conversationally with no accent (as in sounds fluent)?\n\nSo, did you mean\n\n1)conversationally\n\n2) with no accent\n\nor 3) sounds fluent?\n\nBecause those three are different things.\n\nBTW, there's no such thing as \"no accent\" it's \"native accent\" at best. And it's highly arguable that native accent is an achievable goal for an adult language learner, so I would rephrase it to something along the lines of \"as close to native accent as possible\".", "created_utc": "1641736229.0", "edited": "1641736643.0", "id": "hrwvzen", "is_submitter": "False", "link_id": "t3_rzcvo9", "parent_id": "t3_rzcvo9", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "NaJaEgal", "body": "I thought he meant \"перчаточный бокс\", not \"бардачок\", cause google decided to show me the pictures of the former when I searched for \"glovebox\". I was like \"WTF? 0\\_0 how on earth is *that thing* a test for fluency?\"", "created_utc": "1640294612.0", "edited": "False", "id": "hpqayu9", "is_submitter": "False", "link_id": "t3_rmz8tt", "parent_id": "t1_hpq8rjr", "score": "16", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "NaJaEgal", "body": "Google obviously doesn't know that \"glovebox\" means \"glove compartment\". Because it shows me laboratory vacuum glove boxes instead :-D\n\nOk, so it turns out I was fluent in Russian, but I failed your test in English hilariously :-D", "created_utc": "1640293567.0", "edited": "False", "id": "hpq8jir", "is_submitter": "False", "link_id": "t3_rmz8tt", "parent_id": "t1_hpq6dch", "score": "28", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "NaJaEgal", "body": "Glovebox? I have never seen or heard about that thing in my entire life and I (obviously) didn't know a word for it in any of the languages I speak. Guess I'm not even fluent in Russian, being a native in my thirties :-(", "created_utc": "1640292073.0", "edited": "False", "id": "hpq538v", "is_submitter": "False", "link_id": "t3_rmz8tt", "parent_id": "t1_hpp7fya", "score": "26", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "NaJaEgal", "body": "I found Memrise really helpful for pronunciation at the beginner stage. Its official courses have all the words and phrases pronounced by a native speaker. I used to listen closely and repeat every word as close to the original as I could. To be able to do that, you should use \"strict typing\" reviews, of course.", "created_utc": "1639114343.0", "edited": "False", "id": "hnybr8h", "is_submitter": "False", "link_id": "t3_rcwruz", "parent_id": "t3_rcwruz", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "NaJaEgal", "body": ">A2 is the Perfect stage for interaction, you can literally talk about anything, even if the vocabulary and ways of explaining concepts might be simple.\n\nOk, so I talked to another German learner the other day and we simulated the speaking section of a B2 mock exam. I could see how he misunderstood and misinterpreted my messages, like, 20% of the time. Maybe I was not presenting my ideas clearly enough, maybe he was lacking some vocabulary to understand me (which, I'm inclined to think, was the case), but it was two at least B1+ learners who failed to communicate effectively.", "created_utc": "1638759879.0", "edited": "1638774096.0", "id": "hnev9oj", "is_submitter": "False", "link_id": "t3_r9s8v1", "parent_id": "t1_hne1i5i", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "NaJaEgal", "body": "This. I was wondering if I was the only one who stumbled upon \"memorize 20000 words and grammar rules\" part.", "created_utc": "1636865587.0", "edited": "False", "id": "hkjst83", "is_submitter": "False", "link_id": "t3_qt19p1", "parent_id": "t1_hkh89wb", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "NaJaEgal", "body": "Friedrich Clamer - Übungsgrammatik für die Grundstufe. A perfect exercise book to revise grammar.", "created_utc": "1636425652.0", "edited": "False", "id": "hjvygmq", "is_submitter": "False", "link_id": "t3_qpqca1", "parent_id": "t3_qpqca1", "score": "3", "subreddit": "German", "subreddit_id": "t5_2qq51"}, {"author": "NaJaEgal", "body": "Don't underestimate the importance of downtime. The society tries to constantly shame everyone into being productive all the time, not leaving any time to analyse life experiences and learn from them.\n\nYou have some time off school — enjoy it. Just let yourself do nothing. Speaking as someone who used to take a bath with a calculus II textbook and read Poincaré on my way from university to an English lesson, because otherwise I felt guilty for \"wasting my time\".", "created_utc": "1634902976.0", "edited": "False", "id": "hhlwkrl", "is_submitter": "False", "link_id": "t3_qdeq2m", "parent_id": "t3_qdeq2m", "score": "13", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "NaJaEgal", "body": "Just buy a teacher's book for your textbook. Some of them contain not only answer keys, but also a lot of methodological recommendations for every lesson. If you are going to study by yourself, a teacher's book is a must.", "created_utc": "1634900978.0", "edited": "False", "id": "hhlthx9", "is_submitter": "False", "link_id": "t3_qdbbam", "parent_id": "t3_qdbbam", "score": "1", "subreddit": "German", "subreddit_id": "t5_2qq51"}, {"author": "NaJaEgal", "body": "I found [Lena and Olga](https://www.youtube.com/watch?v=EQuVbXNVnt8) on Youtube.", "created_utc": "1634740777.0", "edited": "False", "id": "hhd74m7", "is_submitter": "False", "link_id": "t3_qbl8uf", "parent_id": "t1_hhd55yt", "score": "1", "subreddit": "German", "subreddit_id": "t5_2qq51"}, {"author": "NaJaEgal", "body": "Exactly! :-)", "created_utc": "1634738672.0", "edited": "False", "id": "hhd2f3b", "is_submitter": "True", "link_id": "t3_qbv9u2", "parent_id": "t1_hhd1m81", "score": "10", "subreddit": "German", "subreddit_id": "t5_2qq51"}, {"author": "NaJaEgal", "body": "I have a [Trainingsmaterial für Prüfende](https://docdro.id/VjOJT4H). The book is from 2008, but I think it can still be useful to get an idea of grading criteria. It contains examples of very good-good-satisfactory-bad texts.", "created_utc": "1634713202.0", "edited": "False", "id": "hhc1wmy", "is_submitter": "False", "link_id": "t3_qbl8uf", "parent_id": "t3_qbl8uf", "score": "2", "subreddit": "German", "subreddit_id": "t5_2qq51"}, {"author": "NaJaEgal", "body": "You're welcome! I'm starting to feel that itchyfeet comics is the language learning community's equivalent of the \"there is always a relevant xkcd\" rule.", "created_utc": "1630185367.0", "edited": "False", "id": "haq8syo", "is_submitter": "False", "link_id": "t3_pde8cp", "parent_id": "t1_haq876s", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "NaJaEgal", "body": "[relevant itchyfeet](http://www.itchyfeetcomic.com/2015/11/ameribird.html#.YSqkkrAzbIU)", "created_utc": "1630184681.0", "edited": "False", "id": "haq7bp7", "is_submitter": "False", "link_id": "t3_pde8cp", "parent_id": "t3_pde8cp", "score": "11", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "NaJaEgal", "body": "[Sommers Weltliteratur to go](https://www.youtube.com/user/mwstubes) makes very fast-paced and witty 10 minute Playmobil recreations of classic literature — Tolstoy, Shakespeare, Eco, Flaubert, Hesse — you name it. You get the most of it when you've actually read the book. But a lot of the people in the comments say that the videos saved their asses on the high school test, so they are definitely watchable on their own.", "created_utc": "1628917339.0", "edited": "False", "id": "h8vl36e", "is_submitter": "False", "link_id": "t3_p3cwb5", "parent_id": "t1_h8qi8cr", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "NaJaEgal", "body": "Die Fantastischen Vier songs written by Thomas D are really poetic, for example \"Gott ist mein Zeuge\" or \"Flüchtig\".", "created_utc": "1628347821.0", "edited": "False", "id": "h827ega", "is_submitter": "False", "link_id": "t3_ozqzud", "parent_id": "t3_ozqzud", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "NaJaEgal", "body": "30,500 seems about right for a [well read adult native speaker](http://testyourvocab.com/blog/2013-05-09-Reading-habits).", "created_utc": "1626516332.0", "edited": "False", "id": "h5i2a2g", "is_submitter": "False", "link_id": "t3_olmoe0", "parent_id": "t1_h5gw8gj", "score": "6", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "NaJaEgal", "body": "Have you tried books labeled with CEFR levels? \"Intermediate\" is a vague term, which can mean anything from a  shaky B1 to a high B2. Among the books labeled \"B1\", \"B2.1\" (or alternatively \"B1+\"), \"B2.2\" (or just \"B2\") something should fit your current needs.", "created_utc": "1625969114.0", "edited": "False", "id": "h4rkln6", "is_submitter": "False", "link_id": "t3_ohs3b2", "parent_id": "t3_ohs3b2", "score": "4", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "NaJaEgal", "body": "It was an [online version](https://lingust.ru/deutsch/deutschunterricht) of a very old Soviet book. It still used \"Mark\" as German currency, had outdated spelling (beware of the 1996-2006 spelling reform when you start learning German),  had hideous transcriptions using Cyrillic instead of IPA, and didn't teach informal second person. \"ThErE'll Be EnOuGh TiMe FoR yOu To LeArN hOw To Be RuDe\" was their explanation about the latter point. Like, wtf??!!? I had problems with the use of informal second person plural \"ihr/euch\" up until a B1+ level thanks to them. Because B1 coursebook doesn't cover that topic in depth, you're supposed to know it already. 3/10 wouldn't recommend.\n\nOn the bright side, it was completely free and it did take me to an approximately A2 level (with the exception of the said \"ihr\"), so I was able to start a B1 coursebook after that.\n\nI would recommend a B1 coursebook I used though. It's called \"Netzwerk\", I really enjoyed using it. The series include A1 and A2 level coursebooks as well, but I have no idea what they are like.\n\nOfficial Memrise courses are also really good for building a vocabulary and laying the foundation of a good pronunciation. 9/10 would recommend.\n\nEdit: [Nicos Weg](https://learngerman.dw.com/de/nicos-weg/c-36519687) is also good as a fun supplementary activity for a main robust course. Its short subtitled videos really helped me with my listening comprehension, and it didn't feel like studying, it was just \"free time that I spend with German\".", "created_utc": "1625622556.0", "edited": "1625623550.0", "id": "h4b2gdh", "is_submitter": "False", "link_id": "t3_oextiu", "parent_id": "t1_h4atrho", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "NaJaEgal", "body": "German, a complete beginner to a solid B2 in 4 years of studying on and off.\n\n1st year: a self-study book for complete beginners, official Memrise courses, intensive reading of \"Timm Thaler\" + forvo.com for every new word I encounter. I took an official Goethe-Institut A1 level sample test, passed it with good marks.\n\n2nd year: a B1 level coursebook with an answer key, Memrise (5000 most frequent words, irregular verbs, verbs with prepositions etc.), around 500 pages of children's books read extensively, Nicos Weg when I felt like just having fun with the language. I also started reading r/de and watching Coldmirrors videos on youtube. Passed an A2 level sample test.\n\n3rd year: I tried to take a B2 level coursebook. After completing the first chapter I felt like the most of the material just flies over my head and I'm getting only 30-40% of the textbooks potential value, even if I am *sort of* able to do the exercises. So I took a step back and took a coursebook with a B1+ (essentially just B2.1) label on it. It worked just fine. I read more books, watched more youtube videos, learned more vocabulary on Memrise. I worked through exercises in an A1-A2 level grammar textbook to solidify my foundation. Took a B1 level sample test and it turned out to be ridiculously simple at that point, could have done it way earlier.\n\n4th year: With the beginning of the pandemic I struggled to find an adequate source of information about Covid until I heard about that podcast with a German virologist who specializes on Coronaviruses. At first I wasn't sure if my German was good enough to understand it. It worked out well, although it was *very very hard* at the beginning, and I needed 3-5 minutes to adjust to it every time. That means: *first 5 minutes of every listening session I didn't understand shit*. Until I suddenly did. I listened to it every day, along with news, documentaries and audiobooks in German. Around that time I discovered that I'm sick to death of my coursebook and ditched it.  To make sure that I don't end up speaking like a caveman, I continued going through a B1-B2 level grammar textbook. I also graduated from children's and YA books to books for adult native speakers in my extensive reading, and read my first \"Literature with a capital L\" book intensively. Goethe-Institut B2 level sample test was the first one that felt serious, and I really needed to focus in order to do it. The writing section felt *brutal*, I would have struggled doing it even in my native language. I still ended up scoring 90+/100 in every section including writing, which means that I'm (semi-officially) a solid B2 now.", "created_utc": "1625607705.0", "edited": "False", "id": "h4a9ivh", "is_submitter": "False", "link_id": "t3_oextiu", "parent_id": "t3_oextiu", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "NaJaEgal", "body": ">any learning is self-study\n\nSo much this.", "created_utc": "1625603433.0", "edited": "False", "id": "h4a0bnh", "is_submitter": "False", "link_id": "t3_oextiu", "parent_id": "t1_h49t3wo", "score": "8", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "NaJaEgal", "body": "1) Level-appropriate input (for beginner/intermediate levels)\n\n2) Balanced practice of all four skills\n\n3) Coverage of most of the topics that are likely to appear on the exam (If you are going to take any)", "created_utc": "1622946281.0", "edited": "False", "id": "h0r4z5d", "is_submitter": "False", "link_id": "t3_nt87di", "parent_id": "t3_nt87di", "score": "4", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "NaJaEgal", "body": "A lot of great recommendations here. I'll just add some more:\n\nЮрий Коваль. \"Приключения Васи Куролесова\" —  a YA detective series. \"Самая лёгкая лодка в мире\" — a very mysterious and dreamy account of a river rafting trip (it's more interesting than it sounds).\n\nА. и Б. Стругацкие. The most prominent Soviet SF authors. My personal favorites were \"Понедельник начинается в субботу\" — an ode to scientists and engineers in a fairy tale setting and \"За миллиард лет до конца света\" — a book for when your life turns inexplicably weird.", "created_utc": "1620124378.0", "edited": "False", "id": "gww33k8", "is_submitter": "False", "link_id": "t3_n4emep", "parent_id": "t1_gwvtrlt", "score": "4", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "NaJaEgal", "body": "**Irish**\n\n[Alan Stivell - Brian Boru](https://www.youtube.com/watch?v=XC_v0qt_Vxo) — a mesmerisingly beautiful song. It made me fell in love with the language and I ended up learning Irish for the next couple of months. Eventually gave it up because, firstly, life happened, and secondly, Irish is honestly not the most practical choice for such a time-consuming hobby as language learning. But do I still have goosebumps when I hear Irish? Sure as hell I do.", "created_utc": "1618791939.0", "edited": "False", "id": "gv10aur", "is_submitter": "False", "link_id": "t3_mtcbfc", "parent_id": "t3_mtcbfc", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "NaJaEgal", "body": "Ja, das macht Sinn.", "created_utc": "1618622971.0", "edited": "False", "id": "guska63", "is_submitter": "False", "link_id": "t3_mqyg9q", "parent_id": "t3_mqyg9q", "score": "2", "subreddit": "languagelearningjerk", "subreddit_id": "t5_37rt5"}, {"author": "NaJaEgal", "body": "There's one really effective way to learn new words: try to imagine their meaning. For example, if you have to learn a new word for \"apple\", try to close your eyes for 20-30 seconds and imagine an apple. It can be an apple tree, a bitten apple in your hand, apples in the supermarket, an apple pie, a jar of apple jam, a smell of fresh apples,... try to *feel*, that this particular word means all these things. Try to feel how this word is full of *appleness*. It needs concentration, I honestly often feel too lazy to do it myself, but it work wonders when done properly.", "created_utc": "1617189964.0", "edited": "False", "id": "gswjzrj", "is_submitter": "False", "link_id": "t3_mh1ek9", "parent_id": "t3_mh1ek9", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "NaJaEgal", "body": "By \"beginner\" I meant a first time independent learner, I might have worded it poorly. Yes, B1-ish intermediate is a totally reasonable time to start reading. Although I started reading my first German book at the first day of learning (true beginner), and have no regrets doing so. It's *possible*. It might not be for everyone, but it's possible.\n\nAnd no, I'm by no means a \"Holy Immersion\" disciple :-D I'm all for having a properly structured grammar study and paying enough attention to productive skills.\n\nUnreasonably high expectations is a topic in itself. I recently had a mental breakdown of sorts after reading a post of somebody going A0-C2 in 2+ years. I'm mostly ok by now... I hope :-)", "created_utc": "1616385384.0", "edited": "False", "id": "grrz4xa", "is_submitter": "False", "link_id": "t3_ma7qq1", "parent_id": "t1_grrpsxa", "score": "4", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "NaJaEgal", "body": "Since I was one of the people who downvoted your comment, I'll try to explain why I decided to do so.\n\nI don't mind you having your own opinion. I don't mind you sharing your learning experiences. That's what we are all here for, after all: different perspectives on our shared hobby. But I think it is quite harmful to *advice* beginners who are willing to read books not to do so until they are B2-C1. If that's something they wouldn't really find enjoying on lower levels, let them discover that for themselves. Or if their goal is to pass a B1 CEFR exam as soon as possible, then I trust u/an_average_potato_1 's advice, who says that reading and watching TV would be a waste of precious time at that level.\n\nBut an average language learning beginner, who does not have to use every minute of studying as effectively as possible and want to make it enjoyable and fun as well might really benefit from reading something in their TL on the side of their studies. If they instead look at your comment, say to themselves: \"An experienced learner said that I should wait till I'm C1 until reading something in my TL, I guess, I won't even try then\", they would miss a great opportunity to start immersing, developing a language intuition, deepening the understanding of the structures they have learnt in their textbooks. Not to mention the fact that you need to read novels to reach the said C1 level in the first place.\n\nAgain: it's not the fact that you *prefer* not reading books until you get to an advanced level, that made me downvote you. It's the fact that you *advice* not to read until somebody reaches an advanced level.", "created_utc": "1616372549.0", "edited": "False", "id": "grrbn99", "is_submitter": "False", "link_id": "t3_ma7qq1", "parent_id": "t3_ma7qq1", "score": "7", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "NaJaEgal", "body": "Russian:\n\n\"I found yesterday interesting book in library.\"\n\nThat's the most neutral variant, but you can also say:\n\n\"Yesterday I found interesting book in library.\",\n\n\"I yesterday found interesting book in library.\"", "created_utc": "1616347470.0", "edited": "False", "id": "grpxgd7", "is_submitter": "False", "link_id": "t3_m9jplg", "parent_id": "t3_m9jplg", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "NaJaEgal", "body": "relevant [itchy feet](http://www.itchyfeetcomic.com/2015/03/circus-act.html#.YDpxgVUzbIU)", "created_utc": "1614442928.0", "edited": "False", "id": "gp144m5", "is_submitter": "False", "link_id": "t3_ltmx0o", "parent_id": "t3_ltmx0o", "score": "4", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "NaJaEgal", "body": "Don't try to learn all of the words at once. I remember once finding a vocabulary list from a novel I wrote down earlier and tried to cram 200 words in my head in one sitting. I somehow managed to put them all at least in my short-time memory and get all the words right as I tested them. I ended up having severe headaches the whole next week. I questioned my life choices, my mental capacity, and cried, because \"life is so unfair, I couldn't be that dumb as to not be able to learn merely 200 words, while sitting down to learn them once in two weeks. I'll never gonna learn English, I'm that stupid. What am I supposed to do? Learn new words *every day*?\" And the answer is, yes. This is how it works. If you learn as much as 10 new words a day, you don't overstrain your brain and if you do it every day, you'll end up having learned 3500 words in one year.\n\nI'd also recommend you googling how many words you typically  need to know to pass each level exam and how many words does the average native speaker know. The estimates may vary slightly, but it helps put things into perspective.", "created_utc": "1614229689.0", "edited": "1614229931.0", "id": "goo9b12", "is_submitter": "False", "link_id": "t3_lrldy8", "parent_id": "t3_lrldy8", "score": "5", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "NaJaEgal", "body": "Oh, wow. I seriously didn't expect it to be that painfully slow. It was hard to listen, but the only difficulty was it being *too slow and unnatural*. I guess, I underestimated my listening skills. Or overestimated CEFR requirements.\n\nYou constantly bring up the point that C1 level is not that high, and even C2 is nowhere near \"native-like\". I'm starting to believe you now.", "created_utc": "1614046814.0", "edited": "1614047335.0", "id": "goexbj7", "is_submitter": "False", "link_id": "t3_lp8817", "parent_id": "t1_gobrkju", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "NaJaEgal", "body": "I understand your feelings so well. I guess, people who are downvoting your comment here haven't experienced a heritage language being shoved down their throats. \n\nIn my case it's Tatar. I didn't learn it at school, but I had to endure fits my grandma threw over speaking Russian at home. Ironically, she didn't even speak good Tatar herself. She had to look up Tatar words in a dictionary every now and then, and most of the time she spoke some monstrous hybrid of Russian and Tatar, without even realizing it.\n\nI mean, I feel you bro.", "created_utc": "1613953208.0", "edited": "False", "id": "goa9wu4", "is_submitter": "False", "link_id": "t3_lp3jsb", "parent_id": "t1_go9q0po", "score": "5", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "NaJaEgal", "body": "But you've surely seen/heard an \"elephant in the room\" idiom more than once in your life? At least in English, elephant is an important word to know. And yes, idiomatic use is different from literal blah, blah, but are you really ok with using an expression \"§=%(!\"%$ in the room\" without knowing what §=%(!\"%$ is?", "created_utc": "1613859237.0", "edited": "False", "id": "go5w7ug", "is_submitter": "False", "link_id": "t3_lo5vt2", "parent_id": "t1_go47bk4", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "NaJaEgal", "body": "I'd say a few months to half a year — that depends. Just decide how many words a day you are going to learn, divide that by the number of new words you encounter on one page of the book and you get the number of pages you'll read per day. Let's say you come across 4 unknown words per page on average and learn 20 new words a day — that makes 5 pages a day. In that case you'll need 40-50 days to read a 200-250 pages long book in the assumption that you read it everyday (and if you're learning 10 new words a day, double that number). Since intensive reading is never my only activity in a foreign language, in some cases it took up to half a year to finish a book.", "created_utc": "1613423867.0", "edited": "1613426487.0", "id": "gnkpqbx", "is_submitter": "False", "link_id": "t3_lki4zn", "parent_id": "t1_gnkf4pb", "score": "7", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "NaJaEgal", "body": "Yes, I've done that for a number of English books, and I'm reading a German book intensively right now.\n\nMy takeaways:\n\n1. It takes a long time, so better be sure the book is worth it.\n2. I wouldn't even try to do that for anything that's longer than 200-250 pages (for the same reason).\n3. It might not be necessary to learn all the words you don't know even in your native language — names of obscure plants, nautical terms, twenty different ways to name a horse-drawn vehicle etc. — but it's a matter of taste. I used to learn all those gunwales and tympanums, kept forgetting them anyway.\n4. Intensive reading is very rewarding. Every book read that way makes a difference.", "created_utc": "1613415836.0", "edited": "1613419010.0", "id": "gnk8vk8", "is_submitter": "False", "link_id": "t3_lki4zn", "parent_id": "t3_lki4zn", "score": "23", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "NaJaEgal", "body": "Nobody seems to have mentioned that, but you probably aren't really getting worse in Russian. You still use it at school and with your family  — that's *a lot*. What might have happened though, is that you've become more apprehensive of your minor mistakes and pauses as you search for the right words in your native language. The more experience in learning foreign languages you have, the less content with your native language skills you become.\n\nI personally started jokingly saying \" я не знаю русского :-(\" as soon as I started to take learning English seriously. Because I began to actually pay attention to the language I am speaking, including my native one. I don't know what the hell does the word \"чапельник\" mean, and it turns out to be that nameless tool I've been using my whole life long?  —  \"я не знаю русского!\" A whole class of sixth-graders correct me in unison: \"свёклы\" as a read:\"на склад привезли 15 тонн свеклы\"  — \"я не знаю русского!\" (and thank god I'm teaching you math and not Russian, kids). And the list goes on and on.\n\nAnd as soon as I started to learn German, it got only worse. I don't only \"not know Russian\", I'm getting less and less content with my English level, whereas I am obviously improving at it. I can't make out every single word in that one video? \"C1 my ass!\" I'm constantly googling every idiom before using it in my writing (and I'm right only 9 times out of 10)? \"C1 my ass!\" I can already say that in German, but I am struggling to formulate the same thought in English? \"C1 my ass!\"\n\nTry to ask your family members and friends at school: do *they* think your Russian is getting worse? Chances are, they'd be surprised at that question. My friends were :-)", "created_utc": "1612462760.0", "edited": "False", "id": "gm0lv5p", "is_submitter": "False", "link_id": "t3_lcixlp", "parent_id": "t3_lcixlp", "score": "93", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "NaJaEgal", "body": "When I'm unsure of the proper usage of a particular word or idiom, I use google and [reverso context](https://context.reverso.net/).\n\nFor full text corrections there is [LangCorrect](https://langcorrect.com/). It's considered good form to offer corrections to those learning your native language in exchange for the help you get there.", "created_utc": "1610983953.0", "edited": "False", "id": "gjq6xge", "is_submitter": "False", "link_id": "t3_kzpwgy", "parent_id": "t3_kzpwgy", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "NaJaEgal", "body": "Es fiel mir grad ein: du könntest es ausprobieren deine Frage in r/Dachschaden zu stellen.", "created_utc": "1606596280.0", "edited": "False", "id": "gdx674c", "is_submitter": "False", "link_id": "t3_k2tq5p", "parent_id": "t1_gdx42h0", "score": "-2", "subreddit": "de", "subreddit_id": "t5_22i0"}, {"author": "NaJaEgal", "body": "[https://alarmphone.org/de/](https://alarmphone.org/de/)\n\n[https://twitter.com/iuventa10](https://twitter.com/iuventa10)\n\n[https://twitter.com/teammareliberum](https://twitter.com/teammareliberum)\n\nIch hoffe, da findest du den ein oder anderen Artikel, den du nutzen könntest.\n\nMann, wie schnell runterwählt man die Mittelmeer-Posts auf r/de!", "created_utc": "1606594662.0", "edited": "False", "id": "gdx1dpl", "is_submitter": "False", "link_id": "t3_k2tq5p", "parent_id": "t3_k2tq5p", "score": "-5", "subreddit": "de", "subreddit_id": "t5_22i0"}, {"author": "NaJaEgal", "body": "I'll just share my experience with this approach.\n\nI started to do the exact same thing with the vocabulary  of 0 (zero) known words. At the first day of learning German I took a German book I liked as a child (Timm Thaler oder das verkaufte Lachen) and started reading it. It took me two weeks to read the first page, and half a year to read the first 30 pages. By that time I knew around 2500 words, 1000 from Timm  Thaler and 1500 from pre-made Memrise deck. And I hated this book. I couldn't do it any longer. Three years and 4000 pages of different German books later I still can't bring myself to go back and finish it. If you don't mind eventually hating a book to the point of vomiting at the thought of reading it — go for it.\n\nIt might be not the most efficient way to build up a vocabulary *for a conversation*, though.", "created_utc": "1606148268.0", "edited": "False", "id": "gdcbptc", "is_submitter": "False", "link_id": "t3_jyxbmk", "parent_id": "t3_jyxbmk", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "NaJaEgal", "body": "Extensive reading is a way more natural process, than intensive — I read a book just as I would in my native language, and all I care about is the plot. If some unknown word prevents my understanding, I look it up in a dictionary, but don't write it down and don't try to learn it.\n\nIt's intensive reading, where you should ask yourself twice: do I really know this word, or did I just infer its meaning out of context? Or: do I really know this word, or do I just vaguely remember, that it's *some* positive character trait? or *some* motion verb?\n\nTo give you an example: At the moment I'm reading \"Die verlorene Ehre der Katharina Blum\" intensively. The fact, that her word \"gütig\" was written as \"nett\" to the interrogation record was a big deal to her. And she was not okay with replacing it with \"gutmütig\" instead either. I made sure that I understood the difference between all three, whereas in extensive reading I wouldn't care: \"I know the word *nett* and the other two have the root \"*gut*\" in them. It's *some* positive character traits, and she is concerned with the preciseness of the record.\" Well, maybe in that particular case where it's such a big deal for the main character I would have still stopped and compared the definitions, but I would have probably forgotten them after a few days, and they would have become *some positive character traits* again. Now, it's been a month since I read this place intensively and I'm writing this example without checking the book or my notes. I just remember it, and I'm not going to forget the difference between these words in any foreseeable future.\n\nNow, I reread what I've just written and it seems like extensive reading sucks :) Which is not true, because what it lacks in depth and detail it makes up for in the sheer amount of input consumed per unit time.", "created_utc": "1603949919.0", "edited": "1603954926.0", "id": "gagq6jx", "is_submitter": "False", "link_id": "t3_jjl2ej", "parent_id": "t1_gaei31i", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "NaJaEgal", "body": "I'm not sure if that's the sort of thing you asked for, but I've discovered extensive reading by myself.\n\nThe only way we read texts at school was intensive reading. So, as I continued studying English by myself after school, it was the only way I knew how to treat a text in a foreign language — translate every single word, till I'm sure I understand everything completely. I've already read a few books this way (it took me months to complete each one of them), when a friend of mine gifted me The Complete Amber Chronicles. I looked at this 1258 pages monstrosity and imagined how many years it would take me to read it. Then I said \"fuck it\", put the dictionary away and just read it extensively — nor understanding every single word, but still enough for everything to make sense. Since then it was the way for me to determine if I'm going to read the book intensively or extensively — \"Dubliners\": ok, intensively, \"The Odyssey of Captain Blood\": ok, intensively, \"Poe, Stories\": ok, intensively, \"Vanity Fair\": FUCK IT! oh, extensive reading :)\n\nThe idea of extensive reading may seem obvious for a language learning community, but discovering this concept on my own was not at all trivial for me at the time.", "created_utc": "1603894088.0", "edited": "1603894644.0", "id": "gadquft", "is_submitter": "False", "link_id": "t3_jjl2ej", "parent_id": "t3_jjl2ej", "score": "5", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "NaJaEgal", "body": "Definitely possible. My \"real\" native language i.e. the language I learnt to understand and speak first was Tatar. By the age of three I spoke both Tatar and Russian at about the same level (that of a three-year-old child). At six I went to school, where everything was in Russian, and even my ethnically Tatar friends didn't know Tatar. I kept reading bedtime stories in Tatar with my granny, but otherwise used it less and less often, till I stopped using it altogether. If I had to evaluate my current level in it, I'd say rusty B1 with a very limited vocabulary. I haven't used it in ages and I'm definitely not fluent.", "created_utc": "1603232529.0", "edited": "False", "id": "g9he3s0", "is_submitter": "False", "link_id": "t3_jeuzj1", "parent_id": "t1_g9h13ge", "score": "4", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "NaJaEgal", "body": "Oh, it's really nice to hear that.\n\nI never took a formal exam and decided to play it safe with the flair (as is recommended in the rules). I was mostly conscious about my pronunciation and listening comprehension skills. Maybe it's time to take at least a reliable sample test and start wearing my C1 flair proudly.\n\nYour comment has boosted my confidence, thanks.", "created_utc": "1602623391.0", "edited": "False", "id": "g8qdrsv", "is_submitter": "False", "link_id": "t3_jaakc1", "parent_id": "t1_g8q5n95", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "NaJaEgal", "body": "I started answering your survey, but gave up after the second question.\n\n1) \"Do you prefer to learn with textbooks or online?\"\n\nThese things are not mutually exclusive. It's like asking \"Do you prefer eating fast food or at home?\". I can easily eat fast food at home, or I can do neither and go to a restaurant. To make it more clear: five opened tabs with two online dictionaries, forvo, reverso context and occasionally google belong to my textbook routine. Not to mention that my textbook is in PDF on my laptop. And if I'm reading a book in my TL I don't care if I'm doing it in online library or using a printed copy.\n\n2) \"Do you like to learn with games or in a more traditional structured way?\"\n\nWhat do you understand under the word \"traditional\" and why does it exclude games in your opinion? Should games not be structured somehow if you are going to learn anything at all? In which box should I put immersion? Again, a strange question and a false dichotomy.\n\n3) \"What is a bigger area of importance to you? o Grammar o Vocabulary\"\n\n\"Which leg is more important to you? o Left o Right\" (and where is the third leg — Pronunciation? And the fourth  — Cultural Awareness? And the fifth... )\n\nOverall, I could give a reasonable answer only to the first question. If you are really interested in people's language learning habits, it might be a good idea to ask a general question on reddit first to learn what constitutes a language learning. And then, maybe, after rewriting your questionnaire completely try and find out what percentage of people prefer certain ways over the others.", "created_utc": "1602598718.0", "edited": "False", "id": "g8p04tc", "is_submitter": "False", "link_id": "t3_jaakc1", "parent_id": "t3_jaakc1", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "NaJaEgal", "body": "I'm halfway through Böll's \"Die verlorene Ehre der Katharina Blum\" intensively. I've already made 700+ new word cards for my SRS and expecting to have learnt somewhere around 1500 new words by the end of it. The grammar is sometimes challenging, and I had a lot of fun struggling to parse one sentence that had four or five levels of recursion. Sort of \"\\[That \\[in relation \\[but not a close one\\] to that other thing\\] thing that led to \\[and \\[if not for that third thing\\] wouldn't have been possible\\] a certain outcome\\]\". You start with \"That...thing that led to...a certain outcome\" and solve that puzzle, bit by bit. I guess I'm in love with Böll by now. Can't wait to read his other works.\n\nI've also started reading Hohlbein's \"Azrael\" extensively. Finally a book written originally in German and for grown-ups. A welcome change after things like \"Harry Potter\", \"Die drei Fragezeichen\" and \"Das Lied von Eis und Feuer\". I never realized before how boring children's books can be. Ok, \"A Song of Ice and Fire\" is not a children's book, but I guess medieval fantasy is not my genre either.\n\nIf reddit falls into \"anything except textbooks\" category, then  r/de gets an honorable mention. It never fails to provide me with fresh rants about neighbors, pictures of homemade bread, dumb AfD tweets, and reminds me when it's Wednesday.", "created_utc": "1601813760.0", "edited": "1601814837.0", "id": "g7o530s", "is_submitter": "False", "link_id": "t3_j4ibkl", "parent_id": "t3_j4ibkl", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "NaJaEgal", "body": "I'd argue that you can still test your writing and speaking skills using sample exams, although not as precisely as the other two. You'd not be able to see the grammar mistakes you've made, but you can at least see if you are able to write and speak on the given topics at all. Recording your speaking could also give you a realistic idea of your pronunciation and the amount of awkward pauses and \"erm...\"s involved.", "created_utc": "1601269036.0", "edited": "False", "id": "g6xbkk7", "is_submitter": "False", "link_id": "t3_j0r86a", "parent_id": "t1_g6wcj7w", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "NaJaEgal", "body": "A man from the federal state of [Saxony](https://en.wikipedia.org/wiki/Saxony).", "created_utc": "1601259157.0", "edited": "False", "id": "g6wwy7u", "is_submitter": "False", "link_id": "t3_j0m93u", "parent_id": "t1_g6wq3w7", "score": "3", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "NaJaEgal", "body": "The German one even has its own subreddit: [MannausSachsen](https://www.reddit.com/r/MannausSachsen/)", "created_utc": "1601202030.0", "edited": "False", "id": "g6tr1ad", "is_submitter": "False", "link_id": "t3_j0m93u", "parent_id": "t1_g6tiucy", "score": "37", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "NaJaEgal", "body": "— I'd like to get in, get on with it, get it over with, and get out. Get it?\n\n— Got it.\n\n— Good.\n\n\"The Court Jester\" (1955)", "created_utc": "1600945657.0", "edited": "False", "id": "g6euhnk", "is_submitter": "False", "link_id": "t3_ix7kpr", "parent_id": "t1_g65bcjz", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "NaJaEgal", "body": "I started reading \"*Alfred Hitchcock and the Three Investigators*\" series (\"Die drei Fragezeichen\" in German) when I was at about your level. I didn't  know half of the words, but still seemed to understand enough to get a vague idea of what's going on and be able to follow the plot.", "created_utc": "1600944534.0", "edited": "1601015359.0", "id": "g6et7hp", "is_submitter": "False", "link_id": "t3_ixu814", "parent_id": "t3_ixu814", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "NaJaEgal", "body": "Nicos Weg is really fun! I picked it up when I was studying at a B1 level and a few days later ended up binge watching A1 and A2 level videos just for the plot  :-)", "created_utc": "1600937407.0", "edited": "False", "id": "g6el38e", "is_submitter": "False", "link_id": "t3_iyf1nr", "parent_id": "t1_g6ccwhx", "score": "4", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "NaJaEgal", "body": "7 Days in Hell", "created_utc": "1599859122.0", "edited": "False", "id": "g4v7g8c", "is_submitter": "False", "link_id": "t3_iqx0zx", "parent_id": "t3_iqx0zx", "score": "2", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "NaJaEgal", "body": "Hi! I'm a native Russian speaker (33F). I'm currently learning German and I would much appreciate having a language partner. I would gladly help you with your Russian too. I was also raised in a bilingual household and my *actually first* language (Tatar) sucks. It feels rather strange, that it should, sort of, be my native language, but it isn't.\n\nI'm interested in math, martial arts, biology and language learning. I also love watching silly youtube videos — when I started leaning German, I discovered Coldmirror, for instance. A true gem of a silly German humor :-) (silly in a good sense, like \"The Ministry of Silly Walks\" silly)", "created_utc": "1599683113.0", "edited": "False", "id": "g4kyour", "is_submitter": "False", "link_id": "t3_ipfabo", "parent_id": "t3_ipfabo", "score": "1", "subreddit": "language_exchange", "subreddit_id": "t5_2tdbm"}, {"author": "NaJaEgal", "body": "I'm a native Russian speaker and I got 145/150 (97%) in Russian the first run. After I said wtf, and took it once more, I got 150/150. I read the questions more carefully the second time, but I swear I chose the exact same answers!.. or did I not?\n\nEnglish 145/150 (97%), German 135/150 (90%)\n\nThe test is not *that* brutal, if you'd ask me. Definitely not some kind of a scam test that tells you your language level sucks no matter what, that I'd expected after reading your post. Judging from the comments of Spanish native speakers, Spanish test may be different, though.", "created_utc": "1598839484.0", "edited": "False", "id": "g3fat70", "is_submitter": "False", "link_id": "t3_ijb05y", "parent_id": "t3_ijb05y", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "NaJaEgal", "body": "1)  Your \\[л'\\] sound in  \"лю́ди\"  is too hard. \"Ю\" is a soft vowel, so it always makes the preceding consonant softer (palatalizes it). \"A\", on the other hand, is a hard vowel, so \\[л\\] in \"рассла́биться\" should be hard, but you soften it here instead.\n\n[This online lesson](http://www.russianforeveryone.com/Rufe/Lessons/Course1/Introduction/IntrUnit6/IntrUnit6.htm) should give you the idea of what I'm talking about.\n\n2) \\[Встр\\] in \"встре́титься\" is not the easiest consonant cluster to pronounce, but try not to omit the \\[р\\] sound.\n\n3) Your \"ч\" sound in \"о́чень\" sounds like \\[щ\\]. The pronunciation of this letter can change in some words (like \"что\" - \\[што\\]), but here it should sound exactly like in alphabet — \\[ч\\].\n\n4) You soften \\[ж\\] sound in \"похо́жа\" and \"до́лжен\". There is no soft \\[ж'\\] sound in Russian.\n\n5) \"име́ет\" sounds like \"и́мет\", \"тури́ст\" sounds like \"ту́рист\", \"сходи́ть\" sounds like \"схо́дить\". Pay more attention to the position of the stress. \n\n6) \"осо́бенности\" sounds like \"осо́бе́нности\". In Russian secondary stress can occur only in compound words. Single-root words have only *one* stressed syllable.", "created_utc": "1597837628.0", "edited": "False", "id": "g23aymq", "is_submitter": "False", "link_id": "t3_icfqdq", "parent_id": "t3_icfqdq", "score": "5", "subreddit": "JudgeMyAccent", "subreddit_id": "t5_2ufiq"}, {"author": "NaJaEgal", "body": "Russian native speaker here. Off the top of my head I would say the first or the second one, but definitely not the third: 1,000 in Russian means \"one point zero\". After a bit of googling I found out, that since 1992 it is  [recommended](https://en.wikipedia.org/wiki/ISO_31-0#Numbers)  to separate long sequences of digits by a small space (and it applies to Russian too).\n\nSo, first one for \"one thousand\", third one for \"one point zero\". \n\nYou can still find the relics of the second variant. I do, in fact, use it in calculations on paper myself. In that case it will mean \"one thousand\".", "created_utc": "1590994936.0", "edited": "False", "id": "fsi5udn", "is_submitter": "False", "link_id": "t3_gue04z", "parent_id": "t3_gue04z", "score": "4", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "NaJaEgal", "body": "Wow, danke!\n\n>  Mühlweier/Müllweier \n\n0\\_0 Ich konnte es nicht glauben, bis ich die Aufnahme nochmal genau zugehört habe. Und ja, Sie haben recht: ich hab's verkackt, es klingt wie \"w\". Gemeint war aber \"Mühlbeyer\". Ein Ganz unerwarteter Fehler.", "created_utc": "1589967009.0", "edited": "False", "id": "fr8429k", "is_submitter": "True", "link_id": "t3_glyhcm", "parent_id": "t1_fr675qf", "score": "1", "subreddit": "JudgeMyAccent", "subreddit_id": "t5_2ufiq"}, {"author": "NaJaEgal", "body": "Danke für die ausführliche Antwort! Das ist sehr hilfreich und genau das, worauf ich hier gehofft habe: Fehler die ich nicht selber merken kann. \n\nVor einem Jahr wurde mir gesagt, dass meine Umlaute am schlechtesten klingen. Könnten Sie bitte auch kurz darüber kommentieren? Klingen sie immer noch seltsam, oder sind sie inzwischen in Ordnung?\n\nUnd vielen Dank nochmal.", "created_utc": "1589906544.0", "edited": "False", "id": "fr5d1h1", "is_submitter": "True", "link_id": "t3_glyhcm", "parent_id": "t1_fr596xu", "score": "1", "subreddit": "JudgeMyAccent", "subreddit_id": "t5_2ufiq"}, {"author": "NaJaEgal", "body": "Es freut mich sehr, das zu lesen :)\n\nIch komme aus Russland und lerne Deutsch seit drei Jahren. Ich habe mir wirklich die Mühe gegeben, ganz von Anfang an an meiner Aussprache zu arbeiten. Forvo.com steht bei mir unter den meist besuchten Webseiten. Außerdem habe ich irgendwo mal einen Ratschlag gelesen, man sollte auf der Sprache die man lernt sehr laut sprechen, um seine Fehler gut zu merken. Das hat auch anscheinend geholfen :)", "created_utc": "1589807120.0", "edited": "1589819803.0", "id": "fr0ulw5", "is_submitter": "True", "link_id": "t3_glyhcm", "parent_id": "t1_fr0sbwb", "score": "1", "subreddit": "JudgeMyAccent", "subreddit_id": "t5_2ufiq"}, {"author": "NaJaEgal", "body": "[here](https://www.reddit.com/r/de/comments/f3p5q2/wenn_merz_jetzt_doch_wieder_kanzlerkandidat_wird/fhoiwwh?utm_source=share&utm_medium=web2x)", "created_utc": "1581768758.0", "edited": "False", "id": "fhophqa", "is_submitter": "False", "link_id": "t3_f3p5q2", "parent_id": "t1_fhn6a3r", "score": "2", "subreddit": "de", "subreddit_id": "t5_22i0"}, {"author": "NaJaEgal", "body": "I remember getting used to English punctuation, when I started using dashes and omitting commas everywhere in my mother tongue (Russian). There's an absurd amount of dashes in classical English books.\n\nNow I'm learning German and getting used to its punctuation. At that point I just gave up on trying to remember punctuation rules for each language.\n\nUnd ja, ich versuche es, Deutsch zu sprechen, ich, Tochter der Dame mit fragwürdigem Beruf.\n\nAls ich English Zeichensetzung lernte, fing ich an, Gedankenstriche überall im Russischen (meine Muttersprache) zu benutzen. Kommas, hingegen, ließ ich fort. Die Menge der Gedankenstriche in klassischen englischen Büchern ist einfach absurd.\n\nJetzt lerne ich Deutsch und dessen Zeichensetzung. Zurzeit habe ich es aufgegeben mich an die Regeln der Zeichensetzung für jede Sprache zu erinnern.", "created_utc": "1580891657.0", "edited": "False", "id": "fgld4t3", "is_submitter": "False", "link_id": "t3_eyrz8d", "parent_id": "t1_fgjalgd", "score": "4", "subreddit": "de", "subreddit_id": "t5_22i0"}, {"author": "NaJaEgal", "body": "for the words", "created_utc": "1578167212.0", "edited": "False", "id": "fd4g7hy", "is_submitter": "False", "link_id": "t3_ejwoiz", "parent_id": "t1_fd463b4", "score": "14", "subreddit": "nottheonion", "subreddit_id": "t5_2qnts"}, {"author": "NaJaEgal", "body": "Das sieht nach [Reverso Context](https://context.reverso.net/%C3%BCbersetzung/).", "created_utc": "1576561802.0", "edited": "False", "id": "fb6vddy", "is_submitter": "False", "link_id": "t3_ebg061", "parent_id": "t1_fb63i9l", "score": "4", "subreddit": "de", "subreddit_id": "t5_22i0"}, {"author": "NaJaEgal", "body": "&#x200B;\n\n[nonante](http://www.itchyfeetcomic.com/2013/05/four-twenties-and-thirteen.html#.XZbxOVUzbIV)", "created_utc": "1570173461.0", "edited": "False", "id": "f2e0gve", "is_submitter": "False", "link_id": "t3_dcn950", "parent_id": "t1_f29a9j4", "score": "1", "subreddit": "de", "subreddit_id": "t5_22i0"}, {"author": "NaJaEgal", "body": "Noch eine Empfehlung:  \"*Das Schlafbuch. Warum wir schlafen und wie es uns am besten gelingt*.\" von Peter Spork.", "created_utc": "1569900962.0", "edited": "False", "id": "f22zbbd", "is_submitter": "False", "link_id": "t3_dbj2l1", "parent_id": "t1_f22x3t8", "score": "4", "subreddit": "de", "subreddit_id": "t5_22i0"}, {"author": "NaJaEgal", "body": "> a random religious person going to another country\n\nYou do realize that Siberia is a part of Russia, don't you?..", "created_utc": "1569160908.0", "edited": "False", "id": "f13imyb", "is_submitter": "False", "link_id": "t3_d7o9ao", "parent_id": "t1_f13fuv0", "score": "7", "subreddit": "nottheonion", "subreddit_id": "t5_2qnts"}, {"author": "NaJaEgal", "body": "Das r/ deutsche Wort für subreddit ist Unterlases.", "created_utc": "1564552332.0", "edited": "False", "id": "eviz4aq", "is_submitter": "False", "link_id": "t3_cjuw2t", "parent_id": "t1_evi266q", "score": "2", "subreddit": "de", "subreddit_id": "t5_22i0"}, {"author": "NaJaEgal", "body": "Und auch:  [https://xkcd.com/1145/](https://xkcd.com/1145/)", "created_utc": "1556975762.0", "edited": "False", "id": "emheipk", "is_submitter": "False", "link_id": "t3_bkal7q", "parent_id": "t1_emgrubv", "score": "1", "subreddit": "de", "subreddit_id": "t5_22i0"}, {"author": "NaJaEgal", "body": "Thanks :-)", "created_utc": "1553530558.0", "edited": "False", "id": "ejcik75", "is_submitter": "True", "link_id": "t3_b5bs0f", "parent_id": "t1_ejchzjd", "score": "2", "subreddit": "JudgeMyAccent", "subreddit_id": "t5_2ufiq"}, {"author": "NaJaEgal", "body": "Абсолютно нативный звук. Из-за пауз просто создаётся впечатление, что человек читает попутно отвлекаясь на другую открытую вкладку в браузере или на то, чтобы прочитать сообщения в чате. Но ощущения, что вы не из России у меня не возникло.", "created_utc": "1553143924.0", "edited": "False", "id": "ej0mh76", "is_submitter": "False", "link_id": "t3_b29ryp", "parent_id": "t3_b29ryp", "score": "1", "subreddit": "JudgeMyAccent", "subreddit_id": "t5_2ufiq"}, {"author": "NaJaEgal", "body": "I. Just talking - sounded much better than reading a poem. Everything is understandable, though the accent is obvious. Also, minor issues with the position of stress in some words.\n\n* \"я люблю\" sounded like \"я лУблю\", you should have palatalized \"л\" sound more;\n* \"в Университете\" - \"р\" does not sound Russian here. You did the good job with \"p\"s in other places, though;\n* \"говорю по-русски\" sounded nasalized and sort of crumpled up. As if not being perfect in Russian makes you self-conscious (which it shouldn't =) ) and you try to get over with this phase as fast as possible.\n\nII. Reading a poem - there were a number of places where I had a hard time guessing what is being said. I had to google the poem to understand these words. I marked them with &, so that you may know where a native Russian speaker would most probably not understand you at all (unless he already knows this poem, of course).\n\n* & \"то змейкой\" sounds like \"тот смеикой\", \"тот с меякой\",... ??? There are several reasons for that:\n\n1. A stray \"т\" sound: \"тоТ\";\n2. \"з\" should sound like \"з\", not \"c\";\n3. Short i in \"ей\" should be short, and it should be i, not \"е\" or \"я\";\n4. The stress is on \"е\": \"змЕйкой\", not on о \"змейкОй\".\n\n* \"сердца\" - \"р\" sounds a bit odd.\n* & \"то целые\" sounds like \"то цилы\":\n\n1. \"е\" in \"цЕлые\" should sound like half-open \"э\" sound here;\n2. the last \"e\" sound should not be omitted:\"целыЕ\".\n\n* & \"то в инее\" sounds like \"товини\":\n\n1. \"е\" should be more open not to sound like \"и\";\n2. \"ее\" is NOT one long \"e\", try to pronounce \"то в ине\" and then add an additional \"е\", the way you pronounce it when you recite an alphabet.\n\n* & \"почудится\" sounds like \"почуРьтся\";\n* & \"в дрёме\" sounds like \"в дрОме\".\n* \"умеет\" sounds like \"умИт\" - same as with \"инее\";\n* & \"рыдать\" sounds like \"рирють\" - it seems like you have problems with \"д\";\n* & \"в молитве\" sounds like \"в маладве\";\n* \"угадатЬ\" - \"т\" should be palatalized;\n\nI'm not an expert on accents, but I would say that you sound like you are from one of the Baltic states.", "created_utc": "1553142557.0", "edited": "1553143265.0", "id": "ej0l520", "is_submitter": "False", "link_id": "t3_b2n8ux", "parent_id": "t3_b2n8ux", "score": "2", "subreddit": "JudgeMyAccent", "subreddit_id": "t5_2ufiq"}]