[{"author": "NoongarGal", "body": "Polly Coffee Bar in the Cultural Centre in the city. I used to enjoy their sandwiches (I worked nearby), but I stopped going when I saw how mean the owners were to staff (usually female backpackers who had just moved to Perth), and they were always firing and hiring new people. It made me uncomfortable seeing other women treated like that. Most of my other colleagues also arrived at the same conclusion.\n\nWe all switched to Livingstone's Urban Jungle instead as they're genuinely kind and treat their staff very well", "created_utc": "1667030258.0", "edited": "False", "id": "iu82yyn", "is_submitter": "False", "link_id": "t3_yg8vt1", "parent_id": "t3_yg8vt1", "score": "17", "subreddit": "perth", "subreddit_id": "t5_2r78m"}, {"author": "NoongarGal", "body": "Yes, I totally get this. I have recently gone back to my original career path of heritage because it's so much more enjoyable work than middle management. I love piecing together different maps and letters and documents from various archives to understand an event that happened in the past. Also, I felt similarly when I used to rock climb- figuring out the puzzle of how to move my body to get to the top of the wall. \n\nBoth activities are conducive for \"flow states.\"", "created_utc": "1665999200.0", "edited": "False", "id": "isnkyuy", "is_submitter": "False", "link_id": "t3_y5zm20", "parent_id": "t3_y5zm20", "score": "5", "subreddit": "CPTSD", "subreddit_id": "t5_2vvid"}, {"author": "NoongarGal", "body": "I know what you mean OP. I couldn't fathom withholding items like that unnecessarily from a child. \n\nWhile I technically had things to enjoy, I have a fear of enjoying things, though am still not sure what it stems from. But the idea of sitting down to really enjoy something for myself feels selfish and lazy. Every time I try, ideas of things I can do that are more productive or useful crowd out my drive to enjoy.", "created_utc": "1665873597.0", "edited": "False", "id": "ish0mxl", "is_submitter": "False", "link_id": "t3_y4xoug", "parent_id": "t3_y4xoug", "score": "4", "subreddit": "CPTSD", "subreddit_id": "t5_2vvid"}, {"author": "NoongarGal", "body": "Wow, this is the first time I'm hearing about NARM and the spiritualizing subtype makes sense for a lot of our family. We're Aboriginal and it's commonly acknowledged that keeping it spiritual is how we survive", "created_utc": "1665872962.0", "edited": "False", "id": "isgz86z", "is_submitter": "False", "link_id": "t3_y4pdzp", "parent_id": "t1_isfbu8t", "score": "3", "subreddit": "CPTSD", "subreddit_id": "t5_2vvid"}, {"author": "NoongarGal", "body": "I'm sorry to hear that you and your sister are going through something quite similar with your mum. I hope you are able to find a way to talk to her that you feel comfortable with.\n\nJust as an update and potential idea, my mum seems to also have ADHD. I have many ADHD-like symptoms due to c-PTSD (from an unloving/abusive childhood), and am encouraging us both to get tested for ADHD. I'm hoping that through this process, she will then get access to help that is more suitable for neurodivergence", "created_utc": "1665706900.0", "edited": "False", "id": "is86fyu", "is_submitter": "True", "link_id": "t3_y1ny3d", "parent_id": "t1_irz8ki6", "score": "1", "subreddit": "raisedbyautistics", "subreddit_id": "t5_3ccgb"}, {"author": "NoongarGal", "body": "This exactly. The active sabotaging and taking over any time I tried to learn how to cook. It's taken several years and many cookbooks and videos to love cooking by myself and for myself. But I still get so much anxiety cooking around and for other people. Cooking for my elderly grandmother has been nice exposure b/c I drop meals off to her and then she gives compliments over the phone.", "created_utc": "1665467786.0", "edited": "False", "id": "iruxcje", "is_submitter": "False", "link_id": "t3_xyrvp8", "parent_id": "t1_irifkch", "score": "1", "subreddit": "CPTSDmemes", "subreddit_id": "t5_oa0fa"}, {"author": "NoongarGal", "body": "I've suspected for awhile that my mum might have BPD, but the parents spoken about in the raisedbyborderline community really fit the personality of my narcissistic stepdad more than my mum. The caregiver role expected of me towards my mum was the same though. Also walking on eggshells, lack of emotional regulation, oversharing personal details, etc. And there's also the cPTSD I feel now. I find communities like that really validating for how I'm coping/trying to understand things now as an adult. \n\n But there were always things about my mum that I couldn't place my finger on and just felt really odd and out of place. It's not until my partner (who is a clinical psychologist) met my mum and started spending time with her that he pointed out that while she has some BPD traits, he wouldn't be surprised if she were on the spectrum. That really shocked me at first, but it makes much more sense and I can actually see it now.\n\nI wish there were more support options out there where our voices and stories could be heard without being shamed. For example, there's a lot out there for both people with BPD and people who have been abused by people with BPD; resources for both people with ADHD and people who have challenges understanding how to live with someone who has ADHD; etc.", "created_utc": "1665464060.0", "edited": "False", "id": "irus6xc", "is_submitter": "False", "link_id": "t3_y0vsdf", "parent_id": "t3_y0vsdf", "score": "3", "subreddit": "raisedbyautistics", "subreddit_id": "t5_3ccgb"}, {"author": "NoongarGal", "body": "Sorry for a late response- I had to take a break from online! \n\nI usually throw pillows at my couch as hard as possible. Throwing things feels great. Sometimes it's just throwing sticks at the ground. Sometimes I stomp my feet on the ground and curse/scream out loud like a child. \n\nOnce an old housemate was getting rid of damaged shelves and we both smashed the shelves to pieces with our hammers. That probably felt the best. I've thought that kickboxing or drumming might be good as well.", "created_utc": "1665399337.0", "edited": "False", "id": "irqwamc", "is_submitter": "False", "link_id": "t3_xw7os2", "parent_id": "t1_ir7p8zj", "score": "1", "subreddit": "CPTSD", "subreddit_id": "t5_2vvid"}, {"author": "NoongarGal", "body": "I know what you mean. Been going through an anger cycle for the past week. I've found lately that the safer I feel in my home life, the more my deep childhood anger about what happened in the past feels safe to come out. It comes and go, sometimes a few days or a week at a time.\n\nThe most important thing is how you transmute that anger. Anger itself isn't bad. And we're not bad people for feeling anger, especially with what's happened. It's a healthy response and can be helpful for pinpointing where we've been wronged in the past. I find it really useful to have a healthy space and time to really feel the anger and let it out without hurting others. \n\nAre there physical things you do to feel and let the anger move through you?", "created_utc": "1664980899.0", "edited": "False", "id": "ir5lnj7", "is_submitter": "False", "link_id": "t3_xw7os2", "parent_id": "t3_xw7os2", "score": "4", "subreddit": "CPTSD", "subreddit_id": "t5_2vvid"}, {"author": "NoongarGal", "body": "Aborigine has been historically used for many years. It was used abusively in colonisation. It wasn't the name we called ourselves. We called ourselves according to our own groups before colonsiation- Noongar, Yamaji, Wongi, Yawuru, etc. When Aborigine was used in the past by colonisers, it was often in combo with very horrible slurs or by government officials telling us what to do. \n\nSo we took that power away by saying that we are to be called Aboriginal & Torres Strait Islander people, or the tribe and clan we come from. It's a nuanced difference, but it sounds much better to us than the nasally Aussie accent saying \"aBOrigiNEES\" and all of the racism that's loaded into that word. \n\nSounds like the museum you went to was very outdated and didn't do any community consultation.", "created_utc": "1663376151.0", "edited": "False", "id": "ioqn6b2", "is_submitter": "False", "link_id": "t3_xfk4g1", "parent_id": "t1_ionhmgy", "score": "2", "subreddit": "Archaeology", "subreddit_id": "t5_2qmyp"}, {"author": "NoongarGal", "body": "ATSIMA (Aboriginal & Torris Strait Islander Mathematics Alliance) has some great learning resources. They're a lovely, very hard working team of Aboriginal mathematicians and teachers who create resources for school children. You might be able to pull some concepts out from them. https://atsima.com/resources/", "created_utc": "1663375429.0", "edited": "False", "id": "ioqlogu", "is_submitter": "False", "link_id": "t3_xfk4g1", "parent_id": "t1_ionfsha", "score": "2", "subreddit": "Archaeology", "subreddit_id": "t5_2qmyp"}, {"author": "NoongarGal", "body": "\nThoughts as an Australian Aboriginal person and anthropologist: not culturally safe for an Indigenous person who would view it (they may have assumed no Indigenous people would see it). \n\nNot appropriate in any context. I would never display an Indigenous skull (replica or not). It's incredibly insulting to any Indigenous group. Especially given how many of our ancestors' remains are still abroad from the days of bone collectors. \n\nCaucasians are closer to Neanderthals anyways. \n\n'Aborigine' is an outdated and offensive term.", "created_utc": "1663316232.0", "edited": "False", "id": "ion29m6", "is_submitter": "False", "link_id": "t3_xfk4g1", "parent_id": "t3_xfk4g1", "score": "241", "subreddit": "Archaeology", "subreddit_id": "t5_2qmyp"}, {"author": "NoongarGal", "body": "My partner used to do this all the time and it caused me so much anxiety. He got brake checked a couple times when we visited the US and it's not nearly as frequent now. I don't agree with brake checking, but am glad to not be riding up people's asses in traffic!", "created_utc": "1663313843.0", "edited": "False", "id": "iomzfub", "is_submitter": "False", "link_id": "t3_xeso8k", "parent_id": "t3_xeso8k", "score": "1", "subreddit": "perth", "subreddit_id": "t5_2r78m"}, {"author": "NoongarGal", "body": "Dingo in Noongar: dwert \n\nIn Australia on Noongar nation, we traditionally had dingoes. Dingoes don't bark, but they do howl. Many of our animals have onomatopoeiac names. If you hear a dingo howl and chat, you can hear it saying its name (dweeeeeerrrt).", "created_utc": "1662966201.0", "edited": "False", "id": "io3fvbu", "is_submitter": "False", "link_id": "t3_xa1qtp", "parent_id": "t3_xa1qtp", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "NoongarGal", "body": "Hei! Hyggelig å treffer deg, Daniel. Jeg heter Jordi, og jeg er kommer fra Australia. Jeg vil gjerne bor til Norge.", "created_utc": "1662964910.0", "edited": "False", "id": "io3ea66", "is_submitter": "False", "link_id": "t3_x25sq2", "parent_id": "t1_inuq75d", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "NoongarGal", "body": "I'm a poet and was drawn to learning Italian for its beauty. I've paused it though to learn my own Indigenous language (Noongar) and it suits my everyday mindset much better. It's typically used with other Noongars who are quite aware of what's already happening around you or can infer what you're alluding to. Noongar is also a poetic language, but there's less \"stuff\" involved.", "created_utc": "1662963680.0", "edited": "False", "id": "io3cpvl", "is_submitter": "False", "link_id": "t3_xbi6cm", "parent_id": "t3_xbi6cm", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "NoongarGal", "body": "Those poor people are still stuck holding signs on the side of the road for the cyclists", "created_utc": "1661765947.0", "edited": "False", "id": "im8j0co", "is_submitter": "False", "link_id": "t3_wztskt", "parent_id": "t1_im50x55", "score": "-1", "subreddit": "perth", "subreddit_id": "t5_2r78m"}, {"author": "NoongarGal", "body": "Oh yeah? I've been trying to make friends with my anxiety for years, and this is certainly helping", "created_utc": "1661740991.0", "edited": "False", "id": "im7jvas", "is_submitter": "True", "link_id": "t3_x0ce40", "parent_id": "t1_im7j3a8", "score": "1", "subreddit": "AdultBreastfeeding", "subreddit_id": "t5_2wtoi"}, {"author": "NoongarGal", "body": "I never noticed that before! Happy Cake Day!", "created_utc": "1657958364.0", "edited": "False", "id": "igdcjwg", "is_submitter": "True", "link_id": "t3_w090o9", "parent_id": "t1_igd7ii7", "score": "6", "subreddit": "StardewValley", "subreddit_id": "t5_2wb7y"}, {"author": "NoongarGal", "body": "I'm glad someone got it!", "created_utc": "1657954048.0", "edited": "False", "id": "igd6rvr", "is_submitter": "True", "link_id": "t3_w090o9", "parent_id": "t1_igd1988", "score": "24", "subreddit": "StardewValley", "subreddit_id": "t5_2wb7y"}, {"author": "NoongarGal", "body": "What a great idea! I would love to contribute to something like this, however I'm Australian-American. My mum wasn't able to have an abortion in time because the services weren't friendly for her as an Indigenous woman, and info on options was hard to access. My grandmother wasn't able to get a tubal ligation bc of her catholic doctor. My abortion was a huge moment of self-determination as an Indigenous woman", "created_utc": "1657789518.0", "edited": "False", "id": "ig3t3ou", "is_submitter": "False", "link_id": "t3_vybb9e", "parent_id": "t3_vybb9e", "score": "2", "subreddit": "Feminism", "subreddit_id": "t5_2qr7i"}, {"author": "NoongarGal", "body": "Is it weird that I took this as a game hint that there were some sweet shoes in someone's garbage? I spent that evening going through all the bins and was disappointed by the lack of shoes.", "created_utc": "1657720138.0", "edited": "False", "id": "ifzox6m", "is_submitter": "False", "link_id": "t3_vxqxzb", "parent_id": "t3_vxqxzb", "score": "653", "subreddit": "StardewValley", "subreddit_id": "t5_2wb7y"}, {"author": "NoongarGal", "body": "I didn't realise you can't walk through green beans (and a number of other plants). I planted many, many green beans at the start of a season, only to end up watching all of the middle ones flourish and go unpicked until the last day of the season. I had to cut down all the outside bean plants to get to the inside ones.", "created_utc": "1657629930.0", "edited": "False", "id": "ifum9sm", "is_submitter": "False", "link_id": "t3_vww236", "parent_id": "t3_vww236", "score": "7", "subreddit": "StardewValley", "subreddit_id": "t5_2wb7y"}, {"author": "NoongarGal", "body": "Yes for decorating others' rooms! I thought it would be a nice community service to spruce up the town with the decorations from Gunther. E.g., the sloth skeleton is slowly being assembled outside of the library/museum.", "created_utc": "1657629496.0", "edited": "False", "id": "ifulfp1", "is_submitter": "False", "link_id": "t3_vww236", "parent_id": "t1_ifsts6q", "score": "3", "subreddit": "StardewValley", "subreddit_id": "t5_2wb7y"}, {"author": "NoongarGal", "body": "Reminds me of the Portlandia skit- We Can Pickle That! https://m.youtube.com/watch?v=yYey8ntlK_E", "created_utc": "1656295322.0", "edited": "False", "id": "idvonxt", "is_submitter": "False", "link_id": "t3_vl7y57", "parent_id": "t3_vl7y57", "score": "2", "subreddit": "StardewValley", "subreddit_id": "t5_2wb7y"}, {"author": "NoongarGal", "body": "Wow, it's very interesting what time and age reveals about people's personalities. I can imagine there would have been some complex emotions there when your father was missing you at that family event. I wish you the best of luck with navigating those sorts of situations. \n\nI used to feel very similarly about my mum when I was younger and would also plead with her to leave our dad. I couldn't understand her rationale in staying. Now that I'm older, I can see more of the complexities of her being an immigrant and on her own in the country without her family. \n\nYour parents keeping each other in safety from growing sounds very similar to my parent's dynamic. They would criticise each other, but were the worst for teaming up and criticising others they had perceived to have wronged them. This includes their children at various times. I was the black sheep for many years, and apparently caused their marital issues. \n\nYou're certainly right about having nice moments, but there always being a layer of conditionality. They certainly knew how to string me and my brother along for crumbs of \"love.\"", "created_utc": "1652778784.0", "edited": "False", "id": "i8xca2g", "is_submitter": "True", "link_id": "t3_urg005", "parent_id": "t1_i8x4ha0", "score": "1", "subreddit": "raisedbynarcissists", "subreddit_id": "t5_2we9n"}, {"author": "NoongarGal", "body": "I made it on my own for several years, finding safety and climbing to the top of all the goals I had for myself that my NDad said I'd never achieve without him. Then I got to the top of my career a year ago, and realised it's quite lonely up here. So I went back to therapy, adopted a cat, started a herb garden, and began cultivating kind, loving friendships and relationships with extended family. Life can be painfully hard some days, a bit meh most days, but the few days of joy- true, well deserved joy- are worth it a thousand times over", "created_utc": "1652767236.0", "edited": "False", "id": "i8wz3vc", "is_submitter": "False", "link_id": "t3_uqpxwx", "parent_id": "t3_uqpxwx", "score": "2", "subreddit": "raisedbynarcissists", "subreddit_id": "t5_2we9n"}, {"author": "NoongarGal", "body": "Holy cow. What a horrible, invalidating thing to say to a kid who needs a hug and some love. \n\nIm writing a book about healing from experiences like this and just finished writing the section on how my narcissist stepdad would make me look up words like \"honesty\" and \"respect\" in the dictionary and read them out loud anytime I misremembered something or told a white lie. \n\nOnce when I was six, he made me pull out the dictionary and read \"honesty\" out loud. After that, he said that he can't love somebody who keeps lying to him, and I have a lot of work to do in order to earn his trust back. This was after lying about something like not brushing my teeth for a full two minutes.", "created_utc": "1652766526.0", "edited": "False", "id": "i8wy61w", "is_submitter": "False", "link_id": "t3_urdlyc", "parent_id": "t3_urdlyc", "score": "3", "subreddit": "raisedbynarcissists", "subreddit_id": "t5_2we9n"}, {"author": "NoongarGal", "body": "I used to be like this a lot with sweet food, and sometimes still am when I get \"caught\". But am generally more aware now, and kind to the self as it's happening. For example, I used to try and suppress the craving for as long as possible, and then would eat something sweet and have these automatic self-punishing thoughts of \"Bad! Bad! Bad!\" \n\nNow, it's more like \"Here we are, this is sweet. We're eating maple syrup on pancakes. Wow we really craved this earlier, and here we are eating it.\" \n\nThrough meditation and therapy, I've realised what the context is that triggers the cravings, and sometimes am able to dig deeper into the awareness of what the core need behind the craving is. \n\n90% of the time, the need is comfort, and I'm able to self-provide that or reach out to someone for it without self-judgment", "created_utc": "1651915544.0", "edited": "False", "id": "i7nqo0v", "is_submitter": "False", "link_id": "t3_ujvdd6", "parent_id": "t3_ujvdd6", "score": "1", "subreddit": "Meditation", "subreddit_id": "t5_2qnc9"}, {"author": "NoongarGal", "body": "Firstly, you need to let your GF know everything is fine, but you're just working through some stuff from your past and it's difficult. Vague, but technically true. \n\nThen, investigate further why you went into her journal in the first place.  Are there trust issues within yourself that need to be addressed? Get out of the house, get some air, get some perspective.\n\nNext, forgive yourself for what you did. It's done. You know it was wrong and can't go back now. The shame will eat you up otherwise and is punishment of its own. \n\nAfter this, picture the hard work your GF is doing on herself, and make a promise from within your heart that you won't go into that journal again. Think of it like hiding out in one of her therapy sessions. She desperately needs that space to heal. \n\nAlso, crushes are very normal and harmless. My therapist says sometimes we have crushes on people's physical and mental qualities that we would like for ourselves. Take it as a compliment to the good friends you cultivate.", "created_utc": "1651914378.0", "edited": "False", "id": "i7npeu7", "is_submitter": "False", "link_id": "t3_uk3zfc", "parent_id": "t3_uk3zfc", "score": "1", "subreddit": "relationships", "subreddit_id": "t5_2qjvn"}, {"author": "NoongarGal", "body": "Re: your update- that lady deserves to know what just happened. If she can't remember it, that's a bad sign. Pick your timing, but don't leave it too long. Sounds like an overall shitty night for you and her. Sorry to hear this happened to you at your own place OP", "created_utc": "1646572433.0", "edited": "False", "id": "hzkm8p6", "is_submitter": "False", "link_id": "t3_t7j1r8", "parent_id": "t3_t7j1r8", "score": "1", "subreddit": "TrueOffMyChest", "subreddit_id": "t5_2yuqy"}, {"author": "NoongarGal", "body": "NTA. Your boyfriend is the asshole. \n\nMy brother and I were raised in a situation like this and fast forward 20 years- we have years of expensive trauma therapy ahead of us, and my mum is going through an expensive divorce now and regretting how she let him parent us. Financial support does not equal getting to verbally and emotionally shit on children.\n\nYour kids, your loves, your boundaries.", "created_utc": "1646117354.0", "edited": "False", "id": "hyvtxdr", "is_submitter": "False", "link_id": "t3_t3hv1v", "parent_id": "t3_t3hv1v", "score": "1", "subreddit": "AmItheAsshole", "subreddit_id": "t5_2xhvq"}, {"author": "NoongarGal", "body": "Live in Australia and was under light sedation for the IUD insertion, thank God. Especially after hearing other women's stories. \n\nJust got mine put in 2 days ago and was not prepared for the after pain. It hurts to walk, pee, sit up too quickly, sit for too long, squat, sneeze and cough, etc. I think my pelvic floor muscles are very tense after the insertion. I'm hopeful that if I can train them to relax, the pain won't be as bad", "created_utc": "1645833136.0", "edited": "False", "id": "hyg6utc", "is_submitter": "False", "link_id": "t3_t1878e", "parent_id": "t3_t1878e", "score": "3", "subreddit": "Feminism", "subreddit_id": "t5_2qr7i"}, {"author": "NoongarGal", "body": "Done! He gave a big long boi stretch after haha", "created_utc": "1645782699.0", "edited": "False", "id": "hyd2ja8", "is_submitter": "True", "link_id": "t3_t0zpn9", "parent_id": "t1_hyd15nd", "score": "4", "subreddit": "aww", "subreddit_id": "t5_2qh1o"}, {"author": "NoongarGal", "body": "There's also a woman at the Farmers Markets on Manning who runs a Mexican food and salsa stand called \"Malena's Kitchen.\" Her molé sauce is beautiful! Have also heard good things about the Spice Wagon", "created_utc": "1645778481.0", "edited": "False", "id": "hycxal2", "is_submitter": "False", "link_id": "t3_t0puxn", "parent_id": "t3_t0puxn", "score": "3", "subreddit": "perth", "subreddit_id": "t5_2r78m"}, {"author": "NoongarGal", "body": "That looks like a native plant that's getting too much sun and heat. I'd put a shade cloth over it for a week and see if it helps. There are some native plants that prefer dappled sunshine as they belong under a tree canopy", "created_utc": "1645405380.0", "edited": "False", "id": "hxrwehx", "is_submitter": "False", "link_id": "t3_stl498", "parent_id": "t3_stl498", "score": "1", "subreddit": "GardeningAustralia", "subreddit_id": "t5_3342f"}, {"author": "NoongarGal", "body": "Oh goodness, this is exactly what happened to me last night. I felt like I was going mad and had to take space away from my bf to try and figure out what the heck was going on. I love your therapist's idea for a little box of comforts.", "created_utc": "1639392951.0", "edited": "False", "id": "hod6cyp", "is_submitter": "False", "link_id": "t3_rex4jq", "parent_id": "t1_hocos2b", "score": "3", "subreddit": "raisedbynarcissists", "subreddit_id": "t5_2we9n"}, {"author": "NoongarGal", "body": "As someone with a chronic illness, I appreciate this comment so much. The toxic positivity around some of the alternative terms seem to have been made by only one specific group of disabled people given how many others it leaves out. Can also relate to the brain fog and how difficult things like that can make remembering words and phrases.\n\nI feel like, if we are, with our disabilities, doing the best we can within our limits to treat others as fellow human beings, calling them what they prefer to our best ability, then that's amazing. And I think people who don't have these challenges, can have a bit more sympathy for how hard we are trying, and to be more forgiving when there are mistakes made.\n\nAs an Indigenous woman, I've had many people who do not know how to correctly refer to me (due to ignorance), treat me as more of an equal than those who know all the right things to say. Kindness and equality are matters of the heart, and if you're coming from a good place, people will feel that. We're all on learning journeys here.", "created_utc": "1638494985.0", "edited": "False", "id": "hn0dy58", "is_submitter": "False", "link_id": "t3_r77rty", "parent_id": "t1_hmxza2t", "score": "7", "subreddit": "Feminism", "subreddit_id": "t5_2qr7i"}, {"author": "NoongarGal", "body": "Keen to join! It's summer down here in Aus now, so would like to increase my morning meditations to 20 minutes and focus on just listening to sound, like the birds.", "created_utc": "1638318123.0", "edited": "False", "id": "hmqdn19", "is_submitter": "False", "link_id": "t3_r5xnrm", "parent_id": "t3_r5xnrm", "score": "3", "subreddit": "Meditation", "subreddit_id": "t5_2qnc9"}, {"author": "NoongarGal", "body": "I gave up dairy because I became lactose intolerant, but I didn't really notice much of a difference in my eczema. The biggest thing for me has been following a low FODMAP diet. If I have too many FODMAPS (like wheat, onion, or garlic), I'll have an eczema reaction within an hour. When I started the diet, my eczema mostly cleared up within a week. Changing the gut microbiome takes years, but removing food triggers should show results pretty quickly if those are indeed the triggers", "created_utc": "1636504329.0", "edited": "False", "id": "hk097bb", "is_submitter": "False", "link_id": "t3_qorps1", "parent_id": "t3_qorps1", "score": "1", "subreddit": "eczema", "subreddit_id": "t5_2rqqs"}, {"author": "NoongarGal", "body": "Mine said it a lot at the start, until I reminded him that I have a background in sociolinguistics and anthropology and am paid to listen and communicate well to all sorts of people. He then started blaming the phone and texting for everything 🙄", "created_utc": "1595844357.0", "edited": "False", "id": "fze21jm", "is_submitter": "False", "link_id": "t3_hy84hv", "parent_id": "t3_hy84hv", "score": "1", "subreddit": "BPDlovedones", "subreddit_id": "t5_33dd6"}, {"author": "NoongarGal", "body": "It probably isn't recommended, but I sent thru common signs of gaslighting and emotional abuse along with the \"receipts\" of him doing those things over text. And said honestly how hurtful, toxic, and unsafe the relationship was for me. Then I sent through links to types of therapy (like DBT) that would help him (w/o explicitly mentioning BPD), saying if he doesn't want to hurt someone like this again, he needs to work on himself. But then I finished it off with sending \"thank u next\" and blocking him on everything possible, so who knows? \n\nAll you can hope to do is plant the seeds for them to get help", "created_utc": "1595843815.0", "edited": "False", "id": "fze1inf", "is_submitter": "False", "link_id": "t3_hyb722", "parent_id": "t1_fzd0ula", "score": "2", "subreddit": "BPDlovedones", "subreddit_id": "t5_33dd6"}, {"author": "NoongarGal", "body": "I thought he was really anxious and codependent at first. Like everything got placed into other boxes- \"Oh, must be an anxious attachment style thing. That's just his ADHD. If I take the time to explain it really well, he'll get it.\" \n\nIt wasn't until I was having to explain 10+ times in one week why me leaving a covid-free place to fly into one with really bad covid rates for a vacation while I have a chronic illness and had just started a new job was a bad idea...and he kept pushing me to still do it every single day. I realised he didn't actually listen or care about me, just liked the idea of me. Took a couple more months to learn about BPD from a concerned friend", "created_utc": "1595843276.0", "edited": "False", "id": "fze1000", "is_submitter": "False", "link_id": "t3_hyh560", "parent_id": "t3_hyh560", "score": "3", "subreddit": "BPDlovedones", "subreddit_id": "t5_33dd6"}, {"author": "NoongarGal", "body": "I had been recovering fairly well from CFS (chronic fatigue syndrome) and fibromyalgia for a couple years before meeting my pwBPD. A couple months after dating, my health regressed.  Fatigue got really bad, pain got a lot worse, and I started having these intense muscle convulsions when I'd do guided meditations and yoga.\n\n It was like my body/mind would finally relax, and the stress was physically trying to release itself. Three weeks since ending it, and my energy is back up, pain calmed down, and the convulsions have entirely stopped. Stress can do some serious harm to the body", "created_utc": "1595776772.0", "edited": "False", "id": "fzb34d8", "is_submitter": "False", "link_id": "t3_hy5l4h", "parent_id": "t3_hy5l4h", "score": "4", "subreddit": "BPDlovedones", "subreddit_id": "t5_33dd6"}, {"author": "NoongarGal", "body": "It reminds me a lot of the Drama Triangle, an inverted triangle in which a victim is at the bottom point and persecutor and rescuer are on either side. In some cases, somebody actually is a victim and is being exposed to abuse (persecutor). In other cases, someone is enabling them to be a victim by rescuing or helping them. In BPD, the persecutor and rescuer can be the same person depending on how the pwBPD is feeling. The \"antidote\" to the Drama Triangle is usually coaching or mentoring- or in BPD, also therapy. That being said, the person in the victim position needs to want the help and to get out of that position.", "created_utc": "1595728542.0", "edited": "False", "id": "fz9f2gl", "is_submitter": "False", "link_id": "t3_hxy847", "parent_id": "t3_hxy847", "score": "6", "subreddit": "BPDlovedones", "subreddit_id": "t5_33dd6"}, {"author": "NoongarGal", "body": "7 days NC since doing the final account blocking. I'm doing really well without him, but I'm tempted to unblock the account just to see what the general gist is of what he's sending. I don't have any interest in talking to him, but the curiosity is getting high. Have decided to catch up with a friend today and then shut my phone off for the second half of today to get it out of my mind", "created_utc": "1595636540.0", "edited": "False", "id": "fz5d0nx", "is_submitter": "False", "link_id": "t3_hwyjmn", "parent_id": "t3_hwyjmn", "score": "2", "subreddit": "BPDlovedones", "subreddit_id": "t5_33dd6"}, {"author": "NoongarGal", "body": "Yep, same. Mine thought it might be Aspergers", "created_utc": "1595318376.0", "edited": "False", "id": "fyqvih8", "is_submitter": "False", "link_id": "t3_hurl9m", "parent_id": "t1_fyqi3g9", "score": "2", "subreddit": "BPDlovedones", "subreddit_id": "t5_33dd6"}, {"author": "NoongarGal", "body": "Dealing with this exact situation at the monent with an old friend. Not sure if his gf has BPD, but definitely is very controlling and manipulative. Had him drop me as a friend in the first few weeks while also lovebombing. He was shattered when he said we couldn't be friends anymore, but he still felt like he \"had no other choice\"", "created_utc": "1595234546.0", "edited": "False", "id": "fyn441a", "is_submitter": "False", "link_id": "t3_hu21z8", "parent_id": "t3_hu21z8", "score": "1", "subreddit": "BPDlovedones", "subreddit_id": "t5_33dd6"}, {"author": "NoongarGal", "body": "I don't think mine cheated- spent too much worried about himself and focusing on random projects in very unsustainable ways", "created_utc": "1595234227.0", "edited": "False", "id": "fyn3sxb", "is_submitter": "False", "link_id": "t3_hufot4", "parent_id": "t3_hufot4", "score": "2", "subreddit": "BPDlovedones", "subreddit_id": "t5_33dd6"}, {"author": "NoongarGal", "body": "Yes, this is exactly it. He's a fully grown adult and has the capability to get professional help and become more mindful of his behaviour, but instead chooses not to because it's easier in the short run to blame other people and take on a victim mentality. \n\nThat last paragraph is so good, thank you. It's really helpful to think of it that way", "created_utc": "1595126595.0", "edited": "False", "id": "fyiuf7w", "is_submitter": "True", "link_id": "t3_htid64", "parent_id": "t1_fyh9f5h", "score": "4", "subreddit": "BPDlovedones", "subreddit_id": "t5_33dd6"}, {"author": "NoongarGal", "body": "Good to know it does ease up! Already in keeping screenshots of the worst of the splitting I have been thinking \"Wtf did I get myself into. How was this okay?\" No regrets in doing it now- he hates boundaries, just wants total compliance. Onward and upward!", "created_utc": "1595126184.0", "edited": "False", "id": "fyitt5h", "is_submitter": "True", "link_id": "t3_htid64", "parent_id": "t1_fyh5448", "score": "3", "subreddit": "BPDlovedones", "subreddit_id": "t5_33dd6"}, {"author": "NoongarGal", "body": "Gee that's awful- it's crazy how they can split like that and then turn around and put blame on their SO for not just taking it. Definitely valuable to keep the receipts of how bad it got", "created_utc": "1595125984.0", "edited": "False", "id": "fyiti76", "is_submitter": "True", "link_id": "t3_htid64", "parent_id": "t1_fyh9npa", "score": "4", "subreddit": "BPDlovedones", "subreddit_id": "t5_33dd6"}, {"author": "NoongarGal", "body": "Yeah, I knew I would be ruthless in deleting while angry about the way he treated me, so took advantage of that. I think if I waited until today or later in NC, it would have been harder", "created_utc": "1595125774.0", "edited": "False", "id": "fyit6nn", "is_submitter": "True", "link_id": "t3_htid64", "parent_id": "t1_fyhh684", "score": "2", "subreddit": "BPDlovedones", "subreddit_id": "t5_33dd6"}, {"author": "NoongarGal", "body": "Yep, gotta stand my ground! Luckily, so far today, there's been nothing. I think the blocking was fairly comprehensive...", "created_utc": "1595125608.0", "edited": "False", "id": "fyisxik", "is_submitter": "True", "link_id": "t3_htid64", "parent_id": "t1_fyic5uy", "score": "2", "subreddit": "BPDlovedones", "subreddit_id": "t5_33dd6"}, {"author": "NoongarGal", "body": "I reallyyy like that saying- ultimately he needed something I couldn't give him, which was a therapist and parent figure combined. Such an unhealthy dynamic and set of expectations to put on someone who isn't professionally trained or getting paid", "created_utc": "1595125444.0", "edited": "False", "id": "fyisodt", "is_submitter": "True", "link_id": "t3_htid64", "parent_id": "t1_fyio4gp", "score": "3", "subreddit": "BPDlovedones", "subreddit_id": "t5_33dd6"}, {"author": "NoongarGal", "body": "Ah yes- shell shocked is the word I have been looking for to describe the feeling I've had lately. The heart needs time and self-love after dealing with shit like this. I can't even fathom dating anytime soon", "created_utc": "1595050366.0", "edited": "False", "id": "fyfrrbs", "is_submitter": "False", "link_id": "t3_ht2gmq", "parent_id": "t1_fyfbght", "score": "4", "subreddit": "BPDlovedones", "subreddit_id": "t5_33dd6"}, {"author": "NoongarGal", "body": "The comparing to exes- ugh gawd we barely went two days without a comparison. I also got a lot of \"But I only have pure intentions. Whatever I said, my intentions were good.\" And then he would conveniently forget what it was he actually said until I recalled it for him. But the intentions were good! *eye roll*", "created_utc": "1594709761.0", "edited": "False", "id": "fy0icph", "is_submitter": "False", "link_id": "t3_hqna5p", "parent_id": "t3_hqna5p", "score": "1", "subreddit": "BPDlovedones", "subreddit_id": "t5_33dd6"}, {"author": "NoongarGal", "body": "Just realised the intro song told us all the series plot: \n\"Find out:\nI was just a bad dream.\"\nAlso, \"For neither ever, nor never, Goodbye,\" Seems to on the nose for saying goodbye to two things that can't be", "created_utc": "1594181773.0", "edited": "False", "id": "fxa42al", "is_submitter": "False", "link_id": "t3_hgym50", "parent_id": "t3_hgym50", "score": "3", "subreddit": "DarK", "subreddit_id": "t5_2qj1h"}, {"author": "NoongarGal", "body": "I listen to a lot of guided meditations on Insight Timer. When the thoughts start running, I notice them, put on a meditation, and it helps to shift my thinking. If I'm at work, I write it all down. Hypnotherapy has been really helpful for trauma too, as it's deeply relaxing for the body and mind", "created_utc": "1593774087.0", "edited": "False", "id": "fwslrkb", "is_submitter": "False", "link_id": "t3_hkakbi", "parent_id": "t3_hkakbi", "score": "1", "subreddit": "BPDlovedones", "subreddit_id": "t5_33dd6"}, {"author": "NoongarGal", "body": ">scienceabc.com/nature...\n\nThere's a relationship between plant species and how much of each chlorophyll a and b type they have- that's a large part of what defines their colour as well as leaf design, age, and deficiencies. All in the article.\n\nOnce again, it's a general saying for practical purpose...which is why I linked further reading. I appreciate your comment, but for the sake of headline space/conciseness, how gardeners generally speak about plants (in light requirement levels), and it being something I honestly just learned, it's not going to be a true statement in every single case...but it is fairly useful for most of us", "created_utc": "1557017430.0", "edited": "False", "id": "emj2rig", "is_submitter": "True", "link_id": "t3_bkhmco", "parent_id": "t1_emis7w9", "score": "1", "subreddit": "todayilearned", "subreddit_id": "t5_2qqjc"}, {"author": "NoongarGal", "body": "Sure, that's in the article too. But there are limitations. You're not going to see an indoor ficus change its chlorophyll levels to the same level of a eucalypt and turn it into this full sun-loving, outdoor plant.", "created_utc": "1556984737.0", "edited": "False", "id": "emhquxt", "is_submitter": "True", "link_id": "t3_bkhmco", "parent_id": "t1_emgz2sg", "score": "1", "subreddit": "todayilearned", "subreddit_id": "t5_2qqjc"}, {"author": "NoongarGal", "body": "The simple saying in the heading comes at it from a practical gardening perspective in which lighter-coloured leaved plants would be put in places that get more sunlight and darker-coloured in darker spaces, and that this is due to differing chlorophyll requirements of different types of plants.", "created_utc": "1556954441.0", "edited": "1557037563.0", "id": "emgy9l7", "is_submitter": "True", "link_id": "t3_bkhmco", "parent_id": "t1_emgu5zf", "score": "1", "subreddit": "todayilearned", "subreddit_id": "t5_2qqjc"}, {"author": "NoongarGal", "body": "I agree- I think the plane crash story seems a little fishy. Zelda and Hilda look very concerned when Sabrina says the Weird Sisters hinted otherwise, and Madame Satan doesn't want Diana spilling any secrets while in limbo. Perhaps they both did really die in the plane crash, but that's not to say that it wasn't orchestrated or Edward was resurrected after in secret. There are so many before and after possibilities that we don't know yet", "created_utc": "1553472485.0", "edited": "False", "id": "ejaxzqm", "is_submitter": "False", "link_id": "t3_b4sgru", "parent_id": "t3_b4sgru", "score": "6", "subreddit": "AdventuresOfSabrina", "subreddit_id": "t5_3om6m"}, {"author": "NoongarGal", "body": "Could see Sabrina coming back as darker. It seems to be hinted at in the trailer too that she's different. Maybe it wouldn't be the Dark Lord or Lilith to bring her back, but Edward Spellman (who could still be alive somehow)", "created_utc": "1553413240.0", "edited": "False", "id": "ej93ydl", "is_submitter": "True", "link_id": "t3_b4gt9b", "parent_id": "t1_ej7ruh6", "score": "1", "subreddit": "AdventuresOfSabrina", "subreddit_id": "t5_3om6m"}, {"author": "NoongarGal", "body": "Really like this idea. There's certainly a parallel between courageous female protagonists and  authoritative masculinity. \n\nAlso it's a small detail, but the font for \"The Passion of Lucifer Morningstar\" is almost exactly the same as the one for \"The Passion of Joan of Arc\" movie poster- even the way they put the \"f\" inside the \"o\" for \"of.\" [https://en.wikipedia.org/wiki/The\\_Passion\\_of\\_Joan\\_of\\_Arc#/media/File:The\\_Passion\\_of\\_Joan\\_of\\_Arc\\_(1928)\\_English\\_Poster.png](https://en.wikipedia.org/wiki/The_Passion_of_Joan_of_Arc#/media/File:The_Passion_of_Joan_of_Arc_(1928)_English_Poster.png) \n\n&#x200B;\n\n&#x200B;", "created_utc": "1553412106.0", "edited": "False", "id": "ej93at4", "is_submitter": "True", "link_id": "t3_b4gt9b", "parent_id": "t1_ej7ap6d", "score": "2", "subreddit": "AdventuresOfSabrina", "subreddit_id": "t5_3om6m"}, {"author": "NoongarGal", "body": "I wouldn't mind them showing some of Hell/the underworld. Hopefully they have a bigger budget this season!", "created_utc": "1553337479.0", "edited": "False", "id": "ej6paxj", "is_submitter": "True", "link_id": "t3_b4gt9b", "parent_id": "t1_ej6ktq0", "score": "10", "subreddit": "AdventuresOfSabrina", "subreddit_id": "t5_3om6m"}, {"author": "NoongarGal", "body": "For anyone wondering what Lupercalia is, it's the less chaste, Roman precedent to Valentine's Day:\n\nhttps://www.google.com/amp/s/www.history.com/.amp/topics/ancient-rome/lupercalia ", "created_utc": "1553238766.0", "edited": "False", "id": "ej3ot8p", "is_submitter": "False", "link_id": "t3_b3uccn", "parent_id": "t3_b3uccn", "score": "2", "subreddit": "AdventuresOfSabrina", "subreddit_id": "t5_3om6m"}, {"author": "NoongarGal", "body": "I think Bran will be really key to ending the Army of the Dead, and it wouldn't surprise me if the Starks ended up having some connection to the Nights King. There's something odd there about the name (Winter  fell), a single line ruling a region for so long, the crypts, Jon not dying from frostbite, \"the North remembers\", etc. Maybe Bran will try and warg into the Night King only to get stuck as him. My partner has this crazy tinfoil theory Bran will be the last person left alive, will time travel back, warg into the 13th Lord Commander on the Wall and become the NK. Which would really be an ending without an ending. Me- I'm not sure they'll sum it all up in a way people will like", "created_utc": "1548851004.0", "edited": "False", "id": "efco4yk", "is_submitter": "False", "link_id": "t3_al5gb1", "parent_id": "t3_al5gb1", "score": "8", "subreddit": "andnowmyrewatchbegins", "subreddit_id": "t5_3o4xu"}, {"author": "NoongarGal", "body": "We PROUDLY SERVE Popeyes spicy tenders", "created_utc": "1546744859.0", "edited": "False", "id": "edcq9um", "is_submitter": "False", "link_id": "t3_acw284", "parent_id": "t1_edcmel2", "score": "3", "subreddit": "todayilearned", "subreddit_id": "t5_2qqjc"}, {"author": "NoongarGal", "body": "\"In 2009, when McShane woke up to a sandstorm so large it could be seen from space, the authorities called with a mission, to rescue a driver who had rolled his car somewhere in scorching expanse of sand and rock.\n\nWhile Sydney marvelled at the dusty haze that blanketed its harbour bridge, McShane spent the next 20 hours in the Simpson desert.\n\nDriving virtually blind, he had to change two tyres in the howling grit before bringing the injured traveller to safety.\"\n\nBloody hell what a trooper ", "created_utc": "1543892931.0", "edited": "False", "id": "eb1o3o1", "is_submitter": "False", "link_id": "t3_a2uocp", "parent_id": "t3_a2uocp", "score": "122", "subreddit": "todayilearned", "subreddit_id": "t5_2qqjc"}, {"author": "NoongarGal", "body": "Not the first time it happened either in the series. Rewatching Coven now, and Madison paints a pentagram on Kyle's body in blood during the Resurrection spell. I know there were a lot of satanic aspects in Coven though, like the snakes", "created_utc": "1543215816.0", "edited": "False", "id": "eahnrba", "is_submitter": "False", "link_id": "t3_9zux0j", "parent_id": "t1_eacg5y4", "score": "1", "subreddit": "AmericanHorrorStory", "subreddit_id": "t5_2spug"}, {"author": "NoongarGal", "body": "That's awesome you've had success with it! Limiting sugar intake does help too. My friend is a dietitian, so I've been asking her for help with it so far. I'm in the reintroduction phase now, and it is tricky. I'd probably want to see someone as well, as a lot of the free plans online are inaccurate. I've made up a basic reintroduction phase with some general guidance from my friend and the Monash App- if I can figure out how to post it here, I will", "created_utc": "1537699085.0", "edited": "False", "id": "e6heix8", "is_submitter": "True", "link_id": "t3_9i013d", "parent_id": "t1_e6gnttr", "score": "2", "subreddit": "eczema", "subreddit_id": "t5_2rqqs"}, {"author": "NoongarGal", "body": "[https://www.monashfodmap.com/blog/monash-low-fodmap-recipe-index/](https://www.monashfodmap.com/blog/monash-low-fodmap-recipe-index/)\n\n&#x200B;\n\nI'm a dairy free vegetarian on the diet- You can definitely get your protein on a low FODMAP diet! It does require a bit of planning though, as you can't eat as many beans and lentils. The site I linked has a wealth of vego recipes", "created_utc": "1537698641.0", "edited": "False", "id": "e6hebpa", "is_submitter": "True", "link_id": "t3_9i013d", "parent_id": "t1_e6g6rqo", "score": "1", "subreddit": "eczema", "subreddit_id": "t5_2rqqs"}, {"author": "NoongarGal", "body": "Sure! The diet vs disease website was helpful for understanding it:\n\n[https://www.dietvsdisease.org/diy-low-fodmap-diet/](https://www.dietvsdisease.org/diy-low-fodmap-diet/)\n\nThough the Monash University Low FODMAP app has been by far the most helpful because it gives such exact, accurate information and recipes. It's expensive, but definitely worth the money (and cheaper than a nutritionist if you decide not to go to one).\n\nAlso, the Monash Uni website has a lot of recipes, which is good because the diet can get a bit boring otherwise!", "created_utc": "1537627361.0", "edited": "False", "id": "e6frgwk", "is_submitter": "True", "link_id": "t3_9i013d", "parent_id": "t1_e6fqidy", "score": "3", "subreddit": "eczema", "subreddit_id": "t5_2rqqs"}, {"author": "NoongarGal", "body": "I tried to wean off of them before knowing what my triggers were, and had a really bad time. This is after using them for about 20 years on and off. It was a depressing several months, in which I was metaphorically and literally wrapped in cotton. Eventually the eczema did settle down a bit, but it was very uncomfortable.I did my best to follow the dermatologists' advice for the 10-14 day usage and then take a break, but sometimes it just wasn't enough. \n\nOnce I found out what my triggers were though, I've been able to only use them very sparingly and hardly need the steroids. ", "created_utc": "1537627011.0", "edited": "False", "id": "e6fr4kz", "is_submitter": "False", "link_id": "t3_9hjpaw", "parent_id": "t3_9hjpaw", "score": "1", "subreddit": "eczema", "subreddit_id": "t5_2rqqs"}, {"author": "NoongarGal", "body": "I used to react to the \"free and clear\" \"dermatologically tested\" detergents really badly...eventually switched to making my own using same kind of recipe and it definitely helped. I found lavender essential oil is okay for adding to the homemade mix for my skin ", "created_utc": "1537626611.0", "edited": "False", "id": "e6fqqol", "is_submitter": "False", "link_id": "t3_9hmzcv", "parent_id": "t1_e6dkewh", "score": "2", "subreddit": "eczema", "subreddit_id": "t5_2rqqs"}, {"author": "NoongarGal", "body": "Doing low FODMAP as well, so feel your pain (literally and figuratively!) Garlic infused olive oil has been a huge help for me...and honestly I don't miss chopping onions that much haha", "created_utc": "1537624491.0", "edited": "False", "id": "e6foucr", "is_submitter": "False", "link_id": "t3_9hx84m", "parent_id": "t1_e6fhqry", "score": "2", "subreddit": "todayilearned", "subreddit_id": "t5_2qqjc"}, {"author": "NoongarGal", "body": "It's not the gluten that we're sensitive to, but the carbohydrate called fructan in wheat, barley, and rye. Very difficult to find products without wheat, barley, or rye that aren't gluten-free though so we often just end up buying them ", "created_utc": "1537624231.0", "edited": "False", "id": "e6fomjj", "is_submitter": "False", "link_id": "t3_9hx84m", "parent_id": "t1_e6fi3k3", "score": "2", "subreddit": "todayilearned", "subreddit_id": "t5_2qqjc"}, {"author": "NoongarGal", "body": "I have an autoimmune disease that was made a lot more manageable through the low FODMAP diet...which includes cutting out wheat, barley, and rye products. It's one of the few diets that has a shit ton of scientific backing for help with autoimmune diseases. A lot of people with autoimmune conditions have trouble digesting certain carbohydrates properly (such as the fructans in wheat), which leads to worsening of other symptoms ", "created_utc": "1537623515.0", "edited": "False", "id": "e6fo19h", "is_submitter": "False", "link_id": "t3_9hx84m", "parent_id": "t1_e6ffm46", "score": "1", "subreddit": "todayilearned", "subreddit_id": "t5_2qqjc"}, {"author": "NoongarGal", "body": "Many in my circle who avoid wheat, barley, rye products do it because we don't digest the fructans in them well. People with autoimmune diseases, eczema, IBS, etc. find relief from their symptoms when avoiding fructans and other short-chain carbohydrates that are poorly absorbed in the gut. Gluten itself is fine, but it's nearly impossible to get wheat-free, barley-free, rye-free products without them being gluten-free. \n\n[https://www.npr.org/sections/thesalt/2014/05/22/314287321/sensitive-to-gluten-a-carb-in-wheat-may-be-the-real-culprit](https://www.npr.org/sections/thesalt/2014/05/22/314287321/sensitive-to-gluten-a-carb-in-wheat-may-be-the-real-culprit)", "created_utc": "1537623241.0", "edited": "False", "id": "e6fnt6x", "is_submitter": "False", "link_id": "t3_9hx84m", "parent_id": "t3_9hx84m", "score": "1", "subreddit": "todayilearned", "subreddit_id": "t5_2qqjc"}, {"author": "NoongarGal", "body": "Live in Western Australia- I only know like 2 people with a dryer", "created_utc": "1521550634.0", "edited": "False", "id": "dvzoqo8", "is_submitter": "False", "link_id": "t3_85s65y", "parent_id": "t1_dvzohv7", "score": "2", "subreddit": "todayilearned", "subreddit_id": "t5_2qqjc"}, {"author": "NoongarGal", "body": "Yeah it's an old date for sure, I think I've just been programmed to not meddle in potential data no matter if it's 32 or 132 years old\n", "created_utc": "1520476814.0", "edited": "False", "id": "dvctx7q", "is_submitter": "False", "link_id": "t3_82cw8j", "parent_id": "t1_dvank5b", "score": "1", "subreddit": "worldnews", "subreddit_id": "t5_2qh13"}, {"author": "NoongarGal", "body": "Yeah, well I don't think there is a one standard treatment for something like eczema, which effects so many people and is on our biggest organ. Study after study is done, but it's 2018 and we all obviously still have eczema! So, I reckon do what works for you...phototherapy works for me and others I know, and I wish someone had told me about it sooner ", "created_utc": "1520476207.0", "edited": "False", "id": "dvctdfj", "is_submitter": "True", "link_id": "t3_81p1q7", "parent_id": "t1_dv6aepu", "score": "1", "subreddit": "eczema", "subreddit_id": "t5_2rqqs"}, {"author": "NoongarGal", "body": "I haven't done this myself (the tanning beds that is vs. phototherapy) so can't say, but there is some recent data on it https://www.ncbi.nlm.nih.gov/pmc/articles/PMC4374067/ \n\nSorta of like a lot of things with eczema- it might work for some, but not others!\nHopefully your flare has settled by now!!", "created_utc": "1520476019.0", "edited": "False", "id": "dvct7eg", "is_submitter": "True", "link_id": "t3_81p1q7", "parent_id": "t1_dv62w5w", "score": "1", "subreddit": "eczema", "subreddit_id": "t5_2rqqs"}, {"author": "NoongarGal", "body": "It took towards the end of 3 months for it took make a difference- and definitely using a steroid cream regularly helps", "created_utc": "1520475834.0", "edited": "False", "id": "dvct1d9", "is_submitter": "True", "link_id": "t3_81p1q7", "parent_id": "t1_dv4psc7", "score": "2", "subreddit": "eczema", "subreddit_id": "t5_2rqqs"}, {"author": "NoongarGal", "body": "Yeah, would it be that hard for some of these people to just donate to conservation efforts instead of hunting?", "created_utc": "1520475511.0", "edited": "False", "id": "dvcsqys", "is_submitter": "False", "link_id": "t3_82pb74", "parent_id": "t1_dvcrlpt", "score": "1", "subreddit": "worldnews", "subreddit_id": "t5_2qh13"}, {"author": "NoongarGal", "body": "I think the article linked is a great overview of the situation. Elephants are extremely intelligent and social beings that have a place here just as much as us- they're not a ticking money bomb. Instead of killing some to keep some others safe from poachers, they should use tracking collars and amp up the tourism industry, which is more sustainable economically and in terms of the elephant populations. ", "created_utc": "1520475209.0", "edited": "False", "id": "dvcsh1w", "is_submitter": "False", "link_id": "t3_82pb74", "parent_id": "t1_dvcqo5b", "score": "3", "subreddit": "worldnews", "subreddit_id": "t5_2qh13"}, {"author": "NoongarGal", "body": "I think the ink would look less faded if the family handed it over to conservators to analyse from the get-go. Exposing old handwriting to sunlight and dry air suddenly after it's been in damp, dark conditions for a 100+ years is going to cause deterioration ", "created_utc": "1520381278.0", "edited": "False", "id": "dvamltd", "is_submitter": "False", "link_id": "t3_82cw8j", "parent_id": "t1_dva3yau", "score": "1", "subreddit": "worldnews", "subreddit_id": "t5_2qh13"}, {"author": "NoongarGal", "body": "As an archaeology student, I physically cringed when they just dumped out the sand and let the note dry out...lucky curators have it now! \n", "created_utc": "1520380272.0", "edited": "False", "id": "dvaloqr", "is_submitter": "False", "link_id": "t3_82cw8j", "parent_id": "t3_82cw8j", "score": "1", "subreddit": "worldnews", "subreddit_id": "t5_2qh13"}, {"author": "NoongarGal", "body": "Hi could someone please help me find \"Embers Boots\" for a fire faerie quest? Thanks :) ", "created_utc": "1512913457.0", "edited": "False", "id": "dr1c6s2", "is_submitter": "False", "link_id": "t3_6ya7qb", "parent_id": "t3_6ya7qb", "score": "1", "subreddit": "neopets", "subreddit_id": "t5_2r64t"}, {"author": "NoongarGal", "body": "> www.gofccyourself.com\n\nI love the ideas for how to help if you're outside the US- just moved to Aus but still a US citizen and haven't been sure how to help without the US phone number. Thank you for this!\n", "created_utc": "1511395900.0", "edited": "False", "id": "dq7q3cy", "is_submitter": "False", "link_id": "t3_7ekctd", "parent_id": "t1_dq77pmo", "score": "1", "subreddit": "neopets", "subreddit_id": "t5_2r64t"}, {"author": "NoongarGal", "body": "Fishing vortex- even with a higher fishing level you still get absolute crap 9/10 times", "created_utc": "1511395222.0", "edited": "False", "id": "dq7pke0", "is_submitter": "False", "link_id": "t3_7euxf0", "parent_id": "t3_7euxf0", "score": "26", "subreddit": "neopets", "subreddit_id": "t5_2r64t"}, {"author": "NoongarGal", "body": "Yeah I was selling them at 18,000 and then it dropped to 900 hardly 10 minutes later ", "created_utc": "1511095928.0", "edited": "False", "id": "dq1jxlg", "is_submitter": "False", "link_id": "t3_7dztcq", "parent_id": "t1_dq1hs07", "score": "3", "subreddit": "neopets", "subreddit_id": "t5_2r64t"}, {"author": "NoongarGal", "body": "Noticed Jon nursing his burned hand in this episode after saving the NW Commander during the previous episode when he grabbed the lantern:\nFirst thought- why the hell did he not grab it by the handle?\nSecond thought- why does fire burn some Targaryens and not others?", "created_utc": "1510051948.0", "edited": "False", "id": "dpgvg3x", "is_submitter": "False", "link_id": "t3_7az33t", "parent_id": "t3_7az33t", "score": "3", "subreddit": "andnowmyrewatchbegins", "subreddit_id": "t5_3o4xu"}, {"author": "NoongarGal", "body": "Same. I had to keep Googling who the hell Stannis was and where he fit into everything ", "created_utc": "1508762910.0", "edited": "False", "id": "dorlgku", "is_submitter": "False", "link_id": "t3_781e9g", "parent_id": "t1_doqkanx", "score": "1", "subreddit": "andnowmyrewatchbegins", "subreddit_id": "t5_3o4xu"}, {"author": "NoongarGal", "body": "Aw, I had a black kitty nicknamed Bean that looked just like this!!", "created_utc": "1508476420.0", "edited": "False", "id": "domi7u4", "is_submitter": "False", "link_id": "t3_77am9l", "parent_id": "t3_77am9l", "score": "2", "subreddit": "blackcats", "subreddit_id": "t5_2twpw"}, {"author": "NoongarGal", "body": "Do you also enjoy listening to African-American rappers and hip hop artists? ", "created_utc": "1507699926.0", "edited": "False", "id": "do7frgn", "is_submitter": "True", "link_id": "t3_75lvyz", "parent_id": "t1_do79flw", "score": "1", "subreddit": "perth", "subreddit_id": "t5_2r78m"}, {"author": "NoongarGal", "body": "Would you like me to send the survey to you?", "created_utc": "1507699823.0", "edited": "False", "id": "do7fpjv", "is_submitter": "True", "link_id": "t3_75lvyz", "parent_id": "t1_do7as6b", "score": "1", "subreddit": "perth", "subreddit_id": "t5_2r78m"}, {"author": "NoongarGal", "body": "Whiteness is very complex, especially in anthropology. For this survey, we're not getting too deep into it. If you regularly identify yourself as white to others, then that's what I'm looking for", "created_utc": "1507699426.0", "edited": "False", "id": "do7fi1q", "is_submitter": "True", "link_id": "t3_75lvyz", "parent_id": "t1_do7bz0u", "score": "0", "subreddit": "perth", "subreddit_id": "t5_2r78m"}, {"author": "NoongarGal", "body": "For the purpose of this study, no older than very early 30s", "created_utc": "1507699273.0", "edited": "False", "id": "do7ff3x", "is_submitter": "True", "link_id": "t3_75lvyz", "parent_id": "t1_do79vw9", "score": "3", "subreddit": "perth", "subreddit_id": "t5_2r78m"}, {"author": "NoongarGal", "body": "Was looking for a comment on this! We nicknamed our cat from Japan neko ", "created_utc": "1507684931.0", "edited": "False", "id": "do74ur6", "is_submitter": "False", "link_id": "t3_75jt10", "parent_id": "t1_do706yi", "score": "2", "subreddit": "StartledCats", "subreddit_id": "t5_2yb9w"}, {"author": "NoongarGal", "body": "The group that holds the most power in society can be discriminated against. Not nearly as much, but discriminated against nonetheless. Will it effect them holistically as a group? Probably not. That's the difference ", "created_utc": "1507640436.0", "edited": "False", "id": "do60z7f", "is_submitter": "False", "link_id": "t3_75ek6e", "parent_id": "t1_do5oa7m", "score": "4", "subreddit": "Anthropology", "subreddit_id": "t5_2qkdk"}, {"author": "NoongarGal", "body": "Nothing's impossible in cultural anthropology, that's the fun of it. Of course you can be sexist towards men in the US! Your professor has lumped all 323 million people into one cultural conglomerate of assumed patriarchy. You can't assume every cultural group in the US operates on the same normative gender roles. ", "created_utc": "1507640161.0", "edited": "False", "id": "do60sqk", "is_submitter": "False", "link_id": "t3_75ek6e", "parent_id": "t3_75ek6e", "score": "4", "subreddit": "Anthropology", "subreddit_id": "t5_2qkdk"}, {"author": "NoongarGal", "body": "One week too late! Just got asked about why the tools disappeared for so long during a presentation in class last week and didn't have an answer", "created_utc": "1507639388.0", "edited": "False", "id": "do60b0y", "is_submitter": "False", "link_id": "t3_759grs", "parent_id": "t3_759grs", "score": "1", "subreddit": "Anthropology", "subreddit_id": "t5_2qkdk"}, {"author": "NoongarGal", "body": "I don't think you have to go back to school to get into it- good start is to find a good mentor who's been doing ethnographic research for a while related to what you're interested in. Is there anyone in your network that could be a mentor or advisor? Do they know researchers who need assistance or help?\n\nLook into the theory, methodology, and current research in your interested area. It might have changed since you've gotten your BA. Figure out what topics you're interested in, practice writing ethnographically and think about which methdologies work for you. Email people doing the research and try to get on board with their projects. Once you get the experience and the contacts, you can put up your hand to run the projects.", "created_utc": "1507517044.0", "edited": "False", "id": "do3sh7d", "is_submitter": "False", "link_id": "t3_753ox9", "parent_id": "t3_753ox9", "score": "4", "subreddit": "Ethnography", "subreddit_id": "t5_35ft0"}, {"author": "NoongarGal", "body": "Hot Pie killed by fire? Tragic kitchen accident??", "created_utc": "1507125265.0", "edited": "False", "id": "dnw7jgd", "is_submitter": "False", "link_id": "t3_73i7tm", "parent_id": "t1_dnsf8mf", "score": "19", "subreddit": "freefolk", "subreddit_id": "t5_37tpy"}, {"author": "NoongarGal", "body": "*Grand Maester Pycelle droning on about how boring the book is*\nNed: \"Nah........................................I'd like to read it.\"\n\nNed's face cracked me up so much here \n\nhttps://youtu.be/7AFYIVqsx28 ", "created_utc": "1507124310.0", "edited": "False", "id": "dnw6rh8", "is_submitter": "False", "link_id": "t3_73mscv", "parent_id": "t3_73mscv", "score": "3", "subreddit": "andnowmyrewatchbegins", "subreddit_id": "t5_3o4xu"}, {"author": "NoongarGal", "body": "I used to live in a small rural town where some people would shoot cats for being on their property- they had no problem making threats about shooting black cats around Halloween that wandered too close to their land. It's a sad reality, so we always kept our inside during those last couple of weeks in October as well ", "created_utc": "1507003876.0", "edited": "False", "id": "dnu192y", "is_submitter": "False", "link_id": "t3_73vxn2", "parent_id": "t3_73vxn2", "score": "4", "subreddit": "blackcats", "subreddit_id": "t5_2twpw"}, {"author": "NoongarGal", "body": "Same for everyone in Australia and NZ", "created_utc": "1506057592.0", "edited": "False", "id": "dncdev7", "is_submitter": "False", "link_id": "t3_71nmck", "parent_id": "t1_dnc52p0", "score": "1", "subreddit": "worldnews", "subreddit_id": "t5_2qh13"}, {"author": "NoongarGal", "body": "After rewatching the attempted murder on Bran- how did Petyr Baelish's weapon and message to kill Bran get to Winterfell when he wasn't even there? Bran accused Petyr of the knife being his in S7", "created_utc": "1505919069.0", "edited": "False", "id": "dn9guuh", "is_submitter": "False", "link_id": "t3_70oovi", "parent_id": "t3_70oovi", "score": "4", "subreddit": "andnowmyrewatchbegins", "subreddit_id": "t5_3o4xu"}, {"author": "NoongarGal", "body": "The first month of my class was very dry and heavy, but I find it relevant and an important aspect of analysis in research now. It is useful stuff, regardless! Hopefully your class will pick up soon now that you all have the basics down!", "created_utc": "1505882976.0", "edited": "False", "id": "dn8ysvp", "is_submitter": "False", "link_id": "t3_70ir5c", "parent_id": "t1_dn8ykxo", "score": "1", "subreddit": "Anthropology", "subreddit_id": "t5_2qkdk"}, {"author": "NoongarGal", "body": "How far are you into the class? The basics of linguistic anthropology such as theory and understanding ideas behind communication are dry, but necessary. I found the start of my class difficult to get into, but really important to pay attention to for later in the class when we were applying the theory to really interesting studies. The interesting bits come from reading how researchers have applied it into different areas (I had to do readings on women's creaky voice, Aboriginal rock art, gothic/lolita subculture in Japan...)", "created_utc": "1505881760.0", "edited": "False", "id": "dn8y3lj", "is_submitter": "False", "link_id": "t3_70ir5c", "parent_id": "t3_70ir5c", "score": "1", "subreddit": "Anthropology", "subreddit_id": "t5_2qkdk"}, {"author": "NoongarGal", "body": "Always forgetting about WA...", "created_utc": "1505802496.0", "edited": "False", "id": "dn7dka3", "is_submitter": "False", "link_id": "t3_70yeyj", "parent_id": "t3_70yeyj", "score": "1", "subreddit": "australia", "subreddit_id": "t5_2qh8e"}, {"author": "NoongarGal", "body": "I think it depends on what type of intercultural communication you're teaching- there aren't a lot of \"dominant\" cultures in the files unfortunately. There are mostly cultures that were exotic to early anthropologists, so it really depends on what cultures you're wanting to learn about ", "created_utc": "1505436067.0", "edited": "False", "id": "dn0rxyc", "is_submitter": "True", "link_id": "t3_6znzn4", "parent_id": "t1_dmyxr4r", "score": "1", "subreddit": "Anthropology", "subreddit_id": "t5_2qkdk"}, {"author": "NoongarGal", "body": "I do this as well and it works! I make a weekly \"menu\" and only buy the fresh ingredients for snacks and those recipes (dry bulk bin shopping is different) and stick to them. If I can't do that recipe during the week and use those ingredients for some reason, I make sure to use them over the weekend in a bigger dish like a stir fry or curry and freeze the leftovers for lunch the next week.\nIf you go by a week by week basis, then you shouldn't have much spoil. ", "created_utc": "1505430691.0", "edited": "False", "id": "dn0ntnc", "is_submitter": "False", "link_id": "t3_703bqt", "parent_id": "t1_dn03eia", "score": "5", "subreddit": "ZeroWaste", "subreddit_id": "t5_2wf12"}, {"author": "NoongarGal", "body": "In regards to update 4: Your rent should never be half of your income (your total daily expenses, including bills, credit card payments, rent, etc. shouldn't be above 60% of your total income) so if it has come to that and they're not willing to negotiate any further, it may be time to look elsewhere for work ", "created_utc": "1505430076.0", "edited": "False", "id": "dn0ncdm", "is_submitter": "False", "link_id": "t3_702aiq", "parent_id": "t3_702aiq", "score": "2", "subreddit": "personalfinance", "subreddit_id": "t5_2qstm"}, {"author": "NoongarGal", "body": "I don't know much on this, but coming from the archaeology perspective I would probably look into research around human cognition development. There are a few theories there like Mithen's fluid mind and Wynn & Coolidge's working memory hypothesis that might be a good starting point.\n\nFrom the development of working memory and language, the idea of religion may not have been much further along. Also, Lake Mungo, Australia (40,000 BP) is an important site because it may be an example of one of the first religious world views: people being buried with red ochre, first evidence of cremation; people were probably thinking about death and belonging in ways that early hominids didn't quite seem to. Not evidence of deities and deity worship per say, but still an amazing find. ", "created_utc": "1505258907.0", "edited": "False", "id": "dmxbri6", "is_submitter": "False", "link_id": "t3_6yz1jp", "parent_id": "t3_6yz1jp", "score": "2", "subreddit": "Anthropology", "subreddit_id": "t5_2qkdk"}, {"author": "NoongarGal", "body": "I have read about this from other anthropologists.\nOn the Azande people of Central Africa:\n“When the time comes, a single name only is bestowed on the baby. It is usually chosen quite fortuitously by the father. Very often it is a mere sound of no meaning, but more commonly it is a real word or short phrase, sometimes recalling an event such as Romai, a girl’s name given her because she was born during a heavy rainstorm, ro mai meaning ‘in the rain’. More rarely is the name of an ancestor given. Divination does not seem to be resorted to in choosing the name. Later on in life the owner will probably change his name. He will certainly do so when he has been circumcised, and may do so at any time. It is a breach of etiquette for any except near relations to call a person by his discarded name.”", "created_utc": "1505258080.0", "edited": "False", "id": "dmxb4xs", "is_submitter": "False", "link_id": "t3_6yrwh8", "parent_id": "t1_dmq139f", "score": "1", "subreddit": "Anthropology", "subreddit_id": "t5_2qkdk"}, {"author": "NoongarGal", "body": "That's a great legacy of work to leave behind. I've become much more increasingly thankful to the anthropologists and other ethnographic researchers of earlier eras. I don't agree with the way many of them conducted research, the racist social evolution ideas, and the way their studies were used by others to invalidate groups of people. HOWEVER, their work is now an incredible resource to the local cultures they studied- as it was for you. For example, I'm Australian Aboriginal and a lot of groups here are quite reliant on anthropologists and missionaries' written documents from the past to rebuild our languages and traditions by relearning what our ancestors did. Getting to read those documents on our ancestors and using those to revitalise our culture is a very special process (a saddening one as well), that I'm thankful is able to occur due to their work. ", "created_utc": "1505257412.0", "edited": "False", "id": "dmxamll", "is_submitter": "True", "link_id": "t3_6znzn4", "parent_id": "t1_dmwuzdn", "score": "1", "subreddit": "Anthropology", "subreddit_id": "t5_2qkdk"}, {"author": "NoongarGal", "body": "Yeah certainly you can have an appreciation for the files while also having a reservation towards the data itself. I would love to see a database that consists of anthropology ethnographic research compiled with local history, archaeology, and indigenous studies placed onto a global map. Something to contextualise and validate the data through multiple views and make it visually appealling. Also \"plodding through\" is a very Penn term haha", "created_utc": "1505256999.0", "edited": "False", "id": "dmxab90", "is_submitter": "True", "link_id": "t3_6znzn4", "parent_id": "t1_dmx1103", "score": "1", "subreddit": "Anthropology", "subreddit_id": "t5_2qkdk"}, {"author": "NoongarGal", "body": "Undergraduate female student who is attempting to go zero waste with my boyfriend who I live with. You can interview us both if you'd like!", "created_utc": "1504776484.0", "edited": "False", "id": "dmoek5p", "is_submitter": "False", "link_id": "t3_6yk4qk", "parent_id": "t3_6yk4qk", "score": "4", "subreddit": "ZeroWaste", "subreddit_id": "t5_2wf12"}, {"author": "NoongarGal", "body": "Having 12 people is an unfair advantage and you all probably should have split up- around 3 to 6 people is normal at most quiz nights in Perth\n", "created_utc": "1504685317.0", "edited": "False", "id": "dmmpkg6", "is_submitter": "False", "link_id": "t3_6vr05w", "parent_id": "t3_6vr05w", "score": "2", "subreddit": "perth", "subreddit_id": "t5_2r78m"}, {"author": "NoongarGal", "body": "OKKJAAAAAAAAAA!!!!!!!", "created_utc": "1504098637.0", "edited": "False", "id": "dmbrfbq", "is_submitter": "False", "link_id": "t3_6wxzj4", "parent_id": "t3_6wxzj4", "score": "3", "subreddit": "Awwducational", "subreddit_id": "t5_2vi0z"}, {"author": "NoongarGal", "body": "I played it on the my PSP back around the time the movie had been released. I remember flying with Sapphira was pretty fun with good challenges- not a super memorable game though ", "created_utc": "1503912956.0", "edited": "False", "id": "dm887n9", "is_submitter": "False", "link_id": "t3_6we4w8", "parent_id": "t3_6we4w8", "score": "2", "subreddit": "Eragon", "subreddit_id": "t5_2qyfi"}, {"author": "NoongarGal", "body": "Went to a plastic-free/nearly zero-waste party over the weekend with about 20 others! Everybody brought their nice dishes or reusable containers rather than throw-away plates, wine bottles rather than plastic soft drink bottles, and had good reusable dishes and utensils instead of one-use utensils and paper plates. ", "created_utc": "1503369732.0", "edited": "False", "id": "dlyaq90", "is_submitter": "False", "link_id": "t3_6v2ibv", "parent_id": "t3_6v2ibv", "score": "4", "subreddit": "ZeroWaste", "subreddit_id": "t5_2wf12"}]