[{"author": "NotABrainTumor", "body": "I always viewed it as without trying that pt had a 100% chance of dying. All medical interventions can do is offer a chance of success, some higher than others. There are no guarantees in life. The 1st death is always the hardest.", "created_utc": "1666926874.0", "edited": "False", "id": "iu2t41s", "is_submitter": "False", "link_id": "t3_yfap2r", "parent_id": "t3_yfap2r", "score": "92", "subreddit": "medicalschool", "subreddit_id": "t5_2re2p"}, {"author": "NotABrainTumor", "body": "That's cool and all man, one shouldn't live life with regrets anyways. That being said you're telling me it is BS because A) Ivy leagues do in fact provide superior clinical experience or B) they do not cost 1.5-2.5x as much as public schools? I simply don't see how either of those statements is true.", "created_utc": "1666926076.0", "edited": "False", "id": "iu2riuq", "is_submitter": "False", "link_id": "t3_yf7piw", "parent_id": "t1_iu2qdoi", "score": "-5", "subreddit": "DentalSchool", "subreddit_id": "t5_2siqo"}, {"author": "NotABrainTumor", "body": "Not really, most of the 6 year guys I know had higher CBSE and class rank as well as research. 4 year guys have to compete with more non-cats which makes it harder, but the avg CBSE is 5-8 pts lower for 4 yr guys, there's an article in JOMS about it from Miloro I think.\n\nTo counter your point I know a guy who's omfs program told him he would qualify for the 4 but not the 6 lol. Anecdata is not evidence.", "created_utc": "1666921024.0", "edited": "False", "id": "iu2gmo3", "is_submitter": "False", "link_id": "t3_yegy3j", "parent_id": "t1_iu26lxa", "score": "2", "subreddit": "DentalSchool", "subreddit_id": "t5_2siqo"}, {"author": "NotABrainTumor", "body": "I've met a decent amount of Upenn grads, and their clinical experience was pretty weak compared to any state/public school lol. If you go to harvard or columbia might as well not call yourself a dentist. All 3 are specialist factories and that's about it. If you want good clinical experience go to MWU, Creighton, most state schools, etc.\n\n**But above all, cheapest school you get into, period**. B/c 1 month of private practice > 4 yrs of any dental school.\n\nEdit: No I'm not insulting ivy league schools graduates. I just don't think they are worth it and their clinical experience is vastly inferior to state schools. If you want prestige or academia or whatever go there. 2022 state grad here and I did 200+ fillings, 15+ quads SRP, 400+ exts, 50+ surg exts, (as well as alveo, tori, impacted 3rds), 7 arches of removable, 20 units of crown/bridge (restored 1 implant crown), 3 molar endo, 4 anterior endo.", "created_utc": "1666920850.0", "edited": "1666925536.0", "id": "iu2g90n", "is_submitter": "False", "link_id": "t3_yf7piw", "parent_id": "t3_yf7piw", "score": "11", "subreddit": "DentalSchool", "subreddit_id": "t5_2siqo"}, {"author": "NotABrainTumor", "body": "I dunno man, you'd be surprised at what you see lol. In ruralish south for residency and most male residents aren't really struggling regardless of race provided they are US born.", "created_utc": "1666370896.0", "edited": "False", "id": "it83d8v", "is_submitter": "False", "link_id": "t3_y8yzma", "parent_id": "t1_it7apfz", "score": "1", "subreddit": "AsianMasculinity", "subreddit_id": "t5_30c2m"}, {"author": "NotABrainTumor", "body": "Definitely agree, but you also mentioned upper middle class. I find the further up socioeconomically I go the better people look, but that's because I find myself surrounded by richer people. People from my hometown don't look to good, but being poor kinda does that to you over time.", "created_utc": "1666370660.0", "edited": "False", "id": "it82rt3", "is_submitter": "False", "link_id": "t3_y9x20w", "parent_id": "t3_y9x20w", "score": "19", "subreddit": "AsianMasculinity", "subreddit_id": "t5_30c2m"}, {"author": "NotABrainTumor", "body": "OMFS resident here, for 6 year programs, the med school can and will screen out people based on undergrad GPA. Especially at the more competitive med schools (note, not necessarily better OMFS programs).", "created_utc": "1666370377.0", "edited": "False", "id": "it822n4", "is_submitter": "False", "link_id": "t3_y94viz", "parent_id": "t3_y94viz", "score": "2", "subreddit": "DentalSchool", "subreddit_id": "t5_2siqo"}, {"author": "NotABrainTumor", "body": "I remember in dental school when we did wax-ups for our mock practicals one time we tested a theory. My friend asked one instructor to grade it- he got a 75. 10 minutes later, he gave me his tooth (exact same) and I went up to the same instructor for feedback. That instructor gave me a 90. \n\nBasically it's complete bullshit. If they like you, then grades are better, if they don't then tough luck lol.", "created_utc": "1666370274.0", "edited": "False", "id": "it81tdm", "is_submitter": "False", "link_id": "t3_y9dpjk", "parent_id": "t3_y9dpjk", "score": "4", "subreddit": "DentalSchool", "subreddit_id": "t5_2siqo"}, {"author": "NotABrainTumor", "body": "The last point could apply to medicine as well, many specialist docs in academia make 150-250k after 4 yrs undergrad 4 yrs med school and 6-8 yrs of resident salary (50-60k). Yet they still do it. I would not recommend MD for pure income and it’s very stupid to go into medicine primarily for the money. \n\nDentists don’t have to do residency and income is contingent on how much you produce- I have classmates that make anywhere from 120-500k in their mid late 20s. Just as variable as sales imo.", "created_utc": "1666291637.0", "edited": "1666291908.0", "id": "it3ryad", "is_submitter": "False", "link_id": "t3_y8yzma", "parent_id": "t1_it3js6g", "score": "2", "subreddit": "AsianMasculinity", "subreddit_id": "t5_30c2m"}, {"author": "NotABrainTumor", "body": "What about dentistry, medical sales, physician assistant? Also Big 4 accounting? Biglaw is good if you can get into it, but for the avg law graduate the job opportunities suck.\n\nYou also don't really mention opportunity cost and actual enjoyment/ the type of person that would succeed in the career. Like there is no way I could do SWE, I would be bored out of my mind lol, there's lots of high paying jobs but being able to tolerate the career itself is important.\n\nI believe it would be more helpful if you could deep dive and cover things like career progression, years of training, location mobility QOL, bamboo ceiling, work life balance etc for the fields that you appear knowledgeable in (Business related). And maybe others could do it for the fields they are in ex healthcare, SWE, etc.", "created_utc": "1666284911.0", "edited": "1666285405.0", "id": "it3alax", "is_submitter": "False", "link_id": "t3_y8yzma", "parent_id": "t3_y8yzma", "score": "6", "subreddit": "AsianMasculinity", "subreddit_id": "t5_30c2m"}, {"author": "NotABrainTumor", "body": "You don't have to worry about this for a few years man, aren't you in college still?", "created_utc": "1666204305.0", "edited": "False", "id": "isyvp6r", "is_submitter": "False", "link_id": "t3_y81mot", "parent_id": "t3_y81mot", "score": "-6", "subreddit": "DentalSchool", "subreddit_id": "t5_2siqo"}, {"author": "NotABrainTumor", "body": "Tbh haven't really heard this? Pedo, OMFS, Endo all have really bright futures. I guess Endo when implants were first becoming mainstream, but I never see anyone say bad stuff about these specialties dying.\n\nIMO all the is X dying questions? are almost always ortho or general dentistry related and they have valid reasons to ask that.", "created_utc": "1665700058.0", "edited": "False", "id": "is7rd1r", "is_submitter": "False", "link_id": "t3_y2zj5a", "parent_id": "t1_is7a8ss", "score": "5", "subreddit": "DentalSchool", "subreddit_id": "t5_2siqo"}, {"author": "NotABrainTumor", "body": "Imo the only ECs that really matter are externships and research. The other stuff is good for you but it doesn't really make you more \"competitive\".\n\nAnother thing to consider is regional bias- if you aren't from certain regions it's hard to get interviews there. Like I didn't really get NE interviews being from the South and my friends from the NE said the same vice versa.\n\nAlso many 4 year programs won't look at people that didn't do non-cats so theres that, idk if you did 6 or 4 or both.\n\nIt's still early in the cycle, I wouldn't worry too much.", "created_utc": "1665003993.0", "edited": "1665004217.0", "id": "ir79kr5", "is_submitter": "False", "link_id": "t3_xwbxqr", "parent_id": "t3_xwbxqr", "score": "3", "subreddit": "DentalSchool", "subreddit_id": "t5_2siqo"}, {"author": "NotABrainTumor", "body": "Value if we’re talking about learning something seriously, like to a B2, interest if I don’t intend to become “fluent”. I have limited time these days and can’t justify spending the 100s-1000s of hours to a single language out of pure interest( though I am willing to spend time dabbling in a bunch of exotic languages just for fun)", "created_utc": "1663844408.0", "edited": "False", "id": "ipgb9tr", "is_submitter": "False", "link_id": "t3_xklp57", "parent_id": "t3_xklp57", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "NotABrainTumor", "body": "Sounds like you just asked if you have chances at the highest paying specialties lol. All 3 are completely different, which your friend should know if they’ve been working for a few years.", "created_utc": "1663844045.0", "edited": "False", "id": "ipgaqf0", "is_submitter": "False", "link_id": "t3_xkq3om", "parent_id": "t3_xkq3om", "score": "17", "subreddit": "Dentistry", "subreddit_id": "t5_2rpgi"}, {"author": "NotABrainTumor", "body": "Sounds like an institution dependent thing rather than a specialty specific thing, but overall like any school you will meet people you like and dislike working with. Staying under the radar will make your life easier at the end of the day.", "created_utc": "1663768618.0", "edited": "False", "id": "ipbxw02", "is_submitter": "False", "link_id": "t3_xk4rky", "parent_id": "t3_xk4rky", "score": "4", "subreddit": "DentalSchool", "subreddit_id": "t5_2siqo"}, {"author": "NotABrainTumor", "body": "Maybe 1-4 matches a day, enough to meet up with tbh, population 100k ish, not too bad, wish I lived in a big city though lol", "created_utc": "1663044583.0", "edited": "False", "id": "io7x59q", "is_submitter": "False", "link_id": "t3_xb8mff", "parent_id": "t1_inztm15", "score": "2", "subreddit": "AsianMasculinity", "subreddit_id": "t5_30c2m"}, {"author": "NotABrainTumor", "body": "Never been with anyone at all? Dating experience is never a bad thing imo, how are you supposed to find the one if you don't even know what you like and dislike. I'm sure there will be lots of people to date in residency- nurses, residents, etc. As long as you aren't disfigured or extremely socially awkward you can find someone", "created_utc": "1662930742.0", "edited": "False", "id": "io1huwt", "is_submitter": "False", "link_id": "t3_xbj7xe", "parent_id": "t3_xbj7xe", "score": "1", "subreddit": "AsianMasculinity", "subreddit_id": "t5_30c2m"}, {"author": "NotABrainTumor", "body": "If time isn't a concern then sure your plan seems fine, but you would be looking at adding 2-3 years minimum to a 4 or 6 yr residency. Tbh that would wear me out more lol\n\nAs of now your current timeline is:\n\n4 yrs dental school D4 match into GPR\n\nGPR yr / study for CBSE and do well\n\nGap year and study for CBSE (not clear from your post if you intend to take CBSE during or after GPR year)\n\nNon cat year ( Very unlikely you match OMFS from a GPR yr or a gap year without doing a non-cat first)\n\n4-6 years of residency\n\nTbh most people that do this are people that wanted to do OMFS but decided too late, like D4 so they have to pivot and change everything. Also having to move like 3-4 times in the span of 4 years potentially cross country doesn't sound fun.", "created_utc": "1662857627.0", "edited": "False", "id": "inxfk8e", "is_submitter": "False", "link_id": "t3_xb3yee", "parent_id": "t3_xb3yee", "score": "3", "subreddit": "DentalSchool", "subreddit_id": "t5_2siqo"}, {"author": "NotABrainTumor", "body": "Case too hard, time consuming, patient is annoying or high maintenance, or you just don't feel like doing it etc? Refer it out lol\n\nYou get to decide what you keep in house and refer out.", "created_utc": "1662710485.0", "edited": "False", "id": "inp8tlf", "is_submitter": "False", "link_id": "t3_x9htm9", "parent_id": "t3_x9htm9", "score": "7", "subreddit": "Dentistry", "subreddit_id": "t5_2rpgi"}, {"author": "NotABrainTumor", "body": "Surgical subspecialty interviews this past cycle\n\nWhat would you do if I gave you an adult pet tiger and you had to live with it?\n\nWhat flavor ice cream would you be?\n\nSell me a desk- the idea was to ask him questions and test critical thinking, ex dimensions, purpose, location, etc. but nobody knew that \n\nHow would your chairman describe you to me? Apparently they were friends with each other lol\n\nApparently one program asked every applicant: name one person in this room to DNR and why you wouldn't want them to be a surgeon", "created_utc": "1662708682.0", "edited": "False", "id": "inp6nft", "is_submitter": "False", "link_id": "t3_x9ca33", "parent_id": "t3_x9ca33", "score": "5", "subreddit": "Residency", "subreddit_id": "t5_2t8qv"}, {"author": "NotABrainTumor", "body": "Not necessarily, roughly 1/3 match directly from 4th yr, though I'll say this: of all the residents that I've met that didn't enter the field straight out of dental school, 90+% of them did non-cats or GPR then non-cats. \n\nHigh class rank at state school + high CBSE will get you interviews almost anywhere. If you go to an Ivy it's much easier and less stressful, but if you can't hack it then you will look even worse. Harvard matches a lot to OMFS, as do the other \"ivy-esque\" schools UCLA, penn, columbia,etc. but I would never go there unless I was 100% sure I wanted to specialize and my parents were paying for it. To me the extra 200-300k debt is simply not worth it. But obviously I am biased. Also another bias but imo many of the ivy league graduates don't really match to \"top tier\" programs in part due to the high number of applicants from those schools.\n\nI wanted to do OMFS since I was in high school, but I just chose the cheapest dental school, I didn't really choose based on specializing potential. I guess you could say I had a big ego or whatever, but I was confident I could specialize no matter where I went. I am also thankful for the great clinical training I received, though maybe you don't really care about that if you are dead dead set on OMFS. \n\nA lot more to say on those topics but that's about as brief as I can keep it.", "created_utc": "1662708233.0", "edited": "False", "id": "inp63mk", "is_submitter": "True", "link_id": "t3_v70xxb", "parent_id": "t1_ine82hq", "score": "1", "subreddit": "DentalSchool", "subreddit_id": "t5_2siqo"}, {"author": "NotABrainTumor", "body": "Are you canadian or IMG because those are different, canadians have an easier time generally and a few more programs are open to them. I don't have any advice specific to your situation other than people have done it before, some have done 2-3 non cat years to get in to the US, up to you if you want it that badly.", "created_utc": "1662707217.0", "edited": "False", "id": "inp4t8m", "is_submitter": "True", "link_id": "t3_v70xxb", "parent_id": "t1_inofrm1", "score": "1", "subreddit": "DentalSchool", "subreddit_id": "t5_2siqo"}, {"author": "NotABrainTumor", "body": "First part is false, the split is roughly 60:40 in favor of the 4yr path. Saying vast majority makes it sound like only 10% or less omfs have MDs. Agree with the rest of your comment.", "created_utc": "1662339461.0", "edited": "False", "id": "in4kgi9", "is_submitter": "False", "link_id": "t3_x5jnvo", "parent_id": "t1_in3l7u3", "score": "2", "subreddit": "Dentistry", "subreddit_id": "t5_2rpgi"}, {"author": "NotABrainTumor", "body": "I played it for 14 years and was ok at it (like state orchestra but not competition level). Honestly, it seemed like it was just something to pass the time when they were too busy to deal with me and make sure I stayed out of trouble . I never really enjoyed it, but I also never really hated it.\n\nWas it a waste of time? Probably, but so was playing video games all day.\n\nI probably wouldn't make my kid do it unless they really wanted to, I think a more social hobby would have been a better use of time.", "created_utc": "1658777442.0", "edited": "False", "id": "ihm91tz", "is_submitter": "False", "link_id": "t3_w7n9ig", "parent_id": "t3_w7n9ig", "score": "12", "subreddit": "AsianMasculinity", "subreddit_id": "t5_30c2m"}, {"author": "NotABrainTumor", "body": "I am an OMFS resident, however I was offered this as a D4 by an oral surgeon- I would have worked in his office and done simpler procedures, whereas he would have done the bigger cases like all on Xs, complex bone grafts,etc. \n\nI would not personally attempt to do tori if I was a general dentist working alone especially fresh out, but YMMV.", "created_utc": "1658285812.0", "edited": "False", "id": "igva36u", "is_submitter": "False", "link_id": "t3_w2wlm2", "parent_id": "t1_igv90vl", "score": "5", "subreddit": "DentalSchool", "subreddit_id": "t5_2siqo"}, {"author": "NotABrainTumor", "body": "I was offered 250k base as an exodontia type practice which I didn't accept, but traditional bread and butter probably pretty hard unless you have a good payor mix.\n\nCaveat being I can do surgical extractions, tori, full mouth, some full bonys, etc. with decent speed/skill.", "created_utc": "1658281007.0", "edited": "False", "id": "iguzikr", "is_submitter": "False", "link_id": "t3_w2wlm2", "parent_id": "t3_w2wlm2", "score": "6", "subreddit": "DentalSchool", "subreddit_id": "t5_2siqo"}, {"author": "NotABrainTumor", "body": "Good TMJ exposure with Wolford and Franco. No cancer, pretty sure no craniofacial either. I believe they do their anesthesia training with parkland. Seemed pretty chill, definitely more private practice oriented than the other programs in the state, except maybe Galveston.", "created_utc": "1658089839.0", "edited": "False", "id": "igk59al", "is_submitter": "False", "link_id": "t3_w1akrq", "parent_id": "t3_w1akrq", "score": "6", "subreddit": "DentalSchool", "subreddit_id": "t5_2siqo"}, {"author": "NotABrainTumor", "body": "If pre-dental posts are allowed again, a suggestion is to make a weekly thread where all what are my chances/DAT related questions can post. Those seem to be the most repetitive and annoying, and people interested in giving advice can just comment there so it doesn't clutter everything else.", "created_utc": "1657417009.0", "edited": "False", "id": "ifjmfo1", "is_submitter": "False", "link_id": "t3_vve4r4", "parent_id": "t3_vve4r4", "score": "4", "subreddit": "DentalSchool", "subreddit_id": "t5_2siqo"}, {"author": "NotABrainTumor", "body": "Lots of boomers retiring there= good fee for service market\n\nNo income tax\n\nNice weather\n\nNever been there so can't really comment, but that's just what people I know say", "created_utc": "1656284939.0", "edited": "False", "id": "idv3fg0", "is_submitter": "False", "link_id": "t3_vl43re", "parent_id": "t1_idu2em2", "score": "4", "subreddit": "DentalSchool", "subreddit_id": "t5_2siqo"}, {"author": "NotABrainTumor", "body": "Background- mid 20s, doing surgical residency, will be 31 or 33 when I'm done. Grew up lower class/lower middle class, have worked in construction, cooking, nomad/international travel life. None have been as satisfying as my current path.\n\nThe 3 factors I've always prioritized were pay, passion/interest, and what I was good at.\n\nPay- I always wanted to have a family and kids can be very expensive. Additionally, earning a higher salary allows you more freedom ex choosing a spouse with a lower paid job, retiring early, living in more diverse cities, etc. Therefore, in college I only looked at jobs that made a guaranteed 100k+.\n\nPassion/interest- Everything eventually becomes routine, but do you really want to choose a career that you don't like at all? I'm interested in many things like linguistics, cooking, writing, and science. I always disliked math, despite being good at it. \n\nWhat you're good at- Life is hard enough as it is, why purposely enter a field where you're disadvantaged? Not saying you have to be talented, but if you struggle with algebra maybe you shouldn't get a PhD in Math and try to be a wall street quant. \n\nDon't worry about being a stereotype, your job is just one aspect of who you are. A comp sci guy that does bodybuilding and woodworking is probably less of a stereotype then someone like Jimmy O Yang.", "created_utc": "1656267716.0", "edited": "False", "id": "idu151x", "is_submitter": "False", "link_id": "t3_vl4mh7", "parent_id": "t3_vl4mh7", "score": "11", "subreddit": "AsianMasculinity", "subreddit_id": "t5_30c2m"}, {"author": "NotABrainTumor", "body": "This program had no plastics residency, and trauma call alternates with ENT, so yea roughly half of the call nights are tooth call + seeing all their in house patients. And if you have fresh free flap patients doing q2h flap checks means you’re not getting much sleep. Also intern year is busiest at this program. Upper years are generally low 90s iirc.\n\n50-60 hrs sounds super light, I mean at the bare minimum you’re working 12hrs x5 days a week, add on q7 call that’s still 72 hrs a week.Also very few places have 7 residents, even if you include the non-categorical interns, most places are 2-3 categorical and 1-2 non-cats. Then again I avoided country club programs like the plague and there’s definitely large variation in program set ups.", "created_utc": "1655751580.0", "edited": "1655752316.0", "id": "id3auk7", "is_submitter": "False", "link_id": "t3_vg1r5a", "parent_id": "t1_id2uole", "score": "2", "subreddit": "Residency", "subreddit_id": "t5_2t8qv"}, {"author": "NotABrainTumor", "body": "Freshly graduated D4 here. If you are dead set 10000% on specializing consider some ivies. Otherwise cheapest school, close to friends/family, and/or cool city you wanna live in. Clinical experience is overrated from almost everyone I know, myself included.", "created_utc": "1655712331.0", "edited": "False", "id": "id1ch5l", "is_submitter": "False", "link_id": "t3_vg4uek", "parent_id": "t3_vg4uek", "score": "1", "subreddit": "DentalSchool", "subreddit_id": "t5_2siqo"}, {"author": "NotABrainTumor", "body": "Eh no offense man, but being afraid/embarrassed to hug another person in public sounds like it’s a you problem rather than a cultural misunderstanding. Also in the next sentence you say it’s not a big deal… so why don’t you just do it?", "created_utc": "1655711840.0", "edited": "False", "id": "id1bxmd", "is_submitter": "False", "link_id": "t3_vgc4e8", "parent_id": "t3_vgc4e8", "score": "22", "subreddit": "AsianMasculinity", "subreddit_id": "t5_30c2m"}, {"author": "NotABrainTumor", "body": "1. Most guys care a lot less about “fetishization” than girls do. \n\n2.\n IMO fetishization is basically preconceived positive sexual stereotypes about another person. It gets harmful when you try to force the other person to fit into your narrow definition of whatever fetish you have. Ex if you were into k-pop guys but the guy you’re dating is an Asian guy from the rural south that’s basically a redneck. You try to force him to change how he looks, or belittle him for not acting “Asian” enough. \n\nBasically being in love with the idea of an “Asian” guy rather than learning to appreciate the person in front of you, that may have many or none of those qualities.", "created_utc": "1655711348.0", "edited": "False", "id": "id1be6h", "is_submitter": "False", "link_id": "t3_vgbu2c", "parent_id": "t3_vgbu2c", "score": "22", "subreddit": "AsianMasculinity", "subreddit_id": "t5_30c2m"}, {"author": "NotABrainTumor", "body": "You’re not gonna match ENT or Plastics if you go DO just a heads up", "created_utc": "1655704748.0", "edited": "False", "id": "id13hwj", "is_submitter": "False", "link_id": "t3_vfh4sz", "parent_id": "t1_icy434m", "score": "1", "subreddit": "DentalSchool", "subreddit_id": "t5_2siqo"}, {"author": "NotABrainTumor", "body": "I think Harvard also has a similar set up, but I think both places tend to recruit internally either way", "created_utc": "1655704545.0", "edited": "False", "id": "id138ji", "is_submitter": "False", "link_id": "t3_vfmhdb", "parent_id": "t1_icygudg", "score": "1", "subreddit": "Dentistry", "subreddit_id": "t5_2rpgi"}, {"author": "NotABrainTumor", "body": "One program I externed at, the intern told me he logged 135 hrs the previous week lol. Q2 in house call, no post call. Literally work 36-40 hrs, sleep 5-6 hrs then back at it again. Though I think his avg was only in the 100s.", "created_utc": "1655704370.0", "edited": "False", "id": "id130g9", "is_submitter": "False", "link_id": "t3_vg1r5a", "parent_id": "t1_id0jymi", "score": "16", "subreddit": "Residency", "subreddit_id": "t5_2t8qv"}, {"author": "NotABrainTumor", "body": "Reach out to local dental schools' ortho departments and make connections. Maybe ask any former classmates that are orthos now if they could hook you up. You need to get letters of rec and get your foot in the door which is the hardest thing to do once you're out. Just my experience ( know people a few yrs out that went back for OMFS)", "created_utc": "1655177540.0", "edited": "1655177736.0", "id": "icadw0t", "is_submitter": "False", "link_id": "t3_vbsjw1", "parent_id": "t3_vbsjw1", "score": "4", "subreddit": "DentalSchool", "subreddit_id": "t5_2siqo"}, {"author": "NotABrainTumor", "body": "Some places care, most don't. CBSE and grades are king. Research is more a talking point during IVs. Take the CBSE whenever you are ready, it's very common to take it multiple times so don't feel bad if the first time it doesn't go well.", "created_utc": "1655177174.0", "edited": "False", "id": "icad4jo", "is_submitter": "True", "link_id": "t3_v70xxb", "parent_id": "t1_ic848m3", "score": "2", "subreddit": "DentalSchool", "subreddit_id": "t5_2siqo"}, {"author": "NotABrainTumor", "body": "I'm 25, was in a relationship for all 4 years. I had no issues balancing it but that's dependent on the person. Definitely many times where I chose to hang out with my gf instead of studying for tests or doing some more lab work but I was never the type A perfectionist person anyways.", "created_utc": "1654807508.0", "edited": "False", "id": "ibrycq9", "is_submitter": "True", "link_id": "t3_v70xxb", "parent_id": "t1_ibr8ybu", "score": "2", "subreddit": "DentalSchool", "subreddit_id": "t5_2siqo"}, {"author": "NotABrainTumor", "body": "I considered general dentistry but ultimately decided my personality type was suited for specialization. I don't like not knowing things/having to refer up because I can't handle something and while I realize everyone has limitations I prefer to be one of the end guys. Another thing that interested me in OMFS is the collaboration. Discussing cases in the hospital, working with prosth for complex rehabilitation or ortho for orthognathic surgery,etc. General dentistry tends to be a lot more siloed and for lack of a better word, lonely.\n\nMy dream set up is OR 2-3 days a week, 0.5-1 day a week dentoalveolar, 1-1.5 days a week consults/referrals, followups, etc.", "created_utc": "1654716269.0", "edited": "False", "id": "ibn7yi5", "is_submitter": "True", "link_id": "t3_v70xxb", "parent_id": "t1_ibmgzn7", "score": "1", "subreddit": "DentalSchool", "subreddit_id": "t5_2siqo"}, {"author": "NotABrainTumor", "body": "0k from undergrad\n\n250k from dental school as of this month ( interest included)\n\n50-75k for 2 years med school.\n\nAfter interest compounds, I'm gonna have 370-400k debt by the end of residency.\n\nSalary expectations from speaking with residents, faculty, etc\n\nPrivate practice  starting associate 3-600k, 5 years out partner or solo 750k-1.5 mil\n\nAcademics starting 250-350k, 5 years out 4-600k", "created_utc": "1654716000.0", "edited": "1654717707.0", "id": "ibn7bna", "is_submitter": "True", "link_id": "t3_v70xxb", "parent_id": "t1_ibl3w9v", "score": "2", "subreddit": "DentalSchool", "subreddit_id": "t5_2siqo"}, {"author": "NotABrainTumor", "body": "Yea pretty much. I would get involved in research too and start making connections with faculty, residents, upper classmen.", "created_utc": "1654715532.0", "edited": "False", "id": "ibn68yh", "is_submitter": "True", "link_id": "t3_v70xxb", "parent_id": "t1_ibmwpjq", "score": "1", "subreddit": "DentalSchool", "subreddit_id": "t5_2siqo"}, {"author": "NotABrainTumor", "body": "Started shadowing my home school's OMFS program D2. I wasn't able to extern until summer D3 due to COVID. I enjoyed my experience overall, it really solidified my love for the OR. Got to pull lots of teeth and it was tiring but better than the grind of dental school.", "created_utc": "1654715470.0", "edited": "False", "id": "ibn63y9", "is_submitter": "True", "link_id": "t3_v70xxb", "parent_id": "t1_iblsx9d", "score": "2", "subreddit": "DentalSchool", "subreddit_id": "t5_2siqo"}, {"author": "NotABrainTumor", "body": "Studied for around 5 months March of D1 and took it August D2\n\nI think I got a 27 AA and 28 TS but I don't remember exactly, I know I got 30s on both chems", "created_utc": "1654715368.0", "edited": "False", "id": "ibn5vn4", "is_submitter": "True", "link_id": "t3_v70xxb", "parent_id": "t1_ibmxka0", "score": "2", "subreddit": "DentalSchool", "subreddit_id": "t5_2siqo"}, {"author": "NotABrainTumor", "body": "[https://www.aaoms.org/images/uploads/pdfs/open\\_positions\\_externship.pdf](https://www.aaoms.org/images/uploads/pdfs/open_positions_externship.pdf)\n\nNot every program offers externships. A lot of that info is outdated, but that's a place to start. Then just go to the programs website and they usually have an externship form or tell you how to apply.", "created_utc": "1654660170.0", "edited": "False", "id": "ibkimkn", "is_submitter": "True", "link_id": "t3_v70xxb", "parent_id": "t1_ibkhf5j", "score": "1", "subreddit": "DentalSchool", "subreddit_id": "t5_2siqo"}, {"author": "NotABrainTumor", "body": "We take the CBSE to apply for OMFS via the AAOMS. Med school wants it taken through the NBME to be \"med school valid\". Just another hoop to jump through", "created_utc": "1654659463.0", "edited": "False", "id": "ibkhfzv", "is_submitter": "True", "link_id": "t3_v70xxb", "parent_id": "t1_ibj35kn", "score": "3", "subreddit": "DentalSchool", "subreddit_id": "t5_2siqo"}, {"author": "NotABrainTumor", "body": "I'll let you know if I still enjoy it once the endless pimping, secretary work, and sleep deprivation starts lol.", "created_utc": "1654659348.0", "edited": "False", "id": "ibkh8wo", "is_submitter": "True", "link_id": "t3_v70xxb", "parent_id": "t1_ibk04cs", "score": "2", "subreddit": "DentalSchool", "subreddit_id": "t5_2siqo"}, {"author": "NotABrainTumor", "body": "Hard work and stay humble. A lot of students that were gunning for OMFS neglected the general dentistry stuff or looked down on it at the beginning, myself included. You're in dental school to become a dentist first and foremost and 90% of your classes are gonna be about dentistry. So if you don't do well in those classes then your rank won't be high.\n\nI'd say Class rank + CBSE is 80% of your application so really focus in on those. Don't worry about ECs too much or research unless you have free time.", "created_utc": "1654658878.0", "edited": "False", "id": "ibkgg0b", "is_submitter": "True", "link_id": "t3_v70xxb", "parent_id": "t1_ibk7p18", "score": "8", "subreddit": "DentalSchool", "subreddit_id": "t5_2siqo"}, {"author": "NotABrainTumor", "body": "The best way to learn anatomy is repetition. If you guys are doing cadaver, I would go in after hours if possible to familiarize yourself with the relationships between structures. Try not to study it all at once but focus on specific regions- ex infratemporal fossa, oral cavity, anterior neck, etc. Flashcards like Netters or Michigan blue atlas (anki deck) are also super helpful. I found drawing out pathways to be helpful too.", "created_utc": "1654658306.0", "edited": "False", "id": "ibkfgse", "is_submitter": "True", "link_id": "t3_v70xxb", "parent_id": "t1_ibjtsgi", "score": "3", "subreddit": "DentalSchool", "subreddit_id": "t5_2siqo"}, {"author": "NotABrainTumor", "body": "I considered med school but I never took the MCAT. The only med school part of my app was volunteering in a hospital tbh, all the pre-reqs were more or less the same. I studied for the DAT and shadowed a dentist every day over winter and spring break and that was the extent of my dental application lol.\n\nI don't think it's worth it if you only want to do OMFS, but I know quite a few people that did apply to dental only for that reason. However they usually had family members that were OMFS so they probably knew more about the field and had some connections to help ease them in.\n\nMilitary OMFS is less competitive than civilian, I believe a good CBSE scores for military is 60-65 rather than 70-75+ for civilian. I think class rank doesn't matter as much either. Don't know much else about it. \n\nVery few people are truly OMFS or bust. 1st year dental school 20 people were future \"oral surgeons\". 2nd year it was 10. Only 7 took the CBSE. Only 4 did externships and actually applied. If you don't get in then a non-categorical year ( intern) is the way to go. However, many people don't match after 1. I've met a few that had to do 2 or 3 non cats to match, and some that just gave up. There is no published data on the match rate for people that did non-cat years, but the general consensus is that it's significantly lower.", "created_utc": "1654638441.0", "edited": "False", "id": "ibjckb8", "is_submitter": "True", "link_id": "t3_v70xxb", "parent_id": "t1_ibj3qzk", "score": "3", "subreddit": "DentalSchool", "subreddit_id": "t5_2siqo"}, {"author": "NotABrainTumor", "body": "Two ways about it, either do an intern year ( in OMFS) then 2 years med school, followed by 3 years OMFS, gen surg, anesthesia etc. Or start with med school then do all the OMFS stuff later. Usually the med school years are 2-3 or 3-4 so straight into the clinical years. That's why some places make you take step 1 before you graduate dental school.\n\nSome programs pay for med school, unfortunately the vast majority don't. Certain programs would have added 150-300k more to my debt which is why I didn't apply to them.\n\nAs far as losing knowledge from dental school at some programs you can moonlight as a dentist during the med school years so you can keep up with your hand skills. Other places you can't moonlight, or some residents choose not to. But most of the dental school stuff you forget will be reinforced in residency or is unimportant so it's fine.", "created_utc": "1654637891.0", "edited": "False", "id": "ibjbg7w", "is_submitter": "True", "link_id": "t3_v70xxb", "parent_id": "t1_ibj7csy", "score": "1", "subreddit": "DentalSchool", "subreddit_id": "t5_2siqo"}, {"author": "NotABrainTumor", "body": "I don't really recommend studying 1st semester, adjusting to dental school, moving to a new city, etc. is enough stress as is. But what people usually use is UFAP- Uworld (qbank) first aid (reference text) and pathoma ( video series). The vast majority also use sketchy (mnemonic device program) for micro and pharm as well as Boards and Beyond ( video series). If you use all of those and truly understand the content that's honestly all you need to score well.\n\nLearn the content using first aid, school classes, sketchy, pathoma, etc. Then once you have a solid grasp start doing questions from uworld. It's pointless to do questions if you don't know anything.\n\nOn SDN there's lots of info and strategies for CBSE studying for dental students.", "created_utc": "1654633769.0", "edited": "False", "id": "ibj2q3q", "is_submitter": "True", "link_id": "t3_v70xxb", "parent_id": "t1_ibj0o3m", "score": "3", "subreddit": "DentalSchool", "subreddit_id": "t5_2siqo"}, {"author": "NotABrainTumor", "body": "If you are only getting 40% then you have knowledge gaps rather than reasoning gaps. Watching videos might not be working for you, make sure you really understand the content. I would do Uworld blocks by systems for a while and really spend time reading the explanations and trying to understand the other choices.", "created_utc": "1654627849.0", "edited": "False", "id": "ibip404", "is_submitter": "True", "link_id": "t3_v70xxb", "parent_id": "t1_ibio05b", "score": "3", "subreddit": "DentalSchool", "subreddit_id": "t5_2siqo"}, {"author": "NotABrainTumor", "body": "Well the dates were different back then but Mid august, studied 5-6 months. It's only offered 2x a year, usually february and late july so you have to work around that.", "created_utc": "1654627700.0", "edited": "False", "id": "ibiormy", "is_submitter": "True", "link_id": "t3_v70xxb", "parent_id": "t1_ibioits", "score": "2", "subreddit": "DentalSchool", "subreddit_id": "t5_2siqo"}, {"author": "NotABrainTumor", "body": "I started towards the end of 2nd semester D1. I wanted to know my rank and see if I wasn't burned out before taking on additional commitments. Most people start beginning of D2 more or less, but idk if the new cohort has changed. But I know people that decided to pursue OMFS late and started studying 2nd semester D3 so YMMV.", "created_utc": "1654627391.0", "edited": "False", "id": "ibio1z8", "is_submitter": "True", "link_id": "t3_v70xxb", "parent_id": "t1_ibimr1p", "score": "1", "subreddit": "DentalSchool", "subreddit_id": "t5_2siqo"}, {"author": "NotABrainTumor", "body": "Ok long response lol:\n\nWell it seems like everything is an arms race isn't it? Same thing happened with med people but they are pass fail step 1 so it remains to see what will happen. In competitive specialties like ortho,plastics, urology, etc. research years are becoming more and more common. I feel the same will occur with oral surgery- with non-cats becoming more and more common.\n\nRegarding CBSE- I think CBSE scores will keep rising, and people will continue to study earlier for it ( starting D1 instead of D2 or 3). You have 6 attempts technically and I remember 1 or 2 programs requiring all scores reported though this is still rare.\n\nRegarding the South- I am in the south and I believe so. I met applicants nationwide and the autonomy and case volume in the South is unparalleled. But what drew me to OMFS was the hospital and OR stuff so I am biased. 95% of programs will train you to pull out wisdom teeth, basic implants, ORIF mandible/facial fractures, orthognathics, and safely sedate patients- that is what the vast majority of oral surgeons will be doing in private practice. If you want to do frequent le fort 3s, cranial vault reconstruction, Halo distractions, microvascular oncology, etc. then you need to go to specific programs and will probably be an academic affiliate of some sorts after you graduate.\n\nThings to do before residency- After match day ( Jan 24,2022), they gave me a month to study and retake the CBSE, then another month to prepare and take Step 1. Most programs don't do this but mine does. They tell you what you need if you match on their websites.\n\nI entered this field to do the hospital stuff and am planning on doing either full time academics or 60%+ hospital/OR work. If I just wanted to just pull teeth (even wisdom teeth) and do implants I would have been doing that right now as a GP. Even hospital OS makes 3-400k+ and tbh I'm pretty low maintenance.", "created_utc": "1654627244.0", "edited": "False", "id": "ibinpof", "is_submitter": "True", "link_id": "t3_v70xxb", "parent_id": "t1_ibik7ty", "score": "9", "subreddit": "DentalSchool", "subreddit_id": "t5_2siqo"}, {"author": "NotABrainTumor", "body": "No, the scope of practice is exactly the same. The MD serves two major purposes, ego and advertising. It has some benefit for academics and fellowships as well. Roughly 2/3 surgeons are DMD/DDS only while 1/3 have an MD as well.\n\nI want the MD because I am potentially interested in academics and I feel that 2 years to get an MD is a great bargain/ wonderful opportunity to learn more about the human body and become well rounded. I am aware that it will not translate to higher earning power though.", "created_utc": "1654626460.0", "edited": "False", "id": "ibilw0m", "is_submitter": "True", "link_id": "t3_v70xxb", "parent_id": "t1_ibikbq2", "score": "15", "subreddit": "DentalSchool", "subreddit_id": "t5_2siqo"}, {"author": "NotABrainTumor", "body": "Well I did Bio and chem double major, I just say biochem b/c it's shorter. But I don't know you, for me chem was easier since I don't like memorizing things. Other people think bio is easier since you don't have to solve equations/reactions. Is football or basketball harder?", "created_utc": "1654625811.0", "edited": "False", "id": "ibikc9m", "is_submitter": "True", "link_id": "t3_v70xxb", "parent_id": "t1_ibijxt0", "score": "2", "subreddit": "DentalSchool", "subreddit_id": "t5_2siqo"}, {"author": "NotABrainTumor", "body": "Thought about med school in undergrad but my set up wasn't too good and I would have had to take at least 1-2 gap years to prep for that. Figured dental school was better ROI and OMFS was a potential if I liked school. Advice depends on what year you're in, but first step would be join your OMFS club and reach out to upper classmen that are interested. They can tell you which faculty and residents are approachable.", "created_utc": "1654625389.0", "edited": "False", "id": "ibijd32", "is_submitter": "True", "link_id": "t3_v70xxb", "parent_id": "t1_ibidltb", "score": "2", "subreddit": "DentalSchool", "subreddit_id": "t5_2siqo"}, {"author": "NotABrainTumor", "body": "Just work hard and spend your 1st semester getting used to school. Make lots of friends with your classmates and upperclassmen- there are a lot of ins and outs that are school specific and you learn a lot from each other.\n\nDon't worry about shadowing, research, extra curriculars etc. You want to start off on the right foot and it's easier to study less gradually than to study more after slacking off.", "created_utc": "1654625288.0", "edited": "False", "id": "ibij4up", "is_submitter": "True", "link_id": "t3_v70xxb", "parent_id": "t1_ibihf2d", "score": "8", "subreddit": "DentalSchool", "subreddit_id": "t5_2siqo"}, {"author": "NotABrainTumor", "body": "OMFS has 4 year and 6 year tracks. The 4 year track is pure clinical whereas the 6 year track involves anywhere from 14-36+ months of medical school but you get an MD. All OMFS residency programs require 5 months anesthesia as well as a few months of general surgery. \n\nI have 6 years remaining after already doing 4 years of dental school. So a traditional person would do 4 yrs undergrad 4 years dental school 4-6 years OMFS residency for a total of 12-14 years.", "created_utc": "1654625159.0", "edited": "False", "id": "ibiiuan", "is_submitter": "True", "link_id": "t3_v70xxb", "parent_id": "t1_ibiez4d", "score": "9", "subreddit": "DentalSchool", "subreddit_id": "t5_2siqo"}, {"author": "NotABrainTumor", "body": "PRetty much what everyone else said, Dental school alone is 9-5 M-F so that means you're not planning on studying at all lol. I probably put in 60+ hours a week if you include class and lab, during exam or practical weeks even more time.", "created_utc": "1654625029.0", "edited": "False", "id": "ibiijip", "is_submitter": "True", "link_id": "t3_v70xxb", "parent_id": "t1_ibidae5", "score": "8", "subreddit": "DentalSchool", "subreddit_id": "t5_2siqo"}, {"author": "NotABrainTumor", "body": "I did biochem just because it was easiest to get the pre-reqs out of the way. But honestly whatever you want that allows you to do well and get a high overall GPA. You can't really pre-learn the things in dental school so don't worry about being behind if you major in something like English.", "created_utc": "1654624944.0", "edited": "False", "id": "ibiicdg", "is_submitter": "True", "link_id": "t3_v70xxb", "parent_id": "t1_ibibv23", "score": "1", "subreddit": "DentalSchool", "subreddit_id": "t5_2siqo"}, {"author": "NotABrainTumor", "body": "Youtube, fellow classmates, and upper classmen. Reading a textbook unfortunately doesn't help much with doing well in dental school.", "created_utc": "1654620363.0", "edited": "False", "id": "ibi7glo", "is_submitter": "False", "link_id": "t3_v6hhpu", "parent_id": "t3_v6hhpu", "score": "1", "subreddit": "DentalSchool", "subreddit_id": "t5_2siqo"}, {"author": "NotABrainTumor", "body": "I mean 35 D4s from Dallas had to remediate WREB and 40 D4s from Houston are being held back through summer so there's that lol. You win some you lose some", "created_utc": "1654619688.0", "edited": "False", "id": "ibi5ull", "is_submitter": "False", "link_id": "t3_v6llai", "parent_id": "t1_ibhvmge", "score": "6", "subreddit": "DentalSchool", "subreddit_id": "t5_2siqo"}, {"author": "NotABrainTumor", "body": "25, Not a dental student anymore, starting surgical residency in a few weeks (oral and maxillofacial surgery) still making 0$ though lol", "created_utc": "1652072010.0", "edited": "False", "id": "i7vv1mc", "is_submitter": "False", "link_id": "t3_ukgjmb", "parent_id": "t3_ukgjmb", "score": "3", "subreddit": "AsianMasculinity", "subreddit_id": "t5_30c2m"}, {"author": "NotABrainTumor", "body": "CBSE + Grades is 80% of your application. Externships, introducing yourself to faculty and getting to know them, and being a normal person is the other 20%.\n\nExtracurriculars are more because you are a human being with a unique personality and interests. Don't do them for the sake of trying to impress OMFS programs. Ex- I didn't volunteer because that's not me. I did mentor underclassmen because I enjoyed it.", "created_utc": "1647190613.0", "edited": "False", "id": "i0idftd", "is_submitter": "False", "link_id": "t3_tcoo75", "parent_id": "t1_i0i9vr8", "score": "2", "subreddit": "DentalSchool", "subreddit_id": "t5_2siqo"}, {"author": "NotABrainTumor", "body": "My life advice -Do what you want to do because you want to do it.\n\nIt sounds like you started sleeping around just because the world told you that you couldn't, and now you've gone so far down the rabbit hole that it has dominated your personality.\n\nBeing a contrarian/rebel for it's own sake doesn't mean anything, and I believe that is what is giving you that nagging sense of unfulfillment.\n\nIf you enjoy sleeping around, then do it. If it's becoming a drag or taking up too much time then maybe take a break.\n\nPersonal anecdote that somewhat similar- I didn't want to be a doctor growing up because that was the asian stereotype. Later on in college I realized, well actually this really fits my personality and skillset and idgaf if I'm a stereotype if I'm living the life I want to live. Still have 6-8 more years of surgical residency, but it's what I chose and something I'm truly passionate about.\n\nYou're the only one that has to live with yourself, stop focusing on what other people think, this includes \" the world\" and \"changing\" it. External validation and internal validation are not interchangeable.\n\nReading your post reminded me of a would you rather scenario that we used to joke about in high school: Would you rather be married to a girl that looks like a 10/10 to you but a 1/10 to everyone else, or a girl that looks like a 1/10 to you but a 10/10 to the rest of the world?", "created_utc": "1647190372.0", "edited": "False", "id": "i0icv72", "is_submitter": "False", "link_id": "t3_tczgox", "parent_id": "t1_i0ha2m2", "score": "4", "subreddit": "AsianMasculinity", "subreddit_id": "t5_30c2m"}, {"author": "NotABrainTumor", "body": "Don't think so, although Loma Linda in California has a 3 year implantology residency. One of my faculty that is perio-prosth dual trained said he would have done that had he known about it.", "created_utc": "1647188847.0", "edited": "False", "id": "i0i98r0", "is_submitter": "False", "link_id": "t3_tcwbvv", "parent_id": "t3_tcwbvv", "score": "1", "subreddit": "Dentistry", "subreddit_id": "t5_2rpgi"}, {"author": "NotABrainTumor", "body": "Here's some napkin math for you, based on 2022 Dental Match data  \n450 applicants, 237 spots filled.\n\n  \nOf the 237 that matched only 133 were 2022 DDS ( aka 4th year dental students). The rest graduated and were working, doing non-cats, etc.\n\n  \nPenn, Harvard, Columbia if you combine the 3 matched like 40 people this year, and they were all like 90% + match rate or something like that.\n\n  \nSo 1/3 people that match straight out of dental school are from 3 schools ( think there's like 67 nationwide)\n\n  \nNot going to say whether it's the chicken or the egg in this case, but lots of people are from Ivies. \n\nCurrent D4 at a state school and I matched OMFS with no trouble. Personally never would have gone to an Ivy ( was accepted to some), but YMMV.", "created_utc": "1647187975.0", "edited": "False", "id": "i0i77an", "is_submitter": "False", "link_id": "t3_tcoo75", "parent_id": "t1_i0ft36d", "score": "5", "subreddit": "DentalSchool", "subreddit_id": "t5_2siqo"}, {"author": "NotABrainTumor", "body": "PM me", "created_utc": "1641945052.0", "edited": "False", "id": "hsa1zqf", "is_submitter": "False", "link_id": "t3_s1n3bt", "parent_id": "t3_s1n3bt", "score": "1", "subreddit": "DentalSchool", "subreddit_id": "t5_2siqo"}, {"author": "NotABrainTumor", "body": "San Antonio is one of the best GPR programs in the nation, it's a VA program. Think North Carolina, Alabama, also have good ones that focus on OS, implants.", "created_utc": "1639091061.0", "edited": "False", "id": "hnwwwtk", "is_submitter": "False", "link_id": "t3_rc66po", "parent_id": "t3_rc66po", "score": "2", "subreddit": "DentalSchool", "subreddit_id": "t5_2siqo"}, {"author": "NotABrainTumor", "body": "Yes, but not so much that I would have shelled out an additional 100-200K+ for it. Also I'm trying to specialize (current D4), I imagine if I were wanting to go GP I would be even less willing to pay.", "created_utc": "1638918032.0", "edited": "False", "id": "hnng1xr", "is_submitter": "False", "link_id": "t3_ral2tx", "parent_id": "t1_hnjzqzu", "score": "1", "subreddit": "DentalSchool", "subreddit_id": "t5_2siqo"}, {"author": "NotABrainTumor", "body": "No, probably some of the Ivys have it on their websites but you can always email admin for that info. Also that information doesn't really matter, you can specialize from any school.", "created_utc": "1638751570.0", "edited": "False", "id": "hnecoi7", "is_submitter": "False", "link_id": "t3_r9t2f6", "parent_id": "t3_r9t2f6", "score": "2", "subreddit": "DentalSchool", "subreddit_id": "t5_2siqo"}, {"author": "NotABrainTumor", "body": "Current D4 applying OMFS. Have 10+ interviews, am not top 10 in a state dental school. Wanted to do med school but didn't know if I would be competitive enough to match ENT,NSG, Ortho etc. so I chose dentistry. Realized that while I liked working with my hands, the lack of medical knowledge required to be a dentist wasn't really satisfying to me. Also my hand skills sucked relative to my peers ( got Cs in operative 1 and wax lol) and I'm not a legacy/have special connections. Obviously not matched yet but PM me if you have any personal questions.", "created_utc": "1636419736.0", "edited": "1636419940.0", "id": "hjvlbiw", "is_submitter": "False", "link_id": "t3_qpl776", "parent_id": "t3_qpl776", "score": "13", "subreddit": "DentalSchool", "subreddit_id": "t5_2siqo"}, {"author": "NotABrainTumor", "body": "Grades by far. For ortho all the people in my school that are getting 5+ interviews have done research. Network with residents/attendings and ask to shadow in your free time. Club leadership is sort of eh, it's mostly used to get those networking opportunities.", "created_utc": "1633821389.0", "edited": "False", "id": "hg1ezki", "is_submitter": "False", "link_id": "t3_q4bkm5", "parent_id": "t3_q4bkm5", "score": "1", "subreddit": "DentalSchool", "subreddit_id": "t5_2siqo"}, {"author": "NotABrainTumor", "body": "So TLDR: Workout, groom yourself, don't be awkward, and don't be a deadbeat? \n\nI dunno man, it just seems like a lot of work if all of this is done solely for the purpose of getting laid. This sounds like a how to guide to attract influencer chicks.\n\nI'm east asian, but I would never dress up like those k-pop guys just because that's what's popular/ attracts women right now. I'm me, take it or leave it lol. \n\nAlso the money thing- I agree you shouldn't try to buy attraction, but I'm also not gonna take a girl out to Mcdonalds just so I'm not \"betabuxxing\".", "created_utc": "1633642560.0", "edited": "False", "id": "hfs2y3d", "is_submitter": "False", "link_id": "t3_q3h9o8", "parent_id": "t3_q3h9o8", "score": "1", "subreddit": "AsianMasculinity", "subreddit_id": "t5_30c2m"}, {"author": "NotABrainTumor", "body": "One of the Texas schools", "created_utc": "1633635314.0", "edited": "False", "id": "hfrlutt", "is_submitter": "False", "link_id": "t3_q325x0", "parent_id": "t1_hfrg2q9", "score": "3", "subreddit": "DentalSchool", "subreddit_id": "t5_2siqo"}, {"author": "NotABrainTumor", "body": "I'm a D4 at a large state school and if you do the OMFS elective we can do surgical extractions, partial bony impacted wisdom teeth, tori, soft tissue biopsies, etc. There are other electives that let you do crown lengthening, laser gingivectomies, etc. 90% of my school becomes GP after graduation.\n\nGenerally speaking state schools tend to have stronger clinical experience compared to the specialist factory schools like UCLA, harvard, columbia, etc.\n\nIMO MWU and other \"super-GP\" type schools are not worth the extra tuition at all, though I'm not going for GP, so I might be biased.", "created_utc": "1633630717.0", "edited": "False", "id": "hfrard6", "is_submitter": "False", "link_id": "t3_q325x0", "parent_id": "t3_q325x0", "score": "1", "subreddit": "DentalSchool", "subreddit_id": "t5_2siqo"}]